{"id":17992,"no":31,"title":"The Blond Beast II","content":"“My chief aim in life?” Orlando G. Spence repeated. He threw himself back in his chair, straightened the tortoise-shell pince-nez, on his short blunt nose, and beamed down the luncheon table at the two young men who shared his repast. His glance rested on his son Draper, seated opposite him behind a barrier of Georgian silver and orchids; but his words were addressed to his secretary who, stylograph in hand, had turned from the seductions of a mushroom souffle in order to jot down, for the Sunday Investigator, an outline of his employer’s views and intentions respecting the newly endowed Orlando G. Spence College for Missionaries. It was Mr. Spence’s practice to receive in person the journalists privileged to impart his opinions to a waiting world; but during the last few months — and especially since the vast project of the Missionary College had been in process of development — the pressure of business and beneficence had necessitated Millner’s frequent intervention, and compelled the secretary to snatch the sense of his patron’s elucubrations between the courses of their hasty meals. Young Millner had a healthy appetite, and it was not one of his least sacrifices to be so often obliged to curb it in the interest of his advancement; but whenever he waved aside one of the triumphs of Mr. Spence’s chef he was conscious of rising a step in his employer’s favour. Mr. Spence did not despise the pleasures of the table, though he appeared to regard them as the reward of success rather than as the alleviation of effort; and it increased his sense of his secretary’s merit to note how keenly the young man enjoyed the fare which he was so frequently obliged to deny himself. Draper, having subsisted since infancy on a diet of truffles and terrapin, consumed such delicacies with the insensibility of a traveller swallowing a railway sandwich; but Millner never made the mistake of concealing from Mr. Spence his sense of what he was losing when duty constrained him to exchange the fork for the pen. “My chief aim in life!” Mr. Spence repeated, removing his eye-glass and swinging it thoughtfully on his finger. (“I’m sorry you should miss this souffle, Millner: it’s worth while.) Why, I suppose I might say that my chief aim in life is to leave the world better than I found it. Yes: I don’t know that I could put it better than that. To leave the world better than I found it. It wouldn’t be a bad idea to use that as a head-line. ’Wants to leave the world better than he found it.‘ It’s exactly the point I should like to make in this talk about the College.” Mr. Spence paused, and his glance once more reverted to his son, who, having pushed aside his plate, sat watching Millner with a dreamy intensity. “And it’s the point I want to make with you, too, Draper,” his father continued genially, while he turned over with a critical fork the plump and perfectly matched asparagus which a footman was presenting to his notice. “I want to make you feel that nothing else counts in comparison with that — no amount of literary success or intellectual celebrity.” “Oh, I do feel that,” Draper murmured, with one of his quick blushes, and a glance that wavered between his father and Millner. The secretary kept his eyes on his notes, and young Spence continued, after a pause: “Only the thing is — isn’t it? — to try and find out just what does make the world better?” “To try to find out?” his father echoed compassionately. “It’s not necessary to try very hard. Goodness is what makes the world better.” “Yes, yes, of course,” his son nervously interposed; “but the question is, what is good — ” Mr. Spence, with a darkening brow, brought his fist down emphatically on the damask. “I’ll thank you not to blaspheme, my son!” Draper’s head reared itself a trifle higher on his thin neck. “I was not going to blaspheme; only there may be different ways — ” “There’s where you’re mistaken, Draper. There’s only one way: there’s my way,” said Mr. Spence in a tone of unshaken conviction. “I know, father; I see what you mean. But don’t you see that even your way wouldn’t be the right way for you if you ceased to believe that it was?” His father looked at him with mingled bewilderment and reprobation. “Do you mean to say that the fact of goodness depends on my conception of it, and not on God Almighty’s?” “I do . . . yes . . . in a specific sense . . . ” young Draper falteringly maintained; and Mr. Spence turned with a discouraged gesture toward his secretary’s suspended pen. “I don’t understand your scientific jargon, Draper; and I don’t want to. — What’s the next point, Millner? (No; no savarin. Bring the fruit — and the coffee with it.)” Millner, keenly aware that an aromatic savarin au rhum was describing an arc behind his head previous to being rushed back to the pantry under young Draper’s indifferent eye, stiffened himself against this last assault of the enemy, and read out firmly: “ What relation do you consider that a man’s business conduct should bear to his religious and domestic life?” Mr. Spence mused a moment. “Why, that’s a stupid question. It goes over the same ground as the other one. A man ought to do good with his money — that’s all. Go on.” At this point the butler’s murmur in his ear caused him to push back his chair, and to arrest Millner’s interrogatory by a rapid gesture. “Yes; I’m coming. Hold the wire.” Mr. Spence rose and plunged into the adjoining “office,” where a telephone and a Remington divided the attention of a young lady in spectacles who was preparing for Zenana work in the East. As the door closed, the butler, having placed the coffee and liqueurs on the table, withdrew in the rear of his battalion, and the two young men were left alone beneath the Rembrandts and Hobbemas on the dining-room walls. There was a moment’s silence between them; then young Spence, leaning across the table, said in the lowered tone of intimacy: “Why do you suppose he dodged that last question?” Millner, who had rapidly taken an opulent purple fig from the fruit-dish nearest him, paused in surprise in the act of hurrying it to his lips. “I mean,” Draper hastened on, “the question as to the relation between business and private morality. It’s such an interesting one, and he’s just the person who ought to tackle it.” Millner, despatching the fig, glanced down at his notes. “I don’t think your father meant to dodge the question.” Young Draper continued to look at him intently. “You think he imagined that his answer really covers the ground?” “As much as it needs to be covered.” The son of the house glanced away with a sigh. “You know things about him that I don’t,” he said wistfully, but without a tinge of resentment in his tone. “Oh, as to that — (may I give myself some coffee?)” Millner, in his walk around the table to fill his cup, paused a moment to lay an affectionate hand on Draper’s shoulder. “Perhaps I know him better, in a sense: outsiders often get a more accurate focus.” Draper considered this. “And your idea is that he acts on principles he has never thought of testing or defining?” Millner looked up quickly, and for an instant their glances crossed. “How do you mean?” “I mean: that he’s an inconscient instrument of goodness, as it were? A— a sort of blindly beneficent force?” The other smiled. “That’s not a bad definition. I know one thing about him, at any rate: he’s awfully upset at your having chucked your Bible Class.” A shadow fell on young Spence’s candid brow. “I know. But what can I do about it? That’s what I was thinking of when I tried to show him that goodness, in a certain sense, is purely subjective: that one can’t do good against one’s principles.” Again his glance appealed to Millner. “ You understand me, don’t you?” Millner stirred his coffee in a silence not unclouded by perplexity. “Theoretically, perhaps. It’s a pretty question, certainly. But I also understand your father’s feeling that it hasn’t much to do with real life: especially now that he’s got to make a speech in connection with the founding of this Missionary College. He may think that any hint of internecine strife will weaken his prestige. Mightn’t you have waited a little longer?” “How could I, when I might have been expected to take a part in this performance? To talk, and say things I didn’t mean? That was exactly what made me decide not to wait.” The door opened and Mr. Spence re-entered the room. As he did so his son rose abruptly as if to leave it. “Where are you off to, Draper?” the banker asked. “I’m in rather a hurry, sir — ” Mr. Spence looked at his watch. “You can’t be in more of a hurry than I am; and I’ve got seven minutes and a half.” He seated himself behind the coffee — tray, lit a cigar, laid his watch on the table, and signed to Draper to resume his place. “No, Millner, don’t you go; I want you both.” He turned to the secretary. “You know that Draper’s given up his Bible Class? I understand it’s not from the pressure of engagements — ” Mr. Spence’s narrow lips took an ironic curve under the straight-clipped stubble of his moustache — “it’s on principle, he tells me. He’s principled against doing good!” Draper lifted a protesting hand. “It’s not exactly that, father — ” “I know: you’ll tell me it’s some scientific quibble that I don’t understand. I’ve never had time to go in for intellectual hair-splitting. I’ve found too many people down in the mire who needed a hand to pull them out. A busy man has to take his choice between helping his fellow-men and theorizing about them. I’ve preferred to help. (You might take that down for the Investigator, Millner.) And I thank God I’ve never stopped to ask what made me want to do good. I’ve just yielded to the impulse — that’s all.” Mr. Spence turned back to his son. “Better men than either of us have been satisfied with that creed, my son.” Draper was silent, and Mr. Spence once more addressed himself to his secretary. “Millner, you’re a reader: I’ve caught you at it. And I know this boy talks to you. What have you got to say? Do you suppose a Bible Class ever hurt anybody?” Millner paused a moment, feeling all through his nervous system the fateful tremor of the balance. “That’s what I was just trying to tell him, sir — ” “Ah; you were? That’s good. Then I’ll only say one thing more. Your doing what you’ve done at this particular moment hurts me more, Draper, than your teaching the gospel of Jesus could possibly have hurt those young men over in Tenth Avenue.” Mr. Spence arose and restored his watch to his pocket. “I shall want you in twenty minutes, Millner.” The door closed on him, and for a while the two young men sat silent behind their cigar fumes. Then Draper Spence broke out, with a catch in his throat: “That’s what I can’t bear, Millner, what I simply can’t bear: to hurt him, to hurt his faith in me! It’s an awful responsibility, isn’t it, to tamper with anybody’s faith in anything?”","sourceLink":"http://novel.tingroom.com/jingdian/1348/40510.html","bookId":1467,"book":{"id":1467,"title":"Tales of Men and Ghosts","description":"简介： Down his spine he felt the man\u0027s injured stare. Mr. Granice had always been so mild-spoken to his people -- no doubt the odd change in his manner had already been noticed and discussed below stairs. And very likely they suspected the cause. He stood...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1348","creation":"Aug 1, 2019 12:25:11 AM","modification":"Aug 1, 2019 12:25:11 AM"}}
