{"id":18000,"no":39,"title":"Afterward V","content":"“I don’t say it wasn’t straight, yet don’t say it was straight. It was business.” \\n\\n \\n\\n Mary, at the words, lifted her head with a start, and looked intently at the speaker. \\n\\n \\n\\n When, half an hour before, a card with “Mr. Parvis” on it had been brought up to her, she had been immediately aware that the name had been a part of her consciousness ever since she had read it at the head of Boyne’s unfinished letter. In the library she had found awaiting her a small neutral-tinted man with a bald head and gold eye-glasses, and it sent a strange tremor through her to know that this was the person to whom her husband’s last known thought had been directed. \\n\\n \\n\\n Parvis, civilly, but without vain preamble, — in the manner of a man who has his watch in his hand, — had set forth the object of his visit. He had “run over” to England on business, and finding himself in the neighborhood of Dorchester, had not wished to leave it without paying his respects to Mrs. Boyne; without asking her, if the occasion offered, what she meant to do about Bob Elwell’s family. \\n\\n \\n\\n The words touched the spring of some obscure dread in Mary’s bosom. Did her visitor, after all, know what Boyne had meant by his unfinished phrase? She asked for an elucidation of his question, and noticed at once that he seemed surprised at her continued ignorance of the subject. Was it possible that she really knew as little as she said? \\n\\n \\n\\n “I know nothing — you must tell me,” she faltered out; and her visitor thereupon proceeded to unfold his story. It threw, even to her confused perceptions, and imperfectly initiated vision, a lurid glare on the whole hazy episode of the Blue Star Mine. Her husband had made his money in that brilliant speculation at the cost of “getting ahead” of some one less alert to seize the chance; the victim of his ingenuity was young Robert Elwell, who had “put him on” to the Blue Star scheme. \\n\\n \\n\\n Parvis, at Mary’s first startled cry, had thrown her a sobering glance through his impartial glasses. \\n\\n \\n\\n “Bob Elwell wasn’t smart enough, that’s all; if he had been, he might have turned round and served Boyne the same way. It’s the kind of thing that happens every day in business. I guess it’s what the scientists call the survival of the fittest,” said Mr. Parvis, evidently pleased with the aptness of his analogy. \\n\\n \\n\\n Mary felt a physical shrinking from the next question she tried to frame; it was as though the words on her lips had a taste that nauseated her. \\n\\n \\n\\n “But then — you accuse my husband of doing something dishonorable?” \\n\\n \\n\\n Mr. Parvis surveyed the question dispassionately. “Oh, no, I don’t. I don’t even say it wasn’t straight.” He glanced up and down the long lines of books, as if one of them might have supplied him with the definition he sought. “I don’t say it wasn’t straight, and yet I don’t say it was straight. It was business.” After all, no definition in his category could be more comprehensive than that. \\n\\n \\n\\n Mary sat staring at him with a look of terror. He seemed to her like the indifferent, implacable emissary of some dark, formless power. \\n\\n \\n\\n “But Mr. Elwell’s lawyers apparently did not take your view, since I suppose the suit was withdrawn by their advice.” \\n\\n \\n\\n “Oh, yes, they knew he hadn’t a leg to stand on, technically. It was when they advised him to withdraw the suit that he got desperate. You see, he’d borrowed most of the money he lost in the Blue Star, and he was up a tree. That’s why he shot himself when they told him he had no show.” \\n\\n \\n\\n The horror was sweeping over Mary in great, deafening waves. \\n\\n \\n\\n “He shot himself? He killed himself because of that?” \\n\\n \\n\\n “Well, he didn’t kill himself, exactly. He dragged on two months before he died.” Parvis emitted the statement as unemotionally as a gramophone grinding out its “record.” \\n\\n \\n\\n “You mean that he tried to kill himself, and failed? And tried again?” \\n\\n \\n\\n “Oh, he didn’t have to try again,” said Parvis, grimly. \\n\\n \\n\\n They sat opposite each other in silence, he swinging his eye-glass thoughtfully about his finger, she, motionless, her arms stretched along her knees in an attitude of rigid tension. \\n\\n \\n\\n “But if you knew all this,” she began at length, hardly able to force her voice above a whisper, “how is it that when I wrote you at the time of my husband’s disappearance you said you didn’t understand his letter?” \\n\\n \\n\\n Parvis received this without perceptible discomfiture. “Why, I didn’t understand it — strictly speaking. And it wasn’t the time to talk about it, if I had. The Elwell business was settled when the suit was withdrawn. Nothing I could have told you would have helped you to find your husband.” \\n\\n \\n\\n Mary continued to scrutinize him. “Then why are you telling me now?” \\n\\n \\n\\n Still Parvis did not hesitate. “Well, to begin with, I supposed you knew more than you appear to — I mean about the circumstances of Elwell’s death. And then people are talking of it now; the whole matter’s been raked up again. And I thought, if you didn’t know, you ought to.” \\n\\n \\n\\n She remained silent, and he continued: “You see, it’s only come out lately what a bad state Elwell’s affairs were in. His wife’s a proud woman, and she fought on as long as she could, going out to work, and taking sewing at home, when she got too sick — something with the heart, I believe. But she had his bedridden mother to look after, and the children, and she broke down under it, and finally had to ask for help. That attracted attention to the case, and the papers took it up, and a subscription was started. Everybody out there liked Bob Elwell, and most of the prominent names in the place are down on the list, and people began to wonder why — ” \\n\\n \\n\\n Parvis broke off to fumble in an inner pocket. “Here,” he continued, “here’s an account of the whole thing from the ‘Sentinel’ — a little sensational, of course. But I guess you’d better look it over.” \\n\\n \\n\\n He held out a newspaper to Mary, who unfolded it slowly, remembering, as she did so, the evening when, in that same room, the perusal of a clipping from the “Sentinel” had first shaken the depths of her security. \\n\\n \\n\\n As she opened the paper, her eyes, shrinking from the glaring head-lines, “Widow of Boyne’s Victim Forced to Appeal for Aid,” ran down the column of text to two portraits inserted in it. The first was her husband’s, taken from a photograph made the year they had come to England. It was the picture of him that she liked best, the one that stood on the writing-table up-stairs in her bedroom. As the eyes in the photograph met hers, she felt it would be impossible to read what was said of him, and closed her lids with the sharpness of the pain. \\n\\n \\n\\n “I thought if you felt disposed to put your name down — ” she heard Parvis continue. \\n\\n \\n\\n She opened her eyes with an effort, and they fell on the other portrait. It was that of a youngish man, slightly built, in rough clothes, with features somewhat blurred by the shadow of a projecting hat-brim. Where had she seen that outline before? She stared at it confusedly, her heart hammering in her throat and ears. Then she gave a cry. \\n\\n \\n\\n “This is the man — the man who came for my husband!” \\n\\n \\n\\n She heard Parvis start to his feet, and was dimly aware that she had slipped backward into the corner of the sofa, and that he was bending above her in alarm. With an intense effort she straightened herself, and reached out for the paper, which she had dropped. \\n\\n \\n\\n “It’s the man! I should know him anywhere!” she cried in a voice that sounded in her own ears like a scream. \\n\\n \\n\\n Parvis’s voice seemed to come to her from far off, down endless, fog-muffled windings. \\n\\n \\n\\n “Mrs. Boyne, you’re not very well. Shall I call somebody? Shall I get a glass of water?” \\n\\n \\n\\n “No, no, no!” She threw herself toward him, her hand frantically clenching the newspaper. “I tell you, it’s the man! I know him! He spoke to me in the garden!” \\n\\n \\n\\n Parvis took the journal from her, directing his glasses to the portrait. “It can’t be, Mrs. Boyne. It’s Robert Elwell.” \\n\\n \\n\\n “Robert Elwell?” Her white stare seemed to travel into space. “Then it was Robert Elwell who came for him.” \\n\\n \\n\\n “Came for Boyne? The day he went away?” Parvis’s voice dropped as hers rose. He bent over, laying a fraternal hand on her, as if to coax her gently back into her seat. “Why, Elwell was dead! Don’t you remember?” \\n\\n \\n\\n Mary sat with her eyes fixed on the picture, unconscious of what he was saying. \\n\\n \\n\\n “Don’t you remember Boyne’s unfinished letter to me — the one you found on his desk that day? It was written just after he’d heard of Elwell’s death.” She noticed an odd shake in Parvis’s unemotional voice. “Surely you remember that!” he urged her. \\n\\n \\n\\n Yes, she remembered: that was the profoundest horror of it. Elwell had died the day before her husband’s disappearance; and this was Elwell’s portrait; and it was the portrait of the man who had spoken to her in the garden. She lifted her head and looked slowly about the library. The library could have borne witness that it was also the portrait of the man who had come in that day to call Boyne from his unfinished letter. Through the misty surgings of her brain she heard the faint boom of half-forgotten words — words spoken by Alida Stair on the lawn at Pangbourne before Boyne and his wife had ever seen the house at Lyng, or had imagined that they might one day live there. \\n\\n \\n\\n “This was the man who spoke to me,” she repeated. \\n\\n \\n\\n She looked again at Parvis. He was trying to conceal his disturbance under what he imagined to be an expression of indulgent commiseration; but the edges of his lips were blue. “He thinks me mad; but I’m not mad,” she reflected; and suddenly there flashed upon her a way of justifying her strange affirmation. \\n\\n \\n\\n She sat quiet, controlling the quiver of her lips, and waiting till she could trust her voice to keep its habitual level; then she said, looking straight at Parvis: “Will you answer me one question, please? When was it that Robert Elwell tried to kill himself?” \\n\\n \\n\\n “When — when?” Parvis stammered. \\n\\n \\n\\n “Yes; the date. Please try to remember.” \\n\\n \\n\\n She saw that he was growing still more afraid of her. “I have a reason,” she insisted gently. \\n\\n \\n\\n “Yes, yes. Only I can’t remember. About two months before, I should say.” \\n\\n \\n\\n “I want the date,” she repeated. \\n\\n \\n\\n Parvis picked up the newspaper. “We might see here,” he said, still humoring her. He ran his eyes down the page. “Here it is. Last October — the — ” \\n\\n \\n\\n She caught the words from him. “The 20th, wasn’t it?” With a sharp look at her, he verified. “Yes, the 20th. Then you did know?” \\n\\n \\n\\n “I know now.” Her white stare continued to travel past him. “Sunday, the 20th — that was the day he came first.” \\n\\n \\n\\n Parvis’s voice was almost inaudible. “Came here first?” \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n “You saw him twice, then?” \\n\\n \\n\\n “Yes, twice.” She breathed it at him with dilated eyes. “He came first on the 20th of October. I remember the date because it was the day we went up Meldon Steep for the first time.” She felt a faint gasp of inward laughter at the thought that but for that she might have forgotten. \\n\\n \\n\\n Parvis continued to scrutinize her, as if trying to intercept her gaze. \\n\\n \\n\\n “We saw him from the roof,” she went on. “He came down the lime-avenue toward the house. He was dressed just as he is in that picture. My husband saw him first. He was frightened, and ran down ahead of me; but there was no one there. He had vanished.” \\n\\n \\n\\n “Elwell had vanished?” Parvis faltered. \\n\\n \\n\\n “Yes.” Their two whispers seemed to grope for each other. “I couldn’t think what had happened. I see now. He tried to come then; but he wasn’t dead enough — he couldn’t reach us. He had to wait for two months; and then he came back again — and Ned went with him.” \\n\\n \\n\\n She nodded at Parvis with the look of triumph of a child who has successfully worked out a difficult puzzle. But suddenly she lifted her hands with a desperate gesture, pressing them to her bursting temples. \\n\\n \\n\\n “Oh, my God! I sent him to Ned — I told him where to go! I sent him to this room!” she screamed out. \\n\\n \\n\\n She felt the walls of the room rush toward her, like inward falling ruins; and she heard Parvis, a long way off, as if through the ruins, crying to her, and struggling to get at her. But she was numb to his touch, she did not know what he was saying. Through the tumult she heard but one clear note, the voice of Alida Stair, speaking on the lawn at Pangbourne. \\n\\n \\n\\n “You won’t know till afterward,” it said. “You won’t know till long, long afterward.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1348/40518.html","bookId":1467,"book":{"id":1467,"title":"Tales of Men and Ghosts","description":"简介： Down his spine he felt the man\u0027s injured stare. Mr. Granice had always been so mild-spoken to his people -- no doubt the odd change in his manner had already been noticed and discussed below stairs. And very likely they suspected the cause. He stood...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1348","creation":"Aug 1, 2019 12:25:11 AM","modification":"Aug 1, 2019 12:25:11 AM"}}
