{"id":97614,"no":9,"title":"Page 9","content":"Brattleboro, Vermont\n Tori had always loved the autumnal equinox for its meditations on gratitude. Over the past century, the comparatively small earthwitch community - the true elementals, they sometimes called themselves - had co-opted bits and pieces of ritual from other pagan groups\u0027 ceremonies. But they all recognized that harvest season was a time to be grateful for what the goddess provided and for all of the blessings in one\u0027s life. At the same time, there was a melancholy air about the arrival of the dark season, an acknowledgement that every season of growing must come to an end, that every summer leads to winter, tempered by the joyful knowledge of spring\u0027s rebirth.\n Bittersweet, then. Like life. Tori had seen ugliness and cruelty in her life, but had found far more joy and beauty, and she believed that was both her choice and her gift . . . to be open to receiving the beauty that her life and her world had to offer.\n Taking in a deep breath of the cool September air, she exhaled with a smile and glanced around the circle at her sisters and brothers who had made the pilgrimage to be here with her and Cat tonight. Her heart ached that Keomany was not among them, but she was so happy to have Heather and Jaleesa, Vicky and Ella, and so many of the others there with them.\n The move to the clearing behind Row 46 had gone well. It wasn\u0027t the perfect location, the ground not quite as aesthetically pleasing and the apple trees not quite as robust, but it would do nicely. The altar had been built from boards cut from the oldest tree at Summerfields, the cloth that covered it handwoven by Ella, a gift at last year\u0027s celebration.\n They had sung and danced and passed cups of wine around the circle, then poured the rest of the wine into the earth as a blessing. Now each of the earthwitches held up the apples they had been given when the ritual began and the small ceremonial dagger each of them had brought along. The daggers were special to each of them, etched with personal thoughts or the names of dead loved ones, handles decorated with dried husks or polished stones or twines of hair from beloved pets or children, so that they were an extension both of earthwitch and earth mother, of human and goddess.\n Cat moved to the center of the circle. There were late season flowers in her hair and she wore only the sheerest, plainest white dress, which clung to her every curve in alluring fashion. Tori\u0027s heart quickened at the sight of her, and she smiled. Look at that dress, she thought. And she wonders why I get horny during these things.\n She knew some pagan circles engaged in sexual rituals during these celebrations, but she\u0027d never known earthwitches to go that far. Nudity, yes - Jaleesa was gloriously naked even now, the moonlight gleaming on her dark skin - but that was a personal choice, related to sexuality but not to sex. No one would be fucking in this circle.\n At least not until later, Tori thought, almost giggling.\n What is wrong with you? Focus!\n She inhaled deeply. Exhaled, and a new sadness settled over her. No, she was lying to herself. This sorrow had not just arrived; she had been carrying it with her all day. The new growth in the other clearing - the secret they had kept from the eyes of passersby with a makeshift fence - gave her a hope of which she dared not speak. Surely part of it was Keomany, but until they knew precisely what it was, she would still grieve. Would the thing in the clearing, that wood sprite rooted to the soil, open its eyes and speak to them? Would it know them?\n Tori knew she was meant to be focused on her gratitude and on the balance that the goddess gave the world, but she found it so difficult. Her thoughts kept slipping, her subconscious distracting her. Tonight they celebrated the equinox, recognized that they were halfway through the wheel of the year. Despite the gifts of the harvest, it was a time of endings, and the beginning of a turn toward darkness. They spoke prayers to the goddess, Gaea, the soul of the Earth, thankful for abundance and hopeful that others who were less fortunate would receive abundance of their own. They recognized the balance between light and darkness, standing precipitously in this moment when the sun and shadow were equal partners.\n But Keomany was dead, and this new thing was growing in her place. What would it mean when it was ready to be harvested?\n The sound of Cat clearing her throat made Tori blink and glance around. She\u0027d been ruminating and had missed her cue. The prayer was done and the others were cutting their apples. With a nervous smile, trying to reassure Cat that she was all right, she pushed her dagger through the skin of the apple. The juice ran down onto her hand and the bittersweet smell filled her nostrils, and somehow that made it all right.\n She exhaled again, focusing on the apple. It would be all right. Whatever was happening to Keomany, it had to be what Gaea wanted, and that would be what was for the best. She cut through the apple, evenly separating the top from the bottom and tossing the bottom half so that it rolled toward the altar. Two dozen apple halves collected around Cat\u0027s feet.\n Tori held up the top half of the apple, looking at the five-pointed star pattern left behind when the core had been halved. The wind picked up and she felt a refreshing, cleansing chill. Shivering, she turned the sliced part of the apple toward the center of the circle, as did all of the gathered earthwitches, so that each of them could see the others\u0027 fruit.\n \u0027We have come to the dusk of the year, my friends,\u0027 Cat began, loudly enough so they could all hear. \u0027The moment of balance is upon us. Thankful for all the goddess has given us, we approach the season of long nights by offering our respect to dark mother winter, that we may - like bare branches on Gaea\u0027s tree - blossom once more in spring.\u0027\n She paused and glanced at Tori, gentle love in her eyes.\n \u0027Now, each of us will tell the goddess what she is most grateful for,\u0027 Cat went on. \u0027Who would like to begin?\u0027\n \u0027I\u0027ll start,\u0027 Heather said softly.\n They all turned to her. Tori smiled encouragement at her. Heather could be shy at times like this. The woman used her dagger to prise out a seed from her apple core, and as it fell to the ground at her feet, she began reciting her blessings.\n \u0027First, that I am blessed with such friends,\u0027 she said.\n Behind her, the night unfurled.\n White hands coalesced out of darkness, grabbed fistfuls of Heather\u0027s hair and yanked her head back. Her eyes flashed with anger and alarm, but not quite fear - Heather didn\u0027t have time for fear. The vampire darted in and sank its teeth into the pale flesh of her neck, twisted to dig in like a dog worrying a bone, and tore out her throat. Blood fountained onto the monster\u0027s face and he cocked his head back to let the spray fill his mouth for a moment before he snapped her neck and tossed her aside like a broken doll.\n Only now did the screaming begin. It had happened so quickly that there\u0027d been no time for the terror to take hold. As her sisters and some of their guests began to shriek around her, Tori could only stand, gape-mouthed, and stare at the vampire who stood proudly where Heather had been only heartbeats ago. A redheaded man, pale and freckled and long-boned, in life he must have looked kindly enough. Tonight, he wore a woman\u0027s blood like war paint, and he smiled when he saw Tori staring at him.\n Smiled, and started toward her.\n Tori took a step back, blinking as if waking from a trance. No, she thought. No, no, no.\n Cat saw him coming and stepped into his path. She held her arms out, palms up, and started praying. Tori couldn\u0027t breathe; she felt sick. Cat had some magic, but she was no elemental. They all knew some earthcraft, but none of them had Keomany\u0027s power or skill or connection to the soul of the world.\n \u0027Not another fucking step,\u0027 Cat shouted at the vampire, all fierce bravado. To her credit, the wind began to spin around her as if a private little storm were brewing.\n The vampire laughed.\n And then the others appeared. A small puff of autumn mist became a towering Amazon of a woman who leaped upon a young witch from Maine. Her biker boyfriend tried to come to her rescue, grabbing hold of the vampire Amazon, but the monster barely noticed his attack. A third vampire appeared, then a fourth and fifth. Amidst the screams, some of the earthwitches broke and ran for it, including Vicky, who vanished into the moonlit orchard at a sprint with a white-haired vampire in pursuit.\n Tori didn\u0027t have time to mourn for Vicky. Heather\u0027s killer had paused, watching Cat curiously, waiting for some further evidence of magic from her. When lightning did not sear down from the sky to incinerate him, he started toward her again. But Tori wasn\u0027t going to let Cat die for her . . . or die at all!\n The house, she thought. Their only chance was to get out of there, to get into the house. Keomany had put wards on the entire structure, not just the doors and windows. If they could reach home, they would be safe.\n Tori took a breath. Cat had always been more powerful, had a better rapport with Gaea. But growing up, she\u0027d had more than a trace of magic herself, even before she\u0027d become an earthwitch. It had lain mostly dormant, but she had never believed that spark had been completely gone. It had settled deep into her heart, becoming her passion for the world and for life, inspiring her love for Cat.\n \u0027Cat, run!\u0027 Tori called.\n But Cat would not run. Tori knew that. The redheaded vampire slipped up to her almost like a dancer. Around the circle, its sacred blessing now soiled by the blood of innocents, their friends wept and fought and screamed. Cat pushed her hands out and the wind blew the redhead backward half a dozen feet, knocking him off balance so that he fell to his knees.\n The vampire rose so quickly it seemed he\u0027d never gone down, anger flickering in his eyes.\n \u0027Better be quick with you, I guess,\u0027 he said, the words low but clear.\n Tori reached out to Gaea. With all the prayers she had ever said to the goddess she had almost never asked for anything for herself. She had been grateful, she had offered her love, she had woven small magics to help their crops grow and she had tried to lure the rain. Tonight her heart cried out to the goddess for help, and when she reached out with her soul, she felt herself touch the soul of the earth in a way she never had before. The connection filled her like a newborn\u0027s first breath, made her shudder and weep, and she fell to the ground.\n Drove her fingers into the dirt.\n Felt it move.\n The earth shook and then split, opening up beneath the redheaded vampire. He fell in, and though she was twenty feet away, when Tori dragged her fingers through the soil it closed over him.\n In shock, she fell backward. The connection with Gaea broke. Cat came running toward her, glancing about in fear, screaming to the rest of them to run. She reached for Tori, took her hand and hauled her up. Tori wanted to kiss her, but that was crazy. Their friends were dying. No times for kisses.\n The house, she thought again. The wards.\n Cat took her hand, and Tori counted vampires. Four. Maybe she and Cat could make it. A few others, too. Many of their friends were going to die and the thought broke parts of her, deep inside, but maybe some of them could make it. Time had slowed, but really it had only been thirty or forty seconds since Heather had been murdered. Maybe they could live.\n Then she saw the mist coming out of the scar in the ground where she\u0027d buried the redhead, saw him begin to coalesce, and she knew she\u0027d been foolish. They were going to die.\n Tori stopped. Frantic, Cat tried to pull her onward.\n \u0027Hush,\u0027 Tori said, curling a hand behind her neck. \u0027Kiss me.\u0027\n Cat looked startled for an instant, and then her face collapsed into the sorrow of understanding. When Tori stood on tiptoe to kiss her, Cat held her close and luxuriated in the kiss.\n Furious, the redhead screamed and launched himself across the clearing toward him. The Amazon vampire started toward them as well, but the redhead shouted, warning her off.\n \u0027The dykes are mine!\u0027 he snarled.\n The ground began to tremble again. Tori paused, her lips still brushing Cat\u0027s. Neither of them was doing this, and she doubted any of the others had this kind of magic, except maybe Jaleesa?\n Cat screamed as the redhead grabbed a fistful of her hair and yanked her backward, twisting to hurl her to the ground, so much stronger than any human could be. Cat tried to scramble to her feet and the vampire kicked her in the chest. The sound made Tori wince; surely something had broken just now.\n She cried out her lover\u0027s name as the vampire turned toward her.\n \u0027You want to try that shit again, bitch?\u0027 he sneered.\n \u0027I . . .\u0027 she started. \u0027I don\u0027t-\u0027\n A thick root shot from the ground and speared him through the heart. Impaled, he hung there with a ridiculous, stunned expression on his face, and he began to decay, rotting away before her eyes.\n \u0027Holy shit, Tori,\u0027 Cat said, staggering to her feet, holding onto her ribs. \u0027I can\u0027t believe you just-\u0027\n Tori shook her head, still wide-eyed. \u0027I didn\u0027t.\u0027\n The ground rumbled, and Tori knew it wasn\u0027t over.\n \u0027Here!\u0027 she yelled, racing toward the altar at the center of the clearing. \u0027If you can, gather with us!\u0027\n Jaleesa was alive, but bleeding. She ran toward them, and Ella came from the other direction. Others appeared from the orchard, fighting the urge to flee, knowing that if they were alone in the rows of apple trees the vampires would find them. It was counterintuitive to come back, but this was the trust they had in Tori and Cat, and the knowledge that they had no other chance.\n Vampires leaped from their other victims, giving chase to those attempting to gather around the altar. An ugly, twisted leech laughed as he lunged, tackling Ella around the waist. Others screamed her name, and one of the guys who\u0027d come with his wife for the equinox ran toward them, brave and foolish.\n A trio of roots burst from the ground and punched through the ugly vampire, transfixing him on the spot. Others shot from the earth all around them, stabbing through the other vampires. The ground shook and the soil churned, and now Tori could see the dirt moving as thick roots snaked underneath the clearing . . . more and more of them. They thrust up from the ground, nowhere near the vampires now, and as Ella and her would-be rescuer raced back to the altar, roots shot up behind them, quickly weaving a kind of cage around the ritual\u0027s survivors.\n The Amazonian vampire laughed. \u0027You don\u0027t think that\u0027s going to keep us out?\u0027\n A root the size of a tree trunk shot through her, obliterating the core of her torso, and she practically exploded in a cloud of ash.\n The one who\u0027d tried to kill Ella growled and turned to mist, drifting off of the spears that had impaled him and reforming beside them.\n \u0027One of those went through my heart,\u0027 the ugly leech said. \u0027But it\u0027s all about faith . . . all about what we believed before Cortez turned us. He wants us to sleep during the day, I can do that. But I know what this body can do, that it isn\u0027t the heart but sheer force of fucking will that holds us together. You\u0027re not going to kill me like the others.\u0027\n Another root thrust from the ground, shooting through his back - through his spine and his heart - and he roared in pain.\n Maybe it wouldn\u0027t kill him, but it had certainly hurt. And the other two remaining vampires didn\u0027t look quite so confident anymore.\n Tori smiled at them, terrified and sick with grief, but faking confidence as best she could.\n \u0027We can do this all night,\u0027 she said.\n \u0027What?\u0027 Cat whispered. \u0027What can we do? Are you doing this, \u0027cause I\u0027m sure not!\u0027\n Tori shook her head, the spark of hope that had formed in her chest growing brighter.\n \u0027Not me,\u0027 she whispered. \u0027Don\u0027t you see?\u0027\n \u0027See what?\u0027\n Tori took her hand and squeezed it, then nodded toward another part of the orchard, not so very far away, where a fence had been erected to shield a strange new growth from prying eyes.\n \u0027It\u0027s Keomany.\u0027\n Pollepel Island, New York\n Charlotte stood on the prow of the twenty-five-foot military boat, one hand on the railing and the other clutching Sergeant Omondi\u0027s binoculars.\n \u0027This has to be a joke,\u0027 she said.\n Omondi, who had given every appearance of being devoid of humor, frowned at her with what she had come to think of as Facial Expression B. Thus far he seemed not to have a C.\n \u0027What do you mean, a joke?\u0027 Omondi asked, raising his voice to be heard over the thrum of the engine and the wind and the spray of water in their faces. \u0027This is a perfect place for Cortez to make a nest. A coven could go for months here without discovery.\u0027\n The boat skimmed the water, thumping over the churning river at high speed. Charlotte handed the night-vision binoculars back to Omondi - she had her own night vision, born of the changes that death and Cortez had wrought on her cellular structure. And they were near enough the island now that the crumbling edifice began to come into looming focus ahead.\n \u0027It\u0027s just so fucking trite,\u0027 she called back.\n Omondi looked thoughtful but did not reply. The two of them stood together on the prow as they sped north on the Hudson River, even as half a dozen other boats did the same, spread out to left and right and all of them converging on Pollopel Island. Against the indigo sky, the jagged ruin of a medieval castle seemed to stab at the night. Broken walls stood by themselves, slanted wreckage all that remained where entire wings had been. The main body of the castle had a skeletal quality, the rear of it simply gone. The windows were like dark eyes that showed only empty sky beyond. Ghosts, watching them slide along the river.\n By now, the vampires would have heard them coming. They would lurk unseen in those windows, so Charlotte told herself that the shiver going through her was entirely logical. She felt as if she were being watched because she was being watched.\n Sergeant Omondi touched his collar. \u0027Sharpshooters, watch the castle\u0027s airspace!\u0027 he called into his commlink.\n They\u0027d placed a single soldier on top of the small wheelhouse on each of the seven swift boats. The way the hulls were skipping off the water, Charlotte couldn\u0027t imagine that anyone would be able to manage a decent aim, but still the sharpshooters used night scopes to watch the sky above the crumbling ruin. If a bat took flight - or anything else for that matter - their job was to hit it with a Medusa-laced bullet.\n Charlotte left watching the skies to the men and women with rifles. Her eyes were on the castle itself, scanning for any sign that the rotting architecture was anything other than abandoned. Nothing moved that did not seem stirred by the breeze. She wondered if the TFV soldiers sent along on this mission were nervous; surely they\u0027d have preferred to attack during the day. But then she remembered that this was what they did, day in and day out: hunt vampires. No - kill vampires, like her. After that, she stopped wondering if they were afraid.\n \u0027I can\u0027t believe this place is just sitting here,\u0027 she said, mostly to hear her own voice. \u0027It\u0027s like a tornado picked up a chunk of some forgotten corner of Europe and dropped it down in the middle of the river.\u0027\n Omondi had already briefed her on the island, and the ominous, deteriorating pile of stones that had once been something grand. A man named Francis Bannerman had bought up surplus weapons from the US Army after the Civil War and the Spanish American War, rightly thinking there would be a market for these items later on. When the city of New York would no longer allow him to store his arsenal there, he had bought the island and spent most of the first decade of the twentieth century building the castle. According to Omondi, all of the structures on the island had been built without right angles, though it was tough to confirm that with only portions of the castle still standing after the fire that had gutted it fifty years ago.\n For the first time since coming in view of the place, Charlotte tore her gaze away.\n \u0027Sergeant? What you said before about the place having no right angles? Why did Bannerman build it like that?\u0027\n Omondi gave her Expression B. \u0027Superstition.\u0027\n \u0027That\u0027s not too vague. Oh, wait . . . it is.\u0027\n Expression A. Stoic and sage. \u0027Stories about the island being haunted go back to the seventeenth century. Local natives claimed it was inhabited by spirits. Some old legends suggest that a building without corners confuses ghosts so much that they get lost and lose any malice they might have had toward the living. Bannerman\u0027s grandson once wrote that he believed the island was inhabited by goblins who would reclaim the turrets and towers after all the people were gone, or something like that.\u0027\n Charlotte listened, staring at him, and then shook her head.\n \u0027Christ\u0027s sake,\u0027 she said.\n \u0027Does that trouble you?\u0027 Omondi said, over the wind and the engine.\n She grinned. \u0027You mean does it creep me out? No. It\u0027s just so fucking cliche. This whole thing . . . I mean, just look at the place. It looks like the set of some Hollywood movie that they threw up and then left behind.\u0027\n Omondi found a third expression. His lip curled in amusement and he raised an eyebrow. Charlotte was proud of him.\n The boat\u0027s pilot throttled down and she turned to see that they were almost at the shore, a rocky fringe of stone and dirt that ringed a tall hill of jutting stone and evergreen woods, all capped by the skeleton of the castle. It did look like nothing more than a fa\u0026ccedil;ade, as if she could walk behind it and find that it was only two-dimensional, with two-by-fours propping it up in the back.\n Now that she thought about it, she realized that the place was perfect for Cortez. His whole philosophy was to return vampires to the creatures of dread and darkness that they had been in legend and popular culture for centuries. Nightwalkers, blood-drinkers, bats flying across the moon. Cortez had embraced all of that in the same way that Hannibal had, once upon a time, but with himself as the alpha vampire. The way Charlotte had it figured, Cortez wanted to build his coven quietly, under the radar, and all around the world, so that by the time the UN found out about it, there would be too many of them to destroy easily. It seemed obvious that the one person who stood in the way of that plan was Peter Octavian. Cortez needed to take Octavian out of the equation. Charlotte assumed that killing Nikki had been phase one of that.\n A shudder went through her. Her eyes fluttered closed and shards of memory stabbed at her mind and heart, images of Cortez\u0027s vampire thugs above her, beating her . . . taking her . . . raping her . . . and then Cortez himself doing so much worse.\n The engine cut out and the boat coasted onto the shore, dirt and rocks scraping the hull. Charlotte opened her eyes, turned and saw Sergeant Omondi\u0027s team leaping overboard, dropping into the shallows, and starting up the shore toward the tree line. There had been no gunshots from the sharpshooters, which meant none of the vampires in the nest had tried to flee. They were either not yet aware they were under attack, or they were lurking in wait, confident and ready.\n Bring it, bitches.\n She smiled at Omondi, showing fang, and leaped over the side. She landed in a crouch in an inch of water, then raced forward, so swift that she quickly caught up to the frontmost of the soldiers. Sergeant Omondi would want to call her back, rein her in, but he had nothing to worry about. Charlotte wanted to know what they were going to find in that castle, but she was not about to run ahead. At her hip was a gun loaded with Medusa bullets, but she had no way of knowing how many vampires were in the nest and she wasn\u0027t interested in suicide.\n If Cortez is there-\n The thought nearly made her stumble. Of course he wasn\u0027t there. If he had been, surely she would have sensed him. But if he was, there were other worries than just being outnumbered. If she pulled some kind of action hero fantasy and ran in there ahead of the troops, Cortez would be much more likely to get away, and Octavian would never forgive her. She wouldn\u0027t do that. Not to him.\n The commlink in her ear crackled with static. \u0027Charlotte!\u0027\n \u0027I\u0027m here, Sarge.\u0027\n \u0027Swing west to the road. Follow the plan.\u0027\n Omondi had laid it out for her. They didn\u0027t have the numbers for a thorough search of the island - at least not until sunup. The woods surrounding Bannerman\u0027s Arsenal could be crawling with vampires. It seemed counterintuitive to approach so blatantly, without making any attempt to conceal themselves, but Sergeant Omondi believed that any vampires in the castle would already know they were coming, and Charlotte figured that to be true. The woods would be a very bad idea. In close quarters, enough vampires could slaughter the invaders in minutes, no matter how many pairs of night vision goggles and Medusa bullets they\u0027d been issued. On the road - not much more than an overgrown path that led up to the ruin - they\u0027d be out in the open and more likely to be seen, but it would be harder for Cortez\u0027s coven to get the drop on them and thin out the attacking forces.\n Charlotte ignored his order, working her way up the steep hill, moving through the trees and over the blanket of pine needles on the ground. It was a full thirty seconds before his voice crackled in her ear again.\n \u0027Charlotte, form on me.\u0027\n \u0027I don\u0027t think so, Sarge,\u0027 she whispered. \u0027If they come at you all at once, consider me your ace in the hole.\u0027\n \u0027Be careful,\u0027 Omondi replied.\n A reply began to form on her lips, something snarky, but she chose to keep silent. Omondi was a serious sort of man to begin with, but more than that, he was part of Task Force Victor. It ought to have been his job to kill her, and instead he was expressing concern for her safety. She felt a gratitude toward him that she would never speak aloud. It made her less alone than she\u0027d been just a moment before.\n Charlotte raced uphill through the trees, cognizant of the noise she made but unable to avoid it. Thin branches snapped and pine needles whispered underfoot. She could hear Omondi\u0027s team making their way up the road and she listened for sounds of an ambush. As she weaved through the woods she caught glimpses of the neglected turrets of Bannerman\u0027s Arsenal and she scanned the windows and the tops of the walls for any sign of habitation.\n When she emerged from the trees at the top of the hill, standing in the shadow of the castle\u0027s ruin where the moonlight could not reach, she shivered. With its broken face and vacant windows, the castle truly did seem like a ghost. She glanced right and saw nothing that seemed out of place . . . crumbled architecture, overgrown ground, and trees. The view to the left held nothing more, save for the broken, rutted track that had once served as a road. It led up to what must have been the main entrance to the castle but was now a yawing darkness of fallen stone and wild weeds.\n Sergeant Omondi and his troops came up the road moments after she\u0027d emerged from the woods and began to spread out, quickly setting up a perimeter around the castle. Charlotte drifted toward the scorched and faded wall in front of her. She could hear Omondi giving orders over his comm and some of the replies as well; they were reporting back about where the best entry points to the castle had been found. In moments they would go in, ready to destroy every vampire they came across. One of the soldiers, a woman called Bennett, referred to them as leeches. Charlotte had heard the word many times before, but never with the weight of so much disgust. Task Force Victor weren\u0027t afraid of vampires.\n They think they\u0027re the bogeymen, she thought. And in a way it was true; after she\u0027d turned, Cortez had warned her about Task Force Victor the same way mothers had once warned small children not to stray far or the bogeyman would get them.\n But the soldiers were wrong, too. The vampires would be wary of them, but not afraid. Bloodlust eclipsed fear, and once they got into a fight, all the vampires would be thinking about was the soldiers\u0027 blood. That was how Cortez had trained them.\n This is wrong.\n The thought came upon her with such certainty that she nearly shapeshifted in order to get over to Omondi faster, but she stopped herself, worried that any reminder of her being a vampire might inadvertently end with her getting another dose of Medusa, or worse. She tried to remind herself that she was more than a vampire, she was a Shadow. But with so many fingers on so many triggers, she didn\u0027t want to risk her life on such subtleties.\n She ignored the soldiers who had already taken up positions around the house. Sergeant Omondi would be at the main entrance with his handpicked squad. She ran alongside the ruin. Crossing into the pool of moonlight that came through the space where the castle\u0027s front wall ought to have been, she remembered her commlink and mentally chastised herself.\n \u0027Omondi, you there?\u0027 she said.\n \u0027Go ahead, Charlotte.\u0027\n \u0027Something\u0027s wrong,\u0027 she said. \u0027Hold \u0027em back.\u0027\n \u0027What do you-?\u0027\n \u0027Just hold them for a second!\u0027\n Omondi\u0027s squad swiveled around as she ran up, weapons trained on her. They\u0027d all been briefed on her presence, all had a good look, and even in the moonlight it would\u0027ve been hard for them not to recognize her red hair and pale skin. Still, she halted and put her hands up, waiting several seconds until gun barrels were lowered and a soldier waved her forward. By then Omondi had come to the front of the group.\n \u0027Report,\u0027 he said, as if she were a soldier and not an undead nineteen-year-old girl.\n \u0027There\u0027s just something off,\u0027 she said, cringing at how lame that sounded.\n \u0027You\u0027ll have to be more-\u0027\n \u0027They\u0027d never wait,\u0027 she said. \u0027Not Cortez\u0027s coven, don\u0027t you get that? If there were two or three of them, they\u0027d have turned to bats or mist and they\u0027d be gone. Your snipers would have taken them out or missed them entirely, but they\u0027d be gone. If there were more than that, five or ten or twenty, they\u0027d have come out the second they knew we were here. They\u0027re stuck on this island, hiding out, hunting when they can? You guys showing up like this would be like their moms calling them for breakfast.\u0027\n \u0027We\u0027ve killed more than that,\u0027 one of the soldiers said.\n \u0027Doesn\u0027t matter,\u0027 Charlotte argued. \u0027They\u0027d have come down from the sky or through the trees, hit and run in the dark. With Medusa ammo and me along as backup, you\u0027d have won, but they\u0027d have come. There\u0027s no way they\u0027re just sitting in there waiting for you.\u0027\n Sergeant Omondi frowned. \u0027Then there\u0027s no danger in proceeding.\u0027\n Charlotte returned his frown, her own personal Expression B. \u0027No, no. That\u0027s what I\u0027m saying. I feel them, Sarge. They were here. I can feel it under my skin. They were here and they\u0027re gone, now. Maybe they got a tip we were coming or maybe they cleared out for some other reason, but I don\u0027t think it\u0027s any of that. You hear anything moving in the woods on your way up here? A few night birds, that\u0027s it. Nothing on the ground. There had to be squirrels or something, right? So where are they?\u0027\n Impatience etched deep lines on Omondi\u0027s face.\n \u0027Step aside,\u0027 he said. \u0027Abandoned or not, we\u0027re here to find a vampire nest, if it was ever here to begin with.\u0027\n As Omondi gestured to his squad and they started around her, she saw the suspicion in the eyes of a couple of soldiers and realized they thought she was purposely stalling, maybe to help Cortez. Charlotte bristled, wanting to scream at them.\n \u0027This is Omondi,\u0027 he said into his commlink. \u0027Move in.\u0027\n Charlotte could do nothing but follow as they trooped over the fallen masonry and through the broad space where a door must once have been. One side of the ruin was washed with moonlight and the other sunken in shadow. Voices muttered in her ear, TFV soldiers following orders, entering the castle through jagged, broken walls and half-blocked doorways.\n She kept silent, following Omondi closely, but they hadn\u0027t gotten very far inside the ruin when the breeze died down and she froze, inhaling deeply.\n \u0027Sergeant,\u0027 she said.\n Omondi, only a few feet ahead, turned to give her a hard look. \u0027What now?\u0027\n \u0027I smell blood,\u0027 Charlotte said, but it was more than just blood. Her nostrils were full of the stink of dead things.\n Before he could reply, voices rang out, echoing off the bare, ruined walls around them. Weapons at the ready, Omondi\u0027s squad quickened their pace, taking care not to fall on the treacherous footing amongst the wreckage of Francis Bannerman\u0027s ambitions. The various squads had their lights out, now. With no immediate sign of attack, they swung flashlights about and called to one another as they cleared dark corners and the remnants of rooms. Bannerman\u0027s Arsenal reminded Charlotte of photos she had seen online of the Roman Coliseum, nothing but deteriorating walls open to the sky. But there were blockaded rooms and stairs to nowhere and at least one set of steps leading down into the ground, underneath the castle.\n Soldiers were spread out, the lights mounted on their weapons shining as they stood guard over the rubble, as if they had just claimed new territory for Task Force Victor. Omondi\u0027s squad and one other had gathered on the far side of the vast ruin, where a rounded corner of the castle remained intact, a squat little room much like a turret, though it was nowhere near where a turret belonged.\n \u0027They were here, all right,\u0027 one of the soldiers said.\n Omondi cast a glance at Charlotte but said nothing. She moved up beside him and peered between two soldiers. There were clothes strewn about the room, and some of them seemed to have been folded and stacked with a certain orderliness. She saw a few books and a great many empty bottles of wine.\n Charlotte wrinkled her nose.\n There were dead things in there as well. Rabbits, squirrels, birds, and something she thought must be a fox.\n \u0027This is what you smelled,\u0027 Omondi told her.\n \u0027No. It isn\u0027t.\u0027\n Charlotte turned and strode across the ruin, making her way around rubble, to the place where those stairs descended into the bowels of the castle. Half a dozen soldiers were already there, two of them starting down the stairs with their lights guiding the way.\n \u0027Let me by,\u0027 she said.\n \u0027What are you doing?\u0027 Omondi asked, and she could hear him in her ear just as well as she could through her commlink.\n Charlotte turned to him, tired of being ignored.\n \u0027I know it\u0027s hard, Sergeant. I look like a nineteen-year-old girl, but I could kill you right now, before you could even aim that weapon. You\u0027re struggling between wanting to treat me like an ally or a kid and seeing me as the enemy. I don\u0027t blame you. But I\u0027m telling you they\u0027re gone, and they left us a present. The blood I smelled - the dead things I smell, right now - it\u0027s coming from down there. Considering we have no idea what\u0027s really waiting down there, and since I\u0027m a hell of a lot harder to kill than any of you, I\u0027m going down ahead of you. Unless you want to give me that condescending look you\u0027ve been giving me for the last few minutes again?\u0027\n Omondi furrowed his brow thoughtfully, then gestured for the other soldiers to step back.\n \u0027Lead the way, then,\u0027 he said. \u0027But be careful.\u0027\n Again with the concern, she thought. Omondi really was having a hard time figuring out how to feel about having a Shadow on his team. She wondered if he had worked with Allison Vigeant and, if so, whether he\u0027d been quite so conflicted about her.\n Charlotte gave Omondi a nod and went to the stairs. Moonlight lit the way, but it could not reach underground. As keen as her vision was, she did not refuse when a soldier offered her his flashlight. Shining it ahead of her, she picked her way amongst the debris and descended. Sergeant Omondi and four or five others followed her down, keeping their distance.\n At the bottom of the steps was a corridor that led straight ahead, and she followed it. The stone walls and supports had held up rather well. She glanced into three rooms as she passed and found them similar to the one above, with the detritus of an abandoned vampire nest, but the blood ahead smelled fresh - perhaps only hours old.\n The smell lured her to the end of the corridor, where a heavy door hung open. The smell of ancient gunpowder lingered in the air, and she realized that this must be one of the vaults where Bannerman had stored part of his arsenal. The stink of death sat heavily in the air as she stepped over the threshold into the vault and moved her flashlight beam across the room.\n Charlotte counted six corpses. Four of them had been haphazardly lumped into a pile like nothing more than human rubble, just another part of the ruin. The other two had been gutted, their viscera decorating the room like party streamers. They had not even been dead long enough for the blood and stinking waste to stop dripping from their hanging intestines. Charlotte\u0027s stomach lurched and she nearly threw up. Even after all she had been through, much of her was still human enough to recoil at the sight.\n \u0027Charlotte, what\u0027ve you got?\u0027 Omondi asked. All of the impatience had left his voice. There could be no denying the stench that came from the vault now.\n The dead people were all dressed in some kind of worker\u0027s uniform, but she only glanced at that detail for a moment. Something else drew her eye. Her light had caught the edge of a smear of blood on the far wall. She panned the light across the wall and read the single word painted there, a haphazard afterthought. A bloody celebration.\n Xibalba. She didn\u0027t recognize the word, but she wanted to make sure she was reading it correctly, so she took a step deeper into the room and felt something tug at her ankle. Tug, and snap.\n Some part of her brain recognized the significance of that snap, of the wisp of string that coiled back into the shadows like a broken spider-web. In an eyeblink, she was shifting, flesh and bone turning to mist.\n \u0027Charl-\u0027 Omondi began.\n And the vault exploded, buckling the ceiling above, sending a ball of raging white fire rolling up through cracks in the ground. The remaining walls of Bannerman\u0027s Arsenal were blown apart and the woods ignited with flames that began to spread.\n In minutes, the fire could be seen for miles up and down the Hudson River.\n The goblins, it seemed, had finally claimed all that remained of Pollepel Island. \n","sourceLink":"https://allnovel.net/the-graves-of-saints-shadow-saga-6/page-9.html","bookId":2601,"book":{"id":2601,"title":"The Graves of Saints (Shadow Saga #6)","description":"Storyline: \n The Graves of Saints (Shadow Saga #6) \n For centuries, Vatican sorcerers kept demons and monsters out of our world with the magic found in a grimoire called The Gospel of Shadows. Years ago, to save his people from madmen, Peter Octavian defeated those sorcerers and the Gospel of Shadows itself was banished from the Earth. Ever since, the evils and monstrosities lurking in parallel worlds have been waking to the realization that our magical defences are down - the barriers keeping them out of our world are crumbling. \n With massive demonic incursions in locations around the world, Octavian should be focused on using his own sorcery to drive the evil out and rebuild our defences. But a renegade vampire named Cortez has murdered the person Octavian loves the most and, even with his friends and allies around him, he is so lost in grief that he can think of nothing but revenge. There are others who can fight the darkness - mages and Shadows, witches and Reapers and vampire samurai - but only the warrior-mage, Peter Octavian, can defeat it. If he will answer the call.\n \n","cover":"https://allnovel.net/images/the-graves-of-saints-shadow-saga-6.jpg","author":"Christopher Golden","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-graves-of-saints-shadow-saga-6.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:28:06 PM"}}
