{"id":69950,"no":12,"title":"Page 12","content":"In life, unlike chess, the game continues after checkmate. 50. A heavy silence fell upon the five shipmates. Konev\u0027s silence was the least quiet. He was quivering with unrest and his hands would not keep still. Morrison felt a dim sympathy. To have reached the destination, to have done just as planned, through difficulties, to imagine one\u0027s self at the point of snatching success, and to have to fear that it will be moved away from the eagerly grasping fingers even now - he knew the feeling. No longer quite as sharply perhaps, as once, now that he was ground down and dulled by frustration, but he remembered the early occasions. Experiments that raised hope, but were somehow never quite conclusive. Colleagues who smiled and nodded, but were never convinced. He leaned forward and said, \"Look, Yuri, just watch the red corpuscles. They\u0027re creeping ahead, one after the other, steadily - and that means the heart is beating and is doing so fairly normally. As long as the red corpuscles move steadily ahead, we\u0027re safe.\" Dezhnev said, \"There\u0027s the blood temperature, too. I\u0027ve got it monitored at all times and it will have to start dropping slowly, but with determination, if Shapirov lets go. Actually, the temperature is at the upper edge of normal.\" Konev grunted, as though scorning consolation and pushing it to one side, but it seemed to Morrison that he was noticeably quieter after that. Morrison sank back in his seat and let his eyes close. He wondered if he was experiencing hunger and decided that he was not. He also wondered if there was a distinct sensation of bladder pressure. There wasn\u0027t but that did not relieve him much. One could always postpone eating for a considerable length of time, but the necessity of urination did not lend itself to quite the same flexibility of choice. He was suddenly aware that Kaliinin had addressed him but he had not been listening. \"Pardon me. What did you say?\" he asked, turning toward her. Kalfinin looked surprised. She said softly, \"I ask your pardon. I interrupted your thoughts.\" \"They were worth interrupting, Sophia. I ask your pardon for being inattentive.\" \"In that case, I asked what it is you do in your analysis of brain waves. I mean, what is it you do that is different from what others do? Why was it necessary for us -\" She paused, clearly uncertain as to how to proceed. Morrison finished her thought without difficulty. \"Why was it necessary for me to be abstracted forcibly from my country?\" \"Have I made you angry?\" \"No. I presume you did not advise the action.\" \"Of course not. I knew nothing of it. In fact, that is why I am asking you my question. I know nothing about your field except that there are electroneural waves; that electroencephalography has become an intricate study, and an important one.\" \"Then if you ask me what is special about my own views, I\u0027m afraid I can\u0027t tell you.\" \"Is it secret, then? I thought it might be.\" \"No, it is not secret,\" said Morrison, frowning. \"There are no secrets in science, or there should be none - except that there are struggles for priority so that scientists are sometimes cautious about what they say, and I am guilty of that, too, sometimes. In this case, though, I mean it literally. I can\u0027t tell you because you lack the basis for understanding.\" Kaliinin considered, her lips compressed as though in aid to thought. \"Could you explain a bit of it?\" \"I can try, if you\u0027re willing to hear simple assertions. I can\u0027t very well describe the entire field. - What we call brain waves are a conglomeration of all sorts of neuronic activity - sense perceptions of various kinds, stimuli of various muscles and glands, arousal mechanisms, coordinations, and so on. Lost among all these are those waves that control, or result from, constructive and creative thought. Isolating those skeptic waves, as I call them, from all the rest is an enormous problem. The body does it without any difficulty, but we poor scientists are, for the most part, at a total loss.\" \"I\u0027m having no difficulty understanding this,\" said Kaliinin, smiling and looking pleased. (She is remarkably pretty, thought Morrison, when she manages to get rid of her air of melancholy.) \"I haven\u0027t gotten to the hard part yet,\" he said. \"Please do, then.\" \"About twenty years ago, it was demonstrated that there was what seemed a random component in the waves that no one had ever picked up because the instruments that had been used until then did not pick up what we now call \u0027the twinkle.\u0027 It\u0027s a very rapid oscillation of irregular amplitude and intensity. That\u0027s not a discovery I made, you understand.\" Kaliinin smiled again. \"I imagine that twenty years ago you would have been too young to make the discovery.\" \"I was an undergraduate then, making the discovery that young women were not entirely unapproachable, which is by no means an unimportant thing to find out. In fact, each person may have to rediscover it now and then, I think. - But never mind that. \"A number of people speculated that the twinkle might represent thought processes in the mind, but no one managed to isolate it properly. It would come and go, be detectable at times and not at others, and the general feeling was that it was artifactitious, a matter of working with instruments that were too delicate for the thing they were measuring so that one picked up what was, essentially, noise. \"I thought not. In time I developed a computer program that made it possible for me to isolate the twinkle and to demonstrate it was always present in the human brain. For that I got some credit, though few people were able to duplicate my work. I used animals for types of experimentation that were too dangerous to perform on human beings and used the results to further sharpen my program of analysis. But the sharper I made the analysis and the more significant I thought the results, the less others were able to duplicate them and the more they insisted that I was misled by my animal experimentation. \"But even isolating the twinkle was a long way from demonstrating that it was a representation of abstract thought. I have amplified it, intensified it, modified my program over and over, and have convinced myself that I am studying thought, the skeptic waves themselves. Still, no one can duplicate the crucial points of my work. I have, on several occasions, allowed someone to use my program and my computer - the sort of thing I\u0027m using now - and they invariably fail.\" Kaliinin was listening gravely. She said, \"Can you imagine why no one can duplicate your work?\" \"The easiest explanation is that there is something wrong with me, that I am a crank - if not a madman. I believe that some of my colleagues suspect that to be the answer.\" \"Do you think you\u0027re a madman?\" \"No, I don\u0027t, Sophia, but even I waver sometimes. You see, after you isolate the skeptic waves and amplify them, it is conceivable that the human brain itself might become a receiving instrument. The waves may transfer the thoughts from the thinker you are studying directly to you. The brain would certainly be an extraordinarily delicate receiver, but it would also be an extraordinarily individual one. If I improved my program so that I could sense the thoughts better, that would mean I improved it to suit my own individual brain. Other brains might not be affected and, in fact, might be less affected, the closer I adjusted it to mine. It would be like a painting. The closer a painting is made to look like me, the less it looks like anyone else. The more I can make my program produce sensible self-consistent results, the less anyone else can.\" \"Have you actually sensed thought?\" \"I\u0027m not sure. There are times I have thought I did, but I\u0027m never quite convinced it\u0027s not my imagination. Certainly no one else - with my program or any other - has sensed anything. I have used the twinkle to track down the skeptic nodes in the brains of chimpanzees and from that reasoned out where they would be in human brains, but that is not accepted either. It is considered the overenthusiasm of a scientist oversold on his own unlikely theory. And even using leads into the skeptic nodes - on animals, of course - I couldn\u0027t be sure.\" \"With animals it would be difficult. Have you published these - sensations of yours?\" \"I haven\u0027t dared,\" said Morrison, shaking his head. \"No one would accept such subjective findings. I\u0027ve mentioned it in passing to several people - foolish of me - and the news spread and merely convinced my colleagues all the more firmly that I am, shall we say, unstable. It was only last Sunday that Natalya told me that Shapirov took me seriously, but he is considered, at least in my country, to be unstable, too.\" \"He is not,\" said Kaliinin firmly, \"or was not.\" \"It would be nice to think he wasn\u0027t, obviously.\" Konev, from in front of Morrison, said suddenly, without turning around, \"It was your sensations of thought that impressed Shapirov. I know! He discussed it with me. He said on a number of occasions that your program was a relay station and he would like to try it himself. If you were inside a neuron, a key neuron of the skeptic node, things would be different. You would sense thoughts unmistakably. Shapirov thought so and I think so. Shapirov thought it possible you might even have sensed thoughts unmistakably as it was, but were not ready to let the world know. Is that so?\" How they harped on secrecy, all of them, thought Morrison. Then he caught the look on Kaliinin\u0027s face. Her mouth was partly open, her eyebrows drawn together, her finger hovering near her lips. It was as though she wanted to ask him to be quiet with a kind of agonizing intensity, without quite daring to do so openly. But then he was distracted by Dezhnev\u0027s voice, joyfully loud. \"Enough babble, my children. The Grotto has located us and we are, to their enormous astonishment, exactly where we say we are.\" Konev threw up both hands and his voice sounded almost boyish. \"Exactly where I say we are.\" Dezhnev said, \"Let us have communal responsibility. Where we say we are.\" \"No,\" said Boranova. \"I ordered Konev to make the decision on his own responsibility. The credit is therefore his.\" Konev was not mollified. He said, \"You would not have so quickly demanded communal responsibility, Arkady Vissarionovich\" - he used the patronymic in a style long out of fashion in the Soviet Union, as though to emphasize the fact that Dezhnev was the son of a peasant, among whom, only, the style remained in fashion - \"had we proved to be in the wrong capillary.\" Dezhnev\u0027s smile became an uncomfortable one and his somewhat yellow upper incisors caught at his lower lip. Boranova said in her masterful contralto, cutting off any retort Dezhnev might have made, \"And Shapirov. What of him?\" \"That,\" said Dezhnev, \"has passed. An injection of some sort steadied the heartbeat.\" Konev said, \"Well, then, are we ready to go?\" \"Yes,\" said Boranova. \"In that case - out of the bloodstream at last.\" 51. Boranova and Kaliinin were bent over their instruments. Morrison watched them for a few moments, but, of course, knew nothing of what was going on. He turned to Dezhnev, who sat in a relaxed position (unlike Konev, whose body was tense, almost ridged with muscle), and said, \"What will be done, Arkady? We can\u0027t very well just blast our way out of a blood vessel in the brain.\" \"We\u0027ll sneak out once we\u0027re small enough. We\u0027re miniaturizing again. Look around you.\" Startled, Morrison did. He realized that every time the outside world seemed to stabilize, he quickly learned to take it for granted and to pay no attention to it. The current had picked up speed. Or, rather, it hadn\u0027t, but the ship had shrunk in size once more and objects moving by took correspondingly less time to pass, so that the mind, insisting on considering the ship\u0027s size unchanged, interpreted what was seen as a faster current. A red cell passed by, moving as it had (or seeming to move as it had) in the carotid artery, but despite its speed, it billowed past for a long time, like a quivering whale passing a rowboat. It had grown faint indeed. It was almost transparent now and its edge was fuzzy with Brownian motion. There was a grayish dimness about it, so that it looked like an angry thundercloud spreading its way over the heavens. It had lost most of its oxygen by this time, of course, giving it up to the avid brain cells which, without motion or visible signs of life, consumed one quarter of all the oxygen carried by the blood to the various organs of the body. For all that the brain seemed to simply sit there, sense perception, response, and thought, all of it coordinated with a complexity that no human computer could come within an astronomical distance of duplication - might never duplicate - did not come cheap. To make up for the spreading of the red cells, the platelets, and the comparatively rare white cells that had grown into monsters that were now too large to grasp, the blood plasma was becoming far less featurelessly liquid. It had started to turn grainy and now the grains were slowly expanding as they shot past with gradually increasing speed. Morrison knew he was looking at protein molecules and, after a while, it seemed to him that through their whirling and flexing he could make out the helical arrangements of their atoms in fuzzy manner. Some had a miniature forest of lipid molecules partially encasing them. He was becoming aware also of movement, not the tremble of Brownian motion but a lurching that was becoming more pronounced. He turned his head to look out the other side at the capillary wall to which they were attached. The tiling was gone - or at least one tile (or cell, as he might as well think of it now) had expanded to the point where it was the only one to be seen. Slipping off behind was the bulge of the nucleus of the cell, large and thick and growing larger and thicker. The ship lurched as part of it slid away from the wall and then lurched again as it slid back. \"What\u0027s happening?\" said Morrison, looking at Kaliinin, who shook her head impatiently. She was totally absorbed in her work. Dezhnev said, \"Sophia is trying to neutralize the ship\u0027s electric charge here and there so that it lets go before the tension damages the wall. And she has to find new areas of attachment to keep from losing the wall altogether. It\u0027s not easy, having to miniaturize and, at the same time, staying attached to the wall.\" Morrison said, alarmed, \"How far will we miniaturize?\" His words were overborne by Kaliinin\u0027s shrill command. \"Arkady, move it forward. Gently! Just put forward pressure on the ship.\" \"Yes, Sophia - but tell me when to stop.\" To Morrison, he added, \"My father used to say: \u0027Between not enough and too much is a hair\u0027s breadth.\u0027\" \"More, more,\" said Kaliinin. \"All right. Now we\u0027ll try.\" The ship seemed to stick and strain and then it suddenly slid forward and Morrison felt himself thrust gently back against his seat. \"Good,\" said Kaliinin. \"Just a little less now.\" The cell came to an end. Beyond it was another cell. Thin cells, as cells went, a mere film of cells, fitted together to make a tiny tube, with the ship and its crew of five clinging to the inner surface by minute attractions of electric charge. The space between the adjoining cells seemed ropy, with cables stretching from inside one cell to the other. They were not all intact and there were stumps visible like the remains of a felled forest. It seemed to Morrison that there were narrow gaps in that felled forest, but he couldn\u0027t see clearly from the angle at which he viewed them. He said again, \"How far will we miniaturize, Arkady?\" \"Eventually to the size of a small organic molecule.\" \"But what would the chances be of spontaneous deminiaturization at that size?\" \"Appreciable,\" said Dezhnev. \"Much more than it was when we were the size of a red corpuscle or even of a blood platelet.\" \"Still not enough to worry about,\" said Boranova. \"I assure you.\" \"Exactly,\" said Dezhnev and raised his hand slightly with the first two fingers crossed so that Morrison could just see it and Boranova, farther back, could not. That American gesture had become universal and Morrison, knowing exactly what it meant, felt himself growing cold inside. Dezhnev was looking straight ahead, but he might have sensed Morrison\u0027s grimace or heard his soft grunt. He said, \"Don\u0027t worry about it, young Albert. It is always wise to have but one worry at a time and right now let us worry about squeezing out of the blood vessel. - Sophia, my loved one.\" \"Yes, Arkady,\" she said. \"Weaken the field in the rear of the ship and when I move grope for one ahead.\" \"I will do so, Arkady. Didn\u0027t your father once say: \u0027There is no point in trying to teach a thief to steal\u0027?\" \"Yes, he did. Steal, then, little thief, steal.\" Morrison wondered whether Dezhnev and Kaliinin were deliberately being lighthearted in the face of the possibility of sudden death as a way of cheering him up? Or were they showing contempt for his cowardice? He chose the former. Surely when an action might equally well be interpreted as friendly or hostile, one might as well choose the friendly. Perhaps Dezhnev\u0027s father would have agreed. With that thought, he felt cheered. The ship\u0027s rear seemed to be hanging loosely and to remain several centimeters (several picometers in real measure?) from the wall of the capillary. Morrison studied it closely and could see the serried ranks of protein and lipid molecules that made up that wall. He thought, What are we doing ignoring this? Here is our opportunity to study tissues with greater precision than the best scanning electron microscope can - and to study them while alive; to see not only position but living change and motion. We have passed through the bloodstream and narrowed in on a capillary wall without looking at anything in any real scientific sense. We are only passing through, with no more interest than we would show if we were in a subway, barreling through an underground tunnel. - All to study oscillations that might be produced by thought... and might not. The ship was inching along (an old word, thought Morrison suddenly, antedating the metric system, but he\u0027d never heard anyone say \"centimetering along\") as though it were somehow feeling its way. Perhaps, between Dezhnev\u0027s motors and Kaliinin\u0027s flickering electric fields, that was precisely what it was doing. \"We\u0027re approaching the junction, little Sophia,\" said Dezhnev in a curiously tight voice. \"Make sure your hold is firm in front, while I move forward another meter or so.\" \"I suspect from the appearance and electrical behavior,\" said Kaliinin, \"that we have a clump of arginines toward the junction. That represents a strong region of positive charge and I can handle that as smoothly as sour cream.\" But Boranova said sternly, \"No overconfidence, Sophia. Keep a firm watch. If you miss and the ship tears loose, there will be much to do over.\" \"Yes, Natalya,\" said Sophia, \"but with all respect, the warning is not really needed.\" Dezhnev said, \"Sophia, do exactly what I say. Keep only the prow of the ship attached to the wall, but strongly. Release everything else.\" \"Done,\" said Sophia faintly. Morrison found himself holding his breath. The rear of the ship had spun away from the wall, but it held in front. The bloodstream caught the detached rear end and pushed the ship into a position at right angles to the current, while the capillary wall, where the ship still held, moved outward like a pimple. Morrison said tightly, \"Watch out. We\u0027ll pull a section out of the wall.\" \"Quiet, all!\" thundered Dezhnev. Then, in an ordinary voice, \"Sophia, I shall increase the engine push slowly. Get yourself in position to break all remaining attraction. The ship is to be entirely neutral - but not until I say so.\" Sophia cast a quick look toward Boranova, who said in her quiet way, \"Do exactly as you\u0027re told, Sophia. For this, Arkady\u0027s word is absolute.\" Morrison imagined he felt the ship straining forward. The section of the capillary wall to which it was attached stretched farther and farther. Sophia said urgently, \"Arkady, either the field will snap or the wall will.\" \"Another moment, dear one, another moment. - Now.\" The wall snapped back and the ship bounded forward in a great leap that rocked Morrison gently backward. The forward end of the ship buried itself in the cement stuff between the two cells of the capillary wall. 52. For the first time, Morrison was aware of the laboring of the microfusion engines. There was a subliminal throbbing as the ship worked its way through the joint with what seemed increasing difficulty. There was nothing to see up ahead. The thickness of the capillary wall, very thin though it was in normal terms, was far thicker than the length of the ship. The ship was now totally immersed in the joint and Dezhnev, beads of sweat on his forehead, turned his head and spoke to Boranova. \"We\u0027re using up energy faster than we should.\" Boranova said, \"Then stop the ship and let\u0027s consider.\" Deshnev said, \"If I do that, there is a chance that the natural elasticity of this material will pop us out of the joint and back into the bloodstream.\" \"Slow the engines down, then. Choose a level that will be enough to keep us in place.\" The throbbing came to an end. Dezhnev said, \"The joint is exerting considerable pressure on the ship.\" \"Enough to crush us, Arkady?\" \"Not now. But who can say for the future if the pressure continues.\" Morrison burst out. \"This is ridiculous. Didn\u0027t someone say we\u0027re the size of a small organic molecule?\" \"We\u0027re the size of a glucose molecule,\" said Boranova, \"which is made up of twenty-four atoms altogether.\" \"Thank you,\" said Morrison freezingly, \"but I know how many atoms there are in a glucose molecule. As it happens, small molecules drift through the capillary walls constantly by diffusion. Diffusion! That\u0027s the way the body works. Why aren\u0027t we diffusing through?\" Boranova said, \"Diffusion is a statistical proposition. There are twenty-four billion trillion glucose molecules in the bloodstream at any given time. They move around randomly and some manage to hit in such places and in such ways as to move through a joint, or to move into the membrane of a capillary wall cell, into the cell, and out the other side. A very small percentage succeed at any given second, but that is enough to ensure proper tissue functioning. However, by chance, a particular glucose molecule may remain in the bloodstream for a month without diffusing. Can we wait a month for a chance to do its work?\" \"That\u0027s no argument, Natalya,\" said Morrison impatiently. \"Why don\u0027t we simply do deliberately what a real glucose molecule would do by chance? Especially now, when we\u0027re part way through the joint. Why are we stuck in position?\" Konev said, \"I\u0027m on Albert\u0027s side. Diffusion probably isn\u0027t a passive leakage. There\u0027s some sort of interaction between the diffusing object and the barrier through which the diffusion takes place - except that no one knows what the interaction might be exactly. Especially here, where we face the blood-brain barrier.\" \"We\u0027re here at the barrier,\" said Dezhnev. \"You\u0027re the brain expert. Can you look around and tell us how this diffusion works?\" \"No, I can\u0027t. But glucose is one molecule that gets through the blood-brain barrier easily. It must because it is the brain\u0027s sole fuel for energy. The trouble is that while the ship is as small as a glucose molecule, it isn\u0027t a glucose molecule.\" \"Are you getting at something, Yuri,\" said Boranova, \"or is this a lecture?\" \"I\u0027m getting at something. We had the ship become uncharged in order to lunge into the joint, but why leave it uncharged now? Can it be given the charge pattern of a glucose molecule? If so, it will be a glucose molecule as far as Shapirov\u0027s body is concerned. I suggest you order it done, Natalya.\" Kaliinin did not wait for the order. She said, \"It is done, Natalya.\" (They each addressed Boranova, Morrison noted. Each still maintained the fiction of the other\u0027s nonexistence.) Dezhnev said, \"And the joint\u0027s pressure decreases at once. It recognizes a friend, so it bows politely and steps aside. My father\u0027s mother, long may I keep her memory, would have cried out, \u0027Black magic,\u0027 and at once would have hidden beneath the bed.\" \"Arkady,\" said Boranova, \"increase the power of the engines and pass through before the joint notices that underneath the glucose pattern is something that is not glucose.\" \"Yes, Natalya,\" said Dezhnev. Morrison said, \"This one is yours, Yuri. Your suggestion was just right. In hindsight I see that I should have thought of that, too, but the fact is, I didn\u0027t.\" Konev said gruffly, as though finding praise something he couldn\u0027t handle, \"It was nothing. Since the brain lives on glucose, we got down to glucose size. Eventually, we would have had to have a glucose pattern, and as soon as you asked the question why we weren\u0027t diffusing when we should have been, I realized we needed the pattern already.\" Dezhnev said, \"Members of the expedition, we are through the joint. We are out of the bloodstream. We are in the brain.\" 53. In the brain, thought Morrison, but not in a brain cell. So far they had only passed from the intercellular space between the cells of the capillary wall, into the intercellular spaces of the brain where the support structures existed that maintained the form and interrelationships of the nerve cells, or neurons. Remove them and the cells would squash into amorphous masses, pulled together by gravity and unable to maintain any sensible function. It was a jungle, made up of thick viny threads of collagen. (This was the nearly universal animal connective protein that fulfilled the function of cellulose in plants, less cheaply, since it was protein rather than carbohydrate, but far more flexibly.) Through the eye of ultraminiaturization, those collagen threads, totally invisible without an electron microscope, looked like tree trunks, leaning this way and that in a world in which gravity was of little importance. There were finer and still finer threads. Morrison knew that some of them might be elastin and that the collagen itself might come in subtly different varieties. If he could see the whole in a wider view, from a less-miniaturized standpoint, he would have been able to detect order and structure. At this level, however, it was chaotic. One couldn\u0027t even see far in any direction; the overlapping fibers blocked vision. Morrison became aware that the ship was moving very slowly. The four others were each staring around in wonder. Either they had not expected this (Morrison hadn\u0027t, for he had been too interested in the electrical properties of the brain to think much concerning its microanatomy) or, if they had, they had nevertheless failed to visualize it. Morrison said, \"How do you expect to find your way to a neuron? Does anybody know?\" Dezhnev was the first to answer, \"The ship can only move straight ahead, so we move straight ahead until we get to a cell.\" \"How do we move straight ahead through this jungle? If we can\u0027t steer the ship, how do we move around obstacles?\" Dezhnev rubbed his chin thoughtfully. \"We don\u0027t move around, we push around. The ship will move past one of those objects and there will be more friction on the contact side than on the other, so our path bends, like a comet rounding the sun.\" He smiled. \"Cosmonauts do that when they use gravity to skim around a satellite or planet. We\u0027ll do it to skim around those things.\" Konev said morosely, \"Those things are collagen fibers.\" Morrison said, \"Some of them are pretty thick. You won\u0027t always pass by. You\u0027ll hit one head-on and stay there and if you can only move forward, what will you do? This ship was designed only for the bloodstream. We\u0027re helpless out of it with nothing to carry us along.\" Boranova interposed. \"Arkady, you have three microfusion engines and the jets, I know, are arranged at the rear at the apices of an equilateral triangle. Can you fire only one of them?\" \"No. One contact controls all three.\" \"Yes, Arkady, that is how it is now. But you designed the ship and you know the details of its controls. Is there anything you can do to modify them so that you can fire them one at a time?\" Dezhnev took a deep breath. \"Everyone told me over and over again that I must cut corners, that I must save the budget, that I must do nothing to irritate the bureaucrats.\" \"Aside from that, Arkady, is there anything you can do?\" \"Let me think. It means jury-rigging. It means finding something to make switches out of, and extra wire, and who knows if it will work or how long it will work if it does, and if we won\u0027t end up worse than we are. I see what you mean, though. If I can fire only one of the engines, it will set up an unbalanced thrust.\" \"You\u0027ll be able to steer then, depending on which you fire.\" \"I\u0027ll try, Natalya.\" Morrison said angrily, \"Why didn\u0027t you think of this when we were in the wrong capillary? It might have saved me the small trouble of nearly dying trying to turn the ship by hand.\" Dezhnev said, \"If you hadn\u0027t so promptly suggested turning the ship by hand, we might have thought of it - but it wouldn\u0027t have been a good idea.\" \"Why not?\" \"We were in the current of the bloodstream. The ship is carefully streamlined to take advantage of it and its surface is designed to allow water to flow past it without turbulence, which makes it all the harder to turn out of the current. It would have taken much longer than turning by hand - and very much more energy. The narrow confines of the capillary must be remembered, too. Here, there is no current and because we\u0027ve been so miniaturized there is a great deal of room.\" \"Enough,\" said Boranova. \"Get to work, Arkady.\" Dezhnev did so, rummaging through a tool chest, removing a cover plate and studying the control details within, maintaining through it all a kind of incoherent muttering. Konev, his hands clasped behind his neck, said, without turning, \"Albert, tell us about those sensations you receive.\" \"Sensations?\" \"You were telling us about them just before we got the news from the Grotto that we were located in the correct capillary. I\u0027m talking about the sensations you experienced when you were trying to analyze the thought waves.\" \"Ah,\" said Morrison and caught Kaliinin\u0027s eye. Very slightly, she shook her head. Very tentatively, a warning finger crossed her lips. Morrison said, \"Nothing to tell. I had vague sensations I couldn\u0027t describe in any objective way. It could well have been my imagination. Certainly those whom I tried to tell about it were convinced it was.\" \"And you never published anything about them?\" \"Never. I merely mentioned it in passing at conventions and that was bad enough. If Shapirov and you heard of it, it was through word of mouth only. If I had published, that would have come as near to scientific suicide as I would ever want to be.\" \"Too bad.\" Morrison looked briefly toward Kaliinin. She had nodded very slightly, but said nothing. Clearly, she couldn\u0027t say anything without being overheard by the entire ship. Morrison looked around carelessly. Dezhnev was lost in his work, clucking to himself. Konev stared straight ahead, lost in whatever tortuous thoughts he happened to have. Boranova, behind Kaliinin, was studying the screen of her computer carefully and was making notes. Morrison did not try to read them - he could read English upside down, but he hadn\u0027t come to that pitch of ease with Russian. Only Kaliinin, to his left, was looking at him. Morrison pressed his lips together and then shifted his computer into a word-processing mode. It did not have a Cyrillic adjunct, but he spelled out the Russian words in phonetic Roman lettering. WHAT IS WRONG? She hesitated, probably not very much at home in Roman. Then her own fingers flashed and the neat Cyrillic on her screen read: DON\u0027T TRUST HIM. SAY NOTHING. It was erased at once. Morrison wrote: WHY? Kaliinin said: NOT EVIL, BUT PRIORITY, CREDIT. WILL DO ANYTHING, ANYTHING, ANYTHING. The words were gone and she looked away firmly. Morrison considered her thoughtfully. Was it only the vengefulness of a woman betrayed? It didn\u0027t matter, in any case, for he had no intention of talking about anything that he hadn\u0027t already given away, either in a paper or by word of mouth. He himself was not evil, but where priority and credit were concerned, he might not do anything, anything, anything, but he would do a great deal. Still, there was nothing to be done at that moment. Or one thing, perhaps, which was completely aside from the point, but which was beginning, just beginning, to occupy his mind to the exclusion of other things. He turned to Boranova, who was still staring at her instrument and tapping her fingers softly against the arm of her seat in thoughtful concentration. \"Natalya?\" \"Yes, Albert?\" She did not look up. \"I hate to introduce a note of ugly realism, but\" - his voice lowered to near-soundlessness - \"I\u0027m thinking of urinating.\" She looked up at him, a corner of her lips twitching very slightly, but avoiding the smile. She did not lower her voice. \"Why think of it, Albert? Do it.\" Morrison felt like a little boy raising his hand for permission to leave the room - unreasonably so, he knew. \"I don\u0027t like to be the first.\" Boranova frowned, almost as though she were the teacher in the case. \"That is quite silly and, in any case, you are not. I have already taken care of such a need in myself.\" Then, with a faint shrug, \"Tension tends to increase urgency, I have frequently found.\" Morrison had frequently found that, too. He whispered, \"It\u0027s all very well for you. You\u0027re there in the back seat alone.\" And he nodded slightly in the direction of Sophia. \"So?\" Boranova shook her head. \"Surely you don\u0027t wish me to improvise a curtain for you? Shall I place my hand over her eyes.\" (Kaliinin looked in their direction in surprise.) \"She will ignore you, I\u0027m sure, out of decency and out of a feeling that in short order she will wish you to ignore her.\" Morrison was keenly embarrassed, for Kaliinin was now looking at him with obvious understanding. She said, \"Come, Albert, I held you naked in my lap. What room need one make for modesty now?\" Morrison smiled weakly and made a little thank-you gesture. He tried to remember how to manage the waste lid on his seat, but once he remembered, he found that it slid open with a small but definite click. (Those irritating Soviets! Backward always in small ways. It might easily have been designed to open noiselessly.) He also managed to loosen the electrostatic seam along his crotch and then found himself worrying whether he would manage to close it unobtrusively afterward. Morrison felt the current of air at the moment the waste lid opened and it felt uncomfortably cold against his bare skin. He sighed with a tremendous relief when he was done, then he managed to close the seal along the crotch and sat there, panting. He realized that he must have been holding his breath. \"Here,\" said Boranova brusquely. He stared, for a moment, at what she was holding, then recognized it as a small sealed towel. He tore open the seal, found the towel within moistened and scented and rubbed his hands with it. (The Soviets were learning small elegances, obviously - or decadences, depending on whether finickiness or impatience won the battle for domination within you.) And then Dezhnev\u0027s throaty voice sounded loudly, very loudly, in Morrison\u0027s ear after all the whispering he had been engaged in. \"That\u0027s done now.\" \"What\u0027s done?\" asked Morrison angrily, automatically assuming the reference was to his bodily functions. \"The individual firing of the motors,\" said Dezhnev, making a there-you-are gesture with both hands in the directions of the ship\u0027s controls. \"I can fire any one, or two, or all three, if I wish. Absolutely certain - I think.\" \"Which is it, Arkady?\" said Boranova waspishly. \"Is it quite certain or is it a matter of opinion?\" \"Both,\" said Dezhnev. \"It is my opinion that I am absolutely certain. The trouble is that my opinion isn\u0027t always right. My father used to say -\" \"I think we ought to try it out,\" said Konev, cutting off Dezhnev\u0027s father, perhaps in the full realization he was doing so. \"Of course,\" said Dezhnev. \"That goes without saying, but as my father used to say\" - he raised his voice as though determined not to be again subverted - \"the sure thing about anything that goes without saying is that someone is bound to say it. - And you might as well know -\" He paused momentarily and Boranova said, \"What might we as well know?\" \"Several things, Natasha,\" said Dezhnev. \"In the first place, steering will take a lot of energy. I\u0027ve done my best, but the ship is not designed for this. For another - well, I can\u0027t communicate with the Grotto now.\" \"Can\u0027t communicate?\" said Kaliinin, her voice rising to a near squeak in what was either surprise or indignation. Boranova\u0027s voice marked her as definitely indignant. \"What do you mean, we can\u0027t communicate?\" \"Come, Natasha, I can\u0027t wire up the motors separately without wires, can I? The best engineer in the world can\u0027t make wires out of nothing and can\u0027t manufacture silicon chips out of nothing, either. Something had to be dismantled and the one thing I could dismantle without disabling the ship was communications. I told them that out in the Grotto and there was a lot of shrieking and complaining, but how could they stop me? So now we can steer, I think - and we can\u0027t communicate, I know.\" 54. There was silence as the ship began to move. The surroundings were utterly different now. In the bloodstream, there had been a heaving medley of objects - some crawling ahead of the ship, some slowly drifting behind, depending on eddies and streamlining, Morrison supposed. There was the feeling of movement, if only because the markings on the walls - fatty plaques in the arteries, tiling in the capillaries, slipped steadily backward. Here, in intercellular space, however, there was stasis. No motion. No feeling of life. The tangle of collagen fibers seemed a forest primeval, built up of trunks only, without leaves, without color, without sound, without motion. Once the ship pushed forward through the viscous intercellular fluid, however, everything began to move backward. The ship slipped toward and through a V-shaped meeting of fibers and, as they passed through, Morrison had the plain impression of a loose spiral making its way upward along each collagen fiber, the spiral being more marked on the thinner of the two. Up ahead was a thicker fiber still, a monarch of the collagen jungle. \"You\u0027ll have to turn, Arkady,\" said Konev. \"Now\u0027s the time to test it.\" \"All right, but I\u0027ll have to lean over. I don\u0027t have the controls neatly at my fingertips. There\u0027s a limit to improvization.\" He leaned forward, groping at a level about that of his calves. \"I do not relish the thought of having to do this constantly. It is hard on a man of portly habit.\" \"You mean a man who is fat,\" said Konev ill-naturedly. \"You have let yourself go flabby, Arkady. You should lose weight.\" Dezhnev straightened up. \"Very well. I will stop right now, go home, and begin to lose weight. Is this a time, Yuri, to lecture me?\" \"It is not a time for you to get emotional either, Arkady,\" said Boranova. \"Steer!\" Dezhnev bent over, suppressing a grunt. Slowly, the ship turned rightward in a gentle arc; or, to judge more literally by appearance, the thick collagen fiber drifted leftward as it approached - as did everything else. \"You will hit it,\" said Konev. \"Turn more sharply.\" \"It won\u0027t turn more sharply,\" said Dezhnev. \"Each motor is only so far off-center and I can\u0027t change that.\" \"Well, then, we will hit it,\" said Konev, an edge of anxiety in his voice. \"Then let us hit,\" said Boranova angrily. \"Yuri, do not go into panic over inconsequentials. The ship is tough plastic; that fiber is undoubtedly rubbery.\" And as she spoke, the prow of the ship began to pass the collagen fiber, with little room to spare. Watching through the port side of the ship, it was clear that the broadening beam of the ship would make contact. When the fiber was nearly level with Kalimin\u0027s seat, it happened. There was no scraping sound, only a very soft hiss could be detected. Not only was the fiber rubbery, as Boranova had said, so that it compressed slightly under the force of the collision, then rebounded, pushing the ship a trifle away - but the slimy intercellular fluid served as a cushion and a friction reducer. The ship continued to move and turned leftward in the direction of the fiber. Dezhnev said, \"I shut off the motor as soon as I saw we were about to make contact. This leftward turn we\u0027re going through now is a friction turn.\" \"Yes,\" said Konev, \"but what if you had wanted to turn in the other direction?\" \"Then I would have used the motor. Or, considerably earlier in our progress, I would have made a turn toward a graze with the fiber to the right. That fiber would have turned us rightward. The main thing, in any case, is to use the motors as little as possible and the fibers as much as possible. In the first place, we don\u0027t want to consume our supply of energy too rapidly. In the second place, the rapid output of energy increases the chances of spontaneous deminiaturization.\" \"What!\" cried Morrison. He turned to Boranova. \"Is that true?\" \"It\u0027s not an important effect,\" said Boranova, \"but it\u0027s true. The chances go up a bit. I should say that conservation is the more important of the two reasons for saving energy.\" But Morrison could not repress his anger. \"Don\u0027t you see how ridiculous - no, criminal - this whole situation is? We\u0027re in a ship that simply isn\u0027t up to the task and everything we do makes it worse.\" Boranova shook her head. \"Albert, please. You know we have no choice.\" \"Besides,\" said Dezhnev, grinning, \"if we manage to do the job in this unsuitable ship, think how much more remarkable that will make us. We will be heroes. Authentic heroes. We will surely get the Order of Lenin - each one of us. It will be a foregone conclusion. And if we fail, it is comforting to think that we will be able to explain it as the ship\u0027s fault.\" \"Yes. Soviet heroes, win or lose, all of you,\" said Morrison. \"And what will I be?\" Boranova said, \"Remember, Albert, you will not be neglected if we succeed. The Order of Lenin has been given to foreigners on a number of occasions, including many Americans. Even if you should not want the honor for some reason, the success of your theories will be established and you may receive a Nobel Prize before any of us do.\" \"We\u0027re in no position to count our chickens,\" said Morrison. \"I shall refrain from composing my Nobel acceptance speech for just a while, thank you.\" \"Actually,\" said Kaliinin, \"I wonder if we\u0027re in a position to reach a neuron.\" \"What\u0027s the difficulty?\" asked Dezhnev. \"We can move and steer and we\u0027re outside the capillary and in the brain. Just out there is a neuron, any number of them, billions of them.\" \"Just out where?\" Kaliinin asked. \"I don\u0027t see any neurons. Just collagen fibers.\" Dezhnev said, \"How much of this intercellular fluid do you think there is?\" \"A microscopic thickness,\" said Kaliinin, \"if we were normal in size. However, we\u0027re the size of a glucose molecule and, relative to ourselves, there may be a kilometer\u0027s distance or more to the nearest neuron.\" \"Well, then,\" said Dezhnev, \"we\u0027ll move our ship a kilometer. It may take a little time but it can be done.\" \"Yes, if we could move in a straight line, but we\u0027re in the middle of a dense jungle. We have to turn and twist around this fiber and that and, in the end, we may travel fifty kilometers by our own measurement and find ourselves back at our starting point. We\u0027re just going to be blundering through a maze and we won\u0027t reach a neuron except by sheerest accident.\" \"Yuri has a map,\" said Dezhnev, sounding a little nonplussed. \"Yuri\u0027s cerebro-whatever-\" Konev, frowning, shook his head. \"My cerebrograph shows me the circulatory network of the brain and the cell pattern, but I can\u0027t expand it to the point where it will indicate our position in the intercellular fluid between cells, We don\u0027t know that sort of fine detail and we can\u0027t get out of cerebrography any more than we can put into it.\" Morrison looked through the wall of the ship. In all directions, the collagen fibers could be made out, overlapping and blocking them in. In no direction could the eye see through them very far and in no direction was there any sign of anything but fiber upon fiber. No nerve cells! No neurons!","sourceLink":"https://allnovel.net/fantastic-voyage-ii-destination-brain/page-12.html","bookId":1739,"book":{"id":1739,"title":"Fantastic Voyage II: Destination Brain","description":"Storyline: Deep within Russia, would-renowned scientist Pyotor Shapirov lies in a coma. Locked within his brain rests the key to the greatest scientific advance in the world\u0027s history. Only one scientist can hope to locate this secret—Dr. Albert Jonas Morrison, an American. Morrison\u0027s mission: to be miniaturized to molecular size along with a team of four Soviet scientists, travel in a specially designed submarine to the dying Shapirov\u0027s brain, and tap the secrets held there. Morrison and his companions have only twelve hours to accomplish their task—in the face of unexpected terrors and with their own lives hanging precariously in the balance. With his phenomenal two-million-copy bestseller Fantastic Voyage, Isaac Asimov took the world on its first amazing journey into the human body. Now, twenty year later, after deeper exploration into one of the most fascinating areas of science, Dr. Asimov delivers an all-new thriller that transports you to the far reaches of inner space. Electrifying, astonishing, and remarkably realistic, this new novel is certain to become a science fiction classic.","cover":"https://allnovel.net/images/fantastic-voyage-ii-destination-brain.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/fantastic-voyage-ii-destination-brain.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:14:47 AM"}}
