{"id":94426,"no":12,"title":"Page 12","content":"Revjak\u0027s smile widened nearly enough to take in his ears when he saw that the rumors were true, that Bruenor Battlehammer had returned to Icewind Dale. The two had lived side by side for the first forty years of Revjak\u0027s life, but during that time the barbarian had little experience with Bruenor, other than as enemies. But then Wulfgar had united the nomadic tribes and cast them into the war as allies of the folk of Ten-Towns and the dwarves of Clan Battlehammer against evil Akar Kessel and his goblinoid minions.\\n\\n On that occasion, less than a decade before, Revjak had come to appreciate the strength and fortitude of Bruenor and of all the dwarves. In the few weeks that had followed, before Bruenor and Wulfgar had set out to find Mithril Hall, Revjak had spent many days with Bruenor and had forged a fast friendship. Bruenor was going to leave, but the rest of Clan Battlehammer would remain in Icewind Dale until Mithril Hall was found, and Revjak had taken on the responsibility of tightening the friendship between the giant barbarians and the diminutive dwarves. He had done\\n\\n such a fine job that many of his people, Berkthgar included, had opted to go south with Clan Battlehammer to join in the fight to reclaim Mithril Hall, and there they had stayed for several years.\\n\\n It seemed to wise Revjak that Berkthgar had forgotten all of that, for when the giant warrior entered the tent to join in the meeting with Bruenor and Stumpet, his face was locked in a deep and unrelenting scowl.\\n\\n \"Sit, Berkthgar,\" Revjak bade the man, motioning to a spot beside him.\\n\\n Berkthgar held out his hand, indicating that he would remain standing. He was trying to be imposing, Revjak knew, towering over the seated dwarves. If hardy Bruenor was bothered at all, though, he didn\u0027t show it. He reclined comfortably on the thick blanket of piled skins so that he did not have to crook his neck to look up at the standing Berkthgar.\\n\\n \"Ye\u0027re still looking like yer last meal didn\u0027t taste so good,\" the dwarf remarked to Berkthgar.\\n\\n \"Why has a king come so far from his kingdom?\" Berkthgar retorted.\\n\\n \"No more a king,\" Bruenor corrected. \"I gived that back to me great-great-great-great grandfather.\"\\n\\n Revjak looked at the dwarf curiously. \"Gandalug?\" he asked, remembering the improbable story Berkthgar had told him of how Bruenor\u0027s ancestor, the original Patron of Clan Battlehammer and the founder of Mithril Hall, had returned from the dead as a prisoner of the drow elves.\\n\\n \"The same,\" Stumpet answered.\\n\\n \"Yerself can call me prince,\" Bruenor said to Berkthgar, who huffed and looked away.\\n\\n \"Thus you have returned to Icewind Dale,\" Revjak intervened, before the discussion could turn ugly. It seemed to the barbarian leader that Bruenor did not appreciate the level of antipathy Berkthgar had cultivated for the dwarves-either that, or Bruenor simply didn\u0027t care. \"You\u0027re here to visit?\"\\n\\n \"To stay,\" Bruenor corrected. \"The mines are being opened as we sit here talkin\u0027. Cleaning out the things that\u0027ve crawled in and fixing the supports. We\u0027ll be taking ore in a week and hammering out goods the day after that.\"\\n\\n Revjak nodded. \"Then this is a visit for purposes of business,\" he reasoned.\\n\\n \"And for friendship,\" Bruenor was quick to reply. \"Better if the two go together, I say.\"\\n\\n \"Agreed,\" Revjak said. He looked up to notice that Berkthgar was chewing hard on his lip. \"And I trust that your clan will be fair with its prices for goods that we need.\"\\n\\n \"We\u0027ve got the metal, ye\u0027ve got the skins and the meat,\" Bruenor answered.\\n\\n \"You have nothing that we need,\" Berkthgar interjected suddenly and vehemently. Bruenor, smirking, looked up at him. After returning the look for just a moment, Berkthgar looked directly to Revjak. \"We need nothing from the dwarves,\" the warrior stated. \"All that we need is provided by the tundra.\"\\n\\n \"Bah!\" Bruenor snorted. \"Yer stone speartips bounce off good mail!\"\\n\\n \"Reindeer wear no mail,\" Berkthgar replied dryly. \"And if we come to war with Ten-Towns and the allies of Ten-Towns, our strength will put the stone tips through anything a dwarf can forge.\"\\n\\n Bruenor sat up straight and both Revjak and Stumpet tensed, fearing that the fiery red-bearded dwarf would pounce upon Berkthgar for such an open threat.\\n\\n Bruenor was older and wiser than that, though, and he looked instead to Revjak. \"Who\u0027s speaking for the tribe?\" the dwarf asked.\\n\\n \"I am,\" Revjak stated firmly, looking directly at Berkthgar.\\n\\n Berkthgar didn\u0027t blink. \"Where is Aegis-fang?\" the giant man asked.\\n\\n There it was, Bruenor thought, the point of it all, the source of the argument from the very beginning. Aegis-fang, the mighty warhammer forged by Bruenor himself as a gift to Wulfgar, the barbarian lad who had become as his son.\\n\\n \"Did you leave it in Mithril Hall?\" Berkthgar pressed, and it seemed to Bruenor that the warrior hoped the answer would be yes. \"Is it hanging useless as an ornament on a wall?\"\\n\\n Stumpet understood what was going on here. She and Bruenor had discussed this very point before they had set out on the return to Icewind Dale. Berkthgar would have preferred it if they had left Aegis-fang in Mithril Hall, hundreds and hundreds of miles away from Icewind Dale. So far away, the weapon would not have cast its shadow over him and his own great sword,\\n\\n Bankenfuere, the Northern Fury. Bruenor would hear nothing of such a course, though. Aegis-fang was his greatest accomplishment, the pinnacle of his respectable career as a weaponsmith, and even more importantly, it was his only link to his lost son. Where Bruenor went, Aegis-fang went, and Berkthgar\u0027s feelings be damned!\\n\\n Bruenor hedged for a moment on the question, as if he was trying to figure out the best tactical course. Stumpet was not so ambivalent. \"The hammer\u0027s in the mines,\" she said determinedly. \"Bringed by Bruenor, who made it.\"\\n\\n Berkthgar\u0027s scowl deepened and Stumpet promptly attacked.\\n\\n \"Ye just said the dale\u0027ll give ye all ye\u0027re needin\u0027,\" the priestess howled. \"Why\u0027re ye caring for a dwarf-made hammer, then?\"\\n\\n The giant barbarian didn\u0027t reply, but it seemed to both Bruenor and Revjak as if Stumpet was gaining the upper hand here.\\n\\n \"Of course that own sword ye wear strapped to yer back was not made in the dale,\" she remarked. \"Ye got it in trade, and it, too, was probably made by dwarves!\"\\n\\n Berkthgar laughed at her, but there was no mirth in Revjak\u0027s tent, for his laugh seemed more of threat than of mirth.\\n\\n \"Who are these dwarves who call themselves our friends?\" Berkthgar asked. \"And yet they will not give over to the tribe a weapon made legendary by one of the tribe.\"\\n\\n \"Yer talk is getting old,\" Bruenor warned.\\n\\n \"And you are getting old, dwarf,\" Berkthgar retorted. \"You should not have returned.\" With that, Berkthgar stormed from the tent.\\n\\n \"Ye should be watchin\u0027 that one,\" Bruenor said to Revjak.\\n\\n The barbarian leader nodded. \"Berkthgar has been caught in a web spun of his own words,\" he replied. \"And so have many others, mostly the young warriors.\"\\n\\n \"Always full o\u0027 fight,\" Bruenor remarked.\\n\\n Revjak smiled and did not disagree. Berkthgar was indeed one to be watched, but in truth, there was little Revjak could do. If Berkthgar wanted to split the tribe, enough would agree and follow him so that Revjak could not stop him. And even worse, if Berkthgar demanded the Right of Challenge for the leadership of the united tribe, he would have enough support so that Revjak would find it difficult to refuse.\\n\\n Revjak was too old to fight Berkthgar. He had thought the\\n\\n ways of the barbarians of Icewind Dale changed when Wulfgar had united the tribes. That is why he had accepted the offered position as leader when Wulfgar had left, though in the past such a title could be earned only by inheritance or by combat, by deed or by blood.\\n\\n Old ways died hard, Revjak realized, staring at the tent flap through which Berkthgar had departed. Many in the tribe, especially those who had returned from Mithril Hall, and even a growing number of those who had remained with Revjak waxed nostalgic for the freer, wilder days gone by. Revjak often happened upon conversations where older men retold tales of the great wars, the unified attack upon Ten-Towns, wherein Wulfgar was captured by Bruenor.\\n\\n Their nostalgia was misplaced, Revjak knew. In the unified attack upon Ten-Towns, the warriors had been so completely slaughtered that the tribes had barely survived the ensuing winter. Still, the stories of war were always full of glory and excitement, and never words of tragedy. With the excitement of Berkthgar\u0027s return along with the return of Bruenor and the dwarves, many remembered too fondly the days before the alliance.\\n\\n Revjak would indeed watch Berkthgar, but he feared that to be all he could do.\\n\\n Outside the tent, another listener, young Kierstaad, nodded his agreement with Bruenor\u0027s warning. Kierstaad was truly torn, full of admiration for Berkthgar but also for Bruenor. At that moment though, little of that greater struggle entered into the young man\u0027s thoughts.\\n\\n Bruenor had confirmed that Aegis-fang was in the dale!\\n\\n \"Might be the same storm that hit us near the Gull Rocks,\" Robillard remarked, eyeing the black wall that loomed on the eastern horizon before the Sea Sprite.\\n\\n \"But stronger,\" Deudermont added. \"Taking power from the water.\" They were still in the sunshine, six days out from Caerwich,\\n\\n with another eight to the Moonshaes, by Deudermont\u0027s figuring.\\n\\n The first hints of a head wind brushed against the tall captain\u0027s face, the first gentle blows of the gales that would soon assault them.\\n\\n \"Hard to starboard!\" Deudermont yelled to the sailor at the wheel. \"We shall go north around it, north around the Moonshaes,\" he said quietly, so that only Robillard could hear. \"A straighter course to our port.\"\\n\\n The wizard nodded. He knew that Deudermont did not want to turn to the north, where the wind was less predictable and the waters choppier and colder, but he understood that they had little choice at this point. If they tried to dodge the storm to the south, they would wind up near the Nelanther, the Pirate Isles, a place the Sea Sprite, such a thorn in the side of the pirates, did not want to be.\\n\\n So, north they would go, around the storm, and around the Moonshaes. That was the hope, anyway. In looking at the wall of blackness, often creased by a shot of lightning, Robillard was not sure they could run fast enough.\\n\\n \"Do go and fill our sails with your magical wind,\" Deudermont bade him, and the captain\u0027s quiet tone showed that he obviously shared the wizard\u0027s trepidation.\\n\\n Robillard moved to the rail of the poop deck and sat down, slipping his legs under the rail so that he was facing the mainmast. He held his left hand up toward the mast and called on the powers of his ring to create a gust of wind. Such a minor enchantment would not tax the powers of the wizard\u0027s mighty ring, and so Robillard enacted it again and again, filling the sails, launching the Sea Sprite on a swift run.\\n\\n Not swift enough. The black wall closed in on them, waves rocking the Sea Sprite and soon turning her ride into more of a bounce than a run. A grim choice lay before Deudermont. He could either drop the sails and batten everything down in an attempt to ride out the storm, or keep up the run, skirting the edge of the storm in a desperate attempt to slip off to the north of it.\\n\\n \"Luck be with us,\" the captain decided, and he tried the run, keeping the sails full until, at last, the storm engulfed them.\\n\\n She was among the finest ships ever built, crewed by a hand-picked group of expert sailors that now included two powerful\\n\\n wizards, Drizzt, Catti-brie and Guenhwyvar, and she was captained by one of the most experienced and well-respected seamen anywhere along the Sword Coast. Great indeed were the powers of the Sea Sprite when measured by the standards of man, but tiny she seemed now in the face of the sheer weight of nature. They tried to run, but like a skilled hunter, the storm closed in.\\n\\n Guide ropes snapped apart and the mast itself bent for the strain. Robillard tried desperately to counter, so did Harkle Harpell, but even their combined magic could not save the mainmast. A crack appeared along the main vertical beam, and the only thing that saved it was the snapping of the horizontal guide beam.\\n\\n Out flapped the sail, knocking one man from the rigging to splash into the churning sea. Drizzt moved immediately, yelling to Guenhwyvar, calling the panther to his side and then sending her over the rail in search of the sailor. Guenhwyvar didn\u0027t hesitate-they had done this before. Roaring all the way, the cat splashed into the dark water and disappeared immediately.\\n\\n Rain and hail pelted them, as did the walls of waves that splashed over the bow. Thunder boomed all about the tossing ship, more than one bolt of lightning slamming into the tall masts.\\n\\n \"I should have stopped the run sooner!\" Deudermont cried, and though he screamed with all his strength, Drizzt, standing right beside him, could barely hear him over the roar of the wind and the pounding of the thunder.\\n\\n The drow shook his head. The ship was nearly battened down, most of the crew had gone below, and still the Sea Sprite was being tossed wildly. \"We are on the edges because of the run,\" the drow said firmly. \"If you had stopped earlier, we would be in the heart of the storm and surely doomed!\"\\n\\n Deudermont heard only a few of the words, but he understood the gist of what his dark elven friend was trying to communicate. Grateful, he put a hand on Drizzt\u0027s shoulder, but suddenly went flying away, slamming hard against the rail and nearly toppling over, as a huge wave nearly lay the Sea Sprite down on her side.\\n\\n Drizzt caught up to him in an instant, the drow\u0027s enchanted bracers and sheer agility allowing him to navigate on the rocking deck. He helped the captain to his feet and the two struggled for the hatch.\\n\\n Deudermont went down first, Drizzt stopping to survey the deck, to make sure that everyone else had gone below. Only Robillard remained, wedged in with his thighs pressing against the rail, cursing the storm and throwing magical gusts into the teeth of the raging wind. The wizard noticed that Drizzt was looking at him, and he waved the drow away, then pointed to his ring, reminding Drizzt that he had enough magical power to save himself.\\n\\n As soon as he got into the cramped deck below, Drizzt took out the panther figurine. He had to hope that Guenhwyvar had found the sailor and had him in her grasp, for if he waited any longer, the man would surely be drowned anyway. \"Go home, Guenhwyvar,\" he said to the statue.\\n\\n He wanted to call Guenhwyvar back almost immediately, to find out if the man had been saved, but a wave slammed the ship and the figurine flew off into the darkness. Drizzt scrambled, trying to follow its course, but it was too cramped and too dark.\\n\\n In the blackness belowdecks, the terrified crew had no way of really knowing if this was the same storm that had battered them before. If it was, then it had indeed intensified, for this time, the Sea Sprite was tossed about like a toy. Water washed over them from every crack in the deck above, and only their frantic bailing, coordinated and disciplined despite the darkness and the terror, kept the ship afloat. It went on for more than two hours, two horrible gut-wrenching hours, but Drizzt\u0027s estimate of the value of Deudermont\u0027s run was accurate. The Sea Sprite was on the fringe of the storm, not in its heart; no ship in all the Realms could have survived this storm in full.\\n\\n Then all went quiet, except for the occasional thunder boom, growing ever more distant. The Sea Sprite was listing badly to port, but she was up.\\n\\n Drizzt was the first on deck, Deudermont right behind him. The damage was extensive, especially to the mainmast.\\n\\n \"Can we repair her?\" Drizzt asked.\\n\\n Deudermont didn\u0027t think so. \"Not without putting into port,\" he replied, not bothering to mention the fact that the nearest port might be five hundred miles away.\\n\\n Catti-brie came up soon after, bearing the onyx figurine. Drizzt wasted no time in calling to the panther, and when the cat came on deck, she was escorted by a very sorry-looking sailor.\\n\\n \"There is a tale for your grandchildren,\" Deudermont said in a chipper voice to the man, clapping him on the shoulder and trying to keep up the morale of those near him. The stricken sailor nodded sheepishly as two other crewmen helped him away.\\n\\n \"So fine a friend,\" Deudermont remarked to Drizzt, indicating Guenhwyvar. \"The man was surely doomed.\"\\n\\n Drizzt nodded and dropped a hand across Guenhwyvar\u0027s muscled flank. Never did he take the cat\u0027s friendship for granted.\\n\\n Catti-brie watched the drow\u0027s actions intently, understanding that saving the sailor was important to Drizzt for reasons beyond the drow\u0027s altruistic demeanor. Had the sailor drowned, that would have been one more weight of guilt laid across the shoulders of Drizzt Do\u0027Urden, one more innocent sacrificed because of the ranger\u0027s dark past.\\n\\n But that had not come to pass, and it seemed for a moment as if the Sea Sprite and all of her crew had survived. That happy notion fell away a moment later, though, when Harkle bounded over, asking a simple, but poignant question. \"Where is Robillard?\"\\n\\n All eyes turned to regard the forward rail of the poop deck, to see that the rail had split apart in precisely the spot where Drizzt had last seen the wizard.\\n\\n Drizzt\u0027s heart nearly failed him and Catti-brie rushed to the rail and began surveying the empty water.\\n\\n Deudermont didn\u0027t seem so upset. \"The wizard has ways to escape the storm,\" the captain assured the others. \"It has happened before.\"\\n\\n True enough, Drizzt and Catti-brie realized. On several occasions Robillard had left the Sea Sprite by use of his magic in order to attend a meeting of his guild in Waterdeep, even though the ship was sailing waters hundreds of miles removed from that city at the time.\\n\\n \"He cannot drown,\" Deudermont assured them. \"Not while he wears that ring.\"\\n\\n Both the friends seemed satisfied with that. Robillard\u0027s ring was of the Elemental Plane of Water, a powerfully enchanted device that gave the wizard many advantages on the sea, no matter the strength of a storm. He might have been hit by lightning, or might have been knocked unconscious, but more likely, he had been swept away from the Sea Sprite and forced to use his magic\\n\\n to get clear of the storm long before the ship ever did.\\n\\n Catti-brie continued her scan, and Drizzt joined her.\\n\\n Deudermont had other business to attend to, he had to figure out how he was going to get the Sea Sprite into a safe port. They had weathered the storm and survived, but that might prove to be a temporary reprieve.\\n\\n Harkle, in watching the captain\u0027s movements and in surveying the extensive damage to the schooner, knew it too. He moved quietly to Deudermont\u0027s cabin, hiding his eagerness until he was safely locked away. Then he rubbed his hands together briskly, his smile wide, and took out a leather book.\\n\\n Glancing around to ensure that no one was watching, Harkle opened a magical tome, one of the components he needed for his newest, and perhaps most powerful spell. Most of the pages were blank-all of them had been blank until Harkle had first cast his fog of fate. Now the first few pages read as a journal of Harkle\u0027s magical ride to join the Sea Sprite, and, he was glad to see, of his continuing experiences with the ship. To his absolute amazement, for he hadn\u0027t dared look so extensively at the journal before, even the blind seer\u0027s poem was there, word for word.\\n\\n The fog of fate was working still, Harkle knew, for neither he nor any other man had penned a single word into the journal. The continuing enchantment of the spell was recording the events!\\n\\n This exceeded Harkle\u0027s wildest expectations for the fog of fate. He didn\u0027t know how long this might continue, but he understood that he had stumbled onto something very special here. And something that needed a little boost. The Sea Sprite was dead in the water, and so was the quest that had apparently befallen Drizzt and Catti-brie, and by association, Harkle. Harkle wasn\u0027t one to be patient, not now. He waved his hand over the first of the many blank pages, chanting softly. He reached into a pouch and produced some diamond dust, sprinkling it sparingly onto the first of the still-blank pages.\\n\\n Nothing happened.\\n\\n Harkle continued for nearly an hour, but when he emerged from the cabin, the Sea Sprite was still listing, still drifting aimlessly.\\n\\n Harkle rubbed the stubble on his unshaven face. Apparently, the spell needed more work.\\n\\n Robillard stood on top of the rolling water, tapping his foot impatiently. \"Where is that brute?\" he asked, referring to the water elemental monster he had summoned to his aid. He had sent the creature in search of the Sea Sprite, but that had been many minutes ago.\\n\\n Finally, the azure blanket before the wizard rolled up and took on a roughly humanoid shape. Robillard gurgled at it, asking the creature in its own watery language if it had found the ship.\\n\\n It had, and so the wizard bade the elemental to take him to it. The creature held out a huge arm. It appeared watery, but was in truth much more substantial than any normal liquid. When the wizard was comfortably in place, the monster whisked him away with the speed of a breaking wave. \\n\\n","sourceLink":"https://allnovel.net/passage-to-dawn-legacy-of-the-drow-4/page-12.html","bookId":2130,"book":{"id":2130,"title":"Passage to Dawn (Legacy of the Drow #4)","description":"Storyline: Legacy of the Drow #4: Passage to Dawn \\n Revenge and Resurrection in a Frozen Wasteland! Drizzt and Catti-brie have been away from Mithral Hall for six long years, but the pain of a lost companion still weighs heavily on their strong shoulders. Chasing pirates aboard Captain Deudermont\u0027s Sea Sprite is enough to draw their attention away from their grief. Then a mysterious castaway on an uncharted island sends them back to the very source of their pain, and into the clutches of a demon with vengeance on his mind.\\n","cover":"https://allnovel.net/images/passage-to-dawn-legacy-of-the-drow-4.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/passage-to-dawn-legacy-of-the-drow-4.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:07:56 PM"}}
