{"id":85985,"no":25,"title":"Page 25","content":"\\n\\n Jake glances at him. Then me. He exhales, relieved.\\n\\n \"You\u0027re okay.\"\\n\\n If he says so, it must be true. I stare at everyone staring at me. The entire stupid cheerleading squad and all of the brainless hard-core jocks. This is great.\\n\\n I will the floor to open up and eat me alive.\\n\\n \"Hey, let\u0027s give her some space. Get back to the game, guys,\" Chris says. Thank God for him, just this once. \"And cheerleading. Get back to that, too.\" No one moves. \"Okay, fuck off, basically, is what I\u0027m saying. Fuck off!\"\\n\\n Everyone mumbles in assent and scatters back to opposite sides of the court. That\u0027s what it\u0027s like to be popular. Becky lingers a minute before remembering she\u0027s captain and Jake helps me into sitting position and I try to think of something clever and smart-ass to say, but I can\u0027t and it freaks me out.\\n\\n Chris crouches down and hands me his water bottle.\\n\\n \"Drink that.\" He looks so concerned I want to die. \"You\u0027ll feel better.\"\\n\\n I take a small sip and hand the bottle back. Maybe the first words out of my mouth don\u0027t have to be totally smart-ass. Just normal.\\n\\n But I have nothing.\\n\\n And that\u0027s when I notice Evan\u0027s not around. Gone. And then I wonder if he was ever here at all and my hands start shaking because seriously, what if he wasn\u0027t and I\u0027m losing it? I try to hide my hands, but Jake sees and he gives me this look and I still can\u0027t think of anything to say and it\u0027s quiet.\\n\\n And then Henley comes in and Evan is with her. Oh.\\n\\n \"What happened here?\"\\n\\n I wish for once she\u0027d look surprised to see me. I move to get up, but Jake puts a hand on my shoulder, stopping me, while Chris explains the situation to the best of his limited vocabulary. I meet Evan\u0027s eyes and I guess I\u0027m sending out the right go away vibes, because he skulks off to play basketball with the rest of the guys.\\n\\n When Chris is finished, Henley regards me carefully. Even she has more couth than to ask whether or not I\u0027ve been drinking or whatever in front of everyone. But it should be painfully obvious I haven\u0027t, because I don\u0027t look happy.\\n\\n \"Nurse\u0027s office,\" she says. \"Can you walk, Fadley?\"\\n\\n I get to my feet with Jake\u0027s unneeded assistance.\\n\\n \"I want to go home,\" I say.\\n\\n Except my voice cracks and just like that I\u0027m totally overwhelmed by how stupid this feels and the edges of my mouth start pulling themselves down like they always do when I\u0027m about to cry and then I realize I\u0027m about to cry. I cover my eyes. Don\u0027t cry.\\n\\n Don\u0027t cry.\\n\\n \"Fadley?\"\\n\\n \"I--\" If I don\u0027t lower my hands, they\u0027ll think I\u0027m crying anyway, and I can\u0027t let them think that so I drop my hands to my sides. \"I don\u0027t want to go to the nurse\u0027s office. I don\u0027t feel well. I want to go home.\"\\n\\n Jake and Chris stare at me funny. Maybe they think it\u0027s a crock. I mean, even Henley doesn\u0027t really seem convinced, but she never does.\\n\\n But Bailey believes me. I spend the evening sitting in a chair by my window and he guards me diligently, ready to ward off any intruders that dare disturb me. He actually growls a little the first time my bedroom door opens, but he wags his tail when he sees it\u0027s Mom. It\u0027s Mom, even though I told her to leave me alone because I know I make her feel the worst when I make her feel useless.\\n\\n She tugs at a strand of my hair and sighs.\\n\\n \"At least let me even out the edges, Parker.\"\\n\\n I rub my wrist. I wish it was there. The bracelet.\\n\\n \"If I do, will you let me stay home from school for the next two days?\"\\n\\n She\u0027s quiet for a long time, debating it.\\n\\n \"Fine,\" she finally says. \"I\u0027ll get the scissors. Meet me in the kitchen.\"\\n\\n Bailey follows me downstairs, where Mom\u0027s set up barbershop--a chair atop scattered newspapers in the middle of the room. She stands behind it, waiting, scissors in one hand. I sit.\\n\\n \"I worry about you, Parker,\" she says, gently pushing my head forward. I want to tell her to join the club and then I want to tell her how boring that makes her and to not be so tedious. But I don\u0027t. Snip, snip, snip. \"You used to talk to me.\"\\n\\n But I never said anything.\\n\\n \"You were so...\"\\n\\n Perfect. She never finishes, but I know if she had, that\u0027s what she would\u0027ve said. Perfect. You were so.\\n\\n When she\u0027s finished evening out my hack job, my hair that used to fall past my shoulders now stops at my chin. And it looks horrible.\\n\\n Which is good, I guess.\\n\\n EIGHTEEN\\n\\n \"Hey, Parker?\"\\n\\n I slam my locker shut. Evan.\\n\\n He\u0027s incredibly in-my-face for a guy who knows I want nothing to do with him, but at least I\u0027m more capable of handling myself now. During my two-day vacation I did a little cognitive behavior therapy and taught myself this anxiety transference trick, where I effectively turn the feeling that my heart wants to claw its way out of my chest into sheer annoyance and total anger every time I see him.\\n\\n Which means my hands might still shake, but the difference is that it\u0027s not going to end in total nervous collapse.\\n\\n Here\u0027s hoping it works.\\n\\n \"What.\" It\u0027s not a question; it\u0027s a statement. And I spit it at him.\\n\\n He cringes.\\n\\n \"I\u0027m sorry, I know you don\u0027t want to...\" He shifts and just blurts it out: \"Look, do you remember that party last year, I mean, like, at all?\"\\n\\n \"Why?\"\\n\\n \"Because--\" He takes one look at my face and shakes his head. \"You know what? Never mind. Chris said you didn\u0027t.\"\\n\\n \"Well, don\u0027t take him at his word or anything; he\u0027s only your best friend.\" My voice oozes sarcasm. In our old lives, Evan and I didn\u0027t like each other very much. This feels like slipping on a pair of comfortable old shoes. \"Thanks for wasting my time.\"\\n\\n \"I had to ask,\" he says, but he doesn\u0027t go.\\n\\n \"I barely remember it,\" I lie; if anything, I remember it too well. Then I pretend to spot someone over his shoulder. \"Oh, hi, Jenny! Have you welcomed Evan back yet?\"\\n\\n He turns white and whirls around. Jenny\u0027s not there, of course, and he should know that, but when he faces me, furious patches of red decorate his pale face.\\n\\n \"If anything, you\u0027re an even bigger bitch than you used to be,\" he mutters. He storms off, not knowing how reaffirming it is to hear that. I feel steadier on my feet than I have in days. Still got it.\\n\\n I put on a radiant smile for art and sit next to Jake.\\n\\n \"So, I think I\u0027ve finally got an idea for our project,\" I say without adding you know, the one that\u0027s due tomorrow? \"We might have to put in some time after school, but I didn\u0027t think you\u0027d mind very much.\"\\n\\n \"Forget it,\" Jake says. \"I already handed it in.\"\\n\\n \"Okay, so what we do is--\" I stop and process. \"What?\"\\n\\n \"While you were gone, I just did it. I took it home and I did it. Handed it in yesterday. You don\u0027t have to worry about it.\"\\n\\n \"Oh.\"\\n\\n \"Norton seemed to like it. So we\u0027ve got the period to draw whatever we want.\"\\n\\n I nod slowly. \"Okay.\"\\n\\n I get us paper from the supply closet and my mind is going a thousand thoughts a second but never settles on one. I used to be good at improvising.\\n\\n I set the paper in front of him.\\n\\n \"Why would you do that?\" I ask. \"I figured you had enough to deal with.\"\\n\\n \"You mean you felt sorry for me.\"\\n\\n \"Did I say that?\" He grabs a pencil and starts doodling. \"I don\u0027t feel sorry for you, but do you really think you could\u0027ve gotten yourself together enough to help me get our project finished? But be honest when you answer.\"\\n\\n \"That\u0027s not fair.\"\\n\\n \"You\u0027re the one who disappeared for two days.\"\\n\\n I snap my fingers.\\n\\n \"You know, you were acting strange on Monday,\" I finally say. \"Like, weird. I knew I shouldn\u0027t have gone to the dance with you--\"\\n\\n \"I was acting like how you wanted me to act,\" he points out calmly.\\n\\n \"Yeah, and then some.\"\\n\\n \"What\u0027s it to you?\"\\n\\n \"It\u0027s--\" Goddammit. I snap my fingers again. \"Are you trying to back me into a corner so I\u0027ll date you or something? Because here\u0027s a little advice for you: girls don\u0027t like being emotionally blackmailed.\"\\n\\n \"What am I blackmailing you with? I don\u0027t have anything you want.\"\\n\\n \"I--\"\\n\\n \"Look, I made this decision after the dance,\" he says. \"I don\u0027t want to screw around since you\u0027ve made it pretty clear you\u0027re not interested in actually starting anything. You should be happy. It works out for you better this way.\"\\n\\n \"I like it the other way,\" I say stupidly.\\n\\n \"Too bad.\"\\n\\n \"You can\u0027t just not like me. Feelings don\u0027t go away like that. Ask Chris. He\u0027s still totally in love with me and it\u0027s been months and months.\"\\n\\n But it occurs to me I don\u0027t know if that\u0027s true anymore.\\n\\n \"I\u0027ll get over it,\" Jake says, his eyes meeting mine.\\n\\n \"Fine, fine, fine,\" I say quickly, still snapping. I don\u0027t know why I care, but I don\u0027t like him getting to decide this. It\u0027s mine to decide. \"If that\u0027s the way you want it, let\u0027s go out. Let\u0027s go out tonight. I\u0027ll take you out. How about that?\"\\n\\n He falters. I can tell.\\n\\n \"I can\u0027t. I\u0027ll be at Chris\u0027s tonight.\"\\n\\n \"How about after? Or are you staying the night?\"\\n\\n \"I\u0027m staying. We\u0027re going to Whitney tomorrow, to this old car exhibit.\"\\n\\n \"Is Evan going to be there?\"\\n\\n \"Not that I\u0027m aware of.\"\\n\\n \"Why?\"\\n\\n He shrugs. \"Ask him yourself.\"\\n\\n I corner Chris on his way to his last class.\\n\\n \"Aren\u0027t you still best friends with Evan?\"\\n\\n He blinks. \"I like your hair. I\u0027m getting used to it.\"\\n\\n \"How come you didn\u0027t invite Evan to that stupid old car exhibit?\" \"Because Evan\u0027s not into stupid old cars?\" \\n\\n","sourceLink":"https://allnovel.net/cracked-up-to-be/page-25.html","bookId":1897,"book":{"id":1897,"title":"Cracked Up To Be","description":"Storyline: When \"Perfect\" Parker Fadley starts drinking at school and failing her classes, all of St. Peter\u0027s High goes on alert. How has the cheerleading captain, girlfriend of the most popular guy in school, consummate teacher\u0027s pet, and future valedictorian fallen so far from grace? \\n Parker doesn\u0027t want to talk about it. She\u0027d just like to be left alone, to disappear, to be ignored. But her parents have placed her on suicide watch and her conselors are demanding the truth. Worse, there\u0027s a nice guy falling in love with her and he\u0027s making her feel things again when she\u0027d really rather not be feeling anything at all. \\n Nobody would have guessed she\u0027d turn out like this. But nobody knows the truth. \\n Something horrible has happened, and it just might be her fault.\\n","cover":"https://allnovel.net/images/cracked-up-to-be.jpg","author":"Courtney Summers","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/cracked-up-to-be.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:10:02 PM"}}
