{"id":34878,"no":32,"title":"CHAPTER II","content":"THE CAPTURE OF THE \"ST. IAGO DE CUBA\" Our prize turned out to be the Don Cristoval—a craft notorious alike for her astounding sailing powers, for the insolent daring of her commander, and for the success with which she had hitherto eluded all our efforts to overhaul her. Her capture, therefore, was quite a feather in our caps, altogether apart from the fact that two hundred and forty-four negroes were stowed under her hatches, for whom we should in due course receive head-money. Brief as the struggle for her possession had been, it had not been altogether bloodless; for when we came to investigate, it was discovered that we had three men wounded, while, on the side of the slavers, their loss amounted to two killed and seven wounded, one of them being their skipper, the infamous Captain Lenoir—a Frenchman—whose skull I had cloven upon the instant of boarding, and who was found to be so desperately hurt that there appeared but little prospect of his surviving to take his trial. Having secured our prisoners, and made the wounded as comfortable as possible, we made the pre-arranged signal of success by hoisting three lanterns, one over the other, at the mainmast-head; after which we got the canvas set, and then disposed ourselves to wait as patiently as might be for a breeze to spring up and enable us to close with the corvette. Meanwhile, having nothing better to do, we released the cook and bade him go to work to cook the best dinner—or supper—for us that the resources of the ship would permit. It was not until some time after midnight that a soft, warm air came stealing out to us from off the land; and then we obtained an insight into the marvellous sailing powers of our prize that was a revelation to us. With a breeze so light that it had not strength to keep the mainsheet taut, the little witch sneaked along through the water at a good four and a half knots, with scarcely a ripple under her sharp bows to indicate that she was moving! We closed with the Narcissus about an hour later, when Mr. Richardson went on board—taking the wounded with him—to report, and to receive the skipper\u0027s instructions in reference to the prize. Shortly afterwards a boat came alongside with a request that I would proceed on board the corvette, leaving the prize in charge of one of the midshipmen. This I did, and, upon my arrival, discovered that our good-natured \"first\" had spoken so highly of my conduct that I was appointed prize-master, with instructions to select a crew of ten men, to return to the schooner with all speed, and to make the best of my way to Sierra Leone, there to await the arrival of the Narcissus. These orders I carefully carried out, arriving in the roadstead two days later, and exactly thirty hours in advance of the corvette. The Don Cristoval having been captured with negroes actually on board, the Mixed Commission promptly condemned her, while her crew were committed for trial; and upon the day following her condemnation I learned that the schooner had been purchased into the service for use against some of her equally notorious sisters. There was one craft in particular—a barque named the Josefa—that we were especially anxious to lay hands upon, as hitherto she—or rather, her skipper—had simply laughed at and defied us; but now, with the Don Cristoval in our possession, it was confidently believed that we should at length succeed in capturing the too-successful barque, and bringing her insolent commander and crew to justice. To capture such a craft would be fame indeed, and would almost certainly mean promotion as well—imagine, therefore, if you can, the delight with which I shortly afterwards received the intelligence that, through our skipper\u0027s representations, I had been appointed to the command of the Don Cristoval! So rapidly did I push forward our preparations that on the eighth day after our arrival we sailed again, my instructions being to thoroughly beat up every known spot frequented by slavers, and especially to keep a sharp look-out for the Josefa. \"From information received\" I had been enabled to accurately fix the date of the barque\u0027s last visit to the coast, from which I had no difficulty in calculating pretty closely when she might be expected in those waters again; and finding that I had plenty of time, I determined to stand to the southward and take a look in at the Congo, gradually working my way northward again from there. We made rather a long passage of it, taking things very quietly, in the hope that we might encounter some slave craft either making or running off the coast, in which case I hoped that ignorance of the fact that the Don Cristoval had fallen into our hands might enable us to make one or two very easy captures. But no such luck befell us, and it was not until we arrived at Banana—a small trading settlement at the mouth of the Congo—that we sighted a craft of any kind. There, however, anchored off French Point, at the mouth of Banana Creek, we came upon quite a little fleet, numbering eight sail in all, three of which were undoubtedly honest traders, beamy, round-bowed, motherly-looking craft, the best of which might possibly be capable of going seven—or maybe eight—knots with a gale of wind over her quarter; while the remaining five—consisting of a slashing brig, two smart brigantines, and two as wicked-looking schooners as I ever set eyes on—were as undoubtedly slavers. But in hoping, as I did, that I should catch some of these gentry napping, I was reckoning without my host; whether news of the capture of the Don Cristoval had already got wind and been spread along the coast, or whether there was something in the set of the schooner\u0027s canvas or our method of handling her that aroused their suspicions, I could not tell, but certain it is that when I boarded them their skippers one and all produced papers which certified to their absolute honesty, while they were virtuously indignant at the doubts which led me to intimate that I must nevertheless take the liberty of overhauling their holds. Of course no opposition was raised—they were fully aware that anything of that kind would have been worse than useless—but many a scowling look did I intercept, and many a muttered execration reached my ear as I proceeded with my search. Needless to say that my labour was all in vain; the rascals had been too smart for me; I found neither irons, nor farina, nor any excess of water-casks on board any of them to give colour to the suspicion that they were otherwise than honest; but all the same I was perfectly well aware that there was neither palm-oil nor ivory in anything like sufficient quantity in Banana to account for the presence of so many craft off its wharves. And upon my hinting as much to one of the traders ashore, he frankly admitted that such was the case, but he explained that large quantities of both were on their way down to the coast, and might be expected to arrive at any moment. I remained at anchor there for the next three days, prowling about on shore—taking the precaution to always go well armed—and exploring in a boat the intricate network of creeks in the neighbourhood, but I made no discoveries; and the only incident worthy of note that occurred during this period was the sudden sailing of one of the schooners within three hours of our arrival. On the evening of the third day I weighed and stood out to sea under a press of canvas, hauling up to the northward as soon as I had cleared the mouth of the river, carrying on until dark, in the hope of impressing those who I knew were watching me, with the belief that I had somehow obtained important intelligence upon which I was acting. But as soon as the night had closed down upon us sufficiently to conceal our movements, I wore round and stood to the southward again, finally anchoring in seventy fathoms of water at a distance of some twenty-two miles north-west of Padron Point. Having done this, I ordered the royal, top-gallant, and topsail yards to be sent down, and the fore-topmast to be housed, after which there was nothing for us to do but to possess our souls in patience and wait for some of the slavers to come out and fall into our clutches, as I felt confident they would in the course of a day or two, provided that in the meantime no inward-bound craft hove in sight to tempt us from our watching-place, or to slip past us and give the alarm. And I had every justification for this feeling of confidence, for two nights later, as I was in the very act of going below to turn in after chatting with the youngster who acted as my \"first,\" and who was in charge of the deck, the look-out aloft hailed— \"On deck, there!\" \"Hillo!\" I responded; \"do you see anything?\" \"Well, I ain\u0027t quite certain yet, sir, but for the last ten minutes I\u0027ve been thinkin\u0027 that there\u0027s a small spot of darkness showin\u0027 out again\u0027 the sky right ahead, and I thought I\u0027d better let you know, sir,\" was the answer. \"Quite right, my lad,\" I responded. \"Keep your eye on it, and I will send up the night-glass to you by way of the signal halliards.\" \"Ay, ay, sir,\" the fellow answered; and in another half-minute the glass was bent on and making its way aloft to the gingerly swaying away of the quartermaster, while a faint murmur of eager anticipation came floating aft from the forecastle upon the heavy, damp night breeze, which was blowing off the land. For several long minutes after the instrument had reached its destination we were kept upon the tenterhooks of suspense; but at length another hail, in low, cautious tones, came down from the mast-head— \"On deck, there! there\u0027s something coming out of the river, sir! No mistake about it this time, because her canvas has just shut out a star that\u0027s risin\u0027. And she\u0027s comin\u0027 along fast, too, sir; I can make her out quite distinct with the naked heye.\" \"Capital!\" I exclaimed; \"that is good news indeed! Can you make out how she is heading?\" \"Well, only in a general sort of way, sir,\" was the reply. \"She\u0027s steerin\u0027 this way, o\u0027 course, but she\u0027s edgin\u0027 away to the nor\u0027ard too. I reckon that if we stays where we are now, she\u0027ll pass us about a matter of three or four mile to the nor\u0027ard.\" \"Very well,\" I responded. \"Keep your eye upon her; do not lose sight of her for an instant. Now, Mr. Adams,\" I continued to the midshipman in charge of the deck, \"have all hands called, if you please, and let some of them man the capstan and get the anchor to the bows, while the rest get the fore-topmast on end and the yards across. And, remember, they will have to see with their hands, for no lights whatever must be shown. With only ordinary care we ought to nab that fellow easily.\" And we did, regulating our movements so accurately that, although we were soon afterwards discovered, we contrived to get alongside her within an hour, ranging up on her weather quarter and hailing her to heave-to, which she did without attempting any resistance; and a few minutes later we found ourselves masters of the St. Iago de Cuba—the brig I had boarded in the river—with three hundred and eighty-four slaves in her hold! I could spare but a very small prize crew to take her into Sierra Leone, I therefore took the precaution to put the whole of her people in irons; having done which, I sent her away in charge of my senior mid and ten men, giving him instructions to carry on day and night until his arrival. This done, we parted company, and I returned to my former lurking-place off the mouth of the Congo, where I was next day fortunate enough to capture a fine brigantine with three hundred and twelve slaves under hatches. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3135/86214.html","bookId":889,"book":{"id":889,"title":"Yule Logs","description":"简介： It was a grand success. Every one said so; and moreover, every one who witnessed the experiment predicted that the Mermaid would revolutionize naval warfare as completely as did the world-famous Monitor. Professor Rivers, who had devoted the best yea...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3135","creation":"Aug 1, 2019 12:23:48 AM","modification":"Aug 1, 2019 12:23:48 AM"}}
