{"id":34881,"no":35,"title":"ON A MEXICAN RANCHE","content":"There were few wider estates in Texas than that of Don Garcia Novales. It lay on the western frontier, and indeed nearly half of it lay on the Mexican side of the frontier line. Thousands of horses and tens of thousands of cattle ranged over its broad expanse. It is true that, with few exceptions, the whole of these animals were almost, if not quite wild. That was indeed rather an advantage, as they gave but little trouble to their owners till the time came when they were wanted for the market. Ten years before they were almost valueless, for there were no purchasers; but with the severance of Texas from Mexico a great change had taken place. American enterprise was changing the whole state of things. Capitalists were taking up great tracts of hitherto almost useless land, purchasing the titles for a trifle from the Mexican owners, and stocking them with cattle which they purchased from great ranches like that of Don Garcia Novales. Speculators bought herds to drive east into the border States, breaking them up and disposing of them by scores or hundreds to settlers there. The animals, therefore, which had hitherto been so valueless that they had scarcely been reckoned as one of the sources of income of their owner, now became an important item in his possessions. Don Garcia himself would gladly have dispensed with the addition. Like most of his countrymen, he hated the men who had disturbed the sleepy tranquillity of life in Texas. His income from his tobacco plantations, his mines in Mexico, the hides, and his cotton-fields, was larger than sufficed for his needs. His table was supplied from the estates. Horses, when required, could be lassoed, brought in, and broken in in any numbers. Indian corn, rice, sugar, the chief items of food of the slaves, were all raised on the estates, while meat was forthcoming to any amount. Save for dresses and jewels for his daughter, and a few imported luxuries, such as wine, the calls upon his purse were insignificant. The changes, then, that went on were a source of almost unmixed annoyance: there were complaints from his herdsmen, of cattle being driven off by parties of reckless whites; disputes arose with the cowboys of an American company which had purchased a large tract of land to the north, and more than one fray had taken place between his peons and their men, owing to the cattle of one or other party straying beyond their limits and getting mixed with those of their neighbour. He had, so far refused to resort to the method adopted by many other Mexican proprietors, of engaging several white overlookers and cowboys. These were paid but a small salary, but were given a fixed proportion—a third or a fourth—of the increase of the herds they looked after. It was therefore to their interest to guard them closely, and to protect them both from cattle-stealers and from the cowboys of other ranches. It was found that much trouble was saved by this method, and quarrels avoided with their unwelcome neighbours, while the profits were larger than those made when matters were looked after by the indolent natives. Don Garcia had for some time refused to adopt this method; but he hated trouble, and there were such constant complaints of theft from his herds that he began to feel that it would be necessary to adopt the practice, at any rate on the northern part of his estates. He had now, with his daughter, been paying a visit to a friend whose estate lay eighty miles to the south. The trip had its business side. Don Ramon de Vaga had a son, and the two fathers had agreed that an alliance between their houses would be a desirable matter. \"Horses, when required, could be lassoed.\" Some months before, Don Ramon and his son Don Pedro had paid a visit to the ranche of Don Garcia, but the result had not been altogether satisfactory. Pedro, a hot-headed young fellow who had never been thwarted in a single wish, had indeed been greatly struck with Isabella Novales. But the young se?ora had by no means been favourably impressed with him; his temper was an ungovernable one, and the violence with which on two or three occasions he treated his grooms for some trifling act of disobedience or forgetfulness, had excited her indignation and disgust. In her home, slaves were kindly treated; her father was of easy temper; he was proud of his race, which was of the purest Spanish, without the admixture of a single drop of Indian blood, and very proud of his daughter. He would have resented any slight upon the part of his equals; but so that everything went on with its usual regularity at the hacienda, he was content, and left its entire management to his major-domo, Sancho Valdez, in whom he had implicit confidence. The return visit was intended to undo the bad effect of the first. Don Ramon had assured his friend that he had spoken very strongly to his son, and pointed out to him that unless he put some restraint on himself, there was no probability that the match on which he had already set his mind would come off. Their visit, however, had not been altogether a success. Don Pedro had been most attentive to Isabella, and had studiously kept his temper in check; but the girl saw plainly enough that the slaves were all in the greatest fear of him, and that they shrunk as if expecting a blow when he addressed them. \"It is no use, father,\" she said one day before the termination of the visit, when she was alone with Don Garcia, \"for you to promise my hand to Don Pedro; nothing could induce me to marry him. I would rather a thousand times enter a convent, though I have always thought that anything would be better than a life between four walls, brought up as I have been, to mount my horse and gallop across the country as I choose; but even that would be preferable to a life with Don Pedro. He is handsome and can be agreeable, but he is a tyrant among his own people, and I should be most wretched; and I am convinced that the idea had better be altogether abandoned.\" Isabella was now between fourteen and fifteen, an age at which girls are not unfrequently married in Mexico, where they reach maturity some years younger than among Northern people. She was strikingly pretty, even for one of her race and age, and bade fair to be a beautiful woman in another year or two. She had lost her mother when she was but a year old, and had been the constant companion of her father from the time when she had learnt to sit on a quiet pony. By the time she was ten she could ride any broken horse on the estate, and was absolutely fearless in the saddle. Thus, while her figure retained the grace so general among the women of her race, her life in the open air had given it a firmness and vigour rare among them. She was a good shot with the rifle, and was often away on horseback with her dogs from early morning until dusk, when she would return with her game slung from the saddle behind her. Her position as the young mistress of the hacienda, within whose wide limits she reigned as a little queen, and her close intercourse with her father, had given her a certain decision and firmness in strong contrast to the languor and love of careless ease of Mexican girls. She was acquainted with every man on the estate, and was so thoroughly acquainted with its working, that her father frequently consulted her as to any changes he proposed making in the arrangements; and when she affirmed, with even more than her usual decision, that nothing could induce her to marry Don Pedro de Vaga, her father acquiesced in her decision, saying— \"Was often away on horseback with her dogs.\" \"Well, Isabella, if that is so, there is an end of the matter. I own that I am not myself altogether pleased with the young man. When I gave my word to his father that he should marry you, it was some years ago, and it appeared a very suitable match in all respects; but I guarded myself by saying that \u0027while I agree most heartily, Don Ramon, to your proposal, and will do all in my power to bring the match about, I say fairly that I have made up my mind that when the child comes to an age to know her own mind, I shall in no way force her inclination. My estates now are larger than one man can well manage, and it is not to increase them that I would marry my daughter to your son, but because you and I are old friends, and that I would gladly see our families united by a closer bond; therefore, while I will in every way further your son\u0027s suit, I will put no force upon her should she in time, though I have little fear of such a thing happening, feel repugnance to the match.\u0027\" \"Thank you, father. I am sorry indeed that in this case I cannot do as you would wish me, but Don Pedro is absolutely hateful to me; he is a tyrant, and I would rather pass my life as the poorest peon on the estate than trust myself to him. I believe him to be capable of anything, and the very thought of a life spent with him frightens me.\" \"Well, we will say no more about it, dear. I have already told Don Ramon that I feared it could never be, but I am sorry to say that my old friend would not take the refusal as final, and insisted that it was but a girlish freak on your part, and that in time you would come to look at matters more sensibly.\" \"Well, father, he will get the same answer whenever he comes, and the more seldom he comes the better I shall be pleased; but if he came once a month until I am a hundred, his answer would be always the same.\" \"At any rate, Isabel, we must receive him hospitably when he comes. I could not all at once explain the full extent of your dislike of the match to Don Ramon, and though I said that I did not think that you would alter your mind, I told him that at any rate his son would be welcome when he came, and if as time went on you should look more favourably on his suit, that matters could go on as we proposed. An abrupt statement of your views would have led to an estrangement between the families, which would be very painful to me, and I should be sorry indeed to have a quarrel with my old friend. In time I will write to him and tell him that your resolve is immovable.\" Don Garcia and his daughter started on their return journey in the family carriage drawn by six mules. Isabella\u0027s maid sat on the box with the driver, and four well-armed servants rode beside it. On the second day of the journey, as they were passing through a wood in a narrow valley, a shot was fired, and one of the servants fell from his horse; it was followed by a scattered discharge, and six men sprang out from the trees. Another of the servants was shot, the other two were pulled from their horses, while a man climbing on to the box with a pistol in his hand compelled the driver to alight and lie down in the road. The Spaniard and his daughter were then ordered to alight. As the former\u0027s pistols were unloaded, he was forced to obey, and was in the act of handing Isabella out when the sound of a horse\u0027s tread at full gallop was heard, and a moment later a young man dashed up. He was armed with a revolver, at that time a novel weapon; the pistol cracked twice, and two of the Mexicans fell, both shot through the head. Their companions with loud imprecations rushed at him, discharging their pistols and drawing their knives. He shifted the revolver to his left hand, and two more of the Mexicans fell, while the others with a shout of terror plunged into the wood. \"You had better loose your servants, se?or,\" the young man said quietly. \"I don\u0027t think the fellows will return; but it is as well to be prepared for them, and just at present I am not up to further fighting.\" The Don at once released the two servants, and angrily commanded the maid, who had been screaming loudly from the moment the first shot was fired, to be silent; gave the coachman a kick and told him to rise, and then turned to thank their rescuer. He had dismounted and was leaning against his horse, and Isabella was eagerly inquiring as to his injury. \"Do not alarm yourself, se?ora,\" he replied, \"it is of no consequence. My right arm is broken by a pistol bullet, and I have got another somewhere near my hip, I think; but do not trouble about me. I know some people a few miles away, and shall manage to get there somehow.\" \"I cannot think of such a thing, se?or,\" Don Garcia said; \"you have most nobly saved us from a great peril, and I cannot dream of leaving you here. You take your place in the carriage again, Isabella. I will see to this gentleman\u0027s wounds; I have had some experience that way, as you know.\" The arm was broken a short distance above the elbow. By Don Garcia\u0027s direction the coachman cut a strip of bark a foot long from a tree some four inches in diameter. The wound was first carefully bandaged, and then laid in the case of bark, which was tightly wound round it; a similar piece of bark was used as a sling to the forearm. To the other wound, which was an inch or two in front of the hip, nothing could be done save applying a bandage to stop the bleeding, which was, however, but slight. \"Now, se?or,\" he said, \"you must let us place you in my coach. I am Don Garcia de Novales; my hacienda is three days\u0027 journey, but by pressing the mules we will get there by to-morrow night, then you will have every care and attention, and I will send off one of my servants to-morrow morning, so that he may get a surgeon there by the time we arrive. The journey is a long one, but I think that you will do well to come with us; you certainly cannot sit your horse, and can hardly be so well attended to in any place about here.\" The young man murmured something about not liking to give trouble, but he was too faint to offer anything like a vigorous protest. Isabella was called out of the carriage, two pieces of wood were laid between the seats, and on these one of the cushions was placed, so that he could rest, and indeed lie down, for the carriage was a large one. While the Spaniard had been dressing the wound, the two servants had dug a shallow grave by the roadside, and in this they placed the bodies of their dead comrades and covered them with earth. They now assisted Don Garcia and the coachman to lift the young man into the coach, where he was laid in a reclining position, with blankets and rugs under his head and shoulders. The Spaniard took his place beside him, and Isabella occupied the remaining seat. The servants then mounted. \"We shall not stop where we intended,\" Don Garcia said to the coachman, \"we must get home to-morrow evening. We had best stop for the night at San Lorenzo, we can find accommodation at the priest\u0027s there. Be careful how you drive; you must go fast, but avoid all stones and rough places.\" The young man who had so opportunely come to their rescue was apparently scarce twenty years old, and though bronzed to a deep brown by the sun, his hair showed that his complexion was naturally fair. He was attired in a coloured flannel shirt, Mexican trousers with fringed sides, and high riding-boots. On his head he wore one of the thick stiff hats with wide brim, encircled with a scarlet and gold cord, in use alike by the cowboys and Mexican vaqueros. Isabella filled a cup with water and acidulated juice of fruit from a bottle hanging from the roof of the carriage, and handed it to her father, who held it to the young man\u0027s lips. He drank it eagerly. \"I am ashamed to be of so much trouble,\" he said faintly. \"Why should you be ashamed?\" Don Garcia asked heartily; \"you have rendered us an invaluable service. Doubtless they would have put us to a very heavy ransom, if worse had not befallen us. You are an American, I presume?\" \"No, I am English, se?or; my name is Harry Denham; but I have been knocking about this country for the last five years, sometimes working on a ranche, sometimes hunting. I have been staying for the last few days with a vaquero and his family. I was just starting north to look for work, as I could hear of none here, and as I came down upon the road I saw your coach ahead of me. I was a quarter of a mile behind when I heard some shots fired, and thinking that I might be of some use, I rode on at full speed, and of course did what I could.\" He was speaking very faintly now, and Don Garcia said, \"We will talk it all over later on; at present it would be best if you could doze off to sleep.\" Harry Denham, although still little more than a lad, had led a life of adventure for the past five years. He was but fourteen when his father, a consulting physician, died suddenly. Harry had been a year at Rugby, and would have returned to school in the course of a few days, when his father\u0027s death deranged everything. His mother had died some years before, and his brother Tom, who had now been a year at Cambridge, was his only near relative. The day after the funeral Tom returned from a visit to the office of his father\u0027s trustee, with whom he had had a long talk. \"What day do you think I had better go down to school, Tom?\" \"Well, Harry, I am sorry to say that I think there is very little chance of your going back at all, or of my returning to Cambridge.\" Harry opened his eyes in surprise—\"Why not?\" \"Well, because as far as I can see at present we are in a hole altogether. Mr. Ellerman has been telling me that, so far as he knows, there is really no property whatever. You see father had for years very uphill work. When ten years ago he moved into Harley Street, and set up as a consulting physician, he thought that, having made his mark as one of the staff of Guy\u0027s, and having a good private connection, he could soon obtain a practice. However, for the first three or four years it came in but slowly. Of course his expenses were heavy with this house and his carriage and all that sort of thing, and he had to borrow money. Things got better, and gradually he paid, I believe, most of this loan off. Still, he saw his way and was able to send me to Harrow. Then, of course, you have been for the last four years at an expensive school, preparing for Rugby, and everything was going on well till eighteen months ago he fell ill, as you know, and had to go away to the south of France for four months. That, of course, meant not only a heavy expense, but the loss of practice. \"He told me something about it before I went up last year, and, of course, I said at once that I would give up going to the \u0027Varsity, and would go in for the army or anything else he liked. I said that I would enlist for a year or two, and then, if things went on all right, he could buy me a commission—anyhow I did not want to be an expense to him; but he said, \u0027There is no occasion for that, Tom, things will soon improve again; I have no doubt that in a few months I shall be straight again.\u0027 Well, he was right, as far as the practice was concerned. I spoke to him about it when I came down last, and he said that he was now doing better again, and that there was no occasion for him to make any alteration in his plans for me or for you, and that in the course of a few months he expected that he should be a free man again, and could calculate upon making a clear ￡2000 a year. \"Well, you see, Harry, he did not have more than two months, and the result is that I was not surprised to-day, on talking the matter over with Mr. Ellerman, to hear that, although the loan he had obtained on his furniture is partly paid off, there is practically nothing left but the balance of what the furniture and the horses and carriage will fetch. Of course there are bills to be paid, and one thing and another, and I fancy that a couple of hundred pounds is about all that we shall have between us. The question is, What is to be done? It has not come quite as a surprise to me. For the last year, you see, I have known that everything depended on his health, and though I never thought of this, I did think that he might be obliged, as he was before, to give up practice again and go away to a warm climate, and I made up my mind that if he did so I would go out to America and rough it there. \"I spoke to Mr. Ellerman about it to-day—he was father\u0027s solicitor as well as trustee, you know—and he says that he thinks that it is about the best thing that I could do, and that a client of his has a large ranche down in Texas, and that he is sure that if he speaks to him about it he will give me an introduction to his agent, and that he will put me on to some work. That is all straightforward enough. The question is, What is to be done with you?\" \"Why cannot you take me out with you, Tom? I could do something, you know—I don\u0027t know what, but I suppose a boy is worth something out there, just as he is here; at any rate, I might earn my food, and not be much bother to you. Even if there were money to keep me at school, I would a thousand times rather do that than be here all by myself. Besides, I could not go to a good school, and I should hate to go to some beastly little place after being at Rugby. Besides, what could I do when I left school?—get a place in an office? I would a thousand times rather go out with you if you will take me.\" \"Well, you are a little beggar for that sort of thing, Harry,\" his brother said, looking at him as if estimating his strength. \"I am not little at all for my age, Tom; and I could thrash any fellow in my form at Rugby, anyhow.\" \"Well, I must think it over,\" Tom said. \"Of course I should like to have you with me; as you say, you might be able to earn your grub, and anyhow that cannot cost much out there, and I dare say there will be something left after paying our passage out; but it will be rough work for you, you know—precious hard work.\" \"Well, it will be much pleasanter work, at any rate, Tom, than grinding away at Greek and algebra.\" Tom did think it over, and the result was that after a consultation with Mr. Ellerman he told Harry that he would take him with him. Their trustee had fallen in with the idea at once. He was a man with a large family of his own, and the problem what to do with Harry had been on his mind ever since his client\u0027s death, and this solution of the difficulty was very welcome to him. Two months later Tom and his brother arrived at the ranche in Texas. Tom was at once attached to one of the parties of cowboys, and Harry was kept at the home station, and was to make himself generally useful in aiding the men in looking after the horses and herds maintained there. It was not long before he learnt to sit the most vicious broncho, and to throw a lasso fairly; then he was sent out as boy with one of the outfits. Here his duties were to look after the bunches of cowboy horses. He was earning wages now, whereas at the home station he had only got his grub; and when not engaged with the horses, he practised continually with his revolver—the greatest ambition of all the boys out on the plains being to become first-rate pistol shots. Six months later he received the sudden news that his brother Tom had been shot by one of the other cowboys in his outfit, a man who was notorious as one of the best shots there, and who in a quarrel had shot Tom down before the latter could even lay his hand on his pistol. This was a terrible blow to Harry, who had only seen his brother a few times since they came out, and who had hoped ere long that he should be posted to the same outfit with him. He learned that the deed had aroused such indignation among the other cowboys that Jake Swindon had been obliged to leave the ranche. Had the occurrence been altogether opposed to the rules governing the conduct of the cowboys in such matters, he would have been shot down at once; but there had been a serious quarrel, and according to their notions Tom should have been ready to draw when his companion did so; still, it was felt that as dealing with a young hand who had never been engaged in such an affair before, Jake had not given him a fair chance. Tom\u0027s belongings were handed over to Harry. For the next three years Harry practised assiduously with his revolver, and at the end of that time was acknowledged as being the best shot in his outfit. He was now regarded as no longer a boy, but took his place as a cowboy; he was now nineteen, and the life he had led had hardened and strengthened him exceedingly; he stood five feet ten, he was lithe and sinewy, and the muscles of his arms and shoulders stood up in cords through his clear skin. It now came to his knowledge that Jake was at work in an adjoining ranche, and taking two of his comrades with him, he rode over there. As usual, they were at once, on their arrival, invited to sit down and join the others at supper. \"I cannot do that,\" Harry said, \"until I have settled accounts with one Jake Swindon.\" A figure sprang at once to his feet with his hand behind him, but already Harry\u0027s pistol was levelled at his head. \"Hands up,\" he shouted. \"Now,\" he went on, \"I am not going to murder you in cold blood, as you murdered my brother, Tom Denham; I am going to give you a fair chance—more than a skunk like you deserves. Now, Dick, do you take thirty paces; we will be placed that distance apart, with our backs to each other, and when the word is given we will shoot as we like. That is fair, isn\u0027t it, boys?\" There was a murmur of assent. \"Very well. Now my two mates will walk with that fellow to his mark, I would not trust him not to shoot directly my back is turned. Two of you can walk with me if you like; but as I have not shot him now when I could do so face to face, I am not likely to do so when his back is turned. Now I want two others of you to stand close to us, pistol in hand, till the word is given, and if either of us moves before that, shoot him down. I want a third to give the signal; when you say one, the men standing by will draw back, and the two with pistols will level them at us; at the word three we turn round and can fire as we like. No one can say that I have not given this fellow a fair chance.\" \"No; that is fair enough,\" the other cowboys agreed, all greatly interested in this arrangement for a duel of a kind quite unknown to them, as in cowboy disputes the custom is for each to draw at once and fire as quickly as he can. Jake was led off, livid with rage. As a matter of formality, two of Jake\u0027s companions walked with Harry to the firing point, and two others drawing their colts, placed themselves a couple of yards from the combatants. There was a dead stillness for a moment, and then a voice asked, \"Are you ready? One,\" and the four men standing by the combatants stepped back; \"Two,\" and then after a pause, \"Three.\" As if moved by a spring, Harry and his opponent faced round. Both were confident in their skill, and neither held their fire a moment. Two shots rang out as one. Harry felt as if a hot iron had passed along his cheek. Jake\u0027s passion at being thus bearded by a mere lad had slightly unsteadied his hand, while Harry\u0027s arm was as steady as if carved in marble. Jake fell back with a bullet in the centre of his forehead. Even among the man\u0027s comrades there was no feeling of regret at his death; he was disliked and feared among them; he had in the course of his career killed a dozen men, and the retribution that had fallen upon him was felt to be richly deserved. A week later Harry rode in to headquarters, and told the manager that he had better send another man out to take his place, for that he wanted a change for a bit, and intended to go shooting. He drew the hundred pounds remaining after paying their expenses out, and which Tom had deposited in the manager\u0027s care, and paying for the horse that he had ridden in, which was the best of those he had used at his work, he rode to the nearest town, some sixty miles away, bought a rifle and a large store of ammunition, some tea, sugar, and flour, and started out again for the plains. Here for six months he hunted game, taking the skins in for sale occasionally to the towns, paying his expenses and enjoying the life. Then he rode down south in search of employment on one of the Mexican ranches, but failing to find anything to suit him, was returning north when he came upon the band engaged in the attack on Don Garcia\u0027s carriage. It was a month before Harry Denham was convalescent. The surgeon had fortunately found and extracted the ball from his hip on the day following his arrival at the hacienda; but he had for several days lain between life and death. Then youth and a constitution hardened by hard exercise, and the life he had been leading, triumphed, and he slowly recovered. Don Garcia had been unremitting in his attention to him; Isabella had visited his sick-room several times each day, and had seen to his comforts. When he began to recover, the father and daughter talked over what should be done for him. Many times indeed they had discussed how they could best recognise the service that he had done for them. After hearing from him his story they felt that he would strongly resent the offer of any pecuniary payment. But one day when he had been saying that he liked the life he had been leading, and that although without capital it could not be said to be a paying one, it seemed to him that there was a fascination about the constant adventure and excitement, the life in the open air, and the hard exercise, that as soon as he got well enough to take part in it again, he should look for a fresh berth, Don Garcia said to his daughter, \"Do you know, last night a scheme occurred to me by which he will better his fortunes without hurting his feelings.\" \"What is that, father?\" she asked eagerly. \"You know that we have been having constant bothers with the new people of the north, and several of our vaqueros have been killed, and I can obtain no redress, for the white cowboys all declare that the vaqueros are the aggressors. This young fellow is accustomed to the work, and I don\u0027t think that I could do better than place him in charge of the northern herds, paying him by commission on their increase, giving him say a third. The thing would be mutually advantageous to us. I should let him choose his own hands, and he could either take vaqueros or American cowboys, and I should get rid of a great deal of trouble, while he, in a few years, would have a good chance of making a fortune. I believe there are some 20,000 head of cattle up there, for the most part cows, and the increase, if they were well managed, should be 15,000 a year. Perhaps the best way would be to give him half, and let him pay his own hands.\" Isabella\u0027s face showed that she heartily approved of the plan, and the next day, when Harry was called into the veranda, Don Garcia proposed it to him. \"It will be a mutual accommodation to us, Se?or Denham,\" he said, after unfolding the plan. \"I have had continual trouble there for the last three years, and it has lately been getting intolerable. The Americans care nothing for our vaqueros; but if we work cattle on their system with white men or with a mixture of whites and vaqueros, we should have no more trouble. What do you say?\" \"I can only say that I gratefully accept your offer, se?or; it is a magnificent chance for me, far better than anything that I have ever dreamt of. I know that herds are often worked on shares, but not a herd so large as yours. I accept your offer gratefully.\" \"Well, you must make haste and get strong again, so as to take charge before I have any fresh troubles. Here comes my daughter, she will be pleased to hear that the matter is arranged.\" A month later Harry Denham entered upon his duties as overseer of the northern herds. He had already sent a message to some of the best men on the ranche on which he had worked, and they had at once thrown up their berths and joined him. He had also six vaqueros chosen from those working on the estates; these he had only selected after he had gained strength enough to ride out with the herds, and had seen them at work. A negro cook completed the outfit. Don Garcia had advanced him a sum of money for the payment and keep of the men, until the sales of animals should commence. One of the cowboys who had before been boss of an outfit was appointed as head of the party. Harry himself had to look after the general supervision and provisioning; for although able to sit on a horse, he was unfit for the hard work of a cowboy\u0027s life, and in order to avoid the heat of the plain he erected a hut for himself among the hills some five miles from the headquarters of the outfit. Here he would be able to do a little hunting and shooting, so as to vary the diet of the camp, while he was conveniently situated, riding over to the hacienda seven miles away to procure supplies. Six months passed; everything had gone well; the work of branding the calves was over, and had passed off without trouble. He had found that it was impossible to prevent the cattle at times from wandering from the limits of the estate or to restrain others from entering it; he had therefore, with Don Garcia\u0027s approval, adopted the system in use at the American ranches, by which the cattle were by no means confined to a certain tract of land, but wandered indiscriminately, sometimes mixing with other herds, and being separated only once in six months, on the occasion of the great assemblage of all the cattle, known as the round up. \"The great assemblage of all the cattle, known as the round up.\" At the hacienda Denham was received most cordially by Don Garcia, who always insisted on his coming in and smoking a cigar with him, and who, after the usual report as to the state of the herd, asked many questions as to his own country. Isabella was generally present, or if out of the room when he first came, was sure to appear, shortly followed by a servant with a jug of cooling drink, which she would herself pour out and place before her father and Harry. Six months after he had commenced his duties as overseer, Don Garcia said to him, \"I told you the errand from which we were returning when you rescued us from those brigands.\" \"Yes, se?or, it was the question of the marriage of the se?oretta.\" \"That affair is quite over now; the young man wrote very handsomely, saying that he would do everything in his power to curb his hasty temper, assuring her that he loved her passionately. I was touched by his letter, which my daughter showed me, and by one which I myself received from his father, and was in favour of giving the young man a chance; but as my daughter is even more determined than before to have nothing to say to him, I fear that it will cause a quarrel between the two families.\" \"I should say that that was of very slight consequence compared with the happiness of your daughter, se?or. In our country a father may object to his daughter marrying a person of whom he does not approve, and may even, according to law, prevent her doing so before she comes of age; but he would never dream of compelling her to marry a man to whom she objected—he would have no shadow of right to do so.\" \"With us matters are settled by the parents, Don Henry,\" the Spaniard said gravely, \"and I think it is far better so in most cases; but having lost my wife many years ago, and Isabella being my only child, I have been too indulgent, and let her have too completely her own way, and I certainly could not bring myself to offer her the alternative of taking the veil or marrying the man I choose for her.\" \"But I understand, se?or, that although you at first thought of this Don Pedro as your son-in-law, you yourself, on closer acquaintance with him, felt that he would not make the Se?oretta Isabella happy.\" \"Yes, that is so; but I think that I was a little hasty and harsh; his letter is a charming one.\" Harry Denham remained silent. \"No one could have written better,\" the Don went on, and there was an interrogation in his tone. \"I do not know Don Pedro, se?or. As for writing a charming letter, it seems to me that any one could do that. I cannot help thinking that the se?oretta, who is good and kind to every one, would not have taken such a strong objection to him without there being some good reason for so doing.\" \"It is a caprice on her part,\" the Don said irritably; \"he has good manners, he is handsome, rich, and of a family equal to her own. He is passionate, I admit, and I do not like his ways with his slaves and peons, but, after all, I suppose there is no one perfect.\" \"I should think, se?or,\" Harry said quietly, \"that your daughter, who loves you dearly, as all can see, would not have opposed your wishes upon a mere caprice; a man who is harsh to his servants, or even to a horse or a dog, would be likely to be harsh to his wife.\" \"Well, at any rate, it is settled,\" the Spaniard said, lighting a fresh cigar with short irritable puffs; \"I have this morning sent off a letter of regret to my friend, saying that my daughter\u0027s inclinations remain unchanged, and that, as her happiness is my first consideration, it is impossible that the proposed match can take place. Now, I suppose, I shall have trouble. It is too annoying, coming just when I have got rid of the troubles with the Americans. Somehow one never seems to have peace.\" Looking round the luxuriously furnished room, and thinking of the wide possessions and easy life that he led, Harry had difficulty in repressing a smile at the querulous tone of the complaint. The conversation was in Spanish, which Denham had learned to speak fluently during his five years\u0027 residence on the plain, where, among his companions, were generally a proportion of Mexicans. The next evening, as he was sitting with his men after his supper was over and their pipes lighted, he said, \"By the way, do any of you know anything about a young Mexican named Pedro de Vaga? His father\u0027s hacienda is some eighty miles to the south.\" \"I know the place,\" one of the men said: \"it is a big estate, not so large as this in point of size, but better land, and he owns a good many more slaves than Don Garcia does. I was working down near there two years ago, and I heard a good many stories of this Don Pedro. The old man, they say, is a kind master; but the young one is a tyrant, and his people are looking forward with dread to the time when he will be boss of the estate. Fortunately for them he is not very much there, being fond of going to the big towns, where he gambles, they say, heavily. I have heard that when he comes into them it will require a large slice of the estates to pay off the money-lenders, though his father has paid large sums for him over and over again. I heard that he was at New Orleans three years ago, and was lucky in getting off on board a ship before he was arrested; so that it must have been something pretty bad, as they are not squeamish at New Orleans.\" \"He is a very bad man,\" one of the vaqueros, who spoke a little English, put in. \"I worked on the estate four years back, and he was the worst sort of a fellow. He has had a slave flogged to death more than once. A man pretty nearly put an end to him; he struck him one day in a fit of passion, and Lobe pulled out his knife and laid his shoulder open with the first blow, and would have killed him with the next had he not pulled out his pistol and shot him dead. It was a pity that Lobe bungled the first stroke. There was a rumour some months ago that our se?orita was going to marry him; he and his father came over here, and Don Garcia took her down there. Caramba! I would have put my knife between his ribs, if I swung for it afterwards, rather than see a pretty young lady sacrificed to him.\" \"Right you are, Nunez,\" the cowboy who had first spoken said; \"you may count me in; the se?orita is a daisy, you bet, and if there is any talk of this marriage, I am with you in anything you may do to stop it.\" Donna Isabella was indeed immensely popular among the men, and on the occasion of a round up, or of any assemblage of the herds, she would be sure to be there, with her attendant behind her, watching the proceedings with the greatest interest, and flushing with excitement over any deed of daring horsemanship. She had several times been out to the northern camp since it had been formed, and would stand by her horse, by the circle round the fire, asking questions as to the work, and chatting brightly with the men, all whom she knew by name, and before she rode away would be sure to produce from a basket a bottle or two of pulque, a quantity of fruit, or some other luxury. \"I am glad to tell you, Don Henry,\" the Mexican said one day a month after his conversation with Harry Denham, \"that the matter I spoke to you of has passed off without trouble. I received an answer shortly afterwards from Don Ramon, saying that he deeply regretted my daughter\u0027s decision, but that, as I was unwilling to use my authority as her father, he could but acquiesce in it. Three days ago I received a manly letter from his son, saying that deeply as he regretted the destruction of his fondest hopes, he trusted that the circumstance would not lead to any breach in the friendship between the two families, and he hoped to be allowed to pay me a visit in order to assure me of his undiminished regard. Nothing could be more excellent than the tone of his letter, and of course I have answered it in the same spirit.\" Harry Denham made no remark, but when alone that evening in the hut he thought deeply over it. The style of letter was in such entire contradiction to what he had heard of Don Pedro\u0027s character, that it filled him with distrust. The man was probably fond of Donna Isabella; that he could easily understand; but he doubtless had reckoned upon the dowry he would receive with her to repair his own fortune, and perhaps to silence pressing creditors, until at the death of Don Garcia he would come into a noble inheritance. It was therefore certain that his decisive rejection would not only humiliate him, but rouse him to fury. This letter, then, could only be a cloak to hide his real sentiments, and his proposed visit certainly foreboded no good to Isabella. Harry Denham was perfectly conscious that he loved the Spanish girl. Her kindness to him when ill, her bright companionship during his convalescence, and the frank welcome that she gave him whenever he went to the hacienda, completely won his heart. He did not for a moment dream that anything could come of it. She and her father were grateful to him for the service that he had rendered them. They were good enough to treat him as a friend rather than as an inferior, and the position that they had given him was a substantial proof of their gratitude; but that he, her father\u0027s overseer, could aspire to the hand of one of the richest heiresses in Texas, was simply absurd. That, however, need not prevent his doing what he could to shield her from being molested or annoyed by this Don Pedro, who was, by all accounts, in every respect unworthy of her. There was no saying what such a fellow might do. Her fortune was evidently of the most importance to him, and heiresses had been carried off in Texas and Mexico as well as elsewhere. One day a month later he shot an unusually fine mountain lion in a ravine a mile from his hut, and having carefully skinned the animal, he had it prepared by the wife of one of the vaqueros, who was famous for her skill in such matters, and then took it over on his next visit to the hacienda as a present to Isabella. The girl was in the garden as he rode up, and was delighted with the skin. \"It is one of the finest that I have ever seen,\" she said, \"and there is not a single scratch on it. Most of the skins are disfigured by the wounds the animals give each other in their fights.\" \"I fancy he must have been a young one,\" Harry said, \"though so immensely large.\" \"I do not even see a bullet mark.\" \"No, it does not show. I came upon it suddenly, and had just time to drop my rifle in my hand and fire, as it was about to spring. The ball struck it just in the centre of its throat, so that when the skin was divided the cut passed through the bullet hole.\" As they were speaking there was a step behind them, and turning, Harry Denham saw a remarkably handsome man who had just come out of the house unnoticed. He was regarding him with an evil look, but the expression vanished at once, as Isabella also turned, and he said courteously, \"I have come, se?ora, on the part of my father, who is somewhat indisposed, or he would have accompanied me to pay my respects to Don Garcia and yourself.\" \"You are welcome, Don Pedro,\" the girl said coldly; \"my father will always be glad to see the son of his old friend, Don Ramon de Vaga. This is Don Henry Denham, the gentleman who saved my father and myself when attacked by brigands on return from your father\u0027s. Don Henry, this is Don Pedro de Vaga.\" \"Shot an unusually fine mountain lion.\" It seemed for a moment that the Spaniard was going to speak, but he pressed his lips together and made the slightest inclination of his head in reply to the equally distant salutation of Harry. \"Let us go into the house,\" the girl said. \"You will come in, of course, Se?or Denham, and show my father the beautiful skin that you have brought me.\" \"Thank you, se?ora, but I have to ride out to the camp at once; there are several matters I have to attend to at once.\" So saying, he sprang on to his horse and lifted his solbero and rode off. Don Pedro did not speak as he re-entered the house with Isabella. He knew that if he did so, he should ruin any chance that he might have of winning her by fair means. A feeling of passionate jealousy had seized him as he saw the girl standing by the side of this stranger and heard her chatting pleasantly with him, and the changed manner and tone as she had addressed him added to his anger. By the time that they entered the room where Don Garcia was sitting, he had mastered himself. \"Look at this lovely lion\u0027s skin that Don Henry has brought me,\" she said, going over to her father and showing him the skin, that she had got over her arm. \"Yes, it is a beautiful skin,\" he said, examining it closely; \"there is not a blemish in it. He shot it himself, I suppose?\" \"Yes, in that ravine that runs from the valley half a mile from this house. Fortunately the shot struck it in the centre of the throat, and so you see it did not hurt the skin.\" \"Who is this gentleman?\" Don Pedro asked quietly of the haciendorer. \"My father heard from you on your return that you had got into some trouble with some rough men, and that there was a skirmish between them and some young fellow—I think you said an English cowboy—who intervened in the matter.\" \"I did not put it at all in that way, Don Pedro, nor was the affair so trifling as you represent. Two of my servants were killed, and the other two bound. I myself had alighted from the coach, and was handing my daughter out under the pistols of these five ruffians, when this gentleman arrived. He shot four of them, and himself received wounds that for some time seemed likely to be fatal. I may at that time have written of him as a cowboy; but I had not at that time learned, as I have since done, that he is a gentleman of an honourable family in England. He is now overseer of the northern herds on my estates, and in addition to my gratitude for the immense service he rendered us, I have the fullest confidence in him, and esteem for his character.\" \"Oh, he is an overseer, is he? I thought his attire would hardly be in accordance with the title of Don, by which the se?ora introduced him. I suppose you have other evidence besides his word as to his family. I believe most of these cowboys claim to be members of noble families.\" Don Garcia was about to reply when Isabella broke in passionately: \"You are insulting the man who saved my father and myself from the greatest peril, and whom I introduced to you as my friend, Don Pedro. We have the best evidence that he is a gentleman—that of his own manners and conduct, sir—who might be imitated in both these respects with advantage by men who do not hesitate to boast of the purest Spanish blood.\" \"Silence, Isabella,\" her father said sternly; \"I am here, and able to defend my absent friend. I should have thought, Don Pedro, that professing, as you do, a regard for our family, you would have shared to some extent our gratitude towards a young man who had done us such signal service, instead of sneering at him. With your feeling towards him, however, I have nothing to do; but I expect, at any rate, that courtesy will be shown in my house to any guest I and my daughter choose to invite here.\" Don Pedro bowed in silence, and then the Spaniard went on more cordially: \"Do not let us make too much of this, Don Pedro. Of course, you were not fully aware of our obligation to this gentleman, or you would not have spoken as you did. Let us forget the matter altogether,\" and he at once began to talk upon another subject. Three days later Don Pedro left, after a stormy interview with Isabella. \"I see that it is of no use remaining longer,\" he said. \"I came here in hopes that, in spite of your prejudice against me, I might still succeed in winning your love. I see now that it is useless, and can understand the real reason of your refusal of it. I am not blind; and when I heard you speaking to that young Englishman as you had never spoken to me, I comprehended the whole matter.\" The girl flushed angrily. \"You insult me,\" she said. \"I am not one of your slaves, Don Pedro; and my father will not forgive any one, whosoever he may be, who insults his preserver. As to your insinuation, it is contemptible. You know full well I informed my father, after your first visit here, that nothing would induce me to marry you, and I would rather enter a convent than do so. My visit to your house confirmed me in that determination; but at that time I had never even seen this Englishman. Your insinuation proves to me how rightly I judged your character. I would rather marry the lowest peon on my father\u0027s estate than you. You are here on false pretences, sir. You declared in your letter to my father that you acquiesced in his and my decision, and that you wished to come only as a friend; it seems now that this was false.\" \"It was false, se?ora, and I intend to make you my wife. You may be cruel, you may be unjust, you may even love another, but that will not turn me from my purpose. Mine you shall be, by all the saints;\" and, without waiting to hear the indignant reply, he left the room. \"I am going, Don Garcia,\" he said abruptly, as he met the latter coming from the stables. \"My love is stronger than my power of repressing it. I had hoped that I had to some extent conquered it, but I cannot do so, and it may be, Don Garcia, that you may some day be sorry that you did not give my suit the support that my father and I hoped and expected. I understand now the reason of my refusal. There is another more fortunate than I am, and you may some day bitterly regret that your kindness of heart led you to open your doors to an adventurer;\" and without waiting he hurried forward to the stable, called for his horse, and ordered the three men who had accompanied him to saddle at once and follow him, and then rode furiously away. He drew rein after riding a mile, and waited until his followers came up. He called one of them up to him, and with him went slowly on, the other two falling behind. \"You have followed the orders I gave you the first day we came here, Juan?\" \"I have, sir; I have found out all about him: he does not live with the others at the camp, but has a small hut in a lonely valley some miles from here; he shoots and hunts early in the morning, and then generally he breakfasts, and afterwards rides over to the camp.\" \"That is excellent. I want you to stay behind here, Juan, and put a stop to his riding—you understand. You will be well paid for the business.\" The man nodded. \"I will do it, se?or. It is rather risky, for they say that he is a first-rate shot.\" \"Well, then, you must manage so that he doesn\u0027t get a shot at you, Juan. He is alone in the hut?\" \"Yes, except that he has a dog Don Garcia gave him, a fierce beast that would let no one into the hut without awakening its master. It cannot be done that way. When he is away I must hide in the bushes near his hut, and shoot him as he returns.\" \"Well, don\u0027t blunder over the business, Juan. If you are doubtful about yourself, hire a man or two to help you, there is never any difficulty in picking up a man for that sort of work.\" \"I can put my hand on the men. My brother was one of those who made the attack on Don Garcia and his daughter, and this Englishman shot him, therefore I should be ready to do the job without being paid for it, though I don\u0027t say it is not sweeter to get both gold and revenge at one stroke. I know where the two men who got away are, and they will be glad to join me; they are but two days\u0027 ride away, but I suppose a few hours earlier or later would make no difference to you. It is on the road back to the hacienda.\" \"That will do very well. Mind you do not bring my name into the matter with them; simply say you want to revenge your brother\u0027s death.\" \"I understand, se?or,\" and Juan dropped back to his comrades. Before the end of the day, however, Don Pedro had formed another plan, which he communicated to Juan that evening. \"You understand,\" he said, \"you will get those two men you spoke about, and half-a-dozen others; I shall get eight or ten of our own men, say twenty in all—that will be enough. My business must be settled first; after we have gone, you and the other two can carry out this affair with that accursed Englishman. There will be no risk in it, for when I have once got the girl, Don Garcia will be glad enough to hush up the affair.\" Three weeks afterwards Harry Denham was preparing his breakfast, which consisted of slices of venison that he had shot an hour before, when the dog suddenly pricked up its ears with a low warning growl. \"What is it, Don? Is some one coming? Yes, you are right,\" he went on, after stopping to listen for a moment, \"I can hear horses\u0027 hoofs.\" He went to the door, and opening it, looked out; then he gave a sudden exclamation, ran in and seized his rifle, and then ran out again. At a distance of a hundred yards Isabella Novales was riding at full gallop, while half that distance behind were some twenty horsemen, evidently in hot pursuit of her. \"Go in, Don,\" he said sternly as the dog was about to leap forward; \"go in and lie down.\" \"I struck Violetta sharply and she galloped off like an arrow.\" The girl drew up her horse suddenly as she reached the hut, and leaped off. \"Lead the horse in, se?ora,\" Harry exclaimed, as levelling his rifle he fired, and one of the horsemen fell from his saddle, while a yell of rage broke from the others. There was not a moment to be lost, and running in he closed the door and fastened the stout bar across it; then catching up a double-barrelled gun, he thrust it through the window and discharged both barrels into the crowd as they rode up. Two more men fell. The rest dismounted, and flung themselves against the door, but three shots of a revolver through a small sliding panel caused them to draw back, and a moment later, in spite of the angry shouts of one of their number, they ran off with their horses, and taking refuge in the bushes, opened a straggling fire on the hut. \"What does it all mean, se?ora?\" Harry asked, turning to the girl, who had without a moment\u0027s hesitation seized the rifle he had dropt, and began to load it from a powder-horn hanging from a peg in the wall. \"I don\u0027t know,\" she said. \"I was out for a ride this morning, when a number of mounted men suddenly dashed out from a clump of trees, and I saw another party ride out of some bushes farther on, evidently intending to cut me off. From the glimpse I had of them it seemed to me that their faces were all blackened. I turned my horse to ride back, but some more men had posted themselves there. I struck Violetta sharply and she galloped off like an arrow. I had to pass close to one of the party, and I was afraid they might lasso me. One man did take up his lariat as he galloped, but another shouted, \u0027No, ride her down,\u0027 and I shot by them, though they were within a few yards of me. \"I thought of the camp, but I knew that at this hour most of the men would be out with the herds. Then I thought of your hut. I knew it was up this valley, though I had never been here. I was sure that if you were in you would protect me; if you were not, I should have ridden on. They must be brigands who intended to carry me off to get a ransom for me; but it seemed to me when that man shouted to the others not to lasso me, that I knew his voice, and I feel almost sure it was Don Pedro. He said when he went away he would marry me some day, and I cannot help thinking that perhaps he has made up his mind to carry me off. What is to be done, se?or? I would kill myself rather than fall into his hands. Why should he want to marry a girl who hates him?\" \"Because, as I hear, he wants money, se?ora. I hear that he has very heavy debts, and has already gambled away much of the estate that will come to him at his father\u0027s death. Now, se?ora, I must send a few shots back in answer to their fire, or they will be making another rush, and the door was never made to stand a serious assault. I only hope that if Don Pedro is there he will let me get a shot at him.\" He took out some moss that had been thrust into several chinks in the wall, and fired several shots into the bush. A loud yell told that at least one had taken effect. \"That will do for the present,\" he said; \"now let us think over what had best be done. I fear there is little chance of this firing being heard; the herd is eight or ten miles away. Your horse is fast, and you might possibly get there before you were overtaken; but some of these men will be well mounted, and it would be a risk. They have stopped firing, but are certainly round the hut, and might lasso you before you had gone twenty yards. If I had my horse here I could have ridden with you, and could have beaten off any well-mounted men who might come up; but he was grazing a hundred yards away when I came in, and there is no getting at him. I see nothing to do but to wait and see what they intend to do next. If they were only brigands they might give it up; but if your suspicions are correct, and they have Don Pedro with them, I fear there is no chance of that. I know a cave, four miles away, that I could hold against them for any time, while this hut is not meant to stand a siege, but there is no getting there.\" \"What are you growling at, Don? Do you hear some one creeping up there?\" A moment later there were three crashes as a heap of faggots were thrown down against the end of the hut. He sprang towards that direction, pushed the moss from a loop-hole, and thrusting his rifle out, shot a man who was approaching with a blazing brand. \"Too late,\" he exclaimed bitterly a minute afterwards, \"it has fired the dry grass; the wind is towards us, and those faggots will be kindled, and the flames will light the dry shingles.\" \"I will go out and surrender,\" Isabella said suddenly; \"you shall not throw away your life, Don Henry.\" \"Your surrender would not save my life, se?ora, even if I were to venture to make the sacrifice. I have killed five or six of them, and you may be sure that they would not spare me.\" \"Then let us both get on to my horse and try to escape; she is very fast.\" \"We should be overtaken before we had gone half a mile, even if we had a fair start. She is a pretty thing, but light, and would soon tire under the double weight. Let me think for a minute;\" he closed his eyes and stood in thought. Already the pungent odour of the smoke filled the room, and there was a cracking noise, increasing in volume every moment, that told the faggots had caught fire. Suddenly he looked up. \"I have it, se?ora, if you will not mind doing it.\" \"I will do anything you tell me to do,\" she said quietly. \"The horse is getting restive; I will hold him as you go to the other end of the room and take off your dress, and wrap in it the pillow and blankets as quickly as you can. As soon as you have done so, I will mount your horse, open the door, and ride out with the dummy in front of me. Seeing your dress, they will naturally suppose that it is you, and will all dash off in pursuit of me. I shall make for the cave I spoke of. They are principally below us, and would cut me off from making either for the hacienda or the camp. The moment they are fairly after me, do you make your way off on foot. If you can catch my horse, you might get me help from the camp.\" \"You will be throwing away your life, se?or.\" \"Not at all. I am a heavy weight for your mare, but I think she will carry me as far as the cave, and they will not like to fire lest they might, as they would suppose, hurt you. At any rate it is a chance for us both, and I see no other. Pray do not lose a moment.\" \"I will do it,\" she said. The hut was full of blinding smoke, the dog barked and howled, and the mare struggled so violently that he had the greatest difficulty in pacifying her. When at last he did so, she was trembling from head to foot. It was not two minutes before Isabella stood beside him and thrust the bundle into his arms. \"I have pulled the blankets up above the dress,\" she said, \"and pinned my riding-hat on the top. Quick, it is stifling here.\" Then she passionately threw her arms around his neck. \"The Holy Virgin shield you!\" she exclaimed. \"I love you, Harry, I love you. I have brought this upon you, and if you die I will remain a widow all my life for your sake.\" \"God bless you, Isabella,\" he said hoarsely. Isabella took down the bar and unlocked the door. The mare for a moment refused to move. He leaned forward on her neck and struck the spurs into her, and she flew like an arrow through the door, at which the dog had already rushed out with a joyous bark. Harry Denham had slung his double-barrelled gun across his shoulder. In one hand he held his revolver, which he had recharged after using it; in the other the reins, and pressed the dummy figure against him. A loud shout burst from the bushes as he issued out. \"A loud shout burst from the bushes as he issued out.\" \"Don\u0027t fire, on your lives, don\u0027t fire,\" a man shouted; \"you might hit the lady.\" A dozen horsemen sprung out, but most of them were just below the hut, being sure that when the defenders sallied out they would make that way. There were but three that barred the way up the valley. Harry rode right at them. One made a grasp at his rein, but the revolver cracked out and he pitched head foremost out of the saddle. When he was past them, turning round he fired again, and one dropped the reins with an oath as the ball struck him in the shoulder. The other reined in his horse until joined by his comrades from below. \"Steady, steady, keep together,\" their leader shouted. \"We must have them; the mare will soon tire.\" To their surprise, although they were riding their hardest, the mare for three miles maintained the lead of some seventy yards that she had gained. \"Caramba!\" the leader of the pursuers muttered, \"she must be the devil; no horse her size could carry double weight so far without failing.\" But although far less heavily loaded than her pursuers imagined, Harry\u0027s weight was telling, and he could feel that the mare was beginning to flag. He cheered her on with hand and voice, abstaining from using the spur, for the gallant little horse was doing her best. He would not look round, for that would have encouraged his pursuers, and they might press their horses to make a rush; but listening intently, he was sure that they were gaining somewhat upon him, and he was confirmed in his belief by a shout of triumph behind. The cave, however, was now but a short distance away. The valley had narrowed to a ravine, occupied in the rainy season by a torrent. The pursuers, confident that the end was not far off, and that the mare would ere long founder, had not pressed their horses, and as they could no longer ride more than two abreast, they had fallen somewhat farther back. Those in front gave a yell of exultation as they saw the mare suddenly stop and the rider leap from its back, but were astonished when they saw him go to the horse\u0027s head and apparently lead it into the solid rock, followed by the dog, which had kept close to its heels. They rode cautiously now, not knowing what to expect, and checked their horses, when they saw an opening no more than a yard wide in the face of the rock, and realised that the fugitives had taken refuge within it. Volleys of execrations poured from the leader of the band. He at once ordered the men to dismount, which they did willingly enough, but they refused to attempt to enter the cleft. \"It would be certain death,\" one of them said; \"he has got a double-barrelled gun and that pistol, and he can shoot us down the moment we appear before the hole.\" The fact was so evident that the leader, although half mad with passion, saw that it was useless to urge them to the attack at present. \"Well, we must think of some plan,\" he said. \"There is no hurry, they cannot escape us; we are in the heart of the hills, and no one dreams of what has taken place. We burnt them out of their last place, and if we can find no other way, we can starve them out of this. They can eat the horse, but they can\u0027t go very long without water. You may as well get some food out of your sacks and make a meal while we think the matter over.\" The men obeyed sullenly. They had entered on the affair solely for the money they were to receive for it, and it had turned out most disastrous: there were twenty of them to begin with, while there were now but thirteen—six had been killed and one wounded. They were, however, somewhat cheered when their leader told them that their comrades\u0027 shares would be divided among them, and that each would therefore get half as much again as he had expected. \"I will double that,\" he said, \"if you will attack the place.\" But there was no response. Presently one of them went up to the leader, who was sitting apart. \"Why not try fire again, se?or; we could not burn them out, but we might smoke them out.\" \"That is a good idea, Juan. Directly the men have finished eating, do you go down with four of them and cut faggots and bring them up; there are plenty of bushes half a mile lower down. Put plenty of green wood in it; it is smoke we want and not fire. They will come out quickly enough as soon as we light them; but if they don\u0027t, we must pull the faggots away and drag her out—she would be of no use dead.\" Five men went off, the others taking their post, pistol in hand, near the mouth of the cave, should the fugitives try to escape. The men had taken their horses with them to bring up the faggots, and half-an-hour later the sound of horses\u0027 hoofs was heard coming fast up the ravine. \"They have been wonderfully quick about it,\" Juan said to the leader uneasily. \"They have; they may have found bushes enough on the lower side of the ravine without going right down to the bottom.\" \"I did not notice any, se?or—and listen, it seems to me that noise is more than five horses would make.\" \"So it is. Stand to your horses, men.\" A moment later the head of the party came in sight. There was a shout in English of \"Come along, lads, here are the skunks.\" For a moment the men could not believe their eyes, for by the side of a cowboy rode a female figure. She was in her white petticoats, and had on a scarlet shirt, strapped at the waist by a belt; her head was bare, and though nearly a hundred yards away, Don Pedro recognised at once Isabella Novales. A terrible oath broke from his lips. \"Forward, men,\" he shouted, \"ride for your lives; we have been duped, and the girl has brought these cowboys upon us.\" At the head of his men Don Pedro dashed up the ravine, but as he passed the opening to the cave, a flash of fire spurted out and struck him on the side of the head with a full charge of heavy shot, and he fell dead from his horse. The man Juan, who followed him, met with the same fate; but the others dashed past, and a minute later eight cowboys galloped in pursuit. Isabella Novales drew her horse aside to let them pass, and then sprang to the ground. Her fears of Henry\u0027s safety had been allayed. She learned from one of the five men whom they had seized just as they began to cut brushwood, that he had gained the cave, and that, not daring to attack it, his foes were about to smoke him out. The news had gained him his life. The cowboys were afraid to fire lest the sound should reach the ears of the brigands, but they had without a moment\u0027s loss of time strung the other four up by their lariats to a tree growing close to the spot where they had been captured. \"Are you safe, my beloved?\" she said, as she threw herself into Harry\u0027s arms with the passionate abandon of her race. \"Quite safe,\" he replied; \"you have saved me, Isabella. I was close to the mouth of the cave and could hear them talking, and I knew that unless help came in time it was all over. Your mare carried me splendidly; but another half-mile and they would have had me. I and my gun made up nearly twice the weight she is accustomed to carry. And you, how did you manage? I see that you went to the camp.\" \"I threw myself down close to the door for a moment to get fresh air, then I ran out. At first I thought of making for the hacienda, but it was two miles farther; they would be too long in getting ready. I luckily came upon your horse, mounted it, and galloped to your camp. When I rode in, the men had just finished their breakfast, and had already mounted; another two minutes and they would have gone. I told my story. One of them ran into the tent and brought me a shirt and a belt, which I was very glad to put on, though till then I had never thought for a moment about being so undressed before a number of men. We galloped as if we had been racing. We passed the hut, or what was the hut, for there was nothing of it but a smoking beam or two. Just above that we passed a dead man lying on the ground, and the cowboy who was riding next to me said, \u0027Cheer up, se?ora, that is Harry Denham\u0027s handiwork; he has ridden through them here.\u0027 \"Is not that,\" she broke off, as she looked at the two dead men lying close to her, \"Don Pedro? it looks to me like his figure.\" Harry went and turned the bodies over. \"You are right,\" he said, \"it is he; Don Pedro will never trouble you again. Now let us mount and go slowly down; the others will overtake us presently. I doubt whether they will overtake the brigands. They have ridden nine miles at full speed, and the other horses have had more than one hour\u0027s rest.\" They mounted, and rode down the ravine, the dog trotting behind them. \"I can hardly believe that I have not dreamt what you said in the hut, dearest.\" She coloured brightly. \"You knew it before, and I knew what you thought.\" Then she added shyly, \"I shall tell my father directly we get in.\" \"I am afraid that he will never consent,\" Harry said gravely. \"He loves me,\" she said confidently; \"I am his only child, and he will do as I wish him. You are a gentleman by birth, Harry—what can he want more? If you were as rich as I am, what good would it be?\" Harry shook his head. \"That is true enough, Isabella; but fathers do not see things in that light. However, I will ride with you home, and leave you to tell your story. If he says no, as I fear he will, I must leave here; I cannot remain as his overseer after this.\" \"If you were as faint-hearted in fighting as you are in love,\" the girl said with a bright smile, \"you would never have won me. I do believe you would never have spoken had not I spoken first.\" \"I am sure I never should,\" he replied. \"I have known for months that I loved you. It would not have been right that I, one of your father\u0027s overseers, should ever speak of my love to his daughter.\" The cowboys came up presently and crowded round Harry Denham, shaking hands with him warmly. \"We wiped out five of the skunks,\" one of them said, \"but the others were too well mounted for us. If we had had time to choose our horses, not one of them would have got away.\" \"It does not matter,\" Harry said; \"the man who was the author of all this has fallen. The rest were only hired brigands, and they have paid heavily for it.\" \"Are you coming to the camp, Harry?\" \"Not at present, I must conduct the se?ora home; but I may be out this evening.\" The men exchanged a significant glance, and when the way separated at the charred remains of the hut, one said, \"We shall not see much more of Denham at the camp. I don\u0027t know what the Don will say about it, but there is no mistake about the se?ora. Poor little thing, how white she was when she rode up! She looks all right again now, and has got plenty of colour in her cheeks; but she was as pale as death then. She didn\u0027t say much, but there was no question where her heart was.\" When Harry Denham left Isabella, he promised her that he would return in two hours and wait at the gate until she came to him. She was there before him, and he saw at once that she had judged her father better than he had. \"Come in, Harry,\" she said, \"my father is expecting you.\" Don Garcia came out to meet them as they approached the house. \"Don Harry, you have saved her life, at the risk of your own, twice,\" he said, \"and you have fairly won her; I give her to you willingly. It would have been a blow to my pride, had you not been a man of good family, but I could not have said no to her even then. As it is, there is nothing I can wish for better. Money she has no need for; but she has need of an honest gentleman as her protector, and such she has found in you.\" Three months later they were married. Till Don Garcia\u0027s death ten years later, they lived with him always at the hacienda. After that Harry Denham took his wife to Europe for six months, and then returned to Texas, into which a flood of immigration was pouring. There he still lives, one of the richest and most popular land-owners in the State. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3135/86217.html","bookId":889,"book":{"id":889,"title":"Yule Logs","description":"简介： It was a grand success. Every one said so; and moreover, every one who witnessed the experiment predicted that the Mermaid would revolutionize naval warfare as completely as did the world-famous Monitor. Professor Rivers, who had devoted the best yea...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3135","creation":"Aug 1, 2019 12:23:48 AM","modification":"Aug 1, 2019 12:23:48 AM"}}
