{"id":67093,"no":11,"title":"Page 11","content":"\"A... strategy?\" \"Yeah, you know. How to get the ladies to bid on me. Just how many women are expected?\" \"I don\u0027t know. The tickets haven\u0027t gone on sale yet.\" \"I just had a thought.\" He straightened, seeming pleased with himself. \"I imagine that if the women in town knew exactly who was up for auction, the Animal Shelter would sell more tickets, right?\" Grace wasn\u0027t sure about that. \"I suppose.\" \"What if you printed the names of the bachelors directly on the tickets? That might generate even more interest, don\u0027t you think?\" Stan was certainly full of ideas. \"I\u0027ll make that suggestion, too,\" she murmured. \"Good.\" His eyes brightened and Grace could see he was quite taken with this bachelor auction. During their one and only dinner date, Stan had practically been crying in his soup, wallowing in self-pity. He\u0027d regrouped fast enough, she thought wryly. \"I\u0027ll do what I can to make sure your name\u0027s added to the list,\" she said, eager to leave for home. \"Thanks, Gracie. I appreciate the fact that you\u0027re such a good friend.\" Grace didn\u0027t consider herself that much of a friend, but she let the comment—and the nickname—slide. She directed Buttercup toward the parking lot behind the library, where she\u0027d left her car. \"Nice seeing you again, Grace.\" \"You, too, Stan.\" \"Oh, Grace.\" He jogged the few steps over to her. \"When you mention the idea about printing the names...\" \"Yes?\" \"Be sure and tell them it came from me.\" \"Of course.\" She ordered Buttercup to sit and dropped the leash for a moment so she could shift the heavy bags from one hand to the other. \"And seeing that it was my idea—\" he paused and laughed playfully \"—I think it\u0027s only fair that my name be one of those on the list.\" \"I\u0027ll make sure that\u0027s understood.\" \"Great.\" He grabbed her by the shoulders and briefly hugged her. As if the thought had suddenly struck him, he asked, \"Is there anything I can do for you?\" \"Not a thing,\" she assured him, surprised he\u0027d asked. \"You\u0027re sure.\" His hands lingered on her shoulders. \"Positive.\" . Just then, behind Stan, Grace caught sight of a male figure in a cowboy hat. No, please no, she prayed silently, don\u0027t let that be Cliff. Her one fear was that he\u0027d heard about her dinner date with Stan and would think she was foolish enough to get involved in a relationship with Olivia\u0027s ex-husband. Stan muttered something about needing to meet a friend. Before she could stop him, he gave her another quick hug and was gone. Grace\u0027s gaze remained fixed on the man with the Stetson. When Stan freed her and left, he no longer obscured her line of vision. Sure enough, it was Cliff. He stood staring at her and even from this distance, she could see him frowning. She wanted to tell him it wasn\u0027t the way it looked. She wasn\u0027t involved with Stan. Nor did she want to be. After a suspended moment, Cliff acknowledged her by touching the brim of his hat. Almost immediately, he turned away. She wanted to rush over to him and explain, but feared she\u0027d do more harm than good. With a heavy heart, Grace headed home. Eleven The board meeting over, Bob Beldon left the community theater, situated just off Heron Street . He\u0027d been active in theater since his high school days; drama class had been his favorite and he\u0027d starred in a number of school productions. If not for Vietnam and everything that happened afterward, he might have considered a career on the stage. These days he got what he called his \"theater fix\" by participating in local productions. Currently he served on the board of directors and the group had discussed a number of potential plays for next year\u0027s season. Bob was still thinking about the merits of Our Town vs. The Matchmaker as he drove down the winding road that led to Cranberry Point. The name of the road always amused him. As far as he knew, there weren\u0027t any cranberries growing in the area. There were cranberry bogs in WashingtonState, but none in or near Cedar Cove. Whistling \"Hello, Dolly,\" he continued driving, free for the moment of the burdens that oppressed him. This was what he loved about the theater. He could immerse himself in a role—in the whole process of staging a play—and put aside his troubles. His friends in AA might call it denial, but the theater gave him a ready excuse. Knowing Peggy, she\u0027d have dinner started. Since it was Monday, he guessed she\u0027d probably prepared either stuffed green peppers or her fabulous meat loaf. Either meal suited him just fine. Still whistling as he pulled into the driveway, he found his wife watering her herb garden. Any time of year, her gardens were something to behold. The name of their B and B, Thyme and Tide, had come from both their proximity to the sea and Peggy\u0027s herbs. And of course the old saying about time and tide waiting for no man... Speaking of time, without guests, they both had plenty of that on their hands. Money was tight, but Peggy was as skilled at budgeting as she was at every other household task. Bob couldn\u0027t imagine how they\u0027d manage their money situation otherwise, but thankfully Peggy had it all figured out. He drove into the garage and then walked out to greet Peggy. Garden hose in hand, she smiled as he approached. The sun was still high, although it was almost six o\u0027clock. According to the calendar, summer would officially arrive later in the month, but as usual it would take another six weeks to show up in the Pacific Northwest. August and September were almost always spectacular. Bob had to remind himself of that in February and March, when the constant drizzle dragged down his normally good spirits. \"Hi, honey,\" Bob said. He stood at the edge of her garden. The fennel bulbs were flowering, and the parsley and cilantro were just peeking up from the dark, rich soil. \"What\u0027s for dinner?\" \"Meat loaf. How\u0027d the meeting go?\" \"Just great.\" He couldn\u0027t contain his smile. \"What\u0027s that grin about? Are you keeping something from me?\" She jokingly aimed the hose in his direction. \"Not a thing.\" He chuckled, raising both hands in a gesture of surrender. \"I was just thinking we\u0027d probably have meat loaf tonight, is all.\" Peggy walked over to the side of the house and turned off the water. \"I\u0027m about finished here.\" Bob nodded. \"If you\u0027ve got a moment, I\u0027d like to talk.\" He hesitated. When Peggy asked to speak to him in that formal way, it generally wasn\u0027t about anything pleasant. \"Is something wrong?\" \"Not really.\" She seemed rather closemouthed about it, which wasn\u0027t good. Now that he studied her, Bob realized he should have seen the signs earlier. Peggy was a talker, a natural conversationalist. She could—and did—talk to anyone about anything. Many of their guests were repeat customers Peggy now counted as friends. Bob followed her into the mudroom off the kitchen. Peggy changed out of her rubber shoes and methodically put her gardening supplies on the shelf. The contrast between her highly organized work areas and his—well, sometimes it embarrassed him a little. He could be such a slob, he thought ruefully, and yet Peggy was so tolerant of his carelessness, for which he could only be grateful. \"What\u0027s going on?\" he asked as they entered the kitchen. Peggy automatically poured them each a cup of tea and set the mugs on the table. \"I got a phone call from Hannah Russell this afternoon.\" Bob felt the sudden need to sit down. He yanked out the chair and sat, reaching for his tea. \"I\u0027m so worried,\" Peggy said, sitting across from him. That got Bob\u0027s attention. \"About what?\" They\u0027d been caught up in this nightmare for so long that he\u0027d grown accustomed to the tension. It had become part of his reality and there was nothing to do but stand firm in the face of each new shock. \"Hannah,\" Peggy continued as if it should be obvious. \"Her mother and father are both gone. She\u0027s like a lost soul. She\u0027s foundering, Bob.\" She paused for a moment. \"I talked to Hollie today, and she said that in her opinion, Hannah needs a sense of security. I agree with her.\" \"1 suppose that\u0027s only natural when someone loses both parents in such a short time.\" Bob envied the closeness between his wife and daughter. He knew that during his drinking years, he\u0027d lost an important part of his children\u0027s lives. Peggy\u0027s hands tightened around her mug. \"Hannah phoned to thank me for my letter.\" Bob had forgotten that Peggy had written the girl. It was just the sort of thoughtful thing she\u0027d do. \"She wanted to tell me she\u0027s moving.\" \"Where?\" \"That\u0027s just it,\" Peggy said, and her face darkened with concern. \"She doesn\u0027t know. She\u0027s sold everything she can. Hollie says that Hannah\u0027s running away from her pain—that she\u0027ll carry it with her wherever she goes.\" Bob nodded. \"Hollie\u0027s right. I\u0027m not sure leaving California\u0027s a good idea for Hannah. She might regret it later, selling things she\u0027ll wish she\u0027d kept.\" \"That\u0027s what I told her, but she said it was too late. What she didn\u0027t sell she gave away.\" Bob\u0027s own concern grew. His unease didn\u0027t revolve solely around Hannah, either. She might inadvertently have sold something that would help solve this mystery. \"That\u0027s not all,\" Peggy said. \"I got the impression that she\u0027s going to travel aimlessly around the country until she finds a place that.. .feels comfortable. That\u0027s how she put it.\" Bob sat back in his chair and mulled this over. The young woman was vulnerable. Wandering from place to place wasn\u0027t what he\u0027d want for his own daughter. \"What about family? Surely she\u0027s got aunts and uncles and cousins?\" \"Apparently she doesn\u0027t have anyone close.\" \"I see.\" Bob sipped his tea. \"I asked her to call us from time to time.\" \"Good.\" \"But I don\u0027t know if she will. She sounded so confused.\" Bob considered what he knew about Hannah for a moment and felt a pang of sympathy. \"Did you ask if there\u0027s a way for us to keep in touch with her?\" Peggy nodded. \"She has a cell phone and she gave me the number. The thing is, Bob, how involved do we want to get in her life?\" Her gaze held his and he understood his wife\u0027s question. She felt a certain responsibility to Hannah. After all, it was in their home that her father had died. And yet— did they want to take on the young woman\u0027s problems? That could be more than he and Peggy were really equipped to handle. \"I don\u0027t know,\" he admitted. \"Me neither.\" \"So, what do you think we should do?\" Bob asked. He trusted Peggy\u0027s intuition. Hannah aside, Max Russell\u0027s death was an uncomfortable subject. It brought up too many unpleasant memories for him and his wife, memories Bob preferred to leave buried. \"I\u0027m not sure, but I do feel badly for her.\" Bob agreed. It was hard enough succeeding in the world with parents, and usually much harder without. His own children had faltered, but with love and patience had eventually found their way. No thanks to the example he\u0027d set in their early years, Bob admitted. Perhaps this opportunity to help Hannah was also a chance to make up for his missteps twenty-five years ago.","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-11.html","bookId":1944,"book":{"id":1944,"title":"44 Cranberry Point (Cedar Cove #4)","description":"Storyline: 44 Cranberry Point (Cedar Cove #4) Dear Reader, I love living in Cedar Cove, but things haven\u0027t been the same since a man died at our B and B. Turns out his name was Max Russell, and Bob had known him briefly in Vietnam.We still don\u0027t have any idea why he came here and—most important of all—who killed him. Because it now appears that he was poisoned. I sure hope somebody figures it out soon! Not that we\u0027re providing the only news in Cedar Cove these days. I heard that Jon Bowman and Maryellen Sherman are getting married. And Maryellen\u0027s mom, Grace, has more than her share of interested men! The question is: Which one is she going to choose? Olivia—I guess it\u0027s Olivia Griffin now— is back from her honeymoon, and her mother, Charlotte (who\u0027s in her mid-seventies at least), seems to have a man in her life, too. I\u0027m not sure Olivia\u0027s too pleased…. There\u0027s lots of other gossip I could tell you. Come by for a cup of tea and one of my blueberry muffins and we\u0027ll talk. Peggy Beldon","cover":"https://allnovel.net/images/44-cranberry-point-cedar-cove-4.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/44-cranberry-point-cedar-cove-4.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:03:12 AM"}}
