{"id":67095,"no":13,"title":"Page 13","content":"\"We e-mailed each other for a while,\" Will confessed. Grace had never mentioned that to Olivia. \"Really?\" \"It was no big deal—we\u0027re just friends.\" The conversation stopped and started after that, with a few more questions about Grace, until finally he ended it. Olivia returned to her dinner plans. Not until she was putting the finishing touches on the grilled Pacific salmon, wild rice and steamed asparagus did it hit her. Her brother was obviously concerned about their mother\u0027s relationship with Ben and perhaps rightly so; that remained to be seen. But he had another agenda. And it had to do with Grace. He seemed awfully curious about her, Olivia mused. More than once he\u0027d drawn the conversation back to her friend, asking her what Grace was up to and whether she was seeing anyone. If they\u0027d been e-mailing each other, then wouldn\u0027t he know how Grace was doing? Just as she started to put a few ideas together—very tentatively—the back door opened and in walked Jack. \"You\u0027re looking thoughtful,\" he observed, standing in the doorway off the kitchen. \"Jack!\" Not hesitating, she flew into her husband\u0027s arms and spread eager kisses across his face. Jack locked his hands at the small of her back, smiling down on her. \"A husband could get accustomed to this sort of reception.\" He kissed her soundly in return. Olivia rested her head against his shoulder and sighed, loving the comfort of Jack\u0027s arms around her. \"I just had the most...disconcerting conversation with my brother.\" \"What about?\" Olivia told him but excluded the portion about Will\u0027s repeated questions regarding Grace. \"Are you going to contact Roy?\" Jack asked when she\u0027d finished. \"I suppose I should. Will was concerned and although I think he\u0027s overreacting, it can\u0027t hurt to know for sure. I guess there\u0027s always a chance that Ben\u0027s a con man. The clever ones usually have the most convincing aliases. But the truth of it is, I hate the thought of Mom finding out what we\u0027ve done.\" Jack didn\u0027t say anything for a long moment. \"You can trust Roy not to let any of this out,\" he finally said. \"I realize that.\" Jack shrugged. \"Personally, I don\u0027t think having Ben investigated is all that necessary.\" \"Me neither,\" she concurred, but she\u0027d decided to do it— if only to reassure her brother. After dinner Olivia and Jack cuddled in front of the television for a repeat episode of Law \u0026 Order. Olivia had seen this particular show earlier in the year, although Jack hadn\u0027t. She didn\u0027t object to watching a rerun, but she found herself returning to the conversation with her brother. Will had talked about e-mailing Grace. Then there was all his interest in what she was doing, whom she was seeing. Although he hadn\u0027t actually said anything, she\u0027d sensed Will\u0027s disapproval of Grace\u0027s participation in the Dog and Bachelor Auction. A few months ago, Grace had gotten involved in an Internet relationship with a married man. Her friend had been duped, lied to and strung along. Now, with a growing sense of horror, Olivia wondered if that man could have been her brother. Grace\u0027s heart was broken after the end of her romance with Cliff Harding, and that was when she\u0027d told Olivia about the other relationship, accepting the blame for her role in this fiasco. Grace had never revealed the name of the married man. At the time Olivia had assumed it didn\u0027t matter, that she wouldn\u0027t have known who it was, anyway. Now she wondered. Could it possibly have been Will? She tried to dismiss the thought. No, of course not! Her brother would never do anything so underhanded. And if he had, surely Grace would have told her. But if what Olivia suspected was true, it explained Will\u0027s weak excuse about not being able to attend her wedding. \"Something on your mind?\" Jack asked during a commercial break. His mouth was close to her ear and he took advantage of her closeness to kiss the side of her neck. \"Hmm.\" Olivia closed her eyes and reveled in his attention. \u0027This whole thing with your mother and Ben is worrying you, isn\u0027t it?\" \"Not really,\" she muttered. She debated mentioning her suspicions about Grace and her brother, but changed her mind. If she said anything, it would be to Grace—but only after she\u0027d had time to sort through the facts as she knew them. Until then, it would be better to say nothing, not to Jack and not to anyone else. \"Good,\" Jack whispered, tucking his arms more securely around her. \"I\u0027d hate to have anything disrupt our television viewing.\" Smiling to herself, Olivia poked him in the ribs with her elbow. She\u0027d been doing a lot of smiling since she\u0027d married Jack Griffin, and she didn\u0027t think that would change anytime soon. Thirteen Cecilia pushed the grocery cart lethargically through the commissary\u0027s aisles. She\u0027d been so excited about having her husband home after six months\u0027 deployment, counting the days until Ian would be with her again. She\u0027d made elaborate plans for his homecoming and wanted their reunion to be like a second honeymoon. She\u0027d prayed her husband would be as eager to start their family as she was. Only he hadn\u0027t been, and now it seemed nothing had gone the way she\u0027d hoped. \"Hey, Cecilia.\" At the sound of her name, Cecilia turned to find Cathy Lackey wheeling her grocery cart down the aisle toward her. \"I thought that was you,\" Cathy said. Cecilia managed a token smile. \"How\u0027s it going?\" \"Great. I left father and son to bond. I\u0027m taking my own sweet time shopping because, frankly, I could use the break. Where\u0027s Ian?\" \"Home.\" Cecilia couldn\u0027t disguise her misery. \"Oh, Cathy, things just aren\u0027t working out between us.\" \"What do you mean?\" Cecilia reached inside her purse for a tissue, humiliated about breaking down in the cereal aisle where anyone might see her. Cathy glanced over her shoulder. \"Listen, let\u0027s meet in half an hour at Starbucks. Does that work for you?\" Cecilia nodded. Cathy was the one person in the world she could talk to about her most private concerns. Cathy would understand better than most people, and Cecilia realized she needed her friends more than ever. Sure enough, Cathy was waiting for her at Starbucks. She was on the patio and had already bought them each a cup of coffee. Because the day was warm and sunny, most of the customers were sitting outside. \"All right, tell me what\u0027s happening,\" Cathy said when Cecilia slid into the chair across from her. Cecilia picked up her coffee and hung her head, staring at the tabletop. \"This homecoming is a complete disaster.\" \"How do you mean?\" \"In the four weeks Ian\u0027s been home, we\u0027ve barely made love.\" She was embarrassed to be talking about the intimate details of her marriage, even to Cathy, but she could no longer hide her unhappiness. Ian made excuses to stay away from her and it was killing her. Cecilia looked up to see her friend frowning. \"What\u0027s wrong?\" Cecilia bit her lip to keep from crying. \"I assumed Ian would want to start our family, but he doesn\u0027t. He wants me back on birth control before we make love on a regular basis.\" \"Are you?\" \"Not yet, but my period\u0027s due soon. We\u0027ve used protection, but Ian is adamant—I\u0027m supposed to go back on the pill. Until then it\u0027s like I\u0027m his sister. He won\u0027t even look at me and I hate it.\" \"He doesn\u0027t want a baby?\" Cecilia shook her head. \"Every time I try to mention it, he changes the subject.\" Cathy nodded sympathetically. \"Last week, when I refused to let him sidetrack me, he blew up and said he wasn\u0027t ready to be a father yet. I asked him when he would be ready and do you know what he said?\" She didn\u0027t wait for her friend to respond. \"Ian said he didn\u0027t think he\u0027d ever be ready.\" Cecilia covered her face with both hands, distraught and weepy. Cathy placed her hand on Cecilia\u0027s forearm. \"Do you remember when I told you that I miscarried twice before Andy?\" Cecilia lowered her hands and nodded. She hated being so emotional, but she couldn\u0027t help it. She\u0027d created a million romantic fantasies centered on their reunion and everything had gone wrong. Nothing she said or did seemed to work. \"After I miscarried the second time, I was afraid it was the end of my love life. It was as if Andrew had completely lost interest in me as his wife.\" Cecilia had trouble believing it. \"Andrew?\" Cathy\u0027s eyes filled with tears. \"The miscarriages affected my husband in ways I didn\u0027t understand. I was so wrapped up in me that I didn\u0027t see what losing the pregnancies had done to Andrew. He was afraid to make love to me, afraid I\u0027d get pregnant again—afraid I\u0027d suffer again. I was convinced he didn\u0027t want me because I couldn\u0027t carry his child. And that wasn\u0027t it at all.\" Cathy paused and swallowed visibly. \"Our minds play crazy games with us, don\u0027t they?\" Cecilia wasn\u0027t sure that applied to her situation. Ian was far more vocal about his feelings than Andrew had been, from the sound of it. Ian and Cecilia had worked hard on their communication skills and had learned to be more straightforward in expressing their needs and feelings. Now this. \"What about that little outfit you bought from the Victoria\u0027s Secret catalog?\" Cathy asked, lowering her voice to a whisper. \"The one you sent him...\" Cecilia shrugged uncomfortably. \"I haven\u0027t even put it on. Ian was in too much of a hurry the first night and then, well... he just hasn\u0027t been all that interested since.\" Cathy laughed. \"Oh, he\u0027s interested, all right, but he\u0027s also afraid. If he\u0027s in a bad temper. \"He is,\" Cecilia confirmed. She couldn\u0027t remember her husband ever being as moody as he\u0027d been this last month. \"You know why, don\u0027t you,\" Cathy said, smiling now. \"He\u0027s frustrated.\" \"There\u0027s no reason for him to be frustrated. I\u0027m ready, willing and able,\" Cecilia muttered irritably. \"Then let him know that.\" \"You think?\" She hated to feel this hopeful after being disappointed again and again. Cathy smiled. \"Why don\u0027t you give that sexy little outfit a try and find out for yourself?\" The question stayed with Cecilia as she drove home, the truck filled with groceries. Her husband was working in the garage attached to their duplex when she returned. He was messing around with an old motorcycle a friend had given him, the engine disassembled and various parts laid out on a tarp. Cecilia had forgotten they even had the thing. Wordlessly he helped her unload the groceries and then went back to whatever he was doing that involved so much of his concentration. She didn\u0027t disturb him. At six, she called Ian inside for dinner. She\u0027d made lasagna, one of his favorite dishes, and he praised her efforts. Cecilia glowed at his approval and waited until Ian was in bed reading before she took a long, hot shower. Heart pounding, she donned the sexy black outfit. As well as she could, she checked her reflection in the bathroom mirror. With steam from her shower fogging up the view, it was hard to tell if she looked sexy. To be on the safe side, she liberally doused perfume on her wrists and behind both ears. If her heart was beating hard earlier, it didn\u0027t compare with the frantic explosion going on inside her chest when she opened the bathroom door and posed there, one arm raised and resting against the doorframe. Ian sat in bed reading. His bedside lamp cast a warm glow about the room. He seemed to be deeply involved in his novel and for a moment didn\u0027t pay her any heed. When he did happen to glance up to see her standing in the doorway, his mouth fell open.","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-13.html","bookId":1944,"book":{"id":1944,"title":"44 Cranberry Point (Cedar Cove #4)","description":"Storyline: 44 Cranberry Point (Cedar Cove #4) Dear Reader, I love living in Cedar Cove, but things haven\u0027t been the same since a man died at our B and B. Turns out his name was Max Russell, and Bob had known him briefly in Vietnam.We still don\u0027t have any idea why he came here and—most important of all—who killed him. Because it now appears that he was poisoned. I sure hope somebody figures it out soon! Not that we\u0027re providing the only news in Cedar Cove these days. I heard that Jon Bowman and Maryellen Sherman are getting married. And Maryellen\u0027s mom, Grace, has more than her share of interested men! The question is: Which one is she going to choose? Olivia—I guess it\u0027s Olivia Griffin now— is back from her honeymoon, and her mother, Charlotte (who\u0027s in her mid-seventies at least), seems to have a man in her life, too. I\u0027m not sure Olivia\u0027s too pleased…. There\u0027s lots of other gossip I could tell you. Come by for a cup of tea and one of my blueberry muffins and we\u0027ll talk. Peggy Beldon","cover":"https://allnovel.net/images/44-cranberry-point-cedar-cove-4.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/44-cranberry-point-cedar-cove-4.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:03:12 AM"}}
