{"id":67111,"no":29,"title":"Page 29","content":"\"What was that?\" Peggy asked. Hannah was silent for several minutes. \"Nothing pleased him. The napkins had to be put on the table just so or he\u0027d throw them on the floor. Dinners were a nightmare. Mom always did something wrong. The meat was tough, the vegetables were overcooked, the milk was too cold. Either the silverware wasn\u0027t properly lined up or the saltshaker wasn\u0027t full enough. Everything had to be perfect for Dad. Hard as she tried to please him, it was impossible. Dad found fault with the smallest thing.\" This was much worse than Peggy had realized. \"We moved at least once a year. Dad would sometimes use other names, and I had to remember what my name was because he\u0027d change it.\" \"Your dad used other names?\" Hannah\u0027s head snapped up. Her eyes widened. \"I never told the sheriff that. Please don\u0027t mention it, all right? Dad hadn\u0027t done it in a long time and I was afraid that if Sheriff Davis found out, he\u0027d think my dad was a criminal or something.\" Peggy sighed, but she managed to swallow the exasperated response that sprang to her lips. It would\u0027ve helped had the girl revealed this earlier. Apparently, there was still a great deal they didn\u0027t know about Maxwell Russell—including why he\u0027d come to Cedar Cove. A chill raced down her spine. They\u0027d been on edge ever since the night someone had followed Bob home, although nothing had happened since. \"My mother was a saint,\" Hannah whispered. \"She put up with your father\u0027s moods all those years?\" Hannah nodded. \"Sometimes I\u0027d find her sitting on her bed reading his letters. She said it helped her remember what he was like before the war.\" Peggy understood why Tammy Russell had done that. Why she\u0027d kept on hoping, and supporting her husband and—worst of all—putting up with his verbal abuse. She\u0027d still loved him and wanted him to become, once again, the person he used to be. No matter how hopeless that desire. Peggy understood because she\u0027d done something very similar. She, too, had held on to memories of the past, letting them form her hopes for the future. Before joining Al-Anon, Peggy had tried to manipulate Bob into not drinking. She\u0027d used pressure, guilt, punishment, anger and every other behavior she could think of. None of it had worked until she\u0027d stepped aside, forcing Bob to deal with the consequences of his drinking. But through it all, Peggy had stood by her husband, just like Hannah\u0027s mother. \"Dad was in one of his dark moods when the car accident happened,\" Hannah whispered. \"I wanted Mom to leave him, but she wouldn\u0027t. I had a job.... I could have supported the two of us, but she wouldn\u0027t do it.\" \"Oh, Hannah, I\u0027m so sorry.\" \"I am, too.... Mom wasn\u0027t supposed to be in the car with him that day. But he was so angry and unreasonable and he demanded that she go with him and then he had the accident—and Mom was killed.\" Weeping openly now, she covered her face with both hands. Peggy came out of her chair and wrapped her arms around Hannah\u0027s shoulders, murmuring soft, meaningless words of comfort. \"If only Mom hadn\u0027t gone that day, she\u0027d be alive now.\" \"I know, I know,\" Peggy said. \"Dad was hurt so badly in the fire and Mom...didn\u0027t have a chance. I wanted to die then, too... but the accident changed Dad.\" \"In what way?\" Hannah lifted her head and rubbed the sleeve of her robe over her eyes. \"He was calmer, less angry afterward.\" \"So he was easier to deal with?\" Hannah nodded. \"I think Mom\u0027s death was what did it. He was lost without her. He went through so much pain, you know, and all the surgery, and.. .and for the first time in my life, I felt I had a father. He talked to me and called me his little girl and said he loved me. And then.. .and then he was murdered.\" She sniffled once. Peggy could imagine what life had been like for Hannah. Until his accident, Maxwell Russell was a harsh, bitter man who often took his anger out on his wife and daughter. It was little wonder that Hannah vacillated between grief and guilt over the death of her father. Thirty Grace checked her watch for the third time in two minutes and used a deep-breathing method to calm her pounding heart. Cliff would be joining her at The Lighthouse any moment now and she was as nervous as if she were fifteen again, going out with a boy for the first time. Tonight was their dinner date, the one Jack and Olivia, Charlotte, Maryellen, Jon, Kelly and Paul had bought at the Dog and Bachelor Auction. Her friends and family had forked out a whopping eight hundred dollars to arrange this, and Grace was determined to enjoy it. If only she could calm her nerves. She smiled as she thought of Justine\u0027s equally expensive new dog, a golden retriever like her own Buttercup. According to Olivia, the whole family adored Sadie. And speaking of Olivia... Grace had arrived at the restaurant fifteen minutes early in order to escape her best friend. Olivia had spent half the afternoon with her, discussing every detail of Grace\u0027s outfit, hair and makeup. Anyone might think Grace was entering a beauty pageant or attending the Academy Awards! Olivia\u0027s interest was well-intentioned, but Grace had reached her limit, so she\u0027d left the house early and gone straight to the restaurant. When Cliff did appear, it was all Grace could do not to jump up from her chair. Swallowing suddenly became difficult. Cliff saw her then and walked across the room, his steps slow and measured, as if he felt resigned to this evening but not pleased. With a stiff smile, she extended her hand to him in a rather formal greeting. \"Thank you for being my dinner date,\" she said, hoping her words were intelligible. \"I should be the one thanking you,\" he said as he pulled out his chair. \"It\u0027s good for my ego.\" He paused, apparently reconsidering his comment. \"Now that I think about it, wasn\u0027t it Olivia who placed the bid?\" Grace nodded. No one had paid more for a bachelor; Cliff should feel flattered by that. \"Justine and Seth love the dog, and apparently Leif\u0027s quite taken with her, too.\" Cliff smiled at the mention of the dog. She smiled back, more naturally this time. Cliff couldn\u0027t seem to take his eyes off her, which made her heart beat faster. Cliff looked more attractive than ever, and she gazed at him avidly. She saw him so seldom these days and when she did, it was a painful reminder of what might have been. \"How are you?\" he asked, his voice low. This wasn\u0027t a casual question; she sensed that the moment the words left his lips. He wanted the truth. \"Lonely.\" Cliff lowered his eyes, although she\u0027d noticed the worried expression he tried to hide. His silence unsettled her, so she hurried to fill it. \"I have a kitten now.\" She offered this information eagerly, not just to appease his concern about her loneliness but because she knew he\u0027d be interested. \"I got him at the Farmers\u0027 Market a month ago. I was doing one of my volunteer stints, and he was the last one left. I named him Sherlock because he\u0027s constantly digging into things.\" Cliff grinned boyishly and his worried look fled. \"What does Buttercup think of him?\" \"Actually she\u0027s happy to have the company. The two of them sleep together. I have pictures.\" She reached for her purse and pulled out several photos of her animals, as well as her grandchildren. \"Sherlock,\" Cliff murmured as he studied the first photograph. \"The name suits him.\" \"I thought so, too,\" Grace said. \"The others are of Tyler and Katie. I refuse to let you escape without updating you on my grandchildren.\" His grin deepened. \"I just happened to bring a picture of April.\" He slid one hand into his inside pocket and brought out a photograph. The waitress came for their drink order, and Cliff suggested a bottle of Washington State Chardonnay. Grace nodded at his choice. She stared at the picture of Cliff\u0027s daughter and granddaughter. She\u0027d met Lisa last Thanksgiving, when they\u0027d flown to Maryland to be with his family. Cliff and his daughter were especially close. After exchanging photographs, Grace looked at him. \"And you?\" she asked. \"How are you, Cliff?\" \"Busy.\" He didn\u0027t respond seriously the way she had; his reply was flippant. She dropped her eyes in an effort to recover. In one word, he\u0027d let her know she wasn\u0027t allowed access to his world anymore. Despite his earlier sincerity, that brief glimpse of caring and concern, this dinner wasn\u0027t going to change anything. Olivia and her daughters might as well have saved their money. Grace\u0027s spirits plummeted. The waitress returned with their wine, uncorked it and poured a sample for Cliff to approve. After the tasting ritual and the pouring, she took their dinner order. \"I\u0027m off to Texas to buy a horse next week,\" Cliff said as if it was now his turn to fill the ensuing silence. \"I hope so, anyway. I\u0027ve had my eye on a particular quarter horse stud for quite some time.\" He continued talking about the qualities that made this horse important to him. Most of what he said was beyond Grace\u0027s slim knowledge of breeding and horses, but she listened attentively. \"Well, I hope your trip is successful,\" she said when he\u0027d finished. Silence again. Their whole evening seemed destined to crawl from one awkward silence to another. \"I feel I can leave the ranch now that I have Cal,\" he added. \"How is Cal?\" she asked. Their conversations never used to be stilted like this. They always had a million things to say to each other, sharing pieces of their lives. Except for what she hadn\u0027t shared—her Internet romance with Will Jefferson. Would she never be forgiven for that? Cliff started to chuckle, and she glanced up. \"What?\" Grace smiled, too, although she didn\u0027t know why. \"The Dog and Bachelor Auction,\" he said. \"Do you remember that Corrie McAfee bid on him for her daughter?\" \"Oh—yes.\" She\u0027d found it difficult to keep track of which bachelor had gone to whom, although she\u0027d received personal satisfaction from Stan Lockhart\u0027s fate. She noticed he hadn\u0027t been around town as much lately and in Grace\u0027s opinion, that was a good thing. \"Did you read in the paper that thanks to Charlotte and Ben, the town\u0027s worked out a deal with Puget Sound Medical and Dental to set up a clinic?\" \"Speaking of Ben...\" Grace closed her mouth. \"What about him?\" She shook her head, angry with herself. \"Nothing... It\u0027s just that Olivia is worried about her mother and Ben.\" \"Why?\" \"Well, no one ever heard of him until recently.\" \"No one had ever heard of me, either,\" Cliff reminded her. \"But you aren\u0027t dating a judge\u0027s mother. In her line of work, Olivia has reason to be suspicious—but I\u0027m sure nothing will turn up.\" Cliff picked up his water glass. \"Nothing will turn up where?\" In her uneasiness, Grace had already said more than she\u0027d intended. \"Forget I said that.\" She hoped he\u0027d simply put this conversation out of his mind. No such luck. \"Olivia\u0027s having a background check done on Ben?\" he asked bluntly. Grace felt dreadful, but she couldn\u0027t lie to Cliff again. \"Yes. Please don\u0027t say anything.\" \"You think I\u0027d tell Charlotte this?\" That made her feel even worse, since Charlotte and Cliff were friends. \"No...Cliff, please, I should never have said anything.\"","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-29.html","bookId":1944,"book":{"id":1944,"title":"44 Cranberry Point (Cedar Cove #4)","description":"Storyline: 44 Cranberry Point (Cedar Cove #4) Dear Reader, I love living in Cedar Cove, but things haven\u0027t been the same since a man died at our B and B. Turns out his name was Max Russell, and Bob had known him briefly in Vietnam.We still don\u0027t have any idea why he came here and—most important of all—who killed him. Because it now appears that he was poisoned. I sure hope somebody figures it out soon! Not that we\u0027re providing the only news in Cedar Cove these days. I heard that Jon Bowman and Maryellen Sherman are getting married. And Maryellen\u0027s mom, Grace, has more than her share of interested men! The question is: Which one is she going to choose? Olivia—I guess it\u0027s Olivia Griffin now— is back from her honeymoon, and her mother, Charlotte (who\u0027s in her mid-seventies at least), seems to have a man in her life, too. I\u0027m not sure Olivia\u0027s too pleased…. There\u0027s lots of other gossip I could tell you. Come by for a cup of tea and one of my blueberry muffins and we\u0027ll talk. Peggy Beldon","cover":"https://allnovel.net/images/44-cranberry-point-cedar-cove-4.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/44-cranberry-point-cedar-cove-4.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:03:12 AM"}}
