{"id":22118,"no":5,"title":"Chapter Four. The Outbreak of War.","content":"As soon as the Jacksons’ house was finished, they went into residence there; but two or three times a week Dick and Tom managed to meet, one or other being sure to find some excuse for riding over. The Humphreys had arrived in Natal at the end of April, 1877, and by November in the following year their farm presented a very different appearance to that which it had worn on their arrival—sixteen months of energetic labour, carried on by a considerable number of hands, will effect wonders. Possessing ample capital Mr Humphreys was able to keep a strong gang of Kaffirs at work, and for some time had thirty men upon the farm. Thus the house which, when he took it, stood solitary and lone in a bare plain, was now surrounded by 200 acres of young trees. Of these, twenty acres were fruit-trees; the remainder, trees grown for their wood. These were planted thickly, as they would every year be thinned out, and the young poles would fetch a good sum for fencing. Although they had only been planted a few months, they were already green and bright; they were protected from the cattle by a wire fence encircling the whole. The cattle had thriven and were doing well, and a large field of Indian corn had been harvested for the use of the Kaffirs. The cattle had nearly doubled in numbers, as Mr Humphreys did not care about selling at present. The expenses of living were slight. Meat, fowls, and eggs were raised upon the farm, and the guns of Mr Humphreys and Dick provided them with a plentiful supply of game. Four milch cows were kept in a paddock near the house, and supplied it with milk, butter, and cheese. Groceries and flour had alone to be purchased, and, as Mr Humphreys said, he did not care if he did not sell a head of cattle for the next ten years; but he would be obliged to do so before long, as the farm would carry but a small number more than he already possessed, and its available extent for that purpose would diminish every year, as the planting went on. Mr Humphreys was fortunate in having a small stream run through his farm. He erected a dam across a hollow, so that in winter a pond of two or three acres in extent, and fifteen or sixteen feet deep, was formed, affording an ample supply for the summer; this was of great utility to him, as he was thereby enabled to continue his planting operations, filling up each hole with water when the trees were put in, and then, as this subsided, filling in the earth; by this means the young trees got a good start, and seldom required watering afterwards. He had a large water-cart built for him; this was drawn by four oxen, and brought the water to the point where the Kaffirs were engaged in planting. Steers sufficient for two waggons had been broken in, and when these were not employed in bringing up young trees and fencing from Newcastle they worked upon the road between Newcastle and Pieter-Maritzburg, there being a great demand for conveyance, as numbers of traders were going up into the Transvaal and opening stores there. Mr Jackson had also two waggons engaged in the same work. When trees and goods were wanted for the farm, Dick went down with the waggons to see that these were properly loaded, and that the young trees, which were often in leaf, were taken out every night and set with the roots in water until the morning. One evening, early in October, Mr Jackson rode over with Tom. “I have heard,” the former said to Mr Humphreys, “that the government have determined on moving the troops down to the Zulu frontier; the attitude of Cetewayo is very threatening.” “He is a troublesome neighbour,” Mr Humphreys said. “They say that he has 30,000 fighting-men, and in that case he ought to be able to overrun both Natal and the Transvaal, for there is no doubt that Zulus fight with great bravery. As for the Dutch, I really can’t blame the Zulus. The Boers are always encroaching on their territory, and any remonstrance is answered by a rifle-shot. Had it not been for our annexation of the Transvaal, Cetewayo would have overrun it and exterminated the Dutch before now. We have a strong force in the colony just at present, and I think Sir Bartle Frere means to bring matters to a crisis. The existence of such an army of warlike savages on the frontier is a standing threat to the very existence of the colony, and the constitution of the army renders it almost a necessity that it should fight. All the men are soldiers, and as none are allowed to marry until the regiment to which they belong has distinguished itself in battle they are naturally always burning for war. The Pieter-Maritzburg paper says that it understands that Sir Bartle Frere is about to send in an ultimatum, demanding—in addition to various small matters, such as the punishing of raiders across the frontier—the entire abandonment of the present system of the Zulu army, and cessation of the bloody massacres which constantly take place in that country. If a man offends the king, not only is he put to death, but the whole of the people of his village are often massacred. Altogether an abominable state of things prevails; there seems to be but one opinion throughout the colony, that it is absolutely necessary for our safety that the Zulu organisation shall be broken up.” “I see,” Mr Jackson said, “that there is an advertisement in the papers for waggons for the transport of stores, and the price offered is excellent. A large number are required; I was thinking of sending down my two teams—what do you think?” “I have been turning it over in my mind,” Mr Humphreys replied, “and I am inclined also to offer my waggons. The rate of pay is, as you say, high, and they certainly will have a difficulty in obtaining the number they require. I shall not have need for mine for home purposes for a considerable time now. The hot weather will soon be setting in, and planting is over for the season. I shall of course go on digging holes for my next batch, but I shall not want them up until after the end of the hot season. So I think, as I can spare them, I shall hire them to government. I think we ought all to do what we can to aid it at present, for every one agrees as to the necessity of the steps it is now taking.” “And do you think that there will be any fighting, father?” Dick asked eagerly. “That no one can say, my boy. The Zulus are a proud as well as a brave people, and believe that they are invincible. I hardly think that they will consent to break up their army and abandon their customs at our dictation; I should not be surprised if it comes to fighting.” “Oh, father, if you hire the waggons to government, may I go with them? I can see that the Kaffirs look after the oxen, you know, and that everything goes straight. I have picked up a little Kaffir from Joel, and can manage to make them understand.” “Well, Dick,” Mr Humphreys said, after a little thought, “I don’t know that I have any objection to it; it will be a change for you, and of course there will be no chance of the waggons being near if any fighting goes on. What do you think, Jackson? I suppose your boy will want to go if mine does?” “Well, I don’t mind,” Mr Jackson answered. “I suppose it will not be for long, for the boy is useful on the farm now. However, as you say, it will be a change, and boys like a little excitement. Well, I suppose I must say yes; they are fifteen now, and old enough to keep out of mischief.” The boys were delighted at the prospect of the expedition, and at once went out to talk matters over together. They cordially agreed in the hope that the Zulus would fight, and promised themselves that if possible they would see something of it. Their fathers would, they thought, allow them to take their horses, and it would be easy, if the waggons were left behind, to ride forward with the troops, and see what went on. Two days later the four teams started together for Pieter-Maritzburg. Contrary to their expectations the boys were not allowed to take their horses. “No, no, Dick,” Mr Humphreys had said, when his son asked him, “no horses, if you please; I know what you will be up to. Galloping about to see what is going on, and getting into all sorts of mischief and scrapes. No, if you go, you go with the waggons, to see that everything goes straight, to translate orders to the Kaffirs, and to learn something of waggon-driving across a rough country. For between this place and Pieter-Maritzburg it is such a fair road that you really learn nothing in that way; once get into a cross country, and you will see how they get waggons down steep kloofs, across streams, and over rough places. No, you and Tom will stick to the waggons. I have been fixing a number of rings to-day underneath one of them, and your mother and the women have been at work, making a sort of curtain to hook on all round; so at night you will have a comfortable place to sleep in, for the waggons will likely enough be so filled with cases and stores that there will be no sleeping in them. You can take the double-barrel as well as your Winchester, as of an evening you may be able to get a shot sometimes at game, which will vary your rations a bit. You must take with you a stock of tinned meats from Pieter-Maritzburg, for I do not suppose they will issue regular rations to you. So long as you are this side of the Tugela, you will be able to buy food; but if the troops cross into Zululand, you may have to depend on what you carry.” Tom with his two waggons arrived at daybreak, and the four teams set off together, Mrs Humphreys—who had now completely lost her cough and was quite strong and well—laying many injunctions upon Dick against exposing himself to any danger, and Dick promising to be as careful as possible. Upon their arrival at Pieter-Maritzburg the boys went at once to the government transport-yard, and on stating their errand were shown into the office of the officer in charge. “We have brought down four teams of sixteen oxen each,” Dick said, “from near Newcastle, to be hired to the government.” “That is right, my lads,” the officer said, “we have room for plenty more. This is the form of contract. You engage to serve the government by the month; you bear any damages which may take place from wear and tear of the roads, breakdowns, and the other ordinary accidents of travel; the government engages to make good any loss or damage which may occur from the action of the enemy. This is not,” he said, smiling, “likely to take place, but still those are the terms. Have you any authority from your fathers, to whom, I suppose, the teams belong, to sign the contracts for them?” “Yes, sir,” Dick said. “Here is a paper from my father, and one from Tom Jackson’s father, saying that they agree to be bound by the terms of the contract, and that they authorise us to sign in their names. We are going with the waggons, sir, to look after the Kaffirs.” “Well,” the officer said, “you can do as you like about that; but if you speak Kaffir it will be useful—only, mind, you will have to provision yourselves. From the day the teams are taken up, rations of mealies will be served to the Kaffirs at the various halting-places, but there is no provision for rations of white men. The cattle, too, will be fed, but you will have to see to yourselves.” “Yes, sir; we expected to do so.” “Well, you had better fetch the teams up to the yard. I must inspect and pass them before they are taken up. Bring them round at once; then they will be loaded to-night, and start at daybreak to-morrow.” The teams were brought round to the yard, and immediately passed by the officer, who indeed remarked upon the excellence of the animals. The Kaffirs were directed to outspan or unyoke the oxen, for whom rations of hay and grain were at once issued. The boys returned to the town and made their purchases, which were carried down by two Kaffirs and stored in the waggons, which were already in process of being loaded—two with boxes of ammunition, the others with miscellaneous stores for the troops. They slept at an hotel, and next morning at daybreak presented themselves at the yard. The Kaffirs were already harnessing up the oxen, and in a quarter of an hour the four waggons, with sixteen others, started for the Tugela. It was now the middle of December. Early in the month commissioners had been sent to Cetewayo with the terms decided upon by Sir Bartle Frere. The first clauses of the document contained the settlement of the disputed frontier, and fines were fixed to be paid by the chiefs whose men had committed forays across the borders; it then went on to demand that the whole of Cetewayo’s army should at once be disbanded; freedom of marriage was to be allowed, when the parties thereto were of age; justice was to be impartially administered; missionaries to be allowed to reside in the Zulu country; British residents to be appointed; all disputes between Zulus and Europeans to be referred to the king and resident; and no expulsion from Zulu territory was to be carried into effect without the distinct approval of the resident. It was intimated to the king that unless these terms were accepted by the 11th of January the army would at once invade the country. Few men expected that the Zulu king would tamely submit to conditions which would deprive him of all the military power in which he delighted, and would reduce him to a state of something like dependency upon the British. During the month of December General Thesiger, who commanded the British forces in South Africa, made every effort to prepare for hostilities. The regiments which were at the Cape were brought round by sea; a brigade of seamen and marines was landed from the ships of war; several corps of irregular horse were raised among the colonists; and regiments of natives were enrolled. Before the date by which the king was to send in his answer the troops were assembled along the frontier in the following disposition:— Number 1 Column. (Headquarters, Thring’s Post, Lower Tugela.) Commandant.—Colonel C.K. Pearson, the Buffs. Naval Brigade.—170 bluejackets and marines of H.M.S. Active (with one Gatling and two 7-pounder guns), under Captain Campbell, R.N. Royal Artillery.—Two 7-pounder guns and rocket-battery, under Lieutenant W.N. Lloyd, R.A. Infantry.—2nd battalion, 3rd Buffs, under Lieutenant-Colonel H. Parnell. Mounted Infantry.—100 men under Captain Barrow, 19th Hussars. Volunteers.—Durban Rifles, Natal Hussars, Stanger Rifles, Victoria Rifles, Alexandra Rifles. Average, forty men per corps—all mounted. Native Contingent.—1000 men under Major Graves, the Buffs. Number Two Column. (Headquarters, Helpmakaar, near Rorke’s Drift.) Commandant.—Colonel Glyn, 1st battalion, 24th Regiment. Royal Artillery.—N. battery, 5th brigade, Royal Artillery (with 7-pounder guns), under Major A. Harness, R.A. Infantry.—Seven companies 1st battalion, 24th Regiment, and 2nd battalion, 24th Regiment, under Lieutenant-Colonel Degacher. Natal Mounted Police.—Commanded by Major Dartnell. Volunteers.—Natal Carabineers, Buffalo Border Guard, Newcastle Mounted Rifles—all mounted; average, forty men. Native Contingent—1000 men, under Commandant Lonsdale, late 74th Highlanders. Number 3 Column. (Headquarters, Utrecht.) Commandant.—Colonel Evelyn Wood, V.C. C.B., 40th Regiment. Royal Artillery.—11th battery, 7th brigade, R.A. (with four 7-pounder guns), under Major E. Tremlett, R.A. Infantry.—1st battalion 13th Regiment, and 90th Regiment. Mounted Infantry.—100 men, under Major J.C. Russell, 12th Lancers. Frontier Light Horse.—200 strong, under Major Redvers Buller, C.B., 60th Rifles. Volunteers.—The Kaffrarian Vanguard, Commandant Schermbrucker, 100 strong. Native Contingent.—The Swazis, our native allies, some 5000 strong. In the first fortnight of their engagement the waggons travelled backward and forward between Pieter-Maritzburg and Grey Town, which for the time formed the base for the column of Colonel Glyn. The distance of the town from the capital was forty-five miles, and as the waggons travelled at the rate of fifteen miles a day, they were twelve days in accomplishing two double journeys. When they were loaded up the third time, they received orders to go straight through to the headquarters of the column at Helpmakaar. The boys were pleased at the change, for the road as far as Grey Town was a good one. They reached Grey Town for the third time on the 2nd of January. Here they found the place in a state of great excitement, a mounted messenger having arrived that morning with the news that Cetewayo had refused all demands and that large bodies of the Zulus were marching towards the frontier to oppose the various columns collecting there. On arriving at the government-yard the lads received orders at once to unload the waggons and to take on the stores of the 2nd battalion of the 24th, which was to march from Grey Town the next morning. The start was delayed until the afternoon, as sufficient waggons had not arrived to take on their baggage. The road was rough, and it was late in the afternoon before they arrived at the Mooin River. The weather had set in wet, the river was in flood, and the oxen had immense difficulty in getting the waggons across. Two teams had to be attached to each waggon, and even then it was as much as they could do to get across, for the water was so high that it nearly took them off their feet. The troops were taken over in punts, and, after crossing, a halt was made for the night. After seeing the cattle outspanned and attended to, the boys wandered away among the troops, as they were to start at daybreak, and it was long past dark before all were over. The tents were not pitched, and the troops bivouacked in the open. Brushwood was collected from the rough ground around, and blazing fires were soon burning merrily. It was all new and very amusing to the boys. The troops were in high spirits at the prospect of an early brush with the enemy, and songs were sung around the fires until the bugle rang out the order, “Lights out,” when the men wrapped themselves in their blankets and lay down, and the boys retired to their snug shelter under the waggons, where their Kaffirs had as usual laid piles of brushwood to serve as their beds. The next morning they were off early, and reached the Tugela after five hours’ march. This river does not here form the frontier between Zululand and Natal, this being marked by the Buffalo—a much larger and more important stream—from the point where this falls into the Tugela, some fifteen miles below the spot where they crossed the latter river, which here runs towards the southwest. Two more days’ marching took the column to Helpmakaar. The weather was wet and misty, and the troops now marched in close order, with flankers thrown out, for the road ran parallel with the Buffalo, about five miles distant, and it was thought possible that the Zulus might cross the river and commence hostilities. A cordon of sentinels had, however, been placed all along the river from Rorke’s Drift down to the point of junction of the Buffalo and Tugela; below the stream was so wide that there was no fear of the Zulus effecting a crossing. Most of the troops which had been stationed at Helpmakaar had already marched up to Rorke’s Drift, and after staying two days at Helpmakaar the 2nd battalion of the 24th marched to that place, where the 1st battalion of the same regiment were already encamped. Two days later the remainder of the force destined to act under Colonel Glyn had assembled at Rorke’s Drift—the term “drift” meaning a ford across a river. This column was the strongest of those which had been formed for the simultaneous invasion of Zululand, and General Thesiger was himself upon the spot to accompany it. Many of the waggons which had brought up stores were sent back to Grey Town for further supplies; but those of the boys, being laden with the spare ammunition and baggage of a portion of the 24th, were to accompany the column in its advance. The last two days of the term granted to Cetewayo to accede to our terms were full of excitement; it had been reported, indeed, that the king was determined upon resistance, but it was thought probable that he might yield at the last moment, and the road leading down to the drift on the other side of the river was anxiously watched. As the hours went on and no messenger was seen approaching, the spirits of the troops rose, for there is nothing that soldiers hate so much as, after enduring the fatigues preparatory to the opening of a campaign, the long marches, the wet nights, and other privations and hardships, for the enemy to yield without a blow. Men who had been in the campaigns of Abyssinia and Ashanti told their comrades how on both occasions the same uncertainty had prevailed as to the intentions of the enemy up to the last moment; and the fact that in both campaigns the enemy had at the last moment resolved to fight, was hailed as a sort of presage that a similar determination would be arrived at by the Zulu king. To the boys these days passed very pleasantly; they had nothing to do but to wander about the camp and watch the proceedings. There was a parade of the two native regiments before the general, who was much pleased with their appearance, and who exhorted them on no account to kill women, children, or prisoners. Among these native regiments were curiously many Zulus; for great numbers of this people had at various times been obliged to take refuge in Natal, to avoid the destruction threatened them by their despotic king, and these were now eager to fight against their late monarch. Some of the bodies of volunteer horse were very smart and soldier-like in their appearance. They were for the most part composed of young farmers, and Dick and Tom bitterly regretted that they had not been a few years older, in which case, instead of looking after a lot of bulls, as Dick contemptuously said, they might have been riding in the ranks of the volunteers. By the regulars the two days were spent in cleaning their arms and accoutrements, whose burnish and cleanliness had suffered much in the long wet march, and from the bivouacs on the damp ground. After marching from Grey Town with the 24th the boys had been placed regularly on the roll of the army, as conductors, and, although they drew no pay, had now the advantage of receiving rations as white men. They had upon the line of march frequently chatted with the young officers of the regiment, who, finding that they were the sons of well-to-do farmers and were cheery, high-spirited lads, took to them very much, and invited them of an evening to join them round the camp-fire. The last day came, and still no messenger arrived from Cetewayo, and in the evening orders were issued that the column should at daybreak pass the drift and advance into the enemy’s country. The troops laid down that night in high spirits, little dreaming of the disaster which was to befall them in the campaign which they thought of so lightly.","sourceLink":"http://novel.tingroom.com/duanpian/3172/86994.html","bookId":862,"book":{"id":862,"title":"The Young Colonists","description":"简介： As a rule the minor wars in which this country has been from time to time engaged, have been remarkable both for the admirable way in which they were conducted and for the success that attended them. The two campaigns in South Africa, however, that f...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3172","creation":"Aug 1, 2019 12:23:37 AM","modification":"Aug 1, 2019 12:23:37 AM"}}
