{"id":91743,"no":19,"title":"Page 19","content":"A single chair dominated the floor; it sat atop a raised dais and was flanked by tall, iron statues of fierce warriors holding gigantic swords before them - while their other hands inconspicuously clasped tiny daggers. No other doors were apparent, though a curtain covered the section of wall immediately behind the chair. With Danica hovering protectively about him, Cadderly called up the song of Deneir, searched for clues its notes could give to him about the nature of the many things around him. He stood easier when he detected no magical influences on the gargoyle sculptures, but nearly retreated when he turned to the iron statues. Parts of them - mouth and arms, mostly - tingled with residual magical energy. \"Golems?\" Danica whispered, seeing the young priest\u0027s eyes open wide. Cadderly honestly did not know. Golems were wholly magical creatures, animated bodies of iron, stone, or other inanimate materials. They would have seemed appropriate here, for such monsters were usually created by powerful wizards or priests to serve as guardians. Certainly with everything Cadderly had heard about Aballister, the thought of the wizard possessing iron golems, the most powerful of golemkind, was not out of the question. But Cadderly would have expected to detect more magic upon such a creature. \"Where to go?\" Danica asked, her tone revealing that she was growing increasingly uneasy standing vulnerable in a wizard\u0027s anteroom. Cadderly paused for a long moment. He felt that they should go to the curtain, but if these were iron golems, and he and Danica walked up between them.... Cadderly shook the unpleasant image from his mind. The curtain,\" he said resolutely. Danica started forward, but Cadderly caught her by the arm. If she was to trust him, when he could not be sure that he should trust himself, then he would walk beside her, not behind her. With his walking stick, Cadderly gingerly pushed the curtain aside, revealing a door. He started to turn to Danica, to smile, but suddenly, before either of the companions could react, the iron statues swung about, swords stopping barely an inch from them, one in front and one in back. \"Speak the word,\" the iron statues demanded in unison. Cadderly saw Danica tense, expected her to go in a rush at her metallic adversary. A few flickering notes slipped past his consciousness, and he saw, too, the building magical energy in the iron statues\u0027 arms, particularly in the less obvious arms holding the daggers. Cadderly did not have to use magic to guess that the tips of those sneaky weaopns would likely be poisoned. \"Speak the word,\" the statues demanded again. Cadderly focused his senses on the magical energy, saw it rising to a dangerous crescendo. \"Do not move,\" he whispered to Danica, sensing that if she struck out, the two daggers would do their work with deadly efficiency. Danica\u0027s hands eased down to her sides, though she hardly seemed to relax. She trusted his judgment, but Cadderly honestly wondered if that was a good thing. The magical energy appeared as if it would soon boil over, and Cadderly still had not figured out how he might begin to counter or dispel it It seemed to the young priest as if the golems were growing impatient. \"Speak the word!\" Their unified chant rang out as a final warning. Cadderly wanted to tell Danica to dive away, hoping that she, at least, might get free before the nasty daggers struck, or those swords chopped in. The word is Bonaduce,\" came a call from beyond the door, a female voice that the two companions recognized. \"Dorigen,\" Danica breathed, her face scrunched with sudden anger. Cadderly agreed, and knew that trusting in Dorigen would surely be a move wrought of desperation. But something abcut the word, \"Bonaduce,\" struck a note of truth, a note of familiarity, within the young priest. \"Bonaduce!\" Cadderly yelled. The word is Bonaduce!\" Danica\u0027s incredulous stare turned even more disbelieving as the golems shifted back to their frozen, impassive stances. Cadderly, too, did not understand any of it. Why would Dorigen aid them, especially when they were in such dire trouble? He started forward for the door and pulled the curtain fiilly aside. \"It must be trapped,\" Danica reasoned softly, taking hold of Cadderh/s arm to prevent him from reaching for the pull ring. Cadderly shook his head and grabbed the ring. Before Danica could argue, he yanked the door open. They came into a comfortably furnished room. Soft, padded chairs were generously placed, quiet tapestries of solid color lined every wall, and a bearskin rug carpeted the floor. The only hard-edged furnishing was a wooden desk, angled in a corner opposite the door. There sat Dori-gen, tapping a slender wand against the side of her crooked, oft-broken nose. Danica was down in a defensive crouch in an instant, one hand going down to her boot to draw a dagger. \"Have I mentioned before how much you both amaze me?\" the woman calmly asked them. Cadderly sent a silent, magical message into Danica\u0027s thoughts, bidding her to hold easy and see how this might play out \"Are we any less amazed?\" the young priest replied. \"You gave us the password.\" \"So she might kill us herself,\" Danica added grimly. She flipped the dagger over in her hand, grasping it by the point so that she could flick it out at Dorigen in an instant \"That is a possibility,\" the wizard admitted. \"I have many powers\" - she tapped the wand against her cheek - \"that I might use against you, and perhaps this time, our battle would have ended differently.\" \"Would have?\" Cadderly noted. \"Would have ended differently if I held any intention of renewing our battle,\" Dorigen explained. Danica was shaking her head, obviously not convinced. Cadderly, too, had trouble believing in the woman\u0027s sudden change of heart. He fell into the notes of his song, sought out the aurora, the aura sight Shadows flickered atop Dorigen\u0027s delicate shoulders, reflections of what was in her heart and thoughts. These were not huddled, evil things, as Cadderly expected, but quiet shadows, sitting in wait Cadderly came back from his spell, stared at Dorjgen with heightened curiosity. He noticed Danica slide a step to the side and realized that she was trying to put some ground between them, giving the wizard only a single target \"She speaks the truth,\" the young priest announced. \"Why?\" Danica replied sharply. Cadderly had no answer. \"Because I grow tired of this war,\" Dorigen responded. \"And I grow tired of playing Aballister\u0027s lackey.\" \"You believe the horrors of Shilmista will be so easily forgotten?\" Danica asked. \"I do not wish to repeat those horrors,\" Dorigen replied immediately. \"I am tired.\" She held up her hands, fingers still bent from the beating Cadderty had given them. \"And broken.\" The words stung Cadderly, but Dorigen\u0027s soft, benign tone did not \"You could have killed me, young priest,\" the wizard went on. \"You could now, probably, with my own ring, which you wear, if with nothing else.\" Cadderly unconsciously clenched his hand, and felt the onyx-stoned ring with his thumb. \"And I could have let the golems kill you,\" Dorigen went on. \"Or I could have assailed you with an assortment of deadly spells as you walked through the door.\" \"Is this repayment?\" Cadderly asked. Dorigen shrugged. \"Weariness, more than that,\" she said, and the woman did indeed sound tired. \"I have stood beside Aballister for many years, watched him assemble a mighty force with promises of glory and rulership of the region.\" Dorigen laughed at the thought \"Look at us now,\" she lamented. \"A handful of elves, a pair of silly dwarves, and two children\" - she indicated Cadderly and Danica with a wave of her hand, her expression incredulous - \"have brought us to our knees.\" Danica moved again to the side, and Dorigen snapped the wand down in front of her, her face suddenly twisted with a scowl. \"Do we continue?\" she demanded, poking the wand ahead. \"Or do we let this play out as the gods always intended?\" Another silent message came into Danica\u0027s thoughts, compelling her to relax. \"What do you mean?\" Cadderly asked. \"Is it not obvious?\" Dorigen replied, and then she chuckled, remembering that Cadderly still had no idea that Aballister was his father. \"You against Aballister, that is what this war is all about\" Cadderly and Danica looked to each other, both wondering if Dorigen had gone insane. That was not Aballister\u0027s intent,\" Dorigen went on, chuckling still between every word. \"He did not even know that you were alive when Barjin began the whole affair.\" The name of the dead priest caused Cadderly to unconsciously flinch. \"And certainly it was not your intent,\" Dorigen continued. \"You did not, do not, understand the significance, did not even know that Aballister existed.\" \"You babble,\" Cadderty said. Dorigen\u0027s laughter heightened. \"Perhaps,\" she admitted. \"And yet I must believe that it was more than coincidence that has brought us all to this point. Aballister himself played a part in it, a part that he will possibly regret\" \"By starting the war,\" Cadderly reasoned. \"By saving your life,\" Dorigen corrected. Cadderr/s face screwed up even tighter. \"Inadvertently,\" the woman quickly added. \"His hatred for Barjin, his rival, outweighed his understanding of the poisonous thorn you would become.\" \"She lies,\" Danica decided, inching a step closer to the desk, apparently preparing to spring out and throttle the cryptic wizard. \"Do you remember your final encounter with Barjin?\" Dorigen asked. Cadderly nodded grimly; he would never forget that fateful day, the day he had first killed a man. The dwarf, the one with the yellow beard, was held fast by Barjin\u0027s magic,\" Dorigen prompted, and the image came clearly to the young priest Ivan had stopped his advance toward the evil priest, had simply frozen in place, leaving Cadderly practically helpless. Cadderly was no powerful cleric back then, could barely win against a simple goblin, and the evil priest would surely have finished him. But Ivan came out from the enchantment at the last moment, allowing Cadderly to slip from Barjin\u0027s deadly clutches. \"Aballister countered the priest\u0027s magic,\" Dorigen announced. The wizard is not your friend,\" she quickly added. \"He holds no love for you at all, young priest, as is evidenced by the assassin band he sent to kill you in Carra-doon.\" \"Then why did he aid me?\" Cadderly asked. \"Because Aballister feared Barjin more than he feared you,\" Dorigen answered. \"He did not anticipate what the gods had in store for him where young Cadderly was concerned,\" \"How, then, does it play out, wise Dorigen?\" Cadderly asked sarcastically, tiring of the woman\u0027s private amusement and her cryptic references to the gods. Dorigen motioned to the far wall, spoke a word of enchantment to reveal a swirling door of misty fog. \"I was instructed to strike out at you with all my powers, and then retreat. I was to try to separate you from your friends and lead you through that door,\" she explained. Therein lies Aballister\u0027s private mansion, the place where he planned to finish off the young priest who has become such a problem.\" Cadderly studied Dorigen closely through every word, using his aura sight to determine any traps the woman might have in store, Danica looked to him for answers, and he shrugged, convinced, against his own reason, that Dorigen had again spoken truthfully. \"And so I surrender to you,\" Dorigen said, and Cadderly and Danica\u0027s surprise could not have been more absolute. The woman laid her wand on the desk and sat back comfortably. \"Go and play this out to the end, young priest,\" she bade Cadderly, again motioning to the swirling door. \"Let the destiny of the region be determined by the private battle, as fate intended it all along.\" \"I do not believe in fate,\" Cadderly replied firmly. \"Do you believe in war?\" Dorigen asked. \"Do not do it,\" Danica whispered over her shoulder. Dorigen\u0027s smile was wide once more. * \u0027Bonaduce\u0027 will get you through this portal as well.\" \"Do not,\" Danica said again, this time loudly. Cadderly walked away from her, walked toward the wall. \"Cadderly!\" Danica called after him. The young priest wasn\u0027t listening. He had come here to defeat Aballister, to decapitate the force of Castle Trinity, so that thousands needn\u0027t die in a war. This might be a trap, might be a portal that would take him to one of the lower planes and leave him there for eternity. But Cadderly could not ignore the possibilities presented to him by Dorigen\u0027s claims, by that swirling door, and he could not ignore the truths his magic had shown to him. He heard Danica moving behind him. \"Bonaduce!\" he cried, and he jumped into the swirl, and was gone. Friends Lost, Friends Found The four-foot-high counter surrounded the three trapped companions on two sides, with a thick column, floor to ceiling, supporting it on either end of the eight foot front section. The wall blocked their backs, leaving only a small gap to get behind the counter on one side, wide enough for two goblins or one large man. So far, only a single enemy had opted to try that route - and he was summarily blasted away by the elf maiden with her deadly bow. Ivan and Pikel stood atop the counter as the throng advanced, throwing taunts and throwing fists, though no enemies had yet come close enough to hit At Ivan\u0027s proclamation that ores were \"born only to clean the gooey-greens outa ogre noses,\" three of the pig-faced humanoids took up a wild charge. The first skidded in the spilled soup as it was about to leap for Pikel, its back leg flying out from under it and its front leg straight out and up high. It slammed hard against the counter, its ankle and lead foot up above the ledge, and Pikel promptly brought his heel around the ore\u0027s toe and bent it down flat atop the counter, bringing his full weight atop it The trailing ores stumbled about, but using their fallen friend as support, managed to hold a tentative balance as they banged against the side of the counter. Ivan\u0027s axe cleaved one in the side of the head, but the other managed to deflect Pikel\u0027s first clubbing attack. That ore was soon crushed against the side, though, as many of its companions, seeing the intruders suddenly pressed, rushed in. \"We cannot hold!\" Shayleigh cried out \"Just get yerself the archers,\" Ivan replied, huffing and puffing with each word as he worked his axe furiously to keep the sudden mob at bay. \"Me and me brother*!! handle this crew!\" Shayleigh looked helplessly to her nearly empty quiver. Her hand started for her short sword as a soldier came around to the open side, but the elf realized that she did not have the time to spare for melee combat She lamented the waste of an arrow but shot the man down anyway, hoping that his sudden death might give other enemies pause before they tried a similar route. The counter bucked suddenly as an ogre slammed against the back of the crowd, and Shayleigh thought it would break apart, thought that she would be crushed against the wall as the irrepressible monsters pushed on. Her actions purely wrought of terror, she turned to face the counter and put an arrow in the ogre\u0027s face. It fell back and the counter appeared to resettle on its braces. Still unsure of its solidity, the elf maiden scrambled up on a shelf against the back wall, a position that afforded her a better view of the area beyond the immediate battle. A man braced both his hands and one foot on the counter and started to leap up, thinking the dwarves too engaged to stop him. Ivan\u0027s axe promptly broke his spine, though the dwarf took a vicious hit on the hip for the distraction. Ivan grimaced in pain, growled the wound away, and chopped furiously at the goblin attacker, the dwarf\u0027s mighty axe smashing through the creature\u0027s upraised spear, and through the creature\u0027s upturned face. Ivan couldn\u0027t revel in the kill, though, for the press of swords and spears, cruelly tipped pole arms and slashing daggers did not relent. The dwarf skipped and hopped, dodged and parried, and every now and then managed an offensive strike. An arrow appeared suddenly, stuck halfway through Ivan\u0027s yellow beard, and the waves of pain that assaulted the dwarf told him that it had gashed his chin as well. \"I telled ye to get yerself the archers!\" he cried angrily at Shayleigh, but his bluster was lost when he looked in the direction from which the arrow had come, looked to the enemy archer lying dead on the floor, and the elven-crafted arrow sticking from his forehead. \"Never mind,\" the humbled dwarf finished. He hopped as a sword sliced low across and came down with one boot trapping the weapon against the counter. Ivan kicked out, shattering the man\u0027s jaw, knocking him back into the mob. Two others took his place, though, and Ivan was sorely pressed once more. Pikel fared little better. The dwarf scored three quick kills, but was bleeding in several places, with one of the wounds fairly serious. He worked his club back and forth, tried to forget the weariness in his muscled arms, tried to forget the obvious hopelessness of it all. He swooped left, batting aside one lunging spear, but a sword sliced in behind his club, striking against something under his sleeve and then driving through to nick at Pikel\u0027s forearm. \"Ow!\" the green-bearded dwarf squeaked, bringing his arm defensively in tight to his side. Pikel\u0027s pain flew away in a moment, though, replaced by shock when the upper half of his pet snake fell out of his sleeve onto the counter. \"Ooooooo!\" Pikel wailed, his little legs pumping suddenly. \"Ooooooo!\"","sourceLink":"https://allnovel.net/the-cleric-quintet-the-fallen-fortress-the-cleric-quintet-4/page-19.html","bookId":2110,"book":{"id":2110,"title":"The Cleric Quintet: The Fallen Fortress (The Cleric Quintet #4)","description":"Storyline: The war rages on. Cadderly, scholar-priest of the Edificant Library, leads the combined forces of Caradoon and Shilmista forest against Castle Trinity, stronghold of his enemy Aballister. But another mission calls him on a journey leading into the past. A past he would just as soon forget. In this fourth book of \"The Cleric Quintet\", Cadderly leads the combined forces of Caradoon and Shilmista Forest against the Castle Trinity, stronghold of his enemy Alabaster. But another, smaller mission calls him on a journey into the past--a past he\u0027d just as soon forget.","cover":"https://allnovel.net/images/the-cleric-quintet-the-fallen-fortress-the-cleric-quintet-4.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-cleric-quintet-the-fallen-fortress-the-cleric-quintet-4.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:52:13 PM"}}
