{"id":91729,"no":5,"title":"Page 5","content":"The chimera, all three heads looking back at those it had left behind on the ledge or at the furious dwarf scrambling about on its back, never saw the monk. Danica\u0027s spinning kick cracked the leonine jaw and nearly sent the five hundred pound monster tumbling headlong, and then agile Danica was up beside Ivan before the chimera could begin toreact\n She drew out a silver-hilted dagger from one boot, wrapped its sculpted dragon head with her free hand and went to vicious work on the central leonine head. Even more furious was Ivan Bouldershoulder, hands clasped about the goat horns, wrestling the thing back and forth.\n The chimera banked in a steep roll, coming alongside the ledge so that Shayleigh managed another two shots before the snowstorm swallowed the beast and her friends.\n The chimera came around again a moment later, and the elf prepared to fire. But Ivan suddenly popped up and regarded her incredulously, one of Shayleigh\u0027s arrows splintered and hanging from his deer-antlered helmet\n \"Hey!\" the dwarf bellowed, and she lowered the bow. Ivan\u0027s distraction cost him, though, for the goat\u0027s head broke free of his grasp momentarily and butted hard against his face and forehead. Ivan spit out a tooth, grabbed the horns in both hands and butted back, and it seemed to Shayleigh that the dwarf\u0027s attack had been by far the more effective.\n Then they were gone again, behind the blinding sheets of snow. All was suddenly silent, save the howl of the wind. Vander stirred and propped himself up on his elbows; Cadderly\u0027s enchanted wall of fire came down, to reveal Pikel sitting comfortably on the stone, munching a leg of mutton he had opportunistically pulled from his pack and roasted in the magical flames.\n \"Oo,\" the green-bearded dwarf said, hiding the meat behind his back when he noticed Cadderly\u0027s amazed expression.\n \"Do you see them?\" Shayleigh asked, limping to Cadderly\u0027s side and directing his gaze back to the empty air.\n Cadderly peered through the snow and shook his head. When he looked back to Shayleigh, though, all thoughts of his monster-riding friends were replaced by the immediate needs of the wounded elf maiden. Several spikes had struck Shayleigh, one grazing the side of her head and opening a wicked gash, another deep into one thigh, a third driven into her wrist so that she could not close her hand, and a fourth sticking from her ribs. Cadderly could hardly believe that the elf was still standing, let alone firing her bow.\n He listened for the song of Deneir immediately, bringing forth magics that would allow him to begin the mending of Shayleigh\u0027s wounds. Shayleigh said nothing, just grimaced stoically as Cadderly slowly drew out the spikes. All the while, the elf maiden held fast to her bow, kept her gaze out to the wide winds in search of her missing friends.\n Minutes slipped past. Cadderly had the worst of the wounds closed, and Shayleigh signaled that to be enough for the time being. Cadderly didn\u0027t argue, turning his attention back to the search for Danica and Ivan.\n \"If the monster shakes free of them ...\" Shayleigh began ominously.\n \"Danica will not fall,\" Cadderly assured her. \"Not with the enchantment I have put upon her. Nor will she allow Ivan to fall\"\n There was honest conviction in the priest\u0027s tone, but he sighed with some relief anyway when the chimera finally came back into view, speeding on a course that would take it directly above the ledge. Shayleigh lifted her bow, but her injured wrist would no longer allow her to pull the string back fast enough. Cadderly got a shot with his crossbow, but the chimera banked and the explosive quarrel flew harmlessly wide.\n The monster roared in protest as it passed without any attacks, and the friends on the ledge could see that both its dragon and goat heads flopped lifelessly in the wind. Ivan, clutching the leonine mane, howled with enjoyment as he attempted to steer the beast by tugging one way or the other.\n \"Jump free!\" Danica cried to the dwarf as the mountain loomed before them. The young woman stepped off the creature as it passed the ledge, skipped down across the empty air (to Pikel\u0027s amazed cry of \"Oo oi!\" and Vander\u0027s incredulous stare) to join Cadderly and Shayleigh.\n \"Jump free!\" Danica yelled again, this time with Shayleigh and Cadderly joining in.\n The yellow-bearded dwarf didn\u0027t seem to hear them, and Danica prudently rushed back out from the ledge in case the beast headed out into the empty air once more. The chimera did bank against Ivan\u0027s stubborn pull and start back out, but this time, both Cadderly and Shayleigh were presented with perfect shots. Shayleigh\u0027s arrow dove deep into the chimera\u0027s torso, and Cadderly\u0027s quarrel got the beast on the wing, its explosive force shattering bone and sending the beast into a repeated barrel roll.\n Ivan tugged and yanked frantically, looking for some place to safely land as the creature flopped about, turning back toward the towering mountain.\n \"Jump!\" the companions pleaded with the dwarf.\n \"Snowbank!\" Ivan yelled in high hopes, twisting the monster\u0027s head in line with a white pile jutting above the smooth slope of the mountain, just a dozen or so feet above the ledge. \"Snowbank!\"\n Not quite - the inch of snow covering the jutting boulder did not, by any definition, constitute a snowbank.\n \"Boom,\" remarked a grimacing Pikel as the chimera and Ivan crashed heavily, the dwarf bouncing back, skidding and slipping until he came to a stop, amazingly on his feet on the ledge.\n The crushed chimera thrashed about near the rock until Shayleigh\u0027s next arrow sank into the leonine head, ending its agony.\n Ivan turned to regard Cadderly and the others, his pupils rolling about their sockets independently of each other. Somehow, Ivan still wore his deer-antlered helmet, and somehow, Shayleigh\u0027s splintered arrow had not been dislodged.\n \"Who knowed?\" Ivan asked innocently, giving a lame attempt at shrugging his shoulders as he fell facedown on the path.\n Test of Willpower\n Cadderly and Shayleigh broke immediately for the stunned dwarf, but Danica rushed back to the ledge, grabbed Cadderly and spun him about, her lips crushing against his as she kissed him hard. She backed off suddenly, her features twisted with admiration and appreciation - and ecstacy.\n Her breath came in excited gasps; her eyes darted wildly, from the open air beyond the ledge to her enchanted feet and to the man who had saved her life. \"I want to do it again!\" she blurted, fumbling over the words as though she couldn\u0027t help but say them,\n Cadderly seemed perplexed, until he realized that his love had just walked on air. What an incredible experience that must have been! He stared at Danica for a long moment Then, remembering Ivan\u0027s situation, he looked to Pikel, who was happily munching on his roasted mutton once more (apparently, Ivan was not too badly injured), and looked to the rock where Ivan and the chimera had abruptly ended their wild ride. All of this apparent insanity in the midst of a desperate plan, the success of which could well determine the very existence of the peoples of the region.\n And Danica\u0027s sparkling brown eyes, so full of admiration, told Cadderly something more. He was coming to the forefront of it all, inevitably taking up the lead in this crusade. He had grabbed at this responsibility - fully when he had bent Dean Thobicus\u0027s mind - but now, as the true weight of that responsibility became clearer to him, he was worried. Always before, Cadderly had depended on his powerful friends. He pointed the way, and they, through stealth and sword, facilitated the plans. Now, though, judging from the look in Danica\u0027s eyes, Cadderly\u0027s burden had increased. His mounting magical powers had become the group\u0027s primary weapon.\n Cadderly would not shy away from his new role, would fight on with all his heart and all his strength. But he wondered if he could live up to his friends\u0027 expectations, if he could continue to keep Danica\u0027s eyes sparkling.\n It was all too much for the burdened young priest What began as an embarrassed chuckle ended with Cadderly sitting on the stone ledge, laughing at the very edge of hysteria.\n The sight of Vander, up again and moving toward him, sobered Cadderly. Although Vander\u0027s brutal wounds had already somehow begun to mend, the giant\u0027s face showed his pain, and showed that Vander did not see anything humorous about their situation.\n *I told you that we were too high up,\" the firbolg said in a low, firm voice.\n Cadderly thought for a moment, then began to explain to the giant that, while the strange, animated snow creature might have been natural to the region, both the chimera and the other winged beast, the mutated manticore, were magical in nature and not denizens of the cold and desolate high peaks. Cadderly never finished the explanation, though, suddenly realizing the implications of his own thoughts.\n Magical creatures?\n What a fool I\u0027ve been! Cadderly thought, and to Vander and his friends he offered only a sudden, confused expression. The young priest closed his eyes and mentally probed the region, sought out the magical eye of the scrying wizard - for someone had certainly guided the two monsters! Almost immediately, he felt the connection, felt the directed line of magical energy that could only be the probing of a scrying wizard and promptly released a countering line to disperse it Then Cadderly threw up magical defenses, put a veil around himself and his friends that would not be easily penetrated by distant probing eyes.\n \"What is it?\" Danica demanded when he had at last reopened his gray eyes.\n Cadderly shook his head, then looked to Vander. \"Find a sheltered area where we might set a camp and mend our wounds,\" he instructed the firbolg. Danica was still staring at him, waiting for an explanation, but the young priest only offered another shake of his head, feeling positively foolish for not warding them all against scrying wizards much earlier in the journey.\n Again Cadderly wondered if he would disappoint those who had come to trust in him.\n The chimera and the manticore were Aballister\u0027s creatures, his children, brought into existence and nurtured to mighty maturity by the magics of the powerful wizard. When they fell in the mountains, Aballister sensed the loss, as though a part of his own energy had been stripped from him. He left his private quarters so abruptly that he didn\u0027t even bother to close his spellbook, or to put up wards against intruders. The old wizard bounded down the hall to Dorigen\u0027s room and pounded on the door, disrupting the woman\u0027s studying.\n \"Find them,\" Aballister snarled as soon as Dorigen opened the door, pushing his way in.\n \"What do you know?\" she asked.\n \"Find them!\" Aballister commanded again. He spun about and grabbed Dorigen by the hand, pulling her to the seat before her crystal ball.\n Dorigen tore her hand free of Aballister\u0027s grasp and eyed him dangerously.\n \"Find them!\" the older wizard growled at her for the third time, not retreating an inch from her threatening glare.\n Dorigen recognized the urgency in Aballister\u0027s wizened face, knew that he would not have come in here and treated her with such disrespect if he was not terribly afraid. She uncovered the crystal ball and stared into the item for a long while, concentrating on reestablishing the connection to Cadderly Several moments passed with the ball showing nothing but its swirling gray mist Dorigen pressed on, commanding the mist to form an image.\n The ball went perfectly black.\n Dorigen looked up to Aballister helplessly, and the older wizard pushed her aside and took her place. He went at the ball with all his magical strength, throwing his incredible willpower against the black barriers. Someone had warded against scrying. Aballister growled and threw more magical strength into the effort, almost punching through the black veil. The power of the defenses told him unmistakably who the defender might be.\n \"No!\" Aballister growled, and he went at the barrier again, determined to force his way through those wards.\n The ball remained inactive.\n \"Damn him!\" Aballister cried, slapping the crystal from its stand. Dorigen caught the solid ball as it rolled off the table\u0027s edge. She saw Aballister wince, though the wizard stubbornly did not grab at his already swelling hand.\n \"Your son is more formidable...\" Dorigen began, but Aballister cut her short with an animal-like growl. He leaped up from his seat and sent the stool bouncing away.\n \"My son is a troublesome insect,\" Aballister sneered, thinking of many ways that he might make Cadderly and his friends pay for the loss of the chimera and the manti-core. \"The next surprise that I will send to him will be a measure of my own powers.\"\n A shudder coursed along Dorigen\u0027s spine. She had never heard Aballister more determined. She was Aballister\u0027s student, had witnessed many powerful displays of magic from the older man - and had known that those were just a fraction of what he was capable of launching.\n \"Find them!\" Aballister growled again between sharp, hissing breaths, and, on as close an edge of uncontrollable rage as Dorigen had ever seen him, he swept from the room, slamming the door behind him.\n Dorigen nodded as though she meant to try, but as soon as she was convinced that Aballister would not immediately return, she replaced the ball in its support and draped a cloth over it. Cadderly had countered the magic, and the scrying device would not function for at least a day, Dorigen knew. In truth, she didn\u0027t expect to find any more success the next day, either, for Cadderly was apparently on to her secret prying now and would not likely let his guard slip again.\n Dorigen looked to the closed door and thought again that Aballister did not understand the power of his son. Nor the compassion, she realized as she clenched her still-mending hands and considered that, by Cadderly\u0027s mercy alone, she was still very much alive.\n But neither did Cadderly understand the power of his father. Dorigen was glad that Druzil, and not she, had been sent out near the young priest, for when Aballister struck out at Cadderly the next time, it seemed to Dorigen that mountains would be leveled.\n When Danica awakened, the glow of the fire was low, barely illuminating the nearest features of the wide cave the party had found. She heard the comforting snores of the dwarves, Ivan\u0027s grumbles complementing Pikel\u0027s whistles, and could feel that Shayleigh was soundly resting near the wall behind her.\n Vander, too, was asleep, propped against a stone on the other side of the low fire. The night was dark and calm, and the snow had ceased, though the lessened wind continued a quiet, steady moan at the wide cave door. By all appearances, the campsite seemed quite serene, but the monk\u0027s keen instincts told her that something was not as it should be.\n She propped herself up on her elbows and looked about A second glow showed in the cave, far to the side and partially blocked by Cadderiy\u0027s sitting form. Cadderly? Danica looked to the wide cave entrance, to where the young priest should have been standing a watch.\n She heard a slight rattle, and then some soft chanting. Silently, Danica slipped out of her bedroll and eased her way across the stone floor.\n Cadderly sat cross-legged before a lit candle, a parchment spread on the floor beside him, its ends anchored by small stones. Next to that was the young priesfs writing kit and the Tome of Universal Harmony, the holy book of Deneir, both opened. Danica crept closer, heard Cadderiy\u0027s low chanting, and saw the young priest drop some ivory counters to the floor in front of him.\n He marked something on the parchment, then tossed a fresh quill into the air before him, watching as it spun to the stone, then making a note of its direction. Danica had been around priests long enough to understand that her love was engaged in some sort of divination spell.\n Danica nearly jumped and cried aloud when she felt a hand on her back, but she kept her wits enough to take the moment to recognize Shayleigh moving up beside hf r. The elf looked curiously to Cadderly, then back to Danica, who only shook her head and held her hands up wide.\n Cadderly read something from the book, then fumbled with his pack and produced a small, gold-edged mirror and a pair of mismatched gloves, one black and one white.\n Danica\u0027s mouth dropped open. Cadderly had brought the Ghearufu, the evil three-piece artifact that the assassin had carried, the same powerful item that Dean Thobicus had insisted be turned over for inspection!\n The significance of the Ghearufu sent a myriad of questions hurtling through Danica\u0027s thoughts. From what she had seen, and from what Cadderly had told her, this was an item of possession - might Cadderiy\u0027s strange behavior, his hysterical laughter on the ledge, and his insistence that the group remain dangerously high in the mountains, be somehow linked to the Ghearufitf Was Cadderly himself fighting against some sort of possession, some evil entity that clouded his judgment while leading them all astray?\n Shayleigh again put a hand on Danica\u0027s back and looked to the monk with concern, but a movement to the side distracted them both.\n Vander crossed the floor in three easy strides, grabbed Cadderly by the back of his tunic, and lifted the young priest from the floor.\n \"What are you about?\" the firbolg demanded loudly. \"Do you stand your watch from inside... ?\" The words caught in Vander\u0027s throat; the blood drained from his ruddy face. There before him lay the Ghearufu, the evil device that had held him as a slave for many tragic years.\n Danica and Shayleigh rushed over to them, Danica fearing that Vander, in his surprise and horror, might hurl Cadderly across the cave.\n \"What are you about3\" Danica agreed with Vander, but as she spoke, she crossed in front of the firbolg and strategically placed her thumb against a pressure point in Vander\u0027s forearm, quietly forcing the giant to release his grip.\n Cadderly scowled and straightened his tunic, then went to gather his possessions. At first, he seemed embarrassed, but then, when he looked back to Danica\u0027s resolute stare, he steeled his gray eyes resolutely.\n \"You should not have brought that,\" Danica said to him.\n Cadderly did not immediately respond, though his thoughts were screaming that the Gkearu/u was the main reason that they were there.\n The other three exchanged worried glances.\n \"We have come for Castle Trinity,\" Danica argued.\n That is but one reason,\" Cadderly replied cryptically. He wasn\u0027t sure whether he should tell them the truth or not, wasn\u0027t sure that he wanted to compel them to accompany him to the terrible place where the Gkearu/u could be destroyed.\n Danica felt Vander\u0027s muscles tighten, and she leaned back more firmly against the firbolg to prevent him from leaping out and throttling the young priest\n \"Do you always keep such important secrets from those who travel beside you?\" Shayleigh asked. \"Or do you believe that trust is not an essential element of any adventuring party?\"\n \"I would have told you!\" Cadderly snapped at her.\n \"When?\" Danica growled at him from the other side. He looked back between the two, and to Vander\u0027s outraged expression, and seemed to be losing his nerve.\n \"Has the Ghearufu found a hold on you?\" Danica asked bluntly.\n \"No!\" Cadderly shot back at once. \"Though it has tried. You cannot imagine the depth of evil within this artifact*\n Vander cleared his throat, a pointed reminder that the firbolg had felt the Ghearufu\u0027s sting long before Cadderly even knew that the item existed.\n Then what use might it be?\" Shayleigh snarled.\n Cadderly bit his lower Up, glancing one way and the other. He suspected that his companions would not agree with his priorities, would still consider Castle Trinity the most important of their missions. Again doubts about being in the forefront assaulted the young priest He told himself that he owed his friends an explanation at least\n But that was just a rationalization, Cadderly knew. He wanted to tell his friends, wanted them to line up beside him on this most dangerous of duties.\n \"We have come out in search of Castle Trinity,\" he explained, his conscience gnawing over every word. \"But that is only one purpose. I have done much searching and have discerned that there are few - very few - ways in which the Ghearufu might be truly destroyed.\"\n This could not have waited?\" Danica asked.\n \"No!\" Cadderly retorted angrily. At his suddenly explosive tone, the three doubters again exchanged concerned glances, and Danica virtually snarled as she regarded the Ghearufu.\n \"KI had left the Ghearufu at the library, we cannot even guess die extent of the disaster we would have found upon our return,\" Cadderly explained, his voice even once more. \"And if we take it with us all the way to Castle Trinity, our enemies might find a way to use it against us.\" He, too, looked down at the item, his face flushed with fear.\n \"But it wil! not get to that dangerous point,\" the young priest insisted. \"There is a way to end the threat of the Ghearufu forever. That is why we took the high trails,\" he explained, eyeing Vander directly. There is a peak near here, somewhat legendary in the region.\"\n \"Fyrentennimar?\" Danica balked, and Shayleigh, recognizing the dreaded name, gave an unintentional wheeze. \n","sourceLink":"https://allnovel.net/the-cleric-quintet-the-fallen-fortress-the-cleric-quintet-4/page-5.html","bookId":2110,"book":{"id":2110,"title":"The Cleric Quintet: The Fallen Fortress (The Cleric Quintet #4)","description":"Storyline: \n The war rages on. Cadderly, scholar-priest of the Edificant Library, leads the combined forces of Caradoon and Shilmista forest against Castle Trinity, stronghold of his enemy Aballister. But another mission calls him on a journey leading into the past. A past he would just as soon forget. In this fourth book of \"The Cleric Quintet\", Cadderly leads the combined forces of Caradoon and Shilmista Forest against the Castle Trinity, stronghold of his enemy Alabaster. But another, smaller mission calls him on a journey into the past--a past he\u0027d just as soon forget.\n \n","cover":"https://allnovel.net/images/the-cleric-quintet-the-fallen-fortress-the-cleric-quintet-4.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-cleric-quintet-the-fallen-fortress-the-cleric-quintet-4.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 5:52:13 PM"}}
