{"id":72887,"no":27,"title":"Page 27","content":"Getting off his lap, Jamie stood and held out her hand to Rich. His smoky, passion-hazed eyes met hers, his gaze questioning.\\n\\n “You’re sure?” he asked her again, his words hoarse with need, his eyes hot with passion and some other emotion she couldn’t quite read. Restraint? Doubt? Jamie didn’t know which.\\n\\n “I’m sure.”\\n\\n “You’re already pregnant.”\\n\\n Why he felt he had to remind her of that was beyond her. “Yes, I know.” As she was speaking, her hands were unfastening the buttons on his shirt. Rich helped her by pulling his tie loose and dropping it to the carpet. Jamie slid the shirt from his shoulders, then ran her hands down the full length of his arms.\\n\\n His chest captured her attention next. His warm, muscular, chest. She ran her flattened hands over it, marveling at the strength she sensed in him. She closed her eyes, wanting him so badly she felt weak with the need.\\n\\n “You make me crazy,” he whispered.\\n\\n “I do?” It made no sense to Jamie. “Yes. I want you so much you make me ache.”\\n\\n “I know…. Me, too.”\\n\\n Rich groaned and took her, in his arms, lifting her against him until she became profoundly aware of his arousal.\\n\\n For one wild second it was as though the world stood still for them. Rich’s blue eyes appeared aquamarine in the dim light. Bright, intense, filled with promises.\\n\\n Jamie felt completely vulnerable to him. Vulnerable and desirable, more desirable than she’d ever felt in her life. She smiled and moved away from him.\\n\\n Rich looked confused, but he released her.\\n\\n Jamie turned and had gone two steps before she turned around again. A smile quivered at the edges of her mouth. “You coming with me?”\\n\\n “Where are you going?”\\n\\n She laughed softly, sexily, and held out her hand to him. “You mean you don’t know?”\\n\\n Thirteen\\n\\n Rich woke in the middle of the night. It took him only seconds to realize he was in bed with Jamie. For the next few minutes he did nothing more than watch his wife as she slept. He drank in every delicate nuance of her beauty. He stared at her as if they’d been separated for months, years, when she’d actually spent the night in his arms.\\n\\n Gradually his gaze lowered to her lips, parted slightly, her breathing slow and even. She had the most delectable mouth….\\n\\n Desire came at him unexpectedly. Memories of the gentle way Jamie had led him to her bed suffused him like a mist. She’d held her arms out to him, until the ache of wanting her, needing her, dissolved any will he had to refuse her.\\n\\n She’d freely opened her heart and her body to him. When she’d cried out in pleasure at her completion, the sound of her joy had echoed in his very soul. The sheer, utter beauty of their lovemaking had marked him in ways he was only beginning to understand.\\n\\n Jamie stirred and rolled her head to one side. Her hair spilled across her face, and after a moment, Rich risked waking her by gently brushing it aside. His breathing was fast, much too fast considering the simplicity of the gesture.\\n\\n He leaned forward, intending to kiss her. The way he was feeling, with need clawing at his insides, he knew if he followed through with his intention, the kiss would be too intense, too powerful. By an act of will, he stopped himself just in time.\\n\\n He’d made love to her only hours before and already he was wondering how long it would be before he could do so again.\\n\\n He had to think. Pull himself together. Make some sense of this nagging physical ache, this overwhelming need, before he woke Jamie and frightened her. Folding back the covers, he sat on the side of the bed, rubbing his face.\\n\\n “Rich.”\\n\\n The panic he heard in Jamie’s voice made him turn around.\\n\\n “Don’t leave me,” she pleaded. “Not again.”\\n\\n “I wasn’t going to.” He slipped back into the bed and gathered her in his arms. She felt so soft against him. Holding her, he wished he could stay like this forever.\\n\\n “Don’t go,” she repeated, almost deliriously, clinging to him.\\n\\n “I can’t.” Even if he’d wanted to, Rich could never have walked away from her. He was so much in love with her, so driven by need…and desire.\\n\\n He kissed her, hoping to reassure her, but the kiss was everything he’d feared. And wanted. His mouth was hard and demanding, as his hands investigated her warm, perfect skin.\\n\\n “Jamie…” He slid his mouth down the perfume-scented curve of her neck, down her shoulder to the peaked softness of her breast.\\n\\n Jamie moaned softly and arched her back, encouraging him, plowing her fingers through his hair, thrashing beneath him.\\n\\n He lifted his head and kissed her mouth. “I need you…again,” he whispered.\\n\\n Their need for each other was as urgent as their kisses. A strangled cry slipped from her throat as she clutched at his back.\\n\\n Rich jerked his mouth from hers. “I’m scaring you?” He was afraid he had, or worse, that he was hurting her.\\n\\n “No…no, love me, just love me.”\\n\\n “Yes. Oh, yes.”\\n\\n Rich intended to do a lot more than simply fulfill their bodies’ hunger. But for now, his need was too great to take it slow. Or easy. Ruthless desire dictated his actions.\\n\\n She lay there, eager and trusting, vulnerable to him. Her dark hair fanned about her shoulders. Her sweet face was flushed with excitement, her eyes wide and misty with an emotion too strong to voice. Her lips were parted and moist from his kisses, and her breath came in tiny gasps of encouragement.\\n\\n “Jamie…love. My love.”\\n\\n Rich couldn’t resist her a second longer. Not another second.\\n\\n The alarm sounded while it was still dark. Jamie rolled onto her side and reached blindly for the clock radio, shutting off the irritating noise.\\n\\n Rich moved toward her, cradling her, placing his arm around her middle. “Good morning,” he whispered. With familiarity, his hand cupped her breast. Although they’d spent much of the night making love, Jamie was astonished by her body’s ready response to his touch.\\n\\n “Morning.” Jamie couldn’t help feeling a little shy after the tempestuous night they’d spent. Memories of their lovemaking filled her mind—the brazen way she’d led him into her bedroom, stripped for him, stripped him, sent a surge of color into her cheeks.\\n\\n “How are you feeling this morning?” Rich asked, his mouth close to her ear. He caught her lobe between his teeth and sucked gently, shooting warm shivers down Jamie’s spine.\\n\\n “I’m…fine.”\\n\\n “Do you want me to bring you some crackers?”\\n\\n Jamie hadn’t immediately realized he was asking about the baby, the pregnancy. “Not…yet.” She eased back the covers and cautiously righted herself. When she did suffer bouts of nausea, it was generally when she first sat up. With her legs dangling over the bed, she inhaled a deep breath and was relieved to discover she didn’t feel queasy at all.\\n\\n “Do you want to shower first?” Rich asked from behind her, his hands at her waist.\\n\\n “Please.” She had trouble looking at him. It was silly to be so nervous, she told herself. They were married, for heaven’s sake. Married. There was no reason to feel uncomfortable or ill at ease. Rich was her husband, and he had a perfect right to spend the night with her.\\n\\n Jamie moved into her bathroom and turned on the shower, adjusting its temperature. It wasn’t until she was under the pulsing spray that she remembered.\\n\\n The scene replayed itself, its effect as brutal as a slap across the face.\\n\\n Rich had been about to leave her again, sneaking out in the middle of the night. If she hadn’t half wakened when she did, he would’ve walked out on her a second time. Once again he’d planned to leave her, to let her face the empty morning alone. Except that this time she’d pleaded with him to stay.\\n\\n Jamie didn’t know how long she stood under the spray. Long enough to regulate her breathing and wait for the pain that rippled through her to subside.\\n\\n When she finished, she forced a smile and walked nonchalantly back into the bedroom, a white towel around her. “Your turn,” she told him, not meeting his eyes.\\n\\n Rich had made coffee and brought her a mug, as well as a small plate with four soda crackers. “Breakfast is served,” he said, bowing before her.\\n\\n Jamie drank some of her coffee, careful to keep the towel securely in place with one hand. It was ludicrous to act modest after what they’d shared. The things they’d said. The things they’d done. Beautiful things…\\n\\n Nevertheless she was.\\n\\n Rich frowned, then left her. Although the bathroom door was shut, Jamie heard him singing at the top of his lungs over the sound of the shower. She took advantage of the brief privacy to get dressed, haphazardly choosing her outfit for the day.\\n\\n She made the bed, folded Rich’s scattered clothes and laid them on top, then hurriedly moved into the kitchen. Generally she didn’t pack a lunch for work, but she did this morning, just to pass the time. If there was anything to be grateful for, it was that Rich hadn’t called her darling. He’d only done that in the presence of others, for the sake of the pretense they had to maintain in front of their parents.\\n\\n She was putting together a sandwich when Rich joined her. He poured himself a second cup of coffee. Jamie concentrated on making her turkey sandwich and managed to avoid eye contact.\\n\\n She turned around to get an apple from the refrigerator and stopped short of colliding with Rich. “Oh, sorry,” she mumbled under her breath, flattening herself against the counter so he could step past her.\\n\\n “Would you like some breakfast?” she asked matter-of-factly, as though she often made the same inquiry of men who spent the night with her.\\n\\n “Just coffee, thanks.”\\n\\n Jamie sighed with relief. The intimacy of cooking a meal for him would’ve been a strain. She made a point of glancing at her watch. “I guess I’d better head out to the salt mines,” she said, striving to sound carefree and happy when all the while there was a lump in her throat that made it hard to speak.\\n\\n “Me, too.” Rich’s voice was low and hesitant, as if he wasn’t quite sure what was happening, but whatever it was, he didn’t like it.\\n\\n Jamie didn’t, either, but she didn’t know what to do about it.\\n\\n She was halfway out of the kitchen when Rich stopped her.\\n\\n “I’ll have to leave with you.”\\n\\n “Why?” She was eager to escape, to be by herself, examine her thoughts and reactions, analyze their relationship.\\n\\n His smile didn’t quite reach his eyes. “I don’t have a key to lock up with.”\\n\\n “Oh, right.” She opened the closet and pulled out her coat.\\n\\n “If I’m going to move in with you, we should have an extra one made.”\\n\\n “Move in with me…” She’d suggested it when they’d met with Rich’s family. It had seemed like a good idea at the time, and she’d been so eager to find a way to make her marriage work.\\n\\n “I take it you’ve changed your mind?”\\n\\n “No,” she said hastily. “I …just think we should reevaluate the situation before we do something we might regret later.” \\n\\n","sourceLink":"https://allnovel.net/marriage-of-inconvenience-those-manning-men-1/page-27.html","bookId":1981,"book":{"id":1981,"title":"Marriage of Inconvenience (Those Manning Men #1)","description":"Storyline: Marriage of Inconvenience (Those Manning Men #1) \\n Rich Manning had known Jamie Warren forever. And he loved her--strictly as a friend. But all that changed the day Jamie asked him to be the father of her as-yet-unconceived child! Rich agreed on one condition: they marry. \\n Suddenly, Rich was discovering a side of Jamie he\u0027d never seen before, and was swept away by a passion sweeter than anything he\u0027d ever known ... a passion that stunned his senses. But could he prove to the headstrong Mrs. Manning that it was time to let the world in on their secret--that their love was truly here to stay?\\n","cover":"https://allnovel.net/images/marriage-of-inconvenience-those-manning-men-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/marriage-of-inconvenience-those-manning-men-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:35 AM"}}
