{"id":72864,"no":4,"title":"Page 4","content":"“That’s downright insulting.” “I don’t mean it to be.” She stood up to get two plates. “You’re having dinner with me, right?” He nodded. “I’m not going to lie to you and claim Tony had nothing to do with this,” she went on. “He hurt me, and it took me weeks to work through the pain. As strange as it may seem, I’m actually grateful for what Tony taught me. He helped me reach some sound, honest decisions about my life.” “If this no-dating stand of yours is one of them, then I’d do some rethinking if I were you.” Rich opened the silverware drawer and took out two knives and forks. Without glancing at the adoption papers, he placed them to one side and had the table set by the time she brought over their plates. Jamie couldn’t help being pleased that he’d agreed to join her for dinner. “My biggest, and probably most significant realization,” she said while smoothing the napkin across her lap, “was that I like my life the way it is. I don’t need a man to feel complete.” Several minutes passed before Rich spoke. “That sounds healthy, but to lock the door on any chance of a relationship—” “I’m not locking the door,” she interrupted, eager to correct that impression. “I’m just not looking for one. I’ve wasted years trying to fulfill my dream of being married and raising children.” Rich took a bite of the chicken potpie and raised his eyebrows. “Hey, this is great.” “Thank you.” She tried it herself and was satisfied with her culinary efforts. Taking the time to cook real meals instead of throwing together a sandwich or resorting to frozen entrées had been another decision she’d reached. It might seem silly, but cooking gave her a feeling of permanence and purpose. She was doing something healthy for herself, and she felt good about it. “Everything you’ve said makes sense,” Rich admitted reluctantly. “Don’t sound so shocked.” “It’s just that I’ve always pictured you with kids.…” “I’ve got that covered,” she said enthusiastically, removing the top sheet of the papers Rich had stacked on the other side of the table. “I intend to adopt.” “I know they let single people adopt children now,” he said, “but two-parent families are better for kids.” “Ideally, yes,” Jamie agreed. “But sometimes there’s no alternative. Anyway, from what I’ve read, I don’t think it’s going to be easy or anytime soon, especially if I want a newborn.” “Which you do?” Jamie nodded. If she was only going to be a mother once, then she wanted as much of the experience as she could have, including midnight feedings, teething and changing diapers. “I have an appointment with a counselor at an adoption agency tomorrow afternoon. I haven’t been this excited about anything in years.” “I’ll bet you haven’t told your mother.” Jamie rolled her eyes at the thought. “It’s better if I don’t say anything, at least for now. Mom’s wonderful, but she’d never understand this.” Rich chuckled, but as the laughter drained from his features, his eyes took on a faraway look. “You know what?” “What?” she asked softly. “I’ve basically come to the same conclusion about dating. I’m sick to death of the games and women whose only interest is getting me in the sack. I never knew women could be so aggressive.” Intrigued, Jamie could only nod. She would never have believed Rich was experiencing the same difficulties she had. For years she’d been expecting him to marry, but she’d never felt comfortable enough to ask why he hadn’t. “I’ve spent ten years looking for a woman who believes love lasts longer than an hour,” he added grimly. “As for commitment and honesty, I don’t think they exist anymore. Or if they do, then I can’t seem to find anyone who believes in them. After Pamela cheated on me I realized I’m a self-reliant adult—and if I never married, it wouldn’t make my life any less worthwhile.” “That’s how I feel,” Jamie said. “I just never thought that—” “I did, too,” he finished for her. “Exactly.” They exchanged a look—a look wrought with understanding and empathy. They’d been friends for years and Jamie had never known how much they actually had in common. “I had no idea it was happening to you, too,” she whispered. She felt as though she was deprived of oxygen. Everything in the kitchen seemed to fade from view. Everything except Rich. If anything, his dark good looks came into sharper focus. As she had a thousand times before, Jamie acknowledged how very handsome Rich Manning was. But there was much more there, more than she’d ever noticed. This was a man of character and strength. A man of substance. He looked older; the years had marked their passage. There were wrinkles on his forehead and shadows beneath his eyes. The well-defined angles of his cheeks as well as the lines bracketing his mouth only made his face more masculine, more appealing. The silence between them stretched to embarrassing lengths. It was Jamie who pulled her eyes away first. With a weak smile, she picked up her fork and managed to swallow a bite of her dinner. “This turned out well, didn’t it?” she said in a casual voice. “Excellent.” He seemed equally intent on putting their conversation back on an even keel. He attacked his dinner as though he’d entered a speed-eating competition. They chatted for several more minutes, teased each other, exchanged the banter that was so familiar to them. Rich insisted on helping her clean up, but as soon as the last dish was put away, he made his excuses and left. Jamie felt weak afterward. As weak and trembly as the first time she’d stood on the high dive. The feeling wasn’t any more comfortable now than it had been all those years ago. Hard though he tried over the next few days, Rich couldn’t forget the look he’d shared with Jamie at her kitchen table on Tuesday evening. He’d tried to define it, decipher its meaning. It was the kind of look longtime lovers exchanged. The kind he’d witnessed between Taylor and Russ, as though they didn’t need words to say what was in their hearts. But he and Jamie had never been lovers. To the best of his knowledge, they’d never even kissed. Really kissed. A peck on the cheek now and then. A friendly hug, perhaps. That was it. Their relationship had always been strictly platonic. It was the way they’d both wanted it. Anything else would have destroyed the special closeness they shared. Rich shook his head in an effort to banish the disturbing thoughts that had taken up residence there. Until Tuesday, he’d seen Jamie as ordinary. Not anymore. Still, nothing had changed, not really. At least nothing he could put his finger on. Jamie Warren was the same person she’d always been. Not so, he corrected. Her eyes had been different. To think he’d once believed her eyes were an average shade of brown. He’d never seen eyes the precise color of Jamie’s. They were a blend of green and brown; some would call it hazel, he supposed. That night they’d been more green, reminiscent of the mist rising off a moss-covered forest floor.… But it wasn’t her eyes that had intrigued him. It was something more profound than that. Something more baffling, too. His musing was interrupted by the phone. Rich grabbed the television remote and muted the volume. He didn’t know why he’d bothered to turn it on—from habit, he guessed. For the past hour he hadn’t heard a single word of the local or national news. He’d been too busy analyzing what had happened between him and Jamie. “Hello,” he answered briskly. Pamela sometimes phoned him, and he braced himself in case it was her. “Hi,” came the soft feminine voice he recognized immediately as Jamie’s. “Hi, yourself.” He felt a bit ill at ease, which he’d never experienced with her. It was as though they hadn’t found their stride with each other yet, which made no sense. Perhaps he was taking his cue from Jamie. She didn’t sound quite like herself; she sounded tense, as if it had taken some courage to call him. “I was just thinking about you.” He probably shouldn’t have admitted that, but it had slipped out. “Oh?” “Yeah, I was going to give you a call later and find out how the appointment with the adoption agency went.” She paused, and he heard her take a deep breath. “Actually, that’s the reason I’m calling you. Are you busy?” “Not really. What do you have in mind?” “Would it be all right if I came by for a few minutes? There’s something I need to talk over with you.” “Sure, you’re welcome anytime.” He glanced around the apartment to see what kind of shape it was in. Not bad. Not especially good, either, but he’d have time to pick up the newspapers and straighten the cushions. As it turned out, he had time to wipe down the kitchen counter, as well, and stick his dirty dishes in the dishwasher. The best meal he’d had in weeks had been the chicken potpie at Jamie’s place. He didn’t remember her being such an accomplished cook. She certainly seemed full of surprises lately. Jamie arrived about ten minutes after her phone call. She wore jeans and the same pink sweater she’d had on the night they went to the movies. He was about to tell her how nice she looked, but stopped himself. Curiously, his heart stopped, too. Just a little. “That didn’t take long,” he said instead. “No… But we only live four or five miles from each other.” “Yeah.” He led the way to the sofa and sat down, resting one ankle on the opposite knee and draping his arm along the back. “So, what’s up?” Jamie sat down, too, but he noticed that she sat on the very edge of the cushion and rubbed her hands nervously down her arms. He wondered if she was cold. That prompted him to say, “Would you like a cup of coffee?” “Please,” she said eagerly. Rich couldn’t shake the impression that she was interested in the coffee more as a delaying tactic than out of any real desire for something to warm her. He made a pot of coffee, and a few minutes later, brought two steaming mugs into the living room. He had to look around for coasters, but once he found them, he sat down on the recliner across from her and resumed his relaxed pose. “How’d the appointment with the adoption agency go?” he asked, when she didn’t immediately launch into her reason for the visit. She hadn’t really answered his question earlier. Her hands cradled the mug and she stared into its depths. “Not very well, I’m afraid. Naturally, the agency prefers to place newborns with established families. Besides, the waiting list is years long, and I don’t feel I have all that time to wait.” “I’m sorry to hear it.” Rich could feel her disappointment. “If I’m going to have a child, I want to be young enough to enjoy her.”","sourceLink":"https://allnovel.net/marriage-of-inconvenience-those-manning-men-1/page-4.html","bookId":1981,"book":{"id":1981,"title":"Marriage of Inconvenience (Those Manning Men #1)","description":"Storyline: Marriage of Inconvenience (Those Manning Men #1) Rich Manning had known Jamie Warren forever. And he loved her--strictly as a friend. But all that changed the day Jamie asked him to be the father of her as-yet-unconceived child! Rich agreed on one condition: they marry. Suddenly, Rich was discovering a side of Jamie he\u0027d never seen before, and was swept away by a passion sweeter than anything he\u0027d ever known ... a passion that stunned his senses. But could he prove to the headstrong Mrs. Manning that it was time to let the world in on their secret--that their love was truly here to stay?","cover":"https://allnovel.net/images/marriage-of-inconvenience-those-manning-men-1.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/marriage-of-inconvenience-those-manning-men-1.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:35 AM"}}
