{"id":60762,"no":1006,"title":"Chapter 1004 - Blood Decapitation Guard","content":"This was a seemingly boundless green mountain range. Verdant and luscious greenery covered the vast ground below while giant and tall mountains stood tall just like giants. Occasionally, ear splitting beast roars could be heard. It was a place that was brimming with life.\\n\\n Bang!\\n\\n A loud sound suddenly rang out within this peaceful and vast domain as a giant opening that seemingly split the sky appeared. Countless light figures rained down just like a storm and landed on the vast and boundless green mountain range. These uninvited guests caused the originally peaceful and tranquil mirror domain to flare and churn immediately...\\n\\n Whoosh!\\n\\n At a certain spot in this vast land, two light figures flashed and appeared. From their appearances, they were Lin Dong and Mu Lingshan.\\n\\n Once the two of them appeared, their eyes continuously scanned their surrounding with curiosity. Following which, an astounded expression appeared within Lin Dong’s eyes as he said with a smile, “I never thought that the Flame Divine Hall would also have a Pure Yuan Treasure that contains its own spatial realm…”\\n\\n This so-called Immeasurable Mirror was clearly similar to his Burning Sky Cauldron. Both of them had naturally formed spaces within them. The only difference was that the space within the former was filled with life and vitality, while the latter was a scarlet red earth, akin to a desert.\\n\\n “There are so many people…” Raising her head, Mu Lingshan opened her eyes wide to look at the countless light figures in the sky, appearing akin to a gorgeous fireworks display, before speaking out rather excitedly.\\n\\n “True, there is plenty of them...” Lin Dong replied with a smile. Raising his hand, a light seal appeared on his palm. That was something that automatically appeared after he entered the Immeasurable Mirror. Generally speaking, if one were to meet with danger in this place, as long as one shattered the light seal in one’s hand, one would automatically be transferred out of the Immeasurable Mirror. Naturally, if that occurred, one would also forfeit one’s qualifications to vie for the Thunderbolt Ancestral Symbol.\\n\\n Not long after they landed, other light figures continuously descended in their surrounding vicinity. In the next moment, after shooting a vigilant gaze at Lin Dong and Mu Lingshan, without further ado, their bodies flashed as they rushed towards the boundless green mountain.\\n\\n “Let’s make a move too.”\\n\\n Lin Dong spoke out with a smile. He was able to feel that the Yuan Power in this world had begun to churn restlessly as countless experts flooded into this space. Clearly, there were quite a few fights erupting here. Ultimately, there was only one Thunderbolt Ancestral Symbol. This meant that the final victor could only be a single person. Therefore… the absolute majority of participants were competitors.\\n\\n “Let’s go.”\\n\\n Lin Dong said with a low roar, his body transforming into a green streak of light and shooting out. Behind him, a petite little figure rapidly followed suit. In the next moment, the two of them had rushed into an extensive primitive forest and headed towards the centre of this space. That was also where Immeasurable Mountain was situated, the location of the final battlefield.\\n\\n As experts rushed within this space like a swarm of locusts, the atmosphere with clearly turned extremely fiery and explosive. Countless large and small scale fights erupted simultaneously. Instantly, the smell of explosives seemed to flood the air within the space.\\n\\n Furthermore, besides those intruders, there were also quite a few tyrannical demonic beasts in this area. Therefore, not only does one have to contend with other competitors, they had to be wary against those violent demonic beasts hiding within the boundless green mountain...\\n\\n Lin Dong and Mu Lingshan rapidly travelled through the forest pervaded with boundless aura. Along the way, they witnessed more than a hundred battles taking place. Nonetheless, the two of them did not stop. After all, they had to reach Immeasurable Mountain in the quickest time possible, and capture the so-called mountain peak seal in order to gain the qualifications to climb Immeasurable Mountain.\\n\\n Along the way, although they occasional met some ignorant fools who would obstruct them, the majority of the time, Lin Dong didn’t have to make a move. Brandishing her massive black coffin lid with excitement, Mu Lingshan would smack those unlucky fellows out of this mirror space...\\n\\n However, as they gradually headed deeper within the space, Lin Dong started to sense that the surrounding auras were getting increasingly stronger. Clearly, those who were able to enter this region were no ordinary individuals...\\n\\n Thump.\\n\\n As the tip of Lin Dong’s foot tapped on a thick tree branch, his body shot through the air akin to an arrow. In the next instant, his eyes faintly narrowed as he looked towards the sky through the small gaps between the foliage. Right now, Tang Xinlian and the rest should also be heading towards Immeasurable Mountain at an astonishing speed. Exactly who amongst them would be fastest...\\n\\n “Be careful, big brother Lin Dong!”\\n\\n Just as Lin Dong had raised his head to look towards the sky, Mu Lingshan’s expression suddenly changed. In the next instant, tapping the tip of her foot on a big and solid tree, her petite figure shot forwards. Brandishing her coffin lid, she swung out violently, sending a black light wave sweeping out.\\n\\n Whoosh Whoosh!\\n\\n At the very instant the light wave swept out, dozens of fierce chilling gales shot out from within the dense forest. As they smashed against the light wave, a violent storm instant brewed as it expanded, destroying the giant trees in the vicinity as it scattered out.\\n\\n Swish.\\n\\n After the surrounding giant trees shattered and collapsed, a number of spectre-like figures appeared in a flash. Subsequently, they cast gazes filled with ill intent towards Lin Dong and Mu Lingshan.\\n\\n Standing on top of a giant tree, Lin Dong casted his slightly narrowed eyes towards the six people that had appeared, They had unique appearances, with blood red robes covering their bodies. Furthermore, they were all wielding large scarlet sawtoothed cleavers. The body of the cleavers were exceeding slender while being three metres long, appearing extremely eye catching.\\n\\n Furthermore, what really surprised Lin Dong the most, was the auras radiating from the six of them. In fact, the six of them had unexpectedly reached the gateway to Profound Death stage. There were even faint amounts of Death Qi circling their bodies.\\n\\n “Hehe. Never would I have imagined that we would catch such a big fish. Isn’t he the new person that recently entered the rookie list...” Among the six people, a slender faced male cast a sinister gaze towards Lin Dong while speaking with a strange cackle.\\n\\n “You guys… are the Blood Decapitation Guard?” looking at the six people, Lin Dong spoke out while he gently furrowed his brows.\\n\\n “Looks like we brothers aren’t so obscure to the point of getting ignored.” A man grinned while speaking out, showing a smile brimming with extreme bloodthirst.\\n\\n The Blood Decapitation Guard was a small group of people that had an ominous reputation in the Chaotic Demon Sea. This group consisted of six members, with all of them being ranked from eighteenth place, all to way to twelfth place on the rookie list… Naturally, if they only possessed strength of such level, Lin Dong wouldn’t care about them. However, this group had joined forces and killed the then eighth place expert on the rookie list half a year ago, causing a sensation throughout the Chaotic Demon Sea.\\n\\n On an individual basis, they were not overtly powerful. However, whenever they made a move, regardless of whether they were dealing with a weak or strong opponent, they would collaborate and fight together. Hence, their combined combat strength would seemingly amplify their individual strength several times. If this combined combat strength could be ranked on the rookie list, they would definitely possess the qualifications to break into the top ten rankings, with the possibility of even achieving a top half placing.\\n\\n Therefore when Lin Dong saw this extremely powerful group with an ominous reputation, surprise rose involuntarily from his heart.\\n\\n “So, would the two of you prefer to shatter your spiritual seals by yourself, or leave your heads behind?” The man with a thin and withered face slowly hoisted the large beheading cleaver up, before pointing it at Lin Dong and Mu Lingshan as he spoke out.\\n\\n The reason why they were known as the Blood Decapitation Guard was because any opponent who faced them, would eventually have their heads chopped off. This was also their habit...\\n\\n Lin Dong wore a faint smile on his face, while fierce intent gradually erupted out from the depths of his eyes. With a clench of his hand, the Lightning Emperor Scepter, sparking with lightning bolts, appeared in a flash, causing low and deep cracks of thunder to resound out.\\n\\n “Lingshan, let’s end this fight quickly.”\\n\\n Grasping the Lightning Emperor Scepter in his hand, Lin Dong’s expression instantly turned frosty, as imposing killing intent radiated from him.\\n\\n ……\\n\\n Fiery Flame City.\\n\\n As countless people poured into the Immeasurable Mirror, the myriad mirror faces in the sky started to split up, before forming approximately ten thousand light mirrors of all sizes. Projected within those light mirrors, were the various fights taking place within the boundless space.\\n\\n “Ehh, that’s the Blood Decapitation Guard…”\\n\\n “The person in front of them is… the new rookie, Lin Dong?”\\n\\n “Tch, this is interesting. I never thought that those violent fellows would bump into each other so early into the competition…”\\n\\n “The Blood Decapitation Guard aren’t easy to deal with. However, Lin Dong is no ordinary individual too. If they were to fight, we’ll have a good show to watch.”\\n\\n Clamouring noises suddenly rang across the sky as quite a few gazes turned towards a large piece of light mirror. In the next instant, they saw that Lin Dong was currently confronting the Blood Decapitation Guard within a forest…\\n\\n Within a building, Gu Mengqi and the other two girls had also sensed the commotion happening. Promptly, their beautiful eyes begun to contract slightly, before worry and concern flashed within. They had also heard of the infamous Blood Decapitation Guard.\\n\\n Looks like Lin Dong and Mu Lingshan are quite unlucky. They had bumped into such fearsome individuals barely after entering the Immeasurable Mirror.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1004","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
