{"id":60896,"no":1140,"title":"Chapter 1138: The Stronger One","content":"Chapter 1138: The Stronger One\\n\\n When Hao Jiuyou walked into the arena, many surrounding pairs of eyes gathered and focused their attention on him. Back then, Little Marten was undoubtedly the most dazzling figure amongst his generation. At that time, Hao Jiuyou was merely a timid youth who followed behind him. Hence, no one expected that a hundred years later, this once unassuming young man, would become the greatest competitor to Little Marten for the position of tribe leader successor.\\n\\n “Haha, big brother Ah Diao. We have not met for a hundred years. I will be seeking pointers from you today.” Hao Jiuyou cupped his hands towards Little Marten and smilingly said.\\n\\n “You have seriously changed.”\\n\\n Little Marten took a glance at Hao Jiuyou. Back then, this once quiet young man with low self-esteem, who had even trembled when he first stood in front of him, had undergone a complete transformation.\\n\\n “Big brother Ah Diao has always been a target that I wish to surpass. If I don’t change, I’m afraid that I will never be able to do so.” Hao Jiuyou smiled. His eyes stared intently at Little Marten. Perhaps it was because of the angle, but Little Marten could see a ferocious expression from his smile.\\n\\n The person in front of him was no longer the same timid young man, who needed his help when he was being bullied.\\n\\n “In that case, allow me to see if your current self has the ability to do so.” Some ripples were stirred within Little Marten’s eyes, before they quickly disappeared. After which, a sharp glint slowly gathered within his eyes.\\n\\n “If the both of you do not have any objections, this match shall determine the tribe leader successor. However, both of you must remember that this is a spar and neither of you are allowed to use lethal force!” Standing on the stage, Zhu Li looked at the two figures in a face off. Then, he secretly sighed before he spoke in a deep voice.\\n\\n “Big brother Ah Diao, please show mercy.”\\n\\n Even though Hao Jiuyou was full of smiles, his eyes did not contain even the slightest bit of joy. Instead, there was an icy chilliness in them. After all, he wanted everyone to see that this once dazzling top genius of the Celestial Demon Marten tribe will be trampled by him today!\\n\\n “Bang!”\\n\\n A frightening aura came whistling out from his body as his voice sounded. Vast and mighty Yuan Power surged around Hao Jiuyou’s body. Life Qi and Death Qi were perfectly merged together in his Yuan Power. Evidently, he had reached the Samsara stage.\\n\\n Little Marten took a step forward. A similarly powerful aura also radiated from him and suppressed Hao Jiuyou’s aura. Straightening all his fingers, there were sharp purple-black light arcs dancing between them.\\n\\n “Big brother Ah Diao, it seems like you have not spent the past hundred years in vain. Back then, you had yet to advance into the Samsara stage.” Hao Jiuyou smilingly said. However, there was no surprise in his eyes. Clearly, he already knew about Little Marten’s strength.\\n\\n “However, I wonder if your Samsara stage strength is stronger or if mine is better!”\\n\\n A cold glint flashed deep within Hao Jiuyou’s eyes. His body moved before he directly appeared beside Little Marten in a phantom like fashion. Soon after, he transformed into many afterimages. Each of these afterimages straightened all ten of their fingers, before an extremely sharp and icy cold force mercilessly smashed towards the fatal spots all over Little Marten’s body.\\n\\n “Our tribe’s Demon Illusion Body has been mastered by you. However, it is useless against me.”\\n\\n Little Marten looked at the many afterimages, which had appeared in his vision, before he chuckled. Purple-black light flashed across his eyes before he suddenly slammed his palm forward. Vast and mighty Yuan Power rose from his palm, like the rising bright sun.\\n\\n Bang!\\n\\n Little Marten’s palm smashed heavily against one afterimage. Subsequently, the other afterimages collapsed before the real Hao Jiuyou also appeared in a flash. His two straightened fingers were pressing against Little Marten’s palm, while vast and mighty Yuan Power covered his entire arm.\\n\\n “Crack.”\\n\\n The stone floor under both parties’ feet cracked because of the Yuan Power seeping out from their palm and fingers.\\n\\n “You should come at me head on if you wish to defeat me. These techniques are useless against me.” Little Marten glanced at Hao Jiuyou, who was standing in front of him, before he said in a faint voice.\\n\\n “Haha, in that case, I shall do as you say.”\\n\\n Hao Jiuyou smiled. However, the icy cold glint within his eyes intensified. He withdrew his fingers before his body rose directly into the sky. Moving both of his hands, vast and mighty natural Yuan Power came whistling forth like floodwaters. After which, one could see many dark purple stars forming in Hao Jiuyou’s palm.\\n\\n “Great Nine Stars Palm?”\\n\\n Many onlookers around the square exclaimed upon witnessing this scene. Clearly, this so called “Great Nine Stars Palm” was quite renowned in their Celestial Demon Marten tribe.\\n\\n “Great Nine Stars Palm huh?”\\n\\n Some emotions also rose from within Little Marten’s eyes. Soon after, he took a step forward before a fluctuation appeared on his palm. It turns out there was also a purple color star array forming on his palm. Clearly, he was planning to use the same martial art.\\n\\n Buzz buzz!\\n\\n Wild and violent Yuan Power whizzed across the place like a flowing river. Within ten breaths’ time, a nine star array was formed in both Little Marten’s and Hao Jiuyou’s palm. The nine star arrays were dazzling, but everyone could detect a powerful energy contained within. In fact, even an ordinary Samsara stage expert could only dodge when up against this formidable attack.\\n\\n The both of them turned to face each other after their attacks were formed. They could both see an unfriendly emotion from the other party’s eyes. Yuan Power gushed forth an instant later before two huge light palms collided. After which, the nine star arrays danced between their glowing palms, while giving off a shocking force. \\n\\n Bang!\\n\\n The light palms were just like two meteorites colliding in the sky. As a dazzling light spread, the violent energy ripples began to spread like floodwater.\\n\\n Both of them remained unbudging despite the impact from the energy assault waves. Their eyes were just like that of a sharp eagle’s as they stared intently at each other. After which, both of their bodies disappeared simultaneously.\\n\\n Swoosh swoosh!\\n\\n A deafening rushing wind sound reverberated across the sky. Two light figures crossed each other in a phantom like fashion. When their palm attacks clashed, vast and mighty Yuan Power would spread. In fact, the force from each palm attack could easily destroy a mountain and it was truly a heart stirring sight. \\n\\n “Ah Diao and Hao Jiuyou are equally matched. Such a fight is indeed going to be an intense one.” Zhu Li stared at the two light figures clashing violently in the sky, before he involuntarily nodded and said.\\n\\n “Hao Jiuyou has trained exceptionally hard over the past hundred years. Although his talent is inferior to Ah Diao, his character does not lose out to the latter.” An elder commented in a faint voice. His tone clearly indicated that he was rooting for Hao Jiuyou. \\n\\n Zhu Li glanced at this elder, who had quite a huge say in the Celestial Demon Marten tribe. Since a long time ago, this fellow bore a grudge against Little Marten’s father. Hence, he was naturally unwilling to see the position of tribe leader successor fall into Little Marten’s hands. \\n\\n “Although Ah Diao is arrogant and untamable, he has improved after being tested for the past hundred years. Moreover, if our Celestial Demon Marten tribe loses that sharp spirit, we will likely become unworthy of the name Celestial Demon Marten.” Another elder laughed and said.\\n\\n With these two clashing with their words, the remaining elders also began to voice their opinions. However, from the looks of it, it seems like there were more elders who supported Hao Jiuyou. After all, Hao Jiuyou’s performance over the past hundred years could only be described as flawless. \\n\\n Zhu Li involuntarily frowned after hearing the arguments from the elders. After which, he did not voice his opinion as he lifted his head to look at the two figures in the sky. From the looks of it, the both of them were very powerful and it was no easy task for either one of them to defeat the other. Therefore, there was a very high likelihood that this match would end in a draw.\\n\\n Boom!\\n\\n The two figures crossed each other in the sky. Vast and mighty Yuan Power came sweeping forth, before the both of them shot backwards. After which, their bodies shook before two pairs of ten thousand feet large bat wings were extended behind their backs, blotting out the sun in the process. However, Hao Jiuyou’s bat wings were dark black while Little Marten’s wings had some mysterious purple-gold symbols. This indicated that Little Marten had a purer bloodline. \\n\\n The two pairs of bat wings slowly flapped before two giant hurricanes, that were tens of thousands of feet in size, were swiftly formed in front of them. One was black, while the other was purple-gold.\\n\\n “Rumble!”\\n\\n The entire world was turned into a mess after being ravaged by these two huge hurricanes. In fact, some surrounding mountains, that were more than a hundred thousand feet away, even began to collapse.\\n\\n The two of them extended their hands simultaneously before they directly reached into their huge hurricanes. Their arms shook before the two enormous hurricane turned. They appeared just like two wind dragons as they wildly whistled forward.\\n\\n Boom!\\n\\n The two hurricanes with vast and mighty Yuan Power clashed in the sky. After which, they left numerous dark black cracks in the empty space itself. In fact, the entire world became dimmer.\\n\\n Crack crack!\\n\\n The two of them had poured a relatively large amount of Yuan Power into their respective hurricanes. However, they still ended up in a stalemate. Clearly, the two of them were quite evenly matched. \\n\\n “Such powerful individuals.”\\n\\n “Unexpectedly, Ah Diao is still so formidable despite being missing for a hundred years. Hao Jiuyou is also pretty decent. However, from the looks of it, he is still unable to defeat big brother Ah Diao.”\\n\\n “A draw is already a pretty decent result. If it was not because big brother Ah Diao was ambushed and had went missing for a hundred years, it is likely that no one within the Celestial Demon Marten tribe could contest with him for the position of tribe leader successor.”\\n\\n “That’s right…”\\n\\n Many conversations began to spread from below, while the crazy face-off in the sky entered into a stalemate. \\n\\n Hao Jiuyou’s hand suddenly grabbed his black hurricane. His face, which was originally filled with a warm smile, suddenly became extremely icy cold. Meanwhile, a venomous and unwilling glint was flowing within his pupils. \\n\\n “You bastard. Do you know what kind of price I paid over the past hundred years in order to obtain this strength? Don’t tell me that I still cannot defeat someone like you, who has been hiding and recuperating as a fragmented existence over the last hundred years?”\\n\\n Hao Jiuyou secretly bellowed while dense fury surged in his heart. This caused a scarlet color to vaguely appear deep within his eyes.\\n\\n “I am the most outstanding person in the Celestial Demon Marten tribe!”\\n\\n The scarlet color in Hao Jiuyou’s pupils grew increasingly dense. He suddenly clenched his hand, which had been inserted into the black hurricane, before a strange symbol stealthily appeared.\\n\\n “How can a genius like you understand the pain that I had to go through? Like I said, I, Hao Jiuyou, will definitely trample you today!”\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1138","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
