{"id":59887,"no":131,"title":"Chapter 131: Zi Yue","content":"Chapter 131: Zi Yue “As expected…” After hearing these words, Lin Dong laughed bitterly in his heart. He did not expect that he would be in such great demand, just a while ago, he was recruited by the Thousand Gold Association to aid in the Celestial Dan Pool battle with the Blood Wolf Gang. Now, he was once again invited by grandmaster Yan to participate in the Tower Battle. In the previous Celestial Dan Pool affair, he had already offended the Blood Wolf Gang. The Tower Battle this time was a clash between the Symbol Master Guilds of two cities, this practically represented all the Symbol Masters in both cities. Compared to the Celestial Dan Pool fight, this Tower Battle was clearly going to be a lot more thorny. “Grandmaster, this young one has only cultivated in Mental Energy for a short period, it is somewhat inappropriate for me to participate in such an important matter right?” Lin Dong considered his words as he carefully spoke. If it was any normal person asking, he would straightaway reject, however, grandmaster Yan was after all someone he was indebted to. Thus, it was not easy for him to reject. “Though the amount of time you’ve spent cultivating Mental Energy is not considered long, your ability has surpassed most of the young Symbol Masters in Yan City. As the saying goes, the one who has reached the next stage should be the teacher, the length of cultivation is merely secondary.” Grandmaster Yan slightly smiled as he said. Lin Dong felt a somewhat bitter feeling in his mouth, looks like grandmaster Yan was determined to get Lin Dong to participate. “Haha, are you worried about the Blood Wolf Gang?” Upon seeing Lin Dong’s silence, grandmaster Yan also understood that this young one would not act without an incentive as he asked. Lin Dong hesitated for a moment before gently nodding his head. After killing Wei Tong this time, he had completely offended the Blood Wolf Gang and given the Lin Family’s current strength, they were still unable to contend against the Blood Wolf Gang. Although they were sort of under the protection of the Thousand Gold Association, it was still somewhat uncomfortable when faced with a faction like the Blood Wolf Gang that was eyeing them covetously. And this was also why Lin Dong did not dare to relax in his cultivation during the past half a month. “If you are able to keep the Symbol Master Tower in Yan City, I can guarantee that the Blood Wolf Gang would not dare to touch your Lin Family.” Grandmaster Yan softly chuckled. If it was before, Lin Dong would perhaps be a little suspicious of grandmaster Yan’s words. After all, although the latter was extremely powerful, he was still one lone man. But now that he knew that there was still the Symbol Master Guild behind this grandmaster, which did not lose out to the Blood Wolf Gang, Lin Dong’s eyes twinkled after hearing these words. “Borrowing an outsider\u0027s power to protect the Family was only a temporary measure in the end, only when one attained his own power could he truly protect his Family.” After seeing that Lin Dong was still unable to make his decision, grandmaster Yan was not worried but instead gently smiled as he said: “According to my calculations, you should have made a breakthrough to the second seal level over the past two months. At this speed, even if your talent for Mental Energy is extremely strong, you still need at least half a year or even a year to reach the third seal right?” Lin Dong lightly nodded, though he had not relaxed even the slightest in his cultivation over the past month, he was clearly able to feel that his speed was not as rapid as before. Evidently, advancing to the advanced Yuan Dan stage or the third seal Symbol Master level would not be so simple. Even with the aid of the mysterious Stone Talisman, he would still need half a year, after all, if it were another person, it would be unthinkable even when given a few years. Perhaps others would find this amount of time rather short, however, with the Blood Wolf Gang covetously eyeing them from one side, who could tell if there would be any changes to the situation in the next half a year? “I have a method that will allow you to reach the third seal Symbol Master stage in half a year.” Grandmaster Yan’s following words made Lin Dong’s heart skip a beat. Third seal Symbol Master, if he was able to reach that level, given his Mental Energy, he would probably be able to match up to a fourth seal Symbol Master. At that time, even if he was not able to beat Yue Shan in battle, it would be enough such that the latter would not dare to make any careless moves. However...if grandmaster Yan truly had such a method, why would he need Lin Dong for the Tower Battle? “I’ve said it before, the Symbol Master Tower is considered as a holy ground to many Symbol Masters. Most importantly, it has the effect of tempering and purifying the mind.” As if he knew about the doubts in Lin Dong’s heart, grandmaster Yan smiled as he said: “The Symbol Master Tower is split into nine levels. The higher the level, the more effective the tempering and purifying effect will be. If you are able to enter the seventh level, you have a chance to breakthrough to the third seal Symbol Master stage within half a year.” “But don’t underestimate this seventh level. Within the Symbol Master Tower is the condensed Mental Energy of many past Symbol Masters. The mental pressure there is extremely huge, to reach the seventh level is no easy feat. All these years, there has been no one among the younger generation members of the Yan City Symbol Master Guild who has managed to reach the seventh level.” “However, I feel that with your capabilities, reaching the seventh level should not be very difficult. As long as you are able to endure for ten days in the seventh level, you would definitely breakthrough to the third seal level within half a year!” Lin Dong was a little speechless as he gazed at the smiling expression on grandmaster Yan’s face. It turned out that he still had to rely on himself, although he had never known about the Symbol Master Tower before, he was able to imagine the difficulty in ascending the tower. At that time, who knew if he truly had the ability to reach the seventh level? Upon seeing the expression on Lin Dong’s face, grandmaster Yan could not help but chide: “Is this still not enough to satisfy a brat like you? There is nothing in this world that comes for free, if you wish for something, you need to fight for it yourself. Whatever level you manage to reach will depend on yourself, I do not have any way to help.” “Other than that, if you truly have the ability to directly ascend to the eighth level, it is said that an elder had left a Qi grade Secret Spirit Skill there. Whether you are able to obtain it would depend on your destiny.” “Qi grade Secret Spirit Skill?!” After hearing this, a flame was swiftly lit in Lin Dong’s eyes. Over this period of time, he had went to the Thousand Gold Association many times, yet the Secret Spirit Skills which he found were all only at the Essence level. As for Qi grade Secret Spirit Skill, he had not even seen the slightest indication of one. From this, one could tell how rare a Qi grade Secret Spirit Skill was. “Little one, I have told you about all the benefits, if you are still not satisfied, then there is nothing more I can do.” Grandmaster Yan stroked his beard as he said. Upon hearing these words, Lin Dong also became a little embarrassed. He no longer dared to hesitate as he hastily nodded his head: “Everything will be as grandmaster says.” Although it was a little immoral for him to work as a hired thug for others, the reward that grandmaster Yan had talked about was too generous, such that Lin Dong was no longer able to reject. After seeing this matter with Lin Dong had finally been settled, grandmaster Yan involuntarily sighed in relief. When he recalled the things that he had promised, he felt a little pain and resent in his heart. This brat was a truly difficult master to please. “Grandmaster, when does the Tower Battle begin? How strong will my opponent be?” Since he had already agreed, Lin Dong also started to ask about his opponent. “Haha, the Tower Battle competition was rather special because it is not an ordinary competition. The uses another method to determine the victor, which is ascending the tower!” Grandmaster Yan chuckled a little as he said. “Ascending the tower?” Lin Dong was stunned, soon after, something seemed to have clicked in place for him: “Ascending the Symbol Master Tower?” “Yes. The competition style is as I had explained before: to ascend the Symbol Master Tower. Whoever manages to ascend the highest and endure there the longest would be the final victor.” Grandmaster Yan smiled as he said. “Isn’t that the same as the reward you promised me?” Lin Dong said in amazement. “It seems to be.” Grandmaster Yan started laughing, the appearence he had now was an extremely crafty one. As he gazed at grandmaster Yan’s sly smile, Lin Dong’s face started to twitch. After all this time, it was no reward but actually an unavoidable part of the competition. “You got me.” At this time, regret was no longer possible, thus, Lin Dong could only curtly reply. “Previously, which level did the competitor from Sky Fire City reach?” “The sixth level, and the competitor managed to endure there for eight days.” Grandmaster Yan softly sighed: “I heard that a few young Symbol Master geniuses had appeared in Sky Fire City. If my prediction are correct, their result this time will be better than last year.” Lin Dong nodded, Sky Fire City was indeed the number two city in Tiandu province. The potential talent they tapped into was better than Yan City’s. “Therefore, this time, if you want to achieve a victory, you need to work hard and ascend to the seventh level of the Symbol Master Tower.” Grandmaster Yan wore a serious expression on his face as he spoke. “Yan City is huge, there should be other young and reliable Symbol Masters in the Symbol Master Guild right?” Lin Dong knitted his eyebrows. Could it be that they were placing all their expectations solely on him? “Haha, my Symbol Master Guild naturally has some talented individuals.” Grandmaster Yan slightly chuckled. Soon after, he lightly clapped and as his clap echoed out, the bamboo door was gently pushed open as an elegant figure strolled in. Lin Dong turned his head to look behind as a stunned look flitted across his eyes. The girl’s figure was tall and slender, wearing a violet dress, her skin was like snow while her eyebrows were fine and shapely. An oval face, a small cherry-red mouth and delicate features all came together to create an extremely beautiful woman. However, that frigid yet pretty face clearly told others that no one should get close. “Teacher.” The violet clothed girl walked into the bamboo room as she bowed towards grandmaster Yan. Her voice was clear yet cold. Ever since entering and greeting her teacher, the violet clothed girl did not once look at Lin Dong. Yet, Lin Dong did not feel that this was unexpected. Though this girl was admittedly beautiful, she was clearly an unreasonable ice queen, if she had greeted him kindly, it would have felt wrong. “She is the most outstanding one among the youngsters of my Symbol Master Guild, Zi Yue. Currently, she is a second seal Symbol Master.” Grandmaster Yan smiled as he said. Upon hearing these words, Lin Dong was also somewhat amazed. He did not anticipate that this ice-cold beauty was actually a second seal Symbol Master. Looks like her Mental Energy talent was rather good. “Zi Yue, my young friend Lin Dong is also considered one of my Yan City Symbol Masters. This time, I have invited him here for the Tower Battle matter, and also as an insurance of sorts.” Grandmaster Yan gazed at the ice-cold beauty called Zi Yue as he gently spoke. After hearing grandmaster Yan’s words, Zi Yue finally shot an icy glance at Lin Dong before withdrawing her gaze as she said in an indifferent voice: “Teacher, this time, I will make sure Sky Fire City returns in defeat.” Her tone was flat and a little icy. Even though she had not directly said it, Lin Dong could tell that she felt this move by grandmaster Yan was unnecessary... Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-131","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them… Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family. Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman… Official Sypnopsis 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 武之极，破苍穹，动乾坤！ On the Journey of Cultivation, One must steal Ying and Yang, Sieze the Laws of Creation, Reach for Nirvana, Obtain Mastery over Life and Death, and Power over Reincarnation. At the peak of Martial Arts, break through the Heavens and shake the Universe!","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
