{"id":61079,"no":1323,"title":"Chapter 12: The Tenth Echo","content":"WDQK Chapter 12: The Tenth Echo\n “These Yin Pearls could be secretly given to Father for his usage…”\n As Lin Dong licked his lips, a fire lit up in his eyes as he gazed intensely at the three Yin Pearls in his palm. Since Lin Xiao had fallen to Earthly Yuan level, if he could absorb the Yin Energy in these pearls, his strength would definitely be greatly enhanced.\n However, treating Lin Xiao’s internal injuries still took priority because, the longer it dragged on, the worse it became for him.\n “Sometime in the next few days, I will find an opportunity to feed Father the red-liquid from the stone talisman. Lets see if it will help to heal the injuries in his body.”\n The current Lin Xiao suffered from grave internal injuries. After so many years of dragging himself around even with these injuries, a tremendous amount of damage had been done to his body. If these injuries are not treated, Lin Xiao will likely be unable to safely absorb the Yin Energy in these pearls.\n “If Father can recover his previous strength, our status within the Lin Family will be immediately reinstated. After all, even after all these years, only three people from the Lin Family have advanced to Heavenly Yuan level.”\n Even within Qingyang Town, those who reached Heavenly Yuan level could be considered as elite practitioners. In this town, the strength of one’s faction largely depends on the number of Heavenly Yuan users that they have. Therefore, if Lin Xiao was able to recover his Heavenly Yuan strength, not only will his position be restored, but any impediment towards his progress should disappear as well. This was a future that Lin Dong, Liu Yan and Qing Tan had long dreamed of.\n As he imagined Lin Xiao’s recover his majestic figure of the past, Lin Dong involuntarily let out a little chuckle. Then, he proceeded to look for a tiny bottle in his room and very carefully placed the three Yin Pearls inside. He knew that if he wanted to, he could probably exchange these items for Grade 3 elixirs as they were quite valuable.\n After he finished, Lin Dong finally heaved a sigh of relief. Suddenly, an aching sensation emerged from his body. Even though the stone talisman had helped to suck out the chilling cold from Qing Tan’s body, his body was still affected by the Yin-nature chill.\n “Has the chilling cold entered my body?”\n The aching sensation in his body caused Lin Dong’s complexion to change. Moments later, he felt as though the aching sensation had stuck itself to the marrow in his bones. It felt as if something was attempting to drill it’s way into his bones.\n “Bone refining?”\n At this sudden realization, Lin Dong’s eyelids blinked rapidly. Bone refining was a key step to achieving Tempered Body 5th Layer, which would greatly enhance the toughness of one’s bones, resulting in an enormous upgrade in both power and speed. However, Lin Dong had only just advanced to Tempered Body 4th Layer. Based on his calculations, even if he had the aid of the liquid from the stone talisman, it would take up to ten days before he should reach this step. How did it appear now?\n “It must be due to the chilling cold within Qing Tan’s body!”\n After pondering for a while, Lin Dong finally guessed the answer to his question. Instantly a look of amazement surfaced on his face. Did the chilling cold in Qing Tan’s body really have such a miraculous effect on Tempered Body practitioners?\n “The chilling cold in Qing Tan’s body was too savage. The stone talisman must have filtered out all of the savageness and left only the beneficial parts in my body.” Lin Dong frowned as he recalled that even Lin Xiao, who was at Earthly Yuan level, had a devastating time dealing with the chilling cold and had to recuperate for half a month. Therefore, compared to himself who was only at Tempered Body 4th Layer, his ability to handle the chilling cold would be a joke. In the end, it was mostly because of the help from the stone talisman.\n “I did not expect the chilling cold in Qing Tan’s body to possess this kind of effect. However, it will still be a while before the chilling cold flares up again…”\n Upon muttering these words, Lin Dong hastily spat in disgust. Every time the chilling cold flared up, it caused Qing Tan an immense suffering. If this is the price to pay for these Yin Pearls, Lin Dong would rather not have them.\n As he quickly suppressed this horrible idea, Lin Dong stretched his body and then laid down on his bed. His eyes gradually closed, while the stone talisman on his chest once again emitted a faint glow.\n Over this period of time, Lin Dong had gained a better understanding of the stone talisman. He now knew that the dark space that he had found himself in could be considered as a spiritual domain where his physical body could not enter. Nonetheless, every thing that he learned there could be brought back completely to the real world.\n In the darkness, a glowing shadow and a human figure flickered, as crisp echos sounded out continuously.\n With rapt attention, Lin Xiao concentrated on the movements of the glowing shadow. Even the slightest twitch by the latter, was clearly memorized by him.\n After such a long period of training, even though Lin Dong could not claim to be at the pinnacle of Penetrating Fist, he could be considered to have a very high level of mastery. On a good day, he could often generate all nine echoes.\n However, even though Lin Dong was quite well-versed with Penetrating First, he was still unable to make any progress with the tenth echo.\n “Pa Pa…”\n When the glowing shadow once again produced the ninth echo, Lin Dong’s concentration abruptly rose to it’s peak. In that moment, he experienced an unreal sensation. He felt as though he had become the glowing shadow. The glowing shadow’s every minute movement and even the tiniest changes in its control of force were clearly engraved into his mind.\n “Pa!”\n A low, barely discernible echo sounded out as a powerful force once again followed the route through the channels and erupted from the palm of the glowing shadow. The strength of the last echo was truly monstrous.\n “So that’s how it’s done…”\n Lin Dong’s eyes gleamed as a joyful expression surfaced on his face. He had finally grasped the so called trick behind the tenth echo!\n While he was in that mysterious state, Lin Dong had clearly experienced how the glowing shadow utilised the flow of force. He found that the tenth echo was not generated from the arms, but rather from within the body!\n The first nine echos were on the outside, while the tenth echo was from within!\n “By perfectly coordinating one’s muscle and bones, one can break through the limits of the ninth echo and reach a new high. That is the tenth echo of Penetrating Fist!”\n Lin Dong’s body trembled in excitement. This unique combination was something that even Lin Xiao did not know about. If he had not entered into that mysterious state, Lin Dong would never have grasped the secret behind the tenth echo!\n Based on his calculations, if he could execute the tenth echo, Penetrating Fist would not be considered weak even among the ranks of Level 2 martial arts.\n Even though Lin Dong had yet to truly grasp the tenth echo, he was confident that after this realization, he would finally be successful in mastering it!\n Moreover, he knew that once he had mastered the tenth echo, it will definitely become his signature killing move. By then, Lin Dong was confident that he could match up even to someone like Lin Hong, who exceeded him by 2 layers and wielded Yuan Power.\n As he recalled all the unscrupulous means that Lin Hong had adopted to force his Father consent to an engagement with Qing Tan, the rage in Lin Dong’s heart burned even hotter.\n “This time, I will make sure to thrash you until you lose all face to bring up this issue ever again!”\n Lin Dong sneered, yet his expression quickly turned to one of seriousness. He positioned himself into the stance of Penetrating Fist and began to practise. He knew that Lin Hong was still ahead of the current him, thus he must continue to work hard!\n “Pa Pa…”\n In the darkness, the young man’s figure flowed gracefully like a monkey. Even as sweat rained down on his body, he tirelessly drilled Penetrating Fists over and over again as a series of crisp and clear echoes continuously reverberated in the air!\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-12","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n \n Official Sypnopsis\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \n 武之极，破苍穹，动乾坤！\n On the Journey of Cultivation, \n One must steal Ying and Yang, \n Sieze the Laws of Creation, \n Reach for Nirvana, \n Obtain Mastery over Life and Death, \n and Power over Reincarnation.\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
