{"id":61149,"no":1393,"title":"Chapter 82: One wounded, one dead","content":"WDQK Chapter 82: One wounded, one dead As Lei Pi stared at the razor-sharp “Shattered Yuan Shrapnel” in Lin Dong’s palm, he felt as if all his skin suddenly chose that moment to tighten up. He had not anticipated how vicious and ruthless an immature looking youngster like Lin Dong could be. Previously, when he was being surrounded by the two of them, he did not panic but rather waited for an opportunity to assassinate one of them. This level of nerves and skill caused even Lei Pi’s heart to involuntarily tremble. “I was careless this time…” This thought flashed across Lei Pi’s heart. However, immediately after, a bitter feeling emerged in his heart. It was not that he was careless, but rather Lin Dong was simply too strong. No one could have imagined that in just one year, the boy who was barely able to defeat Lei Li, had already advanced to this terrifying level. “Dong-er!” Just as Lei Pi’s vision rapidly flickered, Lin Xiao’s hurried shout suddenly sounded out from nearby. Immediately, a large number of footstep could be heard homing in on their location. Even though the Lei Family was very powerful, the Lin Family also had an enviously high status in Qingyang Town. Therefore, news of this event soon reached Lin Xiao’s ears. “Dammit.” When he realized that Lin Xiao had discovered them so rapidly, Lei Pi’s facial expression darkened. He looked once again at Lin Dong who stared back with an ice-cold gaze while holding onto the “Shattered Yuan Shrapnel”. Lei Pi finally understood that his mission was not only a total failure, but it had even caused the Lei Family to lose a Heavenly Yuan Stage expert. This time, they had suffered a massive loss. “You little bastard. This will not end so easily, just wait and see!” Lei Pi lifted Lei Xing’s corpse as he directed a poisonous gaze at Lin Dong. After leaving behind a threat, Lei Pi’s figure shot away as he immediately leapt on a roof and planned to escape. “Thinking of escaping?” When he saw Lei Pi attempting to escape, Lin Dong immediately chuckled. Since the Lei Family had already severed all ties with their family, there was no need to have mercy on them. A Heavenly Yuan Stage practitioner was an extremely important asset to the Lei Family. Hence, if he could kill one more, it would definitely deliver a devastating blow to them. “Swoosh!” Lin Dong’s arm jerked forward as the “Shattered Yuan Shrapnel” in his hand transformed into a black shadow and swiftly shot towards Lei Pi. However, Lei Pi was already on guard against Lin Dong. Once he saw the later make his move, a vigorous Yuan Power undulated around his body as he quickly shifted his body and evaded that incoming black shadow. “Snort.” Having avoided Lin Dong’s attack, Lei Pi was about to sneer when a sonic boom sounded out from behind him, causing him to turn around. Out of the corner of his eye, he saw the black shadow that he had just dodged now miraculously turn about and once again shot towards his head. “How is that possible?!” Lei Pi was so astonished by this scene that his soul almost jumped out of his body. The only thing he could do was to hurriedly raise his arms to protect his head. “Pu!” That black shadow drilled into Lei Pi’s arm. Even though Lei Pi had used Yuan Power to protect his arms, they were still penetrated easily. The razor-sharp shrapnel was so deeply embedded into Lei Pi’s arm that it caused him to bleed profusely. Once his foe was hit, a wave once more emerged from Lin Dong’s Ni Wan Palace. As if Lei Pi knew that Lin Dong could control this black shrapnel, just as he attempted to extract his “Shattered Yuan Shrapnel”, Lei Pi gritted his teeth as the muscles in his arm immediately tightened up and forcefully trapped that piece of shrapnel in his flesh. After which, his sorry figure scuttled away. “You little bastard. Next time, I will definitely grind your bones to dust!” As Lei Pi’s figure quickly disappeared, a vicious growl sounded out from afar. “What a pity…” Gazing at Lei Pi’s retreating shadow, Lin Dong shook his head in regret. With a wave of his hand, several “Shattered Yuan Shrapnels” that he had secretly thrown out before turned into black shadows as they flew back into his sleeves. If Lei Pi was just one second slower, Lin Dong would be able to manipulate all these “Shattered Yuan Shrapnels” to launch a coordinated attack and finish Lei Pi off. “Dong-er!” Just as Lin Dong recalled his “Shattered Yuan Shrapnels”, dozens of shadows emerged at one end of the street. Naturally, the man leading the group was Lin Xiao. “Father.” Lin Dong smiled and greeted when he saw Lin Xiao. Lin Xiao dashed over as his eyes swept over the scene. His facial expression changed dramatically when he saw the corpses littered nearby. Immediately, he stepped in front of Lin Dong as he scanned the surroundings vigilantly. The rest of the Lin Family guards immediately drew their weapons and surrounded the two of them. “What happened?” Upon hearing Lin Xiao’s low voice, Lin Dong scratched his head humbly as he replied with a smile: “Some Lei Family men, Lei Pi and Lei Xing tried to kill me.” “Lei Pi and Lei Xing?” After hearing those two names, not only did Lin Xiao’s face begin to twitch, but the facial expressions on the surrounding guards also changed. Everyone knew that these two were core members of the Lei Family. In fact, since both of them were at Heavenly Yuan Middle Stage, they were quite famous in Qingyang Town! “Those Lei Family scoundrels!” Lin Xiao gnashed his teeth as he cursed. He never expected that the Lei Family would actually utilize two core members in order to deal with a younger generation member of the Lin Family. As his thoughts reached this point, he could not help but worry. It looks like Lin Dong’s immense potential had drawn the Lei Family to kill him. In future, there will be no choice but to arrange some guards to protect him. “Are you alright? Where are they?” “I am fine.” Lin Dong laughed. “As for Lei Xing, he should have died. One of Lei Pi’s arm can also be considered crippled, I am afraid he can’t do much in the meantime.” At this moment, Lin Xiao’s thoughts seemed to have stalled. Then, he abruptly turned around as he stared at Lin Dong and asked: “Lei Xing is dead? Lei Pi’s arm is disabled? Did you do this?” Swoosh swoosh! At the same time, the Lin Family guards who were surrounding them were currently slack-jawed as their mouths hung wide open. They blankly stared at the youth that they were protecting in the middle as they suddenly began to feel their scalps turn numb. Lei Pi and Lei Xing were both Heavenly Yuan Middle Stage experts. The two of them had joined hands and also brought some men to support them. Yet they did not accomplish anything, but instead one was killed and the other injured? “It was good luck,very good luck…” As he looked around at the crowd who were gazing at him, Lin Dong felt a little awkward. If it were not for the fact that he knew this news would get out sooner or later, he would have much preferred not to tell them. “Dammit. Can you kill a Heavenly Yuan Stage expert based on luck alone?” Some loyal Lin Family guards exchanged gazes as they mumbled. Lin Xiao’s mouth opened and closed, but in the end, no words emerged. Right now, a storm was brewing inside his heart. After all, faced with the combination of Lei Pi and Lei Xing, he doubt that he could accomplish such a feat. “Well done brat.” As he somewhat forcefully patted Lin Dong’s shoulder with his palm, Lin Xiao finally spit out these three words in a proud and content manner. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-82","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them… Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family. Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman… Official Sypnopsis 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 武之极，破苍穹，动乾坤！ On the Journey of Cultivation, One must steal Ying and Yang, Sieze the Laws of Creation, Reach for Nirvana, Obtain Mastery over Life and Death, and Power over Reincarnation. At the peak of Martial Arts, break through the Heavens and shake the Universe!","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
