{"id":61168,"no":1412,"title":"Chapter 101: Arrival of the Blood Cloth Sect","content":"Chapter 101: Arrival of the Blood Cloth Sect\\n\\n Immense pain!\\n\\n When Lin Dong’s body hopped into that area where two large crystal millstones interacted, a massive unstoppable force immediately enveloped his body. Due to that terrifying force, Lin Dong immediately lost control of his body. Then, he started to sense that his body was breaking apart inch by inch!\\n\\n When his body broke down, an unspeakably immense pain swiftly followed!\\n\\n The two giant crystal millstones continued to rotate at a slow and steady pace, as if nothing in this world could stop it.\\n\\n Lin Dong’s body was completely powerless in the face of the crystal millstones. The intense pain caused his body to tightly curl up. Visible cracks could be seen all across his body as sections of his skin split apart.\\n\\n While experiencing that immense pain first-hand, Lin Dong finally understood why the small marten had looked at him in a peculiar manner when it heard that he wanted to use these Mind Millstones to train his Mental Energy. It was because the pain was at such an intense level!\\n\\n Lin Dong tightly gritted his teeth as he utilized every ounce of his energy to maintain his last sliver of consciousness, preventing himself from being drowned by the flooding pain.\\n\\n “Ka ka ka…”\\n\\n As he forcefully hung on, more cracks began to emerge on Lin Dong’s body. Moments later, his body vibrated violently before it actually exploded and turned into numerous Mental Spots…\\n\\n His Mental body was forcefully blown to bits by the Mind Millstones.\\n\\n Just as Lin Dong’s Mental Body was blown apart, a white light suddenly emerged from the two crystal millstones and wrapped itself around the Mental Spots.\\n\\n A trace of Lin Dong’s consciousness was floating in these Mental Spots. Hence he could sense the presence of a mysterious energy contained within that white light. Thanks to that energy, those Mental Spots that were scattered actually started to converge towards his consciousness!\\n\\n “Buzz buzz!”\\n\\n As more and more Mental Spots began to gather, Lin Dong’s Mental Body was actually restored!\\n\\n When he witnessed this scene, a look of awe surfaced in Lin Dong’s eyes. However, before he could find the time to marvel at this miraculous mind millstones, the immense pain that was enough to drive a man crazy attacked once again!\\n\\n “Boom!”\\n\\n A distance from the crystal millstones, the small marten watched Lin Dong’s Mental Body being forcefully blown apart again as a hissing sound involuntarily left its lips. With its paws in front of its chest, his attitude was nonchalant and akin to watching a show: “Hehe, grandfather marten wants to know how many times can that kid endure…”\\n\\n Previously, when the Stone Talisman was in its hands, it had also tried to utilize this so-called mind millstones. Even till now, that intense pain caused some of its hair to stand on end. Though that object could indeed boost one’s Mental Energy, it was not something that any ordinary man could endure.\\n\\n Under the faint glow of the space, the two crystal millstones continued their slow rotation at a steady pace. As they rotated, streams of terrifying energy were poured into the youth who was standing at the intersection of the millstones.\\n\\n “Bang… Bang…”\\n\\n A soft explosion sound caused by the eruption of the Mental Body echoed across the area. However, each time this sound echoed out, the small marten’s paws would tremble.\\n\\n The crystal millstones slowly rotated as it continued its never-ending cycle. Below the crystal millstones, a powerless figure utilized all his determination as he was continuously blown apart and reformed time after time in order to strengthen himself!\\n\\n “The eighth time…”\\n\\n Unknowingly, the slightly sadistic glint in small marten’s eyes had dissipated as it stared at that youth in awe. It could clearly feel that the latter had already passed his breaking point and he was only holding on through sheer willpower.\\n\\n “Bang…”\\n\\n Another clear and loud echo reverberated about the space. The awe in small marten’s eyes grew thicker. However, the awe in its eyes slowly turned into a serious expression after another echo sounded out after a long while.\\n\\n Ten times.\\n\\n Lin Dong had endured ten cycles of being exploded and reformed again in the crystal millstones…\\n\\n “This kid is truly tenacious…” the small marten lowered the claws in front of its chest. For the first time, it realised that the boy had something that made him stand out from the masses.\\n\\n While the small marten sighed in its heart, an almost transparent figure slowly floated out from the crystal millstones before it stopped in front of the former. That extremely weary face was indeed Lin Dong’s.\\n\\n Right now, even though Lin Dong had left the mind millstones, he could still feel remnants of the intense pain inside his consciousness.\\n\\n “Not bad kid. You managed to endure ten cycles on your first attempt…” As it looked at the feeble Lin Dong, the small marten smiled as it said.\\n\\n Lin Dong barely managed to return a smile. However, even though he felt extraordinarily weak and exhausted, he could faintly sense that right now, his Mental Energy seemed slightly more potent that before. Looks like these crystal millstones would really help boost one’s Mental Energy.\\n\\n “Right now, you have reached your limit and should not train any further. It’s best to return home and rest. Besides, grandfather marten suggests that you procure some Mental Energy-nourishing Elixirs as it would greatly amplify the effects of your training. If not, your Mental Energy may be damaged due to poor health and this may lead to problems in the future.” The small marten casually muttered.\\n\\n “Yes, thank you.” Lin Dong earnestly nodded his head. Although this small marten’s origins remained a mystery, it seemed very knowledgeable. Therefore, it was only sensible to heed to its advice.\\n\\n The small marten waved its paws, without further ado, it immediately turned into a flash of light and disappeared into the darkness. Lin Dong did not seem to mind, with a nudge of his consciousness, he left this Spiritual Domain.\\n\\n …\\n\\n Inside his room, Lin Dong opened his eyes and felt a pang of dizziness set in immediately. Shaking his head, he let out a bitter laugh. Even though his physical body did not incur any damage during that training, his Mental Energy was severely strained.\\n\\n As he gently sighed, a strand of Lin Dong’s mind slipped into his Niwan Palace, only to see that his Destiny Soul Symbol was now eerily dark. However, it’s form seemed to have solidified slightly. It seems like that was the result of his prior training inside the mind millstones.\\n\\n “Indeed, I will need some Elixirs that can rejuvenate my Mental Energy in order to maximize my training. Let me see if I can buy some Elixirs in the next few days…”\\n\\n When he saw this scene, Lin Dong thought to himself as he nodded his head. Then, he stretched his body, feeling the weariness set in, before he fell asleep almost instantaneously.\\n\\n …\\n\\n In the following days, Lin Dong practically entered the Stone Talisman Spiritual Domain daily to utilize the mind millstones to temper his Mental Energy. Even though the training was truly torturous, right now, this was Lin Dong’s only way to swiftly boost his Mental Energy.\\n\\n With regards to the Elixirs that could rejuvenate one’s Mental Energy, it was truly too rare. Even though Lin Dong searched the entire Qingyang Town bazaar, he could at most procure two Grade 2 Elixirs. Nonetheless, it was still better than nothing.\\n\\n As Lin Dong tirelessly trained, seven days passed in the blink of an eye.\\n\\n In these seven days, Lin Dong’s Mental Energy training made good progress as his Destiny Soul Symbol increasingly materialized. In fact, it now looked like a symbol with substance. However, there was still quite a way to go for him to advance to the 2nd Seal Symbol Master level.\\n\\n Fortunately, Lin Dong had already expected this outcome. After all, if it was so easy to advance to 2nd Seal Symbol Master, then Symbol Masters would be worthless…\\n\\n While Lin Dong was training, the Lin Family began to secretly transfer some younger generation members away in order to safeguard against the worst case scenario.\\n\\n As days passed, the atmosphere in the Lin Family grew increasingly tense. Meanwhile, the rest of the factions in Qingyang Town also began to turn their attention towards the Lin Family. Some of them were delighted at their misfortune, some of them were worried for them, while others were merely casual observers.\\n\\n …\\n\\n In a forest deep within the Lin Family estate, Lin Dong’s tightly shut eyes slowly opened. With a flick of his mind, a “Materialized Spirit Needle” swiftly formed in front of him.\\n\\n The current Lin Dong had completely mastered this so-called “Materialized Spirit Needle.” However, this was merely an ordinary Secret Spirit Skill. Therefore, its power was not truly astounding.\\n\\n “It’s been ten days…”\\n\\n As that “Materialized Needle” began to dissipate, Lin Dong’s facial expression turned increasingly serious. In these ten days, thanks to that mind millstones, his Mental Energy had grown tremendously. However, he had yet to become a 2nd Seal Symbol Master. According to Lin Dong’s prediction, with the help of the mind millstones, he would need another two to three months time before he could advance to the 2nd Seal level.\\n\\n Yet, time was now of essence. If he failed to advance to the 2nd Seal level, he could never hope to match up against Wei Tong, who was at Advanced Yuan Dan Stage.\\n\\n “I must think of a way to delay them…”\\n\\n Lin Dong softly sighed. This critical situation caused him a major headache.\\n\\n “Eh?”\\n\\n Just as Lin Dong sighed, he suddenly felt the ground began to tremble slightly. Promptly, his facial expression changed. As his toe pushed off the ground, he immediately leapt to the top of a nearby tree before his Mental Energy began to spread out. His fist abruptly clenched tightly.\\n\\n Within Lin Dong’s area of perception, a sea of red suddenly began to emerge just outside of Qingyang Town’s entrance. Like a typhoon, they seemed extremely formidable as they swept towards the Lin Family’s position.\\n\\n “Blood Cloth Sect…”\\n\\n As he stared at the army of red-clothed murderous troops, Lin Dong softly sighed. They had finally come…\\n\\n “The Blood Cloth Sect has arrived. Lin Family members, prepare to die!”\\n\\n As that giant army charged towards the Lin Family, a fierce shout echoed out with the aid of a thick Yuan Power. Like a thunder, it rang clearly in the entire Qingyang Town!\\n\\n \\n\\n \\n\\n TLN: We’ve decided to adopt a more understandable ranking for the Yuan Dan Stage, credits to the commenter in our WDQK World page\\n\\n 小元丹境 – Initial Yuan Dan Stage —\u003e Initial Yuan Dan Stage\\n\\n 元丹小圆满 – Yuan Dan Small Full Circle —\u003e Yuan Dan Advanced\\n\\n 大圆满 – Perfect —\u003e Perfect\\n\\n To make things clear, both Lin Zhentian and Lei Bao were at the Initial Yuan Dan Stage while the new character, the head of the Blood Cloth Sect, is at the Advanced Yuan Dan Stage\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-101","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
