{"id":61303,"no":1547,"title":"Chapter 236: Massive Earth-shattering Battle","content":"Chapter 236: Massive Earth-shattering Battle\n Boom boom!\n Berserk Yuan Power undulations frantically unfurled, blowing away sand and chasing away rocks. This kind of scene was truly incomparably dreadful.\n For such a frightening disturbance not to draw anyone’s attention was clearly impossible. Hence, not long after the fighting started here, countless figures rushed over from all over. However, when they saw the huge ape that was waving its enormous fists as it desperately attacked the Ancient Sword Sect, gasps endlessly sounded out under this piece of sky.\n “Ancient Dragon Ape!”\n Shocked and ear-piercing cries of fear rose up one after another as they rang out. When every gaze concentrated on the Ancient Dragon Ape’s huge body, they turned momentarily dull, evidently unable to imagine that the wastelands overlord would actually charge out of the wastelands and even directly attack the Ancient Sword Sect mountain!\n “What did the Ancient Sword Sect do? To think that they actually drew the Ancient Dragon Ape out…”\n “These guys are normally so overbearing, heh heh, they must have provoked the Ancient Dragon Ape this time. This is truly their retribution.”\n “......”\n Whispers swiftly spread about. Although the Ancient Sword Sect was the undisputed boss of this area, as the saying goes, tall trees attract the wind. Naturally, quite a number of factions would secretly be envious of them. Usually, due to the Ancient Sword Sect’s overwhelming power, perhaps no one would dare to say anything, but now that they saw the Ancient Sword Sect fall into a dangerous situation, many were rejoicing at their misfortune.\n Lin Dong stoop on the mountain peak and looked around, discovering that the number of people who had been drawn by this disturbance was not small. However, no one showed any indications of stepping forward to aid. Upon witnessing this sight, he immediately sneered. Seems like the Ancient Sword Sect was not very likable at all.\n “Fight, the fiercer the better…” Lin Dong’s eyes turned towards the intense battle as he mumbled.\n “Boom!”\n Under countless gazes, the Ancient Dragon Ape’s fist, which was as heavy as a mountain, once again furiously slammed into the stone sword. A terrifying power directly compressing the air into an air cannon that was about three meters large. The air cannon ruthlessly landed on the Ancient Sword Sect mountain, instantly causing the mountain to tremble as numerous buildings were directly torn apart.\n “Evil creature, you dare!”\n Upon seeing this scene, the Ancient Sword Sect leader immediately howled furiously. His hand seals once again changed, moving the enormous stone sword, as it sent out an air ripping and formidable sword aura, which hacked towards the Ancient Dragon Ape.\n There was not technique in this kind of attack, only an extremely barbaric Yuan Power. In the face of this kind of attack, any technique would seem to become extremely lacklustre in comparison.\n “Clang clang!”\n The stone sword viciously chopped down. The assembled might of the Ancient Sword Sect in the stone sword was clearly extremely powerful. As it faced this attack, the Ancient Dragon Ape was actually forced back several steps.\n “Sect leader senior, quite a number of the disciple’s Yuan Power is about to be used up!”\n However, the Yuan Power demand for such a powerful attack was at an extremely frightening level. Thus, after a few chops, the grey haired elder hastily shouted out.\n Upon hearing this, the Ancient Sword Sect leader’s eyes darkened a little. With a wave of his sleeve, more than twenty thousand Pure Yuan pills few out from his Qiankun bag, before circling above the disciple’s heads.\n “Quickly refine them!”\n After hearing his shout, the crowd rapidly responded. Soon after, they swiftly sucked in the numerous Pure Yuan pills, before swallowing it into their bodies, and transforming it into vigorous Yuan Power.\n At this time, what they competed with was a kind of base, a base that was created from Pure Yuan pills!\n As tens of thousands of Pure Yuan pills was squandered, the disciple’s conditions improved by quite a bit. Immediately, they once again created a resplendent Yuan Power river.\n “We cannot let this battle with the beast keep dragging on!”\n The Ancient Sword Sect leader controlled the stone sword and continuously defended against the Ancient Dragon Ape’s attacks, as he shouted out. If this went on, it would consume too many Pure Yuan pills. Although their Ancient Sword Sect had some foundations, they could not so dubiously waste it in such a manner.\n “My two juniors, attack with me!”\n After hearing the Ancient Sword Sect leader’s stern shout, the grey haired elder duo’s hearts shivered. Soon after, they glanced at the Ancient Dragon Ape, which was becoming fiercer as it battled, before seriously nodding their heads.\n “All Ancient Sword Sect disciples, let your Yuan Power converge! Fight the enemy together!” The trio’s bodies slowly rose up, as a shout rang out in the sect. At this time, the cohesiveness of a sect was displayed. Many disciples, who were still panicking moments before, quickly swarmed towards the formation position, before urging out the Yuan Power in their bodies and pouring it into the Yuan Power river that was floating in mid-air.\n “Hua hua!”\n As such an enormous amount of Yuan Power was poured in, the Yuan Power river immediately swelled. In fact, even the faint sounds of water flowing was heard from it.\n Gazing at the strengthened Yuan Power river, the Ancient Sword Sect leader’s palm once again shook, as several tens of thousands of Pure Yuan pills flew out. Practically every Ancient Sword Sect disciple had a share, before they quickly refined it and once again poured out Yuan Power.\n “Hua la la…”\n Under numerous shocked gazes, a humongous Yuan Power River that was condensed from Yuan Power slowly floated up in the Ancient Sword Sect, as the Yuan Power of heaven and earth started to violently undulate.\n “Go!”\n The Ancient Sword Sect leader trio did their best to control the humongous Yuan Power river, as it screamed through the air and fused with the stone sword in the sky.\n Surging Yuan Power gathered on the stone sword, and in the end, a resplendent and heart palpitating light slowly spread out from the stone sword. In a few short breaths, the gigantic grey stone sword had become resplendent, and under this magnificence glow, an extremely terrifying power was hidden.\n A magnificent sword aura shot out from the huge sword like rays from the rising sun. Every ray was enough to easily decimate a perfect Yuan Dan stage practitioner. That kind of terrifying power caused many of the surrounding onlookers to be overwhelmed with horror. The fact that the Ancient Sword Sect was able to tower over everyone else for the last dozen years meant that they did indeed have some original and unique areas.\n “Great Ancient Sword Formation, Ancient Sword of the Sect!”\n On the sect mountain, a stern shout suddenly sounded out from the Ancient Sword Sect leader trio’s mouths. The seals in their hands changed, as the huge sword that was emitting multi colored light immediately whizzed forth, quick as lightning as it ferociously swept towards the Ancient Dragon Ape. Deep gorges that were hundreds of meters wide appeared wherever it passed through.\n Heaven and earth shook. Faced with the Ancient Sword Sect’s most powerful attack, a vigilant look flashed across even the huge scarlet eyes of something as strong as the Ancient Dragon Ape. Soon after, its fists heavily slammed onto its chest, emitting a deafening noise. At its forehead, the black dragon horn started to give off a strange black light.\n “Swish!”\n The resplendent huge sword was fast as galloping thunder. Many people could only see light flash across their eyes, when they once again concentrated, the huge sword was already about to reach the Ancient Dragon Ape.\n “Roar!”\n A savage roar was frantically let loose from the Ancient Dragon Ape’s mouth, as the black light on its dragon horn grew increasingly intense. In the end, a tremendous black light that was dozens of meters large shot out from the dragon horn with a bang, ruthlessly colliding against the huge sword in the sky.\n “Boom!”\n An indescribable loud noise rang out, as countless people’s ears seemed to go deaf at that moment. The land trembled, as huge cracks swiftly spread out on the ground.\n “Evil creature, be destroyed!”\n The veins on the Ancient Sword Sect leader trio’s faces shook, as they abruptly shouted out. Light burst forth, and the huge sword that had gathered the power of the whole Ancient Sword Sect, actually split apart the enormous black light, ferociously chopping onto the Ancient Dragon Ape’s body.\n “Clang!”\n Dazzling sparks shot outwards. In the face of such a powerful attack, the Ancient Dragon Ape’s body was actually pushed down till it bent a little, as a sinister looking wound appeared on its shoulder.\n “Roar!”\n The intense pain from its body completely evoked the Ancient Dragon Ape’s fury. Scarlet red crazily swirled in its huge eyes, as it extended a massive palm and grabbed the huge sword in front of it, before a fist frantically punched forth.\n “Bang bang bang!”\n On the ground, a huge hole that was dozens of meters wide was directly formed on the ground, and the light from the stone sword that lay within was forcefully scattered.\n “Ergh!”\n When the stone sword was injured, not only did the Ancient Sword Sect leader trio vomit out a mouthful of fresh blood, but even the numerous disciples’ faces turned much paler.\n “Boom boom!”\n After madly beating the stone sword, the Ancient Dragon Ape once again turned, taking huge steps as it moved towards the Ancient Sword Sect mountain. A furious roar boomed out like thunder.\n “Why is this evil creature so fixated on our Ancient Sword Sect!”\n Staring at the seemingly unbeatable Ancient Dragon Ape, the Ancient Sword Sect leader’s face turned increasingly green as he angrily said.\n “There seems to be something here that is drawing it to us!” The red haired elder muttered to himself for moment, before he suddenly declared.\n Upon hearing this, the Ancient Sword leader was taken aback. Soon after, he abruptly turned around and looked towards the grey haired elder, sternly inquiring: “Where exactly did that blood red fruit of yours come from?!”\n “This had nothing to do with the Ancient Dragon Ape! I snatched this blood red fruit from some kid!” In response, the grey haired elder’s face immediately paled, as he hastily replied.\n “Where did that kid obtain it from?” The red haired elder also shouted in a low voice.\n “I...I don’t know.” The grey haired elder sheepishly said.\n “Hand it over to me!” The corners of the Ancient Sword Sect leader’s eyes twitched for a moment, before he extended a hand, and the grey haired elder could only helplessly retrieve the fruit and offer it to the former.\n Holding the Thousand Beast Fruit, the Ancient Sword Sect leader’s expression turned increasingly ugly.\n “You fool, this thing clearly has the Ancient Dragon Ape’s brand on it. It must be here for this thing. You actually dared to bring it back to the sect!”\n The sect leader was so furious that his expression had turned a little sinister, and at this sight, the grey haired elder entire body shivered. He never expected that this calamity was actually caused by him.\n “What should we do?” The red haired elder asked.\n “Return that item to the beast at once. Or else, it will never give up!” The Ancient Sword Sect leader replied without the slightest hesitation. This was the only way to resolve this issue, or else, their Ancient Sword Sect would surely be gravely injured at the hands of this beast today.\n After speaking, he no longer hesitated, as his arm jerked forth. The Thousand Beast Fruit in his hand transformed into a red flash and flew towards that Ancient Dragon Ape. At the same time, he once again took control and recalled that stone sword. It hovered above the sect mountain, giving off the impression that it was ready for a bitter fight.\n The red flash that was the Thousand Beast Fruit was immediately swallowed by the Ancient Dragon Ape, as the scarlet red in its eyes gradually began to dim. However, it did not seem as if it was planning to retreat just yet. After it walked around the Ancient Sword Sect mountain, it saw that the giant stone sword was still pointed at it. Finally, as if it understood that this opponent before its eyes was somewhat hard to deal with, did it finally let out a disgruntled roar, before dragging its visibly injured body, and returning to the Ancient Wastelands with footsteps that shook mountains.\n When they saw that the Ancient Dragon Ape had finally retreated, every disciple of the Ancient Sword Sect deeply heaved a sigh of relief...\n “Hehe, the show has finally ended…”\n On a mountain peak nearby, Lin Dong casually stretched his back, as he glanced at the Ancient Sword Sect mountain, which was now in a mess. With a chuckle, he stepped on his sword, and slowly tailed behind the Ancient Dragon Ape’s massive body.\n Next, it was finally time for him to retrieve the Ancient Dragon Ape’s essence blood.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-236","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n \n Official Sypnopsis\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \n 武之极，破苍穹，动乾坤！\n On the Journey of Cultivation, \n One must steal Ying and Yang, \n Sieze the Laws of Creation, \n Reach for Nirvana, \n Obtain Mastery over Life and Death, \n and Power over Reincarnation.\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
