{"id":61415,"no":1659,"title":"Chapter 348 Lin Dong’s Return!","content":"Chapter 348 Lin Dong’s Return!\n As she watched Lin Feng’s aura suddenly become berserk, Qingtan’s pretty face slightly changed while her icy voice sounded out: “You plan on violating the rules?”\n According to the rules, any pills or foreign objects that amplified one’s power was banned in the clan gathering and one needed to rely on one’s own strength for every battle. Lin Feng’s actions were undoubtedly breaking the rules.\n “Heh heh, it’s not use if you’re the only one that sees it!”\n Upon hearing this, Lin Feng laughed maliciously. Soon after, he cast a glance at the middle-aged referee at the side. The latter’s expression fluctuated for a moment before slowly taking two steps back. Although Lin Feng’s actions were against the rules, he had done it exceptionally stealthily. Except for him and Qingtan, who had seen him swallowing the pill, everyone else was unable to clearly see anything due to their angle.\n Lin Feng had some status in the Lin Clan, plus, he even had some relationship with Lin Langtian. Hence, this caused the referee to not dare to offend him, and thus choosing to close an eye in the end.\n When she saw his actions, fury flitted across Qingtan’s beautiful eyes. These clan members were indeed big condescending bullies.\n “Lin Qingtan, there are no grudges between you and me. If you want to blame someone, blame that trash, Lin Dong, from your Yan City branch family. To actually dare to offend big brother Lin Langtian. Heh, he should take a look at himself, trash like him daring to fight with big brother Lin Langtian, truly foolish and reckless!” Lin Feng slowly stood up, his hand clenching as traces of faint black cold qi was forced out from his body, while he stared at Qingtan and sneered.\n “You’re courting death!”\n When she heard Lin Feng insult Lin Dong, an ice-cold killing intent immediately flitted across Qingtan’s pretty eyes. She was now no longer the little girl that needed Lin Dong’s protection for every matter!\n “My strength can temporarily reach the half-step-to Manifestation stage, although the repercussions will cause me to be bedridden for half a year, as long as I can complete big brother Lin Langtian’s task, the benefits I obtain will be countless times greater than the loss!” Lin Feng laughed as specks of scarlet red dotted his eyes. Evidently, he was using the power of the pill to forcibly squeeze out all the energy in his body.\n “Admit defeat, such a pretty lass, I am truly a little unwilling to hurt you.” Lin Feng’s eyes were somewhat lustful as they swept across Qingtan’s exquisite and fine body.\n Qingtan’s face was ice-cold while her pupils silently stared at Lin Feng. Without speaking, her lily-white hand lightly twirled as faint black ice cold Yuan Power suddenly gushed out of her body.\n These cold yin Yuan Power were like dancing black pythons as they twisted around Qingtan’s body. While revolving, they emitted waves of astonishing Yuan Power.\n “Extreme Frost Freezing Heaven Palm!”\n The faint black cold yin Yuan Power screamed. Qingtan’s palm furiously thrust out, immediately causing vigorous Yuan Power to gush towards her, directly transforming into a gigantic ice dragon that was several tens of meters large. With a sky-shattering howl, it brought with it an ice-cold bone-cutting cold qi as it charged towards Lin Feng.\n “Crack crack!”\n Layers of ice started to form wherever the gigantic ice dragon passed, while a formidable cold aura spread outwards.\n “Humph, I’ve said it before, the current me is already able to match a half-step-to Manifestation practitioner. How can you possibly fight me?” Lin Feng looked down from above at the incoming ice dragon as mockery flitted across his eyes. His hand abruptly grabbed out as a giant Yuan Power hand took shape at the center of his palm and firmly grabbed the ice dragon.\n “Explode!”\n The Yuan Power hand suddenly gripped, instantly causing the ice dragon formed from Qingtan’s cold yin Yuan Power to explode into cold mist.\n The current Lin Feng was like a war god, every gesture of his was filled with extremely overwhelming power. This scene drew many odd looks, and several people were guessing why Lin Feng’s strength had suddenly soared.\n Among them, some were able connect the pieces together but no one said anything. After all, compared to Lin Feng, some of the branch family members’ status were too low and it was not worth it for them to speak and offend those of the main clan.\n On some golden seats in front of the battle arena, a young figure sat. He was the youngest person there but the surrounding people were not the least bit dissatisfied with the fact that he could sit there. Because, he was Lin Langtian. The most dazzling son of heaven in the current Lin Clan!\n At this moment, Lin Langtian unenthusiastically cast a glance at the arena Lin Feng was at. After Lin Feng consumed the pill he had been given, Lin Langtian knew that the fight was already over.\n The three participants from the Yan City branch family will be eliminated in the first round. This would undoubtedly cause them to become the most humiliated and useless branch family in this clan gathering.\n Lin Langtian gently held the teacup in front of him as the corners of his mouth lifted in a sinister manner. Lin Dong, a member from a petty and low branch family, dared to futilely challenge him?\n It was likely that he did not even have the guts to show up today!\n ...\n “Cold Bone Corroding Poison!”\n When the ice dragon exploded, a soft groan sounded out from Qingtan’s mouth as she took a small step back. Soon after, her hand seals once again changed as the cold mist from the explosion actually rushed towards Lin Feng once again. Moreover, the mist aimed to tunnel into the pores all over his body.\n “Useless actions!”\n However, Lin Feng merely sneered and shook his head at Qingtan’s valiant resistance. His foot stamped on the ground as a violent Yuan Power hurricane swept forth, forcibly dispersing the cold qi that was surging towards him.\n The situation in the arena had practically reversed in an instant. The originally losing Lin Feng had swiftly turned the tides and gained an absolute upper hand.\n “How is this possible! How could Lin Feng’s aura have suddenly become so much stronger!” Lin Mang gnashed his teeth, ashen faced as he watched the sudden reversal in the arena.\n “Lin Feng must have used some method to increase his power!” Lin Xiao’s face was also a little ugly. If Qingtan lost, they would become the first branch family to be completely defeated in this clan gathering.\n “Father, what now?” Lin Ken also wore an anxious expression as he asked.\n Lin Zhentian slowly shook his head, his old face seeming much older in this moment. His voice was somewhat hoarse as he replied: “Someone is deliberately embarrassing us, there’s nothing we can do…”\n Now, he was already completely certain that someone had set this up. Or else, it was not possible for the Qingtan trio to meet such troublesome opponents in the first round. Moreover, these opponents were all from the main clan.\n Upon hearing this, Lin Xiao and the rest turned silent as rage boiled in their eyes. They had put in god knows how many years of effort into the clan gathering this time. Could it be that they will still fail this time?\n ...\n “If this is all you have, the match today will end in my victory.” Under the attention of numerous gazes, Lin Feng gazed down upon Qingtan and faintly laughed. He no longer had any plans of dragging this out as his current state could not be maintained for long. If any change occurred due to him dragging this on, it would definitely draw Lin Langtian’s fury, something that Lin Feng was rather terrified of.\n Having made this decision in his heart, an icy look flashed in Lin Feng’s eyes. Soon after, his hand clenched as formidable and berserk Yuan Power screamed out of his body.\n These Yuan Power gathered in front of Lin Feng, once again transforming into a dragon elephant in the blink of an eye. However, this time, the size of the dragon elephant had grown several times, and its body was increasingly concentrated and solid. Evidently, its power was far from when it had been displayed previously!\n “Dragon Elephant Overlord Fist!”\n The dragon elephant took shape as Lin Feng roared. As his fist flew forward, the air above the arena instantly exploded. The explosions up in the air left hole after hole on the arena below.\n In the face of Lin Feng’s ferocious without equal attack, Qingtan tightly bit her red lips. Her slim lily-white hands swiftly changed as a circle of faint black cold yin Yuan Power flowed out, condensing into a gradually blossoming ice lotus above her.\n “Bang!”\n The titanic dragon elephant fist descended, ruthlessly slamming into the ice lotus, but this time, the ice lotus did not achieve the effect it had before and instead started to crumble under the formidable force.\n “Break!”\n In mid-air, Lin Feng coldly shouted as the ice lotus immediately burst apart, transforming into cold mist that drifted away.\n “Urgh!”\n When the ice lotus broke, a soft groan sounded out from Qingtan’s mouth, but she still stubbornly stood on the spot, unwilling to retreat.\n “Since are not going to admit defeat, don’t blame me for being vicious!”\n Upon seeing Qingtan’s stubborness, Lin Feng’s eyes turned cold as the dragon elephant fist descended once again. This time, it viciously slammed towards Qingtan’s elegant figure.\n “Elder brother Lin Dong, are you still not going to show yourself?!”\n As Qingtan watched the incoming formidable fist force, she did not immediately move to defend herself. Instead, gently lifted her tiny head, looking at the sky as her lovable voice shouted out.\n “Lin Dong? Humph, even if he is really here, I’m afraid he won’t have the balls to appear!” Lin Feng sneered.\n However, just as his voice fell, a hearty thunder-like laughter boomed over from the distance, bringing with it sky-shattering Yuan Power undulations and a tyrannical aura, appearing in the sky above the battle arena in the blink of an eye under countless gazes.\n “Haha, don’t worry. With I, Lin Dong, here today, no one can hurt you!”\n Yuan Power that filled the sky screamed, after which, a shooting star flew over. Countless people watched as a young figure appeared in the arena like a ghost.\n “Dong-er?!”\n The instant that figure appeared, wild delight arose in the eyes of Lin Zhentian, Lin Xiao and the rest, while their bodies trembled with emotion. The person they had been waiting for had finally arrived!\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-348","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n \n Official Sypnopsis\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \n 武之极，破苍穹，动乾坤！\n On the Journey of Cultivation, \n One must steal Ying and Yang, \n Sieze the Laws of Creation, \n Reach for Nirvana, \n Obtain Mastery over Life and Death, \n and Power over Reincarnation.\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
