{"id":61798,"no":2042,"title":"Chapter 729: Static Tablet","content":"Chapter 729: Static Tablet\n In the bamboo house, after his initial hesitation, Lin Dong’s finger finally landed in front of the cluster of light that held the wooden tablet.\n “Are you certain?” Ying Xuanzi gently smiled and asked.\n “Yes.”\n Lin Dong nodded. Since he had already made up his mind, he no longer had any misgivings. Although high grade Heavenly Soul Treasures were rare, it did not reach the extent where he was unable to abandon it.\n Upon seeing that Lin Dong had ceased hesitating, Ying Xuanzi also laughed faintly. He waved his sleeve and kept the other two light clusters into his sleeve. After which, he extended his hand and the black wooden tablet also slowly landed in his palm.\n Following the disappearance of the light on the wooden tablet, Lin Dong finally discovered that the surface of the tablet seemed to be covered in some extremely obscure and mysterious symbols. These symbols appeared to possess a life force and actually slowly rotated on the wooden tablet.\n “Sect master, what is this thing? What use does it have?” Lin Dong carefully inquired.\n “Static Tablet.” Ying Xuanzi replied faintly.\n “Static Tablet?” Lin Dong was startled. His face was at a loss.\n “In ancient times, there was once a divine item known as the Static Divine Tablet. Once it was activated, it would be able to immediately freeze time and space. Those who were trapped within would no longer have the ability to resist and hence will be at the mercy of others.” Ying Xuanzi played with the black wooden tablet in his hand. Even for someone like himself, there was an admiration that could not be hidden within his eyes when mentioning this so called ‘Static Divine Tablet’.\n “Oh?”\n Lin Dong was moved. To think that the so called ‘Static Divine Tablet’ was actually so frightening that it could even cause time to stand still? Just how terrifying was such an ability?\n “What relationship does this Static Tablet have with it?” Lin Dong\u0027s eyes rotated as he asked the question that he was most concerned about.\n “The Static Tablet is a Soul Treasure that was created by copying the ‘Static Divine Tablet’... do you really think that my Dao Sect actually possess such a divine object?” Ying Xuanzi laughed.\n “So, it is an imitation…”\n Lin Dong rubbed his nose. However, he was not disappointed. This was because he did not possess the wishful thinking that he would be able to obtain such a legendary divine object with such ease.\n “However, even though it is a mere imitation, this Static Tablet is still able to surpass most high grade Heavenly Soul Treasures. Of course, it has not reached the level of a Pure Yuan Treasure. It can only be said to be between these two levels.” Ying Xuanzi said.\n Lin Dong nodded. A Pure Yuan treasure was considered an important treasure even within these super sects. Yet, this Static Tablet was merely an imitation. Regardless of how powerful it was, it was likely difficult for it to reach the level of a Pure Yuan treasure.\n “Additionally, this Static Tablet might not posses the frightening strength of the real deal, but it is able to cause the opponent to be immobile for an instant when it is activated. I think that during a battle between experts, such an instant should be sufficient, right?” Ying Xuanzi smilingly said.\n Lin Dong nodded excitedly. In a fight between the strong, any opening was fatal, much less directly causing the opponent to unexpectedly freeze. If he possessed this ‘Static Tablet’ before he exchanged blows with Wang Yan, it was likely that the process of the battle would have been much more relaxed.\n “Little fellow, you have good eyes. Take it. One requires Mental Energy to activate this treasure. However, you possess quite a great achievement in terms of Mental Energy. It will likely not be a problem.” Ying Xuanzi laughed and threw the ‘Static Tablet’ in his hand towards Lin Dong.\n “It is an object without an owner. I have already helped you remove the obstructions to refining it. You will be able to use it once you refine it with blood.”\n Lin Dong hurriedly extended his hand and received it. The black wooden tablet felt warm when it entered his hands. After touching it carefully, he found that it was neither wood nor metal. He was uncertain of just what it was made of.\n Upon receiving the Soul Treasure, Lin Dong unceremoniously pressed the tip of his finger, and a drop of fresh blood fell onto the Static Tablet. After which, a faint light scattered from it. A kind of vaguely present relationship quietly rose within Lin Dong’s heart.\n The light on the Static Tablet became increasingly bright. At the end, it actually slowly floated. Finally, it transformed into a ray of light that directly entered Lin Dong’s forehead and disappeared.\n Lin Dong’s eyes slowly shut when the Static Tablet shot into his forehead. His mind swiftly entered his Niwan Palace. Within the small world, where Mental Energy whizzed by, he saw the black wooden tablet quietly floating within. Mental Energy slowly rotated around it like a wave, while threads of Mental Energy continued to pour in. Under this infusion of Mental Energy, Lin Dong could sense the various mechanisms within this Static Tablet and began to gradually become familiar with them…\n Lin Dong shut his eyes for two full hours. During this time, Ying Xuanzi did not rush him at all. All he did was to sit quietly like an old monk.\n Hu.\n The sunlight outside of the window gradually became dim as those tightly shut eyes of Lin Dong were finally slowly opened. A mysterious light flickered within both his eyes. Finally, he suddenly extended his hands and slowly formed a relatively strange seal.\n “Still!”\n Lin Dong’s eyes looked towards a butterfly flying at the window. The strange seal formed by his hands suddenly aimed at it. After which, a soft voice emerged from his mouth.\n Buzz!\n When that word was emitted from Lin Dong’s mouth, an invisible and extremely mysterious fluctuation suddenly swept out from the spot between Lin Dong’s brows.\n When that fluctuation erupted, the flapping wings of the butterfly dancing outside of the window suddenly froze. Its entire body appeared to have been embedded within the crevice of space and time. An extremely mysterious scene.\n However, this unusual scene did not last for long before it was shattered. The butterfly also flapped its wings from shock as it swiftly fled from this place.\n “Such a mysterious Static Tablet…” Lin Dong’s gaze was burning. He licked his lips and laughed.\n From a certain point of view, this Static Tablet did not possess an overly strong killing power. However, this strange ability to cause something to freeze made Lin Dong’s heart beat harder. It was likely that he would be extremely miserable if his opponent had such an ability in a life and death battle.\n “However, it exhausts too much Mental Energy…” Lin Dong added somewhat regretfully. He had merely used the stilling ability for a couple of breaths earlier, but the consumption of his Mental Energy had reached quite a frightening level.\n “How can there be something completely perfect in this world…” Ying Xuanzi laughed.\n Lin Dong nodded his head as he laughed dryly. He was indeed too greedy. This ability to freeze something was already so frightening. It would truly be far too unrealistic if one could use it as he pleased.\n “It is good that you like this thing. Actually, according to the rules, even the champion of the Hall Competition cannot obtain this Static Tablet…” Ying Xuanzi spoke with a deeper meaning to his words.\n “Heh heh, in that case, I will thank sect master for your generosity.” Lin Dong caught the hint. He understood that if he had not stopped Wang Yan and finally handed the commanding authority back to Ying Xiaoxiao on his own accord, it would be quite difficult to obtain something like the Static Tablet…\n Ying Xuanzi involuntarily smiled. Soon after, he spoke again, “There is another half a year before the Great Sect Competition. All of you should pay more attention when that time comes.”\n When he spoke until the end, that jadelike face of Ying Xuanzi had a frightening darkness flashing across it.\n “Are the disciples of the Yuan Gate very strong?” Lin Dong knitted his brows and asked.\n “The strongest of the Yuan Gate disciples are the three little kings and the eight soul generals…” Ying Xuanzi slowly explained.\n “Three little kings, eight soul generals…” Lin Dong muttered.\n “The Yuan Gate is divided into eight sections. These eight soul generals are the strongest disciples within the eight sections. As for the three little kings…” Ying Xuanzi curled his mouth. Only then did he continue, “There are all considered to have been personally taught by the three sect masters of the Yuan Gate. All of them possess monstrous talent. They can be considered the most outstanding amongst the younger generation of the Eastern Xuan Region…”\n Lin Dong’s pupils shrunk a little. A cool air was slowly inhaled within his heart. Clearly, he did not expect that the so called three little kings would have such overwhelming backgrounds. The three sect masters of the Yuan Gate were the top level experts in the Eastern Xuan Region. Just how strong were those who had been personally taught by them?\n “If you end up meeting them during the Great Sect Competition, you must definitely be careful.” Ying Xuanzi warned. Immediately, he laughed faintly and said, “However, you need not be overly afraid. Back then, Zhuo Tong had gathered a group of friends during the Great Sect Competition and ended up killing one of the three little kings from the Yuan Gate, severely injuring another and causing the last to flee.”\n Lin Dong was stunned and speechless. This senior Zhou Tong was indeed an extremely ferocious person. No wonder he possessed such a great reputation within the hearts of the Dao Sect disciples. Such a series of achievements caused him to feel his blood boil a little after listening to them.\n “This disciple understand.”\n Lin Dong nodded and engraved Ying Xuanzi’s words in his heart. It seemed that this Great Sect Competition was indeed not just an ordinary competition.\n “You should train properly during this period of time. There is no need for all of you to stand out during the Great Sect Competition. All you need to do is to try and protect the other disciples…” Ying Xuanzi waved his hand and said.\n “Understood.”\n Lin Dong did not remain any longer after seeing this. He cupped his hands together in a respectful manner, before turning around to leave.\n Ying Xuanzi watched the young man’s back as he left. His hand gently rubbed the table. He appeared to be able to see a small semblance of Zhou Tong’s figure on Lin Dong. The both of them possess an extremely shocking talent. However, he did not know whether this Great Sect Competition would end up being a little different because of Lin Dong’s appearance…\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-729","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n \n Official Sypnopsis\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \n 武之极，破苍穹，动乾坤！\n On the Journey of Cultivation, \n One must steal Ying and Yang, \n Sieze the Laws of Creation, \n Reach for Nirvana, \n Obtain Mastery over Life and Death, \n and Power over Reincarnation.\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
