{"id":59962,"no":206,"title":"Chapter 206: Thunder Crystal Beast","content":"Chapter 206: Thunder Crystal Beast\\n\\n Lin Dong stood at the top of a mountain covered by a strange stone forest, as his gaze alternated between two places in a distance. Within these two general directions, were a great number of presences.\\n\\n “I did not expect that the Dayang Province’s factions would be so strong. Although I do not know what kind of status the Di and Liu Families possess, the strength possessed by these two factions far surpasses that of Yan City’s factions…” As Lin Dong gazed towards the two directions, his eyebrows slightly furrowed. The power of either one of these two families far surpassed the so-called Blood Wolf Gang, such that even the Yan City governor faction was not that much stronger too.\\n\\n Over these two days, Lin Dong had closely tailed the Di Family troops. With the aid of his powerful Mental Energy, he had managed to avoid detection by Di Teng.\\n\\n Along the way, Lin Dong was also shocked to discover just how powerful these two families were. This caused him to gasp in surprise, as this kind of lineup was extremely rare in Yan City.\\n\\n “The Liu Family also has an initial Form Creation stage practitioner. Together with several perfect Yuan Dan stage practitioners, there is not much of a difference between them and the Di Family. If these two parties were to fight with each other, it would definitely become chaotic and that shall be my chance.” Lin Dong mumbled to himself. If one of these two families was too domineering, he would not be able take advantage of them.\\n\\n “That so-called Thunder Crystal Beast should be in that mountain…” Lin Dong’s eyes turned towards the spot in front of both groups. A steep mountain stood there as a faint silver glow bathed the mountaintop. One glance was all Lin Dong took to realize that the silver glow was actually some kind of circulating lightning. Over this period of time, he had absorbed quite a substantial amount of Lightning Power, and hence he was exceptionally sensitive towards it.\\n\\n Furthermore, from within the mountain, Lin Dong could also sense an aura that was as violent as lightning itself. This aura caused all the hair on his body to stand on its ends. If he was not mistaken, that was the current target of the Di and Liu Families; the Thunder Crystal Beast.\\n\\n “This Thunder Crystal Beast’s strength should be at advanced Qi Creation stage. From the looks of it, its aura seems extremely unstable and it should be about to advance one cultivation stage. If it successfully advances, it would be comparable to a Manifestation stage practitioner. At that time, practically no one in the Great Yan Empire would be able to match it.” Little Marten’s gaze swept around as it smiled and said.\\n\\n “Fortunately, each time it rank up, there will be a period of time where it becomes vulnerable. That is the best time to make a move. Of course, if that was not the case, the Di and Liu Families would definitely not dare to make a move on it. After all, even a Qi Creation stage Thunder Crystal Beast is not something to be trifled with.”\\n\\n Lin Dong nodded his head and asked: “When will that Thunder Crystal Beast rank up?”\\n\\n “In less than two days’ time.”\\n\\n “Heh, two days…” Upon hearing this, Lin Dong softly chuckled. Soon after, he sat down beside a boulder and casually retrieved a piece of dry meat from his Qiankun bag and tossed it to Little Flame. Since this was so, he would wait.\\n\\n ...\\n\\n In an area northwest of Lin Dong, a campsite was set up. Quite a number of people shuttled back and forth within it, and from time to time, scouts appeared from the forest and scuttled into the huge tent in the middle.\\n\\n There were about a dozen figures in this tent and each of them gave off a formidable aura, especially the man in the center. The man’s face was red and he had a white beard. Though his face seemed somewhat aged, a formidable glint shimmered in his eyes and no one dared to stare at him directly.\\n\\n “Family head, the Di Family has also brought activated quite a number of troops this time, and even Di Teng has personally come. Looks like the Thunder Crystal Beast is a must-have for them.” Within the tent, one of the scouts respectfully reported.\\n\\n Upon hearing this, the white bearded elderly man nodded his head in an indifferent manner, not surprised at all by this news. His gaze swept across the tent as he said: “Relay these instructions, wipe out all the Demonic Beasts in the vicinity of the Thunder Origin Mountain. If you encounter anyone, no matter who he is, expel him immediately. If he does not obey, kill him!”\\n\\n “In addition, make sure to have eyes on the Di Family at all times. The Thunder Crystal Beast should advance within these two days. At that time, we must immediately take action!”\\n\\n The elderly man’s words were filled of murderous intent and did not contain the slightest bit of hesitation. Evidently, a vicious and merciless family head.\\n\\n “Yes!”\\n\\n Upon hearing his instructions, the numerous practitioners in the tent did not dare to be the least bit slow as they orderly replied\\n\\n “Di Teng, humph. It is will not be so easy for you to snatch the thunder source from my Liu Family!” After seeing their response, the white bearded elderly man icily chuckled.\\n\\n While these matters were occurring at the Liu Family side, scouts also frequently moved about at the Di Family area. From the looks of it, their intention was similar to the Liu Family. It seemed like an intense exchange would definitely break out between the two powerful factions of Dayang Province this time.\\n\\n In the meantime, Lin Dong happily observed the two parties while hidden in a secret place. The fiercer the fight between the two, the greater his chances.\\n\\n ...\\n\\n Two day’s time passed in a blink of an eye. In this short period of time, several conflicts had already occurred in this area. Naturally, the two culprits were the Di and Liu Family. Though it were only small scale conflicts, they did suffer some casualties as well. At the same time, this caused the atmosphere between them to turn increasingly tense. If it were not for the fact that the Thunder Crystal Beast was about to rank up, both parties would have likely fought already.\\n\\n And in this two day’s time, Lin Dong had remained at his original spot. Furthermore, he had intentionally cut back on his cultivation period in order to create as little waves as possible, in case the Di or Xie Family uncovered his presence.\\n\\n As he quietly waited in hold, that critical moment eventually arrived stealthily...\\n\\n ...\\n\\n “Grumble!”\\n\\n Lin Dong stared at the layers of storm clouds that suddenly emerged in the sky, as a bewildered expression filled his eyes. He could sense that this storm actually stared from that mountain top. That implies that the Thunder Crystal Beast could actually cause a storm. It was truly a magical beast.\\n\\n “It is about to rank up…” Seated on Lin Dong’s shoulders, Little Marten stared at the storm clouds surrounding the mountain peak, as it somewhat eagerly commented.\\n\\n Instantly, Lin Dong’s eyes turned slightly feverish. As he looked towards the horizons, several presence at that area had immediately exploded as numerous figures leapt on top of the woodlands. As they bided their time, they looked somewhat eagerly at the storm clouds gathering in the sky.\\n\\n Standing in front of both factions, were two figures. One of them was Di Teng, that Lin Dong had already encountered. Meanwhile, the other figure was an elderly man with a white beard. That man was likely the patriarch of the Liu Family and based on his aura, he was evidently an initial Creation stage elite practitioner.\\n\\n “The Di Family has an initial Creation stage practitioner as well as six perfect Yuan Dan stage practitioners. Their lineup is similar to the Liu Family…” Lin Dong’s eyes swept across the woodland before he involuntarily swallowed his tongue. Even if he counted every perfect Yuan Dan stage practitioner in Yan City, they would still lose out to the Di Family. It seems like this Yan City’s strength is hardly worth mentioning in the context of this entire Great Yan Dynasty.\\n\\n “Boom!”\\n\\n As Lin Dong closely observed the movements occurring below him, the storm clouds in the sky began to rumble violently. Large lightning snakes began to course through maniacally, as they brought forth earth-shattering thunder roars.\\n\\n Lin Dong stared somewhat greedily at those lightning snakes. However, this time, he did not dare to blatantly draw these lightning bolts. After all, just as short distance away, there was the Di and Liu Family.\\n\\n “Growl!”\\n\\n As the storm clouds began to rumble increasingly violently, suddenly, within that giant mountain, a exceptionally clear roar echoed forth. This echo was quite peculiar as it seemed just like thunder as well as a lion’s roar mixed together. Together with the thunderous roars, it began to spread forth.\\n\\n When they heard this roar, everyone’s eyes started to gleam, as they tightly gripped onto the weapons in their heads.\\n\\n After that first roar, a series of roars continuously echoed forth. Each time a roar sounded out, the storm clouds in the sky will vibrate even more vigorously. It was as if somewhat was being brewed.\\n\\n As lightning filled the skies, from time to time, giant thunderbolts descended from the sky and landed into the vast woodlands, causing black smoke to emerge.\\n\\n “Boom!”\\n\\n Another lightning bolt flew down. However, this time, it directly struck that mountain peak. Soon after, the mountain peak begun to vibrate as an resplendent silver glow exploded forth from the mountain, just like a glowing light column, before it directly hit the storm clouds in the sky.\\n\\n Lin Dong’s eyes twinkled as he stared directly at that light column. Faintly, an enormous Demonic Beast surfaced in his vision.\\n\\n That enormous beast was gleaming in silver throughout its body, as electrical consciously coursed through its body. As electrical sparks exploded from time to time, it generated a powerful energy shockwave. Moreover, the skin of this enormous giant beast was no ordinary fur coat. Rather, it seemed like a crystal armour. It was truly a peculiar sight.\\n\\n That crystal beast stepped onto that light column. It’s four hooves was just like a mountain as they seemed exceedingly sturdy and heavy. With thunderous wings on it’s back, a resplendent lightning glow shimmered in it’s mouth. It seemed like every time it opened its mouth, it could easily shoot out an exceedingly powerful lighting beam.\\n\\n Amongst every Demonic Beast that Lin Dong had encountered before, it’s appearance and aura was simply most terrifying and powerful. Just based on its appearance alone, everyone knew that this Demonic Beast was a truly unique one.\\n\\n “Thunder Crystal Beast!”\\n\\n As they stared at that fearsome beast inside that light column, a flurry expression instantly exploded in Di Teng and the rest’s eyes. After all, this was the first time that they saw such a legendary creature.\\n\\n “Is this the so-called legendary Thunder Crystal Beast. It is indeed different from any ordinary Demonic Beast…” Lin Dong was similarly taken aback by that creature’s extraordinary appearance, as he deeply sucked in a breath of air and exclaimed in shock.\\n\\n “In the past, I’ve encountered a Thunder Crystal Beast which was countless times more powerful. Heh heh. That is the one that could truly be called formidable. Before it, even a Nirvana stage practitioner was merely a snack…” Little Marten smacked its lips and chuckled.\\n\\n Lin Dong was speechless. The Nirvana practitioner, which was practically a legend in the Great Yan Empire, became akin to a wild chicken that was to be eaten whenever one pleased when Little Marten talked about it...\\n\\n “Boom!”\\n\\n While Lin Dong was speechless, the violently surging thunder clouds in the sky suddenly shrunk, as an enormous thunderbolt ruthlessly poured down onto the Thunder Crystal Beast’s huge body.\\n\\n “Is it about to advance in rank!”\\n\\n Upon witnessing this scene, Lin Dong’s heart immediately turned nervous.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-206","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
