{"id":61859,"no":2103,"title":"Chapter 790 : Yang Brothers","content":"790: The Yang Brothers\n From atop the valley, Lin Dong gazed into the valley before focusing on the rainbow pond. Astonishment flashed within his eyes. Evidently, he never imagined that there would actually be such pure energy within the demonic energy filled Unique Devil Region...\n “It is said that a powerful practitioner from ancient times had died here. The practitioner’s bones sunk into the land and prevented the demonic energy’s encroachment. At the same time, this Supreme Purity Celestial Pond was formed.” Ling Qingzhu’s soft voice rang out from the side.\n “There is a demon guarding this place and it is very powerful.” Lin Dong said as he shifted his gaze towards the front of the Supreme Purity Celestial Pond. Entrenched on the dark ground was a gigantic black monster snake. This snake had three heads and its fierce and sharp fangs glistened with a cold glint. Saliva dripped from them, corroding the rocks below them.\n From the body of the three headed monster snake, Lin Dong was able to feel an extremely malevolent energy fluctuation. According to his estimates, the strength of this monster snake was perhaps not the least bit weaker than Lei Qian, who was half a step into the Profound Life stage.\n “This thing is rather hard to deal with. However, on the bright side, these demons are not intelligent and only know how to instinctively hunt and kill. This makes it easy to lure them way.” Lin Dong muttered.\n “Yes.” Ling Qingzhu nodded her head. She knew that tangling with a demon that was not afraid to die would only lead to trouble. If it was not thoroughly dealt with, it would never give up.\n With a wave of his sleeve, the demon corpse appeared in a flash. Just as he was about to control it to lure away the monster snake in the valley, he suddenly frowned and shot a look towards the darkness behind him from the corner of his eye.\n “What is it?” sensing Lin Dong’s change, Ling Qingzhu could not help but ask.\n “Nothing…” after hesitating for a while, Lin Dong shook his head. With a thought, the demon corpse shot out. A fist blasted forward, bringing along a swift and fierce force as it violently smashed into the body of the monster snake.\n Bang!\n A deep sound rang out. The originally hibernating monster snake suddenly opened its scarlet eyes, before furious hisses emerged from the three snake heads. Following which, a black ray of light which contained an intense aura of corrosion shot towards the demon corpse.\n The demon corpse dodged in midair, completely evading the black ray. Turning around, it proceeded to flee the valley.\n Hisss!\n In response to the fleeing demon corpse, the monster snake roared furiously towards the sky. It was obvious that it was not intelligent enough to think. Directly relying on its instinctive rage, it waved its tail and gave chase to the demon corpse in a flash.\n Rumbling noises rapidly resounded from the valley before fading in the distance.\n “It’s settled…” upon seeing this, Lin Dong smiled and clapped his hands. Nodding his head towards Ling Qingzhu, the two continued forwards and descended to the edge of the Supreme Purity Celestial Pond.\n Bending down, Ling Qingzhu extended her hand into the water. As she felt the special energies that permeated the water, a joyous expression flashed across her face.\n “Could you… help me guard the valley entrance for some time?” asked Ling Qingzhu. Raising her head, a bashful expression which had an utmost flavor of a delicate girl flashed past those clear and pure eyes.\n “Eh… alright.” Lin Dong gawked. After understanding her reason, Lin Dong laughed dryly before turning around and heading off.\n As she watched the Lin Dong’s leaving figure, Ling Qingzhu gave a gentle sigh of relief. She removed her veil, and was just about to remove her clothes and enter the pond when a hand suddenly extend from behind her, preventing her from continuing.\n “You!”\n This sudden turn of events caused Ling Qingzhu to be alarmed. She hurriedly turned her body, and saw Lin Dong who had circled and returned. Instantly, an angry scowl appeared on her beautiful face.\n “We’re being targeted.” without waiting for Ling Qingzhu to vent her anger, Lin Dong slowly said. His eyes were focused on the darkness outside the valley.\n “What?” after hearing these words, Ling Qingzhu immediately knitted her eyebrows. An indistinct cold glint started to flow within her her clear pupils.\n “After sneakily following us for so long, it should be time for the two of you to reveal yourselves right?” As he stared at the darkness in the distance, Lin Dong said in a deep voice.\n At the beginning, he had faintly felt that something was wrong. This feeling was extremely minute to the point where he assumed it to be a misconception. However, just as Ling Qingzhu was about to remove her clothes and enter the pond, he was finally able to sense those very faint presences in the distant darkness,\n “Since you don’t want to reveal yourselves, I can only force you out.”\n Lin Dong gazed at the still peaceful darkness before him, as a cold glint flashed past his eyes. Bending his palm, green light condensed to form two razor sharp scales, that transformed into green flashes as they shot out explosively.\n Clang clang!\n The scales shot into the darkness, and a clear ringing sound resounded out immediately. Sparks erupted, as the foliage of the dark forest shook. In the next instant, two figures shot out under Lin Dong and Ling Qingzhu’s cold gazes.\n “Heh heh, this brat is quite sharp.” at the entrance of the valley, the two men looked down from above at them and said with a strange smile.\n Lin Dong’s gaze turning extremely gloomy as he stared at the two men before him. Both of them were wearing black robes, while their appearances had some similarities. It would appear that they were siblings. The appearances of the two men was not bad, however those pair of long and narrow eyes continuously wandered around Ling Qingzhu’s alluring body. The smiles that appeared on their faces added a trace of obscenity to them.\n “Such a beautiful lady. The number of girls that we brothers have seen are too many to count, however, this one is the best…” the greedy gaze of one of the men rested on the extremely cold face of Ling Qingzhu before saying with a giggle.\n “We originally felt the energy fluctuations of this place. Never did we imagine that we would have such a harvest...” the other man added on with a strange grin on his face.\n Lin Dong’s eyes brimmed with gloominess as he looked towards the two rather loathsome men. The fluctuations radiating out from their bodies indicated to him that they were experts who were half a foot into the Profound Life stage. This meant that they were not the least bit inferior to Lei Qian.\n However, this did not raise a single bit of dread from him, which led him to stare at them with chilling intent in his eyes. A sinisterly icy voice slowly rang out from his mouth, “ If you don’t want to die, scram.”\n Atop the valley wall, the two man in black robes faintly narrowed their eyes, as sinister intent erupted from them. They glared at Lin Dong in a chilling manner and grinned, “ A brat at the eight Yuan Nirvana stage actually dares to utter such words in front of us. You truly don’t know how high the heavens and how deep the earth is.”\n “Beauty, this brat can’t protect you with just that little bit of ability. Why not follow us brothers. At that time, you can enjoy the Supreme Purity Celestial Pond as well, heh heh.”\n Hearing the frivolous teasing by the two men, Ling Qingzhu’s beautiful face turned as cold as ice. However, this only increased the itch within the two mens’ hearts.\n “You better start treating your wounds. The Supreme Purity Celestial Pond will only appear for a limited amount of time. Let me deal with the two of them.” tilting his head, Lin Dong looked towards the frosty Ling Qingzhu. A smile that was perfused with a murderous aura appeared on his face.\n This murderous aura was exceptionally thick. Lin Dong did not know why he was unable to restrain himself from emitting such a murderous aura. However, his rationality was telling him that he did not wish to let any of the two fellows go...\n “These two men should be the Yang brothers, who are quite infamous within Unique Devil Region. The one on the left is the older one, Yang Zhan, while the other is the younger one Yang Wei. They are experts who have taken half a step into the Profound Life stage. It’s said that they are extremely vicious and cruel individuals, with naturally lascivious characters. They were previously on the wanted lists of some super sects, however, they hid within Unique Devil Region. Even those super sects were somewhat helpless and couldn’t do anything about them… shall we fight them together?” Ling Qingzhu hesitated for a while, before asking Lin Dong. The strength of these two men was not inferior to Lei Qian. If it was only Lin Dong, it would be quite strenuous for him to deal with them.\n “We don’t have the time to wait here for a month.” replied Lin Dong with a smile. If they were to miss this chance, the Supreme Purity Celestial Pond would only appear the following month. Due to the Great Sect Competition, it was clear that they could not stay here and wait.\n “Alright, be careful. I’ll finish as quickly as possible.”\n Upon hearing Lin Dong’s reply, Ling Qingzhu still had some hesitation. Soon after, she gently bit her lip and nodded at Lin Dong. Her body moved and she entered the Supreme Purity Celestial Pond. Her wonderful figure was like a graceful carp swimming towards the depths of the celestial pond. In the next moment, a white dress floated up.\n As he watched Ling Qingzhu enter the Supreme Purity Celestial Pond, the smile on Lin Dong’s face slowly withdrew. His pitch-black eyes were sinisterly cold as they shifted and locked onto the the two men on the cliff edge.\n “Heh heh, don’t go so fast beauty. We brothers will accompany you in a moment.”\n The two Yang brothers looked at the ripples appearing on the surface of the Supreme Purity Celestial Pond with fiery gazes, while the fire of lust in their eyes started to grow increasingly hot.\n “No need. You two will accompany each other to hell..”\n Lin Dong’s body slowly floated up in the air. Soon after, an evil grin appeared from the corners of his mouth. With a clench of his fist, a crimson palm-sized cauldron appeared in a flash.\n It was obvious that the two men had thoroughly awakened the murderous intent within Lin Dong’s heart!\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-790","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n \n Official Sypnopsis\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \n 武之极，破苍穹，动乾坤！\n On the Journey of Cultivation, \n One must steal Ying and Yang, \n Sieze the Laws of Creation, \n Reach for Nirvana, \n Obtain Mastery over Life and Death, \n and Power over Reincarnation.\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
