{"id":61867,"no":2111,"title":"Chapter 798: Grudge","content":"Chapter 798: Grudge\n A faint evil aura spread across the spacious rocky terrain. At this moment, it seemed as though the air itself had solidified…\n This spot was not far from the teleportation formation to leave Unique Devil Region. Therefore, it could be considered to be near the end of the Great Sect Competition. However, many people knew that the real show had just begun.\n Competition was present amongst the eight super sects of Eastern Xuan Region. All of them considered each other as opponents. However, they usually exercised some restraint. The only exception was Yuan Gate and Dao Sect.\n As the strongest super sect in Eastern Xuan Region, the actions of Yuan Gate were naturally a little overbearing. This caused the remaining super sects to feel some dissatisfaction. However, there was nothing they could do. After all, Yuan Gate was simply too powerful and its three sect masters were all renowned individuals in Eastern Xuan Region.\n Although Dao Sect was a little inferior to Yuan Gate, they were still one of the eight super sects, and their foundations were naturally not weak. There had always been a grudge between these two parties. However, the real reason this grudge had grown to such an extent was because of a monstrous genius known as Zhou Tong, that Dao Sect produced a hundred years ago.\n Outsiders did not really know much about what had happened back then. All they knew, was that ever since Dao Sect produced that individual called Zhou Tong, all the prestige of the younger generation from that time seemed to have accumulated on him. So much so that even Yuan Gate’s three little kings from that time were all defeated by Zhou Tong, and the Yuan Gate disciples were completely dispirited during that Great Sect Competition. Amongst those three little kings, one had been killed, one injured and the last was sent fleeing...\n That particular Great Sect Competition was likely the one time where the Dao Sect disciples felt the proudest. Although they had paid a significant price, it was not worth mentioning when compared to the losses suffered by Yuan Gate.\n Something else seemed to have occurred after the competition. Suddenly, a shocking news spread. The Dao Sect disciple, Zhou Tong, had charged into Yuan Gate alone, killed three great elders of Yuan Gate and turned the place upside down. Finally, he directly forced a Yuan Gate sect master to put aside his pride and take action. Only then was Zhou Tong killed.\n This matter had undoubtedly stirred an earth-shattering commotion in Eastern Xuan Region at that time. Everyone was stunned by Zhou Tong’s boldness and ferocity. Just how strong must one be in order to do something as earthshaking as charging into the Yuan Gate headquarters alone?\n Zhou Tong’s death had also stirred the fury of Dao Sect. At that time, Zhou Tong undoubtedly possessed an extremely respected position in the hearts of the Dao Sect disciples. Hence, when news that he was killed by a Yuan Gate sect master reached Dao Sect, the Dao Sect disciples were completely furious. Cries of revenge rose within the sect. At that time, Yuan Gate and Dao Sect were at the brink of a war.\n Everyone were clearly aware of just how tragic it would be when two super sects waged a war…\n However, the war ultimately did not erupt. Under the suppression of Dao Sect master Ying Xuanzi and some of the upper echelons, this matter ultimately died down.\n However, bone deep hatred would not diminish with the flow of time. Instead, it would only burrow deeper into one’s heart. Hence, a war between Yuan Gate and Dao Sect might not have occurred, but the relationship between both parties was quite terrible. This had resulted in both parties being unable to be at peace each time they met in subsequent Great Sect Competitions. An example was the last Great Sect Competition. The Yuan Gate disciples still attacked despite Dao Sect admitting defeat. They surrounded and killed the great senior sister of Sky Hall back then, Wang Yan’s blood sister.\n These grudges and enmity accumulated again and again, until now…\n Many people in the sky and on the mountains did not belong to Yuan Gate or Dao Sect. They watched the familiar face off in the distant rocky terrain, as all of them sighed quietly. It seemed like this Great Sect Competition was destined not to be a peaceful one. However, they wondered if Dao Sect would become as miserable as they had been in the past…\n ……\n The Dao Sect disciples stared at the Yuan Gate disciples in an unfriendly manner, while everyone else looked on. Those eyes of the Dao Sect disciples contained a rich hatred.\n Ying Xiaoxiao’s face was frosty as she watched the situation in front of her and clenched her hand tightly. She was aware that the so-called peaceful passing was no longer possible. A great battle between both parties was inevitable.\n “Yuan Cang, it is merely a Great Sect Competition. There is no need to do things in such a manner, right?” Chen Gui frowned. He looked at Yuan Cang in the distant sky and spoke in a deep voice.\n “Haha, I did not wish for things to develop to this extent as well. However, I cannot stop the repeated provocations of some individuals. If I do not use resort to such means, others might think that our Yuan Gate is easily bullied.” Yuan Cang softly chuckled.\n “However, since you, Chen Gui, has spoken, I must give you some face. As long as they are willing to surrender Lin Dong and let us punish him, we will not attack them. What do you say?”\n “In your dreams!” Ying Huanhuan’s pretty face was immediately covered in frost as she cried out coldly.\n “Senior brother Chen Gui, why bother wasting words with him? Hand over brother Lin Dong? I might as well hand you over!” Qingtan rolled her eyes at Chen Gui and said.\n Chen Gui helplessly let out a bitter laugh. “I am not the one who asked to hand over brother Lin Dong.”\n His gaze once again looked towards Yuan Cang after his words sounded. He spread his hands and said, “Looks like there is nothing to discuss then.”\n “Humph, you truly do not know how to appreciate kindness. Ying Xiaoxiao, you should be aware of the hefty price your Dao Sect will have to pay in an all-out battle. Are you certain that you are willing to do this for Lin Dong?” Lei Qian laughed coldly.\n “Who do you think you are? You want my Dao Sect to pay a hefty price? I don’t believe that your side will end up any better!” Wang Yan’s eyes turned dark and chilly as he cried out.\n “Even a defeated foe dares to act so arrogant. It looks like your lucky escape last time has caused your confidence to soar significantly, huh?” Lei Qian stared at Wang Yan and laughed ferociously.\n “You can come and try me!” Wang Yan’s face was filled with ferocity. Majestic Yuan Power spread from his body. His strength was actually far stronger than an ordinary expert at the peak of the nine Yuan Nirvana stage. There seemed to be some vague traces of life Qi mixed within it.\n Over this period of time, Wang Yan and Ying Xiaoxiao had refined the ‘Profound Life Pill’, and a faint life Qi was born within their bodies. This enabled them to touch the door to the Profound Life stage. They were much stronger than before.\n “You have actually improved a little. However, with just this faint bit of life Qi, you still do not possess the qualification to act so arrogantly before me!” Lei Qian had clearly also sensed that Wang Yan had become much stronger. However, he still laughed coldly and ridiculed.\n “What do you say now?”\n The foldable fan in little Spirit King Ling Zhen’s hand fanned gently. The corners of his mouth formed an icy smile as he watched the Dao Sect disciples. After which, he looked towards Yuan Cang and inquired.\n “What do I say? Since they refuse to hand that person over, they should not blame us for being merciless.” Yuan Cang replied faintly. There was a rich murderous intent surging in his eyes as he spoke. They had suffered multiple losses at Lin Dong’s hands during this Great Sect Competition. Even the Pure Yuan treasure that they had originally obtained in the Burning Sky Ancient Stash was lost because of Lin Dong’s interference. If it was not because they were quick to flee, it was likely that they would have been killed by the red robed person.\n Such a loss was clearly difficult for the extremely proud Yuan Cang to endure. Moreover, the Dao Sect disciples had always been beaten until they no longer had spirit by Yuan Gate during the past Great Sect Competitions. If any accident occurred this time, it was likely that even their reputation amongst the Yuan Gate disciples would be damaged.\n “In that case… let’s do it.”\n The icy smile on Ling Zhen’s mouth became even wider when he heard this. He was already anxiously waiting to see the panic and hopeless expressions on these Dao Sect disciples.\n Yuan Cang smiled indifferently. After which, the three of them slowly stepped forward as majestic Yuan Power surged out. In an instant, it appeared as though all the Yuan Power in the area had vaguely started to boil.\n The surrounding onlookers felt their hearts pound a little harder when they watched this scene. They knew that Yuan Gate was about to attack.\n “Huff.”\n Chen Gui let out a deep breath. After which, he stared at Yuan Cang and took a step forward, “I will stop Yuan Cang.”\n “Thank you brother Chen Gui.” Ying Xiaoxiao felt some gratitude when she heard this. Lin Dong was currently not around. All they could do was rely on Chen Gui to stop Yuan Cang.\n “News of the situation here has already spread throughout the entire Unique Devil Region. Lin Dong should have received it. As long as we hold on, he will be able to hurry here.”\n Chen Gui hesitated for a moment but still ended up nodding. He had seen Lin Dong’s battle with Lei Qian. The former was indeed quite powerful. However, there was still quite a big gap when compared to Yuan Cang. Hence, he did not really understand the confidence underlying Ying Xiaoxiao’s group. Nevertheless, he did not say anything more despite his incomprehension.\n “I will deal with Lei Qian.” Wang Yan held a heavy black sword in his hand and grunted.\n Ying Xiaoxiao nodded. After which, she raised her head. Her eyes contained some chilliness as they locked onto the little Spirit King Ling Zhen. She said, “Leave Ling Zhen to me.”\n “Huanhuan, Qing Ye, the two of you will lead the other Dao Sect disciples and stop the remaining Yuan Gate disciples!”\n Ying Huanhuan and Qing Ye nodded heavily. The former extended her jadelike hand as the crimson Heavenly Phoenix Zither appeared with a flash.\n “My fellow disciples…”\n Ying Xiaoxiao slowly inhaled a breath of air that seemed to have become icy cold because of the tense atmosphere. Her eyes rotated and swept over all the Dao Sect disciples’ faces.\n “Please strengthen our Dao Sect!”\n Wild excitement surged into the eyes of all the Dao Sect disciples at this moment. At the same time, an unusually deep roar resounded in an orderly fashion.\n “Strengthen our Dao Sect!”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-798","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n \n Official Sypnopsis\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \n 武之极，破苍穹，动乾坤！\n On the Journey of Cultivation, \n One must steal Ying and Yang, \n Sieze the Laws of Creation, \n Reach for Nirvana, \n Obtain Mastery over Life and Death, \n and Power over Reincarnation.\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
