{"id":62031,"no":2275,"title":"Chapter 962 - Nine Serene Guarding Spirit Formation","content":"Three figures with a silver glow undulated over their bodies, were floating in front of the lightning hall. A monstrous like black aura spread, filling the entire place with an evil aura that caused many peoples’ expressions to change.\\n\\n “Not these damned puppets again!”\\n\\n Pang Hao, Liu Xiangxuan and the various surrounding experts stared at those three figures. Their expressions involuntarily turned a little ugly. They had already witnessed the strength of these puppets back at the lightning lake. Back then, just one of them alone had greatly troubled them. Yet, three of them were here right now.\\n\\n This was equivalent to three advance Profound Death Stage experts!\\n\\n A rich bloodiness spread gradually across the air. Under the stimulation from the blood, those experts, whose reasoning had been diminished by greed, finally began to gradually recover their senses. Immediately, they did not dare to charge forward anymore.\\n\\n Everyone knew just how powerful these three silver corpses were. Even though hundreds of experts attacked in unison previously, all of them were diced like melons under a chopper. Who would dare to recklessly charge forward now?\\n\\n “Haha, demon symbol…”\\n\\n The three men from Yuan Gate stared at the three silver corpses while a strange smile flashed across their faces. However, they did not take the initiative. Instead, they simply observed coldly by the side. They wanted to see how the rest planned to get rid of these obstacles in their path.\\n\\n The green within everyone’s heart had been extinguished. In the next instant, this area became exceptionally quiet. The eyes of many experts flickered. Clearly, they were thinking of how they should deal with the situation in front of them.\\n\\n Lin Dong did not say anything as well. There were many experts present and they were all fairly skilled. Hence, there was no need for him to show off.\\n\\n The silence did not last for a long time. The Nine Serene Gate and the Mysterious Sky Hall in front exchanged glances before slowly stepping forward in front of the many experts.\\n\\n “Everyone.”\\n\\n Pang Hao cupped his hands together and smiled at the various experts, before he said, “All of us here want to enter the lightning hall to seek treasures. However, we must first finish off these three silver corpses in front of us.”\\n\\n The entire place was quiet as everyone stared at Pang Hao. However, they unexpectedly did not rebuke him. This was because everyone knew that Pang Hao most likely had a plan in mind when he stepped forward.\\n\\n “According to my sources, these three silver corpses possess the strength of an advance Profound Death Stage expert. It is likely that all of us here will suffer tremendously if we were to clash head on with them.”\\n\\n Some people’s expression was slightly altered after they heard his words. It was indeed tricky to deal with three advance Profound Death Stage silver corpses.\\n\\n “Does brother Pang Hao have any good ideas?” Some experts asked.\\n\\n Pang Hao smiled faintly and replied, “We do possess some means of dealing with these silver corpses. However, we will require help from all of you. Otherwise, it is unlikely that we will succeed.”\\n\\n Some commotion sounded from the storm cloud after his words were uttered. Even Lin Dong involuntarily lifted his brow. Did Nine Serene Gate truly possessed the ability to deal with three advance Profound Death Stage silver corpses?\\n\\n “Haha, since brother Pang Hao has a way to deal with them, it’s for the best. Everyone has the same goal. It is naturally no problem for us to assist you, as long as we can finish off the tigers that are blocking the way.”\\n\\n Many experts laughed out loud after musing for a moment. Regardless, it was fine as long as they did not need to clash head on with those creatures.\\n\\n A smile surfaced on Pang Hao’s face as he heard this. He quickly flipped his hand. A white circular plate appeared in a flash. There was a vague formation fluctuation present on the circular plate and it was quite powerful.\\n\\n “This is a prized treasure of my Nine Serene Gate, the Nine Serene Guarding Spirit Plate. Once it is activated, we will be able to form the Nine Serene Guarding Spirit Formation. At that time, we should be able to rely on this formation to suppress these three silver corpses for a few days. That amount of time is likely sufficient for us to travel across the lightning hall several times.”\\n\\n “It is actually the Nine Serene Guarding Spirit Formation? This is the Nine Serene Gate sect guarding formation. It would require over a dozen Profound Death Stage experts in order to activate this formation…”\\n\\n “Moreover, it takes an extremely powerful force to squeeze this formation into a spiritual plate. There are hardly any individuals in the Nine Serene Gate who possess such ability.”\\n\\n “Pang Hao has brought along a treasure.”\\n\\n Many exclamations began to spread, soon after Pang Hao’s voice sounded. It was likely that some of the experts had also heard of this treasure in Pang Hao’s hands.\\n\\n Lin Dong’s eyes were slightly surprised as he stared at the white coloured plate that was covered with a light glow, sitting in Pang Hao’s hand. He could sense quite an extraordinary ripple from it. Immediately, he involuntarily smacked his lips. They was indeed worthy of a big faction…\\n\\n The so-called Nine Serene Guarding Spirit Formation might be inferior compared to the Ancient Universe Formation in his body, but it was clearly quite extraordinary as well. Suppressing three silver corpses for a couple of days is no ordinary feat.\\n\\n “Haha, activating the formation requires quite a lot of Yuan Power. I can only rely on everyone here…” Pang Hao smilingly said.\\n\\n Everyone grinned and nodded upon hearing this. They naturally understood that Pang Hao did not wish to exhaust his own strength to deal with these three silver corpses. Hence, he had to rely on everyone else. However, these experts did not feel the least bit displeased because of this. After all, Pang Hao was the only one who had such a powerful formation…\\n\\n Lin Dong looked at this scene indifferently. Since this Pang Hao was willing to take out his formation to suppress the silver corpses, Lin Dong was naturally happy to sit back and enjoy the show.\\n\\n However, while Lin Dong was contemplating such thoughts, he saw Pang Hao turn around to stare at him. His gaze was quite peculiar.\\n\\n “However, I am unable to wield this formation in a flexible manner. Three people are needed to draw those three silver corpses into the formation once it is activated.” Pang Hao smilingly said.\\n\\n The eyes of many experts trembled slightly after these words sounded out. This is a dangerous task and no one wanted to fight with those vicious silver corpses.\\n\\n “Currently, there are a total of three silver corpse. The Nine Serene Gate and Mysterious Sky Sect will be responsible for drawing one silver corpse each. However, another friend present here should help to draw the third silver corpse.” Pang Hao smilingly said.\\n\\n The place was quiet. Not a single person took the initiative to speak up. Clearly, no one wanted to step forward and take on the role.\\n\\n Pang Hao was not surprised by this scene. Soon after, his head turned towards Lin Dong in front of the latter’s cold eyes.\\n\\n “Everyone, before this, we have also met a silver corpse as well. At that time, the silver corpse was chasing after brother Lin Dong. However, the latter managed to escape successfully. Therefore, I believe that brother Lin Dong is perhaps the most suitable person here to handle the task of luring the third silver corpse into the formation.”\\n\\n Swoosh!\\n\\n Many pairs of eyes on the storm cloud were quickly directed towards Lin Dong, who was a short distance away, after Pang Hao’s voice sounded. Their eyes were mostly filled with surprise. They clearly did not expect that Lin Dong was actually able to escape from an advance Profound Death Stage silver corpse.\\n\\n “Haha, brother Lin Dong is truly powerful. In that case, I’m afraid that this task should definitely belong to you.”\\n\\n “Yes, we will have to rely on brother Lin Dong for this.”\\n\\n “We hope brother Lin Dong will not reject it.”\\n\\n The eyes of the many experts from around the place flickered. A laughter was emitted. Some of them were clearly aware that both Lin Dong and Pang Hao had a grudge with one another. However, they could not be bothered. As long as they were not the ones chosen, it didn’t matter who would step forward to deal with the silver corpse.\\n\\n “That bastard!”\\n\\n Mu Lingshan clenched her teeth. Her large eyes were filled with fury. This Pang Hao was clearly scheming against them again.\\n\\n Lin Dong had an indifferent expression. Pang Hao was indeed extremely vicious. From the looks of it, the latter was clearly forcing him to perform this dangerous task. After all, the formation belonged to him. Moreover, he had the help of the various experts present here. If Lin Dong was to oppose his decision, it was likely that Lin Dong would immediately become everyone’s enemy. At that time, Pang Hao could incite the crowd to attack him. Coincidentally, there were many experts present here who were also interested in the silver tower key that he had.\\n\\n There was no shortage of people in this world who would kick you when you are down.\\n\\n “Haha, brother Lin Dong, what do you say about my suggestion?” Pang Hao smilingly looked at Lin Dong and laughed. He was hoping that Lin Dong would furiously reject him. In that way, the present situation would place Lin Dong in an extremely awkward state.\\n\\n Many pairs of eyes were locked onto Lin Dong. Many of them contained some ill intent.\\n\\n Lin Dong acted as though he did not notice the surrounding gazes. He merely looked at the smiling Pang Hao.. A moment later, a smile appeared on his face.\\n\\n After which, he nodded.\\n\\n “We will do as brother Pang Hao has suggested.”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-962","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
