{"id":62071,"no":2315,"title":"Chapter 1002 - The Calm Before the Competition","content":"During the next five days, the number of people in the already crowded Fiery Flame City was soaring at a terrifying rate. Various experts had came from all over the Chaotic Demon Sea, causing the current Fiery Flame City to become most lively place in the entire Chaotic Demon Sea. Fiery Flame City had also become a little chaotic following the entry of such a large number of experts. After all, these powerful individuals from the Chaotic Demon Sea were usually proud and untamed. Although they were wary of the might of the Flame Divine Hall initially, as time went by, various disputes started to occur more frequently as an increasing number of experts arrived. This resulted in the city becoming somewhat chaotic because of certain random fights. However, this chaos did not last. Tang Xinlian commanded a large group of law enforcement unit with powerful auras. Whenever they showed up, they did so in a disciplined and orderly fashion just like an army. Hence, this sight caused many to feel their heart shudder at the chill that rose on the lady’s pretty face. The Flame Fairy, Tang Xinlian from the Flame Divine Hall, was quite well known across the entire Chaotic Demon Sea. Of course, her second place ranking on the rookie list also resulted in many, who thought that she was a mere girl, to carefully restrain their disrespect. However, it must be said that Tang Xunlian did possess some skill. Within a short few days, chaos in the the somewhat wild Fiery Flame City had been forcefully suppressed by her enforcement units. The name of Flame Fairy once again soared and she became the focus of attention in the entire city. Moreover, many curious onlookers actually followed Tang Xinlian each time she led the enforcement unit in an operation. This scene ended up being quite an interesting one. At the same time, it also become the topic of conversation among countless individuals as they waited for the competition to begin… …… Lin Dong was also quite free during this period of time. Perhaps it was because of Tang Xinlian, but Huang Ling’s group did not come and find trouble with him after that incident. There was a somewhat playful expression in their eyes when Lin Dong occasionally met them. However, they did not provoke Lin Dong. Clearly, they were wary of Tang Xinlian. Lin Dong felt a little speechless in the face of this situation. Since when had he ended up reaching a point whereby he had to rely on a woman. Although Lin Dong felt a little unhappy, he did not do anything about it. Currently, the incidents in the Flame City were keeping Tang Xinlian extremely busy and he did not wish to add onto her burdens... Lin Dong leaned against a window of a towering building in the city. His eyes slowly swept over this huge city, which was extremely lively. “Haha, brother Lin Dong is truly carefree.” A loud laughter was suddenly transmitted from behind Lin Dong as he observed the city. He turned his head only to see that a blue clothed man, had unknowingly appeared behind him. However, there was hardy shock present in his eyes. Clearly, Lin Dong had already detected his presence. “I am Zhou Ze.” The blue clothed man smiled and spoke to Lin Dong. His appearance could not be considered handsome. However, his features made one feel extremely comfortable when placed together. The smile on the corner of his mouth allowed one to feel his friendliness. “Little Elephant King, Zhou Ze?” Lin Dong lifted his brow and spoke with a smile, “I have heard of your famous name.” Lin Dong was a little surprised. The Little Elephant King, Zhou Ze could be considered quite an outstanding individual amongst the younger generation of the Chaotic Demon Sea. His third position on the rookie list also proved that he had the qualifications. Hence, Lin Dong was a little secretly surprised that a person like him would actually take the initiative to interact with him. “It is just an insignificant title.” Zhou Ze waved his hand. He sat in front of Lin Dong, thought for a moment and said, “Elder Mo Luo came looking for me yesterday. He wants me to try and stop Xu Xiu from becoming the champion. However, he did not explain the reason nor did I ask.” Lin Dong was surprised. However, he quickly nodded. It seems like Mo Luo did not want too many people to learn about the existence of the Yimo now. Otherwise, they may alert the other parties if news spread. “I believe that brother Lin Dong should know something.” Zhou Ze laughed. Lin Dong grinned. He was just about to speak when Zhou Ze shook his head and said; “I am not asking you to tell me the reason. However, Xinlian had also spoken to me about this matter. With regards to her request, I am unable to reject.” Lin Dong narrowed his eyes. He could vaguely decipher the reason why Zhou Ze came looking for him. It was likely because of Tang Xinlian. Both Lin Dong and Tang Xinlian had been quite close during these past few days and it was likely that he got a little jealous... Lin Dong involuntarily felt neither able to laugh nor cry as he thought of this. Zhou Ze might appear like a free and easy person but it seems like he was unexpectedly fond of Tang Xinlian. “Miss Tang and I are merely friends.” Lin Dong replied with a faint smile. However, he did not elaborate. Zhou Ze revealed an embarrassed expression in his eyes after hearing this. He quickly nodded and was about to speak, when he heard a rushing wind sound being transmitted from the sky. A fiery red figure appeared in a flash. A hundred figures in bright red armour behind her halted a thousand feet away. “Hey, why have you come looking for Lin Dong? You aren’t finding trouble with him, are you?” Tang Xinlian stepped on the empty space. Her pretty eyes looked at Zhou Ze beside him and inquired in an unfriendly fashion. Zhou Ze hurriedly shook his head. He placed a hand over Lin Dong’s shoulder and laughed, “How is that possible? Brother Lin Dong and I hit if off instantly. Why would I cause trouble for him.” Lin Dong was speechless. All he could do was to shrug his shoulder towards Tang Xinlian. He immediately teased, “Why? Are you done putting out fires?” Lin Dong felt that it was quite a interesting sight to see Tang Xinlian hurriedly zipping across various parts of Fiery Flame City during these past few days. At times, Lin Dong even wondered if those troublemakers were purposefully creating trouble, in order to meet the most dazzling lady in Fiery Flame City. “It is so tiring. Those fellows really refuse to stop.” Tang Xinlian hurried into the building and snatched the wine jar from Lin Dong’s hand. She poured it into her mouth in a manly fashion. Lin Dong involuntarily smiled. He immediately noticed that Zhou Ze’s eyes were continuously staring at the wine jar in Tang Xinlian’s hands. After which, he turned his head. His eyes were unfriendly. “I still have no information on Xu Xiu and Hua Chen.” Tang Xinlian held a wine jar as she suddenly spoke in a faint voice. “There is no need to be anxious. The competition will begin tomorrow. They will have to show up eventually...” Lin Dong said. “During the competition, let me deal with Xu Xiu. Zhou Ze will handle Hua Chen. As for Lin Dong, you will observe the situation and act accordingly.” Tang Xinlian hesitated for a moment and said. “Aye. I was thinking of witnessing just how powerful this friend, who came from the Eastern Xuan Region, is.” Zhou Ze smiled and nodded. Lin Dong did not express any object. Tang Xinlian and Zhou Ze were second and third on the rookie list. Forget about the younger generation, even some Elders in their respective factions were somewhat inferior to them. The reason why Tang Xinlian did not ask him to attack was clearly because she was a little worried that he was not powerful enough... “Let’s do it that way.” Lin Dong stood up. His voice had just sounded when his eyes suddenly hardened. At this moment, he could sense that the two great Ancestral Symbol in his body had emitted a humming sound. Swoosh! Lin Dong suddenly turned his head before his eyes turned towards a certain direction. His body moved, transforming into a shadow before he rushed forward. Tang Xinlian and Zhou Ze were startled when they saw this and they quickly followed behind. The group of law enforcement unit behind Tang Xinlian also swiftly followed after they saw her leaving. Rushing wind sound appeared on a desolated mountain in the north-west of the city. Lin Dong’s body appeared in a ghost like fashion. His eyes were slightly cold as they swept over the surroundings. “What is it?” Tang Xinlian and Zhou Ze swiftly appeared behind Lin Dong and asked doubtfully. “Those two have appeared… Moreover, they were together.” Lin Dong’s spoke in an indifferent voice. It seems like there was indeed something amiss about Xu Xiu. Otherwise, he would not be together with Hua Chen. “Search the mountain!” Tang Xinlian knitted her brow and cried coldly. “Understood!” The hundred over individuals from the law enforcement unit hurriedly cried out in acknowledgement. They separated with lightning speed and swept this desolated mountain an inch at a time. However, their search was not very effective and those people from the law enforcement unit hurried back after approximately ten minutes. Clearly, they did not manage to find anything. “What slippery individuals!” Tang Xinlian gently clenched her teeth and said. “There is no need to be anxious. They will appear tomorrow regardless of how slippery they are… let’s go.” Lin Dong grinned. He did not stay any longer, choosing instead to turn around and leave. Tang Xinlian exchanged glances with Zhou Ze. After which, she had no choice but to lead her law enforcement unit and leave. Around half an hour after they left, black Qi seeped out from the ground a distance from the desolate mountain. Two figures strangely appeared. “Haha, such sharp senses. He is even able to detect us like this…” A human figure looked in the direction that Lin Dong’s group had disappeared towards and laughed softly. “Lin Dong is a little strange.” The human figure wrapped in a black robe hissed. “Aye, it would be impossible to kill the Huo Yuan trio without some special abilities…” That human figure smiled and said, “Let’s cooperate this time around, We must obtain the Thunderbolt Ancestral Symbol. Moreover, we must kill Lin Dong as well…” “Alright.” “Let’s go. The fun will begin tomorrow… I really can’t wait. The Thunderbolt Ancestral Symbol. Haha…” Black fog rose after this soft laughter sounded. The two figures once again disappeared in a strange fashion and the desolate mountain once again became quiet and deserted. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1002","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them… Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family. Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman… Official Sypnopsis 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 武之极，破苍穹，动乾坤！ On the Journey of Cultivation, One must steal Ying and Yang, Sieze the Laws of Creation, Reach for Nirvana, Obtain Mastery over Life and Death, and Power over Reincarnation. At the peak of Martial Arts, break through the Heavens and shake the Universe!","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
