{"id":62139,"no":2383,"title":"Chapter 1070 - Kill","content":"Bang!\\n\\n The huge mountain was just like a large hammer. It had an extremely stunning effect as it ruthlessly smashed onto Xu Zhong’s huge body while miserable tiger roars continued to resound in the sky.\\n\\n Everyone’s expressions was undoubtedly somewhat stiff as they watched this scene. It was only a moment later before they finally recovered. Yet they felt some disbelief. Who could have imagined that Xu Zhong, who just moments ago occupied the advantageous position, would be reduced to such a state in the blink of an eye.\\n\\n “How did it turned out like this…”\\n\\n Chen Tong’s group was petrified as they mumbled. A long while later, their eyes suddenly looked towards the huge light formation in the sky. The light pillar covered Xu Zong and each time majestic Yuan Power surged out from Xu Zhong’s body, it would be disintegrated by the light pillar.\\n\\n “Is that formation the cause of the rapid fall in Xu Zhong’s fighting strength?”\\n\\n Everyone’s eyes flashed as they came to a sudden comprehension. Immediately, they felt some fear in their hearts. Just what was this light formation? It was actually so powerful. Not only was it able to disintegrate the unusually powerful Dark Abyss Armour on Xu Zhong’s body, but it could even disintegrate the Yuan Power in the latter’s body...\\n\\n “What a terrifying person…”\\n\\n Although everyone was unfamiliar with that light formation, it did not hinder them from feeling shocked by Lin Dong’s current crazy actions.\\n\\n Bang!\\n\\n The mountain in Lin Dong’s hand was finally unable to endure the tremendous force and finally exploded. Below, blood drenched Xu Zhong’s entire body. Numerous bloody wounds were exposed on his body and even white bone could be seen.\\n\\n Lin Dong casually threw aside the remnant boulder in his hand. He panted a little before taking a look at the unusually miserable Xu Zhong, whose body was covered in fresh blood. It was not that the latter did not wish to resist, but the Ancient Universe Formation had suppressed the Yuan Power within his body. In other words, Lin Dong had turned him into an ordinary giant beast that had no power to resist for that short span of time.\\n\\n Only with the advancement of Lin Dong’s strength to the Profound Death stage was he able to use the Ancient Universe Formation to achieve such a suppression. If it was in the past, the Ancient Universe Formation was only able to disintegrate a portion of this energy. In other words, it would be impossible to reach the level where it could completely suppress a peak level perfect Profound Death stage expert.\\n\\n Such ability was considered an abnormality. After all, just imagining how it could turn a powerful opponent into someone who could barely use any of the Yuan Power within his body was enough to know just how frightening this was…\\n\\n Although this was only for a short period, most of the time, it was basically able to decide the victor of the fight.\\n\\n Of course, this ability might be powerful but if it failed to lock onto a target, it was basically impossible to activate it. Earlier, Xu Zhong had been caught in this formation because he was careless and was unable to fully comprehend its usage. Soon after, he turned from a lively tiger into a foolish beast who could do nothing but receive a beating…\\n\\n Lin Dong was evidently extremely well versed in adding insult to injury. He took advantage of this opening and directly beat the originally proud and awe-inspiring Xu Zhong into an incomparably miserable state.\\n\\n The huge formation in the sky began to shake and the light pillar covering Xu Zhong turned illusory. Despite the great power of the Ancient Universe Formation, it was still not an easy task to completely suppress a peak perfect Profound Death stage expert.\\n\\n “Is it unable to suppress him any longer…”\\n\\n Lin Dong merely smile faintly when he saw this scene. Soon after, he walked towards the giant dull grey tiger. The latter’s scarlet red tiger eyes were filled with bitterness and fear.\\n\\n “I’ll just have to cripple you first.”\\n\\n Lin Dong’s footsteps paused in front of Xu Zhong. With a clench of his hand, the Lightning Emperor Scepter appeared in a flash. Thunderbolts crazily surged on it. Soon after, his eyes hardened. He did not hesitate at all as the Lightning Emperor Scepter in his hand ruthlessly stabbed at Xu Zhong’s giant body.\\n\\n Wail!\\n\\n A mournful screech immediately sounded while lightning crazily flickered on Xu Zhong’s body. His enormous figure began to shrink rapidly. A moment later, he turned back into human form. The Lightning Emperor Scepter had pierced through his shoulder, while fresh blood flowed from the wound.\\n\\n Lin Dong grabbed and pulled out the Lightning Emperor Scepter. Subsequently, the scepter was ruthlessly swung at Xu Zhong’s body. An enormous force sent the latter flying a thousand feet backwards.\\n\\n “You have lost.”\\n\\n Lin Dong was indifferent as he gazed upon the deathly pale Xu Zhong to his front. The latter’s aura was already relatively weak. It was obvious that Lin Dong had managed to severely injure him earlier.\\n\\n He no longer had any strength to fight.\\n\\n The victor of this battle had already been decided.\\n\\n All eyes gathered and an uproar soon followed. No one could have imagined that this battle would actually have such a dramatic result.\\n\\n General Meng Shan and Tian E had completely pale faces. The former in particular was even paler than his counterpart. His entire body broke out in cold sweat the moment he thought of how he had attempted to capture Lin Dong back then. Fortunately, Lin Dong had not retaliated. Otherwise, it was likely that he would not even have the opportunity to escape...\\n\\n Blood was spat out from Xu Zhong’s mouth under the many watching eyes. He resentfully stared at Lin Dong and laughed coldly, “You do have many tricks. However, do you think you are a match for this king if we were to really engage in a direct fight?”\\n\\n “All tricks are considered strength in a life or death battle. You are after all a Demon Commander, at the very least, you should not speak such laughable words, right?” Lin Dong’s eyes watched Xu Zhong in a strange fashion as he retorted.\\n\\n Xu Zhong was speechless. However, the bitter resentment in his eyes did not diminish.\\n\\n “It’s about time for the victor of the battle there to be decided…”\\n\\n Lin Dong ignored Xu Zhong. He lifted his head to look at the distant sky where monstrous blood light was spreading. A tiger roar resounded across the sky as blood light gushed out and a black figure also ended up flying backwards. Finally, it left a ten thousand feet deep scar on the ground.\\n\\n “Bang.”\\n\\n A blood red light figure descended from the sky. At this moment, Little Flame was in a half beast combat form. Many bloody wounds covered his body as fresh blood flowed, causing his originally ferocious face to appear even more terrifying. He had clearly experienced a relatively intense battle earlier.\\n\\n Little Flame took a huge step forward, grabbed the now equally frail Shadow Guard and tossed him towards Xu Zhong. His face was malicious, “Do you still recall what I said to you when you snatched half of my essence blood inheritance back then?”\\n\\n “I said that it belongs to me and you will eventually return it!”\\n\\n Xu Zhong glanced at the Shadow Guard who had been tossed to his side. The expression in his eyes was dark as he wiped off the blood at the corner of his mouth. Little Flame had indeed said this back then. However, would the Xu Zhong from back then even give a second glance to a Little Flame who had only just reached the Profound Life stage?\\n\\n At that time, Little Flame was perhaps akin to an ant in his eyes. He had simply ignored the provocations of an ant… who could had imagined that the ant from back then would ultimately manage to overthrow him…\\n\\n “Hand over the essence blood inheritance.” Lin Dong looked at Xu Zhong and softly said.\\n\\n Xu Zhong wiped off the blood on his face as he darkly stared at the Lin Dong duo. Soon after, he stood up while grabbing the Shadow Guard beside him. He then lifted his head and looked at the countless pairs of eyes around. Never would have imagined that he, one of the eight great Demon Commanders, would actually end up in such a miserable state.\\n\\n “Ha ha, I am a Demon Commander. It will be far too embarrassing for me to be defeated by you…” Xu Zhong’s voice was a little hoarse as he muttered.\\n\\n “Do you still intend to struggle?” Little Flame sneered.\\n\\n Xu Zhong turned his head to look at Lin Dong and Little Flame. Suddenly, he laughed, “Are all of you curious about this Shadow Guard?”\\n\\n Lin Dong frowned slightly.\\n\\n “I will let all of you see his true appearance…” Xu Zhong’s lips parted into a smile, a smile that was rather distorted. Next, he pulled off the black robe that covered the body of the Shadow Guard and a familiar face appeared in everyone’s sights.\\n\\n “That is… Xu Zhong?”\\n\\n The entire place was silent. Following which, many exclamations sounded. This was because the Shadow Guard’s appearance was exactly the same as Xu Zhong’s. However, the latter’s eyes seemed to be hollow… was it a puppet?”\\n\\n “This is my twin brother. However, I forcibly snatched his life force at birth, hence causing him to be extremely weak the moment he was born. Subsequently, he died due to poor health while he was gradually growing up…”\\n\\n As Xu Zhong stroked the Shadow Guard’s face with his hand, one could feel a chill originating from within the bone while looking at his smile. “After his death, I used a secret technique to refine him into a ghost body that shares my life. Although this secret technique was vicious, it does have a benefit. I managed to turn the energy of this ghost body into my own…”\\n\\n “Ha ha, actually, this body is a cauldron that I have reared, something that was born from my biological brother…”\\n\\n The entire place was silent. Several people’s expression had changed slightly after hearing these words. Xu Zhong viciousness had exceeded everyone’s expectations…\\n\\n “Now… it is time for this brother of mine to repay me.”\\n\\n Xu Zhong grinned as many bloody lines suddenly spread outwards from under his feet. They appeared like a blood formation that covered both himself and the Shadow Guard. Like a blade, his hand was stabbed into the chest of the Shadow Guard. Blood gushed out and the Shadow Guard’s body quickly withered. At the same time, Xu Zhong’s aura also swelled at an extremely terrifying speed. He had reached the boundary of the Samsara stage!\\n\\n A frightening air wave swept out in a crazy fashion, stopping anyone from approaching.\\n\\n “This bastard!”\\n\\n Little Flame’s expression was alarmed and furious as he watched this scene. Clearly, he did not expect that such an unforeseen event would occur.\\n\\n “Xu Zhong is actually about to break into the Samsara stage?”\\n\\n Numerous exclamations sounded in the vicinity. They could sense an aura that made breathing difficult rapidly taking shape…\\n\\n “Big brother, what do we do?” Little Flame looked towards Lin Dong and asked in a deep voice.\\n\\n Lin Dong’s expression was indifferent as he looked at the devil like Xu Zhong laughing wildly at the sky while an almost solid murderous intent flashed across his eyes. Soon after, he slowly lifted his hand under the many watching eyes and curled two of his fingers. A pitch-black colour appeared on one finger while resplendent silver appeared on the other and there even seemed to be lightning overflowing from the silver finger…\\n\\n “Brothers… should not be used in such a manner.”\\n\\n Bright red blood continuously dripped from between Lin Dong’s fingers while his complexion rapidly paled. Two vague and ancient tiny symbols appeared to have surfaced at his fingertips…\\n\\n “Hence, you should die.”\\n\\n After Lin Dong’s soft voice sounded, a blood red light ray suddenly shot out from between his fingers. Black light and lightning intertwined within the fresh blood. These two energies were perfectly compatible like like Yin and Yang.\\n\\n Plop!\\n\\n The ray of blood red light shot straight forward, easily shattering the frightening energy around Xu Zhong. Blood red light flashed and the ray of light directly penetrated his forehead.\\n\\n The ferocious smile on Xu Zhong’s face suddenly froze at this moment.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1070","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
