{"id":62267,"no":2511,"title":"Chapter 1198: Lonely Beauty Faces the Enemy Alone","content":"Swoosh!\\n\\n Majestic Yuan Power erupted from within Su Rou’s body as the longsword in her hand transformed into countless sharp sword glows, killing the dozen attacking Yuan Gate disciples around her.\\n\\n However, the Yuan Power within her body was clearly unable to endure for long in the face of the flood like attacks. That pretty face of hers was now filled with paleness.\\n\\n Even though waves of terrible fatigue spread from within her body, Su Rou still tightly clenched her teeth as she looked at the corpses that covered the ground. Both of her eyes were red while helplessness rose inside her heart.\\n\\n The attackers were currently still ordinary Yuan Gate disciples. The extremely frightening elders were simply watching their resistance in an indifferent manner. Once these elders attacked, it was likely that the defences of Nine Heavens Supreme Purity Palace would collapse almost immediately.\\n\\n Currently, they were merely enjoying the frantic struggling of Nine Heavens Supreme Purity Palace just before it was destroyed.\\n\\n “Junior sister Su Rou, careful!”\\n\\n An urgent shout suddenly rang out while Su Rou was feeling slightly dazed. She abruptly regained her focus. The pores on her body shrunk as she saw three sharp sword shadows, accompanied by extremely violent Yuan Power, abruptly arrive.\\n\\n These three attacks were incomparably deadly. The ones who had attacked were clearly genuine Yuan Gate experts, and each one was not weaker than Su Rou. The sneak attacks of the trio sealed off all of Su Rou’s escape routes. Moreover, given how exhausted the latter was, it was not possible for her to block the attacks.\\n\\n Su Rou was also aware her own condition. She watched as the sharp sword shadows rapidly magnified in her eyes, while helplessness and distress surfaced on her lips. Was this the fate of Nine Heavens Supreme Purity Palace?\\n\\n “Swoosh!”\\n\\n The sharp attacks arrived in an instant. However, a green light suddenly pierced the air just as the attacks were about to hit. As the green light flashed past, the three perfect Profound Life stage Yuan Gate experts burst into a bloody fog without being able to let out a scream.\\n\\n Bang bang!\\n\\n The momentum of the green light did not diminish after sweeping past the three Yuan Gate experts. The many Yuan Gate disciples behind the trio were all eliminated by the sharp green light. In an instant, a huge empty space appeared in the Yuan Gate’s flood like offensive.\\n\\n The sudden appearance of this powerful attack also caused the fighting that permeated the sky to pause. Su Rou and the other Nine Heavens Supreme Purity Palace disciples were momentarily stunned. After which, they were joyfully surprised to see a drifting beauty wearing a white dress. Longsword in hand, she slowly arrived. Her originally cold demeanor was currently piercingly icy.\\n\\n “Senior sister Qingzhu!”\\n\\n Countless Nine Heavens Supreme Purity Palace disciples immediately cried out as they gazed upon the figure. Their originally dispirited morale was greatly raised.\\n\\n “Senior sister!”\\n\\n Su Rou looked at the white clothed lady that had slowly come to her side. Although the latter still wore a veil, it was possible for Su Rou to detect the coldness and killing intent on Qingzhu’s face.\\n\\n “Junior sisters, it has been tough on all of you.” Qingzhu looked at Su Rou’s weary face. After which, she glanced at the injury-riddled Nine Heavens Supreme Purity Palace disciples. The jadelike hand which gasped the longsword gently trembled as she slowly said.\\n\\n “Senior sister, protecting Nine Heavens Supreme Purity Palace is also our duty.” Su Rou shook her head and said.\\n\\n Ling Qingzhu lightly nodded. She lifted her head to look at the sky full of black clouds. Yuan Gate disciples continuously rushed over from within the black clouds. She could see a couple of elderly figures at the middle of the black clouds. A powerful pressure spread from their bodies, enveloping the entire Nine Heavens Serene Purity Palace. They were the true threat.\\n\\n “Ha ha, someone decent has finally appeared. Eh? Where is that palace master of your Nine Heavens Serene Purity Palace?”\\n\\n The Yuan Gate first elder looked at Qingzhu from the sky and laughed faintly. However, he quickly sighed, “Oh, I forgot that she was seriously injured by me. Perhaps she is already dead?”\\n\\n Countless Nine Heavens Supreme Purity Palace disciples stared at the Yuan Gate first elder in rage as their bodies shook with anger.\\n\\n “Are you the one who injured teacher?”\\n\\n Ling Qingzhu’s eyes were as chilly as the cold moon as she stared at the Yuan Gate first elder. A frightening aura suddenly unfurled from within her body and dashed into the sky.\\n\\n The strength of that aura had already reached the Samsara stage. Moreover, for some unknown reason, this mere Samsara stage aura gave off a faint feeling of danger, a danger even greater than those peak experts who had touched Reincarnation.\\n\\n “Oh?”\\n\\n The Yuan Gate first elder lifted his brow after he felt Ling Qingzhu’s aura and coldly smiled, “From the looks of it, your palace master has passed on all her Yuan Power to you just before she died. You are really extraordinary. There is a ninety percent chance of such an inheritance process failing, yet, you actually succeeded.” \\n\\n “However, so what if you managed to obtain her power?”\\n\\n A mocking look was revealed in the Yuan Gate first elder’s eyes as he continued, “Even your palace master was defeated by me. Do you think a younger generation member like yourself is a match for this old man?”\\n\\n Ling Qingzhu’s pretty autumn water like eyes quietly stared at the Yuan Gate first elder. Those extremely cold eyes of hers caused even the latter to frown slightly. Soon after however, he icily smiled, shook his head and waved his hand, “Kill her.”\\n\\n “Understood!”\\n\\n A Yuan Gate elder behind him respectfully responded. After which, the elder slowly stepped forward with an indifferent expression. A frighteningly monstrous aura spread as he walked, while an evil black light flashed deep within his eyes.\\n\\n The strength of this Yuan Gate elder was clearly at the Samsara stage. Moreover, the strength of his aura was clearly far greater than Zhao Kui, whom Lin Dong had killed.\\n\\n Evidently, Yuan Gate had invested a great deal in order to eliminate Nine Heavens Supreme Purity Palace. \\n\\n “Youngling, you should quickly surrender and make Nine Heavens Supreme Purity Palace submit to our Yuan Gate. Otherwise, nothing will be left of your Nine Heavens Supreme Purity Palace!” The Yuan Gate elder stared at Ling Qingzhu with a pair of dark and cold eyes as he frostily shouted.\\n\\n However, Ling Qingzhu’s expression grew increasingly cold in response. She took a step forward and the longsword in her hand suddenly slashed forward.\\n\\n Buzz!\\n\\n The Yuan Power in the area suddenly surged as the sword was swung. A green ray of light penetrated through the void at an indescribable speed, and even space itself seemed to have been cut apart in that moment.\\n\\n “Careful!”\\n\\n The pupils of the Yuan Gate first elder abruptly shrunk upon seeing this as he sternly cried out.\\n\\n The hairs on the body of the Yuan Gate elder suddenly stood up as a feeling of intense danger flashed across his heart. Vast and mighty Yuan Power instantly wrapped around him like an iron wall.\\n\\n “Swoosh!”\\n\\n The green light beam descended just as his defence was formed. After which, it swept past. The surging Yuan Power and the expression on the face of the Yuan Gate elder immediately froze!\\n\\n Crack. \\n\\n A faint sound was suddenly transmitted over from the majestic Yuan Power defence. After which, countless pairs of eyes were stunned to see cracks rapidly extend on it. In the end, the incomparably tough defence fell apart with a final bang.\\n\\n While this happened, the body of the Yuan Gate elder inside also popped into bloody mist...\\n\\n “Hss!”\\n\\n The sound of cold air being inhaled echoed within the area. No one could have expected that a Samsara stage super expert would be killed by Ling Qingzhu in a single strike.\\n\\n “Swoosh.”\\n\\n As the bloody mist rose, a Yuan Spirit dyed in black light fled from within it. His sharp and miserable cry resounded across the sky, “You little slut! How dare you destroy my body. I will never let you off!”\\n\\n “Humph, useless thing.” A cold glint flashed within the eyes of the first elder. With a wave of his sleeve, the Yuan Spirit was kept inside the sleeve. After which, his dark and sinister eyes focused on the longsword wielding Ling Qingzhu below. The latter’s eyes were still cold, but a faint paleness had flashed across her face. It was obvious that the powerful attack from earlier had consumed a significant amount of energy.\\n\\n “You are indeed worthy of being the most outstanding disciple in the history of Nine Heavens Supreme Purity Palace. It is likely that even your teacher cannot not compare to you!”\\n\\n “However, do you think that you alone can save Nine Heavens Supreme Purity Palace today?!”\\n\\n “All Yuan Gate disciples listen up! Wash Nine Heavens Supreme Purity Palace in blood!” The first elder waved his hand in a fit of rage. His voice was filled with brutal murderous intent.\\n\\n “Understood!”\\n\\n The Yuan Gate disciples let out an earthshaking shout upon hearing the first elder’s furious cry, while murderous desire filled the sky.\\n\\n Su Rou clenched her teeth after seeing Yuan Gate’s offensive surge over again. She immediately led everyone to block the attack.\\n\\n “Junior sister.”\\n\\n However, she was stopped by Ling Qingzhu. The latter glanced at the flood like attacks of the Yuan Gate disciples and softly said, “Lead the disciples and retreat. I will cover your backs.”\\n\\n “Senior sister Qingzhu!”\\n\\n Su Rou was alarmed. Although Ling Qingzhu had displayed astonishing strength earlier, Yuan Gate was overwhelming. Moreover, the most formidable Yuan Gate first elder had yet to take action. How could Ling Qingzhu stop all of them alone?\\n\\n “Senior sister, we aren’t afraid of death. Allow us to remain behind and share the fate of Nine Heavens Supreme Purity Palace!” The surrounding Nine Heavens Supreme Purity Palace disciples hurriedly said.\\n\\n “If all of you die, Nine Heavens Supreme Purity Palace will cease to exist…”\\n\\n Longsword in hand, Ling Qingzhu clenched her other hand and a simple looking token appeared within it. After which, her cold voice spread, “With my position as the new palace master of Nine Heavens Supreme Purity Palace, I order all of you to withdraw immediately. Those who disobey will be expelled from the sect!”\\n\\n “Senior sister!”\\n\\n Tears began to gather in the eyes of countless Nine Heavens Supreme Purity Palace disciples as they involuntarily knelt down. The sight of this black sea of people was extremely spectacular.\\n\\n “Listen to me if you do not wish for my death to be in vain.”\\n\\n A crystal tear seemed to fall under the veil, but was quickly scattered by the wind. Subsequently, she lifted her head and slowly headed in the direction of the Yuan Gate’s flood like offensive. The thin sword wielding figure appeared lonely but determined under the setting sun.\\n\\n “Qingzhu may die, but the sect will never fall”\\n\\n Qingzhu lifted her head. Her cold voice contained an unyielding will as it resounded across the sky.\\n\\n “You do have a backbone.”\\n\\n The Yuan Gate first elder laughed in a darkly sinister manner as endless brutality surged in his eyes. Soon after, he waved his hand as an ice-cold voice spread.\\n\\n “Kill! Do not allow a single one to remain!”\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1198","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
