{"id":62333,"no":2577,"title":"Chapter 1264: Chaos Master","content":"The atmosphere in front of the building was a strange one. Currently, the leaders of the various factions in the Heaven Wind Sea Region all felt a chill over their bodies. In fact, the experts from the Wei clan all had ashen faces, and Wei Zhen’s body was even trembling. With fear in his eyes, he stared at Lin Dong. After all, never did he imagine that this famous little fellow from before, was actually so frightening now. With his current strength, it was likely that he could exterminate the entire Wei clan with the flip of his palm. However, Lin Dong merely glanced at him and it seemed like he had no plans to make life difficult for them. After all, once one’s strength reached a certain level, ants like them could hardly provoke him. “Haha, young brother Lin Dong, I have long heard about your great name.” At this moment, the leader of the Gu clan, Gu Tong, had also recovered his senses. Suppressing the waves in his heart, he smiled towards Lin Dong. In fact, when he saw that Lin Dong had greeted Gu Mengqi and Gu Yan, instead of feeling displeased in his heart, he felt great joy. Regardless, it was best as long as Gu clan remained on his good side. As the leader of the Gu clan, he clearly knew what a peak Reincarnation stage expert represented. In fact, even though nearly every single expert from the Heaven Wind Sea Region was gathered on the Martial Gathering Island, they were nothing in the eyes of a peak Reincarnation stage expert. “This is my grandfather, the clan leader of the Gu clan, Gu Tong.” Gu Mengqi softly introduced. “Greetings to the clan leader of the Gu clan.” Lin Dong cupped his hands together towards Gu Tong. After all, he had a good impression of the Gu clan. Moreover, Gu Tong had indirectly helped him in the past, even though he was not acquainted with the former. Gu Tong hurriedly returned his greetings when he heard this. When he detected the envious eyes from around him, his back straightened slightly. Being able to befriend a top expert like Lin Dong was truly a glorious event for their Gu clan. “Lin Dong, why did you come here? The Martial Gathering Island is in big trouble now.” Gu Yan involuntarily asked. After all, given what was happening in the Martial Gathering Island, who actually dared to come here now? “I have been tasked by someone to protect a person in that tower.” Lin Dong smiled, before he extended his arm and pointed towards the distant Chaotic Tower. Everyone was stunned. That person in the Chaotic Tower? Could it be that elder who created the energy barrier? Gu Mengqi and Gu Yan were stunned. However, they chose not to question him further as they simply nodded their heads gently. After which, they turned to look at Ying Huanhuan and Qingtan, who were standing behind Lin Dong. Both of them were gorgeous ladies. One was icy cold and perfect, while the other was pretty and cute. Moreover, their demeanors were extraordinary. “This is Ying Huanhuan, my martial junior from Dao Sect. This is my younger sister Qingtan.” When he saw this, Lin Dong smilingly introduced the both of them. Ying Huanhuan and Qingtan smiled towards those two girls. After which, Ying Huanhuan used her icy blue pretty eyes to sweep across Lin Dong’s body. However, there was a strange emotion within her eyes. It was as though she was hinting that Lin Dong had encountered quite a lot of beauties during his cultivation journey. Lin Dong laughed gently after he detected her actions. After which, he turned his attention towards the leaders of the various factions of the Heaven Wind Sea Region, before he said, “All of you should be aware of the current situation in the Martial Gathering Island. You will all have to listen to me if you wish to keep your lives. Are there any objections?” There were a huge number of Yimo outside the Martial Gathering Island. If Lin Dong wanted to protect this place, he would have to make use of the people here. After all, by using them to deal with the ordinary Yimo, it could save his time and effort. While his eyes swept across this place, a powerful and pressurizing aura spread and covered the entire place. Immediately, this caused the crowd’s hearts to quiver. In fact, even the three great caves chiefs did not dare to object. “Clan leader Gu, please count the number of people on this island. After which, the various factions will lead their own groups and form a formation. All of you should fight with your full strength once the light barrier is broken.” Lin Dong used his stern eyes to look at the crowd, before he said in a faint voice, “I will help all of you to deal with those Yimo whom you guys cannot deal with. However, those ordinary minions will be left to all of you.” “Now, we are all on the same boat. Hopefully, we will act as one. If anyone dares to play tricks secretly, I will have no choice but to eliminate them.” Everyone trembled after they heard his final sentence. Only then, did they understand that the person standing in front of them was no kind-hearted soul. “What young brother Lin Dong said is right. This matter concerns all our lives. Naturally, we will do our best.” The chief of the Heaven Wind Cave hurriedly said. “Huanhuan, Qingtan, both of you should stay behind and help me to look after this place.” Lin Dong nodded upon seeing this. Finally, he turned his head and uttered those words to Ying Huanhuan and Qingtan. Although the Gu clan was one of the five big clans, they were not the strongest faction in the Heaven Wind Sea Region. Therefore, without external aid, it was likely going to be a difficult task to get the crowd to submit to them. Ying Huanhuan and Qingtan nodded. Then, the latter used her pretty eyes before she surveyed this place. After all, she was the palace master of the Darkness Palace and she was well-versed with such matters. After he finished speaking, Lin Dong did not linger on. Instead, a silver light flashed across his body before he appeared in front of the Chaotic Tower immediately. Subsequently, he directly charged towards the highest level of the Chaotic Tower. Everyone was stunned when they saw that he could successfully enter the highest level of the Chaotic Tower. However, though they were secretly shocked, they did not dare to speak up. “Everyone, please organize your subordinates. It is a complete mess now and it is a strain on my eyes.” The cute and lively expression on Qingtan’s pretty face slowly disappeared after she saw Lin Dong entering the Chaotic Tower. Then, she clenched her small hand before her huge Darkness Saint Scythe appeared. Following which, she swung her scythe before everyone saw a huge spatial crack appearing in the sky. Immediately, they inhaled a cold breath of air. Clearly, they did not expect that this beautiful and cute girl was actually this frightening as well. “Everyone should hurry up. I am quite an impatient person. Should I accidentally sweep all of you out from the island, big brother Lin Dong will definitely reprimand me.” Qingtan was hugging her Darkness Saint Scythe as she said in a lazy manner. “Understood. Understood.” When they heard Qingtan’s quiet and implicit threat, cold sweat began to roll off the foreheads of the leaders of the various factions in the Heaven Wind Sea Region. Then, they hurriedly retreated and began to organise their own subordinates. After all, all of them were afraid that they might accidentally offend this little grandaunt, whose demeanor had changed the instant Lin Dong left. Ying Huanhuan looked at the lively scene on this island. However, there were hardly any emotions in her icy blue eyes. Instead, she merely looked at the Chaotic Tower before she muttered to herself, “Chaos Master huh…” 　　…… A purple-gold ocean appeared in Lin Dong’s sight when he first entered the highest level of the Chaotic Tower. The purple-gold energy here was mighty and violent, and they filled every corner of this place. Lin Dong looked at this ocean like purple-gold energy before he smiled gently. In the past, when he first came to the Chaotic Tower, just obtaining some of this purple-gold energy that had seeped out from this place, had already benefited him tremendously. However, as of now, this energy was no longer attractive to him. Lin Dong’s eyes swept across this purple-gold place. After which, his body flashed before he headed rapidly towards the middle. This was because he could sense an ancient and powerful aura gathering at that spot. Lin Dong’s body flashed. A couple of minutes later, he finally stopped. After which, with shock in his eyes, he stared at his front. At that spot, a resplendent purple-gold light was scattering forth. Meanwhile, there was a ten thousand feet large giant seated in the middle of that purple-gold light. Moreover, those ocean like purple-gold energy were continuously entering his body through his breath. That giant’s body was purple-gold in colour and he had rough skin. However, under this roughness was power and might that could not be described with words. Clearly, this purple-gold giant was the Chaos Master, one of the eight Ancient Masters. In fact, he was also the man with the strongest physical body in the world! “Chaos Master.” Lin Dong’s body was hovering in front of that purple-gold giant. Compared to the latter, he was as tiny as an ant. Meanwhile, when he detected how powerful the latter’s physical body was, this caused the Primal Dragon Bone within his body to involuntarily emit a buzzing sound. In fact, it felt as though they wanted to challenge this giant. “Buzz.” Vast and mighty purple-gold light suddenly swept out from within the body of that purple-gold giant. After which, he slowly opened his tightly shut eyes. Immediately, two purple-gold rays of light swept towards Lin Dong. A powerful pressure enveloped Lin Dong after that giant locked his eyes onto him. Roar! An earth shaking dragon roar was suddenly emitted from within Lin Dong’s body. Up against such pressure, resplendent purple-gold light also swept out from within Lin Dong’s body. After which, they transformed into a ten thousand feet large purple-gold dragon behind him. “Primal Dragon Bone?” The giant finally spoke after he saw that huge purple-gold dragon. Meanwhile, his surprised voice was like thunder, as it shook the entire place. “I am Lin Dong. Pleased to meet you, Chaos Master.” Lin Dong cupped his hands towards the Chaos Master before he said in a clear and loud voice. “Are you Lin Dong? The Flame Master has already told me about you. You are indeed something special.” The Chaos Master laughed. Though he had a simple and honest look, his large purple-gold eyes occasionally revealed a sharp glint, which completely destroyed his simple and honest image. Lin Dong nodded gently. He could detect just how powerful the Chaos Master was. However, as of now, the latter’s aura was still a little sluggish. Clearly, it was because the latter had yet to make a complete recovery. “I’m afraid that I will have to trouble you this time around. I am at a critical juncture in my recuperation and all I need are five more days before I make a completely recovery. However, I believe that those creatures from the Devil Prison will not allow me to do so. Hence, I hope that you can guard this island during the next five days.” The Chaos Master cupped his hands together and said. “Since I was tasked by the Flame Master, I will naturally do my best to protect this island.” Lin Dong nodded and said. “Originally, those creatures from the Devil Prison could not detect my presence. However, as I gradually recovered, my aura became increasingly powerful and this ended up allowing them to detect my location.” The Chaos Master paused. Suddenly he asked, “Little junior sister is also here, am I right? I can sense her aura.” Lin Dong hesitated for a moment before nodding. The Chaos Master smiled. With a strange expression in his eyes, he glanced at Lin Dong. However, he did not say anything. Clearly, he also knew about the relationship between Lin Dong and Ying Huanhuan. “This time around, a Seat King will definitely show up. Can you handle it?” Lin Dong gave a gentle smile before he nodded his head. With his current strength, as long as it was not a Seat King who had passed three Reincarnation Tribulations, there was no need for him to fear. “In that case, I will have to thank you for protecting me.” The Chaos Master stared at Lin Dong. After which, he spoke quizzically, “I also wish to find out just how capable the man, that little junior sister greatly values, is…” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1264","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them… Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family. Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman… Official Sypnopsis 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 武之极，破苍穹，动乾坤！ On the Journey of Cultivation, One must steal Ying and Yang, Sieze the Laws of Creation, Reach for Nirvana, Obtain Mastery over Life and Death, and Power over Reincarnation. At the peak of Martial Arts, break through the Heavens and shake the Universe!","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
