{"id":62350,"no":2594,"title":"Chapter 1281: Forming a Divine Palace","content":"An ancient altar stood quietly within the void. Meanwhile, at the top of the altar, there was a skinny figure quietly seated like a statue. Currently, his body felt somewhat icy cold and his breath was so soft that it was nearly inaudible. If it was not because it was still possible to vaguely detect a trace of Life Qi from him, it was likely that everyone would think that this person was merely a lifeless corpse.\n There was no sound in this strange place. It was so quiet, appearing as though it was isolated from the flow of time. In fact, no one could sense it nor reach it.\n All of a sudden, the skinny figure seated on top of the altar suddenly trembled gently, before he slowly opened his tightly shut eyes. His black eyes were as dark as the night sky. As he gently knitted his brows, there seemed to be a helpless and confused expression between them. \n “Why do I keep failing?”\n Lin Dong muttered to himself. This should be the fourth year he had spent in this place. In other words, he had trained for four years. Other than the first year, where he was refining his Mental Energy, he had spent the remaining three years attempting to form a Divine Palace. However, without exception, all his attempts had ran into failure. \n Although he had been repeatedly analyzing the reason behind his failures since the beginning, and had reached a relatively perfect state, for some unknown reason, the Divine Palace that he formed only possessed the right form. However, it did not feel as though he had advanced to a different level.\n “Why did I fail… my Mental Energy are extremely well-refined. Why can’t I create a Divine Palace within my Niwan Palace?”\n Lin Dong frowned, while his eyes continued to glimmer. Meanwhile, his eyes were filled with doubt and confusion. Even after fretting over it for such a long time, he made little headway with the problem. Therefore, all he could do was to sigh, before he shut his eyes and prepared to make another attempt.\n “Huh?”\n However, just as he was about to make another attempt, he was suddenly startled. Then, he glanced at the stone floor on the ground. At that spot, there were some intersecting marks. However, from the looks of it, they should have been created randomly.\n These marks were extremely rough and simple. Meanwhile, there was a dot, which was connected to several deep scars. In fact, it looked as though this dot was completely destroyed. \n Lin Dong looked at these random marks before he shook his head in disappointment. Then, he once again shut his eyes. However, a moment later, he suddenly opened them again. As he once again looked at those random marks, a tinge of doubt flashed across his eyes. \n This dot seemed somewhat similar to his Niwan Palace. Meanwhile, these interconnected marks had destroyed it. Could it be that the Divine Palace was not remodeled from the Niwan Palace… Instead, one must completely destroy it in order to build a new one?\n This was… to destroy then create?\n Lin Dong’s heart was pounding violently. Destroy his Niwan Palace first? What a joke? One’s Niwan Palace was formed naturally at birth. Once it was destroyed, it would cause one’s spirit to drift off. Moreover, the end result was something that he could not handle.\n If his Niwan Palace was broken and his Divine Palace was not formed, wouldn’t that mean that all his Mental Energy attainment would simply vanish? In fact, it might even affect his mind and he could even turn into an idiot… \n This heavy price caused even someone like Lin Dong to hesitate for a moment. However, he vaguely deduced that this might be the true path leading to the Divine Palace Master level.\n Should he destroy or not?\n The expression within Lin Dong’s eyes were changing rapidly. Meanwhile, he was clearly struggling with this decision in his heart. This continued for a long time before he finally gently inhaled a breath of air. Following which, he suddenly clenched his hand before a determined glint flashed across his dark black eyes.\n If he did not possess strong determination, how could he possibly attain great strength? Moreover, how could he possibly surpass the Ice Master?\n After making up his mind, Lin Dong ceased hesitating. Shutting both his eyes, a thought passed through his mind before he arrived in front of his Niwan Palace. Currently, his Niwan Palace was just like a tiny speckle of light, that was roaming around gently. Meanwhile, powerful Mental Energy ripples were being emitted from it.\n Lin Dong’s mind was observing that speckle of light. Then, a thought passed through his mind before the mighty Mental Energy within his Niwan Palace began to shrink and adhere together at a frightening pace. Within a short moment, all the Mental Energy within his Niwan Palace had turned into a human head sized Mental Energy ball. This ball appeared solid-like and its surface was as smooth as a mirror. Moreover, the terrifying fluctuations within caused even peak experts, who had passed two Reincarnation Tribulations, to tremble in fear.\n When this condensation reached its limits, all of a sudden, the Mental Energy ball began to tremble violently. Meanwhile, cracks began to appear on its surface before they started to grow. Following which, many destructive rays of light shot out from within.\n When the intensity of these light rays reached their limits, a bright sun seemingly rose within Lin Dong’s Niwan Palace. Subsequently, a destructive fluctuation spread before his entire Niwan Palace exploded.\n Bang!\n Lin Dong’s body began to tremble violently at this moment. Following which, his Niwan Palace exploded before all the Mental Energy within began to surge forward uncontrollably like floodwaters.\n Lin Dong forcefully endured the intense pain within his head, as he quickly collected the Mental Energy, which had became extremely wild and violent after they were no longer restrained by his Niwan Palace. After all, if he allowed this frightening Mental Energy to go on a rampage within his body, it was likely that he would be shattered into pieces even though he was protected by the Primal Dragon Bone.\n Resplendent purple-gold light swept across the place. Meanwhile, the Primal Dragon Bone within Lin Dong’s body had also detected a hint of danger. A low and deep dragon roar sounded, before the purple-gold light transformed into numerous large purple-gold dragons. After which, they formed a dragon barrier and trapped all the rampaging Mental Energy within.\n At this moment, the three Ancestral Symbols have also appeared. Following which, they surrounded the Mental Energy and prevented anything from escaping. Light flashed before they were finally able to stop Lin Dong’s Mental Energy from going out of control.\n At this moment, Lin Dong’s heart was filled with anxiety. After all, his Niwan Palace was destroyed and it was impossible for him to restrain his Mental Energy indefinitely in this fashion. Therefore, if he was unable to create a “Divine Palace”, he would lose control of his Mental Energy and his spirit would also vanish. At that time, he would end up suffering a massive blow.\n Although he was in dire straits, Lin Dong was someone who had experienced numerous life and death situations. Hence, he did not panic. A thought passed through his mind before he began to maneuver his Mental Energy and merge them together to form a Divine Palace, just like what he did within his Niwan Palace previously. \n Vast and mighty Mental Energy surged. After which, they slowly merged together. At this moment, his Mental Energy was like a flowing liquid. Meanwhile, it seemed as though the outline of a Divine Palace was appearing stealthily.\n Lin Dong was maneuvering his Mental Energy cautiously, as he slowly began to complete the numerous steps needed to form a Divine Palace. However, this was evidently a massive project. Therefore, in spite of Lin Dong’s abilities, he still ended up exhausting quite a lot of time. Fortunately, Lin Dong was in this training ground and no one would disturb him in a place like this. Otherwise, the consequences would be quite dire if he lost control of his Mental Energy.\n Time slowly passed. In the blink of an eye, two months had passed. Meanwhile, his Divine Palace was gradually taking shape. His Divine Palace was tall and majestic, mighty and grand. In fact, it looked like the home of gods. \n Lin Dong’s mind was observing this newly formed Divine Palace. Meanwhile, wild joy involuntarily surged within his heart. Following which, a thought passed through his mind before his vast and mighty Mental Energy began to gush into his Divine Palace like floodwaters.\n However, after his Mental Energy gushed into his Divine Palace, the wild joy within Lin Dong’s heart suddenly turned cold. This was because he realized that after his Mental Energy entered his Divine Palace, they neither formed a cycle nor showed signs of spontaneous creation. \n In the past, when his Mental Energy entered his Niwan Palace, it would be akin to a bird returning to its nest and there would be a peaceful sensation. However, this sensation was nowhere to be found. \n Clearly, this Divine Palace was unable to replace his Niwan Palace!\n Henceforth, Lin Dong would have to grasp firmly onto his Mental Energy and prevent them from escaping. However, if he did so, he would never have the time to do anything else. In other words, he was tied down by his own Mental Energy.\n Cold sweat was continuously dripping off Lin Dong’s body as he stared at his Divine Palace. Could it be that something was missing?\n Why was it that the Divine Palace created by him, was unable to replace his Niwan Palace?\n Lin Dong’s mind was spinning rapidly. He vaguely felt that his Divine Palace was still lacking. However, he did not know what it was lacking… \n Time slowly passed. However, Lin Dong could not make any headway. Meanwhile, his heart sunk involuntarily. Was he still unable to break this stalemate?\n Seated on the altar, Lin Dong’s eyes were tightly shut while his body was drenched with cold sweat. The cold sweat dripped down from his body before they landed on that old and damaged futon. Faintly, a glint vaguely flashed from the futon in the process.\n Moreover, the instant that flash occurred, an extremely ancient voice seemingly sounded within Lin Dong’s heart, “Zenith.”\n This voice, that appeared suddenly, caused Lin Dong’s body to stiffen. However, even before he could think about where this voice came from, a eureka moment violently flashed across his mind, “Zenith Sensing Art?!”\n “Is that what’s missing?”\n This thought appeared in Lin Dong’s mind. Without further ado, he quickly immersed himself within the Zenith Sensing Art. A long while later, traces of Primal Chaos Light finally shot forth.\n That Primal Chaos Light landed on his Divine Palace. After which, his Divine Palace emitted a clear roar. At this moment, the seemingly dead Divine Palace seemed to possess life. In fact, light was flowing on the surface of the Divine Palace, while lifeforce radiated from it.\n Rumble.\n Mental Energy was flowing within the Divine Palace. In fact, it appeared as though they had faintly formed a basic cycle. Moreover, Lin Dong realized that the moment his Divine Palace was formed, it seemed to have established a divine connection with that mysterious and profound Zenith, as traces of Primal Chaos Light continuously gushed towards it.\n Mental Energy churned. Those traces of Primal Chaos Light began to merge with Lin Dong’s Mental Energy. Soon after, Lin Dong realized that after his Mental Energy merged with the Primal Chaos Light, they began to undergo a drastic change.\n This was a metamorphosis.\n Lin Dong came to a comprehension in his heart. Therefore, he gradually calmed his mind down before he quietly guarded his Divine Palace. Regardless of how violent his Mental Energy churned, Lin Dong knew that the Divine Palace would be able to truly replace his Niwan Palace after his Mental Energy completed their transformation!\n However… it seemed like this process would require a relatively long period of time. Fortunately, as of now, Lin Dong was not pressed for time. \n Hence, all he had to do was to quietly wait for the day of completion.\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1281","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n \n Official Sypnopsis\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \n 武之极，破苍穹，动乾坤！\n On the Journey of Cultivation, \n One must steal Ying and Yang, \n Sieze the Laws of Creation, \n Reach for Nirvana, \n Obtain Mastery over Life and Death, \n and Power over Reincarnation.\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
