{"id":60266,"no":510,"title":"Chapter 510: Eight Level Sect","content":"Chapter 510: Eight Level Sect\n A spacious dim grayish coloured space appeared in front of Lin Dong. Numerous islands were suspended in this space. They were connected to one another and appeared just like a floating continent.\n This deep region of the treasure trove is different from the broken space outside and the space inside was much more stable. The spatial crack lines that had occasionally occurred outside had completely disappeared in this place. Clearly, this region was under a special protection. Even after a long period of time, the space was still preserved rather perfectly.\n One could vaguely see some human figures flash by at this moment. It was likely that they were from those powerful empires who had arrived ahead of others. Almost all of them who possessed the qualification to enter this place, were considered as the elite in this north-western region… After all, even an expert at the Nirvana Stage would face a grave threat to his life, when he attempts to cross the Nirvana Burning Sky Array. Some of those who were unlucky enough to meet a frightening existence like the Nirvana Demon Flame, would likely meet their demise even if he was an expert who had stepped into a two Yuan Nirvana Stage expert. After all, not every one possessed the mysterious Stone Talisman, which could seal a mysterious item like the Nirvana Demon Flame.\n Hence, none of those who could cross the Nirvana Burning Sky Array and arrive at the deep region of the treasure trove, were simple individuals. All of them would definitely possess some skills.\n Lin Dong had just charged out of the Nirvana Burning Sky Array when some human figures also came out from behind him. These people glanced at Lin Dong, who had paused while their eyes contained a hint of cautiousness. After which, they swiftly flew towards the island suspended in the sky in the distant.\n “This ought to be the deep region of the Ancient Treasure Trove. Let’s go. We should also go and hunt for some treasures!” Lin Dong rubbed his hands together. His eyes stared at the floating island before they turned a little fiery hot. After having entered the Ancient Treasure Trove, he had yet to obtain any treasure other than borrowing the Pill River’s strength to endure a Nirvana Tribulation. In fact, he had not even obtained even a single treasure… behind him, Little Flame’s face revealed a smile while he nodded. After which, the two of them rushed out and hurried towards the distant floating island.\n “According to what was recorded on the stone tablet, this Tiangang Alliance’s true leaders are the four great mysterious sects. Below those four great sects are the guardian sects. Therefore, strictly speaking, that Heaven Cloud Sect is merely one of the weaker protector sects. This is the reason why one could find its remains outside.”\n Lin Dong was conveying to Little Flame some of the information he was aware of while the both of them swiftly flew across the sky. At the same time, his eyes were also sweeping over the deserted islands below. “The top five of the sixteen protector sects reside in the deep region of this Ancient Treasure Trove. Though their inheritances cannot be compared with the four great mysterious sects, they are definitely no ordinary inheritances. It is likely that quite a number of people will be interested in it.”\n “Are we heading directly to the remains of the four great mysterious sects?” Little Flame rubbed his head and said.\n “If only it was so easy. Only after the five protector sect’s remains are activated, would the inheritance of the four great mysterious sects be activated.”\n Lin Dong smiled. After which, he raised his head and looked towards the southern part of the island. He said, “If the information recorded on the stone tablet is correct, there should be a sect remains over there. Let’s go and take a look first.”\n Lin Dong chose to up his speed after he spoke. Soon after, Little Flame also closely followed behind him.\n The background of the sect remains that Lin Dong had mentioned was quite powerful. It was named the Eight Level Sect and was ranked second amongst the protector sects. In fact, it was several times more powerful than the Heaven Cloud Sect which they had met earlier. It could be considered a heavyweight remains.\n The sect which was the top ranking protector sects was called Ground Martial Sect. Only the four great mysterious sect could surpass it within this Tiangang Alliance. However, Lin Dong also understood that in terms of might, the Ground Martial Sect was indeed much stronger than the Eight Level Sect. However, the information that he had obtained from the stone tablet, did not indicate the location of the Ground Martial Sect. If Lin Dong was to slowly search for it, he might very well end up empty handed. In that case, it was better in principle to directly aim for this Eight Level Sect.\n Since Lin Dong had a target in mind, Lin Dong and Little Flame did not pause along the way for anything that appeared to be like the remains of other sects. Hence, the two of them flew passed countless number of floating island after around half an hour before they finally reduced their speed gradually. Their attention were cast towards a distant island.\n That island was quite unique and there were no mountains on it. On a cursory glance, it seemed as though the entire island was an incomparably large and open ground. At the middle of the open ground, was an enormous stone hall. An ancient feeling that seemed to be filled with the vicissitudes of life was emitted from within that enormous stone hall.\n Furthermore, there was quite a number of large stone pillars that were erected in that incomparably large open ground. These stone pillars were similarly emitting an ancient aura. If one was to observe it carefully, one would discover quite a number of deep handprints and footprints on it. It seemed as though that this place was once the training ground of this Eight Level Sect.\n Lin Dong and Little Flame gradually approached this enormous stone hall. Only then did they discover that the surroundings of the stone hall already had quite a number of figures present. Clearly, they were the powerful empires and experts who had came to the deep region of this treasure trove… However, Lin Dong did not hide himself when he saw them. Instead, he directly descended from the sky before landing on a stone pillar with Little Flame.\n The appearance of two additional people attracted quite a number of gazes. From the looks of it, it seemed as though Lin Dong was not unfamiliar to them. Private conversations were vaguely emitted. “This fellow is Lin Dong, who had defeated Shi Kun from the Devil Cliff Empire right?”\n “He is quite capable indeed. By relying on his low rank empire background, he was actually able to reach this stage. He is truly not a simple person.” Those private conversations were not overly hidden. Hence, quite a bit of it were transmitted into Lin Dong’s ears. This caused him to feel a little surprised. It was likely that he did not expect that his victory over Shi Kun would be spread so quickly. No wonder these experts did not reveal any disdain in their eyes when they were aware that he had come from the Great Yan Empire. All of them understood that one’s birth was not important in this place. The most important thing was one’s personal strength.\n If one wanted to stand out from the countless number of geniuses in this Hundred Empire War, possessing a noble birth without ability would be useless. No one would even look at you with respect if that was the case. Those super sects would not be bothered about whether you come from a low rank or high rank empire. All they wanted were the true geniuses!\n Lin Dong’s eyes swept over this enormous stone hall. After which, he understood a little of the situation in his heart. Other than those scattered individuals, there were three groups of people which attracted the most attention.\n Lin Dong was unfamiliar with these three groups of people. However, each of them were standing with their hands behind them right at the front. Moreover, these three peoples were also the only ones who did not give Lin Dong an additional glance. It was likely that there were all relatively arrogant people in their hearts. Of course, the powerful ripple that spread out from their bodies also allowed others to understand that they indeed possessed the qualification to be arrogant.\n “Two Yuan Nirvana Stage…”\n Lin Dong’s eyes narrowed slightly as he paused on those three people. His heart involuntarily sighed emotionally. Those who could arrive at this deep region of the treasure trove were indeed no ordinary people. The fluctuating aura of these two were much stronger than Shi Kun, who had just advanced into the two Yuan Nirvana Stage. No wonder they did not glance much at Lin Dong.\n “How could the sect remains here not possess any energy barrier?”\n Little Flame spoke with some doubt while he stood beside Lin Dong.\n Lin Dong was also startled when he heard this. Only the did he discover that the surroundings of this Eight Level Sect’s remains actually did not possess the energy barrier that was just like that of the Dry Cloud Sect. In this way, it seemed like this remains had actually been revealed in front of everyone eyes without any defence…. Something seemed a little wrong...\n Lin Dong knitted his brows slightly. He did not believe that this kind of sect remains would appear this calm. He immediately looked around him and also saw that quite a number of people possess some hesitation and doubt within their eyes. It seemed that they were unable to tell just what the meaning of this scene in front of them was.\n Three groups of people with two Yuan Nirvana Stage experts also looked at each other outside of the enormous hall. There was an eager expression in their eyes. It was likely that they had become a little impatient after having wait here for such a long time.\n Lin Dong silently observed this scene but he did not open his mouth to speak.\n “Lin Dong, under this place… there seems to be something.” Little Marten’s voice quietly sounded in Lin Dong’s heart while he remained quiet.\n Lin Dong narrowed his eyes slightly. His eyes turned downwards without being noticed and stared at the potholed ground of the area that had been corroded over time. His heart softly asked, “What is it?”\n “I’m not certain. That ripple… seems to be a little strange. However, you should be wary. It is impossible that such a place does not possess any defence.” Little Marten hesitated for a moment. Clearly, he was unable to clearly define the thing.\n Lin Dong gently nodded. Yuan Power slowly circulated within his body. Even his Spiritual Strength had quietly spread apart. He would be able to intervene with lightning like speed the moment any unexpected situation occurs.\n Little Flame by the side had clearly sensed Lin Dong’s action. Immediately, a red glow flashed across his eyes. His strong body leaned forward, appearing like a fierce tiger that was about to pounce onto its prey.\n While Lin Dong and Little Flame was treating the situation solemnly, the three groups of people right at the front were finally unable to control themselves as they began to move. One could see the three two Yuan Nirvana Stage experts took the lead to rush out before directly dashing towards the enormous stone hall.\n Swoosh!\n The speed of the three people were extremely fast. Within a blink, they had appeared within a thousand feet of the enormous stone hall. However, just when their bodies were about to charge into a radius of a thousand feet, Lin Dong suddenly shrunk his eyes. This was because even he sensed a kind of ripple that was being transmitted towards this enormous stone open ground at this moment.\n Bang!\n The entire open ground trembled suddenly within a split second. Immediately, the ground of the enormous stone hall at the front crumbled. A grayish white coloured large figure rushed out from underground with lightning speed. After which, it violently collided onto the three human figures with a speed that could not be detected with a naked eye.\n Boom boom boom!\n Three muffled sound appeared. Those three two Yuan Nirvana Stage experts directly flew back in front of the many shocked eyes. Their bodies landed on the ground in a miserable manner and their feet directly rubbed a deep scar on the ground. After which, their eyes were also shocked as they looked at the ground in front of the enormous stone hall which had cracked apart. Gray dust permeated the place. A moment later, an enormous figure seemed to have woken from the ground. It carried a kind of ancient pressure while slowly appeared in front of everyone’s eyes.\n “This is…”\n Lin Dong looked at the enormous figure in the grayish dust and his eyes shrunk.\n “Prehistoric Demon Dragon Dog.”\n Little Martern’s solemn voice had also quietly sounded at this moment.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-510","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n \n Official Sypnopsis\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \n 武之极，破苍穹，动乾坤！\n On the Journey of Cultivation, \n One must steal Ying and Yang, \n Sieze the Laws of Creation, \n Reach for Nirvana, \n Obtain Mastery over Life and Death, \n and Power over Reincarnation.\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
