{"id":60331,"no":575,"title":"Chapter 575 Before the Battle","content":"Chapter 575 Before the Battle\n Absolute silence swept across the auction area as everyone looked to one another, before their gazes shifted to the aloof looking Song Tai atop the auction stage.\n Even though Wanxiang City was governed by the super sects and the laws of the city were under the jurisdiction of its overseer, everyone knew that there were after all numerous arrogant and unyielding individuals gathered in this kind of city and therefore, conflicts were bound to arise no matter how strict the jurisdiction was. With regards to this kind of situation, the overseers usually turned a blind eye. Never had anyone heard of the overseer banning fightings in the city before.\n And thus, when the audience heard Song Tai declare that fightings would be banned in the Wanxiang City today, they were unable to grasp what had happened. Was the reason for the ban solely because he was in a bad mood?\n The faces of countless people held extremely strange expressions. Soon after, they looked pitifully at Feng Cang, who was so outraged that he spat out a mouthful of blood. Everyone could tell that Song Tai was targeting him...\n Likewise, Lin Dong looked in shock at Song Tai. Clearly, he did not expect Song Tai to say such a thing. After a while, he could not help but laugh. This fellow was rather interesting. It seemed that Lin Dong’s sale of the three Crossing Disaster pills had earned himself a favour from Song Tai.\n Currently, there was a stiff look on Mu Lin’s and his counterparts’ faces as well. Their eyes could not help contained smiling expressions.\n “Song Tai, don’t push it!”\n Under numerous gazes, Feng Cang who spat blood out of anger finally turned his body around. Because of his malevolence, his face had become extremely distorted. He glared daggers at Song Tai. If not for the fear that he had of Song Tai’s identity, he would have definitely attacked the latter.\n “Song Tai, even though you are the overseer of the Wanxiang City, you don’t have the obligation to interfere in the conflicts among the various empires. If this is reported back to the super sects, let’s see how you account for it!” Meng Lie icily shouted as he stood up from his seat.\n “I’m the overseer of the Wanxiang City and I make the rules here. If you are not satisfied, feel free to report me to the super sects,” Song Tai’s face remained indifferent. He shot a glance at the Feng Cang duo and continued plainly, “However, before any orders from the super sect arrive, I am still in control of this place. If you violate my rules, I have the right to strip you of your qualifications to enter the Hundred Empire War.”\n “Song Tai!”\n Feng Cang’s face was sinister as he furiously yelled, “The Wind Cloud Empire has people in the Eastern Xuan Region’s super sects as well. Don’t push your luck!”\n “The rules have been set and you can do whatever you want. When that moment comes, I can do whatever I want as well,” Song Tai replied calmly as he put his hands behind his back.\n “You!”\n Feng Cang’s body was trembling with anger while his eyes were tinged with a slight red color. However, he eventually took in a deep breath and suppressed the anger in his heart. No matter what, he knew that Song Tai was the overseer of the Wanxiang City and he possessed the highest authority here. A single word from him could strip an empire’s qualification to enter the contest. Even though the Wind Cloud Empire had a similar backing, water from afar could not put out the fire here.\n Clearly, Feng Cang’s level of self-discipline was rather high. Under such an infuriating situation, he could still gradually hold down the fury in his heart. However, the killing intent in his eyes were so dense that it was practically about to shoot out and materialize. He fiercely turned his head around and stared at Lin Dong with bitter resentment.\n “Lin Dong, don’t assume that I will drop this matter. If he wants to shelter you in Wanxiang city, I cannot do anything. However, we will enter the core zone to participate in the Hundred Empire War in two days. Once you leave Wanxiang City, even he will not dare interfere in conflicts among the various empires. By then, I will let you know the consequences of offending the Wind Cloud Empire!”\n Feng Cang’s cold voice was overflowing with murderous intent as it resounded throughout the auction area, causing everyone to tremble with fear. It appeared that Feng Cang would not let Lin Dong and his counterparts off.\n It was clear that Song Tai wanted to help Lin Dong. If he wanted to protect Lin Dong in Wanxiang City, no one could do anything about it. However, the Hundred Empire War was starting in two days. When that moment came, Lin Dong would certainly participate in the war, and when he stepped into war, the first thing he would encounter was the Wind Cloud Empire’s wrath.\n Traces of chilliness seeped out Lin Dong’s eyes as he stared back at Feng Cang’s bloodshot eyes. After a moment, Lin Dong grinned and replied in soft voice, “Since you’re interested, we will play along with you. It just so happens that I am very interested in your Heavenly Soul Treasure. After killing you, I still can save such a huge amount of Nirvana pills. It’s a rather good deal after all.”\n “Haha! The Heavenly Soul Treasure is in my hands. If you have the guts, come and take it from me. I will be waiting for you!”\n Feng Cang was so angry that he started laughing. It appeared that Lin Dong’s arrogant words had provoked him significantly. He stared darkly at Lin Dong while revealing his sinisterly white teeth.\n “However, I look forward to the outcome in two day. If your tongue is still so sharp at that time, I will truly have to acknowledge your unyielding character.”\n “Go!”\n After finishing his sentence, Feng Cang abruptly waved his hand. Without further ado, he turned around and left with his overflowing killing intent.\n Meng Lie stood up as well and swiftly caught up. As he left, he looked mockingly and cruelly at Lin Dong and his counterparts while making a slitting action on his throat. His intention was clear as day.\n After Feng Cang and his counterparts left, the atmosphere in the huge auction area finally loosened up a little. Numerous gazes constantly shot towards Lin Dong and his counterparts. Some were filled with sympathy while others were filled with joy at their misfortunes. Both types of gazes contained a little anticipation. Looks like they would have the chance to witness the first epic and ferocious battle in two days when the Hundred Empire War started.\n In two days, they would know who was stronger, the super empire, or the dark horse, Lin Dong.\n “Such an arrogant fellow. It seems that a fierce battle is unavoidable….” Little Marten chuckled as he spiritedly watched the receding auction crowd.\n “Let’s go, time to make some preparations when we’re back. Since the challenge has been issued, we shall naturally receive it.”\n Lin Dong smiled. His face did not show any signs of fear at all. Even though Feng Cang had obtained the Heavenly Soul Treasure today and his fighting capabilities would be greatly increased, it was still too early to make a conclusion on who would emerge as the victor.\n After saying these words, Lin Dong turned around and cupped his hands towards towards Song Tai. Even though Feng Cang had wanted to settle the matter on the spot and Lin Dong did not mind, he would be more than happy to accept another two days of preparation. Therefore, he appreciated Song Tai’s favor.\n With regards to Lin Dong’s respectful gesture, Song Tai merely waved his hand. Soon after, he turned around as a voice that was audible to only Lin Dong silently rang across the place, “Lin Dong, this is all I can do. The battle two days later will depend on your capabilities. At least, Feng Cang and his counterparts will not dare to do anything to you within these two days. You can make your preparations peacefully….”\n Upon hearing this voice, Lin Dong grinned and lightly nodded. Without saying anything else, he left the auction market with Little Flame and the rest.\n Mu Lin watched the figures that had captivated everyone’s attention leave and could not help but lament as he softly remarked, “I had initially believed that our Lone Moon Empire and the Wind Cloud Empire would fight over this auction. I never expect us to become spectators in the end. Lin Dong truly knows how to seize the limelight….”\n “I’m afraid they will be in troubles two days later,” Mu Hanyue slightly furrowed her umber-black eyebrows and said. She knew that Lin Dong and his counterparts were quite capable, but the Wind Cloud Empire’s were exceptionally ferocious and tough. Furthermore, they had obtained a Heavenly Soul Treasure today. Even the Lone Moon Empire did not dare to provoke them, yet Lin Dong and his counterparts...\n “It’s indeed troublesome.”\n With regards to this fact, even Mu Lin who usually had high expectation of Lin Dong nodded his head solemnly. He then sighed, “Right now, we can only wait and see. Sigh, the Wind Cloud Empire is so powerful, I don’t even know if Lin Dong and his party can pass this ordeal.”\n After saying this, Mu Lin clearly did not wish to speak anymore. With a wave of his hand, he left the auction with his men.\n Even though Wanxiang City was extremely huge, the news of what happened in the auction spread throughout the city within half an hour. Immediately, the atmosphere of the entire city began to boil.\n Who were the Wind Cloud Empire? They were the super empire that dominated Wanxiang City. Although the fighting amongst the four great super empires never ceased in Wanxiang City, everyone knew that the Wind Cloud Empire were the most powerful.\n The Wind Cloud Empire might have an impressive reputation, but at the same time, Lin Dong who had barged into the scene was also no nameless individual. Though he was from a low rank empire, he was still able to defeat numerous high rank empires. In fact, he had even single-handedly defeated the combined forces of the Northwest Region’s three overlords. Next, he had also dominated two of the four mysterious sects’ inheritance and even suppressed the two elite practitioners of the Great Gan Empire!\n Three of the four top ranks on the Nirvana Monument in the Wanxiang City were monopolized by Lin Dong and his friends. In one day, Lin Dong had legitimately obtained the first rank of the Earth category by defeating Luo Tong, the Four Yuan Nirvana stage former number one ranker in the Earth Category!\n These numerous achievements of his were enough to make anyone forget about his low rank empire identity. Thus, when everyone knew of the battle between Lin Dong and Feng Cang, they did not think that Lin Dong and his counterparts were overestimating their capabilities. Instead, the people were in anticipation, the kind of anticipation that normally arose due to an evenly matched situation.\n It was evident that in many people’s eyes, the low rank empire Lin Dong already possessed a reputation on equal footing with these super empires!\n Naturally, this reputation would have to be justified by the result of the intense battle in two days.\n If Lin Dong claimed victory, his name would cause boom throughout the Ancient Battlefield. If he lost, his miraculous reputation would come to an end….\n Moreover, this battle would be the first battle in the Hundred Empire War that was between a super empire and a rising dark horse. Its result was definitely highly anticipated.\n Under the people’s anticipation, two days passed in a blink of an eye.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-575","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\n \n Official Sypnopsis\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \n 武之极，破苍穹，动乾坤！\n On the Journey of Cultivation, \n One must steal Ying and Yang, \n Sieze the Laws of Creation, \n Reach for Nirvana, \n Obtain Mastery over Life and Death, \n and Power over Reincarnation.\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
