{"id":60572,"no":816,"title":"Chapter 814: Shock","content":"Chapter 814: Shock\\n\\n With the Great Sect Competition slowly coming to a close, the various factions also began to leave the Unique Devil Region one after another. Sure enough, as people left, the events that had occurred in Unique Devil Region also frantically spread like wildfire.\\n\\n Yuan Gate disciples, completely annihilated!\\n\\n The face of anyone who had learnt of this news would definitely be filled with shock and disbelief. Yuan Gate was the strongest super sect in the Eastern Xuan Region, and its disciples were usually the elite amongst the younger generation of the Eastern Xuan Region. Every batch of three little kings from Yuan Gate would have difficulty finding an opponent who could match them amongst the younger generation of the Eastern Xuan Region.\\n\\n However… during this Great Sect Competition, not only were the Yuan Gate three little kings killed, but even the five hundred over Yuan Gate elite disciples were unable to walk out alive from the Unique Devil Region!\\n\\n Just what had happened within the Unique Devil Region?\\n\\n News spread in a crazy manner. Soon, the answer to that question also spread. Everyone became slack jawed when they heard about the mastermind behind it.\\n\\n The expected situation where a couple of great sects joined hands to deal with the Yuan Gate disciples did not occur. Neither was there the expected huge scale chaotic battle between disciples. A single person… had fought against all the Yuan Gate disciples alone, and completely massacred them in the end…\\n\\n Dao Sect’s Lin Dong.\\n\\n In a short night, this name had swept across the entire Eastern Xuan Region at a terrifying speed.\\n\\n “This person is truly a monster…”\\n\\n This was the only thought everyone had after hearing the news. They were really unable to understand how it was possible for Lin Dong to defeat not only the Yuan Gate three little kings, but also finish off such a quantity of Yuan Gate disciples with just his power alone…\\n\\n This was not something that a single person could achieve!\\n\\n While many people were shocked by this news, some of the sharper individuals began to sense the subsequent brewing storm. Although the disciples from the various sects would ultimately suffer some losses during each Great Sect Competition, there had never been an incident of losing every single disciple…\\n\\n Moreover, the main characters of this incident were the Yuan Gate disciples!\\n\\n As the strongest sect on the Eastern Xuan Region, this matter would undoubtedly completely trigger the Yuan Gate’s fury. While no one needed to be responsible for any deaths or injuries during the Great Sect Competition… given the Yuan Gate’s style, how was it possible for them to swallow such a bitter pill alone?\\n\\n The loss of hundreds of elite disciples was like cutting off the Yuan Gate’s flesh despite its great foundation.\\n\\n Hence, after receiving this shocking news, some of the more sensitive individuals could sense that an even more terrifying storm was brewing…\\n\\n ……\\n\\n The teleportation formation within the Unique Devil Region led to Unique Devil City. Hence, this place became the source of the information, the liveliness of the city had once again soared. The battle between Lin Dong and the Yuan Gate disciples had undoubtedly become the topic of greatest interest in the city.\\n\\n Due to this being the location where the disciples returned to, the various super sect group leaders did not leave Unique Devil City. Instead, they quietly waited for the disciples from their respective sects to return. Obviously, the Yuan Gate group leaders were amongst them. However, their wait did not lead to the usual news of success. Instead, they ended up receiving news that caused all of them to feel dizzy.\\n\\n Yuan Gate disciples, completely annihilated!\\n\\n While the news spread, the Unique Devil City was in an uproar over it, countless pairs of eyes were also cast towards the location where the Yuan Gate residence was in the city. They could imagine that all hell had broken out in that place…\\n\\n Bang!\\n\\n In a large hall with a heavy atmosphere, a solid wooden table was suddenly turned to dust by the slam of a palm. The roar of an elder with ferocious expression and scarlet red eyes thundered across the hall.\\n\\n “Completely annihilated? Can someone tell me just what is going on? How can that little bastard called Lin Dong from the Dao Sect possess such capability?”\\n\\n At this moment, there were about a dozen Yuan Gate upper echelon in the hall. There were six elders amongst them whose faces were filled with extreme rage. They were the ones leading the Yuan Gate team this time around. At the same time, they were also section heads of the Yuan Gate’s eight sections, which was equivalent to the four hall chiefs of the Dao Sect’s four halls. Each of them was at the advance Profound Life stage.\\n\\n “That little bastard must have employed some kind of dirty methods. Otherwise, how can he possibly be a match for Yuan Cang. Even someone as fierce as Zhou Tong from back then was unable to cause our Yuan Gate disciples to suffer such losses!” Another elder also spoke with a somewhat twisted face.\\n\\n “That brat, just what is his background? Isn’t the strongest disciple from Dao Sect Ying Xiaoxiao? Where did this Lin Dong come from?” Another elder asked in a dark voice.\\n\\n The remaining people were at a loss upon hearing these words. Lin Dong’s strength was not considered outstanding amongst the Dao Sect disciples. Who would pay attention to him for no reason?\\n\\n “Sir Liu You… this Lin Dong… is the champion of the Hundred Empire War a year ago. However, he did not choose to join our Yuan Gate in the end and had instead went to the Dao Sect…” A person in the large hall suddenly replied carefully.\\n\\n “What? He already possesses such ability after having joined the Dao Sect for a mere year? Liu Tong, how did you make your selection back then? You actually allowed such a person to join the Dao Sect?” The elder from earlier shouted sternly. His face immediately turned cold when he heard this.\\n\\n The person who had replied trembled for a moment when he heard the stern shout. He lifted his head and revealed a face filled with bitterness. Surprisingly, he was that Liu Tong, who had went to the Hundred Empire Mountain to choose disciples back then.\\n\\n “Sir, that little brat seems to be very resistant to our Yuan Gate. I had spent a lot of effort to convince him, but he still refused to join.” Liu Tong answered with a bitter smile. He was really unable to imagine that the young man, who was nothing in his eyes a year ago, would actually completely annihilate their Yuan Gate disciples in the Great Sect Competition a year later…\\n\\n “Disgraceful bastard. If you are unable to pull such a person to our side, you should find an opportunity to dispose of him. Are you stupid?” An elder cried out in fury.\\n\\n Liu Tong felt like a late autumn cicada that could not chirp as he hurriedly agreed. He was aware that these people were currently not in the right state of mind due to anger. Should they be displeased, it was likely that they would even attack.\\n\\n “It is pointless to be angry now. Everyone, how should we handle this matter?” An elder with an ice-cold expression waved his hand and spoke in a deep voice.\\n\\n “Our Yuan Gate disciples are not people that can be killed so easily. We cannot let off Lin Dong off so easily!” A person spoke with a dark tone.\\n\\n “However, the Great Sect Competition has its rules. If we are to take action, we will be breaking the rules. It is likely that the Dao Sect will not sit back and do nothing. Those few hall chiefs from the Dao Sect are still waiting here after all.”\\n\\n “So what if the four of them are here? Don’t tell me our Yuan Gate disciples should just die for no reason?”\\n\\n “That’s right. We must definitely make that brat pay with his life. Otherwise, what dignity will our Yuan Gate possess in the future?”\\n\\n “……”\\n\\n Furious noises spread and echoed within the large hall, as murder was revealed in each and every one of these Yuan Gate upper echelon’s eyes. In the end, they came to a decision. They would first send this news back to the sect, while they would quietly wait for the Dao Sect disciples to exit here. No matter what, they absolutely would not easily let off that brat called Lin Dong!\\n\\n ……\\n\\n While the Yuan Gate\u0027s upper echelon argued until their faces turned red, the atmosphere within a guest room in which the Dao Sect disciples occupied in Unique Devil City was a little strange.\\n\\n Four people were seated within, while their hands gently stroked the back of their chairs. It was a long time before the sky hall master, Qi Lei, at the leader’s seat, finally adjusted his state of mind and slowly said, “That news… have you all heard of it?”\\n\\n Chen Zhen and the other two hall masters exchanged glances with each other. Soon after, they nodded with complicated expressions and said, “This news… is a little shocking.”\\n\\n “God dammit…”\\n\\n Qi Lei’s hand slammed heavily onto the table, as a curse involuntarily erupted from his mouth. “This little brat Lin Dong… just how the hell did he do it? How could he have not only killed the three little Yuan kings, but also murdered those five hundred over Yuan Gate disciples all by himself?”\\n\\n The Chen Zhen trio looked at each other. They shook their heads and pondered for a while before replying, “This matter… it does feel rather great…”\\n\\n The expressions of the three of them were all quite grave. However, these subsequent words caused their grave expressions to become extremely strange.\\n\\n “It might feel great… these Yuan Gate bastards have killed so many of our Dao Sect disciples. It is not the least bit excessive to kill all of them this time around!” Qi Lei nodded earnestly as he said.\\n\\n “*Cough*…”\\n\\n Chen Zhen coughed softly. From the looks of it, if he did not issue a reminder, they would continue getting entangled on the question about whether it felt great.\\n\\n “However, those Yuan Gate bastards will likely not let this matter rest…” The Earth Hall master, Xia Yan, remarked.\\n\\n “Humph, one’s life or death does not matter in the Great Sect Competition. Just how many of our Dao Sect disciples have been killed at the Yuan Gate’s hands in past Great Sect Competitions? Lin Dong did not go the least bit overboard. If their Yuan Gate dares to use this as a reason, our Dao Sect will accompany them until the end!” The Flood Hall master, Zhu Shan, snorted coldly.\\n\\n Qi Lei narrowed his eyes. He pondered for a moment before speaking, “Send this news back to the Dao Sect immediately. Tightly monitor the teleportation formation in the city at all times. Once Lin Dong and the rest appear, immediately head over and protect them. I believe that those old fellows from Yuan Gate will not simply leave like this.”\\n\\n “Aye.”\\n\\n The Chen Zhen trio nodded heavily when they heard this. A cold glint vaguely flickered in their eyes.\\n\\n “However… Chen Zhen, your Desolate Hall has really produced an incredible disciple this time…” Qi Lei suddenly looked at Chen Zhen. His voice was filled with carefreeness.\\n\\n “Even senior Zhou Tong from back then was not as domineering as this little fellow!”\\n\\n “Ha ha.”\\n\\n Chen Zhen lifted his head and laughed heartily. On his aged face, was unconcealable pride and joy.\\n\\n ……\\n\\n One day after another passed in Unique Devil City. The atmosphere inside the city also became increasingly tense. Everyone knew that the powerful experts from Yuan Gate and Dao Sect had yet to leave. Evidently, the Great Sect Competition might be over, but the subsequent matters had only just begun…\\n\\n On the fifth day, within Unique Devil Region, the young man who had already become the focus of attention for countless people, had finally begun to awaken from his unconscious state…\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-814","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
