{"id":60602,"no":846,"title":"Chapter 844: Three-headed Demon Snake","content":"Chapter 844: Three-headed Demon Snake\\n\\n Lin Dong’s group did not meet any tough foes during their subsequent journey. After all, there were only eight half step into Profound Life stage Demonic Beasts in the huge Mysterious Spirit Mountain. Earlier, three of them had been finished off by Lin Dong, and it was likely there were no longer any Demonic Beasts of that level present in the area. Although there were numerous ordinary Demonic Beasts, they were naturally unable to stop the fearsome Lin Dong group.\\n\\n Swoosh!\\n\\n A dozen figures pushed off tree branches with the tips of their feet, using the resultant force to rush forward. Finally, they broke through the dense forest. The glaring sunlight that shot into their eyes instantly caused them to squint a little, before swiftly opening their eyes again.\\n\\n The area that entered their sights was a lush greenery that was filled with lifeforce. An unusually large lake was located in the distance. The lake was a thousand feet large and its waters sparkled under the sunlight. A gentle breeze blew across the tranquil lake, causing some ripples to be formed.\\n\\n Some rushing wind sound were heard from their surroundings when Lin Dong’s group appeared around the lake. A couple of figures also swept out from the forest and finally landed around the lake.\\n\\n “This is the deepest part of Mysterious Spirit Mountain…” Gu Yan’s eyes watched the calm lake. Some excitement also flashed deep within her eyes as she spoke in a low voice.\\n\\n Lin Dong nodded slightly. He could sense the majestic life force in this area. The natural Yuan Power in this place was many times richer compared to elsewhere.\\n\\n “Looks like all of them have arrived…”\\n\\n Lin Dong’s eyes swept across the lake surroundings. The Wei clan and the other powerful factions, which they had met at the foot of the mountain, had mostly successfully reached this place. However, from the traces of blood that adhered to their bodies, one could tell that their journey was far from peaceful.\\n\\n While Lin Dong’s eyes were observing his surroundings, the group from the Black Dragon Pirates were staring at them from afar with surprise. Soon after, their expressions became a little ugly. Clearly, they did not expect that Lin Dong’s group would actually be able to so swiftly shake off three half step into Profound Life stage Demonic Beasts...\\n\\n “Those fellows…” Gu Yan’s eyes were icy as she looked at those people from the Black Dragon Pirates. Clearly, she was a little furious because of their craftiness from earlier.\\n\\n Lin Dong glanced at the group from the Black Dragon Pirates indifferently. After which, he withdrew his gaze, and turned towards the middle of the lake, where a small green island was located. A mysterious halo of light faintly scattered from the middle of the island.\\n\\n “The Life Mysterious Spirit Fruit will only appear when the sun and moon cross each other. That time is quickly approaching…” Gu Yan glanced at the gradually descending sun and said.\\n\\n “Where is that three-headed Demon Snake?” Lin Dong’s gaze shifted from side to side as he asked. Gu Yan had previously mentioned that there was an initial Profound Life stage three-headed Demon Snake in the deepest part of Mysterious Spirit Mountain.\\n\\n “It should be hiding in the lake depths. After attaining such strength, its intelligence is no longer inferior to that of a human.” Gu Yan solemnly looked at the calm and unfathomable lake with some caution and said.\\n\\n Lin Dong nodded slightly. He was aware that this was merely the calm before the storm. Once the Life Mysterious Spirit Fruit appeared, it was likely that this place would descend into chaos. At that time, the situation would definitely be a complete mess. All of them would have to depend on their own abilities in order to obtain the Life Mysterious Spirit Fruit from amidst the chaos…\\n\\n The atmosphere around the lake became a little more tense as the various factions gathered. There was rich caution and hostility in their eyes as they looked at each other.\\n\\n Wei Song’s group stood in the distance. His indifferent eyes swept over Lin Dong’s group, before a cold smile immediately surfaced from the corners of his mouth, while malicious intent swam within his eyes.\\n\\n Lin Dong had naturally also detected Wei Song’s dark and cold gaze. However, he merely glanced at the latter before withdrawing his gaze. The Wei clan group might be powerful, but the only one that could enter his eyes was that Divine Symbol Master. If that group dared to have any ill intent towards them, Lin Dong would definitely not be merciful. Forget about their background, he would finish them off first before thinking about it…\\n\\n Time quickly passed amidst this tensed atmosphere, while the hot sun in the sky also slowly descended. At the same time, the moon began to leisurely surface on the other side of the sky.\\n\\n Buzz!\\n\\n The moment both the sun and moon appeared, everyone could sense that the Yuan Power in the depths of Mysterious Spirit Mountain suddenly begin to surge violently. The land trembled slightly, as ripples were formed on the calm lake. A bright glow continued to scatter from the small island at the middle of the lake.\\n\\n “The Life Mysterious Spirit Fruits are about to appear!” Gu Yan anxiously spoke in a low voice when she saw this scene. Her voice appeared both anxious and joyful.\\n\\n Lin Dong snapped to attention upon hearing this, as excitement gushed out in his eyes.\\n\\n Rumble!\\n\\n The island at the middle of the lake began to shake even more intensely, while the light that was emitted from the land became even stronger. At the end, many cracks began to spread from the island. Soon after, a giant tree, that was completely emerald green like a kingfisher, slowly broke out from underground.\\n\\n This giant emerald green tree was just like a newborn baby. It grew from the ground, while its branches and leaves spread outwards. Meanwhile, circular green light patterns that were filled with the power of life continuously scattered.\\n\\n These light patterns gathered on the tree at an astonishing speed. Within them were six most resplendent glowing spots...\\n\\n Buzz buzz!\\n\\n The light intensified, and in the end, the light actually gradually solidified. The six spots where the light had converged directly turned into six emerald green fruits!\\n\\n These fruits hung on the branches, while circular light patterns lingered around them. Their proud life force caused the natural Yuan Power in the air to appear as though it possessed life…\\n\\n “Six Life Mysterious Spirit Fruits!” Gu Yan gazed at the six emerald green fruits that had formed on the tree. The joy in her pretty eyes grew even more intense.\\n\\n “Are those the Life Mysterious Spirit Fruits? Why didn’t the three-headed Demon Snake take them away at an earlier time?” Lin Dong observed the giant tree that had broken out from the island at the centre of the lake and asked.\\n\\n “This Life Mysterious Spirit Tree can form nine Life Mysterious Spirit Fruits. Moreover, it will only mature when the ninth fruit appears. That three-headed Demon Snake has been waiting all along. Unfortunately… it will not be able to wait for that day to arrive.” Gu Yan explained.\\n\\n Lin Dong nodded slightly. If this three-headed Demon Snake was to decisively remove the Life Mysterious Spirit Fruits before news of them spread, it was likely that no one would ever know that such a heavenly treasure existed in this place. Unfortunately, its greed might result in it being unable to keep even a single Life Mysterious Spirit Fruit.\\n\\n Hu!\\n\\n Many burning red hot gazes stared intently at the gently swaying giant tree on the island in the middle of the lake. Those six emerald green fruits were like nature’s perfect creation. The life force being emitted by them continuously attracted their attention.\\n\\n Everyone’s breathing became heavier. However, no one acted immediately. Lin Dong was not in a hurry when he saw this. He was aware that there would ultimately be someone who grew impatient...\\n\\n After all, the temptation of the Life Mysterious Spirit Fruit was not small at all.\\n\\n Swoosh!\\n\\n Lin Dong’s guess was correct. Although those present were aware that it was no simple matter to obtain those Life Mysterious Spirit Fruits, even some of those who had great patience felt anxious when such magical treasures appeared in front of them. Hence, after a couple of minutes, there was finally someone who was unable to suppress the desire in his heart. A dozen figures rushed forward, and wildly charged towards the island in the middle of the lake.\\n\\n Lin Dong watched those figures as they rushed out. His eyes suddenly hardened the moment their bodies reached the air above the lake.\\n\\n Bang!\\n\\n An enormous water pillar suddenly exploded from the calm lake. From within the water pillar, many sharp jet-black water spears shot out. They shot towards those figures in the air from all directions.\\n\\n Splatter splatter!\\n\\n The sharp water spears contained an extremely ferocious energy. The bodies of some unlucky fellows were immediately cut by the water spears, as blood flowed from their wounds. Subsequently, piercing miserable cries suddenly sounded. A jet-black colour quickly spread outwards from their wounds, while their bodies swiftly festered. Evidently, they had been hit by an extremely deadly poison.\\n\\n Splash!\\n\\n Many figures fell into the lake amidst their miserable cries. Finally, they were pulled into the depths at the middle of the lake by something, and even their miserable screams vanished.\\n\\n Bang!\\n\\n A monstrous wave swept apart from the middle of the lake after these people fell into it. A moment later, everyone saw an enormous black figure swiftly appearing from within the lake, before it broke out of the water with a loud rumbling sound.\\n\\n Roar!\\n\\n The shadow of the enormous creature that broke out from the water enveloped a hundred feet radius, while a monstrously vicious aura spread from it.\\n\\n Everyone around the lake looked at the enormous creature, which had finally appeared, as their expressions also started to turn grave.\\n\\n “Has it finally appeared…”\\n\\n Lin Dong gazed at the huge Demonic Beasts with three giant heads, as he deeply exhaled. He could sense an extremely strong feeling of danger from the latter’s body. This feeling was even stronger than Yuan Cang from back then…\\n\\n Clearly, this creature should be the overlord of Mysterious Spirit Island, the three-headed Demon Snake…\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-844","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
