{"id":60618,"no":862,"title":"Chapter 860 - Chaotic Tower","content":"Around the lake where tents had been erected, a few Gu Clan disciples crowded around while feeling rather bored. As they chatted, their gazes continuously scanned the calm and tranquil lake.\\n\\n At the edge of the lake, Gu Yan’s beautiful eyes were observing the rippleless lake surface, as her umber black brows wrinkled slightly. Lin Dong had entered the lake depths for over one and a half months. During this period, there had been no activity at all...\\n\\n “Elder sister Gu Yan, it’s already been one and a half months…” Behind Gu Yan, Gu Ying wrinkled her brows and said. This unforeseen circumstance was obviously outside of their expectations. Normally, they would have ample time to wait for Lin Dong. However, there was only half a month left till the five clans martial gathering….\\n\\n If this continued, they might not even make it in time.\\n\\n “I’ll go down and take a look.” Gu Yan pondered for a moment, before finally gritting her teeth. She was very clear about the urgency of the matter, but she did not wish to give up on a potential external helper like Lin Dong, who was so difficult to get hold of.\\n\\n Upon hearing her words, Gu Ying and Gu Ya both nodded her heads.\\n\\n Swish.\\n\\n When Gu Yan took action, she would do so without any hesitation. Having made her decision, her body moved and she shot towards to centre of the lake. However, just as she was about to dive underwater, her eyes suddenly narrowed, before her figure rapidly retreated.\\n\\n Bang!\\n\\n As Gu Yan retreated, a gigantic pillar of water suddenly exploded from the surface of the calm and tranquil lake. Lake water that blotted the skies, before pouring down in torrents, transforming to something akin to a water screen. A figure flashed past the excited gazes of the Gu Clan disciples, before descending at the lakeside.\\n\\n “Big brother Lin Dong!” Upon seeing that familiar figure, Gu Ya instantly screamed out in joy, and hurriedly rushed over.\\n\\n Gu Yan had also descended. Her beautiful eyes stared at the figure that had shot out of the water. In the next instant, a faint change occurred to her beautiful face. Unable to control herself, she involuntarily exclaimed, “You… you’ve also broken through to the Profound Life stage?”\\n\\n Woosh\\n\\n The moment her words rang out, an uproar arose among the surrounding Gu Clan disciples. All of them stared at Lin Dong with some shock, while incredulous expressions surfaced on their faces. They clearly knew that when Lin Dong had entered the lake, he was only at nine Yuan Nirvana stage. Even though he also had a Life Mysterious Spirit Fruit, it was impossible for it to allow him to break through to the Profound Life stage.\\n\\n “I got lucky.”\\n\\n Lin Dong sent a smile towards Gu Yan, however he did not give any further explanation.\\n\\n Upon hearing his words, Gu Yan gave Lin Dong a deep look. She was able to guess, that the reason to the drastic rise in his strength might be due to a fortuitous encounter at the bottom of the lake. Looks like they had been infatuated by the Life Mysterious Spirit Fruit, and lost an even more precious treasure.\\n\\n Although she felt a little regretful, Gu Yan had a rather free and easy character, and quickly got over it. At the same time, she was a little happy. Lin Dong’s current strength had risen to the Profound Life stage. Although he had yet to completely stabilise at the initial Profound Life stage, he was already able to fight with initial Profound Life stage experts when he was still at the nine Yuan Nirvana stage. Now that he had properly stepped into this level, it would be difficult for him to find someone who of the same cultivation level who could match him. If they could invite him to be the external helper of their Gu Clan, he would definitely be able to substantially raise their chances of victory.\\n\\n “I’ve troubled all of you during this period…” Lin Dong said with a smile. He could tell that Gu Yan should already have completed her training long ago. The reason why they had stayed behind, was probably to help protect him. Although he had found a safer training area in the lake depths, he still had to thank them for their intentions.\\n\\n Gu Yan shook her head. After hesitating for a while, she did not beat around the bush. She stared at Lin Dong, and asked, “Lin Dong, I have a request…”\\n\\n “Oh?”\\n\\n Lin Dong’s eyes widened slightly as he smiled and replied, “Let’s hear it.”\\n\\n Upon hearing that Lin Dong did not immediately agree, Gu Yan secretly laugh bitterly, before explaining as clearly as possible about the matter of the five clans martial gathering, as well as Yuntian’s serious injuries.\\n\\n “You wish for me to be the external helper of your Gu Clan, and help you become the champion of this martial gathering?” After hearing all that Gu Yan had said, Lin Dong’s brows faintly wrinkled as he posed his question.\\n\\n “Yes.”\\n\\n “Apologies. It is my first time here at the Chaotic Demon Sea, and I’m not too familiar about this place. Therefore, I do not wish to participate in the battle between you and the other big clans.” Lin Dong said after some consideration. The five great clans were pretty powerful in this Heaven Wind Sea Region. If Lin Dong was to help the Gu Clan achieve victory, he would definitely make the other clans unhappy. He was not willing to do such a thing.\\n\\n He had little interest in this kind of senseless competition.\\n\\n Lin Dong’s refusal made the Gu Clan disciples feel slightly awkward, however, they did not have any other ideas, and could only smile bitterly while shaking their heads.\\n\\n Gu Ya looked at Lin Dong, however, she did not speak up for Gu Yan. Although she was pure and naive, she still knew that she could not force Lin Dong to do anything for them. The latter had already helped them so much during this trip. If they were to make any more requests, it would clearly be attempting to take advantage of his generosity.\\n\\n Gu Yan bitterly laughed. She somewhat understood Lin Dong’s character, therefore, she did not feel overly surprised by the latter’s refusal.\\n\\n Gu Yan was after all a somewhat cold and refreshing beauty, and any requests she had, would usually be obeyed by the men that flocked around her without question. However, the Lin Dong before her eyes had firmly rejected her. After all, although Gu Yan was beautiful, she was still lacking when compared to Ling Qingzhu. Her pure and chilly temperament was even more so unable to compare with the latter. Therefore, even if she had any superiority in outer appearance, in front of Lin Dong, it did not have the any use.\\n\\n “Lin Dong, do you know about the Chaotic Tower?” Even though Lin Dong had refused, Gu Yan did not give up. Her jadelike fingers stroked her fine black hair, as she looked towards Lin Dong and asked.\\n\\n “Chaotic Tower?” Lin Dong a little taken aback, before shaking his head slightly.\\n\\n “The Chaotic Tower is a training treasure land that has been passed down from ancient times. It was said that there’s a sort of Great Desolation Qi that is born from within it. This energy can clean the bone and marrow, hence its miraculous property of strengthening the physical body. Under the cleansing of this Great Desolation Qi, one will be able to totally transform. Many experts wish to obtain this opportunity.” Gu Yan explained.\\n\\n “Strengthen the body?” Lin Dong slightly raised his brow, however, he still did not show much interest. After all, his current physical body was already quite overwhelming.\\n\\n “This is a Great Desolation bead taken from within the Chaotic Tower. It contains some Great Desolation Qi.” Gu Yan extended her jadelike hands, and a deep yellow stone bead appeared within. With a flick, the stone bead shot towards Lin Dong.\\n\\n Lin Dong caught the stone bead and placed it in his palm. It felt rather cooling, and a faint desolate aura radiate from it. While grasping the stone bead, a thought passed through his mind, and a sliver of Devouring Force emerged.\\n\\n Humm.\\n\\n As the Devouring Force emerged, the Great Desolation bead within his hand instantly turned into dust. In the next moment, he felt an ancient and pure energy pour into his body.\\n\\n Following the appearance of the energy, green light suddenly erupted from within Lin Dong’s body, and a dragon roar could be faintly heard.\\n\\n Due to the eruption of green light from his body, Lin Dong’s expression changed slightly. He could feel the Green Heaven Materialized Dragon Skill that he trained in unexpectedly start to automatically activate. Obviously, this strange action was caused by the energy within that Great Desolation bead...\\n\\n This Great Desolation Qi was indeed extremely effective in tempering one’s body.\\n\\n “It is really something indeed…”\\n\\n Lin Dong muttered to himself. However, before his words could fade, a strong attractive force suddenly erupted from within the depths of his body. In a rude and unreasonable way, it forcefully absorbed the Great Desolation Qi.\\n\\n Roar!\\n\\n As the Great Desolation Qi was absorbed, the green light in Lin Dong’s body instantly erupted, as if trying to snatch the Great Desolation Qi back. However, at the final juncture, it was hurriedly suppressed by Lin Dong...\\n\\n “What the hell…”\\n\\n Lin Dong’s face turned exceptionally strange. He had discovered that the thing that snatched away the Great Desolation Qi was unexpectedly the Mysterious Stone Talisman within his body….\\n\\n Humm Humm.\\n\\n That strand of Great Desolation Qi was completely absorbed within the Mysterious Stone Talisman. Following this, a tiny thought radiated out from the stone talisman, which had not shown much activity even after so many years. There was no message within this tiny thought, just a greedy request...\\n\\n This request, was for Great Desolation Qi.\\n\\n “The Stone Talisman wants Great Desolation Qi?”\\n\\n The corners of Lin Dong’s mouth faintly turned downwards. This was the first time that the Stone Talisman had taken the initiative and put forth a request...\\n\\n Currently, Lin Dong was rather clear about the origin of the Mysterious Stone Talisman. It was an item that belonged to an expert standing at the peak of the ancient world, the Symbol Ancestor. From the Great Desolate Tablet, he knew that the Mysterious Stone Talisman had suffered serious damage. In addition, it had also mentioned that in order to reawaken the Stone Talisman, it would depend on his luck...\\n\\n From the looks of it now, could this Great Desolation bead be the opportunity to reawaken the Stone Talisman?\\n\\n An intense sparkle flashed within Lin Dong’s eyes. In the next instant, he raised his head abruptly, and looked towards Gu Yan with a smile.\\n\\n “Miss Gu Yan, how can I enter that Chaotic Tower?”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-860","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
