{"id":60634,"no":878,"title":"Chapter 876 - Powerful","content":"Clang Boom!\\n\\n The gigantic energy light pillar rushed into the clouds, as loud thunderous noises rumbled in the surroundings. Waves of energy rippled outwards, causing space itself to warp and distort.\\n\\n All around, astonishment and shock surfaced within countless gazes, as many looked at the strange sights in the sky. The expressions of many experts turned grave. An initial Profound Life stage expert should not be capable of such an act.\\n\\n “This fellow is truly formidable…” A few gazes turned grave as they looked towards the thin figure within the light pillar and muttered. They were able to sense exactly how terrifying the attack that Lin Dong had condensed was. It was evident that he truly wanted to settle the battle in a single move.\\n\\n Regarding his decision, a few shrewd and experienced experts did not find this strange. Against three powerful opponents with such strength, the longer he dragged this on, the more disadvantageous it would be for him. Instead, it would be better to utilise one’s full power with one’s strongest attack, and defeat the opponents in a single move. At times like this, any type of probing attacks would not have the slightest use.\\n\\n “However… the Wei Zhen trio are not easy to deal with…”\\n\\n Gazes suddenly turn around and looked towards the three figures within the square. At this time, due to the spectacle that Lin Dong had created, shock had appeared on the faces of those three figures. However, in the next moment, their expressions rapidly turned grim. They understood clearly that if they were defeated by Lin Dong despite collaborating, their fame and reputation would suffer a heavy blow.\\n\\n “Wanting to use our fame and reputation as your stepping stone, I think you must be dreaming!”\\n\\n Wei Zhen clenched his teeth, as his expression turned sinister and gloomy. In the next instant, his gaze turned towards the similarly overcast Chen Luo and said, “Brother Chen Luo, let’s attack with our full power. This brat is indeed not simple.”\\n\\n After witnessing the spectacle created by Lin Dong, it was evident that Wei Zhen had completely withdrew his disdain . In addition, he had a clear understanding that he probably could not block the attack by himself.\\n\\n “Agreed!”\\n\\n Chen Luo nodded his head. Although he did not want to admit it, against the frightening energy pillar that had saturated the sky, a sliver of terror had indeed appeared within his heart.\\n\\n As the two looked to each other, ominous glints flashed past their faces. One wielded a giant blade, the other wielded a long black spear. At this instant, two abnormally boundless Yuan Power unfurled from their bodies .\\n\\n Humm Humm!\\n\\n The boundless Yuan Power that surrounded the two seemed to transform into a storm, as they revolved violently. Yuan Power rubbed and chafed with the air, producing piercing buzzing sounds.\\n\\n Beside the two of them, Wei Li had also urged the Yuan Power within his body to its extreme. Although the quantity of his Yuan Power was inferior to that of Wei Zhen and Chen Luo, the strength of a peak initial Profound Life stage expert was still quite astonishing.\\n\\n “Lin Dong! Today, I want to see exactly how capable you are, to actually dare claim that you’ll be able to finish us off in a single move!”\\n\\n Wei Zhen held his giant blade and roared towards the heavens. An exceptionally swift and fierce blade glint instantly bubbled up within his eyes. Berserk Yuan Power shot gathered above his head his head, forming the shape of a mountain with a blade-shaped peak. A blade glint pervaded the air. It seemed to possess the frightening ability to slice apart space itself.\\n\\n “Hum!”\\n\\n Compared to the overbearing aura of Wei Chen, Chen Luo appeared exceptionally gloomy and sinister, as greyish black Qi curled around his body. The Qi was like terrible spirits as they bored into the long black spear in his hands. The piercing screams of thousands upon thousands of ghosts was rather horrifying.\\n\\n Anyone could see that this Wei Zhen, as well as Chen Luo, appeared to be displaying their strongest attack. Obviously, they were very clear that Lin Dong had put everything into this attack. As long as they could block it, Lin Dong would definitely have exhausted his limited abilities, and would definitely lose!\\n\\n Lin Dong hovered within the light pillar. Indifference surfaced within those pitch-black eyes as he looked towards the two people in the distance, whose auras were blotting the skies. In the next instant, his changing hand seals quietly froze.\\n\\n Bang!\\n\\n The instant Lin Dong’s hand seals froze, the space behind him instantly shattered, as dark void pervaded out. Within the void, a faint and blurry figure appeared. It was as if it came from an ancient time, and brought along a frightening fighting intent.\\n\\n This fighting intent spread out in this stretch of world, causing the scalps of innumerable people to turn somewhat numb. At this instant, they felt the blood within their body flare up. This kind of fighting intent was somehow able to affect their hearts and minds.\\n\\n Roar!\\n\\n Within the void, the figure that had passed through time faced the heavens and roared. Its roar seemed to contain an endless, world-shaking fury!\\n\\n Bang Bang Bang!\\n\\n As the roar sounded out, the Yuan Power in this stretch of the world immediately exploded. In the next instant, the figure took a step forward. With this step, it seemed to break through the void and emerge into the real world.\\n\\n Boom!\\n\\n However, the figure was still unable to break through the boundary between time and space. As its foot stepped forward, an endless fighting intent condensed, and formed a giant glowing seal, which descended with a loud rumble. In the next instant, it broke through the void, and ruthlessly fell onto the Wei Zhen trio.\\n\\n Before the giant glowing seal condensed from fighting intent touched the ground, the entire mountain peak was already shaking. On the square below, the ground within a thousand radius spontaneously collapsed, creating a gigantic black hole.\\n\\n “Mountain Transform into Blade, Cut!”\\n\\n Wei Zhen raised his head, and looked at the giant glowing seal that had passed through the void with a grave expression. Under its frightening fluctuations, all of the fine hairs on his body were standing straight up. Quickly after, his eyes suddenly turned stern, as his hands clenched tightly on the hilt of his giant blade. With a roar, he chopped down furiously.\\n\\n Bang!\\n\\n The instant the giant blade chopped down, the mountain that had formed above his head started to tremble violently. The main peak proceeded to break off, as boundless blade glints swept across the sky. The peak burst open, transforming into a mountain blade thousands of feet long. In the next instant, it inclined and chopped down towards that glowing fighting intent seal.\\n\\n Beside him, Chen Luo also roared at the heavens, while greyish black mists saturated the air around him. Innumerable strange ghost faces appeared on the surface of the long spear in his hand, as sinister and cold fluctuations radiated out.\\n\\n “Ten Thousand Soul Devouring Ghost Spear!”\\n\\n Chen Luo’s palm suddenly patted the shaft of the spear, as it tore through the air. Black mist curled around it, transforming it into a black meteor. It pierced through the void, and viciously howled towards the glowing fighting intent seal.\\n\\n “Furious Wave Swallowing Whale Palm!”\\n\\n Behind the two, Wei Li used all of his Yuan Power to display the strongest attack he had, and sent it rumbling out.\\n\\n Bang Bang!\\n\\n Three extremely tyrannical attacks shot through the sky with an astonishing speed. Under the countless fiery gazes and bated breaths, they collided violently with the descending glowing seal!\\n\\n Boom!\\n\\n At the instant of the collision, the entire stretch of world seemed to turn quiet. Next, everyone saw tyrannical energies crazily erupting in the sky!\\n\\n It was akin to a volcano that that erupted in the sky, exceptionally loud and terrifying.\\n\\n The berserk energies swept out in an unparalleled manner, causing a few experts who were floating in the air to suffer from the aftershocks. They spurted mouthfuls of blood, before hurriedly descending in a miserable manner.\\n\\n The older generation of the four clans immediately took action, as vigorous Yuan Power radiated out, forming a barrier that shielded the seats of the various clans. Only by doing so did they avoid any injuries. However, the ear-piercing creaks when those energies impacted the barrier, caused the expressions of many people to change. If such an attack landed on one’s body, there would likely be nothing left of the person.\\n\\n The remnant energies spread frantically, lasting for several seconds before gradually dissipating. At this instant, the entire mountaintop appeared exceedingly disordered and chaotic. Many unlucky fellows who were caught in the aftermath had dishevelled hairs and looked extremely miserable.\\n\\n This chaos lasted for a while, before gaze after gaze turned towards the sky with swishing sounds. They wanted to know the result immediately...\\n\\n Fiery gazes converged in the sky. In the next instant, they saw four figures facing off in the distant skies...\\n\\n Urgh.\\n\\n Under the convergence of those innumerable gazes, Wei Li was the first to spurt out a mouthful of blood, before the clothes on his body exploded. Blood spurted and shot out of the pores of his skin, as he fell head first towards the ground. His aura was extremely weak, and it was obvious that he had suffered extremely serious injuries.\\n\\n “How is this possible…”\\n\\n Wei Zhen’s hair draped across his shoulder, with blood stains covered his entire face. His hands trembled as they held onto the giant blade, while blood dripped down from the sharp end of his blade. Currently, his originally grim and fierce eyes, were now filled with terror and disbelief. He was truly unable to believe that with their combined strength, Lin Dong had still forced them into such a state...\\n\\n Beside Wei Zhen, Chen Luo’s palms were still holding tightly onto the long black spear. However, his faintly trembling body revealed that the situation within his body was not calm.\\n\\n Lin Dong’s pitch black eyes stared at the two of them, before two low and deep muffled noises rang out from his body, as two bloody holes exploded on his arm. However, he only spared a light glance at his injuries, before withdrawing his gaze, and proceeded to stare indifferently at the two people standing in the air in front of him.\\n\\n “You’ve lost.”\\n\\n An indifferent voice rang out slowly from Lin Dong’s mouth.\\n\\n Urgh!\\n\\n Just as his words rang out, Wei Zhen and Chen Luo each spurted a mouthful of blood. Cracks had actually appeared on the surface of the giant blade and black spear, as their brilliance became extremely dim.\\n\\n As they spurted out blood, the two of them appeared like birds with broken wings, as they helplessly fell from the sky, while drawing dark red scars in the air. Under the deathly silence that occupied the entire mountain, they landed heavily on the ground. The immense force of their landing created gigantic fissures on the ground.\\n\\n As the two landed on the ground with a loud bang, the entire area was filled by a deathly silence. Countless gazes stared at the two bloody figures, as their mouths slowly started to fall open...\\n\\n “Can the result be announced?”\\n\\n Silence filled the entire mountain. Lin Dong stood in the air, as he quietly used his slightly trembling hands to rub away the bloodstains on his arms. Subsequently, he turned his gaze towards the Shentu Clan referee, as a flat and soft inquiry slowly echoed within the silence.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-876","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
