{"id":60640,"no":884,"title":"Chapter 882 - Asura Earthly Demonic Prison","content":"Hum Hum!\\n\\n Monstrous jet black light crazily swept out. In the blink of an eye, even the sky had turned dark. Jet black light was like a dome that enveloped the sky above the square, while an indescribably baleful aura started to hover and gather in the sky.\\n\\n At this very instant, even the Yuan Power in the area seemed to have become exceedingly dense and heavy, making it hard for people to absorb it. This area seemed to have been saturated by a baleful aura.\\n\\n Jet black light erupted from Shentu Jue’s eyes. At this moment, under the jet black light that covered the sky, he was like an asura that had crawled out from hell. His presence was an extremely terrifying.\\n\\n “Lin Dong, this is my final trump card. If you can break out of this prison, I’ll admit defeat!” Shentu Jue’s eyes flickered with jet black light as he stared at Lin Dong and grinned. His grin was suffused with baleful aura.\\n\\n Lin Dong’s gaze was grave as he observed the change in Shentu Jue. He seemed to be unable to absorb the surrounding Yuan Power due to the domain of jet black light. As for Shentu Jue, he was able to endlessly absorb this baleful aura...\\n\\n “Such a formidable technique.”\\n\\n In the face of such a situation, even Lin Dong could not help but secretly give praise to Shentu Jue. It was no wonder that the latter was feared to such an extent by the geniuses from the other four great clans. Even Lin Dong felt that this move of his was considerably problematic.\\n\\n “Within this demonic earth prison, I’m afraid that you’re destined to lose!”\\n\\n Shentu Jue clenched his fists, as jet black light extended from his hands, transforming into two long jet black sabres. Jet black light flickered on the blades, while extremely cold and sinister fluctuations radiated from them.\\n\\n Gripping the two sabres, Shentu Jue’s gaze abruptly turned ice-cold. As his gaze turned ice-cold, the monstrous baleful Qi within the demonic earth prison instantly erupted.\\n\\n Rustle!\\n\\n Shentu Jue’s arms moved, and the two sabres had already chopped down furiously. Piercing howls immediately rang out, as two gigantic jet black blade glints, at least a thousand feet long instantly formed. With extremely astonishing speed, they viciously slashed at Lin Dong.\\n\\n As Lin Dong looked at the blade glints that were rapidly growing in his eyes, his expression turned somewhat grim. He was able to clearly sense that the power of Shentu Jue’s attack was amplified in this demonic earth prison. If one were to be hit by the incoming blade glints, even those of Wei Zhen and Chen Luo’s calibre would likely instantly suffer serious injuries.\\n\\n With a thought, the blade like green dragon wings behind Lin Dong’s back furiously rotated to their sides, forming two sharp full moons. Green light erupted explosively, and a green dragon phantasm was faintly discernible, before transforming into a protective screen in front of him.\\n\\n Bang!\\n\\n Brimming with astonishing force, the blade glints violent slashed down on the green dragon phantasm. Instantly, a loud noise rang out, as gales swept out, while Lin Dong’s body was smashed a dozen steps backwards. As he shot a glance at his wings, he saw that some of the dragon scales were already shattered. Shentu Jue’s attacks were clearly growing more and more ferocious...\\n\\n “Heh heh. My attacks have only just started. I wonder how many rounds your green dragon battle armor can last?” Shentu Jue rested his sabres on his shoulders. He grinned as he gazed at the miserable looking Lin Dong, before opening his mouth. In the next instant, an extremely boundless jet black light howled out from within.\\n\\n Hum!\\n\\n As the jet black light swept out, the baleful Qi that within the demonic earth prison rapidly gathered. After a series of hums, it finally transformed into jet black blade glints.\\n\\n These numerous blade glints were densely packed in the air. Jet black light gathered on the surface of the blades, seemingly forming ghostly faces, while a frighteningly baleful and deadly aura spread out in the sky.\\n\\n This scene caused even the experts, who had the qualifications to break through to the advance Profound Life stage, to be struck with terror. Every single blade glint was stronger than the two that Shentu Jue had sent out previously. In addition, the large numbers... made everyone feel their scalps turn numb.\\n\\n “Asura Blade Prison.”\\n\\n With a wave of his sleeve, the hundreds of jet black blade glints instantly tore through space, covering the entire sky, as they explosively shot towards Lin Dong.\\n\\n Swish!\\n\\n Lin Dong’s expression was grim as he gazed at the astonishing blade glints that were shooting towards him. Opening his mouth, a scarlet red ray of light whizzed out. Facing the wind, it rapidly expanded, transforming into a scarlet red cauldron.\\n\\n Clang clang clang!\\n\\n The blade glints violently hacked at the scarlet red cauldron, causing sparks to shoot out explosively. Under such a berserk attack, the glow on the surface on the Burning Sky Cauldron turned somewhat dim; however, it still managed to receive all the attacks from the blade glints...\\n\\n However, although he had successfully defended against this attack, Lin Dong’s expression did not relax at all. At this very moment, there were still innumerable jet black blade glints that floated in the sky. If he was hit by all of them, even if his physical body was stronger than it was now, he would still be riddled with a thousand bloody holes.\\n\\n “You managed to block it, huh…”\\n\\n Shentu Jue looked in amusement at the spectacle before him, and smiled. Forming a seal with his hands, he said in a soft voice, “Congeal.”\\n\\n Hum Hum!\\n\\n As he said that word, the innumerable blades that blotted the sky suddenly started humming again, before abruptly sweeping forward. However, instead of launching attacks, they started to condense together. Finally, under Shentu Jue’s smiling gaze, they transformed into a jet black blade Qi a dozen feet long.\\n\\n This jet black blade Qi was rather small. However, even Lin Dong was able to feel an extremely dangerous aura radiating from its surface. Shentu Jue had actually completely compressed that numerous berserk blade glints into this blade Qi.\\n\\n The killing power it possessed would undoubtedly be extremely devastating.\\n\\n “Go.”\\n\\n Looking at the grim faced Lin Dong, Shentu Jue faintly smiled, before extending his finger.\\n\\n Roar!\\n\\n Following his action, an astonishing asura roar suddenly erupted from within the jet black blade Qi, as a baleful aura spread out in a ferocious manner. With a swish, the jet black blade Qi explosively shot forward.\\n\\n Creak Creak!\\n\\n The speed of the jet black blade Qi was indescribably fast, and it seemed to have pierced through the obstruction of space. As the sound rang out, Lin Dong pupils contracted, and he could already feel a piercing pain from his forehead. Quickly after, bright green light swept out from his body like a tidal wave. The Green Heaven Materialised Dragon Skill had been pushed to its limits.\\n\\n He knew that he was simply unable to evade this strike from Shentu Jue!\\n\\n “It’s the end…” Looking indifferently at this scene, a murmur emerged from Shentu Jue’s mouth.\\n\\n Bang!\\n\\n An earth-shattering explosion noise abruptly rang out from the green light, as frighteningly swift and fierce blade Qi poured out in torrents, causing the ground to instantly split and shatter.\\n\\n “It is over…”\\n\\n A relaxed voice emerged from Shentu Tao’s mouth at this instant, as his bright eyes looked at the square. In that instance, he could clearly feel that that Shentu Jue’s attack had landed on Lin Dong’s body.\\n\\n No matter how powerful Lin Dong’s physical body was, an attack of that degree would definitely seriously injure or even kill him. This fight had already ended.\\n\\n Upon hearing this, Shentu Rong heavily breathed a sigh of relief. However, this time round, she did not display any contempt. Within their generation, there were less than five people who had the qualifications to force Shentu Jue to use the Asura Earthly Demonic Prison in the Heaven Wind Sea Region.\\n\\n “Has he lost…” As Shentu Tao said those words, on the Gu Clan side, the expression of Gu Shou had also turned dim.\\n\\n Gu Mengqi clenched her jadelike hands tightly, as her beautiful eyes locked onto the jet black light. Has it truly ended….\\n\\n “Indeed, it is still impossible…” Gu Yan said with a bitter smile. Shentu Jue’s strength had already reached such a level. It was difficult even for Lin Dong to defeat him.\\n\\n “Ha ha…”\\n\\n Within the jet black light, Shentu Jue wore a smile on his face, as he stared at the place that had been devastated by the powerful blade Qi. After a moment, he shook his head, and turned around to leave. He had absolute confidence in this attack of his.\\n\\n “Thud.”\\n\\n However, the instant he turned around, the low sound of a footstep suddenly faintly rang out from the place that the blade Qi had devastated. This footstep immediately made Shentu Jue’s body freeze. Subsequently, he slowly turned around with an expressionless face. His pupils slightly contracted, as he stared at the thin figure that was slowly walking out from within the blade Qi that blotted the skies.\\n\\n That thin figure was totally covered in blood, as he slowly walked out of the area where the blade Qi had wreaked havoc. As he raised his head, a brilliant smile appeared on his face.\\n\\n Above his smile, a spirit brand flickered as it appeared on his forehead. As the spirit brand appeared, the baleful Qi within the demonic earth prison was instantly pushed away and scattered!\\n\\n “I’m afraid that it’s not over yet…”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-882","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
