{"id":60737,"no":981,"title":"Chapter 979 - Bait","content":"Bright red flames burned and rose to the sky. The light from the flames shone onto Lin Dong’s young face, reflecting his outline. The corner of his mouth still had a trace of blood, but his face currently had a charisma that would cause one’s expression to change.\\n\\n “What is that?” Mo Luo’s eyes stared intently at the crimson ancient tablet in Lin Dong’s hands. He finally asked hoarsely a short while later.\\n\\n The current him was still unable to recover from the fact that the Blazing Ancestral Symbol was ineffective against Lin Dong.\\n\\n Standing beside him, the Lightning Emperor was also a little lost for words. It was likely that he did not expect that Mo Luo’s most powerful attack, would actually be ineffective against Lin Dong. This outcome was something that even the Devouring Ancestral Symbol was unable to achieve.\\n\\n Lin Dong waved the crimson ancient tablet in his hand. The item was naturally the “Ancient Divine Flame Tablet” that he had obtained from the space, where the Flame Master was in a deep slumber. As the first owner of the Blazing Ancestral Symbol, the “Ancient Divine Flame Tablet” naturally possessed strength similar to the Blazing Ancestral Symbol. This was the main reason why Lin Dong was able to remain unharmed after Mo Luo used his most powerful attack.\\n\\n “An item left behind by the first owner of the Blazing Ancestral Symbol. It is called the Ancient Divine Flame Tablet…” Lin Dong softly replied.\\n\\n “Ancient Divine Flame Tablet… It is actually something that belongs to the Flame Master.” Mo Luo frowned tightly. Only then, did he slowly relax. Immediately, he shook his head helplessly. Although his mastery over the Blazing Ancestral Symbol was considered to nearly complete, it clearly paled in comparison to the Flame Master, who was a peak expert even during the ancient times.\\n\\n “This Ancient Divine Flame Tablet allows me to be immune to an attack from the Blazing Ancestral Symbol. If senior Mo Luo had used your own Samsara stage abilities to attack me, I’m afraid that I would be unable to take the third strike.” Lin Dong laughed.\\n\\n His words were true indeed. Currently, he had already used up all his trump cards and skills. The only thing left was the Ancient Divine Flame Tablet. However, this was only effective if Mo Luo used his Blazing Ancestral Symbol to attack him…\\n\\n This was considered a gamble. Fortunately, Lin Dong emerged as the winner.\\n\\n Mo Luo, who did not wish to give up on the Thunderbolt Ancestral Symbol, ultimately chose to unleash his strongest attack. However, he did not expect that his so-called strongest attack was coincidentally completely useless against Lin Dong…\\n\\n “Tsk tsk, what a formidable little fellow. Mo Luo… you have lost.” The Lightning Emperor involuntarily praised. This outcome was truly a shocking one. Who would have expected that a Samsara Stage expert and Ancestral Symbol owner would actually lose out to a younger generation member, who was merely at Profound Life stage…\\n\\n Although this might only be a three strike agreement, it would definitely allow Lin Dong’s name to tower over the entire Chaos Demon Sea, if word of this spread.\\n\\n Mo Luo was absent minded for a moment. Finally, he sighed and shook his head. He said, “You have indeed won.”\\n\\n Lin Dong’s eyes quickly revealed a wild joy upon hearing this. The intense pain that was emitted all over his body died down significantly at this moment. He was aware that given Mo Luo’s status and character, he would definitely not go back on his words.\\n\\n Putting in this way, he had genuinely won the rights to the Thunderbolt Ancestral Symbol from Mo Luo!\\n\\n Mo Luo looked at an excited Lin Dong before he involuntarily laughed. Even he did not expect this outcome...\\n\\n “However…”\\n\\n Mo Luo lifted his head. He looked at the ten thousand feet large lightning sun suspended in the sky before both his eyes narrowed. He was quiet for a moment before he said, “You can have the Thunderbolt Ancestral Symbol. However, I need to take away an essence of the Thunderbolt Ancestral Symbol.”\\n\\n “Take away an essence of the Thunderbolt Ancestral Symbol?” Lin Dong was startled.\\n\\n “What are you planning to do? If you extract an essence from the Thunderbolt Ancestral Symbol, the Thunderbolt Ancestral Symbol will be incomplete.” Standing beside him, the Lightning Emperor frowned as he spoke in a deep voice.\\n\\n “I have my own plan. If the Thunderbolt Ancestral Symbol is absent from this plan, I will at least require its essence force.” Mo Luo explained.\\n\\n “Why?” Lin Dong asked.\\n\\n “This is because I need it as a bait.” Mo Luo replied in a faint voice.\\n\\n “Bait?” Lin Dong focused his eyes.\\n\\n “There are currently many Yimo hiding in this world and they are an extremely powerful threat. Moreover, we have very little information about them. This time around, I plan to use the Thunderbolt Ancestral Symbol as a bait and lure some Yimo out. Of course, the Thunderbolt Ancestral Symbol currently belongs to you. Hence, I will take a step back and extract a thunderbolt essence in order to create a fake Thunderbolt Ancestral Symbol.” Mo Luo said.\\n\\n Lin Dong’s expression was slightly altered. Clearly, he did not expect that Mo Luo was actually planning on taking the initiative to lure the Yimo out. Wasn’t he afraid that his Flame Divine Hall would end up following the same path as the Lightning Cave?\\n\\n He was clearly inviting trouble onto himself.\\n\\n “Qing Zhi will also participate.” Mo Luo looked at Lin Dong and added.\\n\\n “Elder Qing Zhi?” Lin Dong was startled.\\n\\n “All of you are really bold. You are actually planning on using the Thunderbolt Ancestral Symbol to lure the Yimo…” The Lightning Emperor’s expression was a little grave. Even he was gravely shocked by Mo Luo’s guts.\\n\\n “The Yimo’s behaviour has been getting increasingly mysterious over the years. This has caused me to feel uneasy. This time around, I am planning to set up a trap to lure some Yimo out. Perhaps I might be able to obtain some information as a result…” Mo Luo said.\\n\\n “Hence, if I cannot obtain the Thunderbolt Ancestral Symbol, I can only choose this inferior option.”\\n\\n Lin Dong was quiet. A moment later, he asked softly, “When will your plan begin?”\\n\\n “In three months’ time.”\\n\\n “I will also head to the Flame Divine Hall three months later and protect the thunderbolt essence. Regardless of whether the plan succeeds, I will retrieve it.” Lin Dong spoke in a deep voice.\\n\\n Although merely extracting a thunderbolt essence would not hurt the foundation of the Thunderbolt Ancestral Symbol, it would cause the Thunderbolt Ancestral Symbol to be incomplete. It was obvious that Lin Dong would not allow a perfect Thunderbolt Ancestral Symbol to end up with defects.\\n\\n Mo Luo hesitated for a moment before he nodded.\\n\\n “In that case, senior Mo Luo, please extract a thunderbolt essence.” Lin Dong inhaled a deep breath of air and said.\\n\\n “Thank you very much.” Mo Luo slowly replied. Without further ado, his body moved and he appeared in front of the ten thousand feet lightning sun. Both his hands were extended and they actually turned into two enormous flame palms. After which, they were extended into the lightning sun.\\n\\n Rumble!\\n\\n Bright lightning light wildly flashed. A moment later, the flame palm was slowly drawn out. At this juncture, another cluster of extremely bright lightning glow was present on it. An ancient symbol seemed to have been vaguely formed while a mysterious ripple spread.\\n\\n “This Ancestral Symbol essence can only be extracted using another Ancestral Symbols, when it does not have an owner… On a whole however, having a small part missing is not considered as a major flaw.” The Lightning Emperor spoke by the side.\\n\\n Lin Dong nodded slightly as he softly said, “However, I will make it perfect once again.”\\n\\n Mo Luo waved his sleeve after he had extracted a thunderbolt essence from the Thunderbolt Ancestral Symbol in the sky. After which, he kept the essence. He moved and appeared in front of Lin Dong.\\n\\n “I have already achieved my objective and will not continue to remain here. Hopefully, you will be able to successfully refine the Thunderbolt Ancestral Symbol. If you do not come to the Flame Divine Hall in three months’ time, I will assume that you have most likely failed. In that case, I will retrieve the Thunderbolt Ancestral Symbol the next time I return.” Mo Luo glanced at Lin Dong and said.\\n\\n Lin Dong nodded. He understood the dangers involved in refining the Thunderbolt Ancestral Symbol. If he fails, he might have to pay with his life.\\n\\n “Lightning Emperor, farewell.’ Mo Luo turned around, cupped his hands together towards the Lightning Emperor and said.\\n\\n “Hopefully you will succeed. Haha, it is truly a little regretful that I am unable to fight alongside with you guys, owners of the Ancestral Symbols.” The Lightning Emperor laughed.\\n\\n “I will destroy all Yimo in this world.” Mo Luo’s voice was calm. However, it was filled with an unquestionable determination. That perseverance caused Lin Dong by the side to have a slight change in expression.\\n\\n “Goodbye.”\\n\\n Mo Luo once again cupped his hands together. He looked deeply at Lin Dong before turning around. His body turned into a fiery light that shot into the distance. Finally, it cut through space and disappeared.\\n\\n Lin Dong watched Mo Luo disappear. The hands under his sleeves slowly tightened. He could sense that a major incident was likely going to erupt in the Chaos Demon Sea in three months’ time…\\n\\n “Little fellow… enjoy your spoils. Of course, that is if you can succeed.”\\n\\n The Lightning Emperor laughed. His eyes quickly looked at the huge lightning sun in the sky and muttered, “It is likely that the Thunderbolt Ancestral Symbol will be quite satisfied with you as its new owner…”\\n\\n Lin Dong lifted his head to look at the sun before his expression gradually became firm. He had finally found a second Ancestral Symbol after so many years…\\n\\n Regardless of how difficult the refinement process was, he would definitely persevere on!\\n\\n Lin Dong inhaled a deep breath of air as he thought of this. His feet stepped on the empty space before he slowly walked towards the ten thousand feet large lightning sun. Finally, his body gradually vanished into the bright lightning sun in front of Mu Lingshan’s anxious eyes.\\n\\n The refinement of the Thunderbolt Ancestral Symbol has officially begun!\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-979","bookId":1514,"book":{"id":1514,"title":"Wu Dong Qian Kun","description":"Our Sypnopsis\\n The Great Yan Empire exists in a world where respect can only be earned through strength. Within this Great Yan Empire, the four great clans have always stood above the rest. Among them, a particular incident in the Lin Clan resulted in the banishment of a certain individual who went on to start his own family, in hopes of one day being recognized again by the Lin Clan, and rejoining them…\\n Hailing from a banished family of the Great Lin Clan, when Lin Dong was very young, he watched, powerless, as his talented father was easily crushed and crippled by the overwhelming genius of the great Lin Clan, Lin Langtian.With a despairing father, a heartbroken grandfather, and a suffering family, ever since that fateful day, Lin Dong has been driven by a deep purpose; to take revenge on the man who had taken everything and more from his family.\\n Armed with nothing but willpower and determination, join Lin Dong as he unknowingly discovers a destiny greater than he could ever hope to imagine when he stumbles upon a mysterious stone talisman…\\n \\n Official Sypnopsis\\n 修炼一途，乃窃阴阳，夺造化，转涅盘，握生死，掌轮回。 \\n 武之极，破苍穹，动乾坤！\\n On the Journey of Cultivation, \\n One must steal Ying and Yang, \\n Sieze the Laws of Creation, \\n Reach for Nirvana, \\n Obtain Mastery over Life and Death, \\n and Power over Reincarnation.\\n At the peak of Martial Arts, break through the Heavens and shake the Universe!\\n","cover":"http://cunovel.com/img/WDQK.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:22 AM"}}
