{"id":96340,"no":1,"title":"Page 1","content":"To my dad, who always liked werewolves, and to my husband, Eddie, for romantic strolls in the moonlight\n \"Beware of a kiss under the full moon.\n It will change your life forever.\"\n - Dr. Camille Meadows\n Chapter One Harvest Moon\n It began underneath the haunting glow of a full moon.\n I was deep within the woods with my boyfriend, Nash, my best friends, Ivy and Abby, and their boyfriends, Jake and Dylan, all of us huddled around a campfire and telling ghost stories. It was unusual for us to venture off into nature, as we spent most of our time in the safety of suburbia. The guys were acting brave, but we girls were cringing with fear. We were totally isolated - no hikers or campers were anywhere in sight. The fire pit and a few flashlights were our only sources of light in the dark night. I was snuggled against Nash, Abby was holding her boyfriend Dylan\u0027s hand, and Jake had his arm around Ivy. The logs crackled and the heat from the fire kept us warm in the crisp, late-autumn air.\n \"This is so freaky,\" Ivy whispered to me. \"I still can\u0027t believe you convinced us to come out here. There isn\u0027t a store for miles.\"\n Ivy was out of her element and doing her best to assuage her discomfort by sipping a latte and snuggling up to Jake.\n \"If only it wasn\u0027t so dark,\" Abby said, stretching out her long, lean legs on a blanket. \"We could hike, too.\"\n \"I can think of better things to do in the dark than hike,\" Dylan said, tickling her waist.\n \"That\u0027s the whole point,\" I said. \"Isn\u0027t it more romantic, underneath the moon and stars?\"\n With winter approaching, it was only going to become darker and colder, and I wanted to take advantage of being outdoors with my friends.\n \"Romantic?\" Ivy sighed. \"I\u0027m cold, in the middle of nowhere, and frightened to death by these ghost stories. This is your idea of romantic?\"\n I didn\u0027t have to respond. She already knew.\n \"Of course it is.\" Ivy grinned. \"Always the dreamer! I guess that\u0027s why you\u0027re my best friend.\"\n \"Hey!\" Abby said, sitting up.\n Ivy and I had been best friends before Abby joined our clique. Sometimes Ivy forgot her manners.\n \"I meant to say best friends,\" Ivy corrected. \"You both are.\"\n \"Catfight!\" Dylan said. \"Let me record this.\" He brandished his cell, but Abby was over Ivy\u0027s slipup as soon as Ivy gave her an apologetic hug.\n \"Anyway,\" I said to Abby, excited that I might have stirred up some interest. \"Maybe we can come here again during the day for a hike.\"\n She gave me two enthusiastic thumbs-up.\n \"Let\u0027s get through the next few hours,\" Nash said, finishing his s\u0027more, \"before we plan on any further \u0027Celeste Parker excursions.\u0027\"\n Normally I would have rolled my eyes at Nash\u0027s playful jab, but I was grateful that my boyfriend and his posse finally gave in to my suggestion for date night.\n I\u0027d been suggesting outdoor activities that didn\u0027t involve an opposing team or a goalpost for ages. I wasn\u0027t an avid outdoorsy type or anything, but I did prefer to do other things with my friends besides going shopping or watching sports. The reason the guys were game was the promise of food and the potential of scaring three girls to death.\n \"Well, I think we should listen to Celeste more often,\" Jake said, devouring the last Rice Krispies treat I\u0027d made for our outing.\n My friends acted as if I possessed superpowers for making the simplest of snacks.\n Shadows danced menacingly against the trees. The October night skies of the midwestern town of Legend\u0027s Run were beautiful. Stars glimmered like ten-carat diamonds. I\u0027d have wished on one that this night would never end, but I\u0027d settle for savoring the memories when I recorded these moments in my worn-out spiral notebook journal: the fresh air, my best friends giggling by my side, my date holding my hand.\n Nash squeezed me extra tight. I wasn\u0027t sure if it was because he was truly having fun or if, instead, he was wondering what he was going to gain by agreeing to this experience. He knew better than to press me too hard, but that didn\u0027t stop him from trying. Nash massaged my fingers and wrists and I was in heaven. I returned his smile. It was a spectacular night.\n \"This is awesome,\" I said. \"We must do this again. See? I do have great ideas.\"\n \"Yes, great,\" Nash concurred. Then he whispered so only I could hear: \"And we could make this night even greater.\"\n Like most girls in Legend\u0027s Run, I\u0027d had a crush on Nash since I could remember. He had handsome good looks and eyes that twinkled, and he possessed an air of confidence that made him stand out among our schoolmates. But behind his charming ways was a hint of insecurity. For me, I was almost as attracted to the possibility that he was not as confident as he appeared as I was to his appearance and his playfulness.\n Nash leaned in for a kiss and I melted against his lips. For a moment I lost track of where we were, until I heard my friends snickering. I lowered my chin and reached up to fix my hair and he reluctantly backed off.\n It was wonderful having my friends around me, and the attention from Nash was flattering. We were finally away from the cheering crowds, girls vying for him, or winning-obsessed coaches who normally surrounded Nash, the star athlete at our school. It was unusual for Nash to be focused on life beyond sports, so I cherished our perfect night together. Feeling like a lone wolf who prefers the companionship of the wolf pack, I felt safe in our clique. I\u0027d never been as happy in our group as I was tonight. I took pride knowing my friends were having fun hanging outside their comfort zone, and I enjoyed knowing Nash wanted to hold me more than a stitched leather ball.\n \"This is how it should always be,\" Ivy said. \"The six of us together.\" She raised her latte for a toast. \"Forever.\"\n We all grabbed our hot coffees and raised them toward the moon.\n \"Forever?\" Nash groaned. \"That\u0027s a long time.\"\n I wasn\u0027t shaken by his remark. Rather, it stirred something I\u0027d been feeling, too. Was Nash the kind of guy I wanted to be together with forever? Could I really see myself with someone who was usually more devoted to himself and to sports than others, when this is what caused us to be part-time now?\n I gazed at my friends, who seemed so enamored with their dates. I couldn\u0027t imagine anything breaking their bonds. I envied them.\n \"Wow - that full moon,\" Abby said. \"It\u0027s haunting, isn\u0027t it?\"\n \"Speaking of full moons,\" Nash said, hopping to his feet. \"It\u0027s my turn to tell a scary story, and this one is real.\"\n Nash, handsome with his boyishly beautiful features and muscular build, took center stage behind the fire as if the small flames were footlights. He began telling a story of a werewolf in Legend\u0027s Run in the early 1900s.\n I scooted next to Ivy, who linked her bony arm with mine as if it were a designer purse.\n \"Many years ago, as the full moon shown bright,\" Nash said with an eerie tone, \"the inhabitants of Legend\u0027s Run heard a horrible howling. The cry of the beast wailed throughout the town. As the howling grew closer, children woke up from their sleep, travelers had to control their horses, and homeowners locked their doors. The few brave souls who did venture out to investigate say they witnessed a creature never seen before - a monster standing on two legs, thin as a man, hairy as a dog, with the fangs of a wolf and the eyes of a beast.\"\n \"Ooh!\" Ivy whimpered, hugging my arm.\n Tall tales of werewolves ran rampant for generations in Legend\u0027s Run. It might have been because occasionally a wolf was spotted in the outlying wooded areas and in the early days there wasn\u0027t much else to do but create outlandish stories of their origin. I was a skeptic on rumors; I had the mind-set that I\u0027d have to see it to believe it. To me, there was a big line between fact and fantasy. However, hanging out here in the darkness, anything seemed possible.\n \"The creature appeared tormented,\" he continued. \"It was ready to attack at any moment.\" Nash raised his hands as if he were the monster.\n Now I clutched Ivy.\n \"This monstrous creature could rip a giant into tiny pieces. His bite was deadly and he could kill without warning. The townspeople tried in vain to capture and kill the monster, but he returned, full moon after full moon. The creature couldn\u0027t be taken down with a gunshot or the threat of fire but instead vanished into the woods.\"\n Nash paused. \"The townspeople often awoke to find their cattle missing, or in some cases dismembered.\"\n \"Gross!\" Ivy exclaimed.\n Abby let out an audible gasp. \"Tell us more!\"\n \"It was only a matter of time, they feared, before the monster would be coming for them.\n \"The residents spent the nights of the full moon living in terror,\" he continued, \"wondering what - or who - would be the beast\u0027s next victim.\"\n \"I can\u0027t take any more,\" Ivy said, covering her ears.\n The darkness played with our imaginations. I spotted Dylan and Jake eyeing the woods as if every tree hid a stalking werewolf.\n \"Some dismissed the witnesses\u0027 accounts as drunken tall tales,\" Nash said. \"Still others swore there was only one explanation...\"\n We waited in trembling awe.\n \"A citizen of Legend\u0027s Run had become a werewolf,\" he concluded in a serious tone.\n His words left us silent.\n Then he said with a deliberate voice, \"But which of their neighbors had been overtaken by the glow of the full moon was never discovered.\"\n \"No - \" Abby said.\n \"Still, generations later, underneath a full moon, the werewolf can be seen but has never been captured,\" Nash instructed. \"By day he is an ordinary man, descended from that unlucky citizen of Legend\u0027s Run. But by night and under the curse of the moon, his eyes turn red, his muscles bulge, his teeth grow sharp, and he is covered with fur. A half man, half wolf who is tortured by his condition and threatening to anyone in his path.\"\n Then he looked at each one of us. \"Could the werewolf of Legend\u0027s Run have been one of your ancestors?\" he wondered out loud.\n The firelight cast ominous shadows against Nash\u0027s face, distorting his normally perfect features. His nose seemed as long as a warlock\u0027s, his ears pointy, his hair savagely spiky. His hazel eyes appeared fiery red.\n He glared at us again. \"Which one of us could be the Legend\u0027s Run werewolf\u0027s descendant?\"\n \"Not me!\" Abby blurted out.\n Just then a gruesome howl was heard off in the distance.\n Startled, I squeezed Ivy\u0027s hand. She let out a scream.\n \"Nash! You\u0027re scaring us!\" Ivy charged.\n \"He\u0027s just fooling around,\" Jake assured.\n Even Nash appeared startled. His eyes darted away from us. We heard the wailing again.\n \"I guess that could be your mom?\" Dylan joked.\n But Nash wasn\u0027t laughing.\n Wolves weren\u0027t prone to approaching people or populated campsites, but it was dark, we had food, and we were closer to their homes than ours. I didn\u0027t want us to be the ones who proved the naturalists wrong.\n \"Don\u0027t worry, the fire will keep them away,\" Jake said.\n \"But our food won\u0027t,\" Abby said.\n She was right. We had half-eaten s\u0027mores, potato chips, and popcorn. It wasn\u0027t a good idea to possess food when hungry animals were in the vicinity.\n \"Toss everything into the fire,\" Jake commanded.\n We quickly threw our remaining snacks into the flames, hoping to throw off the scent.\n Ivy, Abby, and I glanced around us. All we could see was darkness and the formidable, looming trees.\n When we turned back, Nash was gone.\n \"Nash?\" I called.\n There was no answer.\n \"Quit kidding!\" Abby said.\n \"He\u0027s trying to prank us,\" Jake said. \"I told you.\"\n \"Nash?\" Ivy called.\n The howling grew louder.\n \"This isn\u0027t funny, Nash!\" Ivy said, her voice quivering.\n \"We\u0027d better get to the cars,\" Abby said.\n \"And leave him here?\" I asked.\n \"We don\u0027t even know where he is,\" Ivy said.\n \"What if something happened to him?\" I wondered. \"We can\u0027t leave.\"\n \"We are better off getting our cars and going for help,\" Dylan said.\n How could we abandon Nash? What if he was hurt? What if he was lost?\n Dylan and Jake extinguished the fire with the surrounding dirt. We stood in total darkness. Just then we heard a howl again.\n \"Celeste, we have to go,\" Jake said.\n \"You said it yourself,\" I began. \"It could be a prank.\"\n \"Then where is his video camera?\" Abby said.\n Dylan turned his flashlight on and pointed the beam around the area. We couldn\u0027t see anything but trees.\n Jake pulled out his cell phone and called Nash. We waited for the sound of ringing, but all we heard was another howl.\n \"It went to voice mail,\" Jake finally said.\n We hurried through the forest path, our flashlights illuminating the way.\n The farther away from our campfire we were, the more nervous I became. I was upset to leave Nash behind.\n \"What if it\u0027s true?\" Abby said. \"What if a werewolf got him and now he\u0027s coming for us?\"\n We ran as fast as we could over dirt, roots, and fallen leaves. We finally reached the entrance to the woods where our cars were parked.\n A figure was sitting inside Nash\u0027s car. We paused. We crept toward the car, Dylan and Jake leading the way.\n The door opened and out popped Nash. I had to admit I was relieved, until he displayed a cheesy smirk.\n The group laughed at his joke, now comforted that we\u0027d found our friend. Jake high-fived him. But I wasn\u0027t so proud. I noticed beads of sweat dotting his brow. He appeared shaky.\n Dylan wasn\u0027t as quick to give Nash props, either. \"Hey, you left two guys alone in the woods with three girls. I think the joke\u0027s on you.\"\n \"Not so fast...\" Nash took my hand, protecting his turf. \"It was just a prank.\"\n But I knew better.\n We all hugged good-bye, and each couple got into their separate vehicles.\n As Nash turned on the ignition of his car, his hands were still shaking. Nash had frightened himself - by his own story and by the timely howling animal. I slunk into the passenger seat and put on a brave face to mask my disappointment in my boyfriend\u0027s cowardice. \n","sourceLink":"https://allnovel.net/once-in-a-full-moon-full-moon-1/page-1.html","bookId":2148,"book":{"id":2148,"title":"Once in a Full Moon (Full Moon #1)","description":"Storyline: \n Once in a Full Moon \n (Full Moon #1) \n Celeste Parker is used to hearing scary stories about werewolves—Legend\u0027s Run is famous for them. She\u0027s used to everything in the small town until Brandon Maddox moves to Legend\u0027s Run and Celeste finds herself immediately drawn to the handsome new student. But when, after an unnerving visit with a psychic, she encounters a pack of wolves and gorgeous, enigmatic Brandon, she must discover whether his transformation is more than legend or just a trick of the shadows in the moonlight. \n Her best friends may never forgive her if she gives up her perfect boyfriend, Nash, for Brandon, who\u0027s from the wrong side of town. But she can\u0027t deny her attraction or the strong pull he has on her. Brandon may be Celeste\u0027s hero, or he may be the most dangerous creature she could encounter in the woods of Legend\u0027s Run. \n Psychic predictions, generations-old secrets, a town divided, and the possibility of falling in love with a hot and heroic werewolf are the perfect formula for what happens . . . once in a full moon\n \n","cover":"https://allnovel.net/images/once-in-a-full-moon-full-moon-1.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/once-in-a-full-moon-full-moon-1.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:20:24 PM"}}
