{"id":82733,"no":2,"title":"Page 2","content":"Part ONE\n \"Who is like unto the beast?\"\n - Revelation 13:4\n Chapter 1\n ON THE TELEVISION SCREEN the newscaster was speaking of falling economies and the latest South American earthquakes.\n Mary Kate slid a cup of coffee across the cigarette-burned countertop to the night\u0027s last customer. He looked at her through bleary eyes and mumbled a thank-you.\n Ernest was leaning against the counter watching the late-night news program; he always did. She knew the routine. \"Holy Jesus Christ!\" he said. \"They\u0027re killin\u0027 the city with all this tax shit! You can\u0027t make a decent livin\u0027 no more!\"\n \"Man shouldn\u0027t even try,\" said the customer. \"Should just be a bum and lay around in the park like all those kids do. The world has gone to hell.\"\n There was a clatter of plates as Mary Kate gathered them up. \"Watch that!\" Ernest said. On the fly-blown black-and-white screen the solemn face said, \"...fear another assassination attempt...\"\n She glanced at her wristwatch. Late! she thought. I\u0027m running late! Joe\u0027s home by now and he\u0027d be tired as hell. He\u0027ll want something to eat and I know how it is when he doesn\u0027t get his dinner on time. Damn it!\n \"You know what it is?\" the customer was asking Ernest. \"It\u0027s time, that\u0027s what it is. The world has run the circle. You know what I\u0027m talking about? The circle\u0027s been run and now, by God, it\u0027s time to pay up.\"\n \"... kidnapped yesterday by members of Japan\u0027s Black Mask terrorist organization. Ransom demands have not yet...\" said the newscaster.\n \"The circle\u0027s been run?\" Ernest asked. He had turned his head to look at the other man and one side of his heavy-jowled face reflected the television\u0027s blue glow. \"What\u0027d you mean by that?\"\n \"You\u0027re only given so much time, y\u0027know,\" said the customer, his gaze flickering from Ernest to the newscaster and back again. \"When your time is up, you go. Same\u0027s true of cities, of countries even. You know what happened to Rome, right? It reached its peak and then fell right over the edge.\"\n \"So New York and Rome both got somethin\u0027 in common, huh?\"\n \"Sure. I read about all this somewhere. Or maybe I saw it on the tube.\"\n Mary Kate had cradled greasy, cigarette-butt-littered plates in her arms. The odors repelled her. People are just like pigs, she mused. Oink oink oink just like pigs. She went through a pair of swinging doors into the kitchen and set the dirty dishes in a rack near the sink. The combination cook and dishwasher, a young black named Woodrow, lifted his chin and watched her intently, a cigarette dangling from a corner of his mouth.\n \"Do Baby Mary need a ride home tonight?\" he asked her; he always did.\n \"I\u0027ve asked you to stop calling me that.\"\n \"It\u0027s right on my way. And I got me some good-lookin\u0027 rims last week.\"\n \"I\u0027ll take the bus.\"\n \"I can save you some money.\"\n She turned toward him and saw the heat simmering behind his eyes; that look of his always frightened her. \"I can save you some time. I don\u0027t need a ride. I\u0027ll take the bus like I always take the bus. You understand that now?\"\n Woodrow grinned around the cigarette. An ash fell like a block of marble from the Tower of Babel. \"I dig, sister. You don\u0027t go for the black meat is all.\"\n She swung the kitchen doors shut behind her and the sound made Ernest look up sharply. His gaze fixed on her for a few seconds and then turned again to the television, where a long-legged weathergirl was explaining that the heat wave would continue at least through Thursday.\n That bastard! Mary Kate began methodically wiping the grime from ashtrays scattered along the counter. I\u0027ve got to get a new job, she told herself; she always did. I\u0027ve got to get a new job and get my ass out of here. I don\u0027t care what it is as long as I\u0027m away from here!\n Here I am, she said. Twenty years old and a waitress in a slop shop, married to an English-major dropout who drives a cab. Christ! I\u0027ve got to get out of here even if it means... doing something I don\u0027t want to do. She wondered what Joe\u0027s reaction would be if one night in their cramped steaming apartment she touched him gently and whispered, \"Joe my darling dearest one on earth, I think I\u0027d be happier as a whore.\"\n There was a click! as Ernest switched off the television set. The customer had gone. A dime lay beside the coffee cup.\n \"Time to go home,\" Ernest said. \"Another day, another dollar. Another lousy dollar. Hey! Woodrow! Hey! You locking up back there?\"\n Woodrow called back in his best slave imitation, \"I\u0027se lockin\u0027 up, boss!\"\n Mary Kate folded her apron neatly and laid it beneath the counter. She said, \"I\u0027m leaving now, okay? I\u0027ve got to get home and cook something for Joe.\"\n Ernest was still propped against the counter, staring at the empty eye of the television. Without looking around, he said, \"So? Leave.\"\n She pushed through the frosted-glass door out into the street where a red neon sign flashed Ernie\u0027s Grill off and on, off and on a thousand times a day; once she\u0027d actually counted.\n The air was as thick and heavy as if she were standing in the center of a steambath. She walked away from the grill toward her bus stop three blocks away, keeping her purse high on her shoulder to guard against hit-and-run thieves.\n At one time she had wanted to go to secretarial school; she and Joe would be able to support each other and maybe save a little on the side. But then he had dropped out of school and his subsequent depression infected her as well. They were now like two survivors of a shipwreck in a leaking life raft. Too weak to live, too scared to die, just drifting, drifting. Things had to change.\n And now she found herself doubting that she still loved him. She didn\u0027t know. No one had ever explained to her how she should feel; her father was the strict conservative type, a grease-handed mechanic in a New Jersey garage, and her mother was a chattering bingo addict who wore sunglasses after dark, as if she hoped to be discovered for the movies by talent scouts scrounging amid damaged canned goods in second-rate supermarkets.\n She still felt attracted to Joe, yes. Of course she did. But love? Love? That thrilling passionate dip into the soul of someone else? She really couldn\u0027t put it into words, and if she asked Joe to help her articulate it she was certain he\u0027d laugh. It wasn\u0027t that she was no longer healthy or pretty or anything like that, though when she stood before a mirror she had to admit she was far too thin and her face had taken on the blank stare of a well-worn woman. No, something was needed; something drastic.\n The grill was far from her thoughts now. Ahead the streetlights glowed yellow all along the curb. The empty scarred stone faces of apartment buildings watched her pass as solemnly as priests with bowed heads. Garbage cans overflowed into the gutter and newspaper headlines shrieked of murder and arson and the threat of war.\n This heat, she said. This heat. The sweat had burst out across the bridge of her nose. It had collected under her arms and now trickled down her sides. How many more days of this? Already two weeks. How much longer? And only the beginning of summer, with the hottest months yet to come.\n The bus stop. No, no, a block further. Her footsteps on the empty street echoed back and forth, back and forth between the stone walls. How much longer, she asked herself, can I take this?\n Ahead she saw that the globe of one of the streetlights had been broken. Someone had thrown a stone or bottle and broken the glass, but not hard enough to completely shatter the bulb. It flickered wildly, buzzing like a great lost insect, yellow to black, yellow to black, yellow to black. It threw black shadows across the faces of the fearful watching priests.\n \"Come here,\" someone said. It was a gentle, distant voice like that of a little child.\n She turned and wiped her forearm across her face. It came away wet.\n There was no one. The street was empty and quiet but for the noise of the bulb above her head. She pulled her purse higher on her arm, clamped it in her armpit. Hunching her head down, she walked on toward the bus stop. Her bus would be there soon.\n \"Come here,\" said the voice, cool and startling as if a cube of ice had been pressed suddenly against her forehead. She stopped abruptly and stood motionless.\n Mary Kate glanced over her shoulder. Someone\u0027s playing a joke, she thought. Some little kid is playing a joke. \"That is not funny,\" she said to no one. \"Go on home.\"\n But before she could move away the voice said softly, \"Here. I\u0027m here.\"\n Something touched her; it was like smoke, grasping with whirling changing fingers. She felt it moving beneath her wet garments; her flesh crawled. The voice had walked up the skeletal staircase of her spine. And now it descended with measured steps.\n \"I\u0027m here,\" someone said, and she turned to peer into a black garbage-strewn alley that smelled of urine and sweat.\n Someone was standing there, someone tall. Not a child. A man? Wearing a man\u0027s clothes, yes. A man. Who? A mugger? She felt an electric impulse to run. Above her head the broken bulb screamed in shades of yellow and black.\n \"Do I know you? Do I know you?\" she found herself asking; a damned stupid question to ask a mugger, she angrily told herself. Her grip tightened around her purse. She was going to run and keep running until she\u0027d lost him.\n \"No,\" he said quietly. \"Don\u0027t run.\"\n He remained in shadow. She could see his shoes, a pair of battered black wingtips below dark trousers. He made no attempt to come closer to her. He simply stood framed in the alley entrance, with his arms at his sides, and she felt the urge to escape drained from her. No need to run, she told herself. This is someone I know.\n \"I\u0027m someone you know,\" he said in his childlike whisper. \"I\u0027m someone you haven\u0027t seen for a long while. There is no need for fear.\"\n \"What do you want with me?\"\n \"Time. Just a moment out of all moments you will ever live. Is that too much to ask of a friend?\"\n \"No. Not too much to ask.\" She felt strange and heavy. Her head swam in a pool of yellow and black; her tongue was a plate of concrete jammed back into her mouth.\n \"If I reach out my hand for you,\" he asked, \"will you take it?\"\n She shuddered. No. Yes. Yes. \"My bus,\" she said in a helpless, unfamiliar voice.\n His arm pierced the shadows. The fingers were long and thin; filth caked the nails.\n The heat lay heavy about her shoulders and her hair, wet and stringy, clung to her neck. I can\u0027t breathe! she screamed inwardly. I\u0027m drowning! I\u0027m drowning. The mad buzzing streetlight drilled into her brain and lit it in glaring yellow neon. I don\u0027t want to, she said to herself.\n And he answered, \"You will.\"\n His hand touched hers. The fingers locked around her knuckles, moved over her palm, clenched her wrist with a steadily rising force.\n And then from the alley shadows a face yellow-illuminated burst its soundlessly screaming mouth open to devour her. She had no time to see him; she was overcome by a powerful high odor of something burning. His flesh was wet and soft - spongy - and hot. He bore down on her as she fell screaming and clawing to the concrete.\n He smashed her head into the sidewalk. Again. Again. Something was bleeding; her ear was bleeding. The hot blood was streaming down her neck. \"YOU BITCH!\" he shrieked in a voice that flailed her like a burning whip. \"YOU DAMNED COCKSUCKING BITCH AND ALL YOUR LOVERS DOGS!\" The man\u0027s breath smelled foul and hot. She cringed as he beat at her breasts; he ripped her blouse and raked the smooth skin of her abdomen with his nails.\n She screamed in agony and sang harmony with the streetlight. A window across the street slammed shut. Then another.\n With both hands he tore away her skirt. Then he spread wide her thighs and drove in with a mad inhuman strength that ground her buttocks against the concrete. He pressed his fingers against her eyes and for an instant she thought, I\u0027m dead oh God I\u0027m dead.\n \"OOOOHHHH GODDDD!\" she screamed aloud. Her mouth was filled suddenly by a greedy eager tongue.\n \"DIE YOU BITCH DIE YOU BITCH YOU CUNT DIE!\" he screamed pounding and grinding and pounding and pounding until he climaxed with a fierce shudder that drew the breath from him and made her whine with pain.\n \"Hey! Hey! You! Get away from there!\" Brakes squealed and rubber burned. She felt his weight rise from her and smelled him again; the odor made her vomit on the concrete. She heard someone running; no, two people running. Someone running away and someone running toward her. Oh God oh God oh God help me.\n Mary Kate opened her eyes and saw a young man. Woodrow. Woodrow running toward her and behind him a fire-engine-red Buick with shining chrome wheel rims that caught the distorted reflections of streetlights. Woodrow reaching her and bending down and the cigarette dropping from his lips and... \n","sourceLink":"https://allnovel.net/baal/page-2.html","bookId":2473,"book":{"id":2473,"title":"Baal","description":"Storyline: \n He is the foul seed of evil the dark prophet who sees what is - and creates what will always be. Across the earth, he spreads his fiendish blasphemy, unleashes his holocaust, proclaims himself messiah. But he is Baal, the prince of demons. Fear him. He will never be destroyed.\n \n","cover":"https://allnovel.net/images/baal.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/baal.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:46:00 PM"}}
