{"id":107941,"no":18,"title":"Page 18","content":"\\n\\n \"You are very generous,\" said Rainaut, puzzled.\\n\\n \"I am very Roman,\" she corrected as she entered the slaves\u0027 quarters. \"There was a time when not making such provision would have been considered quite odd—as doing it is considered to be now.\"\\n\\n The room she had set aside for Fraire Herchambaut was at the end of the corridor, with two high windows to give it light and ventilation. A basin was built into the wall and a plugged iron pipe dripped water from above it.\\n\\n \"It is the coolest of the rooms, and the most remote,\" Olivia said. \"The bed-frame is Supported with hemp lines, so Fraire Herchambaut will not have to lie on straw. I have a brazier and two oil lamps to keep the room lit in the night.\" She touched the cotton blankets set out on the bed. \"He will be warm enough to keep from chills, but not so warm that his fever must increase.\"\\n\\n \"Yes,\" said Rainaut. \"To a Cistercian, you offer luxury.\" He turned away. \"It is wonderful care you offer, Bondama.\"\\n\\n She looked at him. \"Will you suggest which room would be best for the penitent?\"\\n\\n \"Any that is close. But don\u0027t trouble yourself with beds and similar excesses; a straw pallet is all that a penitent is entitled to have. If you provide more, the penance will be lessened and salvation will remain far-off.\" He started to leave the room, then stopped, hardly more than two steps from her. \"I wish you would reconsider.\"\\n\\n \"I know. But think of poor Fraire Herchambaut. If you were afflicted as he is, I would hope that there would be someone willing to care for you as I will care for him.\" Again she met his eyes without apology.\\n\\n \"For charity?\" he asked harshly.\\n\\n \"At the least,\" was her level answer.\\n\\n \"What greater reason?\" he countered, his sarcasm colored by something he did not realize was jealousy. He regarded her, his emotions so confusing that he did not know what to say.\\n\\n A commotion at the head of the hallway startled them both. Olivia glanced around the room. \"Is that—?\"\\n\\n \"Your slaves with Fraire Herchambaut,\" said Rainaut heavily. \"They\u0027re bringing him in.\" He took a single, hasty step toward her. \"You won\u0027t change your mind?\"\\n\\n \"No,\" she said softly. \"But thank you.\"\\n\\n \"Don\u0027t thank me, not for letting you throw your life away for this Cistercian who is beyond all remedy but God\u0027s.\" He raised his hand abruptly, as if he might strike her, but instead the caress he gave her face was so light and tender that both sensed more than felt his touch.\\n\\n \"Mistress!\" Alfaze called out, his voice echoing in the narrow confines of the hallway.\\n\\n \"Here,\" Olivia replied. \"I must tend to my patient now, Sier Valence,\" she said, breaking the tension between them. \"If you will find me that penitent to aid me?\"\\n\\n He bowed to her. \"As you wish, Bondama,\" he said as he left the room, taking care not to get too near Alfaze, the two Egyptian slaves, and the muttering bundle they carried.\\n\\n Text of an unofficial letter from the secretary of the Metropolitan of Hagia Sophia to the Abbot of the Benedictine monastery on Rhodes.\\n\\n To my devout fellow-Christian and defender of Rodhos from the devilish forces of Islam which everywhere seek to bring down the Cross of Our Lord and raise the Crescent in its place, I write to you once more on the instruction of my most pious and saintly master to seek your continued aid in this time of great travail.\\n\\n It is with joy that we have seen the forces of the Emperor Barbarossa enter the boundaries of the ancient Attic lands, known of old for its hews, and advance with his army toward the strongholds of the foe. We offer prayers for him and for the men that follow him, and for those mighty Kings who are gathering their men-at-arms about them to join in the battle. We are uplifted in our hearts and our souls to know that in spite of the differences which have caused so much sorrow to our Church and your Church, the bonds of Christian to Christian are sustained unbroken. It is as if once again Agamemnon has come to claim his bride—but how much more worthy and chaste a prize is Jerusalem than the woman Helen!\\n\\n My master has told me often of his hopes for the successes of your great warriors, for well we know that without your succor and strength, we would be defenseless against this ruthless and implacable enemy. We know Islam well, my Christian brother, for we are much nearer to its terrors than you are. Indeed, perhaps only the Christians of Spain can share the feelings that haunt us through day and night that Islam will triumph over our Church and we will all suffer the pains of Hell for it.\\n\\n How great a loss we would all sustain should such be the fate we endure! Not only would we all lose our souls to Satan and the pains of Hell, all those souls that we would have brought to God would also be lost because of our failure in this test of our conviction and devotion. If we fall, all of Christianity falls with us, and for all ages to come, we will bear that shame in Hell. The treason of Judas we would have to share for our desertion of the Lord in this time of greatest need. I have heard my master speak eloquently, empowered by Angels, on the glory of sacrifice in the name of God and His Son, and the joy of martyrs before the Throne of God; I have known as I listened that it was the joy of the men of this great Crusade that he expressed. I cannot say how I wept then, for there are no words that could convey the depth of my vision of this gift of Grace that is descending on the Crusaders for the nobility of their fight. Those who battle in His great cause will have reason to lift up their hearts all their lives long, knowing that they are thrice welcome in Heaven, as they will be honored by those of us who worship beside them on earth.\\n\\n There have been those who have suggested that we of the Eastern Church do not share the devotion of the Western Church and that we are lax in our faith and cynical in our ambitions. Some have gone so far as to suggest that we of the Eastern Church have actively sought these Crusades for our own purposes in order to strengthen our position against Islam without having to fight so that we would not have to give up our profitable trade with either the countries of the Western Church or with the various leaders of Islam. This is patently ridiculous and were it not that a few credulous souls repeat these vilifications, I would not sully this letter with mention of such insinuations. Most certainly we of the Eastern Church are keenly aware of the danger of Islam—it is before us every day of our lives. We are filled with gratitude and thanksgiving for the courage and purpose of your Kings and their armies that are willing to take up this battle.\\n\\n Just as there are lies spoken about us, so we hear from time to time that in the Western Church the Crusades are approved in order to keep the Kings from fighting one another, and the peoples in the clutches of the Church because of fear of the men of Islam. It is said also that so long as the Western Church can show to its peoples the encroaching danger of Islam, they can also enforce their hold over the people, for now heresy is seen as the equal of Islam in danger to the Church. No true cleric can believe such lies; by the same token, I pray that what you may have heard of the Eastern Church has not been tainted with doubt as to our motives.\\n\\n Were our Emperor more secure upon his throne, he would most certainly join with the great Barbarossa even now, and together they would advance to victory at Jerusalem. That such is not possible fills me with suffering, for there is no greater joy for a true Christian than dying as a martyr in the cause of Our Lord. Given the opportunity, I would trade with the most humble man-at-arms for the privilege of fighting with your gallant men against the might of Islam. My master has forbidden me to do this, and so I can only give you my prayers day and night for your success and for the success of your splendid Kings who have come to defend the heart of our faith in its time of direst need.\\n\\n For the soldier and knights, for the Brothers and Fathers who accompany them, for the greatest to the humblest of men under the Cross, I give thanks with every breath, and I beseech God to give His protection to all who fight beneath His Son\u0027s banner, for the glory of all Christians everywhere, from this time until we stand together at the Judgment Day.\\n\\n In the Name of the Christ we all adore, I am your servant\\n\\n Alexios from Salinika\\n\\n At the behest of my master, by my own hand and under seal, on the 2nd day of May, the Feast of Saint Athanasius of Alexandria, in the Lord\u0027s Year 1190.\\n\\n - 10 -\\n\\n Joivita was nervous, though she denied it when Rainaut asked what was bothering her. \"You\u0027re always thinking that I am upset when I am teasing you,\" she chided him unconvincingly.\\n\\n \"I will beg your pardon,\" Rainaut said, with enough of a bow to satisfy her without disturbing the remnants of their evening meal. \"It was not my intention to offend you.\" He had been with her for some time, but she had not shown him the encouragements that she usually offered as soon as he stepped through the door. He supposed she wanted to punish him for the days he had not come to see her, days when Olivia had filled his thoughts so that he dared not approach another woman.\\n\\n \"Oh, I am not offended,\" she said quickly. \"I am… well, perhaps I am a little nervous. Now that the Emperor has landed and his army is on the march, I suppose it\u0027s not odd that I could be… nervous.\" She gave a quick, covert glance toward the shuttered windows as if she suspected all of Barbarossa\u0027s army to be camped outside her house.\\n\\n \"He will not be here for a while yet,\" Rainaut said, faintly amused. He was aware of how slowly vast armies moved and knew that Barbarossa\u0027s men were no exception: five to eight miles a day would be the best they could achieve.\\n\\n \"But all the Islamites have left the city, haven\u0027t they? The Bourgesses gave them permission to leave, no questions, no delays,\" she demanded. \"They are not so sanguine as you, Sier Valence.\"\\n\\n \"The Islamites were not ordered to depart,\" Rainaut pointed out, frowning as he thought of it. While it was true that there had been no official expulsion, there had been no attempt whatever to stop the departures, nor had there been any statements issued to calm the general public. In some instances, the necessary statements for customs had not been required, and from his experiences on Olivia\u0027s behalf he knew how remarkable that was; it bothered him that so many people were leaving Tyre.\\n\\n \"But they left,\" Joivita insisted, hesitating before she spoke. \"They know that the Emperor is coming, and they fear for what he and his men will do. We all fear that, even those of us who are good Christians and pray for his soldiers each day.\" Her voice had grown shrill; she tried to laugh without success.\\n\\n Rainaut moved two of the brass platters aside, so that there was only a tray of fruit and bowl of saffron rice with nuts, pepper, and ginger between them. \"Is there a second jug of wine?\"\\n\\n \"Of course,\" she snapped. \"If you are not afraid of drinking too much. A man filled with wine is not always a good lover.\"\\n\\n \"Spiteful little shrew,\" Rainaut said mildly, uncertain how much of Joivita\u0027s temperament was show and how much was genuine.\\n\\n \"Is that what you think me? That I am spiteful and foolish? That I am a loose woman who has nothing to do but indulge myself with pleasures and have no thought in my head but how to satisfy my whims? Is that how I seem to you?\"—she gave him no chance to answer any of the accusations flung at him—\"Then why do you stay here?\" She started to get up, then sat down. \"I\u0027m sorry,\" she said after a moment. \"You know what capricious creatures women are.\"\\n\\n Rainaut nodded. \"It is one of the many things that men love most about you—how mysterious you can be.\" He found the second jar of wine and busied himself prying the seal off with his dagger. The evening was not going as he had thought it would, and he could not decide what was best to do now.\\n\\n This time her laughter was more convincing. \"Such gentle answers, Sier Valence. Reis Richard would be proud of you for his mother\u0027s sake.\"\\n\\n \"Why is that?\" Rainaut asked, not paying much attention. He almost had the seal now, and he concentrated on it.\\n\\n \"Why, for not disputing with me, for permitting me to say whatever thing is in my thoughts, and for—oh, for keeping silent when you want to rage at me.\" She leaned back, a little of her usual coquettishness returning. \"Am I being cruel to you, Sier Valence?\"\\n\\n \"If you ask to cause me pain, then yes.\" He looked up as he tossed the seal aside. \"If you are doing this to repay a pain I have given you without knowledge, then no.\" Another troubador\u0027s answer, he thought as he said it, but allowed that it had some justice to it.\\n\\n \"Very good,\" she approved. \"How well you have learned that.\"\\n\\n \"Yes,\" he agreed with a faint smile. \"Those lessons that are of merit are the ones we learn most completely.\" This time it was a priest\u0027s answer, but again Joivita did not seem to notice.\\n\\n \"How is it that you had so little time to see me? Or do you know when my blossoms come?\" This last was intended to upset him, and succeeded. \\n\\n","sourceLink":"https://allnovel.net/crusader-s-torch-atta-olivia-clemens-2/page-18.html","bookId":2510,"book":{"id":2510,"title":"Crusader\u0027s Torch (Atta Olivia Clemens #2)","description":"Storyline: Crusader\u0027s Torch (Atta Olivia Clemens #2) \\n The time is 1189 A.D. and war rages all around the Mediterranean. Any woman would fear travelling among the pirates, bandits, and renegade Christian Knights, but Atta Olivia Clemens is no ordinary woman--rather, she is a vampire and the perils she faces are even more deadly.\\n","cover":"https://allnovel.net/images/crusader-s-torch-atta-olivia-clemens-2.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/crusader-s-torch-atta-olivia-clemens-2.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:12:27 PM"}}
