{"id":107967,"no":45,"title":"Page 45","content":"\n \"Not a leper; a leper is a dead man,\" Dar said. \"Magister—\"\n \"Stop that,\" Niklos said mildly.\n \"Bonsier, then. Only God remembers the dead,\" Dar reminded him. \"There will be no records.\"\n Lightning; thunder; rain so heavy that Dar thought a wave had washed over the villa.\n \"Someone will know,\" Niklos insisted with quiet intensity. \"Someone will remember, and we\u0027ll find them. Her.\"\n Dar hesitated, then blurted out: \"If she\u0027s a leper, too?\"\n Niklos growled out a laugh. \"Olivia a leper. Never.\"\n \"The Hospitaler is,\" Dar said carefully. \"It is an affliction that—\"\n \"Olivia is not a leper,\" said Niklos.\n \"There are other things, terrible things,\" Dar said, feeling wretched, but convinced that the worst had to be faced.\n \"You mean that she could be dead?\" Niklos asked, and for an instant, in the lightning flash, his handsome features were almost demonic. \"She is not dead. I would know if she were.\"\n \"You… might not hear… there might be… no one would know.\" The eruption of thunder was welcome in the silence.\n \"I tell you,\" Niklos said conversationally, \"I would know if Olivia were truly dead.\"\n Dar swore comprehensively, and when he was through, he said, \"Tarsus first, then west along the coast.\"\n Niklos smiled more with his teeth than his eyes. \"Reports at every stop. I will see that you have a scribe with you. Don\u0027t worry, we\u0027ll find one who isn\u0027t a crabbed weakling. You\u0027ll have gold to pay for the transport of letters.\"\n \"You have paid me a great deal already,\" Dar pointed out.\n \"And I will pay you a great deal more if that\u0027s necessary.\" He tapped the trestle table again. \"You\u0027re worried that if you don\u0027t find her, or find her dead, that I will demand compensation of some kind from you. I won\u0027t. Neither will Olivia.\"\n \"You have spent—\"\n \"A great deal of money?\" Niklos finished for him. \"Yes. I am empowered to do that. She will not blame you for anything I have done.\" He paused to listen. \"It\u0027s starting to slack off. That\u0027s something. All but the old roads are thigh-deep in mud. Tomorrow I\u0027ll see you and your goods get to the Via Flaminia; you should find it less difficult to go from there.\"\n Dar bowed, more confused than ever. \"When I arrived, I feared you would seize my ships and be rid of me.\" It was not an easy admission for him, and his voice caught once as he spoke. He looked at the windows instead of Niklos.\n \"As the kings of old used to kill the bearers of bad news? What I want from you is your honest effort and the truth of who and what you find. I don\u0027t hold you to blame for anything Olivia does.\" He hooked his thumbs in his wide leather girdle. \"Why do I frighten you, Dar?\"\n \"Because,\"—he swallowed hard—\"because you are not as other men and your mistress is not—\"\n \"Olivia\u0027s unique,\" Niklos agreed.\n The lightning was distant, barely a twinge of the eye.\n \"Both of you—\" said Dar. He tried again. \"You are not like anyone else.\"\n Thunder lumbered into the hills.\n Niklos nodded once, nearly imperceptibly, his eyes fixed on a place on the inlaid floor where the stones formed a rosette. \"She has given me… everything I am. Not because we are the same—we\u0027re not—but because… of my bond.\" Now he looked at Ithuriel Dar. \"Find her.\"\n Dar was deeply moved by Niklos\u0027 inadvertent eloquence. \"I will search,\" he promised. \"If she is there, I will find her.\"\n \"I know,\" said Niklos, then his head rolled back and he glared at the ceiling. \"I hate not knowing. I hate waiting. If I could go with you in safety I would. But she insisted I come here, that I prepare her household and remain here, and that is what I must do.\"\n There was nothing Dar could think of to say. He bowed deeply, showing far more respect to Niklos than any bondsman was entitled to have. \"I will be ready to leave in the morning.\"\n \"If there\u0027s no rain. If it\u0027s raining, we\u0027ll prepare everything for your departure, and then you will be free to find what amusement you may here. There\u0027s new wine in the cellarhouse, but they tell me it\u0027s undrinkable.\" He made a sweep of his arm to indicate the whole villa. \"We\u0027re poor on entertainment, but perhaps something can be arranged.\"\n Dar had backed most of the way to the door. \"It hardly matters,\" he said. \"For a man like me, a day spent lying about is treat enough.\"\n \"As you wish,\" said Niklos, and addressed the last to a closing door: \"The servants will carry out your instructions.\" He stood by himself in the center of the study for some little while, doing his best to quiet the anxiety that possessed him. Olivia was lost. The acceptance of that was the greatest self-condemnation he had ever known. She was without resources, without friends, without her native earth. Only the night was her friend now, and there was little blood to sustain her. He knew Olivia, her courage and her loyalty; she would never desert her Sier Valence, no matter what became of him. More than anything in his life Niklos longed to aid her, and felt helpless as he listened to the last stutters of thunder.\n Text of a note front Valence Rainaut to Orval, Sier de Monfroy, Deputy Master of the Knights Hospitaler of Saint John, Jerusalem, at Tarsus.\n To the most respected Master of the Knights Hospitaler of Saint John in the hospice at Tarsus, I, who was a Hospitaler, send urgent warning. If the danger were not so great, I would not commit the sin of addressing you now that I am a leper.\n I know of a man who claims to be a monk and is thought to be pious. He is giving documents to the Islamites, and through his perfidy, we are deprived of our goal. I beg you to meet with me and listen to what I have to say. I will not touch you, or come nearer to you than five paces. I will wear my cowl and not face you, if that is your preference, but I must tell you what I have learned so that others will not be lost for my laxness.\n I am in the company of she who was my leman and is now my agapeta. She will be with me, and if you find you cannot address me, you may speak with her, and she will speak with me.\n Once you learn of what transpired, I am certain you will act in order to contain the damage done by this false monk. I pray that God will show me Grace and let me see the day that Jerusalem is once again in Christian hands. While I was still in the company of men, I swore to give my life for that day, and if we achieve our victory, then I will have fulfilled my duty.\n a leper\n who was Sier Valence Rainaut\n By the hand of my agapeta, under seal, on the Feast of Saint Anastasius the Persian, in the Lord\u0027s Year 1192.\n - 7 -\n On the north side the chapel wall had nearly crumbled, but the rest of the small, domed box was reasonably intact, though the doors had long since been hacked up for firewood. An incised stone at the back of the altar indicated that the chapel had been dedicated to Hagia Irene three hundred years before.\n \"It\u0027s Greek,\" said Orval de Monfroy as he stepped over the threshold, kicking the worst of the rubble out of his way.\n From the shadows, Rainaut said, \"Yes. No one comes here now but beggars.\"\n \"Well, they\u0027re—the monks—are supposed to offer charity, aren\u0027t they?\" de Monfroy asked casually as he looked around, hardly moving, while his eyes darted and probed.\n \"You\u0027re here because of my note,\" said Rainaut, and it was almost a question.\n \"I am here because I received a note; I don\u0027t know that it was from you. Since you are here, I suppose it was yours.\" He had a jeering way about him that grated on Rainaut. If it was possible to saunter in chain mail, he did. \"I admit I am curious. That\u0027s often the best course. I\u0027m not prepared to take needless risks, and so, if there is an apostate monk giving our secrets to the forces of Islam, then it must be stopped, the monk must be apprehended and punished.\" He came one step nearer the altar. \"I am here as I said I would be. I am here on your terms. It is sundown. I have only two short swords, and the quillons, are bound.\" He held out his empty hands, his harness creaking and ringing softly. \"I am here in good faith, leper. Alone.\"\n Rainaut came carefully out of the shadows to the right of the altar, his cowl drawn down over his face so that his features could not be seen. \"My agapeta is with me. Only she. No one else.\" He did not look directly at de Monfroy, but noticed that the man was lean, and even in armor, he moved gracefully.\n \"Where is she?\"\n From behind him, Olivia said, \"I am here.\" She had thrown her cowl back, and left her hair unveiled, confined only with a wide ribbon. As she approached de Monfroy, she was relieved that law required the distance of five paces be kept between them, for there was a light in his eyes that was ravenous and possessive. She drew her mantel more closely around herself. She realized de Monfroy could be more dangerous than an entire Order of renegade monks. \"Neither of us is armed.\"\n De Monfroy laughed. \"Oh, surely for a while yet?\" He met her blank stare with a cold smile. \"Armed? Lepers? Fingers and toes fall off.\" He laughed once more, defiantly. \"What are you determined to tell me?\"\n There was no trace of humor in her. \"It is Valence who is determined to speak. He was willing to risk punishment—\"\n \"Death, in fact,\" said de Monfroy.\n \"Yes,\" Olivia said, refusing to be moved from her purpose. \"He is willing to risk death in order to warn you. He believes he is honor-bound to tell you.\" She wished now she had worn her cowl up, but she did not want to hamper her vision.\n \"You\u0027re easily the most interesting herald I\u0027ve encountered in the last year,\" de Monfroy said speculatively. \"And in the company of a leper.\"\n \"He was my leman,\" Olivia said, an edge in her voice.\n \"A pity.\" He looked from Olivia to Rainaut and back again. \"More and more fascinating,\" he went on, just this side of insolent. \"Notes from leprous Hospitalers, meetings in ruined Orthodox chapels! An agapeta who was a leman. I must tell my troubadors about this. And my jesters.\" He found a section of wall that was relatively intact and leaned back against it. \"What do you intend I should know?\"\n Rainaut was shocked at the attitude de Monfroy displayed. \"You wear the Maltese Cross and you talk like a Prince\u0027s crony.\" He pointed to the de Monfroy arms blazoned on his cote: sable, a pale ermine engrailed. \"That… that places you under obligation.\"\n \"Valence—\" Olivia cautioned.\n De Monfroy chuckled. \"For your homily I rode out into this desolation.\"\n \"I have no homily,\" Rainaut all but shouted. \"I have a warning.\" He was snaking visibly and if it were not for his pride, Olivia would have gone to his assistance.\n \"A warning. What soldier in the Holy Land has not had a warning? In fact, you have nothing,\" sneered de Monfroy.\n \"Tell him, Valence,\" Olivia said, hoping to lessen the hurt of de Monfroy\u0027s behavior.\n \"By all means tell me,\" de Monfroy agreed. He made no attempt to conceal a yawn. \"What made you send that note? I could have you stoned for it. Or burned. Both of you.\" The prospect seemed boring, judging from his manner.\n Rainaut steeled himself. \"Coming here, not very long ago, aboard a small ship from Cyprus, I overheard a monk, a Hieronomite named Eleus, tell an Islamite that he had documents for him, indicating troop movements, I think. Our troops. He offered the Islamite maps as well.\"\n \"Very fine reporting, former Hospitaler. You haven\u0027t forgot how to do it.\" He pursed his lips. \"Who was the Islamite?\"\n \"I\u0027m not certain. The light was very poor and the weather was rough. We… we were traveling in the hold.\" Rainaut glanced once at Olivia, then looked out toward the distant, crenelated walls of Tarsus, fading to blend with other twilight shadows.\n \"I should think so,\" de Monfroy said. \"A Hieronomite named Eleus. Not a common name, but not uncommon either. You wouldn\u0027t happen to know what country he\u0027s from? Or how old he is? Or what he looks like?\"\n \"I… no. He spoke Norman French.\" As he listened to himself, Rainaut wondered if Olivia had been right, and he had, after all, nothing of importance to tell the Hospitaler.\n \"So do I, so do you. So does your very beautiful agapeta.\" De Monfroy left his place by the wall and strolled toward Rainaut. \"And half the Islamites in the Holy Land speak it.\"\n \"He is a danger,\" Rainaut insisted. \"For the sake of lives that could be lost, stop Fraire Eleus.\"\n \"If you want to find a way to save lives, then find a way to stop the flux,\" de Monfroy responded. \"That would be of use to us. Reliable guides, wholesome wells, food without vermin, all those would be of more use than stopping a spy. The whole world is alive with spies. Lord God and the Virgin\u0027s Tits! what\u0027s one monk, when our soldiers are too weak from flux to lift a sword, when we have hundreds of men deserting every month?\" He kicked at some of the rubble on the floor, the long rowel of his spur buzzing as he did. \n","sourceLink":"https://allnovel.net/crusader-s-torch-atta-olivia-clemens-2/page-45.html","bookId":2510,"book":{"id":2510,"title":"Crusader\u0027s Torch (Atta Olivia Clemens #2)","description":"Storyline: \n Crusader\u0027s Torch (Atta Olivia Clemens #2) \n The time is 1189 A.D. and war rages all around the Mediterranean. Any woman would fear travelling among the pirates, bandits, and renegade Christian Knights, but Atta Olivia Clemens is no ordinary woman--rather, she is a vampire and the perils she faces are even more deadly.\n \n","cover":"https://allnovel.net/images/crusader-s-torch-atta-olivia-clemens-2.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/crusader-s-torch-atta-olivia-clemens-2.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:12:27 PM"}}
