{"id":81155,"no":16,"title":"Page 16","content":"He laughed it off. “The thing about dead people,” he said, and then stopped himself. “The thing is you sound like a bastard if you don’t romanticize them, but the truth is . . . complicated, I guess. Like, you are familiar with the trope of the stoic and determined cancer victim who heroically fights her cancer with inhuman strength and never complains or stops smiling even at the very end, etcetera?”\\n\\n “Indeed,” I said. “They are kindhearted and generous souls whose every breath is an Inspiration to Us All. They’re so strong! We admire them so!”\\n\\n “Right, but really, I mean aside from us obviously, cancer kids are not statistically more likely to be awesome or compassionate or perseverant or whatever. Caroline was always moody and miserable, but I liked it. I liked feeling as if she had chosen me as the only person in the world not to hate, and so we spent all this time together just ragging on everyone, you know? Ragging on the nurses and the other kids and our families and whatever else. But I don’t know if that was her or the tumor. I mean, one of her nurses told me once that the kind of tumor Caroline had is known among medical types as the Asshole Tumor, because it just turns you into a monster. So here’s this girl missing a fifth of her brain who’s just had a recurrence of the Asshole Tumor, and so she was not, you know, the paragon of stoic cancer-kid heroism. She was . . . I mean, to be honest, she was a bitch. But you can’t say that, because she had this tumor, and also she’s, I mean, she’s dead. And she had plenty of reason to be unpleasant, you know?”\\n\\n I knew.\\n\\n “You know that part in An Imperial Affliction when Anna’s walking across the football field to go to PE or whatever and she falls and goes face-first into the grass and that’s when she knows that the cancer is back and in her nervous system and she can’t get up and her face is like an inch from the football-field grass and she’s just stuck there looking at this grass up close, noticing the way the light hits it and . . . I don’t remember the line but it’s something like Anna having the Whitmanesque revelation that the definition of humanness is the opportunity to marvel at the majesty of creation or whatever. You know that part?”\\n\\n “I know that part,” I said.\\n\\n “So afterward, while I was getting eviscerated by chemo, for some reason I decided to feel really hopeful. Not about survival specifically, but I felt like Anna does in the book, that feeling of excitement and gratitude about just being able to marvel at it all.\\n\\n “But meanwhile Caroline got worse every day. She went home after a while and there were moments where I thought we could have, like, a regular relationship, but we couldn’t, really, because she had no filter between her thoughts and her speech, which was sad and unpleasant and frequently hurtful. But, I mean, you can’t dump a girl with a brain tumor. And her parents liked me, and she has this little brother who is a really cool kid. I mean, how can you dump her? She’s dying.\\n\\n “It took forever. It took almost a year, and it was a year of me hanging out with this girl who would, like, just start laughing out of nowhere and point at my prosthetic and call me Stumpy.”\\n\\n “No,” I said.\\n\\n “Yeah. I mean, it was the tumor. It ate her brain, you know? Or it wasn’t the tumor. I have no way of knowing, because they were inseparable, she and the tumor. But as she got sicker, I mean, she’d just repeat the same stories and laugh at her own comments even if she’d already said the same thing a hundred times that day. Like, she made the same joke over and over again for weeks: ‘Gus has great legs. I mean leg.’ And then she would just laugh like a maniac.”\\n\\n “Oh, Gus,” I said. “That’s . . .” I didn’t know what to say. He wasn’t looking at me, and it felt invasive of me to look at him. I felt him scoot forward. He took the cigarette out of his mouth and stared at it, rolling it between his thumb and forefinger, then put it back.\\n\\n “Well,” he said, “to be fair, I do have great leg.”\\n\\n “I’m sorry,” I said. “I’m really sorry.”\\n\\n “It’s all good, Hazel Grace. But just to be clear, when I thought I saw Caroline Mathers’s ghost in Support Group, I was not entirely happy. I was staring, but I wasn’t yearning, if you know what I mean.” He pulled the pack out of his pocket and placed the cigarette back in it.\\n\\n “I’m sorry,” I said again.\\n\\n “Me too,” he said.\\n\\n “I don’t ever want to do that to you,” I told him.\\n\\n “Oh, I wouldn’t mind, Hazel Grace. It would be a privilege to have my heart broken by you.”\\n\\n CHAPTER TWELVE\\n\\n I woke up at four in the Dutch morning ready for the day. All attempts to go back to sleep failed, so I lay there with the BiPAP pumping the air in and urging it out, enjoying the dragon sounds but wishing I could choose my breaths.\\n\\n I reread An Imperial Affliction until Mom woke up and rolled over toward me around six. She nuzzled her head against my shoulder, which felt uncomfortable and vaguely Augustinian.\\n\\n The hotel brought a breakfast to our room that, much to my delight, featured deli meat among many other denials of American breakfast constructions. The dress I’d planned to wear to meet Peter Van Houten had been moved up in the rotation for the Oranjee dinner, so after I showered and got my hair to lie halfway flat, I spent like thirty minutes debating with Mom the various benefits and drawbacks of the available outfits before deciding to dress as much like Anna in AIA as possible: Chuck Taylors and dark jeans like she always wore, and a light blue T-shirt.\\n\\n The shirt was a screen print of a famous Surrealist artwork by René Magritte in which he drew a pipe and then beneath it wrote in cursive Ceci n’est pas une pipe. (“This is not a pipe.”)\\n\\n “I just don’t get that shirt,” Mom said.\\n\\n “Peter Van Houten will get it, trust me. There are like seven thousand Magritte references in An Imperial Affliction.”\\n\\n “But it is a pipe.”\\n\\n “No, it’s not,” I said. “It’s a drawing of a pipe. Get it? All representations of a thing are inherently abstract. It’s very clever.”\\n\\n “How did you get so grown up that you understand things that confuse your ancient mother?” Mom asked. “It seems like just yesterday that I was telling seven-year-old Hazel why the sky was blue. You thought I was a genius back then.”\\n\\n “Why is the sky blue?” I asked.\\n\\n “Cuz,” she answered. I laughed.\\n\\n As it got closer to ten, I grew more and more nervous: nervous to see Augustus; nervous to meet Peter Van Houten; nervous that my outfit was not a good outfit; nervous that we wouldn’t find the right house since all the houses in Amsterdam looked pretty similar; nervous that we would get lost and never make it back to the Filosoof; nervous nervous nervous. Mom kept trying to talk to me, but I couldn’t really listen. I was about to ask her to go upstairs and make sure Augustus was up when he knocked.\\n\\n I opened the door. He looked down at the shirt and smiled. “Funny,” he said.\\n\\n “Don’t call my boobs funny,” I answered.\\n\\n “Right here,” Mom said behind us. But I’d made Augustus blush and put him enough off his game that I could finally bear to look up at him.\\n\\n “You sure you don’t want to come?” I asked Mom.\\n\\n “I’m going to the Rijksmuseum and the Vondelpark today,” she said. “Plus, I just don’t get his book. No offense. Thank him and Lidewij for us, okay?”\\n\\n “Okay,” I said. I hugged Mom, and she kissed my head just above my ear.\\n\\n Peter Van Houten’s white row house was just around the corner from the hotel, on the Vondelstraat, facing the park. Number 158. Augustus took me by one arm and grabbed the oxygen cart with the other, and we walked up the three steps to the lacquered blue-black front door. My heart pounded. One closed door away from the answers I’d dreamed of ever since I first read that last unfinished page.\\n\\n Inside, I could hear a bass beat thumping loud enough to rattle the windowsills. I wondered whether Peter Van Houten had a kid who liked rap music.\\n\\n I grabbed the lion’s-head door knocker and knocked tentatively. The beat continued. “Maybe he can’t hear over the music?” Augustus asked. He grabbed the lion’s head and knocked much louder.\\n\\n The music disappeared, replaced by shuffled footsteps. A dead bolt slid. Another. The door creaked open. A potbellied man with thin hair, sagging jowls, and a week-old beard squinted into the sunlight. He wore baby-blue man pajamas like guys in old movies. His face and belly were so round, and his arms so skinny, that he looked like a dough ball with four sticks stuck into it. “Mr. Van Houten?” Augustus asked, his voice squeaking a bit.\\n\\n The door slammed shut. Behind it, I heard a stammering, reedy voice shout, “LEEE-DUH-VIGH!” (Until then, I’d pronounced his assistant’s name like lid-uh-widge.)\\n\\n We could hear everything through the door. “Are they here, Peter?” a woman asked.\\n\\n “There are—Lidewij, there are two adolescent apparitions outside the door.”\\n\\n “Apparitions?” she asked with a pleasant Dutch lilt.\\n\\n Van Houten answered in a rush. “Phantasms specters ghouls visitants post-terrestrials apparitions, Lidewij. How can someone pursuing a postgraduate degree in American literature display such abominable English-language skills?”\\n\\n “Peter, those are not post-terrestrials. They are Augustus and Hazel, the young fans with whom you have been corresponding.”\\n\\n “They are—what? They—I thought they were in America!”\\n\\n “Yes, but you invited them here, you will remember.”\\n\\n “Do you know why I left America, Lidewij? So that I would never again have to encounter Americans.”\\n\\n “But you are an American.”\\n\\n “Incurably so, it seems. But as to these Americans, you must tell them to leave at once, that there has been a terrible mistake, that the blessed Van Houten was making a rhetorical offer to meet, not an actual one, that such offers must be read symbolically.”\\n\\n I thought I might throw up. I looked over at Augustus, who was staring intently at the door, and saw his shoulders slacken.\\n\\n “I will not do this, Peter,” answered Lidewij. “You must meet them. You must. You need to see them. You need to see how your work matters.”\\n\\n “Lidewij, did you knowingly deceive me to arrange this?”\\n\\n A long silence ensued, and then finally the door opened again. He turned his head metronomically from Augustus to me, still squinting. “Which of you is Augustus Waters?” he asked. Augustus raised his hand tentatively. Van Houten nodded and said, “Did you close the deal with that chick yet?”\\n\\n Whereupon I encountered for the first and only time a truly speechless Augustus Waters. “I,” he started, “um, I, Hazel, um. Well.”\\n\\n “This boy appears to have some kind of developmental delay,” Peter Van Houten said to Lidewij.\\n\\n “Peter,” she scolded.\\n\\n “Well,” Peter Van Houten said, extending his hand to me. “It is at any rate a pleasure to meet such ontologically improbable creatures.” I shook his swollen hand, and then he shook hands with Augustus. I was wondering what ontologically meant. Regardless, I liked it. Augustus and I were together in the Improbable Creatures Club: us and duck-billed platypuses.\\n\\n Of course, I had hoped that Peter Van Houten would be sane, but the world is not a wish-granting factory. The important thing was that the door was open and I was crossing the threshold to learn what happens after the end of An Imperial Affliction. That was enough. We followed him and Lidewij inside, past a huge oak dining room table with only two chairs, into a creepily sterile living room. It looked like a museum, except there was no art on the empty white walls. Aside from one couch and one lounge chair, both a mix of steel and black leather, the room seemed empty. Then I noticed two large black garbage bags, full and twist-tied, behind the couch.\\n\\n “Trash?” I mumbled to Augustus soft enough that I thought no one else would hear.\\n\\n “Fan mail,” Van Houten answered as he sat down in the lounge chair. “Eighteen years’ worth of it. Can’t open it. Terrifying. Yours are the first missives to which I have replied, and look where that got me. I frankly find the reality of readers wholly unappetizing.”\\n\\n That explained why he’d never replied to my letters: He’d never read them. I wondered why he kept them at all, let alone in an otherwise empty formal living room. Van Houten kicked his feet up onto the ottoman and crossed his slippers. He motioned toward the couch. Augustus and I sat down next to each other, but not too next.\\n\\n “Would you care for some breakfast?” asked Lidewij.\\n\\n I started to say that we’d already eaten when Peter interrupted. “It is far too early for breakfast, Lidewij.”\\n\\n “Well, they are from America, Peter, so it is past noon in their bodies.”\\n\\n “Then it’s too late for breakfast,” he said. “However, it being after noon in the body and whatnot, we should enjoy a cocktail. Do you drink Scotch?” he asked me.\\n\\n “Do I—um, no, I’m fine,” I said.\\n\\n “Augustus Waters?” Van Houten asked, nodding toward Gus.\\n\\n “Uh, I’m good.”\\n\\n “Just me, then, Lidewij. Scotch and water, please.” Peter turned his attention to Gus, asking, “You know how we make a Scotch and water in this home?”\\n\\n “No, sir,” Gus said.\\n\\n “We pour Scotch into a glass and then call to mind thoughts of water, and then we mix the actual Scotch with the abstracted idea of water.”\\n\\n Lidewij said, “Perhaps a bit of breakfast first, Peter.”\\n\\n He looked toward us and stage-whispered, “She thinks I have a drinking problem.”\\n\\n “And I think that the sun has risen,” Lidewij responded. Nonetheless, she turned to the bar in the living room, reached up for a bottle of Scotch, and poured a glass half full. She carried it to him. Peter Van Houten took a sip, then sat up straight in his chair. “A drink this good deserves one’s best posture,” he said. \\n\\n","sourceLink":"https://allnovel.net/the-fault-in-our-stars/page-16.html","bookId":2735,"book":{"id":2735,"title":"The Fault in Our Stars","description":"Storyline: Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel\u0027s story is about to be completely rewritten.\\n","cover":"https://allnovel.net/images/the-fault-in-our-stars.jpg","author":"John Green","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-fault-in-our-stars.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:33:07 PM"}}
