{"id":81144,"no":5,"title":"Page 5","content":"The other thing about Kaitlyn, I guess, was that it could never again feel natural to talk to her. Any attempts to feign normal social interactions were just depressing because it was so glaringly obvious that everyone I spoke to for the rest of my life would feel awkward and self-conscious around me, except maybe kids like Jackie who just didn’t know any better.\\n\\n Anyway, I really did like being alone. I liked being alone with poor Staff Sergeant Max Mayhem, who—oh, come on, he’s not going to survive these seventeen bullet wounds, is he?\\n\\n (Spoiler alert: He lives.)\\n\\n CHAPTER FOUR\\n\\n I went to bed a little early that night, changing into boy boxers and a T-shirt before crawling under the covers of my bed, which was queen size and pillow topped and one of my favorite places in the world. And then I started reading An Imperial Affliction for the millionth time.\\n\\n AIA is about this girl named Anna (who narrates the story) and her one-eyed mom, who is a professional gardener obsessed with tulips, and they have a normal lower-middle- class life in a little central California town until Anna gets this rare blood cancer.\\n\\n But it’s not a cancer book, because cancer books suck. Like, in cancer books, the cancer person starts a charity that raises money to fight cancer, right? And this commitment to charity reminds the cancer person of the essential goodness of humanity and makes him/her feel loved and encouraged because s/he will leave a cancer-curing legacy. But in AIA, Anna decides that being a person with cancer who starts a cancer charity is a bit narcissistic, so she starts a charity called The Anna Foundation for People with Cancer Who Want to Cure Cholera.\\n\\n Also, Anna is honest about all of it in a way no one else really is: Throughout the book, she refers to herself as the side effect, which is just totally correct. Cancer kids are essentially side effects of the relentless mutation that made the diversity of life on earth possible. So as the story goes on, she gets sicker, the treatments and disease racing to kill her, and her mom falls in love with this Dutch tulip trader Anna calls the Dutch Tulip Man. The Dutch Tulip Man has lots of money and very eccentric ideas about how to treat cancer, but Anna thinks this guy might be a con man and possibly not even Dutch, and then just as the possibly Dutch guy and her mom are about to get married and Anna is about to start this crazy new treatment regimen involving wheatgrass and low doses of arsenic, the book ends right in the middle of a\\n\\n I know it’s a very literary decision and everything and probably part of the reason I love the book so much, but there is something to recommend a story that ends. And if it can’t end, then it should at least continue into perpetuity like the adventures of Staff Sergeant Max Mayhem’s platoon.\\n\\n I understood the story ended because Anna died or got too sick to write and this midsentence thing was supposed to reflect how life really ends and whatever, but there were characters other than Anna in the story, and it seemed unfair that I would never find out what happened to them. I’d written, care of his publisher, a dozen letters to Peter Van Houten, each asking for some answers about what happens after the end of the story: whether the Dutch Tulip Man is a con man, whether Anna’s mother ends up married to him, what happens to Anna’s stupid hamster (which her mom hates), whether Anna’s friends graduate from high school—all that stuff. But he’d never responded to any of my letters.\\n\\n AIA was the only book Peter Van Houten had written, and all anyone seemed to know about him was that after the book came out he moved from the United States to the Netherlands and became kind of reclusive. I imagined that he was working on a sequel set in the Netherlands—maybe Anna’s mom and the Dutch Tulip Man end up moving there and trying to start a new life. But it had been ten years since An Imperial Affliction came out, and Van Houten hadn’t published so much as a blog post. I couldn’t wait forever.\\n\\n As I reread that night, I kept getting distracted imagining Augustus Waters reading the same words. I wondered if he’d like it, or if he’d dismiss it as pretentious. Then I remembered my promise to call him after reading The Price of Dawn, so I found his number on its title page and texted him.\\n\\n Price of Dawn review: Too many bodies. Not enough adjectives. How’s AIA?\\n\\n He replied a minute later:\\n\\n As I recall, you promised to CALL when you finished the book, not text.\\n\\n So I called.\\n\\n “Hazel Grace,” he said upon picking up.\\n\\n “So have you read it?”\\n\\n “Well, I haven’t finished it. It’s six hundred fifty-one pages long and I’ve had twenty-four hours.”\\n\\n “How far are you?”\\n\\n “Four fifty-three.”\\n\\n “And?”\\n\\n “I will withhold judgment until I finish. However, I will say that I’m feeling a bit embarrassed to have given you The Price of Dawn.”\\n\\n “Don’t be. I’m already on Requiem for Mayhem.”\\n\\n “A sparkling addition to the series. So, okay, is the tulip guy a crook? I’m getting a bad vibe from him.”\\n\\n “No spoilers,” I said.\\n\\n “If he is anything other than a total gentleman, I’m going to gouge his eyes out.”\\n\\n “So you’re into it.”\\n\\n “Withholding judgment! When can I see you?”\\n\\n “Certainly not until you finish An Imperial Affliction.” I enjoyed being coy.\\n\\n “Then I’d better hang up and start reading.”\\n\\n “You’d better,” I said, and the line clicked dead without another word.\\n\\n Flirting was new to me, but I liked it.\\n\\n The next morning I had Twentieth-Century American Poetry at MCC. This old woman gave a lecture wherein she managed to talk for ninety minutes about Sylvia Plath without ever once quoting a single word of Sylvia Plath.\\n\\n When I got out of class, Mom was idling at the curb in front of the building.\\n\\n “Did you just wait here the entire time?” I asked as she hurried around to help me haul my cart and tank into the car.\\n\\n “No, I picked up the dry cleaning and went to the post office.”\\n\\n “And then?”\\n\\n “I have a book to read,” she said.\\n\\n “And I’m the one who needs to get a life.” I smiled, and she tried to smile back, but there was something flimsy in it. After a second, I said, “Wanna go to a movie?”\\n\\n “Sure. Anything you’ve been wanting to see?”\\n\\n “Let’s just do the thing where we go and see whatever starts next.” She closed the door for me and walked around to the driver’s side. We drove over to the Castleton theater and watched a 3-D movie about talking gerbils. It was kind of funny, actually.\\n\\n When I got out of the movie, I had four text messages from Augustus.\\n\\n Tell me my copy is missing the last twenty pages or something.\\n\\n Hazel Grace, tell me I have not reached the end of this book.\\n\\n OH MY GOD DO THEY GET MARRIED OR NOT OH MY GOD WHAT IS THIS\\n\\n I guess Anna died and so it just ends? CRUEL. Call me when you can. Hope all’s okay.\\n\\n So when I got home I went out into the backyard and sat down on this rusting latticed patio chair and called him. It was a cloudy day, typical Indiana: the kind of weather that boxes you in. Our little backyard was dominated by my childhood swing set, which was looking pretty waterlogged and pathetic.\\n\\n Augustus picked up on the third ring. “Hazel Grace,” he said.\\n\\n “So welcome to the sweet torture of reading An Imperial—” I stopped when I heard violent sobbing on the other end of the line. “Are you okay?” I asked.\\n\\n “I’m grand,” Augustus answered. “I am, however, with Isaac, who seems to be decompensating.” More wailing. Like the death cries of some injured animal. Gus turned his attention to Isaac. “Dude. Dude. Does Support Group Hazel make this better or worse? Isaac. Focus. On. Me.” After a minute, Gus said to me, “Can you meet us at my house in, say, twenty minutes?”\\n\\n “Sure,” I said, and hung up.\\n\\n If you could drive in a straight line, it would only take like five minutes to get from my house to Augustus’s house, but you can’t drive in a straight line because Holliday Park is between us.\\n\\n Even though it was a geographic inconvenience, I really liked Holliday Park. When I was a little kid, I would wade in the White River with my dad and there was always this great moment when he would throw me up in the air, just toss me away from him, and I would reach out my arms as I flew and he would reach out his arms, and then we would both see that our arms were not going to touch and no one was going to catch me, and it would kind of scare the shit out of both of us in the best possible way, and then I would legs-flailingly hit the water and then come up for air uninjured and the current would bring me back to him as I said again, Daddy, again.\\n\\n I pulled into the driveway right next to an old black Toyota sedan I figured was Isaac’s car. Carting the tank behind me, I walked up to the door. I knocked. Gus’s dad answered.\\n\\n “Just Hazel,” he said. “Nice to see you.”\\n\\n “Augustus said I could come over?”\\n\\n “Yeah, he and Isaac are in the basement.” At which point there was a wail from below. “That would be Isaac,” Gus’s dad said, and shook his head slowly. “Cindy had to go for a drive. The sound . . .” he said, drifting off. “Anyway, I guess you’re wanted downstairs. Can I carry your, uh, tank?” he asked.\\n\\n “Nah, I’m good. Thanks, though, Mr. Waters.”\\n\\n “Mark,” he said.\\n\\n I was kind of scared to go down there. Listening to people howl in misery is not among my favorite pastimes. But I went.\\n\\n “Hazel Grace,” Augustus said as he heard my footsteps. “Isaac, Hazel from Support Group is coming downstairs. Hazel, a gentle reminder: Isaac is in the midst of a psychotic episode.”\\n\\n Augustus and Isaac were sitting on the floor in gaming chairs shaped like lazy Ls, staring up at a gargantuan television. The screen was split between Isaac’s point of view on the left, and Augustus’s on the right. They were soldiers fighting in a bombed-out modern city. I recognized the place from The Price of Dawn. As I approached, I saw nothing unusual: just two guys sitting in the lightwash of a huge television pretending to kill people.\\n\\n Only when I got parallel to them did I see Isaac’s face. Tears streamed down his reddened cheeks in a continual flow, his face a taut mask of pain. He stared at the screen, not even glancing at me, and howled, all the while pounding away at his controller. “How are you, Hazel?” asked Augustus.\\n\\n “I’m okay,” I said. “Isaac?” No response. Not even the slightest hint that he was aware of my existence. Just the tears flowing down his face onto his black T-shirt.\\n\\n Augustus glanced away from the screen ever so briefly. “You look nice,” he said. I was wearing this just-past-the-knees dress I’d had forever. “Girls think they’re only allowed to wear dresses on formal occasions, but I like a woman who says, you know, I’m going over to see a boy who is having a nervous breakdown, a boy whose connection to the sense of sight itself is tenuous, and gosh dang it, I am going to wear a dress for him.”\\n\\n “And yet,” I said, “Isaac won’t so much as glance over at me. Too in love with Monica, I suppose,” which resulted in a catastrophic sob.\\n\\n “Bit of a touchy subject,” Augustus explained. “Isaac, I don’t know about you, but I have the vague sense that we are being outflanked.” And then back to me, “Isaac and Monica are no longer a going concern, but he doesn’t want to talk about it. He just wants to cry and play Counterinsurgence 2: The Price of Dawn.”\\n\\n “Fair enough,” I said.\\n\\n “Isaac, I feel a growing concern about our position. If you agree, head over to that power station, and I’ll cover you.” Isaac ran toward a nondescript building while Augustus fired a machine gun wildly in a series of quick bursts, running behind him.\\n\\n “Anyway,” Augustus said to me, “it doesn’t hurt to talk to him. If you have any sage words of feminine advice.”\\n\\n “I actually think his response is probably appropriate,” I said as a burst of gunfire from Isaac killed an enemy who’d peeked his head out from behind the burned-out husk of a pickup truck.\\n\\n Augustus nodded at the screen. “Pain demands to be felt,” he said, which was a line from An Imperial Affliction. “You’re sure there’s no one behind us?” he asked Isaac. Moments later, tracer bullets started whizzing over their heads. “Oh, goddamn it, Isaac,” Augustus said. “I don’t mean to criticize you in your moment of great weakness, but you’ve allowed us to be outflanked, and now there’s nothing between the terrorists and the school.” Isaac’s character took off running toward the fire, zigging and zagging down a narrow alleyway.\\n\\n “You could go over the bridge and circle back,” I said, a tactic I knew about thanks to The Price of Dawn.\\n\\n Augustus sighed. “Sadly, the bridge is already under insurgent control due to questionable strategizing by my bereft cohort.”\\n\\n “Me?” Isaac said, his voice breathy. “Me?! You’re the one who suggested we hole up in the freaking power station.”\\n\\n Gus turned away from the screen for a second and flashed his crooked smile at Isaac. “I knew you could talk, buddy,” he said. “Now let’s go save some fictional schoolchildren.”\\n\\n Together, they ran down the alleyway, firing and hiding at the right moments, until they reached this one-story, single-room schoolhouse. They crouched behind a wall across the street and picked off the enemy one by one.\\n\\n “Why do they want to get into the school?” I asked.\\n\\n “They want the kids as hostages,” Augustus answered. His shoulders rounded over his controller, slamming buttons, his forearms taut, veins visible. Isaac leaned toward the screen, the controller dancing in his thin-fingered hands. “Get it get it get it,” Augustus said. The waves of terrorists continued, and they mowed down every one, their shooting astonishingly precise, as it had to be, lest they fire into the school. \\n\\n","sourceLink":"https://allnovel.net/the-fault-in-our-stars/page-5.html","bookId":2735,"book":{"id":2735,"title":"The Fault in Our Stars","description":"Storyline: Despite the tumor-shrinking medical miracle that has bought her a few years, Hazel has never been anything but terminal, her final chapter inscribed upon diagnosis. But when a gorgeous plot twist named Augustus Waters suddenly appears at Cancer Kid Support Group, Hazel\u0027s story is about to be completely rewritten.\\n","cover":"https://allnovel.net/images/the-fault-in-our-stars.jpg","author":"John Green","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-fault-in-our-stars.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:33:07 PM"}}
