{"id":42646,"no":19,"title":"CHAPTER XIX. MR. SLOCUM AS AN ORATOR.","content":"“Next Wednesday afternoon the boys will all speak pieces,” Mr. Slocum announced. “You may select any pieces you please. At the celebrated institution in Maine, from which I graduated, we used to speak pieces every week. You may be interested to know that your teacher gained a great reputation by his speaking. ‘Theophilus,’ said the principal to me one day, I never had a student under my instruction who could equal you in speaking. There is no one who can do such justice to Daniel Webster, and other great orators of antiquity. You are a natural orator, and eloquence comes natural to you.’ This was a high compliment, as you will agree; but it was deserved. The principal put it to vote whether a prize should be offered for speaking, but the students voted against it; ‘for,’ they said, ‘Slocum will be sure to get it, and it will do us no good.’ I hope, boys, you will do your best, so that I may be able to compliment you.” The scholars were not a little amused at this illustration of their teacher’s self-conceit, which was quite in keeping with previous exhibitions of the same weakness. “I wish Mr. Slocum would favor us with a specimen of his declamation,” said John Sandford, at recess. “He must be a regular steam engine,” said Walter Pratt; “that is, according to his own account.” “The principal of the celebrated institution in Maine thought a good deal of Theophilus,” said Julius. “What a phenomenon he must have been!” said Tom Allen. “He appears to have stood first in everything.” “But he seems to forget easy,” said Frank Bent. “Complex fractions are too much for him.” “Well, how about asking him to speak?” resumed John Sandford. “Who goes in for it?” “I,” said Julius. “And I.” “And I.” “Who shall go up and ask him?” “Go yourself, John.” “All right, boys. I’ll do it, if you say so. But I am afraid I can’t keep a straight face.” So John went back into school just before the bell rang, and approached the teacher’s desk. “What’s wanted, Sandford?” said Mr. Slocum. “The boys want to know, Mr. Slocum, if you will be willing to speak a piece for us on Wednesday. You see, sir, we never heard any good speaking, and we think it would improve us if we could hear a good speaker now and then.” As may be inferred from his habit of boasting, Mr. Slocum was very accessible to flattery, and listened graciously to this request. John was perfectly sober, though he was laughing inside, as he afterward said; and the teacher never dreamed of a plot to expose and ridicule him. “You are quite right, Sandford,” said he, graciously; “it would undoubtedly be very beneficial to you, and I will look over one of my old pieces, and see if I can remember it. I am glad to see that the boys are anxious to improve in the important branch of declamation.” John carried to the boys the news of his success, which was received with a great deal of interest. Though most of the boys thought it irksome to commit a piece to memory, and had no ambition to become orators, all went to work willingly, feeling that they should be repaid by hearing the “master” speak. “Speaking” was new business to Julius. During his very brief school attendance in New York he had not been sufficiently advanced to declaim, and he felt a little apprehensive about his success. He chose an extract from one of Webster’s speeches, and carefully committed it, reciting it at home to Mr. Taylor, from whom he received several suggestions, which he found of value. The result was that he acquitted himself quite creditably. “I wonder whether the master’ll speak first,” said John Sandford, and there were others who wondered also; but Mr. Slocum had not announced his intentions on this point. But when the scholars were assembled on Wednesday afternoon, he said: “I have promised you that I will give you this afternoon a specimen of my speaking, and I have selected one of the pieces that I was distinguished for, when I was connected with one of the most celebrated institutions in the State of Maine. I will wait, however, until you are all through, as I do not like to discourage you in your inexperienced efforts. I will wind up the speaking by ascending the rostrum after your declamation is finished.” One after another the boys spoke. One boy, of thirteen, rather inappropriately had selected the well-known little poem, commencing “You’d scarce expect one of my age To speak in public on the stage.” “That piece is rather too young for you,” said Mr. Slocum, when he had taken his seat. “I remember speaking that piece when I was two years old. I was considered a very forward baby, and my parents were very proud of me; so they invited some company, and in the course of the evening they stood me up on a table, and I spoke the piece you have just listened to. Even now I can remember, though it is so long ago, how the company applauded, and how the minister came up to me, and, putting his hand on my head, said: ‘Theophilus, the day will come when your father will be proud of you. You will live to be a credit to the whole Slocum family.’ Then he turned to my father, and said: ‘Mr. Slocum, I congratulate you on the brilliant success of your promising son. He is indeed a juvenile “progedy”’”—this was Mr. Slocum’s word—“‘and the world will yet hear of him.’ Such was my first introduction to the world as an orator, and I have always enjoyed speaking from that time. I hope that some of my pupils will also become distinguished in the same way.” “I wish he’d speak that piece now,” whispered Julius to his next neighbor. “Isn’t he a conceited jackass?” was the reply. “He must have been a beautiful baby,” said Julius, comically. “A regular phenomenon in petticoats.” “What are you laughing at?” demanded Mr. Slocum, sternly. “Julius said he wished you would speak that piece you spoke when you were two years old.” “It wouldn’t be appropriate,” said the teacher, seriously. “I like best now to declaim the sonorous sentences of Daniel Webster and Patrick Henry. If I should ever enter public life, as my friends have tried at times to persuade me, I think I should adopt their style. Frank Bent, it is your turn to speak.” At last the scholars had all spoken, and in expectant silence Mr. Slocum’s “piece” was awaited by the boys. “Boys,” he said, arising with dignity, and advancing to the platform, “I should like to speak a piece from Webster; but I have forgotten those I once knew, and I will favor you with one of a lighter character, called ‘The Seminole’s Reply.’” Mr. Slocum took his place on the rostrum, as he liked to call it, made a low bow to the boys, struck an attitude, and began to declaim at the top of his voice. The first two stanzas are quoted here, in order to show more clearly the character of Mr. Slocum’s declamation: “Blaze, with your serried columns! I will not bend the knee! The shackles ne’er again shall bind The arm which now is free. I’ve mailed it with the thunder, When the tempest muttered low, And when it falls, ye well may dread The lightning of its blow! “I’ve seared ye in the city, I’ve scalped ye on the plain; Go, count your chosen, where they fell Beneath my leaden rain! I scorn your proffered treaty! The paleface I defy! Revenge is stamped upon my spear, And blood my battle cry!” No fault could be found with Mr. Slocum on the score of animation. He exerted his voice to the utmost, stamped with his foot, and when he came to “the arm which now is free,” he shook his first at the boys in a most savage way. But his most effective gesture occurred in the second line of the second verse, where, in illustrating the act of scalping, he gathered with one hand his luxuriant red hair, and with the other made a pass at it with an imaginary tomahawk. The boys cheered vociferously, which encouraged Mr. Slocum to further exertions. Nothing could exceed the impressive dignity with which he delivered the concluding half of the fourth stanza: “But I stand as should the warrior, With his rifle and his spear; The scalp of vengeance still is red And warns ye, Come not here!” The gravity of the boys, however, was endangered by a too appropriate gesture. When Mr. Slocum wished to designate the scalp of vengeance as still red, he pointed to his own hair, which, as has been said, was of a decided red tint. The two concluding lines of the poem, as many of my readers, to whom it is familiar, will doubtless remember, are these: “But I’ll swim the sea of slaughter, Till I sink beneath its wave.” This Mr. Slocum illustrated by going through the motions of swimming with his hands, much to the delight of the boys. When the orator had concluded his effort, and with a low bow resumed his seat, the boys applauded uproariously. Mr. Slocum’s vanity was flattered, and he arose to acknowledge the compliment. “Boys,” he said, “I am glad to find that you appreciate my efforts to instruct you. Don’t be discouraged because you cannot yet speak as well as I do. Keep on in your efforts. Let your motto ever be Excelsior! and the time will perhaps come when you will receive the applause of listening multitudes. The school is now dismissed.” “Wasn’t it rich, Julius?” asked John Sandford, when they were walking home. “I never wanted to laugh so much in all my life. But the best of it was about the red scalp.” “You’re envious, John. That’s the reason you ridicule Mr. Slocum’s speaking. I’m afraid you’ll never be as great an orator as he is.” “I hope not,” said John. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2985/82292.html","bookId":341,"book":{"id":341,"title":"Julius, The Street Boy or Out West","description":"简介： Where are you goin, Julius? Wheres yer blackin box? asked Patrick Riley....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2985","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
