{"id":42636,"no":9,"title":"CHAPTER IX. THE BEAR AND HIS MASTER.","content":"“Hadn’t we better holler to him to look out for the bear?” suggested Teddy. “He sees him, and is callin’ to him,” said Julius, directly afterward. The three boys looked on in eager excitement, to see what would come of the meeting. Teddy fully expected that the bear would appropriate the newcomer for his supper, and was very much surprised at seeing him rubbing his head against the boy’s legs, as if they were fast friends. “Look at that,” he cried. “I don’t believe he’s a bear.” “Yes, he is,” said Tom, confidently. “Don’t you think I know a bear when I see him?” “I’ll ask him,” said Julius. “Hello, there, Johnny!” he called out from the boat. The boy looked up, and for the first time noticed the three boys. “How did you know my name?” he asked, in surprise, for it so happened that his name was really John. “I guessed at it,” said Julius. “Who are you?” “We’re New York aldermen,” said Julius, “travelin’ for our health.” “How came you in my boat?” “Is the boat yours?” “Yes.” “We thought we’d give it a little exercise, seein’ it had nothin’ to do.” “I know who you are. You came with the agent of the Children’s Aid Society.” “That’s so; I’m the president of the society, and these gentlemen are directors.” “You look like it,” said the other boy, smiling. “Is that a bear?” asked Tom, who was anxious to have the question settled. “Yes, it is.” “Won’t he bite?” “Oh, no; he’s a tame bear. Ain’t you, old Bruin?” The bear rubbed his head against his legs as before. “Won’t he do anything to us if we come on shore?” asked Teddy, nervously. “Oh, no; he’s as good-natured as an old dog.” “Then we’ll land,” said Julius. “We’ve been stayin’ out here an hour, ’cause Teddy here was afraid of him.” “You were just as much afraid as I was,” said Teddy, indignantly. “That’s a lie. Me and Tom ain’t afraid of anything; but we wouldn’t leave you here alone.” “Don’t you believe him,” said Teddy. “I don’t,” said the boy on shore, laughing. “You see,” said Julius, “that my life is valuable to my country, and I couldn’t bear to lose it. Step out, Teddy. Now tie the boat. We’d better make tracks, or Mr. O’Connor’ll scold us.” They joined the other boy and the bear, though Teddy took care to keep as far away from the latter as he could. “Where did you get the bear?” asked Julius. “Do they live around here?” “No; this was taken when a cub by an uncle of mine, and when it was half-grown he gave it to me.” “How long have you had him?” “About five years; ever since I was nine years old.” “Is he quite tame?” “Oh, yes; he’s as tame as a cat.” “Do you let him go around loose?” “Part of the time. In the night we tie him, and keep him in the barn.” The bear, with the desire probably of getting acquainted with different members of the party, here walked around to the further side, where Teddy was walking. “Oh, take him away!” said the frightened boy. “He’s goin’ for me.” “Shut up, you fool!” said Julius; “do you think he’d touch such skinny meat as you, when he could have Tom or me? He ain’t fond of pigs.” “I wouldn’t care if he ate you or Tom,” said Teddy. “Pat him,” said the stranger. “You’ll see how he won’t hurt you.” Teddy did so in fear and trembling, and was at last convinced that there was nothing to fear. “Are you going to live in Brookville?” asked the young owner of the bear. “I am,” said Julius. “Who are you going to live with?” “With Mr. Taylor.” “Mr. Ephraim Taylor?” “Yes; what kind of a man is he?” “He’s a good man; he’s rich, too. Did he say he’d take you?” “Yes; I brought him a letter from his uncle. His uncle gave me this watch and chain;” and Julius displayed, not without pride, his valued treasure. “It’s a nice one,” said the other, after examining it. “Have you got one?” “Not yet; my father’s going to give me one on my next birthday.” “When will that be?” “On the Fourth of July.” “Was you born then?” “Yes,” said John smiling. “They celebrate my birthday around here.” “We do in New York, too.” “You see I am a great man.” “What’s your name—your whole name?” “John Sandford.” “Do you live near Mr. Taylor’s?” “About half a mile.” “Then we’ll see each other sometimes.” “Yes; you can tell me about New York.” “Wasn’t you ever there?” “No; but I should like to go. It’s a very big place, isn’t it?” “You bet it is.” “What is the population?” “What?” “How many people are there in the city?” “About ten million, I guess,” said Julius, pausing to think, and then guessing. “There can’t be so many as that. Why, London has only a little over three millions.” “London ain’t New York.” “No; but it’s a good deal bigger.” “Well, I don’t know exactly. I never counted,” said Julius. “Are those other boys going to live in Brookville?” “I hope I will,” said Teddy. “So do I,” said Tom. “Mr. O’Connor is goin’ to get places for us to-morrow,” said Julius. “I’ll tell you what, Johnny, you’d better take Teddy yourself. You could let him sleep with the bear. Only, if the bear got hungry in his sleep, maybe he’d make hash out of him.” “That would be hash treatment,” said John, laughing. “What is your name? I’ve told you mine.” “My name is Julius.” “What else?” “Nothing else.” “Haven’t you got but one name?” asked John, surprised. “No; what’s the use of two names?” “Everybody has two.” “Then, if I go to live with Mr. Taylor, I’ll call myself Julius Taylor.” “What’s your name?” turning to Teddy. “I’ll tell you,” said Julius. “That is the Hon. Teddy Bates, professor of boot blackin’, and this other bummer is Tom Burke, Esq., one of the most distinguished baggage-smashers in all New York.” “I don’t often get into such good company,” said John, laughing. “Are all the rest of your company as celebrated?” “Oh, no; they’re common loafers. Me and Tom and Teddy are——” “Uncommon loafers, I suppose.” “You guessed right the first time,” said Julius. “Hello, fellers!” interrupted Tom; “there’s Pat Maloney comin’ up the road; I guess he’s comin’ for us.” “Where’ve you fellers been?” said Pat, on meeting them. “Mr. O’Connor sent me to find you.” “Was he mad?” “No; he thought you’d lost your way. What’s that?” he exclaimed, suddenly, for the first time espying the bear. “It’s a bear,” said John Sandford. “But don’t be frightened. He is tame. He won’t hurt you.” “You’d better come quick, or you’ll lose your grub,” said Pat. This was enough. The three boys were very hungry, and, quickening their pace, soon rejoined their companions, whom they found partaking of a substantial supper, which had been liberally supplied by the citizens of Brookville, with characteristic Western hospitality. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2985/82282.html","bookId":341,"book":{"id":341,"title":"Julius, The Street Boy or Out West","description":"简介： Where are you goin, Julius? Wheres yer blackin box? asked Patrick Riley....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2985","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
