{"id":10775,"no":3,"title":"CHAPTER II. THE FIRST MONEY.","content":"From the preceding chapter our readers will perceive the value of iron, and also the importance to the community of the mechanic who is able to work it. We would invite them to reflect upon some facts that may seem incredible to them at first view. A boy who has no disposition to reflect is not much of a boy, and when grown, will only be a servant to those who do. \\n\\n \\n\\n Iron is far more valuable than gold, and the blacksmith than the jeweler, for the same reason that bread is worth more than diamonds, and water than silver. Gold has a very great representative value in civilized society, where iron is abundant, and it will buy iron, and is an equivalent for the work of the smith; but it is only because men have agreed to make it so. Whereas iron has a value in itself considered. It fells the forest, tills the soil, annihilates time and distance, and underlies the whole economy of domestic life; for our readers will bear in mind that steel is only another form of iron. \\n\\n \\n\\n [Pg 19] \\n\\n \\n\\n The value iron acquires under the hammer is something wonderful. It is said that a bar of iron worth $5 is worth $10.50 when made into horse-shoes, $55 when made into needles, $3,285 made into penknife blades, $29,480 in shirt buttons, and $250,000, in balance springs of watches. Boys may, from this, see what labor is worth, and learn to value and respect it, for it is the labor the mind put into the iron that so increases its value. Consider what would be the result if there were no iron. \\n\\n \\n\\n A boy might search long to find a better subject for his theme than iron and its uses, or one the treatment of which would be more instructive to himself. The showers of sparks you see pouring out of a blacksmith\u0027s chimney, at times, of an evening when he is pressed with work, and forgets the ten-hour system, have a language to a reflecting mind; they mean power, progress, the plough, the telegraph, the mariner\u0027s compass, and the sword. \\n\\n \\n\\n We have taken advantage of a pause in the conversation, during which William Richardson resumed his reverie, and his wife plied her cards, to make this digression. At length the mother laid her cards into the basket of wool, and folding her hands in her lap, remained a few moments wrapped in thought. She then said,— \\n\\n \\n\\n \"Husband, I feel so sure that good will come of this, that it will be, in the end, the best thing for us all (for I know you can do whatever you put your[Pg 20] hand to), that I am willing to undergo almost anything to bring it about. There are three articles that will always sell at the store for half cash and half goods—butter, woollen cloth, and linen yarn. I will sell what we have to get your tools, and, perhaps, a little iron.\" \\n\\n \\n\\n \"Susan, what did you make this cloth for, and what shape is it in?\" \\n\\n \\n\\n \"There\u0027s a piece of fulled cloth that I meant to make clothes of for you and the boys, some that I wove for a gown for myself and the girls, and some blanket stuff.\" \\n\\n \\n\\n \"I won\u0027t take it; I won\u0027t take the clothes from your back and the children\u0027s if I never have any tools: the butter, I suppose, you have laid down for winter, and the blankets are needed for the children\u0027s beds.\" \\n\\n \\n\\n \"Yes, you must take it; if you can work iron, we shall have the house as full of butter, meat, and cloth as John Drew\u0027s is.\" \\n\\n \\n\\n \"But we can\u0027t get along without these things.\" \\n\\n \\n\\n \"We can if we only think so. We can put some brush on the children\u0027s beds, over the clothes,—hemlock brush over a few clothes is real warm,—then, when it is very cold, we can leave a large fire when we go to bed, and you can get up at twelve o\u0027clock and put on wood. The children can get along with their old clothes, and I with mine; there\u0027s nobody to look at us here. We have pork enough, and can do without butter[Pg 21] till we can make some. One of the cows calves in March. I meant to have made some towels of the linen yarn, but tow will do just as well.\" \\n\\n \\n\\n \"Susan, I think a man must be made of poor material who could be discouraged with a wife like you.\" \\n\\n \\n\\n \"Mother always used to say, \u0027Think you can do a thing, and it\u0027s half done.\u0027\" \\n\\n \\n\\n The sledding was now good, and Richardson, engaged in hauling logs to the river, had no leisure to meddle with iron; he, however, at odd moments, when the cattle were eating, and on stormy days, made preparation in anticipation of the future. \\n\\n \\n\\n Near to his house stood the stump of a pine tree that had been cut when the snow was deep, and was higher than usual. Around this he built a log camp, in such a manner as to bring the stump on one side of the camp. The water was low in the river, and where it fell over the rocks, and by shovelling away the snow, he found a stone of sufficient size, hardness, and the right shape, for an anvil. Levelling the top of the stump, he made a cavity in it to receive the stone, and secured it firmly in its bed. This was much superior to a stone on the kitchen hearth, and would bear any blows that could be given with a hand-hammer. There was not a board or plank within eleven miles by land, and thirteen by the river. He flattened some pine saplings, and built up a pen, nearly[Pg 22] square, for his forge, found a place in the swamp where the soil was not frozen, and obtained earth to fill it. By cutting through the frozen ground at the bank of the river, he obtained clay for mortar, and with stones built up a little abutment at one end of the forge, to lay his coal and build the fire against. There was no chimney, a hole being left in the roof for the escape of the gas and smoke. He then put a trough at the end of the forge, in which to cool his iron. The floor cost no labor, as it was supplied by mother earth. There was no window, but light came in at the smoke-hole in the roof between the logs and through the chinks of the door, made of joist hewed from small trees, treenailed together and hung on wooden hinges. All this was done little by little, as opportunity offered, and his wife and the children made charcoal by charring wood in the oven, as he could not obtain turf to burn a kiln out of doors in the winter. In mending his chain and staple, Richardson had felt very much the need of something to turn his iron around. One end of a smith\u0027s anvil terminates in a point, called the horn, and around which, whenever he wishes to make a hoop, ring, or link of a chain, he can bend it. Richardson had brought into the forest with him a large crowbar. At the expense of much labor with his nail-hammer, he rounded the extremity of the largest end, leaving the rest square; then boring a hole in the stump on the[Pg 23] right side, he drove the bar into it. This served as a very good substitute for a horn to his stone anvil, as he could turn a chain link on the round part, and bend iron at right angles on the square edge; and he was not a little proud of it when done. \\n\\n \\n\\n Richardson\u0027s ability to work in wood was well known to his neighbors, but he had carefully concealed his attempts in the blacksmith line, as he did not wish to attract attention till he could obtain tools, and had made some progress. But a matter of such general interest could not long be hid. The children told about their father\u0027s mending the chain and the staple, and it was soon known, to the great satisfaction of the neighbors. \\n\\n \\n\\n This little community, secluded from society and embosomed in the forest, most of them having emigrated from the same neighborhood, and enduring like hardships, were extremely social in their habits, much attached to one another, and ready to make sacrifices for the common good. David Montague was especially beloved by his neighbors, being a man of good abilities, and most open and affectionate disposition. In better circumstances than the rest, he was able to hire help to clear his land, and also kept a horse and a large stock of cattle. \\n\\n \\n\\n A few days after Richardson had made his preparations, he came in of an evening with his wife, and bringing a chain in his hand, that he flung[Pg 24] down at the door. After greetings were exchanged, and they had drawn together around the fire, Montague observed,— \\n\\n \\n\\n \"Neighbor, I hear that you have turned blacksmith, and do your own iron work.\" \\n\\n \\n\\n \"I\u0027m sure,\" said Mrs. Montague, \"it is going to be a great thing for the place if we have got a smith among us.\" \\n\\n \\n\\n \"They say,\" replied Richardson, \"that stories never lose anything by going, and I think this is a pretty good proof of it, for it all grew out of this: I went to the village, you know, a while since, to mill, for all hands, and to get some iron work done. While I stood watching Jack Drew, and blowing the bellows for him, I said to myself, \u0027I could do that work, or I could learn to do it, if I only had his tools and fire, just as well as I can make a pair of wheels, or an axletree, or frame a building, or make a cider-press.\u0027 I used to do that kind of work sometimes before I came here. I thought it over going home, and the next time I broke a chain, I set to work with a flat stone before the fire, and mended it, and then I mended a staple; that\u0027s the way it came about. I made up my mind then I\u0027d mend my own things, if I could, and save the expense and the long tramp. As we\u0027ve got only these two rooms, and there isn\u0027t much room round the fire, I built a hovel to work in.\" \\n\\n \\n\\n \"I can tell you, Mr. Montague, he made out[Pg 25] firstrate. Husband, show Mr. Montague the chain you mended.\" \\n\\n \\n\\n Richardson went to the barn and brought in the chain and the staple. \\n\\n \\n\\n \"Well,\" said his visitor, after examining the work with great interest, \"if you can mend my chain as well as that, I\u0027ll never carry another one to Drew, and I\u0027ll pay you in cash just what I should have to pay him, and be greatly obliged, besides.\" \\n\\n \\n\\n \"That\u0027s just what I\u0027ve been telling husband,\" said his wife; \"if he would give his mind to it, get a few tools, and begin in a small way, at first, it would give him work in stormy weather, and times when he couldn\u0027t do anything else, be a great accommodation to the neighbors, help the place, and be a good thing all around.\" \\n\\n \\n\\n \"That\u0027s it, Mr. Richardson. Your wife\u0027s got the right of it, neighbor. The place is settling, people moving in, and taking up land, stumps rotting, and ground getting fit to plough; and work will grow as fast as you can grow to be able to do it.\" \\n\\n \\n\\n \"I\u0027ll mend your chain, neighbor, in the best fashion I can; but I have to work in such a roundabout way, that I must have my time. Have you got the broken link?\" \\n\\n \\n\\n \"No; it flew into the snow, and I couldn\u0027t find it.\" \\n\\n \\n\\n \"Then I shall have to cut one of the links, put the next link in, and weld it.\" \\n\\n \\n\\n [Pg 26] \\n\\n \\n\\n \"I hate to have that done, because it will shorten the chain; and it\u0027s barely long enough to bind a load of logs and \u0027fid\u0027 now.\" \\n\\n \\n\\n \"Haven\u0027t you any links lying round?\" \\n\\n \\n\\n \"Not I, indeed. Iron is as scarce as money with me, as with all the neighbors. Every link of a chain, piece of a horse or ox shoe, old spike, and every scrap of iron, is worked up. There is one thing, though, I remember now, though I don\u0027t know as it\u0027s of any use to you.\" \\n\\n \\n\\n \"What is that?\" \\n\\n \\n\\n \"I got Drew to make me a plough-colter, more than a year ago, and found the iron. There was a piece left, a bar about a foot long.\" \\n\\n \\n\\n \"If I could heat it, and contrive any way to cut it, I could make a link of it.\" \\n\\n \\n\\n \"I will leave the chain, and send Andrew over with the bar, and if you find that you can\u0027t do anything with the bar, why, cut a link and make the chain shorter, for I am determined you shall mend that chain.\" \\n\\n \\n\\n Mr. Montague and his wife now took their leave, and in the course of an hour Andrew Montague brought over the bar of iron. \\n\\n \\n\\n It was the wife\u0027s turn to be discouraged now. \\n\\n \\n\\n \"William,\" she said, \"you never can cut that great bar of iron. Why, it\u0027s almost as thick as my press-board, and you haven\u0027t one single tool to do it with. I\u0027m sorry, but you will certainly have to shorten the chain.\" \\n\\n \\n\\n [Pg 27] \\n\\n \\n\\n \"No, I won\u0027t shorten the chain, and I\u0027ll find some way to split it and forge a link out of it, if it takes from now till\u0027 next spring: that is, if you\u0027ll help me. Montague hates to have the chain shortened. It\u0027s the first job of work, and I\u0027ll do it as he wants it.\" \\n\\n \\n\\n \"I\u0027ll do anything I can; anything in the world, to get bread for the children.\" \\n\\n \\n\\n \"I\u0027ll help you, father; I\u0027m real strong,\" said Clem, a boy of twelve, afterwards the father of Radcliffe Rich. \\n\\n \\n\\n \"And I, too,\" said Robert, who was eighteen months younger. Two girls, still younger, would have doubtless volunteered, but they were abed, and not much could reasonably be expected of the baby in the cradle. \\n\\n \\n\\n William Richardson, in addition to his mechanical ability, was a resolute, powerful man. The encouragement afforded by the visit of Montague, and the prospect of abundance of work, if he could do it, had effectually roused all his energies. His wife, by no means ignorant of her husband\u0027s capacities, dismissed her anxieties, for she knew that he would find some way to accomplish whatever he had determined to do. \\n\\n \\n\\n After sitting a few moments buried in thought, he took a brand from the fire, and his axe, and, followed by Clem, started for the woods, where he soon found a hornbeam tree, the wood of which is very firm and heavy. The boy held the brand[Pg 28] while he cut it down, and took off a cut three feet in length. With axe, saw, and auger, by the light of the kitchen fire, he soon made a beetle, that, during the time it lasted,—for he had no iron to hoop it with,—would enable him to strike a harder blow than even a blacksmith\u0027s sledge, for it was much heavier, indeed, too heavy for constant use; but a very strong man could swing it for a while, and upon an emergency. He then went down to a brook about an eighth of a mile from the house, for an old axe, kept to save a better one, and to cut ice, in order that the cattle might drink. The axe, by frequent grinding, had become very thick on the edge, and the bitt was rounded. \\n\\n \\n\\n The next morning Richardson started the fire on his forge with plenty of coal, and put in the bar, while Clem and Rob plied the kitchen bellows by turns, the two little girls looking on with the greatest interest. \\n\\n \\n\\n To cut iron, less heat is required than to weld it. \\n\\n \\n\\n \"Clem,\" said Richardson, \"call your mother.\" \\n\\n \\n\\n The boy returning, said,— \\n\\n \\n\\n \"Mother says one of the girls must come in to watch the cradle.\" \\n\\n \\n\\n It was now, \"Nan, you go,\" and \"Sue, you go,\" when the indulgent father, who knew just how the children felt, compromised the matter by bringing the cradle, with the baby sound asleep in[Pg 29] it, and setting the sleeper as far as possible from the forge, in order that the noise of the blows might not awaken him. \\n\\n \\n\\n Richardson, now taking the iron from the fire with the kitchen tongs, placed it on the anvil, and gave it in charge to the boys to hold. He then put the axe-edge down on the iron where he wished to split it, and told his wife how to hold it; then with the beetle he struck heavy blows upon the axe, forcing it into the iron at every stroke, while his wife, after every blow, drew the axe to a new place. The old axe, of excellent temper, and thick edge, that would neither turn nor break, being dipped in water when it became heated, answered the purpose of a chisel admirably, and the beetle was superb. Indeed, they would have nearly finished that heat, but the baby waked, screaming, and would not be pacified without his mother. Richardson clapped the iron in the fire, one of the children got a chair, and the mother sitting down, nursed the babe while the iron was heating. After this it became quiet, and the little girls took care of it, while the others cut the iron so nearly through that by bending it back and forth a few times, it fell apart. \\n\\n \\n\\n He now found that the strip he had cut off was sufficient to make two links by drawing it some. He therefore made two. But it was a deal of work to heat the iron hot enough to weld, because the hand-bellows were single, and only operated[Pg 30] by short puffs, the iron cooling in the intervals, whereas a blacksmith\u0027s bellows, being double, one part fills while the other is discharging, thus keeping up a steady current of air. \\n\\n \\n\\n Montague was much pleased when he found that his chain, instead of being made shorter, was lengthened, and now sufficient for all purposes, paid Richardson liberally, and brought another chain that was too short, and had the remainder of his iron put into that. \\n\\n \\n\\n \"There, wife,\" said Richardson, as he placed the money his neighbor had paid him on the table, \"is the first money earned by the hammer. You were just right when you said that mending that staple was the best day\u0027s work I ever did, and I\u0027m sure I never earned any money so sweet as this.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1805/52440.html","bookId":1049,"book":{"id":1049,"title":"The Turning of the Tide","description":"简介： A distinguished professor of Mathematics in a New England college was wont to remark to the Freshman class when meeting them for the first time at recitation, that every person is as lazy as he can be. However we may demur to this sweeping assertion,...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1805","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
