{"id":105189,"no":15,"title":"Page 15","content":"His eyes opened. He stared at me.\n “What is this? Who are you?”\n I told him again.\n “How did you get here? The guards…”\n “They are all unconscious. Hurry – we don’t have much time.”\n “I am a sick man. How can I hurry?”\n The silly old wreck didn’t even want to be rescued. “We must hurry. I will help you, Mr. Kotacek.”\n He got to his feet, swayed, caught his balance. He looked down and saw the crumpled guard for the first time. “You did this?”\n “Yes.”\n “Ah.” He smiled, and I reached for his arm to guide him out of the cell, and something happened to his eyes. They got a hard empty stare in them, and his mouth dropped open, and his hand started for his chest and stopped halfway there, and while I stood gaping at him, he made an odd sound deep in his throat and pitched forward onto his face.\n I rolled him over. I put my ear to his mouth. He was not breathing. I listened to his heart. No heartbeat. I felt for his pulse. He had no pulse.\n “Oh, wonderful,” I said aloud. “Tremendous.”\n After all that work, the ungrateful son of a bitch had dropped dead.\n Chapter 10\n Obviously I should have gone back to New York.\n I knelt by the motionless form of Janos Kotacek and tried to figure out what to do next. I couldn’t lug him down all those damned stairs. I couldn’t go down without my Stern Gang comrades suspecting I was trying to pull a fast one on them. I could wish that I was back in New York, but wishing would not make it so. What was I supposed to do for an encore?\n I looked down at the corpse of Kotacek, poked it with a foot. “You,” I said, “are causing me nothing but trouble.”\n Whereupon the corpse opened its eyes.\n “Go ahead,” I said, dazed. “Nothing you can do will surprise me now. Get up on your feet, walk, talk. You’re a zombie. I’m Baron Samedi. You must do as I say…”\n He sat up, then struggled to his feet. “Where are we?”\n “In Prague. In jail.”\n “Who are you?”\n “Baron Samedi. Evan Tanner. Kilroy. I don’t know.”\n “What has happened?”\n “You died,” I said reasonably. “And then I touched you with my magic foot, and, like Lazarus, you – oh. I see. I get it.”\n “I have these fits. Seizures.”\n “I’ll just bet you do,” I said. I understood it now. It was one of his several illnesses, his catalepsy, and I suppose I should have recognized it right away, but it had not worked that way. When someone has a very obvious coronary right before your eyes, and when he lies there bereft of pulse and breath and heartbeat, you don’t review his medical history. You simply decide that he’s dead and blow taps or recite the Kaddish or whatever.\n But he was not dead. He had had a cataleptic seizure. A short one, fortunately. From what I knew about catalepsy, the fits could last for a few seconds or a few days or anywhere in between. I wondered how often he had these little things. Not too often, I hoped. I could just see myself, dragging him all over Eastern Europe, with him going limp and flaking out every little once in a while.\n A shock could bring on a fit. So could a light flashing at the right frequency, or the right succession of musical notes monotonously repeated, or a sudden extreme change in body temperature. In this case, it seemed likely that the shock of my sudden appearance had done it. Whatever the cause, he had gone into a seizure and had now come out of it, and none too soon. He was alive, and now we had to get out of the castle.\n I said, “Heil Hitler.”\n “Heil Hitler. Who-”\n “Do you remember what I told you before?”\n “No.”\n “My name is Tanner, Evan Tanner. I’m a Slovak Nationalist and an agent of the Fourth Reich, and I’ve come to rescue you. Do you understand that much?”\n “I am not a fool.”\n “Good. The guards are unconscious downstairs. We have very little time. You must trust me and come with me, and I will get you back to Lisbon.”\n “How do I know I can trust you?”\n “I thought you said you were not a fool.”\n “You could be trying to trap me, and then I will be shot trying to escape.”\n “Do you want to stay here?”\n “No,” he said gloomily. “I will come with you.”\n The guard on the floor was stirring. I gave him another love tap behind the ear and he went back to sleep. Kotacek followed me out of his little cell. I closed the iron door, locked it, and pocketed the key. I led him down the stairs. He came very slowly and clumsily, and I kept pausing and looking back to make sure he was still there. A turn or two from the bottom I coughed a warning to Zvi, and heard bodies falling in response. When we reached the foot of the stairs Zvi was crumpled up in a lifeless heap.\n “He is dead?”\n “Only sleeping.”\n “You should have killed him,” Kotacek said. “The only good Czech is a dead one. Give me your pistol. I will kill him for you.”\n “We have no time.”\n “A pity.”\n The doors were closed. I opened them, and Kotacek walked through ahead of me, pausing to glance at Gershon on the left and Haim on the right. “Two more of the swine,” he said. “You can always identify a Czech at a glance. See the characteristic shape of the skull? The cheekbones? Hah. Some day we shall put a plastic bubble over all of Western Bohemia and then we shall turn on the gas. Hah! Too much trouble to load them onto trucks. Too much trouble!”\n He was a charmer.\n We walked down the path toward the front gate. Gershon and Haim lay in their places, and Ari…\n Where was Ari?\n He should have been at his post at the front gate. I looked to either side of the path and couldn’t find him.\n “Wait right here,” I said.\n “Is something wrong?”\n “I have to check something.”\n “Are we safe?”\n “Sure. Just wait here.”\n I left him at the gate and raced back to the steps. I bent down beside Gershon. In Hebrew I asked him what the hell happened to Ari.\n “He went with the girl.”\n “With Greta? Why?”\n “Why do you think?”\n I sprinted back to Kotacek. If the damned girl had dragged Ari along because she couldn’t keep her legs together for another half-hour, I would throttle her. She was supposed to have a taxi waiting at the curb. We had about five minutes on the Israelis – I knew they’d change their clothes and come after us the minute we were out of sight. She was supposed to be there, ready and waiting with a car. Instead she had Ari along for company.\n I hurried Kotacek along. We passed through the gate and I let it swing behind us. He asked where I was taking him. To safety, I said. I was a hero, he told me. I would be rewarded. Perhaps he would make me his personal aide, and I could assist him with his correspondence. Would I like that? I told him nothing would please me more, and suggested he walk a little faster.\n “I am walking as fast as I can.”\n “All right.”\n “You should show more respect to your superiors, Tanner. That is your name? Tanner?”\n “Yes.”\n “What is your rank?”\n “Pardon me?”\n “Your rank. Private, corporal, sergeant-”\n “Oh. Captain.”\n “Get us out of here safely and you will be a major. I solemnly guarantee it.”\n He was impossible. I wanted to tell him to cut the talk and save his energies for walking, but I didn’t even bother to try. We crossed the street and headed for the house. Already they were behind us. Gershon and Haim and Zvi, back in their civilian clothes again, and coming through the gate on our trail.\n In front of the house, just ahead of us, was a Russian-made sedan with the motor running.\n I couldn’t believe it. How had she done it? What had she done with Ari? Where had she found the car? It didn’t matter. We just had time. They were on the other side of the street. We could duck into the car and be gone before they knew what was happening…\n Oh.\n Greta was on the passenger’s side. And seated next to her, behind the wheel, was Ari.\n He rolled the window down. “Here’s the car,” he said. “I came back with Greta and she told me you wanted a taxi, but I got us a private car instead.”\n “Oh,” I said.\n “Ari is very clever,” Greta said. “He knows how to start a car without a key. He used the tiniest piece of wire.” I couldn’t help it, her eyes added. He just came along, and what could I do?\n And Ari said, “Why did you want the car, Evan?”\n I looked over my shoulder. Gershon and Zvi and Haim were crossing the street, their faces aglow with comradely smiles. “For later on,” I said, weakly, “when we all make our getaway.”\n “So we get the car ahead of time?” He nodded approval. “You are a good planner, Evan. Excellent.”\n Zvi did not want to hold a trial. I think he was still upset because we had not permitted him to kill the Czech guards. “What is the point of it?” he demanded. “We all know he is guilty. We all know we are going to hang him. Why have a trial?”\n “Because it is a necessary procedure. We are not barbarians.”\n “Did his kind ever hold trials?”\n “Would you place yourself in his class?”\n “It is not the same thing.”\n “My dear Zvi, it is precisely the same thing.”\n “Bah.” Zvi turned his back on Gershon, who had been upholding the principle of law and order. “You can see the folly of it, can’t you?” he asked me. “Among other things, the butcher does not speak Hebrew. What does he speak? Slovak?”\n A few other languages as well, I thought, but Zvi had given me an idea. “Only Slovak,” I told him.\n “So! How can we have a trial?”\n “Evan speaks Slovak,” Haim said.\n “Do you?”\n “Yes.”\n “Then we might as well have this farce of a trial. You will interrogate him, do you understand? We will give the questions, and you will repeat them to him and translate his answers for us. Is that all right with you, Evan? It should not take long.”\n “I’m willing.”\n “And then,” Zvi said, “we take the rope and stretch his neck.”\n “Providing he is found guilty.”\n “You are joking, Haim.”\n “Well…”\n We were in the basement. Kotacek, wholly incapable of understanding what was going on around him, sat in the same chair in which I had regained consciousness a night ago. Greta was near the door motioning to me. I went to see what she wanted.\n “I couldn’t help it,” she said. “He insisted on coming with me.”\n “I know.”\n “I couldn’t get rid of him. I told him he should stay at his post, but he wanted to come with me. Do you want to change your clothes? I brought your clothes.”\n “I’ll change later.”\n “You look very pretty in your uniform. At least we got the car, but it is no good now, is it? I am sorry. He wanted to make love to me; that is why he came with me. The one time in my life I had something better to do, and he wanted to make love to me!” \n","sourceLink":"https://allnovel.net/the-canceled-czech-evan-tanner-2/page-15.html","bookId":1531,"book":{"id":1531,"title":"The Canceled Czech (Evan Tanner #2)","description":"Storyline: \n The Canceled Czech (Evan Tanner #2) \n The second adventure of Evan Michael Tanner -- back in print!\"The Canceled Czech\" finds the sleepless adventurer on a mission to Czechoslovakia to liberate a dying man, who turns out to be a Nazi. For his troubles, he finds himself leaping from a moving train, tangling with an amorous blonde, and playing the role of a neo-Nazi propagandist. Just another typical work day in the life of \"the thief who couldn\u0027t sleep\".\n \n","cover":"https://allnovel.net/images/the-canceled-czech-evan-tanner-2.jpg","author":"Lawrence Block","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-canceled-czech-evan-tanner-2.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:43:21 PM"}}
