{"id":70236,"no":16,"title":"Page 16","content":"\"I do care. Too damn much. If things were different—\"\n A siren wailed from the basement, indicating the perimeter had been breached. The Swarm was here.\n Adrenaline flooded David\u0027s body and he pushed away all thoughts but protecting Noelle. She\u0027d gone stiff with fear and stared at him with wide, trusting eyes.\n \"You\u0027ve still got the keys?\" he asked.\n She nodded.\n \"Good. When I tell you, I want you to run for the Bronco and haul ass out of here. Head north and call Monroe as soon as you can.\"\n David slid the satellite phone into her front pocket rather than trusting her shaking hands not to drop it. He pulled out his weapon and flicked off the safety. \"I\u0027ll give you covering fire and call you on that phone as soon as I\u0027m safely out of here, okay?\"\n She hesitated for a moment, but finally nodded. David took her by the hand and led her to the back door, pushing her body to where she\u0027d be safest.\n \"Everything you need is in the car,\" he said. \"Weapons, ammo, maps, fuel. The tank is full. Don\u0027t stop unless you have to or Monroe tells you to. You\u0027ll be fine as long as you keep moving.\"\n It was still dark inside the house, so he cracked open the back door. The perimeter was set about a quarter mile away from the house, so they didn\u0027t have much time before the Swarm got there.\n \"Go,\" he ordered, giving her a little push to get her moving.\n \"Come with me. Please,\" she begged.\n \"I can\u0027t, I\u0027ll catch up with you soon. Now go!\"\n Noelle obeyed, moving with stiff, fearful steps. She unlocked the truck, slid inside and with one last look at David, started the engine and drove away.\n David closed the door and prepared for battle.\n Noelle kept the lights off as she steered the Bronco down the gravel driveway. In the rearview mirror, she could see dark shapes moving in the trees. Toward David.\n There were too many of them. He\u0027d never be able to fight them all off, no matter how good he was. It took only one lucky shot to kill a man.\n Behind her, gunshots blasted away the silence.\n Noelle hit the brakes and skidded to a halt. She couldn\u0027t do this. She couldn\u0027t leave him behind to die.\n With a harsh wrenching of the steering wheel, Noelle spun the Bronco around and sped back toward David.\n Half a dozen armed men pointed weapons at the back door of the house. They were hard to see in the dark, hit Noelle had spent the past several hours in near darkness and her eyes were well adjusted. As she watched, they fired at David\u0027s location and he must have been firing back because one of them crumpled to the ground.\n The others moved in carefully, taking turns firing so that David had to stay hidden or risk getting hit.\n No way was Noelle going to let them sneak up on him like that. David had done so much for her and she wasn\u0027t about to repay him by running away and leaving him to die, no matter how much he claimed that was what he wanted.\n To hell with the ciphertext. His life was just as important as hers.\n Dark shapes closed in on the house, creeping slowly, staying low to the ground. It was easy to forget they were men and see them as the monsters they were—monsters who wanted her and David both dead.\n The rational part of her mind told her that killing was wrong, but the emotional part of her screamed for her to help David no matter what it took. If she didn\u0027t do something, he wasn\u0027t going to make it out of that house alive.\n Before she could overthink the situation, Noelle gunned the Bronco\u0027s engine, and veered off the gravel, heading straight toward the closest enemy. He had his back to her, and with the headlights out and guns barking all around, he didn\u0027t notice her coming. The Bronco hit the man head-on with a sickening thud, tossing his body into the weeds like a rag doll.\n Two other men turned and fired at the bulletproof Bronco. One of the headlights shattered and a spiderweb of cracks appeared in the side window, but it stayed in place.\n The speeding vehicle was enough of a diversion that David managed to take out another three men in the time it took for the Swarm to figure out what was going on.\n One by one, David took out the enemy until dead bodies littered the moonlit landscape.\n Noelle clenched her teeth against the need to vomit. She\u0027d never done anything violent in her life, and she was afraid that if she stopped to think about what she\u0027d just done—about what she\u0027d just seen—she\u0027d completely lose it.\n She promised herself that later, she\u0027d let herself be as hysterical as she wanted, but right now was not the time.\n David still needed her.\n The remaining gunman saw what had happened to his buddies and sprinted for the trees. Before he was able to slip behind cover, his body jerked and blood sprayed out like a geyser from the back of his head. He fell, twitched once, and didn\u0027t move again.\n Noelle drove the car right up to the back door of the house and flung the driver\u0027s door open wide for David. He came out, not looking at her, but at their surroundings, searching the area for more bad guys.\n \"You drive,\" he said, and his tone was so flat and empty that she knew he was pissed at her for coming back.\n She didn\u0027t care. She\u0027d made the right choice and he could be as mad at her as he liked so long as he got in the damn car.\n As soon as he got in, she turned the Bronco around and headed back down the lane.\n \"Stop here,\" he ordered.\n Noelle did and watched as David got out and went to the man she\u0027d run over.\n Noelle swallowed hard, pretending that this was all just a bad dream. She never really killed anyone and in a few seconds, she\u0027d wake up, wash her face and clear away all the blood and death from her dreams.\n David approached the downed man carefully, keeping his gun aimed at his head. When he was close enough, he kicked the man\u0027s weapon away and bent down for a moment. She didn\u0027t know if he was checking for a pulse or maybe pulling off his mask to get a look at his face, but when he stood back up, he fired three rounds into the man\u0027s skull.\n Noelle jerked three times, letting out a series of frightened yelps.\n She couldn\u0027t fool herself any longer. This was more man just a dream. These men were all dead and she\u0027d helped them get that way. She\u0027d killed.\n Frantically, she clawed open the door and vomited onto the ground.\n By the time she was done, David was already back in the car and handing her a bottle of water. She took it with shaking hands.\n Noelle rinsed the taste of acid from her mouth and trampled down every single thought that passed through her head. She could not deal with any of this right now without getting sick again, and they needed to get out of here. So, rather than dwelling on the horror surrounding her, she focused on driving. Just driving.\n Owen\u0027s nose twitched against the stench of burning coffee. He turned the burner off and doused the pot under a stream of running water.\n All around the little house were signs that his prey had been here. Empty bowls sat in the sink, a rumpled blanket was still on the couch. The back door of the house had been left wide open, making it easy for him to get inside without even using the code his contact had given him.\n In the basement, he found the recordings of what had happened here less than an hour earlier, captured by the security cameras installed around the property. He watched, amused by the brave little display put on by Dr. Blanche.\n She was a more formidable woman than he could have hoped for. Lovely.\n But it wasn\u0027t the woman who had surprised him the most. That honor belonged to Captain David Wolfe, who after two long years had suddenly reappeared out of nowhere. That\u0027s why he\u0027d seemed so familiar earlier. They\u0027d known each other for a long time. Even shared a woman once. That kind of connection could not be easily forgotten.\n At the memory, the skin on the man\u0027s face stretched in a smile, making the scars on his cheek pull tight. If there was one man on the face of the planet worthy of his undivided attention, it was Captain Wolfe, and here he was, protecting Dr. Blanche.\n Two birds with one stone.\n God was truly smiling on Owen.\n David spent as much time watching Noelle as he did watching their back trail. She\u0027d shut down completely, following his directions automatically without saying a word. If she\u0027d been crying and hysterical, he would have felt better, but her silence worried him. It was a sign she was close to breaking.\n He still couldn\u0027t believe she\u0027d come back for him. Couldn\u0027t believe she\u0027d run over a man to protect him. He knew how she felt about violence, but yet she\u0027d had the courage to put that ideal aside and risk her own life to save him. Of course, that courage could have gotten her killed and he couldn\u0027t let that happen again. Her life was too important.\n And he\u0027d nearly let her throw it away. For him.\n Maybe Monroe was wrong and David wasn\u0027t the right man for the job. Maybe his two years away had made him slow, soft. Maybe his grief over Mary\u0027s death had made him weak. What if his best wasn\u0027t good enough and the Swarm killed Noelle, or worse yet, abducted her? He\u0027d never be able to survive under the weight of that guilt. Never.\n For the space of ten seconds, David thought about calling it quits. Let someone else protect Noelle—someone who was better than he. Stronger. Faster. Smarter. There were a dozen men like that in Delta.\n But if he quit, he\u0027d never be sure that the Swarm was taken out. There would still be a chance that they were out there, hurting people. Killing innocents. David couldn\u0027t walk away from that. He owed Mary\u0027s memory more than cowardice, and that\u0027s exactly what it would be if he walked away from Noelle. He wasn\u0027t afraid of dying, but he was terrified of failing. This op was his only chance to take out the group that had killed his Mary, and he could not pass it by.\n Which meant he had to take care of Noelle. Keep her safe and make sure she never again risked her life for his.\n David told her to pull into a deserted rest stop, which she did without question. When the Bronco came to a halt, she just sat there, waiting for the next set of directions.\n He reached over and slid the gearshift into park, then debated what to do next.\n He wanted to scream at her for disobeying his orders. He wanted to thank her for saving him. But most of all, he just wanted to hold her. The urge was too strong to resist any longer, so he stopped trying.\n David unfastened her seat belt and pulled her unresisting body into his lap. His wide hands stroked up and down her arms, trying to calm her.\n She sat still, a frozen lead statue in his lap, not moving or talking. She\u0027d been traumatized and he was pretty sure he knew why.\n She\u0027d been willing to die to prevent her work from being used as a weapon, but tonight, she\u0027d experienced firsthand what it was like to be forced to do violence. He doubted that anything in that brilliant mind of hers was equipped to handle it.\n \"Noelle, you didn\u0027t kill him,\" David said in a quiet voice.\n Noelle jumped, her whole body going rigid. \"Yes. 1 did.\"\n \"No. He was just stunned. Bruised, maybe a couple of broken bones, but he would have lived.\"\n \"I meant to kill him, which is worse than if I\u0027d done it by accident. The sick part is that if I had to do it all again. I\u0027d do the exact same thing. I\u0027d kill that bastard before he could kill you. So much for all those years of listening to my parents tell me how important it was that my work never be used to harm others.\"\n He cupped her chin and turned her head so that she was looking at him. He needed her to see the truth, so he waited until she was looking into his eyes. \"You didn\u0027t kill him. I did. His death is my responsibility. His blood is on my hands.\" \n","sourceLink":"https://allnovel.net/no-regrets-delta-force-1/page-16.html","bookId":2374,"book":{"id":2374,"title":"No Regrets (Delta Force #1)","description":"Storyline: \n No Regrets (Delta Force #1) \n Renowned cryptologist Noelle Blanche refuses to have blood on her hands. So when the military asks for her help in a covert operation, she refuses--until masked gunmen raid her home and threaten her life. Suddenly it\u0027s all too clear that any blood spilled may be her own. Noelle has no choice but to trust the dangerous stranger sent by the military to safeguard her. A stranger who is everything she detests, everything she fears...and everything she desires. \n Former Delta Force operative David Wolfe thought he had left it all behind--the horror, the hurt, the guilt. But now the men who savagely murdered his wife have set their sights on a brilliant cryptologist who can lead them to the cache of weapons they prize. As passion ignites between David and the woman he\u0027s sworn to protect, what began as just a mission escalates into the fight of his life. But can he prevent history from repeating itself?\n \n","cover":"https://allnovel.net/images/no-regrets-delta-force-1.jpg","author":"Shannon K. Butcher","type":"Mystery","source":"allnovel","link":"https://allnovel.net/no-regrets-delta-force-1.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:15:32 AM"}}
