{"id":70239,"no":19,"title":"Page 19","content":"She deserved better than him—more than what he could offer her. And she was vulnerable right now. Taking advantage of that would be unforgivable. He\u0027d done enough unforgivable things in his life that he didn\u0027t need to add to the stack.\\n\\n The cabin had cooled considerably, and even inside his sleeping bag, he was barely warm enough.\\n\\n He\u0027d positioned the sleeping bags as far apart as the walls would allow in the little space, putting the top of one toward the foot of the other. It was as lacking in intimacy as possible, given the circumstances, but it wasn\u0027t nearly lacking enough that David didn\u0027t think about how nice it would be just to zip the two bags together and slide inside with Noelle. Naked.\\n\\n David gritted his teeth until the ache in his jaw pushed away his unwelcome thoughts.\\n\\n He glanced over at Noelle\u0027s sleeping bag to see if she seemed warm enough.\\n\\n Not only was she not there, sleeping, but her bag was untouched. She was still sitting where he\u0027d left her at the tiny table. She had a pencil in her hand, and was scribbling furiously in a notebook he\u0027d bought for her when they stopped at a megadiscount store for some spare clothing and cleaning supplies.\\n\\n The light from the lantern cast a yellow glow over her features, setting her hair aflame with warm color. Even though her eyes were shadowed with fatigue and a frown of concentration shaped her brow, she was still beautiful in firelight.\\n\\n He wondered what she\u0027d look like stretched out naked beneath him with firelight flickering over her body.\\n\\n Instantly, he was aroused again, thick and hard and ready to put into action his inappropriate thoughts.\\n\\n David cursed silently, hating that he was at the mercy of his libido whenever he looked at Noelle. It was ridiculous that he couldn\u0027t control himself long enough to do his job. But even more, it was humiliating that he was beginning not to care about proprieties and protocol.\\n\\n He focused on breathing, like he had for his marksmanship trials, until he was able to stand without scandalizing Noelle. Or tearing his jeans.\\n\\n Not that she\u0027d notice if he\u0027d walked over there stark naked. The woman was nothing if not laser-focused on her work.\\n\\n He walked quietly over to the potbellied stove, added more logs to the dying embers and put an ancient percolator on for coffee. He wouldn\u0027t be sleeping anymore tonight.\\n\\n Noelle finally looked up and smiled at him. \"Hi.\"\\n\\n The sweet, inviting curve of her mouth was like a punch in the gut. It had been so long since he\u0027d had a woman greet him in the morning with a soft smile and a friendly word. Such a simple thing and yet her open welcome was so... tempting. It made him think of late mornings after long nights spent making love. It made him think of breakfast in bed that never got eaten because other, more carnal hungers took over. It made him think of the simple pleasure of having a home and a woman who loved him to wake up to every morning.\\n\\n It made him wonder if Noelle longed for those simple things as much as he did.\\n\\n \"Do you know what time it is?\" he asked, his voice deep and rough with sleep and longing.\\n\\n \"Not really. Did I wake you?\"\\n\\n \"No.\" She hadn\u0027t made a sound beyond that of pencil scratching over paper. If she had, he\u0027d have woken, no matter how tired he\u0027d been, probably with a weapon in his hand.\\n\\n David eyed the plate of wilted lettuce and the majority of her sandwich sitting next to her. \"You didn\u0027t eat.\"\\n\\n \"I will in a minute,\" she said, waving her pencil.\\n\\n Frustration rose up like a tidal wave in David\u0027s chest. He was sure it was only partly due to her negligent care of herself The rest was pure lust, as raw and gritty as it got.\\n\\n David grabbed the pencil and the notebook, and the paper away from her, ignoring the irritated expression of impatience on her face. \"Hey! I was using those!\"\\n\\n He slammed her papers down on the butcher block counter and shoved the plate of food back in front of her.\\n\\n \"You\u0027re done working tonight. You\u0027re going to eat, then sleep, and when you wake up, I\u0027ll give your stuff back.\"\\n\\n Her delicate chin thrust up in the air. \"You can\u0027t tell me what to do.\"\\n\\n \"The hell I can\u0027t. I\u0027m the one with the gun, remember?\" He picked up the sandwich and placed it to her mouth.\\n\\n \"Eat.\"\\n\\n Noelle rolled her eyes and took a bite. \"Fine,\" she said ; around a mouthful of dried-out bread. \"But when I\u0027m done eating, I\u0027m going back to work. People\u0027s lives are at stake, I\u0027ll sleep later.\"\\n\\n David crossed his arms over his chest and straightened to his full height, giving her his best do-it-or-I\u0027ll-make-you stare. \"The last thing we need is for you to get delayed because you\u0027re too sick to finish the job. Don\u0027t be stupid about this.\" As it was, he wasn\u0027t sure he was going to live through resisting his lust for her so much as another day. Delays were entirely out of the question.\\n\\n She scowled at him. Of course, the whole effect was ruined by the dark circles and drooping shoulders. Whether she admitted it or not, she was tired.\\n\\n \"Can I at least wash up first?\" she demanded. \"I haven\u0027t showered since Friday night.\" She paused, frowning. \"What day is it anyway?\"\\n\\n Lord save him from distracted academics. \"Monday, just barely.\"\\n\\n Her eyes opened wide and she jumped from her stool. \"Oh, no! You have to get me to a phone so I can call in to work. Joan will be worried sick if I\u0027m not there.\"\\n\\n \"I\u0027m sorry, but she\u0027s just going to have to worry, then. We won\u0027t be making any calls.\"\\n\\n \"But I have to.\" She clutched his arm, those slim fingers curling around his biceps.\\n\\n David suppressed a shudder of sheer male victory. She\u0027d touched him again and it felt even better this time than it had before. He was quickly becoming addicted.\\n\\n His body\u0027s response was as irritating as it was predictable. He had to get over his jones for this girl and fast.\\n\\n \"Listen, if you call Joan, you could be putting her in danger. I\u0027m sure the Swarm had you under surveillance before the attack. It\u0027s likely that they know who your friends and family are and have put phone taps on anyone they think you might contact. It\u0027s even possible they could somehow trace the call back to us as well. And if not, then they might try to get the information out of Joan through ... unpleasant means.\"\\n\\n \"But I wouldn\u0027t tell her where we are.\" Her voice was frantic, pleading.\\n\\n David steeled himself against the urge to soothe her. She didn\u0027t need soothing. She needed the truth so she wouldn\u0027t do anything dangerous. \"It wouldn\u0027t matter if she knew or not. They\u0027d still hurt her. I know you don\u0027t want that.\"\\n\\n Her hands went limp and fell away from him. His arm burned in fury at the loss of her touch. David clenched his teeth and held his ground.\\n\\n She nodded, bowing her head, but not before David saw a single tear glitter behind her glasses.\\n\\n It was his undoing. He ordered his dick to shut the hell up and pulled her into his arms. She was stiff and cold, but she didn\u0027t pull away. Finally, her arms snaked over his shoulders and she buried her face against his throat.\\n\\n \"I hate this,\" she whispered. Her warm breath flooded over his skin, making him shiver.\\n\\n He was on the razor edge of offering comfort and taking more, but he held his balance. \"I know. But it will all be over soon.\" He prayed it wasn\u0027t too much of a lie.\\n\\n She looked up at him, her eyes bright with tears, her nose pink. \"And then what? I know I can\u0027t go back to my old life. As you pointed out, this will only happen again the next time someone finds a bit of ciphertext like this one. All I know how to do is what I\u0027ve learned in school, which is entirely unique, and any job I could get would be like a red flag, even if I changed my name and identity.\" She pulled in a resigned breath, which pressed her small breasts against David\u0027s ribs in a delightful, distracting caress. \"I\u0027ll never again get to work in academics, will I?\"\\n\\n He wasn\u0027t going to start lying to her now, but he did try to soften the blow with a quiet, understanding tone. \"If you want to continue doing the same work you have been doing, the only safe option you\u0027ll have is to work for the government, probably in a secure facility under their protection.\"\\n\\n \"I can\u0027t do that. After this one job, I\u0027m never going to work for them again.\"\\n\\n \"The military isn\u0027t all that bad, Noelle.\"\\n\\n Noelle shook her head, making the tangled curls sway over the back of David\u0027s hands. He had to grip her waist hard to keep from grabbing those curls and plundering her mouth, but her soft curves gave way to his fingers, making his resistance a new kind of hell. \"It may be a necessary evil, but I have to stand by my conscience, f have a responsibility to ensure that no harm comes from the things I create, and I just don\u0027t trust the military to share that responsibility with me.\"\\n\\n It stung that she shunned everything that David had spent his life doing. She wasn\u0027t the only one who shared the opinion that the military was evil, but public opinion had never really bothered David before. He\u0027d done what he thought was right. End of story.\\n\\n Even when it meant walking away from everything he\u0027d worked for because he knew he was no longer going to be able to lead his team safely. His emotions made him a liability.\\n\\n His voice was a little more curt than he intended. \"That group you don\u0027t trust is going to a hell of a lot of trouble to keep you alive.\"\\n\\n She pulled away and stared up at him. \"Only because I have something they want. Monroe was willing to have me executed if I didn\u0027t cooperate. That isn\u0027t exactly a friendly organization.\"\\n\\n \"We\u0027re not designed to be friendly. We\u0027re designed to get the job done, no matter how unpleasant it may be.\"\\n\\n \"I\u0027ll do this one job, but after that, I\u0027m done. If I did anything else, I wouldn\u0027t be able to sleep at night.\"\\n\\n David grunted. \"And I can\u0027t sleep at night knowing there was something more I could be doing to help protect the lives of innocents.\"\\n\\n \"As long as you get to choose whose lives get protected and whose don\u0027t.\"\\n\\n David felt his lip lift in a near snarl. \"I didn\u0027t choose for my wife to die. The Swarm did that. Don\u0027t stand there and act all sanctimonious when you don\u0027t know what the hell you\u0027re talking about.\"\\n\\n A wave of guilt spread over her features. \"I\u0027m sorry, David. I can\u0027t imagine what it must be like for you to lose the woman you love.\"\\n\\n David\u0027s eyes slid shut and he willed himself to hold his emotions under tight rein. He couldn\u0027t afford to lose it right now, no matter how much he grieved for his Mary. \"I know you\u0027re not happy about this situation, but I need you to cooperate and get this code broken as fast as you can. Whether or not you agree with the military\u0027s strategies for dealing with the bad things out there, you \u0027re part of that strategy now.\"\\n\\n \"I know, and I will do the best I know how, just don\u0027t expect this one job to become the beginning of anything more. After this is done, I\u0027m walking away. I won\u0027t ever work for you guys again.\"\\n\\n \"Don\u0027t make any decisions about that now. You\u0027ll have plenty of time later to decide what you want to do when there aren\u0027t people trying to kill you.\"\\n\\n \"That\u0027s just my point. As long as I\u0027m still able to be an asset to any covert group—be they the U.S. government or otherwise—there will always be someone out to use me as a weapon. Or kill me. I\u0027ll never be free again.\"\\n\\n She was right. David just wished she hadn\u0027t been smart enough to figure it out so soon.\\n\\n \"Listen,\" said David, forcing his voice to quiet to a soothing tone. \"It\u0027s after two in the morning. Get some sleep and I promise things will look better when you\u0027re not so tired. Maybe not great, but better.\" \\n\\n","sourceLink":"https://allnovel.net/no-regrets-delta-force-1/page-19.html","bookId":2374,"book":{"id":2374,"title":"No Regrets (Delta Force #1)","description":"Storyline: No Regrets (Delta Force #1) \\n Renowned cryptologist Noelle Blanche refuses to have blood on her hands. So when the military asks for her help in a covert operation, she refuses--until masked gunmen raid her home and threaten her life. Suddenly it\u0027s all too clear that any blood spilled may be her own. Noelle has no choice but to trust the dangerous stranger sent by the military to safeguard her. A stranger who is everything she detests, everything she fears...and everything she desires. \\n Former Delta Force operative David Wolfe thought he had left it all behind--the horror, the hurt, the guilt. But now the men who savagely murdered his wife have set their sights on a brilliant cryptologist who can lead them to the cache of weapons they prize. As passion ignites between David and the woman he\u0027s sworn to protect, what began as just a mission escalates into the fight of his life. But can he prevent history from repeating itself?\\n","cover":"https://allnovel.net/images/no-regrets-delta-force-1.jpg","author":"Shannon K. Butcher","type":"Mystery","source":"allnovel","link":"https://allnovel.net/no-regrets-delta-force-1.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:15:32 AM"}}
