{"id":70253,"no":33,"title":"Page 33","content":"Something inside her melted as she realized that. Most men would just as soon leave a girl than be stuck with the responsibility of supporting a child, even just financially, much less being an actual father. But David had offered to adopt a baby that didn\u0027t even exist yet. It was at that moment that she realized her mistake. Despite her keen intelligence and years of advanced education, despite her warnings to herself that she would keep her distance from David, despite the fact that his career and her principles could never mesh, Noelle had done the most stupid thing in her life. She\u0027d fallen in love with David. CHAPTER TWENTY-THREE David sat on the steps in front of the cabin the next morning, drinking coffee with Caleb and Grant in order to give Noelle time to work in peace. She\u0027d said she was close to a solution and he prayed she was right. The ari was cold and crisp with frost and smelted faintly of pine and fallen leaves. There was littlebreeze and only the tops of the trees swayed as they were brushed by cold wind. \"I keep forgetting how much I love this place,\" said Caleb. \"Sure as hell beats the desert,\" replied Grant. \"There\u0027s nothing worse than getting sand in your shorts.\" David eyed Caleb, taking in his solemn face. Something about Caleb had changed since they had worked together two years ago. He was more serious than he used to be. Quieter. David thought about what Grant had said about Caleb taking too many chances with his life. \"Have you thought about a change of career? You\u0027re one hell of a carpenter. Why don\u0027t you take up cabinetmaking or something and make this place your permanent home?\" \"That\u0027s an idea,\" said Grant, his eyes glittering with excitement. \"We could help you expand the place. Put on a real bathroom and maybe a bedroom. We could even see about getting power lines run up here so you don\u0027t have to use the generator.\" Caleb didn\u0027t even blink. He sat there, coffee cradled in his huge hands, staring at the forest in that patient manner of his that made David want to shake him to see if he even knew they were talking to him. \"I bet you could get satellite TV up here,\" continued Grant. \"Between that and a fridge full of food and beer, what more could a man want?\" One side of Caleb\u0027s jaw twitched, but he remained silent. David knew Caleb well enough to see he was suffering, but from what, David had no idea. Whatever it was, the conversation was hard on Caleb, so it was time for a change in topic. Caleb would talk about whatever was on his mind if and when it suited him, which David hoped would be soon. \"One of us is going to need to make a trip mto town tomorrow,\" said David. \"I\u0027ll go,\" said Caleb. \"I\u0027ll go with you,\" offered Grant, a little too quickly to be casual. David frowned at Grant, who gave him an apologetic stare. \"I\u0027m not suicidal,\" said Caleb. His mouth pressed flat into an irritated line. \"Stop acting like I can\u0027t take care of myself.\" \"I know you can take care of yourself,\" argued Grant. \"I also know that Monroe has labeled you as a man with limited self-preservation instincts.\" Caleb\u0027s black brows rose at this news. \"Has he? Huh.\" David looked at Grant to see if this was one of the lean man\u0027s jokes. Grant had a wicked sense of humor, but right now, he was dead serious. \"What the hell happened?\" asked David. Caleb turned his head and studied the forest. Grant\u0027s face darkened with anger. Neither man said a word. A low buzzing sound came from Grant\u0027s pants, and he reached into his pocket to pull out a phone. Looking at the display, he let out a resigned sigh. \"It\u0027s Colonel Monroe,\" he said as he pressed the button to receive the call. \"Lieutenant Kent speaking.\" Grant listened, then winced. \"Yes, sir. The desert is damn hot. Sandy, too, sir.\" David could hear the faint rumble of Monroe\u0027s voice. \"No, sir. Were we expecting Captain Wolfe on this op, sir?\" Grant shot David a frustrated look. \"Yes, sir. If I see him, I\u0027ll make sure to pass on that you are looking for him.\" The rumble coming from the phone got louder. \"No, sir. I\u0027m fairly sure your boot will not fit that far up my—\" Grant lifted the phone away from his ear and all three men could hear Monroe\u0027s deep, enraged voice booming out of the tiny speaker. There was a vile string of curses followed by the command, \"Hand Wolfe the goddamn phone, Kent!\" \"It\u0027s for you,\" said Grant. David took the phone and started talking before Monroe got the first word in. \"Don\u0027t blame Caleb and Grant for coming here; I ordered them to leave their posts and give me a hand.\" Monroe\u0027s voice was low and pissed. \"The hell you did. I know those two men and neither one of them had to be ordered to give you a hand. The only reason they got away with leaving is because I wanted them to track you down. I knew they\u0027d find you no matter how deeply you\u0027d buried yourself. It worked, too.\" \"Yes, sir. I suppose it did.\" \"Why the hell haven\u0027t you been answering the sat phone?\" \"I didn\u0027t want to be tracked. I don\u0027t like using this one either, so make it quick.\" \"Don\u0027t push your luck, son. You\u0027re still under my command for as long as she\u0027s with you.\" David bit back a disrespectful phrase, just barely. \"What do you want, sir?\" \"We found the informant. It was one of the CIA agents. The Swarm has his son held hostage in exchange for information, though by now, I\u0027m sure the boy is dead. We\u0027ve had the agent under interrogation for forty-eight hours and I don\u0027t think he knows anything. He\u0027s just the Swarm\u0027s tool.\" Shit. David couldn\u0027t bring himself to ask who it was for fear it would be someone he knew. Someone he liked. Maybe he\u0027d even met the man\u0027s son. The thought was more than he could take right now. \"Are there others?\" \"Don\u0027t know. We were hoping to get the current locations of the Swarm out of him, but it doesn\u0027t look hopeful. We\u0027ll resort to more extreme tactics in a few hours just to make sure he\u0027s not lying, but I just wanted you to know that it should be safe to come back.\" \"We\u0027re staying put for now. It\u0027s safer here.\" \"You sure?\" \"Yes, sir. I\u0027d really like to be off this line, though. Who knows what sort of locating equipment they have.\" \"I understand. Is she making progress?\" \"Yes, sir. She is. I don\u0027t think it will be long now.\" \"Check in again within two days, Captain.\" \"Yes, sir.\" David ended the conversation and powered the phone off. \"Keep this off while you\u0027re here. I don\u0027t want to take any chances.\" \"Right. Will do. So, how fucked are we?\" asked Grant. David felt himself smile. \"Not too bad. Monroe was hoping you\u0027d come find me.\" \"That sneaky bastard.\" Grant grinned. Caleb\u0027s eyes went hard and cold. He apparently wasn\u0027t fond of being manipulated like that. \"If we\u0027re going to stay, we should plan that trip into town.\" David heard Noelle\u0027s low mumble of incoherent phrases coming from the cabin. His heart warmed at the thought of having a little time alone with her again. Soon she\u0027d be finished with her work, and they\u0027d go their separate ways. He wanted to spend as much time with her as he could before that happened. \"Why don\u0027t both of you go into town. Noelle and I will be fine here alone.\" \"I\u0027m sure you will,\" muttered Grant with a grin. \"Jealous?\" asked Caleb with a completely serious expression. \"Hell, yes. David went and got himself a brainy woman who\u0027s too cute for words while I haven\u0027t gotten laid in weeks.\" \"Weeks?\" said David with mock horror, thinking of his two-year celibacy. \"Poor baby.\" \"Fuck you, Wolfe. I don\u0027t have to take this abuse.\" Grant stood and headed for the tree line. \"I\u0027m going to go walk the perimeter and think about the woman I\u0027m going to pick up while we\u0027re in town tomorrow.\" \"He will, too,\" grumbled Caleb when Grant was gone. \"Will what?\" asked David. \"Find some woman willing to go for a quickie in a hotel with him. Or maybe just a public restroom. I swear the man can sense an easy target from a quarter mile. He\u0027ll be off getting his jollies and leave me to do the grocery shopping.\" David laughed. He couldn\u0027t help it. He\u0027d missed his buddies too much not to enjoy their quirks. \"Since you\u0027ll be doing the shopping, I need to add a few things to your list.\" \"Like what?\" David felt his face heat. He was a grown man, but he couldn\u0027t help being a little weirded out about his relationship with Noelle. It was still new and uncertain and part of him still felt like he was being unfaithful to Mary\u0027s memory. He knew it was stupid, but he couldn\u0027t help it. David took a deep breath and just spit it out. \"I need you to pick up a pregnancy test.\" Caleb\u0027s expression remained neutral, unsurprised. \"I thought you looked like you were starting to show. I didn\u0027t want to say anything in case you\u0027d just gotten fat.\" David laughed and damn, it felt good. \"Don\u0027t be an ass. This is serious.\" \"Okay. I\u0027ll see what I can do.\" \"I wouldn\u0027t bother if I knew how much longer we were going to be here, but we don\u0027t know and if we\u0027re here for a few more weeks . .. I just thought she might like to know. The idea really freaked her out.\" \"So, what are you hoping for? Negative or positive results?\" David knew what he wanted, but it involved a lot more than just a blue line on some test. In a perfect world, he\u0027d have it all. A wife, kids, a nice, quiet life where he didn\u0027t have to worry about someone wanting to kill him or his family. In a perfect world, he\u0027d forgive himself for Mary\u0027s death and be able to move on. But this was far from perfect and he had to face reality. \"What I want is for Noelle to live long enough that the results of a pregnancy test matter.\" \"So, do you want me to pick up some prenatal vitamins, just in case? My mom always took those when she was pregnant.\" \"Good idea. She\u0027s either going to need them or feminine hygiene products.\" \"Damn\" said Caleb, looking a little uncomfortable for the first time since he arrived. \"I don\u0027t know anything about that.\" \"You have a sister, don\u0027t you?\" \"Yeah, but she was still a kid when I left home. It wasn\u0027t really an issue. You were the one with a wife. Shouldn\u0027t you know about these things?\" \"Mary always took care of that stuff herself. I never had to learn how to buy those... things.\" They leaned forward, bracing their elbows on their knees for a strategy session. \"So, what do we do?\" asked Caleb. \"I don\u0027t want to ask Noelle what she needs. She\u0027s concentrating, and if I bring up the subject of whether or not she\u0027s going to need... feminine hygiene products, she might lose it.\" \"Right. We\u0027ll figure it out without her. We\u0027ve planned missions that were harder than this, right?\" David gave Caleb a disbelieving look. \"I don\u0027t remember any.\" He pushed out a breath. \"Okay. I think Mary used tampons. Why don\u0027t you get those?\" \"Don\u0027t they come in different sizes?\" \"How the hell should I know?\" \"I think they do. She looks like a small. What do you think?\"","sourceLink":"https://allnovel.net/no-regrets-delta-force-1/page-33.html","bookId":2374,"book":{"id":2374,"title":"No Regrets (Delta Force #1)","description":"Storyline: No Regrets (Delta Force #1) Renowned cryptologist Noelle Blanche refuses to have blood on her hands. So when the military asks for her help in a covert operation, she refuses--until masked gunmen raid her home and threaten her life. Suddenly it\u0027s all too clear that any blood spilled may be her own. Noelle has no choice but to trust the dangerous stranger sent by the military to safeguard her. A stranger who is everything she detests, everything she fears...and everything she desires. Former Delta Force operative David Wolfe thought he had left it all behind--the horror, the hurt, the guilt. But now the men who savagely murdered his wife have set their sights on a brilliant cryptologist who can lead them to the cache of weapons they prize. As passion ignites between David and the woman he\u0027s sworn to protect, what began as just a mission escalates into the fight of his life. But can he prevent history from repeating itself?","cover":"https://allnovel.net/images/no-regrets-delta-force-1.jpg","author":"Shannon K. Butcher","type":"Mystery","source":"allnovel","link":"https://allnovel.net/no-regrets-delta-force-1.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:15:32 AM"}}
