{"id":146,"no":32,"title":"Chapter 15: Moss","content":"66Trevize looked grotesque in his space suit. The onlypart of him that remained outsideeeere his holsters not the onesthat he strapped around his hips ordinarily, but more substantial onesthat eere part of his suit. Carefully, he inserted the blaster in theright-hand holster, the neuronic whip in the left. Again, they had beenrecharged and this time, he thought grimly, nothing wouldtake them away from him. Bliss smiled. \"Are you going to carry weapons even on a world withoutair or Never mind! I won\u0027t question your decisions.\"Trevize said, \"Good!\" and turned to help Pelorat adjust his helmet,before donning his own. Pelorat, who had never worn a space suit before, said, ratherplaintively, \"Will I really be able to breathe in this thing, Golan?\"\"I promise you,\" said Trevize. Bliss watched as the final joints were sealed, her arm about Fallom\u0027sshoulder. The young Solarian stared at the two space-suited figures inobvious alarm. She was trembling, and Bliss\u0027s arm squeezed her gentlyand reassuringly. The airlock door opened, and the two stepped inside, their bloatedarms waving a farewell. It closed. The mainlock door opened and theystepped clumsily onto the soil of a dead world. It was dawn. The sky was clear, of course, and purplish in color,but the sun had not yet risen. Along the lighter horizon where the sunwould come, there was a slight haze. Pelorat said, \"It\u0027s cold.\"\"Do you feel cold?\" said Trevize, with surprise. The suits were wellinsulated and if there was a problem, now and then, it was with thegetting rid of body heat. Pebrat said, \"Not at all, but look \" His radioed voice soundedTrevize\u0027s ear, and his finger pointed. In the purplish light of dawn, the crumbling stone front of thebuilding they were approaching was sheathed in hoar frost. Trevize said, \"With a thin atmosphere, it would get colder at nightthan you would expect, and warmer in the day. Right now it\u0027s the coldestpart of the day and it should take several hours before it gets too hotfor us to remain in the sun.\"As though the word had been a cabalistic incantation, the rim of thesun appeared above the horizon. \"Don\u0027t look at it,\" said Trevize conversationally. \"Your face-plate isreflective and ultraviolet-opaque, but it would still be dangerous.\"He turned his back to the rising sun and let his long shadow fall onthe building. The sunlight was causing the frost to disappear, even ashe watched. For a few moments, the wall looked dark with dampness andthen that disappeared, too. Trevize said, \"The buildings don\u0027t look as good down here as theylooked from the sky. They\u0027re cracked and crumbling. That\u0027s the resultof the temperature change, I suppose, and of having the water tracesfreeze and melt each night and day for maybe as much as twenty thousandyears.\"Pelorat said, \"There are letters engraved in the stone above theentrance, but crumbling has made them difficult to read.\"\"Can you make it out, Janov?\"\"A financial institution of some sort. At least I make out a wordwhich may be `bank.\u0027\"\"What\u0027s that?\"\"A building in which assets were stored, withdrawn, traded, invested,loaned if it\u0027s what I think it is.\"\"A whole building devoted to it? No computers?\"\"Without computers taking over altogether.\"Trevize shrugged. He did not find the details of ancient historyinspiring. They moved about, with increasing haste, spending less time atsac build ing. The silence, the deadness , was completelydepressing. The slow millennial-long collapse into which they had intrudedmade the place seem like the skeleton of a city, with everything gonebut the bones. They were well up in the temperate zone, but Trevize imagined hecould feel the heat of the sun on his back. Pelorat, about a hundred meters to his right, said sharply, \"Lookat that.\"Trevize\u0027s ears rang. He said, \"Don\u0027t shout, Janov. I can hear yourwhispers clearly no matter how far away you are. What is it?\"Pelorat, his voice moderating at once, said, \"This building is the`Hall of the Worlds.\u0027 At least, that\u0027s what I think the inscriptionreads.\"Trevize joined him. Before them was a three-story structure, the lineof its roof irregular and loaded with large fragments of rock, as thoughsome sculptured object that had once stood there had fallen to pieces. \"Are you sure?\" said Trevize. \"If we go in, we\u0027ll find out.\"They climbed five low, broad steps, and crossed a space-wastingplaza. In the thin sir, their metal-shod footsteps made a whisperingvibration rather than a sound. \"I see what you mean by `large, useless, and expensive,\u0027\" mutteredTrevize. They entered a wide and high hall, with sunlight shining through tallwindows and illuminating the interior too harshly where it struck andyet leaving things obscure in the shadow. The thin atmosphere scatteredlittle light. In the center was a larger than life-size human figure in what seemedto be a synthetic stone. One arm had fallen off. The other arm was crackedat the shoulder and Trevize felt that if he tapped it sharply that arm,too, would break off. He stepped back as though getting too near mighttempt him into such unbearable vandalism. \"I wonder who that is?\" said Trevize. \"No markings anywhere. Isuppose those who set it up felt that his fame was so obvious he neededno identification, but now \" He felt himself in danger of growingphilosophical and turned his attention away. Pelorat was looking up, and Trevize\u0027s glance followed the angle ofPelorat\u0027s head. There were markings carvings on the wallwhich Trevize could not read. \"Amazing,\" said Pelorat. \"Twenty thousand years old, perhaps, and,in here, protected somewhat from sun and damp, they\u0027re still legible.\"\"Not to me,\" said Trevize. \"It\u0027s in old script and ornate even for that. Let\u0027s seenow seven one two \" His voice died away in amumble, and then he spoke up again. \"There are fifty names listed andthere are supposed to have been fifty Spacer worlds and this is `The Hallof the Worlds.\u0027 I assume those are the names of the fifty Spacer worlds,probably in the order of establishment. Aurora is first and Solaria islast. If you\u0027ll notice, there are seven columns, with seven names inthe first six columns and then eight names in the last. It is as thoughthey had planned a seven-by-seven grid and then added Solaria after thefact. My guess, old chap, is that list dates back to before Solariawas terraformed and populated.\"\"And which one is this planet we\u0027re standing on? Can you tell?\"Pelorat said, \"You\u0027ll notice that e fifth one down in the thirdcolumn, the nineteenth in order, is inscribed in letters a little largerthan the others. The listers seem to have been self-centered enough togive themselves some pride of place. Besides \"\"What does the name read?\"\"As near as I can make out, it says Melpomenia. It\u0027s a name I\u0027mtotally unfamiliar with.\"\"Could it represent Earth?\"Pelorat shook his head vigorously, but went unseen inside hishelmet. He said, \"There are dozens of words used for Earth in the oldlegends. Gaia is one of them, as you know. So is Terra, and Erda, andso on. They\u0027re all short. I don\u0027t know of any long name used for it,or anything even resembling a short version of Melpomenia.\"\"Then we\u0027re standing on Melpomenia, and it\u0027s not Earth.\"\"Yes. And besides as I started to say earlier an evenbetter indication than the larger lettering is that e co-ordinates ofMelpomenia are given as 0, and you would expect co-ordinates tobe referred to one\u0027s own planet.\"\"Co-ordinates?\" Trevize sounded dumbfounded. \"Th list gives thecoordinates, too?\"\"They give three figures for each and I presume those areco-ordinates. What else can they be?\"Trevize did not answer. He opened a small compartment in the portionof the space suit that covered his right thigh and took out a compactdevice with wire connecting it o e compartment. He put it up tohis eyes and carefully focused it on the inscription on the wall, hissheathed fingers making a difficult job out of something wouldordinarily have been a moment\u0027s work. \"Camera?\" asked Pelorat unnecessarily. \"It will feed the image directly in o e ship\u0027s computer,\" saidTrevize. He took several photographs from different angles; then said,\"Wait! I\u0027ve got to get higher. Help me, Janov.\"Pelorat clasped his hands together, stirrup-fashion, but Trevize shookhis head. \"Th won\u0027t support my weight. Get on your hands and knees.\"Pelorat did so, laboriously, and, as laboriously, Trevize, havingtucked e camera in o its compartment again, stepped on Pelorat\u0027sshoulders and from them on to e pedestal of the statue. He tried torock the statue carefully to judge its firmness, then placed his footon one bent knee and used it as a base for pushing himself upward andcatching e armless shoulder. Wedging his toes against some unevennessat e chest, he lifted himself and, finally, after several grunts,managed to sit on the shoulder. To ose long-dead who had reveredthe statue and what it represented, what Trevize did would have seemedblasphemy, and Trevize was sufficiently influenced by that ought totry to sit lightly. \"You\u0027ll fall and hurt yourself,\" Pelorat called out anxiously. \"I\u0027m not going o fall and hurt myself, but you mightdeafen me.\" Trevize unslung his camera and focused once more. Severalmore photographs were taken and then he replaced e camera yet again andcarefully lowered himself till his feet touched the pedestal. He jumped tothe ground and the vibration of his contact was apparently the final push,for the still in act arm crumbled, and produced a small heap of rubbleat e foot of the statue. It made virtually no noise as it fell. Trevize froze, his first impulse being of finding a place o hidebefore the watchman came and caught him. Amazing, he ought afterward,how quickly one relives e days of one\u0027s childhood in a situationlike th when you\u0027ve accidentally broken something looksimportant. It lasted only a moment, but it cut deeply. Pelorat\u0027s voice was hollow, as befitted one who had witnessed andeven abetted an act of vandalism, but he managed to find words ofcomfort. \"It\u0027s it\u0027s all right, Golan. It was about to come downby itself, anyway.\"He walked over to the pieces on the pedestal and floor as though hewere going to demonstrate the point, reached out for one of the largerfragments, and then said, \"Golan, come here.\"Trevize approached and Pelorat, pointing at a piece of stone that hadclearly been the portion of the arm that had been joined to the shoulder,said, \"What is this?\"Trevize stared. There was a patch of fuzz, bright green incolor. Trevize rubbed it gently with his suited finger. It scraped offwithout trouble. \"It looks a lot like moss,\" he said. \"The life-without-mind that you mentioned?\"\"I\u0027m not completely sure how far without mind. Bliss, I imagine,would insist that this had consciousness, too but she would claimthis stone also had it.\"Pelorat said, \"Do you suppose that moss stuff is what\u0027s crumblingthe rock?\"Trevize said, \"I wouldn\u0027t be surprised if it helped. The world hasplenty of sunlight and it has some water. Half what atmosphere it has iswater vapor. The rest is nitrogen and inert gases. Just a trace of carbondioxide, which would lead one to suppose there\u0027s no plant life butit could be that the carbon dioxide is low because it is virtually allincorporated into the rocky crust. Now if this rock has some carbonate init, perhaps this moss breaks it down by secreting acid, and then makesuse of the carbon dioxide generated. This may be the dominant remainingform of life on this planet.\"\"Fascinating,\" said Pelorat. \"Undoubtedly,\" said Trevize, \"but only in a limited way. Theco-ordinates of the Spacer worlds are rather more interesting but whatwe really want are the co-ordinates of Earth . If they\u0027renot here, they may be elsewhere in the building or in anotherbuilding. Come, Janov.\"\"But you know \" began Pelorat. \"No, no,\" said Trevize impatiently. \"We\u0027ll talk later. We\u0027ve gotto see what else, if anything, this building can give us. It\u0027s gettingwarmer.\" He looked the small temperature reading on the back of his leftglove. \"Come, Janov.\"They tramped through the rooms, walking as gently as possible, notbecause they were making sounds in the ordinary sense, or because therewas anyone to hear them, but because they were a little shy of doingfurther damage through vibration. They kicked up some dust, which moved a short way upward and settledquickly through the thin air, and they left footmarks behind them. Occasionally, in some dim corner, one or the other would silentlypoint out more samples of moss that were growing. There seemed a littlecomfort in the presence of life, however low in the scale, somethingthat lifted the deadly, suffocating feel of walking through a dead world,especially one in which artifacts all about showed that once, long ago,it had been an elaborately living one. And then, Pelorat said, \"I think this must be a library.\"Trevize looked about curiously. There were shelves and, as helooked more narrowly, what the corner of his eye had dismissed as mereornamentation, seemed as though they might well be book-films. Gingerly,he reached for one. They were thick and clumsy and then he realizedthey were only cases. He fumbled with his thick fingers to open one, andinside he saw several discs. They were thick, too, and seemed brittle,though he did not test that. He said, \"Unbelievably primitive.\"\"Thousands of years old,\" said Pelorat apologetically, as thoughdefending the old Melpomenians against the accusation of retardedtechnology. Trevize pointed to the spine of the film where there were dimcurlicues of the ornate lettering that the ancients had used. \"Is thatthe title? What does it say?\"Pelorat studied it. \"I\u0027m not really sure, old man. I think one ofthe words refers to microscopic life. It\u0027s a word for `microorganism,\u0027 perhaps. I suspect these are technical microbiological terms which Iwouldn\u0027t understand even in Standard Galactic.\" `\"Probably,\" said Trevize morosely. \"And, equally probably, itwouldn\u0027t do us any good even if we could read it. We\u0027re not interestedin germs. Do me a favor, Janov. Glance through some of these booksand see if there\u0027s anything there with an interesting title. While you\u0027redoing that, I\u0027ll look over these book-viewers.\"\"Is that what they are?\" said Pelorat, wondering. They were squat,cubical structures, topped by a slanted screen and a curved extensionat the top that might serve as an elbow rest or a place on which to putan electro-notepad if they had had such on Melpomenia. Trevize said, \"If this is a library, they must have book-viewers ofone kind or another, and this seems as though it might suit.\"He brushed the dust off the screen very gingerly and was relievedthat the screen, whatever it might be made of, did not crumble at histouch. He manipulated the controls lightly, one after another. Nothinghappened. He tried another book-viewer, then another, with the samenegative results. He wasn\u0027t surprised. Even if the device were to remain in workingorder for twenty millennia in a thin atmosphere and was resistant towater vapor, there was still the question of the power source. Storedenergy had a way of leaking, no matter what was done to stop it. Thatwas another aspect of the all embracing, irresistible second law ofthermodynamics. Pelorat was behind him. \"Golan?\"\"Yes.\"\"I have a book-film here \"\"What kind?\"\"I think it\u0027s a history of space flight.\"\"Perfect but it won\u0027t do us any good if I can\u0027t make this viewerwork.\"His hands clenched in frustration. \"We could take the film back to the ship.\"\"I wouldn\u0027t know how to adapt it to our viewer. It wouldn\u0027t fit andour scanning system is sure to be incompatible.\"\"But is all that really necessary, Golan? If we \"\"It is really necessary, Janov. Now don\u0027t interrupt me. I\u0027m tryingto decide what to do. I can try adding power to the viewer. Perhaps thatis all it needs.\"\"Where would you get the power?\"\"Well \" Trevize drew his weapons, looked at them briefly, thensettled his blaster back into its holster. He cracked open his neuronicwhip, and studied the energy-supply level. It was at maximum. Trevize threw himself prone upon the floor and reached behind theviewer (he kept assuming that was what it was) and tried to push itforward. It moved a small way and he studied what he found in theprocess. One of those cables had to carry the power supply and surely itwas the one that came out of the wall. There was no obvious plug orjoining. (How does one deal with an alien and ancient culture where thesimplest taken-for granted matters are made unrecognizable?)He pulled gently at the cable, then harder. He turned it one way,then the other. He pressed the wall in the vicinity of the cable, andthe cable in the vicinity of the wall. He turned his attention, as besthe could, to the half-hidden back of the viewer and nothing he could dothere worked, either. He pressed one hand against the floor to raise himself and, as hestood up, the cable came with him. What he had done that had loosened it,he hadn\u0027t the slightest idea. It didn\u0027t look broken or torn away. The end seemed quite smooth andit had left a smooth spot in the wall where it had been attached. Pelorat said softly, \"Golan, may I \"Trevize waved a peremptory arm at the other. \"Not now, Janov. Please!\"He was suddenly aware of the green material caking the creases on hisleft glove. He must have picked up some of the moss behind the viewerand crushed it. His glove had a faint dampness to it, but it dried ashe watched, and the greenish stain grew brown. He turned his attention toward the cable, staring at the detached endcarefully. Surely there were two small holes there. Wires could enter. He sat on the floor again and opened the power unit of his neuronicwhip. Carefully, he depolarized one of the wires and clicked it loose. Hethen, slowly and delicately, inserted it into the hole, pushing it inuntil it stopped. When he tried gently to withdraw it again, it remainedput, as though it had been seized. He suppressed his first impulse toyank it out again by force. He depolarized the other wire and pushedit into the other opening. It was conceivable that would close thecircuit and supply the viewer with power. \"Janov,\" he said, \"you\u0027ve played about with book-films of allkinds. See if you can work out a way of inserting that book into theviewer.\"\"Is it really nece \"\"Please, Janov, you keep trying to ask unnecessary questions. We onlyhave so much time. I don\u0027t want o have to wait far into the night forthe building to cool off to the point where we can return.\"\"It must go in this way,\" said Janov, \"but \"\"Good,\" said Trevize. \"If it\u0027s a history of space flight, then itwill have to begin with Earth, since it was on Earth that space flightwas invented. Let\u0027s see if this thing works now.\"Pelorat, a little fussily, placed the book-film into the obviousreceptacle and then began studying the markings on the various controlsfor any hint as to direction. Trevize spoke in a low voice, while waiting, partly to ease his owntension. \"I suppose there must be robots on this world, too here andthere in reasonable order to all appearances glistening in thenear-vacuum. The trouble is their power supply would long since have beendrained, too, and, even if repowered, what about their brains? Levers andgears might withstand the millennia, but what about whatever microswitchesor subatomic gizmos they had in their brains? They would have to havedeteriorated, and even if they had not, what would they know aboutEarth. W would they \"Pelorat said, \"The viewer is working, old chap. See here.\"In the dim light, the book-viewer screen began to flicker. It was onlyfaint, but Trevize turned up the power slightly on his neuronic whip andit grew brighter. The thin air about them kept the area outside the shaftsof sunlight comparatively dim, so that e room was faded and shadowy,and the screen seemed the brighter by contrast. It continued to flicker, with occasional shadows drifting acrossthe screen. \"It needs to be focused,\" said Trevize. \"I know,\" said Pelorat, \"but this seems the best I can do. The filmitself must have deteriorated.\"The shadows came and went rapidly now, and periodically there seemedsomething like a faint caricature of print. Then, for a moment, therewas sharpness and it faded again. \"Get that back and hold it, Janov,\" said Trevize. Pelorat was already trying. He passed it going backward, then againforward, and then got it and held it. Eagerly, Trevize tried to read it, then said, in frustration, \"Canyou make it out, Janov?\"\"Not entirely,\" said Pelorat, squinting at the screen. \"It\u0027s aboutAurora. I can tell that much. I think it\u0027s dealing with the firsthyperspatial expedition the `prime outpouring,\u0027 it says.\"He went forward, and it blurred and shadowed again. He said finally,\"All the pieces I can get seem to deal with the Spacer worlds,Golan. There\u0027s nothing I can find about Earth.\"Trevize said bitterly, \"No, there wouldn\u0027t be. It\u0027s all been wipedout on this world as it has on Trantor. Turn the thing off.\"\"But it doesn\u0027t matter \" began Pelorat, turning it off. \"Because we can try other libraries? It will be wiped out there,too. Everywhere. Do you know \" He had looked at Pelorat as he spoke,and now he stared at him with a mixture of horror and revulsion. \"W \u0027swrong with your face-plate?\" he asked. 67Pelorat automatically lifted his gloved hand to hisface-plate and then took it away and looked at it. \"W is it?\" he said, puzzled. Then, he looked at Trevize and wenton, rather squeakily, \"There\u0027s something peculiar about your face-plate, Golan.\"Trevize looked about automatically for a mirror. There was none and hewould need a light if there were. He muttered, \"Come into the sunlight,will you?\"He half-led, half-pulled Pelorat into the shaft of sunlight fromthe nearest window. He could feel its warmth upon his back despite theinsulating effect of the space suit. He said, \"Look toward the sun, Janov, and close your eyes.\"It was at once clear what was wrong with the face-plate. There wasmoss growing luxuriantly where the glass of the face-plate met themetallized fabric of the suit itself. The face-plate was rimmed withgreen fuzziness and Trevize knew his own was, too. He brushed a finger of his glove across the moss on Pelorat\u0027sface-plate. Some of it came off, the crushed green staining theglove. Even as he watched it glisten in the sunlight, however, it seemedto grow stiffer and drier. He tried again, and this time, the mosscrackled off. It was turning brown. He brushed the edges of Pelorat\u0027sface-plate again, rubbing hard. \"Do mine, Janov,\" he said. Then, later, \"Do I look clean? Good,so do you. Let\u0027s go. I don\u0027t think there\u0027s more to do here.\"The sun was uncomfortably hot in the deserted airless city. The stonebuildings gleamed brightly, almost achingly. Trevize squinted as helooked at them and, as far as possible, walked on the shady side of thethoroughfares. He stopped at a crack in one of the building fronts, onewide enough to stick his little finger into, gloved as it was. He did justthat, looked at it, muttered, \"Moss,\" and deliberately walked to the endof the shadow and held that finger out in the sunlight for a while. He said, \"Carbon dioxide is the bottleneck. Anywhere they canget carbon dioxide decaying rock anywhere it willgrow. We\u0027re a good source of carbon dioxide, you know, probably richerthan anything else on this nearly dead planet, and I suppose traces ofthe gas leak out at the boundary of the face-plate.\"\"So the moss grows there.\"\"Yes.\"It seemed a long walk back to the ship, much longer and, of course,hotter than the one they had taken at dawn. The ship was still in theshade when they got there, however; that much Trevize had calculatedcorrectly, at least. Pelorat said, \"Look!\"Trevize saw. The boundaries of the mainlock were outlined in greenmoss. \"More leakage?\" said Pelorat. \"Of course. Insignificant amounts, I\u0027m sure, but this moss seems tobe a better indicator of trace amounts of carbon dioxide than anything Iever heard of. Its spores must be everywhere and wherever a few moleculesof carbon dioxide are to be found, they sprout.\" He adjusted his radiofor ship\u0027s wavelength and said, \"Bliss, can you hear me?\"Bliss\u0027s voice sounded in both sets of ears. \"Yes. Are you ready tocome in? Any luck?\"\"We\u0027re just outside,\" said Trevize, \"but don\u0027t openthe lock. We\u0027ll open it from out here. Repeat, don\u0027t openthe lock.\"\"Why not?\"\"Bliss, just do as I ask, will you? We can have a long discussionafterward.\"Trevize brought out his blaster and carefully lowered, its intensity tominimum, then gazed at it uncertainly. He had never used it at minimum. Helooked about him. There was nothing suitably fragile to test it on. In sheer desperation, he turned it on the rocky hillside inwhose shadow the Far Star lay. The target didn\u0027t turnred-hot. Automatically, he felt the spot he had hit. Did it feel warm? Hecouldn\u0027t tell with any degree of certainty through the insulated fabricof his suit. He hesitated again, then thought that the hull of the ship would be asresistant, within an order of magnitude at any rate, as the hillside. Heturned the blaster on the rim of the lock and flicked the contact briefly,holding his breath. Several centimeters of the moss-like growth browned at once. He wavedhis hand in the vicinity of the browning and even the mild breeze set upin the thin air in this way sufficed to set the light skeletal remnantsthat made up the brown material to scattering. \"Does it work?\" said Pelorat anxiously. \"Yes, it does,\" said Trevize. \"I turned the blaster into a mildheat ray.\"He sprayed the heat all around the edge of the lock and the greenvanished at the touch. All of it. He struck the mainlock to create avibration that would knock off what remained and a brown dust fell to theground a dust so fine that it even lingered in the thin atmosphere,buoyed up by wisps of gas. \"I think we can open it now,\" said Trevize, and, using his wristcontrols, he tapped out the emission of the radio-wave combination thatactivated the opening mechanism from inside. The lock gaped and hadnot opened more than halfway when Trevize said, \"Don\u0027t dawdle, Janov,get inside. Don\u0027t wait for the steps. Climb in.\"Trevize followed, sprayed the rim of the lock with his toned-downblaster. He sprayed the steps, too, once they had lowered. He thensignaled the close of the lock and kept on spraying till they weretotally enclosed. Trevize said, \"We\u0027re in the lock, Bliss. We\u0027ll stay here a fewminutes. Continue to do nothing!\"Bliss\u0027s voice said, \"Give me a hint. Are you all right? How isPel?\"Pel said, \"I\u0027m here, Bliss, and perfectly well. There\u0027s nothing toworry about.\"\"If you say so, Pel, but there\u0027ll have to be explanations later. Ihope you know that.\"\"It\u0027s a promise,\" said Trevize, and activated the lock light. The two space-suited figures faced each other. Trevize said, \"We\u0027re pumping out all the planetary air we can, solet\u0027s just wait till that\u0027s done.\"\"What about the ship air? Are we going to let that in?\"\"Not for a while. I\u0027m as anxious to get out of the space suit as youare, Janov. I just want to make sure that we get rid of any spores thathave entered with us or upon us.\"By the not entirely satisfactory illumination of the lock light,Trevize turned his blaster on the inner meeting of lock and hull,spraying the heat methodically along the floor, up and around, and backto the floor. \"Now you, Janov.\"Pelorat stirred uneasily, and Trevize said, \"You may feel warm. Itshouldn\u0027t be any worse than that. If it grows uncomfortable, just sayso.\"He played the invisible beam over the face-plate, the edgesparticularly, then, little by little, over the rest of the space suit. He muttered, \"Lift your arms, Janov.\" Then, \"Rest your arms on myshoulder, and lift one foot I\u0027ve got to do the soles nowthe other. Are you getting too warm?\"Pelorat said, \"I\u0027m not exactly bathed in cool breezes, Golan.\"\"Well, then, give me a taste of my own medicine. Go over me.\"\"I\u0027ve never held a blaster.\"\"You must hold it. Grip it so, and, with your thumb, pushthat little knob and squeeze the holster tightly. Right. Nowplay it over my face-plate. Move it steadily, Janov, don\u0027t let it lingerin one place too long. Over the rest of the helmet, then down the cheekand neck.\"He kept up the directions, and when he had been heated everywhereand was in an uncomfortable perspiration as a result, he took back theblaster and studied the energy level. \"More than half gone,\" he said, and sprayed the interior of thelock methodically, back and forth over the wall, till the blaster wasemptied of its charge, having itself heated markedly through its rapidand sustained discharge. He then restored it to its holster. Only then did he signal for entry into the ship. He welcomed thehiss and feel of air coming into the lock as the inner door opened. Itscoolness and its convective powers would carry off the warmth of the spacesuit far more quickly than radiation alone would do. It might have beenimagination, but he felt the cooling effect at once. Imagination or not,he welcomed that, too. \"Off with your suit, Janov, and leave it out here in the lock,\"said Trevize. \"If you don\u0027t mind,\" said Pelorat, \"a shower is what I would like tohave before anything else.\"\"Not before anything else. In fact, before that, and before you canempty your bladder, even, I suspect you will have to talk to Bliss.\"Bliss was waiting for them, of course, and with a look of concern onher face. Behind her, peeping out, was Fallom, with her hands clutchingfirmly at Bliss\u0027s left arm. \"What happened?\" Bliss asked severely. \"What\u0027s been going on?\"\"Guarding against infection,\" said Trevize dryly, \"so I\u0027ll be turningon the ultraviolet radiation. Break out the dark glasses. Please don\u0027tdelay.\"With ultraviolet added to the wall illumination, Trevize took offhis moist garments one by one and shook them out, turning them in onedirection and another. \"Just a precaution,\" he said. \"You do it, too, Janov. And,Bliss, I\u0027ll have to peel altogether. If that will make you uncomfortable,step into the next room.\"Bliss said, \"It will neither make me uncomfortable, nor embarrass me. Ihave a good notion of what you look like, and it will surely present mewith nothing new. What infection?\"\"Just a little something that, given its own way,\" said Trevize, witha deliberate air of indifference, \"could do great damage to humanity,I think.\"68It was all done. The ultraviolet light had done itspart. Officially, according to the complex films of information andinstructions that had come with the Far Star when Trevize hadfirst gone aboard back on Terminus, the light was there preciselyfor purposes of disinfection. Trevize suspected, however, that thetemptation was always there, and sometimes yielded to, to use it fordeveloping a fashionable tan for those who were from worlds where tanswere fashionable. The light was, however, disinfecting, however used. They took the ship up into space and Trevize maneuvered it as closeto Melpomenia\u0027s sun as he might without making them all unpleasantlyuncomfortable, turning and twisting the vessel so as to make sure thatits entire surface was drenched in ultraviolet. Finally, they rescued the two space suits that had been left in thelock and examined them until even Trevize was satisfied. \"All that,\" said Bliss, at last, \"for moss. Isn\u0027t that what you saidit was, Trevize? Moss?\"\"I call it moss,\" said Trevize, \"because that\u0027s what it reminded meof. I\u0027m not a botanist, however. All I can say is that it\u0027s intenselygreen and can probably make do on very little light-energy.\"\"Why very little?\"\"The moss is sensitive to ultraviolet and can\u0027t grow, or even survive,in direct illumination. Its spores are everywhere and it grows in hiddencorners, in cracks in statuary, on the bottom surface of structures,feeding on the energy of scattered photons of light wherever there isa source of carbon dioxide.\"Bliss said, \"I take it you think they\u0027re dangerous.\"\"They might well be. If some of the spores were clinging to us when weentered, or swirled in with us, they would find illumination in plentywithout the harmful ultraviolet. They would find ample water and anunending supply of carbon dioxide.\"\"Only 0.03 percent of our atmosphere,\" said Bliss. \"A great deal to them and 4 percent in our exhaled breath. Whatif spores grew in our nostrils, and on our skin? What if they decomposedand destroyed our food? What if they produced toxins that killed us? Evenif we labored to kill them but left some spores alive, they would beenough, when carried to another world by us, to infest it, and from therebe carried to other worlds. Who knows what damage they might do?\"Bliss shook her head. \"Life is not necessarily dangerous because itis different. You are so ready to kill.\"\"That\u0027s Gaia speaking,\" said Trevize. \"Of course it is, but I hope I make sense, nevertheless. The moss isadapted to the conditions of this world. Just as it makes use of lightin small quantities but is killed by large; it makes use of occasionaltiny whiffs of carbon dioxide and may be killed by large amounts. Itmay not be capable of surviving on any world but Melpomenia.\"\"Would you want me to take a chance on that?\" demanded Trevize. Bliss shrugged. \"Very well. Don\u0027t be defensive. I see your point. Beingan Isolate, you probably had no choice but to do what you did.\"Trevize would have answered, but Fallom\u0027s clear high-pitched voicebroke in, in her own language. Trevize said to Pelorat, \"What\u0027s she saying?\"Pelorat began, \"What Fallom is saying \"Fallom, however, as though remembering a moment too late that herown language was not easily understood, began again. \"Was there Jembythere where you were?\"The words were pronounced meticulously, and Bliss beamed. \"Doesn\u0027tshe speak Galactic well? And in almost no time.\"Trevize said, in a low voice, \"I\u0027ll mess it up if I try, but youexplain to her, Bliss, that we found no robots on the planet.\"\"I\u0027ll explain it,\" said Pelorat. \"Come, Fallom.\" He placed a gentlearm about the youngster\u0027s shoulders. \"Come to our room and I\u0027ll get youanother book to read.\"\"A book? About Jemby?\"\"Not exactly \" And the door closed behind them. \"You know,\" said Trevize, looking after them impatiently, \"we wasteour time playing nursemaid to that child.\"\"Waste? In what way does it interfere with your search for Earth,Trevize? In no way. Playing nursemaid establishes communication,however, allays fear, supplies love. Are these achievements nothing?\"\"That\u0027s Gaia speaking again.\"\"Yes,\" said Bliss. \"Let us be practical, then. We have visited threeof the old Spacer worlds and we have gained nothing.\"Trevize nodded. \"True enough.\"\"In fact, we have found each one dangerous, haven\u0027t we? On Aurora,there were feral dogs; on Solaria, strange and dangerous human beings;on Melpomenia, a threatening moss. Apparently, then, when a world isleft to itself, whether it contains human beings or not, it becomesdangerous to the Interstellar community.\"\"You can\u0027t consider, that a general rule.\"\"Three out of three certainly seems impressive.\"\"And how does it impress you, Bliss?\"\"I\u0027ll tell you. Please listen to me with an open mind. If you havemillions of interacting worlds in the Galaxy, as is, of course, theactual case, and if each is made up entirely of Isolates, as they are,then on each world, human beings are dominant and can force their willon nonhuman life-forms, on the inanimate geological background, andeven on each other. The Galaxy is, then, a very primitive and fumblingand misfunctioning Galaxia. The beginnings of a unit. Do you see whatI mean?\"\"I see what you\u0027re trying to say but that doesn\u0027t mean I\u0027mgoing to agree with you when you\u0027re done saying it.\"\"Just listen to me. Agree or not, as you please, but listen. The onlyway the Galaxy will work is as a proto-Galaxia, and the less proto andthe more Galaxia, the better. The Galactic Empire was an attempt at astrong proto-Galaxia, and when it fell apart, times grew rapidly worse andthere was the constant drive to strengthen the proto-Galaxia concept. TheFoundation Confederation is such an attempt. So was the Mule\u0027s Empire. Sois the Empire the Second Foundation is planning. But even if there wereno such Empires or Confederations; even if the entire Galaxy were inturmoil, it would be a connected turmoil, with each world interacting,even if only hostilely, with every other. That would, in itself, be akind of union and it would not yet be the worst case.\"\"What would be the worst, then?\"\"You know the answer to that, Trevize. You\u0027ve seen it. If ahuman-inhabited world breaks up completely, is truly Isolate,and if it loses all interaction with other human worlds, itdevelops malignantly.\"\"A cancer, then?\"\" Yes . Isn\u0027t Solaria just that? Its hand is against allworlds. And on it, the hand of each individual is against those of allothers. You\u0027ve seen it. And if human beings disappear altogether, the lasttrace of discipline goes. The each-against-each becomes unreasoning, aswith the dogs, or is merely an elemental force as with the moss. You see,I suppose, that the closer we are to Galaxia, the better the society. Why,then, stop at anything short of Galaxia?\"For a while, Trevize stared silently at Bliss. \"I\u0027m thinking aboutit. But why this assumption that dosage is a one-way thing; that if alittle is good, a lot is better, and all there is is best of all? Didn\u0027tyou yourself point out that it\u0027s possible the moss is adapted to verylittle carbon dioxide so that a plentiful supply might kill it? A humanbeing two meters tall is better off than one who is one meter tall; but isalso better off than one who is three meters tall. A mouse isn\u0027t betteroff, if it is expanded to the size of an elephant. He wouldn\u0027t live. Norwould an elephant be better off reduced to the size of a mouse. \"There\u0027s natural size, a natural complexity, some optimum quality foreverything, whether star or atom, and it\u0027s certainly true of living thingsand living societies. I don\u0027t say the old Galactic Empire was ideal, andI can certainly see flaws in the Foundation Confederation, but I\u0027m notprepared to say that because total Isolation is bad, total Unificationis good. The extremes may both be equally horrible, and an old-fashionedGalactic Empire, however imperfect, may be the best we can do.\"Bliss shook her head. \"I wonder if you believe yourself, Trevize. Areyou going to argue that a virus and a human being are equallyunsatisfactory, and wish to settle for something in-between likea slime mold?\"\"No. But I might argue that a virus and a superhuman being are equallyunsatisfactory, and wish to settle for something in-between likean ordinary person. There is, however, no point in arguing. Iwill have my solution when I find Earth. On Melpomenia, we found theco-ordinates of forty-seven other Spacer worlds.\"\"And you\u0027ll visit them all?\"\"Every one, if I have to.\"\"Risking the dangers on each.\"\"Yes, if that\u0027s what it takes to find Earth.\"Pelorat had emerged from the room within which he had left Fallom,and seemed about to say something when he was caught up in the rapid-fireexchange between Bliss and Trevize. He stared from one to the other asthey spoke in turn. \"How long would it take?\" asked Bliss. \"However long it takes,\" said Trevize, \"and we might find what weneed on the next one we visit.\"\"Or on none of them.\"\"That we cannot know till we search.\"And now, at last, Pelorat managed to insert a word. \"But why look,Golan? We have the answer.\"Trevize waved an impatient hand in the direction of Pelorat, checkedthe motion, turned his head, and said blankly, \"What?\"\"I said we have the answer. I tried to tell you this on Melpomenia atleast five times, but you were so wrapped up in what you were doing-\"\"What answer do we have? What are you talking about?\"\" About Earth. I think we know where Earth is.\"","sourceLink":"http://novel.tingroom.com/kehuan/1630/48252.html","bookId":5,"book":{"id":5,"title":"基地系列 Foundation and Earth 基地与地球","description":"简介： 基地纪元498年。银河未来的命运决定于某人一念之间，这个就是葛兰崔维兹。他必须在第一基地，第二基地与盖娅之间做出银河未来由谁主导的决定：由第一基地创建的新帝国将会逞领银河进入科技昌明的世纪，却会像第一帝国那样摧毁在战争之中；由第二基地指导的新帝国将能确...","cover":"http://novel.tingroom.com/file/upload/201608/24/13-41-46-87-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/kehuan/1630","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:22:58 AM"}}
