{"id":152,"no":38,"title":"Chapter 18: The Music Festival","content":"78Lunch was in the same dining room in which they hadhad breakfast. It was full of Alphans, and with them were Trevize andPelorat, made thoroughly welcome. Bliss and Fallom ate separately,and more or less privately, in a small annex. \\n\\n There were several varieties of fish, together with soup in whichthere were strips of what might well have been boiled kid. Loaves ofbread were there for the slicing, butter and jam for the spreading. Asalad, large and diffuse, came afterward, and there was a notable absenceof any dessert, although fruit juices were passed about in apparentlyinexhaustible pitchers. Both Foundationers were forced to be abstemiousafter their heavy breakfast, but everyone else seemed to eat freely. \\n\\n \"How do they keep from getting fat?\" wondered Pelorat in a lowvoice. \\n\\n Trevize shrugged. \"Lots of physical labor, perhaps.\"It was clearly a society in which decorum at meals was not greatlyvalued. There was a miscellaneous hubbub of shouting, laughing, andthumping on the table with thick, obviously unbreakable, cups. Womenwere as loud and raucous as men, albeit in higher pitch. \\n\\n Pelorat winced, but Trevize, who now (temporarily, at least) felt notrace of the discomfort he had spoken of to Hiroko, felt both relaxedand good-natured. \\n\\n He said, \"Actually, it has its pleasant side. These are people whoappear to enjoy life and who have few, if any, cares. Weather is whatthey make it and foodiis unimaginably plentiful. This is a golden agefor them that simply continues and continues.\"He had to shout to make himself heard, and Pelorat shouted back,\"But it\u0027s so noisy.\"\"They\u0027re used to it.\"\"I don\u0027t see how they can understand each other in this riot.\"Certainly, it was all lost on the two Foundationers. The queerpronunciation and the archaic grammar and word order of the Alphanlanguage made it impossible to understand at the intense sound levels. Tothe Foundationers, it was like listening to the sounds of a zoo infright. \\n\\n It was not till after lunch that they rejoined Bliss in a smallstructure, which Trevize found to be rather inconsiderably differentfrom Hiroko\u0027s quarters, and which had been assigned them as their owntemporary living quarters. Fallom was in the second room, enormouslyrelieved to be alone, according to Bliss, and attempting to nap. \\n\\n Pelorat looked at the door-gap in the wall and said uncertainly,\"There\u0027s very little privacy here. How can we speak freely?\"\"I assure you,\" said Trevize, \"that once we pull the canvas barrieracross the door, we won\u0027t be disturbed. The canvas makes it impenetrableby all the force of social custom.\"Pelorat glanced at the high, open windows. \"We can be overheard.\"\"We need not shout. The Alphans won\u0027t eavesdrop. Even when they stoodoutside the windows of the dining room at breakfast, they remained ata respectful distance.\"Bliss smiled. \"You\u0027ve learned so much about Alphan customs in thetime you spent alone with gentle little Hiroko, and you\u0027ve gained suchconfidence in their respect for privacy. What happened?\"Trevize said, \"If you\u0027re aware that the tendrils of my mind haveundergone a change for the better and can guess the reason, I can onlyask you to leave my mind alone.\"\"You know very well that Gaia will not touch your mind under anycircumstances short of life-crisis, and you know why. Still, I\u0027m notmentally blind. I could sense what happened a kilometer away. Is thisyour invariable custom on space voyages, my erotomaniac friend?\"\"Erotomaniac? Come, Bliss. Twice on this entire trip. Twice!\"\"We were only on two worlds that had functioning human females onthem. Two out of two, and we had only been a few hours on each.\"\"You are well aware I had no choice on Comporellon.\"\"That makes sense. I remember what she looked like.\" For a few moments,Bliss dissolved in laughter. Then she said, \"Yet I don\u0027t think Hirokoheld you helpless in her mighty grip, or inflicted her irresistible willon your cringing body.\"\"Of course not. I was perfectly willing. But it was her suggestion,just the same.\"Pelorat said, with just a tinge of envy in his voice, \"Does thishappen to you all the time, Golan?\"\"Of course it must, Pel,\" said Bliss. \"Women are helplessly drawnto him.\"\"I wish that were so,\" said Trevize, \"but it isn\u0027t. And I\u0027m glad itisn\u0027t I do have other things I want to do in life. Just the same,in this case I was irresistible. After all, we were the first peoplefrom another world that Hiroko had ever seen or, apparently, that anyonenow alive on Alpha had ever seen: I gathered from things she let slip,casual remarks, that she had the rather exciting notion that I mightbe different from Alphans, either anatomically or in my technique. Poorthing. I\u0027m afraid she was disappointed.\"\"Oh?\" said Bliss. \"Were you?\"\"No,\" said Trevize. \"I have been on a number of worlds and I have hadmy experiences. And what I had discovered is that people are people andsex is sex, wherever one goes. If there are noticeable differences, theyare usually both trivial and unpleasant. The perfumes I\u0027ve encountered inmy time! I remember when a young woman simply couldn\u0027t manage unless therewas music loudly played, music that consisted of a desperate screechingsound. So she played the music and then I couldn\u0027t manage. Iassure you if it\u0027s the same old thing, then I\u0027m satisfied.\"\"Speaking of music,\" said Bliss, \"we are invited to a musicale afterdinner. A very formal thing, apparently, that is being held in ourhonor. I gather the Alphans are very proud of their music.\"Trevize grimaced. \"Their pride will in no way make the music soundbetter to our ears.\"\"Hear me out,\" said Bliss. \"I gather that their pride is that theyplay expertly on very archaic instruments. Very archaic. Wemay get some information about Earth by way of them.\"Trevize\u0027s eyebrows shot up. \"An interesting thought. And that remindsme that both of you may already have information. Janov, did you seethis Monolee that Hiroko told us about?\"\"Indeed I did,\" said Pelorat. \"I was with him for three hours andHiroko did not exaggerate. It was a virtual monologue on his part andwhen I left to come to lunch, he clung to me and would not let me gountil I promised to return whenever I could in order that I might listento him some more.\"\"And did he say anything of interest?\"\"Well, he, too like everybody else insisted that Earthwas thoroughly and murderously radioactive; that the ancestors of theAlphans were the last to leave and that if they hadn\u0027t, they would havedied. And, Golan, he was so emphatic that I couldn\u0027t help believinghim. I\u0027m convinced that Earth is dead, and that our entire search is,after all, useless.\"79Trevize sat back in his chair, staring at Pelorat,who was sitting on a narrow cot. Bliss, having risen from where she hadbeen sitting next to Pelorat, looked from one to the other. \\n\\n Finally, Trevize said, \"Let me be the judge as to whether our searchis useless or not, Janov. Tell me what the garrulous old man had to sayto you in brief, of course.\"Pelorat said, \"I took notes as Monolee spoke. It helped reinforcemy role a scholar, but I don\u0027t have to refer to them. He was quitestream-of-consciousness in his speaking. Each thing he said would remindhim of something else, but, of course, I have spent my life trying toorganize information in the search of the relevant and significant,so that it\u0027s second nature for me now to be able to condense a long andincoherent discourse \"Trevize said gently, \"Into something just as long and incoherent? Tothe point, dear Janov.\"Pelorat cleared his throat uneasily. \"Yes, certainly, old chap. I\u0027lltry to make a connected and chronological tale out of it. Earth wasthe original home of humanity and of millions of species of plants andanimals. It continued so for countless years until hyperspatial travelwas invented. Then the Spacer worlds were founded. They broke away fromEarth, developed their own cultures, and came to despise and oppressthe mother planet. \\n\\n \"After a couple of centuries of this, Earth managed to regain itsfreedom, though Monolee did not explain the exact manner in which thiswas done, and I dared not ask questions, even if he had given me achance to interrupt, which he did not, for that might merely have senthim into new byways. He did mention a culture-hero named Elijah Baley,but the references were so characteristic of the habit of attributingto one figure the accomplishments of generations that there was littlevalue in attempting to \"Bliss said, \"Yes, Pel dear, we understand that part.\"Again, Pelorat paused in midstream and reconsidered. \"Of course. Myapologies. Earth initiated a second wave of settlements, founding many newworlds in a new fashion. The new group of Settlers proved more vigorousthan the Spacers, outpaced them, defeated them, outlasted them, and,eventually, established the Galactic Empire. During the course of thewars between the Settlers and the Spacers no, not wars, for heused the word `conflict,\u0027 being very careful about that the Earthbecame radioactive.\"Trevize said, with clear annoyance, \"That\u0027s ridiculous, Janov. How cana world become radioactive? Every world is very slightlyradioactive to one degree or another from the moment of formation,and that radioactivity slowly decays. It doesn\u0027t become radioactive.\"Pelorat shrugged. \"I\u0027m only telling you what he said. And he wasonly telling me what he had heard from someone who only told himwhat he had heard and so on. It\u0027s folk-history, told and retoldover the generations, with who knows what distortions creeping in ateach retelling.\"\"I understand that, but are there no books, documents, ancienthistories which have frozen the story at an early time and which couldgive us something more accurate than the present tale?\"\"Actually, I managed to ask that question, and the answer is no. Hesaid vaguely that there were books about it in ancient times and thatthey had long ago been lost, but that what he was telling us was whathad been in those books.\"\"Yes, well distorted. It\u0027s the same story. In every world we go to,the records of Earth have, in one way or another, disappeared. Well,how did he say the radioactivity began on Earth?\"\"He didn\u0027t, in any detail. The closest he came to saying so wasthat the Spacers were responsible, but then I gathered that the Spacerswere the demons on whom the people of Earth blamed all misfortune. Theradioactivity \"A clear voice overrode him here. \"Bliss, am I a Spacer?\"Fallom was standing in the narrow doorway between the two rooms, hairtousled and the nightgown she was wearing (designed to fit Bliss\u0027s moreample proportions) having slid off one shoulder to reveal an undevelopedbreast. \\n\\n Bliss said, \"We worry about eavesdroppers outside and we forget theone inside. Now, Fallom, why do you say that?\" She rose and walkedtoward the youngster. \\n\\n Fallom said, \"I don\u0027t have what they have,\" she pointed at thetwo men, \"or what you have, Bliss. I\u0027m different. Is that because I\u0027ma Spacer?\"\"You are, Fallom,\" said Bliss soothingly, \"but little differencesdon\u0027t matter. Come back to bed.\"Fallom became submissive as she always did when Bliss willed her tobe so. She turned and said, \"Am I a demon? What is a demon?\"Bliss said over her shoulder, \"Wait one moment for me. I\u0027ll be rightback.\"She was, within five minutes. She was shaking her head. \"She\u0027ll besleeping now till I wake her. I should have done that before, I suppose,but any modification of the mind must be the result of necessity.\" Sheadded defensively, \"I can\u0027t have her brood on the differences betweenher genital equipment and ours.\"Pelorat said, \"Someday she\u0027ll have to know she\u0027s hermaphroditic.\"\"Someday,\" said Bliss, \"but not now. Go on with the story, Pel.\"\"Yes,\" said Trevize, \"before something else interrupts us.\"\"Well, Earth became radioactive, or at least its crust did. At thattime, Earth had had an enormous population that was centered in hugecities that existed for the most part underground \"\"Now, that,\" put in Trevize, \"is surely not so. It must be localpatriotism glorifying the golden age of a planet, and the details weresimply a distortion of Trantor in its golden age, when itwas the Imperial capital of a Galaxy-wide system of worlds.\"Pelorat paused, then said, \"Really, Golan, you mustn\u0027t teach memy business. We mythologists know very well that myths and legendscontain borrowings, moral lessons, nature cycles, and a hundred otherdistorting influences, and we labor to cut them away and get to whatmight be a kernel of truth. In fact, these same techniques must beapplied to the most sober histories, for no one writes the clear andapparent truth if such a thing can even be said to exist. For now,I\u0027m telling you more or less what Monolee told me, though I suppose Iam adding distortions of my own, try as I might not to do so.\"\"Well, well,\" said Trevize. \"Go on, Janov. I meant no offense.\"\"And I\u0027ve taken none. The huge cities, assuming they existed, crumbledand shrank as the radioactivity slowly grew more intense until thepopulation was but a remnant of what it had been, clinging precariously toregions that were relatively radiation-free. The population was kept downby rigid birth control and by the euthanasia of people over sixty.\"\"Horrible,\" said Bliss indignantly. \\n\\n \"Undoubtedly,\" said Pelorat, \"but that is what they did, according toMonolee, and that might be true, for it is certainly not complimentary tothe Earthpeople and it is not likely that an uncomplimentary lie wouldbe made up. The Earthpeople, having been despised and oppressed by theSpacers, were now despised and oppressed by the Empire, though here wemay have exaggeration there out of self-pity, which is a very seductiveemotion. There is the case \"\"Yes, yes, Pelorat, another time. Please go on with Earth.\"\"I beg your pardon. The Empire, in a fit of benevolence, agreed tosubstitute imported radiation-free soil and to cart away the contaminatedsoil. Needless to say, that was an enormous task which the Empire soontired of, especially as this period (if my guess is right) coincidedwith the fall of Kandar V, after which the Empire had many more thingsto worry about than Earth. \\n\\n \"The radioactivity continued to grow more intense, the populationcontinued to fall, and finally the Empire, in another fit of benevolence,offered to transplant the remnant of the population to a new world oftheir own to this world, in short. \\n\\n \"At an earlier period, it seems an expedition had stocked the ocean sothat by the time the plans for the transplantation of Earthpeople werebeing developed, there was a full oxygen atmosphere and an ample supplyof food on Alpha. Nor did any of the worlds of the Galactic Empire covetthis world because there is a certain natural antipathy to planets thatcircle stars of a binary system. There are so few suitable planets insuch a system, I suppose, that even suitable ones are rejected becauseof the assumption that there must be something wrong with them. This isa common thought-fashion. There is the well-known case, for instance,of \"\"Later with the well-known case, Janov,\" said Trevize. \"On with thetransplantation.\"\"What remained,\" said Pelorat, hurrying his words a little, \"wasto prepare a land-base. The shallowest part of the ocean was found andsediment was raised from deeper parts to add to the shallow sea-bottomand, finally, to produce the island of New Earth. Boulders and coralwere dredged up and added to the island. Land plants were seeded so thatroot systems might help make the new land firm. Again, the Empire hadset itself an enormous task. Perhaps continents were planned at first,but by the time this one island was produced, the Empire\u0027s moment ofbenevolence had passed. \\n\\n \"What was left of Earth\u0027s population was brought here. The Empire\u0027sfleets carried off its men and machinery, and they never returned. TheEarthpeople, living on New Earth, found themselves in completeisolation.\"Trevize said, \"Complete? Did Monolee say that no one from elsewherein the Galaxy has ever come here till we did?\"\"Almost complete,\" said Pelorat. \"There is nothing to come here for,I suppose, even if we set aside the superstitious distaste for binarysystems. Occasionally, at long intervals, a ship would come, as ours did,but it would eventually leave and there has never been a follow-up. Andthat\u0027s it.\"Trevize said, \"Did you ask Monolee where Earth was located?\"\"Of course I asked that. He didn\u0027t know.\"\"How can he know so much about Earth\u0027s history without knowing whereit is located?\"\"I asked him specifically, Golan, if the star that was only aparsec or so distant from Alpha might be the sun about which Earthrevolved. He didn\u0027t know what a parsec was, and I said it was a shortdistance, astronomically speaking. He said, short or long, he did notknow where Earth was located and he didn\u0027t know anyone who knew, and,in his opinion, it was wrong to try to find it. It should be allowed,he said, to move endlessly through space in peace.\"Trevize said, \"Do you agree with him?\"Pelorat shook his head sorrowfully. \"Not really. But he said thatat the rate the radioactivity continued to increase, the planet musthave become totally uninhabitable not long after the transplantationtook place and that by now it must be burning intensely so that no onecan approach.\"\"Nonsense,\" said Trevize firmly. \"A planet cannot become radioactiveand, having done so, continuously increase in radioactivity. Radioactivitycan only decrease.\"\"But Monolee is so sure of it. So many people we\u0027ve talked to onvarious worlds unite in this that Earth is radioactive. Surely,it is useless to go on.\"80Trevize drew a deep breath, then said, in a carefullycontrolled voice, \"Nonsense, Janov. That\u0027s not true.\"Pelorat said, \"Well, now, old chap, you mustn\u0027t believe somethingjust because you want to believe it.\"\"My wants have nothing to do with it. In world after world we findall records of Earth wiped out. Why should they be. wiped out if thereis nothing to hide; if Earth is a dead, radioactive world that cannotbe approached?\"\"I don\u0027t know, Golan.\"\"Yes, you do. When we were approaching Melpomenia, you said that theradioactivity might be the other side of the coin. Destroy records toremove accurate information; supply the tale of radioactivity to insertinaccurate information. Both would discourage any attempt to find Earth,and we mustn\u0027t be deluded into discouragement.\"Bliss said, \"Actually, you seem to think the nearby star is Earth\u0027ssun. Why, then, continue to argue the question of radioactivity? Whatdoes it matter? Why not simply go to the nearby star and see if it isEarth, and, if so, what it is like?\"Trevize said, \"Because those on Earth must be, in their way,extraordinarily powerful, and I would prefer to approach with someknowledge of the world and its inhabitants. As it is, since I continue toremain ignorant of Earth, approaching it is dangerous. It is my notionthat I leave the rest of you here on Alpha and that I proceed to Earthby myself. One life is quite enough to risk.\"\"No, Golan,\" said Pelorat earnestly. \"Bliss and the child might waithere, but I must go with you. I have been searching for Earth sincebefore you were born and I cannot stay behind when the goal is so close,whatever dangers might threaten.\"\"Bliss and the child will not wait here,\" said Bliss. \"Iam Gaia, and Gaia can protect us even against Earth.\"\"I hope you\u0027re right,\" said Trevize gloomily, \"but Gaia could notprevent the elimination of all early memories of Earth\u0027s role in itsfounding.\"\"That was done in Gaia\u0027s early history when it was not yet wellorganized, not yet advanced. Matters are different now.\"\"I hope that is so. Or is it that you have gained informationabout Earth this morning that we don\u0027t have? I did ask that you speakto some of the older women that might be available here.\"\"And so I did.\"Trevize said, \"And what did you find out?\"\"Nothing about Earth. There is a total blank there.\"\"Ah.\"\"But they are advanced biotechnologists.\" ,\"Oh?\"\"On this small island, they have grown and tested innumerable strainsof plants and animals and designed a suitable ecological balance, stableand self-supporting, despite the few species with which they began. Theyhave improved on the ocean life that they found when they arrived here afew thousand years ago, increasing their nutritive value and improvingtheir taste. It is their biotechnology that has made this world such acornucopia of plenty. They have plans for themselves, too.\"\"What kind of plans?\"Bliss said, \"They know perfectly well they cannot reasonably expect toexpand their range under present circumstances, confined as they are tothe one small patch of land that exists on their world, but they dreamof becoming amphibious.\"\"Of becoming what ?\"\"Amphibious. They plan to develop gills in addition to lungs. Theydream of being able to spend substantial periods of time underwater; offinding shallow regions and building structures on the ocean bottom. Myinformant was quite glowing about it but she admitted that this had beena goal of the Alphans for some centuries now and that little, if any,progress has been made.\"Trevize said, \"That\u0027s two fields in which they might be more advancedthan we are; weather control and biotechnology. I wonder what theirtechniques are.\"\"We\u0027d have to find specialists,\" said Bliss, \"and they might not bewilling to talk about it.\"Trevize said, \"It\u0027s not our primary concern here,but it would clearly pay the Foundation to attempt to learn from thisminiature world.\"Pelorat said, \"We manage to control the weather fairly well onTerminus, as it is.\"\"Control is good on many worlds,\" said Trevize, \"but always it\u0027s amatter of the world as a whole. Here the Alphans control the weatherof a small portion of the world and they must have techniques we don\u0027thave. Anything else, Bliss?\"\"Social invitations. These appear to be a holiday-making people,in whatever time they can take from farming and fishing. Afterdinner, tonight there\u0027ll be a music festival. I told you aboutthat already. Tomorrow, during the day, there will be a beachfestival. Apparently, all around the rim of the island there will bea congregation of everyone who can get away from the fields in orderthat they might enjoy the water and celebrate the sun, since it will beraining the next day. In the morning, the fishing fleet will come back,beating the rain, and by evening there will be a food festival, samplingthe catch.\"Pelorat groaned. \"The meals are ample enough as it is. What would afood festival be like?\"\"I gather that it will feature not quantity, but variety. In anycase, all four of us are invited to participate in all the festivals,especially the music festival tonight.\"\"On the antique instruments?\" asked Trevize. \\n\\n \"That\u0027s right.\"\"What makes them antique, by the way? Primitive computers?\"\"No, no. That\u0027s the point. It isn\u0027t electronic music at all, butmechanical. They described it to me. They scrape strings, blow in tubes,and bang on surfaces.\"\"I hope you\u0027re making that up,\" said Trevize, appalled. \\n\\n \"No, I\u0027m not. And I understand that your Hiroko will be blowing onone of the tubes I forget its name and you ought to be ableto endure that.\"\"As for myself,\" said Pelorat, \"I would love to go. I know very littleabout primitive music and I would like to hear it.\"\"She is not `my Hiroko,\u0027\" said Trevize coldly. \"But are the instrumentsof the type once used on Earth, do you suppose?\"\"So I gathered,\" said Bliss. \"At least the Alphan women said theywere designed long before their ancestors came here.\"\"In that case,\" said Trevize, \"it may be worth listening to allthat scraping, tootling, and banging, for whatever information it mightconceivably yield concerning Earth.\"81Oddly enough, it was Fallom who was most excited atthe prospect of a musical evening. She and Bliss had bathed in thesmall outhouse behind their quarters. It had a bath with running water,hot and cold (or, rather, warm and cool), a washbowl, and a commode. Itwas totally clean and usable and, in the late afternoon sun, it was evenwell lit and cheerful. \\n\\n As always, Fallom was fascinated with Bliss\u0027s breasts and Bliss wasreduced to saying (now that Fallom understood Galactic) that on herworld that was the way people were. To which Fallom said, inevitably,\"Why?\" and Bliss, after some thought, deciding there was no sensibleway of answering, returned the universal reply, \"Because!\"When they were done, Bliss helped Fallom put on the undergarmentsupplied them by the Alphans and worked out the system whereby theskirt went on over it. Leaving Fallom unclothed from the waist up seemedreasonable enough. She herself, while making use of Alphan garments belowthe waist (rather tight about the hips), put on her own blouse. It seemedsilly to be too inhibited to expose breasts in a society where all womendid, especially since her own were not large and were as shapely as anyshe had seen but there it was. \\n\\n The two men took their turn at the outhouse next, Trevize mutteringthe usual male complaint concerning the time the women had taken. \\n\\n Bliss turned Fallom about to make sure the skirt would hold in placeover her boyish hips and buttocks. She said, \"It\u0027s a very pretty skirt,Fallom. Do you like it?\"Fallom stared at it in a mirror and said, \"Yes, I do. Won\u0027t I be coldwith nothing on, though?\" and she ran her hands down her bare chest. \\n\\n \"I don\u0027t think so, Fallom. It\u0027s quite warm on this world.\"\" You have something on.\"\"Yes, I do. That\u0027s how it is on my world. Now, Fallom, we\u0027re going tobe with a great many Alphans during dinner and afterward. Do you thinkyou can bear that?\"Fallom looked distressed, and Bliss went on, \"I will sit on your rightside and I will hold you. Pel will sit on the other side, and Trevizewill sit across the table from you. We won\u0027t let anyone talk to you,and you won\u0027t have to talk to anyone.\"\"I\u0027ll try, Bliss,\" Fallom piped in her highest tones. \\n\\n \"Then afterward,\" said Bliss, \"some Alphans will make music for usin their own special way. Do you know what music is?\" She hummed in thebest imitation of electronic harmony that she could. \\n\\n Fallom\u0027s face lit up. \"You mean \" The last word was inher own language, and she burst into song. \\n\\n Bliss\u0027s eyes widened. It was a beautiful tune, even though it was wild,and rich in trills. \"That\u0027s right. Music,\" she said. \\n\\n Fallom said excitedly, \"Jemby made\" she hesitated, then decidedto use the Galactic word \"music all the time. It made music on a \" Again a word in her own language. \\n\\n Bliss repeated the word doubtfully, \"On a feeful?\"Fallom laughed. \"Not feeful, \"With both words juxtaposed like that, Bliss could hear the difference,but she despaired of reproducing the second. She said, \"What does itlook like?\"Fallom\u0027s as yet limited vocabulary in Galactic did not suffice for anaccurate description, and her gestures did not produce any shape clearlyin Bliss\u0027s mind. \\n\\n \"He showed me how to use the \" Fallom said proudly. \"Iused my fingers just the way Jemby did, but it said that soon I wouldn\u0027thave to.\"\"That\u0027s wonderful, dear,\" said Bliss. \"After dinner, we\u0027ll see ifthe Alphans are as good as your Jemby was.\"Fallom\u0027s eyes sparkled and pleasant thoughts of what was to followcarried her through a lavish dinner despite the crowds and laughterand noise all about her. Only once, when a dish was accidentally upset,setting off shrieks of excitement fairly close to them, did Fallom lookfrightened, and Bliss promptly held her close in a warm and protectivehug. \\n\\n \"I wonder if we can arrange to eat by ourselves,\" she muttered toPelorat. \"Otherwise, we\u0027ll have to get off this world. It\u0027s bad enougheating all this Isolate animal protein, but I must be ableto do it in peace.\"\"It\u0027s only high spirits,\" said Pelorat, who would have endured anythingwithin reason that he felt came under the heading of primitive behaviorand beliefs. \\n\\n And then the dinner was over, and the announcement came thatthe music festival would soon begin. \\n\\n 82The hall in which the music festival was to be heldwas about as large as the dining room, and there were folding seats(rather uncomfortable, Trevize found out) for about a hundred fiftypeople. As honored guests, the visitors were led to the front row,and various Alphans commented politely and favorably on their clothes. \\n\\n Both men were bare above the waist and Trevize tightened his abdominalmuscles whenever he thought of it and stared down, on occasion, withcomplacent self-admiration at his dark-haired chest. Pelorat, in hisardent observation of everything about him, was indifferent to his ownappearance. Bliss\u0027s blouse drew covert stares of puzzlement but nothingwas said concerning it. \\n\\n Trevize noted that the hall was only about half-full and that thelarge majority of the audience were women, since, presumably, so manymen were out to sea. \\n\\n Pelorat nudged Trevize and whispered, \"They have electricity.\"Trevize looked at the vertical tubes on the walls, and at others onthe ceiling. They were softly luminous. \\n\\n \"Fluorescence,\" he said. \"Quite primitive.\"\"Yes, but they do the job, and we\u0027ve got those things in our roomsand in the outhouse. I thought they were just decorative. If we can findout how to work them, we won\u0027t have to stay in the dark.\"Bliss said irritably, \"They might have told us.\"Pelorat said, \"They thought we\u0027d know; that anyone would know.\"Four women now emerged from behind screens and seated themselves ina group in the space at the front. Each held an instrument of varnishedwood of a similar shape, but one that was not easily describable. Theinstruments were chiefly different in size. One was quite small, twosomewhat larger, and the fourth considerably larger. Each woman alsoheld a long rod in the other hand. \\n\\n The audience whistled softly as they came in, in response to whichthe four women bowed. Each had a strip of gauze bound fairly tightlyacross the breasts as though to keep them from interfering with theinstrument. \\n\\n Trevize, interpreting the whistles as signs of approval, or of pleasedanticipation, felt it only polite to add his own. At that, Fallom added atrill that was far more than a whistle and that was beginning to attractattention when pressure from Bliss\u0027s hand stopped her. \\n\\n Three of the women, without preparation, put their instruments undertheir chins, while the largest of the instruments remained between thelegs of the fourth woman and rested on the floor. The long rod in theright hand of each was sawed across the strings stretching nearly thelength of the instrument, while the fingers of the left hand shiftedrapidly along the upper ends of those strings. \\n\\n This, thought Trevize, was the \"scraping\" he had expected, butit didn\u0027t sound like scraping at all. There was a soft and melodioussuccession of notes; each instrument doing something of its own and thewhole fusing pleasantly. \\n\\n It lacked the infinite complexity of electronic music (\"real music,\" asTrevize could not help but think of it) and there was a distinct samenessto it. Still, as time passed, and his ear grew accustomed to this oddsystem of sound, he began to pick out subtleties. It was wearisome tohave to do so, and he thought, longingly, of the clamor and mathematicalprecision and purity of the real thing, but it occurred to him that ifhe listened to the music of these simple wooden devices long enough hemight well grow to like it. \\n\\n It was not till the concert was some forty-five minutes old that Hirokostepped out. She noticed Trevize in the front row at once and smiled athim. He joined the audience in the soft whistle of approval with a wholeheart. She looked beautiful in a long and most elaborate skirt, a largeflower in her hair, and nothing at all over her breasts since (apparently)there was no danger of their interference with the instrument. \\n\\n Her instrument proved to be a dark wooden tube about two thirds of ameter long and nearly two centimeters thick. She lifted the instrumentto her lips and blew across an opening near one end, producing a thin,sweet note that wavered in pitch as her fingers manipulated metal objectsalong the length of the tube. \\n\\n At the first sound, Fallom clutched at Bliss\u0027s arm and said, \"Bliss,that\u0027s a \" and the word sounded like \"feeful\" to Bliss. \\n\\n Bliss shook her head firmly at Fallom, who said, in a lower voice,\"But it is!\"Others were looking in Fallom\u0027s direction. Bliss put her hand firmlyover Fallom\u0027s mouth, and leaned down to mutter an almost subliminallyforceful \"Quiet!\" into her ear. \\n\\n Fallom listened to Hiroko\u0027s playing quietly thereafter, but herfingers moved spasmodically, as though they were operating the objectsalong the length of the instrument. \\n\\n The final player in the concert was an elderly man who had aninstrument with fluted sides suspended over his shoulders. He pulled itin and out while one hand flashed across a succession of white and darkobjects at one end, pressing them down in groups. \\n\\n Trevize found this sound particularly wearing, rather barbaric,and unpleasantly like the memory of the barking of the dogs onAurora not that the sound was like barking, but the emotions it gaverise to were similar. Bliss looked as though she would like to place herhands over her ears, and Pelorat had a frown on his face. Only Fallomseemed to enjoy it, for she was tapping her foot lightly, and Trevize,when he noticed that, realized, to his own surprise, that there was abeat to the music that matched Fallom\u0027s footfall. \\n\\n It came to an end at last and there was a perfect storm of whistling,with Fallom\u0027s trill clearly heard above it all. \\n\\n Then the audience broke up into small conversational groups and becameas loud and raucous as Alphans seemed to be on all public occasions. Thevarious individuals who had played in the concert stood about in front ofthe room and spoke to those people who came up to congratulate them. \\n\\n Fallom evaded Bliss\u0027s grasp and ran up to Hiroko. \\n\\n \"Hiroko,\" she cried out, gaspingly. \"Let me see the \"\"The what, dear one?\" said Hiroko. \\n\\n \"The thing you made the music with.\"\"Oh.\" Hiroko laughed. \"That\u0027s a flute, little one.\"\"May I see it?\"\"Well.\" Hiroko opened a case and took out the instrument. It was inthree parts, but she put it together quickly, held it toward Fallom withthe mouthpiece near her lips, and said, \"There, blow thou thy breathacross this.\"\"I know. I know,\" said Fallom eagerly, and reached for the flute. \\n\\n Automatically, Hiroko snatched it away and held it high. \"Blow, child,but touch not.\"Fallom seemed disappointed. \"May I just look at it, then? I won\u0027ttouch it.\"\"Certainly, dear one.\"She held out the flute again and Fallom stared at it earnestly. \\n\\n And then, the fluorescent lighting in the room dimmed very slightly,and the sound of a flute\u0027s note, a little uncertain and wavering, madeitself heard. \\n\\n Hiroko, in surprise, nearly dropped the flute, and Fallom cried out,\"I did it. I did it. Jemby said someday I could do it.\"Hiroko said, \"Was it thou that made the sound?\"\"Yes, I did. I did.\"\"But how didst thou do so, child?\"Bliss said, red with embarrassment, \"I\u0027m sorry, Hiroko. I\u0027ll takeher away.\"\"No,\" said Hiroko. \"I wish her to do it again.\"A few of the nearest Alphans had gathered to watch. Fallom furrowedher brow as though trying hard. The fluorescents dimmed rather more thanbefore, and again there was the note of the flute, this time pure andsteady. Then it became erratic as the metal objects along the length ofthe flute moved of their own accord. \\n\\n \"It\u0027s a little different from the \" Fallom said, alittle breathlessly, as though the breath that had been activating theflute had been her own instead of power-driven air. \\n\\n Pelorat said to Trevize, \"She must be getting the energy from theelectric current that feeds the fluorescents.\"\"Try again,\" said Hiroko in a choked voice. \\n\\n Fallom closed her eyes. The note was softer now and under firmercontrol. The flute played by itself, maneuvered by no fingers, but movedby distant energy, transduced through the still immature lobes of Fallom\u0027sbrain. The notes which began as almost random settled into a musicalsuccession and now everyone in the hall had gathered around Hiroko andFallom, as Hiroko held the flute gently with thumb and forefinger ateither end, and Fallom, eyes closed, directed the current of air andthe movement of the keys. \\n\\n \"It\u0027s the piece I played,\" whispered Hiroko. \\n\\n \"I remember it,\" said Fallom, nodding her head slightly, trying notto break her concentration. \\n\\n \"Thou didst not miss a note,\" said Hiroko, when it was done. \\n\\n \"But it\u0027s not right, Hiroko. You didn\u0027t do it right.\"Bliss said, \"Fallom! That\u0027s not polite. You mustn\u0027t \"\"Please,\" said Hiroko peremptorily, \"do not interfere. Why is it notright, child?\"\"Because I would play it differently.\"\"Show me, then.\"Again the flute played, but in more complicated fashion, for the forcesthat pushed the keys did so more quickly, in more rapid succession andin more elaborate combinations than before. The music was more complex,and infinitely more emotional and moving. Hiroko stood rigid and therewas not a sound to be heard anywhere in the room. \\n\\n Even after Fallom had finished playing, there was not a sound untilHiroko drew a deep breath and said, \"Little one, hast thou ever playedthat before?\"\"No,\" said Fallom, \"before this I could only use my fingers, andI can\u0027t do my fingers like that.\" Then, simply and with no trace ofvaunting, \"No one can.\"\"Canst thou play anything else?\"\"I can make something up.\"\"Dost thou mean improvise?\"Fallom frowned at the word and looked toward Bliss. Bliss nodded andFallom said, \"Yes.\"\"Please do so, then,\" said Hiroko. \\n\\n Fallom paused and thought for a minute or two, then began slowly,in a very simple succession of notes, the whole being rather dreamy. Thefluorescent lights dimmed and brightened as the amount of power exertedintensified and faded. No one seemed to notice, for it seemed to be theeffect of the music rather than the cause, as though a ghostly electricalspirit were obeying the dictates of the sound waves. \\n\\n The combination of notes then repeated itself a bit more loudly, thena bit more complexly, then in variations that, without ever losing theclearly heard basic combination, became more stirring and more excitinguntil it was almost impossible to breathe. And finally, it descendedmuch more rapidly than it had ascended and did so with the effect ofa swooping dive that brought the listeners to ground level even whilethey still retained the feeling that they were high in the air. \\n\\n There followed sheer pandemonium that split the air, and even Trevize,who was used to a totally different kind of music, thought sadly,\"And now I\u0027ll never hear that again.\"When a most reluctant quiet had returned, Hiroko held out herflute. \"Here, Fallom, this is thine!\"Fallom reached for it eagerly, but Bliss caught hold of the child\u0027soutstretched arm and said, \"We can\u0027t take it, Hiroko. It\u0027s a valuableinstrument.\"\"I have another, Bliss. Not quite as good, but that is how it shouldbe. This instrument belongeth to the person who playeth it best. Neverhave I heard such music and it would be wrong for me to own an instrumentI cannot use to full potential. Would that I knew how the instrumentcould be made to play without being touched.\"Fallom took the flute and, with an expression of deep content, heldit tightly to her chest. \\n\\n 83Each of the two rooms of their quarters were lit by onefluorescent light. The outhouse had a third. The lights were dim, and wereuncomfortable to read by, but at least the rooms were no longer dark. \\n\\n Yet they now lingered outside. The sky was full of stars, somethingthat was always fascinating to a native of Terminus, where the night skywas all but starless and in which only the faint foreshortened cloud ofthe Galaxy was prominent. \\n\\n Hiroko had accompanied them back to their chambers for fear they wouldget lost in the dark, or that they would stumble. All the way back, sheheld Fallom\u0027s hand, and then, after lighting the fluorescents for them,remained outside with them, still clutching at the youngster. \\n\\n Bliss tried again, for it was clear to her that Hiroko was in a stateof a difficult conflict of emotions. \"Really, Hiroko, we cannot takeyour flute.\"\"No, Fallom must have it.\" But she seemed on edge just the same. \\n\\n Trevize continued to look at the sky. The night was truly dark,a darkness that was scarcely affected by the trickle of light fromtheir own chambers; and much less so by the tiny sparks of other housesfarther off. \\n\\n He said, \"Hiroko, do you see that star that is so bright? What isit called?\"Hiroko looked up casually and said, with no great appearance ofinterest, \"That\u0027s the Companion.\"\"Why is it called that?\"\"It circleth our sun every eighty Standard Years. It is an eveningstar at this time of year. Thou canst see it in daytime, too, when itlieth above the horizon.\"Good, thought Trevize. She\u0027s not totally ignorant of astronomy. Hesaid, \"Do you know that Alpha has another companion, a very small, dimone that\u0027s much much farther away than that bright star. You can\u0027t seeit without a telescope.\" (He hadn\u0027t seen it himself, hadn\u0027t botheredto search for it, but the ship\u0027s computer had the information in itsmemory banks.)She said indifferently, \"We were told that in school.\"\"But now what about that one? You see those six stars in a zigzagline?\"Hiroko said, \"That is Cassiopeia.\"\"Really?\" said Trevize, startled. \"Which star?\"\"All of them. The whole zigzag. It is Cassiopeia.\"\"Why is it called that?\"\"I lack the knowledge. I know nothing of astronomy, respectedTrevize.\"\"Do you see the lowermost star in the zigzag, the one that\u0027s brighterthan the other stars? What is that?\"\"It is a star. I know not its name.\"\"But except for the two companion stars, it\u0027s the closest of all thestars to Alpha. It is only a parsec away.\"Hiroko said, \"Sayest thou so? I know that not.\"\"Might it not be the star about which Earth revolves?\"Hiroko looked at the star with a faint flash of interest. \"I knownot. I have never heard any person say so.\"\"Don\u0027t you think it might be?\"\"How can I say? None knoweth where Earth might be. I I mustleave thee, now. I will be taking my shift in the fields tomorrowmorning before the beach festival. I\u0027ll see you all there, right afterlunch. Yes? Yes?\"\"Certainly, Hiroko.\"She left suddenly, half-running in the dark. Trevize looked after her,then followed the others into the dimly lit cottage. \\n\\n He said, \"Can you tell whether she was lying about Earth, Bliss?\"Bliss shook her head. \"I don\u0027t think she was. She is under enormoustension, something I was not aware of until after the concert. It existedbefore you asked her about the stars.\"\"Because she gave away her flute, then?\"\"Perhaps. I can\u0027t tell.\" She turned to Fallom. \"Now, Fallom, I wantyou to go into your room. When you\u0027re ready for bed, go to the outhouse,use the potty, then wash your hands, your face, and your teeth.\"\"I would like to play the flute, Bliss.\"\"Just for a little while, and very quietly. Do you understand,Fallom? And you must stop when I tell you to.\"\"Yes, Bliss.\"The three were now alone; Bliss in the one chair and the men sittingeach on his cot. \\n\\n Bliss said, \"Is there any point in staying on this planet anylonger?\"Trevize shrugged. \"We never did get to discuss Earth in connectionwith the ancient instruments, and we might find something there. Itmight also pay to wait for the fishing fleet to return. The men mightknow something the stay-at-homes don\u0027t.\"\" Very unlikely, I think,\" said Bliss. \"Are you sure it\u0027snot Hiroko\u0027s dark eyes that hold you?\"Trevize said impatiently, \"I don\u0027t understand, Bliss. What have youto do with what I choose to do? Why do you seem to arrogate to yourselfthe right of sitting in moral judgment on me?\"\"I\u0027m not concerned with your morals. The matter affects ourexpedition. You want to find Earth so that you can finally decidewhether you are right in choosing Galaxia over Isolate worlds. I wantyou to so decide. You say you need to visit Earth to make the decisionand you seem to be convinced that Earth revolves about that bright starin the sky. Let us go there, then. I admit it would be useful to havesome information about it before we go, but it is clear to me that theinformation is not forthcoming here. I do not wish to remain simplybecause you enjoy Hiroko.\"\"Perhaps we\u0027ll leave,\" said Trevize. \"Let me think about it, andHiroko will play no part in my decision, I assure you.\"Pelorat said, \"I feel we ought to move on to Earth, if only to seewhether it is radioactive or not. I see no point in waiting longer.\"\"Are you sure it\u0027s not Bliss\u0027s dark eyes that drive you?\" saidTrevize, a bit spitefully. Then, almost at once, \"No, I take that back,Janov. I was just being childish. Still this is a charming world,quite apart from Hiroko, and I must say that under other circumstances,I would be tempted to remain indefinitely. Don\u0027t you think, Bliss,that Alpha destroys your theory about Isolates?\"\"In what way?\" asked Bliss. \\n\\n \"You\u0027ve been maintaining that every truly isolated world turnsdangerous and hostile.\"\"Even Comporellon,\" said Bliss evenly, \"which is rather out of themain current of Galactic activity for all that it is, in theory, anAssociated Power of the Foundation Federation.\"\"But not Alpha. This world is totally isolated, butcan you complain of their friendliness and hospitality? They feed us,clothe us, shelter us, put on festivals in our honor, urge us to stayon. What fault is there to find with them?\"\"None, apparently. Hiroko even gives you her body.\"Trevize said angrily, \"Bliss, what bothers you about that? She didn\u0027tgive me her body. We gave each other our bodies. It was entirely mutual,entirely pleasurable. Nor can you say that you hesitate to give yourbody as it suits you.\"\"Please, Bliss,\" said Pelorat. \"Golan is entirely right. There is noreason to object to his private pleasures.\"\"As long as they don\u0027t affect us,\" said Bliss obdurately. \\n\\n \"They do not affect us,\" said Trevize. \"We will leave, I assure you. Adelay to search further for information will not be long.\"\"Yet I don\u0027t trust Isolates,\" said Bliss, \"even when they comebearing gifts.\"Trevize flung up his arms. \"Reach a conclusion, then twist the evidenceto fit. How like a \"\"Don\u0027t say it,\" said Bliss dangerously. \"I am not a woman. I amGaia. It is Gaia, not I, who is uneasy.\"\"There is no reason to \" And at that point there was a scratchingat the door. \\n\\n Trevize froze. \"What\u0027s that?\" he said, in a low voice. \\n\\n Bliss shrugged lightly. \"Open the door and see. You tell us this isa kindly world that offers no danger.\"Nevertheless, Trevize hesitated, until a soft voice from the otherside of the door called out softly, \"Please. It is I!\"It was Hiroko\u0027s voice. Trevize threw the door open. \\n\\n Hiroko entered quickly. Her cheeks were wet. \\n\\n \"Close the door,\" she gasped. \\n\\n \"What is it?\" asked Bliss. \\n\\n Hiroko clutched at Trevize. \"I could not stay away. I tried, but Iendured it not. Go thou, and all of you. Take the youngster with youquickly. Take the ship away from Alpha while it isyet dark.\"\"But why?\" asked Trevize. \\n\\n \"Because else wilt thou die; and all of you.\"84The three Outworlders stared frozenly at Hiroko fora long moment. Then Trevize said, \"Are you saying your people willkill us?\"Hiroko said, as the tears rolled down her cheeks, \"Thou art already onthe road to death, respected Trevize. And the others with you. Longago, those of learning devised a virus, harmless to us, but deadlyto Outworlders. We have been made immune.\" She shook Trevize\u0027s arm indistraction. \"Thou art infected.\"\"How?\"\"When we had our pleasure. It is one way.\"Trevize said, \"But I feel entirely well.\"\"The virus is as yet inactive. It will be made active when the fishingfleet returns. By our laws, all must decide on such a thing eventhe men. All will surely decide it must be done, and we keep you heretill that time, two mornings hence. Leave now while it is yet dark andnone suspects.\"Bliss said sharply, \"Why do your people do this?\"\"For our safety. We are few and have much. We do not wish Outworldersto intrude. If one cometh and then reporteth our lot, others will come,and so when, once in a long while, a ship arriveth, we must make certainit leaveth not.\"\"But then,\" said Trevize, \"why do you warn us away?\"\"Ask not the reason. Nay, but I will tell you, since I hear itagain. Listen \"From the next room, they could hear Fallom playing softly andinfinitely sweetly. \\n\\n Hiroko said, \"I cannot bear the destruction of that music, for theyoung one will also die.\"Trevize said sternly, \"Is that why you gave the flute toFallom? Because you knew you would have it once again when she wasdead?\"Hiroko looked horrified. \"Nay, that was not in my mind. And when itcame to mind at length, I knew it must not be done. Leave with the child,and with her, take the flute that I may never see it more. Thou wilt besafe back in space and, left inactive, the virus now in thy body willdie after a time. In return, I ask that none of you ever speak of thisworld, that none else may know of it.\"\"We will not speak of it,\" said Trevize. \\n\\n Hiroko looked up. In a lower voice, she said, \"May I not kiss theeonce ere thou leavest?\"Trevize said, \"No. I have been infected once and surely that isenough.\" And then, a little less roughly, he added, \"Don\u0027t cry. Peoplewill ask why you are crying and you\u0027ll be unable to reply. I\u0027llforgive what you did to me in view of your present effort to save us.\"Hiroko straightened, carefully wiped her cheeks with the back ofher hands, took a deep breath, and said, \"I thank thee for that,\" andleft quickly. \\n\\n Trevize said, \"We will put out the light, and we will wait awhile,and then we will leave. Bliss, tell Fallom to stop playing herinstrument. Remember to take the flute, of course. Then we willmake our way to the ship, if we can find it in the dark.\"\"I will find it,\" said Bliss. \"Clothing of mine is on board and,however dimly, that, too, is Gaia. Gaia will have no trouble findingGaia.\" And she vanished into her room to collect Fallom. \\n\\n Pelorat said, \"Do you suppose that they\u0027ve managed to damage our shipin order to keep us on the planet?\"\"They lack the technology to do it,\" said Trevize grimly. When Blissemerged, holding Fallom by the hand, Trevize put out the lights. \\n\\n They sat quietly in the dark for what seemed half the night, andmight have been half an hour. Then Trevize slowly and silently openedthe door. The sky seemed a bit more cloudy, but stars shone. High in thesky now was Cassiopeia, with what might be Earth\u0027s sun burning brightlyat its lower tip. The air was still and there was no sound. \\n\\n Carefully, Trevize stepped out, motioning the others to follow. Oneof his hands dropped, almost automatically, to the butt of his neuronicwhip. He was sure he would not have to use it, but Bliss took the lead, holding Pelorat\u0027s hand, who heldTrevize\u0027s. Bliss\u0027s other hand held Fallom, and Fallom\u0027s other hand heldthe flute. Feeling gently with her feet in the nearly total darkness,Bliss guided the others toward where she felt, very weakly, the Gaia-nessof her clothing on board the Far Star . \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/1630/48258.html","bookId":5,"book":{"id":5,"title":" Foundation and Earth ","description":" 498...","cover":"http://novel.tingroom.com/file/upload/201608/24/13-41-46-87-1.jpg","type":"","link":"http://novel.tingroom.com/kehuan/1630","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:22:58 AM"}}
