{"id":44062,"no":33,"title":"XXXIII TORCH AND SWORD","content":"\"Now give me your hand, Miss Camille; now jump!\" So twice and once again the rivulet was passed which ran from the lily-pond, she and I leading all the others on the return from the woodland afternoon walk. We turned and faced away from the declining sun and across the clear pool to where its upper end, dotted with lily-pads, lay in a deep recess of the woods. There were green and purple garlands of wild passion-flower around her hat and about the white and blue fabrics at her waist. At the head of the pond, with Ferry beside her, stood black-haired Cécile canopied by overhanging boughs, her hat bedecked with the red spikes of the Indian-shot and wound with orange masses of love-vine. Nearer to us around the shore was Estelle of the red-brown hair and red-brown eyes and brows and lashes, whose cheek seemed always to glow with ever rising but never confessed emotion; and with her walked Gholson. Near the waterside also, but farthest up the path, came Miss Harper and Charlotte Oliver. Harry was not with us. The settlement of his trouble with Gholson awaited his return out of the region north of us, whither Ferry had suggested his riding on an easy reconnaissance. Camille and I were just turning again, when there came abruptly into our scene the last gallant show of martial finery any of us ever saw until the war was over and there was nothing for our side to make itself fine for. On the road from the house we heard a sound of galloping, and the next moment General Austin and his entire staff (less only Harry) reined up at the edge of the pond, ablaze with all the good clothes they could muster and betraying just enough hard usage to give a stirring show of the war\u0027s heroic reality. The General, on a beautiful cream-colored horse, wore long yellow gauntlets and a yellow sash; from throat to waist the sunlight glistened upon the over-abundant gold lace of his new uniform, his legs were knee-deep in shining boots, and his soft gray hat was looped up on one side and plumed according to Regulations with one drooping ostrich feather. Behind halted in pleasing confusion captains and captains, flashing with braids, bars, buckles, buttons, bands, sword-knots, swords and brave eyes, and gaily lifting hats and caps, twice, and twice again, and once more, to the ladies--God bless them! Major Harper, the oldest, most refined and most soldierly of them all, was also the handsomest. Old Dismukes was with them; burly, bushy, dingy, on a huge roan charger. Camille asked me who he was, and I was about to reply that he was a bloodthirsty brute without a redeeming trait, when he lifted his shaggy brows at me and smiled, and as I smiled back I told her he was our senior colonel, rough at times, but the bravest of the brave. Meantime the General rode forward over a stretch of shallow water, Ned Ferry ran back along the margin to meet him, and at the saddlebow they spoke a moment together privately, while at more distance but openly to us all Major Harper informed his sister that with one night\u0027s camp and another day\u0027s dust the brigade would be down in Louisiana. Camille turned upon me and hurrahed, the Arkansas colonel smiled upon her approvingly, the ladies all waved, the General lifted his plumed hat, faced about, passed through his turning cavalcade and drew it after him at a gallop. Our promenaders hurried into close order and with quick step and eager converse we moved toward the house. In raptures scintillant with their own beauty the three Harper girls inflated each item of the day\u0027s news and the morrow\u0027s outlook, and it was almost as pretty to see Miss Harper\u0027s keen black eyes and loving-tolerant smile go back and forth from Camille to Estelle, from Estelle to Cécile, and round again, as each maiden added some new extravagance to the glad vaunting of the last, and looked, for confirmation, to the gallant who toiled to keep her under her parasol. Suddenly the three girls broke into song with an adaptation of \"Oh, carry me back\" which substituted \"Louisiana\" for \"Virginia,\" but whose absurd quaverings I will not betray in words to a generation that never knew the frantic times to which they belonged. I felt a shamefacedness for them even then, yet when I glanced behind, Miss Harper was singing with us in the most exalted earnest. We had nearly reached the field-gate, the big white one on the highway, and were noting that the dust of the General and his retinue had barely vanished from the southern stretch of the road, when one feminine voice said \"What\u0027s that?\" another exclaimed \"See yonder!\" and Miss Harper cried \"Why, gentlemen, somebody\u0027s house is burning!\" Beyond the grove and the fields north of it, and beyond their farther bound of trees, in the northwest, was rising and unfolding into the peaceful Sabbath heavens a massive black column of the peculiar heavy smoke made by the burning of baled and stored cotton. We ran, two and two, into the road and up toward the grove-gate. \"Don\u0027t stumble,\" I warned Camille as she looked back to see if any one besides me was holding his partner\u0027s hand. Inside the gate we paused, we two, still hand in hand. Her brown hair had shaken low upon her temples in two voluptuous masses between which she lifted her eyes to mine, my hand tightened on hers, and hers gave a little spasm of its own. \"Oh, Dick!\" she whispered; but before I could rally from the blissful shock of it to reply, her face changed distressfully, and pointing beyond me, she drank a great breath, and cried, \"Look!\" Sure enough, out there on the sky-line, in the north-east this time, another column of smoke was lifting its first billow over the tree-tops. \"Oh, Dick!\" she exclaimed, in beautiful alarm, \"what does it mean?\" \"It means the Yankees,--love,\" I said, and when she gasped her dismay without letting on to have heard the last word, I felt that fires were cheap at any price. \"There are others there besides Yankees,\" said Gholson to the general company as they joined us; \"Yankees have got more sense than to start fires ahead of their march.\" On the same instant with Ned Ferry I sprang half-way to the top of the grove fence and peered out across road and fields upon the farthest point in line with the second fire. There we saw two horsemen reconnoitring, one a very commanding figure, the other mean enough. Ferry used his glass, but no glass was needed to tell either of us that Gholson\u0027s reckoning was true; those two were not Federals. The ladies flew to the house and the rest of us to the stable. In its door Ferry stopped to look back upon the road while Gholson and I darted in, but now he, too, sprang to his horse\u0027s side. \"How many, Lieutenant?\" I cried, as the three of us saddled up. \"About a hundred; same we saw yesterday; captain at the rear; that means our fellows are close behind them.\" For a moment more I could hear the thunder of their speeding column; then the grove seemed to swallow it up, and the stillness was grim. \"Come on!\" cried Ferry, swinging up, and after him we sprang. \"They\u0027ve dismounted on the far edge of the grove,\" said Gholson to me as we rode abreast, with Ferry a length ahead; \"they\u0027ll form line on each side the road at right angles to it!\" and again he was right. Ferry led northeastward, but hardly had we made half a dozen leaps when he waved me to a near corner of the flower-garden palings and I saw Miss Harper beckoning and Charlotte holding up my carbine and his sword. Miss Harper was drawn up as straight as a dart, her black eyes flashing and her lips charged with practical information that began to flow the moment I was near enough to hear her guarded voice. \"They\u0027ve all put their horses in the locks of the road fence, just beyond the big white gate--\" \"We know,\" I interrupted, leaning and snatching the weapons from Charlotte\u0027s hands. She kissed them good-bye. \"Ah, yes, yes!\" she said, \"they know all we can tell them and all we can\u0027t!\" The only response I could give was the shower of loose earth thrown upon both women by my horse\u0027s heels as I whirled and sped after my leader. He and Gholson were half a broad field ahead of me, but I followed only at their speed, designing to hand over the sword so nearly at the moment of going into action that I might stay by its owner\u0027s side unrebuked; and my plan was not in vain. Up the highway our Louisianians burst into view in column at full speed; I knew them by their captain, a man noted throughout the brigade for the showiness of his dress; and the next instant, away across the fields beyond the highroad, Quinn and his scouts broke out of the woods, heading for the gap in the woods-pasture fence. As each friendly column caught sight of the other, long cheers rang across the narrowing interval between them. Through that other gap which I had noted in my walk with Ferry he and Gholson reached the road, sped forward on it to a rise that overlooked the fields, and halted. Ferry rose on tiptoe in the stirrups, lifted his cap in air, pointed triumphantly backward to the grove, and was recognized by both columns at once. Again they cheered; at a full run I reached his side and threw his sword into his hand. Both columns saw him belt it on and flash it out, their cheers swelled again, the Louisianians hurtled down upon us, and we turned and were at the front of the onset.","sourceLink":"http://novel.tingroom.com/jingdian/2561/70549.html","bookId":414,"book":{"id":414,"title":"The Cavalier","description":"简介： Our camp was in the heart of Copiah County, Mississippi, a mile or so west of Gallatin and about six miles east of that once robber-haunted road, the Natchez Trace. Austin\u0027s brigade, we were, a detached body of mixed Louisiana and Mississippi cavalry...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2561","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
