{"id":44087,"no":58,"title":"LVIII THE UPPER FORK OF THE ROAD","content":"Ferry, as he passed us, called my name, and I started after him. At Charlotte\u0027s door we heard the greeting of her black maid. The maid\u0027s father, who of late had been nightly dressing Ferry\u0027s wound and mine, came to us in Ferry\u0027s room; and there my Captain turned to greet me, his face white with calamity. He took me caressingly by a button of my jacket. \"Can you have your wound washed to-night before mine?\" \n \n \"Why, certainly, if it\u0027s the least--\" \n \n \"Yes, thank you. And down here in this room instead of upstairs?\" \n \n \"Captain Ferry! if you knew how horribly it smells, you--\" \n \n \"Ah! don\u0027t I know?\" he said, and as I sat naked from throat to waist with the old negro laving the sores, Ferry scanned them narrowly. \"They are not so bad, Dick; you think a few hours in the saddle will not make them worse?\" \n \n \"Not if they\u0027re spent for you, Captain.\" \n \n \"Yes, for me; also for much better. We shall ride for--\" \n \n \"You ride? Oh, Captain, you are in no condition--\" \n \n \"Tst!\" he laid a finger on my lips; \"\u0027twill not be hard; we are not going on a scout--to jump fences.\" He began to make actual preparations, and presently helped me draw my shirt into place again over the clean bandages, while the old man went out after fresh water. \"I am a hundred times more fit to go than to stay,\" he suddenly resumed. \"I must go. Ah, idleness, there is nothing like idleness to drive a man mad; I must have something to do--to-night--at once.\" I wish I knew how to give the words with his quiet intensity. \n \n I began to unclothe his wound. \"May I ask one thing?\" \n \n \"Ah! I know you; you want to ask am I taking that upper fork of the road. I am; \u0027tis for that I want you; so go you now to the stable, saddle our horses and bring them.\" \n \n When I reached the front steps with them Ferry was at the gallery\u0027s edge, Miss Harper, Cécile and Harry were on three sides of him, and he was explaining away our astonishing departure. We were going to Hazlehurst, to issue clothing and shoes to those ragged and barefoot fellows we had seen that afternoon, and the light of whose tentless camp was yonder in the sky, now, toward Brookhaven. We were to go that way, confer with their officers, telegraph from town for authorizations to be sent to us at Hazlehurst, and then to push on to that place and be ready to issue the stuff when the trains should come up from Brookhaven bringing the brigade. While he spoke Camille and Estelle joined us. \"No,\" he said, \"to start any later, \u0027twould be too late.\" \n \n To Harry\u0027s imploring protest that he, Ferry, was not fit to go to Hazlehurst horseback, he replied \"Well! what we going to do? Those boys can\u0027t go to Big Black swamp bare-foot.\" \n \n Our dear friends were too well aware of the untold trouble to say a word about his coming back, but Miss Harper\u0027s parting injunction to me was to write them. \n \n The whole night and the following day were a toilsome time for us, but by fall of the next night the brigade had come in rags and passed newly clothed and shod, and in a room of the town tavern we dressed each other\u0027s hurts and sank to sleep on one bed. The night was hot, the pain of my wounds was like a great stone lying on them, and at the tragic moment of a frightful dream I awoke. \"Captain,\" I murmured. \n \n \"Yes?\" \n \n \"Did she give no reason?\" \n \n \"No.\" A silence followed; then he said, \"You know the reason, I think.\" \n \n \"Yes, I think I do; I think--\" \n \n \"Well? don\u0027t be afraid to say it.\" \n \n I got the words out in some form, that I believed Charlotte loved him deeply, as deeply, passionately, exaltedly, as ever a true woman loved a man-- \n \n \"Ah, me!\" he lifted his arms wide and knitted his fingers on his brow. \n \n \"And there is the whole trouble,\" I added. \"She will not let you marry the woman whose--\" \n \n \"Whose husband I have killed.... Ah, God!... Ah, my God! why was I chosen to do that?... And you think, Dick, it was not a question of time; that I did not ask, maybe a little too soon?\" \n \n \"No, not as between sooner and later; and yet, in another way, possibly, yes.\" Without either of us stirring from the pillow I tried to explain. I pointed out that trait in Charlotte which I called an impulse suddenly to surrender the key of her situation, the vital point in her fortunes and fate. \n \n \"Yes.... Yes,\" Ferry kept putting in. \n \n I went on to say that she seemed now to have learned, herself, that it was on this shoal she grounded at every low water of her physical and mental powers; as when over-fatigued, for instance; and that I should not wonder if she had bound herself never again at such a time to let her judgment follow her impulses. He laid his hand on me: \"Stop; stop; you stab too deep. I thought to take her by surprise at that very point, and right there she has countermined. My God! can it be that I am served only right?\" \n \n \"No,\" I replied, although it was a thing I would have said Ned Ferry would not do, \"no, no, it is she who has served both you and herself cruelly wrong. Captain, I believe that when Miss Harper has talked it over with her she will see her mistake as we all see it, and will call you back.\" \n \n \"Ah, me! Ah, me! Do you believe that, Dick?\" \n \n \"I do, Captain; but at the same time--\" \n \n \"What, what? Speak out, Dick. You blame me some other way?\" \n \n \"Oh, no, indeed! I am the one to blame, the only one. If you had not, both of you, been so blameless--so splendidly blameless--I should hardly have let myself sink so deep into blame; but I knew you would never take the last glad step until you had seen the last sad proof that you might take it. Oh, Captain, to-night is the third time that in my dreams I have seen that man alive.\" \n \n I do not know how long after that we lay silent, but it seemed an endless time before he exclaimed at last \"My God! Dick, you should have told me.\" \n \n \"I know it; I know I should! But it was only a dream, and--\" \n \n \"Ah! \u0027twas your doubt first and the dream after! But let us think no more of blame, we must settle the doubt. We shall begin that to-morrow.\" On my venturing to say more he interrupted. \"Well, we can do nothing now; at the present, sleep is our first business.\" However, after a little, he spoke again, and, I believe, purely in order to soothe me to slumber, speculated and counselled with me for the better part of an hour concerning my own poor little love affair. \n \n At breakfast he told me the first step in his further plans would be for us to take the train for Tangipahoa, with our horses, on our way to our own camp; but just before the train came the telegraph brought General Austin\u0027s request--which, of course, carried all the weight of an order--for Ferry to remain here and make ready for further issues of quartermaster\u0027s stores. He turned on his heel and twisted his small mustache: \"That means we are kept here to be kept here, Richard.\" \n \n It was a mistaken kindness, from our point of view, but it had the merit that it kept us busy. In two days the post-quartermaster\u0027s affairs and supplies were reduced to perfect order for the first time in their history. For two days more we ran a construction train and with a swarm of conscripts repaired two or three miles of road-bed and some trestle-work in a swamp; and at every respite in our strenuous activities we discoursed of the girls we\u0027d left behind us; their minds, their manners, their features, figures, tastes and talents, and their walk and talk. So came the end of the week, and while the sun was still above the trees we went on down, inspecting the road beyond our repairs, on our own hand-car to Brookhaven. With heads bare, jackets in our laps, and muddy boots dangling over the car\u0027s front edge, and with six big negroes at the levers behind us, we watched the miles glide under our wheels and grow fewer and fewer between us and the shrine of our hearts. \"Sing, Dick,\" said Ferry, and we chanted together, as we had done at every sunset these three days, \"O my love is like a red, red rose.\" We could not have done it had we known that yonder glorious sun was setting forever upon the fortunes of our Southern Confederacy. It was the fourth of July; Lee was in full retreat from Gettysburg, Vicksburg was gone, Port Hudson was doomed, and all that was left for us now was to die hard. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2561/70574.html","bookId":414,"book":{"id":414,"title":"The Cavalier","description":"简介： Our camp was in the heart of Copiah County, Mississippi, a mile or so west of Gallatin and about six miles east of that once robber-haunted road, the Natchez Trace. Austin\u0027s brigade, we were, a detached body of mixed Louisiana and Mississippi cavalry...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2561","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
