{"id":71959,"no":17,"title":"Page 17","content":"\"You do?\" The little Martian\u0027s voice rose to a squeak. \"What is it, Lucky?\"\\n\\n But Lucky said, \"Not now.\" He gazed down at Summers, whose dead eyes stared sightlessly toward the alien heavens. He said, \"Summers has one distinction. He is the first man ever to die on Io.\"\\n\\n He looked up. The sun was edging behind Jupiter. The planet was becoming only a faint silvery circle of twilit atmosphere.\\n\\n Lucky said, \"It will be dark. Let\u0027s go back to the ship.\"\\n\\n Bigman paced the floor of their cabin. It took only three steps one way, three steps the other, but he paced. He said, \"But if you know, Lucky, why don\u0027t you...\"\\n\\n Lucky said, \"I can\u0027t take ordinary action and risk explosion. Let me do it in my own time and my own way, Bigman.\"\\n\\n There was a firmness in Ms tone that quite subdued Bigman. He changed the subject and said, \"Well, then, why waste any more time on Io because of that cobber out there? He\u0027s dead. There\u0027s nothing more to do about him.\"\\n\\n \"One thing,\" said Lucky. The door signal flashed and he added, \"Open it, Bigman. It should be Norrich.\"\\n\\n It was. The blind engineer stepped in, his dog, Mutt, going before.\\n\\n Norrich\u0027s blue, unseeing eyes blinked rapidly. He said, \"I\u0027ve heard about Summers, Councilman. It\u0027s a terrible thing to think he tried to... to... Terrible that he was a traitor. Yet somehow I\u0027m sorry for him.\"\\n\\n Lucky nodded. \"I knew you would be. It\u0027s why I asked you to come here. It\u0027s dark out on lo now. The sun\u0027s in eclipse. When the eclipse is over, will you come out with me to bury Summers?\"\\n\\n \"Gladly. We should do that much for any man, shouldn\u0027t we?\" Norrich\u0027s hand dropped as if for consolation on Mutt\u0027s muzzle, and the dog came close and moved softly against his master as though feeling some dim need to offer sympathy.\\n\\n Lucky said, \"I thought you would want to come along. After all, you were his friend. You might want to pay your last respects.\"\\n\\n \"Thank you. I would like to.\" Norrich\u0027s blind eyes were moist.\\n\\n Lucky said to Commander Donahue just before he placed the helmet over his head, \"It will be our last trip out. When we return, we will take off for Jupiter Nine.\"\\n\\n \"Good,\" the commander said, and there seemed some unspoken understanding as their eyes met.\\n\\n Lucky put on his helmet and in another corner of the pilot room, Norrich\u0027s sensitive fingers moved delicately over Mutt\u0027s flexible space suit, making sure all fastenings were secure. Inside the glass-fronted, odd-shaped helmet that fitted over Mutt\u0027s head, Mutt\u0027s jaws moved in a faintly heard bark. It was obvious the dog knew he was headed for a trip into low gravity and that he enjoyed the prospect\\n\\n The first grave on Io was done. It had been dug out of hard, rocky soil by the use of force diggers. It was filled in with a mound of gravel and topped by an oval boulder as a marker.\\n\\n The three men stood round it while Mutt wandered off in the distance, trying vainly, as always, to examine his surroundings, though metal and glass blocked the use of his sense of smell.\\n\\n Bigman, who knew what Lucky expected him to do but didn\u0027t know why, waited tensely.\\n\\n Norrich stood with his head bowed and said softly, \"This was a man who wanted something very much, did wrong for that reason, and has paid for it.\"\\n\\n \"He did what the Sirians asked him to do,\" Lucky added. \"That was his crime. He committed sabotage and...\"\\n\\n Norrich stiffened as the pause in Lucky\u0027s remarks lengthened. He said, \"And what?\"\\n\\n \"And he got you on board ship. He refused to join the crew without you. You yourself told me that it was only through him that you were assigned to the Jovian Moon.\"\\n\\n Lucky\u0027s voice grew stern. \"You are a robot spy placed here by the Sirians. Your blindness makes you seem innocent to the others on the project, but you don\u0027t need a sense of sight. You killed the V-frog and covered for Summers to get him off the ship. Your own death meant nothing to you hi the face of orders, as Third Law states. And, finally, you fooled me by the display of emotion I caught through the V-frog, a synthetic emotion built into you by the Sirians.\"\\n\\n This was the cue for which Bigman had been waiting. Lifting the butt of his blaster high, he hurled himself at Norrich, whose incoherent protestations did not coalesce into words.\\n\\n \"I knew it was you,\" Bigman shrieked, \"and I\u0027m smashing you.\"\\n\\n \"It\u0027s not true,\" Norrich wailed, finding his voice. He threw up his hands and stumbled backward.\\n\\n And suddenly Mutt was a streak in the pale, white light. He hurled himself furiously across the quarter mile that separated him from the men, aiming with desperate passion at Bigman.\\n\\n Bigman paid no attention. One hand caught at Nor-rich\u0027s shoulder. The other swung the blaster upward.\\n\\n Then Mutt collapsed!\\n\\n While he was still ten feet from the struggling pair, his legs stiffened uselessly and he tumbled and rolled past them, coming to a frozen halt at last. Through the glass of his helmet his jaws could be seen hanging open, as though in mid-bark.\\n\\n Bigman held his threatening position over Norrich as though he, too, were frozen.\\n\\n Lucky approached the animal with quick steps. He used his force shovel as a kind of unwieldy knife and slit Mutt\u0027s space suit lengthwise from neck to tail.\\n\\n Then, tensely, he slit through the skin at the back of the neck and probed deftly with his mail-shod fingers. They closed on a small sphere that was not bone. He lifted the sphere and met resistance. Holding his breath, he snapped the wires that held it in place and stood up, almost weak with relief. The base of the brain had been the logical place for a mechanism to be activated by the brain, and he had found it. Mutt could endanger no one now.\\n\\n Norrich cried out, as though through instinctive knowledge of his loss.\\n\\n \"My dog! What are you doing to my dog?\"\\n\\n Lucky said softly, \"If s no dog, Norrich. Never was. It was a robot. Come, Bigman, lead him back to the ship. I\u0027ll carry Mutt.\"\\n\\n Lucky and Bigman were in Panner\u0027s room. The Jovian Moon was in flight again, and Io was falling rapidly away, already only a bright coin in the sky.\\n\\n \"What gave it away?\" said Panner.\\n\\n Lucky said somberly, \"A number of things which I never saw. Every clue pointed firmly to Mutt, but I was so intent on finding a humanoid robot, so inwardly convinced that a robot had to look human, that I looked past the truth though it stared me in the face.\"\\n\\n \"Then when did you see?\"\\n\\n \"When Summers killed himself by jumping off the rock. I stared at him, lying there, and thought of Bigman falling through the ammonia snow and nearly dying. I thought: There\u0027s no Mutt that can save this one... And that did it.\"\\n\\n \"How? I don\u0027t understand.\"\\n\\n \"How did Mutt save Bigman? When the dog came running up past us, Bigman was somewhere under the ice, nowhere to be seen. Yet Mutt plunged in, made for Bigman without hesitation, and dragged him out. We accepted that without thought because we somehow expect dogs to find what can\u0027t be seen through their sense of smell. But Mutt\u0027s head was enclosed. He could neither see nor smell Bigman, yet had no trouble locating him. We ought to have seen that unusual sense perception was involved. We\u0027ll find out exactly which when our roboticists work over the carcass.\"\\n\\n \"Now that you explain,\" said Panner, \"it looks plain enough. The dog had to give itself away because First Law compelled it not to allow a human being to come to harm.\"\\n\\n \"That\u0027s right,\" said Lucky. \"Once suspicions of Mutt finally penetrated, a few other things started falling into place. Summers had maneuvered Norrich on board, yes, but in doing so, he also got Mutt on board. Moreover, Summers was the one who got Mutt for Norrich in the first place. The chances are that there is a spy ring on Earth whose only task is to distribute these robot dogs to people working in or near critical research centers.\\n\\n \"Dogs are perfect spies. If you find a dog nosing through your papers or walking through a super-secret section of a laboratory, are you concerned? Chances are you pet the dog and feed him a dog biscuit. I checked through Mutt as best I could and I think he has a built-in subetheric transmitter which keeps him in contact with his Sirian masters. They can see what he sees, hear what he hears. For instance, they saw the V-frog through Mutt\u0027s eyes, recognized its danger, and directed him to kill it. He could be made to handle an energy projector with which to fuse the lock of a door. Even if he was caught in the act, there was a good chance we would put it all down to the accidental happenings of a dog playing with a weapon he had found.\\n\\n \"But once all this had occurred to me, I was only at the beginning of the practical problem. I had to try to take the dog intact. I was sure that any obvious suspicion of Mutt would trigger an explosion inside him. So first I brought Norrich and Mutt to a safe distance from the ship by suggesting we dig Summers\u0027 grave. In that way if Mutt did explode, the ship, at least, and its men would escape. Naturally I left a note with Commander Donahue, to be opened in case I did not return, so that Earth would at least investigate dogs in research centers.\\n\\n \"I then accused Norrich...\"\\n\\n Bigman broke in, \"Sands of Mars, Lucky, for a while I thought you really meant it when you said Norrich had killed the V-frog and fooled us with built-in emotion.\"\\n\\n Lucky shook his head. \"No, Bigman. If he could fool us with built-in emotion, why bother to kill the V-frog? No, I was making sure that if Sirians were listening through Mutt\u0027s senses, they would be convinced I was on the wrong track. In addition, I was setting up a situation for Mutt\u0027s benefit.\\n\\n \"You see, Bigman, under instructions, attacked Norrich. As a Seeing Eye dog, Mutt was built with strong orders to defend his master against attack, and obedience to orders are Second Law. Usually there\u0027s no problem here. Few people attack a blind man and those who do will usually stop if the dog simply growls and bares its fangs.\\n\\n \"But Bigman persisted in his attack, and Mutt, for the first time since being built, had to carry through all the way. But how could he? He couldn\u0027t hurt Big-man. First Law. Yet he couldn\u0027t allow Norrich to be hurt either. It was a complete dilemma and Mutt went out of commission. Once that happened, I gambled that any bomb he contained could no longer be triggered. So I removed it and after that we were safe.\"\\n\\n Panner took a deep breath. \"Very neat.\"\\n\\n Lucky snorted. \"Neat? I could have done this the first day I landed on Jupiter Nine, if I had my wits about me. I almost had it, at that. The thought was at the edge of my mind constantly and I never caught it.\"\\n\\n Bigman said, \"What was it, Lucky? I still don\u0027t know.\"\\n\\n \"It was simple enough. The V-frog detected animal emotion as well as human emotion. We had an example of that when we first landed on Jupiter Nine. We detected hunger in the mind of a cat. Then, later, we met Norrich and he urged you to aim a blow at him in order to show off Mutt\u0027s protectiveness. You did so. I detected Norrich\u0027s emotions and yours, Bigman, through the V-frog, but although Mutt showed every outward sign of anger, I detected no trace of such an emotion. There was the absolute proof as early as that, that Mutt had no emotions and was therefore no dog but a robot. Yet I was so convinced that I was looking for some human that my mind refused to see that point... Well, let\u0027s go to dinner and visit Norrich on the way. I want to promise him that we\u0027ll get him another dog, a real one.\"\\n\\n They arose, and Bigman said, \"Anyway, Lucky, maybe it took some time, but we\u0027ve stopped the Sirians.\"\\n\\n Lucky said quietly, \"I don\u0027t know that we\u0027ve stopped them, but certainly we\u0027ve slowed them down.\" \\n\\n","sourceLink":"https://allnovel.net/lucky-starr-and-the-moons-of-jupiter-lucky-starr-5/page-17.html","bookId":1758,"book":{"id":1758,"title":"Lucky Starr And The Moons of Jupiter (Lucky Starr #5)","description":"Storyline: Lucky Starr and the Moons of Jupiter (Lucky Starr #5) \\n Sabotage!!! \\n Agrav. It was the century\u0027s most important advance in space travel...and an experiment so revolutionary that only the men who huddled beneath the surface of Jupiter Nine were permitted to know its full meaning. \\n Yet someone else did know--knew everything, saw everything, head everything--and was diabolically sabotaging the top-secret mission. \\n Who or what the enemy was, Lucky Starr didn\u0027t know. but one thing was certain. The deadly force was not human...not even remotely human!\\n","cover":"https://allnovel.net/images/lucky-starr-and-the-moons-of-jupiter-lucky-starr-5.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/lucky-starr-and-the-moons-of-jupiter-lucky-starr-5.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:22:06 AM"}}
