{"id":91507,"no":12,"title":"Page 12","content":"“Who is it?” she asked. He didn’t glance her way. “Sam Barnard. Tanya’s brother,” he said. Katie stared, looking at David, and then at the man again. David left her, striding across the cemetery. He passed the brick vaults and kept going, at last calling out. His voice carried on the breeze. She heard him calling out, “Sam!” Sam turned slowly. He was clean shaven now, in Dockers and a polo shirt, and she wondered if he had been as drunk as she had thought last night, or if he had been playing the drunk, watching folks at the bar. He had to have been familiar with O’Hara’s-her uncle’s bar had been there for twenty-five years. But her uncle, Jamie O’Hara, had not been there. Jon Merrillo had been on as the manager, and Jon had only been in Key West for five years. Katie felt her heart thundering. For a moment she thought that she should turn away, that none of this was any of her business. But then she felt a trigger of unease. No, fear. What if the two men were about to go after one another? Maybe Sam Barnard had vengeance on his mind. David Beckett had just returned, and suddenly Sam Barnard was back in the city, as well. She dug into her handbag for her phone, ready to dial 911. But she didn’t. The two men embraced like old friends. They began speaking to one another, and walked toward the grave together. She felt a strange sensation-not cold, not heat, just a movement in the air. She turned her head slightly. Bartholomew had an arm draped around her. “That’s touching,” he said. “Seriously, you know, I like that fellow. He reminds me of someone I knew years and years ago…” He shrugged. “Hey, it might have been one of his ancestors, come to think of it.” “I thought he was a jerk and you were going to protect me from him,” Katie said dryly. Bartholomew shook his head. “He’s redeeming himself. That’s what life is all about, eh? We make mistakes, we earn redemption. So, you want to join up with them?” “No. No, I want to slip away.” “Wait.” “Wait-for what?” Katie asked. “Maybe Tanya Barnard is hanging around the cemetery.” “Do you see anyone? I don’t,” Katie said. “No,” Bartholomew admitted. “Maybe she’s gone on all the way. But she was murdered, and her murder was never solved. You’d think, with her brother and ex-fiancé together, she would make an appearance.” Katie looked around the cemetery. No ghosts were stirring. None at all. They were probably unhappy with the laughing tourists. Every man and woman born came to the end of their lives. Death was the only certainty in life. But ghosts could be touchy. “Let’s go. I have to go to work tonight and I want to do some searching online,” Katie said. “You go on. I’m going to hang around a bit longer,” Bartholomew said. “Snooping-or looking for your lady in white?” Katie asked. “A bit of both. I’m looking for my beauty…or waiting for you, my love. But you’re awfully young, so I’d have a long wait.” “Well, thanks for that vote of encouragement,” Katie said. She walked quickly, exiting the cemetery from the main gate. Neither of the men, now involved in a deep conversation together, noticed that she left. Sam Barnard was David’s senior by four years. He’d been in college when David had been in the military, so they hadn’t hung out, but they’d shared many a holiday dinner with one or the other’s family. “I heard about Craig’s death, and I’d heard they were trying to reach you,” Sam Barnard told David. “To be honest, though, I didn’t come down to pay my respects to anyone. I’d heard a local was trying to buy the museum. It brought everything back. Not just the fact that my kid sister was murdered, but the way she was left…and the fact that her killer was never found. Hell, I didn’t come down to start trouble. I’ve spent the past years not even a hundred miles away, and I haven’t made the trip down here since my folks left. But now…” “I’m not letting anyone reopen the museum,” David told him. They sat at a sidewalk bar on Front Street. Sam lifted his beer to David. “Glad to hear it. And I’m not here to hound or harass you, either. I know you didn’t do it.” “Do you?” David asked. Sam nodded. “I guess a lot of folks think I’ve followed you down here to pick a fight, beat you to a pulp, something like that.” “Probably.” “My folks knew you didn’t do it. I knew you didn’t do it.” “That means a lot.” “You know, I knew what was going on. She was my sister, but I never put her on a pedestal. I really loved her, but she was human, you know. Real. From the time she was a little kid, she wanted to live every second of the day. When you left for the military, I had a bad feeling. Tanya was never the kind to wait around. She was never going to find true love with that football jock-he had a roving eye. I told her so. She’d made all her arrangements for college in the north. But she wasn’t leaving until she had talked to you. I’m pretty sure she was going to make a stab at getting back with you. That’s why she was drinking. She needed courage.” “She never needed courage to see me.” “You didn’t know-you really didn’t know that she wanted to make up, did you?” Sam asked. “No. And no matter what, we would have stayed friends,” David said. “I didn’t hate her. Maybe I understood.” “She’s just a cold, closed case now,” Sam said. “I hope not. I hope there’s still a way to find the truth,” David said. “How, after all this time?” Sam demanded. “Hey, you didn’t secretly go off and become some kind of investigator, or medium, eh? What the hell could anyone possibly find now?” “Actually, cold cases do get solved. Not all of them, no. And no-I can’t conjure up Tanya to find out what happened.” “So you are a photographer?” Sam said, frowning. “And you film stuff, too, for nature films? Underwater-like Sean.” “Yep. Oddly enough, yes, Sean and I wound up doing close to the same thing. I do more straight photography than Sean, though.” He waited a minute, but Sam remained silent. “And you-you’re still running charter fishing boats, right?” Sam nodded, rubbing his thumb down his beer glass. “Yep, I do fishing charters.” “Is there a Mrs. Sam yet?” “No. And you-you never married either, huh?” “I’m all over the globe,” David said. Sam leaned toward him, his grin lopsided and rueful. “Neither one of us has married because we’re both fucked up. The murderer might as well have strangled my folks right alongside my sister. And let’s see-the girl you thought you were going to marry winds up dead and replacing an automaton, and everyone thinks you did it. Hell, yeah, I can see where you’re pretty screwed up in the head.” “Oddly enough, I’ve been fairly functional,” David told him. “But I guess maybe I thought that my grandfather would live forever. And I sure as hell never thought anyone would want to open the place again. Hell, I had told Liam to do whatever he wanted with whatever. I got back here just in time to stop him from selling the place.” “So, what, are you just going to let it decay, crumble into itself like the House of Usher?” Sam asked. “No, my plan with the place is to clear it all out, whitewash it and put it on the market. Liam’s parents are living on their private island now so he’s got a house-his mom and dad sold it to him for a dollar since he was their only child. I have my grandfather’s house, so I don’t need another one. And I’m not staying forever.” Sam laughed. “And you think folks will just forget about what happened here? The ghost tours will go by there, night after night. Tanya was killed and discovered in the museum, and the story will never die.” “Nor will the suggestion that I managed to kill her and carry her into the tableau,” David said. “Unless-” “Unless you discover who really did it,” Sam interrupted. “Yeah, well, I can see that. And I’m here, if you need me. I’ve rented a house up at the end of Duval. And here’s my cell.” He scratched out a number on a cocktail napkin. “Call me if you need me.” “Yeah, I will. Actually, I do have some questions for you,” David said. “Like, where was I the night of the twelfth?” Sam asked. “Sure. That would be good to know. Did you see your sister that night? I’m trying to trace her footsteps.” “Trace them until they walk you right up to a killer?” Sam asked. David nodded. “So?” “So?” “So where were you that night?” “That night? You found her in the morning… Oh, right. The police said that she was killed sometime between seven and nine on the twelfth, the night before. The museum was open until midnight, so sometime after midnight, the killer brought her body into the museum for you to find during the first tour the next morning.” “Everyone thought she had left for Ohio,” David said. “Your parents thought that she had left for Ohio, and I think they were just angry at first that she had gone without her final goodbye. I wasn’t expecting to see her, so I wouldn’t have looked for her. The killer held her-somewhere, and then brought her into the museum after closing.” “I was on Duval Street the night she was killed, drinking it up with a bunch of friends. Did I see my sister? Yes. I yelled at her for drinking.” “Drinking on Duval? How bizarre,” David said dryly. “Hey, those of us who live in paradise know that you can’t drink yourself silly every night. You know what she told me?” Sam asked.","sourceLink":"https://allnovel.net/ghost-shadow-bone-island-trilogy-1/page-12.html","bookId":2286,"book":{"id":2286,"title":"Ghost Shadow (Bone Island Trilogy #1)","description":"Storyline: Ghost Shadow (Bone Island #1) There are those who walk among us who are no longer alive, but not yet crossed over. They seek retribution…vengeance…to warn. Among the living, few intuit their presence. Katie O\u0027Hara is one who can. As she’s drawn deeper and deeper into a gruesome years-old murder, whispered warnings from a spectral friend become more and more insistent. But Katie must uncover the truth: could David Beckett really be guilty of his fiancée’s murder? Worse – the body count’s rising on the Island of Bones, and the dead seem to be reenacting some macabre tableaux from history. The danger is increasing by the moment – especially as Katie finds herself irresistibly drawn to David, who may be responsible for more than just one killing….","cover":"https://allnovel.net/images/ghost-shadow-bone-island-trilogy-1.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/ghost-shadow-bone-island-trilogy-1.html","creation":"Oct 5, 2019 8:58:33 AM","modification":"Oct 5, 2019 5:49:46 PM"}}
