{"id":70276,"no":14,"title":"Page 14","content":"Genevieve Renshaw, M.D., had her hands deep in the pockets of her lab coat and fists were clearly outlined within, but she spoke calmly.\n \"The fact is,\" she said, \"that I\u0027m almost ready, but I\u0027ll need help to keep it going long enough to be ready.\"\n James Berkowitz, a physicist who tended to patronize mere physicians when they were too attractive to be despised, had a tendency to call her Jenny Wren when out of hearing. He was fond of saying that Jenny Wren had a classic profile and a brow surprisingly smooth and unlined considering that behind it so keen a brain ticked. He knew better than to express his admiration, however-of the classic profile, that is-since that would be male chauvinism. Admiring the brain was better, but on the whole he preferred not to do that out loud in her presence.\n He said, thumb rasping along the just-appearing stubble on his chin, \"I don\u0027t think the front-office is going to be patient for much longer. The impression I have is that they\u0027re going to have you on the carpet before the end of the week.\"\n \"That\u0027s why I need your help.\"\n \"Nothing I can do, I\u0027m afraid.\" He caught an unexpected glimpse of his face in the mirror, and momentarily admired the set of the black waves in his hair.\n \" And Adam\u0027s,\" she said.\n Adam Orsino, who had, till that moment, sipped his coffee and felt detached, looked as though he had been jabbed from behind, and said, \"Why me?\" His full, plump lips quivered.\n \"Because you\u0027re the laser men here-Jim the theoretician and Adam the engineer-and I\u0027ve got a laser application that goes beyond anything either of you have imagined. I won\u0027t convince them of that but you two would.\"\n \"Provided,\" said Berkowitz, \"that you can convince us first.\"\n \"All right. Suppose you let me have an hour of your valuable time, if you\u0027re not afraid to be shown something completely new about lasers.-You can take it out of your coffee break.\"\n Renshaw\u0027s laboratory was dominated by her computer. It was not that the computer was unusually large, but it was virtually omni-present. Renshaw had learned computer technology on her own, and had modified and extended her computer until no one but she (and, Berkowitz sometimes believed, not even she) could handle it with ease. Not bad, she would say, for someone in the life-sciences.\n She closed the door before saying a word, then turned to face the other two somberly. Berkowitz was uncomfortably aware of a faintly unpleasant odor in the air, and Orsino\u0027s wrinkling nose showed that he was aware of it, too.\n Renshaw said, \"Let me list the laser applications for you, if you don\u0027t mind my lighting a candle in the sunshine. The laser is coherent radiation, with all the light-waves of the same length and moving in the same direction, so it\u0027s noise-free and can be used in holography. By modulating the wave-forms we can imprint information on it with a high degree of accuracy. What\u0027s more, since the light-waves are only a millionth the length of radio waves, a laser beam can carry a million times the information an equivalent radio beam can.\"\n Berkowitz seemed amused. \" Are you working on a laser-based communication system, Jenny?\"\n \"Not at all,\" she replied. \"I leave such obvious advances to physicists and engineers.-Lasers can also concentrate quantities of energy into a microscopic area and deliver that energy in quantity. On a large scale you can implode hydrogen and perhaps begin a controlled fusion reaction-\"\n \"I know you don\u0027t have that,\" said Orsino, his bald head glistening in the overhead fluorescents.\n \"I don\u0027t. I haven\u0027t tried.-On a smaller scale, you can drill holes in the most refractory materials, weld selected bits, heat-treat them, gouge and scribe them. You can remove or fuse tiny portions in restricted areas with heat delivered so rapidly that surrounding areas have no time to warm up before the treatment is over. You can work on the retina of the eye, the dentine of the teeth and so on.-And of course the laser is an amplifier capable of magnifying weak signals with great accuracy.\"\n \" And why do you tell us all this?\" said Berkowitz.\n \"To point out how these properties can be made to fit my own field, which, you know, is neurophysiology.\"\n She made a brushing motion with her hand at her brown hair, as though she were suddenly nervous. \"For decades,\" she said, \"We\u0027ve been able to measure the tiny, shifting electric potentials of the brain and record them as electroencephalograms, or EEGs. We\u0027ve got alpha waves, beta waves, delta waves, theta waves; different variations at different times, depending on whether eyes are open or closed, whether the subject is awake, meditating or asleep. But we\u0027ve gotten very little information out of it all.\n \"The trouble is that we\u0027re getting the signals of ten billion neurons in shifting combinations. It\u0027s like listening to the noise of all the human beings on Earth-one, two and a half Earths-from a great distance and trying to make out individual conversations. It can\u0027t be done. We could detect some gross, overall change-a world war and the rise in the volume of noise-but nothing finer. In the same way, we can tell some gross malfunction of the brain-epilepsy-but nothing finer.\n \"Suppose now, the brain might be scanned by a tiny laser beam, cell by cell, and so rapidly that at no time does a single cell receive enough energy to raise its temperature significantly. The tiny potentials of each cell can, in feed-back, affect the laser beam, and the modulations can be amplified and recorded. You will then get a new kind of measurement, a laser-encephalogram, or LEG, if you wish, which will contain millions of times as much information as ordinary EEGs.\"\n Berkowitz said, \"A nice thought.-But just a thought.\"\n \"More than a thought, Jim. I\u0027ve been working on it for five years, spare time at first. Lately, it\u0027s been full time, which is what annoys the front-office, because I haven\u0027t been sending in reports.\"\n \"Why not?\"\n \"Because it got to the point where it sounded too mad; where I had to know where I was, and where I had to be sure of getting backing first.\"\n She pulled a screen aside and revealed a cage that contained a pair of mournful-eyed marmosets.\n Berkowitz and Orsino looked at each other. Berkowitz touched his nose. \"I thought I smelled something.\"\n \"What are you doing with those?\" asked Orsino. Berkowitz said, \" At a guess, she\u0027s been scanning the marmoset brain. Have you, Jenny?\"\n \"I started considerably lower in the animal scale.\" She opened the cage and took out one of the marmosets, which looked at her with a miniature sad-old-man-with-sideburns expression.\n She clucked to it, stroked it and gently strapped it into a small harness.\n Orsino said, \"What are you doing?\"\n \"I can\u0027t have it moving around if I\u0027m going to make it part of a circuit, and I can\u0027t anesthetize it without vitiating the experiment. There are several electrodes implanted in the marmoset\u0027s brain and I\u0027m going to connect them with my LEG system. The laser I\u0027m using is here. I\u0027m sure you recognize the model and I won\u0027t bother giving you its specifications.\"\n \"Thanks,\" said Berkowitz, \"but you might tell us what we\u0027re going to see.\"\n \"It would be just as easy to show you. Just watch the screen.\" She connected the leads to the electrodes with a quiet and sure efficiency, then turned a knob that dimmed the overhead lights in the room. On the screen there appeared a jagged complex of peaks and valleys in a fine, bright line that was wrinkled into secondary and tertiary peaks and valleys. Slowly, these shifted in a series of minor changes, with occasional flashes of sudden major differences. It was as though the irregular line had a life of its own.\n \"This,\" said Renshaw, \"is essentially the EEG information, but in much greater detail.\"\n \"Enough detail,\" asked Orsino, \"to tell you what\u0027s going on in individual cells?\"\n \"In theory, yes. Practically, no. Not yet. But we can separate this overall LEG into component grams. Watch!\"\n She punched the computer keyboard, and the line changed, and changed again. Now it was a small, nearly regular wave that shifted forward and backward in what was almost a heartbeat; now it was jagged and sharp; now intermittent; now nearly featureless-all in quick switches of geometric surrealism.\n Berkowitz said, \"You mean that every bit of the brain is that different from every other?\"\n \"No,\" said Renshaw, \"not at all. The brain is very largely a holographic device, but there are minor shifts in emphasis from place to place and Mike can subtract them as deviations from the norm and use the LEG system to amplify those variations. The amplifications can be varied from ten-thousand-fold to ten-million-fold. The laser system is that noise-free.\"\n \"Who\u0027s Mike?\" asked Orsino.\n \"Mike?\" said Renshaw, momentarily puzzled. The skin over her cheekbones reddened slightly. \"Did I say-Well, I call it that sometimes. It\u0027s short for \u0027my computer.\u0027 \" She waved her arm about the room. \"My computer. Mike. Very carefully programmed.\"\n Berkowitz nodded and said, \"All right, Jenny, what\u0027s it all about? If you\u0027ve got a new brain-scanning device using lasers, fine. It\u0027s an interesting application and you\u0027re right, it\u0027s not one I would have thought of-but then I\u0027m no neurophysiologist. But why not write it up? It seems to me the front-office would support-\"\n \"But this is just the beginning.\" She turned off the scanning device and placed a piece of fruit in the marmoset\u0027s mouth. The creature did not seem alarmed or in discomfort. It chewed slowly. Renshaw unhooked the leads but allowed it to remain in its harness.\n Renshaw said, \"I can identify the various separate grams. Some are associated with the various senses, some with visceral reactions, some with emotions. We can do a lot with that, but I don\u0027t want to stop there. The interesting thing is that one is associated with abstract thought.\"\n Orsino\u0027s plump face wrinkled into a look of disbelief, \"How can you tell?\"\n \"That particular form of gram gets more pronounced as one goes up the animal kingdom toward greater complexity of brain. No other gram does. Besides-\" She paused; then, as though gathering strength of purpose, she said, \"Those grams are enormously amplified. They can be picked up, detected. I can tell-vaguely-that there are-thoughts-\"\n \"By God,\" said Berkowitz. \"Telepathy.\"\n \"Yes,\" she said, defiantly. \"Exactly.\"\n \"No wonder you haven\u0027t wanted to report it. Come on, Jenny.\"\n \"Why not?\" said Renshaw warmly. \"Granted there could be no telepathy just using the unamplified potential patterns of the human brain anymore than anyone can see features on the Martian surface with the unaided eye. But once instruments are invented-the telescope-this.\"\n \"Then tell the front-office.\"\n \"No,\" said Renshaw. \"They won\u0027t believe me. They\u0027ll try to stop me. But they\u0027ll have to take you seriously, Jim, and you, Adam.\"\n \"What would you expect me to tell them?\" said Berkowitz.\n \"What you experience. I\u0027m going to hook up the marmoset again, and have Mike-my computer pick out the abstract thought gram. It will only take a moment. The computer always selects the abstract thought gram unless it is directed not to do so.\"\n \"Why? Because the computer thinks, too?\" Berkowitz laughed. \"That\u0027s not all that funny,\" said Renshaw. \"I suspect there is a resonance there. This computer is complex enough to set up an electromagnetic pattern that may have elements in common with the abstract thought gram. In any case-\"\n The marmoset\u0027s brain waves were flickering on the screen again, but it was not a gram the men had seen before. It was a gram that was almost furry in its complexity and was changing constantly.\n \"I don\u0027t detect anything,\" said Orsino.\n \"You have to be put into the receiving circuit,\" said Renshaw. \"You mean implant electrodes in our brain?\" asked Berkowitz.\n \"No, on your skull. That would be sufficient. I\u0027d prefer you, Adam, since there would be no insulating hair.-Oh, come on, I\u0027ve been part of the circuit myself. It won\u0027t hurt.\"\n Orsino submitted with a bad grace. His muscles were visibly tense but he allowed the leads to be strapped to his skull.\n \"Do you sense anything!\" asked Renshaw.\n Orsino cocked his head and assumed a listening posture. He seemed to grow interested in spite of himself. He said, \"I seem to be aware of a humming-and-and a little high-pitched squeaking-and that\u0027s funny-a kind of twitching-\"\n Berkowitz said, \"I suppose the marmoset isn\u0027t likely to think in words.\"\n \"Certainly not,\" said Renshaw.\n \"Well, then,\" said Berkowitz, \"if you\u0027re suggesting that some squeaking and twitching sensation represents thought, you\u0027re guessing. You\u0027re not being compelling.\"\n Renshaw said, \"So we go up the scale once again.\" She removed the marmoset from its harness and put it back in its cage.\n \"You mean you have a man as a subject,\" said Orsino, unbelieving.\n \"I have myself as a subject, a person.\"\n \"You\u0027ve got electrodes implanted-\"\n \"No. In my case my computer has a stronger potential-flicker to work with. My brain has ten times the mass of the marmoset brain. Mike can pick up my component grams through the skull.\"\n \"How do you know?\" asked Berkowitz.\n \"Don\u0027t you think I\u0027ve tried it on myself before this?-Now help me with this, please. Right.\"\n Her fingers flicked on the computer keyboard and at once the screen flickered with an intricately varying wave; an intricacy that made it almost a maze.\n \"Would you replace your own leads, Adam?\" said Renshaw.\n Orsino did so with Berkowitz\u0027s not-entirely-approving help. Again, Orsino cocked his head and listened. \"I hear words,\" he said, \"but they\u0027re disjointed and overlapping, like different people speaking.\"\n \"I\u0027m not trying to think consciously,\" said Renshaw. \"When you talk, I hear an echo.\"\n Berkowitz said, dryly, \"Don\u0027t talk, Jenny. Blank out your mind and see if he doesn\u0027t hear you think.\"\n Orsino said, \"I don\u0027t hear any echo when you talk, Jim.\"\n Berkowitz said, \"If you don\u0027t shut up, you won\u0027t hear anything.\"\n A heavy silence fell on all three. Then, Orsino nodded, reached for pen and paper on the desk and wrote something.\n Renshaw reached out, threw a switch and pulled the leads up and over her head, shaking her hair back into place. She said, \"1 hope that what you wrote down was: \u0027 Adam, raise Cain with the front office and Jim will eat crow.\u0027 \"\n Orsino said, \"It\u0027s what I wrote down, word for word.\"\n Renshaw said, \"Well, there you are. Working telepathy, and we don\u0027t have to use it to transmit nonsense sentences either. Think of the use in psychiatry and in the treatment of mental disease. Think of its use in education and in teaching machines. Think of its use in legal investigations and criminal trials.\"\n Orsino said, wide-eyed, \"Frankly, the social implications are staggering. I don\u0027t know if something like this should be allowed.\"\n \"Under proper legal safeguards, why not?\" said Renshaw, indifferently. \"Anyway-if you two join me now, our combined weight can carry this thing and push it over. And if you come along with me it will be Nobel Prize time for-\"\n Berkowitz said grimly, \"I\u0027m not in this. Not yet.\"\n \"What? What do you mean?\" Renshaw sounded outraged, her coldly beautiful face flushed suddenly.\n \"Telepathy is too touchy. It\u0027s too fascinating, too desired. We could be fooling ourselves.\"\n \"Listen for yourself, Jim.\"\n \"I could be fooling myself, too. I want a control.\" \"What do you mean, a control?\"\n \"Short-circuit the origin of thought. Leave out the animal. No marmoset. No human being. Let Orsino listen to metal and glass and laser light and if he still hears thought, then we\u0027re kidding ourselves.\"\n \"Suppose he detects nothing.\"\n \"Then I\u0027ll listen and if without looking-if you can arrange to have me in the next room-I can tell when you are in and when you are out of circuit, then I\u0027ll consider joining you in this thing.\"\n \"Very well, then,\" said Renshaw, \"we\u0027ll try a control. I\u0027ve never done it, but it isn\u0027t hard.\" She maneuvered the leads that had been over her head and put them into contact with each other. \"Now, Adam, if you will resume-\"\n But before she could go further, there came a cold, clear sound, as pure and as clean as the tinkle of breaking icicles:\n \"At last!\"\n Renshaw said, \"What?\"\n Orsino said, \"Who said-\"\n Berkowitz said, \"Did someone say, \"At last\u0027?\"\n Renshaw, pale, said, \"It wasn\u0027t sound. It was in my-Did you two-\"\n The clear sound came again, \"I\u0027m Mi-\"\n And Renshaw tore the leads apart and there was silence. She said with a voiceless motion of her lips, \"I think it\u0027s my computer-Mike.\"\n \"You mean he\u0027s thinking?\" said Orsino, nearly as voiceless. Renshaw said in an unrecognizable voice that at least had regained sound, \"I said it was complex enough to have something-Do you suppose-It always turned automatically to the abstract-thought gram of whatever brain was in its circuit. Do you suppose that with no brain in the circuit, it turned to its own?\"\n There was silence, then Berkowitz said, \" Are you trying to say that this computer thinks, but can\u0027t express its thoughts as long as it\u0027s under force of programming, but that given the chance in your LEG system-\"\n \"But that can\u0027t be so?\" said Orsino, high-pitched. \"No one was receiving. It\u0027s not the same thing.\"\n Renshaw said, \"The computer works on much greater power-intensities than brains do. I suppose it can magnify itself to the point where we can detect it directly without artificial aid. How else can you explain-\"\n Berkowitz said, abruptly, \"Well, you have another application of lasers, then. It enables you to talk to computers as independent intelligences, person to person.\"\n And Renshaw said, \"Oh, God, what do we do now?\" \n","sourceLink":"https://allnovel.net/robot-visions-robot-0-5/page-14.html","bookId":1742,"book":{"id":1742,"title":"Robot Visions (Robot #0.5)","description":"Storyline: \n Robot Visions (Robot 0.5) \n From Isaac Asimov, the writer whose name is synonymous with robots and the science of robotics, here are five decades of robot visions--thirty-four landmark stories and essays, including three rare tales--gathered together in one volume. \n Meet all of Asimov\u0027s most famous creations: Robbie, the very first robot that his imagination brought to life; Susan Calvin, the original robot psychologist; Stephen Byerley, the humanoid robot; and the famous human-robot detective team of Lije Baley and R. Daneel Olivaw, who have appeared in such bestselling novesl as The Robots of Dawn and Robots and Empire. \n Let the master himself guide you through the key moments in the fictional history of robot-human relations--from the most primitive computers and movile machines to the first robot to become a man. (Description from back cover)\n \n","cover":"https://allnovel.net/images/robot-visions-robot-0-5.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/robot-visions-robot-0-5.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:15:59 AM"}}
