{"id":70288,"no":26,"title":"Page 26","content":"To a physicist, a machine is any device that transfers a force from the point where it is applied to another point where it is used and, in the process, changes its intensity or direction. In this sense it is difficult for a human being to make use of anything that is not part of his body without, in the process, using a machine. A couple of million years ago, when one could scarcely decide whether the most advanced hominids were more humanlike than apelike, pebbles were already being chipped and their sharp edges used to cut or scrape. And even a chipped pebble is a machine, for the force applied to the blunt edge by the hand is transmitted to the sharp end and, in the process, intensified. The force spread over the large area of the blunt end is equal to the force spread over the small area of the sharp end. The pressure (force per area) is therefore increased, and without ever increasing the total force, that force is intensified in action. The sharp-edge pebble could, by the greater pressure it exerts, force its way through an object, as a rounded pebble (or a man\u0027s hand) could not. In actual practice, however, few people, other than physicists at their most rigid, would call a chipped pebble a machine. In actual practice, we think of machines as relatively complicated devices, and are more likely to use the name if the device is somewhat removed from direct human guidance and manipulation. The further a device is removed from human control, the more authentically mechanical it seems, and the whole trend in technology has been to devise machines that are less and less under direct human control and more and more seem to have the beginning of a will of their own. A chipped pebble is almost part of the hand it never leaves. A thrown spear declares a sort of independence the moment is its released. The clear progression away from direct and immediate control made it possible for human beings, even in primitive times, to slide forward into extrapolation, and to picture devices still less controllable, still more independent than anything of which they had direct experience. Immediately we have a form of fantasy-which some, defining the term more broadly than I would, might even call science fiction. Man can move on his feet by direct and intimate control; or on horseback, controlling the more powerful animal muscles by rein and heel; or on ship, making use of the invisible power of the wind. Why not progress into further etherealization by way of seven-league boots, flying carpets, self-propelled boats. The power used in these cases was \"magic,\" the tapping of the superhuman and transcendental energies of gods or demons. Nor did these imaginings concern only the increased physical power of inanimate objects, but even increased mental power of objects which were still viewed as essentially inanimate. Artificial intelligence is not really a modern concept. Hephaistos, the Greek god of the forge, is pictured in the Iliad as having golden mechanical women, which were as mobile and as intelligent as flesh-and-blood women, and which helped him in his palace. Why not? After all, if a human smith makes inanimate metal objects of the base metal iron, why should not a god-smith make far more clever inanimate metal objects of the noble metal gold? It is an easy extrapolation, of the sort that comes as second nature to science fiction writers (who, in primitive times, had to be myth-makers, in default of science). But human artisans, if clever enough, could also make mechanical human beings. Consider Talos, a bronze warrior made by that Thomas Edison of the Greek myths, Oaedalus. Talos guarded the shores of Crete, circling the island once each day and keeping off all intruders. The fluid that kept him alive was kept within his body by a plug at his heel. When the Argonauts landed on Crete, Medea used her magic to pull out the plug and Talos lost all his pseudoanimation. (It is easy to ascribe a symbolic meaning to this myth. Crete, starting in the fourth millennium B.C., before the Greeks had yet entered Greece, had a navy, the first working navy in human history. The Cretan navy made it possible for the islanders to establish an empire over what became the nearby islands and mainland. The Greek barbarians, invading the land, were more or less under Cretan dominion to begin with. The bronze-armored warriors carried by the ships guarded the Cretan mainland for two thousand years-and then failed. The plug was pulled, so to speak, when the island of Thera exploded in a vast volcanic eruption in 1500 B.C. and a tsunami greatly weakened the Cretan civilization-and the Greeks took over. Still, the fact that a myth is a sort of vague and distorted recall of something actual does not alter its function of indicating a way of human thinking.) From the start, then, the machine has faced mankind with a double aspect. As long as it is completely under human control, it is useful and good and makes a better life for people. However, it is the experience of mankind (and was already his experience in quite early times) that technology is a cumulative thing, that machines are invariably improved, and that the improvement is always in the direction of etherealization, always in the direction of less human control and more auto-control-and at an accelerating rate. As the human control decreases, the machine becomes frightening in exact proportion. Even when the human control is not visibly decreasing, or is doing so at an excessively low rate, it is a simple task for human ingenuity to look forward to a time when the machine may go out of control altogether, and the fear of that can be felt in advance. What is the fear? The simplest and most obvious fear is that of the possible harm that comes from machinery out of control. In fact, any technological advance, however fundamental, has the double aspect of good/harm and, in response, is viewed with a double aspect of love/fear. Fire warms you, gives you light, cooks your food, smelts your ore-and, out of control, burns and kills. Your knives and spears kill your animal enemies and your human foes and, out of your control, are used by your foes to kill you. You can run down the list and build examples indefinitely and there has never been any human activity which, on getting out of control and doing harm, has raised the sigh among many of, \"Oh, if we had only stuck to the simple and virtuous lives of our ancestors who were not cursed with this new-fangled misery.\" Yet is this fear of piecemeal harm from this advance or that the kind of deep-seated terror so difficult to express that it finds its way into the myths? I think not. Fear of machinery for the discomfort and occasional harm it brings has (at least until very recently) not moved humanity to more than that occasional sigh. The love of the uses of machinery has always far overbalanced such fears, as we might judge if we consider that very rarely in the history of mankind has any culture voluntarily given up significant technological advance because of the inconvenience or harm of its side effects. There have been involuntary retreats from technology as a result of warfare, civil strife, epidemics, or natural disasters, but the results of that are precisely what we call a \"dark age\" and the population suffering from one does its best over the generations to get back on the track and restore the technology. Mankind has always chosen to counter the evils of technology, not by abandonment of technology, but by additional technology. The smoke of an indoor fire was countered by the chimney. The danger of the spear was countered by the shield. The danger of the mass army was countered by the city wall. This attitude, despite the steady drizzle of backwardist outcries, has continued to the present. Thus the characteristic technological product of our present life is the automobile. It pollutes the air, assaults our eardrums, kills fifty thousand Americans a year and inflicts survivable injuries on hundreds of thousands. Does anyone seriously expect Americans to give up their murderous little pets voluntarily? Even those who attend rallies to denounce the mechanization of modern life are quite likely to reach those rallies by automobile. The first moment when the magnitude of possible evil was seen by many people as uncounterable by any conceivable good came with the fission bomb in 1945. Never before had any technological advance set off demands for abandonment by so large a percentage of the population. In fact, the reaction to the fission bomb set a new fashion. People were readier to oppose other advances they saw as unacceptably harmful in their side effects-biological warfare, the SST, certain genetic experiments on micro-organisms, breeder reactors, spray cans. And even so, not one of these items has yet been given up. But we\u0027re on the right track. The fear of the machine is not at the deepest level of the soul if the harm it does is accompanied by good, too; or if the harm is merely to some people-the few who happen to be on the spot in a vehicular collision, for instance. The majority, after all, escape, and reap the good of the machine. No, it is when the machine threatens all mankind in any way so that each individual human being begins to feel that he, himself, will not escape, that fear overwhelms love. But since technology has begun to threaten the human race as a whole only in the last thirty years, were we immune to fear before that-or has the human race always been threatened? After all, is physical destruction by brute energy of a type only now in our fist, the only way in which human beings can be destroyed? Might not the machine destroy the essence of humanity, our minds and souls, even while leaving our bodies intact and secure and comfortable? It is a common fear, for instance, that television makes people unable to read and pocket computers will make them unable to add. Or think of the Spartan king who, on observing a catapult in action, mourned that that would put an end to human valor. Certainly such subtle threats to humanity have existed and been recognized through all the long ages when man\u0027s feeble control over nature made it impossible for him to do himself very much physical harm. The fear that machinery might make men effete is not yet, in my opinion, the basic and greatest fear. The one (it seems to me) that hits closest to the core is the general fear of irreversible change. Consider: There are two kinds of change that we can gather from the universe about us. One is cyclic and benign. Day both follows and is followed by night. Summer both follows and is followed by winter. Rain both follows and is followed by clear weather, and the net result is, therefore, no change. That may be boring, but it is comfortable and induces a feeling of security. In fact, so comfortable is the notion of short-term cyclic change implying long-term changelessness, that human beings labor to find it everywhere. In human affairs, there is the notion that one generation both follows and is followed by another, that one dynasty both follows and is followed by another, that one empire both follows and is followed by another. It is not a good analogy to the cycles of nature since the repetitions are not exact, but it is good enough to be comforting. So strongly do human beings want the comfort of cycles that they will seize upon one even when the evidence is insufficient-or even when it actually points the other way. With respect to the universe, what evidence we have points to a hyperbolic evolution; a universe that expands forever out of the initial big bang and ends as formless gas and black holes. Yet our emotions drag us, against the evidence, to notions of oscillating, cyclic, repeating universes, in which even the black holes are merely gateways to new big bangs. But then there is the other change, to be avoided at all costs-the irreversible, malignant change; the one-way change; the permanent change; the change-never-to-return. What is so fearful about it? The fact is that there is one such change that lies so close to ourselves that it distorts the entire universe for us. We are, after all, old, and though we were once young we shall never be young again. Irreversible! Our friends are dead, and though they were once alive, they shall never be alive again. Irreversible! The fact is that life ends in death and that is not a cyclic change and we fear that end and know it is useless to fight it. What is worse is that the universe doesn\u0027t die with us. Callously and immortally it continues onward in its cyclic changes, adding to the injury of death the insult of indifference. And what is still worse is that other human beings don\u0027t die with us. There are younger human beings, born later, who were helpless and dependent on us to start with, but who grow into supplanting nemeses and take our places as we age and die. To the injury of death is added the insult of supplantation. Did I say it is useless to fight this honor of death accompanied by indifference and supplantation? Not quite. The uselessness is apparent only if we cling to the rational, but there is no law that says we must cling to it, and human beings do not, in fact, do so. Death can be avoided by simply denying it exists. We can suppose that life on Earth is an illusion, a short testing period prior to entry into some afterlife where all is eternal and there is no question of irreversible change. Or we can suppose that it is only the body that is subject to death and that there is an immortal component of ourselves, not subject to irreversible change, which might, after the death of one body, enter another, in indefinite, cyclic repetitions of life. These mythic inventions of afterlife and transmigration may make life tolerable for many human beings and enable them to face death with reasonable equanimity-but the fear of death and supplantation is only masked and overlaid; it is not removed. In fact, the Greek myths involve the successive supplantation of one set of immortals by another-in what seems to be a despairing admission that not even eternal life and superhuman power can remove the danger of irreversible change and the humiliation of being supplanted. To the Greeks it was disorder (Chaos) that first ruled the universe, and it was supplanted by Ouranos (the sky), whose intricate powdering of stars and complexly moving planets symbolized order (\"Kosmos\"). But Ouranos was castrated by Kronos, his son. Kronos, his brothers, his sisters, and their progeny then ruled the universe. Kronos feared that he would be served by his children as he had served his father (a kind of cycle of irreversible changes) and devoured his children as they were born. He was duped by his wife, however, who managed to save her last-born, Zeus, and to spirit him away to safety. Zeus grew to adult godhood, rescued his siblings from his father\u0027s stomach, warred against Kronos and those who followed him, defeated him, and replaced him as ruler. (There are supplantation myths among other cultures, too, even in our own-as the one in which Satan tried to supplant God and failed; a myth that reached its greatest literary expression in John Milton\u0027s Paradise Lost.) And was Zeus safe? He was attracted to the sea nymph Thetis and would have married her had he not been informed by the Fates that Thetis was destined to bear a son mightier than his father. That meant it was not safe for Zeus, or for any other god, either, to marry her. She was therefore forced (much against her will) to marry Peleus, a mortal, and bear a mortal son, the only child the myths describe her as having. That son was Achilles, who was certainly far mightier than his father (and, like Talos, had only his heel as his weak point through which he might be killed). Now, then, translate this fear of irreversible change and of being supplanted into the relationship of man and machine and what do we have? Surely the great fear is not that machinery will harm us-but that it will supplant us. It is not that it will render us ineffective-but that it will make us obsolete. The ultimate machine is an intelligent machine and there is, only one basic plot to the intelligent-machine story-that it is created to serve man, but that it ends by dominating man. It cannot exist without threatening to supplant us, and it must therefore be destroyed or we will be. There is the danger of the broom of the sorcerer\u0027s apprentice, the golem of Rabbi Loew, the monster created by Dr. Frankenstein. As the child born of our body eventually supplants us, so does the machine born of our mind. Mary Shelley\u0027s Frankenstein, which appeared in 1818, represents a peak of fear, however, for, as it happened, circumstances conspired to reduce that fear, at least temporarily. Between the year 1815, which saw the end of a series of general European wars, and 1914, which saw the beginning of another, there was a brief period in which humanity could afford the luxury of optimism concerning its relationship to the machine. The Industrial Revolution seemed suddenly to uplift human power and to bring on dreams of a technological utopia on Earth in place of the mythic one in Heaven. The good of machines seemed to far outbalance the evil and the response of love far outbalance the response of fear. It was in that interval that modern science fiction began-and by modern science fiction I refer to a form of literature that deals with societies differing from our own specifically in the level of science and technology, and into which we might conceivably pass from our own society by appropriate changes in that level. (This differentiates science fiction from fantasy or from \"speculative fiction,\" in which the fictional society cannot be connected with our own by any rational set of changes.) Modern science fiction, because of the time of its beginning, took on an optimistic note. Man\u0027s relationship to the machine was one of use and control. Man\u0027s power grew and man\u0027s machines were his faithful tools, bringing him wealth and security and carrying him to the farthest reaches of the universe. This optimistic note continues to this day, particularly among those writers who were molded in the years before the coming of the fission bomb-notably, Robert Heinlein, Arthur C. Clarke, and myself. Nevertheless, with World War I, disillusionment set in. Science and technology, which promised an Eden, turned out to be capable of delivering Hell was well. The beautiful airplane that fulfilled the age-old dream of flight could deliver bombs. The chemical techniques that produced anesthetics, dyes, and medicines produced poison gas as well. The fear of supplantation rose again. In 1921, not long after the end of World War I, Karel Capek\u0027s drama R.U.R. appeared and it was the tale of Frankenstein again, escalated to the planetary level. Not a single monster was created but millions of robots (Capek\u0027s word, meaning \"worker,\" a mechanical one, that is). And it was not a single monster turning upon his single creator, but robots turning on humanity, wiping them out and supplanting them. From the beginning of the science fiction magazine in 1926 to 1959 (a third of a century or a generation) optimism and pessimism battled each other in science fiction, with optimism-thanks chiefly to the influence of John W. Campbell, Jr.-having the better of it. Beginning in 1939, I wrote a series of influential robot stories that self-consciously combated the \"Frankenstein complex\" and made of the robots the servants, friends, and allies of humanity. It was pessimism, however, that won in the end, and for two reasons: First, machinery grew more frightening. The fission bomb threatened physical destruction, of course, but worse still was the rapidly advancing electronic computer. Those computers seemed to steal the human soul. Deftly they solved our routine problems and more and more we found ourselves placing our questions in the hands of these machines with increasing faith, and accepting their answers with increasing humility. All that fission and fusion bombs can do is destroy us, the computer might supplant us. The second reason is more subtle, for it involved a change in the nature of the science fiction writer. Until 1959, there were many branches of fiction, with science fiction perhaps the least among them. It brought its writers less in prestige and money than almost any other branch, so that no one wrote science fiction who wasn\u0027t so fascinated by it that he was willing to give up any chance at fame and fortune for its sake. Often that fascination stemmed from an absorption in the romance of science so that science fiction writers would naturally picture men as winning the universe by learning to bend it to their will. In the 19508, however, competition with TV gradually killed the magazines that supported fiction, and by the time the 1960s arrived the only form of fiction that was flourishing, and even expanding, was science fiction. Its magazines continued and an incredible paperback boom was initiated. To a lesser extent it invaded movies and television, with its greatest triumphs undoubtedly yet to come. This meant that in the 1960s and 19708, young writers began to write science fiction not because they wanted to, but because it was there-and because very little else was there. It meant that many of the new generation of science fiction writers had no knowledge of science, no sympathy for it-and were in fact rather hostile to it. Such writers were far more ready to accept the fear half of the love/fear relationship of man to machine. As a result, contemporary science fiction, far more often than not, is presenting us, over and over, with the myth of the child supplanting the parent, Zeus supplanting Kronos, Satan supplanting God, the machine supplanting humanity. Nightmares they are, and they are to be read as such. - But allow me my own cynical commentary at the end. Remember that although Kronos foresaw the danger of being supplanted, and though he destroyed his children to prevent it-he was supplanted anyway, and rightly so, for Zeus was the better ruler. So it may be that although we will hate and fight the machines, we will be supplanted anyway, and rightly so, for the intelligent machines to which we will give birth may, better than we, carry on the striving toward the goal of understanding and using the universe, climbing to heights we ourselves could never aspire to.","sourceLink":"https://allnovel.net/robot-visions-robot-0-5/page-26.html","bookId":1742,"book":{"id":1742,"title":"Robot Visions (Robot #0.5)","description":"Storyline: Robot Visions (Robot 0.5) From Isaac Asimov, the writer whose name is synonymous with robots and the science of robotics, here are five decades of robot visions--thirty-four landmark stories and essays, including three rare tales--gathered together in one volume. Meet all of Asimov\u0027s most famous creations: Robbie, the very first robot that his imagination brought to life; Susan Calvin, the original robot psychologist; Stephen Byerley, the humanoid robot; and the famous human-robot detective team of Lije Baley and R. Daneel Olivaw, who have appeared in such bestselling novesl as The Robots of Dawn and Robots and Empire. Let the master himself guide you through the key moments in the fictional history of robot-human relations--from the most primitive computers and movile machines to the first robot to become a man. (Description from back cover)","cover":"https://allnovel.net/images/robot-visions-robot-0-5.jpg","author":"Isaac Asimov","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/robot-visions-robot-0-5.html","creation":"Oct 5, 2019 8:57:55 AM","modification":"Oct 5, 2019 10:15:59 AM"}}
