{"id":12378,"no":30,"title":"Chapter 30","content":"They milled about in confusion on a large raised platform under the blue sun. A sea of impossible creatures rolled and seethed on all sides of them, shutter-eyes, pin-hole eyes, simple light-sensitive receptors, multiple-tube eyes—hundreds of varieties all intent upon them. Steve heard voices around him on the platform, confused, alarmed. \"What\u0027s happening?\" \"This place looks like an auction block!\" \"Look at those creatures, will you?\" \"Are we for sale or something?\" The human voices faded into a meaningless babble. Someone else was speaking, but not aloud. It was like Charlie Stedman\u0027s voice, that day on Ganymede. Steve heard it inside his head and this time—because they all stood about more bewildered than ever—he knew that the Frank Buck\u0027s crew heard it too. \"Friends of Uashalume,\" the voice purred mentally, \"here, at opening day of the bazaar, we have a most unusual treat. Most unusual. Two of us, as you know, have already tested the models in question, and we find them entirely satisfactory.\" Charlie Stedman and LeClarc stepped forward, bowed. \"For the rest of you, one hundred choice specimens! We set no fixed price, but let this be said about the new garments. They are unspoiled, virgin material; they\u0027ve not been used before. You\u0027ll find them stimulating for that reason alone, I\u0027m sure. As for the vital statistics, they vary in height from three and a half to five klars; in weight from fifteen to twenty-nine jarons; they are a bisexual lot, although only one female of the species is present; their intellectual capacity is on the seventh level, their better minds can attain to problems of relativity and universal field; emotionally, they have twice the range of any previous garment!\" The voice paused significantly, permitted that point to sink in. \"Yes, twice the range. We none of us have ever experienced such strong, vital emotions. Can you imagine, twice the emotional range of the scouradi of Deneb XIX! It means a new way of life for those among us who select some of these humans for their own. \"Now, the auction-master will please step forward.\" \"We are for sale,\" Steiner gasped. It was Charlie Stedman who came to the fore, climbing the auction-block and looking around him. After a time, he singled out Steiner and pulled the man forward by an elbow. \"The first specimen is typical,\" he droned in English, and Steve figured he spoke mentally to the assembled throngs, reeling off the height, weight, and other vital statistics for Steiner. Finally: \"What am I bid?\" Mental voices sang out, one after another: \"Three char!\" \"Four.\" \"Six.\" \"Ten char.\" \"Ten?\" The man who was Charlie Stedman laughed. \"Ten char indeed! One hundred is not enough.\" The bidding continued, became hot, became a contest between two mental voices. Steiner went for seventy-four char, whatever a char was. They took him down and carted him away, struggling. It looked like an ugly scene would develop, for a score of men surged toward the front of the block angrily. But some of the creatures held what looked like strange, possibly lethal weapons, and Kevin growled: \"Not now! There\u0027s no sense getting all of us killed. Relax, and we\u0027ll see.\" Grumbling, the men subsided, and Kevin turned to Steve: \"If this isn\u0027t the damndest cosmic joke of all.\" \"What do you mean?\" \"We\u0027re hunters, big game hunters. We go out into space to hunt for specimens, only this time we\u0027ve become specimens ourselves! This time we weren\u0027t the hunters, but the quarry!\" The auction continued, and one by one the men were sold. Once one of them, a radar technician, bolted and ran. He was cut down quite efficiently by one of the hand-weapons and Charlie Stedman asserted it was a pity one of the specimens had been lost. \"Keep your tempers,\" Kevin said grimly as a wave of anger washed over the auction block. \"I don\u0027t like it any more than you do, but we won\u0027t fight until we understand—and then perhaps we\u0027ll have a chance.\" \n \n","sourceLink":"http://novel.tingroom.com/ertong/2816/77870.html","bookId":499,"book":{"id":499,"title":"Jungle in the Sky","description":"简介： The big man looked at home among his trophies. Somehow his scowl seemed as fierce as the head of the Venusian swamp-tiger mounted on the wall behind him, and there was something about his quick-darting eyes which reminded Steve of a Callistan fire-li...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2816","creation":"Aug 1, 2019 12:18:52 AM","modification":"Aug 1, 2019 12:18:52 AM"}}
