{"id":63247,"no":35,"title":"Page 35","content":"I stared at him, astonished by the casualness with which he\u0027d made the statement and the rueful amusement on his face that told me he wasn\u0027t entirely kidding. My sex clenched in delicious anticipation. I could easily picture becoming seriously addicted to Gideon Cross. I ate some fries, thinking of someone else who was addicted to Gideon. \"Magdalene could be a problem for me.\" He swallowed a bite of his burger and washed it down with a swig from his bottled water. \"She told me she\u0027d talked to you, and that it didn\u0027t go well.\" I gave props to Magdalene\u0027s scheming and the clever attempt to cut me off at the pass. I\u0027d have to be very careful with her, and Gideon was going to have to do something about her - like cut her off, period. \"No, it didn\u0027t go well,\" I agreed. \"But then I don\u0027t appreciate being told that you don\u0027t respect the women you f**k and that the moment you shoved your dick into me you were done with me.\" Gideon stilled. \"She said that?\" \"Word for word. She also said you\u0027re keeping on her ice until you\u0027re ready to settle down.\" \"Did she now?\" His low voice had a chilling bite to it. My stomach knotted, knowing things could either go really right or really wrong, depending on what Gideon said next. \"Don\u0027t you believe me?\" \"Of course I believe you.\" \"She could be a problem for me,\" I repeated, not letting it go. \"She won\u0027t be a problem. I\u0027ll talk to her.\" I hated the thought of him talking to her, because it made me sick with jealousy. I figured that was an issue I should disclose up front. \"Gideon...\" \"Yes?\" He\u0027d finished his burger and was working on the fries. \"I\u0027m a very jealous person. I can be irrational with it.\" I poked at my burger with a fry. \"You might want to think about that, and whether or not you want to deal with someone who has self-esteem issues like I do. It was one of my sticking points when you first propositioned me, knowing it was going to drive me nuts having women salivating all over you and not having the right to say anything about it.\" \"You have the right now.\" \"You\u0027re not taking me seriously.\" I shook my head and took another bite of my cheeseburger. \"I\u0027ve never been as serious about anything in my life.\" Reaching over, Gideon ran a fingertip over the corner of my mouth, and then licked off the dab of sauce he\u0027d collected. \"You\u0027re not the only one who can get possessive. I\u0027m very proprietary about what\u0027s mine.\" I didn\u0027t doubt that for a minute. I took another bite and thought of the night ahead. I was eager. Ridiculously so. I was dying to see Gideon naked. Dying to run my hands and lips all over him. Dying to have another go at driving him crazy. And I was damn near desperate to be under him, to feel him straining over me, pounding into me, coming hard and deep inside me... \"Keep thinking those thoughts,\" he said roughly, \"and you\u0027ll be late again.\" I looked at him with raised brows \"How did you know what I\u0027m thinking?\" \"You get this look on your face when you\u0027re turned on. I intend to put that look on your face as often as possible.\" Gideon covered his plate again and stood, withdrawing a business card from his pocket and setting it down beside me. I could see that he\u0027d written his home and cell phone numbers on the back. \"I feel stupid asking this question considering our present conversation, but I need your cell phone number.\" \"Oh.\" I forcibly dragged my thoughts out of the bedroom. \"I have to get one first. It\u0027s on my to-do list.\" \"What happened to the phone you were texting with last week?\" My nose wrinkled. \"My mother was using it to track my movements around the city. She\u0027s a tad...overprotective.\" \"I see.\" He brushed the backs of his fingers down my cheek. \"That\u0027s what you were talking about when you said your mom is stalking you.\" \"Yes, unfortunately.\" \"Okay, then. We\u0027ll take care of the phone after work before we head to the gym. It\u0027s safer for you to have one. And I want to be able to call you whenever I feel like it.\" I set down the quarter of my burger that I couldn\u0027t eat, and wiped my hands and mouth. \"That was delicious. Thank you.\" \"It was my pleasure.\" He leaned over me and pressed his lips briefly to mine. \"Do you need to use the washroom?\" \"Yes. I need my toothbrush from my purse, too.\" A few minutes later, I found myself standing in a washroom hidden behind a door that blended seamlessly with the mahogany paneling behind the flat screens. We brushed our teeth side by side at the double sink vanity, our gazes meeting in our mirrored reflections. It was such a domestic, normal thing to do and yet we both seemed to delight in it. \"I\u0027ll take you back down,\" he said, crossing his office to the coatrack. I followed him, but veered off when we reached his desk. I went to it and put my hand on the clear space in front of his chair. \"Is this where you are most of the day?\" \"Yes.\" He shrugged into his jacket and I wanted to bite him, he looked so delectable. Instead, I hopped up to sit directly in front of his chair. According to my watch I had five minutes. Barely enough time to get back to work, but still. I couldn\u0027t resist exercising my new rights. I pointed at his chair. \"Sit.\" His brows rose, but he came over without argument and settled gracefully into the seat. I spread my legs and crooked my finger. \"Closer.\" He rolled forward, filling the space between my thighs. He wrapped his arms around my h*ps and looked up at me. \"One day soon, Eva, I\u0027m going to f**k you right here.\"","sourceLink":"https://allnovel.net/bared-to-you-crossfire-1/page-35.html","bookId":1922,"book":{"id":1922,"title":"Bared to You (Crossfire #1)","description":"Storyline: Due to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. Do you like this book you can buy books: Bared to You (Crossfire #1) Gideon Cross came into my life like lightning in the darkness… He was beautiful and brilliant, jagged and white-hot. I was drawn to him as I’d never been to anything or anyone in my life. I craved his touch like a drug, even knowing it would weaken me. I was flawed and damaged, and he opened those cracks in me so easily… Gideon knew. He had demons of his own. And we would become the mirrors that reflected each other’s most private wounds…and desires.The bonds of his love transformed me, even as i prayed that the torment of our pasts didn\u0027t tear us apart...","cover":"https://allnovel.net/images/bared-to-you-crossfire-1.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/bared-to-you-crossfire-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:49:19 AM"}}
