{"id":63279,"no":67,"title":"Page 67","content":"His chest expanded on a deep breath. He didn\u0027t deny it. I bit back my anger. I could only imagine how terrible it must be for him to be so dependent on something - someone - he couldn\u0027t control. What mattered most at that moment were his willingness to try and the fact that it wasn\u0027t just talk. He\u0027d actually taken steps. \"It\u0027s going to be a lot of work, Gideon,\" I warned him. \"I\u0027m not afraid of work.\" He was touching me restlessly, his hands sliding over my thighs and bu**ocks as if caressing my bare skin was as necessary to him as breathing. \"I\u0027m only afraid of losing you.\" I pressed my cheek to his. We completed each other. Even now, as his hands roamed possessively over me, I felt a thawing in my soul, the desperate relief of being held - finally - by the man who understood and satisfied my deepest, most intimate desires. \"I need you.\" His mouth was sliding over my cheek and down my throat. \"I need to be inside you...\" \"No. My God. Not here.\" But my protest sounded weak even to my own ears. I wanted him anywhere, anytime, any way... \"It has to be here,\" he muttered, dropping to his knees. \"It has to be now.\" He chafed my skin ripping the lace of my panties away; then he shoved my skirts to my waist and licked my cleft, his tongue parting my folds to stroke over my throbbing clit. I gasped and tried to recoil, but there was nowhere to go. Not with the door at my back and a grimly determined Gideon in front, one hand keeping me pinned while the other lifted my left leg over his shoulder, opening me to his ardent mouth. My head thudded against the glass, heat pulsing through my blood from the point where his tongue was driving me mad. My leg flexed against his back, urging him closer, my hands cupping his head to hold him still as I rocked into him. Feeling the rough satin strands of his hair against my sensitive inner thighs was its own provocation, heightening my awareness of everything around me... We were in Gideon\u0027s parents\u0027 house, in the midst of a party attended by dozens of famous people, and he was on his knees, growling his hunger as he licked and sucked my slick, aching cleft. He knew just how to get to me, knew what I liked and needed. He had an understanding of my nature that went above and beyond his incredible oral skills. The combination was devastating and addicting. My body shook, my eyelids heavy from the illicit pleasure. \"Gideon...You make me come so hard.\" His tongue rubbed over and over the clenching entrance to my body, teasing me, making me grind shamelessly into his working mouth. His hands cupped my bare butt, kneading, urging me onto his tongue as he thrust it inside me. There was reverence in the greedy way he enjoyed me, the unmistakable sense that he worshipped my body, that pleasuring it and taking pleasure from it was as vital to him as the blood in his veins. \"Yes,\" I hissed, feeling the orgasm building. I was buzzed by champagne and the heated scent of Gideon\u0027s skin mixed with my own arousal. My br**sts strained within the increasingly too-tight confines of my strapless bra, my body trembling on the edge of a desperately needed orgasm. \"I\u0027m so close.\" A movement on the far side of the room caught my eye and I froze, my gaze locking with Magdalene\u0027s. She stood just inside the door, halted midstride, staring wide-eyed and open-mouthed at the back of Gideon\u0027s moving head. But he was either oblivious or too impassioned to care. His lips circled my cl*t and his cheeks hallowed. Sucking rhythmically, he massaged the hypersensitive knot with the tip of his tongue. Everything tightened viciously, then released in a fiery burst of pleasure. The orgasm poured through me in a scorching wave. I cried out, pumping my h*ps mindlessly into his mouth, lost to the primal connection between us. Gideon held me up as my knees weakened, tonguing my quivering flesh until the last tremor faded. When I opened my eyes again, our audience of one had fled. Standing in a rush, Gideon picked me up and carried me to the couch. He dropped me lengthwise on the cushion; then hauled my h*ps up to rest on the armrest, arching my spine. I eyed him up the length of my torso. Why not just fold me over and f**k me from behind? Then he ripped open his button-fly and pulled his big, beautiful penis out, and I didn\u0027t care how he took me just so long as he did. I whimpered as he shoved into me, my body struggling to accommodate the wonderful fullness I craved. Yanking my h*ps to meet his powerful thrusts, Gideon battered my tender sex with that brutally thick column of rigid flesh, his gaze dark and possessive, his breath leaving him in primitive grunts every time he hit the end of me. A trembling moan left me, the friction of his drives stirring my never-sated need to be f**ked senseless by him. Only him. A handful of strokes and his head fell back as he gasped my name, his h*ps rolling to stir me into a frenzy. \"Squeeze me, Eva. Squeeze my dick.\" When I complied, the ragged sound he made was so erotic my sex trembled in appreciation. \"Yeah, angel...just like that.\" I tightened around him and he cursed. His gaze found mine, the stunning blue hazed with sexual euphoria. A convulsive shudder wracked his powerful frame, followed by an agonized sound of ecstasy. His c**k jerked inside me, once, twice, and then he was coming long and hard, spurting hotly into the clutching depths of my body. I didn\u0027t have time to cl**ax again, but it didn\u0027t matter. I watched him with awe and pure female triumph. I could do this to him. In the moments of orgasm, I owned him as completely as he owned me. Chapter 16 Gideon folded over me, his hair falling forward to tickle my chest, his lungs heaving. \"God. I can\u0027t go days without this. Even the hours at work are too long.\"","sourceLink":"https://allnovel.net/bared-to-you-crossfire-1/page-67.html","bookId":1922,"book":{"id":1922,"title":"Bared to You (Crossfire #1)","description":"Storyline: Due to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. Do you like this book you can buy books: Bared to You (Crossfire #1) Gideon Cross came into my life like lightning in the darkness… He was beautiful and brilliant, jagged and white-hot. I was drawn to him as I’d never been to anything or anyone in my life. I craved his touch like a drug, even knowing it would weaken me. I was flawed and damaged, and he opened those cracks in me so easily… Gideon knew. He had demons of his own. And we would become the mirrors that reflected each other’s most private wounds…and desires.The bonds of his love transformed me, even as i prayed that the torment of our pasts didn\u0027t tear us apart...","cover":"https://allnovel.net/images/bared-to-you-crossfire-1.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/bared-to-you-crossfire-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:49:19 AM"}}
