{"id":63285,"no":73,"title":"Page 73","content":"I crossed my arms. \"I guess I\u0027m dumber than bricks. I thought our sex life was rockin\u0027.\"\\n\\n Setting his glass down, Gideon kept going as if I hadn\u0027t spoken. \"You asked me to meet a need of yours today and I agreed. Now we need to - \"\\n\\n \"If I\u0027m not what you want, just spit it out!\" I set the picture frame and my glass down before I did something with them I\u0027d regret. \"Don\u0027t try and pretty it up with - \"\\n\\n He was around the desk and on me before I could stumble back more than a couple steps. His mouth sealed over mine, his arms caged me. As he\u0027d done earlier, he carried me to a wall and restrained me against it, his hands banding my wrists and lifting them high above my head.\\n\\n Trapped, I could nothing as he bent his knees and stroked my cleft with the rigid length of his erection. Once, twice. Silk rasped against my swollen clit. The bite of his teeth on my covered nipple sent a shiver through me, while the clean scent of his warm skin intoxicated me. With a gasp, I sagged into his embrace.\\n\\n \"See how easily you submit when I take over?\" His lips followed the arch of my brow. \"And it feels good doesn\u0027t it? It feels right.\"\\n\\n \"That\u0027s not fair.\" I stared up at him. How could he expect me to respond any differently? As disturbed and confounded as I was, I was helplessly drawn to him.\\n\\n \"Of course it is. It\u0027s also true.\"\\n\\n My gaze roamed over that glorious mane of inky hair and the chiseled lines of his incomparable face. The longing I felt was so acute it was painful. The hidden damage inside him only made me love him more. There were times when I felt like I\u0027d found the other half of myself in him.\\n\\n \"I can\u0027t help it that you turn me on,\" I muttered, \"My body is physiologically supposed to soften and relax, so you can shove that big c**k inside me.\"\\n\\n \"Eva. Let\u0027s be honest. You want me to have total control. It\u0027s important to you that you can trust me to take care of you. There\u0027s nothing wrong with that. The reverse is true for me - I need you to trust me enough to give up that control.\"\\n\\n I couldn\u0027t think when he was pressed up against me, my body achingly aware of every hard inch of him. \"I am not submissive.\"\\n\\n \"You are with me. If you look back, you\u0027ll see you\u0027ve been yielding to me all along.\"\\n\\n \"You\u0027re good in bed! And have more experience. Of course I let you do what you want to me.\" I bit my lower lip to stop it from quivering. \"I\u0027m sorry I haven\u0027t been as exciting for you.\"\\n\\n \"Bullshit, Eva. You know how much I enjoy making love to you. If I could get away with it, I\u0027d do nothing else. We\u0027re not talking about games that get me off.\"\\n\\n \"Then we\u0027re talking about what gets me off? Is that what this is?\"\\n\\n \"Yes. I thought so.\" He frowned. \"You\u0027re upset. I didn\u0027t mean - Damn it. I thought discussing this would help us.\"\\n\\n \"Gideon.\" My eyes stung, then flooded with tears. He looked as wounded and confused as I felt. \"You\u0027re breaking my heart.\"\\n\\n Releasing my wrists, he stepped back and swept me up in his arms, carrying me out of his office and down the hallway to a closed door. \"Turn the knob,\" he said quietly.\\n\\n We entered a candlelit room that still smelled faintly of new paint. For a few seconds I was disoriented, unable to comprehend how we\u0027d stepped out of Gideon\u0027s apartment and into my bedroom.\\n\\n \"I don\u0027t understand.\" A serious understatement, but my brain was still trying to get past the feeling of being teleported from one residence to another. \"You...moved me in with you?\"\\n\\n \"Not quite.\" He set me down, but kept an arm around me. \"I recreated your room based on the photo I took of you sleeping.\"\\n\\n \"Why?\"\\n\\n What the hell? Who did something like that? Was this all to keep me from witnessing his nightmares?\\n\\n The thought shattered my heart further. I felt like Gideon and I were drifting further away from each other by the moment.\\n\\n His hands sifted through my damp hair, which only increased my agitation. I felt like batting his touch away and putting at least the length of the room between us. Maybe two rooms.\\n\\n \"If you feel the need to run,\" he said softly, \"you can come in here and shut the door. I promise not to bother you until you\u0027re ready. This way, you have your safe place and I know that you haven\u0027t left me.\"\\n\\n A million questions and speculations roared through my mind, but the one thing that stuck out was, \"Are we still going to share a bed when we\u0027re sleeping?\"\\n\\n \"Every night.\" Gideon\u0027s lips touched my forehead. \"How could you think otherwise? Talk to me, Eva. What\u0027s going through that beautiful head of yours?\"\\n\\n \"What\u0027s going through my head?\" I snapped. \"What the f**k is going on in yours? What happened to you in the four days we were broken up?\"\\n\\n His jaw tightened. \"We never broke up, Eva.\"\\n\\n The phone rang in the other room. I cursed under my breath. I wanted us to talk and I wanted him to go away, both at the same time.\\n\\n He squeezed my shoulders, and then let me go. \"That\u0027s our dinner.\"\\n\\n I didn\u0027t follow him when he left, feeling too unsettled to eat. Instead, I crawled onto the bed that was exactly like my own and curled around a pillow, closing my eyes. I didn\u0027t hear Gideon come back, but I felt him as he drew to a stop at the edge of the bed.\\n\\n \"Please don\u0027t make me eat alone,\" he said to my rigid back.\\n\\n \"Why don\u0027t you just order me to eat with you?\"\\n\\n He sighed, and then slid onto the bed to spoon behind me. His warmth was welcome, chasing away the chill that had brought goose bumps to my skin. He didn\u0027t say anything for a long while, just gave me the comfort of having him close. Or maybe he was taking comfort in me. \\n\\n","sourceLink":"https://allnovel.net/bared-to-you-crossfire-1/page-73.html","bookId":1922,"book":{"id":1922,"title":"Bared to You (Crossfire #1)","description":"Storyline: Due to some reason, the article content has been deleted. Please do sympathize ! Please read the other stories. \\n Do you like this book you can buy books: \\n Bared to You (Crossfire #1) \\n Gideon Cross came into my life like lightning in the darkness… \\n He was beautiful and brilliant, jagged and white-hot. I was drawn to him as I’d never been to anything or anyone in my life. I craved his touch like a drug, even knowing it would weaken me. I was flawed and damaged, and he opened those cracks in me so easily… \\n Gideon knew. He had demons of his own. And we would become the mirrors that reflected each other’s most private wounds…and desires.The bonds of his love transformed me, even as i prayed that the torment of our pasts didn\u0027t tear us apart...\\n","cover":"https://allnovel.net/images/bared-to-you-crossfire-1.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/bared-to-you-crossfire-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:49:19 AM"}}
