{"id":38271,"no":2,"title":"Chapter 2","content":"“Because he looks at you in that way, mamma, and squeezes your hand.” “Nonsense, child,” said Mrs. Thompson; “hold your tongue. I don’t know what can have put such stuff into your head.” “But he does, mamma,” said Mimmy, who rarely allowed her mother to put her down. Mrs. Thompson made no further answer, but again sat with her head resting on her hand. She also, if the truth must be told, was thinking of M. Lacordaire and his fondness for herself. He had squeezed her hand and he had looked into her face. However much it may have been nonsense on Mimmy’s part to talk of such things, they had not the less absolutely occurred. Was it really the fact that M. Lacordaire was in love with her? And if so, what return should she, or could she make to such a passion? He had looked at her yesterday, and squeezed her hand to-day. Might it not be probable that he would advance a step further to-morrow? If so, what answer would she be prepared to make to him? She did not think—so she said to herself—that she had any particular objection to marrying again. Thompson had been dead now for four years, and neither his friends, nor her friends, nor the world could say she was wrong on that score. And as to marrying a Frenchman, she could not say she felt within herself any absolute repugnance to doing that. Of her own country, speaking of England as such, she, in truth, knew but little—and perhaps cared less. She had gone to India almost as a child, and England had not been specially kind to her on her return. She had found it dull and cold, stiff, and almost ill-natured. People there had not smiled on her and been civil as M. Lacordaire had done. As far as England and Englishmen were considered she saw no reason why she should not marry M. Lacordaire. And then, as regarded the man; could she in her heart say that she was prepared to love, honour, and obey M. Lacordaire? She certainly knew no reason why she should not do so. She did not know much of him, she said to herself at first; but she knew as much, she said afterwards, as she had known personally of Mr. Thompson before their marriage. She had known, to be sure, what was Mr. Thompson’s profession and what his income; or, if not, some one else had known for her. As to both these points she was quite in the dark as regarded M. Lacordaire. Personally, she certainly did like him, as she said to herself more than once. There was a courtesy and softness about him which were very gratifying to her; and then, his appearance was so much in his favour. He was not very young, she acknowledged; but neither was she young herself. It was quite evident that he was fond of her children, and that he would be a kind and affectionate father to them. Indeed, there was kindness in all that he did. Should she marry again,—and she put it to herself quite hypothetically,—she would look for no romance in such a second marriage. She would be content to sit down in a quiet home, to the tame dull realities of life, satisfied with the companionship of a man who would be kind and gentle to her, and whom she could respect and esteem. Where could she find a companion with whom this could be more safely anticipated than with M. Lacordaire? And so she argued the question within her own breast in a manner not unfriendly to that gentleman. That there was as yet one great hindrance she at once saw; but then that might be remedied by a word. She did not know what was his income or his profession. The chambermaid, whom she had interrogated, had told her that he was a “marchand.” To merchants, generally, she felt that she had no objection. The Barings and the Rothschilds were merchants, as was also that wonderful man at Bombay, Sir Hommajee Bommajee, who was worth she did no know how many thousand lacs of rupees. That it would behove her, on her own account and that of her daughters, to take care of her own little fortune in contracting any such connection, that she felt strongly. She would never so commit herself as to put security in that respect out of her power. But then she did not think that M. Lacordaire would ever ask her to do so; at any rate, she was determined on this, that there should never be any doubt on that matter; and as she firmly resolved on this, she again took up her book, and for a minute or two made an attempt to read. “Mamma,” said Mummy, “will M. Lacordaire go up to the school to see Lilian when you go away from this?” “Indeed, I cannot say, my dear. If Lilian is a good girl, perhaps he may do so now and then.” “And will he write to you and tell you how she is?” “Lilian can write for herself; can she not?” “Oh yes; I suppose she can; but I hope M. Lacordaire will write too. We shall come back here some day; shan’t we, mamma?” “I cannot say, my dear.” “I do so hope we shall see M. Lacordaire again. Do you know what I was thinking, mamma?” “Little girls like you ought not to think,” said Mrs. Thompson, walking slowly out of the room to the top of the stairs and back again; for she had felt the necessity of preventing Mimmy from disclosing any more of her thoughts. “And now, my dear, get yourself ready, and we will go up to the school.” Mrs. Thompson always dressed herself with care, though not in especially fine clothes, before she went down to dinner at the table d’h?te; but on this occasion she was more than usually particular. She hardly explained to herself why she did this; but, nevertheless, as she stood before the glass, she did in a certain manner feel that the circumstances of her future life might perhaps depend on what might be said and done that evening. She had not absolutely decided whether or no she would go to the Prince’s chateau; but if she did go—. Well, if she did; what then? She had sense enough, as she assured herself more than once, to regulate her own conduct with propriety in any such emergency. During the dinner, M. Lacordaire conversed in his usual manner, but said nothing whatever about the visit to Polignac. He was very kind to Mimmy, and very courteous to her mother, but did not appear to be at all more particular than usual. Indeed, it might be a question whether he was not less so. As she had entered the room Mrs. Thompson had said to herself that, perhaps, after all, it would be better that there should be nothing more thought about it; but before the four of five courses were over, she was beginning to feel a little disappointed. And now the fruit was on the table, after the consumption of which it was her practice to retire. It was certainly open to her to ask M. Lacordaire to take tea with her that evening, as she had done on former occasions; but she felt that she must not do this now, considering the immediate circumstances of the case. If any further steps were to be taken, they must be taken by him, and not by her;—or else by Mimmy, who, just as her mother was slowly consuming her last grapes, ran round to the back of M. Lacordaire’s chair, and whispered something into his ear. It may be presumed that Mrs. Thompson did not see the intention of the movement in time to arrest it, for she did nothing till the whispering had been whispered; and then she rebuked the child, bade her not to be troublesome, and with more than usual austerity in her voice, desired her to get herself ready to go up stairs to their chamber. As she spoke she herself rose from her chair, and made her final little bow to the table, and her other final little bow and smile to M. Lacordaire; but this was certain to all who saw it, that the smile was not as gracious as usual. As she walked forth, M. Lacordaire rose from his chair—such being his constant practice when she left the table; but on this occasion he accompanied her to the door. “And has madame decided,” he asked, “whether she will permit me to accompany her to the chateau?” “Well, I really don’t know,” said Mrs. Thompson. “Mees Meemy,” continued M. Lacordaire, “is very anxious to see the rock, and I may perhaps hope that Mees Lilian would be pleased with such a little excursion. As for myself—” and then M. Lacordaire put his hand upon his heart in a manner that seemed to speak more plainly than he had ever spoken. “Well, if the children would really like it, and—as you are so very kind,” said Mrs. Thompson; and so the matter was conceded. “To-morrow afternoon?” suggested M. Lacordaire. But Mrs. Thompson fixed on Saturday, thereby showing that she herself was in no hurry for the expedition. “Oh, I am so glad!” said Mimmy, when they had re-entered their own room. “Mamma, do let me tell Lilian myself when I go up to the school to-morrow!” But mamma was in no humour to say much to her child on this subject at the present moment. She threw herself back on her sofa in perfect silence, and began to reflect whether she would like to sign her name in future as Fanny Lacordaire, instead of Fanny Thompson. It certainly seemed as though things were verging towards such a necessity. A marchand! But a marchand of what? She had an instinctive feeling that the people in the hotel were talking about her and M. Lacordaire, and was therefore more than ever averse to asking any one a question. As she went up to the school the next afternoon, she walked through more of the streets of Le Puy than was necessary, and in every street she looked at the names which she saw over the doors of the more respectable houses of business. But she looked in vain. It might be that M. Lacordaire was a marchand of so specially high a quality as to be under no necessity to put up his name at all. Sir Hommajee Bommajee’s name did not appear over any door in Bombay;—at least, she thought not. And then came the Saturday morning. “We shall be ready at two,” she said, as she left the breakfast-table; “and perhaps you would not mind calling for Lilian on the way.” M. Lacordaire would be delighted to call anywhere for anybody on behalf of Mrs. Thompson; and then, as he got to the door of the salon, he offered her his hand. He did so with so much French courtesy that she could not refuse it, and then she felt that his purpose was more tender than ever it had been. And why not, if this was the destiny which Fate had prepared for her? Mrs. Thompson would rather have got into the carriage at any other spot in Le Puy than at that at which she was forced to do so—the chief entrance, namely, of the H?tel des Ambassadeurs. And what made it worse was this, that an appearance of a special fate was given to the occasion. M. Lacordaire was dressed in more than his Sunday best. He had on new yellow kid gloves. His coat, if not new, was newer than any Mrs. Thompson had yet observed, and was lined with silk up to the very collar. He had on patent leather boots, which glittered, as Mrs. Thompson thought, much too conspicuously. And as for his hat, it was quite evident that it was fresh that morning from the maker’s block. In this costume, with his hat in his hand, he stood under the great gateway of the hotel, ready to hand Mrs. Thompson into the carriage. This would have been nothing if the landlord and landlady had not been there also, as well as the man-cook, and the four waiters, and the fille de chambre. Two or three other pair of eyes Mrs. Thompson also saw, as she glanced round, and then Mimmy walked across the yard in her best clothes with a fête-day air about her for which her mother would have liked to have whipped her. But what did it matter? If it was written in the book that she should become Madame Lacordaire, of course the world would know that there must have been some preparatory love-making. Let them have their laugh; a good husband would not be dearly purchased at so trifling an expense. And so they sallied forth with already half the ceremony of a wedding. Mimmy seated herself opposite to her mother, and M. Lacordaire also sat with his back to the horses, leaving the second place of honour for Lilian. “Pray make yourself comfortable, M. Lacordaire, and don’t mind her,” said Mrs. Thompson. But he was firm in his purpose of civility, perhaps making up his mind that when he should in truth stand in the place of papa to the young lady, then would be his time for having the back seat in the carnage. Lilian, also in her best frock, came down the school-steps, and three of the school teachers came with her. It would have added to Mrs. Thompson’s happiness at that moment if M. Lacordaire would have kept his polished boots out of sight, and put his yellow gloves into his pocket. And then they started. The road from Le Puy to Polignac is nearly all up hill; and a very steep hill it is, so that there was plenty of time for conversation. But the girls had it nearly all to themselves. Mimmy thought that she had never found M. Lacordaire so stupid; and Lilian told her sister on the first safe opportunity that occurred, that it seemed very much as though they were all going to church. “And do any of the Polignac people ever live at this place?” asked Mrs. Thompson, by way of making conversation; in answer to which M. Lacordaire informed madame that the place was at present only a ruin; and then there was again silence till they found themselves under the rock, and were informed by the driver that the rest of the ascent must be made on foot. The rock now stood abrupt and precipitous above their heads. It was larger in its circumference and with much larger space on its summit than those other volcanic rocks in and close to the town; but then at the same time it was higher from the ground, and quite as inaccessible, except by the single path which led up to the chateau. M. Lacordaire, with conspicuous gallantry, first assisted Mrs. Thompson from the carriage, and then handed down the two young ladies. No lady could have been so difficult to please as to complain of him, and yet Mrs. Thompson thought that he was not as agreeable as usual. Those horrid boots and those horrid gloves gave him such an air of holiday finery that neither could he be at his ease wearing them, nor could she, in seeing them worn. They were soon taken in hand by the poor woman whose privilege it was to show the ruins. For a little distance they walked up the path in single file; not that it was too narrow to accommodate two, but M. Lacordaire’s courage had not yet been screwed to a point which admitted of his offering his arm to the widow. For in France, it must be remembered, that this means more than it does in some other countries. Mrs. Thompson felt that all this was silly and useless. If they were not to be dear friends this coming out fêting together, those boots and gloves and new hat were all very foolish; and if they were, the sooner they understood each other the better. So Mrs. Thompson, finding that the path was steep and the weather warm, stood still for a while leaning against the wall, with a look of considerable fatigue in her face. “Will madame permit me the honour of offering her my arm?” said M. Lacordaire. “The road is so extraordinarily steep for madame to climb.” Mrs. Thompson did permit him the honour, and so they went on till they reached the top. The view from the summit was both extensive and grand, but neither Lilian nor Mimmy were much pleased with the place. The elder sister, who had talked over the matter with her school companions, expected a fine castle with turrets, battlements, and romance; and the other expected a pretty smiling house, such as princes, in her mind, ought to inhabit. Instead of this they found an old turret, with steps so broken that M. Lacordaire did not care to ascend them, and the ruined walls of a mansion, in which nothing was to be seen but the remains of an enormous kitchen chimney. “It was the kitchen of the family,” said the guide. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2902/80025.html","bookId":1106,"book":{"id":1106,"title":"The Chateau of Prince Polignac","description":"简介： Few Englishmen or Englishwomen are intimately acquainted with the little town of Le Puy. It is the capital of the old province of Le Velay, which also is now but little known, even to French ears, for it is in these days called by the imperial name o...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2902","creation":"Aug 1, 2019 12:24:21 AM","modification":"Aug 1, 2019 12:24:21 AM"}}
