{"id":85413,"no":25,"title":"Page 25","content":"\\n\\n ‘Can you imagine me?’ I scoffed as we neared the bar. ‘I’d be screaming about breaking a nail within five seconds.’\\n\\n Cam gave me a look as he held the wrought-iron gate to the basement stairs open for me. ‘See, that’s the kind of bullshit other people believe. I know better.’\\n\\n ‘Oh, you do, do you?’\\n\\n ‘You were sitting chewing a nail last night after dinner.’\\n\\n ‘Yeah, but I filed it and repainted it for work this morning.’\\n\\n He flashed his teeth at me. ‘Whatever, Walker. I know the truth.’\\n\\n ‘Evenin’, Jo, Cam,’ Brian greeted us as we came down the stairs. He stood beside Phil, who was grinning at me like always.\\n\\n ‘Hi, guys.’\\n\\n ‘Brian, Phil.’ Cam nodded at them.\\n\\n As I made to pass them, Phil stopped me with a hand on my arm. He ran his eyes down my body. ‘Still with Malcolm?’\\n\\n ‘Persistent Philip, I am still with Malcolm.’\\n\\n He winked at me. ‘Persistence will win in the end.’\\n\\n ‘And so will an STD,’ Cam put in drolly, gently pushing me forward with his hands on my back so that Phil had to let me go. ‘But you already know that, right, Phil?’\\n\\n I tried to stifle my giggle as we walked into the bar to the sounds of Brian howling with laughter and Phil swearing at him. ‘It was only that one time. Fuck! I’m never telling you anything again, Bri.’\\n\\n ‘Euch,’ I whispered to Cam. ‘That was more than I needed to know.’\\n\\n ‘Correction: that was the one thing you needed to know.’\\n\\n I laughed again and we sauntered into the staff room, barely getting a ‘hello, goodbye’ out of Su, who came racing out of her office at the sight of us and disappeared as quickly as she’d materialized.\\n\\n ‘It amazes me that anything gets done around here,’ Cam said, shrugging out of his jacket. ‘She’s never here when she should be.’\\n\\n I grunted at that, completely used to Su’s physical absence and as always grateful for it.\\n\\n The bar soon started to fill up. As usual on a Tuesday, there weren’t many customers, but we were kept relatively occupied.\\n\\n We weren’t busy enough to diminish our attraction to one another, however. For some reason, being behind the bar together seemed to heighten the tension. Was it the confined space? I didn’t know. All I did know was that I spent half the time with one eye on my work and the other on Cam.\\n\\n Joss was right. I was absolutely aware of every move he made.\\n\\n And speaking of Joss, I wasn’t at all surprised when she stopped in at around nine thirty. I was surprised she was alone, but she explained that Braden was working late and Ellie and Adam were on a date.\\n\\n ‘So you were bored and thought you’d come to work?’ I asked, sliding her a Diet Coke as she settled on to a stool at my end of the bar. I didn’t think so. I thought she was worried about me.\\n\\n Joss just smiled and then nodded in greeting to Cam, who had just noticed her presence, but he was too busy talking to a customer to come over. No, not a customer. My eyes focused more carefully on the girl he was grinning at so flirtatiously. Becca and a friend. She handed him his aviator watch and Cam leaned over and pressed a soft kiss to Becca’s lips.\\n\\n I felt an ache rake across my chest, unfamiliar and brutal.\\n\\n My eyes slid back to Joss and she had one eyebrow raised at me. ‘What you’re feeling … it’s called jealousy. It’s a vile emotion, I know. However, it also tells you that Cam is definitely more than just someone you’re attracted to.’\\n\\n ‘We barely know each other.’\\n\\n ‘From what you’ve told me, you know each other better than almost anyone else does.’\\n\\n Somehow, this was the truth. I leaned forward on the bar, frowning at my friend. ‘Yeah, how did that happen?’\\n\\n ‘How did what happen?’ I turned my head to see Cam approaching, fastening his watch on his wrist. Becca and the other girl were gone. He waited for an answer, his eyes curious on mine.\\n\\n I decided to hedge. ‘You really are a nosy bugger, aren’t you?’ I teased.\\n\\n Cam tipped his head to the side, contemplating me. ‘Deflection?’ His eyes glittered as if something had just occurred to him. ‘You were talking about me, weren’t you?’\\n\\n I wanted to wipe that cocky smile off his face.\\n\\n Joss groaned. ‘You and Braden should be forced to join a club for men who need to get over themselves.’\\n\\n My eyes slid to her in amusement. ‘Blatant displays of egotism will be punished in the form of making them wear Speedos in freezing-cold conditions.’\\n\\n ‘And possibly withholding food.’\\n\\n ‘No. Sex. Withholding sex.’\\n\\n Joss bit her lip. ‘I don’t know if that would work for me.’\\n\\n I eyed her incredulously. ‘Are you telling me you couldn’t go without sex for a few days?’\\n\\n ‘I don’t think so.’\\n\\n ‘Where is your willpower?’\\n\\n My friend took a swig of her Diet Coke. ‘Hey, you haven’t had sex with Braden Carmichael.’\\n\\n No, I hadn’t, although I almost blushed remembering I’d definitely tried to get myself into the position to do so. ‘Yeah, but I’ve had perfectly good sex and I could still abstain for a few days.’\\n\\n ‘Perfectly good sex?’ Cam interrupted us, drawing both our gazes. His voice was low with some unnamed emotion. ‘Abstain?’ His now heated eyes ran the length of me before returning to meet mine. ‘Then he isn’t doing it right.’\\n\\n My heart puttered to a stop before choking and wheezing. When it got back up to speed, it took off in a drag race. All that sexual heat rolled over me and I felt my knickers grow damp with want.\\n\\n ‘Jesus C,’ Joss croaked. ‘Now I’m turned on.’ She jumped off her stool, checking her phone. ‘I think I’ll go home and see if Braden’s back from work.’\\n\\n And just like that she left us simmering in our sexual chemistry.\\n\\n I smiled weakly at Cam. ‘How’s Becca?’\\n\\n A few customers approached the bar and we both moved to serve them. As we were preparing their drinks Cam answered tightly, ‘Becca’s fine. How’s Malcolm?’\\n\\n ‘Fine.’ He’d taken me for lunch during my break from work that day and I’d managed to convince him that everything was hunky-dory.\\n\\n ‘Cole text yet to say if he’s home?’\\n\\n I found myself grinning like an idiot at his concern, and my customer grinned back at me, clearly thinking the look was for him. I quickly handed him his change and turned to Cam. ‘Yeah, he’s home.’\\n\\n His eyes crinkled at the corners, adding another one of his expressions to my favourites. ‘Good.’\\n\\n The rest of the night flew by. We worked, we talked, we joked, but the sexual undercurrent remained. When we walked home after our shift, we did so in utter silence. I could say it was just tiredness, but my whole body was vibrating like a tuning fork just strolling beside him. We said goodnight at his door, and as I took the stairs to my flat with his eyes on my back, I wished, not for the first time, for a different life – that Cam was single, that Malcolm wasn’t a part of my life that I cared about, and that for once I could do what I really wanted to do.\\n\\n And what I really wanted to do was Cameron MacCabe.\\n\\n I checked on Cole and found him sleeping peacefully in his room. I even checked on Mum just to make sure she hadn’t choked on her own vomit or anything like that, and I found her snoring away. That done, I changed into my PJs and crawled into bed. But I couldn’t fall asleep.\\n\\n My blood felt as if it was on fire in my veins, my nerves were sparking at the very ends, and I couldn’t get the smell of Cam’s cologne out of my nostrils.\\n\\n I was so turned on, it wasn’t funny.\\n\\n How different would my night have been if Cam had followed me into Su’s office when I’d gone in there to leave her new stock information? What if he’d come up behind me, pushed my hair off my neck, and pressed his hot mouth to my skin as his hand skimmed around my waist and down to the buttons on my jeans …\\n\\n … if he’d undone them, his long fingers sliding inside, beneath my underwear …\\n\\n My own hand smoothed over my stomach, slipping under my pyjamas and knickers so I could bring myself to climax, fantasizing about Cam screwing me against Su’s desk.\\n\\n I muffled my moan as I came and once the tremors stopped, I curled into my side, guilt cascading over me once again.\\n\\n I was a terrible girlfriend.\\n\\n 13\\n\\n A truth I hadn’t been willing to face pushed its way to the forefront of my life over the next few weeks. The truth was, for a number of years now every day had been the same – had been constrained, dulled, vivid colours muted beneath the shadow of a wall. And behind that wall I walked in the same uniform every day – if I wanted to be really melodramatic, I’d call it a dull orange jumpsuit. But as the days of those few weeks flew by, I felt that uniform melting away, shredding into tatters and scraped from my body as I climbed the wall to the other side.\\n\\n The wall was moving further away now, the shadow lifting, the colours brightening.\\n\\n All because I was spending time with Cam.\\n\\n We hung out as much as possible on weekdays. Every night, in fact, he’d stop by for coffee or dinner before his work shift, even if I was out with Malcolm. We walked back and forth to work together, and had a laugh with Joss during our shifts. I didn’t see him at the weekends because he worked, trained at judo class with his friends and hung out with Becca. Last time, he’d taken Cole to watch the class, encouraging Cole to do more physical activity, and surprisingly, my brother was embracing the idea. My ears were bleeding from hearing about judo.\\n\\n For me, Cam was a confidant. I told him more about my life and my hopes for Cole’s future. For Cole, Cam was a soul mate. They drew comics together, they discussed comics together, they liked the same music, the same movies, and from what I could read between the lines, Cam also answered all those questions Cole wouldn’t dare ask me. \\n\\n","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-25.html","bookId":1893,"book":{"id":1893,"title":"Down London Road (On Dublin Street #2)","description":"Storyline: Down London Road (On Dublin Street #2) \\n Johanna Walker is used to taking charge. But she’s about to meet someone who will make her lose control.... \\n It has always been up to Johanna to care for her family, particularly her younger brother, Cole. With an absent father and a useless mother, she’s been making decisions based on what’s best for Cole for as long as she can remember. She even determines what men to date by how much they can provide for her brother and her, not on whatever sparks may—or may not—fly. \\n But with Cameron MacCabe, the attraction is undeniable. The sexy new bartender at work gives her butterflies every time she looks at him. And for once, Jo is tempted to put her needs first. Cam is just as obsessed with getting to know Jo, but her walls are too solid to let him get close enough to even try. \\n Then Cam moves into the flat below Jo’s, and their blistering connection becomes impossible to ignore. Especially since Cam is determined to uncover all of Jo’s secrets …even if it means taking apart her defenses piece by piece.\\n","cover":"https://allnovel.net/images/down-london-road-on-dublin-street-2.jpg","author":"Samantha Young","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/down-london-road-on-dublin-street-2.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:05:22 PM"}}
