{"id":85440,"no":52,"title":"Page 52","content":"\n Pleased, I laughed, and the mood between us relaxed. By the time the food arrived we’d caught each other up on everything that had happened that week.\n ‘I think Cole has been missing judo,’ I said. Cam had been too busy to attend class, so Cole had missed out too. Consequently he’d seemed restless and bored all week. When Cam didn’t answer, I looked up from my salmon to find him texting. ‘Something wrong?’\n He shook his head. ‘Nah, it’s just Blair.’\n And just like that, a dark cloud rolled over our table and burst, drenching me in cold, wet miserableness. I waited a couple of seconds, but he continued to text. My patience snapped. ‘Can you text her later? We’re supposed to be spending time together.’\n ‘Sorry.’ He flashed me a look of concern before hitting SEND and tucking his phone back in his pocket. ‘She left her Kindle at my flat last night.’\n I felt like he had just kicked me in the stomach. His casual announcement knocked the breath out of me and it took me a moment to pull myself together. ‘She was at your flat last night?’\n Catching the accusation in my tone, Cam’s eyebrows knitted together. ‘Is that a problem?’\n My blood heated and I had a sudden vision of throwing my salmon and potatoes in his face and screaming, ‘Yes, it’s a fucking problem!’\n Instead, I pushed my plate back and gave him a look that suggested he was a complete and utter dunce. ‘Let’s see … you were alone in your flat last night with your ex-lover. Why on earth would that bother me?’\n ‘We’ve been over this. We’re just friends.’\n ‘And if I have a problem with that?’\n ‘You said you trusted me.’\n I leaned over the table, keeping my voice low, trying not to cause a scene. ‘Ten minutes ago you acted like a possessive asshole in my place of business over a couple of guys flirting with me. How can you not see that inviting your ex-girlfriend over to your flat and not telling your current girlfriend is a huge bloody problem?’ My voice rose on the last three words and people turned to look. Cheeks burning, I stood up from the table. ‘I’m going back to work.’\n ‘Johanna.’ Cam stood to stop me, but I’d already grabbed my bag and moved towards the doorway, leaving him in my dust, knowing he couldn’t follow me before paying for our meal.\n I was so upset I couldn’t return to work immediately. I let myself into the Gardens and sat on a bench tucked behind a tree, and I sniffled away to myself.\n Being with Cameron had turned me into an emotional wreck.\n My phone rang. It was Cam. I ignored him.\n And then I got a text.\n Baby, I’m sorry. You’re right. I would have been pissed off, too. Come by the flat after work so we can talk. I hate fighting with you. x\n I swiped the tears out of the corner of my eyes before I picked up the phone to text him back.\n Okay. x\n That was all he was getting. After all, I was still hurt and severely pissed off at his inconsiderate assholery.\n Although I’m not one of those people who infect everyone else with their bad moods, I was so lost in my own thoughts for the rest of the day that my colleagues gave me a wide berth, sensing my misery. I didn’t know what I would say to Cam when I saw him. Was I going to get over the whole Blair thing? I didn’t think so. Was I going to make him choose between me and her? I wanted to, but that just made me the shittiest person ever. I couldn’t dictate to Cam who he was and was not friends with.\n By the time I knocked on his door I felt ill with uncertainty.\n He opened the door, looking relieved to see me. I gave him nothing, brushing by him briskly. I strode into his living room and the first thing I saw on the coffee table was her effing Kindle. I dumped my bag and threw my phone on the table beside it. ‘She’s not picked it up, then?’\n ‘Jo …’\n At his plaintive tone, I spun on my heel and raised an eyebrow at him. ‘You know I was willing to believe it was just me. Just me and my stupid insecurities. But having her over here without telling me, that was really crap of you, Cam.’\n It had been a long time since I’d seen Cam look guilty. The last time, in fact, had been when he realized he’d been wrong about me, when we’d sat in this room and I’d trusted him with my life story. He had the same look on his face now. ‘I am sorry I didn’t tell you. But it was completely innocent.’\n I bit my lip, feeling my stomach roil with emotion. ‘I have a problem with her,’ I confessed.\n ‘She hasn’t done anything wrong. Jo, Blair and I were friends before we were a couple, and I’m just catching up with an old friend. That’s it. You need to grow up about this.’\n I hated him. Right then, I actually physically hated him.\n ‘Don’t speak to me like that, you condescending dick.’\n ‘Jo –’\n ‘Why didn’t you tell me she was here last night?’\n ‘I didn’t hide it from you. I told you at lunch. If something was going on I wouldn’t fucking tell you, would I?’ His voice began to mimic mine, rising in frustration.\n ‘You said you loved her.’\n ‘Loved. Past tense.’\n Ignoring his growing impatience, I crossed my arms over my chest and attempted to drive my point home. ‘You didn’t break up because you fell out of love, Cameron. You broke up because you were scared she was going to leave you. You were scared she wasn’t going to choose you and so you walked away first.’\n Anger sparked in his eyes and he took a few steps towards me, bearing down on me. ‘You don’t know shit.’\n For once I wasn’t daunted. I was too pissed off. ‘I know I’m right.’\n Cameron cursed under his breath and looked down at the table where her Kindle was. ‘This conversation is insane.’\n Before I could respond to that non-answer to my non-question, my phone rang. I was about to turn around to pick it up and shut it off when I froze at the look on Cam’s face. His eyes had narrowed on my phone, studying it, it seemed. Gently brushing me aside, he reached to pick it up. As he stared at the screen, his jaw clenched, the muscle in his cheek popping as he lifted furious eyes to my face.\n My heart suddenly began to pound in my chest.\n Cam turned the phone towards me. The screen read MALCOLM CALLING. ‘What’s he doing calling you? What? Did you go running off to him at the first sign of trouble?’\n I flinched at the accusation. ‘No. We talk sometimes.’\n Wrong thing to say. ‘You’ve kept in contact with him and you didn’t tell me?’\n Uh-oh. I shrugged.\n Cam gave a huff of disbelief. ‘I’m standing here getting grilled about Blair and you’ve been keeping Malcolm from me? Why? Why not tell me?’\n I threw up my hands, wondering how on earth the argument had turned on me. ‘Because it doesn’t matter. He’s just a friend.’\n His expression turned glacial, jealousy and anger and disgust in his eyes.\n And his next words broke my heart.\n ‘No. Blair’s just a friend. Malcolm’s a rich fuck who still has a hard-on for you, and he lets you dangle him on a string. Got a problem with me hanging out with Blair? Think I’m keeping her around in case you and I don’t work out? Well, what’s to say you’re not ready to spread your legs for Malcolm if what we have goes south?’\n I guess that’s the problem when you really get to know someone. You learn all their triggers and emotional buttons, and unfortunately, in times of war, you press them. The button Cam pressed had direct access to my tear ducts, and salt water spilled down my cheeks in anguished silence. I took a step away from him, feeling sick. I ignored his remorseful expression, concentrating on those ugly words and what they meant.\n They meant he had never stopped thinking of me as a shallow gold-digger. He’d never believed that I could be more than that. Not really. Did that mean he’d never meant anything he’d said to me?\n The pain wouldn’t allow the silence to hold and I lost control of a sob.\n ‘Fuck, Jo.’ He swore hoarsely, trying to reach for me. ‘I didn’t –’\n ‘Don’t touch me.’ I ripped my phone out of his hands and seized my purse.\n ‘Jo, I didn’t mean it.’ He grabbed my arm. ‘I was just –’\n ‘Let go!’ I screamed in his face, wrenching myself away from him, frightened that if I let him touch me I’d give in to him as I always did. I sagged with grief as I backed away.\n ‘I didn’t mean it.’ His eyes were bright with a panic I couldn’t quite process.\n ‘What are we doing?’ I shook my head. ‘Is this worth it? Is it worth the way I’ve been feeling the last few weeks? I feel raw all the time, like my heart has been laid out on a butcher’s block and you’re hammering away at it. I thought it was me. I didn’t feel smart or interesting enough for you. I kept thinking, “Any minute now he’s going to wake up and wonder what the fuck he’s doing with me.” ’\n Cam sucked in a breath. ‘No –’\n ‘I thought it was me,’ I repeated. ‘That my insecurities were the problem. Not you and Blair. But then last night, you hanging out with her … not telling me, not talking to me about it, expecting that I would be okay with it? And maybe not telling you about Malcolm wasn’t right either. But none of that really matters in the face of this.’ I wiped a hand down my cheek, trying to clear the stream of tears. But as I began to speak again, more poured out. ‘You said you wanted me to see that there was so much more to me than even I realized. No one had ever told me I was smart or talented or brave, or that I deserved more than what I’d asked for. Until you. And it turns out you never really believed that. You always believed that deep down I’m just this shallow girl that would fuck her way to a gold mine.’\n ‘No,’ he argued, taking hold of my arms to shake me. ‘I was just pissed off. It came out wrong. I didn’t mean it.’ He tried to pull me into a hug, but I struggled against him. ‘Baby, stop, just stop. I can’t –’ \n","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-52.html","bookId":1893,"book":{"id":1893,"title":"Down London Road (On Dublin Street #2)","description":"Storyline: \n Down London Road (On Dublin Street #2) \n Johanna Walker is used to taking charge. But she’s about to meet someone who will make her lose control.... \n It has always been up to Johanna to care for her family, particularly her younger brother, Cole. With an absent father and a useless mother, she’s been making decisions based on what’s best for Cole for as long as she can remember. She even determines what men to date by how much they can provide for her brother and her, not on whatever sparks may—or may not—fly. \n But with Cameron MacCabe, the attraction is undeniable. The sexy new bartender at work gives her butterflies every time she looks at him. And for once, Jo is tempted to put her needs first. Cam is just as obsessed with getting to know Jo, but her walls are too solid to let him get close enough to even try. \n Then Cam moves into the flat below Jo’s, and their blistering connection becomes impossible to ignore. Especially since Cam is determined to uncover all of Jo’s secrets …even if it means taking apart her defenses piece by piece.\n \n","cover":"https://allnovel.net/images/down-london-road-on-dublin-street-2.jpg","author":"Samantha Young","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/down-london-road-on-dublin-street-2.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:05:22 PM"}}
