{"id":85446,"no":58,"title":"Page 58","content":"‘Jo, I didn’t do what you think I did,’ he insisted. I couldn’t look at him. All I could picture was his face above mine as he made love to me, his eyes telling me he cared, and then the image tearing down the centre to reveal him and Blair writhing naked together on his bed. My stomach turned at the thought and the pain in my chest was indescribable. So this was what it was like to be heartbroken? ‘Why did you even come here?’ ‘I came here because I thought this was where you’d go if you were in trouble.’ His response startled me. My eyes betrayed me and sought out his. He’d thought I would come here? ‘Not Malcolm’s?’ He shook his head, his expression desperate. That disconcerted me. I didn’t like it. I dropped my gaze, my confused thoughts giving me a headache. Cam had trusted me not to turn to Malcolm after all. He did see me. He saw me. I scoffed at the hope bubbling up inside me. He’d also screwed Blair. Deflated, I felt my shoulders slump. ‘Where is he?’ Mick demanded. ‘I’m going to sort that fucker out once and for all.’ I wasn’t big on violence. Anyone who really knew me knew that. But as I looked up into my uncle’s distressed and bloodthirsty gaze, I couldn’t find the willpower to lie to him. I wanted to believe fighting violence with violence was never the answer. I wanted to believe that there was a better way. And maybe for other people there was. Unfortunately, fear was the only thing Murray Walker understood. He was a schoolyard bully, and bullies really were cowards at heart. Murray definitely was … but only when it came to Mick. One day I’d have to ask Mick why that was. Not tonight, though. ‘The flat above the Halfway House on Fleshmarket Close.’ Mick grabbed his phone from the bedside table and stuffed it into his pocket. He turned to Olivia. ‘Take Jo home. I’ll call you when we’re done.’ He nodded at Cam and Braden. ‘You two are with me.’ My eyes disobeyed me again, finding Cam’s. The emotion roiling in those blue eyes of his was like an electrified net that caught me. Holding my gaze, he stepped towards me and cradled my face gently in his hands, then pressed his forehead against mine without a word. The familiar scent of him, the heat, the feel of his skin, all made me shudder with a rush of anguished longing. ‘You know I didn’t sleep with her, Jo,’ he whispered against my mouth, and everyone else just seemed to disappear. I wanted to believe him so badly. Pulling back to gaze into my eyes, he refused to let go of me. We had a silent conversation. You have to trust me. I saw her there. In your T-shirt. What else am I supposed to think? That I would never hurt you like that. A deluge of images flashed in flutters and whispers of colour and feeling. The tenderness in his eyes, the honesty I’d known from him, our laughter, searching hands that couldn’t seem to get through a day without feeling my body beneath them … Blair coming back into Cam’s life was a problem for me. However, it had never been because I was worried he would do something so callous as cheat on me with her. Yes, I had worried that he’d leave me for her, but I never believed he would cut me like that. I’d trusted that he would never cut me like that. Did that trust still exist? I searched his face for the answer. No. Cam would never cut me like that. Something in his gaze shifted as he recognized my realization and he sighed. There she is. I pinned him with a look that told him he wasn’t off the hook just yet. ‘We still need to talk.’ He nodded, his gaze flickering to my mouth. His own lips thinned, a hard glitter entering his expression at the sight of my bruised and swollen lip. ‘Does anyone else know what just happened here?’ Mick asked impatiently. Joss grunted. ‘I think Jo just said she believes Cam didn’t sleep with this Blair chick.’ Braden grumbled, ‘If only you were that intuitive about our relationship.’ She glowered at him. ‘If I wasn’t so damn worried about you going off to face this guy, I might just dump your ass.’ I raised an eyebrow, looking over my shoulder at her fiancé. Braden narrowed his eyes and I watched another silent conversation unfold. Whatever he said in it made her squirm. ‘Och, enough of this,’ Mick groused cantankerously as he wrenched open the hotel door and stormed out, followed by Braden. Cam gave me one more meaningful, soulful look before he disappeared behind them. My stomach flipped as I thought about what they were going to do. Another cab ride took Joss, Olivia and me back to the flat. Although I was exhausted, I was awake enough to shoot the door to Cam’s flat a glare so ferocious it was a wonder flames didn’t erupt from the doorstep and devour it with the heat of my anger. ‘He explained everything to me and Dad,’ Olivia suddenly said, obviously catching my look. ‘You need to talk to him.’ ‘She doesn’t need to do anything but rest right now,’ Joss insisted softly, taking my keys out of my purse as we climbed the steps to my flat. ‘It’s okay,’ I muttered. ‘I believe him. Seeing her was a shock, I didn’t think clearly … but Cam wouldn’t do that to me. Still doesn’t mean he isn’t thinking about doing it, though.’ ‘He’s not,’ Olivia assured me, but I was too weary to listen. We tried to be quiet as I settled on the couch with Olivia while Joss made us all a cup of tea, but I heard Cole’s door open nevertheless. I closed my eyes, drawing in a deep breath. ‘What’s going on?’ I heard him ask, obviously talking to Joss. She whispered something to him and the next thing I heard was his light footsteps across the hardwood floor. ‘What the hell?’ My eyes flew open to find Cole standing over me in his pyjamas. His eyes were wide and frightened as they took in my face, and just like that he was a wee boy again. ‘I’m okay.’ I attempted to reassure him, stifling a flinch of pain as I reached for his hand and dragged him down beside me. The fear began to melt out of his eyes, to be replaced by something that was all too familiar tonight: the promise of male retribution. ‘Who did it?’ Despite all the crap that had happened in the last twenty-four hours I was starting to feel rather loved, given all this anger and bristling on my behalf. ‘Dad,’ I answered honestly, having already decided I wasn’t keeping this from him. I told him everything. And not just about tonight. Bracing myself, I confessed to all three of them of my dad’s abuse when I was young. The last word had spilled from my mouth minutes before and still no one had said anything. We sat in the living room in a heavy silence. My stomach churned as I awaited my brother’s response. Joss was the first to speak up. ‘Well, now I hope Mick kills the swine.’ ‘You don’t mean that,’ I muttered. ‘Doesn’t she?’ Olivia asked, surprising me with her anger. She was always so laid-back. ‘People can be … well, they can be wonderful. And sometimes, unfortunately, they can be monsters we hide from inside our homes. We worry that those monsters will find their way inside. We’re not supposed to fear that they already are inside. Your mom and dad are supposed to protect you from that. They’re not supposed to be the monster.’ ‘She’s right.’ Cole leaned forward, his elbows braced on his knees, his head bent low as he stared at the floor. ‘Mick needs to teach him another lesson. One that’ll stick this time.’ Hating to see him distressed, I put my hand on his back and began to rub soothing circles between his shoulder blades. He looked back at me. ‘That’s why you fly off the handle when Mum says I’m like him.’ My mouth flattened. ‘You’re nothing –’ ‘Like him,’ Cole finished. ‘Aye. I get that now.’ We were silent again for a moment and then my wee brother looked over at me. ‘You have to stop trying to protect me from everything, Jo. I’m not a kid any more. You handle everything by yourself and it’s not fair on you. So stop. We’re a team.’ Pride and gratitude bundled together to create a lump in the back of my throat, so I nodded, brushing my hand affectionately through his hair. His eyes closed at the caress and to the surprise of everyone, he tucked himself into the side of me that wasn’t sore and hugged me close. We sat there so long that I drifted asleep … 30 The whispering of hushed but agitated voices seeped into my consciousness, thankfully pulling me out of a murky dreamscape of wet leaves, blood and pounding footsteps. My sore eyes fluttered open, the blur of colour focusing quickly to reveal that I had a busy sitting room. Olivia and Cole still sat beside me, Joss was on the armchair, and Braden was perched on the arm of it, his fingers massaging the nape of her neck. Cam and Mick stood by the fireplace with an older man I didn’t recognize, and Mum was seated on the other armchair. They were all staring at me. I was staring at Mick. The air around him crackled, and although I could tell he had calmed somewhat, he had the aura of a man back from battle. There was a lot of pent-up energy around him. My eyes travelled down his arm to his hand. Bruised knuckles. I swallowed hard. ‘He won’t be bothering you again, baby girl.’ Our eyes caught and I felt my fear disintegrate. ‘He wasn’t expecting you.’ The corner of Mick’s mouth quirked up. ‘No. That he was not. I had … words with him.’ He glanced quickly out of the corner of his eyes at the man I didn’t recognize. ‘He’s gone back to Glasgow and he knows if he comes back I’ll forcefully remove him.’ ‘What do you have over him, Mick?’ I asked curiously, my voice raspy from sleep deprivation and pain. He sighed, his eyes darkening. ‘It’s not what I have over him. It’s what I know about him. I know which buttons to push.’","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-58.html","bookId":1893,"book":{"id":1893,"title":"Down London Road (On Dublin Street #2)","description":"Storyline: Down London Road (On Dublin Street #2) Johanna Walker is used to taking charge. But she’s about to meet someone who will make her lose control.... It has always been up to Johanna to care for her family, particularly her younger brother, Cole. With an absent father and a useless mother, she’s been making decisions based on what’s best for Cole for as long as she can remember. She even determines what men to date by how much they can provide for her brother and her, not on whatever sparks may—or may not—fly. But with Cameron MacCabe, the attraction is undeniable. The sexy new bartender at work gives her butterflies every time she looks at him. And for once, Jo is tempted to put her needs first. Cam is just as obsessed with getting to know Jo, but her walls are too solid to let him get close enough to even try. Then Cam moves into the flat below Jo’s, and their blistering connection becomes impossible to ignore. Especially since Cam is determined to uncover all of Jo’s secrets …even if it means taking apart her defenses piece by piece.","cover":"https://allnovel.net/images/down-london-road-on-dublin-street-2.jpg","author":"Samantha Young","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/down-london-road-on-dublin-street-2.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:05:22 PM"}}
