{"id":74299,"no":17,"title":"Page 17","content":"Woods\\n\\n She hadn\u0027t left me anything but a note. She\u0027d taken all her things. I held the pillow she\u0027d slept on last night and pressed my face to it. It smelled like her. The sexy sweet scent that was Della.\\n\\n How was I supposed to let her go? She didn\u0027t want me to find her . . . she wanted to live. This wasn\u0027t living for her. She had started out on a journey to see the world and she\u0027d met me. Now she wanted more.\\n\\n I\u0027d hovered over her. I had tried to keep her safe and not let her do things she wanted. I\u0027d controlled her job and what she did. She wanted to spread her wings and I\u0027d clipped them. So she\u0027d found another way to fly.\\n\\n My chest was so tight that each breath I took was painful. I hadn\u0027t called anyone. I hadn\u0027t left my house for hours. I held the pillow closer and glanced over at the clock. It was after nine. I\u0027d been home for five hours. How long had she been gone? Had she known last night that she was leaving me?\\n\\n The look in her eyes as she\u0027d made love to me had been different. There had been something in them that bothered me. But she had been so passionate and needy that I\u0027d forgotten about everything other than the pleasure. If I had just looked deeper and talked to her . . . Instead, it had been about sex. When she had fallen to her knees in the kitchen, I was lost to whatever she wanted.\\n\\n If I\u0027d only looked deeper.\\n\\n How had she left me?\\n\\n Slowly, a realization came to me and I stood up, still holding her pillow. The phone call from Tripp. He hadn\u0027t made sense but he\u0027d been trying to tell me. Motherfucker! She\u0027d left with Tripp. She had called him and he had come for her.\\n\\n The pain slowly started heating up as anger---no, fury---consumed me. She had left with Tripp. He had taken her from me. His call wouldn\u0027t have made sense to anyone. It had been his way of being able to say he had warned me when he knew I wouldn\u0027t understand him.\\n\\n I reached for the lamp on the bedside table and threw it against the wall. Then I threw the sheets and shoved over the nightstand. I grabbed the mirror off the wall and smashed it, but the anger was still there. I punched the wall until my fist went through the Sheetrock and my voice seemed so far away, even though I was yelling. I had stepped outside of myself as my body went mad. Then I threw the pillow in my hand and everything stopped. That was all I had. Her pillow. I walked over to the pile of broken glass and furniture and picked the pillow back up. I held it reverently to my chest.\\n\\n Her scent filled my senses and for a moment the fury eased. For a moment I wasn\u0027t a hysterical madman bent on demolishing everything in my house. I had her. I could hold this. I had her.\\n\\n \"Holy shit.\" Jace\u0027s voice came from the doorway. I snapped my head up to see him looking into my room. The horrified look on his face as he lifted his eyes to me only made me angry again.\\n\\n \"Dude,\" he said, holding up both his hands. \"You gotta calm down.\"\\n\\n He didn\u0027t understand. He hadn\u0027t just lost his reason for fucking living. She hadn\u0027t just walked away from him. Left him nothing but a note and a pillow. The note . . . shit.\\n\\n I stalked to the door and shoved past Jace. I had to get the note. I had the note, too. It was something of hers. I had that. I wanted it. Even if the words in it tore me wide open, I wanted it.\\n\\n The torn paper lay on the floor and I scrambled to pick it up. I couldn\u0027t read the words again. Not right now. I folded it carefully and tucked it into my pocket. I\u0027d keep it on me. This was her handwriting. Her words.\\n\\n \"You\u0027re scaring me, man.\" Jace had followed me to the kitchen.\\n\\n \"I need to be alone,\" I said without turning to look at him.\\n\\n \"I don\u0027t think you need to be alone.\"\\n\\n \"Leave my motherfucking house,\" I snarled.\\n\\n \"I\u0027ve called Rush and Thad. They\u0027re on their way. I\u0027m not leaving you alone.\"\\n\\n I didn\u0027t want them here. I wanted to yell and break things. I wanted to find a way to ease the pain. \"No! Why are you even here?\"\\n\\n \"Tripp called me,\" he said slowly. Just hearing his name and knowing that he was the one who had Della made the monster inside of me snap. I reached for the glass in the sink and threw it across the room, shattering a picture.\\n\\n \"He took her!\" I roared as I grabbed a plate and hurled it across the room. \"He fucking took her from me!\"\\n\\n \"She called him. She wanted to go with him, Woods. You gotta calm down. She left of her own free will.\" I could hear the fear in Jace\u0027s voice but I didn\u0027t care. I grabbed a bar stool and began smashing it against the counter until the wood shattered into pieces in a heap on the floor.\\n\\n \"Holy hell.\" Rush\u0027s voice registered in my brain but I couldn\u0027t think. I didn\u0027t want them there.\\n\\n \"Dude! Stop him. He\u0027s gone fucking mad,\" Thad said.\\n\\n Arms wrapped around me from behind and I fought against them, but they held me tighter. \"Chill the fuck out. Breathe, man. Fucking take a breath. She isn\u0027t dead. She left. She\u0027s out there and it ain\u0027t over. So calm the fuck down,\" Rush said in a stern, loud voice as he held my arms back.\\n\\n I took several deep breaths. He was right. She was alive. She had just left. She had left. \"She left me,\" I said, and my voice broke.\\n\\n \"Yeah, she did. But you can\u0027t beat the hell out of your house. It won\u0027t bring her back and you\u0027re getting out of control. Get it together. I know what this feels like. I\u0027ve been there. Losing your shit doesn\u0027t make her come back to you.\"\\n\\n Rush had been here. He knew. Blaire had left him once. But she\u0027d been betrayed. She\u0027d had a reason to. I hadn\u0027t hurt Della. I had only loved her.\\n\\n \"I didn\u0027t let her live,\" I said, lifting my eyes to look straight ahead at Jace and Thad, who were keeping their distance from me.\\n\\n \"She needs some space. Let her have it,\" Rush said.\\n\\n \"How do I keep going? With her gone? What do I do?\"\\n\\n Rush let out a sigh and slowly let his hold on me go. \"You wake up each morning and you go to work. You smile when you think you\u0027re supposed to. You spend your free time thinking about her. Thinking about what you\u0027ll say when you see her again. Then you go to bed and hope you get some sleep. Then you wake up and do that same shit over again.\"\\n\\n I leaned against the wall and hung my head. \"What if she never comes back?\" He didn\u0027t say anything at first. We stood there in silence among the destruction.\\n\\n \"Then you find a way to keep living,\" Rush finally said, and I realized that was my biggest fear. That I\u0027d be left needing to find a way, because Della might never come back.\\n\\n \"She was my go-all-in,\" I said as I stared down at the smashed-up bar stool.\\n\\n \"Your what?\" Jace asked.\\n\\n \"Della was my go-all-in. She was my winning hand. You can\u0027t play when you go all in and lose. I\u0027m out.\"\\n\\n \"No, you\u0027re not. This hand ain\u0027t over yet,\" Rush said.\\n\\n I hoped he was right. \\n\\n","sourceLink":"https://allnovel.net/simple-perfection-perfection-2/page-17.html","bookId":1992,"book":{"id":1992,"title":"Simple Perfection (Perfection #2)","description":"Storyline: Simple Perfection (Perfection #2) \\n Woods had his perfect life mapped out for him. Rise up the ranks of the family business. Marry the rich girl of his parents’ dreams. Pretend that wealth and privilege was all he’d ever wanted. Then a girl named Della breezed into town, a beautifully imperfect stranger who captured his heart and opened his eyes to a new kind of future. Woods is ready and willing to sacrifice everything for her when the sudden death of his father leaves him with his mother to care for and a business to manage. \\n Della is determined to be strong for Woods, even as she’s quietly falling to pieces. No matter how far from home she’s run, the ghosts of her past have never stopped haunting her. Struggling to hide her true feelings from Woods, Della fears she can’t be his rock without dragging him down into the darkness with her. But is she strong enough to let go of the last thing holding her together?\\n","cover":"https://allnovel.net/images/simple-perfection-perfection-2.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/simple-perfection-perfection-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:30:19 AM"}}
