{"id":74312,"no":24,"title":"Page 24","content":"Della\n Her name was Glenda. When she\u0027d given birth to me it had been Glenda James. She married when she was twenty-two. I would have been six years old that year. She married a man she met her freshman year of college. They had fallen instantly in love. They had kids. Two of them. Today I would be meeting her. And if all went well I would be meeting her family.\n I was in a surreal moment. One I couldn\u0027t seem to snap out of. The mentally ill woman who raised me wasn\u0027t my biological mother. I wasn\u0027t going to become her. The woman who gave birth to me was a teacher. She was a mom and wife.\n And my brother. He had been adopted, too. I didn\u0027t remember him but he\u0027d been such a big part of my life. My mother had snapped after losing him and my father . . . or her husband. He wasn\u0027t my birth father and he had barely been my adoptive father before he was killed. There was so much my mother had told me that couldn\u0027t be true. She had said she was nursing me and led me to believe she had gotten depressed after my birth. But she hadn\u0027t been pregnant. She hadn\u0027t given birth to me. None of that was true. I didn\u0027t know what was true anymore.\n \"What are you thinking?\" Braden asked as she drove down the busy streets of Atlanta. Glenda was driving down with her family to Atlanta. We were meeting at a coffee shop that Braden knew about. I wasn\u0027t sure I could eat a meal with this woman yet. I also wasn\u0027t sure what to ask or say to her. There was so much I wanted to know but then so much I didn\u0027t.\n \"She doesn\u0027t know about anything. I didn\u0027t tell her. I found her but I didn\u0027t feel like it was my story to share.\"\n I wasn\u0027t sure I would be telling her about my life either. \"What if I don\u0027t know what to say once I see her?\"\n \"Then don\u0027t say anything. Do what you feel comfortable with. If today all you\u0027re ready for is \u0027hello,\u0027 then that\u0027s what we will do. When you want more we\u0027ll make arrangements to meet with her again.\"\n Braden always made everything sound so easy. This woman had put her family in a car and had driven down to Atlanta to meet me. I had to say more than hello. \"You won\u0027t go in with me?\" I asked again. Braden had informed me that I had to do this on my own. It was my chance to prove to myself I was strong. That I was brave and that I didn\u0027t need someone to hold my hand. Though right now I was thinking I needed someone to hold my hand. I was terrified.\n \"Don\u0027t do this to me. I want to go with you. I hate the idea of you going by yourself, but this is for you, Della. This is for you.\"\n She was right. Braden was always right. I nodded. \"I know. Thank you.\"\n I watched as she pulled the car into a parking spot in front of a quaint little coffee shop. There were tables outside and inside. The crowd wasn\u0027t big and I recognized the woman who had given birth to me from the photo Braden had shown me, sitting at the table in the courtyard to the left of the building. She had a cup of coffee in her hand and she was twirling it around nervously. This was scary for her, too, I guess. But she was brave. She was here alone.\n \"There she is,\" Braden said, pointing toward Glenda.\n \"I see her,\" I replied, and reached for the door handle.\n \"You can do this.\"\n I glanced back at Braden and smiled for the first time in weeks. \"I know.\"\n Her eyes locked with mine the moment I stepped out of the car. I watched as she stood and looked at me. I made my way over to her table, still unsure as to what I would say to this woman. She had given me life but she was a stranger.\n \"Della,\" she said as if needing to check and make sure it was me. We had the same hair, nose, and mouth. But her eyes were brown.\n \"Yes,\" I replied.\n She fidgeted with her hands a moment, then covered her mouth with one hand. \"I\u0027m sorry. I just . . . I don\u0027t know . . .\" She dropped her hand and gave me a wobbly smile. \"I\u0027ve thought about this day. I\u0027ve thought about it so many times and now I\u0027m actually standing here, looking at you.\" She studied my face, taking in the features I already knew were hers. \"You have Nile\u0027s eyes. He\u0027ll like that. He always loved his eyes,\" she said with a smile. \"They\u0027re his best feature. I\u0027m glad you got them.\"\n I knew I should say something but I didn\u0027t know what. I decided that it didn\u0027t matter if she liked me or approved of me. I wasn\u0027t here to gain her admiration. I wasn\u0027t perfect. I was damaged but I was a survivor. I had that to be proud of.\n \"I like my eyes,\" I finally said.\n She let out a soft laugh. \"They\u0027re beautiful eyes. I was always jealous of Nile\u0027s eyes. I used to tell him they were too pretty to be wasted on a boy.\"\n It sounded as if she still kept in touch with my birth father. I wanted to know about that, too. \"Should we sit down?\" I asked, pulling out a chair.\n Glenda nodded and sat back down. Her coffee cup sat forgotten. \"Your friend, Braden, she didn\u0027t tell me much about you. She said that you should be the one to decide what I got to hear. I want to know it all, at least everything you feel comfortable telling me. What do you do? Are you in college?\" She stopped and smiled at me. \"Sorry, I\u0027ll let you talk.\"\n There was one thing I was sure of: Glenda wasn\u0027t going to push for my life story. It wasn\u0027t easy to tell, and I wasn\u0027t sure I wouldn\u0027t fade out while telling it to her. That was a part of me that I would keep to myself. If this woman remained in my life then maybe one day, but not today.\n \"I\u0027ve been traveling around. I wanted to see and experience new things for a while. Then I plan on going back to college.\"\n \"That sounds like fun. Are you traveling alone?\"\n I thought of Tripp and realized I was going to have to send him on to South Carolina without me. I wasn\u0027t going there now. I had to decide what my next move would be. \"I was traveling with a friend of mine. He\u0027s going back to his home in South Carolina this week. I\u0027m not sure yet what I\u0027ll do next.\"\n \"That sounds exciting,\" she said, watching me carefully. I knew she wanted me to delve deeper into my life but she didn\u0027t deserve that.\n I didn\u0027t say anything else. I had nothing else to say really. Now that I had seen her and I knew this was my mother, I felt like I was finished here.\n \"I almost kept you. I wanted to. I loved Nile back then. He was the captain of the basketball team and everyone fell under his charm. But he\u0027d picked me. I was his girl and I worshipped the ground he walked on. When I found out I was pregnant I wanted to keep my baby. I wanted to marry Nile and I wanted a family. But I was sixteen. I knew nothing of love and heartache. I didn\u0027t know what paying the bills was like or how much babies cost. My mother worked as a nurse back then and my father was a construction worker. They made a modest living and we lived from paycheck to paycheck. I, of course, didn\u0027t understand any of that. I was wrapped up in the romance of it all.\" She stopped and took a drink of her coffee. She was nervous telling me this but I realized I wanted to know why. Why had she given me up?\n \"Nile came from money. Lots of money. His mother\u0027s father was a congressman and his father was a surgeon. They had big plans for Nile. Being a teenage father wasn\u0027t on their list. I think he loved me back then. I really do. I\u0027ve always thought he did. He told me he\u0027d get some money and we would run away and raise our baby. We would get married when we turned eighteen. I was giddy with excitement. Until everything changed.\" There was a sadness in her eyes. As if remembering this was hard for her. It had been twenty years ago. I couldn\u0027t imagine she still regretted it. Especially with the life she had now.\n \"Nile was offered a full-ride basketball scholarship to the University of Arizona. He decided to take it. He told me he wasn\u0027t ready to be a dad and he didn\u0027t think I was ready to be a mom. We were too young. We had no idea what we were doing. I knew he was repeating his parents\u0027 words back to me. I was angry and hurt. He tried for a long time to talk to me and get me to forgive him but I was done with Nile. He had betrayed me. He had chosen a scholarship over me and our unborn child. As the months went by and my stomach grew bigger, he would go out of his way to help me at school and do things for me, like bringing me my lunch tray. I continued to ignore him. He wasn\u0027t standing by my decision to keep the baby. He wanted me to give it up.\" Tears filled her eyes and she gave me a sad smile before wiping them away.\n \"As the days drew closer to your delivery date, my dad lost his job. My mom had been forced to sign us up for food stamps just so we could eat. They were fighting all the time and I knew it was because they were scared. Soon there would be another mouth to feed. A baby who would need diapers and formula and child care if I was going to finish school. I didn\u0027t want that for you. I didn\u0027t want you to live the life I had been living. I wasn\u0027t ready to be a mom and I wanted you to have more. I loved your father. You were a product of that love. It took me until I held you for the first time to realize I couldn\u0027t do this to you. I couldn\u0027t take you home to the life I could give you. It wasn\u0027t enough.\" She paused and took a deep breath. \"I kissed your fat little cheeks, then handed you to the nurse and told her I couldn\u0027t keep you. To find you a good home.\"\n I sat there and stared at Glenda. Her story made sense. Sixteen-year-olds weren\u0027t ready to be parents. I felt sorry for her, and she had been young enough to believe that handing me over was a better option. Maybe if my adopted father and brother hadn\u0027t been killed, then it would have. My mother may not have snapped mentally if they had lived.\n \"I\u0027d like to meet your family,\" I finally said.\n A grin broke across her face. \"I would love that. Thank you, Della.\" \n","sourceLink":"https://allnovel.net/simple-perfection-perfection-2/page-24.html","bookId":1992,"book":{"id":1992,"title":"Simple Perfection (Perfection #2)","description":"Storyline: \n Simple Perfection (Perfection #2) \n Woods had his perfect life mapped out for him. Rise up the ranks of the family business. Marry the rich girl of his parents’ dreams. Pretend that wealth and privilege was all he’d ever wanted. Then a girl named Della breezed into town, a beautifully imperfect stranger who captured his heart and opened his eyes to a new kind of future. Woods is ready and willing to sacrifice everything for her when the sudden death of his father leaves him with his mother to care for and a business to manage. \n Della is determined to be strong for Woods, even as she’s quietly falling to pieces. No matter how far from home she’s run, the ghosts of her past have never stopped haunting her. Struggling to hide her true feelings from Woods, Della fears she can’t be his rock without dragging him down into the darkness with her. But is she strong enough to let go of the last thing holding her together?\n \n","cover":"https://allnovel.net/images/simple-perfection-perfection-2.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/simple-perfection-perfection-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 10:30:19 AM"}}
