{"id":70667,"no":30,"title":"Page 30","content":"Trina kicked and flailed, but it did no good. He didn’t let go. She tried to pry his fingers away, but he was too strong.\n His blue eyes bulged with rage, and spittle leaked out from between his clenched teeth. “I try to help you and this is what you do?” His grip tightened. “Ungrateful bitch!”\n Thick gray fog closed around her vision, and she knew this was the end. He was going to kill her. Right here, right now.\n Keith let Trina go and she crumpled to the floor in a sprawling heap.\n Anger sliced through his veins with every heartbeat, making his body throb.\n She’d tried to kill him. He’d kept her alive, cozy and warm in her very own special place, and she’d tried to kill him in return.\n Ungrateful bitch, just like all the rest.\n Her chest rose and fell as she breathed. He hadn’t killed her in his rage, though it had been a close thing. Another few seconds and it would have been over. She would have pushed him over the edge and made him kill her too soon.\n He had special plans for her. A job only she could do.\n Keith picked up Trina’s fragile body and laid her on the cot. She’d lost weight since she’d been here, but it was her own fault. He had to keep her quiet. Asleep.\n If he hadn’t been sure of that before, he was now.\n Keith measured out a bigger dose of tranquilizer than he’d been giving her and shoved the needle into her arm. She wasn’t going to be giving him any more trouble. Not for a long time.\n Her uneaten food was strewn across the room, though she could scarcely afford to miss another meal.\n Keith didn’t care. He was past caring anymore. All he really wanted to do was put a gun to his head and end it now. He was tired of working so hard not to get caught and then still worrying that it wasn’t enough. He knew it was selfish to want to end his nightmare without helping his brothers and sisters first, but God help him, some days, it hardly seemed worth the effort. None of the people he’d freed seemed thankful for his aid. They hadn’t wanted to die, but then again, neither did Keith. He wanted to live free of his nightmares. He wanted to sleep without feeling the sickly weight of Lavine’s body pressing him into a musty mattress. He wanted to remember a childhood without fear and pain. But he couldn’t have any of those things, and he wasn’t strong enough to continue living with the weight of so much sickness hanging around his neck.\n It had to end. Soon. He wasn’t going to make it much longer.\n Grant held out until just after midnight before he finally gave up the fight. He needed to be with Isabelle. Needed to hold her in his arms and watch her sleep. Needed to know she was safe.\n Dale had turned the music down about an hour ago, just like he did every night before he went to sleep. Out of respect for Isabelle, Grant waited until he was sure Dale wouldn’t know before he crept downstairs and into her room.\n The room was dark, but a soft glow from a night-light in the bathroom made it possible for him to see his way to her bed.\n She slept on one side of the double bed, as if she’d gotten used to sharing it with someone. That notion grated against him, turning his stomach. He wasn’t normally a possessive man, but he didn’t like picturing Isabelle with another man. It made him a selfish bastard, because he should care only that she was happy, but he couldn’t help it.\n Her breathing was deep and even, and none of the faint noises he made opening and closing her bedroom door caused her to stir.\n Slowly, he eased himself onto her bed, trying to shift her as little as possible. She let out a sleepy sigh but settled again without waking.\n Grant was fully clothed and forced himself to stay on top of the covers rather than snuggling under them with her. He didn’t trust himself not to take advantage, so he’d also left all the condoms in his room, ensuring he wouldn’t do anything she might regret.\n All he wanted to do was hold her. He didn’t even know why. Normally, he extracted himself from a woman’s bed as quickly and painlessly as possible. But not with Isabelle. With her it was different. Maybe it was because they were friends. He wasn’t sure, but he didn’t question it. For once, he just let himself enjoy the feeling of holding a woman close without the intent of seducing her.\n He moved his body so he was tucked behind her, the blanket and all their clothing between them. It wasn’t as nice as it would have been with both of them naked, but it was nice enough that he wasn’t complaining. His hand found a comfortable resting place on the curve of her hip, and he buried his nose in her hair, breathing in the floral scent of her shampoo.\n This was it, he decided. This was what both David and Caleb had found that he hadn’t. There was always a slow burn of attraction when he was near Isabelle, but there was more, too. He wasn’t here for the sex. In fact, he’d come here knowing that there would be no sex involved whatsoever. But still he’d come. For Isabelle.\n Maybe he loved her. He couldn’t be sure, because he’d never really felt it before. Sure, he’d loved his mom, and he’d lay down his life for his buddies any day of the week, but romantic love? He’d never felt it.\n But he’d seen it. He’d seen it every time David looked at Noelle and every time Caleb touched Lana. What they had was real. Lasting. The kind of thing that fairy tales were built on.\n And that was the real problem. He wasn’t a fairy-tale kind of guy. He was broken. Warped. More than a little tarnished. His dad had fucked with his mind and crippled him for anything even resembling a normal family. He could never be what Isabelle wanted. What she deserved. So even if he did love her, he couldn’t stay. In fact, if he really loved her, he’d make sure the idea of him staying never even crossed her mind.\n He couldn’t be her Prince Charming, so he had to be a man and step aside so she could find the man who could be.\n Isabelle shifted in her sleep, and Grant realized he’d been gripping her too hard. He eased off but couldn’t bring himself to move away. Not yet.\n She didn’t even know he was here, so it couldn’t possibly hurt her if he stayed. He might pay for his weakness later, but she wouldn’t, and that’s what really mattered.\n Grant set his internal alarm clock for two hours and let himself drift off to sleep holding Isabelle. It was the one and only time he’d allow himself the pleasure, so he soaked it up, let it fill up the empty places inside him that had been hollow for so long.\n Right before he drifted off, he realized that he’d never be full. He could hold Isabelle for a lifetime and still not get enough of her. He never should have come here and gotten a taste of what he couldn’t have, but it was too late for that. He might as well enjoy it while he could.\n CHAPTER TWENTY\n Amanda pulled into Vicky’s neighborhood around five a.m. Her body ached with exhaustion, which had forced her to pull over at a rest stop for a few hours last night. Beside her, Rachel was sleeping.\n The neighborhood was filled with homes that all looked the same in the dark. They weren’t very big, but they were all new, with neat, clean lines and manicured landscaping. Even with all the leaves gone, the neighborhood looked fresh and full of hope.\n Vicky was a lucky woman.\n Amanda found the right house and parked on the street out front. She didn’t want to ring the doorbell yet and wake Vicky up, so she’d just wait until she saw a light go on in the dark house.\n Her car was almost out of gas, so she turned it off and tucked the blanket more tightly around Rachel, praying the engine would start again if they needed more heat.\n She leaned her heavy head back against the seat and closed her eyes. She must have fallen asleep, because she woke up when she heard a car door slam shut nearby. One of the neighbors was getting into his truck.\n The sky had started to lighten, and a quick glance at Vicky’s house, now lit up from inside, told her it was time to see if their friendship was still there, or whether she’d burned all her bridges with Vicky.\n “Time to wake up and go inside, baby.”\n Rachel opened her eyes and nodded. Amanda bundled her up in the blanket and led her to the door.\n If Vicky turned them away, she wasn’t sure what she’d do next. She had nowhere else to go.\n With a quick prayer for luck, Amanda rang the doorbell.\n The chime seemed loud in the quiet stillness of morning. A few seconds later, the door opened and Vicky stood there in her bathrobe, her bright red hair mussed from sleep and her eyes wide with shock. “Amanda? What are you doing here?”\n “I’m in trouble, Vicky. I was hoping I could come in and talk to you about it.”\n Vicky’s hand fluttered to her throat. “Now isn’t a great time.”\n “I know it’s early, but this is important.”\n “You don’t understand,” said Vicky, shooting a quick glance at Rachel. “You really should go.”\n A cold, bleak despair washed over Amanda. “Please, Vicky. I know I wasn’t always a good friend to you, but I really need your help.”\n “Princess?” came a man’s deep voice from somewhere behind Vicky. “Who is it?”\n Amanda knew that voice. She knew that deceptively gentle tone. Princess. It’s what Bobby had called her, too.\n He was here.\n His blond head appeared over Vicky’s shoulder, looking as handsome as ever. When he saw them, a cocky grin lifted one side of his mouth. “Well, looky who’s here.”\n Rachel’s small body went still and a pained, strangling noise came out of her.\n Amanda didn’t understand. She stood there in shock for an awkward moment before the gears in her head started to spin again.\n “What is he doing here?” asked Amanda.\n “I live here now,” said Bobby. “Nice place, isn’t it?” He looped an arm over Vicky’s shoulders. “We’re getting married this spring.”\n Married. Vicky and Bobby were getting married. Amanda knew he’d cheated on her with Vicky, not to mention all the others, but she’d never thought it was serious. Apparently, she’d been wrong.\n Not that she cared who he married, other than the fact that whoever it was would suffer. No one deserved Bobby, especially not Vicky.\n Rachel started to shake. “You promised,” she whispered so low Amanda didn’t think anyone but her could hear it.\n She’d promised not to send Rachel back to her daddy, and here he was.\n “This was a mistake,” Amanda managed to choke out. “I’m sorry.” She took Rachel’s hand and pulled her back toward the car.\n Before she managed to get the door unlocked and get Rachel inside, Vicky was there, her eyes pleading for forgiveness. “Don’t go, Amanda. Come inside. You drove all this way for a reason—you might as well tell me what it was.”\n “Never mind. It was clearly a mistake.”\n “If I’d known you were coming, I would have met you somewhere else. Why didn’t you call?”\n Amanda buckled Rachel’s seat belt and spared a quick glance into her daughter’s face. It was pale. Her eyes were distant and haunted, and a slow, steady stream of tears slid down her smooth cheeks in silent agony.\n It was happening again. Rachel was retreating in on herself, fading away. \n","sourceLink":"https://allnovel.net/no-escape-delta-force-3/page-30.html","bookId":2376,"book":{"id":2376,"title":"No Escape (Delta Force #3)","description":"Storyline: \n No Escape (Delta Force #3) \n Teacher Isabelle Carson is grief-stricken, angry, and scared. Three of her childhood friends have died. The police say they\u0027re suicides, but Isabelle knows they would never, ever take their own lives. Her past binds her to every victim, and she knows it\u0027s only a matter of time before the killer comes after her. Only one man can help her now, the only man she\u0027s ever trusted, the man who saved her so long ago... \n For Grant Kent, Delta Force vet, just being near Isabelle brings back old memories and desires, and stirs longings he\u0027d rather deny. Yet he can\u0027t ignore the real terror in her eyes, or resist the thought of holding her again. But even as their friendship begins to blossom into a passionate affair, a killer continues his deadly rampage and plots his next move: the \"suicide\" of Isabelle Carson.\n \n","cover":"https://allnovel.net/images/no-escape-delta-force-3.jpg","author":"Shannon K. Butcher","type":"Mystery","source":"allnovel","link":"https://allnovel.net/no-escape-delta-force-3.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:16:52 AM"}}
