{"id":20415,"no":20,"title":"CHAPTER XX. POMP\u0027S EDUCATION COMMENCES","content":"In the season of leisure from farm work which followed, Frank found considerable time for study. The kind sympathy and ready assistance given by Mr. Morton made his task a very agreeable one, and his progress for a time was as rapid as if he had remained at school. He also assumed the office of teacher, having undertaken to give a little elementary instruction to Pomp. Here his task was beset with difficulties. Pomp was naturally bright, but incorrigibly idle. His activity was all misdirected and led him into a wide variety of mischief. He had been sent to school, but his mischievous propensities had so infected the boys sitting near him that the teacher had been compelled to request his removal. Three times in the week, during the afternoon, Pomp came over to the farm for instruction. On the first of these occasions we will look in upon him and his teacher. Pomp is sitting on a cricket by the kitchen fire. He has a primer open before him at the alphabet. His round eyes are fixed upon the page as long as Frank is looking at him, but he requires constant watching. His teacher sits near-by, with a Latin dictionary resting upon a light stand before him, and a copy of Virgil\u0027s Aeneid in his hand. “Well, Pomp, do you think you know your lesson?” he asks. “Dunno, Mass\u0027 Frank; I reckon so.” “You may bring your book to me, and I will try you.” Pomp rose from his stool and sidled up to Frank with no great alacrity. “What\u0027s that letter, Pomp?” asked the young teacher, pointing out the initial letter of the alphabet. Pomp answered correctly. “And what is the next?” Pomp shifted from one foot to the other, and stared vacantly out of the window, but said nothing. “Don\u0027t you know?” “\u0027Pears like I don\u0027t \u0027member him, Mass\u0027 Frank.” Here Frank had recourse to a system of mnemonics frequently resorted to by teachers in their extremity. “What\u0027s the name of the little insect that stings people sometimes, Pomp?” “Wasp, Mass\u0027 Frank,” was the confident reply. “No, I don\u0027t mean that. I mean the bee.” “Yes, Mass\u0027 Frank.” “Well, this is B.” Pomp looked at it attentively, and, after a pause, inquired, “Where\u0027s him wings, Mass\u0027 Frank?” Frank bit his lips to keep from laughing. “I don\u0027t mean that this is a bee that makes honey,” he explained, “only it has the same name. Now do you think you can remember how it is called?” “Bumblebee!” repeated Pomp triumphantly. Pomp\u0027s error was corrected, and the lesson proceeded. “What is the next letter?” asked Frank, indicating it with the point of his knife-blade. “X,” answered the pupil readily. “No, Pomp,” was the dismayed reply. “It is very different from X.” “Dat\u0027s him name at school,” said Pomp positively. “No, Pomp, you are mistaken. That is X, away down there.” “Perhaps him change his name,” suggested Pomp. “No. The letters never change their names. I don\u0027t think you know your lesson, Pomp. just listen to me while I tell you the names of some of the letters, and try to remember them.” When this was done, Pomp was directed to sit down on the cricket, and study his lesson for twenty Minutes, at the end of which he might again recite. Pomp sat down, and for five minutes seemed absorbed in his book. Then, unfortunately, the cat walked into the room, and soon attracted the attention of the young student. He sidled from his seat so silently that Frank did not hear him. He was soon made sensible that Pomp was engaged in some mischief by hearing a prolonged wail of anguish from the cat. Looking up, he found that his promising pupil had tied her by the leg to a chair, and under these circumstances was amusing himself by pinching her tail. “What are you doing there, Pomp?” he asked quickly. Pomp scuttled back to his seat, and appeared to be deeply intent upon his primer. “Ain\u0027t doin\u0027 noffin\u0027, Mass\u0027 Frank,” he answered innocently. “Then how came the cat tied to that chair?” “\u0027Spec\u0027 she must have tied herself.” “Come, Pomp, you know better than that. You know cats can\u0027t tie themselves. Get up immediately and unfasten her.” Pomp rose with alacrity, and undertook to release puss from the thraldom of which she had become very impatient. Perhaps she would have been quite as well off if she had been left to herself. The process of liberation did not appear to be very agreeable, judging from the angry mews which proceeded from her. Finally, in her indignation against Pomp for some aggressive act, she scratched him sharply. “You wicked old debble!” exclaimed Pomp wrathfully. He kicked at the cat; but she was lucky enough to escape, and ran out of the room as fast as her four legs could carry her. “Big ugly debble!” muttered Pomp, watching the blood ooze from his finger. “What\u0027s the matter, Pomp?” “Old cat scratch me.” “And what did you do to her, Pomp? I am afraid you deserved your scratch.” “Didn\u0027t do noffin\u0027, Mass\u0027 Frank,” said Pomp virtuously. “I don\u0027t think you always tell the truth, Pomp.” “Can\u0027t help it, Mass\u0027 Frank. \u0027Spec\u0027 I\u0027ve got a little debble inside of me.” “What do you mean, Pomp! What put that idea in your head?” “Dat\u0027s what mammy says. Dat\u0027s what she al\u0027ays tells me.” “Then,” said Frank, “I think it will be best to whip it out of you. Where\u0027s my stick?” “Oh, no, Mass\u0027 Frank,” said Pomp, in alarm; “I\u0027ll be good, for sure.” “Then sit down and get your lesson.” Again Pomp assumed his cricket. Before he had time to devise any new mischief, Mrs. Frost came to the head of the stairs and called Frank. Frank laid aside his books, and presented himself at the foot of the stairs. “I should like your help a few minutes. Can you leave your studies?” “Certainly, mother.” Before going up, he cautioned Pomp to study quietly, and not get into any mischief while he was gone. Pomp promised very readily. Frank had hardly got upstairs before his pupil rose from the cricket, and began to look attentively about him. His first proceeding was to, hide his primer carefully in Mrs. Frost\u0027s work-basket, which lay on the table. Then, looking curiously about him, his attention was drawn to the old-fashioned clock that stood in the corner. Now, Pomp\u0027s curiosity had been strongly excited by this clock. It was not quite clear to him how the striking part was effected. Here seemed to be a favorable opportunity for instituting an investigation. Pomp drew his cricket to, the clock, and, opening it, tried to reach up to the face. But he was not yet high enough. He tried a chair, and still required a greater elevation. Espying Frank\u0027s Latin dictionary, he pressed that into service. By and by Frank and his mother heard the clock striking an unusual number of times. “What is the matter with the clock?” inquired Mrs. Frost. “I don\u0027t know,” said Frank unsuspiciously. “It has struck ten times, and it is only four o\u0027 clock.” “I wonder if Pomp can have got at it,” said Frank, with a sudden thought. He ran downstairs hastily. Pomp heard him coming, and in his anxiety to escape detection, contrived to lose his balance and fall to the floor. As he fell, he struck the table, on which a pan of sour milk had been placed, and it was overturned, deluging poor Pomp with the unsavory fluid. Pomp shrieked and kicked most energetically. His appearance, as he picked himself up, was ludicrous in the extreme. His sable face was plentifully besprinkled with clotted milk, giving him the appearance of a negro who is coming out white in spots. The floor was swimming in milk. Luckily the dictionary had fallen clear of it, and so escaped. “Is this the way you study?” demanded Frank, as sternly as his sense of the ludicrous plight in which he found Pomp would permit. For once Pomp\u0027s ready wit deserted him. He had nothing to say. “Go out and wash yourself.” Pomp came back rather shamefaced, his face restored to its original color. “Now, where is your book?” Pomp looked about him, but, as he took good care not to look where he knew his book to be, of course he did not find it. “I \u0027clare, Mass\u0027 Frank, it done lost,” he at length asserted. “How can it be lost when you had it only a few minutes ago?” “I dunno,” answered Pomp stolidly. “Have you been out of the room?” Pomp answered in the negative. “Then it must be somewhere here.” Frank went quietly to the corner of the room and took therefrom a stick. “Now, Pomp,” he said, “I will give you just two minutes to find the book in. If you don\u0027t find it, I shall have to give you a whipping.” Pomp looked at his teacher to see if he was in earnest. Seeing that he was, he judged it best to find the book. Looking into the work-box, he said innocently: “I \u0027clare to gracious, Mass\u0027 Frank, if it hasn\u0027t slipped down yere. Dat\u0027s mi\u0027ty cur\u0027s, dat is.” “Pomp, sit down,” said Frank. “I am going to talk to you seriously. What makes you tell so many lies?” “Dunno any better,” replied Pomp, grinning. “Yes, you do, Pomp. Doesn\u0027t your mother tell you not to lie?” “Lor\u0027, Mass\u0027 Frank, she\u0027s poor ignorant nigger. She don\u0027t know nuffin\u0027.” “You mustn\u0027t speak so of your mother. She brings you up as well as she knows how. She has to work hard for you, and you ought to love her.” “So I do, \u0027cept when she licks me.” “If you behave properly she won\u0027t whip you. You\u0027ll grow up a \u0027poor, ignorant nigger\u0027 yourself, if you don\u0027t study.” “Shall I get white, Mass\u0027 Frank, if I study?” asked Pomp, showing a double row of white teeth. “You were white enough just now,” said Frank, smiling. “Yah, yah!” returned Pomp, who appreciated the joke. “Now, Pomp,” Frank continued seriously, “if you will learn your lesson in fifteen minutes I will give you a piece of gingerbread.” “I\u0027ll do it, Mass\u0027 Frank,” said Pomp promptly. Pomp was very fond of gingerbread, as Frank very well knew. In the time specified the lesson was got, and recited satisfactorily. As Pomp\u0027s education will not again be referred to, it may be said that when Frank had discovered how to manage him, he learned quite rapidly. Chloe, who was herself unable to read, began to look upon Pomp with a new feeling of respect when she found that he could read stories in words of one syllable, and the “lickings” of which he complained became less frequent. But his love of fun still remained, and occasionally got him into trouble, as we shall hereafter have occasion to see. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2969/81760.html","bookId":375,"book":{"id":375,"title":"Frank\u0027s Campaign or the Farm and the Camp","description":"简介： The Town Hall in Rossville stands on a moderate elevation overlooking the principal street. It is generally open only when a meeting has been called by the Selectmen to transact town business, or occasionally in the evening when a lecture on temperan...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2969","creation":"Aug 1, 2019 12:18:40 AM","modification":"Aug 1, 2019 12:18:40 AM"}}
