{"id":20422,"no":27,"title":"CHAPTER XXVII. POMP\u0027S LIGHT INFANTRY TACTICS","content":"Little Pomp continued to pursue his studies under Frank as a teacher. By degrees his restlessness diminished, and, finding Frank firm in exacting a certain amount of study before he would dismiss him, he concluded that it was best to study in earnest, and so obtain the courted freedom as speedily as possible. Frank had provided for his use a small chair, which he had himself used when at Pomp\u0027s age, but for this the little contraband showed no great liking. He preferred to throw himself on a rug before the open fire-place, and, curling up, not unlike a cat, began to pore over his primer. Frank often looked up from his own studies and looked down with an amused glance at little Pomp\u0027s coal-back face and glistening eyes riveted upon the book before him. There was no lack of brightness or intelligence in the earnest face of his young pupil. He seemed to be studying with all his might. In a wonderfully short time he would uncoil himself, and, coming to his teacher, would say, “I guess I can say it, Mass\u0027 Frank.” Finding how readily Pomp learned his lessons, Frank judiciously lengthened them, so that, in two or three months, Pomp could read words of one syllable with considerable ease, and promised very soon to read as well as most boys of his age. Frank also took considerable pains to cure Pomp of his mischievous propensities, but this he found a more difficult task than teaching him to read. Pomp had an innate love of fun which seemed almost irrepressible, and his convictions of duty sat too lightly upon him to interfere very seriously with its gratification. One adventure into which he was led came near having serious consequences. Pomp, in common with other village boys of his age, had watched with considerable interest the boys \u0027company, as they drilled publicly or paraded through the main street, and he had conceived a strong desire to get hold of a musket, to see if he, too, could not go through with the manual. Frank generally put his musket carefully away, only bringing it out when it was needful. One morning, however, he had been out on a hunting-expedition, and on his return left the musket in the corner of the shed. Pomp espied it when he entered the house, and resolved, if possible, to take temporary possession of it after his lesson was over. Having this in view, he worked with an uncommon degree of industry, and in less time than usual had learned and said his lesson. “Very well, Pomp,” said his teacher approvingly. “You have worked unusually well to-day. If you keep on you will make quite a scholar some day.” “I\u0027s improvin\u0027, isn\u0027t I?” inquired Pomp, with an appearance of interest. “Yes, Pomp, you have improved rapidly. By and by you can teach your mother how to read.” “She couldn\u0027t learn, Mass\u0027 Frank. She\u0027s poor ignorant nigger.” “You shouldn\u0027t speak so of your mother, Pomp. She\u0027s a good mother to you, and works hard to earn money to support you.” “Yes, Mass\u0027 Frank,” said Pomp, who was getting impatient to go. “I guess I\u0027ll go home and help her.” Frank thought that what he had said was producing a good effect. He did not know the secret of Pomp\u0027s haste. Pomp left the room, and, proceeding to the wood-shed, hastily possessed himself of the musket. In a stealthy manner he crept with it through a field behind the house, until he got into the neighboring woods. He found it a hard tug to carry the gun, which was heavier than those made at the present day. At length he reached an open space in the woods, only a few rods from the road which led from the farmhouse, past the shanty occupied by old Chloe. As this road was not much traveled, Pomp felt pretty safe from discovery, and accordingly here it was that he halted, and made preparations to go through the manual. “It begins dis yer way,” said Pomp, after a little reflection. Grasping the musket with one hand he called out in an important tone: “\u0027Tention, squab!” For the benefit of the uninitiated it may be explained that Pomp meant “Attention, squad!” “S\u0027port arms!” Pomp found it considerably easier to give the word of command than to obey it. With some difficulty he succeeded in accomplishing this movement, and proceeded with the manual, with several original variations which would have astonished a military instructor. Meanwhile, though Pomp did not realize it, he was exposing himself to considerable danger. The gun had been loaded with buckshot in the morning, and the charge had not been withdrawn. It seemed to be the lot of poor Mrs. Payson to suffer fright or disaster whenever she encountered Pomp, and this memorable afternoon was to make no exception to the rule. “Cynthy Ann,” she said to her daughter, in the afternoon, “I guess I\u0027ll go and spend the arternoon with Mis\u0027 Forbes. I hain\u0027t been to see her for nigh a month, and I calc\u0027late she\u0027ll be glad to see me. Besides, she ginerally bakes Thursdays, an\u0027 mos\u0027 likely she\u0027ll have some hot gingerbread. I\u0027m partic\u0027larly fond of gingerbread, an\u0027 she does know how to make it about the best of anybody I know on. You needn\u0027t wait supper for me, Cynthy Ann, for ef I don\u0027t find Mis\u0027 Forbes to home I\u0027ll go on to Mis\u0027 Frost\u0027s.” Mrs. Payson put on her cloak and hood, and, armed with the work-bag and the invariable blue cotton umbrella, sallied out. Mrs. Forbes lived at the distance of a mile, but Mrs. Payson was a good walker for a woman of her age, and less than half an hour brought her to the door of the brown farmhouse in which Mrs. Forbes lived. She knocked on the door with the handle of her umbrella. The summons was answered by a girl of twelve. “How dy do, Betsy?” said Mrs. Payson. “Is your ma\u0027am to home?” “No, she\u0027s gone over to Webbington to spend two or three days with Aunt Prudence.” “Then she won\u0027t be home to tea,” said Mrs. Payson, considerably disappointed. “No, ma\u0027am, I don\u0027t expect her before to-morrow.” “Well, I declare for\u0027t, I am disapp\u0027inted,” said the old lady regretfully. “I\u0027ve walked a mile on puppus to see her. I\u0027m most tuckered out.” “Won\u0027t you step in and sit down?” “Well, I don\u0027t keer ef I do a few minutes. I feel like to drop. Do you do the cooking while you maam\u0027s gone?” “No, she baked up enough to last before she went away.” “You hain\u0027t got any gingerbread in the house?” asked Mrs. Payson, with subdued eagerness. “I always did say Mis\u0027 Forbes beat the world at makin\u0027 gingerbread.” “I\u0027m very sorry, Mrs. Payson, but we ate the last for supper last night.” “Oh, dear!” sighed the old lady, “I feel sort of faint—kinder gone at the stomach. I didn\u0027t have no appetite at dinner, and I s\u0027pose it don\u0027t agree with me walkin\u0027 so fur on an empty stomach.” “Couldn\u0027t you eat a piece of pie?” asked Betsy sympathizingly. “Well,” said the old lady reflectively, “I don\u0027t know but I could eat jest a bite. But you needn\u0027t trouble yourself. I hate to give trouble to anybody.” “Oh, it won\u0027t be any trouble,” said Betsy cheerfully. “And while you\u0027re about it,” added Mrs. Payson, “ef you have got any of that cider you give me when I was here before, I don\u0027t know but I could worry down a little of it.” “Yes, we\u0027ve got plenty. I\u0027ll bring it in with the pie.” “Well,” murmured the old lady, “I\u0027ll get something for my trouble. I guess I\u0027ll go and take supper at Mis\u0027 Frost\u0027s a\u0027terward.” Betsy brought in a slice of apple and one of pumpkin pie, and set them down before the old lady. In addition she brought a generous mug of cider. The old lady\u0027s eyes brightened, as she saw this substantial refreshment. “You\u0027re a good gal, Betsy,” she said in the overflow of her emotions. “I was saying to my darter yesterday that I wish all the gals round here was as good and considerate as you be.” “Oh, no, Mrs. Payson,” said Betsy modestly. “I ain\u0027t any better than girls generally.” “Yes, you be. There\u0027s my granddarter, Jane, ain\u0027t so respectful as she\u0027d arter be to her old grandma\u0027am. I often tell her that when she gets to have children of her own, she\u0027ll know what tis to be a pilgrim an\u0027 a sojourner on the arth without nobody to consider her feelin\u0027s. Your cider is putty good.” Here the old lady took a large draft, and set down the mug with a sigh of satisfaction. “It\u0027s jest the thing to take when a body\u0027s tired. It goes to the right spot. Cynthy Ann\u0027s husband didn\u0027t have none made this year. I wonder ef your ma would sell a quart or two of it.” “You can have it and welcome, Mrs. Payson.” “Can I jest as well as not? Well, that\u0027s kind. But I didn\u0027t expect you to give it to me.” “Oh, we have got plenty.” “I dunno how I can carry it home,” said the lady hesitatingly. “I wonder ef some of your folks won\u0027t be going up our way within a day or two.” “We will send it. I guess father\u0027ll be going up to-morrow.” “Then ef you can spare it you might send round a gallon, an\u0027 ef there\u0027s anything to pay I\u0027ll pay for it.” This little business arrangement being satisfactorily adjusted, and the pie consumed, Mrs. Payson got up and said she must be going. “I\u0027m afraid you haven\u0027t got rested yet, Mrs. Payson.” “I ain\u0027t hardly,” was the reply; “but I guess I shall stop on the way at Mis\u0027 Frost\u0027s. Tell your ma I\u0027ll come up an\u0027 see her ag\u0027in afore long.” “Yes, ma\u0027am.” “An\u0027 you won\u0027t forget to send over that cider?” “No, ma\u0027am.” “I\u0027m ashamed to trouble ye, but their ain\u0027t anybody over to our house that I can send. There\u0027s Tom grudges doin\u0027 anything for his old grandma\u0027am. A\u0027ter all that I do for him, too! Good-by!” The old lady set out on her way to Mrs. Frost\u0027s. Her road lay through the woods, where an unforeseen danger lay in wait for her. Meanwhile Pomp was pursuing military science under difficulties. The weight of the musket made it very awkward for him to handle. Several times he got out of patience with it, and apostrophized it in terms far from complimentary. At last, in one of his awkward maneuvers, he accidentally pulled the trigger. Instantly there was a loud report, followed by a piercing shriek from the road. The charge had entered old Mrs. Payson\u0027s umbrella and knocked it out of her hand. The old lady fancied herself hit, and fell backward, kicking energetically, and screaming “murder” at the top of her lungs. The musket had done double execution. It was too heavily loaded, and as it went off, \u0027kicked,\u0027 leaving Pomp, about as scared as the old lady, sprawling on the ground. Henry Morton was only a few rods off when he heard the explosion. He at once ran to the old lady\u0027s assistance, fancying her hurt. She shrieked the louder on his approach, imagining that he was a robber, and had fired at her. “Go away!” she cried, in affright. “I ain\u0027t got any money. I\u0027m a poor, destitute widder!” “What do you take me for?” inquired Mr. Morton, somewhat amazed at this mode of address. “Ain\u0027t you a highwayman?” asked the old lady. “If you look at me close I think you will be able to answer that question for yourself.” The old lady cautiously rose to a sitting posture, and, mechanically adjusting her spectacles, took a good look at the young man. “Why, I declare for it, ef it ain\u0027t Mr. Morton! I thought \u0027twas you that fired at me.” “I hope you are not hurt,” said Mr. Morton, finding a difficulty in preserving his gravity. “I dunno,” said the old lady dubiously, pulling up her sleeve, and examining her arm. “I don\u0027t see nothin\u0027; but I expect I\u0027ve had some injury to my inards. I feel as ef I\u0027d had a shock somewhere. Do you think he\u0027ll fire again?” she asked, with a sudden alarm. “You need not feel alarmed,” was the soothing reply. “It was no doubt an accident.” Turning suddenly, he espied Pomp peering from behind a tree, with eyes and mouth wide open. The little contraband essayed a hasty flight; but Mr. Morton, by a masterly flank movement, came upon him, and brought forward the captive kicking and struggling. “Le\u0027 me go!” said Pomp. “I ain\u0027t done noffin\u0027!” “Didn\u0027t you fire a gun at this lady?” “No,” said Pomp boldly. “Wish I may be killed ef I did!” “I know \u0027twas you—you—you imp!” exclaimed Mrs. Payson, in violent indignation. “I seed you do it. You\u0027re the wust boy that ever lived, and you\u0027ll be hung jest as sure as I stan\u0027 here!” “How did it happen, Pomp?” asked Mr. Morton quietly. “It jest shooted itself!” said Pomp, in whom the old lady\u0027s words inspired a vague feeling of alarm. “I \u0027clare to gracious, Mass\u0027 Morton, it did!” “Didn\u0027t you have the gun in your hand, Pomp? Where did you get it?” “I jest borrered it of Mass\u0027 Frank, to play sojer a little while,” said Pomp reluctantly. “Does he know that you have got it?” “I \u0027clare I done forgot to tell him,” said Pomp reluctantly. “Will you promise never to touch it again?” “Don\u0027t want to!” ejaculated Pomp, adding spitefully, “He kick me over!” “I\u0027m glad on\u0027t,” said the old lady emphatically, with a grim air of satisfaction. “That\u0027ll l\u0027arn you not to fire it off at your elders ag\u0027in. I\u0027ve a great mind to box your ears, and sarve you right, too.” Mrs. Payson advanced, to effect her purpose; but Pomp was wary, and, adroitly freeing himself from Mr. Morton\u0027s grasp, butted at the old lady with such force that she would have fallen backward but for the timely assistance of Mr. Morton, who sprang to her side. Her bag fell to the ground, and she struggled to regain her lost breath. “Oh!” groaned the old lady, gasping for breath, “he\u0027s mos\u0027 knocked the breath out of me. I sha\u0027n\u0027t live long a\u0027ter such a shock. I\u0027m achin\u0027 all over. Why did you let him do it?” “He was too quick for me, Mrs. Payson. I hope you feel better.” “I dunno as I shall ever feel any better,” said Mrs. Payson gloomily. “If Cynthy Ann only knew how her poor old ma\u0027am had been treated! I dunno as I shall live to get home!” “Oh, yes, you will,” said the young man cheerfully, “and live to see a good many years more. Would you like to have me attend you home?” “I ain\u0027t got strength to go so fur,” said Mrs. Payson, who had not given up her plan of taking tea out. “I guess I could go as fur as Mis\u0027 Frost\u0027s, an\u0027 mebbe some on you will tackle up an\u0027 carry me back to Cynthy Ann\u0027s a\u0027ter tea.” Arrived at the farmhouse, Mrs. Payson indulged in a long detail of grievances; but it was observed that they did not materially affect her appetite at tea. The offending musket was found by Frank under a tree, where Pomp had dropped it when it went off. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2969/81767.html","bookId":375,"book":{"id":375,"title":"Frank\u0027s Campaign or the Farm and the Camp","description":"简介： The Town Hall in Rossville stands on a moderate elevation overlooking the principal street. It is generally open only when a meeting has been called by the Selectmen to transact town business, or occasionally in the evening when a lecture on temperan...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2969","creation":"Aug 1, 2019 12:18:40 AM","modification":"Aug 1, 2019 12:18:40 AM"}}
