{"id":20403,"no":8,"title":"CHAPTER VIII. DISCOURAGED AND ENCOURAGED","content":"In a small village like Rossville news flies fast. Even the distinctions of social life do not hinder an interest being felt in the affairs of each individual. Hence it was that Mr. Frost\u0027s determination to enlist became speedily known, and various were the comments made upon his plan of leaving Frank in charge of the farm. That they were not all favorable may be readily believed. Country people are apt to criticize the proceedings of their neighbors with a greater degree of freedom than is common elsewhere. As Frank was on his way to school on Saturday morning, his name was called by Mrs. Roxana Mason, who stood in the doorway of a small yellow house fronting on the main street. “Good morning, Mrs. Mason,” said Frank politely, advancing to the gate in answer to her call. “Is it true what I\u0027ve heard about your father\u0027s going to the war, Frank Frost?” she commenced. “Yes, Mrs. Mason; he feels it his duty to go.” “And what\u0027s to become of the farm? Anybody hired it?” “I am going to take charge of it,” said Frank modestly. “You!” exclaimed Mrs. Roxana, lifting both hands in amazement; “why, you\u0027re nothing but a baby!” “I\u0027m a baby of fifteen,” said Frank good-humoredly, though his courage was a little dampened by her tone. “What do you know about farming?” inquired the lady, in a contemptuous manner. “Your father must be crazy!” “I shall do my best, Mrs. Mason,” said Frank quietly, but with heightened color. “My father is willing to trust me; and as I shall have Mr. Maynard to look to for advice, I think I can get along.” “The idea of putting a boy like you over a farm!” returned Mrs. Roxana, in an uncompromising tone. “I did think your father had more sense. It\u0027s the most shiftless thing I ever knew him to do. How does your poor mother feel about it?” “She doesn\u0027t seem as much disturbed about it as you do, Mrs. Mason,” said Frank, rather impatiently; for he felt that Mrs. Mason had no right to interfere in his father\u0027s arrangements. “Well, well, we\u0027ll see!” said Mrs. Roxana, shaking her head significantly. “If you\u0027ll look in your Bible, you\u0027ll read about \u0027the haughty spirit that goes before a fall.\u0027 I\u0027m sure I wish you well enough. I hope that things\u0027ll turn out better\u0027n they\u0027re like to. Tell your mother I\u0027ll come over before long and talk with her about it.” Frank inwardly hoped that Mrs. Roxana wouldn\u0027t put herself to any trouble to call, but politeness taught him to be silent. Leaving Mrs. Mason\u0027s gate, he kept on his way to school, but had hardly gone half a dozen rods before he met an old lady, whose benevolent face indicated a very different disposition from that of the lady he had just parted with. “Good morning, Mrs. Chester,” said Frank cordially, recognizing one of his mother\u0027s oldest friends. “Good morning, my dear boy,” was the reply. “I hear your father is going to the war.” “Yes,” said Frank, a little nervously, not knowing but Mrs. Chester would view the matter in the same way as Mrs. Mason, though he felt sure she would express herself less disagreeably. “And I hear that you are going to try to make his place good at home.” “I don\u0027t expect to make his place good, Mrs. Chester,” said Frank modestly, “but I shall do as well as I can.” “I have no doubt of it, my dear boy,” said the old lady kindly. “You can do a great deal, too. You can help your mother by looking out for your brothers and sisters, as well as supplying your father\u0027s place on the farm.” “I am glad you think I can make myself useful,” said Frank, feeling relieved. “Mrs. Mason has just been telling me that I am not fit for the charge, and that discouraged me a little.” “It\u0027s a great responsibility, no doubt, to come on one so young,” said the old lady, “but it\u0027s of God\u0027s appointment. He will strengthen your hands, if you will only ask Him. If you humbly seek His guidance and assistance, you need not fear to fail.” “Yes,” said Frank soberly, “that\u0027s what I mean to do.” “Then you will feel that you are in the path of duty. You\u0027ll be serving your country just as much as if you went yourself.” “That\u0027s just the way I feel, Mrs. Chester,” exclaimed Frank eagerly. “I want to do something for my country.” “You remind me of my oldest brother,” said the old lady thoughtfully. “He was left pretty much as you are. It was about the middle of the Revolutionary war, and the army needed recruits. My father hesitated, for he had a small family depending on him for support. I was only two years old at the time, and there were three of us. Finally my brother James, who was just about your age, told my father that he would do all he could to support the family, and father concluded to go. We didn\u0027t have a farm, for father was a carpenter. My brother worked for neighboring farmers, receiving his pay in corn and vegetables, and picked up what odd jobs he could. Then mother was able to do something; so we managed after a fashion. There were times when we were brought pretty close to the wall, but God carried us through. And by and by father came safely home, and I don\u0027t think he ever regretted having left us. After awhile the good news of peace came, and he felt that he had been abundantly repaid for all the sacrifices he had made in the good cause.” Frank listened to this narrative with great interest. It yielded him no little encouragement to know that another boy, placed in similar circumstances, had succeeded, and he just felt that he would have very much less to contend against than the brother of whom Mrs. Chester spoke. “Thank you for telling me about your brother Mrs. Chester,” he said. “It makes me feel more as if things would turn out well. Won\u0027t you come over soon and see us? Mother is always glad to see you.” “Thank you, Frank; I shall certainly do so. I hope I shall not make you late to school.” “Oh, no; I started half an hour early this morning.” Frank had hardly left Mrs. Chester when he heard a quick step behind him. Turning round, he perceived that it was Mr. Rathburn, his teacher. “I hurried to come up with you, Frank,” he said, smiling. “I understand that I am to lose you from school.” “Yes, sir,” answered Frank. “I am very sorry to leave, for I am very much interested in my studies; but I suppose, sir, you have heard what calls me away.” “Your father has made up his mind to enlist.” “Yes, sir.” “And you are to superintend the farm in his absence?” “Yes, sir. I hope you do not think me presumptuous in undertaking such a responsibility?” He looked up eagerly into Mr. Rathburn\u0027s face, for he had a great respect for his judgment. But he saw nothing to discourage him. On the contrary, he read cordial sympathy and approval. “Far from it,” answered the teacher, with emphasis. “I think you deserving of great commendation, especially if, as I have heard, the plan originated with you, and was by you suggested to your father.” “Yes, sir.” The teacher held out his hand kindly. “It was only what I should have expected of you,” he said. “I have not forgotten your essay. I am glad to see that you not only have right ideas of duty, but have, what is rarer, the courage and self-denial to put them in practice.” These words gave Frank much pleasure, and his face lighted up. “Shall you feel obliged to give up your studies entirely?” asked his teacher. “I think I shall be able to study some in the evening.” “If I can be of any assistance to you in any way, don\u0027t hesitate to apply. If you should find any stumbling-blocks in your lessons, I may be able to help you over them.” By this time they had come within sight of the schoolhouse. “There comes the young farmer,” said John Haynes, in a tone which was only subdued lest the teacher should hear him, for he had no disposition to incur another public rebuke. A few minutes later, when Frank was quietly seated at his desk, a paper was thrown from behind, lighting upon his Virgil, which lay open before him. There appeared to be writing upon it, and with some curiosity he opened and read the following: “What\u0027s the price of turnips?” It was quite unnecessary to inquire into the authorship. He felt confident it was written by John Haynes. The latter, of course, intended it as an insult, but Frank did not feel much disturbed. As long as his conduct was approved by such persons as his teacher and Mrs. Chester, he felt he could safely disregard the taunts and criticisms of others. He therefore quietly let the paper drop to the floor, and kept on with his lesson. John Haynes perceived that he had failed in his benevolent purpose of disturbing Frank\u0027s tranquillity, and this, I am sorry to say, only increased the dislike he felt for him. Nothing is so unreasonable as anger, nothing so hard to appease. John even felt disposed to regard as an insult the disposition which Frank had made of his insulting query. “The young clodhopper\u0027s on his dignity,” he muttered to himself. “Well, wait a few months, and see if he won\u0027t sing a different tune.” Just then John\u0027s class was called up, and his dislike to Frank was not diminished by the superiority of his recitation. The latter, undisturbed by John\u0027s feelings, did not give a thought to him, but reflected with a touch of pain that this must be his last Latin recitation in school for a long time to come.","sourceLink":"http://novel.tingroom.com/ertong/2969/81748.html","bookId":375,"book":{"id":375,"title":"Frank\u0027s Campaign or the Farm and the Camp","description":"简介： The Town Hall in Rossville stands on a moderate elevation overlooking the principal street. It is generally open only when a meeting has been called by the Selectmen to transact town business, or occasionally in the evening when a lecture on temperan...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2969","creation":"Aug 1, 2019 12:18:40 AM","modification":"Aug 1, 2019 12:18:40 AM"}}
