{"id":63708,"no":10,"title":"Page 10","content":"\"What\u0027s the matter?\"\n \"What do I tell Francine\u0027s family? Every time the phone rings I\u0027m afraid it\u0027s one of her cousins. Her parents are separated and her mother moved back to Jordan, but her father\u0027s still in the old neighborhood and she\u0027s got relatives all over Brooklyn. What do I tell them?\"\n \"I don\u0027t know.\"\n \"I\u0027ll have to fill them in sooner or later. Time being, I\u0027ll say she went on a cruise, something like that. You know what they\u0027ll figure?\"\n \"Marital problems.\"\n \"That\u0027s it. We\u0027re just back from Negril, so why\u0027s she going on a cruise? Must be trouble between the Khourys. Well, they can think whatever they want. Truth of the matter is we never had a cross word, we never had a bad day. Jesus.\" He picked up the phone, punched in a number, keyed in his own number at the tone. He hung up and drummed the tabletop impatiently, and when the phone rang he picked it up and said, \"Hey, man, how\u0027s it going? Oh, yeah? No shit. Hey, here\u0027s the deal…\"\n Chapter 5\n I went to the eight-thirty meeting at St. Paul\u0027s. On the way over it had crossed my mind that I might run into Pete Khoury there, but he didn\u0027t show up. Afterward I helped fold chairs, then joined a group of people for coffee at the Flame. I didn\u0027t stay there long, though, because by eleven I was at Poogan\u0027s Pub on West Seventy-second Street, one of the two places where Danny Boy Bell could generally be found between the hours of 9:00 p.m. and 4:00 a.m. The rest of the time you couldn\u0027t count on finding him anywhere.\n His other place is a jazz club called Mother Goose on Amsterdam. Poogan\u0027s was closer, so I tried it first. Danny Boy was at his usual table in back, deep in conversation with a dark-skinned black man with a pointed chin and a button nose. He was wearing wraparound sunglasses with mirrored lenses and a powder-blue suit with more in the shoulders than God or Gold\u0027s Gym could have put there. A little cocoa-brown straw hat perched on top of his head, adorned with a flamingo-pink hatband.\n I had a Coke at the bar and waited while he finished his business with Danny Boy. After five minutes or so he uncoiled himself from his chair, clapped Danny Boy on the shoulder, laughed heartily, and headed for the street. I turned around to get my change from the bar, and when I turned back again his place had been taken by a balding white man with a brushy mustache and a belly straining at his shirtfront. I hadn\u0027t recognized the first fellow, other then generically, but I knew this man. His name was Selig Wolf and he owned a couple of parking lots and took bets on sporting events. I had arrested him once ages ago on an assault charge, but the complainant had decided not to press it.\n When Wolf left I took my second Coke with me and sat down. \"Busy evening,\" I said.\n \"I know,\" Danny Boy said. \"Pick a number and wait, it\u0027s getting as bad as Zabar\u0027s. It\u0027s good to see you, Matthew. I saw you before but I had to suffer through the hour of the Wolf. You must know Selig.\"\n \"Sure, but I didn\u0027t know the other fellow. He\u0027s head of fundraising for the United Negro College Fund, right?\"\n \"A mind is a terrible thing to waste,\" he said solemnly. \"To think you would waste yours judging by appearances. The gentleman was wearing a sartorial classic, Matthew, known as the zoot suit. That\u0027s a zoot suit, you know, with a drape shape and a reet pleat. My father had one in his closet, a souvenir of his flaming youth. Every now and then he would take it out and threaten to wear it, and my mother would roll her eyes.\"\n \"Good for her.\"\n \"His name is Nicholson James,\" Danny Boy said. \"It should have been James Nicholson, but the names were reversed on some official document early on and he decided it had more style that way. You might say it goes with his retro fashion statement. Mr. James is a pimp.\"\n \"Go figure. I never would have guessed.\"\n Danny Boy poured himself some vodka. His own fashion statement was one of quiet elegance, a tailored dark suit and tie, a boldly patterned red-and-black vest. He is a very short, slightly built albino African-American- it would be way off the mark to call him black, since he\u0027s anything but. He spends his nights in saloons, and he\u0027s partial to dim lighting and low noise levels. He\u0027s as rigid as Dracula about not venturing out in daylight, and rarely answers the phone or the door during those hours. Every night, though, he\u0027s in Poogan\u0027s or Mother Goose, listening to people and telling them things.\n \"Elaine\u0027s not with you,\" he said.\n \"Not tonight.\"\n \"Give her my love.\"\n \"I will,\" I said. \"I brought you something, Danny Boy.\"\n \"Oh?\"\n I palmed him a pair of hundreds. He looked at the money without flashing it, then glanced at me with his eyebrows elevated.\n \"I have a prosperous client,\" I said. \"He wants me to take cabs.\"\n \"Did you want me to call you one?\"\n \"No, but I thought I ought to spread a little of his dough around. All you have to spread is the word.\"\n \"What word is that?\"\n I ran through the official story without mentioning Kenan Khoury\u0027s name. Danny Boy listened, frowning occasionally in concentration. When I finished he took out a cigarette, looked at it for a moment, then put it back in the pack.\n \"A question arises,\" he said.\n \"Go.\"\n \"Your client\u0027s wife is out of the country, and presumably safe from those who would harm her. So he assumes they\u0027ll direct their attention at someone else.\"\n \"Right.\"\n \"Well, why should he care? I love the idea of a public-spirited dope dealer, like all those marijuana growers in Oregon who make huge anonymous cash donations to Earth First and the eco-saboteurs. Well, when I was growing up I liked Robin Hood, as far as that goes. But what difference does it make to your man if the bad guys snatch somebody else\u0027s sweetie? They get the ransom and that just leaves one of his competitors in a negative cash-flow situation, that\u0027s all. Or they screw up and that\u0027s the end of them. As long as his own wife\u0027s out of the picture-\"\n \"Jesus, it was a perfectly good story until I told it to you, Danny Boy.\"\n \"Sorry.\"\n \"His wife didn\u0027t make it out of the country. They snatched her and they killed her.\"\n \"He tried to stonewall? Wouldn\u0027t pay the ransom?\"\n \"He paid four hundred large. They killed her anyway.\" His eyes widened. \"Your ears only,\" I added. \"The death isn\u0027t being reported, so that part of it shouldn\u0027t get out on the street.\"\n \"I understand. Well, that makes his motive easier to grasp. He wants to get even. Any idea who they are?\"\n \"No.\"\n \"But you figure they\u0027ll do it again.\"\n \"Why quit on a winning roll?\"\n \"Nobody ever does.\" He helped himself to more vodka. At both of his regular places they bring him the bottle in an ice bucket, and he drinks great quantities of it without paying much attention to it, just drinking it down like water. I don\u0027t know where he puts it, or how his body processes it.\n He said, \"How many bad guys?\"\n \"Minimum of three.\"\n \"Splitting four tenths of a mil. They might be taking cabs a lot themselves, don\u0027t you think?\"\n \"I had that thought myself.\"\n \"So if somebody\u0027s throwing a lot of money around, that would be useful information.\"\n \"It might.\"\n \"And the drug dealers, especially the major players, should get the word that they\u0027re at risk for kidnapping. They might just as easily grab a dealer, don\u0027t you think? It wouldn\u0027t have to be a woman.\"\n \"I\u0027m not sure about that.\"\n \"Why\u0027s that?\"\n \"I think they enjoyed the killing. I think they got off on it. I think they used her sexually, and I think they tortured her, and then when the novelty wore off they killed her.\"\n \"The body showed signs of torture?\"\n \"The body came back in twenty or thirty pieces, individually wrapped. And that\u0027s not for the street, either. I hadn\u0027t planned on mentioning it.\"\n \"I\u0027d just as soon you hadn\u0027t, to tell you the truth. Matthew, is it my imagination or is the world turning nastier?\"\n \"It doesn\u0027t seem to be lightening up.\"\n \"It doesn\u0027t, does it? Remember the Harmonic Convergence, all the planets lining up like soldiers? Wasn\u0027t that supposed to signal the dawn of some kind of New Age?\"\n \"I\u0027m not holding my breath.\"\n \"Well, they say it\u0027s always darkest before the dawn. I see what you mean, though. If killing\u0027s part of the fun, and if they\u0027re into rape and torture, well, they won\u0027t pick some raggedy-ass dope dealer with a beer gut and a five o\u0027clock shadow. Nothing queer about these fellows.\"\n \"No.\"\n He thought for a moment. \"They\u0027ll have to do it again,\" he said. \"They could hardly be expected to quit after a score like that. I wonder, though.\"\n \"If they\u0027ve done it before? I was wondering the same thing myself.\"\n \"And?\"\n \"They were pretty slick,\" I said. \"I get the feeling they had some practice.\"\n FIRST thing after breakfast the next morning I walked over to the Midtown North station house on West Fifty-fourth. I caught Joe Durkin at his desk, and he caught me off balance by complimenting me on my appearance. \"You\u0027re dressing better these days,\" he said. \"I think it\u0027s that woman\u0027s doing. Elaine, right?\"\n \"That\u0027s right.\"\n \"Well, I think she\u0027s a good influence on you.\"\n \"I\u0027m sure she is,\" I said, \"but what the hell are you talking about?\"\n \"That\u0027s a nice-looking jacket, that\u0027s all.\"\n \"This blazer? It must be ten years old.\"\n \"Well, you never wear it.\"\n \"I wear it all the time.\"\n \"Maybe it\u0027s the tie.\"\n \"What\u0027s so special about the tie?\"\n \"Jesus Christ,\" he said. \"Did anybody ever tell you you\u0027re a difficult son of a bitch? I tell you you look nice and the next thing I know I\u0027m on the fucking witness stand. How about we start over? \u0027Hello, Matt, it\u0027s great to see you. You look like shit. Have a seat.\u0027 Is that better?\"\n \"Much better.\"\n \"I\u0027m glad. Sit down. What brings you here?\"\n \"I had the urge to commit a felony.\"\n \"I know the feeling. There\u0027s hardly a day goes by that I don\u0027t get the urge myself. You got any particular felony in mind?\"\n \"I was thinking of a class D felony.\"\n \"Well, we got lots of those. Criminal possession of forgery devices is a class D felony, and you\u0027re probably committing that one at this very minute. You got a pen in your pocket?\"\n \"Two pens and a pencil.\"\n \"Gee, it sounds as though I better Mirandize you and get you booked and printed. But I don\u0027t suppose that\u0027s the class D felony you had in mind.\"\n I shook my head. \"I was thinking of violating Section Two Hundred Point Zero Zero of the Criminal Code.\"\n \"Two Hundred Point Zero Zero. You\u0027re gonna make me look that up, aren\u0027t you?\"\n \"Why not?\"\n He gave me a look, then reached for a black looseleaf binder and flipped through it. \"It\u0027s a familiar number,\" he said. \"Oh, right, here we are. \u0027Two Hundred Point Zero Zero. Bribery in the third degree. A person is guilty of bribery in the third degree when he confers, or offers or agrees to confer, any benefit upon a public servant upon an agreement or understanding that such public servant\u0027s vote, opinion, judgment, action, decision or exercise of discretion as a public servant will thereby be influenced. Bribery in the third degree is a class D felony.\u0027 \" He went on reading silently for a moment, then said, \"Are you sure you wouldn\u0027t prefer to violate Section Two Hundred Point Zero Three?\" \n","sourceLink":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10/page-10.html","bookId":2328,"book":{"id":2328,"title":"A Walk Among the Tombstones (Matthew Scudder #10)","description":"Storyline: \n A Walk Among the Tombstones (Matthew Scudder #10) \n The wife of Kheran Khoury, heroin wholesaler, is killed after he haggles over the price of her ransom. With the help of two computer geniuses, a streetwise punk, drug lords and his friend, ex-cop Scudder, they track the killers through the back streets of Brooklyn.\n \n","cover":"https://allnovel.net/images/a-walk-among-the-tombstones-matthew-scudder-10.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:51:32 AM"}}
