{"id":63741,"no":26,"title":"Page 26","content":"God, what was she supposed to do? \"That one? Are you sure, Pammy?\" God- \"Well, I think it\u0027s a good choice, an excellent choice, so that one\u0027s yours and this one\u0027s mine and a deal\u0027s a deal and a trade\u0027s a trade and no trades back, Pam-mee.\" The wire was a circle around her breast, and there was a wooden handle attached to each end of the wire, like the kind they slipped under the string of a package so you could carry it, and he held the handles and drew his hands apart, and- And she was out of her body, just like that, floating without a body, up in the air above the truck and able to look down through the roof of the truck, watching, watching as the wire slipped through her flesh as if through a liquid, watching the breast slide slowly away from the rest of her, watching the blood seep. Watching until the blood filled up the whole of her vision, watching it darken, darken, until the world went black. Chapter 14 Kelly was away from his desk. The man who answered his phone at Brooklyn Homicide said he could try to have him paged, if it was important. I said it was important. When the phone rang Elaine answered it, said, \"Just a minute,\" and nodded. I took the phone from her and said hello. \"My dad remembers you,\" he said. \"Said you were real eager.\" \"Well, that was a while ago.\" \"So he said. What\u0027s so important they got to beep me in the middle of a meal?\" \"I have a question about Leila Alvarez.\" \"You got a question. I thought you had something for me.\" \"About the surgery she had.\" \" \u0027Surgery.\u0027 That what you want to call it?\" \"Do you know what he used to sever the breast?\" \"Yeah, a fucking guillotine. Where are you coming from with the questions, Scudder?\" \"Could he have used a piece of wire? Piano wire, say, used almost like a garrote?\" There was a long pause, and I wondered if I\u0027d pronounced the word incorrectly and he didn\u0027t know what I meant. Then, his voice tight, he said, \"What the fuck are you sitting on?\" \"I\u0027ve been sitting on it for ten minutes, and I\u0027ve spent five of them waiting for you to call back.\" \"God damn it, what have you got, mister?\" \"Alvarez wasn\u0027t their only victim.\" \"So you said. Also Gotteskind. I read the file and I think you\u0027re right, but where did you get piano wire with Gottes-kind?\" \"There\u0027s another victim,\" I said. \"Raped, tortured, a breast severed. The difference is she\u0027s alive. I figured you\u0027d want to talk to her.\" DREW Kaplan said, \"Pro bono, huh? You like to tell me why those are the two Latin words everybody knows? By the time I got through Brooklyn Law I\u0027d learned enough Latin to start my own church. Res gestae, corpus juris, lex talionis. Nobody ever says these words to me. Just pro bono. You know what it means, pro bono?\" \"I\u0027m sure you\u0027ll tell me.\" \"The full phrase is pro bono publico. For the public good. Which is why big corporate law firms use the phrase to refer to the minuscule amount of legal work which they deign to undertake for causes they believe in as a sop to their consciences, which are understandably troubled by virtue of the fact that they spend upwards of ninety percent of their time grinding the faces of the poor and billing upwards of two hundred dollars an hour for it. Why are you looking at me like that?\" \"That\u0027s the longest sentence I\u0027ve ever heard you speak.\" \"Is that right? Miss Cassidy, as your attorney it\u0027s my duty to caution you against associating with men like this gentleman. Matt, seriously, Miss Cassidy\u0027s a Manhattan resident, the victim of a crime which took place nine months ago in the borough of Queens. I\u0027m a struggling lawyer with modest offices on Court Street in the borough of Brooklyn. So how, if you don\u0027t mind my asking, do I come into it?\" We were in his modest offices, and the banter was just his way of breaking the ice, because he already knew why Pam Cassidy needed a Brooklyn lawyer to see her through interrogation by a Brooklyn homicide detective. I had gone over the situation with him at some length on the phone. \"I\u0027m going to call you Pam,\" he said now. \"Is that all right with you?\" \"Oh, sure.\" \"Or do you prefer Pammy?\" \"No, Pam\u0027s fine. Just so it\u0027s not Pammy.\" The special significance of that would have been lost on Kaplan. He said, \"It\u0027ll be Pam, then. Pam, before you and I go down to see Officer Kelly- it\u0027s Officer, Matt? Or Detective?\" \"Detective John Kelly.\" \"Before we meet with the good detective, let\u0027s get our signals straight. You\u0027re my client. That means I don\u0027t want you questioned by anyone unless I\u0027m at your side. Do you understand?\" \"Sure.\" \"That means from anyone, cops, press, TV reporters sticking microphones in your face. \u0027You\u0027ll have to speak with my attorney.\u0027 Let me hear you say that.\" \"You\u0027ll have to speak with my attorney.\" \"Perfect. Somebody calls you on the phone, asks you what the weather\u0027s like outside, what do you say?\" \"You\u0027ll have to speak with my attorney.\" \"I think she\u0027s got it. One more. Guy calls you on the phone, says you\u0027ve just won a free trip to Paradise Island in the Bahamas in connection with a special promotion they\u0027re running. What do you say?\" \"You\u0027ll have to speak with my attorney.\" \"No, him you can tell to fuck off. Everybody else on the planet, however, they have to speak to your attorney. Now we\u0027ll go over some specifics, but generally speaking I only want you answering questions when I\u0027m present, and only if they relate directly to the outrageous crime which was committed upon your person. Your background, your life before the incident, your life since the incident, none of that is anybody\u0027s business. If a line of questioning is introduced that I object to, I\u0027ll cut in and stop you from answering. If I don\u0027t say anything, but if for any reason whatsoever the question bothers you, you don\u0027t answer it. You say that you want to confer privately with your attorney. \u0027I want to confer privately with my attorney.\u0027 Let\u0027s hear you say that.\" \"I want to confer privately with my attorney.\" \"Excellent. The point is you\u0027re not charged with anything and you\u0027re not going to be charged with anything, so you\u0027re doing them a favor in the first place, which puts us in a very good position. Now let\u0027s just go over the background one time while we\u0027ve got Matt here, and then you and I can go see Detective Kelly, Pam. Tell me how you happened to ask Matthew Scudder to try to track down the men who abducted and assaulted you?\" WE had worked out the details before I\u0027d called either John Kelly or Drew Kaplan. Pam needed a story that would make her the initiator of the investigation and leave Kenan Khoury out of it. She and Elaine and I batted it around, and this is what we came up with: Pam, nine months after the incident, was trying to get on with her life. This was rendered more difficult by the dread she had that she would be victimized again by the same men. She had even thought of leaving New York to get away from them but felt the fear would remain with her no matter how far she fled. Recently she had been with a man to whom she had told the story of the loss of her breast. This fellow, who was a respectable married man and whose name she would not under any circumstances divulge, was shocked and sympathetic. He told her she would not rest easy until the men were caught, and that even if it was impossible to find them it would almost certainly be helpful to her emotional recovery if she herself took some action toward their discovery and apprehension. Since the police had had ample time to investigate and had evidently accomplished nothing, it was his recommendation that she engage a private investigator who could concentrate wholeheartedly upon the case instead of practicing the sort of criminological triage required of policemen. There was in fact a private operative he knew and trusted, because this nameless fellow had been a client of mine in the past. He had sent her to me, and in addition had agreed to cover my fee and expenses, with the understanding that his role in all of this would not be divulged to anyone under any circumstances. A couple of interviews with Pam had suggested to me that the most effective way to approach the case was by assuming that she had not been their only victim. Indeed, the way they had discussed killing her seemed to indicate that they had in fact committed murder. I had accordingly tried multiple approaches designed to turn up evidence of crimes committed by the same two men either before or after the maiming of my client. Library research had turned up two cases which I considered likely, Marie Gotteskind and Leila Alvarez. The Gotteskind case involved abduction by means of a truck, and by securing the Gotteskind file through unconventional channels I had confirmed that it had also involved an amputation. The Alvarez case looked like probable abduction, and was similar, too, in that the victim was abandoned in a cemetery. (Pam had been dropped in Mount Zion Cemetery, in Queens.) When I learned on Thursday that Alvarez\u0027s mutilation, unspecified in the newspaper account, had been identical to Pam\u0027s, it seemed self-evident to me that the same criminals were involved. So why didn\u0027t I say anything to Kelly at the time? Most important, I couldn\u0027t ethically do so without my client\u0027s permission, and I had spent the weekend talking her into it and preparing her for what she would have to face. In addition, I wanted to see if any of the other hooks I had in the water would bring in a bite. One of these was the movie-of-the-week pitch, which I\u0027d had Elaine try on various sex-crime units around town in the hope of turning up a living victim. Several women had called, although none had proved even remote possibilities, but I\u0027d wanted to wait until the weekend was over before giving up on the line of inquiry. Amusingly enough, Pam herself had gotten a telephone call from a woman at the Queens unit, suggesting that she might find it worth her while to contact this Miss Mardell and see what it was all about. At the time she\u0027d had no idea we were trying this particular approach, so she\u0027d been very uncertain with the woman on the phone, but then we all had a good laugh when she mentioned it to me and found out who this movie producer really was. As of this afternoon, Monday, I couldn\u0027t see any justification for withholding information from the police, since our so doing would unquestionably hamper their investigation of the two homicides, and since I had no useful course to pursue on my own. I had managed to sell this argument to Pam, who was still more than a little wary of being interrogated again by police officers, but who was more sanguine about it when I told her she could have a lawyer looking after her interests. And so they were on their way to see Kelly, and I was done chasing lust murderers, and that was that. \"I THINK it\u0027ll play,\" I told Elaine. \"I think it covers everything, all the activities I\u0027ve engaged in since the first call I got, except for anything that has to do with Khoury. I don\u0027t see how anything Pam might tell them could lead them toward the investigation I conducted on Atlantic Avenue or the computer games I watched the Kongs play last night. Pam doesn\u0027t know about any of that so she couldn\u0027t spill it even if she wanted to, she never heard the names of Francine or Kenan Khoury. Come to think of it, I\u0027m not sure she knows why I got into the case in the first place. I think all she knows is her cover story.\"","sourceLink":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10/page-26.html","bookId":2328,"book":{"id":2328,"title":"A Walk Among the Tombstones (Matthew Scudder #10)","description":"Storyline: A Walk Among the Tombstones (Matthew Scudder #10) The wife of Kheran Khoury, heroin wholesaler, is killed after he haggles over the price of her ransom. With the help of two computer geniuses, a streetwise punk, drug lords and his friend, ex-cop Scudder, they track the killers through the back streets of Brooklyn.","cover":"https://allnovel.net/images/a-walk-among-the-tombstones-matthew-scudder-10.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:51:32 AM"}}
