{"id":63756,"no":34,"title":"Page 34","content":"I listened intently to the qualification, although I couldn\u0027t tell you what I heard, and when the speaker finished up and opened the meeting I got my hand up right away. I got called on and said, \"My name\u0027s Matt and I\u0027m an alcoholic. I\u0027ve been sober a couple of years and I\u0027ve come a long way since I walked in the door and sometimes I forget that I\u0027m still pretty fucked up. I\u0027m going through a difficult phase in my relationship and I didn\u0027t even realize it until a little while ago. Before I came over here I felt uncomfortable and I had to stand under a shower for five minutes to dope out what it was I felt. And then I saw that it was fear, that I was afraid. \"I don\u0027t even know what I\u0027m afraid of. I have a feeling if I let myself go I\u0027ll find out I\u0027m afraid of every goddamned thing in the world. I\u0027m afraid to be in a relationship and I\u0027m afraid to be out of it. I\u0027m afraid I\u0027ll wake up one of these days and look in the mirror and see an old man staring back at me. That I\u0027ll die alone in that room some day and nobody\u0027ll find me until the smell starts coming through the walls. \"So I got dressed and came over here because I don\u0027t want to drink and I don\u0027t want to feel like this, and after all these years I still don\u0027t know why it helps to run off at the mouth like this, but it does. Thank you.\" I figured I probably sounded like an emotional basket case, but you learn not to give a rat\u0027s ass what you sound like, and I didn\u0027t. It was particularly easy to spew it all in that room because I didn\u0027t know anybody there other than Peter Khoury, and if he only had a day he probably couldn\u0027t track complete sentences yet, let alone remember them five minutes later. And maybe I didn\u0027t sound that bad after all. At the end we stood and said the Serenity Prayer, and afterward a man two rows in front of me came up to me and asked for my phone number. I gave him one of my cards. \"I\u0027m out a lot,\" I said, \"but you can leave a message.\" We chatted for a minute, and then I went looking for Peter Khoury, but he was gone. I didn\u0027t know if he\u0027d left before the meeting ended or ducked out immediately after, but either way he was gone. I had a hunch he didn\u0027t want to see me, and I could understand that. I remembered the difficulties I\u0027d had at the beginning, putting a few days together, then drinking, then starting all over again. He had the added disadvantage of having been sober for a stretch, and the humiliation of having lost what he\u0027d had. With all of that going for him, it would probably take a while before he could work his way up to low self-esteem. In the meantime he was sober. He only had a day, but in a sense that\u0027s all you\u0027ve ever got. SATURDAY afternoon I took a break from TV sports and called a telephone operator. I told her I\u0027d lost the card telling me how to engage and disengage Call Forwarding. I envisioned her checking the records, determining that I\u0027d never signed up for the service, and calling 911 to order the hotel ringed by squad cars. \"Put that phone down, Scudder, and come out with your hands up!\" Before I could even finish the thought she had cued a recording, and a computer-generated voice was explaining what I had to do. I couldn\u0027t write it all down as fast as it came at me, so I had to call a second time and repeat the procedure. Just before I left the house to go over to Elaine\u0027s, I followed the directions, arranging things so that any calls to my phone would be automatically transferred to her line. Or at least that was the theory. I didn\u0027t have a great deal of faith in the process. She\u0027d bought tickets to a play at the Manhattan Theatre Club, a murky and moody play by a Yugoslavian playwright. I had the feeling that some of it was lost in translation, but what came over the footlights still retained a lot of brooding intensity. It took me through dark passages in the self without troubling to turn the lights on. The experience was even more of an ordeal than it might otherwise have been because they staged it without an intermission. That got us out of there by a quarter of ten, which was not a moment too soon, but it put us through the wringer in the process. The actors took their curtain calls, the house lights came up, and we shuffled out of there like zombies. \"Strong medicine,\" I said. \"Or strong poison. I\u0027m sorry, I\u0027ve been picking a lot of winners lately, haven\u0027t I? That movie that you hated and now this.\" \"I didn\u0027t hate this,\" I said. \"I just feel as though I went ten rounds with it, and I got hit in the face a lot.\" \"What do you figure the message was?\" \"It probably comes through best in Serbo-Croatian. The message? I don\u0027t know. That the world\u0027s a rotten place, I guess.\" \"You don\u0027t need to go to a play for that,\" she said. \"You can just read the paper.\" \"Ah,\" I said. \"Maybe it\u0027s different in Yugoslavia.\" We had dinner near the theater, and the mood of the play cloaked us. Halfway through I said, \"I want to say something. I want to apologize for the other night.\" \"That\u0027s over, honey.\" \"I don\u0027t know if it is. I\u0027ve been in a strange mood lately. Some of it has to be this case. We had a couple breaks, I felt as though I was making progress, and now everything\u0027s stuck again and I feel stuck myself. But I don\u0027t want it to affect us. You\u0027re important to me, our relationship is important to me.\" \"To me, too.\" We talked a little and things seemed to lighten up, although the play\u0027s mood was not easily set aside. Then we went back to her place and she checked her messages while I used the bathroom. When I came out she had a curious expression on her face. She said, \"Who\u0027s Walter?\" \"Walter.\" \"Just calling to say hello, nothing important, wanted to let you know he was alive, and he\u0027ll probably give you a call later.\" \"Oh,\" I said. \"Fellow I met at a meeting the night before last. He\u0027s fairly newly sober.\" \"And you gave him this number?\" \"No,\" I said. \"Why would I do that?\" \"That\u0027s what I was wondering.\" \"Oh,\" I said, as it dawned on me. \"Well, I guess it works.\" \"You guess what works?\" \"Call Forwarding. I told you the Kongs gave me Call Forwarding when they were playing games with the phone company. I put it on this afternoon.\" \"So your calls would come here.\" \"That\u0027s right. I didn\u0027t have a lot of faith that it would work, but evidently it does. What\u0027s the matter?\" \"Nothing.\" \"Are you sure?\" \"Of course. Do you want to hear the message? I can play it back again.\" \"Not if that\u0027s all it said.\" \"It\u0027s all right to erase it, then?\" \"Go ahead.\" She did, then said, \"I wonder what he thought when he dialed your number and there was an answering machine with a woman\u0027s voice.\" \"Well, he evidently didn\u0027t think he had the wrong number, or he wouldn\u0027t have left a message.\" \"I wonder who he thinks I am.\" \"A mysterious woman with a sexy voice.\" \"He probably thinks we\u0027re living together. Unless he knows you live alone.\" \"All he knows about me is I\u0027m sober and crazy.\" \"Why crazy?\" \"Because I was dumping a lot of garbage at the meeting I met him at. For all he knows I\u0027m a priest and you\u0027re the housekeeper at the rectory.\" \"That\u0027s a game we haven\u0027t tried. Priest and housekeeper. \u0027Bless me, Father, for I have been a very naughty girl and I probably need a good spanking.\u0027 \" \"I wouldn\u0027t be surprised.\" She grinned, and I reached for her, and the phone picked that moment to ring. \"You answer it,\" she said. \"It\u0027s probably Walter.\" I picked up the phone and a man with a deep voice asked to speak to Miss Mardell. I handed her the receiver without a word and walked into the other room. I stood at the window and looked at the lights on the other side of the East River. After a couple of minutes she came and stood beside me. She didn\u0027t allude to the call, nor did I. Then ten minutes later the phone rang again and she answered it and it was for me. It was Walter, just using the phone a lot the way they encourage newcomers to do. I didn\u0027t stay on with him long, and when I got off I said, \"I\u0027m sorry. It was a bad idea.\" \"Well, you\u0027re here a lot. People ought to be able to reach you.\" A few minutes later she said, \"Take it off the hook. Nobody has to reach either of us tonight.\" IN the morning I dropped in on Joe Durkin and wound up going out for lunch with him and two friends of his from the Major Crimes Squad. I went back to my hotel and stopped at the desk for my messages, but there weren\u0027t any. I went upstairs and picked up a book, and at twenty after three the phone rang. Elaine said, \"You forgot to take off Call Forwarding.\" \"Oh, for Christ\u0027s sake,\" I said. \"No wonder there weren\u0027t any messages. I just got home, I was out all morning, it slipped my mind completely. I was going to come straight home and fix it and I forgot. It must have been driving you crazy all day.\" \"No, but-\" \"But how did you get through? Wouldn\u0027t it just bounce your call back and give you a busy signal if you called here?\" \"It did the first time I tried. I called the desk downstairs and they patched the call through.\" \"Oh.\" \"Evidently it doesn\u0027t forward calls through the switchboard downstairs.\" \"Evidently not.\" \"TJ called earlier. But that\u0027s not important. Matt, Kenan Khoury just called. You have to call him right away. He said it\u0027s really urgent.\" \"He did?\" \"He said life or death, and probably death. I don\u0027t know what that means, but he sounded serious.\" I called right away, and Kenan said, \"Matt, thank God. Don\u0027t go nowhere, I got my brother on the other line. You\u0027re at home, right? Okay, stay on the line, I\u0027ll be with you in a second.\" There was a click, and then a minute or so later there was another click and he was back. \"He\u0027s on his way,\" he said. \"He\u0027s coming over to your hotel, he\u0027ll be right out in front.\" \"What\u0027s the matter with him?\" \"With Petey? Nothing, he\u0027s fine. He\u0027s gonna bring you out to Brighton Beach. Nobody\u0027s got time to dick around with the subway today.\" \"What\u0027s in Brighton Beach?\" \"A whole lot of Russians,\" he said. \"How do I put this? One of \u0027em just called to say he\u0027s going through business difficulties similar to what I went through.\" That could only mean one thing, but I wanted to make sure. \"His wife?\" \"Worse. I gotta go, I\u0027ll meet you there.\" Chapter 18 Late in September Elaine and I had spent an idyllic afternoon in Brighton Beach. We rode the Q train to the end of the line and walked along Brighton Beach Avenue, browsing in the produce markets, window-shopping, then exploring the side streets with their modest frame houses and a network of back streets, little walks and alleys and paths and ways. The bulk of the population consisted of Russian Jews, many of them very recent arrivals, and the neighborhood had felt extremely foreign while remaining quintessentially New York. We ate at a Georgian restaurant, then walked on the boardwalk clear to Coney Island, watching people hardier than ourselves bobbing in the ocean. Then we spent an hour at the Aquarium, and then we went home. If we had passed Yuri Landau in the street that day I don\u0027t suppose we\u0027d have looked at him twice. He would have looked at home there, as he must have once looked in the streets of Kiev or Odessa. He was a big man, broad in the chest, with a face that might have served as the model for an idealized worker in one of those murals from the days of Socialist Realism. A broad forehead, high cheekbones, sharply angled facial planes, and a prominent jaw. His hair was a medium brown, and lank; he was given to tossing his head to get his hair out of his face.","sourceLink":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10/page-34.html","bookId":2328,"book":{"id":2328,"title":"A Walk Among the Tombstones (Matthew Scudder #10)","description":"Storyline: A Walk Among the Tombstones (Matthew Scudder #10) The wife of Kheran Khoury, heroin wholesaler, is killed after he haggles over the price of her ransom. With the help of two computer geniuses, a streetwise punk, drug lords and his friend, ex-cop Scudder, they track the killers through the back streets of Brooklyn.","cover":"https://allnovel.net/images/a-walk-among-the-tombstones-matthew-scudder-10.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:51:32 AM"}}
