{"id":63767,"no":42,"title":"Page 42","content":"He said, \"They get there at ten-thirty, right? And we\u0027re due ten minutes later, and then we work our way up to where they\u0027re waiting. Is that about right?\"\\n\\n I said it was.\\n\\n \"So we\u0027ll be face-to-face across no-man\u0027s-land about ten minutes of eleven, is that about how you figure it?\"\\n\\n \"Something like that.\"\\n\\n \"And how long to make the trade and get out? Half an hour?\"\\n\\n \"Probably a lot less than that, if nothing goes wrong. If the shit hits the fan, well, it\u0027s another story.\"\\n\\n \"Yeah, so let\u0027s hope it doesn\u0027t. I was just wondering about getting back out again, but I guess they don\u0027t lock the gates until midnight.\"\\n\\n \"Lock the gates?\"\\n\\n \"Yeah, I woulda guessed it\u0027d be earlier, but I guess not or you would have picked someplace else.\"\\n\\n \"Jesus,\" I said.\\n\\n \"What\u0027s the matter?\"\\n\\n \"I never even thought of that,\" I said. \"Why didn\u0027t you say something earlier?\"\\n\\n \"Then what would you do, call him back?\"\\n\\n \"No, I guess not. It never occurred to me that they might lock the gates. Don\u0027t cemeteries stay open all night? Why would you have to lock them up?\"\\n\\n \"To keep people out.\"\\n\\n \"Because everybody\u0027s dying to get in? Jesus, I must have heard that one in the fourth grade. \u0027Why do they have a fence around the cemetery?\u0027 \"\\n\\n \"I guess they get vandals,\" Kenan said. \"Kids who tip over the gravestones, take a shit in the floral urns.\"\\n\\n \"You think the kids can\u0027t climb fences?\"\\n\\n \"Hey, man,\" he said. \"I\u0027m not setting the policy here. It\u0027s up to me, all the graveyards in town\u0027ll be open admission. How\u0027s that?\"\\n\\n \"I just hope I didn\u0027t screw up. If they get there and the gates are locked-\"\\n\\n \"Yeah? What are they gonna do, sell her to white slave traders in Argentina? They\u0027ll climb the fence, same as we\u0027ll do. Matter of fact, they probably don\u0027t lock it before midnight. People might want to go after work, pay a late call on the dear departed.\"\\n\\n \"At eleven o\u0027clock?\"\\n\\n He shrugged. \"People work late. They got office jobs in Manhattan, stop for a couple of drinks after work, they have dinner, then they go to wait half an hour for the subway because they\u0027re like some people I know, they\u0027re too cheap to take a cab-\"\\n\\n \"Jesus,\" I said.\\n\\n \"- and it\u0027s late by the time they get back to Brooklyn and they say, \u0027Hey, I think I\u0027ll go over to Green-Wood, see if I can find where Uncle Vic is planted, I never liked him, I think I\u0027ll go piss on his grave.\u0027 \"\\n\\n \"You nervous, Kenan?\"\\n\\n \"Yeah, I\u0027m nervous. What do you fucking think? You\u0027re the one\u0027s gotta walk up to a couple of stone killers armed with nothing but money. You must be starting to sweat.\"\\n\\n \"Maybe a little bit. Slow down, that\u0027s the entrance coming up. I think it\u0027s open.\"\\n\\n \"Yeah, it looks like it. You know, even if they\u0027re supposed to lock up, they probably don\u0027t get around to it.\"\\n\\n \"Maybe not. Let\u0027s drive once around the entire cemetery, all right? And then we\u0027ll find a place to park near our entrance.\"\\n\\n We circled the cemetery in silence. There was no traffic to speak of, and there was a stillness to the night, as if the deep silence within the cemetery fence could reach out and suppress all sound in the vicinity.\\n\\n When we were just about back where we\u0027d started TJ said, \"We goin\u0027 in a cemetery?\"\\n\\n Kenan turned aside to hide a grin. I said, \"You can stay in the car if you\u0027d rather.\"\\n\\n \"What for?\"\\n\\n \"If you\u0027d be more comfortable.\"\\n\\n \"Man,\" he said, \"I ain\u0027t scared of no dead people. That what you think? That I scared?\"\\n\\n \"My mistake.\"\\n\\n \"Your mistake is right, Dwight. Dead folks don\u0027t bother me.\"\\n\\n DEAD people didn\u0027t bother me much, either. It was some of the live ones that worried me.\\n\\n We met at the Thirty-fifth Street gate and slipped inside right away, not wanting to draw attention on the street. For now, Yuri and Pavel were carrying the money. We had two flashlights among the seven of us. Kenan took one of them. I had the other, and I led the way.\\n\\n I didn\u0027t use the light much, just flicked it quickly on and off when I needed to see where I was going. This wasn\u0027t necessary most of the time. There was a waxing moon overhead, and a certain amount of light from the streetlamps on the avenue. The tombstones were mostly of white marble and they showed up well once your eyes were accustomed to the dimness. I threaded my way among them and wondered whose bones I was walking over. One of the papers had run a story within the past year or so on where the bodies were buried, an inventory of gravesites of the rich and famous throughout the five boroughs. I hadn\u0027t paid too much attention to it, but I seemed to recall that a fair number of prominent New Yorkers were interred at Green-Wood.\\n\\n Some enthusiasts, I\u0027d read, make a hobby of visiting graves. Some take photographs, others make rubbings of tombstone inscriptions. I couldn\u0027t imagine what they got out of it, but it doesn\u0027t sound that much nuttier than some of the things I do. Their pursuit only brought them out in the daytime. They weren\u0027t stumbling around in the dark, trying to keep from tripping over a chunk of granite.\\n\\n I soldiered on. I stayed close enough to the fence to see the street signs, and I slowed down when I got to Twenty-seventh Street. The others drew closer, and I gestured for them to fan out a ways without advancing any farther north. Then I turned toward where Raymond Callander was supposed to be and pointed my flashlight out in front of me, triggering the trio of flashes we\u0027d agreed on.\\n\\n For a long moment the only answer was darkness and silence. Then three flashes of light blinked back at me, coming from a little right of dead ahead. They were, I calculated, something like a hundred yards from us, maybe more. It didn\u0027t seem that far when someone was running with a football under his arm. Now, though, it looked much too distant.\\n\\n \"Stay where you are,\" I called out. \"We\u0027re going to approach a little closer.\"\\n\\n \"Not too close!\"\\n\\n \"About fifty yards,\" I said. \"The way we arranged.\"\\n\\n Flanked by Kenan and one of Yuri\u0027s men, with the rest of our party not far behind, I covered about half the distance separating us. \"That\u0027s far enough,\" Callander called out at one point, but it wasn\u0027t far enough and I ignored him and kept on walking. We had to be close enough so that someone could cover the transfer. We had one rifle, and Peter had been entrusted with it, having proved a good marksman during a six-month hitch a while back in the National Guard. Of course that was before a lengthy apprenticeship as a drunk and a dope addict, but he still figured to be the best shot in the group. He had a decent rifle with a scope sight, but the scope wasn\u0027t infrared so he\u0027d be aiming by moonlight. I wanted to keep the distance down so that he could make his shots count if he had to.\\n\\n Although I wondered what difference it made to me. The only reason he\u0027d start shooting would be if the players on the other side tried a cross, and if they did they\u0027d take me out in the first minute of the opening round. If Peter started firing back at them, I wouldn\u0027t be around to know where the bullets went.\\n\\n Cheering thoughts.\\n\\n When we\u0027d cut the distance in half I signaled to Peter, and he moved off to the side and selected a shooting stand for himself, propping the rifle barrel on a low marble grave marker. I looked for Ray and his partner and could only see shapes. They had drawn back into the darkness.\\n\\n I said, \"Come out where we can see you. And show the girl.\"\\n\\n They moved into view. Two forms, and then as the light got better you could see that one form was made up of two persons, that one of the men had the girl in front of him. I heard Yuri\u0027s intake of breath and just hoped he\u0027d keep his cool.\\n\\n \"I\u0027ve got a knife to her throat,\" Callander called. \"If my hand slips-\"\\n\\n \"It better not.\"\\n\\n \"Then you\u0027d better bring the money. And not try anything cute.\"\\n\\n I turned, hefted the suitcases, checked our troops. I didn\u0027t see TJ and asked Kenan what had happened to him. He said he thought he might have gone back to the car. \" \u0027Feet, do yo\u0027 stuff,\u0027 \" he said. \"I don\u0027t think he\u0027s crazy about graveyards at night.\"\\n\\n \"Neither am I.\"\\n\\n \"Listen,\" he said, \"whyntcha tell them we\u0027re changing the rules, the money\u0027s too heavy for one person to carry, and I\u0027ll walk up there with you.\"\\n\\n \"No.\"\\n\\n \"Gotta be the hero, huh?\"\\n\\n I can\u0027t say I felt terribly heroic. The weight of the suitcases kept me from being particularly jaunty. It looked as though one of the men had a gun, not the one holding the girl, and it looked as though the gun was pointed at me, but I didn\u0027t feel in danger of being shot, not unless someone on our side panicked and got off a round and everybody just let fly. If they were going to kill me, they\u0027d at least wait until I\u0027d brought them the money. They might be crazy but they weren\u0027t stupid.\\n\\n \"Don\u0027t try a thing,\" Ray said. \"I don\u0027t know if you can see it, but the knife\u0027s right at her throat.\"\\n\\n \"I can see.\"\\n\\n \"That\u0027s close enough. Put the bags down.\"\\n\\n It was Ray holding the girl, holding the knife. I knew his voice but I would have made him from TJ\u0027s description, which was right on the money. His jacket was zipped so I couldn\u0027t see the lame sport shirt, but I was willing to take TJ\u0027s word for it.\\n\\n The other man was taller, with unkempt dark hair and eyes that looked in the half-light like a pair of holes burned in a bedsheet. He wore no jacket, just a flannel shirt and jeans. I couldn\u0027t see his eyes but I could feel the anger in his stare and I wondered what the hell he thought I\u0027d done to provoke it. I was bringing him a million dollars and he was itching to kill me.\\n\\n \"Open the bags.\"\\n\\n \"First let the girl go.\"\\n\\n \"No, first show the money.\"\\n\\n The pistol Kenan had insisted on giving me was in the small of my back, its barrel wedged under my belt, its bulk concealed by my sport jacket. There is no terribly adroit way to draw it quickly from that position, but I had my hands free now and could go for it.\\n\\n Instead I knelt and unfastened the snaps on one of the cases, lifting the lid to show the money. I straightened up. The man with the gun started forward and I held up a hand.\\n\\n \"Now let her go,\" I said. \"Then you can examine it. Don\u0027t try to change the ground rules now, Ray.\"\\n\\n \"Ah, sweet Lucy,\" he said. \"I hate to see you go, child.\"\\n\\n He let go of her. I\u0027d barely had a chance to look at her, half-shadowed by his body. Even in the darkness she looked pale and drawn. Her hands were clutched together at her waist, her arms tight against her sides, her shoulders hunched. She looked as though she was trying to present the smallest possible target to the world.\\n\\n I said, \"Come here, Lucia.\" She didn\u0027t move. I said, \"Your father\u0027s over there, darling. Go to your father. Go ahead.\"\\n\\n She took a step, then stopped. She looked very unsteady on her feet, and she was gripping one hand tightly with the other.\\n\\n \"Go on,\" Callander told her. \"Run!\"\\n\\n She looked at him, then at me. It was hard to tell what she was seeing because her gaze was unfocused, vacant. I wanted to pick her up, toss her over my shoulder, run back to where her father was waiting.\\n\\n Or tug my jacket aside with one hand, draw the gun with the other, and drop both of the bastards where they stood. But the dark man\u0027s gun was pointing at me, and Callander also had a gun in his hand now, a companion piece for the long knife he was still holding. \\n\\n","sourceLink":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10/page-42.html","bookId":2328,"book":{"id":2328,"title":"A Walk Among the Tombstones (Matthew Scudder #10)","description":"Storyline: A Walk Among the Tombstones (Matthew Scudder #10) \\n The wife of Kheran Khoury, heroin wholesaler, is killed after he haggles over the price of her ransom. With the help of two computer geniuses, a streetwise punk, drug lords and his friend, ex-cop Scudder, they track the killers through the back streets of Brooklyn.\\n","cover":"https://allnovel.net/images/a-walk-among-the-tombstones-matthew-scudder-10.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:51:32 AM"}}
