{"id":63706,"no":9,"title":"Page 9","content":"\"Dear God,\" she said.\\n\\n \"The things people do.\"\\n\\n \"There\u0027s just no end, is there? No bottom to it.\" She took a sip of water. \"The cruelty of it, the utter sadism. Why would anyone- well, why ask why?\"\\n\\n \"I figure it has to be pleasure,\" I said. \"They must have gotten off on it, not just on the killing but on rubbing his nose in it, jerking him around, telling him she\u0027ll be in the car, she\u0027ll be home when he gets there, then finally letting him find her in pieces in the trunk of the Ford. They wouldn\u0027t have to be sadists to kill her. They could see it as safer that way than to leave a witness who could identify them. But there was no practical advantage in twisting the knife the way they did. They went to a lot of trouble dismembering the body. I\u0027m sorry, this is great table talk, isn\u0027t it?\"\\n\\n \"That\u0027s nothing compared to what a great pre-bedtime story it makes.\"\\n\\n \"Puts you right in the mood, huh?\"\\n\\n \"Nothing like it to get the juices flowing. No, really, I don\u0027t mind it. I mean I mind, of course I mind, but I\u0027m not squeamish. It\u0027s gross, cutting somebody up, but that\u0027s really the least of it, isn\u0027t it? The real shock is that there\u0027s that kind of evil in the world and it can come from out of nowhere and zap you for no good reason at all. That\u0027s what\u0027s awful, and it\u0027s just as bad on an empty stomach as on a full one.\"\\n\\n WE went back to her apartment and she put on a Cedar Walton solo piano album that we both liked, and we sat together on the couch, not saying much. When the record ended she turned it over, and halfway through Side Two we went into the bedroom and made love with a curious intensity. Afterward neither of us spoke for a long time, until she said, \"I\u0027ll tell you, kiddo. If we keep on like this, one of these days we\u0027re gonna get good at it.\"\\n\\n \"You think so, huh?\"\\n\\n \"It wouldn\u0027t surprise me. Matt? Stay over tonight.\"\\n\\n I kissed her. \"I was planning to.\"\\n\\n \"Mmmm. Good plan. I don\u0027t want to be alone.\"\\n\\n Neither did I.\\n\\n Chapter 4\\n\\n I stayed for breakfast, and by the time I got out to Atlantic Avenue it was almost eleven. I spent five hours there, most if it on the street and in shops but some of it in a branch library and on the phone. A little after four I walked a couple of blocks and caught a bus to Bay Ridge.\\n\\n When I\u0027d seen him last he\u0027d been rumpled and unshaven, but now Kenan Khoury looked cool and composed in gray gabardine slacks and a muted plaid shirt. I followed him into the kitchen and he told me his brother had gone to work in Manhattan that morning. \"Petey said he\u0027d stay here, he didn\u0027t care about work, but how many times are we gonna have the same conversation? I made him take the Toyota so he\u0027s got that to get back and forth. How about you, Matt? You getting anywhere?\"\\n\\n I said, \"Two men about my size took your wife off the street in front of The Arabian Gourmet and hustled her into a dark blue panel truck or van. A similar truck, probably the same one, was tailing her when she left D\u0027Agostino\u0027s. The truck had lettering on the doors, white lettering according to one witness. TV Sales \u0026 Service, with the company name composed of indeterminate initials. B \u0026 L, H \u0026 M, different people saw different things. Two people remembered an address in Queens and one specifically recalled it as Long Island City.\"\\n\\n \"Is there such a firm?\"\\n\\n \"The description\u0027s vague enough so that there are a dozen or more firms that would fit. A couple of initials, TV repair, a Queens address. I called six or eight outfits and couldn\u0027t come up with anybody who runs dark blue trucks or who had a vehicle stolen recently. I didn\u0027t expect to.\"\\n\\n \"Why not?\"\\n\\n \"I don\u0027t think the truck was stolen. My guess is that they had your house staked out Thursday morning hoping your wife would go out by herself. When she did they followed her. It probably wasn\u0027t the first time they tailed her, waiting for an opportunity to make their play. They wouldn\u0027t want to steal a truck each time and ride around all day in something that\u0027s liable to show up any hour on the hot-car sheet.\"\\n\\n \"You think it was their truck?\"\\n\\n \"Most likely. I think they painted a phony company name and address on the doors, and once they completed the snatch they painted the old name out and a new name in. By now I wouldn\u0027t be surprised if the whole body\u0027s repainted some color other than blue.\"\\n\\n \"What about the license plate?\"\\n\\n \"It had probably been switched for the occasion, but it hardly matters because nobody got the plate number. One witness thought the three of them had just knocked over the food market, that they were robbers, but all he wanted to do was get inside the store and make sure everybody was all right. Another man thought something funny was going on and he did take a look at the plate, but all he remembered was that it had a nine in it.\"\\n\\n \"That\u0027s helpful.\"\\n\\n \"Very. The men were dressed alike, dark pants and matching work shirts, matching blue windbreakers. They looked to be in uniform, and, between that and the commercial vehicle they were driving, they appeared legitimate. I learned years ago that you can walk in almost anywhere if you\u0027re carrying a clipboard because it looks as though you\u0027re doing your job. They had that edge going for them. Two different people told me they thought they were watching two undercover guys from the INS taking an illegal alien off the street. That\u0027s one reason nobody interfered, that and the fact that it was over and done with before anyone had time to react.\"\\n\\n \"Pretty slick,\" he said.\\n\\n \"The uniform dress did something else, too. It made them invisible, because all people saw was their clothing, and all they remember was that both of them looked the same. Did I mention that they had caps on, too? The witnesses described the caps and the jackets, things they put on for the job and got rid of afterward.\"\\n\\n \"So we don\u0027t really have anything.\"\\n\\n \"That\u0027s not really true,\" I said. \"We don\u0027t have anything that leads directly to them, but we\u0027ve got something. We know what they did and how they did it, that they\u0027re resourceful, that they planned their approach. How do you figure they picked you?\"\\n\\n He shrugged. \"They knew I was a trafficker. That was mentioned. That makes you a good target. They know you\u0027ve got money and they know you\u0027re not going to call the police.\"\\n\\n \"What else did they know about you?\"\\n\\n \"My ethnic background. The one guy, the first one, he called me some names.\"\\n\\n \"I think you mentioned that.\"\\n\\n \"Raghead, sand nigger. That\u0027s a nice one, huh? Sand nigger. He left out camel jockey, that\u0027s one I used to hear from the Italian kids at St. Ignatius. \u0027Hey, Khoury, ya fuckin\u0027 camel jockey!\u0027 Only camel I ever saw was on a cigarette pack.\"\\n\\n \"You think being an Arab made you a target?\"\\n\\n \"It never occurred to me. There\u0027s a certain amount of prejudice, no question about it, but I\u0027m not usually that conscious of it. Francine\u0027s people are Palestinian, did I mention that?\"\\n\\n \"Yes.\"\\n\\n \"They have it tougher. I know Palestinians who say they\u0027re Lebanese or Syrian just to avoid hassles. \u0027Oh, you\u0027re Palestinian, you must be a terrorist.\u0027 That kind of ignorant remark, and there are people who have bigoted ideas about Arabs in general.\" He rolled his eyes. \"My father, for instance.\"\\n\\n \"Your father?\"\\n\\n \"I wouldn\u0027t say he was anti-Arab, but he had this whole theory that we weren\u0027t actually Arabs. Our family\u0027s Christian, see.\"\\n\\n \"I wondered what you were doing at St. Ignatius.\"\\n\\n \"There were times I wondered myself. No, we were Maronite Christians, and according to my old man we were Phoenicians. You ever hear of the Phoenicians?\"\\n\\n \"Back in biblical times, weren\u0027t they? Traders and explorers, something like that?\"\\n\\n \"You got it. Great sailors, they sailed all around Africa, they colonized Spain, they probably reached Britain. They founded Carthage in North Africa, and there were a lot of Carthaginian coins dug up in England. They were the first people to discover Polaris, that\u0027s the North Star, I mean to discover that it was always in the same spot and could be used for navigation. They developed an alphabet that served as the basis for the Greek alphabet.\" He broke off, slightly embarrassed. \"My old man talked about them all the time. I guess some of it must have soaked in.\"\\n\\n \"It looks like it.\"\\n\\n \"He wasn\u0027t a lunatic on the subject, but he knew a lot about it. That\u0027s where my name comes from. The Phoenicians called themselves the Kena\u0027ani, or Canaanites. My name should be pronounced Keh-nahn, but everyone\u0027s always said Kee-nan.\"\\n\\n \" \u0027Ken Curry\u0027 is the message I got yesterday.\"\\n\\n \"Yeah, that\u0027s typical. I\u0027ve ordered things on the phone and they turn up addressed to Keane \u0026 Curry, it sounds like a couple of Irish lawyers. Anyway, according to my father the Phoenicians were a completely different people from the Arabs. They were the Canaanites, they were already a people at the time of Abraham. Whereas the Arabs were descended from Abraham.\"\\n\\n \"I thought the Jews were descendants of Abraham.\"\\n\\n \"Right, through Isaac, who was the legitimate son of Abraham and Sarah. Meanwhile the Arabs were the sons of Ishmael, who was the son Abraham fathered with Hagar. Jesus, here\u0027s something I haven\u0027t thought of in a long time. When I was a kid my father had this mild feud with this grocer around the block on Dean Street, and he used to refer to him as \u0027that Ishmaelite bastard.\u0027 God, what a character he was.\"\\n\\n \"Is he still living?\"\\n\\n \"No, he died three years ago. He was diabetic, and over the years it weakened his heart. When I\u0027m down on myself I tell myself he died of a broken heart because of how his sons turned out. He was hoping for an architect and a doctor and instead he got a drunk and a dope dealer. But that\u0027s not what killed him. His diet killed him. He was diabetic and he was fifty pounds overweight. Me and Petey could have turned out to be Jonas Salk and Frank Lloyd Wright and it wouldn\u0027t have done him any good.\"\\n\\n AROUND six Kenan made the first of a series of phone calls after the two of us had worked out an approach. He dialed a number, waited for a tone, then punched in his own number and hung up. \"Now we wait,\" he said, but we didn\u0027t have to wait very long. In less than five minutes the phone rang.\\n\\n He said, \"Hey, Phil, how\u0027s it going? Great. Here\u0027s the deal. I don\u0027t know if you ever met my wife. The thing is, we had this kidnap threat, I had to send her out of the country. I don\u0027t know what it\u0027s about but I think it has to do with the business, you follow me? So what I\u0027m doing, I\u0027ve got a guy checking it out for me, like a professional. And I wanted, you know, to pass the word, because the sense I got is these people are serious about this and my impression is they\u0027re stone killers. Right. Yeah, that\u0027s the thing, man, we sit here and we\u0027re easy marks, we got plenty of cash and we can\u0027t holler for the law, and that makes us the perfect target for home invasions and every goddam thing… Right. So all I\u0027m saying is be careful, you know, and keep an eye and an ear open. And pass the word around, you know, to whoever you think ought to hear it. And if any shit comes down, man, call me, you understand? Right.\"\\n\\n He hung up and turned to me. \"I don\u0027t know,\" he said. \"I think all I did was convince him I\u0027m getting paranoid in my old age. \u0027Why\u0027d you send her out of the country, man? Why not just buy a dog, hire a bodyguard?\u0027 Because she\u0027s dead, you dumb fuck, but I didn\u0027t want to tell him that. If the word gets around it\u0027s got to mean problems. Shit.\" \\n\\n","sourceLink":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10/page-9.html","bookId":2328,"book":{"id":2328,"title":"A Walk Among the Tombstones (Matthew Scudder #10)","description":"Storyline: A Walk Among the Tombstones (Matthew Scudder #10) \\n The wife of Kheran Khoury, heroin wholesaler, is killed after he haggles over the price of her ransom. With the help of two computer geniuses, a streetwise punk, drug lords and his friend, ex-cop Scudder, they track the killers through the back streets of Brooklyn.\\n","cover":"https://allnovel.net/images/a-walk-among-the-tombstones-matthew-scudder-10.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-walk-among-the-tombstones-matthew-scudder-10.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:51:32 AM"}}
