{"id":109372,"no":13,"title":"Page 13","content":"\"Stabilize?\" Rider began to pace. \"Isn\u0027t there anything you can do, or give her?\" \"What\u0027s wrong with me, guys?\" Marlene glanced up at Rider, and then returned her focus to Damali. \"What did ...\" Her voice trailed off, and Marlene sucked in a deep breath. \"What did the female vampire say that made you follow it like you did?\" Damali closed her eyes and took her time, her breaths steadying her. Marlene hadn\u0027t answered her original question, though. \"It said, \u0027You can\u0027t have him.\u0027 Then something inside me snapped. It said, \u0027You can never take my place.\u0027 Whatever that means.\" \"A queen second,\" Mike murmured. \"Just as Marlene suspected.\" \"Oh, boy. Here we go,\" J.L. said on a hard exhale. \"Jesus H. Christ.\" Rider sat down heavily on a stool, shaking his head. \"Already?\" \"Yeah,\" Marlene agreed quietly. \"We\u0027ve got one in our territory and the vampire huntress picked up the scent... and it\u0027s defending her own territory. Damali won\u0027t stop until she gets it, or the contrary. The female vampire\u0027s aggression is a sure sign that we\u0027ve got a master male vamp in this quadrant. It just confirmed my suspicions. Until last night, I was just playing a hunch.\" \"I don\u0027t understand.\" Damali slowly pulled away from Jose and wrapped her arms around herself, intently watching her team. Shabazz looked at the map and traced it with his finger. \"The energy a guardian team casts will draw weaker members of a vampire line - because the perpetual hunger is not only blood, but power. The blood of a guardian is like a drug hit, too. So, from time to time, we get sniffed out, is the only explanation. But as Neteru energy matures, it throws a scent to a pack that\u0027s stronger than anything a guardian team can throw off.\" Shabazz looked at Damali, his gaze softening as he glanced away. \"When we found you, you were still a little bird ... you didn\u0027t leave that much of a trail, or a marker.\" \"Wasn\u0027t long before a couple of \u0027em came for you, then we turned the tables on the situation, and went on the offensive - per Marlene\u0027s wisdom,\" Big Mike murmured. \"The idea was to flush out the nest and wipe out that line before you came of age and had to deal with all of this.\" He looked away, and his voice dropped so low that Damali had to strain to hear it. \"Marlene will tell you about why we had to clear this nest, or at least back it up, before your time.\" His eyes met Marlene\u0027s. \"Right, Mar? You\u0027ll tell her today.\" \"Tell me what?\" Jose nodded to the map, his trembling finger touching the edge of it. His gesture temporarily drew Damali\u0027s attention away from her question, and it stilled the group. They let him talk uninterrupted in a weak, scratchy tone. \"My grandfather\u0027s people, the Creeks, believed that night feeders divide territory and mark it like wolves. Shamans say if one outside their line is caught hunting in the wrong territory, the others will attack it. Told as legend, the old ones say the night feeders migrate and are nomadic - but travel within the same route that they\u0027ve been following for centuries.\" Jose wheezed and straightened himself, and then leaned on the workbench for support as Damali\u0027s hands fell away from her sides. She folded her arms in front of her and waited with the rest of them for him to continue. \"There\u0027s at least one known vampire line on every continent - but like all predators, we\u0027re not sure how or why, but something limits their growth. Most times, they snap the victims\u0027 necks first, and then immediately feed, while the blood is still warm, fresh kill. Usually that just leaves a corpse, and there\u0027s no problem. Their numbers remain stable that way.\" Rider let out his breath hard and rubbed his palms over his face. \"Yeah, but we\u0027ve got mugs jumping up off morgue slabs now in record numbers - so they\u0027re building in ranks like I\u0027ve never seen before - not that any of this is normal, mind you. But comparatively speaking, something big is brewing.\" \"Okay,\" Damali said, taking her time. \"So, Marlene was originally attacked, and like all of us, had a run-in with one of them solo, but made it out alive. Then, we somehow got guided to each other to form a team, right? That part I get. You\u0027ve all told me this before, remember. Tell me something new.\" \"Divine intervention, how we all got together,\" Jose whispered. \"We were shown, were blessed with the gifts to keep us out of that vampire line, and that light force drew us together by what others might call strange coincidences - but, by now, we know there\u0027s no such thing as a coincidence.\" \"True dat,\" Big Mike whispered. \"Okay. I know that. So what would make them move on a coupla record companies and a club - and not just feed and leave, if they have this growth limiter? And, what\u0027s this queen thing?\" Damali\u0027s question hung in the air, and the group shifted nervously. \"We don\u0027t know what supernatural laws limit their growth,\" Marlene said softly. She glanced at the team, her expression tense. \"Or, what specifically has sent them into a feeding frenzy ... at least not all of what may have.\" \"Oh, shit, Marlene,\" Rider yelled, frustrated. \"Just tell the girl!\" \"Tell me what? Somebody talk to me!\" Damali was now pacing, and no longer looking at the map. Her gaze was singularly focused on Marlene. \"When you guys all went out, and while you were asleep, Damali, I investigated the last known site of the master vampire - who was supposedly vanquished years ago - in New Orleans. I looked up the property records, and that same house is within what was then Fallen Nuit\u0027s holdings. It\u0027s now listed under Blood Music, and after you peel back the layers of owners, Nuit\u0027s name pops up.\" \"Why didn\u0027t you tell me this before, Marlene?\" She stared at her mentor, and Marlene\u0027s gaze slid away. \"You know the master vampire\u0027s name?\" Damali was incredulous. Her group kept something this important from her. Now she was more than stunned, she was pissed! \"If you knew where the lair was, you\u0027d go after it, before you were ready. Our job is to protect you.\" \"What is this \u0027ready\u0027 thing? Please, Marlene, fill in the blanks.\" Marlene\u0027s expression was tender as she took her time to speak. \"You had to clean out your body with organic food in preparation for the ripening, and to keep your body a temple - that\u0027swhy we wouldn\u0027t let anybody near you. Then, the stars aligned, and - \" \"Wait!\" Damali screamed, putting her hands in front of her, and then digging her fingers into her scalp. \"Talk slower! Ripening?\" She felt like she would retch as everyone\u0027s thoughts simultaneously entered her skull. Information be?t itself into her brain. Terror seized her. She was changing like that? They were all clamoring inside her mind about her bones, teeth, skin ... Her body would do what? Oh, my God ... she was a freak. Not just a sister who could kick ass. All the training made sense, all the weird shit that had happened to them. Damali squeezed her eyes shut, and tears streamed from the corners of them. \"Don\u0027t even say it,\" she shrieked, and then blocked the rest of their garbled thoughts. \"But why didn\u0027t you tell me this would happen?! You\u0027re telling me that I can hear and smell things like a damned bloodhound, and it\u0027ll only get worse? You call that ripening? Shit!\" \"She\u0027s hearing thought before it\u0027s uttered,\" J.L. murmured. \"You all have to take it easy. She\u0027s just hit a wall. This was a lot of data and you\u0027re crashing her mental hard drive.\" Damali was breathing in shuddered bursts. Tears were streaming down her face. She didn\u0027t wipe at them, just let her gaze land on each face. \"We couldn\u0027t afford to break your confidence,\" Marlene said gently. \"You needed time to accept this part of it all. You might have gone into battle unsure, in every fight you might have second-guessed yourself, or worse, been overconfident - and that split-second of hesitation, or a misplaced blow, could have cost you your life.\" \"How do you know?\" Damali could barely ask the question as another sob threatened to choke her when she swallowed it down. \"I\u0027m the seer, remember?\" Marlene went to Damali and gently held her hands. Damali dropped Marlene\u0027s hands, not in anger, but in abject despair. \"Then why am I here?\" \"Have you watched the audiences when you do your con- certs?\" Marlene whispered. \"You were gifted with oratorical skills that mesmerize. How many great people changed the course of history, just by words? Think about it, baby. Even your name - Damali - means beautiful vision. You must now learn to see the path better.\" Damali\u0027s gaze tore around the room again. She didn\u0027t know where it should land first. Silence stood among them, but she could still hear parts of their thoughts. The reality was disorienting. She closed her eyes to get her bearings. \"Every thousand years a Neteru is born,\" Shabazz said. \"A vampire huntress. This millennium, you\u0027re it. And at least seven of us, usually twelve, come with the package to bodyguard a Neteru while they wipe out a predator\u0027s line that\u0027s getting too thick. There must be one hundred and forty-four thousand of us on the planet at any given time to hold all manifestations of evil at bay - an army of twelve times twelve, representing the twelve original tribes. Guardians are made and lost every day.\" Shabazz walked around the table, his arms open, sweeping past the group. \"Twelve. Each guarding the sections of the ancient sacred texts. In Tibet, in Rome at the Vatican, in Egypt, in Asia, in the U.S., in South America, in the motherland, in Hopi country, you name a region or continent, we are hidden, but there.\" Damali opened her eyes and just stared at her team. This was definitely new information ... just as she\u0027d requested. But it wasn\u0027t what she\u0027d expected to hear. \"The Holy City and the Church of the Nativity has even been under siege with all three of the major world religions at war with each other - watch the news,\" Jose murmured. J.L. offered him a confirming nod. \"The planet Earth is out of balance, it was time for a Neteru to show up. Don\u0027t you think the recent world events would cry out for the need to return the balance of peace? Think about it, D. Evil has a stranglehold on mankind, making us wipe each other out ... culture-by-culture, race-by-race, tribe-by-tribe, and religion-by-religion. You think that\u0027s an accident?\" \"Like we told you when we first found you - music, art, draws people together across these invisible, ridiculous lines. That\u0027s why it\u0027s sacred, baby. Remember what we told you? Connect the dots. The artists cross the lines; music is universal, like other forms of art. It touches the soul, can make people feel emotions past ideological rhetoric. Can blend, bond, fuse, and heal the rip in the human family. It\u0027s powerful. You were gifted with the voice. So, here we are,\" Marlene added and then gave Shabazz the floor. Shabazz accepted his turn to speak again and released a slow breath with patience. \"But what we didn\u0027t tell you was that guardians are secreted away to preserve the balance within every aspect of human interaction. We didn\u0027t just coincidentally roll up on you and then band together.\" Shabazz paused, and then pressed on when Damali remained silent. \"Sure, we told you we were guardians, and loosely described that you were a vampire huntress, a Neteru - a slayer - but never properly defined what that meant. It wasn\u0027t the time. First we had to protect you, gain your trust - which was hard for you to give us, coming from your life on the streets. We needed to earn your respect, and you needed to emotionally mature enough to listen to us without running away again to avoid the inevitable. Today, you\u0027re ready to hear us. Clarity is required.\" Damali nodded, and Shabazz continued. \"There are more of us out in the world than just this team, that\u0027s what we never explained. Some guardians are dispatched to work with the spirits to close tears and fissures in the veil between worlds. Some work with world leaders to bring wisdom, justice, compassion. Some work the streets. Some work the schools to develop young minds. Some to unearth demon nests... and some of us, from every culture represented, get selected to guard a Neteru. None of us wanted to freak you out with too much knowledge too soon. Until last night, we had been able to pass you off to the vamps as just another guardian ... until you went into your first real blood lust. Now, your energy is strong enough for them to find you. So, I am a Neteru guardian, as are we all. I am honored.\" A collective \"Ashe, Amen,\" rippled through the group, as they yielded the floor to their team\u0027s most learned philosopher, Sha-bazz. \"Those that guard the sacred texts, and the Neteru guardians, have the most dangerous mission, but the highest honor of the sets of twelve - and the most difficult,\" Shabazz said, his tone unwavering. \"Everything we taught you was to keep you safe, our Sankofa, until you could fly like an eagle on your own. Last night, you tested your wings. Now, it\u0027s on. You have to fly.\" \"A hundred forty-four thousandguardians in secret armies?\" Her head was spinning. Damali found the sofa and sat slowly, needing to breathe. \"How many vampire colonies do you think are walking the planet, sis?\" Rider shook his head and paced away from the group. \"There\u0027s at least five or six that we know of. Now let\u0027s add in werewolves, demons, not to mention just your regular schmoes who do bad shit in the world. Okay? There\u0027s plenty enough to keep divisions of us busy down here, along with all the companies up in Heaven. We are at war with the dark side. It\u0027s a war, not just one battle in the night. That\u0027s why Mar flipped out on you. She had reason. You need to listen to the general, until you get your stars, kiddo.\" Damali\u0027s line of vision searched the deadly serious faces around the table. \"We let you have time to be a kid,\" Jose murmured. \"Because we love you.\" \"Yeah. Information like this sorta blows the groove, doesn\u0027t it?\" Rider let out a weary sigh. \"Hell, after the first attack, Marlene didn\u0027t even want us to explain it to you, because she wanted you to still have a little more time.\" Shabazz nodded, and then pounded Rider and Big Mike\u0027s fists. \"The forces of light came to Marlene in a vision. That\u0027s why Marlene, a guide, found you. Seers are always the ones to locate a Neteru and form the circle of protective guardians around him or her - and that\u0027s why during religious purges, seers are the first to be put to the stake. Kill the visionaries - the seers - and a slayer can be lost in the mix. But the Divine always knows where you are. The planetary alignment signaled when you will come into all your powers - three inner planets signaled three months from the alignment.\" Shabazz used his hands to speak, drawing out the constellation for Damali as he tried to get her to understand. \"One outer planet signaled the lesson that must be learned in one month - your birth month. The last large planet, Jupiter - a massive planet signaled a massive event soon to come. But it\u0027s also the planet of good luck.\" \"Then, let the chips ride on the big Jupiter bastard, then,\" Rider said, letting his breath out hard. \"Man!\" \"Rider, your mouth,\" Marlene warned, shaking her head. \"I know it\u0027s hard to change, but please. We are trying to school a Neteru.\" \"Sorry, Mar. Old habits die hard. Been cooped up for months; I have a slight verbal aggression issue.\" Rider chuckled as Marlene raised an eyebrow and Shabazz let his breath out slowly again. Damali couldn\u0027t focus on Rider\u0027s sidebar commentary. Instead, she just shook her head as she stared at the team. Too much had come at her too fast. Yeah, she knew there were these things called vamps. Yeah, she knew there was above and below ... a lot she\u0027d learned, but that was more abstract before, and today it was applied science - the mathematics of it, the planets, the physics, secret armies. The logic. Whew... \"How do you gays just know all this stuff?\" \"Unfortunately,\" Big Mike said with a weary sigh after a moment, \"we had to research it - some the easy way, some the hard way. Each one of us went through our own personal trial by fire. We each survived an attack, and were then led to another person like us, who had also survived an attack. Baby girl, you aren\u0027t the only one who grew up feeling weird as a kid.\" Mike glanced at the team and received nods of confirmation. \"Heck, when I was younger, I thought I was crazy. I could hear things nobody else could hear. Scared the heebee-jeebies out of me, most times. So, I didn\u0027t tell nobody, never. It was my secret, until one day something rolled up on me and I had to deal with it.\" \"Word,\" Shabazz muttered. \"I could be out in the hood playing B-ball, and brush up on somebody, and feel when they were gonna die. Or give an aunt a hug and know her time was limited. We\u0027ve all been there, Damali. Everybody\u0027s had their own private wake-up call. We all have a long story, and we wanted you to have as much time being a kid as you could.\" \"Yeah,\" Big Mike agreed. \"We didn\u0027t find you until we were readied, either. You had to be in a place in your head where you were ready to be found, had seen enough stuff on your own to accept protection - -just like we all had to.\" \"Right,\" Jose agreed. \"And we all had to be ready ... it took us time, too, to learn to accept the cosmic laws of reciprocity. We would teach you and be taught by you. We will hunt and be hunted. We will guard you and be guarded by you. We will defend you and also sustain attacks from the vamps. Whatever we all do follows the natural and supernatural laws of energy exchange, Damali.\" Jose labored as he spoke, and his body slumped from the mere exertion of his statement. \"Here on Earth is the gray zone; it\u0027s both light and dark here,\" Marlene said as everyone nodded. \"In this war, the good and the bad pull from the casualties of that war - the choice border, Earth. That\u0027s what we defend.\" \"Last night, your metabolism changed,\" Shabazz said in a matter-of-fact tone. \"Second sight, olfactory and taste awareness, tactical sensing, increased audio capacity strength. When the seventh one hits ...\" Damali kept Shabazz\u0027s gaze trapped with her own as his voice trailed off. So much had come to her at once that she could no longer get inside the group\u0027s heads. Part of her didn\u0027t want to. Before today, she\u0027d never mentally probed them - but it had been a reflex when it happened this time. But now it was almost as though they\u0027d thrown up a mental barrier to her thoughts, and when she looked at Marlene, all she saw was blackness. Why would Marlene block her that hard now? \"What\u0027s the seventh?\" Thoughts, emotions, and an ache so deep that she couldn\u0027t move, battered her - her heart hurt. She just stared at the people around her, listening, trying to make sense of the insane. But they were forcing her to grow up overnight and fast-forwarding her awareness. The shift in tempo of the group was dizzying. \"Later,\" Shabazz said, shaking his head. \"Marlene will go over that one-on-one. We need to look at the map.\" Shabazz went to the weapons table and gave Damah his back to consider. \"Our people are going down, as are Blood Music\u0027s and Carlos\u0027s - forming a triangulation of activity between here, Carlos\u0027s hub, and New Orleans where the bullshit began.\" \"The vamps have eyes everywhere - normal joes who do their bidding ... think this big worldwide concert has anything to do with it?\" J.L. fired up one of his computers, and clicked on the attached projector, shining a map of the world on the wall whiteboard. Using a laser pen, he drew a line between the five selected continents, marking the cities where the concerts were to be held. \"It looks like a giant pentagram. Anybody want to bet that the dark realm has claimed all the space between the points as the place where their major attack will be mounted?\" Marlene sent a glare so sharp and with such warning embedded in it toward J.L. that he looked away. If Damali didn\u0027t know better, she would have sworn Marlene wanted to cut the man\u0027s tongue out. Deep. Later, like Shabazz said. However, this time when the group fell silent, the quiet horror they shared was audible. No words were needed. \"We\u0027ve been following the attacks happening to Blood in the papers, just like we\u0027ve been following what\u0027s up at Carlos\u0027s joint. We can probably rule out that his performers are vampires, because to perform, they have to cast an image,\" Jose rasped, countering Marlene\u0027s glare as the group\u0027s peacemaker. Despite his weakened condition he appeared to be desperately trying to restore civility. \"Their artists are doing music videos, interviews, traveling on planes during the day, whatever.\" \"Have you seen \u0027em lately?\" Big Mike argued. \"They look like walking death, too. Might drop and turn any minute. Never can tell, if this old master vamp, Fallon Nuit, runs Blood Music.\" Shabazz shook his head. \"Vampires have normal business operations to keep them rolling in capital. They don\u0027t feed on everything around them; that would be stupid - and the last thing vampires are is stupid. The only reason this world concert made us sit up and pay attention is because J.L. showed the team that the locations formed a pentagram. That part is not a coincidence. So what if their artists look like hell? Plenty of goths look like death warmed over, too.\" \"Drugs will do that to you,\" Rider said with a sigh. \"We can\u0027t go staking what we think are negative artists on a hummer - even if they can\u0027t play a lick of music and their act reeks. I believe cops will call that Murder One.\" Rider made little quotes around the word \"negative\" as he glanced from Big Mike to Damali. \"No,\" Rider added in slow contemplation. \"If they\u0027re casting an image, they aren\u0027t a part of the equation - except as possible master vamp helpers. Hell, we\u0027ve had presidents that were surrounded, and they were even guarded by Secret Service from a master vamp\u0027s groupies. Every part of the world has had a leader that was either surrounded, or compromised, at one juncture or another. A coupla hot music artists doesn\u0027t stress me. Vamp traitors gotta make money, too. That\u0027s part of the deal - your soul for millions, power, and fame. Basic. Once the deal is made, a human is marked for that master vamp. However, vamps don\u0027t generally do their marked human helpers ... so it might be safe to say that wherever bodies are dropping might just be happy hunting grounds.\" \"No, listen,\" Damali said, finding her voice as she approached the map. \"Didn\u0027t you all say they stake out territory like wolves and fight if lines are crossed? Well, this concert is being simulcast - which means that they had to form an alliance across competing vampire borders. If what you\u0027re telling me is true, they\u0027re not supposed to do that, right?\" She glanced around and then wiped the perspiration from her brow. \"Either there\u0027s been a weird alliance, or one master vampire has taken out a lot of competition to be able to cross vamp borders worldwide.\" \"Li\u0027l sis has got an excellent point,\" Rider conceded, finding a stool and sitting down again. \"Damn. Maybe the bodies dropping had to do with some war we didn\u0027t see coming, some subsurface event that was hiding in plain sight - just like this slayer is. What if that\u0027s why the killings were all so brutal, and not the normal, smooth, two-hole bite? Ever think of that? A vampire version of a drive-by, maybe?\" \"We\u0027re still not sure it\u0027s pure vamps, though. What about what Marlene said earlier about that revenge demon?\" Damali shot her attention to Marlene, who remained silent. \"Let\u0027s not jump to conclusions, though. Like Carlos\u0027s shop and ours,\" Shabazz interjected, \"the Blood Music team is probably just a feeding ground for a line - grazing lands.\" He shook his head as he walked away from the board, kicking a metal stool out of his path. \"Yeah, but Shabazz,\" Damali argued, \"the concert is worldwide. That\u0027s a lot of territory. It would be different if only artists from L.A. or New York or whatever had dropped. Think about it. They\u0027ve had to cross their lines. Kids have been dropping after all of these concerts in the last few months. Now they\u0027re linking those cities with one label doing a megashow? Uh-uh. Something ain\u0027t right.\" \"The Blood Music label draws kids from all walks of life - lost souls, and seducing good souls, too.\" Shabazz leaned over, his fingers tracing and retracing the steps. \"Anybody without a strong spirit is susceptible to the negative vibrations and can be hypnotized by the violence in the music. It\u0027s real easy when the concertgoers are in altered states, partying under the influence of drugs... like in the clubs. Shit happens, nobody finds out why, or really cares. They\u0027re just teenagers going down from drugs and violence. Parents grieve. Whatever. Concerts get shut down for a little while, just like a club that has had an incident and then reopens in a matter of weeks. Authorities can\u0027t shut down a venue if some junkie kicks off there - and it wasn\u0027t the organizer\u0027s fault.\" \"It\u0027s a perfect cover for a vamp operation,\" Rider admitted. \"Right out in the open, like I said.\" \"You\u0027re right, though,\" Shabazz finally conceded, turning toward Damali. \"The artists that have died were all linked to the same company by contracts, but they haven\u0027t just been dropping in L.A. How our people, and an unrelated club network that Carlos runs, fits into that is the thing that\u0027s nagging me. We have to find the epicenter of activity. Something big is definitely going down.\" Jose\u0027s frail voice held the group enthralled. \"So, if it was just feeding grounds the vamps were after, Blood Music\u0027s regular concerts gives them plenty of opportunities to eat. Why are they turning our people, and possibly Carlos\u0027s people? If vampires want to eliminate a threat, they can easily just kill it, then feed off of it. But if they\u0027re increasing their ranks, then Damali has a point. Something\u0027s up.\" Rider nodded with Marlene. \"Yeah. Who knows? Maybe they only went after us because they thought we\u0027d get in the way of their ability to feed when the Raise the Dead simulcast concerts go down. I have no idea why they went after Rivera\u0027s posse.\" \"But,\" Jose argued, \"ours and Carlos\u0027s are turning.\" \"If they\u0027re turning, and building in numbers, then they could be getting ready for a vamp war. I think this goes way beyond feeding grounds.\"","sourceLink":"https://allnovel.net/minion-vampire-huntress-legend-1/page-13.html","bookId":2525,"book":{"id":2525,"title":"Minion (Vampire Huntress Legend #1)","description":"Storyline: Minion (Vampire Huntress Legend #1) There is one woman who is all that stands between us and the eternal night. Here is an account of her legend... Minion All Damali Richards ever wanted to do was create music and bring it to the people. Now she is a spoken word artist and the top act for Warriors of Light Records. But come nightfall, she hunts vampires and demons - predators that people tend to dismiss as myth or fantasy. Damali and her Guardian team cannot afford such delusions, especially now, when a group of rogue vampires has been killing the artists of Warriors of Light and their rival, Blood Music. When strange attacks erupt within the club drug-trafficking network and draw the attention of the police, Damali realizes these killings are a bit out of the ordinary, even for vampires. Instead of neat puncture marks in the neck showing where the blood has been drained from the body, these corpses are mutilated beyond recognition, indicating a blood lust and thirst for destruction that surpasses any Damali has encountered before. Soon she discovers that behind these brutal murders is the most powerful vampire Damali has ever met - a seductive beast who is coming for her next...","cover":"https://allnovel.net/images/minion-vampire-huntress-legend-1.jpg","author":"L.A. Banks","type":"Horror","source":"allnovel","link":"https://allnovel.net/minion-vampire-huntress-legend-1.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:35:20 PM"}}
