{"id":79159,"no":2,"title":"Page 2","content":"Octavia had returned to Portland on only one other occasion after that, and her stay had been extremely brief. He had asked her out for the third time, but she had told him that she was there to oversee a reception for one of the artists who showed in her gallery and had no time to socialize. The following morning she had flitted back to Eclipse Bay.\\n\\n It had become obvious that she was not going to return to Portland any time soon. That had left him a limited number of options.\\n\\n Two weeks ago he had made the decision to spend the summer in Eclipse Bay with Carson. But proximity was only making Octavia more inventive when it came to excuses for turning down dates.\\n\\n The thing that should really concern him, he thought, was that he was working even harder to come up with reasons to call her one more time.\\n\\n As far as he could tell, she did not have a complete aversion to men. She had been seen having dinner with Jeremy Seaton twice this past week.\\n\\n Jeremy was the grandson of Edith Seaton, owner of an antiques shop located next door to Bright Visions Gallery. The Seatons had roots in the community that went back as far as those of the Hartes and the Madisons. Although Edith\u0027s husband, Phil, had died several years ago, she continued to take an active role in local affairs. Her son and daughter had moved away, but Jeremy had recently returned to take a position as an analyst at the Eclipse Bay Policy Studies Institute. The social and political think tank was one of Eclipse Bay\u0027s few claims to sophistication.\\n\\n He knew Jeremy very well from the old days. They were the same age and they had been good friends at one time. But things had changed a couple of years ago. Women sometimes had that effect on a friendship.\\n\\n He looked at Carson. \"Miss Brightwell obviously doesn\u0027t think highly of me, but it\u0027s pretty clear that she likes you.\"\\n\\n \"I know she likes me,\" Carson said with exaggerated patience. \"That\u0027s because I bring her coffee and a muffin every morning when we go into town to get the mail. But she might change her mind if you make her mad.\"\\n\\n The sad fact was that Carson had made a lot more headway with Octavia than he had, Nick realized. His son adored the Fairy Queen of Eclipse Bay. For her part, she seemed to be very fond of Carson. The two of them had developed a relationship that somehow completely excluded him, Nick thought. It was frustrating.\\n\\n \"Don\u0027t worry,\" he said. \"She\u0027s not the type to hold a grudge against you just because she doesn\u0027t want to go out with me.\"\\n\\n He was pretty sure that was the truth. Octavia was a great mystery to him in many ways, but when it came to this aspect of her personality, he felt very sure of himself. She would never hold the sins of the father, whatever they might be, against the son.\\n\\n Carson remained dubious. \"Promise me you won\u0027t ask her out again until after she chooses one of my pictures.\"\\n\\n \"Okay, okay, I won\u0027t call her again until she makes her selection.\"\\n\\n That was a safe promise. He figured it would be at least another three or four days before he could fortify himself to make a seventh phone call.\\n\\n \"Let\u0027s see your pictures,\" he said.\\n\\n \"They\u0027re in the bedroom.\" Carson whipped around and dashed off down the hall.\\n\\n Nick followed him around the corner and into the downstairs room that his sister Lillian had turned into a temporary studio a few months earlier.\\n\\n Three large squares of heavy drawing paper were arranged in a row on the hardwood floor. The pictures were all done in crayon, per the rules of the exhibition.\\n\\n Nick went to stand looking down at the first picture. The scene showed a house with two stick figures standing very close together inside. The taller of the two figures had one arm extended protectively over the head of the smaller figure. A yellow sun shone brightly above the peaked roof.\\n\\n There was a green flower with several petals in the right-hand corner.\\n\\n \"That\u0027s you and me,\" Carson said proudly. He indicated the stick figures. \"You\u0027re the big one.\"\\n\\n Nick nodded. \"Nice colors.\" He moved on to the next drawing and pondered it for a moment. At first all he could make out was a vague oval shape done in gray crayon. There were several jagged lines around the outside of the oval. He was baffled until he noticed the two pointy projections on top. Dog ears.\\n\\n \"This is Winston, I take it?\" he said.\\n\\n \"Yeah. I had a little trouble with his nose. Dog noses are hard.\"\\n\\n \"Good job on the ears.\"\\n\\n \"Thanks.\"\\n\\n Nick studied the third picture, a scene of five brown, elongated shapes thrusting out of a blue crayon circle. \"The rocks in Dead Hand Cove?\"\\n\\n \"Uh-huh.\" Carson frowned. \"Aunt Lillian said it would make a good picture, but I dunno. Kind of boring. I like the other two better. Which one do you think I should give to Miss Brightwell?\"\\n\\n \"That\u0027s a tough question. I like them all.\"\\n\\n \"I could ask Aunt Lillian. She\u0027s a real artist.\"\\n\\n \"She and Gabe are stuck in Portland for a while because Gabe is tied up with Dad and Sullivan while they hammer out the plans for the merger. You\u0027ll have to make the choice without her advice.\"\\n\\n Carson studied the two pictures with a troubled expression. \"Huh.\"\\n\\n \"I\u0027ve got an idea,\" Nick said smoothly. \"Why don\u0027t you take all three pictures with you tomorrow when we go into town? You can show them to Octavia when you take her the coffee and muffin. She can choose the one she likes best.\"\\n\\n \"Okay.\" Carson brightened immediately, clearly pleased by that suggestion. \"I\u0027ll bet she goes for Winston. She likes him.\"\\n\\n Not yet six and the kid was already displaying an intuitive understanding of the client, Nick thought. Carson was a natural for the business world. Unlike himself.\\n\\n He had hated the corporate environment. His decision to leave Harte Investments, the company his grandfather, Sullivan, had founded and that his father, Hamilton, had taken over had not gone down well. Although his father had understood and supported him, his grandfather had been hurt and furious at the time. He had seen Nick\u0027s refusal to follow in his footsteps as a betrayal of everything he had worked so hard to achieve.\\n\\n He and Sullivan had managed a rapprochement eventually, thanks to the intervention of everyone else in the family. They were back on speaking terms at any rate. But deep down, Nick was not certain that Sullivan would ever entirely forgive him.\\n\\n He did not really blame his grandfather. Sullivan had poured his blood and sweat into building Harte Investments. He had envisioned the firm descending through generation after generation of Hartes. The company had been a personal triumph for him, a phoenix rising from the ashes after the destruction of Harte-Madison, the commercial real estate development business he had founded with his former partner, Mitchell Madison, here in Eclipse Bay. \\n\\n","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-2.html","bookId":1793,"book":{"id":1793,"title":"Summer in Eclipse Bay (Eclipse Bay #3)","description":"Storyline: Word gets around fast in Eclipse Bay. Nick Harte should know - his family\u0027s legendary feud with the Madisons fueled the local gossip mill for years before finally cooling off. But people are still talking - and rumor has it Nick\u0027s involved with someone new... Art gallery owner Octavia Brightwell doesn\u0027t take chances - especially on handsome, charming men. But that\u0027s only part of the reason why she turned Nick down six times before - finally - agreeing to a date. Octavia\u0027s related to the woman who sparked the long-time family feud - and fears that falling hard for Nick would only ignite the flames again. Octavia knows her family\u0027s past is best kept hidden. But her secret isn\u0027t safe in Eclipse Bay - and neither is her heart...\\n","cover":"https://allnovel.net/images/summer-in-eclipse-bay-eclipse-bay-3.jpg","author":"Jayne Ann Krentz","type":"Romance","source":"allnovel","link":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:12:36 PM"}}
