{"id":80493,"no":16,"title":"Page 16","content":"“Your big ass truck is blocking me in,” he says, slapping Josh on the back. “Sorry, Mom.” He turns, looking halfway contrite about his language. I’ve heard a lot worse than that out of his mouth. I wonder if he thinks his mother is even remotely fooled, because I’m betting she knows his act pretty well.\\n\\n “Book club,” she taunts, holding up her hand as if balancing a tray.\\n\\n “Noted,” he responds, shifting his attention back to Josh. “Can you please move your truck so I can take Nastya home?” he begs with sarcasm.\\n\\n “Didn’t you say she lives in Josh’s neighborhood?” Mrs. Leighton asks. I think I actually hear her loading the bullets into that question.\\n\\n Oh no. No, no, no, no, no, no, no. Please no.\\n\\n “Josh, can you drop her off? It’s silly for you both to go in the same direction when Josh is going there anyway.” She seems to look at all of us at once. How does she do that? We aren’t even standing next to one other. It’s more than unnerving.\\n\\n Between Josh and I, I don’t know which one of us looks the most horrified. We’re both on equal ground with this one. Josh nods in resignation and I try to look like I think this is a good plan. A good, logical, practical, not-at-all-awkward plan.\\n\\n Drew and his parents walk us out to the driveway. Sarah never re-emerged after the phone call, which is fine with me. Josh unlocks the car with his remote and Drew opens the door for me while I try to figure out how high I have to hike my skirt up to step into the truck without tearing it. I really don’t want to end the evening by flashing my pink heart polka dot underwear at Drew’s dad. Once I manage to get in, Drew’s mom comes over to the passenger side. Thankfully I’m already up and seated so I don’t have to worry about being hugged again, but what comes next is almost worse.\\n\\n “Thank you for coming. It was so nice to meet you. We’ll see you next Sunday at six?” It’s a question without much question involved. She tilts her head sideways to look past me at Josh. “You can pick her up on your way, right?” She did it again. She’s good. I try to shake my head. I could write a note for this. This would be note-worthy. I look around frantically for a piece of paper but the truck is as barren as it was the first time I rode in it. Nothing. At this point I’m hoping Josh might save me, save us both. Maybe he has plans and will have to decline and I can nod in unison. No such luck.\\n\\n “No problem. Thanks for dinner, Mrs. Leighton, Mr. Leighton,” he nods at Drew’s father.\\n\\n “One day we’ll get you to call us Jack and Lexie,” he laughs, shaking his head as if he knows this will never happen. “Maybe when you’re thirty.”\\n\\n “Good night, Mr. Leighton,” Josh responds.\\n\\n Drew waves from the front porch, already on his cell phone, as Josh backs the truck down the long driveway. Ten minutes in a car with Josh Bennett feels much longer than ten minutes in a car with Drew. Drew fills all the silence without ever realizing that he’s doing it. Josh melts into the silence like he’s part of it. He doesn’t say a word on the way home until he pulls into Margot’s driveway for the third time now.\\n\\n “You can get out of it if you want, you know. But you should go. She likes you.”\\n\\n I nod and open the door to the truck. I can’t step down and reach the ground, and trying to jump in these shoes, no matter how short the distance, is not going to end with my ankles intact. I bend over and slide my left shoe off, followed by my right, and hop out onto the driveway, turning to shut the door.\\n\\n “You’re going to need better shoes if you want to get near the tools. Mr. Turner will never let you in the construction area in those things.” He shakes his head as if he can’t believe he’s telling me this. I think it might physically hurt him to talk to me. I don’t know what the right response to that is. I don’t think Mr. Turner is planning to let me near the tools no matter what shoes I’m wearing. I nod again and close the door.\\n\\n It’s almost ten at this point. Normally I would be throwing on sneakers and running clothes right about now. I’m torn in half between needing to run and knowing it can’t serve its whole purpose tonight. For the first time in two weeks, I’m not really sure I want to run. I think better when I’m moving and I have plenty to think about tonight, but that’s the problem. I don’t have a treadmill to run on here so I have to go out, but when I’m running outside, I have to fragment my mind. I have to keep part of it constantly, acutely aware of every sound, every echo, every movement going on around me. It makes it hard to figure out the things I need to figure out. It’s the same way I have to split my focus every time I’m around other people so I don’t accidentally respond to something or someone. It’s natural to want to talk and I have to remain constantly on alert so that I don’t slip. I thought it would get easier. It should have been harder when I first stopped. But it’s the opposite. When I first stopped I had absolutely nothing I wanted to say. I wasn’t tempted at all. Now, more and more, I find things I’m desperate to say. They constantly bombard my mind and I have to choke them back. It’s exhausting.\\n\\n I decide against braving the assault on my senses and I stay in. This whole night has been draining enough.\\n\\n CHAPTER 15\\n\\n Josh\\n\\n “Party at Kara’s Friday night. You in?”\\n\\n I look at Drew as if this is a rhetorical question. It should be.\\n\\n “At some point I’ll get you to come with me.” No you won’t. “Fine. I have a backup plan. And there she is.” I look up to see Nastya coming down the hall towards us. She’s still wearing those shoes. We’ll be starting to work soon and it’s true what I told her. Mr. Turner won’t let her near the workshop unless she’s got on decent shoes that will protect her feet. She obviously doesn’t care.\\n\\n “Shouldn’t I have been the backup plan?”\\n\\n “You probably shouldn’t be any plan, but I’ll break you eventually.”\\n\\n “You get her wasted again, she can throw up on your couch.”\\n\\n “Are you never going to get over that?”\\n\\n “No.” It’s true. I think the things I saw that night will haunt me forever.\\n\\n “Hey, Nastypants!” Drew picks up his pace and breaks away from me to reach Nastya just before she gets to the shop door. I half-expect the look she impales him with to kill him on contact. “What?” I hear him cajole her as I get closer. “It’s a term of endearment.” If this is his new tactic, I’m afraid for him. Before I can worry myself too much for his safety, her face subtly changes. I think she’s fighting it, but she loses, because she actually half smiles at him. Maybe it’s not even a smile. Her lips just barely turn up at the corners but on her face it stands out because of the rarity of it. I’d be disappointed that his crap is actually working on her but I don’t think it is. I think she’s amused. The smile is gone in seconds, and she walks into the room, leaving Drew in the hall just as I catch up. He didn’t even ask her about the party.\\n\\n “That worked out well for you.”\\n\\n “She didn’t hurt me,” he smiles, seemingly satisfied with the outcome.\\n\\n “She should.” Tierney Lowell is closing her locker across the hall and turning towards us. Really she’s turning towards Drew. I don’t know that she sees me at all. Her jeans are so tight that I wonder if they’re cutting off her circulation and she’s wearing a black bra under a white t-shirt that rides up above the waist to show just enough of her skin to tease. She’s got the body to pull it off and she isn’t shy about it. The two of them hooked up some time last year and the aftermath wasn’t particularly pretty. Tierney didn’t take too well to being discarded. That didn’t surprise me. What surprised me was the fact that it had happened in the first place. She’s hard-core and he’s Drew. It never added up to me. Drew never even told me that it had happened until after it got out, and by that time it was done. Drew was moving on to another girl; Tierney was pissed and people were talking about how clueless she was for being surprised. I don’t think she ever seemed surprised, just disappointed.\\n\\n Drew doesn’t respond to her and she walks away without another word.\\n\\n “That one was a mistake from the beginning,” he says. Most of them are mistakes if you ask me. The constant drama doesn’t seem worth the trouble. I head in to shop and Drew takes off toward the office where he gets to spend the next period running passes around the school, flirting in the halls and generally avoiding any responsibility whatsoever.\\n\\n Nastya is sitting next to Kevin Leonard at the table Mr. Turner moved her to a week ago. I’m glad she stayed there because it made me nervous having her behind me all the time. I like being able to watch everyone else without them watching me. Most people know better than to look at me anyway, but Nastya hasn’t been most people since the day she got here.\\n\\n When the bell rings, Mr. Turner does a visual roll check. Then he tells one person from each table to go up to the front and pick up a materials box. I’m the only one at my table so I head up. All of the other tables have two people, except for Nastya’s where there are three: Natsya, Kevin and Chris Jenkins. She doesn’t move to get up and Chris goes to get the box. Inside are several pieces of wood, a hammer, different size nails, sandpaper and a few other items which seem to vary in each box. Kevin grabs the box out of Chris’ hands and turns it over on the table. The box of nails opens when it hits the surface and they go rolling in every direction. This gets everyone’s attention but no one moves to pick them up.\\n\\n “Clean it up, Leonard,” Mr. Turner calls over to him, not seeming the least bit surprised with his idiocy. I know why Mr. Turner signed him in to this class. As much as I’d like to ignore the fact, Kevin’s pretty good when it comes to building. He doesn’t have much of a sense of artistry or style but he has an innate understanding of construction and balance. Too bad he’s such an ass**le.\\n\\n Nastya is kneeling down on the floor, picking up nails and loading them up in her left hand. Chris is gathering up the ones on the table and sweeping them back into the container. Kevin is laughing. Nastya has most of the nails off the floor and her hand is close to full. I think she’s about to stand back up and then the nails are all over the floor again. I’m not even sure what happened. It’s like she just let go of them. She doesn’t even seem surprised. She just starts picking them up again. I think I’m the only one who noticed. Nobody helps her. Not even me.\\n\\n Mr. Turner goes on to explain the assignment. We’ll have today, plus the next three periods, to design, plan, and construct something that’s either useful or aesthetically pleasing with whatever materials we find in the box we picked up. We are allowed to add up to two additional items of our choosing but nothing else. I’ve already studied what’s in mine and I know what I’m going to build. I spend the rest of the period measuring, sketching and planning while everyone else sits around arguing about whose idea is better and what they should make. Tomorrow I’ll start construction. The rest of them will probably still be fighting.\\n\\n I’ve spent the past hour going through every drawer of every tool cabinet in my garage and I still can’t figure out where I put my stud finder. I slam the bottom drawer on the last cabinet shut and look at the clock on the wall. Ten-thirty. Too late to go buy another one, not that I really need it tonight, but I have nothing else on my plate right now and it’s something to do.\\n\\n I stand back up and turn around, looking for something to occupy my time and she’s standing at the top of my driveway, just outside the threshold of my garage. I’m glad I don’t gasp or anything equally pathetic, because if I did, I’d probably have to cut off my balls and hand them to her. I wouldn’t deserve them anymore. \\n\\n","sourceLink":"https://allnovel.net/the-sea-of-tranquility/page-16.html","bookId":1857,"book":{"id":1857,"title":"The Sea of Tranquility","description":"Storyline: I live in a world without magic or miracles. A place where there are no clairvoyants or shapeshifters, no angels or superhuman boys to save you. A place where people die and music disintegrates and things suck. I am pressed so hard against the earth by the weight of reality that some days I wonder how I am still able to lift my feet to walk. \\n Former piano prodigy Nastya Kashnikov wants two things: to get through high school without anyone learning about her past and to make the boy who took everything from her—her identity, her spirit, her will to live—pay. \\n Josh Bennett’s story is no secret: every person he loves has been taken from his life until, at seventeen years old, there is no one left. Now all he wants is be left alone and people allow it because when your name is synonymous with death, everyone tends to give you your space. \\n Everyone except Nastya, the mysterious new girl at school who starts showing up and won’t go away until she’s insinuated herself into every aspect of his life. But the more he gets to know her, the more of an enigma she becomes. As their relationship intensifies and the unanswered questions begin to pile up, he starts to wonder if he will ever learn the secrets she’s been hiding—or if he even wants to. \\n The Sea of Tranquility is a rich, intense, and brilliantly imagined story about a lonely boy, an emotionally fragile girl, and the miracle of second chances.\\n","cover":"https://allnovel.net/images/the-sea-of-tranquility.jpg","author":"Katja Millay","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-sea-of-tranquility.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:26:06 PM"}}
