{"id":80501,"no":24,"title":"Page 24","content":"So now I’m here, on Josh Bennett’s couch at 3:15 in the afternoon, watching General Hospital. Josh spent the last commercial break patiently filling me in on as much of the past decade’s worth of storylines as he could in three and a half minutes while I ate as many Twizzlers as I could. When the commercials were over, he stopped abruptly and told me he’d tell me the rest during the next break. I don’t think I’ve spent much time actually watching the television. Mostly I’ve been looking at Josh and trying to figure out who the hell he is. I’ve developed a theory that, perhaps, Josh is really twins and there are two of him, because I’m convinced, from day to day, that he’s not the same person. It’s like that Christian Bale movie where the twin brothers share the same life and you never know which one you’re with. That’s how I feel with him. I crumple up the empty cellophane wrapper and walk into the kitchen. “Where’s your trash?” With as much time as I spend at this house, I never actually come inside. We pretty much live in the garage. “Under the sink,” he says, not looking away from the TV. “Do you ever eat anything other than sugar?” I mentally tally what I’ve eaten today: two protein bars, two bags of peanut M\u0026Ms (but they were the small bags so it’s really like eating only one), plus the recently consumed Twizzlers. “Sometimes,” I answer. Really, I wouldn’t even bother with the protein bars if I didn’t need them after working out. When I lived with my parents, we actually sat down and ate meals, real ones, like the way we eat at Drew’s on Sundays. Margot doesn’t cook, plus we always have to eat early so she can get to work and I’m usually not in the mood. Maybe when I’m eighty I’ll like eating dinner at four o’clock in the afternoon, but now, not so much. I sit back down on the couch next to him and we watch the rest of the show. By four o’clock I know more than I ever cared to know about Quartermaines and Spencers. I shouldn’t mock. While I was stuck recovering all those months, I watched my share of bad soap operas. And bad game shows. And bad talk shows. I was an expert in all things daytime television. I just didn’t watch General Hospital. After today, I know enough that I can pretend like I did. When it’s over, we climb into Josh’s truck so he can take me to buy a car battery. We have to stop back at the school parking lot on the way, because I know the make and model of my car but that’s the extent of my knowledge. Apparently that’s not enough information to tell me what kind of battery I need, so we have to detour back to campus. Josh looks at my car, writes something down and then takes my keys and pops the hood. I’m still holding onto my backpack with all my books, so I jump out to throw it in my car so I won’t have to keep carrying it. As soon as I do, I wish I wasn’t so lazy, because that’s when I see Tierney Lowell walking towards us in the parking lot. She’s not the only one. There are quite a few students exiting the building and I realize that it’s just after four and most of the practices and club meetings are finishing up. She’s the one I notice though, because for some reason she seems to hate me. OK, most of the girls don’t like me and I’m an easy target because of the clothes. I get that. But she shoots daggers at me like she just caught me feeding chocolate to her dog. Normally, that’s cool, because it’s all easily ignorable and I can avoid her without much effort. However, right now, I’m jumping out of Josh Bennett’s truck and he’s standing next to my car and in a minute we’ll be leaving together and that’s an act of exhibitionism I wasn’t planning to put on just yet. We get back in the truck immediately, with the shared, unspoken need to get out of there as quickly as possible. Once we’ve driven away, I look out the window, scanning the cars around us. Josh’s windows are tinted, but I still won’t take any chances. When I feel safe enough that we’re not being watched, I ask the question I’ve been holding onto since we left his house. “You watch General Hospital?” I don’t really need confirmation. I know for a fact that he watches it. He doesn’t look at me but I see his lips turn up in the half-smile he gets when he’s embarrassed about something, which is really just a real smile he’s trying to drown. “Yes,” he says. OK, he did answer my question, but what I really wanted to know was why or how or something that will explain it to me because come on. But if there’s anything more surprising to me than the newfound knowledge that he’s a closet soap opera addict, it’s the fact that he actually keeps talking and offers me an explanation; one I didn’t have to ask for. “My mom used to watch it. Religiously. Never missed an episode. My dad and I made fun of her all the time. When she died, I kept thinking that maybe she’d come back, and when she did, I wanted to be able to tell her everything that had happened so she wouldn’t have missed anything. So I watched it. Every day. After a while I realized she wasn’t coming back but I was pot vested by that point. I just never stopped.” He shrugs like he’s accepted this fact; only I’m not sure if it’s the fact that his mother isn’t coming back or that he watches General Hospital that he’s accepting. Maybe he’s not sure either. “How old were you?” “I was eight which I guess is old enough to get it. I just didn’t really want to… I don’t know… My dad tried to make it make sense for me, but there really isn’t a way to explain how a person you’ve seen every day of your life just isn’t anymore. Someone just hit delete and she’s gone. I had a hard time grasping that I could come home one night and find that the person who was laughing and hugging me that morning just stopped existing. I didn’t believe it was possible. I didn’t want to believe it was possible… so, yeah, General Hospital.” I didn’t look away from him once while he was telling that story. It’s the first real thing he’s ever told me. It makes me feel ashamed because I’ve never told him anything real. Not even my name. He turns and looks at me for a second with what is almost a look of apology on his face. Resignation, maybe? Then he shifts his attention back to the road and we pull into the mall parking lot a minute later. I have one of Josh Bennett’s secrets now. He gave it to me. I wish I could give it back. CHAPTER 23 Josh Whenever someone knocks on my door, there’s a part of me that still kind of expects them to be carrying some sort of food. In the days and weeks after my mom and my sister died, I got a crash course in grieving. I learned the way it works; some of it was about how I was expected to react, but most of it was about how other people were expected to react. I don’t think there’s a written set of rules, but there might as well be, because everyone seems to do the same things. A lot of it has to do with food. My grandmother explained the psychology of this to me at one point but I didn’t really listen because I didn’t really care. People must know that just because you need to eat doesn’t mean you want them coming by your house non-stop, using casserole dishes and coffee cakes as an excuse to eavesdrop on your grief. I was indoctrinated into all of the pointless condolence rituals at age eight and I came to realize that they never really change. I could always count on an onslaught of food and sympathy that I had no use for. Sometimes people will try to tell you some funny thing they remember, which usually isn’t funny at all, just sad. Then you stare at each other uncomfortably until they finally get up to leave, and you thank them for coming, even though they just made you feel worse. Then you get the people who just want an excuse to come by to see how ripped up your face looks from crying, see if you’ve cracked yet so they can talk about it with the neighbors. Did you see poor Mark Bennett and the boy? What a tragedy. It’s just so sad. Or something equally lame. But they brought you some food, so they’re entitled. Ten minutes later the doorbell rings again and we start all over. It goes on like this for days. Too many apologies and a crapload of food. Mostly lasagna. Maybe some people find comfort in obligatory words and reheatable food; my dad and I just weren’t those people. We thanked everybody anyway. Took their foil pans and condolences. Then we threw it all away and ordered pizza. I wonder if there is a person on Earth who is consoled by a casserole. Then I think about Leigh, and I know that, sometimes, someone shows up at your door offering something better than words and food. Sometimes, somebody brings you something you really need, and it’s not a f**king coffee cake. The first time I met Leigh, she was standing on my front porch, holding the tell-tale foil-covered dish. My grandmother had died two days earlier and at that point I had about six of them on my counter and a couple more in the refrigerator. I was fifteen, and I think I visibly exhaled with disgust at the sight of it. But not at the sight of her. She was wearing a really short green sundress and she was seriously hot. Those are the only real details I recall. I recognized her from school, but she was two grades ahead of me and we never spoke. I didn’t even know her name until that day. I took the dish from her, which was actually from her mom who knew my grandmother. I invited her in because I had learned that that’s what you were supposed to do. My grandfather wasn’t home so I did the grieving host thing. We went through the required conversation, making sure to hit all the main points and platitudes. After a few minutes of standing in the kitchen, vying for the title of most uncomfortable, she asked if anyone was home and if I wanted to go into my bedroom. I think it was her way of saying she was sorry and my way of saying thanks for the casserole. That was the first time Leigh came over. But it wasn’t the last. We never dated. Never hung out. She’d come over and sneak into my room at night or we’d end up in her car somewhere, but that was the extent of our involvement and it’s been the extent for close to three years now. Even now that she’s at college, we manage to keep up a regular schedule. Sometimes we talk but never about anything real. Maybe it was wrong. Maybe it is wrong. Wrong or not, I don’t feel bad about it. I was up to four deaths by the time she showed up, with only one more to go. I needed one normal thing and Leigh gave me that and it didn’t cost me any emotions or feelings or commitment. I didn’t have to love her. I like her, though I’m not sure if that would have been a deal-breaker, either. I don’t even think it mattered to her if I cared. We still employ a policy of equal-opportunity using, no questions asked. She’s sweet and laidback and good-looking as hell. But if she walked away tomorrow, I wouldn’t miss her. People disappear all the time. I might not even notice. It’s not a coffee cake Nastya’s carrying when she walks into my garage just after eight o’clock. Though if it was, I’m sure it would have been homemade, covered with cinnamon and unbelievably awesome. She is carrying two plastic grocery bags. She walks past me without a word and reaches up with one hand to awkwardly open the door to the inside of the house without letting go of the bag. “Sunshine?” She doesn’t respond, so I follow her in and find her opening the freezer and shoving no fewer than four half-gallon containers of ice cream into it. “What are you doing?” “What does it look like?” she snaps. “You get knocked up?” She whirls around on me. “What?” Guess not. I hold my hands up, palms out in surrender. She’s obviously not in the mood. “Sorry, just,” I motion toward the open freezer, her hand still inside on one of the containers, “a lot of ice cream.” “Right, because I’d have to be pregnant to want ice cream. Next thing you’ll be saying that I must have my period because that’s the only reason girls have for getting pissed, but of course since you’re a guy, you won’t actually say period, but something prickish like on the rag.” She slams the freezer door shut. Now might be the moment to swear profusely that I had no intention of bringing up her period in any manner, much less one containing the word rag, but I feel safer keeping my mouth shut right about now and letting her play this out.","sourceLink":"https://allnovel.net/the-sea-of-tranquility/page-24.html","bookId":1857,"book":{"id":1857,"title":"The Sea of Tranquility","description":"Storyline: I live in a world without magic or miracles. A place where there are no clairvoyants or shapeshifters, no angels or superhuman boys to save you. A place where people die and music disintegrates and things suck. I am pressed so hard against the earth by the weight of reality that some days I wonder how I am still able to lift my feet to walk. Former piano prodigy Nastya Kashnikov wants two things: to get through high school without anyone learning about her past and to make the boy who took everything from her—her identity, her spirit, her will to live—pay. Josh Bennett’s story is no secret: every person he loves has been taken from his life until, at seventeen years old, there is no one left. Now all he wants is be left alone and people allow it because when your name is synonymous with death, everyone tends to give you your space. Everyone except Nastya, the mysterious new girl at school who starts showing up and won’t go away until she’s insinuated herself into every aspect of his life. But the more he gets to know her, the more of an enigma she becomes. As their relationship intensifies and the unanswered questions begin to pile up, he starts to wonder if he will ever learn the secrets she’s been hiding—or if he even wants to. The Sea of Tranquility is a rich, intense, and brilliantly imagined story about a lonely boy, an emotionally fragile girl, and the miracle of second chances.","cover":"https://allnovel.net/images/the-sea-of-tranquility.jpg","author":"Katja Millay","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-sea-of-tranquility.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:26:06 PM"}}
