{"id":80502,"no":25,"title":"Page 25","content":"With any other girl I could probably pull out the classic guy fail-safe of walking over and wrapping my arms around her and letting her put her head on my shoulder. It’s cheap, but it works. Drew swears by it. But I’m afraid that in this particular instance it would result in one of two things: a string of innovative new expletives or her knee in my balls. My money’s on the knee.\\n\\n “I like ice cream. You never have any. Bad things happen when I go too long without ice cream,” she says, sounding slightly calmer.\\n\\n “Are you sure you got enough?”\\n\\n “Fuck off.”\\n\\n “Maybe you should open one of those now,” I suggest.\\n\\n So that’s what we do. Except that we don’t open one, we open all four of them and eat straight out of the containers at the crap coffee table in front of my couch. I keep this one in front of the couch because it’s shit and I don’t care what happens to it. I don’t have to worry about coasters or Drew putting his shoes on it. I figure I’ll keep it here until he leaves for college, or some girl finally kills him.\\n\\n Nastya doesn’t eat from the middle of the container like a normal person. A normal person who doesn’t eat ice cream out of a bowl, that is. She waits until it starts melting and scrapes away the melted part from around the edge of the container. According to her, half-melted ice cream tastes better than fully-frozen ice cream. I can’t tell if she’s right because she makes me eat the more frozen stuff from the center and threatens me if I try to eat from the edges. We put a pretty big dent in every one of those containers and she’s definitely more Sunshine and less Nasty afterward. I make a mental note for the next time she gets pissy that, in lieu of mood stabilizers, ice cream will do the trick.\\n\\n We’re both on a sugar high after all the ice cream and we end up back in the garage because I have a list of projects to finish. I figure she’s going to go running because that’s usually her M.O. when she’s carb-loaded, but she doesn’t leave.\\n\\n “Give me something to do,” she says, with just the barest hint of wariness.\\n\\n “What do you want to do?” I ask, assessing her.\\n\\n “Nothing with power tools or anything like that. Something I can do with my right hand.”\\n\\n “You want to sand?” I offer. “It sucks, but—”\\n\\n “I’ll sand. Just show me what to do.”\\n\\n I grab a sheet of sandpaper and demonstrate how to attach it to the sanding block.\\n\\n “We have to sand with the grain on this.” I pick up her hands to show her how much pressure to use and they’re so soft that I hate to put sandpaper anywhere near them.\\n\\n “How do I know when it’s done,” she asks, starting to work.\\n\\n “My dad’s rule was always that when you think you’re done, you’re probably halfway there.”\\n\\n She tilts her head and looks at me like I’m useless. “So, how do I know when it’s done?”\\n\\n I smile. “Just show it to me when you think it’s ready. You’ll start to know after you’ve done it a few times.”\\n\\n She keeps her eyes on me for just a second longer than she needs to before turning back to the wood. I know the questions are there. I saw them in her eyes as soon as I mentioned my father. How? When? What happened? But she doesn’t ask. She just keeps sanding and I won’t stop her. I despise sanding.\\n\\n It’s after midnight by the time we call it quits. I don’t know how her hands even held up this long. She sanded the hell out of everything I gave her. I never did ask her what was wrong earlier.\\n\\n CHAPTER 24\\n\\n Nastya\\n\\n When I get to his house at 7:40, Josh is in his driveway, leaning against the side of his truck. As soon as he sees me, he unlocks the doors and comes around to open mine.\\n\\n “About time, Sunshine,” he says. “I was about to give up on you.”\\n\\n “I didn’t know you had a field trip planned,” I reply once I’ve settled into the truck and shut the door.\\n\\n “I have to get to Home Depot before they close.”\\n\\n “You didn’t have to wait for me.” He really didn’t. It’s not like I was going to be sad to miss the weekly hardware store stock-up.\\n\\n “No. But I knew you’d be showing up sooner or later and my garage would be closed and you’d feel abandoned and then I’d feel guilty and I hate feeling guilty. So it was just easier to wait.” One side of his mouth turns up.\\n\\n “Your life is so hard,” I say dryly.\\n\\n “You are the only person who would even think to say something like that to me.” He sounds weirdly pleased.\\n\\n “Force field hasn’t kept me out yet.”\\n\\n “What’s that supposed to mean?”\\n\\n I give him a pointed look because I’m sure he can figure it out. He keeps staring at me, so finally I shrug and then throw in a sigh so he knows that I’m exasperated at having to explain this to him.\\n\\n “At school, no one comes near you. When I first saw you on the bench in the courtyard, I wondered if you were surrounded by some sort of force field. I kind of wanted to get one for myself. You can hide in plain sight. It’s pretty awesome.”\\n\\n “Force field,” he repeats, somewhat amused. “Might as well be. People used to call it the dead zone,” he adds, but he doesn’t elaborate. “Maybe you have special powers.” I assume he’s commenting on my ability to breach his force field, but I don’t respond.\\n\\n I don’t have any special powers. I’m certain of that, because I’ve spent a lot of time lamenting my lack of them. I do have an uncanny capacity for bitterness and misdirected rage but I don’t think that counts. I feel a little misled. I spent crapload of time over the past couple years reading books and watching movies, and in all of them, when you die and they bring you back to life, supernatural abilities are just part of the deal. Sorry you didn’t win the grand prize of eternal peace, but you’re not walking away empty handed! You may come back broken and wrong, but at least you get some cosmic consolation prize, like the ability to read minds or speak to the dead or smell lies. Something cool like that. I can’t even manipulate the elements.\\n\\n Of course if I were to take the books at their word, I’d also have to believe that all teenage boys go around calling girls baby, because apparently that’s the express train to romance. He was an ass**le a minute ago but then he drops the baby on you and it’s all over. Uncontrollable swooning and relinquishment of all self-respect activated. Ooooh, he called me baby. My panties are wet and I luuuuuuuv him. Do real boys actually call girls baby? I don’t have enough experience to know. I do know that if a guy ever called me baby, I’d probably laugh in his face. Or choke him.\\n\\n I follow Josh down another aisle. He’s almost as comfortable here as he is in his garage. It’s like he’s being pulled around by an invisible string that leads him to everything he’s looking for. He’s on autopilot, not even thinking. He must spend half his life in this store.\\n\\n “I’ll get the wood next time,” he says. “I don’t feel like dealing with it tonight. Plus, I think we’re going to have to hit the lumber yard for what I need anyway.” The we’re part of that sentence sticks in my head.\\n\\n “What are you making?” I ask, glancing down the aisle to make sure it’s empty before speaking.\\n\\n “I have a job for one of the teachers at school. Then I have two Adirondack chairs to make.”\\n\\n “You sell everything you build?”\\n\\n “Some of it I give away. Some of it I sell. It’s how I pay for the wood and the tools.”\\n\\n “Is that why you haven’t applied to college?”\\n\\n “Huh?” he says, putting two more cans of finish in the cart.\\n\\n “I heard Mrs. Leighton talking to you. You haven’t applied yet. You don’t want to go?”\\n\\n “I never really got into the whole school thing.”\\n\\n “Did your parents want you to go?”\\n\\n “I don’t know. We never really got that far.”\\n\\n “So what are you going to do?”\\n\\n “Probably the same thing I’m doing now. Just more of it.”\\n\\n I get that. I used to think the exact same way, but he can actually do it.\\n\\n “You can afford that?” I ask. We’re in front of a display of little drawers full of every size screw you can imagine and he’s pulling them out without even looking.\\n\\n “I can afford just about anything I’m willing to pay for.” I’m not sure exactly what he means by that, but the way he says it is bitter, and if there’s something that makes him sound that way, I don’t want to get into it.\\n\\n We get up to the self-checkout and I start taking things out of the cart and handing them to him one at a time as he runs them over the scanner. It strikes me how utterly domestic this all seems. He could have come without me because I really haven’t served any purpose here at all. I could have used the time to run which is probably what I should have been doing. It’s what I would have done if I had shown up at his house and he wasn’t there. I would have run myself into exhaustion. He’s right about one thing and I wonder if he knew just how right he was and if that’s why he waited. If I had gotten to his house and seen that closed garage, I would have felt abandoned and I may never have gone back.\\n\\n When we get back to his house just after nine o’clock, I help him carry the bags into the garage and watch him put everything away. He is all grace and fluid in this place; there isn’t one wasted movement. Everything he does has purpose. I don’t feel uncomfortable about watching. He watches me, too. We have an unspoken agreement. I let him watch me. He lets me watch him. We never call each other on it. It’s a gift we give one another. No strings, no expectations, no reading between the lines. We’re like mysteries to one another. Maybe if I can solve him and he can solve me, we can explain each other. Maybe that’s what I need. Someone to explain me.\\n\\n When everything has been put away, he closes the garage door and goes into the house, waiting for me to follow before he shuts the door.\\n\\n “Did you eat?” he asks.\\n\\n “Yeah, before I came over. You?”\\n\\n “Yeah. I would have heated you up something if you were hungry. So, you actually cooked tonight?” He regards me skeptically.\\n\\n I snort. Because snorting is attractive. “No.”\\n\\n “What’d you eat for dinner?”\\n\\n “Peanut butter cookies.”\\n\\n “I don’t need to ask if you’re serious, do I? I don’t know how you exercise so much with the way you eat.”\\n\\n “Peanut butter has protein in it,” I say, full of false indignation. “Besides, I was messing with the recipe. I had to eat a bunch of them to see when I got it right.”\\n\\n “Did you?” he asks, pulling a bottle of water out of the refrigerator and drinking half of it before handing it to me.\\n\\n “I don’t know. I’ll bring you some and you can tell me.”\\n\\n “I’ll eat your cookies, but you let me feed you real food first.”\\n\\n “You’re going to cook for me?” I almost choke on the water before passing the bottle back.\\n\\n “I cook anyway. What’s the difference if you’re here?”\\n\\n “Don’t put yourself out.”\\n\\n “I won’t.” He smiles as I walk around the counter and pick up the mp3 player that’s sitting next to the phone.\\n\\n “What are you listening to?” I ask, turning it on.\\n\\n “Nothing. I took it out for you. It just sits here. I thought you might want to use it when you run.”\\n\\n Oh. I flip it off without looking and put it back down. “That’s okay. I don’t need one, but thanks.”\\n\\n “How come? You’re the only person I’ve ever seen running without music. Doesn’t it get boring?” he asks. It’s a valid question, but it doesn’t get boring. It’s never quiet enough to get boring and I certainly don’t plan to stick shit in my ears like a written invitation for someone to jump me. I shrug, pushing it back further on the counter and turning away. \\n\\n","sourceLink":"https://allnovel.net/the-sea-of-tranquility/page-25.html","bookId":1857,"book":{"id":1857,"title":"The Sea of Tranquility","description":"Storyline: I live in a world without magic or miracles. A place where there are no clairvoyants or shapeshifters, no angels or superhuman boys to save you. A place where people die and music disintegrates and things suck. I am pressed so hard against the earth by the weight of reality that some days I wonder how I am still able to lift my feet to walk. \\n Former piano prodigy Nastya Kashnikov wants two things: to get through high school without anyone learning about her past and to make the boy who took everything from her—her identity, her spirit, her will to live—pay. \\n Josh Bennett’s story is no secret: every person he loves has been taken from his life until, at seventeen years old, there is no one left. Now all he wants is be left alone and people allow it because when your name is synonymous with death, everyone tends to give you your space. \\n Everyone except Nastya, the mysterious new girl at school who starts showing up and won’t go away until she’s insinuated herself into every aspect of his life. But the more he gets to know her, the more of an enigma she becomes. As their relationship intensifies and the unanswered questions begin to pile up, he starts to wonder if he will ever learn the secrets she’s been hiding—or if he even wants to. \\n The Sea of Tranquility is a rich, intense, and brilliantly imagined story about a lonely boy, an emotionally fragile girl, and the miracle of second chances.\\n","cover":"https://allnovel.net/images/the-sea-of-tranquility.jpg","author":"Katja Millay","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-sea-of-tranquility.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:26:06 PM"}}
