{"id":80529,"no":52,"title":"Page 52","content":"“Someone still needs to answer the question at hand.” Ms. McAllister passes off the slips and returns to the front of the room.\\n\\n Even if I wasn’t watching the class, I would have been able to hear the collective turning of every head in the room when Josh’s hand went up. Even Ms. McAllister looks like she doesn’t quite know what to make of it.\\n\\n “Josh?” she says tentatively.\\n\\n He doesn’t speak for a second, looking pained, like he already regrets drawing the attention.\\n\\n “It’s about the dream of second chances,” he says finally. He hasn’t raised his eyes from the paper on his desk and I feel him looking at me without looking when he uses his grandfather’s words. “The narrator doesn’t respect the beauty of life and the world around her, so it crushes her into the ground and once she’s dead, she realizes everything she took for granted and didn’t see right in front of her while she was alive. She’s begging for another chance to live again so she can appreciate it this time.”\\n\\n I’ve turned away from Josh to look at Ms. McAllister. She’s watching him with an expression of pride and endearment which reminds me of the way I’ve seen Mrs. Leighton look at him. But I don’t think Ms. McAllister’s expression is as much about his answer as it is about the fact that he answered in the first place.\\n\\n “And does she get that chance?” she asks Josh while I desperately focus on the poster of literary terms on the wall and wait for absolution. When it comes, I barely hear it.\\n\\n “She does.”\\n\\n Josh\\n\\n It’s Wednesday before I see her again outside of school, and even there she hardly looks at me. Nothing has really changed except that, before last weekend, I felt more like a victim in all of this and, now, not so much.\\n\\n It’s already eleven. I’ve been in my garage for hours, but I haven’t done much of anything. I reorganized the same tool chest twice and now I’m sweeping up sawdust. I don’t have the energy to do anything worthwhile, but I have a list that’s just getting longer and I have to get started at some point. I’ve had more time over the last six weeks than I’ve had in months, and I haven’t accomplished crap.\\n\\n I go inside, make another cup of coffee and carry it back out, resolving to start the initial cutting for the matching end table I promised I’d make Mrs. Leighton. And maybe I’m more tired than I thought, because when I open the door, the first thing I see is a set of pale white legs capped with black steel-toed boots swinging from the workbench.\\n\\n “You know you’re an addict. Caffeine’s a bitch to break.”\\n\\n “Guess I won’t break it then.”\\n\\n She nods and I want to ask her why she’s here but I’m glad she is, and for a few minutes, I want to pretend that everything is back to the way it used to be. Maybe that’s what she wants, too.\\n\\n “It’ll stunt your growth, you know.”\\n\\n “Didn’t know you were worried.”\\n\\n “Only about some parts,” she smirks.\\n\\n I smile for a minute, but it’s weak, and I realize that I don’t want to joke with her. Especially not like that. It makes me think of everything that happened that night and everything that’s gone wrong since, and as much as I want to pretend everything is the way it was before, I’m just not a good enough liar.\\n\\n “Helps keep me awake,” I answer, not taking the bait.\\n\\n “Why not just sleep?”\\n\\n “Haven’t been sleeping well,” I say honestly.\\n\\n “Maybe that’s because of the caffeine. Vicious cycle.”\\n\\n “You don’t drink it. Do you sleep well?”\\n\\n “Point taken,” she says faintly.\\n\\n “Thank you.” This conversation is so civilized, it’s twisted.\\n\\n She hops off the counter and walks over to me. The bruise on her face has faded, but it’s not covered with make-up now, like it is at school, and I can still see it. I have to fight the urge to run my fingers over it and then run to Kevin Leonard’s house and give him four more just like it.\\n\\n “Here. Let me try it again.” She reaches for the cup in my hand.\\n\\n “If you’re going to try it, you should at least put some shit in it first.”\\n\\n “Sounds appetizing.”\\n\\n “I drink it black. You won’t. Your taste buds are opposed to anything that isn’t sweet.”\\n\\n “Give it, jackass.” I let go of the cup and she takes a mouthful while I watch her face contort at the bitterness. “Still gross.”\\n\\n “You get used to it,” I shrug, taking the coffee back from her. She relinquishes it and shudders as if she’s trying to expel the taste from her mouth. I have to try not to smile.\\n\\n “I’d rather not.” She scrunches up her nose and goes back to sitting on the counter. Her legs start swinging again and I know how easy it would be to stay in this place and forget everything that’s happened. But we’ll always end up back where we were, because nothing’s been resolved, and I’m not the one with the answers. Maybe, for once, I need to stop letting her dictate everything just because I want to keep her. I can’t forget what she did and I can’t expect her to forgive what I did and I don’t know where we go from here.\\n\\n “It’s not the same,” I say, watching her write her name in the dust on the counter next to her. “We can’t act like nothing happened… just pretend that it’s all good.”\\n\\n “I know it isn’t,” she says, lifting her eyes to mine with something I might actually believe is hope, “but, maybe.”\\n\\n She ends up staying for the next two hours. She measures and marks the wood for me and I cut. We don’t talk about us or Kevin Leonard or Leigh or lost hands or lost people or long agos. We talk about furniture and tools and recipes and art competitions and debate. It’s familiar and comfortable. There’s something still hanging over us that we can’t ignore forever, even if we do ignore it tonight. But, maybe.\\n\\n It’s after one in the morning when I drive her home since she ran to my house. We sit in the truck, staring at her front door, because things shifted just a little bit in the other direction tonight, and neither of us is ready to let go of it yet. I reach my hand over and lay it, palm up, on the seat between us and she doesn’t hesitate. She lays her left hand on mine and I close my fingers over it.\\n\\n CHAPTER 52\\n\\n Nastya\\n\\n I’m not sure how long we sit in Josh’s truck, holding hands, surrounded by darkness and unspoken regrets. But it’s long enough to know that there are no stories or secrets in the world worth holding onto more than his hand.\\n\\n CHAPTER 53\\n\\n Nastya\\n\\n I think a lot about all the little things that happened the day I was attacked and how any one of them might have changed everything. I wonder how many thousands of variables played a part in him finding me that day and if there are as many at work in my finding him.\\n\\n Clay picks me up at eight in the morning, wearing a long-sleeved button down shirt and dress pants, and not even remotely resembling the artfully unkempt mess I’m used to seeing. I doubt I look much like what he’s used to seeing either. I look more like Emilia today than I have in months. I don’t know if it feels right, but it doesn’t feel as wrong as it used to.\\n\\n I look Clay up and down and c**k my head to the side in appreciation.\\n\\n “You too,” he says, opening the car door for me. I’m not even sure why he’s bringing me. He said he wanted me to see what I sat on my ass so long for; but I’ve seen it all already. I doubt it will look much different hanging on a wall.\\n\\n The gallery opening is at nine and all of the finalists have to be registered and checked in for interviews by ten. The drive is just over an hour, so we’re good. Clay’s interview is at eleven, which gives me time to wander through the exhibits and check out his competition, though I can’t even imagine how Clay Whitaker could ever have any.\\n\\n “Here.” Clay hooks an mp3 player up to the car stereo and hands it to me. “I figured we’d need music since we’ve exhausted all the good conversation topics. You can DJ.”\\n\\n I don’t really want to DJ. I just want to lean my head against the window and close my eyes and pretend I’m on my way to an Italian restaurant in Brighton. I turn it on and flip to the first playlist and click on it. As long as it’s not classical music or depressing love songs, we should be good.\\n\\n I didn’t go back to Josh’s again after Wednesday night. When I let go of his hand and left his truck, I promised myself that the next time I stepped foot in his garage I would answer any question he wanted to ask, and I want to keep that promise.\\n\\n I spend most of the drive trying to line the right words up in my head, rearranging them a hundred times, then finding new ones and starting all over again. When we pull into the gallery an hour later, my cheeks are wet and I don’t even remember when I started crying.\\n\\n We get Clay checked in and then find the room where they’re showing his work. It’s one of the bigger rooms and there are three artists sharing it. Clay’s pictures are hung on the largest wall. I recognize most of them. Some are from his college portfolio. Some are the ones he’s done of me. But it’s hard to concentrate on any of them, because on the center of the wall I’m staring at, is something else entirely.\\n\\n And it’s overwhelming.\\n\\n The centerpiece of the display is a sixteen picture mosaic. On each separate drawing is a part of my face and he’s pieced them together like a puzzle. It’s obvious that this is the reason I’m here. He hadn’t shown it to me. I didn’t even know he’d done it. It makes me want to run from the room.\\n\\n A couple of people come in and comment on the drawings and ask questions to Clay and the two girls, named Sophie and Miranda, whose work is also on display here. I mostly try to face the wall and pretend I’m studying one of Sophie’s paintings until Clay gets called for his interview.\\n\\n Once he’s gone, I venture out into the rest of the displays. I figure I can start at the rear of the gallery because most people haven’t made their way there yet and it’s quieter. I wander toward the back corner of the building into one of the smaller rooms.\\n\\n For a moment, I don’t know where I am. And for the third time in my life the world shifts under my feet and I just try to stay standing.\\n\\n Because he’s here.\\n\\n It’s his face. And it’s not a nightmare. It’s not a memory. He’s here and real and looking at me. And I’m looking back. I’m standing in the middle of a moment that I’ve dreaded and hoped for since the day I remembered what he did to me.\\n\\n The name on the wall next to the paintings is Aidan Richter, the school is the one in the next town over from Brighton and the face in front of me belongs to the boy who killed me.\\n\\n Everything in me turns on and shuts down at the same time. I am weak and strong. I am terrified and brave. I am lost and found. I am here and gone.\\n\\n I’m afraid I’m going to stop breathing again.\\n\\n He’s older, like I am, but there is no mistaking it. I know his face like I know every one of the scars he gave me.\\n\\n I want to run. I want to cry. I want to scream. I want to faint. I want to hurt him, break him, kill him. I want to ask him why as if there could ever possibly be a reason.\\n\\n “Why?” It’s a whisper and a scream.\\n\\n I ask it, and not just in my head. That’s the word I choose out of all of the thousands I could say to him. I ask the unanswerable question. Except that maybe it’s not unanswerable. Maybe he’s the only person in the world who can tell me.\\n\\n I don’t even know which why I’m asking. Why did you do it? Why was it me? Why are you here? Why am I here? Why?\\n\\n He’s looking at me like he’s scared and it’s the only thing that could possibly make me happy at this moment. Good. Lots of people are scared of me. Girls at school. My parents. Even, sometimes, Josh Bennett. But this boy is the only one whose fear I want. \\n\\n","sourceLink":"https://allnovel.net/the-sea-of-tranquility/page-52.html","bookId":1857,"book":{"id":1857,"title":"The Sea of Tranquility","description":"Storyline: I live in a world without magic or miracles. A place where there are no clairvoyants or shapeshifters, no angels or superhuman boys to save you. A place where people die and music disintegrates and things suck. I am pressed so hard against the earth by the weight of reality that some days I wonder how I am still able to lift my feet to walk. \\n Former piano prodigy Nastya Kashnikov wants two things: to get through high school without anyone learning about her past and to make the boy who took everything from her—her identity, her spirit, her will to live—pay. \\n Josh Bennett’s story is no secret: every person he loves has been taken from his life until, at seventeen years old, there is no one left. Now all he wants is be left alone and people allow it because when your name is synonymous with death, everyone tends to give you your space. \\n Everyone except Nastya, the mysterious new girl at school who starts showing up and won’t go away until she’s insinuated herself into every aspect of his life. But the more he gets to know her, the more of an enigma she becomes. As their relationship intensifies and the unanswered questions begin to pile up, he starts to wonder if he will ever learn the secrets she’s been hiding—or if he even wants to. \\n The Sea of Tranquility is a rich, intense, and brilliantly imagined story about a lonely boy, an emotionally fragile girl, and the miracle of second chances.\\n","cover":"https://allnovel.net/images/the-sea-of-tranquility.jpg","author":"Katja Millay","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-sea-of-tranquility.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:26:06 PM"}}
