{"id":95711,"no":5,"title":"Page 5","content":"His trail always seemed to lead him back to that spot. For Drizzt Do\u0027Urden, the devastated rubble of Shallows served as his inspiration, his catalyst to allow the Hunter to fill his spirit with hunger for the hunt. He moved around the broken tower and ruined walls, but rarely did he go to the south of the town. It had taken him several days to muster the nerve to venture past the ruined idol of the foul orc god. As he had feared, he had found no sign of escaping survivors. Drizzt soon started to visit that place for different purposes. On every return, he hoped he might find some orcs milling around the strewn dead, seeking loot perhaps. Drizzt thought it would be fitting for him to slaughter orcs in the shadow of the devastation that was Shallows. He thought he had found his opportunity upon his approach that afternoon. Guenhwyvar, beside him, was clearly on edge, a sure sign that monsters were about, and Drizzt noted the movements of some creatures around the ruins as he moved along the high ground across the ravine north of the town - the same high ground from which the giants had bombarded Shallows as a prelude to the orc assault. As soon as he got a clear view of the ruins, though, Drizzt understood that he would not be doing any battle there that day. There were indeed orcs in Shallows - thousands of orcs - several tribes of the wretches encamped around the shattered remains of that great wooden statue south of the town\u0027s ruined southern wall. Beside him, Guenhwyvar lowered her ears and issued a long and low growl. That brought a smile to the dark elf\u0027s face - the first smile that had found its way there in a long time. \"I know, Guen,\" he said, and he reached over and riffled the cat\u0027s ear. \"Hold patience. We will find our time.\" Guenhwyvar looked at him and slowly blinked, then tilted her head so he could scratch a favored spot along her neck. The growling stopped. Drizzt\u0027s smile did not. He continued to scratch the cat, but continued, too, to look across the ravine, to the ruins of Shallows, to the hordes of orcs. He replayed his memories over and over, recalling it all so vividly; he would not let himself forget. The image of Bruenor tumbling in the tower ruins. The image of giants heaving their great boulders across the ravine at his friends. The image of the orc hordes overrunning the town. None of it had been asked for. None of it deserved. But it would be paid back, Drizzt knew. In full. \"King Obould knows of this travesty?\" asked Arganth Snarrl, the wide-eyed, wild-eyed shaman of the orc tribe that bore his surname. With his bright-colored feathered headdress and tooth necklace (with specimens from a variety of creatures) that reached below his waist, Arganth was among the most distinctive and colorful of the dozen shamans congregated around the ruined Gruumsh idol, and with his shrieking, almost birdlike voice, he was also the loudest. \"Does he understand, does he? Does he? Does he?\" the shaman asked, hop-ping from one of his colleagues to the next in rapid succession. \"I do not think he does! No, no, because if he does, then he does not place this ... this ... this, blasphemy in proper order! More important than all his conquests, this is!\" \"Unless his conquests are being delivered in the name of Gruumsh,\" shaman Achtel Gnarlfingers remarked, the interruption stopping Arganth in his tracks. Achtel\u0027s dress was not as large and attention-grabbing as Arganth\u0027s, but it was equally colorful, with a rich red traveling cloak, complete with hood, and a bright yellow sash crossing shoulder to hip and around her waist. She carried a skull-headed scepter, heavily enchanted to serve as a formidable weapon, from what Arganth had heard. Even more than that, the priestess with the shaggy brown hair carried tremendous weight simply because she represented the largest of the dozen tribes in attendance, with more than six hundred warriors encamped in the area under her dominion. The colorful priest stared wide-eyed at Achtel, who did not back down at all. \"Which Obould does do,\" Arganth insisted. \"We march for the glory of Gruumsh,\" another of the group agreed. \"The One-Eye desires the defeat of the dwarves!\" That brought a cheer from all around, except for Arganth, who stood there staring at Achtel. Gradually, all eyes focused on the trembling figure with the feathered headdress. \"Not enough,\" Achtel insisted. \"King Obould Many-Arrows marches for the glory of King Obould Many-Arrows.\" Gasps came back at him. \"That is our way,\" Arganth quickly added, seeing the dangerously rising dissent and the sudden scowling of dangerous Achtel. \"That is always our way, and a good way it is. But now, with the blasphemy of this idol, we must join the two, Obould and Gruumsh! Their glory must be made as one!\" The other eleven shamans neither cheered nor jeered, but simply stood there, staring at the volatile shaman of Snarrl. \"Each tribe?\" one began tentatively, shaking his head. The orc tribes had come to Obould\u0027s call - especially after hearing of the fall of King Bruenor Battlehammer, who had long been a reviled figure - but the armies remained, first and foremost, individual tribes. Arganth Snarrl leaped up before the speaker, his yellow-hued eyes so wide that they seemed as if they would just roll from their sockets. \"No more!\" he yelled, and he jumped wildly all about, facing each of the others in turn. \"No more! Tribes are second. Gruumsh is first!\" \"Gruumsh!\" a couple of the others yelled together. \"And Gruumsh is Obould?\" Achtel calmly asked, seeming to measure every movement and word carefully - more so than any of the others in attendance, certainly. \"Gruumsh is Obould!\" Arganth proclaimed. \"Soon to be, yes!\" He ended in a gesticulating, leaping and wildly shaking dance around the ruined idol of his god-figure, the hollowed statue the dwarves had used as a ruse to get amidst Obould\u0027s forces. With imminent victory in their grasp, overrunning Shallows, the ultimate, despicable deception of the wretched dwarves had salvaged some escape from what should have been a complete slaughter. To use the orc god-figure for such treachery was beyond the bounds of decency in the eyes of those dozen shamans, the religious leaders of the more than three thousand orcs of their respective tribes. \"Gruumsh is Obould!\" Arganth began to chant as he danced, and each shaman in turn took up the cry as he or she fell into line behind the wildly gesticulating, outrageously dressed character. Except for Achtel. The thoughtful and more sedentary orc stepped back from the evocative dance and observed the movements of her fellow shamans, her doubts fairly obviously displayed upon her orc features. All the others knew of her feelings on the matter and of her hesitation in counseling her chieftain to lead her tribe out of its secure home to join in the fight against the powerful dwarves. Until then, none had dared to question her in that decision. \"You must get better,\" Catti-brie whispered into her father\u0027s ear. She believed that Bruenor did hear her, though he gave no outward sign, and indeed, had not moved at all in several days. \"The orcs think they\u0027ve killed you, and we can\u0027t be letting that challenge go unanswered!\" the woman went on, offering great enthusiasm and energy to the comatose dwarf king. Catti-brie squeezed Bruenor\u0027s hand as she spoke, and for a moment, she thought he squeezed back. Or she imagined it. She gave a great sigh, then, and looked to her bow, which was leaning up against the far wall of the candlelit room. She would have to be out again soon, she knew, for the fighting up on the cliff would surely begin anew. \"I think he hears you,\" came a voice from behind Catti-brie, and she managed a smile as she turned to regard her friend Regis. Truly, the halfling looked the part of the battered warrior, with one arm slung tight against his chest and wrapped with heavy bandages. That arm had fended the snapping maw of a great worg, and Regis had paid a heavy price. Catti-brie rolled up from her father\u0027s side to give the halfling a well-deserved hug. \"The clerics haven\u0027t healed it yet?\" she asked, eyeing his arm. \"They\u0027ve done quite a bit, actually,\" Regis answered in a chipper tone, and to show his optimism, he managed to wriggle his bluish fingers. \"They would have long ago finished their work on it, but there are too many others who need their healing spells and salves more than I. It\u0027s not so bad.\" \"You saved us all, Rumblebelly,\" Catti-brie offered, using Bruenor\u0027s nickname for the somewhat chubby halfling. \"You took it on yerself to go and get some help, and we\u0027d have been dead soon enough if you hadn\u0027t arrived with Pwent and the boys.\" Regis just shrugged and even blushed a bit. \"How do we fare up on the mountain?\" he asked. \"Fair,\" Catti-brie answered. \"The orcs chased us right to the edge, but we got more than a few in a trap, and when they came on in full, we sent them running. Ye should see the work of Banak Brawnanvil, Ivan Bouldershoulder, and Torgar Hammerstriker of Mirabar. They had the dwarves turning squares and wedges every which way and had the orcs scratching their heads in confusion right up until they got run over.\" Regis managed a wide smile and even a little chuckle, but it died quickly as he looked past Catti-brie to the resting Bruenor. \"How is he this day?\" Catti-brie looked back at her father and could only offer a shrug in reply. \"The priests do not think he\u0027ll come out of it,\" Regis told her, and she nodded for she had of course heard the very same from them. \"But I think he will,\" Regis went on. \"Though he\u0027ll be a long time on the mend, even still.\" \"He\u0027ll come back to us,\" Catti-brie assured her little friend. \"We need him,\" Regis said, his voice barely a whisper. \"All of Mithral Hall needs King Bruenor.\" \"Bah, but that\u0027s no attitude to be takin\u0027 at this tough time,\" came a voice from out in the hallway, and the pair turned to see a bedraggled old dwarf come striding in. They recognized the dwarf at once as General Dagna, one of Bruenor\u0027s most trusted commanders and the father of Dagnabbit, who had fallen at Shallows. The two friends glanced at each other and winced, then offered sympathetic looks to the dwarf who had lost his valiant son. \"He died well,\" Dagna remarked, obviously understanding their intent. \"No dwarf can ask for more than that.\" \"He died brilliantly,\" Catti-brie agreed. \"Shaking his fist at the orcs and the giants. And how many felt the bite of his anger before he fell?\" Dagna nodded, his expression solemn. \"Banak\u0027s got the army out on the mountain?\" he asked a moment later, changing both his tone and the grim subject with a burst of sudden energy. \"He\u0027s got it well in hand,\" Catti-brie answered. \"And he\u0027s found some fine help in the dwarves from Mirabar and in the Bouldershoulder brothers, who have come from the Spirit Soaring library in the Snowflake Mountains.\" Dagna nodded and mumbled, \"Good, good.\" \"We\u0027ll hold up there,\" Cattie-brie said. \"Ye best,\" said Dagna. \"I\u0027ve got more than I can handle in securing the tunnels. We\u0027re not to let our enemies walk in through the Underdark while they\u0027re distracting us up above.\" Catti-brie stepped back and looked to Regis for support. She had expected that, somewhat, for when Banak\u0027s couriers had come in with requests that a second force be sent forth from Mithral Hall to secure the western end of Keeper\u0027s Dale, their reception had been less than warm. Clearly there was a battle brewing about whether to fall back to Mithral Hall and hold the fort or to go out and meet the surface challenge of the orc hordes. \"They\u0027re getting their ropes down to the dale so that Banak can get them all out o\u0027 there?\" Dagna asked. \"They\u0027ve several rope ladders to the valley floor already,\" Catti-brie answered. \"And Warlord Banak\u0027s ordered many more. Torgar\u0027s engineers are putting the climbs together nonstop. But Banak\u0027s not thinking to come down anytime soon. If we can assure him that Keeper\u0027s Dale is secure behind him, he\u0027ll stay up on that mountain until the orcs find a way to push him off.\" Dagna grumbled something unintelligible under his breath, and though Catti-brie and Regis couldn\u0027t make it out, it was fairly obvious that the crusty old warrior dwarf wasn\u0027t thrilled with that prospect. \"We\u0027ve got the right three directing the forces out there,\" Catti-brie assured him. \"True enough,\" Dagna admitted. \"I sent Banak Brawnanvil out there meself, and I knowed there\u0027d be none better among all the ranks o\u0027 Clan Battlehammer.\" \"Then give him the support he needs to hold that ground.\" Dagna looked long and hard at Catti-brie, then shook his head. \"Choice ain\u0027t me own to make,\" he replied. \"Clerics asked me to direct the defense o\u0027 the tunnels, and so I am. They\u0027re not asking me to steward Bruenor\u0027s crown.\" As he finished, he glanced over at Regis, and Catti-brie followed his gaze to her little friend, who suddenly seemed embarrassed. \"What do ye know?\" the woman quietly asked the halfling. \"I-I told them it sh-should be you,\" Regis stammered. \"Or Wulfgar, if not you.\" Catti-brie turned her confused expression over Dagna, then back to the halfling. \"Yourself?\" she asked Regis. \"Are ye telling me that you\u0027ve been asked to serve as Steward of Mithral Hall?\" \"He has,\" Dagna answered. \"And meself\u0027s the one who nominated him. With all me respect, good lady, for yerself and yer stepbrother, we\u0027re all thinking that none knew Bruenor\u0027s thoughts better than Regis here.\" Catti-brie\u0027s expression as she turned back to regard Regis was more amused than angry. She lifted her head just a bit so that she could peek over the low collar of the halfling\u0027s shirt, looking toward a certain ruby pendant the halfling always wore. The implications of her questioning stare were clear enough and almost as obvious as if Catti-brie had just asked the halfling aloud if he had used his ruby pendant to \"persuade\" some of those deciding upon the matter of who should be steward in Bruenor\u0027s absence. Regis\u0027s sudden gulp was even louder. \"You\u0027ve got the word as king, then?\" Catti-brie asked. \"He\u0027s got the primary vote,\" Dagna corrected. \"The king\u0027s over there, lest ye\u0027re forgetting.\" The crusty old dwarf pointed his chin Bruenor\u0027s way. \"Over there, and soon enough to join us again,\" Catti-brie agreed. \"Until then, Steward Regis it is.\" From somewhere down the hall came a call for Dagna, and the old dwarf gave a few \"bahs\" and excused himself, which was exactly what Catti-brie wanted, for she needed to have a few words in private with a certain little halfling. \"I-I\u0027ve done nothing untoward,\" Regis stammered as soon as he was alone with Catti-brie, and the way the blood drained from the halfling\u0027s face showed that he understood her every concern. \"No one said you did.\" \"They asked me to serve Bruenor,\" Regis went on unsteadily. \"How could I say no to that? You and Wulfgar will stay out and about, and who knows when Drizzt will return?\" \"The dwarves wouldn\u0027t follow any of us three, anyway,\" Catti-brie agreed. \"They\u0027ll take to a halfling, though. And everyone knows that Bruenor took Regis into his confidence all the way back from Icewind Dale. A good choice, I\u0027d say, in Steward Regis. I\u0027ve no doubt that you\u0027ll do what\u0027s best for Mithral Hall, and that\u0027s the point, after all.\" Regis seemed to steady a bit, and even managed a smile. \"And what\u0027s good for Mithral Hall right now is for Steward Regis to get a thousand more dwarves out and in position to defend Keeper\u0027s Dale in the western edge,\" Catti-brie said. \"And another two hundred running supplies, Mithral Hall to Keeper\u0027s Dale, and Mithral Hall to Warlord Banak and the force up on the mountain.\" \"We haven\u0027t got that many to spare!\" Regis protested. \"We\u0027re maintaining two groups outside the mines already, with those holding defense along the Sur-brin in the east.\" \"Then bring that second group in and close the eastern gate,\" Catti-brie reasoned. \"We know we\u0027re in for a fight up on the mountain, and if the orcs get around us into Keeper\u0027s Dale, Banak\u0027s to lose his whole force.\" \"If the orcs float down the Surbrin ...\" Regis started to warn. \"Then one well-positioned scout will see them,\" Catti-brie answered. \"They\u0027ll be moving near to striking distance of some of our allies then as well.\" Regis considered the logic for a short while, then nodded his agreement. \"I\u0027ll bring most of them in,\" the halfling said, \"and send out the force through Keeper\u0027s Dale. Do we really need a thousand in the west? That many?\" \"Five hundred at the least, by Banak\u0027s estimation,\" Catti-brie explained. \"Though if they\u0027re left alone for a bit and can get the defenses up and in place, then we can cut that number considerably.\" Regis nodded. \"But I\u0027ll not deplete the defenses of the mines,\" he said. \"If the orcs are striking aboveground, then we can expect trouble below as well. Bruenor\u0027s got a responsibility to the folks of the land around, I agree, but his first duty is to Mithral Hall.\" Catti-brie glanced past Regis, to the very still form of her beloved adoptive father. She managed a wistful smile as she whispered, \"Agreed.\" The black foot came down softly, toes touching the dirt and stone, weight shifting gradually, ever so gradually, to allow for continued perfect balance and complete silence. A shift brought the next foot out in front, to repeat the stealthy stride. He moved through the largest of the dozen separate encampments around the field of Shallows, slipping in and out of the predawn shadows with the skill that only a drow warrior - and only the best of the drow warriors - could possibly attain. He moved within a few strides of one group of oblivious orcs as they argued over something that didn\u0027t concern him in the least. He slipped to the side of a tent then went in and silently through it, passing right between a pair of snoring orcs. Using a fine-edged scimitar, he cut a slice in the back flap, and quiet as a slight breeze, the dark elf moved back out. Normally, he would have paused to slaughter those sleeping two, but Drizzt Do\u0027Urden had something else in mind, something that he didn\u0027t want to compromise for lesser trophies. For there sat a larger and more decorated tent in the distance, its deerskin flaps covered in sigils and murals representing the orc god. A trio of heavily armed guards paced around its entryway. There lay the leader of the tribe, Drizzt reasoned, and that tribe was the largest by far of those assembled. The Hunter moved along, light-stepping and quick-stepping, always in balance, always at the ready, scimitars drawn and moving in harmony with his body as he strode and rolled, dipping back and stepping forward suddenly. It would not do for him to merely hold the weapons at his sides, he knew, for he wore the enchanted bracers around his ankles, speeding his stride, and in crossing so rapidly past so many cubbies and blind corners, the drow had to be ready to strike with precision in an instant. So the curving blades did a dance around him as his legs propelled him across the encampment, inexorably toward that large, decorated tent. Within the cover of a lean-to just across from the large tent\u0027s entrance and its three orc guards, Drizzt slid his scimitars away. He had to be fast and precise, and he had to pick his moment carefully. He looked around, waiting for another group of orcs to walk farther away. Satisfied that he had a few moments alone, he casually rested his hands on the pommels of his belted weapons and strode across the way, smiling and with an unthreatening posture. The orc guards, though, tensed immediately, one clutching his weapon more tightly, another even ordering Drizzt to stop. The drow did halt, and locked the image of them into his sensibilities, noting their exact placement, counting the number of strides that would bring him before them, one after another. The orc in the middle kept on talking, ordering, and questioning, and Drizzt just held his ground, smiling. Just as one of the other orcs turned as if to move into the great tent, the drow reached into his innate magical powers and dropped a globe of darkness upon the trio. Even as he summoned it, Drizzt was moving, hands and feet. His scimitars appeared in his hands before he had taken two strides, and he was into the darkness before the orcs even realized that the world had suddenly gone black. Drizzt veered left first, still holding fast to the image of the three and confident that none had begun to move. Twinkle came across at neck height, turning an intended cry for help into a gurgle. A spin had both blades cutting down the second guard and a sudden forward rush out of that spin propelled the drow straight into the third, again with his blades finding the mark. He bowled over that third orc, the creature falling right through the tent flap, and Drizzt stepping in right across it, exiting the area of darkness. Several startled faces looked back at him, including that of a red-cloaked female shaman. Unfortunately, she was across the room. Not slowing in the least, Drizzt rushed the closest orc, severing its upraised, blocking arm and quick-stepping past it while thrusting his other scimitar into its belly. A table was set between Drizzt and the next in line on that right-hand side of the tent. The orc fell behind the table, using it to slow the drow\u0027s progress - or thinking to, for Drizzt went over it as if it wasn\u0027t even there. His foot came up to kick aside the small stool the orc thrust his way. As that orc fell to the slashing blades, the Hunter spun around, bringing both his weapons across defensively, one following the other, and the first turned the tip of a flying spear while the second knocked the clumsily-thrown missile completely aside. But the other orcs were organizing and setting their defenses, and the shaman was casting a spell. Drizzt called upon his innate magical abilities yet again, but paused enough to mouth, \"olacka acka eento.\" - a bit of arcane-sounding gibberish. He even tossed one of his blades into the air and waggled his fingers dramatically to heighten the ruse. The shaman took the bait, and where the room had been in a ruckus and growing louder, suddenly all was silent. Completely and magically silent, as the shaman predictably used the most efficient spell in her clerical arsenal to prevent attacks of wizardry. That spell didn\u0027t prevent Drizzt\u0027s innate magic, though, and so the shaman was suddenly covered in purplish-glowing flames that outlined her form clearly, making her an easier target. Drizzt didn\u0027t stop there, bringing forth another globe of impenetrable darkness right before the orc warriors who were even then bearing down upon him. He summoned a second globe for good measure, to ensure that the whole of the large tent was filled with darkness and confusion, and he fell even more deeply into the Hunter. He couldn\u0027t hear a thing and couldn\u0027t see a thing, and so he played by touch and instinct alone. He went into a spinning dance, his blades whipping all around him, setting a defense, and every so often he came out of it with one blade or the other stabbing forward powerfully or bringing it in a sudden and wide slashing sweep. And whenever he sensed the presence of an orc in close quarters - the smell of the creature, the hot breath, or a slight brush - he struck fast and hard, scimitars coming to bear with deadly accuracy, finding holes in any offered defense simply because Drizzt knew the height of his opponents and understood their typical offered posture, defensive or attacking. He worked his way straight across the room, then back toward the center tent pole, using that as a pivot. He would have been surprised, had he not been in that primal and reactive mode, when a spell burst forth, countering his darkness with magical light. Orcs were all around him, and all surprised - except for the shaman, who stood at the back wall of the tent, her eyes glowing fiercely, her body still outlined in the drow\u0027s faerie fire, her fingers waggling in yet another casting. Those surprised orcs closest to Drizzt\u0027s right fell fast and fell hard, and the drow spun back to the left to meet the advance of some others, his weapons rolling over and over furiously, slapping away defenses, stinging arms and hands, and driving the entire remaining quartet of warriors back. He slowed suddenly, feeling as if his arms were leaden, as a wave of magical energy flowed through him. He knew the spell instinctively, one that could paralyze, and had he not been within the hold of the Hunter at that time, where instinct and primal fury built for him a wall of defense, his life would have swiftly ended. As it was, the drow\u0027s defenses became sluggish for a moment, so much so that a club came in from the side and smacked him hard in the ribs. Very hard, but the Hunter felt no pain. A globe of darkness engulfed him again, and he went right at the attacker, accepting a second hit, much less intense, and returning it with a trio of quick stabs and a slash, and any of the four attacks could have alone laid the orc low. The enchantment of magical silence expired or was dismissed, and the Hunter\u0027s ears perked up immediately, registering the movements of those orcs nearby and hearing, too, the incantation of the troublesome shaman. He brought his scimitars into sudden crossing diagonal slashes before him, winding them around in a loop to continue the rolling movements, then used that to get between a pair of orcs. On one downward roll, the drow used his building momentum to leap forward and out, turning a complete somersault and landing lightly on his feet in a short run out of the darkness. Right behind him came a burst of sharp sound, as if the air itself exploded, and the drow fell into a stagger and nearly went to the floor. And if that spell had done that much to him, Drizzt could well understand its effect on the orcs behind him! He caught himself, pivoted, and went right back into the darkness, blades slashing wildly. He hit nothing, for as he had expected, the orcs were down, but he really didn\u0027t want to hit anything. Rather, he stopped short and cut a right angle to his left, then burst out of the darkness once more, right in front of the shaman, who was waggling her fingers yet again. Twinkle took those fingers. Icingdeath took her head. Hearing a tremendous commotion back the other way, the Hunter ran right past the falling shaman to the wall of the tent. His fine blades slashed down, and he squeezed through. He ran off across the encampment, and orcs scrambled to get out of his way even as the screams continued to grow from the main tent behind him. He picked his path carefully, running from shadow to shadow at full bent. Soon he was running clear, his enchanted anklets speeding him on his way to the rougher ground to the east and north of the town. He had killed only a handful of orcs, but Drizzt was certain that he had brought great distress to his enemies that day.","sourceLink":"https://allnovel.net/the-lone-drow-hunter-s-blades-2/page-5.html","bookId":2141,"book":{"id":2141,"title":"The Lone Drow (Hunter\u0027s Blades #2)","description":"Storyline: The Lone Drow (Hunter\u0027s Blades #2) Alone on the battlefield. Surrounded by death. Cornered by enemies. And ready to die. Drizzt Do’Urden has become the Hunter, the bane of the orc hordes still ravaging the North. Cut off, alone, convinced that everything he ever valued has been destroyed, all that’s left is to kill, and kill, and kill, until there are no enemies left. But there are a lot of enemies, and even the Hunter is just one lone drow.","cover":"https://allnovel.net/images/the-lone-drow-hunter-s-blades-2.jpg","author":"R.A. Salvatore","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-lone-drow-hunter-s-blades-2.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:16:00 PM"}}
