{"id":98150,"no":10,"title":"Page 10","content":"Yes, there is.\n Nutscracker\n But what\u0027s a labyrinth doing in a cathedral?\n UGLI 666\n The first canon told me a labyrinth is a part of that church and many others, because it illustrates the full complexity of the Christian path.\n Nutscracker\n The first canon?\n UGLI 666\n Yes. But the second canon objected that the Christian path is as simple and straight as an arrow. And the twists and turns and dead-ends of the labyrinth symbolise sin, in which fallen souls wander, hopelessly lost. And then the first canon replied that he had essentially meant the same thing, since sin is a distortion arising in the straight line of the Christian path. But no matter how tortuous the path of life might be, if the person walking it remains within the bosom of the Church, the simple arithmetic of good and evil ceases to apply, and the higher mathematics of the spirit comes into play.\n Nutscracker\n Now we\u0027ve got a second canon as well.\n Monstradamus\n And what higher mathematics is that?\n UGLI 666\n However crooked and tortuous a life may be overall, a communicant of the Sacred Gifts may regard each infinitesimally small sector of his path as straight. And if any sector of his path is straight, then it is straight at any moment, and if it is straight at any moment, then it is always straight, and the Lord will not reject his soul. It is as though we grow mathematical wings that lift us up out of the depths of our degradation.\n Nutscracker\n But who are these canons? You mean you met someone?\n UGLI 666\n There were two of them. They were praying on bended knees near the altar. I made a noise, they noticed me and came over to help me with explanations and instructions.\n Nutscracker\n Tell us about them.\n UGLI 666\n They said that a long time ago, when faith was strong in people\u0027s souls, a priest could send a repentant sinner on a pilgrimage to the Holy Land. In later times, when faith began to fail ...\n Nutscracker\n Not about the instructions, tell us about the canons themselves. Don\u0027t you understand, or what? No one else here has met anybody.\n Monstradamus\n What about Ariadne?\n Nutscracker\n She only dreamed about them. Surely I don\u0027t have to explain the difference?\n Monstradamus\n Yes, explain it, Nutcracker.\n Nutscracker\n You don\u0027t understand the difference between a dream and reality?\n Monstradamus\n I don\u0027t understand what the difference is between the two stories.\n Nutscracker\n The difference is one\u0027s about a dream and one\u0027s about reality.\n Monstradamus\n But all I can see are letters on a screen.\n Nutscracker\n Not again. You\u0027ve worn me out. Ugly, are you there?\n UGLI 666\n Yes.\n Nutscracker\n These canons, what did they look like?\n UGLI 666\n Medium height. In threadbare cassocks, with old-fashioned, wide-brimmed cardinal\u0027s hats on their heads. The canons explained that the hats once belonged to holy prelates and they helped to calm the passions. The second canon had the brim of his hat bent upwards at one side, like a duellist. It reminded me of Aramis from \u0027The Three Musketeers\u0027, the one who was an ordinary sinner at first, and then became a general of the order of Jesuits.\n Monstradamus\n Sounds like the two dwarves that Ariadne saw at the very beginning.\n Nutscracker\n That\u0027s what I thought too. But those were dwarves, and these two are medium height.\n Monstradamus\n Ugly, what height are you?\n UGLI 666\n That has nothing to do with anything.\n Nutscracker\n Forget it. Let\u0027s move on. Ugly, did you see their faces?\n UGLI 666\n No. They stood with their heads bowed, as befits monks and spiritual people, and the brims of their hats hid their features completely.\n Nutscracker\n And what were their voices like?\n UGLI 666\n Humble and sincere.\n Nutscracker\n What did they say?\n UGLI 666\n I started telling you that, but you interrupted. They said that in the glorious times of the Holy Crusades, especially after the victory of Gottfried of Bouillon, pilgrims journeyed on foot to the grave of our Lord to repent. Later, when faith grew weaker and the human spirit no longer possessed the strength for such great effort, the site of pilgrimage was relocated to monasteries and abbeys, where people went to pay homage to the local saint. When people\u0027s piety became too weak even for that, they were instructed to walk The League to do penance.\n Nutscracker\n The League?\n UGLI 666\n Yes. It\u0027s the old name for the church labyrinth. That\u0027s approximately how long it was. Although the one I was facing was a lot shorter. You were supposed to walk through these labyrinths on your knees. And for the time of ultimate decline that will come just before the end of the world, labyrinths on walls were prepared, really small ones that people go through by tracing the way with their finger. They are for those who are only willing to spend a very small amount of time on their souls. But there are labyrinths that are quite the opposite, endlessly long ones in which you can repent eternally. For instance in the Church of Sta. Maria-di-Trastavera in Rome. The first canon showed me a plan of it.\n Monstradamus\n He prepared well for the conversation.\n UGLI 666\n He didn\u0027t prepare for it. The plans of the labyrinths were on the columns and walls of the cathedral. In fact, everything there was covered with them. The one that\u0027s in Sta. Maria-di-Trastavera consists of a large number of circles set inside each other. It looks like a target for shooting practice. It\u0027s the most mystical of all the labyrinths.\n Monstradamus\n The most mystical one is mine; please enter that in the minutes.\n UGLI 666\n The second canon explained that the meaning of these circles is that it\u0027s no more possible for the soul to approach the Lord through its own desire than for the moon suddenly to decide to fly closer to the earth. The soul will remain eternally on the plane to which the Lord has sent it, and it will only be able to approach Him through His mercy, and not of its own will. And His mercy is expressed in the existence of the Church. It\u0027s the Church that lends us those mathematical wings we were talking about. Without them we can only circle around Him like the planets. Sin is the centrifugal force that pulls us away from Him. But God\u0027s love is like the force of gravity, because it draws us to Him. The soul dwells in this world below because these forces balance each other.\n Nutscracker\n So the Lord loves sinners more then?\n UGLI 666\n Why?\n Nutscracker\n They have more sins, so their centrifugal force is stronger. For them to stay in orbit, the force of God\u0027s love has to increase to balance it.\n UGLI 666\n But it happens in families too, that the best-loved children are the naughtiest.\n Nutscracker\n Then that means, if you want the Lord to love you, pull as many dirty tricks as you can?\n UGLI 666\n Yes it does, according to logic. But I\u0027m not really sure that\u0027s what the Lord is actually guided by.\n Nutscracker\n Okay, we\u0027ll check that one out. What happened next?\n UGLI 666\n Next? The second canon folded his arms and fell silent and withdrew humbly into the shadow. I began walking around the cathedral arm-in-arm with the first one, examining the plans of the various spiritual labyrinths, while the canon quietly explained their function and symbolic meaning to me. I thought the labyrinth from Poitiers Cathedral was particularly beautiful. It\u0027s shaped like a tree with a spreading crown and arranged so that the same threshold serves as its entrance and its exit. It works out like that because the path only divides in two once, at the very centre, and its two halves twist and turn to form the right and left parts of the tree\u0027s crown. The canon said it was the Tree of Life, and the meaning of the labyrinth was that we enter life and leave it through the same door, naked and taking nothing with us.\n Nutscracker\n And where\u0027s that inscription with the secret message from, the one you asked us to translate?\n UGLI 666\n From an ancient basilica in Algeria.\n Monstradamus\n Does it have a labyrinth too?\n UGLI 666\n Yes. It surrounds a central square containing the holy inscription. The canon told me to copy it out and assured me there was a secret in the inscription. He said I would only be able to read it when I had the key. In exactly the same way, he said, I would not be able to understand the predestined purpose of people and things in this world until the moment when the wisdom that comes with true faith opened my eyes to the transcendental meaning of creation. And the key to that wisdom was the same as the key to the inscription. He also told me not to be seduced by the empty talk about Theseus, which he knows all about. In time, he said, I would see for myself that the true Theseus is the One whom he serves. And that\u0027s all. Is Monstradamus still there?\n Nutscracker\n Later. Go on with your story.\n UGLI 666\n I\u0027m not going to tell you any more until he translates for me.\n Nutscracker\n Monster, are you there? Translate for her, please.\n Monstradamus\n The whole point is in the way the letters are arranged. In French it\u0027s called a jeu-de-lettres .\n UGLI 666\n But do you have the key to the inscription the canon was talking about?\n Monstradamus\n Of course.\n UGLI 666\n What is it?\n Monstradamus\n It\u0027s a cross.\n UGLI 666\n My Lord! Thy will be done!\n Monstradamus\n Yes. You have to start from the very centre. Find the letter S there and trace a cross through it. If you read the text in any direction of the cross and then along any line from it at right angles, you get SANCTA ECLESIA, which means \u0027the holy church\u0027, with one mistake.\n UGLI 666\n Are you saying the inscription was made with a spelling mistake? Or does the inscription refer to a mistake made by the holy church?\n Monstradamus\n What I\u0027m saying is there should be two C\u0027s in the word for church - ecclesia. But in olden times they might have thought that was excessive.\n Nutscracker\n Then what happened, Ugly?\n UGLI 666\n Wait a moment. Let me see if it works with the letters. It really does. How profound! Now I understand what the canon was trying to say, Monstradamus. This world will remain a meaningless conglomeration of absurdities and riddles, where we continue to wander aimlessly about in the dark, until we accept the teachings of the Holy Church. But as soon as that happens, the holy cross will shine out at the centre of life\u0027s labyrinth, and the fullness of the purpose concealed in all things will instantly be revealed! The world will be miraculously transformed, the harmonious scheme of things will emerge from the chaos and insanity, and whichever way we direct our gaze, we shall see Hosannah to the Lord on every side! Is that right, Monstradamus?\n Monstradamus\n But of course. And we shall hear the radiance of his glory.\n Nutscracker\n Amen. So what happened next?\n UGLI 666\n The canon led me over to the labyrinth laid out on the floor and said \u0027My daughter, the One whom I serve wishes you to walk The League and repent.\u0027 I went down on my knees and set off. The canon said that while walking through a labyrinth like that the correct thing to do is to meditate intensely on everything that you have done in your life. I didn\u0027t have to try very hard. I only had to glance at the grid by the altar for pictures of my childhood to start floating past my inner eye like coloured balloons, magically transforming what I saw around me. With every new second I was immersed deeper and deeper into the past. The majestic columns soaring upwards to meet the distant vaults took on the appearance of the lime trees in the park in xxx where I spent the first few years of my life. It\u0027s not surprising - in those distant days the trees were every bit as huge in relation to me as those columns are now. The images of the saints watching me from niches in the walls had the faces of grown-ups from my childhood. I sensed that some of them were strict and others were indulgent, but they all loved me equally, even though they knew absolutely everything about me. Then the path turned a corner and I began walking, or rather crawling, in a different direction; now I remembered the time of my youth. The stone boatman decorating the preacher\u0027s pulpit came to life and sailed across the waters of my memory, transformed into the only friend of my life\u0027s brief springtime. He looked exactly as he did on the lake in xxx, where we swore to love each other forever. A new turn, and sin had swept him into oblivion - I no longer knew him and did not wish to know him. Yet another turn and the time of maturity had arrived. My stockings were worn into holes, my knees were scratched, but I didn\u0027t feel any pain - tears of repentance and hope were flowing down my cheeks. And the Lord sent me word, yes He did! A little miracle occurred - I don\u0027t know how it happened that in my blindness I only realised it afterwards, when I came back to my cell. I mean my room. As I circled through the labyrinth, no matter which way I turned within it, I could always see the crucifixion with a ray of sunlight falling on it through a stained-glass window, suffusing it with ruby, emerald and sapphire light! And that unearthly radiance made my heart feel so happy, so bright and calm that I wanted to cry and sing, cry and sing ...\n Nutscracker\n And?\n UGLI 666\n Cry and sing.\n Nutscracker\n And is that it?\n UGLI 666\n Yes, that\u0027s more or less everything. When I\u0027d crawled all the way through the labyrinth, the canons were no longer anywhere to be seen. I walked out of the cathedral and found myself in my room.\n Nutscracker\n And can you go back into the cathedral now?\n UGLI 666\n Its door is locked now. \n","sourceLink":"https://allnovel.net/the-helmet-of-horror/page-10.html","bookId":2606,"book":{"id":2606,"title":"The Helmet of Horror","description":"Storyline: \n Victor Pelevin, the iconoclastic and wildly interesting contemporary Russian novelist who The New Yorker named one of the Best European Writers Under 35, upends any conventional notions of what mythology must be with his unique take on the myth of Theseus and the Minotaur. By creating a mesmerizing world where the surreal and the hyperreal collide, The Helmet of Horror is a radical retelling of the myth of Theseus and the Minotaur set in an Internet chat room. They have never met, they have been assigned strange pseudonyms, they inhabit identical rooms that open out onto very different landscapes, and they have entered a dialogue they cannot escape - a discourse defined and destroyed by the Helmet of Horror. Its wearer is the dominant force they call Asterisk, a force for good and ill in which the Minotaur is forever present and Theseus is the great unknown. The Helmet of Horror is structured according to the way we communicate in the twenty-first century - using the Internet - yet instilled with the figures and narratives of classical mythology. It is a labyrinthine examination of epistemological uncertainty that radically reinvents this myth for an age where information is abundant but knowledge ultimately unattainable.\n \n","cover":"https://allnovel.net/images/the-helmet-of-horror.jpg","author":"Victor Pelevin","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-helmet-of-horror.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:31:44 PM"}}
