{"id":98153,"no":13,"title":"Page 13","content":"Ariadne\n All right. I\u0027ll be going then.\n Monstradamus\n Just like that?\n Ariadne\n I\u0027ll forget the questions later.\n Nutscracker\n Go on then. And we\u0027ll carry on here. What was that you said about your labyrinth. Monster?\n Monstradamus\n When was that?\n Nutscracker\n When Ugly was telling us about the cathedral. They showed her something like a target and said it was the most mystical labyrinth there could possibly be. And you claimed the most mystical one was yours. I\u0027m curious about what it is.\n Monstradamus\n I think I really ought to take those words back. The most mystical one is probably Sartrik\u0027s. Sartrik, are you there?\n Nutscracker\n He must be busy with his booze now.\n Monstradamus\n Then tell me about your labyrinth. Or Organism can tell us about his.\n Organizm(-:\n I haven\u0027t got anything interesting. Just a screen-saver.\n Monstradamus\n What?\n Organizm(-:\n In Windows there\u0027s a screen-saver called \u0027maze\u0027. And I\u0027ve got a model of it here. Built out of planks instead of pixels. It\u0027s the only time I can ever recall software being turned into hardware.\n Monstradamus\n Did anyone understand that?\n Nutscracker\n I know what he\u0027s talking about. It\u0027s a kind of program.\n Monstradamus\n And it switches off the screen?\n Nutscracker\n Just the opposite, it switches it on to full power.\n Monstradamus\n Then why\u0027s it called a screen-saviour? What kind of salvation is that?\n Nutscracker\n Ugly can ask her canons about that. They know all about saviours and salvation.\n UGLI 666\n If that is a blasphemous insult to the Saviour, He\u0027ll forgive you for it, you sinful simpleton. But I advise you to leave the Holy Spirit alone.\n Nutscracker\n Ah, you\u0027re back. Am I correct in suspecting your saviour also doubles up as the creator?\n UGLI 666\n That\u0027s right.\n Nutscracker\n Do you know who he reminds me of? A spiteful little sorcerer who gets the urge to torture a kitten. So he goes down into a deep, dark cellar, moulds a kitten out of clay, brings it to life and then - whack! - he smashes its head against the corner of the wall. And he does that every weekend, a hundred times or more. And to make sure no miaowing is ever heard from the cellar, our sorcerer teaches the kittens to think stoically - I came from the dust and to the dust I return. And he forces them to pray to him for the few seconds of their existence.\n Monstradamus\n God only knows what goes on inside that head of yours, Nutcracker.\n UGLI 666\n Not God, the devil. That\u0027s already a blasphemy against the Holy Ghost, take care Nutcracker. The Lord does not force us to pray to him. We choose our own path, because he created us with free will.\n Nutscracker\n Don\u0027t make me laugh, Ugly. Free will. Life\u0027s like falling off a roof. Can you stop on the way? No. Can you turn back? No. Can you fly off sideways? Only in an advertisement for underpants specially made for jumping off roofs. All free will means is you can choose whether to fart in mid-flight or wait till you hit the ground. And that\u0027s what all the philosophers argue about.\n UGLI 666\n Nutcracker, you\u0027re always trying to turn any conversation into a farting match. I must say sometimes you manage it.\n Monstradamus\n Stop it will you, you\u0027re like little children. Let\u0027s just drop it. Why don\u0027t you tell us about this screen-saver, Organism?\n Organizm(-:\n It\u0027s a standard program. If you don\u0027t touch the keyboard for a few minutes, a labyrinth with red-brick walls appears on the screen, with a camera moving through it. It has all sorts of bells and whistles, like stones that turn everything upside down when you bump into them. The ceiling becomes the floor, the floor becomes the ceiling, and the camera starts turning in the opposite direction at the forks in the path. There\u0027s a big rat in the labyrinth too. I\u0027ve actually got two screen-savers like that. The first one appears on the screen when I forget about you lot for a long time. And the second is right outside my door, constructed fairly accurately out of plywood and planks. It even has a rat in it - a kind of little mat with a plush face and paws sewn on to it. Sometimes the rat is lying in the passage. Sometimes it\u0027s glued to the ceiling. There are tumble-stones too, blocks of grey plastic. Only they don\u0027t turn anything upside down. If you touch one of them, the maze freezes.\n Nutscracker\n What do you mean, it freezes?\n Organizm(-:\n That\u0027s what I call it, like a computer program. What happens is, the light goes out and a panel lights up above the tumble-stone: \u0027This program has performed an illegal operation and will be shut down. If the problem persists, contact the program vendor.\u0027\n Nutscracker\n Then what happens?\n Organizm(-:\n I have to go home in the dark. And that\u0027s a bit of a drag, because the voices start to get on my nerves.\n Nutscracker\n What voices?\n Organizm(-:\n All kinds. Quiet and loud. Women, men, even children. Sometimes far away. Sometimes close up.\n Nutscracker\n So what do these voices say?\n Organizm(-:\n Always the same thing: \u0027I am the vendor, I am the vendor. What will you do? What can you do?\u0027\n Nutscracker\n Yes, you\u0027ve been screwed all right. And doesn\u0027t Bull Gates ever get in touch?\n Organizm(-:\n No, he doesn\u0027t.\n Nutscracker\n Maybe he does, but you just don\u0027t understand. Maybe the Minotaur\u0027s actually the dead rat on the ceiling.\n Organizm(-:\n Maybe. Anyway, if you don\u0027t touch these stones, and avoid doing a couple of other things, you can walk right round the labyrinth without any bother. And then you realise fairly quickly it\u0027s not a real labyrinth at all, just a big concrete cellar with plywood partitions.\n Nutscracker\n Have you tried breaking down the partitions?\n Organizm(-:\n If you shift them even slightly, the whole thing freezes instantly. Then you have to find your way out in the dark and listen to those voices. It\u0027s better not to touch anything.\n Nutscracker\n Have you reached the centre then?\n Organizm(-:\n Yes, I have.\n Nutscracker\n And what\u0027s in it?\n Organizm(-:\n A little room with the words \u0027Open GL\u0027 on the wall. The real screen-saver has the same words, but they hang in the air there, and here they\u0027re daubed on the plywood in gloss paint. What does that mean, anyway?\n Nutscracker\n Do you know, Monster?\n Monstradamus\n Open General License. Or maybe Open Great Labyrinth.\n Nutscracker\n So there\u0027s nothing but those words in the central room, Organism, is that right?\n Organizm(-:\n There\u0027s a chair as well, with a mirror in front of it.\n Nutscracker\n I can guess. Tarkovsky\u0027s Mirror.\n Organizm(-:\n I sat there for ages and ages. I had the feeling I was about to understand the most important thing of all at any moment. But I didn\u0027t understand a thing.\n Monstradamus\n That\u0027s always the way.\n Organizm(-:\n What do you mean? Always the way when you sit looking into a mirror for a long time?\n Monstradamus\n Always the way when you feel you\u0027re just about to understand something important. It\u0027s like the whistle of a bullet or the roar of an aeroplane. If you can hear them, it means they\u0027re already zooming past you.\n Nutscracker\n Organism, why are you so sure the centre of the labyrinth is where the mirror and the chair are?\n Organizm(-:\n Because of the mirror and the chair. What else would they be doing there?\n Monstradamus\n That seems pretty obvious.\n Nutscracker\n So what have you got, Monster? I\u0027m dying of curiosity.\n Monstradamus\n You go first, we agreed.\n Nutscracker\n Okay. I\u0027ll tell you what I\u0027ve got. It\u0027s a bit like a TV editing room. Professional equipment - a Betacam VCR, a special monitor, all sorts of mixers for functions I don\u0027t really understand. The whole works. There\u0027s a weird-looking poster hanging on the wall, a picture of a dog in an empty white room. On the wall in front of the dog there\u0027s something like a distribution board with a few little lamps screwed into it. Two of them are lit up - a red one on the left and a blue one on the right. And below the lamps there\u0027s a bell, surrounded by drawings of sound waves - it\u0027s obviously ringing. There\u0027s an electrode inserted into the dog\u0027s head, with wires leading from it to the distribution board. And there\u0027s a cut on its belly stuck together with sticking plaster and a rubber tube leading down out of it into a glass flask standing on the floor. The dog\u0027s right paw is raised, its tongue is hanging out, its ears are pricked up and its eyes are full of love. The text underneath it reads: \u0027Put it there, bro!\u0027 The first time I saw it I just froze. I wondered how the moderators could have found out. It was only afterwards I remembered I told you all about \u0027Pavlov\u0027s Bitch\u0027. Standing under the poster there\u0027s a safe full of Betacam tapes with episodes of \u0027The Hornists of Plenitude\u0027 - that\u0027s a kind of chic international TV programme, it has these interesting titles, with the globe flanked by two bugles. The tapes all contain pretty much the same thing: a television address by someone putting himself forward for the job of Theseus. In most cases the candidate is a middle-aged man with a pleasant face and good diction. He\u0027s sitting in front of some kind of symbol, with a dozen microphones standing on a table in front of him. He promises to deal with the Minotaur and lead everyone out of the labyrinth. Before that, naturally, he expounds his own vision of what the labyrinth is and who the Minotaur is.\n Monstradamus\n What kind of visions are they?\n Nutscracker\n All sorts.\n Monstradamus\n How about an example?\n Nutscracker\n Well, take the last one for instance. The candidate was a tall man with grey hair. A professor of history, very distinguished looking, stylishly dressed. And his symbol was beautiful, a bit like a knight\u0027s coat of arms: a bull\u0027s skull in a net against a hatched ground. The man said the labyrinth is a symbol of the brain. An exposed brain and a classical labyrinth even look very similar. The Minotaur is the animal part of the mind and Theseus is the human part. The animal part is stronger, of course, but the human part triumphs in the end, and this is the meaning of evolution in history. At the very centre of the labyrinth there is a cross that symbolises the intersection of the animal and human principles. That is the site of the initiatory passage, where Theseus meets and conquers his enemy. He said you can only conquer the Minotaur in yourself. We must strangle the beast without mercy, and then we will be morally justified in renaming the Helmet of Horror the Helmet of Civilisation and Progress.\n Monstradamus\n And what was his program like?\n Nutscracker\n In the labyrinth you have to turn twice to the right and once to the left, then twice to the right and once to the left again, and so on right to the end.\n Monstradamus\n Tell us about another one then.\n Nutscracker\n The last but one. A Frenchman. He was definitely the cleverest of the lot, and his appearance was very picturesque - a threadbare Chinese field jacket, with a pipe and a wild shock of hair. His symbol was a red and white chessboard with butterflies on the white squares and letters from various alphabets on the red ones. For the first few minutes he just stared into the camera, then he ruffled up his hair and announced that he would start with a truism. The major achievement of contemporary French philosophy, he said, was its success in establishing a non-contradictory unity of liberal values and revolutionary romanticism within the bounds of a unitary sexually aroused consciousness. After that he glared out of the screen for at least a minute without speaking, then he raised a finger and explained in a whisper that this declaration, despite its crystal clarity, is already a labyrinth, for a labyrinth comes into being in the course of any discussion with yourself or others, and for that period of time each of us becomes either the Minotaur or his victim. Although there is nothing we can do with this, he continued, there\u0027s nothing we can do without it either. Specifically, however, we can introduce a broader concept than the labyrinth - we can declare a discourse.\n Monstradamus\n Oh Mama! When I hear the word \u0027discourse\u0027, I reach for my simulacrum.\n Nutscracker\n According to the shaggy professor, a discourse is the place in which words and concepts, labyrinths and Minotaurs, Theseuses and Ariadnes all come into being. Even the discourse itself can only come into being within the discourse. But the paradox is that, although the entirety of nature arises within it, the discourse itself is not encountered anywhere in nature and was only developed quite recently. Another tragic dissonance is that, although everything comes into being within the discourse, without funding from the state or private individuals the discourse itself only lasts for three days at the most and is then extinguished forever. And so there can be no more urgent task for society than to fund the discourse.\n Monstradamus\n Okay, I understand about the discourse, but what did he say about the labyrinth?\n Nutscracker\n When he was talking about the labyrinth he spoke very quickly, so I don\u0027t remember it all. Basically, a labyrinth comes into being when you have to choose between several alternatives, and the alternatives are a set of our possible preferences, conditioned by the nature of language, the structure of the moment and the specific features of the sponsor. I didn\u0027t understand very much after that, I only remember that at some point he launched into the \u0027Internationale\u0027, and at first he sang really loudly and menacingly, but after a minute he shifted into \u0027Happy birthday to you\u0027.\n Monstradamus\n That\u0027s called the plurality of discourses. I remember that from university. And what did he say about the Minotaur?\n Nutscracker\n The Minotaur is you. \n","sourceLink":"https://allnovel.net/the-helmet-of-horror/page-13.html","bookId":2606,"book":{"id":2606,"title":"The Helmet of Horror","description":"Storyline: \n Victor Pelevin, the iconoclastic and wildly interesting contemporary Russian novelist who The New Yorker named one of the Best European Writers Under 35, upends any conventional notions of what mythology must be with his unique take on the myth of Theseus and the Minotaur. By creating a mesmerizing world where the surreal and the hyperreal collide, The Helmet of Horror is a radical retelling of the myth of Theseus and the Minotaur set in an Internet chat room. They have never met, they have been assigned strange pseudonyms, they inhabit identical rooms that open out onto very different landscapes, and they have entered a dialogue they cannot escape - a discourse defined and destroyed by the Helmet of Horror. Its wearer is the dominant force they call Asterisk, a force for good and ill in which the Minotaur is forever present and Theseus is the great unknown. The Helmet of Horror is structured according to the way we communicate in the twenty-first century - using the Internet - yet instilled with the figures and narratives of classical mythology. It is a labyrinthine examination of epistemological uncertainty that radically reinvents this myth for an age where information is abundant but knowledge ultimately unattainable.\n \n","cover":"https://allnovel.net/images/the-helmet-of-horror.jpg","author":"Victor Pelevin","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-helmet-of-horror.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:31:44 PM"}}
