{"id":98157,"no":17,"title":"Page 17","content":"Nutscracker Would that be the one at the centre of the separator labyrinth? UGLI 666 Do not waste your final moments in blasphemy! Sartrik What the hell\u0027s going on out there? Stop it! IsoldA Romeo! Goodbye, you bastard! Ariadne My door\u0027s getting hot. Are yours? Nutscracker I\u0027m stifling. Something ... Monstradamus It\u0027s him. Theseus MINOTAURUS! Monstradamus: Ah? IsoldA: Ah? Nutscracker: Ah? Organizm(-: Ah? Theseus: Ah? Ariadne: Ah? UGLI 666: Ah? Romeo-y-Cohiba: Ah? TheZeus Fuck U Monstradamus: MOOOOOO! IsoldA: MOOOOOO! Nutscracker: MOOOOOO! Organizm )-: MOOOOOO! Theseus: MOOOOOO! Ariadne: MOOOOOO! UGLI 666: MOOOOOO! Romeo-y-Cohiba: MOOOOOO! Organizm(-: Ladies and gents, I don\u0027t get it - what was that? Nutscracker I think it\u0027s getting cooler. And the noise has stopped. IsoldA What, don\u0027t you understand? It\u0027s Theseus! Romeo-y-Cohiba Theseus! How we\u0027ve longed for you to come! Monstradamus Theseus. At last. Where are you? What do you see around you? UGLI 666 Hmmm. Organizm(-: Theseus, answer! Nutscracker Stop it. It\u0027s pointless. UGLI 666 He\u0027s given us the slip. Monstradamus Has he really gone? Nutscracker Yes. IsoldA But of course ... UGLI 666 There is no more Minotaur. Ariadne Hang on, papa. Monstradamus: My son! IsoldA: My son! Nutscracker: My son! Organizm(-: My son! Sartrik: My son(-: :-((((( Organizm(-: Why don\u0027t we look for him? Maybe he still believes? Monstradamus In what? Organizm(-: Well, in the whole pile of xxx. That he has a body. And it\u0027s in a room. Ariadne He never did believe in that. Romeo-y-Cohiba You could say he saved us. He could have just killed us all once he\u0027d seen us. Nutscracker No he couldn\u0027t. Then he\u0027d never have got the helmet off. He isn\u0027t kind, he just knew. Ariadne What I\u0027ve heard is that if anyone knows then it\u0027s precisely because he is kind. Nutscracker And what I\u0027ve heard is that if anyone\u0027s kind then it\u0027s precisely because he knows. Organizm(-: What difference does it make to us? How did we give ourselves away? UGLI 666 We get distracted. Make too much fuss. Talk off the point, all this stuff about Versailles and Mona Lisa. IsoldA Ugly, you don\u0027t mind us living here, do you? UGLI 666 This time it was Ariadne who blurted everything out. That\u0027s why he gave us the slip. Monstradamus What do you suggest? UGLI 666 Not to tell him anything. Nutscracker That\u0027s going too far. Then how will he find out he\u0027s wearing a helmet? We can\u0027t put something that doesn\u0027t exist on his head just like that. We have to explain. And it\u0027s best to start from childhood. Not so he understands everything, though, just enough for him to do it all to himself. Ariadne\u0027s our best guide round the labyrinth. She\u0027s very skilful at it. UGLI 666 Nutcracker, you\u0027re talking about what she ought to do. I\u0027m talking about what she\u0027s already done. And anyway, I beg your pardon, but what has skill got to do with it? The labyrinth is any route the Helmholz has been led along. Monstradamus That\u0027s right, any route. But it seems like a very long time since anyone walked round your route, Ugly. Sartrik What ... What route is that? Monstradamus Back with us again, hero? Ladies and gents, a joke. Imagine Sartrik wakes up with a massive hangover. He can\u0027t remember anything about the previous day. There\u0027s a pool of blood beside him. He\u0027s surrounded by a labyrinth. But there\u0027s no Minotaur anywhere. Sartrik raises his eyes to the ceiling and whispers in horror: \u0027I killed him ... Killed him and ate him ...\u0027 IsoldA What\u0027s funny about that? That\u0027s exactly how it happened. UGLI 666 Your joke\u0027s older than the labyrinth, Monstradamus. Let\u0027s discuss the serious situation we\u0027re in. Some day Ariadne will be the death of us. IsoldA Stop stirring things up, Ugly. It\u0027s not Ariadne\u0027s fault at all. Sartrik blurted it all out in a drunken stupor. Sartrik You always blame everything on Sartrik. IsoldA You should be xxx to xxx. Why did you butt in? What for? Lousy drunk. Monstradamus But how did he actually find out the Name? UGLI 666 Ariadne gave away the whole thing to him in so many words. Nutscracker Then why hasn\u0027t he dissolved the lot of us if he knows the Name? Monstradamus He has. It just seems to us in here that he\u0027s dissolved himself. UGLI 666 Ariadne, maybe you can explain what made you like him more than us? Ariadne Oh, go to hell. You can lead him round the labyrinth instead of me. UGLI 666 I\u0027ll come back to you about this. I\u0027ll show you up for what you are. Romeo-y-Cohiba I don\u0027t understand - who\u0027s responsible? Ariadne or Sartrik? UGLI 666 Ariadne\u0027s to blame. She was beside Theseus in the MINOTAUR and they got too cosy. Ariadne You be careful who you go yapping at. Or you\u0027ll wind up lost forever in that cathedral of yours, get it? You\u0027re here on my thread. And there isn\u0027t any other. UGLI 666 Did you all hear that? Did you hear it? Papa, have you thought where we\u0027ll all end up when she goes running off to that snake? Nutscracker Don\u0027t be such a Cassandra. Organizm(-: What are we going to do here now? Monstradamus What are we going to do? Carry on with the discourse. Nutscracker I know that. But in what capacity? Monstradamus You\u0027ve only got the capacity for doing one thing, Nutcracker. Staring into that screen, like Pavlov\u0027s bitch gazing into Tarkovsky\u0027s mirror.","sourceLink":"https://allnovel.net/the-helmet-of-horror/page-17.html","bookId":2606,"book":{"id":2606,"title":"The Helmet of Horror","description":"Storyline: Victor Pelevin, the iconoclastic and wildly interesting contemporary Russian novelist who The New Yorker named one of the Best European Writers Under 35, upends any conventional notions of what mythology must be with his unique take on the myth of Theseus and the Minotaur. By creating a mesmerizing world where the surreal and the hyperreal collide, The Helmet of Horror is a radical retelling of the myth of Theseus and the Minotaur set in an Internet chat room. They have never met, they have been assigned strange pseudonyms, they inhabit identical rooms that open out onto very different landscapes, and they have entered a dialogue they cannot escape - a discourse defined and destroyed by the Helmet of Horror. Its wearer is the dominant force they call Asterisk, a force for good and ill in which the Minotaur is forever present and Theseus is the great unknown. The Helmet of Horror is structured according to the way we communicate in the twenty-first century - using the Internet - yet instilled with the figures and narratives of classical mythology. It is a labyrinthine examination of epistemological uncertainty that radically reinvents this myth for an age where information is abundant but knowledge ultimately unattainable.","cover":"https://allnovel.net/images/the-helmet-of-horror.jpg","author":"Victor Pelevin","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-helmet-of-horror.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:31:44 PM"}}
