{"id":44922,"no":40,"title":"CHAPTER XXXVIII. PENAL CHRISTIANITY","content":"Predatory Christianity would not be far from the mark. Christianity is of the nature of a penal settlement where independent-minded persons are made to expiate the sin of thinking for themselves. There can be no real goodwill in any one who is not for justice and equality. No cause can command respect, or can claim a hearing from others which is not based on absolute fairness. Many well-meaning Christians never inquire whether the great cause they have at heart fulfils this condition. In the past this omission has been a lasting cause of alienation from their views. Between 1850 and 1860 there sat in St. Bride\u0027s Vestry, London, a group of Christian churchwardens who twice a year sent agents to seize property from my house in Fleet Street, because I refused to pay tithes. Yet there are people who tell us without tiring, of the depravity of the French revolutionists and atheists who laid, or proposed to lay hands upon Church property. Yet these Christian officers, acting under the eye of an opulent rector in the wealthiest capital in the world, seized clocks and bales of paper on the premises of heretics, in the name of the Church! Did not this disqualify the Church as ministers of consolation? The greatest consolation is justice. Is it not spiritual effrontery to despoil a man, then invite him to the communion table? In our day by predatory acts, they confiscate Nonconformist property to maintain Church schools. Can it be that heaven recognised agents engaged in petty larceny? Are they intrusted with the keys of heaven? May the priest be a thief? Can a man expect to be admitted at the Golden Gate with a burglar\u0027s passport in his hand? There exist penal laws against all who do not stand on the side of faith, which Nonconformists as well as Churchmen connive at, profit by, and maintain. Is not this destructive of their spiritual pretensions? Can they preach of holiness and truth without a blush? No higher criticism can condemn Christianity, as it is self condemned by resting on predatoriness. No person who does not stand on the Christian side can leave property for promoting his views, as a Christian can for promoting his. No Christian conscience is touched at this disadvantage imposed upon the independent thinker. No sermon is preached against it. No Christian petition is ever set up against it. Neither the Church conscience nor the Nonconformist conscience is stirred by the existence of this injustice. It would cease if they objected to it. But they do not object to it. There are prelates, priests, clergymen, and Nonconformist ministers personally to be respected, who in human things I trust. But for their spiritual vocation, is it possible to have respect or trust? To tender consolation with one hand while they keep the other in my pocket is an act never absent from my mind. I belong to a Secular party who seek improvement by material means; but were there any body of Christians upon whom that party imposed legal disadvantages in its own interest, and kept them there by silence or connivance, Parliament would hear from me pretty frequently until the insulting privileges were annulled. Any pretension to having principles worthy of acceptance, or regard, or even respect, would be impertinence in us so long as we were unfair to others. I caused to be brought into Parliament a Bill in which Sir Philip Manfield took the leading interest, entitled:— Civil and Religious Liberty Extension. A BILL To secure the Extension of Civil and Religious Liberty. (Prepared and brought in by Mr. Manfield, Sir Henry Boscoe, Sir Geo. B. Sitwell, Mr. Picton, Mr. Illingworth, Mr. W. McLaren, Mr. H. P. Cobb, Mr. Howell, Mr. Chas. Feiiwick, Mr. Benn, Mr. Storey, and Mr. Hunter.) Ordered, by The House of Commons, to be Printed, 7 November 1893. PRINTED BY EYRE AND SPOTTISWOODE, PRINTERS TO THE QUEEN\u0027S MOST EXCELLENT MAJESTY. And to be purchased, either directly or through any Bookseller, from Eyre \u0026 Spottiswood, East Harding Street, Fleet Street, B.C., and 32, Abingdon Street, Westminster, 8.W.; or John Menzies \u0026 Co., 19, Hanover Street, Edinburgh, and 90, West Nile Street, Glasgow; or Hodges, Ptoois 6 Co., Limited, 104, Grafton Street, Dublin. [Price 1d.] [Bill 464.] Memorandum. This Bill comprises but a small extension of religious equality. Its object is to enable a man \"to do what he likes with his own\" for admittedly lawful purposes. It is affirmed by legal decisions that any man may believe what he pleases, speak what he pleases, publish his honest conviction, provided he does it in a temperate and considerate manner; and he may, while living, give money to maintain his views. All this Bill seeks is that he may, at his death, bequeath money for such purpose. This Bill merely proposes to extend a right which Christians of every denomination enjoy, but which hitherto has been denied to those who may conscientiously object to prevailing opinions. BILL TO Secure the Extension of Civil and Religions Liberty. WHEREAS 1 it is expedient to remove the Disabilities under which persons suffer desirous of endowing, creating, and maintaining charitable and other Trusts for religious and ethical inquiry, so as to further extend civil and religious liberty: 2 Nothing contained in this Act shall affect or be deemed to repeal or contravene in any way such parts of the Act 9 George II., cap. 36, relating to Mortmain as remain unrepealed, or any other Act amending or altering such Act; and the provisions of all such Acts now in force shall apply to all Trusts created under this Act. 3 After the passing of this Act, notwithstanding any Act, Rule of Common Law, Rule of Equity, or Rule of Practice of any Court of Justice now in force to the contrary, it shall be lawful for any person to create and endow, or create or endow, any Trust for inquiry into the foundations and tendency of religious and ethical beliefs which from time to time prevail, or for the maintenance and propagation of the results of such inquiry. And the method of application of Bequests made for the purposes aforesaid shall be, on the part of those responsible for their administration, subject to revision at intervals of thirty years. 4 Such Trust, whether created by Deed or Will, or by other instrument, shall be deemed a charitable Trust, and shall be administered and given effect to in all respects in as full and complete a manner as in the case of religious and charitable Trusts now recognised by Law; and the doctrine of Cy-pres shall be applied to it when circumstances shall arise requiring the application of such doctrine. This Bill was not proceeded with. It required a member like Samuel Morley, of known Christianity and a conscience, to carry it through the House. A theory has been started that by registering an association, under the Friendly Societies Act, it would legalise its proceedings and virtually repeal all the laws confiscating bequests. No case of this kind has come before the higher courts. To do the Government justice, I know no case in which the Crown has interfered to confiscate a bequest on the ground of heresy in its use. Members of families, legally entitled to the property of a testator, may claim the money and get it. If the family enters no claim the bequest takes effect. In the meantime the state of the law prevents testators leaving property for the maintenance of their opinions, and Christians bring charges against philosophical thinkers for lack of generosity in building halls as Christians do chapels. The Christian reproaches the philosopher for not giving, when he has confiscated the bequest of the philosopher and the power of giving. Priests often mourn at the disinclination to listen to the tenets they proclaim, and advertise in the newspapers the melancholy fact that only one person in five is found on Sunday in a place of worship, and do not remember how many persons remain away, not so much from dislike of the tenets preached, as from dislike of the injustice which they would have to share if they belonged to any Christian communion. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3193/87310.html","bookId":841,"book":{"id":841,"title":"Bygones Worth Remembering","description":"简介： It was a saying of Dryden that Anything, though ever so little, which a man speaks of himself, in my opinion, is still too much. This depends upon what a writer says. No man is required to give an opinion of himself. Others will do that much better,...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3193","creation":"Aug 1, 2019 12:23:32 AM","modification":"Aug 1, 2019 12:23:32 AM"}}
