{"id":44929,"no":47,"title":"CHAPTER XLV. IDEAS FOR THE YOUNG","content":"There are people who live many years and never grow old. We call them \"young patriarchs.\" Limit not the golden dreams of youth, which, however, would be none the worse for a touch of the patriarch in them. There is sense in youth, and it will assimilate the experience of age if displayed before rather than thrust upon it. Youth should be incited to think for itself, and to select from the wisdom it finds in the world. Then the question comes—what is safe to take? That is the time for words of suggestion. Every one has read of the fox, who seeing a crow with a piece of cheese in her bill, told her \"she had a splendid voice, and did herself an injustice by not singing.\" The credulous crow began a note, dropped the piece of cheese, with which the fox ran away. This trick is always being played. Among young persons there are a great number of crows. A youth is given a situation where advancement goes with assiduity. A fox-headed comrade or clerk below him tells him his \"work is beneath his talents, and he ought to get something better.\" Discontent breeds negligence. He loses his place, when the treacherous prompter, whom he took to be his friend, slips into his situation, and finds it quite satisfactory. In public affairs, in which youth seldom takes part, many are confused by pretences which they understand when too late. A person puts forward an excellent project, and finds it assailed and disparaged by some one he thought would support it. Discouraged by opposition, he comes to doubt the validity of the enterprise he had in hand. When he has abandoned it he finds it taken up by the very person who denounced it, and who claims credit for what he has opposed. All the while he has thought highly of the scheme, but wanted to have the credit of it himself, and therefore defamed it until he could get it into his own hands. This sort of thing is done in Parliament as well as in business. It is only by listening to the experience of others that youth can acquire wariness and guard against serious mistakes. The young on entering life are often dismayed by dolorous speeches by persons who have never comprehended the nature of the world in which they find themselves. People are told \"a great crisis in public affairs is at hand.\" There never was a time in the history of the world when a \"crisis\" was not at hand. Nature works by crises. Progress is made up of crises through which mankind has passed. Again there breaks forth upon the ears of inexperienced youth the alarming information that society is \"in a transition state.\" Every critic, every preacher, every politician, is always saying this. Yet there never was a time when society was not in a \"transition state.\" According to the Genesian legend, Adam discovered this in his day, when, a few weeks after his advent, he found himself outside the gates of Paradise, and all the world and all the creatures in it thrown into a state of unending perturbation and discomfort which has not ceased to this day. The eternal condition of human life is change, and he who is wise learns early to adapt himself to it. As Dr. Arnold said, there is nothing so dangerous as standing still when all the world is moving. The young are bewildered by being left under the impression that they should learn everything. Whereas all they need is to know thoroughly what their line of duty in life requires them to know. No man can read all the books in the British Museum, were arrangements made for his sleeping there. No one is expected to eat all he finds in the market, but only so much as makes a reasonable meal. Lord Sherbrooke translated from the Greek guiding lines of Homer who said of a learner of his day:— \"He could not reap, he could not sow, Nor was he wise at all: For very many arts he knew, But badly knew them all.\" The conditions of personal advancement can only be learned by observing the steps of those who have succeeded. Disraeli, whose success was the wonder of his time, owed it to following the shrewd maxim that he who wants to advance must make himself necessary to those whom he has the opportunity of serving. This can be done in any station in life by skill, assiduity and trustworthiness. Practical thoroughness is an essential quality which gives great advantage in life. Spurgeon had a great appreciation of it A servant girl applied to him for a situation on the ground that she \"had got religion.\" \"Yes,\" said the great pulpit orator, \"that is a very good thing if it takes a useful turn; but do you sweep under the mats?\" he asked, cleanliness being a sign of godliness in the eyes of the sensible preacher. Cleanliness is possible to the very poorest—walls which have no paper might have whitewash. Children should never see dirt anywhere. They should never come upon it lying out of sight. Fever and death lurk in neglected corners. Children may be in rags, but if they are clean rags and the children are clean, they are, however poor, respectable. When I first went to speak in Glasgow, it was in a solemn old hall, up a wynd. The place was in the Candleriggs. Everybody knows what a dark, clammy, pasty, muddy, depressing thoroughfare is the Candleriggs in wintry weather. The passage leading to the lecture hall and the steps which had to be ascended were all murky and dirty; as in those days the passage leading to the publishing house of the Chambers Brothers was, as I have seen it, an incentive to sickness. My payment for lecturing was not much, but out of it I gave half a crown to an active woman I found in the wynd to wash down the stairs and the passage leading to the Candleriggs, and the space as wide as the passage along the causeway to the curb-stone. People passing along might see signs of cleanliness leading to the hall. I never forget what the woman said to some of the assembly as they passed by her: \"I don\u0027t know what this man (or \"mon\") is, who you have to lecture to you to-day, but at least he has clean principles.\" That was precisely the impression I wanted to create. My tenets might be poor, my arguments badly clothed, but to present them in a clean state was in my power. Do not readily be deterred from a good cause because you will be told it is unprofitable, but take sides with it if need be. You will find persons born with a passion of putting the world to rights. A very good passion for the world, but now and then a very bad thing for him who is moved by it They have no engagement to undertake that work, no salary is allotted for it, nor even any income coming in to pay expenses \"out of pocket,\" as the prudent, open-eyed lawyer puts it. Nevertheless, it may be well to follow the Jewish rule of giving a tithe of your time to the public service. There are a large amount of tithes contributed in other ways which are not half so beneficial to mankind. Many whose names now are luminous in history, whose fame is on every tongue, have been personally known to the old. The magical notes of great singers the living can never know, the triumphs of the great masters of speech in Parliament and on the platform, whom it was an education to hear—only the old can recount. What they looked like, and how they played their memorable parts, are the enchanting secrets of the old, who tell to the young what passed in a world unknown to them, and which has made them what they are. The purport of this chapter is to stimulate individuality and self-reliance. Disraeli\u0027s maxim of self-advancement was to make himself necessary by service in the sphere in which he found himself. In public affairs committees are not, as a rule, suggestive; they can amend what is submitted to them; they originate nothing, and generally take the soul out of any proposal brought before then. If they advance business it is when some individual provides a plan to which their consent may be of importance. Individual ideas have been the immemorial source of progress. A committee of one will often effect more than a committee of ten; but the committee of ten will multiply the force of the one, and lend to it influence and authority. Seeing that ideas come from individuals, a young person cannot do better in life than by considering himself a committee of one, and ponder himself on every matter of importance. This gives a habit of resourceful thought—renders him cautious in action, and educates him in responsibility. In daily life a man has continually to decide things for himself without the aid of a committee. It is thus that self-trust becomes his strength. If youth could see but a little with the eyes of their seniors, some pleasures would seem less alluring, and they would avoid doing some things which they will regret all their lives. Now and then some young eye will glance at a page of bygone lore and see a gleam of inspiration, like a torch in a forest, which reveals a bear in a bush which he had chosen for a picnic, or discovers a bog which he had taken to be solid ground. Proverbs come around the young observer, so fair seeming he trusts them on sight, and does not know they are only in part guiding and in part elusive, and have limitations which may betray him into confident and futile extremes. Even professors will beguile him with statements which he doubts not are true, and finds, all too late, that they are false. He will hear forebodings which fill him with alarm at some new undertaking, not knowing that they are but the sounds of the footfalls of Progress, which every generation has heard, the ignorant with terror, and the wise with gladness. Only the relation of bygone experiences can save the young from perilous illusions. Of course, youth is always asked to look at things with the eyes of age, but they never do. They never can do it, because the eyes of the old look at things with the light of experience which, in the nature of things, youth is without. Nevertheless, the experience of others may be good reading for them. If in the generous eagerness of youth the heart inclines to a forlorn hope, take it up notwithstanding its difficulties, for if youth does not, older people are not likely to attempt it. The older are mostly too prudent to do any good in the way of new enterprise. This is where youth has its uses and its priceless advantage. However, it is well not to let enthusiasm, noble as it may be, blind the devotee. Take care that the cause espoused is sound. Take heed of the Japanese maxim, \"The lid, if the pot be broken, It is no use mending.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3193/87317.html","bookId":841,"book":{"id":841,"title":"Bygones Worth Remembering","description":"简介： It was a saying of Dryden that Anything, though ever so little, which a man speaks of himself, in my opinion, is still too much. This depends upon what a writer says. No man is required to give an opinion of himself. Others will do that much better,...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3193","creation":"Aug 1, 2019 12:23:32 AM","modification":"Aug 1, 2019 12:23:32 AM"}}
