{"id":44930,"no":48,"title":"CHAPTER XLVI. EXPERIENCES ON THE WARPATH","content":"The late Archbishop of Canterbury spoke derisively of agitators. The Rev. Stewart Headlam asked whether \"Paul, and even our Lord Himself, were not agitators.\" Mr. Headlam might have asked, where would the Archbishop be but for that superb, irrepressible agitator Luther? The agitator is a public advocate who speaks when others are silent. Mr. C. D. Collet, of whom I here write, was an agitator who understood his business. Agitation for the public welfare is a feature of civilisation. In a despotic land it works by what means it can. In a free country it seeks its ends by agencies within the limits of law. The mastery of the means left open for procuring needful change, the right use, and the full use of these facilities, constitute the business of an agitator. For more than fifty years I was associated with Mr. Collet in public affairs, and I never knew any one more discerning than he in choosing a public cause, or on promoting it with greater plenitude of resource. Many a time he has come to my house at midnight to discuss some new point he thought important. A good secretary is the inspirer of the movement he represents. Mr. Collet habitually sought the opinion of those for whom he acted. Every letter and every document was laid before them. On points of policy or terms of expression he deferred to the views of others, not only with acquiescence, but willingness. During the more than twenty-four years in which I was chairman of the Travelling Tax Abolition Committee and he was secretary, I remember no instance to the contrary of his ready deference. His fertility of suggestion was a constant advantage. Mr. Bright and Mr. Cobden (who had an instinct of fitness) would select the most suitable for the purpose in hand. In early life Mr. Collet had studied for the law, and retained a passion for it which proved very useful where Acts of Parliament were the barricades which had to be stormed. Mr. Collet was educated at Bruce Castle School, conducted by the father of Sir Rowland Hill. Collet\u0027s political convictions were shown by his becoming secretary for the People\u0027s Charter union, intended to restore the Chartist movement (then mainly under Irish influence) to English hands. In 1848, he and W. J. Linton were sent as deputies to Paris, as bearers of English congratulations on the establishment of the Republic. Afterwards he fell himself under the fascination of an Oriental-minded diplomat, David Urquhart, and became a romantic Privy Council loyalist. Mr. Urquhart was Irish, eloquent, dogmatic, and infallible—at least, he put down with ostentatious insolence any one who ventured to demur to anything he said. If the astounded questioner pleaded that he was ignorant of the facts adduced, he was told his ignorance was a crime. Mr. Urquhart believed that all wisdom lay in treaties and Blue Books, and that the first duty of every politician was to insist on beheading Lord Palmerston, who had betrayed England to Russia. How Mr. Collet—a lover of freedom and inquiry—could be subjugated by doctrines which, if not conceived in madness, were commanded by arts akin to madness, is the greatest mystery of conversion I have known. I have seen Mr. Bright come out of the House of Commons, and observing Mr. Collet, would advance and offer his hand, when Mr. Collet would put his hands behind him, saying \"he could not take the hand of a man who knew Lord Palmerston was an impostor and ought to know he was a traitor, and still maintained political relations with him.\" Yet Mr. Collet had great and well-founded regard for Mr. Bright. It was an intrepid undertaking to attempt a repeal of taxes which for 143 years had fettered, as they were designed to do, knowledge from reaching the people. The history of this achievement was given in the Weekly Times and Echo, While these taxes were in force, neither cheap newspapers nor cheap books could exist. Since their repeal great newspapers and great publishing houses have arisen. While these Acts were in force every newspaper proprietor was treated as a blasphemer and a writer of sedition, and compelled to give securities of ￡300 against the exercise of his infamous tendencies; every paper-maker was regarded as a thief, and the officers of the Excise dogged every step of his business with hampering, exacting, and humiliating suspicion. Every reader found with an unstamped paper in his possession was liable to a fine of ￡20. The policy of our agitation was to observe scrupulous fairness to every Government with which we came in contact, and to heads of departments with whom unceasing war was waged. Their personal honour was never confused with the mischievous Acts they were compelled to enforce. Our rule was steadfastness in fairness and courtesy. The cardinal principle of agitation Collet maintained was that the most effectual way to obtain the repeal of a bad law was to insist upon it being carried out, when its effect would soon be resented by those who maintain its application to others. Charles Dickens\u0027 \"Household Narrative of Current Events,\" published weekly, was a violation of the Act which required news to be a month old when published on unstamped paper. Dickens was not selected from malice, for he was friendly to the freedom of the press, but from policy, as an Act carried out which would ruin a popular favourite like Dickens, would excite indignation against it. A clamour was raised by friends in Parliament against the supineness of the Inland Revenue Board, for tolerating a wealthy metropolitan offender, while it prosecuted and relentlessly ruined small men in the provinces for doing the same thing. Bright called attention in the House to the Electric Telegraph Company, who were advertising every night in the lobbies news, not an hour old, on unstamped paper, in violation of the law. It took thirty years of supplication to get art galleries open on Sunday, when the application of the law to the privilege of the rich would have opened them in ten years. The rich are allowed to violate the law against working on Sundays, for which the poor man is fined and imprisoned. An intelligent committee on the Balfour-Chamberlain principle of Retaliation would soon put an end to the laws which hamper the progress. Professor Alexander Bain, remarkable for his fruitfulness in philosophic device, asked my opinion on a project of constructing a barometer of personal character, which varies by time and event. Everybody is aware of somebody who has changed, but few notice that every one is changing daily, for better or for worse. What Bain wanted was to contrive some instrument by which these variations could be denoted. No doubt men must be judged on the balance of their ascertained merits. Bishop Butler\u0027s maxim that \"Probability is the guide of life,\" implies proportion, and is the rule whereby character is to be judged. For years I conceived a strong dislike of Sir Robert Peel, because, as Secretary of State, he refused the petition of Mrs. Carlile to be allowed to leave the prison (where she ought never to have been sent) before the time of her accouchement Peel\u0027s refusal was unfeeling and brutal. Yet in after life it was seen that Sir Robert possessed great qualities, and made great sacrifices in promoting the public good; and I learned to hold in honour one whom I had hated for half a century. For many years I entertained an indifferent estimate of Sir William Harcourt. It began when my friend Mr. E. J. H. Craufurd, M.P., challenged him to a duel, which he declined—justifiably it might be, as he was a larger man than his antagonist, and offered a wider surface for bullets. Declining was meritorious in my eyes, as duels had then a political prestige, and there was courage in refusing. The cause of the challenge I thought well founded. In the earlier years of Sir William\u0027s Parliamentary life I had many opportunities of observing him, and thought he appeared as more contented with himself than any man is entitled to be on this side of the Millennium. When member for Oxford as a Liberal, he declared against payment of members of Parliament on the ground of expense. The expense would have been one halfpenny a year to each elector. This seemed to me so insincere that I ceased to count him as a Liberal who could be trusted. Yet all the while he had great qualities as a combatant of the highest order, in the battles of Liberalism, who sacrificed himself, lost all prospect of higher distinction, and incurred the undying rage of the rich (who have Canning\u0027s \"ignorant impatience\" of taxation) by instituting death duties, services which entitled him to honour and regard. I heard Lord Salisbury\u0027s acrid, sneering, insulting, contemptuous speeches in the House of Commons against working men seeking the franchise. What gave this man the right to speak with bitterness and scorn of the people whose industry kept him in the opulence he so little deserved? Some friends of mine, who had personal intercourse with him, described him as a fair-spoken gentleman. All the while, and to the end of his days, he had the cantankerous tongue in diplomacy which brought contempt and distrust upon Englishmen abroad, while his jests at Irish members of Parliament, whom his Government had subjected to humiliation in prison, denoted, thought many, the innate savagery of his order, when secure from public retribution—which people should remember who continue its impunity. Difference of opinion is to be respected, but it is difficult even for philosophy to condone scorn. If recklessness in language be the mark of inferiority in workmen, what is it in those of high position who compromise a nation by their ungoverned tongues? Among things bygone are certain ideas of popular influence which have had their day—some too long a day, judging from their effects. The general misconceptions in them still linger in some minds, and it may be useful to recall a prominent one. The madness of thoroughness are two words I have never seen brought together, yet they are allied oftener than most persons suppose. Thoroughness, in things which concern others, has limits. Justness is greater than thoroughness. There is great fascination in being thorough. A man should be thorough as far as he can. This implies that he must have regard to the rights and reasonable convenience of others, which is the natural limit of all the virtues. Sometimes a politician will adopt the word \"thorough\" as his motto, forgetful that it was the motto of Strafford, who was a despot on principle, and who perished through the terror which his success inspired. Cromwell was thorough in merciless massacres, which have made his name hateful in Irish memory for three centuries, perpetuating the distrust of English rule. Vigour is a notable attribute, but unless it stops short of rigour, it jeopardises itself. Thorough means the entire carrying out of a principle to its end. This can rarely be done in human affairs. When a person finds he cannot do all he would, he commonly does nothing, whereas his duty is to do what he can—to continue to assert and maintain the principle he thinks right, and persist in its application to the extent of his power. To suspend endeavour at the point where persistence would imperil the just right of others, is the true compromise in which there is no shame, as Mr. John Morley, in his wise book on \"Compromise,\" has shown. Temperance—a word of infinite wholesomeness in every department of life, because it means use and restraint—has been retarded and rendered repellent to thousands by the \"thorough\" partisans who have put prohibition into it Can absolute prohibition be enforced universally where conviction is opposed, without omnipresent tyranny, which makes it hateful instead of welcome? Even truth itself, the golden element of trust and progress, has to be limited by relevance, timeliness and utility. He who would speak everything he knows or believes to be true, to all persons, at all times, in every place, would soon become the most intolerable person in every society, and make lying itself a relief. A man should stand by the truth and act upon it, wherever he can, and he should be known by his fidelity to it But that is a very different thing from obtruding it in unseemly ways, in season and out of season, which has ruined many a noble cause. The law limits its exaction of truth to evidence necessary for justice. There are cases, such as occurred during the Civil War of emancipation in America, where slave-hunters would demand of the man, who had seen a fugitive slave, pass by, \"which way he had run.\" The humane bystander questioned, would point in the opposite direction. Had he pointed truly, it would have cost the slave his life. This was lying for humanity, and it would be lying to call it by any other name, for it was lying. Thoroughness would have murdered the fugitive. The thoroughness of the Puritans brought upon the English nation the calamities of the Restoration. Richelieu, in France, was thorough in his policy of centralisation. He was a butcher on principle, and his name became a symbol of murder. He circumvented everything, and pursued every one with implacable ferocity, who was likely to withstand him. He put to death persons high and low, he destroyed municipalism in France, and changed the character of political society for the worse. The French Revolutionists did but tread in the footsteps of the political priest. They were all thorough, and as a consequence they died by each other\u0027s hands, and ruined liberty in France and in Europe. The gospel of thoroughness was preached by Carlyle and demoralised Continental Liberals. In the revolution of 1848 they spared lives all round. They even abolished the punishment of death. But when Louis Napoleon applied the doctrine of \"thorough\" to the greatest citizens of Paris, and shot, imprisoned, or exiled statesmen, philosophers and poets, Madame Pulzsky said to me, the \"Republicans thought their leniency a mistake, and if they had power again they would cut everybody\u0027s throat who stood in the way of liberty.\" As usual, thoroughness had begotten ferocity. Carlyle\u0027s eminent disciples of thoroughness justified the massacre and torture of the blacks in Jamaica, for which Tennyson, Kingsley, and others defended Governor Eyre. Lord Cardwell, in the House of Commons, admitted in my hearing that there had been \"unnecessary executions.\" \"Unnecessary executions\" are murders—but in thoroughness unnecessary executions are not counted. Wherever we have heard of pitilessness in military policy, or in speeches in our Parliament, we see exemplifications of the gospel of Thoroughness, which is madness if not limited by justice and forbearance. Conventional thoroughness dwells in extremes. If political economy was thoroughly carried out, there might be great wealth, but no happiness. Enjoyment is waste, since it involves expenditure. The Inquisition, which made religion a name of terror, was but thoroughness in piety. Pope, himself a Catholic, warned us that— \"For virtue\u0027s self may too much zeal be had. The worst of madness is a saint run mad.\" Fanatics forget (they would not be fanatics if they remembered) that in public affairs, true thoroughness is limited by the rights of others. There is no permanent progress without this consideration. The best of eggs will harden if boiled too much. The mariner who takes no account of the rocks, wrecks his ship—which it is not profitable to forget. It is natural that those who crave practical knowledge of the unseen world should look about the universe for some chink, through which they can see what goes on there, and believe they have met with truants who have made disclosures to them. I have no commerce of that kind to relate. It is hard to think that when Jupiter is silent—when the Head of the Gods speaketh not—that He allows angels with traitor tongues to betray to men the mysteries of the world He has Himself concealed. Can it be that He permits wayward ghosts to creep over the boundary of another world and babble His secrets at will? This would imply great lack of discipline at the outposts of paradise. There is great fascination in clandestine communication with the kingdom of the dead. I own that noises of the night, not heard in the day, seem supernatural. The wind sounds like the rush of the disembodied—hinges creak with human emotion—winds moan against window panes like persons in pain. Creatures of the air and earth flit or leap in pursuit of prey, like the shadows of ghosts or the furtive steps of murdered souls. Are they more than \"The sounds sent down at night By birds of passage in their flight\"? For believing less where others believe more, for expressing decision of opinion which the reader may resent, I do but follow in the footsteps of Confucius, who, as stated by Allen Upward, \"declared that a principle of belief or even a rule of morality binding on himself need not bind a disciple whose own conscience did not enjoin it on him.\" Confucius, says his expositor, thus \"reached a height to which mankind have hardly yet lifted their eyes, and announced a freedom compared with which ours is an empty name.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3193/87318.html","bookId":841,"book":{"id":841,"title":"Bygones Worth Remembering","description":"简介： It was a saying of Dryden that Anything, though ever so little, which a man speaks of himself, in my opinion, is still too much. This depends upon what a writer says. No man is required to give an opinion of himself. Others will do that much better,...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3193","creation":"Aug 1, 2019 12:23:32 AM","modification":"Aug 1, 2019 12:23:32 AM"}}
