{"id":13557,"no":4,"title":"CHAPTER IV AT BEORMINSTER","content":"On their way to the inn, Herrick and his companion, met Bess Endicotte. She looked angry and her eyes sparkled as she advanced towards the two men. \n \n \"Isn\u0027t it a shame?\" she said rapidly, \"that verdict I mean. I don\u0027t believe that Frisco killed the Colonel.\" \n \n \"If he did not there was no reason why he should have run away,\" replied Marsh. \n \n \"Well!\" cried Miss Endicotte indignantly, \"I did not expect to hear, you say that Stephen. You know as well as I do that the Colonel always said that Frisco was in the same danger as he was himself.\" \n \n \"What danger was that?\" asked Herrick sharply. \n \n Bess hesitated, and seemed to regret that she had let her tongue wag so freely, but Marsh answered for her. \"We do not know what it was,\" he said simply, \"but my uncle always hinted that he had enemies. Frisco knew his secrets; we did not.\" \n \n \"And if that is the case why should Frisco kill him?\" retorted Bess. \"However what is done can\u0027t be undone. I suppose Frisco will be arrested!\" \n \n \"They\u0027ll have to catch him first,\" said Dr. Jim a trifle grimly, \"and as the man has got away so rapidly, and is now lost in the wilderness of London, I expect they will have some difficulty in doing that.\" \n \n \"You are sure it was Frisco you saw at Southberry?\" \n \n \"Well I did not see his face. But the clothes of the man at the station were the same in all respects as those described by Napper.\" \n \n \"I\u0027ve put everything down,\" said Miss Endicotte, \"and now I am going home to Biffstead to put the article into shape. But I do not believe that Frisco is guilty. Who is, I do not pretend to know; but I intend to find out.\" \n \n \"What the police fail to do, you cannot Bess,\" said Stephen wagging his head, \"but we must not wait. Dr. Herrick is coming with me to Beorminster.\" \n \n \"I\u0027m so glad,\" cried the girl. \"It is a shame none of the doctors seeing your mother! How lucky that Dr. Herrick is here. I shall see you again doctor shan\u0027t I! I have much to say to you.\" \n \n \"I shall call on you with pleasure,\" said Jim gravely shaking hands. \"At Biffstead I suppose?\" \n \n Both Stephen and Bess laughed. \"Oh, that is only my joke,\" said she, \"I call our family the Biffs and the house Biffstead. The Grange is where we live. Anyone will point out the place. Come when you can.\" \n \n As the two men resumed their walk, Herrick could not forbear expressing himself about Bess. \"What a clever girl she is,\" said he, \"those eyes of hers twinkle like stars when she grows excited. You know the family do you not Marsh?\" \n \n \"I have known them all my life. We played together as children. Ida is my greatest friend.\" \n \n Herrick glanced a little jealously at the young man. \"I saw her by chance at Southberry,\" he said carelessly, \"she is very beautiful.\" \n \n \"Very, but not so clever as Bess. Bess is the head and tail and middle of the family. Were it not for her, it would go to pieces. But here we are at the inn. I\u0027ll wait for you here Herrick.\" \n \n \"I won\u0027t be long,\" said the doctor, and ran up the stairs. \n \n As might be guessed Robin the selfish was by no means pleased to be left alone. He did not want Jim to go to Beorminster, not even although the call was so imperative. \"What shall I do without you?\" he asked. \n \n \"You will go to sleep,\" replied Herrick calmly, \"now no nonsense Joyce. I have promised to see Mrs. Marsh and I must keep my word.\" \n \n \"How long will you be?\" \n \n \"It all depends upon the state in which I find Mrs. Marsh. If she is very ill I may stay all night. Good-bye Robin.\" \n \n \"Good-bye,\" returned the little man a trifle sulkily, \"there is far too much of the good Samaritan about you Jim.\" \n \n \"You never think of that in relation to yourself,\" said Herrick with a laugh. \"I hope to be back this evening. Make yourself comfortable.\" \n \n As he ran down to rejoin Marsh, he could not help contrasting the two natures of Stephen and Robin. It is true that he had not had much experience of Marsh; but from what he had seen of him, he judged that he was of a grateful, kindly disposition. Joyce on the other hand, although he looked upon Jim as his best friend, was selfish to the core. Herrick from long association, and because he had plucked him back on one occasion from the grave, was attached to him. But he oftentimes acknowledged that were not Robin an interesting \"case\" from a medical point of view, as he undoubtedly was, he could not stand much of him. Still he had been so long the little man\u0027s friend, that he could not tear himself away from old associations. Nevertheless Robin\u0027s yoke was beginning to gall, and Herrick was glad to get a day away from his society. Friendship is a tender plant, and nothing kills it sooner than selfishness. But Robin in his peevish self-satisfaction had not the sense to see that. \n \n \"Do you mind going by the bus?\" asked Marsh with a flush. \"I am not rich enough to afford a cart of any sort.\" \n \n \"I am quite used to public conveyances,\" said Herrick gaily, \"and as to your being poor, the dark days are over now.\" \n \n \"I suppose so,\" replied Marsh thankfully, \"at least my uncle always told me that I was to be his heir, although we quarrelled so much. I have to take the name of Carr, and fulfil certain duties. I do not know what they are, but I shall do them if only to get the money. I do so want to be rich. Ah here is the bus.\" \n \n \"What about the will?\" asked Herrick as they climbed up to the roof of the clumsy conveyance, \"pardon me, perhaps I should not ask you.\" \n \n \"I do not mind in the least,\" said Stephen, \"indeed I am glad to find that you take an interest in me. I have had a lonely life. The Biffs are my only friends. By the way who told you about the Biffs?\" \n \n Herrick described his meeting with Pentland Corn, and the conversation that had ensued. \"He was remarkably confidential,\" said Herrick. \n \n \"That is strange,\" said Marsh thoughtfully. \"He usually keeps his mouth very much closed. However,\" he added in a lighter tone, \"we can talk of him again. At present, we will speak of the will. I have written to my uncle\u0027s solicitors informing them of his terrible death. I expect to hear from them to-morrow or the next day--perhaps later.\" \n \n \"Who are your uncle\u0027s lawyers--or rather I should say yours?\" \n \n \"Frith and Frith!\" \n \n \"Of Steel Lane. Cheapside?\" asked Herrick in a tone of surprise. \n \n \"Yes! Do you know them?\" \n \n \"I know of them. They are the solicitors of my friend Joyce!\" \n \n \"That is strange,\" said Marsh gaily, \"the world is very small after all is it not. But I am forgetting my mother,\" he added sadly. \n \n \"I was told that Mrs. Marsh was your step-mother.\" \n \n \"So she is; but we get on very well together. She is devoted to me. I expect you have heard of her violent temper.\" \n \n \"Well I have,\" said Herrick hesitating, \"it seems to be well known, if you will excuse my saying so.\" \n \n \"Oh, it\u0027s Town talk,\" replied Stephen with a vexed flush, \"but she is really a good dear woman, and her own worst enemy. Since my father\u0027s death five years ago she has been my best friend. Once she nursed me through a most serious illness. There are worse women in the world than my step-mother Herrick, as you will find. She is a noble-looking woman, and I am glad to be rich if only for her sake. She is fond of luxury, but for my sake has borne poverty. And we have been very, very poor,\" finished Stephen with a sigh. \n \n Every word the young man uttered revealed his good heart. Jim was pleased to find such an unsophisticated youth for once in his life. The young men he knew were usually old before their time, and took a pride in being so. But Marsh talked with such candour, that Herrick saw he was as simple as the day. \"You are a good fellow Marsh,\" said Jim. \"I am glad to have met you.\" \n \n \"I echo your compliment,\" said the other, \"but here we are at Beorminster. I hope my mother is no worse.\" \n \n The vehicle stopped at the foot of the hill upon which the cathedral was built. Herrick followed his companion up a winding street, as steep as those at Malta, and after a breathless climb found himself in the great square. The vast fabric of the cathedral rose black against a saffron sky, and the bells were ringing for the evening service. Stephen led the way towards a far corner of the square, and turned into a dingy side street sloping down the other side of the hill. Stopping at a tall narrow house three doors down, he admitted himself by means of his latch-key and conducted his companion into a dark passage. A woman with a candle held high above her head appeared at the end. She was very old, with white hair and fierce black eyes, a foreigner, as Herrick guessed. \n \n \"How is my mother, Petronella?\" asked Stephen hurriedly. \n \n \"Eh Gran\u0027 Dio, bad, very bad Signor,\" replied the old Italian, \"she die if no doctor come!\" \n \n \"I have brought one, Petronella.\" \n \n \"Thanks be to the saints!\" cried Petronella. \"This way Signor Dottore. My signora is up the stair. Piano! Piano. She is bad so bad. Piano!\" \n \n Herrick suppressed a laugh. The \"Piano! Piano\" of Petronella reminded him of the opening chorus in the Barber of Seville. However he recovered his grave air when introduced into the bedroom of Mrs. Marsh. A few minutes examination convinced him that she was extremely ill. Her pulse was rapid, she was in a high fever, and her face looked scarlet. Still she was conscious, and when the doctor had finished with her for the time being she beckoned to her step-son. \n \n \"The death--the examination?\" she asked hoarsely. \n \n \"The jury have brought in a verdict of wilful murder against Frisco.\" \n \n In spite of the pain she was suffering Mrs. Marsh sank back on her pillow with a smile. \"I always thought that man would kill Carr some day\" she muttered. \"Who is the doctor Stephen?\" \n \n Marsh detailed all he knew about Herrick while that gentleman was giving directions to Petronella. His step-mother listened attentively, and nodded when he finished. \"I am glad he had the decency to come,\" she said. \"These wretches here should be punished by the law. I don\u0027t want to die now there is a chance of being comfortable for the rest of my life.\" \n \n \"You must not talk Mrs. Marsh,\" said Herrick coming to her bedside, \"and I think your son had better go downstairs.\" \n \n \"Am I very ill?\" asked the woman. \n \n \"Oh, you are not so bad as you might be,\" replied Jim cheerfully, \"do not excite yourself, obey my directions, and you will be all right shortly.\" \n \n \"I suffer such pains,\" moaned Mrs. Marsh, \"I can get no sleep. Chloral.\" \n \n \"What\u0027s that?\" asked Herrick sharply. \n \n \"Chloral or morphia. Give me something to soothe the pain.\" \n \n \"I\u0027ll see to it,\" said the doctor cheerfully, and looked at the handsome face of his patient. He saw that she was a highly-strung woman, and from the word she had used he guessed that she was in the habit of taking chloral to induce sleep. Mrs. Marsh was the kind of person who would end her days in a mad-house, if not soothed by artificial means. From the passionate expression in her eyes, the wrinkles on her face, her impatient gestures, Herrick saw that she had absolutely no control over her temper. Perhaps the rumours he had heard of her influenced such a judgment; but afterwards he found that he was absolutely right. The outbursts of rage to which Mrs. Marsh was subject were little removed from madness. The only person who could deal with her was Petronella, who (as Herrick learned) had been her nurse, and knew how to manage and humour her. \n \n \"I shall stay here all night,\" he said to the Italian, after certain remedies had been applied. \"Make up a bed for me somewhere and send out to the chemist for this prescription to be made up.\" \n \n It was late when Jim descended. He found Stephen waiting for him at the foot of the stairs, and was conducted by him into a small bare room, sparsely furnished with two arm chairs, a few \u0027books and a table covered with writing materials. Herrick rather tired, threw himself into one of the chairs, and informed Stephen that he would stay the night. \n \n \"Is my mother so ill?\" asked the young man anxiously. \n \n \"Pretty bad, but I have seen worse cases. Don\u0027t you trouble yourself Marsh. I\u0027ll do the best I can to save her life.\" \n \n \"Save her life,\" echoed Stephen sadly. \"Ah, what a terrible thing it will be if she dies now, when wealth is coming. She always wanted to be rich and now--life is very cruel.\" \n \n \"That depends upon the way you look at it,\" said Jim. \"Give me some supper Marsh, and a whisky. I feel rather played out.\" \n \n The meal was waiting in a poverty-stricken looking dining-room. Jim saw that the pauperism of the Marshes was no fiction. They were evidently terribly poor. Certainly the Colonel had done nothing to alleviate their distress. \"He would not give us a penny,\" said Stephen after supper, and when they were smoking in the small room which proved to be the young man\u0027s special sanctum. \"All the time he kept telling me that I was his heir, but refused to help my mother and me. I do not want to speak evil of the dead\" added Stephen, \"but Colonel Carr--\" he shook his head. \n \n By this time Herrick had seen his patient sinking into a sleep, and leaving Petronella to call him should anything go wrong, was prepared for a little conversation. He utilised the time by asking Marsh about himself and his uncle. The young man answered him with the utmost frankness, and indeed seemed glad to have a friend in whom he could confide. \n \n \"My father was a gentleman farmer,\" he said, \"but he attended more to pleasure than to business. While out hunting, he saved the life of Miss Carr the Colonel\u0027s sister. Afterwards she married him. I was their only child, for my mother died when I was born. My father lost all his money from reckless living, and went abroad for economy. In Italy he met my step-mother, who is the daughter of an English consul by an Italian mother. He met her in a little town on the Adriatic coast. Her father was dead and she was alone save for Petronella. It was her intention to become a singer; but she fell in love with my father. He brought her home to Beorminster, along with Petronella, who would not leave her. With what remained of his money, my father bought this house. Five years ago he died, leaving my mother two hundred a year. With this freehold and that income we have managed to scrape along. I was educated at Bedford, and afterwards went to Oxford. My father said that though he could give me no money, he could at least afford me a decent education. I believe he pinched himself to do so. Mrs. Marsh helped me; for she has always been good to me. I was twenty-one years old when my father died, and after the funeral I wanted to go to London and become a journalist. Mrs. Marsh however would not hear of this. She insisted that I was the Colonel\u0027s heir and that I should wait till he died.----\" \n \n \"Ah!\" interrupted Herrick shaking his head, \"bad thing waiting for dead men\u0027s shoes.\" \n \n \"Do you think it was my wish to do so?\" protested Stephen passionately. \"I should much have preferred to earn my own living, and fight my way in London. I have some talent as a poet and a writer, and I was prepared to battle with the world like other people. But Mrs. Marsh made me stop with her. I am twenty-six years of age now, and I have done nothing. I write poetry and send it to the American magazines, also a few prose articles. These keep me supplied with pocket-money. It was Bess who put me on to the New York papers. There, the editors are more open to new talent.\" \n \n \"And the Colonel refused to help you?\" \n \n \"Always. But I never asked him. I hated that man,\" said Marsh between his teeth. \"I never went near his house. At times my mother called to see him. She always fought viciously with him, and I think he liked her for that. Most people were afraid of him, and he admired her for standing up to him. Colonel Carr thought me a fool and a weakling because I stayed with Mrs. Marsh instead of going out into the world. But I ask you Herrick, what else could I have done? Mrs. Marsh had always been good to me; she sacrificed much so that I might be well educated, so the least I could do was to stop with her. Again and again I wanted her to come with me to London; but she always refused.\" \n \n \"I understand,\" said Jim, filling his pipe, \"she wished to keep an eye on the Colonel.\" \n \n \"I think so. Carr always said that I was to be his heir. He has no relative but me, and he was reported to be wealthy.\" \n \n \"I should think so Marsh. That house is filled with treasure! Did he inherit his money?\" \n \n Stephen looked up alertly. \"Ah, now you are touching on the secret of Carr\u0027s life,\" he said with some excitement. \"His father died ruined, and left him nothing but \u0027The Pines\u0027 with a few acres of farm, and corn-land. Do you know how old Colonel Carr was, doctor?\" \n \n \"No! I saw him only after his death. Not very old I should say.\" \n \n \"Just sixty,\" replied Stephen, \"and into his life he crammed enough wickedness to fill a century. He was twenty when his father died, and in the army. By gambling and speculating he supported himself, and left his sister, my mother, in that old ruined house. Afterwards he left the army--cashiered for cheating at cards, and led a hand to mouth existence. But he would never sell \u0027The Pines,\u0027 however hard up he was. He stopped there on occasions, and played the devil all round. I can\u0027t tell you how bad he was. It is the common-talk of the countryside. He was called Mad Carr, and Wicked Carr.\" \n \n \"Colonel Carr?\" put in Herrick. \n \n \"No! he was only a captain when he left the army at the age of thirty. I believe he called himself Colonel when he returned ten years ago.\" \n \n \"From what quarter of the world?\" \n \n Marsh shook his head. \"I cannot tell you,\" said he slowly, \"for twenty years Carr vanished from England. My mother was left behind in the old house, and afterwards married my father. She should have made a better match, but she had little money, and the reputation of her brother did her no good. However she married my father, and afterwards died when I was born. That was the end of her. The Colonel left his lawyers to look after the property, and remained away. I always heard that it was in South America he picked up his money. At all events he returned here ten years ago with plenty of cash. The first thing he did was to put the house in order, and fill it with splendid furniture. He engaged a staff of servants, and wanted to entertain. At first the people were disposed to be friendly, but he went on worse than ever, and everybody cut him. In a rage he sent away all the servants and only kept Frisco.\" \n \n \"Did Frisco come back with him from South America?\" \n \n \"Yes! But whether it was South America or North I cannot say. Frisco could hold his tongue when he chose. However Carr turned his back on the country people, and went on worse than ever. He was said to be mad but I think it was mere devilment myself. One queer thing he did--no! Two queer things.\" \n \n \"The building of the tower was one,\" said Herrick shrewdly. \n \n Marsh nodded. \"And the other mad act was the throwing down of the walls and fences round the Pines.\" \n \n Dr. Jim looked puzzled. \"Humph,\" said he, \"I noticed that the house had no fences round it. One came upon it suddenly, as if it had been dropped from the skies. Carr threw down the walls, to show that he was not afraid. On the other hand he must have built that tower to show that he was.\" \n \n \"I do not understand what you mean?\" \n \n \"Why? It is not difficult if you remember what you said to me when we met that girl. You hinted that Carr was afraid of something in which Frisco was concerned. Well then; evidently his first attitude was one of defiance towards this fear. Afterwards he thought better of it and built the tower. A man would not leave that splendid house to sleep in a bare room at the top of a tower unless he was afraid.\" \n \n \"I think you are right,\" said Stephen musingly, \"but I don\u0027t know what he was afraid of. It was the third year after he returned that he built the tower, and he was in such a hurry to get it done, that he had the men working at it by night. You know he has a magnificent system of electricity round about \u0027The Pines.\u0027 Well, the lights were on night after night until the tower was finished, and relays of workmen replaced one another. The whole county wondered at the way Carr went on.\" \n \n \"He gave no explanation?\" \n \n \"No! He saw no one, but shut himself up like a hermit. Frisco attended to the house, and cooked the Colonel\u0027s meals. But I think Carr often cooked for himself. He was fond of cooking. For eight years he never went outside that house.\" \n \n \"Humph! That accounts for the gymnasium, the bowling alley, and the shooting gallery. What about his business?\" \n \n \"He did it all my means of letter. Frith and Frith sent down a clerk occasionally. Carr was a clever man of business, and invested his money in good securities. So my mother said. She used to beard him in his den.\" \n \n \"And the clergyman, Corn?\" \n \n \"Yes! He called also to try and reform the Colonel, but he did not succeed. A good fellow Corn, but weak. Can hold his tongue though.\" \n \n \"On the contrary he talked a good deal to me.\" \n \n \"So you said,\" muttered Stephen. \"I wonder what he meant by that?\" \n \n \"Did he know the secret of Carr\u0027s life?\" \n \n \"Not that I know of. Corn always kept his mouth shut as I said. Why he should have talked openly to you I can\u0027t say?\" \n \n \"It seems to me that there are mysteries on all sides,\" said Herrick with a shrug. \"Miss Bess used to visit Carr you say?\" \n \n \"She did once or twice; but I shall leave her to tell you of her visits and her opinion of her host.\" \n \n \"Marsh!\" said Dr. Jim after a pause. \"Have you any idea who murdered Carr?\" \n \n \"No! Not the remotest. Unless it was Frisco.\" \n \n \"On the face of it, one would think so. Why did Frisco run away?\" \n \n Stephen rubbed his chin. \"I think we must ask Bess,\" said he thoughtfully, \"if anyone knows what is at the back of all this it is Bess Endicotte.\" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1878/54303.html","bookId":802,"book":{"id":802,"title":"The Silver Bullet","description":"简介： We had better lie down and die, said Robin peevishly. I can\u0027t go a step further, and to emphasise his words he deliberately sat....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1878","creation":"Aug 1, 2019 12:19:33 AM","modification":"Aug 1, 2019 12:19:33 AM"}}
