{"id":40437,"no":2,"title":"CHAPTER II. OUT OF WORK.","content":"Chester had a talk with his mother that evening. She felt indignant at Silas Tripp\u0027s meanness, but advised Chester to remain in the store for the present. \"I\u0027d rather work anywhere else for two dollars,\" said Chester, bitterly. It would be humiliating enough to accept the reduction, but he felt that duty to his mother required the sacrifice. He started on his way to the store in the morning, prepared to notify Mr. Tripp that he would remain, but he found that it was too late. Just before he reached the store, he met Abel Wood, a loose-jointed, towheaded boy, with a stout body and extraordinarily long legs, who greeted him with a grin. \"I\u0027m goin\u0027 to work in your place Monday mornin\u0027,\" he said. \"Has Mr. Tripp spoken to you?\" asked Chester, his heart sinking. \"Yes, he said you was goin\u0027 to leave. What\u0027s up?\" \"Mr. Tripp cut down my wages,\" said Chester. \"I couldn\u0027t work for two dollars and a half.\" \"He\u0027s only goin\u0027 to give me two and a quarter.\" \"You can afford to work for that. Your father\u0027s got steady work.\" \"Yes, but all the same I\u0027ll ask for more in a few weeks. Where are you goin\u0027 to work?\" \"I don\u0027t know yet,\" answered Chester, sadly. \"It\u0027s awful hard to get a place in Wyncombe.\" \"I suppose it is. I hope something will turn up.\" He tried to speak hopefully, but there was very little hope in his heart. He went about his work in a mechanical way, but neglected nothing. When the time came for the store to close, Silas Tripp took three dollars from the drawer and handed it to him, saying: \"There\u0027s your wages, Chester. I expect it\u0027s the last I\u0027ll pay you.\" \"Yes, sir, I suppose so.\" \"I don\u0027t know how I\u0027ll like the Wood boy. He hain\u0027t no experience.\" \"He\u0027ll get it, sir.\" \"If you want to stay for two and a quarter—the same I\u0027m going to give him—I\u0027ll tell him I\u0027ve changed my mind.\" \"No, sir; it wouldn\u0027t be right to put him off now. I guess I\u0027ll get something else to do.\" He turned and left the store, walking with a slower step than usual. His heart was heavy, for he felt that, poorly as they lived hitherto, they must live more poorly still in the days to come. He reached home at last, and put the three dollars in his mother\u0027s hands. \"I don\u0027t know when I shall have any more money to give you, mother,\" he said. \"It looks dark, Chester, but the Lord reigns. He will still be our friend.\" There was something in these simple words that cheered Chester, and a weight seemed lifted from his heart. He felt that they were not quite friendless, and that there was still One, kinder and more powerful than any earthly friend, to whom they could look for help. When Monday morning came he rose at the usual hour and breakfasted. \"I\u0027ll go out and take a walk, mother,\" he said. \"Perhaps I may find some work somewhere.\" Almost unconsciously, he took the familiar way to the store, and paused at a little distance from it. He saw Abel come out with some packages to carry to a customer. It pained him to see another boy in his place, and he turned away with a sigh. During the night four or five inches of snow had fallen. This gave him an idea. As he came to the house of the Misses Cleveland, two maiden sisters who lived in a small cottage set back fifty feet from the road, he opened the gate and went up to the front door. Miss Jane Cleveland opened it for him. \"Good-morning, Chester,\" she said. \"Good-morning, Miss Cleveland. I thought you might want to get a path shoveled to the gate.\" \"So I would; Hannah tried to do it last time it snowed, but she caught an awful cold. But ain\u0027t you working up at the store?\" \"Not now. Mr. Tripp cut down my wages, and I left.\" \"Do tell. Have you got another place?\" \"Not just yet. I thought I\u0027d do any little jobs that came along till I got one.\" \"That\u0027s right. What\u0027ll you charge to shovel a path?\" Chester hesitated. \"Fifteen cents,\" he answered, at last. \"I\u0027ll give you ten. Money\u0027s skerce.\" Chester reflected that he could probably do the job in half an hour, and he accepted. It cheered him to think he was earning something, however small. He worked with a will, and in twenty-five minutes the work was done. \"You\u0027re spry,\" said Jane Cleveland, when he brought the shovel to the door. \"It took Hannah twice as long, and she didn\u0027t do it as well.\" \"It isn\u0027t the kind of work for ladies,\" replied Chester. \"Wait till I fetch the money.\" Miss Cleveland went into the house, and returned with a nickel and four pennies. \"I\u0027m reely ashamed,\" she said. \"I\u0027ll have to owe you a cent. But here\u0027s a mince pie I\u0027ve just baked. Take it home to your ma. Maybe it\u0027ll come handy. I\u0027ll try to think of the other cent next time you come along.\" \"Don\u0027t trouble yourself about it, Miss Cleveland. The pie is worth a good deal more than the cent. Mother\u0027ll be very much obliged to you.\" \"She\u0027s very welcome, I\u0027m sure,\" said the kindly spinster. \"I hope you\u0027ll get work soon, Chester.\" \"Thank you.\" Chester made his way homeward, as he did not care to carry the pie about with him. His mother looked at him in surprise as he entered the house. \"What have you there, Chester?\" she asked. \"A pie from Miss Cleveland.\" \"But how came she to give you a pie?\" \"I shoveled a path for her, and she gave me a pie and ten cents—no, nine. So you see, mother, I\u0027ve earned something this week.\" \"I take it as a good omen. A willing hand will generally find work to do.\" \"How are you off for wood, mother?\" \"There is some left, Chester.\" \"I\u0027ll go out in the yard and work at the wood pile till dinner time. Then this afternoon I will go out again and see if I can find some more paths to shovel.\" But Chester was not destined to earn any more money that day. As a general thing, the village people shoveled their own paths, and would regard hiring such work done as sinful extravagance. Chester did, however, find some work to do. About half-past three he met Abel Wood tugging a large basket, filled with groceries, to the minister\u0027s house. He had set it down, and was resting his tired arms when Chester came along. \"Give me a lift with this basket, Chester, that\u0027s a good fellow,\" said Abel. Chester lifted it. \"Yes, it is heavy,\" he said. \"The minister\u0027s got some company,\" went on Abel, \"and he\u0027s given an extra large order.\" \"How do you like working in the store, Abel?\" \"It\u0027s hard work, harder than I thought.\" \"But remember what a magnificent salary you will get,\" said Chester, with a smile. \"It ain\u0027t half enough. Say, Chester, old Tripp is rich, ain\u0027t he?\" \"I should call myself rich if I had his money.\" \"He\u0027s a miserly old hunks, then, to give me such small pay.\" \"Don\u0027t let him hear you say so.\" \"I\u0027ll take care of that. Come, you\u0027ll help me, won\u0027t you?\" \"Yes,\" answered Chester, good-naturedly; \"I might as well, as I have nothing else to do.\" Between the two the basket was easily carried. In a short time they had reached the minister\u0027s house. They took the basket around to the side door, just as Mr. Morris, the minister, came out, accompanied by a young man, who was evidently a stranger in the village, as Chester did not remember having seen him before. \"Chester,\" said the minister, kindly, \"how does it happen that you have an assistant to-day?\" \"I am the assistant, Mr. Morris. Abel is Mr. Tripp\u0027s new boy.\" \"Indeed, I am surprised to hear that. When did you leave the store?\" \"Last Saturday night.\" \"Have you another place?\" \"Not yet.\" \"Are you at leisure this afternoon?\" \"Yes, sir.\" \"Then perhaps you will walk around with my friend, Mr. Conrad, and show him the village. I was going with him, but I have some writing to do, and you will do just as well.\" \"I shall be very happy to go with Mr. Conrad,\" said Chester, politely. \"And I shall be very glad to have you,\" said the young man, with a pleasant smile. \"Come back to supper, Chester,\" said the minister; \"that is, if your mother can spare you.\" \"Thank you, sir. I suppose you will be able to carry back the empty basket, Abel,\" added Chester, as his successor emerged from the side door, relieved of his burden. \"I guess so,\" answered Abel, with a grin. \"I was never in Wyncombe before,\" began Mr. Conrad, \"though I am a second cousin of your minister, Mr. Morris. I have to go away to-morrow morning, and wish to see a little of the town while I am here.\" \"Where do you live, Mr. Conrad?\" \"In the city of New York.\" \"Are you a minister, too?\" \"Oh, no!\" laughed the young man. \"I am in a very different business. I am an artist—in a small way. I make sketches for books and magazines.\" \"And does that pay?\" \"Fairly well. I earn a comfortable living.\" \"I didn\u0027t know one could get money for making pictures. I like to draw, myself.\" \"I will see what you can do this evening; that is, if you accept my cousin\u0027s invitation.\" Before the walk was over Chester had become much interested in his new friend. He listened eagerly to his stories of the great city, and felt that life must be much better worth living there than in Wyncombe.","sourceLink":"http://novel.tingroom.com/ertong/2959/81385.html","bookId":430,"book":{"id":430,"title":"Chester Rand or The New Path to Fortune","description":"简介： Probably the best known citizen of Wyncombe, a small town nestling among the Pennsylvania mountains, was Silas Tripp. He kept the village store, occasionally entertained travelers, having three spare rooms, was town treasurer, and conspicuous in othe...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2959","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
