{"id":40467,"no":32,"title":"CHAPTER XXXII. EDWARD GRANGER.","content":"\"I suppose you don\u0027t care to come back to the office, Chester?\" said Mr. Fairchild, when Chester called upon him the next day at the office. \"I like my present position better,\" answered Chester; \"besides, I suppose you are hardly prepared to offer me twenty-five dollars a week.\" \"Do you receive as much as that?\" asked the broker, in amazement. \"Yes, sir.\" \"I congratulate you heartily,\" said Mr. Fairchild. \"It is clear that you are too high priced for the real estate business.\" \"Felix tells me you may retain him.\" \"I will give him a chance. It depends upon himself whether he stays.\" \"I am very glad of it, sir. Felix has hardly been my friend, but now that his cousin is away he may improve. I certainly hope so.\" \"What shall you do about Ralston?\" asked Chester, presently. \"I shall proceed against him. Such a man is a curse to the community. It was through him that my bookkeeper lost his integrity and ruined his prospects. If he is locked up he will be prevented from doing any more harm.\" As Dick Ralston will not again figure in this story, it may be mentioned here that he was found guilty in the trial that soon followed, and was sentenced to a term of several years\u0027 imprisonment. The bitterest reflection he had when sentence was pronounced was that his confederate, Mullins, had escaped and was a free man. Rogues may work together, but it is seldom that any tie of friendship exists between them. Chester was now able to save money. Including what he received from Prof. Hazlitt, his income was about thirty-five dollars a week. His personal expenses were greater than they had been, on account of having a more expensive room. Yet altogether they did not exceed twelve dollars per week, leaving him a balance of twenty-three. Of this sum he proposed to send his mother a part, but she wrote that the liberal board paid by Miss Jane Dolby covered all her expenses. \"I hope if you have money to spare you will put it in some savings bank,\" she wrote. \"At present we are well and prospering, but the time may come when our income will be diminished, and then it will be very comfortable to have some money laid aside.\" Chester acted upon his mother\u0027s suggestion. He did not tell her how much he earned. He wished this to be an agreeable surprise at some future day. Then Chester moved into a larger room. The hall bedroom which he had hitherto occupied was taken by a young man of nineteen named Edward Granger. He was slender and looked younger than he was. He did not seem strong, and there was a sad expression on his face. Sometimes he called on Chester, but for several days they had not met. About six o\u0027clock one afternoon Chester knocked at his door. \"Come in!\" he heard, in a low voice. Entering, he saw Edward lying on the bed face downward, in an attitude of despondency. \"What\u0027s the matter, Edward?\" he asked. \"Are you sick?\" \"Yes, sick at heart,\" was the sad reply. \"How is that?\" inquired Chester, in a tone of sympathy. \"I have lost my place.\" \"When was that?\" \"Three days since. My employer has engaged in my place a boy from the country—his nephew—and I am laid aside.\" \"That is unfortunate, certainly, but you must try to get another place. Your employer will give you a recommendation, won\u0027t he?\" \"Yes, I have one in my pocket, but it is not easy to get a new place, and meanwhile——\" He hesitated. \"Meanwhile you are out of money, I suppose,\" said Chester. \"Yes; I couldn\u0027t save anything. I got only five dollars a week, and my room costs two. I suppose, when the week is up, Mrs. Randolph will turn me into the street.\" \"Not while you have a friend in the next room,\" said Chester, cordially. Edward looked up quickly. \"Will you really be my friend?\" he asked. \"Try me. Have you had supper?\" \"I have not eaten anything for two days,\" answered Granger, sadly. \"Why didn\u0027t you call upon me? I wouldn\u0027t have seen you suffer.\" \"I didn\u0027t like to ask. I thought you would consider me a beggar.\" \"You will understand me better after a while. Now put on your hat and come out with me.\" Edward did so, but he was so weak from long fasting that he was obliged to lean upon Chester in walking to the restaurant, which was luckily near by. \"Let me advise you to take some soup first,\" said Chester. \"Your stomach is weak, and that will prepare it for heartier food.\" \"I don\u0027t feel hungry,\" returned Edward. \"I only feel faint.\" \"It may be well not to eat very much at first.\" \"How kind you are! I must be two or three years older than you, yet you care for and advise me.\" \"Consider me your uncle,\" said Chester, brightly. \"Now tell me how it happens that you didn\u0027t apply to some friend or relative.\" A shadow passed over the boy\u0027s face. \"I have none in New York—except yourself.\" \"Then you are not a city boy.\" \"No; I came from Portland.\" \"In Maine?\" \"No; in Oregon.\" \"You have relatives there?\" \"A mother.\" \"I suppose you hear from her?\" Edward Granger was silent. \"I don\u0027t wish you to tell me if you have an objection.\" \"Yes, I will tell you, for I think you are a true friend. My mother is married again, and my stepfather from the first disliked me. I think it is because my mother had money, and he feared she would leave it to me. So he got up a false charge against me of dishonesty. My mother became cold to me, and I—left home. I am of a sensitive nature, and I could not bear the cold looks I met with.\" \"How long ago was this?\" \"About six months since.\" \"You came to New York directly?\" \"Yes.\" \"Where did you get the money to come?\" \"I came by it honestly,\" answered Edward, quickly. \"I had a deposit in a savings bank, put in during my own father\u0027s life. I felt I had a right to use this, and I did so. It brought me to New York, and kept me here till I got a place in an insurance office.\" \"And you managed to live on five dollars a week?\" \"Yes; it was hard, but I went to the cheapest eating houses, and I—got along.\" \"But you had no money to buy clothing.\" \"I brought a fair supply with me. Now I am beginning to need some small articles, such as handkerchiefs and socks.\" \"I wondered you would never go to supper with me.\" \"I didn\u0027t want you to know how little I ordered. You might have thought me mean.\" \"Poor fellow!\" said Chester, pityingly. \"You have certainly had a hard time. And all the while your mother was living in comfort.\" \"Yes, in luxury, for she is worth at least fifty thousand dollars in her own right.\" \"I hope your stepfather has not got possession of it.\" \"He had not when I came away. My mother is naturally cautious, and would not give it to him. He attributed this to my influence over her, but it was not so. She is of Scotch descent, and this made her careful about giving up her property. She allowed him the use of the income, only reserving a little for herself.\" \"Have you had any communication with her since you left Portland?\" \"I wrote her once, but received no answer.\" \"The letter may not have reached her. It may have fallen into the hands of your stepfather. What is his name?\" \"Trimble—Abner Trimble.\" \"Was he in any business?\" \"Yes; he kept a liquor saloon, and patronized his own bar too much for his own good.\" \"I shouldn\u0027t think your mother would like to have him in that business.\" \"She asked him to change it, but he wouldn\u0027t. He had a set of disreputable companions who made his saloon their headquarters, and he did not wish to give them up, as he might have had to do if he had gone into another business.\" By this time supper was over, and the two walked to Broadway. Edward felt stronger, and his eye was brighter. Suddenly he gripped Chester\u0027s arm. \"Do you see that man?\" he asked, pointing to a black-bearded man on the other side of the street. \"Yes; what of him?\" \"It is a gentleman from Portland, a neighbor of ours. What can he be doing in New York?\" \n \n","sourceLink":"http://novel.tingroom.com/ertong/2959/81415.html","bookId":430,"book":{"id":430,"title":"Chester Rand or The New Path to Fortune","description":"简介： Probably the best known citizen of Wyncombe, a small town nestling among the Pennsylvania mountains, was Silas Tripp. He kept the village store, occasionally entertained travelers, having three spare rooms, was town treasurer, and conspicuous in othe...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2959","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
