{"id":40440,"no":5,"title":"CHAPTER V. CHESTER\u0027S FIRST SUCCESS.","content":"Chester and his mother and a few friends attended the funeral of Walter Bruce. Silas Tripp was too busy at the store to pay this parting compliment to his nephew. He expressed himself plainly about the folly of the Rands in \"runnin\u0027 into debt for a shif\u0027less fellow\" who had no claim upon them. \"If they expect me to pay the funeral expenses they\u0027re mistaken,\" he added, positively. \"I ain\u0027t no call to do it, and I won\u0027t do it.\" But he was not asked to defray the expenses of the simple funeral. It was paid for out of the minister\u0027s charitable fund. \"Some time I will pay you back the money, Mr. Morris,\" said Chester. \"I am Mr. Bruce\u0027s heir, and it is right that I should pay.\" \"Very well, Chester. If your bequest amounts to anything I will not object. I hope for your sake that the lots may become valuable.\" \"I don\u0027t expect it, Mr. Morris. Will you be kind enough to take care of the papers for me?\" \"Certainly, Chester. I will keep them with my own papers.\" At this time Tacoma contained only four hundred inhabitants. The Northern Pacific Railroad had not been completed, and there was no certainty when it would be. So Chester did not pay much attention or give much thought to his Western property, but began to look round anxiously for something to do. During the sickness of Walter Bruce he had given up his time to helping his mother and the care of the sick man. The money received from the minister enabled him to do this. Now the weekly income had ceased, and it became a serious question what he should do to bring in an income. He had almost forgotten his meeting with Herbert Conrad, the young artist, when the day after the funeral he received a letter in an unknown hand, addressed to \"Master Chester Rand, Wyncombe, New York.\" As he opened it, his eyes opened wide with surprise and joy, when two five-dollar bills fluttered to the ground, for he had broken the seal in front of the post office. He read the letter eagerly. It ran thus: \"Dear Chester:—I am glad to say that I have sold your sketch for ten dollars to one of the papers I showed you at Wyncombe. If you have any others ready, send them along. Try to think up some bright, original idea, and illustrate it in your best style. Then send to me. \"Your sincere friend, Herbert.\" Chester hardly knew whether he was standing on his head or his heels. It seems almost incredible that a sketch which he had dashed off in twenty minutes should bring in such a magnificent sum. And for the first time it dawned upon him he was an artist. Fifty dollars gained in any other way would not have given him so much satisfaction. Why, it was only three weeks that he had been out of a place, and he had received more than he would have been paid in that time by Mr. Tripp. He decided to tell no one of his good luck but his mother and the minister. If he were fortunate enough to earn more, the neighbors might wonder as they pleased about the source of his supplies. The money came at the right time, for his mother needed some articles at the store. He concluded to get them on the way home. Silas Tripp was weighing out some sugar for a customer when Chester entered. Silas eyed him sharply, and was rather surprised to find him cheerful and in good spirits. \"How\u0027s your mother this mornin\u0027, Chester?\" asked the grocer. \"Pretty well, thank you, Mr. Tripp.\" \"Are you doin\u0027 anything yet?\" \"There doesn\u0027t seem to be much work to do in Wyncombe,\" answered Chester, noncommittally. \"You was foolish to leave a stiddy job at the store.\" \"I couldn\u0027t afford to work for the money you offered me.\" \"Two dollars and a quarter is better than nothin\u0027. I would have paid you two and a half. I like you better than that Wood boy. Is your mother workin\u0027?\" \"She is doing a little sewing, but she had no time for that with a sick man in the house.\" \"I don\u0027t see what made you keep a man that was no kith or kin to you.\" \"Would you have had us put him into the street, Mr. Tripp?\" \"I\u0027d have laid the matter before the selec\u0027-men, and got him into the poorhouse.\" \"Well, it is all over now, and I\u0027m not sorry that we cared for the poor fellow. I would like six pounds of sugar and two of butter.\" \"You ain\u0027t goin\u0027 to run a bill, be you?\" asked Silas, cautiously. \"I can\u0027t afford to trust out any more.\" \"We don\u0027t owe you anything, do we, Mr. Tripp?\" \"No; but I thought mebbe——\" \"I will pay for the articles,\" said Chester, briefly. When he tendered the five-dollar bill Silas Tripp looked amazed. \"Where did you get so much money?\" he gasped. \"Isn\u0027t it a good bill?\" asked Chester. \"Why, yes, but——\" \"I think that is all you have a right to ask,\" said Chester, firmly. \"It can\u0027t make any difference to you where it came from.\" \"I thought you were poor,\" said Mr. Tripp. \"So we are.\" \"But it seems strange that you should have so much money.\" \"Five dollars isn\u0027t much money, Mr. Tripp.\" Then a sudden idea came to Silas Tripp, and he paused in weighing out the butter. \"Did my nephew leave any money?\" he asked, sharply. \"Yes, sir.\" \"Then I lay claim to it. I\u0027m his only relation, and it is right that I should have it.\" \"You shall have it if you will pay the expense of his illness.\" \"Humph! how much did he leave?\" \"Thirty-seven cents.\" Mr. Tripp looked discomfited. \"You can keep it,\" he said, magnanimously. \"I don\u0027t lay no claim to it.\" \"Thank you,\" returned Chester, gravely. \"Then this five-dollar bill didn\u0027t come from him?\" \"How could it? he hadn\u0027t as much money in the world.\" \"He was a shif\u0027less man. \u0027A rolling stone gathers no moss,\u0027\" observed Mr. Tripp, in a moralizing tone. \"You haven\u0027t been a rolling stone, Mr. Tripp.\" \"No; I\u0027ve stuck to the store year in and year out for thirty-five years. I ain\u0027t had more\u0027n three days off in that time.\" \"If I had your money, Mr. Tripp, I\u0027d go off and enjoy myself.\" \"What, and leave the store?\" said Silas, aghast at the thought. \"You could hire some one to run it.\" \"I wouldn\u0027t find much left when I came back; No, I must stay at home and attend to business. Do your folks go to bed early, Chester?\" \"Not before ten,\" answered Chester, in some surprise. \"Then I\u0027ll call this evenin\u0027 after the store is closed.\" \"Very well, sir. You\u0027ll find us up.\" The idea had occurred to Mr. Tripp that Mrs. Rand must be very short of money, and might be induced to dispose of her place at a largely reduced figure. It would be a good-paying investment for him, and he was not above taking advantage of a poor widow\u0027s necessities. Of course neither Mrs. Rand nor Chester had any idea of his motives or intentions, and they awaited his visit with considerable curiosity. About fifteen minutes after nine a shuffling was heard at the door, there was a knock, and a minute later Chester admitted the thin and shriveled figure of Silas Tripp. \"Good-evening, Mr. Tripp,\" said Mrs. Rand, politely. \"Good-evenin\u0027, ma\u0027am, I thought I\u0027d call in and inquire how you were gettin\u0027 along.\" \"Thank you, Mr. Tripp, for the interest you show in our affairs. We are not doing very well, as you may imagine.\" \"So I surmised, ma\u0027am. So I surmised.\" \"It can\u0027t be possible he is going to offer us a loan,\" thought Chester. \"You\u0027ve got a tidy little place here, ma\u0027am. It isn\u0027t mortgaged, I rec\u0027on.\" \"No, Sir.\" \"Why don\u0027t you sell it? You need the money, and you might hire another house, or pay rent for this.\" \"Do you know of anyone that wants to buy it, Mr. Tripp?\" \"Mebbe I\u0027d buy it myself, jest to help you along,\" answered Silas, cautiously. \"How much would you be willing to give?\" put in Chester. \"Well, I calculate—real estate\u0027s very low at present—three hundred and fifty dollars would be a fair price.\" Mrs. Rand looked amazed. \"Three hundred and fifty dollars!\" she ejaculated. \"Why, it is worth at least seven hundred.\" \"You couldn\u0027t get it, ma\u0027am. That\u0027s a fancy price.\" \"What rent would you charge in case we sold it to you, Mr. Tripp,\" asked Chester. \"Well, say five dollars a month.\" \"About sixteen or seventeen per cent. on the purchase money.\" \"Well, I\u0027d have to pay taxes and repairs,\" explained Tripp. \"I don\u0027t care to sell, Mr. Tripp,\" said Mrs. Rand, decisively. \"You may have to, ma\u0027am.\" \"If we do we shall try to get somewhere near its real value.\" \"Just as you like, ma\u0027am,\" said Silas, disappointed. \"I\u0027d pay you cash down.\" \"If I decide to sell on your terms I\u0027ll let you know,\" said Mrs. Rand. \"Oh, well, I ain\u0027t set upon it. I only wanted to do you a favor.\" \"We appreciate your kindness,\" said Mrs. Rand, dryly. \"Women don\u0027t know much about business,\" muttered Silas, as he plodded home, disappointed. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2959/81388.html","bookId":430,"book":{"id":430,"title":"Chester Rand or The New Path to Fortune","description":"简介： Probably the best known citizen of Wyncombe, a small town nestling among the Pennsylvania mountains, was Silas Tripp. He kept the village store, occasionally entertained travelers, having three spare rooms, was town treasurer, and conspicuous in othe...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2959","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
