{"id":8226,"no":10,"title":"Chapter 10","content":"Although Homer had nothing to do but prepare his scanty meals, he was not bored. Except for the Romola Martin incident and perhaps one or two other widely spaced events, the forty years of his life had been entirely without variety or excitement. As a bookkeeper, he had worked mechanically, totaling figures and making entries with the same impersonal detachment that he now opened cans of soup and made his bed.\n Someone watching him go about his little cottage might have thought him sleep-walking or partially blind. His hands seemed to have a life and a will of their own. It was they who pulled the sheets tight and shaped the pillows.\n One day, while opening a can of salmon for lunch, his thumb received a nasty cut. Although the wound must have hurt, the calm, slightly querulous expression he usually wore did not change. The wounded hand writhed about on the kitchen table until it was carried to the sink by its mate and bathed tenderly in hot water.\n When not keeping house, he sat in the back yard, called the patio by the real estate agent, in an old broken deck chair. He went out to it immediately after breakfast to bake himself in the sun. In one of the closets he had found a tattered book and he held it in his lap without looking at it.\n There was a much better view to be had in any direction other than the one he faced. By moving his chair in a quarter circle he could have seen a large part of the canyon twisting down to the city below. He never thought of making this shift. From where he sat, he saw the closed door of the garage and a patch of its shabby, tarpaper roof. In the foreground was a sooty, brick incinerator and a pile of rusty cans. A little to the right of them were the remains of a cactus garden in which a few ragged, tortured plants still survived.\n One of these, a clump of thick, paddlelike blades, covered with ugly needles, was in bloom. From the tip of several of its topmost blades protruded a bright yellow flower, somewhat like a thistle blossom but coarser. No matter how hard the wind blew, its petals never trembled. A lizard lived in a hole near the base of this plant. It was about five inches long and had a wedge-shaped head from which darted a fine, forked tongue. It earned a hard living catching the flies that strayed over to the cactus from the pile of cans.\n The lizard was self-conscious and irritable, and Homer found it very amusing to watch. Whenever one of its elaborate stalks were foiled, it would shift about uneasily on its short legs and puff out its throat. Its coloring matched the cactus perfectly, but when it moved over to the cans where the flies were thick, it stood out very plainly. It would sit on the cactus by the hour without moving, then become impatient and start for the cans. The flies would spot it immediately and after several misses, it would sneak back sheepishly to its original post.\n Homer was on the side of the flies. Whenever one of them, swinging too widely, would pass the cactus, he prayed silently for it to keep on going or turn back. If it lighted, he watched the lizard begin its stalk and held his breath until it had killed, hoping all the while that something would warn the fly. But no matter how much he wanted the fly to escape, he never thought of interfering, and was careful not to budge or make the slightest noise. Occasionally the lizard would miscalculate. When that happened Homer would laugh happily.\n Between the sun, the lizard and the house, he was fairly well occupied. But whether he was happy or not it is hard to say. Probably he was neither, just as a plant is neither. He had memories to disturb him and a plant hasn’t, but after the first bad night his memories were quiet.\n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/714/1166.html","bookId":273,"book":{"id":273,"title":"蝗虫之日 The Day of the Locust","description":"简介： The book follows a young man named Tod Hackett who thinks of himself as a painter and artist, but who works in Hollywood as a costume designer and background painter. He falls in love with Faye Greener, an aspiring starlet who lives nearby....","cover":"http://novel.tingroom.com/uploads/121223/1-121223211955K1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/714","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
