{"id":87297,"no":19,"title":"Page 19","content":"\\n\\n I called Natalie’s office as I walked to my car. No answer, but I figured she’d probably be in by the time I was able to drive there, so I headed for her office first. I drove with the radio blasting, focusing fully on the notes pounding in my brain to avoid thinking of anything else. But thoughts of Valerio Costa trickled in, forcing Bon Jovi’s lyrics right out of my head. His crazy black salamander eyes—eyes that should have been creepy, but were somehow intensely sexy. The conviction in his voice when he insisted I was a good investigator. And the way his arms held me, so safely against him while I slept.\\n\\n Oh boy.\\n\\n I skidded around a turn, glaring at the car behind me as they mashed their horn. No. I was not falling for Valerio Costa. I was not. The man had used me as bait.\\n\\n Even worse, he hadn’t told me that was part of the plan.\\n\\n Why had he slept with me? Because he wanted to keep me in his room in case the kidnapper came looking for me? Maybe. Maybe not. Maybe I was just overreacting because of the stress of Elaine’s kidnapping.\\n\\n But what if I wasn’t?\\n\\n A great weight settled onto my chest, pushing the air from my lungs, the hope from my thoughts. So I drove fast, sang loud, and did everything I could to keep Valerio Costa out of my head and away from my heart.\\n\\n Natalie Leigh’s building was as pristine as always. The morning light reflected off the building’s dark glass, and that bit of brightness imbued me with hope. I walked inside, lost in my thoughts, and ran into what felt like a brick wall. Cool hands on my arms steadied me, and I looked up and met the gaze of a familiar face and the strong scent of herbs swirled around me. It took me a moment to place the large man as the one I’d seen in the lobby when I’d visited Natalie alone about the burned body case. He dropped his hands and stared at me, as if his eyes would bore through me, sweat gathering on his forehead.\\n\\n I stepped aside, uncomfortable. Did he work security for the building or something? A suit adorned his body, but he carried himself like professional muscle. He lugged a bag, and I wondered if that was where the herbal scent had come from. Perhaps he was a customer of Natalie’s?\\n\\n Or a supplier?\\n\\n I felt his eyes on my back, and I waved at the receptionist. Recognizing me, she nodded and reached for the phone. The witch, it seemed, wasn’t one for surprises. I didn’t look back, but headed for the elevator. Encouraging the man by acknowledging him was a bad idea.\\n\\n Waiting patiently for the elevator to ding, I checked my cell phone. Still no call from Costa. No half-assed explanations. No attempts to get me to listen. No screw- yous. The fact that he hadn’t even tried to call somehow made it worse. It hadn’t been long, of course. Yet if he really cared, wouldn’t he have followed me out of the hotel?\\n\\n But no. No chase. No call. No worries—for him, anyway.\\n\\n I grumbled and stuffed the phone back in my jacket as I boarded the elevator. I turned back and hit the button for Natalie’s floor. The large man no longer watched me, and the revolving door still spun from his departure. One less thing to worry about.\\n\\n I knew should call Costa and give him a chance to explain. Tell him what I was taking to Natalie. That would be the mature thing to do. His partner was a bitch, but that didn’t mean that he was as bad as her words made him appear. And I had a feeling that what he’d confided in me the night before wasn’t a story he told carelessly, if he’d even shared it before. But as the light behind the numbers counted off the floors in the elevator, I couldn’t force myself to take out my phone to make the call.\\n\\n Natalie’s office door stood ajar, but her office itself was empty. I frowned and rubbed my arms. Nothing appeared disturbed, no rustled papers or knocked-over chairs. Perhaps she just hadn’t arrived for the day?\\n\\n Her day planner sat on her desk, so I gave the office and waiting room a quick once-over and then flipped it open. Today, she showed appointments starting at seven o’clock and going clear through eight tonight. For Natalie, appointments almost certainly meant she was in her casting room, which was situated down a hallway from her office. I’d seen it once, when we cast the locator spell to find Elaine. A spell we’d cast in vain.\\n\\n I whistled under my breath. The rest of her upcoming week appeared just as full. When did she have time for a life? Or even to eat?\\n\\n It was nine now, and her calendar listed an appointment from eight until ten. So where were they? Her note was in shorthand, but it looked like some sort of luck spell had been scheduled. A private client, then. The police department didn’t believe in luck.\\n\\n The door leading to the hallway between her office and spell room stood closed, and I considered for a moment going back there to see if she was busy casting. I grimaced. No. Probably not the smartest idea. Magic was tricky. I was no expert, but I was pretty certain that no one would be happy if I interrupted her spell. Who knew what the consequences could be? For all I knew, barging in there might make her blow us all up.\\n\\n I glanced longingly at her computer, but jarring her mouse revealed the screen to be locked and that a password was needed. Just as well. How bad would it look if she walked in to find me on her computer? No way would she believe that I was just on there to Google some information while I waited. I suppressed a sigh and pulled out my phone. The screen was small and the speed wasn’t up to what a real computer could do, but it would have to work.\\n\\n I loaded the tiny browser and tapped my fingernails on her desk while I waited for the search screen to load. When the box finally popped up, I typed in “Anchorage, Witch”\\n\\n and hit enter. It might be a long shot, but Anchorage was out of the way. It wasn’t exactly a bustling city for visiting Covenant members. A high level member—or former member—might earn a spot in the paper if news was slow.\\n\\n The search came up with hundreds of pages of results, and I scrolled through the first page without clicking on any of the links. Most were for local coven’s websites. The second page netted very similar results, with the exception of one link.\\n\\n The Anchorage Daily News listed an article about a bigwig witch visiting for some sort of new bill signing. I hit the link and waited impatiently for it to load. After what felt like forever, the page slowly came up, one inch at a time on the small screen, almost too small to read. I zoomed in on the page and checked the date. Four months ago. Yes. That fit the range all right. I scrolled down and then stopped abruptly.\\n\\n No flipping way.\\n\\n The name stood out to me on the screen as if bolded, as did his very small but very happy face on the included picture. Viktor Koslov. That put him in the right city during the right timeframe for two incidences: Anchorage and Chicago. And he was a powerful witch, powerful enough to have twisted a succubus’s powers. Chicago might be a coincidence, but Anchorage, too?\\n\\n As I stared at the picture, something else caught my attention. A large man stood in the background. The man I’d run into downstairs. My heart stopped.\\n\\n Natalie.\\n\\n If Koslov was involved in this, Natalie might not be safe. We’d had her looking into witches capable of pulling off the power transfer. I pushed up from the chair and strode toward the door to her casting room, but my hand froze on the knob. So what if Viktor had been in Alaska with the creepy man from the lobby? He might be one witch of many, especially if the legislation they passed was a big enough deal for him to go there to show his approval.\\n\\n What if I was wrong, and I walked in there and someone got hurt?\\n\\n I gritted my teeth and stepped away from the door. I pulled my phone out and hit the back button. Thankfully, the search screen loaded quickly, and with shaking fingers I typed in, “Koslov, Phoenix” on the small screen.\\n\\n Time moved even more achingly slowly as I waited for the results to load. Finally, after what felt like hours, the first page of results appeared. As I took in the short summary of the first listing, my breath caught in my throat.\\n\\n Two months ago, Viktor Koslov had been in Phoenix.\\n\\n Perfect timing for when the succubus disappeared, and near the time a pile of ash had been found as well.\\n\\n The evidence was circumstantial but convincing. Not only could Koslov have committed the crimes, he’d been in at least three cities at the right time to have done it. And according to Natalie, no witch would have been able to twist a succubus’s power with the councilman in the same city without him knowing. The burned victims still didn’t make sense unless…\\n\\n An image of the professional muscle I’d seen downstairs flashed in my mind, and I rubbed my arms against a sudden chill. Could that man be the key? His grip had been cool, like Costa’s. Was the professional muscle a salamander?\\n\\n He’d smelled of herbs. Had Viktor sent him back for something? Natalie had to have rare, difficult-to-find herbs in her spell room. Maybe she’d had something Viktor wanted badly enough to send his man back for them. Or even more likely, he’d come back to make sure the scene was cleaned of anything that could be linked to Viktor.\\n\\n I grabbed the knob and twisted, yanking open the door to the hallway that led to her casting room. Risks be damned. Natalie had to know as soon as possible that Viktor Koslov—one of the most powerful witches in the country, if not the world—was our kidnapper. Our killer.\\n\\n Chapter Twelve\\n\\n Deafening silence hit me; the only noise touching my ears was my own frantic footsteps. I made my way down the hall to the casting room and, feeling awkward, knocked.\\n\\n The noise echoed in the hallway, but no sounds answered it. I knocked once more before tentatively opening the door. I stepped back, but no lightning or fire or ice flew from the room to strike me. The room was dark.\\n\\n “Hello? Natalie? It’s Detective Whitman.” I felt along the inside of the wall, fumbling until my fingertips touched a light switch. I flipped it on, then took in the room before me.\\n\\n Spell ingredients littered the ground—herbs intermingled with pieces of glass and wire. Scorches touched the walls and bookcases. Her circle, which had been etched into the concrete floor as well as painted, didn’t look right. I stared at it for a moment before I realized that the paint had been smudged, nearly removed from a one-foot section. Deep scratches trailed across the etching. \\n\\n","sourceLink":"https://allnovel.net/succubus-lost-files-of-the-otherworlder-enforcement-agency-2/page-19.html","bookId":2263,"book":{"id":2263,"title":"Succubus Lost (Files of the Otherworlder Enforcement Agency #2)","description":"Storyline: Succubus Lost (Files of the Otherworlder Enforcement Agency #2) \\n Someone is kidnapping and incinerating otherworlders beyond recognition, and detective Marisol Whitman, a succubus, races to find the murderer before he claims another victim. But her pursuit is derailed when her responsible younger sister vanishes. Marisol suspects foul play and enlists support from an unlikely source: an agent from the Otherworlder Enforcement Agency, Valerio Costa. \\n When the trail pointing to everyone from vampires to witches dries up, Agent Costa admits to knowing more than he’s shared. Marisol’s sister’s kidnapper harnesses more magic than she can imagine—and they’re running out of time. To find her sister before her powers are drained and twisted beyond recognition, Marisol must connect the dots between cases and put her trust in Costa, a salamander who may burn her before she can solve either case.\\n","cover":"https://allnovel.net/images/succubus-lost-files-of-the-otherworlder-enforcement-agency-2.jpg","author":"Tiffany Allee","type":"Mystery","source":"allnovel","link":"https://allnovel.net/succubus-lost-files-of-the-otherworlder-enforcement-agency-2.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:20:24 PM"}}
