{"id":87299,"no":21,"title":"Page 21","content":"\n The room beyond was dark, and I turned on my flashlight to see beyond the small space illuminated by the open door. The cobwebs in the corners of the room suggested the place was vacant, and the layer of dust on an old desk in one corner supported the suggestion. My shoulders dropped. It had been a small chance, but I’d hoped.\n I shook my head. Search this place or move on?\n Moving on to the next warehouse seemed like the best idea. Wasting time here wouldn’t get me anything.\n I stepped back, then reached for the door when something caught my eye. Dirt and grime covered the floor—mostly. A small trail of less-dirty spots went from the door through to the opening into the next room.\n It wasn’t clean, and there was nothing so obvious as footprints, but less dust coated its surface that the ones around it.\n I frowned and chewed on the inside of my lip. A caretaker could have walked through here. Perhaps one of the Chevaliers who routinely checked out the properties?\n Maybe. But maybe not.\n I slid my hand over my gun and stepped back into the warehouse, making my way farther in as quietly as I could.\n My gun caught a bit in the holster, and I tugged to get it out. I struggled with my flashlight and the crowbar in my other hand, before finally finding a balance that allowed me to hold both, if a bit precariously.\n The air was cool and faintly damp—tinged with other things. Scents that made me think of back alleys and bars. I stopped and peered around a corner, swinging my flashlight and gun as I moved. Nothing.\n As I crept forward, careful to avoid rustling the papers that appeared haphazardly along the floor, a bit of light caught my attention. That couldn’t be the outside, could it?\n It seemed too close to be some sort of break in the wall, too minute to be a small window.\n My flashlight revealed a door. To creep or to fling?\n I frowned. If a Covenant witch and his bodyguard were behind that door, they’d hardly be impressed by the noise and sound of me hurling open the door and shouting “police” at them. No, sneakiness was best. Besides, if I were lucky at all, they were being arrested at La Maison as I crept through the dirty warehouse.\n I opened the door slowly, wincing as it creaked. The light was on. Electricity ran in this warehouse. Excitement surged through me and I stepped into the room.\n Movement across the room immediately caught my attention. My eyes met Viktor Koslov’s, and I swung the gun around without preamble.\n “Police!” I shouted, and then I cried out as I felt pain surge from my hand and shoot up my arm. My gun clanked to the floor and I risked a glance. Blisters grew and bubbled on the backside of my hand, and tears sprang to my eyes. The pain overwhelmed me as I took in the damage to my flesh.\n Koslov smiled and nodded to my side. I followed his gaze, blinking through the tears. Tall and built like a linebacker, the man from the lobby stood, arm outstretched, with eyes as black as night.\n Chapter Thirteen\n Faced with the salamander ready to burn me, and the Covenant witch ready to do who knew what to me, I raised my hands, wincing as the skin stretched with the movement. The burn hadn’t reached my palm but rather had only touched the outside of my hand, extending from the middle knuckle of my fingers to several inches of my arm above my wrist. So he couldn’t burn just anything, or he would have burned my palm, I figured. Directionally based? Like a person standing with a hose, he could point it and shoot, but not otherwise direct the flow of power? I should have asked Costa.\n “Keep your hands up, Ms. Whitman,” Koslov ordered.\n He nodded to the salamander and the big man took a step toward me.\n My foot slid back as if it had a mind of its own and that mind was set to get the heck out of there. As the salamander raised a hand toward me, I swallowed hard.\n “Please don’t worry, Detective. Leon is merely going to search you. You will be quite unharmed, I promise. Of course, your continued health is dependent upon your cooperation.” The council member flashed a smile at me, and I supposed he thought it a comforting expression. I suppressed a shudder at the creepiness.\n The salamander tossed my flashlight and crowbar into a corner of the room and picked my gun up from the floor, tucking it into his belt. Then he searched me quickly and with a brisk efficiency and confidence. Former law enforcement?\n This got better and better.\n “I just want my sister,” I said, then added, “and Natalie.\n You guys can go, get out of town. I never saw you here.”\n Koslov chuckled, but Leon maintained his expressionless demeanor. “Oh yes, Detective. I’m sure that you’ll keep your word when we leave.” Koslov’s humor faded. “Who knows that you are here?”\n I snorted. “Everyone, of course. I called for backup on my way in.” I had, sort of. Although a quick call to Costa hardly equated with really calling in the cavalry. But Koslov had no way of knowing that.\n “Lie.” Koslov gave me a small smile. “Nice try, but I’m a witch, Detective. And not an idiot.” His gaze traveled down my body, but there was no real desire on his face, no lust. He looked at me with the cold calculation of a car salesman checking out the trade-in. Finally, he pursed his lips and said, “Well you’re not as...young as I would like.\n But you’re definitely attractive enough. Isn’t she, Don?”\n Leon grunted.\n “The police background will certainly reduce your value. Unless...” He snapped his fingers and a smile of pure greed appeared on his face. “Oh yes. This will be just fine. I’m sure I have some potential customers who would like to work out on you some lingering issues with law enforcement, Detective.”\n The corner of my lip rose into a snarl and I struggled to keep my cool. “Just give me the women. Do you really think I was too stupid to call in for backup before barging in here?”\n He grinned. “Oh yes. I think you were just that stupid.\n That’s the thing about you cops—especially otherworlders.\n Always with something to prove. You’re all a bunch of wannabe cowboys.”\n Dammit. I was stupid. But Costa would come for me, wouldn’t he? He’d check his voice mail and head here, especially once they figured out that Koslov wasn’t at the hotel. I just had to delay them.\n “Put her in a room by the other two,” Koslov ordered.\n He turned to a small desk with a laptop sitting on top of it that was situated farther into the room. The desk stood out in sharp contrast—new and shiny in a room full of old, dirty things. Apparently Koslov didn’t like the idea of working at one of the old, dirty desks stacked in the corner of the room.\n “Why are you doing this?” I called. When all else failed, try to get them to discuss their glorious plans.\n “Really, Detective?” He crossed his arms. “Trying to get a villainous monologue out of me is the best you can do?”\n Crap. “Well, I’m curious.”\n “So sorry to disappoint you, but I’m hardly going to discuss my affairs with a woman—a succubus besides.” He turned back to the desk and the salamander took a step toward me.\n “I just don’t understand why you’re moving on from succubi? Surely the market for sirens isn’t as flush.”\n He stiffened, whether it was because I knew more than he’d expected me to, or because he was just getting irritated at my prattle, I wasn’t sure. His salamander paused and glanced at Koslov.\n “I mean, I get the succubi thing. Pet sex slave that you can drain, that’s gotta be pretty damn appealing to a lot of scum-suckers. But sirens?” I shrugged. “I just don’t see the point. I mean, when a siren’s power is used, sure you can control a person for a brief period of time, but they always remember that they were controlled afterward. And using a siren’s power is treated the same by the law as using a gun.”\n Koslov turned to me, expression dark. He’d nearly reached his desk. “I wouldn’t expect you to understand, succubus.” He named my species with such venom I started, and I thought I saw Leon stiffen next to me. “In fact, I wouldn’t expect much at all from you. Heaven forbid you have enough imagination to consider the benefits of being able to drain a siren of its powers. While you don’t get the long-term power over a person that succubus powers provide, you do get their unwavering obedience during the song and for a time after. The song can be used to eliminate any witnesses as well.”\n I mentally winced, and Leon shifted his weight beside me. That was true enough. If a criminal had no morals, they could use the siren’s song to make a victim kill themselves in any number of ways before the effect faded. “Then why do you keep killing them?”\n He shrugged, raising his hands up as he did. “Succubi were quite easy; it was merely a bend of their inherent powers. A reversal, if you will. But sirens are not built to transfer power…the results are unpredictable and irreversible.” His smile returned. “But don’t you worry your pretty head about it. I’ll figure it out. And if a few bitches die in the process…” He shrugged and the smile that blossomed on his face made bile rise in my throat.\n Whatever other goals moved him, I’d bet my badge that Koslov’s primary motivation was hurting his victims.\n I snorted. “Doesn’t seem likely. I hope you don’t run out of succubi anytime soon. Maybe you’ll have to move on to incubi—and they’re still pretty tough to find. Hope you have some women in your buyer ranks. Or maybe incubi just don’t move you in the same way?” I watched his face carefully as I spoke, and the slight snarl that arose at my question clinched it for me. Koslov had a serious issue with women.\n It fit.\n He kidnapped female-only species, and succubi and sirens were women who could control people with their powers. “So what woman pissed you off, Koslov? Let me guess, Mommy was a little controlling? She didn’t hug you enough?” I lowered my voice, as if I had an intimate secret to share. “Or maybe she hugged you a little too much?”\n He snarled something in Russian at me, and then said, “Get her the fuck out of here!” to Leon. \n","sourceLink":"https://allnovel.net/succubus-lost-files-of-the-otherworlder-enforcement-agency-2/page-21.html","bookId":2263,"book":{"id":2263,"title":"Succubus Lost (Files of the Otherworlder Enforcement Agency #2)","description":"Storyline: \n Succubus Lost (Files of the Otherworlder Enforcement Agency #2) \n Someone is kidnapping and incinerating otherworlders beyond recognition, and detective Marisol Whitman, a succubus, races to find the murderer before he claims another victim. But her pursuit is derailed when her responsible younger sister vanishes. Marisol suspects foul play and enlists support from an unlikely source: an agent from the Otherworlder Enforcement Agency, Valerio Costa. \n When the trail pointing to everyone from vampires to witches dries up, Agent Costa admits to knowing more than he’s shared. Marisol’s sister’s kidnapper harnesses more magic than she can imagine—and they’re running out of time. To find her sister before her powers are drained and twisted beyond recognition, Marisol must connect the dots between cases and put her trust in Costa, a salamander who may burn her before she can solve either case.\n \n","cover":"https://allnovel.net/images/succubus-lost-files-of-the-otherworlder-enforcement-agency-2.jpg","author":"Tiffany Allee","type":"Mystery","source":"allnovel","link":"https://allnovel.net/succubus-lost-files-of-the-otherworlder-enforcement-agency-2.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:20:24 PM"}}
