{"id":87287,"no":9,"title":"Page 9","content":"\\n\\n “And?”\\n\\n Business. Focus on business. Focus on working the case.\\n\\n Focus on finding Elaine. “No dice. She’s either blocked by magic, out of Natalie’s range, or…” The thought that Elaine might be dead stomped out the last bit of my lust.\\n\\n “What’s this information you couldn’t give me over the phone?”\\n\\n Finding bravery in my resolve, I looked back to his face. His expression had hardened to its normal cold calculation. None of the fire remained, and I suddenly wondered if I’d imagined it. No. I was a lot of things, but sexually unobservant was not one of them. As a succubus I had an inhuman grip on my sexuality, and that of those around me. It was my natural gift, my natural weapon.\\n\\n My natural curse.\\n\\n I didn’t think about it much, anymore. But standing in front of him, I wondered if my aura of sexuality affected him. Well, it almost certainly did on some level—the aura wasn’t something I could turn off—but he might be able to ignore it, for the most part. After all, it didn’t make me that much more noticeable than your average attractive woman, just a smidgeon more—just enough to make me a bit more distracting than most.\\n\\n “I owe you an apology.”\\n\\n My eyes widened, and red crept up his neck.\\n\\n “I made a bad assumption, about you flirting with the security man. That wasn’t fair of me. I know that you have to use what you’ve got to get information from people in this business.” He shook his head and a bit of damp hair clung to his forehead, and I made a fist to avoid reaching out to brush it away. “It makes sense, your approach. I just…reacted.”\\n\\n I nodded, unable to speak for a moment, and a strange feeling spread through my chest. “Do you have something against succubi, Costa? Or do you just react that strongly to all the people you work with?”\\n\\n He flinched. “That’s none of your business.”\\n\\n “I think it is. If we’re going to work together on this, I need to know that I can trust you to have my back.”\\n\\n His face reddened. “You can trust me, but I’m not going to get into my fucking personal business with you.”\\n\\n Oh yes. Valerio Costa had some personal issues with my species and me. I frowned at him but didn’t push. The likelihood of him confiding in me now was somewhere between zero and none.\\n\\n “Look, I’m sorry for how I reacted earlier.” He cleared his throat and gestured toward the desk. “Maybe you should sit down.”\\n\\n “Come on, whatever you tell me can’t be any more shocking than that apology.” I gave him a small smile, but he didn’t return it. Instead, he ran his fingers through his hair and looked down. I shoved my chin farther up. “I’m fine. Just spit it out, please.”\\n\\n “It’s Wendy.” He reached forward and grasped my shoulder, and for a brief moment I wanted to lean into that grip, into his body. Let someone comfort me for once.\\n\\n But I couldn’t do that. For one, he’d almost definitely push me away. For another, it was too dangerous. Comfort too easily led to other things. So I tried to focus on what he was saying, clinging to Wendy’s name like a life raft.\\n\\n “Wendy?”\\n\\n “I’m sorry, Marisol. She’s dead.”\\n\\n Chapter Six\\n\\n “She’s—” My voice caught in my throat, and I tried to swallow around the lump that had formed. A deluge of feelings crushed me, and I couldn’t breathe. Wendy was dead. Gone. The brave girl who’d defied her parents and culture to attend college. The smiling friend who’d helped bring Elaine out of her shell. The understanding siren who’d helped make my sister whole.\\n\\n Costa pulled me close and wrapped his arms around me in an inescapable hug. I struggled to breathe evenly. I couldn’t lose it, not now.\\n\\n “Elaine?” I gasped out.\\n\\n “No sign of her yet. I’m sorry, but that’s a good thing.\\n\\n Really. She’s out there and we’re going to find her.”\\n\\n I didn’t move for a few moments. For those brief seconds I leaned against his hardness and took in his clean scent. I hadn’t known Wendy all that well, but she had been a regular visitor to our house lately. She’d always been kind to me and as far as I could tell, to Elaine. And by helping Elaine, by becoming her friend, she helped me more than the sweet siren could have known. She alleviated the pressure of being the only one to care for Elaine, the only one who tried to bring her out of her shell.\\n\\n And for that, I loved her.\\n\\n I pressed my hands against Costa’s chest and pushed myself back. I could feel the heat of his skin beneath his shirt, and it struck me that for once, he wasn’t cold. I steeled myself and met his gaze with as level a look as I could summon, ignoring the wetness I could feel on my cheeks that now marred his otherwise dry shirt.\\n\\n “How do you know she’s dead?” I asked.\\n\\n “That’s complicated.”\\n\\n “Complicated? You haven’t told me everything,” I said. It wasn’t a question. “You’re going to tell me what you know. Now.”\\n\\n “Look, there are things I can’t—”\\n\\n “Now, Costa!” My voice cracked and he took a step toward me. I waved him off.\\n\\n He sat down heavily on the bed and rubbed his face.\\n\\n “Fine. Sit down,” he said.\\n\\n I pulled the office chair from the desk and turned it to face him. I sat, keeping my posture straight, careful not to lean toward him. I had to concentrate, keep my mind on finding Elaine.\\n\\n “We’ve recovered one succubus out of who knows how many that he’s taken.”\\n\\n I took a deep breath. “He?”\\n\\n “Yes, she confirmed the kidnapper was a man, but she couldn’t recall what he looked like. A spell, we suspect. But if he used a spell, it was clever enough that our Covenant witch couldn’t undo it.”\\n\\n “Not surprising,” I said, relieved that my voice sounded far stronger than I felt.\\n\\n He blinked at me. “What do you mean?”\\n\\n “Magic’s a helluva lot easier to do than undo. I mean, if her memory were wiped, it would be like cleaning a car.\\n\\n Even though you knew the mud was there, could find it in the drain it washed down, you still couldn’t paint it back onto the car and make it exactly how it was before you cleaned it.”\\n\\n He pressed his elbows against his knees and leaned forward. “That’s what our witch told us. But it took him two hours and a fucking whiteboard to explain it.”\\n\\n I shrugged, uncomfortable. “I studied witchcraft, amateur stuff mostly.”\\n\\n “Why?”\\n\\n I shook my head. “Elaine had some bad history. I just...I tried to find a way to undo it.”\\n\\n He gave me a quick nod. “I read the file.”\\n\\n My eyes were suddenly moist again, and so I examined the wall to his left.\\n\\n “Anyway. The girl we rescued had been sold to a man—a human. We recovered her because his private plane was randomly searched as he was leaving the country.”\\n\\n I snapped my head back to him. “What? A human couldn’t control a succubus—even a weak one—for long.\\n\\n I mean, it might take her a few times but eventually she’d drain him if he touched her. That doesn’t make any sense.”\\n\\n He rocked back on the bed, stretched, and resumed sitting. I tried not to notice the muscles moving under his shirt. That was more difficult—now that I knew what they felt like under my hands.\\n\\n “She’d been altered.”\\n\\n “Excuse me?”\\n\\n “Magically.” He took a deep breath. “Basically, someone figured out how to reverse the normal succubus process. Instead of being able to pull power into herself from the person she was sleeping with, she was able to give it. And—”\\n\\n “And?” There was more? Wasn’t this bad enough? I could barely get my mind around the implications.\\n\\n “They removed the…baggage that usually comes along with bonding with a succubus.”\\n\\n “Baggage? You mean the emotional connection, the feelings.” My shock twisted, and suddenly I could barely breathe, I was so angry. “They made them into fucking human batteries, that’s what you’re saying? Human batteries to be raped and used and sucked dry?” The sympathy that flashed in his eyes was too much. “And you knew this. You knew this and didn’t tell me. What the hell, Costa?”\\n\\n “I’m sorry,” he murmured. “I didn’t think it would help, and I didn’t want to distract you from the case. We still have time to find her. We will find Elaine before they do this to her.”\\n\\n I opened my mouth, to yell or to cry, I wasn’t sure which. But his words stopped me. “What do you mean?”\\n\\n My voice was thick with emotion, and I couldn’t seem to get a grip on it. I had to. Had to force it down, keep focused. Had to find Elaine.\\n\\n “The process—the change, it takes weeks. Weeks where the succubus can’t be moved and is held in the same city she was taken from. I think she’s still here, Marisol.”\\n\\n “You found this out from the succubus you saved?”\\n\\n “Yes. She recognized the area she was held in, an old warehouse in her hometown—St. Louis. She knew she hadn’t been moved because it sounded like her home, smelled like it. She grew up not far from where they held her.”\\n\\n “You were able to track down the warehouse?” I shifted in my seat. Yes. This was good. Evidence I could concentrate on, use it to focus.\\n\\n “Yes, we found it.” He frowned. “But it didn’t actually lead us anywhere. The warehouse was owned by a large company and just rented out under the table for cash.”\\n\\n I pressed on my temples. Something wasn’t right about this. Companies didn’t do that, did they? “Was there anything fishy about the company?”\\n\\n “Only that it was owned by your very own local Magister.”\\n\\n The headache just starting in my temples pulsed harder. “We should talk to someone at his company.”\\n\\n “I’ve been working on setting that up, but it’s a long shot, since it was rented under the table. The Magister probably never even knew about it. But it can’t hurt to try to get his records.” \\n\\n","sourceLink":"https://allnovel.net/succubus-lost-files-of-the-otherworlder-enforcement-agency-2/page-9.html","bookId":2263,"book":{"id":2263,"title":"Succubus Lost (Files of the Otherworlder Enforcement Agency #2)","description":"Storyline: Succubus Lost (Files of the Otherworlder Enforcement Agency #2) \\n Someone is kidnapping and incinerating otherworlders beyond recognition, and detective Marisol Whitman, a succubus, races to find the murderer before he claims another victim. But her pursuit is derailed when her responsible younger sister vanishes. Marisol suspects foul play and enlists support from an unlikely source: an agent from the Otherworlder Enforcement Agency, Valerio Costa. \\n When the trail pointing to everyone from vampires to witches dries up, Agent Costa admits to knowing more than he’s shared. Marisol’s sister’s kidnapper harnesses more magic than she can imagine—and they’re running out of time. To find her sister before her powers are drained and twisted beyond recognition, Marisol must connect the dots between cases and put her trust in Costa, a salamander who may burn her before she can solve either case.\\n","cover":"https://allnovel.net/images/succubus-lost-files-of-the-otherworlder-enforcement-agency-2.jpg","author":"Tiffany Allee","type":"Mystery","source":"allnovel","link":"https://allnovel.net/succubus-lost-files-of-the-otherworlder-enforcement-agency-2.html","creation":"Oct 5, 2019 8:58:31 AM","modification":"Oct 5, 2019 5:20:24 PM"}}
