{"id":90600,"no":11,"title":"Page 11","content":"\n As we passed a cattle lot, the fool creatures screamed and bawled and rolled their eyes, skittering away from me and huddling in the shadows, wearing shawls of their own droppings. My prey in Freesia had always been so elegant, so pretty and poised, wild animals and carefully groomed servants. These dumb creatures had nothing to fear from me, no matter how hungry I might have been. I still had standards.\n We finally entered the alley by the wall, and Casper led us along under its shadow.\n “Here are the rules,” he said. “For the bank and for whatever we find after that. Princess, you pretend to be a common Pinky. Deferential, meek, frightened even. Don’t speak unless you have to. And don’t stare too long at exposed skin, if anyone is stupid enough to have it. Do you have an alias?”\n “How about Anne Carol?” I could hear the sneer in Keen’s voice. I kept my face carefully blank and shrugged as if I didn’t care what they called me.\n Casper thought a moment. “That’ll do. Anne Carol it is.”\n He stopped and spun Keen around, nudging her under a gas lamp and using her skinny back as a writing desk for a piece of worn brown paper. He scribbled something with a brass fountain pen and waved the page in the air to dry the ink.\n “So that’s done. I’ll be posing as your uncle, since you look like you’re eighteen and have hair a similar color to mine now. I’m chaperoning you en route to a job as a governess to a baron’s house in Muscovy. I’m a musician. Keen is my servant. Everybody got that?”\n “I don’t like it,” I said.\n “Neither do I,” Keen said, hard on my heels.\n Casper didn’t even turn around. “Tough.”\n We had reached the gate by then, a huge and rusty affair with a lamp-lit guard box to the side.\n “Papers!” the guard shouted, his voice magnified by a speaker. I couldn’t even see his face, just a tall brown hat and goggles. He might as well have been a brass clockwork, for all I could see. Which was probably the point.\n Casper put a packet of brown papers into a metal box, which withdrew into the guard post with a ringing clank. “Casper Sterling. Lorelei Keen. Anne Carol. Will you be returning to London?”\n “Lorelei and I will. My niece is traveling to be a governess in Muscovy.”\n The box shot back out, and Casper took our papers.\n “May Saint Ermenegilda have mercy on your soul, Miss Carol,” the guard said.\n Before I could ask what on earth he meant by that, Casper had me by the arm and propelled me and the trunk toward a large gray vehicle that shuddered, chugging in place against a dark and cloudy sky. We stepped up stairs mere inches away from the heavy treads, and Casper handed the driver our tickets.\n “About time,” the thick man muttered around a pipe before clomping outside to stow our trunk.\n I ducked through the narrow door. The inside of the bus-tank didn’t smell any better than the fuggy cloud around the begoggled driver. It was less than half full, and most of the other passengers looked to be of the low-class, seedy sort I’d only read about in newspapers. Traveling salesmen wore extra-tall top hats buttoned tightly under the chin, with enormous unfolding suitcases beside them on their seats. Young men who had likely sold their souls to the navy or something more piratical quivered fearfully in place, en route to sinking ships and sea monsters. One other woman, who looked more masculine than the driver, held a corncob pipe clenched in yellow-streaked teeth, squatting across two seats like a citadel over a river.\n Casper led us to the back, pointing me toward the very last seat. He shoved our bags into the bins overhead. As Keen settled in front of me, Casper slid onto the bench, his leg pressing warm against mine.\n “I brought you something to read.”\n He shoved a rolled-up tube of greasy newspapers into my hand. I felt something hard in the middle and sighed in relief. A corked vial of blood, wrapped with yet more newspaper and tied with twine. I untied it and held a section of newspaper in front of my face to hide the vial as I gulped, and Casper leaned over to block the view from the aisle. His face was so uncomfortably close that my eyes sought the newspaper, and that’s when I noticed that it was the London Observer, and I was staring at a section labeled “News of Sang,” including updates on “Victory in Freesia.”\n “Victory in Freesia? That does sound like a good read, uncle,” I said.\n He chuckled darkly and handed me a red handkerchief, which I stared at in confusion.\n “I think you’ll be disappointed, niece. Don’t forget who writes the papers in London.”\n I expected him to leave me then, but he didn’t budge from my side. As I scanned the story and finally understood the depth of my country’s trouble, I put my head to his shoulder and wept.\n 9\n When I pulled my face away from Casper’s shoulder, the handkerchief between us was sticky with blud tears. Much to my surprise, his arm was around me, and even more to my surprise, I didn’t care. The fall of my family may have seemed like a victory to the Pinkies of London, but for my people and my country, it was a tragedy.\n Casper had told me the truth. Freesia was collapsing. My parents were recently executed, my sister and I had been missing for years, and my younger brother, Alex, was in thrall to Ravenna.\n According to reports from Muscovy, the upstart gypsy witch had deposed or murdered several landed barons and hand-picked their replacements on the Blud Council, our token House of Lords. She had been declared prime minister and was absorbing several of the Tsarina’s roles as she stood at Alex’s side. And she was having a statue raised in honor of the lost Princess Olgha, whose ship had supposedly been sunk by her younger sister, the bastard half-Svede Ahnastasia. I was also presumed dead, but the price on my head had gone up even more.\n Which I could handle. I no longer resembled the doe-eyed, long-haired ice angel in the newspaper image. What pained me the most were the rumors that my brother Alex was in love with Ravenna and on the verge of marrying her. The papers claimed that she fed him secret medicines and magic potions to combat his chronic ferocity, trying to tame the hot blood that made him little more than an animal and the only Feodor sibling incapable of taking the throne. No wonder he was the only one she had left alive—he was by far the most easily mastered.\n I fought the urge to rip the paper to shreds with my teeth and then kill everyone on the bank. I had never felt so helpless, so far from home. I looked out the window, watching the endless green of the moors roll by, willing the bank to speed up. But the gears kept grinding, and the engine kept burning, and we plodded along at the speed of a fast trot. I had to lash out at something, so I kicked the seat in front of me with a growl.\n Casper chuckled softly, a look of grim understanding in his eyes. “Makes you want to burn down the world, doesn’t it? Knowing that what you want most is far away. That your old life is gone forever.”\n “My entire world.” I stroked a finger down the thick, cloudy glass. “My family. My country. Gone in a heartbeat. Gone, while I slept.” I wiped away another tear. “I’m completely alone.”\n The silence fell heavy between us. I could sense that he wanted me to look at him, that there was something he wanted to tell me. But I resisted. What I felt—it was too much. He couldn’t possibly understand.\n With a last, sorrowful sigh and a hand on my shoulder, he said, “You’re not the only one who’s ever lost a world, you know. And you’re only as alone as you want to be.”\n He slipped back onto the bench in front of me. Keen murmured in sleepy annoyance as he settled down beside her. I should have been exhausted myself, but I was caught between sorrow and uselessness and hunger, trapped on a slow, plodding bank with my listless, clueless prey. Had they known what I was, what I wanted to do to them, they would have hated me. It was an uncomfortable feeling, being hated by creatures who had all but worshipped me in my youth, even as I fed from them. The Pinkies of Sang were so different from the ones in Freesia.\n I looked over at the nearest passenger, trying to see past his blood to the person below. It was a young man in a sailor’s uniform sitting diagonally from me. His silly white hat extended down over his neck and buckled to his navy-blue jacket. His eyes glanced nervously around the bank, full of fear, and he panted as if he were losing a fight against his uniform’s chin strap. Closing my eyes, I inhaled. I could smell his terror, as sure as a hawk could sense a baby bird in its nest. This boy had most likely chafed at being cooped up in London, probably bragged to his friends and his girl about joining the navy and seeing the exotic places of Sang. And now he was petrified of the outside world. He smelled of dead plants and cheap soap. Like a peasant.\n But most of all, he smelled of blood. Sweet, warm, deep. I could scent it on his breath, see the tiny patch on his cheek that he’d sliced open shaving that morning. In my old life, he would have knelt before me, in his proper place, cleaned and dressed, his hair parted just so, and I would have taken my due with great care and restraint. Instead, I exhaled and pressed the grease-splotched newspaper against my nose, willing myself not to think about food. After four years of starvation and a few tiny vials, he was still more appetizer than equal.\n At least Casper and Keen didn’t smell so good to me. She was too filthy and covered up, and he had that strange stink. It reminded me of something I had read once about how wild animals would urinate around their dens, marking their territory as a warning. But who had marked him? And what in Sang had driven Casper to kiss me? And why was I more curious than angry about it?\n Feelings warred inside me, sadness and loss and fury and hunger and the deep, pounding need for revenge. And something else, a softening warmth that seemed to radiate from the shoulder Casper had just squeezed. For a moment, I caught the soft glow of his hair over the edge of his seat, but he gave a dreamy sigh and shifted away. I turned my face to the window, trying to ignore the odd longing tugging at my heart where no longing had any right to be.\n I watched the grasses roll by, the smooth darkness of the moor outside broken up only by the stars shining on an occasional copse or abandoned town or warren of bludbunnies. My eyes dipped closed. And eventually, I slept. \n","sourceLink":"https://allnovel.net/wicked-as-she-wants-blud-2/page-11.html","bookId":1598,"book":{"id":1598,"title":"Wicked as She Wants (Blud #2)","description":"Storyline: \n Wicked as She Wants (Blud #2) \n When Blud princess Ahnastasia wakes up, drained and starving in a suitcase, she’s not sure which calls to her more: the sound of music or the scent of blood. The source of both sensations is a handsome and mysterious man named Casper Sterling. Once the most celebrated musician in London, Sangland, he’s fallen on hard times. Now, much to Ahna’s frustration, the debauched and reckless human is her only ticket back home to the snow-rimmed and magical land of Freesia. \n Together with Casper’s prickly charge, a scrappy orphan named Keen, they seek passage to Ahna’s homeland, where a power-hungry sorceress named Ravenna holds the royal family in thrall. Traveling from the back alleys of London to the sparkling minarets of Muscovy, Ahna discovers that Freesia holds new perils and dangerous foes. Back in her country, she is forced to choose between the heart she never knew she had and the land that she was born to rule. But with Casper’s help, Ahna may find a way to have it all….\n \n","cover":"https://allnovel.net/images/wicked-as-she-wants-blud-2.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wicked-as-she-wants-blud-2.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:42:31 PM"}}
