{"id":90617,"no":28,"title":"Page 28","content":"\n “I ain’t a poof!” Gandy shouted, unbuckling his belt and trying to shove himself closer to me. “Let me in, and I’ll prove it! I’m smaller than you, anyway. I’ll get her started for you.”\n With a leisurely swing of his fist, the big pirate sent Gandy into the wall and to the ground beside Casper.\n “This one”—he pulled lips back over teeth of glinting gold—“is mine.”\n With animal quickness, McHale launched himself at the big pirate, driving him into the bed across my legs. I smelled the blood before I saw it, and the beast took me over. I had slipped my legs out from under the big pirate’s body and pressed my face to his wrist before I noticed McHale poised over the pirate’s red-splattered neck. The body danced beneath us as the big man screamed and fought for his life. Together, we held him easily.\n “You,” I growled.\n “Eat first,” he said with just a hint of a Freesian accent. “Then we’ll talk.”\n My eyes held him for one moment, not trusting my good luck. My savior was a Bludman, and one more than willing to share, which was a prize rarer than rubies.\n “You’re generous.”\n “I am honored to share the kill.” He took one long pull and bowed his head to me, blood dripping from the corner of his mouth. “My princess.”\n 20\n It was oddly intimate, sharing someone’s kill for the first time. The room was a warm cocoon of comforting sounds. The polite slurping of blood rose gently over the rhythmic breaths of the still-living men, and I sighed in contentment to feel my hunger sated for the first time in days. The big pirate was fantastically full of blood.\n I left the last pull for my host, as it seemed the polite thing to do. But he sat back, too.\n “Please, my lady. It’s yours.”\n I paused, considering. But the princess in me won out, and I drew the last of the hot blood down my throat and wiped my mouth off on the dead pirate’s sleeve.\n With a nod, McHale tidily looted the big pirate’s body. When he held out a handful of coins, trinkets, gems, and pearls to me, I shook my head. Not because I didn’t need money but because now that he was dead and bloodless, everything about him struck me as disgusting.\n Kneeling across from each other over the deflated body of the pirate, we were both seized by a sudden awkward shyness. McHale flipped the goggles on top of his head to gaze at me with ice-blue eyes and concerned curiosity. I was at a loss for how to behave. He knew who I was and showed proper respect. Did I address him as I would address a Bludman in my country, with total majesty and arrogance? Or did I respect the fact that he had just protected me from a larger predator and shared his meal with me, putting us on more equal footing?\n Yet again, he swooped in with perfect courtesy. “My princess, you are weak. Have they been keeping you on this filthy tub for long?” His Freesian accent was more pronounced now that we were alone, and his eyes were anxious. But that didn’t mean he could be trusted. He could easily be a spy or someone under Ravenna’s power.\n “I am not here against my will.”\n “But you are not . . . one of the . . . Maybuck’s offerings?”\n “No.”\n He exhaled and ran a hand down the sparse dark stubble of a beard. “Then I don’t have to kill everyone. That’s a relief.” I chuckled, and he added, “Except these two, I suppose.” He stood and curled his gloves into fists, eyes latching onto Casper.\n “No!”\n His eyes darted to me. “My princess?”\n “Kill the pirate, if you wish, but leave the other.”\n He nudged Casper with a toe, contemplating the fineness of his coat and watch chain, I suppose, and the careful shine on his boots.\n “Are you sure? He would be the cleanest thing I’ve eaten in weeks. And you need blood, my liege. As much as possible.” He shook his head sadly. “So thin. So wan.”\n “That man is my servant, and I’ll not have him harmed.” The mantle of royalty fell back over me, my spine going sharp and straight at his slight insult. “The other I will allow you.”\n He bowed briefly before kneeling over Gandy with a formal sort of precision lacking in his attack on the bigger pirate. Rolling down the man’s collar, he wrinkled his nose. “I won’t be sorry to see this one go.”\n He ripped the jugular gently, as if trying to show me his good breeding. With a question in his eyes, he held up Gandy’s arm, and I gladly took it. Together, we held the body down as it fought senselessly against oblivion. This time, I insisted he take the last pull and went to check on Casper.\n I crouched beside his unconscious form, picking up the weapon that had knocked him out.\n “Boomerang,” McHale said, taking it from my hand. “He should be unharmed.”\n I traced the purple bruise on Casper’s temple, where the burnished wood had slammed into him. It was strange, seeing my black-scaled hands and white talons against his golden skin. He was halfway between Bludman and Pinky, predator and prey, and I was curious to know what would happen to his hands were he ever bludded. Was the transition sudden, or would the fine fingers slowly fade to dark? At least he would still have the harpsichord, if it came to that. So long as the talons were kept trimmed, a Bludman could play just as well as any Pinky, if not faster and better.\n Without meaning to, I found myself brushing the hair back from his sleeping face, remembering the feeling of copper-colored tendrils curling around my fingers like unanswered question marks. If only he had more bludwine in his bottle. I wanted to taste it again. I had enjoyed that looseness, that release, more than I wanted to admit.\n Tall, buckled boots stepped close, and I pulled my hand back guiltily.\n “He should be awake soon,” McHale said. He nudged Casper in the side with the toe of his boot, and Casper’s eyes jerked open.\n “Ahna!”\n He scrambled upright and shoved me behind him. Still dizzy and wobbling, it struck me to the heart that his instinct, even damaged and uncertain, was to protect me. McHale just laughed, a distinctly Freesian sound, and clapped him on the shoulder as if he was an unruly hound.\n “That’s a good servant, your highness. Jumping in front of you like that.”\n Casper shrugged off the pirate’s hand and bristled as he took in the room. Two dead bodies, a minimum of blood spilled. And me, standing behind him, one step away from fretting, my cheeks pink with blood and feeling bad for a reason I couldn’t name.\n “You okay, Ah—” He swallowed. “Anne. Did he hurt you?”\n “He saved me. The big one on the bed knocked you out and came after me, but McHale stopped him.”\n Casper looked from my mouth to McHale’s, both stained with red. “I see.”\n I pushed past Casper to stand between them. The air was cloudy with the scent of blood, and I could sense each man’s hackles rising as if they both wanted nothing more than a fight. It was an awfully small room for two bristling males, and it was left to me to defuse the tension before I lost one or more of my allies.\n “McHale, you’ve been so kind. Can you tell us what’s happening on the ship?”\n With a chuckle, the pirate’s stance relaxed. “Please call me Mikhail, princess. And what’s happening is an act of piracy. Captain Corvus of the Bludeagle has invaded the Maybuck.”\n “Then all the girls are being . . .” I gulped. What the big pirate had planned for me might have been their usual way of business, but I hated the thought of all the women on board being forced.\n But Mikhail shook his head. “The Maybuck is famous, and not for the coin. I suspect my captain and your Miss May had a deal that would benefit both parties. We sent a scout several days ago to make the arrangements. Although he didn’t return, Miss May must have accepted. It was far too easy, the way your ship sat, waiting for us. You were unlucky that Big Gar found you first.”\n “And why do you move among these barbarians?” I asked, for he seemed polite, cultured, and clean for a pirate.\n Mikhail’s eyes narrowed at Casper. “Can this one be trusted?”\n I nodded once. “I trust him with my life.”\n “Very well. Ravenna needed room on the Blud Council for her pawns, so many of the ancient barons were deposed or executed. I am a bastard son, and when my father was thrown out, I had nothing left. We formed a group and fought against her, and we lost. With Ravenna’s mark, there’s no way to prosper in what’s become of Freesia.” He pulled back his glove to show a stark red symbol burned into his wrist, an X inside a circle.\n “So this mark means . . .”\n “No succor. No blood. No trade. In a grand feat of irony, she has turned Freesia’s own royal sons into gypsies. Piracy seemed a safe enough option. There’s plenty of blood, in any case.”\n “And your captain doesn’t mind?” Casper asked.\n “It’s all the rage among air pirates, keeping pet Bludmen. Like dogs on a chain. I brought a few of my fellows with me, but they’re always careful to break us up on little runs like this. I won’t miss Big Gar.” He spat, and the red glob clung to the big pirate’s sunken cheek.\n As I watched it slowly slide to the carpet, Casper exhaled in a burst and grabbed Mikhail by the arm, taking us all by surprise.\n “We have to get off this boat before Ahna is discovered. Three of us. In Minks.”\n Mikhail jerked his arm out of Casper’s grasp and gave him a look of grudging measure. “We’re a day away, at this pace. But the captain will want to know what happened to Gar and Gandy. He’ll blame me. If he finds you, you won’t live to see Minks at all.”\n “Then how can we get to the ground?”\n Mikhail’s eyes sharpened as he looked us over. “Parachutes, if you know where they are. The princess must be protected at all costs. Where is the third person?”\n I looked to Casper and saw my own desperation mirrored. We two had been lucky, but what had become of Keen? The screaming above deck had stopped, and I could only hope that meant the girls had found a way to calm their new clients. \n","sourceLink":"https://allnovel.net/wicked-as-she-wants-blud-2/page-28.html","bookId":1598,"book":{"id":1598,"title":"Wicked as She Wants (Blud #2)","description":"Storyline: \n Wicked as She Wants (Blud #2) \n When Blud princess Ahnastasia wakes up, drained and starving in a suitcase, she’s not sure which calls to her more: the sound of music or the scent of blood. The source of both sensations is a handsome and mysterious man named Casper Sterling. Once the most celebrated musician in London, Sangland, he’s fallen on hard times. Now, much to Ahna’s frustration, the debauched and reckless human is her only ticket back home to the snow-rimmed and magical land of Freesia. \n Together with Casper’s prickly charge, a scrappy orphan named Keen, they seek passage to Ahna’s homeland, where a power-hungry sorceress named Ravenna holds the royal family in thrall. Traveling from the back alleys of London to the sparkling minarets of Muscovy, Ahna discovers that Freesia holds new perils and dangerous foes. Back in her country, she is forced to choose between the heart she never knew she had and the land that she was born to rule. But with Casper’s help, Ahna may find a way to have it all….\n \n","cover":"https://allnovel.net/images/wicked-as-she-wants-blud-2.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wicked-as-she-wants-blud-2.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:42:31 PM"}}
