{"id":90626,"no":37,"title":"Page 37","content":"“And I can smell you, fool. Who sent you?” He chuckled, low and deep. “Your father.” I reached out until I found Casper and traced down his arm until I found his hand on the assassin’s shoulder, pinning the larger man down. Before he could ask me what I was up to, I felt down Casper’s half-dressed torso for the knife he wore always on his hip. Once I had it in hand, I knocked him off and straddled the man in his place, ignoring the damp water that stung my knees. “Here’s a message for my father,” I said in Sanguine, and I plunged the knife into his chest, right where I could hear his heart beating. He struggled for just a moment, but the strike was swift and sure, the knife lodged firmly in his breast. “What did you do?” Casper asked. “What I had to.” The man shuddered and bucked under me for a moment longer before going still and cold. “Get me a light,” I said, suddenly overcome with a grand idea. “And a cup or a bottle. Hurry.” Casper sighed and stood. “Do I even want to know what you’re doing now?” “What I have to,” I said. He left the room before he could hear me whisper, “For you.” He returned with an antiquated lantern, a teacup, and an empty wine bottle. “They’ll have the lights back on soon. He took out the whole car, and everyone’s raising a big stink over it. The carhop was handing out lanterns.” He reached into his waistcoat, now smooth again over his buttoned shirt. “And he sent these, with his apologies.” The two vials of blood were heavy and cool in my hand, but I had other priorities. We had to hurry. “Drag him into the bathroom. There’s a narrow tub.” Because I’d paid extra for it, of course. In the light, the man was revealed to be tall but wiry and wrapped entirely in black leather. He wore strange goggles and carried dozens of knives and an instrument that squirted seawater when a trigger was pulled. Together we dumped the body into the tub. Casper didn’t understand what was happening until I sliced the assassin’s black sleeve with his own knife and slit the crease in his elbow by the sparse light of the lantern. “Oh, Ahna. God. Do we have to . . .” And then he smelled the blud. His eyes went to pinpricks, his breathing speeding up. “So much of it. I’ve never seen so much at once.” I handed him the assassin’s arm and quickly tipped the full teacup into the wine bottle. Casper’s mouth sealed over the wound in the man’s elbow. When I couldn’t pry him off that cut, I made a new cut in the other elbow and kept going until the flow got sluggish and the wine bottle was half full. Between his feeding and my tidiness, we hadn’t spilled a drip of blud. Casper finally dropped the arm in the assassin’s lap, licking his lips in bliss. I held up the bottle, and he whooped and grabbed me up into a hug. “You beautiful, clever girl.” “Can’t have you going mad when we’re this close to Freesia, now, can we?” The lights buzzed back on just as he was about to kiss me, and the previously shadow-hidden form of the mercenary in the bathtub was suddenly the biggest thing in the tiny closet of a room. “Out the window, do you think?” Casper asked, and I nodded. “We’ll need to . . . how would Keen say it? Loot him first. But why is he wearing dark goggles?” “Night vision,” Casper said with a shrug. “So he could see once the lights were out.” I handed him the bottle and gingerly unbuttoned the assassin’s jacket. The fellow was dressed for dastardly deeds, his leathers the color of shadows. I pulled off his cap and goggles to reveal ice-white hair and eyes the same color as mine. The knife, it turned out, was lodged so deeply that the hilt had sunk into his flesh, which made it difficult to search his jacket. Still, I took a fierce pride in the evidence of my strength and righteous anger. Finally, I found what I was looking for. I slipped the packet of papers out of his pocket and opened the little book with trembling hands. “These are fake.” “How can you tell?” Casper leaned close to inspect the aged papers with their proper seals and signatures. “Because I was raised to topple kings, and an assassin never carries his true papers. I don’t even know what I was hoping to find. I already know the truth. The Svedish king wants me dead and most likely has a network of spies and assassins spread all over the Blud world, hoping to catch a glimpse of me.” “But why? If he’s your father, why would he want you dead?” I gave him a wry smile. “I may be his daughter, but he can’t claim me or use me. Ravenna’s Freesia is a weak thing, and Charles would love nothing more than to march on Muscovy and claim her for Sveden. I’m his only real impediment.” “Does this sort of thing happen often?” “They plague the palace like bludlemmings, but it’s rare that one makes it so close to royalty. It’s fortunate you’re still immune to seawater. There’s nothing more to gain from him. Help me get him out the window, will you?” With the determination and quiet strength I’d come to expect from him, Casper tugged open the window and leaned out to make sure no one else happened to be looking about at the same time. It was pitch black outside, the light from our lantern the only thing flashing on the rock wall of the tunnel. Together we hefted the rubbery body out the window and dropped it into the darkness, and the train chugged on as if nothing had happened. I kept my head out of the window for a moment, enjoying the smell of ice-frosted stone deep within the mountain. Revenge felt good. Casper pulled me back from the window and into his arms. “At first, I thought it was impossible. But now I’m starting to think you can do it. You’re just full of surprises, aren’t you?” In answer, I buried my head in his shirt. Breathing in, I could smell the change the blud had wrought in him. If I looked at his hands in the sunlight, I was sure they would be duller and a shade grayer. As little as I knew about halfbluds now, I could only assume that the more blud he drank, the closer he came to being like me. With the assassin’s blud corked in the bottle, he could stave off madness a while longer, but we both knew that every sip brought him one step closer to the bludding he so feared. I wanted him for my own purposes, and I wanted him soon, but I knew that I would have to wait until he was ready. I only hoped he wouldn’t hate me once the deed was done. Keen knocked on the door shortly thereafter to tell him their food had been delivered. He was still pretending to eat in front of her. She threw me a dark look before the door closed, and I realized my dress was still mostly unbuttoned. With businesslike tenderness, Casper rebuttoned me, dropping one warm kiss between my shoulder blades. “Always an interruption,” he murmured. “No one knocks on the queen’s door when it’s locked.” “Your door doesn’t lock anymore, thanks to Captain Clumsy Assassin. Will you be safe? I need to go, and I don’t know much about political intrigue. Are there more of them?” I could tell he didn’t want to leave me, but I understood now that Keen was his family, his tie to the part of himself that was slipping away. If I wanted him, I would have to share him with her. And so I would let him go. For now. “It’s safe. If there were two assassins on this train, we would probably be dead.” “That’s . . . not very comforting.” I gave him a gentle smile. “Sleep well, Casper.” “You, too, darlin’.” I was more than sorry to see him go. Not only because I had grown used to his company but also because I wanted to see what would happen if we continued our little game. Truth or Dare. What charming inventions they had in his world! The things that could be accomplished with such a game were limitless. I leaned against the shut door, imagining the way he had kissed me, the touch of his hands. They were just as clever as I’d imagined but warmer. What a vast difference between the boy on the bank, the pirate, and the Maestro, yet they’d all approached me with the same goal in mind. If only the assassin hadn’t intervened. I stepped in the puddle of seawater as I crossed to the bed and pinched my nose at the smell. I would have killed anyone who had interrupted us just then. Finally, a head that deserved a platter, and I’d just tossed him off the train. I unlaced my boots and curled up in bed. What had happened with Casper had left me cross and anxious. Unfinished. But I was too proud to call him back, and I didn’t have the words to say what I wanted anyway. I thought of the dozens of knives that had fallen into the darkness with the assassin, wishing I had thought to keep at least one. After his intrusion, I didn’t feel safe anymore. With a huff of annoyance, I rolled out of bed and went to the bathroom to see if I’d missed anything, but the only thing left was his goggles, which made everything glow a spooky green. Between this “night vision,” as Casper had called it, and the goggles that Van Helsing said revealed Bludmen, I would never trust eyewear again. The artificers were getting too good. And I needed one in the palace, on my side and working for the Bludmen. I tossed and turned, growling at the uncomfortable buttons up the back of my dress and wishing for something, anything, to soothe me. Not until I smelled Casper on the other side of my door and heard him singing that song about Jude did I relax enough to let sleep finally take me, knowing that he would keep me safe. If only I had been brave enough to invite him back in. The train’s brakes squealed, and I jerked awake. We were slowing down. That meant we were finally back in my homeland. I was at the window in seconds, gazing out at the ice-glazed city of Muscovy, the gem-shaped turrets rising into the deep blue sky to pierce the clouds. A rush of joy washed over me, little ripples swirling over my skin and making the tiny hairs rise on my arms. I was home. I was still far from the Ice Palace, but I was at least in a city that I knew and loved. One step closer to my goal.","sourceLink":"https://allnovel.net/wicked-as-she-wants-blud-2/page-37.html","bookId":1598,"book":{"id":1598,"title":"Wicked as She Wants (Blud #2)","description":"Storyline: Wicked as She Wants (Blud #2) When Blud princess Ahnastasia wakes up, drained and starving in a suitcase, she’s not sure which calls to her more: the sound of music or the scent of blood. The source of both sensations is a handsome and mysterious man named Casper Sterling. Once the most celebrated musician in London, Sangland, he’s fallen on hard times. Now, much to Ahna’s frustration, the debauched and reckless human is her only ticket back home to the snow-rimmed and magical land of Freesia. Together with Casper’s prickly charge, a scrappy orphan named Keen, they seek passage to Ahna’s homeland, where a power-hungry sorceress named Ravenna holds the royal family in thrall. Traveling from the back alleys of London to the sparkling minarets of Muscovy, Ahna discovers that Freesia holds new perils and dangerous foes. Back in her country, she is forced to choose between the heart she never knew she had and the land that she was born to rule. But with Casper’s help, Ahna may find a way to have it all….","cover":"https://allnovel.net/images/wicked-as-she-wants-blud-2.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wicked-as-she-wants-blud-2.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:42:31 PM"}}
