{"id":90630,"no":41,"title":"Page 41","content":"Head in his hands, he chuckled, on the verge of tears. “My God, woman. How do you keep doing that?” “Doing what?” “Taking everything from me and giving it back in one breath?” “I don’t know how to be sorry, Casper. For a princess, I’m not a bit tamed.” Nothing I said or did could change that. He was on the verge of laughing, on the verge of crying, as if he were standing at the edge of a great precipice and deciding whether to jump or not. Which, I had to suppose, was exactly what was happening in his heart. “You’re untranslatable, you mean.” “That she is, lad, that she is,” Verusha said, pulling out the little Turkish cigarettes she favored and lighting one with a clockwork lighter. The silence spread out, broken only by Casper’s mad giggles and the puffing of Verusha’s smoke rings. “What will you do, then?” I asked. “Sound my barbaric yawp, I suppose,” he answered. With sudden violence, he stood and yelled, “Goddammit!” before lunging out the door and slamming it in his wake. “Is he always this mad?” Verusha asked. I shrugged. “Aren’t we all?” 27 When I couldn’t hide among the cushions anymore, I followed Casper’s scent into the alley outside. Verusha didn’t have to say a word. Her heavy silence, her disappointed glare, was sufficient. She hadn’t raised me to cower from anyone, especially not halfblud abominations. I thought I heard her chuckle behind the closed door, but I was too embarrassed to check. I was half terrified that Casper had run out into the streets alone, where he would surely have caused trouble of one kind or another. According to the laws of Muscovy, a lone servant could suffer anything from the merciless teasing of children to impounding or corporal punishment. Fortunately, he was simply sitting against the brick wall of the lane behind the shop, his hat still firmly laced under his chin. “Do you hate me?” I asked. If the words were to be said, I wanted them to be mine and not his. He snorted. “I want to. But I can’t. I did this to myself. The universe is pointing me to the answer, and I don’t like it. I can’t blame you for that. It’s a journey, I suppose. I can’t stay in the same place forever.” I couldn’t sit beside him on the ground, where someone might see. So I slumped against the wall, my gown’s shoulder catching on the bricks. “What’s so bad about this life?” I gestured to the grand city around us and, more subtly, to myself. “Would you want to become a Pinky, Ahna?” I couldn’t help but shudder. “Ugh. No.” “Okay, so that’s how I feel about becoming a Bludman.” “But don’t you see? Your position is untenable. You can’t be human anymore. You can’t be a halfblud for much longer. Why not accept what’s inevitable? Why not choose it before something else chooses for you? It’s better to be curious than judgmental. Compare this place with London. The dark streets, the fear riding the wind, the bludrats and Coppers. There’s an elegance, a simplicity, to life as a predator. It’s well ordered, calm. We celebrate the arts as the humans cannot and care for the individual as they won’t. The only strife you’ve seen in this city was caused by the Pinkies.” “It’s not a case of who is better or who is right. It’s a case of giving up who I am, what I am. I exist as I am; that is enough.” “It very well is not. You’re in the midst of a metamorphosis, and hiding from it is flat-out cowardly. Butterflies don’t hide in cocoons; they bite their way out.” “Butterflies are extinct.” “You’re not.” He stood in one fluid motion that was more predatorial than he would have cared to know. Towering a foot over me, he forced me to look up at him, and warmth rushed over my cheeks as I realized how very close we were standing and how very incorrect it was for us to be looking at each other that way in the alley behind a prominent groomery. “You think I’m a coward, Ahna?” I poked him in the chest with a talon. “Only on this topic. The one that matters most.” “Say I went through with it, then. How would it work?” “I have no idea. But I’ll find out. And I’ll do it myself.” I didn’t realize the truth of it until I said it, but I couldn’t imagine allowing anyone else to share so intimate an experience with him. “You know it’s painful. I don’t want to cause you pain.” I shook my head at him. “Silly boy. It doesn’t matter if it hurts. Agonies are one of my changes of garment.” He chuckled and shook his head. “Do you believe in destiny and reincarnation and . . . No, don’t answer. It doesn’t matter.” His smile was gentle, tentative. He traced a line along my jaw with one finger and murmured, “You’re a mystic, baffling wonder, woman.” I beamed. “I’ll take that as a compliment.” He kissed me, gentle and swift. “If I’m going to be a great poet, at least I have a great audience.” Back inside, Verusha shooed him into the groomery proper to wash off the grime of our long journey. I bristled momentarily, watching two pretty girls lead him off, petting him and offering him cookies, but I quickly remember that to them, he wasn’t a man, much less an equal. He was a lapdog, a mindless creature to be cosseted and primped and displayed. After the bludding, I suspected I would be much more possessive of him. “Show me what you have, darleenk,” Verusha said, motioning me over to an open window where the sun puddled through filmy curtains. I had already plucked out a stone, the tear-shaped aquamarine heavy in my hand and as warm as a beating heart. When I held it in the sunlight, it winked as if snowflakes danced within. I tipped it into Verusha’s claws, and it rattled around as she inspected it. “Will it buy everything we need?” I asked. “Maybe yes. Maybe no.” She prodded it with a clipped white talon. “Hard to say, these days.” “I want the best. I want to be beautiful when I kill Ravenna. And he needs to match.” “I know these things.” She raised one eyebrow at me, but I didn’t blink or apologize. The trick with Verusha was showing respect but not obedience or doubt. “There is also a charm you might want. It makes the bludding easier. For you both. But very, very expensive and hard to find.” Without a second thought, I pried another stone from the necklace, a diamond. It was cold in my hand, as sharp and hard as the ice it resembled. “That, too, then.” She curled her hand around the stones, and they disappeared. The old woman nodded once, sharply, and withdrew a folded note from her shawl. The paper was thick and creamy, sealed with Verusha’s crest, the bastard signet of the House of Muscovy. “Go read it. Prepare yourself as much as you can. It’s an ugly business, to be sure, but he’s worth more bludded than dead or mad, yes?” My face carefully blank, I said, “Yes. But where should it happen?” Her lips pursed, wrinkling under the bright red paint. “Somewhere noisy,” she finally said. “Not here.” After a pointed look at the ravaged necklace in my hand, she turned and hobbled back toward the parlor and the sunny prospect of business as usual. For just a moment, I thought about Keen, wondering if she had survived her grooming without embarrassing restraints and, if so, how she was enjoying the waiting room, where the polite servants of local Blud families would spend their afternoons sitting contentedly on benches, eating sweets and waiting to be retrieved. The little creature was probably inciting a rebellion. I settled myself in the big chair. With my feet up and a belly full of blood that tasted like home, I was as ready as I could be for bad news. I broke Verusha’s wax seal, slipped the note open, unfolded it, and began to read. Halfway through, I took a hard look at the remains of my necklace and popped out three more small diamonds. We were going to need them to pay off whichever unfortunate innkeeper ended up scrubbing away the bloodstains and losing custom on account of the screaming. 28 I decided upon the Moravian district. Not only because it was far from Verusha’s shop and my family’s ancient palace but also because the Moravians were known for being loud, messy, and mysterious. Their wild parties to celebrate the coming snow started early and ended late. And their traditional costume was handy, too. No one looked twice at us as we slipped down the avenue wrapped in long shawls and turbans, all but our eyes well hidden. I’d never been to this part of Muscovy, as my parents had been prejudiced against anyone not of proven, pure-blud stock. I hadn’t seen any of the other foreign districts, either, although our carriage had passed by a New Year’s parade in the Dragon district when I was little, and I had sworn I’d seen a real dragon billowing white smoke into the sky. Once we had crossed under the exotically arched sign with “Little Moravia” picked out in bloodred and gilt, it was almost as if we were in another country. The lights were gold like the sun, rather than the orange that my folk favored. The stone was white and creamy, with accents in vibrant jewel tones that recalled the sea and palm trees and exotic fruits I’d only seen in paintings. Brightly colored cloth flags and pennants fluttered on strings strung between the buildings, giving everything a festive look that made me feel as if I was on an adventure instead of skulking around in disguise to all but kill a man for my own sinister purposes. The first inn we passed looked too shoddy, and the second was far too rich for the stones I’d chosen to part with. Fortunately, the third one seemed both reasonable and pretty, with a large mosaic of a camel picked out in glittering tile. “La Jamala,” Casper said, rolling the word around in his mouth. “I like it.” I nodded. “Camels are fascinating creatures. They can travel great distances, surviving on the blud stored in their humps. And when that runs out, they find another camel and eat its hump. Very resourceful creatures, camels.”","sourceLink":"https://allnovel.net/wicked-as-she-wants-blud-2/page-41.html","bookId":1598,"book":{"id":1598,"title":"Wicked as She Wants (Blud #2)","description":"Storyline: Wicked as She Wants (Blud #2) When Blud princess Ahnastasia wakes up, drained and starving in a suitcase, she’s not sure which calls to her more: the sound of music or the scent of blood. The source of both sensations is a handsome and mysterious man named Casper Sterling. Once the most celebrated musician in London, Sangland, he’s fallen on hard times. Now, much to Ahna’s frustration, the debauched and reckless human is her only ticket back home to the snow-rimmed and magical land of Freesia. Together with Casper’s prickly charge, a scrappy orphan named Keen, they seek passage to Ahna’s homeland, where a power-hungry sorceress named Ravenna holds the royal family in thrall. Traveling from the back alleys of London to the sparkling minarets of Muscovy, Ahna discovers that Freesia holds new perils and dangerous foes. Back in her country, she is forced to choose between the heart she never knew she had and the land that she was born to rule. But with Casper’s help, Ahna may find a way to have it all….","cover":"https://allnovel.net/images/wicked-as-she-wants-blud-2.jpg","author":"Delilah S. Dawson","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wicked-as-she-wants-blud-2.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:42:31 PM"}}
