{"id":70932,"no":21,"title":"Page 21","content":"Noel greeted them. He wore a gray T-shirt that said WILL FLEX FOR FOOD, ripped-up faded blue jeans, and no shoes or socks. “What up.” He handed them both a beer. “Thanks, man.” Ben took his cup and started drinking. The amber beer messily dribbled down his chin. “Nice party.” Someone tapped Emily on the shoulder. Emily turned. It was Aria Montgomery, wearing a tight, faded red University of Iceland T-shirt, a frayed denim mini, and red John Fluevog cowboy boots. Her black hair was pulled back into a high ponytail. “Wow, hi,” Emily said. She’d heard Aria was back but she hadn’t seen her yet. “How was Europe?” “Awesome.” Aria smiled. The girls looked at each other for a few seconds. Emily paused, wanting to tell Aria she was glad she’d ditched her fake nose ring and pink hair stripes but wondered if it would be weird to make a reference to their old friendship. She took a sip of her beer and pretended to be fascinated with the ridges on the cup. Aria fidgeted. “Listen, I’m glad you’re here. I’ve been wanting to talk to you.” “You have?” Emily met her eyes and then looked back down. “Well…either you or Spencer.” “Really?” Emily felt her chest tighten. Spencer? “So, promise me you won’t think I’m crazy. I’ve been away for such a long time, and…” Aria made a puckered face that Emily remembered well. It meant she was considering her words carefully. “And what?” Emily raised her eyebrows, waiting. Maybe Aria wanted all her old friends to have a reunion—of course, being away, she wouldn’t know how far apart they’d grown. How uncomfortable would that be? “Well…” Aria looked around warily. “Was there any more news about Ali’s disappearance while I was away?” Emily jerked back, hearing Ali’s name come out of her old friend’s mouth. “Her disappearance? What do you mean?” “Like, did they ever find out who took her? Did she ever come back?” “Um…no…” Emily chewed on her thumbnail uncomfortably. Aria leaned into Emily. “Do you think she’s dead?” Emily’s eyes widened. “I…I don’t know. Why?” Aria set her jaw. She looked deep in thought. “What’s this about?” Emily asked, her heart pounding. “Nothing.” Then Aria’s eyes focused on someone behind her. She clamped her mouth shut. “Hey,” said a gravelly voice behind Emily. Emily turned. Maya. “Hey,” she answered, nearly dropping her cup. “I…I didn’t know you were coming.” “I didn’t either,” Maya said. “But my brother wanted to. He’s here somewhere.” Emily turned to introduce Aria, but she was gone. “So is this Maya?” Ben reappeared next to them. “The girl that’s turned Emily to the dark side?” “Dark side?” Emily squeaked. “What dark side?” “Quitting swimming,” Ben answered. He turned to Maya. “You know she’s quitting, right?” “You are?” Maya turned to Emily and grinned excitedly. Emily shot Ben a look. “Maya didn’t have anything to do with that. And we don’t have to talk about it now.” Ben took another big sip of beer. “Why not? Isn’t it your big news?” “I don’t know….” “Whatever.” He clapped his heavy hand on her shoulder a little roughly. “I’m going to get another beer. You want another?” Emily nodded, even though she only ever drank one beer at parties, max. Ben didn’t ask Maya if she wanted a drink. As he walked away, she noticed his saggy jeans. Yuck. Maya took Emily’s hand and squeezed. “How’s it feel?” Emily stared at their entwined hands, blushed, but kept holding on. “Good.” Or scary. Or, at some moments, like a bad movie. “Confusing, but good.” “I have just the thing to celebrate with,” Maya whispered. She reached into her Manhattan Portage knapsack and showed Emily the top of a Jack Daniel’s bottle. “Stole it from the liquor table. Wanna help kill it with me?” Emily gazed at Maya. Her hair was pulled off her face, and she wore a simple black sleeveless shirt and an army green cargo skirt. She looked effervescent and fun—way more fun than Ben in his saggy-butt jeans. “Why not?” she answered, and followed Maya toward the woods. 21 HOT GIRLS—THEY’RE JUST LIKE US! Hanna took a sip of her vodka lemonade and lit another cigarette. She hadn’t seen Sean since they parked his car on the Kahns’ lawn two hours ago, and even Mona had vanished. Now she was stuck talking to Noel’s best friend, James Freed, Zelda Millings—a beautiful blond girl who only wore clothes and shoes made out of hemp—and a bunch of squeally, cliquey girls from Doringbell Friends, the ultra-hip Quaker school in the next town over. The girls had come to Noel’s party last year and even though Hanna had hung out with them then, she couldn’t remember any of their names. James stubbed out his Marlboro on the heel of his Adidas shell-tops and took a swig of beer. “I heard Noel’s brother has a ton of pot.” “Eric?” asked Zelda. “Where’s he at?” “Photo booth,” James answered. Suddenly, Sean darted through the pines. Hanna stood up, adjusted her hopefully slimming BCBG slip dress, and tied the straps of her brand-new pale blue Christian Louboutin sandals back around her ankles. As she ran to catch up with him, her heel sunk into the dewy grass. She flailed her arms, dropped her drink, and suddenly she was on her butt. “And she’s down!” James called out drunkenly. The Doringbell girls all laughed. Hanna quickly scrambled up, pinching her palm to keep herself from crying. This was the biggest party of the year, but she felt way off her game: Her dress felt snug around her hips, she hadn’t been able to get Sean to crack a smile during the car ride over here—despite the fact that he’d scored his dad’s BMW 760i for the night—and she was on her third calorie-laden vodka lemonade and it was only nine-thirty. Sean held out his hand to help her up. “Are you okay?” Hanna hesitated. Sean was dressed in a plain white T-shirt that accentuated his strong-from-soccer chest and flat-from-good-genes stomach, dark blue Paper Denim jeans that made his butt look awesome, and ragged black Pumas. His blondish brown hair was messily styled, his brown eyes looked extra soulful, and his pink lips extra kissable. For the past hour, she’d watched Sean bond with every guy there and carefully avoid her. “I’m fine,” she said, sticking her lip out in a Hanna-patented pout. “What’s the matter?” She tried to balance in her shoes. “Can we…go somewhere private for a while? Maybe the woods? To talk?” Sean shrugged. “Okay.” Yes. Hanna led Sean down a path to the Manhood Woods, the trees casting long, dark shadows across their bodies. The only other time Hanna had ever been here was in seventh grade, when her friends had a secret rendezvous with Noel Kahn and James Freed. Ali made out with Noel, Spencer made out with James, and she, Emily, and Aria sat on logs, shared cigarettes, and miserably waited for them to finish. Tonight, she vowed, would be different. She sat down on a thick patch of grass and pulled Sean down with her. “You having fun?” She passed her drink to Sean. “Yeah, it’s cool.” Sean took a small sip. “You?” Hanna hesitated. Sean’s skin shone in the moonlight. His shirt had a tiny smear of dirt on it near the collar. “I guess.” All right, chatting time was over. Hanna took the drink out of Sean’s hand and grabbed his sweet, square jaw and started to kiss him. There. It sort of sucked that the world was kind of spinning, and that instead of tasting the inside of Sean’s mouth, she tasted Mike’s Hard Lemonade, but whatever. After a minute of kissing, she felt Sean pulling away. Maybe this called for upping the ante a little. She hiked up her navy dress, exposing her legs and tiny lavender Cosabella lace thong. The woodsy air was cold. A mosquito landed on her upper thigh. “Hanna,” Sean said gently, reaching to pull her dress back down. “This isn’t…” He wasn’t fast enough, though; Hanna had already torn the dress over her head. Sean’s eyes canvassed her whole body. Amazingly, this was only the second time he’d seen her in her underwear—unless you counted the week they spent at his parents’ place in Avalon on the Jersey Shore, when she was in her bikini. But that was different. “You don’t really want to stop, do you?” She reached toward him, hoping she looked smoldering yet wholesome. “Yeah.” Sean caught her hand. “I do.” Hanna wrapped herself up in her dress as best she could. She probably had a hundred mosquito bites already. Her lip trembled. “But…I don’t get it. Don’t you love me?” The words felt very small and frail coming out of her mouth. Sean took a long time to respond. Hanna heard another couple from the party giggling nearby. “I don’t know,” he answered. “Jesus,” Hanna said, rolling away from him. The vodka lemonades sloshed in her stomach. “Are you gay?” It came out a little meaner than she meant it to. “No!” Sean sounded hurt. “Well then what? Am I not hot enough?” “Of course not!” Sean said, sounding shocked. He thought for a moment. “You’re one of the prettiest girls I know, Hanna. Why don’t you know that?” “What are you talking about?” Hanna asked, disgusted. “I just…,” Sean started. “I just think that maybe if you could have a little more respect for yourself—” “I have plenty of self-respect!” Hanna shouted at him. She shifted onto her butt, rolling onto a pine cone. Sean stood up. He looked deflated and sad. “Look at you.” His eyes traveled from her shoes to the top of her head. “I’m just trying to help you, Hanna—I care about you.” Hanna felt tears gathering at the corners of her eyes and tried to choke them back down. She would not cry right now. “I respect myself,” she repeated. “I just wanted to…to…show you how I feel.” “I’m just trying to be choosy about sex.” He sounded not kind, but not mean, either. Just…detached. “I want it to be at the right time with the right person. And it doesn’t look like that’s going to be you.” Sean sighed and took a step away from her. “I’m sorry.” Then he pushed through the trees and was gone. Hanna was so embarrassed and angry, she couldn’t speak. She tried to stand up to follow Sean, but her heel caught again and she fell over. She splayed her arms out and stared up at the stars, holding her thumbs over her eyes, so tears wouldn’t pour out of them. “She looks like she might puke.”","sourceLink":"https://allnovel.net/pretty-little-liars-pretty-little-liars-1/page-21.html","bookId":2378,"book":{"id":2378,"title":"Pretty Little Liars (Pretty Little Liars #1)","description":"Storyline: Pretty Little Liars (Pretty Little Liars #1) Three years ago, Alison disappeared after a slumber party, not to be seen since. Her friends at the elite Pennsylvania school mourned her, but they also breathed secret sighs of relief. Each of them guarded a secret that only Alison had known. Now they have other dirty little secrets, secrets that could sink them in their gossip-hungry world. When each of them begins receiving anonymous emails and text messages, panic sets in. Are they being betrayed by some one in their circle? Worse yet: Is Alison back? A strong launch for a suspenseful series.","cover":"https://allnovel.net/images/pretty-little-liars-pretty-little-liars-1.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/pretty-little-liars-pretty-little-liars-1.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:18:06 AM"}}
