{"id":70915,"no":4,"title":"Page 4","content":"“You swim?” Maya asked. She looked Emily up and down, which made Emily feel a little weird. “I bet you’re really good. You totally have the shoulders.”\\n\\n “Oh, I don’t know.” Emily blushed and leaned against Maya’s white wooden desk.\\n\\n “You do!” Maya smiled. “But…if you’re a big jock, does that mean you’d kill me if I smoked a little weed?”\\n\\n “What, right now?” Emily’s eyes widened. “What about your parents?”\\n\\n “They’re at the grocery store. And my brother—he’s here somewhere, but he won’t care.” Maya reached under her mattress for an Altoids tin. She hefted up the window, which was right next to her bed, pulled out a joint, and lit it. The smoke curled into the yard and made a hazy cloud around a large oak tree.\\n\\n Maya brought the joint back inside. “Want a hit?”\\n\\n Emily had never tried pot in her entire life—she always thought her parents would somehow know, like by smelling her hair or forcing her to pee in a cup or something. But as Maya pulled the joint gracefully from her cherry-frosted lips, it looked sexy. Emily wanted to look sexy like that too.\\n\\n “Um, okay.” Emily slid closer to Maya and took the joint from her. Their hands brushed and their eyes met. Maya’s were green and a little yellow, like a cat’s. Emily’s hand trembled. She felt nervous, but she put the joint to her mouth and took a tiny drag, like she was sipping Vanilla Coke through a straw.\\n\\n But it didn’t taste like Vanilla Coke. It felt like she’d just inhaled a whole jar of rotten spices. She hacked an old man–ish cough.\\n\\n “Whoa,” Maya said, taking back the joint. “First time?”\\n\\n Emily couldn’t breathe and just shook her head, gasping. She wheezed some more, trying to get air into her chest. Finally she could feel air hitting her lungs again. As Maya turned her arm, Emily saw a long, white scar running lengthwise down her wrist. Whoa. It looked a little like an albino snake on her tan skin. God, she was probably high already.\\n\\n Suddenly there was a loud clank. Emily jumped. Then she heard the clank again. “What is that?” she wheezed.\\n\\n Maya took another drag and shook her head. “The workers. We’re here for one day and my parents have already started on the renovations.” She grinned. “You just totally freaked, like you thought the cops were coming. You been busted before?”\\n\\n “No!” Emily burst out laughing; it was such a ridiculous thought.\\n\\n Maya smiled and exhaled.\\n\\n “I should go,” Emily rasped.\\n\\n Maya’s face fell. “Why?”\\n\\n Emily shuffled off the bed. “I told my mom I’d only stop over for a minute. But I’ll see you in school Tuesday.”\\n\\n “Cool,” Maya said. “Maybe you could show me around?”\\n\\n Emily smiled. “Sure.”\\n\\n Maya grinned and waved good-bye with three fingers. “You know how to find your way out?”\\n\\n “I think so.” Emily took one more look around Ali’s—er, Maya’s—room, and then stomped down the all-too-familiar stairs.\\n\\n It wasn’t until Emily shook her head out in the open air, passed all of Alison’s old stuff on the curb, and climbed back into her parents’ car, that she saw the Welcome Wagon basket on the backseat. Screw it, she thought, wedging the basket between Alison’s old chair and her boxes of books. Who needs a guide to Rosewood’s inns, anyway? Maya already lives here.\\n\\n And Emily was suddenly glad she did.\\n\\n 2\\n\\n ICELANDIC (AND FINNISH) GIRLS ARE EASY\\n\\n “Omigod, trees. I’m so happy to see big fat trees.”\\n\\n Aria Montgomery’s fifteen-year-old brother, Michelangelo, wagged his head out of the family’s Outback window like a golden retriever. Aria; her parents, Ella and Byron—they wanted their kids to call them by their first names—and Mike were all driving back from Philadelphia International Airport. They’d just gotten off a flight from Reykjavík, Iceland. Aria’s dad was an art history professor, and the family had spent the last two years in Iceland while he helped do research for a TV documentary on Scandinavian art. Now that they were back, Mike was marveling at the Pennsylvania cow-country scenery. And that meant…Every. Single. Thing. The 1700s-era stone inn that sold ornate ceramic vases; the black cows staring dumbly at their car from behind a wooden roadside fence; the New England village–style mall that had sprung up since they’d been gone. Even the dingy twenty-five-year-old Dunkin’ Donuts.\\n\\n “Man, I can’t wait to get a Coolata!” Mike gushed.\\n\\n Aria groaned. Mike had spent a lonely couple of years in Iceland—he claimed that all Icelandic boys were “pussies who rode small, gay horses”—but Aria had blossomed. A new start had been just what she needed at the time, so she was happy when her dad made the announcement that her family was moving. It was the fall after Alison went missing, and her girls had grown far apart, leaving her with no real friends, just a school full of people she’d known forever.\\n\\n Before she left for Europe, Aria would sometimes see boys look at her from afar, intrigued, but then look away. With her coltish, ballet-dancer frame, straight black hair, and pouty lips, Aria knew she was pretty. People were always saying so, but why didn’t she have a date to the seventh-grade spring social, then? One of the last times she and Spencer had hung out—one of the awkward get-togethers that summer after Ali disappeared—Spencer told Aria she’d probably get a lot of dates if she just tried to fit in a little bit more.\\n\\n But Aria didn’t know how to fit in. Her parents had drilled it into her head that she was an individual, not a follower of the herd, and should be herself. Trouble was Aria wasn’t sure who Aria was. Since turning eleven, she’d tried out punk Aria, artsy Aria, documentary film Aria, and, right before they moved, she’d even tried ideal Rosewood girl Aria, the horse-riding, polo-shirt-wearing, Coach-satchel-toting girl who was everything Rosewood boys loved but everything Aria wasn’t. Thankfully, they moved to Iceland two weeks into that disaster, and in Iceland, everything, everything, everything changed.\\n\\n Her father got the job offer in Iceland just after Aria had started eighth grade, and the family packed up. She suspected they’d left so quickly because of a secret about her dad that only she—and Alison DiLaurentis—knew about. She’d vowed not to think about that again the minute the Icelandair plane took off, and after living in Reykjavík for a few months, Rosewood became a distant memory. Her parents seemed to fall back in love and even her totally provincial brother learned both Icelandic and French. And Aria fell in love…a few times, actually.\\n\\n So what if Rosewood boys didn’t get kooky Aria? Icelandic boys—rich, worldly, fascinating Icelandic boys—sure did. As soon as they moved there, she met a boy named Hallbjorn. He was seventeen, a DJ, and had three ponies and the most beautiful bone structure she’d ever seen. He offered to take her to Iceland’s geysers, and then, when they saw one burble up and leave a big cloud of steam, he kissed her. After Hallbjorn was Lars, who liked to play with her old pig puppet, Pigtunia—the one who advised Aria on her love life—and took her to the best all-night dance parties by the harbor. She felt adorable and sexy in Iceland. There, she became Icelandic Aria, the best Aria yet. She found her style—a sort of bohemian-hipster-girl thing, with lots of layers, lace-up boots, and APC jeans, which she bought on a trip to Paris—read French philosophers, and traveled on the Eurail with just an outdated map and a change of underwear.\\n\\n But now, every Rosewood sight outside the car window reminded her of the past she wanted to forget. There was Ferra’s Cheesesteaks, where she spent hours with her friends in middle school. There was the stone-gated country club—her parents didn’t belong, but she’d gone with Spencer, and once, feeling bold, Aria had walked up to her crush, Noel Kahn, and asked him if he wanted to share an ice-cream sandwich with her. He turned her down cold, of course.\\n\\n And there was the sunny, tree-lined road where Alison DiLaurentis used to live. As the car paused at the four-way stop sign, Aria stared; she could see it, second house from the corner. There was a bunch of trash on the curb, but otherwise, the house was quiet and still. She could look for only so long before covering her eyes. In Iceland, days could go by when she could almost forget about Ali, their secrets, and what had happened. She’d been back in Rosewood for less than ten minutes, and Aria could practically hear Ali’s voice at every bend in the road and see her reflection in every house’s oversize bay window. She slumped down in her seat, trying not to cry.\\n\\n Her father continued a few streets down and pulled up to their old house, a postmodern angry brown box with only one square window, right in the center—a huge letdown after their waterfront faded-blue Icelandic row house. Aria followed her parents inside and they bustled off into separate rooms. She heard Mike answer his cell phone outside and she swished her hands through the sparkly floating dust in the air.\\n\\n “Mom!” Mike ran through the front door. “I just talked to Chad, and he said the first lacrosse tryouts are today.”\\n\\n “Lacrosse?” Ella emerged from the dining room. “Right now?”\\n\\n “Yeah,” Mike said. “I’m going!” He tore up the wrought-iron staircase to his old bedroom.\\n\\n “Aria, honey?” Her mother’s voice made her turn. “Can you drive him to practice?”\\n\\n Aria let out a small laugh. “Um, Mom? I don’t have my license.”\\n\\n “So? You drove all the time in Reykjavík. The lacrosse field’s only a couple of miles away, isn’t it? Worst thing, you’ll hit a cow. Just wait for him until he’s done.”\\n\\n Aria paused. Her mother already sounded frazzled. She heard her dad in the kitchen opening and closing cabinets and muttering under his breath. Would her parents love each other here like they had in Iceland? Or would things go back to the way they used to be?\\n\\n “All right,” she mumbled. She plopped her bags on the landing, grabbed the car keys, and slid into the wagon’s front seat.\\n\\n Her brother climbed in next to her, amazingly already dressed in his gear. He punched the netting on his stick enthusiastically and gave her an evil, knowing smile. “Happy to be back?”\\n\\n Aria only sighed in response. The entire drive, Mike had his hands pressed up against the car’s window, shouting things like, “There’s Caleb’s house! They tore down the skate ramp!” and “Cow poop still smells the same!” At the vast, well-mown practice field, she’d barely stopped the car when Mike opened the door and immediately bolted.\\n\\n She slid back into the seat, stared up through the sunroof, and sighed. “Thrilled to be back,” she murmured. A hot air balloon floated serenely through the clouds. It used to be such a delight to see them, but today she focused in on it, closed one eye, and pretended to crush the balloon between her thumb and pointer finger.\\n\\n A bunch of boys in white Nike T-shirts, baggy shorts, and backward white baseball caps walked slowly past her car toward the field house. See? Every Rosewood boy was a carbon copy. Aria blinked. One of them was even wearing the same Nike University of Pennsylvania T-shirt that Noel Kahn, the ice-cream sandwich boy she loved in eighth grade, used to wear. She squinted at the boy’s black wavy hair. Wait. Was that…him? Oh God. It was. Aria couldn’t believe he was wearing the same T-shirt he wore when he was thirteen. He probably did it for luck or some other queer jock superstition. \\n\\n","sourceLink":"https://allnovel.net/pretty-little-liars-pretty-little-liars-1/page-4.html","bookId":2378,"book":{"id":2378,"title":"Pretty Little Liars (Pretty Little Liars #1)","description":"Storyline: Pretty Little Liars (Pretty Little Liars #1) \\n Three years ago, Alison disappeared after a slumber party, not to be seen since. Her friends at the elite Pennsylvania school mourned her, but they also breathed secret sighs of relief. Each of them guarded a secret that only Alison had known. Now they have other dirty little secrets, secrets that could sink them in their gossip-hungry world. When each of them begins receiving anonymous emails and text messages, panic sets in. Are they being betrayed by some one in their circle? Worse yet: Is Alison back? A strong launch for a suspenseful series.\\n","cover":"https://allnovel.net/images/pretty-little-liars-pretty-little-liars-1.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/pretty-little-liars-pretty-little-liars-1.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:18:06 AM"}}
