{"id":909,"no":4,"title":"The First Picture","content":"　　It is impossible that one should not see pictures; because if my father was a blacksmith and yours was a peer of the realm, we must needs be pictures to each other. We cannot possibly break out of the frame of the picture by speaking natural words. You see me leaning against the door of the smithy with a horseshoe in my hand and you think as you go by: “How picturesque!” I, seeing you sitting so much at your ease in the car, almost as if you were going to bow to the populace, think what a picture of old luxurious aristocratical England! We are both quite wrong in our judgments no doubt, but that is inevitable. \n \n So now at the turn of the road I saw one of these pictures. It might have been called “The Sailor’s Homecoming” or some such title. A fine young sailor carrying a bundle; a girl with her hand on his arm; neighbours gathering round; a cottage garden ablaze with flowers; as one passed one read at the bottom of that picture that the sailor was back from China, and there was a fine spread waiting for him in the parlour; and he had a present for his young wife in his bundle; and she was soon going to bear him their first child. Everything was right and good and as it should be, one felt about that picture. \n \n There was something wholesome and satisfactory in the sight of such happiness; life seemed sweeter and more enviable than before. \n \n So thinking I passed them, filling in the picture as fully, as completely as I could, noticing the colour of her dress, of his eyes, seeing the sandy cat slinking round the cottage door. \n \n For some time the picture floated in my eyes, making most things appear much brighter, warmer, and simpler than usual; and making some things appear foolish; and some things wrong and some things right, and more full of meaning than before. At odd moments during that day and the next the picture returned to one’s mind, and one thought with envy, but with kindness, of the happy sailor and his wife; one wondered what they were doing, what they were saying now. The imagination supplied other pictures springing from that first one, a picture of the sailor cutting firewood, drawing water; and they talked about China; and the girl set his present on the chimney-piece where everyone who came could see it; and she sewed at her baby clothes, and all the doors and windows were open into the garden so that the birds were flittering and the bees humming, and Rogers — that was his name — could not say how much to his liking all this was after the China seas. As he smoked his pipe, with his foot in the garden. \n \n \n","sourceLink":"http://novel.tingroom.com/zongjiao/1083/32398.html","bookId":33,"book":{"id":33,"title":"飞蛾之死 The Death of the Moth, and other essays","description":"简介： 弗吉尼亚伍尔夫(virginia woolf, 1882-1941)是英国现代派小说的代表作家， 也是英国现代文学史上最重要的女作家之一。伍尔夫生活在一个动荡、变革的时代， 传统的宗教伦理、哲学、美学信念受到怀疑，现存的政治、社会制度失去稳定的根基，艺术家们尤其是作家们努力去寻...","cover":"https://cunovel.com/defaultCover.png","type":"Religious","link":"http://novel.tingroom.com/zongjiao/1083","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
