{"id":29053,"no":21,"title":"CHAPTER XXI.","content":"It is barely midnight and the mirth and merriment are at their hight down-stairs. Bonnibel hears the sound of \"The violin, flute and bassoon, And the dancers dancing in tune.\" through all her interview with Colonel Carlyle, but when it is ended she does not return to the ball-room. She leaves him with a cold good-night, and retires to her own room. Lucy, her maid, starts up drowsily from her easy-chair as she enters. \"You here, Lucy?\" she says. \"I told you not to stay up for me. You should not break your rest staying up night after night like this.\" \"Lor\u0027, Miss Bonnibel, I have had as comfortable a snooze in your arm-chair as if I had been tucked into my bed,\" Lucy answers good-naturedly. \"Don\u0027t you go for to worry over me staying up. I kin stand it if you kin.\" Her mistress stands in the center of the room, her eyes shining, her white hands tearing at the diamond necklace about her throat. \"Take it off, Lucy,\" she cries out impatiently. \"It hurts me, it chokes me!\" Lucy hastens to obey, but starts back as she sees the wild, white face of the hapless girl. \"Oh, me!\" she exclaims, \"you look like a ghost, you are that white. Are you sick, Miss Bonnibel? Let me get you something to take—some wine, or something?\" \"No, no, I wish nothing,\" she answers, impatiently. \"Only undress me, Lucy, and help me to bed. I am very tired—that is all.\" She sits quite still while Lucy removes the jewels that shine about her, the white satin slippers, the elegant dress, and brings the snowy night-dress instead. Then as the maid kneels down and buttons the delicate robe, Bonnibel, glancing down, sees her eyes full of tears and her full lip quivering. \"Lucy,\" she says, in surprise, \"what is it? What has grieved you?\" Lucy starts as if frightened at being detected. \"Forgive me, ma\u0027am,\" she says; \"it\u0027s for you I grieve. You are that changed that I can\u0027t bear it! Here I have been your maid since you was a little girl of twelve, and how happy you used to be before the master died—now for goin\u0027 on a year I\u0027ve never seen a real smile on your face. Something troubles you all the time. Can\u0027t I help you? Can\u0027t I do something for you?\" The humble, patient fidelity of the girl touches Bonnibel to the heart, it is so seldom that an honest, heartfelt word of kindness falls on her ears. Impulsively she bends and puts her lily white[Pg 76] hand into the strong clasp of the girl sitting humbly at her feet, looking up at her with tear-filled eyes. \"Lucy, my poor girl,\" she says, plaintively, \"I believe you are the only true friend I have on earth!\" \"Then can\u0027t I help you, Miss Bonnibel?\" cried Lucy, feeling that the words of her young mistress are too true for her to dispute them. \"Something troubles you—can\u0027t I help you to be happier?\" A sigh—hopeless, passionate, profound—drifts across the lips of the listener. \"No no, my poor, kind girl,\" she answers; \"no one can help me—I must bear my own cross—no one can carry it for me! Only stay with me, Lucy, and love me always—I have so few to love me—and I shall feel better when I can see that your kind heart sympathizes with me.\" \"I\u0027ll never leave you, my dear mistress,\" sobs the girl; \"I\u0027ll never forget to love every hair of your innocent head.\" She kisses the little hand Bonnibel has given her reverently and tenderly, as if it were some precious thing. \"Lucy, I am going to test your fidelity,\" says the girl, drearily. \"I am going away to Europe next week. Will you go with me?\" Lucy stares open-mouthed. \"To Yurrup, Miss Bonnibel! Away off to them furrin parts?\" \"Yes, Lucy, away off there. Does your courage fail you?\" her mistress inquires, with a slight, sad smile. \"No, no, ma\u0027am. I don\u0027t like furrin people much; but I\u0027ll go to the ends of the earth with you!\" is the resolute reply. \"Your devotion shall not be taxed that far, Lucy. We will go to France.\" \"That heathen land,\" exclaims Lucy, \"where the monseers eats frogs and snakes?\" Bonnibel cannot repress a smile at the girl\u0027s quick gesture of disgust. \"You will like the French people better, I hope, when you stay among them two years, for I shall probably stay in Paris that long. I am going to school there, Lucy. You know that I have never been to school in my life, and my governesses were not strict enough with me. There are many things I do not know yet, that one moving in society I frequent should know. So I am going to learn something yet. It is never too late to mend, you know.\" Lucy looks up, her eyes growing round with surprise. \"Lor\u0027, Miss Bonnibel, I never heard of a married woman going to school in my life.\" \"Perhaps you never heard of a married woman so untutored as I am,\" her young mistress returns, somewhat bitterly; \"anyway, I am determined to go to school and learn something. But I cannot do without a maid, and I will take you, if you will go.\" \"That I certainly will, Miss Bonnibel,\" said Lucy, emphatically. \"Very well, Colonel Carlyle and I will start to New York to-morrow[Pg 77] to make preparations for our trip. See that the trunks are all packed, Lucy.\" \"I will, ma\u0027am. They shall be ready, never fear.\" She rises and looks wistfully at the little white figure in the chair, resting its dimpled chin in the curve of one pink palm, the golden head bent wearily. \"Sha\u0027n\u0027t I get you something? Indeed, you look ill,\" she implores. \"Nothing, Lucy. Good-night.\" \"Good-night, ma\u0027am,\" Lucy responds, going away rather reluctantly. Bonnibel makes no move to retire when Lucy has gone. The little white bed awaits her, tempting to repose by its daintiness and coolness, but she does not look toward it; only sits still as Lucy left her, with her face bowed on her hand. Colonel Carlyle has gone back to the ball-room again, trying to steel his heart against the upbraidings of his conscience. He moves among the revelers pale and distrait, yet still trying to bear his part in the gaieties lest people should whisper that he is unhappy, and fearful that some one may read the secret of his jealousy and cruelty to his beautiful darling. Curious glances follow him, whispers breathe the story that he fain would conceal, every eye notes Bonnibel\u0027s absence. They shrug their shoulders and tell each other in confidence that Colonel Carlyle is a perfect Bluebeard, and has banished his wife from the festal scene because he is jealous of Byron Penn. And the music and the dancing go on until daylight warns the gay ones to flee from that too true light that reveals their weariness and haggardness so plainly. But the ball is long since over for Bonnibel. Lucy finds her as she left her, curled up in the great arm-chair, sleeping like a grieved child, with the trace of tears on her cheek.","sourceLink":"http://novel.tingroom.com/jingdian/1786/51995.html","bookId":1082,"book":{"id":1082,"title":"An Old Man\u0027s Darling","description":"简介： The sea, the sea, the open sea; The blue, the fresh, the ever free,chanted the fresh and delicious voice of a young girl walking along the sands of the seashore in the summer sunshine at Cape May....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1786","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
