{"id":39603,"no":10,"title":"CHAPTER X. AT THE TIN-TAX OFFICE, No. 120.","content":"The Tin-Tax Office, as I have before had occasion to remark, is situated in a wing of Rutland House; that noble building so well known to most Englishmen, whence are issued those concise documents relating to unpaid arrears of public imposts, and where the mulcting of the nation is carried on. The Tin-Tax is by no means a bad office, as times go; though it is rather looked down upon by the men in the Check and Counter-Check Department, and the Navigation Board, who have offices in the same building. It used to be a great point of humour with the wits of twenty years since to say that the appointments in the Tin-Tax Office were given to sons of the faithful butlers of patriotic peers, and to those eager constituents for whose placing-out in life the Members for Irish boroughs are always petitioning with energy and perseverance worthy of the horse-leech\u0027s daughters. And, indeed, the manners and customs of some of the middle-aged clerks bear testimony to the truth of this report. They were good enough fellows in their day--blundered on at their offices from ten till four; dined cheaply at Short\u0027s, or Berthollini\u0027s, or the Cock; went half-price to the Adelphi; occasionally supped at the Coal-Hole or the Cider Cellars; and went home to their garrets in Islington with the perfect idea that they were roystering dogs, and that the world did not contain many men who had drained pleasure\u0027s goblet more thoroughly to the dregs than themselves. Most of them married betimes--occasionally the landlady of their lodgings; more frequently the pallid daughter of some fellow-clerk, after a flirtation begun over a round game or \"a little music;\" most frequently some buxom lass met at seaside boarding-house, or in the old paternal home, where they spent their leave of absence. But we have changed all that; and junior clerks of the present day are thoroughly and entirely different from their predecessors: the establishment of the Civil-Service Commission, and the ordination of promotion by merit, have sent quite a different class of men into the public service, and the subordinate appointments of the Tin-Tax Office are held by men who have taken their degrees at Oxford; who can turn \"Vilikins and his Dinah\" into Greek iambics; who can tell you where Montenegro is, and what it wants; who have thoroughly mastered the Schleswig-Holstein question; who are well up in the theory of thermo-dynamics; and who dip into Jean Paul Richter for a little light reading;--all excellent accomplishments, and thoroughly useful in the Tin-Tax Office. It is half-past twelve on a fine Saturday morning in the beginning of October, and the six occupants of room No. 120 are all assembled, and all at work; that is to say, four of them are writing, one is looking vacantly out of the window, and one is reading the Times. No. 120 is at the top of the building; a pleasant room when you reach it, looking on to the river, but up four flights of steep stone stairs. No. 120 has always its regular number of occupants; for when the chief clerk learns that a young gentleman has an undue number of friends calling upon him during official hours, he causes the popular man to be removed to No. 120, and after two trials of the stairs the visitors prefer meeting their friend in the evening at some less Alpine retreat. So also, when a young gentleman is in the habit of being perpetually waited upon by duns, he makes interest to get moved into No. 120, and finds that his creditors simultaneously urge their demands not in person, but through the medium of the Post-Office. The head of the room is Mr. Kinchenton, that tall man with the rounded shoulders, and grizzled head ever bent over his desk. Hard work has bowed Mr. Kinchenton\u0027s back and silvered his hair; for he has been in the Tin-Tax Office since he was sixteen years old, and though promoted under the old system of seniority and length of service, no one could ever say that he had not fairly won every step he got. Before he was sixteen, he was the hope and pride--the prize scholar--of the Heckmondike Grammar-School, his father being head-keeper to Lord Heckmondike, who placed the boy on the foundation of the school, and, finding him apt and studious, obtained for him his appointment from the Government of the day. No Adelphi at half-price, no Cider Cellars or Coal-Hole, for young Kinchenton, who had a little bedroom in a little terrace close by Kennington Common, where he was to be found every night, book in hand, and happy as a prince. A poor little bedroom enough!--a wretched little bedroom, with a white-dimity-covered tester-bed, two rush-bottomed chairs, a painted chest of drawers, a rickety washhand-stand, and a maddening square of looking-glass hanging against the wall. But to that garret came Sancho Panza and the gaunt Don his master; came Gil Blas, and the beggar with his arquebuse, and the Archbishop of Grenada; came cringing Tartuffe, and preposterous Sganarelle; came wandering Rasselas and sage Imlac; came Ferdinand Count Fathom, swearing Tom Pipes, and decorous Mr. Blifil. There the hard-working clerk laughed over Falstaff\u0027s lovemaking and Malvolio\u0027s disgrace, or wept over Sterne\u0027s dead ass and Le Fevre\u0027s regained sword; while his comrades Mace and Flukes were ruining each other at billiards, and Potter and Piper were hiccuping noisy applause to indecent songs. When Mr. Kinchenton was forty years old, his income had reached the bewildering amount of four hundred a year, and he thought he might indulge in the luxury of a wife; so he took to himself a pretty little soft-eyed girl, the daughter of an old gentleman who was a traveller, in the straw-bonnet line, and who, when he was not driving about in a very high four-wheeled trap which did its best to look like a mail-phaeton and signally failed in the attempt, lived in the little terrace next door to Kinchenton\u0027s lodgings. After his daughter\u0027s marriage, the old gentleman, who was a widower, gave up travelling, retired upon his savings, and went to live with his son-in-law in a little house which Kinchenton had taken in Camden Town, where the birth of a son crowned Kinchenton\u0027s happiness. His adoration of this child was his weakest point: he was always narrating its wonderful deeds to every body; and the men in the office, with whom the little fellow was really a favourite, knew they could always get late attendance overlooked or half-holiday granted if they asked after little Percy, and sent him some trifling present. It is well for the junior clerks of No. 120 that Mr. Kinchenton is the head of the room; for the next in seniority, Mr. Dibb, is by no means a pleasant person. Harsh, stiff, sectarian bigotry lurks in his coarse, close-cropped black hair, and in the plaited folds of his huge white neckcloth; he invariably wears a black dress coat, waistcoat, and trousers, creaking boots, and damp cloth gloves. He is always ailing, and invariably changing his medical system: now vaunting the virtues of blue-pill, now swearing by homoeopathy; he has been rubbed and cracked and shampooed and galvanised; and once he tried hydropathy, but came back in a week from Malvern no better, and apparently no cleaner, than before his visit to Dr. Gully. He was one of the first-fruits of the noble system of promotion by merit, having been transferred to Rutland House from some provincial stronghold of the Tin-Tax Office, and report said that he had originally been a schoolmaster in Bilston. He was hated by nearly all his juniors, but respected by the heads for his conscientiousness and power of work; and he was located in No. 120 to neutralise, to some extent, Mr. Kinchenton\u0027s excess of good nature. The rank and file of No. 120 consisted of Mr. Prescott and Mr. Pringle, junior clerks; Mr. Boppy, an old gentleman with a bald head and a double eyeglass, who had arrived, through dint of long service, at a good income, who was utterly useless, and who had no characteristic save his intense dread of his wife; and Mr. Crump, who had been for twenty years an extra clerk, and who, owing to an invincible stutter, had never been able to interest any one sufficiently to procure him an appointment. \"Devilish hot!\" said Mr. Pringle, a short, good-humoured-looking young man, laying down his Times and opening his waistcoat; \"devilish hot! Crump, there\u0027s a good fellow, open the door.\" Mr. Crump looked up from his work, and said appealingly, \"I\u0027ve got a st--a st--a st--\" he would have said \"stiff neck;\" but long before he could reach the word, Pringle interrupted him-- \"Strong hand; you\u0027ve got a strong hand, I know, and the door sticks; that\u0027s why I asked you. Boppy, my boy, I\u0027ve not yet had time to ask you how you are.\" \"Well, Pm well in health, thank you, Mr. Pringle,\" said Mr. Boppy, depositing his pen on the desk, and rubbing his bald forehead; \"but I\u0027m rather worried in my mind.\" \"What troubles my Boppy? Has the Bank reduced its rate of discount, so that my Boppy\u0027s ingots are not worth quite so much per cent as they were yesterday; or is it love that is sending him to grief? Has my Boppy been sporting with Amaryllis in the shady side of Brompton Row, and has Mrs. B. found it out? Oh, Bop!\" \"Nonsense, Mr. Pringle! I--\" \"I must say that such remarks as those,\" interrupted Mr. Dibb, \"appear to me to be very bad jokes.\" \"Very likely, Mr. Dibb,\" retorted Pringle; \"but that\u0027s because you\u0027re the quintessence of humour yourself. We can\u0027t all hope to make ourselves as thoroughly genial and pleasant as you--can we, Crump?\" \"I d--decline to s--to s--to say--\" \"To say ditto to Dibb! Of course: you\u0027re my friend, and I knew you\u0027d never desert me. Now, Boppy, you were about to say something when you were interrupted in that gentlemanly manner by our friend J. Miller; what was it?\" \"Oh, I was merely thinking that I\u0027d try and take that dog home this afternoon, and I\u0027m rather doubtful as to how my wife will receive it, You see, I bought him a week ago, and Simmons, the hall-porter here, has kept him for me in the coal-cellar since then. He\u0027s a white Pomeranian dog, and the coal-cellar don\u0027t suit him somehow; but I daren\u0027t take him to Putney until I\u0027d somewhat prepared Mrs. B.\u0027s mind. So last night I read her several anecdotes of dogs, where they were all faithful and friendly and clean, you know; and this afternoon I shall take Spitz home, and--and say you gave him to me, I think, Mr. Pringle, if you\u0027ve no objection.\" \"Certainly, if you like it, I don\u0027t mind; any thing you please, Boppy, my boy. Dogs as many as you like, and things of that sort; only, if Mrs. B. ever finds white-kid gloves, or locks of hair, or patchouli-scented pink notes, don\u0027t say they come from me--you understand? By the way, that reminds me. Prescott! p\u0027st! Prescott!\" A tall, good-looking man of two or three-and-twenty, who was leaning his head on one hand and staring out of the window, turned round and said dreamily, \"What?\" \"What an amusing companion you are!\" said Mr. Pringle; \"what a charming remark that was when you last spoke, an hour and twenty minutes ago! What was it?\" \"Don\u0027t be an idiot, Pringle!\" \"No, it wasn\u0027t that; to be told to avoid an impossibility would have struck me as novel. Never mind; I was going to ask who that was I saw you speaking to at the King\u0027s Cross Terminus yesterday.\" \"At King\u0027s Cross?\" said Prescott, colouring; \"oh, that was a friend of mine, a clergyman.\" \"Ah!\" said Pringle, quietly, \"I thought so. He had on a blue bonnet and a black-lace shawl. Neat foot he\u0027s got; those parsons are always so particular about their stockings!\" \"Don\u0027t be an ass, George!\" growled Prescott, in an undertone. \"All right, old boy!\" said Pringle, in the same key. \"Forgot we weren\u0027t alone. Nobody heard, I think; but I\u0027ll soon change the subject;\" and he commenced whistling Il Bacio, loud and shrill. \"Mr. Pringle! Mr. Pringle!\" screamed Mr. Dibb. Mr. Pringle held up his hand as if deprecating interruption until he had come to the end of the bar, when he said, with mock politeness, \"Sir to you!\" \"How often have I begged you, sir, not to whistle during official hours? It is impossible for me to write my minutes while you\u0027re whistling.\" \"Write your minutes!\" said Mr. Pringle. \"Sir, we have the authority of A. Tennyson, Esquire, the Poet of the Age, if my honourable friend in the Isle of Wight will so permit me to call him, for saying that \u0027Lightlier move the minutes fledged with music.\u0027 Though that even my whistling could make your minutes move lightly, with due respect to Alfred, I doubt.\" \"Mr. Kinchenton,\" cried Mr. Dibb, now a dirty white with rage, \"I must request you, as head of this room, to call upon Mr. Pringle not to forget himself.\" \"My dear sir,\" said Pringle, \"there\u0027s no one I think of so much.\" \"George,\" said Mr. Kinchenton quietly, \"pray be quiet!\" \"Certainly, Padre; I\u0027m dumb! Thank Heaven and the Early Closing Association, to-day\u0027s a half holiday, and we cut it at two.\" \"Ah, to be sure!\" said Kinchenton, anxious to atone for even the slight show of authority which his previous words might have suggested; \"there are grand doings this afternoon at the Eyres\u0027, at Hampstead. I\u0027m going to take my Percy there. Athletic sports, running, leaping, and all the rest of it.\" \"Ha! ha!\" said Pringle; \"at the Eyres\u0027, eh? \u0027The merry brown Eyres come leaping,\u0027 as Kingsley has it. What a pity they haven\u0027t asked me!\" \"You\u0027re going, Prescott, I suppose?\" asked Kinchenton. \"The Eyres are friends of yours--you\u0027re going to their fête?\" \"I! no, Padre,\" was the reply; \"I\u0027m not going.\" \"Oh, he\u0027s very bad!\" said Pringle, in a whisper, \"He\u0027s got it awfully, but he\u0027ll get better.\" \u0027Now he 0as turned himself wholly to love and follows a damsel, Caring no more for honour, or glory, or Pallas Athené.\u0027 Kingsley again--hem!\" \"I wonder, Mr. Pringle,\" said Mr. Dibb, \"that you do not attempt to form some more permanent style of reading than the mere poetry, scraps of which you are always quoting. For my own part, I consider poetry the flimsiest kind of writing extant.\" \"I\u0027m surprised at that, now,\" said Pringle placidly. \"I should have thought that you would have been a great appreciator of the gloomy and Byronic verse. To understand that properly, you must have lost all digestive power; and you know, Mr. Dibb, that your liver is horribly out of order.\" A general laugh followed this remark, in which even Mr. Kinchenton joined, and at which Mr. Dibb looked more savage than ever. In the midst of it the clock struck two, and at the last sound Mr. Crump closed his blotting-book, put on his hat, and vanished, saying \"G-good\" as he passed through the door; two minutes afterwards, fragments of the word \"d-day\" were heard reverberating in the passage. Simultaneously Mr. Boppy struck work and went to look after his dog, Mr. Dibb started off without a word, and Mr. Prescott took off his coat to wash his hands previous to departure. When he emerged from the washing cupboard, he found Pringle waiting for him: both the young men shook hands with their chief, sent their loves to Mrs. Kinchenton and the boy, and turned out into the Strand. They had not gone far when Pringle asked his companion whither he was bound. Prescott was too absorbed to hear the question, but, on its repetition, muttered something about an \"engagement out Kensington way.\" \"Ah!\" said Pringle, with the nearest approach to a sigh, \"ride a cock horse, eh? the old game! Look here, Jim, old fellow. I\u0027m not clever, you know, but I know how many blue beans make five; and I\u0027m not strait-laced or pious or any thing of that sort, but I\u0027m very fond of you, and I tell you this won\u0027t do!\" \"What won\u0027t do?\" asked Prescott, with a flaming face. \"Why, this Kate Mellon business, Jim. It\u0027s on hot and strong, I know. You\u0027ve been down in the mouth all the time she was away; you met her at the station yesterday, and probably you\u0027re going up to her place to-day. Now you know, Jim, I\u0027ve seen more of life than you, and I tell you this is all wrong.\" \"Why, you don\u0027t imagine that there\u0027s any thing--?\" \"I don\u0027t imagine any thing at all. I haven\u0027t got any imagination, I think. I\u0027m the most matter-of-fact beggar that ever walked; but I know you\u0027re confoundedly spooney and hard hit, and in a wrong quarter. Now, Jim, pull yourself together, old man, and cut it.\" \"I can\u0027t, George,\" groaned Prescott, raising his hat and tossing the hair back from his forehead; \"I can\u0027t. You don\u0027t know how I love that woman, old fellow. I\u0027d die for her; I\u0027d go out and be shot at once, if it would save her a pang. I hate any one to come near her, and I\u0027m always thinking of her, and longing to be with her.\" \"I felt just like that once for a female tobacconist in Briggate, at Leeds,\" said Mr. Pringle after a pause. \"Deuced nice girl she was too, and what thundering bad cigars she sold! I\u0027m very glad I didn\u0027t die for her, though. I got my appointment just in time, and came up to town without asking her to fly with me to distant climes. She wouldn\u0027t have known what \u0027climes\u0027 meant, I think. Now, look here, Jim; you\u0027d better do something of the same sort. Apply for sick-leave (Glauber will give you a certificate), and go home and have some shooting, and stay with your people, and you\u0027ll come back cured. Only cut it at once. Don\u0027t go there to-day; come with me. I\u0027ve got a little business to do that won\u0027t take half an hour, and then I\u0027m going to spar with Bob Travers, and you shall see me polish him off with a new \u0027Mendoza tip\u0027 that I learnt last night. Now, you\u0027ll come, won\u0027t you, Jim?\" \"Not to-day, George. I know you\u0027re right in every word you say; and yet I can\u0027t give it up yet--at all events to-day. I must see her, I\u0027ve got something special to say to her, and the time\u0027s getting on. Good-by, old fellow; I know you mean well; and I\u0027ll come out all right yet. God bless you, old boy! Hi! Hansom!\" and Mr. Prescott jumped into a cab, murmured an inaudible address to the driver, and was whirled away. Mr. Pringle remained on the kerb-stone, shaking his head and looking after the departing Hansom. \"James Prescott is in for it,\" said he to himself; \"is decidedly in for it. So, by the way, is George Pringle. If I don\u0027t pay Wilkins that twenty pounds to-night, I shall be County-Courted, as safe as houses. I never have put my hand to any bill before; but needs must, I suppose. So I\u0027ll just step up and see old Scadgers.\" And Mr. Pringle struck across the Strand, in a northerly direction.","sourceLink":"http://novel.tingroom.com/duanpian/3026/83688.html","bookId":1068,"book":{"id":1068,"title":"Broken to Harness","description":"简介： The office of the Statesman daily journal was not popular with the neighbours, although its existence unquestionably caused a diminution of rent in its immediate proximity. It was very difficult to find--which was an immense advantage to those connec...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3026","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
