{"id":39610,"no":17,"title":"CHAPTER XVII. MINING OPERATIONS.","content":"No sooner was the Churchills\u0027 wedding safely over than all further reason for keeping on the establishment at Bissett Grange was at an end, and the party broke up at once. Sir Marmaduke went straight to Paris, and took up his quarters at Meurice\u0027s, according to his annual custom, to the disgust of Gumble, who detested all things \"forring\" with that pious horror always to be found in the British serving-class. The old gentleman knew Paris better perhaps than he knew London, and was thoroughly well known in the best circles of Parisian society; his eccentricity, quelque chose bizarre, which distinguished him from the ordinary run of English visitors, made him popular with the young people, while his perfectly polished manner to women, the unmistakable not-to-be-acquired high-breeding of the true gentleman, combined with his ready wit and biting sarcasm, both expressed in perfect French, rendered him a favourite with his coevals. To the Faubourg and its inhabitants, however, his visits were principally confined; he had never yielded allegiance to the Imperial Court, and used to speak of it and its august head in a very disparaging manner. \"Gad, sir!\" he would say in the smoke-room of Meurice\u0027s, after his return from the Fran?ais or from some grand reception,--\"Gad, sir! I\u0027ve a very low opinion of your what d\u0027ye call him?--your Emperor! met him often when he was in England,--at Gore House, and two or three other places; always found him a silent, moody, stupid fellow--that\u0027s it! a stupid fellow, by Jove!--tries to make out that he holds his tongue to think the more; like the monkey, you know. My belief is, that he\u0027s so deuced quiet because he\u0027s got nothing to say. And his surroundings, my dear fellow! his surroundings, awful! De Rossignol, who was a billiard-marker or a singer at a café chantant, or something of that kind; Oltenhaus, the financier, who is a Polish Jew, of the worst stamp; and O\u0027Malley, the Marshal, a mere Irish adventurer! That is not the sort of stuff for Courts, sir!--the sweepings of the Boulevard theatres, the Juden-Gasse at Frankfort, and the long-sword, saddle, bridle, whack-fol-de-rol, and all the rest of it, of the bold dragoon! Vieille école bonne école is a good maxim, by Jove! They mayn\u0027t be clever; but they\u0027re gentle-people at least, and that\u0027s not saying a little for them!\" So the old gentleman growled to the little select circle round him, enjoying himself meanwhile in the highest degree. Perhaps one of the most gratifying results of his sojourn in Paris he could not have explained, though at the same time he was, however unconsciously, keenly sensible of it; it was that he had Gumble at his mercy. So desolate, so bored, so completely used up was that great man, that he looked forward to the time of his master\u0027s retiring for the night, and getting up in the morning, as the only two happy periods in his Parisian existence. All the toilet-ceremonies, before held by him in deep disgust, were now lingered over with the utmost fondness, and every scrap of gossip was brought forward in the chance of its provoking a discussion, and protracting the period when the valet should be again relegated to the company of the French and German waiters and pert ladies\u0027-maids, who scoffed at Gumble\u0027s old-fashioned ways and stories. Of course there were other gentlemen\u0027s gentlemen installed with their masters at Meurice\u0027s; but they were all much younger than Gumble; and when their \"governors\" were not expected home till late, beguiled the weary hours with pleasant dances at the Salle Valentino, or suchlike resorts. But Gumble was a little too old, and a great deal too insular, to enjoy these recreations. Once indeed he had been persuaded into attending one of these public balls; but the sight of his deep white choker, straight-brushed whiskers aid solemn old mug, had such an effect on the dancers,--Jules utterly missing his great bound in the cavalier seul, and Eulalie failing to touch her vis-à-vis shoulder with her toe in the en avant deux,--that he was requested to confine his tristesse to some other place; and as he was really not amused, he willingly consented. So, after that, he remained at Meurice\u0027s, generally sitting solitary in a crowd of chattering French servants, beguiling the time sometimes by speculating how long his master would live, and what he would leave him at his death; whether a greengrocer\u0027s or a public-house would be the most profitable business to undertake with Sir Marmaduke\u0027s legacy; whether he could get any thing for the recipe of some wonderful boot-varnish which he alone possessed; sometimes by reading a shilling novel of fashionable life, or nodding dreamily over the Times of the previous day. One night, as he was attending his master to bed, he brought forth a special bit of news which he had reserved. \"House full here, sir,\" said he, as he was mixing the old gentleman\u0027s evening draught. \"Ah!\" growled Sir Marmaduke. \"God bless my soul, pack of people come over by the rail devilish cheap, and all that sort of thing. Poor dear old diligences kept the place dear; that was one comfort. Full, eh? Any body I know?\" \"Capting Currer, from the Forring Office, come in to-night, sir; saw he had a white shammy-leather bag with him, sir--\" \"Ah! Queen\u0027s messenger off to-morrow morning to Smyrna or Kamschatka, or some infernal place. Any body else?\" \"Miss Lexden come, sir; but we was full here, just full; so she have gone next door to the Windsor, sir. Only Withers with her, sir; no one else. Must miss Miss Barbara, sir--Mrs. Churchill, sir--I shouldn\u0027t think, sir.\" \"What the devil business is it of yours? What right have you to think about it? There now; be off! Good night.\" \"Bless my soul!\" said the old gentleman, when he was left alone. \"I\u0027m deuced glad Susan didn\u0027t get in here, or she\u0027d have led me a pretty life. I suppose I must call on her to-morrow morning. Deuced unpleasant \u0027talk there\u0027ll be--Barbara, and all the rest of it. Poor girl! Susan--too hard--come round at last;\" and musing in this way Sir Marmaduke fell asleep. When, in the course of the next day, he called upon Miss Lexden, he found that lady in the highest spirits. \"I knew you were here, Sir Marmaduke,\" said she. \"I\u0027ve had Cabanel here;--you recollect little Cabanel? Spanish-looking little fellow with black eyes; was an attaché when the Walewskis were in London; and he saw you at the duchess\u0027s last week. You\u0027re going there to-morrow of course? How well you look! that\u0027s the climate, you know, and the style of life; so much better than in that wretched old island of ours.\" \"What news do you bring from that wretched old island of ours?\" asked the old gentleman. \"News? none; not a scrap, positively not a scrap; nobody in town, not a soul. I didn\u0027t wait there above a day, but came through at once.\" \"You did not stop long enough to see the Churchills, I suppose?\" \"The--eh? I beg your pardon, I did not catch the name.\" \"The Churchills.\" \"Churchills!\" echoed Miss Lexden, with the greatest deliberation; \"Churchills! I have not the least idea who you mean.\" \"Ah!\" said Sir Marmaduke, through his closed teeth. \"No, of course not; you don\u0027t recollect your own brother\u0027s child, even when there\u0027s no one in town. If it had been in the season, I could not have attempted to suggest any thing so horribly low; but I thought perhaps, that when there was not a soul in town, as you said, you might have thought of the girl who is of your blood, and who has been, as it were, your daughter for ten years.\" And the old gentleman stamped his stick on the floor, and looked fiercely across at his cousin. \"O--h!\" said Miss Lexden, perfectly calmly. \"I didn\u0027t follow you at first; now I see. It seems strange to me that a man with your knowledge of the world, Marmaduke Wentworth,--more especially with your knowledge of me, derived in times past, when you had full opportunity of making yourself acquainted with my character,--should have imagined that I should for an instant have altered in my purpose as regards my niece Barbara. What is there to induce me to swerve one atom from--\" \"What?\" interrupted Sir Marmaduke; \"What? Old age, Susan Lexden! You and I are two old people, who ought to be thankful to have been left here so long; and not to bear malice and all sorts of miserable hatred in our old age, more especially to our own kindred. You\u0027re vexed with Barbara, not unnaturally, as you\u0027d set your heart upon seeing her married to a rich man; but that\u0027s over now, and so make the best of it. Her husband\u0027s a good fellow and a gentleman; so what more do you want?\" \"What more!\" exclaimed the old lady; \"what more! Freedom from this style of conversation; permission to go my own way without comment or impertinent suggestion. I use the adjective advisedly; I claim my right to visit those whom I like, to ignore those whom I dislike, without such remarks from those who I distinctly say have no right to make them. And, however old I may be, I am not yet sufficiently in my dotage to show affection, kindness, no, nor even recognition, to those who have wilfully disregarded my desires.\" So Sir Marmaduke retired worsted from the conflict, and contented himself with writing a letter to Major Stone, bidding that worthy: take the first opportunity of a visit to town to ascertain how Churchill and Barbara were getting on. * * * * * Mr. Beresford, after leaving Bissett, went for a short visit to a bachelor friend with a shooting-box in Norfolk; and after enjoying some excellent sport, and nearly boring himself to death, in the company of his host and a few hard-drinking sporting squires of the neighbourhood, returned to town--to his lodgings in South Audley Street, and to his daily routine of life. He did not at all dislike London in the autumn, when he had no calls to make; when he could wear out his old clothes; could smoke in the streets at any hour without loss of dignity; could get a little quiet reading and a little quiet play-going; and need not fear the admonitory missives of duns, who concluded that all their customers were, or ought to be, out of town at that dull season. Moreover, he had not spent all of the last two hundred pounds he had borrowed, and had received his October quarter\u0027s salary; so that, on the whole, he was in very good case, and came smiling radiantly into Simnel\u0027s room on the first morning after his return. Mr. Simnel, as usual, had a pile of papers before him; but he pushed them aside at Beresford\u0027s entrance; rose up, welcomed him; and placing his back against the mantelpiece, at once entered into conversation. \"Well, Mr. Commissioner,\" he commenced; \"so you\u0027ve got back to the hive, eh? and now I suppose you mean to remain and let one of the other hard-worked members of the Board have a little rest, eh?\" \"Yes,\" replied Beresford; \"I\u0027m a fixture now for a long time; I must take to the collar, and stick to it; but you, old fellow,--do you mean to say you\u0027ve been here all this blessed time?\" \"I\u0027ve not moved away yet,\" said Simnel; \"some one must do the work, you know,\" he added with a meaning grin. \"Yes, I knew, of course; and a deuced hard grind you\u0027ve had of it. But you\u0027ll go away now, I suppose?\" \"No; I shall run down to Leicestershire and get a little hunting next month perhaps that is, if I can get away; and I might take a fortnight in Paris at Christmas, just to avoid the \u0027God bless yous!\u0027 and \u0027Happy years!\u0027 and other jackass congratulations, which I hate and abominate.\" \"Genial creature!\" said Beresford, regarding him with great complacency \"what\u0027s the news?\" \"That\u0027s just what I should ask you,\" retorted Simnel; \"there\u0027s no news here. Sir Hickory has been to the Lakes, and \u0027my lady\u0027 was much pleased with Ullswater; which is more, I should think, than Ullswater was with \u0027my lady,\u0027 always supposing Ullswater to have any taste. Old Peck has slept as much as usual but has not devoted as much time as he generally does to his get-up, and has consequently been rather red and rusty about his beard. O\u0027Scanlon has been dying for your return, that he may get away; and the men in the Office are just the same as ever. Oh, by the way, I see that marriage has come off?\" \"Which marriage?\" \"That man Churchill, who was staying with you at old Wentworth\u0027s, has married that dashing girl--what was her name--?--Lexden!\" \"Yes; and the other marriage has come off. Old Schr?der is one flesh now with Miss Townshend; that\u0027s a nice thing to think of, isn\u0027t it?\" \"Ay, I heard of that too; saw it in the paper of course; but beyond that, one of the young fellows here, Pringle, had cards; he\u0027s a connexion, or something of the sort.\" \"Yes; they\u0027ve taken a thundering big house in Saxe-Coburg Square,--in the new South-Kensington district, you know,--and are coming out heavily. There\u0027s a dinner there on Thursday, to which I\u0027m asked; and a reception afterwards. It\u0027s a bad time of year; but there may be some new fillies trotted out, you know.\" \"Ah! you\u0027ve done nothing more in that matter, I suppose? no one on hand just now! no combination of money and beauty, as Jack Palmer says, when he rides with Schwarzchild into the City?\" \"None! I\u0027ve had no chance; but I should think this wouldn\u0027t be a bad opening. They are a tremendously well-tinned set at Schr?der\u0027s; and he\u0027s safe to ask no women who are not enormously ingotted. With such girls, unaccustomed to any thing but what was Paddington and is now Tyburnia, one might have a chance, for they\u0027ve seen nothing decent yet, you know. Your stock-brokering gent is a hopeless beast!\" And Mr. Beresford shrugged his shoulders, and then looked down at his feet, as though Capel Court lay beneath them. \"You\u0027re going to the dinner?\" asked Simnel. \"Going, my dear fellow! if you had been staying for the last month, as I have, with Jim Coverdale, you wouldn\u0027t ask the question. No better fellow than Jim breathes, and there\u0027s always capital sport to be got at his place; but the cooking is something indescribably atrocious. One always feels inclined, when he asks you what you\u0027d like for dinner, to use the old mot, and say, \u0027Chez vous, monsieur, on mange, mais on ne d?ne pas.\u0027 After a month\u0027s experience of Coverdale\u0027s cook, I am looking forward with eager anticipation to the performances of such an artist as Schr?der will probably employ.\" \"I should think,\" said Mr. Simnel, after a minute\u0027s pause--\"I should think it probable that Mr. Townshend will be there.\" \"First dinner after his daughter\u0027s marriage,\" said Beresford. \"Duty, by Jove Of course he will.\" \"If he is there, I want you to do me a favour,\" said Simnel, quietly. \"And that is--?\" asked Beresford, in whose ears the word \u0027favour\u0027 always rang with a peculiar knell. \"A very slight one, and involving very little trouble to you; else, you may take your oath, I know you too well to expect you\u0027d grant it,\" said Simnel, with some asperity. \"No! I merely want you, in the course of conversation, and when you have fully secured Mr. Townshend\u0027s attention, to introduce, no matter how, the name of a firm--Pigott and Wells.\" \"Pigott and Wells!\" repeated Beresford, mechanically. \"Pigott and Wells. Should he ask you any thing farther, you will remember that it is the name of a cotton firm in Combcardingham; and take care that it fits into your story. That\u0027s all!\" \"It won\u0027t get me into any row, will it?\" asked the cautious commissioner; \"you\u0027re such a tremendously sly old diplomate, such an infernal old Machiavel, that I am always afraid of your getting me into a mess.\" \"Sweet innocent! you need not fear. There\u0027s no harm in the name. Of course, it depends upon yourself how you bring it in.\" And Mr. Beresford, with a vivid recollection of owing eight hundred pounds to Mr. Simnel, undertook the commission. About the same time Mr. Schr?der\u0027s domestic arrangements were being discussed under the same roof, in No. 120. \"What are you going to do on Thursday night, Jim?\" asked Mr. Pringle of Mr. Prescott. \"Nothing,\" said Mr. Prescott. \"Then don\u0027t,\" said Mr. Pringle. \"It don\u0027t answer and it don\u0027t pay. I\u0027ve got a card for a party in Saxe-Coburg Square, and I\u0027ll take you if you like to come.\" \"But I don\u0027t like to come. I\u0027m sick of all your parties, with the same grinning and bowing nonsense, the same bosh talked, the same wretched routine from first to last. Who are the people?\" \"Now, what a duffer you are!\" said Mr. Pringle; \"first you declaim in the strongest virtuous indignation against all parties, and then you ask who the people are! Well; they are connexions of mine. Old Townshend, my godfather, who\u0027s an old beast, and who never gave me any thing except a tip of half-a-crown once when I was going to school, has married his daughter--deuced pretty girl she is too--to a no-end rich City party--Schr?der by name. And Mrs. Schr?der is \u0027at home\u0027 on Thursday evening, \u0027small and early;\u0027 and I\u0027ve got a card, and can take you. There\u0027s a dinner-party first, I hear, but I\u0027m not asked to that.\" \"What a pity!\" said Prescott; \"your true philosopher only goes to dinners. Balls and receptions are well enough when one is very young; but they soon pall. There is in them an insincere glitter, a spurious charm, which--\" \"Yes, thank ye,\" interrupted Mr. Pringle; \"for which see Pelham passim, or the collected works of the late Lord Byron. Much obliged; but I subscribe to Mudie\u0027s; and would sooner read the sentiments in the original authors. What I want to know is, whether you\u0027ll come?\" \"No, then.\" \"Yes, you will. I know you, you old idiot, and all the reason for your moping,--as though that would advance the cause one bit. Yes, you will. We\u0027ll dine at Simpson\u0027s; have a quiet weed in my chambers; dress there; and go into the vortex together.\"","sourceLink":"http://novel.tingroom.com/duanpian/3026/83695.html","bookId":1068,"book":{"id":1068,"title":"Broken to Harness","description":"简介： The office of the Statesman daily journal was not popular with the neighbours, although its existence unquestionably caused a diminution of rent in its immediate proximity. It was very difficult to find--which was an immense advantage to those connec...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3026","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
