{"id":39616,"no":23,"title":"CHAPTER XXIII. MR. BERESFORD IN PURSUIT.","content":"The idea suggested by Simnel, after the interview with Dr. Prater at the Flybynights, came upon Mr. Beresford with extraordinary force. It opened up to him a new train of thought, gave a complete turn to his intended course of life, afforded him matter for the deepest study and reflection. As we have already seen, he was a man with a faultless digestion, and without a scrap of heart--two qualities which had undoubtedly greatly conduced towards his success in life, and towards making him a careless, easy-going worldly philosopher. When he first saw Miss Townshend at Bissett Grange, he remembered her as a cheery little flirt whom he had met during the previous season; and finding her companionable and amusing, determined to carry on a flirtation which should serve as a pastime, and, at the break-up of the party, be consigned to that limbo already replete with similar amourettes. The presence of Captain Lyster, and the unmistakable evidence of his passion for the young lady, gave Mr. Beresford very little annoyance; he had a notion that, save in very exceptional cases, of which indeed he had had no experience, women had a horror of an earnest lover; that watchings and waitings, hangings on words, deep gazings into eyes, and all outward signs of that passion which induces melancholy and affords themes for poets, were as much rococo and out of date as carrying a lady\u0027s glove in your hat and perpetually seeking a fight with some one on her account. He thought that women hated \"dreary\" lovers, and were far more likely to be won by rattle, laughter, and raillery than by the deepest devotion of a silent and sighing order. Moreover, as he was only going in for flirtation, he would make his running while it lasted, and leave the Captain to come in with the weight-carrying proprieties after he had gone. So far at first. Then came the recollection of his straitened position, the reflection that Miss Townshend was an heiress, and the determination to go in seriously for a proposal--a determination which was very short-lived, owing to the discovery of the lady\u0027s engagement to Gustav Schr?der. From the time of her marriage, Mrs. Schr?der was by Beresford mentally relegated to a corps which included several married ladies of his acquaintance; for the most part young and pretty women, whose husbands were either elderly, or immersed in business, or, what was equally available, immersed in pleasure, and more attentive to other men\u0027s wives than to their own; ladies who required \"notice,\" as they phrased it, and who were sufficiently good-looking to command it from some men, between whom and themselves there existed a certain understanding. Nothing criminal, nor approaching to criminality; for despite the revelations of the Divorce Court, there is, I take it, a something, whether it be in what is called our phlegmatic temperament, whether it be in the bringing-up of our English girls,--bringing-up of domesticity utterly unknown to Continental-bred young ladies, which hallows and keeps constantly present the image of the doting father and the tender mother, and all the sacred home-associations,--a something which strengthens the weak and arrests the hand of the spoiler, and leaves the sacrifice incomplete. The necessity for \"notice,\" or for \"being understood,\" or \"for having some one to rely on\" (the husband engaged in business or in the House being, of course, utterly untrustworthy), has created a kind of society which I can only describe as a kind of solid bread-and-butter demi-monde--a demi-monde which, as compared with that state of existence known in France under the title, is as a club to a tavern, where the same things are carried on, but in a far more genteel and decorous manner. The relations of its different members to each other are as free from Wertherian sentimentalism as they are from Parisian license, and would probably be considered severely correct by that circle of upper Bohemians, of whose lives the younger Dumas has constituted himself the chronicler. Having, then, mentally appointed Mrs. Schr?der a member of this society, Mr. Beresford took upon himself the office of her cavalier, and behaved to her in due form. When they were in company together, he sedulously kept his eyes upon her, strove to anticipate her wishes, and let her see that it was she who entirely absorbed him; he always dropped his voice when he spoke to her, even though it were about the merest trifle; and he invariably took notice of the arrangements of her dress, hair, and appearance in general, and made suggestions which, being in excellent taste, were generally approved and carried out. Then he found out Mrs. Schr?der\u0027s romantic side, a little bit of nineteenth-century sentiment, dashed with drawing-room cynicism, which found its exponent in Mr. Owen Meredith\u0027s weaker verses; and there they found plenty of quotations about not being understood, and the \"little look across the crowd,\" and \"what is not, might have been,\" and other choice little sentiments, which did not tend to elevate Mr. Gustav Schr?der, then hard at work in the City, in his wife\u0027s good opinion. Indeed, being a very weak little woman, with a parasitical tendency to cling for support to something, and being without that something, which she had hitherto found in Barbara, free from the dread which her father\u0027s presence always imposed upon her, and having no companion in her husband, Mrs. Schr?der began to look forward with more and more eagerness to her opportunities of meeting Charles Beresford, to take greater and greater delight in his attentions and his conversation, and to substitute a growing repugnance for her hitherto passive endurance of Mr. Schr?der. Charles Beresford was gradually coming to occupy the principal position in her thoughts, and this that gentleman perceived with mingled feelings of gratified vanity and annoyance. \"She\u0027s going a little too fast!\" he had said to himself; \"this sort of thing is all very well; but she\u0027s making it a mile too palpable! People will talk, and I\u0027m not in a position to stand any public scandal; and as for bolting, or any thing of that sort, by Jove, it would be sheer ruin and nothing less.\" In this frame of mind, it had more than once occurred to Mr. Beresford to speak to Mrs. Schr?der, and caution her as to her bearing towards him; but fortunately for him, so thoroughly void of offence had been all their relations hitherto, that he scarcely dared to hint at what he intended to convey, without risking the accusation of imputing evil by his very advice. And in the mean time, while he hesitated what course to take, came Dr. Prater\u0027s information, which at once changed all his plans. The day after the conversation at the Flybynights, Mr. Beresford left town and remained away for a week. The first day after his return, he went into Mr. Simnel\u0027s room at the Office, and found that gentleman as usual surrounded with work. Contrary, however, to his general custom, Simnel no sooner looked up and saw Beresford than he threw down the pen which he was plying, rose, and advancing shook his friend heartily by the hand. \"Glad to see you back, Charley!\" he said; \"I was afraid you were off for a ramble by your leaving no message and no address. Some of the old games, eh? You must give them up now, Master Charley, and live circumspectly; by Jove, you must.\" \"Nothing of the sort,\" replied Beresford. \"Gayford, who was chief here before Maddox, was an old friend of our family; and he\u0027s ill, poor old boy, so I went out of charity to stay with him. He\u0027s got a place at Berkhampstead, and there\u0027s deuced good hunting-country round there. I had three capital days; Gayford\u0027s daughters were out; clipping riders, those girls; good as Kate Mellon any day!\" \"Indeed!\" said Mr. Simnel, wincing a little at the name: \"I should think flirting with any body\u0027s daughters, be they ever so \u0027clipping,\u0027 as you call it, would be time wasted for you just now, wouldn\u0027t it?\" \"What do you mean?\" asked Beresford, knowing perfectly, but anxious that the declaration should come from his companion. \"Mean!\" said Simnel, somewhat savagely. \"What ant I likely to mean? That you ought to stick to your duties here and earn your salary; that Sir Hickory has heard that you go to the Argyle Rooms, and is going to speak to Lord Palmerston about it; that you\u0027re hurting your health or spoiling your complexion by keeping late hours,--is that why I\u0027m likely to tell you to live circumspectly? What rubbish it is fencing with me in this way! You know that the last time we met was at that nightclub of yours; that we had a talk there with Dr. Prater; and that you determined--\" \"I know,\" interrupted Beresford with a start--\"I know,\" he continued, looking round, \"I\u0027m not over particular; but I confess this plotting for a dead man\u0027s shoes seems to me infernal rascality.\" \"What do you mean by \u0027plotting,\u0027 Charles Beresford? I am plotting for no dead man\u0027s shoes. I have no hope of marrying a pretty widow, and having a splendid income; and as for rascality--\" \"There, I didn\u0027t mean it; I only thought--\" \"Nor, on the other hand,\" pursued Mr. Simnel, relentlessly, \"am I over head and ears in debt, pressed by Jews, horribly impecunious, and--\" \"Leave me alone, Simnel, can\u0027t you? I know all this; and as you must be perfectly certain, I\u0027ve turned this Schr?der affair over in my mind a hundred times already.\" \"And what have you decided?\" \"To go in for it at all hazards.\" \"I think you\u0027re right,\" said Simnel quietly; \"it seems to me your last chance; and though it\u0027s not strictly a very nice business, there are hundreds of men holding their heads up before the world, which very much esteems them, who have made their money in far worse transactions. You\u0027ll require an immense amount of patience and tact.\" \"The former undoubtedly. Prater said he might go at any moment if--what was it?--any thing excited or annoyed him. Question is what does excite a fellow of that sort--Muscovadoes being high, or gray-shirtings scarce, or pig-iron in demand, or some of those things one sees in the paper--banks breaking or stocks falling, eh? As for the tact, I don\u0027t think that will be required now.\" \"How do you mean--now?\" \"Because it\u0027s all squared already,\" said Beresford complacently. \"I\u0027ve only to go in and win whenever I like I imagine. To tell the truth--though a man doesn\u0027t talk of these things, of course--I\u0027ve being fighting shy of it lately, rather than pressing it on.\" \"Yes, yes, of course,\" said Simnel impatiently; \"I know all about that; but don\u0027t you see that the greatest tact will be required because your plan of operations must be entirely changed? You have been carrying on a very animated flirtation within certain limits; but now you are going in for a totally different thing. You are going in--sit down, and let us talk this over quietly, it\u0027s rather important: I know you\u0027ve great experience in such matters; but just listen to my humble advice, it may be worth hearing,--you are going in to make sure of marrying a woman after her husband\u0027s death; an event likely to occur at any time. To insure success there are two ways--one by compromising her--\" \"By Jove, Simnel!\" exclaimed Beresford through his shut teeth. \"Be quiet, and don\u0027t interrupt--I\u0027m not going to brush the down off your virtue! As I said, by compromising her, by which you gain a hold upon her which she cannot shake off, and must always acknowledge and bow to, when required. But this, besides being wrong and unjust, and all that sort of thing--which I don\u0027t so much mind--is risky, which I dislike; and if detected, brings the whole fabric to the ground. So we may put that on one side.\" \"Ah!\" said Beresford, with a sigh of relief; \"and the other?\" \"The other is a totally different method, and unlike any thing you have ever tried, I suspect, with any one. It is simply by professing hopeless, unswerving, unconquerable spooniness. You have hitherto--pardon the question--merely looked and sighed, \u0026c.? Ah, I thought so; that gesture was quite satisfactory as to the amount of tenderness. Well now, then, you must declare yourself. Quietly, of course, and, if you please, without any manifestations, which would entirely spoil our plan, the essence whereof is virtue. You declare yourself to this effect: that you are so completely smitten that you can keep silence no longer; that previous to going away for a lengthened period (for you believe that expatriation is the only thing that will afford temporary relief), you have determined on speaking to her, fearing she might think your absence strange, or hear its cause wrongly explained by somebody else; that yours is not like the feeble sentiment of the butterflies who flutter around her, \u0026c. \u0026c.; but a deep and stedfast passion, which will only cease with life. You know all that business. Then, that your respect for her is so great, that you will not give scandal the smallest chance of a whisper. Had you met in happier times--oh! you did, eh? Well, then, had you been in a position, when you first met, to have offered, \u0026c.; but now, too late! love for ever; but leave for ever--foreign climes.\" \"Yes; but you know well enough I can\u0027t go abroad, and--\" \"My dear fellow, she\u0027ll never dream of your doing any thing of the sort. If I\u0027ve any knowledge of women, she\u0027ll be deeply affected, as she ought to be by your deucedly romantic story. She\u0027ll say a good deal about \u0027if,\u0027 in reference to former years; she\u0027ll state her full determination to do nothing approaching the smallest shadow of wrong; but she\u0027ll avow she should be miserable at the idea of being the cause of your banishment, and therefore she\u0027ll entreat you to stop in England and be her brother.\" \"Be her brother?\" \"Ay, and a first-rate position you\u0027ll have of it as her brother. There\u0027ll be an immense amount of sentiment in the connexion; she\u0027ll defer to you in every thing; your presence will always keep every body else off, and she\u0027ll never dream of carrying on with any one but you. How could she expect again to meet with such delicacy as you\u0027ve shown? And if any thing should happen, you\u0027re safe to be first in the field and to carry off the cup. Now do you see the line of country?\" \"Oh, yes, I see it fast enough, and I\u0027ve no doubt I can manage it. It\u0027s rather a duffing business altogether; however, needs must, and I musn\u0027t risk any more flukes. One thing I am curious about, Simnel.\" \"What\u0027s that?\" \"Why you take such an interest in this business? You first put me on to it, and you\u0027ve evidently given it some of your precious time in thinking it out while I\u0027ve been away. Be frank for once in your life, and say--\" \"Why does it interest me?\" said Simnel, nursing his leg, and giving a grin which showed all his big teeth. \"Well, Master Charley, your memory has never been good, but you might occasionally recollect that you owe me eight hundred pounds!\" \"Yes,\" said Beresford, \"I know that well enough; but it isn\u0027t for that alone. You\u0027ll be safe to get that, if I marry and come into money; but there\u0027s something more in it than that, I know. It\u0027s that business with the name of that firm that you made me say to old Townshend, isn\u0027t it now, eh?\" \"What, Pigott and Wells!\" said Simnel, rocking to and fro--\"Pigott and Wells of Combcardingham? Well, perhaps that has something to do with it; who knows? Meantime, stick to what I\u0027ve told you; begin at once, and in a month\u0027s time come to me with a good report.\" And so ended the colloquy between this precious pair. * * * * * Pursuing his instructions with a certain amount of relish, and all the experience of an accomplished and versatile actor, Mr. Beresford threw himself into his new character with spirit, and made a decided hit in it. All the raillery and nonsense, all the smiles and laughter, had vanished. Owen Meredith had been exchanged for Lord Byron; and Mr. Beresford as a nineteenth-century London-made Giaour was doing terrible execution to that feeble little bit of Mrs. Schr?der\u0027s anatomy which she called her heart. There was no one to say a kind word, to give proper advice, to the poor little woman in her need. Barbara was absolutely lost to her: she had been two or three times to Great Adullam Street, and Barbara had returned the call; but there was evident restraint on both sides. The outside show of friendship remained, but there was no animating spirit; none such, at least, as to call for the kind of confidence which Alice Schr?der would gladly have made, had she received the slightest invitation. But Barbara was not the Barbara of old days: she looked worn and anxious, was constantly preoccupied, and answered at random; she confined herself, moreover, to the merest commonplaces in her conversation, so that Alice got no help from her. Nor from her father had she any supervision: strict to a fault before her marriage, Mr. Townshend, having once settled his daughter, imagined that his duty in life was done, and that henceforth he might devote himself entirely to pleasure, consisting in haunting the City by day and the whist-tables at the Travellers by night. And it began to be noticed that this hitherto model British merchant drank a great deal of wine with his dinner, and a great deal of brandy after it; and there were ugly rumours running about \u0027Change and drifting through Garraway\u0027s; and Townshend\u0027s clerks were rather in request at the Bay Tree, and were manifestly pumped as to whether there was any thing wrong with their governor, under the guise of being requested to \"put a name\" to what they would like to drink. It may be imagined, therefore, that under this state of circumstances Mr. Townshend had neither time nor inclination to bestow any advice upon that daughter, who, as he was in the habit of saying, \"had made such a splendid alliance.\" With her husband Alice had, as has before been said, nothing in common. He was a cold, proud, well-meaning man, who gloried as much as a white-blooded elderly person can be said to glory in his riches and his state, and who liked to have a pretty, elegant, well-dressed woman before him at table, in the same way that he liked to have a stout big-whiskered butler in a white waistcoat behind him. He liked his wife, when he had time to think about her; but he had been brought up in business, and that absorbed his whole attention by day; while giving or going to parties, in which he could spend the result of what he had attained by business, occupied him at night. But he had the highest opinion of Mrs. Schr?der\u0027s conduct, which he imagined was on a par with every thing else in the establishment--real and genuine; and he paid her bills, and presented her with cheques, with lavish generosity. Only he was not exactly the man on whose bosom a wife could lay her head and confess that she was tempted beyond her strength. There was a man who, without being much mixed up with this little episode in the great drama of human life, overlooked some of the scenes, and saw the dangers to which one of the characters was rapidly exposing herself. That man was Fred Lyster, the one sentiment of whose life--his love for Alice Townshend--was as fresh and as green and as pure as ever. The announcement of her engagement was a great shock to him, and he had taken care only to meet her face to face once or twice since her marriage. The meeting upset him; and though she was apparently unconscious of any feeling in the matter, it did her no good; and there was no earthly reason why it should be. But he went every where where she went, and watched her in the distance; his ears were always on the alert whenever her name was mentioned in club smoke-rooms and suchlike haunts of gossip; and he found, as he had dreaded with fatal prescience, at Bissett, that Beresford was on the trail. Long and earnestly he deliberated with himself as to what course he should pursue. Should he pick a quarrel on some other topic with Beresford, and shoot him? Shooting had gone out of fashion; and if he killed his man, he should be exiled from England; if he didn\u0027t kill him, where was the use of challenging him? Should he speak to Mr. Townshend? or was there no female friend to whom he could apply? Yes; Barbara Churchill. In Barbara Churchill he had the greatest confidence, and to her he would go at once.","sourceLink":"http://novel.tingroom.com/duanpian/3026/83701.html","bookId":1068,"book":{"id":1068,"title":"Broken to Harness","description":"简介： The office of the Statesman daily journal was not popular with the neighbours, although its existence unquestionably caused a diminution of rent in its immediate proximity. It was very difficult to find--which was an immense advantage to those connec...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3026","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
