{"id":39618,"no":25,"title":"CHAPTER XXV. A GARDEN-PARTY AT UPLANDS.","content":"Although it was only in the first days of July, it had become thoroughly evident that the London season was on the wane. After a lengthened period of inaction, there had been a fierce parliamentary struggle brought about by that rising young gladiator Mr. Hope Ennythink, who had impeached the Prime Minister, brought the gravest charges against the Foreign Secretary, accused the Chancellor of the Exchequer of crass ignorance, and riddled with ridicule the incompetence of the First Lord of the Admiralty. As Mr. Hope Ennythink spoke with a certain amount of cleverness and a great amount of brass, as he was thoroughly up in all the facts which he adduced,--having devoted his life to the study of Hansard, and being a walking edition of that popular work,--and as he was warmly supported by the Opposition, whose great leaders thought highly of the young man, he ran the Government very hard, and gave the Treasury-whips a great deal of trouble to secure even the slight majority which pulled them through. But immediately the fight was over, it was evident that the session was on the point of closing. There was no more excitement; it was very hot weather; and the session and the season were simultaneously doomed. However, the wives and daughters of the members were determined to die hard; there would be at least a fortnight before the prorogation of Parliament, and during that fortnight dinners, balls, fêtes, and opera-visitings were carried on with redoubled activity. To a good many, condemned to autumnal pinchings and scrapings in a dull country-house, it was the last taste of pleasure until next spring. Upon the gentlemen attached to the room No. 120, in the Tin-Tax Office, the general state of affairs was not without its effect. Mr. Kinchenton was away for his holiday--he generally chose July as the best month for little Percy\u0027s sea-bathing--and he rung the changes between Worthing, Bognor, and Littlehampton, in one of which places he would be found in an entire suit of shepherd\u0027s-plaid, and always with a telescope slung round him. Mr. Dibb, his liver in a worse state than ever with the hot weather, had felt himself compelled to quit the pleasant environs of Clapton, where he ordinarily resided, and had taken a bedroom at Windmill-Hill, Gravesend, whence he came up to his office every morning, having immediately established sworn animosity with every guard and regular passenger on the North-Kent Railway, and having regular hand-to-hand combats with the man who sat opposite to him, as to whether the window should be up or down--combats commencing at Gravesend and finishing at New Cross. Upon Mr. Boppy had come a new phase of existence, he having persuaded Mrs. Boppy, for the first time since their marriage, to go on a visit to some country friends, thus leaving him his own master pro tem. And Mr. Boppy availed himself of this opportunity to give a bachelor-party, cards and supper, at which Mr. Pringle was the master of the revels, and they all enjoyed themselves very much, and talked about it afterwards to Mr. Boppy; little thinking of the unrevealed misery that wretched convivialist was enduring on account of his being unable to rid the window-curtains of the smell of tobacco-smoke, by which Mrs. B. would learn of the past symposium, and would \"warm\" her husband accordingly. Mr. Prescott and Mr. Pringle had been going on much the same as usual; and Mr. Crump never went out of town because his pay was stopped when he was absent from his office, and he never had any friends who wished to see him. It was a very hot morning, the sun blazed in through the windows of No. 120, aid upon the head of Mr. Pringle, who was copying items of account on to a large ruled sheet of paper. \"Item, every horse for draught or burden--item, each dog, sheep, swine--I\u0027ll be blowed if I\u0027ll do any more of it,\" said Mr. Pringle, casting down his pen and rubbing his head. \"I must have some soda-water! Prescott, James, was there too much lemon in Quartermaine\u0027s punch last night, or was it that the whitebait are growing too large to be wholesome? Something was wrong, I know! Crump, my boy, you\u0027re nearest the cellar; just hand me a bottle of the corrective.\" Mr. Crump certainly was nearest the cellar, which was in fact the cupboard which should have been his property, but which had been appropriated by Messrs. Pringle and Prescott as a soda-water store. \"That\u0027s a good fellow; now you\u0027re up, would you mind just handing me a bit of ice out of the basin? Thanks! What a good Crumpy it is! What\u0027s the matter, Mr. Dibb?\" \"Can\u0027t you be silent for an instant, Mr. Pringle? You are perpetually gabbling. Can\u0027t you let us have a moment\u0027s peace?\" \"I can generally,\" said Mr. Pringle, with an affectation of great frankness; \"but, somehow, not this morning. I seem to be inspired by this delicious fluid. I think I shall write a book called Songs of Soda-water, or Lays of the Morning after. That wouldn\u0027t be a bad title, would it, Dibb?\" Mr. Dibb took no notice of this beyond glaring at Mr. Boppy, who had laughed; and there was silence for a few minutes, broken by Mr. Prescott, who said, \"When do you go on leave, George?\" \"In September, sir,\" replied Pringle. \"That\u0027s the genial month when the leaves come off.\" \"Where are you going?\" \"That depends upon how much tin I\u0027ve got. It strikes me, from the present look-out, that the foreign watering-place of Holloway is about as far as I shall be able to get. There\u0027s a tightness in the money-market that\u0027s most infernal.\" \"Why don\u0027t you apply to your godfather, old Townshend? He\u0027s always treated you with kindness.\" \"Yes; with un-remitting kindness! wouldn\u0027t send me a fiver to save me from gaol. Oh, no! I\u0027ll manage somehow. When are you going?\" \"Well, I wanted a few days in September myself, if I could get away. I\u0027ve some shooting offered me at Murray\u0027s.\" \"Murray\u0027s? Oh, ah! the parent of that nice little girl! je twig. And the Paterfamilias is a jolly old bird, isn\u0027t he, and likes his drink, and has plenty of money? in which case pater-familiarity does not breed contempt.\" \"They are old friends of my people, you know; and the old gentleman\u0027s been very civil to me.\" \"Ah! and the young lady hasn\u0027t been rude, has she?--at least I judged not, from \u0027what I saw. She rides deuced well; but what a long time she takes to mount! and when you had swung her to the saddle, I noticed that her reins took an immense deal of arranging!\" \"Don\u0027t be an idiot, George! you\u0027re always fancying things.\" \"And you\u0027re always fancying girls, and my life\u0027s passed in keeping you out of scrapes.\" \"By the way, do you ever see any thing of--\" \"Of the other? Ah, base deceiver! fickle as the wind, or the what\u0027s his name! Yes, I\u0027ve met poor Kitty once or twice, and, without any nonsense, she looked thoroughly seedy and worn.\" \"Poor dear Kitty, I\u0027m so sorry! I--\" \"Oh, yes, we know all about it; \u0027he loves and he rides away,\u0027 and all the rest of it. But, joking apart, Master Jim, it\u0027s a very good thing that business is over. I was really \u0027afraid at one time you were going to grief. But--hollo! for me?\" These last words thrown off at a tangent to a messenger who entered the room with a letter. \"No, sir; for Mr. Prescott.\" \"Ah! I don\u0027t like letters generally; but that\u0027s not a blue one, and looks tolerably healthy. What\u0027s it about, James?\" \"Read for yourself;\" and Mr. Prescott tossed the letter over to him. \"Mrs. Schr?der--garden fête--Uplands,\" said Pringle, reading. \"Oh, ah! I knew all about that, but I didn\u0027t mention it, because I wasn\u0027t sure that you\u0027d be asked; and as a certing persing is going, you\u0027d have been as mad as a hatter at losing the chance of meeting her.\" \"What\u0027s Uplands?\" asked Prescott. \"Uplands is no end of a jolly place which Schr?der has taken for the summer and autumn. He has got some tremendous operation in the mines, or the funds, or some of those things that those City fellows get so brutally rich with; and he must be in town two or three times a week. So instead of going to Switzerland, as he intended, he has rented Uplands, which is about seven miles from town, and might be seventy. Out north way, through Whittington; stunning Italian villa, fitted up no end, with conservatories, and big grounds, and a lake, and all sorts of fun. Belonged to another City buffer, who\u0027s over-speculated himself and gone to Boulogne. That is a comfort; they do go to smash sometimes; but even then they\u0027ve generally settled as much as the Chief Commissioner\u0027s income on their wives. Schr?der heard of this; pounced upon it at once; and this is to be Mrs. Schr?der\u0027s first garden-party.\" \"I\u0027m very glad I\u0027m asked, if--\" \"Glad you\u0027re asked! I should think so; it\u0027ll be a first-rate party. There\u0027ll be no shy ices or Cape cup; Gunter does the commissariat; the Foreign Office has been instructed to send a lot of eligible Counts; and Edgington will supply the marquee.\" \"I was going to say, when you were kind enough to interrupt me, that I\u0027m glad I\u0027m asked, if Miss Murray is to be there.\" \"She\u0027ll be there, sir, fast enough; and you shall devote yourself to her, and be the Murray\u0027s Guide; and I\u0027ll be your courier, and go before you to see that all is square. I mean to enjoy myself that day, and no mistake.\" \"This is the place, Jim!\" said Mr. Pringle, as on the day of the party they drove in a hansom along a meadow-bordered road some two miles the country side of the little village of Whittington. \"That\u0027s the house, that white building with the high tower; no end of a smoke-room that tower makes! it\u0027s fitted up with lounges and Indian matting; all the windows hook outwards, and there\u0027s a view all over every where! What a lot of traps, too!--like the outside of the Star and Garter on a Sunday afternoon. That\u0027s the Guards\u0027 drag, I suppose; I know there was a lot of them coming down--\" \"And there\u0027s old Murray\u0027s carriage; I\u0027d know that any where,\" interrupted Prescott. \"Is it? well, then, you\u0027ll be all right. Easy, cabby; we don\u0027t want to be thrown into the very midst of the aristocracy; we\u0027ll get out here, and walk quietly up.\" Mr. Pringle had by no means given an exaggerated description of the beauties of Uplands. The house stood on the brow of the hill, under which nestled the little village of Whittington, the only cluster of buildings within a couple of miles\u0027 range. All round it lay large meadows, through which flowed, in tiny silver thread, the river Brent; while far away on the horizon lay a thick heavy cloud betokening the position of Babylon the Great. In the house the rooms, though somewhat low, were large and cheerful, and the grounds were laid out in every variety of exquisite taste. There were broad lawns, whereon the croquet-players loved to linger; and noble terraces where the elderly people sat, sheltered alike from the sun and the wind; and dark winding shady walks, down which, at the close of evening, couples would be seen stealing, and being questioned on their return, would declare that they had been to see the syringa,--a statement which was invariably received with derision, or, as the poet hath it, \"Doubts would be muttered around, and the name be suggested of Walker.\" And there was a large lake with a real Venetian gondola upon it, very black and gloomy, and thoroughly realising the notion of a \"coffin clapt in a canoe,\" and a large light shallop with an awning, and a couple of outriggers and a water-quintain for those people who preferred athletics to ease, and sunstrokes to comfort. \"This is the right sort of thing, isn\u0027t it, my boy?\" said Mr. Pringle, as they passed along. \"I suppose you could put up with a crib like this, couldn\u0027t you? What a lot of people! every body in London here! How do, doctor? Dr. Prater, very good little party; took me behind the scenes at the Opera once, and gave me a certificate when I wanted sick-leave. See that tall man in the fluffy white hat? Mincing-Lane fellow merchant; named Hill; capital fellow, but drops his h\u0027s awfully. They call him the Malade Imaginaire, because he calls himself \u0027ill when he isn\u0027t. That\u0027s his wife in the black dress with white spots on it, like change for a sovereign. Those two tall fellows are in the Second Life-Guards. Look at the nearest one to us, that\u0027s Punch Croker; don\u0027t he look like an ape? I always long to give him a nut: the other man\u0027s Charley Greville, a very good fellow; they tell a capital story about him. His uncle was a tremendous old screw, who left Charley his heir. When the will was read, the first clause contained the expression of a hope that his debts would not be paid. Charley had a copy of this clause sent round to all the creditors, with an indorsement that he, as executor, would religiously fulfil the desire of the deceased. There was a terrible scrimmage about it, and the lawyers are at it now, I believe.\" \"Isn\u0027t this our man--Beresford?\" \"Of course it is, and there\u0027s Mr. Schr?der close by him. We\u0027ll go up and make our salaams.\" So the young men wound through the crowd, and were very cordially received by Mrs. Schr?der, and indeed by Mr. Beresford. For the Commissioner knew his popularity in the Office and was pleased at it, and was always glad to meet decent-looking men belonging to it in society. \"It improved the tone of the confounded place,\" he used to say. Talking to Mrs. Schr?der was Mr. Sergeant Shivers, one of the ornaments of the Old-Bailey bar; a tremendously eloquent man in the florid and ornate style, with a power of cross-examination calculated to turn a witness inside out, and a power of address able to frighten the jury into fits; but who scorned all these advantages, and was never so happy as when talking of and to great people. He was on his favourite topic when Prescott and Pringle arrived. \"Ah, my dear Mrs. Schr?der,\" he was saying, \"isn\u0027t it sad? The duchess herself sent for me, and said, \u0027Now, Mr. Sergeant, speak to him yourself. You have experience of life; above all, you have experience of our order. Tell Philip what will be the result of this marriage with Lady Di!\u0027 I promised her grace I would; and I did. I spoke not only to Lord Philip, but to Lord Ronald and Lord Alberic, his brothers. But it was no good; the marriage has come off, and now the poor duchess is in despair. Ah! there\u0027s Lady Nettleford! I must go and condole with her on the affair;\" and the learned sergeant bowed himself off. \"Ah! \u0027Good-by to the bar and its moaning,\u0027 as Kingsley says,\" remarked Mr. Pringle. \"What a dreary bird! Now I see you\u0027re fidgetting to be off, Jim; and I know perfectly well why; so we\u0027ll go and look after the Murray. What a pity she\u0027s not got up in red, like her namesakes! then we could recognise her a mile off.\" \"There she is!\" suddenly exclaimed Mr. Prescott. \"There! just crossing the end of the croquet-ground. I\u0027m off, George. I shall find you in plenty of time to go together;\" and Mr. Prescott strode away in great haste. \"Very good,\" said Mr. Pringle; \"\u0027and she was left lamenting.\u0027 I believe I am in the position of the daughter of the Earl of Ellin; if not, why not? There\u0027s no fair young form to hang upon me; man delights me not nor woman either; so I\u0027ll see if there\u0027s any moselle-cup handy.\" Among those present at the Uplands fête were Frank Churchill and Barbara. Alice Schr?der had made a great point of their coming; and though at first Barbara refused, yet her husband so strongly seconded the invitation, that she at length gave way and consented. It was a trying time for Barbara: she knew she would there be compelled to meet many of the members of that old set amongst which her youth had been passed, and which she had so sedulously avoided since her marriage, and she was doubtful of her reception by them. Not that that would have distressed Barbara one jot; she would have swept past the great Duchess of Merionethshire herself with uplift eyebrows and extended nostrils; but she knew that Frank was horribly sensitive, and she feared lest any of his sympathies should be jarred. Moreover, she felt certain that Captain Lyster would be at the Uplands; and though since the day of the little outbreak his name had not been mentioned, and all having been made up with a kiss had gone smoothly since, Barbara had an inward dread that the sight of him would arouse Frank\u0027s wrath and lead to mischief. However, they came. Barbara was very charmingly dressed; and if her face were a little pale and her expression somewhat anxious, her eye was as bright and her bearing as proud as ever. Alice Schr?der received her in the warmest manner, kissed her affectionately, and immediately afterwards without the slightest intention planted a dagger in her breast, by expressing delight at \"seeing her among her old friends again.\" \"These old friends\"--i.e. persons whom she had been in the habit of constantly meeting in society, and who had envied and hated her--were gathered together in numbers at Uplands, and all said civil things to Barbara; indeed, the great Duchess of Merionethshire actually stepped forward a few paces--a condescension which she very rarely granted,--and after welcoming Barbara, begged that Mr. Churchill might be presented to her, \"as a gentleman of whom she had heard so much.\" Barbara rather opened her eyes at this; but after the presentation it was explained by the duchess saying, \"My son-in-law, Lord Halley, has often expressed his recognition of the services rendered to him by your pen, Mr. Churchill.\" For Lord Halley was Foreign Secretary at that time, and certainly gave Churchill plenty of opportunities of defending him. And as they moved away, Barbara heard the duchess say, \"What a fine-looking man!\" and Mr. Sergeant Shivers, who was thoroughly good-natured, began loudly blowing the trumpet of Frank\u0027s abilities. So that Barbara was happier than she had been for some time; and her happiness was certainly not decreased by seeing that the cloud had left Frank\u0027s brow, and that he looked in every way his former self. \"Now, Barbara,\" said Alice Schr?der, approaching them, \"we are getting up two new croquet sets, and want members for each. You\u0027ll play, of course? I recollect how you used to send me spinning at Bissett--oh, by the way, have you heard? poor dear Sir Marmaduke, so ill at Pau, or somewhere--\" \"Ill? Sir Marmaduke ill?\" \"Yes, poor dear! isn\u0027t it sad? And Mr. Churchill will play too; but not on the same side. I can\u0027t have you on the same side; you\u0027re old married people now; and both such good players too! Let me see; Captain Lyster, will you take Mrs. Churchill on your side?\" Captain Lyster bowed, shook hands, and expressed his delight. Frank Churchill shook hands with Lyster; but as he did so, a flush passed over his face. \"Now, then, that set is full,\" said Mrs. Schr?der; \"who is the captain of the other set, playing at the other ground? oh, you, Mr. Pringle! Will you take Mr. Churchill away with you; you only want one, I think?\" \"No, madam,\" said Pringle, with a serio-comic sigh; \"I only want one; but I shall want that one all my life. Come along, Mr. Churchill.\" And he and Frank started off to the lower lawn together. Barbara had always been very fond of croquet. She played well; relying more upon the effectiveness of her aim than the result of her calculations. She had a perfect little foot; and she croqueted her adversaries far away with as much science as malice. She enjoyed the game thoroughly, as, not having played for months, she rejoiced at finding that she retained all her skill; but she could not help perceiving that Captain Lyster was dull and preoccupied, and that he attended so little to the game as to require perpetual reminding when it was his turn to play. Indeed, despite all Barbara\u0027s exertions, they might have lost the game--for their opponents were wary and persevering--had it not been for the steady play of their coadjutors, Mr. Prescott and Miss Murray, who evinced a really remarkable talent for keeping close together, and nursing each other through all the difficult hoops. At length they won with flying colours, and were going to begin a new game, when Captain Lyster said, \"Mrs. Churchill, I should be so grateful for a few minutes\u0027 talk with you on a really important subject. Please, don\u0027t play again, but let us stroll.\" Barbara had all faith in Fred Lyster\u0027s truth and honour; she had known him for years, and more than half-suspected the secret of his early attachment to Alice; so that she had no hesitation in saying, \"Certainly, Captain Lyster, if you wish it;\" then adding with a smile, \"You will not miss us much, will you, Mr. Prescott?\" she and the Captain strolled away. Then, as they walked, Fred Lyster talked long and earnestly. He told Barbara that he addressed her as one who, he knew, took the deepest interest in Alice Schr?der\u0027s welfare; indeed, as one who had been as her sister in times past. He touched lightly on the disparity in age between Alice and her husband, and upon the difference in all their habits, tastes, and opinions; he said that she was thus doubtless driven to her own resources for amusement, and that her utter simplicity and childishness made her the easy prey of designing people. Then, with the utmost delicacy, he went on to point out that for some time Beresford\u0027s attentions to Mrs. Schr?der had been most marked; that his constant presence at their house, or in attendance on her when she went out, had attracted attention, and that at length it had become common club-gossip. Only on the previous night he had heard that it had been publicly discussed in the smoke-room of the Minerva; that an old gentleman, an old friend of the family, had announced his intention of speaking to Mr. Schr?der about it. What was to be done? He (Lyster), deeply pained at it all, had no authority, no influence, no right, to mix himself with the matter. Would not Mrs. Churchill, in pity for her friend, talk seriously with Mrs. Schr?der about it? She was all-potential. Mrs. Schr?der believed implicitly in her, and would undoubtedly follow her advice. Would not Mrs. Churchill do this, for pity\u0027s sake? Barbara was very much astonished and very much shocked. She had always known Alice to be weak and vain and silly; she knew that her marriage with Mr. Schr?der had been one made solely at her father\u0027s instigation; but having lived entirely out of the set for the last few months, she had no idea of the intimacy with Mr. Beresford, whose acquaintance she considered was by no means desirable. She was entirely at a loss what to do, being of opinion that her influence over Alice had all died out. However, if Captain Lyster thought otherwise, and if he counselled and urged her taking such a step, she would not refuse; she would take an early opportunity of seeking an interview with Alice, and giving that silly girl--silly, and nothing more, she was certain--a very serious talking to; \"and then, Captain Lyster, let us trust that this horrible gossip will be put a stop to.\" As Barbara said this, she smiled and put out her hand. Poor Fred bent over it, and when he raised his head to say, \"Mrs. Churchill, you will have done an angel\u0027s work!\" there were tears in his eyes. Meantime Frank Churchill, with doubt and distrust at his heart, engendered by having to leave Barbara in company with Captain Lyster, went away with Pringle to the lower croquet-ground, where they and others played a succession of games with varying success, in all of which Frank distinguished himself by ferocious swiping, and Mr. Pringle came to grief in an untimely manner. At length, when they were tired, Frank and Pringle walked away together--the former on the look-out for his wife, the latter listening with great deference to such scraps of his companion\u0027s conversation as he was treated with; for Mr. Pringle had a great reverence for \"people who write books,\" and, in common with a great many, looked upon the production of a something printable as an occult art. \"It always seems such a rum thing to me,\" said he ingenuously, \"how you first think about it, and then how you put it down! You write leaders, Mr. Churchill, eh? Oh yes, we heard of you at our office, the Tin-Tax, you know! That article in the Statesman about old Maddox and his K.C.B.\u0027ship, they all declared it was you.\" As Churchill only said \"Indeed!\" in an absent manner, and was still looking about him, Pringle proceeded: \"Oh, of course you won\u0027t let it out it was your work--we understand that! but it must be jolly to be able to give a fellow one for himself sometimes! a regular bad one, enough to make him drink! I should think that was better fun than novel-writing; though novel-writing must be easier, as you\u0027ve only got to describe what you see. I think I could do that--this afternoon, for instance, and all the swells and queer people about. The worst of it is, you must touch it up with a bit of love, and I\u0027m not much of a hand at that; but I suppose one could easily see plenty of it to study from. For instance, do you see those two at the end of this walk, under the tree? I suppose that\u0027s a spooning match, isn\u0027t it? How he is laying down the law! and she gives him her hand, and he bends over it--\" \"Damnation!\" exclaimed Churchill. \"Hollo!\" said Pringle, \"what\u0027s the matter?\" \"Nothing!\" said Churchill; \"I twisted my foot, that was all!\" Barbara tried several times that evening to meet Frank; but he avoided her; and it was not until they were in the fly, that she had an opportunity of speaking to him. \"Where on earth have you been, Frank, all day? I hunted and hunted for you, but never succeeded in finding you.\" He looked up at her: her eyes were sparkling, her cheek flushed; she was thoroughly happy. The escape from Mesopotamia and its dreariness, the return to scenes similar to those which she had been accustomed to, had worked immediate change. She looked so radiantly beautiful that Frank was half-tempted to spare her; but after a second\u0027s pause, he said, \"I walked all over the grounds. I was in the shrubbery close by you when Captain Lyster kissed your hand.\" \"What!\" exclaimed Barbara, with a start. \"It is beneath me to repel such a calumny; but to satisfy your absurd doubt, I tell you plainly you were wrong.\" \"Will you tell me,\" asked Frank, in a sad voice, \"that he did not walk with yop and talk with you apart? Can you deny it?\" \"No!\" returned Barbara. \"He did both walk and talk with me; he had something very special to say to me, and he said it.\" \"And it was--?\" \"I cannot tell you; it was told to me in confidence; it concerns the reputation of a third person, and I cannot mention it, even to you.\" \"Then, by the Lord, I\u0027ll have an end to this!\" said Frank, in a sudden access of passion. \"Listen here, Barbara; I\u0027ll have no captains, nor any one else, coming to repose confidences with which I\u0027m not to be made acquainted, in my wife! I\u0027ll have no shrubbery-walks and whisperings with you! Such things may be the fashion in the circles in which you have lived; but I don\u0027t hold with them!\" He could have bitten his tongue out the next instant, when Barbara said, in an icy voice, \"It may be the fashion in the circles in which you have lived to swear at one\u0027s wife, and shout at her so that the coachman hears you; but I don\u0027t hold with it, nor, what\u0027s more, will I permit it!\" She never spoke again till they reached home, when she stepped leisurely out of the carriage, ignoring Frank\u0027s proffered arm, and went silently to bed. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3026/83703.html","bookId":1068,"book":{"id":1068,"title":"Broken to Harness","description":"简介： The office of the Statesman daily journal was not popular with the neighbours, although its existence unquestionably caused a diminution of rent in its immediate proximity. It was very difficult to find--which was an immense advantage to those connec...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3026","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
