{"id":24321,"no":15,"title":"Chapter xiv. Mrs. Van Brandt at Home.","content":"As I lifted my hand to ring the house bell, the door was opened from within, and no less a person than Mr. Van Brandt himself stood before me. He had his hat on. We had evidently met just as he was going out. \\n\\n \\n\\n “My dear sir, how good this is of you! You present the best of all replies to my letter in presenting yourself. Mrs. Van Brandt is at home. Mrs. Van Brandt will be delighted. Pray walk in.” \\n\\n \\n\\n He threw open the door of a room on the ground-floor. His politeness was (if possible) even more offensive than his insolence. “Be seated, Mr. Germaine, I beg of you.” He turned to the open door, and called up the stairs, in a loud and confident voice: \\n\\n \\n\\n “Mary! come down directly.” \\n\\n \\n\\n “Mary”! I knew her Christian name at last, and knew it through Van Brandt. No words can tell how the name jarred on me, spoken by his lips. For the first time for years past my mind went back to Mary Dermody and Greenwater Broad. The next moment I heard the rustling of Mrs. Van Brandt’s dress on the stairs. As the sound caught my ear, the old times and the old faces vanished again from my thoughts as completely as if they had never existed. What had she in common with the frail, shy little child, her namesake, of other days? What similarity was perceivable in the sooty London lodging-house to remind me of the bailiff’s flower-scented cottage by the shores of the lake? \\n\\n \\n\\n Van Brandt took off his hat, and bowed to me with sickening servility. \\n\\n \\n\\n “I have a business appointment,” he said, “which it is impossible to put off. Pray excuse me. Mrs. Van Brandt will do the honors. Good morning.” \\n\\n \\n\\n The house door opened and closed again. The rustling of the dress came slowly nearer and nearer. She stood before me. \\n\\n \\n\\n “Mr. Germaine!” she exclaimed, starting back, as if the bare sight of me repelled her. “Is this honorable? Is this worthy of you? You allow me to be entrapped into receiving you, and you accept as your accomplice Mr. Van Brandt! Oh, sir, I have accustomed myself to look up to you as a high-minded man. How bitterly you have disappointed me!” \\n\\n \\n\\n Her reproaches passed by me unheeded. They only heightened her color; they only added a new rapture to the luxury of looking at her. \\n\\n \\n\\n “If you loved me as faithfully as I love you,” I said, “you would understand why I am here. No sacrifice is too great if it brings me into your presence again after two years of absence.” \\n\\n \\n\\n She suddenly approached me, and fixed her eyes in eager scrutiny on my face. \\n\\n \\n\\n “There must be some mistake,” she said. “You cannot possibly have received my letter, or you have not read it?” \\n\\n \\n\\n “I have received it, and I have read it.” \\n\\n \\n\\n “And Van Brandt’s letter — you have read that too?” \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n She sat down by the table, and, leaning her arms on it, covered her face with her hands. My answers seemed not only to have distressed, but to have perplexed her. “Are men all alike?” I heard her say. “I thought I might trust in his sense of what was due to himself and of what was compassionate toward me.” \\n\\n \\n\\n I closed the door and seated myself by her side. She removed her hands from her face when she felt me near her. She looked at me with a cold and steady surprise. \\n\\n \\n\\n “What are you going to do?” she asked. \\n\\n \\n\\n “I am going to try if I can recover my place in your estimation,” I said. “I am going to ask your pity for a man whose whole heart is yours, whose whole life is bound up in you.” \\n\\n \\n\\n She started to her feet, and looked round her incredulously, as if doubting whether she had rightly heard and rightly interpreted my last words. Before I could speak again, she suddenly faced me, and struck her open hand on the table with a passionate resolution which I now saw in her for the first time. \\n\\n \\n\\n “Stop!” she cried. “There must be an end to this. And an end there shall be. Do you know who that man is who has just left the house? Answer me, Mr. Germaine! I am speaking in earnest.” \\n\\n \\n\\n There was no choice but to answer her. She was indeed in earnest — vehemently in earnest. \\n\\n \\n\\n “His letter tells me,” I said, “that he is Mr. Van Brandt.” \\n\\n \\n\\n She sat down again, and turned her face away from me. \\n\\n \\n\\n “Do you know how he came to write to you?” she asked. “Do you know what made him invite you to this house?” \\n\\n \\n\\n I thought of the suspicion that had crossed my mind when I read Van Brandt’s letter. I made no reply. \\n\\n \\n\\n “You force me to tell you the truth,” she went on. “He asked me who you were, last night on our way home. I knew that you were rich, and that he wanted money. I told him I knew nothing of your position in the world. He was too cunning to believe me; he went out to the public-house and looked at a directory. He came back and said, ‘Mr. Germaine has a house in Berkeley Square and a country-seat in the Highlands. He is not a man for a poor devil like me to offend; I mean to make a friend of him, and I expect you to make a friend of him too.’ He sat down and wrote to you. I am living under that man’s protection, Mr. Germaine. His wife is not dead, as you may suppose; she is living, and I know her to be living. I wrote to you that I was beneath your notice, and you have obliged me to tell you why. Am I sufficiently degraded to bring you to your senses?” \\n\\n \\n\\n I drew closer to her. She tried to get up and leave me. I knew my power over her, and used it (as any man in my place would have used it) without scruple. I took her hand. \\n\\n \\n\\n “I don’t believe you have voluntarily degraded yourself,” I said. “You have been forced into your present position: there are circumstances which excuse you, and which you are purposely keeping back from me. Nothing will convince me that you are a base woman. Should I love you as I love you, if you were really unworthy of me?” \\n\\n \\n\\n She struggled to free her hand; I still held it. She tried to change the subject. “There is one thing you haven’t told me yet,” she said, with a faint, forced smile. “Have you seen the apparition of me again since I left you?” \\n\\n \\n\\n “No. Have you ever seen me again, as you saw me in your dream at the inn in Edinburgh?” \\n\\n \\n\\n “Never. Our visions of each other have left us. Can you tell why?” \\n\\n \\n\\n If we had continued to speak on this subject, we must surely have recognized each other. But the subject dropped. Instead of answering her question, I drew her nearer to me — I returned to the forbidden subject of my love. \\n\\n \\n\\n “Look at me,” I pleaded, “and tell me the truth. Can you see me, can you hear me, and do you feel no answering sympathy in your own heart? Do you really care nothing for me? Have you never once thought of me in all the time that has passed since we last met?” \\n\\n \\n\\n I spoke as I felt — fervently, passionately. She made a last effort to repel me, and yielded even as she made it. Her hand closed on mine, a low sigh fluttered on her lips. She answered with a sudden self-abandonment; she recklessly cast herself loose from the restraints which had held her up to this time. \\n\\n \\n\\n “I think of you perpetually,” she said. “I was thinking of you at the opera last night. My heart leaped in me when I heard your voice in the street.” \\n\\n \\n\\n “You love me!” I whispered. \\n\\n \\n\\n “Love you!” she repeated. “My whole heart goes out to you in spite of myself. Degraded as I am, unworthy as I am — knowing as I do that nothing can ever come of it — I love you! I love you!” \\n\\n \\n\\n She threw her arms round my neck, and held me to her with all her strength. The moment after, she dropped on her knees. “Oh, don’t tempt me!” she murmured. “Be merciful — and leave me.” \\n\\n \\n\\n I was beside myself. I spoke as recklessly to her as she had spoken to me. \\n\\n \\n\\n “Prove that you love me,” I said. “Let me rescue you from the degradation of living with that man. Leave him at once and forever. Leave him, and come with me to a future that is worthy of you — your future as my wife.” \\n\\n \\n\\n “Never!” she answered, crouching low at my feet. \\n\\n \\n\\n “Why not? What obstacle is there?” \\n\\n \\n\\n “I can’t tell you — I daren’t tell you.” \\n\\n \\n\\n “Will you write it?” \\n\\n \\n\\n “No, I can’t even write it — to you. Go, I implore you, before Van Brandt comes back. Go, if you love me and pity me.” \\n\\n \\n\\n She had roused my jealousy. I positively refused to leave her. \\n\\n \\n\\n “I insist on knowing what binds you to that man,” I said. “Let him come back! If you won’t answer my question, I will put it to him.” \\n\\n \\n\\n She looked at me wildly, with a cry of terror. She saw my resolution in my face. \\n\\n \\n\\n “Don’t frighten me,” she said. “Let me think.” \\n\\n \\n\\n She reflected for a moment. Her eyes brightened, as if some new way out of the difficulty had occurred to her. \\n\\n \\n\\n “Have you a mother living?” she asked. \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n “Do you think she would come and see me?” \\n\\n \\n\\n “I am sure she would if I asked her.” \\n\\n \\n\\n She considered with herself once more. “I will tell your mother what the obstacle is,” she said, thoughtfully. \\n\\n \\n\\n “When?” \\n\\n \\n\\n “To-morrow, at this time.” \\n\\n \\n\\n She raised herself on her knees; the tears suddenly filled her eyes. She drew me to her gently. “Kiss me,” she whispered. “You will never come here again. Kiss me for the last time.” \\n\\n \\n\\n My lips had barely touched hers, when she started to her feet and snatched up my hat from the chair on which I had placed it. \\n\\n \\n\\n “Take your hat,” she said. “He has come back.” \\n\\n \\n\\n My duller sense of hearing had discovered nothing. I rose and took my hat to quiet her. At the same moment the door of the room opened suddenly and softly. Mr. Van Brandt came in. I saw in his face that he had some vile motive of his own for trying to take us by surprise, and that the result of the experiment had disappointed him. \\n\\n \\n\\n “You are not going yet?” he said, speaking to me with his eye on Mrs. Van Brandt. “I have hurried over my business in the hope of prevailing on you to stay and take lunch with us. Put down your hat, Mr. Germaine. No ceremony!” \\n\\n \\n\\n “You are very good,” I answered. “My time is limited to-day. I must beg you and Mrs. Van Brandt to excuse me.” \\n\\n \\n\\n I took leave of her as I spoke. She turned deadly pale when she shook hands with me at parting. Had she any open brutality to dread from Van Brandt as soon as my back was turned? The bare suspicion of it made my blood boil. But I thought of her. In her interests, the wise thing and the merciful thing to do was to conciliate the fellow before I left the house. \\n\\n \\n\\n “I am sorry not to be able to accept your invitation,” I said, as we walked together to the door. “Perhaps you will give me another chance?” \\n\\n \\n\\n His eyes twinkled cunningly. “What do you say to a quiet little dinner here?” he asked. “A slice of mutton, you know, and a bottle of good wine. Only our three selves, and one old friend of mine to make up four. We will have a rubber of whist in the evening. Mary and you partners — eh? When shall it be? Shall we say the day after to-morrow?” \\n\\n \\n\\n She had followed us to the door, keeping behind Van Brandt while he was speaking to me. When he mentioned the “old friend” and the “rubber of whist,” her face expressed the strongest emotions of shame and disgust. The next moment (when she had heard him fix the date of the dinner for “the day after to-morrow”) her features became composed again, as if a sudden sense of relief had come to her. What did the change mean? “To-morrow” was the day she had appointed for seeing my mother. Did she really believe, when I had heard what passed at the interview, that I should never enter the house again, and never attempt to see her more? And was this the secret of her composure when she heard the date of the dinner appointed for “the day after to-morrow”? \\n\\n \\n\\n Asking myself these questions, I accepted my invitation, and left the house with a heavy heart. That farewell kiss, that sudden composure when the day of the dinner was fixed, weighed on my spirits. I would have given twelve years of my life to have annihilated the next twelve hours. \\n\\n \\n\\n In this frame of mind I reached home, and presented myself in my mother’s sitting-room. \\n\\n \\n\\n “You have gone out earlier than usual to-day,” she said. “Did the fine weather tempt you, my dear?” She paused, and looked at me more closely. “George!” she exclaimed, “what has happened to you? Where have you been?” \\n\\n \\n\\n I told her the truth as honestly as I have told it here. \\n\\n \\n\\n The color deepened in my mother’s face. She looked at me, and spoke to me with a severity which was rare indeed in my experience of her. \\n\\n \\n\\n “Must I remind you, for the first time in your life, of what is due to your mother?” she asked. “Is it possible that you expect me to visit a woman, who, by her own confession —” \\n\\n \\n\\n “I expect you to visit a woman who has only to say the word and to be your daughter-in-law,” I interposed. “Surely I am not asking what is unworthy of you, if I ask that?” \\n\\n \\n\\n My mother looked at me in blank dismay. \\n\\n \\n\\n “Do you mean, George, that you have offered her marriage?” \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n “And she has said No?” \\n\\n \\n\\n “She has said No, because there is some obstacle in her way. I have tried vainly to make her explain herself. She has promised to confide everything to you.” \\n\\n \\n\\n The serious nature of the emergency had its effect. My mother yielded. She handed me the little ivory tablets on which she was accustomed to record her engagements. “Write down the name and address,” she said resignedly. \\n\\n \\n\\n “I will go with you,” I answered, “and wait in the carriage at the door. I want to hear what has passed between you and Mrs. Van Brandt the instant you have left her.” \\n\\n \\n\\n “Is it as serious as that, George?” \\n\\n \\n\\n “Yes, mother, it is as serious as that.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1373/41167.html","bookId":1446,"book":{"id":1446,"title":"The Two Destinies","description":"简介： The Guest Writes and Tells the Story of the Dinner Party.MANY years have passed since my wife and I left the United States to pay our first visit to England....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1373","creation":"Aug 1, 2019 12:25:08 AM","modification":"Aug 1, 2019 12:25:08 AM"}}
