{"id":13276,"no":7,"title":"CHAPTER VI. HOW THEY CAME TO CARISBROOKE CASTLE.","content":"The cavalcade as it drew near Newport was formed into more precise array. It behoved the Captain of the Wight to enter the capital of his little kingdom in becoming state. \\n\\n \\n\\n The vanguard, under Tom o\u0027 Kingston, had been sent on earlier in the day, the bailiffs and burgesses of Newport had therefore received ample notice to prepare for the reception of their Lord and Captain. \\n\\n \\n\\n The military force of the island at this time was much improved. After the conclusion of the civil war, Edward IV. appointed Anthony Woodville, Lord Scales, the most accomplished knight as well as finished gentlemen of his time, to be lord and Captain of the Wight, in succession to his father, Richard, Lord Woodville, Earl Rivers. Under the martial rule of this skilled warrior, the defences of Carisbrooke Castle and the military force of the island seem to have been put on a sound footing, and the military tenures of the landlords who held their lands of the \"honour of Carisbrooke Castle\" were carefully inquired into, and their services duly enforced. The large powers possessed by the Warden of the Island, in the reign of Edward III., as evidenced in the commission granted to John de Gattesdon, show that a vigorous Captain had ample means at his disposal for mustering a formidable force, and that only the supineness, or corruption, or absenteeism of the lord of the island or his deputies could have allowed the inhabitants to have fallen into such a state of despair as two petitions, presented to the King and Parliament in 1449, show that they had yielded to. In short, if the Captain of the Wight was a keen soldier and able man, the forces of the island were smart and serviceable, and if he were not, they fell into indiscipline and inefficiency. \\n\\n \\n\\n Sir Edward Woodville, now Captain of the Island, was in all respects a \"righte hardie, puissant, and valyant knighte,\" and took pains that all under his command should be well-appointed and well-disciplined, and as his appointment vested in his person the supreme civil as well as military command, his influence and authority were wide reaching--in other words, he was a \"strong\" Captain. \\n\\n \\n\\n The chief officials in Newport were the bailiffs, for there was no mayor or court of aldermen for more than a hundred and seventeen years after this date, and they acted as deputies for the Captain of the Wight in all matters relating to the business of the borough of Newport. These officials now came out, arrayed in all the dignity of their office, accompanied by the chief burgesses of the town, and attended by Tom o\u0027 Kingston and the body of archers and men-at-arms he commanded. The populace, naturally eager to see all pageants, crowded out of their houses, and by the time the procession, issuing from the town over the bridge to the north, had reached the Priory of St Cross, it had attained to very considerable proportions. Several of the neighbouring gentry had ridden in and joined the concourse, with their servants and dependants. Chief among these was conspicuous a martial figure, attended by a very lovely girl, and followed by four stalwart yeoman, well mounted and appointed. When the cortège had reached the gate of the Priory of St Cross it halted, and in the meadows at the foot of Hunny Hill the concourse found room to see the reception of their Lord and Captain. \\n\\n \\n\\n Soon after the arrival of the bailiffs and their attendants, the gleam of spear points, bills, and halberds showed over the brow of the steep hill that descended abruptly to the little town. Soon afterwards the Lord Woodville himself appeared, attended by his household and guests, and followed by the main body of his mounted archers and men-at-arms. \\n\\n \\n\\n As Ralph looked down into the valley below he was struck by the gay prospect. The bright tabards and glancing weapons of the men-at-arms gave colour and life to the picture, mingling as they did with the soberer dresses of the townsfolk, with their wives and daughters. The high pointed head-dresses of some of the dames, and the horned caps of others, whence transparent draperies hung in the wind, much to the annoyance of their male relatives, who had either to take care not to become entangled in them, or else to run the risk of sharp reprimand or scornful look, added a quaint variety to the scene. The banner of Newport flaunted its blazon in the breeze, side by side with the arms of Woodville and the royal arms. Beyond were the red tiles of the old houses, the streets, neat and orderly, the tower of the Church of St Thomas, rising above the houses, and, behind all, the steep down of St George\u0027s to the left, and the range of downs stretching away to the right, with the vale of the Medina between, from which the mist of approaching evening was already beginning to rise, while from out the valley to the right the noble pile of Carisbrooke Castle rose clear and grand in all its feudal beauty, lately restored, and rendered wellnigh impregnable to the forces of medi?val warfare. How splendid it looked, its walls and battlements, turrets and bastions, lighted up by the westering sun, the dark shadow of the smooth slope of Buccomb down forming a background to the ruddy pile, and the donjon keep standing up grim and distinct amid the lesser towers and roofs, flinging defiance to the assaults of men and time alike in the flag on its summit. \\n\\n \\n\\n Such was the scene Ralph looked upon, but as they descended the steep hill his eyes became fixed on the throng of people awaiting them, and once more he felt a sense of shyness come over him. He was not yet used to being looked at. His fellow-pages, however, were quite unconcerned, and were passing remarks freely among themselves under their breath, as they recognised faces in the crowd. \\n\\n \\n\\n \"Marry! there\u0027s old Billy Gander. How red his nose is! Why didn\u0027t he get some of thy powder thou art so fond of, Bowerman?\" \\n\\n \\n\\n \"And look! there\u0027s Dicky Shide. By St Anthony! but he\u0027s got a worse squint than of old. Poor old Squint Eye!\" \\n\\n \\n\\n \"Willie, my swain, there\u0027s Polly Bremeskete. I wouldn\u0027t let her see thee, that I wouldn\u0027t. She told Tom o\u0027 Kingston she meant to marry thee, come next Peter\u0027s day. And she always keeps her word.\" \\n\\n \\n\\n \"By\u0027r lady, there\u0027s Yolande de Lisle; she looks more lovely than ever!\" And Eustace Bowerman drew himself up, and sat his horse with greater importance than before, while even Richard Cheke and Maurice Woodville looked conscious, and glanced at their dress, squared their toes, and sat more erect on their steeds, holding their horses tighter with their knees, and making them step in lighter action. \\n\\n \\n\\n Ralph glanced to where Bowerman had descried the object of all this homage, curious to see who it was that bore his name. He had heard that a great-uncle of his had returned to the island home of his ancestors in King Harry the Fourth\u0027s reign, but he had forgotten all about it, and had never given such remote genealogical questions a thought. However, now he heard the name mentioned, he recollected what he had been told, and what his father had said about the disinherited son, and the only daughter. \\n\\n \\n\\n He had not to search long for the young lady who created so much admiration among the pages. \\n\\n \\n\\n Sitting her palfrey with easy grace, and perfectly at home amid the noisy crowd and free manners of the rough troopers, was a girl or rather young woman of about eighteen or twenty, of very graceful, although somewhat robust, proportions, but remarkable for her brilliant complexion, lovely features, and sparkling blue eyes. Fun and health glowed in every line of her face, in her masses of wavy fair hair, which refused to be confined under the prim cap and horned head-dress in which the fashion of the time struggled hard to reduce them to order, in her soft cheeks, red lips, and graceful rounded figure. Ralph thought there never was anyone so lovely in the whole world. He forget everything. He gazed at her in rapt admiration, utterly oblivious of all that was going on. \\n\\n \\n\\n \"By my halidome, Master Page, whither goest thou?\" said the grating voice of Sir John Trenchard, against whom Ralph bumped with a sudden jerk, as the troop stopped for Lord Woodville to receive the homage of his subjects. \"Canst not see where thou goest, or keep a fitting distance from thy betters? Draw back to thy fellows, I say.\" \\n\\n \\n\\n Thus roughly aroused, Ralph, much abashed, reined up his horse, and backed it to a line with the other pages, who were grinning from ear to ear at his luckless mistake; but what made him more uncomfortable still, was that he saw the fair object of his admiration had witnessed it all, and was smiling meaningly at Eustace Bowerman. He began to envy that page in a way he would not have thought possible before. \\n\\n \\n\\n But Bowerman was all smiles and amiability now. He nodded familiarly to one person, haughtily to another, and most expressively to the lady on horseback. But she, after the first glance of recognition and amusement, looked no more his way, being occupied with gazing at the Captain of the Wight and the two French knights who were with him. \\n\\n \\n\\n Ralph, as soon as he had recovered from his mortification, tried to keep his eyes away from Mistress Lisle, and watched what was going on. \\n\\n \\n\\n After the bailiffs had done homage, and congratulated Lord Woodville on the success of his expedition, the burgesses came forward and performed their part of the ceremony, being greeted kindly by the Captain, who was evidently very popular. Ralph noticed that the old knight who sat his horse so firmly, and held up his head so proudly, was greeted with especial respect by Lord Woodville, who also exchanged very courteous salutations with the lovely lady of the golden hair, to whom he presented the two French knights, who, with their proverbial gallantry, seemed to be paying her compliments which, as they could not be too flattering, seemed not unwillingly received. \\n\\n \\n\\n The ceremonies over, the cavalcade reformed. The bailiffs and the burgesses heading the procession, they then defiled over the bridge, and passed into the town. \\n\\n \\n\\n Ralph had now recovered himself sufficiently to ask who that old knight was who looked so striking, and to whom Lord Woodville had paid so much attention. \\n\\n \\n\\n \"Ay, certes, you may well ask,\" said Maurice Woodville, \"for he is, or ought to be, a kinsman of thine own, seeing he beareth the same name as thyself, and, for aught I know, the same coat armour.\" \\n\\n \\n\\n \"Nay, for the fair lady weareth on her mantle a coat argent with a chief gules charged with three lions rampant of the field, whereas my father beareth or a fess between two chevrons sable.\" \\n\\n \\n\\n \"Well, you must e\u0027en settle that as best pleaseth you; all I know is that he is called Sir William de Lisle of the Wood, or, as our chaplain would have it, \u0027Dominus de Insula de Bosco,\u0027 which, to my thinking, isn\u0027t half as pretty as the English.\" \\n\\n \\n\\n \"And is that his daughter?\" asked Ralph shyly, thinking of his father\u0027s words with keener interest. \\n\\n \\n\\n \"Ay, marry is she, and the loveliest demoiselle in all the Wight, and the world to boot, say I!\" answered Maurice, with enthusiasm. \\n\\n \\n\\n At the corner of St James Street, where it intersected the High Street, there was a halt. Here the Abbot of Quarr took leave of Lord Woodville, for his road lay down High Street, and so to his monastery. Sir William Lisle and his daughter, much to her regret, also took leave; but Lord Woodville, before parting with the Abbot and the old knight, called to Ralph to come up; who, with some embarrassment, rode forward, and was by Lord Woodville presented to Sir William Lisle and the fair Yolande. \\n\\n \\n\\n \"Sir William, I have a kinsman of yours I would fain make you acquainted with. This fair youth hath already begun right manfully, and I dare vouch will prove a full knightly twig of thy own worshipful stock.\" \\n\\n \\n\\n Sir William de Lisle looked at Ralph, as he thought somewhat sternly, but his words were kind. \\n\\n \\n\\n \"Fair young sir, I am right pleased to hear thee so well reported of. \u0027Twill give our daughter and me joy to see thee at our poor home of Briddlesford, whenever thy noble Captain can spare thee. Thou wilt find good sport for thy hawk in the woods and creek of Wodyton, and along the banks of King\u0027s Quay; only beware how thou fliest him over the lands of the Abbot of Quarr, for he is a strict preserver of his own demesne.\" \\n\\n \\n\\n As Sir William said this, he glanced at the Lord Abbot, and a merry twinkle was in his eye, for many had been the discussions over the rights of the respective demesnes, for the lands of the Lisles bordered on those of Quarr Abbey, and hot had been the complaints of Sir William that idle monks had been caught setting traps in his lands, which had led to counter charges on the part of the monks. \\n\\n \\n\\n \"And forget not, fair cousin, if thou shouldest be tempted our way, to bring over some of thy fellow pages with thee; for without them thou wilt be parlous dull, seeing there is naught at home to amuse thee saving my poor self; and one poor girl is but sorry sport for a merry page,\" said Yolande, with a demure smile, as she turned her palfrey to accompany her father. \\n\\n \\n\\n Ralph longed to say something that would become him, but he felt very shy amid all that concourse of people, with his comrades watching, and the French knights and Lord Woodville all looking at him; he could only stammer out his thanks, and bow low over his saddle. \\n\\n \\n\\n \"Fare-thee-well, kinsman mine,\" said the Abbot; \"give diligent heed to thy instructors, reverence those in authority over thee, and attend carefully to the ministrations of worthy Sir Simon Halberd, who will give me frequent account of thee when he cometh to Quarr.\" \\n\\n \\n\\n \"Grammercy, my Lord Abbot, I owe thee many thanks for thy great kindness in giving me to so noble a lord,\" said Ralph, who, now that the bright eyes of his fair kinswoman were not gazing at him with the amused look which so disconcerted him, felt his presence of mind returning, and was able to answer with his customary boldness. \\n\\n \\n\\n And so the cavalcades parted, Mistress Yolande giving a farewell glance of Parthian destructiveness at the French knights, but deigning no more to notice such simple things as innocent pages. \\n\\n \\n\\n \"By St Nicholas, Bowerman, you are always to be luckless now!\" laughed Maurice. \"But yestere\u0027en you helped Lisle to the best bit of good fortune he\u0027s likely to have for some time; and now he\u0027s called up before all of us to be presented to our fair princess of the golden hair. Didst see how kindly she smiled on him?\" he added mischievously. \\n\\n \\n\\n \"Body o\u0027 me! an\u0027 you hold not your jabbering tongue, I\u0027ll flay you when we get to the castle!\" said Bowerman savagely. \\n\\n \\n\\n \"Nay, fair youth, be not wroth; \u0027tis not I who got Lisle all this good luck. Virtue is its own reward. Be happy! sweet damoiseau, and rejoice in thy good nature. \u0027Tis true, \u0027tis not often you do a fellow a good turn; so be happy when you do.\" \\n\\n \\n\\n \"All right, my young cockerel, tarry but the nonce. My time will come anon,\" said Eustace, in furious dudgeon. \\n\\n \\n\\n Ralph had fallen back as the procession moved on. All the pages were well known in Newport, and the doings of the little court at the castle were intimately discussed. The characters of each of the principal members of the garrison were well known, and any new arrival was critically examined and freely talked about. \\n\\n THE CAPTAIN OF THE WIGHT ENTERING CARISBROOKE CASTLE. \\n\\n THE CAPTAIN OF THE WIGHT ENTERING CARISBROOKE CASTLE. \\n\\n \\n\\n The worthy burgesses\u0027 wives and their fair daughters much regretted that the Captain of the Island was not married. The lady of Sir John Trenchard presided over the domestic part of the castle, and did the honours when ladies paid it a visit. But she was not of an amiable disposition, and it was popularly reported that her worthy lord\u0027s little asperities of temper, and sourness of look, arose in great measure from the austere frigidity of this eminently respectable matron, who, however, as Ralph subsequently found, was at heart a very kind and sweet lady. The reasons for Lord Woodville being still a bachelor were variously stated, and all hotly asserted by their different supporters, who one and all had their information on undoubted private authority, which they were not at liberty to divulge. The only fact that really was known, however, was the simple one that there was no Lady Woodville. The head of the column was now mounting the steep ascent to the castle, and Ralph noticed the splendid position of this noble fortress. The sun was getting low on the western horizon; the level rays bathed all the long valley away to the west in a rich golden haze, falling full on the grandly-proportioned towers of the main guard. The massive walls, pierced for archery, and crowned with their projecting machicolations and graceful parapets, were not yet clothed with the growth of yellow and grey lichen which has been slowly painting them for the last four hundred years. The stone was yet fresh from the hand of the mason, and above the great gate, high up on the parapet, could be seen the arms of Lord Scales. \\n\\n \\n\\n \"My grandfather had that done!\" said Maurice proudly, pointing up to the noble gateway as they tramped over the drawbridge, and passed out of the warmth of the sunlight under the heavy portcullis, and between the massive iron-studded oak doors, which were swung back to allow the Captain of the Wight and his \"meynie\" to enter, and then slowly and harshly swung back as the last man-at-arms clanked over the drawbridge, shutting out the sunlight and the outside world. \\n\\n \\n\\n The guard under the archway presented arms, the trumpets sounded a flourish, and out into the sunlight, whose rays just passed between the towers, and touched his plume, rode the lord of the castle, and of all those stalwart men. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1700/50052.html","bookId":1153,"book":{"id":1153,"title":"The Captain of the Wight","description":"简介： Among the many aspects in which it is possible to regard this important epoch, that of its influence on chivalry is one of the most interesting. The rough simplicity of the proud medi?val knight, gradually yielding to the subtle spell of pure poesy a...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1700","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
