{"id":90550,"no":8,"title":"Page 8","content":"“Oh, that’s right! I totally forgot we ran into her.” Lies, lies, lies. Come on, ask me about Griffin. Ask me about kissing him so I can rub it in your stupid face. “She said you guys had a good time together.” What the fuck? The only good time had by the two of us would be in a boxing ring. “I’m really glad you can be the bigger person, Kennedy. I don’t know if I would be able to do the same thing if I were in your shoes,” he tells me. You ARE in my shoes, you asshole! I kissed Griffin! Just admit that you know and that you hate it! “DADDY!” Livia comes running into the living room and throws herself in his arms. “Hi, princess! I’ve missed you so much,” he tells her as she wraps her legs around him and he holds her in his arms. “Are you taking us to the mall? Can we go to Claire’s so I can buy some new earrings and bracelets and then go to the pet shop so I can cuddle the puppies?” she asks sweetly. Alex and I both stare at her in confusion for a few minutes before she laughs at both of us. “Just kidding! I want to go to the sporting goods store and check out the new crossbows they just got in,” she informs him as he leans over and sets her down on her feet. “Okay, I’m ready to go,” Meadow states as she joins us in the living room. She’s removed all of her winter wear and put my Seven jeans back on, but at least she’s now wearing a shirt that actually covers her body. And decided to add a thick protective layer of makeup. “Uh, is she allowed to wear makeup?” Alex asks me. “Good luck with that,” I tell him as I lean over and kiss each of the girls good-bye. I’ve had to parent them on my own for months now. It’s his turn. As soon as they are out the door, I grab my pot of Buffalo Wing Dip and take it out to my car, securing it in the backseat before pulling out and heading to my father’s house. When I reach his cul-de-sac, my annoyance over the fact that Alex never once mentioned what happened between Griffin and me last night disappears. The street has been blocked off and is filled with my father’s neighbors, all wearing the signature blue-and-gold colors of Notre Dame. I’m pretty sure when they bought this house when my mom was pregnant with Ted, they made it a requirement of the Realtor to find them a house in Notre Dame territory. In the street there are picnic tables, cafeteria tables, and chairs, and enough food to feed an army. Or a herd of football fans. As I slowly pull into my father’s driveway, I see that he and my brothers have brought out his big-screen television and set it in the front yard with an extension cord. Today is going to be a good day. Grabbing the Crock-Pot from the backseat, I make my way down the driveway and over to one of the tables where I see my father, Aunt Janet, and Uncle Wally. “Is that Buffalo Wing Dip? It better be Buffalo Wing Dip,” Dad tells me as he eyes the Crock-Pot in the crook of my arm. I haven’t spoken to my dad since I found out Griffin is the guy he hired, and refusing him his favorite football game snack is a good way to tell him I’m pissed at him about it. I set the Crock-Pot down at the far end of the table, out of his reach. “Did you put in an extra cup of cheddar cheese?” he asks, staring at the Crock-Pot instead of me. “I put in two extra cups of cheddar cheese. But you’re not getting any of it,” I threaten. “Awwwww, come on, Kennedy. I’m an old man. Don’t deny me my Buffalo Wing Dip,” he complains, licking his lips as he watches Uncle Wally lift the lid and take a big whiff. “Put that lid back on, Uncle Wally,” I scold, not taking my eyes off my father. “What did I do?” Uncle Wally whines. “Both of you know damn well what you did. Anyone care to tell me why they felt the need to hire Griffin to help me on your bail-jumping case?” I ask, crossing my arms in front of me and tapping my foot. Aunt Janet pipes up. “Griffin? I haven’t talked to him in a few weeks. How is he?” “You’re not helping,” I tell her through clenched teeth. “Oh, what’s the big deal? I needed extra help and Griffin needed work,” my dad says with a shrug as he slides down the bench seat and reaches for the Crock-Pot lid. “The big deal?” I argue, smacking his hand away as he gives me a dirty look. “The big deal is that I can’t work with him. He’s cocky and manipulative and annoying.” “You’re forgetting handsome, persistent, and a great kisser.” I jump in surprise and a squeak flies out of my mouth when I hear Griffin’s voice behind me. “Kennedy, you kissed Griffin?” Aunt Janet asks excitedly. “Technically, I kissed her. But she was an equal participant,” Griffin replies. I hear my aunt mutter, “It’s about time,” under her breath and I turn around to give him a scathing look for airing this dirty laundry in front of my family. As soon as I look at him though, I’m reminded of that stupid kiss and dammit if I don’t want to haul him off behind the bushes and do it again. “So are you guys dating now?” my father asks with a smile as he quickly shovels in a few mouthfuls of dip. Turning away from Griffin’s smiling face, I take a page out of Meadow’s handbook and stomp angrily over to the end of the table. I slam the lid back down on the Crock-Pot, narrowly missing my father’s fingers. “Heeeeeeey!” he complains as I snatch the Crock-Pot up from the table and shove it under my arm. “NO DIP FOR YOU!” I whirl around and storm toward the house. “If you guys are dating now, you can just split the finder’s fee on McFadden, right?” Uncle Wally shouts to me. I hear Griffin’s chuckle as I throw open the door to my father’s house and go inside. GD family. CHAPTER 11 I pace angrily back and forth in my father’s kitchen, muttering to myself. “Stupid man and his stupid infuriating grin. Stupid family. Stupid me for thinking about that damn kiss…” “Can we talk, or do you need a minute?” Griffin asks as I turn and see him lounging against the doorway with a smile on his face. “Why are you here?” He pushes off the wall and walks over to me in the middle of the kitchen. Reaching up with one hand, he brushes a strand of hair out of my eyes with his fingertips and I have to fight the urge not to shiver when his fingers graze the skin of my forehead. I notice something out of the corner of my eye though and I grab his hand and hold it in front of my face. “Why are your knuckles bruised?” I demand as I stare at the red, swollen area and lightly run my thumb over it. He shrugs and pulls his hand out of my grasp. “Oh, you know. Ran into a door or something. I don’t remember.” It occurs to me that Alex gave me the same answer when I asked him what happened to his face. “Griffin, what did you do?” I demand. “Don’t worry about it,” he answers quickly. Oh my God. He punched Alex in the face. Why did he punch Alex in the face now? I told him the other night about Alex being a deadbeat dad and then this morning, Alex suddenly shows up at my house with a shiner, wanting to spend time with the girls. Did he seriously go to Alex’s apartment and beat him up for me? For the girls? This should piss me off. Alex should want to spend time with his own daughters without needing his face rearranged to do it. It doesn’t piss me off though; it melts my frozen heart. “Griffin,” I whisper softly, looking up into his face. “Did he pick the girls up?” he asks. I nod in response, unable to speak. “Good.” He brings his hand up and cups my cheek in his palm, rubbing his thumb slowly back and forth against the side of my face, staring at my mouth. I feel my insides melting into a puddle of goo and I want him to kiss me so badly I feel like I’m going to scream if he doesn’t do it already. As he eases his head down to me, I start to close my eyes in anticipation of his lips against mine. Then, my stupid brain has to interfere and I remember what happened last night. It was all fun and games until the kiss was over. Putting both of my hands flat against his chest, I shove him away angrily and take a few steps back. “No. No, no, no. You don’t get to kiss me again. Not after that crap last night,” I tell him angrily. “Crap? I thought that kiss was pretty amazing. Crap? Really?” he asks again in shock. How can a man this good-looking be so dense? “I thought you needed rescuing,” I say in a mocking voice, just like his the previous night. “I don’t need you, or anyone to rescue me. And I definitely don’t need you or any man to kiss me because he feels sorry for me.” I watch as the lightbulb finally clicks on and the humor in his eyes gets replaced by something fierce as he stalks toward me. I quickly move backward until I bump up against the counter and have nowhere else to go. Griffin puts his arms on either side of me on the counter, caging me in. “Let’s get something straight here,” he tells me with a firm voice. “I have never felt sorry for you. When I kiss you, it’s because I want to, not because I have to. I saw the look on your face last night. You felt like shit next to that girl. You’re too much of a stubborn hard-ass to feel like less than you are around anyone. Especially someone like her.” His eyes bore into mine and butterflies flap manically around in my stomach. Why is it so hard to stay mad at this man? Without giving it a second thought, I grab the front of his shirt with both of my fists and haul him toward me, crashing my lips against his. Right now, I don’t care how bad of an idea this is. No one has ever said anything like that to me before and meant it. Griffin immediately pushes his tongue past my lips and I moan into his mouth when I taste him again. He grabs onto my hips and effortlessly lifts me up onto the counter. My legs immediately wrap around his waist and my hands fist in his hair as he swirls his tongue through my mouth and pushes his hips between my legs. I can feel his erection again, just like last night, but this time, the hardness of him is right where I want it, pushing against the ache that formed as soon as he spoke those words to me. His hands slide around to my ass and he pulls me closer to the edge of the counter. I instinctively thrust my hips against him and it’s his turn to groan. It’s been far too long since I’ve felt this needy. Every inch of my body is on fire and I can’t stop pushing my body against him. Jesus, he feels so good between my legs, sliding himself against me. I’m ashamed to admit that if he keeps this up, I’m probably going to have the fastest orgasm known to man. Or woman. His lips leave mine and he makes a trail of kisses across my cheek and to the side of my neck as he grips my ass and moves me against him. The tip of his tongue traces the edge of my earlobe before he tugs on it gently with his teeth. “Fuck, you taste good. I’ve wanted you like this for eighteen years,” he murmurs, pressing a kiss to my neck. Whoa. The fuck? My hands, which are still locked in a death grip in his hair, tighten hard enough to pull some strands out as I yank his head away from my neck and stare angrily in his eyes. “What did you just say?” He tries to move back toward my lips, but I stop him, pulling on his hair even harder until he yelps. “Ouch! Easy on the hair!” “Tell me you did not just say what I think you said!” Griffin sighs and bows his head. Holy shit. He’s serious. How did I not know this? And why the hell am I just finding out about this NOW? I thought the whole “go on a date with me” thing was just to bait me. Why the hell am I suddenly regretting all of the years I wasted with Alex when I could have had Griffin? SHIT! NO! He’s a friend. A friend who can kiss like a god and almost make me come on my father’s kitchen counter. We need to talk about this. This is serious business. I’m not ready for serious business. Why am I even questioning myself? “So I guess this means you ARE dating?” my father asks from the kitchen doorway. “GAAAAAAAAH!” I scream in frustration as I push Griffin away and jump down off the counter. “Yes,” Griffin replies calmly. “We most certainly are NOT dating!” I yell at Griffin. “Just a matter of time until I catch McFadden,” he tells me with a grin. “I’m going to wipe that smile off your face when I catch him and punch you square in the mouth!” I shout back. “I don’t know what’s going on here, and I don’t care. I just came in to get the dip,” my father replies with a longing look toward the Crock-Pot resting on the counter right next to where I had been close to orgasm. Griffin wanted me for eighteen years and never said a word about it until now. SHIT! “Am I interrupting something?” Paige asks as she enters the kitchen and sees all of us standing here. “NO!” “Yes,” Griffin and I state again at the same time, causing me to growl in frustration. “I think they’re dating. I just want my dip. Tell her to give me my dip, Paige,” my dad whines. “Did you lose the bet?” Paige asks me in confusion. “What bet?” Dad asks. “Griffin bet Kennedy that if he finds McFadden first, she has to go on a date with him,” Paige informs him. “I’ve got ten on Griffin,” Dad tells her, reaching for his wallet. “DAD!” Griffin laughs as he leans against the counter and folds his arms in front of him. “I’ll take that bet, and raise you twenty,” Paige replies.","sourceLink":"https://allnovel.net/shame-on-you-fool-me-once-1/page-8.html","bookId":2801,"book":{"id":2801,"title":"Shame on You (Fool Me Once #1)","description":"Storyline: Shame on You (Fool Me Once #1) War veteran Kennedy O’Brien is in the business of sticking it to the man—or at least any man who tries to cross a woman. After she returned home from Afghanistan and caught her husband in bed with the nanny, Kennedy lost her faith in men and started Fool Me Once Investigations with her two best friends. After all, there’s no better bounty hunter than a woman scorned. When Kennedy takes a case to slap cuffs on a bail jumper turned dog-napper, she figures it’ll be an easy paycheck. But trouble has a way of finding Kennedy. Enter the last man on the planet she’d willingly choose as a partner: her cheating ex-husband’s best friend, Griffin Crawford. As gorgeous as he is unwelcome, Griffin has always had a thing for Kennedy, and after keeping quiet about her ex’s cheating, he’ll do anything to earn back her trust. Whether or not she wants to admit it, Kennedy will need help as the case of the Chihuahua thief spirals out of control. Griffin may be just her man—in more ways than one.","cover":"https://allnovel.net/images/shame-on-you-fool-me-once-1.jpg","author":"Tara Sivec","type":"Humorous","source":"allnovel","link":"https://allnovel.net/shame-on-you-fool-me-once-1.html","creation":"Oct 5, 2019 9:01:30 AM","modification":"Oct 5, 2019 5:43:07 PM"}}
