{"id":30016,"no":12,"title":"12 THE PERPETUITIES","content":"BOND sat high up in the grandstand and through hired glasses watched Shy Smile\u0027s owner eating soft-shell crabs. The gangster was sitting in the restaurant enclosure four rows below Bond. Opposite him sat Rosy Budd forking down frankfurters and sauerkraut and drinking beer out of a stein. Although most of the other luncheon tables were occupied, there were two waiters hovering round this one and the maitre d\u0027hotel made frequent visits to see that all was going well. Pissaro looked like a gangster in a horror comic. He had a round bladder-like head in the middle of which the features were crowded together-two pin-point eyes, two black nostrils, a pursed wet pink mouth above the hint of a chin, and a fat body in a brown suit and a white shirt with a long-pointed collar and a figured chocolate bow tie. He paid no attention to the preparations for the first race but concentrated on his food, occasionally glancing across at his companion\u0027s plate as if he might reach across and fork something off it for himself. Rosy Budd was broad and hard-looking, with a square immobile poker player\u0027s face in which pale eyes were buried deep under thin fair eyebrows. He was wearing a striped seersucker suit and a dark blue tie. He ate slowly and rarely looked up from his plate. When he had finished, he picked up a race programme and studied it, turning over the pages carefully. Without looking up, he gave a curt shake of the head when the maitre d\u0027hotel offered him the menu. Pissaro picked his teeth until a mound of ice cream arrived, and then he bent his head again and started spooning the ice cream rapidly up into his small mouth. Through his glasses, Bond examined the two men and wondered about them. What did these people amount to? Bond remembered cold, dedicated, chess-playing Russians; brilliant, neurotic Germans; silent, deadly, anonymous men from Cen tral Europe; the people in his own Service-the double-firsts, the gay soldiers of fortune, the men who counted life well lost for a thousand a\u0027 year. Compared with such men, Bond decided, these people were just teenage pillow-fantasies. The results went, up for the third race, and now there was only half an hour to go before The Perpetuities. Bond put down his glasses and picked up his programme, waiting for the big board on the other side of the track to start flickering as the money went on the tote and the odds began to move. He took a final look at the details. \u0027Second Day. August 4,\u0027 said the programme. \u0027The Perpetuities Stakes. $25,000 added. 52nd Running. For Three-Year-Olds. By subscription of $50 each, to accompany the nomination. Starters to pay $250 additional. With the $25,000 added of which $5000 to second, $2500 to third and $1250 to fourth. A trophy to be presented to the owner of the winner. One Mile and a Quarter.\u0027 And then the list of twelve horses with owners, trainers and jockeys and the Morning Line forecast of the odds. The joint favourites, Noi, Mr C. V. Whitney\u0027s Come Again, and No3, Mr William Woodward\u0027s Pray Action, were both forecast at six to four on. Mr P. Pissaro\u0027s Shy Smile, trainer R. Budd, jockey T. Bell, was forecast at 15 to i, the bottom horse in the betting. His number was 10. Bond turned his glasses on the restaurant enclosure. The two men had gone. Bond\u0027s eyes followed on across the track to where the lights were flashing on the big board. The favourite was now No3, at 2 to i on. Come Again had gone out to evens. Shy Smile was quoted at 20 to i, but he went down to :8s as Bond watched the board. Another quarter of an hour to go. Bond sat back and lit a cigarette, go:ng over again in his mind what Leiter had told him, wondering if it was going to work. Leiter had tracked the jockey down to his rooming house and had flashed his private detective\u0027s licence at him. And then he had quite calmly blackmailed him into throwing the race. If Shy Smile won, Leiter would go to the Stewards, expose the ringer, and Tingaling Bell would never ride again. But there was one chance for the jockey to save himself. If he took it, Leiter promised to say nothing about the ringer. Shy Smile must win the race but be disqualified. This could be achieved if, in the final sprint, the jockey interfered with the running of the horse closest to him so that it could be shown that he had prevented this other horse from being the winner. Then there would be an objection, which had to be upheld. It would be easy for Bell, at the last corner before the run in, to do this in such a way that he could argue to his employers that it had just been a bit of over-keen riding, that another horse had crowded him over to the left, that his horse had stumbled. There was no conceivable reason why he should not wish to win (Pissaro had promised him an extra $1000 if he did) and it was just one of those strokes of bad luck that happen in racing. And Leiter would now give Tingaling $1000 and there would be another $200o\"for him if he did what he was told. And Bell had bought it. Without any hesitation. And he had asked for the $2000 to be passed to him after the day\u0027s racing in the Acme Mud and Sulphur Baths where he went every evening to take a mud bath to keep his weight down. Six o\u0027clock. And Leiter had promised that this would be done. And Bond now had the $2000 in his pocket and he had reluctantly agreed to help Leiter out by going to the Acme Baths to make the pay-off if Shy Smile failed to win the race. Would it work? Bond picked up his glasses and swept them round the course. He noted the four thick posts at the quarter miles that held the automatic cameras that recorded the whole race and whose film was available to the Stewards within minutes of each finish. It was this last one near the winning post whose eye would see and record all that happened at the final bend. Bond felt a tingle of excitement. Five minutes to go and the starting-gate was being pulled into position a hundred yards up to his left. Once round the course, plus an extra furlong, and the winning post was just below him. He put his glasses on the big board. No change in the favourites or in Shy Smile\u0027s price. And now here came the horses, cantering easily down to the start. First came Noi, Come Again, the second favourite. A big black horse carrying the light blue and brown colours of the Whitney Stable. And there was a cheer for the favourite, Pray Action, a fast-looking grey carrying the Woodward white with red spots of the famous Belair Stud, and, at the tail of the field, there was the big chestnut with the blaze face and four white stockings, and the pale-faced jockey wearing a jacket of lavender silk with a big black diamond on chest and back. The horse moved so well that Bond glanced across at the board and was not surprised to see his price come quickly back to 173, then i6s. Bond went on watching the board. In a minute the big money would go on (all except the remains of Bond\u0027s $1000 which would stay in his pocket) and the price would come down with a run. The loudspeaker was announcing the race. Away to the left the horses were being marshalled behind the starting-gate. Ping, ping, ping, the lights opposite Noio on the board started to wink and flash-15, 14, 12, u, and finally 9 to i. Then the lights stopped talking and the tote was closed. And how many more thousands had gone away by Western union to harmless telegraphic addresses in Detroit, Chicago, New York, Miami, San Francisco and a dozen more off-the-course books throughout the States? A handbell clanged sharply. There was an electric smell in the air, and a muting of the noise of the crowds. Then down thundered the ragged charging line towards the grandstand and past and away in a scud of hooves and flying eardi and tanbark. There was a glimpse of sharp, pale faces half-hidden by goggles, a stream of pounding shoulders and hindquarters, a flash of wild white eyes and a confusion of numbers amongst which Bond caught only the vital Noio well to the fore and close in to the rails. And then the dust was settling and the brown-black mass was at the first corner and slowly streaming round the bottom straight and Bond felt the glasses slip in the sweat round his eyes. No5, a black outsider, was leading by a length. Was this some unknown horse that was going to steal the show? But then there was No1 level with him and then No3. And No10 half a length behind the leaders. Just these four out in front and the rest bunched three lengths away. Round the corner and now No1 was in the lead. The Whitney black. And No10 was fourth. Down the long straight opposite and No3 was moving up-with Tingaling Bell on the chestnut at his heels. They both passed No5 and were well up with No1 who was still leading by half a length. And then the first top bend and the top straight, and No3 was leading with Shy Smile second and No1 a length behind. And Shy Smile was coming up level with the leader. He was level, and they were coming into the final corner. Bond held his breath. Now! Now! He could almost hear the whirr of the concealed camera in the big white post. No10 was ahead, right on the bend, but No3 was inside on the rails. And the crowd was howling for the favourite. Now Bell was inching towards the grey, his head well down on his horse\u0027s neck on the outside, so that he could pretend that he couldn\u0027t see the grey horse on the rails. Inch by inch the horses drew closer and, suddenly, Shy Smile\u0027s head hid No3\u0027s head, then his quarters were in front and, yes, Pray Action\u0027s boy suddenly stood right up in his stirrups, forced to take-up by the foul, and at once Shy Smile was a length ahead. There was an angry roar from the crowd. Bond lowered his glasses and sat back and watched as the foam-flecked chestnut thundered past the post below him with Pray Action five lengths behind and Come Again just failing to beat him into second place. Not bad, thought Bond, as the crowd howled around him. Not bad at all. And how brilliantly the jockey had done it! His head so well down that even Pissaro would have to admit Bell couldn\u0027t see the other horse. The natural curve-in for the final straight. The head still well down as he passed the post and the whip flailing for the last few lengths as if Tingaling still thought himself only half a length ahead of No3. Bond watched for the results to be posted. There was a chorus of whistles and cat-calls. \u0027No10, Shy Smile, five lengths. No3, Pray Action, 1/2 length. No1, Come Again, three lengths. No7, Pirandello, three lengths.\u0027 And the horses came cantering back for the weighing-in, and the crowd yelled for blood as Tingaling Bell, grinning all over his face, threw his whip to the valet and slipped off the sweating chestnut and carried his saddle to the scales. And then there was a great burst of cheering. Opposite the name of Shy Smile the word OBJECTION, white on black, had been slipped in, and the loudspeaker was saying: \"Attention please. In this race there has been an objection lodged by Jockey T. Lucky on No3, Pray Action, against the riding of Jockey T. Bell on No10, Shy Smile. Do not destroy your tickets. I repeat, Do not destroy your tickets.\" Bond took out his handkerchief and wiped his hands. He could imagine the scene in the projection room behind the judges\u0027 box. Now they would be examining the film. Bell would be standing there looking hurt, and, beside him, No1\u0027s jockey looking still more hurt. Would the owners be there? Would the sweat be running down Pissaro\u0027s fat jowls into his collar? Would some of the other owners be there, pale and angry? And then came the loudspeaker again and the voice saying: \"Attention please. In this race, No10, Shy Smile, has been disqualified and No3, Pray Action, has been declared the winner. The result is now official.\" Amidst the thunder of the crowd, Bond got stiffly up from his seat and walked off in the direction of the bar. And now for the payoff. Perhaps a Bourbon and branch-water would give him some ideas about getting the money to Tingaling Bell. He was uneasy about it. And yet the Acme Baths sounded an easy enough place. Nobody knew him in Saratoga. But after that he would have to stop working for Pinkertons. Call up Shady Tree and complain about not getting his five thousand. Worry him about his own payoff. It had been fun helping Leiter push these people around. Next would come Bond\u0027s turn, He pushed his way into the crowded bar.","sourceLink":"http://novel.tingroom.com/jingdian/1553/46066.html","bookId":1284,"book":{"id":1284,"title":"007之金刚钻 Diamonds Are Forever","description":"简介： 在生产钻石的南非，最近怪事连连，一大批为经切割的钻石失踪了，而且谋杀案频发。这些异常现象引起了英国当局的高度重视，于是007（肖恩?康纳利 Sean Connery 饰）来到了南非。007以钻石批发商的名义展开了一系列的调查，发现一切原来都是他的死对头魔鬼党的首领艾纳斯...","cover":"http://novel.tingroom.com/file/upload/201605/09/14-06-48-15-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1553","creation":"Aug 1, 2019 12:24:47 AM","modification":"Aug 1, 2019 12:24:47 AM"}}
