{"id":30021,"no":17,"title":"17 THANKS FOR THE RIDE","content":"THE scene in the big gambling room had changed. It was much quieter. The orchestra had gone, and so had the droves of women, and there were only a few players at the tables. There were two or three \u0027shills\u0027 at the roulette, attractive girls in smart evening dresses who had been given fifty dollars with which to warm up the dead tables, and there was a very drunk man clinging on to the high surrounding wall of one of the crap tables and shouting exhortations to the dice. \n And something else had changed. The dealer at the centre blackjack table nearest the bar was Tiffany Case. \n So that was her job at The Tiara. \n And then Bond saw that all the blackjack dealers were pretty women and that they were all dressed in the same smart Western outfit in grey and black-short grey skirt with a wide black metal-studded belt, grey blouse with a black handkerchief round the neck, a grey sombrero hanging down the back by a black cord, black half-Wellingtons over flesh-coloured nylons. \n Bond looked at his watch again and moved slowly into the room. So Tiffany was going to false-deal him to win five thousand dollars. And of course they had chosen the moment when she had just come on duty and the first show of the big-name revue was still running in The Platinum Room. He would be alone with her at the table. No witnesses in case she muffed a deal from the bottom of the pack. \n At exactly 10.5 Bond strolled easily up to the table and sat down facing her. \n \"Good evening.\" \n \"Hi.\" She gave him a thin, correct smile. \n \"What\u0027s the maximum?\" \n \"A Grand.\" \n As Bond slapped the ten l00-dollar notes down across the betting line, the pit-boss strolled over and stood beside Tiffany Case. He barely glanced at Bond. \"Mebbe the guy would like a new deck, Miss Tiffany,\" he said. He handed her a fresh pack. \n The girl stripped the cover off it and handed him the used cards. \n The pit-boss stood back a few paces and appeared to lose interest. \n The girl snapped the pack with a fluid motion of the hands, broke it and put the two halves flat on the table and executed what appeared to be a faultless Scarne shuffle. But Bond saw that the two halves did not quite marry and that when she lifted the pack off the table and carried out an innocent reshuffle she would be getting the two halves of the pack back into their original order. She repeated the manoeuvre again and put the pack down in front of Bond in an invitation to cut. Bond cut the cards and watched with approval as she carried out the difficult single-handed Annulment, one of the hardest gambits in card-sharping. \n So the \u0027new\u0027 deck was fixed and the only result of all this fair play routine was to get all the cards back into the order in which they were arranged when they left the wrappers. But it was brilliant manipulation and Bond was full of admiration for the assurance of the girl\u0027s hands. \n He looked up into her grey eyes. Was there a hint of complicity in them, a hint of amusement at the odd game they were playing across the narrow green board? \n She dealt him two cards and then gave two to herself. Suddenly Bond realized that he would have to be careful. He must play the exactly conventional game or he might upset the whole sequence in which the cards had been prepared. \n Printed across the table were the words \u0027The Dealer Must Draw on Sixteen and Stand on Seventeen\u0027. They would presumably have given him fool-proof winning cards, but just in case there was another player or a kibitzer, they would have to make his winning seem a natural run of luck and not, for instance, just deal him twenty-one each time and seventeens to the girl. \n He glanced at his two cards. A knave and a ten. He looked up at the girl and shook his head. She turned up sixteen and drew a card, busting herself with a king. She had a rack beside her which contained only silver dollars and counters for twenty, but the pit-boss was quickly at her side with a 1000-dollar plaque. She took it and tossed it over to Bond. He put it over the line and pocketed his notes. She flipped out two more cards to him and two to herself. Bond had seventeen and again shook his head. She had twelve and drew a three and then a nine-twenty-four and bust again. Again the pit-boss stepped up with a plaque. Bond slipped it into his pocket and left his original stake. This time he had nineteen and she turned up a ten and seven on which, by the rule, she had to stand. Another plaque went into Bond\u0027s pocket. \n The wide doors at the far end of the room had opened and a stream of people were milling into the gambling room from the dinner revue. Soon they would be round the tables. This was his last play. After this he must get up from the table and leave her. She was looking at him impatiently. He picked up the two cards that she had given him. Twenty. And she also turned up two tens. Bond smiled at the refinement. She quickly dealt him two more cards just as three more players came up to the table and hitched themselves up on the stools. He had nineteen and she had sixteen. \n And that was that. The pit-boss didn\u0027t even bother to hand the girl the fourth plaque, but tossed it across the table to Bond with an expression on his face that was very like a sneer. \n \"Jee-sus,\" said one of the new players, as Bond pocketed the plaque and stood up. \n Bond looked across the table at the girl. \"Thank you,\" he said. \"You deal beautifully.\" \n \"I\u0027ll say!\" said the player who had spoken. \n Tiffany Case looked hard at Bond. \"You\u0027re welcome,\" she said. She held his eyes for a fraction of a second and then looked down at her cards, shuffled them thoroughly, and handed them to one of the new players for a cut. \n Bond turned his back on the table and moved off round the room, thinking of her, and occasionally glancing across at the straight, imperious little figure in the exciting Western uniform. Others obviously found her as attractive as Bond did, for soon there were eight men sitting at her table and others standing watching her. \n Bond felt a pang of jealousy. He walked over to the bar and ordered himself a Bourbon and branch-water to celebrate the five thousand dollars in his pocket. \n The barman produced a corked bottle of water and put it beside Bond\u0027s \u0027Old Grandad\u0027. \n \"Where does this come from?\" asked Bond, remembering what Felix Leiter had said. \n \"Over by Boulder Dam,\" said the barman seriously. \"Comes in by truck every day. Don\u0027t worry,\" he added. \"It\u0027s the real stuff.\" \n Bond threw a silver dollar on the bar. \"I\u0027m sure it is,\" he said with equal seriousness. \"Keep the change.\" \n He stood with his back to the bar, and the glass in his hand, deciding his next move. So now he had been paid off, and Shady Tree had told him on no account to go back to the tables. \n Bond finished his drink and walked straight across the room to the nearest roulette table. There was only a sprinkling of gamblers at it, playing small. \n \"What\u0027s the maximum here?\" he said to the stick-man, an elderly balding individual with dead eyes who was just picking the ivory ball out of the wheel. \n \"Five Grand,\" said the man indifferently. \n Bond took the four plaques and the ten 100-dollar notes out of his pocket and put them beside the croupier. \"On Red.\" \n The croupier sat up straighter in his chair and squinted sideways at Bond. He tossed the four plaques one by one down on to the Red, catching them there with his stick. He counted out Bond\u0027s notes, pushed them through a slot in the table, took a. fifth plaque from the rack of counters beside him and tossed this down to join the others. Bond saw his knee go up under the table. The pit-boss heard the buzzer and strolled over to the table just as the croupier spun the wheel. \n Bond took out a cigarette and lit it. His hand was steady. He felt a wonderful sense of freedom at having at last taken the initiative from these people. He knew he was going to win. He hardly glanced at the wheel as it slowed down and the little ivory ball rattled into its slot. \n \"Thirty-six. Red. High and Even.\" \n The stick-man raked in a few losing counters and silver dollars and tossed some money down the table to the winners. Then he took a thin plaque as big as a prayer-book out of his rack and put it softly down beside Bond. \n \"Black,\" said Bond. The man threw a single plaque for five thousand dollars down on to Black and raked in Bond\u0027s stake from the Red. \n There was a buzz of conversation round the table and several more people drifted up and stood watching. Bond felt the curious eyes on him, but he only looked across the table into the eyes of the pit-boss. They were as hostile as an adder\u0027s, and yet somehow scared. \n Bond smiled blandly at him as the wheel whirred and there was the whizz of the little ball as it set off on its journey. \n \"Seventeen. Black. Low and Odd,\" said the stick-man. There was a sigh from the crowd and hungry eyes watched the big plaque being slipped out of. the rack and placed in front of Bond. \n Once more, thought Bond. But not this turn. \n \"I\u0027ll stay away,\" he said to the croupier. The man glanced up at Bond and then reached out with his rake and pulled in Bond\u0027s stake and handed it to him. \n And then there was another man inside the pit, standing be \n \"side the pit-boss, and he was looking at Bond with bright, hard eyes like camera lenses, and the fat cigar exactly in the centre of his red lips was pointing straight at Bond like a gun. The big square body in the midnight-blue tuxedo was quite motionless and a sort of tense quietness exuded from it. It was a tiger watching the tethered donkey and yet sensing danger. The face was ivory pale, but there was a likeness to the brother in London in the very straight, angry black brows and the short cliff of wiry hair cut en brosse, and in the ruthless jut of the jaw. \n The wheel whirred again and the two pairs of eyes bent to watch it. \n It fell into one of the two green slots in the wheel and Bond\u0027s heart lifted at the escape he had had. \n \"Double Zero,\" said the stick-man, raking in all the money on the table. \n Now for the last throw, thought Bond-and then out of here with twenty thousand dollars of the Spang money. He looked across at his employer. The two camera lenses and the cigar were still trained on him, but the pale face was expressionless. \n \"Red.\" He handed a 5000-dollar plaque to the croupier and watched it slither down the table. \n Would the last coup be asking too much of the wheel? No, decided Bond with certitude. It would not. \n \"Five. Red. Low and Odd,\" said the croupier obediently. \n \"I\u0027ll take the stake,\" said Bond. \"And thanks for the ride.\" \n \"Come again,\" said the stick-man unemotionally. \n Bond put his hand over the four fat plaques in his coat pocket and shouldered his way out of the crowd behind him and walked straight across the long room to the cashier\u0027s desk. \"Three bills of five thousand and five of ones,\" he said to the man with the green eyeshade behind the bars. The man took Bond\u0027s four plaques and counted out the bills and Bond put them in his pocket and walked over to the reception desk. \"Air mail envelope, please,\" he said. He moved to a writing-desk beside the wall and sat down and put the three big bills in the envelope and wrote on the front \u0027Personal. The Managing Director, Universal Export, Regents Park, London, N.W.1 England.\u0027 Then he bought stamps at the desk and slipped the envelope down the slot marked \u0027US Mail\u0027 and hoped that there, in the most sacrosanct repository in America, it would be safe. \n Bond glanced at his watch. It said five minutes to midnight. He surveyed the big room for the last time, noted that a new dealer had taken over at Tiffany Case\u0027s table, and that there was no sign of Mr Spang, and then he walked out through the glass door into the hot stuffy night and over the lawns to the Turquoise building and let himself into his room and locked the door behind him. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1553/46071.html","bookId":1284,"book":{"id":1284,"title":"007之金刚钻 Diamonds Are Forever","description":"简介： 在生产钻石的南非，最近怪事连连，一大批为经切割的钻石失踪了，而且谋杀案频发。这些异常现象引起了英国当局的高度重视，于是007（肖恩?康纳利 Sean Connery 饰）来到了南非。007以钻石批发商的名义展开了一系列的调查，发现一切原来都是他的死对头魔鬼党的首领艾纳斯...","cover":"http://novel.tingroom.com/file/upload/201605/09/14-06-48-15-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1553","creation":"Aug 1, 2019 12:24:47 AM","modification":"Aug 1, 2019 12:24:47 AM"}}
