{"id":30026,"no":22,"title":"22 LOVE AND SAUCE BEARNAISE","content":"PUNCTUALLY at eight, the great reverberating efflatus of the Queen Elizabeth\u0027s siren made the glass tremble in the skyscrapers and the tugs fussed the big ship out into midstream and nosed her round and, at a cautious five knots, she moved slowly down-river on the slack tide. \n There would be a pause to drop the pilot at the Ambrose Light and then the quadruple screws would whip the sea into cream and the Elizabeth would give a shudder of release and lance off on the long flat arc up from the 4jth to the 5oth parallel and the dot on it that was Southampton. \n Sitting in his cabin, listening to the quiet creak of the woodwork and watching his pencil on the dressing-table roll slowly between his hair brush and the edge of his passport, Bond remembered the days when her course had been different, when she had zig-zagged deep into the South Atlantic as she played her game of hide-and-seek with the U-boat wolfpacks, en route for the flames of Europe. It was still an adventure, but now the Queen, in her cocoon of protective radio impulses-her radar; her Loran, her echo-sounder-moved with the precautions of an oriental potentate among his bodyguards and outriders, and, so far as Bond was concerned, boredom and indigestion would be the only hazards of the voyage. \n He picked up the telephone and asked for Miss Case. When she heard his voice she gave a theatrical groan. \"The sailor hates the sea,\" she said. \"I\u0027m feeling sick already and we\u0027re still in the river.\" \n \"Just as well,\" said Bond. \"Stay in your cabin and live on dramamine and champagne. I\u0027ll be no good for two or three days. I\u0027m going to get the doctor and the masseur from the Turkish bath and try and stick the bits together again. And anyway it won\u0027t do any harm to stay out of sight for most of the voyage. It\u0027s just conceivable they picked us up in New York.\" \n \"Well, if you promise to call me up every day,\" said Tiffany, \"and promise to take me to this Veranda Grill place as soon as I feel I can swallow a little caviar. Okay?\" \n Bond laughed. \"If you absolutely insist,\" he said. \"And now listen, in exchange, I want you to try and remember anything you can about ABC and the London end of this business. That telephone number. And anything else. I\u0027ll tell you what it\u0027s all about and why I\u0027m interested as soon as I can, but in the meantime you\u0027ve just got to trust me. Is it a deal?\" \n \"Oh, sure,\" said the girl indifferently, as if all that side of her life had lost its importance; and for ten minutes Bond questioned her minutely, but except for small details, fruitlessly, about the ABC routine. \n Then he put down the receiver and rang for the steward and ordered some dinner and sat down to write the long report which he would have to transpose into code and send off that night. \n The \u0027Metal Mike\u0027 took the ship quietly on into the darkness and the small township of three thousand five hundred souls settled down to the five days of its life in which there would be all the happenings natural to any other sizeable community-burglaries, fights, seductions, drunkenness, cheating; perhaps a birth or two, the chance of a suicide and, in a hundred crossings, perhaps even a murder. \n As the iron town loped easily along the broad Atlantic swell and the soft night wind thrummed and moaned in the masthead, the radio aerials were already transmitting the morse of the duty operator to the listening ear of Portishead. \n And what the duty operator was sending at exactly ten pm Eastern Standard Time, Was a cable addressed: ABC, CARE HOUSE OF DIAMONDS, HATTON GARDEN, LONDON, which Said : PARTIES LOCATED STOP IF MATTER REQUIRES DRASTIC SOLUTION ESSENTIAL YOU STATE PRICE PAYABLE IN DOLLARS. The Signature Was WINTER. \n An hour later, while the Queen Elizabeth\u0027s operator was sighing at the thought of having to transmit five hundred five-letter groups addressed: THE MANAGING DIRECTOR, UNIVERSAL EXPORT, REGENTS PARK, LONDON, Portishead radio was sending a short cable addressed : WINTER FIRST CLASS PASSENGER QUEEN ELIZABETH, which said : DESIRE TIDY SPEEDY CONCLUSION OF CASE REPEAT CASE STOP WILL PAY TWENTY GRAND STOP WILL PERSONALLY HANDLE OTHER SUBJECT ON ARRIVAL LONDON CONFIRM ABC. \n And the operator looked up Winter in the passenger list and put the message in an envelope and sent it down to a cabin on A deck, the deck below Bond and the girl, where two men were playing gin-rummy in their shirt-sleeves, and as the steward left the cabin he heard the fat man say cryptically to the man with white hair, \"Whaddya know, Booful! It\u0027s twenty Grand for a rub these days, Boy-oh-boy!\" \n It was not until the third day out that Bond and Tiffany made a date to meet for cocktails in the Observation Lounge and later to have dinner in the Veranda Grill. At midday the weather was dead calm, and after lunch in his cabin Bond had got a peremptory message in a round girlish hand on a sheet of the ship\u0027s writing paper. It said, \u0027Fix a rendez-me today. Fail not,\u0027 and Bond\u0027s hand had gone at once to the telephone. \n They were thirsty for each other\u0027s company after the three days\u0027 separation, but Tiffany\u0027s defences were up when she joined him at the obscure corner table he had chosen in the gleaming semi-circular cocktail bar in the bows. \n \"What kind of a table\u0027s this?\" she inquired sarcastically. \"You ashamed of me or something? Here I put on the best those Hollywood pansies can dream up and you hide me away like I was \n Miss Rheingold 1914.1 want to have myself some fun on this old paddleboat and you put me in a corner as if I was catching.\" \n \"That\u0027s about it,\", said Bond. \"All you want to do is put the other men\u0027s temperatures up.\" \n \"What d\u0027you expect a girl to do on the Queen Elizabeth? Fish?\" \n ? Bond laughed. He signalled to the waiter and ordered Vodka dry Martinis with lemon peel. \"I could give you one alternative.\" \n \"Dear Diary,\" said the girl, \"having wonderful time with handsome Englishman. Trouble is, he\u0027s after my family jewels. What do I do? Yours truly, puzzled.\" Then suddenly she leant over and put her hand on his. \"Listen, you Bond person,\" she said. \"I\u0027m as happy as a cricket. I love being here. I love being with you. And I love this nice dark table where no one can see me holding your hand. Don\u0027t mind my talk. I just can\u0027t get over being so happy. Don\u0027t mind my silly jokes, will you?\" \n She was wearing a heavy cream Shantung silk shirt and a charcoal skirt in a cotton-and-wool mixture. The neutral colours showed off her cafй-au-lait sunburn. The small square Carder watch with the black strap was her only jewellery and the short fingernails on the small brown hand that lay over his were un-painted.. The reflected sunlight from outside shone on the pale gold heavy falling swerve of her hair, in the depths of the chatoyant grey eyes, and on the glint of white teeth between the luxurious lips dial were half open with her question. \n \"No,\" said Bond. \"No, I won\u0027t mind, Tiffany. Everything about you\u0027s fine.\" \n She looked into his eyes and was satisfied. The drinks came and she withdrew her hand and observed him quizzically over the rim of her glass. \n \"Now tell me a few things,\" she said. \"First of all, what do you do and who are you working for? At the beginning, in the hotel, I thought you were a crook. But somehow as soon as you had gone out the door I knew you weren\u0027t. Guess I should have warned ABC and we\u0027d have avoided a lot of fuss. But I just, didn\u0027t. Come on, James. Start giving.\" \n \"I work for the Government,\" said Bond. \"They want to stop this diamond smuggling.\" \n \"Sort of secret agent?\" \n \"Just a Civil Servant.\" \n \"Okay. So what are you going to do with me when we get to London? Lock me up?\" \n \"Yes. In the spare room of my flat.\" \n \"That\u0027s better. Shall I become a subject of the Queen like you? I\u0027d rather like to be a subject person.\" \n \"I expect we could fix that.\" \n \"Are you married?\" She paused. \"Or anything?\" \n \"No. I occasionally have affairs.\" \n \"So you\u0027re one of those old-fashioned men who like sleeping with women. Why haven\u0027t you ever married?\" \n \"I expect because I think I can handle life better on my own. Most marriages don\u0027t add two people together. They subtract one from the other.\" \n Tiffany Case thought this over. \"Maybe there\u0027s something in that,\" she said finally. \"But it depends what you want to add up to. Something human or something inhuman. You can\u0027t be complete by yourself.\" \n \"What about you?\" \n The girl hadn\u0027t wanted the question. \"Maybe I just settled for the inhuman,\" she said shortly. \"And who in hell do you think I should have married? Shady Tree?\" \n \"There must have been lots of others.\" \n \"Well, there weren\u0027t,\" she said angrily. \"Maybe you think I shouldn\u0027t have mixed with these people. Well, I guess I just got off on the wrong step.\" The flare of anger died and she looked at him defensively. \"It does happen to people, James. It really does. And sometimes it\u0027s really not their fault.\" \n James Bond put out his hand and held hers tightly. \"I know, Tiffany,\" he said. \"Felix told me a bit about things. That\u0027s why I haven\u0027t asked any questions. Just don\u0027t think about it. It\u0027s here and today now. Not yesterday.\" He changed the subject. \"Now you give me some facts. For instance, why are you called Tiffany and what\u0027s it like being a dealer at the Tiara? How the hell did you come to be so good? It was brilliant the way you handled those cards. If you can do that you can do anything.\" \n \"Thanks, pal,\" said the girl ironically. \"Like what? Playing the boats? And the reason I got called Tiffany is because when I was born, dear father Case was so sore I wasn\u0027t a boy he gave my mother a thousand bucks and a powder case from Tiffany\u0027s and walked out. Joined the Marines. In the end he got killed at Iwo Jima. So my mother just called me Tiffany Case and set about earning a living for us both. Started with a string of call-girls and then got more ambitious. Maybe that doesn\u0027t sound so good to you?\" She looked at him half defensively and half pleadingly. \n \"Doesn\u0027t worry me,\" said Bond dryly. \"You weren\u0027t one of the girls.\" \n She shrugged her shoulders. \"Then the place got busted by the gangs.\" She paused and drank the rest of her Martini. \"And I lit out on my own. The usual jobs a girl takes. Then I found my way to Reno. They\u0027ve got a School of Dealing there and I signed on and worked like hell at it. Took the full course. Majored in craps, roulette and blackjack. You can earn good money dealing. Two hundred a week. The men like to have girls dealing, and it gives the women confidence. They think you\u0027ll be kind to them. Sisters under the skin kind of. The men dealers frighten them. But don\u0027t get the idea it\u0027s fun. It reads better than it lives.\" \n She paused and smiled up at him. \"Now it\u0027s your turn again,\" she said. \"Buy me another drink and then tell me what sort of a woman you think would add to you.\" \n Bond gave his order to the steward. He lit a cigarette and turned back to her. \"Somebody who can make Sauce Bйarnaise as well as love,\" he said. \n \"Holy mackerel! Just any old dumb hag who can cook and lie on her back?\" \n \"Oh, no. She\u0027s got to have all the usual things that all women have.\" Bond examined her. \"Gold hair. Grey eyes. A sinful mouth. Perfect figure. And of course she\u0027s got to make lots of funny jokes and know how to dress and play cards and so forth. The usual things.\" \n \"And you\u0027d marry this person if you found her?\" \n \"Not necessarily,\" said Bond. \"Matter of fact I\u0027m almost married already. To a man. Name begins with M. I\u0027d have to divorce him before I tried marrying a woman. And I\u0027m not sure I\u0027d want that. She\u0027d get me handing round canapйs in an L-shaped drawing-room. And there\u0027d be all those ghastly \u0027Yes, you did-no I didn\u0027t\u0027 rows that seem to go with marriage. It wouldn\u0027t last. I\u0027d get claustrophobia and run out on her. Get myself sent to Japan or somewhere.\" \n \"What about children?\" \n \"Like to have some,\" said Bond shortly. \"But only when I retire. Not fair on the children otherwise. My job\u0027s not all that secure.\" He looked into his drink and swallowed it down. \"And what about you, Tiffany?\" he said to change the subject. \n \"I guess every girl would like to come home and find a hat on the hall table,\" said Tiffany moodily. \"Trouble is I\u0027ve never found the right sort of thing growing under the hat. Maybe I haven\u0027t looked hard enough or in the right places. You know how it is when you get in a groove. You get so that you\u0027re quite glad not to look over the edges. In that way I\u0027ve had it good with the Spangs, Always knew where the next meal was coming from. Put some money by. But a girl can\u0027t have friends in that company. You either put up a notice saying \u0027No Entry\u0027 or you\u0027re apt to pick up a bad case of round heels. But I guess I\u0027m fed up with being on my own. You know what the chorines say on Broadway? \u0027It\u0027s a lonesome wash without a man\u0027s shirt in it\u0027.\" \n Bond laughed. \"Well, you\u0027re out of the groove now,\" he said. He looked at her quizzically. \"But what about Mister Seraffimo? Those two bedrooms on the Pullman and the champagne supper laid for two…\" \n Before he could finish, her eyes blazed briefly and she stood up from the table and walked straight out of the bar. \n Bond cursed himself. He put some money down on the bill and hurried after her. He caught up with her half way down the Promenade Deck. \"Now listen, Tiffany,\" he began. \n She turned brusquely round and faced him. \"How mean can you be?\" she said and angry tears glistened on her eyelashes. \"Why do you have to spoil everything with an abrasive remark like that? Oh, James,\" forlornly she turned to the windows, searching for a handkerchief in her bag. She dabbed her eyes. \"You just don\u0027t understand.\" \n Bond put an arm round her and held her to him. \"My darling.\" He knew that nothing but the great step of physical love would cure these misunderstandings, but that words and time still had to be wasted. \"I didn\u0027t mean to hurt you. I just wanted to know for certain. That was a bad night on the train and that supper-table hurt me much more than what happened later. I had to ask you.\" \n She looked up at him doubtfully. \"You mean that?\" she said searching his face. \"You mean you liked me already?\" \n \"Don\u0027t be a goose,\" said Bond impatiently. \"Don\u0027t you know anything about anything?\" \n She turned away from him and looked out of the window at the endless blue sea and at the handful of dipping gulls that were keeping company with their wonderfully prodigal ship. After a while she said: \"You ever read Alice in Wonderland?\" \n \"Years ago,\" said Bond, surprised. \"Why?\" \n \"There\u0027s a line there I often think of,\" she said. \"It says, \u0027Oh, Mouse, do you know the way out of this pool of tears? I am very tired of swimming about here, oh Mouse.\u0027 Remember? Well, I thought you were going to tell me the way out. Instead of that you ducked me in the pool. That\u0027s why I got upset.\" She glanced up at him. \"But I guess you didn\u0027t mean to hurt.\" \n Bond looked quietly at her mouth and then kissed her hard on the lips. \n She didn\u0027t respond, but broke away, and her eyes were laughing again. She linked her arm high up in his and turned towards the open doors that led to the lift. \"Take me down,\" she said. \"I must go and rewrite my face, and anyway I want to spend a long time dressing the business for sale.\" She paused and then put her mouth close up to his ear. \"In case it interests you, James Bond,\" she said softly. \"I\u0027ve never what you\u0027d call\u0027slept with a man\u0027 in my life.\" She tugged at his arm. \"And now come on,\" she said brusquely. \"And anyway it\u0027s time you went and had a Hot Domestic. I suppose that\u0027s part of the subject-language you\u0027ll be wanting me to pick up. You subject-people surely do write up the craziest things in your bathrooms.\" \n Bond took her to her cabin and then went on to his and had a \u0027Hot Salt\u0027 bath followed by a \u0027Cold Domestic\u0027 shower. Then he lay on his bed and smiled to himself over some of the things she had said, and thought of her lying in her bath looking at the forest of bath-taps and thinking how crazy the English were. \n There was a knock on the door and his steward came in with a small tray which he placed on the table. \n \"What the hell\u0027s that?\" said Bond. \n \"Just come up from the chef, Sir,\" said the Steward and went out and closed the cabin door. \n Bond slipped off the bed and went over and examined the contents of the tray. He smiled to himself. There was a quarter bottle of Bellinger, a chafing dish containing four small slivers of steak on toast canapйs, and a small bowl of sauce. Beside this was a pencilled note which said \u0027This Sauce Bйarnaise has been created by Miss T. Case without my assistance,\u0027 Signed \u0027The Chef. \n Bond filled a glass with champagne and spread a lot of the Bйarnaise on a piece of the steak and munched it carefully. Then he went to the telephone. \n \"Tiffany?\" \n He heard the low delighted laugh at the other end. \n \"Well, you can certainly make wonderful Sauce Bйarnaise...\" \n He put the receiver back on its cradle. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1553/46076.html","bookId":1284,"book":{"id":1284,"title":"007之金刚钻 Diamonds Are Forever","description":"简介： 在生产钻石的南非，最近怪事连连，一大批为经切割的钻石失踪了，而且谋杀案频发。这些异常现象引起了英国当局的高度重视，于是007（肖恩?康纳利 Sean Connery 饰）来到了南非。007以钻石批发商的名义展开了一系列的调查，发现一切原来都是他的死对头魔鬼党的首领艾纳斯...","cover":"http://novel.tingroom.com/file/upload/201605/09/14-06-48-15-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1553","creation":"Aug 1, 2019 12:24:47 AM","modification":"Aug 1, 2019 12:24:47 AM"}}
