{"id":30029,"no":25,"title":"25 THE PIPELINE CLOSES","content":"THERE was now no scorpion living in the roots of the great thorn bush which stood at the junction of the three African states. The smuggler from the mines had nothing to occupy his mind except an endless column of Driver ants flowing along between the low walls which the Soldiers had built on both sides of the three-inch highway. \n It was hot and sticky and the man hiding in the thorn bush was impatient and ill at ease. This was the last time he would make the rendezvous. That was definite. They would have to find someone else. Of course he would be fair with them. He would warn them he was quitting and tell them the reason-the new dental assistant who had joined the staff, and who didn\u0027t seem to know quite enough about dentistry. The man was certainly a spy-the careful eyes, the little ginger moustache, the pope, the clean fingernails. Had one of the boys been caught? Had one of them turned Queen\u0027s evidence? \n The smuggler shifted his position. Where the hell was the plane? He picked up a handful of dirt and threw it into the middle of the flowing column of ants. They hesitated and spilled over the walls of their road as the hurrying rear ranks crowded into them. Then the Soldiers started frantically digging and carrying and in a few minutes the highway was clear. \n The man took off his shoe and slapped it down hard across the moving column. There was another brief moment of confusion. Then the ants set upon the dead bodies and devoured them and the road was open again and the black river flowed on. \n The man swore briefly in Afrikaans and pulled on his shoe. Black bastards. He would show them. Crouching, and holding up an arm against the thorns, he stamped along the column of ants and out into the moonlight. That would give them something to think about. \n Then he forgot the hatred he had for all black things and cocked his head towards the north. Thank heavens! He moved round the bush to get the torches and the packet of diamonds out of the tool boxes. \n A mile away in the low bush the big iron ear of the sound-detector had already stopped searching, and the operator, who had been softly calling the range to the group of three men beside the army truck, now said : \"Thirty miles. Speed one-twenty. Height nine hundred.\" \n Bond glanced at his watch. \"Looks as if midnight at full moon is the rendezvous,\" he said. \"And he\u0027ll be about ten minutes late.\" \n \"Looks like it, Sir,\" said the officer from the Freetown Garrison Force who was standing next to him. He turned to the third man. \"Corporal. Make sure there\u0027s no metal showing through the camouflage net. This moon\u0027ll pick up anything.\" \n The truck was standing under cover of the low bush on a dirt track that ran across the plain in the direction of the village of Telebadou in French Guiana. That night, they had started off from the hills as soon as the locator had picked up the sound of the dentist\u0027s motor cycle on the parallel track. They had driven without lights, and they had stopped as soon as the motor cycle had stopped and there was no longer protection from the noise of its engine. They had put a camouflage net over the truck and over the locator and over the bulge of the Bofors mounted beside it. Then they had waited, not knowing what to expect at the dentist\u0027s rendezvous-another motor cycle, a rider on a horse, a jeep, an aeroplane? \n Now they could hear the distant clatter in the sky. Bond gave a short laugh. \"Helicopter,\" he said. \"Nothing else makes that racket. Get ready to take the net down when he lands. We may have to give him a warning shot. Is the loud-hailer switched on?\" \n \"Yes, Sir,\" said the Corporal at the locator. \"And he\u0027s coming in quick. You should be able to see him in a minute. See those lights just come on, Sir? Must be the landing ground.\" \n Bond glanced at the four thin shafts of light, and then he looked up again into the great African sky. \n So here came the last of them, the last of the gang, and yet the first. The man he\u0027d taken a look at in Hatton Garden. The first of the Spangled Mob, the gang that had rated so high in Washington. The only one, except the harmless, rather likeable, Shady Tree, Bond had not yet had to kill-or, he thought of the Pink Garter Saloon and the two men from Detroit, almost kill. Not that he had wanted to kill these people. The job M had given him had only been to find out about them. But, one by one, they had tried to kill him and his friends. Violence had been their first resort, not their last. Violence and cruelty were their only weapons. The two men in the Chevrolet in Las Vegas who had shot at him and hit Ernie Cureo. The two men in the Jaguar who had bludgeoned Ernie and had been the first to draw guns when it came to the fight. Seraffimo Spang, who had started to torture him to death and had then tried to shoot them or smash them down on the railway track. Wint and Kidd, who had given Tingaling Bell the treatment, and then Bond, and then Tiffany Case. And, of the seven, he had killed five-not because he liked it, but because somebody had had to. And he had had luck and three good friends, Felix and Ernie and Tiffany. And the bad men had died. \n And now here came the last of the bad men, the man who had ordered his death, and Tiffany\u0027s, the man who, according to M, had built up the traffic in diamonds, organized the pipeline and run it ruthlessly and efficiently through the years. \n On the telephone to Boscombe Down, M had been brief and his voice had had an edge to it. He had reached Bond on the Air Ministry line a few minutes before the Canberra was due to take off for Freetown. Bond had taken the call in the Station Commander\u0027s office, with the scream of the Canberra testing her jets in the background. \n \"Glad you got back all right.\" \n \"Thank you, Sir.\" \n \"What\u0027s this in the evening papers about a double killing in the Queen Elizabeth?\" There was more than suspicion in M\u0027s voice. \n \"They were the two killers from the gang, Sir. Travelling as Winter and Kitteridge. My steward told me they were supposed to have had a row over cards.\" \n \"Do you think your steward was right?\" \n \"It sounds possible, Sir.\" \n There was a pause. \"Do the police think so?\" \n \"I haven\u0027t seen any of them, Sir.\" \n \"I\u0027ll talk to Vallance.\" \n \"Yes, Sir,\" said Bond. He knew that this was M\u0027s way of saying that, if Bond had killed the men, M would make sure that neither Bond nor the Service was mentioned at the inquest. \n \"Anyway,\" said M, \"they were small people. This man Jack Spang, or Rufus Saye, or ABC, or whatever he calls himself. I want you to get him. As far as I can make out he\u0027s going back down the pipeline. Sealing it off. Probably killing as he goes. The end of the line is this dentist. Try and get them both. I\u0027ve had 2804 working alongside the dentist for the last week or so, and Freetown think they\u0027ve got the local picture clear enough. But I want to close this case and get you back on your proper job. This has been a messy business. Never liked it from the first. More luck than good management that we\u0027ve got as far as we have.\" \n \"Yes, Sir,\" said Bond. \n \"What about this Case girl?\" said M. \"I\u0027ve talked to Vallance. He doesn\u0027t want to prosecute unless you feel strongly about it.\" \n Was M\u0027s voice a shade too indifferent? \n Bond tried to prevent his answer being too breezy. \"She\u0027s been a great help, Sir,\" he said, easily he hoped. \"Perhaps we could decide when I\u0027ve put in my final report.\" \n \"Where is she now?\" \n The black receiver was getting slippery in Bond\u0027s hand. \"She\u0027s on her way to London in a Daimler Hire, Sir. I\u0027m putting her up in my flat. In the spare room, that is. Very good housekeeper. She\u0027ll look after her until I get back. I\u0027m sure she\u0027ll be all right, Sir.\" Bond took out a handkerchief and wiped the sweat off his face. \n \"I\u0027m sure,\" said M. There was no irony in his voice. \"All right, then. Well, best of luck.\" There was a pause. \"Look after yourself. And,\" the voice at the other end was suddenly gruff, \"don\u0027t think I\u0027m not pleased with the way things have gone so far. Exceeded your brief, of course, but you seem to have stood up to these people very well. Goodbye, James.\" \n \"Goodbye, Sir.\" \n Bond looked up into the spangled sky and thought of M, and of Tiffany, and hoped that this would really be the end, and that it would be quick and easy, and that he would soon be home. \n The smuggler from the mines stood and waited, holding the fourth torch in his hand. There it was. Coming right across the moon. Hell of a noise as usual. That was another risk he\u0027d be glad to get away from. \n Down it came, and now it was hovering twenty feet above his head. The hand came out and flashed A, and the man on the ground winked back the B and the C. Then the rotor blades flattened and softly the great iron insect sank to the ground. \n The dust settled. The diamond smuggler took his hand away from his eyes and watched the pilot climb down his small ladder to the ground. He was wearing a flying helmet and goggles. Unusual. And he looked taller than the German. The man\u0027s spine tingled. Who was this? He walked slowly to meet him. \n \"Got the stuff?\" Two cold eyes under straight black brows looked sharply out from behind the goggles. They were hidden as the man\u0027s head moved and the moon caught the glass. Now there we-re just two round blazing white circles in the middle of the shiny black leather helmet. \n \"Yes,\" said the man from the mines nervously. \"But where\u0027s the German?\" \n \"He won\u0027t be coming again.\" The two white circles stared blindly at the smuggler. \"I am ABC. (I am closing down the pipeline.\" \n It was an American voice, hard and flat and final. \n \"Oh.\" \n Automatically the smuggler\u0027s hand went inside his shirt. He took out the moist packet and held it out as if it was some kind of a peace offering. Like the scorpion, a month earlier, he sensed the raised stone above him. \n \"Give me a hand with the gas.\" \n It was the voice of an overseer giving an order to a coolie, but the smuggler stepped quickly forward to obey. \n They worked in silence. Then it was finished and they were on the ground again. The smuggler had been thinking desperately. He summoned up the voice of an equal partner, the voice of someone who knew the score and had an equal control. \n He peered into the patch of indigo blackness where the pilot stood with his hand on the ladder. \n \"I\u0027ve been thinking things over and I\u0027m afraid…\" \n And then the voice stopped and the lips drew back from the teeth in the open mouth, and the mouth began to make a noise between a snarl and a scream. \n The gun in the pilot\u0027s hand stammered three times. The smuggler said \"Oh\" in an obsequious voice. He pitched backwards into the dust and gave one heave and lay still. \n \"Don\u0027t move.\" The clanging voice came over the plain with the screeching echo of the amplifier. \"You\u0027re covered.\" There was the sound of an engine starting up. \n The pilot didn\u0027t wait to wonder about the voice. He leapt for the ladder. The door of the cockpit slammed and there was the whirr of the self-starter. The engine roared and the rotor blades swung and slowly gathered speed until they were two whirlpools of silver. Then there was a jerk and the helicopter was in the air and climbing vertically straight up into the sky. \n Down among the low bush the truck stopped with a jerk and Bond leapt for the iron saddle of the Bofors. \n \"Up, Corporal,\" he snapped to the man at the elevation lever. He bent his eyes to the grid-sight as the muzzle rose towards the moon. He reached to pull the firing selector lever off \u0027Safe\u0027 and put it on \u0027Single Fire\u0027. \"And left ten.\" \n \"I\u0027ll keep feeding you tracer.\" The officer beside Bond had two racks of five yellow-painted shells in his hands. \n Bond\u0027s feet settled into the trigger pedals and now he had the helicopter in the centre of the grid. \"Steady,\" he said quietly. \n \u0027Boompa\u0027. \n The spangled tracer swung lazily up into the sky just below the speed of sound. \n Low and left. \n The Corporal delicately twisted the two levers. \n \u0027Boompa\u0027. \n The tracer curved away high over the rising machine. Bond reached forward and pulled the selector lever to \u0027Auto Fire\u0027. The movement of his hand was reluctant. Now it would be certain death. He was going to have to do it again. \n \u0027Boompa-boompa-boompa-boompa-boompa.\u0027 \n The red fire sprayed across the sky. Still the helicopter went on rising towards the moon, and now it was turning away to the north. \n \u0027Boompa-boompa\u0027. \n There was a flash of yellow light near the tail rotor and the distant bang of an explosion. \n \"Got him,\" said the officer. He picked up a pair of night-glasses. \"Tail rotor\u0027s gone,\" he said. And then, excitedly, \"Gosh. It looks as if the whole cabin\u0027s going round with the main ?rotor. Pilot must be getting hell.\" \n \"Any more?\" said Bond, holding the whirring machine in his sights. \n \"No, Sir,\" said the officer. \"Like to get him alive if we can. But it looks as if… yes, he\u0027s out of control now. Coming down in great swoops. Must be something wrong with the main rotor blades. There he goes.\" \n Bond raised his head from the grid sight and shaded his eyes against the blazing moon. \n Yes. There he was. Only about a thousand feet up now, the engine roaring and the great blades whirring uselessly as the tangle of metal pitched and yawed down the sky in long drunken staggers. \n Jack Spang. The man who had ordered Bond\u0027s death. Who had ordered Tiffany\u0027s death. The man Bond had only once seen for a few minutes in an overheated room in Covent Garden. Mr Rufus B. Saye. Of The House of Diamonds. Vice-President for Europe. The man who played golf at Sunningdale and visited Paris once a month. \u0027Model citizen,\u0027 M had called him. \n Mr Spang of the Spangled Mob, who had just killed a man-the final one of how many others? \n Bond could imagine the scene in the narrow cockpit, the big man holding on with one hand and wrenching at the controls with the other as he watched the needle of the altimeter dip down through the hundreds. And there would be the red glare of terror in the eyes, and the hundred thousand pound pocketful of diamonds would be just so much deadweight, and the gun which had been a strong right arm since boyhood would be no comfort. \n \"He\u0027s coming right back to the bush,\" shouted the Corporal above the clatter in the sky. \n \"He\u0027s a goner now,\" said the Captain, half to himself. \n They watched the last bucketing lurches and then they held their breath as the aircraft, see-sawing wildly, gave a final tip to its nose and, as if the bush had been its enemy, made an angry dive through a twenty-yard curve and hurled itself and the threshing rotors into the stack of thorns. \n Before the echoes of the crash had died, there came a hollow boom out of the heart of the bush followed by a jagged ball of flame that grew and billowed up into the air so that the moon was dimmed and the whole plain was bathed in an orange glare. \n The Captain was the first to speak. \n \"Ouch!\" he said with feeling. He slowly lowered his night-glasses and turned to Bond. \"Well, Sir,\" he said resignedly. \"That\u0027s just about that. \u0027Fraid it\u0027s going to be morning before we can get anywhere near that lot. And then it\u0027s going to be hours more before we can start raking about in it. And this is going to bring the French frontier guards along at the gallop. Luckily we\u0027re on pretty good terms with them, but the Governor\u0027s going to have a fine time arguing the toss with Dakar.\" The officer saw a vista of paper-work stretching ahead. The prospect made him tireder than he already was. He was matter-of-fact. He had had enough for one day. \"Mind if we get a bit of shut-eye, Sir?\" \n \"Go ahead,\" said Bond. He looked at his watch. \"Better get under the truck. Sun\u0027ll be coming up in about four hours. Not feeling tired myself. I\u0027ll keep an eye out in case the fire looks like spreading.\" \n The officer gave a curious glance at this quiet, enigmatic man who had suddenly arrived in the Protectorate amidst a flurry of \u0027Absolute Priority\u0027 signals. If ever a man needed sleep… But all this was nothing to do with Freetown. London stuff. \"Thanks, Sir,\" he said and jumped down from the truck. \n Bond slowly took his feet off the trigger-pedals and sat back in the iron saddle. Automatically, with his eyes still on the leaping flames, his hands felt in the pockets of the faded khaki bush-shirt, borrowed from the Garrison CO, for his lighter and cigarettes, and he took out a cigarette and lit it and put the things back in his pockets. \n So this was the end of the diamond pipeline. And the last page on the file. He took a deep lungful of smoke and let it out between his teeth in a long, quiet sigh. Six corpses to love. Game and set. \n Bond put up a hand and wiped it across his dripping forehead. He pushed back the damp lock of hair above the right eyebrow and the red blaze lit up the hard lean face and flickered in the tired eyes. \n So this great red full stop marked the end of the Spangled Mob and the end of their fabulous traffic in diamonds. But not the end of the diamonds that were baking at the heart of the fire. They would survive and move off again across the world, discoloured, perhaps, but indestructible, as permanent as death. \n And Bond suddenly remembered the eyes of the corpse which had once had a Blood Group F. They had been wrong. Death is forever. But so are diamonds. \n Bond dropped down off the truck and started walking slowly towards the leaping fire. He smiled grimly to himself. All this business about death and diamonds was too solemn. For Bond it was just the end of another adventure. Another adventure for which a wry phrase of Tiffany Case might be the epitaph. He could see the passionate, ironical mouth saying the words: \n \u0027It reads better than it lives.\u0027 \n \n The End \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1553/46079.html","bookId":1284,"book":{"id":1284,"title":"007之金刚钻 Diamonds Are Forever","description":"简介： 在生产钻石的南非，最近怪事连连，一大批为经切割的钻石失踪了，而且谋杀案频发。这些异常现象引起了英国当局的高度重视，于是007（肖恩?康纳利 Sean Connery 饰）来到了南非。007以钻石批发商的名义展开了一系列的调查，发现一切原来都是他的死对头魔鬼党的首领艾纳斯...","cover":"http://novel.tingroom.com/file/upload/201605/09/14-06-48-15-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1553","creation":"Aug 1, 2019 12:24:47 AM","modification":"Aug 1, 2019 12:24:47 AM"}}
