{"id":30011,"no":7,"title":"7 \u0027SHADY\u0027 TREE","content":"THE customs officer, a paunchy good-living man with dark sweat marks at the armpits of his grey uniform shirt, sauntered lazily over from the Supervisor\u0027s desk to where Bond stood, his three pieces of luggage in front of him, under the letter B. Next door, under C, the girl took a packet of Parliaments out of her bag and put a cigarette between her lips. Bond heard several impatient clicks at the lighter, and the sharper snap as she put the lighter back in her bag and closed the fastening. Bond felt aware of her watchfulness. He wished that her name began with Z so that she would not be so close. Zarathustra? Zacharias? Zophany… p \"Mr Bond?\" \"Yes.\" \"Is this your signature?\" \"Yes.\" \"Just your personal effects?\" \"Yes, that\u0027s all.\" \"Okay, Mr Bond.\" The man tore a customs stamp out of his book and pasted it on the suitcase. He did the same for the attachй case. He came to the golf clubs. He paused with the stamp book in his hand. He looked up at Bond. \"What d\u0027ya shoot, Mr Bond?\" Bond had a moment of blackout. \"They\u0027re golf clubs.\" \"Sure,\" said the man patiently. \"But what d\u0027ya shoot? What d\u0027ya go round in?\" Bond could have kicked himself for forgetting the Americanism. \"Oh, in the middle eighties, I guess.\" \"Never broken a hundred in my life,\" said the customs officer. He gummed a blessed stamp on the side of the bag a few inches away from the richest haul of contraband that had ever been missed at Idlewild. \"Have a good vacation, Mr Bond.\" \"Thanks,\" said Bond. He beckoned a porter and followed his bags across to the last hurdle, the Inspector at the door. There was no pause. The man bent over, searched for the stamps, over-stamped them and waved him through. \"Mr. Bond?\" It was a tall, hatchet-faced man with mud-coloured hair and mean eyes. He was wearing dark brown slacks and a coffee-coloured shirt. \"I have a car for you.\" As he turned and led the way out into the hot early morning sun, Bond noticed a square bulge in his hip-pocket. It was about the shape of a small-calibre automatic. Typical, thought Bond. Mike Hammer routine. These American gangsters were too obvious. They had read too many horror-comics and seen too many films. The car was a black Oldsmobile Sedan. Bond didn\u0027t wait to be told. He climbed into the front seat, leaving the disposal of his luggage in the back and the tipping of the porter to the man in brown. When they had left the cheerless prairie of Idlewild and had merged into the stream of commuter traffic on the Van Wyck Parkway, he felt he ought to say something. \"How\u0027s the weather been over here?\" The driver didn\u0027t take his eyes off the road. \"Either side of a hundred.\" \"That\u0027s pretty hot,\" said Bond. \"We haven\u0027t had it much over seventy-five in London.\" \"That so?\" \"What\u0027s the programme now?\" asked Bond after a pause. The man glanced in his driving-mirror and pulled into the centre lane. For a quarter of a mile he busied himself with passing a bunch of slow-moving cars on the inside lanes. They came to an empty stretch of road. Bond repeated his question. \"I said, what\u0027s the programme?\" The driver gave him a quick glance. \"Shady wants you.\" \"Does he?\" said Bond. He was suddenly impatient with these people. He wondered how soon he would be able to throw some weight about. The prospect didn\u0027t look good. His job was to stay in the pipeline and follow it farther. Any sign of independence or non-co-operation and he would be discarded. He would have to make himself small and stay that way. He would just have to get used to the idea. They swept into up-town Manhattan and followed the river as far as the forties. Then they cut across town and pulled up half way down West 46th Street, the Hatton Garden of New York. The driver double-parked outside an inconspicuous doorway. Their destination was sandwiched between a grubby-looking shop selling costume jewellery and an elegant shop-front faced with black marble. The silver italic lettering above the black marble entrance of the elegant shop-front was so discreet that if the name had not been in the back of Bond\u0027s mind he would not have been able to decipher it from where he sat. It said \u0027The House of Diamonds, Inc.\u0027. As the car stopped, a man stepped off the pavement and sauntered round the car. \"Everything okay?\" he said to the driver. \"Sure. Boss in?\" \"Yeah. Want me to park the heap?\" \"Be glad if you would.\" The driver turned to Bond. \"This is it, bud. Let\u0027s get the bags out.\" Bond got out and opened the rear door. He picked up his small attachй case and reached for the golf clubs. \"I\u0027ll take the sticks,\" said the driver behind him. Obediently Bond hauled out his suitcase. The driver reached in for the clubs and slammed the door of the car. The other man was already in the driver\u0027s seat and the car moved off into the traffic as Bond followed the driver across the sidewalk and through\u0027 the inconspicuous door. There was a man in a porter\u0027s lodge in the small hallway. As they came in, he looked up from the sports section of The News. \"Hi,\" he said to the driver. He looked sharply at Bond. \"Hi,\" said the driver. \"Mind if we leave the bags with you?\" \"Go ahead,\" said the man. \"Be okay in here.\" He jerked his head back. The driver, with Bond\u0027s clubs over his shoulder, waited for Bond beside the doors of an elevator across the hall. When Bond followed him inside, he pressed the button for the fourth floor and they rode up in silence. They emerged into another small hallway. It contained two chairs, a table, a large brass spittoon and a smell of stale heat. They crossed the frayed carpet to a glass-fronted door and the driver knocked and walked through without waiting for an answer. Bond followed him and shut the door. A man with very bright red hair and a big peaceful moon-shaped face was sitting at a desk. There was a glass of milk in front of him. He stood up as they came in and Bond saw he was a hunchback. Bond didn\u0027t remember having seen a red-haired hunchback before. He could imagine that the combination would be useful for frightening the small fry who worked for the gang. The hunchback moved slowly round the desk and over to where Bond was standing. He walked round-Bond, making a show of examining him minutely from head to foot, and then he came and stood close in front of Bond and looked up into his face. Bond looked impassively back into a pair of china eyes that were so empty and motionless that they might have been hired from a taxidermist. Bond had the feeling that he was being subjected to some sort of test. Casually he looked back at the hunchback, noting the big ears with rather exaggerated lobes, the dry red lips of the big half-open mouth, the almost complete absence of a neck, and the short powerful arms in the expensive yellow silk shirt, cut to make room for the barrel-like chest and its sharp hump. \"I like to have a good look at the people we employ, Mr Bond.\" The voice was sharp and pitched high. Bond smiled politely. \"London tells me you have killed a man. I believe them. I can see you are capable of it. Would you like to do more work for us?\" \"It depends what it is,\" said Bond. \"Or rather,\" he hoped he was not being too theatrical, \"how much you pay.\" The hunchback gave a short squeal of laughter. He turned abruptly to the driver. \"Rocky, get those balls out of the bag and cut them open. Here\"; he gave a quick shake of his right arm and held his open hand out to the driver. On it lay a double-bladed knife with a flat handle bound with adhesive tape. Bond recognized it as a throwing knife. He had to admit that the bit of legerdemain had been neatly executed. \"Yes, boss,\" said the driver, and Bond noticed the alacrity with which he took the knife and knelt on the floor to unstrap the ball-pocket of the golf bag. The hunchback walked away from Bond and back to his chair. He sat down and picked up the glass of milk. He looked at it with distaste and swallowed the contents in two huge gulps. He looked at Bond as if for comment. \"Ulcers?\" asked Bond sympathetically. \"Who spoke to you?\" said the hunchback angrily. His anger was transferred to the driver. \"What are you waiting for, Rocky? Put those balls on the table where I can see what you\u0027re doing. The number on the ball is the centre of the plug. Dig \u0027em out.\" \"Coming, boss,\" said the driver. He stood up from the floor and put the six new balls on the desk. Five of them were still in their black wrapping. He took the sixth and turned it round in his fingers. Then he picked up the knife and dug its point into the cover of the ball and levered. A half-inch circular section of the ball came away on the tip of the blade and he passed the ball across the desk to the hunchback, who tipped the contents, three uncut stones of ten to fifteen carats, on to the leather surface of the desk. The hunchback moodily poked the stones with his finger. The driver went on with his work until Bond counted eighteen stones on the table. They were unimpressive in their rough state but if they were of top quality Bond could easily believe they might be worth ?100,000 after cutting. \"Okay, Rocky,\" said the hunchback. \"Eighteen. That\u0027s the lot. Now get those goddam golf-sticks out of here and send the boy to the Astor with them and this guy\u0027s bags. He\u0027s registered there. Have them sent up to his room. Okay?\" \"Okay, boss.\" The driver left the knife and the empty golf balls on the table, strapped up the ball-pocket on Bond\u0027s bag, hoisted the bag on his shoulder and left the room. Bond went over to a chair against the wall, pulled it over to face the hunchback across the desk and sat down. He took a cigarette and lit it. He looked across at the hunchback and said \"And now, if you\u0027re happy, I\u0027d be glad of those $5000.\" The hunchback, who had been carefully watching Bond\u0027s movements, lowered his eyes to the untidy pile of diamonds in front of him. He poked them into a circle. Then he looked up at Bond. \"You will be paid in full, Mr Bond,\" the high voice was precise and businesslike. \"And you may get more than $5000. But the method of payment will be devised as much for your protection as for ours. There will be no direct payment. And you will understand why, Mr Bond, because you will have made pay-offs during your career of burglary. It is very dangerous for a man suddenly to be flush with money. He talks about it. He throws it around. And if the cops catch up with him and ask him where it all came from he hasn\u0027t got an answer. Agree?\" \"Yes,\" said Bond surprised by the sanity and authority of what the man was saying. \"That makes sense.\" \"So,\" said the hunchback, \"I and my friends pay only very seldom and in small amounts for services rendered. Instead, we arrange for the guy to make the money on his own account. Take yourself. How much money have you got in your pocket?\" \"About three pounds and some silver,\" said Bond. \"All right,\" said the hunchback. \"Today you met your friend Mr Tree.\" He pointed a finger at his chest. \"Which is me. A perfectly respectable citizen whom you knew in England in 1945 when he was concerned with the disposal of Army surplus goods. Remember?\" \"Yes.\" \"I owed you $500 for a bridge game we had at the Savoy. Remember?\" Bond nodded. \"When we meet today I toss you double or quits for it. And you win. Okay? So you now have $1000 and I, a tax-paying citizen, will support your story. Here is the money.\" The hunchback took a wallet out of his hip-pocket and pushed ten $100 bills across the table. Bond picked them up and put them casually in the pocket of his coat. \"And then,\" continued the hunchback, \"you say you\u0027d like to see some horse-racing while you\u0027re over here. So I say to you \u0027Why not go and take a look at Saratoga? The meeting begins on Monday.\u0027 And you say okay, and you go on up to Saratoga, with your thousand bucks in your pocket. Okay?\" \"Fine,\" said Bond. \"And you back a horse there. And it pays off at least fives. So you have your $5000 and if anybody asks where it came from, you earned it and you can prove it.\" \"What if the horse loses?\" \"It won\u0027t.\" Bond made no comment. So he was getting somewhere already-into the gangster world with a bang. The racing end of it. He looked across into the pale china eyes. It was impossible to tell whether they were receptive. They stared blankly back at him. But now for the big step through the cut-out. \"Well, that\u0027s fine,\" said Bond, hoping that flattery was the key. \"You people certainly seem to think things out. I like working for careful people.\" There was no encouragement in the china eyes. \"I\u0027d like to stay away from England for a bit. I suppose you couldn\u0027t do with an extra hand?\" The china eyes shifted away from his and inched reflectively over Bond\u0027s face and shoulders as if the hunchback was judging horseflesh. Then the man looked down at the circle of diamonds in front of him and carefully, thoughtfully, poked it into a square. There was silence in the room. Bond looked at his fingernails. At last the hunchback looked up at him again. \"Could be,\" he said thoughtfully. \"Could be there\u0027d be something else for you. You made no mistakes so far. You go on that way and keep your nose clean. Call me up after the race and I\u0027ll tell you what the word is. But, like I said, just take it easy and do what you\u0027re told. Okay?\" Bond\u0027s muscles relaxed. He shrugged his shoulders. \"Why should I get out of line? I\u0027m looking for a job. And you can tell your outfit that I\u0027m not particular so long as the pay\u0027s good.\" For the first time the china eyes showed emotion. They looked hurt and angry and Bond wondered if he had overplayed. \"Who d\u0027you think we are?\" the hunchback\u0027s voice rose to an indignant squeak. \"Some sort of a cheap crook outfit? Well, hell.\" He shrugged his shoulders resignedly. \"Can\u0027t expect a Limey to understand the way things are over here these days.\" The eyes went dull again. \"Now listen to what I say. This is my number. Put it down. Wisconsin 7-3697. And write this down, too. But keep it to yourself or you may get your tongue cut out.\" Shady Tree\u0027s short, shrill laugh was not merry. \"Fourth race on Tuesday. The Perpetuities Stakes. Mile and a quarter for Three Year Olds. And put your money on just before the windows close. You\u0027ll shift the odds with that Grand of yours. Okay?\" \"Okay,\" said Bond, a pencil poised obediently over his notebook. \"Right,\" said the hunchback. \"Shy Smile. Big horse with a blaze face and four white stockings. And play him to win.\"","sourceLink":"http://novel.tingroom.com/jingdian/1553/46061.html","bookId":1284,"book":{"id":1284,"title":"007之金刚钻 Diamonds Are Forever","description":"简介： 在生产钻石的南非，最近怪事连连，一大批为经切割的钻石失踪了，而且谋杀案频发。这些异常现象引起了英国当局的高度重视，于是007（肖恩?康纳利 Sean Connery 饰）来到了南非。007以钻石批发商的名义展开了一系列的调查，发现一切原来都是他的死对头魔鬼党的首领艾纳斯...","cover":"http://novel.tingroom.com/file/upload/201605/09/14-06-48-15-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1553","creation":"Aug 1, 2019 12:24:47 AM","modification":"Aug 1, 2019 12:24:47 AM"}}
