{"id":81545,"no":23,"title":"Page 23","content":"“I can see there is more to the game than I had realized,” she conceded graciously as Severance scooped up the last of her chips. “You play it very well, Severance. I’m afraid I made the winning quite easy for you.”\n “Like taking nectar from a Saint,” he agreed, laconically returning the cubes into their container. “That’s enough for now.” He picked up a bottle of ale and poured yet another measure into his mug.\n Dubiously Cidra watched the process. “Yes,” she said. “Enough for now. If you will excuse me, I think I will read for a while.”\n “Suit yourself.” Severance picked up his mug and went forward to drape himself in the pilot’s seat. He dimmed the cabin lights and leaned back, mug in hand, to stare out into the endless night that surrounded the ship. Fred clung to his shoulder perch, continuing to doze. Cidra had the feeling that the little rockrug had spent many hours in this way. The runs to Renaissance, QED, and Lovelady were long, and the supply of ale on board was extensive.\n Quietly Cidra prepared for bed and climbed up into her bunk with a book in hand. With the aid of the small fluoroquartz reading chip she had brought, she bent her attention to an analysis of a chapter of Argent’s The Role of Ritual. The familiar passages were still an intellectual challenge to the most expert philosophers of Clementia. Deliberately Cidra lost herself in the deceptively simple writing.\n A while later when she finally grew tired and put away her reading, she saw that Severance was still sitting in the command seat, mug in hand, stargazing.\n The next three ship days passed in similar fashion as they settled into a routine that, while not always meeting Cidra’s approval, was reasonably bearable.\n She worked on Severance’s computer for a good portion of each arbitrarily designated day-night cycle. Cidra also set aside a certain amount of time to devote to her Moonlight and Mirrors exercise. It was impossible to find sufficient room to develop the full patterns, but she did enough to satisfy herself that she was keeping her body in shape.\n Severance’s own physical routine consisted of a harsh workout on a compact exercise machine he’d had installed in the bulkhead wall near the cargo bay. It seemed to Cidra that the sweat he worked up during the hour he spent on the machine was excessive. After the workouts she was vividly aware of the rivulets of moisture that trickled down through the hair on his bare chest. His sleek shoulders gleamed wetly, and she could not seem to take her gaze away from the strong contours of his back and the flat, hard planes of his stomach. The scent of his perspiring body would be strong in her nostrils before he stepped into the lav.\n After the second such workout in a one-day cycle, Cidra tentatively mentioned the scientific fact that there was a point of diminishing returns in exercise. One session a day on the sophisticated machine should be quite sufficient. Severance responded with a short, blunt splash of temper that left Cidra determined to keep her mouth shut on the subject of exercise. He continued to work out two or three times a day.\n After the evening meal Cidra indulged Severance with a couple of games of Free Market. He still won every time, but her stacks of sardite chips disappeared more slowly with each new ‘game. She was getting better, Cidra thought, and was surprised to find satisfaction in that knowledge. When the games were finished, she climbed into her bunk to read, leaving Severance to his lonely vigil in the pilot’s seat. She was usually asleep before he finally dropped into his own bunk.\n On the morning of the fourth day in space, Severance revealed an interest in something other than exercise and his embryonic business programs. Cidra had spent two hours experimenting with management theory designs, using the computer to do long-range projections and then carefully varying certain factors such as fuel cost and employee problems. Severance had been intently peering over her shoulder as usual most of the morning but was now gone. She hadn’t noticed when he’d vanished. After running the fourth viable change in the design Cidra decided she needed a break.\n She turned in her seat to find Severance sitting at the command console, a diazite globe in front of him.\n “What have you got there?” Rising and stretching, Cidra wandered over to look down into the clear ball between his hands. There was a complex little panel built into the base of the globe. She recognized the object just as Severance answered her.\n “A light-painting globe.” He did something to the panel, and instantly the inside of the diazite ball began to shimmer.\n Cidra leaned closer in pleasurable anticipation. There were many fine light-painters in Clementia. “Let’s see what you’ve got stored.”\n “Not much,” Severance said coolly. “I rarely record my work. I’m not that good a painter. It’s just something I do to pass the time on board.”\n “What are you going to work on now?”\n “I don’t know yet. Just thought I’d take a break from watching you run variables.” He hunched over the globe as he began to work the controls on the panel. A band of black light appeared inside the diazite, narrowing and changing color as Severance manipulated the controls.\n Cidra watched in fascination as the black band became a thin, gray-brown sliver of light. The sliver crinkled into a jagged shape that reminded her of mountains seen from a distance. With a patience that astounded Cidra, Severance called up a new band of color, this one faintly orange, and slowly worked it into the landscape.\n “Did anyone ever tell you it’s hard to work with someone looking over your shoulder?” Severance asked mildly.\n “You’ve been looking over my shoulder for four days.” But he had succeeded in making her feel awkward, as well as annoyed. Cidra went back to the computer. It irritated her whenever Severance provoked a retort or an act of rudeness from her. She should be above that sort of behavior.\n During the next few hours she sneaked side glances at the strange landscape forming inside the light-painting globe. She had seen master light-painters at work. The best were usually Harmonics, and the results of their creations were commonplace in Clementia. But the modern schools of light-painting tended to be abstract swirls of color and light blended with infinite care. Most professional light-painters avoided creating exact duplications of scenes from real life. They concentrated instead on prompting an intellectual or emotional response from the viewer with complex, intriguing patterns. The degree of excellence achieved was usually measured by the variety of responses elicited.\n But the landscape forming inside Severance’s globe was definitely representational. There was nothing abstract about it, Cidra thought as the painting drew more and more of her attention. In fact, it was almost too real. \n","sourceLink":"https://allnovel.net/sweet-starfire-lost-colony-1/page-23.html","bookId":1802,"book":{"id":1802,"title":"Sweet Starfire (Lost Colony #1)","description":"Storyline: \n Beautiful Cidra, raised amid a serene, spiritual race, is unprepared for Teague, the rugged adventurer from another race, the Wolves. Side by side on a dangerous quest, they battle both human and alien dangers--and find that their passion holds more danger than they know.\n \n","cover":"https://allnovel.net/images/sweet-starfire-lost-colony-1.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/sweet-starfire-lost-colony-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:33:11 PM"}}
