{"id":81556,"no":34,"title":"Page 34","content":"Desma Kady took a long swallow of her fruit juice. “Well,” she announced at long last, “this is all very interesting, you know. Small towns like Port Try Again tend to thrive on new gossip. And you’re bound to create some. I hope you won’t mind?”\\n\\n “I’m rapidly becoming accustomed to Wolf ways,” Cidra told her. She tried her fruit juice. She couldn’t recognize the flavors but found the drink delicious. “A local product?” she asked, indicating her glass.\\n\\n “Oh, yes. Like it?”\\n\\n “Very much.” She took another sip.\\n\\n “I’m very glad to have you stay here, Cidra. My husband is away for several days doing some fieldwork on toxins. It will be nice to have company. But I have to admit, I’m slightly curious. Why aren’t you staying on board ship? Severance usually does, and if you’re a member of his, uh, crew.?” She left the question hanging delicately.\\n\\n Cidra adjusted the fold of her midday robe. “I believe Severance wants a little privacy for a few days. The cabin of a mail ship is a small place for two people to share for two weeks. He thought we should have a break from each other.”\\n\\n “Ah.”\\n\\n Cidra looked up, hoping her polite expression hid the faint wistfulness she was feeling. “I think he needs the privacy for other reasons too. There’s the matter of his obtaining some, uh, special handling. Wolves are very interested in sex, you know.”\\n\\n “I know,” Desma assured her, smiling faintly. “I’ve been married for some time. Four children, all grown now.”\\n\\n Cidra swallowed fruit juice. “I’m sure you understand the situation.”\\n\\n “So this really is a crew contract you’ve signed? Not a convenience contract?”\\n\\n “Definitely.”\\n\\n “This gets more intriguing by the minute. You know, Severance signed a convenience contract once. No one knows for certain what happened, but the contract was terminated by mutual consent by the time Severance Pay hit Renaissance. I almost felt sorry for the young woman. She was absolutely enraged, according to those who saw her. Not many did. She never even left the terminal. Severance bought her a return ticket and she left on the next outbound commercial freighter. People said it was a miracle that the woman and Severance had avoided killing each other somewhere between Lovelady and Renaissance.”\\n\\n “He told me the story.”\\n\\n “Did he?” Desma seemed surprised.\\n\\n “By way of warning, I think. I informed him I wasn’t interested in a convenience contract.”\\n\\n “And he took you on as crew? There’s a registered agreement?”\\n\\n “Well, at the moment it’s still an informal, verbal agreement, but Severance and I both take it quite seriously.”\\n\\n “More and more interesting,” Desma mused. Then she set down her empty glass. “Did you really read that dull piece I did on bioluminescence?”\\n\\n Cidra nodded eagerly. “One of the advantages of being an archivist. One gets to explore so many different fields. Unfortunately I’m not an expert in any one area, except First Family fiction, which is not exactly on the cutting edge of research. But I can assure you that your article was far from dull. There were many requests for it from Harmonic researchers doing work in related fields.”\\n\\n Desma looked pleased. “Would you be interested in seeing the lab?”\\n\\n “I would. enjoy that very much.”\\n\\n The long lab structure was just as Desma had promised, hot and muggy like the outside air. In addition the heavy atmosphere was overlaid with a distinctive, unpleasant odor that caused Cidra to wrinkle her nose as she stepped inside.\\n\\n “Bugs,” Desma explained cheerfully. “Put a lot of them in one place and they tend to smell. We keep things as clean as possible, but you can’t ever escape the odor completely. You get used to it.”\\n\\n “That’s what Severance said about the humidity.” Cidra looked around with grave interest. Long aisles of cages constructed of clear panels stretched from one end of the lab building to the other. In some cases the panels were of tempered diazite, just like the windows. Cidra contemplated what that said about the creatures housed inside. It took a great deal to cut through tempered diazite.\\n\\n “Acid,” Desma said, pausing beside a yellowed diazite cage to peer inside. “That’s the reason for the tempered walls. Some of these critters produce an acid that can dissolve normal diazite or clear silitron.”\\n\\n “Severance said there were many corrosive elements on Renaissance. He said it was hard on machinery.” Cidra looked into the cage. “I don’t see anything in there.”\\n\\n “Keep looking. There, on that branch. See the eyes?”\\n\\n Cidra saw the eyes, all right. She gasped and took an automatic step backward before remembering that the malevolent gaze was trapped on the other side of a strong, clear wall. “I’ve never seen anything quite like it,” she breathed, unable to look away now. The eyes were hard, glittering, faceted structures of deep amber. They stared out at her as if the insect brain behind them longed for nothing more than to be able to suck the blood from her body. Huge, folded wings, more delicate-looking than the spun crystal moss of her gown, shimmered with an eerie phosphorescence. Long, spindly legs were bent into a springing position. The creature had been hard to detect for a moment because its general color was the same as its background. It was an uncomfortably large creature, almost a meter in height.\\n\\n “Cute little Bloodsucker, isn’t he? Raised him from a pup,” Desma declared.\\n\\n Cidra swallowed. “Is Bloodsucker its name or what it does?”\\n\\n “Both. He sucks blood when he’s hungry,” Desma said, “which is nearly all the time. Nothing on Renaissance passes up the chance for a meal. No guarantee about when the next one will be coming along. I’m doing some work on the phosphorescent effect produced in the wings. My husband is working on the venom it uses to kill its prey. It’s the acid in the venom that can eat through most cage materials.” She straightened. “Over here I’ve got a rather nice assortment of Stoners. Pretty tame compared to the Bloodsucker but interesting all the same. A Harmonic expert in Clementia and I have been exchanging information quite regularly for a year or so. We’re going to collaborate on an article soon.”\\n\\n “You’re working with someone at Clementia?” Cidra asked.\\n\\n “Otan Greenlove. Do you know him?”\\n\\n Cidra nodded. “A most respected teacher. I had a class in bio ecological theory with him.” She had also had a very un-Harmonic crush on the man that she could only hope she’d managed to conceal at the time. She had found concealing such things difficult when she was in her sixteenth year, but she’d practiced hiding her emotional responses from a very early age. She had known almost before she could walk that strong emotional responses were not viewed as normal behavior among Harmonics. \\n\\n","sourceLink":"https://allnovel.net/sweet-starfire-lost-colony-1/page-34.html","bookId":1802,"book":{"id":1802,"title":"Sweet Starfire (Lost Colony #1)","description":"Storyline: Beautiful Cidra, raised amid a serene, spiritual race, is unprepared for Teague, the rugged adventurer from another race, the Wolves. Side by side on a dangerous quest, they battle both human and alien dangers--and find that their passion holds more danger than they know.\\n","cover":"https://allnovel.net/images/sweet-starfire-lost-colony-1.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/sweet-starfire-lost-colony-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:33:11 PM"}}
