{"id":81565,"no":43,"title":"Page 43","content":"“Never.”\n “Kinda overwhelming at first. But you get used to it. There’s a thousand different fortunes to be made here. Maybe ten thousand if you’re willing to work for bonus credit.” His narrowed gaze swept along the passing riverbank. “Assuming a man survives to make his haul.”\n “I understood that statistically most workers are safe now, as long as they follow the company rules and safety regulations,” Cidra noted. “I thought the accident rate had declined sharply during the last few years with the invention of the deflectors.”\n Overcash laughed, a big booming sound that echoed along the water and caused a stir of activity in a tree on the bank. Something with a wingspan that seemed much too wide lifted into the air, its long, toothed beak outlined evilly against the sky.\n “The statistics are probably accurate. Any renegade who wants to work hard and follow the rules can make a nice salary and probably stay out of trouble. But that’s not how you make real credit on this planet. The companies all have what they like to call bonus plans. Take a few risks for your firm and you’re guaranteed a bonus. ‘Course, you got to survive to collect the bonus. I’m not sure how many bonus men who don’t come back make it into the statistics. Companies got a way of doing things to statistics.”\n Severance threw a glance at the pilot. “And Renaissance has a way of doing things to bonus men.”\n “Yeah, well, it’s like Free Market. Got to take a risk now and then, or it’s not worth playing the game. You know that, Severance.”\n Cidra’s mind winced at the philosophy. Having not played Free Market since Severance Pay had set down at Try Again, she had deliberately forgotten some of her odd, increasing enthusiasm for it. Severance obviously hadn’t forgotten, however. He grinned wickedly.\n At least he was smiling at her, even if he was showing his teeth. It was far more pleasant than being chewed on. Cidra looked down over the side of the skimmer. The thick water was ruffled on the surface from the effects of the skimmer’s lift thrust. As the skimmer swept past she thought she saw another set of cold, wide-set eyes hovering a few centimeters under water. In that brief moment Cidra glimpsed the outline of a frighteningly long body. Perhaps Severance was right; getting a close-up view of a dracon might not be very pleasant. The eyes she had seen reminded her of some of Desma’s lab creatures.\n “Everything here on Renaissance seems to be out to eat everything else,” she remarked.\n “Just don’t decide to trail your fingers in the water when we stop for the evening,” Severance advised.\n “I won’t.” She glanced at Overcash. “Do we stay on board the skimmer tonight?”\n “No. Some dracon or a skater might decide to get playful. Skimmers are safest when they’re in motion. We’ll stay on shore.”\n “Is that any safer?”\n Overcash chuckled. “Sure. We’ve got the heavy-duty deflectors and the armor tents. No problem. If something does decide to come looking for a midnight snack, we’ll have plenty of warning. Not much can get through a deflector. Severance, here, wouldn’t have brought you along if there was any real danger.”\n “On the contrary,” Severance informed him, “I had to bring her along because she digs up the worst trouble when she’s on her own.”\n They turned off the main river later that afternoon, swinging into a tributary that wasn’t quite as thick with sediment as the first waterway had been. This river was also narrower than the first, and the walls of vegetation on either side seemed to loom higher and closer. But that might be just a trick of the waning light, Cidra told herself. She realized that she wasn’t looking forward to camping out this evening.\n As if he sensed her uneasiness, Severance became more talkative. He gave her a dissertation on how effective the big deflector screens were and how they had revolutionized field camps on Renaissance. The invisible grids they produced were based on the same principle as the Screamer. They were set to repel any creature with nerve impulses different than those of human beings.\n “I get the feeling that some things out there haven’t even got nerves.” But Cidra made the observation with a smile to show Severance that she wasn’t really worried. Wonderful what Harmonic training could do when it came to covering up one’s true feelings. Or perhaps she was so adept at it because she had been covering up the Wolf side of herself for so many years.\n Overcash chose the campsite just as the shadows along the river became uncomfortably long. With the instinct of a good guide he managed to find a rare break in the undergrowth. Carefully he slowed the skimmer, letting it sink down onto the water. The craft rocked slightly in the lethargic current while the pilot made it fast. A flexible landing plank emerged when Overcash activated a control panel.\n “I don’t see enough room here to erect a couple of tents,” Cidra observed, eyeing the bank. The vegetation was thinner along this stretch of bank, but it was still fairly spectacular to her eyes. She watched as a small, wriggly creature flashed on the bank and slid into the water. Cidra had a mental picture of it sliding just as easily into a tent.\n “Don’t worry, we’ll make a little space for ourselves.” Overcash went into the cabin and came back with a long-barreled machine that had a squat base.\n “What’s that?” Cidra asked.\n “A crisper.” Overcash switched on the machine, and a narrow band of white flame jumped out, searing the vegetation it touched. With a few sweeping movements the guide cleared a relatively large area along the bank. The undergrowth that had fallen into the path of the crisper smoked for a moment, wilted, and then disintegrated.\n “I guess that’s one way of dealing with too many weeds.” Cidra was a little appalled by the small devastation.\n “Too bad this thing hasn’t got a longer range,” Overcash remarked, stowing the machine. “It would make a useful weapon.”\n The deflector screens were hauled out next. They were charged on the skimmer’s power cells and then carried ashore. Severance helped the pilot set them up so that they produced a grid that completely encircled the campsite. Occasional tiny hissing noises gave notice that the screens were working. Inside the protected area the light metal tents were erected , two of them, Cidra noticed. Severance moved his and Cidra’s small travel packs into one. Neither he nor Overcash seemed to have any interest in how Cidra felt about the sleeping situation. It was apparently a foregone conclusion that she belonged in Severance’s tent. She shouldn’t have been surprised. Among Wolves it was clear that when a man and a woman spent time together, it was assumed that they had a sexual relationship. Well, she thought bracingly, she’d already lived with him for two weeks in the confines of a mail ship. This wasn’t much more intimate, all things considered. She just wished she had a proper sleeping robe. It occurred to her that she might be expected to undress before she climbed into the air-cushioned sleepers. The thought of sleeping naked was more unnerving than most of her other recent experiences. She couldn’t do it. The background clamor of the jungle changed perceptibly as the night shift took possession of the premises. The deflectors had no effect on the sounds that permeated the shadows, and Cidra found the clickings, clackings, screams, and cries disturbing. Severance had had the forethought to insure that some vegetarian prespacs were on board the skimmer, and she flashed him a look of gratitude when hers came out of the portable food heater. He had also made sure a few containers of his beloved ale were on board. It was going to be a long night. \n","sourceLink":"https://allnovel.net/sweet-starfire-lost-colony-1/page-43.html","bookId":1802,"book":{"id":1802,"title":"Sweet Starfire (Lost Colony #1)","description":"Storyline: \n Beautiful Cidra, raised amid a serene, spiritual race, is unprepared for Teague, the rugged adventurer from another race, the Wolves. Side by side on a dangerous quest, they battle both human and alien dangers--and find that their passion holds more danger than they know.\n \n","cover":"https://allnovel.net/images/sweet-starfire-lost-colony-1.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/sweet-starfire-lost-colony-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:33:11 PM"}}
