{"id":81573,"no":51,"title":"Page 51","content":"A pair of eyes watched him from the river. Severance didn’t look at them. For the rest of his life, whenever he saw dracon eyes, he would think of those sickening moments when Cidra had been the center of dracon attention. The memory made his hand tighten on the grip of the pulser. Deliberately he forced himself to relax. A too-solid grip made the weapon more difficult to aim properly. Cidra had floated. The image of her hovering quietly in the water as the dracons moved closer was still a source of amazement to Severance. Doing so had been her only chance, of course. She had bought him the time he needed to find the monsters another meal. But the terror would have overcome most people, should have overcome a gently raised lady from Clementia. Most people would have panicked. But Cidra had heard his desperate instructions and she had obeyed them. Racer had put her to that savage test and nearly gotten her killed. And it was Racer who had tried to carry her off, knowing with a man’s sure instinct that Severance’s helpless rage would be a worse torment man the knowledge that the deflector screens were going to fail by nightfall. Severance had half convinced himself that Cidra might be better off with her captor than left behind to face the Renaissance night, but that belief had been his rational, thinking side speaking. His emotional side hadn’t come close to seeing that logic. His guts had been twisted with fury at the thought of Racer trying to rape Cidra. And it would have been rape. Cidra would never willingly submit to Racer. She would have seen it as a betrayal of herself and of Severance. “Death before dishonor.” He wondered where she’d picked up that phrase. Probably from those First Family tales she was so fond of reading. No telling where the First Family writers had picked up the concept. Must have been a part of the folklore they had brought with them to their new world. Even though he had feared for her life when she had dived from the skimmer, Severance acknowledged that a part of him had been exultant. Cidra belonged to him, and on some level she had acknowledged that. He didn’t know any other woman who would have chosen to stay behind with him in a Renaissance jungle when the alternative was some hope of survival. He swore silently. He was getting as primitive in his reactions as everything else on this planet. The time slipped past. Severance heard no distant hum from the skimmer. But he did perceive a change in the atmosphere, a lengthening shadow from the heavy, bloated clouds building high overhead. Just what he needed, Severance thought—a storm. Renaissance did thunderstorms the way it did everything else—on a grand scale. Heavy rain would have no effect on the deflector screens surrounding Cidra, and she could stay reasonably dry in the tent, but the storm was bound to be unnerving for her. And it could slow him down. He had to get back to Cidra before the deflectors went down. With common sense, a certain amount of knowledge, luck, and a pulser, a man might survive Renaissance during the day. Night was another story. The only consolation was that the storm would also slow the failing skimmer. Maybe Racer would start to panic sooner than he might otherwise. The cloud shadows had nearly blocked out the sunlight entirely when Severance detoured around a broad-leafed tree that was as thick in the trunk as a small building. Suddenly he realized that he could hear metallic sounds. Not the hum of a skimmer—for an instant he thought he might have had the unbelievably good luck of happening across someone else camped on the riverbank. He slowed, using the thick foliage for concealment, and edged toward the sounds. Severance saw the skimmer first. It had been pulled into shore and made fast. Racer had apparently used the crisper to carve out a small clearing on the bank. He wouldn’t want anything sneaking up on him while he was occupied with the skimmer, and from the hot, sweaty look of him, he had already been working on the machinery for quite a while. He had left the engine panel in the stern open and was bent over the controls inside. Seeing Racer, Severance felt a wave of seething fury sweep through him. He grimly waited for it to pass. It would only cause his hand to shake and his brain to function on partial power. It wasn’t the way for a predator to confront prey. And, this time around, Racer was the prey. Severance gave himself another moment or two to control the anger, and then, pulser raised, he stepped out into the open. “Don’t waste your time on it, Racer. You won’t be needing transportation.” Racer’s head came up with a hard jerk that betrayed his nervous state. For a second he simply stared at Severance from the stern of the skimmer. There was desperation in his face, something Severance had never seen in him before. He stepped closer. Racer threw himself down onto the deck of the skimmer. Severance fired the pulser, not at the empty stem but at the diazite cabin wall. The wall crackled and exploded, sending a shower of jagged shards down onto the man hiding behind the gunwale. There were several startled screams and a brief scurrying in the vegetation behind Severance as a few of the local inhabitants opted to vacate the area. He knew that while some fled, others would be big enough and hungry enough to indulge their curiosity. They would come closer to investigate. But the diazite shower had had the desired effect. Only something as powerful as a pulser could break up diazite, but when it did fracture, the shards were like jagged blades. Racer didn’t wait for the next wall of the cabin to be splintered. Pulser in hand, he leapt over the side, using the craft as cover while he waded the short distance to shore. He risked a shot over the bow, driving Severance behind the house-sized tree, and then ran for shelter at the edge of the small clearing he had made with the crisper. “It’s all over, you renegade bastard,” Severance called. “Did you really think I’d let you get away with it?” “You don’t stand a chance without the skimmer and screens, Severance. Throw down the pulser and I’ll consider a deal.” “You don’t have anything to bargain with. I’m claiming the skimmer.” “You’ll never get close to it. From here I can cut you down before you get aboard.” Racer wasted a pulser shot demonstrating his line of sight. A small vine that had been missed earlier by the hurried crisping job fizzled, smoked, and died. “Won’t do you any good, anyway. You really did a job on those fuel cells. The only thing working on that damn boat is the communication equipment. I was just about to put in a call. We’re both stuck here, Severance, until I make that call.” Severance listened as Racer moved uneasily on the other side of the clearing. “I was always better with equipment than you were, Racer. Remember?”","sourceLink":"https://allnovel.net/sweet-starfire-lost-colony-1/page-51.html","bookId":1802,"book":{"id":1802,"title":"Sweet Starfire (Lost Colony #1)","description":"Storyline: Beautiful Cidra, raised amid a serene, spiritual race, is unprepared for Teague, the rugged adventurer from another race, the Wolves. Side by side on a dangerous quest, they battle both human and alien dangers--and find that their passion holds more danger than they know.","cover":"https://allnovel.net/images/sweet-starfire-lost-colony-1.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/sweet-starfire-lost-colony-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:33:11 PM"}}
