{"id":81530,"no":8,"title":"Page 8","content":"“There’s room in this pack for them,” he told her.\\n\\n She glanced at him in surprise as she began pulling the beautifully bound volumes from the autostorage unit beside the bed. “Oh, no, there couldn’t possibly be enough room. I have a separate pack for them.”\\n\\n “I could get a couple hundred data slips in here,” he assured her before glancing over and seeing what she was doing. “Saints in hell! Those aren’t slips. They’re books. Real books.”\\n\\n “Of course.” She touched one of the handworked covers reverently. “No information storage system ever invented can compare aesthetically with a genuine book. They are such beautiful things.”\\n\\n It was Severance’s turn to look shocked. “They must weigh as much as an exploroprobe. What do you think Severance Pay is, a cargo freighter? Leave ‘em here. I just arranged for a crate of Rose ale to be put on board. There isn’t room for your damn books.”\\n\\n Cidra clutched the volume she was holding to her breast. “If the books stay behind, then I stay too.”\\n\\n Severance lifted his eyes beseechingly. “I knew I was going to regret this. The Renaissance sinkswamps will freeze before I make a mistake like this again. All right, all right, bring the damn books. But move, will you? I’ve got a hot run, and it’s COD.”\\n\\n “What’s that mean?” Cidra asked, hastily placing the books in a travel pack.\\n\\n “It means,” Severance said as he locked the pack he had just finished stuffing with delicate clothing, “that I don’t get paid unless the shipment gets delivered on time. Credit on Delivery. I don’t intend to make the run to Renaissance for free, so let’s get going. Here, you take the robes. They’re a lot lighter. Let me have those damn books. Anything else?”\\n\\n “No, that’s everything.” She edged around Scates’s prone body. “You’re sure he’ll be all right?”\\n\\n “Unfortunately yes. Now just act normal out in the hall, understand? Pretend you’ve changed your mind about staying here and have agreed to spend the night with me. You’ve paid for the room?”\\n\\n Cidra nodded and then asked, “It’s true, isn’t it?”\\n\\n “What’s true?” Severance closed the door and set the locks. Then he shouldered the travel pack and started down the hall, Cidra following close behind.\\n\\n “Wolves think constantly about sex. It’s what that man Scales wanted from me, and it is the excuse you think the hotel security system will accept for our unexpected departure.”\\n\\n “By now you ought to have learned for yourself that Wolves aren’t nearly as elevated in their thinking as your friends back home in Clementia.”\\n\\n “It’s not a question of refined or elevated thinking,” she responded seriously as he herded her out of the hotel lobby and onto the glowing sidewalk. “It’s a matter of the relative importance of the subject to an individual. Sex is obviously a great deal more important to Wolves than to Harmonics.”\\n\\n Severance opened the panel of a waiting runner and stuffed Cidra and her packs inside. Then he slid in beside her and punched in their destination. When he was finished, he leaned back in his characteristic lounging fashion and folded his arms across his chest. “Maybe if sex were a little more important to Harmonics, they would be able to increase their birthrate. Everyone knows they don’t produce enough children to keep up their population. If it weren’t for the random occurrence of natural Harmonics among the Wolves, there probably wouldn’t be enough Saints to keep Clementia running.”\\n\\n “The system works fine the way it is,” Cidra told him firmly. “It’s good to have the new blood constantly being introduced into the Harmonic society.”\\n\\n “If everything is so great in Clementia, what are you doing here?”\\n\\n She looked out the runner’s diazite window, staring at the passing town, which had been founded according to a careful plan but had since grown into an eclectic and sprawling mix of architectural styles on meandering streets. The glow from the sidewalks illuminated everything from old,-squat buildings fashioned by the early colonists of enduring anthrastone to the newer, gleaming structures built of obsidianite. Both materials had proven plentiful and cheap once the colonists had discovered how to pull them from the heart of the eastern mountains. One adventurous designer had done an entire hotel in the ubiquitous fluoroquartz. It was quite garish and tacky to Cidra’s eyes. But, then, much of the town was. The jumble of styles and materials was visually unsettling when Cidra mentally compared it to the beautiful proportions and harmonies that dominated Clementia’s graceful, simple architecture.\\n\\n All this passed before Cidra’s eyes fleetingly, as she gathered her spirits to answer Severance’s question, since he was helping her, she felt she owed him the truth.\\n\\n “You don’t understand, Severance,” she finally said quietly. “I can’t go back to Clementia. Not as I am. I don’t belong.”\\n\\n Raising a skeptical eyebrow, he turned to her. “A person either is or is not a natural Harmonic,” he pointed out gently. “If you aren’t one, there’s no use fighting it, is there?”\\n\\n Her head snapped around, and all the years of grim determination blazed for a moment in her vivid green eyes. “I will find a way to be one of them, Teague Severance, if it takes me to the end of the Stanza Nine star system and beyond. I will find the answer. It’s out there. I know it is. I have traced the legend since childhood, and now, at last, I’m actually going after it.”\\n\\n He looked at her blankly. “Going after what? What legend?”\\n\\n Cidra bit her lip and sank back into her corner of the seat. “It’s out there, Severance. The tool with which I can become a Harmonic. The instrument that can fit my mind into the natural patterns and rhythms of everything I see or touch, Maybe it won’t quite duplicate the way a Harmonic’s mind vibrates in tune with whatever it chooses to focus on, but I think it can imitate the telepathic element. I think it can help me bridge the gap that my lack of natural ability has always put between me and the world I was meant to join.” Her hands tightened in her lap. “I have almost all of it, Severance. I have me training, the rituals, the education. I have studied the Klinian Laws and the Rules of Serenity as the most devout of students. All I lack is the ability to achieve communion with the others and that intuitive element that makes the Harmonic mind so unique. But I’ll get it. Or something almost as good. I swear I will.” \\n\\n","sourceLink":"https://allnovel.net/sweet-starfire-lost-colony-1/page-8.html","bookId":1802,"book":{"id":1802,"title":"Sweet Starfire (Lost Colony #1)","description":"Storyline: Beautiful Cidra, raised amid a serene, spiritual race, is unprepared for Teague, the rugged adventurer from another race, the Wolves. Side by side on a dangerous quest, they battle both human and alien dangers--and find that their passion holds more danger than they know.\\n","cover":"https://allnovel.net/images/sweet-starfire-lost-colony-1.jpg","author":"Jayne Ann Krentz","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/sweet-starfire-lost-colony-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:33:11 PM"}}
