{"id":98409,"no":34,"title":"Page 34","content":"I’d never killed anything besides demons.\n The law was strict, no loopholes, about PAs who killed humans. The sentence was always death. Extenuating circumstances, self-defense, who started it—none of that stuff mattered. If that thug was dead, so was I.\n HadI killed him? I couldn’t remember.\n I needed to know. But the first thing to do was figure out how to get out of here. Even if the cops were after me, I wasn’t going to spend the night sitting behind a Dumpster, hanging out with Boston’s rat population. But I wouldn’t get very far stark naked.\n I always carry a spare set of clothes. Always. Precisely in case something like this happens. But not today. My head was so full of worries about Kane and butterflies about Daniel that I’d just stuck twenty dollars, my keys, and my ID in the back pocket of my jeans when I left the apartment. Just a simple hypnosis of a sweet little old lady; I’d be back in two hours. No need to tote all my gear across town.\n Brilliant, huh?\n Okay, no use beating myself up about that. Right now, my problem was how to get home. It was tempting to shift again. I could turn into an ordinary house cat and run through the city unnoticed. The worst that would happen was I’d get chased by a dog or two. But three things made me hesitate. One, I was still hungry, and this alley was crawling with rats that would taste mighty good to a cat. I didn’t want to burp up rat flavor after I’d shifted back to my normal form.\n Two, it was always a good idea to let a day pass between shifts, to let my form readjust to its usual shape before twisting it again. Aunt Mab told me once about a Cerddorion relative—a second or third cousin, I think—who’d done too many consecutive shifts and had ended up with pointy ears and fur on his face. Permanently.\n The third reason, though, was the biggie. This was my second shift this month—three weeks ago, I’d had to shift into an eagle to fight some particularly tough Harpies. The full moon, after which my powers would renew themselves, was still a couple of days away. And I was planning to kill Difethwr before that, if I could. I wanted to have at least one shift left for that battle. I needed that weapon in my arsenal— for fighting a Hellion, I needed every morsel of help I could get.\n So shifting was not an option. I’d have to figure out another way to slink unnoticed through the nighttime streets of Boston. I half-stood, peeking over the top of the Dumpster, and looked around. Nothing but deserted parking lots, boarded-up buildings, and looming warehouses. Not exactly the fashion district. There wasn’t even a pedestrian whose coat I could borrow or steal. I slapped the Dumpster in frustration.\n And bam! I had my solution.\n I stood on tiptoe to reach into the Dumpster. The thing was full of crushed boxes, bottles, sheets of plastic—jeez, didn’t people around here know about recycling?—all of it coated with slimy goo that I preferred not to contemplate. Something rustled near my hand, and I batted away another rat. It clambered to the Dumpster’s rim and jumped, squealing, to the street. “Get your own Dumpster,” I said. It sat up on its hind legs and stared at me, eyes gleaming.\n In another minute, I’d found what I was looking for: a black plastic garbage bag. I hoisted it from the Dumpster. It was tied, and I worked at the knot. The cold was starting to get to me, making my fingers stiff. I picked and picked at the tight knot until it finally gave.\n As soon as I opened the bag, the pungent odor of overripe garbage attacked my nose. My eyes watered, and I gagged. I had to turn my face away. Even as I did, my hunger flared for a second. I guess garbage smells like din-din to a panther. Gross. At my feet, the rat I’d chased away advanced, its whiskers quivering.\n “It’s all yours,” I said. I turned the bag upside down, letting a shower of garbage rain over the rat and flow into the street. The rat practically did somersaults of joy.\n The empty bag was equally slimy and disgusting inside and out. I didn’t know if I could go through with what I was about to do. But I couldn’t think of a plan B. Using my nails, I tore a hole in the bottom of the bag, then another in each side. Then I closed my eyes, pinched my nose, and slid the bag over my head. I pushed my head and my arms through the holes, trying not to think about the smell or about the slimy, unknown substances making contact with my skin. I tried, but I failed. I bent over and retched, but it had been so long since I’d eaten that nothing came up. That didn’t stop my body from trying to puke up my empty stomach.\n After a couple of minutes, I straightened. I grasped the plastic of the bag with two fingers and pulled it away from my torso. Voilà. Cinderella, ready to go to the ball. All I needed was a rotten pumpkin and another rat for a coachman.\n Well, at least I was decent. A whole new definition of decent, I thought, trying to get used to the smell so I wouldn’t have to hold my nose. I ventured out from behind the Dumpster and started walking. Barefoot, freezing, and completely disgusting, but covered.\n I needed to get home, but first I wanted to see the scene where I’d shifted. If I was incredibly lucky, I’d find some piece of clothing that hadn’t shredded when I’d changed. If I was incredibly unlucky, I’d come across a police crime scene, complete with a chalk outline of that thug’s body.\n But my luck was middle of the road tonight. When I got to the place where those three guys had jumped me, there was nothing—barely a sign they’d ever been there. Some skid marks, a bloodstain in the road (not too large, I noted), and a couple of tatters of leather. At least there was no chalk outline, no police tape. That was something, anyway. I picked up a strip of black leather and rubbed it against my cheek. Damn. Those had been my favorite jeans.\n If the cops had been here, collecting evidence, they’d have picked up these scraps of leather, right? The thought made me feel a little better. Then another thought struck me like a blow to the head: They’d have picked up my paranormal ID, too. They’d know exactly who had attacked that norm. I scouted around but couldn’t find the card anywhere. Maybe the energy-field blast of the shift had shredded it, along with my clothes. God, I hoped so.\n There was nothing else left. The only thing I could do was go home—a two-and-a-half-mile hike. I jogged down the middle of deserted D Street, trying not to notice the feel of slimy plastic sliding and sticking against my skin. And the smell—God. If anything, it got worse. Demons stink, but I’d never smelled anything like the odor of garbage mingled with sweat that currently surrounded me like a cloud of flies.\n As I approached a cross street, a car slowed and started to turn toward me. When the headlights swept across me, the car stopped, then turned and skidded away in the opposite direction. Apparently, the driver wasn’t impressed by my fashion choices tonight.\n But the encounter made me realize that I needed to be more careful. If someone was looking for me—the cops or maybe those thugs, back for a second round—I was making it way too easy for them. I ducked into the shadow of a building. As I made my way back to Deadtown, I chose backstreets and alleyways, staying close against buildings, darting across intersections only when the coast was clear. I ran from shadow to shadow, exactly like some kind of monster trying to stay out of sight of the humans.\n BY THE TIME I KNOCKED ON MY FRONT DOOR, I WAS ready to call it a night. Without my ID, I’d had to sneak back into Deadtown—not impossible, but tricky. And then . . . It’s not easy looking like a freak on a street full of zombies, but tonight I’d managed to accomplish just that. Zombies pointed, laughed, crossed the street to get out of sniffing range. Even Clyde couldn’t keep a poker face as I stomped through the lobby. No “Good evening, Miss Vaughn”—it was more like\n “Oh, my lord, what on earth have you done now?” And I heard snickering, definite snickering, as I waited for the elevator. Clyde could just kiss his Halloween bonus good-bye.\n I was in a foul mood, not least of which because I couldn’t call it a night. I still had to go to Lucado’s condo and watch for Difethwr. The way I was feeling right now, if that Hellion showed up tonight, it wouldn’t stand a chance.\n “What in the name of Hades is that horrible smell?” Juliet said as she opened the door. When she saw me, her jaw dropped so far I could see past her fangs all the way to her tonsils. “Are you wearing a garbage bag?”\n “I don’t want to talk about it.”\n “How did you—?”\n “I said I don’t want to talk about it. All I want right now is to stand under an industrial-strength, boiling-hot shower until my fingertips wrinkle up like prunes. Then I’ve got to try to sort out the mess my life has become.”\n I flounced past her with all the dignity I could muster—which was slightly less than zero, given the circumstances. I went into the bathroom and closed the door. Then, remembering how Kane had barged in earlier, I clicked the lock. I turned on the hot tap full blast and peeled off that damn trash bag. Steam billowed in hot, delicious puffs from the shower stall as I crumpled up my never-again gown, lifted the lid to the trash can, and slam dunked the bag, letting the lid bang shut. I took a deep breath, then sniffed, and sniffed again. I could still smell it. Then I realized the smell was coming from me. The stench of garbage had sunk into my pores. I jumped into the shower and started soaping up. I lathered and scrubbed, lathered and scrubbed, lathered and scrubbed, until the bar of deodorant soap I’d started with dissolved into a tiny sliver.\n It felt good to put on real clothes—a scoop-neck yellow cashmere sweater and black jeans—even if the leather of the jeans was kind of stiff. They were a new pair; it’d take a while to break them in. Zipping up my black ankle boots, I felt like a whole new person.\n I grabbed a spare apartment key out of my dresser and stuck my driver’s license in my pocket—that would get me through the checkpoints until I could replace my paranormal ID card. Then I went into the living room, where Juliet sat watching the local news. “Any good murders today?” I asked, trying to sound casual. To anyone else, it would have seemed an odd question. But like most vampires, Juliet enjoyed hearing the gory details of a murder. Preferably one with lots of blood. \n","sourceLink":"https://allnovel.net/deadtown-deadtown-1/page-34.html","bookId":2609,"book":{"id":2609,"title":"Deadtown (Deadtown #1)","description":"Storyline: \n Deadtown (Deadtown #1) \n If you were undead, you\u0027d be home by now... \n They call it Deadtown: the city\u0027s quarantined section for its inhuman and undead residents. Most humans stay far from its borders-but Victory Vaughn, Boston\u0027s only professional demon slayer, isn\u0027t exactly human.\n \n","cover":"https://allnovel.net/images/deadtown-deadtown-1.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/deadtown-deadtown-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:32:54 PM"}}
