{"id":98415,"no":40,"title":"Page 40","content":"“There he is.” She pointed. “Over there.”\n He sat with his back to me, but I recognized his curly blond hair. Half sitting on his desk, facing my way, was a woman. Her raven black hair flowed past her shoulders, and she wore a tight black skirt with knee-high boots and a clingy red sweater that showed off her curves. She laughed, white teeth gleaming against red lips, then leaned over to say something to Daniel. Well, how nice and cozy. This had to be the woman who’d answered the phone this morning. Today must be Bring Your Bimbo to Work Day.\n I strode over to Daniel’s desk. “Hello, Detective. Sorry I’m late.”\n He looked up at me and beamed, his smile like the sun rising over a dark hill. He stood and said, “Perfect timing. Let me take your jacket.”\n “That’s okay. Our meeting isn’t going to take long, is it?” I said it half in the direction of Ms. Desk Ornament, emphasizing our meeting, hoping she’d take the hint and leave.\n Daniel’s smile dimmed a few watts. “No, not too long, I guess.”\n The woman wasn’t leaving. In fact, she was looking at me with a smile that rivaled Daniel’s in candlepower. There we were, one big, happy family, having a grinfest around Daniel’s desk. In another minute, we’d burst into song.\n Daniel spoke. “Vicky, I’d like you to meet”—Here it comes, I thought, wondering whether he’d say wife or girlfriend—“Roxana Jade. She’s the leader of the Witches of the Shield.”\n I blinked. One of the witches. Not Daniel’s wife. Or his girlfriend. More relief than I’d care to admit washed over me. But only for a second. After all, somebody had answered his phone this morning.\n Roxana pushed away from the desk and leaned toward me, her hand extended. “Victory Vaughn. Wow, I can’t believe it. I’ve always wanted to meet you.”\n I shook her hand. “Um, you have?”\n “Are you kidding? Your demon-fighting skills are legendary in my coven. I mean, it’s one thing to create a charm that repels demons, but you exterminate them.” She shook her head, pursing her lips. “You actually killthe buggers.”\n I shrugged, feeling a little too aw, shucks and not knowing what to say. I’d been all prepared to hate this woman and here she was, my biggest fan.\n Daniel rolled a chair over from another detective’s desk. “Why don’t you both sit down? Vicky, Roxana can bring you up to speed on what she told me yesterday.”\n As we sat, Roxana was still gushing. “I told Daniel to call me the minute you got in touch. Day or night, I didn’t care. When he called this morning, I was so thrilled. I look a mess, I know, but I had to rush over here right away. I wouldn’t miss meeting you for anything.”\n If Roxana was a mess now, with her straight, gleaming hair and perfect makeup, I hated to think what I must look like. I hadn’t even glanced in a mirror since last night’s shower. I touched my own hair, fluffing it, then made myself stop.\n “. . . and then, when I saw you on the news yesterday, I was bowled over. You were so brave!” She finally paused for breath, gazing at me like I was a rock star.\n “Just another night in the Zone,” I said, and she laughed like I’d said something witty.\n Daniel watched her laugh with the expression of someone witnessing a miracle. Maybe he was one of those guys who flirted with anything female, no matter who he had waiting at home. He caught me scowling at him, and we both looked away.\n I turned to Roxana. “I don’t know much about witchcraft. All I know is what I saw on PNN after the plague, that you put up a shield to keep Hellions out of the city.”\n “Yes, because large-scale destruction attracts Hellions in droves.” She put a hand over her mouth, blushing. “But of course you know that.”\n “They’d say legions. Instead of droves, I mean. That’s what Hellions call themselves when they group together in an army.” She nodded, and I went on. “What I don’t know about is the shield. When it was created, I assumed—everyone assumed—that Boston was protected, a Hellion-free zone. So what happened?”\n “Well, the shield is just a charm. A big one, woven from the magic of the best witches in the city, but still a charm. And charms grow old and fade. They need to be renewed. So we chose representatives from each of the local covens to maintain the shield. That’s us, the Witches of the Shield. We meet every year on October 30, the night before the spirits pass through the veil, to renew the charms that support the shield.”\n I thought about explaining to her that “spirits,” meaning monsters and demons, don’t give a rat’s ass about Halloween, but she looked like one of those humans who’d be disappointed by the news. Besides, we needed to focus on what had happened to the shield.\n “So you’re saying that the shield was weak, and somebody was able to punch a hole in it.”\n “The shield is never weak; we don’t let that happen. We fortify it with Blood of an Evil Man.”\n “With what?” This came from Daniel, who looked a little wide-eyed, like he was wondering whether he’d have to open an investigation.\n “Not actual blood. Well, not these days, not with modern spellcraft. Blood of an Evil Man is a type of spell, an intensifier that adds power to whatever magic you’re working with.”\n “So you don’t really use blood?”\n “Well, you can. Some old-school witches and sorcerers probably still do. But we’ve got better methods now to achieve the same effect. Cleaner. And blood can be hard to get.” Roxana laughed, showing her white teeth, and Daniel smiled back. “People are often reluctant to part with it.”\n “Especially evil men, I’d imagine.”\n Roxana laughed again. “True. And how many people do you know who walk around going, ‘Oooh, I’m evil’? Makes it hard to advertise for blood donors.”\n Daniel looked right into her eyes as they laughed together. Pretty rotten of me to break up their party. Or not. “Could we get back to the shield, please?” They both turned to me with the faces of scolded children who didn’t feel one bit guilty. It was annoying. “So, Roxana,” I said, “what you’re telling me is that there was nothing special about the timing. The shield could have been breached any day of the year.”\n “Not by a Hellion. Not that, ever. But we never expected a magical attack. So you’re right in a sense. After the thirtieth—huh, that’s today, isn’t it—the shield would have been much harder to damage.” She flipped a strand of hair back over her shoulder. “It’s back to full strength now, though. Daniel told you we repaired it, right?”\n “You what?” A hot, sick feeling possessed me, like I was suffocating. “With the Destroyer running around Boston? Are you crazy? You’ve sealed it inside!”\n Those stupid witches. They’d trapped Difethwr inside the very city it promised to destroy. Which meant it was only a matter of time until the Hellion razed Boston, killing hundreds or even thousands of people. It didn’t need a legion. It could do that all by itself.\n What if I couldn’t stop it in time? Those witches had sentenced half of Boston to death.\n The sick feeling was swept aside by an electric jolt. My fist clenched, and along my right forearm, the scar itched and burned. I made the mistake of looking at Daniel as the demon essence flared, and I wanted to pound his smiling face into his desk over and over and over, until not even his damn wife would recognize him.\n Whoa. Not that. I closed my eyes and forced my clenched fingers to open. They fought me, and my arm spasmed. I pushed the image of Daniel out of my mind and focused instead on opening my hand. If I could do that, I’d be in control. Me, not the demon mark. Come on, Vicky, I thought, focus on the real enemy. Face up to what you’re really afraid of. Difethwr. Sealed inside the city. Your city.\n The thought was terrifying. And rage felt way better than fear, so I let it flow. The mark pulsed as I allowed the rage to flame around the edges of my mind. The demon mark’s pulse was slow and steady, nothing like my crazy-fast racing heartbeat. Instead, some deep, ponderous rhythm of Hell was coming alive in my body. No! I turned my rage toward that, toward the Destroyer itself. The demon that had killed my father and marked me for life. It was in the city, and it was trying to use its essence to control me. I wouldn’t let it. I’d just have to kill the thing. That had been the plan all along, hadn’t it?\n My fingers flew open.\n I inhaled deeply, then exhaled. I opened my eyes. Roxana was gaping at me, looking nervous. “We had to repair the shield, Victory,” she said. “We’ve sensed a spike in Hellion activity; the Destroyer is assembling a legion. If we don’t keep them out, there will be hundreds of Hellions attacking Boston, not just one.”\n It made sense. I didn’t like it, but it was the less terrible of two really bad choices. And it was true that if Difethwr couldn’t get out of Boston, it couldn’t escape me. Not that it had been running away from me so far.\n “We need to find out who breached the shield in the first place,” I said, surprised that my voice sounded normal. “Who knew it was due for renewal?”\n Roxana frowned. “That’s what bothers me. Only the Witches of the Shield knew. We’re all sworn to secrecy, and we take that vow seriously. The only reason I’m able to tell you and Daniel all this is because we had an emergency meeting and voted to cooperate with the authorities.”\n “It doesn’t matter, you know,” I said, deciding to clue her in after all. “About the date, the timing. Those spirits are always around. Halloween is just the day humans decide to notice.”\n Roxana’s face clouded, and then she smiled. “Of course,” she said. “So we can renew the shield whenever we want.” She was quick; I liked that.\n “And you can keep the new date a secret, or even change the date each year.”\n “Excellent.” She beamed at me. “You’re already helping us stay one step ahead of the demons.” \n","sourceLink":"https://allnovel.net/deadtown-deadtown-1/page-40.html","bookId":2609,"book":{"id":2609,"title":"Deadtown (Deadtown #1)","description":"Storyline: \n Deadtown (Deadtown #1) \n If you were undead, you\u0027d be home by now... \n They call it Deadtown: the city\u0027s quarantined section for its inhuman and undead residents. Most humans stay far from its borders-but Victory Vaughn, Boston\u0027s only professional demon slayer, isn\u0027t exactly human.\n \n","cover":"https://allnovel.net/images/deadtown-deadtown-1.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/deadtown-deadtown-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:32:54 PM"}}
