{"id":98434,"no":59,"title":"Page 59","content":"“Well, like I told you in my phone message, me and Jenna had this amazing idea for our Halloween costumes. Do you like them?” Both girls were dressed in head-to-toe black leather. “What are you supposed to be?” Tina rolled her eyes. “We’re demon slayers. Duh.” I thought of Maria in her Aunt Vicky costume and had to blink a couple of times. “Yeah,” I said, “it’s all the rage.” “It is? Well, anyway, now you know why I needed the sword. And Jenna needed a weapon, too. So we snuck out of Deadtown today and went that that store in Allston, the one you told me about.” “You snuck out of Deadtown? Without a permit? You are so lucky you didn’t get snatched by the Removal Squad.” Tina shook her head. “Uh-uh. We were safe. We went as zombies.” This sent her and Jenna both into peals of laughter so severe that Jenna almost swallowed her gum. “This year, all the blood bags—I mean humans—wanted to be zombies. It’s the most popular costume. So we got two rubber zombie masks and wore them when we went out. Brilliant, huh? They protected us from the sunlight, and everyone thought we were norms goofing around in costumes.” “You risked an awful lot.” But I had to admit it was a clever plan. “So, like, we took the T out to Allston and found the place. Oh my God, it was so cool. We got guns and bronze bullets and swords and daggers—” “You walked in there wearing rubber masks and they sold you all that?” Tina shut her mouth. Jenna said, “ ’Course not. We boosted it.” Pop went the gum. I shot them both a stern look. “I’ll take it all back for you next week.” Jenna looked ready to argue, but Tina hit her under the table. “So then what happened?” I asked. Tina bounced up and down in her seat. “We came back to Deadtown. A bunch of zombies were planning to crash the parade, so we, like, put on our costumes and joined them.” I vaguely recalled noticing some undead in the parade when I’d flown over it in Harpy form. “Except,” Tina continued, “instead of zombie masks we wore movie star masks. ’Cause, you know, you’re, like, kinda glamorous and all.” “How flattering.” She beamed, missing the sarcasm. “We marched in the parade, along with everyone else. All these blood bags were around, and nobody knew. Nobody screamed or ran away or gave you that look like you belong in the toilet or something. It was fun.” Her red eyes widened. “But then, out of nowhere, all these Harpies just appeared. I knew they were Harpies from that book you gave me. There were hundreds of ’em—thousands—and they swooped in and started attacking. Norms were screaming, running around. It was, like, really bad. I didn’t even think about what I was doing. I just jumped up and started killing demons.” Tina had led the zombies in fighting off the Harpies. From what she said, the zombies fought hard, attacking Harpies with their bare hands, tearing them limb from limb. Harpies don’t eat zombies, but they’ll fight anything that threatens them. Some of the zombies had been badly injured. And zombies don’t heal. A zombie gets its face slashed open, it stays that way. They’d been brave. For humans, Harpy wounds disappear at sunrise. I hoped the same would be true for zombies. “You know what was weird?” Jenna said. “All that human blood, and I didn’t even get hungry.” “I know why,” Tina replied. “It’s ’cause the blood was only real in the demonic plane. Right, Vicky?” I nodded. “In normal reality, it’s an illusion.” “Yeah,” Tina said, “so we couldn’t smell it.” “I don’t get it.” Jenna shrugged and chomped industriously on her gum. “It’s all in that book,” Tina said. “You should read it. It’s really good.” I got up to go. “Well, Tina, it sounds like you’re a hero.” “Yeah,” she said happily. “I’m gonna be on TV tomorrow, too. Maybe even on Oprah.” Kane would love it. Without knowing it yet, he’d found the face of PA propaganda. A face with green skin, bloody eyes, too much mascara, and pink lip gloss. Later, I’d give Tina the lecture on why it takes years of training to become a demon fighter. She needed to understand that the expulsion of Difethwr had scattered the Harpies. Tonight, though, I’d let her bask. The kid had done good. 30 I SPENT SUNDAY AND MONDAY MAKING UP FOR SOME SERIOUS sleep deprivation and hanging around the apartment. I tried Daniel’s number four times but never got an answer. On the last try, his answering machine was full. There was nothing about him or Sheila Gravett on the news. I was due to give Bergonzi my statement at Goon Squad headquarters on Wednesday—and the good captain was going to come up with some answers about Daniel, or I’d go public about Baldwin and Difethwr. I still had the phone numbers of half a dozen reporters who’d love to put me back on TV. In between attempts to call Daniel, I stared at the phone and wondered whether to call Kane. He’d returned from his werewolf retreat on Monday afternoon. On the one hand, I was still kind of mad at him. On the other hand, I just plain missed him. Just when the desire to hear his voice started to win out over my stubbornness, he called me. “How was your retreat?” I asked. “Lonely.” I didn’t want to get into that discussion again, so I went for a lame joke. “Well, you are a lone wolf.” “True. But I missed you.” “That’s funny. I was just thinking the same thing about you.” “So how about we get together? I’ve got tons of work to catch up on today”—same old, same old, I thought—“but I’d love to come over tomorrow night. We can watch the election results together.” “Ah, so it wasn’t me you missed. It was Juliet’s TV.” He chuckled, a feral sound low in his throat. “Believe me, Vicky. It was you.” I caught my breath at the sexy promise in his voice. He chuckled again, but when he spoke, his voice had grown serious. “There’s something we need to talk about. Not now. Tomorrow, when I see you.” That got my stomach flip-flopping all day on Tuesday. Even though the apartment didn’t need it, I cleaned the place just to distract myself. I was sure that Kane was going to lay down an ultimatum about next month’s retreat. And if he did, he wasn’t going to like what I had to say. I was all fluttery with nerves—and I’m not a flutterer, damn it. I knew what the problem was: there was too much I wasn’t facing. But you can only face one thing at a time. And sometimes you needed to get your feet back under you before you could face anything at all. By the time Clyde called to announce that Kane was on his way up, the apartment was spotless, the TV was on, and I even had little snacky things—cheese and crackers, peanuts—laid out on the coffee table. Still feeling fluttery, I opened the door. And there he was. God, he looked good, dressed in jeans and a black sweater that made his hair seem even more silvery. Kane, the cooler-than-a-cucumber trial lawyer, was never one to be nervous, I thought. But then he kissed me—a mere peck on the lips—and I wondered. What did Kane have to be nervous about? “Man,” he said, looking over my shoulder, “look at those numbers.” He walked around me to sit on the sofa, his eyes on the TV. I wondered what was so fascinating. Governor Sugden was winning reelection by a landslide. No surprise there, though, seeing as how his challenger was in prison awaiting trial on charges of practicing sorcery without a license and aggravated assault by black magic. What was surprising was how many norms turned out to vote. You’d think they wouldn’t bother, for a one-man contest. But voters had gone to the polls in record numbers. A few cranks voted for the disqualified Baldwin—making a statement, I guess—but 98 percent of the votes went to Sugden. “It’s a whole new era for human-PA relations,” Kane ex ulted. I sat on the sofa, leaning against him, his arm slung loosely across my shoulders. His body was solid, both strong and relaxed, and I could almost feel the energy buzzing through him. He was always like that, revitalized, when he returned from a werewolf retreat. It felt so good just to be close to him. Then Kane clicked off the TV and turned to me. His gray eyes searched mine. “Vicky, about the retreat—” “Please don’t ask me to go to the next one. I can’t.” I took a deep breath and held his gaze. “This isn’t easy for me to say, but I have to say it. I’m not a werewolf. And I can’t straitjacket myself into pretending to be one. Not for you, not for anyone. I’ve got to be what I am.” He nodded. “I know. I was wrong to try to make you into something you’re not.” His hand brushed my cheek. “You’re pretty terrific the way you are.” I closed my eyes and leaned forward for a kiss. But it didn’t come. Kane straightened and pulled back his arm. I opened my eyes again and blinked at him. He jumped off the sofa and started pacing. “I’ve got to say something difficult, too. Hard as hell. But—” He stopped and nailed me with those piercing gray eyes. “I’m going away. To Washington.” Color me stunned. The way I gasped and gaped, I’m surprised I didn’t shift into a fish out of water. After a minute, I found my voice. “When?” “Tonight. I have to leave for the airport in about twenty minutes.” He sat again and took both my hands in his. “It won’t be forever. I’ve got a six-month PA visa. But it’s happened, Vicky. I’m preparing a civil rights case for the Supreme Court.” He glowed when he said it, like someone had flipped on a spotlight. This was Kane’s dream—the chance to establish PA rights at the federal level. “That’s great, Kane. It’s what you’ve always wanted. I’m sure you’ll win.”","sourceLink":"https://allnovel.net/deadtown-deadtown-1/page-59.html","bookId":2609,"book":{"id":2609,"title":"Deadtown (Deadtown #1)","description":"Storyline: Deadtown (Deadtown #1) If you were undead, you\u0027d be home by now... They call it Deadtown: the city\u0027s quarantined section for its inhuman and undead residents. Most humans stay far from its borders-but Victory Vaughn, Boston\u0027s only professional demon slayer, isn\u0027t exactly human.","cover":"https://allnovel.net/images/deadtown-deadtown-1.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/deadtown-deadtown-1.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:32:54 PM"}}
