{"id":81403,"no":131,"title":"Page 131","content":"Jamie felt it, and put a light hand on my back. “All right, Sassenach?” he whispered. “Yes.” I gripped his free hand for reassurance. They would hardly be burying Betty in the kitchen garden; the digging must be for something prosaic, like an onion bed or a trench for early peas. The thought was comforting, though my skin still felt cold and thin, prickling with apprehensions. Jamie himself was far from easy, though he was outwardly composed, as usual. He was no stranger to death, and had no great fear of it. But he was both Catholic and Celt, with a strong conviction of another, unseen world that lay past the dissolution of the body. He believed implicitly in tannasgeach—in spirits—and had no desire to meet one. Still, if I was determined, he would brave the otherworld for my sake; he squeezed my hand hard, and didn’t let go. I squeezed back, deeply grateful for his presence. Beyond the debatable question of how Betty’s ghost might feel about my proposed plan of action, I knew that the notion of deliberate mutilation disturbed him deeply, however much his own intelligence might be convinced that a soulless body was no more than clay. “To see men hacked to death on a battlefield is one thing,” he’d said earlier in the evening, still arguing with me. “That’s war, and it’s honorable, cruel as it may be. But to take a blade and carve up a poor innocent like yon woman in cold blood . . .” He looked at me, eyes dark with troubled thought. “Ye’re sure ye must do it, Claire?” “Yes, I am,” I had said, eyes fixed on the contents of the bag I was assembling. A large roll of lint wadding, to soak up fluids, small jars for organ samples, my largest bone saw, a couple of scalpels, a wicked pair of heavy-bladed shears, a sharp knife borrowed from the kitchen . . . it was a sinister-looking collection, to be sure. I wrapped the shears in a towel to prevent them clanking against the other implements, and put them in the bag, carefully marshaling my words. “Look,” I said at last, raising my eyes to meet his. “There’s something wrong, I know it. And if Betty was killed, then surely we owe it to her to find that out. If you were murdered, wouldn’t you want someone to do whatever they could to prove it? To—to avenge you?” He stood still for a long moment, eyes narrowed in thought as he looked down at me. Then his face relaxed, and he nodded. “Aye, I would,” he said quietly. He picked up the bone saw, and began wrapping it with cloth. He hadn’t protested further. He hadn’t asked me again whether I was sure. He had merely said firmly that if I was going to do it, he was coming with me, and that was all about it. As for being sure, I wasn’t. I did have an abiding feeling that something was very wrong about this death, but I was less confident in my sense of what it was, with the cold moon sinking through an empty sky and wind brushing my cheeks with the touch of icy fingers. Betty might have died only by accident, not malice. I could be wrong; perhaps it was a simple hemorrhage of an esophageal ulcer, the bursting of an aneurysm in the throat, or some other physiological oddity. Unusual, but natural. Was I doing this, in fact, only to try to vindicate my faith in my own powers of diagnosis? The wind belled my cloak and I pulled it tighter around me, one-handed, stiffening my spine. No. It wasn’t a natural death, I knew it. I couldn’t have said how I knew it, but fortunately Jamie hadn’t asked me that. I had a brief flash of memory; Joe Abernathy, a jovial smile of challenge on his face, reaching into a cardboard box full of bones, saying, “I just want to see can you do it to a dead person, Lady Jane?” I could; I had. He had handed me a skull, and the memory of Geillis Duncan shuddered through me like liquid ice. “Ye needna do it, Claire.” Jamie’s hand tightened on mine. “I willna think ye a coward.” His voice was soft and serious, barely audible above the wind. “I would,” I said, and felt him nod. That was the matter settled, then; he let go of my hand and went ahead of me, to open the gate. He paused, and my dark-adapted eyes caught the clean sharp line of his profile as he turned his head, listening. The dark-lantern he carried smelled hot and oily, and a faint gleam escaping from its pierced-work panel sprinkled the cloth of his cloak with tiny flecks of dim light. I glanced round myself, and looked back at the house. Late as it was, candles still burned in the back parlor, where the card games lingered on; I caught a faint murmur of voices as the wind changed, and a sudden laugh. The upper floors were mostly dark—save one window which I recognized as Jocasta’s. “Your aunt’s awake late,” I whispered to Jamie. He turned and looked up at the house. “Nay, it’s Duncan,” he said softly. “My aunt doesna need the light, after all.” “Perhaps he’s reading to her in bed,” I suggested, trying to leaven the solemnity of our errand. A small derisive huff came from Jamie, but the oppressive atmosphere did lift just a bit. He unlatched the gate and pushed it open, showing a square of utter black beyond. I turned my back on the friendly lights of the house and stepped through, feeling just a bit like Persephone entering the Underworld. Jamie swung the gate to, and handed me the lantern. “What are you doing?” I whispered, hearing the rustle of his clothing. It was so dark by the gate that I couldn’t see him as more than a dark blur, but the faint sound that came next told me what he was doing. “Pissing on the gateposts,” he whispered back, stepping back and rustling further as he did up his breeks. “If we must, then we will, but I dinna want anything to be following us back to the house.” I made my own small huffing noise at that, but made no demur when he insisted upon repeating this ritual at the door to the shed. Imagination or not, the night seemed somehow inhabited, as though invisible things moved through the darkness, murmuring under the voice of the wind. It was almost a relief to go inside, where the air was still, even though the scents of death mingled thickly with the dankness of rust, rotted straw, and mildewed wood. There was a faint rasp of metal as the dark-lantern’s panel slid back, and a dazzling shaft of light fell over the confines of the shed. They had laid the dead slave on a board across two trestles, already washed and properly laid out, wrapped in a rough muslin shroud. Beside her stood a small loaf of bread and a cup of brandy. A small posy of dried herbs, carefully twisted into a knot, lay on the shroud, just above the heart. Who had left those? I wondered. One of the other slaves, surely. Jamie crossed himself at the sight, and looked at me, almost accusingly. “It’s ill luck to touch grave goods.” “I’m sure it’s only ill luck to take them,” I assured him, low-voiced, though I crossed myself before taking the objects and putting them on the ground in a corner of the shed. “I’ll put them back when I’ve finished.” “Mmphm. Wait just a moment, Sassenach. Dinna touch her yet.” He dug in the recesses of his cloak, and emerged with a tiny bottle. He uncorked this, and putting his fingers to the opening, poured out a little liquid, which he flicked over the corpse, murmuring a quick Gaelic prayer that I recognized as an invocation to St. Michael to protect us from demons, ghouls, and things that go bump in the night. Very useful. “Is that holy water?” I asked, incredulous. “Aye, of course. I got it from Father LeClerc.” He made the sign of the Cross over the body, and laid his hand briefly on the draped curve of the head, before nodding reluctant approval for me to proceed. I extracted a scalpel from my bag and slit the stitching on the shroud carefully. I’d brought a stout needle and waxed thread, to sew up the body cavity; with luck, I could also repair the shroud sufficiently that no one would realize what I’d been doing. Her face was almost unrecognizable, round cheeks gone slack and sunken, and the soft bloom of her black skin faded to an ashy gray, the lips and ears a livid purple. That made it easier; it was clear that this was indeed only a shell, and not the woman I had seen before. That woman, if she was still in the vicinity, would have no objections, I thought. Jamie made the sign of the Cross again and said something soft in Gaelic, then stood still, the lantern held high so that I could work by its light. The light threw his shadow on the wall of the shed, gigantic and eerie in the wavering flicker. I looked away from it, down to my work. The most formal and sanitary of modern autopsies is simple butchery; this was no better—and worse only in the lack of light, water, and specialized tools. “You needn’t watch, Jamie,” I said, standing back for a moment to wipe a wrist across my brow. Cold as it was in the shed, I was sweating from the heavy work of splitting the breastbone, and the air was thick with the ripe smells of an open body. “There’s a nail on the wall; you could hang up the lantern, if you want to go out for a bit.” “I’m all right, Sassenach. What is that?” He leaned forward, pointing carefully. The look of disquiet on his features had been replaced by one of interest. “The trachea and bronchi,” I replied, tracing the graceful rings of cartilage, “and a bit of a lung. If you’re all right, then can I have the light a little closer here, please?” Lacking spreaders, I couldn’t wrench the rib cage far enough apart to expose the complete lung on either side, but thought I could see enough to eliminate some possibilities. The surfaces of both lungs were black and grainy; Betty was in her forties, and had lived all her life with open wood fires. “Anything nasty that you breathe in and don’t cough up again—tobacco smoke, soot, smog, what-have-you—gradually gets shoved out between the lung tissue and the pleura,” I explained, lifting a bit of the thin, half-transparent pleural membrane with the tip of my scalpel. “But the body can’t get rid of it altogether, so it just stays there. A child’s lung would be a nice clean pink.” “Do mine look like that?” Jamie stifled a small, reflexive cough. “And what is smog?” “The air in cities like Edinburgh, where you get smoke mixing with fog off the water.” I spoke abstractedly, grunting slightly as I pulled the ribs back, peering into the shadowed cavity. “Yours likely aren’t so bad, since you’ve lived out of doors or in unheated places so much. Clean lungs are one compensation to living without fire.” “That’s good to know, if ye’ve got no choice about it,” he said. “Given the choice, I expect most folk would rather be warm and cough.” I didn’t look up, but smiled, slicing through the upper lobe of the right lung. “They would, and they do.” No indication of hemorrhage in either lung; no blood in the airway; no evidence of pulmonary embolism. No pooling of blood in the chest or abdominal cavity, either, though I was getting some seepage. Blood will clot soon after death, but then gradually reliquefies. “Hand me a bit more of the wadding, will you, please?” A little spotting of blood on the shroud likely wouldn’t worry anyone, given the spectacular nature of Betty’s demise, but I didn’t want enough to make anyone sufficiently suspicious to check inside.","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-131.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
