{"id":81422,"no":151,"title":"Page 151","content":"“You’ll suit yourselves, then,” he said, as coolly as possible. “Mr. Husband gave you his best advice—I second it.” He turned to leave, but was gripped by a pair of hands that descended on his shoulders, pulling him forcibly around to face the ring of questioners once more.\n “Not so fast, chuck,” said the man in the leather vest. He was still flushed with angry excitement, but his fists were no longer clenched. “You’ve spoke with Tryon, have you?”\n “No,” Roger admitted. “I was sent—” He hesitated; ought he to use Jamie Fraser’s name? No, better not; it was as likely to cause trouble as to save it. “I came to ask Hermon Husband to come across the creek and discover for himself how matters stand. He chose instead to accept my account of the situation. You saw what his response was.”\n “So you say!” A burly man with ginger sidewhiskers raised his chin pugnaciously. “And why should anyone accept your account of the situation?” He mimicked Roger’s clipped Scots in a burlesque that brought laughter from his comrades.\n The calm he had carried from the cabin had not altogether left him; Roger gathered its remnants about him and spoke quietly.\n “I cannot compel you to listen, sir. But for those who have ears—hear this.” He looked from one face to another, and reluctantly, one by one, they left off making noise, until he stood as the center of a ring of unwilling attention.\n “The Governor’s troops stand ready and well-armed.” His voice sounded odd to his own ears, calm but somehow muffled, as though someone else were speaking, some distance away. “I have not seen the Governor myself, but I have heard his stated purpose: he does not wish to see blood shed, but he is determined to take such actions as he perceives necessary to disperse this assembly. Yet if you will return peaceably to your homes, he is disposed to leniency.”\n A moment of silence greeted this, to be broken by a hawking noise. A glob of mucus, streaked brown with tobacco juice, landed with a splat in the mud near Roger’s boot.\n “That,” observed the spitter concisely, “for the Governor’s leniency.”\n “And that for you, fuckwit!” said one of his companions, swinging an open palm toward Roger’s face.\n He ducked the blow, and lowering his shoulder, charged the man, who staggered off-balance and gave way. There were more beyond him, though; Roger stopped, fists balled, ready to defend himself if need be.\n “Don’t hurt him, boys,” called the man in the leather vest. “Not yet, anyways.” He sidled round Roger, keeping well out of range of his fists, and eyed him warily.\n “Whether you’ve seen Tryon’s face or not, reckon you’ve seen his troops, haven’t you?”\n “I have.” Roger’s heart was beating fast, and the blood sang in his temples, but oddly enough, he wasn’t afraid. The crowd was hostile, but not bloodthirsty—not yet.\n “So how many men does Tryon have?” The man was watching him closely, with a glint in his eye. Best to answer honestly; the odds were good that the answer was already known; there was nothing whatever to hinder men of the Regulation from crossing the Alamance and assessing the situation for themselves.\n “A few more than a thousand,” Roger said, watching the man’s face carefully. No surprise; he had known. “But they are trained militia,” Roger added pointedly, with a glance at a number of the Regulators, who, having lost interest in Roger, had resumed a wrestling match nearby. “And they have artillery. I think you have none, sir?”\n The man’s face closed like a fist.\n “Think what you like,” he said shortly. “But you can tell Tryon that we boast twice his number. And be we trained or not—” his mouth twisted ironically, “we are all armed, each man with his musket.” He tilted back his head, squinting against the light.\n “An hour, is it?” he asked, more softly. “Sooner than that, I think.” He lowered his gaze, looking Roger in the eye.\n “Go you back across the creek, then, sir. Tell Governor Tryon that we mean to have our say, and have our way of it. If he will listen and do as we demand, well and good. If not . . .” He touched the hilt of the pistol in his belt, and nodded once, his face settling into grim lines.\n Roger glanced around at the circle of silent faces. Some bore looks of uncertainty, but most were sullen or openly defiant. He turned without a word and walked away, the Reverend’s words whispering among the spring leaves as he passed beneath the trees.\n Blessed are the peacemakers: for they shall be called the children of God.\n He hoped one got credit for trying.\n 63\n THE SURGEON’S BOOK I\n Item #28 - The Surgeons to keep a Book and enter each Man that comes under his care, Vixt. the Mans Name, the Company he belongs to, the Day he comes under his Hands, and the day he discharges him.\n —“Camp Duties and Regulations”\n I FELT A cool breeze touch my cheek, and shivered, though the day was very warm. I had the sudden absurd thought that it was the glancing touch of a wing-feather, as though the Angel of Death had silently passed by me, intent on his dark business.\n “Nonsense,” I said aloud. Evan Lindsay heard me; I saw his head turn momentarily, but then turn back. Like all the others, he kept glancing toward the east.\n People who don’t believe in telepathy have never set foot on a battlefield, nor served with an army. Something passes unseen from man to man when an army is about to move; the air itself is live with feeling. Half dread, half eagerness, it dances over the skin and bores the length of the spine with an urgency like sudden lust.\n No messenger had come yet, but one would, I knew it. Something had happened, somewhere.\n Everyone stood rooted, waiting. I felt an overwhelming urge to move, to break that spell, and turned abruptly, my hands flexing with the need to stir, to do something. The kettle had boiled, the water sat ready, covered with a piece of clean linen. I had set up my medicine chest on a stump; I put back the lid and began to go mindlessly through its contents yet again, though I knew all was in order.\n I touched the gleaming bottles one by one, their names a soothing litany.\n Atropine, Belladonna, Laudanum, Paregoric, Oil of Lavender, Oil of Juniper, Pennyroyal, Lady’s-vetch, . . . and the squat brown-glass bottle of alcohol. Always alcohol. I had a keg of it, still on the wagon.\n Movement caught my eye; it was Jamie, the sun sparking on his hair through the leaves as he moved quietly under the trees, bending here to speak a word in someone’s ear, touching there a shoulder, like a magician bringing statues to life.\n I stood still, hands twisted in the folds of my apron, not wanting to distract him, yet wanting very much to attract his attention. He moved easily, joking, touching casually—and yet I could see the tension in him. When had he last stood with an army, waiting the order to charge?\n At Culloden, I thought, and the hairs rippled erect on my forearms, pale in the spring sun.\n Hoofsteps sounded nearby, and the crashing sound of horses moving through brush. Everyone swung round in expectation, muskets held loose in their hands. There was a general gasp and murmur as the first rider came into view, ducking her bright red head beneath the maple boughs.\n “Holy Christ,” Jamie said, loudly enough to be heard across the clearing. “What in hell is she doing here?” There was a ripple of laughter from the men who knew her, fracturing the tension like cracks in ice. Jamie’s shoulders relaxed, very slightly, but his face was rather grim as he strode to meet her.\n By the time Brianna had pulled up her horse and swung down from her saddle next to him, I had reached them, too.\n “What—” I began, but Jamie was already nose to nose with his daughter, his hand on her arm, eyes narrowed and speaking in a rapid torrent of low-voiced Gaelic.\n “I’m that sorry, Mum, but she would come.” A second horse ambled out of the trees, an apologetic-looking young black man on top. It was Joshua, Jocasta’s groom. “I couldna prevent her, nor could Missus Sherston. We did try.”\n “So I see,” I said.\n Brianna’s color had risen in response to whatever Jamie was saying to her, but she showed no sign of getting back on her horse and leaving. She said something to him, also in Gaelic, that I didn’t catch, and he reared back as though stung on the nose by a wasp. She nodded sharply once, as though satisfied with the impact of her statement, and turned on her heel. Then she saw me, and a wide smile transformed her face.\n “Mama!” She embraced me, her gown smelling faintly of fresh soap, beeswax, and turpentine. There was a small streak of cobalt-blue paint on her jaw.\n “Hallo, darling. Wherever did you come from?” I kissed her cheek and stood back, cheered by the sight of her, in spite of everything. She was dressed very plainly, in the rough brown homespun she wore on the Ridge, but the clothes were fresh and clean. Her long red hair was tied back in a plait, and a broad straw hat hung from its strings down her back.\n “Hillsborough,” she said. “Someone who came to dinner at the Sherstons’ last night told us that the militia was camped here—so I came. I brought some food”— she waved at the bulging saddlebags on her horse—“and some herbs from the Sherstons’ garden I thought you might use.”\n “Oh? Oh, yes. Lovely.” I was uneasily aware of Jamie’s glowering presence somewhere behind me, but didn’t look around. “Ah . . . I don’t mean to sound as though I’m not pleased to see you, darling, but there is just possibly going to be a fight here before too long, and . . . .”\n “I know that.” Her color was still high, and it deepened somewhat at this. She raised her voice slightly.\n “That’s all right; I didn’t come to fight. If I had, I would have worn my breeches.” She darted a glance over my shoulder, and I heard a loud snort from that direction, followed by guffaws from the Lindsay brothers. She lowered her head to hide a grin, and I couldn’t help smiling, too.\n “I’ll stay with you,” she said, lowering her voice as well, and touching my arm. “If there’s nursing to be done . . . afterward—I can help.”\n I hesitated, but there was no question that if things did come to a fight, there would be wounded to treat, and an extra pair of hands would be useful. Brianna wasn’t skilled at nursing, but she did understand about germs and antisepsis, knowledge of much more value in its way than a grasp of anatomy or physiology.\n Bree had straightened. Her glance flickered over the men who waited in the maples’ shade, searching.\n “Where’s Roger?” she asked, her voice low but level.\n “He’s all right,” I assured her, hoping it was true. “Jamie sent him across the creek this morning, with a flag of truce, to bring back Hermon Husband to talk with the Governor.”\n “He’s over there?” Her voice rose involuntarily, and she lowered it, self-conscious. “With the enemy? If that’s the right word for them.”\n “He’ll be back.” Jamie stood by my elbow, viewing his daughter with no great favor, but obviously resigned to her presence. “Dinna fash, lassie. No one will trouble him, under a flag of truce.” \n","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-151.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: \n The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.\n \n","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
