{"id":81423,"no":152,"title":"Page 152","content":"Bree raised her head, looking as far as she could into the distance toward the creek. Her face had drawn in upon itself, a pale knot of apprehension.\\n\\n “Will a flag of truce help him if he’s still over there when the shooting starts?”\\n\\n The answer to that—which she obviously knew—was “Probably not.” So did Jamie, who didn’t bother saying it. He also didn’t bother saying that perhaps it wouldn’t come to shooting; the air was thick with anticipation, acrid with the scent of spilled black powder and nervous sweat.\\n\\n “He’ll be back,” Jamie repeated, though in a gentler tone. He touched her face, smoothing back a random lock of hair. “I promise, lass. He’ll be all right.”\\n\\n The look of apprehension faded a bit as she searched his face. She seemed to find some reassurance there, for a little of the tension left her, and she nodded, in mute acceptance. Jamie leaned forward and kissed her on the forehead, then turned away to speak to Rob Byrnes.\\n\\n Bree stood looking after him for a moment, then untied the strings of her bonnet and came to sit down beside me on a rock. Her hands were trembling slightly; she took a deep breath, and clasped her knees to still them.\\n\\n “Is there anything I can do to help now?” she asked, with a nod toward my open medicine box. “Do you need me to fetch anything?”\\n\\n I shook my head.\\n\\n “No, I have everything I need. There isn’t anything to do but wait.” I grimaced slightly. “That’s the hardest part.”\\n\\n She made a small sound of reluctant agreement, and relaxed, with a visible effort. She assessed the waiting equipment, a slight frown between her brows: the fire, the boiling water, the folding table, the large instrument box, and the smaller pack that held my emergency kit.\\n\\n “What’s in there?” she asked, poking a boot-shod toe at the canvas sack.\\n\\n “Alcohol and bandages, a scalpel, forceps, amputation saw, tourniquets. They’ll bring the wounded here, if they can, or to one of the other surgeons. But if I have to go to a man wounded on the field—someone too bad to walk or be carried—I can snatch that up and go at once.”\\n\\n I heard her swallow, and when I glanced up at her, the freckles stood out on the bridge of her nose. She nodded, and drew a deep breath to speak. Her face changed suddenly, though, switching comically from seriousness to repugnance. She sniffed once, suspiciously, her long nose wrinkling like an ant-eater’s.\\n\\n I could smell it, too; the stink of fresh feces, coming from the grove directly behind us.\\n\\n “That’s rather common before a battle,” I said, low-voiced, trying not to laugh at her expression. “They’re caught short, poor things.”\\n\\n She cleared her throat and didn’t say anything, but I saw her gaze roam round the clearing, resting now on one man, then another. I knew what she was thinking. How was it possible? How could one look at such an orderly, compact bundle as a man, head bent to catch a friend’s words, arm stretched to take a canteen, face moving from smile to frown, eyes lighted and muscles taut—and envision rupture, abrasion, fracture . . . and death?\\n\\n It couldn’t be done. It was an act of the imagination that lay beyond the capability of one who hadn’t ever seen that particular obscene transformation.\\n\\n It could, however, be remembered. I coughed, and leaned forward, hoping to distract us both.\\n\\n “Whatever did you say to your father?” I asked, out of the side of my mouth. “When you came, when you were speaking Gaelic.”\\n\\n “Oh, that.” A slight flush of amusement momentarily relieved her paleness. “He was snarling at me, wanting to know what I thought I was playing at—did I mean to leave my child an orphan, he said, risking my life along with Roger’s?” She wiped a strand of red hair away from her mouth, and gave me a small, edgy smile. “So I said to him, if it was so dangerous, where did he get off, risking making me an orphan by having you here, hm?”\\n\\n I laughed, though keeping that, too, under my breath.\\n\\n “It’s not dangerous for you, is it?” she asked, surveying the militia encampment. “Back here, I mean?”\\n\\n I shook my head.\\n\\n “No. If the fighting comes anywhere close, we’ll move, right away. But I don’t think—”\\n\\n I was interrupted by the sound of a horse, coming fast, and was on my feet, along with the rest of the camp, by the time the messenger appeared; one of Tryon’s baby-faced aides, pale with bottled-up excitement.\\n\\n “Stand ready,” he said, hanging out of his saddle, half-breathless.\\n\\n “And what d’ye think we’ve been doing since dawn?” Jamie demanded, impatient. “What in God’s name is happening, man?”\\n\\n Very little, apparently, but that little was important enough. A minister from the Regulators’ side had come to parley with the Governor.\\n\\n “A minister?” Jamie interrupted. “A Quaker, do you mean?”\\n\\n “I do not know, sir,” said the aide, annoyed at being interrupted. “Quakers have no clergy, anyone knows as much. No, it was a minister named Caldwell, the Reverend David Caldwell.”\\n\\n Regardless of religious affiliation, Tryon had been unmoved by the ambassador’s appeal. He could not, would not, deal with a mob, and there was an end to it. Let the Regulators disperse, and he would promise to consider any just complaints laid before him in a proper manner. But disperse they must, within an hour.\\n\\n “Could you, would you, in a box?” I murmured under my breath, half unhinged by the waiting. “Could you, would you, with a fox?” Jamie had taken off his hat, and the sun shone bright on his ruddy hair. Bree gave a strangled giggle, as much shock as amusement.\\n\\n “He could not, would not, with a mob,” she murmured back. “Could not, would not . . . do the job?”\\n\\n “He can, though,” I said, sotto voce. “And I’m very much afraid he will.” For the hundredth time that morning, I glanced toward the scrim of willows through which Roger had disappeared on his errand.\\n\\n “An hour,” Jamie repeated, in answer to the aide’s message. He glanced in the same direction, toward the creek. “And how much time is left of that?”\\n\\n “Perhaps half an hour.” The aide looked suddenly much younger even than his years. He swallowed, and put on his hat. “I must go, sir. Listen for the cannon, sir, and luck to you!”\\n\\n “And with you, sir.” Jamie touched the aide’s arm in farewell, then slapped the horse’s rump with his hat, sending it off.\\n\\n As though it had been a signal, the camp sprang into a flurry of activity, even before the Governor’s aide had disappeared through the trees. Weapons already primed and loaded were checked and rechecked, buckles unfastened and refastened, badges polished, hats beaten free of dust and cockades affixed, stockings pulled up and tightly gartered, filled canteens shaken for reassurance that their contents had not evaporated in the last quarter-hour.\\n\\n It was catching. I found myself running my fingers over the rows of glass bottles in the chest yet again, the names murmuring and blurring in my mind like the words of someone telling rosary beads, sense lost in the fervor of petition. Rosemary, atropine, lavender, oil of cloves . . .\\n\\n Bree was notable for her stillness among all this bustle. She sat on her rock, with no movement save the stir of a random breeze in her skirts, her eyes fixed on the distant trees. I heard her say something, under her breath, and turned.\\n\\n “What did you say?”\\n\\n “It’s not in the books.” She didn’t take her eyes off the trees, and her hands were knotted in her lap, squeezing together as though she could will Roger to appear through the willows. She lifted her chin, gesturing toward the field, the trees, the men around us.\\n\\n “This,” she said. “It’s not in the history books. I read about the Boston Massacre. I saw it there, in the history books, and I saw it here, in the newspaper. But I never saw this there. I never read a word about Governor Tryon, or North Carolina, or a place called Alamance. So nothing’s going to happen.” She spoke fiercely, willing it. “If there was a big battle here, someone would have written something about it. Nobody did—so nothing’s going to happen. Nothing!”\\n\\n “I hope you’re right,” I said, and felt a small warming of the chill in the small of my back. Perhaps she was. Surely it couldn’t be a major battle, at least. We were no more than four years from the outbreak of the Revolution; even the minor skirmishes preceding that conflict were well-known.\\n\\n The Boston Massacre had happened a little more than a year before—a street-fight, a clash between a mob and a platoon of nervous soldiers. Shouted insults, a few stones thrown. An unauthorized shot, a panicked volley, and five men dead. It had been reported, with a good deal of fierce editorializing, in one of the Boston newspapers; I had seen it, in Jocasta’s parlor; one of her friends had sent her a copy.\\n\\n And two hundred years later, that brief incident was immortalized in children’s textbooks, evidence of the rising disaffection of the Colonists. I glanced at the men who stood around us, preparing to fight. Surely, if there was to be a major battle here, a Royal Governor putting down what was essentially a tax-payer’s rebellion, that would have been worth noting!\\n\\n Still, that was theory. And I was uneasily aware that neither warfare nor history took much account of what should happen.\\n\\n Jamie was standing by Gideon, whom he had tethered to a tree. He would go into battle with his men, on foot. He was taking his pistols from the saddlebag, putting away the extra ammunition in the pouch at his belt. His head was bent, absorbed in the details of what he was doing.\\n\\n I felt a sudden, dreadful urgency. I must touch him, must say something. I tried to tell myself that Bree was right; this was nothing; likely not even a shot would be fired—and yet there were three thousand armed men here on the banks of the Alamance, and the knowledge of bloodshed hummed and buzzed among them.\\n\\n I left Brianna sitting on her rock, burning eyes fixed on the wood, and hurried to him.\\n\\n “Jamie,” I said, and put a hand on his arm.\\n\\n It was like touching a high-voltage wire; power hummed inside the insulation of his flesh, ready to erupt in a burst of crackling light. They say one can’t let go of such a line; a victim of electrocution simply freezes to the wire, helpless to move or save himself, as the current burns through brain and heart.\\n\\n He put his hand on mine, looking down.\\n\\n “A nighean donn,” he said, and smiled a little. “Have ye come to wish me luck, then?”\\n\\n I smiled back as best I could, though the current sizzled through me, stiffening the muscles of my face as it burned.\\n\\n “I couldn’t let you go without saying . . . something. I suppose ‘Good luck’ will do.” I hesitated, words jamming in my throat with the sudden urge to say much more than there was time for. In the end, I said only the important things. “Jamie—I love you. Be careful!”\\n\\n He didn’t remember Culloden, he said. I wondered suddenly whether that loss of memory extended to the hours just before the battle, when he and I had said farewell. Then I looked into his eyes and knew it did not.\\n\\n “‘Good luck’ will do,” he said, and his hand tightened on mine, likewise frozen to the current that surged between us. “‘I love ye’ does much better.” \\n\\n","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-152.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.\\n","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
