{"id":81428,"no":158,"title":"Page 158","content":"Roger let out the breath he’d been holding. God, what a woman! He hoped passionately that she and her baby would be safe—though if her fat-headed husband chose to step in a gopher hole and break his neck . . .\\n\\n William Buccleigh was looking down at him, green eyes narrowed in contemplation, ignoring the increasing agitation of his friend.\\n\\n “Come on, Buck!” The man glanced over his shoulder toward the creek, where loud calls to and fro indicated searchers combing the ground. “There’s no time to be lost. They did say Tryon means to hang prisoners, and I’ve no mind to be one!”\\n\\n “Does he,” Buccleigh said softly. He held Roger’s eyes with his, and Roger thought for a moment that something familiar stirred in those depths. A chill of unease ran down his spine.\\n\\n “He’s right,” he said to Buccleigh, with a jerk of the head toward the other man. “Go. I’ll not speak against you—for your wife’s sake.”\\n\\n Buccleigh pursed his lips slightly, thinking.\\n\\n “No,” he said at last, “I dinna think ye will. Speak against me, that is.” He stooped and picked up the sodden, dirt-smeared ex-flag of truce from the ground. “Go along with ye, Johnny. See to Morag. I’ll meet ye later.”\\n\\n “But, Buck . . .”\\n\\n “Go! I’m safe enough.” With a faint smile, his eyes still on Roger, Buccleigh put his hand in his pouch and drew out a small bit of dull silver metal. With a small shock, Roger recognized his own militia badge, the crudely lettered “FC” burned black in the pewter disc.\\n\\n Tossing the badge lightly in his palm, Buccleigh turned to Black-beard, who was taking a suddenly renewed interest in the proceedings.\\n\\n “I’ve a thought, sir, regarding our mutual friend.” He nodded toward Roger. “If you’re with me?”\\n\\n Black-beard looked at Roger, back at MacKenzie, and a slow smile began to grow beneath his bulbous, reddened nose. The ripple of unease down Roger’s back blossomed suddenly into a full-blown jolt of fear.\\n\\n “Help!” he roared. “Help, militia! Help!” He rolled, twisting to avoid them, but Black-beard seized him by the shoulders, pulling him back. Calls came from beyond the trees, and the sound of feet, beginning to run.\\n\\n “No, sir,” said William Buccleigh, kneeling down in front of him. He seized Roger’s jaw in a grip of iron, strangling his yells and squeezing his cheeks to force open his mouth. “I do not think you’ll speak, indeed.” With a slight smile, he rammed the sodden cloth down Roger’s throat again, and tied the tattered neckcloth fast around it.\\n\\n He stood up, then, the militia badge held tight in his hand. As the bushes opened, he turned toward them and waved an arm in hearty greeting.\\n\\n 67\\n\\n AFTERMATH\\n\\n It being now half past two O’Clock the Enemy entirely dispersed, and the Army five Miles from Camp, it was thought adviseable to lose no Time, but to return immediately to the Camp at Alamance. Empty Waggons were ordered from Camp which took both the killed and wounded of the Loyalists, and even several of the wounded Rebels, who acknowledged had they gained the day no Quarters would have been given but to such as would have turned Regulators, these were nevertheless, taken good Care of, and had their wounds dressed.\\n\\n —“A Journal of the Expedition against the Insurgents,”\\n\\n Wm. Tryon\\n\\n A MUSKET-BALL had shattered David Wingate’s elbow. Bad luck; had it struck an inch higher, it would have broken the bone, but healed cleanly. I’d opened the joint with a semicircular incision across the outer aspect, and dug out both the flattened ball and several bone chips, but the cartilage was badly damaged, and the biceps tendon had been sheared through completely; I could see the silvery gleam of one end, hiding deep in the dark-red meat of the muscle.\\n\\n I gnawed my lower lip, considering. If I left matters as they were, the arm would be permanently—and badly—crippled. If I could reattach the severed tendon and bring the bone-ends in the joint capsule into good alignment, he might just possibly regain some use of it.\\n\\n I glanced round the campsite, which now resembled an ambulance depot, littered with bodies, equipment, and blood-stained bandages. Most of the bodies were moving, thank God, if only to curse or moan. One man had been dead when his friends brought him in; he lay quiet in the shade of a tree, wrapped in his blanket.\\n\\n Most of the injuries I saw had been slight, though there were two men shot through the body; I could do nothing for them but keep them warm and hope for the best. Brianna was checking them every few minutes for signs of shock and fever, in between rounds of administering honeyed water to those suffering more superficial wounds. Best she kept busy, I thought, and she did keep moving, though her face looked like one of the wild morning glories on the vine that climbed the bush behind me—white and puckered, pinched tight closed against the terrors of the day.\\n\\n I had had to amputate a leg, soon after the battle ended. It was a man from Mercer’s Company—camped near to us, and lacking a surgeon of their own—struck by a rebounding chunk of a mortar round that had torn off most of his foot and left the flesh of the lower leg hanging in ribbons from the shattered bone. I’d thought she would faint when the heavy limb thumped into the dirt at her feet, and she’d thought so, too, but had by some miracle stayed upright, supporting the patient—who really had fainted, thank the Lord for small mercies—while I cauterized the bleeding vessels and bound the stump with brutal speed.\\n\\n Jamie was gone; he had brought back his men, hugged me hard and kissed me once, fiercely, then left with the Lindsays to take the prisoners to the Governor—and inquire along the way for any news of Roger.\\n\\n Relief at Jamie’s return buoyed my heart, but fear for Roger was a small heavy counterweight below my breastbone. I could ignore it while I worked, though. No news was good news for a short time yet, and I welcomed the immediate realities of triage and treatment as a refuge from imagination.\\n\\n Nothing else looked exigent. Men were still straggling in, but Bree looked up at each one, her heart in her eyes. If any of them needed me, she would call. All right, I decided. There was time; I’d try it. There was little to lose, bar a bit more suffering for Mr. Wingate, and I would ask if he were willing.\\n\\n He was wax-pale and sweating, but still upright. He nodded his permission and I gave him the whisky bottle again; he applied it to his mouth with his sound hand as though it contained the elixir of life. I called one of the other men to hold his arm steady while I worked, and swiftly incised the skin just above the bend of the elbow in an inverted “T,” exposing the lower head of the biceps and making the site more accessible. I began to probe with my longest forceps, teasing out the tough silver strand of the sheared tendon, pulling it down as far as I could, until I had a sound spot where I could pierce it with a suture, and set about the delicate work of rejoining the severed ends.\\n\\n I lost touch then with everything around me, all my attention focused on the problem before me. I was dimly conscious of the pit! pit! pit! of drops striking the ground at my feet, but didn’t know whether it was the sweat that ran down my arms and face, the patient’s oozing blood, or both. I could have used the hands of a trained surgical nurse to help, but didn’t have them, so made do with my own. I had a fine surgeon’s needle, though, and thin boiled-silk sutures; the stitches showed small and neat, a stark black zigzag that marked a sturdy hold on the slippery, gleaming tissue. I would normally have used the cat-gut sutures for internal work like this, as those would gradually dissolve and be absorbed by the body. Tendons healed so slowly, though—if at all—that I couldn’t risk that. The silk stitches would simply stay permanently in place, and I prayed would cause no problems of their own.\\n\\n Then the hard part was done, and time started again. I was able to talk soothingly to David, who had come through it gallantly; he nodded and made a feeble attempt to smile when I told him it was done, though his teeth were clenched and his cheeks wet with tears. He screamed when I washed the wounds with diluted alcohol—they always did; they couldn’t help it, poor things—but then sagged back, trembling, while I stitched the surgical incisions and bandaged the wounds.\\n\\n That took no great skill, though; I had attention to spare now, and gradually became aware that some of the men behind me were discussing the recent battle, full of praise for Governor Tryon.\\n\\n “Did you see it, then?” one was asking eagerly. “Did he really do as they said?”\\n\\n “Hope I may be gutted and fried for breakfast if it ain’t so,” his companion replied sententiously. “Saw him with my own eyes, didn’t I? He rode up within a hundred yards of the swine, and ordered ’em face-to-face to surrender. They wasn’t much answer for a minute, only them kind of lookin’ to and fro amongst themselves to see who might speak, and then somebody shouts out that no, damn it all, they ain’t a-going to surrender nohow. So the Governor, he’s a-scowlin’ fit to fright a thundercloud, and he rears up and lifts his sword high, then brings it down and shouts, ‘Fire on them!’ ”\\n\\n “And did they do so straight off?”\\n\\n “No, we didn’t,” put in another voice, more educated, and rather dry in tone. “Do you blame us? A forty-shilling bounty for joining the militia is one thing, but to fire in cold blood on folk you know is something else. I looked across and who should I see on the other side but my wife’s own cousin, grinning back at me! Now, I’m not saying that the rascal is any great favorite with me or the family, but how am I to go home and tell my Sally as I’ve just shot her cousin Millard full of holes?”\\n\\n “Better than Cousin Millard doin’ the same service by you,” said the first voice, with an audible grin, and the third man laughed.\\n\\n “True enough,” he said. “But we didn’t wait to see if it might come to that. The Governor, he went red as a turkey-cock when the men there with him hesitated. He stood up in his stirrups with his sword held on high, glared round at us all, and he hollered out, ‘Fire, Goddamn you! Fire on them, or on me!’ ”\\n\\n The narrator put a good deal of enthusiasm into this re-enactment, and there was a murmur of admiration from his hearers.\\n\\n “Now there’s a soldier for ye!” said one voice, followed by a general rumble of agreement.\\n\\n “So we fired,” said the narrator, a faint shrug in his voice. “Didn’t take so long, once it started. Cousin Millard is right fast, it seems, once he’s started running. Bastard got clean away.”\\n\\n More laughter at this, and I smiled, patting David’s shoulder. He was listening, too, the conversation a welcome distraction.\\n\\n “No sir,” another agreed. “I reckon Tryon means to make sure of his victory this time. Heard he’s gone to hang the leaders of the Regulation on the field.”\\n\\n “He what?” I whirled round at this, bandage still in hand.\\n\\n The small group of men blinked up at me, surprised.\\n\\n “Yes, ma’am,” said one man, with an awkward tug at the brim of his hat. “A fellow from Lillington’s brigade told me so; he was off to see the fun.” \\n\\n","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-158.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.\\n","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
