{"id":81461,"no":191,"title":"Page 191","content":"“Yeah.” She took in a deep breath and let it out in a shuddering sigh. “Had a bad dream. I’m sorry I woke you.”\\n\\n “It’s OK.” He stroked the swell of her hip, over and over, like one gentling a horse. “Want to tell me?” He hoped she did, though the sound of Jemmy’s suckling was rhythmic and soothing, and he felt sleep stealing over him as the three of them warmed, melting together like candle wax.\\n\\n “I was cold,” she said softly. “I think the quilt must have fallen off. But in the dream, I was cold because the window was open.”\\n\\n “Here? One of these windows?” Roger lifted a hand, indicating the faint oblong of the window in the far wall. Even in the middle of the darkest night, the oiled hide covering the window was very slightly lighter than the surrounding blackness.\\n\\n “No.” She took a deep breath. “It was in the house in Boston; where I grew up. I was in bed, but I was cold, and the cold woke me—in the dream. I got up to see where the draft was coming from.”\\n\\n There were French windows in her father’s study. The cold wind came from there, bellying the long white curtains into the room. The cradle stood by the antique desk, the end of a thin white blanket flickering in the draft.\\n\\n “He was gone.” Her voice had steadied, but had a momentary catch in it at the memory of terror. “Jemmy was gone. The cradle was empty, and I knew something came through the window and took him.”\\n\\n She pressed back against him, unconsciously seeking reassurance. “I was afraid of it—whatever it was—but it didn’t matter—I had to find Jemmy.”\\n\\n One hand was curled up tight under her chin. He folded it in his, and squeezed lightly, embracing her.\\n\\n “I threw open the curtains and ran out, and—and there was nothing there. Only water.” She was shaking at the memory.\\n\\n “Water?” He stroked her clenched fist with a thumb, trying to calm her.\\n\\n “Ocean. The sea. Just—water, lapping up against the edge of the terrace. It was dark, and I knew it went down forever, and that Jemmy was down there, he’d drowned, and I was too late—” She choked, but got her voice back and went on, more steadily. “But I dived in anyway, I had to. It was dark, and there were things in the water with me—I couldn’t see them, but they brushed by me; big things. I kept looking and looking but I couldn’t see anything, and then the water suddenly got lighter and I—I saw him.”\\n\\n “Jemmy?”\\n\\n “No. Bonnet—Stephen Bonnet.”\\n\\n Roger forced himself not to move, not to stiffen. She dreamed often; he always imagined that the dreams she would not tell him were of Bonnet.\\n\\n “He was holding Jemmy, and laughing. I went to take him, and Bonnet held him up away from me. He kept doing that, and I tried to hit him, and he just caught my hand and laughed. Then he looked up and his face changed.”\\n\\n She took a deep breath, and took hold of Roger’s fingers, holding on for comfort.\\n\\n “I never saw a look like that, Roger, never. There was something behind me that he could see, something coming—and it scared him more than I’ve ever seen anyone scared. He was holding me; I couldn’t turn around to look, and I couldn’t get away—I couldn’t leave Jemmy. It was coming—and . . . then I woke up.”\\n\\n She gave a small, shaky laugh.\\n\\n “My friend Gayle’s grandmother always said that when you fall off a cliff in a dream, if you hit the bottom, you’ll die. Really die, I mean. You figure the same thing goes for getting eaten by a sea monster?”\\n\\n “No. Besides, you always wake up in time from dreams like that.”\\n\\n “I have so far.” She sounded a little dubious. Still, dream told, she was eased of its terror; her body let go its last resistance and she breathed deep and easy against him; he could feel the swell of her rib cage under his arm.\\n\\n “You always will. Don’t be troubled now; Jemmy’s safe. I’m here; I’ll keep you both safe.” He put his arm gently round her, and cupped his hand around Jemmy’s fat bottom, warm in its linen clout. Jemmy, all his bodily needs met, had relapsed into a peaceful torpor, contagious in its abandon. Brianna sighed and put her hand over Roger’s, squeezing lightly.\\n\\n “There were books on the desk,” she said, beginning to sound drowsy. “On Dad’s desk. He’d been working, I could tell—there were open books and scattered papers everywhere. There was a paper lying in the middle of the desk, with writing on it; I wanted to read it, to see what he’d been doing—but I couldn’t stop.”\\n\\n “Mm-hm.”\\n\\n Brianna shivered slightly, and the movement rustled the corn shucks in the mattress, a tiny seismic disturbance of their small, warm universe. She tensed, fighting sleep, and then relaxed, as his hand cupped her breast.\\n\\n Roger lay awake, watching the square of the window grow slowly lighter, holding his family safe in his arms.\\n\\n IT WAS OVERCAST and morning-cool, but very humid; Roger could feel the sweat film his body like the skin on boiled milk. It was no more than an hour past dawn, they weren’t yet out of sight of the house, and his scalp was prickling already, slow droplets gathering under the plait at the base of his skull.\\n\\n He flexed his shoulders with resignation, and the first trickle crawled tickling down his backbone. At least sweating helped to ease the soreness; his arms and shoulders had been so stiff this morning that Brianna had had to help him dress, pulling his shirt over his head and buttoning his flies with deft fingers.\\n\\n He smiled inwardly, remembering what else those long fingers had done. It had taken his mind temporarily off the stiffness of his body, and banished the troubling memory of dreams. He stretched, groaning, feeling the pull of muscle on tender joints. The clean linen was already sticking to chest and back.\\n\\n Jamie was ahead of him on the trail, a damp patch growing visibly between his shoulder blades where the strap of the canteen crossed his back. Roger noted with some consolation that his father-in-law was moving with a good bit less than his usual pantherlike grace this morning, too. He knew the Great Scot was only human, but it was reassuring to have that fact confimed now and then.\\n\\n “Think the weather will hold?” Roger said it as much for the sake of speaking as for anything else; Jamie was by no means garrulous, but he seemed abnormally quiet this morning, barely speaking beyond a murmured “Aye, morning,” in reply to Roger’s earlier greeting. Perhaps it was the grayness of the day, with its threat—or promise—of rain.\\n\\n The sky overhead curved low and dull as the inside of a pewter bowl. An afternoon indoors, with rain beating on the oiled hides of the windows, and wee Jemmy curled up peaceful as a dormouse for a nap, while his mother shed her shift and came to bed in the soft gray light . . . aye, well, some ways of breaking a sweat were better than others.\\n\\n Jamie stopped and glanced up at the lowering sky. He flexed his right hand, closing it to an awkward fist, then opening it slowly. The stiff fourth finger made delicate chores such as writing difficult, but did provide one dubious benefit in compensation; the swollen joints signaled rain as reliably as a barometer.\\n\\n Jamie wiggled the fingers experimentally, and gave Roger a faint smile.\\n\\n “No but a wee twinge,” he said. “Nay rain before nightfall.” He stretched, easing his back in anticipation, and sighed. “Let’s get to it, aye?”\\n\\n Roger glanced back; the house and cabin had disappeared. He frowned at Jamie’s retreating back, debating. It was nearly half a mile to the new field; ample time for conversation. Not the right time, though, not yet. It was a matter to be addressed face-to-face, and at leisure—later, then, when they paused to eat.\\n\\n The woods were hushed, the air still and heavy. Even the birds were quiet, only the occasional machine-gun burst of a woodpecker startling the silence. They threaded their way through the forest, silent as Indians on the layer of rotted leaves, and emerged from the scrub-oak thicket with a suddenness that sent a flock of crows shrieking out of the torn earth of the new-cleared field like demons escaping from the netherworld.\\n\\n “Jesus!” Jamie murmured, and crossed himself involuntarily. Roger’s throat closed tight, and his stomach clenched. The crows had been feeding on something lying in the hollow left by an uprooted tree; all he could see above the ragged clods of earth was a pale curve that looked unsettlingly like the round of a nak*d shoulder.\\n\\n It was a nak*d shoulder—of a pig. Jamie squatted by the boar’s carcass, frowning at the livid weals that marred the thick, pale skin. He touched the deep gouges on the flank with distaste; Roger could see the busy movement of flies inside the black-red cavities.\\n\\n “Bear?” he asked, squatting beside Jamie. His father-in-law shook his head.\\n\\n “Cat.” He brushed aside the stiff, sparse hairs behind the ear and pointed to the bluish puncture wounds in the folded lard. “Broke the neck wi’ one bite. And see the claw marks?” Roger had, but lacked the knowledge to differentiate the marks of a bear’s claws from those of a panther’s. He looked closely, committing the pattern to memory.\\n\\n Jamie stood, and wiped a sleeve across his face.\\n\\n “A bear would ha’ taken more of the carcass. This is barely touched. Cats will do that, though—make a kill and leave it, then come back to nibble at it, day after day.”\\n\\n Muggy as it was, the hair pricked with chill on Roger’s neck. It was much too easy to imagine yellow eyes in the shadow of the thicket behind him, fixed with cool appraisal on the spot where skull met fragile spine.\\n\\n “Think it’s still close by?” He glanced about, trying to seem casual. The forest was just as it had been, but now the silence seemed unnatural and sinister.\\n\\n Jamie waved away a couple of questing flies, frowning.\\n\\n “Aye, maybe. This is a fresh kill; no maggots yet.” He nodded at the gaping wound in the pig’s flank, then stooped to grasp the stiff trotters. “Come, let’s hang it. It’s too much meat to waste.”\\n\\n They dragged the carcass to a tree with a low, sturdy limb. Jamie reached into his sleeve and pulled out a grubby kerchief, to tie round his head to keep the sweat from burning into his eyes. Roger groped for his own kerchief—carefully washed, neatly ironed—and did likewise. Mindful of the laundering, they stripped their clean shirts and hung them over an alder bush.\\n\\n There was rope in the field, left from the stump-pulling of earlier days’ work; Jamie whipped a length several times around the pig’s forelimbs, then flung the free end over the branch above. It was a full-grown sow, some two-hundredweight of solid flesh. Jamie set his feet and hauled back on the rope, grunting with the sudden effort.\\n\\n Roger held his breath as he bent to help hoist the stiffened corpse, but Jamie had been right; it was fresh. There was the usual fleshy pig-scent, gone faint with death, and the sharper tang of blood—nothing worse.\\n\\n Rough hair scraped the skin of his belly as he wrapped his arms around the carcass, and he set his teeth against a grimace of distaste. There are few things deader than a large, dead pig. Then a word from Jamie, and the carcass was secure. He let go, and the pig swung gently to and fro, a meaty pendulum. \\n\\n","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-191.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.\\n","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
