{"id":81464,"no":194,"title":"Page 194","content":"“He stabbed you in the head?” Brianna’s voice had a slight edge, though Roger couldn’t tell whether it was meant for him or for her father. “Ah . . . no. Not exactly.” With hazy memories of swashbuckling films and university fencing matches, he’d been unprepared for the sheer brutal force involved in hand-to-hand combat with swords. Jamie’s first blow had knocked Roger’s sword from his hand and sent it flying; a later one had split the wood and sent a large chunk of it rocketing past his ear. “What does ‘not exactly’ mean?” “Well, he was showing me something called corps a corps—which appears to be French for ‘Get your opponent’s sword wrapped round your own, then knee him in the balls and punch his head while he’s trying to get loose.’” Brianna gave a brief, shocked laugh. “You mean he—” “No, but it was a near thing,” he said, wincing at the memory. “I’ve a bruise on my thigh the size of my hand.” “Are you hurt anywhere else?” Brianna was frowning at him, worried. “No.” He smiled up at her, keeping his hands in his lap. “Tired. Sore. Starving.” The frown eased and her smile flickered back, though a small line stayed between her brows. She reached for the wooden platter on the sideboard, turned, and squatted by the hearth. “Quail,” she said with satisfaction, raking a number of blackened bundles out of the ashes with the poker. “Da brought them this morning. He said not to pluck them; just wrap them in mud and bake them. I hope he knows what he’s talking about.” She jerked her head toward the boiling cauldron. “Jemmy helped me with the mud; that’s why we had to do another pot of laundry. Ouch!” She snatched away her hand and sucked a burned finger, then picked up the platter and brought it to the table. “Let them cool a little,” she instructed him. “I’ll get some of those pickles you like.” The quail looked like nothing so much as charred rocks. Still, a tantalizing steam drifted up through cracks in a few of the blackened lumps. Roger felt like picking one up and eating it on the spot, burned mud and all. Instead, he fumbled at the cloth-covered plate on the table, discovering the maligned flat-bread underneath. Stiff-fingered, he managed to tear off a good chunk, and stuffed it silently into his mouth. Jemmy had abandoned his ball of rags under the bed, and come to see what his father was doing. Pulling himself upright by the table leg, he spotted the bread and reached up, making urgent noises of demand. Roger carefully tore off another bit of bread and handed it to his offspring, nearly dropping it in the process. His hands were cut and battered; the knuckles of his right hand blood-grazed, swollen, and black with fresh bruising. Half his right thumbnail had been knocked away, and the bit of raw nail bed showed red and oozing. “Ow-ee.” Clutching his bread, Jemmy looked at Roger’s hands, then up at his face. “Daddy owee?” “Dad’s all right,” Roger assured him. “Just tired.” Jemmy stared at the injured thumb, then slowly raised his hand to his mouth and inserted his own thumb, sucking loudly. It actually looked like a good idea. His thumb stung and ached, where the nail had gone, and all his fingers were cold and stiff. With a quick glance at Brianna’s back, he lifted his hand and stuck his thumb in his mouth. It felt alien, thick and hard and tasting of silvery blood and cold grime. Then suddenly it fit, and tongue and palate closed round the injured digit in a warm and soothing pressure. Jemmy butted him in the thigh, his usual signal for “up,” and he grasped the back of the little boy’s clout with his free hand, boosting him up onto his knee. Jemmy made himself at home, rooting and squirming, then relaxed in sudden peace, bread squashed in one hand, sucking quietly on his thumb. Roger slowly relaxed, one elbow propped on the table, the other arm round his son. Jemmy’s heavy warmth and heavy breathing against his ribs were a soothing accompaniment to the homely noises Brianna was making as she dished the supper. To his surprise, his thumb stopped hurting, but he left it where it was, too tired to question the odd sense of comfort. His muscles were gradually relaxing, too, coming off the state of tensed readiness in which he’d held them for hours. His inner ear still rang with brisk instruction. Use your forearm, man—the wrist, the wrist! Dinna move your hand out like that, keep it near the body. It’s a sword, aye? Not a bloody club. Use the tip! He’d thrown Jamie heavily against a tree, at one point. And Fraser had tripped over a rock and gone down once, Roger on top. As for any actual damage inflicted with a sword, he might as well have been fighting a cloud. Dirty fighting is the only kind there is, Fraser had told him, panting, as they knelt at the stream and splashed cold water over sweating faces. Anything else is no but exhibition. His head jerked on his neck and he blinked, coming back abruptly from the grate and crash of wooden swords to the dim warmth of the cabin. The platter was gone; Brianna was cursing softly under her breath at the sideboard, banging the hilt of his dirk against the blackened lumps of clay-baked quail to crack them open. Watch your footing. Back, back—aye, now, come back at me! No, dinna reach so far . . . keep your guard up! And the stinging whap! of the springy “blade” across arms and thighs and shoulders, the solid thunk of it driven bruising home between his ribs, sunk deep and breathless in his belly. Had it been cold steel, he would have been dead in minutes, cut to bleeding ribbons. Don’t catch the blade on yours—throw it off. Beat, beat it off! Come at me, thrust! Keep it close, keep it close . . . aye, good . . . ha! His elbow slipped and his hand fell. He jerked upright, barely keeping hold of the sleeping child, and blinked, vision swimming with firelight. Brianna started guiltily and shut her notebook. Getting to her feet, she thrust it out of sight behind a pewter plate, resting upright on its edge at the back of the sideboard. “It’s ready,” she said hurriedly. “I just—I’ll get the milk.” She disappeared into the pantry in a rustle of skirts. Roger shifted Jemmy, got a grip, and lifted the small, solid body up to his shoulder, though his arms felt like cooked noodles. The little boy was sound asleep, but kept his thumb plugged firmly into his mouth. Roger’s own thumb was wet with spittle, and he felt a flush of embarrassment. Christ, had she been drawing him that way? No doubt; she must have caught sight of him sucking his thumb and thought it “cute”; it wouldn’t be the first time she’d drawn him in what he considered a compromising position. Or was she writing dreams again? He laid Jemmy gently in his cradle, brushed damp bread crumbs off the coverlet, and stood rubbing his bruised knuckles with the fingers of his other hand. Sloshing noises came from the pantry. Moving quietly, he stepped to the sideboard and extracted the book from its hiding place. Sketches, not dreams. It was no more than a few quick lines, the essence of a sketch. A man tired to death, still watchful; head on one hand, neck bowed with exhaustion—free arm clamped tight around a treasured, helpless thing. She’d titled it. En garde, it said, in her slanted, spiky script. He closed the book and slid it back behind the plate. She was standing in the pantry doorway, the milk jug in her hand. “Come and eat,” she said softly, eyes on his. “You need your strength.” 88 ROGER BUYS A SWORD Cross Creek November, 1771 HE’D HANDLED EIGHTEENTH-CENTURY broadswords before; neither the weight nor the length surprised him. The basket around the hilt was slightly bent, but not enough to interfere with fitting his hand inside the grip. He’d done that before, too. There was a considerable difference, though, beyond reverently placing an antique artifact into a museum display, and picking up a length of sharpened metal with the conscious intent of driving it through a human body. “It’s a bit battered,” Fraser had told him, squinting critically down the length of the sword before handing it to him, “but the blade’s well-balanced. Try the feel of it, to see if it suits.” Feeling a total fool, he slipped his hand into the basket and struck a fencing pose, based on memories of Errol Flynn films. They were standing in the busy lane outside the smithy in Cross Creek, and a few passersby paused to watch and offer helpful comment. “What’s Moore asking for that bit of pot tin?” someone asked disparagingly. “Anything more than two shillings, and it’s highway robbery.” “That’s a fine sword,” said Moore, leaning over the half-door of his forge and glowering. “I had it from my uncle, who saw service at Fort Stanwyck. Why, that blade’s killed a-many Frenchmen, and no but the one wee nick to be seen in it.” “One nick!” cried the disparager. “Why, the thing’s bent so, if you went to stick a man, you’d end up cutting off his ear!” There was a laugh from the gathering crowd that drowned the smith’s response. Roger lowered the point of the sword, raised it slowly. How the hell did one road-test a sword? Ought he to wave it to and fro? Stick something with it? There was a cart standing a little way down the lane, loaded with burlap bags of something—raw wool, from the smell. He looked for the proprietor of the bags, but couldn’t pick him out from the growing crowd; the huge draft horse hitched to the cart was unattended, ears twitching sleepily over his dropped reins. “Ah, if it’s a sword the young man’s wanting, sure and Malachy McCabe has a better one than that, left from his service. I think he’d part with it for nay more than three shillings.” The cobbler from across the lane pursed his lips, nodding shrewdly at the sword. “’Tisn’t an elegant piece,” one middle-aged ex-soldier agreed, head tilted on one side. “Serviceable, though, I grant you that.” Roger extended his arm, lunged toward the door of the smithy, and narrowly missed Moore, coming out to defend the quality of his wares. The smith leaped aside with a startled cry, and the crowd roared. Roger’s apology was interrupted by a loud, nasal voice behind him. “Here, sir! Let me offer a foe more worthy of your steel than an unarmed smith!” Whirling round, Roger found himself confronting Dr. Fentiman, who was pulling a long, thin blade from the head of his ornamental cane. The doctor, who was roughly half Roger’s size, brandished his rapier with a genial ferocity. Obviously fueled by a liberal luncheon, the tip of his nose glowed like a Christmas bulb. “A test of skill, sir?” The doctor whipped his sword to and fro, so the narrow blade sang as it cut the air. “First to pink his man, first to draw blood is the victor, what say you?” “Oh, an unfair advantage to the doctor! And isn’t drawing blood your business, then?” “Ha ha! And if ye run him through instead of pinking him, will ye patch the hole for no charge?” yelled another onlooker. “Or are ye out to drum up business, leech?” “Watch yourself, young man! Turn your back on him and he’s like to give ye a clyster!”","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-194.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
