{"id":81493,"no":223,"title":"Page 223","content":"Here the text broke off, as Jenny had apparently been called away upon some domestic errand. It resumed, freshly dated, on the next page.\\n\\n September 18, 1771\\n\\n I dream of young Ian now and then. . . .\\n\\n “What?” I exclaimed. “To hell with Young Ian—who was with Laoghaire?”\\n\\n “I should like to know that myself,” Jamie muttered. The tips of his ears were dark with blood, but he didn’t look up from the page.\\n\\n I dream of Ian now and then. These dreams most often take the shape of daily life, and I see him here at Lallybroch, but now and again I dream of him in his life among the savages—if indeed he still lives (and I persuade myself that my heart would by some means know if he did not).\\n\\n So I see that what it comes to in the end is only the same thing with which I began—that one word, “Brother.” You are my brother, as young Ian is my son, the both of you my flesh and my spirit and always shall be. If the loss of Ian haunts my dreams, the loss of you haunts my days, Jamie.\\n\\n He stopped reading for a moment, swallowing, then went on, his voice steady.\\n\\n I have been writing letters all the morning, debating with myself whether to finish this one, or to put it into the fire instead. But now the accounts are done, I have written to everyone I can think of, and the clouds have gone away, so the sun shines through the window by my desk, and the shadows of Mother’s roses are falling over me.\\n\\n I have thought to myself often and often that I heard my mother speak to me, through all these years. I do not need to hear her now, though, to ken well enough what she would say. And so I shall not put this in the fire.\\n\\n You remember, do you, the day I broke the good cream-pitcher, flinging it at your head because you deviled me? I know you recall the occasion, for you once spoke to Claire of it. I hesitated to admit the crime, and you took the blame upon yourself, but Father kent the truth of it, and punished us both.\\n\\n So now I am a grandmother ten times over, with my hair gone grey, and still I feel my cheeks go hot with shame and my wame shrink like a fist, thinking of Father bidding us kneel down side by side and bend over the bench to be whipped.\\n\\n You yelped and grunted like a puppy when he tawsed you, and I could scarce breathe and did not dare to look at you. Then it was my turn, but I was so wrought with emotion that I think I barely felt the strokes. No doubt you are reading this and saying indignantly that it was only Father was softer with me because I was a lass. Well, maybe so, and maybe no; I will say Ian is gentle with his daughters.\\n\\n Jamie snorted at this.\\n\\n “Aye, ye’ve got that right,” he muttered. He rubbed his nose with one finger and resumed, drumming his fingers on the desk as he read.\\n\\n But then Father said you would have another whipping, this one for lying—for the truth was the truth, after all. I would have got up and fled away then, but he bade me stay as I was, and he said to me, quiet, that while you would pay the price of my cowardice, he did not think it right for me to escape it altogether.\\n\\n Do you know that you did not make a sound, the second time? I hope you did not feel the strokes of the tawse on your backside, because I felt each one.\\n\\n I swore that day that I should not ever be a coward again.\\n\\n And I see that it is cowardice indeed, that I should go on blaming you for Young Ian. I have always kent what it is to love a man—be he husband or brother, lover or son. A dangerous business; that’s what it is.\\n\\n Men go where they will, they do as they must; it is not a woman’s part to bid them stay, nor yet to reproach them for being what they are—or for not coming back.\\n\\n I knew it when I sent Ian to France with a cross of birchwood and a lock of my hair made into a love knot, praying that he might come home to me, body and soul. I knew it when I gave you a rosary and saw you off to Leoch, hoping you would not forget Lallybroch or me. I knew it when Young Jamie swam to the seal’s island, when Michael took ship for Paris, and I should have known it, too, when wee Ian went with you.\\n\\n But I have been blessed in my life; my men have always come back to me. Maimed, perhaps; a bit singed round the edges now and then; crippled, crumpled, tattered, and torn—but I have always got them back. I grew to expect that as my right, and I was wrong to do so.\\n\\n I have seen so many widows since the Rising. I cannot say why I thought I should be exempt from their suffering, why I alone should lose none of my men, and only one of my babes, my wee girl-child. And since I had lost Caitlin, I treasured Ian, for I knew he was the last babe I should bear.\\n\\n I thought him my babe still; I should have kent him for the man he was. And that being so, I know well enough that whether you might have stopped him or no, you would not—for you are one of the damnable creatures, too.\\n\\n Now I have nearly reached the end of this sheet, and I think it profligate to begin another.\\n\\n Mother loved you always, Jamie, and when she kent she was dying, she called for me, and bade me care for you. As though I could ever stop.\\n\\n Your most Affectionate and Loving Sister,\\n\\n Janet Flora Arabella Fraser Murray\\n\\n Jamie held the paper for a moment, then set it down, very gently. He sat with his head bent, propped on his hand so that I couldn’t see his face. His fingers were splayed through his hair, and kept moving, massaging his forehead as he slowly shook his head, back and forth. I could hear him breathing, with a slight catch in his breath now and then.\\n\\n Finally he dropped his hand and looked up at me, blinking. His face was deeply flushed, there were tears in his eyes, and he wore the most remarkable expression, in which bewilderment, fury, and laughter were all mingled, laughter being only slightly uppermost.\\n\\n “Oh, God,” he said. He sniffed, and wiped his eyes on the back of his hand. “Oh, Christ. How in hell does she do that?”\\n\\n “Do what?” I pulled a clean handkerchief from my bodice and handed it to him.\\n\\n “Make me feel as though I am eight years old,” he said ruefully. “And an idiot, to boot.”\\n\\n He wiped his nose, then reached out a hand to touch the flattened roses, gently.\\n\\n I WAS THRILLED with Jenny’s letter, and knew that Jamie’s heart was substantially lightened by its receipt. At the same time, I remained extremely curious about the incident she had begun to describe—and knew that Jamie was even more interested, though he carefully refrained from saying so.\\n\\n A letter arrived a week or so later, sent by his brother-in-law Ian, but while this contained the usual news of Lallybroch and Broch Mordha, it made no mention whatever of Jenny’s adventure near Balriggan, nor her subsequent discovery in the grape arbor.\\n\\n “I don’t suppose you could ask either of them?” I suggested delicately, perched on the fence as I watched him preparing to castrate a litter of piglets. “Ian or Jenny?”\\n\\n “I could not,” Jamie replied firmly. “And after all, it’s no my business, is it? If yon woman was ever my wife, she surely is not now. If she chooses to take a lover, it’s her own affair. Surely.” He stamped on the foot-bellows, fanning up the small fire in which the cautery iron was heating, and pulled the castrating shears from his belt. “Which end of the business d’ye want, Sassenach?”\\n\\n It was a choice between the strong possibility of being bitten while clipping the teeth and the certainty of being shitten while assaulting the other end. The unfortunate truth was that Jamie was far stronger than I, and while he could certainly castrate an animal with no difficulty at all, I did have some professional expertise. It was therefore practicality rather than heroism that dictated my choice, and I had prepared for this activity by donning my heavy canvas apron, wooden clogs, and a ragged ex-shirt that had once belonged to Fergus, and was bound from the pigpen straight into the fire.\\n\\n “You hold; I’ll snip.” I slid off the fence and took the shears.\\n\\n There ensued a brief but noisy interlude, after which the five piglets were sent off to a consolatory meal of kitchen scraps, their rear aspects heavily daubed with a tar and turpentine mixture to prevent infection.\\n\\n “What do you think?” I asked, seeing them settle down to their feeding in an apparent state of content. “If you were a pig, I mean. Would you rather root for your food, but keep your balls, or give them up and wallow in luxurious swill?” These would be kept penned, raised carefully on slops for tender meat, while most of the pigs were routinely turned out into the wood to manage for themselves.\\n\\n Jamie shook his head.\\n\\n “I suppose they canna miss what they’ve never had,” he said. “And they’ve had food, after all.” He leaned on the fence for a few moments, watching the curly tails begin to wag and twirl with pleasure, the tiny wounds beneath apparently forgotten.\\n\\n “Besides,” he added cynically, “a pair of ballocks may bring a man more sorrow than joy—though I havena met many who’d wish them gone, for all that.”\\n\\n “Well, priests might find them a burden, I suppose.” I pulled the stained shirt gingerly away from my body before lifting it over my head. “Phew. Nothing smells worse than pig excrement—nothing.”\\n\\n “What—not a blackbirder’s hold, or a rotting corpse?” he asked, laughing. “Festering wounds? A billy goat?”\\n\\n “Pig shit,” I said firmly. “Hands down.”\\n\\n Jamie took the wadded shirt from me and ripped it into strips, reserving the cleanest ones for jobs like wiping tools and wedging cracks. The rest he consigned to the fire, stepping back as a random breeze blew a plume of reeking smoke in our direction.\\n\\n “Aye, well, there was Narses. He was a great general, or so they say, in spite of being a eunuch.”\\n\\n “Perhaps a man’s mind works better without the distraction,” I suggested, laughing.\\n\\n He gave no more than a brief snort in reply to this, though it was tinged with amusement. He shoveled dirt onto the cinders of the fire, while I retrieved my cautery iron and tar-pot, and we went back to the house, talking of other things.\\n\\n My mind lingered on that one remark, though—“a pair of ballocks may bring a man more sorrow than joy.” Had he been speaking only generally? I wondered. Or had there been some personal allusion lurking in it?\\n\\n In everything he had ever said to me regarding his brief marriage to Laoghaire MacKenzie—little as that was, by our common consent—there had been no hint that he had felt physically drawn to her. He had wed her from loneliness and a sense of duty, wanting some small anchor in the emptiness his life had been after his return from England. Or so he had said.\\n\\n And I believed what he’d said. He was a man of honor and duty, and I knew what his loneliness had been—for I had had my own. On the other hand, I knew his body, nearly as well as my own. If it had a great capacity to endure hardship, it had an equal capacity to experience great joy. Jamie could be ascetic from necessity—never from natural temperament.\\n\\n Most of the time I succeeded in forgetting that he had shared Laoghaire’s bed, however briefly and—he said—unsatisfactorily. I did not forget that she had been, and was still, quite an attractive woman.\\n\\n Which left me rather wishing that Jenny Murray had found some other inspiration for the conversion of her feelings toward her brother.\\n\\n JAMIE WAS QUIET and abstracted through the rest of the day, though he roused himself to be sociable when Fergus and Marsali arrived with their children for a visit after supper. He taught Germain to play draughts, while Fergus recalled for Roger the words of a ballad he had picked up in the alleys of Paris as a juvenile pickpocket. The women retired to the hearth to stitch baby gowns, knit booties, and—in honor of Marsali’s advancing pregnancy and Lizzie’s engagement—entertain each other with hair-raising anecdotes of labor and birth. \\n\\n","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-223.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.\\n","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
