{"id":81509,"no":239,"title":"Page 239","content":"“Haunt the place?”\n “Aye, of course. A murder victim, done to death here, and hidden, unavenged?”\n “You mean . . . really haunt the place?” I asked, carefully, “or do you only mean the slaves would think so?”\n He shrugged, twitching his shoulders uneasily.\n “I dinna think it matters so much, does it? They’ll avoid the spot where he’s buried, one of the women will see the ghost at night, rumors will get round, as they do—and next thing, a slave at Greenoaks will say something, someone in Farquard’s family will hear of it, and before ye know it, someone will be over here, asking questions. Given that the Navy is like to be looking for the Lieutenant before too long anyway . . . what d’ye say to weighting the body and putting it in the river? That’s what he had in mind for Duncan, after all.”\n “Not a bad notion,” I said, considering it. “But he meant Duncan to be found. There’s a lot of boat traffic on the river, and it isn’t very deep up this far. Even if we weighted the body well, it’s possible it would rise, or someone snag it with a pole. Would it matter if someone found it, though, do you think? The body wouldn’t be connected with River Run.”\n He nodded slowly, moving the torch aside to keep the sparks from showering over his sleeve. There was a light wind, and the elms near the barbecue pit whispered restlessly overhead.\n “Aye, that’s so. Only, if someone does find him, there’ll be an inquiry. The Navy will send someone to try to find out the truth of the matter—and they’ll come here, asking questions. What d’ye think will happen, if they were to badger the slaves, askin’ had they seen the Lieutenant, and so on?”\n “Mm, yes.” Given the slaves’ present acute state of nerves, I imagined that any inquiry would send one or more of them into a state of panic, in which anything might be blurted out.\n Jamie was standing quite still, staring at the burlap-draped shape with an expression of deep abstraction. I drew a deep breath, caught a faint scent of decaying blood, and let it out again, quick.\n “I suppose . . . we could burn him,” I said, and swallowed a sudden taste of bile. “He is already in the pit, after all.”\n “It’s a thought,” Jamie said, and one corner of his mouth quirked in a faint smile. “But I think I’ve a better one, Sassenach.” He turned to look thoughtfully at the house. A few windows were dimly alight, but everyone was inside, cowering.\n “Come on, then,” he said, with sudden decision. “There’ll be a sledgehammer in the stable, I expect.”\n THE FRONT OF THE MAUSOLEUM was covered by an ornamental grille of black wrought iron, with an enormous lock, its metal decorated by sixteen-petalled Jacobite roses. I had always considered this to be merely one of Jocasta Cameron’s affectations, since I doubted that grave-robbers were a great threat in such a rural setting. The hinges scarcely creaked when Jamie unlocked the grille and swung it open; like everything else at River Run, it was maintained in impeccable condition.\n “You really think this is better than burying or burning him?” I asked. There was no one nearby, but I spoke in a near whisper.\n “Oh, aye. Auld Hector will take care of him, and prevent him doin’ harm,” Jamie replied matter-of-factly. “And it’s blessed ground, in a manner of speaking. No a matter of leaving his soul to wander about, makin’ trouble, aye?”\n I nodded, a little uncertainly. He was probably right; in terms of belief, Jamie understood the slaves much better than I did. For that matter, I wasn’t sure whether he was speaking only of what the psychological effect on them might be—or whether he was himself convinced that Hector Cameron ought to be capable of dealing with this ex post facto threat to his wife and plantation.\n I lifted the torch so Jamie could see what he was doing, and set my teeth in my lower lip.\n He had wrapped the sledgehammer in rags, so as not to chip the marble blocks. The small blocks of the front wall, inside the grille, had been expertly cut to fit and lightly mortared in place. The first blow knocked two of the blocks a few inches out of place. A few more blows, and a dark space showed, where the blocks had given way enough to show the blackness inside the mausoleum.\n Jamie stopped to wipe sweat from his forehead, and muttered something under his breath.\n “What did you say?”\n “I said, it stinks,” he replied, sounding puzzled.\n “This is surprising, is it?” I asked, a little testily. “How long has Hector Cameron been dead, four years?”\n “Well, aye, but it’s no—”\n “What are you doing?” Jocasta Cameron’s voice rang out behind me, sharp with agitation, and I jumped, dropping the torch.\n It flickered, but didn’t go out, and I snatched it up again, waving it to encourage the flame. The flame rose and steadied, shedding a ruddy glow on Jocasta, who stood on the path behind us, ghostly in her white nightgown. Phaedre huddled behind her mistress, no more of her face visible than the brief shine of eyes in the darkness. The eyes looked scared, flicking from Jamie and me to the dark hole in the facade of the mausoleum.\n “What am I doing? Disposing of Lieutenant Wolff, what else?” Jamie, who had been as startled as I had by his aunt’s sudden appearance, sounded a little cross. “Leave it to me, Aunt. Ye needna concern yourself.”\n “You are not—no, ye mustn’t open Hector’s tomb!” Jocasta’s long nose twitched, obviously picking up the scent of decay—which was faint, but distinct.\n “Dinna fash yourself, Aunt,” Jamie said. “Go back to the house. I’ll manage. It will all be well.”\n She ignored his soothing words, advancing blindly over the walk, hands groping in the empty air.\n “No, Jamie! Ye mustn’t. Close it up again. Close it, for God’s sake!”\n The panic in her voice was unmistakable, and I saw Jamie frown in confusion. He looked uncertainly from his aunt to the hole in the mausoleum. The wind had dropped, but now rose in a small gust, wafting a much stronger scent of death around us. Jamie’s face changed, and ignoring his aunt’s cries of protest, he knocked loose more blocks with several quick blows of the padded hammer.\n “Bring the torch, Sassenach,” he said, setting down the hammer, and with a sense of creeping horror, I did so.\n We stood shoulder to shoulder, peering through the narrow gap in the blocks. Two coffins of polished wood stood inside, each on a pedestal of marble. And on the floor between them . . .\n “Who is he, Aunt?” Jamie’s voice was quiet as he turned to speak to her.\n She stood as if paralyzed, the muslin of her gown flapping round her legs in the wind, pulling strands of white hair from beneath her cap. Her face was frozen, but the blind eyes darted to and fro, seeking an impossible escape.\n Jamie stepped forward and grabbed her fiercely by the arm, making her start from her frozen trance.\n “Co a th’ann?” he growled. “Who is he? Who?”\n Her mouth worked, trying to form words. She stopped, swallowed, tried again, eyes still flickering to and fro over his shoulder, looking at God knew what. Had she still been able to see when they put him in there? I wondered. Did she see it now, in memory?\n “His name—his name was Rawlings,” she said faintly, and something inside my chest fell like an iron weight.\n I must have moved or made some sound, for Jamie’s eyes went to me. He reached out a hand for mine, and held on tightly, though his eyes went back to Jocasta.\n “How?” he asked, calmly, but with a tone that warned that he would brook no evasion.\n She closed her eyes then, and sighed, broad shoulders slumping suddenly.\n “Hector killed him,” she said.\n “Oh, aye?” Jamie cast a cynical glance at the coffins inside the mausoleum, and the huddled mass that lay on the floor between them. “A good trick, that. I hadna realized my uncle was so capable.”\n “Before.” Her eyes opened again, but she spoke dully, as though nothing mattered any longer. “He was a doctor, Rawlings. He’d come to look at my eyes, once before. When Hector took ill, he called the man back. I canna say quite what happened, but Hector caught him nosing round where he should not, and smashed his head in. He was a hot-tempered man, Hector.”\n “I should say so,” Jamie said, with another glance at the body of Dr. Rawlings. “How did he get in here?”\n “We—he—hid the corpse, meaning to carry it off and leave it in the wood. But then . . . Hector got worse, and couldna leave his bed. Within a day, he was dead, too. And so . . .” She lifted a long white hand, gesturing toward the draft of dank chill that floated from the open tomb.\n “Great minds think alike,” I murmured, and Jamie gave me a dirty look, letting go my hand. He stood contemplating the stillness inside the violated mausoleum, thick brows drawn down in a frown of concentration.\n “Oh, aye?” he said again. “Whose is the second coffin?”\n “Mine.” Jocasta was recovering her nerve; her shoulders straightened and her chin lifted.\n Jamie made a small puffing noise and glanced at me. I could believe that Jocasta would callously leave a dead man to lie exposed, rather than put him in her own pristine coffin . . . and yet. To do so drastically increased the odds of discovery, slim as those might be.\n No one would have opened Jocasta’s coffin until it was time to receive her own body; Dr. Rawlings’ corpse could have lain there in complete safety, even were the mausoleum to be opened for some reason. Jocasta Cameron was selfish—but by no means stupid.\n “Put Wolff in, then, if you must,” she said. “He can lie on the floor with the other one.”\n “Why not put him in your coffin, Aunt?” Jamie asked, and I saw that he was looking at her intently.\n “No!” She had begun to turn away, but at this whipped back, her blind face fierce in the torchlight. “He is dung. Let him lie and rot in the open!”\n Jamie narrowed his eyes at her response, but didn’t reply. Instead, he turned to the tomb and began to shift the loosened blocks.\n “What are you doing?” Jocasta could hear the grating noise of the shifting marble, and became agitated anew. She turned round on the walk, but became disoriented, staring off toward the river. I realized that she must now be completely blind, unable even to see the light from the torch.\n I had no attention to pay her just then, though. Jamie wedged himself through the gap in the blocks, and stepped inside.\n “Light me, Sassenach,” he said softly, and his voice echoed slightly in the small stone chamber.\n Breathing very shallowly, I followed him. Phaedre had begun to moan in the darkness outside; she sounded like the ban-sidhe that howls for approaching death—but this death had come long since.\n The coffins were equipped with brass plates, gone slightly green with damp, but still easily readable. “Hector Alexander Robert Cameron,” read one, and “Jocasta Isobeail MacKenzie Cameron,” the other. Without hesitation, Jamie seized the edges of the lid of Jocasta’s coffin and pulled up. \n","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-239.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: \n The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.\n \n","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
