{"id":81514,"no":244,"title":"Page 244","content":"“Come!”\n “No, I said ye must . . .” Roger began.\n “COME!”\n “Now, look, lad—” both men began together, then stopped, looked at each other, and laughed.\n “Where’s Mummy, then?” Roger said, trying another tack. “Mummy will be worried about you, aye?”\n The small red head shook in vehement negation.\n “Claire said the women meant to be quilting today,” Jamie said to Roger. “Marsali’s brought a pattern; they’ll maybe have started the stitching of it.” He squatted down beside Roger, eye to eye with his grandson.\n “Have ye got away from your mother, then?”\n The soft pink mouth, hitherto clamped tight, twitched, allowing a small giggle to escape.\n “Thought so,” Roger said in resignation. “Come on, then. Back to the house.” He stood up and swung the little boy up into his arms, rock and all.\n “No, no! NO!” Jemmy stiffened in resistance, his feet digging painfully into Roger’s belly as his body arched backward like a bow. “Me help! Me HELP!”\n Trying to make his own arguments heard through Jemmy’s roars without shouting, while at the same time keeping the boy from falling backward onto his head, Roger didn’t at first hear the cries from the direction of the house. When he finally resorted to clapping a hand over his offspring’s wide-open mouth, though, feminine calls of “Jeeeeemmmeeeeeeee!” were clearly audible through the trees.\n “See, Mrs. Lizzie’s looking for ye,” Jamie said to his grandson, jerking a thumb toward the sound.\n “Not only Lizzie,” Roger said. More women’s voices were echoing the chorus, with increasing notes of annoyance. “Mum and Grannie Claire, and Grannie Bug and Auntie Marsali, too, from the sounds of it. They don’t sound very pleased with you, lad.”\n “We’d best take him, back, then,” Jamie said. He looked at his grandson, not without sympathy. “Mind, you’re like to get your bum smacked, laddie. Women dinna like it when ye run off on them.”\n This threatening prospect caused Jemmy to drop his rock and wrap his arms and legs tightly round Roger.\n “Go with YOU, Daddy,” he said coaxingly.\n “But Mummy—”\n “NO MUMMY! Want Daddy!”\n Roger patted Jemmy’s back, small but solid under his grubby smock. He was torn; this was the first time Jem had so definitely wanted him in preference to Bree, and he had to admit to a sneaking feeling of flattery. Even if his son’s present partiality sprang as much from an urge to avoid punishment as from a desire for his company, Jem had wanted to come with him.\n “I suppose we could take him,” he said to Jamie, over Jem’s head, now nestled trustingly against his collarbone. “Just for the morning; I could fetch him back at noon.”\n “Oh, aye,” Jamie said. He smiled at his grandson, picked up the fallen stone, and handed it back to him. “Building hogpens is proper man’s work, aye? None of this prinking and yaffling the ladies are so fond of.”\n “Speaking of yaffling . . .” Roger lifted his chin in the direction of the house, where the cries of “JEEMEEEEE!” were now taking on a distinctly irritated tone, tinged with panic. “We’d best tell them we have him.”\n “I’ll go.” Jamie dropped the rucksack off his shoulder with a sigh, and raised one eyebrow at his grandson. “Mind, lad, ye owe me. When women are in a fret, they’ll take it out on the first man they see, whether he’s to blame or not. Like enough I’ll get my bum smacked.” He rolled his eyes, but grinned at Jemmy, then turned and set off for the house at a trot.\n Jemmy giggled.\n “Smack, Grand-da!” he called.\n “Hush, wee rascal.” Roger gave him a soft slap on the bottom, and realized that Jem was wearing short breeks under his smock, but no clout under them. He swung the boy down onto his feet.\n “D’ye need to go potty?” he asked automatically, falling into Brianna’s peculiar idiom.\n “No,” Jem said, just as automatically, but with a reflexive kneading of his crotch that made his father take him by the arm, firmly steering him off the path and behind a convenient bush.\n “Come on. Let’s have a try, while we wait for Grand-da.”\n IT SEEMED RATHER a long time before Jamie reappeared, though the indignant cries of the searchers had been quickly stilled. If Jamie had got his bum smacked, Roger thought cynically, he appeared to have enjoyed it. A slight flush showed on the high cheekbones, and he wore a faint but definite air of satisfaction.\n This was explained at once, though, when Jamie produced a small bundle from inside his shirt and unwrapped a linen towel, revealing half a dozen fresh biscuits, still warm, and dripping with melted butter and honey.\n “I think perhaps Mrs. Bug meant them for the quilting circle,” he said, distributing the booty. “But there was plenty of batter left in the bowl; I doubt they’ll be missed.”\n “If they are, I’ll blame it on you,” Roger assured him, catching a dribble of warm honey that ran down his wrist. He wiped it off and sucked his finger, eyes closing momentarily in ecstasy.\n “What now, ye’d give me up to the Inquisition?” Jamie’s eyes creased into blue triangles of amusement as he wiped crumbs from his mouth. “And after I shared my plunder with ye, too—there’s gratitude!”\n “Your reputation will stand it,” Roger said wryly. “Jem and I are persona non grata after what happened to her spice cake last week, but Himself can do no wrong, as far as Grannie Bug is concerned. She wouldn’t mind if you ate the entire contents of the pantry single-handed.”\n Jamie licked a smear of honey from the corner of his mouth, with the smug complacency of a man permanently in Mrs. Bug’s good books.\n “Well, that’s as may be,” he admitted. “Still, if ye expect to blame it on me, we’d best wipe a bit of the evidence off the laddie before we go home.”\n Jemmy had been addressing himself to his treat with single-minded concentration, with the result that his entire face gleamed with butter, daubs of honey ran in amber trails down his smock, and what appeared to be several small globs of half-chewed biscuit were stuck in his hair.\n “How in hell did you do that so fast?” Roger demanded in amazement. “Look what ye’ve done to your shirt! Your mother will kill us both.” He took the towel and made an abortive attempt to wipe some of the mess off, but succeeded only in spreading it farther.\n “Dinna fash,” Jamie said tolerantly. “He’ll be so covered wi’ filth by the end of the day, his mother will never notice a few crumbs extra. Watch out, lad!” A quick grab saved half a biscuit that had broken off as the boy made an attempt to cram the last pastry into his mouth in a single gulp.\n “Still,” Jamie said, biting thoughtfully into the rescued biscuit-half as he looked at his grandson, “perhaps we’ll souse him in the creek a bit. We dinna want the pigs to smell the honey on him.”\n A faint qualm of unease went over Roger, as he realized that Jamie was in fact not joking about the pigs. It was common to see or hear pigs in the wood nearby, rooting through the leaf-mold under oaks and poplars, or grunting blissfully over a trove of chestnut mast. Food was plentiful at this season, and the pigs were no threat to grown men. A small boy, though, smelling of sweetness . . . you thought of pigs as only eating roots and nuts, but Roger had a vivid memory of the big white sow, seen a few days before, with the nak*d, blood-smeared tail of a possum dangling from her maw as she champed placidly away.\n A chunk of biscuit seemed to be stuck in his throat. He picked Jemmy up, despite the stickiness, and tucked him giggling under one arm, so the little boy’s arms and legs dangled in the air.\n “Come on, then,” Roger said, resigned. “Mummy won’t like it a bit, if you get eaten by a pig.”\n FENCE POLES LAY piled near the stone pillar. Roger dug about until he found a splintered piece short enough for convenience, and used it to lever a big chunk of granite up far enough to get both hands under it. Squatting, he got it onto his thighs, and very slowly stood up, his back straightening one vertebra at a time, fingers digging into the lichen-splotched surface with the effort of lifting. The rag tied round his head was drenched, and perspiration was running down his face. He shook his head to flick the stinging sweat out of his eyes.\n “Daddy, Daddy!”\n Roger felt a sudden tug at his breeches, blinked sweat out of his eye, and planted his feet well apart to keep his balance without dropping the heavy rock. He tightened his grip and glanced down, annoyed.\n “What, lad?”\n Jemmy had tight hold of the cloth with both hands. He was looking toward the wood.\n “Pig, Daddy,” he whispered. “Big pig.”\n Roger glanced in the direction of the little boy’s gaze and froze.\n It was a huge black boar, perhaps eight feet away. The thing stood more than three feet at the shoulder, and must weigh two hundred pounds or more, with curving yellow tushes the length of Jemmy’s forearm. It stood with lifted head, piggy snout moistly working as it snuffed the air for food or threat.\n “Shit,” Roger said involuntarily.\n Jemmy, who would normally have seized on any inadvertent vulgarity and trumpeted it gleefully, now merely clung tighter to his father’s leg.\n Thoughts raced through Roger’s mind like colliding freight cars. Would it attack if he moved? He had to move; the muscles of his arms were trembling under the strain. He’d splashed Jem with water; did the boy still smell—or look—like something on the pig’s menu?\n He picked one coherent thought out of the wreckage.\n “Jem,” he said, his voice very clam, “get behind me. Do it now,” he added with emphasis, as the boar turned its head in their direction.\n It saw them; he could see the small dark eyes change focus. It took a few steps forward, its hooves absurdly small and dainty under its menacing bulk.\n “Do you see Grand-da, Jem?” he asked, keeping his voice calm. Streaks of fire were burning through his arms, and his elbows felt as though they’d been crushed in a vise.\n “No,” Jemmy whispered. Roger could feel the little boy crowding close behind him, pressed against his legs.\n “Well, look round. He went to the stream; he’ll be coming back from that direction. Turn round and look.”\n The boar was cautious, but not afraid. That was what came of not hunting the things sufficiently, he thought. They ought to be gutting a few in the wood once a week, as an object lesson to the rest.\n “Grand-da!” Jemmy’s voice rang out from behind him, shrill with fear.\n At the sound, the pig’s hackles sprang suddenly erect in a ridge of coarse hair down its spine and it lowered its head, muscles bunching.\n “Run, Jem!” Roger cried. “Run to Grand-da!” A surge of adrenaline shot through him and suddenly the rock weighed nothing. He flung it at the charging pig, catching it on the shoulder. It gave a whuff! of surprise, faltered, then opened its mouth with a roar and came at him, tushes slashing as it swung its head. \n","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-244.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: \n The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.\n \n","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
