{"id":81304,"no":32,"title":"Page 32","content":"Jamie raised his voice, drowning out Ronnie’s incensed response to this calumny.\\n\\n “And was it Kenny that hunted the hogs for ye, mistress? Wild hogs have a chancy nature; surely it’s a dangerous business to be stalking beasts of that size. Like the wild boar that we hunted in Scotland, aye?”\\n\\n “Ha.” Rosamund cast a look of good-natured scorn toward the slope above, where her husband—roughly half her size—presumably was engaged in less strenuous pursuits. “No, indeed, Mr. Fraser, I kilt this lot myself. With that ax,” she added pointedly, nodding toward the instrument in question and narrowing her eyes in a sinister fashion at Ronnie. “Caved in their skulls with one blow, I did.”\\n\\n Ronnie, not the most perceptive of men, declined to take the hint.\\n\\n “It’s the tomato fruits she’s using, Mac Dubh,” he hissed, tugging at Jamie’s sleeve and pointing at the red-crusted bowl. “Devil’s apples! She’ll poison us all!”\\n\\n “Oh, I shouldna think so, Ronnie.” Jamie took a firm grip on Ronnie’s arm, and smiled engagingly at Rosamund. “Ye mean to sell the meat, I suppose, Mrs. Lindsay? It’s a poor merchant that would kill her customers, aye?”\\n\\n “I ain’t yet lost a one, Mr. Fraser,” Rosamund agreed, turning back another sheet of burlap and leaning over to dribble sauce from a wooden ladle over a steaming haunch. “Ain’t never had but good words about the taste, neither,” she said, “though a-course that would be in Boston, where I come from.”\\n\\n Where folk have sense, her tone clearly implied.\\n\\n “I met a man from Boston, last time I went to Charlottesville,” Ronnie said, his foxy brows drawn down in disapproval. He tugged, trying to free his arm from Jamie’s grip, but to no avail. “He said to me as it was his custom to have beans at his breakfast, and oysters to his supper, and so he’d done every day since he was a wean. A wonder he hadna blown up like a pig’s bladder, filled wi’ such wretched stuff as that!”\\n\\n “Beans, beans, they’re good for your heart,” I said cheerily, seizing the opening. “The more you eat, the more you fart. The more you fart, the better you feel—so let’s have beans for every meal!”\\n\\n Ronnie’s mouth dropped open, as did Mrs. Lindsay’s. Jamie whooped with laughter, and Mrs. Lindsay’s look of astonishment dissolved into a booming laugh. After a moment, Ronnie rather reluctantly joined in, a small grin twisting up the corner of his mouth.\\n\\n “I lived in Boston for a time,” I said mildly, as the hilarity died down a bit. “Mrs. Lindsay, that smells wonderful!”\\n\\n Rosamund nodded with dignity, gratified.\\n\\n “Why, so it does, ma’am, and I say so.” She leaned toward me, lowering her voice—slightly—from its normal stentorian range. “It’s my private receipt what does it,” she said, with a proprietorial pat of the pottery bowl. “Brings out the flavor, see?”\\n\\n Ronnie’s mouth opened, but only a small yelp emerged, the evident result of Jamie’s hand tightening about his biceps. Rosamund ignored this, engaging in an amiable discussion with Jamie that terminated in her agreeing to reserve an entire carcass for use at the wedding feast.\\n\\n I glanced at Jamie, hearing this. Given that Father Kenneth was probably at present en route either back to Baltimore or to the gaol in Edenton, I had my doubts as to whether any marriages would in fact take place tonight.\\n\\n On the other hand, I had learned never to underestimate Jamie, either. With a final word of compliment to Mrs. Lindsay, he dragged Ronnie bodily away from the pit, pausing just long enough to thrust the ax into my hands.\\n\\n “See that safe, aye, Sassenach?” he said, and kissed me briefly. He grinned down at me. “And where did ye learn so much about the natural history of beans, tell me?”\\n\\n “Brianna brought it home from school when she was about six,” I said, smiling back. “It’s really a little song.”\\n\\n “Tell her to sing it to her man,” Jamie advised. The grin widened. “He can write it down in his wee book.”\\n\\n He turned away, putting a companionable arm firmly about the shoulders of Ronnie Sinclair, who showed signs of trying to escape back in the direction of the barbecue pit.\\n\\n “Come along wi’ me, Ronnie,” he said. “I must just have a wee word wi’ the Lieutenant. He wishes to buy a ham of Mistress Lindsay, I think,” he added, blinking at me in the owllike fashion that passed with him for winking. He turned back to Ronnie. “But I ken he’ll want to hear whatever ye can tell him, about his Da. Ye were a great friend of Gavin Hayes, no?”\\n\\n “Oh,” said Ronnie, his scowl lightening somewhat. “Aye. Aye, Gavin was a proper man. A shame about it.” He shook his head, obviously referring to Gavin’s death a few years before. He glanced up at Jamie, lips pursed. “Does his lad ken what happened?”\\n\\n A tender question, that. Gavin had in fact been hanged in Charleston, for theft—a shameful death, by anyone’s standards.\\n\\n “Aye,” Jamie said quietly. “I had to tell him. But it will help, I think, if ye can tell him a bit about his Da earlier—tell him how it was for us, there in Ardsmuir.” Something—not quite a smile—touched his face as he looked at Ronnie, and I saw an answering softness on Sinclair’s face.\\n\\n Jamie’s hand tightened on Ronnie’s shoulder, then dropped away, and they set off up the hill, side by side, the subtleties of barbecue forgotten.\\n\\n How it was for us . . . I watched them go, linked by the conjuration of that one simple phrase. Five words that recalled the closeness forged by days and months and years of shared hardship; a kinship closed to anyone who had not likewise lived through it. Jamie seldom spoke of Ardsmuir; neither did any of the other men who had come out of it and lived to see the New World here.\\n\\n Mist was rising from the hollows on the mountain now; within moments, they had disappeared from view. From the hazy forest above, the sound of Scottish male voices drifted down toward the smoking pit, chanting in amiable unison:\\n\\n “Beans, beans, they’re good for your heart . . .”\\n\\n RETURNING TO THE CAMPSITE, I found that Roger had returned from his errands. He stood near the fire, talking with Brianna, a troubled look on his face.\\n\\n “Don’t worry,” I told him, reaching past his hip to retrieve the rumbling teakettle. “I’m sure Jamie will sort it somehow. He’s gone to deal with it.”\\n\\n “He has?” He looked slightly startled. “He knows already?”\\n\\n “Yes, as soon as he finds the sheriff, I imagine it will all come right.” I upended the chipped teapot I used in camp with one hand, shook the old leaves out onto the ground, and putting it on the table, tipped a little boiling water in from the kettle to warm the pot. It had been a long day, and likely to be a long evening as well. I was looking forward to the sustenance of a properly brewed cup of tea, accompanied by a slice of the fruitcake one of my patients had given me during the morning clinic.\\n\\n “The sheriff?” Roger gave Brianna a baffled look, faintly tinged with alarm. “She hasn’t set a sheriff on me, has she?”\\n\\n “Set a sheriff on you? Who?” I said, joining in the chorus of bafflement. I hung the kettle back on its tripod, and reached for the tin of tea leaves. “Whatever have you been doing, Roger?”\\n\\n A faint flush showed over his high cheekbones, but before he could answer, Brianna snorted briefly.\\n\\n “Telling Auntie Jocasta where she gets off.” She glanced at Roger, and her eyes narrowed into triangles of mildly malicious amusement as she envisioned the scene. “Boy, I wish I’d been there!”\\n\\n “Whatever did you say to her, Roger?” I inquired, interested.\\n\\n The flush deepened, and he looked away.\\n\\n “I don’t wish to repeat it,” he said shortly. “It wasna the sort of thing one ought to say to a woman, let alone an elderly one, and particularly one about to be related to me by marriage. I was just asking Bree whether I maybe ought to go and apologize to Mrs. Cameron before the wedding.”\\n\\n “No,” Bree said promptly. “The nerve of her! You had every right to say what you did.”\\n\\n “Well, I don’t regret the substance of my remarks,” Roger said to her, with a wry hint of a smile. “Only the form.\\n\\n “See,” he said, turning to me, “I’m only thinking that perhaps I should apologize, to keep it from being awkward tonight—I don’t want Bree’s wedding to be spoiled.”\\n\\n “Bree’s wedding? You think I’m getting married by myself?” she asked, lowering thick red brows at him.\\n\\n “Oh, well, no,” he admitted, smiling a little. He touched her cheek, gently. “I’ll stand up next ye, to be sure. But so long as we end up married, I’m not so much bothered about the ceremony. Ye’ll want it to be nice, though, won’t ye? Put a damper on the occasion, and your auntie crowns me with a stick of firewood before I can say ‘I will.’ ”\\n\\n I was by now consumed by curiosity to know just what he had said to Jocasta, but thought I had better address the more immediate issue, which was that at the moment of going to press, it appeared that there might be no wedding to be spoiled.\\n\\n “And so Jamie’s out looking for Father Kenneth now,” I finished. “Marsali didn’t recognize the sheriff who took him, though, which makes it difficult.”\\n\\n Roger’s dark brows lifted, then drew together in concern.\\n\\n “I wonder . . .” he said, and turned to me. “Do ye know, I think perhaps I saw him, just a few moments ago.”\\n\\n “Father Kenneth?” I asked, knife suspended over the fruitcake.\\n\\n “No, the sheriff.”\\n\\n “What? Where?” Bree half-turned on one heel, glaring round. Her hand curled up into a fist, and I thought it rather fortunate that the sheriff wasn’t in sight. Having Brianna arrested for assault really would have a dampening effect on the wedding.\\n\\n “He went that way.” Roger gestured downhill, toward the creek—and Lieutenant Hayes’s tent. As he did so, we heard the sound of footsteps squelching through mud, and a moment later, Jamie appeared, looking tired, worried, and highly annoyed. Obviously, he hadn’t yet found the priest.\\n\\n “Da!” Bree greeted him with excitement. “Roger thinks he’s seen the sheriff who took Father Kenneth!”\\n\\n “Oh, aye?” Jamie at once perked up. “Where?” His left hand curled up in anticipation, and I couldn’t help smiling. “What’s funny?” he demanded, seeing it.\\n\\n “Nothing,” I assured him. “Here, have some fruitcake.” I handed him a slice, which he promptly crammed into his mouth, returning his attention to Roger.\\n\\n “Where?” he demanded, indistinctly.\\n\\n “I don’t know that it was the man you’re looking for,” Roger told him. “He was a raggedy wee man. But he had got a prisoner; he was taking one of the fellows from Drunkard’s Creek off in handcuffs. MacLennan, I think.”\\n\\n Jamie choked and coughed, spewing small bits of masticated fruitcake into the fire. \\n\\n","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-32.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.\\n","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
