{"id":81337,"no":65,"title":"Page 65","content":"That fought and died for\n Your wee bit hill and glen . . .”\n Not one of the songs Bree called the warmongering ones. It was a solemn song, that one, and melancholy. But not a song of grief, for all that; one of remembrance, of pride and determination. It wasn’t even a legitimately ancient song—Roger knew the man who’d written it, in his own time—but Jamie had heard it, and knowing the history of Stirling and Bannockburn, strongly approved the sentiment.\n “And stood against him,\n Proud Edward’s army,\n And sent him homeward\n Tae think again.”\n The Scottish members of the crowd let him sing alone through the verse, but voices lifted softly, then louder, in the refrain.\n “And sent him ho-omeward . . .\n Tae think again!”\n He remembered something Bree had told him, lying in bed the night before, during the few moments when both of them were still conscious. They had been talking of the people of the times, speculating as to whether they might one day meet people like Jefferson or Washington face to face; it was an exciting—and not at all impossible—prospect. She had mentioned John Adams, quoting something she had read that he had said—or would say, rather—during the Revolution:\n “I am a warrior, that my son may be a merchant—and his son may be a\n poet.”\n “The hills are bare now,\n And autumn leaves lie thick and still,\n O’er land that is lost now,\n Which those so dearly held.\n And stood against him,\n Proud Edward’s army,\n And sent him homeward\n Tae think again.”\n No longer Edward’s army, but George’s. And yet the same proud army. He caught a glimpse of Claire, standing with the other women, apart, at the very edge of the circle of light. Her face was remote and she stood very still, hair floating loose around her face, the gold eyes dark with inner shadow—fixed on Jamie, who stood quiet by her side.\n The same proud army with which she had once fought; the proud army with which his father had died. He felt a catch at his throat, and forced air from down deep, singing through it fiercely. I will be a warrior, that my son may be a merchant—and his son may be a poet. Neither Adams nor Jefferson had fought; Jefferson had no son. He had been the poet, whose words had echoed through the years, raised armies, burned in the hearts of those who would die for them, and for the country founded on them.\n Perhaps it’s the hair, Roger thought ironically, seeing the gleam of ruddy light as Jamie moved, watching silently over the thing he had started. Some Viking tinge in the blood, that gave those tall fiery men the gift of rousing men to war.\n “That fought and died for\n Your wee bit hill and glen . . .”\n So they had; so they would again. For that was what men always fought for, wasn’t it? Home and family. Another glint of red hair, loose in firelight, by the bones of the pig. Bree, holding Jemmy. And if Roger found himself now bard to a displaced Highland chieftain, still he must try also to be a warrior when the time came, for the sake of his son, and those who would come after.\n “And sent him homeward\n Tae think again.\n Tae think . . . again.”\n 25\n THE ANGELING OF MY REST\n LATE AS IT WAS, we made love by unspoken consent, each wanting the refuge and reassurance of the other’s flesh. Alone in our bedroom, with the shutters closed tight against the sounds of the voices in the dooryard—poor Roger was still singing, by popular demand—we could shed the urgencies and fatigues of the day—at least for a little while.\n He held me tightly afterward, his face buried in my hair, clinging to me like a talisman.\n “It will be all right,” I said softly, and stroked his damp hair, dug my fingers deep into the place where neck and shoulder met, the muscle there hard as wood beneath the skin.\n “Aye, I know.” He lay still for a moment, letting me work, and the tension of his neck and shoulders gradually relaxed, his body growing heavier on mine. He felt me draw breath under him, and moved, rolling onto his side.\n His stomach rumbled loudly, and we both laughed.\n “No time for dinner?” I asked.\n “I canna eat, just before,” he answered. “It gives me cramp. And there wasna time, after. I dinna suppose there’s anything edible up here?”\n “No,” I said regretfully. “I had a few apples, but the Chisholms got them. I’m sorry, I should have thought to bring something up for you.” I did know that he seldom ate “before”—before any fight, confrontation, or other socially stressful situation, that is—but hadn’t thought that he might not have a chance to eat afterward, what with everyone and his brother wanting to “have just a wee word, sir.”\n “It’s not as though ye didna have other things to think of, Sassenach,” he answered dryly. “Dinna fash yourself; I’ll do ’til breakfast.”\n “Are you sure?” I put a foot out of bed, making to rise. “There’s plenty left; or if you don’t want to go down, I could go and—”\n He stopped me with a hand on my arm, then dragged me firmly back under the covers, tucking me spoon-fashion into the curve of his body and wrapping an arm over me to insure that I stayed there.\n “No,” he said definitely. “This may be the last night I spend in a bed for some time. I mean to stay in it—with you.”\n “All right.” I snuggled obediently under his chin, and relaxed against him, just as pleased to stay. I understood; while no one would come to fetch us unless there was some emergency, the mere sight of either of us downstairs would cause an immediate rush of people needing this or that, wanting to ask a question, offer advice, require something . . . much better to stay here, snug and peaceful with each other.\n I had put out the candle, and the fire was burning low. I wondered briefly whether to get up and add more wood, but decided against it. Let it burn itself to embers if it liked; we would be gone at daybreak.\n Despite my tiredness and the serious nature of the journey, I was looking forward to it. Beyond the lure of novelty and the possibility of adventure, there was the delightful prospect of escape from laundry, cookery, and female warfare. Still, Jamie was right; tonight was likely the last we would have of privacy and comfort for some little time.\n I stretched, consciously enjoying the soft embrace of the feather bed, the smooth, clean sheets with their faint scent of rosemary and elderflower. Had I packed sufficient bedding?\n Roger’s voice reached through the shutters, still strong but beginning to sound a bit ragged with fatigue.\n “The Thrush had best get to his bed,” Jamie said, with mild disapproval, “if he means to bid his wife a proper farewell.”\n “Goodness, Bree and Jemmy went to bed hours ago!” I said.\n “The wean, perhaps; the lass is still there. I heard her voice, a moment ago.”\n “Is she?” I strained to listen, but made out no more than a rumble of muted applause as Roger brought his song to a close. “I suppose she wants to stay with him as long as she can. Those men are going to be exhausted in the morning—to say nothing of hung over.”\n “So long as they can sit a horse, I dinna mind if they slip off to have a vomit in the weeds now and again,” Jamie assured me.\n I nestled down, covers drawn up warm around my shoulders. I could hear the deep rumble of Roger’s voice, laughing, but declining firmly to sing anymore. Little by little, the noises in the dooryard ceased, though I could still hear bumpings and rattlings as the beer keg was picked up and shaken empty of the last few drops. Then a hollow thud as someone dropped it on the ground.\n There were noises in the house; the sudden yowl of a wakening baby, footsteps in the kitchen, the sleepy whine of toddlers disturbed by the men, a woman’s voice raised in remonstrance, then reassurance.\n My neck and shoulders ached, and my feet were sore from the long walk to the whisky spring, carrying Jemmy. Still, I found myself annoyingly wakeful, unable to shut out the noises of the external world as completely as the shutters blocked it from view.\n “Can you remember everything you did today?” This was a small game we played sometimes at night, each trying to recall in detail everything done, seen, heard, or eaten during the day, from getting up to going to bed. Like writing in a journal, the effort of recall seemed to purge the mind of the day’s exertions, and we found great entertainment in each other’s experiences. I loved to hear Jamie’s daily accounts, whether pedestrian or exciting, but he wasn’t in the mood tonight.\n “I canna remember a thing that happened before we closed the chamber door,” he said, squeezing my buttock in a companionable way. “After that, though, I expect I could recall a detail or two.”\n “It’s reasonably fresh in my mind, too,” I assured him. I curled my toes, caressing the tops of his feet.\n We stopped speaking, then, and began to shift and settle toward sleep, as the sounds below ceased, replaced by the buzz and rasp of miscellaneous snores. Or at least I tried to. Late as it was, and exhausted as my body undoubtedly was, my mind appeared determined to stay up and carouse. Fragments of the day appeared behind my eyelids the moment I shut my eyes—Mrs. Bug and her broom, Gerhard Mueller’s muddy boots, bare-stemmed grape clusters, blanched tangles of sauerkraut, the round halves of Jemmy’s miniature pink bottom, dozens of young Chisholms running amok . . . I resolutely strove to discipline my fugitive mind by turning instead to a mental checklist of my preparations for leaving.\n This was most unhelpful, as within moments I was wide awake with suppressed anxiety, imagining the complete destruction of my surgery; Brianna, Marsali, or the children succumbing to some sudden hideous epidemic; and Mrs. Bug inciting riot and bloodshed from one end of the Ridge to the other.\n I rolled onto my side, looking at Jamie. He had rolled onto his back as usual, arms neatly folded across his abdomen like a tomb figure, profile pure and stern against the dying glow of the hearth, tidily composed for sleep. His eyes were closed, but there was a slight frown on his face, and his lips twitched now and then, as though he were conducting some kind of interior argument.\n “You’re thinking so loudly, I can hear you from over here,” I said, in conversational tones. “Or are you only counting sheep?”\n His eyes opened at once, and he turned over to smile ruefully at me.\n “I was counting pigs,” he informed me. “And doing nicely, too. Only I kept catchin’ sight of that white creature from the corner of my eye, skippin’ to and fro just out of reach, taunting me.”\n I laughed with him, and scooted toward him. I laid my forehead against his shoulder and heaved a deep sigh.\n “We really must sleep, Jamie. I’m so tired, my bones feel as though they’re melting, and you’ve been up even longer than I have.”\n “Mmm.” He put an arm around me, pulling me into the curve of his shoulder.\n “That cross—it isn’t going to catch the house afire, is it?” I asked after a moment, having thought of something else to worry about.\n “No.” He sounded slightly drowsy. “It’s burnt out long since.” \n","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-65.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: \n The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.\n \n","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
