{"id":81345,"no":73,"title":"Page 73","content":"With this in mind, I kept a cautious distance behind Jamie, but made sure I was visible, ostentatiously spreading my skirts and brushing them down, displaying my gender as evidence of our peaceable intent. Damn, there was a small hole burnt through the brown wool, no doubt from a flying campfire spark. I concealed the burned spot in a fold of skirt, thinking how odd it was that everyone regarded women as inherently harmless. Had I been so inclined, I could easily have burgled houses and murdered hapless families from one end of the Ridge to the other. Fortunately the impulse to do so hadn’t struck me, though it had dawned on me now and then that the Hippocratic Oath and its injunction to “Do no harm” might not have strictly to do with medical procedure. I’d had the impulse to dot one of my more recalcitrant patients over the head with a stick of firewood more than once, but had so far managed to keep the urge in check. Of course, most people hadn’t the advantage of a doctor’s jaundiced view of humanity. And it was true that women didn’t go in so much for the recreational sorts of mayhem that men enjoyed—I rarely found women beating each other into pulp for fun. Give them a good motive, though, and . . . Jamie was walking toward the barn, shouting at intervals, to no apparent effect. I glanced round, but there were no fresh tracks in the dooryard save our own. A scatter of dung balls lay near the half-hewn log, but those had plainly been left days ago; they were moist with dew, but not fresh—most had crumbled to powder. No one had come, no one had gone, save on foot. The Beardsleys, whoever and however many of them there were, were likely still within. Lying low, though. It was early, but not so early that farm people would not already be about their chores; I had seen someone earlier, after all. I stepped back and shaded my eyes against the rising sun, looking for any sign of life. I was more than curious about these Beardsleys—and more than slightly apprehensive about the prospects of having one or more male Beardsleys riding with us, given recent events. I turned back to the door, and noticed an odd series of notches cut into the wood of the jamb. Each one was small, but there were a great many, running the complete length of one doorpost, and halfway down the other. I looked closer; they were arranged in groups of seven, a scant width of unscarred wood between the groups, as a prisoner might count, keeping track of the weeks. Jamie emerged from the barn, followed by a faint bleating. The goats he’d mentioned, of course; I wondered whether it had been Keziah’s job to milk them—if it was, his absence was going to become rapidly apparent, if it wasn’t already. Jamie took a few paces toward the house, cupped his hands round his mouth, and shouted again. No answer. He waited a few moments, then shrugged and strode up onto the porch, where he hammered on the door with the hilt of his dirk. It made enough noise to wake the dead, had there been any in the vicinity, and sent the chickens squawking away in a feather-scattering panic, but no one appeared in answer to the thunderous summons. Jamie glanced back at me, one eyebrow raised. People didn’t normally go off and leave their farms untended, not if they had livestock. “Someone’s here,” he said, in answer to the unvoiced thought. “The goats are fresh-milked; there are drops still on their teats.” “Do you think they could all be out searching for . . . er . . . you know who?” I murmured, moving closer to him. “Perhaps.” He moved to the side, bending to peer into a window. It had once been glassed, but most of the panes were cracked or missing, and a sheet of ratty muslin had been tacked over the opening. I saw Jamie frown at it, with the craftsman’s disdain for a shoddy repair. He turned his head suddenly, then looked at me. “D’ye hear something, Sassenach?” “Yes. I thought it was the goats, but . . .” The bleat came again—this time unmistakably from the house. Jamie set his hand to the door, but it didn’t budge. “Bolted,” he said briefly, and moved back to the window, where he reached carefully into the frame and pulled loose a corner of the muslin cloth. “Phew,” I said, wrinkling my nose at the air that wafted out. I was used to the odors of a winter-sealed cabin, where the scents of sweat, dirty clothes, wet feet, greasy hair, and slop jars mingled with baking bread, stewing meat, and the subtler notes of fungus and mold, but the aroma within the Beardsley residence went well beyond the norm. “Either they’re keeping the pigs in the house,” I said, with a glance at the barn, “or there are ten people living in there who haven’t come out since last spring.” “It’s a bit ripe,” Jamie agreed. He put his face into the window, grimacing at the stink, and bellowed, “Thig a mach! Come out, Beardsley, or I’m comin’ in!” I peered over his shoulder, to see whether this invitation might produce results. The room within was large, but so crowded that scarcely any of the stained wooden floor was visible through the rubble. Sniffing cautiously, I deduced that the barrels I saw contained—among other things—salt fish, tar, apples, beer, and sauerkraut, while bundles of woolen blankets dyed with cochineal and indigo, kegs of black powder, and half-tanned hides reeking of dog turds lent their own peculiar fragrances to the unique mephitis within. Beardsley’s trade goods, I supposed. The other window had been covered as well, with a tattered wolf hide, so that the interior was dim and shadowy; with all the boxes, bundles, barrels, and bits of furniture lying in heaps, it looked like a poverty-stricken version of Ali Baba’s cave. The sound came again from the back of the house, somewhat louder; a noise midway between a squeal and a growl. I took a step back, sound and acrid smell together vividly recalling an image of dark fur and sudden violence. “Bears,” I suggested, half-seriously. “The people are gone and there’s a bear inside.” “Aye, Goldilocks,” Jamie said, very dryly. “Nay doubt. Bears or not, there’s something wrong. Fetch the pistols and cartridge box from my saddlebag.” I nodded and turned to go, but before I could step off the porch, a shuffling noise came from inside, and I turned back sharply. Jamie had grasped his dirk, but as he saw whatever was inside, his hand relaxed on the hilt. His eyebrows also rose in surprise, and I leaned over his arm to see. A woman peered out from between two hillocks of goods, looking round suspiciously, like a rat peering out of a garbage dump. She was not particularly ratlike in appearance, being wavy-haired and quite stout, but she blinked at us in the calculating way of vermin, reckoning the threat. “Go away,” she said, evidently concluding that we were not the vanguard of an invading army. “Good morning to ye, ma’am,” Jamie began, “I am James Fraser, of—” “I don’t care who you are,” she replied. “Go away.” “Indeed I will not,” he said firmly. “I must speak with the man o’ the house.” An extraordinary expression crossed her plump face; concern, calculation, and what might have been amusement. “Must you?” she said. She had a slight lisp; it came out as mutht you? “And who says that you must?” Jamie’s ears were beginning to redden slightly, but he answered calmly enough. “The Governor, madam. I am Colonel James Fraser,” he said, with emphasis, “charged with the raising of militia. All able-bodied men between the ages of sixteen and sixty are called to muster. Will ye fetch Mr. Beardsley, please?” “Mili-ish-ia, is it?” she said, handling the word with care. “Why, who will you be fighting, then?” “With luck, no one. But the call to muster is sent out; I must answer, and so must all able-bodied men within the Treaty Line.” Jamie’s hand tightened on the crosspiece of the inner frame and rattled it experimentally. It was made of flimsy pine sticks, the wood shrunken and badly weathered; he could plainly rip it out of the wall and step through the opening, if he chose to do so. He met her eyes straight on, and smiled pleasantly. She narrowed her eyes and pursed her lips, thinking. “Able-bodied men,” she said at last. “Hmp. Well, we’ve none of those. The bond lad’s run off again, but even if he were here, he’s not able; deaf as that doorpotht, and quite as dumb.” She nodded toward the door in illustration. “If you care to hunt him down, you’re welcome to keep him, though.” It didn’t look as though there would be any hue and cry after Keziah, then. I took a deep breath, in a sigh of relief, but let it out again, swiftly. Jamie wasn’t giving up easily. “Is Mr. Beardsley in the house?” he asked. “I wish to see him.” He gave an experimental tug on the frame, and the dry wood cracked with a sound like a pistol shot. “He’s thcarce fit for company,” she said, and the odd note was back in her voice; wary, but at the same time, filled with something like excitement. “Is he ill?” I asked, leaning over Jamie’s shoulder. “I might be able to help; I’m a doctor.” She shuffled forward a step or two, and peered at me, frowning under a heavy mass of wavy brown hair. She was younger than I’d thought; seen in better light, the heavy face showed no cobweb of age or slackening of flesh. “A doctor?” “My wife’s well-kent as a healer,” Jamie said. “The Indian folk call her White Raven.” “The conjure woman?” Her eyes flew wide in alarm, and she took a step back. Something struck me odd about the woman, and looking at her, I realized what it was. Despite the reek in the house, both the woman’s person and her dress were clean, and her hair was soft and fluffy—not at all the norm at this time of year, when people generally didn’t bathe for several months in the cold weather. “Who are you?” I asked bluntly. “Are you Mrs. Beardsley? Or perhaps Miss Beardsley?” No more than twenty-five, I thought, in spite of the bulk of her swaddled figure. Her shoulders swelled fatly under her shawl, and the width of her h*ps brushed the barrels she stood between. Evidently trade with the Cherokee was sufficiently profitable to keep Beardsley’s family in adequate food, if not his bond servants. I eyed her with some dislike, but she met my gaze coolly enough. “I am Mrs. Beardthley.” The alarm had faded; she pursed her lips, and pushed them in and out, regarding me with an air of calculation. Jamie flexed his arm, and the window frame cracked loudly. “Come you in, then.” The odd tone was still in her voice; half defiance, half eagerness. Jamie caught it and frowned, but released his grip on the frame. She moved out from between the boxes and turned toward the door. I caught no more than a glimpse of her in motion, but that was enough to see that she was lame; one leg dragged, her shoe scraping on the wooden floor. There was a bumping and grunting as she fumbled with the bolt; a grating noise, and then a thunk as she dropped it on the floor. The door was warped, stuck in its frame; Jamie put his shoulder to it and it sprang loose and swung in, boards quivering with the shock. How long since it had been opened? I wondered.","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-73.html","bookId":1858,"book":{"id":1858,"title":"The Fiery Cross (Outlander #5)","description":"Storyline: The year is 1771, and war is coming. Jamie Fraser’s wife tells him so. Little as he wishes to, he must believe it, for hers is a gift of dreadful prophecy—a time-traveler’s certain knowledge. Claire’s unique view of the future has brought him both danger and deliverance in the past; her knowledge of the oncoming revolution is a flickering torch that may light his way through the perilous years ahead—or ignite a conflagration that will leave their lives in ashes.","cover":"https://allnovel.net/images/the-fiery-cross-outlander-5.jpg","author":"Diana Gabaldon","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-fiery-cross-outlander-5.html","creation":"Oct 5, 2019 8:58:04 AM","modification":"Oct 5, 2019 4:27:44 PM"}}
