{"id":67323,"no":2,"title":"Page 2","content":"For the picture, her short brown hair had been styled in loose curls. Her dark-brown eyes were smiling and friendly, which was exactly the impression she hoped to convey. She was a little shocked by the importance of Paul’s reaction—by her need that he find her attractive.\\n\\n She waited impatiently for his response. A week later she received an e-mail. Paul seemed to like what he saw in her photograph and they were soon writing and e-mailing back and forth at a feverish pace. A day without some form of communication from Paul felt empty now.\\n\\n Ruth had never had a long-distance relationship before, and the intensity of her feelings for this man she’d never met took her by surprise. She wasn’t a teenager with a schoolgirl crush. Ruth was a mature, responsible adult. Or at least she had been until she slipped a simple Christmas card into the mailbox—and got a reply from a handsome marine sergeant named Paul Gordon.\\n\\n Ruth walked quickly to the tiny rental house she shared with Lynn Blumenthal, then ran up the front steps to the porch. Lynn was eighteen and away from home and family for the first time. The arrangement suited them both, and despite the disparity in their ages and interests, they’d gotten along fairly well. With her heart pounding hard, Ruth forced herself to draw in a deep breath as she started toward the mailbox.\\n\\n The screen door flew open and Lynn came out. “What are you doing home?” she asked, then shook her head. “Never mind, I already know. You’re looking for a letter from soldier boy.”\\n\\n Ruth wasn’t going to deny the obvious. “I haven’t heard from him in three days.”\\n\\n Lynn rolled her eyes. “I don’t understand you.”\\n\\n “I know.” Ruth didn’t want to get into another detailed discussion with her roommate. Lynn had made her feelings known about this relationship from the first, although as Ruth had gently tried to tell her, it was none of her business. That didn’t prevent the younger woman from expressing her views. Lynn said that Ruth was only setting herself up for heartache. A part of Ruth actually agreed, but by the time she realized what was happening, she was emotionally involved with Paul.\\n\\n “You hardly ever see Clay anymore,” Lynn chastised, hands on her hips. “He called and asked about you the other night.”\\n\\n Ruth stared at the small black mailbox. Depending on his assignment duty, Paul didn’t always have computer access and sometimes wrote letters instead. “Clay and I are just friends.”\\n\\n “Not according to him.”\\n\\n It was true that they’d been seeing each other a lot following a Halloween party last October. Like her, Clay Matthews was obtaining his master’s of education, and they seemed to have a lot in common. But her interest in him had already started to wane before she’d mailed that Christmas card to Paul. The problem was, Clay hadn’t noticed.\\n\\n “I’m sorry he’s disappointed.”\\n\\n “Clay is decent and hardworking and I think the way you’ve treated him the last few months is…is terrible.” Lynn, who at five foot ten stood a good seven inches taller than Ruth, could be intimidating, especially with her mouth twisted in that grimace of disapproval.\\n\\n Ruth had tried to let Clay down easily, but it hadn’t worked. They’d gone to the library together last Thursday. Unfortunately, that had been a mistake. She’d known it almost right away when Clay pressured her to have coffee with him afterward. It would’ve been better to end the relationship entirely and forget about staying friends. He was younger, for one thing, and while that hadn’t seemed important earlier, it did now. Perhaps it was wrong to compare him to Paul, but Ruth couldn’t help it. Measured against Paul, Clay seemed immature, demanding and insecure.\\n\\n “You said he phoned?” Frowning, she glanced at Lynn.\\n\\n Lynn nodded. “He wants to know what’s going on.”\\n\\n Oh, brother! Ruth couldn’t have made it plainer had she handed him divorce papers. Unwilling to be cruel, she’d tried to bolster his ego by referring to all the positive aspects of his personality—but apparently, that had only led him to think the opposite of what she was trying to tell him. He’d refused to take her very obvious hints, and in her frustration, she’d bluntly announced that she wasn’t interested in seeing him anymore. That seemed pretty clear-cut to her; how he could be confused about it left Ruth shaking her head.\\n\\n The fact that he’d phoned and cried on her roommate’s shoulder was a good example of what she found adolescent about his behavior. She was absolutely certain Paul would never do that. If he had a problem, he’d take it directly to the source.\\n\\n “I think you’re being foolish,” Lynn said, and added, “Not that you asked my opinion.”\\n\\n “No, I didn’t,” Ruth reminded her, eyeing the mailbox again. There was an ornamental latticework design along the bottom, and looking through it, she could tell that the day’s mail had been delivered. The envelope inside was white, and her spirits sank. There just had to be something from Paul. If not a real letter, then an e-mail.\\n\\n “He asked me to talk to you,” Lynn was saying.\\n\\n “Who did?” Ruth asked distractedly. She was dying to open the mailbox, but she wanted to do it in privacy.\\n\\n “Clay,” Lynn cried, sounding completely exasperated. “Who else are we talking about?”\\n\\n Suddenly Ruth understood. She looked away from the mailbox and focused her attention on Lynn. “You’re attracted to him, aren’t you?”\\n\\n Lynn gasped indignantly. “Don’t be ridiculous.”\\n\\n “Sit down,” Ruth said, gesturing toward the front steps where they’d often sat before. It was a lovely spring afternoon, the first week of April, and she needed to clear the air with her roommate before this got further out of hand.\\n\\n “What?” Lynn said with a defensive edge. “You’ve got the wrong idea here. I was just trying to help a friend.”\\n\\n “Sit,” Ruth ordered.\\n\\n “I have class in twenty minutes and I—” Lynn paused, frowning at her watch.\\n\\n “Sit down.”\\n\\n The eighteen-year-old capitulated with ill grace. “All right, but I already know what you’re going to say.” She folded her arms and stared straight ahead.\\n\\n “I’m fine with it,” Ruth said softly. “Go out with him if you want. Like I said earlier, I’m not interested in Clay.”\\n\\n “You would be if it wasn’t for soldier boy.”\\n\\n Ruth considered that and in all honesty felt she could say, “Not so.”\\n\\n “I don’t understand you,” Lynn lamented a second time. “You marched in the rally against the war in Iraq. Afghanistan isn’t all that different, and now you’re involved with Paul what’s-his-face and it’s like I don’t even know you anymore.”\\n\\n “Paul doesn’t have anything to do with this.”\\n\\n “Yes, he does,” Lynn insisted.\\n\\n “I’m not going to have this conversation with you. We agree on some points and disagree on others. That’s fine. We live in a free society and we don’t have to have the same opinion on these issues or anything else.”\\n\\n Lynn sighed and said nothing.\\n\\n “I have the feeling none of this is really about Paul,” Ruth said with deliberate patience. She hadn’t known Lynn long; they lived separate lives and so far they’d never had a problem. As far as roommates went, Ruth felt she was fortunate to have found someone as amicable as Lynn. She didn’t want this difference of opinion about Clay—and Paul—to ruin that.\\n\\n The other girl once again looked pointedly at her watch, as if to suggest Ruth say what she intended to say and be done with it.\\n\\n “I don’t want to see Clay.” She couldn’t make it any more explicit than that.\\n\\n “You might have told him that.”\\n\\n “I tried.”\\n\\n Lynn glared at her. “You should’ve tried harder.”\\n\\n Ruth laughed, but not because she was amused. For whatever reason, Clay had set his sights on her and wasn’t about to be dissuaded. Complicating matters, Lynn was obviously interested in him and feeling guilty and unsure of how to respond to her attraction.\\n\\n “Listen,” Ruth said. “I didn’t mean to hurt Clay. He’s a great guy and—”\\n\\n “You shouldn’t have lied to him.”\\n\\n Ruth raised her eyebrows. “When did I lie to him?”\\n\\n “Last week you said you were going to visit your grandmother in Cedar Cove and that was why you couldn’t go out with him this weekend. I overheard you,” she added.\\n\\n Oh, that. “It was a white lie,” Ruth confessed. She definitely planned to visit her grandmother, though. Helen Shelton lived across Puget Sound in a small community on the Kitsap Peninsula. Ruth had spent Thanksgiving with her grandmother and visited for a weekend before Christmas and then again close to Valentine’s Day. Her last visit had been early in March. She always enjoyed her time with Helen, but somehow the weeks had slipped away and here it was April already.\\n\\n “A lie is a lie,” Lynn said adamantly.\\n\\n “Okay, you’re right,” Ruth agreed. “I should’ve been honest with Clay.” Delaying had been a mistake, as she was now learning.\\n\\n That seemed to satisfy her roommate, who started to get to her feet. Ruth placed her hand on Lynn’s forearm, stopping her. “I want to know why you’re so upset about this situation with Clay.”\\n\\n “I already told you…. I just don’t think this is how people should treat each other.”\\n\\n “I don’t like the way Clay’s put you in the middle. This is between him and me. He had no right to drag you into it.”\\n\\n “Yes, but—”\\n\\n “You’re defending him?”\\n\\n Lynn shrugged. “I guess.”\\n\\n “Don’t. Clay’s a big boy. If he has something to say, then he can come to me all on his own. When and if he does, I’m going to tell him again that I’m no longer interested in dating him. I’m—”\\n\\n “Stuck on some gun-wielding—”\\n\\n A look from Ruth cut her off.\\n\\n “Okay, whatever,” Lynn muttered.\\n\\n “What I want you to do is comfort him,” Ruth said, patting Lynn’s forearm.\\n\\n “I could, I suppose.”\\n\\n “Good,” Ruth said, hoping to encourage her. “He might need someone to talk to, and since you’re sensitive to his feelings, you’d be an excellent choice.”\\n\\n “You think so?”\\n\\n Ruth nodded and then Lynn stood up. She went inside to get her books and left with a cheerful goodbye as if they’d never had an argument. With her roommate gone, Ruth leaped off the step and across the porch to the mailbox. Lifting the top, she reached inside, holding her breath as she pulled out the electric bill in its white envelope, a sales flyer—and a hand-addressed air mail letter from Sergeant Paul Gordon.\\n\\n Two\\n\\n April 6\\n\\n My Dear Ruth, We’ve been out on a recon mission for the last four days and there wasn’t any way I could let you know. They seemed like the longest four days of this tour, and not for the reasons you might think. Those days meant I couldn’t write you or receive your letters. I’ve been in the marines for eight years now and I’ve never felt like this about mail before. Never felt this strongly about a woman I’ve yet to meet, either. Once we were back in camp, I sat down with your letters and read through each one. As I explained before, there are times we can’t get on-line and this happened to be one of those times. I realize you’ve probably been wondering why I wasn’t in touch. I hope you weren’t too concerned. I would’ve written if I could. I have good news. I’m coming home on leave…. Ruth read Paul’s letter twice. Yes, he’d definitely said he was headed home, to Seattle, for two weeks before flying to Camp Pendleton in California for additional training. He was looking forward to spending most of his leave with her. His one request was that Ruth make as much time for him as her studies would allow and, if possible, keep her weekends free. \\n\\n","sourceLink":"https://allnovel.net/hearts-divided-cedar-cove-0/page-2.html","bookId":1946,"book":{"id":1946,"title":"Hearts Divided (Cedar Cove #0)","description":"Storyline: Hearts Divided: 5-B Poppy Lane\\The Apple Orchard\\Liberty Hall (Cedar Cove #5.5) \\n by Debbie Macomber , Katherine Stone , Lois Faye Dyer \\n Three acclaimed authors team up for this collection of three brand-new contemporary romances about past and present love. Includes Macomber\u0027s \"5-B Poppy Lane,\" Stone\u0027s \"The Apple Orchard,\" and Dyer\u0027s \"Liberty Hall.\" Original.\\n","cover":"https://allnovel.net/images/hearts-divided-cedar-cove-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/hearts-divided-cedar-cove-0.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:04:31 AM"}}
