{"id":67344,"no":23,"title":"Page 23","content":"“It might be. Ah, here it is.” Winifred leafed through the book, stopping to scan a page before turning to the next. “Yes,” she said with satisfaction. “I need you to spell out the letters for me, then write down what I tell you, Chloe.” “Okay. The first one is Y-I-L-D-O-C.” Winifred ran her fingertip down a list. “J.” “The letter J?” Chloe asked. “Yes. What’s the next set of letters within parentheses?” “T-S-E-N-I-L.” “That’s an A.” She waited for Chloe to jot down the letter and find the next parenthetical set of letters. “J-A-D-H-O-L-N-I.” “That’s a K. Next.” “A-H-N-A-H.” “That’s an E. Next.” Chloe stared at the letters she’d written down. “Gran.” Winifred looked up. “Yes?” “We just spelled Jake.” Winifred nodded abruptly. “Then I was right. Whoever wrote the essay used the World War II code based on the Navajo language.” “So you’re saying a Navajo wrote the essay?” “Not necessarily. The code was never broken during the war and was kept top secret. It wasn’t officially recognized by the Pentagon until 1992. But since then, there have been articles written about the Navajo codebreakers and how the code worked. I believe Hollywood even made a movie called Windtalkers about the use of the Navajo code during the war in the Pacific. Public knowledge about the subject has definitely increased over the past several years.” “So anyone who wanted to could look up the code and learn how to use it.” “Technically speaking, yes. I’m sure the details are available on the Internet somewhere, since most things are these days. Using the code orally would be almost impossible for anyone except a Navajo because the language itself is extremely complex. It’s almost unintelligible to anyone except a native. But to write it—” Winifred tapped the essay in front of Chloe “—that’s quite easy, really. All you’d have to do is look up the English letters of the alphabet and the Navajo words assigned to them.” “But these don’t look like words.” “I know. Whoever wrote them neglected to hyphenate them where needed. For instance, ‘yildoc’ is really Yil-Doc, and ‘jadholni’ is Jad-Ho-Loni. Nonetheless, it’s clear to me that the Navajo code is the basis for the words enclosed in parentheses.” “And the first word is Jake. Why would someone encode his name in an essay given to me?” “That’s the real mystery, isn’t it?” Winifred’s expression was solemn. “Let’s finish going through the letters in parentheses and see what words we have when we’re done.” Several moments later, Chloe and Winifred stared at the three names. “Jake Morrissey, Chloe Abbott and Kenny Dodd,” Winifred read slowly. “Why is your name here, Chloe? And who is Kenny Dodd?” “I don’t know, Gran, but I’m going to find out.” Chloe took her cell phone from her purse and dialed Jake’s number. Six When Jake received Chloe’s call, Gray was at his apartment. They arrived at Winifred’s house together, Jake’s Porsche closely followed by Gray’s SUV as they pulled into the circular driveway. Chloe met them at the front door. “What happened?” Jake demanded, his gaze running over her, searching for signs of damage. “Come into the kitchen. Gran can help me explain.” She said hello to Gray, standing behind Jake. “I’m glad you’re here, Gray. You need to hear this, too.” She led them down the hall to the kitchen and introduced Gray to Winifred. “Sit down, gentlemen.” Winifred gestured at two empty chairs and looked at Chloe. “Why don’t you start, Chloe.” Chloe nodded and, as succinctly as possible, told them about the essay and the encoded words. Gray turned to Jake. “Who’s Kenny Dodd?” “He’s a kid who died in Afghanistan.” Jake’s face was grim. “He was in the wrong place at the wrong time when I detonated a charge I’d set to take out a bridge.” Chloe’s heart cramped at the expression of stark pain that flashed across his features. He feels responsible for that young soldier’s death. Gray whistled softly. “So the stalker is connected to the military, not to your demolition work.” “Yeah,” Jake said. “I guess so. We’ve been looking in the wrong place, at the wrong people.” “No wonder we didn’t find anything.” “Whoa.” Chloe lifted her hand. “What are you saying? You’ve ‘been looking.’ Is this my stalker or your stalker?” Jake’s eyes were unreadable, but they met hers without flinching. “It’s possible the person following you may really be after me.” Chloe could only stare at him, speechless, as scenes from the last few days ran through her mind—the man outside David’s shop window, the eerie feeling that someone was following her on campus, the blue sedan driving by her house after the symphony. The man was stalking her because she’d met Jake? “Gray and I suspected that might be the case. You told me the feeling that someone was watching you didn’t start until after the photos of us appeared in the Tribune,” Jake continued. “That’s true,” she murmured, frowning. “The photo may have been the catalyst that caused the stalker to link you with me.” Chloe thought about the group of photos that had accompanied the article and cold fear gripped her. “My grandmother was in those pictures, too.” “Have you noticed any strangers watching you, Mrs. Abbott?” Jake asked. “Maybe a car following you when you leave the house?” “No. Nothing like that,” Winifred said firmly. “And I would have noticed.” She turned to Chloe. “Why didn’t you tell me what’s been going on?” “I thought it was probably a student with a crush on me, Gran. It made me nervous because it’s a little creepy, knowing someone might be stalking me, but I wasn’t really afraid for my safety.” “And there’s every reason to believe you shouldn’t be afraid, even now,” Gray put in. “As we’ve said, the primary target appears to be Jake. Someone’s been shadowing him for weeks, and the fact that you’re having the same experience so soon after the photos were made public indicates you’re a secondary interest.” “You’re sure? Because I won’t leave town if Chloe’s in danger.” Concern shaded Winifred’s voice. “Gran’s taking the Queen Victoria cruise ship to Victoria, B.C., in the morning,” Chloe explained, answering Jake’s unspoken question. “It’s only an overnight trip—a birthday gift from a friend.” “Ah.” He nodded. “I don’t think Chloe’s in real danger, Mrs. Abbott. We believe the man’s after me and he’s only interested in Chloe because he saw her with me in the photo.” “Okay, then.” Chloe drew a deep breath and covered Winifred’s hand with hers. “I think you should go to Victoria, Gran, and have a great time. Have high tea at the Empress Hotel, visit Butchart Gardens and shop till you drop. With any luck, by the time you get home, Jake and Gray will have found this person and solved the puzzle. And our lives will go back to being quiet, normal and totally boring.” Winifred’s eyes twinkled. “At my age, Chloe, a little excitement makes life interesting. But I’ll settle for tea at the Empress.” “Great.” Chloe kissed her cheek, relieved that her grandmother would be safely out of town until Jake and Gray had time to apprehend the stalker, whoever he was. The three took their leave of Winifred. Jake walked Chloe to her car and opened the door. “I’ll be back in a minute. I need to talk to Gray.” “All right.” Chloe slid into the driver’s seat, watching in her rearview mirror as Jake walked back to Gray’s SUV, parked behind his Porsche, which was blocking Chloe. The two men spoke for a few minutes, then Gray reversed out of the driveway to park on the street while Jake walked back to her car. He leaned down, resting his forearms on the window. “Come home with me, Chloe.” “What?” Startled, she could only stare at him. He swore under his breath. “Not to sleep with me. Not unless you want to,” he amended, his lips curving in a slight grin that swiftly disappeared. “I’d just feel better if you were close enough for me to keep an eye on tonight.” “I don’t want to leave my home.” He sighed. “I didn’t think you would. So I’ve asked Gray to have one of his off-duty cop friends stand guard outside your house tonight. Calling in a favor,” he added. “Since we still don’t have enough evidence to get the police involved, we’ll continue to handle this unofficially.” “You’re that worried?” “No. I’m that careful.” Chloe’s eyes darted to her grandmother’s house, but before she could speak, Jake reassured her. “Gray’s going to stay and watch over Winifred.” He looked over his shoulder. “He backed out of the driveway to let us leave. He’ll pull back in when we’re gone and park in plain sight. If our stalker plans to bother Winifred, Gray will be waiting for him.” “Thank goodness.” Relief washed over Chloe. “Will he stay until the limo picks her up in the morning?” “Yes.” Jake leaned into the car and pressed a hard kiss against her mouth. “I’ll follow you home. By the time we get there, Gray’s friend should have arrived and he’ll park outside your house, just like Gray’s doing here.” “Where will you be?” She struggled to speak above a whisper. He’d stolen her breath and sidetracked her ability to think with that kiss. “At my apartment working. I need access to my computer and other files to track down information on Kenny Dodd. Otherwise, I’d be the guard in the car outside your door.” Chloe smiled at him, touched. “You’re such a Galahad.” “Not hardly,” he growled. “And if I ever get you alone at my place, I’ll prove it.” She laughed and he walked back to his car. The engine turned over with a throaty growl and he backed the sports car out of Winifred’s driveway, waiting for her to precede him. Chloe glanced out the living room window the following morning. The silver sedan with Gray’s friend behind the steering wheel was still parked in her driveway. “Bless you, Jake,” she said out loud. “What would I do without you and your friends?” She walked into the kitchen where the automatic timer had switched on the grind-and-brew coffeemaker fifteen minutes earlier. The welcoming aroma of fresh coffee pervaded the air and she poured a cup, taking a sip before setting it on the counter. When she’d replenished the bird feeder outside, she’d get some coffee for the officer, too. She filled a plastic quart pitcher with birdseed from a large bag in the pantry and opened the door to the deck overlooking her backyard. As soon as she stepped outside, her foot connected with something solid.","sourceLink":"https://allnovel.net/hearts-divided-cedar-cove-0/page-23.html","bookId":1946,"book":{"id":1946,"title":"Hearts Divided (Cedar Cove #0)","description":"Storyline: Hearts Divided: 5-B Poppy Lane\\The Apple Orchard\\Liberty Hall (Cedar Cove #5.5) by Debbie Macomber , Katherine Stone , Lois Faye Dyer Three acclaimed authors team up for this collection of three brand-new contemporary romances about past and present love. Includes Macomber\u0027s \"5-B Poppy Lane,\" Stone\u0027s \"The Apple Orchard,\" and Dyer\u0027s \"Liberty Hall.\" Original.","cover":"https://allnovel.net/images/hearts-divided-cedar-cove-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/hearts-divided-cedar-cove-0.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:04:31 AM"}}
