{"id":67352,"no":31,"title":"Page 31","content":"It wasn’t, and Nick’s neighbors were thrilled. By the time he began knocking on doors—for that was how introductions were made in Sarah’s Orchard—they’d spread the word that the new handyman in town was handy indeed. Nick’s reconciliation with his Center Street memories helped his quest for peace. As did seeing the orchards again, one orchard in particular. But it wasn’t enough. He needed to see the MacKenzies again. The kind eyes. He wouldn’t introduce himself as “the boy who’d saved Elizabeth,” of course. Much less as “Elizabeth’s hero.” “Hero” had been as foreign to him on that long-ago December night as “son” had been. He’d clung to “son,” treasured it, but even at age seven he’d believed “hero” was wrong. He’d only done what anyone would’ve done had they spotted the sobbing little girl. He’d been called a hero many times in the intervening years. It continued to sound wrong. In combat as in life, he only did what he believed anyone would do. Nick had intended to tell Charles and Clara the same thing he’d told the other townspeople who’d opened their doors to him. He was willing and able to do a range of repairs. The orchard was in blossom on the April evening the soldier with splintered bones climbed the steep drive the small boy had ascended, carrying a giggling toddler, so many Decembers past. In blossom, and magical. Those trees, he felt, wanted him to sing to them, the way he sang “Amazing Grace,” when that was what the wounded needed to hear. Or “Battle Hymn of the Republic.” Or “God Bless America.” Or any song that would make an injured soldier smile. It was Clara who’d opened the door to his knock. Nick had been only a sentence into his introduction when she’d tilted her head and widened her eyes. “You’re him, aren’t you?” “Him?” “Our boy. Elizabeth’s hero. Don’t deny it. I know you are. Charles! Guess who’s here? At last.” Nick hadn’t denied it. Nor, by the time Charles appeared, had he confirmed it. He’d been speechless in those moments, stunned that Clara had known. The man he’d become bore no resemblance to the scrawny boy he’d been. True, Clara had promised she’d never forget his bright blue eyes. But he didn’t have bright blue eyes, not as a boy—and most certainly not as a man. Oh, there was a tincture of blue in the gray, a patch of sky amid the clouds. But in all his years, only Clara MacKenzie had remarked on it. What she’d seen had been an illusion, the play of red Christmas lights on the hint of blue. Or maybe the entire illusion had been in the sparkling eyes of the beholder. Others had made comments about Nick’s eyes. Other women. Bedroom eyes, some concluded. Only wilder. As if a bed was too tame for his tastes. And that was before he went to war. No, Nick didn’t have bright blue eyes. Never had. And the hair that had been blondish when Clara had last seen him had turned brown when he reached his teens. But Clara had known who he was. Because of his expression, she’d eventually informed him. It was identical, she said, to the hopeful way he’d looked when she and Charles had promised to be there for him—always. Hopeful yet skeptical, she’d added. Hope against hope. Charles and Clara MacKenzie had kept their promise, welcoming him into their lives when he’d needed them most. Charles and Clara had needed Nick, too. Both of them. And, in the seven months since Charles’s death, and to the extent she’d permit it, he’d shared with Clara her enormous loss. Beginning tomorrow, he’d be with Clara all summer. He’d find a way to help her, and the lovely eyes that had once seen colors and emotions no one else could see. Three “Oh, Clara,” he said when she opened the door and he saw her tears. “You miss him, too.” “I do,” Nick said. “All day, every day. Charles was the finest man I’ve ever known.” Clara nodded and wiped her eyes. “Are you dropping by for dinner?” “Just dropping by.” Nick smiled. “But I wouldn’t turn down food.” “Then come on in.” They’d both known she’d ask, and that he’d accept the offer. He’d shown up often—at suppertime—since Charles’s death. And at dawn, when her curtains signaled she’d awakened for the day. And midmorning for coffee, and in the afternoon for tea. Both knew he was checking up on her, and why he never called in advance. She’d tell him what she told everyone else who worried about her. You don’t need to come over. I’m fine! She’d made such assertions to Nick in the beginning. You can’t possibly be fine, he’d tell her when he appeared despite her protestations. He’d arrive within fifteen minutes of his phone call, and she always seemed relieved when he did. And even if you’re fine, Clara, I’m not. Nick didn’t care about the food she inevitably served him. He could cook his own meals. But if he permitted Clara to feed him, she’d end up nibbling on something, too. It was past her usual suppertime. But Nick had the feeling she might have forgotten to eat. His impression was confirmed when they reached the kitchen. On the table where her dinner might have been, four round boxes sat instead. Glossy boxes, he noted, each in a different shade of yellow. “Hatboxes?” Nick prompted. “They contain the letters Charles wrote me during the war. I haven’t read them since his return. I didn’t need to. I had him. And,” Clara said, “I knew every one by heart.” “I’ll bet you still do.” “I don’t know. Getting them down from the attic is as far as I’ve gotten.” “The attic? Clara—” “I’m perfectly ambulatory, Nick! And the railings a certain dear friend of ours added to all our walls and staircases make climbing up and down a breeze.” Clara smiled at the dear friend who, following Charles’s stroke, had made it easy for him to spend the remaining year of his life with the woman he loved in the farmhouse he’d always known. “Elizabeth painted these boxes for me.” “Oh?” Nick asked, moving closer. The varying shades of yellow were background. On each lid was an apple tree. One for every season. The style was primitive and bold, painted by a girl who couldn’t draw any better than she could sing. The boxes weren’t works of art. But they were works of love. And passion, Nick thought. An exuberant affection for the trees, be they barren for winter, blossom-laden during spring, bountiful with summer fruit or brilliant with the leaves of autumn. Elizabeth’s wintertime tree wasn’t entirely barren. Oblong splashes of red dangled from its outermost reaches. Christmas lights—like the ones that had illuminated a sobbing little girl. “When did she paint these?” “The first year she spent the entire summer here. She was eight, and we had such fun. On rainy days, we poked around in the attic, trying on old clothes, looking at old photographs, playing with the mah-jongg set Charles inherited from his father. Charles’s letters didn’t pique her interest. But she could tell how important they were to me. She wondered if they needed brighter homes than the white hatboxes I’d stored them in. They definitely did, I told her, and asked if she’d be willing to decorate them for me.” “Did you suggest what she should draw? The seasons of the orchard?” “I made no suggestions whatsoever. But, being Elizabeth, she shared her every thought. The boxes had to be yellow, she said, because I’d painted the house yellow to welcome Charles home from the war.” “She didn’t go with the same yellow.” “No. She felt it would be all right—if I agreed—to pick four brighter shades. You remember her affinity for the bright and shiny.” “I do,” Nick said softly. “And the apple trees? Why did she choose to paint them?” “Because she loves them. She’s always viewed them as the living things they are—as friends.” Clara touched an apple blossom on Elizabeth’s springtime tree. “When she was finished, Charles lacquered each box inside and out, sealing the cardboard and, or so we hoped, preserving her vivid paintings. But they’ve faded, haven’t they?” Not at all, Nick thought. He felt quite sure they were as bright as the day eight-year-old Elizabeth had dabbed her final drop of paint. But Clara couldn’t see it. It was the worry he would find a way to address. Beginning tomorrow. Tonight, he broached the worry that was foremost on Clara’s mind. “Have you heard from Elizabeth?” “Not since Monday night. I don’t expect to hear from her, Nick. Not on that topic. She’s not mad at me because of what I said about Matthew. Sad, maybe. Disappointed. But not mad.” She sighed. “If anyone owes anyone a follow-up phone call, it’s me who should call her.” “But you haven’t.” “It wouldn’t be fair unless I was calling to tell her I’d decided my instincts were wrong and he was perfect for her after all.” “You haven’t decided that.” “Not even close. The more I think about it, the more convinced I become. It’s better just to let some time pass.” “Is Elizabeth still coming for a visit at the end of the month?” “We didn’t discuss it Monday night, but I’m sure she will. She’s not going to hold my concerns about Matthew against me. And she is going to marry him. I wasn’t trying to talk her out of it. I probably shouldn’t have said anything.” “That’s not your style, Clara, not when the happiness of your family’s involved. Especially Elizabeth.” “But I’ve made her unhappy. I wish you’d come to the party at the Orchard Inn.” “I was behind on the remodel for Pete and Celia.” “Ha!” “Ha?” “You were afraid I’d have a glass of champagne or two, and start reminiscing about Elizabeth’s Christmastime adventure and say this is the boy who saved her. This is Elizabeth’s hero.” Clara had made the pronouncement with fondness twenty-seven years ago. There was more fondness now. “I was behind on the remodel,” Nick repeated, smiling. “I’m not afraid of your introducing me as that boy. I just don’t want you to.” “I know, Nick. And I won’t. I do wish you’d been at the party, though.” “I don’t know Elizabeth, Clara. There’s no way I would’ve been able to tell if she and Matthew were right for each other.” “You’d have been able to tell. You’d have been able to see…” Clara sighed again. “See what?” “That Matthew’s not in love with my granddaughter. There,” she continued without a pause. “I’ve said what I could never say to Elizabeth. But it’s what I believe, Nick. And it scares me for her.”","sourceLink":"https://allnovel.net/hearts-divided-cedar-cove-0/page-31.html","bookId":1946,"book":{"id":1946,"title":"Hearts Divided (Cedar Cove #0)","description":"Storyline: Hearts Divided: 5-B Poppy Lane\\The Apple Orchard\\Liberty Hall (Cedar Cove #5.5) by Debbie Macomber , Katherine Stone , Lois Faye Dyer Three acclaimed authors team up for this collection of three brand-new contemporary romances about past and present love. Includes Macomber\u0027s \"5-B Poppy Lane,\" Stone\u0027s \"The Apple Orchard,\" and Dyer\u0027s \"Liberty Hall.\" Original.","cover":"https://allnovel.net/images/hearts-divided-cedar-cove-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/hearts-divided-cedar-cove-0.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:04:31 AM"}}
