{"id":62903,"no":1,"title":"Page 1","content":"Chapter one Darcy Michaels adjusted her gloved grip on her toolbox and picked her way carefully over the charred remains of her favorite candy store. Around her, firefighters moved through the smoldering ruins, checking every crevice and corner to be certain the fire was completely extinguished. Water dripped from the blackened walls and ceiling to puddle on the floor below, and the smell of smoke and burned sugar clung to her nostrils and skin, sinking into the very fiber of her uniform. “Third one in as many weeks,” James Ralston muttered behind her. “I’m sorry, Darcy. I know you loved this place.” She stopped and faced her mentor, her chest gripped in a vise of pain. Like the two previous fires, this blaze had destroyed a location that was dear to her and had held precious memories. She’d celebrated her twelfth birthday at the Sweet Spot candy shop, and she stopped by every Friday to stock up on the sour lemonade straws her sister had turned her on to. Focus on the details, Darcy. Don’t lose it now. “Whoever the arsonist is,” she said, “he’s not going to quit. He’s been doing this too long. It’s in his blood.” The frequency of the acts and the terrible brilliance of the timed-delay incendiary devices being used spoke of someone who’d had time to perfect his madness. She couldn’t help feeling violated, despite knowing how irrational that response was. As much as she’d wanted to leave Lion’s Bay as a kid, she couldn’t even contemplate abandoning the sleepy seaside town now. The same memories that had driven her parents to move away kept her bound to the area. “I don’t know what to make of it.” Jim’s forest green eyes were warm with compassion and intent on her face. “We don’t have any new residents and it’s the off-season. Tourism is down. Anyone not from around here sticks out like a sore thumb.” She turned in a slow circle, her trained gaze following the burn patterns he’d taught her to read. “This guy didn’t just crawl out of the w-woodwork,” she said, startled to hear her voice cracking. She cleared her dry throat. “I think we need to bring the big guns in on this.” “Miller’s doing a good job. He’s meticulous and thorough.” He touched her elbow lightly. “You don’t want to be the one who steps on his toes.” Darcy nodded, acknowledging the sensitive nature of her relationship with the town’s sheriff. “I know, but I think he needs more resources, and I think he’s too stubborn to ask for help.” The last time the Feds had come in, they’d run roughshod over Chris Miller and his deputies, cutting him out of the loop while draining his limited resources. She remembered that tense time all too well, because the murder they’d been investigating had been the tragedy that brought her home. “And frankly, Chris’s ego is the least of our problems.” “Let’s gather the evidence, then we’ll discuss the next best steps.” Setting his hand on her shoulder, Jim gave her a reassuring squeeze. “Maybe you should stay with someone tonight?” Reaching up, she set her hand over his. He knew her so well. She wanted a particular kind of support, the kind where someone was nearby if she needed them but out of her way if she wanted time to just retreat with her thoughts. Her gaze met Jim’s and he read her mind. “My couch is always open to you, Darcy. You know that.” She nodded. “Thank you.” “Anytime.” Turning away, Darcy looked for a place to set down her kit and begin. ROLLING OVER WITH a sigh, Darcy looked at the clock over Jim’s fireplace mantel and noted the time: quarter after five. It was still dark outside and she’d been tossing and turning all night, too wired by her restless thoughts to catch the sleep she desperately needed. There was something about the fires that was niggling at her, but she just couldn’t place it. Turning it over and over in her mind wasn’t bringing the answer she was looking for to mind. Sitting up, she rolled her shoulders back, knowing what had to be done. She wanted her treasured equanimity back, and the only way to make that happen was to find the psycho who was stealing it from her and see him in a cage. The sooner, the better. A possible pissing match between authorities wasn’t going to be enough to hold her back. So far no one had been hurt, but their torch was barely catching his breath between fires. If he kept to his established pattern, they had only days before he struck again. A warm exhale over her toes brought her attention to the handsome German shepherd sprawled on the floor at the foot of the couch. When her brief relationship with Jim had fizzled out, she’d felt the loss of his dog keenly. “Thanks for watching out for me, Columbo.” Reaching down, she scratched behind his ears. The residents of Lion’s Bay were paying her to provide the same service to the town—to watch out for them and keep them safe. She wasn’t going to let them down. Chapter two Deputy U.S. Marshal Jared Cameron waited until the Lion’s Bay sheriff sucked in a deep breath mid-rant, then he glanced at his partner. “This winner is all yours,” he drawled, turning on his heel and leaving Deputy Trish Morales to it. She’d been assigned to him for just that reason: she had the patience of a saint and he had no patience at all. Especially not for defensive, posturing small-town authorities who whipped their dicks out and started marking their territories the moment he rolled into town. “I’m not done. Where the fuck is he going?” Sheriff Miller snapped, followed by a far more modulated reply from Trish. Idiot. Nothing trumped the U.S. Marshals Service’s silver star. Jared closed the sheriff’s glass inset door behind him just to shut out the man’s voice. Pushing the irritation from his thoughts, he started through the bull pen toward the exit when an unexpected and unwanted complication walked into the station. He took scant note of her initially, but something drew his attention back. Grudgingly he slowed, then came to a stop. Whoever she was, she was a bombshell. Not in the physical sense. In that regard, she was of average height, slim, and moderately proportioned. Her face was free of cosmetics and her brown hair was pulled back in a casual ponytail. If he’d been looking at a photo of her, he wouldn’t have looked twice. But in the flesh, watching her move, was what snared him. She was hot monkey sex in a brown paper wrapper. The secret of her was revealed in the sensual fluidity of her body and her heavy-lidded, bottle green eyes. The primitive male in him recognized the attraction instantly, completely disregarding his brain, which didn’t have time for this sort of distraction. Unfortunately for him, the blue uniform slacks and embroidered white button-up shirt she wore told Jared he had no chance of avoiding her unless he wanted to switch with Trish and take point with Miller instead. He was stuck with deciding which part of his anatomy was going to be the least controllable: his fists or his dick. Maybe he’d be lucky and she would be happily married with kids, therefore not the least bit interested in getting sweaty and dirty with him. She was lost in conversation with the female deputy manning the front desk when he approached. The glance she shot him was cursory, just as his had first been with her. Then it snagged. Her focus zeroed in, sliding over his body from the top of his head down to his scuffed work boots and back up again. When her gaze collided with his, she sucked in a breath and licked her lower lip. Fuck. He was screwed. His brain was screaming at him to turn his ass around and take his chances with the sheriff instead. Assaulting the local authorities for getting on his last nerve would garner him less trouble than playing with the sizzling awareness arcing between him and the sexpot fire inspector. “Here he is,” the deputy said unnecessarily, pointing at him. Jared thrust out his hand and introduced himself. The moment his palm touched the bombshell’s, his blood rushed south and gave him a semi. He looked at her left hand almost desperately, cursing the lack of a wedding ring. A simple gold band would’ve killed his interest right then and there. “Darcy Michaels,” she replied, in a voice pitched high enough to be this close to girlish. “I’m a fire inspector with the Lion’s Bay Fire Department.” The pretty blond deputy at the front desk smiled at him with the same invitation she’d given him when he first walked in. “Darcy’s the one who asked me to put out the information about the arsonist.” The blonde was the type of woman he preferred to fuck—attractive enough to stir the most superficial interest and easy enough to want nothing more than a good time. Darcy Michaels was rousing something far deeper, igniting a hunger that was full-bodied and complex. The kind that overrode a man’s better sense. Giving himself a mental kick in the ass, Jared caught the inspector’s elbow and steered her toward the exit. “Let’s go.” They’d barely stepped outside when she said, “You got here quick, Deputy.” He considered her voice. It was a cross between Marilyn Monroe and Jennifer Tilly. If anyone had asked him that morning what he thought of girly voiced women, he’d have said they annoyed the shit out of him. It was just his damn luck that Darcy Michaels was the exception. Every time she opened her mouth, his mind went straight into the gutter. Harder, Jared. Deeper… Christ. His teeth grit. “We have to move quickly,” he bit out, trying to regain his focus. “If he keeps to his pattern, he’ll burn something else before the week is out. What have you got so far?” She gestured down the street to a brick-faced fire station. “My office is over there. Do you have a suspect in mind? You came because you recognized the MO, right?” “It’s similar to a known arsonist, yes.” “We’re three weeks in with him. Where was he four weeks ago?” “No clue.” Frowning, she persisted, “So there are intervals between bursts? How long?” “Twenty years. Give or take.”","sourceLink":"https://allnovel.net/on-fire-shadow-stalkers-4/page-1.html","bookId":1921,"book":{"id":1921,"title":"On Fire (Shadow Stalkers #4)","description":"Storyline: On Fire (Shadow Stalkers #4) Every time she opened her mouth, his mind went straight into the gutter… When Deputy US Marshal Jared Cameron started investigating a series of arson attacks in the small seaside town of Lion’s Bay, he had no idea that the biggest blast of heat would come from the fire inspector. Her name was Darcy Michaels—and if there was anyone that Jared wanted to get down and sweaty with, it was Darcy. Darcy knew what she was bringing out in Jared. In fact, she liked it. She reveled in making his dirty dreams come true. Stripped down for a scorching after-hours affair, Jared was her fantasy, too. A hard-driving man who knew exactly what to do to please her. But as hot as their nights were, they had no idea just how wild it was going to get. Because Darcy has a secret. And a past. And it’s drawing them right into the flames…","cover":"https://allnovel.net/images/on-fire-shadow-stalkers-4.jpg","author":"Sylvia Day","type":"Romance","source":"allnovel","link":"https://allnovel.net/on-fire-shadow-stalkers-4.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:49:02 AM"}}
