{"id":62905,"no":3,"title":"Page 3","content":"\n Leaning forward, she whispered, “No, you won’t. You’ll be seeing stars when I’m done with you.”\n “Christ.” Grimacing with discomfort, he arched his hips up from the seat and adjusted the fit of his jeans.\n “Back to the shoptalk,” she said, inwardly smiling with female triumph and heated expectation. “Ginny spent money she likely doesn’t have on safety precautions that won’t do her a damn bit of good. You know how Merkerson works. If he goes after this diner, he’ll do it in the bright light of day right under her nose.”\n And later, after the diner closed and the streets were quiet, the devious little time bomb would explode and engulf the structure in flames within moments.\n “You heard what she said,” Jared argued, rallying. “She feels better. And whether or not the modifications she made were necessary in this particular instance, they were still smart.”\n “It’s my job to help make her feel safe, and clearly she wasn’t feeling that way.”\n “Right.” His gaze bore into her. “And people should sleep with their doors open because we have law enforcement.”\n “Not quite the same thing.” The residents had been horrified at the first fire but trusted her and Jim to deal with it. The second fire had made things a little shakier, but they’d still been sure an arrest was imminent. By the third fire, people stopped thinking the authorities were just a step away from catching the arsonist and they started thinking about fending for themselves.\n “Get over yourself, Darcy. Unless you totally fucked up the evidence collection and analysis, you’ve done your job and you’re continuing to do your job by sending for help when you need it. Pat yourself on the back and give props to the people who are thinking forward instead of backward.”\n “I’m not sure if I like you or not.”\n “Don’t like me. Let’s keep this simple.”\n She nodded without hesitation. After all, she was willing to indulge herself with him precisely because he was just passing through. Anything more than sex was beyond her at this point in her life. “Works for me.”\n He was on his feet before Ginny reached their table with a takeout bag of food and a cardboard drink carrier. “Let’s go, Inspector. We have a lot of work to get through between now and six o’clock.”\n JARED SET THE take-out bag down on the desk in Darcy’s office and swept the narrow room with an examining glance. As he dug out his foam box, he considered the logistics of nailing her on the six-foot-long folding table set beneath the window that looked into the firehouse’s heavy apparatus bay. Unfortunately, its flimsiness wouldn’t hold up to the abuse, and it certainly wouldn’t be professional, although a quickie would do a lot to restore his concentration. He didn’t trust her desk, either, with its ultramodern glass top artfully balanced on a network of thin chrome bars.\n “Miller’s bark is worse than his bite, by the way.” She reached around him for her shake, and he breathed her in, smelling warm clean woman.\n The sheriff was in his mid-thirties and an obvious devotee to free weights, but he was no threat. Jared had spent six years with Delta Force before he’d joined the U.S. Marshals Service’s elite Special Operations Group. There wasn’t a human alive he couldn’t severely maim or kill.\n “My partner will deal with Miller. Even if she feels like killing him, she’ll restrain herself.” He took a bite out of his burger before occupying one of the two chairs in front of her desk. Pausing midchew, he mumbled an awed, “Holy shit.”\n Her lips curved around her straw. “Damn good burger, isn’t it?”\n He swallowed. “Insanely.”\n It was nearly as good as she looked when she smiled. You’ll be seeing stars when I’m done with you. Fuck of it was, he was inclined to believe her. She was doing a number on him already without even trying. What would she do to him if she put some effort into it…?\n She rounded the desk and pulled open the top drawer of the filing cabinet. His gaze moved from her to the wall of cantilevered glass and chrome bookshelves behind her. Either the city invested a lot in the comfort of their civil servants or she’d spent her own dime dressing the space up. He was inclined to think that the utilitarian gray metal folding table and chairs were provided courtesy of the city. The run-of-the-mill filing cabinet, too. But the bookshelf unit and matching desk were all her—strong, eye-catching, and sexy. And the indulgence suggested that she spent a lot of time working…or felt the most at home in her office.\n His gaze caught on a silver-framed picture on a shelf behind her. It was a snapshot of her when she was younger, wearing a cheerleader uniform and standing with her arm thrown across the shoulders of a mirror image of herself dressed in a band costume.\n “You’re a twin.”\n She pushed the drawer shut and returned to the desk, setting three manila folders on the glass. “Yes.”\n He wondered if her sister was anything like her. Maybe Darcy was the naughty twin. The thought made his overeager dick harden all over again. The word “naughty” thought of in conjunction with “Darcy” seemed to have that now-predictable effect on him.\n “Shall we start with the first fire?” she asked, moving right along.\n He resumed eating and nodded, but found himself slightly irritated by her lack of elaboration, which was a stupid response. Keeping things simple meant keeping them impersonal. He should be glad she was on the same page.\n Pulling the bottom file free, Darcy opened it and began to carefully spread out photographs on her desk. Aside from a quirky blown-glass pen holder and red metal toolbox, there was nothing cluttering the pristine surface.\n Jared chewed on a perfectly crispy French fry and studied the crime scene photos. She began to explain what he was looking at.\n “The fire began at approximately ten o’clock in the evening. The owner locked up at eight. It started here,” she pointed to the third picture, “in the hallway outside the restrooms.”\n “It was a brick-faced building?” he queried, noting the rubble.\n “Yes. Florinda’s Dance Studio took over the old firehouse after the town moved all the civil services into this one area and called it a town square.” Darcy pulled another photo out of the file, this one a close-up framed with an L-square ruler, and set it in front of him. “See these curled aluminum shavings? They tested positive for traces of white phosphorous. It’s likely that the incendiary device was hidden in a soda can dropped into a waste bin.”\n “Interesting.”\n “You know what I think is interesting?” Setting her palms on the desktop, she leaned forward. “An arsonist who picks a brick building. There are buildings in Lion’s Bay that have been around for over a century. Good, old-fashioned wood-sided and shingled structures that would light up like a match, in areas where other buildings nearby would light up just as quickly.”\n He’d been thinking along those same lines. “Any possibility this is insurance fraud?”\n “With the extra fires being a deflection? The incendiary device is too sophisticated for a dabbler. Our subject is a pro.”\n “Right. Go on.”\n “Structure number two was an old animal shelter, built mostly from cement block.” Darcy slid the photos from the first fire into a neat pile and put them away before grabbing the second folder. She set the new photos out with care. “This location is very out of the way, but there’s a lot of vegetation. It might’ve gotten ugly if we hadn’t just had days of rain that saturated the area.”\n Jared dragged one of the photos closer. “You received the anonymous tip about this fire, correct?”\n “Yes.”\n After he examined the images, she put them away and showed him the most recent property casualty.\n “What was this place?” He eyed the unidentifiable twisted shapes that lined the floor along the walls.\n “A candy shop. Those weird-looking things used to be the plastic bins the candy was kept in. The store shares a wall with a costume jewelry shop. The sophisticated fire alarm system ensured we responded quickly. The jewelry store sustained only minor damage.”\n Shutting the lid of his empty food container, Jared stood and moved to the map pinned to the wall. Three red arrow stickers marked spots. “Are these where the fires took place?”\n “Yes.”\n He heard her put the files away while he studied the seemingly random locations. Different parts of town, different types of businesses. He sucked down the rest of the best shake he’d ever had, and said, “Let’s head to the dance studio.”\n “It’s been three weeks. There’s nothing left to find.”\n “It’s not evidence we’re looking for.” He met her gaze as she straightened. “The subject saw something in these targets that we’re not. If we’re going to get inside his head and anticipate his next moves, we need to figure out what’s catching his attention.”\n “I’ve pored over everything until my eyes bled. I can’t see anything but random chaos.”\n “A fresh perspective never hurts.” She’s reluctant to go back, he realized, wondering why and hoping that seeing her at the location would give him a clue.\n “Hey.”\n Jared turned toward the open doorway and the man who leaned casually into the frame there. His uniform of short-sleeve white dress shirt and navy slacks was the same as Darcy’s, except for a few extra patches on the sleeves and some gold braiding.\n “Hey, Jim.” Darcy quickly introduced them.\n Chief Fire Inspector James Ralston straightened and shook Jared’s hand, taking his measure with a sweeping glance. “I just heard that Darcy called in the cavalry. Hope you can help us nail this bastard.”\n “Working on it.”\n “Do you want to take over?” Darcy asked. “Deputy Cameron wants to check out the studio. You’ll be more help to him than I’ll be.” \n","sourceLink":"https://allnovel.net/on-fire-shadow-stalkers-4/page-3.html","bookId":1921,"book":{"id":1921,"title":"On Fire (Shadow Stalkers #4)","description":"Storyline: \n On Fire (Shadow Stalkers #4) \n Every time she opened her mouth, his mind went straight into the gutter… \n When Deputy US Marshal Jared Cameron started investigating a series of arson attacks in the small seaside town of Lion’s Bay, he had no idea that the biggest blast of heat would come from the fire inspector. Her name was Darcy Michaels—and if there was anyone that Jared wanted to get down and sweaty with, it was Darcy. \n Darcy knew what she was bringing out in Jared. In fact, she liked it. She reveled in making his dirty dreams come true. Stripped down for a scorching after-hours affair, Jared was her fantasy, too. A hard-driving man who knew exactly what to do to please her. But as hot as their nights were, they had no idea just how wild it was going to get. Because Darcy has a secret. And a past. And it’s drawing them right into the flames…\n \n","cover":"https://allnovel.net/images/on-fire-shadow-stalkers-4.jpg","author":"Sylvia Day","type":"Romance","source":"allnovel","link":"https://allnovel.net/on-fire-shadow-stalkers-4.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:49:02 AM"}}
