{"id":109699,"no":4,"title":"Page 4","content":"CHAPTER THREE\n Damali sighed with frustration as she went back into her house. She paced through the small dwelling and slid her gun across the weapons room table. This whole life was crazy. She peered around what should have been a cozy den or family room. A daggone crossbow was mounted near the door, hand grenades and semis on a desk. An Isis dagger held by a wooden stand lay in wait where a letter opener should have been if things were normal. Every man on the team was bugging in one way or another. The sisters seemed to be holding their own for now, but she wondered how long that would last.\n The only male who had a perpetually sunny disposition was Big Mike - but that was probably because he\u0027d figured out how to be AWOL 80 percent of the time, regularly claiming he had to escort Inez to Houston to visit her child. While that was true, she also knew that the getaways doubled as conjugal visits, since Mike was supersensitive to sound traveling and his business being public.\n Damali lifted her hair off her neck and laughed sadly. She could definitely identify. What she wouldn\u0027t give right now to let her voice rent the place... or hear Carlos\u0027s deep, low-decibel thunder.\n She shuddered, nearly feeling the vibration as she remembered it. Didn\u0027t he know by now what he meant to her? If after all they\u0027d been through he didn\u0027t get it, then what could she tell him that would make a damned difference? He\u0027d have to figure it out on his own.\n But in the meanwhile, whew. Just seeing him all messed up and fluxing... maybe she would call him. Pride goeth before a fall, and her man was fine. It had been too long since they\u0027d been in sync. Privacy had been a hard commodity to obtain. Now she had that and he was squandering the gift. Damali glanced around the room and left it, seeking something to munch on.\n She opened the fridge and stood in the dim light it cast within the darkened kitchen, hoping something good would strike her, as though just looking at the shelves might materialize whatever her palate craved. What did she want? Her hands were on her hips, her brow knit in thought. What did she want, what was good in here? She had a refrigerator full of food, and didn\u0027t want a danged thing in it.\n Damali left the refrigerator door open as she went to the back door and flung it open wide. Fresh air, for one thing. The room was too warm, and she hated air conditioning. She went back to the fridge to study the shelves. She smiled and closed her eyes. Carlos, naked, in bed, right now, no drama, no attitude, not drunk, vaporizing her one cell at a time. Yeah, that was definitely what she wanted. She licked her lips as her mouth went dry from the mental sight of his lit second tattoo on his base, one of his sweet spots, and therefore hers. Caramel. She laughed. Oh, yeah, she practically breathed out, that tasted real good.\n A shiver swept through her as the vivid image made her moisten and swell. She wasn\u0027t sure if it was the cool air that wafted from the opened refrigerator door, or just her thoughts of him that produced gooseflesh. Her hardened nipples strained against her tank top as remembered what his warm, wet mouth felt like... what the tip of his tongue did to them, when he was so inclined. Damn, she missed that man... why\u0027d he have to flux with a hint of fang and then get salty!\n She hadn\u0027t felt intense arousal like this in months. And he\u0027d picked this night of all nights to act stupid. Men. If he woulda allowed a mind lock, she could have sensed what was running through his brain, sent him some serious Balm of Gilead for whatever ailed him and sobered him up... shoot, they might not have even made it back to the house. But, noooo.\n Damali wrapped her arms around her waist when her Sankofa at the base of her spine lit and nearly screamed up each vertebra. Her head dropped back as the old puncture wounds on her throat began to taunt her. One by one, she could feel each bite he\u0027d ever laid down begin to burn hot with memory. Aw, man... forget pride, she was going over to his house in a minute. Whatever was wrong with him and jacking with his head, he was still her pleasure master as far as she was concerned.\n Didn\u0027t he know that his touch simply dissolved her? Just thinking about his mouth made her bud throb. And his voice... dayum. When he got all into it and lost himself... started that Spanglish in her ear, rolling r\u0027s till her womb contracted... and when he\u0027d finally put it in... umph, umph, umph. Yeah, she was gonna call him. Had to now. Had messed herself up just remembering. Open transmission: Baby, I\u0027m sorry - whatever I did.\n She inhaled deeply and dabbed her forehead with the back of her wrist. If this was a prelude to his real apex, then she would probably burn to ash when he went there to the max. Her baby was awesome in that department, not to mention all the other cool shit he could do. Why was he trippin\u0027 so hard, though? His other powers were coming in, just like new shoots came up from the dirt in the spring. It would be all right. He was still da man. Baby, I\u0027m sorry. Let\u0027s talk about it. Okay?\n No answer. Shit. He was gonna make her beg and just say it. She let her breath out hard, deciding. Memory sent a hard contraction through her canal and the sensation squeezed more hot liquid want into her panties. \"Aw, c\u0027mon, baby, I\u0027m sorry, for real,\" she whispered out loud. He was the one, the only one who could make her feel this way.\n All right. I admit it. I\u0027ve been acting funny for months. I\u0027m sorry. I don\u0027t know why I\u0027ve been feeling out of sorts. But tonight, I promise you, by tomorrow we won\u0027t remember why we were arguing. I\u0027ve got this new place to christen...fireplace ready and waiting, just for you. You don\u0027t have to be all subdued and quiet, neither do I - nobody\u0027s within earshot; Big Mike\u0027s in Houston, and even he can\u0027t hear that far.\n She laughed quietly as desire tears began to wet her lashes. Suddenly she wanted Carlos so badly it actually hurt. This is a nine-one-one. Come home, and answer this emergency, stat... okay, papi? All right, you call the shots. Cool?\n No answer. Fine, then. Damali shook it off, and slammed the refrigerator door. She caught a glimpse of something flash past the deck and smiled. Stop playing and come inside, Carlos.\n She paced out to the back of the house, stared up at the moon, completely understanding why werewolves howled. Her focus was singular as she briefly closed her eyes again and inhaled sharply. Carlos was still in her nose. His near apex scent haunting, teasing, making her hands tremble... and he was three sheets to the wind, out here acting crazy.\n She opened her eyes and a tall, dark male form was in the shadows just beyond the house lights. She placed her hand over her heart and held on to the deck rail. \"Oh, wow, baby, I thought...\"\n Damali sniffed again, and the stench of rotting flesh hit her just before the shadowy figure moved like lightning from behind a cactus and toward her. Gangrene-pitted flesh hung from a contorted, skeletal face. Eyes too big for the sockets glowed something blackish green, like withered, rotten olives. Half of the creature\u0027s head looked like it had been bashed in, the other half was gone, and tattered, filthy clothing hung from his gruesome body. But the claws at the ends of his long, gnarled fingers, along with the twisted fangs protruding from his hideous mouth, made her know he was deadly and a demon. What the hell... Damali felt herself go from aroused to pissed in two seconds flat. Damn! Couldn\u0027t a sister get a moment\u0027s peace?\n She whirled around and ran into the house, glimpsing over her shoulder once. Her peripheral vision caught something rushing, fast behind her. The weapons room the guys had created was her destination. There was a heavy thud on the deck porch. He was coming into her house!\n The crossbow by the door was the closest thing to her. She grabbed it, cocked it, and leveled it toward the window. The moment she went deeper into the room to go for a nine millimeter, she saw him speed by the main open window in a blur.\n Damali\u0027s gaze shot around the room, following the sound to get a bead on the creature\u0027s current location.\n She heard a thump overhead and jumped. He was on the roof. Shit! Damali stayed in the center of the house in the hallway, watching as he scampered across her skylight.\n Damali dashed back to her weapons room, but the thing leered at her through the secondary bulletproof glass-block window and screeched. Screw going near the window for the Glock. The Isis dagger was closer. In one deft swipe it went into her back jeans pocket as she backed away from the window and readied the crossbow.\n A few seconds was long enough for her to see that the creature\u0027s face was mangled, dripping red flesh, skinless - as though an Amanthra serpent had swallowed him whole and puked him back up. She\u0027d seen those half-eaten, soul-damned humans before in Hell\u0027s feeding zones. The chest and abdomen were also torn open, and he stunk of sulfur. He presented yellowish green dripping fangs, upper and low canines. The were-demon signature of foul sulfur stench combined with the heavy wet-dog odor was as strong as the Amanthra on him. His head had been half blown off, obviously by a shotgun cartridge, and the sucker moved way too fast.\n Damali stalked along the corridor leading to the kitchen, hugging the wall, her weapon before her. Why hadn\u0027t he come in? The prayer barriers and sea-salt lines over thresholds and windowsills had to be the reason. They\u0027d done the interior of the new house, not the perimeter, assuming the hallowed ground around it was enough. It should have been! What was this thing?\n It didn\u0027t matter what he was. This creature couldn\u0027t be allowed to escape. The fact that she hadn\u0027t felt him before he manifested really worried her.\n As she crept toward the back door, she could sense him waiting for her. She kicked the screen door open; he rushed the door. She fired her crossbow, dead aim in the thing\u0027s chest. He just looked at her and scooted to the left side of the house. She glanced at the crossbow and set it down slowly. Okaaay. No response to a silver stake in his chest? Her mind quickly scavenged for information. Demon food - the heart was the first thing eaten out. No heart meant nothing to stake. But he still had flesh, open wounds, where purified, prayed-over sea salt could catch and burn him - ignite that sucker.\n No time to lose, she rushed to her cabinets, grabbed a bag of anointed Red Sea salt - shrapnel to slow him down - then dashed to her weapons room, snatched up a semiautomatic filled with hallowed earth rounds, and went hunting.\n As she ran through the house, the creature\u0027s ugly face popped into each window, following her moves. She ran out onto the back deck, unafraid. This low-level, wannabe demon thing had actually tried her, the Neteru! Didn\u0027t he know she\u0027d smoked master vamps and had been to Hell and back? The bitch had actually tried to break into her house! She was too angry to feel fear.\n She waited, on guard, Red Sea salt in one hand, semi in the other. He leaped down from the roof to the ground just beyond the deck rail, and she hurled the opened bag to strew holding salt at his feet, instantly lowering her weapon and squeezing off death rounds.\n Damali yanked her weapon upright as the thing squealed and began to smolder. But she noticed the bullets hadn\u0027t affected him. The creature was melting from his feet up, turning into a puddle of black liquid ooze as he screeched. Then she saw his face in earnest as he began to transform back into what he looked like before he had died and had been fed upon in the lower realms.\n She stumbled back until her spine hit the house wall. Her foster father? \"I thought you were dead, you child-molesting bastard!\" she screamed, running forward and blowing off the creature\u0027s head. \"Inez\u0027s family saw your ass in Hell! Time to go back!\"\n Raw emotion kept her weapon firing even after the thing had no head. Gaining her wits quickly, she saw that the head she\u0027d blown off just rolled around in an angry circle, snapping and snarling, while the body went into a black puddle and within moments, disappeared into the ground.\n Damali dashed back into her house, grabbed another handful of salt, and flung it at the spinning head. Oddly, it began to smoke and disintegrate, too, but not before looking her squarely in the eyes.\n \"You can\u0027t keep us down there,\" the head hissed. \"We\u0027re all coming back!\" Then it dissolved into black muck and was gone.\n Shaken, Damali\u0027s attention jerked to the distance. The Guardians were scrambling. Gunfire had alerted everyone. Stay home. I\u0027m coming to you! she mentally shouted to Marlene. I don\u0027t know how many more are out here. Find Carlos, and bring him into the house - now!\n Furious at the invasion, Damali was down the steps standing near the spot that had withered the already dry grass. The crude oil-like stench still lingered. She squatted, the Isis dagger now in one hand, at the ready.\n She splayed her other hand wide over the black sludge. This didn\u0027t make sense. She could feel subterranean movement, quick dashes like things fleeing, moving between levels that they should have been blocked to. Demon food was on the move, but their captors were not? From everything she\u0027d been taught and had seen down below with her own eyes, all original demons, the ODs as Carlos called them, Lilith\u0027s spawn, the Lilith, or Lucifer\u0027s direct-made entities, fed on scum souls like her foster father\u0027s on every level and had them on lock within carefully guarded zones. The Damned made up 30 percent of Hell\u0027s furnaces, and their rot fed the Lilith like fossil fuel. It kept the ODs fed and able to stay subterranean out of harm\u0027s way. Why would their food be topside? How did the Damned get loose?\n Damali stood and jogged around the side of the house toward her Hummer. It was time to\u0027 have a meeting.\n \"Well, wake his ass up!\" Damali shouted. She shook Carlos hard again, but he only groaned and rolled over onto his stomach.\n Rider shrugged and peered over at Carlos on the porch swing. \"Not possible, sis. He\u0027s passed out cold. I caught him before he fell in the yard. That\u0027s what was taking us all so long. Half the team was arguing about leaving Carlos to go help you; who would go, who had to stay to protect the newbies, in the event this was an all-out - \"\n \"All right, Rider. I hear you,\" Damali said, holding both her hands up. She was too disgusted to go down that particular rat hole right now. She could not believe she was standing out on a porch even having this conversation.\n \"But all that shit you told us, D, is crazy,\" Jose said. \"You sure he couldn\u0027t come into the house?\"\n \"No,\" Damali said, glancing around the nervous eyes that watched her every move. \"Haul Rivera\u0027s ass into the house. Put a salt ring around the borders in the morning. I want Father Patrick on the phone, stat.\"\n Damali began pacing. \"All right, people. Listen up. J.L., get Mike on a cell phone. Tell him to come home ASAP with Inez.\"\n \"We\u0027ve been trying to raise him and Inez since we heard gunfire,\" J.L. said, glancing around.\n \"I told J.L. not to leave a specific voice message, since we know who runs the airwaves,\" Shabazz said coolly. \"I ain\u0027t sensing brotherman is in no imminent danger, he\u0027s just AWOL.\" Shabazz looked at the clock. \"This time of night, he ain\u0027t taking no calls, but if I know Mike, he\u0027ll surface in the morning.\"\n Damali let her breath out hard. \"We take this convo inside.\"\n \"Sho\u0027 you right. Everybody\u0027s got salt on \u0027em, except Yonnie and Tara,\" Shabazz said evenly. \"Why don\u0027t you, uh, let them stay outside with our boy, while he sleeps it off on the swing, and we handle this family bizness inside under the prayer vibe so family business stays family business?\"\n Damali glanced at Yonnie and then Rider. Both had nonverbally squared off. Tara was the stalemate breaker. Shabazz was wise. Yonnie couldn\u0027t be invited to cross the threshold as a male master vamp... not with Rider in the house, because one night that might be her Guardian brother\u0027s only retreat defense if it got crazy between them. Plus, Marjorie had gone pale at the suggestion, which made sense. If Yonnie and Tara had a rift, with young, nubile females in the house, and Carlos not available to talk reason on an unreasonable night...\n \"I\u0027ll stay with him,\" Tara said. She stooped down and placed her hand on Carlos\u0027s chest. \"I understand how serious this is.\"\n Damali almost nodded until she saw a slight red flicker momentarily form inside Tara\u0027s irises. Big problem. Carlos was definitely trailing something damned near irresistible. Yonnie bristled, but stood downwind in the yard. Rider fingered the trigger on his pump shotgun.\n \"How about if y\u0027all leave the door open so I can hear and add my two cents, and I stay out here with her and Carlos. I\u0027d hate to see Rivera wake up in the morning a Third gen. I don\u0027t think he\u0027d like the demotion.\" Rider glared at Tara and then looked down at Carlos.\n \"If she goes there, he wouldn\u0027t wake up,\" Yonnie said through his instantly lowered incisors. \"Put money on that, even though that\u0027s my boy.\"\n \"I didn\u0027t deserve that,\" Tara hissed, glancing at Rider, then Yonnie. She stood. \"He hasn\u0027t fully apexed, and even if he had,\" she snapped, walking to the edge of the porch, \"Damali is my friend.\"\n Rider put the safety back on his weapon and cast his hard gaze out toward the moon. Yonnie normalized and folded his arms, staring out toward the horizon.\n \"I got the yard,\" Yonnie said in a begrudging mutter.\n The rest of the team filed inside. Damali waited as edgy Guardians filed into the dining room behind her. Marlene looked at her.\n Mar, how could he be dead drunk at a time like this!\n Not, now, baby. He\u0027s seen the Light, but hasn\u0027t found the Light within himself yet. Give him time.\n Screw that! His ass is worthless in this condition. This is -\n Focus on the task at hand.\n She took a deep breath. All right, say a prayer and let\u0027s do this.\n Damali raked her locks and dropped the private connection to Marlene and waited for her to seal the room against Yonnie and Tara\u0027s ears. She placed both hands on the table and closed her eyes to keep from screaming.\n \"Listen,\" Damali said as she let her breath out hard. \"I\u0027ve explained how these things seem to roll, how fast they move, and what liquefies them - so stay sharp. From what I sensed, they\u0027re on the move.\"\n \"If they\u0027re tortured demon remains and still have enough negative energy to have them in feeding zones,\" Marlene said as she lifted the sweat-damped hair off her neck, \"then they\u0027re probably coming back to where they were killed or had a grudge.\" She looked at Damali and a silent understanding passed between them. \"We know demons, like ghosts, are location-locked. Raven had vampire in her, so she could trail you and me wherever. But your foster father wasn\u0027t a vamp, so if he moved past the location where he was killed as one of the undead to find you here, then it stands to reason that he had to be following negative grudge energy.\"\n \"Good enough theory to work with for now, Mar. That bastard was definitely a demon while alive,\" Damali said, her line of vision going toward J.L. and Krissy. \"Let\u0027s go with that hunch and see if we can get something to confirm it. Fire up a computer, get on the Net, and see if you can pick up any weird news services, crazy sighting reports, anything that sounds like what I just saw. I wanna know when the sightings began, regions, anything. Check the spook nets and paranormal watchdog sites in cyberspace.\"\n Krissy and J.L. almost bumped into each other as they both snagged laptops and sat next to each other, their eyes intermittently glancing at their screens and Damali.\n \"I know you\u0027re the bomb, but how\u0027d you pick all that up? The thing about the grudge,\" Dan asked, his gaze flitting to Marlene for confirmation, but paying way too much attention to J.L. and Krissy.\n \"Because, like I said, it was her foster father and he didn\u0027t die on this land,\" Marlene muttered.\n \"Yeah,\" Damali agreed, her voice tight. \"The one who tried to molest me when I was living with Inez. He got smoked by some people who knew some people, and he probably came back from the realms where I suppose his bestial ass should have gone. Amanthra revenge level and were-demon realms - Levels Four and Five. The signature scents were all over him.\"\n For a moment, no one spoke. She\u0027d never openly admitted the private violation to anyone but Inez. Now, like all the other humiliations in her life, this, too, was out on the table for family inspection. Jose\u0027s eyes met hers and held such empathy that she had to glance away. When Marjorie covered her mouth, Damali began to pace. \"All right. So, that means demon food, the Damned, is getting spit back up topside.\"\n \"Lilith\u0027s open portals,\" Marlene said quietly, seeming deep in thought. \"When you injured her, maybe she didn\u0027t have enough energy to seal them behind her?\"\n \"Or maybe none of the entities on any level had enough balls, or juice, to go behind a Level-Seven sister?\" Shabazz folded his arms over his chest. \"The thing that\u0027s fucking me up is, nobody on the team felt it - even though we\u0027d run the portals checks by the numbers after the Philly job... which means we\u0027re slipping.\"\n \"The bigger question is,\" Rider said, clearing his sinuses, \"why-arc we slipping? How\u0027d the hell we miss that?\"\n \"Yeah, unfortunately, the person I could ask for sure about the portals or our senses being off is out cold,\" Damali said flatly. \"Lilith was on the run, like the Chairman. I doubt either one of them went home to face Poppa on Level Seven and tell him they\u0027d been bad children. If that\u0027s who opened the portals, then that would be the only entity that had enough juice to close them off... but I\u0027m with Rider. How come we didn\u0027t feel it? Even Tara and Yonnie didn\u0027t pick that up.\"\n Damali walked back and forth between the table and the wall, as though trapped. \"We need to know what this fleeing food can do, besides kill innocent people. Do they turn people? If so, what do they become, where do they come up from, what\u0027s the gestation if a human gets injured by one, but lives? I want to know everything about this madness. Get Father Pat on the phone, and ask him to do whatever he can to secure the convo from the Vatican, if that\u0027s where he is. Something tells me we need a double layer of protection on this discussion.\"\n They waited as J.L. left his laptop and tried to raise the aging cleric by a landline.\n \"Hold it,\" Krissy said, standing with her system and rushing over to Damali. \"Look. Woman eats boyfriend\u0027s heart in hotel. Police still looking for the weapon that opened his rib cage. Entrails everywhere. A month earlier, assailant had tried to file a report and obtain a restraining order, claiming her ex-husband had come back from the dead and beat her. Assailant was subdued and taken into police custody. Defense attorney\u0027s seeking insanity plea. Assailant awaits trial in Mississippi facility for the criminally insane.\" Krissy shoved the laptop into Damali\u0027s hands, seeming both proud of her work and scared.\n \"Dear God,\" Marjorie whispered.\n \"What\u0027s the date on that?\" Damali muttered, visually scanning the article and then shoving the laptop back toward Krissy to grab.\n \"Not quite a month ago,\" Krissy said, and then looked at J.L.\n For a moment Damali didn\u0027t speak. Krissy and J.L. were supposed to be constantly monitoring all the crazy news sources, and had been off the job. What was up with that? What had those two been doing all this time! Scratch the question; her ears were ringing with fury. She let out a slow but impatient breath and tried to keep her focus on the immediate need for information. Later, she\u0027d address the critical lapse.\n \"You done good, Kris,\" J.L. said, nodding, his gaze holding hers.\n \"J.L., you mind getting that landline to Father Pat?\" Damali said, growing more peevish. They didn\u0027t have time for this. When Carlos got back up, she\u0027d knock his ass out cold for leaving her in the middle of this mayhem.\n Finally, after fifteen tense minutes, J.L. got through to the senior cleric and everybody almost shouted at once.\n \"I cannot speak this over the airwaves, but it is why we were all called back to our respective headquarters,\" Father Patrick said once the commotion died down. \"Damali, with Marlene, to boost the mental transmission, I have to send this to you directly. All right?\"\n \"Do it,\" Damali said, closing her eyes and waiting for Marlene\u0027s hand to fill hers. She could feel how weak the elderly man\u0027s signal had become, but had to shunt aside that concern about his oddly fatigued condition. Marlene\u0027s quiet prayers enveloped them as Father Patrick\u0027s message came through in fits and starts.\n Look at the news reports online. The tabloids. Mainstream media is not broadcasting this; the world governments are keeping a lid on public panic. Infection is rampant. It passes by touch, not bite. One touch. Then that person touches another, and another.\n Father Pat, Damali said, alarmed, why didn\u0027t you alert us immediately?\n Since the appearance of Lilith and the Chairman\u0027s abandoned throne, we have been in cloistered conference to keep all information within our clerical units until we knew more. Initially, the sightings seemed like normal demon activity, which all Guardian teams are well versed in and can handle. But our research took us to The Book of the Damned.\n Something didn\u0027t sit right within Damali\u0027s gut. If the clerics knew something was up, they should have immediately alerted the Neterus and the Guardian squad. There was more to this, and she could feel the tension in Father Patrick\u0027s silence. She took her time responding to his statement.\n What is The Book of the Damned? Damali could feel the older cleric\u0027s lock weakening, his age, the distance, and level of his fatigue wearing him down.\n \"Okay, nix the question,\" she said aloud into the speakerphone, trying to preserve his psychic energy so she could learn more. Clearly, even in the extremely private mental exchange, he wasn\u0027t ready to divulge everything. That really troubled her, and she knew it had to be bad if the old man was even shielding portions of a Neteru-to-Covenant telepathic transmission. Fine. Then she\u0027d pose a more generic question for the sake of the team; her squad needed to know what they were up against without any additional bullshit getting in the way. \"Just tell me what we\u0027re looking for.\"\n We have been in meetings debating the cause, he said in mental fits and sputters, as though his brain needed to rest, and ignoring her attempt to give the team more data to go on. All that we know is these creatures make normal humans begin to manifest demonic behaviors. Regular people who have been infected begin acting like those entities from the realms of the undead carrier that touched them. Normal people are becoming cannibals, bearing super strength. Whatever level the infected entity came from, and whenever it touches but doesn\u0027t kill a living human, that person takes on the demon characteristics from that level.\n \"I don\u0027t understand,\" Damali said, speaking out loud for the benefit of the team, too annoyed with the Covenant\u0027s decision to keep her and her squad in the blind for something as major as this. She felt a sense of betrayal that made her defiant.\n I know how you feel, Father Pat said gently, trying to send healing balm into her mind with his thoughts. For instance, exorcisms are on the rise, as possessions mount from incubi- and succubae-like inhabitations. Living people are slithering up the walls of their homes, attacking those closest to them. Deviant behaviors from those realms are epidemic. It seems to have a twenty-eight- to thirty-day gestation period, like the phases of the moon. But the humans infected by these entities come out during the daylight hours as well.\n How do you know it\u0027s only twenty-eight days? Damali shot back, squeezing Marlene\u0027s hand.\n \"Because the normal person drops dead,\" Father Patrick said aloud, saving his mental fuel. \"Then they get back up and walk after they\u0027re buried. But not only do they sustain every death wound they\u0027d received; they\u0027ve been eaten by the creatures of the realms their souls have been sent to. When you see them, what they are is unmistakable.\"\n Shabazz raked his locks as the rest of the team slowly found something to sit down on.\n \"If we kill the carrier, do the rest of the ones they\u0027ve touched bite the dust?\" Damali waited. This time Marlene gripped her hand more tightly.\n \"No,\" Father Patrick said after a moment. \"It is exponential. You can kill the carrier, but it keeps spreading from the next infected and so on. We are working on a cure as we speak, because for those that haven\u0027t died or killed another living soul, there may be hope.\"\n Damali squeezed Marlene\u0027s hands. You\u0027ve gotta talk to Kamal as soon as possible.\n Tears stood in Marlene\u0027s eyes, and she released Damali\u0027s palms and wrapped her arms around herself to gather composure. It was pure reflex, but the physical break caused further signal dropout between Damali and Father Patrick.\n Damali gave Marlene a firm but gentle gaze. I know you\u0027re dying, but not now. Hold my hands, we\u0027ll finish this. You tell Shabazz straight up that a conversation is necessary - no bullshit. Kamal is a Guardian, and if his men are out there fighting hand-to-hand combat, like they do, they might run into a problem.\n Marlene nodded and clasped Damali\u0027s hands tightly; her eyes wild, her lips pursed shut. Oh, Jesus...\n Breathe, Damali ordered, compassion making her chest tight. We ain\u0027t letting him go out like that. Kamal is one of ours, too. Center, and breathe, so we can talk to Father Pat.\n \"Everything all right, Mar?\" Shabazz asked, standing.\n Rider poked his head in the door and glanced at Marlene then Shabazz.\n \"She\u0027s cool,\" Damali said. \"But this mess we\u0027re hearing ain\u0027t no joke. Stand down, big brother, and let us work.\"\n Shabazz cocked his head to the side, gave them both a skeptical glare, but eventually fell back and leaned with a thud against the wall.\n Once Marlene finally focused, Damali lit right into Father Pat\u0027s mind with hard questions. How do we seal the weak portals to keep more demon food from spilling out?\n Kill Lilith, Father Patrick said. As long as she\u0027s topside they will leech into the gray zone.\n Done. Anybody got a location on her?\n Not yet. Our most highly trained seers have never been able to find her. Even in the dawn of days, Adam couldn\u0027t, nor could Eve. She\u0027s very shrewd. Three angels sought her, and they couldn\u0027t find her.\n The Chairman is after her, so we follow him, then, Damali said. We\u0027re pros at finding vamps.\n Where is Carlos?\n For the first time since the conversation began, Damali hesitated. \"Dead drunk,\" she said aloud with enough emphasis that the team members\u0027 worried gazes immediately shot toward the porch in unison.\n \"That\u0027s not good,\" Father Patrick said over the speakerphone. \"Not at a time like this.\"\n \"You\u0027re telling me?\" Damali replied, her voice oozing with sarcasm. \"Try irresponsible, stupid, totally...\" She closed her eyes and took a deep, cleansing breath.\n \"What if he accidentally got bitten by one of those things?\" Dan offered, defending Carlos. \"Maybe that\u0027s why he\u0027s out there asleep and nobody can get him up, you know? I mean, we\u0027ve never seen him outta control like this. What if he\u0027s really hurt?\"\n \"The Damned cannot infect a Neteru,\" Father Patrick said bluntly. \"Just like Neterus are impervious to the other demon bites.\"\n \"Oh,\" Dan said quietly and looked out the window.\n If you know it can\u0027t pass to a Neteru, then you\u0027ve dealt with this before? Damali waited. The elderly cleric had slipped and told her more than he\u0027d intended. Her tattoo was tingling. She knew what was said next would hold the answer to why the Covenant was being so cagey.\n Father Patrick sighed. \"Drop Marlene\u0027s hand. Only me and you.\"\n Damali glanced at Marlene as their hands parted but their gaze held each other\u0027s intensely.\n Adam went after several Lilith. I\u0027m sure you can understand why, Father Pat said. The Amanthras thought they could claim him through vengeance... given what happened with Lilith, then subsequently, Eve. They allowed one of their damned out of the Amanthra feeding nests to attack him, given that it was too risky for a demon in that era to show themselves topside with the Almighty\u0027s wrath still at an all-time high. Remember, these were the old biblical days and forgiveness was nigh. Eden had been breeched.\n Damali ran her palms over her face, better understanding why the Covenant was trippin\u0027 so hard. If this mess went back to Adam, and he\u0027d been attacked...\n Quite right, Father Patrick said. He conquered the creature much as you instinctively did, using Red Sea salts. Adam used what the angels that sought Lilith and her Lilith used, crystalline tracker that had her energy in it to hold her, but with something so much more in the crystallized element of salt. Adam was injured by one when he fought it, but never carried the infection, or passed it to his family or others, even though it had touched him. So, we know Neterus aren\u0027t carriers.\n What\u0027s with the salt, why that more than any of our other weapons? I mean, my on-the-fly theory worked - burn it to temporarily disable it, but you guys seem to know -\n Crystallized natural minerals from the sea that was much-later parted by the Hand of God, from the holy region near Eden. Crystals hold a charge. Light infused from the Almighty\u0027s creation lightning arc... and it worked for you because it had been charged again from the waters parting during Moses\u0027 time.\n \u0027Nuff said. I got it. Salt from the water parted by the Hand of God...\n Yes, Damali. We know that something as simple as salt, but as profound as the Creator\u0027s touch, stops the Damned. But the damage they can do once they are topside is enormous. Even if we get them all, who they\u0027ve infected is an anathema to us until those people start exhibiting clear signs of the infection. We have been making combinations of saline solution to try to use as an antidote, to no avail thus far. There is also the problem of how to quickly distribute it, how to know who was infected, and how to inoculate anyone who hasn\u0027t been yet. We just don\u0027t know, and time is of the essence.\n Damali\u0027s thoughts whirled. If Adam had seen this, so had Eve. Which meant her Neteru queen would know what they did not. There had to be an antidote. And if Carlos could get his act together, maybe he could ask his ancestral Council of Neteru kings a thing or two as well. But that was a conversation for another day.\n All right, Father Pat. We find the Chairman, use him as bait to get to Lilith, and put them both to sleep. That should close the portals. Sounds like we\u0027ve got thirty days or less, given we don\u0027t know how many actually came up right after the battle in Philly. They could have just started coming up a month or two ago, or maybe more. Problem is we just don\u0027t know how many humans have been infected.\n Temporary silence waited between them. Damali couldn\u0027t tear her mind away from thinking about all the people riding the buses, folks bumping into each other on the streets in a crowd, standing in elevators, kids hugging their parents, or greeting friends with an embrace or handshake, brothers high-fiving after a game, lovers touching... even down to somebody handing another person change for a dollar...\n The spread of this is unquantifiable until the infection finally manifests itself, Father Patrick said in a weary tone. And we cannot just take innocent human lives on a hunch that they\u0027ve been touched. Each person who dies and comes back adds to the legions of the Damned, and each is a loss from the Light. Of course, with this surge in dark energy, there has been a breakdown in normal human behavior as well.\n Damali paused, hike anything already deep and dark slithering inside a person\u0027s head is given more energy?\n Yes. Tell Carlos to call me as soon as he can. I\u0027m concerned. Even those of us within the Covenant are being affected. I will not speak of my other brethren\u0027s issues, but I\u0027m sure you can understand why each of us was called home.\n Hold up, Damali said. You said Neterus can\u0027t -\n Adam couldn\u0027t be infected, but he wasn\u0027t impervious to the energies and neither was Eve. It was at that time that Adam and Eve made that fateful choice in the Garden.\n Wait, Damali nearly shouted and folded her arms. Then, who released the Damned the first time around? Lilith?\n The Chairman, Father Patrick said flatly. Lilith was on the run and didn\u0027t dare cross her new husband, Lucifer. He\u0027d provided her amnesty. But remember, in that era, the Chairman was also a Level-Seven entity. He had not been banished to the weaker Level Six and made a vampire. That\u0027s why we initially discounted him and thought that with Lilith on the run, she wouldn\u0027t attempt such a stunt that would allow her enraged husband to find her. Until we began to see the same manifestations that had been reported in the ancient Dead Sea Scrolls, we weren\u0027t sure if the Damned had surfaced again. We now believe that she was simply too weakened to close the portals she\u0027d opened, and has fled. The issue is we cannot confirm that theory.\n Damali allowed her arms to fall away from her body and covered her mouth. She mentally blotted out Marlene\u0027s stricken expression. Oh, my God... that\u0027s why the ancient Neterus have been quiet on this one.\n Yes, Father Patrick said quietly. This shames the heads of both Councils, to some degree. But if a direct request is made, maybe they would give some guidance within their own ranks. They have heard our entreaties and said they would take it under advisement. No one wants to touch this matter with a ten-foot pole. Every layer On High is debating personal choice, not wanting to breach that human option as they assist and potentially draw the Wrath. The current living Neterus, you and Carlos, have to make clear decisions, defeat this the old way, for reasons the angels have not yet made clear to even us. Each time we\u0027ve asked, we\u0027ve been told to have faith, patience, and to back off. Ausar and Aset inquired and were told to wait and watch and that they would be given a sign, so their hands are tied.\n What! Damali mentally shouted. But what if the dark side has been perfecting this biohazard weapon since they ran the test on Adam? What if it\u0027s not an accidental energy leak and there\u0027s more to this? What if they\u0027re working on some new Neteru-compromising infection -\n Yes. It\u0027s thoroughly documented that they will stop at nothing to be able to render a Neteru ineffective. We just hope this isn\u0027t it. We\u0027ve all been discussing whether or not they needed larger populations to see if it worked, because the first time they tried it, Adam contained it. Then they targeted major biblical cities - I take it you remember Sodom and Gomorrah? What was the Light\u0027s answer? Total wipeout. Noah\u0027s flood... wipeout of the contagion.\n Damali\u0027s breath hitched, and Marlene offered her a full-body hug. But why didn\u0027t we know about this before? We should have been warned and -\n We were! It\u0027s in all the scriptures across every religion telling humanity to brace themselves for visceral spiritual attacks and to stand firm in their choices before the sea spews back her dead and -\n I know! But, specifically, why didn\u0027t -\n Because, child, after the sacrifice of the Lamb, there was enough heat in the system... enough Light to keep the portals closed. Lilith dared not come to the surface, and Level Seven was lying in wait for the right hour. But when she thought she had a sure-fire plan, she acted prematurely and opened a way for the Damned to escape. Don\u0027t you understand? The only thing keeping this somewhat manageable is that this all occurred while Hell was in leadership chaos. These infected souls, the Lilith\u0027s food, are slipping out of each realm and sporadically escaping. They have not been harnessed as a direct weapon, yet. The power drain on Level Six is making it difficult for them to properly align. But if anything galvanizes them at that strongest strategic level above the Seventh... like if the Chairman gets reinstated, or a replacement is found -\n Not on my watch.\n We hope not. We have faith, and it is only because of what you and Carlos did together to ransack Level Six that this imminent event has been somewhat diffused.\n I can get Yonnie and T -\n No! The elderly cleric shot back, his thoughts so sharp and fearful that they almost fried a few synapses.\n Damali winced.\n They are friends to you and your team, but multiple thrones sit vacant. The temptation for a master vampire to claim one is too great. He could even seat his mate. Then, where would that leave us? Now do you understand why you and Carlos weren\u0027t informed?\n Damali nodded. I understand, but they already know about the Damned.\n We don\u0027t care if they know about the Damned. If they are inclined to assist by eliminating any roaming undead all the better. But Yonnie doesn\u0027t need the temptation of an empty council-level throne. Father Patrick\u0027s mental voice had become a strained whisper. Tell Carlos to call me the moment he\u0027s lucid. If he is going to petition Adam... well, let\u0027s just say that they have very different personalities and backgrounds. I\u0027m concerned.\n Yonnie and Tara have a bounty on their heads if they go subterranean because they helped me and Carlos, so I don\u0027t think they\u0027d risk trying to go underground on us, Damali said firmly, hoping the old priest would relax.\n Every person living has some demon that they fight. Ego, fury, hurt, insecurity, lust - pick one, dear Neteru. Even if they have conquered it, this dark energy could make choices they have to make very difficult. Weaknesses become magnified during this turmoil. Close the portals and that will cease. Destroying Lilith is the first step. Finding the antidote for all those infected hut not yet lost is the second step. If we get the book to release all those from the dawn of time, that would be the pinnacle of a successful mission.\n Damali remained very still. The elderly priest had mentioned the book earlier and then evaded her question for more information about it when she\u0027d pried. Now it had been mentioned again. She seized upon the opportunity during the seconds he rested and gathered his thoughts. The Book of the Damned. What is it? Who has it? What does it do?\n We have yet to be sent a sign about how to acquire this - we know who has it, but where it is hidden is unknown. Just like the antidote, this remains a mystery... We were hoping to have more before we contacted you, he said, still skillfully evading her direct questions. In the past, there was never a cure. Before, a total biblical-level wipeout had been the Almighty\u0027s answer... and we hope that will not come to pass again. Our information is only twenty-four hours old. You have not been kept in the dark long. Don\u0027t lose faith in us at this juncture.\n Again, Damali hesitated, letting the information Father Patrick had just disclosed sink in. She wondered if this explained Carlos\u0027s behavior. Everybody on her team, herself included, had been off kilter. Damali closed the door on that part of her thoughts.\n How is your team faring, Damali? Father Patrick asked, probing further.\n Damali sighed and gave in. Issues are bubbling up and personal fires have been flaring up faster than I can put \u0027em out. She let her breath out hard. This book, we have to find it. Period. The antidote could even be in there, who knows?\n Like I just said, we know who has it... and we know what it contains, we just aren\u0027t sure where it is. Father Patrick hesitated and let out an audible breath into the speakerphone.\n Talk to me, please, Father. How can we beat this problem if we can\u0027t even know what our weapons are?\n The Chairman has it, he finally said in a quiet mental voice. Any of those fallen into the realms through trickery or deceit must be called by name from the angels\u0027 voices to release them from bondage below. It will not release the Lilith or any fully turned entity until they are exterminated. But these walking dead, the food of the realms, will be called into the Light and given a second opportunity to make amends. If we had that, we could save any and all who died from this recent outbreak... maybe even some of those from before it. But the clock is ticking. If the planet becomes overrun, Hell will commence the Armageddon, not the other way around, as it should be - and our side may not have enough souls left in our coffers to battle what is to come. The Creator might have to scrap the most magnificent experiment - humankind... the whole planet. By fire this time.\n \"Whoa!\" Damali said, breaking eye contact with Marlene and raking her locks. The entire team watched her stalk back and forth. What Father Patrick said was enough to spike her sensory capacity to overload. She didn\u0027t need prompting to ask the elderly cleric her follow-up question. Pure frustration riddled her system - she\u0027d held that freakin\u0027 book in her own hands when she\u0027d gone into Council Chambers to beat the Chairman\u0027s ass down... and she\u0027d let him have it back? Damali groaned and briefly shut her eyes. No wonder the old bastard was so ready to cut a deal! Yeah, she\u0027d wrested the embryo from Lilith, but she still felt like she\u0027d failed.\n Steadying her nerves, Damali addressed Father Patrick in a subdued mental tone. Assuming it will be next to impossible to get this book from the Chairman, let\u0027s go back to the antidote as plan B. What is it? How do we get it out, worldwide, before any infected person drops? That\u0027s what we have to find out.\n I wish we knew, Father Patrick mentally replied, his mind so weary that Damali could barely hear him. His sentence came across as a rasp. Until we know if it\u0027s a prayer, something dispersed in solid or liquid form, and what dements are involved, we can\u0027t fathom a delivery system. This is also how the governments got involved. A few of our elite members, who shall remain nameless for the sake of propriety, had top-level conversations with world leaders. This is serious, Damali. I\u0027m not authorized to say more, fust know that extreme human measures are being considered to quell the contagion that none of us are happy with.\n Humans always tend to mess things up, and governments can\u0027t be considered rational. Far from it. Damali sighed and rubbed her temples.\n \"Thanks for the heads-up. I\u0027ll explain what I know to the team and investigate. Why don\u0027t you try to get some rest? You sound bone tired, Father Pat.\"\n \"I am, sweetheart. Truly, I am.\" \n","sourceLink":"https://allnovel.net/the-damned-vampire-huntress-legend-6/page-4.html","bookId":2530,"book":{"id":2530,"title":"The Damned (Vampire Huntress Legend #6)","description":"Storyline: \n The Damned (Vampire Huntress Legend #6) \n Damali Richards knows all about a blood rush. The kind that happened when she first went skin-to-skin with former vampire Carlos Rivera. Or the kind that happened on the streets of Philadelphia, when her crew took on the devil\u0027s own. Now, Damali, Carlos, and the Guardian team are recovering in the Arizona desert, trying to hold it all together and find out how much love, and how much war, they still need to make…until the demon consort Lilith changes everything. \n The Damned are seeping out from below, and a new contagion is spreading simply by touch. For Damali and Carlos, time is running out. With Armageddon near, the ultimate truths lie strewn from a shaken underworld to the pristine mountains of Tibet, where the two lovers will approach a pinnacle of power--and the scintillating, shocking secret of salvation....\n \n","cover":"https://allnovel.net/images/the-damned-vampire-huntress-legend-6.jpg","author":"L.A. Banks","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-damned-vampire-huntress-legend-6.html","creation":"Oct 5, 2019 8:58:50 AM","modification":"Oct 5, 2019 11:41:09 PM"}}
