{"id":56476,"no":254,"title":"Chapter 253: The Mystic Maiden","content":"Chapter 253: The Mystic Maiden The Pharmacist wiped her eyes, and set about the business of composing herself. After a few moments, she returned to the doorway and softly knocked. “Mama, come in.” A silvery voice called out to her from within. A young girl’s voice. A small smile was on the Pharmacist’s face as she pushed the door opened and entered. “Hello darling.” Lan Jue entered right behind her. Though he’d guessed it earlier, what he saw proved that the Pharmacist’s actual age was much different from her appearance. This young girl was older than he’d anticipated. She was perhaps seven or eight, and so adorable it made one want to just smother her in affection. She wore a small white Chinese-style dress, embroidered with a plum blossom pattern. Her shoulder-length hair had been bundled up on the top of her head like her mother. It made her look even more a tiny classical beauty. There was a purity about her as well, the purity of youth. She had two large and beautiful eyes, with long eyelashes. The eyes were bright and clear, though the pupils were slightly larger than they should have been, and lacked any vivacity. Although it was only the first time he’d met her, already Lan Jue’s heart was full of pity for the young girl. She was adorable, and gorgeous – perhaps her blindness was a result of heaven’s jealousy. “Jun’er,” the Pharmacist cooed pleasantly. The little darling’s face lit up with a smile, and she tentatively picked her way towards her mother’s voice. She took a few steps, then paused in uncertainty. “Mama, is the guest here?” She had excellent perception! At Lan Jue’s level of cultivation, he was constantly and automatically hiding his aura from others. For most, if he wasn’t directly in their line of sight, then no one would know he was around. “No, darling. Not a guest. Mother has answered you sweet heart. Do you remember your seventh birthday, the wish you wanted?” The Pharmacist covered the distance to her young one, knelt down, and wrapped her in a hug. The little girl’s whole body shook ever so slightly, as she turned her face towards Lan Jue. “Mama, mama… you, you brought daddy back?” Tears flowed freely from the young medicine woman’s eyes, but she nodded emphatically all the same and choked with sobs. Lan Jue was at a loss for words. He’d originally suspected this role would be an easy one to play, however now that he was face to face with her, he was finding it very difficult to present any deception. He took a few steps forward until he was beside the Pharmacist, then knelt as well. He gentle took up one of Jun’er’s tiny hands. “Jun’er.” The little thing nervously shifted from one foot to another. Her dim eyes lit up, and her tiny voice was hopeful. “Daddy?” Lan Jue was silent. The Pharmacist looked at him – not with intimidation, or command... just hope. Tears glittered in her eyes. “Yeah,” he said. Pretty laughter bubbled up from within the child. “Daddy! Daddy why’d you go for so long? Mommy is always telling me stories about you. Can I touch your face?” “Of course,” he answered. Lan Jue lifted her tiny hand and placed it on his cheek. The Pharmacist relinquished the young girl from her embrace. Jun’er’s second little hand lifted, and gently began exploring the contours of the Jewelry Master’s face. Her hands were cold, but tender and delicate. The smile on her face was sweet, wide. “Daddy’s very handsome. The bridge of your nose is very straight, you must be very handsome. And now that you’re back, mommy won’t be so tired all the time. You should be nicer to mommy, she missed you a lot too. I hear her crying at night sometimes when she thinks no one is listening.” Lan Jue took her in to his arms. “I guess I’ve made things hard for you and your mother these last few years.” To this, Jun’er quickly shook her head. “Jun’er’s been good. I’ve gotten big! See, I’m not crying. Daddy, can you tell me a story about your time in the army? Mommy says you’re a hero, that you left us because you were out saving people. You were too busy fighting the enemy, so you couldn’t come back.” Lan Jue blinked. Jun’er’s father was a soldier? Surely, he mustn’t have been any ordinary man to marry a woman like the Pharmacist. “Alright... how about I tell you the time I fought off a bunch of monsters!” He lifted her up, and they both took a seat on a nearby sofa. “Yay!” “Not long ago,” he began, “your father visited another planet. It was a beautiful planet, with lots of pretty trees and oceans. People called it a holiday paradise. But then came the monsters…” Lan Jue told the story of his time on Tai Hua. He embellished parts of the story, and through his artful recounting Jun’er was hooked. The Pharmacist sat at one side, watching silently. Her tears had once more stopped, replaced with a smile. As Lan Jue continued with the lengthy story, Jun’er had cuddled up beside him to listen. By the time he finished, she was fast asleep. He and the Pharmacist brought her to bed and tucked her in. He watched her for a moment, an expression of disappointment on his face, before the Pharmacist beckoned him over with a wave of her hand. They left together, quietly shutting the door behind them. “Thank you,” the Pharmacist said, quiet and genuine. Lan Jue shook his head. “She a brilliant little girl. Her father…” A pained smile spread over the Pharmacist’s face. “He went missing, during a military expedition. Out in the cosmos, a fight… there are a lot of unknowns. I had thought, strong as he was, that he wouldn’t have any problems. Who’d have thought he’d never return. I was pregnant with Jun’er at the time. His name was Mo Liansheng.” “Was there any attempt to find him?” Lan Jue asked. Once again, she shook her head. “We tried everything,” the Pharmacist responded, “but the only information we had were his coordinates before he disappeared. It was out in the middle of space, nowhere near a planet. I was pregnant, and though he left no trace I hired a spacecraft to take me out and search for him. The result was that the background cosmic radiation… now Jun’er can’t see.” Lan Jue sniffed. “So he could still be alive. Our universe is not lacking in miracles.” The Pharmacist gave a dismissive laugh. “I’ve given up on that possibility years ago. I’m fine, but thank you for your comfort.” “Alright, well I’ll head out,” Lan Jue said. The Pharmacist called after him. “Will you be coming back?” Lan Jue nodded. “To the best of my ability. I’ll spend time with her whenever I have spare time. My Discipline is lightning, so perhaps I can also help her train with bioelectricity. And who knows, maybe it can help her eyes.” This clearly pleased the Pharmacist. “Really? That’s excellent. Thank you.” As she spoke, a small porcelain bottle inexplicably appeared in her hands. She handed it to Lan Jue. The Jewelry Master answered by gently pushing her hand away. “I help you, because we’re both part of Skyfire Avenue. And because I respect your husband. He must have been a first-rate soldier. My brother is a soldier, too. If I accepted any sort of payment from you, it wouldn’t be a favor I’m doing – it’s be a transaction. If we did that, there would be no way for me to face Jun’er. Do you understand?” The Pharmacist was stunned. However, she gently nodded her head. “Again, thank you.” Lan Jue’s heart was heavy as he left the Hall of Supreme Harmony. The Pharmacist and her daughter were not the only family this had happened to. The East employed many soldiers. He still remembered the young man he spoke with on Tai Hua. A soldier’s honor and responsibility… but if something should happen to them, it’s their families that bear the pain. It wasn’t just the soldiers themselves that were deserving of respect, but their families as well. Lan Jue went back to the surface and got on his bicycle, then left the Avenue behind. He pedaled easily towards the NEU, all the while thinking about his class. He would discuss soldiers today, he thought, and though it was a difficult subject to broach he imagined it would draw a good number of students. ζ There were quite a few students today, as he anticipated. Perhaps it was the residual memories of the Ma La Tang he’d taught them of last time, but whatever the reason two thirds of his classroom was full. He started the class by assuring them there wouldn’t be any fine cuisine today, no etiquette instruction. He just wanted to share a story. It was about a man, a soldier for the East who left on a mission out in to the reaches of deep space. When he vanished, his wife went looking and their daughter ended up blind. It was a story about pain, and about facing the bitterness that life can sometimes provide. None of the students spoke during the story, and only sat in rapt silence as the information was delivered. When the bell finally rang and the students filed out, their eyes were wet with tears. After class, Lan Jue made his way to Grace hospital. Zhou Qianlin would be busy with her training for the next little while, so he had decided long ago that he would stand in for her in the interim. It would be a way to cleanse his own soul as well. There were many in the universe that needed help, he thought, and though he couldn’t do much it was his responsibility to help who he could. ζ Grace Hospital was quiet, peaceful. It was the afternoon, and at this point many of the hospital’s denizens were lazily enjoying the sunlight. “Ey? Little Lan’s here. Where’s Qianlin? It’s been a few days since we’ve seen her. We miss her!” An elderly women smiled happily at Lan Jue as she greeted him. Lan Jue smiled amicably at her. “Hello Granny Meng. Qianlin has enrolled in a training program, so she’ll be out for about two months. It’s a closed training, so they won’t let her leave. She asked me to come in her pace for the time being, and help where I can. I’m all thumbs, so if there’s something I get wrong please let me know!” “Nonsense, nonsense. Ahh, two months without Qianlin! We’ll miss her, but you Little Lan – don’t tire yourself out. Here, I brought you an orange, have a taste.” Enthusiastic patrons of the hospital surrounded Lan Jue. He gracefully accepted their kindnesses, then set about helping; cleaning clothes, cleaning robes, cutting hair, cutting nails… Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-253","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai.","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
