{"id":56551,"no":329,"title":"Chapter 327: Military Uncertainty","content":"\n Chapter 327: Military Uncertainty\n \n “I’ve brought everyone back, and the training has been completed,” Lan Jue said. “You can check on their improvement yourself. My responsibilities for the ARC are completed, so I’m getting back to my etiquette courses. Unfortunately, though, I’ll need to be leaving again in about half a month. Perhaps we can fit a few more classes in to these couple of weeks.”\n Wu Junyi quickly nodded his head. “Not a problem. We’d have you in for classes every day if that’s what you wanted. Just let me know what schedule you’d like, and we’ll see it done.”\n Lan Jue nodded, appreciative of how helpful the Director was.\n Then, a cunning smile spread across his face. “Professor Tan was telling me earlier about the training, and how much improved everyone is. Apparantly, every single one of your students has shown incredible gains. It only makes sense that we should keep this going, don’t you think? But relax, we won’t bother you too much with it. Just some instruction on how to run it would be grand.”\n Lan Jue knew that some the Director was here for some self-serving purpose. He frowned openly as he replied. “It is entirely unacceptable for you to copy my training methods [1. While this is true everyone, China is a culture of professional secrecy. ‘Ancient Chinese Secret’ is a trope you see often in older kung fu movies and the like, and it’s rooted in reality. Especially for things like this, Chinese masters are famously tight-lipped about their methods. Even while I was in med school, I was told by no small number of people to find a ‘lao zhong yi’ or old Chinese doctor to be my mentor. If I was lucky, he’d teach me all I’d ever need to know about Chinese medicine.’]. And if I’m being honest, I’m surprised at how good it all turned out. A lot of it was due to luck, and unforseen access to beneficial resources. Do you think you’ll even be able to rustle up another group like this, with their level of talent? If you managed to pull together another batch, then another training wouldn’t be out of the question – the school would have to cover all expenses, though.”\n The training had been a massive expense for Lan Jue, both mentally and monetarily. Between the materials, medicines, and cost of flying Zeus-1 all the way to An Lun, the costs were enough to make a normal man blind. And he’d assumed it all himself.\n Wu Junyi struck a more conciliatory tone. “Ah Professor, you’ve sacrificed a lot for us, we know this. Take it easy, the school will definitely make sure you’re compensated. Once all the checks and determinations have been finished we’ll refund whatever you’ve spent.”\n Lan Jue’s brows rose. “Director… that’s quite a lot. Where will the school get the money?”\n “From the training class, evidently,” Director Wu explained. “Apparently one of the big shots opened his mouth. The military has explained that they will be giving out monetary compensation for every student that joins up after graduation, to pay for training.”\n Now, Lan Jue was truly surprised. “The Army? Those sneaky bastards. I bust my ass to turn these kids in to soldiers, and all the Army has to do is say they’re interested before you toss them away?”\n Wu Junyi was taken aback by the young professor’s response. “These pilots are being turned in to warriors, isn’t that what we wanted? Certainly this is beneficial for everyone.”\n Lan Jue’s face crinkled in displeasure. “You should also pay attention to where they’ll be serving. The military doesn’t just train bodies, but minds. You shouldn’t seek to recoop losses like this. If you’re really interested in making money, the best way to do that is to train your charges properly. Think about it, how difficult will it be for them if they decide they’re not interested, but the university is obligated? The administration should really think this over.”\n Wu Junyi was an astute man. His face hardened from the unspoken indication. “You’re saying someone’s worried about these students becoming Easern assets? Every aspect of the training was a strictly-kept secret – how could anyone from the outside have learned about it?.”\n “How precisely the information leaks is a question that needs answering,” Lan Jue said. “I know that none of my charges could – every opportunity to communicate outside of the training was blocked. It’s the university that has to consider resources. I’m sure that whoever has agreed to pay your price for these students will likely test their skills to determine payment.”\n Director Wu was beginning to understand the problem. “Alright, I’ll dig a little deeper. If there are any problems, I’ll let you know.”\n “Be careful where the money comes from, Director,” Lan Jue said. “That’s all they need to steal our bright minds away, and obligate our students in to service. If you don’t accept, you – and the students – will have more options. The second you accept, that’s it.”\n Wu Junyi looked back at him hesitantly. “So should we continue their assessment?”\n Lan Jue nodded. “Yes, that would be good. It’ll help ease doubts and shore up confidence. Give the students a week to recover, and we’ll keep our ears open for any news. When you have the results, come to me immediately.”\n “I will.” The happiness with with the Director had begun their exchange was gone. He left without another word.\n Lan Jue did not remain in the office. This was a matter he’d have to think deeper on. With all the work and effort that had gone in to the training, a leak seemed impossible.”\n Lan Jue exited the electives building and pushed his bicycle toward the campus exit. He continued to ponder on the issue. If things really were problematic, he thought, he could rely on the Keeper’s influence to get more information. As for the students, he had a couple routes to consider. First, he had to ensure that the rest of their time in school was suitably intense to keep their skills sharp. If they did choose to join the army then An Lun would be the best destination. That was Lan Qing’s turf, and most important was they were a cohesive and unfractured unit. There was no room for internal strife, or disobeying orders. His students would need to be iron both body and mind before they were ready to be true An Lun soldiers. Then they would reach their true potential.\n So he would wait for news, and learn who this bigwig was. If he was a trustworthy person, then the possibility of a military deal wasn’t out of the question. After all, service to the nation was a noble obligation.\n A rough voice interrupted his trek. “Once again you just saunter ahead without looking where you’re going. What the hell are your eyes for, anyway?”\n Lan Jue was rudely brought to the present. He lifted his head to see Tan Lingyun – clearly ready for a fight – just ahead.\n Lan Jue’s face immediately darkened. His voice was deep and displeased. “Who do you think you are talking to?”\n Lan Jue was immediately and violently struck with regret. The moment the words left his mouth he remembered, he was no longer the masked Demon Drillmaster. He was the meek etiquette teacher Lan Jue!\n As might be expected, Tan Lingyun’s reaction was as quick as it was fierce. She traversed the distance between them in a single stride. “To you actually. Your blind ass is staggering down the street with that rusty piece of garbage and not even looking forward. Do you have a good reason for trying to run me off the path? Not only are you a piece of shit with no real skills, but you routinely run around pissing women off. People like you are the basest scum of the earth!”\n “I-I didn’t see it was you.” A wise man knows when to retreat. Lan Jue had to resort to placative language to keep from blowing his cover.\n Tan Lingyun’s brows shot up. “Oh! And if it wasn’t me, you think it’d be fine to just tear in to randomly people you nearly hit on the street? Hypocrites like you make me sick.” She snarled, then whipped her leg at his shins with force enough to break them both.\n “Eeeeeiiii!”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-327","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
