{"id":56601,"no":379,"title":"Chapter 377: The Fabled Battle","content":"\\n\\n Chapter 377: The Fabled Battle\\n\\n \\n\\n Under situations like this, resources are required to fuel further scientific and technological growth. The North – who had always stood at the forefront of human innovation – was the most adamant about interstellar expansion.\\n\\n However, since that time, when the universe had been carved out in to the Alliances, external growth was no longer an option. So the North turned inward. It became a race for resources, for anyone with enough resources could accomplish anything.\\n\\n Obviously the remaining resource-rich planets were under the control of the East and West. Though the West was not on par with the North technologically, their disparity wasn’t huge. The East took up the inferior position due to the fact that it had always been that way.\\n\\n So, in order to secure more for themselves, the North saddled up to the West. Together they undertook several actions against the East, even going so far as to enact an economic blockade. All of this was just a ploy for the North to take what rightfully belonged to the East. [1. This is a nod to nationalism in China. The Chinese are very sensitive about what they view as their sovereign territory. Research Chinese territorial disputes if you\u0027re interested. It\u0027s an important topic for anyone who truly wants to understand China and East Asian politics.]\\n\\n As the East struggled to deal with the aggression, one figure arose to stand against their foes. He appeared from nowhere, and after three nights the North had lost three of their top commanders in the field. After a month, three Bastion commanders were inexplicably found slain.\\n\\n Because the West had never directly become involved in the conflict, none of their people died. However, there was a very public display made of the President. He was found hanging from the flagpole outside of the congressional building. Luckily he hadn’t been hung by the neck, so he survived.\\n\\n This enraged both the North and West. They dispatched their strongest Adepts to find the murderer, however they didn’t need to look for very long. This mysterious man appeared, and challenged these adepts directly.\\n\\n The fight took place on a distant planet. Five Paragons of the time came, including the Pontiff of that era. All of them perished. The one who bore the title of Satan lived to get back home, but died from his wounds shortly thereafter. In all, seventy foreign combatants came to answer the challenge. Only twenty returned.\\n\\n The West and North called it D-Day 2. It was a great military tragedy, and all of it was at the hands of one man: Jue Di!\\n\\n Before the fight, the East’s attackers had far greater numbers of top-level Adepts. After the battle, however, things were different. Since then, the East has enjoyed the advantage in regards to powerful Adepts.\\n\\n Although Jue Di, the God-King, was never as famous as Master Qiantian – ranked second among the Paragons – he was nonetheless the strongest human being in existance. For a long time, Jue Di’s name was a curse. No one dared speak it. In the end, the West and North dismantled their blockade. They even paid restitution for the damage it caused.\\n\\n Jue Di disappeared after that, though he would reemerge in situations of dire need. Even today, the North wouldn’t dare encroach upon Eastern land without confirmation of Jue Di’s death. The Eastern Alliance had taken the opportunity, after Jue Di’s actions, to put all their effort in to strengthening the country. Now both the West and North had to acknowledge the East’s power.\\n\\n This was why the two Archangels reacted so dramatically to the name. Jue Di’s name was taboo – he was the boogeyman, only real and deadly. Neither of them had been present for that fight so many years ago, but they’d heard stories. With nothing but his own abilities, the God-King defeated the strongest Adepts of the day.\\n\\n The current Pontiff had been there, however, though he was a Cardinal at the time. He was one of three from the Pontiff’s Citadel to return. When information about Jue Di and the battle were recorded in the Citadel’s annals, there was only one word he needed to write; invincible. Since that day he never again spoke of Jue or the things he’d seen. Clearly it left a deep and lasting mark on his psyche.\\n\\n “No… that’s impossible.” Gabriel swallowed hard. The anger from before was gone, replaced with fear.\\n\\n Uriel smirked. “That’s my hope as well. But a power of light and dark, with the ability to draw things in… that sounds a whole lot like a Taiji Master. Whoever this is, isn’t Jue Di… but they could be one of his disciples.”\\n\\n Gabriel’s brows furrowed. “Why would they want to come after us? Did we offend him in some way?”\\n\\n “I’m also interested to know why this is,” Uriel mused. “If we want to discover who these people are, then the first step must be to find out their purpose. This isn’t some pointless game, there must be a reason for all of it. Otherwise we likely wouldn’t have been the target. But the more I think about it, the less certain I am of where they came from. The chances are very small that their agents from the North. The East, we were just in the Avenue and the Pontiff took pains to show goodwill. They have their own problems as well, not the least of which being the Clairvoyant’s retreat. He likely won\u0027t come out of his museum alive. On the surface one might say the Avenue is a real powerhouse with their four Paragons. But the two Paragons together couldn’t match the Eye of the Future. The Arcane Magnate and Cosmagus are not weak, but are further down the power rankings from the Pontiff. Anyway, if they were interested in power than the Conclave would likely be their first target.”\\n\\n Gabriel pondered for a moment. “What about rogue Adepts? Jue Di was a rogue Paragon, wasn’t he? He belonged to that organization…”\\n\\n Uriel huffed. “Not a chance. Sending someone our way, only to tell us some nonsense about the Dark Citadel… it’s a ruse. Someone trying to stir up trouble, or deliberately trying to cover their tracks.\\n\\n Gabriel nodded thoughtfully.\\n\\n The book was returned to Uriel, and he hid it away in the folds of his robes. “Would you like a glass of coffee?”\\n\\n His companion waved the offer away. “No. After what you’ve told me, how could I want a coffee? In the end all of this is because we simply aren’t strong enough. So tell me, Uriel, how strong was Jue Di reputed to be? Five Paragons against one, and he walked away unscathed… is that even possible?”\\n\\n “I’ve never seen anything like it with my own eyes, nor do I have any way to accurately evaluate his strength. However according to what I’ve read from the Pontiff, it’s entirely real. The Paragons themselves also have a system of rankings, four to be precise. What they are exactly I’m not sure, but at that time Jue Di was supposedly at the very top. By comparison His Majesty, the Cosmagus, the Arcane Magnate are all still within the first stage. Master Qiantian is a mystery. He’s been missing for so long, who knows? Still, I doubt seriously that he’s stronger than Jue Di.” Uriel tapped his fingers against the arm of his chair as he thought.\\n\\n “Ahh,” Gabriel lamented. “When will we breakthrough to Paragon? I’m desperate to feel what that level of power is like. Well, it’s time for me to go – I won’t trouble your meditations any longer. We must keep improving, or true strength will forever elude us.”\\n\\n Uriel didn’t stop him, and nodded. “Take care of yourself. If you need to leave the Citadel, bring Michael. I’ll be locking myself in seclusion for the next few days before I leave. These stressful times help me to think clearly. Maybe I’ll break through.”\\n\\n “Very well. If you’ll be here then I’ll handle the tailor,” he replied with a flat tone.\\n\\n Uriel only nodded.\\n\\n Gabriel stepped out of the room. From outside Lan Jue could hear respectful addresses from the clergy on guard. Once more, Uriel plucked the Encyclopaedia Roboris, Martial Articles from his robes and looked over it’s cracked leather cover. As he did the light of disappointment shone behind his eyes. What Adept didn’t dream of becoming powerful?\\n\\n After a little while, Uriel lifted his hand from the book’s binding. A pale ball of white light extended from his hand and illuminated everything around him. The golden geometric designs set in the walls and ceiling began to glimmer brilliantly. A single column of light – soothing and pure – poured down on to him from on high. He prepared to meditate.\\n\\n “I have a great deal of admiration for you, Uriel. Your reputation is well earned, to find a clue in such conditions as this.” A voice, calm and slightly haughty, interrupted the Archangel’s silence.\\n\\n The Cherubim’s eyes popped open. Before him stood a man concealed behind a butterfly mask.\\n\\n He didn’t waste a second. Uriel was up and launching himself toward the center of the meditation chamber without even stopping to get a good look at Lan Jue. In situations like this, when you were already suffering from surprise, wasted time could mean one’s death.\\n\\n Before Uriel could get far, however, Lan Jue shot forward as a bolt of golden lightning. He reappeared before him, blocking the angel’s path. Fluid as a lazy stream, he swept his hands in an arc, level with his navel. The action caused an aura of black from one hand, and an aura of white from the other to bleed in to one another. The result was a perfectly spherical orb of equal parts black and white, but then the light vanished revealing the image of yin and yang.\\n\\n It was a strange power, and as it appeared Uriel felt himself being drawn closer to his attacker at an even greater speed. Uriel didn’t utter a sound, for even before he could reality upended itself. Colors were inverted, the skies turned to dust and everything became what it was not. He couldn’t tell where he was anymore.\\n\\n Changing the world around in this way, even on a small scale… this was almost like a Paragon’s Domain! Uriel was stunned enough with the revelation that someone would have the gall to attack him in the heart of the Citadel. But he didn’t have time to dwell on it – escape was paramount.\\n\\n The meditation chamber’s mystical spells had been activated, flooding the chamber with the elemental force of light coalesced from outside. It also served to separate the room’s interior from any outside distractions. Uriel’s goal had been to stop the beam’s power and allow sound out once again. When his enemy appeared before him, he knew his only chance was deactivating the spell, and so he had tried to bull-rush through, and take head on whatever power this man possessed.\\n\\n Just then, a milky-white light rushed out from the center of his chest. It formed in to the shape of a blazing sword, and lashed out of it’s own accord toward Lan Jue.\\n\\n However before it could, the power of Lan Jue’s Taiji energies sapped its power. It slowed, as though it were trying to slice through a mire, until amidst a host of impotent buzzing, the sword stopped dead in the air.\\n\\n Uriel spread his hands wide, and at the motion his saber of light erupted. In to a million shards of light. They flowed like quicksilver toward his attacker, surrounded him. The world around Lan Jue was swallowed up in those twinkling, deadly lights.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-377","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \\n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
