{"id":56603,"no":381,"title":"Chapter 379: Avoiding Detection","content":"Chapter 379: Avoiding Detection “Yes, sir!” Constantine was as surprised as all the others. Employing this kind of power here was not a good thing for the Citadel. People would be seeing dangers in every shadow, and their enemies will be laughing at their misfortune. However, things would be done as the Pontiff commanded. It was never wise to get on a Paragon’s bad side. Constantine left in a hurry to perform his tasks. As he did the Pontiff’s staff blazed even brighter. Rays of golden light pierced to the horizon. The Pontiff wasn’t confident in their ability to find the enemy, truth be told. For this person to have the gall to waltz right in to the Cathedral, they more than likely had an exit strategy. Still, with the Pontiff’s Faith and the light of his staff, they couldn’t hide for long. With the Pontiff himself leading the search, the Inquisition wasted no time. They splayed out down every street and alley just as they’d done for Raphael. Lan Jue remained still as a corpse. Gradually a white light emerged from him, still partially hidden by the pillar he hid behind. The pale shroud dimmed in to a concrete grey which served to make him even less distinguishable from the surrounding buildings. To say nothing for the lack of people in the corner he’d chosen, even if someone were to chance by they’d be unable to see anything. His heart rate was down to ten beats per minute – weak and slow. Even an infrared sweep likely wouldn’t show him on the scanners. Reims wasn’t a large city, but it wasn’t small either, the Citadel only had so many men they could use to clear the streets. There were limits, he knew, to what they were able to realistically achieve in a manhunt. However, the addition of the Pontiff himself aiding in the search changed things. It made the stakes much higher, and far more dangerous. ζ By now the Cathedral square was full of people. Most were clergy, but a number were prisoners. They were marched here without warning or explanation, but in the face of the Citadel’s full strength there was nothing they could do. With the Pontiff in the heavens above, blazing like a sun, who would dare try to fight back? “Your Majesty, we’ve gathered all the unbelievers located by the Light of Faith. None were left out.” Constantine appeared again before the Pontiff, confident in his work. The Citadel’s leader nodded. “You’ve worked hard, Constantine. Let’s see what we’ve got.” Before he\u0027d even finished, the Pontiff and his Archangels were descending toward the heretics. The Paragon was already scanning the crowd for his prey. One by one, he examined the prisoners. Many were spies or agents from the Dark Citadel, but none were the man he sought. None of them possessed a power above sixth rank, and he knew the attacker was ninth at least. The Pontiff’s face was so sour he looked as though he might scream. All of this energy expended, and the only thing they found were petty criminals. They were pulling out all the stops to no avail. Everyone could feel the fury bubbling just below the surface. There was also fear, but he didn’t let anyone see that. “What should we do now, Your Majesty?” Constantine asked. He enjoyed a very close relationship with the Pontiff, which certainly helped him get the office of High Inquisitor. “Get in touch with the Western parliament. Ask for their help in our search. Detain anyone from the East, and make sure no Eastern tourists leave the city,” the Pontiff said. “Are…” Constantine trailed off. What the Pontiff was saying, would have a significant impact. The Citadel was autonomous, but that was all. Even if the Western government did agree to help, what would be the cost to them? Likely too much. “Are you sure this is wise, Your Majesty?” Metatron interjected. “This will undoubtedly sour our relationship with the East – it may even force Skyfire Avenue to intervene. I urge you to reconsider.” The Pontiff’s face eased visibly, his rage restrained. “Very well,” he conceded. “Request aid from the parliament in locating a pair of terrorists. Ask that they take extra precautions with any Easterners attempting to leave Eurmania. Suggest an energy scan.” “Yes, Your Majesty.” Constantine sounded relieved. “Release them,” the Pontiff announced, waving away the heretics. “None of you are to leave the city until tomorrow.” With his commands delivered, the Pontiff turned and returned to the Cathedral. Metatron followed close on his heels. The Lord Archangel noticed that his Master was not himself. He was usually far more level-headed. ζ All the while, Lan Jue never moved a muscle. The light of faith dimmed, and eventually vanished. Not until the faintest hint of a threat was gone did Lan Jue begin to revive. He walked calmly back to the hotel through the deserted streets. ζ “Your Majesty, are you alright?” Metatron followed the Pontiff back to his chambers, and only then ventured the question. The old monk shook his head. “I’m fine. Just a little out of sorts. He was in my grasp, but then his aura… it was just like Jue Di’s.” “Jue Di!” Metatron gasped. “Your Majesty.” Several of the other Archangels had followed their leadership in to the Cathedral. Gabriel took a step forward, his expression strange. The Pontiff motioned for him to speak. The Messenger of Death continued. “Before Uriel’s disappearance he was expressing the same theory to me. Our enemy had some connection to Jue Di.” Gabriel went on to summarize the rest of their conversation. The Pontiff nodded thoughtfully as he listened. “Uriel appears to have been correct. This man is likely to be Jue Di’s apprentice. That aura is unmistakable. I was too shocked at it to react, and he took the opportunity to flee.” The atmosphere grew anxious and somber. Though irritating beyond measure, this enemy wasn’t an insurmountable threat. They weren’t afraid of this man. They were, however, afraid of the one who stood behind him. To the Pontiff, Jue Di was an inhuman thing – a demon. That was why he couldn’t react. “Your Majesty,” Metatron interjected with brows furrowed, “were you able to puzzle out this man’s objective?” The Citadel’s leader only shook his head. Gabriel looked at them both. “Could this be revenge for when Jue Di was besieged?” “Jue Di’s revenge? That’s the best you can come up with?” Ramiel openly laughed .”Jue Di was the one who called for the fight, and in the end our losses were staggering. If anyone should be seeking revenge, it’s us. The God-King has been missing for dozens of years, why pick now for any sort of revenge? This is a disciple. If it was the man himself, how do you think we could scare him off?” The Angel of Visions openly shamed Gabriel, and his face reflected his displeasure. His voice was tight. “Again you go too far, Ramiel.” Both of his close friends had been taken, and Gabriel was in no mood to be trifled with. Ramiel’s snide remarks instantly put him in a rage. The Pontiff fixed both of them with a hard gaze. “Enough!” All of the Archangels receded a step, and bowed respectfully before their master. He turned his attention to Metatron. “Once more, tell me every detail we’ve gathered.” Metatron and the others rose, then the Lord Archangel recounted everything they’d learned up to this point. “Go to the Dark Citadel?” The old cleric muttered, going over it in his mind. “When I received this information, I determined it was a ploy to get us to leave the city. The two clearly weren’t Satan’s agents, so I thought nothing of it.” The Pontiff shook his head, returning from his thoughts. “Jue Di believed that words were important. A man should say what he means. If these terrorists are his apprentices then the message may not be a ploy.” Metatron looked aghast. “You’re saying Raphael and Uriel might be with Satan? That these two are some sort of foreign agents for the Dark Citadel?” “We mustn’t dismiss the possibility,” the Pontiff instructed. “Increase monitoring of all travel to and from the Dark Citadel. “Yes, Your Majesty!” ζ “Huhh-“ Lan Jue heaved a sigh, pulling the window curtains closed. He shut out the scene of agitated bustling from outside. An angry Pontiff was certainly not someone to start playing with, and an errant satellite sweep could catch sight of him through a window. That would cause some troubling consequences. Right now, hiding was the correct move. Zhou Qianlin had replaced her close and sat nearby. Her face was pale. Although Lan Jue was in control when the two were merged, she could still feel everything as clearly as though it was her own body. Now the fear was settling in – the realization of how close she was to death at the hands of a Paragon. “Your Queen of Heaven transformation is very, very useful. More than I’d have thought.” Lan Jue said with a chuckle. Qianlin gave him a flat look. You could say that again. The Protogenic abilities Lan Jue had used in his fight against Uriel were her own. What Uriel must have suspected to be some insidious attack, was actually a flood of healing energy designed to make him feel better. Of course the Queen of Heaven’s powers imparted sensations of peace and comfort. Who would expect their enemies to heal them in the midst of battle? Naturally, he resisted. However the Queen’s powers are enhanced and perfected with the addition of protogenic power. Though not as complete as the Mystic Raiment, her regenerative powers were strong enough to seep in to every pore. Uriel, unable to resist the all-pervasive sensation, panicked. Lan Jue took that opportunity to finish the fight. Once again, the increased power afforded by his fusion with Qianlin had given him the boost he needed to definitively end it quickly. Then, once he was out, he’d also relied on Qianlin’s powers to help him blend in more completely with the environment. In situations like these, her protogenic transformation was much more useful than his. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-379","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai.","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
