{"id":56609,"no":387,"title":"Chapter 385: Succeed and Retreat","content":"\n Chapter 385: Succeed and Retreat\n \n Lan Jue crouched in a dark corner, hidden in the shadows of an awning. He heaved deep, heavy breathes but there was still the light of excitement in his eyes. The crackling sounds of electricity filled the air as he vanished once again in to a power socket.\n He’d planned all of this ahead of time, of course. Lan Jue had been confident from the beginning that the Pontiff had been the only one he need fear. Joined with Qianlin, these bird-men could be bested. Even Metatron couldn’t handle it.\n It wasn’t that Lan Jue was ‘stronger’ than the Lord Archangel. The key lay in planning. He knew that everyone in the Citadel feared Jue Di a great deal. Seeing the mystical powers Jue Di possessed set them off balance, and gave him the advantage.\n Lan Jue had trained in the mysteries of Taiji for years, but ever since experiencing Qianlin’s Queen of Heaven it felt different. His comprehension had improved by leaps and bounds. Secrets that had been obscured were clear now, and that understanding had helped me escape from the lion’s den unharmed.\n Metatron’s face was a pale blue – not from Lan Jue’s strike, but from the internalized anger he was struggling to control. This was the first time since becoming the Lord of Archangels that he’d been so thoroughly defeated. If this stranger had been a Paragon it would be another matter, but he was just an Adept! A man with a Discipline no further developed than his own. Even with all his support, they couldn’t land a single blow. Metatron couldn’t afford to lose this man again.\n Metatron had seen clearly that, had he blocked that final attack, his attacker would have needed time to recover. They could have grabbed him them, and kept him locked down with their Discipline. Unfortunately, he hadn’t had the strength to content with Lan Jue’s strike.\n Gabriel and Constantine didn’t say anything, but there was disbelief in their eyes as they stared at Metatron. Never once had they seen Metatron employ the full range of his abilities like that. And still, this man who was one step from Paragon, couldn’t stop a single Adept?\n It was also the first time they’d ever encountered a power like this. Even now, they couldn’t entirely grasp both the leveraging and explosive force of this martial power. That brutal offensive that beat Metatron to the ground still had them stunned.\n Only Metatron himself clearly saw what had happened. It hadn’t been strength – at least, not his enemy’s strength. Through misdirection and subtle influence, he’d used his own condensing powers while borrowing Metatron’s momentum to block others and strike at him.\n All of that together had been too much, and Lan Jue was able to flee.\n “Constantine, recall all Inquisitors and ask if they witnessed anything. Everyone else, with me. We’re going to tear this city apart until we find him.” The Archangel was absolutely livid.\n Metatron was off in the direction Lan Jue had fled. He was a flash of golden light as he raced to catch up with the enemy. The light around him revealed all, a physical manifestation of his divine consciousness that was able to differentiate things that were dissimilar. The Light of Faith\n Compared to the Pontiff’s, Metatron’s light covered a much smaller area. While it was an exceptional ability, Lan Jue just needed to remain fifty meters away to ensure he stay hidden.\n As the others rushed to search through the Cathedral, Lan Jue idly strolled down the lane, away from the scene of the crime. Lan Jue wasn’t silly enough to leave the planet directly from Reims, so he boarded a flight to another city, the capital of Eurmania – Europa. Long-distance vehicles were the ones being most closely watched currently, so going directly was asking for trouble.\n He didn’t ponder too long on what the Pontiff would do once he returned. His objective was complete, and never once had he used his true Discipline to do it. Puzzling out who he was would be almost impossible. The last time he’d tussled with the Angels he was a rank six. No one would expect him to have grown this strong in only a few short months.\n As to being pegged a Disciple of Jue Di… so be it. It was what it was. Anyway, the distinction wasn’t false. In fact it couldn’t be more correct.\n With modern technology, commutes between cities rarely exceeded one hour. It held true for their trip to Gomorrah, and it was no different now. Half an hour after take-off, they were in Europa.\n Zhou Qianlin and Lan Jue exited the plane together, hand in hand. They stepped out on to the streets of Europsa, and Lan Jue turned to his companion. “What are the odds of your fiance showing up, huh?”\n Qianlin glared at him. “I don’t have a fiance.”\n Lan Jue had been bored on the trip, and told Qianlin about the time Richard had sent his goons after him. All the old wounds Qianlin was trying to forget were reopened.\n “When are we leaving, anyway? Are we going directly from here?” she asked.\n Lan Jue nodded. “But not just yet. The Pontiff has a great deal of clout with the Western government, and a complicated relationship. They couldn’t ignore this even if they wanted to. Right now, all long distance flights are being very closely monitored. So we wait, there’s no rush. Besides, Little Yue can’t stay in interspatial containment too long. She doesn’t look like she’s in very good condition, so we’ll have to patch her up a little.”\n Europa was the financial and governmental capitol of the Western Alliance. It was a bustling press of humanity, weaving in and out of renaissance-era buildings that had been painstakingly brought all the way from the mother world. It lend the whole place a cultural, antiquated charm.\n Lan Jue booked them a room in a hotel called The Westin. Unlike Reims, they wanted one of the best hotels the city had to offer.\n There had been a need for secrecy in the Citadel’s territory. Europa, though, was absent the Pontiff’s absolute control. They wouldn’t dare brazenly accosting citizens here without governmental consent. Luxury accommodations were also much more conservative with their client’s information, which was another reason he’d chosen this place.\n Lan Jue chose one of the nicest rooms available, and they were lead to it. Once inside he immediately turned on the ‘do not disturb’ light, which earned a smirk from the bellhop. He was given a tip and sent on his way.\n “You men are all pigs,” Qianlin complained haltingly.\n Lan Jue sighed. “I know! And I can’t do anything about it with things between us like they are!”\n Qianlin chortled at him. “Serves you right.”\n Lan Jue sorrowfully shook his head, then walked in to the bedroom. He retrieved the Empress from his dimensional pocket and deposited her on the bed. She was still unconscious, but breathing. Qianlin saw the ragged holes where she’d had her hands and feet nailed to the cross, and gasped in alarm. She covered her mouth and turned away.\n Lan Jue scowled and her took the pirate’s hand. He lifted her wrist to spy the finger-sized hole they’d left. The surrounding tissue had already begun to die. A thick, foul pus ran from her wound, but there was no longer any blood. The wounds in her feet were no different.\n She was much thinner than she had been the last time. She was practically skin and bones, and by the looks of her the last few weeks had been torment.\n Thankfully, Lan Jue could feel that her life force was still vibrant. Lan Jue’s abilities didn’t emphasize healing, and neither did Qianlin’s. The empress, though, did have healing capabilities.\n Qianlin acted first. She turned back and laid her hands upon the woman. Her power flooded through Yue’s meridians, clearing them of blockages [1. In Chinese medicine, trauma is said to cause stagnation of qi and blood, which blocks the meridians and prevents nutritive energy from qi and blood from nourishing the injured tissue.]. Qianlin could feel that she had been sealed, like Raphael and Uriel had been. There weren’t any traces of protogenesis, though.\n Those gentle, soothing powers continued to permeate through the pirate’s cells. After a time, the seal pulsed and released a faint light. The Moonfiend Empress reacted with a weak sigh. It was clear that torturous ceremony had nearly drained her Core. Luckily, the damage didn’t reach the source. She could recover.\n Lan Jue fetched a glass of water, which he handed to Qianlin. She carefully helped the Empress drink a few sips. After a few minutes, color began to return to her sallow face. She opened her eyes.\n They were a strange pink in hue, and when she could focus her eyes fell immediately upon Lan Jue.\n “Zeus… am… am I dead? But wh-… why would you be here?” Her muttered words were barely audible.\n “No,” Lan Jue’s deep voice assured. “You’re very much alive. And so am I. We got you out from the Citadel dungeon. How do you feel?”\n “You saved me?” She stared up at him with wide eyes. Moisture began to collect at their corners.\n Seeing the look on her face, Qianlin followed her gaze up to Lan Jue. She smiled.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-385","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
