{"id":56638,"no":416,"title":"Chapter 414: Compensation","content":"\n Chapter 414: Compensation\n \n Lan Jue gave her a conspiratorial look. “You didn’t see him hiding behind me when we came in? He was hiding his face – he didn’t want anyone to recognize him. Lina may have brought him here, but Chu Cheng’s in his home court. He was just playing innocent to lure her in to his trap. Why do you think everything was so quiet, so well orchestrated when he got up on stage? Everyone knows him here, even the boss is his close friend.”\n Qianlin’s face reddened. “It looks like Lina was right,” she said quietly. “He’s a less than reputable guy.”\n Lan Jue laughed. “And me? He and I have been close friends for years, and several of those questionable skills I’ve learned myself. There were times he and I painted the town. I guess that makes me just as disreputable.”\n “It’s not the same,” Qianlin assure. “You aren’t as bad as he is.”\n He looked back at her with a brow raised in surprise. “How’s that?”\n Her face broke in to a suspiciously sweet smile. “No reason. I guess I just have faith.”\n “Heh, that makes one of us,” Lan Jue said helplessly. “I was a young, full of piss and vinegar once. I partied irresponsibly like my friend does. I was a playboy, too, in several senses of the word – not nearly so nice as you may think.”\n Qianlin’s face fell. “It sure sounds like you’re trying to talk me out of hanging around you.”\n “Not at all,” he assured hastily. “Just sharing a bit of my past.”\n She was immediately all smiles, as much an actor as Chu Cheng. “That’s enough of that. I don’t believe any of it. If you were a womanizer then why haven’t you done anything with your amazons? They are all beautiful girls who certainly wouldn’t say no. I’ve seen the way they look at you. To me, this is proof that you’re a good man.”\n “The… ehm… situation we found ourselves in when we first met shows you like women, so that’s not it. The scars you bear for my sister have never healed, and no playboy could have that much passion for a single woman. Whatever you did in the past isn’t important, because I can see you for who you are now. I’ve thought a lot about it, and I think I know what I should do.”\n She moved closer to him and laid her head on his shoulder.\n Lan Jue dramatically knocked the heel of his hand against his forehead. “Alright, yes, fine – you got me. But the most detestable thing is to see that cake, but be unable to eat it!”\n Qianlin laughed. “I guess we’d better work hard at cultivation. Oh, look at Chu Cheng! He really can dance!”\n The Hades descendant was just getting to the meat of his dance as floodlights picked him out from the darkness. It was a story of sorts, like a young man courting a girl on campus for the first time [1. Again, university is the first time a man is allowed to begin any sort of courtship process. Parents and teachers actively watch for signs of affection before this – high school included – and squash that shit with an iron fist. I’ve had student complain to me about having to sit in parent-teacher conferences because they told a girl they liked them.].”\n It was a story expressed through his flailing limbs and swaying hips. Boy meets girl, boy falls in love, and the chase begins. Through hardships and trials he wins the girl’s affection, however her family encounters tragedy. Never once does the boy leave her side. He spun his yarn beneath the lights, under scored by the moving music. Lina was a prop in his show – a show that would give Hua Li a run for his money. Every motion was a word, every step a sentence.\n At first, Lina reacted to him with scorn. Who danced like this at a night club? However as the story unfolded, and as the whole place seemed to come around him to tell the tale, she realized she was no match for Chu Cheng. He was a professional, and she was an amateur who knew how to use her Discipline for effect.\n This fictional girl’s family survived whatever calamity had befallen them, but the boy began to succumb to exhaustion. Chu Cheng seemed to slowly buckle while keeping to the rhythm. Each chord was a death kneel as he theatrically collapsed to the ground. The control he had over his body confessed years of training for this sort of thing.\n Although he had slowly succumbed to collapse his eyes never left hers. They were full of forgiveness, love, but most of all despair. Though Lina knew this was just all for show, she couldn’t keep the moisture from welling up in the corner of her eyes.\n Chu Cheng shot to his feet, his face suddenly devoid of that sad expression. An easy smile took its place as he bowed in gentlemanly fashion toward Lina. But before she could even react, his head dropped down to his stomach\n The sudden unexpected change caused Lina to scream in terror. “Aaaahhhhh!!!”\n The crowd erupted in a fit of laughter, and Chu Cheng’s head inexplicably rolled back in to place.\n Realization dawned on the vampire princess, and she realized his clothing must have had some sort of wire or hook. The illusion was created when he squatted and the clothing remained in place.\n “Oh you’re really going to die, now!” She indignantly punched him in the chest.\n “Brother Cheng! Brother Cheng! Brother Cheng!” Cries of adulation surrounded them.\n Only an idiot would be unable to see, now, that Chu Cheng was a cherished member of this establishment. Lina was no idiot. She turned in a huff to leave, but Chu Cheng shot out a hand to grab her. He pulled her close, and the two of them began to rise off of the platform toward the second floor.\n “You made a bargain,” Chu Cheng softly said in to her ear. “Tonight, you belong to me.”\n Lina craned her head back to look at him. Traces of red had begun to creep in to her cheeks.\n They eventually returned to their private booth looking over the dance floor. With one arm wrapped around Lina, Chu Cheng waved at his fans below. Another round of fervent claps and cheers replied.\n The playboy turns his face to Lan Jue, who was also clapping in appreciation. He feigned modesty, saying “Listen to them laugh at how terribly I did.”\n He shot his friend an enigmatic grin. “All hail the prince of nightlife! Quite the show, sir. Quite the show.”\n With a gasp, Chu Cheng waggled a finger. “You mustn’t besmirch my good name, A-Jue!”\n Lan Jue sniffed derisively, and lifted the communicator on his wrist for emphasis. A projected array of some of the… less than kind commentary about Zeus appeared before him.\n Suddenly the wild youth’s countenance changed. “This-this has nothing to do with me…. Alright, fine yes. I spread the rumors, but you’re wearing a mask! It doesn’t matter. Oh damn, you have no idea how much shit I was in at home. I’m out because pops would probably fry me to a crisp if I went back.”\n Lan Jue allowed the projection to dissipate, then took a sip from his champagne glass. “There’s always a price when punting off the blame, A-Cheng. I wonder what the prince of nightlife is willing to pay?” The table before them was arrayed with a spread of fruit, and a bottle of pink Don Perignon. This was Chu Cheng’s domain, so of course none of this came at any cost to them.\n Sincerity lit up his friend’s face. “Name it. So long as it’s in my power to provide.”\n “A 1966 Cohiba cigar, Luis XIII brandy… though I guess Hennessy would do in a pinch. A 1929 Cognac Tesseron would be ideal, and perhaps a 1990 champagne Krug? Deliver that and we’re even – in the appropriate interspatial containment apparatus, of course.”\n Each biting word saw Chu Cheng’s face darken.\n “This is robbery!”\n “I’ve never taken a thing that wasn’t owed,” Lan Jue said. “If you don’t want to pay the price then that’s your prerogative. I’m sure there are no small number of journalist who might like to learn more about us. That I am ‘that’ Zeus. That you are ‘that’ Hades. Perhaps we conspired together to deceive this poor girl. I mean, according to everyone I’m already a bad guy, so screw it I guess.”\n “Ruthless,” Chu Cheng breathed through a depressed frown. “How did you even know I got the Tesseron? Are you spying on me?”\n Lan Jue’s eyes nearly popped out of his head. “You do?!”\n “Oy! Do what?! Finders keepers?” A voice sounded nearby, someone trying to make their voice as low as possible.\n Lan Jue turned behind, and laughed as he saw the culprit. It was his accomplice.\n Hua Li looked like he often did when out in public. He was wrapped up in more layers than carnival clown, with a hat glasses and a mask to match his track suit. It was a very sort of hip-hop style.\n He plopped down in a seat beside Lan Jue. “So what do you really have, eh?”\n “A bottle of 1929 cognac Tesseron,” he answered with a smirk. “He said he’d be happy to share it with us. A-Cheng’s really quite generous.”\n “Excellent! I do prefer a nice glass of brandy.” Hua Li rubbed his hands together. “So break it out big guy! Might as well drink here right? I haven’t been in your realm for a while – I see it’s still a good time.”\n “Two damn bandits,” Chu Cheng complained.\n Hua Li blinked at him. “Oh, bandits? Take a look at yourself there, buddy. You slander your brother and gripe over a bottle of liquor to settle it. You’re a shameless bastard.\n The playboy swung an angry glare Hua Li’s way. “You’re the shit that sold me out!”\n Hua Li shot back with a wide grin. “Whatcha gunna do about it?”\n Chu Cheng was in his face almost right away. “What am I gunna do about it? Maybe I’ll just take off these sunglasses and this hat, huh? Oh my god, people, look who’s here?!”\n Hua Li almost crumpled in on himself. “Let’s not be hasty!”\n “Yeah! You didn’t think of this when you sold me down the river, did you!” Chu Cheng accused.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-414","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
