{"id":56703,"no":481,"title":"Chapter 479: The Championship Battle!","content":"\\n\\n Chapter 479: The Championship Battle!\\n\\n \\n\\n The floodlights popped as they all turned on, all at once. Every detail of the Arena was highlighted in the stark light. The shields around the ring itself also shimmered dramatically. It looked significantly more robust than ever before.\\n\\n Most fights started with the champions separated by some distance. This kept things fair. However, neither stepped away from the middle of the ring. They stood toe to toe, looking at one another.\\n\\n “Three, two, one. The Championship Battle has begun!” They’d even changed the digitized voice. It sounded more excited for this last fight.\\n\\n Lan Jue rose to the tip of his toes. His arms rose and splayed out, in a motion that looked as fluid as it did gentle. Jun Yongye’s eyes honed in with laser focus, for he felt the energy coming from the God of Thunder. It was a strange and formless power that tugged at him to come closer, but not at his body. The force was pulling at his soul.\\n\\n Jun Yongye shot his arm out to his side. In the same motion, he staggered back half a step. A flash of white light emerged from his hand, and grew until it became his trademark simple sword.\\n\\n “Eh? The White Blademaster staggering already? Is there something more than just the gentle motions from Zeus?” Mo Xiao looked on from overhead, narrating the important points of their clash.\\n\\n In truth Jun Yongye’s movements were as deliberate as Lan Jue’s. The flailing of his hand had looked like some sort of mystical seal, but it was really casting out an invisible gust of sharp Discipline. It split the attractive power from Lan Jue’s Taiji, making it slip harmlessly around him. An orb of white light also faintly appeared around the swordsman.\\n\\n The whirling, diametrically opposed powers of Yin and Yang joined between Lan Jue’s hands. The orb of black and white was surrounded by its own atmosphere of peace. If they hadn’t seen it created at Lan Jue’s bequest, then it would be easy to confuse the universal power for a living entity.\\n\\n As though of its own accord, tendrils of errant power stretched out from that orb, alternating black and white. They brought with them the same power that swelled around Lan Jue, that odd vacuum force that was neither seen nor physically felt.\\n\\n In a day’s concentration, he had brought his Taiji powers to an entirely new level. Closer inspection would reveal that the dark and light energies were, in fact, thunderbolt Discipline. They were as soft and fluid as water, and a cursory glance wouldn’t reveal it as lightning at all. It was as insidious as it was powerful.\\n\\n As that beguiling power pulsed larger, Jun Yongye swung that simple sword skyward. The tip pierced through the air, pointed to the vaulted crest of the ring’s force field. Lan Jue heard from somewhere the disjointed sound of gurgling water. While he couldn’t see it, something the swordsman did fought back against his protective aura. Stranger, though, was what came from the crack. The breadth of inhaling force from it was staggering.\\n\\n Lan Jue’s aura undulated like an orb of water. A dip from Jun Yongye’s sword, and it was like popping the bottom end of a balloon. All the power of it flooded down and out.\\n\\n The orb in his hands rotated as Lan Jue moved his arms. As it moved, the supremely harmonious essence of it was clearly felt all throughout. The fissure that had appeared in his aura was inexplicably sealed. Then, as gentle as a breeze, Lan Jue’s hands pressed outward. The waves of harmonious energy urged the orb of black and white forward, right for Jun Yongye.\\n\\n The sword in the Blademaster’s hand moved, almost of its own. It rotated and swung in an arc, spinning the swordsman’s body with it. The arc became a circle, with him in the center of it. It was like he had cut away reality and stood in a realm all his own. The blade finished with a single-minded thrust that cast a beam of invisible energy right to the center of Lan Jue’s orb.\\n\\n In great contrast to Xuanyuan Shishi’s style, Jun Yongye’s blade was calm and peaceful. His concentration was like iron, fixed on the body of his weapon. It looked simple, but the spirit behind every movement was almost transcendent.\\n\\n This was Jun Yongye’s grasp of martial prowess. If this fight had occurred yesterday, the difference in comprehension between their styles would have been quite large. However, Lan Jue had had an epiphany, and that made him stronger.\\n\\n “Shhrip!” The strange noise came from Jun Yongye’s sword driving through the orb of black and white.\\n\\n Both of them stopped. For a moment, nothing moved, and then suddenly the orb erupted with a hundred thousand beams of light. Tendrils of lightning coiled up around Lan Jue, and an unparalleled surge of electric power condensed around him.\\n\\n Like the orb, it was a tide of black and white. After the explosion began to subside, to observers it was like that peaceful sphere of energy had simply swallowed everything up. Jun Yongye’s body was enveloped by a deep cobalt blue, and where the electric light encountered it, the assailing energies vanished without a trace. His weapon, however – that blade of light – couldn’t take it. It broke apart and dissolved in to a hazy cloud of dimming light.\\n\\n An airburst, massive as a missile shot, erupted between the two fighters. Both of them were thrown violently backwards.\\n\\n Finally the crowds were waking up. The beginning of their contest had been almost boring, until that giant explosion. Only now did they realize that the beginning of the fight had been no less dangerous, just less visibly exciting.\\n\\n Where they had been inches from one another at the start of the fight, the blast had separated them by hundreds of meters. They glared at one another, their eyes full of… admiration.\\n\\n Lan Jue’s arms traced another arc, but this time instead of summoning a ball a beam of light descended from above. It coalesced in his grip, becoming a sword ten meters long. His aura shifted, becoming more regal. He then threw himself at his foe.\\n\\n Jun Yongye watched as the black-and-white sword came crashing down from overhead.\\n\\n The Blademaster’s right hand snapped out, and another blade of light was summoned on his palm. The vicious intention of that oncoming attack made his robes flap dramatically. He spun again in a similar motion to before. This time, though, when his sword thrust out it met directly with the tip of Lan Jue’s.\\n\\n “Ting!” At the moment of impact, a blast of power was released from around him. The aura that propelled it was earth-shaking. Once more, that deep-blue shielding appeared around the White Blademaster, extending now to imbue his sword as well. It changed from white, to the same cobalt blue.\\n\\n Lan Jue’s weapon was swallowed up by the blade of light. He switched his trajectory in the air, stepping out to strafe and lashing out with his right fist.\\n\\n The Seven-Star Strike of Taiji! One of the Nine Taiji Strikes!\\n\\n The true essence of the Taiji Domain was the most important aspect of stabilizing one’s powers. Lan Jue’s comprehension was put on display when the entire fields reacted to the strike. All of the arena became a stark world of black and white, and the floor was indelibly marked with the image of yin and yang on the floor. A flickering orb of lightning was right in the middle. The whole place was immersed in the essence of Taiji.\\n\\n “Boom!” The yin-yang sword crackled and fractured into a bolt of lightning. Jun Yongye’s sword acted like a lightning rod and took the full brunt of it. The ensuing blast forced the Blademaster back nine steps before he could recover.\\n\\n Zeus rolled his arms again, once more summoning the yin-yang sword. Its reemergence was a tide of majesty that swept across the whole arena. This one was different from before. Where the first sword was borne of calm and quiet, this one was almost overbearing. It was slower, but its path was marked with a wake of black and blue that ejected like solar flares. The enormous yin-yang symbol emblazoned on the arena floor started to rotate.\\n\\n The ring was now a self-contained world of blue. Jun Yongye found himself immersed in it, and it felt like fighting against an undertow. He had no more time, there was only attack.\\n\\n He rose on to the tip of one foot and thrust forward. His body and blade moved in perfect in unison, as a single unit, then melded into one. The cobalt blade hung suspended, alive, and from its tip was fired an array of deadly wisps. It rolled like a sea of a hundred thousand swords, sweeping past Lan Jue’s electric world.\\n\\n The pull of Lan Jue’s sword-aura sent Jun Yongye’s attack scattering in all directions. Once again, he was relying on the duality inherent in the yin-yang powers to defuse the attack. Every deadly sharp wave ultimately was swallowed up in black and white.\\n\\n \\n\\n ζ\\n\\n \\n\\n The Pharmacist watched from the VIP platform. Her hands were fists, and she muttered darkly to no one in particular. “Convergence style, ‘where all rivers meet the sea’… little brother, prepare yourself!”\\n\\n \\n\\n ζ\\n\\n \\n\\n Lan Jue and Jun Yongye met on the field, their swords whistling through the air toward each other. At the moment of impact, the yin-yang sword warped and imploded into a vortex that threatened to swallow Jun Yongye whole.\\n\\n But, in that moment, the blue light surrounding the living sword flared like a supernova. Though it should have been impossible, Jun Yongye was untouched and unmoving in the air. Then, it swept horizontally toward Lan Jue.\\n\\n The wave of energy released from the motion was sharp enough to split the sky. Lan Jue’s almost impervious yin-yang powers were chopped right in half. Again there was an ear-splitting explosion as all of that power was released. The whole ring was lost in a sea of black and white lightning.\\n\\n Lan Jue was stunned. He hadn’t guessed Jun Yongye would have this ability. His blade could make the sky collapse! More startling, Lan Jue felt the world around him grow fainter. The peeling rolls of thunder sounded far away, muffled as though his head were underwater. It became dark. The whole ring melted away in the darkness until even he was swallowed up.\\n\\n Don’t get rattled! Lan Jue inwardly chastised. In situations like this, it was only the calm who saw opportunity.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-479","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \\n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
