{"id":56757,"no":535,"title":"Chapter 533: Creating a Division","content":"\n Chapter 533: Creating a Division\n \n The tedious but necessary process of separated the Adepts by strength continued. Afterwards cadets were arranged into small squads. Individually these squads weren’t going to win the war, but with the right training they could be invaluable scouts and shock troops.\n The pirate fighting tactics were perfect for the job. He needed Su Xiaosu’s experience. In addition, she had imposed control and restraint on a group that traditionally had neither. The people she commanded were not wicked, but were fiercely loyal.\n “Get some rest, don’t stew on it too long.” Lan Jue urged the Morningstar. When they hung up he took his own advice and returned to his dorm. With training officially underway, he couldn’t return to the Avenue.\n Once he got back Lan Jue ate some dinner and released Zhou Qianlin. Her condition was unchanged. Physically she was fine, but there was nothing behind her eyes. They were dull, staring voids.\n He dressed her, then placed her in a seat nearby. “Alright sweetheart,” he said softly, “you should eat.”\n He fed her spoonful by spoonful, then bathed her. Once the nightly ritual was complete, he kissed her to join their bodies and began to cultivate.\n Every day when they joined, he focused inward and called to her. He flushed their shared vessels with nutritive energy. Qianlin’s Queen of Heaven Discipline was also known for self-regenerative effects, Lan Jue knew. She would wake up one day naturally, but even if she didn’t things would change when they became Paragons. Protogenia was a mystical force that could do incredible things, joined with her healing powers. That was why he used every spare moment cultivating.\n Thankfully Qianlin’s loss of consciousness didn’t affect the speed or quality of their cultivation. When they joined it proceeded unhindered under Lan Jue’s direction. He’d tried using bioelectricity to stimulate her brain, but she looked hurt and didn’t dare try again.\n He didn’t neglect the worst case scenario. What if she never got better? It didn’t matter. Just having her with him would ease his heart. It’d suffered a lot of ups and downs lately, culminating in the assassination attempt that put Qianlin in this state. At least it had stirred his potential, and sped up his cultivation.\n \n ζ\n \n Three days later.\n Skyfire Avenue’s Star Division was nearly established.\n The cadets were arrayed on the field in their flight uniforms. It was white, with a swirling flame emblazoned on the right breast; the insignia of the Star Division. All eight hundred plus stood in rows, stretching across the grounds. Lan Jue and a few other Skyfire elites stood before them.\n “Evaluations have been completed. Today we will be separating you into units. Once that’s done training can begin.” His voice was hard and low. However, curt though it was, there was a captivating quality to it. Every eye was fixed on him.\n It wasn’t his charisma. He’d imbued his voice with the protogenic power of his Ascension command. If he wanted respect, he’d have to flex his muscles.\n The Gourmet and the Pharmacist stood at either side of him. One was a Paragon, and the other showed stupendous strength during the tournament. It was hard to say if Lan Jue still would have won if not for her forfeiture.\n “You all came for different reasons. We are Adepts, we yearn for perfection, we yearn for strength – but we also have families. This Division has been created to protect Skyfire Avenue. It was made to protect the Eastern Alliance and yes, it was made to protect your families. I’m not going to stand here and lecture you on ideals. I’m just going to tell you straight; if you want to survive this war, and maybe improve yourself in the process, then you’ll need to prove it on the training field. This Division will do its best to bring you back to those families but to do that, you have to be more than Adepts. You have to be soldiers.\n “You all came of our own volition. No one coerced you to sign up. If any of you want to go at any time, no one’s going to stop you. You turn in what we provided for you and we part ways. But by completing this training you swear to rise to the occasion when the time comes. When the call to fight rings out you answer. I hope by then we’ve formed a bond here – brothers and sisters in arms - a pact where you know the person beside you has your back. We will stand strong, stand together, and fight.\n “In addition, as a representative of Skyfire Avenue I will remind you that anyone who remains in active service for three years or longer will be placed on a priority list for the exuviation procedure. But if a long life is what you’re looking for, you have to make it back in one piece. Remember that you and a unit are not the same. When there is discipline and unity, you will survive. Alright, now for teams.”\n “The Star Division will consist of four brigades. I will be leading the First Brigade personally. The Driver will command the Second, the Coffee Master will lead the Third and the Fourth will follow the Bartender. Some of you may be wondering why the strongest leaders – the Gourmet and the Pharmacist – are not leading brigades. I would remind you that this is a mecha Division, and commanders must be masters of mecha combat. Do you remember what they called the miracle battles, against the Four Divine Monarchs and the Star Alliance? Allow me to introduce you. The Driver, known to you all as Thunderclap. The Coffee Master is really the Knave, Fastest Hands Alive. Finally, the Bartender – the Demon Dragon of Ice and Flame, and pilot of Bahamut.”\n A buzz of excitement rippled through the cadets. Lan Jue and all the Adepts around him were at least ninth level, very strong. However, being a good Adept and being a good pilot weren’t one and the same.\n The titan of electricity, Thunderclap. The Knave and his extraordinary hands. The Demon Dragon of Ice and Fire. These were names that would give them shivers, great pillars of mecha piloting. Lan Jue was himself an illustrious Monarch – Zeus, God of Lightning. With leaders like this, how could they not have unwavering faith in the new Division?\n Lan Jue quickly set about organizing the troops. Using the data they’d gathered, he arranged them according to their strengths into four types. The first type were specialized in speed. The second were unique and miscellaneous Talents. The third type were close-quarters fighters and the last, ranged attackers.\n This was the best way to call on their full potential. Too many Adepts with different specialties together would get in each other’s way, and ultimately harm the Division. If a team shared a specialty then their effectiveness improved, and their training was easier.\n It would behoove them to learn how to work together as companies, but at present he didn’t even know how long they would have before the enemy arrived. Right now they needed to stick to simple and effective methods.\n Lan Jue would be responsible for the First Brigade, which was composed entirely of long-ranged mecha fighters. The Driver’s Second Brigade was close combat. The Coffee Master and his Third Brigade were special units, and the Fourth Brigade under command of the Bartender was all about speed.\n The First and Second Brigades were the most populated. Together they numbered over five hundred strong. Third Brigade added another one hundred, and Fourth Brigade was double that.\n Now it was time for squads.\n It was the same for each Brigade; ten pilots to a squad with a squad commander and a sergeant as second in command. Leaders were chosen from data acquired during registration. The most difficult in this regard was Third Brigade. They had scores of different abilities that didn’t quite fit anywhere else. After three days of wracking their brains, though, they managed to work out a plan that matched their needs.\n Once that was finished each Brigade picked an Ace Squad to lead by example. First Brigade’s Ace Squad was saddled with the Pharmacist, but Second Brigade had it worse with the Gourmet. Third Brigades’ was the Beautician. Fourth Brigades’ Ace Squad was led by the Mechanic.\n The Ace Squads were composed of the best pilots on the Brigade. Their strength would be applied to sensitive missions and special tasks. They were all equipped with God-ranked mecha suits.\n At last the structural part was done. The cadets hurriedly reorganized themselves by Brigade and Squad, leaders at the fore. The Ace Squad members stood proud with a crown insignia pinned to their shoulders.\n Lan Jue made it clear that the Ace Squads were expected to take the most difficult and dangerous missions. However, they would also reap the best rewards. Through meritorious action and hard work, members of other Brigades could challenge for a post on Ace Squad. If they succeeded, they were welcomed with open arms. There was no max capacity.\n Then, in front of the collected gaze of the Division, Lan Jue handed out an A-ranked power gem to every Ace Squad member as a reward for making the cut. They were carefully selected to be useful for the pilot.\n The gems weren’t all provided by the Avenue. In fact, a large amount came out of Lan Jue’s own inventory. The Amazons were less than pleased to see them given out like this. In return the leadership of the Avenue agreed to front the cost of Majesty’s upgrades, and at the very least look for a replacement stealth gem. The Amazons were less upset after that.\n Lan Jue didn’t resent using his own resources, but more than just he relied on Zeus’ Jewelry Shop. The Amazons all had financial and emotional stock in the store, and he respected their opinion. Most of their haul from Luo had been sold to the Eastern government, but with the stipulation that they were only used to create the Star Division mechas.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-533","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
