{"id":56763,"no":541,"title":"Chapter 539: Tempest","content":"Chapter 539: Tempest Lan Jue had told his people all about this before coming. For commercial enterprises, the Shattered Starfields were no-man’s-land. Even the Alliance militaries avoided this place. To the Star Division, however, it was a goldmine with everything they could want. Battle plans were moving along, it was time for them to attack their next objective. Lan Jue’s people have proven that small groups were not a challenge, so their target was a larger group further away from the three main planets. It was an older, more established group they had in their sights. They were called the Desert Tempest. This clan was in possession of a battleship and eight patrol ships, hosting over one thousand five hundred pirates. They were much stronger than the Poison Wasps, and subsisted off commercial vessels that skirted the rim of the Starfields. Not only were they a considerable force, but pirates of Desert Tempest were disciplined. The planet that served as their home was called Tempest, and had served as their base of operation for over thirty years. They far outstripped the Star Division’s last enemy. The Desert Tempest were carefully chosen for their next campaign. They were far from the main planets, which was important if they were to fight against such a well-established group. In addition, its distance meant Lan Jue could use the planet for whatever it was the Godblades required for the joining process. In the first month’s battle plan, this was the longest flight yet. The Moonfiend Pirates would be quick to investigate any changes to their little pet planet, and were unlikely to let the matter lie when they discovered what happened. At the very least, they’ll want to find out who would dare attack their people. The best course of action would be to avoid the Moonfiend Pirates – for now. It was destined, since they were Lan Jue’s ultimate target. That fight would be the final test for his fledgling Division. If they couldn’t handle a group of pirates, how would they defend against aliens? “This time no one’s gunna take it from us! Second Division’s taking the lead.” The Driver arrogantly flailed the battle plans crumpled in his hands. The Coffee Master scowled in response. “Who says, you? Your people will just rush in and trip all their defenses, and lose half your number. Remember, this crew had been around a while. Ground and space defenses are not going to be anything to sniff at. And as for radar, they likely have more than one system and I’m betting they’re better than the last. These guys won’t be as easy as the Poison Wasps.” The Driver answered with a scornful glance. “That’s just your guess. Commander, send me in with the Ace squad. We’ll tear them up from within while the rest of Second Brigade attacks them head-on. I swear not a soul will come back harmed, the Desert Tempest will be handed to you on a bloody platter.” The Driver’s assurances weren’t arrogance. He believed everything he said wholeheartedly, and so did Lan Jue. His brigade commander was one of the top ten god-ranked pilots in all of humanity, after all. In all likelihood the Driver could probably take out the pirate clan himself without a scratch, all before even considering the Ace Squad. Infiltrate and deconstruct. That was the Driver’s specialty. “Come now, Driver. We’re old friends – when we come across a windfall we share in the benefits, right? Fourth Brigade should go with you as intelligence and oversight.” The Bartender wanted his piece, too, and made it known. Lan Jue chuckled at the lot of them. “Come on, we’re all adults here. Calm down and act like it. Driver, aren’t you concerned about keeping face? The Ace Squad and its leader are good enough. Somehow I don’t think he’ll find a group of pirates troubling.” “Eh…” the Driver shrunk beneath the haughty looks of the other three. When Lan Jue said it, they all remembered who the leader of Second Brigade’s Ace Squad was. Their secret weapon, the Infernal Vanguard – the Gourmet! Indeed, how could a mid-sized pirate clan cope if he decided to unleash his full power? A Paragon had the destructive capabilities of a battleship all by themselves, otherwise how was it they were considered such a deterrent force? The Driver was aching for a fight. In reality if he sent the both of them, the damage they could cause… Lan Jue rapped the table between them with his knuckles. “We’re here to train. We’re definitely not here to wave our dicks around. No matter the enemy, the four brigades must work in synergy, as a whole. United we’re stronger. Once they’re broken in, they’ll face a tough enemy and be unyielding. None of our Ace Squads are going in this time. They’ll supervise and rescue as necessary. For everything else stick to the battle plan.” The Bartender nodded. “Alright, so it is. I’ll send in my team first for reconnaissance and to collect intelligence for the final plan.” “Good.” Lan Jue replied. He looked around the room. Aside from Lan Jue and the Brigade leaders, the war council was further populated by Ace squad leaders and the Division’s Second-in-Command, Su Xiaosu. Su Xiaosu sat beside Lan Jue. When he was here she didn’t speak or involve herself much. Behind the scenes, though, all of their military strategy had been devised by the Morning Star before they were open to discussion. Her title was Second-In-Command, but she was the one directing their every move. Her commands were given through Lan Jue’s mouth. Her responsibilities were numerous. Her voice held the greatest weight, but her work was endless. Endless, but enjoyable. She found purpose in her work that brought her joy. She was different from the Amazons, and this role suited her better she thought. As former leader of the Moonfiend Pirates she had experience in spades, and compared to her former force the Star Division was far stronger. The Moonfiend Pirates had twenty ships to the Division’s two, but on an individual level they could never compete. Su Xiaosu had already told Lan Jue her thoughts on this. If this division could work together, develop a chemistry, then it would be the most terrifying pirate force the universe had ever seen. Yes, pirates – not soldiers. Soldiers required strict discipline and fought in a group. The strength of the individual was ignored. What Su Xiaosu meant when she said pirates, was a unique and fearsome mecha division. Afterwards, once the analyses had completed, she presented Lan Jue with a comprehensive training and integration plan. After taking a look and discussing it with the others, the decision to make her Second-in-Command was passed down. From training to this expedition, Su Xiaosu had shown herself to be a remarkable commander – the mastermind. She was just as much the leader as Lan Jue was. After the council was adjourned, Lan Jue turned to the Morningstar. “Is there anything you’d like to add?” “Relax, boss,” she replied. “I’ll have a detailed plan. They have numbers, and they’re well spread across the planet. We’ll need to be very precise. We need to rout them, but we need to do it with zero casualties. The Blinding Stones help us a lot with this. In addition we can lure them in, and…” Lan Jue nodded repeatedly. Her overall idea put him at ease. Over the last few days, Lan Jue had obsessively trained, merged with Qianlin as always. He had to prepare to join with the godblades, and every step up in strength meant a greater chance of success. Jun Yongye, Xuanyuan Shishi, and even the Pharmacist would cultivate at his side so he could feel the energies of the swords. To become familiar with them. It would make the process easier when the time came. Su Xiaosu stood at the main controls, looking over the data. She lifted her head and looked Lan Jue’s direction. “Commander, now is as good a time as any.” He nodded, then turned to the Bartender. “Send out the reconnaissance team.” “Sir. They’re already waiting on Zeus-1.” In similar strategy to the Poison Wasps, the Division’s smaller ship would deliver the unit to the surface undetected. They would look and report back to inform the final battle strategy. When the fighting broke out, they’d strike like a thunderclap. It didn’t matter who – or when – you fought. The most important factor in any fight was your scouts. “Commander, there. That’s Tempest.” She indicated out of the porthole toward the approaching planet. The planet twinkled green and blue against the stark backdrop of space. Normally green meant foliage and blue was water – life. Evidence suggested this place was habitable for humans [1. Astrologers/astrophysicists/bored keyboard warriors; in what situation could you have three habitable planets in a galaxy’s interior (let’s say they’re in the goldilocks zone), and a habitable planet in its far reaches?]. Lan Jue exclaimed in appreciation. “These Desert Tempest guys chose well!” ζ Zeus-1 quietly slipped away from Majesty and approached the planet, cloaked by the Blinding Stone. They shut off all nonessential systems to reduce their energy footprint. Su Xiaosu’s voice crackled over their radio. “Zeus-1. Zeus-1, this is Majesty. Respond.” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-539","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai.","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
