{"id":56780,"no":558,"title":"Chapter 556: The Destructive Power of Captus","content":"Chapter 556: The Destructive Power of Captus Lan Jue’s hand snapped out and caught the drops in midair. He sequestered himself again. This time it wasn’t just for his body or Discipline, but also to more deeply understand the sword he’d joined with. He wanted to see how the thunder essence had changed him, too. He needed time to process and understand it all, on top of seeing how Qianlin was reacting to the process. Qianlin had entered a strange state after joining with Demortus. Lan Jue found it difficult to sense how her energy changed. Her Core had been separated from his, and now she was as though lost in a deep meditation. He wanted to release her back into the world but found he couldn’t. Thankfully Jun Yongye said this was to be expected, otherwise he’d be worried. Star Division continued to clear out the pirates from around Tempest. The more experience they accrued the more efficient and masterful their raids became. Su Xiaosu treated every skirmish like a war. No matter the foe, everything was meticulously planned and no punches were pulled. Any unit that dared to slack off was harshly dealt with, and those that performed well were rewarded with praise and commendations. Over time the Star Division’s strength increased. They worked better as a group. Tempest was a remote planet, in the fringes of the Shattered Starfields far from the three primary planets. The magnetic disturbance of the Starfields made communication over such distances hard. It was good news for the Star Division, who were thus still a secret. Xu Xiaosu still had contacts on the main planets feeding her information. From what they could gather, no one had any idea their crew was out here. The only thing out of the ordinary was the suspicion that the Poison Wasp clan might have been taken out. They were a small crew, though, and no one was all that troubled. Clans took each other out all the time. The Moonfiend Pirates didn’t rush to look into the matter. This emboldened the Star Division, and their exploits reflected it. In twenty days they abused Majesty’s speed to destroy more than twenty pirate clans of all sizes. They’d grown fat with plunder. None of the clans were larger than the Desert Tempest clan, and most were smaller. They were halfway home when Lan Jue briefly left his hermitage to lengthen their mission. After twenty days of intense cultivation, he was like a new man. Lan Jue could already summon some of Captus’ power. “If we’re going to keep this war up, then we’re going to need to make a shift. We’ve taken care of most of the pirates in the area, we should start moving into the center of the galaxy. There are pirate clans in there who would be more deserving enemies.” Xiaosu delivered the info and looked to him for guidance. He nodded. “You’re right, it’s time to change things up. We’ve been here too long. Tell everyone to start packing up and load whatever’s valuable on the ships. We’re going deeper into the Starfields.” “Boss, don’t you need to finish your meditations?” Xiaosu asked. “For the time being, no,” he answered. She smiled. “Good, I’m happy to transfer command back to you. Too much pressure for me.” This made the Driver laugh. “Sure, I didn’t see any evidence of that. On the battlefield you were a Valkyrie and you were rock solid through every conflict. Which battle have we walked away from with anything less than a flawless victory? Have any of our people been hurt?” Lan Jue’s answer was mysterious. “Do you want to see what I’ve been up to?” The others looked sideways at once another. The Coffee Master was the one to respond. “Don’t tell me you’ve broken through!” Lan Jue shook his head. “That’s still a long way off. No, I’ve been learning to control a new weapon, I thought I’d show you the result. Strengthen your resolve.” The Star Division’s biggest problem was that individually, they were too strong. To command a strong army, you needed first to suppress that strength for the benefit of the team. Lan Jue had locked himself away for over twenty days. The soldier\u0027s’ commander had to make an appearance, and he also was eager to see how far he could push himself with Captus. Under everyone’s curious gaze, Lan Jue soared into the air overhead. A pale golden aura surrounded him like a rising star. Several of the nearby soldiers stopped to watch. Suddenly the sky grew dark. Before the shocked eyes of the onlookers a colossus figure emerged from nowhere. It was over a thousand meters long, with skin that was a violet-purple hue. A host of megafauna like the beasts they fought before writhed around it. Every eye was airborne now, shocked by what they saw. Soldiers rushed to summon and enter their mechas, ready to fight. But they were stopped when a fierce red light appeared. Lan Jue stopped, hovering high above ground. The golden aura had become red and then was gone. If the belly of the behemoth there was a flicker of crimson. Faster than one could breathe the light spread like a pestilence, spewing bursts of red light until it covered the monster from head to toe. The humongous beast writhed and screamed. Cavernous wounds spontaneously opened across its body and spewed chunks of mangled flesh. Seconds later, that nightmarish beast was in tatters. A red flash lit up Lan Jue’s hand, and reality gave way to a black hole. Space and time rippled around it in protest. As the beast struggled in its last throes of life, the event horizon severed it into countless billions of slivers, thin as an atom. Then it swallowed them up. It happened in the blink of an eye. From the moment it appeared to its final death rattle, only a minute had passed. Lan Jue had needed only two motions to put it down. The red light receded and vanished back into his body. Lan Jue returned to ground. “Sorry, I just wanted to give the new sword a try.” He explained no further then returned to where he’d been sitting to wait for them. He was neither red faced nor out of breath. It was like nothing had happened at all – everything was perfectly normal. Everyone just stared at him. A couple forgot to breathe for a moment. What the hell was that! That red light? The others didn’t know where that beast had come from, but Su Xiaosu recognized it because she’d seen it from Majesty’s deck! After the beast had disappeared from their radars no one had known what was going on, but Lan Jue gave them the all-clear. Now it suddenly appeared out of the blue, only to be carved apart in a single minute, it was incredible. In reality Lan Jue was also stunned by the results. What the others didn’t know was that just those two waves of Captus power drained his energy by eighty percent. Still, what power! The pillars of heaven shook with each movement of the banishing blades. ‘Frightening’ didn’t even begin to describe the sensation. At Paragon – if what Jun Yongye said was true – he’d only be capable of using one tenth of what Captus could do. At his stage of cultivation he wasn’t yet able to join his Discipline with Captus. He shuddered to think of what would happen then. He underestimated how much he’d have to work to kill the alien. When he faced the beast, a peculiar facet of the sword’s power was revealed. The aliens didn’t seem to have any way to shield themselves from it. After so long captured as one of Luo Xianni’s pictures it was bound to be weak. However, it shouldn’t have been long enough to strip its natural defenses! It had evolved to exist in the unforgiving environment of space. Even so, two strikes from Captus was all that it took. As if summoned, Jun Yongye’s voice reverberated in the back of his mind. “Not bronze, not iron, not steel. Once hidden beneath Mount Meru. What can refine this? What fire can temper sharpness? We are the weapons meant to kill the unkillable. What paltry defense could these base creatures offer?” Now he understood the source of the Pharmacist’s awesome power. The Banishing Blades were even closer to legend than he’d imagined! He couldn’t help but feel a rush of excitement. If there came a day when he could command all of its power, what sort of herculean feats could he achieve? He might even be stronger than his father. Jun Yongye had become a part of him. Lan Jue’s ideas were the sword’s ideas. Yongye replied to his thoughts. “You will only be able to access all of Captus’ strength if you became as strong as the ancient Da Luo, greatest of the god-immortals. Or, if you find the Banishing Stance. With the Stance, you could call upon all of our power.” Lan Jue was at a loss. Da Luo? Could he even imagine such a level of power? Jun Yongye’s voice returned. “Unless I am mistaken, the one you call father is on the cusp of immortality. He holds himself back, teetering on the precipice of a new reality. However he will not join the ranks of immortality. Their time has passed. The empyrean lightning flickers no more. Even if it were possible, the tiers of immortals were many. Ordinary immortals, celestial immortals, golden immortals and then at last you will rise to the power of Da Luo golden immortal.” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-556","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai.","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
