{"id":56795,"no":573,"title":"Chapter 571: I’m Not Your Woman","content":"Chapter 571: I’m Not Your Woman “Hey gorgeous, you’ve got some damn fine curves! See what you’re doin’ to me baby, c’mere and let me see what ya got. I gotta know if those are real. Your cheeks look so soft… beautiful. Know what, real or not I don’t care. Let me enjoy your goods, beautiful. You’ve aroused my interest.” The pirate stretched a hand toward the woman’s face. She glared at him with an icy-cold stare and stepped just out of his reach. “Move!” Her voice sounded strange. Sweet, but awkward. “Where we goin’?” The pirate asked with a grin full of dark promise. Then, he lunged forward to grab her. “Screw off.” A dark voice growled from nearby. A moment later the offending pirate felt an intense power tear through his chest. The others around him watched as the pirate was fired away like a missile. Lan Jue stood where the scallywag had been. The leg that had launched him away slowly returned to the ground. The Monarch positioned himself between the other pirates and the young woman. The light in his eyes promised violence if they tried anything else. “Bastard!” The remaining two pirates tried to rush him. “I said, screw off!” Lan Jue’s eyes flashed brilliant gold. The two men staggered to a stop, like they’d hit a wall. Dumbfounded, their hearts filled with an indelible terror, they began to retreat. In the pirate world, power was the most important currency. They didn’t know why they were suddenly so frightened, but they knew it had to mean this newcomer was a strong Adept. “Daring to touch my woman, are you guys tryin’ to die?” Lan Jue’s eyes flashed again. These guys were stronger than average. His first word of command didn’t completely overwhelm their will. This time, Lan Jue let his aura flare. When the radiance of his strength washed over the pirates, they didn’t dare say anything else. Both of them turned around immediately and fled. Lan Jue also surprised himself. He seemed incapable of not getting involved when a pretty damsel was in distress. The Amazons were proof of that. He shook his head in resignation and turned back. The woman was still standing there. “If you want to avoid trouble, you should cover up. Hide your figure. There are pirates all over, after all.” Lan Jue offered. She looked back at him blankly. Eventually she awkwardly responded. “I’m not your woman.” “Oh…, that was just a red herring.” Lan Jue lamely explained. She was a naïve one. She blinked at him. “What’s a red herring?” He looked back at her, helpless. Naïve didn’t begin to describe her. “It means I was trying to keep you out of trouble. I lied on purpose. I’m off, take care of yourself.” He didn’t want to spend his time involved with the young woman on the eve of their operation. He was able to confirm her strength, standing so close. Definitely second or third level. She watched him go back into the coffee shop. She thought for a moment, then strode off. In the end Lan Jue couldn’t finish the murky water that passed for coffee before Xiaosu returned. Lan Jue exited and seamlessly fell in step beside her. “How’d it go?” he asked. “Not bad, we can use it.” she answered. “When I snuck in everything seemed normal. None of the traps were tripped, so it looks like it was never discovered. But go ahead and guess boss; what else do you think I found?” A strange look flitted across her eyes. “What?” He asked. She set her jaw. “The ones from their prison.” Lan Jue almost staggered. “The ones from the Citadel? It’s destiny!” Xiaosu was, of course, referring to the poor children they’d found in the dungeons of the Citadel – the ones she was sure had been moved. How fortuitous that they’d choose to bring them here. It was a wise decision on their part. Who would believe that the Pontiff’s dirty secrets would be out here in the Shattered Starfields? If they get caught, they can punt the responsibility on to the dirty pirate menace. All this before one even took into account how strong the Moonfiend Pirates were, how much clout they had in the area. The Pontiff’s Citadel was protected out here. “Boss, I’m not going to make things harder for you.” Su Xiaosu suddenly affirmed. Lan Jue fixed her with his gaze. He understood what she was saying, and shook his head. “No, anyone with a shred of decency would do this, because it’s the right thing to do. No matter what happens, we’re going to get them out of here.” It had been on Lan Jue’s to-do list ever since they discovered the Citadel’s dungeons. He was too weak to take on the whole organization, but here they were presented with a golden opportunity. How could he pass that up? This was his responsibility as a human being. Xiaosu hung her head. “You’re too soft-hearted, boss. I appreciate it.” Lan Jue looked into her reddening eyes. “We need to rework our plan if we’re adding a rescue. Is there anything like a safe room in your palace? When the fighting starts we won’t be able to spare anyone to protect them, they’ll need to be somewhere locked away. At least until the battleship arrives.” “Yes!” She was suddenly fervent and resolute. She fluidly slipped back into being Empress. Lan Jue nodded. “Excellent. Modify the plan, and let’s get back so we can tell the others what we discovered.” First and Second Brigade had gathered in several of the more popular night attractions throughout Luna. They were the best places to escape notice. The Adepts of the Star Division went out of their way to show worth, silently slipping into the city by whatever means were open to them. Some slipped in through invisibility, others transformed their bodies as needed. They did what had to be done because that was the mission. Jin Tao, for instance, transformed into a mastiff. Another one of the soldiers who looked like a pirate led him through, like a pet. Tang Xiao was even more flagrant. He morphed himself into the image of a pirate mecha, but hollow so that his team could fit inside. The pirates themselves loaded Tang Xiao and his team into a ship and ferried them to Luna. These were only a few examples of the Division soldiers’ tricky exploits. One by one they slipped in, unseen an ignored. After all, what was a few hundred people? The Moonfiend Pirates commanded tens of thousands, with over ten thousand mechas ready at any given time. What did they have to fear from numbers so small? Confidence in strength was why security was so lax. For all they knew, there wasn’t anyone in the Starfields that could challenge the Moonfiend Pirates for dominance. Defense changed with psychology. Their biggest concern was the pirate fleet. If they could avoid them, everything would be fine. If, on the other hand, they did show up, then the planet’s defenses would give them something to consider. Lan Jue and Su Xiaosu made their way to Luna’s biggest bar. Right away they spotted the Driver, playing a drinking game with a group of people. Lan Jue smirked and muttered to Xiaosu, “It looks like he was born for this life.” The tactician chuckled. “So it seems. He’s an arrogant man, and there are a few he looks up toy. You have his respect.” Lan Jue smiled, and nodded his head. “We’re friends, it’s not about respect.” “Ey? If it isn’t Lil’ Lan come rollin’ in? Come have a drink with Brother Sai, yeah?” The Driver waved and shouted boisterously. His naturally vocal nature was catching a few sidelong glances. Lan Jue sighed. “Can I take that back? I don’t want to be his friend anymore.” Despite the complaints, he made his way over to his drinking buddy. “Ah, this is the famous Brother Sai!” Lan Jue bowed and scraped dramatically. Brother Sai? The hell kind of address is that. The Driver’s face went stiff for a moment, but he quickly recovered. “Take a seat, little Lan. The booze here isn’t bad. Hey there, girl, we’re gunna start my friend off with five Long Island iced teas, that’s a fair start.” It was Lan Jue’s turn to wince. Five Long Islands! Did he want to kill him? The name was a deceptive. Long Island iced teas were among the most destructive cocktails created. It was a mix of several types of booze that when imbibed, tasted no different than a sweet and refreshing beverage. You couldn’t even taste the alcohol. The delayed effect was infamous. Even seasoned drinkers were floored by their third one. Five was clearly an assassination attempt. “We don’t need that much, venerable elder. One is enough for me. I actually have something to talk to you about.” Lan Jue looked at his brigade commander pointedly. Just then an explosive presence joined them. A fiery woman, svelte and beautiful, laid a hand on the Driver’s shoulder. “If Brother Sai offers you a drink, it’s to give you respect. He offers a drink, you drink. You don’t want a drink, you drink!” She was dressed in a way that spoke to her flagrant personality. Her long legs were hidden beneath skin-tight leather pants. Her ample gifts were restrained only by a couple palm-width leather straps crossing her chest. Her skin was pale, and her face was caked in make-up. Still, Lan Jue could see she was attractive despite all that. Her voice was high-pitched, and several eyes turned to see what the commotion was about. Lan Jue took a quick glance at Su Xiaosu. The pirate queen quietly shook her head. This woman wasn’t one of theirs. Lan Jue then turned his curious gaze to the Driver. Damn! He’d managed to snag a pirate girlfriend in a matter of days. The Driver extended an arm and the women slipped into his embrace. He stuffed a freshly clipped cigar in his mouth and lit it. “Five glasses,” he growled, “and not one less. Otherwise don’t blame me for your loss of face.” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-571","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai.","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
