{"id":56825,"no":603,"title":"Chapter 601: The Avenue’s Seven Paragons!","content":"Chapter 601: The Avenue’s Seven Paragons! It was veritably pouring Paragons for Skyfire Avenue these days, to where it was getting unthinkable. With this new Paragon on the rise, how many did the Avenue even have now? The Photographer, the Epochrion, the Wine Master, the Keeper, the Bookworm, and the Gourmet. Adding the newcomer, that made seven. Seven Paragons! The Photographer was a Paragon of the third degree, Nirvana. The Epochrion had achieved Reflection of Heaven and Earth. The other five were only just beginning their journey, but were Paragons nonetheless. Even if you added the two Citadels and the Great Conclave together, they still didn’t come close to what the Avenue boasted now. Besides, the Adepts here were numerous and promising. With members like the Jewelry Master and the Pharmacist, it wouldn’t be too long before Skyfire Avenue had ten or more Paragons. What other Adept organization could compare? Now was a fine example. They freely shared the wealth of knowledge they were about to attain, a fact which earned them a great deal of respect. But even before considering enlightenment, safety was a major concern. The aliens could show up anywhere, but if they arrived at Skyfire at least these mighty demi-gods could stand between them. As one can imagine, the future of Skyfire Avenue was bright. As the Epochrion glowered, there was another flash of grey light, indicating the arrival of another. It was the Infernal Vanguard, who broke his hermitage to come join them. Other than the Photographer, each of the five remaining Paragons had arrived to bear witness. Clearly safety wasn’t a concern. Even if the Astral Phantom was nearby, seeking another shot, he wouldn’t dare make a move. He was fast, but not fast enough to escape a gaggle of super humans. The hymns were loud and clear, echoing across the horizon. Pulsing ripples of protogenic energy surged across the Avenue’s surface. Every Paragon had their ‘own’ protogenia. As other Paragons broke through, they released pure protogenia into the surroundings. This unchanged, raw protogenia helped them more deeply understand their own powers and helped prepare them for future growth. If they could learn something from it, then even these great Paragons could find their abilities empowered. The A.R.C. students from the National Eastern University were particularly lucky since this was their second time experience an ascension. They had been present when the Bookworm became the Karmic Scholar. Under Lan Jue’s guidance they had all benefited greatly from that. Now they had a chance to see another Paragon come into being, they wouldn’t miss it for anything. Using what they learned last time, an epiphany would likely come easier today. The Epochrion turned her head to regard the Wine Master. “Who is this?” The old sommelier grinned. “This is the Pauper. It’s likely you never paid him much mind.” Realization dawned on her. “Ah, so that’s who it is. His protogenia is strange… his comprehension is deep, despite only now breaking through. He feels nearly as robust as the Terminator.” “The Pauper’s cultivation method is unique,” the Wine Master explained. “It was handed down, a legacy. We spoke about it once. He said it was called the Taming the Dragon Arhat [1], taught by one of the great Buddhist masters. It was in fact the monk of legend, Ji Gong, who lived a carefree lifestyle. The Pauper has been at the peak of ninth rank for many years, hiding away his abilities. At last this is the reward that comes to he who waits. By breaking through to Paragon it shows that he’s mastered the Taming Dragon Arhat. He is indeed strong, stronger than those of us with normal Disciplines. He is a manifestation of Buddhist dharma, and so will very quickly enter into the Realm of Protogenia. The Epochrion sighed. “This was all probably part of the Clairvoyant’s plan. He really was a terrifying man.” The Wine Master grinned wryly and shook his head. “I couldn’t tell you. We probably lay a lot at his feet simply because of what we think he could accomplish.” Eventually the thunderous Buddhist chants faded away. Great coronas of golden light pulsed from the Arhat in incessant waves. Everything they touched was painted gold, including the Star Division soldiers meditating below. They all felt a strange energy penetrating into them, through their pores. From outside it looked like they were all covered in golden silk, as brilliantly gold as the Arhat himself. Everyone had been preparing for this moment, and as the Paragon’s energies flowed through them they quickly were blessed with insight. Lan Jue’s understanding of his own protogenia was already quite thorough, so the Arhat’s protogenia only helped him to confirm what he already knew. It was unlikely he’d learn anything so, so instead he sought to see which of his soldiers would gain the most from the experience. To his surprise, the first one he felt undergo a shift was his chubby disciple, Tang Xiao. He was illuminated by the golden light of the Arhat, along with the rest of his brothers and sisters. However as the light spread over his body, a wide smile split his lips. His bulging belly quivered for a moment with his laughter, and then he went still as a statue. Another strange energy, separate from the others, flowed out of him. It mingled with the Arhat’s protogenia, moving with it. Tang Xiaos had clearly come to discover something. Generally it was said the earlier the quicker the epiphany, the better its results. It came almost immediately after interacting with the Taming Dragon Arhat. That meant Tang Xiao likely had some sort of affinity – what an excellent discovery! Several others discovered truths of their own a little while later. Adepts didn’t choose when or if they could learn from this, it was their Disciplines. Tang Xiao’s Discipline was metalmorphosis, but metal didn’t have a soul. The dharmic stateliness that he felt imbued his Discipline with a sense of spirit. He even felt it stir something deep within himself. The golden light persisted for fifteen minutes when suddenly the Arhat broke into joyous, ringing laughter. He lifts his arms to sky and spread them wide, whereupon the clouds split like he’d torn them asunder. Beams of beautiful sunlight tumbled from a clear sky. The Taming Dragon Arhat pulsed once again with golden light, so intense that the skies were tinted the same hue. From the street below people could hear Buddhist chants resuming. Each resonating note sounded like it was right beside them. Unconsciously, everyone folded their hands. Skyfire Avenue became a field of golden, meditating monks. IT was more comfortable than they could describe. The light of nirvana illuminates all things. The Pauper had succeeded in cementing his truth of the Taming Dragon Arhat. There was a flash of light, and the Pauper appeared among the others in the street. He pressed a hand to his chest and bowed respectfully to those gathered. “My deepest thanks, everyone.” “Hail, the Taming Dragon Arhat.” The Epochrion had descending to join him, and greeted the Pauper with an amicable smile and a nod. The Pauper’s new title was not in doubt. Taming Dragon Arhat – a mighty name, but achievements deserve merit. He chuckled and flicked his wrist. A ratty-looking fan appeared in his grip, which e flitted lazily from side to side. “It wasn’t easy! I have been waiting for a long, long while. I must thank the Jewelry Master, if he hadn’t taken me with him to seek out the gods of wine, I’m not sure I’d ever have taken this final step.” Lan Jue smiled pleasantly and walked over. “I guessed it was you. Congratulations, should I call you His Majesty the Pauper from now on?” This made the beggar laugh. “Whatever you like, it’s only a name. I have been cultivating since we returned and only just broke through. Ah, it’s unfortunate I wasn’t able to send the Clairvoyant off.” His moment caused everyone’s faces to fall in sadness. The Clairvoyant’s loss was still a sore wound for the Avenue. Lan Jue smiled and fought the depressed atmosphere. “The Clairvoyant spared no effort in his responsibilities for the Avenue. What’s most important is that we strive to keep his dream alive. Your Majesty Taming Dragon Arhat, I think that’s the most suitable name. You’ve been locked away for a long time, to you want to hear what you’ve missed?” The Pauper paused, but quickly recovered. “Indeed! I’d appreciate you filling me in.” “Of course,” Lan Jue assured. “Let’s head to my shop for a bit.” The Wine Master watched Lan Jue with a resigned expression. He knew what the Jewelry Master’s aim was, but he didn’t make any effort to get in his way. The Gourmet chimed in. “I’m going to continue my meditations, everyone.” The Keeper and Bookworm only shared a farewell before going their own way. They had borne witness to the ascension of the new Paragon, but now they had things to research and projects to complete. There was no one on the Avenue busier than those two. Other than Lan Jue and the few of his subordinates that weren’t present, the rest of Star Division was deep in meditation. A number of them would need time to fully comprehend what they learned. Very rare opportunities like this only granted a glimpse of the truth, but even a hint was enough to noticeably improve their Disciplines. No one wanted to leave before they squeezed every ounce of potential from the opportunity. Lan Jue brought the Pauper to Zeus’ Jewelry Shop. There, he told him all about what had transpired since the gods of wine. He left nothing out, especially the aliens and their newest discoveries. Zeus’ five Amazons were with the soldiers on the Avenue. They were also seeking inspiration. As a result, the store was abandoned but for them. Astonishment was evident in the Arhat’s eyes. When Lan Jue got to the part of his story where the planet Moonfiend was eaten, his scowl deepened. “I had no idea they were so strong. Luckily you all reacted quickly and got everyone out,” the Pauper said. A sigh heaved Lan Jue’s chest. “But I couldn’t convince the parliament. They have their own agenda, but for us the biggest problem is anticipating where these planets will show up next.” Note that this was Arhat of the Descending Dragon before. Apparently it already had a name, go figure. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-601","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai.","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
