{"id":56863,"no":641,"title":"Chapter 639: I’m Going Back","content":"\\n\\n Chapter 639: I’m Going Back\\n\\n \\n\\n “Quit your nonsense.” Chu Dong’s tone was harsh with the Gourmet. “If you really want to apologize go home and do it yourself. A heart-felt sorry is enough. Do you think he’s the same man as before? Did you witness him crying hi eyes out, twenty years ago? Then he was fine, until the day he heard you became a Paragon. I saw his eyes get moist when he heard your name; the Infernal Vanguard. In his own clumsy way he told us he was lost. And why not? He misses you, but he’s old and can’t say anything. He very loudly claimed he was going to come here himself to represent the Chu family at auction, but I forced him to stay behind. Won’t you give the man this little bit of pride in his old age?”\\n\\n The Gourmet was completely dumbfounded. The image of a powerful, dictatorial, stubborn man collapsed in his mind’s eye. In its place was an old man, pale faced and infirm.\\n\\n “I’m going back! When this auction is over, I’ll go back with you!” The words tumbled from his mouth. Seeing his brother and hearing his admonitions was too much to bear.\\n\\n Chu Dong silently nodded his head, and patted the Gourmet’s shoulder. “I have vital crystals to buy.” He turned away and began to walk toward Skyfire Museum.\\n\\n “Brother, wait a moment!” The Gourmet called out, trotting to catch up.\\n\\n “Hm?” Chu Dong turned back.\\n\\n “You don’t need to bid,” the Gourmet said. “I’ll think something up for the vital crystals.”\\n\\n A voiceless appreciation sparkled in Chu Dong’s eyes. After a moment he answered with a nod. “There’s a lot of politics surrounding this business, I’m anxious to broaden my knowledge of how these games are played. I’m confident we’ll be fine.”\\n\\n “Alright,” the Gourmet replied.\\n\\n Ordinarily Skyfire Avenue was a temple to silence, but today the walls rang with boisterous conversation. Standing at the front doors, security was being directed by none other than the head of Skyfire security, An Liu. Inside, security personal wandered the rooms with watchful eyes.\\n\\n An Liu was dressed in a bright silver flight suit, no different than any other day of work as far as she was concerned. Cold eyes scanned everyone who crossed her path. Guests required an invitation and a pat-down before they could come in.\\n\\n All three Alliances were represented by eighty four delegates. Only affluent Eastern families had come to participate, since the Eastern government had all the crystals it needed already.\\n\\n An Liu’s eyes suddenly narrowed, inexorably drawn to large figure coming her way. He had bright yellow hair, and was clad in white from his suit to his pocket kerchief. Handsome as he was, and with such a striking figure, he earned quite a lot of attention. However, An Liu was most interested in his eyes. They were deep, turbulent eyes that defied age. Wisps of power radiated from him that were hard to distinguish, but beneath them one could feel a vast tension.\\n\\n As the middle-aged man walked toward the museum, he stopped and lifted his head. As his peered upon the old structure, he looked almost disappointed. For a moment he stared, then approached the door and produced his invitation.\\n\\n “Hello, Sir Metatron. Please come in.” An Liu extended an arm, welcoming him in after looking over the man’s invitation.\\n\\n Indeed, this white-suited man – elegant and profound – was the Lord of Archangels for the Pontiff, Metatron. He was the manifestation of the Pontiff’s will, half a breath from Paragon himself. But that final breath had already eluded him for many years. The reason was simple; he’d used fantascia genetica. The decoction catapulted an Adept through the levels, but when they reached their peak it caused problems. For twenty years Metatron had struggled, but he was still no closer to a breakthrough.\\n\\n The Archangel smiled, and offered a polite nod. He was the perfect public face for the Pontiff’s Citadel. Since each organization was only permitted to send one inspector, they had to send their best.\\n\\n Another figure silently appeared before An Liu. Like Metatron, he bore a supernatural allure. In contrast, however, he was clad from head to toe in formal black attire. His short, dark red hair was a little disheveled, but it also added to his roguish charm. He had dark, sad eyes – fatally attractive to young women who were furtively stealing glances.\\n\\n “Your invitation?” An Liu calmly asked.\\n\\n A ly grin split the man’s face. “Can’t I come in without one? Maybe we could have a chat, discuss some way for me to find a way inside?”\\n\\n An Liu narrowed her eyes. This was the first person bold enough to step out of line. He was a man everyone knew by name and reputation.\\n\\n “Sir Lucifer, if you’re here representing the Dark Citadel then I ask that you produce your invitation.” An Liu’s voice was somewhat colder this time.\\n\\n Right on the heels of Metatron had come the Fallen Angel Lucifer.\\n\\n He looked the security officer up and down. “A dual-Disciple Adept hm? Unless I’m sensing this wrong, there is a little darkness in you… a rare elemental attribute, and pure. Would you have any interest in being my woman? You know we have many methods to extend a person’s life back at the Citadel, even without vital crystals. Train with me and you can be as strong as I in no time. Through your dark purity I can rise to Paragon, and when I do I can bring you with me.”\\n\\n An Liu glared at him with eyes sharp as icicles. “Not interested.”\\n\\n Lucifer might have been called the fallen angel, but he had more arrogance than any of the Archangels. A fervent look flickered passed his eyes. “Are you sure you won’t consider my offer? It’s a wonderful opportunity for you – think about it.”\\n\\n An Liu’s voice was low and even. “I said I am not interested. If you’d like to participate in the assessment then produce your invitation. Otherwise please leave, you’re blocking the way for those who were invited.”\\n\\n Lucifer regarded her with a lascivious smirk. “Very good, little girl. You’re the first woman to turn down my advances.” As he spoke, long spindly fingers plucked an invitation from his breast pocket. Lucifer handed it to her. His eyes – sparkling with Discipline – lazily dragged up and down her figure.\\n\\n “If you dare make a move, I’ll make sure ‘the Fallen Angel’ is erased from everyone’s memory.” A hard voice, full of violent promise, interrupted his leering.\\n\\n Lucifer froze. He couldn’t tell where the voice was coming from. Almost unconsciously his eyes snapped to a nearby figure.\\n\\n He was tall, lithe, and also dressed in black. However the stranger’s garb wasn’t a suit, but military attire. It was the uniform of a high-ranking Eastern officer, functional and made of the best materials. What struck Lucifer the most were the four golden stars pinned to the stranger’s lapel.\\n\\n Military insignias were more or less the same throughout the universe. Four stars – a general? Among the army’s highest command. For pilots they would call him an Admiral, but the meaning was the same. However, this man was far too young to be a general. That didn’t stop Lucifer from feeling a wave of fear from the man’s presence.\\n\\n Lucifer wasn’t any weaker than Metatron in regards to Discipline. He was considered lower in total power because the Archangel’s power naturally restricted darkness. If the two were involved in a fight to the death, it would be impossible to tell who would come out breathing. Both of them were the strongest Adepts could be before becoming Paragon, stagnant due to the same problem. They pushed themselves further than their potential, and now progress was almost impossible.\\n\\n Lucifer’s advantage lay in combat experience. In terms of ability and understanding of the Adept world, the Fallen Angel was in the top twenty in the whole universe. Even so, a single look at this army man filled him with dread. He could remember only a handful of time he’d felt this. Lately only the Pontiff scared him so.\\n\\n This stranger was like a beacon of holy light, so dazzling that Lucifer felt like his soul was burning. The indescribable discomfort filled him from head to toe. As an Adept of darkness, light was his greatest enemy. This man’s power seemed to be pure light.\\n\\n “Who are you?” Lucifer unconsciously staggered backward a step, closer to An Liu. If this man really did mean him harm, than relying on An Liu’s character as a guardian of the peace wasn’t a bad method.\\n\\n But he was wrong.\\n\\n Dizziness swept over him as Lucifer felt a crushing pressure descend. This must be what it felt like for a vampire to stand outside in midday, he thought. He tried to gather darkness like a shield around him, but the light burned it away. If he tried to move forward, the pressure only got stronger. Sometime in the midst of his trance, the man had taken up position between he and An Liu.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-639","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \\n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
