{"id":56897,"no":675,"title":"Chapter 673: The Investigation Begins","content":"\\n\\n Chapter 673: The Investigation Begins\\n\\n \\n\\n A typical interstellar fleet typical consisted of a capital ship, four to eight dreadnaughts, three to six expedition ships, a couple hundred battleships and countless patrol boats. Five fleets spread out across space in an impressive array like a deadly spearhead.\\n\\n Three of them – the Sixth, Eleventh and Thirteenth fleets – hugged close to Tyrannosaurus. They were the Bastion’s protection escort.\\n\\n The border of the Shattered Starfields loomed in the distance. It was marked by a veritable wall of asteroids so thick you couldn’t see between them. Tyrannosaurus’ main thrusters were cut, and a series of stabilizers hummed gently as it brought the massive ship to a halt.\\n\\n “Admiral. We’ve reached the target location. The First and Third fleets are coming into formation.” One of the ship’s staff made the report to Kang Hui.\\n\\n The admiral’s voice was steady. “Tell the Skyfire team it’s time to start the mission.”\\n\\n A few moments later a wall separated on the ship’s exterior. A humble blue ship separated itself from the lumbering behemoth and quietly slipped into space.\\n\\n Zeus-1 was roughly the size of a patrol ship. Next to Tyrannosaurus it was almost invisible, but it gave the countersign and lithely slipped through the forest of warships into the Starfields.\\n\\n Seated on the bridge, Ling Ya tried to look at everything at once. The interior was smaller than a typical patrol ship. There were installations that were clearly added in afterward to accommodate an unusually large crew.\\n\\n As she continued to examine the bridge she noted that the equipment was also entirely different than she might expect. Initially Ling Ya had looked down on the little blue boat, and in fact all of the East. She felt they were inferior in technology and capability. However upon entering Zeus-1 her preconceptions changed. Everything was state-of-the-art – in fact, there were a few pieces of equipment even Tyrannosaurus didn’t have.\\n\\n She was also surprised to discover there was someone aboard she hadn’t noticed before. How, when they’d scanned the ship so thoroughly before! Despite her prejudices, Zeus-1 had impressed her greatly.\\n\\n Lan Jue stood beside Su Xiaosu, who was guiding the ship. He was quietly watching the asteroids slip by. The Paragons were in the resting area. Currently the only ones on the bridge were Lan Jue, Xiaosu, Guoguo, Wu Qiu and Ling Ya herself. The Driver was cultivating in the resting area with the others. Part of his reason for coming was to continue training with Lan Jue, with the ultimate aim of completing his Discipline’s transformation. Once the process was complete he was on good footing to breakthrough to the Realm of Protogenia and could attempt it at his leisure.\\n\\n But the Driver heeded Lan Jue’s advice. He worked to suppress his abilities and delay his breakthrough. Now that his ascension was almost assured his goal had changed – simply becoming a Paragon wasn’t enough. He wanted to become even stronger, be a Reflection of Heaven and Earth. Maybe even achieve Nirvana.\\n\\n Ling Ya’s attention returned to Lan Jue. In his meticulously kept uniform, the young commander looked particularly elegant and dignified. He left quite the impression. There was a teasing light in his eyes when he smiled.\\n\\n Hmph! I’ll definitely show him when the fighting starts. We just need to find some aliens. We’ll see just how capable this guy really is, if he can even complete this mission.\\n\\n Zeus-1 sped up as it vanished into the tumbling rocks.\\n\\n Ling Ya continued to study Star Division’s commander. Wu Qiu’s attention, meanwhile, was on Su Xiaosu, primarily because he noticed she was the only one responsible for flying the ship. Obviously this was in part because of the ship’s advanced systems, however it spoke volumes to her skills as a pilot. She had to keep an eye on the overall situation, know the ship intimately, and possess a great deal of experience – a lack in one and she wouldn’t be able to do what she was doing. But she was so young, with a Discipline more suitable for fighting than flying.\\n\\n This made him very curious to know more about Su Xiaosu.\\n\\n The further they got into the dangerous Starfields, the more his respect for her increased. They swung between the asteroids like a swallow, never slowing down. It was a masterful dance from one potential disaster to another.\\n\\n As far as Wu Qiu was concerned, not a single pilot in Tyrannosaurus’ entourage could match her. Her reaction speed was too fast! Like the master butcher who never strikes bone. What skill! If she had joined the Northern army she would certainly have been one of their most preeminent pilots. And a ninth level Adept – what a woman!\\n\\n Wu Qiu also found himself stealing furtive glances of the woman seated in the captain’s chair, Lin Guoguo. She held herself with a regal bearing. She was beautiful, mysterious, and there was a deep intelligence in her eyes.\\n\\n She was snuggled into the chair with a novel in her hands – exceedingly laissez-faire.\\n\\n What an odd collection of people! One pilot, a hands-off commander, and a girl more interested in her story than the mission. Everyone else was just hanging around. However, Wu Qiu didn’t look down on them. He knew how to look at the big picture. Although they’d only witnessed Xiaosu’s strength, the enigmatic nature of the rest of them was telling and intriguing. They were certainly there for a reason, otherwise they wouldn’t have come along. Yet, he still didn’t even know who everyone was.\\n\\n Lan Jue wandered over toward Wu Qiu and took a seat behind him. A small smirk tugged at his lips. “We’ve entered into the outskirts of the Shattered Starfields, Secretary. We’ll reached the inner solar system in a couple of days. We may encounter aliens in transit, so it would be prudent for you to keep in contact with Tyrannosaurus.”\\n\\n Wu Qiu nodded. “You don’t need to worry, commander. Leave it to us.”\\n\\n They had joined the scouting crew with the North’s most advanced communications equipment. Although the Starfields’ magnetic field was strong, the devices and Tyrannosaurus’ own magnetic field would ensure information could be shared reliably.\\n\\n Ling Ya’s pretty eyes never left Lan Jue. “Commander, your team doesn’t appear to be treating this any differently from a normal scouting trip. If we do encounter aliens how do you expect to handle them?”\\n\\n “We’re just here to gather intelligence,” Lan Jue replied. “We’ll avoid them to the best of our ability, otherwise combat could draw more to us. Once we accomplish our task, we’ll return home immediately.”\\n\\n She continued her questioning. “You told Admiral Hui in your report that they search through psionic pulses, rendering Blinding Stones useless when you get too close. What guarantees do we have that we’ll be able to avoid them?”\\n\\n Lan Jue’s smile widened. “I’ve got to leave you with a little suspense. Watch closely, you’ll find out soon enough.”\\n\\n Ling Ya pursed her lips, but didn’t pursue it any further. But the look in her eyes made her displeasure clear.\\n\\n Their flight continued, fast but stable. The ship’s internal gravity dampeners made their trek comfortable despite the pitching and rolling. Lan Jue didn’t engage them in any further conversation ad was content to sit quietly, eyes closed, lost in his own thoughts.\\n\\n Six hours later he opened his eyes. A thoughtful looked crossed his face as he rose and walked over to Su Xiaosu.\\n\\n “Something feels off.” He muttered.\\n\\n Xiaosu nodded. “I sense it, too. We haven’t come across a single alien signature. Do you think they’ve left the Starfields?”\\n\\n “That was be the worst case scenario,” he replied darkly.\\n\\n Su Xiaosu also couldn’t help but frown. She knew what Lan Jue meant. The North had amassed enough firepower to destroy – or at least grievously wound – the alien forces. If the aliens were no longer here than the expedition was a monumental waste of time and resources. Uncertainty was the worst part of it, because if they weren’t here then where would they appear next?\\n\\n Ling Ya appeared at Lan Jue’s shoulder. “What is it? What’s happened?”\\n\\n Lan Jue’s voice was low. “Something strange. We should have encounter aliens by now.”\\n\\n “Could they have already left?” She asked.\\n\\n “That’s what we’re afraid of,” he answered.\\n\\n Ling Ya scowled. “So you’re saying they’ve teleported?”\\n\\n Lan Jue glanced at her. “I’m saying that’s a possibility. We suspect teleporting consumed a lot of energy but it’s been some time since we witnessed it. We can’t rule out the fact they might have already left. What’s more, we have been studying the aliens but I can assure you they’ve been studying us as well. It’s short-sighted to expect they didn’t notice all the commotion from the North. It can’t be dismissed that the fact you put this expedition together could be the reason they aren’t here.”\\n\\n Ling Ya seemed unconvinced. “This entire operation was kept secret. According to your last trip weren’t they were raiding for energy? They couldn’t have vanished so quickly. It takes time for their scouts to gather information, too!”\\n\\n “The fact is we still know frighteningly little about them,” Lan Jue countered. “We have no way of knowing how they share information, maybe even telepathically.”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-673","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \\n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
