{"id":56901,"no":679,"title":"Chapter 677: Infiltration","content":"\\n\\n Chapter 677: Infiltration\\n\\n \\n\\n Humanity\u0027s strongest army had arrived. Lan Jue could feel the formless pressure approaching from behind. They continued to patrol along the border of the asteroid field, orbiting the alien planet once every twenty minutes. If the planet was preparing to move they would know right away.\\n\\n All quiet! Even if the planet tried to flee it was already too late. After all, teleporting an entire star takes a lot of energy. It needed time to complete the process.\\n\\n Could they have underestimated the humans? Hope sprang up in Lan Jue\u0027s heart\\n\\n \"Boss, something\u0027s happening!\" Su Xiaosu pointed to their target and shouted in excitement. \"Nothing\u0027s leaving, just coming back. They know we\u0027re coming.\"\\n\\n Lan Jue looked at the screens and confirmed Su Xiaosu\u0027s report. All they saw where scores of beasts moving toward the planet from all direction and disappearing into the atmosphere. It was less a planet and more like a beehive.\\n\\n Anxiety gripped Lan Jue\u0027s heart. What were these monsters preparing to do?\\n\\n All of star division\u0027s members had gathered on the bridge, preparing for the operation to begin. The Wine Maker and Photographer were prepared to transfer them out at a moment\u0027s notice. They were about to witness a full-fledged intergalactic war. Even the shockwaves from their class were going to be earthshaking. It was best to keep their difference at not get involved.\\n\\n They sent everything - their observations and concerns - back to Tyrannosaurus with the latest scout report. Kang Hui told them to await further orders. It was expected that an operation this large was going to be discovered by the enemy before the attack began.\\n\\n \\n\\n ζ\\n\\n \\n\\n Tyrannosaurus barreled ahead. Its five-fleet entourage spread out behind and began clearing asteroids in their path with weapon fire. Battle was soon to ensue, so preparation was more important than conserving energy.\\n\\n \"Huh?\" Lan Jue\u0027s eyes popped open, wide with surprise. He could see things changing outside. The alien planet, large already, began to expand like a balloon.\\n\\n As it grew a part in the center began to collapse inward. The bigger it got the deeper the cavern became, and along with it came an imposing vacuum force.\\n\\n \"What is it doing?\" Wu Qiu gasped.\\n\\n Lan Jue\u0027s face fell as the possibilities dawned on him. \"It\u0027s the same thing that happened before the Seventh Fleet was destroyed. But this planet is much bigger... you should tell Tyrannosaurus.\"\\n\\n \"We can\u0027t! Communications have been cut!\" Ling Ya cried.\\n\\n Lan Jue felt his heart jump into his throat. Their communication equipment was strong - for it to fail now, this was no accident.\\n\\n \"Boss, the traction is too strong. We\u0027re being sucked in!\" Su Xiaosu\u0027s voice was urgent.\\n\\n Just as she warned, Zeus-1 and the asteroids around it began to tumble faster and faster to the rapidly expanding planet. The collapsed center was like a large black hole.\\n\\n It had known all along. It had known they were coming.\\n\\n The Wine Master and the Photographer looked at Lan Jue, awaiting his orders. They could leave at a moment\u0027s notice, teleporting to safety.\\n\\n Zeus-1 was picking up speed out of their control along with the kilotons of rock around them. Right now those asteroids were the main threat to their lives.\\n\\n A golden hue hung over the ship, a manifestation of the Pauper\u0027s power as he channeled it through Zeus-1. It protected them to some degree against the asteroids but they were insignificantly small by comparison. Against that enormous alien planet even a Paragon seemed impotently weak.\\n\\n Lan Jue snapped his head toward Wu Qiu. \"Secretary, we can\u0027t alert your superiors from here. Our only option is to flee and try to bring them what we learned. What are your thoughts?\"\\n\\n Wu Qiu gaped at him. \"Flee? How?!\" Zeus-1 was careening toward the planet and crashing asteroids were exploding all around them. Wu Qiu and Ling Ya both were pale as sheets.\\n\\n Lan Jue didn\u0027t wait. He called out the order. \"Do it!\" Only prompt decisions would free them from this situation.\\n\\n The Wine Master and Photographer released their respective powers, which flared dramatically around them. A strange, low chanting filled the bridge.\\n\\n Ling Ya and the Secretary felt everything change. Reality became surreal. An intense pain nearly sent them into convulsions.\\n\\n Thankfully the sensation lasted only a moment.\\n\\n Buzz-- Zeus-1 shuddered. The universe settled, and the familiar sights of their succor planet came into view. It had cost them, but the Paragons readily made the sacrifice to save their lives.\\n\\n Wu Qiu and Ling Ya still hadn\u0027t recovered.\\n\\n \"Secretary!\" Lan Jue unceremoniously smacked him in the forehead. A tremble wracked through him as he regained his composure.\\n\\n \"See if you can get ahold of Tyrannosaurus and let them know what we saw.\" He ordered.\\n\\n Wu Qiu glanced out the bridge’s windows. Everything seemed normal but for the fact that they were in an entirely different part of space. What… what’s going on, he pondered. How did they get away?\\n\\n His head was swimming with questions, but Wu Qiu was a professional soldier and secretary of combat. He snapped back to the present and immediately tried to get in contact with the Bastion ship.\\n\\n “Tyrannosaurus, Tyrannosaurus! This is Zeus-1. Respond!”\\n\\n “This is Tyrannosaurus.” Someone on the other end answered.\\n\\n Wu Qiu’s face lit up in relief. “The situation has changed. I need to speak with Admiral Kang immediately!”\\n\\n “This is Kang Hui!” The Admiral’s voice came on a few moments later. “What’s going on, why did you contact me?”\\n\\n Wu Qiu wasted no time explaining. “Admiral, something’s changed with the aliens. We experienced a strong disturbance that cut our communications. The planet had begun to expand and is drawing all the asteroids towards it. There’s some sort of black hole in the center of the planet, similar to what the Seventh Fleet encountered. You have to be careful.”\\n\\n “Where are you? Tell us everything.”\\n\\n Wu Qiu paused. Where? How should he know? He looked at Lan Jue for help.\\n\\n Lan Jue came to his rescue. “Admiral Kang, this is Lan Jue. The situation became dire and we were forced to teleport to safety. We currently cannot get close enough to continue surveillance. Please be cautious – the aliens have likely known for a long time that you were coming. I don’t know what they prepared but they’ve had ample time to do it.”\\n\\n Teleportation? Back on Tyrannosaurus Kang Hui was silent. What was happening? That tiny patrol boat could teleport?\\n\\n An ear-splitting alarm began to screech.\\n\\n “Attention all hands. Attention all hands! Enemies have invaded the ship, man defenses!” The digitized voice rang through the alert system. Kang Hui’s face fell, but he wasn’t alone. Lan Jue was just as disturbed.\\n\\n Aliens boarded the Bastion ship? How was this possible? Then it dawned on him. Lan Jue spoke urgently. “Admiral... admiral are you there?”\\n\\n Kang Hui responded with a strangely calm voice. “I’m here, what is it?”\\n\\n Lan Jue wasted no time. “Please confirm infiltration and let me know. I might know who it is.”\\n\\n It took only a moment for the admiral to return with more news. “It’s a violet figure. Too fast to see more clearly, but it’s strong. We’ve already lost one of our mecha pilots and it’s heading my way. Is it an alien?” Despite the danger, he maintained an eerie level of calm.\\n\\n Lan Jue heaved a sigh. One figure. It could be the Violet Princess… or the Violet Prince? The aliens had been ready for this. This was bad.\\n\\n He quickly gave his suggestion. “We’ll be there soon, admiral. Employ your strongest defenses to slow the invader down. He’s a humanoid alien as strong as the legendary Jue Di. You need to flee to safety and stop your advance immediately.”\\n\\n Lan Jue’s voice was more a command than a request. Tyrannosaurus was the heart of that attack group and the center of the operation. If something were to happen to Kang Hui they would be flying into an unmitigated catastrophe.\\n\\n “When will you arrive?” He asked.\\n\\n “Soon!” Lan Jue replied without hesitation. “Sir you need to make a decision!”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-677","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \\n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
