{"id":56921,"no":699,"title":"Chapter 697: End of the Expedition","content":"\n Chapter 697: End of the Expedition\n \n “Xiaosu, send our data to Tyrannosaurus. Ask if they need anything more from us.” The Wine Master, after thinking for a moment, spoke to the ship’s driver.\n She confirmed, then turned on the ship’s communications and did as instructed. The North’s equipment was top of the line, and they were connected immediately.\n “We’re sending the data,” Xiaosu said.\n “Did you get any feedback?” The Wine Master asked.\n Xiaosu stared at the screens. “Hold on, waiting for a response now. We’re pretty far away so the signal isn’t very clear.”\n She spoke again after a moment. “They want us to meet up with them as soon as possible.”\n “Got it.” The Wine Master’s mouth turned into a slight frown. He looked toward the Clockmaker. “So you think that if we go back, there’s a chance…”\n She smiled. “I’m not sure, but there is always a chance. The safest choice is not to go back. We’ve already completed our mission.”\n “Alright.” He understood her sentiment. Out in the Starfields, Zeus-1 didn’t have a way to communicate directly with Skyfire Avenue, and the loss of a single patrol boat during a massive alien battle was completely feasible. The North only needed to claim that was the case if their aims were less than wholesome. While the Wine Master thought well of Admiral Kang Hui, he wasn’t prepared to stake the lives of his companions on a feeling. Returning to Tyrannosaurus was risking more than he was comfortable with.\n \n ζ\n \n Tyrannosaurus-Class Bastion Ship\n “We’ve obtained the data. According to the starmaps we’ve received, the three planets have gathered at the former location of Moonfiend. They don’t appear to be giving chase.” Ling Ya read out the report.\n Kang Hui heaved a sigh of relief and leaned back against his chair, His frayed nerves could rest, at least a little. But there was also sadness; Holmen was dead, his ship destroyed and the one hundred thousand souls on board committed to the stars. First Fleet had also sacrificed itself for Tyrannosaurus’ safety. Heron did not escape unscathed, either. It was the greatest loss the North had suffered since humanity’s stellar migration. As the highest ranking military officer, everything that had happened was his responsibility.\n “Get in touch with headquarters and share the information with them.” Kang Hui sounded tired as he gave the order to Ling Ya, and shut his eyes.\n “Aye, aye!” She replied.\n “Admiral, you need to make up your mind.” Wu Qiu stood beside Kang Hui, speaking softly to him.\n Kang Hui’s eyes popped back open, and his response was thick with anger. “They are allies, not to mention I’d be dead without their help – this whole mission would have ended in worse disaster than it already is. You honestly want me to turn on them?”\n Wu Qiu sighed. “Yes, Skyfire Avenue has helped us greatly but their council chairman is on that ship, along with four other Paragons. There’s also commander Lan Jue, and if we can get them to defect or take them out of the equation the results would be catastrophic to the Avenue. According to our information, Lan Jue has been chosen as the Clairvoyant’s successor to lead and we have an opportunity that may never come again. Headquarters also didn’t make it clear…”\n Kang Hui’s breathing had quickened and his hands were clenched into fists. After a moment, though, they relaxed. “No! They may not be a group we like, but they are brothers in arms against the alien threat! Without them Tyrannosaurus would have ended up like Arachnid. I will not betray their aid with treachery, and you will never make another suggestion like it again. Do you understand!”\n Another sighed heaved Wu Qiu’s shoulders. “Admiral, we do as you order, but you put too much faith in friendship.” As he spoke the officer opened his hand and pressed down.\n Kang Hui, already exhausted and with his guard down, grunted. He collapsed on top of his desk.\n The admiral’s guards stared in shock, but were about to lunge at Wu Qiu when the secretary grunted. A powerful aura burst from him. Against an Avenue Paragon he didn’t amount to much, but aboard this ship he was the strongest Adept.\n “I am working in the Admiral’s best interest. After this expedition’s failure he will be court martialed. He will need something to show for it if he wants to evade charges. Little Ya, tell the Avenue scouts that we want them to return as quickly as possible, but we won’t wait long.”\n When Ling Ya looked at the secretary she saw the murderous light in his eyes. Her heart skipped a beat, and for a moment a handsome face flitted through her mind. She was conflicted, but her hands typed out what Wu Qiu demanded…\n \n ζ\n \n Zeus-1 quietly slipped through the darkness of space. While Lan Jue and the Driver cultivated, the Wine Master concealed the waves of protogenia from the ship with his own abilities. He was pleased with the Pharmacist’s breakthrough. The Avenue would have another Paragon, and one with robust combat ability. As an Adept she bore extraordinary strength, which would only increase as she deepened her understanding.\n \n ζ\n \n The explosive news spread across the human words like wildfire. The North had thrown themselves at the aliens in a full offensive, with three bastion ships and five fleets – yet still they’d lost. Arachnid was destroyed, Heron mangled, and although Tyrannosaurus had suffered no damage it’d returning with four fleets instead of five.\n Overnight, the alien planets became humanity’s new boogeymen.\n The Northern army gave Ying Tianlin the posthumous title of general. Holmen received no honors, but his family was generously compensated for their loss. Due to Kang Hui’s failed leadership which resulted in a devastating loss for the North, Kang Hui was awaiting removal from command. Meanwhile, humanity worried over its future. It was a constant point of discussion. When would the aliens arrive?\n On An Lun, Lan Qing quietly sat behind a screen. He silently reviewed all the data from the North’s expedition, though the most comprehensive intelligence had come from Star Division’s scouting team.\n His face was dark. Leathery hands clenched tight and released, again and again in a sign of his agitated state.\n The North was defeated! Humanity’s most powerful Alliance had failed. What’s more, the power they’d brought to bear against the aliens was equivalent to the East’s total military power.\n What’s more, according to Star Division the aliens hadn’t even used their full power. If this was the result at reduced power, what would happen when their foe no longer felt the need to hold back?\n Lan Qing had the same concerns as the civilian public. When were these aliens going to appear in their backyard? Where? They could teleport wherever they liked without any notice. They wouldn’t be able to muster forces fast enough if they didn’t know where their enemy would be. Wherever the planets appeared, humanity would lose at least one planet.\n “Sir, Skyfire Avenue on the line.” An officer quickly trotted over and delivered the news.\n “Connect them,” he answered calmly.\n A familiar face soon appeared on his screen.\n “Admiral Lan Qing.” The address was formal and polite.\n Lan Qing nodded. “What is it?”\n It was, of course, Lan Jue. “The Eastern lawmakers have passed a bill ordering people to evacuate to the largest planets. I wanted to ask what the plans were for An Lun. I’m not asking for any sensitive information, just trying to plan what’s next for Star Division.”\n Lan Qing’s face was a stone. “We’ll go where we’re needed.”\n This caused his brother to roll his eyes. “Perhaps something a little less vague? Humanity\u0027s only got about ten Bastions ready for battle, and although they were defeated the expedition did prove one thing. Bastions are how you fight those things.”\n Lan Qing replied in cool tones. “What we need to know is how often the alien planet can transfer. Perhaps you don’t understand that the only way to use the advantage of our Bastions is to surround the enemy. Right now we’ve been forced into a passive position while we wait for more information.”\n “I know,” Lan Jue replied. “That’s why I’m asking. I heard through the grapevine that you’ve already reorganized the troops after receiving the ships we won at auction. As I understand it you’ve got two fleets now. But the East is still weak, I think you need to let the army know we need to gather our forces.”\n Lan Qing frowned. “I don’t need you to tell me how to do my job. If there’s nothing else I have matters to attend to.”\n Lan Jue paused, struck by his brother’s foul mood. It was the first time he’d seen Lan Qing like this. “Brother…” he said.\n Lan Qing sat in silence for a moment, then visibly relaxed a little. “What?”\n “If I don’t came back from one of these trips, I need you to look after dad.”\n A hardness overcame Lan Qing’s face. “What are you thinking?”\n Lan Jue responded with a grin. “Nothing, I’m just saying. Don’t get emotional.”\n Lan Qing’s eyes were piercing as he stared at his younger brother on the screen. He knew Lan Jue better than anyone. He wouldn’t have said something like that unless there was a reason.\n “What are you planning?” He calmly asked.\n But Lan Jue just shook his head. “Nothing – alright, that’s all I needed. I’m off to cultivate.”\n The connection was cut, and for some reason Lan Qing felt even more unsettled than he had a moment ago. The look in his brother’s eyes seemed carefree, but he knew Lan Jue. When he got that look, it meant he was plotting.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-697","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
