{"id":56928,"no":706,"title":"Chapter 704: No Way","content":"\\n\\n Chapter 704: No Way\\n\\n \\n\\n “Do I know him?” Lan Jue asked his brother.\\n\\n “Figure it out yourself!” Lan Jue curtly replied.\\n\\n Lan Jue’s face stiffened. “I really don’t mind flipping off a fleet admiral.”\\n\\n “See if you keep your finger.” Lan Qing taunted.\\n\\n “Whatever.”\\n\\n The hotel’s lobby was small and simple. From the chipped floorboards to the stained counter and creaky stairs, the place looked like it’d seen better days. In truth Luo City was already a hundred years old, but this place seemed older.\\n\\n An elderly receptionist stood behind the counter. While the others waited, their taxi driver walked over to handle check-in. Lan Jue took the opportunity to look around.\\n\\n “This stuff looks like it’s half a century old,” Mika quipped. “Very Western. I can’t even tell when some of this stuff was made.”\\n\\n The taxi driver was back quickly, and heard Mika’s comment. “The owners are descended from Western royalty. Something in their past forced them to immigrate to the North. It’s always difficult to leave your homeland, so they brought their furnishings with them. Everything in this place are antiques and family heirlooms.\\n\\n Perhaps for the first time in history, Lan Qing had words of praise. “Very interesting place. It has heart.”\\n\\n The driver sniffed. “Up to your specifications, is it?”\\n\\n Everyone – Lan Jue included, gaped at the driver. Who was he that he could talk to Lan Qing that way?\\n\\n The Fleet Admiral scowled but didn’t say anything. He took the key he offered and disappeared upstairs to his room. Lan Jue and the ladies were six remaining – seven including Qianlin. That meant four rooms were needed. The Pharmacist had her own. Lan Qing, it would be assumed, also had his own quarters. However they watched the taxi driver walk up the stairs and follow.\\n\\n No way. Could this… was his brother coming out of the closet? No wonder he’d never had a girlfriend. If father knew, Lan Jue thought, he’d beat Lan Qing bloody. [1. Homosexuality is a strange thing in China. More and more it’s become accepted, but only begrudgingly. It still isn’t legal to marry someone of the same sex, nor is it permitted socially to make same-sex affections known. For example; my old boss is gay. It’s common knowledge, but he can’t go around sharing that with people – especially not his family. However, societal pressure demands that you marry as soon as possible. To get around this, he married a lesbian. They had the full ceremony, met the parents, had all the normal trappings – but they don’t live or even really speak with one another. She lives with her lover, while he lives with his. Once a year or so they get together to visit family for the holidays. This is so common that they have matchmaking business specifically geared toward matching gay and lesbian couples. They draft contracts and agreements about having children as well.]\\n\\n Lan Jue told the others to get settled. He headed for Lan Qing’s room. When he arrived the door was closed, but he simply opened it and walked inside. Lan Qing was standing by the window and the taxi driver was at his side. Both men were staring out onto the street.\\n\\n The room was as classically designed as the rest of the building, to the point where it felt like Lan Jue had stepped into the former era. It was strangely pleasant, a place where one could easily forget their worries.\\n\\n However, Lan Jue was too distracted to appreciate it. Lan Qing accosted him. “What are you doing here instead of resting in your room?”\\n\\n Of course Lan Jue couldn’t tell him what he was really doing – supervising. He tried to look nonchalant as he strolled over. “I just wanted to talk about the convention,” he lied.\\n\\n “The meeting is the day after tomorrow,” Lan Qing replied. “I have the invitation letters prepared, you just need to show up. There’s nothing to talk about.”\\n\\n “Oh,” he stalled. “So… you’re spending the night here alone eh? It’s a nice room!”\\n\\n Lan Qing finally turned around and looked at him. “Are you trying to say something?”\\n\\n Lan Jue flashed a quick glance toward the mysterious taxi driver at his brother’s side. “Nothing, nothing. I’m, ehm, a little hungry. How about we grab a bite?”\\n\\n The Eastern admiral scowled. “I’m not hungry, you go ahead. Why are you acting so strange…”\\n\\n He was struggling to find reasons to stick around, and with his options dwindling just blurt it out. “Brother, th-there’s just some things that aren’t appropriate. Think of father!”\\n\\n Lan Qing stared at him. “What inappropriate thing am I doing? Will you stop talking nonsense?”\\n\\n Lan Jue looked at him, then pointedly at the driver. He tried to make it clear what he was referring to.\\n\\n Lan Qing was indeed very smart. When he saw Lan Jue’s worried and accusatory expression a smile broke his cold façade. He turned his head away\\n\\n The taxi driver was less amused. He caught Lan Jue’s look at glowered at him. “What are you trying to say?”\\n\\n It was then Lan Jue heard it. Something wasn’t right – he sounded like a she!\\n\\n A woman?\\n\\n “I’m sorry – sorry! I didn’t mean anything.” Lan Jue stumbled over his own tongue. Good, he thought, at least she’s a woman. It didn’t matter his brother was chasing cougars.\\n\\n “I’m sorry to bother you two. Go on, don’t mind me, I’m leaving.” He left the room fast as he could.\\n\\n “Is there something wrong with your little brother’s head?” The taxi driver said in irritation. She picked off her hat and glasses to reveal a plain-looking man’s face. Her hands briefly covered the visage, and when they dropped the Astral Phantom’s bitter expression was revealed.\\n\\n He smirked at her. “He’s just being nosey, don’t take it seriously. We need to focus on this meeting, it’s important. Everything’s been arranged?”\\n\\n “Yes,” she answered flatly. There was absolutely no love lost between these two. Were it not for the mark on her soul, the Astral Phantom would have found a way to kill this irritating man a hundred thousand times. The bastard called her old! Women held grudges, especially against those who insulted their age. She wouldn’t soon forget his transgressions!\\n\\n “Then go rest. I won’t need you until it’s time to convene. Find us the day after tomorrow,” Lan Qing ordered.\\n\\n “Mnh.” She grunted her response, then left.\\n\\n Lan Qing allowed her disrespect. He didn’t need to dominate her, they had an agreement. Once the alien menace was dealt with she could go free, and that would be the end of it.\\n\\n Aliens… planets.\\n\\n Lan Qing’s heart sank. He’d gone over the North’s fight against the beasts a hundred times in his mind. He thought over and over about what he would have done differently.\\n\\n What he’d told Lan Jue was only one part. Fighting in the Starfields wouldn’t impeded a Bastion’s combat abilities too much, though it would make retreat and reinforcements difficult.\\n\\n The East’s Bastions were clearly inferior to the North’s. The East’s strongest ship was about equal to the fallen Arachnid. Tyrannosaurus was stronger than two of the East’s Bastions combined. If it came to war between the Alliances, he wasn’t sure who would win.\\n\\n Only through more information and deeper understanding would their chances improve. Lan Qing needed to push his people to be like Star Division, that would serve them well.\\n\\n Star Division would be integral in the coming fight.\\n\\n \\n\\n ζ\\n\\n \\n\\n When Lan Jue got back to his room, he couldn’t help but chuckle to himself. He really was a doomsayer! He retrieved a towel from Thor’s promise, then separated from Qianlin and wrapped her in it. He helped her put on some clothes.\\n\\n It was torture for him every time.\\n\\n The room was small, with only two single beds, a desk, and a single chair. Still Lan Jue liked it just fine. He was a fan of antiques. It wasn’t the Pharmacist’s Hall of Supreme Harmony, but it served.\\n\\n Lan Jue coaxed Qianlin to the center of the room and had her cultivate. Meanwhile he arose and headed to the room next door to visit with the newest addition to the Avenue’s Paragon roster.\\n\\n Knock-knock! He rapped his knuckles on her door.\\n\\n “Come.” The Pharmacist’s crystal-clear voice called from within. Lan Jue pushed his way in.\\n\\n The Pharmacist sat on the bed, looking out the window. It was one of the rare moments he didn’t catch her cultivating. It was dusk on Luo, and the sun’s golden light bathed her room in a soft glow. It was beautiful.\\n\\n He walked over to her. “Hey sis. Have you stabilized your powers?”\\n\\n She quietly nodded in response. “Not a problem.”\\n\\n “Sis… you know, you shouldn’t take it so hard. We can’t bring back what is lost, but no matter what happens I’m going to help you get that sword back.” His words were soft and sincere.\\n\\n She answered with a pained laugh. “Who’d have thought my husband’s death would inspire my pure murderous rage. It’s what allowed me to merge with Occisus. For years I waited, only to learn the worst. I just can’t hold myself back any more.”\\n\\n Anxiety crept into Lan Jue’s face. “Sister, don’t do anything hasty!”\\n\\n She shook her head, stood, and faced him. “If I go out one day and don’t come back, promise me you’ll look after Jun’er.”\\n\\n Lan Jue froze. “I- Listen to me, don’t be rash. Your husband’s gone but you knew that all along, didn’t you? You knew you were fooling yourself to think he’d magically come back after so long. He’s gone, but you are still here, and you have Jun’er to care for. That little one already has to suffer the loss of her father, you’d deny her a mother as well? I’m sure she knows I’m not her real father, and if something were to happen to you I’m not sure her little heart could take it. If you want to go hunting aliens, fine – but you’ve only got two choices. Go alone but kill me first, or take me with you. You won’t die alone.”\\n\\n Lan Jue’s face was hard and resolute. He never looked away.\\n\\n Water began to collect in the Pharmacist’s eyes, and she glared back with lips tight. “Why. Why do I have to suffer these disasters? Why was he chosen for that mission? All I ever wanted was to live happily with him and make a family! You know, I never went to see Jun’er after we went back to Skyfire. I was afraid I wouldn’t be able to control myself. She looks so much like her father…”\\n\\n She stopped, her voice choked with emotion.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-704","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \\n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
