{"id":56939,"no":717,"title":"Chapter 715: Majesty, Beware!","content":"Chapter 715: Majesty, Beware! It wasn’t power – it was the weapon. Inconceivably sharp! Even an Astrum couldn’t cut apart Domain like that! Once the surprise was passed the Terminator responded by pressing both hands downward. The corona of golden light around the dark orb turned blood red. His Domain expanded. The injection of growth and energy fought back against the flood of sword energy Qianlin had cast his way. Then Lan Jue’s sword strikes arrived. He first saw a red light, then felt it as a tug that threatened to pitch him forward. Like his own powers, Lan Jue’s sword had the power of traction. What was different was where the strike landed it left behind a gaping tear that acted like a rip in spacetime. That tear sat in the midst of the Terminator’s Domain, at its weakest point. It was quickly plugged by the Terminator’s overwhelming strength. However, before he knew it swipes from Qianlin’s sword burst through the former breach and wreaked chaos in his Domain like a tempest. Incredible! How are these young fighters so formidable? He was forced back a step, compelled to retreat as his Domain shrank. It was as though his Domain was trying to flee from those terrible swords. But Lan Jue wouldn’t be denied. He thrust a second time with Captus, but strangely the vortex it created was made where the sword waved. As Lan Jue moved so too did his weapon, expanding the scope of the vortex as he launched his attack on the Terminator. The myriad slices of Qianlin’s sword coalesced into a single flood. It swung wildly through the air until it centered toward the Terminator’s head. The unspoken cooperation between his two opponents was one thing, but what was truly frightening were those weapons. More specifically the power these mystical swords bore, for all protogenia seemed not to exist where they passed. It gave the Terminator pause, fearing real injury. He also held back for fear of hurting them. Staggering back another step, he had no recourse but to lash out with a punch. Qianlin nimbly leapt away like a fairy. Meanwhile, Lan Jue lashed out with Captus in a horizontal swipe to his side. The vortex created in its wake leached the Terminator’s force. But the Terminator was a Paragon, and the attack served only to slow the punch not stop it. Lan Jue traced out a circle. Where Captus flowed a shadow of its passage remained behind. When the Terminator’s fist passed through all of its strength was speed was bled away. With the Terminator caught, Qianlin chopped with her sword again, producing another flood of feral sword swipes that attack his body’s key areas. These two are hard to deal with! He thought. It seems I have no choice but to use some real power. He looked at the two with new eyes, realizing they were more of a threat than he originally anticipated. As far as he could sense, the two of them together were as strong as a first-degree Paragon. All at once the aura around the Terminator changed. The small pocket of his Domain swelled in response. For Lan Jue, he felt like the universe in front of his was collapsing into discord, and a terrible promise of obliteration washed over him. Pressure descending from where, threatening to crush the life out of him. Suddenly, he and Qianlin where in a black and empty void. Here they were specks of dust in an infinite expanse of nothing – except for a single, monumental comet that burned blood red. It was roaring through the darkness right for them, intent on destroying them outright. This was the real Domain of the Terminator, the Apocalyptic Comet. Suffocating pressure continued to pile on them from all directions. The Terminator had vanished, leaving Lan Jue and Qianlin’s swords to hit nothing but empty space. Domain was the greatest difference between an Adept and a Paragon. Lan Jue was not alarmed. Crystal blue light filled his eyes as he lifted Captus. It seemed as though his body swelled as his right hand lead Captus to cut through the blackness. Red light flickered as Captus carved out a swirling vortex. It dispersed through the black, clearly not enough to cut away the Paragon’s Domain. However, in the center of that disseminating vortex appeared a spark of purple light. The moment it appeared, the whole of the Apocalyptic Comet Domain seemed to shudder. Br-r-r-uummm--- Thunder rolled, issued from Lan Jue’s own body. As it radiated outward it cast the Domain into turmoil. “Ah?!” [2. Chinese onomatopoeias are very humorously expressive, the same with their grunts. For instance the word 嗯, ‘en’, is like a grunt. But the one by which you use it can mean all kinds of things. Pitch the tone upward and its shocked surprise. Higher pitched but consistent and it a challenging affirmation. Down and curt, simple affirmation, warble the tone up and down and it becomes a cutesy whine. My students used to love to have me practice my Chinese tones using 嗯. Here the Terminator is expressing surprise with 咦, ‘yi?!’ – which is not a sound you might imagine a herculean man would make.] The Terminator’s voice rippled through the area, but it was the blood comet that reacted. It swelled even larger, closing the distance between itself and its targets. A bolt of crystal blue lightning shot out and struck the comet’s surface. The world-ending orb slowed ever so slightly, but the lightning bolt was rapidly devoured by its destructive intent. However, a moment later the Terminator discovered that his two opponents were no longer within the scope of his Domain. Instead from the roiling borders of this Apocalypse two sword slashes [3. If some of these translations seem a little strange, it’s because TJSS is leaning very heavily on a concept we simply don’t have in English. You’ve seen it a million times in anime and Eastern fantasy media; someone swings a sword and a slash of energy is thrown out like Guile’s sonic boom (dating myself with that reference). They call it 剑芒 or 剑意which literally has no English equivalent that makes sense. If you’ve seen a good translation of this somewhere let me know and I’ll shamelessly steal it, because I hate that word so much you guys.]sword screamed his way. A golden force field appeared around him, but the swords were simply too sharp. They carved through his defenses and forced him to dodge. Lan Jue and Qianlin reappeared as the Terminator’s shield was cut away. “You’re able to escape my Domain?” The Terminator gasped in shock, but didn’t let up. He wailed at them with another full-armed punch. He held nothing back. Lan Jue never uttered a word. He moved with Captus in the Taiji sword style to deflect the Terminator’s blows. Although he was forced to retreat Lan Jue was able to avoid injury under his own power. Qianlin took advantage of the moment, employing the greatest utility of her ten-thousand swords as one technique. A hundred thousand diffused strikes covered the Terminator from all directions. The Terminator’s shock only grew with each passing moment. He couldn’t use his full power for fear he’d injure Lan Jue or Qianlin, but the two of them were a chore with their different but harmonious sword techniques. Lan Jue’s style was focused and forceful. Sometimes it surged like an unstoppable river headed for the ocean, sometimes so integrated he couldn’t find a gap. All the punches the Terminator threw at Lan Jue were dispersed and deflected. Incredible, considering the protogenia that filled every strike. By contrast, Qianlin’s style was elegant and almost gentle, but deceptively lethal. Infinitely variable and maddeningly pervasive, making the impossible possible. It was that variability that made her a threat. The two styles together made a marvelous – and dangerous – unified front. Without the use of his full power he wouldn’t be able to face up to the two of them. No wonder the Clairvoyant chose him to inherit the Avenue! The Terminator inwardly praised this young couple’s limitless potential. With these weapons in hand, they would become truly spectacular Paragons. Who knew how far that potential would bring them. No Northerner had the prospects they did. “Majesty, beware.” Lan Jue’s voice brought him back to the present. He froze and watched as Lan Jue and Qianlin reeled back, shoulder to shoulder. Lan Jue’s face hardened in concentration as the two of them thrust forward with their swords. The styles were the same, still focused flow and thousand swords as one. Only this time, it was completely different. Lan Jue’s eyes fell upon Qianlin, filled with love and affection. She looked back, and though hidden behind a fog there was the faintest light of infatuation in her gaze. Her face bore the faintest ghost of a smile. An incredible scene revealed itself. The light around Captus and Demortus flared, and the full force of the blades’ deadly intent pulsed out like a wave. The first thought that crossed the Terminator’s mind was that it was some kind of protogenia, a kind he’d never experienced before. What’s more, within it he felt a strange and inexplicable power. In this moment focused flow and ten-thousand swords became one. At some point even they couldn’t pinpoint, Lan Jue and Qianlin had joined together but their two weapons were still lashing out. Red and blue disappeared replaced with a pure aurora of light. It simultaneously flickered with all the colors of the rainbow, but strangely somehow was also formless and colorless. All of a sudden the Terminator felt like he stood on the cusp of disaster. What is this… Again he was shocked, and again he pressed down with his hands. The power around the dark comet expanded still further as he called upon his second phase, Bringing Quiet to the Universe. Still the vacuous power didn’t affect the sword’s power at all. The might they bore was created in the first moments of the universe, from the stuff that underpinned reality. Time, space, everything warped around the will of the godblades. Shields protecting the arena were shattered and the Terminator was flooded with the crushing sense of immanent destruction. The earth began to shake, rattling the secret arena and in fact the whole building. The roof exploded as the crystalline power soared toward the heavens. The earthshaking, dazzling power surged; red, orange, yellow, green, cyan, blue and purple flashed like a technicolored lightning storm. Among them and containing them were infinitely plain streaks of black and white. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-715","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai.","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
