{"id":56945,"no":723,"title":"Chapter 721: Better Than a Paragon","content":"\n Chapter 721: Better Than a Paragon\n \n Where Poseidon’s protogenia came in contact with Captus’ crimson power, it was either dispersed or devoured. Nothing could stop the spread of the terrifying red power.\n How!\n Disbelief was writ plain in Hua Li’s eyes. When did Lan Jue get so strong? Poseidon was a Paragon, and he a mere Adept! His powers had changed so drastically it was hard to fathom. It was restrained, profound, but also explosive.\n Lan Jue’s pace suddenly increased. He swung Captus in seven consecutive slashes that were absent the precision and delicacy of before. The red blade lashed with the speed and ferocity of lightning, leaving in its wake seven jagged streamers of light. They were red and blue, and inside twinkled a mysterious power that made them look like patches of a starry night sky.\n For Hua Li, it suddenly seemed like everything had gone dim. He felt surrounded and a moment later noticed those slashes had inexplicably appeared around him. They were on him before he could react, assailing him with tremendous pressure.\n Seven-Star Hammer! Another of the Nine Hammers of Taiji!\n Lan Jue’s sword, as an extension of himself, issued the doughty attack. Hua Li sensed reality around him threatening to collapse, swallowing his energy even before he had a chance to use it. The seven azure blue orbs of starry light closed in one him. Every one of them birthed a frightening surge of energy that he could feel in his very soul!\n This guy!\n Divine light sparkled in Hua Li’s eyes. His arm shot out abruptly, waving his trident through the air. Golden light gathered all around until it reached a critical mass, then surged out like a tsunami in all directions. An enormous figure appeared once more behind Hua Li – all the Poseidons of the past merged into one. With its appearance a sense of awe and fear pervaded.\n Boom--! The ensuing blast was a chaos of red, blue and gold. Their collision covered the arena in a sea of tumultuous power.\n Lan Qing, perhaps anticipating this, had appeared in the air overhead. His hands were pressing down and the image of Vairochana shimmered behind him. A waterfall of myriad colors suppressed the wild energies below from surging out of control. The arena had its own protections, but they’d seen how they could be overcome. Who knew what sort of tragedy this eruption would wreak on the planet if it were let loose.\n The seething torrent of power continued for a full minute before finally abating. When the dust settled Chu Cheng peered into the aftermath. He saw Lan Jue standing firm with the shimmering red sword in hand. Hua Li was a short distance away, with tousled hair and sporting tattered clothes.\n Both men were pale and drained, but it was clear Hua Li had come out the loser in their exchange.\n Chu Cheng rubbed his eyes in disbelief, then blinked and looked harder. The scene remained the same. It’d been real, all of it – the truth was irrefutable.\n Hua Li wasn’t any better. He swayed slightly on his feet, glaring at Lan Jue.\n “Round two?” Lan Jue smirked. Once again he lifted the Banishing Blade, and in response a brilliant blue light appeared from his chest. It grew and spread as the sound of crashing waves filled the air. But they were not waves, it was a world of electricity.\n Pure lightning element. The tide of power didn’t undulate or sizzle like lightning, instead calmly filling the space around him. Captus’ angry red light continued to paint the arena in its glow. Meanwhile, Lan Jue’s aura continued to rise.\n All of Lan Jue’s power coalesced into his focused flow sword technique. Once galvanized it would be fierce as a thunderbolt, steady as a landslide, and potent as supernova.\n Hua Li’s scowled and shouted. “Enough, no more! This is unfair!”\n Lan Jue chuckled. Captus dissolved into red light and vanished. “It’s one on one, how is this unfair?”\n Hua Li made no effort to hide his agitation. “There’s something you’re using that counteracts my protogenia. I could use none of the advantages of Paragon. My energy far outstrips yours but dissipated the moment it reaches you. Even if I was truly a Reflection of Heaven and Earth I couldn’t pierce your defense. How is this not cheating? His Majesty Jue Di must have given you something for you to be able to do this.”\n “You guess wrong,” Lan Jue explained. “It’s nothing Jue Di gave me – it’s my own Discipline.” As he spoke he lifted his hand, revealing an orb of purple lightning rotating in his palm. All-Heaven Lightning.\n After intense cultivation the inherently wild nature of All-Heaven lightning had been stripped. It was now calm and restrained. All the more frightening when it was unleashed.\n The final clash of their exchange – Lan Jue’s Seven Star Hammer and All-Heaven Lightning – had nearly routed Hua Li’s Divine Rite-empowered protogenia. It frightening him, and forced him to employ the full breadth of his power and protogenia to defend himself. Even then he had only just managed. If Lan Jue had been a true Paragon, even that likely would have failed.\n Hua Li stared at Lan Jue with a conflicted look. “It seems clear I won’t surpass you in my lifetime. If you’ve reached this level already, why delay your breakthrough?”\n Lan Jue smiled. “I’m waiting for her.”\n Hua Li paused. After a moment, though, he nodded. “I understand.”\n Lan Qing had returned to Chu Cheng’s side. His low, calm voice arose. “Our turn.”\n Chu Cheng answered with a nervous chuckle. “After watching that exchange I’m pretty lacking in confidence.”\n “Then I’ll beat some faith into you,” he answered.\n Chu Cheng then turned to Lan Jue and offered a sheepish and apologetic smile. “A-Jue, forget what I said earlier yeah? I’m on your side, always will be. Hua Li, the backstabber, he just wanted to bully you because you hadn’t broken through yet. But me? Thought never crossed my mind. In fact just the idea is despicable!”\n “I struggle to believe you have any moral integrity,” Hua Li snapped. “You think because I can’t beat him I can’t kick your ass?”\n Chu Cheng puffed out his chest. “Wait till I break through in a minute, then we’ll see if you’re as good as you think.”\n “Enough nonsense. Hurry up!” Lan Qing fixed him with an intolerant and irritated look. Then in a flash he was within the center of the arena.\n Lan Jue and Hua Li removed themselves to the outside borders of the arena. Hua Li poked him. “So what’s that Discipline called?”\n “All-Heaven Lightning,” he replied. “I borrowed the name from old legends. My thunderbolt powers were yang based. I evolved it with the help of yin-based lightning and a chunk of thunder essence I was lucky enough to come across. The result was what you experienced today. You shouldn’t feel discouraged, it’s no loss of face to lose to me.”\n “I didn’t lose! I was afraid to hurt you. If I’d have used my full strength I’d have taken you.” Hua Li muttered.\n Lan Jue chuckled but didn’t refute his claim.\n “You don’t believe me?” Hua Li shot his a glare.\n “Oh yeah. I believe you, I believe you.” His words assured Hua Li, but the look on his face betrayed how he really felt.\n Hua Li shot back indignantly. “My bloodline has the power to absorb the full force of the oceans. I become one with the inherent protogenia of the sea. It comes at a cost, but it also pushes me into a whole new level of power. You’re strong, but all your abilities are still just based in Discipline. Dispersing my protogenia was draining for you, too, and if I were stronger you wouldn’t be able to keep up.”\n Lan Jue was bemused by his friend’s competitive spirit. “Alright, enough. You win, alright?”\n Hua Li wanted to continue his gripe, but Lan Qing and Chu Cheng had already begun their contest.\n Lan Qing stood, still and silent. No echo of power radiated from him but none was needed. He bore himself like an indomitable force and his presence alone was subduing. Even Hua Li and Lan Jue on the far side of the arena could clearly sense it.\n One could imagine what Chu Cheng was feeling.\n His narrowed eyes overflowed with licking gray flames, and everything around him seemed drained of life and color. A pervading sense of death hung around him like a cloud. He was much stronger now than he had been during the Great Adept Tournament, that much was clear. The fires of hades danced around him like silken threads, thick with nuanced power. His control was absolute.\n Chu Cheng didn’t wait for his aura to reach full strength. In a flash his body disappeared into the void while Lan Qing was surrounded by macabre gray light. It was as though in a moment they’d been transported to the underworld.\n Just then, a translucent grey streak descended from above. It raced toward Lan Qing, nothing held back. The An Lun admiral was a Paragon, a Reflection of Heaven and Earth in fact, so Chu Cheng had to respond with unmitigated force. His first strike came from the ancestral weapon of his bloodline, Hades’ Falchion!\n When the Gourmet ascended to Paragon he forsook the name Hades, and instead took the title Infernal Vanguard. In part that was outside of his ability to choose since he didn’t bear Hades’ Falchion. He didn’t feel qualified to take the name and lead his family.\n Instead the weapon was bequeathed to Chu Cheng. It purified the deathly fires he commanded, increasing its strength and penetration. Just being in the falchion’s presence felt like it was devouring one’s soul.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-721","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
