{"id":56299,"no":77,"title":"Chapter 77: Planet of the Moonfiend","content":"\\n\\n Chapter 77: Planet of the Moonfiend\\n\\n \\n\\n Lan Jue’s brows narrowed, and the expression on his face grew dark.\\n\\n Once they’d adopted the colors, emblem and countersigns of the local pirates they’d encountered no further troubles. Zeus-1 deftly maneuvered between the racing asteroids as they hurtled through the dangerous region.\\n\\n However, after three days, the small planet that was their objective still hadn’t revealed itself.\\n\\n Here, everything but the stars and a few select planets moved in irregular orbits. Asteroids, planets, moons – everything changed. As a result, whether you were pirate or pioneer, you always needed the latest star maps to find your destination. And to find them, you needed to visit one of the steadily orbiting giants – except that they were pirate havens.\\n\\n “We need to make our way to Moonfiend. It looks like we’ll need to get ourselves an updated star map,” Lan Jue commanded.\\n\\n “Yes, boss.”\\n\\n Planet Moonfied, largest of the static planets residing in the Shattered Starfields. It’s name had changed more times than anyone could remember. Perpetually in flux, the planet changed ownership whenever there was a power adjustment in the region. Whatever pirate clan emerged as the largest, took the planet for their own and invariable gave it their own name. The planet itself remained as it always had, regardless of name – quietly orbiting around Beelzebub, the Starfield’s largest star situated at it’s heart.\\n\\n A day on Moonfiend was thirty-six hours; a year, four hundred and twenty eight days. Significantly different than Planet Skyfire, to be sure. But the climate was suitable, and it had three times the surface area of Skyfire.\\n\\n The Shattered Starfields had three stable-orbit planets hidden within the shifting bands of asteroids. Moonfiend, while the largest, was only one. The other two were known as Nefarius and Diablus. Their names never changed.\\n\\n Looking down upon Moonfiend from the vacuum of space, it was difficult to imagine it was home to a ruthless pirate clan. Fifty percent of it’s surface was a clear, crystal blue. The remainder was verdant green landscapes.\\n\\n Zeus-1 slowly made it’s way to the massive docking port and came to a stop. After a few moments, Lan Jue exited, cigar chomped between his teeth and hands stuffed in the pockets of his windbreaker. Mika, Lin Guoguo and Ke’er were at his heels.\\n\\n The Accountant had chosen to remain behind, immersed as he was with his work on the ship’s systems. Xiuxiu stayed as commanding officer in Lan Jue’s absence.\\n\\n “So where we going, boss,” Mika asked.\\n\\n The three women had already changed clothes, and no longer sported the revealing flight suits. Mika had chosen a white blouse, black coat and a black short skirt. Paired with her black-rimmed glasses, high heels and fiery red hair she looked like an intimidating business woman. Or a sexy secretary.\\n\\n Ke’er had slipped in to a pair of white suit pants, peach high heels and a white jacket. She looked erudite with her pantsuit and bob-cut blue hair.\\n\\n Lin Guoguo was dressed similarly to her sister amazon, changing out the pants for a long skirt. As they trailed behind Lan Jue away from the hangar they were the focus of many a wandering eye. Although it was a pirate haven, none dared to approach the women despite their beauty. After all, women were pirates, too.\\n\\n The Moonfiend pirate clan had been in control of the planet for ten years. They were now well established as the rulers of the area. The result was actually a planet enjoying prosperity and safety. Of course, there were always the seedier parts of town, but those were generally easy to recognize and avoid. The Moonfiends had put a great deal of effort in to establishing a sense of order and propriety. This was in part due to their secret trade deals with the three alliances, which afforded them both the strength to fight off contenders and the funds to keep their populace content.\\n\\n “It’s been a long time since I’ve seen Little Yue,” Lan Jue said, “We’ll visit her first and see if we can’t procure a star map.”\\n\\n Mika swept her eyes over to Lan Jue, but said nothing. Lin Guoguo took a step closer and giggled. “Boss, so arrogant! Waltzing directly up to the Moonfiend Empress!”\\n\\n Ke’er nodded her head and huffed in serious tones. “Don’t worry boss, we’ll protect you.”\\n\\n “He grinned. “What, you think she could take me in a fight?”\\n\\n Ke’er gave him a sideways glance. “I was talking about your chastity.”\\n\\n Lan Jue tripped on his own feet and almost topped to the ground. The three women behind him erupted in laughter.\\n\\n “These girls…! I oughta fire them… fire them, I say!” Lan Jue’s face was red, either from anger or shame. It was hard to determine the root cause.\\n\\n Mika squared her shoulders, her voice clear and righteous. “Boss, we’re only doing what’s best for you. The fact that the Empress has coveted you for some time isn’t lost on us.”\\n\\n Lan Jue rolled his eyes. “Get a car.”\\n\\n Mika huffed in response. “So ashamed he’s gone all pissy. Fine, getting a car.”\\n\\n \\n\\n ζ\\n\\n \\n\\n The Moonfiend Palace. Where the Moonfiend Pirates handled their affairs, and home to the Moonfiend Empress.\\n\\n The Palace area was like a small city. It was shaped like a crescent moon. The sole city on the entire planet, and as hard as it was to believe that was the simple fact. It was, in all actuality, the fifth largest city by acreage, even compared to the cities in the alliances.\\n\\n Overhead, scores of verti-cars shuttled back and forth among the skyscrapers.\\n\\n Lin Guoguo whistled appreciably. “Crescent City’s sure changed. Just a few years and it’s like any modern metropolis. The Empress really is something.”\\n\\n Mika scowled. “I don’t see how. Too much power and expansion, and the three alliances wont have any choice but to come cracking down on them. What this is, is suicide.”\\n\\n Lan Jue narrowed his eyes at her words. “Little Yue’s always been a prideful one, never wanting to back down. I think you’re right, I should say something to her.”\\n\\n It would be troublesome for the three alliances to come after the pirates, true. However, only the foolish and prideful forget the sheer number of Adepts the Alliances commanded. If it came down to it, if the three alliances decided the pirates had to go, it wouldn’t take much for them to make it a reality.\\n\\n An hour’s time in a verti-car got them within sight of the Palace. It was like an ancient city, with white parapets and a spindly white tower in it’s center. It was there the Empress called home.\\n\\n As the verti-car reached the border of the Crescent City, it was compelled to come to a stop. It make it’s way to ground and delivered it’s passengers. Here, only mag-lev cars were permitted. Veri-cars, mechas and others like them were banned from use.\\n\\n “Present your com’s code for scanning.” A man in a cyan hood blocked further passage.\\n\\n Lan Jue produced a silver card in response. As the guard held his scanner up to the piece of metal a light issued forth and ran over it’s length. Moments later, a sharp beep, beep, beep rang from it.\\n\\n “Coms code expired!” The Cyan-hooded man lifted his head, and the look in his eyes grew hard. The light and angle finally conspired to reveal his face, a hodge-podge thing half composed of metal. His right eye, itself some mechanical construction, glowed a menacing red.\\n\\n In the blink of an eye a dozen more hooded men appeared. They brandished their weapons at the small group.\\n\\n “Expired?” Lan Jue looked at the card in his hand as though he were confused. After all, Zeus-1’s coms code had been fine – but, this was a card for the Crescent City.\\n\\n Eventually his face betrayed a bitter smile, and he could only shake his head. “I guess it’s been too long since I’ve been out.”\\n\\n “Hands above your head, and get on the ground! Any resistance will be met with lethal force!” The humming laser rifles were leveled at Lan Jue and his cohorts.\\n\\n Mika, Lin Guoguo and Ke’er moved like a trio of lionesses, pulling Lan Jue in their midst to face the guns themselves.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-77","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \\n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
