{"id":57015,"no":793,"title":"Chapter 791: Defeat","content":"\\n\\n Chapter 791: Defeat\\n\\n \\n\\n After sitting in stillness for over five minutes, Middle Heaven began to move again. It chased after its own armada in pursuit of the enemy, back toward Angel.\\n\\n Solar Flare was a strong attack, but it had its drawbacks. The heat it produced was so intense all of the ship’s systems overheated after use. The ship needed at least five minutes to cool off and come back online. This was only possible because of An Lun’s rocky surface which acted as a heat shield. Without it the situation would be worse for the Bastion. Middle Heaven would have needed over an hour to let the heat radiate off. Right now Solar Flare could only be used three times in a day to ensure it didn’t damage important systems.\\n\\n Poseidon’s Soft Water Bombs bore similar restrictions, they cost the ship a lot of energy to produce. The ship even had a specialized area where volleys were made and prepared, but even then they could only be used three times. Afterwards they needed three days to replenish energy stores and prepare another battery. The problem lay in soft water’s inability to be stored. It had to be used in a short time because there was no way to contain it safely.\\n\\n In this way the balance was maintained; the stronger something was, the more serious its consequences or challenges. It was the same for universal protogenia.\\n\\n The aliens fled quickly and with wild abandon. They made the wise decision to try and spread out and run in all directions from the danger. The human pursuers could only clip off the stragglers, leaving the bulk of the alien force free to make their escape.\\n\\n Still, humans made gains at their enemy’s expense. The value of the vital crystals they harvested was hard to measure. They simultaneously shot down the fleeing beasts and took their precious crystals, for the future betterment of their species.\\n\\n Once the fight was finished the crystals would be divvied up among the three factions that had participated. How, precisely, had yet to be discussed but it all hinged on surviving the encounter.\\n\\n \\n\\n ζ\\n\\n \\n\\n A dim light brightened the sky, and Lan Jue lifted his eyes to observe. They could not know the state of the battle from their vantage on Angel, but there were clues that alluded to Middle Heaven’s Solar Flare. It certainly wasn’t normal for half the sky to suddenly light up like the birth of a new sun.\\n\\n Extensive tracts of the planet’s surface had already recovered from the progenitor’s poison touch. The release of vital energy from the creature’s destruction had reinvigorated it. The Paragons all gathered together. No aliens remained nearby, frightened away by what they’d witnessed.\\n\\n The cloud that looked so much like Tribulation Lightning had filled their enemies to the bone with terror. Just the presence of it conjured images of their bodies being turned to smoke and ash, and inspired them to run for their lives. Even Monarch’s avatar wasn’t spared.\\n\\n “I wonder what’s going on up there.” The Pharmacist said in curiosity. There was still a long way to go before a final human victory, and they couldn’t know what was happening on all fronts.\\n\\n Lan Jue grinned. “Don’t worry, I trust that guy. He’s always got an ace up his sleeve. If we really didn’t have a chance he wouldn’t have brought us into this fight. Anyway, on with the plan.”\\n\\n Now that the progenitor had been taken care of, they were responsible for helping the ground assault team take Angel and save the survivors. This included the humans that had already been turned, so that they could be brought to Middle Heaven for treatment.\\n\\n The first part of their mission was done, and as of yet they hadn’t been met with a large number of alien forces. This hinted that the battle out in space was still being fiercely waged, that humanity was holding its own.\\n\\n Luo Xianni spoke up. “Let’s go take a look. I’m sensing powerful waves of energy, and that means there’s a strong enemy nearby. I’ve checked and I can’t get any communications through, the interference is too great.”\\n\\n As one they shot into the air, high above the ground so that they might get a clearer picture. From their vantage it was even more evident how quickly Angel was recovery. It virtually glowed with life. What was more surprising to the humans, however, was the lack of an alien presence even from their overwatch position. They were gone entirely.\\n\\n “It looks like those beasts are really scared of you!” The Pauper said with a chuckle.\\n\\n “No,” Lan Jue replied, “they’re afraid of the cloud. It’s gone but none of them are interested in making sure. Unless I’m mistaken, our armada is also on a winning footing.”\\n\\n The Pharmacist’s heart raced. “I’ll go take a look and confirm.” There was no fighting on the planet’s surface for them to concern themselves about. Strong as they were, Paragons weren’t best suited for gathering up survivors. They had the ground team for that.\\n\\n The turn-around on Angel was faster than any of them would have anticipated. No enemies remained to contest their control of the planet. Where they fled to, though, no one could say.\\n\\n “Don’t engage them yourself, and be careful on the Monarch’s doppelganger,” Lan Jue reminded her.\\n\\n “Let’s wait for the ground team. If they get here soon it means we’ve taken this sector. If not, then there’s been some kind of problem. We should be ready to go in either event.” Lan Jue decided.\\n\\n As much as he wanted to help save lives, he and his team were the core of humanity’s strength against the aliens. They had to keep up the pressure in order to win. Saving their strength and directing it wisely was more important that gathering survivors. They could protect more lives that way.\\n\\n Just then, the communicator on Lan Jue’s wrist buzzed. He answered the call.\\n\\n “The alien forces have been routed. The ground assault team will be arriving in ten minutes, prepare to join up with them. Once the planet is secure, continue with your mission.” Lan Qing’s voice was cold and even as ever, as though their victory was insignificant. But even his brother’s simple report caused Lan Jue’s spirits to soar. The faces of the Paragons around him lit up.\\n\\n Lan Qing went on. “Jun’er has confirmed that Angel is in no danger of exploding. The Terminator has also led his team to their destination and Zeus-1 is landing as we speak. Father’s situation is as yet unclear.”\\n\\n “Alright, got it.” Lan Jue answered, in the same sparring manner.\\n\\n He hung up and pumped his fist. The others grinned and chuckled, pleased with their initial victory.\\n\\n “Winning any ground against these monsters is no easy feat!” Luo Xianni remarked. Lan Qing’s words may have been calculating and simple, but the fact of the matter was that this had been humanity’s greatest victory against their attackers to date.\\n\\n The bulk of the aliens’ forces had gathered here to deter the human armada. They had to be dealt with before Angel could be retaken, and at present it seems like that’s precisely what Lan Qing had achieved. If this didn’t bring joy to the human fighters, what would?\\n\\n “I don’t know how he did it.” Lan Jue sighed in relief. His brother hadn’t shared all the details of his plan with him, so he wasn’t sure what had happened while they were dealing with the progenitor.\\n\\n \\n\\n ζ\\n\\n \\n\\n Tyrannosaurus-Class Bastion.\\n\\n Admiral Kang Hui’s face was a sea of emotion. This was an incredible victory! When he saw the aliens turn and flee, his legendary calm broke and he roared in triumph. They had been waiting for a victory like this for a long, long time. A series of painful lessons had put humanity against the ropes, but now they were fighting back.\\n\\n Tyrannosaurus presence here was in defiance of the people’s wishes and without government support. Northern citizens demanded to be protected, ignorant of the fact that they were simply waiting to die.\\n\\n They’d risked much to disobey the government and the people, but Tyrannosaurus and the Terminator had come to see this situation realized. \\n\\n Lan Qing had demanded all information regarding their bastions from Kang Hui and Hua Li while making his plans. In truth Kang Hui had hesitated – after all, this wasn’t just asking for secrets of their strongest weapon, it could reveal much about the North’s construction and research processes. After discussing it with the Terminator, they conceded to Lan Qing’s requirement.\\n\\n Then Prometheus made his plans.\\n\\n Only Lan Qing, Hua Li and Kang Hui knew the full scope of their battle plan. They had been aware from the opening salvo, to drawing the enemy out, up to the sudden counter strike. All the while Lan Qing was the invisible hand that moved pieces across the board at just the right moment.\\n\\n Kang Hui considered himself a first-class commander. However, in the face of Lan Qing’s victory he felt small and ineffectual. The An Lun super soldier, God of Wisdom, led his troops with the skill and finesse of an orchestra conductor. He was in complete control of every aspect of the fight, and they won with strength to spare.\\n\\n He thought back to Middle Heaven’s omnidirectional blast, like the sudden birth of a small sun in the midst of the enemy forces. His soldiers had followed Lan Qing’s instruction and shielded their eyes, but not Kang Hui. The admiral’s Discipline lived in his eyes, he could modulate the effect of light on his cornea. He had stared in awe as Middle Heaven seared a path through the enemy – an attack on a planetary scale! That was the moment the tides changed in their favor.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-791","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai. \\n","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
