{"id":57038,"no":816,"title":"Chapter 814: Action","content":"Chapter 814: Action What Lan Jue didn’t know, was that his suggestion to Lan Qing instantly had the support of all the unit leaders. Not a single member of Star Division protested. Normal people were frightened of the aliens, but that was never a sensation that crossed a Division soldier’s mind. In all the encounters they had with these beasts, they’d never been defeated. On the contrary, every fight had ended in total victory. In addition they had many Paragons at their backs in case things got out of hand. As far as they were concerned, any risk was worth the reward. Not to mention these men and women had been training for this fight for a long time. They were only too anxious to have something to show for it. Their eagerness pleased Lan Jue. After speaking with Lan Qing it was decided that the Paragons would lead his troops into battle. They would be dispatched in smaller units as they had always been, and their efficacy evaluated in this new battleground. Their loadouts would be adjusted accordingly. Star Division was raucous in their excited preparations. Meanwhile Lan Jue quietly left Middle Heaven to begin his scouting mission. Lan Jue’s plans were not the same as Lan Qing expected. His present self could not be compared to the past, for now he was a true Paragon. Some of the Paragons still needed to be acclimated to working Star Division, so he wished to bring only four others with him. Nor would they take Zeus-1. With nothing but the clothes on their back, they would fly through the vacuum of space toward Europa. Aside from Lan Jue and Qianlin, the other two participants were the Pharmacist and Luo Xianni. Lan Qing was too busy with his other duties to follow the state of Adepts closely. Luo Xianni had broken through to the Infinite, and her interdimensional abilities were nothing short of legendary. At full strength she could spirit them away, even if the alien home worlds themselves appeared. For a scouting mission who could compare to the might of the Photographer! But Lan Qing didn’t ask her directly for a reason. Now that she was part of the Infinite she had to be careful. After all, she had begun to come under scrutiny from universal protogenia. But with Qianlin in attendance she could use her powers without reservation. In the end, after discussing everything with Lan Qing, they agreed on the small team. Three Banishing Blades and a near god-like Paragon were enough to deal with most problems they were likely to face. As for Jue Di, he was currently absorbing the power from the doppelganger’s crystal to extend his own life. He would lend his full strength to the final battle. A pale white light hung over the four infiltrators as they began their journey. Under the Queen of Heaven’s power they didn’t even need to breathe. Cosmic radiation was absorbed and transformed to sustenance to keep the small group healthy. Exhaustion wasn’t a concern for Zhou Qianlin. After three days of isolation she and Lan Jue had emerged with a new and deeper understanding of their powers. Qianlin was also able to exert some measure of control over her cultivation, though of course this was only temporary. The power of faith was always flowing through her, empowering Guanyin. In fact, because of the surplus it was to her benefit that she use as much energy as she could. Not only did it bleed away the excess but it also made it easier to control her rate of cultivation. Rising too quickly was counterintuitive, so it was better to delay as long as possible. Meanwhile the energies derived from Qianlin also benefited Lan Jue. They fed his own cultivation, vicariously through the faith in Guanyin, and pushed him closer to the upper border of Reflection of Heaven and Earth. The vastness of space stretched out before them. Swaths of glittering starlight twinkled at them from the far reaches of the galaxy in a beautiful display. Lan Jue couldn’t remember how many times he’d seen scenes such as these, but somehow this time it felt different. After inheriting the wisdom of the Emperor of the North Star these distant lights seemed like a part of him. With every breath he drew in their essence, becoming one with the stellar cavalcade. The power of the Middle Heaven Emperor of the North Pole Star of Purple Subtlety was as vast as the cosmos. After three days Lan Jue was only just peeking behind the curtain. But even just this preliminary understanding aided him greatly, guiding him to a new heights. The Pharmacist, flying by their side, looked at Lan Jue from time to time. Her younger brother had become quite a presence! After becoming a Paragon his every move bore a mysterious impact. It wasn’t strong, but it was enough that she couldn’t help but hold this younger man in high respect. She’d never experienced anything like it before. In her heart there was little that could compare to Occisus and the power it bore. However, she couldn’t forget witnessing Lan Jue’s breakthrough. She could still see the image of the Emperor of the North Star with Captus in hand as though it had just happened. The blaze of light from Lan Jue’s godblade was overwhelming, a sign of allegiance to the might of Lan Jue’s dharma. The Emperor of the North Star was not inferior in any way to the earlier master of the Banishing Blades, Celestial Master Lingbao. They were cut from the same cloth! [1] If Lan Jue could truly master his inheritance, his future prospects were bright indeed. “What are you plans, Jewelry Master?” The Pharmacist couldn’t help but ask, now that her mind was on what was to come. This gave him pause. “Plans? To kill the aliens, obviously.” The Pharmacist chuckled. “I mean for the future. After these monsters are dealt with.” He cast her a curious look. “Sister, don’t be anxious. We will certainly survive this!” “I’ll admit I used to be worried,” she revealed. “But not anymore, not after watching your breakthrough. Even if we’re somehow defeated I don’t think it will mean the end of humanity. After all, we’ve been masters of this corner of the universe for ages. No matter how powerful the aliens become, they can’t track us all down. So long as there are survivors we have the opportunity to retake our rightful place. But more importantly we have you. Once you grasped the inherited knowledge of the Emperor, that was the moment we became invincible.” Lan Jue paused, then chuckled with a wry smirk. “I’ve only grasped a shadow of what the Emperor of the North Star commanded. The difference is astronomical.” She chuckled politely. “You shouldn’t underestimate yourself. The fragments of the Emperor you gathered the day you broke through was no ‘shadow.’ That was a part of his eternal spirit, a living part of our history. There has never been anything like what you achieved in all of history. You must understand that if you continue to walk the path, one day you will be the next Emperor of the North Star. Then the alien planets would be beneath contempt, hardly worth notice. This caused Lan Jue to chortle. “You overestimate me, sister. Even if I did have that sort of potential, universal protogenia would never allow it. I wouldn’t be able to hide that sort of power from the cosmos.” But Luo Xianni answered him with a derisive snort. “Why not? I won’t pretend rising to such a height would be easy, but for you it certainly isn’t impossible. You have your wonderful wife to thank for that! Her Queen of Heaven Domain can go a long way in protecting you. All you need to do is live, and through your Boundless Starlight Domain you can continue to grow strong. Do that and one day you will achieve what she says, then even creating your own immortal realm wouldn’t be outside the realm of possibility. They did it before, why can’t it happen again?” Luo Xianni’s assurances struck a chord in Lan Jue. If current trends persisted he and Qianlin had a very good shot at achieving the Infinite, and evading the universal protogenia that would come seeking them. But if there really was a path to immortality the benefits to humanity’s Paragons went without saying. Mankind would be masters of the universe, and if another threat like these monsters should appear the immortals would need only wipe them from existence. Of course creating an entirely new reality was easier said than done! Lan Jue shook his head. “A story for another time, mother. We can discuss the possibilities later, but for now our focus has to be overcoming the alien threat.” Luo Xianni smirked at him. “Who’s to say this is another story? Your father is already considering the opportunities. You and your brother are growing quickly, it won’t be long before you meet us in the Infinite. None of us have experience in molding reality, but that’s not to say it’s impossible.” Her face revealed an inscrutable and enigmatic expression. Lan Jue gaped at her. “Are you telling me father has an idea?” She snickered. “Why did the aliens choose us to attack? Because there’s something in our DNA they need to evolve, right? Their ‘evolution’ is just an equivalent to the power our species used long ago to create the immortal realm. But if we can’t do it, how can they? Because they know something we don’t – but it’s something we can learn and emulate. Yes these beasts have been a disaster for our species, but they also pose an opportunity. Let’s see if it’s an opportunity we’re able to grasp.” According to what I’ve been able to learn about the Taoist pantheon this is categorically false. The Three Pure Ones (of which Lingbao is one) were the penultimate masters of the universe, subordinate only to the Tao itself. The Four Divine Minsters (including the Emperor of the North Star) were attendants to the Pure Ones, themselves led by the Jade Emperor. EotNS is like on the third rung. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-814","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai.","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
