{"id":56311,"no":89,"title":"Chapter 89: Vacuums and Positron Cannons","content":"Chapter 89: Vacuums and Positron Cannons The moment of impact, Michael understood completely that there was a clear discrepancy between he and Zeus in mecha control. Michael had vastly more experience with mechas than Lan Jue. He had spend his life around them, changed by them. Now, he was over a hundred years old. When he’d reached the age of sixty he’d begun vigorously cultivating his powers, searching for ways to prolong his life. In short, he was well past his ‘prime’ physically. Mecha manipulation not only required skill and intelligence, reflexes were also important. In this, he was clearly inferior to Lan Jue. But he was the Angel of War for a reason, celebrated for his combat abilities, and first of the Castle’s Seraph. He’d had a revelation during their relatively short exchange. Thor was simply too fast – though he had the benefit of experience, the longer the battle raged the more difficult it would be for him to emerge victorious. His golden Angel was difficult to injure, but it was only prolonging the inevitable. The more he fell behind Thor, the more dangerous his predicament became. He had to do something drastic. Michael’s sluggish defense was deliberate. Thor’s spear had indeed run the Angel through, but instead of pinning Michael to the back of the cockpit it had merely struck his shoulder. The electric energies coursing through it had paralyzed him, but it didn’t prevent Michael from employing his own Discipline. Michael sat bleeding in the mangled Angel’s cockpit, his body alive with orange flame that filled the cockpit. The maroon power gems situated in the mecha’s head, knees, elbows and stomach drank it up – the source of the powerful vacuum. The gems were called Abyssal Flame gems. When injected with power, they produced a flame, but contrary to normal fire they created a potent vacuum in their area of effect. The increase in fuel and oxygen made the fires burn at a frightening temperature. Your average alloy couldn’t stand the heat for long. These gems were the exclusive property of the Pontiff’s Castle. They went to enormous lengths to protect and procure them, even going so far as to sacrifice capital ships. They were considered A-ranked gems. Even the most cutting edge of mechas couldn’t support installation of an S-ranked gem. They were simply too powerful to be safe – the machinery couldn’t support them. A-ranked gems were overall a better call. When linked with others they even approached the power of a single S-gem. The burning flames that encircled Michael were known as the Fires of Sacrifice. They empowered his holy fires to even greater heights. No one had ever escaped the powers of the Abyssal Fire gems, and with his sacrifice they became that much stronger. The drawback to employing such powerful abilities was considerable. Each moment drained his fundamental vitality, worse even than the drain from his Adventus. The golden Angel of War was also affected, as the gems wreaked havoc on the mecha itself. It would cost a fortune to repair the machine – if he got the chance. But Michael was resolute, assured in his decision. A decision born of fear – fear of what Zeus could do in the future. A man with two disciplines, congenital and powerful. If he were allowed to cultivate his powers, to master them, he would be the most powerful Adept in history. This was something the Pontiff’s Castle… in fact, the entire Western Alliance couldn’t allow. For this reason he’d lit the fires of sacrifice. His heart had already hardened; to his own death, and the death of his enemy. Crrrrunch. The two gigantic mechas pressed violently against each other. Thor trembled visibly, but this time the Oscillation did nothing for him. In fact, under the intense pressure, the mecha had become plainly more sluggish. Undulating bolts of electricity raced along the length of Thor’s armor creating a shield. It served to temporarily withstand the heat of the abyssal flames. But with the added power of the sacrificial fires from Michael, the heat proved too much. As the mecha’s shields began to fail, Lan Jue sat fuming in the dark cockpit. “Michaaaeeell!” ζ The white columns of light served as an effective cage to reign in Asura. No space existed for even the slightest motion. Despite this, the Cherubim Uriel sat in glowering at the scene from his cockpit. A giant gash marred the mechas surface from shoulder to abdomen. It was deep enough to reveal the cabin he sat in now. He’d misjudged Asura’s capabilities, so much so that it almost cost him his mecha and his life. The large cut that nearly split him in two punctuated the fact. Even though he’d come out victorious, his victory had cost him more than it cost Xiuxiu. Asura was an inferior machine to his Cherubim, but her sheer attacking force meant that his victory had come at a great price. It would take a minimum of three months to repair, and even then the Cherubim would never be the same. “Have you found Zeus’ ship? Did it attempt to break atmosphere?” Uriel spoke in to his communicator. “Master Cherubim, no ships have attempted to leave Moonfiend’s atmosphere. The ship was fitted with a superior cloaking device. We’ve found no sign of it.” Uriel growled at the voice crackling through his communicator. “Keep up surveillance. Moonfiend and all it’s satellites. If anything tries to break through, you shoot it down.” “Yes, sir!” “Hm!” A deep grunt tickled at Uriel’s ear. He shot his eyes around, but neither he nor his mecha were able to determine the origin of the strange, hoary voice. It became considerably more disconcerting when the lights went out. All the space between he and Asura went dark, and the columns of light seemed to slither away like they were being swallowed up. His fingers jabbed at the controls of his mecha, running an external diagnostic. The results caused his eyes to grow wide. “A vacuum singularity?” Somehow, in the space between he and Asura, a powerful vacuum had spontaneously arisen. It wasn’t unlike the void of space, but did not continue to expand. “Positron cannon!” The aged voice returned, stronger than before. His reaction was swift, and without hesitation. A hissing noise filled the air, and Uriel immediately dropped his control over Asura and bolted wildly in to the distance like a meteor. A beam of blinding light lanced through the spot he’d just vacated. In it’s wake all manner of reconnaissance and radar equipment shut off. “Singularity… positron cannon… that was the Arcane Magnate! It was really him!” Uriel flew in retreat as fast as his Angel could manage. His face was pale from fear. The Arcane Magnate – one of the Great Paragons! And more, in the top three of their order in terms of simple destructive power. How did the Arcane Magnate come to be here? Uriel couldn’t shake the confusion muddling his brain. A battleship’s shields couldn’t survive a blast from a positron charge, much less a mecha. It was a weapon employed by capital ships. Capital ships, and the Magnate – a man who could discharge positron charges with his body alone. A man who could fold space to attack from anywhere. The same was true for the singularity. But there were no energy fluctuations – just light? His heart skipped a beat, and his features once more turned dark. “No… I’ve been tricked.” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-89","bookId":1509,"book":{"id":1509,"title":"Skyfire Avenue","description":"天火大道, aka Skyfire Avenue, is a scifi/fantasy webnovel by popular Chinese author Third Young Master of the Tang Family, aka Tang Jia San Shao (唐家三少), the same author who wrote Douluo Dalu. This project is complete, having been finished by Xiao Lai.","cover":"http://cunovel.com/img/SFL.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/skyfire-avenue","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
