{"id":8250,"no":7,"title":"Chapter 7","content":"I saw a short while back that some of you could scarcely restrain your laughter, when our orator treated these views of mine on the cleansing of the teeth as a matter for savage denunciation, and condemned my administration of a tooth-powder with fiercer indignation than has ever been shown in condemning the administration of a poison.\n Of course it is a serious charge, and one that no philosopher can afford to despise, to say of a man that he will not allow a speck of dirt to be seen upon his person, that he will not allow any visible portion of his body to be offensive or unclean, least of all the mouth, the organ used most frequently, openly and conspicuously by man, whether to kiss a friend, to conduct a conversation, to speak in public, or to offer up prayer in some temple. Indeed speech is the prelude to every kind of action and, as the greatest of poets says, proceeds from ‘the barrier of our teeth’. If there were any one present here today with like command of the grand style, he might say after his fashion that those above all men who have any care for their manner of speaking, should pay closer attention to their mouth than to any other portion of their body, for it is the soul’s antechamber, the portal of speech, and the gathering place where thoughts assemble. I myself should say that in my poor judgement there is nothing less seemly for a freeborn man with the education of a gentleman than an unwashen mouth. For man’s mouth is in position exalted, to the eye conspicuous, in use eloquent. True, in wild beasts and cattle the mouth is placed low and looks downward to the feet, is in close proximity to their food and to the path thq tread, and is hardly ever conspicuous save when its owner is dead or infuriated with a desire to bite. But there is no part of man that sooner catches the eye when he is silent, or more often when he speaks.\n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/638/1060.html","bookId":274,"book":{"id":274,"title":"The Defense","description":"简介： Dynamite defense attorney Joseph Antonelli has never lost a case--or felt the sting of conscience for letting the guilty go free. I can deceive anyone, he says, and no one more quickly or more completely than myself. Now the man he most adm...","cover":"http://novel.tingroom.com/uploads/120901/1-120Z1100503628.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/638","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
