{"id":8330,"no":87,"title":"Chapter 87","content":"But I cannot bring myself to believe Aemilianus such a fool as to think that the letter of a mere boy, who is also one of my accusers, could seriously tell against me.\\n\\n There is also that forged letter by which they attempted to prove that I beguiled Pudentilla with flattery. I never wrote it and the forgery is not even plausible. What need did I have of flattery, if I put my trust in magic? And how did they secure possession of that letter which must, as is usual in such affairs, have been sent to Pudentilla by some confidential servant? Why, again, should I write in such faulty words, such barbarous language, I whom my accusers admit to be quite at home in Greek? And why should I seek to seduce her by flattery so absurd and coarse? They themselves admit that I write amatory verse with sufficient sprightliness and skill. The explanation is obvious to everyone; it is this: he who could not read the letter which Pudentilla wrote in Greek altogether too refined for his comprehension, found it easier to read this letter and set it off to greater advantage because it was his own.\\n\\n One more point and I shall have said enough about the letters. Pudentilla, after writing in jest and irony those words ‘Come then, while I am yet in my senses,’ sent for her sons and her daughter-in-law and lived with them for about two months. I beg this most dutiful of sons to tell us whether he then noticed his mother’s alleged madness to have affected for the worse either her words or her deeds. Let him deny that she showed the utmost shrewdness in her examination of the accounts of the bailiffs, grooms, and shepherds, that she earnestly warned his brother Pontianus to be on his guard against the designs of Rufinus, that she rebuked him severely for having freely published the letter she had sent him without having read it honestly as it was written! Let him deny that, after what I have just related to you, his mother married me in her country house, as had been agreed some time previously!\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/638/1140.html","bookId":274,"book":{"id":274,"title":"The Defense","description":"简介： Dynamite defense attorney Joseph Antonelli has never lost a case--or felt the sting of conscience for letting the guilty go free. I can deceive anyone, he says, and no one more quickly or more completely than myself. Now the man he most adm...","cover":"http://novel.tingroom.com/uploads/120901/1-120Z1100503628.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/638","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
