{"id":1161,"no":118,"title":"chapter 118","content":"It was late in the evening when Philip arrived at Ferne. It was Mrs. Athelny’s native village, and she had been accustomed from her childhood to pick in the hop-field to which with her husband and her children she still went every year. Like many Kentish folk her family had gone out regularly, glad to earn a little money, but especially regarding the annual outing, looked forward to for months, as the best of holidays. The work was not hard, it was done in common, in the open air, and for the children it was a long, delightful picnic; here the young men met the maidens; in the long evenings when work was over they wandered about the lanes, making love; and the hopping season was generally followed by weddings. They went out in carts with bedding, pots and pans, chairs and tables; and Ferne while the hopping lasted was deserted. They were very exclusive and would have resented the intrusion of foreigners, as they called the people who came from London; they looked down upon them and feared them too; they were a rough lot, and the respectable country folk did not want to mix with them. In the old days the hoppers slept in barns, but ten years ago a row of huts had been erected at the side of a meadow; and the Athelnys, like many others, had the same hut every year. \n \n Athelny met Philip at the station in a cart he had borrowed from the public-house at which he had got a room for Philip. It was a quarter of a mile from the hop-field. They left his bag there and walked over to the meadow in which were the huts. They were nothing more than a long, low shed, divided into little rooms about twelve feet square. In front of each was a fire of sticks, round which a family was grouped, eagerly watching the cooking of supper. The sea-air and the sun had browned already the faces of Athelny’s children. Mrs. Athelny seemed a different woman in her sun-bonnet: you felt that the long years in the city had made no real difference to her; she was the country woman born and bred, and you could see how much at home she found herself in the country. She was frying bacon and at the same time keeping an eye on the younger children, but she had a hearty handshake and a jolly smile for Philip. Athelny was enthusiastic over the delights of a rural existence. \n \n ‘We’re starved for sun and light in the cities we live in. It isn’t life, it’s a long imprisonment. Let us sell all we have, Betty, and take a farm in the country.’ \n \n ‘I can see you in the country,’ she answered with good-humoured scorn. ‘Why, the first rainy day we had in the winter you’d be crying for London.’ She turned to Philip. ‘Athelny’s always like this when we come down here. Country, I like that! Why, he don’t know a swede from a mangel-wurzel.’ \n \n ‘Daddy was lazy today,’ remarked Jane, with the frankness which characterized her, ‘he didn’t fill one bin.’ \n \n ‘I’m getting into practice, child, and tomorrow I shall fill more bins than all of you put together.’ \n \n ‘Come and eat your supper, children,’ said Mrs. Athelny. ‘Where’s Sally?’ \n \n ‘Here I am, mother.’ \n \n She stepped out of their little hut, and the flames of the wood fire leaped up and cast sharp colour upon her face. Of late Philip had only seen her in the trim frocks she had taken to since she was at the dressmaker’s, and there was something very charming in the print dress she wore now, loose and easy to work in; the sleeves were tucked up and showed her strong, round arms. She too had a sun-bonnet. \n \n ‘You look like a milkmaid in a fairy story,’ said Philip, as he shook hands with her. \n \n ‘She’s the belle of the hop-fields,’ said Athelny. ‘My word, if the Squire’s son sees you he’ll make you an offer of marriage before you can say Jack Robinson.’ \n \n ‘The Squire hasn’t got a son, father,’ said Sally. \n \n She looked about for a place to sit down in, and Philip made room for her beside him. She looked wonderful in the night lit by wood fires. She was like some rural goddess, and you thought of those fresh, strong girls whom old Herrick had praised in exquisite numbers. The supper was simple, bread and butter, crisp bacon, tea for the children, and beer for Mr. and Mrs. Athelny and Philip. Athelny, eating hungrily, praised loudly all he ate. He flung words of scorn at Lucullus and piled invectives upon Brillat-Savarin. \n \n ‘There’s one thing one can say for you, Athelny,’ said his wife, ‘you do enjoy your food and no mistake!’ \n \n ‘Cooked by your hand, my Betty,’ he said, stretching out an eloquent forefinger. \n \n Philip felt himself very comfortable. He looked happily at the line of fires, with people grouped about them, and the colour of the flames against the night; at the end of the meadow was a line of great elms, and above the starry sky. The children talked and laughed, and Athelny, a child among them, made them roar by his tricks and fancies. \n \n ‘They think a rare lot of Athelny down here,’ said his wife. ‘Why, Mrs. Bridges said to me, I don’t know what we should do without Mr. Athelny now, she said. He’s always up to something, he’s more like a schoolboy than the father of a family.’ \n \n Sally sat in silence, but she attended to Philip’s wants in a thoughtful fashion that charmed him. It was pleasant to have her beside him, and now and then he glanced at her sunburned, healthy face. Once he caught her eyes, and she smiled quietly. When supper was over Jane and a small brother were sent down to a brook that ran at the bottom of the meadow to fetch a pail of water for washing up. \n \n ‘You children, show your Uncle Philip where we sleep, and then you must be thinking of going to bed.’ \n \n Small hands seized Philip, and he was dragged towards the hut. He went in and struck a match. There was no furniture in it; and beside a tin box, in which clothes were kept, there was nothing but the beds; there were three of them, one against each wall. Athelny followed Philip in and showed them proudly. \n \n ‘That’s the stuff to sleep on,’ he cried. ‘None of your spring-mattresses and swansdown. I never sleep so soundly anywhere as here. YOU will sleep between sheets. My dear fellow, I pity you from the bottom of my soul.’ \n \n The beds consisted of a thick layer of hopvine, on the top of which was a coating of straw, and this was covered with a blanket. After a day in the open air, with the aromatic scent of the hops all round them, the happy pickers slept like tops. By nine o’clock all was quiet in the meadow and everyone in bed but one or two men who still lingered in the public-house and would not come back till it was closed at ten. Athelny walked there with Philip. But before he went Mrs. Athelny said to him: \n \n ‘We breakfast about a quarter to six, but I daresay you won’t want to get up as early as that. You see, we have to set to work at six.’ \n \n ‘Of course he must get up early,’ cried Athelny, ‘and he must work like the rest of us. He’s got to earn his board. No work, no dinner, my lad.’ \n \n ‘The children go down to bathe before breakfast, and they can give you a call on their way back. They pass The Jolly Sailor.’ \n \n ‘If they’ll wake me I’ll come and bathe with them,’ said Philip. \n \n Jane and Harold and Edward shouted with delight at the prospect, and next morning Philip was awakened out of a sound sleep by their bursting into his room. The boys jumped on his bed, and he had to chase them out with his slippers. He put on a coat and a pair of trousers and went down. The day had only just broken, and there was a nip in the air; but the sky was cloudless, and the sun was shining yellow. Sally, holding Connie’s hand, was standing in the middle of the road, with a towel and a bathing-dress over her arm. He saw now that her sun-bonnet was of the colour of lavender, and against it her face, red and brown, was like an apple. She greeted him with her slow, sweet smile, and he noticed suddenly that her teeth were small and regular and very white. He wondered why they had never caught his attention before. \n \n ‘I was for letting you sleep on,’ she said, ‘but they would go up and wake you. I said you didn’t really want to come.’ \n \n ‘Oh, yes, I did.’ \n \n They walked down the road and then cut across the marshes. That way it was under a mile to the sea. The water looked cold and gray, and Philip shivered at the sight of it; but the others tore off their clothes and ran in shouting. Sally did everything a little slowly, and she did not come into the water till all the rest were splashing round Philip. Swimming was his only accomplishment; he felt at home in the water; and soon he had them all imitating him as he played at being a porpoise, and a drowning man, and a fat lady afraid of wetting her hair. The bathe was uproarious, and it was necessary for Sally to be very severe to induce them all to come out. \n \n ‘You’re as bad as any of them,’ she said to Philip, in her grave, maternal way, which was at once comic and touching. ‘They’re not anything like so naughty when you’re not here.’ \n \n They walked back, Sally with her bright hair streaming over one shoulder and her sun-bonnet in her hand, but when they got to the huts Mrs. Athelny had already started for the hop-garden. Athleny, in a pair of the oldest trousers anyone had ever worn, his jacket buttoned up to show he had no shirt on, and in a wide-brimmed soft hat, was frying kippers over a fire of sticks. He was delighted with himself: he looked every inch a brigand. As soon as he saw the party he began to shout the witches’ chorus from Macbeth over the odorous kippers. \n \n ‘You mustn’t dawdle over your breakfast or mother will be angry,’ he said, when they came up. \n \n And in a few minutes, Harold and Jane with pieces of bread and butter in their hands, they sauntered through the meadow into the hop-field. They were the last to leave. A hop-garden was one of the sights connected with Philip’s boyhood and the oast-houses to him the most typical feature of the Kentish scene. It was with no sense of strangeness, but as though he were at home, that Philip followed Sally through the long lines of the hops. The sun was bright now and cast a sharp shadow. Philip feasted his eyes on the richness of the green leaves. The hops were yellowing, and to him they had the beauty and the passion which poets in Sicily have found in the purple grape. As they walked along Philip felt himself overwhelmed by the rich luxuriance. A sweet scent arose from the fat Kentish soil, and the fitful September breeze was heavy with the goodly perfume of the hops. Athelstan felt the exhilaration instinctively, for he lifted up his voice and sang; it was the cracked voice of the boy of fifteen, and Sally turned round. \n \n ‘You be quiet, Athelstan, or we shall have a thunderstorm.’ \n \n In a moment they heard the hum of voices, and in a moment more came upon the pickers. They were all hard at work, talking and laughing as they picked. They sat on chairs, on stools, on boxes, with their baskets by their sides, and some stood by the bin throwing the hops they picked straight into it. There were a lot of children about and a good many babies, some in makeshift cradles, some tucked up in a rug on the soft brown dry earth. The children picked a little and played a great deal. The women worked busily, they had been pickers from childhood, and they could pick twice as fast as foreigners from London. They boasted about the number of bushels they had picked in a day, but they complained you could not make money now as in former times: then they paid you a shilling for five bushels, but now the rate was eight and even nine bushels to the shilling. In the old days a good picker could earn enough in the season to keep her for the rest of the year, but now there was nothing in it; you got a holiday for nothing, and that was about all. Mrs. Hill had bought herself a pianner out of what she made picking, so she said, but she was very near, one wouldn’t like to be near like that, and most people thought it was only what she said, if the truth was known perhaps it would be found that she had put a bit of money from the savings bank towards it. \n \n The hoppers were divided into bin companies of ten pickers, not counting children, and Athelny loudly boasted of the day when he would have a company consisting entirely of his own family. Each company had a bin-man, whose duty it was to supply it with strings of hops at their bins (the bin was a large sack on a wooden frame, about seven feet high, and long rows of them were placed between the rows of hops;) and it was to this position that Athelny aspired when his family was old enough to form a company. Meanwhile he worked rather by encouraging others than by exertions of his own. He sauntered up to Mrs. Athelny, who had been busy for half an hour and had already emptied a basket into the bin, and with his cigarette between his lips began to pick. He asserted that he was going to pick more than anyone that day, but mother; of course no one could pick so much as mother; that reminded him of the trials which Aphrodite put upon the curious Psyche, and he began to tell his children the story of her love for the unseen bridegroom. He told it very well. It seemed to Philip, listening with a smile on his lips, that the old tale fitted in with the scene. The sky was very blue now, and he thought it could not be more lovely even in Greece. The children with their fair hair and rosy cheeks, strong, healthy, and vivacious; the delicate form of the hops; the challenging emerald of the leaves, like a blare of trumpets; the magic of the green alley, narrowing to a point as you looked down the row, with the pickers in their sun-bonnets: perhaps there was more of the Greek spirit there than you could find in the books of professors or in museums. He was thankful for the beauty of England. He thought of the winding white roads and the hedgerows, the green meadows with their elm-trees, the delicate line of the hills and the copses that crowned them, the flatness of the marshes, and the melancholy of the North Sea. He was very glad that he felt its loveliness. But presently Athelny grew restless and announced that he would go and ask how Robert Kemp’s mother was. He knew everyone in the garden and called them all by their Christian names; he knew their family histories and all that had happened to them from birth. With harmless vanity he played the fine gentleman among them, and there was a touch of condescension in his familiarity. Philip would not go with him. \n \n ‘I’m going to earn my dinner,’ he said. \n \n ‘Quite right, my boy,’ answered Athelny, with a wave of the hand, as he strolled away. ‘No work, no dinner.’ \n \n \n \n 第一百十八章 \n \n 菲利普到达费尔内时，夜已很黑了。费尔内是阿特尔涅太太的故乡。她自小就养成采集蛇麻子的习惯，嫁了丈夫，有了孩子以后，她还是每年偕同他们来到这里采集蛇麻子。同许多肯特郡老乡一样，她一家子定期外出采集蛇麻子，一来可赚得几个钱补贴家用，但主要还是把此行看作一年一度的远足，并把此行当作最愉快的节日。早在这节日到来之前几个月，一家人就都翘首企足地期待着啦。这活儿并不重，大家在露天里通力合作，起劲地采着。对孩子们来说，这是次漫长的、不无乐趣的野炊。在这蛇麻子草场，小伙子们得以与姑娘们相遇；工作之余，在那漫漫长夜，他们便成双成对地戏耍追逐于街头巷尾，恣情欢娱一番。于是，采集蛇麻子季节一过，接着就是举行婚礼。新郎新娘们坐在一辆辆大车上，车上放着被褥、瓶瓶罐罐，还有椅子和桌于等等什物。采集蛇麻子的季节一过，费尔内便显得空空荡荡的。本地人却非常排外，一向反对\"异乡客\"--他们常常把伦敦佬唤作\"异乡客\"---的侵入。本地人瞧不起那些伦敦佬，同时又惧怕他们。他们把伦敦佬视作粗野的货色，地方上体面人家不愿意跟他们联姻结亲。过去，来这儿采集蛇麻子的人都睡在谷仓里面，但十年前，在草场的一侧盖起了一溜茅屋。于足，阿特尔涅一家同别的人家一样，每年来到此地都住在同一间茅屋里。 \n \n 阿特尔涅驾了辆马车上火车站去接菲利普。马车是从草场小酒馆里借来的，他还在那里为菲利普订了个房间。小酒馆离草场只有四分之一英里。他们把菲利普的行李留在房间里，然后便来到盖满茅屋的蛇麻子草场。这里的茅屋狭长、低矮，分隔成几个房间，每个房间约十二平方英尺。每座茅屋前都用树枝燃起一堆篝火，一家人围坐在篝火旁，一个个目光急切地注视着烹调晚餐。海风和阳光把阿特尔涅的孩子们的脸膛染成了棕红色。阿特尔涅太太戴了顶太阳帽，简直判若两人，使人感到多年的城市生活并没有使她发生多大的变化。她是个道道地地的乡村妇人。瞧她身处乡村的氛围中是多么从容自如啊。此时，她正在油煎香肠，同时一刻不停地照看着身边的小孩子。不过菲利普到时，她还是腾出手来同他热烈握手表示欢迎，脸上绽开了笑容。阿特尔涅激情满怀地数说起乡村生活的种种乐趣来了。 \n \n \"生活在城市里，我们渴望着阳光和光明。那不是生活，是一种长期监禁。贝蒂，我们把一切都卖了，到乡村来办个农场吧！\" \n \n \"你在乡村的表现，我可清楚着哪，\"阿特尔涅太太兴高采烈地怪嗔着丈夫说。\"嘿，冬天一下雨，你就会一个劲儿地吵着回伦敦啦。\"她说着掉头转向菲利普。\"我们一来这儿，阿特尔涅总是这副样子。说什么，啊，乡村，我太喜欢你啦！嘿，他连哪是甜菜，哪是甘蓝，都还分不清哩。\" \n \n \"爸爸今天偷懒，\"吉恩插进来说，她的个性非常直率，\"他连一篮都没采满。\" \n \n \"我很快就学会怎么采了，孩子。到了明天你瞧着吧，我一定采得比你们加起来的还要多。\" \n \n \"孩子们，快来吃晚饭吧，\"阿特尔涅太太嚷了一声。\"莎莉到哪儿去了？\" \n \n \"妈妈，我在这儿。\" \n \n 话音刚落，莎莉从茅屋里走了出来。此时，火堆里的木头噼啪作响，火舌往上直蹿，火光将她的脸孔映得通红。近来，菲利普发觉她身上老是穿着洁净的工装；自从她去缝纫厂做工以来，她就喜欢穿这种服装，可这天晚上，她却穿着印花布上衣，倒别有一种迷人的魅力。这上衣宽宽大大的，穿着它干起活来身子灵便多了。衣袖卷着，裸露着她那健壮的、圆滚滚的双臂。她同她妈妈一样，也戴了一顶太阳帽。 \n \n \"你看上去像是神话里的挤奶女工，\"菲利普在同她握手的当儿这样说道。 \n \n \"她可是蛇麻子草场用的美人，\"阿特尔汉说，\"我敢说，要是乡绅老爷的儿子看到你的话，他马上就会向你求婚。\" \n \n \"乡绅老爷可没有儿子，爸爸，\"莎莉回了一句。 \n \n 她环顾四周，想找个座位。菲利普看到后，便挪了挪身子，腾出地方让她坐在自己的身边。在这被篝火照得通明的夜晚，莎莉的模样儿美得惊人，活脱像个淳朴的女神，令人想起了老赫里克以幽雅细腻的诗句描绘的那些水灵、健美的婷婷女郎来。晚餐吃得很简单，香肠就着牛油面包。孩子们喝茶，而阿特尔涅夫妇俩同菲利普喝啤酒。阿特尔涅狼吞虎咽地吃着，每吃一口都高声地赞美一番。他一个劲儿地嘲笑鲁克勒斯，还把布里拉特-沙瓦林臭骂了一顿。 \n \n \"阿特尔涅，有一点你还是值得称赞的，\"他的妻子说，\"那就是你吃东西的胃口真好，这没错的！\" \n \n \"我的贝蒂，这都是你亲手做的呀，\"阿特尔涅说话的当儿，像演说家似的向前伸了伸食指。 \n \n 菲利普心情非常愉快。他欢乐地凝视着连成长串的篝火。人们围坐在火堆旁取暖，凝视着划破夜幕的通红的火光。草场的尽头矗立着一排榆树；头顶上，星光灿烂。孩子们喧哗着，嬉笑着，而阿特尔涅，活脱像个小孩，挤在他们中间，用他的拿手戏法和荒诞离奇的故事，逗着孩子们发出阵阵狂呼乱叫。 \n \n \"这儿的人可喜欢阿特尔涅了，\"阿特尔涅太太对菲利普说。\"嗯。一天，布里奇斯太太对我说，现在离了阿特尔涅先生，我们还不知怎么办才好呢。他总是变着戏法儿玩，说他是一家之长，还不如说他像个小学生更恰当些。\" \n \n 莎莉不言不语地坐着，可她却非常周到地伺候着菲利普，那神态倒把菲利普给迷住了。有她坐在自己的身边，菲利普感到很高兴。他不时朝她那张健康的、被太阳晒得黝黑的脸瞥上一眼。一次，两人的目光相遇时，莎莉朝他恬静地微微一笑。晚饭后，吉恩和另一个小男孩被支去到草场尽头的小溪里打一桶洗碗水。 \n \n \"孩子们，快领你们的菲利普叔叔去看看我们睡觉的地方。你们也该上床歇着去了。\" \n \n 孩子们伸出一双双小手，拉的拉，拽的拽，簇拥着菲利普朝茅屋走去。他走进茅屋，随即划亮了一根火柴，只见茅屋里面几乎什么家具都没有，除了一只存放衣服的铁皮箱外，就只有几张床。一共是三张床，都靠墙摆着。阿特尔涅跟着菲利普走进了茅屋，骄傲地把床指点给他看。 \n \n \"我们就睡在这种床上，\"他嘴里不住地嚷道。\"你睡的那种弹簧床和盖的天鹅绒被褥，这里可一样也没有。我睡在哪儿也没有像睡在这儿这么香甜过。你可得要裹着被单睡罗。亲爱的老弟，我打心眼里替你难过。\" \n \n 三张床都垫了一层厚厚的蛇麻草蔓，蛇麻草蔓上面又铺了层稻草，最上面都蒙了块毯子。露天里散发着馥郁的蛇麻草香味，在这种环境中干了一整天之后，那些无忧无虑的采集者们倒头便睡，一个个睡得都像死人似的。晚上九点时，草场四周阒无人影，笼罩在一片静谧之中。一两个酒鬼赖在小酒馆里，不到酒馆十点打烊不会回家。除此之外，其他人都进入梦乡了。阿特尔涅送菲利普去酒馆安歇，临行前，阿特尔涅太太对菲利普说： \n \n \"我们五点三刻吃早饭，我想你肯定不会起那么早的。叫我说，六点钟我们就得干活了。\" \n \n \"他当然也得早早起身咯，\"阿特尔涅接着话茬嚷道。\"他也得跟大家一样干活，出力挣饭钱嘛。不干活，没饭吃，我的老弟。\" \n \n \"孩子们早饭前下海游泳，他们回来的路上会叫醒你的。他们要走过\u0027快乐的水手\u0027酒馆的。\" \n \n \"他们来叫醒我，那我就同他们一块去游泳，\"菲利普说。 \n \n 他这么一说，吉恩、哈罗德和爱德华高兴地叫了起来，次日清晨，菲利普的一场好梦被孩子们闯进房间来的吵闹声打断了，他们一个个跳到他床上。他不得不提起拖鞋把他们赶下去。他匆匆穿了件上衣，套上裤子，尾随着他们奔下楼去。天刚破晓，空气里还透着丝丝寒意，天空万里无云，金灿灿的阳光普照大地。莎莉站在大路中间，一手牵着科尼的手，手臂上挎着条毛巾和一套游泳衣。他这时才看清，她那顶太阳帽是淡紫色的，在它的映衬下，她的脸蛋黑里透红，像只苹果似的。她照例不慌不忙地朝菲利普微微笑了笑，算是跟他打招呼。蓦然间，菲利普发现她那口牙齿小小的，整整齐齐，雪白雪白的。他不禁对自己以前怎么会没有注意到这一点而感到惊奇。 \n \n \"我是想让你再睡一会儿的，\"莎莉开腔说道，\"可他们非要上去把你叫醒不可。我对他们说你并不想去海里游泳。\" \n \n \"哪里的话，我很想去哩。\" \n \n 他们沿着大路向前走了一段，然后穿过一片片草地。他们这么走，走不了一英里地就可以到海边。海水灰蒙蒙的，寒气逼人，菲利普一看，身上不觉一阵寒颤。可此时，孩子们都纷纷脱去衣服，一边喊着一边跑进海里。莎莉无论做什么事，总是不紧不慢的，直到孩子们围着菲利普溅水时，她才走了下去。游泳是菲利普的拿手好戏，一走进水里，他就感到舒展自如。没隔一会儿，孩子们一个个都模仿着他的姿态，忽而装成快淹死的人，忽而又装作想游泳又怕打湿了头发的胖女人的神态，欢声笑语不绝，热闹非凡。瞧他们这副德行，要是莎莉不严厉地吆喝，他们还个知要玩到何时才想上岸呢。 \n \n \"你跟他们中任何一个一样坏，\"莎莉责备菲利普说，说话时神情严肃，像是个做母亲的。其神态既富有戏剧性，又动人心弦。\"你不在，他们从不像这样顽皮。\" \n \n 他们走在回去的路上，莎莉手里拿着太阳帽，那头秀发飘垂在一只肩膀上。等他们回到茅屋时，阿特尔涅太太已经上蛇麻子草场干活去了。阿特尔涅下身套了条谁也没穿过的裤子，外套的钮扣一直扣到脖子，这表明他里面没穿衬衣。他头上戴了顶宽边软帽，正在火堆上熏着雄鳟鱼。他自得其乐，看上去活像个土匪。一看到他们一帮人，他便扯开嗓门，背诵着《麦克佩斯》里巫婆的台词，在这同时，他手中熏的雄鳟鱼发出一股冲鼻的臭气。 \n \n \"你们不该玩这么久，早饭时间都过了，妈妈可要生气了，\"当他们来到他的跟前时他这么说。 \n \n 几分钟以后，哈罗德和吉恩两人拿了几片牛油面包，晃悠着穿过草地，朝蛇麻子草场走去。他们是最后离开的。蛇麻草园子是同菲利普的童年紧密联系着的景色之一，而在他眼里，那蛇麻子烘房最富有典型的肯特郡的地方特色。菲利普跟在莎莉的后面，穿过一行行蛇麻草。他对这儿的切毫不感到陌生，就好像回到了自己的家里一般。此时，阳光明亮，人影投地，轮廓鲜明。菲利普目不转睛欣赏着茂盛的绿叶。蛇麻草渐渐变黄了，在他看来，它们中间蕴蓄着美和激情，正如西西里的诗人们在紫红色的葡萄里所发现的一样。他们俩并肩朝前走着，菲利普觉得自己完全为周围万物茂盛、欣欣向荣的景象所陶醉。肥沃的肯特郡大地升腾起缕缕甜蜜的、芬芳的气息；九月的习习微风，时辍时作，飘溢着蛇麻草浓郁诱人的香味。阿特尔斯坦不由得心头一热，情难自已地引吭高歌起来，可他发出的是十五岁男孩才有的那种沙哑声，怪不得莎莉转过身去说： \n \n \"阿特尔斯坦，你给我安静坐吧，要不，我们耳边听到的尽是轰轰的雷声。 \n \n 不一会儿，耳边传来七嘴八舌的唧唧喳喳声，又过一会儿，采集蛇麻子的人说话声更高了。他们不停地起劲采着，一边不住地说啊，笑啊。那此人有的坐在椅子上，有的坐在方凳上，也有的坐在木盒子上，每人身边都放着篮了，有的干脆站在大箱旁边，把采得的蛇麻子径直扔进大箱内。周围有不少小孩，还有许多吃奶的婴儿，其中有躺在活动摇篮里的，也有裹着破被放在松软、干燥的地上的。小孩采的不多，可玩的倒不少。女人们一刻不停地忙着，她们自小就采惯了的，速度要比来自伦敦的异乡人快两倍。她们炫耀地报出她们一天中采的蛇麻子的蒲式耳数，可又一个劲儿地抱怨，说眼下挣的钱可比从前要少得多。过去，每采五蒲式耳可得一先令，可现在要采八蒲式耳，甚至九蒲式耳才能挣得一先令。以往，一个快手一季挣得的钱，足够维持她当年其余时日的生活，现在可根本办不到，只是来度个假而已，啥也捞不到。希尔太太用采蛇麻子挣得的钱买了架钢琴--她是这么说的--不过，她的日子过得够寒酸的，那种日子谁也不愿过。有人认为她说是这么说，要是把事情揭开来的话，大家说不定就会知道她是到银行里取了些钱凑足款子才买那架钢琴的。 \n \n 采蛇麻子的人分成几个小组，每组十个人，但其中不包括孩子。因此，阿特尔涅高声夸口说，总有一天他有个全是他家里人组成的小组。每个小组有个组长，负责把一扎扎蛇麻草放在各人的蛇麻草袋子旁边（蛇麻草袋是个套在木框架上的大麻袋，高达七英尺。一排排麻袋放在两堆蛇麻草的中间），而阿特尔涅眼红的正是组长这一位子，所以他盼着孩子们快快长大，到那时可以自家组成一个小组。此时，与其说他是在卖力地干活，倒不如说他是为了鼓励别人出劲干才来的。他悠哉悠哉地荡到阿特尔涅太太的身边，嘴上叼了支香烟，动手采蛇麻子。阿特尔涅太太两手不停地干了半个小时，刚把一篮蛇麻子倒进麻袋里。阿特尔涅口口声声说这天他要比任何人都采得多，当然要除去孩子他妈，因为谁也不可能采得像她那么快。这件事使他回想起阿佛洛狄忒对普塞基的几次试探的传说，于是他便给孩子们滔滔不绝地讲起了普塞基倾心爱着她从未见过的新郎的故事来了。他讲得娓娓动听。菲利普谛听着，嘴角含着微笑；在他看来，那古老的传说跟周围的场面无比和谐一致。天空，瓦蓝瓦蓝的，他认为即使在希腊，天也不会这么美。孩子们头发金黄，两腮宛如两朵玫瑰，身体结实、壮美，充满了生命的活力；蛇麻子形状玲珑剔透；叶子碧绿，色泽有如喇叭形植物；富有魔力的绿草丛中的小径，极目远眺，在远处缩成一点；采集蛇麻子的人，一个个头戴太阳帽。所有这一切，要比你在那些教授们著的教科书或博物馆中察觉到的更富有希腊精神。菲利普对英国之美，内心里充满了激情。他想起了一条条蜿蜒、清静的路，一簇簇编成树篱的灌木丛，一片片绿茵茵的、点缀着榆树的芳草地，一座座小山的幽雅线条和上面覆着的一个个坟丘，一块块平坦的沼泽地，以及北海那惨淡凄怆的景象。他为自己感受到了英国的优美动人之处而感到非常高兴。可是不久，阿特尔涅变得坐立不安，声称要去看看罗伯特·肯普的妈妈的生活近况。他跟蛇麻子草场的每个人都混得很熟，总是直呼其教名，而且还对每一个家庭的家史及其每个成员的身世无不了如指掌。他虽爱虚荣，但心眼倒不坏，在人们中扮演了一个时髦绅士的角色。他待人亲热，但那股亲热劲里含有几分故献殷勤的味儿。菲利普不愿跟他一块儿去。 \n \n \"我要干活挣顿饭吃吃，\"他说。 \n \n \"说得好，我的老弟，\"阿特尔涅说罢，手臂在空中一挥便走了。\"不干活，没饭吃！\" \n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/995/30122.html","bookId":41,"book":{"id":41,"title":"人性的枷锁 Of Human Bondage","description":"简介： 菲利普天生跛足，自幼失去双亲，自卑的心理深深植根在他的生活中。他在伯父凯里牧师和伯母路易莎的抚养下长大，伯父对其较为冷淡，但伯母悉心照料，给予他母亲般的温暖。菲利普自幼酷爱文学，在伯父的书房里找到寄托。伯父伯母希望菲利普到牛津学习神学，以后成为神父，...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/995","creation":"Aug 1, 2019 12:18:13 AM","modification":"Aug 1, 2019 12:18:13 AM"}}
