{"id":65631,"no":13,"title":"Page 13","content":"“And while I was here, I thought I’d see how you were doing.”\n “I’m busy,” she returned stiffly. “Actually, I have a date myself.” She found herself stretching the truth, but Steve had asked her out, and even if it wasn’t possible that evening, she would eventually be seeing him.\n Her blatant attempt to discourage Christian didn’t seem to be working. “With whom?”\n “Not that it’s any of your business, but he’s an old friend of my husband’s.” She turned her back to him and removed her jacket.\n His smile had vanished when she turned around. “Does this so-called friend have a name?”\n “Of course he has a name. What’s the matter, don’t you believe me?”\n “I believe you,” he said, and looked away as Susannah stepped up to the counter and gave him back his credit card.\n “Thank you for your order, Mr. Dempsey. I’ll make sure the flowers are lovely.”\n She spoke with a little more enthusiasm than Colette deemed strictly necessary.\n “Thank you,” he said, and shot Colette an enigmatic smile that she puzzled over for days.\n CHAPTER 9\n “When making sweaters and you’re off gauge, don’t worry! Fudge and smudge until it fits!”\n Joyce Renee Wyatt, designer and instructor\n Lydia Goetz\n B rad and I invited Matt and Margaret over for dinner on the first Sunday in March. It was my husband’s suggestion and I’m grateful he thought of it. After Julia’s attack, Margaret still wasn’t the same. Julia herself was back in school but refused to talk about what had happened, even to her mother. It was as if a giant boulder had crashed through the roof; everyone had to walk around it and pretend it wasn’t there. At any hint or mention of the carjacking, Julia disappeared into her room, plugged her iPod into her ears and zoned out for hours on end.\n I knew this couldn’t be healthy and I was afraid Margaret’s response wasn’t, either. My sister wanted revenge and she wanted it badly enough to hound the authorities day and night.\n I’d hoped that an evening out with Brad and me would help my sister put aside her anger, at least for a few hours. Every day she arrived at work tense and angry, snapping at me without provocation. Just that week, I’d asked her a simple question about an order I’d had her place for circular knitting needles and she’d yelled at me, saying she was a responsible adult and I’d made her feel like a child. I hardly knew how to respond to the unreasonableness of her attack. Thankfully, no customers were in the shop at the time.\n Brad and I spent the afternoon shopping and then cooking. We make a good team on the domestic front—and in every other way. My husband’s a master at the barbecue, and we decided to grill chicken. I made a batch of potato salad, following a recipe Tammie Lee Donovan had given me. It has jalapeño in the mayonnaise, which provides a little kick. In addition to the potato salad, I doctored up baked beans with brown sugar and mustard and baked a carrot cake for dessert. It’s Cody’s favorite.\n Unfortunately, it was still too early in the year to bring out the picnic table, so we planned to eat indoors. Our goal was a carefree, festive evening in the hope that Margaret and Matt would relax and enjoy themselves.\n Brad had everything under control by the time my sister and her husband arrived. Although I see Margaret almost every day, I was shocked by her appearance when she stepped into the house that afternoon. Outside the familiar environment of A Good Yarn, I suddenly realized how haggard Margaret looked. She’s physically bigger than I am, a good four to five inches taller than my five-foot-two height and sturdily built. Compared to this nightmare with Julia, so little has truly frightened her over the years. Even when Matt was unemployed for months she kept it hidden from me. For all I knew at the time, everything was perfectly fine at home. Only when they were about to lose their house did she reveal that anything was wrong.\n That wasn’t the case now. The dark circles under Margaret’s eyes betrayed her inability to sleep. She’d lost weight, too, and her pants hung loose around her waist.\n After hanging up their coats, I hugged Margaret. “I’m so glad you could make it.”\n Matt glanced in Margaret’s direction, and I had the feeling that at the last minute, she’d wanted to cancel. I don’t know how he managed to change her mind, but I was relieved he had.\n “The chicken’s on the grill,” Brad said, shaking hands with Matt and hugging Margaret. I loved him all the more for the warm way he welcomed my family. “I’m not sure what Lydia’s been making, but she’s been in the kitchen most of the afternoon.”\n “You’ll see,” I teased and we shared a smile because he knew very well what I was making.\n “How about a beer?” Brad offered Matt and the two men disappeared onto the back patio while I got a bottle of chardonnay from the refrigerator for Margaret and me. Cody was with a friend for the day and wouldn’t be back until later. After investigating who was at the door, Chase, Cody’s golden retriever, had returned to his bed in Cody’s room.\n “Is there anything I can do?” Margaret asked.\n “You could set the table.” I had the plates, napkins, silverware and glasses ready. All Margaret had to do was carry them to the table and arrange each place setting.\n “Would you mind if I called home first?”\n “Of course not.”\n She excused herself and hurried into the other room. I could hear her talking to Julia, her tone anxious as she checked on her daughter’s safety. Were the doors locked? she asked. The windows? Had she turned the oven off? Julia must’ve hated having her mother constantly standing guard over her, and yet I’m not sure I wouldn’t have done exactly the same thing.\n Margaret returned to the kitchen, where I was busy transferring everything to serving dishes and setting them in the middle of the table. “How’s Mom?” she asked as she carefully folded the napkins. This was her attempt at avoiding questions about Julia.\n Margaret had only seen our mother a couple of times since the attack. “She seems fine,” I told her.\n My sister gazed sightlessly into the living room. “I miss her.”\n Initially I didn’t understand what she meant. How could Margaret miss our mother when all she had to do was drive over to the assisted living complex? They’d always been close. Even now, they talked at least once a day. After we’d first moved Mom, Margaret stopped by the complex as often as twice daily.\n “It’s almost like we don’t have a mother anymore, isn’t it?” Margaret said sadly.\n A sense of loss came over me. The role reversal had occurred so gradually, I was hardly aware of it while it was happening. All at once, Margaret and I were taking care of Mom. We had, in effect, become the parents, weighing decisions, dealing with financial matters and driving her to doctor’s appointments. This situation had begun in earnest a year ago, when we discovered Mom was severely diabetic and needed to be on insulin. Lately, she’d slipped mentally. The medication she was on no longer seemed to be working.\n “Mom will always be our mother.”\n “I know that,” Margaret said and cast me an irritated glance. “It’s just that I can’t talk to her now.”\n “Of course you can,” I challenged. Mom thrived on routinely hearing from us.\n “Not about this.”\n This, of course, was the attack on Julia. I forgave Margaret for her hot-tempered response when I understood what she meant.\n “I miss my mother,” Margaret repeated.\n I agreed. I missed Mom, too. Missed those special times we’d spent talking about anything and everything. I’d grown to rely on her insights about the store and my customers. But when I was a teenager, Mom had been so deathly afraid of my cancer that she’d forced my father to oversee all medical matters. My father was the one who’d chauffeured me to countless appointments and argued with doctors on my behalf. He’d sat by my bedside before and after my surgeries and whispered encouragement when the pain was more than I could bear. He was there when I suffered the debilitating effects of chemotherapy and buoyed my spirits every way he could. We grew exceptionally close, and in that, we’d excluded Margaret and our mother. True, Mom did her best for me, but my father was my anchor.\n “I’d like to tell her about Julia,” Margaret continued. “But…I can’t.”\n What my sister wanted, of course, was our mother back the way she used to be. She wanted Mom to promise her that everything would be all right, that this nightmare would soon be over and life would return to normal. She sought assurance that the attack wouldn’t have a lasting effect on her daughter. She wanted Mom to tell her that Julia would be able to sleep through the night again and smile and laugh as though she hadn’t a care in the world. Margaret wanted peace, the kind of peace only a mother can give a hurting child, the peace she longed to offer her own daughter.\n “Chicken’s done,” Brad said, coming in from the patio. It’d started to rain, which was no real surprise, since it’d been raining off and on all weekend. The chicken breasts smelled tangy and enticing. Brad had marinated them in a mixture of soy sauce, Italian salad dressing and herbs—a blend he could probably never duplicate again.\n We all gathered around the table and after Brad had offered a simple grace, I passed the serving dishes around.\n Matt dug into the meal with gusto. “This is great,” he said between bites. He helped himself to a second scoop of potato salad before he’d finished his original serving.\n “I haven’t been doing much cooking lately,” Margaret confessed, looking a little embarrassed at the way her husband kept commenting on the food.\n “You’ve been busy,” I said, dismissing her remark.\n “She’s driving the police nuts,” Matt said.\n Margaret glared across the table at him. I caught Brad’s eye and we exchanged an exasperated grimace. We’d hoped to avoid exactly this conversation. Margaret had gone into the dining room twice during dinner to use her cell phone. I knew she was checking on Julia again. Most likely it wasn’t only the police Margaret was annoying.\n “I thought we weren’t going to mention the attack,” she said pointedly to her husband.\n I noticed that Margaret had barely touched her meal.\n Matt sighed, sounding genuinely regretful. “You’re right. I apologize.”\n Now that Matt had brought it up, though, Margaret was loath to drop the subject. “The police don’t even seem to be trying. To the authorities, it’s not that big a deal. They aren’t taking it seriously.”\n Matt raised his hand. “Now, Margaret—”\n “Don’t argue with me, Matt,” she said, interrupting him. “I’m the one dealing with the police, and I’m telling you right now, what happened to Julia is being swept under the rug.”\n “Would anyone like coffee?” I asked in a blatant attempt to redirect the conversation.\n “I’d love some,” Brad said quickly. \n","sourceLink":"https://allnovel.net/back-on-blossom-street-blossom-street-4/page-13.html","bookId":1936,"book":{"id":1936,"title":"Back on Blossom Street (Blossom Street #4)","description":"Storyline: \n Back on Blossom Street (Blossom Street #4) \n There\u0027s a new shop on Seattle\u0027s Blossom Street--a flower store called Susannah\u0027s Garden, right next door to A Good Yarn. Susannah Nelson, the owner, has just hired a young widow named Colette Blake. A couple of months earlier, Colette had abruptly quit her previous job--after a brief affair with her boss. To her dismay, he\u0027s suddenly begun placing weekly orders for flower arrangements! \n Susannah and Colette both join Lydia Goetz\u0027s new knitting class. Lydia\u0027s previous classes have forged lasting friendships, and this one is no exception. But Lydia and her sister, Margaret, have worries of their own. Margaret\u0027s daughter, Julia, has been the victim of a random carjacking, and the entire family is thrown into emotional chaos. \n Then there\u0027s Alix Townsend. Her wedding to Jordan Turner is only months away--but she\u0027s not sure she can go through with it. Her love for Jordan isn\u0027t in question; what she can\u0027t handle is the whole wedding extravaganza engineered by her mentor, Jacqueline, with the enthusiastic cooperation of her future mother-in-law. A reception at the country club and hundreds of guests she\u0027s never even met--it\u0027s just not Alix. \n Like everyone else in Lydia\u0027s knitting class, Alix knows there\u0027s a solution to every problem...and that another woman can usually help you find it!\n \n","cover":"https://allnovel.net/images/back-on-blossom-street-blossom-street-4.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/back-on-blossom-street-blossom-street-4.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 9:57:43 AM"}}
