{"id":31150,"no":8,"title":"Chapter 7: A French Privateer.","content":"Terence went off into a deep sleep as soon as he had pulled the sail over his head, but it seemed to him as if but a minute had elapsed when his companion began to stir him up with his foot. \"What is it?\" he asked. \"I am awfully sorry to wake you,\" Ryan shouted, \"but you have had two hours of it, and I really cannot keep my eyes open any longer. I have felt myself going off, two or three times.\" \"You don\u0027t mean to say that I have been asleep for two hours?\" \"You have, and a few minutes over. I looked at my watch as you lay down.\" \"All right! Give me the oar. I say, it is blowing hard!\" \"I should think it is. It seems to me it is getting up, rather than going down.\" \"Well, we are all right so far,\" Terence said cheerfully, for he was now wide awake again. \"Besides, we are getting quite skilful mariners. You had better spend a few minutes at baling before you lie down, for the water is a good three inches over the boards.\" All day the storm continued and, when darkness began to close in, it seemed to them that it was blowing harder than ever. Each had had two spells of sleep, and they agreed that they could now keep awake throughout the night. It was bad enough having no one to speak to all day, but at night they felt that companionship was absolutely needed. During the day they had lashed together the spars, sail, and the barrel of water--which was now nearly half empty--so that if the boat should be swamped, they could cling to this support. It was a terrible night but, towards morning, both were of opinion that the gale was somewhat abating. About eight o\u0027clock there were breaks in the clouds and, by noon, the sun was shining brightly. The wind was still blowing strong, but nothing to what it had been the evening before and, by nightfall, the sea was beginning to go down. The waves were as high as before, but were no longer broken and crested with heads of foam and, at ten o\u0027clock, they felt that they could both safely lie down till morning. The steering oar was lashed in its position, the sail spread over the whole of the stern of the boat, every drop of water was baled out and, lying down side by side, they were soon fast asleep. When they woke the sun was high, the wind had dropped to a gentle breeze, and the boat was rising and falling gently on the smooth rollers. \"Hurrah!\" Ryan shouted, as he stood up and looked round. \"It is all over. I vote, Terence, that we both strip and take a swim, then spread out our clothes to dry, after which we will breakfast comfortably and then get up sail.\" \"That is a very good programme, Dicky; we will carry it out, at once.\" While they were eating their meal, Ryan asked: \"Where do you suppose we are, Terence?\" \"Beyond the fact that we are right out in the Bay of Biscay, I have not the most remote idea. By the way the water went past us, I should say that we had been going at pretty nearly the same rate as we did when we were sailing; say, four miles an hour. We have been running for forty-eight hours, so that we must have got nearly two hundred miles from Santander. The question is: would it be best to make for England, now, or for Portugal? We have been going nearly northwest, so I should think that we are pretty nearly north of Finisterre, which may lie a hundred and twenty miles from us; and I suppose we are two or three times as much as that from England. The wind is pretty nearly due east again now, so we can point her head either way. We must be nearly in the ship course, and are likely to be picked up, long before we make land. Which do you vote for?\" \"I vote for the nearest. We may get another storm, and one of them is quite enough. At any rate, Spain will be the shortest, by a great deal and, if we are picked up, it is just as likely to be by a French privateer as by an English vessel.\" \"I am quite of your opinion, and am anxious to be back again, as soon as I can. If we got to England and reported ourselves, we might be sent to the depot and not get out again, for months; so here goes for the south.\" The sail was hoisted, and the boat sped merrily along. In a couple of hours their clothes were dry. \"I think we had better put ourselves on short rations,\" Terence said. \"We may be farther off than we calculate upon and, at any rate, we had better hold on to the mouth of the Tagus, if we can; there are sure to be some British officials there, and we shall be able to get money, and rejoin our regiment without loss of time; while we might have all sort of trouble with the Spaniards, were we to land at Corunna or Vigo.\" No sail appeared in sight during the day. \"I should think we cannot have come as far west as we calculated,\" Terence said, \"or we ought to have seen vessels in the distance; however, we will keep due south. It will be better to strike the coast of Spain, and have to run along the shore round Cape Finisterre, than to risk missing land altogether.\" That night they kept regular watches. The wind was very light now, and they were not going more than two knots an hour through the water. Ryan was steering when morning broke. \"Wake up, Terence!\" he exclaimed suddenly, \"here is a ship within a mile or so of us. As she is a lugger, I am afraid she is a French privateer.\" Terence sprang to his feet. The light was still faint, but he felt sure that his companion was right, and that the vessel was a French privateer. \"We have put our foot in it now, and no mistake,\" Ryan said. \"It is another French prison and, this time, without a friendly soldier to help us to get out.\" \"It looks like it, Dicky. In another hour it will be broad daylight, and they cannot help seeing us. Still, there is a hope for us. We must give out that we are Spanish fishermen, who have been blown off the coast. It is not likely they have anyone on board that speaks Spanish, and our Portuguese will sound all right in their ears; so very likely, after overhauling us, they will let us go on our way. At any rate, it is of no use trying to escape; we will hold on our course for another few minutes, and then head suddenly towards her, as if we had only just seen her. I will hail her in Portuguese, and they are sure to tell us to come on board; and then I will try to make them understand by signs, and by using a few French words, that we have been blown out to sea by the gale, and want to know the course for Santander. As the French have been there for some time, it would be natural enough for us to have picked up a little of their language.\" In a few minutes they altered their course and sailed towards the lugger, which also soon turned towards them. When they approached within the vessel\u0027s length, Terence stood up, and shouted in Portuguese: \"What is the bearing of Santander?\" The reply was in French, \"Come alongside!\" given with a gesture of the arm explaining the words. They let the sail run down as they came alongside. Terence climbed up, by the channels, to the deck. \"Espagnol,\" he said to the captain, who was standing close to him as he jumped down on to the deck; \"Espagnoles, Capitaine; Poisson, Santander; grand tempete,\" and he motioned with his arms to signify that they had been blown offshore at Santander. Then he pointed in several directions towards the south, and looked interrogatively. \"They are Spanish fishermen who have been blown off the coast,\" the captain said to another officer. \"They have been lucky in living it out. Well, we are short of hands, having so many away in prizes; and the boat will be useful, in place of the one we had smashed up in the gale. Let a couple of men throw the nets and things overboard, and then run her up to the davits.\" Then he said to Terence: \"Prisoners! Go forward and make yourself useful;\" and he pointed towards the forecastle. Terence gave a yell of despair, threw his hat down on the deck and, in a volley of Portuguese, begged the captain to let them go. The latter, however, only waved his hand angrily; and two sailors, coming up, seized Terence by the arms and dragged him forward. Ryan was called upon deck, and also ordered forward. He too remonstrated, but was cut short by a threatening gesture from the captain. For a time they preserved an appearance of deep dejection, Terence tugging his hair as if in utter despair, till Ryan whispered: \"For heaven\u0027s sake, Terence, don\u0027t go on like that, or I shall break out in a shout of laughter.\" \"It is monstrous, it is inhuman!\" Terence exclaimed, in Portuguese. \"Thus to seize harmless fishermen, who have so narrowly escaped drowning; the sea is less cruel than these men. They have taken our boat, too, our dear good boat. What will our mothers think, when we do not return? That we have been swallowed up by the sea. How they will watch for us, but in vain!\" Fortunately for the success of their story, the lugger hailed from a northern French port and, as not one on board understood either Spanish or Portuguese, they had no idea that the latter was the language in which the prisoners were speaking. After an hour of pretended despair, both rose from the deck on which they had been sitting and, on an order being given to trim the sails, went to the ropes and aided the privateersmen to haul at them and, before the end of the day, were doing duty as regular members of the crew. \"They are active young fellows,\" the captain said to his first mate, as he watched the supposed Spaniards making themselves useful. \"It was lucky for them that they had a fair store of provisions and water in their boat. We are very short handed, and they will be useful. I would have let them go if it had not been for the boat but, as we have only one left that can swim, it was too lucky a find to give up.\" The craft had been heading north when Ryan had first seen her, and she held that course all day. Terence gathered from the talk of the sailors that they were bound for Brest, to which port she belonged. The Frenchmen were congratulating themselves that their cruise was so nearly over, and that it had been so successful a one. From time to time a sailor was sent up into the cross trees, and scanned the horizon to the north and west. In the afternoon he reported that he could make out the upper sails of a large ship going south. The captain went up to look at her. \"I think she is an English ship of war,\" he said, when he descended to the deck, \"but she is a long way off. With this light wind we could run away from her. She will not trouble herself about us. She would know well enough that she could not get within ten miles of us, before it got dark.\" This turned out to be the case, for the lookout from time to time reported that the distant sail was keeping on her course, and the slight feeling of hope that had been felt by Terence and Ryan faded away. They were placed in the same watch, and were below when, as daylight broke, they heard sudden exclamations, tramping of feet overhead, and a moment later the watch was summoned on deck. \"I hope that they have had the same luck that we had, and have run into the arms of one of our cruisers,\" Terence whispered in Portuguese to Ryan, as they ran up on deck together. As he reached the deck the boom of a cannon was heard, and at the same instant a ball passed through the mainsail. Half a mile away was a British sloop of war. She had evidently made out the lugger before the watch on board the latter had seen her. The captain was foaming with rage, and shouting orders which the crew hurried to execute. On the deck near the foremast lay the man who had been on the lookout, and who had been felled with a handspike by the captain when he ran out on deck, at the first alarm. Although at first flurried and alarmed, the crew speedily recovered themselves, and executed with promptitude the orders which were given. There was a haze on the water, but a light wind was stirring, and the vessel was moving through the water at some three knots an hour. As soon as her course had been changed, so as to bring the wind forward of the beam, which was her best point of sailing, the men were sent to the guns; the first mate placing himself at a long eighteen pounder, which was mounted as a pivot gun aft, a similar weapon being in her bows. All this took but four or five minutes, and shot after shot from the sloop hummed overhead. The firing now ceased, as the change of course of the lugger had placed the sloop dead astern of her; and the latter was unable, therefore, to fire even her bow chasers without yawing. It was now the turn of the lugger. The gun in the stern was carefully trained and, as it was fired, a patch of white splinters appeared in the sloop\u0027s bulwarks. A cheer broke from the French. The effect of the shot, which must have raked her from stem to stern, was at once evident. The sloop bore off the wind, until her whole broadside could be seen. \"Flat on your faces!\" the captain shouted. There was a roar of ten guns, and a storm of shot screamed overhead. Four of them passed through the sails. One ploughed up the deck, killing two sailors and injuring three others with the splinters. Two or three ropes of minor importance were cut, but no serious damage inflicted. The crew, as they leapt to their feet, gave a cheer. They knew that, with this light wind, their lugger could run away from the heavier craft; and that the latter could only hope for success by crippling her. \"Steady with the helm!\" the captain went on, as the pivot gun was again ready to deliver its fire. \"Wait till her three masts show like one. \"Jacques, aim a little bit higher. See if you cannot knock away a spar.\" The sloop was coming up again to the wind and, as she was nearly stem on, the gun cracked out again. A cheer broke from the lugger as her opponent\u0027s foretop mast fell over her side, with all its hamper. Round the sloop came, and delivered the other broadside. Two shots crashed through the bulwarks, one of them dismounting a gun which, in its fall, crushed a man who had thrown himself down beside it. Another shot struck the yard of the foresail, cutting it asunder; and the lugger at once ran up into the wind. \"Lower the foresail!\" the captain shouted. \"Quick, men! and lash a spare spar to the yard. They are busy cutting away their topmast, but we shall be off again before they are ready to move. They have lost nearly half a mile; we shall soon be out of range. Be sharp with that gun again!\" The sloop had indeed fallen greatly astern while delivering her broadsides; but her commander had evidently seen that, unless the wind sprang up, the lugger would get away from him unless he could cripple her; and that she might seriously damage him, and perhaps knock one of the masts out of him by her stern chaser. His only chance, therefore, of capturing her was to take a spar out of her. He did not attempt to come about again, after firing the second broadside; but kept up his fire as fast as his guns could be loaded. The lugger, however, was stealing rapidly away from him and, in ten minutes, had increased her lead by another half mile, without having suffered any serious damage; and the sloop soon ceased fire, as she was now almost out of range. Seven or eight of the crew had been more or less injured by splinters but, with the exception of the three killed, none were badly hurt. The lugger was now put on her former course, the guns lashed into their places again, and the three men killed sewn up in hammocks and laid between two of the guns, in order to be handed to their friends on arrival in port. \"That is another slip between the cup and the lip,\" Terence remarked to his companion, as the sloop ceased firing. \"I certainly thought, when we came on deck, that our troubles were over. I must say for our friend, the French captain, he showed himself a good sailor, and got out of the scrape uncommonly well.\" \"A good deal too well,\" Ryan grumbled; \"it was very unpleasant while it lasted. It is all very well to be shot at by an enemy, but to be shot at by one\u0027s friends is more than one bargained for.\" The coolness under fire displayed by the two Spaniards he had carried off pleased the captain, who patted them on the shoulder as he came along, his good temper being now completely restored by his escape. \"You are brave fellows,\" he said, \"and will make good privateersmen. You cannot do better than stay with us. You will make as much money, in a month, as you would in a year\u0027s fishing.\" Terence smiled vaguely, as if he understood that the captain was pleased with them, but did not otherwise catch his meaning. They arrived at Brest without further adventure. As they neared the port, the captain asked Terence if he and his companion would enter upon the books of the privateer and after much difficulty made, as he believed, Terence understand his question. The latter affected to consult Ryan, and then answered that they would be both willing to do so. The captain then put the names they gave him down on the ship\u0027s roll, and handed each of them a paper, certifying that Juan Montes and Sebastian Peral belonged to the crew of the Belle Jeanne, naming the rate of wages that they were to receive, and their share in the value of the prizes taken. He then gave them eighty francs each, as an advance on their pay from the date of their coming on board, and signified to them that they must buy clothes similar to those worn by the crew, instead of the heavy fishermen\u0027s garments they had on. \"They will soon learn our language,\" he said to the mate, \"and I am sure they will make good sailors. I have put down their wages and share of prize money at half that of our own men, and I am sure they will be well worth it, when they get to speak the language and learn their duties.\" As soon as they were alongside, the greater portion of the men went ashore and, in the evening, the boatswain landed with Terence and Ryan, and proceeded with them to a slop shop, where he bought them clothes similar to those worn by the crew. Beyond the fact that these were of nautical appearance, there was no distinctive dress. They then returned to the lugger and changed their clothes at once, the boatswain telling them to stow away their boots and other things, as these would be useful to them in bad weather. The next day the privateer commenced to unload, for the most valuable portions of the cargoes of the captured ships had been taken on board when the vessels themselves, with the greater portion of the goods they carried, had been sent into port under the charge of prize crews. They remained on board for ten days, going freely into the town, sometimes with the sailors and sometimes alone. Terence pretended to make considerable progress in French, and was able, though with some difficulty, to make himself understood by the crew. The first mate had gone with them to the mairie, where the official stamp had been affixed to their ship papers. They found that no questions were asked of persons entering or leaving the town, on the land side; and twice strolled out and went some distance into the country. They had agreed that it would be better to defer any attempt to escape until the day before the lugger sailed, as there would then be but little time for the captain to make inquiries after them, or to institute a search. They bought a pocket map of the north of France, and carefully studied the roads. \"It is plain enough what our best course is, Dick. We must go along this projecting point of Brittany through Dinan to Avranches, and then follow the coast up till we get to Coutances. You see it is nearly opposite Jersey, and that island does not look to be more than fifteen miles away so that, if we can get hold of a boat there, we should be able to run across in three hours or so, with favourable wind.\" \"That looks easy enough,\" Ryan agreed. \"It seems to be about one hundred and twenty miles from here to Avranches, and another thirty or forty up to Coutances, so we should do it in a week, easily. What stories shall we make up, if we are questioned?\" \"I don\u0027t suppose the peasants we may meet on the road are likely to question us at all, for most of the Bretons speak only their own language. We had better always sleep out in the open. If we do run across an official, we can show our papers and give out that we have been ill treated on board the lugger, and are going to Saint Malo, where we mean to ship on another privateer. I know that is a port from which lots of them sail. I don\u0027t think we shall have any difficulty in buying provisions at small villages. My French will pass muster very well in such places, and I can easily remark that we are on our way to Saint Malo to join a ship there and, if any village functionary questions us, these papers will be good enough for him. \"Or we can say that we got left ashore by accident, when our craft sailed from Brest, and are going to rejoin her at Saint Malo, where she was going to put in. I think, perhaps, that that would be a better story than that we had run away. I don\u0027t know that the authorities interest themselves in runaway seamen from privateers but, at any rate, it is a likely tale. Drunken seamen, no doubt, often do get left ashore.\" \"Yes, that would be a very good story, Terence, and I think that there would be no great fear, even if we were to go boldly into a town.\" \"I don\u0027t think there would; still, it is better to be on the safe side, and avoid all risks.\" Accordingly, the afternoon before the Belle Jeanne was to sail they went ashore, bought enough bread and cold meat to last them for a couple of days; and two thick blankets, as it was now November and the nights were bitterly cold; and then left the town and followed the road for Dinan. On approaching the village of Landerneau they left the road, and lay down until it was quite dark. Then they made a detour through the fields, round the village, came down on the road again, walked all night--passing through Huelgoat--and then, as morning was breaking they left the road again and, after going a quarter of a mile through the fields, lay down in a dry ditch by the side of a thick hedge, ate a meal, and went to sleep. They did not start again until it was getting dusk, when they returned to the road, which they followed all night. In the morning they went boldly into a little village, and Terence went into a shop and bought a couple of loaves. His French was quite good enough for so simple an operation. \"I suppose you are going to Saint Malo,\" the woman said. \"Yes. We have had a holiday to see some friends at Brest, and are going to rejoin.\" This was the only question asked and, after walking another two miles, they lay up for the day as before. They had met several peasants on the road, and had exchanged salutations with them. They found by their map that they were now within twenty miles of Dinan, having made over thirty miles each night and, as both were somewhat footsore from their unaccustomed exercise, they travelled only some sixteen or seventeen miles the following night. The next evening, at about ten o\u0027clock, they walked boldly through Dinan. Most of the inhabitants were already asleep, and the few who were still in the streets paid no heed to two sailors; going, they had no doubt, to Saint Malo. Crossing the river Rance by the bridge, they took the road in the direction of the port but, after following it for a mile or two, struck off to the east and, before morning, arrived on the river running up from the bay of Mount Saint Michaels. They lay down until late in the afternoon, and then crossed the river at a ferry, and kept along by the coast until they reached the Sebine river. \"We are getting on first rate,\" Ryan said, as they lay down for a few hours\u0027 sleep. \"We have only got Avranches to pass, now.\" \"I hope we sha\u0027n\u0027t be questioned at all, Dick, for we have now no good story to tell them; for we are going away from Saint Malo, instead of to it. Of course, as long as they don\u0027t question us we are all right. We are simply two sailors on our way home for a time; but if we have to show our papers, with those Spanish names on them, we should be in a fix. Of course, we might have run away from our ship at Saint Malo, but that would not explain our coming up this way. However, I hope my French is good enough to answer any casual questions without exciting attention. We will cross by the ferry boat, as soon as it begins to ply and, as Avranches stands some little distance up the river, we can avoid it altogether by keeping along the coastline.\" A score of peasants had assembled by the time the ferry boat man made his appearance from his cottage, and Terence and his companion, who had been lying down 200 yards away, joined them just as they were going down to the boat. \"You are from Saint Malo, I suppose?\" an old peasant said to Terence. The latter nodded. \"We have got a month\u0027s leave from our ship,\" he said. \"She has been knocked about by an English cruiser, and will be in the shipwright\u0027s hands for five or six weeks, before she is ready for sea again.\" \"You are not from this part of the country,\" the peasant, who was speaking in the patois of Normandy, remarked. \"No, we come from the south; but one of our comrades comes from Cherbourg and, as he cannot get away, we are going to see his friends and tell them that he is well. It is a holiday for us, and we may as well go there as anywhere else.\" The explanation was simple enough for the peasant, and Terence continued chatting with him until they landed. \"You do not need to go through Avranches,\" the latter said. \"Take the road by the coast through Granville to Coutances.\" \"How far is it to Coutances?\" \"About twenty miles. At least, so I have heard, for I have never been there.\" After walking a few miles, they went down on to the seashore and lay down among some rocks until evening. At eight o\u0027clock they started again and walked boldly through Granville, where their sailor\u0027s dress would, they felt sure, attract no attention. It was about nine o\u0027clock when they entered the place. Their reason for doing so at this hour was that they wished to lay in a stock of provisions, as they did not intend to enter Coutances until late at night; when they hoped to be able to get hold of a boat, at once. They had just made their purchases when they met a fat little man, with a red sash--which showed him to be the Maire of the place, or some other public functionary. \"Where are you going, and what ship do you belong to?\" he asked pompously. \"We are sailors on our way from Saint Malo to Cherbourg,\" Terence replied. \"You have papers, of course?\" \"Of course, Monsieur le Maire.\" \"I must see them,\" the Maire said. \"Come with me to my house, close by.\" There were several persons near, and a man in civil uniform was with the Maire. Therefore Terence gave an apparently willing assent and, followed by the functionary, they went into a house close by. A lamp was burning on the table in the hall. \"Light these candles in my office,\" the Maire said. \"The women have gone up to bed.\" The man turned a key, went in and, bringing out two candles, lighted them at the lamp; and they then went into the room. The Maire seated himself in an armchair at the table. The minor functionary placed the two suspected persons on the side facing him, and took his place standing by their side. As they were going in, Terence whispered: \"If there is trouble, I will take this fellow, and you manage the Maire.\" \"Now,\" that functionary said, \"let me see your papers. \"Why,\" he exclaimed, looking at the names, \"you are not Frenchmen!\" \"No,\" Terence said quietly. \"We do not pretend to be but, as you see, we are sailors who have done service on board a French privateer.\" \"But where is this privateer?\" \"I don\u0027t know, Monsieur le Maire. We were not satisfied with our treatment, so we left her at Brest.\" \"This is very serious,\" the Maire said. \"You are Spaniards. You have deserted your ship at Brest. You have travelled a hundred and fifty miles through France, and now what are you doing here?\" \"We are, as you say, monsieur, travelling through France. We desire to see France. We have heard that it is the greatest country in the world. Frenchmen visit Spain in large numbers. Why should not Spaniards visit France?\" The tone of sarcasm in which Terence spoke was not lost upon the Maire, who rose from his seat, purple with anger. \"You will take these men into custody,\" he said to his assistant. \"This is a very grave business.\" \"Now, Dick!\" Terence exclaimed and, turning to the man who stood next to him, he grasped him suddenly by the throat. At the same moment Ryan caught up a heavy inkstand and threw it across the table at the Maire, striking that functionary in the stomach, and doubling him completely up. Then he ran round the table and bound the man--who had not yet recovered his breath--tightly in his chair, and thrust his handkerchief into his mouth. The man whom Terence was holding had scarcely struggled. Terence, as he gripped him, had said, \"Keep quiet or I will choke you!\" and the prisoner felt that his assailant could do so in a moment, if he chose. His hands were fastened tightly behind him, with his own belt, by Ryan. A short ruler was thrust between his teeth, and fastened there by a handkerchief going round the back of his head. \"So far so good, Dick. Now look round for something with which we can bind them more firmly.\" Several hanks of red tape lay upon the table. With a portion of one of these, the back of the chair in which the Maire sat was lashed to the handle of a heavy bureau. Then his feet were fastened to the two legs of the chair, so that he could neither kick nor upset himself. The other man was then fastened as securely. This done they blew out the candles, left the room, locked the door behind them--taking the key--and then sallied out into the street. \"That was a good shot of yours with the inkstand,\" Terence said. \"I had my eye on it, all the time he was speaking,\" Ryan replied. \"I saw that, if I were to move to get round the table at him, the little man would have time to shout; but that if I could hit him in the wind, it would be all right.\" \"Well, there must be no more stopping, now. I don\u0027t know whether there is a Mrs. Maire; if not, there will certainly be no alarm until morning. If there is, it depends upon what sort of woman she is as to how long a start we shall get. If she is a sleepy woman she is probably dreaming by this time, and may not discover until morning that her lord and master is not by her side. If she is a bad-tempered woman, she will probably lie for an hour or two, thinking over what she shall say to him when he comes in. If she is a nervous woman, she will get up and go downstairs. \"I left the lamp burning in the hall on purpose. Seeing it there, she will naturally think that he has not come in, and will go upstairs again for an hour or two; then she will probably call up the servants, and may send them out to look for him; finally, she may go to the police office and wake up a constable. It is not probable there are any of them on night duty, in a quiet place like this. Altogether, I calculate that it will be at least four hours before they think of breaking open the door of the office, to see if he is there; so at the worst we have got four hours\u0027 start; at the best, ten hours. \"It is only half-past nine now. We shall be at the mouth of the Sienne in three hours, or less. It does not look above nine or ten miles on the map and, directly we get fairly out of the town, we will go as quickly as we can, for every minute is of importance. \"If we can get hold of a boat at once, we ought to be at Jersey soon after daybreak; although I am not very sure of that, for I believe there are all sorts of strong currents along this coast. I remember one of the officers saying so, as we came down the Channel on the voyage out. Of course, it will make a difference whether we can get a boat with a sail, or not. If we cannot find a boat, we shall have to hide up; but you may be sure that there will be a hot search for us in the morning, and we must get off tonight, if we can. Most likely there is a fishing village somewhere near the mouth of the river.\" As soon as they were out of the town they broke into a trot; which they continued, with scarcely any intermission, until they approached a small village. \"I expect this stands on the bank of the river,\" Terence said. \"There is no chance of anyone being up, so we can go through fearlessly.\" A couple of hundred yards farther they reached the river. A large ferry boat was moored here. Keeping along the bank to the left, they were not long before they came upon several boats hauled up on the shore; while three or four others lay at their moorings, a short distance out. \"Thank goodness,\" Terence exclaimed. \"We shall have no difficulty, now!\" They selected the boat lying nearest the water\u0027s edge. The moon was half full, but was now sinking towards the west. Its light, however, was of some assistance to them. There was a mast and sail in the boat, as well as a pair of oars. At first they were unable to move her down to the water but, getting some oars out of the other boats, they laid them down as rollers and, with these, managed after great exertions to get her afloat. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3144/86394.html","bookId":811,"book":{"id":811,"title":"Under Wellington\u0027s Command","description":"简介： As many boys into whose hands the present volume may fall will not have read my last year\u0027s book, With Moore in Corunna, of which this is a continuation, it is necessary that a few words should be said, to enable them to take up the thread of the sto...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3144","creation":"Aug 1, 2019 12:19:35 AM","modification":"Aug 1, 2019 12:19:35 AM"}}
