{"id":30909,"no":14,"title":"CHAPTER FOURTEEN","content":"The first morning in any new environment is always the most exciting. Gissing was already awake, and watching the novel sight of a patch of sunshine sliding to and fro on the deck of the chart-room, when there was a gentle tap at the door. The Captain\u0027s steward entered, carrying a handsome uniform. “Six bells, sir,” he said. “Your bath is laid on.” Gissing was not very sure just what time it was, but the steward held out a dressing gown for him to slip on, so he took the hint, and followed him to the Captain\u0027s private bathroom where he plunged gaily into warm salt water. He was hardly dressed before breakfast was laid for him in the chart-room. It was a breakfast greatly to his liking—porridge, scrambled eggs, grilled kidneys and bacon, coffee, toast, and marmalade. Evidently the hardships of sea life had been greatly exaggerated by fiction writers. He was a trifle bashful about appearing on the bridge in his blue and brass formality, and waited a while thinking Captain Scottie might come. But no one disturbed him, so by and bye he went out. It was a brisk morning with a fresh breeze and plenty of whitecaps. Dancing rainbows hovered about the bow when an occasional explosion of spray burst up into sunlight. Mr. Pointer was on the bridge, still gazing steadily into the distance. He saluted Gissing, but said nothing. The quartermaster at the wheel also saluted in silence. A seaman wiping down the paintwork on the deckhouse saluted. Gissing returned these gestures punctiliously, and began to pace the bridge from side to side. He soon grew accustomed to the varying slant of the deck, and felt that his footing showed a nautical assurance. Now for the first time he enjoyed an untrammelled horizon on all sides. The sea, he observed, was not really blue—not at any rate the blue he had supposed. Where it seethed flatly along the hull, laced with swirls of milky foam, it was almost black. Farther away, it was green, or darkly violet. A ladder led to the top of the charthouse, and from this commanding height the whole body of the ship lay below him. How alive she seemed, how full of personality! The strong funnels, the tall masts that moved so delicately against the pale open sky, the distant stern that now dipped low in a comfortable hollow, and now soared and threshed onward with a swimming thrust, the whole vital organism spoke to the eye and the imagination. In the centre of this vast circle she moved, royal and serene. She was more beautiful than the element she rode on, for perhaps there was something meaningless in that pure vacant round of sea and sky. Once its immense azure was grasped and noted, it brought nothing to the mind. Reason was indignant to conceive it, sloping endlessly away. The placid, beautifully planned routine of shipboard passed on its accustomed course, and he began to suspect that his staff-captaincy was a sinecure. Down below he could see the passengers briskly promenading, or drowsing under their rugs. On the hurricane deck, aft, a sailor was chalking a shuffleboard court. It occurred to him that all this might become monotonous unless he found some actual part in it. Just then Captain Scottie appeared on the bridge, took a quick look round, and joined him on top of the charthouse. “Good morning!” he said. “You won\u0027t think me rude if you don\u0027t see much of me? Thinking about those ideas of yours, I have come upon some rather puzzling stuff. I must work the whole thing out more clearly. Your suggestion that Conscience points the way to an integration of personality into a higher type of divinity, seems to me off the track; but I haven\u0027t quite downed it yet. I\u0027m going to shut myself up to-day and consider the matter. I leave you in charge.” “I shall be perfectly happy,” said Gissing. “Please don\u0027t worry about me.” “You suggest that all the conditions of life at sea, our mastery of the forces of Nature, and so on, seem to show that we have perfect freedom of will, and adapt everything to our desires. I believe just the contrary. The forces of Nature compel us to approach them in their own way, otherwise we are shipwrecked. It is in the conditions of Nature that this ship should reach port in eight days, otherwise we should get nowhere. We do it because it is our destiny.” “I am not so sure of that,” said Gissing. But the Captain had already departed with a clouded brow. On the chart-room roof Gissing had discovered an alluring instrument, the exact use of which he did not know. It seemed to be some kind of steering control. The dial was lettered, from left to right, as follows HARD A PORT, PORT, STEADY, COURSE, STEADY, STARBD, HARD A STARBD. At present the handle stood upon the section marked COURSE. After a careful study of the whole seascape, it seemed to Gissing that off to the south the ocean looked more blue and more interesting. After some hesitation he moved the handle to the PORT mark, and waited to see what would happen. To his delight he saw the bow swing slowly round, and the Pomerania\u0027s gleaming wake spread behind her in a whitened curve. He descended to the bridge, a little nervous as to what Mr. Pointer might say, but he found the Mate gazing across the water with the same fierce and unwearying attention. “I have changed the course,” he said. Mr. Pointer saluted, but said nothing. Having succeeded so far, Gissing ventured upon another innovation. He had been greatly tempted by the wheel, and envied the stolid quartermaster who was steering. So, assuming an air of calm certainty, he entered the wheelhouse. “I\u0027ll take her for a while,” he said. “Aye, aye, sir,” said the quartermaster, and surrendered the wheel to him. “You might string out a few flags,” Gissing said. He had been noticing the bright signal buntings in the rack, and thought it a pity not to use them. “I like to see a ship well dressed,” he added. “Aye, aye, sir,” said Dane. “Any choice, sir?” Gissing picked out a string of flags which were particularly lively in colour-scheme, and had them hoisted. Then he gave his attention to the wheel. He found it quite an art, and was surprised to learn that a big ship requires so much helm. But it was very pleasant. He took care to steer toward patches of sea that looked interesting, and to cut into any particular waves that took his fancy. After an hour or so, he sighted a fishing schooner, and gave chase. He found it so much fun to run close beside her (taking care to pass to leeward, so as not to cut off her wind) that a mile farther on he turned and steered a neat circle about the bewildered craft. The Pomerania\u0027s passengers were greatly interested, and lined the rails trying to make out what the fishermen were shouting. The captain of the schooner seemed particularly agitated, kept waving at the signal flags and barking through a megaphone. During these manoeuvres Mr. Pointer gazed so hard at the horizon that Gissing felt a bit embarrassed. “I thought it wise to find out exactly what our turning-circle is,” he said. Mr. Pointer saluted. He was a well-trained officer. Late in the afternoon the Captain reappeared, looking more cheerful. Gissing was still at the helm, which he found so fascinating he would not relinquish it. He had ordered his tea served on a little stand beside the wheel so that he could drink it while he steered. “Hullo!” said the Captain. “I see you\u0027ve changed the course.” “It seemed best to do so,” said Gissing firmly. He felt that to show any weakness at this point would be fatal. “Oh, well, probably it doesn\u0027t matter. I\u0027m coming round to some of your ideas.” Gissing saw that this would never do. Unless he could keep the master disturbed by philosophic doubts, Scottie would expect to resume command of the ship. “Well,” he said, “I\u0027ve been thinking about it, too. I believe I went a bit too far. But what do you think about this? Do you believe that Conscience is inherited or acquired? You sea how important that is. If Conscience is a kind of automatic oracle, infallible and perfect, what becomes of free will? And if, on the other hand, Conscience is only a laboriously trained perception of moral and social utilities, where does your deity come in?” Gissing was aware that this dilemma would not hold water very long, and was painfully impromptu; but it hit the Captain amidships. “By Jove,” he said, “that\u0027s terrible, isn\u0027t it? It\u0027s no use trying to carry on until I\u0027ve got that under the hatch. Look here, would you mind, just as a favour, keep things going while I wrestle with that question?—I know it\u0027s asking a lot, but perhaps—” “It\u0027s quite all right,” Gissing replied. “Naturally you want to work these things out.” The Captain started to leave the bridge, but by old seafaring habit he cast a keen glance at the sky. He saw the bright string of code flags fluttering. He seemed startled. “Are you signalling any one?” he asked. “No one in particular. I thought it looked better to have a few flags about.” “I daresay you\u0027re right. But better take them down if you speak a ship. They\u0027re rather confusing.” “Confusing? I thought they were just to brighten things up.” “You have two different signals up. They read, Bubonic plague, give me a wide berth. Am coming to your assistance.” Toward dinner time, when Gissing had left the wheel and was humming a tune as he walked the bridge, the steward came to him. “The Captain\u0027s compliments, sir, and would you take his place in the saloon to-night? He says he\u0027s very busy writing, sir, and would take it as a favour.” Gissing was always obliging. There was just a hint of conscious sternness in his manner as he entered the Pomerania\u0027s beautiful dining saloon, for he wished the passengers to realize that their lives depended upon his prudence and sea-lore. Twice during the meal he instructed the steward to bring him the latest barometer reading; and after the dessert he scribbled a note on the back of a menu-card and had it sent to the Chief Engineer. It said:— Dear Chief: Please keep up a good head of steam to-night. I am expecting dirty weather. MR. GISSING, (Staff-Captain) What the Chief said when he received the message is not included in the story. But the same social aplomb that had made Gissing successful as a floorwalker now came to his rescue as mariner. The passengers at the Captain\u0027s table were amazed at his genial charm. His anecdotes of sea life were heartily applauded. After dinner he circulated gracefully in the ladies\u0027 lounge, and took coffee there surrounded by a chattering bevy. He organized a little impromptu concert in the music room, and when that was well started, slipped away to the smoke-room. Here he found a pool being organized as to the exact day and hour when the Pomerania would reach port. Appealed to for his opinion, he advised caution. On all sides he was in demand, for dancing, for bridge, for a recitation. At length he slipped away, pleading that he must keep himself fit in case of fog. The passengers were loud in his praise, asserting that they had never met so agreeable a sea-captain. One elderly lady said she remembered crossing with him in the old Caninia, years ago, and that he was just the same then. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3211/87684.html","bookId":725,"book":{"id":725,"title":"Where the Blue Begins","description":"简介： Gissing lived alone (except for his Japanese butler) in a little house in the country, in that woodland suburb region called the Canine Estates. He lived comfortably and thoughtfully, as bachelors often do. He came of a respectable family, who had al...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3211","creation":"Aug 1, 2019 12:19:12 AM","modification":"Aug 1, 2019 12:19:12 AM"}}
