[{"id":2686,"title":"Lawless","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eLawless (Love by Design: Jack\u0027s Stories 0.5) \u003c/p\u003e\n \u003cp\u003eFilled with Nora\u0027s exquisite storytelling and memorable characters, this rare Western historical romance is a unique treat for Nora\u0027s many fans. Lawless is editorially connected to Loving Jack and Best Laid Plans, which will be published in September 2003 in Love by Design.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/lawless.jpg","author":"Nora Roberts","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2687,"title":"Shoulda Been a Cowboy (Rough Riders #7)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eShoulda Been a Cowboy (Rough Riders #7) \u003c/p\u003e\n \u003cp\u003eThe bigger they are, the harder they fall--in love. \u003c/p\u003e\n \u003cp\u003eSoldier Cameron McKay has found his niche, and it ain\u0027t ropin\u0027 steers and wearin\u0027 spurs. His deputy sheriff job, plus battle injuries that ended his military career, keep him right where he wants to be: Off the ranch and away from his family\u0027s pity. His darkest war memories are on lockdown, leaving him skeptical he\u0027ll ever find a woman who wants a man who\u0027s less than whole. \u003c/p\u003e\n \u003cp\u003eDomini Katzinski has had to control every aspect of her life since age eleven, when she was orphaned in the Ukraine. Watching others\u0027 relationships crumble has convinced her to focus on the short-term and find a take-charge man to whom she can relinquish total sexual control. Cam fits the bill: gorgeous, with a brooding vulnerability no one else seems to see. Plus, he has his own handcuffs. \u003c/p\u003e\n \u003cp\u003eOnce Cam gets over his surprise that sweet, shy Domini wants to be dominated, he is back to issuing orders. Their passion is as hot as a rocket-propelled grenade--and if Domini has her way, it\u0027s a one-shot deal. Cam wants more, and launches a full-out sensual assault...until tragedy strikes, forcing him to change tactics as he tries to keep past demons from blowing their future together all to hell...\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/shoulda-been-a-cowboy-rough-riders-7.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2688,"title":"All Jacked Up (Rough Riders #8)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eAll Jacked Up (Rough Riders #8) \u003c/p\u003e\n \u003cp\u003ePulling off the ultimate con...if they can keep from pulling off their clothes \u003c/p\u003e\n \u003cp\u003eKeely McKay knows Jack and Jack Donohue is a certified pain in her Wranglers. The lone girl in the prolific McKay family, Keely needs another man giving her orders like she needs a hole in her boot. What she does need is a restoration specialist so she can open her physical therapy clinic and prove she\u0027s left her wild-child days behind. That means dealing with buttoned-down, uptight Jack. \u003c/p\u003e\n \u003cp\u003eJack is this close to securing a career make-or-break project, until he learns his lack of marital status puts him out of contention. When the notoriously hot-tempered and hot-bodied Keely begs him for help, he proposes a crazy idea. He\u0027ll oversee her project if she acts the part of his loving fiance. \u003c/p\u003e\n \u003cp\u003eTheir sizzling lust makes it all too easy to go from butting heads to knocking boots but outside the bedroom they\u0027re as mismatched as ever. The McKays remind Jack of the humble upbringing he left behind, and cowgirl Keely feels she doesn\u0027t measure up to Jack\u0027s big-city lifestyle. \u003c/p\u003e\n \u003cp\u003eWhen the dust settles, Jack and Keely must face the fact they\u0027re not fooling anyone but themselves or they\u0027ll risk losing the real deal. \u003c/p\u003e\n \u003cp\u003eWarning: this book contains one hot-blooded cowgirl and one cool-headed businessman in a stripped-down, revved-up game of sexual truth or dare.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/all-jacked-up-rough-riders-8.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2689,"title":"Raising Kane (Rough Riders #9)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eRaising Kane (Rough Riders #9) \u003c/p\u003e\n \u003cp\u003eShe surrendered the reins. Now he\u0027s raising the stakes. \u003c/p\u003e\n \u003cp\u003eWhen a patch of ice sends attorney Ginger Paulson head-over-high-heels down a flight of stairs, she has no one to care for her young son and her invalid father - until lethally sexy Kane McKay shows up at the hospital, determined to prove his cowboy chivalry. Past experience has inoculated her against take-charge men, but even Ginger isn\u0027t immune to Kane\u0027s invasive charm and Built Ford Tough body. \u003c/p\u003e\n \u003cp\u003eFor two years rancher Kane McKay has followed the Little Buddies mentoring program\u0027s cardinal rule - hands off his Little Buddy Hayden\u0027s mama. But one look at Ginger\u0027s bruised body and Kane is through watching the stubborn woman take care of everyone but herself. The feisty, curvy redhead needs his help, and he\u0027ll give her the hands-on type whether she likes it or not. \u003c/p\u003e\n \u003cp\u003eAfter Kane throws out doctor\u0027s orders and issues his own demands - her full sexual submission - Ginger realizes Kane\u0027s caring nature extends beyond just fulfilling her physical needs. \u003c/p\u003e\n \u003cp\u003eCan the former hell-raiser convince the gun-shy single mom to look beyond his past - toward a shared future? \u003c/p\u003e\n \u003cp\u003eWarning: Contains one sweet and hot hunk of cowboy manflesh who uses every sexual trick in the book to render a sassy, fast-talking attorney speechless and put a new twist on the term \"binding arbitration\".\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/raising-kane-rough-riders-9.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2690,"title":"Slow Ride (Rough Riders #9.5)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eSlow Ride (Rough Riders #9.5) \u003c/p\u003e\n \u003cp\u003eA Rough Riders free read. \u003c/p\u003e\n \u003cp\u003eKeely McKay Donohue is enduring the longest wedding reception of her life: her own. The only saving grace is that Jack Donohue is finally hers. Usually her hunky man gives her everything she wants, so why is her groom denying her the one thing she wants right now? \u003c/p\u003e\n \u003cp\u003eJack thought his secretive wait-for-the-honeymoon plan was romantic, until he realizes he\u0027s only put Keely in a fighting mood. If he wants to get back on his temperamental bride\u0027s good side, he\u0027d better find a way to sweep his cowgirl off her boots...fast.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/slow-ride-rough-riders-9-5.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2691,"title":"Cowgirls Don\u0027t Cry (Rough Riders #10)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eCowgirls Don\u0027t Cry (Rough Riders #10) \u003c/p\u003e\n \u003cp\u003eGood girls can play rough too... \u003c/p\u003e\n \u003cp\u003eRough Riders, Book 10 \u003c/p\u003e\n \u003cp\u003eJessie McKay has accepted her marriage to Luke McKay wasn\u0027t perfect. After two years of widowhood, she\u0027s ready to kick up her bootheels-until Luke\u0027s younger brother shows up to spoil her fun. But if Brandt thinks she\u0027ll ever take orders from another McKay male, he\u0027s got manure for brains. \u003c/p\u003e\n \u003cp\u003eBrandt McKay has avoided his sweet, sexy sister-in-law ever since the night he confessed his feelings for her weren\u0027t the brotherly type. Unexpectedly faced with proof of Luke\u0027s infidelity, Brandt is forced to ask for Jessie\u0027s help in taking care of Luke\u0027s young son. Jessie agrees on one condition-she wants Brandt\u0027s boots exclusively under her bed for the duration. \u003c/p\u003e\n \u003cp\u003eThe sexual heat that\u0027s always simmered between them ignites. Brandt is determined to make the temporary situation permanent, proving to Jessie he\u0027s a one-woman man. And Jessie is shaken by feelings she\u0027s sworn never to have again for any man...especially not a McKay.Warning: Contains branding-iron-hot sex, the one McKay on earth who wants to be tamed, and a woman who\u0027s decided tame is for nice girls who finish last.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/cowgirls-don-t-cry-rough-riders-10.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2692,"title":"Chasin\u0027 Eight (Rough Riders #11)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eChasin\u0027 Eight (Rough Riders #11) \u003c/p\u003e\n \u003cp\u003e\u0026nbsp;The chase is on… \u003c/p\u003e\n \u003cp\u003eRough Riders, Book 11 \u003c/p\u003e\n \u003cp\u003eBull rider Chase McKay has finally landed in a pile too big to charm his way out of. Caught with his pants down, he finds himself bucked right off the PBR tour until he can get his act together. \u003c/p\u003e\n \u003cp\u003eHollywood actress Ava Dumond became the tabloids’ favorite target when her longtime boyfriend was outed as gay. Now she wants a place to lay low and a chance to prove to herself that she can satisfy a red-blooded man between the sheets. The sexy, rugged cowboy she finds holed up in her Wyoming hideaway seems like the answer to her every fantasy. \u003c/p\u003e\n \u003cp\u003eBut Chase has sworn off women. Forever. Or at least a month. Whichever comes first. \u003c/p\u003e\n \u003cp\u003eWhen they take to the road to get Chase more hands-on bull riding experience, they have every intention of keeping their hands off each other. But the two headstrong stars quickly end up riding a hot and heady rodeo circuit all their own—until the press gets wind of their affair. When the dust clears and the lights of the paparazzi fade, are they ready to give up chasing the dream for a chance of finding forever?\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/chasin-eight-rough-riders-11.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2693,"title":"Cowboy Casanova (Rough Riders #12)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eCowboy Casanova (Rough Riders #12) \u003c/p\u003e\n \u003cp\u003eHis rough touch makes her lose control... \u003c/p\u003e\n \u003cp\u003eIn Sundance, Wyoming, you can\u0027t throw a boot without hitting a McKay cowboy, so Ben McKay is used to fading into the background. Except on weekends, when he\u0027s Bennett, imposing Dom at The Rawhide Club, surrounded by a bevy of female subs eager for the attention of his long whip. \u003c/p\u003e\n \u003cp\u003eAs for the curvy brunette eying him from across the room? He\u0027ll eat his Stetson if she\u0027s the experienced Domme she claims to be. Bennett offers her a deal he\u0027ll let her call the shots for one night. But the next night he gets to prove to her how freeing it\u0027ll be when he takes the reins. \u003c/p\u003e\n \u003cp\u003eAinsley Hamilton is amazed by how well Bennett read her every secret yearning during that one explosive weekend and she\u0027s stunned when they come face to face in their everyday lives as rancher and new bank president. Now Ben\u0027s urging her to explore her submissive side outside the club, and there\u0027s something in his commanding gaze that makes it too easy to let him take control of her desires and her pleasure. \u003c/p\u003e\n \u003cp\u003eCan Ben help Ainsley overcome her fear that a relationship built on dark sexual appetites won\u0027t survive the light of day? \u003c/p\u003e\n \u003cp\u003eWarning: This book contains a lot of kinky sex. No, seriously, there\u0027s A LOT of kinky cowboy sex in this Rough Riders installment. You\u0027ve been warned.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/cowboy-casanova-rough-riders-12.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2694,"title":"Kissin\u0027 Tell (Rough Riders #13)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eKissin\u0027 Tell (Rough Riders #13) \u003c/p\u003e\n \u003cp\u003eShe once led him around by a string. Now he\u0027s the one holding the reins. \u003c/p\u003e\n \u003cp\u003eGeorgia Hotchkiss swore wild horses couldn\u0027t drag her back to Sundance, Wyoming. So it\u0027s ironic she\u0027s forced to take a rodeo PR job in her former hometown right before her ten-year class reunion. The only thing worse than facing her cheating ex-husband and his pregnant wife? Showing up to the reunion without a date. Fate smiles on her when she runs into her former classmate and current cowboy hottie Tell McKay. With his infectious smile and fun-loving ways not to mention his banging body he\u0027s the perfect solution to her problem. \u003c/p\u003e\n \u003cp\u003eTell McKay had it so bad for Hot Lips Hotchkiss during high school that he let her run roughshod over him. But he is no longer that easily manipulated boy these days he\u0027s earned a reputation with the ladies that lives up to the McKay last name. He agrees to escort her to the reunion with one stipulation; that Georgia proves she has left behind the goody-goody cheerleader of the past by sharing his bed. \u003c/p\u003e\n \u003cp\u003eTheir sexual chemistry flashes so bright, they barely notice that the reunion has come and gone, and now they\u0027re tangled up in another dreaded R word \"relationship.\" But if Tell wants to get the girl this go-around, he\u0027ll have to come up with a whole new set of knots to tie up her heartstrings. \u003c/p\u003e\n \u003cp\u003eWarning: Contains a sweet talkin wild cowboy with a wagon load of crazy-hot sex fantasies and the mad bedroom skills to back up his claims.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/kissin-tell-rough-riders-13.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2695,"title":"Gone Country (Rough Riders #14)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eGone Country (Rough Riders #14) \u003c/p\u003e\n \u003cp\u003eShe’s a little bit country, and he’s…not. \u003c/p\u003e\n \u003cp\u003eArizona businessman and long-lost McKay love child Gavin Daniels has been awarded sole custody of his teenage daughter Sierra for one year. In order to steer Sierra back on track after a brush with the law, he pulls up stakes and heads to Wyoming, looking for support from his ranching family...even if he isn’t sure where they fit in the McKay dynamic. He’s prepared for every contingency with the move: the less-than-enthusiastic response from his daughter, learning to run his corporation remotely, but he’s thrown for a loop when his new housemate, Rielle, is a whole lot sexier, funnier and sassier than he remembered. \u003c/p\u003e\n \u003cp\u003eRielle Wetzler has finally overcome the stigma of having hippie parents and being a young single mother. In the two years since she sold her ailing B\u0026amp;B to Gavin Daniels, she’s become financially stable running the homespun businesses she loves. But now Gavin is in Sundance to claim the house that’s rightfully his. Although Rielle knew this day would come, she isn’t prepared to leave the home she built for herself and her now-grown daughter. And to further complicate matters, her long-dormant libido is definitely not ready to live with this newly buff Gavin—who isn’t a cowboy, but has the take-charge attitude to prove he’s all McKay. \u003c/p\u003e\n \u003cp\u003eSharing a roof, their troubles and their triumphs is too much temptation, and before long, Gavin and Rielle are sharing a bed. But sharing their hearts and lives forever? That’s a whole ’nother ball of wax. \u003c/p\u003e\n \u003cp\u003eWarning: Contains a feisty, independent heroine who doesn’t need a man to take care of her needs outside the bedroom and a sweet, sexy and bossy hero who’s up to the challenge of proving her wrong\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/gone-country-rough-riders-14.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2696,"title":"Short Rides (Rough Riders #14.5)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eShort Rides (Rough Riders #14.5) \u003c/p\u003e\n \u003cp\u003eShort Rides is an anthology compilation of two novellas and one short story in the Rough Riders world. These are NOT meant to be read as standalone stories, but are a peek into favorite character\u0027s lives after the happily ever after... \u003c/p\u003e\n \u003cp\u003eThe stories included in the Short Rides anthology are: \u003c/p\u003e\n \u003cp\u003eKing of Hearts* -- Deputy Cam McKay deals with a murder/suicide case on Valentine\u0027s Day. \u003c/p\u003e\n \u003cp\u003eRough Road -- Chassie, Trevor and Edgard Glanzer spend a romantic weekend away from the ranch and kids celebrating their anniversary...only to return home to face their biggest challenge yet. \u003c/p\u003e\n \u003cp\u003eAll Knocked Up -- Keely and Jack Donohue are having a baby. Given Keely\u0027s raging pregnancy hormones, will Jack need to wear a cup in the delivery room?\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/short-rides-rough-riders-14-5.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2697,"title":"Redneck Romeo (Rough Riders #15)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eRedneck Romeo (Rough Riders #15) \u003c/p\u003e\n \u003cp\u003eThe last McKay standing is knocked to his knees… \u003c/p\u003e\n \u003cp\u003eThree years ago, Dalton McKay looked across the altar and saw the woman he knew he’d love for the rest of his life…only it wasn’t his bride. That’s when he took the McKays’ love-’em-and-leave-’em reputation to new heights—fleeing the ceremony and Wyoming. \u003c/p\u003e\n \u003cp\u003eNow a family issue has brought Dalton back to Sundance, giving him a chance to prove to everyone—especially the woman he thought he lost—that he’s a changed man. \u003c/p\u003e\n \u003cp\u003eAurora “Rory” Wetzler has fallen for cowboy hottie Dalton’s smooth-talkin’ ways too many times. So he’s determined to convince her he’s playing for keeps this go around? Fine. She’ll call that bluff—she can’t ignore their intense chemistry or resist smokin’ hot sex, but she’s not willing to gamble her heart again. \u003c/p\u003e\n \u003cp\u003eDalton has plenty of fences to mend with the McKays, but his biggest fear is that Rory doesn’t believe they have a future. He’ll have to pull out all the stops to show her they belong together for the long haul. \u003c/p\u003e\n \u003cp\u003eWarning: Contains a sexy cowboy who tames his sassy lady love with his romantic and his kinky side. In explicit detail.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/redneck-romeo-rough-riders-15.jpg","author":"Lorelei James","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}},{"id":2698,"title":"Night of the Wolves (Vampire Hunters #1)","description":"\u003cdiv\u003e\n \u003cstrong\u003eStoryline: \u003c/strong\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cp\u003eNight of the Wolves (Vampire Hunters #1) \u003c/p\u003e\n \u003cp\u003eGuided by visions as she hunts for her father\u0027s murderer, Alexandra Gordon returns to Victory, Texas--and lands straight in the arms of fearsome lawman Cody Fox. \u003c/p\u003e\n \u003cp\u003eA dedicated soldier in the war against evil, Cody wears his battle scars with honor, all the while hiding a shameful secret from the perceptive Alexandra. Their attraction to one another is instant and unstoppable, but soon it may cost Alex her life. For an ancient evil has been awakened and is stalking the townsfolk after dark.... To protect Alex, Cody must choose between a showdown with the devil--and the fiery beauty whose kisses soothe his tormented soul.\u003c/p\u003e\n\u003c/div\u003e","cover":"https://allnovel.net/images/night-of-the-wolves-vampire-hunters-1.jpg","author":"Heather Graham","type":"Western","link":"http://www.cunovel.com/books/","chapterCount":0,"category":{"id":8,"name":"Western","creation":"Feb 15, 2020 2:34:16 PM","modification":"Feb 15, 2020 2:34:16 PM"}}]
