{"id":62739,"no":6,"title":"Page 6","content":"Miss Holmes\\n\\n An Introduction to a Secret Society\\n\\n Filled with admiration for the way Miss Stoker had flown into action so competently and gracefully, I confess I was a bit distracted as we hurried along the tunnel after our quarry.\\n\\n That doesn\u0027t mean I neglected to take note of the environment: the remnants of old shops in the alcoves, the evidence of human presence and of the nonhuman creatures that existed below the streets. Because of my dislike of dark, deep places, I\u0027d never ventured into the infamous London sewers, where the tosher men lived and dredged up anything of value from the sludgy waste.\\n\\n We\u0027d lost our group by sight, but we were able to hear them and use the sound as guidance. It led us to a bright tunnel perpendicular to the railroad tracks, and off that tunnel was a room. Its door was open.\\n\\n Miss Stoker and I approached the chamber, but seemed to draw no attention, for the rest of the young women were standing about talking in small groups.\\n\\n The place could have been a parlor inside any well-appointed home during an afternoon tea party or musicale. It was lit by numerous electric lights, which gave off a cleaner, whiter light than gas lamps, but had been made illegal by the Moseley-Haft Act. The room was comfortable in temperature without the lingering dampness that pervades underground spaces, and was furnished with rows of upholstered chairs. Rich, heavy fabrics had been draped on the walls, and a small table of refreshments held lemonade, tea, and a generous assortment of biscuits. An odd scent lingered in the air, and I sniffed. Sweet and pungent, with an underlying note of muskiness.\\n\\n At the front of the chamber stood an imposing statue of Sekhmet. The representation of the half-lion, half-woman stood a head taller than a man. Her regal body was shiny gold, and her leonine snout was rounded and feminine, yet fierce. Despite the fact that Sekhmet was a goddess, she was shown with a male lion\u0027s long, smooth mane. As was common in the depiction of any immortal, she had a disk atop her head. This represented her deism in relation to Ra, the sun god. A cobra in mid-lunge curled out from the circle.\\n\\n Sekhmet\u0027s dark eyes captured my attention. Despite the fact they were carved from whatever medium the statue was cast (I couldn\u0027t tell for certain if it was gold or merely painted to look that way), those orbs were clear, shiny, and seemed alive.\\n\\n I suspected this was the same Sekhmet statue that had somehow caused Mr. Dylan Ekhert\u0027s mysterious journey.\\n\\n I turned to the group of young women. Their hoods had become slack, and I could see the faces of many of them. Counting fifteen in the room, I recognized some as familiar, but I knew none of their names. I judged them all to be between sixteen and eighteen years. Each was well dressed, with fancy coiffures and jewelry, and I glimpsed fine fabrics beneath the cloaks, confirming my deduction that they were all attendees of the Cosgrove-Pitt ball. They talked and laughed among themselves, and energy and excitement filled the air. My sharp eyes found no sign of the shadowy figure who\u0027d carried the lantern and led us all to this place.\\n\\n A delicate chime sounded from near the front of the chamber, and the occupants appeared to take that as a signal to find a seat. Just as Miss Stoker and I slipped into chairs in the last row, a door hidden by one of the wall hangings near the statue opened and the room fell silent. The only sound was from a young woman in front of me. If the noisy masticating coming from the vicinity of her jaw was any indication, she was enjoying a very crunchy biscuit.\\n\\n In walked two women carrying torches, garbed in long, shimmering golden tunics. Around their necks, covering their shoulders and upper torsos, were the large, circular Egyptian usekh-the iconic gold collars worn by pharaohs. Both women wore heavy black eyeliner that extended beyond the outside corner of each eye and ended in a little circular flourish, as well as blue-shaded coloring on their eyelids. Their dark red lips, pale cheeks, and black hair pulled back into sleek chignons made them appear identical-although observation confirmed that they were not.\\n\\n The pair walked toward the statue of Sekhmet, each placing a fiery torch in a sconce on either side of it. It was an odd sight: the ancient statuary from Egypt flanked by primitive flaming torches in a modern chamber illuminated by artificial light.\\n\\n \"Welcome to the Society of Sekhmet,\" said one of the women as they turned to face the group.\\n\\n \"The Ankh is pleased that you have accepted its special invitation,\" said the other.\\n\\n Mirror images of each other, they continued to speak in turn, using low, modulated voices. They weren\u0027t automatons, but they gave off the impression of being two halves of one whole. I suspected one of them had been the lantern carrier and the second woman had been the owner of the white glove that collected our invitations.\\n\\n \"Now, it is our honor to welcome . . .\"\\n\\n \". . . the Most Reverent Ankh.\"\\n\\n A hushed rumble filtered over the group. Then it became still and silent, holding its collective breath.\\n\\n When the two women deemed the small crowd to be properly reverent, they walked back to where they\u0027d entered. One held the fabric covering aside, and the other opened the door. Anticipation crackled through the chamber as a tall, slender figure stepped into view.\\n\\n At first I thought it was a man, for the individual was dressed in the masculine attire of a black stovepipe hat made popular by the American president Lincoln, along with a well-tailored black frock coat, trousers, and gleaming black shoes. Beneath the coat was a crimson shirtwaist and a waistcoat of black and red paisley. Black gloves, a black neckcloth, and a black walking stick topped by an ornate gold head completed the ensemble.\\n\\n But as the Ankh walked toward Sekhmet, I became uncertain of his or her gender. The movements were easy and graceful, the facial features and hair were obscured by the hat brim\u0027s shadow. From my distant seat, I made out smooth, fair skin, a well-defined jaw, and a long, slender nose. The mouth was full, and the cheeks high, and I revised my opinion toward that of the feminine race. As I scrutinized the individual, I had a niggling feeling I was missing something important.\\n\\n \"Good evening.\" The Ankh\u0027s voice gave no further confirmation or denial of gender. It was smooth, hardly above a whisper, and somewhere in the range of a tenor. Despite its low volume, every syllable reached all corners of the chamber. \"I am pleased to be with you at last, dear ladies of the Society of Sekhmet.\"\\n\\n Another rustle filtered through the room. It has been my experience that young ladies can never sit still for long, particularly while dressed in corsets and heavy, clinging skirts.\\n\\n \"In the past, some of you attended our salon meetings dedicated to the study of Sekhmet and other fascinating aspects of Egyptology. And some of you have accepted the invitation to join us for the first time this evening. Please accept my apology that tonight\u0027s discussion will not be about the meaning of the uraeus, as you might have anticipated. Shall we save that for a more conventional meeting during the daylight hours?\"\\n\\n A few titters indicated that the Ankh had made some sort of joke.\\n\\n \"Indeed,\" the Ankh said with a dusky laugh, \"I am gratified so many of you chose to leave the-what are they calling it? The event of the season?-to join us here in our humble meeting. After all . . . what can one expect from such a production as the Roses Ball when one is a young and single female? Or should I be more precise and call those Society events what they truly are? Competitions. Shows. Horseflesh fairs. Slave auctions.\"\\n\\n I leaned forward, intrigued by the Ankh\u0027s speech while listening intently for any inflection or accent that might help with identifying the individual.\\n\\n \"I refer to you as being the horseflesh-and the slaves-of course, my dearest young ladies. For that is what you are in the eyes of those wealthy, handsome young bachelors-and the not-so-attractive or rich ones as well. The ones whom you\u0027d prefer to ignore when your mamas and papas introduce them to you.\"\\n\\n An appreciative reaction-nods, exchanging of glances-from the audience was recognizable as affirmation of the Ankh\u0027s words.\\n\\n \"And why is it, I wonder, that you are the ones to be paraded about under the watchful eyes of your chaperones whilst waiting for-nay, pining for-a glance from the young man you favor? Why is it that you are kept pristine, confined in your corsets and your restrictive parlors? Why, I ask of you young ladies, is it the female race who must sit still and take pains to be slender and pretty, all the while taking care to have nary a relevant thought in their heads? Why can you not have opinions and adventures, and do interesting and exciting things . . . and why must you be under constant guard by a mother, a maid, or some controlling male? A father, a brother, an uncle . . . a husband.\"\\n\\n The Ankh\u0027s words were nothing I hadn\u0027t thought before, nothing that hadn\u0027t settled in my mind as, day after day, I observed the restrictions imposed on others of my gender-particularly of the upper class. I was an unusual case because I existed with little chaperonage and adult interference, but I still experienced the societal restrictions and expectations. And although the suffragettes preached of gaining the right to vote, tonight the Ankh was speaking of concepts beyond politics. Listening to her, I became incensed anew at the plight of my feminine race.\\n\\n Apparently, I was not alone, for someone clapped and then, all at once, the chamber was filled with the roar of applause. I joined them and noticed Miss Stoker had done so as well. She seemed just as fixated on our speaker as I had been.\\n\\n The Ankh gave a cool smile to the room and then she (I use the feminine pronoun for simplicity\u0027s sake) walked over to the statue. It seemed as if she were consulting with Sekhmet. A fanciful concept to be sure, and I\u0027m certain the Ankh was merely attempting to lead the more gullible and impressionable women in the room to believe it to be the case.\\n\\n Then the Ankh faced us once more.\\n\\n \"Why can\u0027t young ladies choose where they go and what they do? Why do you not have the same freedom that your male counterparts do?\"\\n\\n A low rumble swept the room as if the occupants were asking themselves the same passionate questions.\\n\\n \"Ah,\" the Ankh said, once again employing that cool smile, \"but you do. You have done so. By accepting the invitation for tonight, you have taken the first step in making a change. In freeing yourselves from restrictions and repressions. Of freeing yourself from being locked away like some bird in a gilded cage-until you are shunted away to a different cage with a husband whom you only might love. A husband who will make every little decision for you. A husband who will control whatever you want and need. A husband who will own you. He will quite literally own you. Yes, my lovelies . . . like a slave.\\n\\n \"No, dear ladies . . . you have all taken the first step on a path of independence and excitement by coming here tonight. By enrolling in the Society of Sekhmet.\"\\n\\n I frowned, both fascinated and stymied by the Ankh\u0027s speech. Was this a suffragette group, gathering together for women\u0027s rights?\\n\\n And was someone hunting down the members and killing them, making it appear that they had taken their own lives?\\n\\n Why? Who?\\n\\n Although strange, the group seemed harmless enough. In fact, the element of adventure and clandestine activity was attractive even to myself. I could only imagine how a young woman such as Lady Hodgeworth, whose most exciting moment of the day was likely determining which frock to wear to afternoon tea, would be roused by this titillating speech. I peeked at Miss Stoker. Surely, being a vampire hunter, she felt much as I did.\\n\\n The Ankh\u0027s voice dropped. \"I know what it is you truly want, ladies. You yearn for adventure and excitement. But most of all, you want . . . him. Whoever he might be, you want him. Is that not the case? Whether you be beautiful or homely, slender or plump . . . whether you have straight white teeth and a demure laugh or protruding ones and a spotted face. Whether you are a rich heiress or one whose family has nothing but a powerful name, you want him. You want him to notice you, to want you, to love you. And, my dears, I will help you. I, along with the Power of Sekhmet, will help you gain control of your lives in a manner such that women have never done.\"\\n\\n She was more animated and passionate than she had been so far. \"Despite the fact that we are ruled by a queen, the laws and governance of this country-and this world-are controlled by men. That must change. It will change. I will have the power to do so, and those faithful of you shall join me in this change. The day is nigh.\"\\n\\n Again, a single clap launched a roar of applause, and it was several moments before it died down again.\\n\\n The Ankh looked as if she meant to speak further, but all at once, Miss Stoker threw back the hood of her cloak and rose.\\n\\n I hissed as everyone in the chamber hushed and turned to look back at her. Sit down! I shouted in my head. You brash fool! This wasn\u0027t part of the plan!\\n\\n \"You,\" said the Ankh, her eyes steady from beneath the brim of her hat. They shifted from Miss Stoker to me and back again. The weight and heat of her stare was shocking, but it seemed to have no effect on my companion.\\n\\n Then Miss Stoker\u0027s voice rang out. \"What did you do to Mayellen Hodgeworth?\"\\n\\n Miss Stoker\\n\\n Miss Stoker\u0027s Grudging Regret\\n\\n The moment I interrupted the speaker, I realized I could have been a little more subtle. Perhaps I should have had some sort of plan. Yet, as pandemonium broke loose, once again I felt energized and in control. Miss Holmes was screeching at me, the other attendees were babbling in shock, and the Ankh was shouting orders.\\n\\n \"Seize them! Hathor! Osiris!\" The Ankh cried, then swiveled to point to the twin female hostesses. \"Bastet! Amunet!\"\\n\\n Two large men appeared from behind the silken wall-hangings, and the identical women sprang into action. Grinning with exhilaration, I leapt over a row of chairs with ease, putting a cluster of young women and tumbling chairs between me the Ankh\u0027s minions.\\n\\n I wanted to get closer to the Ankh, to see if I could pull off the stovepipe hat that obscured his or her face. But the guards were quick, and even amid the chaos, I was aware of Miss Holmes. I could fight my own way out, but she couldn\u0027t.\\n\\n Time to make our exit. I looked up, judged the distance to the chandelier that hung there, and vaulted up off a chair.\\n\\n I clocked either Amunet or Bastet on the chin as I swung halfway across the chamber, thanks to the length of the chandelier\u0027s chain. I landed exactly where I planned-next to Miss Holmes-and grabbed her by the arm.\\n\\n Hathor and Osiris, the two large guards, converged on us as the Ankh and her guests watched the chaos unfold. But thanks to my excellent reflexes, speed, and exceptional strength, I created a riotous barrier of chairs and the refreshments table at the door. My partner and I escaped the chamber with nothing more than a ripped hem (Miss Holmes\u0027s), a sagging hairdo (Miss Holmes\u0027s), and a broken copper-heeled shoe (also Miss Holmes\u0027s).\\n\\n Because I could run and she couldn\u0027t, I fairly carried my companion down the long, dark tunnel to escape. By that time, she no longer seemed to appreciate my fighting skills.\\n\\n Once we were back outside in the fresh night air, I saw that the clouds had rolled in. The moon and stars were obscured. Despite the fact that I had done all the work, Miss Holmes was panting in between demanding to know what I was thinking, what had I done, did I realize what danger I might have put us in, and other variations on that theme.\\n\\n I ignored her and led the way to the nearest busy thoroughfare and flagged down a hansom cab. A few streets away, behind the new Oligary Building and its belching steam, Big Ben\u0027s gears ground rhythmically. A glimpse of his illuminated face through an air-canal told me it was approaching midnight.\\n\\n Almost three hours since we\u0027d left the party.\\n\\n \"Are you aside of mad? I can\u0027t show myself in this condition,\" Miss Holmes snapped when I directed the driver to take us back to Cosgrove Terrace. She was trying to rearrange her hair on the top of her head and having a hard time of it. Her voice was tight. Fury and accusation rolled off her like angry waves.\\n\\n I felt a little pang of . . . well, it certainly wasn\u0027t guilt. It was . . . regret. Maybe.\\n\\n \"Let me help you,\" I said grudgingly, and slid over to her side of the carriage. I stuck a few pins in place, rearranged the cunning little clockwork hair clips, and adjusted some tendrils of hair over one shoulder.\\n\\n When I was done, she settled back in the corner. Her nose remained in the air during the entire ride back to the party. My hair was in even worse condition, but did she offer to assist me? She did not. Thus, using a hint of reflection from the carriage windows, I put myself to rights before the cab arrived at the Cosgrove-Pitt home.\\n\\n \"I don\u0027t expect to stay very long,\" Miss Holmes said from between stiff lips as she climbed down from the carriage without waiting for assistance. \"Just long enough to go inside and say good evening to our host and hostess. You needn\u0027t bother to make your carriage available to take me home, Miss Stoker.\"\\n\\n Her spine ramrod straight, she stalked off toward the ascending glider that would take her back into the ball. Her heavy skirts dragged because one of her delicate heels had snapped off during our escape and she had taken off her shoes.\\n\\n I stifled a smile. Good riddance. And if she was leaving, this would give me the opportunity to find Lady Isabella\u0027s study and locate the invitation list after all. It would be a welcome challenge to avoid the scores of young bachelors looking for a rich and pretty heiress to marry. I happen to fall under both categories.\\n\\n At the party, I eluded Sir Buford Grandine, who had breath that rivaled the stench from the sewers, and Lord Peregrine Perry-Stokes, who, although quite wealthy, had clammy hands and the tendency to pick his nose when he thought no one was looking. Unfortunately, the habit tended to stain the fingertips of his gloves.\\n\\n I avoided even Mr. Richard Dancy, who was the least offensive of the lot. He was handsome and had a very comfortable income. Unlike most of his peers, he actually asked me questions and listened to my answers when we conversed, instead of rambling on about horses or hounds or the newly signed Hartford Act.\\n\\n But even if a young man did show interest in what I might think, I still couldn\u0027t allow any of the bachelors into my affections. What young man, even in our modern London of 1889, would understand the duty and role of a female vampire hunter, let alone want to be married to one? What young man would understand or accept a wife who was not only compelled to spend her nights patrolling the streets, but also who was stronger and faster than he?\\n\\n I wound my way through the ballroom and down the nearest hallway. I\u0027d been to Cosgrove Terrace once before and remembered the basic layout. The deserted corridor lined with closed doors, gilded mirrors, and a few interesting statues led to Lady Isabella\u0027s parlor. It was logical that her study was nearby.\\n\\n The noise of the party faded. I heard only the soft hum of whirring gears and the ever-present shish of steam. I tried several doors before I heard someone approaching. I ducked into the next chamber to wait for them to pass.\\n\\n \"Miss Stoker?\"\\n\\n I froze. The door opened, and Mr. Richard Dancy poked his head in.\\n\\n \"Ah, Miss Stoker,\" he said, \"I thought I\u0027d seen you slip away from the festivities. Is everything all right? Whatever are you doing here in the dark?\"\\n\\n Bloody hell.\\n\\n \"I needed to attend to . . . a private matter,\" I replied.\\n\\n He stepped into the chamber and somehow found the light switch. A soft, mellow glow filtered over the room from the wall sconces, and I realized I had found Lady Isabella\u0027s study after all. Now if I could just get rid of my unwanted companion.\\n\\n \"I\u0027ve been attempting to find you all night, Miss Stoker,\" he said, closing the door behind him.\\n\\n He was a handsome young man with light brown hair that curled, falling in thick waves over his forehead. His dark eyes focused steadily on me. It wasn\u0027t surprising I had no problem dismissing the impropriety of being alone in a chamber with him.\\n\\n \"And now you have found me,\" I said. My heart was pounding, but not from fear.\\n\\n Mr. Dancy remained at a proper distance, leaning against the door. His warm smile made my insides flutter a bit, and I drew myself up sharply. Focus, Evaline. You\u0027ve got work to do.\\n\\n \"I\u0027ve been looking for you everywhere,\" he said, and stepped away from the door. \"And you seemed to have disappeared. I cannot tell you how many parties and fetes and balls and picnics I\u0027ve attended this Season, hoping to see you and further our acquaintance. Since your presence is so rare, when I heard your name announced, I thought I\u0027d at last have an opportunity to lead you out for a waltz. And perhaps a stroll on the moonlit terrace?\"\\n\\n \"Mr. Dancy . . .\" I began, hoping fervently Florence would never learn of his apparent interest in me. She\u0027d have us betrothed in a trice.\\n\\n \"I do wish you would call me Richard, but I suppose it won\u0027t be proper until we\u0027ve come to know each other better. And until we\u0027re better acquainted, I don\u0027t believe it would be prudent for us to be found in such an inappropriate situation,\" he added, his smile turning almost shy as he gestured to the room. \"I wouldn\u0027t want to besmirch your reputation. Perhaps you\u0027d consent to a dance, in full and proper view of an array of chaperones?\"\\n\\n \"I\u0027m in complete agreement that we shouldn\u0027t be here,\" I said. Hadn\u0027t he been the one to follow me, putting us in this compromising position? \"And-\" I caught sight of a movement out of the corner of my eye. My heart stopped, then surged back into rhythm.\\n\\n From where Mr. Dancy was standing, he couldn\u0027t see the figure who slipped out from behind a decorative Oriental screen. I wasn\u0027t certain if I should call an alarm or deal with the intruder myself. But then I realized I was the intruder.\\n\\n The shadowy figure flashed me a cocky smile, and I jolted with recognition. I\u0027d know that insouciant pose anywhere. Bloody blasted drat! And then Pix had the effrontery to raise a finger to his lips. To tell me to hush!\\n\\n Somehow I managed to keep my expression blank when I turned to Mr. Dancy. \"And\"-I finished the sentence, which had dwindled off for a moment-\"I would be honored to have a waltz with you.\"\\n\\n He smiled and for the first time, moved toward me. I changed my angle so he wouldn\u0027t see Pix in the shadows and accepted Mr. Dancy\u0027s offered arm. My mind raced as he led me out of the study. Actually, I was fairly towing him away. How was I going to extricate myself from the dance I\u0027d promised? And from my companion?\\n\\n Pix\u0027s plan was obvious: he intended to rob the place and had somehow gotten himself hired as part of the staff. I had to return to Lady Isabella\u0027s study and apprehend him before he filled his pockets.\\n\\n \"Oh, dear,\" I said, pretending to trip. I bumped into a young woman who was holding a cup of lemonade. It sloshed all over the front of my gown, and the cup landed on the floor with a crash. I danced aside as it shattered. \"Oh, my goodness, I\u0027m so terribly sorry,\" I said, just as she echoed my words.\\n\\n \"What a mess,\" said the girl. \"And your gown!\"\\n\\n \"Oh, fiddlesticks,\" I said, looking up at Mr. Dancy. His expression was a mask of regret, and I felt a twinge of guilt. \"I must see to this stain before it sets. And perhaps you could see to getting Miss . . . ?\"\\n\\n \"Miss Laurel Bednicoe,\" said the girl, looking up at my companion with hopeful eyes.\\n\\n \"Miss Bednicoe a new drink while I attend to this?\" I asked, gesturing to my damp, lemonade-scented bodice. Drat. The gown was completely ruined.\\n\\n \"Of course,\" replied Mr. Dancy. He looked down at me with warm eyes and a matching smile. \"But please don\u0027t take too long. I understand the orchestra stops playing at half past one.\"\\n\\n Thus excused, I rushed back to Lady Isabella\u0027s study, then paused for a moment before easing the door open. The room was dark once again. I slipped inside and closed the door behind me. And waited, listening and watching.\\n\\n After a long moment, I judged the chamber to be empty. Drat and bloody blast. Pix had gotten away, likely with sagging pockets filled with . . . well, what would be of value in the study? Surely Lady Isabella didn\u0027t keep money here, and most definitely not jewels.\\n\\n Right. At least I could see to the task that had brought me here in the first place. I needed to find the invitation list. A wisp of moonlight zigzagged in a sliver of illumination, making a jagged line over the rug, a chair . . . and a large writing desk.\\n\\n Listening for the sound of anyone approaching, I set to searching the drawers of the desk. These weren\u0027t simple sliding drawers. It took me a few seconds to figure out I had to flip a switch that unlatched the drawer. Then it eased open with a soft purr. Blasted cognoggin thing.\\n\\n It was too dark to see clearly, but I didn\u0027t dare chance lighting the wall sconces. Hopefully the invitation list would be clearly marked and in large enough writing for me to read. She must keep one, for how would-\\n\\n A beam of light shot into the drawer I was rummaging.\\n\\n \"Needin\u0027 a bit o\u0027 glim there, luv? \u0027Ard t\u0027see what yer buzzin\u0027 wivout a light.\"\\n\\n I looked to my left. He stood there, cloaked in shadow. How had I not heard him? The man moved like a ghost! Only the hint of chin and cheek were visible from the shadows. He held some slender device that aimed light in a narrow beam. Right over my nosy fingers.\\n\\n \"Is that how you found what you were looking for?\" I sneaked a sideways glance back down into the illuminated drawer. No invitation list yet.\\n\\n \"I warn\u0027t lookin\u0027 fer swag, luv,\" he said, shifting the light as if to give me a better view of his face. \"But if ye don\u0027 believe me,\" he said, his voice dropping, \"then yer welcome t\u0027turn me over and look fer yerself.\" His eyes gleamed with humor and challenge. \"Surely a bold one like ye\u0027d \u0027ardly flicker a lash at the doin\u0027.\"\\n\\n \"I suspect you\u0027d enjoy it entirely too much if I searched you.\" Blast if my palms didn\u0027t go damp at the thought. \"But I\u0027ve no doubt you\u0027ve found something of value to make off with from Lady Isabella\u0027s cache, and I suggest you return it immediately.\"\\n\\n \"Nay, luv, I ain\u0027t got nuffin\u0027 on me o\u0027 any value nor b\u0027longin\u0027 t\u0027anyone but meself,\" Pix replied, his Cockney so thick I could hardly understand him. \"But ne\u0027er say I ain\u0027t a gennulman at \u0027eart. Ye got a rum thin\u0027 goin\u0027 \u0027ere, Miss Stoker, but it ain\u0027t me place to be makin\u0027 like a beak an\u0027 judgin\u0027 ye on what yer after. I\u0027m cer\u0027n ye \u0027ave a good reason t\u0027be weedin\u0027 through this \u0027ere desk. \u0027Low me t\u0027elp ye.\"\\n\\n His movements were quick and smooth, and he placed himself on the other side of the enormous desk. Out of my reach, for the moment.\\n\\n \"This drawer here,\" I said, turning the brass knob that set the mechanism into motion. As Pix beamed the light down, the drawer slid open. I allowed him to think I trusted him enough to accept his assistance. Once I finished searching and his guard had dropped, I could . . . apprehend him?\\n\\n That train of thought stopped as if it slammed into a brick wall. My throat went dry at the very idea of engaging in any sort of physical contact with him.\\n\\n \"Wot\u0027sa matter, luv?\" Pix asked. \"Did ye find what yer lookin\u0027 fer?\"\\n\\n I returned my attention to the drawer. And there it was. My aimless rummaging had uncovered what looked like a guest list. I snatched it out of the drawer, giving thanks for small favors, and Pix obligingly moved the light closer.\\n\\n I heard the sound of voices approaching. Someone bumped against the door, and then the knob began to turn. Pix extinguished his light. The door opened, and I ducked behind a long, heavy curtain. So did he.\\n\\n What were the chances of us both ending up in the same small place? Unbelievable. But there we were, muffled together in close quarters. His strong fingers closed around my arm, and his solid, warm presence rose behind me. I focused on the fact that Lady Cosgrove-Pitt needed a new downstairs maid because the dratted curtain was really dusty. But overriding that musty scent was a pleasant smoky and minty aroma coming from the man behind me.\\n\\n \"Iffen I din\u0027t know any better,\" he murmured in my ear, \"I\u0027d be thinkin\u0027 you like slippin\u0027 into th\u0027 dark wiv me. Two nights in a row, is it?\"\\n\\n Right. He\u0027d be so lucky. Still cloaked by the curtain, I moved as far away from him and his arrogance as possible. But I couldn\u0027t go far, because two people had entered the chamber. From behind the curtain, I couldn\u0027t see anything but a glow of light, which implied the new arrivals had no reason to hide their presence. They were also speaking with no attempt to keep their voices down. Servants. I could tell by their speech and accents.\\n\\n Pix\u0027s soft, warm breath buffeted against my ear and temple, and I had to close my eyes against the distraction. It was almost impossible to keep my breathing steady and my heart from pounding. Drat him anyway.\\n\\n Was that his mouth against my hair? Just above my ear? I bit my lip as warm sizzles rushed from my sensitive ear down through my body. When I got out of this situation, I was going to drag this rogue of a pickpocket down to Newgate and toss him into a cage myself.\\n\\n \"Ye smell nice,\" he had the effrontery to say. In my ear. While there were people in the room. \"Ver\u0027 nice, luv. Like . . . mmm . . . lemonade.\"\\n\\n Lemonade? I heard the laughter in his voice and wished I dared to expose him right then and there to whoever was in the room. Blasted man.\\n\\n Desperate to put some space between us without shifting the curtain, I turned my attention to what was happening beyond the dusty velvet swags. By the conversation, it was obvious two maids had been sent by their mistress to retrieve something from the study. They found whatever they were looking for and left the chamber before Pix created any more mischief behind our curtain.\\n\\n As soon as the door closed behind them, I flung the velvet panel aside and erupted into the cool, clean air. Thanks to Pix, my cheeks were burning hot. I turned back to confront him, and I heard a soft creak. The curtains moved, and then all at once, I smelled the fresh night air.\\n\\n No! I got to the open window just in time to see a figure land on the ground one story below. He did a neat somersault and then disappeared into the shadows.\\n\\n Incensed, I considered going after him. My ear still felt warm, and my palms were damp. I didn\u0027t care if I ever saw him again, except to point him out to Scotland Yard. But I still held the invitation list, and that was all that mattered. I had what I came for.\\n\\n Two minutes later, I finished reading it, and I had at least one answer.\\n\\n Mayellen Hodgeworth was on the list. \\n\\n","sourceLink":"https://allnovel.net/the-clockwork-scarab-stoker-holmes-1/page-6.html","bookId":1674,"book":{"id":1674,"title":"The Clockwork Scarab (Stoker \u0026 Holmes #1)","description":"Storyline: The Clockwork Scarab (Stoker \u0026 Holmes #1) \\n Evaline Stoker and Mina Holmes never meant to get into the family business. But when you’re the sister of Bram and the niece of Sherlock, vampire hunting and mystery solving are in your blood. And when two society girls go missing, there’s no one more qualified to investigate. \\n Now fierce Evaline and logical Mina must resolve their rivalry, navigate the advances of not just one but three mysterious gentlemen, and solve murder with only one clue: a strange Egyptian scarab. The stakes are high. If Stoker and Holmes don’t unravel why the belles of London society are in such danger, they’ll become the next victims.\\n","cover":"https://allnovel.net/images/the-clockwork-scarab-stoker-holmes-1.jpg","author":"Colleen Gleason","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-clockwork-scarab-stoker-holmes-1.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 9:48:21 AM"}}
