{"id":42404,"no":20,"title":"Chapter XVIII—The Canal-Boy Becomes A College President.","content":"During his second winter vacation a great temptation assailed James. It was not a temptation to do wrong. That he could easily have resisted. I must explain. At Prestenkill, a country village six miles from Troy, N.Y., the young student organized a writing school, to help defray his expenses. Having occasion to visit Troy, his interest in education led him to form an acquaintance with some of the teachers and directors of the public schools. One of these gentlemen, while walking with him over the sloping sides of a hill overlooking the city, said: \"Mr. Garfield, I have a proposition to make to you.\" The student listened with interest. \"There is a vacancy in one of our public schools. We want an experienced teacher, and I am sure you will suit us. I offer you the place, with a salary of twelve hundred dollars a year. What do you say?\" The young man\u0027s heart beat for a moment with repressible excitement. It was a strong temptation. He was offered, deducting vacations, about one hundred and twenty-five dollars a month, while heretofore his highest wages had been but eighteen dollars per month and board. Moreover, he could marry at once the young lady to whom he had been for years engaged. He considered the offer a moment, and this was his answer: \"You are not Satan and I am not Jesus, but we are upon the mountain, and you have tempted me powerfully. I think I must say, \u0027Get thee behind me!\u0027 I am poor, and the salary would soon pay my debts and place me in a position of independence; but there are two objections. I could not accomplish my resolution to complete a college course, and should be crippled intellectually for life. Then, my roots are all fixed in Ohio, where people know me and I know them, and this transplanting might not succeed as well in the long run as to go back home and work for smaller pay.\" So the young man decided adversely, and it looks as if his decision was a wise one. It is interesting to conjecture what would have been his future position had he left college and accepted the school then offered him. He might still have been a teacher, well known and of high repute, but of fame merely local, and without a thought of the brilliant destiny he had foregone. So he went back to college, and in the summer of 1856 he graduated, carrying off the highest honor—the metaphysical oration. His class was a brilliant one. Three became general officers during the rebellion—Garfield, Daviess, and Thompson. Rockwell\u0027s name is well known in official circles; Gilfillan is Treasurer of the United States. There are others who fill prominent positions. In the class above him was the late Hon. Phineas W. Hitchcock, who for six years represented Nebraska in the United States Senate—like Garfield, the architect of his own fortunes. \"What are your plans, Garfield?\" asked a classmate but a short time before graduation. \"I am going back to Ohio, to teach in the school where I prepared for college.\" \"What is the name of the school?\" \"Hiram Institute.\" \"I never heard of it.\" \"It has only a local reputation.\" \"Will you get a high salary?\" \"No; the institute is poor, and can pay me but little.\" \"I think you are making a mistake.\" \"Why so?\" \"You are our best scholar, and no one can rival you in speaking in the societies. You should study law, and then go to one of our large cities and build up a reputation, instead of burying yourself in an out-of-the-way Ohio town, where you may live and die without the world hearing of you.\" \"Thank you for your good opinion of me. I am not sure whether I deserve it, but if I do, I shall come to the surface some day. Meanwhile, to this humble school (it was not yet a college) I owe a large debt of gratitude. I am under a promise to go back and do what I can to pay that debt.\" \"In doing so you may sacrifice your own prospects.\" \"I hope not. At any rate, my mind is made up.\" \"Oh, well, in that case I will say no more. I know that if your mind is made up, you are bound to go. Only, years hence you will think of my warning.\" \"At any rate,\" said Garfield, cordially, \"I shall bear in mind the interest you have shown in me. You may be right—I admit that—but I feel that it is my duty to go.\" I doubt whether any man of great powers can permanently bury himself, no matter how obscure the position which he chooses. Sooner or later the world will find him out, and he will be lifted to his rightful place. When General Grant occupied a desk in the office of a lawyer in St. Louis, and made a precarious living by collecting bills, it didn\u0027t look as if Fame had a niche for him; but occasion came, and lifted him to distinction. So I must confess that the young graduate seemed to be making a mistake when, turning his back upon Williams College, he sought the humble institution where he had taught, as a pupil-teacher, two years before, and occupied a place as instructor, with an humble salary. But even here there was promotion for him. A year later, at the age of twenty-six, he was made president of the institution. It was not, perhaps, a lofty position, for though Hiram Institute now became Hiram College, it was not a college in the New England sense, but rather a superior academy. Let us pause a minute and see what changes have taken place in ten years. At the age of sixteen Jimmy Garfield was glad to get a chance to drive a couple of mules on the tow-path of the Ohio and Pennsylvania Canal. The ragged, homespun boy had disappeared. In his place we find James A. Garfield, A.B., president of a Western college—a man of education and culture. And how has this change been brought about! By energy, perseverance, and a resolute purpose—a soul that poverty could not daunt, an ambition which shrank from no hardship, and no amount of labor. They have been years of toil, for it takes time to transform a raw and ignorant country lad into a college president; but the toil has not harmed him—the poverty has not cramped him, nor crippled his energies. \"Poverty is very inconvenient,\" he said on one occasion, in speaking of those early years, \"but it is a fine spur to activity, and may be made a rich blessing.\" The young man now had an assured income; not a large one, but Hiram was but an humble village. No fashionable people lived there. The people were plain in their tastes, and he could live as well as the best without difficulty. He was employed in a way that interested and pleased him, and but one thing seemed wanting. His heart had never swerved from the young lady with whom he first became acquainted at Geauga, to whom he was more closely drawn at Hiram, and to whom now for some years he had been betrothed. He felt that he could now afford to be married; and so Lucretia Rudolph became Mrs. Garfield—a name loved and honored, for her sake as well as his, throughout the length and breadth of our land. She, too, had been busily and usefully employed in these intervening years. As Mr. Philo Chamberlain, of Cleveland, has told us elsewhere, she has been a useful and efficient teacher in one of the public schools of that city. She has not been content with instructing others, but in her hours of leisure has pursued a private course of study, by which her mind has been broadened and deepened. If some prophetic instinct had acquainted her with the high position which the future had in store for her, she could have taken no fitter course to prepare herself to fulfil with credit the duties which, twenty years after, were to devolve upon her as the wife of the Chief Magistrate of the union. This was the wife that Garfield selected, and he found her indeed a helper and a sympathizer in all his sorrows and joys. She has proved equal to any position to which the rising fame of her husband lifted her. Less than a year ago her husband said of her: \"I have been wonderfully blessed in the discretion of my wife. She is one of the coolest and best-balanced women I ever saw. She is unstampedable. There has not been one solitary instance in my public career when I suffered in the smallest degree for any remark she ever made. It would have been perfectly natural for a woman often to say something that could be misinterpreted; but, without any design, and with the intelligence and coolness of her character, she has never made the slightest mistake that I ever heard of. With the competition that has been against me, such discretion has been a real blessing.\" Public men who have risen from humble beginnings often suffer from the mistakes of wives who have remained stationary, and are unfitted to sympathize with them in the larger life of their husbands. But as James A. Garfield grew in the public esteem, and honors crowded upon him, step by step his wife kept pace with him, and was at all times a fitting and sympathetic companion and helpmeet. They commenced housekeeping in a neat little cottage fronting the college campus; and so their wedded life began. It was a modest home, but a happy one, and doubtless both enjoyed more happy hours than in the White House, even had the last sorrowful tragedy never been enacted. As President, James A. Garfield belonged to the nation; as the head of Hiram College, to his family. Greatness has its penalties, and a low estate its compensations. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2970/81793.html","bookId":374,"book":{"id":374,"title":"From Canal Boy to President","description":"简介： The present series of volumes has been undertaken with the view of supplying the want of a class of books for children, of a vigorous, manly tone, combined with a plain and concise mode of narration. The writings of Charles Dickens have been selected...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2970","creation":"Aug 1, 2019 12:18:40 AM","modification":"Aug 1, 2019 12:18:40 AM"}}
