{"id":42392,"no":8,"title":"Chapter VI—James Leaves The Canal.","content":"James was not long to fill the humble position of driver. Before the close of the first trip he was promoted to the more responsible office of bowman. Whether his wages were increased we are not informed. It may be well in this place to mention that a canal boat required, besides the captain, two drivers, two steersmen, a bowman, and a cook, the last perhaps not the least important of the seven. \"The bowman\u0027s business was to stop the boat as it entered the lock, by throwing the bowline that was attached to the bow of the boat around the snubbing post.\" It was to this position that James was promoted, though I have some doubt whether the place of driver, with the opportunities it afforded of riding on horse or mule-back, did not suit him better. Still, promotion is always pleasant, and in this case it showed that the boy had discharged his humbler duties satisfactorily. I have said that the time came when James showed that he was not a coward. Edmund Kirke, in his admirable life of Garfield, has condensed the captain\u0027s account of the occurrence, and I quote it here as likely to prove interesting to my boy readers: \"The Evening Star was at Beaver, and a steamboat was ready to tow her up to Pittsburg. The boy was standing on deck with the selting-pole against his shoulders, and some feet away stood Murphy, one of the boat hands, a big, burly fellow of thirty-five, when the steamboat threw the line, and, owing to a sudden lurch of the boat, it whirled over the boy\u0027s head, and flew in the direction of the boatman. \u0027Look out, Murphy!\u0027 cried the boy; but the rope had anticipated him, and knocked Murphy\u0027s hat off into the river. The boy expressed his regret, but it was of no avail. In a towering rage the man rushed upon him, with his head down, like a maddened animal; but, stepping nimbly aside, the boy dealt him a powerful blow behind the ear, and he tumbled to the bottom of the boat among the copper ore. Before he could rise the boy was upon him, one hand upon his throat, the other raised for another blow upon his frontispiece. \"\u0027Pound the cussed fool, Jim!\u0027 cried Captain Letcher, who was looking on appreciatingly. \u0027If he haint no more sense\u0027n to get mad at accidents, giv it ter him! Why don\u0027t you strike?\u0027 \"But the boy did not strike, for the man was down and in his power. Murphy expressed regret for his rage, and then Garfield gave him his hand, and they became better friends than ever before. This victory of a boy of sixteen over a man of thirty-five obliterated the notion of young Garfield\u0027s character for cowardice, and gave him a great reputation among his associates. The incident is still well remembered among the boatmen of the Ohio and Pennsylvania Canal.\" The boy\u0027s speedy reconciliation to the man who had made so unprovoked an assault upon him was characteristic of his nature. He never could cherish malice, and it was very hard work for him to remain angry with any one, however great the provocation. Both as a boy and as a man he possessed great physical strength, as may be inferred from an incident told by the Boston Journal of his life when he was no longer the humble canal-boy, but a brigadier-general in the army: \"At Pittsburg Landing one night in 1862 there was a rush for rations by some newly-arrived troops. One strong, fine-looking soldier presented a requisition for a barrel of flour, and, shouldering it, walked off with ease. When the wagon was loaded, this same man stepped up to Colonel Morton, commanding the commissary steamers there, and remarked, \u0027I suppose you require a receipt for these supplies?\u0027 \u0027Yes,\u0027 said the Colonel, as he handed over the usual blank; \u0027just take this provision return, and have it signed by your commanding officer.\u0027 \u0027Can\u0027t I sign it?\u0027 was the reply. \u0027Oh, no,\u0027 said the affable Colonel Morton; \u0027it requires the signature of a commissioned officer.\u0027 Then came the remark, that still remains fresh in the Colonel\u0027s memory: \u0027I am a commissioned officer—I\u0027m a brigadier-general, and my name is Garfield, of Ohio.\u0027\" For four months James remained connected with the canal-boat. To show that traveling by canal is not so free from danger as it is supposed to be, it may be stated that in this short time he fell into the water fourteen times. Usually he scrambled out without further harm than a good wetting. One night, however, he was in serious pain. It was midnight, and rainy, when he was called up to take his turn at the bow. The boat was leaving one of those long reaches of slack-water which abound in the Ohio and Pennsylvania Canal. He tumbled out of bed in a hurry, but half awake, and, taking his stand on the narrow platform below the bow-deck, he began uncoiling a rope to steady the boat through a lock it was approaching. Finally it knotted, and caught in a narrow cleft on the edge of the deck. He gave it a strong pull, then another, till it gave way, sending him over the bow into the water. Down he went in the dark river, and, rising, was bewildered amid the intense darkness. It seemed as if the boy\u0027s brief career was at its close. But he was saved as by a miracle. Reaching out his hand in the darkness, it came in contact with the rope. Holding firmly to it as it tightened in his grasp, he used his strong arms to draw himself up hand over hand. His deliverance was due to a knot in the rope catching in a crevice, thus, as it tightened, sustaining him and enabling him to climb on deck. It was a narrow escape, and he felt it to be so. He was a thoughtful boy, and it impressed him. The chances had been strongly against him, yet he had been saved. \"God did it,\" thought James reverently, \"He has saved my life against large odds, and He must have saved it for some purpose. He has some work for me to do.\" Few boys at his age would have taken the matter so seriously, yet in the light of after events shall we not say that James was right, and that God did have some work for him to perform? This work, the boy decided, was not likely to be the one he was at present engaged in. The work of a driver or a bowman on a canal is doubtless useful in its way, but James doubted whether he would be providentially set apart for any such business. It might have been this deliverance that turned his attention to religious matters. At any rate, hearing that at Bedford there was a series of protracted meetings conducted by the Disciples, as they were called, he made a trip there, and became seriously impressed. There, too, he met a gentleman who was destined to exert an important influence over his destiny. This gentleman was Dr. J.P. Robinson, who may be still living. Dr. Robinson took a great liking to the boy, and sought to be of service to him. He employed him, though it may have been at a later period, to chop wood, and take care of his garden, and do chores about the house, and years afterward, as we shall see, it was he that enabled James to enter Williams College, and pursue his studies there until he graduated, and was ready to do the work of an educated man in the world. But we must not anticipate. Though James was strong and healthy he was not proof against the disease that lurked in the low lands bordering on the canal. He was attacked by fever and ague, and lay for some months sick at home. It was probably the only long sickness he had till the fatal wound which laid him on his bed when in the fullness of his fame he had taken his place among kings and rulers. It is needless to say that he had every attention that a tender mother could bestow, and in time he was restored to health. During his sickness he had many talks with his mother upon his future prospects, and the course of life upon which it was best for him to enter. He had not yet given up all thoughts of the sea, he had not forgotten the charms with which a sailor\u0027s life is invested in Marryatt\u0027s fascinating novels. His mother listened anxiously to his dreams of happiness on the sea, and strove to fix his mind upon higher things—to inspire him with a nobler ambition. \"What would you have me do, mother?\" he asked. \"If you go back to the canal, my son, with the seeds of this disease lurking in your system, I fear you will be taken down again. I have thought it over. It seems to me you had better go to school this spring, and then, with a term in the fall, you may be able to teach in the winter. If you teach winters, and work on the canal or lake summers, you will have employment the year round.\" Nevertheless Mrs. Garfield was probably not in favor of his spending his summers in the way indicated. She felt, however, that her son, who was a boy like other boys, must be gradually weaned from the dreams that had bewitched his fancy. Then his mother proposed a practical plan. \"You have been obliged to spend all your money,\" she said, \"but your brother Thomas and I will be able to raise seventeen dollars for you to start to school on, and when that is gone perhaps you will be able to get along on your own resources.\"","sourceLink":"http://novel.tingroom.com/ertong/2970/81781.html","bookId":374,"book":{"id":374,"title":"From Canal Boy to President","description":"简介： The present series of volumes has been undertaken with the view of supplying the want of a class of books for children, of a vigorous, manly tone, combined with a plain and concise mode of narration. The writings of Charles Dickens have been selected...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2970","creation":"Aug 1, 2019 12:18:40 AM","modification":"Aug 1, 2019 12:18:40 AM"}}
