{"id":64561,"no":20,"title":"Page 20","content":"I caught movement at the bottom of my vision, and looked down to see his erection visibly twitch, pre-come soaking his boxers where they touched the tip of him.\\n\\n “Tristan,” I moaned.\\n\\n I closed my eyes, a heady orgasm washing over me in lush waves.\\n\\n “Danika,” he rasped, his knee jerking up until it was no more than a whisper away from my entrance.\\n\\n He moaned, long and low.\\n\\n I didn’t open my eyes again until I felt him moving away. The wand slipped partially out of me, and I pulled it the rest of the way out, hastily turning it off as I rolled over to look at him.\\n\\n He’d flung himself onto his back beside me, his arm thrown over his eyes.\\n\\n His breathing was harsh.\\n\\n I swallowed, my eyes moving down his body. “Did you, um…?”\\n\\n He sucked in a breath. His voice was low. “Please, don’t ask. I haven’t embarrassed myself that bad since I was a teenager.”\\n\\n I glanced down, the state of his shorts, and his words, telling me clearly what the answer was.\\n\\n I lay down on my back, pulling the covers up to my neck. I was a little in shock about what I’d just done. What the hell was wrong with me?\\n\\n My hormones had ignited, and I was pretty sure I’d lost some important brain cells in the fire.\\n\\n “Fuck, what was that?” he panted.\\n\\n “That was crazy,” I gasped. “And stupid. Especially stupid.”\\n\\n “If that was your first attempt at winning the teasing war, I’m not sure if you just won or lost it all with one try.”\\n\\n In spite of myself, I giggled. “There is no teasing war. Get that out of your head. This is not a contest. This is a disaster that never needs to happen again.”\\n\\n “Seriously, though, if I wake up to that again, I’m not sure what I’ll do, Danika.”\\n\\n “It won’t happen again, so don’t worry your pretty little head about it.”\\n\\n “And what if I…accidentally start jerking myself off in my sleep?”\\n\\n “Stop it. You’re incorrigible.”\\n\\n “And you are the queen of all teases. You know I’ll never get that picture out of my head…Fuuuuck. Do you have any idea how much this messes with me?”\\n\\n I sighed. “I think I have a pretty good idea, Tristan. Can we just…never mention this again?”\\n\\n “I can try, but that doesn’t mean I won’t be thinking about it.”\\n\\n “Yeah, I know.” There was no way I’d ever forget the look on his face as he’d helped me get myself off.\\n\\n “Just let me ask you one thing, before I drop the subject forever.”\\n\\n I blew my breath out in a noisy sigh. “Go for it.”\\n\\n “What started that?”\\n\\n “I was having a…sex dream. I think I can feel some sympathy for the wet dream thing guys have now.”\\n\\n “Was it about anyone specific?” he sounded more than idly curious.\\n\\n “No,” I lied through my teeth. “And that was more than one question.”\\n\\n “One more, I swear, and then I’m done. What was the dream about?”\\n\\n “I was getting oral on a floatie in the pool.”\\n\\n He cursed fluently, and he didn’t ask me any more questions.\\n\\n CHAPTER SIXTEEN\\n\\n The next ‘stupid’ incident started with an unexpected package, a chicken murdering hound, and the dog chase from hell.\\n\\n Ivan was at the table, working on his daily journal entry, and Mat was busy scribbling in one of his coloring books.\\n\\n It was raining out, a summertime Vegas flash flood, but it was still hot as hell. I wore a thin white tank top, and my favorite sassy pants shorts.\\n\\n I was just correcting Ivan’s spelling when the doorbell rang. I shot an annoyed look at Jerry’s closed office door. He and Tristan had been in there for hours, discussing supposed ‘band’ things, but it was the closest room to the front door, and I was right in the middle of lessons, so it seemed to me that one of them should answer it.\\n\\n As though they’d read my mind, the office door opened, and both men stepped out, serious looks on their faces, as though they really had been discussing ‘important business’.\\n\\n Tristan opened the front door, greeting the UPS guy. UPS guy needed a signature, so Tristan stepped back, opening the door wider. Jerry moved in to sign.\\n\\n My last thought right before all hell broke loose was how strange it was that no dogs had crowded at the front entrance as soon as they’d heard the doorbell.\\n\\n One lone bastard of a dog shot straight from the hallway and out the front as though he’d been planning for just this moment.\\n\\n “Coffeecup!” I shouted, pointing like a crazy woman.\\n\\n Everyone just turned and stared at me, instead of at the dog I’d been yelling about. Perfect.\\n\\n I grabbed a leash off its hook in the hallway by the kitchen, shoving my feet into a pair of Bev’s running shoes. I was following that crazy dog out the door in less than thirty seconds.\\n\\n Please let the chickens be locked up tight, please let the chickens be locked up tight, was a mantra in my head as I booked it across the neighborhood.\\n\\n I was a fast runner. I went to great pains to stay in good shape, and jogged outside whenever the weather allowed. Which was why I was surprised when Tristan was suddenly running beside me, and then passing me.\\n\\n I wasn’t sure when he’d left the house, but I was sure it’d been after I had.\\n\\n I saw a flash of spotted brown fur at the corner of my vision, and turned on my heel. We were still several house rows away from the stables, which meant we actually had a shot at saving some chickens.\\n\\n Coffeecup hesitated at one house, sniffing out something, and I pounced, diving for him. The rain had already made his coat slick and wet, and he wriggled out of my arms before I could get the leash on his collar.\\n\\n I screamed curses at him as I scrambled back to my feet, resuming the chase.\\n\\n I nearly cheered as Tristan intercepted him in the muddy ditch that led up and directly into the stables. He gripped the dog’s collar, hooting with laughter. We were sharing rather smug smiles as I approached, when Coffeecup pulled a ninja dog move and slipped out of his collar, darting for the stables.\\n\\n Tristan tackled him, grabbing him around the chest to hold him back.\\n\\n I dug into the mud for his collar, glaring at the stupid dog while I tightened it around his neck, one rung tighter than the last time, since it had apparently been loose enough for him to slip out of. I clipped the leash on, still catching my breath.\\n\\n “You look like you couldn’t decide whether you wanted to mud wrestle, or be in a wet T-shirt contest,” Tristan said with a laugh, having to shout to be heard over the downpour.\\n\\n I looked down at my sopping wet, muddy white tank top. He had a point…but he hadn’t faired any better.\\n\\n I pointed at him. “So do you! You look worse, in fact. I’m not the one on their back in the mud!”\\n\\n I shouldn’t have said it. It was too much like a challenge, and I should have known better than to offer Tristan a challenge.\\n\\n His hands snaked behind my knees, pulling me down with him, until my bare knees sank heavily into the mud on either side of his hips.\\n\\n “You son of a bitch!” I said, but I was laughing.\\n\\n “I’m pretty sure saying that is a faux pas, now that you’ve actually met my mother.”\\n\\n “My bad. I take it back. Here, accept my sincere apology.” As I spoke, I reached down, gripping a heavy handful of mud. I was giving him my sweetest smile as I smeared it on top of his head.\\n\\n He gasped, and then gave me the most evil grin. “You’re gonna pay for that,” he said through his teeth.\\n\\n I tried to get up, but one hand on my hip kept me straddling him. He had the advantage, with much bigger hands, and the huge gob of mud that he smeared over my chest far outweighed the bit I’d put on his head.\\n\\n I gasped in outrage. “That was so much worse than what I did to you! So rude!”\\n\\n He laughed, muddy hand going to my other hip. “Really? A handful of mud on your chest is worse than what you just did to my head?”\\n\\n “Well, let’s see,” I said, diving for more mud. My target was no secret. I went for his face.\\n\\n He caught both of my wrists, pulling them far apart, which brought our chests flush.\\n\\n I rubbed against him, smearing as much mud as I could from my thin white shirt onto his. The motion of our chests rubbing together had our playful mood changing in a hurry.\\n\\n He brought my wrists behind my back, pushing me down until my hips were crushed to his. As though they had a mind of their own, my hips moved, bearing down. My entire body seemed to shudder as I made contact with his obvious erection.\\n\\n Our faces were close, and I couldn’t have said whether it was him or me that moved first, but our lips met in a furious clash. He lay back, and I followed him down, moaning into his mouth as his tongue swept into mine, invading like he owned the place.\\n\\n His kiss was insidious, seeping into every part of me. He took me over in a way I couldn’t believe I allowed. A few seconds into the kiss, and I was ready to relinquish all control, which I’d have sworn was the antithesis of everything I was before I’d met Tristan.\\n\\n He let go of my hands, his fingers sinking into my ass as he pushed his straining cock right into the center of me.\\n\\n I’d never considered myself to be a particularly sexual person, but I was mindless in that moment, every part of me sexual, focused only on the heavy beat of desire in my blood—on having him inside of me.\\n\\n I gripped one hand into his short hair, the other reaching down his chest, over his hard abdomen, and finally over his thick length, rubbing.\\n\\n He panted against me, and I bit his bottom lip. He growled, delving back into my mouth.\\n\\n God only knows how far we would have let things go but for a shrill scream that echoed to us from the stables.\\n\\n I yanked back, looking around, totally confused for a moment as to where I even was.\\n\\n Finally, the sight of my hand, my empty hand, where the leash should have been held, jarred me back into the problem at hand.\\n\\n “Coffeecup!” I yelled, stumbling to my feet.\\n\\n Tristan used his hands on my hips to help leverage me up, and I was off, sprinting towards the stables, hoping that I wasn’t too late to save at least some of those damned prize chickens.\\n\\n It was a massacre.\\n\\n Feathers and blood made a trail that led me to right to the chicken murdering dog, who would still have been happily murdering away, if one parka-covered crazy chicken lady didn’t already have his leash in hand. She was literally shaking with rage as I took the leash out of her hand. She pointed at me accusingly, as though I had been the one to behead—I counted one, two, three of her chickens. Damn, but he was efficient at murdering chickens. This had to be a record.\\n\\n “I’m so so sorry—” I began.\\n\\n “The home owners association will hear about this!” she cut in.\\n\\n I nodded, my eyes wide, not sure how to handle her. We only ever saw each other when stuff like this happened, so I’d only ever seen her crazy side. As far as I knew, she was straight crazy chicken lady all the time.\\n\\n “That dog is a menace!” she shouted.\\n\\n I nodded again. I couldn’t argue with that. I didn’t point out that if she didn’t let her chickens run loose around the stables all the time, they wouldn’t make such easy targets for blood-thirsty Coffeecup. I knew from experience that trying to form any kind of defense only made her crazier. \\n\\n","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-20.html","bookId":1929,"book":{"id":1929,"title":"Bad Things (Tristan \u0026 Danika #1)","description":"Storyline: Bad Things (Tristan \u0026 Danika #1) \\n Danika hasn’t had an easy life. Being insanely attracted to bad boys has never helped make it easier. \\n One look at Tristan, and every brain cell she possessed went up in smoke. This man was trouble with a capital T. It was a given. \\n She knew better. Bad boys were bad. Especially for her. Considering her history, it was crazy to think otherwise. So why did crazy have to feel so damn fine? \\n For as long as she could remember, Danika had been focused on the future with single-minded purpose. Tristan came along and taught her everything there was to know about letting go, and living in the present. She fell, hard and deep. Of course, that only made her impact with the ground that much more devastating. \\n Bad Things is about Tristan and Danika, and their train wreck of a love story. This series can be read as a standalone, or with the Up in the Air series.\\n","cover":"https://allnovel.net/images/bad-things-tristan-danika-1.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/bad-things-tristan-danika-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:54:17 AM"}}
