{"id":64586,"no":45,"title":"Page 45","content":"“I fucking warned you, you little prick!” Tristan shouted at him.\n I was on the ground, curled into a little ball against the wall, not letting myself look. I hated fighting. I didn’t understand it, and I never knew how to deal with it.\n I felt Frankie sliding down next to me, her arm going around my shoulder in a comforting hug.\n “It’s okay. The guys pulled him off Dean.”\n “It’s not okay. It’s so not okay that he’s acting like this. What’s wrong with him?”\n “I don’t know,” she said quietly. “But I’d be lying if I said it wasn’t kind of fun to see him punch Dean in the face. The prick deserved it…”\n I opened my mouth to respond, when the door opened, and James Cavendish walked in.\n It was the strangest thing, how all of the chaos seemed to just calm in his wake. He walked directly to Frankie and me, nodding to the men as he passed, and giving Dean, who was holding his jaw and glaring at Tristan, a puzzled look.\n He was wearing a dark suit and looking spectacular and polished, as ever.\n He nodded at us, studying me intently. “Are you all right, Danika?”\n I nodded automatically, though I wasn’t quite sure what I was, just then.\n “I heard you’d been assaulted again, and in my establishment, again. I can’t tell you how much that displeases me.”\n “I’m perfectly fine. I’m more worried about what’s going to happen to Tristan.”\n “That’s what I’m here to work out. You see, I tend to think that men who assault women on the dance floor deserve a hard knee to the balls.”\n Those words, coming out of the most sophisticated man I’d ever met, surprised a giggle out of me, which drew a small smile out of James.\n “We’ve spoken to the man. He won’t be pressing charges, though the downside to that is that we also will not be pressing charges against him. I wanted to get your approval before we go ahead with this decision, since you were clearly the wronged party.”\n I wanted to kiss him, I was so relieved. “So Tristan won’t be arrested?” I asked hopefully.\n “If this resolution works for you, then no.”\n “Yes, yes, it definitely works for me. Thank you thank you thank you.”\n He just nodded, smiling. He tilted his head toward Dean. “What happened there?”\n I grimaced, and Frankie answered. “The band is having issues. Largely, that Dean is an ass. Don’t worry about them, though. They’ve been friends forever. They’ll be best buds again within twenty-four hours, I guarantee it.”\n James didn’t look convinced. “I hope so. They have a good career ahead of them, if they can just keep it together.”\n “They will,” Frankie assured him, squeezing my shoulder. “How bad was the aftermath? How big is the mess out there?”\n James hitched up an elegant shoulder in a careless shrug. “It’s manageable. They certainly made an impression. Don’t think they won’t have twice as big of a crowd for the next performance, though I wouldn’t make a habit of kneeing people in the crowd, if they want to keep the place packed, and the record people interested. Excuse me, ladies, I need to go speak to Tristan.”\n My eyes widened as he strode right up to the walking powder keg, as though he had no fear at all. I wanted to shout, ‘No, stop, he’s liable to blow’, but I just watched as James spoke quietly to Tristan, somehow, miraculously, managing to calm the other man in a few short minutes.\n After James worked that little miracle, Tristan came over to me almost instantly, crouching down in front of me, his eyes concerned. He touched my knee. “I’m sorry about that. Are you okay? Did I scare you?”\n I eyed him narrowly. “What on earth did James say to you to get you to calm down so fast?”\n His brows drew together, another storm gathering in his eyes. “James? It’s James, is it? When did you two get so close?”\n “Tristan! Focus!” Frankie snapped.\n He grimaced, his hand rubbing my knee comfortingly. “Sorry. He just told me that I was scaring you, and asked me if that was my intent.”\n “That was crazy back there, Tristan. You were crazy. I don’t like this. It’s not okay that you’re attacking people, and I’m throwing plates, and shoes. I’m starting to think we aren’t good for each other.” Even as I said the words, I couldn’t believe that they were leaving my mouth. I couldn’t imagine ever letting go of him willingly, let alone encouraging the idea.\n “Amen to that,” Dean muttered from across the room.\n Tristan started to turn, his golden eyes getting scary again.\n “Tristan! Focus!” Frankie barked. It actually worked. Again.\n I was watching him carefully when a slow smile transformed his face. It was evil. His sweetest smile, all for me. I was utterly powerless to resist.\n He leaned forward until our foreheads were touching, and his smile was the center of my universe.\n “Hey, now, boo,” he said softly, rubbing my knee. “We both know that’s not true. We are good for each other. In fact, I think we’re just about perfect together. I’m sorry I lost my temper like that. I just saw him touching you, and the look on your face…I couldn’t stand it. You looked frightened. I’d do a lot of things to keep you from having to endure someone’s touch on you that you don’t want. In fact, I think I’d do anything on earth to prevent that from happening.”\n I blinked rapidly, my eyes getting teary. It was just such a sweet feeling, to have someone looking out for me like that, even if I did know that it was crazy how far out of hand things had gotten as a result.\n “Forgive me?” he whispered, still giving me that sweet, evil, irresistible smile. I felt like I was the most important thing in the world to him on the other end of that smile. The feeling was addictive.\n I caved in a heartbeat, propelling myself forward, and throwing my arms around his neck. “I love you,” I said into his neck.\n His big, warm, perfect arms squeezed me tight, and in that moment, it was all that I needed.\n CHAPTER THIRTY-SEVEN\n The guys didn’t only stick to gigs at Decadence. Unfortunately, there was no place to go but down from a place like that. Dean wound up setting up a few extra performances for them. I thought that he was only doing this to try show how they didn’t need Jerry to manage them, but of course it only proved the opposite. Still, the guys were good sports, performing wherever they needed to, to try to drum up attention.\n We wound up in a real dump of a club on a Tuesday night. It was one of those off the strip locations that probably wouldn’t last a year. Frankie and I watched them play from the bar, since I’d learned my lesson about going anywhere near the stage, though this place was hardly packed. Tristan insisted that I was too much of a distraction when he was performing, and though I could have wished that it was otherwise, because I ached to be close to him when he was singing like that—I respected his wishes.\n Still, as I saw some scantily clad bimbo try to climb on stage with him, I had the urge to do something crazy.\n I stifled the urge, if barely.\n Instead, I just drank. And drank.\n Frankie was no help, ordering tequila shots. She was in a diabolical mood, getting me drunk with an unabashed smile on her face.\n She was smiling at me for so long, and so intently, that I finally had to ask her why.\n She just shrugged. “You’re fun drunk, and I wanted to get some juicy gossip about stud muffin over there out of you. That’s all.”\n I giggled. “Stud muffin,” I repeated back, then giggled again.\n “You’re feeling pretty, I see.” Everyone seemed to have adopted my phrase for being drunk.\n I nodded, glancing once at the stage, which instantly made me a little sullen, since I had to stay so far away from him, when all I wanted to do was get closer.\n “So tell me, is he the Dom I think he is?” she asked.\n I shot her a startled look. “A Dom? Excuse me? Like S\u0026M?”\n She snorted. “A Dom is not all about the S\u0026M, and I don’t see that in Tristan. No, what I mean is, does he dominate you in bed? Does he take control of you like that? And is he heavy on the kink?”\n I blushed, but this was Frankie, who’d always been beyond open with me about her own preferences, so I didn’t even think about not telling her. “He is. I never thought about it quite like that, but he definitely takes control. I need him to, and he always knew it.”\n That had her brows shooting up. “So you’d say you’re a submissive?”\n I bit my lip, thinking that the term couldn’t possibly apply to me, of all people. Except in that one thing… finally, I nodded. “I think I am, at least in bed.”\n She snorted again. “Obviously it’s only in bed. What about the kink? What have you two tried?”\n I pursed my lips, playing with an empty shot glass. “He’s restrained me twice. I didn’t think I’d like it, I thought it was for him, but the more I think about it, it was for me, and I loved it. I don’t think it’s his usual thing, but he’s really good at it.”\n She nodded. “I think you two have hit a sweet spot. Miss control freak Danika could use a little escape into the land of submission. I’ll talk to him about it, k? If anyone knows about this stuff, you’re looking at her.”\n I nodded, shooting him a look. “I really…really like it. He’s made sex so wonderful for me, but the restraints, and the blindfolds…it’s like icing on the cake.”\n She laughed. “I agree. Totally. That’s great. You know, the first time I saw him, I thought he could be part of the Dom club with us.”\n I studied her, wondering who the ‘us’ was. I was too drunk to keep such a curious question to myself. “Who is in the Dom club?”\n She smiled, and it was pure mischief. “Well, it’s me, and I would bet money that Tryst is about to join. And one other, but I have to swear you to secrecy before I tell you.”\n I was nodding before she finished talking. Who on earth would I tell?\n “You can’t even tell your fuck anonymous group about it. In fact, you especially can’t tell them.”\n I nodded again, simply dying to know now. “I swear I won’t tell a soul, not even Tristan.”\n “Well, him you could probably tell, because, as I said, he’s about to join the club.”\n “Oh my God! Tell me now! You’re killing me!”\n She leaned in close, whispering into my ear. “James Cavendish.”\n I was floored. He was so rich, and polished, and sophisticated, and well, just plain beautiful. “Are you shitting me?”\n She shook her head. “He’s into the hardcore stuff, though, nothing you’d be on board for, trust me. He makes me look like a soft Master, and I am not that.”\n I rolled this around in my head for a good ten minutes before I spoke. I was fascinated by the idea that someone that high profile, could have such an unusual sexual preference and it not be public knowledge.\n “That’s crazy,” I finally said. \n","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-45.html","bookId":1929,"book":{"id":1929,"title":"Bad Things (Tristan \u0026 Danika #1)","description":"Storyline: \n Bad Things (Tristan \u0026 Danika #1) \n Danika hasn’t had an easy life. Being insanely attracted to bad boys has never helped make it easier. \n One look at Tristan, and every brain cell she possessed went up in smoke. This man was trouble with a capital T. It was a given. \n She knew better. Bad boys were bad. Especially for her. Considering her history, it was crazy to think otherwise. So why did crazy have to feel so damn fine? \n For as long as she could remember, Danika had been focused on the future with single-minded purpose. Tristan came along and taught her everything there was to know about letting go, and living in the present. She fell, hard and deep. Of course, that only made her impact with the ground that much more devastating. \n Bad Things is about Tristan and Danika, and their train wreck of a love story. This series can be read as a standalone, or with the Up in the Air series.\n \n","cover":"https://allnovel.net/images/bad-things-tristan-danika-1.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/bad-things-tristan-danika-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:54:17 AM"}}
