{"id":64590,"no":49,"title":"Page 49","content":"I glared at him. “Excuse me?”\\n\\n “Were you on something tonight?”\\n\\n That was the sad part. I’d done coke before, and it hadn’t made me act half as crazy as my jealousy had. I knew he was onto something, with the anger management. “Nada. Fine, I’ll do anger management.”\\n\\n “I’ll be happy to put you up in a rehab facility for substance abuse, if that is an issue, as well.”\\n\\n “It’s not,” I bit out, done with the conversation.\\n\\n “Okay, then. I’ve posted your bail, as well, so you are free to go right after we discuss one more thing.”\\n\\n I glanced around, as though it was a prank. I knew for a fact that you couldn’t do that to a guy, and then just walk out of jail that night. “Are you shitting me?”\\n\\n “Not at all. I’ll add it to your tab. I just wanted to talk to you about your magic tricks. Danika has told me about your sleight of hand. I’m asking unofficially, you understand, because I have my old act under contract for two more years. But when his contract is up, he’s out. He just doesn’t have his heart in it anymore. Sometime between now and then, I’d like to see some of your tricks. We are looking for something different, so keep that in mind as you prepare.”\\n\\n I nodded, totally stunned that, after all the time I’d spent at that, having nothing happen, now something huge was happening, and it was all because of Danika.\\n\\n “Okay, that is all,” he said, rising from his chair. “I’ll send someone in to take your cuffs off and get you out of here.”\\n\\n I smiled at him, a purely ornery smile, because, in a purely ornery mood, I’d stolen one of the cops handcuff keys.\\n\\n I unlocked myself with a few swift, quiet motions. This was the cheapest kind of trick, the kind where you weren’t even doing a trick, you were just performing the unexpected, but I was in a mood, and I didn’t really care that it was cheap.\\n\\n I dropped my cuffs loudly on the table, and Cavendish gave me a very startled look, his eyes darting from the cuffs then back to me, again and again.\\n\\n “How did you do that?” he asked, looking like he’d gotten a genuine kick out of it. That was good, because if he got a kick out of me phoning it in, I had a good shot at impressing him with my more involved tricks.\\n\\n I shrugged. “Magic,” I told him.\\n\\n He laughed.\\n\\n I called Danika for five days, over and over, without a response. I finally resorted to leaving message after message, at first angry, then pleading, then sappy, then angry again, and finally, flat out desperate.\\n\\n I told her I loved her, which I probably shouldn’t have said for the first time in a message, but I was desperate. I called her a coward, then cursed her, then begged her.\\n\\n I tried to go to the house once, but she only sent Jerry out to tell me that they would call the police if I didn’t leave.\\n\\n After that, I holed up in my apartment for days, and went into full on self-destruct mode. I was drunk or high or both every waking moment, denying to myself that this could possibly be it for us.\\n\\n What if she never talks to me again? I tortured myself with that question. I didn’t know what I’d do. I was filled with regrets. I hadn’t opened up to her as much as I should have, and she’d complained about it often. I should have spilled my guts about everything, even if I did hate to talk about the crap she wanted me to tell her.\\n\\n I found myself telling her everything about me in voicemails that she’d probably never even listen to. I was that desperate.\\n\\n “I’m not good at this sort of thing, but I’ll do my best. If you’re hearing this, you know I’m trying here, and in return I’d just like to hear from you, to have a clue how you’re doing.”\\n\\n I took a deep breath, trying to figure out where to start. “Fuck. Maybe I should be texting you this, or emailing, or something, but bear with me. I’ve never liked relationships. I’ve never thought that something like that could serve two people equally. I saw that from the way my mom was with one worthless boyfriend after another. She’d bend over backwards for them, and all they had to do was feed her bullshit lines and act halfway decent some of the time. I guess that’s why I started to think they were kind of a scam. This belief was reinforced for me, over and over, as I watched her let men walk all over her for the sake of the ‘relationship’.”\\n\\n “Nat was just sort of the icing on the cynical cake. We were just kids when we got together, and we made a lot of stupid mistakes. Nothing I did ever made her happy, and she had all of this emotional blackmail crap she tried to pull on me daily. Still, I stuck around, because I was young, and stupid, and I wanted so badly to be the opposite of my father, to be the guy that sticks around through thick and thin, that I was willing to put up with a lot, even being miserable, to prove that I was better than him, that I was nothing like him.”\\n\\n The message timed out, and I called again, waiting for the beep, and then continued right where I’d left off.\\n\\n “Nat guilted me into getting her a ring. A ring I couldn’t afford. She was relentless about it, said all of her happiness was tied up in it, and if I didn’t make her happy, well, that was my fault, since her happiness was my job. She wore me down, and I busted my ass to get her a way too expensive ring. She told me it embarrassed her, because the diamond was so small. It was a three thousand dollar ring, so I had no idea what she meant, but that was how the relationship went. There were more bad times than good, more work than fun, more misunderstandings than communications. It exhausted me, and I was already fed up when I found out she was sleeping around.”\\n\\n It timed out. I didn’t pause before calling and starting right up again.\\n\\n “Nat pulled all kinds of jealous tantrums on me, always accusing me of cheating, when I wasn’t. I think that’s one of the reasons why it was so hard for me to stomach how she’d lied to me, again and again. I broke it off, and swore off relationships altogether, because she had taught me that I just wasn’t good at them.”\\n\\n “I see now how wrong that was, how much power I’d given her, even when I’d been over her for years. I’m sorry for that. I’m sorry that you and I had a rough start, and part of it was because of baggage that didn’t deserve the weight I’d given it.”\\n\\n It timed out again. I redialed again.\\n\\n “I see now that I didn’t know a thing about love before I met you. When it’s right, like it is with us, it doesn’t make your life harder, it makes your life better, even when it’s hard. I’ve never been so happy as I’ve been with you, and I don’t begin to know how to get past that. I can’t stomach the thought that you could get over me, when I know I won’t be getting over you. I love your smile, your honesty, your loyalty. I love your sarcastic sense of humor, and the way your eyes light up when you’re giving me shit. I may just love that the most. I don’t just love you, I need you, and I don’t begin to know how that’s ever going to stop. I guess this is a warning, in a way. If you think I’m letting you go easy, you’re in for a shock. Buckle up, sweetheart, one way or another, I’m getting you back.”\\n\\n That was the last message I left before the waiting began.\\n\\n I waited.\\n\\n And waited.\\n\\n Five more days passed, and I let the black moods take me again, but it wasn’t because I’d given up. It was only that I couldn’t bear how much I missed her, as I bided my time.\\n\\n I thought that waiting was the hardest thing I’d ever been through in my life, but life was about to prove me very wrong.\\n\\n CHAPTER FORTY\\n\\n TRISTAN\\n\\n I doubted anyone had ever had their worst nightmare come to life and not doubted that it was real. And so my first reaction to the news was denial. This had to be a trick. It had to be some sick prank. Jared couldn’t be gone. He was my baby brother. It was my job to protect him. It wasn’t possible that something like this could have happened to him on my watch…\\n\\n My mother was sobbing endlessly, but the noise was always somewhere in the background, as though my brain was muting it, to soften the pain.\\n\\n I didn’t cry. I just sat, blank-faced and quiet, telling myself over and over again that this wasn’t really happening.\\n\\n A stinging slap to the face was what finally took me painfully out of my own head.\\n\\n I blinked at my mother, who stood, furious and crying, in front of me.\\n\\n “This is your fault!” she screamed at me. “It was your job to look after him, and look what’s happened! You shouldn’t have encouraged him to act so wild, you bastard!”\\n\\n Her words hurt, each one inflicting a deeper wound, and some even opening old ones up wider.\\n\\n I did the only thing I knew how to do under attack. I went on the offensive. “Me?” I asked her quietly, a lifetime’s worth of contempt in the short word. “Me? You were supposed to be our mother! You fed us pills like candy, you were drinking hard liquor and smoking pot with us by the time we were twelve! And you blame me for this? You blame me for the fact that he was a drug addict, when you’re the one that got him hooked!”\\n\\n She collapsed to the floor, sobbing uncontrollably, and I instantly regretted every word I’d said, even though it had all been the truth, if a hard truth to stomach.\\n\\n I tried to comfort her, but she would have none of it, and I gave up quickly, going into a numb sort of stupor.\\n\\n This isn’t real.\\n\\n This can’t be happening. Not to Jared. He was the sweetest kid, always. Things like this didn’t happen to kids that sweet. Bad things were supposed to happen to bad people, and Jared had always just been good.\\n\\n He didn’t fight like me. He wouldn’t have hurt another person to save his own life. He didn’t sleep around. He’d been waiting for the right girl to come along, for fuck’s sake. Every shortcoming I had, he had been above, and I’d always taken a deep kind of pride in that.\\n\\n People were talking in the background, though I couldn’t have named them. I wasn’t paying much attention to anything that was going on, so I only caught bits and pieces of what they were saying, little snippets here and there, and none of it made any sense to me.\\n\\n Jared had died of a heart attack. A heart attack? A fit twenty-one year old didn’t just have a heart attack. Did he? But of course that wasn’t all of the story. Even in full on disconnect mode, I knew that. Drugs were the story. The only question was what, and how he’d miscalculated so far that he’d killed himself. Killed himself? No. No. No. That was wrong. Wrong. Wrong.\\n\\n I was in my mom’s house, though I didn’t even remember driving there. I remembered getting the phone call from Cory, and then I’d just been here, my mother’s hysterical cries, her shrill accusations, just background noise.\\n\\n I’d known lots of siblings that didn’t get along. Dean had a little brother, and all that they seemed to do was rip into each other. Even mellow Cory and his sister hardly spoke.\\n\\n That had never, never been the case with Jared and me. We had always been best friends. Even when we didn’t agree on something, we respected each other, always, and respect went a long way. I didn’t know how to accept the idea of his loss. I didn’t know how to get past the denial, and face the absolute horror, the utter agony of it. \\n\\n","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-49.html","bookId":1929,"book":{"id":1929,"title":"Bad Things (Tristan \u0026 Danika #1)","description":"Storyline: Bad Things (Tristan \u0026 Danika #1) \\n Danika hasn’t had an easy life. Being insanely attracted to bad boys has never helped make it easier. \\n One look at Tristan, and every brain cell she possessed went up in smoke. This man was trouble with a capital T. It was a given. \\n She knew better. Bad boys were bad. Especially for her. Considering her history, it was crazy to think otherwise. So why did crazy have to feel so damn fine? \\n For as long as she could remember, Danika had been focused on the future with single-minded purpose. Tristan came along and taught her everything there was to know about letting go, and living in the present. She fell, hard and deep. Of course, that only made her impact with the ground that much more devastating. \\n Bad Things is about Tristan and Danika, and their train wreck of a love story. This series can be read as a standalone, or with the Up in the Air series.\\n","cover":"https://allnovel.net/images/bad-things-tristan-danika-1.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/bad-things-tristan-danika-1.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:54:17 AM"}}
