{"id":75555,"no":2,"title":"Page 2","content":"Sweat fell like tears down her face, and her throat was on fire—although that was less about the vomiting than the sawing inhales she had been taking as she deadlifted. And don’t get her started on her lungs. She felt as though she had been trying to find oxygen in the middle of billowing hot smoke.\n Clank. Clank. Clank…\n When she was able to, she lifted her head and focused. Across the weight room, a massive male was doing leg presses in a slow, controlled fashion, his forearms bulging from where he was gripping the pegs by his hips, his thigh muscles carved in stone, veins popping out everywhere.\n He was staring at her. But not in a creepy way.\n More like in an okay-is-it-time-to-call-a-doctor manner.\n “I’m all right,” she said, looking away from him. Although with his headphones on, it wasn’t like he could hear her.\n I’mallright. I’mallright. NoreallyI’mallright—\n Leaning to the side, she snagged a fresh white towel from a stack on one of the benches and mopped up. The Black Dagger Brotherhood’s training center was a case of state of the art, best of the best, professional grade all the way: From this iron dungeon of self-inflicted pain to the firing range, the classrooms, the Olympic pool, the gym, and then the medical clinic, PT facility, and surgery suites, no expense had been spared, and upkeep was just as meticulous and costly.\n With a final clank, the male sat forward and did a pass of his own face. He had dark brown hair that had recently been cut, the sides so tight they were nearly shaved, the top left long and loose. His eyes were some kind of brown, and he had an all-American kind of look—well, except for the fangs, which were straight-up Bram Stoker, and the fact that he was not any more human or American than she was. The white muscle shirt he had on was stressed the fuck out trying to stretch over his enormous pecs, and his dark, hairless skin was just the same, taut nearly to the point of structural failure across his six-pack and lats.\n He had no tattoos. No false airs. Unfancy clothes. And he rarely spoke—if he did open his mouth, it was always logistical, like, what machine was she going to use next, or was this her towel? He was unfailingly polite, distant as a horizon, and seemingly unaware she was a female.\n In short, this stranger was her new best friend. Even though she didn’t know his name.\n And they did spend a lot of time together. At the end of every in-house night for the trainees, the two of them were here alone, the Brothers working out during the day, the other trainees already exhausted from whatever they had been doing in class.\n Novo always had juice left in the tank, though.\n Fuck 5-hour Energy or Xenadrine. Personal demons were waaaaay better for getting your ass in gear.\n Oh, and then there was the other reason she preferred to vom into a Hefty bag rather than hang with the others while they waited for their bus to take them down the mountain.\n “You’re bleeding.”\n Novo jerked her head up. The male was standing over her, and when she frowned, he pointed to her hands.\n “Bleeding.”\n Lifting one of her palms, she saw that, yup, she certainly was leaking. She had forgotten her gloves, and the bar that she had been holding the five hundred pounds with had cut into her.\n “What’s your name?” she asked as she pressed the towel into the raw spots.\n Man, that stung.\n When he didn’t answer, she looked up again. And it was at that point that he placed his hand over his sternum and bowed.\n “I am Ruhn.”\n “You don’t have to do that.” She folded the terrycloth in half and re-wiped her brow. “The bow thing. I’m not a member of the glymera.”\n “You are a female.”\n “So?” When he seemed honestly confused, she felt like a bitch. “Anyway, I’m Novo. And I’d shake your hand, but yeah.”\n As she flashed him what he had pointed out was injured, he cleared his throat. “It is nice to meet you.”\n His accent was like hers, without the haughty, long vowels of the aristocracy, and she instantly liked him even more. As her father had always said, rich people could afford to talk slow ’cuz they didn’t have to work for a living.\n Which made that group of entitled lightweights really hard to respect or take seriously.\n “Are you joining the program?” she asked.\n “For?”\n “The training program?”\n “No. I am just here to work out.”\n He offered her a smile—as if that encompassed his entire life story as well as all his plans for the future—and then he went over to the chin-up bar. The reps he did were unbelievable. Fast, but controlled, over and over again, until she lost count. And still he kept at it.\n When he finally stopped, he was breathing deeply, but hardly taxed.\n “So why don’t you?”\n “What?” he said with surprise. Like maybe he had forgotten she was still sitting there.\n “The training program. Why don’t you join us?”\n He shook his head sharply. “I’m not a fighter.”\n “You should be. You’re really strong.”\n “I am just used to manual labor. That is where it comes from.” He paused. “You’re in the program?”\n “Yeah.”\n “You fight?”\n “Oh, yeah. And I like it. I like to win and I like to inflict pain on others. Particularly slayers.” As his eyes popped, she rolled her eyes. “Yes, females can be like that. We don’t need permission to be aggressive or strong. Or to kill.”\n When he turned away, re-gripped the chin-up bar, and resumed his workout, she cursed at herself.\n “Sorry,” she muttered. “That wasn’t directed at you.”\n “Is there someone else here?” he said between reps.\n “No.” She got to her feet and gave her head a shake. “Like I said, sorry.”\n “It’s okay.” Up. And down. “But…” Up. And down. “…why aren’t you…” Up. And down. “…with them?”\n “The other trainees?” She looked at the clock on the wall. “They’re happy to chill before the bus comes. I hate loitering around. Time to go, actually. See ya.”\n She was just at the door when he spoke up. “You shouldn’t do that.”\n Novo glanced over her shoulder. “Excuse me?”\n Ruhn nodded to the trash bin. “You throw up a lot when you exercise. It’s not healthy. You push too hard.”\n “You don’t know me.”\n “I don’t have to.”\n She opened her mouth to tell him to keep his God complex to himself, but he just turned away and resumed those chin-ups of his.\n Oh, right, she thought. Fucking fine. Why don’t I just go watch Tasty vids on BuzzFeed and take selfies in yoga poses.\n #nothrowupzone\n With her temper surging, she so wanted to pick a fight with him. Even though she was tired to the point of butt-hurt, and he might have a point about the barfies, fuck that. Live and let live, you know?\n Or, live and let self-destruct.\n Potato, potahto.\n But whatever. No reason to argue with a stranger about something she had no intention of doing any differently.\n Out in the corridor, the air was cooler—or maybe that was just a case of perception, the long concrete-walled chute to the parking area making it seem like there was a whole lot more air available for the taking. Forcing herself to walk forward, she headed to the locker room she and Paradise used as the only two females in the program. And the second she pushed her way in, she closed her eyes and considered going home sweaty and disgusting.\n Sonofabitch.\n That goddamn fragrance.\n Paradise’s shampoo was like spray paint on the walls, carpeting on the floor, ceiling fans whirling at a thousand miles an hour, strobe lights and a disco ball: In the cramped room, it took up every square inch of space.\n What was worse? It wasn’t like the female was hateful or incompetent or a Barbie doll that could be written off as Taylor Swift in a Nirvana world. Paradise had been the one who’d lasted the longest during that hellish orientation, and she was a crackerjack in the field, with shockingly fast reflexes and a dead-on shot that had to be seen to be believed. \n","sourceLink":"https://allnovel.net/blood-kiss-black-dagger-legacy-1/page-2.html","bookId":1779,"book":{"id":1779,"title":"Blood Kiss (Black Dagger Legacy #1)","description":"Storyline: \n The legacy of the Black Dagger Brotherhood continues in a spin-off series from the #1 New York Times bestselling author. \n Paradise, blooded daughter of the king’s First Advisor, is ready to break free from the restrictive life of an aristocratic female. Her strategy? Join the Black Dagger Brotherhood’s training center program and learn to fight for herself, think for herself…be herself. It’s a good plan, until everything goes wrong. The schooling is unfathomably difficult, the other recruits feel more like enemies than allies, and it’s very clear that the Brother in charge, Butch O’Neal, a.k.a. the Dhestroyer, is having serious problems in his own life. \n And that’s before she falls in love with a fellow classmate. Craeg, a common civilian, is nothing her father would ever want for her, but everything she could ask for in a male. As an act of violence threatens to tear apart the entire program, and the erotic pull between them grows irresistible, Paradise is tested in ways she never anticipated—and left wondering whether she’s strong enough to claim her own power…on the field, and off.\n \n","cover":"https://allnovel.net/images/blood-kiss-black-dagger-legacy-1.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-kiss-black-dagger-legacy-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:34:47 AM"}}
