{"id":75583,"no":30,"title":"Page 30","content":"“Look,” he muttered, “whatever it is, just say it. We’re working together, right? And I don’t want you involved in all this if you’re compromised.” There was a long silence. And then Ruhn re-crossed his arms over his chest with mostly no grimace. “I’ve always known you didn’t approve of me.” Saxton recoiled. “I beg your pardon?” — “I don’t see what the problem is.” As Novo spoke, she tried to look as strong and powerful as she could. Okay, fine, so she was still in her hospital bed with wires and tubing in places she would really prefer to be wire-less and tube-lacking, and she was, in fact, wearing a johnny that had little pink bouquets of flowers all over it, but damn it, she was perfectly fine. And she had every right to— “You’re not leaving this facility.” Dr. Manello stood over her and smiled like he held all the cards. “I’m sorry.” To keep from throat-punching the human, she looked down at herself…and blamed those frickin’ rosebuds that were all over her johnny. Why couldn’t the hospital gowns have prints of, like, Deadpool’s mask. Knives. Bombs with the wicks lit. Vials of poison. “No, you’re not sorry,” she bitched. “You’re right, I don’t give a shit that you’re pissed off at me. What I care about is your heart. Now, I’ll spare you the be-a-good-little-girl speech, because I don’t want to get castrated—but do me a favor and don’t screw up all my nice knit-one-purl-two and stay where you are, ’kay.” “I feel fine.” “You passed out going to the bathroom.” “I got dizzy, that was all.” “I found you on the floor, in a heap.” “I had my IV still in.” “But not your catheter, which you had taken out yourself.” He put his palm up to stop her from arguing. “Tell you what, I’ll award you the Patient of the Night trophy for all your efforts. Congratulations, your prize is a jelly donut and a whole lot of going-absolutely-nowhere.” Novo grunted and tried to link her arms over her chest—when that caused an arrhythmia that made some alarm go off, she had to let them sulk back down to either side of her body. “I’m fine.” “No, you will be fine.” Dr. Manello went around and reset whatever monitor had started talking. “In another night or two. Provided you stay put.” “FYI, I’m giving this establishment a really crappy Yelp review.” “I would be honored.” The doctor put his hand on his heart and bowed. “Thank you—oh, and your mother called.” Novo went to sit up and hissed before collapsing back. “My mother?” “Yeah, she’d been trying to reach you? She was afraid you were dead. Needless to say, I told her you were breathing. Didn’t mention that I knew that because of an oxygen sensor clipped to your finger, but at least I was confident that I was giving her accurate information.” Novo tried to look like she didn’t care. But that fucking alarm, the one connected to her fucking heart, started going off again. “What did she say? I mean, what did you tell her?” She shut her lids. “Not that I got hurt, right?” “I’m not authorized to report on the condition of my patients.” He leaned over to whatever was beep-beep-beep’ing and silenced things again. “I informed her you were in class for the rest of the night. But you may want to call her when you feel up to it.” How’s never, on that one? “Can you give me a doctor’s note that says I don’t have to.” “Will you promise to stay in bed?” “Sure, but I’m pretty certain that’s something I’ll break.” “Fair enough. Quick question. If you don’t want to hop on the horn with your family’s version of Carol Brady, I’m not sure her getting a note from your surgeon is going to de-escalate whatever is going on, am I right?” “Look, Doc, if you’re going to continue to be logical and reasonable, I’m going to have to ask you to reassign my case to a crazy person.” “Right, ’cuz why be difficult when you can be perfectly unreasonable.” “Exactly.” Dr. Manello smiled and then headed for the door. Before he opened the way out, he hesitated. “Is everything okay in your family?” He held up his palm again. “You don’t have to go into specifics if you don’t want to. It’s just…she was worked up, and it’s very clear you’re avoiding her.” “My mother is always worked up about something—and usually it’s my sister. Who’s getting mated. As her bridesmaid—oh, sorry, I guess I’m the honor maid, or something?—I’m supposed to be planning things, not doing my job to protect the species. Yeah, ’cuz really, picking out dresses and organizing a goddamn bachelorette night out is more important than fighting lessers.” “I didn’t know vampires did that kind of shit. Bridal showers and stuff.” “We don’t. My sister needs all the attention in the world, however, so one species’ traditions are not enough for her. She needs two.” “What a charmer.” Her surgeon smiled even more, his handsome face crinkling at the eyes and around his mouth. “And may I just say, in a totally non-creepy way, that you are going to look fantastic in bows and ribbons. Especially if they are the color of bubble gum.” Novo closed her eyes with a groan. “Can you just knock me out?” “Nah, I’m afraid if I hit you in the face, the rest of your classmates will beat my ass.” “I was talking drugs.” “Ah, where’s the fun in that.” The man got serious. “You rest up. If you’re stable by the time the night’s over, I’ll consider letting you go home, ’kay?” As Novo flipped her lids back open, he glared at her. “But you have to feed. I don’t care who from, and that is mandatory.” After the doctor left, Novo thought about the bride-ette night, or whatever you call it, and decided she should take all those females to The Keys. Yup, surprise! It’s a sex club! Now get your nipple clips on there, young ladies, and go find yourself a glory hole. As she pictured her sister trying to make it through just the wait line, she had to laugh—and the sharp-shooter that came in response made her worry that she had sprung herself a leak. No alarms, though. Just the regular beeping that seemed to suggest some kind of circulation was happening on a regular basis— All at once, she was back in that empty cold house, on the bathroom floor, bleeding from between her legs. Pain, different than now, was deep in her belly, twisting her like a rag until she thought she would snap in two. No medical help then. No nice doctor with a sharp wit and kind eyes, no medical equipment, no drugs. No clear understanding of what was happening to her until something had come out of her. Her young. Not alive, although perfectly formed. There had been so much blood. She had been sure she was going to die. Fate had had other plans for her. In fact, she had lived. It turned out that just because you wanted to gain entrance unto the Fade didn’t mean you were granted what you prayed for. No, she had survived, but she had never been whole again. Wait…that was wrong. She hadn’t been whole even before the miscarriage had happened, and afterward? How could she not blame herself for the loss. Her body had failed her young, had let that innocent being down— No, not her body. Her mind, her character. She had been so distraught over Oskar leaving her for Sophy that her emotional meltdown had caused the miscarriage: She had not been strong enough for her young, hard enough, tough enough. She had failed. “Stop it,” she snapped. “Just…fucking stop.” To get her mind off the past, she focused on getting herself the hell out of the clinic. Feeding, she thought. She needed to get the feeding thing arranged. With a grunt—that suggested the doc had a point about the whole not-yet thing—she reached out to the rolling table closest to her. Batting away the can of ginger ale, the rose-colored plastic bedpan, the Kleenex box, and the remote to the TV she had yet to turn on, she finally grabbed her phone.","sourceLink":"https://allnovel.net/blood-kiss-black-dagger-legacy-1/page-30.html","bookId":1779,"book":{"id":1779,"title":"Blood Kiss (Black Dagger Legacy #1)","description":"Storyline: The legacy of the Black Dagger Brotherhood continues in a spin-off series from the #1 New York Times bestselling author. Paradise, blooded daughter of the king’s First Advisor, is ready to break free from the restrictive life of an aristocratic female. Her strategy? Join the Black Dagger Brotherhood’s training center program and learn to fight for herself, think for herself…be herself. It’s a good plan, until everything goes wrong. The schooling is unfathomably difficult, the other recruits feel more like enemies than allies, and it’s very clear that the Brother in charge, Butch O’Neal, a.k.a. the Dhestroyer, is having serious problems in his own life. And that’s before she falls in love with a fellow classmate. Craeg, a common civilian, is nothing her father would ever want for her, but everything she could ask for in a male. As an act of violence threatens to tear apart the entire program, and the erotic pull between them grows irresistible, Paradise is tested in ways she never anticipated—and left wondering whether she’s strong enough to claim her own power…on the field, and off.","cover":"https://allnovel.net/images/blood-kiss-black-dagger-legacy-1.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-kiss-black-dagger-legacy-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:34:47 AM"}}
