{"id":75610,"no":57,"title":"Page 57","content":"Ruhn crossed his arms over his chest and stared at the floor. “Was it someone in this household?”\\n\\n “Yes.”\\n\\n “Who?”\\n\\n Saxton hesitated. “Blaylock, son of Rocke.” When there was no response, he sighed. “Blay is the one. Was the one.”\\n\\n Ruhn was quiet for a time. “I find myself rather jealous of the male at the moment.”\\n\\n “You are so honest.” Saxton shook his head with admiration. “I am amazed at how transparent you can be.”\\n\\n “Is that a good thing or a bad thing?”\\n\\n “I love it. It’s almost as attractive as your smile.”\\n\\n The male glanced up. Blushed. Looked away. “Blaylock is a very handsome male. He is kind, too.”\\n\\n “He is also a fighter. Just as you were tonight.”\\n\\n Ruhn frowned. “Are you trying to make me feel less guilty for my past?”\\n\\n “Yes, I can’t help it. I have thought of little else since we parted. I hate that you feel badly for the torture you were subjected to. You were a victim.”\\n\\n The male crossed his arms as if he were holding himself. “I don’t want to talk about it anymore.”\\n\\n “We don’t have to. But I guess…you were honest with me and I want to be honest with you. I got my heart broken very badly, and I never thought that anyone other than Blay would reach into that part of me. I think I’ve believed that he broke something fundamental in my makeup. That I was forever changed. And then I met you.”\\n\\n Ruhn’s head whipped up, his eyes widening.\\n\\n “I remember the moment I first saw you.” Saxton smiled. “It was at the meeting with you, Rhage, and Mary pertaining to Bitty’s adoption. I couldn’t stop looking at you.”\\n\\n “But I thought it was because you didn’t trust me or disapproved. I’ve always—anytime you looked at me, I figured it was…”\\n\\n “You are a very captivating male. But I assumed you were straight.”\\n\\n “Well, I never thought in terms of straight or gay before. I always thought females were the only…you know, option. Until I met you.”\\n\\n Saxton smiled again. “Just so you know…I think I could fall in love with you, too. And I didn’t imagine I would say that about anyone, or to anybody, ever again. The truth is, though, I want to see where this connection is going. If it’s something you’re interested in. You were brave by saying what you did…and I want to be brave, too.”\\n\\n The blush that hit Ruhn’s face was one for the ages—and his shy happiness made Saxton feel like he was doing the right thing.\\n\\n You couldn’t soar if you didn’t leap.\\n\\n No one knew what the outcome of this was going to be. But he’d wanted to go traveling. He’d wanted to leave Caldwell and get out of this rut he’d fallen into.\\n\\n There was a journey to be had with Ruhn.\\n\\n “Yes,” the male said. “I would like to know, too.”\\n\\n “Can I kiss you now?” Saxton asked.\\n\\n —\\n\\n Ruhn moved across the room and felt transformed. It seemed impossible to travel such a vast emotional distance when going only a matter of feet, but as he came to stand in front of Saxton, he felt renewed.\\n\\n It was extraordinary. The world had previously seemed gray and closed off, but now it had a horizon with a glorious night sky full of stars. And all of that universe was contained in the handsome face that looked up at him from the foot of the bed he slept in.\\n\\n “Yes,” he said as he touched Saxton’s blond hair. “You may always kiss me.”\\n\\n Except he was the one who bent down and it was his mouth that found the other male’s. So sweet, so soft…and he instantly hardened in the place that counted most.\\n\\n “Lock the door?” Saxton said against his mouth.\\n\\n “Yes.”\\n\\n One of them took care of it. He didn’t really track which. And then he sank to his knees in between the thighs of the male. As he was tall, he was able to keep the contact going at their mouths as his hands found all kinds of things that had to go: jacket, shirt…\\n\\n He paused when he got to the male’s button and fly.\\n\\n Saxton was also hard, his arousal a thick shaft under the fine fabric.\\n\\n Looking up, Ruhn drank in the sight of the bare chest, the shoulders, the collarbones. “I don’t know how to do this?”\\n\\n “Oh, God…you do, you do.”\\n\\n “Would you like me to…”\\n\\n “I’m about to come just looking at you between my legs. Do anything you want to me.”\\n\\n Ruhn smiled and then fumbled with the pants. He didn’t want to rip them—well, actually, he wanted to tear them off the male, but he didn’t want to damage things. The slacks were polite, though. They all but melted open, revealing a pair of black boxer briefs…and that erection.\\n\\n Saxton rose to his feet. “Allow me.”\\n\\n And then the male was naked.\\n\\n Magnificent was the only thing Ruhn could think of as he stroked up smooth thighs to a flat stomach and graceful hip bones.\\n\\n The erection was even better. Stiff, proud, begging for attention.\\n\\n Ruhn gripped it. Warm and hard. And Saxton moaned, the male’s head falling back so only the point of his chin was visible.\\n\\n Leaning in, Ruhn opened his mouth. He’d thought it might be awkward. Instead, it was as the sex in that kitchen had been…the most natural thing to suck the cock in, and stroke it, and tease the head with his tongue.\\n\\n When Saxton collapsed backward onto the bed, Ruhn went with him. And he watched the King’s venerable, proper solicitor arch with abandon—especially as the release arrived.\\n\\n Which Ruhn was more than happy to attend to.\\n\\n More than once.\\n\\n And then Saxton began to return the favor: Ruhn rolled over and watched with awe as he himself was stripped bare. That blond head dipped down and the sensation of wet suction had him cursing and fisting the duvet. Focusing on the canopy above him, he strained until sweat broke out all over him.\\n\\n He couldn’t look. Not because he was ashamed or it was ugly.\\n\\n The glances he spared himself were too hot, too erotic, Saxton’s beautiful face and stretched lips too much to handle.\\n\\n He came into the male’s mouth.\\n\\n And called Saxton’s name until he was hoarse.\\n\\n On Friday night, Novo pulled her black leathers into place, buttoned the fly, and pivoted around to the mirror over her bathroom sink. Her black muscle top was more than willing to get tucked in and stay put. Hair was back and braided. And in another minute and a half, she was going to have her combat boots on.\\n\\n It felt so fucking good to be in her own skin again. To have her energy back. To stop wondering, every second, whether her heart was going to go into a fatal arrhythmia.\\n\\n Too bad this wasn’t her first shot back in the field.\\n\\n No, no. It was bachelorette party time. Yay.\\n\\n No, really. YAY.\\n\\n But hey, at least she wasn’t fresh out of surgery, peeing into a bag. The comparison was…well, at least a moderate improvement in terms of torture.\\n\\n Okay, fine, the two were neck and neck.\\n\\n In this scenario, though, she only had to endure an hour or two before she returned to her real life. With the stabbing and operation, she had had to die a couple of times and dig herself out of the owie-hole over the course of days and nights.\\n\\n Walking out into the main room, she went over to where she kept her weapons in a locked fire safe the size of a small refrigerator. The safe was the most expensive thing she owned in the shithole she lived in, but as soon as she had gotten into the training program and received her first stipend, she had invested in the beast. The last thing she needed was a human breaking in and getting a bunch of guns with no serial numbers, knives made by a master smith who was a vampire, and explosives.\\n\\n And let’s face it. This wasn’t the best of neighborhoods.\\n\\n The hundred-foot-by-hundred-foot shoebox she rented was part of the basement of a walk-up and it had no windows, which was secure, but it meant things smelled a little moldy even in the winter. The building was owned by a vampire, however, which made everything easier, and the best thing? It was hers.\\n\\n Her family didn’t even have the address.\\n\\n Pulling the blanket up off the safe—yeah, ’cuz, oh, that was savvy camouflage—she put in the code, cranked the door open, and took out her nines and one short-bladed dagger. On second thought…no, just one nine. Any more firepower and she might be tempted to turn her sister into Swiss cheese. \\n\\n","sourceLink":"https://allnovel.net/blood-kiss-black-dagger-legacy-1/page-57.html","bookId":1779,"book":{"id":1779,"title":"Blood Kiss (Black Dagger Legacy #1)","description":"Storyline: The legacy of the Black Dagger Brotherhood continues in a spin-off series from the #1 New York Times bestselling author. \\n Paradise, blooded daughter of the king’s First Advisor, is ready to break free from the restrictive life of an aristocratic female. Her strategy? Join the Black Dagger Brotherhood’s training center program and learn to fight for herself, think for herself…be herself. It’s a good plan, until everything goes wrong. The schooling is unfathomably difficult, the other recruits feel more like enemies than allies, and it’s very clear that the Brother in charge, Butch O’Neal, a.k.a. the Dhestroyer, is having serious problems in his own life. \\n And that’s before she falls in love with a fellow classmate. Craeg, a common civilian, is nothing her father would ever want for her, but everything she could ask for in a male. As an act of violence threatens to tear apart the entire program, and the erotic pull between them grows irresistible, Paradise is tested in ways she never anticipated—and left wondering whether she’s strong enough to claim her own power…on the field, and off.\\n","cover":"https://allnovel.net/images/blood-kiss-black-dagger-legacy-1.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-kiss-black-dagger-legacy-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:34:47 AM"}}
