{"id":75613,"no":60,"title":"Page 60","content":"“Hey, there.” His voice was still the same. Soft, a little husky. “It’s good to see you, Novo.” She’d wondered for a long time how this would play out. What it would be like to see him, scent him, hear him speak. She had always assumed she would be crippled with pain and that tears, those hated external signs of weakness, would blur her sight and leak out onto her cheeks. Her heart would thunder, her palms would sweat, her… I’m looking at a boy, she thought. This was not a full-grown male standing before her, and chances were good, no matter his age, he would always be as such. This was someone who needed a Sophy, somebody who would provide him with the contours of his life, tell him what his wardrobe should be, order him into some situations and out of others. Novo had ascribed much to him, in her naiveté. Maturity through hard experience wiped that away. “Good to see you, too,” she murmured. His eyes roamed around the human crowd. “I heard you’re in the Brotherhood’s training program.” “I am.” “Pretty impressive. I was surprised when Sophy told me. How’s it going?” “It’s a lot of work. But it’s good. I’m happy with it.” She stopped there for two reasons: One, she didn’t think it was any of his business, and two, she didn’t want to seem defensive. “I always knew you’d do something big.” Now his eyes shifted to hers and stayed put. “I mean, ever since I first met you…you were different.” “Sophy has her own unique characteristics.” She shrugged. “To each their own.” “Yes. To each…” As he let the sentence drift, she expected him to say a quick, awkward buh-bye and head back to Mama, as it were. But he didn’t. He just stared at her. Novo was the one who broke the eye contact. And yup, guess who’d had enough of the reunion BS? Sophy came up to her male and linked her arm in his. “Dance with me, Oskar. Come on.” Novo got to her feet. “I’m going to head out, Soph.” “Oh, you mustn’t! It’s time to dance—stay a little longer.” Those eyes narrowed. “It’s the least you can do considering that Sheri has had to do all the work for tonight and for the wedding ceremony.” On that, the female pirouetted away and took her deadweight with her—after she made him take his coat off and leave it at the table. Novo dropped back in her chair. The way she looked at it, she could either blow another thirty minutes here, or end up with double that on her phone later tonight and tomorrow. At least sitting at the table, she didn’t have to talk to anyone. Sophy’s blond hair gleamed under the lights above the dance floor, and her thin body in its floaty dress made Oskar seem even bigger and stronger. The pair of them were quite a picture, young romance caught right on the precipice of the rest of their lives. Provided you didn’t look too closely. As Oskar held his female in his arms, he was looking over her head, his expression bland. On her side, Sophy was talking to him with an urgency she was masking with that Proactiv commercial smile of hers, the one where she was just so Happy and Centered in Her Life. Clearly, there was trouble in paradise. Then again, it wasn’t uncommon for couples to have issues as they came up to a mating ceremony. Lot of stress, especially if you insisted on straddling traditions and being Queen for the night— “Fancy meeting you here.” Novo jumped out of her chair and spun around. “Peyton?” It sure the hell was. The fighter was standing right behind her, and he was dressed as if he were on the way to one of his clubs, his slick suit and open-collar shirt the kind of thing you could get away with in Caldwell this time of year only if you had a chauffeur. “What are you doing here?” she asked. He looked around. “Just thought I’d drop by for some overpriced, badly prepared, pseudo-French food in the company of human posers and vampire suck-ups—and oh, hey, ’urprise, I find you here. Not your usual gig, is it.” “Not even close. And you really were just dropping in?” “Yeah. Totally. Absolutely dumb luck.” “And, like, not at all because I mentioned to you when and where this fiasco was going to take place?” Peyton made elaborate work of grimacing and then did a spot-on imitation of the groom’s cake lady from Steel Magnolias: “Guuuuuuillllllty.” Novo tried to swallow her laughter, she really did. But goddamn it, she was glad to see him even though she shouldn’t be. Except then he got serious. “Actually, I had something I had to ask you. It’s the kind of thing…well, I didn’t want to do it over the phone, and besides, I wasn’t sure if I called whether you would answer.” She stayed away from that last one—because she didn’t even want to think about all that phone-checking no one needed to know about. “What did you want to ask me?” Those amazing eyes of his dropped to the ground and he cleared his throat. After a moment, he seemed to collect himself and he looked back at her. “What the fuck is a douche canoe?” Novo barked out a laugh that was so loud, she turned the heads of the humans seated across the room even though the music was playing. There was none of that from the females at the table, though. ’Cuz they were already staring at her. And geez, she couldn’t decide whether all their shock was because a male was addressing her. Or because Peyton looked like exactly what he was: a privileged son of the glymera. “Well?” he prompted. “I was hoping to get a working definition.” “It is not a compliment,” she said. “And it is worse than a douchebag.” “Bigger payload, huh,” he murmured with a slow smile. “Yeah. Pretty much. You can fit a hell of a lot more douche in a canoe than a bag.” “Hey, is this chair next to you taken? I had to walk all the way back here and I got a blister.” “Really,” she drawled. “You’re going with that?” Peyton leaned in. “Is it going to work?” She looked away. Looked back. God, she really wished she would stop smiling. “I don’t know.” “I’ll take that as a yes,” he said as he parked it beside her chair. “And may I just say…hallelujah.” — Peyton knew he was taking a huge gamble crashing this bridal’s maiding or whatever the hell the humans called it. He’d made that vow not to bother Novo quite sincerely—and he’d had every intention of keeping it…at least for the first twenty-four hours or so. Unfortunately, not seeing or talking to her had proven more difficult than he’d anticipated—and in the end, he thought, what the hell. Plausible deniability. He was a free agent and out in Caldwell, and hey, if he happened to show up at the same place she might possibly have mentioned as where she might theoretically be on a Friday night? Well, that was just the breaks. Sorry. Not sorry, actually. And here she was, looking better than any female or woman in the place with her skintight black leathers and her muscle shirt, her strong shoulders and arms shown off, her body once again as it had always been. Powerful. Sexy. Oh, God, he just wanted in her again. He didn’t care the terms or the whys or the wheres. Just once more. “You want something to eat?” she asked him. “Or are your boys waiting for you in the car?” “The douche-mobile is empty at the moment.” He smiled. “And I—” “Aren’t you going to introduce us?” At the sound of the higher-pitched female voice, he looked at what had come up to them: a lollipop blond with big white teeth, a knockoff Valentino-ish lace dress, and eyes that were too close together. Oh, and look, she had an accessory. The male in her wake might as well have had a leash hooked to a proverbial collar, his hangdog expression and cultivated hipster vibe the kind of thing that made you question whether he had balls or not. Probably did, Peyton decided. But they were in the female’s purse.","sourceLink":"https://allnovel.net/blood-kiss-black-dagger-legacy-1/page-60.html","bookId":1779,"book":{"id":1779,"title":"Blood Kiss (Black Dagger Legacy #1)","description":"Storyline: The legacy of the Black Dagger Brotherhood continues in a spin-off series from the #1 New York Times bestselling author. Paradise, blooded daughter of the king’s First Advisor, is ready to break free from the restrictive life of an aristocratic female. Her strategy? Join the Black Dagger Brotherhood’s training center program and learn to fight for herself, think for herself…be herself. It’s a good plan, until everything goes wrong. The schooling is unfathomably difficult, the other recruits feel more like enemies than allies, and it’s very clear that the Brother in charge, Butch O’Neal, a.k.a. the Dhestroyer, is having serious problems in his own life. And that’s before she falls in love with a fellow classmate. Craeg, a common civilian, is nothing her father would ever want for her, but everything she could ask for in a male. As an act of violence threatens to tear apart the entire program, and the erotic pull between them grows irresistible, Paradise is tested in ways she never anticipated—and left wondering whether she’s strong enough to claim her own power…on the field, and off.","cover":"https://allnovel.net/images/blood-kiss-black-dagger-legacy-1.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-kiss-black-dagger-legacy-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:34:47 AM"}}
