{"id":75616,"no":63,"title":"Page 63","content":"Saxton got back to work, sucking and licking, and he could tell by the way Ruhn’s hips started to jerk up and down that he was getting close—\\n\\n “Hello!” came a cheery voice.\\n\\n Whipping his head up, Saxton looked in panic to the front of the house. Then he popped off that floor as Ruhn scrambled to get the button fly back into place.\\n\\n With a quick lunge, Saxton leaned over Ruhn and hit the hand soap at the sink, knowing that the flowery fragrance would cover up the scent of male arousal. Turning the water on, he started to wash his—\\n\\n “Not the water!”\\n\\n A deluge came out under the sink, soaking Ruhn’s back and the floor just as Minnie walked into the kitchen. The female stopped dead.\\n\\n “Hi!” Saxton said as he turned off the faucet with his elbow. “How are you?”\\n\\n And then he stood there with his soapy hands dripping suds into the sink—as Ruhn looked around him, drenched from head to shoulders.\\n\\n Minnie started laughing. “You two remind me of Rhysland and me. I can’t tell you how many times he stuffed himself under that sink and tried to fix that pipe. And he always asked me to run the water.”\\n\\n Ruhn stood up with a blush so vibrant it was as if he were wearing rouge. Reaching for the paper towels, he passed one to Saxton and used several to dry his hands and the back of his neck. “This has gotten loose before?”\\n\\n “Oh, yes.” The older female came forward with a canvas bag. “I made you some bread. And there are preserves here. Strawberry. I had to buy them. The strawberries even at Whole Foods looked too tough for me—oh, the lights! You replaced the lights that were out in the ceiling!”\\n\\n “Yes, madam.” Ruhn bowed. “Even the one that got stuck in the socket.”\\n\\n “That one over there?” As she pointed across the kitchen, and he nodded, she smiled again. “It always does that, too. Did you use a potato to get it out?”\\n\\n Now Ruhn smiled. “I did, yes. My father taught me that. Just as he was the one who showed me how to work pipes. Also, were you aware that there is a leaky toilet upstairs?”\\n\\n “No, I didn’t realize.”\\n\\n “I need to go to Home Depot and buy another set of guts for it. But I can do that first thing tomorrow night.”\\n\\n “I shall give you some money—”\\n\\n “No,” Saxton cut in. “You shall not.”\\n\\n As she looked back and forth between the two of them, her cheerfulness dissolved into a misty emotion, the kind of thing that tugged at the heart. And while her eyes watered, she fumbled in her coat for a tissue to dab away her tears.\\n\\n “This is such a big house,” she said. “And it needs so much…of everything. I try to keep up with it, I truly do. But it is only me and I’m not as strong as I used to be.”\\n\\n Ruhn moved as if he wanted to hug the woman. But he didn’t quite make it, his shyness seeming to freeze him in place. “We will take care of it all for you. And when you come back, anytime something goes wrong and you need a handymale, you can call me. I will come and fix it.”\\n\\n With a determined sniffle, Minnie marched across to the male and threw her arms around him. For a moment, Ruhn just stood there, looking like he was going to panic. But then he eased his enormous arms around the frail older female and gave her the gentlest of hugs. And then Minnie came over to Saxton.\\n\\n He was right with the embrace thing, and when they stepped apart, he took his handkerchief out of his hip pocket. “Here, madam.”\\n\\n Minnie snuffled and patted at her face some more. “I didn’t know how much the decline here was bothering me, until a solution presented itself. I didn’t know…what a burden I’ve been carrying. I’ve felt as though…I’ve felt as though I’ve been letting Rhysland down.”\\n\\n “Well, we have a solution,” Saxton said as he glanced at Ruhn. “And we’re going to make sure you never worry about your house again, aren’t we.”\\n\\n As Ruhn looked over and nodded, Saxton felt a warm glow in the center of his chest.\\n\\n “You two are in love, aren’t you,” Minnie said abruptly.\\n\\n Immediately, Saxton cleared his throat, unsure of whether this was going to be a problem. “Madam, we are…”\\n\\n Just friends? That was a lie he would not speak. But Ruhn had crossed his arms over his chest and seemed as if he wanted the floor to open up and swallow him whole.\\n\\n “In love,” Minnie echoed as she took one of each of their hands. “You know, love is the greatest gift the Scribe Virgin bestowed on her species. I’m happy to see it in this house again. Rhysland and I had so many years of it together here.”\\n\\n Ruhn’s exhale was accompanied by a release of his arms. And then he started to smile.\\n\\n I will remember this for the rest of my life, Saxton thought. This kitchen with the cupboard under the sink wide open, his hair and shirt wet, Minnie beaming like it was a festival night.\\n\\n It was the moment when he truly let himself go.\\n\\n —\\n\\n The little rich boy turned out to be a fearless, horny exhibitionist.\\n\\n As Novo danced against a tall female in latex, she only had eyes for Peyton: He was standing off to the side, watching her hands as they skimmed the woman’s body, and her hips as she moved, and her ass as she turned around.\\n\\n He was starved for her. Even after all the sex they’d had, he was ready to go again…but only with her.\\n\\n Other women—and men—had approached him, performed in front of him, offered him all kinds of things, but he waved them away with impatience. And some of them had been stunningly beautiful.\\n\\n Peyton didn’t give a rat’s ass. He only seemed to see her.\\n\\n For a female who had been left for another, it was a revelation. In fact, she didn’t know that she had needed to feel wanted this badly—but she was well aware that shit was a slippery slope to go down. You never wanted to be centered by another: Because when they left, and they would eventually, they took that part of you they’d filled with them and you were hollow once again.\\n\\n But for tonight? For this one night?\\n\\n She was whole, in a way that she thought she would never be again.\\n\\n And evidently, Peyton had had it with her being in someone else’s arms. He strode over and all but shoved the woman out of the way. Then he was kissing Novo, his mouth full of demand, his body hard again, his hands rough and greedy.\\n\\n Next thing she knew, she was bent over something—she didn’t know what and didn’t care. And he was inside of her once more, pumping, pulling her braid like it was the reins of a bridle, her spine torquing under the pressure. Her orgasm was so intense, she clamped her molars together and felt the sting at the top of her head.\\n\\n Closing her eyes, she opened herself up to all of the sensation: the weakness in her thigh muscles, the rough material under her cheek, the compression of her breasts, and the slapping pounding that her sex was taking.\\n\\n Tears came to her eyes underneath her mask.\\n\\n With desperation, she tried to catch the tail of the emotion and drag it back into its cage, but she couldn’t get the upper hand.\\n\\n It was as if the release opened the casket of everything she had held inside, the old pain rolling out like a corpse, the smell of it, the sight of it, too overpowering to be ignored.\\n\\n She sobbed in the darkness, into the mask, into the sex of strangers and the loud music.\\n\\n Opening her mouth, she screamed the pain out of herself, cast the past into the club’s uncaring anonymity, used Peyton’s fucking as the exit ramp.\\n\\n And no one knew.\\n\\n It was completely private.\\n\\n Eventually, Peyton fell upon her back, his heavy weight a beautiful grounding that brought her back to earth, his harsh panting in her ear a confirmation that he had been there while she had come through the ghost land, that she had not been alone, even if he had had no idea he was helping her.\\n\\n Moving her arm around, she searched for his hand. When she found it, she brought his palm forward…and kissed his lifeline.\\n\\n It was the closest she could come to thanking him for a gift he would never know he gave her.\\n\\n The healing had finally started.\\n\\n “Come back to my place.”\\n\\n As Peyton opened the way out of the club for Novo, he prayed she said yes. He didn’t want the night to end. He didn’t want to spend the day anywhere else but next to her. He didn’t want to wake up alone, without her. \\n\\n","sourceLink":"https://allnovel.net/blood-kiss-black-dagger-legacy-1/page-63.html","bookId":1779,"book":{"id":1779,"title":"Blood Kiss (Black Dagger Legacy #1)","description":"Storyline: The legacy of the Black Dagger Brotherhood continues in a spin-off series from the #1 New York Times bestselling author. \\n Paradise, blooded daughter of the king’s First Advisor, is ready to break free from the restrictive life of an aristocratic female. Her strategy? Join the Black Dagger Brotherhood’s training center program and learn to fight for herself, think for herself…be herself. It’s a good plan, until everything goes wrong. The schooling is unfathomably difficult, the other recruits feel more like enemies than allies, and it’s very clear that the Brother in charge, Butch O’Neal, a.k.a. the Dhestroyer, is having serious problems in his own life. \\n And that’s before she falls in love with a fellow classmate. Craeg, a common civilian, is nothing her father would ever want for her, but everything she could ask for in a male. As an act of violence threatens to tear apart the entire program, and the erotic pull between them grows irresistible, Paradise is tested in ways she never anticipated—and left wondering whether she’s strong enough to claim her own power…on the field, and off.\\n","cover":"https://allnovel.net/images/blood-kiss-black-dagger-legacy-1.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-kiss-black-dagger-legacy-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:34:47 AM"}}
