{"id":75633,"no":80,"title":"Page 80","content":"On his way to the door, he was careful to wipe off the dagger and put it precisely, exactly, absolutely where it had been placed for his use. Outside, the cold cleaned his nose out of the copper scent of human blood. And he made it down the stairs and around the van okay. But as he came to the spot where he had arrived at, he was overcome by nausea. Tripping and falling forward, he grabbed on to the picket fence that encircled the backyard and vomited all over his shoes. When he next looked up, Blay was before him. “I don’t feel any better,” Saxton moaned as he wiped his mouth with his handkerchief. “I feel…no better.” “You will. Later. This is the balance that is needed.” As Saxton lurched to the side, the male steadied him and then offered him a sip of water from a bottle that, absurdly, he noted was a Poland Spring. His favorite. And then Blay was hugging him. “You did the right thing. You did as it was proper.” Saxton embraced the male. “I just want Ruhn to—” “He’s awake!” V called from the garage’s upstairs. “Saxton! They’ve been trying to call you. He’s awake and he’s asking for you!” As Saxton shifted his stunned eyes to Blay, the other male started to smile. “I’ve never heard of an ahvenging bringing back a loved one,” he said. “But there’s a first time for everything. Go! Go now…hurry!” — As the one person in the world Ruhn wanted to see most barreled into his hospital room, his first thought was… Why was human blood all over the love of his life? But then all of that was forgotten as Saxton rushed over and threw himself across Ruhn’s chest. “You’re alive…oh, God…” Ruhn tried to speak, except nothing but mumbles came out at first. Soon, though, soon, he was able to respond. “I…wasn’t going to leave…you.” Saxton pulled back and seemed to be searching for signs he was serious about staying on this side of the Fade. “I thought I had lost you.” “I heard…you…Bitty and…you talking to me.” Fates, his throat hurt. “When you were here—did I die? I think I did.” As Saxton stayed quiet, Ruhn got scared. “Did…I?” “You’re here now. That’s all that matters.” “Throat…hurts…” “I know, love.” Saxton’s eyes went all around as if he were looking for hidden injuries. “You don’t have to talk—” “The Fade. The door. To the Fade…I refused to open it…” “What?” Saxton leaned down. “What did you say?” “I saw a door…in the fog…I knew if I opened it…I would leave you. Many times it came to me. I refused…I wasn’t…leaving you. I love…you.” “I love you, too.” Saxton’s tears fell like rain, but it was the spring kind. The renewing kind. And as emotions of Ruhn’s own welled, they got even more intense as Bitty came into the room with Rhage and Mary. “Uncle!” Ruhn smiled until his cheeks hurt, and he tried to talk, but it was no good. He’d worn out his energy and voice—not that Bitty seemed to mind. She was a jumping bean, full of joy, and wasn’t that as good as the drugs he was on to lessen his pain. As the little girl kept talking a mile a minute, he was very aware of Saxton backing toward the door. The male held a forefinger up—a signal he would return in a moment. “—and I knew you were going to be okay! I knew it!” “My man,” Rhage said as he came over and touched Ruhn’s hand. “I’m glad you’re sticking with us. Can I buy you another truck or something?” As Ruhn frowned and started shaking his head—because the Brother was just crazy enough to do something like that—Mary elbowed her mate in the side. “Rhage. You don’t need to buy people things just to show them how you feel.” “You know, you could have a great jewelry collection, I’m just sayin’.” Rhage winked at Ruhn. “I swear, my female is Spartan.” Ruhn lay back and let them talk over each other. He understood the release of tension and worry even if he didn’t have the gumption to participate in it—and then Saxton was back, smelling of fresh soap and shampoo, a set of scrubs on him. In the end, Ruhn didn’t have to ask what had been done. He knew his love had gone and found those men…and proceeded as Ruhn himself would have if Saxton had been the one attacked and left for dead in the very house they lived in. Still, it made him sad that his lovely lawyer had had to use the sword and not the pen in this case. But he would not deny his love the expression of vengeance. It was what it was. “Okay, how about we give Uncle and Saxton some privacy,” Mary said. “Besides, your father hasn’t eaten in at least twenty minutes.” Rhage looked at his daughter. “I am feeling a bit peckish, you know.” “Let’s make tacos and bring one to Uncle!” Considering the burn in his throat? Oh, no, Ruhn thought. Better that he start with vanilla pudding. In, like, a week. After Bitty and her parents gave him more love and left, he looked at Saxton. “Can’t talk…” he said. “Hurts.” Saxton sat down on the bed. “You don’t have to say a thing.” “Love you. Love you so much.” As he tugged on Saxton’s hand, even though it was weakly, the lawyer knew what he wanted. With a smile, Saxton stretched out and put his head on Ruhn’s arm. “Never leave me again?” Saxton asked. “Never. Promise.” As Ruhn closed his eyes, he thought…well, it looked as if he was going to have to call his old estate manager and tell the male not to bother trying to help him find a job with room and board in Caldwell. There was no way he was moving out of this household. Not unless it was in with Saxton. Little did he know, however, the surprise that was yet to come… Some two weeks later, night arrived and brought with it a stunning February moon. Indeed, the heavens were so clear and so cloudless that the face of the sky’s largest sparkling diamond was like a mirror. Saxton was straightening his bow tie in the visor mirror as his love parked their truck across from a…“Wait, this is a church? This mating is happening in a church?” Ruhn nodded as he likewise looked through the windshield with surprise. “This is the correct address according to GPS.” “Huh. Well, to each their own. It’s not that I have anything against human spirituality, it’s just…this feels quite odd.” “Let me get your door.” As Ruhn beat feet out from behind the steering wheel, Saxton had to smile. The male was such a stickler for manners, and how could you not oblige? Especially as those eyes shone with such happiness every time he opened the way forth or pulled out a chair or offered a hand. “You know,” Saxton said as he slid off of the high seat. “Sometimes I think you like to take this truck just so you can help me out of it.” Ruhn leaned in and whispered in Saxton’s ear. “It’s rather like your pants in that regard.” Saxton chuckled and nipped at the throat so close to his mouth. “Naughty boy.” “You like me that way.” “Always.” They were kissing before they knew it, hands going under clothes, the heat instantaneous and intense—as if they hadn’t made love three times in the shower, and then again as they got dressed in their suits. “We’d better stop,” Saxton said between gasps. “Or we’ll be late.” Ruhn stepped back with reluctance boarding on a full sulk. “Then I expect to find a quiet place at the reception hall—whatever that is.” “And I can’t wait.” They held hands as they walked across the street to the human church. And then they were inside and being shown to a bench. No, it was called a pew, Saxton thought. Yes, that was it, a pew.","sourceLink":"https://allnovel.net/blood-kiss-black-dagger-legacy-1/page-80.html","bookId":1779,"book":{"id":1779,"title":"Blood Kiss (Black Dagger Legacy #1)","description":"Storyline: The legacy of the Black Dagger Brotherhood continues in a spin-off series from the #1 New York Times bestselling author. Paradise, blooded daughter of the king’s First Advisor, is ready to break free from the restrictive life of an aristocratic female. Her strategy? Join the Black Dagger Brotherhood’s training center program and learn to fight for herself, think for herself…be herself. It’s a good plan, until everything goes wrong. The schooling is unfathomably difficult, the other recruits feel more like enemies than allies, and it’s very clear that the Brother in charge, Butch O’Neal, a.k.a. the Dhestroyer, is having serious problems in his own life. And that’s before she falls in love with a fellow classmate. Craeg, a common civilian, is nothing her father would ever want for her, but everything she could ask for in a male. As an act of violence threatens to tear apart the entire program, and the erotic pull between them grows irresistible, Paradise is tested in ways she never anticipated—and left wondering whether she’s strong enough to claim her own power…on the field, and off.","cover":"https://allnovel.net/images/blood-kiss-black-dagger-legacy-1.jpg","author":"J.R. Ward","type":"Romance","source":"allnovel","link":"https://allnovel.net/blood-kiss-black-dagger-legacy-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:34:47 AM"}}
