{"id":94355,"no":44,"title":"Page 44","content":"\n She saw the spot. A curve in the wall. A niche in the rock, and a stone tablet within.\n This is it. And then, a sudden shrill at the edges of thought: Is it safe? She pushed the thought away, letting fear and grief blank her mind.\n Her surliness seemed a stupid thing now, a ridiculous, tragic waste of their time together, and Felicity grabbed him tight.\n He responded at once to her touch, wrapping a strong arm around her. “Och, love,” he whispered in her hair as he leaned to kiss the top of her head. “My heart and soul go through that rock with you. You leave only the shell of me behind.”\n They approached, and she saw where the laird had begun to chisel lines in the stone tablet. They would place the map over the stone, as if it were tracing paper.\n She stopped in her tracks. Afraid now, and uncertain.\n “If it’s the map that’s so important . . .” she hesitated, cleared her throat. She stared at the paper in his hand. “Why can’t I just draw that anywhere and disappear through time? I don’t get why you’re so sure this will work.”\n “There is some magic held by this very rock.” He stared at it, brow furrowed. “Some magic spoken, some talisman cast. The witch claims you must leave from just here.”\n She trembled fiercely now, and he supported her as they walked the final steps to the stone. Icy perspiration prickled along her body. Her breathing and heartbeat felt shallow, and she thought that maybe if she passed out, she might prolong their time together just a little bit more.\n But she didn’t pass out. Events marched forward.\n She stood before the rock and Will put his hands on hers. Together they smoothed the sheet over the stone.\n “Wait,” Felicity said. Will stood behind her, and she craned her neck to look at him.\n She memorized his features. Would she see them someday on the child she carried? Thick brown hair. Hazel eyes that looked brown in the shadows. Those sharp, strong lines of his cheek and jaw.\n Could she grab his hands, grab Will tight and pull him through with her? Wouldn’t Livvie just die to meet him?\n Livvie. She’d see her aunt soon. And yet the thought just made Felicity sad. She wasn’t ready.\n “Is this it?” she asked, realizing that a part of her had been waiting for something else to happen. Some intervening force that would keep her by Will’s side. The fates had sent her here, where were they now?\n A cascade of small rocks spilled from overhead. Slivers of shale bit into her exposed skin, and Will pulled Felicity to him, covering her head with his own.\n They both looked up. A rider stood on the rise above.\n Cold dread crushed her.\n Jamie.\n Will shaded his eyes, glued to his brother overhead. Finally, he asked, “How did you find me?”\n “It’s easier than you’d think, getting folk to talk. Be it bribe or blade, there’s always a way to loosen tongues.” Jamie’s horse pranced nervously, and a shower of gravel rained from the high ridge. “ ’Twas a crofter who sold you out just now.” Jamie shrugged. “These Camerons are a stubborn lot. This one was forced to pay in blood.”\n Will’s brother was lit from behind, and when his lips peeled into a smile, the dramatic shadows transformed his face into a sinister mask. “Paid in blood,” Jamie added, “as your woman will also pay.”\n “My woman has done nothing,” Will snarled, stepping in front of Felicity to guard her at his back.\n “To the contrary. Any woman who lies with you is soiled. That is crime enough.” Jamie’s hand went to the broadsword at his side. “And now she will pay, and I will enjoy having you watch.”\n There was shuffling, and Felicity saw the heads of two other horses, tossing just in view. Jamie had brought friends.\n Will must have spotted them too. He turned to face her. His attention only on her.\n She saw the intensity in his eyes and she knew. The fates weren’t intervening to save her. Jamie’s appearance was a shove further down this path of no return. She whimpered simply, “No.”\n “I love you, Felicity.” Will’s voice was hoarse with emotion as he turned her to face the stone once again.\n She stood limply, yet between Will at her back and her legs locked under her, somehow Felicity remained propped upright.\n No. The thought was tiny. The events unfolding around her were too big, too inexorable to stop. There was no fighting it now.\n But she’d been so positive she was his. She couldn’t go through. The witch said she’d never come back.\n He took her arm in his hand.\n No.\n Distantly she heard the scuffle of horses along the ridge overhead.\n Will began to draw her finger over the marks.\n Her hand was cold and limp in his. She couldn’t accept this. The blood drained from her head, and she felt clammy and woozy.\n There was the dull patter of gravel falling at their feet. A hollow laugh from above.\n Her arm started to buzz.\n This was it. It was happening.\n “I can’t live without you.” Her voice hitched, tears streaming down her face.\n “Go around,” came a shout from above. More rock rained down. “This way, you fools.” Jamie’s voice, moving along the ridge.\n Will worked faster. Her finger grew hot.\n She was suddenly so heavy. Gravity pulled at her, making it hard to stand. She tried to lean back into Will, but he held her hard and apart.\n Her free hand flailed behind her. She could grab him, take him with her. But she was weak now, and her hand met only air.\n “Good-bye to you, love.” Will’s voice cracked. She felt his rough kiss on the back of her head. “Good-bye to my heart.”\n She tried to speak, but her body was numb, immobile. She wondered if she traveled already. Was this what it would feel like?\n The sound of horses came from behind.\n Vertigo whirred in her head as she sank out of control. She wanted to cry for help, but couldn’t. Her body was deadened. Not right.\n She couldn’t breathe now, and panic spiked through her. Tried to inhale, tried to move. Frozen. She was terrified now, terrified of the cold that was pulling her down.\n Strange, disjointed laughter came from behind, so surreal.\n Felicity felt Will’s hands on her shoulders. Such sweet relief flooded her. She was dying and he would pull her back, would save her from this darkness.\n But then he pushed. Will shoved her down and through, and in that moment, it was a betrayal, shattering her heart.\n Finally sound came from her throat, as if she surfaced from the paralysis of a nightmare. Felicity screamed, and the noise was engulfed by the whirl of stars around her.\n Chapter 33\n The growl ripped from Will’s throat. It was a feral noise, rabid and fierce. The sound of his soul being ripped from his body, as he watched his Felicity, so terrified and vulnerable, torn from him forever.\n He spun from that accursed star chart, turning to face Jamie’s men. He’d heard their approach, worried they’d reach him before he could push Felicity through to safety.\n Will despised them, hated Jamie with everything he had. They’d forced his hand, forced him to push Felicity so violently away. He’d seen the shock of it on her face, the heart-break and the betrayal.\n They didn’t get a proper good-bye. His final sight of her, simply the last of her beautiful blonde hair getting sucked into a terrifying maw of black nothingness.\n The image would haunt him the rest of his days.\n He sized them up in a heartbeat. Two men charging on foot. His cowardly brother still watching from the ridge overhead.\n Will didn’t even deign to pull his sword from where it was hidden in the length of his cane.\n The first man rushed at him like an ass, but Will stood still as a rock. He held his cane steady, tilting his wrist up at the last moment, extending it straight out from his body. The man leapt for him with dagger and targe, but Rollo simply jabbed him in the gut, followed by a strike to the groin.\n His opponent fell to the ground retching, and Will tossed the cane up, catching and swinging it back down in a single fluid movement. He struck the handle against the man’s temple, stilling Jamie’s hired half-wit forever.\n The second one came fast on his heels, charging Rollo with his broadsword extended. Will scowled to see the elaborate gilded basket hilt that guarded the man’s hand. The blood of Royalists had paid for that gilt.\n He tossed his cane up, grabbing high along the length of it. Just as the swordsman lunged, Will pivoted sideways, hooking the cane’s handle on the man’s bicep, and reaping his arm down.\n The man stumbled and Will struck him in the small of the back, hammered once on the back of his neck, and then on the kidneys. The man fell down, but Will swung up, striking him in the throat.\n It felt good, this savagery. But it wasn’t enough. Nothing would ever be enough to atone for his and Felicity’s final farewell.\n His opponent choked his last, a grotesque wheezing at Will’s back. But the man was already forgotten as Rollo looked up at his brother, waiting on horseback along the top of the ridge.\n “Can’t fight your own battles?” Will shouted up. Loathing seethed from his voice.\n “Can’t fight like a normal man?” Jamie countered, with a scornful nod to Will’s cane.\n Will’s eyes scanned quickly, searching out the mounts of the hired men. Two stout ponies grazed idly, at the base of the hill.\n He made a soft whickering noise. One of the ponies twitched an ear, and then lifted his head to look at him. Will clicked his tongue again. The beast seemed to think on it, then heaved his body into a slow walk.\n Will met the animal halfway. Grabbing the reins, he hauled himself easily onto the saddle. Leaning high on the pony’s neck, he kicked into an abrupt canter.\n Jamie waited for him at the top of the rise. “Oh, Willie,” he hooted, greeting him with laughter. “This is too rich! You on a pony once more.” Jamie’s horse, a big bay, skittered beneath him. “How about we take care of your other leg, little brother?”\n “I’d get ahold of your mount, Jamie,” he said nonchalantly. “The beast seems too much for you.” \n","sourceLink":"https://allnovel.net/lord-of-the-highlands-highlands-4/page-44.html","bookId":1618,"book":{"id":1618,"title":"Lord of the Highlands (Highlands #4)","description":"Storyline: \n Lord of the Highlands (Highlands #4) \n An online dating service may have pronounced Felicity \"unmatchable\" but she\u0027s determined-and destined-to find her perfect mate. All it takes is a mystical deck of Tarot cards and suddenly she\u0027s in 17th-century Scotland, smitten by a warrior who must make a daring choice: send Felicity back to her own time, or endanger both their lives.\n \n","cover":"https://allnovel.net/images/lord-of-the-highlands-highlands-4.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/lord-of-the-highlands-highlands-4.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:07:05 PM"}}
