{"id":64880,"no":1,"title":"Page 1","content":"SAN FRANCISCO, CALIFORNIA REPUBLIC OF AMERICA POPULATION: 24,646,320 OUT OF ALL THE DISGUISES I’VE WORN, THIS ONE might be my favorite. Dark red hair, different enough from my usual white-blond, cut to just past my shoulders and pulled back into a tail. Green contacts that look natural when layered over my blue eyes. A crumpled, half-tucked collar shirt, its tiny silver buttons shining in the dark, a thin military jacket, black pants and steel-toed boots, a thick gray scarf wrapped around my neck, chin, and mouth. A dark soldier cap is pulled low over my forehead, and a crimson, painted tattoo stretches all over the left half of my face, changing me into someone unfamiliar. Aside from this, I wear an ever-present earpiece and mike. The Republic insists on it. In most other cities, I’d probably get even more stares than I usually do because of that giant goddy tattoo—not exactly a subtle marker, I gotta admit. But here in San Francisco, I blend right in with the others. The first thing I noticed when Eden and I moved to Frisco eight months ago was the local trend: young people painting black or red patterns on their faces, some small and delicate, like Republic seals on their temples or something similar, others huge and sprawling, like giant patterns of the Republic’s land shape. I chose a pretty generic tattoo tonight, because I’m not loyal enough to the Republic to stamp that loyalty right on my face. Leave that to June. Instead, I have stylized flames. Good enough. My insomnia’s acting up tonight, so instead of sleeping, I’m walking alone through a sector called Marina, which as far as I can tell is the hillier, Frisco equivalent of LA’s Lake sector. The night’s cool and pretty quiet, and a light drizzle is blowing in from the city’s bay. The streets are narrow, glistening wet, and riddled with potholes, and the buildings that rise up on both sides—most of them tall enough to vanish into tonight’s low-lying clouds—are eclectic, painted with fading red and gold and black, their sides fortified with enormous steel beams to counter the earthquakes that roll through every couple of months. JumboTrons five or six stories high sit on every other block, blaring the usual barrage of Republic news. The air smells salty and bitter, like smoke and industrial waste mixed with seawater, and somewhere in there, a faint whiff of fried fish. Sometimes, when I turn down a corner, I’ll suddenly end up close enough to the water’s edge to get my boots wet. Here the land slopes right into the bay and hundreds of buildings poke out half submerged along the horizon. Whenever I get a view of the bay, I can also see the Golden Gate Ruins, the twisted remnants of some old bridge all piled up along the other side of the shore. A handful of people jostle past me now and then, but for the most part the city is asleep. Scattered bonfires light alleyways, gathering spots for the sector’s street folks. It’s not that different from Lake. Well—I guess there are some differences now. The San Francisco Trial Stadium, for one, which sits empty and unlit off in the distance. Fewer street police in the poor sectors. The city’s graffiti. You can always get an idea of how the people are feeling by looking at the recent graffiti. A lot of the messages I’ve seen lately actually support the Republic’s new Elector. He is our hope, says one message scrawled on the side of a building. Another painted on the street reads: The Elector will guide us out of the darkness. A little too optimistic, if you ask me, but I guess they’re good signs. Anden must be doing something right. And yet. Every now and then, I’ll also see messages that say, The Elector’s a hoax, or Brainwashed, or The Day we knew is dead. I don’t know. Sometimes this new trust between Anden and the people feels like a string . . . and I am that string. Besides, maybe the happy graffiti’s fake, painted by propaganda officers. Why not? You never know with the Republic. Eden and I, of course, have a Frisco apartment in a rich sector called Pacifica, where we stay with our caretaker, Lucy. The Republic’s gotta take care of its sixteen-year-old most-wanted-criminal-turned-national-hero, doesn’t it? I remember how much I distrusted Lucy—a stern, stout, fifty-two-year-old lady dressed in classic Republic colors—when she first showed up at our door in Denver. “The Republic has assigned me to assist you boys,” she told me as she bustled in to our apartment. Her eyes had settled immediately on Eden. “Especially the little one.” Yeah. That didn’t sit well with me. First of all, it’d taken me two months before I could even let Eden out of my sight. We ate side by side; we slept side by side; he was never alone. I’d gone as far as standing outside his bathroom door, as if Republic soldiers would somehow suck him out through a vent, take him back to a lab, and hook him up to a bunch of machines. “Eden doesn’t need you,” I’d snapped at Lucy. “He’s got me. I take care of him.” But my health started fluctuating after those first couple of months. Some days I felt fine; other days, I’d be stuck in bed with a crippling headache. On those bad days, Lucy would take over—and after a few shouting matches, she and I settled into a grudging routine. She does make pretty awesome meat pies. And when we moved here to Frisco, she came with us. She guides Eden. She manages my medications. When I’m finally tired of walking, I notice that I’ve wandered right out of Marina and into a wealthier neighboring district. I stop in front of a club with THE OBSIDIAN LOUNGE scored into a metal slab over its door. I slide against the wall into a sitting position, my arms resting on my knees, and feel the music’s vibrations. My metal leg is ice-cold through the fabric of my trousers. On the wall across from me, graffiti scrawled in red reads, Day \u003d Traitor. I sigh, take a silver tin from my pocket, and pull out a long cigarette. I run a finger across the SAN FRANCISCO CENTRAL HOSPITAL text imprinted down its length. Prescription cigarettes. Doctor’s orders, yeah? I put it to my lips with trembling fingers and light it up. Close eyes. Take a puff. Gradually I lose myself in the clouds of blue smoke, waiting for the sweet, hallucinogenic effects to wash over me. Doesn’t take long tonight. Soon the constant, dull headache disappears, and the world around me takes on a blurry sheen that I know isn’t only from the rain. A girl’s sitting next to me. It’s Tess. She gives me the grin I was so familiar with back on the streets of Lake. “Any news from the JumboTrons?” she asks me, pointing toward a screen across the road. I exhale blue smoke and lazily shake my head. “Nope. I mean, I’ve seen a couple of Patriot-related headlines, but it’s like you guys vanished off the map. Where are you? Where are you going?” “Do you miss me?” Tess asks instead of answering. I stare at the shimmery image of her. She’s how I remember from the streets—her reddish-brown hair tied into a messy braid, her eyes large and luminous, kind and gentle. Little baby Tess. What were my last words to her . . . back when we had botched the Patriots’ assassination attempt on Anden? Please, Tess—I can’t leave you here. But that’s exactly what I did. I turn away, taking another drag on my cigarette. Do I miss her? “Every day,” I reply. “You’ve been trying to find me,” Tess says, scooting closer. I swear I can almost feel her shoulder against mine. “I’ve seen you, scouring the JumboTrons and airwaves for news, eavesdropping on the streets. But the Patriots are in hiding right now.” Of course they’re in hiding. Why would they attack, now that Anden’s in power and a peace treaty between the Republic and the Colonies is a done deal? What could their new cause possibly be? I have no idea. Maybe they don’t have one. Maybe they don’t even exist anymore. “I wish you would come back,” I murmur to Tess. “It’d be nice to see you again.” “What about June?” As she asks this, her image vanishes. She’s replaced by June, with her long ponytail and her dark eyes that shine with hints of gold, serious and analyzing, always analyzing. I lean my head against my knee and close my eyes. Even the illusion of June is enough to send a stabbing pain through my chest. Hell. I miss her so much. I remember how I’d said good-bye to her back in Denver, before Eden and I moved to Frisco. “I’m sure we’ll be back,” I’d told her over my mike, trying to fill the awkward silence between us. “After Eden’s treatment is done.” This was a lie, of course. We were going to Frisco for my treatment, not Eden’s. But June didn’t know this, so she just said, “Come back soon.” That was almost eight months ago. I haven’t heard from her since. I don’t know if it’s because each of us is too hesitant to bother the other, too afraid that the other doesn’t want to talk, or maybe both of us are just too damn proud to be the one desperate enough to reach out. Maybe she’s just not interested enough. But you know how it goes. A week passes without contact, and then a month, and soon too much time has passed and calling her would just feel random and weird. So I don’t. Besides, what would I say? Don’t worry, doctors are fighting to save my life. Don’t worry, they’re trying to shrink the problem area in my brain with a giant pile of medication before attempting an operation. Don’t worry, Antarctica might grant me access to treatment in their superior hospitals. Don’t worry, I’ll be just fine. What’s the point of keeping in touch with the girl you’re crazy about, when you’re dying? The reminder sends a throbbing pain through the back of my head. “It’s better this way,” I tell myself for the hundredth time. And it is. By not seeing her for so long, the memory of how we’d originally met has grown dimmer, and I find myself thinking about her connection to my family’s deaths less often. Unlike Tess’s, for some reason June’s image never says a word. I try to ignore the shimmery mirage, but she refuses to go away. So damn stubborn. Finally, I stand, stub my cigarette into the pavement, and step through the door of the Obsidian Lounge. Maybe the music and lights will shake her from my system. For an instant, I can’t see a thing. The club is pitch-black, and the sound’s deafening. I’m stopped immediately by an enormous pair of soldiers. One of them puts a firm hand on my shoulder. “Name and branch?” he asks. I have no interest in making my real identity known. “Corporal Schuster. Air force,” I reply, blurting out a random name and the first branch that comes to mind. I always think of the air force first, mostly because of Kaede. “I’m stationed at Naval Base Two.” The guard nods. “Air force kids over in the back left, near the bathrooms. And if I hear you picking any fights with the army booths, you’re out and your commander hears about it in the morning. Got it?” I nod, and the soldiers let me pass. I walk down a dark hall and through a second door, then melt into the crowds and flashing lights inside. The dance floor is jammed with people in loose shirts and rolled-up sleeves, dresses paired with rumpled uniforms. I find the air force booths in the back of the room. Good, there are several empty ones. I slide into a booth, prop up my boots against the cushioned seats, and lean my head back. At least June’s image has disappeared. The loud music sends all my thoughts scattering.","sourceLink":"https://allnovel.net/champion-legend-3/page-1.html","bookId":1696,"book":{"id":1696,"title":"Champion (Legend #3)","description":"Storyline: Champion (Legend #3) He is a Legend. She is a Prodigy. Who will be Champion? June and Day have sacrificed so much for the people of the Republic—and each other—and now their country is on the brink of a new existence. June is back in the good graces of the Republic, working within the government’s elite circles as Princeps-Elect, while Day has been assigned a high-level military position. But neither could have predicted the circumstances that will reunite them: just when a peace treaty is imminent, a plague outbreak causes panic in the Colonies, and war threatens the Republic’s border cities. This new strain of plague is deadlier than ever, and June is the only one who knows the key to her country’s defense. But saving the lives of thousands will mean asking the one she loves to give up everything. With heart-pounding action and suspense, Marie Lu’s bestselling trilogy draws to a stunning conclusion.","cover":"https://allnovel.net/images/champion-legend-3.jpg","author":"Marie Lu","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/champion-legend-3.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:55:38 AM"}}
