{"id":64891,"no":12,"title":"Page 12","content":"But he’s wasted his efforts on me. I cannot give him peace, even on his final day. Some things cannot be forgiven.\\n\\n “I feel sorry for you,” I say quietly. “Because you’re so weak.”\\n\\n Thomas tightens his lips. Still searching for some bit of validation he says, “I could’ve chosen Day’s route. I could have become a criminal. But I didn’t. I did everything right, you know. That was what Metias loved about me. He respected me. I followed all the rules, I obeyed all the laws, I worked my way up from where I started.” He leans toward me; his eyes grow more desperate. “I took an oath, June. I am still bound by that oath. I will die with honor for sacrificing everything I have—everything—for my country. And yet, Day is the legend, while I am to be executed.” His voice finally breaks with all his anguish and inner torment, the injustice he feels. “It makes no sense.”\\n\\n I stand up. Behind me, the guards move toward the cell door. “You’re wrong,” I say sadly. “It makes perfect sense.”\\n\\n “Why?”\\n\\n “Because Day chose to walk in the light.” I turn my back on him for the last time. The door opens; the cell’s bars make way for the hall, a new rotation of prison guards, freedom. “And so did Metias.”\\n\\n 1532 HOURS.\\n\\n That afternoon, I head to Denver University’s track with Ollie in an attempt to clear my thoughts. Outside, the sky looks yellow and hazy with the light of the afternoon sun. I try to picture the sky covered with the Colonies’ airships, ablaze with the fire from aerial dogfights and explosions. Twelve days before we need to offer something to the Colonies. Without Day’s help, how are we ever going to do that? The thought troubles me, but thankfully it helps keep the memories of Thomas and Commander Jameson out of my head. I pick up my pace. My running shoes pound against the pavement.\\n\\n When I arrive at the track, I notice guards stationed at every entrance. At least four soldiers per gate. Anden must be doing his exercise routine somewhere out here too. The soldiers recognize me, let me through, and usher me into the stadium, where the track wraps around a large, open field. Anden’s nowhere to be seen. Perhaps he’s down in the stadium’s underground lockers.\\n\\n I do a quick round of stretches while Ollie waits impatiently, dancing from paw to paw, and then I begin making my way down the track. I run faster and faster along the curved path until I’m sprinting around the turns, my hair streaming out behind me, Ollie panting at my side. I imagine Commander Jameson sprinting after me, gun in hand. Better be careful, Iparis. You might turn out just like me. When I loop around to the side of the track with targets set up, I skid to a halt, whip out the gun at my belt, and shoot at each of the targets in rapid succession. Four bull’s-eyes. Without pause, I loop around the track again and repeat my routine three times. Ten times. Fifteen times. Finally I stop, my heart beating a frantic tune against my chest.\\n\\n I shift to a walk, slowly catching my breath, my thoughts whirling. If I had never met Day, could I have grown up to become Commander Jameson? Cold, calculating, merciless? Hadn’t I turned into exactly that when I first figured out who Day was? Hadn’t I led the soldiers—led Commander Jameson herself—to his family’s door, without a second thought for whether or not his family might be harmed? I reset my gun, then aim at the targets again. My bullets thud into the centers of the boards.\\n\\n If Metias were alive, what would he have thought of what I did?\\n\\n No. I can’t think about my brother without remembering Thomas’s confession from this morning. I fire my last bullet, then sit down in the middle of the track with Ollie and bury my head in my hands. I’m so tired. I don’t know if I can ever outrun how I used to be. And now I’m doing it all over again—trying to persuade Day to give up his brother again, trying to use him to the Republic’s advantage.\\n\\n Finally I pick myself up, wipe the sweat from my brow, and head to the underground lockers. Ollie settles down to wait for me under the cool overhang near the doors; he laps hungrily at a pouch of water I set before him. I head down the stairs, then turn the corner. The air is humid from the showers, and the lone screen embedded at the end of the hall has a light film of mist over it. I walk down the corridor that splits off into the men’s and women’s locker rooms. A few voices echo from farther down the hall.\\n\\n A second later, I see Anden emerge from the locker room with two guards walking alongside him. I blush in embarrassment at the sight. Anden looks like he just stepped out of the shower a few minutes ago, shirtless and still toweling off his damp hair, his lean muscles tense after his workout. He has a crisp collar shirt swung over one shoulder, the white of the fabric a startling contrast against the olive of his skin. One of the guards talks to him in hushed tones, and with a sinking feeling, I wonder whether it has something to do with the Colonies. A moment later, Anden glances up and finally notices me staring at them. The conversation pauses.\\n\\n “Ms. Iparis,” Anden says, a polite smile covering up whatever might have been bothering him. He clears his throat, hands his towel to one of the guards, and pulls one arm through the sleeve of his collar shirt. “I apologize for my half-dressed state.”\\n\\n I bow my head once, trying hard to look unfazed as all of their eyes fixate on me. “No worries, Elector.”\\n\\n He nods at his guards. “Go ahead. I’ll meet you both at the stairs.”\\n\\n The guards bow in unison, then leave us alone. Anden waits until they’ve disappeared around the corner before turning back to me. “I hope your morning went well enough,” he says as he starts buttoning up his shirt. His eyebrows furrow. “No trouble?”\\n\\n “No trouble,” I confirm, unwilling to dwell on my conversation with Thomas.\\n\\n “Good.” Anden runs a hand through his damp hair. “Then you’ve had a better morning than I. I spent several hours in a private conference with the President of Ross City, Antarctica—we’ve asked them for military help, in case of an invasion.” He sighs. “Antarctica sympathizes, but they aren’t easy to please. I don’t know whether we can get around using Day’s brother, and I don’t know how to persuade Day to allow it.”\\n\\n “No one will be able to convince him,” I reply, crossing my arms. “Not even me. You say that I’m his weakness, but his greatest weakness is his family.”\\n\\n Anden stays quiet for a moment. I study his face carefully, wondering what thoughts are going through his mind. The memory comes back to me of how merciless he can be when he chooses, how he didn’t flinch when sentencing Thomas to death, how he’d thrown Commander Jameson’s insult right back in her face, how he never hesitated to execute every single person who tried to destroy him. Deep underneath the soft voice and kind heart lies something cold. “Don’t force him,” I say. Anden looks at me in surprise. “I know that’s what you’re thinking.”\\n\\n Anden finishes buttoning his shirt. “I can only do what I have to do, June,” he says gently. It almost sounds sad.\\n\\n No. I will never let you hurt Day like that. Not the way I’ve already hurt him. “You’re the Elector. You don’t have to do anything. And if you care about the Republic, you won’t risk angering the one person who the public believes in.”\\n\\n Too late, I bite my tongue. The people believe in Day, but they don’t believe in you. Anden winces visibly, and even though he doesn’t comment on it, I silently curse myself for my notorious turns of phrase. “I’m sorry,” I murmur. “I didn’t mean it like that.”\\n\\n A long pause drags on before Anden speaks again. “It’s not as easy as it seems.” He shakes his head. A tiny bead of water drops from his hair onto his collar. “You would do differently? Risk an entire nation instead of one person? I can’t justify it. The Colonies will strike if we don’t give them an antidote, and this whole mess stemmed from something that I’m responsible for.”\\n\\n “No, your father was responsible. That doesn’t mean you are.”\\n\\n “Well, I’m my father’s son,” Anden replies, his voice suddenly stern. “What difference does it make?”\\n\\n The words surprise both of us. I tighten my lips and decide not to comment on it, but my thoughts churn frantically. It does make a difference. But then I think back on what Anden had once told me about the Republic’s founding, how his father and the Electors before him had been forced to act in those dark, early years. Better be careful, Iparis. You might turn out just like me.\\n\\n Perhaps I’m not the only one who needs to be careful.\\n\\n Something showing on the screen at the end of the hall distracts me. I look toward it. There’s some news about Day; the footage shows some old video close-up of him and then a brief shot of the Denver hospital, but even though most of the video’s cut off, I can catch glimpses of crowds gathered in front of the building. Anden turns to look at the screen too. Are they protesting? What could they be protesting?\\n\\n Daniel Altan Wing admitted to hospital for standard medical exam, to be released tomorrow\\n\\n Anden presses a hand to his ear. An incoming call. He glances briefly at me, then clicks on his mike and says, “Yes?”\\n\\n Silence. As the screen’s broadcast continues, Anden’s face turns pale. It reminds me for an instant of how pale Day had looked while at the banquet, and the two thoughts converge into a single, frightening thought. I suddenly know, beyond the shadow of a doubt, that this is the secret Day’s been keeping from me. A horrible feeling builds in my chest.\\n\\n “Who approved this footage’s release?” Anden says after a moment, his voice now a whisper. I hear anger in it. “There won’t be a next time. Inform me first. Is that understood?”\\n\\n A lump rises in my throat. When his call finally ends, he drops his hand and gives me a long, grave look.\\n\\n “It’s Day,” he says. “He’s at the hospital.”\\n\\n “Why?” I demand.\\n\\n “I’m so sorry.” He bows his head in a tragic gesture, then leans forward to whisper in my ear. He tells me. And suddenly I feel light-headed, like the entire world has funneled into a blur of motion, like none of this is real, like I’m standing right back at the Los Angeles Central Hospital on the night I knelt before Metias’s cold, lifeless body, staring into a face that I no longer recognized. My heartbeat slows to a stop. Everything stops. This can’t be real.\\n\\n How can the boy who stirred an entire nation be dying?\\n\\n THEY KEEP ME AT THE HOSPITAL OVERNIGHT BEFORE THEY release me to my apartment. By now, the news is out—bystanders had seen me wheeled out, had spread the word to other folks, and soon the wildfire was unstoppable, and the rumor’s been uttered in every corner of the city. I’ve seen the news cycles try to hide it twice already. I was in the hospital for a standard checkup; I was in the hospital to visit my brother. All sorts of goddy stories. But no one’s buying it.\\n\\n I spend all day enjoying the luxury of a non-hospital bed, watching light, slushy snow falling outside our window, while Eden camps out on the bed by my feet and plays with a robotics kit we’d gotten from the Republic as a gift. He’s piecing together some sort of robot now; he matches up a magnetic Light cube—a palm-size box with mini screens on its sides—with several Arm, Leg, and Wing cubes to create what’s essentially a little flying JumboTron Man. He smiles in delight at it, then breaks the cubes apart and rearranges them into a pair of walking Legs that display JumboTron video feeds whenever they step down. I smile too, momentarily content that he’s content. If there’s one good thing about the Republic, it’s that they indulge Eden’s love for building stuff. Every other week we seem to get some new contraption that I’ve only ever seen upper-class kids own. I wonder if June’s the one who put in this special request for Eden, knowing what she does. Or maybe Anden just feels guilty for all the stuff his father put us through. \\n\\n","sourceLink":"https://allnovel.net/champion-legend-3/page-12.html","bookId":1696,"book":{"id":1696,"title":"Champion (Legend #3)","description":"Storyline: Champion (Legend #3) \\n He is a Legend. \\n She is a Prodigy. \\n Who will be Champion? \\n June and Day have sacrificed so much for the people of the Republic—and each other—and now their country is on the brink of a new existence. June is back in the good graces of the Republic, working within the government’s elite circles as Princeps-Elect, while Day has been assigned a high-level military position. \\n But neither could have predicted the circumstances that will reunite them: just when a peace treaty is imminent, a plague outbreak causes panic in the Colonies, and war threatens the Republic’s border cities. This new strain of plague is deadlier than ever, and June is the only one who knows the key to her country’s defense. But saving the lives of thousands will mean asking the one she loves to give up everything. \\n With heart-pounding action and suspense, Marie Lu’s bestselling trilogy draws to a stunning conclusion.\\n","cover":"https://allnovel.net/images/champion-legend-3.jpg","author":"Marie Lu","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/champion-legend-3.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:55:38 AM"}}
