{"id":64898,"no":19,"title":"Page 19","content":"“Keep these on for the duration of your visit,” Lady Medina tells us with her rich accent, although I know her words are directed at me. “They will help you see Ross City as it really is.” Intrigued, I put the glasses on. I blink in surprise. The first thing I feel is a subtle tickle in my ears, and the first thing I see are the small, glowing numbers hovering over the heads of each of the Antarcticans. Lady Medina has 28,627: LEVEL 29, while her two companions (who have yet to utter a sound) respectively have 8,819: LEVEL 11 and 11,201: LEVEL 13. When I look around the lobby, I notice all sorts of virtual numbers and words—the green bulbous plant in the corner has WATER: +1 hovering over it, while CLEAN: +1 floats above a dark, half-circle side table. In the corner of my glasses, I see tiny, glowing words: JUNE IPARIS PRINCEPS-ELECT 3 REPUBLIC OF AMERICA LEVEL 1 SEPT. 22. 2132 DAILY SCORE: 0 CUMULATIVE SCORE: 0 We’ve started walking again. None of the others seem particularly concerned about the onslaught of virtual text and numbers layered over the real world, so I’m left to my own intuition. (Although the Antarcticans aren’t wearing glasses, their eyes occasionally flicker to virtual things in the world in a way that makes me wonder whether they have something embedded in their eyes, or perhaps in their brains, that permanently simulates all of these virtual things for them.) One of Lady Medina’s two companions, a broad-shouldered, white-haired man with very dark eyes and golden-brown skin, walks slower than the others. Eventually he reaches me near the end of the procession and falls into step beside me. I tense up at his presence. When he speaks, though, his voice is low and kind. “Miss June Iparis?” “Yes, sir,” I reply, bowing my head respectfully in the way Anden had done. To my surprise, I see the numbers in the corner of my glasses change: SEPT. 22. 2132 DAILY SCORE: 1 CUMULATIVE SCORE: 1 My mind spins. Somehow, the glasses must have recorded my bowing action and added a point to this Antarctican scoring system, which means bowing is equal to one point. This is also when I realize something else: When the white-haired man spoke, I heard absolutely no accent—he’s now speaking perfect English. I glance over to Lady Medina, and when I catch hints of what she’s saying to Anden, I notice that her English now sounds impeccable too. The tickle I’d felt in my ears when I put on the glasses . . . maybe it’s acting as some sort of language translation device, allowing the Antarcticans to revert to their native language while still communicating with us without missing a beat. The white-haired man now leans over to me and whispers, “I am Guardsman Makoare, one of Lady Medina’s newer bodyguards. She has assigned me to be your guide, Miss Iparis, as it seems you are a stranger to our city. It’s quite different from your Republic, isn’t it?” Unlike Lady Medina, the way Guardsman Makoare speaks has no condescension in it at all, and his question doesn’t rub me the wrong way. “Thank you, sir,” I reply gratefully. “And, yes, I have to admit that these virtual numbers I see all over the place are strange to me. I don’t quite understand it.” He smiles and scratches at the white scruff on his chin. “Life in Ross City is a game, and we are all its players. Native Antarcticans don’t need glasses like you visitors do—all of us have chips embedded near our temples once we turn thirteen. It’s a piece of software that assigns points to everything around us.” He gestures toward the plants. “Do you see the words Water—Plus One hovering over that plant?” I nod. “If you decided to water that plant, for example, you would receive one point for doing so. Almost every positive action you make in Ross City will earn you achievement points, while negative actions subtract points. As you accumulate points, you gain levels. Right now, you are at Level One.” He pauses to point up at the virtual number floating over his head. “I am at Level Thirteen.” “What’s the point of reaching . . . levels?” I ask as we leave the hall and step into an elevator. “Does it determine your status in the city? Does it keep your civilians in line?” Guardsman Makoare nods. “You’ll see.” We step out of the elevator and head out onto another bridge (this time it’s covered with an arched glass roof) that connects this building to another. As we walk, I begin to see what Guardsman Makoare is talking about. The new building we enter looks like an enormous academy, and as we peer through glass panels into classrooms lined with rows of what must be students, I notice that all of them have their own point scores and levels hovering over their heads. At the front of the room, a giant glass screen displays a series of math questions, each with a glowing point score over them. CALCULUS SEMESTER 2 Q1: 6 PTS Q2: 12 PTS And so on. At one point, I see one of the students attempt to lean over and cheat from a neighbor. The point score over his head flashes red, and a second later the number decreases by five. CHEATING: −5 PTS 1,642: LEVEL 3 The student freezes, then quickly returns to looking at his own exam. Guardsman Makoare smiles when he sees me analyzing the situation. “Your level means everything in Ross City. The higher your level, the more money you make, the better jobs you can apply for, and the more respected you are. Our highest scorers are widely admired and quite famous.” He points toward the back of the cheating student. “As you can see, our citizens are so engrossed in this game of life that most of them know better than to do things that will decrease their scores. We have very little crime in Ross City as a result.” “Fascinating,” I murmur, my eyes still glued to the classroom even as we reach the end of the hallway and head out onto another bridge. After a while, a new message pops up in the corner of my glasses. WALKED 1,000 METERS: +2 PTS DAILY SCORE: 3 CUMULATIVE SCORE: 3 To my surprise, seeing the numbers go up gives me a brief thrill of accomplishment. I turn to Guardsman Makoare. “I can understand how this leveling system is good motivation for your citizens. Brilliant.” I don’t say my next thought aloud, but secretly I wonder, How do they distinguish between good and bad actions? Who decides that? What happens when someone speaks out against the government? Does her score go up or down? I marvel at the technology available here—it really makes clear, for the first time, exactly how far behind the Republic is. Have things always been so unequal? Were we ever the leaders? We eventually settle inside a building with a large, semicircular chamber used for political meetings (“The Discussion Room,” Lady Medina calls it). It’s lined with flags from countries around the world. In the chamber’s center is a long, mahogany wood table, and now the Antarctican delegates sit on one side while we sit on the other. Two more delegates who are at similar levels as Lady Medina join us as we begin our talks, but it’s a third delegate who catches my attention. He’s in his midforties, with bronze hair and dark skin and a well-trimmed beard. The text hovering over his head reads LEVEL 202. “President Ikari,” Lady Medina says as she introduces him to us. Anden and the other Senators bow their heads respectfully. I do the same. Although I don’t dare turn my eyes away from the discussion, I can see the Republic’s flag in my peripheral vision. With my glasses I see the virtual text THE REPUBLIC OF AMERICA above it in glowing letters. Right next to it is the Colonies flag, with its black and gray stripes and the bright gold bird in its center. Some of the other countries’ flags have the word Ally hovering under their names. But we don’t. From the beginning, our discussion is tense. “It seems like your father’s plans have backfired against you,” the President tells Anden. He leans stiffly forward. “The United Nations is, of course, concerned that Africa has already given aid to the Colonies. The Colonies declined an invitation to talk with us.” Anden sighs. “Our scientists are hard at work on a cure,” he continues. I notice he doesn’t mention Day’s brother in all this, and Day’s lack of cooperation. “But the Colonies’ forces are overwhelming with Africa’s money and military supporting them. We need help to push them back, or we risk being overrun within the month. The virus could spread to us as well—” “You speak with passion,” the President interrupts. “And I have no doubt that you’re doing great things as the Republic’s new leader. But a situation like this . . . The virus must first be contained. And I’ve heard the Colonies have already breached your borders.” The President’s honey-gold eyes are piercingly bright. When Serge tries to speak up, he silences him immediately, never taking his eyes off Anden. “Let your Elector respond,” he says. Serge falls back into sullen silence, but not before I catch a smug look pass between the Senators. My temper rises. They—the Senator, the Antarctican President, even Anden’s own Princeps-Elect—are all taunting Anden in their own subtle ways. Interrupting him. Emphasizing his age. I look at Anden, quietly willing him to stand up for himself. Mariana nods once at him. “Sir?” she says. I’m relieved when Anden first shoots a disapproving look at Serge, then lifts his chin and calmly replies. “Yes. We’ve managed to hold them off for now, but they are right at the outskirts of our capital.” The President leans forward and rests his elbows on the table. “So, there’s a possibility that this virus has already crossed into your territory?” “Yes,” Anden replies. The President is silent for a moment. Finally, he says, “What exactly do you want?” “We need military support,” Anden replies. “Your army is the best in the world. Help us secure our borders. But most of all, help us find a cure. They’ve warned us that a cure is the only way they’ll retreat. And we need time to make that happen.” The President tightens his lips and shakes his head once. “No military support, money, or supplies. I’m afraid you’re far too indebted to us for that. I can offer my scientists to help you find a cure for the disease. But I will not send my troops into an area infected with disease. It’s too dangerous.” When he sees the look on Anden’s face, his eyes harden. “Please keep us updated, as I hope as much as you do to see a resolution for this. I apologize that we can’t be of more help to you, Elector.” Anden leans on the table and laces his fingers together. “What can I do to persuade you to help us, Mr. President?” he says. The President sits back in his chair and regards Anden for a moment with a thoughtful look. It chills me. He’s been waiting for Anden to say this. “You’re going to have to offer me something worth my while,” he finally says. “Something your father never offered.” “And what’s that?” “Land.” My heart twists painfully at those words. Giving up land. In order to save our country, we’ll have to sell ourselves to another nation. Something about it feels as violating as selling our own bodies. Giving up your own child to a stranger. Tearing away a piece of our home. I look at Anden, trying to decipher the emotions behind his composed exterior.","sourceLink":"https://allnovel.net/champion-legend-3/page-19.html","bookId":1696,"book":{"id":1696,"title":"Champion (Legend #3)","description":"Storyline: Champion (Legend #3) He is a Legend. She is a Prodigy. Who will be Champion? June and Day have sacrificed so much for the people of the Republic—and each other—and now their country is on the brink of a new existence. June is back in the good graces of the Republic, working within the government’s elite circles as Princeps-Elect, while Day has been assigned a high-level military position. But neither could have predicted the circumstances that will reunite them: just when a peace treaty is imminent, a plague outbreak causes panic in the Colonies, and war threatens the Republic’s border cities. This new strain of plague is deadlier than ever, and June is the only one who knows the key to her country’s defense. But saving the lives of thousands will mean asking the one she loves to give up everything. With heart-pounding action and suspense, Marie Lu’s bestselling trilogy draws to a stunning conclusion.","cover":"https://allnovel.net/images/champion-legend-3.jpg","author":"Marie Lu","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/champion-legend-3.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:55:38 AM"}}
