{"id":64885,"no":6,"title":"Page 6","content":"“Ah, well.” Senator Tanaka of California tugs on the collar of his military jacket and exchanges a look with his wife. “That’s wonderful news, Elector. Of course, I’m sure the tutors also know how much of a Senator’s job is learned outside of texts and from years of experience in the Senate chamber. Like our dear Senator Carmichael here.” He pauses to nod graciously at Serge, who puffs up.\\n\\n Anden waves off his concern. “Of course,” he echoes. “All in good time, Senator.”\\n\\n Beside me, Mariana sighs, leans over, and tilts her chin at Serge. “If you stare at his head long enough, it might sprout wings and take flight,” she mutters.\\n\\n I smile at that.\\n\\n They steer off the topic of me and onto the topic of how to better sort students into high schools now that the Trials are discontinued. The political chatter grates on my nerves. I start scanning the crowd again for Day. After more futile searching, I finally put a hand on Anden’s arm and lean over to whisper, “Excuse me. I’ll be right back.” He nods in return. When I turn away and start blending in with the crowd, I can feel his stare lingering on me.\\n\\n I spend several minutes walking the ballroom in vain, greeting various Senators and their families as I go. Where is Day? I try to hear snatches of conversations, or notice where clusters of people might be gathering. Day is a celebrity. He must be attracting attention if he already arrived. I’m about to make my way across the other half of the ballroom when I’m interrupted by the loudspeakers. The pledge. I sigh, then turn back to where Anden has already taken his place on the front stage, flanked on both sides by soldiers holding up Republic flags.\\n\\n “I pledge allegiance to the flag of the Republic of America . . .”\\n\\n Day. There he is.\\n\\n He’s standing about fifty feet away, his back partially turned to me so that I can only see a tiny sliver of his profile, his hair loose and thick and perfectly straight, and on his arm is a girl in a shining gold dress. When I observe him more closely, I notice that his mouth isn’t moving at all. He stays silent throughout the entire pledge. I turn my attention back to the front as applause fills the chamber and Anden begins his prepared speech. From the corner of my eye, I see Day turn to look over his shoulder. My hands tremble at this momentary glimpse of his face—have I really forgotten how beautiful he is, how his eyes reflect something wild and untamed, free even in the midst of all this order and elegance?\\n\\n When the speech ends, I head straight in Day’s direction. He’s dressed in a perfectly tailored black military jacket and suit. Is he also thinner? He looks to have lost a good ten pounds since the last time I saw him. He’s been ill recently. As I get closer, Day catches sight of me and pauses in his conversation with his date. His eyes widen a little. I can feel the heat rising on my cheeks, but force it down. This will be our first face-to-face meeting in months, and I refuse to make a fool of myself.\\n\\n I stop a few feet away. My eyes wander to his date, a girl whom I recognize as Faline, the eighteen-year-old daughter of Senator Fedelma.\\n\\n Faline and I exchange a quick nod. She grins. “Hi, June,” she says. “You look gorgeous tonight.”\\n\\n She makes a genuine smile escape from me, a relief after all the practiced smiles I’ve been giving the other Princeps-Elects. “So do you,” I reply.\\n\\n Faline doesn’t waste a single awkward second—she catches the slight blush on my cheeks and curtsies to both of us. Then she heads back into the crowd, leaving Day and me alone in the sea of people.\\n\\n For a second, we just stare at each other. I break the silence before it stretches on for too long. “Hi,” I say. I take in his face, refreshing my memory with every little detail. “It’s good to see you.”\\n\\n Day smiles back and bows, but his eyes never leave me. The way he stares sends rivers of heat racing through my chest. “Thanks for the invite.” Hearing his voice in person again . . . I take a deep breath, reminding myself of why I invited him here. His eyes dance across my face and to my dress—he seems ready to comment on it, but then decides against it and waves his hand at the room. “Nice little party you have here.”\\n\\n “It’s never quite as fun as it looks,” I reply in a hushed voice, so that the others can’t hear me. “I think some of these Senators might burst from being forced to talk to people they don’t like.”\\n\\n My teasing brings a small smile of relief to Day’s lips. “Glad I’m not the only unhappy one.”\\n\\n Anden has already left the stage, and Day’s comment reminds me that I should be escorting him to the banquet soon. The thought sobers me. “It’s almost time,” I say, motioning for Day to follow me. “The banquet is very private. You, me, the other Princeps-Elects, and the Elector.”\\n\\n “What’s going on?” Day asks as he falls into step beside me. His arm brushes once against mine, sending shivers dancing across my skin. I struggle to catch my breath. Focus, June. “You weren’t exactly specific in our last conversation. I hope I’m putting up with all of these snobby Congress trots for a good reason.”\\n\\n I can’t help my amusement at the way Day refers to the Senators. “You’ll find out when we get there. And keep your insults to a minimum.” I look away from him and toward the small corridor we’re heading for, Jasper Chamber, a discreet hall branching away from the main ballroom.\\n\\n “I’m not going to like this, am I?” Day mutters close to my ear.\\n\\n Guilt rises in me. “Probably not.”\\n\\n We settle down in the private banquet room (a small, rectangular cherrywood table with seven seats), and after a while, Serge and Mariana filter in. They each take a seat on either side of Anden’s reserved chair. I stay next to Day, as Anden had wished. Two servers go around the table, placing dainty plates of watermelon and pork salad before each seat. Serge and Mariana make polite small talk, but neither Day nor I says another word. Now and then, I manage to steal a glance at him. He’s eyeing the lines of forks, spoons, and knives at his place setting with an uncomfortable frown, trying to figure them out without asking for help. Oh, Day. I don’t know why this gives me a painful, fluttering feeling in my stomach, or why it pulls my heart to him. I’d forgotten how his long lashes catch the light.\\n\\n “What’s this?” he whispers to me, holding up one of his utensils.\\n\\n “A butter knife.”\\n\\n Day scowls at it, running a finger along its blunt, rounded edge. “This,” he mutters, “is not a knife.”\\n\\n Beside him, Serge notices his hesitation too. “I take it you’re not accustomed to forks and knives where you’re from?” he says coolly to him.\\n\\n Day stiffens, but he doesn’t miss a beat. He grabs a larger carving knife, purposely disturbing his place’s careful setup, and gestures casually with it. Both Serge and Mariana edge away from the table. “Where I come from, we’re more about efficiency,” he replies. “A knife like this’ll skewer food, smear butter, and slit throats all at the same time.”\\n\\n Of course Day’s never slit a throat in his life—but Serge doesn’t know that. He sniffs in disdain at the reply, but the blood drains from his face. I have to pretend to cough so that I don’t laugh at Day’s mock-serious expression. For those who don’t know him well, his words actually sound intimidating.\\n\\n I also notice something I hadn’t earlier—Day looks pale. Much paler than I remember. My amusement wavers. Is his recent illness something more serious than I’d first assumed?\\n\\n Anden arrives in the room a minute later, causing the usual stir as we all rise for him, and gestures for all of us to take our seats. He’s accompanied by four soldiers, one of whom closes the door behind him and finally seals us in to our private meal.\\n\\n “Day,” Anden greets. He pauses to nod courteously in Day’s direction. Day looks unhappy with the attention, but manages to return the gesture. “It’s a pleasure to see you again, if under unfortunate circumstances.”\\n\\n “Very unfortunate,” Day says in return. I shift uncomfortably in my seat, trying to imagine a more awkward scenario than this dinner setup.\\n\\n Anden lets the stiff reply slide. “Let me catch you up on the current situation.” He puts his fork down. “The peace treaty we’ve been working on with the Colonies is now shelved. A virus has hit the Colonies’ southern warfront cities hard.”\\n\\n Beside me, Day crosses his arms and regards the crowd with a suspicious expression on his face, but Anden goes on. “They believe this virus was caused by us, and they are demanding that we send them a cure if we want to continue peace talks.” Serge clears his throat and starts to say something, but Anden holds up a hand for silence. He then goes on to spill all the details—how the Colonies first sent a harsh message to the Republic, demanding info on the virus wreaking havoc amongst their troops, hastily withdrawing their affected soldiers, and then broadcasting their ultimatum to the warfront generals, warning of dire consequences if a cure was not delivered immediately.\\n\\n Day listens to all of it without moving a muscle or uttering a word. One of his hands grips the edge of the table tightly enough to turn his knuckles white. I wonder whether he’s guessed where this is going and what all this has to do with him, but he just waits until Anden has finished.\\n\\n Serge leans back in his chair and frowns. “If the Colonies want to play games with our peace offer,” he scoffs, “then let them. We’ve been at war long enough—we can handle some more.”\\n\\n “No, we can’t,” Mariana interjects. “Do you honestly think the United Nations will accept the news that our peace treaty fell apart?”\\n\\n “Do the Colonies have any evidence that we caused it? Or are these empty accusations?”\\n\\n “Exactly. If they think we’re going to—”\\n\\n Day suddenly speaks up, his face turned toward Anden. “Let’s stop dragging our feet,” he says. “Tell me why I’m here.” He’s not loud, but the ominous tone of his voice hushes the conversation in the room. Anden returns his look with an equally grave one. He takes a deep breath.\\n\\n “Day, I believe this is the result of one of my father’s bioweapons—and that the virus came from your brother Eden’s blood.”\\n\\n Day’s eyes narrow. “And?”\\n\\n Anden seems reluctant to continue. “There’s more than one reason why I didn’t want all my Senators in here with us.” He leans forward, lowers his voice, and gives Day a humbled look. “I don’t want to hear anyone else right now. I want to hear you. You are the heart of the people, Day—you always have been. You’ve given everything you have in order to protect them.” Day stiffens beside me, but Anden goes on. “I fear for the people. I worry about their safety, that we’ll be handing them over to the enemy just as we’re starting to put the pieces together.” He grows quieter. “I need to make some difficult decisions.”\\n\\n Day raises an eyebrow. “What kind of decisions?”\\n\\n “The Colonies are desperate for a cure. They will destroy us to get it, everything both you and I care about. The only chance we have of finding one is to take Eden into temporary—” \\n\\n","sourceLink":"https://allnovel.net/champion-legend-3/page-6.html","bookId":1696,"book":{"id":1696,"title":"Champion (Legend #3)","description":"Storyline: Champion (Legend #3) \\n He is a Legend. \\n She is a Prodigy. \\n Who will be Champion? \\n June and Day have sacrificed so much for the people of the Republic—and each other—and now their country is on the brink of a new existence. June is back in the good graces of the Republic, working within the government’s elite circles as Princeps-Elect, while Day has been assigned a high-level military position. \\n But neither could have predicted the circumstances that will reunite them: just when a peace treaty is imminent, a plague outbreak causes panic in the Colonies, and war threatens the Republic’s border cities. This new strain of plague is deadlier than ever, and June is the only one who knows the key to her country’s defense. But saving the lives of thousands will mean asking the one she loves to give up everything. \\n With heart-pounding action and suspense, Marie Lu’s bestselling trilogy draws to a stunning conclusion.\\n","cover":"https://allnovel.net/images/champion-legend-3.jpg","author":"Marie Lu","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/champion-legend-3.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:55:38 AM"}}
