{"id":103721,"no":41,"title":"Page 41","content":"\\n\\n \"I don\u0027t know. Cultures vary. Sometimes it\u0027s an insult to give a gift in exchange for another.\"\\n\\n \"Then what do I do? Does he want me to do something with this? Cut my palm? Become blood brothers?\"\\n\\n She shrugged.\\n\\n Their guide stared at them during their conversation. Ears swiveling back and forth as they spoke. Finally, he grunted loudly and stepped forward, snatching the knife from Ben. He knelt by Ben and yanked his pants leg up.\\n\\n Ben began to snatch his leg away-then froze.\\n\\n Ashley saw it too and gasped. \"What is that?\" She crossed to examine it closer, bending down beside Ben. A palm-sized black slug was attached to his shin. As she watched, its body quivered in a wave of undulating tissue; it grew a few millimeters larger.\\n\\n Their guide reached forward with his blade and deftly scooped the creature off Ben\u0027s leg. Its suckers caught stubbornly on his flesh, then popped free. Two small pink circles with pinpoint holes in the center marked Ben\u0027s leg where the creature had attached. A couple drops of blood oozed out.\\n\\n \"Fucking leeches!\" Ben exclaimed, a shiver passing through him. He stood up and stripped off his pants, his face frozen in a look of disgust. Five more leechlike parasites were attached.\\n\\n Grimacing, Ashley noticed one had climbed as high as his right buttock. She glanced down at her own pants. Suddenly it felt like thousands of scabrous creatures were crawling up her legs. Knowing it was only her imagination, she still quickly unbuckled her belt and climbed out of her pants.\\n\\n Holding her breath, she looked down. Two black patches covered her left thigh and there was one on her right. Shit! There was no telling what sort of diseases these slugs might be carrying.\\n\\n Ben, standing naked from the waist down, looked green as his last parasite was extracted. Once finished, the guide came toward her with the knife.\\n\\n \"I can do this myself,\" she said, holding out her hand for the knife.\\n\\n Their guide glanced at her hand, then up to her face. She pushed her hand out further, insistent. He paused and seemed to understand… even nodded! He placed the hilt of the knife in her hand.\\n\\n Goddamn leeches! She used the tip of the knife to pry the posterior sucker loose, then lifted the parasite\u0027s trunk with the blade until the anterior sucker was reached. It took a bit of tugging to dislodge this last sucker. Carrying the leech on the diamond blade, she tossed it in the creek like their guide had. She then went to work on the other two.\\n\\n Once the last one was scraped off, its black body still balanced on the blade, their guide carefully picked up the leech. He pointed at it. \"Dogaomarubi!\" he said, then threw the parasite into the creek.\\n\\n Ben buckled his pants. \"I don\u0027t think dogaomarubi means \u0027rest break.\u0027 I think it means \u0027goddamn fucking land leech.\u0027\"\\n\\n Hooking the pack over her shoulders, she nodded. \"Notice how he didn\u0027t destroy the parasites. He was careful cutting them free. I watched one of the leeches in the water. It swelled with water, then crawled back into the fields.\"\\n\\n \"Yeah, so?\"\\n\\n \"I think they\u0027re used in maintaining the fields. Like a farmer uses bees. They use the leeches as some form of irrigation. A biological tool.\"\\n\\n Ben quivered. \"Yeah, but bees don\u0027t suck your blood,\" he mumbled.\\n\\n Ashley rolled her eyes and followed their guide over the bridge and into the fields again. After an hour, a herd of lumbering creatures could be seen in the distance, apparently grazing. They raised blocky heads on short necks to stare at them as they passed.\\n\\n \"Sorta look like wallabies on steroids,\" Ben said.\\n\\n \"Turituri,\" their guide said, pointing at them.\\n\\n Ashley nodded, amazed at the ecosystem evolved here. Phytoplankton and volcanic gases as a base energy source, initiating a food chain based on fungi and microorganisms. The system must be incredibly fragile, requiring constant manipulation to maintain. Like the leeches, each organism played a key role in fortifying and protecting the environment.\\n\\n She eyed their guide\u0027s back. What level of intelligence did this ecosystem require to maintain itself? Mere chance would not allow such a rich and varied environment to flourish.\\n\\n As she continued, a flock of birds exploded nearby. Quick as lightning, their guide whipped out a sling and chucked a stone at the birds, knocking one from the sky. He bolted into the field to retrieve his kill, returning shortly with the bird tied to his belt. Ashley stared at his catch. No feathers. What she had thought was a bird was a winged lizard.\\n\\n Ben had been eyeing the \"bird\" too. \"I hope that\u0027s not our dinner.\"\\n\\n \"Probably tastes like chicken,\" she said, tugging him along.\\n\\n Their guide stopped several feet ahead and squatted down. Ashley followed his example and slunk lower, fearing a predator might be approaching. She cautiously surveyed the savanna.\\n\\n \"What is it?\" Ben asked, slipping behind her, crouching too.\\n\\n Ashley glanced ahead toward their guide. He squatted a few feet away, defecating beside the trail. Ashley was speechless.\\n\\n Ben wasn\u0027t. \"Not exactly a private sort of folk, are they?\"\\n\\n Their guide finished and cleaned himself with a frond from the field. He then turned around and used the same frond to pick up his stool and store it in a small pouch on his belt.\\n\\n \"Tidy too,\" said Ben.\\n\\n Ashley shook her head. \"Conservation.\"\\n\\n \"What?\"\\n\\n \"This ecosystem\u0027s energy is limited. Everything must be put to use. For this fragile system to survive, nothing can be wasted.\"\\n\\n \"Still… remind me not to shake this fella\u0027s hand.\"\\n\\n Their guide continued forward with hardly a glance back. Ashley followed.\\n\\n After two more hours of travel and two more stops to remove leeches, Ashley dragged at a snail\u0027s pace, drenched in sweat, every part of her anatomy scratched and poked.\\n\\n Their guide turned to her. \"Daga mond carofi,\" he said, his slit-pupiled eyes narrowed with concern.\\n\\n She shook her head, not understanding. She uncapped her canteen and drank.\\n\\n He pointed toward the distant wall; the path now turned in that direction. \"Carofi!\"\\n\\n She wiped her forehead and squinted where he pointed. Just barely distinguishable from the shadows on the far wall was a pattern of black dots, arranged in rows and levels. She recognized the pattern, similar to the grouping of dwellings in Alpha Cavern. Even from this far away, she could see plenty of motion. Little figures clambering among the dwellings.\\n\\n \"My god, Ben. Look! A village!\" she said, turning to him.\\n\\n Pulling on his right ear, he wore an odd expression, a mixture of surprise and fear. \"Do you hear…? A buzzing…?\" His eyes rolled back, the whites of his eyes showing.\\n\\n \"Ben?\"\\n\\n He began to sway a bit, teetering, then collapsed into the field.\\n\\n Ben struggled against the darkness. He could hear Ashley call to him, but it sounded like she was down a deep well, so far away, fading. The blackness swallowed him further.\\n\\n He felt a tugging on his shoulder, at first tenderly, then more urgently. Ben\u0027s eyes fluttered open. His grandfather shook him again. \"Benny boy, no time to take a nap. We need you up and about.\"\\n\\n Not again, he thought, as he looked around at the familiar cavern. Trunks of rock, bearing red bulbous fruit, surrounded him. He was dreaming. But how could that be? His grandfather was naked except for a loincloth, his chest painted in primary colors.\\n\\n \"What do you want?\" he asked.\\n\\n \"Come. Follow.\" His grandfather stood up and pointed to a cavern opening with a star scrawled above the door-way. \"This way.\" His dead grandfather crossed to the opening and climbed inside.\\n\\n Ben tried to follow but found he couldn\u0027t sit up. He was paralyzed. \"I can\u0027t move!\" he called.\\n\\n Only a voice from the cavern answered. \"Come when you can. You are one with us!\"\\n\\n Blackness swallowed him up once again. He tried to push it back, succeeding this time. Light burst around him, and he found himself staring into Ashley\u0027s worried face.\\n\\n \"Ben?\" she asked. \"What happened?\"\\n\\n \"I don\u0027t know.\" He sat up. \"I don\u0027t know.\"\\n\\n As they approached the encampment, Ashley stared up, her mouth hanging open. She tried counting the number of dwellings carved into the wall but lost her concentration after a hundred. The grouping of homes was crowded in a scalloped declivity about a mile wide, forming a natural amphitheater. The level of homes climbed some twenty tiers up, carved stairways joining landing to landing, thick ropes and crude pulleys draped down the face of the cliff in several locations.\\n\\n These cave dwellings, though similar to the ones found in Alpha Cavern, were not the stark spartan dwellings found there. Rather, they had been transformed into comfortable-looking homes. The walls were festooned with multicolored weavings; entryways were draped with blankets in intricate designs; woven banners hung from various levels depicting strange animals and complicated hunts. Stone pottery painted in yellows, reds, and blues dotted many landings.\\n\\n Ben reached across and took her hand as they left the yellow fields and entered the curve of homes. Squeezing his hand, she noticed the rock floor had been polished to an almost smooth surface-whether from years of arduous labor or simply from centuries of ordinary foot traffic, she wasn\u0027t sure.\\n\\n She followed the guide through an increasing throng of spectators. Some hung back with wide-eyed awe, some crept up to gently touch her arm or pluck at her clothes, and some hid behind others, peeking around a shoulder. She stared up at the cliffs surrounding them. Small hands held blankets aside to stare at them. The carved stairs between levels were crowded with thousands of sharp faces peering from above. A scattering of toddlers ran between the legs of their parents.\\n\\n All were naked, like their guide. A few, however, were adorned with various crude necklaces, and some wore caps of woven reed. One group of males, all charcoal-haired, had some type of sharpened bone piercing their noses.\\n\\n Their guide stopped and knelt on a stone, head bowed, waiting.\\n\\n Ashley and Ben stood behind him. Looking over their guide\u0027s shoulder, Ashley caught sight of one adult female who drew her attention. While only slightly less furred than their guide, her pendulous breasts were bare, with wide tan nipples drooping down to her bulging belly. She exhibited all the signs of pregnancy. Ashley was about to turn away when a sudden motion caught her eye. A tiny hand popped out of the bulge in the female\u0027s belly; it reached up and grabbed a handful of fur beneath a breast. Using this handhold, a mewling infant, pink and hairless, pulled itself from her belly and began suckling. The mother seemed unaware and just continued to stare at Ashley. Ashley squinted, fascinated. The infant, made nervous by the commotion around it, lowered itself back down into its hiding place. Into a pouch! \\n\\n","sourceLink":"https://allnovel.net/subterranean/page-41.html","bookId":1526,"book":{"id":1526,"title":"Subterranean","description":"Storyline: Travel to the bottom of the earth to a place you never dreamed existed. Beneath the ice a hand-picked team of specialist makes its way toward the center of the world. They are not the first to venture into this magnificent subterranean labyrinth. Those they follow did not return. \\n Over the rocks...Across the yawning caverns...beyond the black river...You are not alone. Into the darkness where breathtaking wonders await you-and terrors beyond imagining...Revelations that could change the world-things that should never be disturbed...At the bottom of the earth is the beginning. Keep moving toward a miracle that cannot be, toward a mystery older than time.\\n","cover":"https://allnovel.net/images/subterranean.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/subterranean.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:27:17 PM"}}
