{"id":104775,"no":22,"title":"Page 22","content":"\n The thumping of the blades slowed and quieted.\n In its absence, Lisa recognized a new rumble. A slight vibration tickled the soles of her feet.\n \"We\u0027re moving,\" Henri said.\n Ryder swore around his clamped cigar.\n Lisa saw it was true. Very slowly, like the hands of a clock, the view of the burning township was shifting.\n \"They\u0027re taking the ship out,\" Miller said.\n Lindholm clenched a fist to his chest.\n Lisa felt a similar fear. There remained a certain level of security in knowing land was so near. But even that was being taken from them. Her breathing grew heavier, yet drew less air. Surely someone would soon realize what had transpired and come to investigate. In fact, she was due to call Painter in only three hours. When she didn\u0027t call in—\n The pace of their movement accelerated as the giant cruise ship fought its own inertia and began to roll away from the island.\n She checked her watch, then turned to Ryder. \"Mr. Blunt, how fast can your ship travel?\"\n He stubbed out his cigar in an ashtray. \"The Hales Trophy benchmark for racing the transatlantic crossing in a cruise ship is forty knots. Bloody fast.\"\n \"And the Mistress?\" she asked.\n Ryder patted one of the bulkhead walls. \"Pride of the fleet. German-designed engines, monohull construction. She\u0027s capable of forty-seven knots.\"\n Lisa calculated in her head. If she didn\u0027t phone in three hours, when would Painter begin to worry? In four or five hours? She shook her head. Painter wouldn\u0027t wait a minute longer.\n \"Three hours,\" she mumbled to herself. But was that still too late? She turned to Ryder. \"Is there a map in here?\"\n Ryder pointed and led the way. \"A globe. In the library alcove.\"\n He took her to a niche off the main room lined with teak bookshelves. A standing wooden globe rested in the center. She leaned over it and rotated the world to bring up the Indonesian islands. She calculated in her head and measured with her fingers.\n \"In three hours we\u0027ll be lost among the Indonesian chain of islands.\"\n The region, dominated by the bigger islands of Java and Sumatra, was literally a maze of smaller atolls and islets. Over eighteen thousand of them, spread over an area equivalent to the size of the continental United States. Away from the main cities of Jakarta and Singapore, the region subsisted at a Stone Age level of technology. Cannibalism was still practiced on some of the outer islands. If you wanted to hide a cruise ship, here would be a good place to do it.\n \"They can\u0027t hope to steal an entire ship,\" Lindholm exclaimed, drawn to the library in the wake of the others. \"What about surveillance satellites? You can\u0027t hide something as big as a cruise ship.\"\n \"Don\u0027t underestimate our captors,\" Henri said. \"First someone has to know to look for us.\"\n Lisa knew he was right. Given the swiftness of the assault, along with the collusion of key members of the ship\u0027s crew, the hijacking had to have been weeks in the planning. Someone knew what was happening on Christmas Island long before the rest of the world. Lisa remembered the patient in the isolation ward, the John Doe with the flesh-eating bacteria. He had been found wandering the island five weeks ago.\n Did their captors\u0027 knowledge extend that far?\n A commotion at the suite\u0027s double door drew them all around. A pair of men entered. In the lead, Lisa recognized the pirate leader with the tattooed face.\n Stepping past the Maori warrior, a tall stranger pushed forward. He swept off a wide-brimmed panama hat and passed it to a woman who appeared from beyond the tattooed man\u0027s shoulder. Striding forward, the newcomer had apparently come dressed for a garden party, dapperly attired in a loose-fitting white linen suit with a matching cane, his salt-and-pepper hair cut rakishly long to the collar. His burnished features and close-set eyes cast him as Indian or perhaps Pakistani.\n He crossed to the group, thumping his cane, but plainly not needing the support, all for show. His eyes glinted with a misplaced cheeriness.\n \"Namaste.\" He greeted them in Hindi with a slight bow of his head. \"Thank you all for joining me here.\"\n As the stranger settled to a stop, he nodded to the owner of the Mistress of the Seas. \"Sir Ryder, I appreciate your hospitality and the use of your fine ship. We will do our best to return your ship to you unscathed.\"\n Ryder merely glowered, sizing up the man.\n Turning, the stranger acknowledged the scientists. \"As we embark on this great endeavor, it is a privilege to have such leading experts from the World Health Organization gathered in one room.\"\n Lisa noted Henri\u0027s brows pinch both in wariness and confusion.\n The stranger\u0027s eyes settled last upon Lisa. \"And of course, we must not forget our colleague from US covert operations. Sigma Force, I believe, yes?\"\n Stunned silent, Lisa could only stare. How could he—?\n The man offered the barest bow in her direction, genteel, not mocking. \"I\u0027m sorry your partner could not join us. It seems he met with a mishap while we attempted to fetch him. Something to do with indigenous crabs. The details remain sketchy. We lost several of our own men in the attempt. Only one fellow made it back alive.\"\n Lisa\u0027s vision narrowed, closing down with dread.\n Monk...\n A hand touched her shoulder, consoling. It was Ryder Blunt. He faced the stranger. \"Who the bloody hell are you?\"\n \"Of course. My apologies.\" The man lifted a palm and formally introduced himself. \"Dr. Devesh Patanjali, chief acquisition officer, specializing in biotechnology, for the Guild.\"\n Despite her anguish, a cold stone settled into the pit of Lisa\u0027s stomach. She had heard all about the Guild from Painter . .. and the bloody swath that the terrorist organization left behind in its wake.\n The man tapped his cane on the floor with a note of finality. \"And I\u0027m afraid we must not waste any more time on introductions. We have much work to do before we reach port in the morning.\"\n \"What work?\" Lisa managed to force out, bitter with grief.\n He cocked one eyebrow toward her. \"My dear, together we must save the world.\"\n 3:45 P.M.\n Monk clamped his palm tight over the man\u0027s mouth. His other hand\u0027s prosthetic fingers tightened on the man\u0027s throat, just under his jaw, squeezing off his carotid, halting blood flow to the brain. The man struggled, but Monk\u0027s fingers were strong enough to crack walnuts between them. He waited for the man\u0027s kicking legs to go slack—then lowered him to the floor.\n He hauled the man into a small equipment closet.\n Monk noted the vibration underfoot, and a sonorous pitch to the engines. He straightened. The ship was moving. He had stowed away just in time.\n After the explosion of his Jet Ski, Monk had boarded via one of the stabilizing anchor chains on the far side of the ship, shedding his scuba tanks and letting them sink to the bottom of the cove. His entry point was scantily guarded, most of the attention being directed toward shore. From the chain, he was able to leap to one of the hanging lifeboats, then clamber and roll to the Promenade Deck.\n He had ducked quickly into hiding.\n From the supply closet, he had waited a quarter hour for a lone guard to pass, one of the pirates, bearing a Heckler \u0026 Koch assault rifle. The guard was now sprawled in the same closet. Monk unzipped his wet suit and stripped the man of his loose pants and shirt. He changed quickly, but he was unable to cram his feet into the stolen boots.\n Too small.\n No choice, he left barefooted, but not barehanded.\n The rifle\u0027s weight helped center him.\n Stepping into the hall, he pulled the head scarf over his face, masking up like the other pirates. Monk knew the ship, having memorized the schematics while en route to the islands from the States. He hurried down a deck and along the starboard hallway. He met another two pirates at the stairwell, but he merely shouldered through them, appearing busy and hassled.\n One of the guards yelled at him, jostled by his passage. Monk didn\u0027t understand the language, but he knew when he was being cursed. He lifted his rifle, acknowledging but not stopping.\n He hurried down the hallway.\n Lisa and Monk shared adjoining staterooms here. It was his first place to hunt for his missing partner. Monk had passed two sprawled bodies on his way down here, shot in the back, left where they had fallen. He had to find her.\n He counted the staterooms. He heard someone crying behind one door, but he hurried until he reached their assigned cabins.\n He tugged on his own door. Locked. He had left his room\u0027s electronic key card back with his bags in the beached Zodiac. He moved to the next door, Lisa\u0027s cabin. The knob refused to budge—but he heard someone stir behind the door.\n It had to be Lisa.\n Thank God. . .\n He tapped a plastic knuckle lightly on the door and leaned his lips close. Lisa ... it\u0027s me.\n The peephole in the door darkened as someone shifted to peek through. Monk stepped back and lowered his head scarf, revealing himself. After a breath, the chain scraped on the other side, and the dead bolt released with a click.\n Monk pulled up his mask and checked up and down the hall. \"Hurry it up,\" he whistled out.\n The door swung open, pulled inward.\n Turning back to the door, he stepped forward. \"Lisa, we have to—\"\n Monk immediately recognized his mistake and swung up his gun.\n It was not Lisa.\n Silhouetted against the brighter sunlight in the cabin, a young man crouched, half hidden by the door. \"Don\u0027t. .. please don\u0027t shoot.\"\n Monk held his rifle rock-steady while he scanned the cabin. Someone had ransacked the room: drawers opened and dumped, closets emptied. But his attention quickly fixed on the room\u0027s one other occupant: a dead body, facedown on the bed. It was one of the pirates. From the pool of blood soaked into the bedding, his throat had been slashed.\n Eyes widening, Monk turned his attention back to the trespasser.\n \"Who are you?\"\n The young man waved an arm to encompass the room. \"I came here to find Dr. Cummings. I didn\u0027t know where else to look.\"\n Monk finally recognized the young nurse who had been helping Lisa. He could not recall the man\u0027s name. \n","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-22.html","bookId":1529,"book":{"id":1529,"title":"The Judas Strain (Sigma Force #4)","description":"Storyline: \n The Judas Strain (Sigma Force #4) \n \"ju-das strain, n. A scientific term for an organism that drives an entire species to extinction\" \n A master at combining historical and scientific intrigue with cutting-edge adventure, \"New York Times\" bestselling author of \"Map of Bones\" and \"Black Order\" James Rollins returns with his most relentless, high-octane thriller to date--a terrifying story of an ancient menace reborn to plague the modern world . . . and of an impossible hope that lies hidden in the most shocking place imaginable: \"within the language of angels.\" \n From the depths of the Indian Ocean, a horrific plague has arisen to devastate humankind--a disease that\u0027s unknown, unstoppable . . . and deadly. But it is merely a harbinger of the doom that is to follow. \n Aboard a cruise liner transformed into a makeshift hospital, Dr. Lisa Cummings and Monk Kokkalis--operatives of the shadowy covert organization SIGMA Force--search for answers to the bizarre affliction that has inexplicably washed ashore. But there are others with far less altruistic intentions. In a savage and sudden coup, terrorists hijack the vessel, turning a mercy ship into a floating bio-weapons lab. \n At a Fourth of July celebration a world away, SIGMA\u0027s commander Gray Pierce thwarts the murderous schemes of a beautiful assassin--a would-be killer who holds the first clue to the discovery of a possible cure. With the fate of every man, woman, and child on Earth hanging in the balance, Pierce joins forces with the woman who wanted him dead, and together they embark upon an astonishing quest--one that winds through Venetian tombs, Byzantine cathedrals, and jungle-encrusted ruins--following the trail of the most fabled explorer in history: \"Marco Polo.\" \n But time is an enemy as a worldwide pandemic grows rapidly out of control. And as a relentless madman dogs their every step, Pierce and his unlikely ally are being pulled into an astonishing mystery buried deep in antiquity and in humanity\u0027s genetic code. And as the seconds tick closer to doomsday, Pierce will realize he can truly trust no one--not the bewitching enigma who runs at his side or even those who are closest to him--for any one of them could be . . . \"a Judas.\"\n \n","cover":"https://allnovel.net/images/the-judas-strain-sigma-force-4.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-judas-strain-sigma-force-4.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:36:08 PM"}}
