{"id":104790,"no":37,"title":"Page 37","content":"His mind ran through various possibilities, reviewing the recent conversations. With Nasser, with Seichan. What was bothering her— —then suddenly he knew. Seichan had practically told him a moment before. Don\u0027t overestimate the Guild. His grip tightened on her arm. He thrust Seichan against the wall beside the doorway. He leaned close, their lips almost touching. \"Oh my God . . . there is no goddamn mole at Sigma. There never was.\" Seichan stammered to explain. Gray would not let her. \"Nasser warned me against calling Sigma, even threatening me? Why? He knew I was aware of a Guild mole in Sigma. So why even bother threatening?\" He shook her. \"Unless there was no mole.\" She flinched, struggled for a moment to knock his arm away, but he clenched tighter, bruising to the bone. \"When were you going to tell me?\" he asked sharply. She finally found her voice—and it was angry, unapologetic, defensive. \"I was going to tell you. After this was all over.\" She sighed in irritation. \"But with your parents captured, I couldn\u0027t keep it a secret any longer. . . not if there is to be any hope of freeing them. I\u0027m not that callous, Gray.\" Seichan tried to turn away, but Gray shifted to keep locked on her. \"Then if there was no mole,\" he asked, \"how did Nasser know about the safe house? The ambush he set up?\" \"A miscalculation on my part.\" Her eyes grew flinty. \"And that\u0027s all I\u0027ll say. You\u0027ll have to trust me that I acted in good faith.\" \"Trust you,\" he scoffed. His reaction seemed to wound her, the barest lowering of her chin. Gray did not let up. \"If I had Sigma\u0027s support from the start—\" Her face hardened. \"You\u0027d have been bogged down, Gray. And I\u0027d be locked in some prison. Useless. I needed both of us out and away as cleanly and as quickly as possible. So I let you believe what you thought.\" Gray searched for some micro-expression, a fleeting glimpse of a contrary emotion indicative of a lie. There was none. She maintained her fixed gaze, clear-eyed, challenging. She did not even bother to hide that there was more left unsaid. Gray scowled at her, cursing himself for not being more careful with her. \"I should just let Nasser shoot you.\" \"Then who is going to watch your back, Gray? Who do you have out here? Kowalski? You\u0027re better off alone. You\u0027ve got me. That\u0027s goddamn it. So let\u0027s get past this. We can continue arguing, waste what little time you have left to call Sigma, or we can sort this all out later.\" She nodded to the door. \"There\u0027s a phone in the hotel lobby. It\u0027s another of the reasons I wanted Nasser to think we were somewhere else. By now, he probably has a trace on all public phones in Hagia Sophia. The one in the lobby should be safe. Or at least safe enough. And you\u0027ll have to be short. We\u0027re already running out of time.\" Gray let her go, thrusting her away. Again a wounded expression flashed across her face. Let her be wounded. If he had known there was no mole, he could\u0027ve contacted Painter from the start. At least arranged for his mother and father to be secure. She must have read the source of his anger. She wiped her face, her voice softening, sounding bone-tired. \"I thought they would be safe, too, Gray. I truly did.\" Gray wanted to snap back at her, but no words came out. Both because he was angry, but more importantly because he could not unload all his guilt on Seichan. There was no denying the simple truth. He had left his parents alone. Not anyone else. 3:04 A.M. Washington, D.C. \"Director Crowe, I have a secure call coming in from Istanbul.\" Painter glanced up from the bank of satellite feeds and over to the communications chief. Who was calling from Istanbul? For the past hour Painter had been arguing with the powers that be at the National Reconnaissance Office and the National Security Agency, attempting to gain full access to ECHELON, their satellite surveillance system, to prioritize a search around Christmas Island. But such remote territory, sparsely populated, was designated low risk and not under constant surveillance. Going outside the box, Painter had finally convinced the Australian Joint Defence Facility at Pine Gap to task one of their satellites to the area. But it would still take another fourteen minutes. \"It\u0027s from Commander Pierce, sir,\" the communications chief said and held out the telephone receiver. Painter swiveled in his seat. What the hell? He took the phone. \"Gray? This is Director Crowe. Where are you?\" The voice came faint. \"Sir, I don\u0027t have much time, and I have a lot of intel to pass on.\" \"I\u0027m listening.\" \"First, my parents have been kidnapped by a Guild agent.\" \"Amen Nasser. We know. We have a wide sweep already under way.\" Surprised silence followed, then Gray continued. \"You also have to reach Monk and Lisa. They\u0027re in danger over in Indonesia.\" \"We\u0027re aware. I\u0027m attempting a satellite pass as we speak. If you\u0027re done telling me what I already know, why don\u0027t you start at the beginning?\" Gray took a deep breath and quickly related what had happened since Seichan had crashed back into his life. Painter asked a few questions and pieces began to fit together like a scattered jigsaw. He had already made several realizations while he waited for the NSA to respond. He had already suspected the Guild might be involved with the incident at Christmas Island. Who else had the resources to steal an entire island\u0027s population and vanish away? Gray just confirmed this conjecture and answered why this was all happening, even giving it a name. The Judas Strain. An hour ago Painter had summoned Dr. Malcolm Jennings back into Sigma\u0027s R\u0026D offices, hauling him from his bed. On the car ride back to Sigma from the site of the kidnapping, Painter had gone over Lisa\u0027s last conversations. Clearly coerced, it made all her statements suspect. Like claiming the disease that so disconcerted her earlier was now just a false alarm. He had remembered Jennings\u0027s earlier panic about the threat of an environmental meltdown. And the man\u0027s last chilling statement. We still don\u0027t know what killed the dinosaurs. Plainly here was something that might interest the Guild. Painter had even guessed that Seichan\u0027s sudden appearance and Gray\u0027s disappearance might be related to Indonesia. Two major Guild actions, striking at the same time. Painter was not a fan of coincidences. There had to be a connection. But he never would have guessed who connected it all together. \"Marco Polo?\" Painter asked, Gray finished his story. \"The Guild is operating on two fronts. A scientific arm is pursuing the current outbreak, seeking a cure and the source. At the same time—\" Painter cut him off. \"A historical arm is following Marco\u0027s path back to the same: a cure and the source.\" It now made a certain awful sense. \"And now Nasser is heading out to Istanbul,\" Painter said. \"He\u0027s probably already in the air.\" \"I can mobilize resources out there, have assets on the ground in the next couple hours.\" \"No. The Guild will know. According to Seichan, Istanbul is one of their major hubs of activity. They\u0027re in all agencies out here. If they realize you\u0027ve activated forces, they\u0027ll know we\u0027ve talked. My parents. . . you can\u0027t. I\u0027ll have to handle Nasser on my own.\" \"But you\u0027ve taken a huge risk as it is, Gray. Sigma\u0027s compromised. I\u0027ll do my best to keep this from leaking any further, but the mole here could—\" \"Director, there is no mole in Sigma.\" Painter started. It took him a moment to regroup, to consider this possibility. \"Are you certain?\" he finally asked. \"Certain enough to stake my parents\u0027 lives on it.\" Painter sat for a moment. He believed Gray. The prickling frustration of dealing with all the interagency squabbling washed away. If there was no mole ... Gray\u0027s voice grew fainter. \"I can\u0027t risk staying on the line any longer. I have to go. I\u0027ll do my best to follow this trail, to see where it leads.\" The line went silent for a moment. Painter thought Gray might have cut the connection, but then he returned. \"Please, Director, find my folks.\" \"I will, Gray. You can be certain of that. And when I do, tell Vigor to expect a call from his niece. It will ring a few times, then hang up. That will be the signal that your parents are safe.\" \"Thank you, sir.\" The phone clicked off. Painter leaned back. \"Sir,\" the communications officer interrupted, \"we should have feed in another two minutes.\" 10:15 a.m. Istanbul Despite the need to hurry, Gray could not stop his feet from slowing as he approached the western facade of Hagia Sophia, awestruck by its size. Vigor noted his craned neck. \"Impressive, isn\u0027t it.\" There was no denying it. The monumental Byzantine structure was considered by many to be the Eighth Wonder of the World. Seated atop a hill where once a temple to Apollo had stood, it overlooked the magnificent blue expanse of the Sea of Marmara and much of Istanbul. Its most striking feature, the massive Byzantine dome, glowed like polished copper in the morning sun, climbing twenty stories into the air. Other lower half domes buttressed it to the east and west, while additional cupolas spread out to either side like attendants to a queen, expanding the breadth of the massive structure. Vigor continued an ongoing history lesson about the place and pointed to the giant archways ahead that led into Hagia Sophia. \"The Imperial Doors. It was through those doors that in 537, Emperor Justinian dedicated the church and declared, \u0027Oh, Solomon I have surpassed thee.\u0027 And it was through those same doors, during the fourteen-hundreds, that Sultan Mehmed, the conquering Ottoman Turk who had sacked Constantinople, poured soil over his head in a humble act before entering the church. He was so impressed that rather than destroying Hagia Sophia, he converted it into a mosque.\" The monsignor waved an arm to encompass the four towering minarets that now rose at each corner of the grounds.","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-37.html","bookId":1529,"book":{"id":1529,"title":"The Judas Strain (Sigma Force #4)","description":"Storyline: The Judas Strain (Sigma Force #4) \"ju-das strain, n. A scientific term for an organism that drives an entire species to extinction\" A master at combining historical and scientific intrigue with cutting-edge adventure, \"New York Times\" bestselling author of \"Map of Bones\" and \"Black Order\" James Rollins returns with his most relentless, high-octane thriller to date--a terrifying story of an ancient menace reborn to plague the modern world . . . and of an impossible hope that lies hidden in the most shocking place imaginable: \"within the language of angels.\" From the depths of the Indian Ocean, a horrific plague has arisen to devastate humankind--a disease that\u0027s unknown, unstoppable . . . and deadly. But it is merely a harbinger of the doom that is to follow. Aboard a cruise liner transformed into a makeshift hospital, Dr. Lisa Cummings and Monk Kokkalis--operatives of the shadowy covert organization SIGMA Force--search for answers to the bizarre affliction that has inexplicably washed ashore. But there are others with far less altruistic intentions. In a savage and sudden coup, terrorists hijack the vessel, turning a mercy ship into a floating bio-weapons lab. At a Fourth of July celebration a world away, SIGMA\u0027s commander Gray Pierce thwarts the murderous schemes of a beautiful assassin--a would-be killer who holds the first clue to the discovery of a possible cure. With the fate of every man, woman, and child on Earth hanging in the balance, Pierce joins forces with the woman who wanted him dead, and together they embark upon an astonishing quest--one that winds through Venetian tombs, Byzantine cathedrals, and jungle-encrusted ruins--following the trail of the most fabled explorer in history: \"Marco Polo.\" But time is an enemy as a worldwide pandemic grows rapidly out of control. And as a relentless madman dogs their every step, Pierce and his unlikely ally are being pulled into an astonishing mystery buried deep in antiquity and in humanity\u0027s genetic code. And as the seconds tick closer to doomsday, Pierce will realize he can truly trust no one--not the bewitching enigma who runs at his side or even those who are closest to him--for any one of them could be . . . \"a Judas.\"","cover":"https://allnovel.net/images/the-judas-strain-sigma-force-4.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-judas-strain-sigma-force-4.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:36:08 PM"}}
