{"id":104793,"no":40,"title":"Page 40","content":"\n The curator didn\u0027t seem to hear. He had already turned to one of the guards and spoke rapidly in Turkish.\n Vigor understood.\n This was even worse.\n \"No, no,\" Vigor insisted, glancing hard to Gray. \"I\u0027m sure our student doesn\u0027t need to be taken to the hospital. No ambulance is needed.\"\n Gray\u0027s eyes widened. They could not leave the church. Their distraction had only succeeded in getting them deeper and deeper into hot water.\n \"The monsignor is right.\" Gray flexed and rotated his arm. Vigor noted a flinch. Gray really had hurt his arm. \"Just sprained a bit. I\u0027ll be fine.\"\n \"No. I insist. It is museum policy. If anyone is injured on the premises, a hospital visit is mandatory.\"\n Vigor saw that there was no way to dissuade the curator.\n Balthazar stepped forward, clearing his throat. \"That sounds prudent. But in the meantime, perhaps there\u0027s a place we could rest. Your office is in the basement, no?\"\n \"Of course. No one will disturb you. 1 will deal with the police and summon you when the ambulance arrives. And Dr. Pinosso, please accept my sincere apologies. You\u0027ve been so generous with your time and knowledge in the past and look how 1 repay you.\"\n Balthazar patted his arm. \"Hasan, do not worry. All is well. Nerves are just shaken up. It serves my student right for not watching where he steps when on a precarious perch.\"\n Sirens sounded in the distance.\n \"This way,\" the curator said.\n A short time later the three of them were alone in Hasan\u0027s basement office. It was sparsely furnished. The schematics for the church were tacked to the back wall, behind a cluttered desk. A single framed photograph of the curator, Hasan Ahmet, shaking hands with the Turkish president adorned the wall above a bank of steel filing cabinets. On the opposite wall was an ancient illuminated map of the Middle East.\n Balthazar flipped the office door\u0027s dead bolt and paced the length of the room. \"There is a maze of rooms down here in the basement. You two could hide out until that Nasser fellow comes. I can go up and tell Hasan that you both left.\"\n \"It will have to do.\" Vigor sank into a couch next to Gray, who was massaging his shoulder. \"We won\u0027t have much time. Did you find anything up there?\"\n As answer, Gray unbuttoned the lower half of his shirt and pulled out a slab of gold and a tube of beaten bronze. He shook his shirt a bit more and a bit of ruddy clay pottery tumbled out. Gray bent down, picked it up, and placed it on the table.\n Vigor began to turn away, but a bit of color from the pottery caught his eye. He retrieved the chunk of reddish clay from the tabletop.\n \"It\u0027s a piece of the hollow brick,\" Gray explained sourly. \"I didn\u0027t want to leave it up there. Heaven knows, things went badly enough.\"\n Vigor briefly examined it. On one side, a bit of purple plaster still clung to it, but on the other side, a thick skein of sky-blue glaze coated the clay. Why would someone glaze the inside of a hollow brick?\n \"Did you see any angelic script up there,\" Vigor asked, and returned the chunk to the table.\n \"No. No writing, nothing unusual.\"\n Balthazar bent down and flipped the golden paitzu over. \"But there is angelic writing here.\"\n Vigor leaned closer. As expected, a single letter of angelic script decorated the back side. A crude circle enclosed it.\n \"The second key,\" Vigor said.\n \"But what\u0027s this?\" Balthazar asked. He nudged the tube.\n Vigor picked it up. It was as thick around as his thumb, unadorned, except for the old hammer marks of its forger. \"It may be a scroll tube.\" He examined one end. A thin coin of bronze had been stamped over the end, sealing it.\n \"We\u0027ll have to open it,\" Gray said.\n Vigor felt some discomfort at his suggestion. As an archaeologist, he feared mishandling such an ancient artifact. It needed to be photographed, its measurements taken, cataloged.\n Gray reached to a pocket and slipped out a penknife. He opened the small blade and held it toward Vigor. \"We\u0027re running out of time.\"\n Taking a deep breath, Vigor accepted the knife. With a twinge of professional discomfort, he used the tip to pry the cap off the end. It popped cleanly, as if only crafted yesterday.\n Vigor cleared a space on the coffee table, tilted the tube, and slid out its contents. A roll of white material dropped to the mahogany table.\n \"A scroll,\" Gray said.\n Without touching it, Vigor made an assessment from his years of study and lifetime of experience. \"It\u0027s not parchment, vellum, or even papyrus.\"\n \"What is it?\" Balthazar asked.\n Vigor wished he had examination gloves for handling the old scroll. Fearful of the oils in his hands, Vigor collected a pencil from the curator\u0027s desk and used the eraser to unroll the free edge of the material.\n It fell away easily, delicate and gauzy.\n \"It looks like cloth,\" Gray said.\n \"Silk.\" Vigor unrolled more and more, teasing it across the length of the table. \"It\u0027s embroidered,\" he said, noting the fine stitching of black thread across the white silk.\n But the needlework did not form a picture or an intricate pattern. Instead, lines of cursive text, stitched into the material, spread down the length of unrolled bolt of silk.\n Gray twisted his head to read, but his frown deepened, not comprehending.\n \"It\u0027s lingua lombarda,\" Balthazar declared with awe.\n Vigor could not take his eyes from the writing. \"The Italian dialect of Marco Polo\u0027s region.\" He reached a trembling hand and followed with the pencil eraser, translating the first line aloud. \" \u0027Our prayer was answered in a most strange manner.\u0027\"\n He glanced to Gray. He read the understanding in the American\u0027s eyes.\n \"It\u0027s the rest of Marco\u0027s story,\" Gray said, \"continuing where the Guild\u0027s copy of his book ended.\"\n \"The missing pages,\" Vigor agreed, \"embroidered onto silk.\"\n Gray glanced to the door, plainly edgy, and waved to the silk diary. \"Read the rest of it.\"\n Vigor started from the beginning, continuing the story of Marco\u0027s party. The first section left them trapped in the City of the Dead and surrounded by a cannibal horde. Vigor carefully translated the next part of the tale, his voice tremulous with the power of Marco\u0027s original words.\n \"Our prayer was answered in a most strange manner. And was thus brought about:\n Night fell over the City of the Dead. From the vantage of our sanctuary, the moats and pools of the city below shone with light of a sepulchral nature; the hue and sheen was that of molds and mushrooms. It cast the scene below into some dread feast expelled from the Devil\u0027s bowels, as the dead fed on the dead. We saw no hope for salvation. What angel would dare tread these blasphemed lands?\n But then it came to pass that three figures emerged from the dark forest. They appeared as such: their skin cast a sheen to match pond and moat, and the dread cannibals parted before their feet insomuch as the wind sweeps through a field of grain. The three crossed through the city with little haste but with clear direction. Once at the foot of the tower, these strange apparitions were seen to be of the same people as those that feasted on flesh. Yet their skin glowed with some Blessed light.\n In great terror, the kaan\u0027s men dropped all weapons and hid their faces against the stone. The three entered our shelter and came upon us with no molestation. Their faces were gaunt and fever-worn; but they seemed sound of flesh, unlike their brothers below. But it was no flesh like unto man. The light of their skins seemed to penetrate their deeper bodies; and thus revealed the churn of bowel and shadowy beat of their hearts. It came also to pass that one of three brushed against one of the kaan\u0027s men. He screamed and fell away; and where he was touched his skin did blister and blacken.\n Friar Agreer lifted his cross against them; but the first of the three came forward with little fear and touched the Dominican\u0027s cross. He spoke in words that no one understood; but with much gesturing, their desire was communicated: to have us drink from the halved shell of an Indie nut. ,\n One of the kaan\u0027s men must have understood enough of the strange tongue to communicate. A great healing virtue was offered us; and with its consumption, we would be protected from the pestilence that struck here. But Heaven forgive us all for what it would cost, what it would make of us in the end.\"\n The story stopped there.\n Vigor sat back in frustration. \"There must be more.\"\n \"Hidden with the third and final key,\" Gray suggested.\n Vigor nodded and tapped the stretch of silk diary. \"But even from this much of the story, it is plain why this tale was never told.\"\n \"Why?\" Gray asked.\n \"The descriptions of the strange apparitions,\" Vigor stressed. \"Glowing with a \u0027Blessed light.\u0027 Offering salvation.\"\n \"Sounds like angels,\" Balthazar said.\n \"But pagan angels,\" Vigor stressed. \"Such a concept would not have gone down well with the Vatican during the Middle Ages. And remember, whoever split up Marco\u0027s story did so during the sixteen-hundreds, during another Italian plague outbreak. Despite the disturbing content, the Vatican dared not destroy the message. Some mystics within the Church must have divided the text to both preserve and hide it. But the bigger question remains: What is still left untold?\"\n \"If we\u0027re going to discover that,\" Gray said, \"we\u0027ll need to find that third key. But where do we begin to look? There\u0027s no angelic script anywhere.\"\n \"Maybe no angelic script that we could see with the naked eye,\" Vigor added pointedly.\n Gray nodded his understanding. He twisted around to his pack and began fishing through it. \"I brought a UV light. In case we ran into any more glowing obelisks.\"\n Balthazar dimmed the lights. Gray ran the UV over every artifact. Even the shard of broken clay brick.\n \"Nothing,\" he finally admitted.\n Dead end.\n 12:43 P.M.\n Gray\u0027s frustration had stretched to the tautness of a piano wire. He gave up any hope on his original plan, though it had been a long shot. \n","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-40.html","bookId":1529,"book":{"id":1529,"title":"The Judas Strain (Sigma Force #4)","description":"Storyline: \n The Judas Strain (Sigma Force #4) \n \"ju-das strain, n. A scientific term for an organism that drives an entire species to extinction\" \n A master at combining historical and scientific intrigue with cutting-edge adventure, \"New York Times\" bestselling author of \"Map of Bones\" and \"Black Order\" James Rollins returns with his most relentless, high-octane thriller to date--a terrifying story of an ancient menace reborn to plague the modern world . . . and of an impossible hope that lies hidden in the most shocking place imaginable: \"within the language of angels.\" \n From the depths of the Indian Ocean, a horrific plague has arisen to devastate humankind--a disease that\u0027s unknown, unstoppable . . . and deadly. But it is merely a harbinger of the doom that is to follow. \n Aboard a cruise liner transformed into a makeshift hospital, Dr. Lisa Cummings and Monk Kokkalis--operatives of the shadowy covert organization SIGMA Force--search for answers to the bizarre affliction that has inexplicably washed ashore. But there are others with far less altruistic intentions. In a savage and sudden coup, terrorists hijack the vessel, turning a mercy ship into a floating bio-weapons lab. \n At a Fourth of July celebration a world away, SIGMA\u0027s commander Gray Pierce thwarts the murderous schemes of a beautiful assassin--a would-be killer who holds the first clue to the discovery of a possible cure. With the fate of every man, woman, and child on Earth hanging in the balance, Pierce joins forces with the woman who wanted him dead, and together they embark upon an astonishing quest--one that winds through Venetian tombs, Byzantine cathedrals, and jungle-encrusted ruins--following the trail of the most fabled explorer in history: \"Marco Polo.\" \n But time is an enemy as a worldwide pandemic grows rapidly out of control. And as a relentless madman dogs their every step, Pierce and his unlikely ally are being pulled into an astonishing mystery buried deep in antiquity and in humanity\u0027s genetic code. And as the seconds tick closer to doomsday, Pierce will realize he can truly trust no one--not the bewitching enigma who runs at his side or even those who are closest to him--for any one of them could be . . . \"a Judas.\"\n \n","cover":"https://allnovel.net/images/the-judas-strain-sigma-force-4.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-judas-strain-sigma-force-4.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:36:08 PM"}}
