{"id":104824,"no":71,"title":"Page 71","content":"Gray sighed. \"The bas-relief we saw earlier. Of the Churning of the Milk. Every piece of the story was important. The snake, the frothing seas, the poison, the world threat, the glowing survivor. But one piece stood out as odd and unexplained. It didn\u0027t fit with the others.\" \"What\u0027s that?\" Nasser asked. Seichan saw it pained Gray to speak. Each word came out with a wincing reluctance. \"The turtle,\" Gray finally admitted. Vigor scratched at his chin. \"The turtle in the relief represents the god Vishnu, an incarnation of himself. In his turtle form, he supported Mount Meru as it was churned back and forth, to keep it from sinking.\" Gray nodded. \"On the bas-relief, the turtle was carved beneath the mountain. Why a turtle?\" He leaned and drew in the dust on the altar. He sketched a crude doodle of a mountain with a domed shell beneath it. He tapped the shell. \"What does this look like to you?\" Vigor leaned down. \"A cave. Buried beneath the roots of the mountain.\" Gray stared up the shaft of light. \"And the tower here represents that mountain.\" Seichan drew closer. \"You think there is a cavern beneath this tower. Beneath its buried foundations.\" He answered her, his eyes flicking to her briefly, then away. \"The only way to find out is to get down into the foundations—then search for some access to that cavern.\" Nasser scowled. \"But what can be so important about the cavern?\" \"It could be the source of the Judas Strain,\" Vigor said. \"Maybe when they were excavating the temple, they broke into that cavern, released something that lay buried down there.\" Gray sighed, tired. \"Many disease vectors have appeared in the world as mankind spread into regions normally unpopulated. Yellow fever, malaria, sleeping sickness. Even AIDS appeared when a road was being built through a remote region of Africa, exposing the world to a virus found only in a few monkeys. So perhaps when the Khmer cultivated and populated this region, something was released.\" Gray rubbed his neck. His eyes held a steady stare at Nasser. Too steady. Seichan sensed Gray was still holding something back. She studied again his stylized pictogram. The mountain and shell represented the tower and cave. So what else was here? Then she realized. The turtle itself. Of course . .. Her eyes rose to Gray\u0027s. He must have felt her attention. He turned to her, casually, but the weight of his gaze was heavy. He knew she had realized what he\u0027d left unspoken. He willed her to be quiet. She stepped back, folded her arms. He stared another breath—then away again. Seichan felt a measure of satisfaction. More than she had been expecting. Nasser breathed deeply through his nose, nodding. \"We must find a way down there.\" Gray frowned. \"I had hoped there would be some evidence of a secret passage.\" \"Doesn\u0027t matter,\" Nasser said. \"We\u0027ll blow the entrance.\" \"I\u0027m not sure that\u0027s wise,\" Vigor said, aghast. \"If this is the source of the Judas Strain, it may be horribly toxic down there.\" Nasser remained unperturbed. \"That\u0027s why I\u0027ll be sending you all down first.\" To be canaries in a coal mine. Seichan again matched gazes with Gray. He raised no objections. Like Seichan, he knew that there was something larger than just the source of the Judas Strain down there. The turtle\u0027s shell might represent the cavern—but the turtle itself represented the god Vishnu—suggesting more than just a cavern rested beneath the Bayon temple. Possibly something else waited for them down there, too. Gray stepped toward Nasser. \"Does that demonstrate enough cooperation to spare my mother for this hour?\" he asked, his voice tight. Nasser shrugged, agreeing. He moved to the shaft of light, seeking better reception for his cell phone. \"1 should perhaps hurry, then,\" Nasser said, flipping open his phone. \"It\u0027s already after the hour. Annishen has little patience. No telling what she might do.\" 9:20 p.m. Washington, D. C. Harriet remained frozen on the landing. The slathering dog leaped at Jack\u0027s sprawled form on the stairs. It was impossible to tell the breed in the dark stairwell, only that it was large and muscled. Pit bull. Rottweiler. Jack rolled to his back and kicked out—but the dog was faster, attack-trained. With a growling snarl, it bit deep into his ankle. Jack tugged at his knee and kicked out with his other leg, square in the dog\u0027s chest. The dog went flying down the stairs, bouncing hard, still latched on to her husband\u0027s prosthetic leg. Jack had unstrapped the limb, freeing himself. Harriet helped Jack up to the landing. Below, the dog struck the wall and scrambled back to its paws. It refused to let go of the prosthetic leg, ripe with her husband\u0027s scent. Angry, confused, it thrashed its head back and forth, tossing drool, shaking the captured limb. Harriet drew Jack up the next set of stairs, passing the closed landing door. She glanced through its small window. Flashlights continued to search the top floor. That left Harriet and Jack only one way to go. The roof. Down the stairs, the dog continued savaging the captured limb, triumphant with its prize. Jack leaned on her shoulder. He hopped and hauled his way to the roof door. They had already searched the exit and found it chained, but only loosely. At some point, someone had used a crowbar to bend back the lower corner of the steel door. There was just enough room to squirm under the loose chain and through the bend in the door. Once out into the night, Jack used an abandoned length of pipe to prop the door closed. It wouldn\u0027t hold long. But it didn\u0027t much matter. There were a half-dozen other roof access points. They couldn\u0027t block them all. \"This way,\" Jack said, and pointed. He had scouted the roof and discovered an old heating-and-air-conditioning unit, half gutted of equipment. There was enough room inside to hide two people. But neither held out much hope. The dogs would scent them out before too long. They crossed the roof to the unit, circled it to put its bulk between them and the door. Both sank to the tarpaper roof, remaining outside the HVAC unit for the moment. The stars shone above, along with a sliver of a moon. A plane passed by far overhead, winking lights. Jack put his arm around Harriet and drew her close to him. \"I love you,\" he said. It was a rare admission, seldom spoken aloud. Not that Harriet ever doubted it. Even now, he said the words matter-of-factly. Like saying the earth was round. So simple a truth. She leaned into him. \"I love you, too, Jack.\" Harriet clung to him. She didn\u0027t know how much time they had left. Eventually the search below would end. Annishen would turn her attention to the roof. They waited together in silence, having spent a lifetime together, sharing joy and heartbreak, tragedies and victories. Though not a word was spoken, they both knew what they were doing, fingers entwined. They were saying good-bye to each other. 17 Where Angela Fear to Tread July 7, 9:55 a.m. Angkor Thom, Cambodia Gray leaned against the brick wall of the cavelike cell. Beyond the narrow opening, a half-dozen men stood guard. The closest had their weapons in plain sight. Nasser had ordered them in here while he set about arranging for munitions to blow the altar stone. Gray checked the illuminated dial of his dive watch. They\u0027d been here almost an hour. He prayed Nasser was busy enough with his plans to skip his hourly threat against his parents. Something had certainly upset Nasser—beyond the delay in obtaining armaments. After sending them here, he had stormed off, phone to his ear. Gray had overheard the mention of a cruise ship. It had to concern the scientific leg of the Guild\u0027s operation. Painter had related the story of the hijacked ship and the unknown whereabouts of Monk and Lisa. Something had plainly gone wrong. But was that good news or bad regarding the fate of his friends? Gray shoved off the wall and paced the length of the cell. Seichan sat on a stone bench next to Vigor. Kowalski leaned near the opening. One of the guards had a rifle pointed at his stomach, but he ignored it. He spoke as Gray neared. \"I just saw some guy climb past with a jackhammer.\" \"They must be about ready,\" Vigor said, and stood up. \"What\u0027s taking so long?\" Gray asked. Seichan answered, still seated. \"Bribes take time.\" Gray glanced back to her. She explained, \"I heard some shouting in Khmer. Nasser\u0027s men are clearing the ruins of tourists, chasing them off. It seems the Guild has rented the Bayon for the remainder of this private party. It\u0027s a poor region. It wouldn\u0027t take much to get the local officials to look the other way.\" Gray had already guessed as much. The guards were no longer making any effort to hide their weapons. Vigor leaned a palm on a column near the door. \"Nasser must have convinced the Guild of the value in investigating the historical trail a bit longer.\" Gray suspected it was something more than that. He remembered the agitation concerning the cruise ship. If something had befallen the scientific trail, the value of the historical trail would be that much more important. He had confirmation a moment later. Nasser shoved through the guards. The earlier fury of his manner had died back down to his usual cold cunning. \"We\u0027re ready to proceed. But before we continue, it seems we\u0027ve crossed another hour mark.\" Gray\u0027s stomach muscles tightened. Vigor came to his defense. \"You\u0027ve locked us up all this time. Surely you can\u0027t expect us to have any further insight.\" Nasser cocked an eyebrow. \"That\u0027s not my concern. And Annishen grows impatient. She certainly needs something to entertain her.\" \"Please,\" Gray said. The word slipped out before he could stop it. Nasser\u0027s eyes sparked with amusement, allowing Gray to stew. \"Don\u0027t be an ass, Amen,\" Seichan said behind them. \"If you\u0027re going to do it, then do it.\"","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-71.html","bookId":1529,"book":{"id":1529,"title":"The Judas Strain (Sigma Force #4)","description":"Storyline: The Judas Strain (Sigma Force #4) \"ju-das strain, n. A scientific term for an organism that drives an entire species to extinction\" A master at combining historical and scientific intrigue with cutting-edge adventure, \"New York Times\" bestselling author of \"Map of Bones\" and \"Black Order\" James Rollins returns with his most relentless, high-octane thriller to date--a terrifying story of an ancient menace reborn to plague the modern world . . . and of an impossible hope that lies hidden in the most shocking place imaginable: \"within the language of angels.\" From the depths of the Indian Ocean, a horrific plague has arisen to devastate humankind--a disease that\u0027s unknown, unstoppable . . . and deadly. But it is merely a harbinger of the doom that is to follow. Aboard a cruise liner transformed into a makeshift hospital, Dr. Lisa Cummings and Monk Kokkalis--operatives of the shadowy covert organization SIGMA Force--search for answers to the bizarre affliction that has inexplicably washed ashore. But there are others with far less altruistic intentions. In a savage and sudden coup, terrorists hijack the vessel, turning a mercy ship into a floating bio-weapons lab. At a Fourth of July celebration a world away, SIGMA\u0027s commander Gray Pierce thwarts the murderous schemes of a beautiful assassin--a would-be killer who holds the first clue to the discovery of a possible cure. With the fate of every man, woman, and child on Earth hanging in the balance, Pierce joins forces with the woman who wanted him dead, and together they embark upon an astonishing quest--one that winds through Venetian tombs, Byzantine cathedrals, and jungle-encrusted ruins--following the trail of the most fabled explorer in history: \"Marco Polo.\" But time is an enemy as a worldwide pandemic grows rapidly out of control. And as a relentless madman dogs their every step, Pierce and his unlikely ally are being pulled into an astonishing mystery buried deep in antiquity and in humanity\u0027s genetic code. And as the seconds tick closer to doomsday, Pierce will realize he can truly trust no one--not the bewitching enigma who runs at his side or even those who are closest to him--for any one of them could be . . . \"a Judas.\"","cover":"https://allnovel.net/images/the-judas-strain-sigma-force-4.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-judas-strain-sigma-force-4.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:36:08 PM"}}
