{"id":104825,"no":73,"title":"Page 73","content":"\n While the seaplane had been circling near the shoreline a moment ago, it now headed away from the lake.\n \"Where are they going?\" Painter asked. He watched a few seconds more, getting a trajectory. He extended it with a finger. Their air path led in a beeline straight toward Angkor.\n What are they doing!\n Motion at the door drew Painter\u0027s eye. His aid, Brant, flew into the room, braking his wheelchair with a squeal of rubber on linoleum.\n \"Director Crowe, I tried to reach you,\" he gasped out. \"Couldn\u0027t. Figured you were still conferencing with Australia.\"\n Painter nodded. He had been.\n Brant grabbed a fax crumpled in his lap and held it out.\n Painter took it and scanned it once quickly, then a second time more carefully. Oh God. . .\n He headed to the door, bumping past Brant. He paused, turned. \"Kat?\" \"Go. I\u0027ve got it covered.\"\n He glanced back to the screen map of Cambodia, to the tiny blip edging toward the ruins of Angkor.\n Lisa, I hope you know what you\u0027re doing.\n He fled out of the room and ran for his office.\n For the moment, she was on her own.\n 10:25 A M Angkor\n \"Hang on!\" Ryder warned—though it sounded more like a war cry.\n Lisa clutched tight to the arms of her seat.\n Ahead, the giant beehive-shaped black towers of Angkor Wat rose into the sky. But the spectacular temple, sprawled over a square mile, was not their goal.\n Ryder dipped the Sea Dart toward the man-made stretch of green water off to one side. The moat of Angkor Wat. Unlike Angkor Thom, it still held water. Its entire length around the temple stretched four miles, leaving a mile of straight water on each side. The only problem—\n \"Bridge!\" Lisa yelled.\n \"Is that what you call it?\" Ryder commented sarcastically. He had a cigar clamped in his teeth. He blew a stream of smoke out the corner of his lips.\n It was his only cigar, kept stashed for emergencies like this. As Ryder had said before he lit up, \"even a condemned man is allowed one last smoke.\"\n The billionaire soared over the moat, shifting their flight path\u0027s elevation up and down a bit, just enough to clear the bridge.\n Lisa held her breath as they swept over. Tourists parted to either side.\n Then they were over, and Ryder dropped the Sea Dart fast, skimming the moat and trailing a plume of water. Then they settled deeper, still going fast as the plane became a boat. Their momentum propelled them toward the far corner, too fast to make the turn.\n The earthen embankment at the end swept toward them.\n Ryder pulled a crank in the floor. \"This is called a Hamilton Turn! Hold tight!\"\n With a puff of smoke, he yanked and twisted the wheel.\n The Sea Dart spun, as if on ice, throwing its back end fully around. The twin engines roared as its rear jets braked them. The craft slowed.\n Lisa cringed, still expecting to slam into the embankment.\n Instead, Ryder turned the wheel and slipped the boat sideways. The Sea Dart plowed a wave right to the edge of the sloped embankment and bumped to a gentle stop.\n Ryder sighed out a stream of smoke and cut the engines. \"Lord, that was bloody fun.\"\n Lisa immediately unbuckled and went to Susan.\n \"Hurry,\" Susan said, struggling.\n Lisa helped the woman undo her belt. Ryder followed and cranked the hatch open.\n \"You know what you need to do?\" Lisa asked him as they tumbled out into the shallow water and waded the few steps to the embankment.\n Already shouts arose all around.\n \"You told me sixteen times,\" Ryder said. \"Find a phone, call your director, let him know what you\u0027re doing, where you\u0027re going.\"\n They clambered up the slope to a road that crossed alongside the moat. Susan remained wrapped in the blanket, holding it clutched shut, wearing sunglasses, attempting to keep as much of the sun\u0027s power away from her.\n People pointed and called out.\n Ryder hailed a passing vehicle. It was nothing more than a motorcycle hauling a small roofed cart. Ryder held up a fistful of cash, the universal language for stop. The vehicle\u0027s driver was fluent in that language. He jerked his motorcycle around and swerved straight to them.\n Once it had stopped Ryder helped Lisa and Susan inside the rear cart and closed the tiny door. \"The tuk-tuk will take you straight to that temple. Be careful.\"\n \"Just reach Painter,\" Lisa said.\n He waved them off, like signaling the start of a race.\n Obeying, the motorcycle sped away, dragging them behind it.\n Lisa craned back. Already, uniformed police converged on Ryder, zipping up on their own motorcycles. Ryder waved his cigar, making a scene.\n No one paid attention to their little tuk-tuk.\n Lisa settled back.\n Beside her, Susan remained cocooned in her blanket. A single word flowed out. \"Hurry.\"\n 10:35 A.M.\n On his knees, Gray stared over the rim and down the circular stone shaft. Forty feet below, a face stared back up at him. Another of the stone bodhisattvas. It rose from the floor\u0027s surface, carved out of a single giant block of sandstone. The sunlight from the tower chimney shot a square shaft of light, sparkling with dust motes, down into the pit and bathed the dark stone face in warm sunlight.\n The enigmatic smile welcomed.\n To the side, a rolled-up caving ladder made of steel cable and aluminum rungs was dumped off the lip of the shattered altar. It unreeled with a rattle into the depths and struck the foundation floor. The upper end was bolted with carabiners to the stone roof of the sanctuary.\n Nasser walked over to Gray. \"You\u0027ll go down first. Followed by one of my men. We\u0027ll keep your friends up here for now.\"\n Gray wiped the powder from his hands and stood. He crossed to mount the ladder. Vigor stood against the wall, his face dour. Gray imagined the monsignor\u0027s dark countenance was not solely from their situation. As an archaeologist, Vigor had to find the desecration here professionally abhorrent.\n On Vigor\u0027s other side, Kowalski and Seichan simply awaited their fate.\n Gray nodded to the three of them and began the long climb down. Rather than dusty, the pit smelled dank. The first thirty feet was a narrow stone shaft about seven feet wide, lined by blocks, not unlike a large well. But in the last ten feet, the walls angled away, creating a barrel-shaped vault, forty feet across and perfectly circular.\n \"Stay in sight!\" Nasser called down.\n Gray glanced up at the ring of rifles pointed at him. One of the soldiers was already on the ladder heading down. Gray jumped to the floor, landing near the bodhisattva\u0027s stone face.\n He stared around. Four massive pillars studded the vault, equally spaced. Possibly load-bearing pylons for the tower above. Supporting this, the floor underfoot was not stone blocks. It was solid limestone. They\u0027d hit bedrock. Here was definitely the structural foundation for the Bayon.\n The clanking of the ladder drew his attention back up as the soldier approached. Gray considered jumping him and grabbing his rifle. But then what? His friends were still above; his parents were still under Nasser\u0027s fist. So instead, he stepped over to the carved face. He circled it. It was carved sandstone like all the others. It rested flat on its back, staring up, sculpted out of a single waist-high block.\n The face appeared no different from the others: same upturned corners of the lips, same wide nose and forehead, and those shadowed, brooding eyes.\n The guard dropped to the floor, landing hard on his boots.\n Gray straightened—then caught it out of the corner of his eye.\n He turned back, noting something odd about the face, about those brooding eyes. Dark circles lay in the center of each, like pupils. Even the sunlight could not dispel them.\n Gray had to lean atop the stone cheek to investigate. He reached a hand across and probed the dark pupil with a finger.\n \"What are you doing?\" Nasser called down.\n \"There are holes! Drilled into the eyes, where pupils should be. 1 think they may pass clean through the face.\"\n Gray searched up. Sunlight flowed down the tower\u0027s chimney, and with the altar removed, the beam struck the face hidden here.\n But did the light travel even deeper?\n He climbed higher onto the face, sprawling across it. He leaned his own eye to peer into the pupil of the stone god. Closing his other eye, he cupped around the sandstone eyeball. It took a moment for his vision to adjust.\n Far below, lit by the sunlight passing through the other pupil, he could see a shimmer of water. A pool at the bottom of a cavern. Gray could almost imagine the vaulted space, domed like the shell of a turtle.\n \"What do you see?\" Nasser called down.\n Gray rolled away, onto his back, staring up from the bottom of the well.\n \"It\u0027s here! The cavern! Under the stone face!\"\n Like the altar stone above, the bodhisattva guarded a hidden doorway.\n Gray remembered Vigor\u0027s explanation for the hundreds of stone faces. Some say they represent vigilance, faces staring out from a secret heart, guarding inner mysteries. But as Gray lay there, he also remembered another man\u0027s words, much older and more forbidding, from Marco\u0027s text, the very last line of his story.\n The words chilled through him.\n The gateway to Hell was opened in that city; but I know not if it was ever closed.\n Gray stared up at the shattered altar and knew the truth.\n It had been closed, Marco.\n But now they were opening it again.\n 10:36 A.M.\n The tuk-tuk stopped at the end of a paved road.\n Lisa climbed out.\n The way ahead was a jumbled stone plaza, half uprooted by giant trees. Beyond the plaza, the Bayon rose, framed in jungle, a jagged cluster of sandstone towers, covered with crumbling faces, etched with lichen, riddled with cracks.\n A few tourists gathered on the plaza, taking pictures. A pair of Japanese men approached their tuk-tuk, plainly wanting to commandeer their vehicle once Lisa and Susan had vacated it. One man bowed his head toward Lisa. He lifted an arm toward the temple and spoke in Japanese.\n Lisa shook her head, not understanding.\n He smiled shyly, bowed his head again, and struggled out one word of English. \"Closed.\"\n Closed?\n Lisa helped Susan out of the tuk-tuk, still wrapped head to toe in the blanket. Only a pair of sunglasses stared out. Lisa felt the tremble through the blanket as she supported Susan\u0027s elbow. \n","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-73.html","bookId":1529,"book":{"id":1529,"title":"The Judas Strain (Sigma Force #4)","description":"Storyline: \n The Judas Strain (Sigma Force #4) \n \"ju-das strain, n. A scientific term for an organism that drives an entire species to extinction\" \n A master at combining historical and scientific intrigue with cutting-edge adventure, \"New York Times\" bestselling author of \"Map of Bones\" and \"Black Order\" James Rollins returns with his most relentless, high-octane thriller to date--a terrifying story of an ancient menace reborn to plague the modern world . . . and of an impossible hope that lies hidden in the most shocking place imaginable: \"within the language of angels.\" \n From the depths of the Indian Ocean, a horrific plague has arisen to devastate humankind--a disease that\u0027s unknown, unstoppable . . . and deadly. But it is merely a harbinger of the doom that is to follow. \n Aboard a cruise liner transformed into a makeshift hospital, Dr. Lisa Cummings and Monk Kokkalis--operatives of the shadowy covert organization SIGMA Force--search for answers to the bizarre affliction that has inexplicably washed ashore. But there are others with far less altruistic intentions. In a savage and sudden coup, terrorists hijack the vessel, turning a mercy ship into a floating bio-weapons lab. \n At a Fourth of July celebration a world away, SIGMA\u0027s commander Gray Pierce thwarts the murderous schemes of a beautiful assassin--a would-be killer who holds the first clue to the discovery of a possible cure. With the fate of every man, woman, and child on Earth hanging in the balance, Pierce joins forces with the woman who wanted him dead, and together they embark upon an astonishing quest--one that winds through Venetian tombs, Byzantine cathedrals, and jungle-encrusted ruins--following the trail of the most fabled explorer in history: \"Marco Polo.\" \n But time is an enemy as a worldwide pandemic grows rapidly out of control. And as a relentless madman dogs their every step, Pierce and his unlikely ally are being pulled into an astonishing mystery buried deep in antiquity and in humanity\u0027s genetic code. And as the seconds tick closer to doomsday, Pierce will realize he can truly trust no one--not the bewitching enigma who runs at his side or even those who are closest to him--for any one of them could be . . . \"a Judas.\"\n \n","cover":"https://allnovel.net/images/the-judas-strain-sigma-force-4.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-judas-strain-sigma-force-4.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:36:08 PM"}}
