{"id":32013,"no":21,"title":"Chapter 2","content":"Tells of my visit with the Gray Meteor and of how I entertained him and of his call upon me. You will believe that I lost no time in quizzing my host about this mysterious “gray meteor.” “Ach,” said he, “some deserter. Geneva and Locle are full uff them.” “Geneva and Locle are near the border,” I said, “and all they have to do is to take a hop, skip and a jump to get there. There are some from over the Rhine, too,” I added, for I did not relish his implication that all deserters were from France. “Well, diss one is American, anyway,” he said. “And how about his German coat?” I asked; “how do you know he is American?” “He iss crazy, dat is why,” he laughed. “He must be alwavss camping out. Don’t you worry about him.” “He is not crazy,” I retorted, a bit nettled, “but I will tell you what is the matter with him——” “Sure, he iss lazy.” “He is suffering from shell shock or something of that sort,” I said, ignoring his remark. “And what I should like to know is, how did he find his way up here in such a state. Besides,” I added, “he should have care and companionship. He is in no condition to be living in that hole of a cave. Do you know anything about him?” “He come apout a mont’ ago—nobody knows how. I ask him een, put he will haff nudding. The childrens, dey call him de gray meteor. Maybe he come from Mars—what?” I soon found that if this poor, strayed soul had ever been a sensation he had long since ceased to be one. The children still found him a source of entertainment, made fun of him, and I am afraid, annoyed him. Otherwise he lived in his cave, shunned the village and all other haunts of men. I understood that he lived chiefly on fish which he caught, but sometimes the children left food near his solitary retreat. As to his being a deserter, that may very well have been the case, I thought, but deserter or not, he was suffering from shell shock if I knew anything about the manifestations of that dreadful thing. How he had penetrated so far to this obscure retreat I could not conjecture, for though not far distant in miles from the border, the spot was unfrequented and almost inaccessible. Nor was such remoteness necessary. In Basel, or any of the places along the western frontier, he would have been as safe from molestation as at the North Pole. First and last, his presence there puzzled and interested me, and his condition aroused my sympathy. All the next day my thoughts dwelt upon his gaunt appearance and frightened look and on that vacillating timidity and uncertainty of action which bespoke a crippled power of will. There was no mistaking those signs; I had seen them before. The morning following I dug into my grip and picking out several of the bully old pals which I had brought with me, sallied forth to the retreat of the “gray meteor.” From what Herr Twann had said I surmised that he spoke English and finding him kneeling by the ashes of his fire, in about the same position as when I had left him the day before, I said cheerily: “Good morning—fine Alpine weather.” The look he gave me pierced me to the heart. I felt that he would either run away or crawl to me like a guilty dog in grovelling shame. He breathed heavily and his eyes were lit with an anguish of terror. He started to rise but apparently had not the strength of will to lift himself and as he crouched there a twig broke under his feet and he started as if a cannon had been shot off close by. “I think you’ve been trying to get a fire,” said I pleasantly, “by rubbing those two sticks together. Am I right?” He only looked at me and smiled uncertainly. “That’s a pretty hard stunt,” I continued. “Suppose we start it with a match this time and tomorrow I’ll hunt this business up. I’ve a book that tells about those things. You and I will run through it together.” I lighted the little parcel of twigs which he had gathered and after watching the flame a few moments he said, “More?” and seemed irresolute whether to bring more twigs or not. “A few more, then a couple of big pieces, and we’ll be all hunk,” I said. The fire well started, we sat down beside it. “It’s hot, isn’t it?” he asked nervously. “Quite hot,” said I. Then he gulped as if it had been an effort for him to say that much. “You were right the first time,” I added, which seemed to afford him a kind of childish pleasure. “Now,” said I, “if you think I’m a soldier because I have on this khaki suit, you’re mistaken. I’m a fellow that writes stories and things, and I like to camp just as you do. I think you and I are very much alike. Will you tell me your name?” He shook his head, smiling weakly. It seemed to me that he had no objection to telling me, but that he just lacked the stamina to do it. I therefore began to speak of something else and after a moment he said: “Tasso.” “Is that your name?” He nodded as if he had done a great thing in telling me. Then a slight movement of my arm startled him and he jumped and trembled. “Are you Italian?” I said; “is that your first name or your last name?” “Both,” he said. “Well,” said I, “you and I are going to be friends, anyway. And I’ve brought along another friend, too. He’s in a book named Kidnapped. He went on a long hike and lived in caves just like you. He made a long trip through mountains with a companion and at last got to Edinburgh.” He looked at me for a moment in a puzzled way and then asked hesitatingly, “Did he get there in the night?” “Indeed, I don’t remember,” I said, “but we shall find out.” Suddenly he began to cry like a baby and it was pitiful to see him. While he was crying I began to read those wonderful adventures of David Balfour and he soon seemed to listen. But with every stir he would start like a frightened animal and he had a way of twisting and pulling the cord around his neck which was heartrending to see, so weak and aimless was it. But he was attentive and evidently interested. Thus began my acquaintance with that forlorn derelict of the great war, and my simple program for helping him seemed to have begun auspiciously. Each day I visited him and read to him and though he said little, and that to no purpose, he seemed interested and would listen silently hour after hour, starting at the merest sound or movement, and twirling and twisting the cord on which hung his rusty, broken compass. On the evening of the fourth or fifth day I saw him coming up the mountain path toward the little inn. He paused trembling at the edge of our little arbor and breathed as if he were very weary. I rose slowly, being particular to make no noise or sudden movement, and greeted him as if he had been coming each day. He stood uncertainly, intertwining his fingers, and seemed on the point of retreating. But he had come, and that was a great step in advance. “I think it is my front name,” he said, as if that were the purpose of his call. “Oh, yes,” said I. “Tasso. So now I’ll call you Tasso.” “If it thunders will you come and stay with me?” he asked. “Indeed I will,” said I, “but it’s not going to thunder and tomorrow you and I are going to take a hike together.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3271/89510.html","bookId":514,"book":{"id":514,"title":"Tom Slade with the Flying Corps","description":"简介： Tells briefly of the extraordinary episode which ended his service in the Flying Corps, and gives also a glimpse of his adventurous career.The reports in the American newspapers of the loss of Tom Slade, aviator, were read by his many admirers and fr...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3271","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
