{"id":108230,"no":10,"title":"Page 10","content":"TEN\n I rattled around restlessly in the \"new\" house for a few hours. It was mine, all mine, but somehow I didn\u0027t feel too cheerful about that anymore. Actually, I preferred my town house, a soulless rental. It had more room, I was used to it, I like having an upstairs I didn\u0027t have to clean if company was coming. Could I stand living across the street from Arthur and Lynn? Next door to the unpredictable Marcia Rideout? Jane\u0027s books were already cramming the bookcases. Where would I put mine? But if I sold this house and bought a bigger one, probably the yard would be bigger, and I haven\u0027t ever taken care of one... If Torrance hadn\u0027t mowed the yard for me, I wouldn\u0027t know how to cope. Maybe the yard crew that did the lawn at the town houses? I maundered on in my head, opening the kitchen cabinets and shutting them, trying to decide which pots and pans were duplicates of mine so I could take them to the local Baptist church, which kept a room of household goods for families who got burned out or suffered some equal disaster. I finally chose some in a lackadaisical way and carried them out to the car loose; I was out of boxes. I was treading water emotionally, unable to settle on any one task or course of action.\n I wanted to quit my job.\n I was scared to. Jane\u0027s money seemed too good to be true. Somehow, I feared it might be taken away from me.\n I wanted to throw the skull in the lake. I was also scared of whoever had reduced the skull to its present state.\n I wanted to sell Jane\u0027s house because I didn\u0027t particularly care for it. I wanted to live in it because it was safely mine. I wanted Aubrey Scott to adore me; surely a minister would have a specially beautiful wedding? I did not want to marry Aubrey Scott because being a minister\u0027s wife took a lot more internal fortitude than I had. A proper minister\u0027s wife would have marched out of the house with that skull and gone straight to the police station without a second thought. But Aubrey seemed too serious a man to date without the prospect of the relationship evolving in that direction.\n I did run the pots and pans to the Baptist church, where I was thanked so earnestly that it was soothing, and made me think better of my poor character. On the way back to the new house, I stopped at Jane\u0027s bank on impulse. I had the key with me, surely? Yes, here it was in my purse. I went in hesitantly, suddenly thinking that the bank might present difficulties about letting me see the safe deposit box. But it wasn\u0027t too difficult. I had to explain to three people, but then one of them remembered Bubba Sewell coming by, and that made everything all right. Accompanied by a woman in a sober business suit, I got Jane\u0027s safe deposit box. Something about those vaults where they\u0027re kept makes me feel that there\u0027s going to be a dreadful secret inside. All those locked boxes, the heavy door, the attendant! I went into the little room that held only a table and a single chair, shut the door. Then I opened the box, telling myself firmly that nothing dreadful could be in a box so small. Nothing dreadful, but a good deal that was beautiful. When I saw the contents of the long metal box, I let my breath out in a single sigh. Who would ever have imagined that Jane would want these things?\n There was a pin shaped like a bow, made out of garnets with the center knot done in diamonds. There were garnet and diamond earrings to match. There was a slim gold chain with a single emerald on it, and a pearl necklace and bracelet. There were a few rings, none of them spectacular or probably extremely valuable, but all of them expensive and very pretty. I felt I had opened the treasure chest in the pirate\u0027s cave. And these were mine now! I could not attach any sentiment to them, because I\u0027d never seen Jane wear them - perhaps the pearls, yes; she\u0027d worn the pearls to a wedding we\u0027d both attended. Nothing else rang any bells. I tried on the rings. They were only a little loose. Jane and I both had small fingers. I was trying to imagine what I could wear the bow pin and earrings to; they\u0027d look great on a winter white suit, I decided. But as I held the pieces and touched them, I knew that despite Bubba Sewell\u0027s saying there was nothing else in the safe deposit box, I was disappointed that there was no letter from Jane. After I\u0027d driven back to the house, despite an hour spent watching Madeleine and her kittens, I still could not ground myself. I ended up throwing myself on the couch and turning on CNN, while reading some of my favorite passages from Jane\u0027s copy of Donald Rumbelow\u0027s book on Jack the Ripper. She had marked her place with a slip of paper, and for a moment my heart pounded, thinking Jane had left me another message, something more explicit than I didn\u0027t do it. But it was only an old grocery list: eggs, nutmeg, tomatoes, butter... I sat up on the couch. Just because this piece of paper had been a false alarm didn\u0027t mean there weren\u0027t any other notes! Jane would put them where she would think I\u0027d find them. She had known no one but me would go through her books. The first one had been in a book about Madeleine Smith, Jane\u0027s main field of study. I riffled through Jane\u0027s other books about the Smith case. I shook them. Nothing.\n Then maybe she\u0027d hidden something in one of the books about the case that most intrigued me - well, which one would that be? Either Jack the Ripper or the murder of Julia Wallace. I was already reading Jane\u0027s only Ripper book. I flipped through it but found no other notes. Jane also had only one book on Julia Wallace, and there again I found no message. Theodore Durrant, Thompson-Bywater, Sam Sheppard, Reginald Christie, Crippen...! shook Jane\u0027s entire true-crime library with no results.\n I went through her fictional crime, heavy on women writers; Margery Allingham, Mary Roberts Rinehart, Agatha Christie... the older school of mysteries. And Jane had an unexpected shelf of sword-and-sorcery science fiction, too. I didn\u0027t bother with those, at least initially; Jane would not have expected me to look there.\n But in the end I went through those as well. After two hours, I had shaken, riffled, and otherwise disturbed every volume on the shelves, only a trace of common sense preventing me from flinging them on the floor as I finished. I\u0027d even read all the envelopes in the letter rack on the kitchen wall, the kind you buy at a handcraft fair; all the letters seemed to be from charities or old friends, and I stuffed them irritably back in the rack to go through at a later date.\n Jane had left me no other messages. I had the money, the house, the cat (plus kittens), the skull, and the note that said I didn\u0027t do it. A peremptory knock on the front door made me jump. I\u0027d been sitting on the floor so lost in the doldrums I hadn\u0027t heard anyone approach. I scrambled up and looked through the peephole, then flung the door open. The woman outside was as well-groomed as Marcia Rideout, as cool as a cucumber; she was not sweating in the heat. She was five inches taller than me. She looked like Lauren Bacall. \"Mother!\" I said happily, and gave her a brief hug. She undoubtedly loved me, but she didn\u0027t like her clothes wrinkled.\n \"Aurora,\" she murmured, and gave my hair a stroke.\n \"When did you get back? Come in!\"\n \"I got in really late last night,\" she explained, coming into the room and staring around her. \"I tried to call you this morning after we got up, but you weren\u0027t home. You weren\u0027t at the library. So after a while, I decided I\u0027d phone in to the office, and Eileen told me about the house. Who is this woman who left you the house?\"\n \"How\u0027s John?\"\n \"No, don\u0027t put me off. You know I\u0027ll tell you all about the trip later.\"\n \"Jane Engle. John knows - John knew her, too. She was in Real Murders with us.\" \"At least that\u0027s disbanded now,\" Mother said with some relief. It would have been hard for Mother to send John off to a monthly meeting of a club she considered only just on the good side of obscenity. \"Yes. Well, Jane and I were friends through the club, and she never married, so when she died, she left me - her estate.\"\n \"Her estate,\" my mother repeated. Her voice was beginning to get a decided edge.\n \"And just what, if you don\u0027t mind my asking, does that estate consist of ?\" I could tell her or I could stonewall her. If I didn\u0027t tell her, she\u0027d just pull strings until she found out, and she had a bunch of strings to pull. \"This Jane Engle was the daughter of Mrs. John Elgar Engle,\" I said. \"The Mrs. Engle who lived in that gorgeous mansion on Ridgemont? The one that sold for eight hundred and fifty thousand because it needed renovation?\" Trust Mother to know her real estate.\n \"Yes, Jane was the daughter of that Mrs. Engle.\"\n \"There was a son, wasn\u0027t there?\"\n \"Yes, but he died.\"\n \"That was only ten or fifteen years ago. She couldn\u0027t have spent all that money, living here.\" Mother had sized up the house instantly. \"I think this house was almost paid for when old Mrs. Engle died,\" I said.\n \"So you got this house,\" Mother said, \"and...?\" \"And five hundred and fifty thousand dollars,\" I said baldly. \"Thereabouts. And some jewelry.\"\n Mother\u0027s mouth dropped open. It was the first time in my life I think I\u0027d ever astonished my mother. She\u0027s not a money-grubbing person, but she has a great respect for cash and property, and it is the way she measures her own success as a professional. She sat down rather abruptly on the couch and automatically crossed her elegant legs in their designer sportswear. She will go so far as to wear slacks on vacation, to pool parties, and on days she doesn\u0027t work; she would rather be mugged than wear shorts.\n \"And of course I now have the cat and her kittens,\" I continued maliciously.\n \"The cat,\" Mother repeated in a dazed way.\n Just then the feline in question made her appearance, followed by a chorus of forlorn mews from the kittens in Jane\u0027s closet. Mother uncrossed her legs and leaned forward to look at Madeleine as if she had never seen a cat before. Madeleine walked right up to Mother\u0027s feet, stared up at her for a moment, then leaped onto the couch in one flowing motion and curled up on Mother\u0027s lap. Mother was so horrified she didn\u0027t move.\n \"This,\" she said, \"is a cat you inherited?\"\n I explained about Parnell Engle, and Madeleine\u0027s odyssey to have her kittens in \"her\" house.\n Mother neither touched Madeleine nor heaved her legs to remove her.\n \"What breed is she?\" Mother asked stiffly.\n \"She\u0027s a mutt cat,\" I said, surprised. Then I realized Mother was evaluating the cat. Or valuing her. \"Want me to move her?\"\n \"Please,\" my mother said, still in that stiff voice. Finally I understood. My mother was scared of the cat. In fact, she was terrified. But, being Mother, she would never admit it. That was why we\u0027d never had cats when I was growing up. All her arguments about animal hair on everything, having to empty a litter tray, were just so much smoke screen. \"Are you scared of dogs, too?\" I asked, fascinated. I carefully scooped Madeleine off Mother\u0027s lap, and scratched her behind the ears as I held her. She obviously preferred Mother\u0027s lap, but put up with me a few seconds, then indicated she wanted down. She padded into the kitchen to use her litter box, followed by Mother\u0027s horrified gaze. I pushed my glasses up on my nose so I could have a clear view of this unprecedented sight. \"Yes,\" Mother admitted. Then she took her eyes off Madeleine and saw my face. Her guard snapped up immediately. \"I\u0027ve just never cared for pets. For God\u0027s sake, go get yourself some contact lenses so you\u0027ll stop fiddling with those glasses,\" she said very firmly. \"So. Now you have a lot of money?\" \"Yes,\" I admitted, still enthralled by my new knowledge of my mother.\n \"What are you going to do?\"\n \"I don\u0027t know. I haven\u0027t made any plans yet. Of course, the estate has to go through probate, but that shouldn\u0027t take too long, Bubba Sewell says.\" \"He\u0027s the lawyer who\u0027s handling the estate?\"\n \"Yes, he\u0027s the executor.\"\n \"He\u0027s sharp.\"\n \"Yes, I know.\"\n \"He\u0027s ambitious.\"\n \"He\u0027s running for office.\"\n \"Then he\u0027ll do everything right. Running for office has become just like running under a microscope.\"\n \"He asked me out, but I turned him down.\"\n \"Good idea,\" my mother said, to my surprise. \"It\u0027s never wise to have a social relationship mixed up with money transactions or financial arrangements.\" I wondered what she would say about a social relationship mixed up with religion.\n \"So you had a good time?\" I asked.\n \"Yes, we did. But John came down with something like the flu, so we had to come home. He\u0027s over the worst, and I expect he\u0027ll be out and about tomorrow.\" \"He didn\u0027t want to stay there until he got over it?\" I couldn\u0027t imagine traveling with the flu.\n \"I suggested it, but he said when he was sick, he didn\u0027t want to be in a resort where everyone else was having fun, he wanted to be home in his own bed. He was quite stubborn about it. But, up until that time, we really had a great honeymoon.\" Mother\u0027s face looked almost soft as she said that, and it was borne in on me for the first time that my mother was in love, maybe not in as gooey a way as Amina, but she was definitely feeling the big rush. It occurred to me that John had come back to Lawrenceton and gotten in Mother\u0027s bed, not his own. \"Has John sold his house yet?\" I asked. \"One of his sons wanted it,\" Mother said in as noncommittal a voice as she could manage. \"Avery, the one that\u0027s expecting the baby. It\u0027s a big old house, as you know.\"\n \"How did John David feel about that? Not that it\u0027s any of my business.\" John David was John\u0027s second son.\n \"I wouldn\u0027t have presumed to advise John about his family business,\" Mother began answering indirectly, \"because John and I signed a prenuptial agreement about our financial affairs.\"\n This was news to me, and I felt a distinct wave of relief. I\u0027d never considered it before, but all the complications that could arise when both parties had grown children suddenly occurred to me. I\u0027d only thought of what Mother might leave when she died, this very day. I should have known, as property conscious as she was, she would have taken care of everything. \"So I didn\u0027t advise him,\" Mother was continuing, \"but he thought out loud when he was trying to figure out what was fair to do.\" \"You\u0027re the obvious person for input when it comes to real estate questions.\"\n \"Well, he did ask me the value of the house on the current market.\"\n \"And?\".\n \"I had it appraised, and I think - now I don\u0027t know, but I think - he gave John David the cash value of the house, and deeded over the house to Avery.\" \"So John David didn\u0027t want the house at all?\"\n \"No, his work requires that he transfer every few years, and it didn\u0027t make sense for him to own a house in Lawrenceton.\"\n \"That worked out well.\"\n \"Now I\u0027m going to tell you what I did about my house.\"\n \"Oh, Mom!\" I protested.\n \"No,\" she said firmly. \"You need to know this.\"\n \"Okay,\" I said reluctantly.\n \"I think a man needs to know he has a home that\u0027s his,\" she said. \"And since John gave up his house, I have left him mine for his lifetime. So if I die before John, he gets to stay in the house until he dies. I thought that was only right. But, after John passes away, it\u0027s yours to do with as you will, of course.\"\n This was just my season for having things willed to me. Suddenly I realized that Mother would leave me her business and her money, as well as the house; with Jane\u0027s money, and her little house, too, I need never work another day in my life.\n What a startling prospect.\n \"Whatever you do is fine with me,\" I said hastily, aware that Mother was looking at me in a funny way. \"I don\u0027t want to talk about it.\" \"We\u0027ll have to sometime,\" Mother warned.\n What was with her today? Had getting remarried somehow awakened or reinforced her feelings of her own mortality? Was it signing the prenuptial agreement with all these arrangements for what would happen after her death? She was just back from her honeymoon. She should be feeling pretty frisky. \"Why are you talking about all this now?\" I asked bluntly. She considered this. \"I don\u0027t know,\" she said in a puzzled way. \"I certainly didn\u0027t come here expecting to talk about it. I was going to tell you about the hotel and the beach and the tour we took, but somehow I got sidetracked. Maybe when we talked about what Jane Engle left you, I started thinking about what I was going to leave you. Though, of course, now you won\u0027t need it as badly. It does seem strange to me that Jane left all her money and property to someone who isn\u0027t even a member of the family, someone who wasn\u0027t even that close a friend.\" \"It seems strange to me, too, Mom,\" I admitted. I didn\u0027t want to tell my mother that Jane had left everything to me because she saw me starting out like her, single and bookish, and maybe Jane had seen something else in me that struck a chord with her; we were both fascinated by death between the pages of a book. \"And it\u0027s going to seem strange to a lot of other people.\" She thought about that for a little. She waited delicately to see if I would enlighten her about Jane\u0027s motives.\n \"I\u0027m glad for you,\" Mother said after a minute, seeing I wasn\u0027t going to offer any more information about my relationship with Jane. \"And I don\u0027t expect we have to worry about what people say.\"\n \"Thanks.\"\n \"I\u0027d better get back to my sick husband,\" Mother said fondly. How strange it was to hear that. I smiled at her without thinking about it. \"I\u0027m glad for you, too,\" I told her honestly.\n \"I know that.\" She gathered her purse and keys, and I rose to walk her to her car.\n She was discussing a dinner party an old friend was planning to give for her and John, and I was wondering if I should ask to bring Aubrey, when Marcia Rideout came out of her front door. She was wearing another matched and beautifully ironed shorts set, and her hair was a little blonder, it seemed to me. \"Is that your momma I see with you?\" she called when she was halfway down her drive. \"Do you just have a minute?\"\n We both waited with polite, expectant smiles.\n \"Aida, you may not remember me,\" Marcia said, with her head tilted coyly to one side, \"but you and I were on the Fallfest committee together a couple of years ago.\"\n \"Oh, of course,\" Mother said, professional warmth in her voice. \"The festival turned out very well that year, didn\u0027t it?\"\n \"Yes, but it was sure a lot of work, more than I ever bargained for! Listen, we\u0027re all just so thrilled Roe is moving on our street. I don\u0027t know if she told you yet or not, I understand you\u0027ve been away on your honeymoon, but Torrance and I are giving Aurora and our other new neighbors\" - and Marcia nodded her smooth head at the little yellow-shuttered house across the street - \"a little get-together tomorrow night. We would just love it if you and your new husband could come.\"\n Nothing nonpluses Mother. \"We\u0027d love to, but I\u0027m afraid John came back from the Bahamas with just a touch of flu,\" she explained. \"I tell you what, I may just drop in by myself for a few minutes, just to meet Aurora\u0027s new neighbors. If my husband is feeling better, maybe he\u0027ll come, too. Can I leave it that indefinite?\"\n \"Oh, of course, that poor man, the flu in this pretty weather! And on his honeymoon! Bless his heart!\"\n \"Who are the other new people on the street?\" Mother inquired, to stem Marcia\u0027s pity.\n \"A police detective and his brand-new wife, who is also a police detective! And she\u0027s going to have a baby just any time now. Isn\u0027t that exciting? I don\u0027t think I\u0027d ever met a real detective until they moved in, and now we have two of them on the street. We should all be real safe now! We\u0027ve had a lot of break-ins on this street the past few years - but I\u0027m sure your daughter is as safe as can be, now,\" Marcia tacked on hastily.\n \"Would that detective be Arthur Smith?\" Mother asked. I heard the permafrost under her words. I could feel my face begin to tighten. I had never known how much Mother knew or guessed about my relationship with Arthur, but I had a feeling she\u0027d gotten a pretty accurate picture. I turned my face away a little under pretext of pushing up my glasses.\n \"Yes. He\u0027s such a solemn young man, and handsome, too. Of course, not as handsome as the man Roe is dating.\" Marcia actually winked. \"You don\u0027t think so?\" my mother said agreeably. I bit my upper lip. \"Oh, no. That minister is so tall and dark. You can tell from my marrying Torrance, I like tall, dark men. And that mustache! It may not be nice to say this about a man in the ministry, but it\u0027s just plain sexy.\" My mother had been totting up this description. \"Well, I\u0027ll sure try to come, thanks so much for inviting me,\" she said in a perfectly polite but unmistakably conclusive way.\n \"I\u0027ll just go back to cleaning the house,\" Marcia said brightly, and, after a chorus of good-byes, off she trotted.\n \"Dating Father Scott?\" Mother asked when she was sure Marcia was out of earshot.\n \"And you\u0027re over that lousy policeman?\"\n \"Yes to both.\"\n Mother looked quite unsettled for a minute. \"You turned down a date with Bubba Sewell, you\u0027re over that Arthur Smith, and you\u0027re dating a minister,\" she said wonderingly. \"There\u0027s hope for your love life after all.\" As I waved to her as she drove down the street, it was a positive satisfaction for me to think of the skull in her blanket bag. \n","sourceLink":"https://allnovel.net/a-bone-to-pick-aurora-teagarden-2/page-10.html","bookId":2237,"book":{"id":2237,"title":"A Bone to Pick (Aurora Teagarden #2)","description":"Storyline: \n A Bone to Pick (Aurora Teagarden Mysteries #2) \n Having inherited a large estate from a member of the now defunct A Bone to Pick Club, Aurora \"Roe\" Teagarden, the 4\u002711\" librarian, is mystified by a mere acquaintance\u0027s gift of money, jewelry, and a two bedroom house with a skull in the window seat. Did the old lady kill someone and leave Roe to solve the mystery or was she being framed? Roe must figure it all out before her cheating ex-boyfriend Arthur, the police detective, and her new love interest Aubrey, the episcopal priest, figure out what she\u0027s up too.\n \n","cover":"https://allnovel.net/images/a-bone-to-pick-aurora-teagarden-2.jpg","author":"Charlaine Harris","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-bone-to-pick-aurora-teagarden-2.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 11:17:24 PM"}}
