{"id":85372,"no":12,"title":"Page 12","content":"18 Tyranny stood, smoothed her dress down, ran a hand through her hair. She wouldn\u0027t look at Conner. \"Do you love Dan?\" Conner asked. Tyranny sighed. \"I\u0027m not prepared to talk about this.\" Something had changed. She was different. He could hear it in her voice, see it in her posture. Conner said, \"Leave him and be with me.\" \"Look, it\u0027s all very-\" \"Complicated. You told me that already.\" \"I have to go,\" she said. \"I\u0027d appreciate it if you\u0027d wait two minutes before following me back to the house.\" She looked at her watch. \"Shit. Dan wanted to introduce me to Jasper. There\u0027s an internship available at MoMA this season, and Jasper might be able to put in a good word.\" She saw the look on Conner\u0027s face, touched his cheek, and smiled wistfully. \"Try to enjoy yourself. Get something to eat. We\u0027ll talk about this later.\" And she was gone. Conner knew they would not talk about it later. They\u0027d never talk about it. He realized what he\u0027d always secretly known on some level. Things would stay the same. She would not leave her luxurious, beautiful life with Professor Dan. Conner had been fucked, and that was all. He pulled up his pants, left the pool house. The smokers had gone inside. Out of spite, Conner picked up a heavy potted plant and heaved it into the deep end of the pool, his ribs protesting only a little. The pot splashed big, plunged to the bottom, and landed with a ceramic tunk. He felt a vague, juvenile satisfaction, which faded by the time he was back in the house. Tyranny reinserted herself into the swirling party, returned pleasantries without thought, avoided being drawn into lengthy small talk. Her head buzzed, couldn\u0027t form cold, logical thoughts. She felt sick at her stomach. So stupid stupid stupid. It had seemed so right, a perfect little romantic moment. Moments, however, never stay moments. They never stay preserved, like a picture-perfect scene in a snow globe. The fantasy leaks out, seeps into reality, spoils everything. She found her husband. \"I\u0027ve been looking for you,\" Professor Dan said. \"We\u0027re starting the buffet, and I need you to-what is it? Are you okay?\" \"Yes.\" Her mind raced. She knew Conner so well; poor Conner, he would never forgive this. He surely thought this was the beginning of something beautiful. His expectations were so pure and final. Tyranny was complex, a churning cauldron of thoughts and emotions and conflicting desires, and Conner would simply never understand that Tyranny could not be tied down to Conner\u0027s idea of love. It was impossible, all simply broken and ruined and impossible. \"You\u0027re crying.\" Dan took her arm, pulled her aside, and looked over his shoulder to see if any of the partygoers had noticed. \"I\u0027m not crying. Don\u0027t be ridiculous. I\u0027ll be back in a minute.\" \"I need you down here,\" Dan said. \"Just a few minutes.\" She avoided meeting anyone\u0027s eye, went upstairs to her room, closed the door, locked it. She picked up the phone and hit Dr. Goldblatt\u0027s home number on speed-dial. The doctor answered. She told him what happened. \"Do you love this man?\" \"I\u0027m not even sure what love is anymore.\" \"Some say love is merely a set of electrical impulses formed by our brain after receiving specific external stimuli. All of that romantic nonsense was invented by poets.\" \"I hate you, Dr. Goldblatt.\" \"My wife often expresses a similar sentiment.\" 19 The reception had shifted to the long dining hall, where food was being served buffet style. It was too crowded. Conner backed out, intercepted a waiter on his way in with a trayful of champagne, and snagged two more glasses. He gulped them down. Burped. It was still too crowded to get at the buffet. He thought he spotted some roast beef, little red potatoes, good stuff, but there were fifty tuxedos in the way. A side table offered a spread of tortilla chips with salsa and pigs in a blanket. He plucked a white cloth napkin from the table, filled it with pigs in a blanket and wrapped it up. He put the napkin wad into the side pocket of his tuxedo. It made a nice warm weight against his hip. The room was too crowded and loud. He didn\u0027t see Tyranny anywhere and didn\u0027t look too hard. He retreated to the quiet part of the house. Stray partygoers huddled in twos and threes, private conversations. Conner wanted to be alone. He pushed on deeper into the house, found a room that looked like a small library or maybe a big study. A giant globe on a highly polished wooden stand. Oaken desk. Shelves lined with books. French doors with a view of the bay. This must be Professor Dan\u0027s office. On the corner of the desk a silver tray supported a glass decanter half-full of amber liquid. Four clean highball glasses around the decanter. Conner took the lid off the decanter, set it to the side, filled one of the highball glasses to the top. \"I wouldn\u0027t do that.\" A voice behind him. Conner started, turned. A pear-shaped man, short. Thinning blond hair. He wore thick, round glasses that made him look like an owl, a tuxedo with a vest instead of a cummerbund. He stepped into the study, closed the door behind him. \"That\u0027s the cheap stuff,\" he said. He went to the big globe and opened it up. It was hinged at the equator. Inside were more bottles and glasses. \"Johnnie Walker Black.\" He poured himself a tall one, then offered the bottle to Conner. Conner took a fresh highball glass, held it out, and the guy filled it for him. He quickly drank half, smacked his lips. The guy asked, \"You\u0027re not a goddamn art lover, are you?\" \"No.\" He smiled, took off his glasses, and rubbed his eyes. \"Good. I\u0027ve been to a hundred of these things. They\u0027re all the same. If I hear another son of a bitch go on about brushstrokes, I\u0027ll stick a gun in my mouth and blow my fucking brains out.\" He sipped his drink, put his glasses back on. \"Uh-huh.\" Conner emptied the highball glass, held it out for more. Pear-shaped Guy filled it again. \"Did you ever notice how nobody has to know anything to have an opinion about art? Music too. Simply by virtue of having eyes and ears, anyone at all can spout off about art or music or literature or anything. Half the people out there haven\u0027t given art two seconds of thought before tonight. They\u0027ve never been to art school or studied in Paris or picked up a book about art or subscribed to any art magazines. As soon as they get a few little paintings in front of them, they\u0027re more than ready to say why it\u0027s good or bad or significant or worthless. Shit.\" He drank his drink. Conner drank his too. They filled up again on Professor Dan\u0027s expensive booze. \"You\u0027re not too talkative. Bad night?\" asked Pear-shaped Guy. \"I don\u0027t know,\" Conner said. \"It was pretty good for a while. Now I\u0027m not sure.\" \"Girl trouble?\" \"How did you know?\" He shrugged. \"That\u0027s the only kind of real trouble when you get down to it.\" \"I\u0027m broke too.\" \"Small potatoes,\" said Pear-shape. \"I never know where my next dollar\u0027s coming from. One day I\u0027m rolling in it, the next I\u0027m stealing Scotch from a giant, pretentious globe.\" \"Are you a stockbroker or something? I could use a hot tip.\" \"Not quite, but this advice works for anything. You have to visualize your goal, decide you\u0027re not going to be a bottom-feeder anymore. Set specific goals with specific, definable steps. Tackle each step one at a time. Sounds too simple, but it really does work.\" \"And this will solve my girl trouble?\" Conner belched burning Scotch. The fumes came out his nose, made him cough. Thinking about Tyranny didn\u0027t mix well with the booze. His belly gurgled. \"Jesus, no. You\u0027re not listening. Women are an unsolvable problem. Be nice to them, and maybe they\u0027ll deign to put out. That\u0027s about all you can do. For everything else: visualize.\" \"My guts hurt,\" Conner said. \"Visualize the pain floating away as a bright orange balloon.\" Conner ignored him, bent in half, and stumbled out of the room. He felt anxious, hot, and dizzy, realized he\u0027d drunk too much too quick. He tried a door. It was a bathroom. His guts knotted, and he was just able to get his pants down and his butt on the toilet seat when his bowels exploded, a steaming, liquid mess. His face was slick with sweat. It was so hot. His mouth dry. All that booze on an empty, nervous stomach. He hadn\u0027t even eaten the pigs in the blankets. He cleaned himself up. Flushed. He reached down to pull up his pants and pitched forward, toppling off the toilet and landing in a tangled heap on the floor. The room spun. He took deep breaths until everything fell back into place. Visualize standing up. He braced himself against the tub, lurched to his feet. Visualize pulling up your pants. He did it, zipped himself. He leaned against the sink, looked at himself in the mirror. Conner Samson, bottom-feeder. He resolved to do something, take some kind of step forward. Even if it was something wrong. He wasn\u0027t going to take it anymore. No more wishy-washy middle ground for Conner Samson. He splashed water on his face, toweled off, and left the bathroom. Conner made his way back to the small salon where the Dybeks were on display. A young couple nodded appreciatively at them, discussed the finer points. Conner thought he caught the word \"brushstrokes\" and giggled. They scowled at him, eyes tough and offended. She had a nose ring and a butterfly tattoo on her back. He was shaggy-haired. White socks. A couple of Professor Dan\u0027s students, Conner figured. They left the salon with their noses in the air. Conner checked the window, opened it all the way, stuck his head out, and looked both ways and down. Rosebushes underneath. He\u0027d need to be careful of thorns. Nobody was around. It would be an easy jog around the house to where the valet punks had parked the Plymouth. He looked back into the salon. Nobody. He listened ten long seconds but didn\u0027t hear anyone coming. Visualize a major crime. He ran to the three Dybeks, pushed the velvet rope aside, grabbed each one off its easel, and sprinted back to the window. He reached out with one of the paintings, leaned as far as he could without tumbling out the window. It was still a good five feet to the ground. He didn\u0027t want the painting to land hard and crack the frame into pieces. He thought about tossing them into the bushes to ease the landing, but he didn\u0027t want the rose thorns to rip the canvas. Maybe he could climb out the window, then reach back through for the paintings. He bit his lip, tried to judge the distance. It was a little too far down. He wouldn\u0027t be able to reach them. Conner swung one leg over the windowsill. He picked up one of the paintings, put another under his arm. Maybe he could get partway out, still holding the paintings, then position himself to jump down. He squirmed into position. Awkward. Even if he could jump and land without busting his ass, there was no way he could reach back in for the third painting. \"Go ahead and climb out,\" a voice behind him said. \"Then I\u0027ll hand them down to you.\" Conner yelped, startled. He turned to look into the thickly bespectacled eyes of Pear-shaped Guy. \"What?\" \"Go on out. Be careful. Don\u0027t turn an ankle.\" He took the painting from beneath Conner\u0027s arm. \"Uh... okay.\" Conner swung his other leg over the sill, looked questioningly over his shoulder. \"Go ahead.\" Pear-shape nodded encouragement. Conner moved slowly. He lowered himself inch by inch, watching Pear-shape with suspicion, until his feet were on the ground. The window was about a foot over his head. Pear-shape leaned out, handed him the paintings one by one. \"You all set?\" Conner nodded. \"Okay, good luck. Don\u0027t take any wooden Injuns.\" Pear-shape\u0027s head vanished back through the window. \"Wait!\" Conner had to know. Pear-shape stuck his head out again. \"Yeah?\" \"You don\u0027t seem to mind I\u0027m stealing these paintings.\" \"Nope.\" Conner asked, \"Don\u0027t you think Jasper Dybek will be upset?\" The guy laughed. \"I am Jasper Dybek.\" Conner looked at the paintings, back at Dybek. \"Don\u0027t you need these? I heard you get paid a lot for them.\" \"An obscene amount,\" he said. \"But I only manage to unload two or three a year. It\u0027s not exactly a steady paycheck. If you steal them, I can collect the insurance. Now get moving. In about twenty minutes, I\u0027m going to raise holy hell.\" He ducked back inside and shut the window. Conner scooped up the paintings and ran around the house. He told the valet punk on duty to fetch his Plymouth. The kid brought it around within sixty seconds. Conner popped the trunk, loaded the paintings. The valet didn\u0027t seem concerned. \"I\u0027m taking these out to be cleaned,\" Conner said. \"What? Huh?\" The kid\u0027s eyes were red and glassy, and Conner definitely smelled marijuana on his clothes. The valet didn\u0027t know what planet he was on. \"Keep up the good work,\" Conner said. The kid grinned stupidly, held out his upturned palm. \"How \u0027bout a tip, dude?\" Conner had zero cash. He patted his pockets, looked apologetic. He found the napkin wad of pigs in a blanket, put it into the kid\u0027s hand. \"Bon app¨¦tit.\" The kid shrugged, popped one into his mouth. Conner climbed in behind the wheel, cranked the Plymouth \u0027s V-8, and slammed it into gear. He squealed the tires down the driveway, took the turn onto the road too sharply, and exploded a small statue of a naked lady into dust. One of the Plymouth \u0027s headlights winked out. Visualize driving drunk. Visualize not wrapping the Plymouth around a telephone pole. He drove fast until he was well away from the house. He forced himself to slow down, drive straight. Getting pulled over now would be stupid. More stupid. Now what? He didn\u0027t want to go back to his puke-smelling apartment. It symbolized everything weak and worthless in his life. Going back would smack of defeat, and tonight was about taking charge of his life. The new Conner Samson was a go-for-it, damn-the-torpedoes kind of guy. So. Visualize what the hell to do next, smart guy.","sourceLink":"https://allnovel.net/suicide-squeeze/page-12.html","bookId":2245,"book":{"id":2245,"title":"Suicide Squeeze","description":"Storyline: The Edgar Award-nominated author of \"Gun Monkeys\" delivers an adrenaline rush of a novel that features a special appearance by Joe DiMaggio. The high spot of Teddy Folger\u0027s life was the day in 1954 that he got an autographed baseball card from Joe DiMaggio himself. It\u0027s been downhill ever since. Which is why he just unloaded his freeloading wife and torched his own comic-book store-in one of the stupidest insurance scams in history. Enter Conner Samson. The down-on-his-luck repo man has just been hired to repossess Teddy\u0027s boat. Little does he know there\u0027s a baseball card on board that some men are willing to kill for. Thus begins a rip-roaring cross-country odyssey-and with bodies piling up, the squeeze is on for the penultimate piece of Americana. And Conner will be lucky if he ends up back where he started: broke and (still) breathing. \"From the Hardcover edition.\"","cover":"https://allnovel.net/images/suicide-squeeze.jpg","author":"Victor Gischler","type":"Thriller","source":"allnovel","link":"https://allnovel.net/suicide-squeeze.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:05:46 PM"}}
