{"id":85376,"no":16,"title":"Page 16","content":"25\\n\\n Murder.\\n\\n It was the thought uppermost in Conner Samson\u0027s mind, that he would murder Randy Frankowski if he didn\u0027t shut the hell up. Conner kept these thoughts to himself as they sped up Interstate 65 toward Montgomery in Randy\u0027s 1998 Geo sardine can, Randy pinballing from lane to lane, Conner gripping the armrest. The kid really didn\u0027t seem to notice that he drove like shit, didn\u0027t signal when he changed lanes, sped up or slowed down for no discernible reason, and veered onto the shoulder whenever he leaned down to slide a new CD into the stereo.\\n\\n And all the way, the nonstop chatter. Mostly about comics, but the topics ranged all along the big nerd spectrum. For the last twenty minutes, Randy had railed against the new Star Trek series Enterprise, claiming it had not been what the show\u0027s producers had advertised and was merely a watered-down version of Next Generation and Voyager and wasn\u0027t really new or innovative at all.\\n\\n \"I could give a shit,\" Conner mumbled.\\n\\n \"What?\" Randy shouted over the music. They Might Be Giants blasted full throttle out of the stereo\u0027s tinny, crackling speakers.\\n\\n Conner raised his voice. \"I said let\u0027s pull over. I have to take a leak.\"\\n\\n \"No problem.\"\\n\\n They took the next exit, pulled into a Shell station right next to a McDonald\u0027s. Randy went next door to load up on McStuff. Conner relieved himself in the service station\u0027s restroom. He purchased a Pepsi and a Fortune magazine.\\n\\n He stood next to Randy\u0027s Geo, waited for the kid to return from Mickey-D\u0027s.\\n\\n Conner spotted a shiny black Land Rover parked across the lot. It was new, tinted windows, gleaming rims. He felt suddenly angry that there were people in the world with lots of money, nice cars, big houses while he was riding in a chubby kid\u0027s Geo on the way to a sci-fi convention. It wasn\u0027t that Conner had any particularly strong political convictions about the redistribution of wealth. If he could be one of the rich people that others hated, then that would be just hunky-dory with Conner. Someday.\\n\\n Randy returned with a bag of food and a chocolate milk shake. \"We\u0027re only about forty-five minutes from Montgomery. You want to go ahead and get changed now?\"\\n\\n \"Changed for what?\"\\n\\n \"Oh, I forgot to show you,\" Randy said. \"I told you I could get us in for free, remember? Today\u0027s costume day. Wear a costume, and you don\u0027t have to pay the entrance fee.\"\\n\\n \"Please don\u0027t say what I think you\u0027re going to say,\" Conner said.\\n\\n Randy set his food on the Geo\u0027s roof and popped the hatchback. He pulled out a tote bag, unzipped it. Within were two sets of clothes: a blue shirt and a pea-green shirt, two pairs of pants. The legs on the pants were short, ending just below the knees. Boots.\\n\\n \"These are modeled on the exact Federation uniforms from the original series,\" Randy said. He beamed. \"The green shirt is for you. It fastens around the front. I thought you\u0027d be Captain Kirk. I\u0027ll be Spock in the blue shirt.\"\\n\\n \"And you really think I\u0027m going to wear that?\"\\n\\n \"It\u0027ll fit. The material\u0027s real stretchy.\"\\n\\n \"I hate to disappoint you,\" Conner said. \"But there\u0027s no way in hell I\u0027m putting that on.\"\\n\\n \"You\u0027ll have to pay to get in then.\"\\n\\n \"I\u0027ll think of something.\"\\n\\n \"Hey, whatever, man.\" Randy grabbed the blue shirt and the pants. \"I\u0027m going to change.\"\\n\\n He went into the Shell station, came back a few minutes later. The shirt was at least a size too small. He wore sneakers instead of the boots.\\n\\n Please not the ears. Please not the ears. Please not the ears.\\n\\n Randy took the plastic pointy tips out of his pocket, fastened them to his ears. He was now a complete Vulcan.\\n\\n \"How do I look?\" Randy asked.\\n\\n \"Great.\"\\n\\n They got back into the Geo and onto the interstate, headed toward Montgomery. Conner noted only casually that the Land Rover had fallen in behind them.\\n\\n The Montgomery Airport Holiday Inn buzzed with geeky activity. Randy screeched the Geo into the hotel parking lot, nearly splattering the shortest, skinniest Batman Conner had ever seen. Randy slammed on the brakes three inches from Batman\u0027s leg. Batman screamed, flourished his cape, and bounded away.\\n\\n Conner pitied the men and women of Gotham.\\n\\n As they parked, a posse of Klingons spilled out of a minivan. They barked at each other in a made-up, alien language. Conner could only shake his head. What was with these people? Conner realized, even as he gawked at a frizzy-haired Wonder Woman with a wiener dog on a leash, that his view of these people was far from enlightened. He didn\u0027t really consider himself intolerant. He could never have been part of his high school or college baseball teams if he didn\u0027t get along well with his black and Hispanic teammates. Maybe it was his jock training. These were the kids people made fun of in high school. Back then, it seemed the natural order of things, and now, into adulthood, something of the cruel adolescent still clung to Conner. He didn\u0027t want to stick their heads in a toilet, or throw eggs at them, as many of his old jock chums had. But he wanted to scream Get a life!\\n\\n Yeah. Right. As if Conner\u0027s life was so enviable.\\n\\n They crossed the parking lot, and Conner noticed the black Land Rover pull into the lot and park several spaces away. Escambia County license plates. Conner didn\u0027t believe in coincidences. He watched, waited to get a look at the driver.\\n\\n \"Come on, come on.\" Randy\u0027s voice was begging and eager. \"I want to check in, then cruise the dealer room before the afternoon panels start.\"\\n\\n Conner followed Randy into the hotel lobby, still glancing over his shoulder at the Land Rover. Nobody got out. Conner imagined bad people stalking him. He\u0027d recently embraced paranoia.\\n\\n He stood with Randy in a long line and watched him register for the convention. When the woman behind the counter asked if Conner would like to register also, he shook his head. Randy started in about wearing the costume. Conner explained that he was going to push Randy\u0027s face in if he brought it up again. Randy said Conner couldn\u0027t get into the dealer room unless he registered and wore a name badge.\\n\\n Conner pulled Randy aside. \"Look, I don\u0027t need to sign up for all the whatnot and hoo-ha. Just go get Jerry and bring him out here, so I can ask him a few questions about the DiMaggio card.\"\\n\\n \"I don\u0027t think Jerry would go for that,\" Randy said. \"He won\u0027t want to leave his table.\"\\n\\n \"Everyone needs a coffee break. Just ask him.\"\\n\\n Randy shrugged. \"I\u0027ll ask, but don\u0027t hold your breath.\"\\n\\n Randy left, and Conner decided if he couldn\u0027t sneak in, he\u0027d go ahead and pay the twenty bucks and get on with it. Conner looked out the window at the Land Rover. It was still there. Somebody might have gotten out when he was arguing with Randy, or maybe-\\n\\n The Rover\u0027s driver-side door swung open, and a tall, thin man climbed out, expensive blue suit, gleaming wing tips, well-coiffed hair with gray at the temples. It was Professor Dan.\\n\\n Shit and fuck and hell and damn and sonofafuckingbitch...\\n\\n Conner leapt behind a potted palm, watched Professor Dan between fronds. What the hell is he doing here? The realization struck Conner like a cartoon anvil being dropped on his head. Professor Dan knew Conner had taken the Dybeks. Wait, why wouldn\u0027t the professor call the police? Did he want to confront Conner mano a mano, some kind of macho showdown? It didn\u0027t seem like Dan\u0027s style.\\n\\n Randy returned, tapped Conner on the shoulder. \"Jerry won\u0027t come out right now. I told you. He\u0027s not what you\u0027d call the most social person.\"\\n\\n Conner ignored Randy, watched Dan. The professor looked lost, seemed befuddled by a couple of teenagers wearing crude homemade armor and wooden swords wrapped in aluminum foil. He started walking toward the hotel.\\n\\n \"Anyway,\" Randy continued, \"Jerry says he\u0027ll talk to you later if-\"\\n\\n \"Shut up,\" Conner said. \"We\u0027ve got to hide.\"\\n\\n Conner ran into the hotel lounge, Randy trailing behind him. Dan entered three seconds later, stood in the lounge doorway, and scanned the room until his eyes landed on Conner. He walked over, chin up, stride confident.\\n\\n \"Samson,\" Professor Dan said. \"You and I need to talk.\"\\n\\n \"So talk.\"\\n\\n Professor Dan looked Randy up and down like he was inspecting a turd. \"Alone. Over at the bar.\"\\n\\n Conner and Professor Dan leaned at the bar. The bartender took their orders, a draft beer for Conner and a Beefeater and lime for Dan. The professor didn\u0027t say anything, sipped his drink. Conner was nervous, didn\u0027t want to talk first. He gulped beer, waited, kept his eyes glued to the professor\u0027s face, but Dan was unreadable. If he accused him of stealing the Dybeks, Conner would deny it. He would just flat out look Dan in the eye and claim to have no idea what he was talking about.\\n\\n \"I want you to stop seeing Tyranny,\" Professor Dan said.\\n\\n \"I\u0027m not...\" Conner couldn\u0027t even finish the lie. He felt suddenly leaden, his gut heavy. He couldn\u0027t look at Professor Dan. He felt guilty and small and embarrassed. He felt caught.\\n\\n In fact, Conner had often imagined a confrontation with Dan, fantasized about telling him off, telling him he wasn\u0027t good enough for Tyranny, that he was a pompous, arrogant has-been. Then he\u0027d sweep Tyranny into his arms and drive away in his new Ford Mustang. Convertible.\\n\\n Instead, all Conner could do was wait for what Dan said next.\\n\\n \"I want to be clear on this,\" Dan said. \"You\u0027re going to stop seeing her. End of discussion. I felt it was something I had to say in person.\" He downed his drink, turned to leave.\\n\\n Somewhere from the bottom of Conner\u0027s throat, he said, \"No.\"\\n\\n It had come out in a croak, had almost been lost amid the bar din. Conner almost didn\u0027t have the breath to utter it, his feeble defiance. Dan, in fact, hadn\u0027t even heard him, was still walking away, when Conner cleared his throat and said a little louder, \"No.\"\\n\\n Dan stopped, looked back at Conner. \"What?\"\\n\\n \"I said no. It\u0027s not up to you. It\u0027s up to Tyranny.\"\\n\\n Dan laughed, came back to the bar, and motioned for the bartender to refill his drink. \"How do you think this will work? I mean really. You think Tyranny is like a dog? We\u0027ll both call her and see who she comes to? You think she\u0027ll make the right choice?\"\\n\\n \"I think she\u0027d choose me,\" Conner said. \"She loves me, not you.\"\\n\\n \"Love. Huh. She likes you. I\u0027ll admit that,\" Professor Dan said. \"That\u0027s why I wanted to talk to you face-to-face. She was very agitated after the reception the other night. She claimed not to be feeling well, but I know she was upset about you. She might even like you better than the others.\"\\n\\n \"Others?\"\\n\\n A slight smile. Smug. \"You don\u0027t know, do you? How delightful. You can\u0027t tie down a woman like Tyranny. She isn\u0027t built that way. She has problems. Needs. I\u0027m an adult, so I take it in stride like an adult.\"\\n\\n \"You\u0027re a liar.\" Conner felt hot up through his face. Sweat.\\n\\n \"As long as she keeps her extracurricular activities out of my face, I\u0027m pretty tolerant, but you\u0027re different, Samson. You upset her, and that upsets me. It makes me have to think about it, and that\u0027s when it starts to bother me. So you\u0027re out, Samson. You can\u0027t handle yourself like a grown-up, so I\u0027m telling you to walk away.\"\\n\\n \"She loves me.\" Even to Conner it sounded weak. Others? Professor Dan was trying to rattle him.\\n\\n \"Jesus, you\u0027re dumb.\" Dan gulped his drink. \"I\u0027m twice the man you are, Samson. I have money, influence, standing in the community. But that\u0027s not why Tyranny and I work. I understand her and give her the room she needs. You don\u0027t get it. You\u0027re a diversion to her. That\u0027s all.\"\\n\\n \"Shut up.\" The anger roared in his ears.\\n\\n \"You\u0027re a textbook loser, Samson,\" Dan said. \"Do you think it\u0027s true love just because she humped you?\"\\n\\n \"Don\u0027t talk about her like-\"\\n\\n \"Knock off the chivalry bullshit. You\u0027ve had your ride. Now it\u0027s time to move on.\"\\n\\n Conner\u0027s fist came around fast, smacked hard into Dan\u0027s jaw. Dan spit blood, stepped backward, legs wobbly, then sat down hard on the floor.\\n\\n He stood slowly, wiped blood on his sleeve. \"Feel better? Think that solves anything? Just like your type to-\"\\n\\n Conner hit him again. Dan\u0027s head snapped back, but he didn\u0027t go down.\\n\\n \"Son of a bitch.\" Dan charged, leapt on Conner, wrapping his arms around Conner\u0027s waist. They fell back in a tangled mass, knocked over a table, scattering mugs of beer. Costumed nerds screamed and fled the lounge.\\n\\n Conner and Professor Dan rolled on the floor, punching and gouging without effect. Conner bit Dan\u0027s arm. He screamed, kicked Conner away. They both scrambled to their feet, facing each other and breathing heavily.\\n\\n Dan grabbed a chair, threw it at Conner.\\n\\n Conner caught it, threw it back at Dan, who ducked and yelped. Then Conner rushed the professor. Dan grabbed a drink from the bar, splashed it into Conner\u0027s eyes. Conner yelled, tried to punch with one hand while wiping his eyes with the other.\\n\\n Bodies piled on top of him. Shouting. His hands were pinned behind his back and his face slammed down on the floor of the lounge, rubbed raw against the cheap carpet. It hurt.\\n\\n All Conner could think of was Tyranny. How many others had there been? The mental images of her with other men burned Conner\u0027s brain. He tortured himself with this thought over and over again the way men will do when they\u0027re trying to reach that numb place where nothing matters anymore. \\n\\n","sourceLink":"https://allnovel.net/suicide-squeeze/page-16.html","bookId":2245,"book":{"id":2245,"title":"Suicide Squeeze","description":"Storyline: The Edgar Award-nominated author of \"Gun Monkeys\" delivers an adrenaline rush of a novel that features a special appearance by Joe DiMaggio. \\n The high spot of Teddy Folger\u0027s life was the day in 1954 that he got an autographed baseball card from Joe DiMaggio himself. It\u0027s been downhill ever since. Which is why he just unloaded his freeloading wife and torched his own comic-book store-in one of the stupidest insurance scams in history. Enter Conner Samson. The down-on-his-luck repo man has just been hired to repossess Teddy\u0027s boat. Little does he know there\u0027s a baseball card on board that some men are willing to kill for. Thus begins a rip-roaring cross-country odyssey-and with bodies piling up, the squeeze is on for the penultimate piece of Americana. And Conner will be lucky if he ends up back where he started: broke and (still) breathing. \"From the Hardcover edition.\"\\n","cover":"https://allnovel.net/images/suicide-squeeze.jpg","author":"Victor Gischler","type":"Thriller","source":"allnovel","link":"https://allnovel.net/suicide-squeeze.html","creation":"Oct 5, 2019 8:58:30 AM","modification":"Oct 5, 2019 5:05:46 PM"}}
