{"id":99542,"no":3,"title":"Page 3","content":"No clouds. The clearest day in a long time. Good for healing. I take power from the sun. It flows through me and from my fingers to the wounded. I use medicine, pastes and potions where they\u0027re all that\u0027s needed. Magic on those with more serious injuries-Scota and a few others who were struck by the Fomorii\u0027s fire-blood.\n The warriors are tired, their sleep disturbed. They\u0027ll rest later, but most are too edgy to return to their huts straightaway. It takes an hour or two for the battle lust to pass. They\u0027re drinking coirm now and eating bread, discussing the battle and the demons.\n I\u0027m fine. I had a full night\u0027s sleep, only coming on watch a short while before the attack. That\u0027s my regular pattern on nights when there isn\u0027t an early assault.\n Having tended to the seriously wounded, I wander round the rath, in case I\u0027ve missed anybody. I used to think the ring fort was huge, ten huts contained within the circular wall, plenty of space for everyone. Now it feels as tight as a noose. More huts have been built over the last year, to shelter newcomers from the neighbouring villages in our tuath. Many of those who lived nearby were forced out of their homes and fled here for safety. There are twenty-two huts now, and although the walls of the rath were extended outwards during the spring, we weren\u0027t able to expand by much.\n The use of magic has wearied me and left me hungry. I don\u0027t have much power, nothing like what Banba had. The sun helps but it\u0027s not enough. I need food and drink. But not coirm. That would make me dizzy and sick. Milk with honey stirred in it will give me strength.\n Goll\u0027s sitting close to the milk pails. He looks downhearted. He\u0027s scratching the skin over his blind right eye. Goll was king of this whole tuath years ago, the most powerful man in the region, with command of all the local forts. There was even talk that he might become king of the province-our land is divided into four great sectors, each ruled by the most powerful of kings. None of our local leaders had ever held command of the province. It was an exciting prospect. Goll had the support of every king in our tuath and many in the neighbouring regions. Then he lost his eye in a fight and had to step down. He\u0027s not bitter. He never talks of what might have been. This was his fate and he accepts it.\n But Goll\u0027s in a gloomy mood this morning. He hates making mistakes. Feeling sorry for the old warrior, I sit beside him and ask if he wants some milk.\n \"No, Little One,\" he says with a weak smile.\n \"It wasn\u0027t your fault,\" I tell him. \"It was a lucky strike by the Fomorii.\"\n Goll grunts. That should be the end of it, except Connla is standing nearby, a mug of coirm in his hands, boasting of the demon he hit with his spear. He hears my comment and laughs. \"That wasn\u0027t luck! Goll\u0027s a rusty old goat!\"\n Goll stiffens and glares at Connla. Eighteen years old, unmarried Connla\u0027s one of the handsomest men in the tuath, tall and lean, with carefully braided hair, a moustache, no beard, fashionable tattoos. His cloak is fastened with a beautiful gold pin, and pieces of fine jewellery are stitched into it all over. Unlike most of the men, who wear belted tunics, he favours knee-length trousers. He was the first man in the rath to wear them, although several have followed his lead. His boots are made from the finest leather, laced artistically with horse-hair thongs. He looks more like a king than his father does, and when Conn dies he\u0027ll be one of the favourites to replace him. Most of the young women in the tuath desire him for his looks and prospects. But he\u0027s no great warrior. Everyone knows Connla\u0027s an average fighter. And far from the bravest.\n \"At least I was there to make a mistake,\" Goll growls. \"Where were you, Connla-combing your hair perhaps?\"\n \"I was in the thick of the fighting,\" Connla insists. \"I struck a demon. I think I killed it.\"\n \"Aye,\" Goll sneers. \"You hit it with a spear. In the back. While it was running away.\" He claps slowly. \"A most courageous deed.\"\n Connla hisses. His hand goes for a spear. Goll snatches for his axe.\n \"Enough!\" Conn barks. He\u0027s been keeping an eye on the pair. He always seems to be on hand when Connla\u0027s on the point of getting into trouble. The king steps forward, scowling. \"Isn\u0027t it bad enough that we have to fight demons every night, without battling among ourselves too?\"\n \"He questioned my courage,\" Connla whines.\n \"And you called him an old goat,\" Conn retorts. \"Now shake hands and forget it. We don\u0027t have time for quarrels. Be men, not children.\"\n Goll sighs and extends a hand. Connla takes it, but his face is twisted and he shakes quickly, then returns to the small group of men who are always huddled close around him. As they leave, he starts to tell them again about the demon he speared and how he\u0027s certain the blow was fatal, boasting of his great skill and courage.\n Later. The gate of the rath is open. The cows and sheep have been led out to graze. Demons can only come at night, gods be thanked. If they could attack by day as well, we\u0027d never be able to graze our animals or tend our crops.\n I go for a walk. I like to get out of the ring fort when my duties allow, stretch my legs, breathe fresh air. I stroll to a small hill beyond the rath, from the top of which I\u0027m able to look all the way across Sionan\u0027s river to the taller hills on the far side. Many of the men have been to those hills, to hunt or fight. I\u0027d love to climb the peaks and see what the world looks like from them. But it\u0027s a journey of many days and nights. No chance of doing that while the demons are attacking. And for all we know, the demons will always be on the attack.\n I feel lonely at times like these. Desperate. I wish Banba was here. She was more powerful than me and had the gift of prophecy. She died last winter, killed by a demon. Got too close to the fighting. Struck by a Fomorii with tusks instead of arms. It took her two nights and days to die. I haven\u0027t learnt any new magic since then. I\u0027ve worked on the spells that I know, to keep in shape, but it\u0027s hard without a teacher. I make mistakes. I feel my magic getting weaker, when it should be growing every day.\n \"Where will it end, Banba?\" I mutter, eyes on the distant hills. \"Will the demons keep coming until they kill us all? Are they going to take over the world?\"\n Silence. A breeze stirs the branches of the nearby trees. I study the moving limbs, in case I can read a sign there. But it just seems to be an ordinary wind-not the Otherworldly voice of Banba.\n After a while I bid farewell to the hills and return to the rath. There\u0027s work to be done. The world might be going up in flames, but we have to carry on as normal. We can\u0027t let the demons think they\u0027ve got the beating of us. We dare not let them know how close we are to collapse.\n After a quick meal of bread soaked in milk, I start on my regular chores. Weaving comes first today. I\u0027m a skilled weaver. My small fingers dart like eels across the loom. I\u0027m the fastest in the rath. My work isn\u0027t the best, but it\u0027s not bad.\n Next I fetch honey from the hives. The bees were Banba\u0027s. She brought them with her when she settled in the rath many years ago. They\u0027re my responsibility now. I was scared of them when I was younger, but not any more.\n Nectan returns from a fishing trip. He slaps two large trout down in front of me and tells me to clean them. Nectan\u0027s a slave, captured abroad when he was a boy. Goll won him in a fight with another clan\u0027s king. He\u0027s as much a part of our rath now as anyone, a free man in all but name.\n I enjoy cleaning fish. Some women hate it, because of the smell, but I don\u0027t mind. Also, I like reading their guts for signs and omens, or secrets from my past. I haven\u0027t divined anything from a fish\u0027s insides yet but I live in hope.\n The women grind wheat in stone querns, to make bread or porridge. Some work on the roofs of the huts, thatching and mending holes. I\u0027d love to build a hut from scratch, draw a circle on the ground and raise it up level by level. There\u0027s something magical about building. Banba told me that all unnatural things-clothes, huts, weapons-are the result of magic. Without magic, she said, men and woman would be animals, like all the other beasts.\n Most of the men are sleeping, but a few are cleaning their blades and still discussing the night\u0027s battle. It was one of our easier nights. The attack was short-lived and the demons were few in number. Some reckon that\u0027s a sign that the Fomorii are dying out and returning to the Otherworld. But they\u0027re dreamers. This war with the demons is a long way from over. I don\u0027t need fish guts to tell me that!\n Fiachna is working by himself, straightening crooked swords, fixing new handles to axes, sharpening knives. We\u0027re the only clan in the tuath with a smith of its own. That was Goll\u0027s doing when he was king. Most smiths wander from clan to clan, picking up work where they find it. Goll figured that if we paid a smith to settle, folk from nearby raths, cathairs and crannogs would come to us when their weapons and tools needed repairing, rather than wait for a smith to pass by. He was right. Our rath became an important focal point of the tuath-until the attacks began. The demons put paid to a lot of normal routines. Nobody travels now, unless it\u0027s to flee the Fomorii.\n When I get a chance, I walk over to where Fiachna is hammering away at a particularly stubborn blade. I watch him silently, playing with a lock of my short red hair, smiling shyly. I like Fiachna. He\u0027s shorter than most men, and slim, which is odd for a smith. But he\u0027s very skilled. Stronger than he looks. He swings heavy hammers and weapons with ease. If I could marry, I\u0027d like to marry Fiachna. If nothing else, we\u0027re suited in size. Maybe it\u0027s because of the name Goll gave me, or perhaps it\u0027s coincidence, but I\u0027m one of the smallest girls in the rath.\n But it\u0027s not just his size. I like his kind nature and gentle face. He has a short beard-dark-blond, like his hair-which doesn\u0027t hide his smile. Most of the men have beards so thick you can\u0027t see their mouths, so you never know if they\u0027re smiling or frowning.\n I often dream of being Fiachna\u0027s wife, bearing his young, fighting demons by his side. But it won\u0027t happen. I\u0027m almost of marrying age-my blood came a couple of years ago, earlier than in most girls-but I can never wed. Magic and marriage don\u0027t mix. Priestesses and druids lose their power if they love.\n Sometimes it makes me sad, thinking about not being able to marry. I find myself wishing I could be normal, that the magic would fade from me, leaving me free to wed like other girls my age. But those are selfish thoughts and I try hard to drive them away. My people need my magic. It\u0027s not the strongest in the world and I\u0027m in dire need of a teacher to direct me. But it\u0027s better than having no magician in the rath at all.\n Fiachna looks up and catches me staring. He smiles, but not in a teasing way, not like Connla would smirk if he saw me looking at him. \"You did well with the bees last night,\" Fiachna says in his soft, lilting voice, more like a fairy\u0027s than a human\u0027s.\n I feel my face turn red. \"It wasn\u0027t much,\" I mutter, sticking my big right toe out over the lip of its sandal and stubbing the ground.\n \"You\u0027re getting stronger,\" Fiachna says. \"You\u0027ll be a powerful priestess soon.\"\n We both know that\u0027s a lie but I love him for saying it. I give a big smile, like a baby having its tummy tickled. Then Cera calls me and tells me to give her a hand dyeing wool. \"Do you want me to help you with the weapons?\" I quickly ask Fiachna, hoping for an excuse to stay with him. \"I can bless the blades. Put magic in them. Make them stronger.\"\n Fiachna shakes his head. \"There\u0027s no need. I\u0027m almost finished. I\u0027ll work on farming tools in the afternoon.\"\n \"Oh.\" I try not to let my disappointment show. \"Well, if you need me, call.\"\n Fiachna nods. \"Thank you, Bec. I will.\"\n Simple words, but as I dip strands of wool in a vat full of blue dye, they ring inside my skull for ages, making me smile.\n In the afternoon, while the men are stirring in their sleep and the women are working on the evening meal, a lookout yells a warning. \"Figures to the north!\"\n The rath comes on instant alert. Demons have never attacked this early-there\u0027s at least two hours of daylight left-but we\u0027ve learnt not to take anything for granted. Men are out of their huts and reaching for weapons within seconds. Female warriors throw away their looms, combs, tools and pots, and hurry to the rampart. Those outside the rath are summoned in. They come hastily, anxiously driving the animals ahead of them.\n Conn emerges from his hut at the centre of the village, eyes crusty, looking less worried than anyone else. A king should never look scared. He climbs the rampart and strides to the lookout. Stares off into the distance. Connla shouts at him from the ground, \"Demons?\"\n \"Doesn\u0027t look like it,\" Conn grunts. \"Human in shape. But maybe they\u0027re dead.\"\n The dead often come back to haunt us. The demons get the bodies from dolmens or wedge tombs. They use dark magic to fill the corpses with evil life, sometimes stitching bits from various victims together. We\u0027re not sure why they do it. Maybe some of them can\u0027t make bodies of their own and have to steal the bones of our dead. We\u0027ve gone to all the local tombs that we know of over the last year, burning the corpses. But there are many hidden and forgotten tombs. The demons are always finding new bodies. At times, it seems like there\u0027s more dead than living in the world.\n Conn watches for several minutes, more of the clan joining him, shading their eyes with their hands, studying the approaching shapes. I see the more hawk-eyed among them-Ronan, Lorcan, Ena-relax and I know it\u0027s all right. But nobody says anything before Conn. It\u0027s his place to give the all-clear.\n Finally, Conn smiles. \"Not to worry,\" he says. \"They\u0027re human. Alive.\"\n Calm settles over the rath and everyone returns to their normal routine. We\u0027re curious about the strangers but we\u0027ll find out all about them in good time. No point standing around guessing, when there\u0027s work to be done.\n They arrive half an hour later, ragged and weary from battle and the road. Four men, three women and four children. We know them-the MacCadan. When the demons first attacked, Conn sent an envoy to Cadan and asked if he was open to an alliance. There had been bad blood between us but Conn wanted to make peace, so we could fight the demons together. Cadan refused. He said his people could stand alone. We haven\u0027t heard from them since then.\n Cadan\u0027s not among the eleven. The leader\u0027s an old warrior-even older than Goll-who limps awkwardly and trembles pitifully when he\u0027s not on the move. He announces himself at the gate as Tiernan MacCadan and requests entrance. The eleven trudge into the rath and present themselves miserably, heads low.\n Conn goes straight to Tiernan and clasps his arms warmly, welcoming him. He asks if they\u0027re hungry or thirsty. Tiernan says they are and Conn gives orders for a feast to be prepared. The women set to the task immediately.\n Conn leads our guests to the area in front of his hut and lets them settle. They haven\u0027t brought much-spare clothes, a few weapons, some tools-but it\u0027s plain this is all they have. I know what\u0027s happened, just as Conn and everybody else knows, but nobody says anything. We let Tiernan explain.\n The demons overwhelmed them. The end had been coming for a long time but they held out stubbornly, even past the point where they knew it was folly. Their best warriors had fallen to the foul Fomorii, their children had been taken, their animals slain, their crops destroyed.\n \"Many argued against staying,\" Tiernan sighs. \"We said it was madness, that we\u0027d perish if we didn\u0027t join forces with our neighbours. But Cadan said we\u0027d lose face if we retreated. He was a proud man, not for bending. But eventually, like all who refuse to bend, he snapped. The Fomorii took him last night, along with three others. This morning, before the sun had risen, we packed our goods and marched here. We hope to fight with you, to offer whatever aid we can, to...\"\n He trails to a halt. Two of the men are seriously injured and Tiernan\u0027s no chick. One of the women is a warrior but the other two aren\u0027t. And the children are too young to fight. Tiernan\u0027s trying to make it sound like we need them, that they can make a difference. But really they\u0027re just looking for sanctuary. Taking them in would be a mercy, not a merger.\n The men of the rath are sitting in a circle around the newcomers. I\u0027m on the outskirts, only allowed this close in case any magical matters arise. I see doubt on the faces of most. We\u0027re already cramped. We\u0027d need to expand the fort again to comfortably hold eleven more people. That\u0027s hard to do when you\u0027re under attack from demons most nights.\n Tiernan senses the mood and speaks rapidly. \"We could build our own huts. Our women are skilled, the children too. We\u0027d depend on your hospitality for a few weeks but we\u0027d work every hour we can to set up on our own. We wouldn\u0027t be a burden. And when it comes to fighting, we\u0027re stronger than we look. Even the youngest child has drawn blood. We-\"\n \"Easy, friend,\" Conn interrupts. \"We\u0027re pleased you came to us when there are so many other clans you could have gone to. It\u0027s an honour to receive you. I\u0027m sure you will be of great help.\"\n Tiernan blinks. He hadn\u0027t expected such a gracious welcome. After the years of feuding, it\u0027s more than he dared hope. Tears well in his eyes but he shakes them away and smiles. \"You\u0027re a true king,\" he compliments Conn.\n \"And, I hope, a true friend,\" Conn replies, then barks orders for beds to be made for the MacCadan. Some don\u0027t like it-Connla\u0027s face is as dark as a winter cloud-but nobody\u0027s going to argue with our king, certainly not in front of guests. So they obey without question, shifting beds, clothes and goods from one hut to another, bunching up even closer than before, squashing together, making room for the new additions to our demon-tormented clan. \n","sourceLink":"https://allnovel.net/bec-the-demonata-4/page-3.html","bookId":2178,"book":{"id":2178,"title":"Bec (The Demonata #4)","description":"Storyline: \n Bec (The Demonata #4) \n The fourth novel in this bonechilling series by Darren Shan, author of the New York Times bestselling Cirque Du Freak series, will keep readers turning page after horrifying page. \n As demonic Fomorii ravage their land, Bec and a band of warrior companions leave their devastated rath to answer a plea for help. An orphaned priestess-in-training, Bec hopes the journey will help her solve the mysteries of her birth. But fighting demons has a steep price...\n \n","cover":"https://allnovel.net/images/bec-the-demonata-4.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/bec-the-demonata-4.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:44:35 PM"}}
