{"id":70981,"no":15,"title":"Page 15","content":"“I agree,” Jack tells Mr. Winchester, and Abby swoons so hard I’m surprised she doesn’t melt into a puddle. I go back into the kitchen to get another bottle of wine and a breadbasket. When I reenter the dining room, Mr. Winchester is speaking again. “I want my track to go to a family that has integrity,” Mr. Winchester goes on. “I want somebody who will treat it as his own and take care of it.” “Yes, sir,” Jack says, sneaking a glance at his father. Mr. Goodwin’s face is stoic, unmoving. “Honor is important, wouldn’t you say?” Mr. Winchester asks as he shakes his glass, rattling the ice. I can’t believe a man like Winchester has honor if he allows his son to treat girls like shit. Jack looks up at my face before saying, “I agree, sir.” Abby sees him looking at me and scrunches her eyebrows together. “I remember when I met your father,” Mr. Winchester says to Jack. “It was at my track, and he was a teenager. Your father kept saying how much he loved Churchill Downs and how he wanted to own his own racetrack. I liked that. And that’s why I’m willing to entertain your family’s offer for Paradise Park.” I suck down a gasp. Mr. Goodwin and Jack sit there with impassive looks on their faces, quintessential businessmen. So the business deal is that Mr. Goodwin wants to buy a commercial racetrack. Wow. I can’t even imagine owning my own horse and they want to buy an entire track? Is this why Jack has to suck up to Abby Winchester all the time? What if Mr. Winchester wants Abby to marry Jack, so they can keep Paradise Park in the family, so to speak? That’s when Mr. Winchester snaps his fingers and points at his wine glass. After I’ve refilled his glass, he doesn’t thank me. Marcus gives me a lewd glance, licking his lower lip. Perv. The Winchesters are the epitome of rich people. How do the maids serve people like these assholes all the time? Later that night back in my room, I carefully dig my memory box out from my top dresser drawer, open the lid, and pull out a weathered envelope that’s spotted yellow with age. Before she died, my mother wrote me a letter and asked Dad to give it to me on my sixteenth birthday. She told me how smart and beautiful I am, and that I can do anything I want if I work hard enough, that I can go down in history. I needed to hear those words after everything that happened today. All I can think about are Marcus’s eyes staring down my dress. Mr. Goodwin basically telling Jack I’m not good enough for him. Why is it, when something bad happens to you, you can never forget about it no matter how much you want to? When Mr. Cates announced he was selling Moonshadow, I cried and begged Dad to find a way to buy her so she could stay with me. I rode her every day before school and groomed her after. Moonshadow took care of me after Mom died and I helped her move on after her foal got sold. I was her home, and she was mine. Even though Mr. Cates said Moonshadow wasn’t worth the cost of grain to feed her, Dad still couldn’t afford to buy her. And then she was gone and later I heard what happened to her… I shake my head quickly, squeezing my eyes shut. These terrible memories are branded in me, and every time they pop up in my mind, my body goes cold and clammy and I wish I could yell at somebody. I wish I could go back in time and demand that Mr. Cates keep Moonshadow, tell him I’ll work for free for as long as it takes to save her. Before I know what I’m doing, I’m running out of Hillcrest in the direction of Greenbriar, ripping through the cool night air. At the barn, I light a lantern and move to the fourth stall on the right. A pair of brilliant brown eyes meet mine. Star keeps his distance until I cluck my tongue, and then he’s right there beside me, nuzzling his nose against my neck, zapping the bad memories away. The Race and a Change of Pace “You can do better than that! That was complete shit, Barrow. Complete shit!” Gael shouts at me as I pass the clocker’s tower, and I’m grinning like crazy. I steer Star over to them, his hooves crunching the dirt. “Shut up, Gael. You know that was perfect.” Dad shakes his head at my behavior, but Gael laughs. “What was my time?” “1:43,” Dad says, giving me a smile. “Star did really good.” “You hear that, buddy?” I say, rubbing the colt’s sweaty neck. Star pins his ears and snorts when Dad reaches out to rub his nose. My father laughs and shoves the colt’s face away from him. “I know why you and Star get along so well. You were a brat just like him when you were a toddler.” I smile as Star jerks his head around. He swishes his tail back and forth. “Let’s get you some food,” I tell the horse, clucking my tongue to urge him into a canter, passing the grandstands and the giant green Rolex clock. On the way to the barns, I see Jack standing with his father. His dad writes in a notebook while Jack yawns and checks his watch. Neither of them cheers for me and Star, and that’s okay—everyone’s getting used to the rapport I have with the horse. We’re last week’s news. This week’s news is whether Star can get his first win today here at Keeneland. He’s running in The Dogwood, a race for horses that haven’t won more than two. I’d say he’s got a good shot, considering his breeding and all our hard work. The purse is $85,000. This should be easy peasy, considering how well he’s run in the past week. An outrider on an Appaloosa pony comes trotting up to me. She smiles and pats Star’s neck as the pony and Star sniff each other. “He’s a beautiful horse,” the woman says, letting Star smell the back of her hand. The colt nips at her fingers, acting silly. He nickers and nuzzles her thigh. “A flirt too, huh?” My eyes narrow. “Not usually.” “Good luck today,” the outrider says to Star, and I squeeze the horse’s girth with both heels to move us toward the barn. I meet Dad and Rory there, cool Star down, and help groom the horses before their races. I have a good feeling about today. Keeneland is a beautiful track—it’s near the Maker’s Mark distillery, and it’s nestled in the most beautiful rolling green hills you’ve ever seen. Scotland can kiss Lexington’s ass, that’s for sure. In his job as acting owner of Cedar Hill, Jack entered Lucky Strikes in a race called The Fort Harrod, which has a purse of half a mil. Every time I’ve seen Jack this week, he’s been talking about it, and it’s clear he wants to impress his father by taking risks and getting some big wins. About half an hour before Star’s race, Bryant Townsend comes into the stall to see how we’re doing. As soon as he steps inside, the horse charges him. “Whoa!” I yank Star back by the bridle. “No.” I pull him over to the window where he can look at the trees. “I’m beginning to take this personally,” Bryant says to Star, tightening his gloves. “I wouldn’t. I think I know what’s wrong with him.” And considering I’ve seen horses scared of lawnmowers, bicycles, and dandelions, what I’m about to tell Bryant isn’t much of a stretch. Dad and Rory poke their heads in the stall. “You know why he’s skittish?” Dad asks. “Men freak him out.” Dad’s eyebrows shoot straight up. “Hmm…Whitfield, Townsend, get out of here and let Savannah get the horse ready herself. We’ll meet you at the paddock.” I feed Star some grain and let him have a bit of water before I throw his saddle and silks over my shoulder and we trek out to the paddock. When I get there, I find Dad talking quietly to Jack. “Shortcake, tell Jack what you think’s wrong with his horse.” “I think he’s scared of boys…” A confused but intrigued look crosses Jack’s face. He narrows his eyes at Star. “Dad, help me get him saddled up,” I say, but Jack shakes his head at him, pulls his phone from his pocket, and walks away as he talks. Wow, I never figured Jack would turn away from a problem. Dad keeps his distance as I begin tacking the horse up. I tie his lead to a post and move to his near side to start saddling him. I put his saddle pads on, but Star is becoming increasingly difficult to control without help from a second groom. He starts prancing and acting silly again. That’s when Jack reenters the paddock with Shelby, who’s wearing a skirt and leather boots. He beckons me with two fingers. I leave Star tied to the post and go see what they want. “Did you know Shelby turned thirteen today?” “I didn’t,” I reply. “Happy Birthday!” Her cheeks blush pink. “Thank you.” “And now that she’s thirteen, it’s time she started working,” Jack says, hugging her from behind. “What? I’m not working on my birthday!” “Yes, you are.” “You can’t make me.” “I’m boss of the farm this year,” Jack says. “If you make me work, I’ll tell everyone you still sleep with your little Raggedy Andy doll under your pillow.” The horsemen stop talking. The horses stop moving. Everyone looks at Jack. I burst out laughing along with everybody else. “Raggedy Andy?” I say. His cheeks puff like a chipmunk’s. “Can you help Savannah, please?” he asks his sister, exasperated. “We really need your help.” “You do?” Shelby asks. “I think Star hates boys,” I say. “And I need help tacking him up.” “Oh. Well, why didn’t you just say so, Jack? I figured you wanted me to muck out a stall or something.” Shelby sashays over to Star in her skirt. Other horsemen in the paddock seem amused that a horse owner’s daughter is taking charge. Star behaves like a polite gentleman while Shelby and I finish getting him saddled up. And before I know it, it’s post time. Bryant Townsend mounts the horse, and sure enough, Star starts acting like a brat as they trot up to the starting gate. Jack beckons for me to walk with him up to the finish line. Our fathers and Gael trail behind us, and Shelby returns to the grandstands to sit with her mother. “Stand with me,” Jack says. Then he drops a hand onto my shoulder and squeezes, not taking his eyes off the starting gate. The gates crash open and the horses erupt into the race. Star comes out clean and charges ahead with the other horses. “Yeah!” Jack screams. The pack makes the first turn together, leaving a wake of brown dust. The field spreads out on the backstretch. Star stays with the lead group as they navigate the far turn. “You got it, boy!” I yell. Red Delight streaks to the front of the pack. Getting the Dream falls back into third. Star moves forward into the seventh position. On the straightaway, as they’re charging for the finish line, I’m gripping Jack’s arm and bouncing up and down. “Go!” I scream, and I swear, Star looks over at me and kicks it into high gear. He manages to pass Raising the Flag and Mixed Appeal but ends up in fifth place overall. Dammit.","sourceLink":"https://allnovel.net/racing-savannah-hundred-oaks-4/page-15.html","bookId":1969,"book":{"id":1969,"title":"Racing Savannah (Hundred Oaks #4)","description":"Storyline: Racing Savannah (Hundred Oaks #4) They’re from two different worlds. He lives in the estate house, and she spends most of her time in the stables helping her father train horses. In fact, Savannah has always been much more comfortable around horses than boys. Especially boys like Jack Goodwin—cocky, popular and completely out of her league. She knows the rules: no mixing between the staff and the Goodwin family. But Jack has no such boundaries. With her dream of becoming a horse jockey, Savannah isn’t exactly one to follow the rules either. She’s not going to let someone tell her a girl isn’t tough enough to race. Sure, it’s dangerous. Then again, so is dating Jack…","cover":"https://allnovel.net/images/racing-savannah-hundred-oaks-4.jpg","author":"Miranda Kenneally","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/racing-savannah-hundred-oaks-4.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:18:33 AM"}}
