{"id":70609,"no":10,"title":"Page 10","content":"“Thanks,” I mutter. “Can’t believe Coach pul ed me out.”\n “Doesn’t matter. You showed everyone your stuff.”\n “Did you talk to the Alabama recruiter?”\n He grins. “Yup.”\n “What did he say?”\n “Now’s not a good time. Focus on the game. Talk to you at home.” Mike wanders back over to the fence where the Alabama and Ohio State guys are stil standing with Carter’s dad. I wish I had my bro’s schmoozing skil s.\n We don’t let Lynchburg get a first down, so it’s already our bal . Ty runs out onto the field, making even jogging look effortless.\n The Lynchburg defense seems to relax when they see I haven’t rejoined the game. Big mistake. Big. Even though Ty’s only had one practice with our team, a practice that lasted about twenty minutes, he wil destroy Lynchburg.\n JJ hikes the bal to Ty. He takes a five-step drop and scans the field. JJ lets a defenseman get past him. On purpose, obviously. JJ would never let a Lynchburg linebacker get anywhere near me. It doesn’t matter, though, because Ty sidesteps the linebacker and launches a deep pass to Henry, who’s vying with a cornerback in the end zone. The bal sails right into Henry’s open arms.\n Shit.\n Ty just threw a forty-yard pass! God, I don’t think I could’ve done that.\n I turn to find Mike and the col ege recruiters. The coaches are speaking quickly to a gaping Mike, who says something to them. The recruiters scribble something in their notebooks.\n Ty’s name.\n Wil the Alabama guy even remember me after seeing Ty’s pass?\n After yanking his helmet off, Ty comes jogging over. He drops a hand onto my shoulder and pul s me close. I quickly shake his hand off.\n “I’m sorry, Woods,” Ty says in his thick Texas drawl.\n “It’s okay,” I mutter. “Nice pass.” After JJ hikes the bal so our kicker can take the extra point, I pul him aside. “JJ, don’t ever do that again.”\n “Do what?”\n “Let a linebacker go after a player like that. Ty could’ve gotten clobbered. Thank God it’s only Lynchburg.”\n “What the hel do you care? The dude stole your position.”\n “JJ, I don’t care if he threatens to kil my unborn children. Ty is stil part of the team. We take care of each other. Understand?” I smack JJ’s helmet hard enough to make his head hurt, to make a point.\n “Yes, ma’am.”\n “Yes, ma’am.”\n Then I see Ty talking to Duckett, who’s wearing his\n “I’m freaked out of my mind” face, so I go see what’s happening there. I hear Ty say, “You can’t interfere with a receiver like that—you just cost us fifteen yards!”\n Ty’s advice is right on, but he’s not the coach, and he’s certainly not captain. “Duckett,” I say, “You’re playing a fantastic game, but Ty’s right. Don’t let it happen again.”\n “Got it, Woods.” Duckett glares at Ty and walks away.\n “You were too nice to him,” Ty tel s me.\n “I’m the captain here. There’s a big difference between being brutal y honest and tel ing people what they need to hear. Understand?”\n Ty stares at me like he’s never taken directions from anyone before.\n I grab him by the jersey and pul him closer. “You got a problem with one of the players, you bring it to me. Understand?”\n “Sorry,” he mutters. He rubs the back of his neck, furrowing his eyebrows at me.\n “I run the field for Hundred Oaks. Not you.”\n “Understood.” Ty shoves his helmet back onto his head and runs out for our next play. Henry and JJ fol ow Ty, but once they’re gone, Carter comes over to me.\n “I don’t like this one bit, Woods,” Carter says.\n “Something’s off about that guy—he assumes way too much.”\n “It’s under control,” I reply in a tone that tel s Carter to go away, which he does. But I can’t help but wonder if Carter’s right. This is my team. It’s only our first game, and Coach has already taken me out and put in our farbetter quarterback, a quarterback who’s used to cal ing the shots and getting his way.\n But I won’t be control ed by anyone. No matter how cute he is.\n As usual, I’m the first one out of the locker room and seated on the bus. I pul out my iPod and stretch across the last row. JJ and I always sit in the last two bus benches—it’s one of those senior perks. Closing my eyes, I listen to some rap music and hope the beats wil relax me. I can’t wait to get home and hear what the recruiter said to Mike about me. Of course, he might have already forgotten about me—considering I’m only the second-best high school QB in Tennessee now. We won 42–0. Ty was nice enough to take it easy on Lynchburg, only throwing two long passes, both to Henry. Three touchdowns for Henry in one game is awesome—the col ege coaches definitely must’ve noticed that. I find myself smiling at the memory of Henry’s dance at the end of the game. In the end zone, after his third touchdown, he did this one move cal ed\n “The Lawn Mower,” where he pretends to start a lawn mower. Then he did “The Sprinkler.”\n That one got us an unsportsmanlike conduct penalty and then we had to kick off from fifteen yards back. Coach got angry about Henry’s showboating, but I didn’t care.\n Suddenly, the rest of the team gets on the bus, and the bus starts bouncing and shaking, and the other players’ yel ing distracts me from the music and my thoughts. I close my eyes again. I feel a tap on my foot, and expecting to see JJ, I look up and find Ty standing in front of me. He pushes my legs, causing me to sit up and my feet to fal to the floor, and starts to squeeze in next to me on the bench.\n “Woods likes to sit alone,” Carter cal s out. “Get your ass to your own seat.”\n Ty turns and glares. “Mind your business, Carter. I need to talk to Woods about the game.” He slides in, hip-checking me up against the window.\n Crap. I must smel awful, like a mixture of sweat, wet dog, and the odor of diesel gas that has seeped into the vinyl bus seats. But it doesn’t matter what I smel like. I can’t let my guard down with this guy, or he won’t just take over my position. He’l take over the entire team.\n “Hey,” he says, patting my knee. “Great game tonight. You’re real y good.”\n I fold my arms across my stomach. “You’re good too.”\n “I’m just glad I got to play—I love footbal so much.”\n “Me too…” I pause for a beat before adding, “I’ve loved it ever since I was five, when Dad took me to my first pro game—Super Bowl XXXI.”\n Ty smiles. “Broncos-Packers?”\n “Yup.”\n “Awesome game—my man John Elway destroyed\n Brett Favre.”\n I say, “Favre sucks,” and Ty says, “I can’t stand Brett Favre,” at the same time, and then we both say, “Jinx.” I pinch his forearm as he pinches my thigh.\n We laugh, and he leans into my shoulder, and then we smile at each other. His eyes are so blue…\n “So what did you want to talk about?” I ask.\n Ty grins that wicked smile of his again. He whispers, Ty grins that wicked smile of his again. He whispers,\n “I lied. I just wanted an excuse to sit with you.”\n Right then, Henry grabs the seat directly in front of us, quickly glances into my eyes, and then sits down and faces forward. Normal y, he hangs over the back of his seat and chats with me, but he slouches so far down in his seat that I can’t even see him.\n I put my headphones back on and recline against the vinyl seat, and Ty nestles his arm up against mine—it feels warm.\n When we get back to the school parking lot, I say goodbye to the team, knock fists with everybody, then head to my truck.\n “Yo, Woods,” Henry says as he jogs up. “Want to come to Higgins’s party with me?” He rubs his palms together, then drops his thumbs into the pockets of his jeans.\n I hurl my bag into the bed of my truck. “Thanks, but I’m gonna head home.”\n “You gonna let Ty go home with you too?” he snaps.\n “He was just sitting with me,” I mumble. What the hel is Henry’s problem?\n Henry heads toward his rusty maroon truck and turns around to face me as he walks backward. After glancing over at Ty, he locks eyes with me and says,\n “Well , you know where the real party is if you decide you don’t want to be alone.” Then he shouts to the masses, “Party at Higgins’s! Who’s with me?”\n The team erupts, and five members of Henry’s harem miraculously appear and drape themselves al over him.\n Ty comes over to me, shaking his head at Henry.\n “You going to the party?”\n “Nah,” I respond. “I’ve got to hit the sack. I’m going to my brother’s game tomorrow in Knoxvil e.”\n “That sounds cool. I’d love to see him play sometime. I enjoyed meeting him tonight—he’s nice people.”\n “Yeah—I love my bro.”\n Ty brushes his hair off his forehead. “So, um, want some company tomorrow at Mike’s game?”\n Holy shit. What an offer. But Knoxvil e is an hour and a half away. That’s way too long to be alone with Ty and my parents.\n “I’m riding to the game with my parents, Ty. Trust me, you’d rather go clothes shopping for al eternity than spend three hours in a car with them. Maybe some other time.”\n “I don’t mind riding with them.”\n “I don’t think that’s a very good idea.”\n Ty frowns and stuffs his hands in his pockets. “Did I do something to make you mad? I’m sorry Coach put me in tonight, but I don’t think that’s any reason for you to be pissed at me. You were slaughtering that team.”\n I shake my head. “It’s nothing like that.”\n “What is it then?” he blurts. He throws his head back and closes his eyes.\n Shit. So maybe I haven’t been the nicest person. But I can’t tel him why he’s distracting the hel out of me. Ty turns, starts to walk away, and waves over his shoulder. “I guess I’l see you around then.”\n “Wait, Ty—how are you getting home?”\n “I can take care of myself. I don’t need you to arrange rides for me.”\n Tears rush to my eyes. “Um, I was going to offer to take you home. And, to ask if maybe you, I mean, if you aren’t doing anything on Sunday…”\n He stops, turns, and raises his eyebrows. “Yeah?”\n “Um, would you want to go to my dad’s preseason game with me? In Nashvil e? He’s playing the Patriots. I always go when he plays New England because Tom Brady’s awesome, but don’t tel my dad I said that.”\n Ty smiles. “A Titans game? An actual NFL game?\n I’ve never been to one before.”\n That surprises me. It’s strange that someone as good as Ty has never been to a pro game. “Yeah,” I good as Ty has never been to a pro game. “Yeah,” I say, “JJ, Carter, and I are going together. And maybe Henry, if he can drag himself out of bed in time. That’s doubtful, though.” \n","sourceLink":"https://allnovel.net/catching-jordan-hundred-oaks-1/page-10.html","bookId":1966,"book":{"id":1966,"title":"Catching Jordan (Hundred Oaks #1)","description":"Storyline: \n Catching Jordan (Hundred Oaks #1) \n ONE OF THE BOYS \n What girl doesn\u0027t want to be surrounded by gorgeous jocks day in and day out? Jordan Woods isn\u0027t just surrounded by hot guys, though-she leads them as the captain and quarterback of her high school football team. They all see her as one of the guys and that\u0027s just fine. As long as she gets her athletic scholarship to a powerhouse university. \n But everything she\u0027s ever worked for is threatened when Ty Green moves to her school. Not only is he an amazing QB, but he\u0027s also amazingly hot. And for the first time, Jordan\u0027s feeling vulnerable. Can she keep her head in the game while her heart\u0027s on the line?\n \n","cover":"https://allnovel.net/images/catching-jordan-hundred-oaks-1.jpg","author":"Miranda Kenneally","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/catching-jordan-hundred-oaks-1.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:17:02 AM"}}
