{"id":70612,"no":13,"title":"Page 13","content":"“What do you mean?”\n “I mean, what’s going on with you and Ty?”\n “Nothing.”\n JJ sniggers. “Like I believe that. He can’t keep his eyes off you.”\n eyes off you.”\n “Real y?” I exclaim.\n “Duh. Look, Jordan, you’re my best friend. I don’t know how much I trust this guy,” JJ says, jerking his head at Ty, across the room. “I don’t want him stealing your position away from you or using your family to get ahead. And Carter told me what he said to Duckett on Friday. That’s not cool.”\n “I get what you’re saying, but let’s give him a chance, okay? Unless I have, like, ten interceptions in one game, Coach isn’t giving away my position. And if he tried to use me, you and Mike and Henry and Carter would al kick his ass.”\n “True…so, uh, do you like him?”\n Wow, I can’t believe JJ just asked me about my feelings. Since this is such a momentous occasion, I can’t lie, so I nod once.\n “Hot damn! I thought you’d be single for life. Figured you’d run off and join a convent.”\n “You’re such an ass,” I say, laughing. “You know, Lacey’s head over heels for you.”\n “Oh God, I’m never speaking to you again,” JJ says, darting away. I watch as he builds the biggest plate of nachos ever, big enough to feed Rhode Island.\n So JJ would stil take me seriously, as a teammate and as captain, if I had a boyfriend?\n I decide now’s a good time to rescue Ty from my mom and Mr. Taylor. When I approach the group, Mr. Taylor smiles and says, “I hear you have some competition for your position, Jordan.”\n “Yes, sir. Thanks for inviting us today,” I say. I always flatter him because I need to stay in Mr. Taylor’s good graces. They serve these amazing ice cream sundaes, and JJ lives for that nachos grande bar.\n “You’re always welcome,” Mr. Taylor says. “Your mom and brother tel me that Ty wil easily be snatched up by a big Division I team.”\n Ty frowns and rubs the back of his neck.\n I ask Mr. Taylor and Mom to excuse us, then I rescue Ty, grabbing his hand and pul ing him to my favorite seat, this cushy leather couch on the other side of the room.\n “Thanks,” he says as we flop down on the sofa. “I was dying over there.”\n “Sorry about that. JJ distracted me with the nacho bar,” I say with a laugh.\n A waiter walks up and says, “Can I get you anything?”\n “What do you want?” I ask Ty.\n “Whatever you’re having, I guess,” he responds, shrugging. He coughs.\n “We’l take two Cokes, two of those awesome hot fudge sundaes, hot wings—not the mild sauce, I mean the 911 sauce, the stuff that tastes like you’re eating lava, and a large cheese pizza,” I say.\n “Ugh,” Ty says. “Are you real y a girl?”\n I freeze. I want him to think of me as a girl, not one of those people in a professional eating contest, like Joey Chestnut—the guy who ate sixty-eight hot dogs in twelve minutes. “The food’s awesome. It’s the only reason I sit in the owner’s box instead of at field level.”\n Ty chuckles and pats my thigh. He lets his hand linger there for about two seconds, but then pul s it away and folds his hands.\n “You know,” Ty says, focusing on the massive Titans scoreboard, not meeting my eyes, “I didn’t want to come to Hundred Oaks, and I was worried about being on a team with guys I don’t know, but you’ve made me feel like I’m part of something. So, thanks.”\n “No problem.” I wipe my sweaty palms on my dress.\n “No, real y. You’re a good leader. I like that you’re serious. I like that you’re different.”\n “Thanks,” I reply, grinning at him as he continues staring at the scoreboard, keeping his strong, tan hands clasped together.\n hands clasped together.\n Just as Ty turns to smile at me, Mike’s friend Jake comes over and sits on the other side of me. Of al days, why did Mike have to bring his horndog friend to the game?\n Jake puts his arm around me. “Hey, Jor. Who’s your friend? I hope he’s not your boyfriend.”\n Ty is staring at the field, but I can tel he’s listening to Jake because he’s leaning closer to me and because the game hasn’t started yet. Players are stretching and doing final dril s. I spot Dad swinging his arms around and bouncing up and down. He looks pumped.\n “Did you need something, Jake?” I ask.\n “Just wanted to sit with the prettiest girl in the room,”\n Jake says. He leans over and plants this wet sloppy kiss on my cheek.\n “Ugh!” I exclaim, wiping slobber off my face.\n Luckily, Mike comes over to rescue me. He grabs Jake’s arm and pul s him away from us. “Sorry, Ty, there’s a reason we don’t let this guy out much.”\n When Mike and Jake are gone, Ty whispers, “Who\n the hel was that tool?”\n “That tool wil probably be a first-round pick in the NFL draft next year,” I say, shaking my head.\n “That’s Jake Reynolds?” he says, turning to stare. His eyes are opened so wide, he looks like one of those poison dart frogs. “Holy shit. He’s so awesome.”\n I laugh. “Trust me, he’s not.”\n “Seems like he likes you. Don’t you want to date a first-rounder?”\n “Excuse me while I go vomit.”\n “So you’re not interested in him?” Ty asks, smiling.\n “Hel s no. I’d rather date O. J. Simpson.”\n Ty laughs. “I’m glad to hear that…I think.”\n God, this is awkward. Lucky for me, the game starts and Ty goes nuts. I love that he’s having a great time. We total y pig out on al the food I ordered, and I can already feel my dress getting tighter. I hope Ty won’t think I’m fat.\n I’m so focused on Ty that I don’t pay any attention to my mom, my brother, or JJ. That’s okay, though, because JJ only has eyes for the Titans’ cheerleaders and his nachos. I also haven’t paid attention to the game, which I don’t realize until Ty tel s me how cool it was when Dad ran for a touchdown from the ten-yard line right before halftime. I can’t believe I missed that. Dad’s almost too old to scramble for a touchdown. At halftime, Mike comes over and squeezes in between me and Ty. “Hey, guys,” he says, putting an arm around each of us.\n “Why are you acting so weird, bro?” I ask.\n “I’m acting weird because I have an incredible piece of gossip,” Mike says in a low voice.\n “Mike, I think you should forget an NFL career and become my agent. You shouldn’t waste your schmoozing skil s.”\n Mike laughs. “The thought’s crossed my mind. So aren’t you interested to hear my news?”\n “Of course!” I say.\n “You know who Mr. Taylor’s brother-in-law is, right?”\n “No.”\n “He’s the head coach of Notre Dame.”\n “So?”\n “Mr. Taylor asked if you might be interested, sis, but I told him that Alabama’s your first choice. But I said that it would be worth it for his brother-in-law to come take a look at Ty.”\n “Thanks so much, Mike,” I say, hugging my brother.\n “Thanks,” Ty says. His eyes are darting around from the field to Mike to me to his ice cream sundae. Why’s he so nervous?\n “Cool—wel , I’l leave you guys alone. I’ve got some more chatting to do,” Mike says as he stands up and shuffles back to the bar.\n Ty rubs the back of his neck again and stares down Ty rubs the back of his neck again and stares down at the field. “This has been a weird couple of days, Woods,” he mutters.\n “Tel me about it,” I reply before thinking. Why the hel did I say that?\n “After the game today, can we go somewhere to talk? Alone?”\n Me and Ty alone?\n “Of course,” I reply, calm and professional.\n But inside?\n My heart and stomach are bouncing around like yoyos. ty’s place\n It’s not destitute.\n It’s not Trump Plaza.\n It’s a cute house\n white paint chipping off its sides\n the lawn overgrown but\n nothing a lawn mower couldn’t cure.\n Wildflowers litter the yard\n morning glory and goldenrod exploding like Skittles, but white clover in spring is my favorite\n (when I was little, Henry made me necklaces out of it). All in all,\n JJ and Henry live in squalor compared to Ty.\n But the look on Ty’s face\n tells me something is very, very wrong here.\n he knew…?\n “What did you want to talk about?” I ask as I put my truck in park. He grabs my hand and in silence, we sit here holding hands for a few minutes. He keeps opening his mouth as if he’s about to say something, then shuts it again.\n “My dad died six months ago,” he says final y.\n Surprising myself, I reach over and draw him into a hug. He lets his forehead rest on my shoulder. “I’m so sorry. What happened?”\n “Awful car wreck. Drunk driver.”\n “Is that why you moved here?”\n He pul s his body away, but keeps his arms around me. “Sort of.”\n “You said you live with your mom and sister? And grandfather?”\n “Yeah—you should come in and meet Papa. He’s great.”\n “Do I get to meet your mom and sister too?”\n He shifts in his seat and starts playing with my sunroof again. “My mom was in the car too.”\n But if she was in the car…and didn’t die…? “What happened?”\n “Um, wel , she’s, um, paralyzed?” Ty buries his eyes in the heels of his hands. “And I mean, I real y tried my best to take care of everything so my sister and I could stay in Texas…but I couldn’t…”\n “Why are you tel ing me this?”\n He drops his hands and turns to stare into my eyes.\n “We’re friends, right? I hope we are…I left everything in Texas.”\n I grab his hand. “Of course we’re friends.”\n “Well , my dad didn’t have as much life insurance as I thought he would…wel , we didn’t have much money to begin with. But Mom needs a lot of care…like, care I can’t give her? She needs a nurse.”\n “So you moved here so your grandfather could help out?”\n “Yeah…I had to sel our house in Texas…so we could afford Mom’s care. Plus my grandfather already had a job here working in a pajama factory.”\n “A pajama factory?”\n “Didn’t you know that Tennessee is, like, the pajama capital of the world?” Ty grins slightly.\n “No—I don’t wear pajamas,” I say without thinking. Ty coughs. “What?”\n “Uh, I meant I wear, like, workout clothes to bed—you know, T-shirts and mesh shorts and shit.”\n “Right…” Ty says, smirking. Ty’s signature smirk is about the sexiest thing on the planet.\n “I wear clothes to bed!” \n","sourceLink":"https://allnovel.net/catching-jordan-hundred-oaks-1/page-13.html","bookId":1966,"book":{"id":1966,"title":"Catching Jordan (Hundred Oaks #1)","description":"Storyline: \n Catching Jordan (Hundred Oaks #1) \n ONE OF THE BOYS \n What girl doesn\u0027t want to be surrounded by gorgeous jocks day in and day out? Jordan Woods isn\u0027t just surrounded by hot guys, though-she leads them as the captain and quarterback of her high school football team. They all see her as one of the guys and that\u0027s just fine. As long as she gets her athletic scholarship to a powerhouse university. \n But everything she\u0027s ever worked for is threatened when Ty Green moves to her school. Not only is he an amazing QB, but he\u0027s also amazingly hot. And for the first time, Jordan\u0027s feeling vulnerable. Can she keep her head in the game while her heart\u0027s on the line?\n \n","cover":"https://allnovel.net/images/catching-jordan-hundred-oaks-1.jpg","author":"Miranda Kenneally","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/catching-jordan-hundred-oaks-1.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:17:02 AM"}}
