{"id":70615,"no":16,"title":"Page 16","content":"As idiotic as this assignment is, I can’t help but smile at their exchange. Henry is the funniest guy I know, the funniest person I’ve ever met. Only he would pretend to take this assignment so seriously. I jog up into the metal bleachers, taking two steps at a time until I reach Mom and Henry.\n “Why, Jordan, you didn’t tel me I was going to be a grandmother,” Mom says, flashing a smile at Henry.\n “I didn’t know either,” I say. “Henry hid the pregnancy from me. Do you mind watching that creepy thing during practice, Mom?”\n Henry grabs his chest. “That creepy thing is our son, Woods.”\n “I don’t mind,” Mom says. She nods at something over my shoulder. “Looks like Coach Mil er wants you two down there.”\n “Thanks, Mom!” Henry says. It seems that Jerry Rice has put Henry back in a good mood again. He throws an arm around me as we walk back toward the field.\n “So, what did Ty want?”\n “To thank me for taking him to the game yesterday.”\n “That’s it?” he whispers.\n “No…”\n “I’m your wife, you can talk to me, Woods.”\n “Yesterday, when I dropped him off at home, he, like, um, leaned in for a kiss?”\n “And?”\n “So, I, uh, told him I had to go.”\n “You didn’t kiss?”\n “Nope.”\n Henry grabs my elbow, stopping us from going farther. “Why’d you do that? Don’t you like him?”\n “Yeah…I was scared, I guess. I dunno.” I stare down at a piece of gum that’s melted onto the metal bleachers.\n “De-nied,” Henry says. “God, I can’t even imagine leaning in for a kiss and getting rejected. Ty must feel like shit today.”\n Shrugging, I grunt.\n “So did he try to kiss you again just now? Or talk to you about the non-kiss?”\n “No—he wanted to know if we’re together,” I say, laughing loudly and using my thumb to point from Henry back to me.\n “You and me?”\n “You and me?”\n “Yeah, he wanted to know if you and I are dating. I told him we’re best friends.”\n “Yeah, he definitely wants you.”\n I glance at Henry sideways. His face is blank, like no smile or anything. “You think?” I whisper.\n “I know.”\n Henry looks from my face back to the field, and his eyes pop open wide. I turn to see why he’s gaping: JJ\n and Carter are messing around, trying to shove a scrawny wide receiver into Jerry Rice’s strol er.\n “JJ!” Henry yel s, “You can’t fit a freshman in that strol er.”\n Later that night, after a couple hours at the batting cages with Carter and JJ, Henry and I are in my basement having a mad foosbal tournament. It’s best three out of five games. I’ve won two; he’s won one. In the current game, game four, I’m kicking his ass. Jerry Rice, with his creepy eyes wide open, is sleeping quietly in his strol er. Monday Night Football is blaring on the big-screen television in the corner. We’re watching the Jets/Dolphins game and rooting for the Dolphins, of course.\n “Can I stay over tonight?” Henry asks. Light from the television bathes his blond curls, making them shimmer.\n “Course.”\n “I figure it’l be easier for us to take care of Jerry Rice that way,” he says. “We can alternate the middle of the night feedings.” He twirls the bar, hitting the tiny white bal into my goal.\n “Why are you taking this so seriously? We could leave Jerry Rice in my truck overnight so we wouldn’t have to hear him cry.”\n “I want a good grade.”\n “You did total y botch that corn bread assignment.” I hit the bal toward Henry’s goal, and his little wooden goalie blocks it. “I can’t believe you got an F in corn bread.”\n “Most people can make it through life without having to be good at making corn bread. Being a parent is different.”\n “Yeah,” I say, knowing how much my dad can suck sometimes. Henry and I are both lucky to have such great moms. At least Henry’s dad isn’t an asshole—\n he’s just never home. Like my dad, Mr. Henry hasn’t been to one of our footbal games in forever.\n I slam the bal into Henry’s goal, winning the game. I throw my hands above my head and strut around the room, victorious. Cupping my hands around my mouth, I make fake crowd noises. “And Woods wins it al !”\n “Quiet! You’re going to wake the baby,” Henry says with a laugh. He flops down on one of the leather sofas and picks up his glass of lemonade. I pour myself another glass, then grab a few chocolate-chip cookies, sit down, and prop myself up against him. He wraps an arm around me, leans over, and grabs a cookie from my hand with his teeth.\n “Thief!”\n “Pig!”\n The middle of the night rols around, and Jerry Rice is screaming. Henry’s bare feet are in my face, so I knock them out of the way as I sit up. Jumping out of bed, I grab the stupid dol from its strol er and force the lead rod into its mouth. Then I plop back down on the bed. It turns out that you can’t just leave the key in its mouth. You have to, like, hold the fake baby at the same time or it wil keep crying.\n I sit back against my headboard and hold the dol in my arms. If I didn’t have the fake baby right now, I’d total y be writing in my journal about Henry.\n He’s fast asleep, curled up at the other end of my bed, looking peaceful. The expression on his face says he’s not real y sad, and he’s not overcompensating for his sadness by acting al crazy or sil y, he’s just…\n content. And that makes me glad, because more than anything else, I want him to be happy. Part of me doesn’t even want him to wake up, because I know he’l eventual y go back to being depressed about Carrie, or whatever the hel he’s depressed about. If only he’d talk to me…maybe I could help.\n My head droops down, and I accidental y drop the metal rod and Jerry Rice starts crying again. Henry stirs. Sitting up, the bedcovers fal down to reveal the plastic footbal charm and his six-pack.\n Is Ty’s body that perfect? I wonder how many times Kristen has already seen his abs…\n “What’s up, Woods?” Henry says, rubbing his eyes with fists.\n “I dropped the metal rod, that’s al .” I cradle the stupid dol again.\n Henry crawls up and throws an arm around me, pul ing me in tight. Closing my eyes as I lean against his shoulder, it occurs to me that Henry is going to be a great dad one day. Not unsupportive like my dad or nonexistent like his.\n Just a real y great dad.\n opportunity\n the count? 12 days until alabama\n It’s Thursday, and as is tradition, JJ and I are sitting at Joe’s Al -You-Can-Eat Pasta Shack. I’m playing the salt-and-pepper-shaker game and JJ is scribbling in his crossword-puzzle book.\n “I can’t believe you’re already doing a photo shoot for Alabama,” JJ says. “Crazy.”\n “I know, right?”\n “I’m proud of you, Woods.”\n “Thanks, man.”\n JJ jots on the puzzle and asks, “Ready for the game?”\n I shrug, yawning. “I’m tired from dealing with stupid Jerry Rice al week.”\n “Where is that baby of yours?” JJ asks, looking under the table, as if I’d actual y put a baby down there.\n “He’s with his mother, who’s probably sleeping with Marie Baird right now.” I rol my eyes as I stack the pepper on top of the salt.\n “She’s a damn nice piece of ass.”\n “Don’t be such a pig, JJ.” I pul salt out from under pepper, which fal s to the table perfectly.\n “Yes, ma’am,” he says, before burying his nose in the crossword puzzle again.\n I’m so sick of Henry’s mood swings and his sleeping around, but I won’t mention that to JJ. Two nights this week, Henry showed up at my house past midnight and crawled into my bed. I told him that I’l kick his ass if we play like shit tomorrow night, because I haven’t had a good night’s sleep in over a week, thanks to Jerry Rice’s constant crying and my being stressed out by both Ty and Henry.\n It’s like JJ knows what I’m thinking, because he looks up from his crossword-puzzle book, smiles wickedly, and says, “You hooking up with Ty Green yet?”\n Stacking pepper on top of salt, I shake my head.\n “Nah.”\n JJ furrows his eyebrows. “Wel , why the hel not? I thought you guys were gonna start going at it in the owner’s box on Sunday. You couldn’t keep your hands off each other.”\n Shit. It was that obvious?\n Honestly, I’ve been avoiding Ty since Monday, and he’s backed off. Hasn’t approached me in days, which is kinda good, but kinda sucks ass at the same time. I sit up straight and say, “Ty’s already hooked up with Kristen, and he can get whatever he wants from 99.9\n percent of the girls at school.”\n “So?”\n “So why should I be any different? I don’t wanna be another random girl to him.”\n “What’s wrong with just fooling around?”\n “First of al , we’re on the same team, and second, unlike you and Henry, I’m not a man-whore and wouldn’t want to be a one-night stand.”\n “Then I’l kick his ass if he does that to you,” JJ\n growls, clutching his pen.\n “I know, I know,” I say, putting my hands up in the air as if I’m being arrested. “Look, I’m just going to focus on playing bal . Okay?”\n “Whatever you want, Woods…” JJ grins slightly and shakes his head.\n I fold my arms across my chest. “Getting a col ege scholarship should be my number one priority, not hooking up.”\n JJ keeps smiling at his crossword book, obviously trying not to laugh at me. “What’s a four-letter word for a soothing plant?”\n Shrugging, I say, “I dunno…weed?”\n He points the pen at me. “Right on.”\n “Are you sure about this?” I ask, staring at myself in the mirror.\n One of the Coffee Calendar makeup artists has completely straightened my hair—it fal s down my back like a stream of water from a faucet. And now the lady’s dabbing foundation al over my face. Another woman brushes some pink shit onto my lips.\n “Perfectly sure,” the woman replies. “You look great.”\n “What does it matter? Aren’t you taking a picture of me wearing a helmet?”\n “Not exactly.” She passes me an oversized Alabama jersey and a pair of short shorts. “Wear these.”\n I burst out laughing. “You must be joking.”\n The woman purses her lips at me, obviously getting sick of dealing with a girl who doesn’t want to play dress-up. Or in the case of these clothes, dressing down, meaning barely wearing anything.\n But if this is what the Alabama athletic director wants, this is what he’l get.\n I walk into the bathroom and put on the jersey and short shorts, and then walk back out into the locker room, where I find Carrie and Marie. \n","sourceLink":"https://allnovel.net/catching-jordan-hundred-oaks-1/page-16.html","bookId":1966,"book":{"id":1966,"title":"Catching Jordan (Hundred Oaks #1)","description":"Storyline: \n Catching Jordan (Hundred Oaks #1) \n ONE OF THE BOYS \n What girl doesn\u0027t want to be surrounded by gorgeous jocks day in and day out? Jordan Woods isn\u0027t just surrounded by hot guys, though-she leads them as the captain and quarterback of her high school football team. They all see her as one of the guys and that\u0027s just fine. As long as she gets her athletic scholarship to a powerhouse university. \n But everything she\u0027s ever worked for is threatened when Ty Green moves to her school. Not only is he an amazing QB, but he\u0027s also amazingly hot. And for the first time, Jordan\u0027s feeling vulnerable. Can she keep her head in the game while her heart\u0027s on the line?\n \n","cover":"https://allnovel.net/images/catching-jordan-hundred-oaks-1.jpg","author":"Miranda Kenneally","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/catching-jordan-hundred-oaks-1.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:17:02 AM"}}
