{"id":70601,"no":2,"title":"Page 2","content":"Back at home, I take a seat at the kitchen table and open my playbook. I peel a banana as I study the formation for Red Rabbit, this crazy cool flea-flicker play Coach wants us to try tomorrow. It’l be hard, but Henry and I can pul it off.\\n\\n Mom comes in, lays her pruning shears and gardening gloves on the counter, and then pours a glass of water. “Why didn’t you go out with your friends tonight?”\\n\\n “I’m not ready for opening game,” I reply, training my eyes on the X s and O s scrawled across the paper.\\n\\n “From what I’ve seen at practice, you’re definitely ready. I don’t want you to burn out.”\\n\\n “Never.”\\n\\n “Maybe you need a massage. A spa day…so you’l\\n\\n be al fresh and relaxed for Friday. We could go on Thursday after I’m done volunteering at the hospital.”\\n\\n I slowly lift my head to stare at Mom. Yeah, I’m sure the guys would take me seriously if I show up with pink fingernails on Friday night. “No, but thanks.” I give her a smile so I won’t hurt her feelings.\\n\\n She smiles back. “What are you planning to wear on your trip to Alabama?”\\n\\n I shrug. “I dunno. Cleats? And my Hundred Oaks sweats?”\\n\\n Mom sips her water. “I was thinking maybe we could go shopping for a dress.”\\n\\n “Nah, but thanks.”\\n\\n God, if I wore a dress, the Alabama guys would laugh me right out of Tuscaloosa, right back to some pitiful Division I school. “The Alabama head coach is a big Baltimore fan. Maybe I’l wear a Ravens jersey.”\\n\\n Mom laughs. “Dad would kick you out of the house.”\\n\\n “Why am I kicking my daughter out of the house?” the great Donovan Woods asks as he comes into the kitchen and gives Mom a kiss and a hug.\\n\\n “No reason,” I mutter and flip a page in my playbook. Dad grabs a bottle of Gatorade, the strawberry-plum shit he does advertising for, and takes a gulp. He’s stil buff as ever, but his black hair has started to turn saltand-peppery. At forty-three years old, Dad has tried to retire after each of the five previous seasons, but he always comes back for some reason or another. Over the years, this has become a joke to sportscasters, so unless we want to get yel ed at, we never ask when he’s actual y going to retire.\\n\\n He stares down at my playbook and shakes his head.\\n\\n “You coming to my game on Friday?” I ask Dad.\\n\\n He looks at Mom when he replies, “Maybe. I’l think about it.”\\n\\n “Okay…”\\n\\n “How about I take you and Henry fishing on Saturday morning before we go to your brother’s game?” Dad smiles at me expectantly.\\n\\n What total bul shit. He’l go to Mike’s game, but won’t come to mine? And he tries to suck up by asking me to go fishing?\\n\\n “No thanks,” I say.\\n\\n The grin dissolves from Dad’s face. “Maybe next The grin dissolves from Dad’s face. “Maybe next weekend then,” he says softly.\\n\\n “And maybe you could come to my game on Friday,”\\n\\n I mumble to myself. “Mom, where’s Mike?” I’m anxious to start watching more Alabama film. Even though I’ve watched hundreds of col ege and pro games, I love getting an expert opinion and, wel , Dad’s never wil ing to give it.\\n\\n “Oh,” Mom replies. “His coach cal ed a team meeting. Mike said to tel you he’s sorry.”\\n\\n “That’s cool,” I say quietly.\\n\\n Mom starts tel ing Dad al about her roses and sunflowers, gesturing out the kitchen window toward the garden. “The sunflowers have almost reached a state of Zen, don’t you think?”\\n\\n Dad wraps his arms around Mom, and I swear I hear him murmur, “I’m in a state of Zen right now too.”\\n\\n Before I reach a state of upchuck, I grab my playbook and a package of chocolate-chip cookies and head downstairs to our basement, where I turn on the TV and put in a DVD of last year’s national championship game—Alabama vs. Texas.\\n\\n I flip off the lights, settle down on one of the leather sofas, and dig into the cookies as I push the play button on the remote.\\n\\n So. My friends are off hooking up with cheerleaders. My dad cares more about sunflowers reaching a state of Zen than my feelings.\\n\\n At least I’ve got footbal .\\n\\n It’s been my life since I was seven, but sometimes Henry says I need to spend less time focusing and start “living life like I’m going to hel tomorrow.”\\n\\n But I feel like a normal teenager. Wel , as normal as I can be. I mean, obviously I think Justin Timberlake is a mega-hunk, but I’m also over six feet tal and can launch a footbal fifty yards.\\n\\n Other ways I’m not normal?\\n\\n A girl who hangs with an entire footbal team must hook up al the time, right?\\n\\n Nope.\\n\\n I’ve never had a boyfriend. Hel , I’ve never even kissed a guy. The closest I’ve ever come to a kiss happened just this past summer, but it was a joke. At a party, one of those cheerleaders suggested we al play a game of seven minutes in heaven, you know, the game where you go into a closet and kiss? Somehow Henry and I got sent into the closet together, and of course we didn’t kiss, but we ended up in a mad thumb-wrestling match. Which turned into a shoving match. Which turned into everyone thinking we’d hooked up in the closet. Yeah, right. He’s like my brother.\\n\\n It’s not that guys aren’t interested in me, because they are, it’s that most of the guys I know are either: 1. Shorter than me;\\n\\n 2. Pansies;\\n\\n 3. On my team;\\n\\n 4. Al of the above.\\n\\n I would never let myself date guys on my team. And I’m not interested in any of them anyway. Riding buses to and from games for years has turned me off to al of them ’cause one bus ride with my team produces more gas than a landfil .\\n\\n Besides, I don’t have time for guys, and if I suddenly were to start acting like a girl, the team might not take me seriously. And I can’t afford to lose my confidence\\n\\n —because I’m the star of the Hundred Oaks Red Raiders.\\n\\n The star Alabama wil love on Friday night.\\n\\n knee problems\\n\\n the count? 20 days until alabama\\n\\n “Take five,” Coach cal s out.\\n\\n Wednesday afternoon. Two days until our opening game.\\n\\n I rip my helmet off, jog over to the bench, take a seat, and open my playbook.\\n\\n “Woods,” Henry says, sliding up next to me on the bench. “Take a break.”\\n\\n “I couldn’t get the timing for the screen pass right.”\\n\\n He leans over onto his knees and spits between his cleats. “You saved the play by handing off to Bates. Don’t be so hard on yourself.”\\n\\n “How can you be so calm?”\\n\\n Looking over at me, his blond curls fal into his eyes.\\n\\n “I’m not scared for you. You’re the best player in Tennessee.” He laughs. “But me, I should be learning how to drive a semi like my dad or practicing how to say, ‘Attention Wal-Mart shoppers, do not, I repeat, do not go in the men’s restroom until further notice. We’ve had an atomic disaster.’”\\n\\n I laugh. “Stop. You’re the fastest person I know—if you can’t get a scholarship to play bal in col ege, no one can. You’re a kickass wide receiver, and you’re smart.”\\n\\n Smiling, he leans back and folds his hands on top of his stomach. “Are we stil on to do something after practice?”\\n\\n “I should watch more film…”\\n\\n “Woods, you promised!” He scrunches up his face at me.\\n\\n “I doubt Liz Heaston and Ashley Martin partied much in high school.”\\n\\n “I’m not talking about partying. I’m talking about you and me hanging out—same ole, same ole. Besides, they were kickers. It doesn’t take a lot to kick an extra point.”\\n\\n “And look at them! Liz Heaston? Two extra points in her whole col ege career! And that was just Division II. And Ashley? Wel , sure. She kicked three in a game. And that was Division I—Jacksonvil e State, but stil .” I shake my head. “I wanna play for real.”\\n\\n “But we’ve barely seen each other in a week,” he says quietly, and I think about how much it would suck to achieve my dream of playing for Alabama but have no one to share it with, ’cause my best friend has found better stuff to do.\\n\\n “Forget the film—we’l go out. Just us, right?”\\n\\n “Of course.” He leans over onto his knees and says,\\n\\n “So what do you think of Marie Baird?”\\n\\n “She’s better than Kristen, I guess.”\\n\\n “I’m thinking of asking Marie out.”\\n\\n “What happened to Samantha?”\\n\\n Henry focuses on the ground and kicks a rock. “I dunno…the sex is okay…but I don’t real y like her.”\\n\\n “Why do you keep sleeping with girls you aren’t dating? Isn’t this, like, three girls since Carrie Myer dumped you? Why don’t you just get back together with her?”\\n\\n Henry’s face grows pink, pinker than those ridiculous bras Mom recently left on my bed when she decided I needed something more feminine than a sports bra.\\n\\n “Marie seems real y cool…”\\n\\n “You mean for actual dating, not just fooling around?”\\n\\n “Maybe.”\\n\\n “I like Carrie.” Of al the girls I know, she’s the only one I consider a friend. When we started ninth grade, the first day in the locker room after practice was a true nightmare. I made the mistake of changing out of my uniform in front of the cheerleading captain, who proceeded to make fun of my flat chest in front of twenty other girls. And Carrie, a brand-new freshman twenty other girls. And Carrie, a brand-new freshman cheerleader, walked up to the captain and told her to knock it off, which took mucho guts.\\n\\n “I bet you’d like Marie too if you’d give her a chance.”\\n\\n I shrug, thinking I’m not hanging out with anyone who’s friends with Kristen Markum. “Why did Carrie dump you anyway?”\\n\\n “I’ve told you, Woods. It’s private.”\\n\\n “But we’ve never kept secrets from each other.”\\n\\n “Then why won’t you tel me why you hate Kristen so much?” He smiles, and I punch him in the arm. “Truce!”\\n\\n he says, rubbing his bicep. “So do you wanna go to the Fun Tunnel and play skee-bal ?”\\n\\n “Perfect. Then dinner at my house?”\\n\\n “Hel , yeah. It’s fried chicken night, right?”\\n\\n “You’d better believe it.”\\n\\n Henry usual y eats at our house a few nights a week, and sometimes he sleeps over. Technical y, he’s supposed to stay in the guest room, but he’s been sneaking into my room since we were eight. When Mom found out, she started forcing him to sleep headto-toe with me. To make me laugh, he always has excuses as to why we should be al owed to sleep head-to-head, like it’l be easier for him to protect me if an attacker were to come in, or because my feet reek.\\n\\n “Break’s over!” Coach shouts. “Woods!”\\n\\n Jumping to my feet, I sweep my long blond hair back up into my helmet and jog over to the fifty-yard line.\\n\\n “’Sup, Coach?”\\n\\n “Try out the hook and lateral play we talked about.”\\n\\n “’Kay.” This is not an easy play, but Henry and I can handle it. I’m supposed to throw a short pass to Henry and as the defense moves in to tackle him, he pitches it to a running back who plows up the middle. \\n\\n","sourceLink":"https://allnovel.net/catching-jordan-hundred-oaks-1/page-2.html","bookId":1966,"book":{"id":1966,"title":"Catching Jordan (Hundred Oaks #1)","description":"Storyline: Catching Jordan (Hundred Oaks #1) \\n ONE OF THE BOYS \\n What girl doesn\u0027t want to be surrounded by gorgeous jocks day in and day out? Jordan Woods isn\u0027t just surrounded by hot guys, though-she leads them as the captain and quarterback of her high school football team. They all see her as one of the guys and that\u0027s just fine. As long as she gets her athletic scholarship to a powerhouse university. \\n But everything she\u0027s ever worked for is threatened when Ty Green moves to her school. Not only is he an amazing QB, but he\u0027s also amazingly hot. And for the first time, Jordan\u0027s feeling vulnerable. Can she keep her head in the game while her heart\u0027s on the line?\\n","cover":"https://allnovel.net/images/catching-jordan-hundred-oaks-1.jpg","author":"Miranda Kenneally","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/catching-jordan-hundred-oaks-1.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:17:02 AM"}}
