{"id":25935,"no":10,"title":"CHAPTER X The Fouled Propeller","content":"A sudden jar that shook the Olivette from stem to stern promptly dislocated the trend of the two Scoutmasters\u0027 surmises. For thirty seconds or more the motors laboured heavily, until Warkworth, who was taking his trick in the engine-room, declutched and cut off the ignition. The Sea Scouts on deck gave inquiring glances at Mr. Armitage; but, true to his principles of letting the lads act on their own initiative, he gave no solution for the cause of the mishap or any suggestion as to what ought to be done. Presently Woodleigh grasped the reason for his Scoutmaster\u0027s silence. It was \"up to\" the Patrol Leader to act. \"Motor all right, Warkworth?\" he inquired. \"Yes,\" was the reply. \"I switched off because I fancy something\u0027s fouled the propeller. Send somebody down, and we\u0027ll try to turn the shaft round by hand.\" Desmond volunteered to assist Warkworth. The removable floor-boards over the shaft were taken up, and both lads, by means of pipe wrenches, tried their hardest to turn the massive metal rod, which in ordinary circumstances could be moved with very little effort. \"Prop\u0027s foul of something,\" announced Warkworth. Woodleigh and most of the Sea Scouts on deck were aft. By this time the Olivette had lost way and was rounding-to broadside on to the now slight breeze. Lying at full length, and leaning over the short counter, the Patrol Leader could discern the three-bladed propeller, its boss a couple of feet beneath the surface. \"There\u0027s rope wound round it,\" he declared, \"about half a dozen turns. Get a boat-hook, somebody; I think I can get it off.\" Hayes brought the desired article. With a couple of fellows holding on to his legs the Patrol Leader tried for a full five minutes, until, red in the face and cramped in body and limbs, he desisted from his unsuccessful attempt. \"The stuff\u0027s as hard as a chunk of iron,\" he announced. \"I\u0027ll get Warkworth to start up again and put the gear into the reverse. That might throw the rope clear. Stand by with that dinghy\u0027s painter: we don\u0027t want that fouled as well.\" The motor being warm it did not take long to restart even on paraffin. Then Warkworth let in the clutch in the reverse, and, although the engine did not labour quite so much, the desired result was not attained. An examination of the propeller, after the motor had been running for a couple of minutes, revealed the disconcerting fact that the rope was still wound tightly round the boss. In the ahead position the undue strain on the shaft almost pulled the engine up dead. \"I suppose the only thing to be done is to set a square-sail and make either for Torquay or Brixham,\" remarked Woodleigh. \"We\u0027re bound to get a tow in, and at low tide we can cut the rope away.\" \"Then we won\u0027t make Plymouth to-day,\" added Flemming. \"Let me have a cut at it, Woodleigh,\" said Jock Findlay quietly. \"How?\" asked the Patrol Leader. \"By diving for it,\" replied Jock. Findlay was the champion diver of the 9th Southend Troop of Sea Scouts. Only a few weeks previously he had carried off first prize in a plate-diving competition in fifteen feet of water. One rival came to the surface with twelve tin plates. Another brought up sixteen. When Findlay reappeared after he dived he held eight plates in his hand; and while the onlookers, who regarded Jock as the favourite, were showing their surprise at the small number Findlay had handed over, the wily Sea Scout produced another twelve from the inside of his bathing-dress. \"Can you?\" queried the doubting Woodleigh. \"You\u0027ll be knocked out if the counter gives you a crack. The boat\u0027s rolling a bit.\" \"I\u0027ll risk that,\" rejoined Findlay, who was already divesting himself of his clothing. \"Will that lad be all right, do you think?\" asked Mr. Armitage in an aside. \"Quite,\" replied Mr. Graham, with firm conviction. \"He\u0027s like a young eel in the water.\" \"All my lads are good swimmers,\" observed Mr. Armitage, \"but curiously enough they are indifferent divers. Woodleigh, for instance, always shuts his eyes when diving. He says he cannot open them while under water. It\u0027s pure fallacy, although I know plenty of people who say the same thing.\" Meanwhile Findlay, looking like a young Apollo, was whetting his knife on the palm of his hand. \"No chance of that propeller revolving?\" he inquired. \"Motor\u0027s stopped,\" replied Woodleigh. \"You\u0027ll be all right as far as that is concerned; but for goodness\u0027 sake mind you don\u0027t get a biff on the head.\" Jock made a clean, graceful dive over the counter, and, reappearing almost at once, swam towards the stern. Awaiting his opportunity he grasped the upper edge of the rudder and drew himself beneath the surface. For thirty long-drawn-out seconds Findlay remained submerged; then he reappeared about a couple of yards from the boat. image: IMAGENAME1 [Illustration: \"ALL CLEAR!\" HE ANNOUNCED, EXHAUSTED AND TRIUMPHANT Page 105] \"Heave me a line,\" he called out breathlessly. \"I\u0027m all right—don\u0027t want to hang on to the boat—she\u0027s rolling too much—rope\u0027s hard as wire—I\u0027m cutting it through.\" Five times the plucky Sea Scout returned to the attack. Pieces of frayed grass rope drifting alongside gave evidence of the progress of his labours. Finally he broke the surface, with a short length of rope in one hand and his knife in the other. \"All clear!\" he announced, exhausted and triumphant. \"Give me a hand, Desmond.\" He had not the strength left to clamber up the side, but willing hands caught him and hauled him on deck to the accompaniment of a rousing cheer from the Olivette\u0027s crew. \"Plucky lad, that!\" exclaimed Mr. Armitage. \"Yes,\" admitted Mr. Graham proudly. \"There is one thing in which the Southend Sea Scouts can give points to the Milford fellows, and I know you won\u0027t begrudge them that.\" \"No,\" rejoined Mr. Armitage. \"Your lads have more than earned their passage.\" And the welcome purr of the motor, as the Olivette once more forged ahead in her normal style, emphasized the justice of the Scoutmaster\u0027s sentiments.","sourceLink":"http://novel.tingroom.com/duanpian/2714/74609.html","bookId":1437,"book":{"id":1437,"title":"Sea Scouts up-Channel","description":"简介： It\u0027s going to be a dirty night, remarked Mr. Graham, Scoutmaster of the 9th Southend-on-Sea Sea Scouts. Not very promising for the first day of our holidays....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2714","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
