{"id":25949,"no":24,"title":"CHAPTER XXIV Refusing a Tow","content":"\n At the appointed time, the Spindrift\u0027s crew was augmented by the arrival of Bedford and Coles. The new members were delighted with the yacht and her surroundings. The only grievance—if grievance it can be termed—was that their share of the voyage had been shortened by the distance from Plymouth to Dartmouth. \n \n \"Well, what\u0027s the news from Wootton?\" inquired Mr. Graham, after the two Sea Scouts had taken in the details of their new acquisition, and had been told of her exciting run round The Land. \n \n \"Everything\u0027s all serene, sir,\" replied Bedford. \"Patrol Leader Bradley has got the rest of the Troop well in hand. Makes them do physical jerks every morning before breakfast. We had to before we came away at nine o\u0027clock.\" \n \n \"You look very fit, Bedford,\" said Desmond. \"You\u0027ve worked down a lot of your fat.\" \n \n \"And you haven\u0027t put any on,\" retorted Bedford, looking at the lean, weather-beaten features of the Patrol Leader. \n \n \"And how are the Collinsons?\" asked Mr. Graham. \n \n \"Mr. Collinson\u0027s doing well, sir,\" replied Bedford \"His arm is mending rapidly. He told me the other day that we were so jolly handy that he meant to ship a couple of Sea Scouts on board his yacht instead of a paid hand. When do we start, sir?\" \n \n \"At daybreak to-morrow,\" answered the Scoutmaster. \"The glass is high and steady, and the weather forecast—if that\u0027s anything to go by—is for westerly winds of moderate strength. We\u0027ve a goodish run across West Bay, and I want to be well to the east\u0027ard of Portland Bill by the early evening.\" \n \n Grey dawn was appearing over the Devon hills when the crew of the Spindrift turned out. \n \n \"Isn\u0027t it cold for August!\" exclaimed Bedford, swinging his arms. \n \n \"You\u0027re cold, eh?\" rejoined the Patrol Leader, jumping at the opportunity afforded by Bedford\u0027s remark. \"Right-o; nip below and start up the stove. You\u0027re cook of the day.\" \n \n The Sea Scout obeyed readily enough. By the time the rest of the crew had uncoated the mainsail, got the headsail and mizzen ready to hoist, and had broken out and stowed the kedge, the \"galley-slave\", as Hayes termed the youth told off for cooking meals, reported that hot cocoa was ready. \n \n A large cup of the sustaining beverage and a couple of very hard biscuits provided the \"stand-by\" to commence the working day, as breakfast was to be served while under way. \n \n The little motor acted admirably, in spite of the cold, starting up at the first swing of the fly-wheel. \"All ready?\" shouted the Scoutmaster. \n \n \"Ay, ay, sir!\" \n \n \"Heave her up.\" \n \n The pawls of the winch clattered merrily as the cable came home. Presently the big galvanized anchor appeared above the surface. Findlay promptly caught the gravity-band shackle with the lower block of the handy-billy, and in double quick time the \"killick\" was secured on deck. \n \n By this time the Spindrift was forging slowly ahead, and the hitherto fully occupied lads had an opportunity of seeing the last of Dartmouth for no doubt a considerable time. \n \n Within the harbour the water was as calm as a millpond, save for the rippling wake of the outward bound yacht. Outside, the sea was dancing under the influence of a light westerly breeze, which promised to grow in strength as the sun rose higher. \n \n Sail was now set, and the engine switched off. \n \n Desmond, as sailing master, told off Hayes for the first two hours at the helm. \n \n \"Keep the East Blackstone on your port bow,\" he cautioned. \"When that\u0027s abeam, we\u0027ll set a compass course.\" \n \n \"May we fish, sir?\" asked Findlay. \"We heard last night that there are shoals of mackerel off the East Blackstone.\" \n \n \"Certainly,\" replied Mr. Graham. \"Only take care to keep your hooks clear of the main and mizzen sheets!\" \n \n Findlay had brought mackerel hooks and spinners. Quickly two lines were paid out, one on each quarter, Jock tending one and Coles handling the other. \n \n The Spindrift was now moving just at the right speed for this sort of work. In less than a minute a jerk of the line nearly pulled it out of the Tenderfoot\u0027s hand. Hauling in the line he secured a good-sized fish. \n \n Coles caught a dozen before Findlay hooked his first fish, which puzzled and chagrined the latter considerably. \n \n \"Perhaps it\u0027s because my line is to lee\u0027ard,\" suggested Coles. \"Take mine, and I\u0027ll try my luck with yours!\" \n \n The exchange was effected, but still Coles was the lucky one. In less than an hour he had secured twenty-one mackerel to Findlay\u0027s four. Then, contrary to expectation, the breeze died utterly away, and the lines no longer trailed astern. \n \n \"We\u0027ve caught enough, anyway,\" remarked Findlay, coiling away his lines. \n \n \"Yes, mackerel fresh from the salt sea for breakfast,\" added Desmond. \"I\u0027m jolly glad it\u0027s not my turn to be cook.\" \n \n That post on board was no sinecure, and there was no competition for the job; but whoever took it did the work cheerfully and generally well. The Sea Scouts believed in the maxim: \"a well fed crew makes a happy ship \". \n \n For the next two hours the Spindrift\u0027s progress was tediously slow. Breakfast was cooked and eaten, and the plates and dishes washed up and stowed away, before the breeze sprang up; and Berry Head and the red cliffs of Devon were still plainly visible. \n \n \"Rather slower than when we passed here last time, sir, in the Olivette,\" remarked Desmond. \n \n \"But we\u0027ve the best part of the day before us,\" Mr. Graham reminded him. \n \n \"We\u0027re afloat,\" declared Bedford. \"That\u0027s the main thing.\" \n \n He no longer had cause to complain of the cold. The day grew hotter and hotter as the sun rose and the wind dropped, till by ten o\u0027clock the thermometer in the cabin registered 90 degrees. \n \n So far the Spindrift was not alone. She was in company with nearly twenty Brixham trawlers, all practically drifting. They made a pretty sight, with their huge tanned sails casting shimmering reflections on the gently heaving water. \n \n At noon the wind sprang up again and quickly rose to a fresh sailing breeze from the sou\u0027-west. Sheets were soon trimmed, and once more the \"kick of the helm \"—that delightful sensation to keen sailor-men—asserted itself. \n \n It was not until four in the afternoon that Portland Bill became visible. It was now too late to attempt to round the Bill close to and make for Portland Harbour. To have attempted to do so would have resulted in the little craft being swept into the dreaded Race. Accordingly, a course was shaped to pass four miles south of that notorious headland. \n \n As long as the breeze held, there was little to worry about; but should it fail, as it often does towards evening in summer, there was the prospect of another night afloat. Mr. Graham was anxious to make Swanage or even Poole Harbour. He did not hanker after another night in the Channel, but the Sea Scouts rather hoped for one. \n \n The Brixham fleet was no longer in sight. The boats had stood well away to the south\u0027ard. All around the horizon was unbroken, save to the east\u0027ard, where the wedge-shaped Bill cut the skyline. \n \n At tea-time all hands went below, with the exception of Bedford at the helm. There was now a fairly heavy sea running, for there was a weather-going tide. \n \n In the midst of the meal there was a violent crash. The yacht heeled over on the opposite tack, nearly capsizing the Sea Scouts on the port settee, and flinging most of the things off the table. \n \n Instantly, there was a wild rush on deck. A scene of confusion met their eyes. The helmsman had let the yacht gybe all standing, and before he could check the main sheet the boom had flown violently against the set-up runners on the starboard side. The sudden shock had carried away that part of the gear, and the strain was thrown upon the mast. It had parted fifteen feet above the deck, letting mainsail and headsails down in utter confusion. The mizzen, being still set, was tending to turn the yacht head to wind, with the trailing canvas dragging over the bows. \n \n It was not an occasion to demand or receive explanations. The first thing to be done was to get the yacht under control. \n \n Under the Scoutmaster\u0027s directions, the broken-off portion of the mast was parbuckled on board and secured, and the headsails recovered and stowed. The next step was to set up temporary halliards and shrouds on the fractured mast, a difficult business owing to the erratic motion of the yacht. \n \n Working quickly and well, Desmond and Findlay succeeded in passing three strops round the top of the broken mast and shackling blocks to them—two for\u0027ard and one aft. Then the shrouds, shortened by means of sheepshanks, were sent aloft and secured sufficiently to take up a considerable amount of strain. \n \n \"Now we can set the headsail,\" announced Mr. Graham. \"Take two reefs in the staysail, or you won\u0027t get it right home; and set No. 2 jib.\" \n \n All hands were so busy that they failed to notice the approach of a steam drifter until she gave a warning blast on her syren. Slowing down, she drew within twenty yards of the Spindrift. \n \n \"Want a tow into Weymouth?\" shouted her skipper. \n \n Mr. Graham had to decide quickly. On the one hand he was responsible for the safety of the lads under his charge; on the other he did not like the idea of \"chucking up the sponge\" so quickly, especially as he would have to pay for the salvage. He glanced to wind\u0027ard; the breeze was fair. The barometer was high and steady. It was a strong temptation when he looked from the disabled Spindrift to the powerful steam drifter. \n \n \"How much?\" he asked. \n \n \"Twenty-five p\u0027un,\" shouted the skipper. \n \n \"Don\u0027t do it, sir,\" said Desmond in a low voice. \"We\u0027ll be all right without having to pay that.\" \n \n \"Sorry, nothing doing!\" replied the Scoutmaster, then turning to the Patrol Leader he added: \"Desmond, you\u0027re a brick!\" \n \n The skipper of the drifter pulled up the window of the wheelhouse with a savage jerk, that implied plainly enough what he thought of Mr. Graham. \n \n \"Carry on, lads!\" exclaimed the Scoutmaster. \"Up with the staysail!\" \n \n As the flapping canvas rose, the skipper of the drifter lowered the pane and thrust his head through the window. \n \n \"Ahoy!\" he bawled. \"Make it twenty. It\u0027s \u0027ard earned money.\" \n \n Mr. Graham shook his head. \n \n \"Fifteen, then; I likes to do a good turn to a fellow in distress.\" \n \n \"No, not for five pounds,\" shouted the Scoutmaster resolutely. \"We don\u0027t want any assistance, thank you.\" The engine-room telegraph bell clanged, and the drifter began to draw astern. The crew of the Spindrift paid slight attention to her: they were busy at their own job. \n \n Under reefed staysail, the yacht paid off, and began to gather way. The setting of the jib helped still more, so that with three sails drawing well she began to make a good three knots. \n \n \"Now the mainsail,\" continued Mr. Graham. \"We can\u0027t set the peak, so we must set it as a trysail. We\u0027ll have to double reef first, or we cannot hoist the throat close up.\" \n \n \"Look, sir! There\u0027s something wrong with that drifter!\" exclaimed Coles. \n \n All eyes were directed upon the would-be Good Samaritan (at a price). Her engines were stopped, but she still carried way. Clouds of steam were issuing through the fidleys. \n \n Raising his binoculars, Mr. Graham kept the vessel under observation. She was now about two cable lengths away, and slowing down steadily. Through the hatchway appeared the engineer, with his hands to his face and steam coming from his clothes. \n \n \"Main steam pipe burst,\" exclaimed Mr. Graham. \n \n \"She won\u0027t sink?\" asked Hayes. \n \n \"No; she can set fore and aft sail. It\u0027s that poor fellow, the engineer, who has suffered by the accident. He looks badly scalded.\" \n \n \"First aid, sir?\" asked Findlay hopefully. \n \n \"We\u0027ll ask them,\" was the reply. \"Stand by to semaphore.\" \n \n It was five minutes or more before Findlay attracted the attention of the skipper of the drifter. \n \n \"Do—you—require—first—aid?\" semaphored Jock. The answer was emphatic if not to the point. \n \n \"You go to blazes!\" was the message given by the irate skipper\u0027s arms. \n \n By this time the drifter had set her headsails and mizzen, but the Spindrift was gaining rapidly on her. \n \n \"It will be a race,\" declared Hayes. \"We are beating her already, and we haven\u0027t our motor going.\" \n \n \"Wait till she sets her mainsail,\" said Desmond. \"Then she\u0027ll show us her heels.\" \n \n \"We may as well set ours,\" added Mr. Graham. \"All reef points secured? Good—hoist away on your throat halliards.\" \n \n The mainsail was set as a trysail, the peak lowered to its full extent. Even that comparatively small expanse of canvas made a difference, for the yacht quickly drew abreast of the drifter. \n \n Up went the latter\u0027s mainsail. She too increased her pace, but it was soon evident that the under-canvased yacht more than held her own with her bulky rival, hampered as she was with the drag of her three-bladed propeller. \n \n \"We\u0027ve company,\" observed Bedford, \"although a surly fellow at that. Is he making for Weymouth, do you think, sir?\" \n \n \"If he does, he\u0027ll have his work cut out to work up the east side of the Bill,\" replied Mr. Graham. \"We won\u0027t risk it.\" \n \n The Spindrift had now obtained and was holding a useful lead. An hour later she was a quarter of a mile ahead, with the drifter following dead in her wake. Portland Bill was abeam at last; the drifter starboarded helm and made towards the Shambles Lightship, while the yacht shaped a course for the distant St. Alban\u0027s Head. \n \n \"She\u0027s making for Weymouth by the east side of the Race,\" said the Scoutmaster. \"More than likely she\u0027ll get a tow into harbour. Well, we\u0027ve saved money this time.\" \n \n The tide was now setting strongly to the east\u0027ard. Under its favourable influence the Spindrift quickly reeled off the distance between the Bill and St. Alban\u0027s, passing through the Race off the latter headland without taking much water on board. \n \n The wind had now veered a couple of points, and on rounding St. Alban\u0027s Head the change of direction of the coast line necessitated a close haul on the port tack if the yacht were to make Swanage or Poole. \n \n Mr. Graham glanced at his watch, consulted the barometer, and took a survey of the sky to wind\u0027ard. \n \n \"Lads!\" he exclaimed. \"We\u0027ll carry on for the Solent. We\u0027ve four hours\u0027 fair tide, and with decent luck we\u0027ll be inside the Wight before dark.\" \n \n \"Good enough, sir!\" agreed the crew in chorus. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2714/74623.html","bookId":1437,"book":{"id":1437,"title":"Sea Scouts up-Channel","description":"简介： It\u0027s going to be a dirty night, remarked Mr. Graham, Scoutmaster of the 9th Southend-on-Sea Sea Scouts. Not very promising for the first day of our holidays....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2714","creation":"Aug 1, 2019 12:25:06 AM","modification":"Aug 1, 2019 12:25:06 AM"}}
