{"id":44777,"no":12,"title":"CHAPTER XII.--ON THE CLIFFS.","content":"Lady Estelle received me with a welcome smile, for at that time all around her were strangers; and I hoped--nay, felt almost certain--that pleasure to see me inspired it, for on my approach she immediately rose from her seat, joined me, and as if by tacit and silent consent, we walked onward together. Pottersleigh\u0027s presence at Craigaderyn Court, and the rumours it revived; something cool and patronising in his manner towards me, for he had not forgotten that night in Park-lane; Lady Naseby\u0027s influence against me; the chances that some sudden military or political contingency might cut short my leave of absence; the certainty that ere long I should have to \"go where glory waited\" me, and perhaps something less pleasant in the shape of mutilation--the wooden leg which Dora referred to--a coffinless grave in a ghastly battle trench--all rendered my anxiety to come to an understanding with Lady Estelle irrepressible. My secret was already known to Phil Caradoc, fully occupied though he was with his own passion for Winifred Lloyd; and I felt piqued by the idea of being less successful than I honestly hoped he was, for Phil was the king of good fellows, and one of my best friends. \n \n \"You have seemed very triste to-day--looking quite as if you lived in some thoughtful world of your own,\" said Lady Estelle, when she left her seat; \"neither laughing nor dancing, scarcely even conversing, and certainly not with me. Why is this?\" \n \n \"You have declined all dancing, hence the music has lost its zest for me.\" \n \n \"It is not brilliant; besides, it is somewhat of a maypole or harvest-home accomplishment, dancing on the grass; pretty laborious too! And then, as Welsh airs predominate, one could scarcely waltz to the Noble Race of Shenkin.\" \n \n \"You reserve yourself for the evening, probably?\" \n \n \"Exactly. I infinitely prefer a well-waxed floor to a lawn, however well mown and rolled. But concerning your--what shall I term it--sadness!\" \n \n \"Why ask me when you may divine the cause, though I dare not explain--here at least?\" \n \n After a little pause she disengaged two flowers from her bouquet, and presenting them to me with an arch and enchanting smile--for when beyond her mother\u0027s ken, she could at times be perfectly natural--she said, \n \n \"At this floral fête champêtre, I cannot permit you to be the only undecorated man.\" \n \n \"Being in uniform, I never thought of such an ornament.\" \n \n \"Wear these, then,\" said she, placing them in a button-hole. \n \n \"As your gift and for your sake?\" \n \n \"If you choose, do so.\" \n \n \"Ah, who would not but choose?\" said I, rendered quite bright and gay even by such a trifle as this. \"But Lady Estelle, do you know what these are emblematic of?\" \n \n \"In the language of the flowers, do you mean?\" \n \n \"Of course; what else could he mean?\" said a merry voice; and the bright face of Dora, nestled amid her golden hair, appeared, as she joined us, flushed with her dancing, and her breast palpitating with pleasure, at a time when I most cordially wished her elsewhere. \"Yes,\" she continued, \"there is a pansy; that\u0027s for thought, as Ophelia says--and a rosebud; that is for affection.\" \n \n \"But I don\u0027t believe in such symbolism, Dora; do you. Mr. Hardinge?\" \n \n \"At this moment I do, from my soul.\" \n \n She laughed, or affected to laugh, at my earnestness; but it was not displeasing to her, and we walked slowly on. Among the multitude of strangers--to us they were so, at least--to isolate ourselves was comparatively easy now. Besides, it is extremely probable that under the eyes of so many girls she had been rather bored by the senile assiduity of her old admirer; so, avoiding the throng around the dancers, the band, and the luncheon marquee, we walked along the terraces towards the chase, accompanied by Dora, who opened a wicket in a hedge, and led us by a narrow path suddenly to the cliffs that overhung the sea. Here we were quite isolated. Even the music of the band failed to reach us; we heard only the monotonous chafing of the waves below, and the sad cry of an occasional sea-bird, as it swooped up or down from its eyrie. The change from the glitter and brilliance of the crowded lawn to this utter solitude was as sudden as it was pleasing. In the distance towered up Great Orme\u0027s Head, seven hundred and fifty feet in height; its enormous masses of limestone rock abutting against the foam, and the ruins of Pen-y-Dinas cutting the sky-line. The vast expanse of the Irish Sea rolled away to the north-westward, dotted by many a distant sail; and some eighty feet below us the surf was rolling white against the rocky base of the headland on which we stood. \n \n \"We are just over the B?d Mynach, or \u0027monk\u0027s dwelling,\u0027\" said Dora. \"Have you not yet seen it, Estelle?\" \n \n \"No; I am not curious in such matters.\" \n \n \"It is deemed one of the most interesting things in North Wales, quite as much so as St. Tudno\u0027s Cradle, or the rocking-stone on yonder promontory. Papa is intensely vain of being its proprietor. Gruffyd ap Madoc hid here, when he fled from the Welsh after his desertion of Henry III.; so it was not made yesterday. Let us go down and rest ourselves in it.\" \n \n \"Down the cliffs?\u0027 exclaimed Lady Estelle, with astonishment. \n \n \"Yes--why not? There is an excellent path, with steps hewn in the rock. Harry Hardinge knows the way, I am sure.\" \n \n \"As a boy I have gone there often, in search of puffins\u0027 nests; but remember that Lady Estelle--\" \n \n \"Is not a Welsh girl of course,\" said Dora. \n \n \"Nor a goat, like Carneydd Llewellyn,\" added her friend. \"But with Mr. Hardinge\u0027s hand to assist you,\" urged Dora. \"Well, let us make the essay at once, nor lose time, ere we be missed,\" said the other, her mind no doubt reverting to mamma and Lord Pottersleigh. \n \n I began to descend the path first, accepting with pleasure the office of leading Lady Estelle, who for greater security drew off a glove and placed her hand in mine, firmly and reliantly, though the path, a ladder of steps cut in the living rock, almost overhung the sea, and the descent was not without its perils. The headland was cleft in two by some throe of nature, and down this chasm poured a little stream, at the mouth of which, as in a diminutive bay, a gaily-painted pleasure-boat of Sir Madoc\u0027s, named the \"Winifred,\" was moored, and it seemed to be dancing on the waves almost beneath us. \n \n We had barely proceeded some twenty feet down the cliff when Dora, instead of following us, exclaimed that she had dropped a bracelet on the path near the wicket, but we were to go on, and she would soon rejoin us. As she said this she disappeared, and we were thus left alone. To linger where we stood, almost in mid-air, was not pleasant; to return to the edge of the cliff and await her there, seemed a useless task. Why should we not continue to descend, as she must soon overtake us? I could read in the proud face of Lady Estelle, as we paused on that ladder of rock, with her soft and beautiful hand in mine, that she felt in a little dilemma. So did I, but my heart beat happily; to have her so entirely to myself, even for ten minutes, was a source of joy. \n \n While lingering thus, I gradually led our conversation up to the point I wished, by talking of my too probable speedy departure for another land; of the happy days like the present, which I should never forget; of herself. My lips trembled as my heart seemed to rise to them; and forgetting the perilous place in which we stood, and remembering only that her hand was clasped in mine, I began to look into her face with an expression of love and tenderness which she could not mistake; for her gaze soon became averted, her bosom heaved, and her colour came and went; and so, as the minutes fled, we were all unaware that Dora had not yet returned; that the sultry afternoon had begun to darken as heavy dun clouds rolled up from the seaward, and the air become filled with electricity; and that a sound alleged to be distant thunder had been heard at Craigaderyn Court, causing some of the guests to prepare, for departure, despite Sir Madoc\u0027s assurances that no rain would fall, as the glass had been rising. \n \n Dora was long in returning; so long that, instead of waiting or retracing our steps, proceeding hand in hand, and more than once Lady Estelle having to lean on my shoulder for support, we continued to descend the path in the face of the cliff--a path that ultimately led us into a terrible catastrophe. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1710/50359.html","bookId":1147,"book":{"id":1147,"title":"Under the Red Dragon","description":"简介： And she is to be there--nay, is there already; so one more chance is given me to meet her. But for what?--to part again silently, and more helplessly bewitched than ever, perhaps. Ah, never will she learn to love me as I love her! thought I, as I tur...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1710","creation":"Aug 1, 2019 12:24:28 AM","modification":"Aug 1, 2019 12:24:28 AM"}}
