{"id":24679,"no":11,"title":"Chapter 10","content":"One by one, the children entered the classroom and quietly sat down at their desks. They couldn\u0027t take any chances. Mr. Gorf might walk through the door any moment. Or maybe he was already there, hiding in the coat closet, just waiting for someone to do something wrong. \"I didn\u0027t want to come today,\" whispered Calvin. \"But my parents made me.\" \"Sh!\" said Bebe. \"He might hear you.\" Mr. Kidswatter\u0027s voice came over the PA system. \"Good morning, boys and girls.\" \"Good morning, Mr. Kidswatter,\" the children all answered together, like good little boys and girls. They listened attentively to their principal. Then, when Mr. Kidswatter was finished, they took out their arithmetic books and started working. After that, they did social studies, reading, and spelling. When the recess bell rang, the children put their books neatly in their desks, quietly lined up, and walked out of the room and down the stairs. \"So how\u0027s your substitute teacher?\" asked Louis, out on the playground. \"Tough!\" said Bebe. \"I\u0027ve never worked so hard in my life.\" \"I did more work before ten o\u0027clock than most people do in a day,\" said Calvin. \"But he\u0027s very fair,\" Myron quickly added, just in case Mr. Gorf was listening. He might have been hiding in the bushes. \"Yes, he\u0027s nice and fair and a very good teacher,\" said Jenny. \"Very smart too,\" said Deedee. \"We\u0027re lucky to have him.\" Louis twisted the end of his mustache between his fingers. After recess the children returned to class and worked until lunchtime. At lunch they ate all the food Miss Mush served them. Their manners were perfect. Mr. Gorf might have been hiding under the table. After lunch they returned to class and practiced their handwriting. Myron looked around. All of a sudden he got a terrible urge to do something. Anything! \"Ugga bugga,\" he said. Jenny put her finger to her lips. \"Biff. Boff. Boof!\" said Myron, a little louder. \"Sh!\" said Jenny. Myron stood up. \"No!\" he shouted. \"I don\u0027t have to be quiet!\" Everyone tried to get Myron to hush up.","sourceLink":"http://novel.tingroom.com/jingdian/1990/56929.html","bookId":676,"book":{"id":676,"title":"歪歪学校有点奇怪 Wayside School Gets a Little Stranger","description":"简介： All the kids from Wayside School had to spend 243 days in horrible schools while Wayside was closed to get rid of the cows {Don\u0027t ask!). Now the kids are back and the fun begins again on every floor....","cover":"http://novel.tingroom.com/file/upload/201803/02/09-40-04-14-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1990","creation":"Aug 1, 2019 12:19:08 AM","modification":"Aug 1, 2019 12:19:08 AM"}}
