{"id":32551,"no":17,"title":"Chapter 16","content":"JUBAL HARSHAW DID NOT WAIT for Gillian to dig her problem child out ofthe pool; he left instructions for Dorcas to be given a sedative and hurried tohis study, leaving Anne to explain (or not explain) the events of the last tenminutes. .Front!“ he called out over his shoulder. 　　Miriam turned and caught up with him. .I guess I must be .front,’“ she saidbreathlessly. .But, Boss, what in the-. 　　.Girl, not one word.“.But, Boss-. 　　.Zip it, I said. Miriam, about a week from now we’ll all sit down and get Anneto tell us what we really did see. But right now everybody and his cousins willbe phoning here and reporters will be crawling out of the trees-and I’ve got tomake a couple of calls first. I need help. Are you the sort of useless femalewho comes unstuck when she’s needed? That reminds me- Make a note todock Dorcas’s pay for the time she spent having hysterics.“Miriam gasped. .Boss! You just dare do that and every single one of us willquit cold!“.Nonsense.“.I mean it. Quit picking on Dorcas. Why, I would have had hysterics myself ifshe hadn’t beaten me to it.“ She added, .I think I’ll have hysterics now.“Harshaw grinned. .You do and I’ll spank you. All right, put Dorcas down for abonus for .extra hazardous duty.’ Put all of you down for a bonus. Me,especially. I earned it.“.All right. But who pays your bonus?“.The taxpayers, of course. We’ll find a way to clip- Damn!“ They had reachedhis study door; the telephone was already demanding attention. He slid intothe seat in front of it and keyed in. .Harshaw speaking. Who the devil areyou?“.Skip the routine, Doc,“ a face answered cheerfully. .You haven’t frightenedme in years. How’s everything going?“Harshaw recognized the face as belonging to Thomas Mackenzie, productionmanager-in-chief for New World Networks; he mellowed slightly. .Wellenough, Tom. But I’m rushed as can be, so-. 　　.You’re rushed? Come try my forty-eight-hour day. I’ll make it brief. Do youstill think you are going to have something for us? I don’t mind the expensiveequipment you’ve got tied up; I can overhead that. But business is businessandI have to pay three full crews just to stand by for your signal. Union rulesyouknow how it is. I want to do you any favor I can. We’ve used lots of yourscript in the past and we expect to use still more in the future-but I’mbeginning to wonder what I’m going to tell our comptroller.“Harshaw stared at him. .Don’t you think the spot coverage you just got wasenough to pay the freight?“.What spot coverage?“A few minutes later Harshaw said good-by and switched off, having beenconvinced that New World Networks had seen nothing of recent events at hishome. He stalled off Mackenzie’s questions about it, because he wasdismally certain that a factual recital would simply convince Mackenzie thatpoor old Harshaw had at last gone to pieces. Nor could Harshaw haveblamed him. 　　Instead they agreed that, if nothing worth picking up happened in the nexttwenty-four hours, New World could break the linkage and remove theircameras and other equipment. 　　As the screen cleared Harshaw ordered, .Get Larry. Have him fetch thatpanic button-Anne probably has it.“ He then started making another call,followed it with a third. By the time Larry arrived, Harshaw was convinced thatno network had been watching when the Special Service squads attemptedto raid his home. It was not necessary to check on whether or not the twodozen .hold“ messages that he had recorded had been sent; their deliverydepended on the same signal that had failed to reach the news channels. 　　As he turned away from the phone Larry offered him the .panic button“portable radio link. .You wanted this, Boss?“.I just wanted to sneer at it and see if it sneered back. Larry, let this be alesson to us: never trust any machinery more complicated than a knife andfork.“.Okay. Anything else?“.Larry, is there a way to check that dingus and see if it’s working properly? 　　Without actually hauling three networks out of their beds, I mean?“.Sure. The techs set up the transceiver down in the shop and it’s got a switchon it for that very purpose. Throw the switch, push the button; a light comeson. To test on through, you simply call .em, right from the transceiver and tell.em you want a hot test clear through to the cameras and back to the monitorstations.“.And suppose the test shows that we aren’t getting through? If the trouble ishere, can you spot what’s wrong?“.Well, I might,“ Larry said doubtfully, .if it wasn’t anything more than a looseconnection. But Duke is the electron pusher around here- I’m more theintellectual type.“.I know, son-I’m not too bright about practical matters, either. Well, do thebest you can. Let me know.“.Anything else, Jubal?“.Yes, if you see the man who invented the wheel, send him up; I want to givehim a piece of my mind. Meddler!“Jubal spent the next few minutes in umbilical contemplation. He consideredthe possibility that Duke had sabotaged the .panic button“ but rejected thethought as time wasting, if not unworthy. He allowed himself to wonder for amoment just what had really happened down in his garden and how the ladhad done it-from ten feet under water. For he had no doubt that the Man fromMars had been behind those impossible shenanigans. 　　Admittedly, what he had seen only the day before in this very room was justas intellectually stupefying as these later events-but the emotional impactwas something else. A mouse was as much a miracle of biology as was anelephant; nevertheless there was an important difference -an elephant wasbigger. 　　To see an empty carton, just rubbish, disappear in midair logically implied thepossibility that a squad car full of men could vanish in the same fashion. Butone event kicked your teeth in-the other didn’t. 　　Well, he wasn’t going to waste tears on those Cossacks. Jubal conceded thatcops qua cops were all right; he had met a number of honest cops in his life . 　　. . and even a fee-splitting village constable did not deserve to be snuffed outlike a candle. The Coast Guard was a fine example of what cops ought to beand frequently were. 　　But to be a member of the S.\u0026 squads a man had to have larceny in his heartand sadism in his soul. Gestapo. Storm troopers in the service of whateverpolitico was in power. Jubal longed for the good old days when a lawyercould cite the Bill of Rights and not have some over-riding Federation trickerydefeat him. 　　Never mind- What would logically happen now? Heinrich’s task forcecertainly had had radio contact with its base; ergo, its loss would be noted, ifonly by silence. Shortly more S.S. troops would come looking for them-werealready headed this way if that second car had been chopped off in themiddle of an action report. .Miriam-. 　　.Yes, Boss.“.I want Mike, Jill, and Anne here at once. Then find Larry-in the shop,probably-and both of you come to the house, lock all doors, and all groundfloor windows.“.More trouble?“.Get movin’, gal.“If the S.S. apes showed up again-no, when they showed up-they probablywould not have duplicate warrants. If their leader was silly enough to breakinto a locked house without a warrant, well, he might have to turn Mike looseon them. But this blind warfare of attrition had to be stopped-which meantthat Jubal simply had to get through to the Secretary General. 　　How? 　　Call the Executive Palace again? Heinrich had probably been telling thesimple truth when he said that a renewed attempt would simply be referred toHeinrich-or to whatever 5.5. boss was now warming that chair that Heinrichwould never need again. Well? It would surely surprise them to have a manthey had sent a squad to arrest blandly phoning in, face to face-he might beable to bull his way all the way up to the top. Commandant What’s-his-name,chap with a face like a well-fed ferret, Twitchell. And certainly thecommanding officer of the S.S. buckos would have direct access to the boss. 　　No good. You had to have a feeling for what makes the frog jump. It would bea waste of breath to tell a man who believes in guns that you’ve gotsomething better than guns and that he can’t arrest you and might as wellgive up trying. Twitchell would keep on throwing men and guns at them till heran out of both-but he would never admit he couldn’t bring in a man whoselocation was known. 　　Well, when you couldn’t use the front door you got yourself slipped in throughthe back door-elementary politics. Jubal regretted mildly that he had ignoredpolitics the last quarter century or so. Damn it, he needed Ben Caxton-Benwould know who had keys to the back door . - - and Jubal would knowsomebody who knew one of them. 　　But Ben’s absence was the whole reason for this silly donkey derby. Since hecouldn’t ask Ben, whom did he know who would know? 　　Hell’s halfwit, he had just been talking to one! Jubal turned back to the phoneand tried to raise Tom Mackenzie again, running into only three layers ofinterference on the way, all of whom knew him and passed him along quickly. 　　While he was doing this, his staff and the Man from Mars came in; Jubalignored them and they sat down, Miriam first stopping to write on a scratchpad: .Doors and windows locked.“Jubal nodded to her and wrote below it: .Larry-panic button?“ then said to thescreen, .Tom, sorry to bother you again.“.A pleasure, Jubal.“.Tom, if you wanted to talk to Secretary General Douglas, how would yougo about it?“.Eh? I’d phone his press secretary, Jim Sanforth. Or possibly Jock Dumont,depending on what I wanted. But I wouldn’t talk to the Secretary General atall. Jim would handle it.“.But suppose you wanted to talk to Douglas himself.“.Why, I’d tell Jim and let him arrange it. Be quicker just to tell Jim myproblem, though; it might be a day or two before he could squeeze me in . . . 　　and even then I might be bumped for something more urgent. Look, Jubal,the network is useful to the administration-and we know it and they know it. 　　But we don’t presume on it unnecessarily.“.Tom ... assume that it is necessary. Suppose you just had to speak toDouglas. Right now. Not next week. In the next ten minutes.“Mackenzie’s eyebrows went up. .Well - . - if I just had to, I would explain toJim why it was so urgent-. 　　.No.“.Be reasonable.“.No. That’s just what I can’t be. Assume that you had caught Jim Sanforthstealing the spoons, so you couldn’t tell him what the emergency was. Butyou had to speak to Douglas immediately.“Mackenzie sighed. .I suppose I would tell Jim that I simply had to talk to theboss . - . and that if I wasn’t put through to him right away, the administrationwould never get another trace of support from the network, Politely, ofcourse. But make him understand that I meant it. Sanforth is nobody’s fool;he would never serve his own head up on a platter.“.Okay, Tom, do it.“.Huh?“.Leave this call on. Call the Palace on another instrument-and have yourboys ready to cut me in instantly. I’ve got to talk to the Secretary Generalright now!“Mackenzie looked pained. .Jubal, old friend-. 　　.Meaning you won’t.“.Meaning I can’t. You’ve dreamed up a hypothetical situation in which apardonme-major executive of an intercontinental network could speak to theSecretary General under conditions of dire necessity. But I can’t hand thisentrée over to somebody else. Look, Jubal, I respect you. Besides that, youare probably four of the six most popular writers alive today. The networkwould hate to lose you and we are painfully aware that you Won’t let us tieyou down to a contract. But I can’t do it, even to please you. You must realizethat one does not telephone the World chief of government unless he wantsto speak to you.“.Suppose I do sign an exclusive seven-year contract?“Mackenzie looked as if his teeth hurt, .I still couldn’t do it. I’d lose my job-andyou would still have to carry out your contract.“Jubal considered calling Mike over into the instrument’s visual pickup andnaming him. He discarded the idea at once. Mackenzie’s own program meshad run the fake .Man from Mars’ interviews-and Mackenzie was eithercrooked and in on the hoax . . . or he was honest, as Jubal thought he was,and simply would not believe that he himself had been hoaxed. .All right,Tom, I won’t twist your arm. But you know your way around in thegovernment better than I do. Who calls Douglas whenever he likes-and getshim? I don’t mean Sanforth“.No one.“.Damn it, no man lives in a vacuum! There must be at least a dozen peoplewho can phone him and not get brushed off by a secretary.“.Some of his cabinet, I suppose. And not all of them.“.I don’t know any of them, either; I’ve been out of touch. But I don’t meanprofessional politicos. Who knows him so well that they can call him on aprivate line and invite him to play poker?“.Umm ... you don’t want much, do you? Well, there’s Jake Allenby. Not theactor, the other Jake Allenby. Oil.“.I’ve met him. He doesn’t like me. I don’t like him. He knows it.“.Douglas doesn’t have very many intimate friends. His wife ratherdiscourages-.- Say, Jubal - . . how do you feel about astrology?“.Never touch the stuff. Prefer brandy.“.Well, that’s a matter of taste. But-see here, Jubal, if you ever let on toanyone that I told you this, I’ll cut your lying throat with one of your ownmanuscripts.“.Noted. Agreed. Proceed.“.Well, Agnes Douglas does touch the stuff.., and I know where she gets it. 　　Her astrologer can call Mrs. Douglas at any time-and, believe you me, Mrs.Douglas has the ear of the Secretary General whenever she chooses. Youcan call her astrologer - . . and the rest is up to you.“.I don’t seem to recall any astrologers on my Christmas card list,“ Jubalanswered dubiously. .What’s his name?“.Her. And you might try crossing her palm with silver in convincingdenominations. Her name is Madame Alexandra Vesant. WashingtonExchange. That’s V, E, S, A, N, T.“.I’ve got it,“ Jubal said happily. .And, Tom, you’ve done me a world ofgood!“.Hope so. Anything for the network soon?“.Hold it.“ Jubal glanced at a note Miriam had placed at his elbow somemoments ago. It read: .Larry says the transceiver won’t trans-and he doesn’tknow why.“ Jubal went on, .That spot coverage failed earlier through atransceiver failure here-and I don’t have anyone who can repair it.“.I’ll send somebody.“.Thanks. Thanks twice.“Jubal switched off, placed the call by name and instructed the operator to usehush \u0026 scramble if the number was equipped to take it. It was, not to hissurprise. Very quickly Madame Vesant’s dignified features appeared in hisscreen. He grinned at her and called, .Hey, Rube!“She looked startled, then looked more closely. .Why, Doe Harshaw, you oldscoundrel! Lord love you, it’s good to see you. Where have you been hiding?“.Just that, Becky-hiding. The clowns are after me.“Becky Vesey didn’t ask why; she answered instantly, .What can I do to help? 　　Do you need money?“.I’ve got plenty of money, Becky, but thanks a lot. Money won’t help; I’m inmuch more serious trouble than that-and I don’t think anyone can help mebut the Secretary General himself, Mr. Douglas. I need to talk to him-andright away. Now - . . or even sooner.“She looked blank. .That’s tall order, Doc.“.Becky, I know it is-because I’ve been trying for a week to get through to him. . and I can’t. But don’t you get mixed up in it yourself, Becky . . . because,girl, I’m hotter than a smoky bearing. I just took a chance that you might beable to advise me-a phone number, maybe, where I could reach him. But Idon’t want you to mix into it personally. You’d get hurt-and I’d never be ableto look the Professor in the eye if I ever meet him again . . . God rest hissoul.“.I know what the Professor would want me to do!“ she said sharply. .So let’sknock off the nonsense, Doc. The Professor always swore that you were theonly sawbones fit to carve people; the rest were butchers. He never forgotthat time in Elkton.“.Now, Becky, we won’t bring that up. I was paid.“.You saved his life.“.I did no such thing. It was his rugged constitution and his will to fight backandyour nursing.“.Uh ... Doc, we’re wasting time. Just how hot are you?“.They’re throwing the book at me ... and anybody near me is going to getsplashed. There’s a warrant out for me-a Federation warrant- and they knowwhere I am and I can’t run. It will be served any minute now . . . and Mr. 　　Douglas is the only person who can stop it.“.You’ll be sprung. I guarantee that.“.Becky, I’m sure you would. But it might take a few hours. It’s that .back room’ 　　I’m afraid of, Becky. I’m too old for a session in the back room.“.But- Oh, goodness! Doe, can’t you give me some details? I really ought tocast a horoscope on you, then I’d know what to do. You’re Mercury, ofcourse, since you’re a doctor. But if I knew what house to look in to find yourtrouble, I could do better.“.Girl, there isn’t time for that. But thanks.“ Jubal thought rapidly. Whom totrust? And when? .Becky, just knowing could put you in as much trouble as Iam in . . . unless I convince Mr. Douglas.“.Tell me, Doc. I’ve never taken a powder at a clem yet-and you knowit.“.All right. So I’m .Mercury.’ But the trouble lies in Mars.“She looked at him sharply. .How?“.You’ve seen the news. You know that the Man from Mars is supposed to bemaking a retreat some place high up in the Andes. Well, he’s not. That’s justto hoax the yokels.“Becky seemed startled but not quite as Jubal had expected her to be. .Justwhere do you figure in this, Doc?“.Becky, there are people all over this sorry planet who want to lay hands onthat boy. They want to use him, they want to make him geek for them, theirway. But he’s my client and I don’t propose to hold still for it. If I can help it. 　　But my only chance is to talk with Mr. Douglas himself, face to face.“.The Man from Mars is your client? You can turn him up?“.Yes. But only to Mr. Douglas. You know how it is Becky-the mayor can be agood Joe, kind to children and dogs. But he doesn’t necessarily knoweverything his town clowns are up to-especially if they haul a man in and takehim into that back room.“She nodded. .I’ve had my troubles with cops. Cops!“.So I need to dicker with Mr. Douglas before they haul me in.“.All you want is to talk to him on the telephone?“.Yes. If you can swing it. Here, let me give you my number-and I’ll be sittingright here, hoping for a call . . . until they pick me up. If you can’t swing it . . . 　　thanks anyway, Becky, thanks a lot. I’ll know you tried.“.Don’t switch off!“ she said sharply. 　　.Eh?“.Keep the circuit, Doc, while I see what I can do. If I have any luck, they canpatch right through this phone and save time. So hold on.“ Madame Vesantleft the screen without saying good-by, then called Agnes Douglas. Shespoke with calm confidence, pointing out to Agnes that this was precisely thedevelopment foretold by the stars-and exactly on schedule. Now had comethe critical instant when Agnes must guide and sustain her husband, using allher womanly wit and wisdom to see that he acted wisely and without delay. 　　.Agnes dear, this configuration will not be repeated in a thousand years-Mars, Venus and Mercury in perfect trine, just as Venus reaches themeridian, making Venus dominant. Thus you see-. 　　.Allie, what do the Stars tell me to do? You know I don’t understand thescientific part.“This was hardly surprising, since the described relationship did not obtain atthe moment. Madame Vesant had not had time to compute a new horoscopeand was improvising. But she was untroubled by it; she was speaking a.higher truth,“ giving good advice and helping her friends. To be able to helptwo friends at once made Becky Vesey especially happy. .Dear, you really dounderstand it, you have born talent for it. You are Venus, as always, andMars is reinforced, being both your husband and that young man Smith forthe duration of this crisis. Mercury is Dr. Harshaw. To offset the imbalancecaused by the reinforcement of Mars, Venus must sustain Mercury until thecrisis is past. But you have very little time for it; Venus waxes in influenceuntil reaching meridian, only seven minutes from now-after that yourinfluence will decline. You must act quickly.“.You should have warned me sooner.“.My dear, I have been waiting here by my phone all thy, ready to actinstantly. The Stars tell us the nature of each crisis; they never tell us thedetails. But there is still time. I have Dr. Harshaw waiting on the telephonehere; all that is necessary is to bring them face to face-if possible beforeVenus reaches meridian.“.Well- All right, Allie. I’ve got to dig Joseph out of some silly conference but I’llget him. Keep this line open. Give me the number of the phone you have thisDoctor Rackshaw on-or can you transfer the call there?“.I can switch it over here. Just get Mr. Douglas. Hurry, dear.“.I will.“When Agnes Douglas’ face left the screen, Becky went to still another phone. 　　Her profession required ample phone service; it was her largest singlebusiness expense. Humming happily she called her broker.","sourceLink":"http://novel.tingroom.com/kehuan/255/335.html","bookId":365,"book":{"id":365,"title":"异乡异客 Stranger In A Strange Land","description":"简介： Stranger in a Strange Land is a 1961 science fiction novel by American author Robert A. Heinlein. It tells the story of Valentine Michael Smith, a human who has returned to Earth in early adulthood after being raised by Martians on the plane...","cover":"http://novel.tingroom.com/uploads/110322/1-110322155114I6.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/255","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
