{"id":32536,"no":2,"title":"Chapter 1","content":"ONCE UPON A TIME when the world was young there was a Martiannamed Smith.\\n\\n 　　Valentine Michael Smith was as real as taxes but he was a race of one.\\n\\n 　　The first human expedition from Terra to Mars was selected on the theorythat the greatest danger to man in space was man himself. At that time, onlyeight Terran years after the founding of the first human colony on Luna, anyinterplanetary trip made by humans necessarily had to be made in wearyfree-fail orbits, doubly tangent semi-ellipses—from Terra to Mars, twohundred fifty-eight days, the same for the return journey, plus four hundredfifty-five days waiting at Mars while the two planets crawled slowly back intorelative positions which would permit shaping the doubly-tangent orbit-a totalof almost three Earth years.\\n\\n 　　Besides its wearing length, the trip was very chancy. Only by refueling at aspace station, then tacking back almost into Earth’s atmosphere, could thisprimitive flying coffin, the Envoy, make the trip at all. Once at Mars she mightbe able to return-if she did not crash in landing, if water could be found onMan to fill her reaction-mass tanks, if some sort of food could be found onMars, if a thousand other things did not go wrong.\\n\\n 　　But the physical danger was judged to be less important than thepsychological stresses. Eight humans, crowded together like monkeys foralmost three Terran years, had better get along much better than humansusually did. An all-male crew had been vetoed as unhealthy and sociailyunstable from lessons learned earlier. A ship’s company of four marriedcouples had been decided on as optimum, if the necessary specialties couldbe found in such a combination.\\n\\n 　　The University of Edinburgh, prime contractor, sub-contracted crew selectionto the Institute for Social Studies. After discarding the chaff of volunteersuseless through age, health, mentality, training, or temperament, the Institutestill had over nine thousand candidates to work from, each sound in mind andbody and having at least one of the necessary special skills. It was expectedthat the Institute would report several acceptable four-couple crews.\\n\\n 　　No such crew was found. The major skills needed were astrogator, medicaldoctor, cook, machinist, ship’s commander, semantician, chemical engineer,electronics engineer, physicist, geologist, biochemist, biologist, atomicsengineer, photographer, hydroponicist, rocket engineer. Each crew memberwould have to possess more than one skill, or be able to acquire extra skillsin time. There were hundreds of possible combinations of eight peoplepossessing these skills; there turned up three combinations of four marriedcouples possessing them, plus health and intelligence.-but in all three casesthe group-dynamicists who evaluated the temperament factors forcompatibility threw up their hands in horror.\\n\\n 　　The prime contractor suggested lowering the compatibility figure-ofmerit; theInstitute stiffly offered to return its one dollar fee. In the meantime a computerprogrammer whose name was not recorded had the machines hunt for threecouplerump crews. She found several dozen compatible combinations, eachof which defined by its own characteristics the couple needed to complete it.\\n\\n 　　In the meantime the machines continued to review the data changing throughdeaths, withdrawals, new volunteers, etc.\\n\\n 　　Captain Michael Brunt, M.S., Cmdr. D. F. Reserve, pilot (unlimited license),and veteran at thirty of the Moon run, seems to have had an inside track atthe Institute, someone who was willing to look up for him the names of singlefemale volunteers who might (with him) complete a crew, and then pair hisname with these to run trial problems through the machines to determinewhether or not a possible combination would be acceptable. This wouldaccount for his action in jetting to Australia and proposing marriage to DoctorWinifred Coburn, a horse-faced spinster semantician nine years his senior.\\n\\n 　　The Carlsbad Archives pictured her with an expression of quiet good humorbut otherwise lacking in attractiveness.\\n\\n 　　Or Brant may have acted without inside information, solely through that traitof intuitive audacity necessary to command an exploration. In any case lightsblinked, punched cards popped out, and a crew for the Envoy had beenfound:\\n\\n 　　Captain Michael Brant, commanding-pilot, astrogator, relief cook, reliefphotographer, rocketry engineer;Dr. Winifred Coburn Brant, forty-one, semantician, practical nurse, storesofficer, historian;Mr. Francis X. Seeney, twenty-eight, executive officer, second pilot,astrogator, astrophysicist, photographer;Dr. Olga Kovalic Seeney, twenty-nine, cook, biochemist, hydroponicist;Dr. Ward Smith, forty-five, physician and surgeon, biologist;Dr. Mary Jane Lyle Smith, twenty-six, atomics engineer, electronics andpower technician;Mr. Sergei Rimsky, thirty-five, electronics engineer, chemical engineer,practical machinist \u0026 instrumentation man, cryologist;Mrs. Eleanora Alvarez Rimsky, thirty-two, geologist and selenologist,hydroponicist.\\n\\n 　　The crew had a well-rounded group of skills, although in some cases theirsecondary skills had been acquired by intensive coaching during the lastweeks before blast-off. More important, they were mutually compatible intheir temperaments.\\n\\n 　　Too compatible, perhaps.\\n\\n 　　The Envoy departed on schedule with no mishaps. During the early part ofthe voyage her daily reports were picked up with ease by private listeners. Asshe drew away and signals became fainter, they were picked up andrebroadcast by Earth’s radio satellites. The crew seemed to be both healthyand happy. An epidemic of ringworm was the worst that Dr. Smith had tocope with-the crew adapted to free fall quickly and no antinausea drugs wereused after the first week. If Captain Brant had any disciplinary problems, hedid not choose to report them to Earth.\\n\\n 　　The Envoy achieved a parking orbit just inside the orbit of Phobos and spenttwo weeks in photographic survey. Then Captain Brant radioed: .We willattempt a landing at 1200 tomorrow GST just south of Lacus Soli.“ No furthermessage was ever received.\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/kehuan/255/320.html","bookId":365,"book":{"id":365,"title":"异乡异客 Stranger In A Strange Land","description":"简介： Stranger in a Strange Land is a 1961 science fiction novel by American author Robert A. Heinlein. It tells the story of Valentine Michael Smith, a human who has returned to Earth in early adulthood after being raised by Martians on the plane...","cover":"http://novel.tingroom.com/uploads/110322/1-110322155114I6.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/255","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
