{"id":32556,"no":22,"title":"Chapter 21","content":"THE MEETING ADJOURNED. Jubal found his intention of getting his flockout of the Palace balked by the presence of the American President and ofSenator Boone; both wanted to chat with Mike, both were practical politicianswho realized fully the freshly enhanced value of being seen on intimate termswith the Man from Mars-and both were well aware that the eyes of the world,via stereovision, were still on them. 　　And other hungry politicos were closing in. 　　Jubal said quickly, .Mr. President, Senator-we’re leaving at once to havelunch. Can you join us?“ He reflected that two in private would be easier tohandle than two dozen in public-and he had to get Mike out of there beforeanything came unstuck. 　　To his relief both had other duties elsewhere. Jubal found himself promisingnot only to fetch Mike to that obscene Fosterite service but also to bring himto the White House-ob, well, the boy could always get sick, if necessary. 　　.Places, girls.“With his escort again around him Mike was convoyed to the roof, Anneleading the way since she would remember it-and creating quite a bow wavewith her height, her Valkyrie blonde beauty, and her impressive cloak of aFair Witness. Jubal, Ben, and the three officers from the Champion coveredthe rear. Larry and the Greyhound bus were waiting on the roof; a fewminutes later the driver left them on the roof of the New Mayflower. Newsmencaught up with them there, of course, but the girls guarded Mike on down tothe suite Duke had taken earlier. They were becoming quite good at it andwere enjoying it; Miriam and Dorcas in particular displayed ferocity thatreminded Jubal of a mother cat defending her young-only they made a gameof it, keeping score against each other. A reporter that closed within threefeet of either of them courted a spiked instep. 　　They found their corridor patrolled by S.S. troopers and an officer outside thedoor of their suite. 　　Jubal’s back hair rose, but he realized (or .hoped,“ he corrected himself) thattheir presence meant that Douglas was carrying out his half of the bargain infull measure. The letter Jubal had sent to Douglas before the conference,explaining what he was going to do and say, and why, had included a plea toDouglas to use his power and influence to protect Mike’s privacy from hereon-so that the unfortunate lad could begin to lead a normal life. (If a .normal“life was possible for Mike, Jubal again corrected himself.)So Jubal merely called out, .Jill! Keep Mike under control. It’s okay.“.Right, Boss.“And so it was. The officer at the door simply saluted. Jubal glanced at him,.Well! Howdy, Major. Busted down any doors lately?“Major Bloch turned red but kept his eyes forward and did not answer. Jubalwondered if the assignment was punishment? No, likely just coincidence;there probably wouldn’t be more than a handful of S.S. officers of appropriaterank available for the chore in this area. Jubal considered rubbing it in bysaying that a skunk had wandered in that door and ruined his living roomfurniture-and what was the major going to do about that? But he decidedagainst it; it would not only be ungracious but untrue- Duke had rigged atemporary closure out of plywood before the party got too wet for such tasks. 　　Duke was waiting inside. Jubal said, .Sit down, gentlemen. How about it,Duke?“Duke shrugged. .Who knows? Nobody has bugged this suite since I took it; Iguarantee that. I turned down the first suite they offered me, just as you saidto, and I picked this one because it’s got a heavy ceiling-the ballroom isabove us. And I’ve spent the time since searching the place. But, Boss, I’vepushed enough electrons to know that any dump can be bugged, so that youcan’t find it without tearing the building down.“.Fine, fine-but I didn’t mean that. They can’t keep a hotel this big buggedthroughout just on the chance that we might take a room in it-at least, I don’tthink they can. I mean, .How about the supplies?’ I’m hungry, boy, and verythirsty-and we’ve three more for lunch.“.Oh, that. That stuff was unloaded under my eyes, carried down the sameway, placed just inside the door; I put it all in the pantry. You’ve got asuspicious nature, Boss.“.I sure have-and you’d better acquire one if you want to live as long as Ihave.“ Jubal had just trusted Douglas with a fortune equivalent to a mediumsizednational debt-but he had not assumed that Douglas’ overeagerlieutenants would not tamper with food and drink. So to avoid the services ofa food taster he had fetched all the way from the Poconos plenty of food,more than a plenty of liquor-and a little water. And, of course, ice cubes. Hewondered how Caesar had licked the Gauls without ice cubes. 　　.I don’t hanker to,“ Duke answered. 　　.Matter of taste. I’ve had a pretty good time, on the whole. Get crackin’, girls. 　　Anne, douse your cloak and get useful. First girl back in here with a drink forme skips her next turn at .Front.’ After our guests, I mean. Do please sitdown, gentlemen. Sven, what’s your favorite poison? Akvavit, I suppose-Larry, tear down, find a liquor store and fetch back a couple of bottles ofakvavit. Fetch Bols gin for the captain, too.“.Hold it, Jubal,“ Nelson said firmly. .I won’t touch akvavit unless it’s chilledovernight-and I’d rather have Scotch.“.Me, too,“ agreed van Tromp. 　　.All right. Got enough of that to drown a horse. Dr. Mahmoud? If you prefersoft drinks, I’m pretty sure the girls tucked some in.“Mahmoud looked wistful. .I should not allow myself to be tempted bystrong drink.“.No need to be. Let me prescribe for you, as a physician.“ Jubal looked himover. .Son, you look as if you had been under considerable nervous strain. 　　Now we could alleviate that with meprobamate but since we don’t have thatat hand, I’m forced to substitute two ounces of ninety proof ethanol, repeat asneeded. Any particular flavor you prefer to kill the medicinal taste? And withor without bubbles?“Mahmoud smiled and suddenly did not look at all English. .Thank you,Doctor-but I’ll sin my own sins, with my eyes open. Gin, please, with water onthe side. Or vodka. Or whatever is available.“.Or medicinal alcohol,“ Nelson added. .Don’t let him pull your leg, Jubal. 　　Stinky drinks anything-and always regrets it.“.I do regret it,“ Mahmoud said earnestly, .because I know it is sinful.“.Then don’t needle him about it, Sven,“ Jubal said brusquely. .If Stinky getsmore mileage out of his sins by regretting them, that’s his business. My ownregretter burned out from overload during the market crash in .29 and I’venever replaced it-and that’s my business. To each his own. How aboutvictuals, Stinky? Anne probably stuffed a ham into one of those hampers-andthere might be other unclean items not as clearly recognizable. Shall Icheck?“Mahmoud shook his head. .I’m not a traditionalist, Jubal. That legislation wasgiven a long time ago, according to the needs of the time. The times aredifferent now.“Jubal suddenly looked sad. .Yes. But for the better? Never mind, this tooshall pass and leave not a rack of mutton behind. Eat what you will, mybrother-God forgives necessity.“.Thank you. But, truthfully, I often do not eat in the middle of the day.“.Better eat, or the prescribed ethanol will do more than relax you. Besides,these kids who work for me may sometimes misspell words but they are allsuperb cooks.“Miriam had come up behind Jubal with a tray bearing four drinks, ordershaving been filled at once while Jubal ranted. .Boss,“ she broke in, .I heardthat. Will you put it in writing?“.What?“ He whirled around and glared at her. .Snooping! You stay in afterschool and write one thousand times~ .I will not flap my ears at privateconversations.’ Stay until you finish it.“.Yes, Boss. This is for you, Captain .. and for you, Dr. Nelson and this isyours, Dr. Mahmoud. Water on the side, you said?“.Yes, Miriam. Thank you.“.Usual Harshaw service-sloppy but fast. Here’s yours, Boss.“ .You putwater in it!“.Anne’s orders. She says you’re too tired to have it on the rocks.“Jubal looked long-suffering. .You see what I have to put up with, gentlemen? 　　We should never have put shoes on .em. Miriam, make that .one thousandtimes’ in Sanskrit.“.Yes, Boss. Just as soon as I find time to learn it.“ She patted him on thehead. .You go right ahead and have your tizzy, dear; you’ve earned it. We’reall proud of you.“.Back to the kitchen, woman. Hold it-has everybody else got a drink? 　　Where’s Ben’s drink? Where’s Ben?“.They have by now. Ben is phoning in his column, His drink is at hiselbow.“.Very well. You may back out quietly, without formality-and send Mike in. 　　Gentlemen! Me ke aloha pau ole!-for there are fewer of us every year.“ Hedrank, they joined him. 　　.Mike’s helping. He loves to help-I think he’s going to be a butler when hegrows up.“.I thought you had left. Send him in anyhow; Dr. Nelson wants to give him aphysical examination.“.No hurry,“ put in the ship’s surgeon. .Jubal, this is excellent Scotch -but whatwas the toast?“.Sorry. Polynesian. .May our friendship be everlasting.’ Call it a footnote tothe water ceremony this morning. By the way, gentlemen, both Larry andDuke are water brothers to Mike, too, but don’t let it fret you. They can’t cook. . - but they’re the sort to have at your back in a dark alley.“.If you vouch for them, Jubal,“ van Tromp assured him, .admit them and tylethe door. But let’s drink to the girls while we’re alone. Sven, what’s that toastof yours to the flickas?“.You mean the one to all pretty girls everywhere? Let’s drink just to the fourwho are here. Skim!!“ They drank to their female water brothers and Nelsoncontinued, .Jubal, where do you find them?“.Raise .em in my own cellar. Then just when I’ve got .em trained and someuse to me, some city slicker always comes along and marries them. It’s alosing game.“.I can see how you suffer,“ Nelson said sympathetically. 　　.I do. I trust all of you gentlemen are married?“Two were. Mahmoud was not. Jubal looked at him bleakly. .Would you havethe grace to discorporate yourself? After lunch, of course-I wouldn’t want youto do it on an empty stomach.“.I’m no threat, I’m a permanent bachelor.“.Come, come, sir! I saw Dorcas making eyes at you ... and you werepurring.“.I’m safe, I assure you.“ Mahmoud thought of telling Jubal that he wouldnever marry out of his faith, decided that a gentile would take it amiss-even arare exception like Jubal. He changed the subject. .But, Jubal, don’t make asuggestion like that to Mike. He wouldn’t grok that you were joking-and youmight have a corpse on your hands. I don’t know . . . I don’t know that Mikecan actually think himself dead. But he would try . . . and if he were truly aMartian, it would work.“.I’m sure he can,“ Nelson said firmly. .Doctor-.Jubal,’ I mean- have younoticed anything odd about Mike’s metabolism?“.Uh, let me put it this way. There isn’t anything about his metabolism which Ihave noticed that is not odd. Very.“.Exactly.“Jubal turned to Mahmoud. .But don’t worry that I might invite Mike to suicide. 　　I’ve learned not to joke with him, not ever. I grok that he doesn’t grok joking.“Jubal blinked thoughtfully. .But I don’t grok .grok’ -not really. Stinky, youspeak Martian.“.A little.“.You speak it fluently, I heard you. Do you grok .grok’?“Mahmoud looked very thoughtful. .No. Not really. .Grok’ is the most importantword in the Martian language-and I expect to spend the next forty yearstrying to understand it and perhaps use some millions of printed words tryingto explain it. But I don’t expect to be successful. You need to think in Martianto grok the word .grok.’ Which Mike does and I don’t. Perhaps you havenoticed that Mike takes a rather veering approach to some of the simplesthuman ideas?“.Have I! My throbbing head!“.Mine, too.“.Food,“ announced Jubal. .Lunch, and about time, too. Girls, put it downwhere we can reach it and maintain a respectful silence. Go on talking,Doctor, if you will. Or does Mike’s presence make it better to postpone it?“.Not at all.“ Mahmoud spoke briefly in Martian to Mike. Mike answered him,smiled sunnily; his expression became blank again and he applied himself tofood, quite content to be allowed to eat in silence. .I told him what I wastrying to do and he told me that I would speak rightly; this was not his opinionbut a simple statement of fact, a necessity. I hope that if I fail to, he will noticeand tell me. But I doubt if he will. You see, Mike thinks in Martian-and thisgives him an entirely different .map’ of the universe from that which you and Iuse. You follow me?“.I grok it,“ agreed Jubal. .Language itself shapes a man’s basic ideas.“.Yes, but- Doctor, you speak Arabic, do you not?“.Eh? I used to, badly, many years ago,“ admitted Jubal. .Put in a while as asurgeon with the American Field Service, in Palestine. But I don’t now. I stillread it a little . . . because I prefer to read the words of the Prophet in theoriginal.“.Proper. Since the Koran cannot be translated-the .map’ changes ontranslation no matter how carefully one tries. You will understand, then, howdifficult I found English. It was not alone that my native language has muchsimpler inflections and more limited tenses; the whole .map’ changed. 　　English is the largest of the human tongues, with several times thevocabulary of the second largest language-this alone made it inevitable thatEnglish would eventually become, as it did, the lingua franca of this planet,for it is thereby the richest and the most flexible-despite its barbaricaccretions . . . or, I should say, because of its barbaric accretions. Englishswallows up anything that comes its way, makes English out of it. Nobodytried to stop this process, the way some languages are policed and haveofficial limits . . probably because there never has been, truly, such a thing as.the King’s English’-for .the King’s English’ was French. English was in truth abastard tongue and nobody cared how it grew . . . and it did!-enormously. 　　Until no one could hope to be an educated man unless he did his best toembrace this monster. 　　.Its very variety, subtlety, and utterly irrational, idiomatic complexity makes itpossible to say things in English which simply cannot be said in any otherlanguage. It almost drove me crazy . . . until I learned to think in it-and thatput a new .map’ of the world on top of the one I grew up with. A better one, inmany ways-certainly a more detailed one. 　　.But nevertheless there are things which can be said in the simple Arabictongue that cannot be said in English.“Jubal nodded agreement. .Quite true. That’s why I’ve kept up my readingof it, a little.“.Yes. But the Martian language is so much more complex than is English-andso wildly different in the fashion in which it abstracts its picture of theuniverse-that English and Arabic might as well be considered one and thesame language, by comparison. An Englishman and an Arab can learn tothink each other’s thoughts, in the other’s language. But I’m not certain that itwill ever be possible for us to think in Martian (other than by the uniquefashion Mike learned it)-oh, we can learn a sort of a .pidgin’ Martian, yes-thatis what I speak. 　　.Now take this one word: .grok.’ Its literal meaning, one which I suspect goesback to the origin of the Martian race as thinking, speaking creatures-andwhich throws light on their whole .map’-is quite easy. .Grok’ means .to drink.’“.Huh?“ said Jubal. .But Mike never says .grok’ when he’s just talking aboutdrinking. He-. 　　.Just a moment.“ Mahmoud spoke to Mike in Martian. 　　Mike looked faintly surprised and said, .’Grok’ is drink,“ and dropped thematter. 　　.But Mike would also have agreed,“ Mahmoud went on, .if I had named ahundred other English words, words which represent what we think of asdifferent concepts, even pairs of antithetical concepts. And .grok’ means all ofthese, depending on how you use it. It means .fear,’ it means .love,’ it means.hate’-proper hate, for by the Martian .map’ you cannot possibly hate anythingunless you grok it completely, understand it so thoroughly that you mergewith it and it merges with you-then and only then can you hate it. By hatingyourse1f~ But this also implies, by necessity, that you love it, too, and cherishit and would not have it otherwise. Then you can hate- and (I think) thatMartian hate is an emotion so black that the nearest human equivalent couldonly be called a mild distaste.“Mahmoud screwed up his face. .It means .identically equal’ in themathematical sense. The human cliché, .This hurts me worse than it doesyou’ has a Martian flavor to it, if only a trace. The Martians seem to knowinstinctively what we learned painfully from modern physics, that the observerinteracts with the observed simply through the process of observation. .Grok’ 　　means to understand so thoroughly that the observer becomes a part of theprocess being observed-to merge, to blend, to intermarry, to lose personalidentity in group experience. It means almost everything that we mean byreligion, philosophy, and science-and it means as little to us as color meansto a blind man.“ Mahmoud paused. .Jubal, if I chopped you up and made aStew of you, you and the stew, whatever else was in it, would grok-and whenI ate you, we would grok together and nothing would be lost and it would notmatter which one of us did the chopping up and eating.“.It would to me!“ Jubal said firmly. 　　.You aren’t a Martian.“ Mahmoud stopped again to talk to Mike inMartian. 　　Mike nodded. .You spoke rightly, my brother Dr. Mahmoud. I am beensaying so. Thou art God.“Mahmoud shrugged helplessly. .You see how hopeless it is? All I got was ablasphemy. We don’t think in Martian. We can’t“.Thou art God,“ Mike said agreeably. .God groks.“.Hell, let’s change the subject! Jubal, could I impose on my fraternal statusfor some more gin?“.I’ll get it,“ said Dorcas, and jumped up. 　　It was a pleasant family picnic, made easy by Jubal’s gift for warm informality,a gift shared by his staff, plus the fact that the three newcomers werethemselves the same easy sort of people-each learned, acclaimed, and withno need to strive. And all four men shared a foster-father interest in Mike. 　　Even Dr. Mahmoud, rarely truly off guard with those who did not share withhim the one true faith in submission to the Will of God, always beneficent,merciful, found himself relaxed and happy. It had pleased him very much tolearn that Jubal read the words of the Prophet and, now that he stopped tonotice it, the women of Jubal’s household were really much plumper than hehad thought at first glance. That dark one- But he put the thought out of hismind; he was a guest. 　　But it pleased him very much that these women did not chatter, did notintrude themselves into the sober talk of men, but were very quick with foodand drink in warm hospitality. He had been shocked at Miriam’s casualdisrespect toward her master-then recognized it for what it was: libertypermitted cats and favorite children in the privacy of the home. 　　Jubal explained early that they were doing nothing but waiting on word fromthe Secretary General. .If he means business-and I think he’s ready to dealwemay hear from him yet today. If not, we’ll go home this evening . . andcome back if we have to. But if we had stayed in the Palace, he might havebeen tempted to dicker. Here, dug into our own hole, we can refuse todicker.“.Dicker for what?“ asked Captain van Tromp. .You gave him what hewanted.“.Not all that he wanted. Douglas would rather have that power of attorney beutterly irrevocable . . . instead of on his good behavior, with the powerreverting to a man he despises and is afraid of-namely that scoundrel therewith the innocent smile, our brother Ben, But there are others besidesDouglas who are certain to want to dicker, too. That bland buddha Kunghatesmy guts, I’ve just snatched the rug out from under him. But if he couldfigure a deal that might tempt us-before Douglas nails this down-he wouldoffer it. So we stay out of his way, too. Kung is one reason why we are eatingand drinking nothing that we did not fetch with us.“.You really feel that’s something to worry about?“ asked Nelson. .Truthfully,Jubal, I had assumed that you were a gourmet who insisted on his owncuisine even away from home. I can’t imagine being poisoned, in a majorhotel such as this.“Jubal shook his head sorrowfully. .Sven, you’re the sort of honest man whothinks everybody else is honest-and you are usually right. No, nobody isgoing to try to poison you . . . but your wife might collect your insurancesimply because you shared a dish with Mike.“.You really think that?“.Sven, I’ll order anything you want. But I won’t touch it and I won’t let Miketouch it. For I’ll lay heavy odds that any waiter who comes to this suite will beon Kung’s payroll . . . and maybe on two or three others’. I’m not seeingboogie men behind bushes; they know where we are-and they’ve had acouple of hours in which to act. Sven, in cold seriousness, my principal worryhas been to keep this lad alive long enough to figure out a way to sterilizeand stabilize the power he represents . . . so that it would be to no one’sadvantage to have him dead.“Jubal sighed. .Consider the black widow spider. It’s a timid little beastie,useful and, for my taste, the prettiest of the arachnids, with its shiny, patentleatherfinish and its red hourglass trademark. But the poor thing has the fatalmisfortune of possessing enormously too much power for its size. Soeverybody kills it on sight. 　　.The black widow can’t help it, it has no way to avoid its venomous power. 　　.Mike is in the same dilemma. He isn’t as pretty as a black widow spider-. 　　.Why, Jubal!“ Dorcas said indignantly. .What a mean thing to say! And howutterly untrue!“.Sorry, child. I don’t have your glandular bias in the matter. Pretty or not,Mike can’t get rid of that money, nor is it safe for him to have it. And not justKung. The High Court is not as .non-political’ as it might be although theirmethods would probably make a prisoner out of him rather than kill him-a fatewhich, for my taste, is worse. Not to mention a dozen other interested parties,in and out of public office . . . persons who might or might not kill him, butwho have certainly turned over in their minds just how it would affect theirfortunes if Mike were guest of honor at a funeral. I-. 　　.Telephone, Boss.“.Anne, you have just interrupted a profound thought. You hail fromPorlock.“.No, Dallas.“.And I will not answer the phone for anyone.“.She said to tell you it was Becky.“.Why didn’t you say so?“ Jubal hurried out of the living room, found MadameVesant’s friendly face in the screen. .Becky! I’m glad to see you, girl!“ He didnot bother to ask how she had known where to call him. 　　.Hi, Doc. I caught your act-and I just had to call and tell you so.“.How’d it look?“.The Professor would have been proud of you. I’ve never seen a tip turnedmore expertly. Then you spilled .em before the marks knew what had hit .em. 　　Dot, the profession lost a great talker when you weren’t born twins.“.That’s high praise, coming from you, Becky.“ Jubal thought rapidly. .But youset up the act; I just cashed in on it-and there’s plenty of cash. So name yourfee, Becky, and don’t be shy.“ He decided that, whatever figure she picked,he would double it. That drawing account he had demanded for Mike wouldnever feel it . . . and it was better, far better, to pay Becky off lavishly than tolet the obligation stay open. 　　Madame Vesant frowned. .Now you’ve hurt my feelings.“.Becky, Becky! You’re a big girl now, dear. Anybody can clap and cheer-butapplause worthwhile will be found in a pile of soft, green, folding money. Notmy money. The Man from Mars picks up this tab and, believe me, he canafford it.“ He grinned. .But all you’ll get from me is thanks, and a hug and akiss that will crack your ribs the first time I see you.“She relaxed and smiled. .I’ll hold you to it. I remember how you used to patmy fanny while you assured me that the Professor was sure to get well-youalways could make a body feel better.“.I can’t believe that I ever did anything so unprofessional.“.You did, you know you did. And you weren’t very fatherly about it, either.“.Maybe so. Maybe I thought it was the treatment you needed. I’ve given upfanny-patting for Lent-but I’ll make an exception in your case.“.You’d better.“.And you’d better figure out that fee. Don’t forget the zeroes.“.Uh, I’ll think about it. But, truthfully, Doc, there are more ways of collecting afee than by making a fast count on the change. Have you been watching themarket today?“.No, and don’t tell me about it. Come over and have a drink instead.“.Uh, I’d better not. I promised, well, a rather important client that I would beavailable for instant consultation.“.I see. Mmm ... Becky do you suppose that the stars would show that thiswhole matter would turn out best for everybody if it were all wrapped up,signed, sealed, and notarized today? Maybe just after the stock marketcloses?“She looked thoughtful. .I could look into it.“.You do that. And come stay with us when you aren’t so busy. Stay as longas you like and never wear your hurtin’ shoes the whole time. You’ll like theboy. He’s as weird as snake’s suspenders but sweet as a stolen kiss, too.“.Uh... I will. As soon as I can. Thanks, Doc.“They said good-by and Jubal returned to find that Dr. Nelson had taken Mikeinto one of the bedrooms and was checking him over. He joined them to offerNelson the use of his kit since Nelson had not had with him his professionalbag. 　　Jubal found Mike stripped down and the ship’s surgeon looking baffled. 　　.Doctor,“ Nelson said, almost angrily, .I saw this patient only ten days ago. 　　Tell me where he got those muscles?“.Why, he sent in a coupon from the back cover of Rut: The Magazine for He-Men. You know, the ad that tells how a ninety-pound weakling can-. 　　.Doctor, please!“.Why don’t you ask him?“ Jubal suggested. 　　Nelson did so. .I thinked them,“ Mike answered. 　　.That’s right,“ Jubal agreed. .He .thinked’ .em. When I got him, just over aweek ago, he was a mess, slight, flabby, and pale. Looked as if he had beenraised in a cave-which I gather he was, more or less. So I told him he had togrow strong. So he did.“.Exercises?“ Nelson said doubtfully. 　　.Nothing systematic. Swimming, when and as he wished.“.A week of swimming won’t make a man look as if he had been sweatingover bar bells for years!“ Nelson frowned. .I am aware that Mike hasvoluntary control over the so-called .involuntary’ muscles, But that is notentirely without precedent. This, on the other hand, requires one to assumethat-. 　　.Doctor,“ Jubal said gently, .why don’t you just admit that you don’t grok itand save the wear and tear?“Nelson sighed. .I might as well. Put your clothes on, Michael.“Somewhat later, Jubal, under the mellowing influence of congenial companyand the grape, was unburdening to the three from the Champion hismisgivings about his morning’s work. .The financial end was simple enough: 　　just tie up Mike’s money so that a struggle over it couldn’t take place. Noteven if he dies, because I’ve let Douglas know privately that Mike’s deathends his stewardship whereas a rumour from a usually reliable source-me, inthis case-has reached Kung and several others to the effect that Mike’s deathwill give Douglas permanent control. Of course, if I had had magical powers, Iwould have stripped the boy not only of all political significance but also ofevery penny of his inheritance. That-. 　　.Why would you have done that, Jubal?“ the captain inteirupted. 　　Harshaw looked surprised. .Are you wealthy, Skipper? I don’t mean: .Areyour bills paid and enough in the sock to buy any follies your taste runs to?’ Imean rich . . . so loaded that the floor sags when you walk around to takeyour place at the head of a board-room table.“.Me?“ Van Tromp snorted. .I’ve got my monthly check, a pension eventually,a house with a mortgage and two girls in college. I’d like to try being wealthyfor a while, I don’t mind telling you!“.You wouldn’t like it.“.Huh! You wouldn’t say that ... if you had two daughters in school.“.For the record, I put four daughters through college, and I went in debt to myarmpits to do it. One of them justified the investment; she’s a leading light inher profession which she practices under her husband’s name because I’m adisreputable old bum who makes money writing popular trash instead ofhaving the grace to be only a revered memory in her paragraph in Who’sWho. The other three are nice people who always remember my birthday anddon’t bother me otherwise I can’t say that an education hurt them. But myoffspring are not relevant save to show that I understand that a man oftenneeds more than he’s got. But you can fix that easily; you can resign from theservice and take a job with some engineering firm that will pay you severaltimes what you’re getting just to put your name on their letterhead GeneralAtomics. Several others, You’ve had offers, haven’t you?“.That’s beside the point,“ Captain van Tromp answered stiffly. .I’m aprofessional man.“.Meaning there isn’t enough money on this planet to tempt you into giving up~0~mafl lg space ships. i understand that.“.But I wouldn’t mind having money, too.“.A little more money won’t do you any good, because daughters can use upten percent more than a man can make in any normal occupation regardlessof the amount. That’s a widely experienced but previously unformulated lawof nature, to be known henceforth as .Harshaw’s Law.’ But, Captain, realwealth, on the scale that causes its owner to hire a battery of finaglers to holddown his taxes, would ground you just as certainly as resigning would.“.Why should it? I would put it all in bonds and just clip coupons.“.Would you? Not if you were the sort of person who acquires great wealth inthe first place. Big money isn’t hard to come by. All it costs is a lifetime ofsinglem1~ed devotion to acquiring it and making it grow into more money, tothe utter exclusion of all other interests. They say that the age of opportunityhas passed. Nonsense! Seven out of ten of the wealthiest men on this planetstarted life without a shilling_-and there are plenty more such strivers on theway up. Such people are not stopped by high taxation nor even by socialism;they simply adapt themselves to new rules and presently they change therules. But no premiere ballerina ever works harder, nor more narrowly, than aman who acquires riches. Captain, that’s not your style; you don’t want tomake money, you simply want to have money-in order to spend it.“.Correct, sir! Which is why I can’t see why you should want to take Mike’swealth away from him.“.Because Mike doesn’t need it and it would cripple him worse than anyphysical handicap. Wealth-great wealth-is a curse . . . unless you aredevoted to the money making game for its own sake. And even then it hasserious drawbacks.“.Oh, nonsense, Jubal, you talk like a harem guard trying to convince a wholeman of the advantages of being a eunuch. Pardon me.“.Very possibly.“ agreed Jubal, .and perhaps for the same reason; the humanmind’s ability to rationalize its own shortcomings into virtues is unlimited, andI am no exception. Since I, like yourself, sir, have no interest in money otherthan to spend it, there has never been the slightest chance that I wouldacquire any significant degree of wealth just enough for my vices. Nor anyteal danger that I would fail to scrounge that modest amount, since anyonewith the savvy not to draw to a small pair can always manage to feed hisvices, whether they be tithing or chewing betel nut. But great wealth? Yousaw that performance this morning. Now answer me truthfully. Do you think Icould have revised it slightly so that I myself acquired all that plunderbecomeits sole manager and de-facto owner while milking off for my ownuse any income I cared to name-and still have rigged the other issues so thatDouglas would have supported the outcome? Could I have done that, sir? 　　Mike trusts me; I am his water brother. Could I have stolen his fortune and soarranged it that the government in the person of Mr. Douglas would havecondoned it?“.Uh ... damn you, Jubal, I suppose you could have.“.Most certainly I could have. Because our sometimes estimable SecretaryGeneral is no more a money-seeker than you are. His drive is political poweradrum whose beat I do not hear. Had I guaranteed to Douglas (oh,gracefully, of course-there is decorum even among thieves) that the Smithestate would continue to bulwark his administration, then I would have beenleft undisturbed to do as I liked with the income and had my actingguardianship made legal.“Jubal shuddered. .I thought that I was going to have to do exactly that, simplyto protect Mike from the vultures gathered around him-and I was panicstricken. 　　Captain, you obviously don’t know what an Old Man of the Seagreat wealth is. It is not a fat purse and time to spend it. Its owner findshimself beset on every side, at every hour, wherever he goes, by persistentpleaders, like beggars in Bombay, each demanding that he invest or giveaway part of his wealth. He becomes suspicious of honest friendship-indeedhonest friendship is rarely offered him; those who could have been his friendsare too fastidious to be jostled by beggars, too proud to risk being mistakenfor one. 　　.Worse yet, his life and the lives of his family are always in danger. Captain,have your daughters ever been threatened with kidnapping?“.What? Good Lord, I should hope not!“.If you possessed the wealth Mike had thrust on him, you would have thosegirls guarded night and day-and even then you would not rest, because youwould never be sure that those very guards were not tempted. Look at therecords of the last hundred or so kidnappings in this country and note howmany of them involved a trusted employee - - and note, too, how few victimsescaped alive. Then ask yourself: is there any luxury wealth can buy which isworth having your daughters’ pretty necks always in a noose?“Van Tromp looked thoughtful. .No. I guess I’ll keep my mortgaged house-it’smore my speed. Those girls are all I’ve got, Jubal.“.Amen. I was appalled at the prospect. Wealth holds no charm for me. All Iwant is to live my own lazy, useless life, sleep in my own bed- and not bebothered! Yet I thought I was going to be forced to spend my last few yearssitting in an office, barricaded by buffers, and working long hours as Mike’sman of business. 　　.Then I had an inspiration. Douglas already lived behind such barricades,already had such a staff. Since I was forced to surrender the power of thatmoney to Douglas merely to ensure Mike’s continued health and freedom,why not make the beggar pay for it by assuming all the headaches, too? Iwas not afraid that Douglas would steal from Mike; only pipsqueak, secondratepoliticians are money hungry-and Douglas, whatever his faults, is nopipsqueak. Quit scowling, Ben, and hope that he never dumps the load onyou. 　　.So I dumped the whole load on Douglas-and now I can go back to mygarden. But, as I have said, the money was relatively simple, once I figured itout. It was the Larkin Decision that fretted me.“Caxton said, .I thought you had lost your wits on that one, Jubal. That sillybusiness of letting them give Mike sovereign .honors.’ Honors indeed! ForGod’s sake, Jubal, you should simply have had Mike sign over all right, title,and interest, if any, under that ridiculous Larkin theory. You knew Douglaswanted him to-Jill told you.“.Ben m’boy,“ Jubal said gently, .as a reporter you are hard-working andsometimes readable.“.Gee, thanks! My fan.“.But your concepts of strategy are Neanderthal.“Caxton sighed. .I feel better, Jubal. For a moment there I thought you hadbecome softly sentimental in your old age.“.When I do, please shoot me. Captain, how many men did you leave onMars?“.Twenty-three.“.And what is their status, under the Larkin Decision?“Van Tromp looked troubled. .I’m not supposed to talk.“.Then don’t,“ Jubal reassured him. .I can deduce it, and so can Ben.“Dr. Nelson said, .Skipper, both Stinky and I are civilians again. I shall talkwhere and how I please-. 　　.And shall I,“ agreed Mahmoud. 　　.-and if they want to make trouble for me, they know what they can do withmy reserve commission. What business has the government, telling us wecan’t talk? Those chair-warmers didn’t go to Mars. We did.“.Stow it, Sven. I intended to talk-these are our water brothers. But, Ben, Iwould rather not see this in your column. I would like to command a spaceship again.“.Captain, I know the meaning of .off the record.’ But if you’ll feel easier, I’lljoin Mike and the girls for a while-I want to see Jill anyhow.“.Please don’t leave. But ... this is among water brothers. The government isin a stew about that nominal colony we left behind. Every man in it joined insigning away his so-called Larkin rights-assigned them to the governmentbeforewe left Earth. Mike’s presence when we got to Mars confused thingsenormously. I’m no lawyer, but I understood that, if Mike did waive his rights,whatever they might be, that would put the administration in the driver’s seatwhen it came to parceling out things of value.“.What things of value?“ demanded Caxton. .Other than pure science, I mean. 　　Look, Skipper, I’m not running down your achievement, but from all I’ve seenand heard, Mars isn’t exactly valuable real estate for human beings. Or arethere assets that are still classified .drop dead before reading’?“Van Tromp shook his head. .No, the scientific and technical reports are alldeclassified, I believe. But, Ben, the Moon was a worthless hunk of rockwhen we first got it. Now look at it.“.Touché,“ Caxton admitted. .I wish my grandpappy had bought LunarEnterprises instead of Canadian uranium. I don’t have Jubal’s objections tobeing rich.“ He added, .But, in any case, Mars is already inhabited.“Van Tromp looked unhappy. .Yes. But- Stinky, you tell him.“Mahmoud said, .Ben, there is plenty of room on Mars for human colonization. . . and, so far as I was ever able to find out, the Martians would not interfere. 　　They did not object when we told them we intended to leave a colony behind. 　　Nor did they seem pleased. Not even interested. We’re flying our flag andclaiming extraterritoriality right now. But our status may be more like that ofone of those ant cities under glass one sometimes sees in school rooms. Iwas never able to grok it.“Jubal nodded. .Precisely. Myself, too. This morning I did not have theslightest idea of the true situation . . . except that I knew that the governmentwas anxious to get those so-called Larkin rights from Mike. Beyond that I wasignorant. So I assumed that the government was equally ignorant and wentboldly ahead. .Audacity, always audacity’-soundest principle of strategy. Inpracticing medicine I learned that when you are most at loss is the time whenyou must appear confident. In law I had learned that, when your case seemshopeless, you must impress the jury with your relaxed certainty.“Jubal grinned. .Once, when I was a kid in high school, I won a debate onshipping subsidies by quoting an overwhelming argument from the files of theBritish Colonial Shipping Board. The opposition was totally unable to refuteme-because there never was a .British Colonial Shipping Board.’ I had madeit up, whole cloth. 　　.I was equally shameless this morning. The administration wanted Mike’s.Larkin rights’ and was scared silly that we might make a deal with Kung orsomebody. So I used their greed and worry to wring out of them that ultimatelogical absurdity of their fantastic legal theory, a public acknowledgment inunmistakable diplomatic protocol that Mike was a sover eign equal of theFederation itself-and must be treated accordingly!“ Jubal looked smug. 　　.Thereby,“ Ben said dryly, .putting yourself up the well-known creekwithout a paddle.“.Ben, Ben,“ Jubal said chidingly. .Wrong metaphor. Not a canoe, but a tiger. 　　Or a throne. By their own logic they had publicly crowned Mike. Need I pointout that, despite the old saw about uneasy heads and crowns, it isnevertheless safer to be publicly a king than it is to be a pretender in hiding? 　　A king can usually abdicate to save his neck; a pretender may renounce hispretensions but it makes his neck no safer-less so, in fact; it leaves himnaked to his enemies. No, Ben, Kung saw that Mike’s position had beenenormously strengthened by a few bars of music and an old sheet, even ifyou did not-and Kung did not like it a bit. 　　.But I acted through necessity, not choice, and, while Mike’s position wasimproved, it was still not an easy one. Mike was, for the nonce, theacknowledged sovereign of Mars under the legalistic malarky of the Larkinprecedent . . . and, as such, was empowered to hand out concessions,trading rights, enclaves, ad nauseam. He must either do these things himself. . . and thus be subjected to pressures even worse than those attendant ongreat wealth and for which he is even less fitted-or he must abdicate histitular position and allow his Larkin rights to devolve on those twenty-threemen now on Mars, i.e., to Douglas.“Jubal looked pained. .I disliked these alternatives almost equally, since eachwas based on the detestable doctrine that the Larkin Decision could apply toinhabited planets. Gentlemen, I have never met any Martians, I have novocation to be their champion-but I could not permit a client of mine to betrapped into such a farce. The Larkin Decision itself had to be rendered void,and all .rights’ under it, with respect to the planet Mars-while the matter wasstill in our hands and without giving the High Court a chance to rule.“Jubal grinned boyishly. .So I appealed to a higher court for a decision thatwould nullify the Larkin precedent-I cited a mythical .British Colonial ShippingBoard.’ I lied myself blue in the face to create a new legal theory. Sovereignhonors had been rendered Mike; that was fact, the world had seen it. Butsovereign honors may be rendered to a sovereign . . . or to a sovereign’salter ego, his viceroy or ambassador. So I asserted that Mike was nocardboard sovereign under a silly human precedent not in point-but in awfulfact the ambassador of the great Martian nation!“Jubal sighed. .Sheer bluff ... and I was scared silly that I would be required toprove my claims. But I was staking my bluff on my hope and strong belief thatothers-Douglas, and in particular, Kung-would be no more certain of the factsthan was I.“ Jubal looked around him. .But I ventured to risk that bluffbecause you three were sitting with us, were Mike’s water brethren. If youthree sat by and did not challenge my lies, then Mike must be accepted asthe Martian equivalent of ambassador- and the Larkin Decision was a deadissue.“.I hope it is,“ Captain van Tromp said soberly, .but I did not take yourstatements as lies, Jubal; I took them as simple truth.“.Eh? But I assure you they were not. I was spinning fancy words,extemporizing.“.No matter. Inspiration or deduction-I think you told the truth.“ The skipper ofthe Champion hesitated. .Except that I would not call Mike an ambassador-Ithink he’s an expeditionary force.“Caxton’s jaw dropped. Harshaw did not dispute him but answered with equalsoberness. .In what way, sir?“Van Tromp said, .I’ll amend that. It would be better to say that I think he’s ascout for an expeditionary force, reconnoitering us for his Martian masters. Itis even possible that they are in telepathic contact with him at all times, thathe doesn’t even need to report back. I don’t know- but I do know that, aftervisiting Mars, I find such ideas much easier to swallow . . . and I know this: 　　everybody seems to take it for granted that, finding a human being on Mars,we would of course bring him home and that he would be anxious to comehome. Nothing could be further from the truth. Eh, Sven?“.Mike hated the idea,“ agreed Nelson. .We couldn’t even get close to him atfirst; he was afraid of us. Then he was ordered to go back with us and fromthen on he did exactly what we told him to do. He behaved like a soldiercarrying out with perfect discipline orders that scared him silly.“.Just a moment,“ Caxton protested. .Captain, even so-Mars attack us? Mars? 　　You know more about these things than I do, but wouldn’t that be about likeus attacking Jupiter? I mean to say, we have about two and a half times thesurface gravity that Mars has, just as Jupiter has about two and a half timesour surface gravity. Somewhat analogous differences, each way, onpressure, temperature, atmosphere, and so forth. We couldn’t stay alive onJupiter . . . and I don’t see how Martians could stand our conditions. Isn’t thattrue?“.Close enough,“ admitted van Tromp. 　　.Then tell me why we should attack Jupiter? Or Mars attack us?“.Mmm ... Ben, have you seen any of the proposals to attempt a beachhead on Jupiter?“.Yes, but- Well, nothing has ever gotten beyond the dream stage. Itisn’t practical.“.Space flight wasn’t practical less than a century ago. Go back in the filesand see what your own colleagues said about it-oh, say about 1940. TheseJupiter proposals are, at best, no farther than drawing board-but theengineers working on them are quite serious. They think that, by using allthat we’ve learned from deep ocean exploration, plus equipping men withpowered suits in which to float, it should be possible to put human beings onJupiter. And don’t think for a moment that the Martians are any less cleverthan we are. You should see their cities.“.Uh-. said Caxton. .Okay, I’ll shut up. I still don’t see why they wouldbother.“.Captain?“.Yes, Jubal?“.I see another objection-a cultural one. You know the rough division ofcultures into .Apollonian’ and .Dionysian.’“.I know in general what you mean.“.Well, it seems to me that even the Zuni culture would be called .Dionysian’ 　　on Mars. Of course, you’ve been there and I haven’t-but I’ve been talkingsteadily with Mike. That boy was raised in an extremely Apollonian cultureandsuch cultures are not aggressive.“.Mmm ... I see your point-but I wouldn’t count on it.“Mahmoud said suddenly, .Skipper, there’s strong evidence to support Jubal’sconclusion. You can analyse a culture from its language, every time -andthere isn’t any Martian word for .war.’“ He stopped and looked puzzled. .Atleast, I don’t think there is. Nor any word for .weapon’ nor for .fighting.’ If aword for a concept isn’t in a language, then its culture simply doesn’t havethe referent the missing word would symbolize.“.Oh, twaddle, Stinky! Animals fight-and ants even conduct wars. Are youtrying to tell me they have to have words for it before they can do it?“.I mean exactly that,“ Mahmoud insisted, .when it applies to any verbalizingrace. Such as ourselves. Such as the Martians-even more highly verbalizedthan we are. A verbalizing race has words for every old concept . . . andcreates new words or new definitions for old words whenever a new conceptcomes along. Always! A nervous system that is able to verbalize cannotavoid verbalizing; it’s automatic. If the Martians know what .war’ is, then theyhave a word for it.“.There is a quick way to settle it,“ Jubal suggested. .Call in Mike. 　　.Just a moment, Jubal,“ van Tromp objected. .I learned years ago never toargue with a specialist; you can’t win. But I also learned that the history ofprogress is a long, long list of specialists who were dead wrong when theywere most certain-SOr1~Y, Stinky.“.You’re quite right, Captain-Only I’m not wrong this time.“.As may be, all Mike can settle is whether or not he knows a certain word . . . 　　which might be like asking a two-year-old to define .calculus.’ Proves nothing. 　　I’d like to stick to facts for a moment. Sven? About Agnew?“Nelson answered, .It’s up to you, Captain“.Well ... this is still private conversation among water brothers, gentlemen. 　　Lieutenant Agnew was our junior medical officer. Quite brilliant in his line,Sven tells me, and I had no complaints about him otherwise; he was wellenoughliked. But he had an unsuspected latent xenophobia. Not againsthumans. But he couldn’t stand Martians. Now I bad given orders againstgoing armed outside the ship once it appeared that the Martians werepeaceful-too much chance of an incident. 　　.Apparently young Agnew disobeyed me-at least we were never able to findhis personal side arm later and the two men who last saw him alive say thathe was wearing it. But all my log shows is: .Missing and presumed dead.’ 　　.Here is why. Two crewmen saw Agnew go into a sort of passage betweentwo large rocks_rather scarce on Mars; mostly it’s monotonous. Then theysaw a Martian enter the same way . . whereupon they hurried, as Dr. 　　Agnew’s peculiarity was well known. 　　.Both say that they heard a shot. One says that he reached this opening intime to glimpse Agnew past the Martian, who pretty well filled the spacebetween the rocks; they’re so big. And then he didn’t see him. The secondman says that when he got there the Martian was just exiting, simply sailedon past them and went his way-which is characteristically Martian; if he hasno business with you, he simply ignores you. With the Martian out of the waythey could both see the space between the two rocks . . . and it was a deadend, empty. 　　.That’s all, gentlemen ... except to say that Agnew might have jumped thatrock wall, under Mars’ low surface gravity and the impetus of fear-but I couldnot and I tried-and to mention that these two crewmen were wearingbreathing gear-have to, on Mars-and hypoxia can make a man’s senses quiteunreliable. I don’t know that the first crewman was drunk through oxygenshortage; I just mention it because it is an explanation easier to believe thanwhat he reported . . . which is that Agnew simply disappeared~ in the blink ofan eye. In fact I suggested as much to him and ordered him to check thedemand valve and the rest of his breather gear before he went outside again. 　　.You see, I thought Agnew would show up presently ... and I was lookingforward to chewing him out and slapping him under hack for going armed (ifhe was) and for going alone (which seemed certain), both being flagrantbreaches of discipline. 　　.But he never returned, we never found him nor his body. I do not know whathappened. But my own misgivings about Martians date to that incident. Theynever again seemed to me to be just big, gentle~ harmless, rather comicalcreatures, even though we never had any trouble with them and they alwaysgave us anything we wanted, once Stinky figured out how to ask for it. Iplayed down the incident-Can’t let men panic when you’re a hundred millionmiles from home. Oh, I couldn’t play down the fact that Dr. Agnew wasmissing and the whole ship’s company searched for him. But I squelched anysuggestion that there had been anything mysterious about it-Agnew hadgotten lost among those rocks. had eventually died, no doubt, when hisoxygen ran out . . . and was buried under sand drift or something. You do getquite a breeze both at sunrise and sundown on Mars; it does cause the sandto drift. So I used it as a reason to clamp down ever harder on alwaystraveling in company, always staying in radio contact with the ship, alwayschecking breather gear . . . with Agnew as a horrible example. I did not tellthat crewman to keep his mouth shut; I simply hinted that his story wasunbelievable, especially as his mate was not able to back it up. I think theofficial version prevailed.“Mahmond said slowly, .It did with me, Captain-this is the first time I’ve heardthat there was any mystery about Agnew. And truthfully, I prefer your .ofticial’ 　　version-I’m not inclined to be superstitious.“Van Tromp nodded. .That’s what I had hoped for. Only Sven and myselfheard that crewman’s wild tale-and we kept it to ourselves. But, just thesame-. The space ship captain suddenly looked old. .-I still wake up in thenight and ask myself: .What became of Agnew?’“Jubal listened to the story without comment. He was still wondering what heshould add to it when it ended. He wondered, too, if Jill had told Ben aboutBerquist and that other fellow-JOhThsO~~ He knew that he bad not. Therehadn’t been time the night Ben had been rescued . . . and in the sober light ofthe following dawn it had seemed better to let such things ride. 　　Had the kids told Ben about the battle of the swimming pool? And the twocarloads of cops who were missing afterwards? Again, it seemed mostunlikely; the kids knew that the .official“ version was that the first task forcehad never showed up~ they had all heard his phone call with Douglas. AllJubal’s family were discreet; whether guests or employees, gossipy personswere quickly ousted-Jubal regarded gossip as his own prerogative, solely. 　　But Jill might have told Ben-Well, if she had, she must have bound him tosilence; Ben had not mentioned disappearances to Jubal . . . and he wasn’ttrying to catch Jubal’s eye now. 　　Damn it, the only thing to do was to keep quiet and go on trying to impress onthe boy that he simply must not go around making unpleasant strangersdisappear! 　　Jubal was saved from further soul-searching (and the stag conversation wasbroken up) by Anne’s arrival. .Boss, that Mr. Bradley is at the door. The onewho called himself .senior executive assistant to the Secretary General.’ 　　.You didn’t let him in?“.No. I looked at him through the one-way and talked to him through thespeakie. He says he has papers to deliver to you, personally, and that he willwait for an answer.“.Have him pass them through the flap. And you tell him that you are my.senior executive assistant’ and that you will fetch my receipt acknowledgingpersonal delivery if that is what he wants. This is still the Martian EmbassyuntilI check what’s in those papers.“.Just let him stand in the corridor?“.I’ve no doubt that Major Bloch can find him a chair. Anne, I am aware thatyou were gently reared-but this is a situation in which rudeness pays off. Wedon’t give an inch, nor a kind word, until we get exactly what we want.“.Yes, Boss.“The package was bulky because there were many copies; there was onedocument only. Jubal called in everyone and passed them around. .Girls, Iam offering one lollipop for each loophole, boobytrap, or ambiguity-prizes ofsimilar value to males. Now everybody keep quiet.“Presently Jubal broke the silence. .He’s an honest politician-he staysbought.“.Looks that way,“ admitted Caxton. 　　.Anybody?“ No one claimed a prize; Douglas had kept it simple andstraightforward, merely implementing the agreement reached earlier. .Okay,“said Jubal, .everybody is to witness every copy, after Mike signs it-especiallyyou, Skipper, and Sven and Stinky. Get your seal, Miriam. Hell, let Bradley innow and have him witness, too-then give the poor guy a drink. Duke, call thedesk and tell .em to send up the bill; we’re checking out. Then callGreyhound and tell .em we want our go-buggy. Sven, Skipper, Stinky-we’regetting out of here the way Lot left Sodom...why don’t you three come up inthe country with us, take off your shoes, and relax? Plenty of beds, homecooking, and no worries.“The two married men asked for, and received, rain checks; Dr. Mahmoudaccepted. The signing took rather long, mostly because Mike enjoyed signinghis name, drawing each letter with great care and artistic satisfaction. Thesalvageable remains of the picnic (mostly unopened bottles) had been sentup and loaded by the time all copies were signed and sealed, and the hotelbill had arrived. 　　Jubal glanced at the fat total and did not bother to add it. Instead he wrote onit: .Approved for payment-J. Harshaw for V. M. Smith,“ and handed it toBradley. 　　.This is your boss’s worry now,“ he told Bradley. 　　Bradley blinked. .Sir?“.Oh, just to keep it .via channels.’ Mr. Douglas will doubtless turn it over tothe Chief of Protocol. Isn’t that the usual procedure? I’m rather green aboutthese things.“Bradley accepted the bill. .Yes,“ he said slowly. .Yes, that’s right. LaRue willvoucher it-I’ll give it to him.“.Thank you, Mr. Bradley. Thanks for everything!“","sourceLink":"http://novel.tingroom.com/kehuan/255/340.html","bookId":365,"book":{"id":365,"title":"异乡异客 Stranger In A Strange Land","description":"简介： Stranger in a Strange Land is a 1961 science fiction novel by American author Robert A. Heinlein. It tells the story of Valentine Michael Smith, a human who has returned to Earth in early adulthood after being raised by Martians on the plane...","cover":"http://novel.tingroom.com/uploads/110322/1-110322155114I6.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/255","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
