{"id":32542,"no":8,"title":"Chapter 7","content":"DESPITE A LATE EVENING Jill was ready to relieve the night floor nurse tenminutes early the next morning. She intended to obey Ben’s order to stay outof his proposed attempt to see the Man from Mars but she was determined tobe close by when it happened . . . just in case. Ben might needreinforcements.\n 　　There were no longer marine guards in the corridor. Trays, medications, andtwo patients to be prepared for surgery kept her busy the first two hours; shehad only time to check the knob of the door to suite K- 12. It was locked, aswas the door to the adjoining sitting room. The door to the watch room on itsother side was closed. She considered sneaking in again to see Smiththrough the connecting sitting room, now that the guards were gone, butdecided to postpone it; she was too busy. Nevertheless she managed tokeep a close check on everyone who came Onto her floor.\n 　　Ben did not show up and discreet questions asked of her assistant on theswitchboard reassured her that neither Ben nor anyone else had gone in tosee the Man from Mars while Jill was busy elsewhere. It puzzled her; whileBen had not set a time, she had had the impression that he had intended tostorm the citadel as early in the day as possible.\n 　　Presently she felt that she just had to snoop a bit. During a lull she knockedat the door of the Suite’s watch room, then stuck her head in and pretendedsurprise. .Oh! Good morning, Doctor. I thought Doctor Frame was in here.“The physician at the watch desk was strange to Jill. He turned away from thedisplayed physio data, looked at her, then smiled as he looked her up anddown. .I haven’t seen Dr. Frame, Nurse. I’m Dr. Brush. Can I help?“At the typical male reaction Jill relaxed. .Nothing special. To tell the truth Iwas curious. How is the Man from Mars?“She smiled and winked. .It’s no secret to the staff, Doctor. Your patient-. Shegestured at the inner door.\n 　　.Huh?“ He looked startled. .Did they have him in this suite?“.What? Isn’t he here now?“.Not by six decimal places. Mrs. Rose Bankerson-Dr. Garner’s patient. Webrought her in early this morning.“.Really? But what happened to the Man from Mars? Where did they puthim?“.I haven’t the faintest. Say, did I realiy just miss seeing ValentineSmith?“.He was here yesterday. That’s all I know.“.And Dr. Frame was on his case? Some people have all the luck. Look whatI’m stuck with.“ He switched on the Peeping Tom above his desk; Jill sawframed in it, as if she were looking down, a water bed; floating in it was a tinyold woman. She seemed to be asleep.\n 　　.What’s her trouble?“.Mmm ... Nurse, if she didn’t have more money than any person ought tohave, you might be tempted to call it senile dementia. As it is, she is in for arest and a check-up.“Jill made small talk for a few moments more, then pretended to see a calllight. She went back to her desk, dug out the night log-yes, there it was: V M.\n 　　Smith, K-12-zransfer. Below that entry was another: Rose ~ Bankerson(Mrs.)-red K-12 (diet kitchen instrd by Dr. Garner-no orders-fir nt respnbl).\n 　　Having noted that the rich old gal was no responsibility of hers, Jill turned hermind back to Valentine Smith. Something about Mrs. Bankerson’s casestruck her as odd but she could not put her finger on it, so she put it Out ofher mind and thought about the matter that did interest her. Why had theymoved Smith in the middle of the night? To avoid any possible contact withoutsiders, probably. But where had they taken him? Ordinarily she wouldsimply have called .Reception“ and asked, but Ben’s opinions plus the phonybroadcast of the night before had made her jumpy about showing curiosity;she decided to wait until lunch and see what she could pick up on the gossipgrapevine.\n 　　But first Jill went to the floor’s public booth and called Ben. His officeinformed her that Mr. Caxton had just left town, to be gone a few days. Shewas startled almost speechless by this-then pulled herself together and leftword for Ben to call her.\n 　　She then called his home. He was not there; she recorded the samemessage.\n 　　Ben Caxton had wasted no time in preparing his attempt to force his way intothe presence of Valentine Michael Smith. He was lucky in being able to retainJames Oliver Cavendish as his Fair Witness. While any Fair Witness woulddo, the prestige of Cavendish was such that a lawyer was hardly necessarytheold gentleman had testified many times before the High Court of theFederation and it was said that the wills locked up in his head representednot billions but trillions. Cavendish had received his training in total recallfrom the great Dr. Samuel Renshaw himself and his professional hypnoticinstruction had been undergone as a fellow of the Rhine Foundation. His feefor a day or fraction thereof was more than Ben made in a week, but Benexpected to charge it off to the Post syndicate-in any case, the best wasnone too good for this job.\n 　　Caxton picked up the junior Frisby of Biddle, Frisby, Frisby, Biddle, \u0026 Reedas that law firm represented the Post syndicate, then the two younger mencalled for Witness Cavendish. The long, spare form of Mr. Cavendish,wrapped chin to ankle in the white cloak of his profession, reminded Ben ofthe Statue of Liberty . . . and was almost as conspicuous. Ben had alreadyexplained to Mark Fnsby what he intended to try (and Frisby had alreadypointed Out to him that he had no status and no rights) before they called forCavendish; once in the Fair Witness’s presence they conformed to protocoland did not discuss what he might be expected to see and hear.\n 　　The cab dropped them on top of Bethesda Center; they went down to theDirector’s office. Ben handed in his card and said that he wanted to see theDirector.\n 　　An imperious female with a richly cultivated accent asked if he had anappointment. Ben admitted that he had none.\n 　　.Then I am afraid that your chance of seeing Dr. Broemer is very slight. Willyou state your business?“.Just tell him,“ Caxton said loudly, so that others waiting would hear, .thatCaxton of the Crow’s Nest is here with a lawyer and a Fair Witness tointerview Valentine Michael Smith, the Man from Mars.“She was startled almost out of her professional hauteur. But she recoveredand said frostily, .I shall inform him. Will you be seated, please?“.Thanks, I’ll wait right here.“They waited. Frisby broke out a cigar, Cavendish waited with the calmpatience of one who has seen all manner of good and evil and now countsthem both the same, Caxton uttered and tried to keep from biting his nails. Atlast the snow queen behind the desk announced, .Mr. Berquist will see you.“.Berquist? Gil Berquist?“.I believe his name is Mr. Gilbert Berquist.“Caxton thought about it-Gil Berquist was one of Secretary Douglas’s largesquad of stooges, or .executive assistants.“ He specialized in chaperoningofficial visitors. .I don’t want to see Berquist; I want the Director.“But Berquist was already coming out, hand shoved out before him, greeter’sgrin plastered on his face. .Benny Caxton! How are you, chum? Long timeand so forth. Still peddling the same old line of hoke?“ He glanced at the FairWitness, but his expression admitted nothing.\n 　　Ben shook hands briefly. .Same old hoke, sure. What are you doing here,Gil?“.If I ever manage to get Out of public service I’m going to get me a column,too-nothing to do but phone in a thousand words of rumors each day andspend the rest of the day in debauchery. I envy you, Ben.“.I said, .What are you doing here, Gil?’ I want to see the Director, then getfive minutes with the Man from Mars. I didn’t come here for your high-levelbrush off.“.Now, Ben, don’t take that attitude. I’m here because Dr. Broemer has beendriven almost crazy by the press-so the Secretary General sent me over totake some of the load off his shoulders.“.Okay. I want to see Smith.“.Ben, old boy, don’t you realize that every reporter, special correspondent,feature writer, commentator, free-lance, and sob sister wants the samething? You winchells are just one squad in an army; if we let you all haveyour way, you would kill off the poor jerk in twenty-four hours. Polly Peeperswas here not twenty minutes ago. She wanted to interview him on love lifeamong the Martians.“ Berquist threw up both hands and looked helpless.\n 　　.I want to see Smith, Do I see him, or don’t I?“.Ben, let’s find a quiet place where we can talk over a long, tall glass. Youcan ask me anything you want to.“.I don’t want to ask you anything; I want to see Smith. By the way, this is myattorney, Mark Frisby-Biddle \u0026 Frisby.“ As was customary, Ben did notintroduce the Fair Witness; they all pretended that he was not present.\n 　　.I’ve met Frisby,“ Berquist acknowledged. .How’s your father, Mark? Sinusesstill giving him fits?“.About the same.“.This foul Washington climate. Well, come along, Ben. You, too,Mark.“.Hold it,“ said Caxton. .I don’t want to interview you, Gil. I want to seeValentine Michael Smith. I’m here as a member of the press, directlyrepresenting the Post syndicate and indirectly representing over two hundredmillion readers. Do I see him? If I don’t, say so out loud and state your legalauthority for refusing me.“Berquist sighed. .Mark, will you tell this keyhole historian that he can’t gobusting into a sick man’s bedroom just because he has a syndicated column?\n 　　Valentine Smith made one public appearance just last night -against hisphysician’s advice I might add. The man is entitled to peace and quiet and achance to build up his strength and get oriented. That appearance last nightwas enough, more than enough.“.There are rumors,“ Caxton said carefully, .that the appearance last nightwas a fake.“Berquist stopped smiling. .Frisby,“ he said coldly, .do you want to advise yourclient on the law concerning slander?“.Take it easy, Ben.“.I know the law on slander, Gil. In my business I have to. But whom am Islandering? The Man from Mars? Or somebody else? Name a name. Irepeat,“ he went on, raising his voice, .that I have heard that the maninterviewed on TV last night was not the Man from Mars. I want to see himmyself and ask him.“The crowded reception hail was very quiet as everyone present bent an earto the argument. Berquist glanced quickly at the Fair Witness, then got hisexpression under control and said smilingly to Caxton, .Ben, it’s just possiblethat you talked yourself into the interview you wanted-as well as a lawsuit.\n 　　Wait a moment.“He disappeared into the inner office, came back fairly soon. .I arranged it,“ hesaid wearily, .though God knows why. You don’t deserve it, Ben. Comealong. Just you-Mark, I’m sorry but we can’t have a crowd of people; after all,Smith is a sick man.“.No,“ said Caxton.\n 　　.Huh?“.All three of us, or none of us. Take your choice.“.Ben, don’t be silly; you’re receiving a very special privilege. Tell you what-Mark can come along and wait outside the door But you certainly don’t needhim.“ Berquist glanced toward Cavendish; the Witness seemed not to hear.\n 　　.Maybe not. But I’ve paid his fee to have him along. My column will statetonight that the administration refused to permit a Fair Witness to see theMan from Mars.“Berquist shrugged. .Come along, then. Ben, I hope that slander suit reallyclobbers you.“They took the patients’ elevator rather than the bounce tube out of deferenceto Cavendish’s age, then rode a slide-away for a long distance pastlaboratories, therapy rooms, solaria, and ward after ward. They were stoppedonce by a guard who phoned ahead, then let them through; they were at lastushered into a physio-data display room used for watching critically illpatients. .This is Dr. Tanner,“ Berquist announced. .Doctor, this is Mr. Caxtonand Mr. Frisby.“ He did not, of course, introduce Cavendish.\n 　　Tanner looked worried. .Gentlemen, I am doing this against my betterjudgment because the Director insists. I must warn you of one thing. Don’t door say anything that might excite my patient. He is in an extremely neuroticcondition and falls very easily into a state of pathological withdrawal-a trance,if you choose to call it that.“.Epilepsy?“ asked Ben.\n 　　.A layman might easily mistake it for that. It is more like catalepsy. But don’tquote me; there is no clinical precedent for this case.“.Are you a specialist, Doctor? Psychiatry, maybe?“Tanner glanced at Berquist. .Yes,“ he admitted.\n 　　.Where did you do your advanced work?“Berquist said, .Look, Ben, let’s see the patient and get it over with. You canquiz Dr. Tanner afterwards.“.Okay.“Tanner glanced over his dials and graphs, then flipped a switch and staredinto a Peeping Tom, He left the desk, unlocked a door and led them into anadjoining bedroom, putting a finger to his lips as he did so. The other fourfollowed him in. Caxton felt as if he were being taken to .view the remains“and suppressed a nervous need to laugh.\n 　　The room was quite gloomy. .We keep it semi-darkened because his eyesare not accustomed to our light levels,“ Tanner explained in a hushed voice.\n 　　He turned to a hydraulic bed which filled the center of the room. .Mike, I’vebrought some friends to see you.“Caxton pressed closer, Floating therein, half concealed by the way his bodysank into the plastic skin covering the liquid in the tank and farther concealedby a sheet up to his armpits, was a young man. He looked back at them butsaid nothing; his smooth, round face was expressionless.\n 　　So far as Ben could tell this was the man who had been on stereo the nightbefore. He had a sudden sick feeling that little Jill, with the best of intentions,had tossed him a live grenade-a slander suit that might very well bankrupthim. .You are Valentine Michael Smith?“.Yet“.The Man from Mars?“.Yet“.You were on stereo last night?“The man in the tank bed did not answer. Tanner said, .I don’t think he knowsthe word. Let me try. Mike, you remember what you did with Mr. Douglas lastnight?“The face looked petulant. .Bright lights. Hurt.“.Yes, the lights hurt your eyes. Mr. Douglas had you say hello topeople.“The patient smiled slightly. .Long ride in chair.“.Okay,“ agreed Caxton. .I catch on. Mike, are they treating you all righthere?“.Yes.“.You don’t have to stay here, you know. Can you walk?“Tanner said hastily, .Now see here, Mr. Caxton-. Berquist put a hand on hisarm and he shut up.\n 　　.I can walk ... a little. Tired.“.I’ll see that you have a wheel chair. Mike, if you don’t want to stay here, I’llhelp you get out of bed and take you anywhere you want to go.“Tanner shook off Berquist’s hand and said, .I can’t have you interferingwith my patient!“.He’s a free man, isn’t he?“ Caxton persisted. .Or is he a prisoner here?“Berquist answered, .Of course he is a free man! Keep quiet, Doctor. Let thefool dig his own grave.“.Thanks, Gil. Thanks all to pieces. So he is free to leave if he wants to. Youheard what he said, Mike. You don’t have to stay here. You can go anywhereyou like. I’ll help you.“The patient glanced fearfully at Tanner. .No! No, no, no!“.Okay, okay.“Tanner snapped, .Mr. Berquist, this has gone quite far enough! My patientwill be upset the rest of the day.“.All right, Doctor. Ben, let’s get the show on the road. You’ve had enough,surely.“.Ub ... just one more question.“ Caxton thought hard, trying to think what hecould squeeze out of it. Apparently Jill had been wrong- yet she had not beenwrong!-or so it had seemed last night. But something did not quite fit althoughhe could not tell what it was.\n 　　.One more question,“ Berquist begrudged.\n 　　.Thanks. Uh ... Mike, last night Mr. Douglas asked you some questions.“ Thepatient watched him but made no comment. .Let’s see, he asked you whatyou thought of the girls here on Earth, didn’t he?“The patient’s face broke into a big smile. .Gee!“.Yes. Mike ... when and where did you see these girls?“The smile vanished. The patient glanced at Tanner, then he stiffened, hiseyes rolled up, and he drew himself into the foetal position, knees drawn up,head bent, and arms folded across his chest.\n 　　Tanner snapped, .Get them out of here!“ He moved quickly to the tank bedand felt the patient’s wrist.\n 　　Berquist said savagely, .That tears it! Caxton, will you get out? Or shall I callthe guards and have you thrown out?“.Oh, we’re getting out all right,“ Caxton agreed. All but Tanner left the roomand Berquist closed the door.\n 　　.Just one point, Gil,“ Caxton insisted. .You’ve got him boxed up in there . . .\n 　　so just where did he see those girls?“.Eh? Don’t be silly. He’s seen lots of girls. Nurses ... laboratory technicians.\n 　　You know.“.But I don’t know. I understood he had nothing but male nurses and thatfemale visitors had been rigidly excluded.“.Eh? Don’t be any more preposterous than you have to be.“ Berquist lookedannoyed, then suddenly grinned. .You saw a nurse with him on stereo justlast night.“.Oh. So I did.“ Caxton shut up and let himself be led out.\n 　　They did not discuss it further until the three were in the air, headed forCavendish’s home. Then Frisby remarked, .Ben, I don’t suppose theSecretary General will demean himself to sue you, since you did not print it.\n 　　Still, if you really do have a source for that rumor you mentioned, we hadbetter perpetuate the evidence. You don’t have much of a leg to stand on,you know.“.Forget it Mark. He won’t sue.“ Ben glowered at the floor of the cab. .How dowe know that was the Man from Mars?“.Eh? Come off it, Ben.“.How do we know? We saw a man about the right age in a hospital bed. Wehave Berquist’s word for it-and Berquist got his start in politics issuingdenials; his word means nothing. We saw a total stranger, supposed to be apsychiatrist . . . and when I tried to find out where he had studied psychiatry Igot euchred out. How do we know? Mr. Cavendish, did you see or hearanything that convinced you that this bloke was the Man from Mars?“Cavendish answered carefully, .It is not my function to form opinions. I see, Ihear-that is all.“.Sorry.“.By the way, are you through with me in my professional capacity?“.Huh? Oh, sure. Thanks, Mr. Cavendish.“.Thank you, sir. It was an interesting assignment.“ The old gentleman took offthe cloak that set him apart from ordinary mortals, folded it carefully and laidit on the seat. He sighed, relaxed, and his features lost professionaldetachment, warmed and mellowed. He took out cigars, offered them to theothers; Frisby took one and they shared a light. .I do not smoke,“ Cavendishremarked through a thick cloud, .while on duty. It interferes with optimumfunctioning of the senses.“.If I had been able to bring along a crew member of the Champion,“ Caxtonpersisted, .I could have tied it down. But I thought surely I could tell.“.I must admit,“ remarked Cavendish, .that I was a little surprised at one thingyou did not do.“.Huh? What did I miss?“.Calluses“.Calluses?“.Surely. A man’s life history can be told from his calluses. I once did amonograph on them, published in The Witness Quarterly- like SherlockHolmes’ famous monograph on tobacco ash. This young man from Marssince he has never worn our sort of shoes and has lived in gravity about onethird of ours, should display foot calluses consonant with his formerenvironment. Even the time he recently spent in space should have left theirtraces. Very interesting.“.Damn! Good Lord, Mr. Cavendish, why didn’t you suggest it to me?“.Sir?“ The old man drew himself up and his nostrils dilated. .It would not havebeen ethical. I am a Fair Witness, not a participant. My professionalassociation would suspend me for much less. Surely you know that.“.Sorry. I forgot myself.“ Caxton frowned. .Let’s wheel this buggy around andgo back. We’ll take a look at his feet-or I’ll bust the place down withBerquist’s fat head!“.I’m afraid you will have to find another Witness ... in view of my indiscretionin discussing it, even after the fact.“.Uh, yes, there’s that.“ Caxton frowned.\n 　　.Better just calm down, Ben,“ advised Frisby. .You’re in deep enough now.\n 　　Personally, I’m convinced it was the Man from Mars. Occam’s razor, leasthypothesis, just plain horse sense.“Caxton dropped them, then set the cab to cruise while he thought. Presentlyhe punched the combination to take him back to Bethesda Medical Center.\n 　　He was less than half way back to the Center when he realized that his tripwas useless. What would happen? He would get as far as Berquist, nofarther. He had been allowed in once-with a lawyer, with a Fair Witness. Todemand to be allowed to see the Man from Mars a second time, all in onemorning, was unreasonable and would be refused. Nor, since it wasunreasonable, could he make anything effective out of it in his column.\n 　　But he bad not acquired a widely syndicated column through being balked.\n 　　He intended to get in.\n 　　How? Well, at least he now knew where the putative .Man from Mars“ wasbeing kept. Get in as an electrician? Or as a janitor? Too obvious; he wouldnever get past the guard, not even as far as .Dr. Tanner.“Was .Tanner“ actually a doctor? It seemed unlikely. Medical men, even theworst of them, tended to shy away from hanky-panky contrary to theirprofessional code. Take that ship’s surgeon, Nelson-he had quit, washed hishands of the case simply because- Wait a minute! Dr. Nelson was one manwho could tell offhand whether that young fellow was the Man from Mars,without checking calluses, using trick questions, or anything. Caxton reachedfor buttons, ordered his cab to ascend to parking level and hover, andimmediately tried to phone Dr. Nelson, relaying through his office for thepurpose since he neither knew where Dr. Nelson was, nor had with him themeans to find out. Nor did his assistant Osbert Kilgallen know where he was,either, but he did have at hand resources to find out; it was not evennecessary to draw on Caxton’s large account of uncollected favors in theEnclave, as the Post syndicate’s file on Important Persons placed him atonce in the New Mayflower. A few minutes later Caxton was talking with him.\n 　　To no purpose-Dr. Nelson had not seen the broadcast. Yes, he had heardabout it; no, he had no reason to think the broadcast had been faked. Did Dr.\n 　　Nelson know that an attempt had been made to coerce Valentine Smith intosurrendering his rights to Mars under the Larkin Decision? No, he did notknow it, had no reason to believe so . . . and would not be interested if it weretrue; it was preposterous to talk about anyone .owning“ Mars; Mars belongedto the Martians. So? Let’s propose a hypothetical question, Doctor; ifsomeone were trying to- But Dr. Nelson had switched off. When Caxton triedto reconnect, a recorded voice stated sweetly: .The subscriber has voluntarilysuspended service temporarily. If you care to record-. Caxton switched off.\n 　　Caxton made a foolish statement concerning Dr. Nelson’s parentage. Butwhat he did next was much more foolish; he phoned the Executive Palace,demanded to speak to the Secretary General.\n 　　His action was more a reflex than a plan. In his years as a snooper, first as areporter, then as a lippmann, he had learned that close-held secrets couldoften be cracked by going all the way to the top and there making himselfunbearably unpleasant. He knew that such twisting of the tiger’s tail wasdangerous, for he understood the psychopathology of great power asthoroughly as Jill Boardman lacked knowledge of it-but he had habituallyrelied on his relative safety as a dealer in still another sort of power almostuniversally feared and appeased by the powerful.\n 　　What he forgot was, that in phoning the Palace from a taxicab, he was notdoing so publicly.\n 　　Caxton was not put through to the Secretary General, nor had he expected tobe. Instead he spoke with half a dozen underlings and became moreaggressive with each one. He was so busy that he did not notice it when hiscab ceased to hover and left the parking level.\n 　　When he did notice it, it was too late; the cab refused to obey the orders heat once punched into it. Caxton realized bitterly that he had let himself betrapped by a means no professional hoodlum would fall for: his call had beentraced, his cab identified, its idiot robot pilot placed under orders of an overridingpolice frequency-and the cab itself was being used to arrest him andfetch him in, all most privately and with no fuss,He wished keenly that he had kept Fair Witness Cavendish with him. But hewasted no time on this futility but cleared the useless call from the radio andtried at once to call his lawyer, Mark Frisby.\n 　　He was still trying when the taxicab landed inside a courtyard landing fiat andhis signal was cut off by its walls. He then tried to leave the cab, found thatthe door would not open-and was hardly surprised to discover that he wasbecoming very light-headed and was fast losing consciousness-\n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/255/326.html","bookId":365,"book":{"id":365,"title":"异乡异客 Stranger In A Strange Land","description":"简介： Stranger in a Strange Land is a 1961 science fiction novel by American author Robert A. Heinlein. It tells the story of Valentine Michael Smith, a human who has returned to Earth in early adulthood after being raised by Martians on the plane...","cover":"http://novel.tingroom.com/uploads/110322/1-110322155114I6.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/255","creation":"Aug 1, 2019 12:18:39 AM","modification":"Aug 1, 2019 12:18:39 AM"}}
