{"id":5549,"no":12,"title":"Chapter 12","content":"12:1 [hgb] 你 趁 着 年 幼 ， 衰 败 的 日 子 尚 未 来 到 ， 就 是 你 所 说 ， 我 毫 无 喜 乐 的 那 些 年 日 未 曾 临 近 之 先 ， 当 记 念 造 你 的 主 。 \n [kjv] Remember now thy Creator in the days of thy youth, while the evil days come not, nor the years draw nigh, when thou shalt say, I have no pleasure in them; \n [bbe] Let your mind be turned to your Maker in the days of your strength, while the evil days come not, and the years are far away when you will say, I have no pleasure in them; \n 12:2 [hgb] 不 要 等 到 日 头 ， 光 明 ， 月 亮 ， 星 宿 ， 变 为 黑 暗 ， 雨 后 云 彩 反 回 ， \n [kjv] While the sun, or the light, or the moon, or the stars, be not darkened, nor the clouds return after the rain: \n [bbe] While the sun, or the light, or the moon, or the stars, are not dark, and the clouds come not back after the rain; \n 12:3 [hgb] 看 守 房 屋 的 发 颤 ， 有 力 的 屈 身 ， 推 磨 的 稀 少 就 止 息 ， 从 窗 户 往 外 看 的 都 昏 暗 ， \n [kjv] In the day when the keepers of the house shall tremble, and the strong men shall bow themselves, and the grinders cease because they are few, and those that look out of the windows be darkened, \n [bbe] In the day when the keepers of the house are shaking for fear, and the strong men are bent down, and the women who were crushing the grain are at rest because their number is small, and those looking out of the windows are unable to see; \n 12:4 [hgb] 街 门 关 闭 ， 推 磨 的 响 声 微 小 ， 雀 鸟 一 叫 ， 人 就 起 来 ， 歌 唱 的 女 子 ， 也 都 衰 微 ， \n [kjv] And the doors shall be shut in the streets, when the sound of the grinding is low, and he shall rise up at the voice of the bird, and all the daughters of musick shall be brought low; \n [bbe] When the doors are shut in the street, and the sound of the crushing is low, and the voice of the bird is soft, and the daughters of music will be made low; \n 12:5 [hgb] 人 怕 高 处 ， 路 上 有 惊 慌 ， 杏 树 开 花 ， 蚱 蜢 成 为 重 担 ， 人 所 愿 的 也 都 废 掉 ， 因 为 人 归 他 永 远 的 家 ， 吊 丧 的 在 街 上 往 来 ， \n [kjv] Also when they shall be afraid of that which is high, and fears shall be in the way, and the almond tree shall flourish, and the grasshopper shall be a burden, and desire shall fail: because man goeth to his long home, and the mourners go about the streets: \n [bbe] And he is in fear of that which is high, and danger is in the road, and the tree is white with flower, and the least thing is a weight, and desire is at an end, because man goes to his last resting-place, and those who are sorrowing are in the streets; \n 12:6 [hgb] 银 链 折 断 ， 金 罐 破 裂 ， 瓶 子 在 泉 旁 损 坏 ， 水 轮 在 井 口 破 烂 ， \n [kjv] Or ever the silver cord be loosed, or the golden bowl be broken, or the pitcher be broken at the fountain, or the wheel broken at the cistern. \n [bbe] Before ever the silver cord is cut, or the vessel of gold is broken, or the pot is broken at the fountain, or the wheel broken at the water-hole; \n 12:7 [hgb] 尘 土 仍 归 于 地 ， 灵 仍 归 于 赐 灵 的 神 。 \n [kjv] Then shall the dust return to the earth as it was: and the spirit shall return unto God who gave it. \n [bbe] And the dust goes back to the earth as it was, and the spirit goes back to God who gave it. \n 12:8 [hgb] 传 道 者 说 ， 虚 空 的 虚 空 ， 凡 事 都 是 虚 空 。 \n [kjv] Vanity of vanities, saith the preacher; all is vanity. \n [bbe] All things are to no purpose, says the Preacher, all is to no purpose. \n 12:9 [hgb] 再 者 ， 传 道 者 因 有 智 慧 ， 仍 将 知 识 教 训 众 人 。 又 默 想 ， 又 考 查 ， 又 陈 说 许 多 箴 言 。 \n [kjv] And moreover, because the preacher was wise, he still taught the people knowledge; yea, he gave good heed, and sought out, and set in order many proverbs. \n [bbe] And because the Preacher was wise he still gave the people knowledge; searching out, testing, and putting in order a great number of wise sayings. \n 12:10 [hgb] 传 道 者 专 心 寻 求 可 喜 悦 的 言 语 ， 是 凭 正 直 写 的 诚 实 话 。 \n [kjv] The preacher sought to find out acceptable words: and that which was written was upright, even words of truth. \n [bbe] The Preacher made search for words which were pleasing, but his writing was in words upright and true. \n 12:11 [hgb] 智 慧 人 的 言 语 ， 好 像 刺 棍 。 会 中 之 师 的 言 语 ， 又 像 钉 稳 的 钉 子 。 都 是 一 个 牧 者 所 赐 的 。 \n [kjv] The words of the wise are as goads, and as nails fastened by the masters of assemblies, which are given from one shepherd. \n [bbe] The words of the wise are pointed, and sayings grouped together are like nails fixed with a hammer; they are given by one guide. \n 12:12 [hgb] 我 儿 ， 还 有 一 层 ， 你 当 受 劝 戒 。 着 书 多 ， 没 有 穷 尽 。 读 书 多 ， 身 体 疲 倦 。 \n [kjv] And further, by these, my son, be admonished: of making many books there is no end; and much study is a weariness of the flesh. \n [bbe] And further, my son, take note of this: of the making of books there is no end, and much learning is a weariness to the flesh. \n 12:13 [hgb] 这 些 事 都 已 听 见 了 。 总 意 就 是 敬 畏 神 ， 谨 守 他 的 诫 命 ， 这 是 人 所 当 尽 的 本 分 。 （ 或 作 这 是 众 人 的 本 分 ） \n [kjv] Let us hear the conclusion of the whole matter: Fear God, and keep his commandments: for this is the whole duty of man. \n [bbe] This is the last word. All has been said. Have fear of God and keep his laws; because this is right for every man. \n 12:14 [hgb] 因 为 人 所 作 的 事 ， 连 一 切 隐 藏 的 事 ， 无 论 是 善 是 恶 ， 神 都 必 审 问 。 \n [kjv] For God shall bring every work into judgment, with every secret thing, whether it be good, or whether it be evil. \n [bbe] God will be judge of every work, with every secret thing, good or evil. \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/120/1806.html","bookId":181,"book":{"id":181,"title":"传道书 Ecclesiastes","description":"简介： 1:1 [hgb] 在 耶 路 撒 冷 作 王 ， 大 卫 的 儿 子 ， 传 道 者 的 言 语 。 [kjv] The words of the Preacher, the son of David, king in Jerusalem. [bbe] The w...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/120","creation":"Aug 1, 2019 12:18:22 AM","modification":"Aug 1, 2019 12:23:40 AM"}}
