{"id":106713,"no":8,"title":"Page 8","content":"Vulcan (9)\\n\\n Hera As Zeus’s wife, she’s the queen of the gods, and a powerful goddess in her own right (D)\\n\\n Juno (5)\\n\\n Hermes He travels all over as the god of roads, speed, messengers, commerce, travel, thieves, merchants, and mail deliverers (I)\\n\\n Mercury (15)\\n\\n Iris She loves rainbows and keeps busy relaying messages to and from gods, demigods, and even Titans (J)\\n\\n Arcus (2)\\n\\n Kronos These deities both represent the passage of time—personified by age in Greece, by gateways and beginnings/endings in Rome (K)\\n\\n Janus (11)\\n\\n Pan The only god on this list with horns (he’s a satyr), he’s a patron of the Wild and protector of flocks and herds (B)\\n\\n Faunus (4)\\n\\n Poseidon God of the sea, earthquakes, fresh water, and horses—also, Percy Jackson’s dad! (L)\\n\\n Neptune (6)\\n\\n Zeus Powerful and proud, he’s the king of the gods and associated with law, justice, and morality (A)\\n\\n Jupiter\\n\\n CODED MESSAGE ANSWER\\n\\n Camp Half-Blood\\n\\n Percy Jackson and the Staff of Hermes\\n\\n ANNABETH AND I WERE RELAXING on the Great Lawn in Central Park when she ambushed me with a question.\\n\\n “You forgot, didn’t you?”\\n\\n I went into red-alert mode. It’s easy to panic when you’re a new boyfriend. Sure, I’d fought monsters with Annabeth for years. Together we’d faced the wrath of the gods. We’d battled Titans and calmly faced death a dozen times. But now that we were dating, one frown from her and I freaked. What had I done wrong?\\n\\n I mentally reviewed the picnic list: Comfy blanket? Check. Annabeth’s favorite pizza with extra olives? Check. Chocolate toffee from La Maison du Chocolat? Check. Chilled sparkling water with twist of lemon? Check. Weapons in case of sudden Greek mythological apocalypse? Check.\\n\\n So what had I forgotten?\\n\\n I was tempted (briefly) to bluff my way through. Two things stopped me. First, I didn’t want to lie to Annabeth. Second, she was too smart. She’d see right through me.\\n\\n So I did what I do best. I stared at her blankly and acted dumb.\\n\\n Annabeth rolled her eyes. “Percy, today is September eighteenth. What happened exactly one month ago?”\\n\\n “It was my birthday,” I said.\\n\\n That was true: August eighteenth. But judging from Annabeth’s expression, that wasn’t the answer she’d been hoping for.\\n\\n It didn’t help my concentration that Annabeth looked so good today. She was wearing her regular orange camp T-shirt and shorts, but her tan arms and legs seemed to glow in the sunlight. Her blond hair swept over her shoulders. Around her neck hung a leather cord with colorful beads from our demigod training camp—Camp Half-Blood. Her storm-gray eyes were as dazzling as ever. I just wished that their fierce look wasn’t directed at me.\\n\\n I tried to think. One month ago we’d defeated the Titan Kronos. Was that what she meant? Then Annabeth set my priorities straight.\\n\\n “Our first kiss, Seaweed Brain,” she said. “It’s our one-month anniversary.”\\n\\n “Well…yeah!” I thought: Do people celebrate stuff like that? I have to remember birthdays, holidays, and all anniversaries?\\n\\n I tried for a smile. “That’s why we’re having this great picnic, right?”\\n\\n She tucked her legs underneath her. “Percy…I love the picnic. Really. But you promised to take me out for a special dinner tonight. Remember? It’s not that I expect it, but you said you had something planned. So…?”\\n\\n I could hear hopefulness in her voice, but also doubt. She was waiting for me to admit the obvious: I’d forgotten. I was toast. I was boyfriend roadkill.\\n\\n Just because I forgot, you shouldn’t take that as a sign I didn’t care about Annabeth. Seriously, the last month with her had been awesome. I was the luckiest demigod ever. But a special dinner…when had I mentioned that? Maybe I’d said it after Annabeth kissed me, which had sort of sent me into a fog. Maybe a Greek god had disguised himself as me and made her that promise as a prank. Or maybe I was just a rotten boyfriend.\\n\\n Time to fess up. I cleared my throat. “Well—”\\n\\n A sudden streak of light made me blink, as if someone had flashed a mirror in my face. I looked around and I saw a brown delivery truck parked in the middle of the Great Lawn where no cars were allowed. Lettered on the side were the words: HERNIAS ARE US\\n\\n Wait…sorry. I’m dyslexic. I squinted and decided it probably read: HERMES EXPRESS\\n\\n “Oh, good,” I muttered. “We’ve got mail.”\\n\\n “What?” Annabeth asked.\\n\\n I pointed at the truck. The driver was climbing out. He wore a brown uniform shirt and knee-length shorts along with stylish black socks and cleats. His curly salt-and-pepper hair stuck out around the edges of his brown cap. He looked like a guy in his mid-thirties, but I knew from experience he was actually in his mid-five-thousands.\\n\\n Hermes. Messenger of the gods. Personal friend, dispenser of heroic quests, and frequent cause of migraine headaches.\\n\\n He looked upset. He kept patting his pockets and wringing his hands. Either he’d lost something important or he’d had too many espressos at the Mount Olympus Starbucks. Finally he spotted me and beckoned, Get over here!\\n\\n That could’ve meant several things. If he was delivering a message in person from the gods, it was bad news. If he wanted something from me, it was also bad news. But seeing as he’d just saved me from explaining myself to Annabeth, I was too relieved to care.\\n\\n “Bummer.” I tried to sound regretful, as if my rump hadn’t just been pulled from the barbecue. “We’d better see what he wants.”\\n\\n How do you greet a god? If there’s an etiquette guide for that, I haven’t read it. I’m never sure if I’m supposed to shake hands, kneel, or bow and shout, “We’re not worthy!”\\n\\n I knew Hermes better than most of the Olympians. Over the years, he’d helped me out several times. Unfortunately last summer I’d also fought his demigod son Luke, who’d been corrupted by the Titan Kronos, in a mortal combat smack-down for the fate of the world. Luke’s death hadn’t been entirely my fault, but it still put a damper on my relationship with Hermes.\\n\\n I decided to start simple. “Hi.”\\n\\n Hermes scanned the park as if he was afraid of being watched. I’m not sure why he bothered. Gods are usually invisible to mortals. Nobody else on the Great Lawn was paying any attention to the delivery van.\\n\\n Hermes glanced at Annabeth, then back at me. “I didn’t know the girl would be here. She’ll have to swear to keep her mouth shut.”\\n\\n Annabeth crossed her arms. “The girl can hear you. And before I swear to anything, maybe you’d better tell us what’s wrong.”\\n\\n I don’t think I’ve ever seen a god look so jittery. Hermes tucked a curl of gray hair behind his ear. He patted his pockets again. His hands didn’t seem to know what to do.\\n\\n He leaned in and lowered his voice. “I mean it, girl. If word gets back to Athena, she’ll never stop teasing me. She already thinks she’s so much cleverer than I am.”\\n\\n “She is,” Annabeth said. Of course, she’s prejudiced. Athena is her mom.\\n\\n Hermes glared at her. “Promise. Before I explain the problem, both of you must promise to keep silent.”\\n\\n Suddenly it dawned on me. “Where’s your staff?”\\n\\n Hermes’s eye twitched. He looked like he was about to cry.\\n\\n “Oh, gods,” Annabeth said. “You lost your staff?”\\n\\n “I didn’t lose it!” Hermes snapped. “It was stolen. And I wasn’t asking for your help, girl!”\\n\\n “Fine,” she said. “Solve your own problem. Come on, Percy. Let’s get out of here.”\\n\\n Hermes snarled. I realized I might have to break up a fight between an immortal god and my girlfriend, and I didn’t want to be on either side of that.\\n\\n A little background: Annabeth used to adventure with Hermes’s son Luke. Over time, Annabeth developed a crush on Luke. As Annabeth got older, Luke developed feelings for her, too. Luke turned evil. Hermes blamed Annabeth for not preventing Luke from turning evil. Annabeth blamed Hermes for being a rotten dad and giving Luke the capacity to become evil in the first place. Luke died in war. Hermes and Annabeth blamed each other.\\n\\n Confused? Welcome to my world.\\n\\n Anyway, I figured things would go badly if these two went nuclear, so I risked stepping between them. “Annabeth, tell you what. This sounds important. Let me hear him out, and I’ll meet you back at the picnic blanket, okay?”\\n\\n I gave her a smile that I hoped conveyed something like: Hey, you know I’m on your side. Gods are such jerks! But what can you do?\\n\\n Probably my expression actually conveyed: It’s not my fault! Please do not kill me!\\n\\n Before she could protest or cause me bodily harm, I grabbed Hermes’s arm. “Let’s step into your office.”\\n\\n Hermes and I sat in the back of the delivery truck on a couple of boxes labeled TOXIC SERPENTS. THIS END UP. Maybe that wasn’t the best place to sit, but it was better than some of his other deliveries, which were labeled EXPLOSIVES, DO NOT SIT ON, and DRAKON EGGS, DO NOT STORE NEAR EXPLOSIVES.\\n\\n “So what happened?” I asked him.\\n\\n Hermes slumped on his delivery boxes. He stared at his empty hands. “I only left them alone for a minute.”\\n\\n “Them…” I said. “Oh, George and Martha?”\\n\\n Hermes nodded dejectedly.\\n\\n George and Martha were the two snakes that wrapped around his caduceus—his staff of power. You’ve probably seen pictures of the caduceus at hospitals, since it’s often used as a symbol for doctors. (Annabeth would argue and say that whole thing is a misconception. It’s supposed to be the staff of Asclepius the medicine god, blah, blah, blah. But whatever.)\\n\\n I was kind of fond of George and Martha. I got the feeling Hermes was too, even though he was constantly arguing with them.\\n\\n “I made a stupid mistake,” he muttered. “I was late with a delivery. I stopped at Rockefeller Center and was delivering a box of doormats to Janus—”\\n\\n “Janus,” I said. “The two-faced guy, god of doorways.”\\n\\n “Yes, yes. He works there. Network television.”\\n\\n “Say what?” The last time I’d met Janus he’d been in a deadly magical labyrinth, and the experience hadn’t been pleasant.\\n\\n Hermes rolled his eyes. “Surely you’ve seen network TV lately. It’s clear they don’t know whether they’re coming or going. That’s because Janus is in charge of programming. He loves ordering new shows and canceling them after two episodes. God of beginnings and endings, after all. Anyway, I was bringing him some magic doormats, and I was double-parked—”\\n\\n “You have to worry about double-parking?”\\n\\n “Will you let me tell the story?”\\n\\n “Sorry.”\\n\\n “So I left my caduceus on the dashboard and ran inside with the box. Then I realized I needed to have Janus sign for the delivery, so I ran back to the truck—”\\n\\n “And the caduceus was gone.”\\n\\n Hermes nodded. “If that ugly brute has harmed my snakes, I swear by the Styx—”\\n\\n “Hold on. You know who took the staff?” \\n\\n","sourceLink":"https://allnovel.net/the-demigod-diaries/page-8.html","bookId":1545,"book":{"id":1545,"title":"The Demigod Diaries","description":"Storyline: The Demigod Diaries (The Heroes of Olympus) \\n What dangers do runaway demigods Luke and Thalia face on their way to Camp Half-Blood? Are Percy and Annabeth up to the task of rescuing stolen goods from a fire-breathing giant who doesn\u0027t take kindly to intruders? How exactly are Leo, Piper, and Jason supposed to find a runaway table, dodge a band of party-loving Maenads (who just might be a little psychotic), and stave off a massive explosion...all in one hour or less? With his trademark wit and creativity, Rick Riordan answers these questions and more in three never-before-seen short stories that provide vital back-story to the Heroes of Olympus and Percy Jackson books. Original art, enlightening character interviews and profiles, puzzles, and a quiz add to the fun in this action-packed collection.\\n","cover":"https://allnovel.net/images/the-demigod-diaries.jpg","author":"Rick Riordan","type":"Adventure","source":"allnovel","link":"https://allnovel.net/the-demigod-diaries.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 11:02:02 PM"}}
