{"id":99192,"no":15,"title":"Page 15","content":"People always devise their own justifications. Fixed and immovable Law merely provides a convenient structure within which to hang your justifications and the prejudices behind them. The only universally acceptable law for mortals would be one which fitted every justification. What obvious nonsense. Law must expose prejudice and question justification. Thus, Law must be flexible, must change to fit new demands. Otherwise, it becomes merely the justification of the powerful.\\n\\n - Gowachin Law (The BuSab Translation)\\n\\n It required a moment after Bahrank drove away for McKie to recover his sense of purpose. The buildings rose tall and massive over him, but through a quirk of this Warren\u0027s growth, an opening to the west allowed a spike of the silvery afternoon sunlight to slant into the narrow street. The light threw hard shadows on every object, accented the pressure of Human movement. McKie did not like the way people looked at him: as though everyone measured him for some private gain.\\n\\n Slowly, McKie pressed through the passing throng to the arched entry, observing all he could without seeming to do so. After all those years in BuSab, all of the training and experience which had qualified him for such a delicately powerful agency, he possessed superb knowledge of the ConSentiency\u0027s species. He drew on that knowledge now, sensing the powerful secrecy which governed these people. Unfortunately, his experience also was replete with knowledge of what species could do to species, not to mention what a species could do to itself. The Humans around him reminded him of nothing more than a mob about to explode.\\n\\n Moving with a constant readiness to defend himself, he went down a short flight of stairs into cool shadows where the foot traffic was lighter but the smells of rot and mold were more pronounced.\\n\\n Second door on the left.\\n\\n He went to the doorway to which Bahrank had directed him, peered into the opening: another stairway down. Somehow, this dismayed him. The picture of Chu growing in his mind was not at all what Aritch\u0027s people had drawn. Had they deliberately misled him? If so, why? Was it possible they really didn\u0027t understand their monster? The array of answers to his questions chilled him. What if a few of the observers sent here by Aritch\u0027s people had chosen to capitalize on whatever power Dosadi provided?\\n\\n In all of his career, McKie had never before come across a world so completely cut off from the rest of the universe. This planet was alone, without many of the amenities which graced the other ConSentient worlds: no common access to jumpdoors, no concourse of the known species, none of the refined pleasures nor the sophisticated traps which occupied the denizens of other worlds. Dosadi had developed its own ways. And the instructors on Tandaloor had returned time and again to that constant note of warning - that these lonely primitives would take over the ConSentiency if released upon the universe.\\n\\n \"Nothing restrains them. Nothing.\"\\n\\n That was, perhaps, an overstatement. Some things did restrain the Dosadi physically. But they were not held back by the conventions or mores of the ConSentiency. Anything could be purchased here, any forbidden depravity which the imagination might conceive. This idea haunted McKie. He thought of this and of the countless substances to which many Dosadi were addicted. The power leverage such things gave to the unprincipled few was terrifying.\\n\\n He dared not pause here wrestling with his indecisions, though. McKie stepped into the stairwell with a boldness which he did not feel, following Bahrank\u0027s directions because he had no choice. The bottom landing was a wider space in deep shadows, one dim light on a black door. Two Humans dozed in chairs beside the door while a third squatted beside them with what appeared to be a crude projectile weapon in his hands.\\n\\n \"Jedrik summoned me,\" McKie said.\\n\\n The guard with the weapon nodded for him to proceed.\\n\\n McKie made his way past them, glanced at the weapon: a length of pipe with a metal box at the back and a flat trigger atop the box held by the guard\u0027s thumb. McKie almost missed a step. The weapon was a dead-man bomb! Had to be. If that guard\u0027s thumb relaxed for any reason, the thing no doubt would explode and kill everyone in the stairwell. McKie glanced at the two sleepers. How could they sleep in such circumstances?\\n\\n The black door with its one dim light commanded his attention now. A strong smell of highly seasoned cooking dominated the other stinks here. McKie saw that it was a heavy door with a glittering spyeye at face level. The door opened at his approach. He stepped through into a large low room crowded - jammed! - with people seated on benches at trestle tables. There was barely room for passage between the benches. And everywhere that McKie looked he saw people spooning food into their mouths from small bowls. Waiters and waitresses hurried through the narrow spaces slapping down bowls and removing empties.\\n\\n The whole scene was presided over by a fat woman seated at a small desk on a platform at his left. She was positioned in such a way that she commanded the entry door, the entire room, and swinging doors at the side through which the serving people flowed back and forth. She was a monstrous woman and she sat her perch as though she had never been anywhere else. Indeed, it was easy for McKie to imagine that she could not move from her position. Her arms were bloated where they squeezed from the confines of short-sleeved green coveralls. Her ankles hung over her shoe tops in folds.\\n\\n Take a seat and wait.\\n\\n Bahrank had been explicit and the warning clear.\\n\\n McKie looked for an opening on the benches. Before he could move, the fat woman spoke in a squeaky voice.\\n\\n \"Your name?\"\\n\\n McKie\u0027s gaze darted toward those beady eyes in their folds of fat.\\n\\n \"McKie.\"\\n\\n \"Thought so.\"\\n\\n She raised a dimpled finger. From somewhere in the crush a young boy came hurrying. He could not have been over nine years old but his eyes were cold with adult wisdom. He looked up to the fat woman for instructions.\\n\\n \"This is the one. Guide him.\"\\n\\n The boy turned and, without looking to see if McKie followed, hurried down the narrow pathway where the doors swung back and forth to permit the passage of the servitors. Twice, McKie was almost run down by waiters. His guide was able to anticipate the opening of every door and skipped aside.\\n\\n At the end of this passage, there was another solid black door with spyeye. The door opened onto a short passage with closed doors on both sides, a blank wall at the end. The blank wall slid aside for them and they descended into a narrow, rock-lined way lighted by widely spaced bulbs overhead. The walls were damp and evil smelling. Occasionally, there were wide places with guards. They passed through several guarded doors, climbed up and went down. McKie lost track of the turns, the doors, and guard posts. After a time, they climbed to another short hallway with doors along its sides. The boy opened the second door on the right, waited for McKie to enter, closed the door. It was all done without words. McKie heard the boy\u0027s footsteps recede.\\n\\n The room was small and dimly lighted by windows high in the wall opposite the door. A trestle table about two meters long with benches down both sides and a chair at each end almost filled the space. The walls were grey stone and unadorned. McKie worked his way around to the chair at the far end, sat down. He remained seated there silently for several minutes, absorbing this place. It was cold in the room: Gowachin temperature. One of the high windows behind him was open a crack and he could hear street noises: a heavy vehicle passing, voices arguing, many feet. The sense of the Warren pressing in upon this room was very strong. Nearer at hand from beyond the single door, he heard crockery banging and an occasional hiss as of steam.\\n\\n Presently, the door opened and a tall, slender woman entered, slipping through the door at minimal opening. For a moment as she turned, the light from the windows concentrated on her face, then she sat down at the end of the right-hand bench, dropping into shadows.\\n\\n McKie had never before seen such hard features on a woman. She was brittle rock with ice crystal eyes of palest blue. Her black hair was closely cropped into a stiff bristle. He repressed a shudder. The rigidity of her body amplified the hard expression on her face. It was not the hardness of suffering, not that alone, but something far more determined, something anchored in a kind of agony which might explode at the slightest touch. On a ConSentient world where the geriatric arts were available, she could have been any age between thirty-five and one hundred and thirty-five. The dim light into which she had seated herself complicated his scrutiny, but he suspected she was younger than thirty-five.\\n\\n \"So you are McKie.\"\\n\\n He nodded.\\n\\n \"You\u0027re fortunate Adril\u0027s people got my message. Broey\u0027s already searching for you. I wasn\u0027t warned that you were so dark.\"\\n\\n He shrugged.\\n\\n \"Bahrank sent word that you could get us all killed if we\u0027re not careful with you. He says you don\u0027t have even rudimentary survival training.\"\\n\\n This surprised McKie, but he held his silence.\\n\\n She sighed. \"At least you have the good sense not to protest. Well . . . welcome to Dosadi, McKie. Perhaps I\u0027ll be able to keep you alive long enough for you to be of some use to us.\"\\n\\n Welcome to Dosadi!\\n\\n \"I\u0027m Jedrik as you doubtless already know.\"\\n\\n \"I recognize you.\"\\n\\n This was only partly true. None of the representations he\u0027d seen had conveyed the ruthless brutality which radiated from her.\\n\\n A hard smile flickered on her lips, was gone.\\n\\n \"You don\u0027t respond when I welcome you to our planet.\"\\n\\n McKie shook his head. Aritch\u0027s people had been specific in their injunction:\\n\\n \"She doesn\u0027t know your origin. Under no circumstances may you reveal to her that you come from beyond the God Wall. It could be immediately fatal.\"\\n\\n McKie continued to stare silently at her.\\n\\n A colder look came over Jedrik\u0027s features, something in the muscles at the corners of the mouth and eyes.\\n\\n \"We shall see. Now: Bahrank says you carry a wallet of some kind and that you have currency sewn into your clothing. First, hand me the wallet.\"\\n\\n My toolkit?\\n\\n She reached an open hand toward him.\\n\\n \"I\u0027ll warn you once, McKie. If I get up and walk out of here you\u0027ll not live more than two minutes.\"\\n\\n Every muscle quivering protest, he slipped the toolkit from its pocket, extended it.\\n\\n \"And I\u0027ll warn you, Jedrik: I\u0027m the only person who can open this without being killed and the contents destroyed.\"\\n\\n She accepted the toolkit, turned its flat substance over in her hands.\\n\\n \"Really?\"\\n\\n McKie had begun to interest her in a new way. He was less than she\u0027d expected, yet more. Naive, of course, incredibly naive. But she\u0027d already known that of the people from beyond the God Wall. It was the most suitable explanation. Something was profoundly wrong in the Dosadi situation. The people beyond the Veil would have to send their best here. This McKie was their best? Astonishing.\\n\\n She arose, went to the door, rapped once.\\n\\n McKie watched her pass the toolkit to someone outside, heard a low-voiced conversation, neither half of it intelligible. In a flashing moment of indecision, he\u0027d considered trying for some of the toolkit\u0027s protective contents. Something in Jedrik\u0027s manner and the accumulation of unknowns all around had stopped him.\\n\\n Jedrik returned to her seat empty-handed. She stared at him a moment, head cocked to one side, then:\\n\\n \"I\u0027ll say several things to you. In a way, this is a test. If you fail, I guarantee you\u0027ll not survive long on Dosadi. Understood?\"\\n\\n When McKie failed to respond, she pounded a fist on the table.\\n\\n \"Understood?\"\\n\\n \"Say what you have to say.\"\\n\\n \"Very well. It\u0027s obvious to me that those who instructed you about Dosadi warned you not to reveal your true origin. Yet, most of those who\u0027ve talked to you for more than a few seconds suspect you\u0027re not one of us - not from Chu, not from the Rim, not from anywhere on Dosadi.\" Her voice took on a new harshness. \"But I know it. Let me tell you, McKie, that there\u0027s not even a child among us who\u0027s failed to realize that the people imprisoned on Dosadi did not originate here!\"\\n\\n McKie stared at her, shocked.\\n\\n Imprisoned.\\n\\n As she spoke, he knew she was telling him the truth. Why hadn\u0027t Aritch or the others warned him? Why hadn\u0027t he seen this for himself? Since Dosadi was poison to both Human and Gowachin, rejected them, of course they\u0027d know they hadn\u0027t originated here.\\n\\n She gave him time to absorb this before continuing. \"There are others among us from your realm, perhaps some we\u0027ve not identified, better trained. But I was taught to act only on certainty. Of you I\u0027m certain. You do not originate on Dosadi. I\u0027ve put it to the question and I\u0027ve the present confirmation of my own senses. You come from beyond the God Wall. Your actions with Bahrank, with Adril, with me . . .\" She shook her head sadly.\\n\\n Aritch set me up for this!\\n\\n This thought brought back a recurrent question which continued to nag McKie; BuSab\u0027s discovery of the Dosadi experiment. Were the Gowachin that clumsy? Would they make such slips? The original plan to conceal this project must have been extensive. Yet, key facts had leaked to BuSab agents. McKie felt overwrought from asking himself the same questions over and over without satisfaction. And now, Jedrik\u0027s pressures compounded the burden. The only suitable answer was that Aritch\u0027s people had done everything with the intent of putting him in this position. They\u0027d deliberately leaked information about Dosadi. And McKie was their target.\\n\\n To what purpose?\\n\\n \"Can we be overheard?\" he asked.\\n\\n \"Not by my enemies on Dosadi.\"\\n\\n He considered this. She\u0027d left open the question of whether anyone from beyond the God Wall might eavesdrop. McKie pursed his lips with indecision. She\u0027d taken his toolkit with such ridiculous ease . . . yet, what choice had he? They wouldn\u0027t get anything from the kit and someone out there, one of Jedrik\u0027s underlings, would die. That could have a useful effect on Jedrik. He decided to play for time.\\n\\n \"There\u0027re many things I could tell you. So many things. I hardly know where to begin.\"\\n\\n \"Begin by telling me how you came through the God Wall.\"\\n\\n Yes, he might be able to confuse her with a loose description of Calebans and jumpdoors. Nothing in her Dosadi experience could\u0027ve prepared Jedrik for such phenomena. McKie took a deep breath. Before he could speak there was a rap on the door.\\n\\n Jedrik raised a hand for silence, leaned over, and opened the door. A skinny young man with large eyes beneath a high forehead and thin blond hair slipped through, placed McKie\u0027s toolkit on the table in front of Jedrik.\\n\\n \"It wasn\u0027t very difficult,\" he said.\\n\\n McKie stared at the kit in shock. It lay open with all of its contents displayed in perfect order.\\n\\n Jedrik gestured the youth to the seat opposite her. She reached for a raygen.\\n\\n McKie could no longer contain himself.\\n\\n \"Careful! That\u0027s dangerous!\"\\n\\n \"Be still, McKie. You know nothing of danger.\"\\n\\n She removed the raygen, examined it, replaced it neatly, looked at the young man.\\n\\n \"All right, Stiggy. Tell me.\"\\n\\n The youth began removing the items from the toolkit one by one, handling each with a knowledgeable correctness, speaking rapidly.\\n\\n McKie tried hard to follow the conversation, but it was in a code he could not understand. The expressions on their faces were eloquent enough, however. They were elated. Whatever Stiggy was saying about the dangerous toys in McKie\u0027s toolkit, his revelations profited both of them.\\n\\n The uncertainties which had begun during McKie\u0027s ride with Bahrank reached a new intensity. The feeling had built up in him like a sickness: disquiet stomach, pains in his chest, and, lastly, an ache across his forehead. He\u0027d wondered for a time if he might be the victim of some new disease native to Dosadi. It could not be the planet\u0027s food because he\u0027d eaten nothing yet. The realization came over him as he watched Jedrik and Stiggy that his reactions were his own reasoning system trying to reject something, some assumption or set of assumptions which he\u0027d accepted without question. He tried to empty his mind, not asking any questions in particular. Let come into his awareness what may. It would all have a fresh appraisal.\\n\\n Dosadi requires you to be coldly brutal in all of your decisions. No exceptions.\\n\\n Well . . . he\u0027d let go of the toolkit in the belief that someone would die trying to open it. But he\u0027d issued a warning. That warning could\u0027ve helped them. Probably did.\\n\\n I must become exactly like them or I cannot survive - let alone succeed.\\n\\n At last, McKie felt Aritch\u0027s fear of Dosadi, understood the Gowachin desperation. What a terrible training ground for the recognition and use of power!\\n\\n Jedrik and Stiggy finished their conversation over the toolkit. Stiggy closed the kit, arose with it in one hand, speaking at last in words McKie understood.\\n\\n \"Yes, we must lose no time.\"\\n\\n Stiggy left with the kit.\\n\\n Jedrik faced McKie. The toolkit and its contents had helped answer the most obvious question about McKie and his kind. The people beyond the God Wall were the degenerate descendants of those who\u0027d invented such devices. It was the only workable explanation. She felt almost sorry for this poor fool. But that was not a permissible emotion. He must be made to understand that he had no choice but to obey her.\\n\\n \"Now, McKie, you will answer all of my questions.\"\\n\\n \"Yes.\"\\n\\n It was utter submission and she knew it.\\n\\n \"When you\u0027ve satisfied me in all matters,\" she said, \"then we\u0027ll eat and I\u0027ll take you to a place where you\u0027ll be reasonably safe.\" \\n\\n","sourceLink":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2/page-15.html","bookId":2173,"book":{"id":2173,"title":"The Dosadi Experiment (ConSentiency Universe #2)","description":"Storyline: The Dosadi Experiment (ConSentiency Universe #2) \\n Generations of a tormented human-alien people, caged on a toxic planet, conditioned by constant hunger and war-this is the Dosadi Experiment, and it has succeeded too well. For the Dosadi have bred for Vengeance as well as cunning, and they have learned how to pass through the shimmering God Wall to exact their dreadful revenge on the Universe that created them . . .\\n","cover":"https://allnovel.net/images/the-dosadi-experiment-consentiency-universe-2.jpg","author":"Frank Herbert","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2.html","creation":"Oct 5, 2019 8:58:25 AM","modification":"Oct 5, 2019 6:39:15 PM"}}
