{"id":65600,"no":24,"title":"Page 24","content":"“And a lot to think about as well.”\n He grinned affectionately and ignored her comment. “I shall see you next week.”\n As her son left, Amanda Remington sat back in her chair and contemplated her next course of action. She knew what her son needed, even if he didn’t.\n And she would see that he got it.\n Chapter Nine\n Hugh La Coeur, the sixth Earl of Montrose, paused on the step of his carriage and grimaced at the imposing three-story, columned entrance to Remington’s. The morning sun shone brightly on the white façade as various members of the peerage exited and entered the popular gentlemen’s club. Behind him, traffic was heavy on St. James. The steady clatter of rolling carriage wheels, horses’ hooves, and harnesses reminded him that life was still bustling forward for the rest of London, while he prepared to face his largest and most ruthless creditor.\n With a deep, fortifying breath, Hugh climbed the steps to the watered-glass, double-door entrance. A footman in black-and-silver livery welcomed him inside, and Hugh handed his hat, gloves, and cane to one of two waiting attendants. He stepped into the round entrance foyer, with its black-and-white marbled floors, and again admired the massive chandelier that hung three stories up, with a large round table centered below it. A gigantic floral arrangement dominated the center of the table, its heady fragrance permeating every corner of the foyer.\n Straight ahead was the gaming area. From there, one could find either the staircases that led to the upper floors—where the fencing studio, courtesans, and private rooms were located— or to the lower floors, where the pugilist rings were kept. To the left was the kitchen. To the right were the offices of Lucien Remington.\n Hugh took one last, wistful look at the gaming rooms and then turned to his right. He walked through the huge wooden door, with its oval glass center, and handed his card to the secretary, expecting to wait. He was surprised when he was announced without delay.\n Nervous trepidation plagued him as he entered the sanctum of Lucien Remington. He’d never been in the offices before, and he took in his surroundings with a curious eye. The first thing he noticed was the carved mahogany desk, which directly faced the door. The massive piece of furniture was flanked on either side by floor-to-ceiling windows, and the desktop was littered with paperwork, silent confirmation of the strength and breadth of Remington’s empire.\n The room was done in masculine shades of deep green, cream, and gold. An immense fireplace to the left was the focal point of a conversation area holding a settee and two leather wingback chairs. Floor-to-ceiling bookcases took up all the available wall space. To the right, sunlit windows afforded views of the street below.\n “Good afternoon, Lord Montrose. I trust your trip to the country was pleasant.”\n Hugh turned toward the deep voice and saw Remington standing behind his desk, his famous blue eyes lit with amusement as he waved a hand toward one of the chairs that faced him.\n “How did you know where I was?” Hugh asked crossly as he took a seat.\n “You owe me one hundred thousand quid, my lord. I’m not likely to misplace you.”\n Hugh scowled. “A drop in the bucket for you, Remington.”\n “True. Now, I assume you’ve come to repay me?”\n Shifting uncomfortably, Hugh said, “I was hoping to make payment arrangements with you.”\n A black brow lifted. “I see. What do you propose?”\n “At the end of the Season, I can repay half of what I owe, and then—”\n Remington raised a hand. “I won’t accept Fontaine’s money. You owe me. You will pay me.”\n “Damnation!” Hugh flushed with anger and embarrassment. “Money is money, damn it. Why do you care where it comes from?”\n “The point is, I do care.”\n “If you expect me to pay you out of my own pockets, it will take years.”\n “I’m not inclined to wait any longer. Either pay me the money, or listen to my alternate proposal.”\n Hugh stiffened warily. “What alternate proposal?”\n Remington leaned back in his chair and crossed his arms over his chest. “I wish to see your sister socially. You will smooth the way for me. For every outing, every dance, every private moment with her, I will reduce your debt by ten thousand pounds.”\n Hugh’s mouth fell open. “Bloody hell. This is extortion!”\n Remington said nothing.\n “Lady Julienne is close to announcing her betrothal to the Marquess of Fontaine,” Hugh pointed out. “Your request could seriously jeopardize his interest in her.”\n Remington remained silent.\n “She’s a debutante, Remington, not one of your trollops. I won’t whore her out for my debts.”\n Remington’s brows rose, and Hugh colored with embarrassment at the silent challenge that said he was doing exactly that.\n “Fontaine offers marriage,” he argued.\n “So do I.”\n Hugh choked. “The devil, you say! This grows more outrageous by the moment. Julienne can’t marry you! She’s an earl’s daughter, for Christ’s sake.”\n “And I am a duke’s son.”\n “Well, yes, but you’re . . . well . . . you’re . . . Damnation, you know what the hell you are! It’s not the same thing at all.”\n Remington shrugged, not the least bit perturbed. “Marriage is out, so we return to my offer. You may begin this evening. I want one dance with Lady Julienne. Afterward you can deduct ten thousand pounds from your debt to me.”\n Hugh ran both hands through his hair before massaging his temples. “She’s marrying someone else, Remington. Why not find some other chit?”\n “My motives are my own.” Remington rested his elbows on his desk. “I’m a very busy man, Montrose. Tell me your decision now—the money or ten moments with your sister. What shall it be?”\n “This is appalling.”\n “Indeed?”\n “You’ve gone mad.”\n “Quite possibly.”\n Hugh was dumbstruck, and damned himself for landing Julienne in this predicament. She was correct. It was time to get his affairs in order. “What if she refuses?”\n “Then I will allow her to do so. But she must refuse me each time.”\n “Hell’s teeth, this is abominable. You, sir, are no gentleman.”\n Remington smiled. “I have never claimed to be one.”\n “I have stipulations.”\n Remington nodded. “I expected you would.”\n “Outings must be chaperoned.”\n “Of course.”\n “If I acquire any portion of the money on my own, I can buy you out.”\n “Agreed.”\n “And”—Hugh flushed—“she’s untouched. Don’t think to ruin her to force my hand, or I will call you out. In case you hadn’t heard, I’m an excellent shot. You would not survive the encounter.”\n “I accept your terms.” Remington’s confident expression never wavered. “I will claim the last set of the evening with Lady Julienne at the Dempsey Ball tonight. Don’t say anything to her. I will approach her myself and afford her the opportunity to refuse.”\n “Fine.” Hugh rose and took another look around the elegantly appointed office. “I shall never wager another shilling in my life.”\n “Good idea,” returned Remington as he picked up his quill. “I don’t like to wager myself.”\n Hugh gaped in astonishment and then started toward the door, muttering to himself. “Doesn’t like to wager. Ridiculous. Man owns the largest gambling establishment in town.”\n Lucien grinned triumphantly as the door closed behind Montrose. “And I just made the biggest gamble of my life.”\n Julienne surveyed the glittering ballroom with bleary eyes. Hugh’s trips to his various creditors that afternoon had been successful. He assured her of the ready cooperation of all, including Lucien Remington, and seemed truly determined to take his responsibilities more seriously.\n Having accomplished that, Julienne could have spent the evening at home and considered the day well spent. But Hugh had insisted she attend the Dempsey Ball. Now it was the early hours of the following morning, she was exhausted, her mind tortured by thoughts of Lucien, and her brother insisted they remain until the end. Julienne tried desperately to stifle a yawn.\n “Hugh,” she muttered, “I’m retiring to the ladies’ room for a nap. You send for me when you’re ready to depart.”\n He scowled. “You promised the last set to me.”\n “Well, then, send for me just before. If I stand here another moment, I shall embarrass myself by falling asleep on my feet.”\n “Fine,” he grumbled. “Go.”\n Julienne moved away before he could change his mind. Reaching the hallway, she hid a yawn behind her gloved hand.\n She screeched as she was yanked without warning into an alcove. Lucien slid the curtain closed behind her.\n “What are you doing?” she cried, even as her heart leapt at his proximity. Stunningly handsome, he was impeccably attired in evening black. She hadn’t seen him all evening, and she hated to contemplate where he might have been. “Adding to my collection of bruises?” she snapped.\n He had the grace to wince. “Julienne.” His voice was low and tinged with regret. “Please forgive me for last night. I was foxed. I should never have touched you the way I did.”\n She lifted her chin and reached for the curtain. “You are correct about that. Now if you will excuse me.”\n He gripped her elbow. “Julienne, please. Don’t go yet.”\n “Why not? I think we’ve said all that needs to be said.”\n Lucien pulled off his gloves and shoved them into his pockets. The longing on his face arrested her. As his palm cupped her cheek, Julienne closed her eyes and breathed in the familiar scent of his skin.\n “I’ve missed you,” he whispered. “Every moment I’m not with you, I miss you.”\n “Lucien, don’t . . .”\n “Yes, Julienne. Look at me.”\n Reluctantly she lifted her lids and met his gaze, the austereness of his features stealing her breath.\n “I’m so very sorry, sweet. I never wanted to hurt you.”\n Julienne fought the tears that threatened. “Allow me to explain something to you, Lucien. Something men of your sort don’t seem to comprehend. Women are feeling creatures, at least they are until they’ve been hurt enough to no longer care. We reserve parts of our soul for the men who are important in our lives, places where trust and respect reside. Once those feelings are lost, you cannot reclaim them. Once they are dead, they cannot be revived.” She shoved his hand away from her face. “I’ve heard your apology, and yet it means nothing to me. You want me to make you feel better, to tell you I understand and forgive you, but I don’t understand.” She turned to leave.\n “I didn’t touch her,” he said quickly in a voice so hoarse she barely recognized it. “Since that day I came to your home, I haven’t been with another woman. I’ve been faithful to you.”\n Julienne turned, searching his face, and found him in deadly earnest. “Why?” she asked simply.\n “You are the only woman I want.” Lucien cupped her face with both hands. “When you rejected my proposal, I lost my head. I’m not accustomed to being denied something I want so desperately. I am so very sorry, Julienne. You don’t have to forgive me. All I ask is that you believe my sincerity.”\n His mouth lowered slowly, giving her the opportunity to pull away. With heartrending tenderness, he kissed away the tears she hadn’t known were falling. Julienne turned her head to capture his lips, and she was lost. Lost in his scent, his touch. Lost in him.\n “I believe you,” she whispered.\n Lucien’s mouth brushed along her jaw and down her throat. “Why are you wearing this high-necked dress?” he murmured.\n “To hide the bruises.”\n He froze, his body turning hard as stone. His hands left her face and reached for the buttons on the back of her gown, his impatient fingers working with obvious familiarity of a woman’s clothing.\n “Lucien, no,” she protested, agonizingly aware of the thinness of the curtain that separated them from the prying eyes of the ton. “Not here. Not now.”\n He dipped his head, hushing her with a kiss. Soon her gown gaped in the back, and he pushed it to the floor. He growled, his fingers brushing over their own prints left in the tender skin of her breasts. “Jesus,” he breathed.\n Pulling her to him, he kissed her throat. His mouth wandered downward, kissing every mark he’d left on her. The touch of his lips was gentle, reverent. He whispered anguished apologies against her skin, and as he dropped to his knees in front of her, she could feel the wetness of his tears soak through her chemise.\n The depth of his remorse, his openness of feeling, his willingness to show her his vulnerability, stunned her. This was a side of Lucien she had never seen. Julienne wondered if anyone had ever seen it.\n As he pushed up her chemise, his hot breath ruffled the curls of her sex. She shivered, her blood heating, her heart racing. Lucien groaned and buried his mouth between her legs. Slipping a hand behind her knee, he lifted her leg free of her gown and pulled it over his shoulder, opening her to his ravishment.\n Gentle fingers parted her, and Julienne sagged against the wall as his tongue delved deeper inside, licking her as if he savored the taste of her. She stared down, watching him, and her heart clenched in her chest. She could never have imagined the sight of the powerful Lucien Remington on his knees before her, his gorgeous eyes bright with grief and other more frightening emotions. With long, slow, sinuous laps he cherished her. He loved her leisurely, as if they had all the time in the world, as if they were alone and not mere steps away from ruination. \n","sourceLink":"https://allnovel.net/scandalous-liaisons-historical-4/page-24.html","bookId":2666,"book":{"id":2666,"title":"Scandalous Liaisons (Historical #4)","description":"Storyline: \n Scandalous Liaisons (Historical #4) \n Oh, those naughty rakes. With their wicked winks, sensual smiles, and bad boy habits, you just can t take them out in polite society. But who wants to go out when you can stay in...? \n STOLEN PLEASURES \n Sebastian Blake, Earl of Merrick, long ago fled the responsibilities of his title to become the infamous pirate, Captain Phoenix. But the booty he s just captured on a merchant ship is a fierce tempered minx who claims to be a bride...his bride, married to him by proxy on behest of their fathers. He could shame his hated family and return his beautiful wife untouched, but no treasure has ever proved more tempting to Sebastian, and making their marriage a true one-in every sense-is his one urgent desire ... \n LUCIEN\u0027S GAMBLE \n Lucien Remington s reputation as a debauched libertine who plays by no one s rules-in business or the bedroom-is well deserved. He gets what he wants, social repudiation be damned. But society can keep from him the one thing he truly desires, the untouchable Lady Julienne La Coeur. Until she sneaks into his club dressed as a man and searching for her irresponsible brother. Suddenly she s in Lucien s grasp, his to take, and his mind is filled with the most wickedly sinful thoughts. A gentleman would walk away from the temptation she presents. But then, Lucien has never claimed to be a gentleman... \n HER MAD GRACE \n Hugh La Coeur never wanted to be the Earl of Montrose. Wine, women, and a hefty wager are preferable to responsibility of any kind. It s certainly preferable to spending the night in an eerie, neglected mansion owned by a legendary madwoman. The duchess s companion, the fiercely independent Charlotte, is another matter altogether. Hugh would be happy to spend as many nights in her bed as possible. He knows she s hiding terrible secrets, but for once in his life, Hugh has the desire to take on someone else s burden as his own, no matter what the danger... \n They re mad, bad, and totally irresistible...\n \n","cover":"https://allnovel.net/images/scandalous-liaisons-historical-4.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/scandalous-liaisons-historical-4.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:57:47 AM"}}
