{"id":65605,"no":29,"title":"Page 29","content":"He almost fled, blizzard be damned, when the door creaked open with torturous slowness. A stooped butler, as decrepit as the manse in which he worked, stood in the doorway. “Aye?” the old man queried in a gravelly voice. Hugh handed over his card. “Is the lord of the manor at home?” The butler squinted at the lettering. He lifted the card to an oddly protruding eye and then dropped his hand with a grunt. The servant gestured wildly behind him. “You’ll find ’im in the cemetery out back.” Before Hugh could blink, the door was swinging with lightning speed toward his face. Moving with a pugilist’s quick ease, he slipped into the hall before the door slammed shut. The butler turned, bumped into his chest, and shrieked in terror. Rolling his eyes, Hugh steadied the frail man. “Listen, old chap. My desire to be here is far less than your desire to have me here. I require some assistance. If you provide it, I can be on my way.” The butler studied him closely with his oversized blue eye. “Wot ye be needin’, gov’na?” “You may address me as ‘my lord,’ ” Hugh corrected, with a pointed look at his calling card, presently being crushed in the butler’s hand. “What is your name?” The servant sniffled. “Artemis.” “Very well, Artemis. Are there any other men about the place?” Hugh glanced around. “Men preferably capable of physical exertion.” Artemis studied him with blatant suspicion. “’Enry. ’E’s a strapping lad wot runs the stables. And Tom, ’e ’elps Cook wiv the vittles.” “Excellent.” Hugh released a sigh of relief. “Would it be possible to find decent horseflesh around here?” Even as he asked, he knew it was asking too much, given the sight of the place. “O’ course!” the old man cried, affronted. “’er Grace ’as the finest ’orses you’ll ever see!” Hugh stilled, his mind rapidly disseminating the information he’d gathered so far. His Grace lay in the cemetery, which left Her Grace widowed. There weren’t many duchesses, hardly any that were widowed, and only one of whom he was aware who would claim ownership to a sorry place such as this— “‘Her Mad Grace’?” Of all the damnable luck! “’ere now!” Artemis complained. “We don’t take kindly to that nonsense ’round ’ere!” Hugh cleared his throat. He was leaving. Now. “Well, I’m certain Her Grace wouldn’t mind at all if I borrowed her—” “You can’t just barge in ’ere and run off wiv ’er Grace’s ’orses.” The old man straightened as best he could. “You’ll ’ave to ask ’er first!” “Ask her? Good God, she’s in residence here?” The place wasn’t fit for man or beast, let alone for a duchess. “O’ course. Where else would she be?” Artemis snorted. Hugh arched a brow. “Where else indeed?” “Come along, then, gov’na.” The servant shuffled away, stopping only to grasp the candelabra off the console. “You can wait in the parlor while I tell ’er Grace yer ’ere.” Shoving open a set of double doors on the right, Artemis gestured impatiently for him to go inside, shoving the candelabra at him as he passed. Hugh moved into the room and then spun about as the door slammed shut behind him. “Abominable service,” he muttered, glancing around. No other candles were lit, and the grate was cold. Every bit of furniture was draped and covered with thick dust. Even the portrait over the fireplace was hidden from view. Depositing his meager source of light on a cloth-covered table, he set to work building a fire. Grumbling under his breath, Hugh inspected the coal bucket, surprised to discover it did indeed have coal inside it. Within moments he’d started a fire. He stood and used a nearby dusty sheet to wipe his hands. Of all the confounded places for his wheel to break, why did it have to be here? Hugh rubbed the space between his brows, trying to remember everything he’d heard about the dowager Lady Glenmoore. The elderly duke had shocked the ton a few years past with a rushed elopement with his second wife. Then His Grace had gone on to compound the astonishment by passing away within scant weeks of his marriage. It was widely speculated that the new duchess had helped her husband to his final reward. The succeeding Duke of Glenmoore had distanced himself from his stepmother in short order, banishing her to a remote holding, where it was rumored she passed the time scaring the wits out of hapless passersby such as Hugh. The duchess’s weird behavior had earned her the moniker ‘Her Mad Grace.’ A bizarre noise caught his ear, pulling him from his thoughts, and Hugh held his breath as it drew closer and increased in volume. The door opened, the squeaking of the unoiled hinges accompanied by the cacophony of rattling china. His eyes widened as he found himself dumbfounded by the vision that greeted him. A young woman entered, her slim arms weighted with an ancient tea service. The entire arrangement wobbled horrendously, and he gaped at the bouncing, clattering items on the tray. He’d never seen anything like it in his life, and he waited breathlessly for the moment when everything would crash to the floor. She whimpered suddenly, and the sound galvanized him into action. Hugh closed the space between them, plucked the service from her hands, and set it down. Turning to face the maid, he saw that her entire body shook as if she stood in the back of a cart traveling a very bumpy lane. Pretty, in a plain sort of way, with flyaway brown hair and pale blue eyes, she offered a smile as shaky as the rest of her. Hiding his reaction with practiced ease, Hugh realized the young woman suffered from a pitiable nervous affliction of some sort, not surprising considering the residence in which she lived and made her livelihood. She stammered something unintelligible, dipped an odd, crooked curtsy, and fled the room, as if he posed some grave threat to her person. Hugh shook his head in wonder. Were all the servants plagued with some ailment or another? Glancing at the service, he was relieved to see the tea had already been prepared. He poured and drank, appreciating the warmth, which chased away his chill. So much time passed while he waited, he nearly finished the pot before the door creaked open again. Hugh turned to face the newest arrival. He was so amazed at the graceful glide with which the figure entered, he forgot to set his cup and saucer down and merely stared. Black-clad from head to toe, her face veiled with lace, the duchess swept in with haste and halted just as quickly. She stood a few feet away, her figure short and petite. Because the darkness of her gown blended with the shadows, he could see very little of her, but something about her gave him pause. His body tensed, turning hard all over, and his fingers held the delicate china saucer far too tightly. Sweat misted his brow despite the cold. It wasn’t nerves or apprehension that held his attention so completely. No, it was far worse than that . . . Good God, he was becoming aroused! Shooting a horrified glance at the tea in his hand, he quickly deduced that the infamous madness must spread through the water. Hugh dropped the cup and saucer on the table with such haste, the remaining liquid splashed over the rim and stained the dusty cloth below. “Is there something wrong with the tea?” the duchess queried, her voice muffled by the thick veil. He shook his head. “No. I apologize for the—” “What do you want?” she snapped suddenly. “Beg your pardon?” He, of the dry wit and ready retort, could think of nothing more clever to say, his brain feverishly trying to comprehend why his body was ready to mate with an elderly duchess suffering a mental malady. “Why are you here?” she repeated slowly as if it were he that suffered the brain affliction. “What have you come for?” Hugh gathered his wits. “My carriage wheel was damaged in a rut. I require the use of—” “I’m truly sorry, but I haven’t the means to help you.” She fled the room with as much haste as the maid. Mouth agape, he decided something truly heinous polluted the water hereabouts. There was no other explanation for this craziness. Flushed, slightly disoriented, and quickly becoming mad as hell, Hugh strode out the open doorway, bearing down on the dark figure who scurried away. “Oh, Your Grace,” he called out with deceptive courtesy. “Another moment, if you please.” Her pace quickened. So did his. His legs were longer. She hit the steps, hiking up her skirts, and he lunged forward, catching her elbow. She gasped. He almost did, too, but restrained himself. Her arm was firm and well-formed under his fingers, not at all as he imagined. “Perhaps I misled,” he said dryly. Her lace-covered face turned to his. “I wasn’t asking.” She stiffened. “You’re ill; I collect that.” His gaze narrowed as he attempted to discern the facial features hidden behind the veil. “It appears you are unaware that a blizzard is fast approaching, and this is one of the coldest winters on record. My servant’s arm was broken in the fall, and one of my horses is lame—” “Lame?” she repeated, her voice tight. Ah! He suddenly remembered Her Grace’s love of horses, as professed by the ancient Artemis. Cad that he was, Hugh had no hesitation in playing on her sympathies. “Yes, lame. I’m certain the beast will recover, given the proper care and rest. So, too, will my footman, if also provided with proper care and rest.” He released her arm and stepped back, prepared to give chase if she fled again. “I haven’t the time to seek out another domicile, Your Grace. I am the Earl of Montrose, not some thief set to rob you. I will return your horses and conveyance to you at my soonest, I can assure you of that.” She stood silently for a long moment, her damaged brain seeking something to say, he was certain. Finally she gave a jerky nod of agreement and turned, taking the steps with remarkable agility for a woman of her vast years. Relieved, Hugh turned and bellowed for Artemis. He had no notion if the madness was permanent or not, but he had no desire to catch it in any case. “Go with him.” Charlotte looked out the upper-floor window and watched the dashing earl hitch the horses to a cart. He was a tall man, broad of shoulder, with the most glorious shade of dark-honey hair. He stood silhouetted by the snow, his elegantly dressed body moving with latent power, his shoulders bunching and flexing beneath the velvet of his coat. She couldn’t see his face from here, but she guessed he would be handsome. Or at least she hoped he would be. A man blessed with so fine a form should have a face to match. “It wouldn’t be proper.” “Who cares about proper?” came the laughing rejoinder. “We’ve never done anything properly. And the earl appears quite . . . interesting.” Interesting? Yes, he would be. It had been so long since she’d spoken to someone even remotely her age. She told herself every day that she was content with her life here, but sometimes, at night, she wished for things to be different. Turning, Charlotte allowed the heavy velvet drapes to fall back into place. Her gaze moved around the spotless, well-appointed room, with its damask-covered walls and Chippendale furniture, before settling on the trim figure who waited with an arched brow. “I don’t know. I’d like to help him, but the more assistance we extend, the more he may discover about us.” “Keep him busy then. We can’t leave them out in the cold. The horse is injured and must be tended. The footman could use your healing touch. They’ll catch their death, and neither one of us could live with that. You’ve done well enough protecting our secret these last years. I’ve every faith that you will continue to do so.” Charlotte moved toward the armoire. Opening the mahogany doors, she withdrew a dinner gown and spread it out carefully on the end of the bed. “I still think it’s ill-conceived. The duke’s orders were clear. The others can help him and send them on their way.” “Neither Henry nor Tom can set a broken bone, and well you know it. Go on now. You are better with those horses than anyone. The earl could use your help.” “But it’s late!” she protested. “Excuses, excuses. It’s not late at all, and since Montrose mustn’t see me, I won’t be eating dinner with him, so you can put that away. You will have to entertain him alone, but you knew that already. Now hurry up and change, before you’re forced to chase after them.” Charlotte sighed. “If you insist.” “I do.” Damning the fates for sending him out in this godforsaken weather, Hugh adjusted the harnesses and chanced another glance at the sky. It was growing dark quickly, the storm clouds rolling in with portentous haste. He worried about his injured footman and his horse. Risking the journey had been foolhardy at best, but his sister, Julienne, had invited him for the holidays. He’d declined at first, but in a fit of boredom had changed his mind and decided to go anyway. And this was the result, of course. Julienne would point out all the ways he’d handled the journey irresponsibly: He should have written to accept her invitation so she could expect him. He should never have waited so long to leave. He should have stopped at an inn when the weather took a turn for the worse. He should have commissioned a sturdier equipage, instead of one built to impress. And she would be correct on all counts, as usual. One of these days, he’d like to prove her wrong. He’d like to prove to them both that he was capable of managing his own affairs. That he was a man one could trust to lean upon. Hugh lifted his head and watched the two young men approach him, carrying blankets and flagons of spirits to warm his servants. They were strapping lads, as he’d requested, although one of them stuttered terribly and the other had a lazy eye. Regardless, they would serve his purpose, and they seemed eager enough. Not that he blamed them. If he were in their place, he’d wish for any fortuitous circumstance to leave this forgotten estate.","sourceLink":"https://allnovel.net/scandalous-liaisons-historical-4/page-29.html","bookId":2666,"book":{"id":2666,"title":"Scandalous Liaisons (Historical #4)","description":"Storyline: Scandalous Liaisons (Historical #4) Oh, those naughty rakes. With their wicked winks, sensual smiles, and bad boy habits, you just can t take them out in polite society. But who wants to go out when you can stay in...? STOLEN PLEASURES Sebastian Blake, Earl of Merrick, long ago fled the responsibilities of his title to become the infamous pirate, Captain Phoenix. But the booty he s just captured on a merchant ship is a fierce tempered minx who claims to be a bride...his bride, married to him by proxy on behest of their fathers. He could shame his hated family and return his beautiful wife untouched, but no treasure has ever proved more tempting to Sebastian, and making their marriage a true one-in every sense-is his one urgent desire ... LUCIEN\u0027S GAMBLE Lucien Remington s reputation as a debauched libertine who plays by no one s rules-in business or the bedroom-is well deserved. He gets what he wants, social repudiation be damned. But society can keep from him the one thing he truly desires, the untouchable Lady Julienne La Coeur. Until she sneaks into his club dressed as a man and searching for her irresponsible brother. Suddenly she s in Lucien s grasp, his to take, and his mind is filled with the most wickedly sinful thoughts. A gentleman would walk away from the temptation she presents. But then, Lucien has never claimed to be a gentleman... HER MAD GRACE Hugh La Coeur never wanted to be the Earl of Montrose. Wine, women, and a hefty wager are preferable to responsibility of any kind. It s certainly preferable to spending the night in an eerie, neglected mansion owned by a legendary madwoman. The duchess s companion, the fiercely independent Charlotte, is another matter altogether. Hugh would be happy to spend as many nights in her bed as possible. He knows she s hiding terrible secrets, but for once in his life, Hugh has the desire to take on someone else s burden as his own, no matter what the danger... They re mad, bad, and totally irresistible...","cover":"https://allnovel.net/images/scandalous-liaisons-historical-4.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/scandalous-liaisons-historical-4.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:57:47 AM"}}
