{"id":65616,"no":40,"title":"Page 40","content":"She lifted her chin. “Whatever I please.” Jared laughed, a harsh sound lacking any humor. “Decided to make a laughingstock of the old man after all?” His gaze narrowed. “I will not allow you to besmirch the Kent name.” Charlotte forcibly restrained herself from taking a step back. Any sign of weakness would only fuel Jared’s ire. “No one knows who I am.” “Charlotte,” came the soft, hesitant voice down the hall. “Are you well?” She turned her head toward Gwen and managed a reassuring smile. “I’m fine. Please go wait downstairs.” Jared glanced down the hall, and his face darkened with fury. His hand lashed out, gripping her upper arm in a brutal vice. “You brought my bastard to a social gathering? Are you mad?” Gwen gave a pained gasp, then turned on her heel and ran back down the hall. Furious, Charlotte slapped his face, inwardly cursing the material that prevented a satisfying sting. “Unhand me. You make me physically ill.” “As does the sight of that mistake, dressed in finery and mingling with Society,” he bit out. “She is not a mistake! In fact, Guinevere is the only decent thing you’ve ever accomplished in your lamentable life. In return for your scorn, she has remained hidden, at the cost of her childhood and the chance to make friends. What more could you ask of her?” “To know her place, something you never appeared to have learned.” “I have remained hidden as well,” she argued. “No one knows who I am, nor do they know who Gwen is. Ignore us, and no one will be the wiser.” He yanked her closer, hovering over her like an avenging specter. “I want to know why you’re here and what you intend, and I want to know now! If your aim is to extort money from me, I’ll tell you now I refuse to give you a shilling more than what was bequeathed to you.” “Release her, Your Grace.” The voice down the hall, though soft, was laced with menace. Charlotte turned her head to find Hugh coming toward them with obvious predatory intent. His shoulders squared, his jaw tense, he looked ready to do damage, and she was awed. She simply couldn’t think for a moment, arrested by the sight of him, beautiful in black and shrouded in fury. A force to be reckoned with. The duke, unaware of the danger, didn’t even spare him a glance. “This is none of your affair, Montrose.” “I would listen to him, Jared,” she murmured, having no doubt, by the look of him, that Hugh was willing to ignore the Glenmoore title to protect her. As she relaxed under his touch, Jared stiffened and glared at Hugh. “What do you want?” “At the moment I want you to release my fiancée. Then I want you to step away and go about your business.” Charlotte gaped. Then her heart began racing so fast, she swayed on her feet. Jared looked at her with raised brows. “Marrying down, Charlotte? At least this peer isn’t on his deathbed.” “Go to hell,” she snapped, tugging at her arm. Rescuing her was one thing. Lying to a duke of Glenmoore’s power would only lead to trouble. Releasing her, Jared stepped back. “She’s after money, Montrose. She’s a mercenary female, if I ever saw one. Do you know anything about her? Her past? Anything?” Hugh stopped mere inches way. “I know everything about Charlotte and Gwen and the whole morass. I shall be taking them all off your hands. The only thing you need concern yourself with is the dispersing of Charlotte’s trust, which I’ll set aside for Gwen, as your father intended.” Jared’s face broke out in a grin. “Ah, I see. What a perfect match you two are.” “What are you talking about?” Charlotte asked crossly. “This is about the widow’s trust, Charlotte dear.” His gaze returned to Hugh. “You should know, Montrose, that the stipend is negligible. Not enough to keep you in the style to which you’ve become accustomed. Certainly not enough to wager.” Hugh stiffened. “This is not about money.” “It is for Charlotte,” the duke said. “It’s always about money for Charlotte.” He looked at her. “Do you know anything about your intended, dear? Did he tell you how he wagered away almost every shilling of the La Coeur funds? He was forced to sell his sister to Remington to bail them out of debt. Why do you think an earl’s daughter married a bastard?” Suddenly Charlotte’s nausea became a very real hazard, and she clutched her stomach in a vain attempt to still its roiling. “Lady Julienne chose Remington of her own accord,” Hugh growled. “She was set to marry a marquess,” Glenmoore continued, digging in deeper, as he relished Charlotte’s obvious distress. “But then Lord Fontaine cast her aside when he realized how far in his pockets Montrose was.” “Lies!” Hugh glanced her way, his face flushed, his fists clenched. Glenmoore arched a brow. “Are you claiming you weren’t nearly destitute from irresponsible gambling?” Hugh’s expression could have been set in stone. “That was long ago.” “Only a few years, I believe.” The duke’s smile was filled with malice. “Regardless, I was on my way to join the rest of the party, and I don’t wish to hold up the proceedings. Congratulations, Montrose. Charlotte. I’ll await your missive detailing where I should direct Charlotte’s pension. Also, since you won’t require the manse anymore, I’ll make arrangements to sell it.” Glenmoore walked away, leaving destruction in his wake. Hugh was so furious for a moment, he could hardly think. When Gwen collided with him on the stairs and blurted that her father had cornered Charlotte, the rage he’d felt had almost overwhelmed him. If he had any doubts earlier about his feelings for his paramour, he didn’t any longer. “You should never have told Glenmoore we were affianced!” Charlotte groaned. “He will mention our engagement to someone just to embarrass you. This is a disaster.” Hugh stepped closer to offer comfort. She was frighteningly pale, her mouth and eyes rimmed with lines of tension. Trying for levity, he placed a hand over his heart and gave an exaggerated sigh. “You know, a man could be irreparably damaged by such a response to his proposal.” She flinched. “We must go down and correct this mistake. Whatever will your family say when they hear of this?” Hugh tapped a finger to his chin. “Congratulations?” he suggested. “You are impossible. Lady Julienne warned me that you were known for being irresponsible and jumping into situations headfirst. I had no notion what she was talking about until now.” She attempted to pass him, and he sidestepped into her path. “Hugh, the guests will gossip if we hold up the meal.” “Perhaps, but it won’t be too untoward in this company.” At her raised brow, he explained. “Julienne and Remington have been relegated to the fringes of Society for years. Only the most daring and licentious of guests will deign to associate with them. Glenmoore attended only because he wishes to enter into a partnership with Remington, who has the devil’s own luck when it comes to making money.” She tilted her head back to look at him, her entire body tense and expectant, like a bird prepared to take flight. Hugh’s heart sank to his stomach. She didn’t look even remotely like a woman pleased with an offer of marriage. A sick feeling of dread pooled and then hardened in his gut. “Don’t you think we should discuss my proposal?” Charlotte stumbled backward, her eyes wide and stricken. “Good heavens, you weren’t serious!” Hugh moved toward her, his heart racing in near-panic. “You were afraid my affections would be temporary. You worried I would cast you aside and leave you and your menagerie destitute. I’ve resolved that. As my wife, your comfort will be assured.” She shook her head. “We hardly know one another.” “I think we know each other very well.” He stepped closer and reached for her hand, which she didn’t raise to meet his. “Don’t you care for me, Charlotte?” he asked softly. “Even a little?” Her fingers tightened on his. “Of course I care for you, Hugh, very much. But . . .” “I searched for you all afternoon.” “You did?” She began to tremble. “I did.” Lifting her hand, he held it to his cheek, despising the glove that separated his skin from her touch. “I needed to find you, to warn you about Glenmoore, but you kept moving, and I could never catch you. I was quite desperate for you, actually.” “Hugh . . .” He nuzzled into her palm. “I waited in your room for nearly an hour. Where did you go after you left the stables?” “I-I was in Julienne’s room.” “Ahh . . . I was sick with worry. I couldn’t bear to think of you facing Glenmoore alone.” “Oh, Hugh . . .” Her fingers curled, cupping his cheek. “I am accustomed to caring for myself.” He leaned into her touch, the warmth of which burned through her glove and heated his blood. No other woman had ever affected him as Charlotte did. “There is no weakness in relying on someone to assist you and care for you. The only weakness is in allowing yourself to suffer when support is at hand.” Beloved green eyes swam with tears. “But I cannot rely on you, Hugh. I do not know you well enough. Just in the last half hour, I’ve learned things about you that have shocked and disturbed me, not just from Glenmoore, but from your sister as well.” Raw pain, piercing and wounding, cut him to the quick. His eyes slid closed. “Please don’t say that,” he murmured hoarsely, pulling her against him, needing the physical closeness, because he felt her withdrawing. “Don’t judge me by my past.” “There is more at stake here than just you and me, Hugh. You’ll regret this rash proposal later. I am not a suitable wife for you. The burden of those I bring with me will begin to weigh on you. You will come to resent me and then hate me. I lack the breeding to be a proper countess. You would—” Hugh covered her mouth with a kiss, cutting off her words. Her lips melted into his, and he groaned, pressing his advantage, his hands stroking her back until she opened with a whimper. She returned his ardor in equal measure, kissing him as if it were the last time, as if they never would again. Her arms lifted, her small hands cupping the nape of his neck, holding him close. The lush, ripe mouth that he loved so much moved feverishly under his, forcing his desire to rise up to match his anger and fear, then far surpassing both. Pulling away, he rested his damp forehead against hers. “What are you afraid of?” he asked softly. “Being abandoned or discarded? I’m not Glenmoore. I won’t take all that you are or all that you have, and leave you with nothing.” “I-I’m not afraid.” “You are. Afraid to trust. Afraid to hope. Afraid to love.” “Hugh—” “Have I disappointed you, Charlotte? Have I promised you something and then not delivered?” “Not yet, but—” “Not ever. You either trust me to support you, trust me to be a good husband, to love you and care for you . . . You either trust me, or you don’t.” She melted against him, her slight weight necessary and welcome. He hugged her close, squeezing her, until there was no space between them. He held his breath, waiting. “Please understand,” she begged. “I am responsible for the care of Gwen and the others. My decisions must be made with my head, not my heart.” He recoiled as the import of her words struck home. “You refuse me.” His voice was a pained whisper, his heart aching as he stepped away. Her touch, which he had been longing for, was suddenly painful. Hugh struggled to control his breathing, unsure of what he could do or say to erase the tormented look he saw in Charlotte’s eyes. There was sadness there, a deep well of it. Her gaze said good-bye as surely as her kiss had. It was then he realized there was nothing he could say. Her fear was too powerful. Even with an offer of marriage, she still couldn’t trust him. Shaking his head, he turned away, his throat clenched tight. He strode down the hall, suddenly anxious to be away from her and the cloying agony that twisted inside him. “Wait!” she cried after him. “Please don’t go. Not like this.” He knew she would chase him down as she had before, so he lengthened his stride. Hugh left her and the wondrous dream of happiness far behind him. He didn’t look back. He couldn’t. He loved her too much. Chapter Nine “I miss Lord Montrose.” Gwen dropped her cards on the table. “Pick those up,” Charlotte scolded. “I can see your hand.” “I’m no longer in the mood to play. Where is he? I haven’t seen him in two days. I inquired after him with Lady Julienne, and she said only that he was ‘about.’ What does that mean?” Releasing a deep sigh, Charlotte set down her cards and leaned back in her chair. Tired and abjectly miserable, she hadn’t been interested in playing anyway. She’d suggested the game in an attempt to cheer Gwen, who was taking Hugh’s absence almost as hard as she was. “It means he doesn’t wish to be found, Gwen.” Blue eyes narrowed. “What did you do, Charlotte?” “What did I do? Why is his behavior my fault?” “I may be young and naïve, but I’m not stupid. The duke is strolling about, puffed up like a rooster, and you glance away whenever Lord Montrose is mentioned.” Charlotte swallowed hard. Part of her hoped every moment that Hugh would walk into the room just so she could see him with her own eyes and assure herself that he was well. The other part of her dreaded such an event, knowing how badly she had wounded him. Her heart ached every moment.","sourceLink":"https://allnovel.net/scandalous-liaisons-historical-4/page-40.html","bookId":2666,"book":{"id":2666,"title":"Scandalous Liaisons (Historical #4)","description":"Storyline: Scandalous Liaisons (Historical #4) Oh, those naughty rakes. With their wicked winks, sensual smiles, and bad boy habits, you just can t take them out in polite society. But who wants to go out when you can stay in...? STOLEN PLEASURES Sebastian Blake, Earl of Merrick, long ago fled the responsibilities of his title to become the infamous pirate, Captain Phoenix. But the booty he s just captured on a merchant ship is a fierce tempered minx who claims to be a bride...his bride, married to him by proxy on behest of their fathers. He could shame his hated family and return his beautiful wife untouched, but no treasure has ever proved more tempting to Sebastian, and making their marriage a true one-in every sense-is his one urgent desire ... LUCIEN\u0027S GAMBLE Lucien Remington s reputation as a debauched libertine who plays by no one s rules-in business or the bedroom-is well deserved. He gets what he wants, social repudiation be damned. But society can keep from him the one thing he truly desires, the untouchable Lady Julienne La Coeur. Until she sneaks into his club dressed as a man and searching for her irresponsible brother. Suddenly she s in Lucien s grasp, his to take, and his mind is filled with the most wickedly sinful thoughts. A gentleman would walk away from the temptation she presents. But then, Lucien has never claimed to be a gentleman... HER MAD GRACE Hugh La Coeur never wanted to be the Earl of Montrose. Wine, women, and a hefty wager are preferable to responsibility of any kind. It s certainly preferable to spending the night in an eerie, neglected mansion owned by a legendary madwoman. The duchess s companion, the fiercely independent Charlotte, is another matter altogether. Hugh would be happy to spend as many nights in her bed as possible. He knows she s hiding terrible secrets, but for once in his life, Hugh has the desire to take on someone else s burden as his own, no matter what the danger... They re mad, bad, and totally irresistible...","cover":"https://allnovel.net/images/scandalous-liaisons-historical-4.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/scandalous-liaisons-historical-4.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:57:47 AM"}}
