{"id":74549,"no":53,"title":"Page 53","content":"Friday, she’d admitted to herself she was procrastinating. But she decided Saturday was a better day for a conversation like this anyway. Which meant she had to actually make that call today. Or Sunday? Maybe Sunday was an even better day for a call like this? She threw back the covers and forced herself out of bed to make coffee. No, she had to do it today. She’d barely been able to concentrate on anything this week, between this hanging over her head and the thoughts of Drew, which were constantly in her head. Maddie was right. She should have told him how she’d felt. At least then she wouldn’t have this constant, overwhelming feeling of regret. And at least she wouldn’t feel like such a coward. She downed a cup of coffee and shook off the thoughts of Drew. She just needed to get through this week. If she got through the city council meeting on Thursday, win or lose, she could spend the entire next weekend in bed wallowing with French fries and ice cream. And Theo—and Drew—were both right that she had to talk to Olivia before the meeting. The coffee swirled around in her empty stomach as she picked up the phone. Someday she really should switch to tea. She retreated to bed and got under the covers before she scrolled to Olivia’s name in her phone. “Hey, kiddo!” Alexa heard street noise in the background. “How are you this Saturday afternoon?” Olivia laughed. “Morning still for you, I guess.” “Good!” Alexa could tell her voice was too high and tried to moderate it. “Um, where are you? Are you busy?” Maybe she’d be too busy to talk right now and they wouldn’t have to have this conversation? “No, no, just walking home from brunch. What are you up to?” Shit, okay, she had to do it, then. “Just drinking coffee at home, trying to take a deep breath after a long week.” Well, that was an understatement. “Yeah? What’s going on? How’s work going?” She just needed to get it out. It was the only way to start this. “Actually, that’s why I called. I’ve been . . . The mayor has a new initiative for an arts program for at-risk youth, and that’s what I—” “Yeah, I’ve been reading about that! I had a feeling it was your idea. Great job, kiddo.” Alexa took the phone away from her ear and looked at it. Olivia already knew? “I, um—you’ve been reading about it?” Alexa could hear an elevator ding through Olivia’s laughter. “Of course I’ve been reading about it. You think I don’t pay attention to what my little sister is doing? I’m so proud of you for this. City council meeting is this week, right?” Alexa sat up in bed. This conversation was not going the way she’d anticipated. “Yeah, Thursday. I didn’t know . . .” She stopped and started again. She’d missed out on the opportunity to be honest with Drew; the least she could do was be honest with her own sister. “I was scared to tell you. I didn’t realize you already knew.” Alexa could hear Olivia open and close her front door. “Lexie, why were you scared to tell me? This is a great thing you’re doing.” She teared up at the nickname. “I wanted to tell you, but we still don’t know if it’s going to get through the council. I didn’t want to tell you anything was in the works until it passed. I didn’t want to fail you again.” Alexa picked up her coffee cup, realized her hand was shaking, and put it back down on her bedside table. “Again? What do you mean, again?” Alexa twisted her sheets around her fingers to stop the trembling. “I was so . . . I was terrible to you. When we were in high school and everything blew up, I mean. I was such a bad sister, and I wanted . . . I wanted to make up for that.” Oh God, this was even harder than she’d thought it would be. Tears were running down her face now. She hadn’t cried this much in one week since that week she’d gotten her period right before the bar exam. “You’ve been worried about that all this time? You don’t have anything to make up for. I know there’s still friction between us sometimes, but that’s not because I’m still mad at you, or hold anything against you for what happened back then. Yes, things were pretty bad that year, but we were kids.” Alexa let out a sob. She wiped her face with the bottom of her tank top. “I know, but that doesn’t make it okay. I wish I hadn’t been like that to you.” “Lexie, you’ve done so much for me!” Olivia said. “You’ve supported me during times when I needed you the most. You flew to New York at the last minute to move me out of that terrible apartment when I’d gotten dumped, remember? And you—” Alexa broke in, still sniffling. “But I’ve never told you how sorry I am! I’m sorry, Livie. I’m so sorry for what I said and how I acted. I’ve regretted it for years, but I’ve been too ashamed and too scared to apologize. I guess this program was going to be my apology, but whether or not the council passes it, I need to say it out loud, too.” She could hear sniffling on the other side of the phone now. “Oh, honey, apology accepted. I’m glad you said it, but I didn’t need to hear it. I always knew you were sorry. I’m so glad my experience inspired you. The teens of Berkeley are lucky to have you championing them.” Alexa’s tears kept falling, but they were happy ones now. She got up to pour herself more coffee, and maybe make some toast to settle her stomach. “Thank you. That means so much for you to say.” She could hear the gurgle of Olivia’s coffee maker in the background and almost laughed. Like sister, like sister. “Okay, so tell me everything about this TARP program of yours that hasn’t been in the paper—terrible acronym, by the way. Who came up with that? And what ever happened with the dude from the elevator?” Alexa reached for the expensive jam from Paris she’d been saving. She deserved it today. “Oh, Liv, I have so much to tell you.” Drew walked through the hospital on Sunday morning, relieved that he’d finally recovered from his hangover from Friday night. Copious amounts of junk food the day before and a long run where alcohol came out of his pores were the only things that stopped his curses at Carlos and all of that damn beer he’d bought. If only the solution to what he would do about Alexa was so easy to find. Could he tell her how he felt about her? What if she didn’t feel the same way? Wouldn’t it be easier to pretend he’d never met her? These were the questions that had been spinning through his mind for a day and a half, with no answers. He’d been all ready to text her on Friday night, but Carlos confiscated his phone. Probably for the best; the half-written text he saw when he woke up Saturday morning said something nonsensical about how much he missed her naked body against his—while that was true, it was probably the wrong way to approach this problem. He didn’t know the right way yet. He got up to the fifth floor and waved at the nurse at the desk. He ducked his head into the third room on the left and found who he was looking for. “Hey, buddy, how are you doing?” “Dr. Nick!” Jack grinned at him from his chair and waved. “Did you come to visit me?” He walked over and sat down next to him, exchanging smiles with Abby. “Sure did. Haven’t seen you in a little while. Wanted to check and see how one of my favorite dudes is doing.” He sat back and let Jack’s animated chatter wash over him until it slowed and finally stopped. “He’s asleep,” he said to Abby. She’d been pretending to read her book the whole time they talked, but he’d noticed that she hadn’t turned a page. “Yeah, the chemo takes a lot out of him.” She closed her book and smiled at him. “Thanks for coming by, though. I know he loved seeing you.” He looked over at Jack, who looked even younger than usual, sound asleep and hooked up to multiple IVs. “I loved seeing him, too, even though it’s tough to see him like this.” Tears jumped to Abby’s eyes, and he felt like an ass. If it was hard for him to see Jack like this, how did he think his mother felt? “I talked to Dr. Sullivan, though; she said his prognosis is good. She seemed very hopeful.”","sourceLink":"https://allnovel.net/the-wedding-date/page-53.html","bookId":1776,"book":{"id":1776,"title":"The Wedding Date","description":"Storyline: A groomsman and his last-minute guest are about to discover if a fake date can go the distance in a fun and flirty debut novel. Agreeing to go to a wedding with a guy she gets stuck with in an elevator is something Alexa Monroe wouldn\u0027t normally do. But there\u0027s something about Drew Nichols that\u0027s too hard to resist. On the eve of his ex\u0027s wedding festivities, Drew is minus a plus one. Until a power outage strands him with the perfect candidate for a fake girlfriend... After Alexa and Drew have more fun than they ever thought possible, Drew has to fly back to Los Angeles and his job as a pediatric surgeon, and Alexa heads home to Berkeley, where she\u0027s the mayor\u0027s chief of staff. Too bad they can\u0027t stop thinking about the other... They\u0027re just two high-powered professionals on a collision course toward the long distance dating disaster of the century--or closing the gap between what they think they need and what they truly want...","cover":"https://allnovel.net/images/the-wedding-date.jpg","author":"Jasmine Guillory","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-wedding-date.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:31:00 AM"}}
