{"id":74505,"no":9,"title":"Page 9","content":"“No Dr. Drew, never Dr. Drew. Dr. Nichols, thank you, though most of my younger patients just call me Dr. Nick.”\n They walked by Josh and Molly on the way to the door, and Alexa pulled at his hand.\n “What?” He turned and saw her head incline toward them. “Oh, right.”\n “We’re taking off,” he said to them. “See you tomorrow.”\n Alexa stopped, which forced him to stop, too.\n “Thank you so much, both of you, for your warm welcome. I can’t wait to celebrate with you tomorrow.”\n “Thank you!” Molly beamed and then hugged her. “I’m thrilled that you’ll be there!”\n After another round of hugs and handshakes, Alexa followed Drew outside.\n “Where did you learn to do that?” he said to her, once they were out on the street.\n “Do what?” she asked him. He hadn’t let go of her hand, and she certainly wasn’t going to be the one to let go.\n “ ‘Thank you so much, both of you!’ ” he said in a high-pitched voice. She swatted him with her clutch.\n “We have not known each other long enough for you to make fun of my voice!”\n “I wasn’t making fun of your voice.” He squeezed her hand. Okay, so he did realize they were still holding hands. “I was making fun of what you said.”\n “Give me a break.” She turned in the direction of the BART station. “Where did I learn basic social graces? Where did I learn how to say please and thank you? I don’t know, I think my parents taught me when I was two.”\n As they moved through a crowd of people, he let go of her hand. But instead, he moved closer and put his hand on the small of her back again. She could feel herself melting inside. Was he just doing this out of habit? Probably.\n She tried to remember what Maddie had said. No-stress date, relax and have fun, don’t overthink things, just enjoy it. Right, okay.\n He cleared his throat. “If I’ve forgotten to say it, you made this night at least two hundred percent better than it would have been without you. Maybe more.”\n She smiled at him. “I had a surprising amount of fun myself. Now, what’s the plan for tomorrow?”\n Classic Alexa. Ignore the compliment; change the topic to logistics. Relaxing was definitely not her strong suit.\n “So I was thinking . . .” He dropped his hand from her back and turned to her with a weird look on his face.\n Was he bored by her? Was her sarcasm too much? Was he going to say he’d rather have a fake breakup tonight and not have her as his date for the wedding tomorrow so he could enjoy the buffet of bridesmaids, with the maid of honor as the main course? I had a great time hanging out with you, Alexa, he’d say, but I’m going to let you off the hook for tomorrow night. You don’t mind, do you? And of course she would have to say no, she didn’t mind.\n And she’d have to go return that hot red dress.\n “Yeah?” She pulled her coat tighter around her shoulders.\n “Maybe you could come get ready for the wedding in my hotel room? You know, so everyone sees you leaving from the hotel, not that I think that people think we’re lying, but Amy seemed a little suspicious or something, and then you wouldn’t have to . . .”\n “That makes sense.” She cut him off, trying not to show how relieved she was. “What time?”\n His smile widened. He had probably gotten everything he wanted in his life with that smile. Who was she to break the pattern?\n “I have to be at the church by five, so just be there before I leave? There’s a shuttle from the hotel to the church, and you can take that over so you don’t have to sit around during the pictures.”\n They walked down the street, no longer hand in hand. “That sounds good.”\n “Great.” They were at the entrance to the BART station now. “Okay. See you tomorrow? Text me if you have any questions?”\n He leaned in for a hug. Without stopping to think about it, she kissed him on the cheek. He pulled back and looked at her for a long moment.\n An ambulance roared by and they jumped apart.\n He stroked her cheek with his thumb.\n “Good night, Monroe. See you tomorrow.”\n Alexa thanked God the next morning that the real work of building the playground was for people who actually knew what they were doing. She could still keep her boss on message and banter with the press while her mind was constantly wandering to her date that night, but if she’d been operating power tools, it would have been a disaster.\n By the time she knocked on the door of room 1624 she was a bundle of nerves. Maybe he thought better of this? Maybe he already checked out of the hotel and forgot to tell me? Maybe he . . . She didn’t have a chance for another possible worst-case scenario before he opened the door. And then she was speechless for a moment.\n She’d thought Drew was hot in his worn gray T-shirt in the elevator, and she’d thought he was hot at the rehearsal dinner, clean-shaven in his pale blue button-down shirt. Now, in a tuxedo, he was so hot she was afraid she wouldn’t be able to look him in the eye all night.\n He wasn’t even fully in the tux—that was the worst part. He had the shirt on and the bow tie untied around his neck, with his hair still damp. He looked like every romantic comedy hero at the end of the night, just before the heroine pulled his shirt out of his pants and started unbuttoning . . .\n “Hey!” He interrupted her increasingly lurid train of thought. “You’re just in time. I was about to break into the snacks.”\n “Snacks?” she asked. She followed him into the room, momentarily distracted from her fantasies.\n “I got us cheese and crackers . . . and beer. If this is anything like most weddings, we’re not going to eat for a while. I don’t know about you, but I could use a drink before this night gets under way.”\n “You read my mind,” she said. She dropped her tote bag on his bed and hung her dress up in the closet. “I almost brought a bottle of wine, but I didn’t want to start dancing on tables before the wedding even began.”\n He disappeared into the bathroom and came out a few seconds later with two bottles of beer in his hands.\n “Beer’s in the bathroom sink. The champagne bucket was too small for a six-pack. Plus, there are two sinks; filling one up with ice was the biggest stroke of genius I’ve had in a while, if I do say so myself.” He cracked open both bottles, handed her one, and then raised his to her. “To my wedding date, and thanks again.”\n She took a long drink of her beer and looked around the room, trying to find something to distract herself from how much she wanted to lick that drop of condensation off his lower lip. Huge king bed, neatly made up, so housekeeping must have already come and gone. A full-length mirror by the closet—great, she would need that while getting dressed. Floor-to-ceiling windows beyond the bed. She wandered over to the window, beer in hand, and glanced outside.\n “Wow.” The view stretched out over the sparkling bay. She could see both the gray and white bulk of the Bay Bridge and the gleam of the Golden Gate Bridge, with the bright sun overhead.\n “The view is something else, isn’t it?” he asked. He came up behind her so close she could feel his body heat. She wanted more than anything to lean back against his warm chest.\n “It really is,” she said, without turning around. “Olivia was on this side of the hotel, too, but we were so busy talking I didn’t even look out the window. Josh and Molly got a perfect day for their wedding.” She turned to him, but he’d already stepped back over to the desk.\n “I couldn’t compete with your fancy cheese and crackers,” he said, “but I did what I could.”\n She walked over to investigate and set her beer down so that she could dig in.\n “I love this stuff,” she said, dipping a Wheat Thin into the tub of herbed cream cheese.\n He followed suit.\n “You’re not just saying that to be nice? Or because you need to eat something so that you don’t jump up on that table and start dancing? Don’t hesitate to do that on my account, by the way.”\n She took another swig of beer and grinned.\n “I told you, I love all forms of cheese and crackers, even that gross stuff that I used to get in my lunch as a kid with the little red plastic spreader.” \n","sourceLink":"https://allnovel.net/the-wedding-date/page-9.html","bookId":1776,"book":{"id":1776,"title":"The Wedding Date","description":"Storyline: \n A groomsman and his last-minute guest are about to discover if a fake date can go the distance in a fun and flirty debut novel. \n Agreeing to go to a wedding with a guy she gets stuck with in an elevator is something Alexa Monroe wouldn\u0027t normally do. But there\u0027s something about Drew Nichols that\u0027s too hard to resist. \n On the eve of his ex\u0027s wedding festivities, Drew is minus a plus one. Until a power outage strands him with the perfect candidate for a fake girlfriend... \n After Alexa and Drew have more fun than they ever thought possible, Drew has to fly back to Los Angeles and his job as a pediatric surgeon, and Alexa heads home to Berkeley, where she\u0027s the mayor\u0027s chief of staff. Too bad they can\u0027t stop thinking about the other... \n They\u0027re just two high-powered professionals on a collision course toward the long distance dating disaster of the century--or closing the gap between what they think they need and what they truly want...\n \n","cover":"https://allnovel.net/images/the-wedding-date.jpg","author":"Jasmine Guillory","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-wedding-date.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:31:00 AM"}}
