{"id":73730,"no":20,"title":"Page 20","content":"Chapter Nineteen Preston Letting Amanda go home was hard. I wanted to keep her here. Every time she walked out my door, I worried that she wouldn’t come back. That she’d find out the truth about me. Tonight was family dinner at her house. She said her brother had told her that he didn’t want her to tell their mom. She wasn’t emotionally stable enough to deal with it. I didn’t expect her mother to accept me. She knew I was from the wrong side of town. She knew I’d gotten in trouble all through high school and Marcus had helped bail me out. I was Marcus’s charity case in her eyes. I’d never be good enough for her daughter. My phone vibrated in my pocket, reminding me of my appointment. Every time I had to go work, I loathed it more. I’d started looking in the paper every day for a job that could pay me enough to take care of the kids and fit into my schedule with classes and baseball season when it started up. So far there was nothing. I wasn’t qualified for anything. But I wasn’t giving up. I had to find a way out of this. I wanted to be worthy of Amanda, and I knew I never would be as long as I continued doing what I was doing. I reached over and picked up my keys. I had to go do this. If I wanted to keep my scholarship and feed the kids, I had to do this. I walked up the back steps to the three-story brick house that belonged to our illustrious mayor. He was shagging his secretary and his wife was paying me for the same service. She had been for over a year now. I had to park half a mile down the road and walk up from the back of the house and use the back door. She’d leave it unlocked. Opening the door, I went inside and headed for the stairs. Sometimes she waited on me in some ridiculous piece of lingerie, and sometimes she was just upstairs in bed naked, drinking wine. Depended on her mood. I reached the first step and heard voices. That couldn’t be good. She was always alone when she called me. I froze and listened. It was another woman. I recognized the voice, but I couldn’t put my finger on who it was. Surely she hadn’t invited over another one of my clients for a threesome. I charged extra for that, and right now I wasn’t sure I could pull it off. Getting up for just her was going to be hard enough. I was having to close my eyes and pretend lately. It was the only thing that worked. “I’ll see you at the committee meeting next week, then. Thank you, Janice, for offering to help. Having your name behind it will always drive more volunteers.” Janice was the mayor’s wife. This was an impromptu visit she was dealing with, and they were coming around the corner. Shit. I’d started to make a run for it when Mrs. Hardy turned the corner and our eyes met. Fucking hell. Janice’s eyes found me, and they went wide with surprise. She hadn’t been expecting us to get caught either. I stood there unable to move from this train wreck. How did I explain this? I didn’t need this woman to know what I did. I was going to find another job, and when I did, I was going to make myself worthy of Amanda. Her mother knowing this dirty secret of mine would ruin everything. She’d tell Amanda. If she ever found out about Amanda and me, she’d tell her. “Oh, Preston. I’m so glad you’re here. The uh, toilet that is broken is upstairs to the left. It just keeps running over.” Janice’s forced smile and high-pitched voice weren’t very convincing. “Run along now and get it fixed.” She waved her hand and smiled back at Amanda’s mom. Mrs. Hardy’s eyes were still locked on mine. She was connecting the dots, dammit. “Yes, ma’am. I thought you mentioned that your washing machine was broken too.” I was a hell of a lot more convincing. She nodded nervously. “Yes, yes it is. But go on and get that toilet fixed.” I nodded and headed up the stairs, praying Mrs. Hardy believed this bullshit. “Sweet kid. He can fix anything,” Janice said in the same nervous, high-pitched tone. “Is that so?” Mrs. Hardy asked. The tone of her voice made my stomach knot up. She knew. Fuck it all to hell. She knew. Amanda Preston had gone to work out again today. He got a call from his coach and had to leave unexpectedly. I’d been on my way over here. We were going to go down to the beach. We only had a few weeks of heat left before the fall air started making it impossible to enjoy the beach. I scrolled through my text messages to kill time, and I saw Jason’s unanswered one. It had been two weeks since he’d sent it. He hadn’t sent another one. I’d been so wrapped up in Preston I’d forgotten about it. Me: I am so sorry I haven’t responded. With school starting back up and everything, I’ve been busy. I might need to call him. Two weeks was beyond rude. Jason’s response popped up on the screen. Jason: That’s okay. I’ve talked to Sadie. I know you are seeing someone. Lucky guy. Sadie hadn’t mentioned Jason when we’d talked the other day. She was happy for me, but she’d sounded worried too. Me: Yeah. That too. I should have responded, though. I’m really sorry. Jason: Don’t worry about it. Just promise me if things don’t work out that you will give me a call. Keep this number. He was really sweet. If things didn’t work out, I’d be crushed. There would be no calling someone else. Me: I’ll remember that. Thank you again for the offer. Flying to NYC for dinner would be amazing. Jason: Offer stands. Just say the word. The door to the apartment opened, and Preston walked in with a scowl on his face. He’d only been gone an hour and a half. He wasn’t very sweaty, either. “Hey,” I said, laying my phone down to get up and go to him. He held up his hands to hold me off. “I’m nasty. Let me get a shower first.” He didn’t say anything else. He just stalked to the bathroom and closed the door. Loudly. Was he mad that I was still here? My phone played the text song, and I reached down to get it. Jason: I got an invitation to your brother’s wedding. Willow must have sent it when she’d thought there was something going on between us. Me: Are you going to come? Please, God, no. Preston wouldn’t be nice to him. I wouldn’t be able to talk to him if I wanted to keep Preston calm. Jason: I want to. What did I say to that? I couldn’t be rude. Sadie and Jax were coming. The bathroom door swung open. “I’m sorry I was in such a bad mood when I got back,” Preston said, walking out of the bathroom. I looked up from my phone. “It’s okay. I was worried you wanted me to leave. I can if you have things to do.” Preston frowned and closed the distance between us. “God, no. I want you with me. I just had a bad afternoon. I hated having to leave you.” “You weren’t gone that long. We have plenty of time to spend on the beach before the sun goes down.” Preston bent down and kissed me. My text alert went off. Oh, crap. Preston pulled back and looked down at my phone. Jason: You didn’t tell me no. I’m taking that as your approval. I didn’t move. Preston had read it. Trashing it now wouldn’t change that. I wasn’t even sure if this was going to be a big deal. So I waited for a reaction. “Jason? Jason Stone?” I nodded. The angry snarl in his voice told me this would be a very big deal. He took the phone out of my hands, and I let him. I hadn’t said anything wrong. He scrolled up and read through our texts. When he got back to the last one, he lifted his eyes to meet mine. “That’s what you want, Manda? Private jet rides to NYC?” He threw my phone onto the table and stormed into his room. I jumped when his door slammed behind him. My eyes filled with tears. He hadn’t even let me explain. He’d just stormed off. I hadn’t said that was what I wanted. I was being polite. The door opened, and I backed up, not sure if I should leave or if I should plead my case. I wasn’t used to having a man mad at me. It was scary. My dad had never yelled at me, and until the night Marcus found out about Preston and me, neither had Marcus. My heart was racing in my chest, and I felt like I was going to throw up. Preston pointed at my phone. “You talk to him often? Hmm?” I shook my head. “No-o-o,” I stammered. “Sure as hell sounds like it. He’s got money. Your brother sure as hell approves if he’s sending him a wedding invitation.” “I didn’t know about the invitation until just now.” Preston let out a hard, angry laugh. “You knew about the jet ride to New York City, though, didn’t you? Looks like you were the one texting him today too.” “I had forgotten to text him back the last time he texted me. I was trying to be polite. He’s Jax’s brother,” I explained. Preston turned around and slammed his fist into the wall. “Fuck that, Manda. You texted him. You wanted to talk to him.” A tear trickled down my face, and I couldn’t think of the right thing to say to make him understand. He was so angry. For the first time ever, I wanted to leave his apartment. I wanted to go somewhere alone and cry. I walked over and got my phone off the couch, then picked up my beach bag and headed for the door. I didn’t look back at him. I couldn’t or I’d break down crying right now. I didn’t want him to see me cry. I wanted to be mad at him and yell at him and tell him how stupid he was being, but the lump in my throat was stopping me. I hurried out the door and down the steps. When my foot hit the bottom step, I burst into tears. I hadn’t been able to make it to my car. Wiping at my face, I slipped on my sunglasses, which had been on top of my head, and started out toward my car. The sound of heavy steps running down the stairs startled me, and I turned around to see Preston running after me. “Manda, wait. I’m sorry. Please don’t leave.” A smart person would’ve kept walking. I wasn’t a smart person. Preston’s panicked face as he begged me not to leave was more powerful than common sense. “I’m an asshole. God, baby. I’m so sorry. I was upset when I came in, and then I saw the text and it set me off. I’m not going to lie, I’m jealous as hell. You’re mine, and he’s after you. He has money and your family’s approval. Two things I don’t have. I want to be able to fly you to New York City on a damn jet, and anywhere else you want to go, but I can’t.” That was the only explanation I needed. I understood. I took the few steps separating us, and I grabbed his face and kissed him fiercely on the mouth. I was possessive with it. I wanted him to understand that all I wanted was him. Not a ride in a jet and a fancy dinner. He moaned and ran his hands through my hair and pulled me closer to him. I controlled the kiss. I bit his lip and pulled his tongue into my mouth, and I sucked hard before plunging back into the warmth of his. When I finally broke the kiss, we were both breathing heavily. “Day-um,” he whispered. “No one compares to you. No one. Get that through your head,” I told him, and slipped my hand up his chest. “I don’t need jets and fancy locations. I just need you.”","sourceLink":"https://allnovel.net/just-for-now-sea-breeze-4/page-20.html","bookId":1988,"book":{"id":1988,"title":"Just for Now (Sea Breeze #4)","description":"Storyline: Just for Now (Sea Breeze #4) The day Preston Drake figured out that wealthy women paid well for a set of tight abs and a pretty face his life turned around. The run down rat-infested trailer he had shared with his alcoholic mother and three younger siblings was now only a place he visited to pay the bills and stock the pantry with food. He no longer worried about his family starving or living without electricity. The money he made entertaining rich older women more than covered his family’s needs and his own. He had it all figured out. Except… There was this girl. She was as innocent as he was tainted. Amanda Hardy wished her knees didn’t get weak when Preston walked into a room. She hated the fact her heart raced when he flashed his smile in her direction. He had a different girl in his bed every night. He was the kind of boy a smart girl ran from. So, why was she coming up with ways to get close to him? Even when it was obvious he wanted to keep her at a distance. Maybe her heart knew something the world didn’t. Maybe Preston Drake was more than just a pretty face.","cover":"https://allnovel.net/images/just-for-now-sea-breeze-4.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/just-for-now-sea-breeze-4.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:28:24 AM"}}
