{"id":73718,"no":8,"title":"Page 8","content":"Chapter Seven Preston It was off-season for me. Other than workouts, I was free after classes. Last year I’d started partying early every day. This year things would be different. I pulled up in front of the youth football fields. According to the paperwork I’d filled out for Brent to play, his practices would be here every Tuesday and Thursday from five thirty to seven. I made my way over to the side of the fence where parents were sitting on lawn chairs and watching. When I finally got to play baseball, parents had always shown up for our practices too. My mom, of course, never came. I knew she’d never come to Brent’s practices or his games. I didn’t want him to feel as unwanted as I had. I could change that for him. I could be here. Cheering him on. He wouldn’t know that kind of rejection and loneliness. When I got to the gate, I watched the boys warming up and doing stretches and tried to figure out which little guy was Brent. Little boys in football pads and helmets all look the same. “You don’t look old enough to have a son out there. You must be someone’s big brother,” an older female voice said from behind me. I glanced back over my shoulder to see someone’s mom smiling up at me from her chair. She was close to forty, but she was dressed like she was in her early twenties. I could tell from her inexpensive, snug-fitting clothing that she couldn’t afford me. Besides, I wasn’t working right now. I was here for Brent. “Yes, ma’am. My brother is playing this year,” I replied. Women her age hated it when I called them “ma’am.” It made me smile. She’d back off now. I turned back to the field just as the coach called out, “Go get water.” The boys pulled off their helmets and came running over to the fence where the large containers of water were lined up. Brent’s eyes locked with mine, and he paused before a big smile broke out on his face. He passed the line for water and came straight for me. “Preston! You’re here.” The excitement in his voice made my heart ache a little. “Of course I’m here. You’re practicing. I didn’t want to miss this.” Brent’s chest puffed up. “I get to play running back. Coach said I got speed.” “Hell yeah, you got speed. You’re related to me.” The toothy grin on his face just got bigger. “I gotta get water and get back out there. You gonna be here until I’m done?” If I’d had any other plans I’d have canceled them. The hopeful look on his face was impossible to ignore. “Yep. You and me are gonna go get a big fat cheeseburger when this is over, and then I’ll take you back home.” Brent whooped, then waved before running over to the water line. He kept glancing over at me to make sure I hadn’t moved. I wasn’t going anywhere. “You’re related to Brent Carey?” The surprised tone in the woman’s voice behind me didn’t go unnoticed. My protective instincts kicked in, and I turned around to look at her. “Yes, I am. He’s my little brother,” I replied, daring her to say anything about him. I didn’t care if she was a woman. I wasn’t going to let her catty, gossiping mouth say or do anything to hurt Brent. “Oh, well. It’s just that no one ever comes around for him. Not at school or anything. I didn’t realize he had an older brother.” She didn’t deserve an explanation. But dammit, I didn’t want her talking about my family. I knew what it was like to have the mothers of the other kids talk about you and your family. It hurt. Kids shouldn’t have to deal with that. “He does” was my only reply. I turned my attention back to the field. Brent was watching me as he got into position. I was going to ignore the snide comments from idiots who had nothing better to do than talk about other people. For the next hour and a half I watched Brent practice. He was good. Better than good, and his coach was right. The kid was fast. He needed some gloves if he was going to be handling the ball that much. We’d go get those tonight. After we purchased the receiving gloves and Brent was one happy kid, we made our way to the Pickle Shack. This was the one place in town to get a good burger. That, and I knew Brent liked the arcade games inside. I followed Brent inside and told the hostess we needed a table for two. “A booth okay?” she asked, batting her eyelashes at me. The girl was maybe sixteen. Damn, they learned young. I nodded, and she spun around and strutted toward a booth in the corner. I fell in step behind Brent, but my feet stopped when my eyes locked with Amanda’s. She was sitting at a large curved booth with three other girls and two guys. I hadn’t seen her since she’d left me in the parking lot of my apartment building three days ago. I’d thought about her endlessly but I had kept my distance. Seeing her here was a jolt. The time away from her had almost helped me deal with what I’d done, but looking into her pretty green eyes now, I knew I’d never get over it. She was so damn sweet, and I was the world’s largest ass. “You coming, Preston?” Brent asked, shaking me out of my trance. I tore my gaze off Amanda and made my way to our booth. I wanted tonight to be about Brent. I didn’t need images of Amanda’s hurt expression haunting me. I also didn’t need to see her sitting so close to some dipshit who wasn’t good enough for her. I didn’t know him, but I knew he wasn’t good enough. No one was. “Who’re they?” Brent asked, looking at me curiously, then back at the booth where Amanda was now studying her drink and twisting her straw nervously. “Uh, no one,” I replied, opening my menu. “That pretty blond girl keeps looking at you,” Brent said, a little too loudly. I couldn’t help myself. I glanced over at her again. Brent was right. She was looking at me. A small smile tugged at the corner of her very full lips. I hadn’t kissed those lips. She didn’t understand why, but I did. Even drunk, I’d known some things were too good for me. Those perfect lips were off-limits to someone like me. I didn’t deserve to get a taste. I wished to God I’d been that smart about the rest of her body. Instead, I’d taken her completely. I had dreams to prove it. “She’s a friend’s sister,” I explained, and shifted my attention back to my menu. “Which friend?” Brent asked curiously. I wanted to tell him to drop it, but I didn’t want to upset him. He was sensitive about things like that. Our mother being an uninvolved parent made him careful who he trusted. Normally, he was quiet. With me he talked. I liked that. “Marcus Hardy. You haven’t met him.” Brent nodded. “I’ve heard you talk about Marcus before. Momma says he has lots of money. Does that mean she has lots of money too? ’Cause she’s really pretty, and I think she likes you.” I couldn’t help but laugh. Kids were way too observant. “Yeah. She has money, but you’re wrong about liking me. She actually doesn’t care for me that much.” Brent let out a sigh. “It stinks being poor. The pretty girls never like you.” Dammit. I hated hearing him say something like that. “When you get older, it won’t be about money. Right now girls listen to what their mommas tell them. That won’t always be the case.” Brent frowned, then looked back over to the table where Amanda was sitting. “She’s gonna leave with that guy. He’s whispering in her ear, but she’s still watching you.” It was real hard to ignore her when Brent was giving me a detailed description of what she was doing now. I looked over at her, and she was standing up with the group she’d been sitting with. The guy’s head was bent and he was saying something awfully close to her ear, but Brent was right. Her attention was focused on me. And I liked it. No use in denying it. I loved the hell out of it. I wanted her attention. I wanted her to want me, because I sure as hell wanted her. She shook her head to whatever the guy said, and then told him bye. I was relieved. The idea of her going anywhere with some guy alone made me ill. I knew what he was wanting. I didn’t blame him, but I sure as hell didn’t like it. Amanda started toward us. Shit. “She’s coming over here,” Brent announced in awe. I was a little surprised too. I hadn’t expected her to actually acknowledge me. She wasn’t wearing shorts tonight. All those legs were covered up by a pair of very snug jeans. Didn’t help. It only fueled my imagination. “Hello, Preston,” she said, smiling at me. The nervous look in her eyes was the only thing that gave away the fact that this hadn’t been an easy decision. She looked over at Brent. “Hello. I’m Amanda.” Brent beamed up at her. “Hi. I’m Brent. Preston is my big brother.” A softness touched Amanda’s smile. The tightness from her nerves was now gone. Well, damn. Having her see anything redeeming about me was not a good thing. I needed her to want to stay away from me, because God knew I wasn’t strong enough to tell her no. “It’s nice to meet you, Brent. I can see the resemblance.” “Really?” Brent asked, surprised. Amanda laughed, and it made my heart rate pick up. “Yes, really.” “You wanna sit with us?” Brent asked, scooting over to give her some room to sit down. Amanda shifted her eyes to me, and I could see the uncertainty there. “I . . . um . . .” “We’d both like you to join us if you want to,” I assured her. She smiled and slid into the booth beside Brent. “Have you already eaten?” Brent asked, shoving the menu into her hands. He was anxious to get her to stay. It was pretty damn funny. The kid had good taste. “I might eat a dessert. I’ve already had a burger and fries,” she replied, smiling over at him. “Okay. Cool,” Brent said, taking the menu back to look at it. I couldn’t stop looking at her. She was so close. I’d had three days to let it sink in that the hot, intense dream I kept having about Amanda was very real. I’d touched her. I’d been inside her. All I could think about now was how I wanted to do it again sober. I wanted to kiss her and make sure she knew just how much I wanted her. I wanted to hear those sexy sounds that had been haunting my dreams clearly so I could remember them when I was alone. “How are you?” she asked, breaking into my thoughts about how much I wanted her naked and under me again. “Good. I guess. I’ve been thinking about things.” I stopped and shifted my eyes to Brent, who was reading the menu, before looking back at her. “Me too. I’m sorry about how things came out.” Why was she sorry? I was the only one who should be sorry. “Manda, you have nothing to be sorry about. That was all on me.” A small grin tugged at the corner of her lips. Could they be any sexier? “Maybe. But I wasn’t thinking clearly either.” “I want a cheeseburger,” Brent announced, handing the menu to me. I needed the reminder that we had an audience. I’d almost said something Brent didn’t need to hear. “Good choice. It’s what I always get,” Amanda told him. “Preston brought me here once before and I had a cheeseburger. It was good. But I had to share my fries with Daisy ’cause she forgot to ask for some and wanted some once I got mine. It was annoying.” Amanda glanced back at me. “Who’s Daisy?” “My little sister. Preston treats her like a baby. She ain’t, though.” The smile on Amanda’s face softened. She liked that. “Preston has a thing for females. I’m sure his little sister is no different,” Amanda told Brent. Brent nodded. “Yeah, I know. Momma says he’s got a different girl every night—” “That’s enough, Brent.” I stopped him before he could get too out of hand. Brent grinned and ducked his head. He knew what he’d said. Amanda stifled a laugh, and her eyes twinkled with amusement as she looked at me through her long lashes. Amanda Brent was adorable. He was Preston’s Mini-Me. I listened to him tell me about football practice and how his first game was coming up. Preston had signed Brent up and paid for him to play football this year, and Brent was extremely grateful. Something that small was a big deal to him. It made me wonder just how bad off Preston’s family was. I knew he’d grown up on the rough side of town, but I didn’t know exactly how bad it was. “So, can you come to my game next Saturday?” Brent asked, breaking into my thoughts. I hadn’t been expecting an invite. Peeking over at Preston, who was watching me closely, I wasn’t sure how to answer. I didn’t want to let Brent down, but I also didn’t want Preston to think I was using his brother to get to him. I didn’t want to get to him again. I’d done that. It hadn’t ended well. “Um, well, I’d love to come to your game. If that’s okay . . . with everyone. . . .” I trailed off, waiting for Preston to tell Brent why this wouldn’t be okay. “Cool, yeah, it’s fine. Preston will be there too. You can sit with him.” “Okay, bud, that’s enough. Don’t pressure Manda into anything. I’m sure she has plans.” There was the excuse I was waiting on Preston to throw in the path. I watched as Brent’s face fell, and I didn’t care anymore what Preston wanted. If he was worried about me coming there for him, then he could get over it. I wasn’t turning down Brent’s innocent invitation just to appease Preston. “I’ll be there. Can I bring a friend? He likes football too.” I had no idea who I was bringing, but it felt like the right thing to say at the moment. Letting Preston know I didn’t plan on coming to see him or sit by him was my main goal. I’d find a “friend” later. “Yeah! Cool. Bring whoever you want.” Brent’s eyes lit up. I could ignore the adult Preston, but the little boy who looked so much like him, with innocent hope in his eyes—I couldn’t turn that down. A short snippet of “Wanted” by Hunter Hayes played on my phone, alerting me to a text message. I needed the small distraction. I pulled my phone out of my purse and looked down to see Jason Stone’s name on the screen. Jason: Can I call you? The reminder I needed that getting near Preston Drake was a bad idea. Jason was a good idea. He was safe. I glanced up at Preston. “I’m going to leave you two to your dinner. I’ve got a call to make, and I need to get home. I have an early class in the morning.” Preston’s forced smile didn’t go unnoticed. Why was he annoyed? I turned my attention to Brent. “I’ll be at your game. Have Preston text me the details,” I told him. His big grin was worth the uncomfortable situation he had put me in. “I will. See ya then,” Brent replied. I nodded and slid out of the seat. I waved bye to both of them and headed for the door. Once I was outside, I texted Jason. Me: Yes. My phone rang just as I was buckling my seat belt. “Hello.” “I’m not disturbing you, am I?” Jason asked. “Not at all.” More like giving me a good reason to get the hell away from Preston. “Okay, good. How were your first two days of classes?” I pulled out onto the almost deserted road. During the summer you couldn’t get out on this road this time of night. It would take hours to get a couple miles. But all the vacationers had gone home for the new school year. Although the weather was still warm, the crowds were gone. “They’ve been good so far. Tomorrow may change things, though. I’m taking calculus, and I am getting supernervous about it. What about you? Are your classes going well?” Jason chuckled into the phone. “I’ve had two classes so far, and I hate them both. Maybe tomorrow will be better. But calculus first year? Really? I’m impressed.” Math was my thing. “Yeah. I’m a math person.” “Me too.” “Really? What’s your major?” There was a pause. “Um, I’m having a few arguments with my parents about that. I’ll get back to you on it.” Weird. His parents were arguing with him about his major? “The reason I called wasn’t to bore you with talk about our courses. I was wondering if maybe you’d be free anytime in the next month?” He ended his question with an amused chuckle. “Um, yeah . . . I think I have some openings in my schedule,” I replied, smiling. “Then my next question is, how soon would your schedule be opening up? I was thinking of flying down . . . soon.” This was the right thing to do. Jason liked me. He wasn’t pushing me away and giving me warnings. “How about next weekend?” “Perfect.”","sourceLink":"https://allnovel.net/just-for-now-sea-breeze-4/page-8.html","bookId":1988,"book":{"id":1988,"title":"Just for Now (Sea Breeze #4)","description":"Storyline: Just for Now (Sea Breeze #4) The day Preston Drake figured out that wealthy women paid well for a set of tight abs and a pretty face his life turned around. The run down rat-infested trailer he had shared with his alcoholic mother and three younger siblings was now only a place he visited to pay the bills and stock the pantry with food. He no longer worried about his family starving or living without electricity. The money he made entertaining rich older women more than covered his family’s needs and his own. He had it all figured out. Except… There was this girl. She was as innocent as he was tainted. Amanda Hardy wished her knees didn’t get weak when Preston walked into a room. She hated the fact her heart raced when he flashed his smile in her direction. He had a different girl in his bed every night. He was the kind of boy a smart girl ran from. So, why was she coming up with ways to get close to him? Even when it was obvious he wanted to keep her at a distance. Maybe her heart knew something the world didn’t. Maybe Preston Drake was more than just a pretty face.","cover":"https://allnovel.net/images/just-for-now-sea-breeze-4.jpg","author":"Abbi Glines","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/just-for-now-sea-breeze-4.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:28:24 AM"}}
