{"id":108062,"no":5,"title":"Page 5","content":"At Ray\u0027s house I wait in the car while he goes in to see if his father has returned, or if there is a message from him. Naturally, I am not surprised when Ray returns a couple of minutes later downcast. The cold has sobered him up, and he is worried. He climbs into the car beside me and turns the key in the ignition. \"No luck?\" I ask. \"No. But I got the key to his building. We won\u0027t have to break in.\" \"That\u0027s a relief.\" While I had Ray look away, I intended just to break the lock. We drive to the building I visited only forty-eight hours earlier. It is another cold night. Throughout the years I have gravitated toward the wanner climates, such as my native India. Why I have chosen to come to Oregon, I am not sure. I glance over at Ray and wonder if it has something to do with him. But of course I don\u0027t believe that because I don\u0027t believe in destiny, much less in miracles. I do not believe Krishna was God, or if he was God--maybe he was God, I simply do not know for sure--then I do not believe he knew what he was doing when he created the universe. I have such contempt for the lotus-eyed one. Yet, after all these years, I have never been able to stop thinking about him. Krishna. Krishna. Krishna. Even his name haunts me. Ray lets us into the building. Soon we are standing outside Mr. Michael Riley\u0027s office door. Ray searches for another key, finds it. We step inside. The lights are off; he could leave them off and I would still be able to find my way around. But he turns them on and heads straight into his father\u0027s office. He sits at the computer while I stand off to one side. I survey the floor. Minute drops of blood have seeped into and dried in the cracks between the tiles. They are not noticeable to mortal eyes, but the police will find them if they search. I decide, no matter what happens, that I must return and do a more thorough cleaning. Ray boots the computer and hastily enters the secret password, thinking that I do not catch it. But I do--RAYGUN. \"Can you check what his latest entries were?\" I ask. \"That\u0027s exactly what I\u0027m doing.\" He looks over at me. \"You know about computers, don\u0027t you?\" \"Yes.\" I move closer so I can see the monitor. A menu flashes on the screen. The computer is equipped with a mouse. Ray chooses something called Pathlist. A list of files appears on the screen. They are dated. The number of bytes they occupy on the hard disk is also listed. A rectangular outline flashes around the file at the top. ALISA PERNE. Ray points to the screen. \"He must be working with this person. Or else investigating her.\" He reaches for the Enter button. \"Let\u0027s see who this woman is.\" \"Wait.\" I put my hand on his shoulder. \"Did you hear that?\" \"Hear what?\" \"That sound.\" \"I don\u0027t hear anything.\" \"I have sensitive hearing. I heard someone outside the building.\" Ray pauses and listens. \"It could have been an animal.\" \"There it is again. Didn\u0027t you hear it?\" \"No.\" I appear mildly anxious. \"Ray. Could you please see if anyone\u0027s there?\" He thinks a moment. \"Sure. No problem. Stay here. Lock the door. I\u0027ll call to you when I return.\" He goes to get up. But he exits the files before he leaves, although he leaves the computer running. Interesting, I think. He was willing to sleep with me, but he doesn\u0027t trust me alone with his father\u0027s files. Smart boy. The moment he\u0027s out the door, I lock it and hurry to the computer. I enter the password and call up the files. I can speed read like no mortal and have a photographic memory, yet I cannot read nearly as fast as a modern computer can copy. From the other night I know Mr. Riley has a box of formatted three-and-a-half-inch high-density diskettes in his desk. I remove two from the drawer and slip one into the computer. I am familiar with the word processor. I set it to copying the file. Mr. Riley had accumulated a lot of information on me. The Alisa Perne file is large. I estimate, given the equipment I am using, that it will take me five minutes to copy the file onto both diskettes. Ray will return before then. While the file copies, I return to the office entrance and study the lock. I can hear Ray walking down the stairs. He hums as he walks. He doesn\u0027t think there is anyone outside. I decide to jam the lock. Taking two paper clips from Riley\u0027s desk, and bending them into usable shapes, I slip them into the tumblers. The first diskette finally fills as Ray returns from his quick outside inspection. I slip in the second diskette. \"Sita,\" Ray calls. \"It\u0027s me. There was no one there.\" I speak from the back office. \"You want me to open the door for you? I locked it like you said.\" \"Never mind, I have the key.\" He inserts the key into the lock. But the door does not open. \"Sita, it won\u0027t open. Have you thrown the latch?\" I approach the door slowly so that my voice will sound closer, but I have turned the monitor around so that I can keep an eye on it. The bytes accumulate quickly, but so, I suppose, do Ray\u0027s suspicions. \"There is no latch,\" I say. \"Try the key again.\" He tries a few times. \"Open the door for me.\" I give the appearance of trying real hard to open it. \"It\u0027s stuck.\" \"It opened a few minutes ago.\" \"Ray, I\u0027m telling you it\u0027s stuck.\" \"Is the lock latch turned up?\" \"Yes.\" \"Turn it sideways.\" \"I can\u0027t get it to turn. Am I going to be stuck in here all night?\" \"No. There\u0027s got to be a simple solution to this.\" He thinks a moment. \"Look in my father\u0027s desk. See if you can find a pair of pliers.\" I am happy to return to the desk. In a minute I have to remove my second diskette and exit the files. I open and close the drawers while I wait for the copying to finish. When it is complete, I jump into the file, scan the first page, then highlight the remainder of the file--which is several hundred pages long--and delete it. Now the Alisa Perne file contains only the first page, which holds nothing of vital importance. I return to the screen that requests the password. I put both diskettes in my back pocket. Striding back to the door, I pull out the paper clips and slip them in my back pocket as well. I open the door for Ray. \"What happened?\" he asks. \"It just came unstuck.\" \"That\u0027s weird.\" \"Are you sure there\u0027s no one outside?\" \"I didn\u0027t see anyone.\" I yawn. \"I\u0027m getting tired.\" \"You were full of energy a few minutes ago. You want me to take you home now? I can come back later and study the file.\" \"You may as well look at it while you\u0027re here.\" Ray returns to the computer. I lounge around the reception area. Ray lets out a sound of surprise. I peek in the door at him. \"What is it?\" I ask. \"There isn\u0027t much in this file.\" \"Does it say who Alisa Feme is?\" \"Not really. It just gives some background information on who contacted my dad to investigate her.\" \"That should be helpful.\" \"It\u0027s not, because even that information is cut off in midsentence.\" Ray frowns. \"This is an odd file for my dad to create. I wonder if it\u0027s been tampered with. I could have sworn ...\" He looks at me. \"What?\" I ask. He glances back at the screen. \"Nothing.\" \"No, Ray, tell me. You could have sworn what?\" I worry he may have registered how big the file was when he first started on the computer. Certainly it is much smaller now. Ray shakes his head. \"I don\u0027t know,\" he says. \"I\u0027m tired, too. I\u0027m going to look at this stuff tomorrow.\" He exits the files and turns off the computer. \"Let\u0027s get out of here.\" \"OK.\" Half an hour later I am at home, my real home, the mansion on the hill overlooking the ocean. I have come with the diskettes because I need my computer. My good night kiss to Ray was brief. His emotions were difficult for me to read. He is clearly suspicious of me, but that is not his dominant feeling. There is something in him that feels like a mixture of fear and attachment and gladness--very strange. But he is worried about his father, more than he was before we went to the office. I have a variety of word processors and have no trouble loading the Alisa Perne file and bringing it up on the screen. A glance at the information shows me that Mr. Riley investigated me for approximately three months before calling me into his office. The data he dug up on me is interspersed with personal notes and comments on his correspondence with someone named \"Mr. Slim.\" There is a fax number for Slim, but no phone number. The number indicates an office in Switzerland. I memorize it and then proceed through the file more carefully. Riley\u0027s initial contact note is interesting. Nowhere in the file are copies of Mr. Slim\u0027s faxes, just comments on them. Aug. 8th This morning I received a fax from a gentleman named Mr. Slim. He introduces himself as an attorney for a variety of wealthy European clients. He wants me to investigate a young woman named Alisa Perne, who lives here in Mayfair. He has little information on the woman--I have the impression that she is but one of many people he or his group is investigating. He also mentioned a couple of other women that he might have me look into in this part of the country, but he did not give me their names. He is particularly interested in Miss Perne\u0027s financial situation, her family situation, and also--and this is surprising--whether anyone she has been associated with has died violently recently. When I faxed back and asked if this woman was dangerous, he indicated that she was far more dangerous than she appeared, and that I was not to contact her directly under any circumstances. He said she appears to be only eighteen to twenty years of age. I am intrigued, especially since Mr. Slim has agreed to deposit ten thousand dollars in my account to start me on my investigation. I have already faxed back that I will take the case. I have the young woman\u0027s address and Social Security number. I do not have a picture but intend to take one for my records, even though I have been warned to keep my distance. How dangerous can she be, at that age? There followed an account of Riley\u0027s preliminary investigation into me. Apparently he had a contact at TRW that gave him access to information not usually available to a common investigator. I suspect Mr. Slim knew of this contact and hired Riley for that reason. Almost immediately Riley discovered that I was rich, and that apparently I had no family. The more he found out, the more eager he was to pursue the investigation, and the less information he faxed back to Mr. Slim. At one point Riley made what to him was a major decision, to use a contact on the New York Stock Exchange. By going to the man he was using up a valuable favor. But I suppose he thought I was worth it. Sept. 21st Miss Perne has gone to extremes to hide her financial holdings, and not just from the IRS. She has numerous accounts at various brokerage houses set up under different corporations, some off shore. Yet they appear to be coordinated by a single law firm in New York City--Benson and Sons. I tried to contact the firm directly, speaking as a rich investor, but they rebuffed my inquiries, making me suspect they handle Perne\u0027s account and no other. If that is true it is another example of this woman\u0027s wealth, for Benson and Sons has investments in the range of half a billion dollars. Yet I have seen her--this girl--and she is as young as Mr. Slim says and very attractive. But her age confuses me, and I wonder if she has a mother somewhere who has the same name. Because many of her business dealings go back two decades, and they can all be traced to the name Alisa Perne. I am tempted to talk to her directly, despite Mr. Slim\u0027s warning. Mr. Slim is not happy with me, and the feeling is mutual. He has the impression I have been withholding information from him and he\u0027s correct. But he has done the same with me. He still refuses to tell me the reason for his interest in this young lady, although I can imagine several scenarios. But his initial comment about her dangerous nature keeps coming back to me. Who is Alisa Perne? One of the richest people in the world obviously. But where did she get her wealth? By violent means? From her nonexistent family? I must, before I give up this case, ask her these questions myself. I have been thinking that Mr. Slim has been paying me well, but that Alisa Perne may want to pay me more. I see already, though, that it would be unwise to let Mr. Slim know I have gone behind his back. There is a certain ruthless tone to his faxes. I don\u0027t think I ever want to meet the man. Yet I find myself looking forward to talking to Alisa. Late September and he is on a first-name basis with me. But he did not contact me till November. What did he do during that time? I read farther and learned that he investigated my international dealings. He discovered I have property in Europe and Asia, and passports from France and India. This last fact was a revelation for him, as well it should have been. Because it appeared, accurately, that I had held the passports for more than thirty years. No wonder, I think, he asked me my age so quickly. Finally, though, he found a violent act connected to my past. Five years earlier, in Los Angeles. The brutal slaying of a Mr. Samuel Barber. The man had been my gardener. I killed him, of course, because he had a bad habit of peering into my windows. He had seen things I didn\u0027t want talked about. Oct. 25th According to the police report, this man worked for her for three years. Then one morning he was found floating facedown in the ocean not far from the Santa Monica pier. His throat had been ripped out. The coroner--I spoke to him myself--was never able to determine the type of weapon. The last person to see him alive was Miss Perne. I don\u0027t think she killed him. I like to think she didn\u0027t--the more I have studied her, the more I have come to admire her cunning and stealth. But perhaps this man learned things about her she didn\u0027t want known, and she had him killed. Certainly, she has the resources to hire whomever she pleases. When I meet with her I must ask her about her gardener. It will be another thing I can use as a bargaining chip. And I have decided I will see her soon. I have broken off all contact with Mr. Slim. In my last fax I told him that I was not able to verify any of my earlier claims about Miss Perne\u0027s personal wealth. I have since changed my fax number, so I do not know if Mr. Slim has tried to contact me again. I imagine he is not happy with me, but I am not going to lose any sleep over it. How much should I ask from Miss Perne? A million sounds like a nice round number. I have no doubt she\u0027ll pay it to keep me quiet. What I could do with that much money. But in truth, I don\u0027t think I\u0027ll touch it. I\u0027ll just give it to Ray when he\u0027s old enough. I will arm myself when I meet with her, just in case. But I am not worried. That was his last entry. I am happy I have deleted the file in the computer. If the police had such information on me, they wouldn\u0027t leave me alone. It might not be a bad idea to burn down the entire office building, I muse. It wouldn\u0027t be hard to arrange. Yet such an act might draw Mr. Slim\u0027s attention to peaceful Mayfair. To young and pretty Alisa Perne. Yet Mr. Riley was a fool to think Mr. Slim stopped watching him just because he changed his fax number. I am quite sure Slim observed him all the closer, and now that the detective has disappeared, Slim and company might even be in the neighborhood. Slim clearly has a lot of money at his disposal, and therefore a lot of power. Yet I am confident in my own power, and I resent this unseen person shadowing me. I hold the Swiss fax number in my memory, and I contemplate what I would say to this fellow should I meet him face to face. I know that my message would be short because I do not think I would let him live long. But I do not forget that Slim knows how dangerous I am. That does not necessarily mean he knows I am a vampire, but it is worrisome. I turn to my fax machine and press the On button. Dear Mr. Slim, This is Alisa Perne. I understand you have hired a certain Mr. Michael Riley to investigate me. I know you haven\u0027t heard from him in a while--I don\u0027t know what could have happened to him--so I thought I would contact you directly. I am prepared to meet with you, Mr. Slim, in person, and discuss whatever is on your mind. Yours Truly, Alisa I attach my personal fax number and send the message. Then I wait. I do not have to wait long. Ten minutes later a brief, and to the point, fax rolls out of my machine. Dear Alisa, Where would you like to meet and when? I am available tonight. Sincerely, Mr. Slim Yes, I think, as I read the message, Slim and company are probably close by, the Swiss number notwithstanding. I figure the message went to Europe and was then sent back here--nearby. I type in my return message. Dear Mr. Slim, Meet me at the end of Water Cove Pier in one hour. Come alone. Agreed? Again, ten minutes later. Dear Alisa, Agreed.","sourceLink":"https://allnovel.net/the-last-vampire-the-last-vampire-1/page-5.html","bookId":2511,"book":{"id":2511,"title":"The Last Vampire (The Last Vampire #1)","description":"Storyline: The Last Vampire (The Last Vampire #1) Sita is five thousand years old and believes she is the last vampire. When someone begins hunting her, she thinks it is the client of a detective she killed. She enrolls in high school and befriends the detective’s son, and later falls in love with him. Meanwhile, Sita’s creator Yaksha has been following her, believing he must kill her to atone for his sins. Sita thought she had killed him years before.","cover":"https://allnovel.net/images/the-last-vampire-the-last-vampire-1.jpg","author":"Christopher Pike","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-last-vampire-the-last-vampire-1.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:15:07 PM"}}
