{"id":83828,"no":16,"title":"Page 16","content":"Elle would have stubbornly forged ahead, fresh air was a commodity for one with a broken leg, but she stopped and tilted her head. “Did you hear that?” Elle asked, narrowing her eyes.\n Emele jumped at the sound of Elle’s voice and turned, finally realizing she had left Elle in her dust. What?\n Elle frowned deeply. “Perhaps I was mistaken. It sounded like someone shaking a bush or branch. It was probably the wind,” Elle said, offering Emele a smile.\n The ladies maid shook her head. No, we must return. I have taken us too far.\n Elle and Emele turned to go when someone spoke.\n “Monster.”\n Emele whirled around, but Elle followed the sound of the voice and looked up.\n A boy sat astride on a large tree branch that draped over the garden wall and hung above the walking trail. He was perhaps ten, and wore the pinched expression of the ignorant.\n “What did you say?” Elle said, her voice was calm and her face was bland, but she started shifting her grip on her right crutch.\n “That there’s a monster, a freak!” the boy said, letting go of the branch to thrust a finger at Emele.\n Emele flinched.\n “You’re gonna be a monster soon too, since you’re walkin’ with it,” the boy said, wiping his nose on his sleeve.\n Elle lifted her right crutch off the ground. “You’re from Belvenes. Run home ‘n finish your chores ‘for your Ma discovers you’ve run off, child.”\n “I’m no child!”\n “Go home,” Elle said, turning her back to the boy.\n “Those monsters, they’ll suck out your soul ‘n steal your voice. Everyone says so!” the boy called after Emele and Elle. “They’re cursed ‘cause they deserve it!”\n The girls moved slowly to accommodate Elle’s shuffling; Emele didn’t seem to notice that Elle was carrying her right crutch instead of using it.\n “They’re evil. If you stay with ‘em you’re gonna be cursed too. Monster, ogre, demon! Hey, listen!” the boy nearly pitched himself off the branch when he threw something at Emele.\n Emele tensed, but Elle raised her crutch. The thrown rock bounced harmlessly off it, falling to the gravel path.\n Elle turned around again and raised her eyes to stare at the boy.\n He briefly hunched his shoulders up to his ears before fiercely saying, “It’s a monster!”\n Elle threw her crutch. It swung through the air like a windmill blade, cracking the boy in the chest. He was tossed from the tree branch by the force of the blow and landed on the gravel covered walking path.\n He coughed and gasped for breath while Elle awkwardly hobbled to him. The boy struggled to sit up, but Elle placed her crutch on his chest and pushed him back to the ground.\n “First of all, her name is Emele. If you call her a monster again I shall be forced to take my remaining crutch and paddle you like your mother should have when you were little,” Elle pleasantly said as she loomed above the boy.\n “Secondly, not only is it inherently rude to break into private property for the sole sake of mocking a person, but it also happens to be a punishable crime,” Elle said.\n The boy paled, his eyes growing huge. “You’re gonna have me thrown in the dungeon,” he whispered.\n “Nonsense.”\n “But yer mad.”\n “I am not mad, I am disappointed,” Elle said. “I am disappointed with you for maliciously searching out people to mock and hurt, and I am disappointed with your parents for doing such an ill job of raising you. Such actions do not speak well of your morals.”\n “But they’re cursed here! They can’t talk ‘n they wear scary masks,” the boy blurted.\n “And they did nothing to deserve it,” Elle said. “And I know they have done nothing to you to deserve your scorn.”\n The boy’s eyes darted to Emele, who was standing some feet away, leaning against the green hedge for support. “She’s scary,” he said.\n Emele flinched, as though his words were a whip.\n Elle paused. She could see how the black masks and inability to speak would be terrifying, but she also recognized it was highly unlikely she was going to teach this boy otherwise. “No, she’s beautiful,” Elle firmly said, removing her crutch from the boy’s chest. “Now leave, before I call another servant to make you leave.”\n The boy needed no second warning. He leaped to his feet and threw himself head first into the green hedge. He deftly shimmied through the iron spokes of the fence and fled.\n Elle briefly raised her hand to shield her eyes against the glare of the sun. “Emele, I fear I have bad news,” Elle said, turning around to face her downcast maid. “I don’t see my other crutch.”\n The confession made Emele smile, briefly. I will find a footman.\n “I am almost certain I could hobble back to the chair.”\n Emele underlined her words on the slate and added, stay, before she left.\n Elle grimaced and hobbled to a stone bench, sitting in the puffing balloon of her skirts as she settled down to wait.\n Chapter 4\n Dressing for Crutches \n","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-16.html","bookId":1808,"book":{"id":1808,"title":"Beauty and the Beast (Timeless Fairy Tales #1)","description":"Storyline: \n Once upon a time Elle made a mistake. A small miscalculation sends her through the roof of an enchanted chateau. Stranded until her broken leg mends, Elle is unwillingly forced to rely on the good will of the sour chateau owner —the cursed Prince Severin. \n Prince Severin—the commanding general and staunch supporter of his brother the crown prince—is cursed to look like a beast until a maiden falls in love with him. He has given up all hope of shattering the curse, and has only disdain for Elle. \n Unfortunately, the pair can’t seem to avoid each other thanks to the meddling of the chateau’s cursed servants. Eventually Elle’s playful manners and Severin’s hidden gentleness draw the pair together. \n But not all love stories can end that easily. After all, Elle is not what she seems, and Severin’s life is placed in danger when hostilities flare between his brother and the monarchs of a neighboring country. When Elle risks everything to save Severin, will he be able to forgive her for her lies?\n \n","cover":"https://allnovel.net/images/beauty-and-the-beast-timeless-fairy-tales-1.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:52:56 PM"}}
