{"id":83833,"no":21,"title":"Page 21","content":"Elle waited hopefully all night, but Emele did not mention her wardrobe, and the following morning she stuffed Elle into a mushroom skirted dress as was custom.\n Elle ate her breakfast in her room and sorrowfully stared through the ceiling to floor windows of her room to watch it rain on the gardens.\n “No going outside today, I suppose?” Elle asked Emele.\n Emele shook her head. It is just as well, she wrote.\n “Why?” Elle asked.\n Before the ladies maid could write out a reply someone rapped on the door.\n “Come in,” Elle said.\n In walked the tall, storkish woman who had visited Elle once before. “Heloise,” Elle said, recalling her name.\n Heloise snapped her head in a stiff nod. She tucked her arms beneath her chest and narrowed her eyes at Elle from across the room.\n The door would have hit her when it swung open if the fast thinking woman hadn’t put a foot out, stopping it cold.\n Bernadine bustled in, plump, round, and smiling as usual. She nearly knocked Heloise over with her round backside when she turned to close the door.\n Heloise’s lips creased in a frown before she smoothed the bun her hair was pulled back into. The tall woman stalked across the room and stopped at the immense wardrobe that held Elle’s borrowed clothes. She flung the doors open and glared at the dresses with the same scrutiny she had given Elle.\n Bernadine waddled over to Elle and Emele, affectionately patting both of them on the hand.\n Emele looked off to the window before snapping a lace fan open and fanning herself. Her lips were pursed in a pout, and Bernadine shook her head at her.\n Heloise stalked back across the room and opened the bedroom door before clapping. A gaggle of women stepped in, loaded down with bolts of silks, satin, velvet, and other costly fabrics.\n Elle stood when one of the women beckoned at her before she started measuring her with a knotted rope.\n “Prince Severin told you I require less elaborate dresses, yes?” Elle ventured.\n She was completely ignored.\n Heloise clapped again, and a buxom woman with stark red lips appeared with startling agility for one her size.\n The buxom woman smoothed the edges of her mask as she trod a circle around Elle, plucking Elle’s crutches from her grasp. She grabbed Elle’s arm and pushed up the sleeve, inspecting Elle’s bare skin with pursed lips. The pushy woman then looked to the closest maid and pointed an accusing finger at Elle.\n The maid descended on Elle, undoing the buttons and ribbons on the back of Elle’s dress.\n Across the room Emele fanned herself with snappish gestures, frowning as she watched the maid strip Elle down until she was standing in nothing but her linen underclothes.\n Elle shivered in the cool air. “Is this truly necessary?”\n The buxom woman did not acknowledge Elle’s question, and snapped her fingers before again pointing at Elle.\n A maid dashed forward, holding a bolt of bright blue silk up to Elle’s cheek.\n Heloise frowned, and the pushy woman planted a hand on her ample bosom and recoiled in horror.\n The next maid darted forward, replacing the soft colored silk with a tomato red colored velvet.\n Heloise waved the maid on and the buxom lady cast a free hand over the eye holes of her mask.\n Heloise and the dramatic woman—the chateau seamstress probably—reacted similarly to a shade of soft pink, egg yolk yellow, and a bolt of sunset orange cloth. (The seamstress almost stormed out of the room when the women tried an unflattering shade of smog black.)\n It wasn’t until a maid held up a sample of mint green silk that Heloise and the head seamstress paused.\n Heloise pressed her lips together as she considered the color combination. The seamstress darted forward to pull a lock of Elle’s black hair over her shoulder and on top of the cloth sample. The seamstress smiled and nodded once, and the maid scurried aside, clutching the bolt of mint green fabric like it was a priceless treasure.\n Heloise and the seamstress also accepted a shade of lavender satin, a forest green velvet, and a swatch of blue-gray silk.\n There were a number of samples left when a maid darted forward, holding a bolt of dark, rose red brocade.\n The room—previously filled with noise of bustling skirts—hushed into the silence of stillness.\n Bernadine—who was consoling Emele by the windows—waddled across the room to stand with Heloise.\n The tall, angular woman threaded her arm through Bernadine’s. The pair looked like old friends, silently encouraging and supporting each other as they stared at Elle and the seamstress.\n The seamstress arranged Elle’s hair on one side and carefully held the rose red fabric up to her hair, face, and finally her eyes. \n","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-21.html","bookId":1808,"book":{"id":1808,"title":"Beauty and the Beast (Timeless Fairy Tales #1)","description":"Storyline: \n Once upon a time Elle made a mistake. A small miscalculation sends her through the roof of an enchanted chateau. Stranded until her broken leg mends, Elle is unwillingly forced to rely on the good will of the sour chateau owner —the cursed Prince Severin. \n Prince Severin—the commanding general and staunch supporter of his brother the crown prince—is cursed to look like a beast until a maiden falls in love with him. He has given up all hope of shattering the curse, and has only disdain for Elle. \n Unfortunately, the pair can’t seem to avoid each other thanks to the meddling of the chateau’s cursed servants. Eventually Elle’s playful manners and Severin’s hidden gentleness draw the pair together. \n But not all love stories can end that easily. After all, Elle is not what she seems, and Severin’s life is placed in danger when hostilities flare between his brother and the monarchs of a neighboring country. When Elle risks everything to save Severin, will he be able to forgive her for her lies?\n \n","cover":"https://allnovel.net/images/beauty-and-the-beast-timeless-fairy-tales-1.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:52:56 PM"}}
