{"id":83850,"no":39,"title":"Page 39","content":"The crown prince sighed and sank into his seat, slinging an arm across his eyes in an appropriately dramatic pose. “You are as thick headed as a rock.”\\n\\n Severin returned his attention to his papers.\\n\\n Lucien lowered his arm and grumbled as he flipped his hunting knife out of his belt. He stabbed it into the table and started carving out shavings, occasionally glancing at Severin. “One of my Rangers intercepted an intelligencer from Arcainia,” he said.\\n\\n Severin set his papers down. “What.”\\n\\n Lucien’s handsome face twisted into a wince. “Ranger Forty Five was conducting a survey of Lord Le Masile’s lands—Father suspects he’s cheating on his taxes. While Ranger Forty Five was there he intercepted an Arcainia agent.”\\n\\n “Where are you holding the spy?”\\n\\n “Nowhere. Ranger Forty Five intercepted him, he didn’t catch him. He crossed paths with the spy some odd miles from the Arcainia border. He thought the fellow looked too competent to be a traveling farmer—the spy’s guise—and rifled through the spy’s belongings when he had the chance. He found coded messages, nothing he could understand. The Arcainia spy realized Ranger Forty Five was on to him and fled.”\\n\\n “Ranger Forty Five did not chase him?”\\n\\n “Ranger Forty Five is an intelligencer, not a Ranger combat operative. Pursuit is beyond his abilities.”\\n\\n “I see,” Severin said.\\n\\n “So now we have a reason for invading Arcainia,” Lucien said.\\n\\n “No, we do not. Neighboring countries all spy on one another, it is not anything worth marching to war for.”\\n\\n Lucien folded his arms across his chest. “Who cares, it’s a small country. We can surely take them.”\\n\\n “Arcainia might be small, but the country’s princes bother me.”\\n\\n “They are cursed annoying. All of them are obsessed with their passions, and they’re about as interesting to talk to as dead mice.”\\n\\n “No, they remind me of myself,” Severin said. “Which does not sit well with me.”\\n\\n “You’re overestimating them. They’re not very bright.”\\n\\n “And yet their agent outmaneuvered ours.”\\n\\n “That is hardly a reflection on their shared competence. And Ranger Forty Five did not completely fail. The message was coded, but the spy had maps with him.”\\n\\n “In case you haven’t realized this, Lucien, carrying maps is not illegal.”\\n\\n “Yes, but in this case the maps were enlightening. They were all of Noyers, the palace, and the land around Chanceux Chateau,” Lucien said.\\n\\n “Noyers and the palace are not unexpected, but my Chateau?” Severin said.\\n\\n “Ranger Forty Five swears he saw at least two maps detailing its location.”\\n\\n Severin rubbed his whiskers. “We need more information. Call back Ranger Seventy Eight from whatever asinine investigation you have him on and send him to Arcainia. He’s the best we have at castle infiltration.”\\n\\n “I can’t. Ranger Seventy Eight is still indisposed,” Lucien sighed. “Another few weeks, though, and that mission should be over. I’ll have Farand begin prepping the assignment.”\\n\\n Severin glared at his half brother, who gave him his best portrait smile. Severin sighed. “Are we finished here?”\\n\\n “Yes. But Severin, be careful,” Lucien said. “The princes of Arcainia are stupid, but there may be real danger if they decide you are the real threat.”\\n\\n “You mean my position as an illegitimate prince places me in a dicey situation as the Royal family cannot be nearly as offended if Arcainia was to off me as opposed to you,” Severin dryly said.\\n\\n “No, I mean that any one of our enemies with half a brain know that killing you will neutralize Loire’s army. Be careful,” Lucien said, reaching up to a place a hand on Severin’s broad shoulder.\\n\\n Severin shrugged. “If you say so. Take care, Lucien.”\\n\\n “You too,” Lucien said, drawing his cloak around him. “Stay safe.”\\n\\n “I will try.”\\n\\n A man clothed in black left Elle’s room shortly before midnight. Elle watched him leave, disappearing into the velvet night, before she stood to close the window he departed through.\\n\\n Jock slept on her bed, creating a soft symphony of snores as Elle stared at the silver moon. Her leg was getting stronger. She was finally able to switch her focus from healing to muscle recovery.\\n\\n She had lost muscle in her time of inactivity, but the last few nights she was slowly able to start pushing herself, performing exercises in her rooms after Emele retired.\\n\\n “They haven’t told me that my leg is better,” Elle said. “Duval insists I’m still in danger, even though I should be able to begin walking without the crutches. Am I a collared dog they mean to keep as a pet?”\\n\\n The moon did not reply, but a few flakes of glittering snow trailed through the air, tossed on gusting winds.\\n\\n Elle watched for a moment before she twitched the curtains shut. “It will be an early winter this year,” she said before retreating to her bed, pushing Jock out of the way so she could stretch out.\\n\\n The Papillon twitched his paws and ran in place as Elle slipped under the covers.\\n\\n “Everything was much easier before I broke my leg,” she grumbled.\\n\\n Chapter 9\\n\\n A Beastly Curse \\n\\n","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-39.html","bookId":1808,"book":{"id":1808,"title":"Beauty and the Beast (Timeless Fairy Tales #1)","description":"Storyline: Once upon a time Elle made a mistake. A small miscalculation sends her through the roof of an enchanted chateau. Stranded until her broken leg mends, Elle is unwillingly forced to rely on the good will of the sour chateau owner —the cursed Prince Severin. \\n Prince Severin—the commanding general and staunch supporter of his brother the crown prince—is cursed to look like a beast until a maiden falls in love with him. He has given up all hope of shattering the curse, and has only disdain for Elle. \\n Unfortunately, the pair can’t seem to avoid each other thanks to the meddling of the chateau’s cursed servants. Eventually Elle’s playful manners and Severin’s hidden gentleness draw the pair together. \\n But not all love stories can end that easily. After all, Elle is not what she seems, and Severin’s life is placed in danger when hostilities flare between his brother and the monarchs of a neighboring country. When Elle risks everything to save Severin, will he be able to forgive her for her lies?\\n","cover":"https://allnovel.net/images/beauty-and-the-beast-timeless-fairy-tales-1.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:52:56 PM"}}
