{"id":83878,"no":67,"title":"Page 67","content":"“That’s because he was with me, and I shield my presence from all kinds of magical tools. But Elle will not have that same protection. Mirror, show me this Elle girl that Prince Severin is in love with.”\n Severin held back a scoff at the description of Elle, but he was at Angelique’s side in a second when the glass swirled before displaying a disheartening image.\n It was Elle, clutching the leg she had broken and leaning against a bare tree. She turned to peer around it, buffeted by snow and wind, before darting to take cover beneath a bush. She reached into a small pouch tied to her belt and took out bandages, wrapping a nasty looking wound on her arm.\n “Is that her?” Angelique asked.\n “Yes,” Severin tightly said. “But how can I find her? She could be anywhere.”\n A tiny frown spread on Angelique’s lips. “You mean you don’t know how to use this?” she asked, gesturing at the mirror.\n “I apologize, I don’t understand.”\n Angelique turned back to the mirror. “Mirror, show me the area this Elle girl that Prince Severin is in love with is in.”\n The image zoomed out, as if they were watching through the eyes of a bird who suddenly took flight. It showed craggy mountains smoothing into white plains before hitting a thick woods.\n “Ah-hah. I recognize that area. It’s in Verglas, a dozen or so miles from your border. That mountain on the horizon is called Gelus. She’s heading for Frigus Forest,” Angelique said.\n Severin was already placing folded clothes in a pack by the time Angelique finished identifying the landscape. He moved swiftly, wasting no movements but remaining controlled and tidy.\n “You are going after her?” Angelique asked, watching Severin select two waterproof maps.\n “Yes,” Severin said, opening a chest on the far side of the room to unearth a crossbow, three hand axes, and a rolled cloth case of daggers.\n “Bring clothes for her as well,” the enchantress suggested, smoothing the shimmering skirt of her dress.\n Severin nodded and opened the door to tell Burke, “Send for Emele, and have Fidele and a spare mount of similar build and temperament saddled. Also ask Bernadine to make up a saddle pack with provisions to last two people a week.” Severin shut the door before his valet could bow. “Will you remain here long?” he asked Angelique as he strapped his saddle pack shut.\n “I will be here when you return,” the enchantress said. “I am interested in meeting this Elle girl.”\n “I will inform a steward who will have a room cleaned out for you.”\n “No need, I have friends in the area I wish to stay with. I would appreciate it if you did not alert your family of my arrival,” Angelique said, a pained expression briefly flickering across her lovely face.\n Severin paused for a moment. “Lucien recited poetry about you for some time after you left,” he said.\n “Lucien is a toad. Or he will be if you tell him I am here,” Angelique promised.\n Severin cracked a half smile before hanging the pack over his shoulder and picking up his weapons. “Then I apologize for my abrupt exit. I cannot thank you enough for your help. Is there any way to repay you?”\n “Seeing you with Elle will be enough.”\n Severin bowed. “If you need anything seek out Burke. He is discreet and will grant you whatever you desire.”\n “Thank you, and take care, Your Highness. I look forward to your return.”\n “Thank you, for everything, My Lady,” Severin said before leaving his room. He stalked to Lucien’s study, moving with a feline grace he hadn’t lost with his transformation.\n The guards outside Lucien’s study eyed Severin but made no move to stop him when the obviously displeased prince threw the door open without knocking.\n Lucien looked up from the couch he was dramatically sprawled across. “Oh, Severin, it’s you. Perfect timing. Mumsy just sent me a note that father is intending to hold another ball this week. Since you did nothing but stand in a corner at the last four I thought you might want to escape it and run off to—.”\n “Lucien.”\n “What? Are you going somewhere?” the golden haired prince asked, finally noticing Severin’s pack and accessories.\n “Yes. I’m going after Elle.”\n “Ranger Seventy Eight?”\n “No. Elle.”\n “I fail to see the difference, they’re the same thing.”\n “No, they aren’t. Elle is a person, not a numbered, faceless servant. When she returns she will no longer be subject to your fits of fancy,” Severin said, resting the butt of the crossbow on the back of a chair.\n “I know that. You paid off her contract,” Lucien frowned.\n “Also we will not be going to war with Arcainia. It will ruin our foreign alliances, place undue stress on our citizens, and sacrifice soldiers who did not join our army for the purpose of getting you another toy. It’s a foolish idea. I won’t support it, and I will fight it with every piece of power and influence I possess,” Severin vowed, his eyes almost glowing with anger.\n Lucien briefly pursed his lips. “Okay,” he agreed. \n","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-67.html","bookId":1808,"book":{"id":1808,"title":"Beauty and the Beast (Timeless Fairy Tales #1)","description":"Storyline: \n Once upon a time Elle made a mistake. A small miscalculation sends her through the roof of an enchanted chateau. Stranded until her broken leg mends, Elle is unwillingly forced to rely on the good will of the sour chateau owner —the cursed Prince Severin. \n Prince Severin—the commanding general and staunch supporter of his brother the crown prince—is cursed to look like a beast until a maiden falls in love with him. He has given up all hope of shattering the curse, and has only disdain for Elle. \n Unfortunately, the pair can’t seem to avoid each other thanks to the meddling of the chateau’s cursed servants. Eventually Elle’s playful manners and Severin’s hidden gentleness draw the pair together. \n But not all love stories can end that easily. After all, Elle is not what she seems, and Severin’s life is placed in danger when hostilities flare between his brother and the monarchs of a neighboring country. When Elle risks everything to save Severin, will he be able to forgive her for her lies?\n \n","cover":"https://allnovel.net/images/beauty-and-the-beast-timeless-fairy-tales-1.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:52:56 PM"}}
