{"id":83879,"no":68,"title":"Page 68","content":"Severin blinked at the unexpected reply. “What.”\\n\\n “If you don’t want to go to war we won’t. I don’t know why you’re reacting so. All you had to do was say no,” Lucien said, pillowing his head on his arms.\\n\\n “I’ve spent the last year telling you why we shouldn’t go to war.”\\n\\n “Yes, but you never said no. I’ve told you before, Severin, you’re my brother. If you don’t want to do something, we won’t do it. You’ve got better judgment than I anyway. Except for your taste in women,” Lucien said, wrinkling his nose.\\n\\n “You know that I love Elle?”\\n\\n “Of course I did. I figured you were sunk after our last meeting in the lodge—before this commoner girl you would have more self awareness than to purchase a pony.”\\n\\n “Then why did you send her on this mission? Why did you let me rage against her?”\\n\\n “Because I wanted to give you the benefit of the doubt. I mean really, brother. A commoner?”\\n\\n “And I’m an illegitimate son. What of it?”\\n\\n “Oh come now, that’s hardly the same,” Lucien protested. “Ranger Seventy Eight—,”\\n\\n “Stop calling her that. Her name is Elle.”\\n\\n Lucien sat up and studied Severin. “You’re serious. You plan to marry her, don’t you?”\\n\\n Severin pinched the bridge of his nose. “If she’ll have me. I was the one that enslaved her, and then I insulted her and stormed at her. I’m not certain she’ll forgive me.”\\n\\n Lucien gave an aggravated exhale. “She will. She isn’t stupid, she’s an intelligencer. So I’ll have to get along without her, then? Fine. If you see something redeemable in her I’m sure I will. Eventually. I’ll make myself grow to love her too,” Lucien reasoned.\\n\\n Severin stared at his brother as he adjusted his grip on his crossbow.\\n\\n “I mean like! Just like, I promise!” Lucien said.\\n\\n A smile eased across Severin’s face, cutting the tension. “Thank you, Lucien. I am blessed to call you my brother.”\\n\\n Lucien made a shooing gesture. “I know it. Now get out of here, you have a woman to rescue.”\\n\\n Elle shifted in her makeshift shelter, shivering with cold and pain. Her leg ached and the dagger wound on her arm throbbed, but she had the papers. Elle obsessively felt through her clothes for the hidden pouch cinched around calf. It contained orders for the Verglas assassin’s guild. When Elle delivered these papers to the palace Severin would be safe. Hopefully.\\n\\n The guild had chased her across the country; she lost them just before Frigus Forest in the Obitus Straight. She doubted they would catch up—she had purposely made her presence known in a mountain range, prodding dozens of mountain hags to investigate.\\n\\n Thankfully she had managed to get away, but Elle knew there was still a good chance she would be killed before she reached Loire’s borders, horseless and injured as she was.\\n\\n Elle briefly shut her eyes, leaning her head against the tree truck she was wedged against. She was exhausted, and needed to rest for just a few minutes before pushing on. After she rested she would leave Frigus Forest.\\n\\n The howling wind sounded strangely like someone calling her name.\\n\\n “Just another sign of exhaustion,” Elle said, flexing her numb fingers.\\n\\n “Elle.”\\n\\n It was with a pain to her heart that Elle realized the voice sounded like Severin. “I miss him,” she said.\\n\\n “Elle.”\\n\\n “I wish he would forgive me,” Elle sighed, her head lolling on her neck. She was so cold it hurt.\\n\\n “Elle!”\\n\\n Elle opened her eyes and peered out of the bush-like shelter she had constructed. Someone was standing a few feet away, their back was to her but it sounded like… “Severin?”\\n\\n The figure turned around, revealing amber eyes and a chiseled face. “Elle,” he said, a smile cracking on his lips.\\n\\n He was at her side in an instant, pulling her out of her shelter and into a warm embrace. “You’re safe,” he said, his voice heavy with relief.\\n\\n Elle briefly leaned her head against his chest. Was this a dream? She felt warmer in his arms; he blocked the wind better than her terrible shelter had.\\n\\n Severin brushed frost from her hair, jolting Elle from her frozen stupor.\\n\\n He was real, even though he was so cursed good looking. He wasn’t a hallucination. “Are you mad? What are you doing here?” Elle said, pulling away from the prince.\\n\\n Severin held out a folded blanket. “I’m here for you.”\\n\\n Elle stared at the blanket before raising her eye to Severin’s face. “Did an assassin get to you and pound your head in?”\\n\\n Severin stepped closer, attempting to wrap the blanket around Elle. “No.”\\n\\n “Then what in the name of all things smart and intelligent prompted you to come to Verglas? In case you’ve forgotten the assassins guild here is trying to KILL YOU!” Elle shouted, dodging the blanket. \\n\\n","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-68.html","bookId":1808,"book":{"id":1808,"title":"Beauty and the Beast (Timeless Fairy Tales #1)","description":"Storyline: Once upon a time Elle made a mistake. A small miscalculation sends her through the roof of an enchanted chateau. Stranded until her broken leg mends, Elle is unwillingly forced to rely on the good will of the sour chateau owner —the cursed Prince Severin. \\n Prince Severin—the commanding general and staunch supporter of his brother the crown prince—is cursed to look like a beast until a maiden falls in love with him. He has given up all hope of shattering the curse, and has only disdain for Elle. \\n Unfortunately, the pair can’t seem to avoid each other thanks to the meddling of the chateau’s cursed servants. Eventually Elle’s playful manners and Severin’s hidden gentleness draw the pair together. \\n But not all love stories can end that easily. After all, Elle is not what she seems, and Severin’s life is placed in danger when hostilities flare between his brother and the monarchs of a neighboring country. When Elle risks everything to save Severin, will he be able to forgive her for her lies?\\n","cover":"https://allnovel.net/images/beauty-and-the-beast-timeless-fairy-tales-1.jpg","author":"K.M. Shea","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1.html","creation":"Oct 5, 2019 8:57:58 AM","modification":"Oct 5, 2019 4:52:56 PM"}}
