{"id":66727,"no":1,"title":"Page 1","content":"To Carolyn Conger\\n\\n \"What really interests me is whether God had any choice in the creation of the world.\"\\n\\n ALBERT EINSTEIN\\n\\n \"Deep in the chaotic regime, slight changes in structure almost always cause vast changes in behavior. Complex controllable behavior seems precluded.\"\\n\\n STUART KAUFFMAN\\n\\n \"Sequelae are inherently unpredictable.\"\\n\\n IAN MALCOLM\\n\\n Introduction:\\n\\n \"Extinction at the K-T Boundary\"\\n\\n The late twentieth century has witnessed a remarkable growth in scientific interest in the subject of extinction.\\n\\n It is hardly a new subject - Baron Georges Cuvier had first demonstrated that species became extinct back in 1786, not long after the American Revolution. Thus the fact of extinction had been accepted by scientists for nearly three-quarters of a century before Darwin put forth his theory of evolution. And after Darwin, the many controversies that swirled around his theory did not often concern issues of extinction.\\n\\n On the contrary, extinction was generally considered as unremarkable as a car running out of gas. Extinction was simply proof of failure to adapt. How species adapted was intensely studied and fiercely debated. But the fact that some species failed was hardly given a second thought. What was there to say about it? However, beginning in the 1970s, two developments began to focus attention on extinction in a new way.\\n\\n The first was the recognition that human beings were now very numerous, and were altering the planet at a very rapid rate-eliminating traditional habitats, clearing the rain forest, polluting air and water, perhaps even changing global climate. In the process, many animal species were becoming extinct. Some scientists cried out in alarm; others were quietly uneasy. How fragile was the earth\u0027s ecosystem? Was the human species engaged in behavior that would eventually lead to its own\\n\\n extinction?\\n\\n No one was sure. Since nobody had ever bothered to study extinction in an organized way, there was little information about rates of extinction in other geological eras. So scientists began to look closely at extinction in the past, hoping to answer anxieties about the present.\\n\\n The second development concerned new knowledge about the death of the dinosaurs. It had long been known that all dinosaur species had become extinct in a relatively short time at the end of the Cretaceous era, approximately sixty-five million years ago. Exactly how quickly those extinctions occurred was a subject of long-standing debate: some paleontologists believed they had been catastrophically swift, others felt the dinosaurs had died out more gradually, over a period of ten thousand to ten million years - hardly a rapid event.\\n\\n Then, in 1980, physicist Luis Alvarez and three coworkers discovered high concentrations of the element iridium in rocks from the end of the Cretaceous and the start of the Tertiary - the so-called K-T boundary. (The Cretaceous was shorthanded as \"K\" to avoid confusion with the Cambrian and other geological periods.) Iridium is rare on earth, but abundant in meteors. Alvarez\u0027s team argued that the presence of so much iridium in rocks at the K-T boundary suggested that a giant meteorite, many miles in diameter, had collided with the earth at that time. They theorized that the resulting dust and debris had darkened the skies, inhibited photosynthesis, killed plants and animals, and ended the reign of the dinosaurs.\\n\\n This dramatic theory captured the media and public imagination. It began a controversy which continued for many years. Where was the crater from this meteor? Various candidates were proposed. There were five major periods of extinction in the past-had meteors caused them all? Was there a twenty-six-million-year cycle of catastrophe? Was the planet even now awaiting another devastating impact?\\n\\n After more than a decade, these questions remained unanswered. The debate raged on - until August 1993, when, at a weekly seminar of the Santa Fe Institute, an iconoclastic mathematician named Ian Malcolm announced that none of these questions mattered, and that the debate over a meteoric impact was \"a frivolous and irrelevant speculation.\"\\n\\n \"Consider the numbers,\" Malcolm said, leaning on the podium, staring forward at his audience. \"On our planet there are currently fifty million species of plants and animals. We think that is a remarkable diversity, yet it is nothing compared to what has existed before. We estimate that there have been fifty billion species on this planet since life began. That means that for every thousand species that ever existed on the planet, only one remains today. Thus 99.9 percent of all species that ever lived are extinct. And mass killings account for only five percent of that total. The overwhelming majority of species died one at a time.\"\\n\\n The truth, Malcolm said, was that life on earth was marked by a continuous, steady rate of extinction. By and large, the average lifespan of a species was four million years. For mammals, it was a million years. Then the species vanished. So the real pattern was one of species rising, flourishing, and dying out in a few million years. On average, one species a day had become extinct throughout the history of life on the earth.\\n\\n \"But why?\" he asked. \"What leads to the rise and decline of earth\u0027s species in a four-million-year life cycle?\\n\\n \"One answer is that we do not recognize how continuously active our planet is. just in the last fifty thousand years - a geological blink of an eye - the rain forests have severely contracted, then expanded again. Rain forests aren\u0027t an ageless feature of the planet; they\u0027re actually rather new. As recently as ten thousand years ago, when there were human hunters on the American continent, an ice pack extended as far down as New York City. Many animals became extinct during that time.\\n\\n \"So most of earth\u0027s history shows animals living and dying against a very active background. That probably explains 90 percent of extinctions. If the seas dry up, or become more salty, then of course ocean plankton will all die. But complex animals like dinosaurs are another matter, because complex animals have insulated themselves - literally and figuratively - against such changes. Why do complex animals die out? Why don\u0027t they adjust? Physically, they seem to have the capacity to survive. There appears to be no reason why they should die. And yet they do.\\n\\n \"What I wish to propose is that complex animals become extinct not because of a change in their physical adaptation to their environment, but because of their behavior. I would suggest that the latest thinking ill chaos theory, or nonlinear dynamics, provides tantalizing hints to how this happens.\\n\\n It suggests to us that behavior of complex animals can change very rapidly, and not always for the better. It suggests that behavior can cease to be responsive to the environment, and lead to decline and death. It suggests that animals may stop adapting. Is this what happened to the dinosaurs? Is this the true cause of their disappearance? We may never know. But it is no accident that human beings are so interested in dinosaur extinction. The decline of the dinosaurs allowed mammals - including us - to flourish. And that leads us to wonder whether the disappearance of the dinosaurs is going to be repeated, sooner or later, by us as well. Whether at the deepest level the fault lies not in blind fate-in some fiery meteor from the skies - but in our own behavior. At the moment, we have no answer.\"\\n\\n And then he smiled.\\n\\n \"But I have a few suggestions,\" he said. \\n\\n","sourceLink":"https://allnovel.net/the-lost-world-jurassic-park-2/page-1.html","bookId":1710,"book":{"id":1710,"title":"The Lost World (Jurassic Park #2)","description":"Storyline: The Lost World (Jurassic Park #2) \\n The Lost World: Jurassic Park Junior Novelisation captures all the thrills and chills of The Lost World story - with heart-stopping suspense, hair-raising action, and illustrated with colour photographs from the film. Something has survived...In 1993, an ambitious entrepreneur named John Hammond spoke four words which ushered in a new era of motion picture excitement and set worldwide boxoffice records...\"Welcome to Jurassic Park\". Now, a few years later, Hammond makes a startling confession to scientist Ian Malcolm: another island of dinosaurs exists...an island where dinosaurs have been living and breeding in the wild...the Lost World.\\n","cover":"https://allnovel.net/images/the-lost-world-jurassic-park-2.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-lost-world-jurassic-park-2.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:01:56 AM"}}
