{"id":66743,"no":17,"title":"Page 17","content":"\"So you looked under the desk.\"\\n\\n \"Yes,\" she said.\\n\\n \"That\u0027s very good,\" Harding said. \"I think these people owe you their lives.\"\\n\\n \"Not really,\" Kelly said, with a little shrug.\\n\\n Sarah shot her a look. \"All your life, other people will try to take your accomplishments away from you. Don\u0027t you take it away from yourself.\"\\n\\n The road was muddy alongside the river, and heavily overgrown with plants. They heard the distant cries of the dinosaurs, somewhere behind them. Harding maneuvered around a fallen tree, and then they saw the boathouse ahead.\\n\\n \"Uh-oh,\" Levine said. \"I have a bad feeling.\"\\n\\n From the outside, the building was in ruins, and heavily overgrown with vines. The roof had caved in in several places. No one spoke as Harding pulled the Explorer up in front of a pair of broad double doors scaled with a rusted padlock. They climbed out of the car and walked forward in inkle-deep mud.\\n\\n \"You really think there\u0027s a boat in there?\" Arby said doubtfully.\\n\\n Malcolm leaned on Harding, while Thorne threw his weight against the door. Rotten timbers creaked, then splintered. The padlock fell to the ground. Harding said, \"Here, hold him,\" and Put Malcolm\u0027s arm over Thorne\u0027s shoulder. Then she kicked a hole in the door wide enough to crawl through. Immediately she went inside, into darkness. Kelly hurried in after her.\\n\\n \"What do you see?\" Levine said, pulling planks away to widen the hole. A furry spider scurried up the boards, jumping away.\\n\\n \"There\u0027s a boat here, all right,\" Harding said. \"And it looks okay.\"\\n\\n Levine pushed his head through the hole.\\n\\n \"I\u0027ll be damned,\" he said. \"We just might get out of here, after all.\"\\n\\n Exit\\n\\n Lewis Dodgson fell.\\n\\n Tumbling through the air he dropped from the month of the tyrannosaur, and landed hard on an earthen slope. The breath was knocked out of him, his head slammed down, and he was dizzy for a moment. He opened his eyes, and saw a sloping bank of dried mud. He smelled a sour odor of decay. And then he heard a sound that chilled him: it was a high-pitched squeaking.\\n\\n He got up on one elbow, and saw he was in the tyrannosaur nest. The sloping mound of dried mud was all around him. Now there were three infants here, including one with a piece of aluminum wrapped around its leg. The infants were squeaking with excitement as they toddled to-ward him.\\n\\n Dodgson scrambled to his feet, unsure of what to do. The other adult tyrannosaur was on the far side of the nest, purring and snorting. The one that had brought him was standing over him.\\n\\n Dodgson watched the babies moving toward him, with their downy necks and their sharp little jaws. And then he turned to run. In an instant, the big adult brought his head down, knocking Dodgson over. Then the tyrannosaur raised its head again, and waited. Watching.\\n\\n What the hell is going on? Dodgson thought. Cautiously, he got to his feet again. And again, he was knocked down. The infants squeaked and came closer. He saw that their bodies were covered in bits of flesh and excrement. He could smell them. He got up on all fours, and began crawling away.\\n\\n Something grabbed his leg, holding him. He looked back and saw that his leg was in the jaws of the tyrannosaur. The big animal held it gently for a moment. Then it bit down decisively. The bones snapped and crunched.\\n\\n Dodgson screamed in pain. He could no longer move. He could no longer do anything but scream. The babies toddled forward eagerly. For a few seconds they kept their distance, heads darting forward to take quick bites. But then, when Dodgson did not move away, one hopped up on his leg, and began to bite at the bleeding flesh. The second jumped on his crotch, and pecked with razor-sharp jaws at his waist.\\n\\n The third came right alongside his face, and with a single snap bit into his cheek. Dodgson howled. He saw the baby eating the flesh of his own face. His blood was dripping down its jaws. The baby threw its head back and swallowed the cheek, and then turned, opened its jaws again, and closed over Dodgson\u0027s neck.\\n\\n SEVENTH CONFIGURATION\\n\\n \"Partial restabilization may occur after eliminating destructive elements. Survival partly determined by chance events.\"\\n\\n IAN MALCOLM\\n\\n Departure\\n\\n The boat left the jungle river behind, and moved into darkness. The walls of the cave echoed the throb of the engines as Thorne steered the boat through the swift tidal current. To their left, a waterfall splashed down, a ray of light on cascading water. And then they burst out, moving beyond the high cliff wall and the crashing surf, into the open ocean. Kelly gave a cheer, and threw her arms around Arby, who winced and smiled.\\n\\n Levine looked back at the Island. \"I have to admit, I never thought we\u0027\u0027d make it. But with our cameras in place, and the uplink working, I we expect we can continue to gather the data, until we finally get our answer about extinction.\"\\n\\n Sarah Harding stared at him. \"Maybe we will, and maybe we won\u0027t.\"\\n\\n \"Why not? It\u0027s a perfect Lost World.\"\\n\\n She stared at him in disbelief. \"It\u0027s nothing of the sort,\" she said. \"Too many predators, remember?\"\\n\\n \"Well, so it may appear, but we don\u0027t know - \"\\n\\n \"Richard,\" she said. \"Ian and I checked the records. They made a mistake on that island, many years ago. Back when the lab was still in production.\"\\n\\n \"What mistake?\"\\n\\n \"They were manufacturing infant dinosaurs, and they didn\u0027t know what to feed them. For a while they gave them goat\u0027s milk, which was fine. It\u0027s very hypoallergenic. But as the carnivores grew, they fed them a special animal-protein extract. And the extract was made from ground-up sheep.\"\\n\\n Levine said, \"So? What\u0027s wrong with that?\"\\n\\n \"In a zoo, they never use sheep extract,\" she said. \"Because of the danger of infection.\"\\n\\n \"Infection,\" Levine repeated, in a low voice. \"What kind of infection?\"\\n\\n \"Prions,\" Malcolm said, from the other side of the boat.\\n\\n Levine looked blank.\\n\\n \"Prions,\" Harding said are the simplest disease-causing entities known, even simpler than viruses. They\u0027re just protein fragments. They\u0027re so simple, they can\u0027t even invade a body - they have to be passively ingested. But once eaten, they cause disease: scrapie, in sheep; mad-cow disease; and kuru, a brain disease in human beings. And the dinosaurs developed a prion-disease called DX, from a bad batch of sheep protein extract. The lab battled it for years, trying to get rid of it,\"\\n\\n \"You\u0027re saying they didn\u0027t?\"\\n\\n \"For a while, it seemed as if they did. The dinosaurs were flourishing. But then something happened. The disease began to spread. The prions are excreted in feces, so it is possible - \"\\n\\n \"Excreted in feces?\" Levine said. \"The compys were eating feces...\"\\n\\n \"Yes, the compys are all infected. The compys are scavengers; they spread the protein over carcasses, and other scavengers became infected. Eventually, all the raptors were infected. Raptors attack healthy animals, not always successfully. One bite, and the animal becomes infected. And so, bit by bit, the infection spread through the island again. That\u0027s why the animals die early. And the rapid die-off supports a much larger predator population than you would expect - \"\\n\\n Levine was visibly anxious. \"You know,\" he said, \"one of the compys bit me.\"\\n\\n \"I wouldn\u0027t worry,\" Harding said. \"There may be a mild encephalitis, but it\u0027s usually just a headache. We\u0027ll get you to a doctor in San Jose.\"\\n\\n Levine began to sweat. He wiped his forehead with his hand. \"Actually, I don\u0027t feel very good at all.\"\\n\\n \"It takes a week, Richard,\" she said. \"I\u0027m sure you\u0027ll be fine.\"\\n\\n Levine sank back in his seat unhappily.\\n\\n \"But the point,\" she said, \"is that I doubt this island will be able to tell you very much about extinction.\"\\n\\n Malcolm stared back at the dark cliffs for a moment, and then began to speak. \"Maybe that\u0027s the way it should be,\" he said. \"Because extinction has always been a great mystery. It\u0027s happened five major times on this planet, and not always because of an asteroid. Everyone\u0027s interested in the Cretaceous die-out that killed the dinosaurs, but there were die-outs at the end of the Jurassic and the Triassic as well. They were severe, but they were nothing compared to the Permian extinction, which killed eighty percent of all life on the planet, on the seas and on the land. No one knows why that catastrophe happened. But I wonder if we are the cause of the next one.\"\\n\\n \"How is that?\" Kelly said.\\n\\n \"Human beings are so destructive,\" Malcolm said. \"I sometimes think we\u0027re a kind of plague, that will scrub the earth clean. We destroy things so well that I sometimes think, maybe that\u0027s our function. Maybe every few eons, some animal comes along that kills off the rest of the world, clears the decks, and lets evolution proceed to its next phase.\"\\n\\n Kelly shook her head. She turned away from Malcolm and moved lip the boat, to sit alongside Thorne.\\n\\n \"Are you listening to all that?\" Thorne said. \"I wouldn\u0027t take any of it too seriously. It\u0027s jist theories. Human beings can\u0027t help making them, but the fact is that theories are just fantasies. And they change. When America was a new country, people believed in something called phlogiston. You know what that is? No? Well, it doesn\u0027t matter, because it wasn\u0027t real anyway. They also believed that four humors controlled behavior. And they believed that the earth was only a few thousand years old. Now we believe the earth is four billion years old, and we believe in photons and electrons, and we think human behavior is controlled by things like ego and self-esteem. We think those beliefs are more scientific and better.\"\\n\\n \"Aren\u0027t they?\\n\\n Thorne shrugged. \"They\u0027re still just fantasies. They\u0027re not real. Have you ever seen a self-esteem? Can you bring me one on a plate? How about a photon? Can you bring me one of those?\"\\n\\n Kelly shook her head. \"No, but...\"\\n\\n \"And you never will, because those things don\u0027t exist. No matter how seriously people take them,\" Thorne said. \"A hundred years from now, people will look back at us and laugh. They\u0027ll say, \u0027You know what people used to believe? They believed in photons and electrons. Can you imagine anything so silly?\u0027 They\u0027ll have a good laugh, because by then there will be newer and better fantasies.\" Thorne shook his head. \"And meanwhile, you feel the way the boat moves? That\u0027s the sea. That\u0027s real. You smell the salt in the air? You feel the sunlight on your skin? That\u0027s all real. You see all of us together? That\u0027s real. Life is wonderful. It\u0027s a gift to be alive, to see the sun and breathe the air. And there isn\u0027t really anything else. Now look at that compass, and tell me where south is. I want to go to Puerto Cortes. It\u0027s time for us all to go home.\"\\n\\n Acknowledgments\\n\\n This novel is entirely fiction, but in writing it, I have drawn on the work of researchers in many different fields. I am especially indebted to the Work, and the speculations, of John Alexander, Mark Boguski, Edwin Colbert, John Conway, Philip Currie, Peter Dodson, Niles Eldredge, Stephen Jay Gould, Donald Griffin, John Holland, John Horner, Fred Hoyle, Stuart Kauffman, Christopher Langton, Ernst Mayr, Mary Midgley, John Ostrom, Norman Packard, David Raup, Jeffrey Schank, Manfred Schroeder, George Gaylord Simpson, Bruce Weber, John Wheeler, and David Weishampel.\\n\\n It remains only to say that the views expressed in this novel are mine, not theirs, and to remind the reader that a century and a half after Darwin, nearly all positions on evolution remain strongly contended, and fiercely debated. \\n\\n","sourceLink":"https://allnovel.net/the-lost-world-jurassic-park-2/page-17.html","bookId":1710,"book":{"id":1710,"title":"The Lost World (Jurassic Park #2)","description":"Storyline: The Lost World (Jurassic Park #2) \\n The Lost World: Jurassic Park Junior Novelisation captures all the thrills and chills of The Lost World story - with heart-stopping suspense, hair-raising action, and illustrated with colour photographs from the film. Something has survived...In 1993, an ambitious entrepreneur named John Hammond spoke four words which ushered in a new era of motion picture excitement and set worldwide boxoffice records...\"Welcome to Jurassic Park\". Now, a few years later, Hammond makes a startling confession to scientist Ian Malcolm: another island of dinosaurs exists...an island where dinosaurs have been living and breeding in the wild...the Lost World.\\n","cover":"https://allnovel.net/images/the-lost-world-jurassic-park-2.jpg","author":"Michael Crichton","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-lost-world-jurassic-park-2.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:01:56 AM"}}
