{"id":25414,"no":15,"title":"CHAPTER XIV OPEN RANGE DAYS","content":"In the days of open range, everybody had great freedom. A cowboy could change countries every spring if he wanted to and they were always drifting from one range to another—not only to different ranges but to different states. For instance, maybe he would be in New Mexico one year and on the Canadian border the next. Every cowboy had a private horse of his own, pack horse and his own bed, which consisted of a tarpaulin and some blankets. And according to the custom of them days he could stop at any cow camp or ranch and was not under obligations to anyone, and if he wanted to stay a week and rest his horses that was O.K. too. If there was no one home, he always found grub and helped himself, so he was quite independent—and it did not take much money to travel. Nature provided him with new scenery every day, such as unclaimed land, rivers and creeks, and in my day plenty of wild game of all kinds. I don’t believe the tourist of today with his automobile has anything compared to what we had. I am going to make a statement here that almost sounds fishy, but I can prove it. I worked for a cow outfit that run twenty-five thousand cattle and three or four hundred saddle horses to handle the cattle with, and they didn’t own one foot of deeded land. The land was unsurveyed and belonged to the government. They usually built a big log house, some corrals and a kind of stable, and called it their ranch, and no one disputed their title—even a sheepman must not get too close with his woolies. They paid no taxes on this land and as it would be impossible for the assessor to count the cattle in an area of two or three hundred miles, I would say a good honest cattle man might give in one-third of his number. An outfit the size I speak of, would hire about twenty-five cowboys during the summer months and keep four or five during the winter. That was the only expense they had, outside of buying saddle horses to mount their cowboys—which was ten or twelve to the man. I have been asked quite often what a “Rep” was by people that was hatched at a later day. Well, for illustration, Tom Jones has a ranch at San Francisco—Bill Smith has a ranch at Los Angeles. Both run several thousand cattle. There are no fences between those two places, so, naturally, in the course of a year quite a number of both men’s cattle would drift out of their range where they worked their main range and it wouldn’t pay to send a whole outfit so far for what cattle had drifted—so they picked out a very reliable cowboy that knew their brands. He cut out his string of horses, packed his bed and started for one of those ranges to represent the outfit he was working for. There might be six or seven reps with each different outfit. Now, when one of those outfits started to work their range, they started what they called a “Day Herd”—that was for the purpose of holding all cattle that the reps, or the home outfit wanted to hold—sometimes beef cattle, sometimes some outfit changing hands—those cattle were held by home range men and driven from one roundup to another and each day, and each roundup; anybody that found any cattle they wanted to hold or take home, they were cut out and put in that day herd. This herd sometimes got pretty big before the roundup was over and was bunched up at night and held on what they called the bed-ground. Those cattle were night herded by all cowboys that worked during the day, by shifts of two or three hours each, the hours depending on the length of the nights—spring or fall—sometimes two men on shift, or more, depending on the size of the herd or how hard they were to hold. The rep never done any day-herding as he was supposed to see all cattle rounded up so as to pick out the cattle he represented, as other cowboys didn’t know his irons as well as he did. There was also a little cowboy etiquette extended to the rep—he didn’t have to stand night guard unless it was absolutely necessary. When this roundup was over and the range all worked, lasting from a month to six weeks, the big herd was worked and every cowboy that had any cattle in the herd cut them out in a bunch by themselves, or some other fellow that had cattle going home the same direction as he was, then they throwed in together. If a cowboy didn’t have help enough to move his cattle to their home range, the outfit he gathered them with sent some men to help him. This custom was practiced in all the outfits. Another fine practice in the early days by honest cowmen was if a cow was found in a roundup with a calf belonging to her and nobody claimed her, the captain of that roundup branded the calf with the same iron that was on the mother and turned her loose where she was. This was done with what was known as a running iron, which was a small bar and a small half circle—one can make any brand on an animal with those two irons. Now if that was a steer calf and nobody claimed him until it was grown and fit for beef, that same captain or any captain of any roundup had a right to load and ship that steer to any market with his cattle, say Chicago, Omaha or Kansas City, which were the principal shipping points in those days. There the stock inspector got a record of what state the steer came from and when he was sold. It was his duty to see that the money was sent to the stock association of that state, they having a record of the brand and the address of the owner. A check was immediately forwarded to the party. For instance, Charlie Russell and myself got a check for a steer I had not seen for six years and had been loaded on the train four hundred miles from where I turned him loose. He was shipped to Chicago, sold and the money sent to Helena, Montana, where we had our brand recorded.","sourceLink":"http://novel.tingroom.com/jingdian/1922/55255.html","bookId":885,"book":{"id":885,"title":"Memories of Old Montana","description":"简介： Some years ago, through my interest in the life and work of Charles M. Russell, I met Con Price. No one could go far into the subject of Montanas Cowboy Artist without cutting Con Prices trail....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1922","creation":"Aug 1, 2019 12:23:47 AM","modification":"Aug 1, 2019 12:23:47 AM"}}
