{"id":87691,"no":27,"title":"Page 27","content":"\\n\\n “I didn’t even know you were going to be here.”\\n\\n “You knew I’d be here sooner than later. Take it off. Now.” When she didn’t move, he stepped forward and her heart leaped, though she tried to maintain an indifferent outward appearance. “Marguerite.” His every syllable was carefully pronounced, underscoring the threat. “You won’t do this anymore because I’m telling you that you won’t. You belong to someone now. Me. And I take care of you, even if your greatest danger comes from yourself. Take the goddamned scarf off.” She raised her chin defiantly, but her cold fingers rose, unknotted it, let it fall away.\\n\\n Let him see the red mark of the belt, the light bruising.\\n\\n His eyes coursed over it. His gaze rose, pinning her with a look she’d never seen before. A look that gave her chest wall jagged edges which stabbed her heart with every painful beat.\\n\\n “I told you who I am, what I am,” she managed. “You can leave. No one’s holding you here.”\\n\\n Though I’m afraid I won’t survive if you turn your back on me now. Which makes no sense.\\n\\n I don’t need anyone.\\n\\n Clenching her fists, she stared at him with as much disdain as she could manage, trying to reclaim her aloofness, her protective isolation in a room where she was almost overcome by his heat, his presence.\\n\\n “Go away, Tyler. Just go the hell away.”\\n\\n “Did you get the fucking orgasm you sought from it?” He loosened his belt, stripped it off him with one quick, deliberate movement. “Take hold of the bedpost.”\\n\\n “Wh-what?”\\n\\n “I’m going to spank you with my belt and then I’m going to fuck you hard and strong with your ass still smarting to remind you not to defy me. Not about this. Not if you know what’s good for you.”\\n\\n She stood staring at him, their expressions clashing for a solid minute. Her gaze shifted to the door.\\n\\n “Don’t try it,” he warned, low. When he closed the last gap between them, it took all she had not to step back for she was afraid of the swirl of emotions roused in her by the implacable resolve in his eyes. He took her arm and turned her, wrapping her fingers around the post. Reaching under her skirt, he caught the elastic of her panties and pulled them down to her feet. He left them at her ankles, the lace draping the straps of her heeled sandals. His hand went to the small of her back, pushing her lower, and the other moved under her waist to cant her ass upward. Folding the skirt into the small of her back, he pulled her back a couple awkward steps with her ankles manacled in her underwear.\\n\\n “Stand just like that,” he said, his voice thick with arousal and other things she didn’t want to face. “Ten licks. They’re going to hurt.” She heard the snap of his belt as he doubled it, tightened her fingers on the post.\\n\\n His hand moved down her waist over the curve of one flank, caressing the whiteness of her skin, making her even more aware of what he was about to do to that delicate flesh.\\n\\n “You will never, never choke yourself again, Marguerite. Not ever. Do you understand?” His tone sharpened. “Answer me.”\\n\\n “I understand.” Her voice shook. Though she tried to infuse it with anger, it was lost in the nerves.\\n\\n “Tell me you’ll obey. You’re right. You didn’t promise before. But you will now.\\n\\n Tell me you won’t do it ever again. Once you say it, I know I can trust your word.” And trust him to take care of her demons. She shut her eyes, thinned her lips, fighting a compulsion she didn’t understand. Tears wanted to swell into her eyes, but not because he was hurting her physically. In a way she couldn’t explain, barely understood, she wanted to say yes to him. To say that she would obey, that she was sorry, as if the apology was to herself as much as to him. But punishment…she wanted, needed the punishment first.\\n\\n The belt slapped her buttocks with exceptional accuracy and strength, though she’d had no doubt it would. She found for all that Tyler supposedly didn’t flog his submissives much, he knew exactly how to do so. What he was doing wouldn’t break the skin, but he intended to leave welts, a way for her to remember the lesson for several days afterward. Maybe a week, she thought, as the next stripe came. Her breath expelled sharply on the third as real pain sang through her nerve endings. But another reaction was occurring at the same time. Her cunt was dripping her response onto her legs. Between the third and fourth stroke he reached down and fondled her, running his fingers through the slickness. She moaned, raising herself higher for him. At the fifth and sixth, she cried out.\\n\\n “Tell me you’re not going to do this again. Now. Or I swear to God I’ll give you ten more.”\\n\\n “I’ll… I won’t do it again.”\\n\\n “Promise me.”\\n\\n She bit down on her own arm to keep from screaming as seventh, eighth and ninth cut into her tender flesh.\\n\\n “I promise.”\\n\\n The tenth blow landed. Even as she was gasping for breath from the throbbing pain, he had her arm and pulled her up to hold her against him. The skin of his arms pressed hot and demanding against her back. When he dropped his grip down, caressed her hips with rough, demanding hands, she thought the ache was going to explode in her chest like a wound as he deliberately squeezed her raw buttocks hard. She struggled against him and he turned, pushed her down on her stomach on the bed, holding her there a moment to keep her still, his hand running over her sore ass, quivering under his touch. “Christ, I’m so furious with you.”\\n\\n When she closed her eyes, the tears burned. He was right. Since she was seven years old, no one had punished her because they loved her. Because they cared if she lived or died. Because they wanted her to stay safe. Or were scared of losing her. She should hate him, be angry at him for humiliating her, but she didn’t feel humiliated.\\n\\n She yearned for something, another way to punish her, a way to take her, invade every part of her, make his claim one that could not be denied.\\n\\n “You haven’t…” Her voice was thready, such that the words almost weren’t coherent to her own ears. “Taken me there yet. Put your cock there.” His fingers stilled on the crease of her buttocks, his other hand resting on her back, over her scars. His reaction made her wonder if Komal had told him that one shameful thing.\\n\\n “No.” The roughness of his voice hadn’t abated, but the tone gave her the answer to the question. Her heart was shattering and only he could pick up the pieces. “I won’t punish you that way. No.”\\n\\n She pushed against her hands and rolled to her back to stare up at him. He was standing over her looking angry and anguished all at once. And so terribly dangerous and sexy.\\n\\n “I need you to. I want to feel you’ve been everywhere in me, that your come has scalded his away. It’s an illusion, but if you do it once, I can make it real.” She caught the waistband of his jeans, pulled herself up so her chin was resting on his hard flat stomach, her fingers digging into his thighs. “Don’t ask. Don’t ever ask me for anything again. Take me. Your slave is begging you. Punish me when I need it, never make me doubt whose Will I have to obey. Whose love will protect me from the darkest shadows, especially the ones I carry inside myself.”\\n\\n As if the hands of conscious time had stopped, Tyler stared back down into those wide, frightened eyes and knew that this was that moment Komal had warned him about. The moment of triumph and greatest vulnerability. She’d cracked open, everything ugly as well as beautiful there for him to see. She was offering it all to him and there was no going back.\\n\\n He didn’t want to go back. He wanted her. Every tragic, beautiful, amazing, dysfunctional, exceptional, infuriating inch of her.\\n\\n “Open my jeans,” he ordered, closing his hands into fists to keep him from cradling her face in his palms, kissing away each tear. She needed to know he did care enough to be angry. He needed to impress upon her in an irrevocable fashion that she answered to someone in her life. He told himself she needed that more than he needed to relieve the aching pain in his heart that felt as if it were infecting his soul.\\n\\n Her fingers moved over him, took the zipper down. Stepping back from her, he shoved them down his thighs. “Take off the rest of your clothes,” he said gruffly. “Turn around on the bed and get on all fours, on your knees and elbows. I want your ass in the air so I can more easily fuck it, see how I’ve strapped it.” She obeyed, tossing her white hair forward in a way that had his mouth watering, the well-toned, lithe body stretching out in the position he proscribed like a fabled white she-tiger, her back arched, head down on her elbows. She was shaking. So was he. He’d believed she was his submissive, his slave, from the beginning, this great Mistress and strong woman who had been through so much, but until the moment of this reality there’d always been the possibility he’d been wrong. This was the turning point, even more than the night at his Gulf home had been.\\n\\n “Lubricant.”\\n\\n “In the armoire in the corner. Where I keep all my Zone things. It’s unlocked.” He discarded the rest of his clothes and strode across the room. Marguerite watched him, a pure, virile male animal completely in control of the situation and of her. A deep quaking was going on in the pit of her belly. She needed him to ease it. To assuage the hunger and the pain. She needed to bite and claw and fight him and have him win.\\n\\n Needed to know he would claim her, make her submit to him, not because it was a game or Zone requirement, but because they were mated together. Belonged to each other as he said.\\n\\n So when he came back she tried to roll to her back. He caught her elbows, flipped her, held her down with a hand on her neck and a growl, bringing her back onto her knees with her hips in the air. She was so slick that he rubbed his fingers in her cunt and used that to initially oil her rim.\\n\\n He also used the lubricant, slid his slicked-down fingers into her ass with deliberate efficiency. No hesitation, firm, not brutal but not gentle, underscoring his right to use her body, take and give pleasure to it as he chose. She moaned softly, rocking against his touch. At his growl to be still, she hissed a challenge, struggled for her way, but at his hard slap on her abused buttocks, she went still again. \\n\\n","sourceLink":"https://allnovel.net/mirror-of-my-soul-nature-of-desire-4/page-27.html","bookId":1909,"book":{"id":1909,"title":"Mirror of My Soul (Nature of Desire #4)","description":"Storyline: Mirror of My Soul (Nature of Desire #4) \\n Some stories can\u0027t be contained between the covers of just one book. In Ice Queen, Tyler helped Mistress Marguerite fulfill the mentoring requirement The Zone club imposes on all its Dominant members, to learn about BDSM from the submissive\u0027s perspective. Though Marguerite is one of The Zone\u0027s most sought-after Mistresses, Tyler is convinced she is a \"switch\", a closet submissive. But the truth that is revealed is more remarkable than that. \\n As he begins to unravel the complex and terrible layers of her past, Tyler must do what he\u0027s never been willing to do before. \\n Open up his own soul, offering Marguerite his own dark places in order to help them both heal. Only then will they be able to surrender to a force stronger even than The Zone\u0027s most powerful Master and Mistress—a force that can bind them together forever.\\n","cover":"https://allnovel.net/images/mirror-of-my-soul-nature-of-desire-4.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mirror-of-my-soul-nature-of-desire-4.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:22:13 PM"}}
