{"id":87696,"no":32,"title":"Page 32","content":"\n “Then I see this boy walking through a pile of bodies that hasn’t yet been scooped up. Looking for something he could barter. He’d been in blood so long he didn’t notice it dried on his feet. Over his toes, his ankles…” He reached down, passed his hand over her foot, as if reassuring himself it was clean and pale, cool to his touch. “This kid was wearing a Led Zeppelin T-shirt. We surround ourselves with all these things that are civilized to make us feel safe. A rock band T-shirt, linoleum for our kitchens…and yet we’re not civilized. Just like you said that very first night at Tea Leaves. We never have been.\n “I had to chase him off from stealing a watch. I don’t know why it mattered. But I looked at his feet and remembered walking on the banks of the river in Georgia, near where I was born.” The shadows moved behind his eyes and he turned his gaze back to the pond. “Now I have these dreams of it, walking in Georgia, but the mud becomes blood and the bodies come out of the river toward me like some horrific zombie film, only so real.”\n A quiver ran through the muscles under her fingers. “Sometimes Nina is dancing among them, on top of the bodies, standing on their backs, walking on her toes. Tears of blood are running down her face. She tries to kiss me and I smell all those corpses on her breath. When I have that dream, it makes me never want to sleep again.”\n “What happened, Tyler?” She trailed her fingers on his nape, soothing, stroking, keeping her other hand linked with his. “Why did you leave the CIA? You said you couldn’t refuse me anything. I need to know.”\n Tyler knew he was going to have to answer her, to say the words. The pregnant silence, the strength of what lay between them now demanded it. He could not turn away from it unless he wished to turn away from her. But it might turn her from him.\n He rose, squeezed her hand and took two steps away. She didn’t stop him this time.\n “There are things you do to keep your country safe that no one wants to talk about.\n That we all know happen, deep in the shadows of our soul. Those of us that do it know that people are not all basically good, as many sheltered souls like to believe. That there are places where there are not shades of gray, where it comes down to good and evil, places that are so far from our idealism that those who spout about political correctness and peace can’t even comprehend the high price of having the freedom to speak their opinions. And those of us who are immersed in violence for that high price, who try to do the right thing in such an immoral world, know that they’re right about one thing.\n Violence eats your soul. Eventually you become what you fight in order to destroy it, in order that there may be people and places untouched by either your filth or your enemy’s. All those movies about the soldiers being taken to another planet, where their barbaric natures, which protected the people, can’t be turned against them…”\n “Tyler.” There was love in her soft voice, so much he just wanted to fall on his knees and let it cover him like a blanket tucked around a child’s shoulders by his mother’s hands. A shudder ran through him.\n “Information.” He spat out the word harshly. “When you know lives are on the line, information is extracted, no matter the cost. You learn to detach, to watch every subtle nuance of your enemy’s psyche, to know just how much they can take. And I was very good at it. I’ve been a sexual Dominant since I was twenty-one years old and the same talents that can be applied to pleasure can be applied to torture.” When he turned to face her, Marguerite saw his expression was hard, almost monstrous, the darkness there for her to see.\n “Torture is about psychological regression. You break the subject down until they lose their grasp on all their learned personality traits. They can’t handle complex tasks, deal with complicated or stressful situations. It’s all about stripping away the shields.\n Sensory deprivation, unbalancing them with the unexpected, over and over, removing their anchor on reality by confusing them, making them think it’s night when it should be day, day when it should be night. Sound familiar?”\n “Tyler.” She said it again, pain in her voice. Pain for him. He turned away from it, stared at the ducks.\n “During the Gulf War, we knew a bomb had been planted and we needed to know where. We caught the lover of the bomber. She was on the inside and knew what we needed to know. And we had to know fast. We didn’t have time for those types of methods.” He crumpled her head covering in his fist and Marguerite saw the muscles bunch in his shoulders as if he were preparing for a physical fight. “Ten years of intense, pretty much back-to-back operations, yet somehow I’d never had to use severe interrogation techniques on a woman. I removed nine of her nails, broke seven of her fingers before she told us. Fingers are one of the worst pains there are because the nerves are so dense there, even though people are more psychologically cowed by threats to genitalia, nipples. She was small-boned, like my wife. Delicate hands, like yours.\n “It’s funny.” He drew a breath. “That’s not the worst thing I’ve done. I’ve taken a lot of lives, buried them where their families will never know what happened to them.\n For causes I believed in. Even her… We got the information, we saved lives. But when I touched my wife… Even later, when I’d touch Leila’s hands or her face, or you… When I see Violet’s delicate fingers reach out toward Mac, see how large his hand is over hers… Sometimes I can’t help but remember that woman. I couldn’t do it anymore.\n Everyone has their threshold. I did the job that day, but that was the end. I was sick, inside and out. All I knew was I had to come home.” To the arms of a woman who didn’t have the strength to heal you. Marguerite felt the tears rise in her throat.\n He sat down on a stump, still facing away from her. “In this civilized world…” The word came out like a curse through his teeth. “I don’t abuse women. I’d never strike one in violence, would lay my life on the line for any of them in danger. But somewhere, if she’s still alive, there’s a woman who dreams of me only when she’s in the grip of a nightmare.”\n The breeze moved over the pond, creating ripples, making the cattails dance, the lilies drift slowly back and forth. A duck entered the waters, paddling, her tail waddling, dipping her beak.\n At length, Marguerite stood up, moved to stand before him. For once it was he who was reluctant to meet her eyes. She watched the lashes raise, the golden brown gaze climb to her face. When he got there, she thought there was nothing that could tear at a woman’s heart like fear in a strong man’s eyes. Not fear of violence or danger. Fear of loss. Fear of rejection, fear of not being loved when he didn’t meet expectations.\n Reaching out her hand, she grazed her fingertips over his face and then moved in, nudging until he parted his knees. The position compelled him to wrap his arms around her waist and hips, hold her in close to him. His jaw pressed into her soft breasts, the tips of her braided hair whispering along his neck as she bent her head over his.\n “You don’t have to be the one who always takes care of someone else, you know. In a real relationship, so I’ve heard, people take care of each other.” He drew back and touched her face. “Is that what we have, you and me? A relationship?”\n “That’s a frightening term for me. But I think…we have something.” He nodded, laid his forehead on her shoulder. “I don’t deserve you. I’m not sure I deserve anyone.”\n “Maybe I’m your penance.” She lifted his chin, gave him an arch look. “And that’s why I put you through hell every several days or so. I’m a punishment sent to you by God.”\n He chuckled at last. The sound of it released the worry around her heart, made her arms close around his shoulders and hold him tightly to her. After a moment he returned the embrace, burrowing his nose in the tender pocket of her collarbone, breathing her in.\n “You’re my salvation, angel.” His grip tightened. “I loved her. But she never got into my soul as deeply as you did the first time I touched you.” It took a moment for her to register the significance of that statement. When she did, she couldn’t speak. “I felt lonely without you this morning,” he continued. “That’s the main reason I followed you out here.”\n “I didn’t want to go, thinking you might have to leave and I wouldn’t see you until Friday night.” She shook her head. “What are we going to do about that? The whole desolate-without-each-other thing.”\n “That’s easy. Marry me.”\n Her eyes widened in shock. She didn’t ask if he was serious, since she could well see by his expression that he was.\n “A reasonable engagement, followed by a marriage ceremony, as quiet or elaborate as you like, anything you want. You want big and opulent, we’ll do it, or something small and lovely, maybe at my house.”\n “Tyler.” She simply couldn’t think of anything to say or do to such a proposition. “I barely know you… Okay, yes we know each other.” She rolled her eyes at his raised brow. “But I don’t even know… Do you shave up or down, are you a morning or night person? Do you spend your spare time watching reality TV?”\n “Would that be a deal breaker?”\n “Absolutely.” She threw up her hands, tried to struggle away, but he held her securely. “You’re moving too fast.”\n “That’s why I said engaged.”\n “What if I want to get married in an airplane? Jumping out of an airplane?” He lifted a shoulder and rose. “I said I’d do anything for you, angel.” Closing his hand over hers, he captured her in his gaze. “It’s soon, if we’re thinking of time, but I love you, Marguerite. That’s not going to stop today, tomorrow, or in a thousand years from now. And I think you need to know that.”\n “I need to think about this.”\n “Think as long as you need. I shave upward, I’m a night person and no, I don’t watch garbage that insults the hard work and struggles of talented scriptwriters. You think of any other questions, you let me know. Now, let me tell you about this deli nearby that I think we should check out for lunch…” She resisted the urge to scream as he closed his arms around her in a hug, lifting her off her feet. With his face pressed hard against her hair, he held on to her in a way she knew made it impossible for her to refuse him anything. \n","sourceLink":"https://allnovel.net/mirror-of-my-soul-nature-of-desire-4/page-32.html","bookId":1909,"book":{"id":1909,"title":"Mirror of My Soul (Nature of Desire #4)","description":"Storyline: \n Mirror of My Soul (Nature of Desire #4) \n Some stories can\u0027t be contained between the covers of just one book. In Ice Queen, Tyler helped Mistress Marguerite fulfill the mentoring requirement The Zone club imposes on all its Dominant members, to learn about BDSM from the submissive\u0027s perspective. Though Marguerite is one of The Zone\u0027s most sought-after Mistresses, Tyler is convinced she is a \"switch\", a closet submissive. But the truth that is revealed is more remarkable than that. \n As he begins to unravel the complex and terrible layers of her past, Tyler must do what he\u0027s never been willing to do before. \n Open up his own soul, offering Marguerite his own dark places in order to help them both heal. Only then will they be able to surrender to a force stronger even than The Zone\u0027s most powerful Master and Mistress—a force that can bind them together forever.\n \n","cover":"https://allnovel.net/images/mirror-of-my-soul-nature-of-desire-4.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mirror-of-my-soul-nature-of-desire-4.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:22:13 PM"}}
