{"id":87670,"no":6,"title":"Page 6","content":"\\n\\n She could feel them rising out of her, lurking around in the shadows, but she couldn’t hide them. He’d made her helpless, so she could do nothing but see if they would devour her, tear him limb from limb. Or maybe he would be a white knight, would vanquish them. It was the thought of a child, a little girl, though nothing else running through her mind or body reminded her of a child. Her woman’s body desired release, had to have it. He’d made sure it was at his leisure, his Will. As she would do had she been controlling a sub, prolonging his pleasure, knowing he’d be rewarded by the results of denial. But as a Mistress she’d never felt what she sensed drove Tyler in this moment. A desire to bring her to orgasm because he was the only man that could, because it was proof of their connection. Of his claim that her flesh begged for his touch alone, her mind and heart in accord.\\n\\n When he drew his tie from around his neck and let it caress her cheek, she couldn’t stop the moan of need. Yes. Yes.\\n\\n “That’s what you like, isn’t it, baby?” His voice was a breath against her ear, the new endearment like a different touch, unexpected and welcomed by a sharp jerk of reaction in her body.\\n\\n He threaded the silk of the tie beneath her throat, out the other side, crossed it in back, twisted it in his fingers so she felt the tension, the pressure on the windpipe. He kept it halfway up her neck, away from the dangers of the lower areas, telling her not only that he’d done it before but that like everything else involving the pleasuring of a woman’s body, Tyler was consummately skilled.\\n\\n When she did it to herself it was a hard, dirty release, something that opened the door within her dungeon where all of her physical reaction to Mastering a sub was imprisoned. In the quiet of her bedroom she could strain against the pull, seeking the explosive wave that would draw it all out in a rush of release so intense sometimes she wasn’t sure if it was the constriction of her air flow or the power of it that had her limp and dizzy, too weak to move for the remainder of the dead, lonely hours of the night, the belt and scarf loosened but still lying against her skin as her only company.\\n\\n This was entirely different. The moment his fingers twisted the tie, caressing the back of her neck and taking command and control of her reaction, something just shattered in her. She couldn’t get her hands near herself and all he was providing was the stimulation to her anus and this. Nevertheless, the beast rose in her, violent, dangerous, all-encompassing. She thrashed on the bed like an animal in a trap, seeking to pull against his touch, inviting blackness in before the choice was taken from her.\\n\\n He shifted, pressing his knee in the area between her shoulder blades, holding her to the bed so she was unable to rise up and put additional pressure on his hold. She sobbed against the gag, his probing fingers deep in her, releasing shudders, more and more shudders, until she was simply shaking everywhere inside and out, moaning senselessly. Her body was attuned to every touch of his upon her but her mind and her soul were focused on one thing. His hand holding the tie, controlling her. Her mind was filled with a screaming desire to simply be his. Always his.\\n\\n If her mouth had been free, she would have begged him to take her, to fuck her hard, to the point of pain and beyond to drive everything else away. He knew. He understood her in a way no one else did. She didn’t know how, only that it made her feel ways she didn’t comprehend. She didn’t know if that would be her destruction or salvation.\\n\\n His hand withdrew, found his way between her tied legs, his forearm hard against the curve of her ass. Cupping her mound, his unused fingers now took possession of her clit, his other hand taking another twist in the tie to lift her slightly, a leash drawing taut.\\n\\n Everything exploded. The orgasm tore through her body, bringing her off the bed, arching into his touch. He moved with her, keeping the tension on the choker as she screamed, so overwhelmed it was too much. She tried to move away but couldn’t. He was ruthless, stroking, working, dipping into her. Her wetness flooded his hand, as intense as the reaction of a man. It went on and on, as if the mere handful of days since she’d seen him at her place and the session at the Club tonight had all been foreplay, building and building. He was inside her now in every way but one and that was a formality. A formality she needed like a faith.\\n\\n She was convulsing, jerking against his hand with aftershocks when he withdrew his touch. He untied her legs and arms and removed the scarf. She curled her arms underneath her, like a bird folding in its wings. When his hand loosened the tie, began to tug it free, she twitched, made an involuntary noise of protest before she could stop herself. His fingers stilled, paused over it, then left it. He tied it so it was snug but with a knot that would prevent any dangerous slippage around her neck, then he had his arms around her, turning her.\\n\\n She was still hungry, still aching. As he turned her to her back, she gazed up at him in the dim light of her bedroom. His shirt was open partway down his chest, still tucked into the dark slacks. The serious, unsmiling mouth and dangerous eyes that were weighted with desire. She couldn’t think beyond the elemental reaction, couldn’t edit the thoughts that came to her lips.\\n\\n “Your cock, in my mouth… Please.”\\n\\n A whispered plea, a desire to sate something hard and burning in her as well as him, something beyond the need of the roaring orgasm he had just given her.\\n\\n When he put a knee on the bed, she could see the turgid shape of his arousal, proof of his need. For her. But he eased an arm under her, turned her again. Stunned her by stretching out on the bed next to her, curving his body around the back of hers, bringing his heat and hardness against her hips, thighs, her feet tucked between his calves, the linen of the slacks against her soft skin. He pulled her even closer with a hand around her waist, her wetness rubbing against his crotch as he cupped her breast in his hand, his thumb following the line of the tie at her throat. He settled his head just above hers, his breath ragged on her neck.\\n\\n “Just sleep, angel. I’m here.”\\n\\n And she did, in a remarkably short time. Tyler stroked her hair, her slender form.\\n\\n Tracing every rib, the point of her hip and the length of thigh, he called himself a fool for not straddling her neck and shoulders and driving himself between her lips. It was the right of every Master to be served in such a fashion by a willing and eager sub. And she’d been willing, the desire in her eyes unmistakable. But intuition had held him back. That and the way her body had come to orgasm, again that brutal tearing response, as if a monster had to be slain to earn the right to just a small treasured release. And in her case, she’d learned that choking the monster was what worked but he knew it was more than a manipulation stemming from physical response.\\n\\n She made a sub’s every dark fantasy come true, then she came back to this room.\\n\\n Carrying all the arousal she’d stored from the experience, she brought it to fruition by restraining herself the way she restrained subs. The rope was to wrap around her wrists, the belt and scarf for the throat restriction. His gaze rested on the bedpost in the dark. Though he kept stroking her hair, his gaze burned on the place. He wouldn’t tolerate it. Couldn’t even think past the haze of fury and fear he’d felt when he’d realized it. She was a grown woman. There was nothing he could do to stop her from pursuing a practice that could kill her in a handful of heartbeats if done incorrectly.\\n\\n Except tonight he’d shown her how much more intense it was to be collared by a Master. Experimenting, he plucked at the tie, tugged it against her throat. She murmured in her sleep, moving against his hips in a way that made him stifle a guttural growl.\\n\\n She sought the restraints for satisfaction but more than that she sought the feel of a collar. The ratcheting up of her desire at his touch on the tie at her throat, the protest she made at it being removed… If it was possible, those two things alone had nearly made him explode.\\n\\n The idea made him even harder but it was balanced by the fear that if he could not find his way permanently into her heart, he might lose her to life altogether. Every step of her life, every desire appeared to be tormented by demons of her past, demons that took that desire and twisted it into an addictive and hazardous death wish.\\n\\n It was time to stop relying on pride. In the morning, he would call in some favors.\\n\\n He wanted to know everything there was to know about Marguerite Perruquet.\\n\\n He pulled the tie away. As she moved restlessly he replaced it with his hand, bringing his warmth and strength over the fragile bones and windpipe, the pulse. She settled in with a soft noise, her hand coming up to lie over his, falling into a deeper sleep with a quiet sigh.\\n\\n “I’m here, angel,” he murmured.\\n\\n And I’m not going to let hell take you, so whoever the fuck is trying to drag you down into it, you deal with me. Because she’s not alone anymore.\\n\\n He curved more tightly around her, giving her his warmth and all of his protection.\\n\\n Staying awake to watch over her, he waited for the dawn to drive the night from the sky and her nightmares from the corners. And ignored his own that watched from the same hopeful vantage point.\\n\\n Chapter Three\\n\\n Marguerite surfaced slowly, disturbed by a hesitant sound. Feet on the staircase.\\n\\n “Marguerite? Hon?”\\n\\n She rolled over, her muscles aching from an orgasm that had been an exercise in prolonged isometrics. As she turned, she had a moment of panic when Chloe warily pushed the door open a bit.\\n\\n She realized quickly she was alone in the bed, no evidence of Tyler in sight and her still naked body was modestly covered with a sheet.\\n\\n “I’m so sorry to come up in your personal area. I was just worried because you’re usually up to let us in when we get here at seven and it’s seven-thirty.” Marguerite blinked, shifted and sat up, pressing a hand through her disheveled hair. His scent was still here. She smelled it on her skin, felt surrounded by it. She needed a shower. Needed it now, to clear her brain. To stop her from wondering why there was no note, no…\\n\\n “How did you get in?”\\n\\n “Tyler let us in. Talked me into making him coffee, the savage.” Chloe shook her head. “Startled the heck out of me when he opened the door. And not just because he looked like he’d been a bar fight. Said you’d had a rough night.” Her attention moved to the floor. “He wouldn’t say he was the cause of it but I’m guessing a big, fat yes.” Marguerite looked over the edge of the bed to find the remains of her dress on the floor. He’d taken the time to leave her bed, cover her, retain her modesty and dignity but he’d left—what were Chloe’s words—a big, fat statement of his presence in her bed lying on the floor. \\n\\n","sourceLink":"https://allnovel.net/mirror-of-my-soul-nature-of-desire-4/page-6.html","bookId":1909,"book":{"id":1909,"title":"Mirror of My Soul (Nature of Desire #4)","description":"Storyline: Mirror of My Soul (Nature of Desire #4) \\n Some stories can\u0027t be contained between the covers of just one book. In Ice Queen, Tyler helped Mistress Marguerite fulfill the mentoring requirement The Zone club imposes on all its Dominant members, to learn about BDSM from the submissive\u0027s perspective. Though Marguerite is one of The Zone\u0027s most sought-after Mistresses, Tyler is convinced she is a \"switch\", a closet submissive. But the truth that is revealed is more remarkable than that. \\n As he begins to unravel the complex and terrible layers of her past, Tyler must do what he\u0027s never been willing to do before. \\n Open up his own soul, offering Marguerite his own dark places in order to help them both heal. Only then will they be able to surrender to a force stronger even than The Zone\u0027s most powerful Master and Mistress—a force that can bind them together forever.\\n","cover":"https://allnovel.net/images/mirror-of-my-soul-nature-of-desire-4.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/mirror-of-my-soul-nature-of-desire-4.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:22:13 PM"}}
