{"id":31873,"no":28,"title":"CHAPTER XXVIII.","content":"Barker stared at her aghast. \\n\\n \\n\\n “Take them off!” said Esmeralda, almost fiercely. “Are you deaf?” \\n\\n \\n\\n “N-o, my lady,” stammered Barker; and she obeyed. “What will your ladyship wear, then?” she asked. \\n\\n \\n\\n Esmeralda went to the wardrobe and pointed to a plain muslin frock. \\n\\n \\n\\n “That,” she said, curtly. \\n\\n \\n\\n Barker could have cried aloud with astonishment and disappointment, but she got out the dress and put it on. \\n\\n \\n\\n “What—what jewels will you wear with this, my lady?” asked Barker. \\n\\n \\n\\n “None,” said Esmeralda. \\n\\n \\n\\n “None!” echoed Barker. “Not the pearl suite, my lady?” \\n\\n \\n\\n “Not the pearl suite, nor the diamond suite, nor the emerald suite, nor any of them,” replied Esmeralda, firmly. “Stay; give me my Australian heart.” She caught sight of[223] the locket Norman had given her, and pointed to it. “That, too,” she said. \\n\\n \\n\\n Barker could have groaned aloud. \\n\\n \\n\\n “How will you wear them both, my lady?” she asked. \\n\\n \\n\\n “Put them where you like,” said Esmeralda. \\n\\n \\n\\n Barker twisted the chain of the locket into a bracelet and despairfully slipped it over Esmeralda’s wrist. As she did so, there came a knock at the door. Barker opened it. It was Lady Ada; she was in her dressing-robe. \\n\\n \\n\\n “Oh, Barker,” she said, “can you find me a small piece of ribbon to match this? I meant to buy a piece at Belmont to-day, but quite forgot it. Oh, Esmeralda, I didn’t see you! Don’t let me worry you, but I thought perhaps Barker might have something of the kind.” \\n\\n \\n\\n “Come in,” said Esmeralda. “I dare say Barker will be able to find you what you want. She generally has a milliner’s shop somewhere about.” \\n\\n \\n\\n “Oh, thank you so much!” murmured Lady Ada. “But aren’t you going to dress?” \\n\\n \\n\\n “I am dressed,” said Esmeralda. \\n\\n \\n\\n Lady Ada looked at her in astonishment. \\n\\n \\n\\n “Do you mean to say you are going to wear—” \\n\\n \\n\\n Esmeralda smiled coldly. \\n\\n \\n\\n “What you see,” she said. “Barker, get Lady Ada what she wants. I am going down now.” \\n\\n \\n\\n But she paused outside and went into her boudoir by the outer door. Barker began hunting for the piece of ribbon Lady Ada required. \\n\\n \\n\\n “I know I have a scrap or two like it somewhere, my lady,” she said; “and I’ve seen it lately, but I can’t think where. The marchioness used to wear a dress something of that color, and there were ribbons on it; but it was a long while ago, before she was married. It must be in one of the boxes that came from Grosvenor Square.” \\n\\n \\n\\n She went to a box and began turning out the things hurriedly. \\n\\n \\n\\n “Oh, never mind,” said Lady Ada; but she knelt down beside the litter and hunted with her. As she did so, she saw a sheet of note-paper; it was evidently an old letter, and was creased as if it had been carried about. She picked it up and glanced at it mechanically; then her face flushed, and she looked sharply at Barker, but Barker’s back was turned to her. She slid the letter into her pocket. \\n\\n \\n\\n “Never mind, Barker,” she said; “I can’t wait any[224] longer. I’ll wear another dress. Shall I help you put the things back?” \\n\\n \\n\\n “Oh, no, my lady,” said Barker; “don’t trouble. They are only old things, some of those that the marchioness had when she first came to England. I can tumble them in anyhow now and set them straight afterward.” \\n\\n \\n\\n Lady Ada went to her room, and sent her maid away on some errand, locked the door, and took the letter from her pocket. \\n\\n \\n\\n She was not mistaken; it was in Norman’s handwriting. There were only a few lines, but as she read them her heart beat so fast as almost to prevent her breathing. \\n\\n \\n\\n “I can not stay here now that there is no hope for me. It was too much to hope that you would love me; but I must go on loving you till I die. \\n\\n \\n\\n Norman.” \\n\\n \\n\\n The lines danced before her eyes. She looked at them as if she could not believe the reality of their existence—as a man might look who had unexpectedly come upon a rare gem; or as a woman might look who had suddenly found ready to her hand a weapon with which she could strike a hated foe to the very heart. \\n\\n \\n\\n As she carefully placed the soiled and creased letter in her bosom—it seemed to strike warm, as if it had life—she saw opening before her a triumph which dazzled her and almost made her afraid. With this letter she could thrust the girl she hated not only from her lofty position but from Trafford’s side. It only needed skill and a heart hard enough to laugh at scruples; and her heart was adamant, and her love for Trafford rendered her incapable of a conscience. \\n\\n \\n\\n The guests were arriving when Esmeralda went down to the great drawing-room. They were all eagerly awaiting her appearance. They expected to see her beauty enhanced by splendid apparel and the glitter of the Belfayre diamonds, and her appearance in the white muslin frock with the simple golden heart at her bosom was positively startling. She looked like a girl who had just run out of the school-room, and they held their breath as she crossed the room to greet them. She was no paler than usual, but there was a strange, fixed look in her eyes which some of them noticed, and afterward remembered. The women regarded the simple dress as a piece of “theater.” Trafford alone, as he stood beside her, with compressed lips and drawn brows, partly understood. She wished to remind him of her contempt for her money in the most effectual way. \\n\\n \\n\\n [225] \\n\\n \\n\\n But even as the thought stabbed him, he thrilled at her beauty; for the white muslin dress but heightened the effect of the wonderful hair and the glorious eyes with that strange expression in them. \\n\\n \\n\\n She was quite self-possessed, and talked with one and another, and smiled and laughed in her usual frank way; and when the duke peered at her curiously, she, unseen by any other but himself, dropped him a swift, bewitching little courtesy. \\n\\n \\n\\n “This is what I wear to-night, duke,” she said in a low voice. \\n\\n \\n\\n “Yes, yes; charming, my dear!” he said, innocently. He thought the plain muslin was some kind of rare silk, and that she had left her diamonds upstairs in their case because she did not wish to outshine some of the elder women. It was like her good taste, he thought, and he nodded at her with loving approval. The dinner was a stately one. It would have been a solemn one also but for Esmeralda. She had never been in better spirits, apparently, and she talked and laughed as she used to do before her marriage. \\n\\n \\n\\n The duke looked on delightedly, and many of the staidest caught fire at the flame of her bright, flashing spirit; the dinner was, unlike such functions, both brilliant and enjoyable. But it was with Norman that she exchanged her airiest badinage, that swift, delightful repartee which came of the old Three Star stock with London wit grafted on it. \\n\\n \\n\\n Trafford, sitting near her, listened and watched. She dazzled him, bewildered him, and bewitched him. He knew that the men were looking at him with friendly envy, and he said to himself: “She is my wife, and I love her!” He felt an almost irresistible impulse to rise from his place, take her in his arms, and carry her to some place where he could say to her, “You are my wife; you belong to me; you shall not separate yourself from me any longer. Let the past go to the devil; I care not what may have happened, I care not whether you believe me or not, I tell you that I love you, and that you are mine, mine!” Then he looked across the table at Norman, his face flushed and smiling, and he thought of the hideous hint that Ada had thrown out. \\n\\n \\n\\n Trafford was an extremely temperate man. He had gone through his wild time, and, like most men who go through it and come out the other side, was absolutely abstemious; but to-night he astonished the butler by signing to him to fill his glass again and again. He did not think the wine was having any effect upon him, was not conscious that his usually pale face was growing flushed, that he was talking rapidly, that[226] his laughter rang now and again, with an unnatural ring, above that of the others. \\n\\n \\n\\n When the ladies left the room he passed the wine diligently. Some of the men remarking it, looked at each other covertly. They had never seen Trafford in this mood before, or, at any rate, for some years. When they entered the drawing-room he looked round for Esmeralda. The magnificent room, with its gilding and innumerable candles, seemed to whirl before him, and the women, in their brilliant dresses, to swim together like the figures in a kaleidoscope. His heart clamored through the stress of his excitement for Esmeralda; he wanted to speak to her, to touch her hand; but she was surrounded immediately, and he could not get near her without pushing aside some of those who encircled her. He felt that he could even do that. \\n\\n \\n\\n Some one was at the piano; they were playing the waltz which had been playing the night he had stood beside Esmeralda when she dropped her bracelet over the balcony. God! what a fool he had been not to know that he loved her even then! \\n\\n \\n\\n Lord Chesterleigh came up and spoke to him, and he scarcely knew what Chesterleigh was saying or what he himself responded. Esmeralda seemed to evade him like a will-o’-the-wisp; from whatever part of the room she was standing or sitting there came bursts and ripples of laughter; those who were not immediately round her or talking to her were talking of her. Old Lady Desford sung her praises in the duke’s ready ear. \\n\\n \\n\\n “She really is the most brilliant creature I have ever met!” she said. “One quite forgets, while listening to her, that she is only a girl. No wonder you are so proud of her, and Trafford is so devoted. It really makes one wish that our own girls could go out for a time to the wilds of Australia on the chance of their acquiring something of the dear marchioness’s spirit.” \\n\\n \\n\\n “Ah, yes,” he said in his courtly way; “I am told that black swans are not rara avis there, but I can only say that I have seen but one specimen—my daughter.” He said “my daughter” with a pride beyond description. Presently he rose to retire, and when Esmeralda, who had been watching him, came up to wish him good-night, as she always did, no matter how large or stately the company, he bent and kissed her. \\n\\n \\n\\n For a moment a little tremor ran through her, and her hands clung to his arm and a mist rose before her eyes; but[227] she set her teeth hard and turned swiftly to answer some one who had spoken to her. Trafford took his father to the door, as usual, and the duke murmured a few words of congratulation. \\n\\n \\n\\n “She is surpassing herself to-night, Trafford,” he said. “Don’t let her tire herself too much. She is very precious to me—as to you.” \\n\\n \\n\\n Trafford could not speak. He turned back into the room and looked round for her. He could not see her. \\n\\n \\n\\n When the duke had gone, Esmeralda had suddenly begun to feel weary; the excitement was bringing about the reaction. Almost abruptly she left a group and passed into the fernery and stood, drooping like one of the exotics, her arms hanging at her side, the golden heart rising and falling on her bosom slowly and heavily. If she could have done so she would have gone straight to her room. She sunk on to a seat and let her head fall upon her arm outstretched upon the back of the bench. \\n\\n \\n\\n Norman’s voice roused her. \\n\\n \\n\\n “Oh, I beg your pardon!” he said. “I mean I have startled you, haven’t I?” \\n\\n \\n\\n “No,” she said, looking up. Then she smiled faintly as she saw him look round. “You did not expect to see me—you thought it was some one else? Shall I guess?” \\n\\n \\n\\n He colored guiltily. \\n\\n \\n\\n “I—I thought I saw her pass this way,” he said. \\n\\n \\n\\n “If so, she will come back presently,” said Esmeralda. “And if she does, are you going to take the advice I gave you this morning and tell her that, though you are only a pauper, as you call it, and you’ve no money, you’ve grit enough to ask her to be your wife?” \\n\\n \\n\\n He looked at her, the color coming and going in his face. \\n\\n \\n\\n “No, not to-night, Esmeralda,” he said. “I’ll go to Selvaine first; I’ll do the straight thing.” \\n\\n \\n\\n “And if he says no?” \\n\\n \\n\\n “Oh, then,” said Norman, ruefully, “I don’t know. I don’t suppose Lilias would marry me without his and the duke’s consent, and they’ll never give that.” \\n\\n \\n\\n Esmeralda looked at him with a tenderness that had something pathetic in it. \\n\\n \\n\\n “What a lucky thing it is for you, Norman, that I didn’t accept you that night by the river! No, I’m not laughing at you. I like you all the better for—for having cared for me once. One doesn’t get too many people to love one. And if you marry Lilias, I shall get a brother as well as a sister; so I[228] feel I’m taking a hand this deal, as Varley would say.” She sighed as she spoke Varley’s name, and looked beyond Norman’s handsome head. “Yes, I’m going to take a hand in the game, and I think I hold the cards that will win it for you.” \\n\\n \\n\\n “What do you mean?” he asked in a low voice. \\n\\n \\n\\n She laid her hand on his shoulder. \\n\\n \\n\\n “You go to Selvaine to-morrow,” she said, “and ask for Lilias, like a man, and tell him I sent you.” \\n\\n \\n\\n Norman started and turned crimson. \\n\\n \\n\\n “Esmeralda!” he exclaimed, scarce above his breath. “Do you mean that you offer me—” \\n\\n \\n\\n “Money?” she said. “No, no; I know I mustn’t do that. You’d be too proud to take it, and from me. No, I daren’t offer you money. But I don’t think they’ll refuse my wish.” Her eyes flashed. “How could they? They have got all they want. For very shame they dare not refuse me this one little thing. It’s all I shall have of good out of the bargain; it’s all I shall ask. But”—the old Esmeralda of Three Star stood before him, flashed from her eyes, spoke in her voice—“but this I will have!” \\n\\n \\n\\n Norman went pale in his excitement. \\n\\n \\n\\n “What can I say to you, Esmeralda?” he said, huskily. \\n\\n \\n\\n “Say nothing,” she said. “I owe you something for caring for me once, Norman—” \\n\\n \\n\\n “I care a great deal for you now!” he broke in, in a passion of gratitude. \\n\\n \\n\\n “In another way. Yes, I know—in another way,” she said. \\n\\n \\n\\n “By Heaven! there is no one like you,” he said—“no one in the whole world so good, so generous!” \\n\\n \\n\\n “Not even Lilias?” she said, with a little smile. “But I’m content to come second to her. Yes”—he had bent his head so that his lips were near her face—“you may kiss me, if you like. I will pass it on to Lilias when we say good-night.” \\n\\n \\n\\n He kissed her on the forehead with a brother’s love, a strong man’s reverence. She sighed. A faint sound came from a bank of ferns behind them. She turned her head listlessly. \\n\\n \\n\\n “Some one is coming,” she said. “Stay here, and I will go and find Lilias and manage to get her to come to you.” \\n\\n \\n\\n She passed into the drawing-room as she spoke. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2146/60722.html","bookId":479,"book":{"id":479,"title":"Just A Girl","description":"简介： The saloon, a long and narrow room, built of rough, feather-edged boards and decorated with scraps of turkey-red cotton and cheap calico lining, with occasional portraits of local celebrities rudely drawn in charcoal, was well filled with the crew of...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2146","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
