{"id":31854,"no":9,"title":"CHAPTER IX.","content":"Esmeralda at lunch recounted her adventure to Lady Wyndover, telling it in the most casual way, and she was much surprised and puzzled when her ladyship almost dropped her knife and fork, and sunk back in her chair with an exclamation of annoyance. \\n\\n \\n\\n “My dear girl, what made you do such an—an extraordinary and absurd thing? That comes of letting you go out alone! Oh, dear! oh, dear!” \\n\\n \\n\\n “What is the matter?” inquired Esmeralda, innocently; “nobody was hurt.” \\n\\n \\n\\n “No, no, but that was not what I was thinking about. Of course I am very glad and thankful you were not hurt; I’m sure you might have been killed! But it’s—it’s the oddness of the thing! The idea of your interfering, and running such a risk! Why didn’t you leave it to—to the policeman, or wait until the groom came up?” \\n\\n \\n\\n “There was no policeman there, and the groom was a long way behind,” said Esmeralda. She looked thoughtful.[69] “You said ‘interfering,’ didn’t you? Yes, I suppose that was what the lady thought; though if I hadn’t interfered she’d have got a nasty fall. She looked at me as if I were—well—a servant.” She laughed. “She’s prouder even than Barker.” \\n\\n \\n\\n “I wonder who they were?” said Lady Wyndover, plaintively. “What were they like?” \\n\\n \\n\\n “The girl was very fair—like a china ornament—with blue eyes, and a smile that freezes you—” \\n\\n \\n\\n “My dear Esmeralda!” \\n\\n \\n\\n “She thanked me as if she would rather have come off across the rail than I should have touched her horse.” \\n\\n \\n\\n “Who could it be? Fair? And the gentleman?” \\n\\n \\n\\n Esmeralda looked before her, musingly. \\n\\n \\n\\n “He was tall and dark, with a slight mustache, and very dark eyes—a very handsome man. He was civil enough, and thanked me all he knew. I think he was a bit ashamed of her.” \\n\\n \\n\\n “I don’t recognize them from your description, and I hope they are no one we know; and I do trust that if they are, they won’t know you again.” \\n\\n \\n\\n Esmeralda laughed and stared. \\n\\n \\n\\n “Well, I don’t know that I did anything to be ashamed of,” she said. “At home we should be quite obliged to any one for saving us from a spill. I suppose it’s different here. Well, I’ll learn in time to stand by and see people break their necks, without moving an eyelid.” \\n\\n \\n\\n “At home! At home! My dear child, don’t speak of that dreadful place as if it were your home! This is your home, and— But there—never mind. I wonder who they were?” \\n\\n \\n\\n “I don’t know—and I don’t care!” said Esmeralda, with fine indifference. “May I have some more pudding?” \\n\\n \\n\\n The butler, who looked as if he were deaf through all this, served her; but she was fated not to eat it, for Barker came in with “The boxes have come from Cerise’s, my lady,” and Lady Wyndover, with a little cry of satisfaction, immediately rose. \\n\\n \\n\\n “Unpack them at once, Barker!” she said. “Come upstairs, Esmeralda; come this moment.” \\n\\n \\n\\n Esmeralda glanced regretfully at the pudding, but obeyed, and followed her ladyship upstairs. Three large boxes were in the dressing-room, and Barker and her ladyship’s own maid were hastily unpacking them. In a few minutes the whole place was littered with costumes, and Lady Wyndover was flitting from one to the other in a state of excitement. \\n\\n \\n\\n [70] \\n\\n \\n\\n “I don’t know which to try on first,” she said. “Try this evening one. Isn’t it lovely? It is sure to fit! Cerise never makes a mistake—never!” \\n\\n \\n\\n Esmeralda surrendered herself to the two maids, who with experienced deftness put the frock on her, then stood back to view the effect, and exchanged meaning glances. Lady Wyndover stood almost breathless for a moment, then she gave a long sigh of satisfaction, and sunk into a chair. \\n\\n \\n\\n “Will it do?” asked Esmeralda, calmly looking down at the dress. \\n\\n \\n\\n “Look in the glass,” said Lady Wyndover. “Stand there—so; now you can see yourself. Well?” \\n\\n \\n\\n Esmeralda gazed at her reflection in the pier-glass with a feeling of wonder and pleasure. Lady Wyndover had pitched upon the prettiest dress—a soft silk of indescribable hue, but one which set off Esmeralda’s coloring to perfection. She scarcely knew herself, but stood looking in the glass as if she doubted the truth of the reflection. Then, suddenly, the color rose to her face, and deepening, dyed her neck; and she felt herself blushing all over. \\n\\n \\n\\n “Isn’t—isn’t it— Is this all there is of it?” she asked in a low voice. \\n\\n \\n\\n “All there is of it? Why, what more do you want, child?” demanded Lady Wyndover. \\n\\n \\n\\n The maids smiled and looked down. \\n\\n \\n\\n “I thought there might be something to cover my neck and shoulders and arms,” said Esmeralda. “There’s only this strap, and the thing feels as if it were slipping off,” and she blushed again. \\n\\n \\n\\n “Oh, no, it is quite right,” said Lady Wyndover, easily. “How beautiful you—it is!” she added, almost to herself. “And it will look better still at night.” \\n\\n \\n\\n “You are sure it won’t come off?” inquired Esmeralda, not yet quite easy in her mind. \\n\\n \\n\\n “Of course it will not, my dear; it is simply perfect. Take it off, and put on the others—I am dying to see them! Oh, what a treasure Cerise is!” \\n\\n \\n\\n Esmeralda stood like a lay figure while the rest of the dresses were tried on, and Lady Wyndover, with a deep sigh, declared herself satisfied. \\n\\n \\n\\n “I’m glad you like them,” said Esmeralda; “but I shall never be able to wear them all!” \\n\\n \\n\\n Lady Wyndover laughed. \\n\\n \\n\\n “My dear girl,” she said, “you will be worrying Cerise’s life out of her for more before many weeks have passed.[71] Why, those two ball-dresses you will not be able to wear more than twice.” \\n\\n \\n\\n “Ball-dresses?” said Esmeralda; “but I can’t dance!” \\n\\n \\n\\n “Really? But I suppose not. Well, you must have some lessons at once. Thank goodness, you will soon learn—one can see that.” She looked at the graceful figure thoughtfully. “Not that it really matters whether you dance or not. In fact, there is something original in your being unable to do so; it is all in character. And now let us go into my room and talk over the campaign. Let me see,” she said, sinking back on her favorite couch, and regarding Esmeralda between half-closed lids, “there is a ‘small and early’ at Lady Blankyre’s to-morrow night. That will be just the thing, I think—not too large, and yet all the best—the very best—people. And Lady Blankyre is a very dear friend of mine, and will understand. If it should prove a success—but of course it will”—she nodded encouragingly—“we can launch out. So much depends upon the start! If we get a really good start, the newspaper men will take up the running for us, and the rest is easy.” \\n\\n \\n\\n “The newspaper men?” said Esmeralda. “I don’t understand. What have they got to do with you or me?” \\n\\n \\n\\n Lady Wyndover laughed. \\n\\n \\n\\n “Reach me that ‘Society Chatter’—yes, the paper on the chair.” \\n\\n \\n\\n She opened it, and handed it back, pointing to a paragraph, and Esmeralda read: \\n\\n \\n\\n “Miss Chetwynde, the granddaughter and heiress of the famous millionaire, Mr. Gordon Chetwynde, whose discovery in the wilds of Australia by Mr. Pinchook, the well-known solicitor, was attended by so much romance, is staying with her guardian, Lady Wyndover. Miss Chetwynde is at present ‘resting’ after her long journey, but it is hoped that she will before long be introduced into society, which will be delighted to welcome a young lady who is not only possessed of something over two millions, but, if rumor be true, is also endowed by the gods with the supreme gifts of youth and beauty.” \\n\\n \\n\\n “There, you see!” said Lady Wyndover, as Esmeralda looked up from the paper with astonishment. “You see what a great deal is expected of us.” \\n\\n \\n\\n “Why does this man write all this about me?” inquired Esmeralda. “It’s—it’s as if I were a—a circus!” \\n\\n \\n\\n [72] \\n\\n \\n\\n “So you are, my dear,” said Lady Wyndover, with her languid smile. “Better than a circus—far better!” \\n\\n \\n\\n “If—if this man had put this into one of the Ballarat papers, Varley or one of the boys would have shot him,” remarked Esmeralda, with a flash of her eyes. \\n\\n \\n\\n “Then I’m glad ‘Varley’ and none of ‘the boys’ are here!” said Lady Wyndover. “My dear, we all get into the paper nowadays, and most of us are bitterly disappointed if we get left out. People like to read about us—I mean by ‘us’ the upper class, and we like to read about each other—it’s the fashion. You’ll soon get used to seeing your name in print, I assure you. And now let me tell you what you are to do to-morrow—what you are not to do. Thank Heaven, you are naturally such good form that you only want a few hints about quite little things. About shaking hands, now, dear. You hold out your hand in the old-fashioned way; no one does that now. It’s in this way, see?” \\n\\n \\n\\n “As if I’d broken my wrist,” said Esmeralda. “All right.” \\n\\n \\n\\n In her soft, languid way Lady Wyndover explained several other little society mannerisms, and Esmeralda listened with her grave eyes fixed on her monitor’s carefully got-up face. \\n\\n \\n\\n “It all seems a great bother, and not to matter much,” she said, at the close of the lesson. “I hope I sha’n’t forget it all.” \\n\\n \\n\\n Lady Wyndover laughed. \\n\\n \\n\\n “I don’t fancy you will,” she said, shrewdly. “And, after all”—with a sigh—“it won’t matter what you do!” \\n\\n \\n\\n The following evening Esmeralda stood in the center of the dressing-room, with the two maids and Lady Wyndover in a circle round her. She was fully dressed, and upon her white arms and neck glittered and sparkled the set of diamonds and pearls which they had bought in Bond Street. \\n\\n \\n\\n She looked very lovely, and, strange to say, not at all anxious, though she still felt as if she would have preferred the dress to have contained a little more material in the bodice. \\n\\n \\n\\n “You are not at all shaky,” said Lady Wyndover; “what a strange girl you are! I remember quivering like a leaf at my first party, and having to take a dose of sal volatile before starting.” \\n\\n \\n\\n “Ought I to be nervous?” Esmeralda said. “I’ll try to be, if you think I ought. Haven’t I got too many jewels about me? I’ve got almost as many as you have, and I seem to myself to be all ablaze.” \\n\\n \\n\\n Lady Wyndover shook her head confidently. \\n\\n \\n\\n [73] \\n\\n \\n\\n “Not at all too much, my dear child,” she replied. “Wait until you see Lady Blankyre’s and the Countess of Desford’s. No, that simple necklace of pearls and diamonds is just the thing. Later on—well, later on—you shall see what diamonds mean! Now are you sure, quite sure, you will not have a little sal volatile?” \\n\\n \\n\\n “If it’s medicine, I’m sure I won’t,” said Esmeralda, emphatically. “I’ve never had any since I got the measles; and this business can’t be as bad as that!” \\n\\n \\n\\n They were driven to Lady Blankyre’s well-known house in Park Lane at what seemed to Esmeralda a remarkably late hour for an “early” party; and, remembering the “small,” she was astonished to find the hall and staircase crowded with guests, and discovered that Lady Wyndover had to almost push her way through the throng. \\n\\n \\n\\n Lady Blankyre, a magnificent woman, in white velvet, stood just inside the room, and at a whisper from Lady Wyndover extended her hand and smiled a welcome. \\n\\n \\n\\n “How do you do, Miss Chetwynde?” she said. “It is very good of Lady Wyndover to bring you to me before any one else!” \\n\\n \\n\\n Then, in an undertone, she said to Lady Wyndover: \\n\\n \\n\\n “My dear, she is superb! Bring her to me again presently, when the crush is over. George”—she turned to her husband, the Earl of Blankyre, who was standing beside her, holding her bouquet of white camellias—“this is Lady Wyndover’s ward, Miss Chetwynde. Will you take her through into the next room?” \\n\\n \\n\\n Lord Blankyre offered his arm, and looked at her curiously through his eyeglass. He had heard the story of her discovery, with all its exaggerations, and had expected to see a rough, gawky girl half dead with shyness. But Esmeralda, though she was somewhat confused by the crowd of superbly dressed women and distinguished men, and the hum of voices mingling with the music of the Hungarian band, did not look overcome by shyness or nervousness. The lovely face was just a little graver than most girls, and the wonderful eyes rather solemn; but the shapely hand that rested on his arm did not shake, and the lips were firm and steady. \\n\\n \\n\\n And yet, what an ordeal lay before her! Lady Blankyre had managed to tell some of her friends that the great heiress was expected, and these had disseminated the information, so that as Esmeralda passed through the room with Lord Blankyre, all those who had heard her name looked at her; at first curiously, and then with greater amazement than they[74] would have felt if she had appeared, say, in the costume of an Australian aboriginal. This lovely creature, with the red-gold hair and large, luminous eyes, this graceful girl in the exquisitely quiet dress, the great heiress whom some lucky lawyer had found in the dust and grime of a gold field! What the newspaper reporters are so fond of calling “a sensation” ran through the crowd, and presently Lord Blankyre was stopped, and plied with eager requests for an introduction, and Esmeralda found herself surrounded by a crowd of men and women, who were as curious and excited about her as if they had been a mob of “the lower class.” \\n\\n \\n\\n She heard titled names murmured to her, and saw men bowing and women smiling pleasantly, and it was little wonder that the color began to rise in her ivory face, and her heart to beat rather tumultuously. Lord Blankyre with ready tact drew her away. \\n\\n \\n\\n “We must not tire you at the very commencement of the evening, Miss Chetwynde,” he said, laughing. “This is your first party, is it not? If we weary you too much, you will be tempted to make it your last.” \\n\\n \\n\\n “Yes,” said Esmeralda, “this is my first party. It is very beautiful—the lights and the music. They are going to dance now?” she added, looking round with intense interest. \\n\\n \\n\\n “Yes, and you, too, I hope,” he said. “See, here are half a dozen good men and true, to engage you for a partner.” \\n\\n \\n\\n “I can’t dance,” she said in her calm, serene way; “I wish I could; it looks so—nice. No, I can’t dance, but I am going to learn.” \\n\\n \\n\\n They looked rather surprised and very much disappointed, and one or two of the best dancing men remained beside her; a significant indication of the effect she had already produced. \\n\\n \\n\\n Lord Blankyre was engaged for this waltz, and looked round in search of Lady Wyndover. \\n\\n \\n\\n “Are you looking for Lady Wyndover, Blankyre?” said a gentleman who stood near them. “I will take Miss Chetwynde to her, if you will intrust her to me.” \\n\\n \\n\\n The speaker was a short and very thin man, with features almost as clean and delicately cut as a woman’s. He was small altogether, with tiny feet and hands. His hair was gray, though he did not look an old man; and his sharp, close-shaven face, with its penetrating eyes and thin lips, gave him an alert and bird-like expression. \\n\\n \\n\\n “Thanks, I will do so reluctantly!” said Lord Blankyre. “Miss Chetwynde, let me introduce Lord Selvaine to you.” \\n\\n \\n\\n Esmeralda was about to hold out her hand, but remembered[75] Lady Wyndover’s instructions, and bowed. Lord Selvaine’s quick eyes saw the checked movement and noted it. \\n\\n \\n\\n “I am delighted that you don’t dance, Miss Chetwynde,” he said, and his voice had a penetrating tone which matched his eyes, “because I don’t dance myself, and we can sit out, and watch other people getting hot. Selfish, you think? We men are all selfish, you know.” \\n\\n \\n\\n He led her to a small recess in which there was a seat. \\n\\n \\n\\n “And so this is your first ball? I wish it were mine! I would give something to know what you think of it.” \\n\\n \\n\\n “I think it is beautiful,” said Esmeralda again. “It is like a picture, and all the colors and lights are like—” She stopped, with a laugh. “Oh! I can’t tell you what I mean, but I dare say you understand.” \\n\\n \\n\\n He leaned back, and crossed one leg, his womanish hands clasped over it, and looked at her with the shadow of a smile in his piercing eyes. He seemed in no hurry to take her to Lady Wyndover. \\n\\n \\n\\n “Yes, I think I understand,” he said. “It is all so new to you! I hope that the women will seem as beautiful, the men as nice, the colors as fresh, the music as delightful to you for a very, very long time!” \\n\\n \\n\\n “You think they will not?” said Esmeralda. \\n\\n \\n\\n He smiled. \\n\\n \\n\\n “No; but I think they will last longer for you than they do for most of us. But you must remember that I am an old man moralizing to a young girl.” \\n\\n \\n\\n “Are you old?” said Esmeralda, with her appalling candor. “I shouldn’t have thought you were.” \\n\\n \\n\\n Lord Selvaine laughed—it might almost be said that he chuckled. \\n\\n \\n\\n “Why not?” he said, evidently amused. \\n\\n \\n\\n Esmeralda surveyed him with her clear, grave eyes. \\n\\n \\n\\n “Well, though your hair is gray, and there are so many little lines in your face, your eyes don’t look old, and you don’t look like an old man.” \\n\\n \\n\\n He gave her a courtly little bow. \\n\\n \\n\\n “However old my head may be, my heart is still young enough to feel grateful, Miss Chetwynde. And how can I show my gratitude? Can I tell you who some of the people are? They are strangers to you, I imagine?” \\n\\n \\n\\n “Quite,” said Esmeralda. “You know them all, I suppose?” \\n\\n \\n\\n “All,” he said, with the faintest shrug of his shoulders, as if he had added that he was also weary of them all; or as if[76] they were puppets which had ceased to amuse him. “Ask me to tell you the names of any of them, and anything about them.” \\n\\n \\n\\n Esmeralda glanced round. \\n\\n \\n\\n “The lady who stood at the door in white velvet?” \\n\\n \\n\\n “Lady Blankyre,” he said; “one of the leaders of society—that is, one of the principal ladies of rank and fashion. Whatever Lady Blankyre says is right, is right, to all the world—especially her husband—the gentleman of whom I robbed you. She is just now saying that Miss Chetwynde is ‘right.’” \\n\\n \\n\\n He glanced at Esmeralda, but she did not blush or look overwhelmed. \\n\\n \\n\\n “Why shouldn’t I be right?” she said, her brows meeting in the little frown which came when she was puzzled. \\n\\n \\n\\n He laughed softly. \\n\\n \\n\\n “Do you know you have the gift of repartee to an extraordinary extent, Miss Chetwynde?” he said. “Nothing in the way of a retort—to what I frankly and penitently admit was an impertinence—could have been better.” \\n\\n \\n\\n Esmeralda looked at him with grave regard. \\n\\n \\n\\n “I don’t understand,” she said. “Who is that old gentleman with the white hair and large nose?” \\n\\n \\n\\n “Mr. Elmbourne—the first man in England—in the world. He is the Prime Minister—the Queen’s chief adviser. He is a great friend of Lady Blankyre’s, and he has left the House of Commons for five minutes’ talk with her.” \\n\\n \\n\\n “He looks like everybody else—only he laughs more,” remarked Esmeralda. \\n\\n \\n\\n “Yes; and in a quarter of an hour he will be in his place in the House, and storming like a fury.” \\n\\n \\n\\n “And who is that next to him, the thin young man with the long hair?” asked Esmeralda. \\n\\n \\n\\n “That is the new poet. He was born last week, will live, say, for six months, and then die.” \\n\\n \\n\\n Esmeralda opened her eyes. \\n\\n \\n\\n “That is, he will go out of fashion, and all those young ladies who are clustering round him, and smiling at him so sweetly and sadly, will forget him.” \\n\\n \\n\\n “I see,” said Esmeralda. “Poor young man! Tell me who that is who has just come in, and—look! all the gentlemen are bowing and the ladies courtesying. Why on earth do they do that? I mean the little fat man, with the broad blue ribbon across his waistcoat.” \\n\\n \\n\\n Lord Selvaine smiled. \\n\\n \\n\\n “That is his Serene Highness, the Prince of Seidlitzberg,[77] and we all bow and courtesy because he is the brother of a king.” \\n\\n \\n\\n “He looks like—like one of the men who serve in the shops,” said Esmeralda, calmly. \\n\\n \\n\\n “He does,” blandly assented Lord Selvaine. He made her acquainted with the names and positions of several others of the brilliant crowd, describing their characters and peculiarities with a happy word or a significant shrug or movement of his small hands; and presently Lady Wyndover came up with another lady. \\n\\n \\n\\n “Oh, here you are, Esmeralda! I have been looking for you everywhere. How do you do, Lord Selvaine?” \\n\\n \\n\\n “I am the guilty one, dear Lady Wyndover,” he murmured in his low, clear voice. “I obtained possession of your treasure on false pretenses, and have been doing my best to make her forget that I promised to take her to you. I restore her now, with tears, but with the hope that you will not take her from me altogether.” \\n\\n \\n\\n Lady Wyndover smiled on him. \\n\\n \\n\\n “You don’t deserve that I should,” she said. “Oh! I have left my fan on Lady Blankyre’s chair—” She broke off. \\n\\n \\n\\n He took the hint at once, and went after it, and Lady Wyndover sat down beside Esmeralda. \\n\\n \\n\\n “Are you only lucky, or are you really very clever, my dear?” she whispered, with a smile. “But I suppose that you don’t know that you have succeeded in interesting the most—most exclusive and ‘difficult’ man in the room! Why, he must have been sitting with you for half an hour!” \\n\\n \\n\\n “Why shouldn’t he?” inquired Esmeralda. “He doesn’t dance, and he seems to like talking. He has been telling me who some of the people are. Who is he?” \\n\\n \\n\\n “He is—Lord Selvaine!” said Lady Wyndover. “The best known man in London. It would take me ages to explain to you what he is! But you can understand this, that there isn’t a girl here who wouldn’t give her ears to have him sit and talk to her for half an hour as he has been talking to you.” \\n\\n \\n\\n “But why?” said Esmeralda. “Is he a very great lord, very rich? What?” \\n\\n \\n\\n Lady Wyndover looked round helplessly. It was, as she had said, so difficult to explain. “Well, he’s the brother of a duke,” she said; “but it isn’t that. He’s—he’s the fashion, and always will be. He’s terribly clever, and knows everything. Even Mr. Elmbourne asks his advice; and his own family—well, he ‘runs it.’ You know what I mean, dear.” \\n\\n \\n\\n [78] \\n\\n \\n\\n “Yes,” said Esmeralda. “I think I do. But if he is all this, why does he waste his time in talking to a girl like me?” \\n\\n \\n\\n Lady Wyndover laughed softly. \\n\\n \\n\\n “Because he has taken a fancy to you, my dear,” she said. “I’m sure I don’t know why. Oh! it isn’t because you’re pretty; the prettiest woman in the world wouldn’t move him. And it can’t be your money,” she was going to say, but paused, for Lord Selvaine returned with the fan. At the same moment, Lady Wyndover’s partner came up to claim her. \\n\\n \\n\\n “Leave Miss Chetwynde with me for a little longer, Lady Wyndover,” said Lord Selvaine. “I will take her through the rooms, if she will allow me.” \\n\\n \\n\\n He steered her through the crowd, their progress being watched and commented on, and, now and again, stopped to make an introduction to her; and Esmeralda, not at all daunted by his greatness, continued asking questions, which he answered without a sign of weariness. \\n\\n \\n\\n They paused for a moment in the opening to a conservatory, and Esmeralda seated herself on a lounge within view of the entrance to the ball-room, and watched the late arrivals with undiminished interest. She was beating time to the music with the tip of her white satin shoe, and Lord Selvaine was leaning against the door-way, and looking down at her with a curious smile, when suddenly he saw her start slightly and her foot stop its rhythmical motion. He looked in the direction of the entrance, and then at her, and waited. \\n\\n \\n\\n “Who is that who has just come in?” she asked, but with a certain hesitation, which he noticed. \\n\\n \\n\\n “Which? The lady, do you mean?” he asked. \\n\\n \\n\\n “No, no!” she said, with a touch of impatience. “The man; the tall young man with the dark face; there he is, just shaking hands with Lady Blankyre.” \\n\\n \\n\\n “Oh! he?” said Lord Selvaine. “That is a nephew of mine. A very good fellow indeed.” \\n\\n \\n\\n “A nephew of yours?” said Esmeralda, with surprise. It was the gentleman who had been riding with the lady whose horse she had pulled down. \\n\\n \\n\\n “Let me introduce him to you,” said Lord Selvaine. “I hope—I think—you will like him. Most people do. I’ll get hold of him in a minute. Don’t you think he is rather good-looking? Please say yes, even if you don’t think so, for I am rather fond and proud of him.” \\n\\n \\n\\n He did not wait for her answer, but went into the midst of the crowd, and presently returned, accompanied by his[79] nephew. Esmeralda’s heart beat rather fast, and the color rose to her face. Would he recollect her? She hoped—though she did not know why—that he would not. Perhaps Lady Wyndover was right, and she ought not to have “interfered;” perhaps he had laughed at her, when he had ridden away out of sight with the fair girl who had treated her so contemptuously. \\n\\n \\n\\n “Miss Chetwynde,” said Lord Selvaine, “let me introduce my nephew, Lord Trafford.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2146/60703.html","bookId":479,"book":{"id":479,"title":"Just A Girl","description":"简介： The saloon, a long and narrow room, built of rough, feather-edged boards and decorated with scraps of turkey-red cotton and cheap calico lining, with occasional portraits of local celebrities rudely drawn in charcoal, was well filled with the crew of...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2146","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
