{"id":108577,"no":34,"title":"Page 34","content":"\\n\\n Moses finds a car that starts. He lifts his brother and carries him to the car and puts him in. Abe’s body is shivering, and the wound on his leg stinks.\\n\\n Am I gonna lose it? Abraham asks. The leg, I mean.\\n\\n You might could, Moses says. But what’s a leg? We still got three good ones between us.\\n\\n They drive back towards the citadel. The sun is before them now, beginning its decline over the hills.\\n\\n They are silent for a long time. Finally, Moses asks Abraham what happened.\\n\\n You mean how I ended up at that garage? Abraham asks.\\n\\n I reckon so.\\n\\n Abraham shakes his head and looks abstractedly at the road unspooling ahead of them.\\n\\n I don’t know, truth be told. They knocked me out pretty good when they took me. I came to when they drug me out of the car at the gasworks. Didn’t know where I was – or how long I’d been under. I puked on one of em.\\n\\n Abraham chuckles, which sends visible shivers up and down his body.\\n\\n Yeah, he goes on, I puked all over one of em. That’s when they commenced to kickin me in the guts. But you know I been gut kicked before – I know how to take it. I got some bruises, but nothing in me ruptured. And I saw they had the girl, too. That Vestal. She come runnin out from somewhere towards me, yelling something or other, I couldn’t hear what. But they grabbed her and drug her back. You find her too?\\n\\n Moses nods.\\n\\n I found her, he says.\\n\\n Abraham looks into the back seat, as if to ask without words where the girl is. But he doesn’t speak it. Maybe he can see that his brother does not want to be queried on the matter.\\n\\n They hauled me into one of them buildings, he goes on, laid me out on the floor. Then Fletcher came in – told me how he was gonna kill me a hundred different ways. I told him it was a shame for him he could only really kill me once – since he seemed to have a lot of brainstormed ideas on the subject. Then he told me how he was gonna kill you – and he had a hundred different ways to kill you too. That guy, he can get pretty creative on the topic of murder. He’s an enthusiast. We might want to steer clear of him for a bit.\\n\\n He’s dead, Moses says.\\n\\n He is?\\n\\n Uh-huh.\\n\\n You kill him?\\n\\n Uh-huh.\\n\\n How’d you do it?\\n\\n Pistol, Moses says and points to his own forehead to illustrate where the bullet went.\\n\\n Hm, says Abraham. That’s on the generic side. I bet he was disappointed. Anyway, he left for a while, and I slept on the concrete – I don’t know how long, could of been a week.\\n\\n It wasn’t.\\n\\n I dreamed of the ocean. Ain’t that funny? I dreamed I was ridin dolphins under the water. It felt good. I mean, it really felt okay in that dream. You know?\\n\\n Moses says nothing.\\n\\n I woke up and figured I’d see you there too and then he’d kill us both but I was bound determined to tell you bout the dolphins first.\\n\\n I guess you got it told.\\n\\n I guess I did.\\n\\n And he was there when I woke up, but it wasn’t like I thought. He’d changed his mind about killin me somehow. Hauled me to the front gates and tossed me out. Said if he saw me again he’d shoot me dead, no more palaver on the topic. How do you figure that?\\n\\n Moses shrugs.\\n\\n Probably it don’t signify much, Moses says.\\n\\n It must signify somethin.\\n\\n Maybe he just spit you back out – didn’t like your flavour.\\n\\n Yeah, maybe.\\n\\n Abraham looks at his brother with a curious gaze. His body shudders, and he wipes his nose on his sleeve and looks out at the road again.\\n\\n So I walked far as I could, he says. But my leg, it wasn’t cooperatin. I made it to the garage. Boxed myself in. Figured it to be as good a grave as any. Reckoned you were dead already or would be dead tryin to fetch me back. It seemed like the end comin to bear all around. All I wanted was sleep. Suck my last breath ridin a dolphin to the bottom of the ocean.\\n\\n Abraham looks at Moses, and Moses nods but continues to stare straight ahead.\\n\\n Anyway, Abraham says. That’s the soup to nuts of what I’ve been up to. How bout you?\\n\\n So Moses explains how there was a battle between the soldiers and the brigands, how he came down into the middle of it to find Abraham, how he saw the Vestal Amata but then lost track of her, how he killed Fletcher with a bullet to his brain, how he found someone he took to be Abraham but it turned out not to be and the man died anyway, how the whole valley got urpped into the sky by fire, how Moses got to his feet and walked away, how the world was so empty, and the sky so sooty from smoke, how he happened upon the garage and chanced to look inside.\\n\\n I got your boots in the back seat, Moses says.\\n\\n You do?\\n\\n Uh-huh.\\n\\n That bastard stole em, he said. He looked like me, huh?\\n\\n I couldn’t tell him – he was burned pretty bad. I was just goin by the boots.\\n\\n You let him go?\\n\\n Wasn’t no chance to. The burns got him first.\\n\\n Abraham nods. Then the shivers seize him again.\\n\\n They took my pills, he tells Moses. The ones for my leg.\\n\\n It don’t matter. We’ll get more. Anything you need.\\n\\n We goin to the cathedral?\\n\\n Uh-huh.\\n\\n Good. I could use a rest from wanderin for a bit.\\n\\n Moses nods – though he understands now that there are no rests from anything, not really.\\n\\n Back at the citadel, Abraham is rolled away into the back rooms of the medical wing. The old pastor, Whitfield, finds Moses and claps him on the shoulder.\\n\\n They’ll take care of him, he says. You needn’t worry.\\n\\n I ain’t worried, Moses says.\\n\\n You were there, in the assault?\\n\\n I was.\\n\\n It was bad, I heard. We had some casualties, but not many.\\n\\n Uh-huh.\\n\\n We’ll plant new growth over the burn. It’s something.\\n\\n It don’t matter. It’s just a symbol.\\n\\n Don’t disdain a symbol, says Whitfield. In this world, a symbol is the closest we come to magic.\\n\\n This may be true. Moses is too tired to think very hard on it.\\n\\n Did you find the girl? Whitfield asks.\\n\\n Found her and lost her again.\\n\\n She might have made it?\\n\\n Could of.\\n\\n We’ll pray for her recovery in the chapel. But I’ve seen very few women as industrious as she. I have great faith that she’s still out there and may find her way home.\\n\\n Moses wants to ask him What home is that, Pastor? Instead he just nods, because it is true. The Vestal is as industrious as any. And it’s also true that she’s likely still out there on the wide, long roads of the country, having claimed her divorcement from Moses as just one more gorgeous escape.\\n\\n They clean Abraham’s wound and wrap his leg with sterile bandages. Then they hook him up to an IV and give him something to make him sleep. Moses stays by his bedside, watching his brother’s dozing form, unable to sleep himself – exhausted though he is.\\n\\n Once Abraham’s eyes flutter open, and he seems to pull himself from sleep as a drowning man surfacing for a brief moment.\\n\\n Mose?\\n\\n Yeah. Right here, brother.\\n\\n Mose, have I still got my leg?\\n\\n It’s still affixed. The doctors say you’re gonna get restored.\\n\\n Goddamn miracle baby, ain’t I?\\n\\n You are at that.\\n\\n For a moment it looks as though Abraham will nod off again, but he revives himself once again and starts digging around with clumsy fingers on his chest.\\n\\n Mose?\\n\\n Yeah.\\n\\n Here. Take this.\\n\\n His fingers get under the cloth of the hospital gown they put him in and clutch at something. It’s the yewess bee given him by Albert Wilson Jacks, Moses sees, still attached to its leather shoelace. Moses takes it from him and slips the lanyard over his head.\\n\\n They got machines here can talk to it. I know they do. Plug it in somewhere and find out what kind of bee it is.\\n\\n Moses says he will, and then Abraham lies back and shuts his eyes and dives under the surface of wakefulness once more.\\n\\n Later Moses takes Abraham’s plastic talisman and hands it to Whitfield.\\n\\n What is it? Whitfield says.\\n\\n Moses shrugs.\\n\\n It was give to Abraham. Can you all find out what it does? I’ll be back. I gotta run an errand.\\n\\n He drives back to the valley, where the gasworks have mostly burned themselves out. The ground is charred black, and the structures that still stand are twisted and skeletal. The stink of sulphur is everywhere, and ash blows in the breeze, itself lighter than the snow that is now falling. And so there are two currents of air visible – the one that carries to the ground a speckled white to erase the destruction of man with its own destruction, and the other that blusters upwards the grey, dusty remains of people and things, like the tide that takes souls to heaven.\\n\\n It is quiet, peaceful, and Moses searches the remains of the valley. He turns over the corpses one by one and looks them in their faces, searching for some sign of the Vestal Amata, dead or alive as she may be.\\n\\n Some of the dead have risen again, and they struggle to move towards him over the snowy, ashy earth. But their skin is charred black and flaky, and it rustles in the breeze, the flakes of their burned flesh like the leaves on a budding tree in the springtime. A shimmying, fluid quality of death he can’t remember seeing before. One of the dead, man or woman he can’t tell, is a walking skeleton. Its skin has been burned away entirely, a blackened exposed skull with its wide bony grin. And, too, its eyeballs have been boiled out of the sockets, so it finds its way blindly through the wreckage, stumbling pathetically and falling face down into the mud, rising again and smelling its way forwards a few paces.\\n\\n Moses puts them all down, spending his ammunition indiscriminately to make the valley an entirely quiet, entirely dead place. He puts down the ones who are still walking and examines the others. Rummaging through the wreckage, he finds the bladed cudgel he dropped in order to carry to safety the man he thought was his brother. The cudgel’s handle juts straight upwards like a chiding finger, its head bent and melted into the remains of some fallen tower. He pulls once, twice, at the handle, trying to dislodge the thing, but he is obviously unworthy of this particular Excalibur, as it does not budge – and then he thinks that this is as good a resting place as any for the brutal bladed thing. He continues to look. \\n\\n","sourceLink":"https://allnovel.net/exit-kingdom-reapers-2/page-34.html","bookId":2517,"book":{"id":2517,"title":"Exit Kingdom (Reapers #2)","description":"Storyline: Exit Kingdom (Reapers #2) \\n In a world where the undead outnumber the living, Moses Todd roams the post-apocalyptic plains of America. His reprobate brother, Abraham — his only companion — has known little else. Together, they journey because they have to; because they have nowhere to go, and no one to answer to other than themselves. \\n Traveling the bloody wastelands of this ruined world, Moses is looking for a kernel of truth, and a reason to keep going. And a chance encounter presents him with the Vestal Amata, a beguiling and mysterious woman who may hold the key to salvation. But he is not the only one seeking the Vestal. For the Vestal has a gift: a gift that might help save what is left of humanity. And it may take everything he has to free her from the clutches of those who most desire her.\\n","cover":"https://allnovel.net/images/exit-kingdom-reapers-2.jpg","author":"Alden Bell","type":"Horror","source":"allnovel","link":"https://allnovel.net/exit-kingdom-reapers-2.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:21:02 PM"}}
