{"id":83119,"no":15,"title":"Page 15","content":"“What about a clue?” He thought it over for a second and said, “It’s not in Franklin and I spent a lot of time there when I was a kid.” I didn’t know much about him, but I could only make one assumption based on that information. “You’re taking me to Collinsville, aren’t you?” “I’m not telling you because it’s a surprise,” he teased. It was about a 15 minute drive to our destination and we talked nonstop on the way. I got the impression Jessie didn’t want to share much about his personal life, but I could tell he was taking me to a place that held a special place in his heart even if he didn’t say so. He pulled into a parking lot outside what appeared to be a park. “I have two places I want to show you.” “At the park?” “The first place is at the park.” I reached for my door handle and he said, “Wait, let me,” as he got out of the truck and came around to open my door. After I got out, he shut my door and I said, “You can be pretty unassholeish when you want to be so I think I might need to find a new name for you.” “I’m all for that, but you’re keeping your name. I could never think of you as anything else but Princess.” I liked that he had a special name for me that only he used. He took my hand in his and his touch ignited an excitement in me I never felt with Forbes. He led me toward a children’s playground and stopped in front of a large play set. “Do you see a common theme?” When I looked puzzled, he asked, “Perhaps something we recently discussed?” I looked around at the playground and saw swings, slides and jungle gyms, but nothing was ringing a bell for me. “It may be difficult to see because it’s dark, but look over there and see if anything registers with you.” I looked in the direction he pointed to and it suddenly hit me. “Oh, I see now. It’s a castle.” “Yes, and this was my kingdom when I was growing up. I always tried to talk one of the girls on the playground into being my princess, but they always refused. I guess I’ve showed them. I resorted to bringing in a Princess from another kingdom.” I felt strangely playful. “Will you give me the tour?” “Absolutely.” We climbed into the inside of the play set, but had to crouch down because it so short. Once inside, he pointed to the corner and said, “That’s where I had my first kiss.” “What was her name so I’ll know who to be jealous of?” He shrugged. “I don’t know. She was a cute blond and that was all I needed to know.” “Oh, so you prefer blonds? I see how you are,” I joked. “There wasn’t any cute little auburn haired girls, so what was I supposed to do? I was only eight. What did I know? I started smoking when I was twelve, so I think we have established I wasn’t the brightest kid.” We hung out in the castle talking for about an hour, then he said, “This has been fun, but there’s somewhere else I’d like to take you. Is that alright?” I would gladly go anywhere he wanted to take me as long as I was with him. “Sure.” We left the park and he drove out to an open field and parked out in the middle. He left the key rolled back so we could listen to the radio and said, “You’re wondering why we’re in the middle of this field, aren’t you?” “Kind of. There’s nothing here.” He pointed to his temple. “There is. You just can’t see it because it’s all in my head.” He reached across the cab, took my hand and pulled me across the bench seat toward him. I thought he was going to kiss me, but he opened his door to step out of the truck and I remembered what he said. He wouldn’t kiss me until I asked him to. “This place is much more significant because this is where I learned to play football. It’s a practice field now, but this used to be Collinsville’s football field a long time ago. I think I may have spent half my life right here learning how to throw a football.” “Looks like the practice paid off, mister starting quarterback.” “Playing football means something different for me than it does for the rest of the team. It isn’t a popularity contest for me. It’s my chance at a football scholarship. Since you have stolen my chance at being valedictorian, football is my backup plan.” I sat in the driver’s seat facing Jessie while he propped against the open door. One of my favorite songs ironically came on the radio and the beer I drank still had me feeling a little brave so I said, “Dance with me.” “What? You want me to dance with you on a football field?” I slid to the edge of the driver’s seat. “Yeah, why not? We already look goofy enough sitting out here doing nothing and I don’t think we have an audience, but it’s fine if you don’t want to.” His mischievous smile reappeared and he asked, “Who said I didn’t want to?” He reached for my hands and pulled me from his truck, then led me a few steps away. He took my right hand in his and pulled me close around my waist. We moved to the slow tempo of the music while the almost full moon danced upon us. He was a good dancer and I loved the way he held me close as he led me to follow him. I giggled at my thought because I felt I would follow him anywhere if only he asked me to. He pulled away slightly and said, “I haven’t heard this song in a long time. What’s the name of it?” I knew the song like the back of my hand and didn’t hesitate in answering, “Kiss me.” “I thought you’d never ask.” He let go of my hand and waist and placed both hands on my face, pulling me closer for our first kiss, but he didn’t start at my lips. He began by teasing me on my neck below my ear and my whole body began to tingle. I drew a deep breath because I was lightheaded and he moved lower on my neck, then around to the other side. When he was finished torturing me there, he moved his lips across my jaw toward my lips and his breathing deepened. I felt his warm breath across my face and he wanted to kiss me hard when my breathing began to match his, but I teased him by holding my lips over his and pulling back each time he advanced. It drove him crazy and when he could no longer take it, he suddenly pulled me so close I was unable to escape. And I didn’t want to. I smiled against his lips. “You tricked me. You said you wouldn’t kiss me until I asked you to.” “Hey, I was just doing what you told me to. I know how a Princess can throw a fit when she doesn’t get her way.” I walked backwards, pulling him by the hands and leaned against his truck. “Now I’m telling you to do it again.” He kissed my forehead, then each of my cheeks and finally my mouth. He took my breath again and deepened our kiss when he heard my desperate intake of air. I wrapped my arms around him tightly, pulling his body hard against mine and pressed my breasts against him. The way he made me feel was insane, like I would let him do anything he wanted to me in this moment. I rested my head back against the truck, giving him full access to my neck and he said, “Claire, I need a minute.” He pulled away from me and ran his hand through his hair while taking a deep breath. I watched him turn away from me. “Are you alright?” He stood with his back to me, his hands on his hips while looking up at the night sky. “Yeah, but you may not be if I don’t stop now.” His words ignited an excitement in me after I understood his meaning and I realized I didn’t want to be alright if it meant he had to stop. As I leaned against his truck and looked at his back, I knew this was not about retaliation or part of a plan and I was eager to see where it would go. “Can I see you tomorrow?” I asked softly. “I’m working all day. What about tomorrow night?” Ugh! My family had plans with the Hendersons. “I have plans I can’t break. What about Sunday?” He finally turned back around. “I have plans I can’t break.” It became apparent that seeing him again this weekend wasn’t in the cards. “What about Monday at second period? Want to be my partner?” He laughed and said, “It’s a date.” He didn’t kiss or touch me again, but I wanted him to and I thought seriously about telling him to pull over on the drive to my house so he could show me how he could make me not alright. He parked on the street in front of my house and I wanted to ask him to come inside because neither of my parents were home, but giving him that invitation was clearly an invite for something else. I reminded myself I still had a boyfriend and what Jessie would think of me if I did what it was I wanted to do right now. I wanted to stay in his truck and talk the rest of the night, but he had told me he had to work the next day, so I knew I had to let him leave. “I had a wonderful time tonight.” “I did, too.” I waited, but he didn’t make a move to kiss me. I reached for my door handle and said, “I’ll guess I’ll see you on Monday.” He put his index finger up, cueing me to wait. He walked around the truck and opened my door for me as he had all night. “See you on Monday.” I reluctantly walked away without kissing him since he didn’t make the move. I guess he was afraid it would start something we couldn’t stop. He waited until I was inside the house to drive away and I leaned against the door thinking about our night together. I touched my lips and remembered the way I felt when his lips were there. There were many uncertainties except one-I was in a beautiful mess. 15 Spooked Jessie Somewhere between Point A and Point B, something had gone astray. I thought screwing Claire to make Forbes mad was the perfect vengeance against him, but something had changed along the way. I didn’t want to genuinely want her, but I did. I never intended on getting emotional involved, but as I drove away from her I realized my heart didn’t care much about what my intentions had been because they were entirely different now.","sourceLink":"https://allnovel.net/going-under-going-under-1/page-15.html","bookId":1877,"book":{"id":1877,"title":"Going Under (Going Under #1)","description":"Storyline: Going Under (Going Under #1) Jessie Boone is a self proclaimed bad boy and doesn’t march to the beat of anyone’s drum, but his own. Growing up in less than desirable circumstances has made him no stranger to the hard knock life and his determination to leave it behind is fierce. When he finds himself transferred to East Franklin High School, he sees his opportunity to use his athletic ability to snag a college football scholarship, but Forbes Henderson, the player Jessie means to replace isn’t giving up his spot willingly. In fact, Forbes is willing to go to extreme measures to retain his place as first string quarterback. When Forbes’ malicious plan to injure his replacement fails, Jessie is furious and determined to show him he messed with the wrong person; not only is he going to take the position of first string quarterback, he’s going to take his girl, too. Claire Deveraux is perfection at it’s best. She is beautiful, intelligent and unaware she just became Jessie Boone’s conquest as revenge against her boyfriend, Forbes Henderson. Like her flawless performance as the perfect daughter and student, Claire’s production of being the perfect girlfriend has everyone fooled, except Jessie Boone, and she fears this tattooed bad boy will see her secret desire to explore his crude threats and promises to rock her perfect world. If she decides to give in to one uninhibited moment with Jessie, will she learn too late that it was all an act of vengeance or will Jessie learn the taste of first love is sweeter than that of revenge?","cover":"https://allnovel.net/images/going-under-going-under-1.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-under-going-under-1.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:49:14 PM"}}
