{"id":83127,"no":23,"title":"Page 23","content":"I never allowed Forbes freedom with my body, but I felt different with Jessie. Although being with him this way felt right, I wasn’t ready to be physically intimate with him and decided it was a good idea to get on the same page. I pulled back and cupped his face with my hands, putting my thumbs on his lips. “I know I just crawled up on top of you like I was going to devour you, but I can’t sleep with you. I’m sorry. I want to, but I’m a virgin and I’m not ready to change that.” He nodded with my hands still holding his face and whispered, “I know.” Everyone assumed I was sleeping with Forbes because we had been together so long and I wondered why he would think differently. “How could you possibly know?” “Forbes was bragging about how he was going to screw you the night of the bonfire. I knew the only reason he would be bragging about it was if he had never been with you, but sex isn’t why I want to be with you. I’d be with Gretchen if that’s what I wanted.” I didn’t want to jump from one guy trying to get in my pants to another one, so I felt like he needed fair warning. “I don’t know when or if I’ll ever be ready and you should know that up front.” He rubbed his hands up and down my back. “This is enough. Just being with you is all I need.” His reassuring promise confirmed how right this was between us. “I want to touch you and kiss you and feel you against me, but I don’t want to be a tease.” “You’re not a tease because you’ve told me that you won’t sleep with me. I won’t lie and say I don’t want you because I do, but your boundaries are clear and I’m okay with them. I know what to expect from you, but if things get too heated and I tell you to give me a minute, I need you back down.” Knowing he wanted to be with me without the expectation of sex was a relief and I felt my love for him grow because of it. “I don’t deserve you.” He closed his eyes and laid his head back against the seat like he was struggling with something. “You’re wrong. It’s me that doesn’t deserve you.” With his head against the seat and his face lifted, his neck was exposed and I wanted to take full advantage. I told him, “We won’t argue about it,” then I returned to kissing him until I felt him tremble from my touch. 22 Wife Material Jessie Claire sat next to me with her hand on my leg as I drove her home. I covered her hand with mine and laced our fingers together, occasionally bringing her palm to my lips for a kiss. She laid her head against my shoulder and said, “Do you have to work tomorrow?” “All day long.” “Since we can’t do anything together tomorrow, could I talk you into a date tomorrow night?” Her question brought a smile to my face and to my heart because I think this girl could quite possibly talk me into anything. “I could be persuaded.” She brought my hand to her lips and placed a kiss on the top. “With a kiss?” “It’s a good possibly,” I hinted. “Would you mind staying in? I want to cook for you.” Coming to her house so she could cook for me sounded like her way of introducing me to her mom and reacquainting me with her dad. “Are you asking me to do the meet the parents thing?” “Technically you’ve met my dad, but I don’t mean the parents thing. My mom and dad will be out of town until Sunday evening, so it will only be us. We can go out and do something if you prefer. It’s no big deal.” I was relieved because she wasn’t asking me to spend time with her parents, but I thought it best to keep that info to myself. “I’d love to come over, but I won’t get off work until six.” “Could you be there around seven?” she negotiated. “Seven sounds perfect.” When I dropped Claire off this time, our goodbye was different. It was more like our make out session at the garage and I was dangerously close to needing a minute to compose myself when she told me she thought she should go inside. Instead of walking around to open the passenger door, I opened mine and slid out. She got out behind me and gave me one last kiss before going inside for the night. When I made it home and got in bed, I couldn’t fall asleep because thinking about my reality with Claire was far better than any dream I could have. I replayed the memory of hearing her tell me how she loved me, but I was left with mixed feelings. I was thrilled because she loved me, but a real relationship with her meant I would eventually be forced to come clean about my life. I couldn’t hide my past forever and I was terrified she would see me for what I really was and realize she was too good for me. My fear of losing Claire kept me awake most of the night and I felt exhausted when the alarm began to scream, but I got up because I didn’t have a choice. Earl was counting on me for help and I needed the money since I suffered from a chronic case of empty pocket syndrome. Earl beat me to the garage today and was under an old Buick when I walked in the shop. “Mornin’, Earl.” “Well, good morning to you, lover boy,” he said from underneath the car. I knew I was going to catch it from him about Claire. “You’re late. Could you not drag yourself away from dreaming about your new girl?” I looked at the clock on the wall in the shop. “I’m not late, you just beat me here this morning.” He slid out from under the old Buick. “How are things with your girl?” “Her name is Claire and things couldn’t be better. She invited me over for dinner tonight. Said she wanted to cook for me.” Earl wiped his hands on an old rag and said, “Good, you can find out now if she’s wife material or not.” “It’s a little early to be evaluating her for that, I think.” He laughed at me like I was a silly child. “Look, kiddo…it’s never too early to evaluate a woman’s ability to cook. If she’s asked you to eat her cooking this early in the relationship, then you’re probably in good shape because she wouldn’t invite you if she didn’t think she could cook good food. The problem is when a woman doesn’t know her cooking is terrible. One time I dated this beautiful woman, but she didn’t realize her cooking was horrendous.” That wasn’t the end of the story and he wanted me to ask him to expand. “How did you handle it?” He started laughing and said, “I married her and had my mother teach her how to cook, but I don’t recommend it, so find you a wife that can already cook.” “I love Miss Hazel’s cooking. I can’t imagine her ever being an awful cook.” “Well, I couldn’t imagine me marrying a woman that couldn’t cook, but I did and the task of teaching her wasn’t an easy one, so take my advice and save yourself some trouble.” Earl always looked out for me, so I guess he thought it was his duty to advise me on wife hunting even if it was much too early to consider. “I’ll remember that, Earl.” Aside from the occasional inspection sticker, my day was filled with oil changes, but that was good because I was less likely to drop a wrench in my face since I couldn’t stop thinking about Claire. Earl let me leave a little early, so I ran by the florist and picked up a bouquet of flowers, then hurried to the mall and bought a new light blue pullover for my first real date with Claire. It wasn’t a popular name brand like the other kids at school wore, but the saleswoman said that I had to get it because the color matched my eyes perfectly. I hoped Claire noticed because the money I spent on the shirt should have been going toward repairs on my truck. After rushing to get ready, I made it to Claire’s at seven on the dot and knocked on her front door nervously with flowers in hand. She answered the door wearing a sexy little sundress and I swallowed hard as I held out the flowers. “I hope you like Gerber daisies.” “I do. Very much so in fact. Thank you.” She brought the flowers to her nose for a sniff and said, “Come in. Dinner is almost ready.” She took me to the kitchen and I studied my surroundings as I followed her. Her house was even bigger than I imagined and it looked like something out of magazine. Nothing appeared out of place and it felt like a museum except for the occasional family photo scattered here and there. “Your house is beautiful.” “Thank you. My mom is really into home decor. It’s too formal for my taste, but it’s the way she likes it.” When we walked into the kitchen, Claire told me to relax at the bar while she finished cooking. As I sat on a barstool, she grabbed an apron and put it on top of her sundress. As she tied it around her waist, I couldn’t help but think how domesticated she looked, like she should be someone’s sexy wife rather than a seventeen year-old girl. I wondered if the impression would have crossed my thoughts if Earl hadn’t placed the idea of inspecting her as possible wife material in my mind. “I don’t know much about cooking, but is there anything I can do to help you?” She smiled at my offer. “Nah, I’ve got this. I’ve been knowing my way around a kitchen for a long time.” She looked so comfortable and confident as she whirled around the kitchen in her designer apron that said,“Queen of Everything.” “I take it you enjoy cooking?” I asked. “I love to cook and try new things. I mess up every once in a while, but what cook doesn’t?” No one had taken the time to show me how to cook anything, so it was sort of a learn as I went kind of experience for me and most of the time it wasn’t pretty. “I mess up more than occasionally.” She turned the oven light on and I watched her sundress climb the back of her thighs as she bent over to peek at what was in the oven. “Maybe I can teach you some things.” I liked the way that sounded. “I’m up for it anytime.” I convinced my eyes to look away from her hemline just in time for her to not see my stare when she turned around. I reminded myself of what her boundaries didn’t include and decided I was unnecessarily torturing myself by looking at her like that.","sourceLink":"https://allnovel.net/going-under-going-under-1/page-23.html","bookId":1877,"book":{"id":1877,"title":"Going Under (Going Under #1)","description":"Storyline: Going Under (Going Under #1) Jessie Boone is a self proclaimed bad boy and doesn’t march to the beat of anyone’s drum, but his own. Growing up in less than desirable circumstances has made him no stranger to the hard knock life and his determination to leave it behind is fierce. When he finds himself transferred to East Franklin High School, he sees his opportunity to use his athletic ability to snag a college football scholarship, but Forbes Henderson, the player Jessie means to replace isn’t giving up his spot willingly. In fact, Forbes is willing to go to extreme measures to retain his place as first string quarterback. When Forbes’ malicious plan to injure his replacement fails, Jessie is furious and determined to show him he messed with the wrong person; not only is he going to take the position of first string quarterback, he’s going to take his girl, too. Claire Deveraux is perfection at it’s best. She is beautiful, intelligent and unaware she just became Jessie Boone’s conquest as revenge against her boyfriend, Forbes Henderson. Like her flawless performance as the perfect daughter and student, Claire’s production of being the perfect girlfriend has everyone fooled, except Jessie Boone, and she fears this tattooed bad boy will see her secret desire to explore his crude threats and promises to rock her perfect world. If she decides to give in to one uninhibited moment with Jessie, will she learn too late that it was all an act of vengeance or will Jessie learn the taste of first love is sweeter than that of revenge?","cover":"https://allnovel.net/images/going-under-going-under-1.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/going-under-going-under-1.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:49:14 PM"}}
