{"id":82656,"no":14,"title":"Page 14","content":"FOURTEEN\\n\\n TALES SPOKEN IN A WHISPER\\n\\n \"Bethany\u0027s Sin?\" Jess screwed his diamond blue eyes up in thought and grunted. \"No, I don\u0027t guess I\u0027ve ever really sat down and done much thinking about it. Just seems like a name to me.\"\\n\\n \"Sure,\" Evan said, and leaned forward slightly in his chair. \"But what\u0027s behind the name? What does it mean?\" Jess was silent for a moment, rolling a cigarette from a pouch of tobacco. They were sitting together in the office of the Gulf service station on Fredonia, drinking Cokes from the machine out front. In the garage Jess\u0027s son was muttering over a red Volkswagen, every once in a while circling it as if sizing up an opponent before attacking it again with his wrenches. Only a few cars had come in while Jess and Evan talked; a family had driven in for directions, and Evan had seen in the eyes of the man\u0027s wife that same expression he\u0027d seen in Kay\u0027s the first day they\u0027d driven through the village. Of course Evan knew why; it was a beautiful place, and its beauty would naturally appeal to women\\n\\n Evan had gotten some important mail that morning. Fiction magazine had accepted his short story about two former lovers, elderly now, meeting by chance on a train. And as they talked, reliving old memories, the train began to stop at stations farther and farther back in time, until at last, when they realized their love was still strong, the train stopped at Niven Crossing, their old hometown, back in the year they\u0027d first fallen in love under summer stars on the shore of Bowman\u0027s Lake.\\n\\n Evan\u0027s other mail wasn\u0027t good. A rejection from Esquire. That story, about a Vietnam veteran whose wife and friends had begun to take on the appearance of people he\u0027d killed during the war, had been terrifying for Evan because it probed at those raw, unhealed scars where the nerves of fear and guilt lay so close to the surface. He\u0027d decided that he needed the distance of time to be able to say anything articulate about Vietnam; every thing he\u0027d written so far had emerged as disorganized, ragged screams of pain.\\n\\n Perhaps he would always carry that scream within him; it was his burden from the war, his memory of young men ripped down like wheat beneath the dark master\u0027s scythe, of bodies without faces or arms or legs, of shell-shocked soldiers screaming without voices, of himself lashed to a cot with the touch of a spider on his skin and, much later, standing alone amid mortar fire, waiting for God\u0027s next blow to fall. It had been very difficult readjusting to the world after he\u0027d come home, because it all seemed so unreal. No one leaped for cover from incoming mail; no one screamed for medics to help hold their falling intestines in place; no one counted the stars in the sky and wondered if tomorrow night they\u0027d still be there to repeat the exercise. No one seemed to really know what was going on, or for that matter really to give a damn. And that both infuriated and crushed Evan, that so many had died like little patriotic Jesuses while all the Judases at home counted their coins. That was how he remembered Harlin, his editor at Iron Man: a fucking Judas of the worst kind. From the very start of that job, Harlin, a hulking man with a crew cut and a long lower jaw, had made it tough for him.\\n\\n \"You were over in Vet-Nam, huh? See much action?\" Evan had said yes. \"I took on the Nazis in World War Two. Fought in France. Got those goddamned Nazis by the balls. Damn, but those were good times.\" Evan had remained silent. \"Yes sir, you can say anything you want. But by God there\u0027s nothing better than fighting for your country.\" After a long while Harlin had turned interrogator, wanting to know how many Cong Evan had killed, if he\u0027d ever used napalm on any in their hutches, if he\u0027d ever killed any of those villagers, because by God they all fucking look alike, anyway, don\u0027t they?\\n\\n Evan had pointedly ignored him, and by degrees Harlin had grown surly and then savage, asking him if he was certain he\u0027d done any fighting and why he never liked to talk about it and why he hadn\u0027t at least brought his wife home a fucking earlobe, for Christ\u0027s sakes?\\n\\n And through this veil of savagery Evan began to see glimmers of the truth in his dreams: Harlin standing before him, his face as pale as chalk and of the consistency of clay. Very slowly Harlin\u0027s face began to melt, as if bubbling from a vast center of volcanic hatred within the man; cheesy strings of flesh fell, sections of his face splitting away and dropping to the floor: a hooked nose, a lower lip, a jaw. Until all that was left were two hideously staring eyes set in a skull with the scalp still attached to it. And that Harlin-thing, drooling vile, dark fluids, was moving toward Kay as she slept in the bedroom of the house she and Evan had rented in LaGrange. The Harlin-thing unzipped its pants and a scaled, erect penis had risen into view, throbbing for Kay\u0027s flesh. And just as Harlin was about to throw the sheets back from Kay, Evan had awakened, gasping for breath.\\n\\n It had been at a Christmas party for Iron Man staffers and their wives that the terror within Evan had come to a head, like a boil about to break. Harlin had begun badgering him about the war, wanting to know how many of his friends had died, and then, after Harlin had drunk a half-bottle of whiskey, wanting to know how much \"little gook cunt\" Evan had scored, Evan had pushed him away, and Harlin\u0027s twisted emotions had risen quickly, like a snake whipping up from a dark hole. \"You\u0027re a goddamned liar,\" Harlin had said menacingly, as people stopped talking and drinking and turned to listen. \"What d\u0027you think you are, some kind of war hero or somethin\u0027? I did more than you by God and you know what they give me? A pat on the back and a kick in the ass. And by God my son Jerry bless him bless my son Jerry was raised right, raised to fight for his country like a man \u0027 ought to do, and he volunteered to go to Vet-Nam, didn\u0027t want to be fucking drafted, no, but volunteered because his old man said that was the right thing to do. I saw him off on the train, and we shook hands like men because when a boy\u0027s eighteen then he is a man. And you know where he is now?\" Harlin\u0027s eyes had glistened for an instant, just an instant, then had burned into Evan\u0027s brain with renewed fire. \"That VA hospital in Philadelphia.\\n\\n Half his head gone. Just sits there, never says a word, can\u0027t feed himself, pisses his pants like a goddamned baby! And the last time I went to see him he just sat at the window and didn\u0027t look at me, like he blamed me and hated me. Hated me! And look at you, by God, standing here with a fucking eggnog in your hand and a tweed coat and a tie on and you think you\u0027re a fucking war hero, don\u0027t you?\"\\n\\n Here the others tried to quiet him, and Evan took Kay\u0027s hand for them to go, but the man wouldn\u0027t stop. \"You\u0027re not a man!\" Harlin croaked. \"If you were you\u0027d be proud of killing those goddamned gooks that shot my Jerry! You\u0027re not a man, you cockless bastard!\\n\\n Hey!\" He focused his eyes on Kay. \"Hey! Maybe I\u0027ll show you what a real cock looks like someday, huh?\"\\n\\n And here the dream image had burst into Evan\u0027s mind, and he\u0027d moved with relentless, terrifying speed, past Kay before she could stop him, past two other people in the way, his face contorting as the terrible things began to come up and take control of him. His arm had whipped out, faster than anyone\u0027s eyes could follow, and he\u0027d gripped Harlin around the throat, spun him backward, and knelt to snap his spine over his knee. He\u0027d heard and dimly remembered someone screaming and realized that madman\u0027s voice was his own.\\n\\n And Kay had screamed \"Nooooooo!\" in the instant Evan, had started to apply pressure to kill Harlin in the same fashion he\u0027d killed a young Cong who had probably been no older than nineteen. They\u0027d wrestled Evan away from Harlin, and it was then that Kay had dissolved into soul-wracking tears. Not long after that, Evan had lost his job, been fired for \"sloppiness and neglect of duty,\" and they\u0027d left LaGrange.\\n\\n My God, Evan thought now, in the Gulf station office, that seems like ages ago. But he knew that killer instinct he\u0027d shown had never and would never go away; it was too deeply ingrained now, it was the black part of him that he kept hidden away, under strict lock and key.\\n\\n In the past few days he\u0027d again turned his attention to a story on the village. He\u0027d written a letter of inquiry to Pennsylvania Progress, asking them if they\u0027d be interested in something on Bethany\u0027s Sin.\\n\\n He\u0027d had no answer yet, but why not try to find out what he could in the meantime? So he\u0027d found himself guiding the conversation with Jess onto the subject of Bethany\u0027s Sin, particularly anything the man might know about the origin of that name.\\n\\n Jess lit his cigarette and pulled at it. \"I don\u0027t know,\" he said.\\n\\n \"Do you think maybe they\u0027ve got some records or something over at the library?\"\\n\\n \"Maybe so,\" Evan said; he\u0027d already decided to check the library on the walk home. \"But I thought perhaps, working here, you might have heard stories, gossip, something that could help me out.\"\\n\\n Jess grunted and smoked in silence for a while. Evan didn\u0027t think he was going to reply, and the next time Evan glanced over at him, Jess\u0027s eyes seemed to have darkened a few shades, retreated back into his head as if shrinking from the sunlight. Smoke dribbled from his nostrils, and he leaned back against a couple of crates of Valvoline oil. There\u0027s a place up on the King\u0027s Bridge Road a few miles,\" he said finally. \"Lot of locals hang around there. A roadhouse called the Cock\u0027s Crow. A man can hear some pretty interesting tales if he\u0027s got his ears open. Some of \u0027em tall tales, some of \u0027em...well, worth thinking about, if you know what I mean.\"\\n\\n Evan didn\u0027t. \"What kind of tales?\"\\n\\n \"Man named Muncey ran this station before I came here,\" Jess said quietly, his eyes hooded and distant, avoiding Evan\u0027s. \"I got the job because one day the man just didn\u0027t show up. He had a wife and two kids, lived in a trailer a couple of miles east of here. They didn\u0027t know where he was, either. A few weeks afterward, the troopers found the man\u0027s car, pulled out into the woods and covered over with brush.\" He paused, smoking his cigarette.\\n\\n \"What about the man?\" Evan urged.\\n\\n \"Never found him. At first, see, they thought he\u0027d run off with the cash receipts, just left his wife and kids and run for it.\" Jess shook his head. \"But that wasn\u0027t so. The troopers found the cash, all bundled up in those bags the bank gives you for delivery, underneath the front seat. The window on the driver\u0027s side was broken out, and the windshield was cracked - that\u0027s what I heard from some of the locals at the Cock\u0027s Crow, and maybe they\u0027re wrong. But maybe they\u0027re not.\"\\n\\n \"That\u0027s bad,\" Evan said, \"but I guess people disappear all the time. it\u0027s an unfortunate fact of life.\"\\n\\n \"Unfortunate. Right.\" Jess smiled slightly, and then the smile slithered away. \"No, more than that. The sort of thing that happened to Muncey - whatever it was - has happened before around here.\\n\\n And more than two or three times. Enough to make a man wonder.\"\\n\\n \"Wonder? About what?\"\\n\\n \"About what he doesn\u0027t know,\" Jess said, still speaking quietly and calmly, but his eyes brooding. \"You hang around up at the Cock\u0027s Crow, you\u0027ll hear those stories. And you\u0027ll wonder about them the same as me. Some of the locals have seen things at night.\\n\\n Strange things; and they\u0027ve heard strange callings in the woods, too, and heard things moving fast through the brush. Things they were scared of seeing too close.\"\\n\\n Evan felt a chill run along his spine. He remembered the first night in his house, the fleeting image he\u0027d seen pass the window.\\n\\n What had that been?\\n\\n \"Yes sir,\" Jess said. \"The Cock\u0027s Crow. You hang around there a few nights and you\u0027ll know what I mean.\"\\n\\n \"Sounds like somebody has an overactive imagination,\" Evan said, probing for more details. Overactive imagination: how many times had Kay applied that phrase to him? More times than he could count.\\n\\n \"Not imagination,\" Jess said. \"No. Me, I\u0027ve never seen any of these things they tell me about. Couple of times on the drive home, my boy and me thought we\u0027d heard peculiar cries out in the woods, but we passed it off as birds or some kind of animal. But you get close to some body who\u0027s had a brush with the things and you look deep into their eyes and then you come back and talk about imagination. No. What \u0027ll see there is fear, pure and simple. Now I\u0027m not saying that Bethany\u0027s Sin isn\u0027t a nice and pretty little place.\\n\\n But I\u0027ve been working here for a while and I\u0027ve gotten a feeling about it. A feeling I don\u0027t like. That something...well, that something\u0027s not right around here. Like too much paint and varnish over wood that\u0027s gone rotten.\" Jess turned his head slightly and looked into Evan\u0027s eyes. \"I stay away from this place after night falls,\" he said. \"And I stay off the back roads.\"\\n\\n For a long while Evan said nothing. Words weren\u0027t needed; he could see a message in this man\u0027s face. A warning, perhaps?\\n\\n Troubled currents churned within him, icy, gathering force. Abruptly, Jess turned away. A car was pulling into the station, and Jess left his chair to pump gas.\\n\\n On the walk home, Evan stopped at the library. The librarian, a pretty young brunette with ANNE on her name tag, listened to Evan\u0027s questions about the origin of the name Bethany\u0027s Sin and jotted down his request on a piece of paper. Then she came out from behind her desk and led him over to a shelf marked REGIONAL\\n\\n INTEREST. She pulled down the worst of three ratty-looking books and gave it to him; it was titled Names and Places: Pennsylvania\u0027s Village Heritage. Bethany\u0027s Sin wasn\u0027t listed in the index, though, and turning to the date of publication, Evan found the book was published in the late thirties. He returned it to the librarian with a polite thank-you and asked her if she knew of any place he might be able to find records on the history of Bethany\u0027s Sin; she smiled and said that was a new one on her, but perhaps there might be some old papers in the basement. Why don\u0027t you give me your name and telephone number? she asked him; l\u00271l take a look and call if anything turns up.\\n\\n On the way out, Evan\u0027s attention was caught by a framed etching that hung near the front door. He paused for a moment, then approached it for a better look. It showed a woman bearing a bow with a quiver of arrows hanging at her side; at her feet what looked like wolves followed her, not menacingly but with expressions of loyalty. Forest filled the background, and above her left shoulder was the pale oval of the moon. Beneath the etching there was a brass plaque: PRESENTED TO THE WALLACE PARKINS PUBLIC\\n\\n LIBRARY BY DR. KATHRYN DRAGO. Evan looked into the face of the woman in the etching; it was calm and purposeful, the eyes mirroring an inner strength of will. He glanced down at the plaque again. Dr. Kathryn Drago? He wasn\u0027t familiar with the name, but the etching she\u0027d donated strangely compelled him.\\n\\n \"It\u0027s from the seventeenth century,\" Anne the librarian told him; she\u0027d come up from behind while he\u0027d been staring at the etching. \"If you\u0027re interested in art, we have quite a large selection...\"\\n\\n \"Who is that supposed to be?\" Evan asked her.\\n\\n \"The Greek goddess Artemis,\" Anne said. \"I think. I\u0027m not up on my mythology like I should be.\" She smiled apologetically.\\n\\n \"Mythology?\" Evan paused for a moment, looking into those eyes that stared out from the etching. \"I once took a course in that. A long time ago. But I can\u0027t remember anything about this one. It seems like Greek deities crawled out of the woodwork. Who\u0027s this Kathryn Drago?\"\\n\\n \"Dr. Drago,\" Anne corrected. \"She was voted in as mayor a few years ago, and she founded the village\u0027s historical society back in...oh, I guess that\u0027s got to be five or six years.\"\\n\\n \"Mayor?\" Evan raised an eyebrow. \"I didn\u0027t realize Bethany\u0027s Sin\u0027s mayor was a woman.\"\\n\\n \"She lives outside the village,\" Anne told him. \"And she raises horses.\"\\n\\n Horses? Evan thought for a moment, remembering that strange house and the horses grazing on the wide swath of pastureland. \"Oh, yes,\" he said. \"I\u0027ve seen that place. That etching must have been a very expensive gift.\"\\n\\n \"I\u0027m sure it was. Now. Can I show you our art books?\"\\n\\n \"No, thanks,\" he said. \"Some other time, maybe.\" And then he was out the door and walking in the sunlight again, his mind turning in angles like a runner trying to find his way through a darkened labyrinth. Horses? Mythology? Something working in his brain, then slipping quickly away before he could grasp it. The Greek goddess Artemis. He caught himself, almost turned back to the library to ask the librarian if they had any books on mythology, and then shrugged off the impulse, continued walking back toward McClain Terrace.\\n\\n Other things weighed too heavily on him right now. Like the origin of Bethany\u0027s Sin. If he couldn\u0027t find out about it by reading, he\u0027d have to find out by listening to some of those tales Jess said circulated around the Cock\u0027s Crow. His mind began to wander, and he found himself thinking about horses again. His experience with them had been limited to riding shuffling, broken-spirited ponies at county fairs when he was a child. But another memory pricked his brain like a thorn. The shape he\u0027d seen from his bedroom window that first night: dark, moving rapidly, almost out of view before he\u0027d been able to register it. Could that have been a horse and rider?\\n\\n Possibly, he thought. Possibly.\\n\\n His face began to burn. The sunlight assaulted it as if searing flesh already burned raw. He looked around, saw horses, trees, streets, but he seemed not to be able to recognize where he was.\\n\\n Blair? No, not yet. Walking deeper into the village as if drawn into it, one leg following the next. The sun glinting sharply through the trees, hurting his eyes. His heartbeat picking up, a heat circulating across his face with the flow of blood, burning, burning, burning...\\n\\n And abruptly he stopped.\\n\\n The museum lay before him.\\n\\n For a few minutes Evan couldn\u0027t move; his muscles wouldn\u0027t respond to the commands of his brain, and everything around him seemed ablaze with light. He remembered his dreams, and a finger of ice slipped through the curtain of heat to touch his throat very gently. Coming true? Coming true like they all did, eventually, in one way or another? The house waited for his approach in dark, grave silence. He wanted to turn away, to retrace his steps, to start again somehow from the library; but his path had been predetermined, and his steps had led him here to this waiting, beckoning house. He was afraid of it, and the fear writhed inside him, a dark, formless shape gone out of control; in the next moment he started to cross Cowlington toward the museum, and a car honked and veered away from him. Evan walked slowly and laboriously, his breath coming raggedly; he stopped for a moment at the gate and then pushed it open. As he stepped through, he felt the heat on his face even more intensely. His movements seemed heavy and dreamlike; his eyes were focused on the doorway centered beneath a columned arch, and though a voice in his soul screamed for him to turn back, he knew he must follow the directions of his dream. He must reach that door and...yes, open it. To see. To see what lay within.\\n\\n He stood before the door, his senses vibrating, his face pinpointed with sweat. Above him loomed the museum, casting a spiderish shadow on the impeccable green lawn. Very slowly he lifted his arm, his eyes widening, widening because he knew what lay inside: a thing with gleaming, hate-filled eyes that would reach out to him with a clawlike hand. He put his hand against the door, feeling his nerves shriek. And he pushed.\\n\\n But the door wouldn\u0027t open. It was locked from within.\\n\\n He pushed again, harder, then took his fist and struck the wood; he could hear the sound of the blow echoing inside, echoing through long corridors filled with...what? Junk, Mrs. Demargeon had said.\\n\\n Just old junk.\\n\\n Evan struck the door again. And again. No, this wasn\u0027t in the dream. Something was wrong. This wasn\u0027t the way it was supposed to be. Open and let me see you. Open. Open, damn you. Open!\\n\\n \"Hey!\" someone called out. \"What are you doing there?\"\\n\\n Evan turned toward the voice, blinking his eyes into focus.\\n\\n There was a police car pulling up to the curb in front of the house. A man in uniform got out and began to stride hurriedly toward him. \"What are you doing there?\" the man asked again.\\n\\n \"I\u0027m...Nothing,\" Evan said, his voice sounding strained and distant. \"Nothing.\"\\n\\n \"Yeah? Well, what are you doing here, then?\" The man wore a sheriff\u0027s uniform, and in his broad face, hard \u0027 eyes caught Evans and held them.\\n\\n \"I was just...going inside,\" Evan said.\\n\\n \"Inside?\" Oren Wysinger\u0027s eyes narrowed. \"They\u0027re closed for the day. They\u0027re not open on a regular schedule, anyway.He paused for a moment, looking into the mans eyes and seeing something there that disturbed him, as if a pool of, water had begun rippling suddenly and there was no way of knowing what had moved beneath the surface. \"Who are you?\" Wysinger asked quietly.\\n\\n \"Reid, Evan Reid. I...live over on McClain Terrace.\"\\n\\n \"Reid? The new family just moved in?\"\\n\\n \"That\u0027s right.\"\\n\\n \"Oh.\" Wysinger dropped his gaze away from Evan\u0027s. \"Sorry I was so abrupt, Mr. Reid. But not many people come here, and when I saw you hammering at the door I didn\u0027t know what was going on.\\n\\n \"It\u0027s okay.\" Evan ran a hand over his face, feeling the heat in his flesh dying away now, degree by degree. \"I understand. I was curious about this place.\"\\n\\n Wysinger nodded. \"It\u0027s closed up,\" he said. \"Hey, are you feeling all right?\"\\n\\n \"I\u0027m...tired. That\u0027s all.\\n\\n \"I don\u0027t see a car. Are you walking?\\n\\n Evan nodded. \"I was on my way back to McClain.\"\\n\\n \"You want a lift? I was driving that way.\"\\n\\n \"All right,\" Evan said. \"That would be fine.\"\\n\\n They walked back across to the police car. Evan turned and stared at the museum for a moment, then tore his gaze away and closed the car door behind him. Wysinger started the engine and drove toward McClain. \"I\u0027m Oren Wysinger,\" he said, offering Evan one large, rough, seamed hand. \"I\u0027m sheriff in the village; sorry I didn\u0027t recognize you back there. Guess I\u0027m just distrustful by nature.\"\\n\\n \"You were doing your job.\\n\\n \"Well, yeah,\" Wysinger said, \"but sometimes I suppose I can get carried away. You feeling any better now.\"\\n\\n \"Yes, thanks. I don\u0027t know what was wrong with me. I was very tired and I...anyway, I\u0027m okay now.\"\\n\\n \"Good.\" Wysinger turned his head slightly, glanced at the man\u0027s profile and then back at the street. \"The museum opens at nine on Mondays, Wednesdays, and Fridays. Sometimes on Tuesdays, too. It just depends on a lot of things: the weather, how many people are working on the staff that particular day, things like that. You sure seemed in a hurry to get in there.\"\\n\\n \"I didn\u0027t know it was locked,\" Evan said. He could feel Wysinger\u0027s eyes on him; then the man looked away again. \"I\u0027d like to see what\u0027s inside,\" he said.\\n\\n \"It\u0027s pretty interesting, if you like that kind of thing,\" Wysinger told him. \"Statues and stuff. I find it on the dry side myself.\"\\n\\n \"What kind of statues?\"\\n\\n Wysinger shrugged. \"To me a statue\u0027s a statue. There are other things, too. Old stuff.\"\\n\\n \"Tell me something,\" Evan said. \"Bethany\u0027s Sin is such a small village, I find it strange that there should be such a large museum. Or a museum at all, for that matter. Who built it?\"\\n\\n \"The house itself\u0027s been here for a long time,\" Wysinger said.\\n\\n \"The historical society went in and remodeled it, tore out a lot of the smaller rooms and widened the hallways. Added another floor, too.\"\\n\\n He turned onto McClain. \"It\u0027s the white house with the green, isn\u0027t it?\"\\n\\n \"That\u0027s right. So where did the historical society get those things to display inside?\"\\n\\n \"I don\u0027t really know, Mr. Reid. To tell you the truth, I don\u0027t turn in the same circles with those ladies in the society. I\u0027m kind of out of touch, I guess you could say.\"\\n\\n He slowed the car and turned toward the curb.\\n\\n \"Are they local relics?\" Evan persisted. \"Indian artifacts?\"\\n\\n Wysinger smiled slightly. \"I couldn\u0027t tell you Indian from Japanese, Mr. Reid. You\u0027ll have to go over there when they\u0027re open sometime and see for yourself.\" He stopped the car at the curb in front of Evan\u0027s house. \"Here we are. Nice house you\u0027ve got yourself there.\"\\n\\n Evan climbed out and closed the door, and Wysinger leaned over to roll down the window. \"Sorry I haven\u0027t been by to welcome you to the village. My work keeps me pretty well wrapped up, though. I\u0027ll look forward to meeting your wife and kids sometime.\"\\n\\n \"Just one,\" Evan said. \"A little girl.\"\\n\\n \"Oh. Again\" - Wysinger shrugged- \"sorry I came on strong over at the museum.\"\\n\\n \"That\u0027s okay.\"\\n\\n \"Fine, then. I\u0027d better get back. You take care of yourself, now.\\n\\n Be seeing you.\" Wysinger raised a hand and then drove away along McClain, turning back for the village and disappearing.\\n\\n Evan walked along the path toward his front door, glancing over at the Demargeon house. No car in the driveway. The house silent. He wondered if Harris Demargeon was home, almost walked over there, decided not to disturb the man. He took his house key from his pocket and unlocked the front door, stepped into the entrance foyer, closed the door behind him. Kay and Laurie would be home in about a half hour. He went into the kitchen, drank a glass of water, and then sat down in a chair in the den. The manuscript returned by Esquire lay on a table beside him and he kept his gaze away from it. He tried to relax but found his muscles still stiff, a strange tingling in his arms and legs as if the blood had just flowed back into them from reservoirs in his heart. For a long time he sat still, his mind weaving together the pieces of a tapestry that he could not yet understand. Imagination? Were his feelings all imagination, just like Kay said? What\u0027s this fear inside me? he asked himself. And why in God\u0027s name does it seem to be growing stronger day by day, and me weaker?\\n\\n His mind\u0027s eye saw the museum at the center of the village, and everything else turning around it. Then blinked. Jess\u0027s eyes, hooded and distant. Blinked again. That picture on the wall in the library, the plaque beneath it. Dr. Kathryn Drago? Another blink. A shadow across a curtained window, the figure missing its left arm. And even when he closed his eyes and leaned his head back, the eye in his mind that saw with a much more terrible clarity remained staring at the picture fragments whirling through his head like sparks thrown off a pinwheel.\\n\\n For he knew what had happened this afternoon, knew why he\u0027d been drawn to the museum, knew and dreaded the knowledge with an awful certainty. As his premonitions - imagination, Kay would say; imagination you know it\u0027s only that and nothing more I don\u0027t like to hear you cry out in the middle of the night it makes my head ache - as his premonitions were growing stronger, they were beginning to affect more than his dreams. They were beginning to seep through that curtain between two worlds. The second sight - a gift, his mother had said; a curse, his father had muttered, Eric is dead found him in the field Evan Why didn\u0027t you help him? - that had come down to him through generations, from his grandfather Frederick and his great-great-grandfather Ephran and God only knew how many others hidden away in the tangle of the family tree, was sharpening, intensifying, frighteningly so. That had never happened before, never, and he wasn\u0027t sure how to deal with it. Or where it would lead. As his premonitions became more immediate, would they take control of him, finally breaking entirely free of his dreams and shadowing his steps in the world of the living? Jesus, he thought: he would see everything through the eye of his mind, good or evil, beautiful or dripping with soulless horror. He didn\u0027t want to think about that because it made him afraid of what lay ahead. No.\\n\\n Have to control myself, have to keep those things out of myself because if I were overpowered by them what would...Kay\u0027 s reaction be? Horror? Disgust? Pity?\\n\\n And so he sat in the den, in company with those quick and fleeting visions, until he heard the door come open and Kay and Laurie were home, both smiling and happy and unaware. \\n\\n","sourceLink":"https://allnovel.net/bethany-s-sin/page-14.html","bookId":2472,"book":{"id":2472,"title":"Bethany\u0027s Sin","description":"Storyline: Set in a village in which the women get caught up in occult rituals and wholesale slaughter perpetuated in the name of the Amazon women, the goddess of the cult being incarnated in the form of the town\u0027s female mayor. The evil only happens at night - and only happens to men.\\n","cover":"https://allnovel.net/images/bethany-s-sin.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/bethany-s-sin.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:45:01 PM"}}
