{"id":70901,"no":24,"title":"Page 24","content":"“But this,” she said, holding up my Coke bottle, “is not something kids can take home to their mothers as a gift.”\n “I thought that since I’m the arts and crafts director, I get to choose the program. I don’t believe in censorship when it comes to art.”\n “I think the regional conference would be happier if kids could bring home presents to their moms. Why don’t you make more candles or something?” She gave my boxes of junk a junky look and left the pavilion.\n A little girl looked up at me, holding a baby food jar that she was covering with flowers. “Is this not really art?” she asked.\n “If you think it’s art, it’s art,” I replied, and breathed in deeply through my nose, trying not to shake.\n Here in the now, I keep drawing suns and pinwheels and waves.\n falling\n wednesday, june 20 ~ week 3 of 7\n I overdid it on my morning jog with Matt. With his help, I can run four miles again, but I don’t think my knee is cut out for long-distance running anymore, and that makes me want to cry.\n In high school, if I ever felt down about something, I would run and run and run, and now I can’t do that. I can’t clear my mind. I’m not part of a soccer team anymore.\n I also keep thinking of what happened with Matt on Sunday night.\n At first when I think of it, a smile flits across my face, but then I feel ashamed. These feelings confuse me, and I want to talk to Emily about it, but after what happened at her apartment, she hasn’t tried to call even once. Besides, she might say I’m childish—that everyone does that with their boyfriends. Matt hasn’t even brought it up.\n How is it possible to have a great boyfriend but still feel lonely?\n My art class with the campers just ended. We made candles by dripping wax into sand holes we dug, and then made stained-glass votives.\n Ever since she made that jewelry box, Parker has been coming to my art classes during her breaks. She doesn’t say much, because she doesn’t want me to get in trouble with Megan again, but she stuck around to help me clean up today.\n She sweeps sand into little piles while I store supplies on the shelves, hobbling back and forth from the tables to the cupboards.\n “Are you okay?” she asks.\n The moment she asks that, tears fill my eyes. The emotions just get to me. “I’m okay,” I say, staying in the closet until I get myself under control. I will not cry in front of her.\n Then she appears behind me and catches me wiping my nose.\n “Is your leg hurting?” she asks, looking at my scar.\n “Yeah…I’ve been running with Matt.”\n “Should you be running on it?”\n “My therapist said it should be okay, but I’m still trying to figure it out.”\n “I’m so sorry about soccer.”\n I focus on my watercolor of White Oak. “I’m sorry about your parents.”\n Parker bites on her lower lip and drags the broom across the floor. “It definitely sucked when they split up.”\n “I know we weren’t really friends before that happened, but I’m sorry.”\n She pauses. “It’s not your fault.”\n “I could’ve reached out, but…I didn’t understand why you were acting like you were, you know…hooking up with guys a lot. It scared me.”\n “It scared me too,” she admits, clutching the broom handle.\n “Will said your friends turned against you?”\n “Most of them, yeah. It was…hard. My best friend told everyone I was probably gay, like Mom.”\n My eyes water again. I don’t know whether it’s the pain from my knee or just my overall state of mind, but I can’t control my tears today. At all. “I lost my best friend.”\n Parker’s eyes grow wide. “Emily? From church?”\n I nod slowly.\n “What happened?”\n I avoid her stare and walk out of the closet. I stop to drum my fingers on a picnic table, dipping my fingers into the chipped wood where someone named Lily carved her name. “I’m dating Matt now,” I tell Parker, dropping the subject of Emily. “Like a real relationship.”\n Parker squeals and comes to hug me.\n “And?” she says.\n “And what?”\n “Have you guys kissed? Made out or anything?”\n I swallow and tell myself to ignore the other night. All of our clothes stayed on, but I could feel him through my shorts. It felt great. It felt wrong. “We’ve kissed, yeah.”\n She grins. “I’m so glad he picked you instead of that nasty Andrea!”\n I burst out laughing. I can’t help it. But I feel a little bit bad, considering Andrea helped Matt get through his breakup and ended up falling for him, even though she didn’t intend for it to happen.\n “She keeps going on and on about how she’ll be in Cabo at the same time as him,” Parker says.\n “Cabo?” I say quietly.\n “Mexico.”\n “I know where Cabo is, but what does Mexico have to do with Andrea and Matt?”\n “I guess his frat is going with her sorority to Mexico over the Fourth of July.”\n We have that week off from camp, but Matt hadn’t mentioned a trip. And he definitely did not mention a trip with Andrea!\n “He hasn’t said anything,” I tell Parker.\n “I’m sure that he just forgot,” she says, lifting a shoulder. “He’s a guy, right?”\n “What if—”\n Parker cuts me off, waving the broom at me. “He does not like her like that. Trust me. He could’ve had her already. He wants you!”\n I step to the edge of the pavilion and peer into the woods. “I can’t imagine a week with nothing to do,” I mumble. Mom and Daddy are going on that cruise and I’m staying home with Fritz the dog.\n “We can hang out,” Parker says, starting to sweep again.\n “With you and Will?”\n She glances up at my eyes, looking just as nervous as I feel. “No, like you and me. Don’t become one of those girls who’s super dependent on her boyfriend, okay?”\n I smile, and then she suggests we walk up to the cafeteria to get some ice for my knee.\n Later that morning after our swimming session, my group is drying off by the side of the pool. The campers are slapping each other with towels and acting like buffoons.\n “Kate,” Matt calls out from beside the pool maintenance closet.\n “Can you watch the kids for a minute?” I ask Ian, my co-counselor this week.\n A grin stretches across his face. “Nice. The pool shed is a good choice. Not as great as behind the cafeteria—”\n “Gross,” I interrupt, making him laugh.\n Ian goes back to scolding a boy for slapping girls with his towel. “When you get older,” Ian tells the boy, “these girls will remember that you smacked their butts and won’t want to date you. So stop it!”\n Glancing around to make sure Megan isn’t at the pool right now, I zip across the concrete to Matt.\n He scans my two-piece bathing suit, smiling, and rests a hand on my shoulder. His thumb grazes my neck as he bends down to whisper in my ear. “I got you something.”\n “Oh yeah?”\n He reaches for a shelf in the closet and picks up a four-leaf clover. “For you.” Matt gently sets it on top of my ear, like how women sometimes wear tropical flowers.\n “Thank you,” I whisper, thinking about how he’s like a four-leaf clover. Something you don’t find often. I’d be stupid to mess things up with him just because he’s in a frat, especially when everything else about him fits just right.\n He looks from the clover to my eyes. Based on his smile, which is full of friendship and something more, I doubt he’s thinking of Sunday night. He’s thinking of today. Today and me and not necessarily what’s next, but right now. Maybe he’s right—maybe I can see right through him.\n But if that’s true, why didn’t I know about Cabo?\n “I love the clover,” I say.\n “Maybe in trade you could give me your green beans at lunch today?”\n “Absolutely not,” I say with a laugh.\n He gives me a mischievous smile. “It was worth a shot.”\n “Hey, listen, can we talk?”\n His face goes serious, like my voice. “Now?” He looks over my shoulder at the towel fight. Ian practically has this kid in a headlock, trying to stop him from smacking another kid.\n “You’re right. Later is good.”\n He pulls me into the closet and rubs my stomach, dipping a finger into my bellybutton. “I’ll come by your cabin at midnight.”\n I give Matt a smile and go pry Ian off the camper.\n “You guys are fast,” Ian teases me.\n “Perv.”\n By the time midnight rolls around, I’ve bitten my pinky nail down to the quick. If I confront Matt about going to Cabo over the Fourth of July, will he think I’m one of those controlling girlfriends?\n I check to make sure the girls are asleep, then slip my feet into flip-flops and pad down the trail to my cookout area. Matt’s already there, playing his guitar. As soon as I walk up, he puts the guitar aside and then lifts me onto the table and stands between my legs. He kisses me deeply, exploring my mouth, his fingers grasping my knees.\n “Are you trying to distract me?” I ask, weaving my hands in his hair.\n “Is it working?” He kisses me again.\n “Yep,” I say, laughing.\n “So what’s up?”\n “I heard you’re going to Cabo? Parker told me.”\n He pulls a deep breath through his nose and hesitates for a second. “I can’t decide if I’m going.”\n “What does that mean?” I ask quietly.\n “I already paid for it. Before you.” He shuts his eyes. “Before we reconnected—before we started dating.”\n “You don’t want to go?”\n “I want to spend time with my brothers.” He means his fraternity. He continues, “I’ve always wanted to go surfing. But I don’t want to miss out on a week with you.” We kiss again. His lips are so warm and soft.\n “Why didn’t you tell me?”\n “I kept meaning to bring it up but wasn’t sure what to tell you…” He shrugs.\n “Parker said you probably forgot to tell me because you’re a guy.”\n “I take great offense to that. You are in big trouble.”\n I try to escape but he wraps me up in his arms. “You’re like a straitjacket,” I say, trying to break free.\n “A straitjacket of love.”\n I slap his chest. “I can’t believe you just said that. That’s the worst thing I’ve ever heard.”\n Does that mean he loves me?\n We are laughing and kissing and then he leans his forehead against mine. I drag my fingers across his lower back, beneath his shirt, and dip my fingers inside his shorts.\n “You should go surfing and be with your friends.”\n “Being away from you for a week will suck,” he whispers. He goes up my shirt while he kisses me, making me shake all over. My nipple hardens under his touch. My body feels like a rubber band ready to snap. \n","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-24.html","bookId":1968,"book":{"id":1968,"title":"Things I Can\u0027t Forget (Hundred Oaks #3)","description":"Storyline: \n Things I Can\u0027t Forget (Hundred Oaks #3) \n Companion to Catching Jordan and Stealing Parker. \n Kate has always been the good girl. Too good, according to some people at school—although they have no idea the guilty secret she carries. But this summer, everything is different… \n This summer she’s a counselor at Cumberland Creek summer camp, and she wants to put the past behind her. This summer Matt is back as a counselor too. He’s the first guy she ever kissed, and he’s gone from a geeky songwriter who loved The Hardy Boys to a buff lifeguard who loves to flirt--with her. \n Kate used to think the world was black and white, right and wrong. Turns out, life isn’t that easy…\n \n","cover":"https://allnovel.net/images/things-i-can-t-forget-hundred-oaks-3.jpg","author":"Miranda Kenneally","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:18:04 AM"}}
