{"id":70906,"no":29,"title":"Page 29","content":"“We can’t be together.” “No—” I stand up, pulling the sheet around me. “Kate—please.” “Just go! I can’t do this. Date you, I mean.” I can’t think straight when I’m with him. “Are we breaking up?” His voice shakes. “Yes,” I mumble, as new tears coat my face. He bends down and picks up his T-shirt to slip it over his head. His face contorts in pain. He bites his lips together and his eyes gloss over. “Please don’t—” I go into the bathroom, still wearing the sheet around me like a beach towel, locking the door, sitting down on the toilet. He bangs on the door and says my name. Over and over. Fritz starts barking. I lean onto my knees and count the tiny sky blue tiles because it’s the only thing I know to do. After I don’t know how long, the knocking ends. His voice goes away. When I come out of the bathroom, I pull on a bathrobe and find Fritz moving in circles. I discover a note written in Matt’s shaky cursive, lying on my bed. I care about you more than anything. What did I do wrong? Please, let’s not do this. I don’t completely understand what that last line means. But it doesn’t matter. God tested my faith, and I failed. something i can never draw what happened on april 27 The sun was rising when I picked Emily up at her house. She told her mom she was riding with me to school, but really we drove to the women’s center in Nashville. I stopped at a Walgreens, to buy all of her favorite candies. Sour Patch Kids, Twizzlers, Jolly Ranchers. She clutched the arm rest and her lower lip trembled. I kept reaching over to squeeze her hand. I turned on the classical radio station for her. I listened to her sniffle. Watched the tears fall from her eyes. I handed her Kleenex after Kleenex. At the clinic, a nurse escorted us into an exam room, and I helped Emily take her clothes off and slip on a flimsy paper robe. I folded her shirt, bra, underwear, and jeans into a pile. I passed her more Kleenex and tried to ignore the smell. It was probably all in my mind but I felt like chemicals were burning the inside of my nose. A woman came in and asked Emily if she was sure, if she had explored all her options. “Did you think deeply about this? Did you discuss it with the father?” “Yes,” Emily lied. I don’t think Emily’s responses would’ve changed anything, but the counselor had to ask the questions. I never stopped holding Emily’s hand except for when the doctor made me. I couldn’t stop closing my eyes. I kept thinking of my butterfly paintings, how colors drip from the wings. The doctor gave Emily a sedative and she finally loosened up. The tears dried up somewhat. It was over in ten minutes. I can’t forget. where heaven meets the earth july 8 ~ week 5 of 7 My weekend just got worse. “Let’s go over group assignments for this week,” Megan says. “Eric, you’ve got the all-boys group. Ian, your partner is Parker. Will, you’re with Carlie. Andrea is with Brad. Matt, you’re with Kate.” I glance up. He looks hurt and pissed. He must’ve called a hundred times since yesterday, and he wrote me ten emails, repeating over and over how much he cares for me, wanting to know what he did wrong, telling me he misses me already. On one voicemail he said, “Is this ’cause I haven’t taken you to Just Tacos yet? Because we can fix that right now.” He laughed softly into the phone and quietly said, “Seriously, though? I want to fix whatever went wrong between us. Can we talk? You’re the most important thing, um…” He cleared his throat. Stayed silent. “Please call me back.” I saved the voicemail and started crying all over again. I barely pay attention during the staff meeting. Everyone decides to grill hot dogs for dinner, but I’m not hungry. I excuse myself and haul my sleeping bag and suitcase over to Bluebird in Birdland. There, I turn out the lights, curl up in bed, and try not to think, even though the sun hasn’t completely set. I can’t even cry because I’m so confused and upset and my mind is whirring thoughts around like the box fan. I’m a hypocrite. I can’t imagine living without Matt. I couldn’t imagine living without Emily, either, but I’ve survived the past two months. It’s nearly midnight when I hear the knock on the door. Is it him? I hope it is, but I hope it isn’t. “Yeah?” I call out with a faint voice. “Can I stay with you tonight?” It’s Parker. I climb out of the rickety bed and pad to the screen door. A humid mist hangs around the porch light. She studies my face, which is probably swollen and covered in red blotches. I let her in, and she unrolls her sleeping bag across the bed next to mine. “Where’s Will?” ☺ “Sleeping in Dogwood with everybody else.” She fluffs her pillow and kicks off her flip-flops. “Wouldn’t you rather be with him?” The corner of her mouth lifts. “I always want to be with him. But I thought we could hang out tonight.” “Why?” “I’m worried about you. Will told me that Matt said y’all broke up.” I chew on my lip and crawl on top of my sleeping bag. Parker flips the light off and we lie down. Matt is the last thing I want to talk about. “What are you majoring in at college?” I ask, watching a shadow dance on the ceiling. Her bed creaks as she gets comfy. “Biology. I want to become a vet, I think…You?” “I dunno.” I play with the zipper on my sleeping bag. The fan blows warm air across my face. “I’ve been thinking of design. Or something.” “That sounds good. You’ve got the artistic skills.” My heart swells and I nearly reach to squeeze her hand. “Thank you,” I whisper. I listen to the crickets and try not to think about anything important. I always think about Matt when I have nothing to distract me. Tomorrow is Chicken O’ Rings Day. It’s so hot in here, I could go creek stomping right now, just to cool off. If I were the camp director, I’d get new mattresses for the cabins. “What happened, Kate? Everything seemed to be going great for you and Matt. Did he do something wrong?” “Nah…but I did.” She pauses. “He wants to work things out with you.” “I can’t think about it right now, okay?” “Okay.” She rolls over to face the wall. I fold my hands behind my head and bite down on my tongue to distract myself from the pain in my heart. “Parker?” I say into the dark. “Hmm?” “What do you think of evolution? Do you believe in God?” She goes silent for a bit. “That’s a pretty personal question…” I bite into my lip. She adds, “I do believe in God, but my relationship with him is private…” “Oh.” “It’s nothing against you…I just don’t like to talk about it anymore…with anybody. I don’t even talk about it with my parents anymore. Or with Will.” I smile slowly. “Thanks for telling me that.” “I think that religion is a personal thing. It’s hard for me to share.” Matt prays and wears a cross but still goes to parties. He hangs out with people who drink. He worships God but does it in his own way. Just like Parker. That isn’t to say that what Brother Michael and Brother John preach at church is wrong, but what if it’s different for different people? I’ve wondered if it’s okay to worship somewhere in the middle. But can I fit these people who worship in the middle into my life? Can I hang out with people who don’t believe in God at all? It’s not like they’re that much different from me, really. That’s when I hear the noise. Another knock on the door. “Park?” I hear Will say. “You okay?” She sits up and a smile flits across her face. She goes to the door, where she puts a hand up to the screen and he traces her fingers as they talk quietly. I can hear her explaining that I don’t need any guys hanging around tonight upsetting me, and I say a quick prayer, thanking Him for her. The friend who became a friend when I wasn’t paying attention. And like that night Matt slept on the porch, Will drags a bed through the door and drops it onto the deck with a thud. Then he comes back in and drags another bed through the door. Parker asks, “Why do you need two beds?” “One’s for Matt. His idea, not mine.” I suck in a deep breath. Matt doesn’t speak, but he’s out there. Soon everyone is settled in their beds, and all I can hear are crickets and frogs and other animals. Parker speaks again. “I love you, Will.” “Love you too,” he replies. She must’ve told him this weekend. Or did he tell her first? My stomach leaps into my throat. I want to hear Matt say those words so bad. I wish God would tell me what to do. If I should be with Matt or if I made a big mistake when I sinned. Why would God give me Matt, someone who makes me feel so good, only to take him away? Would God really do something that selfish and mean to me? I scrunch my pillow under my head, and the memory of our first kiss plays over and over in my mind. When Matt speaks to me, it’s not to tell me he loves me, but somehow it’s even better. “Kate, I’m here.” On Monday morning before the new group of campers arrive, I’m out jogging laps around the big field under a humid sunny sky when Brad runs up next to me. “I’m sorry,” he says. “I don’t want to talk about Matt,” I reply. “No.” Brad shakes his head and even though we’re running, he snaps his eyes shut. “I did something stupid…” Honestly, right now, I don’t care about anything except that I’m not dating Matt anymore, but the pull to be a good friend is greater. “What’d you do?” “Yesterday morning I was down at the lake, fishing for my breakfast, and the guy who mows the grass saw me. He knows I was here on a weekend. He told on me to Megan. I told her that you and I were here together—” “I might get fired!” “You won’t, you won’t,” he stutters. “I told her it was all my idea. I told her you wanted to learn to fish better, so I agreed to meet you here early to practice—” “I can’t believe you!” I touch my forehead. “You could have asked first—” “I didn’t have time—she put me on the spot and I’m telling you now.” “Did she fire you?” “Not yet.” He bites into his upper lip. “You used me…” I fold my arms across my stomach. That’s when Megan appears on the trail. She blows her whistle, shouts, “Kate!” and beckons me toward her cabin. I wipe the sweat off my forehead with my T-shirt and climb the Great Oak steps, then pull the screen door open and sit beside Megan’s desk. She settles in her chair and twirls her whistle, regarding me.","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-29.html","bookId":1968,"book":{"id":1968,"title":"Things I Can\u0027t Forget (Hundred Oaks #3)","description":"Storyline: Things I Can\u0027t Forget (Hundred Oaks #3) Companion to Catching Jordan and Stealing Parker. Kate has always been the good girl. Too good, according to some people at school—although they have no idea the guilty secret she carries. But this summer, everything is different… This summer she’s a counselor at Cumberland Creek summer camp, and she wants to put the past behind her. This summer Matt is back as a counselor too. He’s the first guy she ever kissed, and he’s gone from a geeky songwriter who loved The Hardy Boys to a buff lifeguard who loves to flirt--with her. Kate used to think the world was black and white, right and wrong. Turns out, life isn’t that easy…","cover":"https://allnovel.net/images/things-i-can-t-forget-hundred-oaks-3.jpg","author":"Miranda Kenneally","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:18:04 AM"}}
