{"id":35305,"no":15,"title":"CHAPTER XII THE WITNESS","content":"The probative value of all honestly given testimony depends, naturally, first upon the witness\u0027s original capacity to observe; second, upon the extent to which his memory may have played him false; and third, upon how far he really means exactly what he says. This is just as true of testimony in cases of so-called circumstantial evidence as in cases where the evidence is direct, for the circumstances themselves must be testified to by witnesses who have observed them, and the authoritativeness of everything these witnesses have to say must lie in their ability to see, remember, and describe accurately what they have seen. The subject of perjury is so distinct and far-reaching that it deserves separate consideration. The crime is easy to commit and difficult to establish by competent proof, for it is a highly technical offence and one which juries seem to find it easy to condone. The brother or friend of the accused has but to take the stand and swear to an alibi and lo! he is free. The chance of detection is small in comparison with the immediate benefit secured, while the temptation to swear falsely must, at least in the case of the immediate family of the prisoner, often be overwhelming. Where convictions for perjury are secured heavy sentences are invariably imposed and a wholesome apprehension instilled into the hearts[Pg 225] of prospective witnesses, yet the amount of deliberate false swearing in our criminal courts would be inadequately described as shocking. To estimate its quantity would be difficult if not impossible, for it varies with the character of the case and the nature of the defence. When the latter is an alibi the entire testimony for the prisoner is frequently manufactured out of whole cloth, and it is probably not very wide of the mark to say that anywhere from a quarter to seventy-five per cent of the testimony offered by the defendant\u0027s witnesses upon the direct point in issue in the ordinary run of criminal trials is perjured. Yet a careful scrutiny of even the honestly given testimony in such cases gives rise to the belief that the amount of strictly accurate evidence adduced is relatively small, so small as probably to stagger the credulity of the layman and to give the lawyer ground for reflection. It must be borne in mind, however, that this refers to criminal trials only and to testimony of a character closely relevant to the issue. The first consideration is how far the witness was originally capable of receiving correct impressions through his senses. Naturally this depends almost entirely upon his physical equipment and the keenness and accuracy of his general observation, both of which are usually evidenced to a considerable degree by his appearance and conduct upon the stand. Children are proverbially observant, and make remarkable witnesses, habitually noticing details which inevitably escape the attention of their elders; while various classes of persons by reason of their[Pg 226] professional requirements are, of course, better qualified than others to observe certain facts or conditions, as a gem merchant the shape and cutting of a diamond, or a doctor the physical condition of a patient. Witnesses are often honestly mistaken, however, as to their own ability to observe facts, and will unhesitatingly testify that they could hear sounds and discern objects at extraordinary distances. Lawyers frequently attempt to induce aged or infirm witnesses to testify that they could hear plainly what was said by the defendant, in an ordinary tone, at a distance, say, of forty feet. The lawyer speaks in loud and distinct tones during the preliminary examination, and then gradually drops his voice to that usually employed in speaking, in the hope that the witness will ask him to repeat the question. This ruse usually fails by reason of the fact that the lawyer, in his anxiety to show that the witness could not possibly hear the distance claimed, lowers his voice to such an extent that the test is obviously unfair. For similar reasons counsel often call upon such witnesses to state the time by the clock which usually hangs upon the rear wall of the court-room. A distinguished but conceited advocate, not long ago, after securing an unqualified statement from an octogenarian, who was bravely enduring cross-examination, that he \"saw the whole thing as if it had occurred ten feet away,\" suddenly challenged him to tell the time by the clock referred to. The lawyer did not look around himself, as he had done so about half an hour before, when he had noticed that it was half after eleven. The old man looked at the clock[Pg 227] and replied, after a pause, \"Half-past eleven,\" upon which the lawyer, knowing that it must be nearly twelve, turned to the jury and burst into a derisive laugh, exclaiming sarcastically, \"That is all,\" and threw himself back in his seat with an air of having finally annihilated the entire value of the witness\u0027s testimony. The distinguished practitioner, however, found himself laughing alone. Presently one of the jury chuckled, and in a trice the whole court-room was in a roar at the lawyer\u0027s expense. The clock had stopped—at half-past eleven. The professional actor upon the stage presents the illusion of nature by exaggerating those details of action which ordinarily would escape the attention of the observer. In daily life we are quite as likely as not to be deceived by what we have seen, and this fact is so familiar to jurors that they are apt to distrust witnesses who profess to have seen much of complicated or rapidly conducted transactions. They want the main facts stated convincingly. The rest can take care of themselves. The extraordinary extent to which the complex development of modern life has dwarfed our powers of observation is noticeable nowhere more markedly than in the court-room. Things run so smoothly, transportation facilities are so perfect, specialization is carried to so high a degree, and our whole existence goes on so much indoors, that it ceases to be a matter of note or even of interest that the breakfast is properly cooked and served, that we are whisked downtown (a little matter say of five miles) in ten or twelve minutes, that we are shot up to our offices through twenty floors in an electric elevator, that there is a blizzard or a[Pg 228] deluge, or that part of Broadway has been blown up or a fifteen-story building fallen down. We pass days without paying the remotest attention to the weather, and forget that we have relations. Instead of walking home to supper, pausing to talk to our friends by the way, we drop into the subway, bury ourselves in newspapers, and are vomited forth almost without our knowing it at our front doorsteps. The multiplicity of detail deprives us of either the desire or the capacity to observe, and we cultivate a habit of not observing lest our eyes and brains be overwhelmed with fatigue. Observation has ceased to be necessary and has taken its place among the lost arts. Compare the old days when a Greek could go to hear the \"?dipus,\" and on returning home could recount practically the whole of it from beginning to end for the benefit of the wife, who was not allowed to go herself, or even the comparatively recent period when the funeral oration over Alexander Hamilton could be reported in the \"Evening Post\" from memory. Much the more difficult problem, however, is to determine how far the witness is the victim of his memory and is unconsciously confusing fact with imagination, or knowledge with belief. It is a matter of common experience that almost all cases are stronger in court than they give the impression of being when the witnesses are first examined in the private office. Time and again, cases which in the beginning have seemed hopeless to prosecute have resulted in verdicts of conviction, and defences originally so fragile as to appear but gossamer have returned many a defendant to his despairing family. [Pg 229] The reason is not far to seek. Witnesses to the events leading up to a crime are acquainted with a thousand details which are as vivid, and probably more vivid, to them than the occurrence in regard to which their testimony is actually desired. It may well be that the immaterial facts are the only ones which have interested them at all, while their knowledge of the criminal act is relatively slight. For example, they know, of course, that they were in the saloon; are positive that the complainant and defendant were playing cards, even remembering some of the hands dealt; are sure that the complainant arose and walked away; have a very vivid recollection that in a few moments the defendant got up and followed him across the room; are pretty clear, although their attention was still upon the game, that the two men had an argument; and have a strong impression that the defendant hit the complainant. In point of fact, their evidence is really of far less value, if of any at all, in regard to the actual striking than in regard to the events leading up to it, for at the time of the blow their attention was being given less to the participants in the quarrel than to something else. Their ideas are in truth very hazy as to the latter part of the transaction. However, they become witnesses, pronouncing themselves ready to swear that they saw the blow struck, which is perhaps the fact. Their evidence is practically of no value on the question of justification or self-defence. But finding, on being examined, that their testimony is wanted principally on that aspect of the case, they naturally tell their entire story as if they were as clear in their own minds upon one part of it as another. Being able to give details as to the[Pg 230] earlier aspect of the quarrel, they feel obliged to be equally definite as to all of it. If they have an idea that the striking was without excuse, they gradually imagine details to fit their point of view. This is done quite unconsciously. Before long they are as glib with their description of the assault as they are about the game of cards. They get hazy on what occurred before, and overwhelmingly positive as to what occurred towards and at the last, and on the witness-stand swear convincingly that they saw the defendant strike the complainant, exactly how he did it, the words he said, and that the complainant made no offer of any sort to strike the defendant. From allowing their minds to dwell on their own conception of what must have occurred, they are soon convinced that it did occur in that way, and their account flows forth with a circumstantiality that carries with it an irresistible impression of veracity. The witness remembers in a large proportion of cases what he wants to remember, or believes occurred. The liar with his prepared lie is far less dangerous than the honest, but mistaken witness, or the witness who draws inadvertently upon his imagination. Most juries instinctively know a liar when they see and hear one, but few of them can determine in the case of an honestly intentioned witness how much of his evidence should be discarded as unreliable, and how much accepted as true. The greatest difficulty in the trial of jury cases so far as the evidence is concerned lies in the fallibility of the human mind, and not in the inventive genius of the devil. An old man who combines a venerable appearance with a failing memory is the witness most to be feared by either side. [Pg 231] In a recent case a patriarch of some eighty-five years positively, convincingly, and ultra-dramatically identified the defendant as a man who had knocked him down and robbed him of a ring. The identification was so perfect that on the evidence of this aged witness alone the jury convicted the defendant after but a few moments\u0027 deliberation. He was sentenced to ten years in State\u0027s prison, although he denied vehemently that he had ever seen the complainant. As he was being led from the bar, the real criminal arose among the audience and gave himself up, stating that he could not sit by and see an innocent man receive so great a punishment. The inference was, that had the sentence been lighter his conscience would not have pricked him sufficiently to sanction his act of self-sacrifice. In cross-examination lies the only corrective of this sort of specious testimony, but it would be manifestly inadequate to prevent injustice in such an instance as that just described. Juries must and do take the evidence of most well-intentioned witnesses with a grain of salt. Both men and women habitually testify to facts as actually occurring on a specific occasion because they occurred on most occasions: Q. \"Did your husband lock the door?\" A. \"Of course he did.\" Q. \"How do you know?\" A. \"He always locks the door.\" Witness after witness will take the stand and testify positively that certain events took place, or certain acts were done, when in point of fact all they can really swear to is that they usually took place or usually were done: [Pg 232] Q. \"Did he put on his hat?\" A. \"Certainly he did.\" Q. \"Did you see him?\" A. \"No, but he must have put on his hat if he went out.\" And the probability is that the whole question to be determined was whether or not \"he\" did go out or stay in. The layman chancing to listen to a criminal trial finds himself gasping with astonishment at the deluge of minute facts which pour from the witnesses\u0027 mouths in regard to the happenings of some particular day a year or so before. He knows that it is humanly impossible actually to remember any such facts, even had they occurred the day before yesterday. He may ask himself what he did that very morning and be unable to give any satisfactory reply. And yet the jury believe this testimony, and because the witness swears to it it goes upon the record as evidence of actual knowledge. In ninety-nine cases out of a hundred counsel\u0027s only recourse is to argue to the jury that such a memory is impossible. But in the same proportion of cases the jury will take the oath of the witness against the lawyer\u0027s reasoning and their own common-sense. This is because of the fictitious value given to the witness\u0027s oath by talesmen who attach little significance to their own. \"He swears to it,\" says the juryman, rubbing his forehead. \"Well, he must remember it or he wouldn\u0027t swear to it!\" And the witness probably thinks he does remember it. Yet who of us could state with certainty the guests at a particular dinner six months ago? Or the transactions of a morning only a week ago, with any accu[Pg 233]racy as to time? What the witness frequently does is to discuss the matter with his friends who were present on the occasion in question, and, as it were, form a sort of \"pool\" of their common recollections, impressions, and beliefs. One suggestion corrects or modifies another until a comparatively lucid and logical story is evoked. When this has been accomplished the witness mentally exclaims: \"Of course! That was just the way it was! Now I remember it all!\" The time is so distant that whatever the final crystallization of the matter may be, it is far from likely that it will thereafter be shown to be inaccurate by any piece of evidence which will present itself to the witness and his friends. The account thus developed by mutual questions and \"refreshing\" of each other\u0027s recollection becomes, so far as the parties to it are concerned, the fact. The witness is now positive that he did and said exactly so and so, and nothing will swerve him from it, for inherently there is nothing in the story or its make-up that affords any reason for questioning its accuracy. This story repeated from time to time becomes one of the most vivid things in the witness\u0027s mental experience. He repeats it over and over, is cross-examined by his own attorney upon it, incorporates it in an affidavit to which he swears, and when he takes the stand recounts these ancient happenings with an aggressiveness and enthusiasm that bring dismay to the other side. But what a farce to call this recollection! What is this circumstantial romance when it comes to be analyzed? Jones, a friend of Smith the prospective witness, is anxious to establish an alibi, and asks Smith if he doesn\u0027t remember meeting him in the[Pg 234] club on February 12, two years before. Smith has no recollection of it at all, but Jones says: \"Oh, yes, you were going to the theatre with Robinson.\" Of course, if Jones is so sure, Smith naturally begins to think it is probably the fact, and he does remember vaguely that he and Robinson spent an evening together. So he consults his diary and finds it recorded there that he did attend the theatre on the day in question with Robinson. He does not remember the play, but Robinson recalls that it was \"The Chinese Honeymoon,\" and believes that they dined together first at the club. Smith now thinks he remembers this himself. Then Robinson suggests that they probably went to the theatre in a cab. They look in a file of old papers and find that it was raining. That settles it—of course, they went in a cab. The next question is the hour. They have no recollection of being late, so they must have arrived on time. Well, the paper says the play commenced at eight, and it takes a cab about twenty minutes to get from the club to Daly\u0027s Theatre, so it is reasonably clear that they must have started a little before eight. Smith unconsciously is persuaded to believe that if Jones was right about their going to the theatre, he must also have been in the club at the time he says he was there. Both he and Robinson recall that Jones was always hanging round the club two years ago, and as neither can remember an evening when he wasn\u0027t there, they decide he must have been there that night. Robinson has a dim recollection that they had a drink together. That is a pretty safe guess and has all the air of verisimilitude. In an hour or two Smith is ready to swear positively from recollection that he dined with Rob[Pg 235]inson at the club on February 12 two years ago, met Jones, had a drink with him, that this occurred at seven fifty-five, that it was raining, that they took a cab, etc., etc. In its elements this testimony is entirely hearsay upon the only vital point, i.e., Jones\u0027s presence in the club at that time, and the immaterial remainder is made up of equal parts of diary, newspaper, play-bill, weather report, usual custom, reliance on Robinson\u0027s alleged recollection, and belief in Jones\u0027s innocence. He has practically no actual memory of the facts at all, and the only thing he really does remember is that a long time ago he did attend some theatre with Robinson. The common doctrine of what is known as \"refreshing the memory\" in actual practice is notoriously absurd. Witnesses who have made memoranda as to certain facts, or even, in certain cases, of conversations, and who have no independent recollection thereof, are permitted to read them for the purpose of \"refreshing\" their memories. Having done so, they are then asked if they now have, independently of the paper, any recollection of them. In ninety-nine cases out of a hundred it would be absolutely impossible for them really to remember anything of the sort. They read the entry, know it is probably accurate, and are morally convinced that the fact is as thereon stated. They answer yes, that their recollection has been refreshed and that they now do remember, and are allowed to testify to the fact as of their own knowledge. In most instances they do not clearly understand the distinction they are called upon to draw between actual independent recollection and a strong belief on their own part that the fact must be as recorded. It is the ex[Pg 236]ceptional witness indeed who makes any such distinction. There are also many cases where a defendant has been put in jeopardy because some one, remembering that he intended to do an act, becomes convinced that he has done so, to the extent of being willing to swear thereto. No better illustration of this kind of error could be given than the disappearance of the famous necklace of a prominent resident of Newport during the summer of 1904. There lives hardly a family which has not frequently had such an experience. Some night the husband can\u0027t find his pearl shirt-studs. He knows he had them on the evening before. The hue and cry is raised. Maledictions are called down upon Anna or Delia or Nora. But the studs are not in the shirt. Their owner swears he left them there. Then Delia tremblingly suggests that \"master dined in his ordinary clothes last evening,\" and he realizes that it was so late when he got home that at the last minute he decided not to change. Amid great excitement the studs are located in the bureau drawer where they belonged. The final question to be determined by the juror in regard to the testimony of any witness is how far the latter has succeeded in conveying his actual recollections through the medium of speech and gesture. This necessarily depends upon a variety of considerations. Among these are his familiarity with the English language; inadvertent accentuation of wrong words or of the less important features of his testimony; his physical condition, which in nine cases out of ten is one of extreme nervousness and timidity, if not of actual fear; and a hundred other trifling, but, in the aggregate, material matters. [Pg 237] The most effective testimony is that which is given with what the jury regard as the evidences of candor. It is a familiar fact that the surer a person is of anything, particularly among the laboring classes, the more loudly will he assert its truth. This is so well known to the jury as ordinarily constituted that unless testimony is given with positiveness it might as well not be given at all. Much as it is to be deprecated, an assertive lie is of much more weight with a jury than an anemic statement of the truth. The juror imagines himself telling the story, and feels that if he were doing so and his testimony were true, he would be so convincing that the jury could have no doubt about it at all. Ofttimes a witness leads the jury to suspect that he is a liar simply because he has too strong a sense of the proprieties of his position vehemently to resent a suggestion of untruthfulness. The gentleman who mildly replies \"That is not so\" to a challenge of his veracity, makes far less impression on the jury than the coal-heaver who leans forward and shakes his fist in the shyster\u0027s face, exclaiming: \"If ye said that outside, ye little spalpeen, I\u0027d knock yer head off.\" \"Ah,\" say the jury, \"there\u0027s a man for you.\" Just as your puritan is at a disadvantage in an alehouse, and your dandy in a mob, so are the hyper-conscientious and the oversensitive and refined before a jury. The most effective witness is he whom the general run of jurors can understand, who speaks their own language, feels about the same emotions, and is not so morbidly conscientious about details that in qualifying testimony he finds himself entangled and rendered helpless in his own refinements. A distinguished lawyer testifying in a recent case was so[Pg 238] careful to qualify every statement and refine every bit of his evidence that the jury took the word of a perjured loafer and a street-walker in preference. This kind of thing happens again and again, and the wily witness who thinks himself clever in appearing overdisinterested is \"hoist by his own petard.\" The jury at once distrust him. They feel either that he is making it all up, or is in fact not sure of his evidence, else, they argue, he would be more positive in giving it. Most witnesses in the general run of criminal cases have no comprehension of the meaning of words of more than three syllables. It is hopeless to make use of even such modest members of our national vocabulary as \"preceding,\" \"subsequent,\" \"various,\" etc. A negro when asked if certain shots were simultaneous replied: \"Yas, boss. Dat\u0027s it! \u0027Zactly simultaneous! One right after de odder.\" The ordinary witness usually says \"minutes\" when he means \"seconds.\" He will testify without hesitation that the defendant drew his revolver and immediately shot the complainant, illustrating on the stand the rapidity of the movement. When asked how long it took, he will answer: \"Oh, about two or three minutes.\" A proper medium in which to converse between the lawyer and witness is sometimes difficult to find, and invariably much tact is required in handling witnesses of limited education. The writer remembers one witness who was completely disconcerted by the use of the word \"cravat,\" and at the precise moment the attorney was so confused as not to be able to remember any synonym. The Tenderloin[Pg 239] and the Bowery have a vocabulary of their own differing somewhat from that of beggars and professional criminals. The language of the ordinary policeman is a polyglot of all three. Popular writers on the \"powers that prey,\" and dabblers in criminology in general, are apt to become the victims of self-alleged \"ex-convicts\" and \"criminals\" who are anxious to sell unreliable information for honest liquor. A large part of the lingo in realistic treatises on prison life and \"life among the burglars,\" originates in the doped imagination of whatever fanciful \"reformed\" thief happens to be the personal gold mine of that particular author. Thieves, like any distinct class, make use of slang, some of which is peculiar to them alone. But for the most part the \"tough\" elements in the community make themselves easily understood either in the office or on the witness-stand. Where the witness speaks a foreign language the task of discovering exactly what he knows, or even what he actually says, is herculean. In the first place interpreters, as a rule, give the substance—as they understand it—of the witness\u0027s testimony rather than his exact words. It is also practically impossible to cross-examine through an interpreter, for the whole psychological significance of the answer is destroyed, ample opportunity being given for the witness to collect his wits and carefully to frame his reply. One could cross-examine a deaf-mute by means of the finger alphabet about as effectively as an Italian through a court interpreter, who probably speaks (defectively) seventeen languages. The reader might perhaps conclude from what has been said that the action of the ordinary jury in most[Pg 240] cases must be founded simply upon shrewd guesswork. To a certain degree this cannot be denied, and it is equally true that all the delicate processes of the human mind, and the shadowy presences there of intent, motive, and recollection, can never be demonstrated save by inference. Our machinery is crude indeed. Ofttimes it is like trying to dissect a butterfly with a pair of pincers, and the wonder is that the jury are able to get at the truth as frequently as they do. Hence the necessity for the advocate to assist the jury and remedy their ignorance of the psychology of testimony by his own observation, knowledge, and experience. With the jury keenly alive to all the possibilities of error in the testimony of even the most honest of witnesses, it is for the advocate, the psychologist of the law, to test by his cross-examination and demonstrate in his summing up the precise probative value of the evidence, frequently revealing, below an apparently limpid stream of truth, a turbid bed of conjecture, assumption, belief, hearsay, and inaccuracy of expression, with the rank weeds of perjury growing just beneath the surface. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2765/76313.html","bookId":1337,"book":{"id":1337,"title":"The Prisoner at the Bar","description":"简介： The favorable reception accorded to the Prisoner at the Bar, not only in the United States but in England, and the fact that it has won a place in several colleges and law schools as a reference book, and in some instances as a sort of elementary tex...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2765","creation":"Aug 1, 2019 12:24:53 AM","modification":"Aug 1, 2019 12:24:53 AM"}}
