{"id":33473,"no":34,"title":"CHAPTER XXXIV. TWO POWWOWS.","content":"AT A SIGNAL from the chief all three prisoners were bound and placed on the ground close by. \n \n Then the Indians, resuming their sitting positions, had a powwow, or, as we should say, deliberated. Though the three captives could not understand their speech, they readily inferred that they were the subjects of discussion, and that their fate was being decided. This, indeed, might be inferred from the occasional glances cast toward them by the different speakers. \n \n There was one circumstance, however, that puzzled them, and naturally. Reference was also made to the sick boy. This they also inferred from the looks which he attracted. \n \n “They are talking about us, doctor,” said Peter Brush, in a low voice. \n \n “Yes, but they are also talking of the boy.” \n \n “You don’t understand them, do you?” \n \n “Only an occasional word. I know the Indian word for boy, and they have used that several times.” \n \n “They may mean Tom.” \n \n “That is what I thought at first, but I observed that whenever they use the word, they either point or glance at the sick boy in the center.” \n \n 180 \n \n “That’s curious. I can’t see what he has to do with us.” \n \n “Nor I.” \n \n “What do you suppose they will do with us?” \n \n “Don’t let us think of unpleasant subjects, friend Brush. There’s one comfort—my scalp is pretty safe.” \n \n “But mine isn’t,” said Brush, sadly running his hand through his bristling hair. It was not ornamental, but Peter Brush was attached to it, and the thought that he might lose it strengthened the value he set upon it. \n \n “Tom, what are you thinking about, my lad?” asked Brush. \n \n “I am thinking that we are in a tight place,” answered Tom, soberly. \n \n “Keep a stiff upper lip, lad. We ain’t past hope.” \n \n “God may help us,” said Tom, reverently. \n \n Peter Brush scratched his head reflectively. \n \n “I am sorry to say, lad, that I never gave much thought to Him. My mother used to tell me about God when I was a little chap, but I’ve spent most of my life away from churches, and I don’t know much about anything but this earth.” \n \n “Surely you believe there is a God, Mr. Brush?” \n \n “Yes, Tom, but I don’t feel as if I had much to do with Him. If you think He will help us, just ask Him.” \n \n “I have been asking him in my own thoughts,” said Tom, “and I have a feeling that somehow help will come to us.” \n \n “We stand in precious need of help from some quarter. I wish I could make out the Indian palaver.” \n \n 181 “We shall know in due time, friend Brush,” said Lycurgus Spooner; “perhaps sooner than we care to.” \n \n “Do you think they will do anything to us to-night, Dr. Spooner?” asked Tom. \n \n “No; such is not their custom. They have had their council. They will do nothing till the night is over. We shall be allowed a good night’s sleep.” \n \n “I don’t expect to sleep a wink all night,” said Peter Brush, in a lugubrious tone. “I shall be thinking all the while how it feels to be scalped.” \n \n “That won’t tend to make your dreams pleasant, friend Brush. My advice is, that whatever is to come, you try to sleep well. It will strengthen you, either to devise means of escape, or, if need be, to meet your fate.” \n \n “It’s all very well to give that advice, doctor, but not being a cold-blooded animal, I sha’n’t find it easy to follow. Suppose you were going to be hung to-morrow morning—how do you think you could sleep?” \n \n “No such fate as that is in store for us, at any rate. People are hung only in civilized communities. Did you ever hear of a man shipwrecked on a territory entirely unknown to him, who in the course of his first walk came to a man hanging upon a gallows? ‘Thank heaven!’ he said, ‘I am in a civilized country!’” \n \n Tom and Mr. Brush laughed in spite of the peril that menaced them, and this unexpected sound drew the wondering attention of the Indians. Indeed, it increased their respect for their captives. It was clear that they were not cowards or they would not laugh under such circumstances. \n \n 182 But the merriment of our three friends was short-lived. They became silent and thoughtful, and as they gazed at the flickering flames, and the shadows grew darker, all were impressed by the gravity of the situation, and the uncertain tenure by which they held their lives. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2060/58645.html","bookId":568,"book":{"id":568,"title":"Tom Thatcher\u0027s Fortune","description":"简介： The speaker was a sturdy boy of sixteen, with bright eyes, and a smiling sun-browned face. His shirt sleeves were rolled up displaying a pair of muscular arms. His hands were brown and soiled with labor. It was clear that he was no white-handed young...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2060","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
