{"id":33483,"no":44,"title":"CHAPTER XLIV. A WONDERFUL DISCOVERY.","content":"IN THE upper part of San Francisco, where now stand fine mansions, there were at the time of my story, only a few small and modest houses, with land enough attached for a kitchen garden. \n \n One of these was occupied by David Temple, employed as a clerk in the city. In his family for years Robert Thatcher had made his home. \n \n He was at work in the garden—a man of about fifty, but looking considerably older on account of his hair, which had become prematurely whitened. His figure was slightly bent, and his face was embrowned by exposure. Physically he looked well, but in his face there was something wanting. His intellect was clouded, but many had conversed with him for an hour at a time without ascertaining the fact. \n \n On many subjects Mr. Thatcher was sane, but on others his memory was at fault. This was especially the case when his own history was referred to. A veil seemed to shut out all that part of his existence which preceded his coming to California. \n \n “Where did you live before coming to this State, Mr. Thatcher?” asked a visitor one day. \n \n “Eh?” asked Thatcher, looking puzzled. \n \n 229 \n \n The question was repeated. \n \n A troubled look overspread the face of the stricken man, as he answered slowly: \n \n “I don’t know.” \n \n “Don’t know?” was the amazed rejoinder. \n \n “No, I can’t seem to remember.” \n \n The visitor was called away, and privately informed of Mr. Thatcher’s peculiarity. \n \n The Temple family took special care to avoid all disquieting allusions. They never in conversation referred to their guest’s past history, at least to that part of his life which preceded his arrival on the Pacific coast. \n \n All these particulars were communicated to Tom by Mr. Percival when they were on their way to the city. \n \n “Don’t you think there is any chance of father’s recovery?” asked our hero, considerably troubled. \n \n “Yes I believe the sight of you will have a powerful effect.” \n \n “But I was only a little boy when father left us. He will hardly be able to see any resemblance between me and the little boy he left behind him.” \n \n “Tell him your name. Speak to him of your mother and sister; it may awaken old memories and associations.” \n \n This advice seemed good to Tom and he determined to follow it. \n \n When on the day of his arrival in San Francisco he went out with the banker to the little cottage where his father was domesticated, Tom felt agitated, and with reason. He was about to see the father whom he had230 long supposed to be dead, and to test the possibility of his recovery. \n \n “Is that he?” asked Tom, clutching the arm of Mr. Percival. \n \n “Yes, Tom. Would you recognize him?” \n \n “He looks much older, but his face looks natural. May I speak to him?” \n \n “No; let me speak first. He knows me.” \n \n “Good-day, Mr. Thatcher,” said the banker. \n \n “Good-day, sir,” answered Thatcher, politely. \n \n “I hope you are well.” \n \n “Quite well, sir.” \n \n His eyes rested upon Tom, and a puzzled expression swept over his face. \n \n “Who is that?” he asked, abruptly. \n \n “It is a young friend of mine. His name is Tom.” \n \n “Where was it?” he continued, dreamily. “Tom! Tom! I once knew a boy of that name.” \n \n “It is a common name. This boy is Tom Thatcher.” \n \n The old man clutched his hoe convulsively. \n \n “What did you say?” he asked, eagerly. \n \n “Tom Thatcher—the same as yours.” \n \n “Let me look at him,” said Thatcher, abruptly, hurrying to Tom and looking into his face with a bewildered look. \n \n “Boy,” he said, hoarsely, “where do you come from? Who is your father?” \n \n “I come from the town of Wilton,” answered Tom, trembling with excitement. “My father’s name was Robert Thatcher.” \n \n 231 “Wilton! Robert Thatcher! Why, that’s my name! Good heaven! what does this mean?” \n \n “Did you ever have a son named Tom?” asked the banker. \n \n “Why—yes,” answered Thatcher, his face lighting up with returning memory. \n \n “And a daughter named Tillie?” asked Tom. \n \n “Yes, yes! I remember it all now. Where, where are they?” \n \n And he clutched Tom’s arm as he searched his face for an answer. \n \n “Father,” said Tom, with emotion, “I am your son Tom.” \n \n “And—and your mother?” \n \n “She still lives. She is waiting for you to return to her.” \n \n Robert Thatcher passed his hand over his brow. \n \n “Can this be true?” he asked, “or is it a dream?” \n \n “It is no dream, father. I have come to California to take you home. Will you come?” \n \n “Yes, yes, now. But,” he added, with momentary doubt, “you cannot be Tom. Tom was a little boy, and you are a large one. He was only half your size.” \n \n “That was long ago, father. I have grown up, but I am the same Tom.” \n \n It must not be supposed that Robert Thatcher recovered his memory and reason all at once. It was not till Tom talked with him day after day, and patiently recalled one circumstance after another, and one person after another living in their native village, that the veil 232 which had hung between him and the past was rent at length, and the bright light of fully recovered reason illumined his mind. Tom did not act wholly according to his own judgment, but he was aided and advised by a skillful physician, conversant with mental maladies similar to that by which Mr. Thatcher was afflicted. \n \n At length he was repaid for his patient labor. His father’s mind returned to its normal condition, and four weeks after his arrival in San Francisco Tom and his father sailed for New York by the regular steamer. \n \n Mr. Percival had settled up his indebtedness, and Tom carried with him drafts on New York for twenty-four thousand dollars. A part of the remaining thousand paid their passage, and the balance Tom carried with him in hard cash. Of course, the money properly belonged to his father, but it was Mr. Thatcher’s desire that Tom should relieve him entirely of business cares. \n \n We must precede him, and let the reader know what had happened in Wilton while Tom was away. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2060/58655.html","bookId":568,"book":{"id":568,"title":"Tom Thatcher\u0027s Fortune","description":"简介： The speaker was a sturdy boy of sixteen, with bright eyes, and a smiling sun-browned face. His shirt sleeves were rolled up displaying a pair of muscular arms. His hands were brown and soiled with labor. It was clear that he was no white-handed young...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2060","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
