{"id":98304,"no":20,"title":"Page 20","content":"Stay under the Buick, run, stand your ground—what did it matter? Stay, run, stand, whatever; the damage was done. My leg wasn’t going to heal on its own. The first shot was a death sentence, so why waste any more bullets?\\n\\n I rode out the blizzard in the rear compartment of an Explorer. Folded down the seat, made myself a cozy metal hut in which to watch the world turn white, unable to crack the power windows to let in fresh air, so the SUV quickly filled up with the smell of blood and my festering wound.\\n\\n I used up all the pain pills from my stash in the first ten hours.\\n\\n Ate up the rest of my rations by the end of day one in the SUV.\\n\\n When I got thirsty, I popped the hatch a crack and scooped up handfuls of snow. Left the hatch popped up to get some fresh air—until my teeth were chattering and my breath turned into blocks of ice in front of my eyes.\\n\\n By the afternoon of day two, the snow was three feet deep and my little metal hut began to feel less like a refuge than a sarcophagus. The days were only two watts brighter than the nights, and the nights were the negation of light—not dark, but lightlessness absolute. So, I thought, this is how dead people see the world.\\n\\n I stopped worrying about why the Silencer had let me live. Stopped worrying about the very weird feeling of having two hearts, one in my chest and a smaller one, a mini heart, in my knee. Stopped caring whether the snow stopped before my two hearts did.\\n\\n I didn’t exactly sleep. I floated in that space in between, hugging Bear to my chest, Bear who kept his eyes open when I could not. Bear, who kept Sammy’s promise to me, being there for me in the space between.\\n\\n Um, speaking of promises, Cassie…\\n\\n I must have apologized to him a thousand times during those two snowbound days. I’m sorry, Sams. I said no matter what, but what you’re too young to understand is there’s more than one kind of bullshit. There’s the bullshit you know that you know; the bullshit you don’t know and know you don’t know; and the bullshit you just think you know but really don’t. Making a promise in the middle of an alien black op falls under the last category. So…sorry!\\n\\n So sorry.\\n\\n One day later now, waist-deep in a snowbank, Cassie the ice maiden, with a jaunty little cap made out of snow and frozen hair and ice-encrusted eyelashes, all warm and floaty, dying by inches, but at least dying on her feet trying to keep a promise she had no prayer of keeping.\\n\\n So sorry, Sams, so sorry.\\n\\n No more bullshit.\\n\\n I’m not coming.\\n\\n 33\\n\\n THIS PLACE CAN’T BE HEAVEN. It doesn’t have the right vibe.\\n\\n I’m walking in a dense fog of white lifeless nothingness. Dead space. No sound. Not even the sound of my own breath. In fact, I can’t even tell if I’m breathing. That’s number one on the “How do I know if I’m alive?” checklist.\\n\\n I know someone is here with me. I don’t see him or hear him, touch or smell him, but I know he’s here. I don’t know how I know he’s a he, but I do know, and he’s watching me. He’s staying still while I move through the thick white fog, but somehow he’s always the same distance away. It doesn’t freak me that he’s there, watching. It doesn’t exactly comfort me, either. He’s another fact, like the fact of the fog. There’s the fog and un-breathing me and the person with me, always close, always watching.\\n\\n But there’s no one there when the fog clears, and I find myself in a four-poster bed beneath three layers of quilts that smell faintly of cedar. The white nothing fades and is replaced by the warm yellow glow of a kerosene lamp sitting on the small table beside the bed. Lifting my head a little, I can see a rocking chair, a freestanding full-length mirror, and the slatted doors of a bedroom closet. A plastic tube is attached to my arm, and the other end is attached to a bag of clear fluid hanging from a metal hook.\\n\\n It takes a few minutes to absorb my new surroundings, the fact that I’m numb from the waist down, and the ultra-mega-confusing fact that I’m definitely not dead.\\n\\n I reach down, and my fingers find thick bandages wrapped around my knee. I’d also like to feel my calf and toes, because there’s no sensation and I’m kind of concerned I don’t have a calf or toes or anything else below the big wad of bandages. But I can’t reach that far without sitting up, and sitting up isn’t an option. It seems like the only working parts are my arms. I use those to throw the covers off, exposing the upper half of my body to the chilly air. I’m wearing a floral-print cotton nightie. And then I’m like, What’s with the cotton nightie? Beneath which, I am naked. Which means, of course, that at some point between the removal of my clothes and donning of the nightie I was completely naked, which means I was completely naked.\\n\\n Okay, ultra-mega-confusing fact number two.\\n\\n I turn my head to the left: dresser, table, lamp. To the right: window, chair, table. And there’s Bear, reclining on the pillow beside me, staring thoughtfully at the ceiling, not a care in the world.\\n\\n Where the hell are we, Bear?\\n\\n The floorboards rattle as below me someone slams a door. The kulump, kulump of heavy boots on bare wood. Then silence. A very heavy silence, if you don’t count my heart knocking against my ribs, which you probably should since it sounds as loud as one of Crisco’s sonic bombs.\\n\\n Thunk-thunk-thunk. Growing louder with each thunk.\\n\\n Someone is coming up the stairs.\\n\\n I try to sit up. Not a smart idea. I get about four inches off the pillow and that’s it. Where’s my rifle? Where’s my Luger? Someone is just outside the door now, and I can’t move, and even if I could all I have is this damned stuffed toy. What was I going to do with that? Snuggle the dude to death?\\n\\n When you’re out of options, the best option is to do nothing. Play dead. The possum option.\\n\\n I watch the door swing open through slits for eyes. I see a red plaid shirt, a wide brown belt, blue jeans. A pair of large, strong hands and very nicely trimmed fingernails. I keep my breath nice and even while he stands right beside me, by the metal pole, checking my drip, I guess. Then he turns and there’s his butt and then he turns again and his face lowers into view as he sits in the rocker by the mirror. I can see his face, and I can see my face in the mirror. Breathe, Cassie, breathe. He has a good face, not the face of someone who wants to hurt you. If he wanted to hurt you, he wouldn’t have brought you here and stuck an IV in you to keep you hydrated, and the sheets feel nice and clean, and so what, he took your clothes and dressed you in this cotton nightie, what did you expect him to do? Your clothes were filthy, like you, only you’re not anymore, and your skin smells a little like lilacs, which means holy Christ he bathed you.\\n\\n Trying to keep my breath steady and not doing a very good job at it.\\n\\n Then the owner of the good face says, “I know you’re awake.”\\n\\n When I don’t say anything, he goes, “And I know you’re watching me, Cassie.”\\n\\n “How do you know my name?” I croak. My throat feels like it’s lined with sandpaper. I open up my eyes. I can see him clearer now. I wasn’t wrong about the face. It’s good in a clean-cut, Clark Kent kind of way. I’m guessing eighteen or nineteen, broad through the shoulders, nice arms, and those hands with the perfect cuticles. Well, I tell myself, it could be worse. You could have been rescued by some fifty-year-old perv sporting a spare tire the size of a monster truck’s who keeps his dead mother in the attic.\\n\\n “Driver’s license,” he says. He doesn’t get up. He stays in the chair with his elbows resting on his knees and his head lowered, which strikes me as more shy than menacing. I watch his dangling hands and imagine them running a warm, wet cloth over every inch of my body. My completely naked body.\\n\\n “I’m Evan,” he says next. “Evan Walker.”\\n\\n “Hi,” I say.\\n\\n He gives a little laugh like I said something funny.\\n\\n “Hi,” he says.\\n\\n “Where the hell am I, Evan Walker?”\\n\\n “My sister’s bedroom.” His deep-set eyes are a chocolate brown, like his hair, and a little mournful and questioning, like a puppy’s.\\n\\n “Is she…?”\\n\\n He nods. Rubbing his hands together slowly. “Whole family. How about you?”\\n\\n “Everyone except my baby brother. That’s, um, his bear, not mine.”\\n\\n He smiles. It’s a good smile, like his face. “It’s a very nice bear.”\\n\\n “He’s looked better.”\\n\\n “Like most things.”\\n\\n I assume he’s talking about the world in general, not my body.\\n\\n “How did you find me?” I ask.\\n\\n He looks away. Looks back at me. Chocolate-colored, lost-puppy eyes. “The birds.”\\n\\n “What birds?”\\n\\n “Buzzards. When I see them circling, I always check it out. You know. In case—”\\n\\n “Sure, okay.” I didn’t want him to elaborate. “So you brought me here to your house, stuck me with an IV—where’d you get the IV, anyway? And then you took off all my…and then you cleaned me up…”\\n\\n “I honestly couldn’t believe you were alive, and then I couldn’t believe you’d stay alive.” He’s rubbing his hands together. Is he cold? Nervous? I’m both. “The IV was already here. It came in handy during the plague. I shouldn’t say this, I guess, but every day I came home I honestly expected you to be dead. You were in pretty bad shape.”\\n\\n He reaches into his shirt pocket, and for some reason I flinch, which he notices, and then smiles reassuringly. He holds out a chunk of knotty-looking metal the size of a thimble.\\n\\n “If this had hit you practically anyplace else, you would be dead.” He rolls the slug between his index finger and thumb. “Where’d it come from?”\\n\\n I roll my eyes. Can’t help it. But I leave out the duh. “A rifle.”\\n\\n He shakes his head. He thinks I don’t understand the question. Sarcasm doesn’t appear to work on him. If that’s true, I’m in trouble: It’s my normal mode of communication.\\n\\n “Whose rifle?”\\n\\n “I don’t know—the Others. A troop of them pretending to be soldiers wasted my father and everybody in our refugee camp. I was the only one who made it out alive. Well, not counting Sammy and the rest of the kids.”\\n\\n He’s looking at me like I’m completely whacked. “What happened to the kids?”\\n\\n “They took them. In school buses.”\\n\\n “School buses…?” He’s shaking his head. Aliens in school buses? He looks like he’s about to smile. I must have looked a little too long at his lips, because he rubs them self-consciously with the back of his hand. “Took them where?”\\n\\n “I don’t know. They told us Wright-Patterson, but—”\\n\\n “Wright-Patterson. The air force base? I heard it was abandoned.”\\n\\n “Well, I’m not sure you can trust anything they tell you. They are the enemy.” I swallow. My throat’s parched.\\n\\n Evan Walker must be one of those people who notices everything, because he says, “You want something to drink?”\\n\\n “I’m not thirsty,” I lie. Now, why did I lie about something like that? To show him how tough I am? Or to keep him in that chair because he’s the first person I’ve talked to in weeks, if you didn’t count the bear, which you shouldn’t. \\n\\n","sourceLink":"https://allnovel.net/the-5th-wave-the-5th-wave-1/page-20.html","bookId":1642,"book":{"id":1642,"title":"The 5th Wave (The 5th Wave #1)","description":"Storyline: The 5th Wave (The 5th Wave #1) \\n After the 1st wave, only darkness remains. After the 2nd, only the lucky escape. And after the 3rd, only the unlucky survive. After the 4th wave, only one rule applies: trust no one. \\n Now, it’s the dawn of the 5th wave, and on a lonely stretch of highway, Cassie runs from Them. The beings who only look human, who roam the countryside killing anyone they see. Who have scattered Earth’s last survivors. To stay alone is to stay alive, Cassie believes, until she meets Evan Walker. \\n Beguiling and mysterious, Evan Walker may be Cassie’s only hope for rescuing her brother—or even saving herself. But Cassie must choose: between trust and despair, between defiance and surrender, between life and death. To give up or to get up.\\n","cover":"https://allnovel.net/images/the-5th-wave-the-5th-wave-1.jpg","author":"Rick Yancey","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-5th-wave-the-5th-wave-1.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:32:09 PM"}}
