{"id":98305,"no":21,"title":"Page 21","content":"“Why did they take the kids?” His eyes are big and round now, like Bear’s. It’s hard to decide his best feature. Those soft, chocolaty eyes or the lean jaw? Maybe the thick hair, the way it falls over his forehead when he leans toward me.\n “I don’t know the real reason, but I figure it’s a very good one to them and a very bad one to us.”\n “Do you think…?” He can’t finish the question—or won’t, to spare me having to answer it. He’s looking at Sam’s bear leaning on the pillow beside me.\n “What? That my little brother’s dead? No. I think he’s alive. Mostly because it doesn’t make sense that they’d pull out the kids, then kill everybody else. They blew up the whole camp with some kind of green bomb—”\n “Wait a minute,” he says, holding up one of his large hands. “A green bomb?”\n “I’m not making this up.”\n “Why green, though?”\n “Because green is the color of money, grass, oak leaves, and alien bombs. How the hell would I know why it was green?”\n He’s laughing. A quiet, held-in kind of laugh. When he smiles, the right side of his mouth goes slightly higher than the left. Then I’m like, Cassie, why are you staring at his mouth anyway?\n Somehow the fact that I was rescued by a very good-looking guy with a lopsided grin and large, strong hands is the most unnerving thing that has happened to me since the Others arrived.\n Thinking about what happened at the camp is giving me the heebie-jeebies, so I decide to change the subject. I peer down at the quilt covering me. It looks homemade. The image of an old woman sewing it flashes through my mind and, for some reason, I suddenly feel like crying.\n “How long have I been here?” I ask weakly.\n “It’ll be a week tomorrow.”\n “Did you have to cut…?” I don’t know how to put the question.\n Thankfully, I don’t have to. “Amputate? No. The bullet just missed your knee, so I think you’ll be able to walk, but there could be nerve damage.”\n “Oh,” I said. “I’m getting used to that.”\n 34\n HE LEAVES ME for a little while and returns with some clear broth, not chicken- or beef-based, but some kind of meat, deer maybe, and while I clutch the edges of the quilt he helps me sit up so I can sip, holding the warm cup in both hands. He’s staring at me, not a creeper stare, but the way you look at a sick person, feeling a little sick yourself and not knowing how to make it better. Or maybe, I think, it is a creeper stare and the concerned look is just a clever cover. Are pervs only pervs if you don’t find them attractive? I called Crisco a sicko for trying to give me a corpse’s jewelry, and he said I wouldn’t think that if he were Ben Parish–hot.\n Remembering Crisco kills my appetite. Evan sees me staring at the cup in my lap and gently pulls it from my hands and places it on the table.\n “I could have done that,” I say, more sharply than I meant to.\n “Tell me about these soldiers,” he says. “How do you know they weren’t…human?”\n I tell him about them showing up not long after the drones, the way they loaded up the kids, then gathered everybody into the barracks and mowed them down. But the clincher was the Eye. Clearly extraterrestrial.\n “They’re human,” he decides after I’m done. “They must be working with the visitors.”\n “Oh God, please don’t call them that.” I hate that name for them. The talking heads used it before the 1st Wave—all the YouTubers, everyone in the Twitterverse, even the president during news briefings.\n “What should I call them?” he asks. He’s smiling. I get the feeling he’d call them turnips if I wanted him to.\n “Dad and I called them the Others, as in not us, not human.”\n “That’s what I mean,” he says, nodding seriously. “The odds of their looking exactly like us are astronomically slim.”\n He sounds just like my dad on one of his speculative rants, and suddenly I’m annoyed, I’m not sure why.\n “Well, that’s terrific, isn’t it? A two-front war. Us-versus-them and us-versus-us-and-them.”\n He shakes his head ruefully. “It wouldn’t be the first time people have changed sides once the victor is obvious.”\n “So the traitors grab the kids out of the camp because they’re willing to help wipe out the human race, but they draw the line at anyone under eighteen?”\n He shrugs. “What do you think?”\n “I think we’re seriously screwed when the men with guns decide to help the bad guys.”\n “I could be wrong,” he says, but he doesn’t sound like he thinks he is. “Maybe they are visi—Others, I don’t know, disguised as humans, or maybe even some kind of clones…”\n I’m nodding. I’ve heard this before, too, during one of Dad’s endless ruminations about what the Others might look like.\n It’s not a question of why couldn’t they, but why wouldn’t they? We’ve known about their existence for five months. They must have known about ours for years. Hundreds, maybe thousands of years. Plenty of time to extract DNA and “grow” as many copies as they needed. In fact, they might have to wage the ground war with copies of us. In a thousand ways, our planet might not be viable for their bodies. Remember War of the Worlds?\n Maybe that’s the source of my current snippiness. Evan is going all-out Oliver Sullivan on me. And that puts Oliver Sullivan dying in the dirt right in front of me when all I want to do is look away.\n “Or maybe they’re like cyborgs, Terminators,” I say, only half joking. I’ve seen a dead one up close, the soldier I shot point-blank at the ash pit. I didn’t check his pulse or anything, but he sure seemed dead to me, and the blood looked real enough.\n Remembering the camp and what happened there never fails to freak me, so I start to freak.\n “We can’t stay here,” I say urgently.\n He looks at me like I’ve lost my mind. “What do you mean?”\n “They’ll find us!” I grab the kerosene lamp, yank off the glass top, and blow hard at the dancing flame. It hisses at me, stays lit. He pulls the glass out of my hand and slips it back over the base of the lamp.\n “It’s thirty-seven degrees outside, and we’re miles from the nearest shelter,” he says. “If you burn down the house, we’re toast.” Toast? Maybe that’s an attempt at humor, but he isn’t smiling. “Besides, you’re not well enough to travel. Not for another three or four weeks, at least.”\n Three or four weeks? Who does this teenage version of the Brawny paper-towel guy think he’s kidding? We won’t last three days with lights shining through the windows and smoke curling from the chimney.\n He’s picked up on my growing distress. “Okay,” he says with a sigh. He extinguishes the lamp, and the room plunges into darkness. Can’t see him, can’t see anything. I can smell him, though, a mixture of wood smoke and something like baby powder, and after a few more minutes, I can feel his body displacing the air a few inches away from mine.\n “Miles away from the nearest shelter?” I ask. “Where the hell do you live, Evan?”\n “My family’s farm. About sixty miles from Cincinnati.”\n “How far from Wright-Patterson?”\n “I don’t know. Seventy, eighty miles? Why?”\n “I told you. They took my baby brother.”\n “You said that’s where they said they were taking him.”\n Our voices, wrapping around each other’s, entwining, and then tugging free, in the pitch black.\n “Well, I have to start somewhere,” I say.\n “And if he isn’t there?”\n “Then I go somewhere else.” I made a promise. That damned bear will never forgive me if I don’t keep it.\n I can smell his breath. Chocolate. Chocolate! My mouth starts to water. I can actually feel my saliva glands pumping. I haven’t had solid food in weeks, and what does he bring me? Some greasy mystery meat–based broth. He’s been holding out on me, this farm boy bastard.\n “You realize there’s a lot more of them than you, right?” he asks.\n “And your point is?”\n He doesn’t answer. So I say, “Do you believe in God, Evan?”\n “Sure I do.”\n “I don’t. I mean, I don’t know. I did before the Others came. Or thought I did, when I thought about it at all. And then they came and…” I have to stop for a second to collect myself. “Maybe there’s a God. Sammy thinks there is. But he also thinks there’s a Santa Claus. Still, every night I said his prayer with him, and it didn’t have anything to do with me. It was about Sammy and what he believed, and if you could have seen him take that fake soldier’s hand and follow him onto that bus…”\n I’m losing it, and it doesn’t matter to me much. Crying is always easier in the dark. Suddenly my cold hand is blanketed by Evan’s warmer one, and his palm is as soft and smooth as the pillowcase beneath my cheek.\n “It kills me,” I sob. “The way he trusted. Like the way we trusted before they came and blew the whole goddamned world apart. Trusted that when it got dark there would be light. Trusted that when you wanted a fucking strawberry Frappuccino you could plop your ass in the car, drive down the street, and get yourself a fucking strawberry Frappuccino! Trusted…”\n His other hand finds my cheek, and he wipes away my tears with his thumb. The chocolate scent overwhelms me as he bends over and whispers in my ear, “No, Cassie. No, no, no.”\n I throw my arm around his neck and press his dry cheek against my wet one. I’m shaking like an epileptic, and for the first time I can feel the weight of the quilts on the top of my toes because the blinding dark sharpens your other senses.\n I’m a bubbling stew of random thoughts and feelings. I’m worried my hair might smell. I want some chocolate. This guy holding me—well, it’s more like I was holding him—has seen me in all my naked glory. What did he think about my body? What did I think about my body? Does God really care about promises? Do I really care about God? Are miracles something like the Red Sea parting or more like Evan Walker finding me locked in a block of ice in a wilderness of white?\n “Cassie, it’s going to be okay,” he whispers into my ear, chocolate breath.\n When I wake up the next morning, there’s a Hershey’s Kiss sitting on the table beside me.\n 35\n HE LEAVES THE OLD FARMHOUSE every night to patrol the grounds and to hunt. He tells me he has plenty of dry goods and his mom was a devoted preserver and canner, but he likes fresh meat. So he leaves me to find edible creatures to kill, and on the fourth day he comes into the room with an honest-to-God hamburger on a hot, homemade bun and a side of roasted potatoes. It’s the first real food I’ve had since escaping Camp Ashpit. It’s also a freaking hamburger, which I haven’t tasted since the Arrival and which, I think I’ve pointed out, I was willing to kill for. \n","sourceLink":"https://allnovel.net/the-5th-wave-the-5th-wave-1/page-21.html","bookId":1642,"book":{"id":1642,"title":"The 5th Wave (The 5th Wave #1)","description":"Storyline: \n The 5th Wave (The 5th Wave #1) \n After the 1st wave, only darkness remains. After the 2nd, only the lucky escape. And after the 3rd, only the unlucky survive. After the 4th wave, only one rule applies: trust no one. \n Now, it’s the dawn of the 5th wave, and on a lonely stretch of highway, Cassie runs from Them. The beings who only look human, who roam the countryside killing anyone they see. Who have scattered Earth’s last survivors. To stay alone is to stay alive, Cassie believes, until she meets Evan Walker. \n Beguiling and mysterious, Evan Walker may be Cassie’s only hope for rescuing her brother—or even saving herself. But Cassie must choose: between trust and despair, between defiance and surrender, between life and death. To give up or to get up.\n \n","cover":"https://allnovel.net/images/the-5th-wave-the-5th-wave-1.jpg","author":"Rick Yancey","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-5th-wave-the-5th-wave-1.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:32:09 PM"}}
