{"id":98310,"no":26,"title":"Page 26","content":"“Wait for them to call your color, okay?” Parker says to Megan. “Greens are going straight to the hospital.” “I’m not sick,” Megan shouts hoarsely. Her voice cracks. She doubles over, coughing, and Sammy instinctively recoils. Parker pats him on the shoulder. “It’s just a bad cold, Sam,” he whispers. “She’s gonna be okay.” “I’m not going to the hospital,” Megan tells Sammy after Parker returns to the front of the bus. She furiously rubs the back of her hand against the jacket, smearing the ink. The smiley face is now just a green blob. “You have to,” Sammy says. “Don’t you want to get better?” She shakes her head sharply. He doesn’t get it. “Hospitals aren’t where you go to get better. Hospitals are where you go to die.” After his mother got sick, he asked Daddy, “Aren’t you going to take Mommy to the hospital?” And his father said that it wasn’t safe. Too many sick people, not enough doctors, and not anything the doctors could do for her, anyway. Cassie told him the hospital was broken, just like the TV and the lights and the cars and everything else. “Everything’s broken?” he asked Cassie. “Everything?” “No, not everything, Sams,” she answered. “Not this.” She took his hand and put it against his chest, and his pounding heart pushed fiercely against his open palm. “Unbroken,” she said. 39 HIS MOTHER WILL only come to him in the in-between space, the gray time between waking and sleeping. She stays away from his dreams, as if she knows not to go there, because dreams are not real but feel more than real when you’re dreaming them. She loves him too much to do that. Sometimes he can see her face, though most of the time he can’t, just her shape, a little darker than the gray behind his lids, and he can smell her and touch her hair, feel it trail through his fingers. If he tries too hard to see her face, she fades into the dark. And if he tries to hold her too tightly, she slips away like her hair between his fingers. The hum of the wheels on the dark road. The stale warm air and the swaying of the bus beneath the cold stars. How much farther to Camp Heaven? It seems like they’ve been on the dark road beneath the cold stars forever. He waits for his mother in the in-between space, his eyes closed, while Megan watches him with those big, round, owly eyes. He falls asleep waiting. He is still asleep when the three school buses pull up to the gates of Camp Haven. High above in the watchtower, the sentry pushes a button, the electronic lock releases, and the gate slides open. The buses pull in and the gate slides shut behind them. He doesn’t wake up until the buses roll to a stop with a final, angry hiss of their brakes. Two soldiers are moving down the aisle, waking the children who have fallen asleep. The soldiers are heavily armed, but they smile and their voices are gentle. It’s okay. Time to get up. You’re perfectly safe now. Sammy sits up, squinting in the sudden blaze of light flooding through the windows, and looks outside. They have stopped in front of a large airplane hangar. The big bay doors are closed, so he can’t see inside. For a moment he isn’t worried about being in a strange place without Daddy or Cassie or Bear. He knows what the bright light means: The aliens couldn’t kill the power here. It also means Parker told the truth: The camp does have a force field. It has to. They don’t care if the Others know about the camp. They are perfectly safe. Megan’s breath is heavy in his ear, and he turns to look at her. Her eyes are huge in the glare of the floodlights. She grabs his hand. “Don’t leave me,” she begs. A big man heaves himself onto the bus. He stands beside the driver, hands on hips. He has a wide, fleshy face and very small eyes. “Good morning, boys and girls, and welcome to Camp Haven! My name is Major Bob. I know you’re tired and hungry and maybe a little scared…Who’s a little scared right now? Raise your hand.” No hands go up. Twenty-six pairs of eyes stare blankly at him, and Major Bob grins. His teeth are small, like his eyes. “That’s outstanding. And you know what? You shouldn’t be scared! Our camp is the safest place in the whole ding-dong world right now, I kid you not. You’re all perfectly safe.” He turns to one of the smiling soldiers, who hands him a clipboard. “Now there are only two rules here at Camp Haven. Rule number one: Remember your colors. Everybody hold up your colors!” Twenty-five fists fly into the air. The twenty-sixth, Megan’s, remains in her lap. “Reds, in a couple of minutes you’ll be escorted into Hangar Number One for processing. Greens, sit tight, you’ve got a little farther to go.” “I’m not going,” Megan whispers in Sammy’s ear. “Rule number two!” Major Bob booms. “Rule two is two words: Listen and follow. That’s easy to remember, right? Rule two, two words. Listen to your group leader. Follow every instruction your group leader gives you. Don’t question and don’t talk back. They are—we all are—here for one reason and one reason only, and that’s to keep you guys safe. And we can’t keep you guys safe unless you guys listen and follow all instructions, right away, no questions.” He hands the clipboard back to the smiling soldier, claps his pudgy hands, and says, “Any questions?” “He just said don’t ask questions,” Megan whispers. “And then he asks if we have any questions.” “Outstanding!” Major Bob yells. “Let’s get you processed! Reds, your group leader is Corporal Parker. No running, pushing, or shoving, but keep it moving. No breaking line and no talking, and remember to show your stamp at the door. Let’s move it, people. The sooner we get you processed, the sooner you can catch some sleep and have some breakfast. I’m not saying the food is the best in the world, but there’s plenty of it!” He lumbers down the steps. The bus rocks with each footfall. Sammy starts to get up, and Megan yanks him back down. “Don’t leave me,” she says again. “But I’m a red,” Sammy protests. He feels sorry for Megan, but he’s anxious to leave. It feels like he’s been on the bus forever. And the sooner the buses are empty, the sooner they can turn around and go back for Cassie and Daddy. “It’s all right, Megan,” he tries to comfort her. “You heard Parker. They’re going to make everybody better.” He falls into line behind the other reds. Parker is standing at the bottom of the steps, checking stamps. The driver shouts out, “Hey!” and Sammy turns, just as Megan hits the bottom step. She slams into Parker’s chest and screams when he grabs her flailing arms. “Let me go!” The driver pulls her from Parker’s grip and drags her back up the steps, an arm locked around her waist. “Sammy!” Megan screams. “Sammy, don’t leave me! Don’t let them—” The doors slam closed, cutting off her cries. Sammy glances up at Parker, who gives him a reassuring pat on the shoulder. “She’s going to be fine, Sam,” the medic says quietly. “Come on.” As he walks to the hangar, he can hear her screaming behind the yellow metal skin of the bus, over the throaty growl of its engine, the hiss of its brakes letting go. Screaming as if she’s dying, as if they’re torturing her. And then he steps through a side door into the hangar and he can’t hear her anymore. A soldier is standing just inside the door. He hands Sammy a card with the number forty-nine printed on it. “Go to the closest red circle,” the soldier tells him. “Sit down. Wait for your number to be called.” “I gotta get over to the hospital now,” Parker says. “Stay frosty, champ, and remember it’s all cool now. There’s nothing that can hurt you here.” He tousles Sammy’s hair, promises he’ll see him again soon, and gives him a fist bump before leaving. There are no planes in the huge hangar, much to Sammy’s disappointment. He’d never seen a fighter jet up close, though he has piloted one a thousand times since the Arrival. While his mother lay dying down the hall, he was in the cockpit of a Fighting Falcon, soaring at the edge of the atmosphere at three times the speed of sound, heading straight toward the alien mothership. Sure, its gray hull bristled with gun turrets and ray cannons and its force field glowed a fiendish, sickly green, but there was a weakness in the field, a hole only two inches wider than his fighter, that if he hit just right…And he’d have to hit it just right, because the whole squadron had been wiped out, he was down to his last missile, and there was no one left to defend the Earth from the alien horde but him, Sammy “the Viper” Sullivan. Three large red circles have been painted on the floor. Sam joins the other children in the one closest to the door and sits down. He can’t get Megan’s terrified screams out of his head. Her huge eyes and the way her skin shimmered with sweat and the sick-smell of her breath. Cassie told him the Pesky Ants was over, that it had killed all the people it was going to kill because some people couldn’t catch it, like Cassie and Daddy and him and everyone else at Camp Ashpit. They were immune, Cassie said. But what if Cassie’s wrong? Maybe the disease took longer to kill some people. Maybe it’s killing Megan right now. Or maybe, he thinks, the Others have unleashed a second plague, one even worse than the Pesky Ants, one that will kill everyone who survived the first one. He pushes the thought away. Since the death of his mother, he’s become good at pushing bad thoughts away. There are over a hundred kids gathered into the three circles, but the hangar is very quiet. The boy sitting next to Sammy is so exhausted, he lies down on his side on the cold concrete, curls into a ball, and falls asleep. The boy is older than Sammy, maybe ten or eleven, and he sleeps with his thumb tucked firmly between his lips. A bell rings, and then a lady’s voice blares over a loudspeaker. First in English, then in Spanish. “WELCOME, CHILDREN, TO CAMP HAVEN! WE ARE SO HAPPY TO SEE ALL OF YOU! WE KNOW YOU’RE TIRED AND HUNGRY AND SOME OF YOU AREN’T FEELING VERY WELL, BUT EVERYTHING WILL BE FINE NOW. STAY IN YOUR CIRCLE AND LISTEN CAREFULLY FOR YOUR NUMBER TO BE CALLED. DON’T LEAVE YOUR CIRCLE FOR ANY REASON. WE DON’T WANT TO LOSE ANY OF YOU! STAY QUIET AND CALM AND REMEMBER THAT WE’RE HERE TO TAKE CARE OF YOU! YOU’RE PERFECTLY SAFE.” A moment later, the first number is called out. The child rises from his red circle and is escorted by a soldier to a door painted the same color at the far end of the hangar. The soldier takes the card from him and opens the door. The child goes in alone. The soldier closes the door and returns to his station beside a red circle. Each circle has two soldiers, both heavily armed, but they smile. All the soldiers smile. They never stop smiling. One by one the children’s numbers are called. They leave their circle, cross the hangar floor, and disappear behind the red door. They don’t come back. It takes almost an hour for the lady to call Sammy’s number. Morning comes, and sunlight breaks through the high windows, filling the hangar with golden light. He’s very tired, ravenously hungry, and a little stiff from sitting so long, but he leaps up when he hears it—“FORTY-NINE! PROCEED TO THE RED DOOR, PLEASE! NUMBER FORTY-NINE!”—and in his hurry nearly trips over the sleeping boy beside him.","sourceLink":"https://allnovel.net/the-5th-wave-the-5th-wave-1/page-26.html","bookId":1642,"book":{"id":1642,"title":"The 5th Wave (The 5th Wave #1)","description":"Storyline: The 5th Wave (The 5th Wave #1) After the 1st wave, only darkness remains. After the 2nd, only the lucky escape. And after the 3rd, only the unlucky survive. After the 4th wave, only one rule applies: trust no one. Now, it’s the dawn of the 5th wave, and on a lonely stretch of highway, Cassie runs from Them. The beings who only look human, who roam the countryside killing anyone they see. Who have scattered Earth’s last survivors. To stay alone is to stay alive, Cassie believes, until she meets Evan Walker. Beguiling and mysterious, Evan Walker may be Cassie’s only hope for rescuing her brother—or even saving herself. But Cassie must choose: between trust and despair, between defiance and surrender, between life and death. To give up or to get up.","cover":"https://allnovel.net/images/the-5th-wave-the-5th-wave-1.jpg","author":"Rick Yancey","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-5th-wave-the-5th-wave-1.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:32:09 PM"}}
