{"id":98316,"no":32,"title":"Page 32","content":"My eyes slide over to Flintstone, who’s the closest to Tank, standing a couple of feet to his right. Flint answers with the tiniest of nods. “Don’t you dumbasses ever wonder why they haven’t hit us yet?” Tank says. He’s not laughing now. He’s crying. “You know they can. You know they know we’re here, and you know they know what we’re doing here, so why are they letting us do it?” “I don’t know, Tank,” I say evenly. “Why?” “Because it doesn’t matter anymore what the hell we do! It’s over, man. It’s done!” Swinging his gun around wildly. If it goes off…“And you and me and everybody else on this damn base are history! We’re—” Flint’s on him, ripping the rifle from his hand and shoving him down hard. Tank’s head catches the edge of his bunk when he falls. He curls into a ball, holding his head in both hands, screaming at the top of his lungs, and when his lungs are empty, he fills them and lets loose again. Somehow it’s worse than waving around the loaded M16. Poundcake races into the latrine to hide in one of the stalls. Dumbo covers his big ears and scoots to the head of his bunk. Oompa has sidled closer to me, right next to Nugget, who’s holding on to my legs with both hands now and peeking around my hip at Tank writhing on the barracks floor. The only one unaffected by Tank’s meltdown is Teacup, the seven-year-old. She’s sitting on her bunk staring stoically at him, like every night Tank falls to the floor and screams as if he’s being murdered. And it hits me: This is murder, what they’re doing to us. A very slow, very cruel murder, killing us from our souls outward, and I remember the commander’s words: It isn’t about destroying our capability to fight so much as crushing our will to fight. It is hopeless. It is crazy. Tank is the sane one because he sees it clearly. Which is why he has to go. 47 THE SENIOR DRILL INSTRUCTOR agrees with me, and the next morning Tank is gone, taken to the hospital for a full psych eval. His bunk remains empty for a week, while our squad, one man short, falls further and further behind in points. We’ll never graduate, never trade in our blue jumpsuits for real uniforms, never venture beyond the electric fence and razor wire to prove ourselves, to pay back a fraction of what we’ve lost. We don’t talk about Tank. It’s as if Tank never existed. We have to believe the system is perfect, and Tank is a flaw in the system. Then one morning in the P\u0026D hangar, Dumbo motions me over to his table. Dumbo is training to be the squad medic, so he has to dissect designated corpses, usually Teds, to learn about human anatomy. When I come over, he doesn’t say anything, but nods at the body lying in front of him. It’s Tank. We stare at his face for a long moment. His eyes are open, staring sightlessly at the ceiling. He’s so fresh, it’s unnerving. Dumbo glances around the hangar to make sure no one can overhear us, and then whispers, “Don’t tell Flint.” I nod. “What happened?” Dumbo shakes his head. He’s sweating badly under the protective hood. “That’s the really freaky thing, Zombie. I can’t find anything.” I look back down at Tank. He isn’t pale. His skin is slightly pink without a mark on it. How did Tank die? Did he go Dorothy in the psych ward, maybe overdose himself on some drugs? “What if you cut him open?” I ask. “I’m not cutting Tank open,” he says. He’s looking at me as if I just told him to jump off a cliff. I nod. Stupid idea. Dumbo is no doctor; he’s a twelve-year-old kid. I glance around the hangar again. “Get him off this table,” I say. “I don’t want anyone else to see him.” Including me. Tank’s body is stacked with the others by the hangar doors to be disposed. He’s loaded onto the transport for the final leg of his journey to the incinerators, where he will be consumed in fire, his ashes mixing with the gray smoke and carried aloft in a column of superheated air, eventually to settle over us in particles too fine to see or feel. He’ll stay with us—on us—until we shower that night, washing what’s left of Tank into the drains connected to the pipes connected to the septic tanks, where he will mix with our excrement before leaching into the ground. 48 TANK’S REPLACEMENT ARRIVES two days later. We know he’s coming, because the night before Reznik announces it during Q\u0026A. He won’t tell us anything about him, except the name: Ringer. After he leaves, everybody in the squad is jacked up; Reznik must have named him Ringer for a reason. Nugget comes over to my bunk and asks, “What’s a ringer?” “Someone who you slip into a team to give it an edge,” I explain. “Somebody who’s really good.” “Marksmanship,” Flintstone guesses. “That’s where we’re weakest. Poundcake’s our best, and I’m okay, but you and Dumbo and Teacup suck. And Nugget can’t even shoot.” “Come over here and say I suck,” Teacup shouts. Always looking for a fight. If I were in charge, I’d give Teacup a rifle and a couple of clips and let her loose on every Ted in a hundred-mile radius. After the prayer, Nugget twists and squirms against my back until I can’t take it anymore and hiss at him to go back to his bunk. “Zombie, it’s her.” “What’s her?” “Ringer! Cassie is Ringer!” It takes me a couple of seconds to remember who Cassie is. Oh, God, not this shit again. “I don’t think Ringer is your sister.” “You don’t know she isn’t, either.” It almost comes out of me: Don’t be a dumbass, kid. Your sister isn’t coming for you because she’s dead. But I hold it in. Cassie is Nugget’s silver locket. What he clings to because if he lets go, there’s nothing to keep the tornado from taking him off to Oz like the other Dorothys in camp. It’s why a kid army makes sense. Adults don’t waste their time on magical thinking. They dwell on the same inconvenient truths that landed Tank on the dissection table. Ringer isn’t at roll call the next morning. And he isn’t on the morning run or at chow. We gear up for the range, check our weapons, head out across the yard. It’s a clear day, but very cold. Nobody says much. We’re all wondering where the new kid is. Nugget sees Ringer first, standing off in the distance on the firing range, and right away we can see Flintstone was right: Ringer is a hell of a marksman. The target pops out of the tall brown grass and pop-pop! the head of the target explodes. Then a different target, but the same result. Reznik is standing off to one side, operating the controls on the targets. He sees us coming and starts hitting buttons fast. The targets rocket out of the grass, one right after the other, and this Ringer kid takes them out before they can get upright with one shot. Beside me, Flintstone gives a long, appreciative whistle. “He’s good.” Nugget gets it before the rest of us. Something about the shoulders or maybe the hips, but he goes, “It’s not a he,” before he takes off across the field toward the solitary figure cradling the rifle that smokes in the freezing air. She turns before he reaches her, and Nugget pulls up, first confused, then disappointed. Apparently, Ringer is not his sister. Weird that she looked taller from a distance. Around Dumbo’s height, but thinner than Dumbo—and older. I’m guessing fifteen or sixteen, with a pixie face and dark, deep-set eyes, flawless pale skin, and straight black hair. It’s the eyes that get you first. The kind of eyes you search to find something there and you come away with only two possibilities: Either what’s there is so deep you can’t see it, or there’s nothing there at all. It’s the girl from the yard, the one who caught me outside the P\u0026D hangar with Nugget. “Ringer is a girl,” Teacup whispers, wrinkling her nose like she’s caught a whiff of something rotten. Not only is she not the baby of the squad anymore, now she’s not the only girl. “What’re we going to do with her?” Dumbo is on the edge of panic. I’m grinning. Can’t help it. “We’re going to be the first squad to graduate,” I say. And I’m right. 49 RINGER’S FIRST NIGHT in Barracks 10 in one word: awkward. No banter. No dirty jokes. No macho bluster. We count the minutes ticking down to lights-out like a bunch of nervous geeks on a first date. Other squads might have girls her age; we have Teacup. Ringer seems oblivious to our discomfort. She sits on the edge of Tank’s old bunk, disassembling and cleaning her rifle. Ringer likes her rifle. A lot. You can tell by the way she lovingly runs the oily rag up and down the length of its barrel, shining it until the cold metal gleams under the fluorescents. We are trying so hard not to stare at her, it’s painful. She reassembles her weapon, places it carefully in the locker beside the bed, and comes over to my bunk. I feel something tighten in my chest. I haven’t spoken to a girl my age since…when? Before the plague. And I don’t think about my life before the plague. That was Ben’s life, not Zombie’s. “You’re the squad leader,” she says. Her voice is flat, no emotion, like her eyes. “Why?” I answer the challenge in her question with one of my own. “Why not?” Stripped down to her skivvies and the standard-issue sleeveless T-shirt, her bangs stopping just short of her dark eyebrows, looking down at me. Dumbo and Oompa stop their card game to watch. Teacup is smiling, sensing a fight brewing. Flintstone, who’s been folding laundry, drops a clean jumpsuit on top of the pile. “You’re a terrible shot,” Ringer says. “I have other skills,” I say, crossing my arms over my chest. “You should see me with a potato peeler.” “You’ve got a good body.” Somebody laughs under his breath; I think it’s Flint. “Are you an athlete?” “I used to be.” She’s standing over me with her fists on her hips, bare feet planted firmly on the floor. It’s her eyes that get to me. The deep dark of them. Is nothing there—or nearly everything? “Football.” “Good guess.” “And baseball, probably.” “When I was younger.” She changes the subject abruptly. “The guy I replaced went Dorothy.” “That’s right.” “Why?” I shrug. “Does it matter?” She nods. It doesn’t. “I was the leader of my squad.” “No doubt.” “Just because you’re leader doesn’t mean you’ll make sergeant after graduation.” “I sure hope that’s true.” “I know it’s true. I asked.” She turns on her bare heel and goes back to her bunk. I look down at my feet and notice my nails need trimming. Ringer’s feet are very small, with nubby-type toes. When I look up again, she’s heading for the showers with a towel thrown over her shoulder. She pauses at the door. “If anybody in this squad touches me, I’ll kill them.”","sourceLink":"https://allnovel.net/the-5th-wave-the-5th-wave-1/page-32.html","bookId":1642,"book":{"id":1642,"title":"The 5th Wave (The 5th Wave #1)","description":"Storyline: The 5th Wave (The 5th Wave #1) After the 1st wave, only darkness remains. After the 2nd, only the lucky escape. And after the 3rd, only the unlucky survive. After the 4th wave, only one rule applies: trust no one. Now, it’s the dawn of the 5th wave, and on a lonely stretch of highway, Cassie runs from Them. The beings who only look human, who roam the countryside killing anyone they see. Who have scattered Earth’s last survivors. To stay alone is to stay alive, Cassie believes, until she meets Evan Walker. Beguiling and mysterious, Evan Walker may be Cassie’s only hope for rescuing her brother—or even saving herself. But Cassie must choose: between trust and despair, between defiance and surrender, between life and death. To give up or to get up.","cover":"https://allnovel.net/images/the-5th-wave-the-5th-wave-1.jpg","author":"Rick Yancey","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-5th-wave-the-5th-wave-1.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:32:09 PM"}}
