{"id":67033,"no":24,"title":"Page 24","content":"\n Perhaps if she took a break; let her mind wander, it might shift into place. “You agreed to tell me what you know about this whole mess. Now would be a good time to tell me why you think a small tribe of earth-worshippers in Siberia are a threat to the US. Or my Dad. They are his people, after all.”\n MacNeil sank onto the only chair in the room, which was next to the wastebasket. His blue eyes became sharp as he settled wide, tanned hands over his belt. “Do you remember the sarin gas attack on the Japanese subway in 1995?”\n “Of course. It was conducted by a small religious cult. Oh, I see where you’re going with this … .”\n “Aum Shinrikyo. Yes, they were a relatively unknown religious cult that had been overlooked by Japanese intelligence until their leader, Shoko Asahara, induced them to execute the attack. Five thousand people were injured, and the Japanese were taken completely by surprise. They knew practically nothing about the group—and certainly didn’t consider it any kind of threat—until it was much too late.”\n “But Aum is a doomsday cult, and they conducted the attack because they believed it would help bring on the Apocalypse. There’s absolutely nothing to indicate that the Skaladeskas are violent, or preaching the end of the world as Aum was. They’re simply a small religious cult. Harmless.”\n “The fact is, any religion can go bad. When there are fundamentalists of any faith or cult, we see it happen. They make absolute truth claims, require blind obedience from their followers … declare their version of a holy war. And it’s true that the Skaladeskas may be harmless, as you say. But Bergstrom and I aren’t going to be looking in the mirror at our guilty faces the day after the shit hits the fan if they aren’t. There will be no Aum Shinrikyo on my watch. No horrific surprises.”\n “Does the CIA expend this much energy and expense to investigate every small, insignificant religious cult?” she asked.\n “Since 9/11, since the sarin gas attack, since Kuala Pohr—remember them?—no one in national security is insane enough to take the chance on letting something slip by. Believe it or not, we’re serious about proactively saving lives.”\n Marina looked at him. He’d become intense and irritated. She wondered if he and Bergstrom had been touched by the great ball-dropping between the CIA, the Feds, and the NSA that had resulted in 9/11.\n “I see your point in that you have to keep an eye on things,” she conceded. After all, that was part of the reason she’d agreed to help. If something happened to Dad, it’d be on her conscience, along with all the other baggage he already represented. Like she needed anything else weighing her down.\n “But I can’t believe Dad would be involved in something like that; and I can’t believe that a small band of earth-worshippers would pose a threat to the any of us. They probably live in caves or huts and live off the land. Harmless.”\n “But if they subscribe to the Gaia Hypothesis, which says, according to you, that the earth moves to correct anything that threatens it … perhaps they might find a reason to correct something they perceive as a threat to their goddess. Think of the fundamentalist Muslims—part of the reason we don’t get along is because they believe we are controlled by money, capitalism. And in fact, there is an indication that the Skaladeskas might not be as harmless as you think.”\n “Ah. Now we come to the crux of the matter,” Marina replied. “There is something you’ve held back. Why didn’t you tell me this from the beginning, instead of blathering on about Dad’s disappearance and the whole story you gave me about protecting him?”\n “That’s Colin’s story. There are some things he hasn’t told me, and I haven’t pushed him because I know he has his reasons. But the fact is, the reason we’re looking for your father, is because there is a possibility that those earthquakes last Friday were man-made. Caused by the Skaladeskas.”\n “What? How is that possible? And how could you connect them to it?”\n But before he could respond, something snagged her attention. A sharp prickle across her shoulders sent her leaping to her feet. She banged against the rickety table and knocked the book to the floor just as something crashed through the window.\n “Get down!” MacNeil yelled, already slamming himself to the floor. Marina dove, and he yanked her down the rest of the way, her head thumping onto the thin rug. Pain smacked into her temple just as she smelled a pouf of sweet-smelling smoke.\n She dragged her hand over her mouth, and grabbed at the flannel bedspread that hung next to her face to cover her nose and eyes.\n It was too late. The sickening, sweet gas worked quickly and Marina’s eyes spouted tears that streamed down her face. Her head felt like it was in a pool of Jell-O, sluggish and clogged, and before she could turn to look for MacNeil, she lost the battle.\n When Marina regained awareness, it was in a dark, close place. Something warm and solid pressed against her back, crushing her fingers between them. She was sitting, and her arms and legs were immobile. The pain cutting into her wrists was unforgiving metal, but it was tightly-tied rope that confined her ankles together. A rumble under her told her she was in some kind of vehicle that was not only running, but moving.\n The sudden jounce of what must have been a pot-hole shoved her against something warm and solid. MacNeil.\n She attempted to uncurl her fingers and they brushed against rough flesh that moved, tickling against her. “Gabe?” her voice came out in a soft croak, barely audible above the rumble of the engine.\n “You hurt?” his words weren’t much louder.\n “No. You?”\n “No.”\n They both fell silent. It wasn’t necessary to speak the obvious. They didn’t know where they were, where they were going, and what was going to happen. The only thing that was fairly certain was that they had been snatched by the Skaladeskas—or some entity that didn’t want them to find them.\n “Can you move at all?” He shifted against her back as he proved that he, at least, was slightly mobile. The warmth went away, then returned in awkward bumps as he tested his mobility, brushing against her.\n By now, she’d figured out that they were in the back of a truck, about the size of a UPS delivery truck, she guessed, based on the air space and the fact that she could only touch two walls.\n “I’ve got a … .” she grunted as she tried to scoot back toward the sound of scrabbling “ … small light in my pocket.”\n “Here.” His voice was closer than she’d expected.\n Marina scooted toward him and found that her feet, which were tied together at the ankles, were also tied to something else heavy. Perhaps the wall. “I can’t move any closer. I can lay down so you can get at it. The light’s in my front pocket, left side. If they didn’t frisk me.”\n “Okay, lay down.”\n She let herself fall backwards, expecting the back of her head to slam onto the floor, but it landed on something warm and solid. His leg. Marina shifted again, and rolled so that her head fell the short distance to the floor with a dull thud. Then he moved, and after much scooting and grunting, she felt him back up to her hip and feel around with his fingers.\n Then, another grunt, and he pulled his hand out. “Got it.”\n “It’s one of those little micro-lights you squeeze to illuminate,” she explained. “I got it from a catalog that claimed they’re used by the FBI.”\n “At least one of us was prepared. Now let’s see how we can get out of here.”\n Suddenly, the light came on and Marina found herself looking into MacNeil’s dark blue eyes. They were close enough that she could see his lashes and feel the warmth of his breath. He smiled a little, only inches away, and Marina thought for a moment that he might take advantage of their proximity.\n Just then, the truck slammed to a halt. The impact threw both of them to the floor, and the light went out, followed by MacNeil’s curse. “Dammit. Dropped it.”\n “Well, at least we got to see for a minute. How about getting my feet untied and I’ll work on yours.”\n “Nice idea but—“ He stopped just as the sound of metal scraping against metal grated at the back of the truck. “Play dead!”\n They fell against each other as they slumped to the floor, and Marina felt something hard and irregular jamming into the underside of her wrist. She curled her fingers around the small, flat light MacNeil had dropped and managed to shove it into her back pocket.\n Then she waited.\n The doors opened, and through slitted eyes, Marina saw very little illumination. In other words, it was still night. Or they were in a garage or cave.\n There were two of them.\n If these were the same guys who’d given them chase in the SUVs, and one of them was in custody, where had the third one been during the car chase?\n Setting off a bomb, most likely. Attempting to destroy any evidence at Dad’s house.\n They yanked Marina out first, after unlocking the padlock that held her legs attached to a hook on the wall with a bicycle chain. MacNeil wouldn’t have been able to free her anyway, unless he carried lock picks. Someone dragged her out of the truck, banging her hands on the edge before she was thrown over her captor’s shoulder.\n Continuing to feign a faint, Marina kept the exclamation of pain deep inside her chest, even though it hurt like hell when her curled fingers clanged into cold metal. She did open her eyes as she was being carried and confirmed that if it wasn’t the dead of night, at least it was just before dawn.\n Then she heard the sound of water. Waves, lapping and surging.\n She blinked, fast, trying to focus. It was night. It was cool. The wide white swath of moonbeam cut across the pathway below her bobbing head. Water. Not water!\n Her breath caught, filling her chest and paralyzing it so she couldn’t exhale. “No.” She couldn’t help it, she started to buck and twist.\n Her sudden moves must have surprised her captor, for he lost his grip and she tumbled to the ground. She crashed hip-first onto something hard that knocked the breath out of her and shot pain into her side. Even that didn’t slow her; she rolled as fast as she could, toward the looming trees. \n","sourceLink":"https://allnovel.net/siberian-treasure/page-24.html","bookId":2353,"book":{"id":2353,"title":"Siberian Treasure","description":"Storyline: \n In the tradition of Clive Cussler comes the first novel in an exciting new series of thrilling adventure, high-stakes international threats, and lost treasures.... \n Moscow, 1560: A lost Byzantine library...last seen in the possession of Russia\u0027s Ivan the Terrible... \n Siberia, 1942: A World War II female fighter pilot crashes in the mountains of Siberia and is taken away by a small, mysterious tribe... \n United States, 2007: Four simultaneous earthquakes erupt across the United States in areas without fault lines.... \n Marina Alexander lives for adventure. She pilots small planes in order to participate in search and rescue missions with her dog, deep in the most dangerous caves on earth. \n She also studies antiquities at the University of Michigan, and is just about to depart on the most important trip of her career when she is swept into an adventure of high-stakes, international intrigue. \n Little does she know, she has a connection to a dangerous group of geo-terrorists that will bring her face to face with them--and leave her with a terrible choice. \n From the deep, dangerous caves of mid-Pennsylvania to the southern shore of Lake Superior, to the desolate mountains of Siberia and the slick urban oil center of Riyadh, Siberian Treasure will take readers on a fast-paced, thrilling ride.\n \n","cover":"https://allnovel.net/images/siberian-treasure.jpg","author":"Colleen Gleason","type":"Mystery","source":"allnovel","link":"https://allnovel.net/siberian-treasure.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:02:50 AM"}}
