{"id":67035,"no":26,"title":"Page 26","content":"Lev stared at him for a long moment. “You will not withhold any information from me for any reason again. Regardless of its triviality. Do not forget, I am the one who speaks for Gaia. You and Varden—you do not.” “Of course, father.” “And when you have determined which of our people allowed such a thing to happen, you will handle it with the same finality with which you handled Israt Medivir.” “Of course, father. Only last week, Igor Minofsky was punished when he called into question the direction I gave him. He wanted a greater sign that this was the perfect time. Stegnora believes Hedron may have been involved. His sons Bran and George have been missing from their homes in Madrid.” Hedron was indeed becoming more belligerent and critical of Roman’s practices, and his leadership decisions. Lev suspected he would risk upheaval in the clan in order to remove Roman from his ruling position, despite the spiritual power still retained by Lev himself. Indeed, Hedron had proven his ability to commune with the spiritual world in a way that eluded Roman. But Hedron was not of the Aleksandrov or Romanovna lines. Thus he could not be accepted as a leader. “It is more than possible. I presume you will locate the two young men? Fridkov?” “Of course, father. He arrived Stateside and has been reassigned to conduct his own investigation on the whereabouts of Hedron’s sons. And appropriate steps will be taken.” “I would expect nothing less, Roman. Do not disappoint me again.” -24- July 9, 2007 Langley, Virginia Gabe MacNeil was missing. With a civilian. Colin reached for a capsule of Prilosec; downed it with four slugs of coffee. Black. And strong enough to remove rust stains. He had a feeling it wouldn’t help. For twenty years, he’d walked the straight and narrow. Always following the rules. Always getting expenses approved before utilizing them. Always clearing investigations as needed. Always being completely forthcoming with his team. Always justifying his work for the Agency. And the one blasted time he didn’t, this had to happen. With a civilian! Bergstrom was going to have to do something. MacNeil’s satellite phone wasn’t working, and he’d heard nothing from him since he’d left Marquette yesterday afternoon. He’d allowed his past and his personal prejudices to lead him and now he was going to have to face the consequences. Damn. It had been a simple assignment: bring Victor Alexander to him so that he could find a way to hold him. Simple. But, like the time he’d decided to install a new light in the dining room, what had seemed an elementary, straight-forward task had turned into an abominable mess. He’d lied to his officer, withheld information, and misled him. Endangered a civilian. Utilized unauthorized Agency resources during a time when budget cuts required accounting for everything. All because he saw the opportunity for revenge. And now he was going to have to pay the piper, and hope it wouldn’t result in the loss of his job. Because if he lost that, he lost everything. His attention bounced around his office, unsure where to focus. Onto the stack of files that needed to be dealt with. Onto the laptop screen, which, behind its screen saver, held nearly a hundred emails. Onto the minutes from, ironically, the budget meeting he’d attended yesterday. And, finally, irrevocably, onto the old photo of his wife. He flipped listlessly through a file while his mind worked. How could he get a team up to Northern Michigan to track down Gabe? Would Darrow agree to it? Why the hell didn’t Gabe call? He had a sat phone. But Bergstrom knew that Gabe would have called if he could have. Which meant that he was in trouble. That assumption was a light at the end of the tunnel of his own making. Because if Gabe was in trouble, that meant there was trouble to be had. And if there was trouble, it would justify his actions. Before he could stew on it any longer, his desk phone rang. “Bergstrom here.” The voice that came through sounded far away and tinny. At first, his heart leapt. Gabe? But no. “This is Director Colin Bergstrom?” came the precise, clipped voice that Colin recognized as someone who’d learned English as a second or other language. He spoke his first name “Cole-in.” “Speaking. Who is calling?” “This is Inspector Hamid al-Jubeir of the GDI in Riyadh, Saudi Arabia.” The way this introduction came through, smoothly with only a minor hesitation over the names and titles, told Colin that the words were written in front of the speaker. “Yes? How may I help you?” “I am involved in an investigation related to the murder of a wealthy oil producer here in Riyadh. The man who killed him left a calling card with a black drawing on it. A symbol.” “Yes?” “Through the Interpol database, I found that you have been investigating such a symbol in relation to some activity in the United States. Yours is the only identifier I could find for this drawing. I hoped you might have some information that could help me.” “Indeed. Indeed!” Perhaps the sun would shine. “Can you fax me a copy of the symbol? Do you have any other information?” “The assistant of the man who was killed met the suspected murderer. I have a composite drawing of that man. Would that be of interest to you? And have you anything to share with me?” “Yes, to both. Perhaps you can email them to me?” At the very least, Colin would run the photo of the murderer through the database in Langley, unless by some odd break of fortune he recognized it as Victor Alexander. Identifying another Skaladeska; indeed, one who was a suspect in murder, would immediately support his questionable investigation. And then he could put more resources to track down Gabe. Colin gave Hamid his email address, and while the investigator was preparing the attachments, Bergstrom gave him a sketchy outline of who the Skaladeskas were. “At this time, we haven’t any reason to believe they are a danger to anyone; however, with this new development—and if it is indeed a Skaladeska who is suspected in the murder of Israt Medivir,” he had to look at his notes to make sure he had the name right, “it will give support our decision to continue monitoring those people.” Perhaps, perhaps his personal feelings had not been skewed too far from professional after all. His instincts had never been wrong yet. -25- July 9, 2007 Somewhere in Canada Marina looked at the Mirage sitting on the end of the runway. She’d flown one twice, and although it was bigger than the SR-22 with which she had logged more than 1000 hours, it had more than a few advantages over that. It could fly higher and carry more weight, to name a few. And they wanted her to fly it? Her kidnappers wanted her to fly a plane. Why? Marina didn’t remember the question coming out of her mouth, but she must have spoken it, because her captor replied, “You have the skill, and I am most certain you will do your best to ensure that we have a safe trip. I will be watching you very closely.” Ah yes. The very same tactic employed by bank robbers and other felons: have the hostage drive the car while they keep a gun on him. It provides for fewer distractions and better security, from the felon’s point of view. “Where are we going? Do you have a flight plan?” “You will find all you need inside.” By now, they had reached the plane. A shadow moved inside the little craft, shifting into the shape of a man, who yawned and stretched before he opened the plane door. It opened toward the ground to display built-in steps. “Is he your guard dog?” Marina asked, and suddenly she thought of Boris. The canine would be frantic when he returned to the motel room to find her gone. The sense of struggle in the air would be evident to him and he would know she’d left under duress. “Inside.” She felt a jab at the base of her back and it brought her back to the matter at hand. Boris would be fine. She, on the other hand, was going to be in a bit of a mess for the foreseeable future. Glancing back at MacNeil, Marina gave a little smile and was rewarded with a wry expression in return. They were in this together, and they hadn’t been hurt or killed yet, he seemed to say. Onward and upward. Literally. Inside the Mirage, she slid into one of the pilot seats and began reviewing the flight plan, which had been on the small console between the two seats. Someone knew what they were doing. The plan was a visual one, which meant that it was not filed with Air Traffic Control and she would not be relying on instruments during flight. They would also be flying at a lower altitude than the Mirage was capable of; a precaution, she assumed, on the part of whoever had planned it, because if they flew at a high enough altitude, say, over 18,000 feet, they’d have to file the plan with ATC. Which meant that they’d get a four-digit Squawk code; something she could potentially use to alert ATC that they were being hijacked or kidnapped. So using a code to notify the ATC wasn’t going to work. She’d have to think of something else. Marina wondered if it was either of these gentlemen, or if someone else had prepared their route. If they hadn’t prepared the flight plan, that could mean neither of them were skilled pilots. Which left some room for her to get creative. Marina turned her mind from questions she couldn’t answer, and focused on refamiliarizing herself with the plane, which was a 2004 model and the newest, most feature-laden aircraft she’d ever flown. Despite the fact that they were being kidnapped, it was going to be a rush to fly it. The flight plan indicated that they were going to be flying at about 14,500, and heading northeast of James Bay. She checked all the gauges and controls on the digital screen, confirmed that it was fueled, and finally settled in her seat. “Where exactly are we going? I need to know if I’m going to fly this thing.” “Our final destination is near the Arctic Circle.”","sourceLink":"https://allnovel.net/siberian-treasure/page-26.html","bookId":2353,"book":{"id":2353,"title":"Siberian Treasure","description":"Storyline: In the tradition of Clive Cussler comes the first novel in an exciting new series of thrilling adventure, high-stakes international threats, and lost treasures.... Moscow, 1560: A lost Byzantine library...last seen in the possession of Russia\u0027s Ivan the Terrible... Siberia, 1942: A World War II female fighter pilot crashes in the mountains of Siberia and is taken away by a small, mysterious tribe... United States, 2007: Four simultaneous earthquakes erupt across the United States in areas without fault lines.... Marina Alexander lives for adventure. She pilots small planes in order to participate in search and rescue missions with her dog, deep in the most dangerous caves on earth. She also studies antiquities at the University of Michigan, and is just about to depart on the most important trip of her career when she is swept into an adventure of high-stakes, international intrigue. Little does she know, she has a connection to a dangerous group of geo-terrorists that will bring her face to face with them--and leave her with a terrible choice. From the deep, dangerous caves of mid-Pennsylvania to the southern shore of Lake Superior, to the desolate mountains of Siberia and the slick urban oil center of Riyadh, Siberian Treasure will take readers on a fast-paced, thrilling ride.","cover":"https://allnovel.net/images/siberian-treasure.jpg","author":"Colleen Gleason","type":"Mystery","source":"allnovel","link":"https://allnovel.net/siberian-treasure.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:02:50 AM"}}
