{"id":86901,"no":19,"title":"Page 19","content":"He stills my hand between his, and it isn’t until he does this that I realize I’m shaking. I look up at him and he’s staring back at me. There are absolutely no words that can follow that up, so I don’t even try. He stands up and leans over the table, then slides his hand behind my neck. He kisses me on top of the head, then releases his hold and walks to the kitchen. “You want brownies or cookies?” he asks over his shoulder, as if he didn’t just absolutely stun me into silence.\\n\\n He looks back at me and I’m still staring at him in shock. I don’t even know what to say. Did he just admit that he’s suicidal? Was he being metaphorical? Melodramatic? I have no idea what to do with the bomb he just placed in my lap.\\n\\n He brings a plate of both cookies and brownies back to the table, then kneels down in front of me.\\n\\n “Hey,” he says soothingly, taking my face in his hands. His expression is serene. “I didn’t mean to scare you. I’m not suicidal if that’s what’s freaking you out. I’m not fucked up in the head. I’m not deranged. I’m not suffering from post-traumatic stress disorder. I’m just a brother who loved his sister more than life itself, so I get a little intense when I think about her. And if I cope better by telling myself that what she did was noble, even though it wasn’t, then that’s all I’m doing. I’m just coping.” He’s got a tight grip on my face and he’s looking at me desperately, wanting me to understand where he’s coming from. “I fucking loved that girl, Sky. I need to believe that what she did was the only answer she had left, because if I don’t, then I’ll never forgive myself for not helping her find a different one.” He presses his forehead to mine. “Okay?”\\n\\n I nod, then pull his hands from my face. I can’t let him see me do this. “I need to use the bathroom.” He backs up and I rush to the bathroom and shut the door behind me, then I do something I haven’t done since I was five. I cry.\\n\\n I don’t ugly cry. I don’t sob and I don’t even make a noise. A single tear falls down my cheek and it’s one tear too many, so I quickly wipe it away. I take a tissue and wipe at my eyes in an attempt to stop any other tears from forming.\\n\\n I still don’t know what to say to him, but I feel like he put a pretty tight lid on the subject, so I decide to let it go for now. I shake out my hands and take a deep breath, then open the door. He’s standing across the hallway with his feet crossed at the ankles and his hands hanging loosely in his pockets. He straightens up and takes a step closer to me.\\n\\n “We good?” he asks.\\n\\n I smile my best smile and nod, then take a deep breath. “I told you I think you’re intense. This just proves my point.”\\n\\n He smiles and nudges me toward the bedroom. He wraps his arms around me from behind and rests his chin on top of my head while we make our way toward my room. “Are you allowed to get pregnant yet?”\\n\\n I laugh. “Nope. Not this weekend. Besides, you have to kiss a girl before you can knock her up.”\\n\\n “Did someone not have sex education when she was homeschooled?” he says. “Because I could totally knock you up without ever kissing you. Want me to show you?”\\n\\n I hop on the bed and grab the book, opening it up to where we left off last night. “I’ll take your word for it. Besides, I’m hoping we’re about to get a hefty dose of sex education before we make it to the last page.”\\n\\n Holder drops down on the bed and I lay beside him. He puts his arm around me and pulls me toward him, so I rest my head on his chest and begin reading.\\n\\n I know he’s not doing it on purpose, but the entire time I’m reading I’m completely distracted by him. He’s looking down at me, watching my mouth as I read, twirling my hair between his fingertips. Every time I flip a page, I glance up at him and he’s got the same concentrated expression on his face each time. An expression so concentrated on my mouth, it tells me he’s not paying a damn bit of attention to a single word I’m reading. I close the book and bring it to my stomach. I don’t even think he notices I closed the book.\\n\\n “Why’d you stop talking?” he says, never changing his expression or pulling his gaze from my mouth.\\n\\n “Talking?” I ask curiously. “Holder, I’m reading. There’s a difference. And from the looks of it, you haven’t been paying a lick of attention.”\\n\\n He looks me in the eyes and grins. “Oh, I’ve been paying attention,” he says. “To your mouth. Maybe not to the words coming out of it, but definitely to your mouth.”\\n\\n He scoots me off of his chest and onto my back, then he slides down beside me and pulls me against him. Still, his expression hasn’t changed and he’s staring at me like he wants to eat me. I sort of wish he would.\\n\\n He brings his fingers up to my lips and begins tracing them, slowly. It feels so incredible, I’m too scared to breathe for fear he might stop. I swear it’s as though his fingers have a direct line to every sensitive spot on my entire body.\\n\\n “You have a nice mouth,” he says. “I can’t stop looking at it.”\\n\\n “You should taste it. It’s quite lovely.”\\n\\n He squeezes his eyes shut and groans, then leans in and presses his head into my neck. “Stop it, you evil wench.”\\n\\n I laugh and shake my head. “No way. This is your stupid rule, why should I be the one to enforce it?”\\n\\n “Because, you know I’m right. I can’t kiss you tonight because kissing leads to the next thing, which leads to the next thing, and at the rate we’re going we’ll be all out of firsts by next weekend. Don’t you want to drag our firsts out a little longer?” He pulls his head away from my neck and looks back down at me.\\n\\n “Firsts?” I ask. “How many firsts are there?”\\n\\n “There aren’t that many, which is why we need to drag them out. We’ve already passed too many since we met.”\\n\\n I tilt my head sideways so I can look him straight on. “What firsts have we already passed?”\\n\\n “The easy ones. First hug, first date, first fight, first time we slept together, although I wasn’t the one sleeping. Now we barely have any left. First kiss. First time to sleep together when we’re both actually awake. First marriage. First kid. We’re done after that. Our lives will become mundane and boring and I’ll have to divorce you and marry a wife who’s twenty years younger than me so I can have a lot more firsts and you’ll be stuck raising the kids.” He cups my cheek in his hand and smiles at me. “So you see, babe? I’m only doing this for your benefit. The longer I wait to kiss you, the longer it’ll be before I’m forced to leave you high and dry.”\\n\\n I laugh. “Your logic terrifies me. I sort of don’t find you attractive anymore.”\\n\\n He slides on top of me, holding up his weight on his hands. “You sort of don’t find me attractive? That can also mean you sort of do find me attractive.”\\n\\n I shake my head. “I don’t find you attractive at all. You repulse me. In fact, you better not kiss me because I’m pretty sure I just threw up in my mouth.”\\n\\n He laughs, then drops his weight onto one arm, still hovering over me. He lowers his mouth to the side of my head and presses his lips to my ear. “You’re a liar,” he whispers. “You’re a whole lot attracted to me and I’m about to prove it.”\\n\\n I close my eyes and gasp the second his lips meet my neck. He kisses me lightly, right below the ear, and it feels like the whole room just turned into a tilt-a-whirl. He slowly moves his lips back to my ear and whispers, “Did you feel that?”\\n\\n I shake my head no, but barely.\\n\\n “You want me to do it again?”\\n\\n I’m shaking my head no out of stubbornness, but I’m hoping he’s telepathic and can hear what I’m really screaming inside my head, because hell yes, I liked it. Hell yes, I want him to do it again.\\n\\n He laughs when I shake my head no, so he brings his lips closer to my mouth. He kisses me on the cheek, then continues trailing soft pecks down to my ear, where he stops and whispers again. “How about that?”\\n\\n Oh, God, I’ve never been so not bored in my life. He’s not even kissing me and it’s already the best kiss I’ve ever had. I shake my head again and keep my eyes closed, because I like not knowing what’s coming next. Like the hand that just planted itself on my outer thigh and is working its way up to my waist. He slides his hand under my t-shirt until his fingers barely graze the edge of my pants, and he leaves his hand there, slowly moving his thumb back and forth across my stomach. I’m so acutely aware of everything about him in this moment that I’m almost positive I could pick his thumbprint out of a lineup.\\n\\n He runs his nose along my jawline and the fact that he’s breathing just as heavily as I am assures me there’s no way he can wait until after tonight to kiss me. At least that’s what I’m desperately hoping.\\n\\n When he reaches my ear again, he doesn’t speak this time. Instead, he kisses it and there isn’t a nerve ending in my body that doesn’t feel it. From my head all the way down to my toes, my entire body is screaming for his mouth.\\n\\n I place my hand on his neck and when I do, chills break out on his skin. Apparently, that one simple move momentarily melts his resolve and for a second, his tongue meets my neck. I moan and the sound completely sends him into a frenzy.\\n\\n He moves his hand from my waist to the side of my head and he pulls my neck against his mouth, holding nothing back. I open my eyes, shocked at how quickly his demeanor changed. He kisses and licks and teases every inch of my neck, only gasping for air when it’s absolutely necessary. As soon as I see the stars above my head, there isn’t even enough time to count one of them before my eyes roll back in my head and I’m holding back sounds that I’m too embarrassed to utter.\\n\\n He moves his lips further from my neck and closer to my chest. If we didn’t have such a limited supply of firsts, I’d tear my shirt off and make him keep going. Instead, he doesn’t even give me this option. He kisses his way back up my neck, up my chin, and trails soft kisses around my entire mouth, careful not to once touch my lips. My eyes are closed, but I can feel his breath against my mouth, and I know he’s struggling not to kiss me. I open my eyes and look at him and he’s staring at my lips again.\\n\\n “They’re so perfect,” he says, breathlessly. “Like hearts. I could literally stare at your lips for days and never get bored.”\\n\\n “No. Don’t do that. If all you do is stare, then I’ll be the bored one.”\\n\\n He grimaces, and it’s obvious that he’s having a really, really hard time not kissing me. I don’t know what it is about him staring at my lips like he is, but it’s definitely the hottest thing about this whole situation right now. I do something I probably shouldn’t do. I lick them. Slowly.\\n\\n He groans again and presses his forehead against mine. His arm gives way beneath him and he drops his weight on me, pressing himself against me. Everywhere. All of him. We moan simultaneously once our bodies find that perfect connection, and suddenly it’s game on. I’m tearing off his shirt and he’s on his knees, helping me pull it over his head. After it’s completely off, I wrap my legs around his waist and lock him against me, because there could be nothing more detrimental than if he were to pull away right now. \\n\\n","sourceLink":"https://allnovel.net/hopeless-hopeless-1/page-19.html","bookId":2777,"book":{"id":2777,"title":"Hopeless (Hopeless #1)","description":"Storyline: Hopeless (Hopeless #1) \\n Sometimes discovering the truth can leave you more hopeless than believing the lies… \\n That’s what seventeen-year-old Sky realizes after she meets Dean Holder. A guy with a reputation that rivals her own and an uncanny ability to invoke feelings in her she’s never had before. He terrifies her and captivates her all in the span of just one encounter, and something about the way he makes her feel sparks buried memories from a past that she wishes could just stay buried. \\n Sky struggles to keep him at a distance knowing he’s nothing but trouble, but Holder insists on learning everything about her. After finally caving to his unwavering pursuit, Sky soon finds that Holder isn’t at all who he’s been claiming to be. When the secrets he’s been keeping are finally revealed, every single facet of Sky’s life will change forever.\\n","cover":"https://allnovel.net/images/hopeless-hopeless-1.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/hopeless-hopeless-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:18:29 PM"}}
