{"id":86915,"no":33,"title":"Page 33","content":"All of the sudden, my back is being lifted up in the air and I’m not against the pillow anymore. My arms are limp and his are wrapped tightly around me, but I can’t move. My arms are too weak and I’m sobbing too hard. I’m crying so hard and he’s moving me and I don’t know why so I open my eyes. I’m going back and forth and back and forth and for a second, I panic and squeeze my eyes shut, thinking he’s not finished. But I can feel the covers around me and his arm is squeezing my back and he’s soothing my hair with his hand, whispering in my ear. “Baby, it’s okay.” He’s pressing his lips into my hair, rocking me back and forth with him. I open my eyes again and tears are clouding my vision. “I’m sorry, Sky. I’m so sorry.” He’s kissing the side of my head over and over while he rocks me, telling me he’s sorry. He’s apologizing for something. Something he wants me to forgive him for this time. He pulls back and sees that my eyes are open. His eyes are red but I don’t see any tears. He’s shaking though. Or maybe it’s me who’s shaking. I think we’re both shaking. He’s looking into my eyes, searching for something. Searching for me. I begin to relax in his arms, because when his arms are wrapped around me, I don’t feel like I’m falling off the edge of the earth. “What happened?” I ask him. I don’t understand where this is coming from. He shakes his head, his eyes full of sorrow and fear and regret. “I don’t know. You just started counting and crying and shaking and I kept trying to get you to stop, Sky. You wouldn’t stop. You were terrified. What did I do? Tell me baby, because I’m so sorry. I am so, so sorry. What the fuck did I do?” I just shake my head because I don’t have an answer. He grimaces and drops his forehead to mine. “I’m so sorry. I never should have let it go that far. I don’t know what the hell just happened, but you’re not ready yet, okay?” I’m not ready yet? “So we didn’t…we didn’t have sex?” His hands loosen around me and I can feel his whole demeanor shift. The look in his eyes is nothing but loss and defeat. His eyebrows draw apart and he frowns, cupping my cheeks. “Where’d you go, Sky?” I shake my head, confused. “I’m right here. I’m listening.” “No, I mean earlier. Where’d you go? You weren’t here with me because no, nothing happened. I could see on your face that something was wrong, so I didn’t do it. But now you need to think long and hard about where you were inside that head of yours, because you were panicked. You were hysterical and I need to know what it was that took you there so I can make sure you never go back.” He kisses me on the forehead and releases his hold from around my back. He stands up and pulls his jeans on, then picks up my dress. He shakes it out, then flips it over until it slides down his hands, then he walks toward me and puts it on over my head. He lifts my arms and helps me slide them into the dress, then he pulls it down over my waist, covering me. “I’ll go get you some water. I’ll be right back.” He kisses me tentatively on the lips, almost as if he’s scared to touch me again. After he walks out of the room, I lean my head against the wall and close my eyes. I have no idea what just happened, but the fear of losing him because of it is a valid one. I just took one of the most intimate things imaginable, and I turned it into a disaster. I made him feel worthless, like he did something wrong and now he feels bad for me because of it. He probably wants me to leave, and I don’t blame him. I don’t blame him a bit. I want to run away from me, too. I throw the covers off and stand up, then pull my dress down. I don’t even bother looking for my underwear. I need to find the bathroom and get myself together so he can take me home. This is twice this weekend that I’ve been deduced to tears and I don’t even know why—and twice that he’s had to save me. I’m not doing it to him again. When I pass the stairs looking for the restroom, I glance down over the railing into the kitchen. He’s leaning forward with his elbows on the bar and his face buried in his hands. He’s just standing there, looking miserable and upset. I can’t watch him anymore, so I open the first door to my right, assuming it’s the bathroom. It’s not. It’s Lesslie’s bedroom. I start to pull the door shut, but I don’t. Instead, I open it wider and slip inside, then shut it behind me. I don’t care if I’m in a bathroom, a bedroom or a closet…I just need peace and quiet. Time to regroup from whatever the hell is going on with me. I’m beginning to think that maybe I am crazy. I’ve never spaced out that severely before and it terrifies me. My hands are still shaking, so I clasp them together in front of me and try to focus on something else in order to calm myself down. I take in my surroundings and find the bedroom to be somewhat disturbing. The bed isn’t made, which strikes me as odd. Holder’s entire house is spotless, but Lesslie’s bed isn’t made. There’s a pair of jeans in the middle of the floor and it looks like she just stepped out of them. I look around at the room and it seems typical of a teenage girl. Makeup on the dresser, an iPod on the nightstand. It looks like she still lives here. From the look of her room, it doesn’t look like she’s gone at all. It’s obvious no one has touched this room since she died. Her pictures are all still hanging on the walls and stuck to her vanity mirror. All of her clothes are still in her closet, some piled in the closet floor. It’s been over a year since he said she passed away, and I’m willing to bet that no one in his family has accepted it yet. It feels eerie being in here, but it’s keeping my mind off of what’s happening right now. I walk to the bed and look at the pictures hanging on the wall. Most of them are of Lesslie and her friends with just a few of Holder and her together. She looks a lot like Holder with his intense, crystal blue eyes and dark brown hair. What surprises me the most is how happy she looks. She looks so content and full of life in every single picture, it’s hard to imagine what was really going on inside of her head. No wonder Holder didn’t have a clue about how desolate she really felt. She more than likely never let anyone know. I pick up a picture from her nightstand that’s turned facedown. When I flip it over and look at it, I gasp. It’s a picture of her kissing Grayson on the cheek and they have their arms around each other. The picture stuns me and I have to take a seat on the bed to regain my bearings. This is why Holder hates him so much? This is why he didn’t want him touching me? I wonder if he blames Grayson for what she did. I’m holding the picture, still sitting on the bed, when the bedroom door opens. Holder peers around the door. “What are you doing?” He doesn’t seem angry that I’m in here. He does seem uncomfortable, though, which is probably just a reaction from how I made him feel earlier. “I was looking for the bathroom,” I say, quietly. “I’m sorry. I just needed a second.” He leans against the doorway and crosses his arms over his chest while his eyes work their way around the room. He’s taking in everything like I am. Like it’s all new to him. “Has no one been in here? Since she…” “No,” he says quickly. “What would be the point of it? She’s gone.” I nod, then place the picture of Lesslie and Grayson back on the nightstand, facedown like she had left it. “Was she dating him?” He takes a hesitant step into the bedroom, then walks over to the bed. He sits down beside me and rests his elbows on his knees, clasping his hands in front of him. He looks around the room slowly, not answering my question right away. He glances at me, then wraps his arm around my shoulders, pulling me to him. The fact that he’s sitting here with me right now, still wanting to hold me, makes me want to burst into tears. “He broke up with her the night before she did it,” he says quietly. I try not to gasp, but his words shock me. “Do you think he’s the reason why she did it? Is that why you hate him so much?” He shakes his head. “I hated him before he broke up with her. He put her through a lot of shit, Sky. And no, I don’t think he’s why she did it. I think maybe it was the deciding factor in a decision she had wanted to make for a long time. She had issues way before Grayson ever came into the picture. So no, I don’t blame him. I never have.” He stands up and takes my hand. “Come on. I don’t want to be in here anymore.” I take one last glance around the room, then stand up to follow him. I stop before we reach the door, though. He turns around and watches me observe the pictures on her dresser. There’s a framed picture of Holder and Lesslie when they were kids. I pick it up and bring it in closer for inspection. Something about seeing him that young makes me smile. Seeing both of them that young...it’s refreshing. Like there’s innocence about them before the ugly realities of life hit. They’re standing in front of a white-framed house and Holder has his arm around her neck and he’s squeezing her. She’s got her arms wrapped around his waist and they’re smiling at the camera. My eyes move from their faces to the house behind them in the photo. It’s a white-framed house with yellow trim and if you were to see the inside of the house, the living room is painted two different shades of green. I immediately close my eyes. How do I know that? How do I know what color the living room is? My hands start shaking and I try to suck in a breath, but I can’t. How do I know that house? I know that house like I somehow suddenly know the kids in the picture. How do I know there’s a green and white swing set behind that house? And ten feet from the swing set is a dry well that has to stay covered because Lesslie’s cat fell down it once. “You okay?” Holder says. He tries to take the picture out of my hands, but I snatch it from him and look up at him. His eyes are concerned and he takes a step toward me. I take a step back. How do I know him? How do I know Lesslie? Why do I feel like I miss them? I shake my head, looking down at the picture and back up at Holder, then down to the picture again. This time, Lesslie’s wrist catches my eye. She’s wearing a bracelet. A bracelet identical to mine. I want to ask him about it but I can’t. I try, but nothing comes out, so I just hold up the picture instead. He shakes his head and his face drops like his heart is breaking. “Sky, no,” he says, pleadingly. “How?” My voice cracks and is barely audible. I look back down to the picture in my hands. “There’s a swing set. And a well. And…your cat. It got stuck in the well.” I dart my eyes up to his and the thoughts keep pouring out. “Holder, I know that living room. The living room is green and the kitchen had a countertop that was way too tall for us and…your mother. Your mother’s name is Beth.” I pause and try to take a breath, because the memories won’t stop. They won’t stop coming and I can’t breathe. “Holder…is Beth your mother’s name?”","sourceLink":"https://allnovel.net/hopeless-hopeless-1/page-33.html","bookId":2777,"book":{"id":2777,"title":"Hopeless (Hopeless #1)","description":"Storyline: Hopeless (Hopeless #1) Sometimes discovering the truth can leave you more hopeless than believing the lies… That’s what seventeen-year-old Sky realizes after she meets Dean Holder. A guy with a reputation that rivals her own and an uncanny ability to invoke feelings in her she’s never had before. He terrifies her and captivates her all in the span of just one encounter, and something about the way he makes her feel sparks buried memories from a past that she wishes could just stay buried. Sky struggles to keep him at a distance knowing he’s nothing but trouble, but Holder insists on learning everything about her. After finally caving to his unwavering pursuit, Sky soon finds that Holder isn’t at all who he’s been claiming to be. When the secrets he’s been keeping are finally revealed, every single facet of Sky’s life will change forever.","cover":"https://allnovel.net/images/hopeless-hopeless-1.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/hopeless-hopeless-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:18:29 PM"}}
