{"id":86932,"no":50,"title":"Page 50","content":"“Hope.” She continues to look at me patiently while I dig deep for the courage to speak to her…to tell her everything she needs to know. “Do you know that you’re one of the bravest little girls I’ve ever met?”\n She shakes her head and looks down at the grass. “No, I’m not,” she says quietly, convinced in her belief.\n I reach out and take her other hand in mine and look her directly in the eyes. “Yes, you are. You’re incredibly brave. And you’re going to make it through this because you have a very strong heart. A heart that is capable of loving so much about life and people in a way you never dreamt a heart could love. And you’re beautiful.” I press my hand to her heart. “In here. Your heart is so beautiful and someday someone is going to love that heart like it deserves to be loved.”\n She pulls one of her hands back and wipes her eyes with it. “How do you know all that?”\n I lean forward and wrap my arms around her completely. She returns my embrace by putting her arms around me and letting me hold her. I lean my head down and whisper in her ear. “I know, because I’ve been through exactly what you’re going through. I know how bad it hurts your heart that your daddy does this to you, because he did it to me, too. I know how much you hate him for it, but I also know how much you love him because he’s your daddy. And it’s okay, Hope. It’s okay to love the good parts of him because he’s not all bad. It’s also okay to hate those bad parts of him that make you so sad. It’s okay to feel whatever you need to feel. Just promise me that you will never, ever feel guilty. Promise me that you will never blame yourself. It’s not your fault. You’re just a little girl and it’s not your fault that your life is so much harder than it should be. And as much as you’ll want to forget these things ever happened to you and as much as you’ll want to forget this part of your life existed, I need for you to remember.”\n I can feel her arms trembling against me now and she’s quietly crying against my chest. Her tears force the release of my own tears. “I want you to remember who you are, despite the bad things that are happening to you. Because those bad things aren’t you. They are just things that happen to you. You need to accept that who you are, and the things that happen to you, are not one and the same.”\n I gently lift her head off of my chest and look into her brown, tearful eyes. “Promise me that no matter what, you will never be ashamed of who you are, no matter how bad you want to be. And this might not make sense to you right now, but I want you to promise me that you will never let the things your daddy does to you define and separate you from who you are. Promise me that you will never lose Hope.”\n She nods her head as I wipe her tears away with my thumbs. “I promise,” she says. She smiles up at me and for the first time since seeing her big brown eyes, there’s a trace of life in them. I pull her onto my lap and she wraps her arms around my neck as I hold her and rock her, both of us crying in each other’s arms.\n “Hope, I promise that from this point forward, I will never, ever let you go. I’m going to hold you and carry you with me in my heart forever. You’ll never have to be alone again.”\n I’m crying into Hope’s hair, but when I open my eyes I’m crying into Holder’s arms. “Did you talk to her?” he asks.\n I nod my head. “Yes.” I’m not even trying to choke back the tears. “I told her everything.”\n Holder begins to sit up, so I move up with him. He turns toward me and takes my face in his hands. “No, Sky. You didn’t tell her everything…you told you everything. Those things happened to you, not to someone else. They happened to Hope. They happened to Sky. They happened to the best friend that I loved all those years ago, and they happened to the best friend I love who’s looking back at me right now.” He presses his lips to mine and kisses me, then pulls away. It’s not until I look back at him that I notice he’s crying with me. “Baby, you need to be proud of the fact that you survived everything you went through as a child. Don’t separate yourself from that life. Embrace it, because I’m so fucking proud of you. Every smile I see on your face just blows me away, because I know the courage and strength it took when you were just a little girl to ensure that part of you remained. And your laugh? My God, Sky. Think about how much courage it took you to laugh again after everything that happened to you. And your heart…” he says, shaking his head disbelievingly. “How your heart can possibly find a way to love and trust a man again proves that I’ve fallen in love with the bravest woman I’ve ever known. I know how much courage it took for you to allow me in after what your father did to you. And I swear I will spend every last breath thanking you for allowing yourself to love me. Thank you so much for loving me, Linden Sky Hope.”\n He pronounces each of my names slowly, not even attempting to wipe away my tears because there are too many. I throw my arms around his neck and let him hold me. All seventeen years of me.\n Tuesday, October 30th, 2012 9:05 a.m.\n The sun is so bright; it’s beaming through the blanket I’ve pulled over my eyes. It’s not the sun that woke me up, though. It was the sound of Holder’s voice.\n “Look, you have no idea what she’s been through the past two days,” Holder says. He’s trying to speak softly, either in an attempt not to wake me, or in an attempt for me not to hear his conversation. I don’t hear anyone speak in return, so he must be on the phone. Who the hell is he talking to, though?\n “I understand your need to defend her. Believe me, I do. But you both need to know that she’s not walking inside that house alone.”\n There’s a long pause before he sighs heavily into the phone. “I need to make sure she eats something, so give us some time. Yes, I promise. I’m waking her up as soon as I hang up. We’ll leave within the hour.”\n He doesn’t say goodbye, but I hear the phone drop onto the table. Within seconds, the bed dips and he’s sliding an arm around me. “Wake up, babe,” he says into my ear.\n I don’t move. “I am awake,” I say from underneath the covers. I feel his head press into my shoulder.\n “So you heard that?” he asks, his voice low.\n “Who was it?”\n He shifts on the bed and pulls the covers off of my head. “Jack. He claims Karen confessed everything to him last night. He’s worried about her. He needs you to talk to her.”\n My heart stops mid-beat. “She confessed?” I ask warily, sitting up in the bed.\n He nods. “We didn’t go into details, but he seems to know what’s going on. I did tell him about your father, though…only because Karen wanted to know if you saw him. When I woke up today it was on the news. They ruled it a suicide, based on the fact that he called it in himself. They aren’t even opening it for investigation.” He holds my hand and caresses it with his thumb. “Sky, Jack sounds desperate for you to come back. I think he’s right…we need to go back and finish this. You won’t be alone. I’ll be there and Jack will be there. And from the sound of it, Karen is cooperating. I know it’s hard but we don’t have a choice.”\n He’s talking to me like I need to be convinced, when really I’m ready. I need to see her face-to-face in order to get the last of my questions answered. I throw the covers off of me completely and scoot off the bed, then stand up and stretch. “I need to brush my teeth and change first. Then we can go.” I walk to the bathroom and don’t turn around, but I can feel the pride rolling off of him. He’s proud of me.\n Holder hands me his cell phone once we’re on the road. “Here. Breckin and Six are both worried about you. Karen got their numbers out of your cell phone and has been calling them all weekend, trying to find you.”\n “Did you talk to either of them?”\n He nods. “I spoke with Breckin this morning, right before Jack called. I told him you and your mother got into a fight and you just wanted to get away for a few days. He’s fine with that explanation.”\n “What about Six?”\n He glances at me and gives me a half smile. “Six you might need to contact. I’ve been talking to her through email. I tried to appease her with the same story I told Breckin, but she wasn’t buying it. She said you and Karen don’t fight and I need to tell her the truth before she flies back to Texas and kicks my ass.”\n I wince, knowing Six must be worried sick about me. I haven’t texted her in days, so I decide to put off calling Breckin and shoot Six an email, instead.\n “How do you email someone?” I ask. Holder laughs and takes his phone, pressing a few buttons. He hands it back to me and points to the screen.\n “Just type what you need to say in there, then hand it back to me and I’ll send it.”\n I type out a short email, telling her that I found out a few things about my past and I needed to get away for a few days. I assure her that I’ll call her to explain everything in the next few days, but I’m really not sure that I’ll actually tell her the truth. At this point, I’m not sure I want anyone to know about my situation. Not until I have all the answers.\n Holder sends the email, then takes my hand and laces his fingers through mine. I focus my gaze out the window and stare up at the sky.\n “You hungry?” he asks, after driving in complete silence for over an hour. I shake my head. I’m too nervous to eat anything, knowing I’m about to face Karen. I’m too nervous to even hold a normal conversation. I’m too nervous to do anything but stare out the window and wonder where I’ll be when I wake up tomorrow.\n “You need to eat, babe. You’ve barely eaten anything in three days and with your tendency to pass out, I don’t think food would be a bad idea right now.”\n He won’t give up until I eat, so I just relent. “Fine,” I mumble.\n He ends up choosing a roadside Mexican Restaurant after I fail to make a choice as to where to eat. I order something off the lunch menu, just to appease him. I more than likely won’t be able to eat anything.\n “You want to play Dinner Quest?” he says, dipping a tortilla chip into his salsa.\n I shrug. I really don’t want to face what I’ll be doing in five hours, so maybe this will help get my mind off of things. “I guess. On one condition, though. I don’t want to talk about anything that has anything to do with the first few years of my life, the last three days or the next twenty-four hours.”\n He smiles, seemingly relieved. Maybe he doesn’t want to think about any of it, either.\n “Ladies first,” he says.\n “Then put down that chip,” I say, eyeing the food he’s about to put in his mouth.\n His eyes drop to the chip and he frowns playfully. “Make it a quick question then, because I’m starving.”\n I take advantage of my turn by downing a drink of my soda, then taking a bite of the chip that I just took out of his hands. “Why do you love running so much?” I ask. \n","sourceLink":"https://allnovel.net/hopeless-hopeless-1/page-50.html","bookId":2777,"book":{"id":2777,"title":"Hopeless (Hopeless #1)","description":"Storyline: \n Hopeless (Hopeless #1) \n Sometimes discovering the truth can leave you more hopeless than believing the lies… \n That’s what seventeen-year-old Sky realizes after she meets Dean Holder. A guy with a reputation that rivals her own and an uncanny ability to invoke feelings in her she’s never had before. He terrifies her and captivates her all in the span of just one encounter, and something about the way he makes her feel sparks buried memories from a past that she wishes could just stay buried. \n Sky struggles to keep him at a distance knowing he’s nothing but trouble, but Holder insists on learning everything about her. After finally caving to his unwavering pursuit, Sky soon finds that Holder isn’t at all who he’s been claiming to be. When the secrets he’s been keeping are finally revealed, every single facet of Sky’s life will change forever.\n \n","cover":"https://allnovel.net/images/hopeless-hopeless-1.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/hopeless-hopeless-1.html","creation":"Oct 5, 2019 8:59:22 AM","modification":"Oct 5, 2019 5:18:29 PM"}}
