{"id":78955,"no":15,"title":"Page 15","content":"Rhone was surprised by the change in topic. He slowly nodded. \"I remember.\" \"You stood by me then, Rhone. You\u0027re the only one who knows about James. Have I ever asked to pay you back for your friendship?\" \"Of course not. I would have been insulted.\" A long moment stretched between the two men. Then Rhone actually grinned. \"May I at least tell my father that you—\" \"No,\" Lyon interrupted, his voice soft. \"I don\u0027t want him to realize I know what happened to him. Let him think his son is the only one who knows, that you came to his assistance.\" \"But Lyon, surely—\" \"Let it rest, Rhone. Your father is a proud man. Don\u0027t take that away from him.\" Rhone nodded again. \"Tell me what you know about my father\u0027s problems.\" \"I recognized you at Baker\u0027s, of course,\" Lyon began, smiling over the start that statement gave his friend. \"It was foolish of you to—\" \"You weren\u0027t supposed to be there,\" Rhone muttered. \"Why did you attend his party? You can\u0027t stand Baker any more than I can.\" Lyon chuckled. \"The most carefully laid plans,\" he drawled. \"For all his good points, your father is still a little naive, isn\u0027t he, Rhone? Baker and his cohorts took advantage, of course. Baker would have been the one to set up the games. Let\u0027s see if I have this straight. He would have included Buckley, Stanton, and Wellingham in the farce, too. They\u0027re all bastards. Did I get all the names, Rhone?\" His friend was astonished. \"How did you learn all this?\" \"Do you honestly think I wouldn\u0027t know about their little club? Your father isn\u0027t the only one to fall victim to their scheme.\" \"Does everyone know?\" \"No,\" Lyon answered. \"There isn\u0027t a hint of a scandal about your father. I would have heard of it.\" \"You\u0027ve been out of circulation, Lyon. How can you be so sure?\" Lyon gave Rhone a look of exasperation. \"With my line of work, you can seriously ask me that question?\" Rhone grinned. \"I thought you might have gotten a little rusty,\" he said. \"Father is still hiding in his country home. He\u0027s so ashamed of his own gullibility he won\u0027t show his face. He\u0027ll be relieved to learn no one is the wiser.\" \"Yes, he can come out of hiding now. And you can give up this foolish plan of yours. You\u0027ll eventually get caught.\" \"You\u0027d never turn me in.\" Rhone\u0027s voice was filled with conviction. \"No, I wouldn\u0027t,\" Lyon acknowledged. \"How was it done, Rhone? Did Baker mark the cards?\" \"Yes. They are all blatant cheats, which of course is all the more humiliating for my father. He\u0027s feeling duped.\" \"He was duped,\" Lyon said. \"Will you give it up, Rhone?\" Rhone let out a harsh groan. \"Damn it all, Lyon. I\u0027m itching to get even.\" Lyon took a drink of his brandy. \"Ah,\" he drawled. \"Now you\u0027ve touched on my area of expertise. Perhaps, Rhone, a game of chance is what is needed.\" Lyon grinned when Rhone finally caught his meaning. \"You mean to give them a dose of their own medicine, to cheat the cheaters?\" \"It would be easy enough to accomplish.\" Rhone slapped his hand on the tabletop, then let out a groan. \"I keep forgetting about this injury,\" he excused. \"Count me in, Lyon. I\u0027ll leave the details to you. As you just admitted, you\u0027re better versed in trickery than I am.\" Lyon laughed. \"I\u0027ll take that as a compliment.\" Another knock sounded at the door, interrupting their conversation. \"Now what is it?\" Rhone shouted. \"I\u0027m sorry to disturb you, my lord, but Princess Christina is here to see you,\" the servant shouted back. The announcement gave Rhone a start. Lyon didn\u0027t look too happy with the news either. He glared at Rhone. \"Have you been after Christina, Rhone? Did you invite her here?\" \"No,\" Rhone answered. \"My charms must have impressed her after all, Lyon.\" He grinned when Lyon\u0027s scowl increased. \"So it is as I guessed. You\u0027re more than mildly interested in our little Princess.\" \"She isn\u0027t our little Princess,\" Lyon snapped. \"She belongs to me. Understood?\" Rhone nodded. \"I was only jesting,\" he said with a sigh. \"Send her in,\" he bellowed to his servant. Lyon didn\u0027t move from his position. Christina hurried into the library as soon as the door was opened for her. She spotted Lyon immediately and came to an abrupt stop. \"Oh, I didn\u0027t mean to interrupt your conference, sir. I shall come back later, Rhone.\" Christina frowned at Lyon, turned, and started back out the door. Lyon let out a long, controlled sigh. He carefully put his glass down on the desk, then stood up. Christina saw him out of the corner of her eye. She ignored Rhone\u0027s pleas for her to stay and continued to move toward the front door. Lyon trapped her just as she reached for the handle. His hands settled on the door on either side of Christina\u0027s face. Her back touched his chest. Lyon smiled when he saw how rigid her shoulders became. \"I really must insist you stay,\" he whispered against her ear. A tremor of warmth shook Christina. She slowly edged around until she was facing Lyon. \"And I really must insist upon leaving, sir,\" she whispered. She pushed one hand against his chest, hoping to dislodge him. He didn\u0027t budge. He gave her a rascal\u0027s grin, then leaned down and kissed her. Rhone\u0027s deep chuckle interrupted his desire to continue. Christina immediately blushed over the intimacy. Didn\u0027t the man realize he wasn\u0027t supposed to show affection in front of others? She guessed he didn\u0027t. Lyon winked at her before grabbing hold of her hand and dragging her back inside the library. She was wearing a light blue gown. Lyon deliberately checked to see if she\u0027d remembered to put her shoes on. He wasn\u0027t disappointed to see she had. Rhone hurried back to his chair. He hid his bandaged arm in his lap. Christina refused to sit down. She stood beside Lyon, trying to ignore him altogether. He put his booted feet back up on the edge of Rhone\u0027s desk and reached for his glass. She gave him a disgruntled look. If the man was any more relaxed, he\u0027d fall asleep. It soon became awkward. Rhone was looking at her expectantly. Christina clutched the blue receptacle in her left hand and kept trying to pull her other hand out of Lyon\u0027s hold. He\u0027d forgotten to let go of her. \"Was there something in particular you wished to speak to me about?\" Rhone prodded gently. He tried to put Christina at ease. The poor woman looked terribly worried. \"I\u0027d hoped to find you alone,\" Christina announced. She gave Lyon a meaningful look. \"Were you about to take your leave, Lyon?\" \"No.\" His abrupt answer was given in such a cheerful voice, Christina smiled. \"I would like to speak to Rhone in private, if you don\u0027t mind.\" \"Ah, sweet, but I do mind,\" Lyon drawled out. He increased his grip on her hand, then suddenly jerked her off balance. She landed right where he wanted her. Christina immediately started to struggle out of his lap. Lyon circled her waist with one arm, anchoring her to him. Rhone was amazed. He\u0027d never seen Lyon act in such a spontaneous manner. To show such open possessiveness was certainly out of character. \"Princess Christina? You may speak freely in front of Lyon,\" Rhone advised. \"I may?\" Christina asked. \"Then he knows?\" When Christina hesitated, Rhone announced, \"Lyon is privy to all my secrets, my dear. Now what is it you wanted to say to me?\" \"Well, I was wondering, sir, how you\u0027re feeling.\" Rhone blinked several times. \"Why, I\u0027m feeling very well,\" he replied awkwardly. \"That is all you wanted to ask me?\" The two of them were dancing around the real issue, to Lyon\u0027s way of thinking. \"Rhone, Christina wants to know how your injury is doing. Isn\u0027t that right, Christina?\" \"Oh, then you do know?\" Christina asked, turning to look at Lyon. \"You know?\" Rhone\u0027s voice cracked. \"She knows,\" Lyon confirmed, chuckling over the flabbergasted look on Rhone\u0027s face. \"Well, hell, who doesn\u0027t know?\" \"You sound pathetic,\" Lyon told his friend. \"It was the color of your eyes, Rhone,\" Christina explained, giving him her attention again. \"They\u0027re an unusual shade of green, and very easy to remember.\" She paused to give him a sympathetic look. \"And you did look right at me. I really didn\u0027t mean to recognize you. It just happened,\" she ended with a delicate shrug. \"Are we putting all our cards on the table?\" Rhone asked, leaning forward to give Christina an intent look. \"I don\u0027t understand,\" Christina said. \"I don\u0027t have any cards with me.\" \"Christina takes everything you say in its literal sense, Rhone. It\u0027s a trait guaranteed to make you daft. Believe me, I know.\" \"That is most uncharitable of you, Lyon,\" Christina announced, glaring at him. \"I don\u0027t know what you mean when you say I\u0027m literal. Is it yet another insult I should take exception to, perchance?\" \"Rhone is asking you if he may speak freely,\" Lyon told Christina. \"Hell, I feel like an interpreter.\" \"Of course you may speak freely to me,\" Christina announced. \"No one\u0027s holding a knife to your neck, Rhone. I\u0027ve some medicine with me. I\u0027d like to tend your injury, Rhone. You probably haven\u0027t had proper care.\" \"I couldn\u0027t very well call upon my physician, now could I?\" Rhone said. \"Oh, no, you\u0027d be found out,\" Christina said. She scooted off Lyon\u0027s lap and went to Rhone\u0027s side. Rhone didn\u0027t protest when she began to unwrap his badly fashioned bandage. Both men watched as Christina opened a small jar of horrid-smelling salve. \"My God, what\u0027s in there? Dead leaves?\" \"Yes,\" Christina answered. \"Among other things.\" \"I was jesting,\" Rhone said. \"I wasn\u0027t.\" \"The smell will keep me hidden,\" Rhone muttered. \"What else is in there?\" he asked, taking another sniff of the foul medicine. \"You don\u0027t want to know,\" Christina answered. \"It\u0027s best not to ask Christina questions, Rhone. The answers will only confuse you.\" Rhone took Lyon\u0027s advice. He watched Christina pat a large amount of the brown-colored salve on the cut, then rewrap the arm. \"You have a nice scent, Rhone. Of course, the salve will soon remove it.\" \"I have a nice scent?\" Rhone looked as though he\u0027d just been handed England\u0027s crown. He thought he should return her compliment. \"You smell like flowers,\" he told her, then promptly laughed over saying such a thing. It was the truth, but certainly ungentlemanly of him to comment upon. \"You\u0027re the one with the unusual eyes, Christina. They\u0027re the most wonderful color of blue.\" \"That\u0027s quite enough,\" Lyon interjected. \"Christina, hurry up and finish your task.\" \"Why?\" Christina asked. \"He doesn\u0027t want you standing so close to me,\" Rhone explained. \"Give it up, Rhone.\" Lyon\u0027s voice had turned hard. \"You aren\u0027t going to pursue Christina, so you can save your charms for someone else.\" \"Lady Diana would like your charms very much, Rhone,\" Christina interjected. She smiled at the reaction her comment caused in both men. Rhone looked perplexed. Lyon looked appalled. \"Lyon, you don\u0027t own me. It is therefore unreasonable of you to dictate to other gentlemen. If I wanted Rhone\u0027s attention, I would let him know it.\" \"Why do you suggest Lyon\u0027s sister would like my attention?\" Rhone asked. He was highly curious about her strange remark. Christina replaced the jar in her receptacle before answering. \"You English are so narrow-minded in your thinking sometimes. It\u0027s obvious Lady Diana is taken with you, Rhone. You only have to look at her to see the adoration in her eyes. And if you count the way you look after her, why, you\u0027d realize you were meant for each other.\" \"Oh, God.\" It was Lyon who groaned out the words. Both Christina and Rhone ignored him. \"How can you be so certain?\" Rhone asked. \"You only met her once, and you couldn\u0027t have spent more than fifteen minutes with her. No, I think you\u0027re imagining this infatuation. Diana\u0027s just a child, Christina.\" \"Believe what you will,\" Christina answered. \"What will happen will happen.\" \"I beg your pardon?\" Rhone looked confused again. Lyon shook his head. It was good to know he wasn\u0027t the only one dimwitted around Christina. \"Destiny, Rhone,\" Lyon interjected. \"I really must leave now. Aunt Patricia believes I\u0027m resting in my room,\" she confessed. \"You will have to share my confidence, Rhone. Or should I call you Jack now?\" \"No.\" \"I was only jesting, sir. Do not be so distressed,\" Christina said. Rhone sighed. He reached out to take hold of Christina\u0027s hand, thinking to keep her by his side while he thanked her properly for tending his injury. Christina moved so quickly Rhone was left reaching for air. Before he could blink, she was standing next to Lyon\u0027s chair again. Lyon was just as surprised. He was arrogantly pleased, too, for even though Christina probably wasn\u0027t aware of what she\u0027d done, she had instinctively moved back to him. There was some kind of little victory in that choice, wasn\u0027t there? \"Christina, if you recognized me, why didn\u0027t you tell Baker and the others?\" Rhone asked. She took exception to his question. \"They\u0027ll have to find out on their own,\" she said. \"I would never break a confidence, Rhone.\" \"But I didn\u0027t ask you to keep this confidence,\" Rhone stammered. \"Don\u0027t try to understand her, Rhone. It will be your undoing,\" Lyon advised with a grin. \"Then please answer me this,\" Rhone asked. \"Did you see who threw the knife at me?\" \"No, Rhone. In truth, I was too frightened to look behind me. If Lyon hadn\u0027t been there to protect me, I think I would have swooned.\" Lyon patted her hand. \"The pistol wasn\u0027t loaded,\" Rhone protested. \"Did you think I\u0027d actually hurt someone?\" Lyon prayed for patience. \"I cannot believe you set out to rob Baker with an empty pistol.\" \"Why would you use an empty weapon?\" Christina asked.","sourceLink":"https://allnovel.net/the-lion-s-lady-crown-s-spies-1/page-15.html","bookId":1792,"book":{"id":1792,"title":"The Lion\u0027s Lady (Crown\u0027s Spies #1)","description":"Storyline: Christina Bennett had taken London society by storm. The ravishing beauty guarded the secret of her mysterious past until the night Lyon, Marquis of Lyonwood, stole a searching, sensuous kiss. An arrogant nobleman with a pirate\u0027s passions, he tasted the wild fire smoldering beneath Christina\u0027s cool charm and swore to possess her... But the feisty and defiant Christina would not be so easily conquered. Mistress of her heart and of her fortune, she resisted Lyon\u0027s sensuous caresses. She dared not surrender to his love...for then, she must also forsake her precious secret...and her promised destiny!","cover":"https://allnovel.net/images/the-lion-s-lady-crown-s-spies-1.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-lion-s-lady-crown-s-spies-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 4:11:15 PM"}}
