{"id":78971,"no":31,"title":"Page 31","content":"\"Then why? You\u0027ve told me I\u0027m not at all sensible, that I try to make you daft—\"\n \"Your money.\"\n \"What?\" Christina pulled out of his arms to look into his face. There was a definite sparkle in his eyes. \"You\u0027re jesting with me. You didn\u0027t know I had any money until after we\u0027d wed.\"\n \"How astute of you to remember,\" Lyon said. He kissed the frown away from her face, then draped his arm around her shoulder.\n Christina rested against his shoulder. The continuous clip of the horses and the rocking motion of the carriage made her sleepy and content.\n \"Lyon? You haven\u0027t asked me why I married you,\" she whispered several minutes later.\n \"I already know why you married me, love.\"\n She smiled over his arrogant comment. \"Then explain it to me, please. I still haven\u0027t come to understand it.\"\n He gave her a squeeze to let her know he wasn\u0027t amused by her announcement. \"First, there are the scars. You happen to love my flawed body.\"\n \"And how would you know that?\" she asked, pretending outrage.\n \"You can\u0027t keep your hands off me,\" he told her. \"Second, I remind you of a warrior.\"\n Christina shook her head. \"You haven\u0027t any humility,\" she told him. \"And you are a warrior, Lyon. A vain one, yes, but a warrior all the same.\"\n \"Ah, vanity,\" Lyon drawled. \"Does that mean you might have to use your knife on me?\"\n \"What are you talking about?\"\n \"Lady Cecille. You did threaten to—\"\n \"So you were listening to our conversation in the library.\" Christina sounded stunned. \"You lied to me. That is shameful.\"\n \"I lied to you?\" Lyon\u0027s voice was incredulous. \"You, of course, have always been honest with me.\"\n \"You will have to cast Lady Cecille aside,\" Christina announced, flipping the subject to avoid another argument. \"I won\u0027t be wed to a roamer.\"\n \"A what?\"\n \"A man who chases other women,\" Christina explained. \"I shall be true to you, and you must be true to me. Even though it is fashionable in England to take a lover, you aren\u0027t going to have one. And that\u0027s that.\"\n He was surprised by the vehemence in her tone. He hadn\u0027t known she had such an assertive manner. In truth, her demand pleased him immensely. \"You\u0027re a bossy bit of goods, do you know that?\" he whispered. He kissed her again in a leisurely fashion.\n Christina realized he hadn\u0027t given her his promise, but she decided not to press the issue. Later would be soon enough.\n She was about to fall asleep when they reached Lyonwood. Lyon nudged her out of her sleepy state. \"We\u0027re home, Christina.\"\n The carriage rounded the curve in the road. The wilderness suddenly disappeared.\n The land had been transformed into a lush, well-manicured lawn. There were sculptured bushes lining the circle drive of gravel, with wildflowers of bold colors woven between the trees. At the top of the gently sloping hill stood Lyon\u0027s magnificent home.\n Christina thought it looked like a palace. The house was made of gray and brown stone, double storied, with windows one above the other all across the front of the house. Bright green ivy splattered the stones.\n \"Lyonwood is as handsome as its master,\" Christina whispered. \"I shall never remember how to get around.\"\n \"You get around me well enough,\" Lyon remarked. \"I\u0027m sure you\u0027ll conquer your new home just as swiftly.\"\n Christina smiled at his teasing manner. \"How many of your family members live here with you? Will I meet all of your relatives today, do you suppose?\"\n \"I suppose not,\" Lyon answered. \"I live by myself.\" He laughed when he saw her astonished reaction. \"Now, of course, my gentle little wife will live with me.\"\n \"How many bedchambers are there?\"\n \"Just twelve,\" Lyon answered with a shrug. The carriage stopped in the center of the circle just as the front door opened. Lyon\u0027s butler, a stout, dark-haired young man by the name of Brown, led the parade of servants down the four steps. The staff lined up behind their leader. Their uniforms were starched, as well as their stance, and though they kept their expressions contained, every gaze was directed upon their new mistress.\n Lyon refused assistance in helping his wife out of the carriage. Her hands were cold and her nose pink from the brisk, windy ride. He thought she might be a bit nervous meeting his servants for the first time, and so he kept her hand clasped in his.\n It didn\u0027t take him long to realize she wasn\u0027t the least bit nervous. Her manner was worthy of a queen… or a princess, Lyon thought with a grin. There was an air of quiet dignity in her bearing. She was gracious as she greeted each one, attentive when she listened to their explanations of what their duties were.\n She captivated them, of course, just as she\u0027d captivated him. Even Brown, his dour-faced butler, was affected. When Christina took hold of his hand and announced that it was obvious to her he\u0027d done his duty well, the man\u0027s face broke into a spontaneous smile.\n \"I shall not give you interference, Mr. Brown,\" she explained.\n Brown looked relieved at that announcement. He turned then to address his employer. \"My lord, we have prepared both your chamber and the adjoining one for the Marchioness.\"\n Christina looked up at her husband, fully expecting him to set the man straight. When Lyon simply nodded and took hold of her elbow to walk up the steps, she forced a smile for the watching servants while she whispered her displeasure to her husband.\n \"I shall not have my own room, Lyon. I am your wife now. I must share your blankets. And I really don\u0027t want a lady\u0027s maid.\" Looking around, she added, \"Heavens, Lyon, this entryway is larger than your whole townhouse.\"\n Christina wouldn\u0027t have been surprised if she\u0027d heard an echo. The entrance was gigantic. The floors were polished to a gleam. There was a large sitting room on the left, another of equal proportions on the right. A hallway began to the left of the circular staircase. Lyon explained that the dining room was adjacent to the sitting room, with the gardens behind. The kitchens, he added, were on the opposite side.\n Their bedrooms were linked by a door. \"I\u0027ll have your clothes moved in here,\" Lyon told Christina when she gave him a good frown. He motioned to his bed with a raised eyebrow and asked her if she\u0027d like to see if it was comfortable enough.\n \"You look just like a rascal,\" Christina laughed. \"I should like a bath, Lyon, and then I would like to see your stables. You do keep horses here, don\u0027t you?\"\n \"But you don\u0027t like to ride,\" Lyon reminded her.\n \"Never mind that,\" Christina answered.\n \"Christina, if you don\u0027t think you\u0027ll be happy with Kathleen, I will assign the task of lady\u0027s maid to another.\"\n \"Oh, Kathleen seems very capable,\" Christina answered. \"I just don\u0027t want any maids.\"\n \"Well, you\u0027re having one,\" Lyon announced. \"I won\u0027t always be here to fasten your gowns, love, so quit scowling at me.\"\n Christina sauntered over to the windows. \"You\u0027re a bossy bit of goods, do you know that, Lyon?\" she announced.\n Lyon grabbed her from behind. He placed a wet kiss on the column of her throat. \"I really insist that you try the bed.\"\n \"Now?\"\n Christina turned to watch Lyon walk over to the door. When he turned the lock and faced her again she could see he wasn\u0027t jesting. He gave her his most intimidating look, then motioned her over with an arrogant nod of his head.\n \"I\u0027m covered with dust.\"\n \"So am I.\"\n She was already breathless, and he hadn\u0027t even touched her yet.\n Christina kicked off her shoes and walked over to the bed. \"Will you always be this demanding with your wife?\" she asked him.\n \"Yes,\" Lyon answered. He discarded his jacket and his shoes, then went to Christina. \"Will my wife always be this submissive?\" he asked as he pulled her into his arms.\n \"It\u0027s the wife\u0027s duty, isn\u0027t it, to be submissive to her husband?\" Christina asked.\n \"It is,\" Lyon answered. His hands moved to the fastenings on her dress. \"Oh, yes, it definitely is.\"\n \"Then I shall be submissive, Lyon,\" Christina announced. \"When it suits me.\"\n \"A man can\u0027t ask for more than that,\" Lyon said with a grin.\n Christina threw her arms around his neck and kissed him passionately. She wasn\u0027t submissive now. Her tongue darted inside his mouth to rub against his. She knew he liked her aggressiveness. His hold tightened around her waist and he growled his pleasure.\n \"My love, I think I\u0027m going to tear another gown,\" he whispered.\n He didn\u0027t sound overly contrite. And his wife\u0027s soft laughter told him it really didn\u0027t matter to her.\n The following two weeks were as wonderful and magical to Christina as the early pages of Sir Thomas Mallory\u0027s story of Camelot. The weather accommodated her fantasy, for it only rained during the black night hours.\n Christina and Lyon spent most of the sun-filled days exploring the vast wilderness surrounding his home.\n She was amazed that one man could own so much land.\n He was astonished that one woman could know so much about it.\n Christina gave him the gift of awareness and a new appreciation for the wonders of nature.\n Lyon began to realize how important her freedom was to her. She was happiest when they were outside. Her joy was contagious. Lyon found himself laughing with just as much joy as he tramped through the jungle of bushes in pursuit of his wife.\n They always ended their days in front of a peaceful stream they\u0027d chanced upon quite by accident their first day out, and usually soaked their feet in the cool water while they ate the meal the cook had thoughtfully prepared for them.\n On one such afternoon, Lyon decided to tease his wife. He plucked a leaf from the nearest shrub and pretended that he was going to eat it. Christina wasn\u0027t amused. She slapped the leaf out of his hand, admonished him for his ignorance, and then explained that the leaf was poisonous and that he shouldn\u0027t be putting plants in his mouth anyway. If he was that hungry, she\u0027d be more than happy to give him her portion of their meal.\n Friday morning arrived too soon for Lyon\u0027s liking. He had to return to London to meet with Rhone and their unknowing victims for a game of cards.\n Lyon was extremely reluctant to leave his gentle little wife even for one evening.\n Lyon awakened early to find his wife sound asleep on the floor again. He immediately lifted her into his arms and put her back in his bed. Her skin felt cold to him, and he used his hands and his mouth to warm her.\n He was hard and throbbing when Christina finally opened her eyes. His mouth was fastened on her breast, his tongue like rough velvet as it brushed against her nipple. He began to suckle while his hands stoked the growing fire inside her.\n He knew just where to touch, just how to drive her wild. His fingers slipped inside her, drawing a breathless moan from her, then withdrew to tease and torment, and then thrust inside again.\n Christina wanted to touch him. \"Lyon.\" She could barely get his name out. His mouth had moved to her stomach to place wet, hot kisses there while his fingers continued their magic.\n She couldn\u0027t catch her breath. \"Tell me you want this,\" Lyon demanded, his voice hoarse now. His head was slowly moving toward the junction of her legs. \"Tell me, Christina,\" he whispered. His breath was warm against her sensitive skin. His fingers plunged deep and then withdrew to be replaced by his mouth, his tongue.\n What he was doing to her made her forget to breathe. Her eyes were tightly closed and her hands clutched the sheets. The pressure grew inside her until it consumed her. Emotion swept through her like a blaze out of control.\n \"Lyon!\"\n \"Do you like this, love?\"\n \"Yes. Oh, God, yes… Lyon, I\u0027m going to—\"\n \"Let it happen, Christina,\" he demanded in a rough, husky voice.\n He wouldn\u0027t let her hold on to her control. The tension was unbearable as the fire rushed through her body.\n Christina arched against him, cried out his name in a soft gasp. The splendor still captivated her when Lyon plunged inside her.\n He was too greedy to hold back. His breathing was ragged against her ear.\n \"You like this, don\u0027t you, love?\" he demanded.\n \"Yes, Lyon,\" she whispered.\n \"Put your legs around me, take me…\" The order ended on an intense groan. Christina had wrapped her arms and her legs around him, pulling him high inside her. Her nails raked his shoulders, her grip tight and sweet, as tight and sweet and hot as her sheath.\n He grunted his satisfaction. Christina slowly moved her hips. \"Do you like that, Lyon?\" she whispered as she pushed up against him again.\n He couldn\u0027t answer her. But his body showed her how very much he did like it. And when he spilled his seed into her, he thought he\u0027d died and gone to heaven.\n An hour later, Lyon walked with Christina down the steps, his arm draped around her shoulders possessively.\n Brown was waiting at the bottom of the steps. After announcing that the stablemaster had Lyon\u0027s mount ready and waiting out front, the butler discreetly withdrew so that the Marquess could have another minute alone with his wife to give her a proper farewell.\n \"Christina, when you get over your fear of horses we\u0027ll go riding every—\"\n \"I\u0027m not afraid of horses,\" Christina interrupted. Her voice sounded outraged. \"We\u0027ve had this discussion before, Lyon. I fear the saddles, not the animals. There is a difference.\"\n \"You\u0027re not going to ride without a saddle,\" Lyon announced. \"And that\u0027s that.\"\n \"You\u0027re too stubborn for my own good,\" she muttered.\n \"I don\u0027t want you to fall and break your pretty little neck.\"\n Lyon opened the front door, grabbed hold of Christina\u0027s hand, and dragged her outside.\n Christina was frowning. She thought he might have insulted her again. Then she reasoned he couldn\u0027t know how skilled she was with a good mount. Perhaps he hadn\u0027t slandered her after all but was truly concerned for her safety or, as he\u0027d just put it, her pretty little neck.\n She wondered what he\u0027d think if he found out she went out riding most mornings. He\u0027d be upset with her, she supposed. She had to sigh over that little deception, then cast her guilt aside. She was always back in his bed before he awakened and really wasn\u0027t worried he\u0027d find out. Wendell, the stablemaster, wouldn\u0027t say anything to Lyon. No, Wendell was a man of few words. Besides, he thought she\u0027d gained Lyon\u0027s permission. \n","sourceLink":"https://allnovel.net/the-lion-s-lady-crown-s-spies-1/page-31.html","bookId":1792,"book":{"id":1792,"title":"The Lion\u0027s Lady (Crown\u0027s Spies #1)","description":"Storyline: \n Christina Bennett had taken London society by storm. The ravishing beauty guarded the secret of her mysterious past until the night Lyon, Marquis of Lyonwood, stole a searching, sensuous kiss. An arrogant nobleman with a pirate\u0027s passions, he tasted the wild fire smoldering beneath Christina\u0027s cool charm and swore to possess her... \n But the feisty and defiant Christina would not be so easily conquered. Mistress of her heart and of her fortune, she resisted Lyon\u0027s sensuous caresses. She dared not surrender to his love...for then, she must also forsake her precious secret...and her promised destiny!\n \n","cover":"https://allnovel.net/images/the-lion-s-lady-crown-s-spies-1.jpg","author":"Julie Garwood","type":"Historical","source":"allnovel","link":"https://allnovel.net/the-lion-s-lady-crown-s-spies-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 4:11:15 PM"}}
