{"id":37942,"no":7,"title":"CHAPTER VI THE RESCUE","content":"AS Pep trotted away into the shell-raked woods he was probably the most heartbroken dog that ever slunk away to do his master’s bidding. He had traveled so far to find his beloved master, his feet had been sore and his tongue parched with the long journey and he had watched so faithfully by the doctor’s side all through the long night. And now his master had sent him away. He knew that his master needed him also, for he was so weak he could not even bring his canteen with water, or hold up his head to drink. The blow on his shoulder had been a very light one, but it had wounded Pep more than any blow he had ever received before. Why did his master send him away? He had been a faithful dog. What should he[106] do? Where should he go? He was not quite sure of the way back to the hospital. The woods were full of frightful sounds, full of lightning and thunder, the kind that tore the limbs from great trees, stripped the leaves from their branches and plowed holes in the ground, holes so deep that if he ever fell into one of them he might not be able to get out again. For several seconds he stood whimpering under a bush, uncertain, but his terrier fighting blood soon asserted itself and he began picking his way slowly forward in the direction which he thought would take him back to the road that led to the hospital. For fifteen minutes he went forward managing by his clever dog instinct to keep going in the same direction, where a human being might have gone round and round in a circle. Then something happened that quite changed his course. It came so suddenly that he did not know where it came from. He only realized in a dim way that it was a part of this terrible night, more of the frightfulness that was all about him, only this time it nearly got him. [107]Suddenly, and without any warning, there was a bright flash of light over among the bushes. The air was filled with broken limbs and flying leaves and dust, and hundreds of small missiles, and one of these which was really a fragment of shrapnel, caught Pep in his hind leg, and left that member limp and broken, as useless as a stick. He was so stunned and shaken and the breath was so knocked out of him that he lay still for several minutes, but finally he dragged himself up on three legs and tried to discover what had happened to him, and where he was. There was such a tangle of brush about him that it was difficult to extricate himself, but finally he dug his way out. Then it was that he discovered the accident to his leg. It pained him frightfully and the blow had partially paralyzed his back, so it was many minutes before he could even drag himself forward, a few feet at a time. Soon his tongue came out and he was panting and lolling as though it had been noonday in summer, instead of the cool of the morning. It was now so hard to travel that[108] he did not think he could even reach the smooth road, for he had to lie down and rest every few rods. Once he found a cool, green spot under a great tree where war had not devastated nature. Here he lay for half an hour resting and then, feeling better, he went forward faster. He had come almost to the edge of the woods when he heard men’s voices. He listened eagerly. Perhaps they were friends. If they were, he would go to them. Soon he made out the voices plainly. They were not far away, so he crept forward eagerly. At last he made them out. They were friends. They wore uniforms like the men at the hospital. He wagged his tail frantically and crept still closer. He would make sure. There were so many things to be afraid of here in this strange land to which he and his master had come. Presently the men came so close that he could see them plainly. They were talking in low voices. They were two Red Cross men carrying a wounded soldier on a litter. He was very sure they were good men, for[109] their dress was just like that of the men who unloaded the ambulances at the hospital. With a glad yelp Pep limped forward. He felt very sure they would be good to him. The Red Cross men had often petted him at the hospital. The men were so busy with the wounded soldier that they did not notice him until he rubbed against the leg of one of them. That made the man stop and cry out. His companion laughed. “’E won’t ’urt you, Bill,” he heard the other man say. “’E is just a poor wounded bull terrier. ’E just came out of the bush.” The two men laid down the stretcher to rest and one of them called Pep to him. “Poor Perp,” he said. “You ’ev got it in your ’ind leg. War is ’ell all right, eh old dog?” Pep assented and licked the man’s hand. There was something he wanted the man to do. He could not think what it was, but the man’s next words reminded him. “Where’s your master, old sport? You air lost. Whose dog are you, Perp, any how?” [110]It was not so much the words as the way the man said them and the way he rubbed Pep’s muzzle that really reminded him of his master, wounded and weak, away off in the terrible woods. Pep whimpered and sniffed and the man who loved dogs saw that he had struck a sympathetic chord. “W’at’s your name, Perp? You looks like a good fighting English bull terrier all right. You are a thoroughbred or I ain’t no judge of dorgs.” Pep whimpered again and turned and licked his flank. “Yes, I see you air hit. So is this poor devil in this air stretcher. Come, Bill, we must get him out of this.” Together they took up the stretcher and started forward. Pep was frantic. He caught at the man’s pant leg and pulled backward. They must not leave his master in the woods. They must go for him, too. The man kicked at him. “What’s the cur want, Bill?” he growled. “I guess ’e don’t know what he does want. He is lonesome and hurt and afraid, an’[111] sick uf the whole durned war, just like you and me.” When they stopped to rest again, Pep went up to the friendly man and nuzzled his hand and licked it. Then he turned and trotted a few rods away and stopped and looked back at them, whimpering and whining for them to follow. “What do you make of ’im, Bill, anyway?” asked the surly man. “By gun,” cried Bill, springing up, “I ’ev it. He wants us to follow ’im, ’e has found some one off yonder who is wounded an’ he wants us to go with ’im. Perhaps it is his master.” Pep barked and wagged his tail. When the man got up to follow him, he was delighted. “See ’ere, Bill, you can’t leave this ’ere one. We ’ev got to get him out first.” But luck was with Pep, for another Red Cross man came along and took Bill’s place at the stretcher and his new friend was free to follow him. “Now, Perp,” said Bill comfortingly. “You just lead the way an’ if there is anything[112] in this ’ere woods you want me to know about, I’m your man.” Pep went forward eagerly, absolutely sure of the way. He no longer thought of his broken leg, or the terrors of the woods. He was bringing aid to his master. Twenty minutes later he led the way into the ravine and there they found the doctor. He was lying very still with one hand across his face. The Red Cross man thought that he was dead, but Pep smelled the beloved hand and saw that it was warm. The Red Cross man felt for the pulse. It was fairly strong. “All right, old Perp,” he said in a whisper. “’E’s still alive. Perhaps we’ll save him yet. You just watch here and I will go after another hand and a stretcher.” So for the second time that night Pep took up his vigil by his master’s side on the edge of the Argonne forest. It greatly worried Pep to have his master lie so still. He covered his face with dog kisses, and nuzzled his hand, but the hand would not move. He seized the canteen in his mouth hoping that the doctor would throw it that he might[113] bring it to him as he had done earlier in the night, but his master made no sign. So finally the faithful dog lay down to watch. He felt sure that the good man would come back. Something in his voice had reassured Pep. At last after about half an hour he heard footsteps and soon to his great delight two men appeared with an empty stretcher. Silently they laid the wounded physician on the stretcher, then lifted their burden and began slowly carrying it through the thick woods. Pep limped after them, overjoyed that help had come at last. For half an hour they crept forward, often stopping to rest. At such times Pep would crowd up close and put a kiss on his master’s cheek. Now that the responsibility had been partly taken from him, Pep noticed his own wound more and more. His broken leg was swelling badly, and once when he caught it in the underbrush it made him yelp with pain. Finally, when they had been traveling slowly for about an hour, he sank down with[114] a doleful howl and could go no further. “What’s the matter with the dog, Bill?” asked the man ahead. “He seems to have gone limp.” “I guess he’s all in,” returned Bill. “Just set down this stretcher and I will go back for him.” So Bill went back for Pep and took him up tenderly in his arms. “What are you going to do with him now you have rescued him?” asked the other. “He’s going in the stretcher,” returned Bill decidedly. His companion grumbled and expostulated against carrying a dog, but Bill was determined and as usual he had his own way. “Why, if it had not been for ’im we would not have found the doctor at all.” So it came about that Pep had the honor of riding in a stretcher just like any other wounded soldier, and that with his beloved master. He snuggled down under the man’s arm, and watched the boughs above brush by. He was so tired and exhausted that for once he forgot he was a little soldier on guard and fell asleep, and did not awake until they reached the road. [115]“It’s all right, old Pup,” said his friend Bill. “We’ve got to the ambulance. You was the last straw that nearly broke our backs. But I am glad we took you. You are well worth saving.” Bill took his seat in the ambulance close to Pep’s master’s head, the motor began purring and they were off for the long run to Brest. Bill did what he could for the doctor, wetting his parched lips and forcing brandy between his teeth and at last, to the delight of both man and dog, they saw the surgeon slowly come to himself. “Where am I?” he whispered. “You are all right, safe and sound here in the ambulance. We will be at the hospital in an hour or two. The dog showed us where you were.” The doctor smiled and whispered Pep’s name. He drew the dog close to him and his hand held one of the terrier’s ears gently. Thus with a deep sigh of satisfaction Pep again dozed and did not awake until they reached their journey’s end.","sourceLink":"http://novel.tingroom.com/duanpian/3307/90416.html","bookId":419,"book":{"id":419,"title":"Pep: The Story of a Brave Dog","description":"简介： IT is almost like a stern irony of fate, that mans faithful, gentle friend, the dog, should have sprung from one of the most thoroughly hated and despised brutes in the animal kingdom, the wolf....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3307","creation":"Aug 1, 2019 12:18:45 AM","modification":"Aug 1, 2019 12:18:45 AM"}}
