{"id":24101,"no":15,"title":"CHAPTER IV CAPE STEPHEN LIGHT","content":"On the coast of West Africa, about twenty miles to the northward of Fantippo, there was a cape running out into the sea which had a lighthouse on it called the Cape Stephen Light. This light was kept carefully burning by the government who controlled that part of Africa, in order that ships should see it from the sea and know where they were. It was a dangerous part of the coast, this. There were many rocks and shallows near the end of Cape Stephen. And if the light were ever allowed to go out at night, of course, ships traveling that part of the sea would be in great danger of running into the long cape and wrecking themselves. \"There were many rocks and shallows near the end of Cape Stephen\" Now, one evening not long after the Golden Jays had gone west, the Doctor was writing letters in the post office by the light of a candle. It was late and all the animals were fast asleep long ago. Presently while he wrote he heard a sound a long way off, coming through the open window at his elbow. He put down his pen and listened. It was the sound of a seabird, calling away out at sea. Now, seabirds don\u0027t, as a rule, call very much unless they are in great numbers. This call sounded like a single bird. The Doctor put his head through the window and looked out. It was a dark night, as black as pitch, and he couldn\u0027t see a thing—especially as his eyes were used to the light of the candle. The mysterious call was repeated again and again, like a cry of distress from the sea. The Doctor didn\u0027t know quite what to make of it. But soon he thought it seemed to be coming nearer. And, grabbing his hat, he ran out on to the veranda. \"What is it? What\u0027s the matter?\" he shouted into the darkness over the sea. He got no answer. But soon, with a rush of wings that nearly blew his candle out, a great seagull swept down on to the houseboat rail beside him. \"Doctor,\" panted the gull, \"the Cape Stephen Light is out. I don\u0027t know what\u0027s the matter. It has never gone out before. We use it as a land-mark, you know, when we are flying after dark. The night\u0027s as black as ink. I\u0027m afraid some ship will surely run into the cape. I thought I\u0027d come and tell you.\" \"Good heavens!\" cried the Doctor. \"What can have happened? There\u0027s a lighthouse keeper living there to attend to it. Was it lighted earlier in the evening?\" \"I don\u0027t know,\" said the gull. \"I was coming in from catching herring—they\u0027re running just now, you know, a little to the North. And, expecting to see the light, I lost my way and flew miles too far south. When I found out my mistake I went back, flying close down by the shore. And I came to Stephen Cape, but it had no light. It was black as anything. And I would have run right into the rocks myself if I hadn\u0027t been going carefully.\" \"How far would it be from here?\" asked John Dolittle. \"Well, by land it would be twenty-five miles to where the lighthouse stands,\" said the gull. \"But by water it would be only about twelve, I should say.\" \"All right,\" said the Doctor, hurrying into his coat. \"Wait just a moment till I wake Dab-Dab.\" The Doctor ran into the post office kitchen and woke the poor housekeeper, who was slumbering soundly beside the kitchen stove. \"Listen, Dab-Dab!\" said the Doctor, shaking her. \"Wake up! The Cape Stephen Light\u0027s gone out!\" \"Whazhat?\" said Dab-Dab, sleepily opening her eyes. \"Stove\u0027s gone out?\" \"No, the lighthouse on Cape Stephen,\" said the Doctor. \"A gull just came and told me. The shipping\u0027s in danger. Wrecks, you know, and all that. Wake up and look sensible, for pity\u0027s sake!\" At last poor Dab-Dab, fully awakened, understood what was the matter. And in a moment she was up and doing. \"I know where it is, Doctor. I\u0027ll fly right over there.—No, I won\u0027t need the gull to guide me. You keep him to show you the way. Follow me immediately in the canoe. If I can find out anything I\u0027ll come back and meet you half way. If not, I\u0027ll wait for you by the lighthouse tower. Thank goodness, it\u0027s a calm night, anyway—even if it is dark!\" With a flap of her wings, Dab-Dab flew right through the open window and was gone into the night, while the Doctor grabbed his little black medicine bag and, calling to the gull to follow him, ran down to the other end of the houseboat, untied the canoe and jumped in. Then he pushed off, headed around the island of No-Man\u0027s-Land and paddled for all he was worth for the seaward end of Cape Stephen. About half way to the long neck of land that jutted out into the gloomy ocean the Doctor\u0027s canoe was met by Dab-Dab—though how she found it in the darkness, with only the sound of the paddle to guide her, goodness only knows. \"Doctor,\" said she, \"if the lighthouse keeper is in there at all he must be sick, or something. I hammered on the windows, but nobody answered.\" \"Dear me!\" muttered the Doctor, paddling harder than ever, \"I wonder what can have happened?\" \"And that\u0027s not the worst,\" said Dab-Dab. \"On the far side of the cape—you can\u0027t see it from here—there\u0027s the headlight of a big sailing ship, bearing down southward, making straight for the rocks. They can\u0027t see the lighthouse and they don\u0027t know what danger they\u0027re in.\" \"Good Lord!\" groaned the Doctor, and he nearly broke the paddle as he churned the water astern to make the canoe go faster yet. \"How far off the rocks is the ship now?\" asked the gull. \"About a mile, I should say,\" said Dab-Dab. \"But she\u0027s a big one—judging by the height of her mast-light—and she won\u0027t be long before she\u0027s aground on the cape.\" \"Keep right on, Doctor,\" said the gull. \"I\u0027m going off to get some friends of mine.\" And the seagull spread his wings and flew away toward the land, calling the same cry as the Doctor had heard through the post office window. John Dolittle had no idea of what he meant to do. Nor was the gull himself sure that he would be in time to succeed with the plan he had in mind. But presently, to his delight, the seabird heard his call being answered from the rocky shores shrouded in darkness. And soon he had hundreds of his brother gulls circling round him in the night. Then he took them to the great ship, which was sailing calmly onward toward the rocks and destruction. And there, going forward to where the helmsman held the spokes of the wheel and watched the compass swinging before him in the light of a little, dim lamp, the gulls started dashing themselves into the wheelman\u0027s face and covering the glass of the compass, so he could not steer the ship. \"The gulls dashed themselves into the wheelman\u0027s face\" The helmsman, battling with the birds, set up a yell for help, saying he couldn\u0027t see to steer the boat. Then the officers and sailors rushed up to his assistance and tried to beat the birds off. In the meantime the Doctor, in his canoe, had reached the end of Cape Stephen and, springing ashore, he scrambled up the rocks to where the great tower of the lighthouse rose skyward over the black, unlighted sea. Feeling and fumbling, he found the door and hammered on it, yelling to be let in. But no one answered him. And Dab-Dab whispered in a hoarse voice that the light of the ship was nearer now—less than half a mile from the rocks. Then the Doctor drew back for a run and threw his whole weight against the door. But the hinges and lock had been made to stand the beating of the sea and they budged no more than if he had been a fly. At last, with a roar of rage, the Doctor grabbed up a rock from the ground as big as a chair and banged it with all his might against the lock of the lighthouse door. With a crash the door flew open and the Doctor sprang within. On the ship the seamen were still fighting with the gulls. The captain, seeing that no helmsman could steer the boat right with thousands of wings fluttering in his eyes, gave the orders to lay the ship to for a little and to get out the hose pipes. And a strong stream of water was turned on to the gulls around the helmsman, so they could no longer get near him. Then the ship got under way again and came on toward the cape once more. Inside the lighthouse the Doctor found the darkness blacker still. With hands outstretched before him, he hurried forward and the first thing he did was to stumble over a man who was lying on the floor just within the door. Without waiting to see what was the matter with him, the Doctor jumped over his body and began to grope his way up the winding stairs of the tower that led to the big lamp at the top. Meanwhile Dab-Dab stayed below at the door, looking out over the sea at the mast light of the ship—which, after a short delay, was now coming on again toward the rocks. At any minute she expected the great beam of the lighthouse lamp to flare out over the sea, as soon as the Doctor should get it lit, to warn the sailors of their danger. But, instead, she presently heard the Doctor\u0027s agonized voice calling from the head of the stairs: \"Dab-Dab! Dab-Dab! I can\u0027t light it. We forgot to bring matches!\" \"Well, what have you done with the matches, Doctor?\" called Dab-Dab. \"They were always in your coat.\" \"I left them beside my pipe on the information desk,\" came the Doctor\u0027s voice from the top of the dark stairs. \"But there must be matches in the lighthouse somewhere. We must find them.\" \"What chance have we of that?\" shouted Dab-Dab. \"It\u0027s as black as black down here. And the ship is coming nearer every minute.\" \"Feel in the man\u0027s pockets,\" called John Dolittle. \"Hurry!\" In a minute Dab-Dab went through the pockets of the man who lay so still upon the floor. \"He hasn\u0027t any matches on him,\" she shouted. \"Not a single one.\" \"Confound the luck!\" muttered John Dolittle. And then there was a solemn silence in the lighthouse while the Doctor above and Dab-Dab below thought gloomily of that big ship sailing onward to her wreck because they had no matches. But suddenly out of the black stillness came a small, sweet voice, singing, somewhere near. \"Dab-Dab!\" cried the Doctor in a whisper. \"Do you hear that? A canary! There\u0027s a canary singing somewhere—probably in a cage in the lighthouse kitchen!\" In a moment he was clattering down the stairs. \"Come on,\" he cried. \"We must find the kitchen. That canary will know where the matches are kept. Find the kitchen!\" Then the two of them went stumbling around in the darkness, feeling the walls, and presently they came upon a low door, opened it and fell headlong down a short flight of steps that led to the lighthouse kitchen. This was a little underground room, like a cellar, cut out of the rock on which the lighthouse stood. If there was any fire or stove in it it had long since gone out, for the darkness here was as black as anywhere else. But as soon as the door had opened, the trills of the song bird grew louder. \"Tell me,\" called John Dolittle, in canary language, \"where are the matches? Quick!\" \"Oh, at last you\u0027ve come,\" said a high, small, polite voice out of the darkness. \"Would you mind putting a cover over my cage? There\u0027s a draught and I can\u0027t sleep. Nobody\u0027s been near me since midday. I don\u0027t know what can have happened to the keeper. He always covers up my cage at tea-time. But to-night I wasn\u0027t covered at all, so I went on singing. You\u0027ll find my cover up on the——\" \"Matches! Matches! Where are the matches?\" screamed Dab-Dab. \"The light\u0027s out and there\u0027s a ship in danger! Where are the matches kept?\" \"On the mantelpiece, next to the pepper box,\" said the canary. \"Come over here to my cage and feel along to your left—high up—and your hand will fall right on them.\" The Doctor sprang across the room, upsetting a chair on his way, and felt along the wall. His hand touched the corner of a stone shelf and the next moment Dab-Dab gave a deep sigh of relief, for she heard the cheerful rattle of a box of matches as the Doctor fumbled to strike a light. \"You\u0027ll find a candle on the table—there—look—behind you,\" said the canary, when the match light dimly lit up the kitchen. With trembling fingers the Doctor lit the candle. Then, shielding the flame with his hand, he bounded out of the room and up the stairs. \"The Doctor lit the candle\" \"At last!\" he muttered. \"Let\u0027s hope I\u0027m not too late!\" At the head of the kitchen steps he met the seagull coming into the lighthouse with two companions. \"Doctor,\" cried the gull, \"we held off the ship as long as we could. But the stupid sailors, not knowing we were trying to save them, turned hoses on us and we had to give up. The ship is terribly near now.\" Without a word the Doctor sped on up the winding steps of the tower. Round and round he went, upward, till he was ready to drop from dizziness. At length reaching the great glass lamp chamber at the top, he set down his candle and, striking two matches at once he held one in each hand and lit the big wick in two places. By this time Dab-Dab had gone outside again and was watching over the sea for the oncoming ship. And when at last the great light from the big lamp at the top of the tower suddenly flared out over the sea there was the bow of the vessel, not more than a hundred yards from the rocky shore of the cape! Then came a cry from the look-out, shouted orders from the captain, much blowing of whistles and ringing of bells. And just in time to save herself from a watery grave, the big ship swung her nose out to sea and sailed safely past upon her way. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2938/80685.html","bookId":1091,"book":{"id":1091,"title":"Doctor Dolittle\u0027s Post Office","description":"简介： Nearly all of the history of Doctor Dolittle\u0027s post office took place when he was returning from a voyage to West Africa. Therefore I will begin (as soon as I have told you a little about how he came to take the journey) from where he turned his ship...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2938","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
