{"id":24106,"no":20,"title":"CHAPTER II THE DOCTOR\u0027S STORY","content":"As soon as the Doctor had lit his pipe and got it well going he began: \"Many years ago, at the time I bought this thermometer, I was a very young doctor, full of hope, just starting out in business. I fancied myself a very good doctor, but I found that the rest of the world did not seem to think so. And for many months after I began I did not get a single patient. I had no one to try my new thermometer on. I tried it on myself quite often. But I was always so frightfully healthy I never had any temperature anyway. I tried to catch a cold. I didn\u0027t really want a cold, you understand, but I did want to make sure that my new thermometer worked. But I couldn\u0027t even catch a cold. I was very sad—healthy but sad. \"Well, about this time I met another young doctor who was in the same fix as myself—having no patients. Said he to me: \u0027I\u0027ll tell you what we\u0027ll do, let\u0027s start a sanitarium.\u0027\" \"What\u0027s a sanitarium?\" asked Gub-Gub. \"A sanitarium,\" said the Doctor, \"is a sort of mixture between a hospital and a hotel—where people stay who are invalids.... Well, I agreed to this idea. Then I and my young friend—his name was Phipps, Dr. Cornelius Q. Phipps—took a beautiful place way off in the country, and we furnished it with wheel chairs and hot-water bottles and ear trumpets and the things that invalids like. And very soon patients came to us in hundreds and our sanitarium was quite full up and my new thermometer was kept very busy. Of course, we made a lot of money, because all these people paid us well. And Phipps was very happy. \"But I was not so happy. I had noticed a peculiar thing: none of the invalids ever seemed to get well and go away. And finally I spoke of this to Phipps. \"\u0027My dear Dolittle,\u0027 he answered, \u0027go away?—of course not! We don\u0027t want them to go away. We want them to stay here, so they\u0027ll keep on paying us.\u0027 \"\u0027Phipps,\u0027 I said, \u0027I don\u0027t think that\u0027s honest. I became a doctor to cure people—not to pamper them.\u0027 \"Well, on this point we fell out and quarreled. I got very angry and told him I would not be his partner any longer—that I would pack up and go the following day. As I left his room, still very angry, I passed one of the invalids in his wheel chair. It was Sir Timothy Quisby, our most important and expensive patient. He asked me, as I passed, to take his temperature, as he thought he had a new fever. Now, I had never been able to find anything wrong with Sir Timothy and had decided that being an invalid was a sort of hobby with him. So, still, very angry, instead of taking his temperature, I said quite rudely: \u0027Oh, go to the Dickens!\u0027 \"It was Sir Timothy Quisby, our most expensive patient\" \"Sir Timothy was furious. And, calling for Dr. Phipps, he demanded that I apologize. I said I wouldn\u0027t. Then Sir Timothy told Phipps that if I didn\u0027t he would start an invalids\u0027 strike. Phipps got terribly worried and implored me to apologize to this very special patient. I still refused. \"Then a peculiar thing happened. Sir Timothy, who had always so far seemed too weak to walk, got right out of his wheel chair and, waving his ear trumpet wildly, ran around all over the sanitarium, making speeches to the other invalids, saying how shamefully he had been treated and calling on them to strike for their rights. \"And they did strike—and no mistake. That night at dinner they refused to take their medicine—either before or after meals. Dr. Phipps argued with them, prayed them, implored them to behave like proper invalids and carry out their doctors\u0027 orders. But they wouldn\u0027t listen to him. They ate all the things they had been forbidden to eat, and after dinner those who had been ordered to go for a walk stayed at home, and those who had been ordered to stay quiet went outside and ran up and down the street. They finished the evening by having a pillow fight with their hot-water bottles, when they should have been in bed. The next morning they all packed their own trunks and left. And that was the end of our sanitarium. \"But the most peculiar thing of all was this: I found out afterward that every single one of those patients had got well! Getting out of their wheel chairs and going on strike had done them so much good they stopped being invalids altogether. As a sanitarium doctor, I suppose I was not a success—still, I don\u0027t know. Certainly I cured a great many more patients by going out of the sanitarium business than Phipps ever did by going into it.\"","sourceLink":"http://novel.tingroom.com/duanpian/2938/80690.html","bookId":1091,"book":{"id":1091,"title":"Doctor Dolittle\u0027s Post Office","description":"简介： Nearly all of the history of Doctor Dolittle\u0027s post office took place when he was returning from a voyage to West Africa. Therefore I will begin (as soon as I have told you a little about how he came to take the journey) from where he turned his ship...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2938","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
