{"id":24110,"no":24,"title":"CHAPTER VI JIP\u0027S STORY","content":"The next night Jip was called upon for a story. And after thinking a moment he said: \"All right, I\u0027ll tell you the story of \u0027The Beggar\u0027s Dog.\u0027\" And the animals all settled down to listen attentively, because Jip had often told them stories before and they liked his way of telling them. \"Some time ago,\" Jip began, \"I knew a dog who was a beggar\u0027s dog. We met by chance one day, when a butcher\u0027s cart had an accident and got upset. The butcher\u0027s boy who was driving the cart was a stupid boy whom all the dogs of that town heartily disliked. So when his cart hit a lamp-post and over-turned, spilling mutton chops and joints all over the street, we dogs were quickly on the scene and ran off with all his meat before he had time to pick himself up out of the gutter. \"It was on this occasion, as I said, that I fell in with the beggar\u0027s dog. I found him bolting down the street beside me, with a choice steak flapping merrily around his ears. Myself, I had pinched a string of sausages and the beastly things kept getting tangled up in my legs,—till he came to my rescue and showed me how to coil them up neatly so I could run with them without getting tripped. \"After that the beggar\u0027s dog and I became great friends. I found that his master had only one leg and was very, very old. \"\u0027He\u0027s most frightfully poor,\u0027 said my friend. \u0027And he\u0027s too old to work, you see—even if he had two legs to get around on. And now he has taken to pavement art. You know what that is—you draw pictures on the pavement in colored chalks and you write under them: \"All my own work.\" And then you sit by the side of them, with your cap in your hand, waiting for people to give you pennies.\u0027 \"\u0027Oh, yes,\u0027 I said, \u0027I know. I\u0027ve seen pavement artists before.\u0027 \"\u0027Well,\u0027 said my friend, \u0027my beggar doesn\u0027t get any pennies. And I know the reason why: his pictures aren\u0027t good enough—not even for pavement art. Myself, I don\u0027t pretend to know much about drawing. But his pictures are just awful—awful. One kind old lady the other day stopped before our stand—wanting to encourage him, you know—and, pointing to one picture, she said, \"Oh, what a lovely tree!\" The picture was meant to be a lighthouse in the middle of the ocean, with a storm raging around it. That\u0027s the kind of an artist my man is. I don\u0027t know what to do about him.\u0027 \"His pictures are just awful\" \"\u0027Well, look here,\u0027 I said, \u0027I have an idea. Since your man can\u0027t work for himself, suppose you and I go into the bone-hiring business.\u0027 \"\u0027What on earth is that?\u0027 he asked. \"\u0027Well,\u0027 I said, \u0027people hire out bicycles and pianos for rent, don\u0027t they? So, why can\u0027t you and I rent out bones for dogs to chew? They won\u0027t be able to pay us in money of course, so we\u0027ll get them to bring us things, instead. Then the beggar can sell the things and get money.\u0027 \"\u0027That\u0027s a good notion,\u0027 said he. \u0027Let\u0027s start to-morrow.\u0027\" \"So the following day we found an empty lot, where people used to dump rubbish, and dug an enormous hole, which was to be our bone shop. Then we went around the back doors of all the richest people\u0027s houses early in the morning and picked out the best bones from the garbage cans. We even snatched a few from other dogs who were tied to kennels and couldn\u0027t run after us—rather a dirty trick, but we were working in a good cause and were not particular. Then we took all these bones and put them in the hole we had dug. By night we kept them covered up with earth, because we didn\u0027t want them stolen—and, besides, some dogs prefer their bones buried a few days before they chew them. It gets them seasoned-like. And then by day we stood over our wares, calling out to all the dogs that passed by: \"\u0027Bones for hire! Beef bones, ham bones, mutton bones, chicken bones! All juicy! Step up, gentlemen, and take your choice! BONES for hire!\u0027 \"Well, right from the start we did a roaring trade. All the dogs for miles around heard of us and came to hire bones. And we would charge them according to the length of time they wanted to hire them. For instance, you could rent a good ham bone for one day for a candlestick or a hair brush; for three days for a violin or an umbrella. And if you wanted your bone for a whole week you had to bring us a suit of clothes in payment. \"Well, for a while our plan worked splendidly. The beggar sold the things that we got in payment from the dogs and he had money to live on. \"But we never thought where the dogs might be getting all these things they brought us. The truth is, we didn\u0027t bother very much, I\u0027m afraid. Anyway at the end of our first week of brisk trade we noticed a great many people going through the streets as though they were looking for something. And presently these people, seeing our shop in the empty lot, gathered around us, talking to one another. And while they were talking a retriever came up to me with a gold watch and chain in his mouth, which he wanted to exchange for a ham bone. \"A retriever came up with a gold watch and chain\" \"Well, you should have seen the excitement among the people then! The owner of the watch and chain was there and he raised a terrible row. And then it came out that these dogs had been taking things from their masters\u0027 homes to hire bones with. The people were dreadfully annoyed. They closed up our bone shop and put us out of business. But they never discovered that the money we had made had gone to the beggar. \"Of course, we hadn\u0027t made enough to keep him in comfort for long and very soon he had to become a pavement artist again and was as badly off as he had ever been—and the pictures he drew were worse, if anything, than before. \"Now it happened one day, when I was wandering around in the country outside the town, that I met a most conceited spaniel. He passed me with his nose turned up in the air in such a cheeky manner that I said to him, I said: \u0027What makes you so stuck up?\u0027 \"\u0027My master has been ordered to paint the portrait of a prince,\u0027 he said, putting on no end of elegance. \"\u0027Who is your master?\u0027 I said. \u0027Anybody would think you were going to paint the portrait yourself.\u0027 \"\u0027My master is a very famous artist,\u0027 said he. \"\u0027What\u0027s his name?\u0027 I asked. \"\u0027George Morland,\u0027 said the spaniel. \"\u0027George Morland!\u0027 I cried. \u0027Is he in these parts now?\u0027 \"\u0027Yes,\u0027 said the spaniel. \u0027We are staying at The Royal George. My master is painting some pictures of the country and next week he is going back to London to commence on the portrait of the prince.\u0027 \"Now, it happened that I had met this George Morland, who was, and is still, perhaps the most famous painter of farm-life pictures the world has ever known. I am proud to be able to say that I knew him. He was especially good at painting horses in stables, pigs in stys, roosters and dogs hanging around kitchen doors, and things like that. \"So, without letting the spaniel see that I was following him, I went after him, to see where he was going. \"He led me to a lonely old farm out on the hills. And there, concealing myself in some bushes, I watched the great Morland painting one of his famous farm scenes. \"Presently he laid down his paint brush and muttered to himself: \u0027I need a dog—by the watering trough there—to fill out the picture. I wonder if I could get that fool spaniel to lie still for five minutes.... Here, Spot, Spot! Come here!\u0027 \"His spaniel, Spot, came up to him. And George, leaving his painting for a moment, placed the spaniel beside the watering trough and flattened him out and told him to keep still. I could see that George\u0027s idea was to have him look as though he were asleep in the sun. George simply loved to paint animals asleep in the sun. \"Well, that blockhead of a spaniel never kept still one minute. First, he was snapping at the flies that bit his tail; then he was scratching his ear, then barking at the cat—never still. And, of course, George couldn\u0027t paint him at all, and at last he got so angry he threw the paint brush at him. \"Then an idea came to me—one of the best ideas I ever had. I left the bushes and came trotting up to George, wagging my tail. And how I thrilled with pride as the great Morland recognized me! For, mind you, he had met me only once before—back in the autumn of 1802. \"\u0027Why, it\u0027s Jip!\u0027 he cried. \u0027Good dog. Come here. You\u0027re the very fellow I want.\u0027 \"Then while he gathered up the things he had thrown at the spaniel he went on talking to me—the way people do talk to dogs, you know. Of course, he didn\u0027t expect me to understand what he said, but I did—every word. \"\u0027I want you to come over here by the trough, Jip,\u0027 said he. \u0027All you\u0027ve got to do is to keep still. You can go to sleep if you like. But don\u0027t move or fidget for ten minutes. Think you can do that?\u0027 \"\u0027Come over here by the trough\u0027\" \"And he led me over to the trough, where I lay down and kept perfectly still while he painted me into the picture. That picture now hangs in the National Gallery. It\u0027s called Evening on the Farm. Hundreds of people go to see it every year. But none of them know that the smart-looking dog sleeping beneath the watering trough is none other than myself—except the Doctor, whom I took in to see it one day when we were up in London, shopping. \"Well, now, as I told you, I had an idea in all this. I hoped that if I did something for George Morland perhaps I could get him to do something for me. But, of course, with him not knowing dog talk it was a bit difficult to make him understand. However, while he was packing up his painting things I disappeared for a while, just as though I was going away. Then I came rushing back to him in a great state of excitement, barking, trying to show him something was wrong and that I wanted him to follow me. \"\u0027What\u0027s the matter, Jip?\u0027 said he. \u0027House on fire or something?\u0027 \"Then I barked some more and ran a little way in the direction of the town, looking back at him to show him I wanted him to come with me. \"\u0027What ails the dog?\u0027 he murmured to himself. \u0027Can\u0027t be anybody drowning, because there\u0027s no river near.... Oh, all right, Jip, I\u0027ll come. Wait a second till I get these brushes cleaned.\u0027 \"Then I led him into the town. On the way there every once in a while he would say to himself: \u0027I wonder what can be the matter. Something\u0027s wrong, that\u0027s sure, or the dog wouldn\u0027t carry on so.\u0027 \"I took him down the main street of the town till we came to the place where the beggar had his pictures. And as soon as George saw the pictures he knew what was wrong. \"\u0027Heaven preserve us!\u0027 he cried. \u0027What a dreadful exhibition! No wonder the dog was excited.\u0027 \"Well, it happened that as we came up the one-legged beggar, with his own dog beside him, was at work on a new drawing. He was sitting on the pavement, making a picture on canvas with a piece of chalk of a cat drinking milk. Now, my idea was that the great Morland—who, no matter what people say about him, was always a most kind-hearted man—should make some good pictures for the beggar to show, instead of the dreadful messes that he made himself. And my plan worked. \"\u0027Man alive!\u0027 said George, pointing to the picture the beggar was doing, \u0027a cat\u0027s spine doesn\u0027t curve that way—here, give me the chalk and let me do it.\u0027 \"Then, rubbing out the whole picture, George Morland re-drew it in his way. And it was so lifelike you could nearly hear the cat lapping up the milk. \"\u0027My! I wish I could draw that way,\u0027 said the beggar. \u0027And so quick and easy you do it—like it was nothing at all.\u0027 \"\u0027Well, it comes easy,\u0027 said George. \u0027Maybe there\u0027s not so much credit in it for that. But, tell me, do you make much money at this game?\u0027 \"\u0027Awful little,\u0027 said the beggar. \u0027I\u0027ve taken only twopence the whole day. I suppose the truth is I don\u0027t draw good enough.\u0027 \"I watched Morland\u0027s face as the beggar said this. And the expression that came into it told me I had not brought the great man here in vain. \"\u0027Look here,\u0027 he said to the beggar. \u0027Would you like me to re-draw all your pictures for you? Of course, those done on the pavement you couldn\u0027t sell, but we can rub them out. And I\u0027ve got some spare canvases in my satchel here. Maybe you could sell a few. I can sell pictures in London any day in the week. But I\u0027ve never been a pavement artist before. It would be rather a lark to see what happens.\u0027 \"Then Morland, all busy and excited, like a schoolboy, took the beggar\u0027s chalk pictures from against the wall and, rubbing them out, did them over the way they should be done. He got so occupied with this that he didn\u0027t notice that a whole crowd of people was gathering around, watching. His work was so fine that the people were spellbound with the beauty of the cats and dogs and cows and horses that he drew. And they began asking one another in whispers who the stranger could be who was doing the pavement artist\u0027s pictures for him. \"The crowd grew bigger and bigger. And presently some one among the people who had seen Morland\u0027s pictures before recognized the work of the great artist. And then whispers went through the crowd—\u0027It\u0027s Morland—the great Morland, himself.\u0027 And somebody went off and told a picture dealer—that is, a man who buys and sells pictures—who had a shop in the High Street, that George Morland was drawing in the market-place for a lame beggar. \"And the dealer came down. And the Mayor came down—and all the rich folk and poor folk. So, when the whole town was gathered around, the people began offering to buy these pictures, asking the beggar how much he wanted for them. The old duffer was going to sell them at sixpence apiece, but Morland whispered to him: \"\u0027Twenty guineas—don\u0027t sell a blessed one under twenty guineas. You\u0027ll get it.\u0027 \"And sure enough, the dealer and a few of the richer townsfolk bought the whole lot at twenty guineas apiece. \"And when I went home that night I felt I had done a good day\u0027s work. For my friend\u0027s master, the one-legged beggar, was now rich enough to live in comfort for the rest of his life.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2938/80694.html","bookId":1091,"book":{"id":1091,"title":"Doctor Dolittle\u0027s Post Office","description":"简介： Nearly all of the history of Doctor Dolittle\u0027s post office took place when he was returning from a voyage to West Africa. Therefore I will begin (as soon as I have told you a little about how he came to take the journey) from where he turned his ship...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2938","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
