{"id":24090,"no":4,"title":"CHAPTER III A GREAT GUNNER","content":"And then began a most exciting sea race. It was now two o\u0027clock in the afternoon and there were not many hours of daylight left. The Captain (after he had done swearing at the stupid gunner who had let off the gun by accident) realized that if he did not catch up to the slaver before dark came on he would probably lose him altogether. For this Jim Bones was a very sly and clever rascal and he knew the West Coast of Africa (it is sometimes called to this day The Slave Coast) very well. After dark by running without lights he would easily find some nook or corner to hide in—or double back on his course and be miles away before morning came. So the Captain gave orders that all possible speed was to be made. These were the days when steam was first used on ships. But at the beginning it was only used together with the sails, to help the power of the wind. Of this vessel, H. M. S. Violet, the Captain was very proud. And he was most anxious that the Violet should have the honor of catching Bones the slaver, who for so long had been defying the navy by carrying on slave trade after it had been forbidden. So the Violet\u0027s steam engines were put to work their hardest. And thick, black smoke rolled out of her funnels and darkened the blue sea and smudged up her lovely white sails humming tight in the breeze. Then the engine boy, also anxious that his ship should have the honor of capturing Bones, tied down the safety valve on the steam engine, to make her go faster, and then went up on deck to see the show. And soon, of course, one of the Violet\u0027s brand new boilers burst with a terrific bang and made an awful mess of the engine room. But, being a full-rigged man-o\u0027-war, the Violet was still a pretty speedy sailer. And on she went, furiously plowing the waves and slowly gaining on the slave ship. However, the crafty Bones, with so big a start, was not easy to overtake. And soon the sun began to set and the Captain frowned and stamped his feet. For with darkness he knew his enemy would be safe. Down below among the crew, the man who had fired the gun by accident was having a terrible time. All his companions were setting on him and mobbing him for being such a duffer as to warn Bones—who would now almost certainly escape. The distance from the slaver was still too great to use the kind of guns they had in those days. But when the Captain saw darkness creeping over the sea and his enemy escaping, he gave orders to man the guns, anyway—although he hadn\u0027t the least hope that his shots would hit the slaver at that distance. Now, Speedy-the-Skimmer, as soon as the race had begun, had come on to the warship to take a rest. And he happened to be talking to the Doctor when the order to man the guns came down from the Captain. So the Doctor and Speedy went below to watch the guns being fired. They found an air of quiet but great excitement there. Each gunner was leaning on his gun, aiming it, watching the enemy\u0027s ship in the distance and waiting for the order to fire. The poor man who had been mobbed by his fellows was still almost in tears at his own stupid mistake. Suddenly an officer shouted \"Fire!\" And with a crash that shook the ship from stem to stern eight big cannon balls went whistling out across the water. But not one hit the slave ship. Splash! Splash! Splash! They fell harmlessly into the water. \"The light\u0027s too bad,\" grumbled the gunners. \"Who could hit anything two miles away in this rotten light?\" Then Speedy whispered in the Doctor\u0027s ear: \"Ask them to let me fire a gun. My sight is better than theirs for bad light.\" But just at that moment the order came from the Captain, \"Cease firing!\" And the men left their places. As soon as their backs were turned Speedy jumped on top of one of the guns and, straddling his short, white legs apart, he cast his beady little black eyes along the aiming sights. Then with his wings he signaled to the Doctor behind him to swing the gun this way and that, so as to aim it the way he wanted. \"Fire!\" said Speedy. And the Doctor fired. \"\u0027Fire!\u0027 said Speedy\" \"What in thunder\u0027s this?\" roared the Captain from the quarterdeck as the shot rang out. \"Didn\u0027t I give the order to cease firing?\" But the second in command plucked him by the sleeve and pointed across the water. Speedy\u0027s cannon ball had cut the slaver\u0027s mainmast clean in two and brought the sails down in a heap upon the deck! \"Holy smoke!\" cried the Captain. \"We\u0027ve hit him! Look, Bones is flying the signal of surrender!\" Then the Captain, who a moment before was all for punishing the man who had fired without orders, wanted to know who it was that aimed that marvelous shot which brought the slaver to a standstill. And the Doctor was going to tell him it was Speedy. But the Skimmer whispered in his ear: \"Don\u0027t bother, Doctor. He would never believe you, anyway. It was the gun of the man that made the mistake before that we used. Let him take the credit. They\u0027ll likely give him a medal, and then he\u0027ll feel better.\" And now all was excitement aboard the Violet as they approached the slave boat lying crippled in the sea. Bones, the captain, with his crew of eleven other ruffians, was taken prisoner and put down in the cells of the warship. Then the Doctor, with Zuzana, some sailors and an officer, went on to the slave ship. Entering the hold, they found the place packed with slaves with chains on them. And Zuzana immediately recognized her husband and wept all over him with joy. The black men were at once freed from their chains and brought on to the man-o\u0027-war. Then the slave ship was taken in tow by the Violet. And that was the end of Mr. Bones\u0027s slave trading. Then there was much rejoicing and hand-shaking and congratulation on board the warship. And a grand dinner was prepared for the slaves on the main deck. But John Dolittle, Zuzana and her husband were invited to the officers\u0027 mess, where their health was drunk in port wine and speeches were made by the Captain and the Doctor. The next day, as soon as it was light, the warship went cruising down the coast again, putting the black people ashore in their own particular countries. This took considerable time, because Bones, it seemed, had collected slaves from a great many different tribes. And it was after noon before the Doctor, with Zuzana and her husband, were returned to John Dolittle\u0027s ship, who still had her lights faithfully burning in the middle of the day. Then the Captain shook hands with the Doctor and thanked him for the great assistance he had given Her Majesty\u0027s Navy. And he asked him for his address in England, because he said he was going to tell the government about him and the Queen would most likely want to make him a knight or give him a medal or something. But the Doctor said he would rather have a pound of tea instead. He hadn\u0027t tasted tea in several months and the kind they had in the officers\u0027 mess was very good. So the Captain gave him five pounds of the best China tea and thanked him again in the name of the Queen and the government. Then the Violet swung her great bow around to the north once more and sailed away for England, while the bluejackets crowded the rail and sent three hearty cheers for the Doctor ringing across the sea. \"The bluejackets crowded to the rail\" And now Jip, Dab-Dab, Gub-Gub, Too-Too and the rest of them gathered around John Dolittle and wanted to hear all about his adventures. And it was tea time before he had done telling them. So the Doctor asked Zuzana and her husband to take tea with him before they went ashore. This they were glad to do. And the Doctor made the tea himself and it was very excellent. Over the tea Zuzana and her husband (whose name was Begwe) were conversing about the Kingdom of Fantippo. \"I don\u0027t think we ought to go back there,\" said Begwe. \"I don\u0027t mind being a soldier in the Fantippo army, but suppose some other slaver comes along. Maybe the king would sell me again. Did you send that letter to our cousin?\" \"Yes,\" said Zuzana. \"But I don\u0027t think he ever got it. Because no answer came.\" The Doctor asked Zuzana how she had sent the letter. And then she explained to him that when Bones had offered a big price for Begwe and the king had been tempted to sell him she had told the king she would get twelve oxen and thirty goats from a rich cousin in their own country if he would only wait till she had written to him. Now, the King of Fantippo was very fond of oxen and goats—cattle being considered as good as money in his land. And he promised Zuzana that if she got the twelve oxen and thirty goats in two days\u0027 time her husband should be a free man, instead of being sold to the slavers. So Zuzana had hurried to a professional letter writer (the common people of those tribes couldn\u0027t write for themselves, you see) and had a letter written, begging their cousin to send the goats and oxen to the king without delay. Then she had taken the letter to the Fantippo post office and sent it off. But the two days went by and no answer came—and no cattle. Then poor Begwe had been sold to Bones\u0027s men. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2938/80674.html","bookId":1091,"book":{"id":1091,"title":"Doctor Dolittle\u0027s Post Office","description":"简介： Nearly all of the history of Doctor Dolittle\u0027s post office took place when he was returning from a voyage to West Africa. Therefore I will begin (as soon as I have told you a little about how he came to take the journey) from where he turned his ship...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2938","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
