{"id":103527,"no":32,"title":"Page 32","content":"Joseph rubbed the bridge of his nose as if fighting a headache. \"He said he\u0027d see what he could do.\"\\n\\n We watched as the Roman soldiers took Joshua inside and the priests followed. The Pharisees, commoners in the eyes of the Romans, were left outside. A legionnaire almost caught Jakan\u0027s face in the gate when he slammed it.\\n\\n I caught movement out of the corner of my eye, and I looked up to a high, wide balcony that was visible above the palace walls. It had obviously been designed by Herod the Great\u0027s architects as a platform from which the king could address the masses in the Temple without compromising his safety. A tall Roman in a lush red robe was standing on the balcony looking down on the crowd, and not looking particularly happy with their presence.\\n\\n \"Is that Pilate?\" I asked Joseph, pointing to the Roman.\\n\\n Joseph nodded. \"He\u0027ll go downstairs to hold Joshua\u0027s trial.\"\\n\\n But I wasn\u0027t interested at that point in where Pilate was going. What interested me was the centurion who stood behind him wearing the full-crested helmet and breastplate of a legion commander.\\n\\n Not a half hour later the gate was opened and a squad of Roman soldiers brought Joshua out of the palace in bonds. A lower-rank centurion pulled Joshua along by a rope around his wrists. The priests followed along behind and were mobbed with questions by the Pharisees who had been waiting outside.\\n\\n \"Go find out what\u0027s going on,\" I said to Joseph.\\n\\n We waded into the middle of the procession that followed. Most were screaming at Joshua and trying to spit on him. I spotted a few people in the crowd that I knew to be Joshua\u0027s followers, but they were going along silently, their eyes darting around as if any second they might be the next one arrested.\\n\\n Simon, Andrew, and I followed behind at some distance, while Maggie fought the crowd to get close to Joshua. I saw her throw herself at her ex-husband, Jakan, who was trailing the priests, but she was stopped in mid-leap by Joseph of Arimathea, who caught her by the hair and pulled her back. Someone else was helping restrain her, but he wore a shawl over his head so I couldn\u0027t tell who it was. Probably Peter.\\n\\n Joseph dragged Maggie back to us and handed her over to me and Simon.\\n\\n \"She\u0027ll get herself killed.\"\\n\\n Maggie looked up at me, a wildness in her eyes that I couldn\u0027t read, either anger or madness. I wrapped my arms around her and held her so her arms were pinned to her sides as we walked along. The man with the hood walked along beside me, his hand on Maggie\u0027s shoulder, steadying her. When he looked at me I could see it was Peter. The wiry fisherman seemed to have aged twenty years since I\u0027d seen him Tuesday night.\\n\\n \"They\u0027re taking him to Antipas,\" Peter said. \"As soon as Pilate heard Joshua was from Galilee he said it wasn\u0027t his jurisdiction and sent him to Herod.\"\\n\\n \"Maggie,\" I said into her ear, \"please stop being a madwoman. My plan just went to hell and I could use some critical thinking.\"\\n\\n Once again we waited outside of one of the palaces built by Herod the Great, but this time, because it was a Jewish king in residence, the Pharisees were let in and Joseph of Arimathea went in with them. A few minutes later he was back outside again.\\n\\n \"He\u0027s trying to get Joshua to perform a miracle,\" Joseph said. \"He\u0027ll let him go if Joshua performs a miracle for him.\"\\n\\n \"And if Joshua won\u0027t do it?\"\\n\\n \"He won\u0027t,\" said Maggie.\\n\\n \"If he won\u0027t do it,\" Joseph said, \"we\u0027re back where we started. It will be up to Pilate to order the Sanhedrin\u0027s death sentence carried out or to release Joshua.\"\\n\\n \"Maggie, come with me,\" I said, tugging at her dress as I backed away.\\n\\n \"Why, where?\"\\n\\n \"The plan\u0027s back on.\" I ran back to the praetorium, with Maggie in tow. I pulled up by a pillar across from the Antonia Palace. \"Maggie, can Peter really heal? Really?\"\\n\\n \"Yes, I told you.\"\\n\\n \"Wounds? Broken bones?\"\\n\\n \"Wounds, yes. I don\u0027t know about bones.\"\\n\\n \"I hope so,\" I said.\\n\\n I left her there while I went to the highest-ranking centurion stationed outside the gates.\\n\\n \"I need to see your commander,\" I said.\\n\\n \"Go away, Jew.\"\\n\\n \"I\u0027m a friend. Tell him it\u0027s Levi from Nazareth.\"\\n\\n \"I\u0027ll tell him nothing.\"\\n\\n So I stepped up and took the centurion\u0027s sword out of its scabbard, put the point under his chin for a split second, then replaced it in its scabbard. He reached for the sword and suddenly it was in my hand and under his chin again. Before he could call out the sword was back in its scabbard.\\n\\n \"There,\" I said, \"you owe me your life twice. By the time you call to have me arrested I\u0027ll have your sword again and you\u0027ll not only be embarrassed but your head will be all wobbly from your throat being cut. Or, you can take me to see my friend Gaius Justus Gallicus, commander of the Sixth Legion.\"\\n\\n Then I took a deep breath and waited. The centurion\u0027s eyes darted to the soldiers closest to him, then back to me. \"Think, Centurion,\" I said. \"If you arrest me, where will I end up anyway?\" The logic of it seemed to strike him through his frustration.\\n\\n \"Come with me,\" he said.\\n\\n I signaled to Maggie to wait and followed the soldier into Pilate\u0027s fortress.\\n\\n Justus seemed uncomfortable in the lush quarters they had assigned him at the palace. He\u0027d had shields and spears placed around the room in different places, as if he needed to remind anyone who entered that a soldier lived here. I stood in the doorway while he paced, looking up at me occasionally as if he wanted to kill me. He wiped the sweat from his closely cropped gray hair and whipped it so it drew a stripe across the stone floor.\\n\\n \"I can\u0027t stop the sentence. No matter what I want.\"\\n\\n \"I just don\u0027t want him hurt,\" I said.\\n\\n \"If Pilate crucifies him, he\u0027ll be hurt, Biff. That\u0027s sort of the point.\"\\n\\n \"Damaged, I mean. No broken bones, no cut sinew. Have them tie his arms to the cross.\"\\n\\n \"They have to use nails,\" Justus said, his mouth shaping into a cruel frown. \"Nails are iron. They\u0027re inventoried. Each one is accounted for.\"\\n\\n \"You Romans are masters of supply.\"\\n\\n \"What do you want?\"\\n\\n \"Okay, tie him then, only nail through the web of his fingers and toes, and put a board on the cross so he can support his weight with his feet.\"\\n\\n \"That\u0027s no kindness you\u0027re doing him. He could linger a week that way.\"\\n\\n \"No he won\u0027t,\" I said. \"I\u0027m going to give him poison. And I want his body as soon as he\u0027s dead.\"\\n\\n At the word \"poison,\" Justus had stopped pacing and looked up at me with open resentment. \"It\u0027s not up to me to release the body, but if you want to make sure the body is unharmed I\u0027ll have to keep soldiers there until the end. Sometimes your people like to help the crucified die more quickly by throwing stones. I don\u0027t know why they bother.\"\\n\\n \"Yes, you do, Justus. You of all people do. You can spit that Roman bitterness toward mercy all you want, but you know. You were the one who sent for Joshua when your friend was suffering. You humbled yourself and asked for mercy. That\u0027s all I\u0027m doing.\"\\n\\n Now the resentment drained from his face and was replaced by amazement. \"You\u0027re going to bring him back, aren\u0027t you?\"\\n\\n \"I just want to bury my friend\u0027s body intact.\"\\n\\n \"You\u0027re going to bring him back from the dead. Like the soldier at Sepphoris, the one the Sicarii killed. That\u0027s why you need his body undamaged.\"\\n\\n \"Something like that,\" I nodded, looking at the floor to avoid the old soldier\u0027s eyes.\\n\\n Justus nodded, obviously shaken. \"Pilate has to authorize the body to be taken down. Crucifixion is supposed to stand as an example to others.\"\\n\\n \"I have a friend who can get the body released.\"\\n\\n \"Joshua could still be set free, you know?\"\\n\\n \"He won\u0027t be,\" I said. \"He doesn\u0027t want to be.\"\\n\\n Justus turned from me then. \"I\u0027ll give the orders. Kill him quickly, then take the body and get it out of my jurisdiction even quicker.\"\\n\\n \"Thank you, Justus.\"\\n\\n \"Don\u0027t embarrass any more of my officers or your friend will be asking for two bodies.\"\\n\\n When I came out of the fortress Maggie ran into my arms. \"It\u0027s horrible. They put a crown of thorns on his head and the crowd spit on him. The soldiers beat him.\" The crowd milled around us.\\n\\n \"Where is he now?\"\\n\\n The crowd roared and people began pointing up to the balcony. Pilate stood there next to Joshua, who was being held by two soldiers. Joshua stared straight ahead, still looking as if he were in a trance. Blood was running into his eyes.\\n\\n Pilate raised his arms and the crowd went quiet. \"I have no complaint with this man, yet your priests say that he has committed blasphemy. This is no crime under Roman law,\" said Pilate. \"What would you have me do with him?\"\\n\\n \"Crucify him!\" screamed someone next to me. I looked over to see Jakan waving a fist. The other Pharisees began chanting, \"Crucify him, crucify him.\" And soon the whole crowd seemed to join in. Among the crowd I saw the few of Joshua\u0027s followers that were left begin to slink away before the anger was turned on them. Pilate made a gesture as if he was washing his hands and walked inside.\\n\\n Friday\\n\\n Eleven apostles, Maggie, Joshua\u0027s mother, and his brother James gathered at the upper room of Joseph of Arimathea\u0027s house. The merchant had been to see Pilate and the governor agreed to release Joshua\u0027s body in honor of the Passover.\\n\\n Joseph explained: \"The Romans aren\u0027t stupid, they know our women prepare the dead, so we can\u0027t send the apostles to get him. The soldiers will give the body to Maggie and Mary. James, since you\u0027re his brother, they\u0027ll allow you to come along to help carry him. The rest of you should keep your faces covered. The Pharisees will be looking for Joshua\u0027s followers. The priests have already spent too much time on this during a feast week, so they\u0027ll all be at the Temple. I\u0027ve bought a tomb near the hill where they\u0027ll crucify him. Peter, you will wait there.\"\\n\\n \"What if I can\u0027t heal him?\" Peter said. \"I\u0027ve never even tried to raise the dead.\"\\n\\n \"He won\u0027t be dead,\" I said. \"He just won\u0027t be able to move. I couldn\u0027t find the ingredients I needed to make a potion to kill the pain, so he\u0027ll look dead, but he\u0027ll feel everything. I know what it\u0027s like, I was in that state for weeks once. Peter, you\u0027ll have to heal the wounds from the lash and the nails, but they shouldn\u0027t be mortal. I\u0027ll give him the antidote as soon as he\u0027s out of sight of the Romans. Maggie, as soon as they give him to you, close his eyes if they\u0027re open or they\u0027ll dry out.\"\\n\\n \"I can\u0027t watch it,\" Maggie said. \"I can\u0027t watch them nail him to that tree.\"\\n\\n \"You don\u0027t have to. Wait at the tomb. I\u0027ll send someone to get you when it\u0027s time.\"\\n\\n \"Can this work?\" Andrew said. \"Can you bring him back, Biff?\"\\n\\n \"I\u0027m not bringing him back from anything. He won\u0027t be dead, he\u0027ll just be hurt.\"\\n\\n \"We\u0027d better go,\" said Joseph, looking out the window at the sky. \"They\u0027ll bring him out at noon.\"\\n\\n A crowd had gathered outside of the praetorium, but most were merely curious; only a few of the Pharisees, among them Jakan, had actually come out to see Joshua executed. I stayed back, almost a half-block away, watching. The other disciples were spread out, wearing shawls or turbans that covered their faces. Peter had sent Bartholomew to sit with Maggie and Mary at the tomb. No shawl could disguise his bulk or his stench.\\n\\n Three heavy crossbeams leaned against the wall outside the palace gates, waiting for their victims. At noon Joshua was brought out along with two thieves who had also been sentenced to death, and the beams were placed upon their shoulders. Joshua was bleeding from a dozen places on his head and face, and although he still wore the purple robe that Herod had placed on him, I could see that blood from the flogging had run down and left streaks on his legs. He still looked like he was in some sort of trance, but there was no question that he was feeling the pain of his wounds. The crowd closed in on him, shouting insults and spitting on him, but I noticed that when he stumbled, someone always lifted him to his feet. His followers were still scattered among the crowd, they were just afraid to show themselves.\\n\\n From time to time I looked around the periphery of the mob and caught the eye of one of the apostles. Always there was a tear there, and always a mix of anguish and anger. It took everything I had not to rush in among the soldiers, take one of their swords, and start hacking. Afraid of my own temper, I fell back from the crowd until I came alongside of Simon. \"I can\u0027t do it either,\" I said. \"I can\u0027t watch them put him on the cross.\"\\n\\n \"You have to,\" the Zealot said.\\n\\n \"No, you be there, Simon. Let him see your face. Let him know you\u0027re there. I\u0027ll come up once the cross is set.\" I had never been able to look at someone who was being crucified even when I didn\u0027t know them. I knew I wouldn\u0027t be able to stomach watching them do it to my best friend. I\u0027d lose control, attack someone, and then we\u0027d both be lost. Simon was a soldier, a secret soldier, but a soldier still. He could do it. The horrible scene at the temple of Kali ran through my head.\\n\\n \"Simon, tell him I said mindful breath. Tell him that there is no cold.\"\\n\\n \"What cold?\"\\n\\n \"He\u0027ll know what it means. If he remembers he\u0027ll be able to shut out the pain. He learned to do that in the East.\"\\n\\n \"I\u0027ll tell him.\"\\n\\n I wouldn\u0027t be able to tell him myself, not without giving myself away.\\n\\n I watched from the walls of the city as they led Joshua to the road that ran by the hill called Golgotha, a thousand yards outside the Gennath Gate. I turned away, but even from a thousand yards I could hear him screaming as they drove the nails.\\n\\n Justus had assigned four soldiers to watch Joshua die. After a half hour they were alone except for perhaps a dozen onlookers and the families of the two thieves, who were praying and singing dirges at the feet of the condemned. Jakan and the other Pharisees had only stayed to see Joshua hoisted upright and the cross set, then they went off to feast with their families.\\n\\n \"A game,\" I said, tossing a pair of dice in the air as I approached the soldiers. \"Just a simple game.\" I had borrowed a tunic and an expensive sash from Joseph of Arimathea. He\u0027d also given me his purse, which I held up and jingled in front of the soldiers. \"A game, Legionnaire?\"\\n\\n One of the Romans laughed. \"And where would we get money to gamble with?\"\\n\\n \"We\u0027ll play for those clothes behind you. That purple robe at the foot of the cross.\"\\n\\n The Roman lifted the robe with a spear point, then looked up at Joshua, whose eyes went wide when he saw me. \"Sure, it looks like we\u0027ll be here a while. Let\u0027s have a game.\"\\n\\n First I had to lose enough money to give the Romans something to gamble with, then I had to win it back slowly enough to keep me there long enough to accomplish my mission. (I silently thanked Joy for teaching me how to cheat at dice.) I handed the dice to the soldier nearest me, who was perhaps fifty years old, built short and powerfully, but covered with scar tissue and gnarled limbs, evidence of broken bones mishealed. He looked too old to be soldiering this far from Rome, and too beaten down to make the journey home. The other soldiers were younger, in their twenties, I guessed, all with dark olive skin and dark eyes, all lean, fit, and hungry-looking. Two of the younger soldiers carried the standard Roman infantry spear, a wooden shaft with a narrow iron spike as long as a man\u0027s forearm, tipped with a compact three-bladed point designed to be driven through armor. The other two carried the wasp-waisted Iberian short sword that I\u0027d seen on Justus\u0027 belt so many times. He must have had them imported for his legion to fit his own preference. (Most Romans used a straight-bladed short sword.)\\n\\n I handed the dice to the old soldier and dumped some coins out in the dirt. As the Roman threw the dice against the bottom of Joshua\u0027s cross I scanned the hills and saw the apostles watching from behind trees and over rocks. I gave a signal and it passed from one to the other, and finally to a woman who waited back on one of the city walls.\\n\\n \"Oh my, the gods have turned against me today,\" I said, rolling a losing combination.\\n\\n \"I thought you Jews only had one God.\"\\n\\n \"I was talking about your gods, Legionnaire. I\u0027m losing.\"\\n\\n The soldiers laughed and I heard a moan from above us. I cringed and felt as if my ribs would cave in on themselves from the pain in my heart. I ventured a glance at Joshua and he was looking right at me. \"You don\u0027t have to do this,\" he said in Sanskrit.\\n\\n \"What nonsense is the Jew talking now?\" asked the old soldier.\\n\\n \"I couldn\u0027t say, soldier. He must be delirious.\"\\n\\n I saw two women approaching the foot of the cross on Joshua\u0027s left, carrying a large bowl, a jar of water, and a long stick.\\n\\n \"Hey there, get away from them.\"\\n\\n \"Just here to give a drink of water to the condemned, sir. No harm meant.\" The woman took a sponge from the bowl and squeezed it out. It was Susanna, Maggie\u0027s friend from Galilee, along with Johanna. They\u0027d come down for the Passover to cheer Joshua into the city, now we\u0027d conscripted them to help poison him. The soldiers watched as the women dipped the sponge, then attached it to the end of the stick and held it for the thief to drink from. I had to look away.\\n\\n \"Faith, Biff,\" Joshua said, again in Sanskrit.\\n\\n \"There, you shut up and die,\" barked one of the younger Romans.\\n\\n I twitched and squinted at the dice in lieu of crushing the soldier\u0027s windpipe.\\n\\n \"Give me a seven. Baby needs new sandals,\" said another young Roman.\\n\\n I couldn\u0027t look at Joshua and I couldn\u0027t look to see what the women were doing. The plan was that they would go to the two thieves first, so as not to raise suspicion, but now I was regretting the decision to delay.\\n\\n Finally Susanna brought the bowl to where we were gambling and set it down while Johanna poured some water over the sponge.\\n\\n \"Got any wine there for a thirsty soldier?\" said one of the young soldiers. He smacked Johanna on the bottom. \"Or some other relief?\"\\n\\n The old soldier caught the young soldier\u0027s arm and pushed him away. \"You\u0027ll be up on that stick with this wretch, Marcus. These Jews take touching their women seriously. Justus won\u0027t tolerate it.\"\\n\\n Susanna pulled her shawl around her face. She was pretty, lean with small facial features except for her wide brown eyes. She was too old not to be married, but I suspected that she had left a husband to follow Joshua. It was the same story with Johanna, except that her husband had followed along for a while, then divorced her when she wouldn\u0027t come home with him. She was more sturdily built, and she rolled like a wagon when she walked. She took the sponge and held it out to me.\\n\\n \"Drink, sir?\" Here the timing was critical.\\n\\n \"Anyone want a sip of water?\" I asked before taking the sponge. I was palming the ying-yang amulet as I said it.\\n\\n \"Drink after a Jewish dog. Not likely,\" said the old soldier.\\n\\n \"I\u0027m getting the impression that my Jewish money might sully your Roman purse,\" I said. \"Maybe I should go.\"\\n\\n \"No, your money\u0027s good enough,\" said a young soldier, punching my shoulder in good spirits. I was tempted to relieve him of his teeth.\\n\\n I took the sponge and feigned taking a drink. When I raised the sponge to squeeze the water into my mouth I dumped the poison over it. Instantly I handed it back to Johanna so as not to poison myself. Without dipping it back in the water she affixed the sponge to the stick and raised it up to Joshua\u0027s face. His head rolled, and his tongue rolled out of the side of his mouth against the moisture.\\n\\n \"Drink,\" Johanna said, but Joshua didn\u0027t seem to hear her. She pushed the sponge harder against his mouth and it dripped on one of the Romans. \"Drink.\"\\n\\n \"Move away from there, Marcus,\" said the old soldier. \"When he goes he\u0027ll lose his fluids all over you. You don\u0027t want to sit too close.\" The old Roman laughed raucously.\\n\\n \"Drink it, Joshua,\" said Susanna.\\n\\n Finally Joshua opened his eyes and pushed his face into the sponge. I held my breath as I heard him sucking the moisture out of it.\\n\\n \"Enough!\" said the young soldier. He knocked the stick out of Susanna\u0027s hands. The sponge went flying off into the dirt. \"He\u0027ll be dead soon.\"\\n\\n \"Not soon enough, though, with that block to stand on,\" said the old soldier.\\n\\n Then time began to pass more slowly than I could ever remember. When Joy had poisoned me it had taken only seconds before I was paralyzed, then when I\u0027d used the poison on the man in India he\u0027d dropped almost immediately. I tried to pretend to pay attention to the game, but I was looking for some sign that the poison was working.\\n\\n The women moved away and watched from a distance, but I heard one of them gasp and when I looked up, Joshua\u0027s head had lolled over. Drool ran out of his open mouth.\\n\\n \"How do you know when he\u0027s dead?\" I asked.\\n\\n \"Like this.\" The young soldier named Marcus prodded Joshua in the thigh with his spear. Joshua moaned and opened his eyes and I felt my stomach sink. I could hear sobbing from Johanna and Susanna.\\n\\n I threw the dice, and waited. An hour passed, and still Joshua moaned. I could hear him praying softly from time to time over the laughter of the soldiers. Another hour. I had begun to shake. Every sound from the cross was like a hot iron driven in my spine. I couldn\u0027t bring myself to look up at him. The disciples moved closer, less concerned now about staying hidden, but the Romans were too intent on their game to notice. Unfortunately, I was not intent enough.\\n\\n \"That\u0027s it for you,\" said the old soldier. \"Unless you want to gamble for your own cloak now. Your purse is empty.\"\\n\\n \"Is this bastard ever going to die?\" said one of the young soldiers.\\n\\n \"He just needs help,\" said the young soldier named Marcus, who had stood and was leaning on his spear. Before I could even get to my feet he thrust the spear upward into Joshua\u0027s side, the point went up under his ribs, and his heart blood pulsed down the iron in three great gushes, then ran out in a trickle. Marcus yanked the spear out. The entire hillside echoed with screaming, some of it my own. I stood transfixed, shaking, watching the blood run out of Joshua\u0027s side. Hands latched onto my arms and I was dragged back, away from the cross. The Romans started to pick up their things to head back to the praetorium.\\n\\n \"Loony,\" said the old soldier, looking at me.\\n\\n Joshua looked at me one last time, then closed his eyes and died.\\n\\n \"Come away, Biff,\" a woman\u0027s voice said in my ear. \"Come away.\" They turned me around and started marching me toward the city. I could feel a chill running over me as the wind came up and the sky started to darken under a sudden storm. There was still screaming, going on and on, and when Johanna clamped her hand over my mouth I realized it was me who had been screaming. I blinked tears out of my eyes, again and again, trying to at least see where they were leading me, but as soon as my sight would clear another sob would rock my body and the water would rise again.\\n\\n They were leading me to the Gennath Gate, that much I could tell, and there was a dark figure standing on the wall above the gate, watching us. I blinked and caught a single second of clarity as I saw who it was.\\n\\n \"Judas!\" I screamed until my voice shattered. I shook off the women and ran through the gate, swung myself up on top of one of the huge doors, and leapt to the wall. Judas ran south along the wall, looking from side to side for a place to jump off.\\n\\n There was no thought to what I was doing, nothing but grief gone to anger, love gone to hatred. I followed Judas across the roofs of Jerusalem, tossing aside anyone who got in my way, shattering pottery, crashing down rooftop chicken cages, pulling down lines of hanging clothes. When he came to a roof that led no further, Judas jumped two stories to the ground and came up limping as he ran down the street toward the Essene Gate at Ben Hinnon. I came off the roof full stride and landed without losing a step. Although I heard something tear in my ankle I couldn\u0027t feel it.\\n\\n There was a line of people trying to get into the city at the Essene Gate, probably seeking shelter from the impending storm. Lightning crackled across the sky and raindrops as big as frogs began to plop onto the streets, leaving craters in the dust and painting the city with a thin coat of mud. Judas fought through the crowd as if he were swimming in pitch, pulling people past him on either side, moving a step forward only to be carried back a step.\\n\\n I saw a ladder leaning against the city wall and ran up it. There were Roman soldiers stationed here on the wall and I brushed by them, ducking spears and swords as I made my way to the gate, then over it, then to the wall on the other side. I could see Judas below me. He\u0027d broken out of the crowd and was making his way along a ridge that ran parallel to the wall. It was too far to jump, so I followed him from above until I came to the corner of the battlement, where the wall sloped down to accommodate the thickness required to hold the corner. I slid down the wet limestone on my feet and hands and hit the ground ten paces behind the Zealot.\\n\\n He didn\u0027t know I was there. The rain came down now in sheets and the thunder was so frequent and loud that I could hear nothing myself but the roaring anger in my head. Judas came to a cypress tree that jutted over a high cliff with hundreds of tombs gouged into it. The path passed between a wall of tombs and the cypress tree; past the tree was a fifty-yard drop. Judas pulled a purse from his belt, pulled a small stone out of the opening to one of the tombs, then shoved the purse inside. I caught him by the back of the neck and he shrieked.\\n\\n \"Go ahead, put the stone back,\" I said.\\n\\n He tried to wheel on me and hit me with the stone. I took it from him and fitted it back into the tomb, then kicked his feet out from under him and dragged him to the edge of the cliff. I clamped onto his windpipe and, holding the cypress tree with my free hand, I leaned him out over the cliff.\\n\\n \"Don\u0027t struggle!\" I shouted. \"You\u0027ll only free yourself to the fall.\"\\n\\n \"I couldn\u0027t let him live,\" Judas said. \"You can\u0027t have someone like him alive.\" I pulled the Zealot back up on the cliff and whipped the sash from around his tunic.\\n\\n \"He knew he had to die,\" Judas said. \"How do you think I knew he\u0027d be at Gethsemane, not at Simon\u0027s? He told me!\"\\n\\n \"You didn\u0027t have to give him up!\" I screamed. I wrapped the sash around his neck, then pulled it tight over the crook of a cypress branch.\\n\\n \"Don\u0027t. Don\u0027t do this. I had to do it. Someone did. He would have just reminded us of what we\u0027ll never be.\"\\n\\n \"Yep,\" I said. I shoved him backward over the cliff and caught the end of the sash as it tightened around the branch. The sash twanged when it took his weight and his neck snapped with the sound of a knuckle cracking. I let go of the sash and Judas\u0027 body fell into the darkness. The boom of thunder concealed the sound of impact.\\n\\n The anger ran out of me then, leaving me feeling as if my very bones were losing their structure. I looked forward, straight over the Ben Hinnon valley, into a sheet of lightning-bleached rain. \"I\u0027m sorry,\" I said, and I stepped off the cliff. I felt a bolt of pain, and then nothing.\\n\\n That\u0027s all I remember. \\n\\n","sourceLink":"https://allnovel.net/lamb-the-gospel-according-to-biff-christ-s-childhood-pal/page-32.html","bookId":2643,"book":{"id":2643,"title":"Lamb: The Gospel According to Biff, Christ\u0027s Childhood Pal","description":"Storyline: A childhood pal of the savior is brought back from the dead to fill in the missing 30-year \"gap\" in the Gospels in Moore\u0027s latest, an over-the-top festival of sophomoric humor that stretches a very thin though entertaining conceit far past the breaking point. The action starts in modern America, specifically in a room at the Hyatt in St. Louis, where the angel who shepherds \"Levi who is called Biff\" has to put Christ\u0027s outrageous sidekick under de facto house arrest to get him to complete his task. Moore gets style points for his wild imagination as Biff recalls his journey with Jesus dubbed Joshua here according to the Greek translation into and out of the clutches of Balthasar, then into a Buddhist monastery in China and finally off to India, where they dabble in the spiritual and erotic aspects of Hinduism...\\n","cover":"https://allnovel.net/images/lamb-the-gospel-according-to-biff-christ-s-childhood-pal.jpg","author":"Christopher Moore","type":"Humorous","source":"allnovel","link":"https://allnovel.net/lamb-the-gospel-according-to-biff-christ-s-childhood-pal.html","creation":"Oct 5, 2019 8:59:00 AM","modification":"Oct 5, 2019 10:25:48 PM"}}
