{"id":42821,"no":22,"title":"CHAPTER XXII THE FALCON’S FLIGHT","content":"Unfortunate for those who awaited him was the mood of Drysdale, the director, on that particular morning. Perhaps he had not slept well. His breakfast may have been overdone, or cold. Men with hard heads, narrow hearts and few smiles seldom sleep well, and rarely do they enjoy their breakfast. \n \n “Where is she?” he demanded as he saw his watch point to the hour of nine. “Where is this young gypsy dancing queen?” \n \n Until this moment he had been told nothing. Hoping against hope that some miracle would bring Petite Jeanne back to them in time for the rehearsal, Angelo, Florence and Dan Baker had put off the inevitable. \n \n Seeing that the zero hour had arrived, Angelo climbed out of the trenches. “She’s gone,” he said simply. “She won’t be here.” \n 176 \n \n “Gone?” The gray steel face took on the color of glowing metal. “Won’t be here? What do you mean?” \n \n “Been kidnaped.” \n \n “Kidnaped! How? When? Why wasn’t I notified?” \n \n “No reason.” Angelo was still calm. “All’s been done that could be done. The police were here last night. They looked the place over. No clues. She’s gone. That’s all.” \n \n “Police? Here? Last night? This place? Why here last night?” Suspicion had been added to the anger in this man’s hard heart. \n \n Seeing that he had given the thing away, Angelo made a clean breast of the whole affair. \n \n The face of the director, as he learned that Petite Jeanne had been practicing her old dances at night in his theatre with the intention of using those dances on the opening night, was a terrible thing to see. \n \n “That!” he exploded, as Angelo’s story was finished. “That is the end!” \n 177 \n \n “Yes,” replied Angelo coldly, “no doubt of it. And well ended, too.” \n \n Beckoning to his companions, he walked from the room, down the stairs and out into the autumn morning. \n \n They walked, the three of them, Florence, Angelo and Dan Baker, one full city block. Then Dan Baker spoke. What he said was: \n \n “Coffee. Coffee and waffles, with pure maple syrup. Right in here.” \n \n Thus spoke Dan Baker, the old trouper. He had lost, perhaps forever, his one chance for fame and fortune. But he had not lost his heart of gold. \n \n * * * * * * * * \n \n After leaving the theatre, Merry had gone at once to a nearby store and purchased a spool of stout linen thread. \n \n Once outside the store, she attached the end of the thread to the silk cord on the falcon’s leg. The next thing she did was to shake the falcon from her wrist. \n 178 \n \n Flapping lazy wings, he soared aloft. Scarcely had he cleared the low building before him, however, than he shot straight away toward the west. \n \n Astonished at the pull he gave upon her thread, and fearful lest he break it, Merry played out the line grudgingly until she had him stopped and then slowly drew him back. Catching sight of her, he soared back to a place on her wrist. \n \n “So that’s settled!” she exclaimed with considerable animation. “I guessed as much. Now for something else.” \n \n Boarding a street car and ignoring the astonished stares of those who rode with her as they saw the falcon, she took a seat and rattled away toward the west. \n \n When she had ridden thirty blocks she left the car, and stood again on a street corner and released her bird. \n \n The performance of half an hour before was repeated in every detail. \n \n “Still westward he wings his flight,” she murmured as she drew the bird back. “That means the Forest Preserve. The flats around the settlement house are at my back now. \n 179 \n \n “Can’t go out there alone,” she told herself. “Not safe. They might kidnap me, too.” \n \n She thought of Kay King and Weston. Maxwell Street was not far off. \n \n “They’ll help me,” she told herself. \n \n Turning, she walked rapidly toward Maxwell Street and Kay King’s book store. \n \n “He belongs to those gypsies,” she said an hour later, pointing to the falcon. \n \n Kay had stood frowning and silent while she told her story. “Those gypsies kidnaped Petite Jeanne,” she went on. “I thought that from the start. When I found this bird I was sure of it. Since he flies toward the Forest Preserve I’m sure she’s out there somewhere.” \n \n “You’re probably right,” Kay agreed. “And I know where they’re camped. I bought some old French books from them week before last. You can’t go there on a street car. Too far. Weston’s off with his truck. Went for some trunks. When he gets back we can go out there. I’ll call Big John. He keeps a shop down the street. He’s got a gun, a regular cannon. We might need it.” \n 180 \n \n “Yes,” agreed Merry, as a little thrill ran up her spine, “we might.” \n \n Weston was slow in returning. Big John with his “regular cannon” needed looking up. It was mid-afternoon by the time they went rattling off toward the Forest Preserve. \n \n A strange lot of detectives they were, this “Golden Circle” of Merry’s: Kay King with his sensitive, almost girlish face; Weston, red-faced and habitually smiling; Big John, immense, stoical and slow, with a large gun tucked under his arm; and last, but not least, Merry and her falcon. \n \n The men rode on the broad front seat. Merry brought up the rear. She was comfortably stowed away in a pile of old quilts and blankets that lay on the floor of the closed truck. \n \n “Be almost night before we get there,” the girl thought to herself. \n \n As she closed her eyes she seemed to see gypsy camp fires gleaming in the fading light of day. About one of these fires a blonde girl was dancing. The girl was Petite Jeanne. A strange sort of vision, but not far wrong. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1913/55028.html","bookId":914,"book":{"id":914,"title":"The Golden Circle 黄金圈","description":"简介： Youll be entirely out of luck if you dont lie right down and go to sleep! Florence Huyler, her pal, exclaimed, making a significant gesture toward a sofa pillow which, as the little French girl had reason to know, was both heavy and hard. And Florenc...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1913","creation":"Aug 1, 2019 12:23:51 AM","modification":"Aug 1, 2019 12:23:51 AM"}}
