{"id":42835,"no":36,"title":"CHAPTER XXXVI THE GOLDEN TRIUMPH","content":"As Petite Jeanne entered her dressing room she found a diminutive figure hidden away in a corner. At sight of the little French girl this person sprang to her feet with a cry of joy: \n \n “Oh, Petite Jeanne! I have waited so long!” It was Merry. \n \n “But see!” She pointed proudly at Jeanne’s dressing table. “I brought him to you. He will bring you luck to-night, I am sure. For, only look! He is still gazing toward the sky!” On Petite Jeanne’s dressing table rested the marble falcon. \n \n “My own Merry!” Jeanne clasped her in her arms. “You think only of others. \n 288 \n \n “And you—” She clasped her friend at arm’s length. “Has the marble falcon brought you good fortune?” Seeing how pinched was the face of the little Irish girl, she realized with a pang that in all the rush and excitement of the last two weeks Merry had been sadly neglected. \n \n Merry hung her head for ten seconds. But her blue eyes were smiling as she whispered hoarsely: \n \n “Tad says good times are right round the corner. Our luck will change.” \n \n “Yes, indeed!” exclaimed Jeanne. “It will. It must.” And she made a solemn vow that in the future her success must bring success to her dear little Irish friend. \n \n Unknown to Jeanne, powerful influences had been at work. Her friend, the famous prima donna, enjoyed a large following. More than one morning she had seated herself at her telephone and had whispered words this way and that. The house had been sold out four days before the opening night. This had been glorious news. \n 289 \n \n “The best of the city will be here,” Solomon had said with a sober face. “One must remember, however, that the best are the most critical, too, and that their judgment is final. No curtain calls on the first night: good-bye, dear little light opera!” \n \n What wonder then that Petite Jeanne’s fingers trembled as she toyed with a rose in her dressing room fifteen minutes before the lifting of the curtain on that night of nights! \n \n “But I must be calm!” she told herself. “So much depends upon it: the success and happiness of all my Golden Circle! And with the success of this circle we may expand it. Merry shall enter it, and Tad, and perhaps others? \n \n “I have only to be real, to be quite natural, to dance as I have danced by the garden walls of France; to say to that audience of rich and wise and beautiful people: \n \n “‘See! I have for you something quite wonderful. It came from the past. Only the gypsies have seen it. Now I show it to you. And not alone I show it, but this sweet and good old dancer and all these, my chorus, so fresh and fair and young. Have you ever seen anything quite so enchanting? No. To be sure you have not!’” \n 290 \n \n Reassured by her own words, she rose to skip across the floor, then on down the vestibule toward the stage. \n \n When the curtain rose on a scene of matchless beauty, a gypsy camp somewhere in France; when the beholders found themselves looking upon the gorgeous costumes, colorful tents, and gaudily painted vans clustered about a brightly glowing campfire; when the music, which might well have been the whispering of wind among the trees, began stealing through the house, a hush fell upon the place such as is seldom experienced save in the depths of a great forest by night. \n \n When the little French girl, a frail wisp of humanity all done in red and gold, came spinning upon the stage to dance before the leering God whose very eyes appeared to gleam with hidden fire, the silence seemed to deepen. \n \n All through that first act, not a sound was heard save those which came from the stage. Not a programme rustled, not a whisper escaped. \n 291 \n \n When at last, having told his quaint story and been accepted as a dancer in place of the bear, the old trouper with Jeanne as his partner danced twice across the stage and disappeared into the shadows, the silence was shattered by such a roar of applause as the beautiful little playhouse had never before known. \n \n Seven times the curtain rose. Seven times the little French girl dragged her reluctant hero, Dan Baker, out to the footlights to bow to the still applauding audience. \n \n When at last the curtain fell for good, she whispered, “What a beginning! But there is yet more.” \n \n Who can describe in mere words of black on white the glories of that night? The scenes, done by an artist who had lived long in France, reproduced faithfully the gypsy camp by the roadside, the garden of the Tuileries in Paris and the little private garden of a rich French home. \n \n To many who saw them, these scenes brought back tender memories of the past. Some had been soldiers there, and some had gone there to enjoy the glory that is Paris. \n 292 \n \n And when Jeanne, a golden sprite, now leaping like a flame, now gliding like some wild thing of the forest, now seeming to float on air like a bird, poised herself against these marvelous settings, there came at every turn fresh gasps of surprise and delight. \n \n Nor did Jeanne seek all the glory. She appeared ever eager to bring forward those who were about her. When Dan Baker did his fantastic rustic dance and told his more fantastic yarns, she watched and listened as no others could. And hers was the first shrill scream of delight. \n \n When the chorus came weaving its way across the stage she joined them as one who is not a leader, but a humble companion. \n \n Indeed as the evening wore on, the delighted audience became more and more conscious of the fact that the little French dancer was not, in spirit, on that stage at all, but by some roadside in France and that, while contributing her share to the joy of the occasion, she was gleaning her full share from those who joined her in each act. \n 293 \n \n This was exactly what had happened. And Jeanne was not conscious of the row on row of smiling, upturned faces. She saw only one row. And in that row, by her request, sat the members of what she had playfully termed her “Outer Golden Circle.” \n \n And what a strange circle it was! First and most delighted of all, was the great prima donna, Marjory Bryce. Beside her was Merry, and on round the circle, Tad, Weston, Kay King, Big John and the ruddy faced Englishman, Preston Wamsley. To this group Florence had added three persons. These were dark mysterious beings with red handkerchiefs about their necks. Jeanne had started at sight of two of them. They were the gypsy mother and father who had once aided in kidnaping her. But the third! She all but fell upon the stage at sight of him. It was Bihari, her gypsy foster father who having learned, in the way these wanderers have, that Jeanne was to appear on the stage this night, had come all the way from France that he might be a guest of honor. \n 294 \n \n What a night for Jeanne! Little wonder that she outdanced her wildest dream! Little wonder that when the last curtain fell thunderous applause appeared to rock the great building. Little wonder that they called her back again and yet again. \n \n For all this, the night was not over. The keen mind of Abraham Solomon had thought up a fitting climax for so great a triumph. As, on the final curtain, they stood there in a group, Jeanne and her stage lover, Dan Baker, Angelo, Swen and Solomon, Jeanne broke away to scream in her high pitched voice: \n \n “This is our Golden Circle.” At that, whipping out a long roll of golden paper tape, she raced about the little group entwining them again and again, at last including herself within the circle. \n \n The audience went wild. They applauded; they whistled; they stamped their feet. \n \n More was to come. As the company of beautiful maidens, her chorus, gathered close, she encircled them to cry once more: \n \n “And this, too, is our Golden Circle.” \n 295 \n \n At this moment came the little dancer’s turn for surprise; for the audience, rising as one man, shouted in unison: “This is our Golden Circle!” \n \n At this instant the entire auditorium seemed to burst into yellow flame. The effect was startling in the extreme. Only ten seconds were required, however, for those on the stage to realize that the wise old Solomon, their manager, had put something over on them. The gold was the flash and gleam of a thousand golden streamers thrown to every point of the compass by delighted patrons. Solomon had provided the streamers with their programmes. Each person had been told in advance that when the time came for using these they would know. And few there were that did not realize when the real moment arrived. Truly, this was an occasion long to be remembered. \n \n Petite Jeanne’s face loomed large next day on every page devoted to dramatic art in the day’s papers. And beneath each were the words: “Girl of the Golden Circle.” \n 296 \n \n * * * * * * * * \n \n There is little left to tell; Petite Jeanne, the old trouper, Angelo, Swen, and all the rest had scored a triumph that would not soon be forgotten. \n \n Jeanne’s success did not, however, rob her of her interest in others; on the contrary, it served to increase it. On that very evening, as she was ushered into a magnificent reception room where she was to meet a very select company of patrons, the highly educated, the influential and the rich, she began her missionary work by whispering in every ear a deep secret of some tiny shop hidden away in a cellar where unusual objects of art might be purchased at unheard of prices. On the very next day Merry was astonished by the arrival of customers of such quality and importance as her little shop had not before known. It was no time at all before the little shop was humming merrily, Tad was busy at his bench and Merry back at her place at auction sales buying shrewdly for future needs. \n 297 \n \n One of the men captured by Florence and the friendly Englishman turned state’s evidence. By his confession, a band of contemptible rogues, who for a long time had been preying upon theatre folk, was apprehended and brought to justice. \n \n As for the dark-faced evil-minded gypsy who coveted the God of Fire, good old Bihari made short work of him. He revealed to the immigration authorities that this man had entered the country without a passport. And since he was the very one who had stolen the treasured god in the first place, when he set foot in France he was outlawed by the gypsies themselves. \n \n As Jeanne had known all the time, the wealthy Englishman, Preston Wamsley, had prized the articles of great beauty in his traveling bags, not because of their value in dollars, but because of his associations with those who from time to time had presented them to him. He had been broken-hearted upon learning that a blundering shipping clerk had billed them to the wrong name and address and that he had probably lost them forever. \n 298 \n \n Good fortune having knocked at his door, he was duly grateful. When Petite Jeanne had told the story, he insisted upon driving her out to Kay King’s tiny book shop, whereupon he rewarded the young man handsomely for the generous spirit he had shown in sacrificing sure financial gain in order to spare the feelings of a friend. \n \n During all the long run of the highly successful light opera, the marble falcon remained in its place on Petite Jeanne’s dressing table. \n \n “To me,” she said to her friend, the prima donna, one day, “it will always remain the symbol of one who, buffeted and broken by the storms of life, keeps his eyes fixed upon the clouds until at last he has achieved an abiding success.” \n \n “Ah, yes, how beautifully you say it!” exclaimed the great one. “But you, Petite Jeanne, you are the marble falcon of all time.” \n \n “I?” Petite Jeanne laughed a merry laugh. “For me life has been wonderful. There are always my many friends, you know.” \n 299 \n \n “Ah, yes, your Golden Circle. If it were not for these, our golden circles, how could we be brave enough to live at all?” \n \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1913/55042.html","bookId":914,"book":{"id":914,"title":"The Golden Circle 黄金圈","description":"简介： Youll be entirely out of luck if you dont lie right down and go to sleep! Florence Huyler, her pal, exclaimed, making a significant gesture toward a sofa pillow which, as the little French girl had reason to know, was both heavy and hard. And Florenc...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1913","creation":"Aug 1, 2019 12:23:51 AM","modification":"Aug 1, 2019 12:23:51 AM"}}
