{"id":44337,"no":16,"title":"LABOUR EXCHANGES AND UNEMPLOYMENT INSURANCE","content":"House of Commons, May 19, 1909 The functions of Government in relation to industrial life may be divided into three categories—discipline, organisation, and relief. The control and regulation of industrial conditions by penal and disciplinary powers belong to the Home Office, the relieving and curative processes are entrusted to the Local Government Board, and the organisation of industry falls to the province of the Board of Trade. The proposals which I now submit to the House are concerned only with organisation; they can be judged only in relation to that section of the subject; they do not pretend to stretch beyond it, or to include other not less important aspects; and I ask that they shall not be impugned, because, in dealing with the evils which properly fall within that sphere, they do not extend to other evils that lie without it. [254]I ask permission to introduce a Bill for the establishment of a national system of Labour Exchanges. There is high authority for this proposal. The Majority and Minority representatives of the Poor Law Commission, differing in so much else, are agreed unanimously in its support. \"In the forefront of our proposals,\" says the Majority Report, \"we place Labour Exchanges.\" \"This National Labour Exchange,\" says the Minority Report, \"though in itself no adequate remedy, is the foundation of all our proposals. It is, in our view, an indispensable condition of any real reform.\" The National Conference of Trade union Delegates, convened by the Parliamentary Committee of the Trade union Congress, of March 19, 1909, resolved unanimously: \"That this Conference of Trade union delegates, representing 1,400,000 members, approves of the establishment of Labour Exchanges on a national basis, under the control of the Board of Trade, provided that the managing board contains at least an equal proportion of employers and representatives of Trade unions.\" The Central Unemployed Body for London, by a Resolution in June 1908, declared in favour of a national system of Labour [255]Exchanges. Economists as divergent in opinion as Professor Ashley, of Birmingham, and Professor Chapman, of Manchester, have all approved and urged the project publicly in the strongest terms. Several of the principal members of the late Government have, either in evidence before the Poor Law Commission or in public speeches, expressed themselves in favour of Labour Exchanges, and the Report of the delegates of the Labour Party to Germany strongly approves of the system which they found there, namely: \"the co-ordination and systematic management of Public Labour Exchanges.\" The British authorities which I have mentioned are reinforced by the example of many foreign countries; and as early as 1904 the Board of Trade, in its reports on agencies and methods of dealing with unemployed in foreign countries, drew attention to the very considerable extension of Labour Exchanges in the last three years in Germany, Austria, Switzerland, France, and Belgium. Since then Norway has been added to the list. Mr. W. Bliss, in the Bulletin of the Washington Bureau of Labour for May, 1908, in the course of a survey of the whole field of unemployment and of possible remedies, says, \"The most [256]important agencies for providing work for the unemployed who are employable, but have no prospect of returning to their former positions, are the public employment bureaux. These are largely developed in a number of European countries, and especially in Germany, where they have grown rapidly in the last twenty years, both in numbers and in efficiency.\" So that the House will see that we have behind us this afternoon not only a practical consensus of opinion among authorities at home in favour of the policy, but the spectacle of its successful practice on an extensive scale, and over a period of years, in the greatest industrial community of the Continent, and its extension in various degrees to many other countries. I do not, therefore, propose to occupy the time of the House with any elaborate justification of the merits of the Bill. Those we may discuss at our leisure later. I confine myself only to a few general observations. Two main defects in modern industrial conditions which were emphasised by the Royal Commission were the lack of mobility of labour and lack of information. With both of these defects the National System of Labour [257]Exchanges is calculated to deal. Modern industry has become national. Fresh means of transport knit the country into one, as it was never knit before. Labour alone in its search for markets has not profited; the antiquated, wasteful, and demoralising method of personal application—that is to say, the hawking of labour—persists. Labour Exchanges will give labour for the first time a modernised market. Labour Exchanges, in the second place, will increase and will organise the mobility of labour. But let me point out that to increase the mobility of labour is not necessarily to increase the movement of labour. Labour Exchanges will not increase the movement of labour; they will only render that movement, when it has become necessary, more easy, more smooth, more painless, and less wasteful. Labour Exchanges do not pretend to any large extent to create new employment. Their main function will be to organise the existing employment, and by organising the existing employment to reduce the friction and wastage, resulting from changes in employment and the movement of workers, to a minimum. By so doing they will necessarily raise the general economic standard of our industrial life. [258]So far as the second defect, \"lack of information,\" is concerned, a system of Labour Exchanges promises to be of the highest value. In proportion as they are used, they will give absolutely contemporary information upon the tendencies of the demand for labour, both in quality and in quantity, as between one trade and another, as between one season and another, as between one cycle and another, and as between one part of the country and another. They will tell the worker where to go for employment. They will tell him, what is scarcely less important, where it is useless to go in search of employment. Properly co-ordinated and connected with the employment bureaux of the various education authorities, which are now coming into existence in Scotland and in England, they will afford an increasing means of guiding the new generation into suitable, promising, and permanent employment, and will divert them from overstocked or declining industries. They will put an end to that portion of unemployment that is merely local or accidental in character. They are the only means of grappling with the evils of casual employment, with all its demoralising consequences. They are capable [259]of aiding the process of dovetailing one seasonal trade into another. A system of Labour Exchanges, dispensing with the need for wandering in search of work, will make it possible, for the first time, to deal stringently with vagrancy. And, lastly, Labour Exchanges are indispensable to any system of Unemployment Insurance, as indeed to any other type of honourable assistance to the unemployed, since they alone can provide an adequate test of the desire for work and of the reality of unemployment. The authority of both Reports of the Poor Law Commission may be cited upon these points; and I shall present this Bill to the House as an important piece of social and industrial machinery, the need for which has long been apparent, and the want of which has been widely and painfully felt. I said that in the creation of such a system we may profit by the example of Germany; we may do more, we may improve upon the example of Germany. The German Exchanges, though co-ordinated and encouraged to some extent by State and Imperial Governments, are mainly municipal in their scope. Starting here with practically a clear field and with the [260]advantage of the experiment and the experience of other lands to guide us, we may begin upon a higher level and upon a larger scale. There is reason to believe that the utility of a system like Labour Exchanges, like utility of any other market, increases in proportion to its range and scope. We therefore propose, as a first principle, that our system shall be uniform and national in its character; and here, again, we are supported both by the Minority and by the Majority Reports of the Royal Commission. A Departmental Committee at the Board of Trade has, during the last six months, been working out the scheme in close detail. The whole country will be divided into ten or twelve principal divisions, each with a Divisional Clearing House, and each under a Divisional Chief, all co-ordinated with the National Clearing House in London. Distributed among these 10 Divisions in towns of, let us say, 100,000 or upwards will be between 30 and 40 First-class Labour Exchanges; in towns of 50,000 to 100,000 between 40 and 50 Second-class Exchanges; and about 150 minor offices, consisting of Third-class Exchanges, Sub-Offices, and Waiting-rooms, which last will be specially used in connection with Dock decasualisation. [261]The control and direction of the whole system will be under the Board of Trade. But in order to secure absolute impartiality as between the interests of capital and labour, Joint Advisory Committees, to contain in equal numbers representatives of employers and work-people, will be established in the principal centres. Thus we shall apply to the local management of Labour Exchanges the same principle of parity of representation between workmen and employers under impartial guidance and chairmanship, that we have adopted in the administration of the Trade Boards Bill, and that, mutatis mutandis, is the governing feature of the Courts of Arbitration which have recently been set up. If this Bill should obtain the assent of Parliament without undue delay, I should hope to bring the system into simultaneous operation over the whole country, so far as practicable, in the early months of next year. Temporary premises will be procured in all cases in the first instance; but a programme of building has been prepared, which in ten years will by a gradual process enable in all the principal centres these temporary premises to be replaced by permanent buildings. [262]The expense of this system will no doubt be considerable. Its ordinary working will not need a sum less than about ￡170,000 per year, and during the period when the building is going on the expenditure will rise to about ￡200,000 per year. We hope that the Labour Exchanges will become industrial centres in each town. We hope they will become the labour market. They may, where necessary, provide an office where the Trade Board, if there is one, will hold its meetings. We desire to co-operate with trade unions on cordial terms, while preserving strict impartiality between capital and labour in disputed matters. It may, for instance, be possible for trade unions to keep their vacant-book in some cases at the exchanges. The structure of those Exchanges may in some cases be such as to enable us to have rooms which can be let to trade unions at a rent, for benefit and other meetings, so as to avoid the necessity under which all but the strongest unions lie at the present time of conducting their meetings in licensed premises. The Exchanges may, as they develop, afford facilities for washing, clothes-mending, and for non-alcoholic refreshments to persons who are attending them. Separate provision will be made for [263]men and for women, and for skilled and for unskilled labour. Boy labour will be dealt with in conjunction with the local Education Authorities; and travelling expenses may be advanced on loan, if the management of the Exchange think fit, to persons for whom situations have been found. So much for the policy of Labour Exchanges. That is a policy complete in itself. It would be considerable if it stood alone; but it does not stand alone. As my right hon. friend the Chancellor of the Exchequer has announced in his Budget speech, the Government propose to associate with the policy of Labour Exchanges a system of Unemployment Insurance. The House knows that the Minority Report advocates a system of compulsory labour exchanges, that no person shall engage any man for less than a month except through a Labour Exchange. That is not the proposal we are making. We are making a proposal of voluntary Labour Exchanges. I am quite ready to admit that no system of voluntary Labour Exchanges can deal adequately with the evils and difficulties of casual labour; but there is one conclusive reason against compulsory [264]Labour Exchanges at the present time. To establish a system of compulsory Labour Exchanges in order to eliminate casual labour, and so to divide among a certain proportion of workers all available employment, would be absolutely and totally to cast out at the other end a surplus of unemployed: and to do this before preparations have been made for dealing with that surplus, would be to court an administrative breakdown which could not fail to be attended with the gravest possible disaster. Until poor law reform has made further progress, to establish a compulsory system of Labour Exchanges would only increase and not diminish the miseries with which we are seeking to cope. We have, therefore, decided that our system of labour exchanges shall be voluntary in its character. For that very reason there is a great danger, to which I have never shut my eyes, that the highest ranks of labour, skilled workers, members of strong trade unions, would not think it necessary to use the Exchanges, but would use the very excellent apparatus which they have established themselves; that therefore this expensive system of Exchanges which we are calling into being would come to be [265]used only by the poorest of the workers in the labour market, and, consequently, would gradually relapse and fall back into the purely distress machinery and non-economic machinery from which we are labouring to extricate and separate it. It is for that reason, quite apart from the merits of the scheme of unemployment insurance, that the Government are very anxious to associate with their system of Labour Exchanges a system of unemployed insurance. If Labour Exchanges depend for their effective initiation and establishment upon unemployment insurance being associated with them, it is equally true to say that no scheme of unemployment insurance can be worked except in conjunction with some apparatus for finding work and testing willingness to work, like Labour Exchanges. The two systems are complementary; they are man and wife; they mutually support and sustain each other. So I come to Unemployment Insurance. It is not practicable at the present time to establish a universal system of unemployment insurance. We, therefore, have to choose at the very outset of this subject between insuring some workmen in all trades or all workmen in some. In the [266]first case we should have a voluntary, and in the second a compulsory system. The risk of unemployment varies so much between one man and another owing to relative skill, character, demeanour, and other qualities, that any system of State-aided voluntary insurance is utilised mainly by those most liable to be unemployed, and, consequently, a preponderance of bad risks is established against the Insurance Office fatal to its financial stability. On the other hand, a compulsory system of insurance, which did not add to the contribution of the worker a substantial contribution from outside, would almost certainly break down, because of the refusal of the higher class of worker to assume, unsupported, a share of the burden of the weaker members of the community. We have decided to adopt the second alternative, and our insurance system will, in consequence, be based upon four main principles. It will involve contributions from workmen and employers; it will receive a substantial subvention from the State; it will be organised by trades; it will be compulsory upon all—employers and employed, skilled and unskilled, unionists and non-unionists alike—within those [267]trades. The hon. Member for Leicester[15] with great force showed that to confine a scheme of unemployment insurance merely to trade unionists would be trifling with the subject. It would only be aiding those who have, thank God, been most able to aid themselves, without at the same time assisting those who hitherto, under existing conditions, have not been able to make any effective provision. To what trades ought we, as a beginning, to apply this system of compulsory contributory unemployment insurance? There is a group of trades specially marked out for the operation of such a policy. They are trades in which unemployment is not only high, but chronic, for even in the best of times it persists; in which it is not only high and chronic, but marked by seasonal and cyclical fluctuations, and in which, wherever and howsoever it occurs, it takes the form not of short time or of any of those devices for spreading wages and equalising or averaging risks, but of a total, absolute, periodical discharge of a certain proportion of the workers. The group of trades which we contemplate to be the subject of our scheme are these: house-building, and [268]works of construction, engineering, machine-and tool-making, ship-building and boat-building, making of vehicles, and mill-sawing. That is a very considerable group of industries. They comprise, probably at the present time, 2? millions of adult males. Two and a quarter millions of adult males are, roughly speaking, one-third of the population of these three kingdoms engaged in purely industrial work; that is to say, excluding commercial, professional, agricultural, and domestic occupations. Of the remaining two-thirds of the industrial population, nearly one-half are employed in the textile trades, in mining, on the railways, in the merchant marine, and in other trades, which either do not present the same features of unemployment which we see in these precarious trades, or which, by the adoption of short time or other arrangements, avoid the total discharge of a proportion of workmen from time to time. So that this group of trades to which we propose to apply the system of unemployment insurance, roughly speaking, covers very nearly half of the whole field of unemployment; and that half is, on the whole, perhaps the worse half. The financial and actuarial basis of the [269]scheme has been very carefully studied by the light of all available information. The report of the actuarial authorities whom I have consulted leaves me in no doubt that, even after all allowance has been made for the fact that unemployment may be more rife in the less organised and less highly skilled trades than in the trade unions who pay unemployment benefits—which is by no means certain—there is no doubt whatever that a financially sound scheme can be evolved which, in return for moderate contributions, will yield adequate benefits. I do not at this stage propose to offer any figures of contributions or benefits to the House. I confine myself to stating that we propose to aim at a scale of benefits which would be somewhat lower both in amount and in duration of payments, than that which the best-organised trade unions provide for their own members, but which, at the same time, should afford a substantial weekly payment extending over by far the greater part of the average period of unemployment of all unemployed persons in these trades. In order to enable such a scale of benefits to be paid, we should have to raise a total sum of something between [270]5d. and 6d. per week per head, and this sum will be met by contributions, not necessarily equal, from the State, the workman, and the employer. For such sacrifices, which are certainly not extortionate, and which, fairly adjusted, will not hamper industry nor burden labour, nor cause an undue strain on public finance, we believe it possible to relieve a vast portion of our industrial population from a haunting and constant peril which gnaws the very heart of their prosperity and contentment. The House will see the connection of this to the Labour Exchanges. The machinery of the insurance scheme has been closely studied, and, as at present advised, we should propose to follow the example of Germany in respect of Insurance Cards or Books, to which stamps will be affixed week by week. When a worker in an insured trade loses his employment, all he will have to do is to take his card to the Labour Exchange, which, working in conjunction with the Insurance Office, will find him a job or pay him his benefit. The relation of the whole scheme of insurance to the present voluntary efforts of trade unions requires, and will receive, the most anxious consideration, and I am in [271]hopes that we shall be able to make proposals which would absolutely safeguard trade unions from the unfair competition of a national insurance fund, and will indeed act as a powerful encouragement to voluntary organisations which are providing unemployed benefit. I have thought it right to submit these not inconsiderable proposals in general outline to the House of Commons at this early stage, in order that the proposals for Labour Exchanges which we are now putting forward may be properly understood, and may not be underrated or misjudged. We cannot bring the system of unemployment insurance before Parliament in a legislative form this year for five reasons: We have not now got the time; we have not yet got the money; the finance of such a system has to be adjusted and co-ordinated with the finance of the other insurance schemes upon which the Chancellor of the Exchequer is engaged; the establishment of a system of Labour Exchanges is the necessary forerunner and foundation of a system of insurance; and, lastly, no such novel departure as unemployment insurance could possibly be taken without much further consultation and negotiation with the trade [272]unions and employers specially concerned than the conditions of secrecy under which we have been working have yet allowed. This business of conference and consultation of the fullest character will occupy the winter, when the Board of Trade will confer with all parties affected, so that the greatest measure of agreement may be secured for our proposals when they are next year presented in their final form. It is only necessary for me to add that the pressure and prospect of these heavy duties have required me to make a re-arrangement of the Labour Department of the Board of Trade. I propose to divide it into three sections. The first will be concerned with Wages questions and Trade disputes, with Arbitration, Conciliation, and with the working of the Trade Boards Bill, should it become law; the second, with Statistics, the Census of Production, Special Inquiries, and The Labour Gazette; and the third, with Labour Exchanges and Unemployment Insurance. One of the functions of the last section will be to act as a kind of intelligence bureau, watching the continual changes of the labour market here and abroad, and suggesting any measure which may [273]be practicable, such as co-ordination and distribution of Government contracts and municipal work, so as to act as a counterpoise to the movement of the ordinary labour market, and it will also, we trust, be able to conduct examinations of schemes of public utility, so that such schemes can, if decided upon by the Government and the Treasury, be set on foot at any time with knowledge and forethought, instead of the haphazard, hand-to-mouth manner with which we try to deal with these emergencies at the present time. Such are the proposals which we submit in regard to the organisation section of this problem. I have carefully confined myself to that section. I have not trespassed at all upon the other no less important or scarcely less important branches, and I am quite certain this Parliament will gladly devote whatever strength it possesses to attempting to grapple with these hideous problems of social chaos, which are marring the contentment and honour of our country, and which, neglected, may fatally affect its life and its strength. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2888/79911.html","bookId":1140,"book":{"id":1140,"title":"Liberalism and the Social Problem","description":"简介： These are the principal speeches I have made within the last four years. They have been chosen and collected with the idea of presenting a consistent and simultaneous view of the general field of British politics in an hour of fateful decision....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2888","creation":"Aug 1, 2019 12:24:26 AM","modification":"Aug 1, 2019 12:24:26 AM"}}
