{"id":43262,"no":8,"title":"CHAPTER VII.","content":"Conquest of the Seljuks YOUR face is troubled, uncle.’ ‘So is my mind.’ ‘All may go well.’ ‘Miriam, we have seen the best. Prepare yourself for sorrow, gentle girl. I care not for myself, for I am old, and age makes heroes of us all. I have endured, and can endure more. As we approach our limit, it would appear that our minds grow callous. I have seen my wealth, raised with the labours of a thoughtful life, vanish in a morn: my people, a fragile remnant, nevertheless a people, dispersed, or what is worse. I have wept for them, although no tear of selfish grief has tinged this withered cheek. And, were I but alone, ay! there’s the pang. The solace of my days is now my sorrow.’ ‘Weep not for me, dear uncle. Rather let us pray that our God will not forsake us.’ ‘We know not when we are well. Our hours stole tranquilly along, and then we murmured. Prospering, we murmured, and now we are rightly stricken. The legend of the past is Israel’s bane. The past is a dream; and, in the waking present, we should discard the enervating shadow. Why should we be free? We murmured against captivity. This is captivity: this damp, dim cell, where we are brought to die. ‘O! youth, rash youth, thy being is destruction. But yesterday a child, it seems but yesterday I nursed him in these arms, a thoughtless child, and now our house has fallen by his deeds. I will not think of it; ‘twill make me mad.’ ‘Uncle, dearest uncle, we have lived together, and we will die together, and both in love; but, I pray you, speak no harsh word of David.’ ‘Shall I praise him?’ ‘Say nothing. What he has done, if done in grief, has been done all in honour. Would you that he had spared Alschiroch?’ ‘Never! I would have struck him myself. Brave boy, he did his duty; and I, I, Miriam, thy uncle, at whom they wink behind his back and call him niggard, was I wanting in that hour of trial? Was my treasure spared to save my people? Did I shrink from all the toil and trouble of that time? A trying time, my Miriam, but compared with this, the building of the Temple——’ ‘You were then what you have ever been, the best and wisest. And since our fathers’ God did not forsake us, even in that wilderness of wildest woe, I offer gratitude in present faith, and pay him for past mercies by my prayers for more.’ ‘Well, well, life must end. The hour approaches when we must meet our rulers and mock trial; precious justice that begins in threats and ends in torture. You are silent, Miriam.’ ‘I am speaking to my God.’ ‘What is that noise? A figure moves behind the dusky grate. Our gaoler. No, no, it is Caleb! Faithful child, I fear you have perilled much.’ ‘I enter with authority, my lord, and bear good tidings.’ ‘He smiles! Is’t possible? Speak on, speak on!’ ‘Alroy has captured the harem of our Governor, as they journeyed from Bagdad to this city, guarded by his choicest troops. And he has sent to offer that they shall be exchanged for you and for your household. And Hassan has answered that his women shall owe their freedom to nothing but his sword. But, in the meantime, it is agreed between him and the messenger of your nephew, that both companies of prisoners shall be treated with all becoming courtesy. You, therefore, are remanded to your palace, and the trumpet is now sounding before the great mosque to summon all the host against Alroy, whom Hassan has vowed to bring to Hamadan dead or alive.’ ‘The harem of the Governor, guarded too by his choicest troops! ‘Tis a great deed. He did remember us. Faithful boy! The harem of the Governor! his choicest troops! ‘Tis a very great deed. Me-thinks the Lord is with him. He has his great father’s heart. Only think of David, a child! I nursed him, often. Caleb! Can this be David, our David, a child, a girl? Yet he struck Alschiroch! Miriam! where is she? Worthy Caleb, look to your mistress; she has fallen. Quite gone! Fetch water. ‘Tis not very pure, but we shall be in our palace soon. The harem of the Governor! I can’t believe it. Sprinkle, sprinkle. David take them prisoners! Why, when they pass, we are obliged to turn our heads, and dare not look. More water: I’ll rub her hand. ‘Tis warmer! Her eyes open! Miriam, choice news, my child! The harem of the Governor! I’ll not believe it! ‘Once more within our walls, Caleb. Life is a miracle. I feel young again. This is home; and yet I am a prisoner. You said the host were assembling; he can have no chance. Think you, Caleb, he has any chance? I hope he will die. I would not have him taken. I fear their tortures. We will die too; we will all die. Now I am out of that dungeon, me-thinks I could even fight. Is it true that he has joined with robbers?’ ‘I saw the messenger, and learnt that he first repaired to some bandits in the ruins in the desert. He had become acquainted with them in his pilgrimage. They say their leader is one of our people.’ ‘I am glad of that. He can eat with him. I would not have him eat unclean things with the Ishmaelites.’ ‘Lord, sir! our people gather to him from all quarters. ‘Tis said that Jabaster, the great Cabalist, has joined him from the mountains with ten thousand men.’ ‘The great Jabaster! then there is some chance. I know Jabaster well. He is too wise to join a desperate cause. Art sure about Jabaster? ‘Tis a great name, a very potent spirit. I have heard such things of that Jabaster, sir, would make you stare like Saul before the spirit! Only think of our David, Caleb, making all this noise! I am full of hope. I feel not like a prisoner. He beat the harem guard, and, now he has got Jabaster, he will beat them all.’ ‘The messenger told me he captured the harem, only to free his uncle and his sister.’ ‘He ever loved me; I have done my duty to him; I think I have. Jabaster! why, man, the name is a spell I There are men at Bagdad who will get up in the night to join Jabaster. I hope David will follow his counsels in all things. I would I had seen his servant, I could have sent him a message.’ ‘Lord, sir! the Prince Alroy has no great need of counsellors, I can tell you. ‘Tis said he bears the sceptre of great Solomon, which he himself obtained in the unknown tombs of Palestine.’ ‘The sceptre of Solomon! could I but believe it! ‘Tis an age of wonders! Where are we? Call for Miriam, I’ll tell her this. Only think of David, a mere child, our David with the sceptre of Solomon! and Jabaster too! I have great faith. The Lord confound his enemies!’ ‘Gentle Rachel, I fear I trouble you; sweet Beruna, I thank you for your zeal. I am better now; the shock was great. These are strange tidings, maidens.’ ‘Yes, dear lady! who would have thought of your brother turning out a Captain?’ ‘I am sure I always thought he was the quietest person in the world,’ said Beruna, ‘though he did kill Alschiroch.’ ‘One could never get a word out of him,’ said Rachel. ‘He was always moping alone,’ said Beruna. ‘And when one spoke to him he always turned away,’ said Leah. ‘Or blushed,’ added Imra. ‘Well, for my part,’ said the beautiful Bathsheba, ‘I always thought Prince David was a genius. He had such beautiful eyes!’ ‘I hope he will conquer Hassan,’ said Rachel. ‘So do I,’ said Beruna. ‘I wonder what he has done with the harem,’ said Leah. ‘I don’t think he will dare to speak to them,’ said Imra. ‘You are very much mistaken,’ said Bathsheba. ‘Hark!’ said Miriam. ‘‘Tis Hassan,’ said Bathsheba; ‘may he never return!’ The wild drum of the Seljuks sounded, then a flourish of their fierce trumpets, and soon the tramp of horse. Behind the blinds of their chamber, Miriam and her maidens beheld the magnificent troop of tur-baned horsemen, who, glittering with splendid armour and bright shawls, and proudly bounding on their fiery steeds, now went forth to crush and conquer the only hope of Israel. Upon an Arab, darker than night, rode the superb Hassan, and, as he passed the dwelling of his late prisoners, whether from the exulting anticipation of coming triumph, or from a soft suspicion that, behind that lattice, bright eyes and brilliant faces were gazing on his state, the haughty but handsome Seljuk flourished his scimitar over his head, as he threw his managed steed into attitudes that displayed the skill of its rider. ‘He is handsomer than Alschiroch,’ said Rachel. ‘What a shawl!’ said Beruna. ‘His scimitar was like lightning,’ said Leah. ‘And his steed like thunder,’ said Imra. ‘The evil eye fall on him!’ said Bathsheba. ‘Lord,’ exclaimed Miriam, ‘remember David and all his afflictions!’ The deserted city of the wilderness presented a very different appearance from that which met the astonished gaze of Alroy, when he first beheld its noble turrets, and wandered in its silent streets of palaces. Without the gates was pitched a numerous camp of those low black tents common among the Kourds and Turkmans; the principal street was full of busy groups engaged in all the preparations of warfare, and all the bustling expedients of an irregular and adventurous life; steeds were stalled in ruined chambers, and tall camels raised their still visages among the clustering columns, or crouched in kneeling tranquillity amid fallen statues and prostrate obelisks. Two months had scarcely elapsed since Alroy and Jabaster had sought Scherirah in his haunt, and announced to him their sacred mission. The callous heart of him, whose ‘mother was a Jewess,’ had yielded to their inspired annunciations. He embraced their cause with all the fervour of conversion, and his motley band were not long sceptical of a creed which, while it assuredly offered danger and adventure, held out the prospects of wealth and even empire. From the city of the wilderness the new Messiah sent forth his messengers to the neighbouring cities, to announce his advent to his brethren in captivity. The Hebrews, a proud and stiff-necked race, ever prone to rebellion, received the announcement of their favourite prince with transport. The descendant of David, and the slayer of Alschiroch, had double claims upon their confidence and allegiance, and the flower of the Hebrew youth in the neighbouring cities of the Caliphate repaired in crowds to pay their homage to the recovered sceptre of Solomon. The affair was at first treated by the government with contempt, and the sultan of the Seljuks contented himself with setting a price upon the head of the murderer of his brother; but, when several cities had been placed under contribution, and more than one Moslem caravan stopped, and plundered in the name of the God of Abraham, of Isaac, and of Jacob, orders were despatched from Bagdad to the new governor of Hamadan, Hassan Subah, to suppress the robbers, or the rebels, and to send David Alroy dead or alive to the capital. The Hebrew malcontents were well apprised by their less adventurous but still sympathising brethren of everything that took place at the head-quarters of the enemy. Spies arrived on the same day at the city of the wilderness, who informed Alroy that his uncle was thrown into a dungeon at Hamadan, and that a body of chosen troops were about to escort a royal harem from Bagdad into Persia. Alroy attacked the escort in person, utterly discomfited them, and captured their charge. It proved to be the harem of the Governor of Hamadan, and if for a moment the too sanguine fancy of the captor experienced a passing pang of disappointment, the prize at least obtained, as we have seen, the freedom and security of his dear though distant friends. This exploit precipitated the expedition which was preparing at Hamadan for his destruction. The enraged Hassan Subah started from his divan, seized his scimitar, and without waiting for the auxiliaries he had summoned from the neighbouring chieftains, called to horse, and at the head of two thousand of the splendid Seljuk cavalry, hurried to vindicate his love and satiate his revenge. Within the amphitheatre which he first entered as a prisoner, Alroy sat in council. On his right was Jabaster, Scherirah on his left. A youth, little his senior, but tall as a palm-tree, and strong as a young lion, was the fourth captain. In the distance, some standing, some reclining, were about fifty men completely armed. ‘Are the people numbered, Abner?’ inquired Alroy of the youth. ‘Even so; three hundred effective horsemen, and two thousand footmen; but the footmen lack arms.’ ‘The Lord will send them in good time,’ said Jabaster; ‘meanwhile let them continue to make javelins.’ ‘Trust in the Lord,’ murmured Scherirah, bending his head, with his eyes fixed on the ground. A loud shout was heard throughout the city. Alroy started from his carpet. The messenger had returned. Pale and haggard, covered with sweat and sand, the faithful envoy was borne into the amphitheatre almost upon the shoulders of the people. In vain the guard endeavoured to stem the passage of the multitude. They clambered up the tiers of arches, they filled the void and crumbling seats of the antique circus, they supported themselves upon each other’s shoulders, they clung to the capitals of the lofty columns. The whole multitude had assembled to hear the intelligence; the scene recalled the ancient purpose of the building, and Alroy and his fellow-warriors seemed like the gladiators of some old spectacle. ‘Speak,’ said Alroy, ‘speak the worst. No news can be bitter to those whom the Lord will avenge.’ ‘Ruler of Israel! thus saith Hassan Subah,’ answered the messenger: ‘My harem shall owe their freedom to nothing but my sword. I treat not with rebels, but I war not with age or woman; and between Bostenay and his household on one side, and the prisoners of thy master on the other, let there be peace. Go, tell Alroy, I will seal it in his best blood. And lo! thy uncle and thy sister are again in their palace.’ Alroy placed his hand for a moment to his eyes, and then instantly resuming his self-possession, he enquired as to the movements of the enemy. ‘I have crossed the desert on a swift dromedary54 lent to me by Shelomi of the Gate, whose heart is with our cause. I have not tarried, neither have I slept. Ere to-morrow’s sunset the Philistines will be here, led by Hassan Subah himself. The Lord of Hosts be with us! Since we conquered Canaan, Israel hath not struggled with such a power!’ A murmur ran through the assembly. Men exchanged enquiring glances, and involuntarily pressed each other’s arms. ‘The trial has come,’ said a middle-aged Hebrew, who had fought twenty years ago with Jabaster. ‘Let me die for the Ark!’ said a young enthusiast of the band of Abner. ‘I thought we should get into a scrape,’ whispered Kisloch the Kourd to Calidas the Indian. ‘What could have ever induced us to give up robbing in a quiet manner?’ ‘And turn Jews!’ said the Guebre, with a sneer. ‘Look at Scherirah,’ said the Negro, grinning. ‘If he is not kissing the sceptre of Solomon!’ ‘I wish to heaven he had only hung Alroy the first time he met him,’ said Calidas. ‘Sons of the Covenant!’ exclaimed Alroy, ‘the Lord hath delivered them into our hands. To-morrow eve we march to Hamadan!’ A cheer followed this exclamation. ‘It is written,’ said Jabaster, opening a volume, ‘“Lo! I will defend this city, to save it, for mine own sake, and for my servant David’s sake.” ‘“And it came to pass that night that the angel of the Lord went out, and smote in the camp of the Assyrians, an hundred four score and five thousand; and when they arose early in the morning, behold! they were all dead corpses.” ‘Now, as I was gazing upon the stars this morn, and reading the celestial alphabet known to the true Cabalist,55 behold! the star of the house of David and seven other stars moved, and met together, and formed into a circle. And the word they formed was a mystery to me; but lo! I have opened the book, and each star is the initial letter of each line of the Targum that I have now read to you. Therefore the fate of Sennacherib is the fate of Hassan Subah!’ ‘“Trust in him at all times, ye people; pour out your heart before him.” god is a refuge for us. Selah!’ At this moment a female form appeared on the very top of the amphitheatre, upon the slight remains of the upper most tier of which a solitary arch alone was left. The chorus instantly died away, every tongue was silent, every eye fixed. Hushed, mute, and immovable, even Kisloch and his companions were appalled as they gazed upon Esther the Prophetess. Her eminent position, her imposing action, the flashing of her immense eyes, her beautiful but awful countenance, her black hair, that hung almost to her knees, and the white light of the moon, just rising over the opposite side of the amphitheatre, and which threw a silvery flash upon her form, and seemed to invest her with some miraculous emanation, while all beneath her was in deep gloom,-these circumstances combined to render her an object of universal interest and attention, while in a powerful but high voice she thus addressed them: ‘They come, they come! But will they go? Lo! hear ye this, O house of Jacob, which are called by the name of Israel, and are come forth out of the waters of Judah! I hear their drum in the desert, and the voice of their trumpets is like the wind of eve, but a decree hath gone forth, and it says, that a mortal shall be more precious than fine gold, yea, a man than the rich ore of Ophir. ‘They come, they come! But will they go? I see the flash of their scimitars, I mark the prancing of their cruel steeds; but a decree hath gone forth, and it says, a gleaning shall be left among them, as in the shaking of the olive-tree; two or three berries on the top of the uppermost bough; four or five on the straggling branches. ‘They come, they come! But will they go? Lo! a decree hath gone forth, and it says, Hamadan shall be to thee for a spoil, and desolation shall fall upon Babylon. And there shall the wild beasts of the desert lodge, and howling monsters shall fill their houses, and there shall the daughters of the ostrich dwell, and there shall the screech-owl pitch her tent, and there shall the night-raven lay her eggs, and there shall the satyrs hold their revels. And wolves shall howl to one another in their palaces, and dragons in their voluptuous pavilions. Her time is near at hand; her days shall not be prolonged; the reed and the lotus shall wither in her rivers; and the meadows by her canals shall be as the sands of the desert. For, is it a light thing that the Lord should send his servant to raise up the tribes of Jacob, and to restore the preserved of Israel? Sing, O heavens, and be joyful, O earth, and break forth into singing, O mountains, for the Lord hath comforted his people, and will have mercy upon his afflicted!’ She ceased; she descended the precipitous side of the amphitheatre with rapid steps, vaulting from tier to tier, and bounding with wonderful agility from one mass of ruin to another. At length she reached the level; and then, foaming and panting, she rushed to Alroy, threw herself upon the ground, embraced his feet, and wiped off the dust from his sandals with her hair. The assembly broke into long and loud acclamations of supernatural confidence and sanguine enthusiasm. They beheld their Messiah wave his miraculous sceptre. They thought of Hassan Subah and his Seljuks only as of victims, and of to-morrow only as of a day which was to commence a new era of triumph, freedom, and empire! Hassan Subah after five days’ forced marches pitched his sumptuous pavilion in that beautiful Oasis, which had afforded such delightful refreshment to Alroy when a solitary pilgrim. Around for nearly a mile, were the tents of his warriors, and of the numerous caravan that had accompanied him, laden with water and provisions for his troops. Here, while he reposed, he also sought information as to the position of his enemy. A party of observation, which he had immediately despatched, returned almost instantly with a small caravan that had been recently plundered by the robbers. The merchant, a venerable and pious Moslem, was ushered into the presence of the Governor of Hamadan. ‘From the robbers’ haunt?’ enquired Hassan. ‘Unfortunately so,’ answered the merchant. ‘Is it far?’ ‘A day’s journey.’ ‘And you quitted it?’ ‘Yesterday morn.’ ‘What is their force?’ The merchant hesitated. ‘Do they not make prisoners?’ enquired the Governor, casting a scrutinising glance at his companion. ‘Holy Prophet! what a miserable wretch am I!’ exclaimed the venerable merchant, bursting into tears. ‘A faithful subject of the Caliph, I am obliged to serve rebels, a devout Moslem, I am forced to aid Jews! Order me to be hanged at once, my lord,’ continued the unfortunate merchant, wringing his hands. ‘Order me to be hanged at once. I have lived long enough.’ ‘What is all this?’ enquired Hassan; ‘speak, friend, without fear.’ ‘I am a faithful subject of the Caliph,’ answered the merchant; ‘I am a devout Moslem, but I have lost ten thousand dirhems.’ ‘I am sorry for you, sir; I also have lost something, but my losses are nothing to you, nor yours to me.’ ‘Accursed be the hour when these dogs tempted me! Tell me, is it sin to break faith with a Jew?’ ‘On the contrary, I could find you many reverend Mollahs, who will tell you that such a breach is the highest virtue. Come! come, I see how it is: you have received your freedom on condition of not betraying your merciful plunderers. Promises exacted by terror are the bugbears of fools. Speak, man, all you know. Where are they? What is their force? Are we supposed to be at hand?’ ‘I am a faithful subject of the Caliph, and I am bound to serve him,’ replied the merchant; ‘I am a devout Moslem, and ‘tis my duty to destroy all Giaours, but I am also a man, and I must look after my own interest. Noble Governor, the long and the short is, these scoundrels have robbed me of ten thousand dirhems, as my slaves will tell you: at least, goods to that amount. No one can prove that they be worth less. It is true that I include in that calculation the fifty per cent. I was to make on my shawls at Hamadan, but still to me it is as good as ten thousand dirhems. Ask my slaves if such an assortment of shawls was ever yet beheld.’ ‘To the point, to the point. The robbers?’ ‘I am at the point. The shawls is the point. For when I talked of the shawls and the heaviness of my loss, you must know that the captain of the robbers—’ ‘Alroy?’ ‘A fierce young gentleman, I do not know how they call him: said the captain to me, “Merchant, you look gloomy.” “Gloomy,” I said, “you would look gloomy if you were a prisoner, and had lost ten thousand dirhems.” “What, is this trash worth ten thousand dirhems?” said he. “With the fifty per cent. I was to make at Hamadan.” “Fifty per cent.,” said he; “you are an old knave.” “Knave! I should like to hear any one call me knave at Bagdad.” “Well, knave or not, you may get out of this scrape.” “How?” “Why you are a respectable-looking man,” said he, “and are a good Moslem into the bargain, I warrant.” “That I am,” said I, “although you be a Jew: but how the faith is to serve me here I am sure I don’t know, unless the angel Gabriel, as in the fifty-fifth verse of the twenty-seventh chapter of the Koran——“’ ‘Tush, tush!’ exclaimed Hassan; ‘to the point.’ ‘I always am at the point, only you put me out. However, to make it as short as possible, the captain knows all about your coming, and is frightened out of his wits, although he did talk big; I could easily see that. And he let me go, you see, with some of my slaves, and gave me an order for five thousand dirhems on one Bostenay, of Hamadan (perhaps you know him; is he a good man?), on condition that I would fall in with you, and, Mohammed forgive me, tell you a lie!’ ‘A lie!’ ‘Yes, a lie; but these Jewish dogs do not understand what a truly religious man is, and when I began to tell the lie, I was soon put out. Now, noble Hassan, if a promise to a Jew be not binding on a true believer, and you will see me straight with the five thousand dirhems, I will betray everything at once.’ ‘Be easy about the five thousand dirhems, good man, and tell me all.’ ‘You will see me paid?’ ‘My honour upon it.’ ‘‘Tis well! Know then, the infamous dogs are very weak, and terrified at the news of your progress: one, whom I think they call Jabaster, has departed with the great majority of the people into the interior of the desert, about seven hundred strong. I heard so; but mind, I do not know it. The young man, whom you call Alroy, being wounded in a recent conflict, could not depart with them, but remains among the ruins with some female prisoners, some treasure, and about a hundred companions hidden in sepulchres. He gave me my freedom on condition that I should fall in with you, and assure you that the dogs, full five thousand strong, had given you the go-by in the night, and marched towards Hamadan. They wanted me to frighten you; it was a lie, and I could not tell it. And now you know the plain truth; and if it be a sin to break faith with an infidel, you are responsible for it, as well as for the five thousand dirhems, which, by-the-bye, ought to have been ten.’ ‘Where is your order?’ ‘‘Tis here,’ said the merchant, drawing it from his vest, ‘a very business-like document, drawn upon one Bostenay, whom they described as very rich, and who is here enjoined to pay me five thousand dirhems, if, in consequence of my information, Hassan Subah, that is yourself, return forthwith to Hamadan without attacking them.’ ‘Old Bostenay’s head shall answer for this.’ ‘I am glad of it. But were I you, I would make him pay me first.’ ‘Merchant,’ said Hassan, ‘have you any objection to pay another visit to your friend Alroy?’ ‘Allah forbid!’ ‘In my company?’ ‘That makes a difference.’ ‘Be our guide. The dirhems shall be doubled.’ ‘That will make up for the fifty per cent. I hardly like it; but in your company that makes a difference. Lose no time. If you push on, Alroy must be captured. Now or never! The Jewish dogs, to rifle a true believer!’ ‘Oglu,’ said Hassan to one of his officers. ‘To horse! You need not strike the tents. Can we reach the city by sunset, merchant?’ ‘An hour before, if you be off at once.’ ‘Sound the drums. To horse! to horse!’ The Seljuks halted before the walls of the deserted city. Their commander ordered a detachment to enter and reconnoitre. They returned and reported its apparent desolation. Hassan Subah, then directing that a guard should surround the walls to prevent any of the enemy from escaping, passed with his warriors through the vast portal into the silent street. The still magnificence of the strange and splendid scene influenced the temper even of this ferocious cavalry. They gazed around them with awe and admiration. The fierceness of their visages was softened, the ardour of their impulse stilled. A supernatural feeling of repose stole over their senses. No one brandished his scimitar, the fiery courser seemed as subdued as his lord, and no sound was heard but the melancholy, mechanical tramp of the disciplined march, unrelieved by martial music, inviolate by oath or jest, and unbroken even by the ostentatious caracoling of any showy steed. It was sunset; the star of eve glittered over the white Ionian fane that rose serene and delicate in the flashing and purple sky. ‘This way, my lord!’ said the merchant guide, turning round to Hassan Subah, who, surrounded by his officers, led the van. The whole of the great way of the city was filled with the Seljukian warriors. Their ebon steeds, their snowy turbans, adorned with plumes of the black eagle and the red heron, their dazzling shawls, the blaze of their armour in the sunset, and the long undulating perspective of beautiful forms and brilliant colours, this regiment of heroes in a street of palaces. War had seldom afforded a more imposing or more picturesque spectacle. ‘This way, my lord!’ said the merchant, pointing to the narrow turning that, at the foot of the temple, led through ruined streets to the amphitheatre. ‘Halt!’ exclaimed a wild shrill voice. Each warrior suddenly arrested his horse. ‘Who spoke?’ exclaimed Hassan Subah. ‘I!’ answered a voice. A female form stood in the portico of the temple, with uplifted arms. ‘And who art thou?’ enquired Hassan Subah, not a little disconcerted. ‘Thine evil genius, Seljuk!’ Hassan Subah, pale as his ivory battle-axe, did not answer; every man within hearing shuddered; still the dread woman remained immovable within the porch of the temple. ‘Woman, witch, or goddess,’ at length exclaimed Hassan Subah, ‘what wouldst thou here?’ ‘Seljuk! behold this star. ‘Tis a single drop of light, yet who even of thy wild band can look upon it without awe? And yet thou worse than Sisera, thou comest to combat against those for whom even “the stars in their courses fought.”’ ‘A Jewish witch!’ exclaimed the Seljuk. ‘A Jewish witch! Be it so; behold, then, my spell falls upon thee, and that spell is Destruction. ‘Awake, awake, Deborah: awake, awake, utter a song; arise, Barak, and lead thy captivity captive, thou son of Abinoam!’ Immediately the sky appeared to darken, a cloud of arrows and javelins broke from all sides upon the ?levoted Seljuks: immense masses of stone and marble were hurled from all directions, horses were stabbed by spears impelled by invisible hands, and riders fell to the ground without a struggle, and were trampled upon by their disordered and affrighted brethren. ‘We are betrayed,’ exclaimed Hassan Subah, hurling a javelin at the merchant, but the merchant was gone. The Seljuks raised their famous war cry. ‘Oglu, regain the desert,’ ordered the chieftain. But no sooner had the guard without the walls heard the war cry of their companions, than, alarmed, for their safety, they rushed to their assistance. The retreating forces of Subah, each instant diminishing as they retreated, were baffled in their project by the very eagerness of their auxiliaries. The unwilling contention of the two parties increased the confusion; and when the Seljuks, recently arrived, having at length formed into some order, had regained the gate, they found to their dismay that the portal was barricadoed and garrisoned by the enemy. Uninspired by the presence of their commander, who was in the rear, the puzzled soldiers were seized with a panic, and spurring their horses, dispersed in all directions of the city. In vain Hassan Subah endeavoured to restore order. The moment was past. Dashing with about thirty men to an open ground, which his quick eye had observed in his progress down the street, and dealing destruction with every blow, the dreaded Governor of Hamadan, like a true soldier, awaited an inevitable fate, not wholly despairing that some chance might yet turn up to extricate him from his forlorn situation. And now, as it were by enchantment, wild armed men seemed to arise from every part of the city. From every mass of ruin, from every crumbling temple and mouldering mansion, from every catacomb and cellar, from behind every column and every obelisk, upstarted some desperate warrior with a bloody weapon. The massacre of the Seljuks was universal. The horsemen dashed wildly about the ruined streets, pursued by crowds of footmen; sometimes, formed in small companies, the Seljuks charged and fought desperately; but, however stout might be their resistance to the open foe, it was impossible to withstand their secret enemies. They had no place of refuge, no power of gaining even a moment’s breathing time. If they retreated to a wall it instantly bristled with spears; if they endeavoured to form, in a court, they sank under the falling masses which were showered upon them. Strange shouts of denunciation blended with the harsh braying of horns, and the clang and clash of cymbals and tambours sounded in every quarter of the city. ‘If we could only mount the walls, Ibrahim, and leap into the desert!’ exclaimed Hassan Subah to one of his few remaining comrades; ‘‘tis our only chance. We die here like dogs! Could I but meet Alroy!’ Three of the Seljuks dashed swiftly across the open ground in front, followed by several Hebrew horsemen. ‘Smite all, Abner. Spare none, remember Amalek,’ exclaimed their youthful leader, waving his bloody scimitar. ‘They are down; one, two, there goes the third. My javelin has done for him.’ ‘Your horse bleeds freely. Where’s Jabaster?’ ‘At the gates; my arm aches with slaughter. The Lord hath delivered them into our hands. Could I but meet their chieftain!’ ‘Turn, bloodhound, he is here,’ exclaimed Hassan Subah. ‘Away, Abner, this affair is mine.’ ‘Prince, you have already slain your thousands.’ ‘And Abner his tens of thousands. Is it so? This business is for me only. Come on, Turk.’ ‘Art thou Alroy?’ ‘The same.’ ‘The slayer of Alschiroch?’ ‘Even so.’ ‘A rebel and a murderer.’ ‘What you please. Look to yourself.’ The Hebrew Prince flung a javelin at the Seljuk. It glanced from the breastplate; but Hassan Subah staggered in his seat. Recovering, he charged Alroy with great force. Their scimitars crossed, and the blade of Hassan shivered. ‘He who sold me that blade told me it was charmed, and could be broken only by a caliph,’ said Hassan Subah. ‘He was a liar.’ ‘As it may be,’ said Alroy, and he cut the Seljuk to the ground. Abner had dispersed his comrades. Alroy leaped from his fainting steed, and, mounting the ebon courser of his late enemy, dashed again into the thickest of the fight. The shades of night descended, the clamour gradually decreased, the struggle died away. A few unhappy Moslemin who had quitted their saddles and sought concealment among the ruins, were occasionally hunted out, and brought forward and massacred. Long ere midnight the last of the Seljuks had expired.56 The moon shed a broad light upon the street of palaces crowded with the accumulated slain and the living victors. Fires were lit, torches illumined, the conquerors prepared the eager meal as they sang hymns of praise and thanksgiving. A procession approached. Esther the prophetess, clashing her cymbals, danced before the Messiah of Israel, who leant upon his victorious scimitar, surrounded by Jabaster, Abner, Scherirah, and his chosen chieftains. Who could now doubt the validity of his mission? The wide and silent desert rang with the acclamations of his enthusiastic votaries. Heavily the anxious hours crept on in the Jewish quarter of Hamadan. Again and again the venerable Bostenay discussed the chances of success with the sympathising but desponding elders. Miriam was buried in constant prayer. Their most sanguine hopes did not extend beyond the escape of their Prince. A fortnight had elapsed, and no news had been received of the progress of the expedition, when suddenly, towards sunset, a sentinel on a watch-tower announced the appearance of an armed force in the distance. The walls were instantly lined with the anxious inhabitants, the streets and squares filled with curious crowds. Exultation sat on the triumphant brow of the Moslemin; a cold tremor stole over the fluttering heart of the Hebrew. ‘There is but one God,’ said the captain of the gate. ‘And Mahomed is His prophet,’ responded a sentinel. ‘To-morrow we will cut off the noses of all these Jewish dogs.’ ‘The sceptre has departed,’ exclaimed the despairing Bostenay. ‘Lord, remember David!’ whispered Miriam, as she threw herself upon the court of the palace, and buried her face in ashes. The Mollahs in solemn procession advanced to the ramparts, to shed their benediction on the victorious Hassan Subah. The Muezzin ascended the minarets to watch the setting sun, and proclaim the power of Allah with renewed enthusiasm. ‘I wonder if Alroy be dead or alive,’ said the captain of the gate. ‘If he be alive, he will be impaled,’ responded a sentinel. ‘If dead, the carcass will be given to the dogs,’ rejoined the captain; ‘that is the practice.’ ‘Bostenay will be hung,’ said the sentinel. ‘And his niece, too,’ answered the captain. ‘Hem!’ said the sentinel. ‘Hassan Subah loves a black eye.’ ‘I hope a true Moslem will not touch a Jewess,’ exclaimed an indignant black eunuch. ‘They approach. What a dust!’ said the captain of the gate. ‘I see Hassan Subah!’ said the sentinel. ‘So do I,’ said the eunuch, ‘I know his black horse.’ ‘I wonder how many dirhems old Bostenay is worth,’ said the captain. ‘Immense!’ said the sentinel. ‘No plunder, I suppose?’ said the eunuch. ‘We shall see,’ said the captain; ‘at any rate, I owe a thousand to old Shelomi. We need not pay now, you know.’ ‘Certainly not,’ said the black eunuch. ‘The rebels.’ A body of horsemen dashed forward. Their leader in advance reined in his fiery charger beneath the walls. ‘In the name of the Prophet, who is that?’ exclaimed the captain of the gate, a little confused. ‘I never saw him before,’ said the sentinel, ‘although he is in the Seljuk dress. ‘Tis some one from Bagdad, I guess.’ A trumpet sounded. ‘Who keeps the gate?’ called out the warrior. ‘I am the captain of the gate,’ answered our friend. ‘Open it, then, to the King of Israel.’ ‘To whom?’ enquired the astonished captain. ‘To King David. The Lord hath delivered Hassan Subah and his host into our hands, and of all the proud Seljuks none remaineth. Open thy gates, I say, and lose no time. I am Jabaster, a lieutenant of the Lord; this scimitar is my commission. Open thy gates, and thou and thy people shall have that mercy which they have never shown; but if thou delayest one instant, thus saith the King our master, “I will burst open your portal, and smite, and utterly destroy all that you have, and spare them not; but slay both man and woman, infant and suckling, ox and sheep, camel and ass.”’ ‘Call forth the venerable Lord Bostenay,’ said the captain of the gate, with chattering teeth. ‘He will intercede for us.’ ‘And the gentle Lady Miriam,’ said the sentinel. ‘She is ever charitable.’ ‘I will head the procession,’ said the black eunuch; ‘I am accustomed to women.’ The procession of Mollahs shuffled back to their college with profane precipitation; the sun set, and the astounded Muezzin stood with their mouths open, and quite forgot to announce the power of their Deity, and the validity of their Prophet. The people all called out for the venerable Lord Bostenay and the gentle Lady Miriam, and ran in crowds to see who could first kiss the hem of their garments. The principal gate of Hamadan opened into the square of the great mosque. Here the whole population of the city appeared assembled. The gates were thrown open; Jabaster and his companions mounted guard. The short twilight died away, the shades of night descended. The minarets were illumined,57 the houses hung with garlands, the ramparts covered with tapestry and carpets. A clang of drums, trumpets, and cymbals announced the arrival of the Hebrew army. The people shouted, the troops without responded with a long cheer of triumph. Amid the blaze of torches, a youth waving his scimitar, upon a coal-black steed, bounded into the city, at the head of his guards, the people fell upon their knees, and shouted ‘Long live Alroy!’ A venerable man, leading a beauteous maiden with downcast eyes, advanced. They headed a deputation of the chief inhabitants of the city. They came to solicit mercy and protection. At the sight of them, the youthful warrior leaped from his horse, flung away his scimitar, and clasping the maiden in his arms, exclaimed, ‘Miriam, my sister, this, this indeed is triumph!’ ‘Drink,’ said Kisloch the Kourd to Calidas the Indian; ‘you forget, comrade, we are no longer Moslemin.’ ‘Wine, methinks, has a peculiarly pleasant flavour in a golden cup,’ said the Guebre. ‘I got this little trifle to-day in the Bazaar,’ he added, holding up a magnificent vase studded with gems. ‘I thought plunder was forbidden,’ grinned the Negro. ‘So it is,’ replied the Guebre; ‘but we may purchase what we please, upon credit.’ ‘Well, for my part, I am a moderate man,’ exclaimed Calidas the Indian, ‘and would not injure even these accursed dogs of Turks. I have not cut my host’s throat, but only turned him into my porter, and content myself with his harem, his baths, his fine horses, and other little trifles.’ ‘What quarters we are in! There is nothing like a true Messiah!’ exclaimed Kisloch, devoutly. ‘Nothing,’ said Calidas; ‘though to speak truth, I did not much believe in the efficacy of Solomon’s sceptre, till his Majesty clove the head of the valiant Seljuk with it.’ ‘But now there’s no doubt of it,’ said the Guebre. ‘We should indeed be infidels if we doubted now,’ replied the Indian. ‘How lucky,’ grinned the Negro, ‘as I had no religion before, that I have now fixed upon the right one!’ ‘Most fortunate!’ said the Guebre. ‘What shall we do to amuse ourselves to-night?’ ‘Let us go to the coffee-houses and make the Turks drink wine,’ said Calidas the Indian. ‘What say you to burning down a mosque?’ said Kisloch the Kourd. ‘I had great fun with some Dervishes this morning,’ said the Guebre. ‘I met one asking alms with a wire run through his cheek,58 so I caught another, bored his nose, and tied them both together!’ ‘Hah! hah! hah!’ burst the Negro. Asia resounded with the insurrection of the Jews, and the massacre of the Seljuks. Crowds of Hebrews, from the rich cities of Persia and the populous settlements on the Tigris and the Euphrates, hourly poured into Hamadan. The irritated Moslemin persecuted the brethren of the successful rebel, and this impolicy precipitated their flight. The wealth of Bagdad flowed into the Hebrew capital. Seated on the divan of Hassan Subah, and wielding the sceptre of Solomon, the King of Israel received the homage of his devoted subjects, and despatched his envoys to Syria and to Egypt. The well-stored magazines and arsenals of Hamadan soon converted the pilgrims into warriors. The city was unable to accommodate the increased and increasing population. An extensive camp, under the command of Abner, was formed without the walls, where the troops were daily disciplined, and where they were prepared for greater exploits than a skirmish in a desert. Within a month after the surrender of Hamadan, the congregation of the people assembled in the square of the great mosque, now converted into a synagogue. The multitude was disposed in ordered ranks, and the terrace of every house was crowded. In the centre of the square was an altar of cedar and brass, and on each side stood a company of priests guarding the victims, one young bullock, and two rams without blemish. Amid the flourish of trumpets, the gates of the synagogue opened, and displayed to the wondering eyes of the Hebrews a vast and variegated pavilion planted in the court. The holy remnant, no longer forlorn, beheld that tabernacle of which they had so long dreamed, once more shining in the sun, with its purple and scarlet hangings, its curtains of rare skins, and its furniture of silver and gold. A procession of priests advanced, bearing, with staves of cedar, run through rings of gold, a gorgeous ark, the work of the most cunning artificers of Persia. Night and day had they laboured, under the direction of Jabaster, to produce this wondrous spectacle. Once more the children of Israel beheld the cherubim. They burst into a triumphant hymn of thanksgiving, and many drew their swords, and cried aloud to be led against the Canaanites. From the mysterious curtains of the tabernacle, Alroy came forward, leading Jabaster. They approached the altar. And Alroy took robes from the surrounding priests, and put them upon Jabaster, and a girdle, and a breastplate of jewels. And Alroy took a mitre, and placed it upon the head of Jabaster, and upon the mitre he placed a crown; and pouring oil upon his head, the pupil anointed the master High Priest of Israel. The victims were slain, the sin-offering burnt. Amid clouds of incense, bursts of music, and the shouts of a devoted people; amid odour, and melody, and enthusiasm, Alroy mounted his charger, and at the head of twenty thousand men, departed to conquer Media. The extensive and important province of Aderbijan, of which Hamadan was the capital, was formed of the ancient Media. Its fate was decided by one battle. On the plain of Nehauend, Alroy met the hastily-raised levies of the Atabek of Kermanshah, and entirely routed them. In the course of a month, every city of the province had acknowledged the supremacy of the new Hebrew monarch, and, leaving Abner to complete the conquest of Louristan, Alroy entered Persia. The incredible and irresistible progress of Alroy roused Togrul, the Turkish Sultan of Persia, from the luxurious indolence of the palaces of Nishapur. He summoned his emirs to meet him at the imperial city of Rhey, and crush, by one overwhelming effort, the insolent rebel. Religion, valour, and genius, alike inspired the arms of Alroy, but he was, doubtless, not a little assisted by the strong national sympathy of his singular and scattered people, which ever ensured him prompt information of all the movements of his enemy. Without any preparation, he found agents in every court, and camp, and cabinet; and, by their assistance, he anticipated the designs of his adversaries, and turned even their ingenuity to their confusion. The imperial city of Rhey was surprised in the night, sacked, and burnt to the ground. The scared and baffled emirs who escaped, flew to the Sultan Togrul, tearing their beards, and prophesying the approaching termination of the world. The palaces of Nishapur resounded with the imprecations of their master, who, cursing the Jewish dogs, and vowing a pilgrimage to Mecca, placed himself at the head of a motley multitude of warriors, and rushed upon the plains of Irak, to exterminate Alroy. The Persian force exceeded the Hebrew at least five times in number. Besides a large division of Seljuks, the Caucasus had poured forth its strange inhabitants to swell the ranks of the Faithful. The wild tribes of the Bactiari were even enlisted, with their fatal bows, and the savage Turkmans, tempted by the sultan’s gold, for a moment yielded their liberty, and shook their tall lances in his ranks. But what is a wild Bactiari, and what is a savage Turkman, and what even a disciplined and imperious Seljuk, to the warriors of the God of Abraham, of Isaac, and of Jacob? At the first onset, Alroy succeeded in dividing the extended centre of Togrul, and separating the greater part of the Turks from their less disciplined comrades. At the head of his Median cavalry, the Messiah charged and utterly routed the warriors of the Caucasus. The wild tribes of the Bactiari discharged their arrows and fled, and the savage Turkmans plundered the baggage of their own commander. The Turks themselves fought desperately; but, deserted by their allies, and surrounded by an inspired foe, their efforts were unavailing, and their slaughter terrible. Togrul was slain while heading a desperate and fruitless charge, and, after his fall, the battle resembled a massacre rather than a combat. The plain was glotted with Seljuk gore. No quarter was given or asked. Twenty thousand chosen troops fell on the side of the Turks; the rest dispersed and gained the mountains. Leaving Scherirah to restore order, Alroy the next morning pushed on to Nishapur at the head of three thousand horsemen, and summoned the city ere the inhabitants were apprised of the defeat and death of their sultan. The capital of Persia escaped the fate of Rhey by an inglorious treaty and a lavish tribute. The treasures of the Chosroes and the Gasnevides were despatched to Hamadan, on which city day dawned, only to bring intelligence of a victory or a conquest. While Alroy dictated peace on his own terms in the palaces of Nishapur, Abner, having reduced Louristan, crossed the mountains, and entered Persia with the reinforcements he had received from Jabaster. Leaving the government and garrisoning of his new conquests to this valiant captain, Alroy, at the head of the conquerors of Persia, in consequence of intelligence received from Hamadan, returned by forced marches to that city. Leaving the army within a day’s march of the capital, Alroy, accompanied only by his staff, entered Hamadan in the evening, and, immediately repairing to the citadel, summoned Jabaster to council. The night was passed by the king and the high priest in deep consultation. The next morning, a decree apprised the inhabitants of the return of their monarch, of the creation of the new ‘Kingdom of the Medes and Persians,’ of which Hamadan was declared the capital, and Abner the viceroy, and of the intended and immediate invasion of Syria, and re-conquest of the Land of Promise. The plan of this expedition had been long matured, and the preparations to effect it were considerably advanced. Jabaster had not been idle during the absence of his pupil. One hundred thousand warriors were now assembled59 at the capital of the kingdom of the Medes and Persians; of these the greater part were Hebrews, but many Arabs, wearied of the Turkish yoke, and many gallant adventurers from the Caspian, easily converted from a vague idolatry to a religion of conquest, swelled the ranks of the army of the Lord of Hosts. The plain of Hamadan was covered with tents, the streets were filled with passing troops, the bazaars loaded with military stores; long caravans of camels laden with supplies every day arrived from the neighbouring towns; each instant some high-capped Tatar with despatches60 rushed into the city and galloped his steed up the steep of the citadel. The clang of arms, the prance of horses, the flourish of warlike music, resounded from all quarters. The business and the treasure of the world seemed, as it were in an instant, to have become concentrated in Hamadan. Every man had some great object; gold glittered in every hand. All great impulses were stirring; all the causes of human energy were in lively action. Every eye sparkled, every foot trod firm and fast. Each man acted as if the universal fate depended upon his exertions; as if the universal will sympathised with his particular desire. A vast population influenced by a high degree of excitement is the most sublime of spectacles. The commander of the Faithful raised the standard of the Prophet on the banks of the Tigris. It was the secret intelligence of this intended event that had recalled Alroy so suddenly from Persia. The latent enthusiasm of the Moslemin was excited by the rare and mystic ceremony, and its effects were anticipated by previous and judicious preparations. The Seljuks of Bagdad alone amounted to fifty thousand men; the Sultan of Syria contributed the warriors who had conquered the Arabian princes of Damascus and Aleppo; while the ancient provinces of Asia Minor, which formed the rich and powerful kingdom of Seljukian Roum, poured forth a myriad of that matchless cavalry, which had so often baffled the armies of the C?sars. Never had so imposing a force been collected on the banks of the Tigris since the reign of Haroun Alraschid. Each day some warlike Atabek, at the head of his armed train, poured into the capital of the caliphs,61 or pitched his pavilion on the banks of the river; each day the proud emir of some remote principality astonished or affrighted the luxurious Babylonians by the strange or uncouth warriors that had gathered round his standard in the deserts of Arabia, or on the shores of the Euxine. For the space of twenty miles, the banks of the river were, on either side, far as the eye could reach, covered with the variegated pavilions, the glittering standards, the flowing streamers and twinkling pennons of the mighty host, of which Malek, the Grand Sultan of the Seljuks, and Governor of the Caliph’s palace, was chief commander. Such was the power assembled on the plains of Asia to arrest the progress of the Hebrew Prince, and to prevent the conquest of the memorable land promised to the faith of his fathers, and forfeited by their infidelity. Before the walls of Hamadan, Alroy reviewed the army of Israel, sixty thousand heavy-armed footmen, thirty thousand archers and light troops, and twenty thousand cavalry. Besides these, there had been formed a body of ten thousand picked horsemen, styled the ‘Sacred Guard,’ all of whom had served in the Persian campaign. In their centre, shrouded in a case of wrought gold, studded with carbuncles, and carried on a lusty lance of cedar, a giant—for the height of Elnebar exceeded that of common men by three feet—bore the sceptre of Solomon. The Sacred Guard was commanded by Asriel, the brother of Abner. The army was formed into three divisions. All marched in solemn order before the throne of Alroy, raised upon the ramparts, and drooped their standards and lances as they passed their heroic leader. Bostenay, and Miriam, and the whole population of the city witnessed the inspiring spectacle from the walls. That same eve, Scherirah, at the head of forty thousand men, pushed on towards Bagdad, by Kermanshah; and Jabaster, who commanded in his holy robes, and who had vowed not to lay aside his sword until the rebuilding of the temple, conducted his division over the victorious plain of Nehauend. They were to concentrate at the pass of Kerrund, which conducted into the province of Bagdad, and await the arrival of the king. At the dawn of day, the royal division and the Sacred Guard, the whole under the command of Asriel, quitted the capital. Alroy still lingered, and for some hours the warriors of his staff might have been observed lounging about the citadel, or practising their skill in throwing the jerreed as they exercised their impatient chargers before the gates. The king was with the Lady Miriam, walking in the garden of their uncle. One arm was wound round her delicate waist, and with the other he clasped her soft and graceful hand. The heavy tears burst from her downcast eyes, and stole along her pale and pensive cheek. They walked in silence, the brother and the sister, before the purity of whose surpassing love even ambition vanished. He opened the lattice gate. They entered into the valley small and green; before them was the marble fountain with its columns and cupola, and in the distance the charger of Alroy and his single attendant. They stopped, and Alroy gathered flowers, and placed them in the hair of Miriam. He would have softened the bitterness of parting with a smile. Gently he relaxed his embracing arm, almost insensibly he dropped her quivering hand. ‘Sister of my soul,’ he whispered, ‘when we last parted here, I was a fugitive, and now I quit you a conqueror.’ She turned, she threw herself upon his neck, and buried her face in his breast. ‘My Miriam, we shall meet at Bagdad.’ He beckoned to her distant maidens; they advanced, he delivered Miriam into their arms. He pressed her hand to his lips, and, rushing to his horse, mounted and disappeared. A body of irregular cavalry feebly defended the pass of Kerrund. It was carried, with slight loss, by the vanguard of Scherirah, and the fugitives prepared the host of the caliph for the approach of the Hebrew army. Upon the plain of the Tigris the enemy formed into battle array. The centre was commanded by Malek, the Grand Sultan of the Seljuks himself; the right wing, headed by the Sultan of Syria, was protected by the river; and the left, under the Sultan of Roum, was posted upon the advantageous position of some irregular and rising ground. Thus proud in the number, valour, discipline, and disposition of his forces, Malek awaited the conqueror of Persia. The glittering columns of the Hebrews might even now be perceived defiling from the mountains, and forming at the extremity of the plain. Before nightfall the camp of the invaders was pitched within hearing of that of Malek. The moving lights in the respective tents might plainly be distinguished; and ever and anon the flourish of hostile music fell with an ominous sound upon the ears of the opposed foe-men. A few miles only separated those mighty hosts. Upon to-morrow depended, perhaps, the fortunes of ages. How awful is the eve of battle! Alroy, attended by a few chieftains, personally visited the tents of the soldiery, promising them on the morrow a triumph, before which the victories of Nehauend and Nishapur would sink into insignificance. Their fiery and excited visages proved at once their courage and their faith. The sceptre of Solomon was paraded throughout the camp in solemn procession. On the summit of a huge tumulus, perhaps the sepulchre of some classic hero, Esther, the prophetess, surrounded by the chief zealots of the host, poured forth her exciting inspirations. It was a grand picture, that beautiful wild girl, the groups of stern, devoted warriors, the red flame of the watch-fires mixing with the silver shadows of the moon as they illumined the variegated turbans and gleaming armour of her votaries! In the pavilion of Alroy, Jabaster consulted with his pupil on the conduct of the morrow. ‘This is a different scene from the cavern of the Caucasus,’ said Alroy, as the high priest rose to retire. ‘It has one great resemblance, sire; the God of our fathers is with us.’ ‘Ay! the Lord of Hosts. Moses was a great man. There is no career except conquest.’ ‘You muse.’ ‘Of the past. The present is prepared. Too much thought will mar it.’ ‘The past is for wisdom, the present for action, but for joy the future. The feeling that the building of the temple is at hand, that the Lord’s anointed will once again live in the house of David, absorbs my spirit; and, when I muse over our coming glory, in my fond ecstasy I almost lose the gravity that doth beseem my sacred office.’ ‘Jerusalem; I have seen it. How many hours to dawn?’ ‘Some three.’ ‘‘Tis strange I could sleep. I remember, on the eve of battle I was ever anxious. How is this, Jabaster?’ ‘Your faith, sire, is profound.’ ‘Yes, I have no fear. My destiny is not complete. Good night, Jabaster. See, Asriel, valiant priest. Pharez!’ ‘My lord!’ ‘Rouse me at the second watch. Good night, boy.’ ‘Good night, my lord.’ ‘Pharez! Be sure you rouse me at the second watch. Think you it wants three hours to dawn?’ ‘About three hours, my lord.’ ‘Well! at the second watch, remember; good night.’ ‘It is the second watch, my lord.’ ‘So soon! Have I slept? I feel fresh as an eagle. Call Scherirah, boy.’ ‘‘Tis strange I never dream now. Before my flight my sleep was ever troubled. Say what they like, man is made for action. My life is now harmonious, and sleep has now become what nature willed it, a solace, not a contest. Before, it was a struggle of dark passions and bright dreams, in whose creative fancy and fair vision my soul sought refuge from the dreary bale of daily reality. ‘I will withdraw the curtains of my tent. O most majestic vision! And have I raised this host? Over the wide plain, far as my eye can range, their snowy tents studding the purple landscape, embattled legions gather round their flags to struggle for my fate. It is the agony of Asia. ‘A year ago, upon this very spot, I laid me down to die, an unknown thing, or known and recognised only to be despised, and now the sultans of the world come forth to meet me. I have no fear. My destiny is not complete. And whither tends it? Let that power decide which hitherto has fashioned all my course. ‘Jerusalem, Jerusalem! ever harping on Jerusalem. With all his lore, he is a narrow-minded zealot whose dreaming memory would fondly make a future like the past. O Bagdad, Bagdad, within thy glittering halls, there is a charm worth all his Cabala! ‘Hah! Scherirah! The dawn is near at hand, the stars are still shining. The air is very pleasant. Tomorrow will be a great day, Scherirah, for Israel and for you. You lead the attack. A moment in my tent, my brave Scherirah!’ The dawn broke; a strong column of the Hebrews, commanded by Scherirah, poured down upon the centre of the army of the caliph. Another column, commanded by Jabaster, attacked the left wing, headed by the Sultan of Roum. No sooner had Alroy perceived that the onset of Scherirah had succeeded in penetrating the centre of the Turks, than he placed himself at the head of the Sacred Guard, and by an irresistible charge completed their disorder and confusion. The division of the Sultan of Syria, and a great part of the centre, were entirely routed and driven into the river, and the remainder of the division of Malek was effectually separated from his left wing. But while to Alroy the victory seemed already decided, a far different fate awaited the division of Jabaster. The Sultan of Roum, posted in an extremely advantageous position, and commanding troops accustomed to the discipline of the Romans of Constantinople, received the onset of Jabaster without yielding, and not only repelled his attack, but finally made a charge which completely disordered and dispersed the column of the Hebrews. In vain Jabaster endeavoured to rally his troops, in vain he performed prodigies of valour, in vain he himself struck down the standard-bearer of the sultan, and once even penetrated to the pavilion of the monarch. His division was fairly routed. The eagerness of the Sultan of Roum to effect the annihilation of his antagonists prevented him from observing the forlorn condition of the Turkish centre. Had he, after routing the division of Jabaster, only attacked Alroy in the rear, the fortune of the day might have been widely different. As it was, the eagle eye of Alroy soon detected his inadvertence, and profited by his indiscretion. Leaving Ithamar to keep the centre in check, he charged the Sultan of Roum with the Sacred Guard, and afforded Jabaster an opportunity of rallying some part of his forces. The Sultan of Roum, perceiving that the day was lost by the ill-conduct of his colleagues, withdrew his troops, retreated in haste, but in good order to Bagdad, carried off the caliph, his harem, and some of his treasure, and effected his escape into Syria. In the meantime the discomfiture of the remaining Turkish army was complete. The Tigris was dyed with their blood, and the towns through which the river flowed were apprised of the triumph of Alroy by the floating corpses of his enemies. Thirty thousand Turks were slain in battle: among them the Sultans of Bagdad and Syria, and a vast number of atabeks, emirs, and chieftains. A whole division, finding themselves surrounded, surrendered on terms, and delivered up their arms. The camps and treasures of the three sultans were alike captured, and the troops that escaped so completely dispersed, that they did not attempt to rally, but, disbanded and desperate, prowled over and plundered the adjoining provinces. The loss of the division of Jabaster was also severe, but the rest of the army suffered little. Alroy himself was slightly wounded. The battle lasted barely three hours. Its results were immense. David Alroy was now master of the East. The plain was covered with the corpses of men and horses, arms and standards, and prostrate tents. Returning from the pursuit of the Sultan of Roum, Alroy ordered the trumpets to sound to arms, and, covered with gore and dust, dismounted from his charger, and stood before the pavilion of Malek, leaning on his bloody scimitar, and surrounded by his victorious generals. ‘Ah, Jabaster!’ said the conqueror, giving his hand to the pontiff, ‘‘twas well your troops had such a leader. No one but you could have rallied them. You must drill your lads a little before they again meet the Cappadocian cavalry. Brave Scherirah, we shall not forget our charge. Asriel, tell the guard, from me, that the victory of the Tigris was owing to their scimitars. Ithamar, what are our freshest troops?’ ‘The legion of Aderbijan, sire.’ ‘How strong can they muster?’ ‘It counts twelve thousand men: we might collect two-thirds.’ ‘Valiant Ithamar, take the Aderbijans and a division of the guards, push on towards Bagdad, and summon the city. If his Sultanship of Roum offer battle, take up a position, and he shall quickly have his desire. For the present, after these hasty marches and sharp fighting, the troops must rest. I think he will not tarry. Summon the city, and say that if any resistance be offered, I will make it as desolate as old Babylon. Treat with no armed force. Where is the soldier that saved me a cracked skull; his name Benaiah?’ ‘I wait your bidding, sire.’ ‘You’re a captain. Join the division of Ithamar, and win fresh laurels ere we meet again. Gentle Asriel, let your brother know our fortune.’ ‘Sire, several Tartars have already been despatched to Hamadan.’ ‘‘Tis well. Send another with these tablets to the Lady Miriam. Despatch the pavilion of Malek as a trophy for the town. Elnebar, Goliath of the Hebrews, you bore our sacred standard like a hero! How fares the prophetess? I saw her charging in our ranks, waving a sabre with her snowy arm, her long, dark hair streaming like a storm, from which her eyes flashed lightning.’ ‘The king bleeds,’ said Jabaster. ‘Slightly. It will do me service. I am somewhat feverish. A kingdom for a draught of water! And now for our wounded friends. Asriel, do you marshal the camp. It is the Sabbath eve.62 Time presses.’ The dead were plundered, and thrown into the river, the encampment of the Hebrews completed. Alroy, with his principal officers, visited the wounded, and praised the valiant. The bustle which always succeeds a victory was increased in the present instance by the anxiety of the army to observe with grateful strictness the impending Sabbath. When the sun set, the Sabbath was to commence. The undulating horizon rendered it difficult to ascertain the precise moment of the setting. The crimson orb sunk behind the purple mountains, the sky was flushed with a rich and rosy glow. Then might be perceived the zealots, proud in their Talmudical lore, holding a skein of white silk in their hands, and announcing the approach of the Sabbath by their observation of its shifting tints. While the skein was yet golden, the forge of the armourer still sounded, the fire of the cook still blazed, still the cavalry led their steeds to the river, and still the busy footmen braced up their tents and hammered at their palisades. The skein of silk became rosy, the armourer worked with renewed energy, the cook puffed with increased zeal, the horsemen scampered from the river, the footmen cast an anxious glance at the fading twilight. The skein of silk became blue; a dim, dull, sepulchral, leaden tinge fell over its purity. The hum of gnats arose, the bat flew in circling whirls over the tents, horns sounded from all quarters, the sun had set, the Sabbath had commenced. ‘The forge was mute, the fire extinguished, the prance of horses and the bustle of men in a moment ceased. A deep, a sudden, an all-pervading stillness dropped over that mighty host. It was night; the sacred lamp of the Sabbath sparkled in every tent of the camp, which vied in silence and in brilliancy with the mute and glowing heavens. Morn came; the warriors assembled around the altar and the sacrifice. The high priest and his attendant Levites proclaimed the unity and the omnipotence of the God of Israel, and the sympathetic responses of his conquering and chosen people reechoed over the plain. They retired again to their tents, to listen to the expounding of the law; even the distance of a Sabbath walk was not to exceed that space which lies between Jerusalem and the Mourft of Olives. This was the distance between the temple and the tabernacle; it had been nicely measured, and every Hebrew who ventured forth from the camp this day might be observed counting the steps of a Sabbath-day’s journey. At length the sun again set, and on a sudden fires blazed, voices sounded, men stirred, in the same enchanted and instantaneous manner that had characterised the stillness of the preceding eve. Shouts of laughter, bursts of music, announced the festivity of the coming night; supplies poured in from all the neighbouring villages, and soon the pious conquerors commemorated their late triumph in a round of banqueting. On the morrow, a Tatar arrived from Ithamar, informing Alroy that the Sultan of Roum had retreated into Syria, that Bagdad was undefended, but that he had acceded to the request of the inhabitants that a deputation should wait upon Alroy before the troops entered the city, and had granted a safe conduct for their passage. On the morrow, messengers announced the approach of the deputation. All the troops were under arms. Alroy directed that the suppliants should be conducted through the whole camp before they arrived at the royal pavilion, on each side of which the Sacred Guard was mustered in array. The curtains of his tent withdrawn displayed the conqueror himself, seated on a sumptuous divan. On his right hand stood Jabaster in his priestly robes, on his left Scherirah. Behind him, the giant Elnebar supported the sacred sceptre. A crowd of chieftains was ranged on each side of the pavilion. Cymbals sounded, muffled kettle-drums, and the faint flourish of trumpets; the commencement of the procession might be detected in the long perspective of the tented avenue. First came a company of beauteous youths, walking two by two, and strewing flowers; then a band of musicians in flowing robes of cloth of gold, plaintively sounding their silver trumpets. After these followed slaves of all climes, bearing a tribute of the most rare and costly productions of their countries: Negroes with tusks and teeth of the elephant, plumes of ostrich feathers, and caskets of gold dust; Syrians with rich armour; Persians with vases of atar-gul, and Indians with panniers of pearls of Ormuz, and soft shawls of Cachemire. Encircled by his children, each of whom held alternately a white or fawn-coloured gazelle, an Arab clothed in his blue bornouz, led by a thick cord of crimson silk a tall and tawny giraffe. Fifty stout men succeeded two by two, carrying in company a silver shield laden with gold coin, or chased goblets studded with gems. The clash of cymbals announced the presence of the robes of honour,63 culled from the wardrobe of the commander of the Faithful; the silk of Aleppo and the brocade of Damascus, lined with the furs of the sable and the ermine, down from the breast of the swan, and the skins of white foxes. After these followed two grey dromedaries, with furniture of silver, and many caparisoned horses, each led by a groom in rich attire. The last of these was a snow-white steed, upon whose front was the likeness of a ruby star, a courser of the sacred stud of Solomon, and crossed only by the descendants of the Prophet. The muffled kettle-drums heralded the company of black eunuchs, with their scarlet vests and ivory battle-axes. They surrounded and shrouded from the vulgar gaze fourteen beautiful Circassian girls, whose brilliant visages and perfect forms were otherwise concealed by their long veils and ample drapery. The gorgeous procession, as they approached the conqueror, bowed humbly to Alroy, and formed in order on each side of the broad avenue. The deputation appeared; twelve of the principal citizens of Bagdad, with folded arms, and downcast eyes, and disordered raiment. Meekly and mutely each touched the earth with his hand, and kissed it in token of submission, and then, moving aside, made way for the chief envoy and orator of the company, Honain! Humbly, but gracefully, the physician of the caliph bowed before the conqueror of the East. His appearance and demeanour afforded a contrast to the aspect of his brother envoys; not less calm or contented his countenance, not less sumptuous or studied his attire, than when he first rescued Alroy in the bazaar of Bagdad from the grip of the false Abdallah. He spoke, and every sound was hushed before the music of his voice. ‘Conqueror of the world, that destiny with which it is in vain to struggle has placed our lives and fortunes in your power. Your slaves offer for your approbation specimens of their riches; not as tribute, for all is yours; but to show you the products of security and peace, and to induce you to believe that mercy may be a policy as profitable to the conqueror as to the conquered; that it may be better to preserve than to destroy; and wiser to enjoy than to extirpate. ‘Fate ordained that we should be born the slaves of the caliph; that same fate has delivered his sceptre into your hands. We offer you the same devotion that we yielded to him, and we entreat the same protection which he granted to us. ‘Whatever may be your decision, we must bow to your decree with the humility that recognises superior force. Yet we are not without hope. We cannot forget that it is our good fortune not to be addressing a barbarous chieftain, unable to sympathise with the claims of civilisation, the creations of art, and the finer impulses of humanity. We acknowledge your irresistible power, but we dare to hope everything from a prince whose genius all acknowledge and admire, who has spared some portion of his youth from the cares of government and the pursuits of arms to the ennobling claims of learning, whose morality has been moulded by a pure and sublime faith, and who draws his lineage from a sacred and celebrated race, the unrivalled antiquity of which even the Prophet acknowledges.’ He ceased: a buzz of approbation sounded throughout the pavilion, which was hushed instantly as the lips of the conqueror moved. ‘Noble emir,’ replied Alroy, ‘return to Bagdad, and tell your fellow-subjects that the King of Israel grants protection to their persons, and security to their property.’ ‘And for their faith?’ enquired the envoy, in a lower voice. ‘Toleration,’ replied Alroy, turning to Jabaster. ‘Until further regulations,’ added the high priest. ‘Emir,’ said Alroy, ‘the person of the caliph will be respected.’ ‘May it please your highness,’ replied Honain, ‘the Sultan of Roum has retired with our late ruler.’ ‘And his harem?’ ‘And his harem.’ ‘It was needless. We war not with women.’ ‘Men, as well as women, must acknowledge the gracious mercy of your highness.’ ‘Benomi,’ said Alroy, addressing himself to a young officer of the guard, ‘command the guard of honour that will attend this noble emir on his return. We soldiers deal only in iron, sir, and cannot vie with the magnificence of Bagdad, yet wear this dagger for the donor’s sake:’ and Alroy held out to Honain a poniard flaming with gems. The Envoy of Bagdad advanced, took the dagger, pressed it to his lips, and placed it in his vest.64 ‘Scherirah,’ continued Alroy, ‘this noble emir is your charge. See that a choice pavilion of the host be for his use, and that his train complain not of the rough customs of our camp.’ ‘May it please your highness,’ replied Honain, ‘I have fulfilled my office, and, with your gracious permission, would at once return. I have business only less urgent than the present, because it concerns myself.’ ‘As you will, noble emir. Benomi, to your post. Farewell, sir.’ The deputation advanced, bowed, and retired. Alroy turned to Jabaster. ‘No common person that, Jabaster?’ ‘A very gracious Turk, sire.’ ‘Think you he is a Turk?’ ‘By his dress.’ ‘It may be so. Asriel, break up the camp. We’ll march at once to Bagdad.’ The chiefs dispersed to make the necessary arrangements for the march. The news that the army was immediately to advance to Bagdad soon circulated throughout the camp, and excited the most lively enthusiasm. Every hand was at work, striking the tents, preparing the arms and horses. Alroy retired to his pavilion. The curtains were drawn. He was alone, and plunged in profound meditation. ‘Alroy!’ a voice sounded. He started, and looked up. Before him stood Esther the prophetess. ‘Esther! is it thou?’ ‘Alroy! enter not into Babylon.’ ‘Indeed.’ ‘As I live, the Lord hath spoken it. Enter not into Babylon.’ ‘Not enjoy my fairest conquest, maiden?’ ‘Enter not into Babylon.’ ‘What affrights thee?’ ‘Enter not into Babylon.’ ‘I shall surely change the fortunes of my life without a cause.’ ‘The Lord hath spoken. Is not that a cause?’ ‘I am the Lord’s anointed. His warning has not reached me.’ ‘Now it reaches thee. Doth the king despise the prophetess of the Lord? It is the sin of Ahab.’ ‘Despise thee! Despise the mouth that is the herald of my victories! ‘Twere rank blasphemy. Prophesy triumph, Esther, and Alroy will never doubt thy inspiration.’ ‘He doubts it now. I see he doubts it now. O my king, I say again, enter not into Babylon.’ ‘Beauteous maiden, those eyes flash lightning. Who can behold their wild and liquid glance, and doubt that Esther is inspired! Be calm, sweet girl, some dream disturbs thy fancy.’ ‘Alroy, Alroy, enter not into Babylon!’ ‘I have no fear, I bear a charmed life.’ ‘Ah me! he will not listen.’ All is lost!’ ‘All is gained, my beautiful.’ ‘I would we were upon the Holy Mount, and gazing on the stars of sacred Zion.’ ‘Esther,’ said Alroy, advancing, and gently taking her hand, ‘the capital of the East will soon unfold its marvels to thy sight. Prepare thyself for wonders. Girl, we are no longer in the desert. Forget thy fitful fancies. Come, choose a husband from my generals, child, and I will give a kingdom for thy dower. I would gladly see a crown upon that imperial brow. It well deserves one.’ The prophetess turned her dark eyes full upon Alroy. What passed in her mind was neither evident nor expressed. She gazed intently upon the calm and inscrutable countenance of the conqueror, then flung away his hand, and rushed out of the pavilion.","sourceLink":"http://novel.tingroom.com/duanpian/2862/79083.html","bookId":1189,"book":{"id":1189,"title":"Alroy The Prince Of The Captivity","description":"简介： Being at Jerusalem in the year 1831, and visiting the traditionary tombs of the Kings of Israel, my thoughts recurred to a personage whose marvellous career had, even in boyhood, attracted my attention, as one fraught with the richest materials of po...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2862","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
