{"id":37843,"no":33,"title":"VII THE PRESIDENT APPEALS TO THE SENATE TO PASS THE SUFFRAGE AMENDMENT","content":"The very next day occurred a remarkable example of direct action: that direct action coming within twenty-four hours. Senator Jones, who the day before had refused to bring up Suffrage in this session, arose in the Senate and announced that on September 26, he would move to take up the Suffrage Amendment, and keep it before the Senate until a vote was reached. \\n\\n \\n\\n With this promise of definite action, the Woman’s Party immediately ceased their demonstrations. \\n\\n \\n\\n On September 26, Senator Jones brought the Amendment up. Maud Younger says, in her Revelations of a Woman Lobbyist: \\n\\n \\n\\n Discussion began. Discussion went on. For five whole days it lasted, with waves of hope and waves of dismay, and always an undercurrent of uncertainty. Thursday, Friday, Saturday, the speeches went on. On Monday word went forth that the President would address the Senate on behalf of our Amendment. \\n\\n \\n\\n I hurried to Senator Curtis, who was in his office signing letters. He said: “The other side claim that they have their men pledged: that the President comes too late. What do you expect?” \\n\\n \\n\\n “I don’t know what I should expect. I hope.” \\n\\n \\n\\n I went over to the Senate. There was very great excitement; a sense of something wonderful impending. On the floor there was the ceremonious atmosphere that attends the President’s coming. \\n\\n \\n\\n “Look,” said a newspaper man in the gallery beside me, “he’s brought all his heavy artillery with him.” There on the floor of the Senate were the members of the Cabinet. Lesser dignitaries were scattered about the room. Congressmen stood, two-deep, 367lining the walls. The Sergeant-at-Arms announced in clear tones: “The President of the United States.” \\n\\n \\n\\n The President came in, shook hands with the presiding officer, turned and read his speech. There is always an evenness about his public utterances, in manner, in voice, in reading; yet I thought he read this message with more feeling than his War message, or his Fourteen Points. \\n\\n \\n\\n The President said: \\n\\n \\n\\n Gentlemen of the Senate: The unusual circumstances of a world war in which we stand and are judged in the view not only of our own people and our own consciences but also in the view of all nations and peoples will, I hope, justify in your thought, as it does in mine, the message I have come to bring you. \\n\\n \\n\\n I regard the concurrence of the Senate in the constitutional Amendment proposing the extension of the Suffrage to women as vitally essential to the successful prosecution of the great war of humanity in which we are engaged. I have come to urge upon you the considerations which have led me to that conclusion. It is not only my privilege, it is also my duty to apprise you of every circumstance and element involved in this momentous struggle which seems to me to affect its very processes and its outcome. It is my duty to win the war and to ask you to remove every obstacle that stands in the way of winning it. \\n\\n \\n\\n I had assumed that the Senate would concur in the Amendment because no disputable principle is involved but only a question of the method by which the Suffrage is to be extended to women. There is and can be no Party issue involved in it. Both of our great national Parties are pledged, explicitly pledged, to equality of Suffrage for the women of the country. \\n\\n \\n\\n Neither Party, therefore, it seems to me, can justify hesitation as to the method of obtaining it, can rightfully hesitate to substitute Federal initiative for State initiative, if the early adoption of this measure is necessary to the successful prosecution of the war and if the method of State action proposed in Party platforms of 1916 is impracticable within any reasonable length of time, if practicable at all. \\n\\n \\n\\n And its adoption is, in my judgment, clearly necessary to the successful prosecution of the war and the successful realization of the object for which the war is being fought. \\n\\n \\n\\n That judgment I take the liberty of urging upon you with solemn earnestness for reasons which I shall state very frankly and which I shall hope will seem as conclusive to you as they seem to me. \\n\\n \\n\\n This is a peoples’ war and the peoples’ thinking constitutes 368its atmosphere and morale, not the predilections of the drawing-room or the political considerations of the caucus. \\n\\n \\n\\n If we be indeed Democrats and wish to lead the world to democracy, we can ask other peoples to accept in proof of our sincerity and our ability to lead them whither they wish to be led nothing less persuasive and convincing than our actions. Our professions will not suffice. Verification must be forthcoming when verification is asked for. And in this case verification is asked for—asked for in this particular matter. You ask by whom? \\n\\n \\n\\n Not through diplomatic channels; not by foreign ministers. Not by the intimations of parliaments. It is asked for by the anxious, expectant, suffering peoples with whom we are dealing and who are willing to put their destinies in some measure in our hands, if they are sure that we wish the same things they do. \\n\\n \\n\\n I do not speak by conjecture. It is not alone the voices of statesmen and of newspapers that reach me, and the voices of foolish and intemperate agitators do not reach me at all. Through many, many channels I have been made aware what the plain, struggling, workaday folk are thinking upon whom the chief terror and suffering of this tragic war falls. \\n\\n \\n\\n They are looking to the great, powerful, famous Democracy of the West to lead them to the new day for which they have so long waited; and they think in their logical simplicity, that democracy means that women shall play their part in affairs alongside men and upon an equal footing with them. If we reject measures like this, in ignorance or defiance of what a new age has brought forth, of what they have seen but we have not, they will cease to believe in us; they will cease to follow or to trust us. \\n\\n \\n\\n They have seen their own governments accept this interpretation of democracy—seen old governments accept this interpretation of democracy—seen old governments like that of Great Britain, which did not profess to be democratic, promise readily and as of course this justice to women, though they had before refused it, the strange revelations of this war having made many things new and plain, to governments as well as to people. \\n\\n \\n\\n Are we alone to refuse to learn the lesson? Are we alone to ask and take the utmost that our women can give—service and sacrifice of every kind—and still say we do not see what title that gives them to stand by our sides in the guidance of the affairs of their nation and ours? \\n\\n \\n\\n We have made partners of the women in this war; shall we admit them only to a partnership of suffering and sacrifice and 369toil and not a partnership of privilege and right? This war could not have been fought either by the other nations engaged or by America, if it had not been for the services of the women—services rendered in every sphere—not merely in the fields of effort in which we have been accustomed to see them work, but wherever men have worked, and upon the very skirts and edges of the battle itself. \\n\\n \\n\\n We shall not only be distrusted but shall deserve to be distrusted if we do not enfranchise them with the fullest possible enfranchisement, as it is now certain that the other great free nations will enfranchise them. \\n\\n \\n\\n We cannot isolate our thought and action in such a matter from the thought of the rest of the world. We must either conform or deliberately reject what they propose and resign the leadership of liberal minds to others. \\n\\n \\n\\n The women of America are too noble and too intelligent and too devoted to be slackers whether you give or withhold this thing that is mere justice; but I know the magic it will work in their thoughts and spirits if you give it to them. \\n\\n \\n\\n I propose it as I would propose to admit soldiers to the Suffrage, the men fighting in the field for our liberties and the liberties of the world, were they excluded. The task of the woman lies at the very heart of the war, and I know how much stronger that heart will beat if you do this just thing and show our women that you trust them as much as you in fact and of necessity depend upon them. \\n\\n \\n\\n Have I said that the passage of this Amendment is a vitally necessary war measure, and do you need further proof? Do you stand in need of the trust of other peoples and of the trust of our own women? Is that trust an asset or is it not? \\n\\n \\n\\n I tell you plainly, as the commander-in-chief of our armies and of the gallant men in our fleets, as the present spokesman of this people in our dealings with the men and women throughout the world who are now our partners, as the responsible head of a great government which stands and is questioned day by day as to its purposes, its principles, its hopes, whether they be serviceable to men everywhere or only to itself, and who must himself answer these questions or be shamed, as the guide and director of forces caught in the grip of war and by the same token in need of every material and spiritual resource this great nation possesses—I tell you plainly that this measure which I urge upon you is vital to the winning of the war and to the energies alike of preparation and of battle. \\n\\n \\n\\n And not to the winning of the war only. It is vital to the 370right solution of the great problems which we must settle, and settle immediately, when the war is over. We shall need then in our vision of affairs, as we have never needed them before, the sympathy and insight and clear moral instinct of the women of the world. The problems of that time will strike to the roots of many things that we have not hitherto questioned, and I for one believe that our safety in those questioning days, as well as our comprehension of matters that touch society to the quick, will depend upon the direct and authoritative participation of women in our counsels. We shall need their moral sense to preserve what is right and fine and worthy in our system of life as well as to discover just what it is that ought to be purified and re-formed. Without their counselings we shall only be half wise. \\n\\n \\n\\n That is my case. That is my appeal. Many may deny its validity, if they choose, but no one can brush aside or answer the arguments upon which it is based. The executive tasks of this war rest upon me. I ask that you lighten them and place in my hands instruments, spiritual instruments, which I do not now possess, which I sorely need, and which I have daily to apologize for not being able to employ. \\n\\n \\n\\n In this speech, the President had said: “The voices of foolish and intemperate agitators do not reach me at all.” \\n\\n \\n\\n It was generally felt that the President, there, indicated the Woman’s Party. Commenting on that phrase the next day, the Republican Senators remarked, “Why it was that which brought him there!” \\n\\n \\n\\n During the course of the debate between Poindexter and Pitman, Poindexter asked, “Wasn’t it the pickets that got the President?” \\n\\n \\n\\n The next afternoon when the vote was called for, and the last Senator had answered to his name, the presiding officer announced the result: \\n\\n \\n\\n “The joint resolution does not pass.” \\n\\n \\n\\n The Suffrage Amendment still lacked two votes. \\n\\n \\n\\n Miss Younger says in her Revelations of a Lobbyist: \\n\\n \\n\\n Stunned, as though unable to grasp it, hundreds of women sat there. Then slowly the defeat reached their consciousness, and they began slowly to put on their hats, to gather up their wraps, and to file out of the galleries, some with a dull sense of injustice, some with burning resentment. In the corridors they began 371to form in groups. Every one wanted to discuss it. But Alice Paul took my arm. \\n\\n \\n\\n “Come,” she said, “we must find out about the short-term candidates and go into the election campaign at once.” \\n\\n \\n\\n Immediately after the vote was taken and defeated, Senator Jones of New Mexico changed his vote and moved that the measure be reconsidered; thereby placing it again on the Senate Calendar, ready to be called up any time and voted on. \\n\\n \\n\\n By going to the Senate in this manner, the President had made his own record clean to the country at large. But he had not made it clean to the National Woman’s Party, because, although he had done something, he had not done enough. He appeared to be doing more than he was, but there was a great deal more that he could have done. He did not, for instance, start his appeal to the Senate early enough. That appeal came only a fortnight before the vote was taken. Possibly he had underestimated the opposition; probably he had overestimated the strength of his own influence. But the country at large of course did not understand that. For the time being, therefore, the Woman’s Party concentrated their drive on another point in the enemy line. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2008/57305.html","bookId":639,"book":{"id":639,"title":"The Story of The Woman\u0027s Party","description":"简介： Agitation for an amendment to the National Constitution had virtually ceased. Before the death of Susan B. Anthony in 1906, Suffragists had turned their attention to the States. Suffrage agitation there was persistent, vigorous, and untiring; in Wash...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2008","creation":"Aug 1, 2019 12:19:04 AM","modification":"Aug 1, 2019 12:19:04 AM"}}
