{"id":37851,"no":41,"title":"XV THE PRESIDENT OBTAINS THE LAST VOTE AND CONGRESS SURRENDERS","content":"The Suffrage situation was a little confused. Senator Baird, opposed to Suffrage, of the old Congress, was succeeded by Edge, favorable to it. Pollock, favorable, was succeeded by Dial, opposed. Vardaman of Mississippi, favorable, was succeeded by Harrison. Drew of New Hampshire, opposed, was succeeded by Keyes. Hardwick of Georgia, opposed, was succeeded by Harris. These three last new Senators—Harrison (Democrat), Harris (Democrat), and Keyes (Republican)—maintained a steady silence as to how they would vote. It was necessary to get one of them. \\n\\n \\n\\n Senator Harris was a close supporter of President Wilson. Alice Paul knew that Matthew Hale, former Chairman of the Progressive National Committee, a Suffragist but not a Democrat, was influential with the Administration. She therefore suggested to Anita Pollitzer that she see Mr. Hale at once and lay the situation before him. This was early in May and Congress was convening May 19. Mr. Hale was enthusiastic in his desire to help. The situation was complicated by the fact that the President was in Europe. Mr. Hale and Miss Pollitzer went over the Senate poll and from among the most favorable non-committal senators chose Harris of Georgia. He too was in Europe. Suddenly the field of the campaign crossed three thousand miles of Atlantic Ocean to France. The Woman’s Party concentrated their forces on getting President Wilson to influence Harris into declaring for Suffrage. Mr. Hale worked steadily with a group of people close to the President who rapidly increased in numbers. Ultimately this pressure bore fruit in a conference between Robert Woolley, Democratic Publicity Manager 416in the 1916 campaign, Homer S. Cummings, Chairman of the National Democratic Committee, William J. Cochran, Director of Publicity of the Democratic Committee, Joseph Tumulty, the President’s Secretary, Senator Walsh. The result of this conference was that Tumulty sent a cable to the President, suggesting that he confer with Senator Harris. Senator Harris was in Italy, but at the President’s request he went to France. Immediately came the news on the cable that Senator Harris would support the Suffrage Amendment. \\n\\n \\n\\n Having secured Harris’ vote, President Wilson cabled a message to the new Congress on the night of May 20 which contained the following reference to the Susan B. Anthony Amendment: \\n\\n \\n\\n Will you permit me, turning from these matters, to speak once more and very earnestly of the proposed Amendment to the Constitution which would extend the Suffrage to women and which passed the House of Representatives at the last session of the Congress? It seems to me that every consideration of justice and of public advantage calls for the immediate adoption of that Amendment and its submission forthwith to the legislatures of the several States. \\n\\n \\n\\n Throughout all the world this long-delayed extension of the Suffrage is looked for; in the United States, longer, I believe, than anywhere else, the necessity for it, and the immense advantages of it to the national life, has been urged and debated by women and men who saw the need for it and urged the policy of it when it required steadfast courage to be so much beforehand with the common conviction; and I, for one, covet for our country the distinction of being among the first to act in a great reform. \\n\\n \\n\\n As soon as Suffrage was assured by this sixty-fourth vote, Senator Keyes and Senator Hale in a convulsive effort to leap on the fast disappearing band-wagon announced that they would vote for the Amendment, thus giving the Suffragists two extra votes. \\n\\n \\n\\n As this was a new Congress it was necessary for the House to pass the Suffrage Amendment again. On May 21, 1919, therefore, the new House passed it by three hundred and 417four votes to eighty-nine—forty-two more than the required two-thirds. It will be remembered that, when the previous House passed it on January 10, 1918, the vote was two hundred and seventy-four to one hundred and thirty-six—only one vote more than the required two-thirds. \\n\\n \\n\\n The Amendment then went to the Senate. \\n\\n \\n\\n In her Revelations of a Woman Lobbyist, Maud Younger says: \\n\\n \\n\\n Four months later, on June fourth, for the fifth time in a little more than a year, we sat in the Senate gallery to hear a vote on the Suffrage Amendment. The new Congress, coming in on March fourth, had brought us two more votes—we now had our eleven. There was no excitement. The coming of the women, the waiting of the women, the expectancy of the women, was an old story. A whole year had passed in the winning of two votes. Every one knew what the end would be now. It was all very dull. \\n\\n \\n\\n We walked slowly homeward, talking a little, silent a great deal. This was the day toward which women had been struggling for more than half a century! We were in the dawn of woman’s political power in America. Several days before the Senate passed the Amendment, Alice Paul left Washington to arrange for an immediate ratification by the legislatures in session. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2008/57313.html","bookId":639,"book":{"id":639,"title":"The Story of The Woman\u0027s Party","description":"简介： Agitation for an amendment to the National Constitution had virtually ceased. Before the death of Susan B. Anthony in 1906, Suffragists had turned their attention to the States. Suffrage agitation there was persistent, vigorous, and untiring; in Wash...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2008","creation":"Aug 1, 2019 12:19:04 AM","modification":"Aug 1, 2019 12:19:04 AM"}}
