{"id":90211,"no":21,"title":"Page 21","content":"Best neighbor ever.\n As soon as I shut the door I point a finger to Ghost. “Explain.”\n Ghost leans back on the sofa and shrugs, “Nik wanted you protected so we came to see how secure your apartment is.” He points to himself. “And here we are. Inside your apartment. So, it’s safe to say it’s not so secure.” He looks at Max and says, “I didn’t want Max to come but he insisted.” He looks at me and smirks “And you beat him up.”\n I feel panic swell in my gut.\n Oh, Nik is going to kill me. I beat up his brother. Who is now slightly loopy on my sofa.\n I fall into a dining chair with my shoulders slumped.\n Today has not been a good day.\n I cover my face with my hands. Ghost starts to talk again, “Listen, I’ve taken note of everything you need for your place to be secured. I’ll get all the stuff tomorrow and install it during the day. When you get home tomorrow night, I’ll be waiting for you to show you how to use it.” He squeezes my knee, I remove my hands from my face and open my eyes. He says softly, “You don’t want to fuck with Omarr. He’s unpredictable. We’re just taking precautions. If today went as planned, you won’t ever hear from him again. But we’re not taking the risk. He’s taken a liking to you, Tina.”\n Nat reaches over to take my hand and says rasps, “That sucks, babe.”\n I lower my head and nod. I say dejectedly, “Okay. When you find out how much the security stuff costs just sent an invoice over to the store and I’ll pay for it.”\n His eyes narrow and he tilts his head. He looks at me for a few seconds then shakes his head softly and orders, “Okay, so get your shit. We’re leaving.”\n Excuse me?\n “Excuse me?” I reply.\n He glares and repeats slowly, “Get. Your. Shit. You aren’t staying here tonight.”\n I don’t know what to do about this. I don’t want to stay anywhere else. This is my apartment!\n So I say the first stupid thing that comes to my mind. “But I have a cat!”\n Ghost looks to Bear who is sitting on Max’s lap staring stupidly at him. Max is staring stupidly right back at Bear.\n He asks patiently, “Do you have a cage for your beast?”\n I nod.\n He nods right back as if to say I don’t see what the problem is.\n Nat squeezes my hand and I look up at her. She gifts me a sympathetic smile. I’ll go. For her.\n I sigh and say quietly, “Okay, let me pack some things.”\n Nat stands to walk with me and puts an arm around my waist. It’s not a big gesture but the significance is great. She’ll be my crutch when I need help standing. I always have her care and support.\n We each pack a bag, I pop Bear in his cage, and then we’re off.\n I just assumed Ghost would take us to a hotel.\n I definitely was not expecting to find myself at Nik’s for a sleepover.\n As soon as we enter the house, a smiling Ceecee comes over to see us and I panic.\n OH SHIT! I BEAT UP HER DAD!\n She takes one look at daddy-o and her face crumples. Max quickly walks over to her, kneels, and asks “Would you believe me if I told you Tina did this to me?”\n WHAT THE FRICK, MAX?!?\n I’m absolutely devastated that he would throw me under the bus like that. My heart pounds and my neck heats with nervousness. I love Ceecee. Now she’ll hate me.\n I’m shocked when Ceecee narrows her eyes at her father and puts her hands on her hips and asks warily, “What did you do to Tina?”\n Max chuckles and shakes his head as he says “Daddy was very silly. I went into Tina’s house without asking and she thought I was a bad person trying to take things.”\n I’m even more shocked when a now frowning Ceecee comes over to me and hugs me one handed around the waist. She looks up at me and says, “You must’ve been really scared, Tina.” She scowls at her father and sternly commands, “Don’t ever do that again daddy, she must’ve been really scared!”\n Bless her!\n Max looks properly chastened and says, “Believe me, sweetie. Never again. I might lose a leg next time.”\n I look down at her concerned face and smile, “I was really scared, angel. And I’m really sorry I hit your dad. I thought I was protecting myself. If I knew it was your dad, I would’ve never hit him.”\n She smiles up at me before looking past me and squealing, “IS THAT A KITTY?!”\n I chuckle at her enthusiasm. I make introductions. “Ceecee meet Bear. He loves hugs so you better cuddle him well, okay?”\n Ghost opens the cage and Nat takes Bear out and puts him on the ground. Bear strolls right up to Ceecee’s chair, looks up at her and meows.\n I realize he hasn’t had his dinner yet so I open my bag to pull out a few cans of wet food, hand them to Ceecee and say, “You think you can feed him, honey?”\n She looks up at me with a face full of awe; you’d think I just told her we were taking a trip to Never Land.\n She whispers, “Really?”\n I act as casual as possible. I toss my arms up in a forget-about-it motion and say, “Oh yeah, he’ll love you forever if you feed him.”\n Just as I finish saying this Bear hops onto Ceecee’s lap, purrs loudly and rubs his cheeks on the cans of food in her hand. She looks up at me and smiles so beautifully. You can’t buy happiness like that. Bear is going to be well loved tonight.\n Ceecee rolls her way over to the kitchen and Ghost motions for Nat and I to follow him.\n Ghost opens the first door on the left hand side of the hallway. He escorts me in and I look around. It’s a beautiful guest bedroom. The walls are a rich burgundy color, it has a black feature wall behind the huge sleigh king bed on the right hand side of the room. There is a built in wardrobe on the left side. Long burgundy curtains cover the whole opposite side of the wall. There are framed tasteful prints around the walls and a door in the top left hand corner. Ghost points to it. “Shower.”\n I nod. Great, I really need a shower. Badly.\n They leave me and I shut the door. I’m so tired I could fall asleep standing up. I force myself to snap out of it, taking my underwear and pajamas from my bag and head to the shower.\n It’s a neat bathroom. Everything is in its place and there is decent soap and shampoo in the shower. It’s all manly fragranced, though.\n I turn on the shower to hot. I want it to scorch my skin. I like my showers blistering hot. It makes me feel clean. I undress, hop in, and wash my body and hair in record time. I only sang ‘Working 9 to 5’ once. That’s how I know.\n I wrap my hair in a towel and put my clothes on. I love my pajamas. They’re a tank and short shorts combo, silky satin and the color of copper.\n I take my hair down, brush it and dry it with a hairdryer I found in the one of the drawers. And I’m finally ready to sleep.\n I walk out of the bathroom over to the bed and face plant.\n I come home from the club pretty late tonight.\n I walk into my bedroom and see Tina face down spread eagle on my bed. I’d recognize that ass anywhere. Her shorts are so short I can see the swell of her butt cheeks.\n I actually turned around and looked at the doorway to my room.\n Am I in the right house?\n I go back out as quietly as I can and find Ghost. He tells me Tina’s apartment isn’t secure so he brought Nat and Tina here.\n He tells me Nat is sleeping in Max’s room and he’ll share with Max because he’s concussed and needs to be woken every hour tonight.\n What the hell?\n I ask what happened and Ghost tells me that Nat and Tina went all Rambo on him. Tina beat the shit out of Max with a mop. I actually burst into laughter.\n Ghost tells me Tina’s cat is somewhere in the house, most likely in bed with Ceecee. And that he put Tina in my room because I wasn’t home at the time.\n I call bullshit.\n I think my friend is playing matchmaker.\n I bid him goodnight, go back to my room and take in Tina’s sleeping form.\n My fantasies are coming to life right before me. If only she would lift her head and invite me over. This is slightly awkward. I usually sleep naked. I probably shouldn’t tonight though.\n Perhaps she won’t mind.\n Nope. Not a good idea.\n I go into the bathroom and shower quickly. I walk back into my room naked and think about what I can wear to bed. I don’t wear underwear a lot of the time but I do have some boxers somewhere.\n After searching the drawers for a few minutes I find some plain black silky boxers.\n They’ll do.\n I walk over to the bed, pick Tina up, pull back the covers and settle us both in. She doesn’t even stir.\n Poor baby. So tired.\n I pull her body back into mine so her back is firmly joined with my chest. I put my arms around her waist, push my knees into the back of hers and inhale the scent of her hair. She smells like me.\n I like that.\n I like that Tina is in my bed with me and we haven’t had sex. It’s more than that with her. I want to be her protector and the one who she comes to with her problems.\n She feels so good against me. So soft and lush. I could get used to this.\n Contentment washes over me.\n I smile into her hair, inhale once more, and fall into a peaceful sleep.\n Chapter Fifteen\n Best dream ever\n I wake with a start. It’s still pitch black.\n Where the frick am I?\n This is not my room. My room is smaller. My bed is slightly smaller. And there is usually no man snoring next to my ear in my bed.\n Well, it’s not quite a snore. It’s more of a snuffle.\n The man has his arms wrapped tightly around my waist and my bottom is pressed back against his crotch.\n My body turns stock still.\n Who the hell is that?\n It’s definitely not Ghost. He doesn’t seem like the cuddling type. Besides, he’s sexing up Nat. Max’s frame is somewhat leaner than this man’s muscular build. By process of elimination, I figure its Nik.\n I smile to myself.\n It’s like my fantasies are coming to life!\n I snuggle back in to him and hear him moan lightly. My eyes widen and I still for a moment. I do it again and his arms tighten further around my waist. I feel a growing hardness in between my ass cheeks.\n Oh My Lord!\n Nik is asleep and has an erection!\n An erection that is sitting between my butt cheeks and that is oh so close to my lady bits!\n And it feels delicious.\n When he softly rubs his hard length against me, I fight the urge to not come on the spot.\n Moisture seeps from my core and I become fidgety.\n I want this. I want Nik to rip my panties off and take me.\n Take me, Nik!\n One of his hands brush under my breast, I still again and my mouth forms an O.\n Touch my boob, you boob!\n He does one better. The hand under my breast moves up a little and he runs his thumb over the hard sensitive peak. His other hand moves down my ribs and belly, between my legs and his large hand cups my damp mound.\n My eyes roll back in my head and I sigh. I hear snuffles in my ear and realize Nik is still asleep.\n Regardless, he grinds the palm of his hand right on my sweet spot. I bite my lip to stop a moan. My heart rate accelerates and I sweat.\n I need this so badly!\n Nik shifts in his sleep and I use every bit of will left in my body to still. He sighs and mutters sleepily, “Best dream ever.”\n I agree, Nik!\n His muscular arm tightens across my stomach and his palm continues to rub me while he pushes his cock up and down my behind. The friction is wicked.\n I’m flushed and the tingles start low in my spine. My mouth opens slightly and I breathe heavily.\n This cannot be happening!\n My first orgasm in five years and it’s with a sleeping man!\n White dots spot my vision and my head lolls forward. The contractions of my orgasm start and it’s so intense I think I’m going to pass out. This is pure bliss.\n If this is what he can do asleep just imagine how good he’ll be awake!\n Oh, dear god, what have I done?!\n I’ll tell you what…I just humped a sleeping person!\n I haven’t noticed Nik stiffen and but I have noticed his arms tighten around me. I feel wetness on my naked lower back.\n Did he…? He came!\n Phew, now you’re even!\n Oh, god!\n I feel ill. I literally feel like I could be sick. My stomach knots. I’m embarrassed and ashamed.\n Nik relaxes against my back and his hands move from my most private areas back around my waist.\n His mouth is at my ear and he whispers dreamily, “Tina.”\n Oh wow!\n He wasn’t just having a dirty dream. He was having a dirty dream about me! I want to jump with joy. I smile as big as I can without splitting my face, then yawn.\n Wow. Five years’ worth of orgasm really takes it out of a person.\n I relax in Nik’s perfect arms, snuggle back closer to him and fall asleep.\n Oh god. Best dream ever.\n Kind of weird that the star of my fantasy is sleeping right next to me, though. I wonder what Tina would think if she knew what I was doing to her in my dream? It felt so real.\n I love Tina’s ass. Soft, round but still firm.\n It’s no shocker than I dreamt of her. I usually do. And I was pressed up against her all night.\n Normally she’s doing dirtier things to me though. This dream was mild.\n But hot damn, it was like I was actually touching her. I can still feel her curves.\n Thinking of my fantasy girl, where is she?\n I open my eyes and look around. I can see sunshine behind the curtain and my bed is empty.\n She must have slipped out trying not to wake me.\n I sit up and rub my face. Then I smile. I liked Tina in bed with me.\n I never spend the night with girls. My bedroom is my sanctuary. My place to relax and unwind.\n I never wanted to bring a girl into my bed. Until now.\n If I thought she’d agree to it, I’d ask Tina to move in with me and share my bed permanently.\n Who knew sleep could be so enjoyable?\n I flip the sheet off and make my way to the bathroom to shower. I undress and I swear there’s come on my boxers. \n","sourceLink":"https://allnovel.net/friend-zoned-friend-zoned-1/page-21.html","bookId":2798,"book":{"id":2798,"title":"Friend-Zoned (Friend-Zoned #1)","description":"Storyline: \n Friend-Zoned (Friend-Zoned #1) \n Nikolai Leokov never thought he\u0027d fall in love with the only girl he\u0027s ever befriended. \n Valentina Tomic has issues with commitment after the ultimate betrayal. \n When Tina decides to make broody Nik\u0027s day better, she never thought she would end up friends with the hard man. \n Nik has never had a woman be so affectionate to him without expecting something in return. \n Nik and Tina cordially invite you to read Friend-zoned. \n A story of friendship, humour and love.\n \n","cover":"https://allnovel.net/images/friend-zoned-friend-zoned-1.jpg","author":"Belle Aurora","type":"Humorous","source":"allnovel","link":"https://allnovel.net/friend-zoned-friend-zoned-1.html","creation":"Oct 5, 2019 8:59:24 AM","modification":"Oct 5, 2019 5:40:15 PM"}}
