{"id":90199,"no":9,"title":"Page 9","content":"The girls and I are lining up, waiting to get into The White Rabbit.\n The line is long. And I mean long! It’s almost two blocks down the street. I don’t think we’ll get in any time before 1am.\n Well, that’s what you get for trying to be ‘fashionably late’.\n Shut up, brain.\n I have my back turned to the street, rubbing my arms for warmth.\n “Well, well, well. What do we have here?” I turn and Max is smiling at us. He asks, “What do you chicas think you’re doing with all the regular folk? You’re VIPs!” He offers his elbows to Nat and I, we take them and the girls follow as he walks us to the front of the line.\n Some of the waiting club-goers groan and a smiling Natalie struts passed them like a peacock and boasts, “Yeah, that’s coz we’re VIP, bitches!”\n As we approach the front of the line, we’re greeted by a huge African American man. He’s bald and looks badass. Max fist bumps him and presents us to him, “B-Rock, these ladies are personal guests of Nik’s.” I hand him my VIP pass and he smirks at me, “You hold onto this, mami. You’ll need it at the bar.”\n Awesome!\n B-Rock (cool nickname) unhooks the red velvet rope and we follow Max just inside the hall. We reach another set of double doors and Max clears his throat and smirks at us, “Ladies, welcome to The White Rabbit.”\n He pushes open the double doors and I almost pee.\n My ears are assaulted by loud R-n-B music which fades into loud Pop music.\n My mouth hangs open as I follow Max into the first floor of the club.\n This place is unbelievable!\n I always thought The White Rabbit was a strange name for a club until now. It all makes sense.\n Max takes my hand, I take Nat’s hand, she takes Mimi’s, and Mimi takes Lola’s hand. We form a mini snake. He leads us into the main club area. There are booths all around the edges of the huge room, there isn’t a spare seat in sight. You have to walk down four or five steps to get to the dance floor, which is packed full. The outer rim of the room is higher than the dance floor. The dance floor is retro tiled in black and white.\n Max leads us to the bar and I’m actually dumbstruck by how awesome this place is.\n There are waitresses walking back and forth from booths to the bar and they are all wearing costumes. They wear a short light blue and white pinafore dress with puffy sleeves, thigh high white lace stockings with garters, and four inch white maryjane heels. They also wear long blonde wigs with a light blue bow tied atop their head, false eyelashes, pale makeup, and bright red lips.\n Get it??! The White Rabbit is an Alice in Wonderland themed club!!! So freaking awesome!\n I love this place!\n “I love this place!” I yell this to Max who bursts out laughing.\n Max offers, “Sweetheart, you haven’t even seen the VIP area yet!”\n I’m in awe.\n There’s more?!\n I’m suddenly giddy. I take another look around. All the walls are painted deep purple; this has been done whimsically and the artist has mixed white through the purple in a swirly pattern. There is a huge bronze Cheshire cat statue by the bar, people are gathering around it and taking photos with it. Some fantastic Alice in Wonderland prints and paintings hang around the wall. There are even original cartoon cells.\n Oh Em Freakin’ Gee!\n Max leads us to a staircase and we climb up. As soon as we reach the top, an Asian Alice smiles at us and says, “Good evening ladies, do you have a VIP booth reserved?”\n My hearts sinks. I sputter, “Uhh…”\n Max interrupts me, “Yeah. It’s under Safira. These are Nik’s guests.”\n Asian Alice’s eyes widen slightly. She utters, “Of course, please come through.”\n We follow her to one of the bigger booths, it can seat at least ten people and I’m confused as to why she would give us this one when there are only four of us.\n The girls, Max, and I take a seat. We order Cherry Bombs and I look around while we wait.\n Max was right, the VIP area is even better than downstairs. The booths are black soft leather with bronze buttons down the sides. Every booth has their own waitress and the music is not as loud up here so you can talk to each other without yelling. More cells, prints, and paintings line the walls.\n Nik arrives at our booth and speaks, “Ladies, I’m so glad you could make it.”\n He’s smiling at us (dimple and all…yum!) and I know he’s genuinely happy that we came. He looks delicious in grey slacks, Italian dress shoes, and a light grey sweater which he’s pushed the sleeves up to the elbows.\n I shriek, “This place is awesome!” Nik laughs as takes a seat beside me.\n He begins, “I can’t believe you’ve never been here.” He feigns being upset. “I was a little hurt actually.”\n I laugh at his antics and respond, “Well, you lured us here and I can tell you I’ve only been here twenty minutes and I already want to come back!”\n He leans in close to my ear and says, “I’m glad you like it.” He leans away, winks, and adds, “Now to make sure you have a good time.”\n Swoon.\n Fuck. Me.\n I knew these girls were good looking but, damn, they clean up nice.\n They all look stunning but I’m actually a little disappointed that Tina is wearing a lot of makeup. She’s normally adorable but tonight she looks sexy. When I leaned in closer to her I caught her smell. Goddamn it, she smells like cake! Like vanilla, cinnamon, and sugar mixed together.\n The dress she’s wearing shows off her body; it hugs every sweet curve. She looks hot.\n I’m feeling a little protective of her. I don’t want any of the guys here to make a move on her. I want her to relax tonight.\n Yeah, keep tellin’ yourself that.\n Hush, brain.\n Someone behind me clears their throat. Ghost is standing there with Trick. I gave the boys the night off because I want the girls to enjoy themselves tonight and when we we’re celebrating at lunch the other day everyone seemed to get along really well.\n Trick takes a seat next to Lola but Ghost remains scowling at Natalie who is staring right back at him.\n Oh damn, it’s a stare off.\n I’m just about to tell Ghost to sit the hell down when Nat straightens her back, leans her head forward slightly, and scowls theatrically hard at him.\n I can’t believe my ears when I hear him chuckle behind me. Ghost isn’t what many would call a people person. But he has his reasons.\n He rolls his eyes at her and plonks himself into the seat next to her.\n Everyone has a drink and starts conversations with each other and I find myself listening to answers Tina gives to the questions asked of her.\n I find out she’s lived in New York two years, formerly a California girl. She’s twenty eight. Nat shares Tina’s apartment with her. She has a cat named Bear. Her dad lives in Cali but her Mom’s passed away. That’s too bad. She and Nat have been friends for as long as they can remember and they’re both of Croatian descent. She also advises that she’s a lightweight and to not let her drink more than three drinks.\n Two hours pass and we’re all still deep in conversation with each other. Tina is on her third drink and I won’t let her drink anymore tonight. Ghost is not much for conversation but he seems to be listening to whatever Nat is talking to Mimi about. Everything is going well and I’m glad we’re all getting to know each other better because these girls are the shit. And I can’t stop looking at Tina.\n She’s beautiful and she looks so relaxed, laughing so hard she almost chokes on her drink. I rub up and down her back and her skin’s bare. Her skin is so soft.\n Jeezus.\n I like these girls. A lot. They are real deal kind of girls. Nice girls who like to have good conversation. No drama kind of girls.\n My kind of girls.\n And then…\n “You fucking asshole!”\n “You fucking asshole!” The entire booth turns to face the shrill voice.\n Oh, dear god!\n There at the end of the booth stands She-Devil.\n Miss I-Wanna-Return-My-Three-Hundred-Dollar-Ruined-Dress.\n Nik’s face turns hard as he snarls, “Sissy, what the fuck are you doin’ here? I told you, it’s done.”\n Her scowling face turns to mine. She asks, “So, you fuckin’ her now?”\n Nik’s reply makes my stomach knot, “None of your damn business.”\n Damn it, why didn’t he say No!\n She-Devil Sissykins smirks at Nik and leans forward a little and states tartly, “I am going to make your life a living hell.”\n Oh, Hell no. That shit doesn’t fly.\n I stand up and out of the booth, I’m immediately flanked by my girls and we stand tall.\n Nat speaks first, “Oh, hell no, Hoochy Spice. You do not come into this man’s club,” she points her thumb back at Nik, “and start shit while he’s hosting a private party. You got shit to say to him, you wait for an appropriate time or make an appointment to see him. What you don’t do is bring your two dollar made-in-china silver hair extensions to our booth and make a fuss like a five year old.”\n Mimi speaks next, “And there is no way you’ll do anything to make his life a living hell, either. I know you think he’s your man or some shit but have some dignity and move on graciously, bitch.”\n Lola turns it up a bit, “And if we find out you’ve done anything to make any of these guy’s lives harder than it should be,” she whispers loudly, “we’ll come after you.”\n I hide the fact I’m flushed, itchy as hell, and finish it up, “I know you’ve got no problem starting something here where you can talk big but I promise you,” I take a step closer to her, “you do not want to take us on. Because back there,” I point my thumb back at Nik, “you’ve got a man who won’t lay a finger on you. But right here, you’ve got four angry women just itching to rip those ratty hair extensions out of that pretty head of yours.”\n She-Devil’s face is flushed and contorted with anger. She tries hard to stare us down. She opens her mouth to rip me a new asshole when a hand closes over her upper arm.\n B-Rock the Bouncer has her gripped tight.\n Nik stands and holds out his hand. He barks, “Your VIP pass, Sissy.”\n She stares him down but hands him the pass.\n He puts the pass in his pocket, sits down, and cautions, “You’re no longer welcome here. I see you in here again, I’ll have you arrested. B, please escort Sissy out.” B-Rock pulls her along and Nik doesn’t even look at her which I’m sure cuts her deep.\n We all take our places in the booth. The guys are shocked and open mouthed.\n Nat teases, “Close your mouths boys, you’re catching flies.” Then she rolls her eyes at them. Mimi and Lola chuckle.\n Ghost smirks and shakes his head, a smiling Trick sips his drink, and Max laughs and slaps his thigh.\n I feel an arm around my shoulders. I turn to see Nik looking down at me with a soft face. He says, “You didn’t need to do that, you know?”\n I lower my eyes and smile, “What are friends for?”\n He looks at me a moment before lowering his mouth to my temple. He kisses me so softly; I close my eyes and lean into him. He smells so nice and masculine like sandalwood.\n I exclaim, “Oh!” I straighten up and hand him my VIP pass and explain, “Just in case I forget later.”\n Nik looks around the table as the girl’s fish out their passes to give him. He clears his throat and mentions, “I realize I didn’t give you any information when I gave these to you so I’ll explain a few things now. When you arrive, you walk straight through the door. This booth is yours. And the passes,” he opens my hand, puts the pass in, and closes my hand over it, “are unlimited. You girls are permanent VIPs here and welcome any time.”\n I gasp and put my fingers over my lips, “No. Way.”\n He nudges my shoulder with his and smirks, “Way.”\n I look around the table and the girls are suspended in shock. The VIP passes are a hundred dollars each. And we have them permanently with unlimited use!\n We all squeal. I hug Nik while bouncing up and down. Nat, Lola, and Mimi all reach over and hug him over the table.\n The guys are covering their ears and laughing. Well, Ghost is scowling. Other VIPs are watching us and the waitresses clap and laugh.\n When we finally let go of Nik, he’s flushed and embarrassed. He looks so cute!\n I can’t help but laugh at him. “Bet you’re regretting those permanent passes now, huh?”\n Looking around the booth, he clears his throat, turns his face back to me and reassures, “Nope. Not even a bit.”\n I smile like a loon.\n I love these guys!\n Chapter Seven\n Lunch for three\n It’s Monday afternoon. I check the wall clock: 2:27pm.\n I know I should be getting some work done but I keep thinking about Tina.\n God, she’s beautiful.\n The girls left The White Rabbit around 2am. As soon as they left, all us guys were gabbing about them all for another hour before we all went about our work.\n After the girls became my own personal soldiers in the Sissy showdown, the atmosphere at the booth changed. I could tell the guys were impressed with their display of protection and loyalty towards me. I was shocked when Ghost started joining in the conversations and, gasp, even laughed a few times. We were all much more comfortable with each other. We spent the rest of the night joking and teasing each other.\n The girls had earned all of our respect and although they really didn’t need to do what they did, I was grateful for it. They stopped an even larger scene from occurring.\n Just send her a message.\n Yeah, I think I’ll do that.\n I haven’t seen Tina since Saturday and I’m already itching to see her again.\n I sit at the computer and open up the instant messenger.\n Nik123: Hey teeny Tina, how are you today?\n A few minutes pass before I get a reply. \n","sourceLink":"https://allnovel.net/friend-zoned-friend-zoned-1/page-9.html","bookId":2798,"book":{"id":2798,"title":"Friend-Zoned (Friend-Zoned #1)","description":"Storyline: \n Friend-Zoned (Friend-Zoned #1) \n Nikolai Leokov never thought he\u0027d fall in love with the only girl he\u0027s ever befriended. \n Valentina Tomic has issues with commitment after the ultimate betrayal. \n When Tina decides to make broody Nik\u0027s day better, she never thought she would end up friends with the hard man. \n Nik has never had a woman be so affectionate to him without expecting something in return. \n Nik and Tina cordially invite you to read Friend-zoned. \n A story of friendship, humour and love.\n \n","cover":"https://allnovel.net/images/friend-zoned-friend-zoned-1.jpg","author":"Belle Aurora","type":"Humorous","source":"allnovel","link":"https://allnovel.net/friend-zoned-friend-zoned-1.html","creation":"Oct 5, 2019 8:59:24 AM","modification":"Oct 5, 2019 5:40:15 PM"}}
