{"id":8095,"no":14,"title":"Chapter 14","content":"Vexation with Tyeglev and with myself succeeded the amazement with which I was overcome at first. “Your master is mad!” I blurted out to Semyon, “raving mad! He galloped off to Petersburg, then came back and is running about all over the place! I did get hold of him and brought him right up to the gate — and here he has given me the slip again! To go out of doors on a night like this! He has chosen a nice time for a walk!” “And why did I let go of his hand?” I reproached myself. Semyon looked at me in silence, as though intending to say something — but after the fashion of servants in those days he simply shifted from one foot to the other and said nothing. “What time did he set off for town?” I asked sternly. “At six o’clock in the morning.” “And how was he — did he seem anxious, depressed?” Semyon looked down. “Our master is a deep one,” he began. “Who can make him out? He told me to get out his new uniform when he was going out to town — and then he curled himself.” “Curled himself?” “Curled his hair. I got the curling tongs ready for him.” That, I confess, I had not expected. “Do you know a young lady,” I asked Semyon, “a friend of Ilya Stepanitch’s. Her name is Masha.” “To be sure I know Marya Anempodistovna! A nice young lady.” “Is your master in love with this Marya . . . et cetera?” Semyon heaved a sigh. “That young lady is Ilya Stepanitch’s undoing. For he is desperately in love with her — and can’t bring himself to marry her — and sorry to give her up, too. It’s all his honour’s faintheartedness. He is very fond of her.” “What is she like then, pretty?” I inquired. Semyon assumed a grave air. “She is the sort that the gentry like.” “And you?” “She is not the right sort for us at all.” “How so?” “Very thin in the body.” “If she died,” I began, “do you think Ilya Stepanitch would not survive her?” Semyon heaved a sigh again. “I can’t venture to say that — there’s no knowing with gentlemen . . . but our master is a deep one.” I took up from the table the big, rather thick letter that Tyeglev had given me and turned it over in my hands. . . . The address to “his honour the Commanding Officer of the Battery, Colonel So and So” (the name, patronymic, and surname) was clearly and distinctly written. The word urgent, twice underlined, was written in the top left-hand corner of the envelope. “Listen, Semyon,” I began. “I feel uneasy about your master. I fancy he has some mischief in his mind. We must find him.” “Yes, sir,” answered Semyon. “It is true there is such a fog that one cannot see a couple of yards ahead; but all the same we must do our best. We will each take a lantern and light a candle in each window — in case of need.” “Yes, sir,” repeated Semyon. He lighted the lanterns and the candles and we set off.","sourceLink":"http://novel.tingroom.com/duanpian/972/29361.html","bookId":267,"book":{"id":267,"title":"Knock, knock, knock","description":"简介： Referred to by Henry James as \u0027the first novelist of his time\u0027 Ivan Turgenev\u0027s works focus on class, love and suffering. Knock, Knock, Knock and Other Stories with its themes of the supernatural was, therefore, something of a departure for a writer w...","cover":"https://cunovel.com/defaultCover.png","type":"Science Fiction","link":"http://novel.tingroom.com/duanpian/972","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
