{"id":8083,"no":2,"title":"Chapter 2","content":"Lieutenant Tyeglev belonged precisely to the class of those “fatal” individuals, though he did not possess the exterior commonly associated with them; he was not, for instance, in the least like Lermontov’s “fatalist.” He was a man of medium height, fairly solid and round-shouldered, with fair, almost white eyebrows and eyelashes; he had a round, fresh, rosy-cheeked face, a turn-up nose, a low forehead with the hair growing thick over the temples, and full, well-shaped, always immobile lips: he never laughed, never even smiled. Only when he was tired and out of heart he showed his square teeth, white as sugar. The same artificial immobility was imprinted on all his features: had it not been for that, they would have had a good-natured expression. His small green eyes with yellow lashes were the only thing not quite ordinary in his face: his right eye was very slightly higher than his left and the left eyelid drooped a little, which made his eyes look different, strange and drowsy. Tyeglev’s countenance, which was not, however, without a certain attractiveness, almost always wore an expression of discontent mingled with perplexity, as though he were chasing within himself a gloomy thought which he was never able to catch. At the same time he did not give one the impression of being stuck up: he might rather have been taken for an aggrieved than a haughty man. He spoke very little, hesitatingly, in a husky voice, with unnecessary repetitions. Unlike most “fatalists,” he did not use particularly elaborate expressions in speaking and only had recourse to them in writing; his handwriting was quite like a child’s. His superiors regarded him as an officer of no great merit — not particularly capable and not over-zealous. The brigadier-general, a man of German extraction, used to say of him: “He has punctuality but not precision.” With the soldiers, too, Tyeglev had the character of being neither one thing nor the other. He lived modestly, in accordance with his means. He had been left an orphan at nine years old: his father and mother were drowned when they were being ferried across the Oka in the spring floods. He had been educated at a private school, where he had the reputation of being one of the slowest and quietest of the boys, and at his own earnest desire and through the good offices of a cousin who was a man of influence, he obtained a commission in the horse-guards artillery; and, though with some difficulty, passed his examination first as an ensign and then as a second lieutenant. His relations with other officers were somewhat strained. He was not liked, was rarely visited — and he hardly went to see anyone. He felt the presence of strangers a constraint; he instantly became awkward and unnatural . . . he had no instinct for comradeship and was not on really intimate terms with anyone. But he was respected, and respected not for his character nor for his intelligence and education — but because the stamp which distinguishes “fatal” people was discerned in him. No one of his fellow officers expected that Tyeglev would make a career or distinguish himself in any way; but that Tyeglev might do something extraordinary or that Tyeglev might become a Napoleon was not considered impossible. For that is a matter of a man’s “star”— and he was regarded as a “man of destiny,” just as there are “men of sighs” and “of tears.”","sourceLink":"http://novel.tingroom.com/duanpian/972/29349.html","bookId":267,"book":{"id":267,"title":"Knock, knock, knock","description":"简介： Referred to by Henry James as \u0027the first novelist of his time\u0027 Ivan Turgenev\u0027s works focus on class, love and suffering. Knock, Knock, Knock and Other Stories with its themes of the supernatural was, therefore, something of a departure for a writer w...","cover":"https://cunovel.com/defaultCover.png","type":"Science Fiction","link":"http://novel.tingroom.com/duanpian/972","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
