{"id":8084,"no":3,"title":"Chapter 3","content":"Two incidents that marked the first steps in his career did a great deal to strengthen his “fatal” reputation. On the very first day after receiving his commission — about the middle of March — he was walking with other newly promoted officers in full dress uniform along the embankment. The spring had come early that year, the Neva was melting; the bigger blocks of ice had gone but the whole river was choked up with a dense mass of thawing icicles. The young men were talking and laughing . . . suddenly one of them stopped: he saw a little dog some twenty paces from the bank on the slowly moving surface of the river. Perched on a projecting piece of ice it was whining and trembling all over. “It will be drowned,” said the officer through his teeth. The dog was slowly being carried past one of the sloping gangways that led down to the river. All at once Tyeglev without saying a word ran down this gangway and over the thin ice, sinking in and leaping out again, reached the dog, seized it by the scruff of the neck and getting safely back to the bank, put it down on the pavement. The danger to which Tyeglev had exposed himself was so great, his action was so unexpected, that his companions were dumbfoundered — and only spoke all at once, when he had called a cab to drive home: his uniform was wet all over. In response to their exclamations, Tyeglev replied coolly that there was no escaping one’s destiny — and told the cabman to drive on. \\n\\n \\n\\n “You might at least take the dog with you as a souvenir,” cried one of the officers. But Tyeglev merely waved his hand, and his comrades looked at each other in silent amazement. \\n\\n \\n\\n The second incident occurred a few days later, at a card party at the battery commander’s. Tyeglev sat in the corner and took no part in the play. “Oh, if only I had a grandmother to tell me beforehand what cards will win, as in Pushkin’s Queen of Spades,” cried a lieutenant whose losses had nearly reached three thousand. Tyeglev approached the table in silence, took up a pack, cut it, and saying “the six of diamonds,” turned the pack up: the six of diamonds was the bottom card. “The ace of clubs!” he said and cut again: the bottom card turned out to be the ace of clubs. “The king of diamonds!” he said for the third time in an angry whisper through his clenched teeth — and he was right the third time, too . . . and he suddenly turned crimson. He probably had not expected it himself. “A capital trick! Do it again,” observed the commanding officer of the battery. “I don’t go in for tricks,” Tyeglev answered drily and walked into the other room. How it happened that he guessed the card right, I can’t pretend to explain: but I saw it with my own eyes. Many of the players present tried to do the same — and not one of them succeeded: one or two did guess one card but never two in succession. And Tyeglev had guessed three! This incident strengthened still further his reputation as a mysterious, fatal character. It has often occurred to me since that if he had not succeeded in the trick with the cards, there is no knowing what turn it would have taken and how he would have looked at himself; but this unexpected success clinched the matter. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/972/29350.html","bookId":267,"book":{"id":267,"title":"Knock, knock, knock","description":"简介： Referred to by Henry James as \u0027the first novelist of his time\u0027 Ivan Turgenev\u0027s works focus on class, love and suffering. Knock, Knock, Knock and Other Stories with its themes of the supernatural was, therefore, something of a departure for a writer w...","cover":"https://cunovel.com/defaultCover.png","type":"Science Fiction","link":"http://novel.tingroom.com/duanpian/972","creation":"Aug 1, 2019 12:18:29 AM","modification":"Aug 1, 2019 12:18:29 AM"}}
