{"id":99239,"no":27,"title":"Page 27","content":"In the distance I hear sounds of combat, cries of pain and rage. Overhead the bombardment has stopped at last, making me think we may have a chance. If Vel’s intel is correct, and we time our run to a McCullough retreat, we might get off this rock.\\n\\n I settle outside the tactical tent and wait. Passing clansmenno longer glare at me, at least. Someone taps me on the shoulder. I glance up and find someone who looks more like a raider queen than a Lachion native.\\n\\n She’s incredibly tall, dusky-skinned, and she wears her hair in a short pouf. Her bare arms reveal whipcord strength. Slim metal rods pierce her nose, lower lip, and left brow. She glimmers with silver at throat, fingers, and wrists, highlighting her exotic allure. In the diffuse light, her eyes gleam tawny gold, like a predatory cat.\\n\\n “Can I help you?” I don’t recognize her, but that doesn’t mean much. I haven’t met everyone down here.\\n\\n She folds herself into the lotus position beside me. “Whispers say you’re making a break. I want to hitch a ride.”\\n\\n I recognize her accent, match it to a small world in the Outskirts. If I recall correctly, a bunch of artists and poets settled the place. I wonder if she can fight.\\n\\n “May not be a smooth run. We could die out there.”\\n\\n “We could die down here. I know which I prefer.”\\n\\n The woman has a point. I offer my hand. “I’m Jax.”\\n\\n A faint smile creases her mouth. “I know who you are.”\\n\\n But she takes my hand, firm grip. Calluses. Okay, so maybe not a useless arty type after all. “And you?”\\n\\n “My name is Suraya, but my friends call me Hit.”\\n\\n I have a feeling I’m going to regret asking. “Why’s that?”\\n\\n Her smile widens. “Because I only ever need one to take someone down.”\\n\\n Oh, that type.\\n\\n “What’re you doing on Lachion?”\\n\\n She shrugs. “Bad idea, this supply run. My whole crew died in the attack. I can pilot, so I won’t be deadweight.” Hit shows me the shunt in her wrist as if I might doubt her word.\\n\\n Well, it’s never a bad idea to have a backup pilot on board. “I’ll need to talk it over with the others. I’m going to assume they don’t object, so meet us at the south exit in three and a half hours.”\\n\\n Her eyes gleam. “Done. I won’t forget this, Ambassador.”\\n\\n I’m still not used to being addressed like that. “Don’t thank me yet. We have klicks of enemy territory to cover, and then we still have to find a way off this rock.”\\n\\n “You’re the kind of person who makes things happen,” she says.\\n\\n Am I?\\n\\n Just now I feel like I’m the world champion at waiting. Hit climbs to her feet and sets off, presumably to collect her gear. I sit and brood.\\n\\n An hour later, March comes out of the tent, no surprises there. His expression doesn’t warm when he notices me. In fact, he looks mildly annoyed, but that might be projection more than accurate interpretation on my part.\\n\\n “Jax.” He bends to greet me with a light kiss on the mouth. “You caught me just before I take another team out.”\\n\\n “Forget that, let someone else do it. Say your good-byes and pack your stuff. We’re getting the hell out of here. Meet us at the south exit in two and a half hours.” I clamber to my feet and jerk my head toward the tunnel for emphasis.\\n\\n His eyes go very dark and still. March studies me for a moment in silence, and then the saddest smile curves his lips. He takes my hands in his and seals a kiss into each palm. I can’t feel him at all; he hasn’t touched my mind in days, and the physical contact seems sharper in contrast.\\n\\n “Good luck,” he says quietly.\\n\\n Two words. How can two words make me feel like this?\\n\\n For a moment, I can’t breathe for the bands tightening around my chest. My eyes sting. I tug my hands away from him and curl them into fists. Against my best efforts to wear a poker face, I feel the tears slipping down my cheeks.\\n\\n “You don’t mean—” I try to say, but my voice comes out strange and strangled.\\n\\n People passing by give us odd looks, and March tries to take my arm, draw me to a quieter place to talk. Fuck that. I jerk away and glare at him through blurry eyes, jaw clenched.\\n\\n Say it here, damn you. Right now.\\n\\n He offers an almost imperceptible nod. “I’m staying. I owe it to Mair’s memory, and the clan, after all they’ve done for me. They took me in, after I walked away from the merc life. And Mair asked me to look after Keri, when she was just ten years old. You don’t need me, Jax. Keri does. This is my war—I have the training, the experience, and I’ll make the difference between their survival and annihilation here. I have to see this through. But you don’t need my help getting to Ithiss-Tor; another pilot can get you there.”\\n\\n So he’s cutting me loose. I raise my chin and wipe my face with the backs of my hands. In my heart, I know I’ve already lost him.\\n\\n He’s going to die down here, and it’s killing me. I feel a scream building in my lungs, raw and angry. I don’t want him to become a martyr. I want him beside me.\\n\\n No surprise when he reads me. I’m an open book where he’s concerned. His expression softens, and March pulls me into his arms. At first I resist on principle because the bastard is leaving me—\\n\\n “No,” he whispers. “I’m not. You’ll see me again, I swear. This isn’t forever.”\\n\\n Tears course down my cheeks. I squeeze them shut, but it doesn’t help. They don’t stop falling.\\n\\n Because I don’t believe him. I know a good-bye when I feel one.\\n\\n His mouth finds mine, blind and hungry. March hasn’t kissed me in days, but suddenly it’s like the only thing he knows how to do. Lips clinging, he tastes salty and bittersweet from my weeping. Again and again, until we gasp for air and lean our foreheads together.\\n\\n Grief roars inside me. His breath stirs against my damp cheeks, and I try to memorize everything about this moment. How he feels against me, his scent, and the weight of his arms curled around my back.\\n\\n I never thought he’d leave me. Whatever he thinks, I do need him. Just not in the way he wants. I can’t be someone other than I am; I can’t love him except the way I know how.\\n\\n “I know,” he whispers, setting his cheek against my downy hair. “It’s enough. It is. But I have to pay my debts. If I take everything Mair gave me and walk away from her kin when they’re in need, then I’ve forsaken what little honor she taught me. Can’t you understand that? I can’t be that guy again.”\\n\\n “Yeah, I get it. But it’s killing you,” I choke out. “A centimeter at a time. So even if by some miracle you survive, you won’t be March, not this March. You’ll be—” I break off, tipping my head back to search his gaze with mine.\\n\\n But I don’t have the words for the darkness I sense coming for him. What good is honor when compassion is lost? And he knows. I see it in the gravity of his expression.\\n\\n But he pretends he doesn’t, another stone in the wall between us. “I’ll come back to you,” he promises again.\\n\\n “Sure.” I manage a smile. Soon the pain will crystallize into a diamond in my chest, allowing me to function. “Have you thought about paint?” When he looks puzzled, I add, “To combat the Teras? As things stand, it’s all but impossible to fight them without heat-sensitive equipment that you don’t have on world. But you could jury-rig a weapon that sprays them, making them easier to target.”\\n\\n The clans left the Teras alone because the danger meant nobody else wanted to settle here. And then the McCulloughs figured out how to harness them, catching the others flat-footed. Maybe March can benefit from this idea.\\n\\n Mary, I feel raw.\\n\\n “I’ll mention it in strat meetings,” he says. “It might make the difference when we start trying to retake surface holdings. Please, Jax, don’t look like that.”\\n\\n Like what? Like my heart is breaking?\\n\\n He delves into his pocket and produces a ring that shines, cheap and tawdry even in this light. The red stones shimmer like glass. Without ceremony he shoves it onto my middle finger, where it hangs loose.\\n\\n “Svet collected trinkets like this. I bought it for her on Gehenna,” he says softly. “Last gift I ever got her, and I didn’t have a chance to give it to her. It’s never left my possession since I heard—” March rubs a thumb over my cheek. “Anyway. I want you to have it . . . for now. I’ll repo it someday, Jax. Get you something nicer. That’s a promise.”\\n\\n I close my fingers to keep the ring from sliding off. “I’ll hold you to that.”\\n\\n He kisses me one last time, and I pretend I believe him, at least until he disappears from sight.\\n\\n Deep down I’m sure I’ll never see him again, and it feels like my heart is dying.\\n\\n CHAPTER 33\\n\\n l’ve said my farewells.\\n\\n Doc said to check back with him regarding an implant, but I won’t do that in person. I’ll continue my injections and bounce a message to him when they’ve restored communications. When things have settled down, I’ll see what he can do for me. But that will take time.\\n\\n We’re done here. I’m the first to arrive at the south exit. I doubt anyone else is as eager to get some distance from this place. Each moment I stand here constitutes a bitter reminder that March chose to stay.\\n\\n Here with Keri.\\n\\n It stings like hell that he put it that way: You don’t need me. Keri does. Though I don’t want to be jealous, the feeling burns in my veins like an acid cocktail. She’s young; she doesn’t have all the fucked-up dysfunctions I’ve collected over the years.\\n\\n But I can’t dwell on petty, baseless jealousy. I have a job to do. As I straighten my shoulders, Jael turns up, with Dina reclining on an air sled like a queen. I smile at that.\\n\\n “What happened to the harness?”\\n\\n He shrugs. “Doc said he could spare this. It wasn’t even working when I started messing with it. And she isn’t bleeding, so it should be safer all around.”\\n\\n “What, like I’m not even here?” Dina mock-glares at me and then reinforces the scowl by whirring over and giving me a whack.\\n\\n “I’m glad you’re mobile,” I say. “I was worried about you.”\\n\\n She snorts. “Save the mushy stuff for when we get off this Mary-forsaken rock. Is March almost ready?”\\n\\n Vel arrives, saving me the trouble of answering. I wonder how they’re going to react to the news. A lance of fresh pain stabs through me, but I tamp it down. He made his choice.\\n\\n “I have confirmed the retreat,” he says in lieu of a greeting. “We will not have a cleaner shot at this for months most likely.”\\n\\n “We’ll probably still see some fighting,” Jael adds. “But I think Vel and I are a match for whatever we find down here.”\\n\\n The bounty hunter nods. “I predict we’ll find the enemy wounded and disorganized, separated from the rest of the clan.”\\n\\n “I can do my part,” Dina adds. “I’m not helpless.”\\n\\n “Never said you were, darling.” Jael ruffles her hair. “I expect you to cover us. You’re getting the only disruptor, after all.” \\n\\n","sourceLink":"https://allnovel.net/wanderlust-sirantha-jax-2/page-27.html","bookId":1647,"book":{"id":1647,"title":"Wanderlust (Sirantha Jax #2)","description":"Storyline: Wanderlust (Sirantha Jax #2) \\n Sirantha Jax doesn’t take chances… she jumps at them… \\n Sirantha Jax is a “Jumper,” a woman who possesses the unique genetic makeup needed to navigate faster than light ships through grimspace. Jax has worked for the Farwan Corporation her entire career. But now the word’s out that the Corp deliberately crashed a passenger ship, and their stranglehold on intergalactic commerce has crumbled—which means that Jax is out of a job. \\n She’s also broke, due to being declared dead a little prematurely. So when the government asks her to head up a vital diplomatic mission, Jax takes it. Her mandate: journey to the planet Ithiss-Tor and convince them to join the Conglomerate. \\n But Jax’s payday is light years away. First, she’ll have to contend with Syndicate criminals, a stormy relationship with her pilot, man-eating aliens, and her own grimspace-weakened body. She’ll be lucky just to make it to Ithiss-Tor alive…\\n","cover":"https://allnovel.net/images/wanderlust-sirantha-jax-2.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wanderlust-sirantha-jax-2.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:39:29 PM"}}
