{"id":83606,"no":18,"title":"Page 18","content":"\\n\\n I push myself up and then shift backwards until I’m sitting on him with my knees spread apart. He grips my hips and begins to guide me up and down. This is a new position for me. Shit, I’ve never felt so full.\\n\\n He returns his fingers to my pleasureland as he fills me from behind. It’s absurd how good he makes me feel.\\n\\n When he sees he no longer has to guide my movement, he uses his free hand to palm one of my breasts. It’s too many sensations to withstand at once. I’m on the ledge, about to fall. Or jump. I’m not sure which, and then I hear his possessive words through gritted teeth and it sends me over the edge. “No one else touches you. Only me. Do you understand?”\\n\\n The quaking starts in my core and I don’t answer him because I can’t find my voice. I’m too entangled in the flood of ecstasy to speak. I ride him harder as the waves of pleasure begin because I’ll die if I don’t. He squeezes my nipple hard and the sensation radiates down between my legs to finish me off. “Tell me you understand.”\\n\\n My hands grip the top of his thighs and I squeeze hard. My answer comes out as a scream. “Yes! I understand!”\\n\\n I fall forward onto my stomach with exhaustion and he collapses with me on top of my back. His weight pushes me into the mattress and he’s breathing heavily against my ear. “I won’t share you with anyone.”\\n\\n His words remind me of my initial thoughts about him. Lachlan Henry’s world is a dark place I know nothing about. I think it frightens me, but it’s too late now. I’m a part of it, no matter what it is.\\n\\n 16\\n\\n Jack McLachlan\\n\\n I feel it in the way she’s trembling and it has nothing to do with her orgasm. I’ve been too aggressive with her. Now I need to show her I can be gentle.\\n\\n I lift myself from Paige’s body and kneel between her legs from behind. I kiss the dip in her lower back and taste the salty moisture created during our sexual frenzy. It’s another way I love to taste this sweet girl.\\n\\n I glide my hands from her waist to her shoulders and begin massaging her tense muscles. It takes a few minutes, but I feel her eventually relax under my touch and I contemplate how to justify my possessive outburst.\\n\\n I could say that I don’t know where my irrational demand came from, but that would be a lie. There should’ve been no room for anything in my head other than how good it felt to be inside her, but something else slipped into my thoughts. Someone else—Ben Donavon. I can’t believe I let that little bastard get into my head. He wants what’s mine and I’m forced to deliver her to him tomorrow. She might as well be served on a silver platter.\\n\\n For two days, I’ll be in Sydney and she’ll be with him in his apartment. They might find themselves alone. That’s when shit happens.\\n\\n I might have gone about it poorly, but I want to be clear with Paige; she is mine while she’s in Australia. I won’t share her with Ben Donavon or any other dick.\\n\\n I lean forward to kiss her shoulder and then skim my nose across the nape of her neck. She smells so good—all fruit, sweat, and pheromones. Lots of pheromones. If I keep sniffing her, I could get sidetracked from what I need to do.\\n\\n I place the side of my face against the center of her back and leave it there while I try to regain some of the footing I may have lost over my less-than-gentle treatment. “I’m sorry if I was too aggressive.”\\n\\n “You were pretty intense.” She peers at me over her shoulder. “But I never said I was opposed to intense.” I feel her words rumble against my ear pressed to her body. “However, I’m a little confused about what you said.”\\n\\n I roll off her and lie on my side. She does the same and props her head in her hand. She pokes her lips out at me as she mocks me in a husky tone. “You look so serious.”\\n\\n I am. Dead serious. “We may only be together for a few months, but you’re mine while you’re here. I won’t share you with Ben Donavon or any other man.”\\n\\n I see the confusion on her face. “What brought this on?”\\n\\n Oh, hell. I’m going to sound like such a chick. “You live with him.”\\n\\n She’s giving me that duh, really? look that my little sister gives me. Women must be born with that special talent. “And you knew that when we met. You didn’t just figure that out.”\\n\\n “I know, but I have to take you back to him tomorrow.”\\n\\n The realization clicks in her head and she understands. “You’re not relinquishing custody of me to Ben. You’re taking me to the place where I stay with my best friend.”\\n\\n “Which happens to belong to a man who wants you in his bed.” I didn’t see it before, but it’s become clear to me. Now that I’ve had Paige in my bed, her residency at Ben Donavon’s is going to be a problem for me.\\n\\n She shrugs, as if she couldn’t care less. “It doesn’t matter if he wants me or not. I don’t want him.” She gets up and straddles me. “But I do want you.”\\n\\n She is going to use sex to distract me from this conversation. I’ll allow it—this time.\\n\\n It’s Christmas Eve morning. When I wake, I see Paige asleep on her stomach again. I’m learning things about her. She’s a stomach sleeper. She doesn’t want to cuddle when it’s time to sleep. And she likes her space in the bed. All these thing are fine by me.\\n\\n Instead of getting up to have coffee and read the paper, I stay in bed. I want to be next to her when she wakes because I’m going to have her again before I take her back. I want to be freshly on her skin and inside her when she returns to him.\\n\\n My American girl isn’t a morning person. She likes to sleep in, so I get to lie next to her, studying her form for almost an hour before she wakes. I’m on the verge of going back to sleep when I feel her roll in my direction. My eyes spring open and she’s staring at me.\\n\\n Hmm. The watcher becomes the watched.\\n\\n She laces her fingers together across my chest and props her chin on top of her hands. “Good morning.”\\n\\n I lift my head and kiss the top of her hair. “Good morning to you, sleepyhead.”\\n\\n “I can’t be called the sleepyhead if I’m the one who catches you sleeping.”\\n\\n “I’ve been waiting an hour for you to wake up, lazy bones.”\\n\\n “And what kept you in bed instead of getting up to have your morning coffee?”\\n\\n “You.”\\n\\n I’m inside her twice before we leave the vineyard, once in the bed and again in the shower. As I drive her to the apartment, I chastise myself for not being more adventurous and having her throughout the house since all of the staff was gone. It would’ve been the perfect time. It will be difficult to pull that off once they are back.\\n\\n I pull up in front of the apartment but keep the Sunset’s engine running. I have to get on the road if I’m going to be on time. Mum hates it when anyone is late, and I’m already going to have hell to pay for not bringing my “girlfriend” with me.\\n\\n I get out of the car and walk her to the apartment entrance. I reach for her hands and give them a gentle squeeze. “I’ll call you later tonight. When you hear Bret sing, you’ll know it’s me.”\\n\\n “That reminds me. You need a personalized ringtone—so you know it’s me.”\\n\\n I can’t believe she doesn’t know she has one. “You have one. You just don’t know what it is.”\\n\\n She reaches for her phone to call me, but I stop her. “Oh, no you don’t.”\\n\\n “But I want to know what mine is.”\\n\\n “Later.” I frame her face with my hands and kiss her hard so she’ll be “love drunk” with me on her mind while I’m away.\\n\\n “Drive carefully.”\\n\\n “I will.”\\n\\n Just like the first time he interrupted us, Ben Donavon appears out of thin air. He clears his throat, interrupting our parting kiss.\\n\\n He smiles as a look exchanges between us, one that says, “Hey. I’m gonna have this girl.”\\n\\n I give him a smug smile in return that responds, “Hey, guess what. I’ve already had this girl. And she is incredible.”\\n\\n The little bastard picks up Paige’s duffle and stands waiting with it thrown over his shoulder. He knows he’s interrupting our last moments together. And he’s loving it.\\n\\n Fuck it. If he thinks he’s just ruined this for me, he’s wrong. I’m going to kiss the hell out of her regardless. “Excuse us. We were in the middle of something.”\\n\\n I grasp her face and brush my lips across hers, but then I coax her mouth open and she allows me to kiss her like I did when we were alone, as if she has forgotten Ben is there with us.\\n\\n I trail my mouth over to her ear and my eyes meet Ben’s as I whisper, “Remember. I won’t share you.”\\n\\n She whispers back, “How could I forget?”\\n\\n We say a final goodbye and Ben is waiting to take her from me. When she enters the apartment, he turns back to give me a shit-eating grin as he places his hand on her lower back.\\n\\n Dammit! Not her lower back. That’s my spot to touch.\\n\\n My only choice is to watch. I feel helpless, like a shepherd seeing his favorite lamb disappear into the forest with a dangerous wolf. She thinks he’s harmless, but he’s not. I know better.\\n\\n It’s juvenile, but I text her before I drive away in an effort to steal her attention away from him.\\n\\n *Miss me while I’m gone*\\n\\n A heartbeat later, I hear the sound of her return text.\\n\\n *Can’t miss U till UR gone ;)*\\n\\n I pull away from the curb and wait until I’m out of sight to hit send on the next message.\\n\\n *Gone. Now U can miss me.*\\n\\n *I will but no TWD!*\\n\\n She’s concerned for my safety. This makes me smile.\\n\\n *K*\\n\\n I use the drive to think about a lot of things, but my thoughts mostly revolve around the beautiful new brunette in my life who doesn’t seem to care about the things I can do for her. Knowing how little she cares about the money I could spend, makes me want to buy her the world.\\n\\n My mom greets me at the door, which she never does, and peeks toward my car. She’s searching for my “girlfriend.” \\n\\n","sourceLink":"https://allnovel.net/beauty-from-pain-beauty-1/page-18.html","bookId":1879,"book":{"id":1879,"title":"Beauty from Pain (Beauty #1)","description":"Storyline: Beauty from Pain (Beauty #1) \\n They agreed on three months...but their love knew no boundaries. \\n Jack McLachlan is a winemaking magnate and easily one of Australia’s most eligible bachelors. His success and wealth make him no stranger to the complications of romantic relationships and that’s why he goes to extreme measures to avoid the hassle. He prefers simplicity in the form of a beautiful female companion with no strings attached. He arranges relationships like business deals and they’re always the same. No long term relationships. No real names. \\n It’s his game and his rules. He’s content to play as usual, but when Laurelyn Prescott enters his life, his strategy must change because this player is like none he\u0027s ever encountered. His world is turned on its head after he begins a three month affair with the beautiful American musician. Nothing goes according to plan and as he breaks more and more of his own rules for her, she’s exceptionally close to becoming something he never thought possible. His ultimate game changer. \\n Not recommended for younger readers due to sexual content and language.\\n","cover":"https://allnovel.net/images/beauty-from-pain-beauty-1.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-pain-beauty-1.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:51:45 PM"}}
