{"id":83624,"no":38,"title":"Page 38","content":"“I want to know.” I take a deep breath and blow it out slowly. “That guy, Chris, told me he wanted something of mine—something I wasn’t willing to share.” “I don’t understand.” “You. He wanted you.” “Me? But he’s married.” It makes me sick that I can’t say it without picturing it in my head. “He asked me to watch him fuck you while his wife gave me head.” Her eyes are wide. “Oh?” I see it on her face when it clicks. “Ohh. Swingers?” “Exactly.” “You pounded his face in because he wanted to have sex with me?” “I damn sure did and I’d do it …” She cuts off my words with her mouth as she slams it against mine. Her hands are at my chest working to unfasten the buttons of my wined-stained shirt. Unsatisfied with such slow progress, she reaches for the bottom and pulls it over my head while it’s still buttoned. She unfastens my belt buckle and then the button on my pants, this time more successful with the process. She slides my zipper down and puts her hand inside my jocks. Her hand encompasses me as she glides it up and down. Damn, this girl knows how to give a hand job. She kisses me hard while her hand pumps me. I’m close to coming, but she doesn’t let me. “Where are the condoms?” “Outer pocket, big suitcase.” She kisses my mouth. “Don’t go anywhere.” Hell, there’s no chance of that. I stand and kick off my daks and jocks while she’s digging for the rubbers. She slinks toward me flipping a foil package between two fingers. She uses her palms to push me down on the bed. “I’m putting it on this time.” “No argument here, baby.” She opens the packet and I’m such a guy. I lift my head because I want to watch her put it on me. It’s hot watching her hands touch me like that. When she finishes, she shimmies her panties down her legs and steps out of them. She climbs one knee at a time onto the bed and straddles me. My hands are splayed over her hips as she watches my face. “So, you don’t want Swinger Chris to have me?” Ugh, I need that image out of my head. “No fucking way.” My tip is at her wet entrance, but she doesn’t slide down on it. She’s rocking her hips back and forth, teasing me. “Can anyone else have me, or is Swinger Chris the only one who can’t?” “No one else can have you, Laurelyn. I’m the only one.” She smiles. “Then show me.” 35 Laurelyn Prescott Lachlan comes up from the bed and flips me onto my back. He’s kneeling between my legs and hooks them around his arms so he can push them back. He’s not gentle about it. He drives into me without mercy, but that’s the way I want this. His mouth is against my ear. “You’re mine. Do you understand?” “Yes!” I scream partly because it’s my answer, but mostly because what he’s doing feels so good. “I want you to say it.” We’re sideways on the bed and each thrust shoves me farther across the mattress until my head is hanging off the edge. “I’m … yours … and … no … one … else’s.” He releases one of my legs and his hand slides down so his fingers can stroke me above our point of fusion. “No one else touches you here like this.” I’m panting as I lift my hips against him and his fingers. “Only you, Lachlan.” He hits my sweet spot perfectly and I feel myself contract around him, detonating his orgasm. I feel like screaming at the top of my lungs, so I do because no one’s around to hear me. “Ah, ah!” “Ah, Laurelyn.” There’s my name, just like always when he comes. He rolls off me and collapses onto the bed. My head is still dangling off the side so I scoot back onto the mattress. I’m on my back and I stare up at the beautiful sheer panels draped over the canopy above us with one thought—this bed was meant for making love, but that isn’t what we just did. It never is. The bedroom fills with bright sunlight despite the curtains. I smell breakfast—definitely bacon—maybe pancakes. I’m hungry, but I’m sleepier, so I pull the sheet up over my head. It was a late night. I get a few more minutes’ sleep before I feel Lachlan reach under the sheet to tickle my nose. I wiggle it to relieve the need to scratch, but give in and reach under the covers and rake my nails across it. “I thought you got to sleep in on vacation.” “This isn’t vacation for me. It’s work and I have to leave soon, but I wanted to have brekkie with you for your birthday.” How does he know? I lift the covers to see him. He’s grinning because he’s so proud of himself. “How did you know it’s my birthday?” “You told me on our second date.” “I don’t remember that.” “Well, you did, and I remembered, so get up for your birthday breakfast.” I can’t believe he remembered. He has such an eye for detail. Did he tell me when his birthday is? If he did, I forgot. I walk into the kitchen and there is a huge breakfast buffet across the counter. There’s no way we could eat all of it. “Did you do all of this?” “Would you think less of it if I didn’t?” “No.” “I had it catered from one of the local restaurants.” “It smells delicious.” He passes a plate to me. “Birthday girl goes first.” While I’m plating my food, he pours me a glass of juice. He puts it on the dining room table and then joins me with a mile-high stack of pancakes. “Hungry much?” “I had a famishing night, but I always eat this much in the morning. You’d know that if you were ever awake to join me for breakfast.” He’s never going to stop teasing me about being a late sleeper. “How’s the hand today?” He holds it up to make a fist and then releases it. “It hurts, but I can move it, so it’s not broken.” “No one’s ever done anything like that for me.” “Anytime, babe.” When I finish, I slide my plate away because I’m stuffed. “That was wonderful. Thank you. It was a thoughtful gift to wake up to.” “The food isn’t your gift.” He reaches into his pocket and pulls out a black velvet jewelry box. He puts it on the table and slides it to me. “But this is.” I’m not fool enough to think, or hope, this little box contains a ring. I know it doesn’t because that would be ridiculous, but it definitely contains a piece of jewelry. I reach for it and flip the top open. Inside is a star-shaped pendant covered in what I assume are diamonds. “I chose it because you’re going to become a huge superstar after you get home.” It’s the best birthday present ever. And the worst. It’s the best because it’s so encouraging and thoughtful. It’s the worst because it means that when he’s telling me I’m his, he leaves off the part about it only being for the next six weeks. “You don’t like it?” I force a smile. “It’s perfect and I love it. Thank you.” I take it out of the box and pass it to him. “Will you?” I turn and lift my hair so he can put it on me. After he closes the clasp, he kisses the back of my neck. “I wish I could stay with you all day.” I turn around and touch the pendant with my fingertip. “Me too.” He smiles as he admires his gift around my neck. “I’ll try to get back early.” “Early or late, either way, I’ll be here.” “I still don’t want you to go into the water without me.” “Ugh! There’s a country song called ‘Don’t Go Near the Water.’ Now it’s going to be stuck in my head all day and I hate that freakin’ song. Thanks a lot, slick.” He kisses the top of my head. “Don’t know it, but you can thank me every time you catch yourself singing it.” He’s wearing a suit today. Damn, he’s hot in it—scorching hot. He’s standing over me and I grab the lapels of his jacket to pull him down for a kiss. The peck he gave me on top of my head wasn’t near enough to do me all day. When I let him go, I tell him, “That’s your incentive to work fast so you can leave early and come back to me.” I spend the day reading on the beach, not swimming in the water, although it’s hot as hell. It’s midafternoon and I decide to take a break from the sweltering heat, so I go into the house for a snack and some air conditioning. I’m sitting at the dining room table having some leftover fruit from my birthday breakfast when my personal phone rings. It’s my mom, no doubt calling to wish me a happy birthday. “Hey, Mom.” “Happy birthday, baby girl.” “Thank you.” “Are you having a good one?” “The best.” And it is. I’m staying at a house on a private beach in New Zealand with a beautiful man I can’t get enough of. Nothing beats this. “Well, I’ve got some news that’s going to make it even better.” Her idea of good news and my idea aren’t always the same. “What is it?” “It’s your dad. He came to see me, baby. He wants to meet you.” This is a perfect example of when our ideas of good news are on two different spectrums. “Why?” “Because you’re his daughter.” I would’ve given anything to hear those words when I was a child. All I wanted was for my rich and famous father to rescue me from her when I was surviving off tap water and moldy bread because she was too strung out to go to the grocery store. I prayed he’d come and save me, but he didn’t. “He hasn’t wanted me as his daughter for twenty-three years, and he doesn’t get to change his mind now because the only child he claimed is dead.”","sourceLink":"https://allnovel.net/beauty-from-pain-beauty-1/page-38.html","bookId":1879,"book":{"id":1879,"title":"Beauty from Pain (Beauty #1)","description":"Storyline: Beauty from Pain (Beauty #1) They agreed on three months...but their love knew no boundaries. Jack McLachlan is a winemaking magnate and easily one of Australia’s most eligible bachelors. His success and wealth make him no stranger to the complications of romantic relationships and that’s why he goes to extreme measures to avoid the hassle. He prefers simplicity in the form of a beautiful female companion with no strings attached. He arranges relationships like business deals and they’re always the same. No long term relationships. No real names. It’s his game and his rules. He’s content to play as usual, but when Laurelyn Prescott enters his life, his strategy must change because this player is like none he\u0027s ever encountered. His world is turned on its head after he begins a three month affair with the beautiful American musician. Nothing goes according to plan and as he breaks more and more of his own rules for her, she’s exceptionally close to becoming something he never thought possible. His ultimate game changer. Not recommended for younger readers due to sexual content and language.","cover":"https://allnovel.net/images/beauty-from-pain-beauty-1.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-pain-beauty-1.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:51:45 PM"}}
