{"id":83628,"no":42,"title":"Page 42","content":"\\n\\n I see the relief on Emma’s face. “Thank you.”\\n\\n “You’re welcome.” Laurelyn takes a slumbering Mila from Emma and carries her over to where Celia is sleeping in a chair. “Don’t worry. We’ll be just fine.”\\n\\n We enter Henry McLachlan’s hospital room in a cluster. None of us say it, but it’s frightening to see this strong man so frail and weak. He’s pale against the white hospital sheets—almost white on white.\\n\\n He hears us enter and opens his eyes. He looks groggy. I’m sure it’s the anesthetic wearing off.\\n\\n He looks at my mum first. That’s the way it’s always been between them. She’s always his number one.\\n\\n And that’s what my mum wants me to have. My very own number one.\\n\\n She sits in the chair at his bedside while we observe as spectators. My dad reaches for her hand and she places it inside his. “I should have listened to you, Margaret.”\\n\\n “I’ve been saying that for years, Henry.”\\n\\n The dismal mood in the room is lifted by my mum’s humor. She speaks her mind. I get that from her, but she also has a gift for easing the discomfort and tension of those around her.\\n\\n “Henry, I might ought to thank you for trying to die because you’ll never guess who Jack Henry brought to the hospital with him.”\\n\\n “Well, love, judging by the happiness on your face, it can only be the woman he’s been dating.”\\n\\n “Yes, and she’s lovely. Just beautiful. And she calls him Jack Henry.”\\n\\n The whole family stares at me because they missed that conversation between Laurelyn and Mum. “What? It’s not a big deal.”\\n\\n As always, my sister is the first to argue. “You’re full of it. That’s a huge deal.”\\n\\n I needed to change the subject, and fast. “We’re not here about Laurelyn and me. We’re here for Dad.”\\n\\n Visiting hours end and my dad’s nurse assures us his condition is good. She convinces us it would be best for everyone, including my mum, to go home for the night. The waiting room doesn’t make for a good night’s rest.\\n\\n I’m the first one in the waiting room with Mum not far behind. Laurelyn has Celia tucked under her arm like a mother hen and baby Mila draped over her shoulder, sucking her thumb as she looks around.\\n\\n Her soft voice carries across the waiting room and I hear her singing Brahms’ lullaby. “‘Close your eyes … Now and rest … May these hours be blessed.’”\\n\\n My mum stands beside me listening to Laurelyn sing to my brother’s ankle-biters. “Jack Henry, she’s a special one.”\\n\\n She doesn’t have to tell me things I already know. “That she is,” I sigh.\\n\\n She bumps her shoulder into mine. “And you’ve been a little shit for not bringing her to meet me.”\\n\\n I’m amused, but not surprised by Margaret McLachlan’s choice of words. She’s the only mother I know who will tell her thirty-year-old son he is a little shit. If the circumstances were as she believes, she’d be right. Because I can’t tell her differently, I have no defense, so I don’t argue. “I guess I have been.”\\n\\n “Where are you staying?”\\n\\n Where is she going with this? “The Marx.”\\n\\n She sighs. “Go get your things. I want you and Laurelyn to stay at the house.”\\n\\n Now I see. She’s so transparent. “The Marx is much closer to the hospital.”\\n\\n She takes that tone with me. That motherly do as I say tone. “We’ve just had a very close call with your father. The family should be together.”\\n\\n Maybe she does want the family together, but that isn’t what this is about. “You want Laurelyn at your house so you can have access to her.”\\n\\n “You haven’t dated anyone in years. Is it wrong for me to want to spend time with her?”\\n\\n It’s unnecessary for her to get to know Laurelyn—she’s leaving in a month. “There’s nothing wrong as long as you don’t have far-fetched ideas about us. She’s only here for four more weeks.”\\n\\n “That’s not written in stone, is it?”\\n\\n Geez, this woman is bound and determined. “No, but it’s written on her airline ticket.”\\n\\n She huffs. “I swear, McLachlan men don’t have a romantic or creative bone in their bodies.”\\n\\n I hate that my mum has the wrong impression. “It’s not what you think it is between us. Laurelyn and I knew we’d only have three months together when we started seeing each other. We agreed to date for fun, not for love.”\\n\\n “But the heart wants what the heart wants.”\\n\\n “And yours wants another daughter-in-law and mother for more grandchildren.”\\n\\n “My heart wants you to be happy, and I believe that girl is the one to do it. You have four weeks to convince her to stay.” She lifts her brows at me. “I suggest you get on that right away, son.”\\n\\n We’re driving to my parents’ house after we get our things from the hotel and I remember my mum whispering something to Laurelyn. “What did my mum tell you at the hospital?”\\n\\n “Oh, do you mean after the incident where I freaked her out by calling you Jack Henry?” She reaches over and frogs my bicep with her knuckle. Damn, it sort of hurt. “Thanks for the heads-up, by the way. Not.”\\n\\n “Forgive me. I was a little preoccupied with the uncertainty of my dad’s survival. What did she say?”\\n\\n “What she told me is our little secret, not for you to know.”\\n\\n Great. My mum and the woman I’m having an affair with are sharing secrets behind my back. That’s not awkward at all.\\n\\n Now, I’m more curious than ever. “Tell me. I want to know.”\\n\\n “No. She would have told you if she wanted you to know.”\\n\\n “She thinks we’re in love. Or at least have the potential to be.” I throw the words out like bait on a hook to see if I can get a nibble.\\n\\n “You think so?” Dammit. I can’t tell by her tone if she’s asking my opinion or if she’s being facetious.\\n\\n She isn’t budging, but I have my ways. I might not get what I want out of her by asking, but I have other methods of making this little bird sing.\\n\\n 39\\n\\n Laurelyn Prescott\\n\\n Margaret McLachlan’s words echo in my head as we drive toward her house. “The only way he’d let you call him Jack Henry was if he was in love with you.”\\n\\n It’s a nice theory if he’d asked me to call him that, but he hadn’t.\\n\\n He’s dying to know the secret I share with his mother. He’s going to try to persuade me to tell him later. He thinks he’s smooth, but I’ve learned his ways during our time together. It’ll be fun letting him try, but he won’t succeed. My lips are sealed.\\n\\n Lachlan navigates up a long drive leading to a huge house on top of a hill. Maybe a mountain. I’m not sure because it isn’t nearly as impressive as the mansion sitting on it. “Is this where you grew up?”\\n\\n “Yes.”\\n\\n “It’s beautiful.” It beat the hell out of the tiny apartments and rental houses I bounced through during my early years.\\n\\n Lachlan takes our bags from the car and carries them inside. There’s no his or mine. Our things are packed together in his expensive luggage so at least I don’t have to be embarrassed by my worn, mismatched set.\\n\\n We enter through the foyer and I can’t help but stare at the beautiful spiraling staircase leading to the upper floor.\\n\\n I hear his mother call out, but I can’t see her. “Jack Henry?”\\n\\n “Yes, Mum. We’re here. I’m going to put our things away and we’ll be down in a minute.”\\n\\n I follow him up the stairs and he takes me into his large bedroom. I’m a little surprised to see a four-poster bed. It’s very romantic and doesn’t fit what I’d expect to see in a man’s room. I walk over and run my hand down one of the thick pillars. We need this bed at Avalon. I could definitely do some interesting things with it.\\n\\n We go downstairs to the living room to join Lachlan’s family and I remind myself the whole way that he’s not Lachlan. He’s Jack Henry. “Jack Henry.”\\n\\n He turns at the sound of his name. His real name. The name only his mother calls him. “What is it?”\\n\\n This is going to take some getting used to. “Nothing. I’m saying your name so I can get used to it. I’m afraid of slipping up.”\\n\\n “Don’t worry. If you have a slip of the tongue, we’ll tell them Lachlan is your pet name for me. Not caveman.”\\n\\n “I guess that will work. It is part of your last name. Is that why you chose it?”\\n\\n “I picked it because I wanted to hear you say some semblance of who I really am.”\\n\\n “Do you always do that?”\\n\\n “No, just with you.”\\n\\n Damn. The conversation ends as we enter the living room. I’d really like to know his rationale behind the things he does. I’m hopeful that this conversation is only postponed until a later time.\\n\\n After spending the evening with the McLachlan family, I’m in the bathroom getting ready for bed. I thought meeting them would help me understand why Jack Henry is the way he is, but it only makes things feel more out of sorts. They’re all so normal. And loving. Theirs isn’t the kind of family I would expect for a man who propositions women for meaningless sexual relationships.\\n\\n I search through my sleepwear, if that’s what we’re calling it, and choose the least desirable thing I packed, but who am I kidding? This is the same man I’ve been living with for the past two months. He isn’t going to perceive a short, black satin nightgown as anything but a prelude to sex.\\n\\n I stop in the doorway of the bathroom before entering his bedroom. “Are you sure it’s okay for us to sleep together in your parents’ house? It doesn’t feel right.”\\n\\n He’s lying shirtless in bed with his hands folded behind his head. I sigh with pure pleasure as I behold the sight of him. “Trust me. Mum would have it no other way.” \\n\\n","sourceLink":"https://allnovel.net/beauty-from-pain-beauty-1/page-42.html","bookId":1879,"book":{"id":1879,"title":"Beauty from Pain (Beauty #1)","description":"Storyline: Beauty from Pain (Beauty #1) \\n They agreed on three months...but their love knew no boundaries. \\n Jack McLachlan is a winemaking magnate and easily one of Australia’s most eligible bachelors. His success and wealth make him no stranger to the complications of romantic relationships and that’s why he goes to extreme measures to avoid the hassle. He prefers simplicity in the form of a beautiful female companion with no strings attached. He arranges relationships like business deals and they’re always the same. No long term relationships. No real names. \\n It’s his game and his rules. He’s content to play as usual, but when Laurelyn Prescott enters his life, his strategy must change because this player is like none he\u0027s ever encountered. His world is turned on its head after he begins a three month affair with the beautiful American musician. Nothing goes according to plan and as he breaks more and more of his own rules for her, she’s exceptionally close to becoming something he never thought possible. His ultimate game changer. \\n Not recommended for younger readers due to sexual content and language.\\n","cover":"https://allnovel.net/images/beauty-from-pain-beauty-1.jpg","author":"Georgia Cates","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/beauty-from-pain-beauty-1.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:51:45 PM"}}
