{"id":97290,"no":16,"title":"Page 16","content":"I said, \"So that was the last time you saw him. At the Chinese restaurant.\" \"Well, he walked me back to my apartment. Then he drove home.\" \"What time was that? That he left your place.\" \"I don\u0027t know. Probably around ten or ten thirty, maybe a little later. Why do you ask?\" I shrugged. \"No reason. Call it habit. I was a cop for a lot of years. When a cop runs out of things to say, he finds himself asking questions. It hardly matters what the questions are.\" \"That\u0027s interesting. A kind of a learned reflex.\" \"I suppose that\u0027s the term for it.\" She drew a breath. \"Well,\" she said. \"I want to thank you for meeting with me. I wasted your time-\" \"I have plenty of time. I don\u0027t mind wasting some of it now and then.\" \"I just wanted to learn whatever I could about… about him. I thought there might be something, that he would have had some last message for me. A note, or a letter he might have mailed. I guess it\u0027s part of not really believing he\u0027s dead, that I can\u0027t believe I\u0027ll never hear from him one way or the other. I thought-well, thank you, anyway.\" I didn\u0027t want her to thank me. She had no reason on earth to thank me. AN hour or so later, I reached Beverly Ethridge. I told her I had to see her. \"I thought I had until Tuesday. Remember?\" \"I want to see you tonight.\" \"Tonight\u0027s impossible. And I don\u0027t have the money yet, and you agreed to give me a week.\" \"It\u0027s something else.\" \"What?\" \"Not over the phone.\" \"Jesus,\" she said. \"Tonight is absolutely impossible, Matt. I have an engagement.\" \"I thought Kermit was out playing golf.\" \"That doesn\u0027t mean I sit home alone.\" \"I can believe that.\" \"You really are a bastard, aren\u0027t you? I was invited to a party. A perfectly respectable party, the kind where you keep your clothes on. I could meet you tomorrow if it\u0027s absolutely necessary.\" \"It is.\" \"Where and when?\" \"How about Polly\u0027s? Say around eight o\u0027clock.\" \"Polly\u0027s Cage. It\u0027s a little tacky, isn\u0027t it?\" \"A little,\" I agreed. \"And so am I, huh?\" \"I didn\u0027t say that.\" \"No, you\u0027re always the perfect gentleman. Eight o\u0027clock at Polly\u0027s. I\u0027ll be there.\" I could have told her to relax, that the ball game was over, instead of letting her spend another day under pressure. But I figured she could handle the pressure. And I wanted to see her face when I let her off the hook. I don\u0027t know why. Maybe it was the particular kind of spark we struck off each other, but I wanted to be there when she found out that she was home free. Huysendahl and I didn\u0027t strike those sparks. I tried him at his office and couldn\u0027t reach him, and on a hunch I tried him at home. He wasn\u0027t there, but I managed to talk to his wife. I left a message that I would be at his office at two the next afternoon and that I would call again in the morning to confirm the appointment. \"And one other thing,\" I said. \"Please tell him that he has absolutely nothing to worry about. Tell him everything\u0027s all right now and everything will work out fine.\" \"And he\u0027ll know what that means?\" \"He\u0027ll know,\" I said. I napped for a while, had a late bite at the French place down the block, then went back to my room and read for a while. I came very close to making an early night of it, but around eleven my room started to feel a little bit more like a monastic cell than it generally does. I\u0027d been reading The Lives of the Saints, which may have had something to do with it. Outside it was trying to make up its mind to rain. The jury was still out. I went around the corner to Armstrong\u0027s. Trina gave me a smile and brought me a drink. I was only there for an hour or so. I did quite a bit of thinking about Stacy Prager, and even more about her father. I liked myself a little less now that I\u0027d met the girl. On the other hand, I had to agree with what Trina had suggested the night before. He had indeed had the right to pick that way out of his trouble, and now at least his daughter was spared the knowledge that her father had killed a man. The fact of his death was horrible, but I could not easily construct a scenario which would have worked out better. When I asked for the check Trina brought it over and perched on the edge of my table while I counted out bills. \"You\u0027re looking a little cheerier,\" she said. \"Am I?\" \"Little bit.\" \"Well, I had the best night\u0027s sleep I\u0027ve had in a while.\" \"Is that so? So did I, strangely enough.\" \"Good.\" \"Quite a coincidence, wouldn\u0027t you say?\" \"Hell of a coincidence.\" \"Which proves there are better sleeping aids than Seconal.\" \"You\u0027ve got to use them sparingly, though.\" \"Or you get hooked on them?\" \"Something like that.\" A guy two tables away was trying to get her attention. She gave him a look, then turned back to me. She said, \"I don\u0027t think it\u0027ll ever get to be a habit. You\u0027re too old and I\u0027m too young and you\u0027re too withdrawn and I\u0027m too unstable and we\u0027re both generally weird.\" \"No argument.\" \"But once in a while can\u0027t hurt, can it?\" \"No.\" \"It\u0027s even kinda nice.\" I took her hand and gave it a squeeze. She grinned quickly, scooped up my money, and went off to find out what the pest two tables down wanted. I sat there watching her for a moment, then got up and went out the door. It was raining now, a cold rain with a nasty wind behind it. The wind was blowing uptown and I was walking downtown, which didn\u0027t make me particularly happy. I hesitated, wondering if I ought to go back inside for one more drink and give it a chance for the worst of it to blow over. I decided it wasn\u0027t worth it. So I started walking toward Fifty-seventh Street, and I saw the old beggarwoman in the doorway of Sartor Resartus. I didn\u0027t know whether to applaud her industry or worry about her; she wasn\u0027t usually out on nights like this. But it had been clear until recently, so I decided she must have taken her post and then found herself caught in the rain. I kept walking, reaching into my pocket for change. I hoped she wouldn\u0027t be disappointed, but she couldn\u0027t expect ten dollars from me every night. Only when she saved my life. I had the coins ready, and she came out of the doorway as I reached it. But it wasn\u0027t the old woman. It was the Marlboro man, and he had a knife in his hand. Chapter 15 He came at me in a rush, the knife held underhand and arcing upward, and if it hadn\u0027t been raining he would have had me cold. But I got a break. He lost his footing on the wet pavement and had to check the knife thrust in order to regain his balance, and that gave me time to react enough to duck back from him and set myself for his next try. I didn\u0027t have to wait long. I was up on the balls of my feet, arms loose at my sides, a tingling sensation in my hands and a pulse working in my temple. He rocked from side to side, his broad shoulders hinting and feinting, and then he came at me. I\u0027d been watching his feet and I was ready. I dodged to the left, pivoted, threw a foot at his kneecap. And missed, but bounced back and squared off again before he could set himself for another lunge. He began circling to his left, circling like a prizefighter stalking an opponent, and when he\u0027d completed a half circle and had his back to the street, I figured out why. He wanted to corner me so that I couldn\u0027t make a run for it. He needn\u0027t have bothered. He was young and trim and athletic and outdoorsy. I was too old and carried too much weight, and for too many years the only exercise I had got was bending my elbow. If I tried to run, all I\u0027d manage to do would be to give him my back for a target. He leaned forward and began transferring the knife from hand to hand. That looks good in the movies, but a really good man with a knife doesn\u0027t waste his time that way. Very few people are really ambidextrous. He had started off with the knife in his right hand, and I knew it would be in his right hand when he made his next pass, so all he did with his hand-to-hand routine was give me breathing space and let me tune in on his timing. He also gave me a little hope. If he\u0027d waste energy with games like that, he wasn\u0027t all that great with a knife, and if he was amateur enough I had a chance. I said, \"I don\u0027t have much money on me, but you\u0027re welcome to it.\" \"Don\u0027t want your money, Scudder. Just you.\" Not a voice I\u0027d heard before, and certainly not a New York voice. I wondered where Prager had found him. After having met Stacy, I was fairly sure he wasn\u0027t her type. \"You\u0027re making a mistake,\" I said. \"It\u0027s your mistake, man. And you already made it.\" \"Henry Prager killed himself yesterday.\" \"Yeah? I\u0027ll have to send him some flowers.\" Back and forth with the knife, knees tensing, relaxing. \"I\u0027m gonna cut you up pretty, man.\" \"I don\u0027t think so.\" He laughed. I could see his eyes now by the light of the street lamps, and I knew what Billie meant. He had killer eyes, psychopath eyes. I said, \"I could take you if we both had knives.\" \"Sure you could, man.\" \"I could take you with an umbrella.\" And what I really wished I had was an umbrella or a walking stick. Anything that gives you a little reach is a better defense against a knife than another knife. Better than anything short of a gun. I wouldn\u0027t have minded a gun just then, either. When I left the police department, one immediate benefit was that I no longer had to carry a gun every waking moment. It was very important to me at the time not to carry a gun. Even so, for months I\u0027d felt naked without one. I had carried one for fifteen years, and you sort of get used to the weight. If I\u0027d had a gun now, I\u0027d have had to use it. I could tell that about him. The sight of a gun wouldn\u0027t make him drop the knife. He was determined to kill me, and nothing would keep him from trying. Where had Prager found him? He wasn\u0027t professional talent, certainly. Lots of people hire amateur killers, of course, and unless Prager had some mob connections I didn\u0027t know about, he wouldn\u0027t be likely to have access to any of the pro hit men. Unless- That almost started me on a whole new train of thought, and the one thing I couldn\u0027t afford to do was let my mind wander. I came back to reality in a hurry when I saw his feet change their shuffling pattern, and I was ready when he closed in on me. I had my moves figured and I had him timed, and I started my kick just as he was getting into his thrust, and I was lucky enough to get his wrist. He lost his balance but managed not to take a spill, and while I managed to jar the knife loose from his hand, it didn\u0027t sail far enough to do me much good. He caught his balance and reached for the knife, and got it before my foot did. He scrambled backward almost to the edge of the curb, and before I could jump him he had the knife at his side and I had to back off. \"Now you\u0027re dead, man.\" \"You talk a good game. I almost had you that time.\" \"I think I\u0027ll cut you in the belly, man. Let you go out nice and slow.\" The more I kept talking, the more time he\u0027d take between rushes. And the more time he took, the better chance there was that someone would join the party before the guest of honor wound up on the end of the knife. Cabs cruised by periodically, but not many of them, and the weather had cut the pedestrian traffic down to nothing. A patrol car would have been welcome, but you know what they say about cops, they\u0027re never around when you want \u0027em.","sourceLink":"https://allnovel.net/time-to-murder-and-create-matthew-scudder-2/page-16.html","bookId":2321,"book":{"id":2321,"title":"Time to Murder and Create (Matthew Scudder #2)","description":"Storyline: Time to Murder and Create (Matthew Scudder #2) Small-time stoolie, Jake \"The Spinner\" Jablon, made a lot of new enemies when he switched careers, from informer to blackmailer. And the more \"clients, \" he figured, the more money - and more people eager to see him dead. So no one is surprised when the pigeon is found floating in the East River with his skull bashed in. And what\u0027s worse, no one cares - except Matthew Scudder. The ex-cop-turned-private-eye is no conscientious avenging angel. But he\u0027s willing to risk his own life and limb to confront Spinner\u0027s most murderously aggressive marks. A job\u0027s a job after all - and Scudder\u0027s been paid to find a killer - by the victim...in advance.","cover":"https://allnovel.net/images/time-to-murder-and-create-matthew-scudder-2.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/time-to-murder-and-create-matthew-scudder-2.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:25:31 PM"}}
