{"id":97276,"no":2,"title":"Page 2","content":"\"I guess not. Three twenty? Yeah, I guess that\u0027s as good a number as any.\" He got out a fat alligator wallet and counted out six fifties and a twenty. \"Three-two-oh,\" he said, handing them to me. \"If this drags on and on and you want more, you let me know. Good enough?\"\\n\\n \"Good enough. Suppose I have to get in touch with you, Spinner?\"\\n\\n \"Uh-uh.\"\\n\\n \"Okay.\"\\n\\n \"Like, you won\u0027t have to, and if I wanted to give you an address I couldn\u0027t anyway.\"\\n\\n \"Okay.\"\\n\\n He opened the attachй and passed me a nine-by-twelve manila envelope sealed on both ends with heavy-duty tape. I took it from him and put it on the bench beside me. He gave the silver dollar a spin, picked it up, put it in his pocket, and beckoned to Trina for the check. I let him have it. He paid it and left a two-dollar tip.\\n\\n \"What\u0027s so funny, Matt?\"\\n\\n \"Just that I never saw you grab a check before. And I\u0027ve seen you pick up other people\u0027s tips.\"\\n\\n \"Well, things change.\"\\n\\n \"I guess they do.\"\\n\\n \"I didn\u0027t do that often, dragging down somebody\u0027s tips. You do lots of things when you\u0027re hungry.\"\\n\\n \"Sure.\"\\n\\n He got to his feet, hesitated, put out his hand. I shook it. He turned to go, and I said, \"Spinner?\"\\n\\n \"What?\"\\n\\n \"You said the kind of lawyers you know would open the envelope as soon as you left the office.\"\\n\\n \"You bet your ass they would.\"\\n\\n \"How come you don\u0027t think I will?\"\\n\\n He looked at me as though the question was a stupid one. \"You\u0027re honest,\" he said.\\n\\n \"Oh, Christ. You know I used to take. I let you buy your way out of a collar or two, for Christ\u0027s sake.\"\\n\\n \"Yeah, but you were always square with me. There\u0027s honest and there\u0027s honest. You\u0027re not gonna open that envelope until you have to.\"\\n\\n I knew he was right. I just didn\u0027t know how he knew it. \"Take care of yourself,\" I said.\\n\\n \"Yeah, you too.\"\\n\\n \"Watch yourself crossing the street.\"\\n\\n \"Huh?\"\\n\\n \"Watch out for buses.\"\\n\\n He laughed a little, but I don\u0027t think he thought it was funny.\\n\\n Later that day, I stopped off at a church and stuffed thirty-two dollars into the poor box. I sat in a rear pew and thought about the Spinner. He\u0027d given me easy money. All I had to do to earn it was nothing at all.\\n\\n Back in my room, I rolled up the rug and put Spinner\u0027s envelope beneath it, centering it under the bed. The maid runs the vacuum cleaner occasionally but never moves the furniture around. I put the rug back in place and promptly forgot about the envelope, and every Friday a call or a message would assure me that Spinner was alive and the envelope could stay right where it was.\\n\\n Chapter 2\\n\\n For the next three days I read the papers twice a day and waited for a phone call. Monday night I picked up the early edition of the Times on the way to my room. Under the heading of \"Metropolitan Briefs\" there\u0027s always a batch of crime items tagged \"From the Police Blotter,\" and the last one was the one I was looking for. An unidentified male, white, height approximately five six, weight approximately one forty, age approximately forty-five, had been fished out of the East River with a crushed skull.\\n\\n It sounded right. I\u0027d have put his age a few years higher and his weight a few pounds lower, but otherwise it sounded very right. I couldn\u0027t know that it was Spinner. I couldn\u0027t even know that the man, whoever he was, had been murdered. The skull damage could have been done after he went into the water. And there was nothing in the item to indicate how long he\u0027d been in the water. If it was more than ten days or so, it wasn\u0027t Spinner; I\u0027d heard from him the Friday before.\\n\\n I looked at my watch. It wasn\u0027t too late to call someone, but it was far too late to call someone and seem casual about it. And it was too early to open his envelope. I didn\u0027t want to do that until I was very certain he was dead.\\n\\n I had a couple more drinks than usual, because sleep was a long time coming. In the morning I woke up with a headache and a bad taste in my mouth. I used aspirin and mouthwash and went down to the Red Flame for breakfast. I picked up a later Times, but there was nothing further on the floater. They had the same item as the earlier edition.\\n\\n Eddie Koehler is a lieutenant now, attached to the Sixth Precinct in the West Village. I called from my room and managed to get through to him. \"Hey, Matt,\" he said. \"It\u0027s been a while.\"\\n\\n It hadn\u0027t been all that long. I asked about his family and he asked about mine. \"They\u0027re fine,\" I said.\\n\\n \"You could always go back there,\" he said.\\n\\n I couldn\u0027t, for far more reasons than I wanted to go into. I couldn\u0027t start carrying a badge again, either, but that didn\u0027t keep him from asking his next question.\\n\\n \"I don\u0027t suppose you\u0027re ready to rejoin the human race, huh?\"\\n\\n \"That\u0027s not going to happen, Eddie.\"\\n\\n \"Instead you got to live in a dump and scrounge for every buck. Listen, you want to drink yourself to death, that\u0027s your business.\"\\n\\n \"That\u0027s right.\"\\n\\n \"But what\u0027s the sense paying for your own drinks when you can drink free? You were born to be a cop, Matt.\"\\n\\n \"The reason I called-\"\\n\\n \"Yeah, there has to be a reason, doesn\u0027t there?\"\\n\\n I waited for a minute. Then I said, \"Something in the paper that caught my eye, and I thought maybe you could save me a trip to the morgue. They took a floater out of the East River yesterday. Little guy, middle-aged.\"\\n\\n \"So?\"\\n\\n \"Could you find out if they identified him yet?\"\\n\\n \"Probably. What\u0027s your interest?\"\\n\\n \"I got a missing husband I\u0027m sort of looking for. He fits the description. I could go down and take a look at him, but I only know him from photographs and after a little while in the water-\"\\n\\n \"Yeah, right. What\u0027s your guy\u0027s name and I\u0027ll find out.\"\\n\\n \"Let\u0027s do it the other way around,\" I said. \"It\u0027s supposed to be confidential, I don\u0027t want to spread the name if I don\u0027t have to.\"\\n\\n \"I guess I could make a couple of calls.\"\\n\\n \"If it\u0027s my guy, you\u0027ll get yourself a hat.\"\\n\\n \"I figured as much. And if it\u0027s not?\"\\n\\n \"You\u0027ll get my sincere gratitude.\"\\n\\n \"Fuck you too,\" he said. \"I hope it\u0027s your guy. I can use a hat. Hey, that\u0027s funny, come to think of it.\"\\n\\n \"How?\"\\n\\n \"You\u0027re looking for a guy and I\u0027m hoping he\u0027s dead. You think about it, it\u0027s pretty funny.\"\\n\\n The phone rang forty minutes later. He said, \"It\u0027s a shame, I could\u0027ve used a hat.\"\\n\\n \"They didn\u0027t get a make?\"\\n\\n \"Oh, they got a make, they made him on fingerprints, but he\u0027s not a guy anybody\u0027s gonna hire you to look for. He\u0027s a character, we got a sheet on him a yard long. You must\u0027ve run into him once or twice yourself.\"\\n\\n \"What\u0027s his name?\"\\n\\n \"Jacob Jablon. Did a little stooling, a little boosting, all kinds of dumb shit.\"\\n\\n \"Name\u0027s familiar.\"\\n\\n \"They called him the Spinner.\"\\n\\n \"I did know him,\" I said. \"Haven\u0027t run into him in years. He used to spin a silver dollar all the time.\"\\n\\n \"Well, all he\u0027s gonna spin now is in his grave.\"\\n\\n I drew a breath. I said, \"He\u0027s not my guy.\"\\n\\n \"I didn\u0027t think so. I don\u0027t think he was anybody\u0027s husband, and if he was she wouldn\u0027t want him found.\"\\n\\n \"It\u0027s not the wife who\u0027s looking for my guy.\"\\n\\n \"It\u0027s not?\"\\n\\n \"It\u0027s his girlfriend.\"\\n\\n \"I\u0027ll be a son of a bitch.\"\\n\\n \"And I don\u0027t think he\u0027s in town in the first place, but I might as well string her for a few bucks. A guy wants to disappear, he\u0027s just going to do it.\"\\n\\n \"That\u0027s the way it generally goes, but if she wants to hand you money-\"\\n\\n \"That\u0027s my feeling,\" I said. \"How long was the Spinner in the water? Do they know that yet?\"\\n\\n \"I think they said four, five days. What\u0027s your interest?\"\\n\\n \"Getting him on prints, I figured it had to be fairly recent.\"\\n\\n \"Oh, prints\u0027ll hold a week, easy. Longer sometimes, depending on the fish. Imagine fingerprinting a floater-shit, if I did that I\u0027d be a long time before I wanted anything to eat. Imagine doing the autopsy.\"\\n\\n \"Well, that shouldn\u0027t be hard. Somebody must have hit him on the head.\"\\n\\n \"Considering who he was, I\u0027d say there\u0027s no question. He wasn\u0027t the type to go swimming and accidentally hit his head on a pier. What\u0027ll you bet they don\u0027t come up with a conclusive homicide tag for it, though?\"\\n\\n \"Why\u0027s that?\"\\n\\n \"Because they don\u0027t want this sitting in the open file for the next fifty years, and who wants to bust their balls finding out what happened to an asshole like the Spinner? So he\u0027s dead, so nobody\u0027s gonna cry for him.\"\\n\\n \"I always got along with him.\"\\n\\n \"He was a cheap little crook. Whoever bumped him did the world a favor.\"\\n\\n \"I suppose you\u0027re right.\"\\n\\n I got the manila envelope out from under the rug. The tape didn\u0027t want to budge, so I got my penknife from the dresser and slit the envelope open along the fold. Then I just sat on the edge of the bed with the envelope in my hand for a few minutes.\\n\\n I didn\u0027t really want to know what was in it.\\n\\n After a while I opened it, and I spent the next three hours in my room going over the contents. They answered a few questions, but not nearly as many as they asked. Finally I put everything back in the envelope and returned it to its place under the rug.\\n\\n The cops would sweep Spinner Jablon under the rug, and that\u0027s what I wanted to do with his envelope. There were a lot of things I could do, and what I most wanted to do was nothing at all, so until my options had time to sort themselves out in my head the envelope could stay in its hiding place.\\n\\n I stretched out on the bed with a book, but after I\u0027d gone through a few pages I realized I was reading without paying attention. And my little room was beginning to feel even smaller than usual. I went out and walked around for a while, and then I hit a few places and had a few drinks. I started out in Polly\u0027s Cage, across the street from the hotel, then Kilcullen\u0027s, then Spiro and Antares. Somewhere along the way I stopped at a deli for a couple of sandwiches. I wound up in Armstrong\u0027s, and I was still there when Trina ended her shift. I told her to sit down and I\u0027d buy her a drink.\\n\\n \"But just one, Matt. I got places to go, people to see.\"\\n\\n \"So do I, but I don\u0027t want to go there and I don\u0027t want to see them.\"\\n\\n \"You could be just the slightest bit drunk.\"\\n\\n \"It\u0027s not impossible.\"\\n\\n I went to the bar and got our drinks. Plain bourbon for me, a vodka and tonic for her. I came back to the table, and she picked up her glass.\\n\\n She said, \"To crime?\"\\n\\n \"You\u0027ve really only got time for one?\"\\n\\n \"I don\u0027t even have time for the one, but one\u0027s got to be the limit.\"\\n\\n \"Then let\u0027s not make it to crime. Let\u0027s make it absent friends.\"\\n\\n Chapter 3\\n\\n I suppose I had a fair idea what was in the envelope before I opened it. When a man who sidesteps through life by keeping his ears open suddenly turns up wearing a three-hundred-dollar suit, it\u0027s not hard to figure out how he got it. After a lifetime of selling information, the Spinner had come up with something too good to sell. Instead of peddling information, he had turned to peddling silence. Blackmailers are richer than stool pigeons, because their commodity is not a one-time thing; they can rent it out to the same person over and over for a lifetime. \\n\\n","sourceLink":"https://allnovel.net/time-to-murder-and-create-matthew-scudder-2/page-2.html","bookId":2321,"book":{"id":2321,"title":"Time to Murder and Create (Matthew Scudder #2)","description":"Storyline: Time to Murder and Create (Matthew Scudder #2) \\n Small-time stoolie, Jake \"The Spinner\" Jablon, made a lot of new enemies when he switched careers, from informer to blackmailer. And the more \"clients, \" he figured, the more money - and more people eager to see him dead. So no one is surprised when the pigeon is found floating in the East River with his skull bashed in. And what\u0027s worse, no one cares - except Matthew Scudder. The ex-cop-turned-private-eye is no conscientious avenging angel. But he\u0027s willing to risk his own life and limb to confront Spinner\u0027s most murderously aggressive marks. A job\u0027s a job after all - and Scudder\u0027s been paid to find a killer - by the victim...in advance.\\n","cover":"https://allnovel.net/images/time-to-murder-and-create-matthew-scudder-2.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/time-to-murder-and-create-matthew-scudder-2.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:25:31 PM"}}
