{"id":97280,"no":6,"title":"Page 6","content":"\"That\u0027s right. But I\u0027m afraid I have a greater need for money than for sex.\"\n She nodded slowly. \"With Spinner,\" she said, \"I was trying to arrange something. I don\u0027t have much cash available now. I sold some jewelry, things of that sort, but just to buy time. I could probably raise some money if I had a little time. I mean some substantial money.\"\n \"How substantial?\"\n She ignored the question. \"Here\u0027s the problem. Look, I was on the game, you know that. It was temporary, it was what my psychiatrist calls a radical means of acting out inner anxieties and hostilities. I don\u0027t know what the fuck he\u0027s talking about, and I\u0027m not sure he does either. I\u0027m clean now, I\u0027m a respectable woman, I\u0027m a fucking jet-setter in a teensy way, but I know how the game works. Once you start paying, you wind up paying for the rest of your life.\"\n \"That\u0027s the usual pattern, all right.\"\n \"I don\u0027t want that pattern. I want to make one big buy and come up with everything. But it\u0027s hard to work out the mechanics of it.\"\n \"Because I could always have copies of the pictures.\"\n \"You could have copies. You could also just hold the information in your head, because the information is enough to wreck me.\"\n \"So you\u0027d need a guarantee that one payment was all you\u0027d ever have to make.\"\n \"That\u0027s right. I\u0027d need to have a hook stuck in you so that you wouldn\u0027t even think about keeping any pictures. Or about coming back for another shot at me.\"\n \"It\u0027s a problem,\" I agreed. \"You were trying to work it that way with Spinner?\"\n \"That\u0027s right. Neither of us could come up with an idea that the other liked, and in the meantime I stalled him with sex and small change.\" She licked her lip. \"It was rather interesting sex. His perceptions of me and all. I don\u0027t suppose a little man like that got much experience with young attractive women. And of course the social thing, the Park Avenue goddess, and at the same time he had those pictures and he knew things about me, so I became a special person for him. I didn\u0027t find him attractive. And I didn\u0027t like him, I didn\u0027t like his manner and I hated the hold he had over me. All the same, we did interesting things together. He was surprisingly inventive. I didn\u0027t like having to do things with him, but I liked doing them, if you know what I mean.\"\n I didn\u0027t say anything.\n \"I could tell you some of the things we did.\"\n \"Don\u0027t bother.\"\n \"It might turn you on, listening.\"\n \"I don\u0027t think so.\"\n \"You don\u0027t like me much, do you?\"\n \"Not too much, no. I can\u0027t really afford to like you, can I?\"\n She drank some of her drink, then licked her lips again. \"You wouldn\u0027t be the first cop I ever took to bed,\" she said. \"When you\u0027re in the game, that\u0027s a part of it. I don\u0027t think I ever met a cop who wasn\u0027t worried about his cock. That it was too small, that he wasn\u0027t good at using it. I suppose that\u0027s part of carrying a gun and a nightstick and all the rest of it, don\u0027t you think?\"\n \"Could be.\"\n \"Personally, I always found cops to be built the same as anyone else.\"\n \"I think we\u0027re getting off the subject, Mrs. Ethridge.\"\n \"Bev.\"\n \"I think we ought to talk about money. One large sum of money, say, and then you can get off the hook and I can let go of the fishing rod.\"\n \"How much money are we talking about?\"\n \"Fifty thousand dollars.\"\n I don\u0027t know what sort of figure she was expecting. I don\u0027t know if she and Spinner had talked price while they rolled around on expensive sheets. She pursed her lips and gave a silent whistle, indicating that the sum I\u0027d mentioned was a very large sum indeed.\n She said, \"You have expensive ideas.\"\n \"You pay it once and it\u0027s over.\"\n \"Back on Square A. How do I know that?\"\n \"Because when you pay over the money, I give you a handle on me. I did something a few years ago. I could go to jail for it for a long time. I can write out a confession giving all the details. I\u0027ll give it to you when you pay the fifty thou, along with the stuff Spinner has on you. That locks me in, keeps me from doing a thing.\"\n \"It wasn\u0027t just something like police corruption.\"\n \"No, it wasn\u0027t.\"\n \"You made somebody dead.\"\n I didn\u0027t say anything.\n She took her time thinking it over. She took out a cigarette, tapped its end on a well-manicured nail. I guess she was waiting for me to light it for her. I remained in character and let her light it for herself.\n Finally she said, \"It might work.\"\n \"I\u0027d be putting my neck in a noose. You wouldn\u0027t have to worry about me running out and yanking on the rope.\"\n She nodded. \"There\u0027s only one problem.\"\n \"The money?\"\n \"That\u0027s the problem. Couldn\u0027t we lower the price a little?\"\n \"I don\u0027t think so.\"\n \"I just don\u0027t have that kind of money.\"\n \"Your husband does.\"\n \"That doesn\u0027t put it in my handbag, Matt.\"\n \"I could always eliminate the middleman,\" I said. \"Sell the goods directly to him. He\u0027d pay.\"\n \"You bastard.\"\n \"Well? Wouldn\u0027t he?\"\n \"I\u0027ll get the money somewhere. You bastard. He probably wouldn\u0027t pay, as a matter of fact, and then your hold\u0027s gone, isn\u0027t it? Your hold and my life, and we both wind up with nothing, and are you sure you want to risk that?\"\n \"Not if I don\u0027t have to.\"\n \"Meaning if I come up with the money. You\u0027ve got to give me some time.\"\n \"Two weeks.\"\n She shook her head. \"At least a month.\"\n \"That\u0027s longer than I planned on staying in town.\"\n \"If I can have it faster, I will. Believe me, the faster you\u0027re off my back the better I like it. But it might take me a month.\"\n I told her a month would be all right but I hoped it wouldn\u0027t take that long. She told me I was a bastard and a son of a bitch, and then she turned abruptly seductive again and asked me if I wouldn\u0027t like to take her to bed anyway for the hell of it. I liked it better when she called me names.\n She said, \"I don\u0027t want you calling me. How can I get in touch with you?\"\n I gave her the name of my hotel. She tried not to show it, but it was obvious that my openness surprised her. Evidently the Spinner hadn\u0027t wanted her to know where she could find him.\n I didn\u0027t blame him.\n Chapter 7\n On his twenty-fifth birthday, Theodore Huysendahl had come into an inheritance of two and a half million dollars. A year later he\u0027d added another million and change by marrying Helen Godwynn, and in the next five years or so he\u0027d increased their total wealth to somewhere in the neighborhood of fifteen million dollars. At age thirty-two he sold his business interests, moved from a waterfront estate in Sands Point to a co-op apartment on Fifth Avenue in the Seventies, and devoted his life to public service. The President appointed him to a commission. The Mayor installed him as head of the Parks and Recreation Department. He gave good interviews and made good copy and the press loved him, and as a result he got his name in the papers a lot. For the past few years he\u0027d been making speeches all over the state, turning up at every Democratic fund-raising dinner, calling press conferences all over the place, guesting occasionally on television talk shows. He always said that he was not running for governor, and I don\u0027t think even his own dog was dumb enough to buy that one. He was running, and running very hard, and he had a lot of money to spend and a lot of political favors to call, and he was tall and good-looking and radiantly charming, and if he had a political position, which was doubtful, it was not far enough to either the left or the right to alienate voters in the great middle.\n The smart money gave him one shot in three at the nomination, and if he got that far he had a very strong chance for election. And he was only forty-one. He was probably already looking beyond Albany in the direction of Washington.\n A handful of nasty little photographs could end all that in a minute.\n He had an office in City Hall. I took the subway down to Chambers Street and headed over there, but first I detoured and walked up Centre Street and stood in front of Police Headquarters for a few minutes. There was a bar across the street where we used to go before or after appearing in the Criminal Courts Building. It was a little early for a drink, though, and I didn\u0027t much want to run into anyone, so I went over to City Hall and managed to find Huysendahl\u0027s office.\n His secretary was an older woman with wiry gray hair and sharp blue eyes. I told her I wanted to see him, and she asked my name.\n I took out my silver dollar. \"Watch closely,\" I said, and set it spinning on the corner of her desk. \"Now just tell Mr. Huysendahl exactly what I\u0027ve done, and that I\u0027d like to see him in private. Now.\"\n She scrutinized my face for a moment, probably in an attempt to assess my sanity. Then she reached for the telephone, but I put my hand gently atop hers.\n \"Tell him in person,\" I said.\n Another long sharp look, with her head cocked slightly to one side. Then, without quite shrugging, she got up and went into his office, closing the door after her.\n She wasn\u0027t in there long. She came out looking puzzled and told me Mr. Huysendahl would see me. I\u0027d already hung my coat on a metal rack. I opened Huysendahl\u0027s door, went in, closed it after me.\n He started talking before he raised his eyes from the paper he was reading. He said, \"I thought it was agreed that you were not to come here. I thought we established-\"\n Then he looked up and saw me, and something happened to his face.\n He said, \"You\u0027re not-\"\n I flipped the dollar into the air and caught it. \"I\u0027m not George Raft, either,\" I said. \"Who were you expecting?\"\n He looked at me, and I tried to get something out of his face. He looked even better than his newspaper photos, and a lot better than the candid shots I had of him. He was sitting behind a gray steel desk in an office furnished with standard City-issue goods. He could have afforded to redecorate it himself-a lot of people in his position did that. I don\u0027t know what it said about him that he hadn\u0027t, or what it was supposed to say.\n I said, \"Is that today\u0027s Times? If you were expecting a different man with a silver dollar, you couldn\u0027t have read the paper very carefully. Third page of the second section, toward the bottom of the page.\"\n \"I don\u0027t understand what this is all about.\"\n I pointed at the paper. \"Go ahead. Third page, second section.\"\n I stayed on my feet while he found the story and read it. I\u0027d seen it myself over breakfast, and I might have missed it if I hadn\u0027t been looking for it. I hadn\u0027t known whether it would make the paper or not, but there were three paragraphs identifying the corpse from the East River as Jacob \"Spinner\" Jablon and giving a few of the highlights of his career.\n I watched carefully while Huysendahl read the squib. There was no way his reaction could have been anything other than legitimate. The color drained instantly from his face, and a pulse hammered in his temple. His hands clenched so violently that the paper tore. It certainly seemed to mean that he hadn\u0027t known Spinner was dead, but it could also mean he hadn\u0027t expected the body to come up and was suddenly realizing what a pot he was in.\n \"God,\" he said. \"That\u0027s what I was afraid of. That\u0027s why I wanted-oh, Christ!\" \n","sourceLink":"https://allnovel.net/time-to-murder-and-create-matthew-scudder-2/page-6.html","bookId":2321,"book":{"id":2321,"title":"Time to Murder and Create (Matthew Scudder #2)","description":"Storyline: \n Time to Murder and Create (Matthew Scudder #2) \n Small-time stoolie, Jake \"The Spinner\" Jablon, made a lot of new enemies when he switched careers, from informer to blackmailer. And the more \"clients, \" he figured, the more money - and more people eager to see him dead. So no one is surprised when the pigeon is found floating in the East River with his skull bashed in. And what\u0027s worse, no one cares - except Matthew Scudder. The ex-cop-turned-private-eye is no conscientious avenging angel. But he\u0027s willing to risk his own life and limb to confront Spinner\u0027s most murderously aggressive marks. A job\u0027s a job after all - and Scudder\u0027s been paid to find a killer - by the victim...in advance.\n \n","cover":"https://allnovel.net/images/time-to-murder-and-create-matthew-scudder-2.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/time-to-murder-and-create-matthew-scudder-2.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:25:31 PM"}}
