{"id":66759,"no":16,"title":"Page 16","content":"Jack sighed, grateful he didn’t need to lead into the subject delicately. “Have you got a few minutes?”\n “Sure. Come on in. Peggy’s visiting her sister, but I’m sure there’s still coffee in the pot.”\n Jack was grateful. He was feeling unsettled, and even after ten years without a drink, the urge still came, especially at times like this. The meetings helped, but talking to Bob would give him a sense of perspective. It’d been a long while since the cravings had hit this hard.\n “How are things with Eric?” Bob asked, heading into the kitchen. He paused on the back porch and removed his sweater, which he hung on a hook there. Then he led the way into the large, spacious room. Despite its size, the kitchen was warm and inviting, with its oak table, its woven rug on the polished floor and bunches of drying herbs by the window.\n “Eric’s still with me. He doesn’t like it any better than I do, but he’s stuck until he can work out this mess between him and Shelly.”\n “What’s going on with him and the girl?”\n The hell if Jack knew. Twice now, at Jack’s suggestion, Eric had phoned Shelly. Jack had made himself scarce, but it didn’t take a psychic to figure out that the conversations hadn’t gone well. Within minutes the calls were over, leaving Eric more depressed than ever.\n “I didn’t come to talk about Eric,” Jack told his friend. “I’ve got a problem with Olivia.”\n “What’s up?” Bob silently offered him coffee, which Jack refused. Apparently Bob thought better of it himself and reached inside the refrigerator for a cold soda. Jack declined that, as well.\n “I’m crazy about Olivia,” Jack admitted, although this wasn’t news to Bob, who’d encouraged the relationship from the first.\n “I know.” Bob opened the soda and leaned against the counter as he waited for Jack to continue.\n Jack remained standing, too. Soon he was pacing. “I used to think she felt the same way about me.”\n “What changed her mind?”\n “That’s just it,” Jack said. “I don’t know. I had to break our dinner date on her birthday when Eric showed up unexpectedly. She seemed to understand, but lately…” He shook his head, unsure how to put into words what he sensed. “I keep thinking she’s had a change of heart and is looking for the right moment to tell me to take a flying leap into some cow pasture.”\n Bob considered his words. “So you’re waiting and wondering and making yourself insane, anticipating the end—even though she hasn’t actually said anything about it.”\n “Yeah, I guess I am,” Jack conceded.\n “Wouldn’t you rather know what she’s thinking?”\n Jack let the question roll around in his mind, and decided that, in all honesty, he didn’t. He wanted to hold on to Olivia as long as he could because, dammit, he was falling in love with her. “She’s preoccupied with Justine’s wedding reception,” he said, offering an excuse.\n “You didn’t answer the question. In fact, you’re skirting the issue entirely and I know why. You don’t want to face the truth, in case it isn’t what you want to hear.”\n “She might want to end it, and I don’t. Like I told you before, I think I’m in love with her.”\n “You’re right—Olivia might decide to call it quits. But if she does, you’ll deal with it.”\n Bob had more confidence in him than Jack did. “I don’t want to lose her.”\n “Wouldn’t knowing be better than all this doubting?”\n Well…yes, he supposed so. “Maybe,” he muttered. The only way to find out was to ask Olivia outright. He might not like the answer, as Bob had said, but this anxiety was damned hard to cope with. If she was going to reject him, he might as well get used to it. “Okay, I’ll do it. I’ll talk to Olivia.” He stopped pacing and nodded at his friend. “Thanks.”\n Bob nodded solemnly in response, then downed the last of his cola and walked Jack to his car.\n Now that he’d made up his mind, Jack decided he had to take immediate action. He checked his watch: four-thirty. Olivia should be home from the courthouse. He drove directly to her house on Lighthouse Road\n . He hadn’t phoned her all week because he was afraid of what she might say; she hadn’t called him, either. Parking in front of her house, he cursed his own weakness, his own need. This would be a lot easier if he didn’t care so much. One thing he knew—if she told him to get lost, he wasn’t going to reach for a drink.\n He rang the doorbell and waited.\n The next millennium came and went before Olivia opened the door. She held the phone to her ear, but when she saw it was Jack, she smiled, unlatched the screen door and gestured him inside, still talking.\n “I’m sorry Marge can’t make it, Stan, but I’m sure Justine will understand.”\n Ah, so she was speaking to her ex-husband. Jack had met Stan several months earlier, just before he’d gotten serious about Olivia. Her ex was a pompous SOB as far as Jack was concerned.\n “Can you get here before three?” She smiled apologetically at Jack, who sat down on the sofa.\n “Of course your aunt Louise is invited.” She rolled her eyes and made a wind-it-up motion with her hand, as though eager to get her ex off the line. “I have to go—I have company…Jack. You remember Jack, don’t you? You don’t?”\n Liar, Jack thought. Her ex knew exactly who he was.\n She laughed but Jack couldn’t tell what was so funny. No doubt old Stan had made some derogatory remark about him.\n “I have to go, Stan,” she said again, a little more loudly this time. “I’ll see you next weekend with your aunt Louise. Give Marge my best. Bye.”\n A second later, she clicked the off button on the portable phone and sank onto the sofa next to Jack. “Were we supposed to meet this afternoon?”\n “Ah…no, but I hadn’t seen you in a while. I’ve missed you.”\n “I’ve missed you, too. I swear this reception is going to be the death of me. But Justine’s my only daughter and I want it to be perfect for her and Seth. She frowned slightly. “You did get the invitation, didn’t you?”\n Jack nodded. He was beginning to feel better already. “You look worn-out,” he told her. Maybe she’d noticed that he was emotionally spent himself, but he didn’t plan to drag Eric into the conversation. This was about him and Olivia, not their families or their obligations.\n “I am worn-out,” she agreed. “I can’t believe how much time and organization a simple wedding reception requires. I hope both you and Eric will come.”\n It felt good to be invited. “If you want.”\n “Of course I want you there. I’m going to need all the moral support I can get.” The phone in her hand rang and she pushed the Talk button and raised the receiver to her ear. “Mom, sorry, I’m on my way. Yes, yes, tell the caterers I’ll be there in ten minutes.” She clicked off the phone, then leaped up from the sofa and started toward the kitchen.\n “You’re busy.” Jack stood, thinking it would be best if he left.\n “I’m sorry, Jack.” She turned abruptly to face him. “Can we meet later?”\n His heart sank. “I’m covering a school board meeting tonight.”\n She nodded, although he doubted she’d heard him.\n “Wait,” he said, and took her by the shoulders.\n She seemed mildly startled but smiled when she realized he intended to kiss her. Her arms slipped around his neck and she met his mouth with her own.\n Slowly, after their kiss had ended, he eased his mouth from hers. “I needed that.”\n All too briefly, she pressed her head to his shoulder. “So did I.”\n Justine was exhausted but jubilant as she held open the apartment door while Seth unloaded the last of the wedding gifts from the car. The reception had been wonderful—she couldn’t believe her mother and grandmother had pulled it off. The entire afternoon had been as close to perfect as she could imagine. The food was incredible, the music lovely, the atmosphere festive. She’d met Seth’s relatives and he’d met all of hers. His were easy to locate in a crowd; they were the big, husky, outgoing Swedes, while hers were comparatively restrained and tended to group together.\n “I don’t know how Mom and Grandma did it.” Justine said, sitting down on the pale-blue sofa and propping her feet on the matching footstool. “I think this was the most magical day of my life, other than our wedding day, of course.” She found their elopement wildly romantic.\n Seth sat beside her and leaned his head against the sofa back. His large feet, crossed at the ankles, joined hers on the footstool. He seemed as exhausted as Justine.\n “I feel so spoiled,” she whispered.\n Seth slid his arm around her. “I didn’t know I had that many relatives,” he muttered.\n “It’s been years since I saw my dad’s aunt Louise.”\n Seth kissed her neck and drew her closer against him. “Second thoughts?”\n Justine smiled. “Not a one. You?”\n “None,” Seth vowed. “I love my wife.”\n Seth had been back from Alaska for almost three weeks and their lives had been a whirlwind from the moment he stepped off the plane. Preparing for the reception had taken up some of their time and adjusting their lives to each other’s had been more of a challenge than she’d anticipated. Seth worked at the marina and his hours changed from week to week. Slowly, he’d started moving his personal items into her place. Living together involved all kinds of accommodations, some of them delightfully easy and some more difficult, since neither of them was used to sharing decisions or routines with another person.\n Still, every time Justine woke up and realized the man in her bed was her husband, she became so giddy with happiness she couldn’t go back to sleep. They found ways to amuse themselves in those early-morning hours. Unfortunately that made for extra-long days at the bank and she arrived home exhausted, her eyes stinging from lack of sleep.\n “Who was that man with Grace Sherman?” Seth asked.\n “Cliff Harding,” Justine told him and giggled. “She went out of her way to tell me they weren’t dating, but I think they must be.”\n “Has anyone heard from Dan?”\n “Not that I know of. Mom said the divorce will be final the Monday before Thanksgiving.”\n “That’s next week.”\n “I know.”\n The idea of divorce had a sobering effect on Justine. Her father had been at the reception, but Marge wasn’t. She wondered if there was anything wrong between her father and his second wife. If so, she didn’t want to know about it. Maybe Marge had purposely stayed away, realizing the situation would be awkward. Jack Griffin had been one of the first to arrive and then stood in the background while her mother and father took center stage. It must have been difficult for him, since Olivia had barely had a moment to spend with him. \n","sourceLink":"https://allnovel.net/204-rosewood-lane-cedar-cove-2/page-16.html","bookId":1942,"book":{"id":1942,"title":"204 Rosewood Lane (Cedar Cove #2)","description":"Storyline: \n 204 Rosewood Lane (Cedar Cove #2) \n Grace Sherman \n 204 Rosewood Lane \n Cedar Cove, Washington \n Dear Listener, \n If you\u0027ve been to Cedar Cove before we\u0027ve probably met. You can usually find me either at home or at the public library, where I work. I\u0027ve lived in this town all my life and raised two daughters here. But my husband and I - well, about six months ago, he disappeared. Just…disappeared. Where\u0027s Dan? Why did he go? Who\u0027s he with? Will I ever find out? \n My hometown, my family and friends, bring me comfort during this difficult time. Comfort and a sense of shelter. I\u0027m continually reminded that life can and does go on. For instance, everyone\u0027s been discussing weddings and babies lately. Justine - the only daughter of my best friend, Olivia Lockhart - impulsively got married a little while ago. My own daughter Kelly recently had a baby. Unfortunately, she refuses to accept that Dan might not return to see his first grandchild. My older daughter, Maryellen, is more realistic. I think she\u0027s seeing a new man, but for some reason she won\u0027t tell me who it is. \n Then there\u0027s Jack, who\u0027s been pursuing a romance with Olivia, and his son, Eric, and Eric\u0027s girlfriend, Shelly (I think she\u0027s pregnant), and Zach and Rosemary Cox, whose marriage is reputedly on the skids and…Well, just come on over and we\u0027ll talk! \n Grace\n \n","cover":"https://allnovel.net/images/204-rosewood-lane-cedar-cove-2.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/204-rosewood-lane-cedar-cove-2.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:01:42 AM"}}
