{"id":66793,"no":50,"title":"Page 50","content":"“No problem, I’ll be on the road by eight. Sooner if you want.”\\n\\n “Any time before nine will be okay.”\\n\\n Stan parked his BMW in the back by the garage and before he went upstairs, Olivia gave him a fresh set of towels.\\n\\n This was the first time they’d slept in the same house since their divorce. As she readied for bed, she wondered if she’d done the right thing by inviting him to stay.\\n\\n In the morning, her doubts disappeared. She was awake at seven and while she brewed coffee she heard the shower running upstairs. Humming to herself, she was surprised to hear someone ringing her doorbell.\\n\\n She ran to answer it.\\n\\n “J-Jack?” she stammered, instantly afraid he’d hear Stan and assume the worst.\\n\\n “I come bearing gifts.” He held two containers of coffee and a white bakery sack. “Maple bars,” he said enticingly. “Your favorite. I thought we’d have breakfast here before we head out.”\\n\\n “I—”\\n\\n “Olivia,” Stan called as he bounded down the stairs. He stopped cold when he saw Jack. He wore one of Justine’s old housecoats and a pair of her fuzzy slippers.\\n\\n “You remember Stan, don’t you?” she muttered, which was probably the most inane thing she could have said.\\n\\n “Oh yes, I remember Stan.” Jack’s eyes were cold and narrow.\\n\\n Stan, doing his best to appear dignified, wrapped the silky housecoat more securely around him. “Obviously, my timing couldn’t have been worse.”\\n\\n “On the contrary,” Jack said. “Your timing couldn’t have been better.”\\n\\n “Sorry.” Stan cast an apologetic look at Olivia and hurried back up the stairs.\\n\\n Jack and Olivia faced each other. “You can’t believe that Stan and I…slept together.” Surely Jack had more faith in her than that!\\n\\n “Whatever, Olivia.”\\n\\n This was such a juvenile response she didn’t know how to react.\\n\\n “He wants you back.”\\n\\n She’d heard that before. But Jack didn’t know how badly Stan was hurting. This wasn’t what it looked like!\\n\\n “You can believe me or not,” Jack continued. “That’s completely up to you. But I’ll tell you something. It’s either him or me. You decide.”\\n\\n “You want me to tell my ex-husband that I won’t see him again?”\\n\\n Surely even Jack must realize he had no right to make such a demand.\\n\\n “That’s exactly what I want, or we’re through.”\\n\\n “I don’t deal well with ultimatums,” Olivia told him.\\n\\n Jack set the coffee and the maple bars on the dining room table. “That tells me everything I need to know.” He turned and headed out the door.\\n\\n Olivia was so shocked she didn’t know what to do. Shocked and then angry. It took her a full ten seconds to decide to chase after him. By then Jack had reached his dilapidated old car.\\n\\n “You say Stan wants me back?”\\n\\n “He’s made that plain for months.” Jack’s hand was on his door.\\n\\n How dare he just walk away like this! If what he said was true, then the least he could do was show some gumption.\\n\\n “Jack Griffin, do you care about me at all?” she cried.\\n\\n He turned around and glared at her. “It’s him or me. You have to decide.”\\n\\n So Mr. Hotshot was still playing that game. “You’re wrong. I’m not the one making the decisions here, it’s you. You’re the one who’s running away with your tail between your legs. You’re the one who’s tossing out ultimatums.”\\n\\n “What do you want me to do?”\\n\\n Finally a question she could answer. “What I want, Jack Griffin, is for you to fight for me. Prove to me that you’re worthy of all the faith I have in you.”\\n\\n Nineteen\\n\\n Maryellen felt about as pregnant as she could get. It was hard to believe that she had another six weeks to go before her baby was due. She hadn’t heard from Jon since mid-June, the afternoon she’d buried her father. She wasn’t foolish enough to believe he’d relented and wouldn’t follow through with legal action. In the three weeks since, she’d been constantly alert, waiting for him to make good on his threats.\\n\\n With summer in full swing, Maryellen had been busy with the steady stream of tourists. The gallery was doing well, but several of her summer customers were disappointed to find she no longer carried Jon’s work. She’d heard, via the grapevine, that he was selling exceptionally well at the BernardGallery in Seattle. Word had it that his prints sold out almost as soon as he delivered them. The problem was the same as when she’d carried his work; his deliveries were sporadic and demand far outweighed supply. She appreciated the reasons in a way she hadn’t before. He used to cook at André’s and now worked five long days a week at The Lighthouse, which was quickly gaining a reputation as one of the area’s finest restaurants. Seth and Justine’s new venture appeared to be thriving with Jon at the helm.\\n\\n Maryellen was pleased for the couple’s success. What bothered her, what downright irritated her, was Jon’s golden touch. He was too perfect, too good. Talent spilled out of him like water from an overfilled glass. He designed and built his own home, took brilliant photographs and was a talented chef. Other than his lack of minor social skills—which could, in fact, be seen as evidence of his sincerity and therefore a plus—the man had no flaws. If he did take her to court over shared custody of their child, there was every likelihood he’d win. Unless she was able to dig up some dirt in his past…She’d sensed secrets about him and he’d as much as admitted there was something to use against him.\\n\\n The thought unsettled her. Battling for custody in a courtroom wasn’t the way she wanted it. The plan had been to raise her child alone. She’d assumed that when and if Jon ever learned of the baby, he’d be relieved she hadn’t involved him. But—as with so much else in her life—she’d been wrong.\\n\\n By closing time, Maryellen was tired and out of sorts. Her feet hurt, she felt fat and ungainly, and the last thing she felt like doing was fixing dinner. Fish and chips appealed to her, so she stopped at a small café near ColchesterPark that served some of the best.\\n\\n She sat at an outside table, across the street from the water, with the Seattle skyline in the distance. Elevating her feet on the opposite bench, she set the cardboard container on the table and then licked her fingers, savoring the salty taste of hot chips. A pickup pulled into the lot, one she instantly recognized, and Maryellen froze. No, please, no. Jon should be at The Lighthouse, he should be taking photographs or working on his house. He should be anywhere except here.\\n\\n Jon seemed equally surprised to see her. He climbed out and stood beside his truck for a moment, appearing uncertain as to whether he should acknowledge her.\\n\\n “I didn’t follow you if that’s what you’re thinking,” he said in an expressionless voice.\\n\\n “I know.” She refused to allow him to ruin her meal and reached for the saltshaker.\\n\\n “Justine’s having all kinds of water retention problems because of salt,” he said, frowning. “Should you be using it?”\\n\\n “I’m completely healthy.” How like a man to try to tell her what to do. Her irritation flared up and just as quickly died.\\n\\n “And the baby?” He focused on her stomach.\\n\\n “She’s developing nicely.”\\n\\n “She?”\\n\\n Maryellen nodded. “I’ve had periodic ultrasounds because of my age.”\\n\\n “You knew all along?”\\n\\n “No—I had them tell me just recently.”\\n\\n “A girl.” He said it as if in absolute awe. “Have you picked out names yet?”\\n\\n “I was thinking of Catherine Grace.”\\n\\n His face softened. “My mother’s name was Katie. She’d be very pleased if she knew.”\\n\\n “You can tell her.” She didn’t think he intended to keep the baby a secret. Perhaps this small concession on her part would convince him of her good faith.\\n\\n “My mother’s been dead fifteen years.”\\n\\n “I’m sorry.” Maryellen instantly regretted saying anything.\\n\\n “I want my daughter in my life,” Jon said, his voice firm.\\n\\n “Perhaps we could reach a compromise.” It hadn’t been part of her plan, but she didn’t want to drag this through the courts, either.\\n\\n “Such as?”\\n\\n “Weekends?” she suggested.\\n\\n His face as void of emotion as he considered her offer.\\n\\n “I don’t want to shuffle the baby back and forth—days with you, nights with me,” she explained nervously. “I want her life to be stable and full of love. Please try to understand.”\\n\\n His reluctant nod followed. “All right. But my weekends sometimes aren’t the same as yours.”\\n\\n “We can work around that.”\\n\\n “Then we’re in agreement about the baby and me?” he asked, as though he wanted to be sure there was no misunderstanding. “She’ll be with me two nights a week.”\\n\\n “Yes.”\\n\\n “Thank you.” He seemed relieved and perhaps even moved by her compromise. “I plan on being a good father.” He turned toward his truck, his reason for stopping at the café apparently forgotten. “Go easy on the salt, you hear.”\\n\\n “Yes, sir.” Maryellen gave a mock salute and smiled, and to her astonishment, Jon smiled back. He got into his truck and drove off, but as his vehicle disappeared from view she realized that she’d done Jon Bowman a disservice. He genuinely cared for their unborn child—and for her. Throughout this ordeal he’d been honorable and kind. She was the one who’d mistreated him.\\n\\n Maryellen’s appetite vanished, and she pushed her meal away. The baby fidgeted inside her, stretching and kicking as if to remind her that every child deserved a mother and a father.\\n\\n “All in due course, Catherine Grace,” she murmured, rubbing her abdomen, “all in due course.”\\n\\n For five months Roy McAfee had searched for information on the John Doe who’d died at the Beldons’ bed-and-breakfast. So far, he’d learned that the airline ticket had come from a small town in southern Florida. This same town was where “James Whitcomb” had lived, according to his counterfeit ID. Roy had traveled there, showed the man’s picture to authorities in the area and come back with nothing.\\n\\n His next angle had been to contact plastic surgeons in Florida, but none recognized the work or knew of the case. One physician suggested it seemed to have been done twenty or thirty years ago, as techniques had changed over time. While that was interesting, it wasn’t especially helpful.\\n\\n Six months after his death, the John Doe had yet to be identified. And despite the days and nights he’d logged on this case, Roy was no further ahead. The toxicology report had revealed nothing to unravel the mystery. Because of budget restraints, Troy Davis hadn’t ordered more extensive tests.\\n\\n Roy knew the county didn’t have a lot of extra cash—and curiosity was definitely not an item in their budget. With no clear evidence of foul play, there was nothing to investigate. \\n\\n","sourceLink":"https://allnovel.net/204-rosewood-lane-cedar-cove-2/page-50.html","bookId":1942,"book":{"id":1942,"title":"204 Rosewood Lane (Cedar Cove #2)","description":"Storyline: 204 Rosewood Lane (Cedar Cove #2) \\n Grace Sherman \\n 204 Rosewood Lane \\n Cedar Cove, Washington \\n Dear Listener, \\n If you\u0027ve been to Cedar Cove before we\u0027ve probably met. You can usually find me either at home or at the public library, where I work. I\u0027ve lived in this town all my life and raised two daughters here. But my husband and I - well, about six months ago, he disappeared. Just…disappeared. Where\u0027s Dan? Why did he go? Who\u0027s he with? Will I ever find out? \\n My hometown, my family and friends, bring me comfort during this difficult time. Comfort and a sense of shelter. I\u0027m continually reminded that life can and does go on. For instance, everyone\u0027s been discussing weddings and babies lately. Justine - the only daughter of my best friend, Olivia Lockhart - impulsively got married a little while ago. My own daughter Kelly recently had a baby. Unfortunately, she refuses to accept that Dan might not return to see his first grandchild. My older daughter, Maryellen, is more realistic. I think she\u0027s seeing a new man, but for some reason she won\u0027t tell me who it is. \\n Then there\u0027s Jack, who\u0027s been pursuing a romance with Olivia, and his son, Eric, and Eric\u0027s girlfriend, Shelly (I think she\u0027s pregnant), and Zach and Rosemary Cox, whose marriage is reputedly on the skids and…Well, just come on over and we\u0027ll talk! \\n Grace\\n","cover":"https://allnovel.net/images/204-rosewood-lane-cedar-cove-2.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/204-rosewood-lane-cedar-cove-2.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:01:42 AM"}}
