{"id":42733,"no":7,"title":"VI. NABATHEANS.","content":"AUTHORITIES: \n \n Lassen, Quatremère, Laborde, Oppert, Chwolsohn, Perceval, etc. \n \n In the gray morning of time, behind the obscurity hovering over the origin of Assyria, and preceding even the first great epoch of Babylon, dawns the fully-developed Nabathean civilization. In proportion as scientific investigation imagines it has reached a positive epoch in the ethnology and history of our race, a new cloud ever rises behind it, which is but of this service—unerringly to indicate the limits of the space already investigated. Thus legends, traditions, and tracings sink helpless and hopeless into mythus, and the investigator is lost in the \"dark backward and abysm of time.\" The Eastern legends hanging over Fore-Asia (or the lands between the Himalayas and Assyria), present traditions of epochs and civilizations which had traversed the periods of youth, maturity, and decline, before Brahmins, Assyrians, or Hebrews even dawned on the historical horizon. \n \n The Nabatheans are supposed to have been Shemites or pure Chaldeans.[9] They dwelt in ancient Mes[Pg 64]opotamia, between the Euphrates and the Tigris, and also in what afterward constituted a part of Syria and Assyria; and their branches or colonies extended to Arabia and to eastern Mesopotamia. They were probably the primitive white dwellers in these regions, and the founders of Babylon and of her first—almost pre-historic—epoch of glory, down to the time when they were conquered by the Assyrians or by Aryanized Nabatheans and Chaldeans. \n \n According to ancient eastern writers, they invented and taught to their neighbors the art of tilling the soil, and from this circumstance they are said to have derived their name. At all events they were the primitive cultivators of these lands, and agriculture seems to have been their principal pursuit and mode of livelihood. This highly-flourishing Nabathean civ[Pg 65]ilization underlaid the Assyrian and second Babylonian civilizations, and powerfully influenced the primitive Hebrew writers. Arphaxad, mentioned in Genesis, signifies in Chaldaic, stronghold, city, civilization, and this, too, at the earliest so-called patriarchal epoch. To the Nabatheans belongs the great work of irrigating Euphratia, by which these heretofore barren and uncultivated plains were made, for more than forty centuries, the most fertile region of the ancient world. It is asserted, too, by the oldest authorities, that their language was highly developed at a time when the other Shemitic tribes and nations only lisped their rude tongue, or attempted to spell the symbols invented, in all probability, by the Nabatheans. Some attribute to them the invention of the arrow-headed characters, while others suppose that the Assyrians (of whom hereafter), first devised them, or at all events, first applied this Tartar invention for the use and preservation of the Nabathean language. Fragments from the writings of Kouthai—a Nabathean, who lived long before the destruction of Nineveh—show that most of the sciences, such as mathematics, astronomy, chronology, etc., were cultivated by them to a high degree, and that they were great lovers of music and other fine arts. \n \n Their historical records are far richer and more complete than any other existing records which relate to those distant and as yet all but incomprehensible epochs and events. In these relics many details of the early life of that time are embodied, principally[Pg 66] relating, however, to agriculture, and from which, doubtless, the Greek writers, as Dionysius of Halicarnassus, and Strabo, derived their knowledge of the superiority and paramount importance of Nabathean agricultural science, on which, as already remarked, their whole civilization was based. Nowhere, however, in these venerable Nabathean fragments is slavery or the slave ever mentioned, and still less as constituting the basis of domestic husbandry and field labor; but freemen and freeholders only are alluded to as cultivating the land and reaping the rewards of their toil; thus furnishing an additional and most forcible proof that human slavery is not coeval with the existence of society. \n \n Indeed, it may be stated as a general rule, clearly confirmed by history, that agriculture never can flourish under slave labor, nor even under villanage. It never did so in antiquity and it never has done so in modern times. In proportion as Egypt, Syria and Assyria fell a prey to political servitude and her twin-sister, or rather generator, domestic slavery, did their agriculture deteriorate and decay. In proportion as the nations of modern Europe have emerged from slavery and serfdom, has agriculture become a civilizing agency, progressive, rational and scientific. England, Germany, France, Switzerland, Belgium and Flanders, are living witnesses thereof; and, on the other side, Poland, Russia, Hungary, Bulgaria, and the Danubian Principalities—all possessed of the most fertile soils—scarce emerge from social, political[Pg 67] and rural barbarity. The Moors and the Moriscoes were not slaves when they cultivated Andalusia in a manner never equalled. And what a wide difference between the agriculture of the free and slave sections of the United States! and that too, though the region of slave culture enjoys advantages both in climate and soil. The halting and uncertain advances made in the slave country, are but dimly breaking rays from the free, enlightened northern states. \n \n Thus do the oldest and the newest teach one lesson and tend to one result. \n \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2702/74278.html","bookId":1456,"book":{"id":1456,"title":"Slavery in History","description":"简介： For the first time in the annals of humanity, domestic slavery, or the system of chattelhood and traffic in man, is erected into a religious, social and political creed. This new creed has its thaumaturgus, its temples, its altars, its worship, its d...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2702","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
