{"id":90524,"no":27,"title":"Page 27","content":"As soon as we exited the car, a small woman with coifed hair, dressed in a sweet, pastel pinafore dress under an apron, and wiping her hands with a dishcloth, came running out of the house screaming, “You’re here! You’re finally here!” What shocked me even more was that this little woman basically pushed her son out of the way to scoop me up in a warm hug, and said in the best southern twang I’d ever heard, “Lily, child, I wondered when I’d be seeing you! Oh dear. The things you’ve gone through,” she clucked. “Come inside and let Mama feed you.” Ignoring her now-laughing son, she smacked him with the dish towel, took me by the hand, and led me inside her gorgeous house in the middle of nowhere. Trudging behind us with his cane, he called out, “Mama, you make your biscuits?” She puffed out her chest. “Darn tootin’ I made my biscuits. Gravy too, baby.” She turned to me. “Just the way he likes ‘em,” she said, patting my hand. We visited with Clare, who insisted I call her Mama, for two days. By the end of the visit, I was seriously sad to go. I loved having someone to talk about Nox with. We sat for lunch that last day, and I poured some iced tea for us all. When I went to add sugar to Nox’s, he shook his head and grinned, “Sweet tea’s for pussies, babe.” Both of us scrunching our noses at his crudeness, Clare uttered, “I know you’re not a child anymore, Adam, but you’re not too old for your mama to smack you upside the head. You’d do best to remember that.” Then she eyed her son as she said, “Pass me the sugar, sugar. Mama likes her tea sweet. And I’m no pussy, thank you very much.” Later that day, Clare and I sat out on the porch while Nox rested. He was still at the stage of becoming exhausted pretty quickly, and the travelling really took it out of him. Finally having some time alone, I asked her, “What was he like as a kid?” A wistful smile graced her face. “He was a fussy baby. Even back then, he was demanding.” She chuckled. “I always knew he wouldn’t lead a regular life. He was always protecting or helping someone. Always knew he was destined for bigger things, my Adam was.” Turning to me, she said in complete awe, “He was exceptional. Good at everything. Learned at a quick pace. Like a sponge. Just soaking up information. Sharp as a tack,” she laughed. “Lord knows he didn’t get that from his mama. I’m a simple girl, from a simple town, with simple needs. My Adam…he was much more.” I sat there listening with a smile until she said, “That’s how I knew you were special.” My eyes started to burn, but she went on, “Adam has a way of surrounding himself with special people. Rock and Boo are special, just like him, and when he said he’d met a girl…” She looked over at me with a knowing smile. “I knew he’d met her. That one person everyone looks for. They search and search, and some die trying to find ‘em. And when you finally meet them, something inside of you says ‘Oh, there you are. I’ve been looking for you. And I didn’t even know it.’” By this point, I was silently blubbering. She explained, “See, for me, it was Adam’s daddy. I didn’t have him for very long before I lost him, but he was that person. I knew I’d never love like that again. And I didn’t need to because that love…I still have it inside of me. It makes every hard day a little easier.” I said through shuddering breaths, “You’re a very wise woman, Clare.” And she laughed. “Dear lord, Lily! No one ever accused me of being wise. And stop calling me Clare. I like when you call me Mama.” Smiling out into fresh air, I closed my eyes and responded quietly, “Okay, Mama.” Which brings us to now. Staring out the windshield, I mutter, “Oh dear God, this is going to awkward.” Nox chuckles, “No it won’t. Stop being dramatic.” Scowling at him, I lean across the seat and punch him in the arm. He mock-blocks me and laughs, “Hey, no fighting the cripple!” My eyes flash. Reaching over again, I punch him twice more while he laughs. I hate that he calls himself that. I will never see him as an invalid or cripple. He’s just…Nox. Exiting the car, we reach the front door, and I’m glad I asked Terah to prepare Mom and Dad for meeting Nox. I didn’t want them being shocked or to ask stupid questions that he couldn’t answer. My dad worried me the most. I wondered how he’d react to meeting the person who stole his daughter away. Holding Nox by the hand, I reach forward to press the doorbell when the door swings open. Terah runs to me, wrapping me up tight and screeching, “Oh my God! I can’t believe this! I’m so fucking happy for you!” Releasing me suddenly, she runs over to a now freaked-out Nox and throws her arms around him, yelling, “I’m so glad you’re not dead anymore!” Nox chuckles silently, and Terah looks up at him seriously. “No, I mean it. That totally sucked!” He laughs harder, putting an arm around her, smiling. “Me, too. It’s good to be alive.” Terah bounces up and down while saying in a sing-song voice, “And getting married!” Shaking my head at her, I utter, “Calm down, dorkette. We haven’t told anyone yet.” Suddenly, a tall, handsome man appears at the front door. He has light brown hair, laughing brown eyes, and an easy smile. Taking one look at Nox, he walks forward, taking him into a firm hug. Nox hugs him back, and they talk close for a while. This must be Jonathon. Releasing Nox, he comes forward, smiling with open arms. Feeling shy, I walk forward and allow him to hug me tight. He kisses my head and my heart aches. Such a sweet gesture and I don’t even know him. Jon pulls back a little and says, “Goddamn, those are some genes. Guess your dad’s lucky he didn’t have any more baby girls. He’d have to beat ‘em off with a stick.” Pausing, he adds in complete seriousness, “Or commit murder.” Blushing, I giggle stupidly loud, and both he and Nox chuckle. Terah slaps his arm playfully. “Leave her alone, Jon. You’re embarrassing her.” She takes me by the arm and leads me down the hall. I know what she’s doing. She’s trying to put it out in the open that she supports me, whatever the decision. And I’m grateful. Approaching the kitchen, I hear Mom chatting away to herself. When I peek inside, she squeals, “Oh, my baby!” Laughing softly, I wrap her up in a hug and hold her tightly. She sighs, “It’s so quiet here without you, honey.” Squeezing her, I say, “I thought you liked the quiet.” Squeezing back, she utters, “There’s quiet. And then there’s quiet. And I don’t like quiet.” Releasing her, she looks past me to Nox. Using his cane for support, he comes forward, and Mom’s face turns devastated. Not a second later, she takes him into a motherly embrace and mutters over and over again. “Thank you so much.” He did save my life, after all. Nox holds her. “I’d do it again in a heartbeat, ma’am.” Pulling back, she smacks his chest, “Don’t you ma’am me. You’ll call me Mom.” Staring at her in shock, she turns to me and adds with a wink, “Nice ring.” I mentally smack my forehead. I forgot to take off my ring. Some surprise. Mom tuts, “We need drinks! And I think the occasion calls for something bubbly.” She moves across the pristine kitchen with such ease it looks as though she’s gliding. Opening the refrigerator, she pulls out two bottles of Dom Perignon and hands them to Jon to pop the corks. He pours and hands us our glasses, but something doesn’t feel right. “Where’s Dad?” Mom’s happy face droops. “In his office.” Silence. We stare at each other for a moment before I blurt out, “I should go get him.” Moms smile reappears, gentler this time. “That would be nice, sweetie.” Nox squeezes my neck and asks Mom, “Do you think I could sit down somewhere? I get tired pretty quickly these days.” Her face falls, “Oh, honey! I’m so sorry. Of course we can sit. Let’s go outside. It’s such a nice day.” Linking her arm with his free one, she leads them to the backyard, and Nox turns to wink at me. Shaking my head, I smile and bite my lip to stop my laughter. The goof is giving me time by distracting my mom. I love that man. Watching them all exit through the double doors, I take a moment to prepare myself for this encounter. I love my dad. I do. But I wish he’d done things differently. It’s too late to do anything about that now, but it still bugs me. Quietly making my way down the hall, I stop by my dad’s office and listen in. Nothing. Not a sound. Peeking in, I see my dad at his desk, going through a photo album. I assume he wants privacy, so I turn to leave, when I hear, “Nothing scarier than almost losing a child.” Stopping in my tracks, I listen as he goes on, “Losing a child, as in your wee one passing away, I think ye could come to terms with. It’s so final. I’m not saying it would be easy, just that it’s permanent. But almost losing a child…” He clears his throat. “…It’s a very hard thing to witness. Ye do the best ye can to hold it together for yer family. Somehow, it always comes back to that day. The thought of ye being out of me sight for even a minute was enough to make me loopy.” Turning, my eyes met my father’s as he continued, “Because if ye were out of me sight, I couldn’t protect ye, love. It’s a father’s duty. And I only did what any father would do. I could handle ye thinking I wasn’t fair. As long as ye were safe, I could deal with yer attitude, Lily.” And although I don’t completely understand, I get it somewhat. Nodding once, I shift from foot-to–foot, suddenly nervous. A smiling Dad breaks the tension with, “So he fought the underworld for ye?” Not able to keep the smile down, I whisper, “He promised he’d come back for me.” He looks serene as he says, “Must love ye a lot, Lily girl.” Dipping my chin, I tell him, “He says he does.” Dad returns in perfect Irish sarcasm, “I’d be inclined to believe him. Coming back from the dead is overkill, but the gesture was nice.” And I laugh softly, shaking my head. Standing, Dad smiles up at me. “Missed ye a lot, darling. Do ye think…ye think I could get a hug?” Not wasting another second, I cross the room in a second flat and wrap my arms around my father’s waist. Placing my cheek to his chest, I take in the warmth and love being given in this moment. I mutter into my dad’s shirt, “I’m getting married.” He sighs and strokes my hair, “I know, sweets. It’s time for me to let go and place ye in the hands of someone who deserves ye. And I think Nox deserves ye.” Squeezing my dad, I assure, “He does deserve me. As much as I deserve him.” He pulls back a little and smiles softly, “Shall I go meet my future son-in-law then?” “Yeah. I think that would be nice.” Wrapping his arm around my shoulder, we walk together to the back patio where everyone sits chatting. Terah’s leading the conversation, as always. Nox turns to the doorway and smiles, seeing me and my father wrapped up. Taking his cane, he stands a little unsteadily, and walks towards us. My father holds his hand out. Nox takes it. And I’m a little stunned when Dad pulls him towards him and hugs him tight. My throat tightens. My eyes burn. Still in a manly embrace, my dad says, “Owe ye everything, son. Ye need or want anything, ye just ask.” Nox earns a point in my dad’s book when he utters, “I’m quite partial to your daughter, actually. I was kinda hoping I could keep her.” Dad bursts into laughter and claps him on the back. He chuckles, “I’d love to say yes, and ye’ve got me permission.” He looks over to me. “But it’s up to her.” He smiles at me, “If it’s any help, I think she’d follow ye to Hell and back.” They release each other, and Nox steadies himself on his cane. He turns to me. “She already has.” The guys stay gathered in the dining room, while us ladies clear the table. We’ve been chatting about our men and wedding stuff. Terah says, “God, sometimes I look at Jon and think ‘how the Hell did I manage to get you?’ We’re so lucky.” Mom adds, “They are very handsome.” Terah and I scoff. Shaking my head, I say, “Handsome is something. And Nox is handsome most times. But, by God, he is hot. Hotter than Hell, Mom. I never thought I could love someone so much. I can hardly keep my hands off him.” Mom chastises on a gasp, “Lily! That’s inappropriate! You’re a lady and ladies do not speak that way.” Terah chuckles, “Screw being a lady. I love my special cuddle time with Jon.” Mom covers her ears, but barks out an embarrassed laugh, “I cannot hear this! You girls can clean the rest up while I powder my nose.” Terah and I chuckle, watching her leave. After a moment, she turns to me, “Nox is hot, babe.” Turning back, she side eyes me. “ Have you- you know- yet?” Sullen, I wipe a serving dish dry and pout. “Not yet. But I’m happy to wait. We haven’t really done much more than kiss since he’s been back, and I think a lot of it has to do with his leg.” Pausing a moment, I lean forward and say quietly, “I don’t think he has a clue what he does to me. I’m blazing hot all the damn time. I want sex, Terah!” Doubling over, she laughs hard. “Oh, God. I never thought I’d see the day my kid sister would be so openly sexually frustrated.” Straightening, she smiles big, eyes wide. “Seduce him. Tonight.”","sourceLink":"https://allnovel.net/willing-captive/page-27.html","bookId":2800,"book":{"id":2800,"title":"Willing Captive","description":"Storyline: Delilah “Lily” Flynn is used to her drab existence. Lily’s been living it for twenty two years. Her boring life is suddenly turned on its head when she’s rudely kidnapped from her bedroom. Or so she thinks. Nox Taylor is far too high up in his field to be assigned a babysitting job. There’s nothing more he wants than to complete his mission so he can be rid of the smartass tomboy, Lily. Day after day, Nox watches Lily and her strange ways. She’s unlike any woman he’s ever met. Getting close to the girl is purely for her own protection…right? Lily never imagined she’d make her first real friends in captivity. What lengths would she go through to keep them?","cover":"https://allnovel.net/images/willing-captive.jpg","author":"Belle Aurora","type":"Humorous","source":"allnovel","link":"https://allnovel.net/willing-captive.html","creation":"Oct 5, 2019 9:01:30 AM","modification":"Oct 5, 2019 5:42:30 PM"}}
