{"id":84035,"no":13,"title":"Page 13","content":"\n \"Tomorrow we\u0027ll get your stepson,\" Katie assured her.\n \"And kill more zombies,\" Jenni added.\n Katie somewhat laughed, her eyes still feeling horribly large and swollen. \"Yeah, kill zombies.\"\n \"But avoid malls and farmhouses and helicopters.\"\n \"And find ourselves a handsome black man for the main lead in our story,\" Katie added.\n They both began to laugh and it felt amazingly good.\n And outside, the zombies gathered and moaned.\n 3. The Midnight Hour\n Jenni\u0027s heart pounded almost as fiercely as her footfalls as she rushed down the stairs with Mikey beside her. Her fingers slid down the banister as she struggled to not fall headlong down the stairs. Mikey\u0027s hand was slippery in hers and she tugged him hard as she reached the bottom of the staircase and headed toward the front door.\n She felt Lloyd grab her long hair and yank her backwards.\n \"Don\u0027t touch my Mom!\" Mike\u0027s hand slipped from hers and her little boy launched himself at his father.\n \"No,\" Jenni whispered and her eyes snapped open. Her heart was beating so hard in her chest it hurt. Slowly, she sat up and struggled to catch her breath.\n Katie was sleeping beside her with her arms wrapped around the German Shepherd. The dog eyed Jenni drowsily and she rubbed his brow lightly.\n \"I\u0027m okay,\" she lied.\n He licked her arm lightly before laying his head back down.\n She was sure he was tired, too, after their long day. Plus he had started the day with surgery and had endured their crazed escape from the city in a drugged stupor.\n Feeling shaken, she slid from the bed and stood in the darkened room listening to the moans of the dead outside. Lloyd always used to make her watch zombie movies because he knew they scared her. Scaring her had been something he enjoyed doing. Every time they watched a zombie film, he\u0027d do things to upset her. Pretending to be a zombie while moaning always made her scurry away from him. She hated it. The entire concept of zombies was terrifying to her.\n And then this morning…\n No, don\u0027t think about it, she told herself.\n She ran her fingers through her hair to comb it back from her face and walked to the door. Careful not to make too much noise, she turned the handle and slipped out into the hallway. Down the hall she saw a dim light and followed it into the living room. The TV was still on, but muted. An ashen looking anchorman from one of the major networks was talking to several people including a minister. Ralph was asleep in his lounge chair with a quilt laid gently over him. A rifle lay on the floor next to him.\n \"He couldn\u0027t sleep,\" Nerit\u0027s voice said quietly from behind her.\n Jenni turned around and saw the older woman was dressed in a nightgown and holding a cup of tea. \"I had nightmares.\"\n \"Me, too,\" Nerit said with a weary smile. \"Would you like some tea and some cheesecake?\"\n Jenni sighed. \"That would be awesome.\"\n They settled into the kitchen, Jenni tucked into a stiff-backed chair as Nerit put on a fresh pot of tea.\n \"You know, zombies always scared me,\" Jenni said after a quiet moment.\n \"I never thought much about them or any movie monsters,\" Nerit answered. \"I always thought the monsters of the real world were much more terrifying.\"\n \"Serial killers and all that.\"\n \"Terrorists, too.\" Nerit shrugged and cut two slices of the Italian-style cheesecake. \"Ralph likes the monster movies. He says they\u0027re a safe kind of scary.\"\n \"Not anymore,\" Jenni sighed.\n \"No, not anymore,\" Nerit agreed and set down the dessert in front of her before taking a seat as well.\n \"I…had kids.\" Jenni raised her eyes and gazed at Nerit. \"They died this morning.\"\n Maybe she was expecting an accusation of her being incompetent or something like that, but Nerit only answered with, \"I\u0027m sorry.\"\n \"My husband got bit last night. A bum, he said.\" Jenni stabbed at the pierce of cheesecake with her fork. A little bit of it crumbled off and she scooped it up and ate it.\n \"Ralph discovered what was going on at the grocery store. We had stayed in bed late to celebrate his birthday. He was just going across the road to grab the paper when he saw the attacks inside.\" Nerit cut her piece into small sections and played with one tiny slice with her fork. \"I didn\u0027t believe him at first when he called me. People eating each other. It sounds so ludicrous. Not real.\"\n Jenni set her fork down and stared at the plate for a long moment.\n \"Lloyd liked to sleep on the sofa. He said I move around too much when I sleep and that he couldn\u0027t get a decent night\u0027s rest. He wouldn\u0027t sleep with me often. I would hear the TV on all night. If he had been in our room…Benji\u0027s room is the first one off the stairs. I think he just went there first because…\" She covered her face with her hands and tried so hard not to think of what she had seen. It was a blur, actually. Just a swift image of Lloyd stuffing something thick and fleshy into his mouth and Benji\u0027s little body looking wrong under all that blood staining the floor. Her mind fought between adding in details and wiping the image out altogether.\n Nerit\u0027s fingers were soft and dry as she drew Jenni\u0027s hand down from her face. Gently, she held Jenni\u0027s hand in her own and said, \"There was nothing you could do.\"\n Jenni forced back a sob and wiped away her tears. She wasn\u0027t sure if that was the truth and she didn\u0027t want to think about it anymore. Already, yesterday morning felt so far away and the world already felt very different.\n Mikey, Benji and even Lloyd felt like shadows to her.\n \"When you saw them inside the store, what did you do?\"\n Nerit sighed. \"At first, we were going to go in and try to rescue people.\n But the…zombies,\" she slightly laughed at the word \"the zombies rushed toward the door and we realized very quickly we couldn\u0027t go inside. We ran back here and locked ourselves in. At first we thought the people were infected with some strange virus, like the news said, but one of them came up behind the hunting store and was chewed down to the bone. There was hardly anything left of him. There was no way in heaven he could be that badly damaged and walking. He saw us through the window and began to beat on it. That is when we decided to head back upstairs and figure out exactly what was going on around us. That is when we saw our own neighbors forcing themselves into people\u0027s homes and attacking them. We took some out from a distance, but…\" Nerit shook her head. \"We\u0027ve been killing our neighbors all day. And had no choice.\"\n Jenni took another bite of the cheesecake and the rich flavor distracted her thoughts for a few precious moments. \"Does it bother you to kill them?\"\n Nerit stood up, stretched and headed toward the teakettle. It was beginning to whistle. \"The real question is do we have a choice?\"\n \"It doesn\u0027t bother me to kill them,\" Jenni confessed. \"Not at all.\"\n The older woman poured the hot water into a cup and moved to set it down in front of Jenni. \"It doesn\u0027t bother me either.\"\n The hot water was letting off a small plume of steam and Jenni waved her hand through it. It felt good against her skin. The cold spring night was pressing against the windows and she could feel a chill in her bones. The warmth from the hot water was a soothing sensation. Dumping too much sugar into the tea, Jenni tried hard not to think too deeply about anything other than rescuing Jason in the morning.\n Nerit sipped some tea and eyed Jenni thoughtfully. \"It\u0027s a good thing, you know.\"\n \"What is?\" Katie padded into the room looking bleary eyed. Jack was at her heels yawning and looking for the nearest food bowl.\n \"Being able to kill them,\" Nerit answered.\n Spotting the teakettle, Katie headed over to it.\n \"Couldn\u0027t sleep?\" Jenni dumped in more sugar for good measure.\n \"Nightmares,\" Katie confessed. \"But I guess we better get used to them.\"\n \"Get used to all of it,\" Jenni agreed. Her friend looked pale and tired.\n They both needed to rest, but the sound of the zombies was dragging on all of them.\n \"You don\u0027t think it will be stopped, do you?\" Katie slid into a chair, a mug in her hand.\n Nerit shook her head and reached out for a pack of cigarettes sitting on the table. \"No. It\u0027s too late. They didn\u0027t do what they needed to do in the beginning.\"\n \"Which was?\" Katie shoved her blond curls out of her face.\n \"Kill everyone bitten,\" Jenni answered. She leaned her head on Katie\u0027s shoulder and sighed softly. \"Everyone bitten should have been killed right away. Lloyd was bitten. The emergency room gave him some shots and told him to make a follow up appointment with his doctor.\"\n Nerit lit a cigarette and exhaled slowly. She leaned over and flipped on an air filter next to the table to suck up the second hand smoke. \"The authorities told all the wounded to go to the hospitals and rescue centers.\n They accelerated the infection rate.\"\n \"They still don\u0027t get it.\" Ralph walked into the kitchen rubbing his eyes.\n Clad in pajamas and an old robe, he looked frail. \"Anyone saying zombies or end of the world is getting mocked. Got CDC taking back some of what they said and still telling people to go to rescue centers. Got major cities burning all over the States and they still can\u0027t figure it out.\" \n","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-13.html","bookId":2481,"book":{"id":2481,"title":"The First Days (As the World Dies #1)","description":"Storyline: \n The First Days (As the World Dies #1) \n Katie is driving to work one beautiful day when a dead man jumps into her car and tries to eat her. That same morning, Jenni opens a bedroom door to find her husband devouring their toddler son. \n Fate puts Jenni and Katie—total strangers—together in a pickup, fleeing the suddenly zombie-filled streets of the Texas city in which they live. Before the sun has set, they have become more than just friends and allies—they are bonded as tightly as any two people who have been to war together. \n During their cross-Texas odyssey to find and rescue Jenni’s oldest son, Jenni discovers the joy of watching a zombie’s head explode when she shoots its brains out. Katie learns that she’s a terrific tactician—and a pretty good shot. \n A chance encounter puts them on the road to an isolated, fortified town, besieged by zombies, where fewer than one hundred people cling to the shreds of civilization. \n It looks like the end of the world. But Katie and Jenni and many others will do whatever they have to to stay alive. Run, fight, pick each other up when they stumble, fall in love…anything is possible at the end of the world.\n \n","cover":"https://allnovel.net/images/the-first-days-as-the-world-dies-1.jpg","author":"Rhiannon Frater","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-first-days-as-the-world-dies-1.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:54:56 PM"}}
