{"id":30815,"no":11,"title":"Chapter XI. Events at the Stone House","content":"To be sure, I passed the most dismal of nights locked in the upper room of the Stone House. Whether Martin had had the courage to bear my message to Charles Craike I could not tell; I heard the mumble of their voices in the room below, but I did not set my ear again to the breach in the flooring-boards. I heard the doors creak and crash presently, and, slipping to the window, I saw the gentleman mount and ride away. I lay down then on the bed, spreading my greatcoat over the miserable rags; and when Martin and Mother Mag climbed the stairs, and entered the room, that the fellow might satisfy himself of my safety, and further test the security of bars and chimney, I lay there paying them no heed, nor did they speak to me. But the woman brought me a pitcher of water, and bread and meat upon a platter, of which I was glad, for I was fainting with hunger; she set my supper down upon the floor, and they left me, locking the door upon me. I ate my supper, and surveyed my fortunes. p. 90Indeed, they were of the poorest. My one hope was that Mr. Bradbury was no more than stunned by his fall; and would take prompt steps to find and rescue me. Else, I must be held a prisoner in the Stone House, till the seaman Blunt made port. I was then to be put aboard his ship and taken overseas. My uncle’s assumption was—unless he purposed more particularly to instruct Blunt regarding the disposal of me—that I could not possibly return during his father’s lifetime; though by entail I might be master of Rogues’ Haven, I took it that the gentleman by then would be in complete enjoyment of his father’s private fortunes, and would set me at defiance, if ever I returned; but I believed that Charles Craike would so plan it that I should never return. Lying on the miserable bed, hearing the winds blow drearily about the house, I writhed at the thought that the man who had done my parents bitter hurt should have me in his toils. Was there hope from Roger Galt, gentleman of the road, hating Charles Craike? Though Galt might fret under the yoke, Craike was surely his master. Awhile I heard the folk of the house stirring below me; once I heard the stairs creak, and believed that Martin or the woman crept up to my door. Indeed, I fancied that I caught the p. 91sound of breathing by the door; I lay still, wondering whether they would come upon me secretly in the dark, and make an end of me. But it seemed that the man or the woman came only to be assured that I was not endeavouring to break gaol; as satisfied, the watcher crept presently down the stairs. But would they yet come upon me in the dark? At the thought I rose and set the stool, with pitcher and platter, against the door; the crash, if the door were opened, would surely rouse me. I could not lie awake all night; I could not for the weariness clouding my brain. I fell at last asleep; yet, such was the influence of my fears upon me that I woke repeatedly, believing that my enemies were in the room. At first I woke only to see moonlight leap white and spectral through the window, as the sack flapped in the wind; then to lie quaking in the darkness, hearing the gale, which was violent the night through; always when I woke I heard it hammering on the house; I heard the rats scurry, and bounce, and squeak beside my bed. No one came in the night. I was awake by daybreak, and rose to stare out on drear grey fog; the gale had abated. All about the house the dank fog lay in the hollow; I could not see as far as the stone wall from my window. Looking p. 92about the mouldering room, I set my thought upon the trap-door through the ceiling; it was clouded with dust-weighted cobwebs, and clearly had not been opened for many years. I believed that I could raise it, and reach the roof; had there been more furniture within the room, I might have climbed to it; the bedstead would not reach half-way, and by its rottenness would crash under my weight. But the inmates of the Stone House were now astir. I heard the working and splash of a pump, the sound of an axe, the clatter of heavy boots on the cobbles. I heard muttering and movement in the room below me. Hungry and impatient, and less afraid now that the day was come, I waited until, at last, Mother Mag and a young man climbed the stairs and entered the room. The fellow seemed of gipsy blood,—black, towsled hair poking about his ears, his eyes dark and furtive, his skin copper-red,—as ill-looking a rogue as Martin. He wore leather breeches, leggings, and hobnails, a fustian jacket over a ragged shirt; he had silver rings in his ears. He was clearly of a lithe strength; he carried a blackthorn, and he eyed me with a surly and vengeful look, as if he would use his cudgel on me for any pretext I might afford him. Mother Mag, poking her skinny fingers at me, p. 93croaked, “You can come downstairs, young master. You can wash you at the pump, if you will wash. When you’ve fed, you’ll be free to walk the court, if you will. But don’t try to run away! Don’t try,”—and laughed shrilly, and pointed at the young man. He grinned at me, flourished his blackthorn suggestively, and gripped my wrist as if to demonstrate his strength; his fingers clasped on my flesh like a steel trap. But he said not a word, as, nodding, I followed the woman down the stairs; he came after, pressing my heels. As we reached the hall, Martin appeared in the doorway of the long room; seeing him, yellow-skinned and malevolent, I detected still a resemblance in build and feature to the gipsy lad; and believed them kinsmen, though Martin aped the appearance of a gentleman, and the rustic was rough and ragged, and reeked of the stable. Martin gave me no greeting; I followed Mother Mag through the hall into a great kitchen, damp, close, and cheerless, but for the peat smouldering on the hearth. Rashers were frying in a pan; provision of bacon, smoked fish and ropes of onions hung from the sooty rafters. “Would ye wash?” Mother Mag asked, leering at me. “To be sure, I’d wash, thank ’ee,” said I. p. 94She took down a coarse towel from a peg and flung it to me; she pointed to soap upon the bench, “You can wash at the pump,” she said. “Bart’ll go with you. Don’t ’ee go tryin’ to run, young master, now don’t ’ee. For you’ll never get to the wall; and you’ll never climb if you run so far—” and, unlocking the door, pointed, laughing, at the hound chained at the foot of the steps. The hound, leaping up, bayed at me; Bart, clattering down the steps, struck at it with his cudgel; it leaped and bayed at him, plunging as though it would snap its chain. He uttered not a word, seeming to take delight in the torment of the savage brute, and beating it back at last into the kennel; though, when I descended, it sprang at me, and, but for my jumping aside, it would have borne me down. Mother Mag laughed shrilly from the door; Bart said not a word or yet a word while he mounted guard over me at the pump. I took it that the fellow was dumb, but, as I plied the towel, I said carelessly, to test him, “How long am I to be held in this ken, lad?” He answered nothing, only swung his cudgel, grinning at me. I took a hasty look about me; the stone wall was built high about the cobbled yard; away from the house were low stone out-buildings; beyond the wall I could see trees dimly through the thinning fog. p. 95I said then, “You’re paid to keep me here. Whatever you’re paid, my friends will pay you more. D’ye understand me? If you’ll take a message to Mr. Bradbury, whom I think to be at Rogues’ Haven—” With black and menacing look he gripped my arm, and pointed back to the house. So I must needs tramp back to my prison; though I was tempted to make a dash for freedom, when he loosed my arm, I was debarred by the sight of Martin standing, pistol in hand, by the steps. He, sweeping off his hat with a mocking bow, as I returned, my endurance left me. While the hound raved at me, I cried furiously to Martin, “I warn you all you’ll pay for this. I’ve other friends than Bradbury, who’ll never rest till they’ve found me. By the Lord, you’ll rue the day!” “Brave words,” he sneered. “Blunt’ll make port this day or to-morrow. And you’ll lie snug enough, till you’re set aboard.” I passed by him into the kitchen. Mother Mag had set bread and bacon and a mug of ale on the table for me. I sat down and ate hungrily, while the three watched me from the fireside, saying not a word to me, and the great hound bayed yet without the door. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2790/77226.html","bookId":1293,"book":{"id":1293,"title":"Rogue\u0027s Haven","description":"简介： But for the coach and pair carrying Mr. Bradbury to Chelton, Tony Vining and I would not have been haled before the Squire, but would have got off scot-free as any time before. Tony and I had made the round of our snares. Tony had poked a young rabbi...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2790","creation":"Aug 1, 2019 12:24:48 AM","modification":"Aug 1, 2019 12:24:48 AM"}}
