{"id":30817,"no":13,"title":"Chapter XIII. Out of the Stone House","content":"As the night wore on, the clamour dulled; the roisterers were surely drunken or wearied; few seemed astir. I heard the mumble of voices still from the room below me; occasionally the shred of a chanty from the kitchen; at times, the clatter of shoes over the cobbles of the yard, and the outcry of the hound. But ever the wind blew through the night, seeming to cry to me concerning great waters storm-tossed, whereon I should be sailing after this night to the port of no return. Night drew toward the hour before dawn; the moon was long since lost in massing clouds packed high against the heaven by the wind. Lord, how the wind battered at the house, making new clamour when the clamour died below; always it cried to me of storm-tossed waters,—I had this sense upon me, even when my overwrought mind growing dull, I fell asleep upon the bed, and I had the sense still in my dreams. But suddenly I woke with a start and a cry, to understand that pebbles were pattering through the bars and falling into the room, and that a p. 106voice was muttering below the window, “Young Craike,—hey, young Craike!” I snatched the sacking back, and in the grey dawn saw a dark figure perched upon a ladder, his head a foot or so below the sill. “Galt!” I whispered. “Hist! They may have heard the stones. Lord, how you slept! D’ye hear them stirring?” “No! No! Help me!” “Can you slip through the bars?” “No, they’re set too close and firm.” He muttered, “Bart’s sleepin’ on the stair and Martin’s in the hall. The woman’s got the key. Can you reach the roof by the chimney?” “Blocked with brick!” “No other way?” “A manhole in the ceiling. If I could only reach it.” “If you can only break out of that room, I’ll take you out of this. My horse is saddled, waiting. I forgot those bars.” I pressed my face down against the bars and whispered, “If you could raise the ladder, we could pass it through the bars. It’d get me to the trap-door. There’s sure a way out through the old roof. And a coil of rope, if there’s one at hand. Tie that to the ladder.” p. 107Grunting he descended; presently I saw him setting a barrel below the window, and fixing a coil of rope to a rung of the ladder. He climbed on to the barrel, gripped the ladder, and raised its head towards the window. I caught the ladder, tilted it, and presently, rejoicing, had it in the room, with no more sound than the wind should hide from the drunken rogues below. Setting the ladder against the wall, and hitching the coil of rope about my arm, I climbed, and to my joy reached easily the trap-door above me. Exerting all my strength, I strove to force the trap-door upwards. Lord, the shower of dust that descended, as the door lifted, blinded me; broken slate or brick fell with the dust, and the crash on the floor seemed fit to wake the dead. But, blindly struggling upwards, and gripping a rafter, I pulled myself from the ladder, and squeezed under the half-opened trap into the loft above my room. An instant I lay in the dust and litter, exhausted,—the rats went scurrying all about me; I heard the flapping of birds under the roof. Struggling to my shaking knees, I forced the trap back into its place, and without pausing to listen whether the fall of rubbish into the room had roused the house, I groped forward through the blackness, my hope being that I should find a trap p. 108opening on the roof itself, or that, with the rottenness of the slates and the timbers I might break through, and coiling my rope about a chimney, lower myself sufficiently to drop to the ground. But as yet all was dark about me; a thick litter of dust and feathers lay under my feet; groping still, I touched the slanting roof, but thrusting with my hand found it yet set firmly for all the decay of the years; I believed that I heard hoarse voices without the house, or the growling of the wind upon the roofs. Creeping forward still, I rejoiced to feel a cold draught of air blow upon me, and to see pale light through many chinks. Loose slates, rotten wood, surely a decaying patch in the roof, I dared to stand erect then, though fearing that the mouldering, worm-eaten rafters would give way beneath me, and I should crash into one of the upper rooms of the Stone House. And as I lurched up, with a crash and splintering of slates, I broke through the rotten roof; I was nigh the chimney stack; I could see the leaden gutters below me,—birds flew out in a whirl. I could see Roger Galt standing by his horse away from the house; I could hear the outcry of the hound,—none of the folks save Roger seemed astir. I wriggled out from the hole in the roof, though at first the slates cracked p. 109like thin ice beneath me; and I began slowly to creep towards the chimney stack, finding my hold in the breaks of the slates and the thick growths of moss stuck closely to them. The roof held me; but, ere I reached the chimney, the light was strong; had anyone come out of the Stone House I must have been clear to view, though the sound of the wind hid the rasping of my body over the slates. And slowly, with the wind beating upon me as if to cast me down, I brought the rope about the chimney, and, securing it, let myself slide down gradually to the gutter; gripping rope and gutter, I lowered myself over the edge. On the instant, the hound broke into furious clamour; a cry sounded below me; Martin was roaring, “Bart! Blunt! Come here! Damn you—here!” I was swinging now down the rope; at the end of the length I was little below the gutter. At the alarm I lost my grip, and fell—by some chance into a pile of bales of smuggled stuffs that they had left lying under the wall; though the breath was knocked out of my body, and I lay there gasping an instant, I was unhurt. I started up; dropped from the bales on to the cobbles, and was staggering off; but, coming in a rush from the house, the rogues were upon me. Martin and Bart had gripped me; struggling wildly, I was p. 110borne backwards; on the instant came Roger Galt, riding thunderously upon them. His riding-whip cracked upon Bart’s head; his horse nigh trod Martin down; Roger’s great hand gripped my collar, and swung me up before him. Martin was screeching, “Galt! You’ll hang for this! Galt! Damn you! Stop!” His pistol cracked after us, as Roger, turning his horse, set him at full speed from the house. After us they came pell-mell,—Martin and Blunt and his crew; I heard shots and their roaring voices. The gate was barred against us; swinging back under the wall, Roger Galt suddenly put his horse to it, and with a shock that almost drove my senses from me, the horse brought us safely over. We were away then at a gallop, and the clamour from the Stone House was dying on the wind.","sourceLink":"http://novel.tingroom.com/duanpian/2790/77228.html","bookId":1293,"book":{"id":1293,"title":"Rogue\u0027s Haven","description":"简介： But for the coach and pair carrying Mr. Bradbury to Chelton, Tony Vining and I would not have been haled before the Squire, but would have got off scot-free as any time before. Tony and I had made the round of our snares. Tony had poked a young rabbi...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2790","creation":"Aug 1, 2019 12:24:48 AM","modification":"Aug 1, 2019 12:24:48 AM"}}
