{"id":7290,"no":32,"title":"Chapter 32","content":"32:1 [hgb] 诸 天 哪 ， 侧 耳 ， 我 要 说 话 。 愿 地 也 听 我 口 中 的 言 语 。 [kjv] Give ear, O ye heavens, and I will speak; and hear, O earth, the words of my mouth. [bbe] Give ear, O heavens, to my voice; let the earth take note of the words of my mouth: 32:2 [hgb] 我 的 教 训 要 淋 漓 如 雨 。 我 的 言 语 要 滴 落 如 露 ， 如 细 雨 降 在 嫩 草 上 ， 如 甘 霖 降 在 菜 蔬 中 。 [kjv] My doctrine shall drop as the rain, my speech shall distil as the dew, as the small rain upon the tender herb, and as the showers upon the grass: [bbe] My teaching is dropping like rain, coming down like dew on the fields; like rain on the young grass and showers on the garden plants: 32:3 [hgb] 我 要 宣 告 耶 和 华 的 名 。 你 们 要 将 大 德 归 与 我 们 的 神 。 [kjv] Because I will publish the name of the LORD: ascribe ye greatness unto our God. [bbe] For I will give honour to the name of the Lord: let our God be named great. 32:4 [hgb] 他 是 磐 石 ， 他 的 作 为 完 全 ， 他 所 行 的 无 不 公 平 ， 是 诚 实 无 伪 的 神 。 又 公 义 ， 又 正 直 。 [kjv] He is the Rock, his work is perfect: for all his ways are judgment: a God of truth and without iniquity, just and right is he. [bbe] He is the Rock, complete is his work; for all his ways are righteousness: a God without evil who keeps faith, true and upright is he. 32:5 [hgb] 这 乖 僻 弯 曲 的 世 代 向 他 行 事 邪 僻 。 有 这 弊 病 就 不 是 他 的 儿 女 。 [kjv] They have corrupted themselves, their spot is not the spot of his children: they are a perverse and crooked generation. [bbe] They have become false, they are not his children, the mark of sin is on them; they are an evil and hard-hearted generation. 32:6 [hgb] 愚 昧 无 知 的 民 哪 ， 你 们 这 样 报 答 耶 和 华 吗 ？ 他 岂 不 是 你 的 父 ， 将 你 买 来 的 吗 ？ 他 是 制 造 你 ， 建 立 你 的 。 [kjv] Do ye thus requite the LORD, O foolish people and unwise? is not he thy father that hath bought thee? hath he not made thee, and established thee? [bbe] Is this your answer to the Lord, O foolish people and unwise? Is he not your father who has given you life? He has made you and given you your place. 32:7 [hgb] 你 当 追 想 上 古 之 日 ， 思 念 历 代 之 年 。 问 你 的 父 亲 ， 他 必 指 示 你 。 问 你 的 长 者 ， 他 必 告 诉 你 。 [kjv] Remember the days of old, consider the years of many generations: ask thy father, and he will shew thee; thy elders, and they will tell thee. [bbe] Keep in mind the days of the past, give thought to the years of generations gone by: go to your father and he will make it clear to you, to the old men and they will give you the story. 32:8 [hgb] 至 高 者 将 地 业 赐 给 列 邦 ， 将 世 人 分 开 ， 就 照 以 色 列 人 的 数 目 立 定 万 民 的 疆 界 。 [kjv] When the Most High divided to the nations their inheritance, when he separated the sons of Adam, he set the bounds of the people according to the number of the children of Israel. [bbe] When the Most High gave the nations their heritage, separating into groups the children of men, he had the limits of the peoples marked out, keeping in mind the number of the children of Israel. 32:9 [hgb] 耶 和 华 的 分 本 是 他 的 百 姓 。 他 的 产 业 本 是 雅 各 。 [kjv] For the LORD\u0027s portion is his people; Jacob is the lot of his inheritance. [bbe] For the Lord\u0027s wealth is his people; Jacob is the land of his heritage. 32:10 [hgb] 耶 和 华 遇 见 他 在 旷 野 荒 凉 野 兽 吼 叫 之 地 ， 就 环 绕 他 ， 看 顾 他 ， 保 护 他 ， 如 同 保 护 眼 中 的 瞳 人 。 [kjv] He found him in a desert land, and in the waste howling wilderness; he led him about, he instructed him, he kept him as the apple of his eye. [bbe] He came to him in the waste land, in the unpeopled waste of sand: putting his arms round him and caring for him, he kept him as the light of his eye. 32:11 [hgb] 又 如 鹰 搅 动 巢 窝 ， 在 雏 鹰 以 上 两 翅 扇 展 ， 接 取 雏 鹰 ， 背 在 两 翼 之 上 。 [kjv] As an eagle stirreth up her nest, fluttereth over her young, spreadeth abroad her wings, taketh them, beareth them on her wings: [bbe] As an eagle, teaching her young to make their flight, with her wings outstretched over them, takes them up on her strong feathers: 32:12 [hgb] 这 样 ， 耶 和 华 独 自 引 导 他 ， 并 无 外 邦 神 与 他 同 在 。 [kjv] So the LORD alone did lead him, and there was no strange god with him. [bbe] So the Lord only was his guide, no other god was with him. 32:13 [hgb] 耶 和 华 使 他 乘 驾 地 的 高 处 ， 得 吃 田 间 的 土 产 。 又 使 他 从 磐 石 中 咂 蜜 ， 从 坚 石 中 吸 油 。 [kjv] He made him ride on the high places of the earth, that he might eat the increase of the fields; and he made him to suck honey out of the rock, and oil out of the flinty rock; [bbe] He put him on the high places of the earth, his food was the increase of the field; honey he gave him out of the rock and oil out of the hard rock; 32:14 [hgb] 也 吃 牛 的 奶 油 ， 羊 的 奶 ， 羊 羔 的 脂 油 ， 巴 珊 所 出 的 公 绵 羊 和 山 羊 ， 与 上 好 的 麦 子 ， 也 喝 葡 萄 汁 酿 的 酒 。 [kjv] Butter of kine, and milk of sheep, with fat of lambs, and rams of the breed of Bashan, and goats, with the fat of kidneys of wheat; and thou didst drink the pure blood of the grape. [bbe] Butter from his cows and milk from his sheep, with fat of lambs and sheep of Bashan, and goats, and the heart of the grain; and for your drink, wine from the blood of the grape. 32:15 [hgb] 但 耶 书 仑 渐 渐 肥 胖 ， 粗 壮 ， 光 润 ， 踢 跳 奔 跑 ， 便 离 弃 造 他 的 神 ， 轻 看 救 他 的 磐 石 。 [kjv] But Jeshurun waxed fat, and kicked: thou art waxen fat, thou art grown thick, thou art covered with fatness; then he forsook God which made him, and lightly esteemed the Rock of his salvation. [bbe] But Jeshurun became fat and would not be controlled: you have become fat, you are thick and full of food: then he was untrue to the God who made him, giving no honour to the Rock of his salvation. 32:16 [hgb] 敬 拜 别 神 ， 触 动 神 的 愤 恨 ， 行 可 憎 恶 的 事 ， 惹 了 他 的 怒 气 。 [kjv] They provoked him to jealousy with strange gods, with abominations provoked they him to anger. [bbe] The honour which was his they gave to strange gods; by their disgusting ways he was moved to wrath. 32:17 [hgb] 所 祭 祀 的 鬼 魔 并 非 真 神 ， 乃 是 素 不 认 识 的 神 ， 是 近 来 新 兴 的 ， 是 你 列 祖 所 不 畏 惧 的 [kjv] They sacrificed unto devils, not to God; to gods whom they knew not, to new gods that came newly up, whom your fathers feared not. [bbe] They made offerings to evil spirits which were not God, to gods who were strange to them, which had newly come up, not feared by your fathers. 32:18 [hgb] 你 轻 忽 生 你 的 磐 石 ， 忘 记 产 你 的 神 。 [kjv] Of the Rock that begat thee thou art unmindful, and hast forgotten God that formed thee. [bbe] You have no thought for the Rock, your father, you have no memory of the God who gave you birth. 32:19 [hgb] 耶 和 华 看 见 他 的 儿 女 惹 动 他 ， 就 厌 恶 他 们 ， [kjv] And when the LORD saw it, he abhorred them, because of the provoking of his sons, and of his daughters. [bbe] And the Lord saw with disgust the evil-doing of his sons and daughters. 32:20 [hgb] 说 ， 我 要 向 他 们 掩 面 ， 看 他 们 的 结 局 如 何 。 他 们 本 是 极 乖 僻 的 族 类 ， 心 中 无 诚 实 的 儿 女 。 [kjv] And he said, I will hide my face from them, I will see what their end shall be: for they are a very froward generation, children in whom is no faith. [bbe] And he said, My face will be veiled from them, I will see what their end will be: for they are an uncontrolled generation, children in whom is no faith. 32:21 [hgb] 他 们 以 那 不 算 为 神 的 触 动 我 的 愤 恨 ， 以 虚 无 的 神 惹 了 我 的 怒 气 。 我 也 要 以 那 不 成 子 民 的 触 动 他 们 的 愤 恨 ， 以 愚 昧 的 国 民 惹 了 他 们 的 怒 气 。 [kjv] They have moved me to jealousy with that which is not God; they have provoked me to anger with their vanities: and I will move them to jealousy with those which are not a people; I will provoke them to anger with a foolish nation. [bbe] They have given my honour to that which is not God, moving me to wrath with their false worship: I will give their honour to those who are not a people, moving them to wrath by a foolish nation, 32:22 [hgb] 因 为 在 我 怒 中 有 火 烧 起 ， 直 烧 到 极 深 的 阴 间 ， 把 地 和 地 的 出 产 尽 都 焚 烧 ， 山 的 根 基 也 烧 着 了 。 [kjv] For a fire is kindled in mine anger, and shall burn unto the lowest hell, and shall consume the earth with her increase, and set on fire the foundations of the mountains. [bbe] For my wrath is a flaming fire, burning to the deep parts of the underworld, burning up the earth with her increase, and firing the deep roots of the mountains. 32:23 [hgb] 我 要 将 祸 患 堆 在 他 们 身 上 ， 把 我 的 箭 向 他 们 射 尽 。 [kjv] I will heap mischiefs upon them; I will spend mine arrows upon them. [bbe] I will send a rain of troubles on them, my arrows will be showered on them. 32:24 [hgb] 他 们 必 因 饥 饿 消 瘦 ， 被 炎 热 苦 毒 吞 灭 。 我 要 打 发 野 兽 用 牙 齿 咬 他 们 ， 并 土 中 腹 行 的 ， 用 毒 气 害 他 们 。 [kjv] They shall be burnt with hunger, and devoured with burning heat, and with bitter destruction: I will also send the teeth of beasts upon them, with the poison of serpents of the dust. [bbe] They will be wasted from need of food, and overcome by burning heat and bitter destruction; and the teeth of beasts I will send on them, with the poison of the worms of the dust. 32:25 [hgb] 外 头 有 刀 剑 ， 内 室 有 惊 恐 ， 使 人 丧 亡 ， 使 少 男 ， 童 女 ， 吃 奶 的 ， 白 发 的 ， 尽 都 灭 绝 。 [kjv] The sword without, and terror within, shall destroy both the young man and the virgin, the suckling also with the man of gray hairs. [bbe] Outside they will be cut off by the sword, and in the inner rooms by fear; death will take the young man and the virgin, the baby at the breast and the grey-haired man. 32:26 [hgb] 我 说 ， 我 必 将 他 们 分 散 远 方 ， 使 他 们 的 名 号 从 人 间 除 灭 。 [kjv] I said, I would scatter them into corners, I would make the remembrance of them to cease from among men: [bbe] I said I would send them wandering far away, I would make all memory of them go from the minds of men: 32:27 [hgb] 惟 恐 仇 敌 惹 动 我 ， 只 怕 敌 人 错 看 ， 说 ， 是 我 们 手 的 能 力 ， 并 非 耶 和 华 所 行 的 。 [kjv] Were it not that I feared the wrath of the enemy, lest their adversaries should behave themselves strangely, and lest they should say, Our hand is high, and the LORD hath not done all this. [bbe] But for the fear that their haters, uplifted in their pride, might say, Our hand is strong, the Lord has not done all this. 32:28 [hgb] 因 为 以 色 列 民 毫 无 计 谋 ， 心 中 没 有 聪 明 。 [kjv] For they are a nation void of counsel, neither is there any understanding in them. [bbe] For they are a nation without wisdom; there is no sense in them. 32:29 [hgb] 惟 愿 他 们 有 智 慧 ， 能 明 白 这 事 ， 肯 思 念 他 们 的 结 局 。 [kjv] O that they were wise, that they understood this, that they would consider their latter end! [bbe] If only they were wise, if only this was clear to them, and they would give thought to their future! 32:30 [hgb] 若 不 是 他 们 的 磐 石 卖 了 他 们 ， 若 不 是 耶 和 华 交 出 他 们 ， 一 人 焉 能 追 赶 他 们 千 人 ， 二 人 焉 能 使 万 人 逃 跑 呢 ？ [kjv] How should one chase a thousand, and two put ten thousand to flight, except their Rock had sold them, and the LORD had shut them up? [bbe] How would it be possible for one to overcome a thousand, and two to send ten thousand in flight, if their rock had not let them go, if the Lord had not given them up? 32:31 [hgb] 据 我 们 的 仇 敌 自 己 断 定 ， 他 们 的 磐 石 不 如 我 们 的 磐 石 。 [kjv] For their rock is not as our Rock, even our enemies themselves being judges. [bbe] For their rock is not like our Rock, even our haters themselves being judges. 32:32 [hgb] 他 们 的 葡 萄 树 是 所 多 玛 的 葡 萄 树 ， 蛾 摩 拉 田 园 所 生 的 。 他 们 的 葡 萄 是 毒 葡 萄 ， 全 挂 都 是 苦 的 。 [kjv] For their vine is of the vine of Sodom, and of the fields of Gomorrah: their grapes are grapes of gall, their clusters are bitter: [bbe] For their vine is the vine of Sodom, from the fields of Gomorrah: their grapes are the grapes of evil, and the berries are bitter: 32:33 [hgb] 他 们 的 酒 是 大 蛇 的 毒 气 ， 是 虺 蛇 残 害 的 恶 毒 。 [kjv] Their wine is the poison of dragons, and the cruel venom of asps. [bbe] Their wine is the poison of dragons, the cruel poison of snakes. 32:34 [hgb] 这 不 都 是 积 蓄 在 我 这 里 ， 封 锁 在 我 府 库 中 吗 ？ [kjv] Is not this laid up in store with me, and sealed up among my treasures? [bbe] Is not this among my secrets, kept safe in my store-house? 32:35 [hgb] 他 们 失 脚 的 时 候 ， 伸 冤 报 应 在 我 。 因 他 们 遭 灾 的 日 子 近 了 。 那 要 临 在 他 们 身 上 的 必 速 速 来 到 。 [kjv] To me belongeth vengeance, and recompence; their foot shall slide in due time: for the day of their calamity is at hand, and the things that shall come upon them make haste. [bbe] Punishment is mine and reward, at the time of the slipping of their feet: for the day of their downfall is near, sudden will be their fate. 32:36 [hgb] 耶 和 华 见 他 百 姓 毫 无 能 力 ， 无 论 困 住 的 ， 自 由 的 都 没 有 剩 下 ， 就 必 为 他 们 伸 冤 ， 为 他 的 仆 人 后 悔 。 [kjv] For the LORD shall judge his people, and repent himself for his servants, when he seeth that their power is gone, and there is none shut up, or left. [bbe] For the Lord will be judge of his people, he will have pity for his servants; when he sees that their power is gone, there is no one, shut up or free. 32:37 [hgb] 他 必 说 ， 他 们 的 神 ， 他 们 所 投 靠 的 磐 石 ， [kjv] And he shall say, Where are their gods, their rock in whom they trusted, [bbe] And he will say, Where are their gods, the rock in which they put their faith? 32:38 [hgb] 就 是 向 来 吃 他 们 祭 牲 的 脂 油 ， 喝 他 们 奠 祭 之 酒 的 ， 在 哪 里 呢 ？ 他 可 以 兴 起 帮 助 你 们 ， 护 卫 你 们 。 [kjv] Which did eat the fat of their sacrifices, and drank the wine of their drink offerings? let them rise up and help you, and be your protection. [bbe] Who took the fat of their offerings, and the wine of their drink offering? Let them now come to your help, let them be your salvation. 32:39 [hgb] 你 们 如 今 要 知 道 ， 我 ， 惟 有 我 是 神 。 在 我 以 外 并 无 别 神 。 我 使 人 死 ， 我 使 人 活 。 我 损 伤 ， 我 也 医 治 ， 并 无 人 能 从 我 手 中 救 出 来 。 [kjv] See now that I, even I, am he, and there is no god with me: I kill, and I make alive; I wound, and I heal: neither is there any that can deliver out of my hand. [bbe] See now, I myself am he; there is no other god but me: giver of death and life, wounding and making well: and no one has power to make you free from my hand. 32:40 [hgb] 我 向 天 举 手 说 ， 我 凭 我 的 永 生 起 誓 ， [kjv] For I lift up my hand to heaven, and say, I live for ever. [bbe] For lifting up my hand to heaven I say, By my unending life, 32:41 [hgb] 我 若 磨 我 闪 亮 的 刀 ， 手 掌 审 判 之 权 ， 就 必 报 复 我 的 敌 人 ， 报 应 恨 我 的 人 。 [kjv] If I whet my glittering sword, and mine hand take hold on judgment; I will render vengeance to mine enemies, and will reward them that hate me. [bbe] If I make sharp my shining sword, and my hand is outstretched for judging, I will give punishment to those who are against me, and their right reward to my haters. 32:42 [hgb] 我 要 使 我 的 箭 饮 血 饮 醉 ， 就 是 被 杀 被 掳 之 人 的 血 。 我 的 刀 要 吃 肉 ， 乃 是 仇 敌 中 首 领 之 头 的 肉 。 [kjv] I will make mine arrows drunk with blood, and my sword shall devour flesh; and that with the blood of the slain and of the captives, from the beginning of revenges upon the enemy. [bbe] I will make my arrows red with blood, my sword will be feasting on flesh, with the blood of the dead and the prisoners, of the long-haired heads of my haters. 32:43 [hgb] 你 们 外 邦 人 当 与 主 的 百 姓 一 同 欢 呼 。 因 他 要 伸 他 仆 人 流 血 的 冤 ， 报 应 他 的 敌 人 ， 洁 净 他 的 地 ， 救 赎 他 的 百 姓 。 [kjv] Rejoice, O ye nations, with his people: for he will avenge the blood of his servants, and will render vengeance to his adversaries, and will be merciful unto his land, and to his people. [bbe] Be glad, O you his people, over the nations; for he will take payment for the blood of his servants, and will give punishment to his haters, and take away the sin of his land, for his people. 32:44 [hgb] 摩 西 和 嫩 的 儿 子 约 书 亚 去 将 这 歌 的 一 切 话 说 给 百 姓 听 。 [kjv] And Moses came and spake all the words of this song in the ears of the people, he, and Hoshea the son of Nun. [bbe] So Moses said all the words of this song in the hearing of the people, he and Hoshea, the son of Nun. 32:45 [hgb] 摩 西 向 以 色 列 众 人 说 完 了 这 一 切 的 话 ， [kjv] And Moses made an end of speaking all these words to all Israel: [bbe] And after saying all this to the people, 32:46 [hgb] 又 说 ， 我 今 日 所 警 教 你 们 的 ， 你 们 都 要 放 在 心 上 。 要 吩 咐 你 们 的 子 孙 谨 守 遵 行 这 律 法 上 的 话 。 [kjv] And he said unto them, Set your hearts unto all the words which I testify among you this day, which ye shall command your children to observe to do, all the words of this law. [bbe] Moses said to them, Let the words which I have said to you today go deep into your hearts, and give orders to your children to do every word of this law. 32:47 [hgb] 因 为 这 不 是 虚 空 ， 与 你 们 无 关 的 事 ， 乃 是 你 们 的 生 命 。 在 你 们 过 约 旦 河 要 得 为 业 的 地 上 必 因 这 事 日 子 得 以 长 久 。 [kjv] For it is not a vain thing for you; because it is your life: and through this thing ye shall prolong your days in the land, whither ye go over Jordan to possess it. [bbe] And this is no small thing for you, but it is your life, and through this you may make your days long in the land which you are going over Jordan to take for your heritage. 32:48 [hgb] 当 日 ， 耶 和 华 吩 咐 摩 西 说 ， [kjv] And the LORD spake unto Moses that selfsame day, saying, [bbe] That same day the Lord said to Moses, 32:49 [hgb] 你 上 这 亚 巴 琳 山 中 的 尼 波 山 去 ， 在 摩 押 地 与 耶 利 哥 相 对 ， 观 看 我 所 要 赐 给 以 色 列 人 为 业 的 迦 南 地 。 [kjv] Get thee up into this mountain Abarim, unto mount Nebo, which is in the land of Moab, that is over against Jericho; and behold the land of Canaan, which I give unto the children of Israel for a possession: [bbe] Go up into this mountain of Abarim, to Mount Nebo in the land of Moab opposite Jericho; there you may see the land of Canaan, which I am giving to the children of Israel for their heritage: 32:50 [hgb] 你 必 死 在 你 所 登 的 山 上 ， 归 你 列 祖 （ 原 文 作 本 民 ） 去 ， 象 你 哥 哥 亚 伦 死 在 何 珥 山 上 ， 归 他 的 列 祖 一 样 。 [kjv] And die in the mount whither thou goest up, and be gathered unto thy people; as Aaron thy brother died in mount Hor, and was gathered unto his people: [bbe] And let death come to you on the mountain where you are going, and be put to rest with your people; as death came to Aaron, your brother, on Mount Hor, where he was put to rest with his people: 32:51 [hgb] 因 为 你 们 在 寻 的 旷 野 ， 加 低 斯 的 米 利 巴 水 ， 在 以 色 列 人 中 没 有 尊 我 为 圣 ， 得 罪 了 我 。 [kjv] Because ye trespassed against me among the children of Israel at the waters of MeribahKadesh, in the wilderness of Zin; because ye sanctified me not in the midst of the children of Israel. [bbe] Because of your sin against me before the children of Israel at the waters of Meribath Kadesh in the waste land of Zin; because you did not keep my name holy among the children of Israel. 32:52 [hgb] 我 所 赐 给 以 色 列 人 的 地 ， 你 可 以 远 远 地 观 看 ， 却 不 得 进 去 。 [kjv] Yet thou shalt see the land before thee; but thou shalt not go thither unto the land which I give the children of Israel. [bbe] So you will see the land before you, but you will not go into the land which I am giving to the children of Israel.","sourceLink":"http://novel.tingroom.com/zongjiao/22/539.html","bookId":238,"book":{"id":238,"title":"Deuteronomy申命记（双语小说）","description":"简介： These be the words which Moses spake unto all Israel on this side Jordan in the wilderness, in the plain over against the Red sea, between Paran, and Tophel, and Laban, and Hazeroth, and Dizahab....","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/zongjiao/22","creation":"Aug 1, 2019 12:18:25 AM","modification":"Aug 1, 2019 12:23:53 AM"}}
