{"id":82688,"no":15,"title":"Page 15","content":"“You’re not going anywhere,” he rumbles and I feel the vibrations of his words straight between my legs.\n “I don’t want to go anywhere,” I tell him truthfully, knowing that I should leave because this situation has heartache written all over it.\n He presses his forehead to mine and takes a breath. “Almost every woman that I’ve fucked has also fucked one or more of my brothers,” he says quietly. I can feel bile crawling up my throat and a horrible pain hit my chest at his words. He was actually opening up to me but I wasn’t sure I wanted to know this.\n I don’t know why, but I feel like I need to share something about me to make us even, to make him understand that he isn’t the only one with baggage.\n “I was engaged and found out that my mother had been sleeping with my fiancé during the whole time we were together,” I blurt and immediately wonder why the hell I said it like that. Why I couldn’t just keep my damn mouth shut. “I\u0027m sorry. I shouldn’t have told you like that. It’s just…I know how you feel. Well, not that I have sisters that have had sex with the same guys as me but if I did, I would tell them that it’s really gross. Who does that?”\n I feel his body start shaking and I wonder what the hell could be funny about this conversation. “Are you laughing?” I feel his body still and he takes his face out of my neck and holds it in his hands, running his nose along mine.\n “I\u0027m not letting you go, November.” His eyebrows pull together and I can see something working behind his eyes. It looks like hope but I don’t know him well enough to be sure.\n “Just try and trust me, okay,” I say, watching my finger travel across his bottom lip. He places his forehead against mine again and doesn’t say anything for a long time. What is he thinking?\n “I\u0027m gonna try,” he says softly, taking a deep breath.\n “I\u0027m going to try too, you know?” I say, trying to lighten the mood. “I feel like I have a lot of competition to deal with. All those women constantly throwing themselves at you.” He opens his eyes and looks at me seriously.\n “I promise that it’s you, only you, for as long as this lasts. Now, we need to pick up the pizza so get your ass in the jeep.” And just like that, the conversation’s over and he’s pulling me off the sink and onto my feet. He kisses my nose and walks out of the bathroom, leaving me there with his words replaying in my head.\n It’s you, only you.\n I smile to myself in the mirror and walk out to the living room. I grab my bag then get my ass in his jeep.\n I wake up wrapped around Asher. My thigh is over his, my arm is across his waist and his arm is holding me close. Last night, after we got the pizza, we came back to his house, put in a movie and lounged on the couch while we ate. Then he moved the pizza box, got us both another beer, and stretched out with his bare feet up on the coffee table and dragging me by the hand until I was pressed into his side with my leg wrapped over his thigh and my arm around his waist, holding my beer and my head on his chest. After the movie, we got up and Asher pushed me toward the bedroom, telling me to get ready for bed and that he would let Beast out.\n I did my normal nightly routine, brushed my teeth, moisturized, took my hair down and brushed it out. I dug out my pajamas. This time it was a night gown with slim straps and a built-in bra. The cotton material gathered under the breast and went to above the knee. It was cute and not too sexy for sleeping with a new boyfriend. Well, I thought so anyways until Asher walked in. “Jesus,” he mumbled and I watched in fascination as his eyes got dark.\n Without saying anything else, or touching me at all, he pulled out something from his dresser then went into the bathroom and closed the door. As soon as the door closed behind him, I ran to the bed and jumped in, pulling the blankets up around my waist. Then I reached over to turn on the lamp. When he came back out, he was shirtless and wearing a pair of flannel pajama pants that looked hot on him. They hung low, showing the v of his hips and I could I feel my mouth water just watching him.\n He turned off the bedroom light then walked to the opposite side of the bed and got in. I sat there for a second then leaned over and turned off the light next to me. I lay down and pulled the covers up over my shoulder. The next thing I knew, I was being pulled across the bed, my back to Asher’s front, his arm around my waist and his legs bent into mine. He moved my hair off my shoulder gently.\n “Night, baby,” he whispered then kissed me where my neck and shoulder met.\n “Night,” I whispered, cuddling closer and listening to his breathing even out. I felt his body relax a few minutes later and I quickly followed him to sleep.\n I place my nose against his ribs and take a deep breath, absorbing his smell. It’s earthy and spicy and all Asher. I feel his hand flex on my hip where he’s holding me and I scoot closer. Suddenly, I\u0027m on my back, looking up at his face. Rumpled with sleep, he’s still beautiful.\n “Morning.” His voice is scratchy and rough and does serious stuff to my insides. His eyes are warm as he leans down and kisses me softly. Moving his face away, he holds my face in his hands.\n “Morning.” I breathe deeply, looking up at him and wondering what he’s thinking. “Are you okay?”\n “I like waking up to you.” I don’t say anything back but I can feel my face get soft. I like waking up to him too. “So what do you want to do today?” he asks as he nuzzles my neck. I wrap my leg around his hip and my arm on his back, feeling the hardness of his muscles and the smoothness of his skin.\n “Will you take me out on your four wheeler?” I ask. He lifts his head and smiles down at me.\n “How about we load ’em up. Mom and Dad have two hundred acres and a few ponds on their property. I’ll call the guys and see if they want to go four wheeling.”\n “Oh my God, yes!” I scream excitedly then I roll him over, straddling his hips. I bend down and kiss him quickly then go to jump off him and the bed but I\u0027m held down by his hands at my hips. I look at his face and see his eyes are dark and hooded. I know I\u0027m in trouble when his hands slide from my hips, down my thighs, and up under my nightgown.\n I feel the length of him pressed to my core and become instantly wet as his hands travel over my ribs. His thumbs move over the sensitive skin under my breast and my breathing becomes erratic. My nipples go instantly hard. He sits up and kisses me as one of his hands moves to my ass and the other grabs my hair, tilting my head. He tastes so good that my hands go to his head, holding him close. He bends me back so I\u0027m under him. My legs go around his waist and he kisses me deeply then sits back, looking down at me.\n We are both breathing heavily and I want his mouth back. I whimper as I feel his fingers at my hip, running up my thigh. He’s watching it travel over my skin. When his eyes lock with mine, he bends his head and takes my mouth again. His tongue is against mine then on my neck, licking and biting. His hand travels up my side to my breast and I feel the air against my nipple just before his mouth is on me, sucking hard. My back bows off the bed and I hold his head against me, trying to pull him closer. I’m shocked when I feel like I might orgasm just from this. I moan and he growls, releasing my breast then attacking my other nipple while his fingers roll and pull the one he just left. My hips lift into his and the friction hits me just right. I shatter into a million pieces, moaning his name as my legs tighten around him. My fingers are gripping his head while I come back slowly.\n Opening my eyes, I see that he’s looking down at me. “Fucking beautiful,” he says, kissing me again. This time it’s much harder. I kiss him back while my hand goes to his stomach. I can feel his muscles tense under my fingers and I drag my nails along his skin. Then my nightgown is gone, over my head, and Asher’s body is covering mine. His chest is against mine, his mouth is devouring mine and I roll him over and straddle his hips. His hips rise up as mine go down and I moan. My head flies back and then his mouth is on my nipple. He rolls me back over and his fingers go inside my panties and press in. “Fucking soaked.” He growls and that just makes me wetter. “Jesus, I can’t wait to taste you.” His fingers swirl over my clit and I grab onto his bicep, my head flying back for another swirl. His fingers fill me so perfectly that my hips lift off the bed. I pull his head down to mine and kiss him deeply. “Please,” I begged. I needed more.\n “I\u0027m not letting you come again until I can taste you doing it, baby.” I have a mini orgasm from his words and he starts sliding my panties down my legs.\n “Yo! Get your lazy ass out of bed.” My head jerks up. “What the fuck,” the person says then I hear barking and growling coming from Beast.\n “What the fuck?” Asher growls then the alarm starts going off. “Jesus Christ,” he mutters, rolls off the bed and I sit up, trying to find my nightgown. He puts an arm on each side on my waist then kisses me like my dog is not about to kill someone and the alarm is not going off. It’s wet and deep and I\u0027m breathing heavily when he pulls away. “Come to the kitchen, baby,” he says, putting a shirt on and walking out of the room. The alarm stops and I jump off the bed, pull my nightgown down over my head, then run to the bathroom to do my business.\n I brush my teeth, dig through my bag to find a hoodie and put it on over my nightgown then go to the kitchen. Asher is standing near the coffee pot and there is a guy sitting at the island. He’s slim but you can tell that he’s also muscular. His dark brown hair is messy and his face is model perfect with long lashes, dark eyes, and full lips.\n He’s looking at me strangely then his eyes drop to my legs. I feel so uncomfortable that I know I\u0027m not going to be able to stand in the same room as him wearing what I have on so I turn and run back to the bedroom. I find my sweats and tank and put them on quickly. When I go back out, the guy is smirking at me but Asher’s just smiling. “Come here, baby,” he says quietly, lifting his arm as I walk to him and my face goes into his chest. I feel his lips at my hairline. ”November, this is Sven. Sven, November.”\n “Hi. Nice to meet you,” I say and he’s looking between Asher and me. I can tell that he is guarded and that’s okay. I feel the same.\n “You too, November.” I smile at him then look around for Beast. I hear his paw on the door so I leave Asher’s side and slide the door open.\n Once again, I\u0027m trampled by my dog. I fall on my butt and he’s licking me and standing over me. I try to push him off but he’s too excited and I\u0027m laughing so hard that tears start to fall from my eyes. Then Beast is pushed away and Asher’s there smiling down at me.\n “Baby, we need to get you a smaller dog,” he says, picking me up off the floor.\n “He just gets a little excited.” I laugh and Asher runs his nose along mine.\n “Beautiful,” he whispers then kisses me softly and puts me back under his arm. He walks me back around the island into the kitchen and I\u0027m in such a fog that I forget for a second that someone else is here with us.\n I look up at Asher and smile big, biting my lip and realizing that I could fall in love with him. I look at Sven and he smiles and winks like he’s reading my mind. I smile back. \n","sourceLink":"https://allnovel.net/until-november-until-1/page-15.html","bookId":2744,"book":{"id":2744,"title":"Until November (Until #1)","description":"Storyline: \n Until November (Until #1) \n November is looking forward to getting to know her father and the safety of a small town. After leaving the Big Apple and her bad memories for Tennessee, November starts working for her dad at his strip club doing the books. The one time she’s allowed there during club hours she runs into Asher Mayson. He’s perfect until he opens his mouth and makes assumptions. November wants nothing to do with Asher but too bad for November, fate has other plans. \n Asher Mayson has never had a problem getting a woman, that is until November. Now all he can think about is making November his and keeping her safe. \n Warning 18+ sexual content and a strong Alpha Male.\n \n","cover":"https://allnovel.net/images/until-november-until-1.jpg","author":"Aurora Rose Reynolds","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/until-november-until-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:45:00 PM"}}
