{"id":82681,"no":8,"title":"Page 8","content":"“Relax, I just want to spend more time with you. Your dad trusts me so you’re safe. Tell me about your mom,” he says, completely ignoring my question about my phone and the fact that he kidnapped me.\n Geez…\n \"We\u0027re not talking about my mom. And my dad might like you but he doesn’t trust you. He says you’re a player. And after the performance I saw tonight, I would agree with him.”\n “I\u0027m no saint, but I have been honest with every woman that has hit my sheets. They know the score before anything goes down.” As much as it makes my stomach knot to think about him with all those women, I have no right to judge him.\n “You’re right. I\u0027m sorry,” I whisper. I heard him let out a breath and I swear I feel his whole body relax from across the cab of his jeep.\n “So, tell me about your mom.”\n “We’re not talking about my mom.”\n \"Why not?\"\n “Because my mom stresses me out. Talking about her gets me upset even when she\u0027s thousands of miles away.”\n “Well, my mom is awesome. She works for me and my brothers doing office work at our construction company. She bakes us cookies at least a couple times a week and makes sure we eat lunch.”\n I start giggling, thinking about him and his brothers, who are all built like redwood trees, having their mom bake them cookies and remind them to eat lunch.\n \"She sounds sweet,” I say, laughing because it really is nice. I hope one day I can be that kind of mom to my kids. “What does your dad do?” I ask stupidly.\n “Dad’s the sheriff. He’s been a cop forever. Mom never worked till we graduated high school.”\n “You’re really lucky. My mom was never really around,” I say, leaning my head back against the seat and closing my eyes. I can actually feel the sadness in my own words. He reaches over and squeezes my knee. I can’t deal with anyone feeling sorry for me, especially not him, so I change the subject.\n “So your brothers work construction with you? And you work for my dad?” I ask, confused.\n \"We all work together. I started the business after I got out of the Marine Corps. Then, when each of them graduated from college, they bought into the company. I don’t work for your dad. My cousin owns a business that supplies security and bodyguards to businesses like your dads. Those that aren’t the norm. Every once in a while, he’ll call me in and ask me to check on one of his men.\n \"It’s great that you get to work with your brothers,” I say, thinking it’s good that he doesn’t work at the strip club. I don’t know how I would feel about dating a guy in that line of work. Not that we’re dating, I remind myself. “Your family seems really nice. Well, your grandma and brothers, do anyways.”\n \"We\u0027re all close. It’s not always easy working together but at the end of the day, we know that we’re family. Do you have any brothers or sisters?\"\n “No. My mom had bigger dreams than having a family,” I say as we pull up in front of my house.\n The house is completely dark. The only light around is coming from the headlights of Asher’s jeep. “What the hell” I mumble, starting to feel nervous about going inside. Not because Asher is with me and we’re alone. This is more of a scared feeling, like when I have a bad dream and the fright stays stuck to you for a while after you wake up.\n \"Why didn\u0027t Mike leave a light on for you?\" Asher asks, looking over at me.\n “Uh… I don\u0027t know. I\u0027m always home way before he leaves. Maybe he just forgot,” I say, starting to get out of the jeep. I stop when he opens the glove box and pulls out a gun. “What are you doing?” I ask in shock.\n “Safety.” That’s all he says before he opens his door. I follow, opening mine. Before I even make it to the front of his jeep, he’s next to me, grabbing my hand. The warmth from his touch is soothing and I swear I can feel him rubbing his thumb back and forth against my skin. We start to walk up the porch when he stops me.\"Is there another way to get in the house?\" he asks, turning towards me.\n “My apartment is in the basement and has its own entrance,\" I tell him, looking around.\n “Stay close,” he says softly. I hold on to the back of his shirt, walking so close that I don’t think you could slip a piece of paper between us. I can hardly see in the darkness. The only source of light is coming from the moon, cutting through the clouds. Walking around the side of the house, my heart starts pounding. It feels like it’s going to jump out of my chest. My breathing starts to pick up when I think about what happened the last time I went home after dark.\n The night that I was attacked, I had been walking to my apartment from the subway. I passed the alley next to my building and a guy grabbed me from behind, covered my mouth then dragged me down into the shadows next to a dumpster. That’s where he proceeded to beat me. I fought as much as I could and was feeling dizzy by the time he stood over me, grabbing my head. I knew he was going to bash my head into the concrete so I closed my eyes and started to pray. Then, he was gone and I could vaguely see Beast attacking him.\n Asher must notice me shaking because he stops and pulls me into his big, warm body. His arms go around me and I feel his lips touch my hair. He smells like spicy, warm man and it makes me want to crawl into his skin. He pulls my face out of his chest and brings his face towards mine.\n “It’s okay, baby,” he whispers, putting his forehead to mine. “I won’t let anything happen to you. I want you to breathe deeply for me, okay.\" I am so caught up in how close he is that I can’t think about anything but leaning in and touching my mouth to his. I shake my head, trying to clear it, and take a deep breath. I wonder if he can read my mind because even in the darkness, I can see the white of his smile.\n “You ready?” he asks. I feel his breath against my lips so I pull my face away and nod, not trusting myself to speak. My apartment door is down a short set of stairs. Asher\u0027s in front of me and he opens the door. “Stay here until I come and get you,” he says, entering my dark apartment.\n \"Okay,” I say as my hands start to shake. After a few minutes, Beast comes running out. I bend down to pet him but his fur feels wet. What the heck? Holding my hands close to my face, they look really dark. Then the light comes on and I scream. My hands are covered in blood. “Oh my God! What happened?” I say, running my hands over Beast’s body. He\u0027s red also but I can\u0027t feel any kind of cuts or holes on him. I\u0027m shaking so badly that I have to sit on the ground. Beast immediately crawls into my lap.\n \"Fuck,\" Asher clips, coming outside. He pushes Beast off me and pulls me into his arms. “Baby, it’s okay. Calm down.”\n I tho… I… I thought Beast was hurt but I couldn’t find anything wrong with him. Why is he covered in blood?” I sob while he rubs my back and pulls me tighter into him.\n “Beast is fine but we need to call the police. Someone broke into the house and used something red to write on the walls. Somehow, Beast got it on him before they locked him upstairs.” Before he can finish what he’s saying, I run into my apartment. The living room is trashed. On the wall, in red letters that looks like blood, is a message.\n No sun - no moon!\n No morn - no noon -\n No dawn - no dusk - no proper time of day.\n No warmth, no cheerfulness, no healthful ease,\n No comfortable feel in any member -\n No shade, no shine, no butterflies, no bees,\n No fruits, no flowers, no leaves, no birds! -\n November!\n “What the hell?” I whisper as Asher picks me up and carries me back outside.\n “I know that poem. It’s November by Thomas Hood. Why would someone write that on my wall?” I ask, trying to figure out what the words mean.\n “I\u0027m not sure,” he says. I’m sure I feel him kiss the side of my head.\n “I can walk, you know,” I grumble. He doesn’t answer me or put me down until he drops me in the passenger side of his jeep. With my feet out the door, he stands between my legs. His arms wrap around my body and one of his hands reaches in his back pocket for his phone.\n “Hey, Dad. Gotta problem. I\u0027m at Big Mike’s house with his daughter, November. Her apartment was broken into. Yeah, Mike’s daughter. We’re not gonna talk about that shit right now. Yeah, see ya.\" Closing the phone, he tosses it behind me on the driver’s seat. I\u0027m looking down at my hands. They’re covered in red gunk and so are my jeans. All I can wonder is who would do this and why.\n “Look at me, baby!” I lift my eyes to his and they are warm and concerned. “I will make sure that you are safe. I promise.”\n Looking into his eyes with the jeep’s interior light reflecting off them, I can see he’s worried so I tell him about New York and being attacked before I left. He listens the whole time. His eyes turn darker and his jaw is getting tighter with every word. He shakes his head when I finish, pulling me in for a hug that I think is more for him than for me.\n \"Thank you for helping me,\" I say.\n “You,” he says, kissing my head, “never have to thank me for doing something I want to do.\"\n “Well, I\u0027m glad you were here.” And that’s not a lie. I can’t imagine what would have happened if I had come home by myself.\n \"Fuck, baby, me too,” he says, letting out a long breath.\n I look down at Beast, who is sitting at our feet, looking up at us and waiting to see if we’re still going for a walk or if I might have a treat. His head tilts when I start talking to him. “Looks like you’re gonna get a bath, boy.” He tilts his head the other direction. “And when you’re done, I need take one too,” I say then realized that I was, once again, talking to my dog. I look up at Asher and he’s smiling. I said the first thing that popped into my head.\n \"Do I look like Carrie?” He burst out laughing then kissed my forehead.\n “Yeah, you’re covered from having that damn dog sit on you while you hugged him. When my dad gets here and checks everything out, you can shower.”\n “Oh my God,” I whisper, horrified when I remember that his dad is the sheriff. “Your dad’s coming?”\n “Yeah, baby. He\u0027s the sheriff.”\n “Oh my God, your dad’s coming,” I repeat. Without thinking, I stick my hands up the front of his shirt and use it to wipe my face. \"Is that better?” I ask.\n \"I can\u0027t believe you just did that,” he says, sounding completely shocked.\n “Oh, God. Your dad’s going to meet me looking like Carrie,” I cry out. I still have my hands up his shirt so I repeat the process of wiping my face. Then I use the inside to wipe my hands. I look up because he\u0027s not saying anything.\n \"I can\u0027t believe you just did that.”\n “Okay! So, is most of the red off my face?” I ask.\n “You owe me a new shirt,” he tells me.\n \"Fine, whatever. But is the red gone?”\n “Yeah, baby. The red is mostly gone but now I don\u0027t know if I should kiss you or spank you for that shit.\"\n “Whatever,\" I whisper and press my forehead against his chest to hide my huge smile. My belly was doing acrobatics at the thought of him kissing me. Two minutes later, red and blue lights flash up the driveway and two police cars pull in next to Asher’s jeep. Looking around Asher\u0027s big body, I see a very tall man with grey hair mixed with dirty blond walking towards us. This must be his dad. \n","sourceLink":"https://allnovel.net/until-november-until-1/page-8.html","bookId":2744,"book":{"id":2744,"title":"Until November (Until #1)","description":"Storyline: \n Until November (Until #1) \n November is looking forward to getting to know her father and the safety of a small town. After leaving the Big Apple and her bad memories for Tennessee, November starts working for her dad at his strip club doing the books. The one time she’s allowed there during club hours she runs into Asher Mayson. He’s perfect until he opens his mouth and makes assumptions. November wants nothing to do with Asher but too bad for November, fate has other plans. \n Asher Mayson has never had a problem getting a woman, that is until November. Now all he can think about is making November his and keeping her safe. \n Warning 18+ sexual content and a strong Alpha Male.\n \n","cover":"https://allnovel.net/images/until-november-until-1.jpg","author":"Aurora Rose Reynolds","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/until-november-until-1.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:45:00 PM"}}
