{"id":65893,"no":19,"title":"Page 19","content":"He pushed the plunger very slowly, injecting the liquid into the scalp vein until the syringe was empty.\\n\\n \"All done. That wasn\u0027t so bad, was it?\" Jonas heard his father say cheerfully. He turned aside and dropped the syringe into a waste receptacle.\\n\\n Now he cleans him up and makes him comfy, Jonas said to himself, aware that The Giver didn\u0027t want to talk during the little ceremony.\\n\\n As he continued to watch, the newchild, no longer crying, moved his arms and legs in a jerking motion. Then he went limp. He head fell to the side, his eyes half open. Then he was still.\\n\\n With an odd, shocked feeling, Jonas recognized the gestures and posture and expression. They were familiar. He had seen them before. But he couldn\u0027t remember where.\\n\\n Jonas stared at the screen, waiting for something to happen. But nothing did. The little twin lay motionless. His father was putting things away. Folding the blanket. Closing the cupboard.\\n\\n Once again, as he had on the playing field, he felt the choking sensation. Once again he saw the face of the lighthaired, bloodied soldier as life left his eyes. The memory came back.\\n\\n He killed it! My father killed it! Jonas said to himself, stunned at what he was realizing. He continued to stare at the screen numbly.\\n\\n His father tidied the room. Then he picked up a small carton that lay waiting on the floor, set it on the bed, and lifted the limp body into it. He placed the lid on tightly.\\n\\n He picked up the carton and carried it to the other side of the room. He opened a small door in the wall; Jonas could see darkness behind the door. It seemed to be the same sort of chute into which trash was deposited at school.\\n\\n His father loaded the carton containing the body into the chute and gave it a shove.\\n\\n \"Bye-bye, little guy,\" Jonas heard his father say before he left the room. Then the screen went blank.\\n\\n The Giver turned to him. Quite calmly, he related, \"When the Speaker notified me that Rosemary had applied for release, they turned on the tape to show me the process. There she was—my last glimpse of that beautiful child—waiting. They brought in the syringe and asked her to roll up her sleeve.\\n\\n \"You suggested, Jonas, that perhaps she wasn\u0027t brave enough? I don\u0027t know about bravery: what it is, what it means. I do know that I sat here numb with horror. Wretched with helplessness. And I listened as Rosemary told them that she would prefer to inject herself.\\n\\n \"Then she did so. I didn\u0027t watch. I looked away.\"\\n\\n The Giver turned to him. \"Well, there you are, Jonas. You were wondering about release,\" he said in a bitter voice.\\n\\n Jonas felt a ripping sensation inside himself, the feeling of terrible pain clawing its way forward to emerge in a cry.\\n\\n 20\\n\\n \"I won\u0027t! I won\u0027t go home! You can\u0027t make me!\" Jonas sobbed and shouted and pounded the bed with his fists.\\n\\n \"Sit up, Jonas,\" The Giver told him firmly.\\n\\n Jonas obeyed him. Weeping, shuddering, he sat on the edge of the bed. He would not look at The Giver.\\n\\n \"You may stay here tonight. I want to talk to you. But you must be quiet now, while I notify your family unit. No one must hear you cry.\"\\n\\n Jonas looked up wildly. \"No one heard that little twin cry, either! No one but my father!\" He collapsed in sobs again.\\n\\n The Giver waited silently. Finally Jonas was able to quiet himself and he sat huddled, his shoulders shaking.\\n\\n The Giver went to the wall speaker and clicked the switch to ON.\\n\\n \"Yes, Receiver. How may I help you?\"\\n\\n \"Notify the new Receiver\u0027s family unit that he will be staying with me tonight, for additional training.\"\\n\\n \"I will take care of that, sir. Thank you for your instructions,\" the voice said.\\n\\n \"I will take care of that, sir. I will take care of that, sir,\" Jonas mimicked in a cruel, sarcastic voice. \"I will do whatever you like, sir. I will kill people, sir. Old people? Small newborn people? I\u0027d be happy to kill them, sir. Thank you for your instructions, sir. How may I help y—\" He couldn\u0027t seem to stop.\\n\\n The Giver grasped his shoulders firmly. Jonas fell silent and stared at him.\\n\\n \"Listen to me, Jonas. They can\u0027t help it. They know nothing.\"\\n\\n \"You said that to me once before.\"\\n\\n \"I said it because it\u0027s true. It\u0027s the way they live. It\u0027s the life that was created for them. It\u0027s the same life that you would have, if you had not been chosen as my successor.\"\\n\\n \"But he lied to me!\" Jonas wept.\\n\\n \"It\u0027s what he was told to do, and he knows nothing else.\"\\n\\n \"What about you? Do you lie to me, too?\" Jonas almost spat the question at The Giver.\\n\\n \"I am empowered to lie. But I have never lied to you.\"\\n\\n Jonas stared at him. \"Release is always like that? For people who break the rules three times? For the Old? Do they kill the Old, too?\"\\n\\n \"Yes, it\u0027s true.\"\\n\\n \"And what about Fiona? She loves the Old! She\u0027s in training to care for them. Does she know yet? What will she do when she finds out? How will she feel?\" Jonas brushed wetness from his face with the back of one hand.\\n\\n \"Fiona is already being trained in the fine art of release,\" The Giver told him. \"She\u0027s very efficient at her work, your red-haired friend. Feelings are not part of the life she\u0027s learned.\"\\n\\n Jonas wrapped his arms around himself and rocked his own body back and forth. \"What should I do? I can\u0027t go back! I can\u0027t!\"\\n\\n The Giver srood up. \"First, I will order our evening meal. Then we will eat.\"\\n\\n Jonas found himself using the nasty, sarcastic voice again. \"Then we\u0027ll have a sharing of feelings?\"\\n\\n The Giver gave a rueful, anguished, empty laugh. \"Jonas, you and I are the only ones who have feelings. We\u0027ve been sharing them now for almost a year.\"\\n\\n \"I\u0027m sorry, Giver,\" Jonas said miserably. \"I don\u0027t mean to be so hateful. Not to you.\"\\n\\n The Giver rubbed Jonas\u0027s hunched shoulders. \"And after we eat,\" he went on, \"we\u0027ll make a plan.\"\\n\\n Jonas looked up, puzzled. \"A plan for what? There\u0027s nothing. There\u0027s nothing we can do. It\u0027s always been this way. Before me, before you, before the ones who came before you. Back and back and back.\" His voice trailed the familiar phrase.\\n\\n \"Jonas,\" The Giver said, after a moment, \"it\u0027s true that it has been this way for what seems forever. But the memories tell us that it has not always been. People felt things once. You and I have been part of that, so we know. We know that they once felt things like pride, and sorrow, and—\"\\n\\n \"And love,\" Jonas added, remembering the family scene that had so affected him. \"And pain.\" He thought again of the soldier.\\n\\n \"The worst part of holding the memories is not the pain. It\u0027s the loneliness of it. Memories need to be shared.\"\\n\\n \"I\u0027ve started to share them with you,\" Jonas said, trying to cheer him.\\n\\n \"That\u0027s true. And having you here with me over the past year has made me realize that things must change. For years I\u0027ve felt that they should, but it seemed so hopeless.\\n\\n \"Now for the first time I think there might be a way,\" The Giver said slowly. \"And you brought it to my attention, barely—\" He glanced at the clock, \"two hours ago.\"\\n\\n Jonas watched him, and listened.\\n\\n It was late at night, now. They had talked and talked. Jonas sat wrapped in a robe belonging to The Giver, the long robe that only Elders wore.\\n\\n It was possible, what they had planned. Barely possible. If it failed, he would very likely be killed.\\n\\n But what did that matter? If he stayed, his life was no longer worth living.\\n\\n \"Yes,\" he told The Giver. \"I\u0027ll do it. I think I can do it. I\u0027ll try, anyway. But I want you to come with me.\"\\n\\n The Giver shook his head. \"Jonas,\" he said, \"the community has depended, all these generations, back and back and back, on a resident Receiver to hold their memories for them. I\u0027ve turned over many of them to you in the past year. And I can\u0027t take them back. There\u0027s no way for me to get them back if I have given them.\\n\\n \"So if you escape, once you are gone—and, Jonas, you know that you can never return—\"\\n\\n Jonas nodded solemnly. It was the terrifying part. \"Yes,\" he said, \"I know. But if you come with me—\"\\n\\n The Giver shook his head and made a gesture to silence him. He continued. \"If you get away, if you get beyond, if you get to Elsewhere, it will mean that the community has to bear the burden themselves, of the memories you had been holding for them.\\n\\n \"I think that they can, and that they will acquire some wisdom. But it will be desperately hard for them. When we lost Rosemary ten years ago, and her memories returned to the people, they panicked. And those were such few memories, compared to yours. When your memories return, they\u0027ll need help. Remember how I helped you in the beginning, when the receiving of memories was new to you?\"\\n\\n Jonas nodded. \"It was scary at first. And it hurt a lot.\"\\n\\n \"You needed me then. And now they will.\"\\n\\n \"It\u0027s no use. They\u0027ll find someone to take my place. They\u0027ll choose a new Receiver.\"\\n\\n \"There\u0027s no one ready for training, not right away. Oh, they\u0027ll speed up the selection, of course. But I can\u0027t think of another child who has the right qualities—\"\\n\\n \"There\u0027s a little female with pale eyes. But she\u0027s only a Six.\"\\n\\n \"That\u0027s correct. I know the one you mean. Her name is Katharine. But she\u0027s too young. So they will be forced to bear those memories.\"\\n\\n \"I want you to come, Giver,\" Jonas pleaded.\\n\\n \"No. I have to stay here,\" The Giver said firmly. \"I want to, Jonas. If I go with you, and together we take away all their protection from the memories, Jonas, the community will be left with no one to help them. They\u0027ll be thrown into chaos. They\u0027ll destroy themselves. I can\u0027t go.\"\\n\\n \"Giver,\" Jonas suggested, \"you and I don\u0027t need to care about the rest of them.\"\\n\\n The Giver looked at him with a questioning smile. Jonas hung his head. Of course they needed to care. It was the meaning of everything.\\n\\n \"And in any case, Jonas,\" The Giver sighed, \"I wouldn\u0027t make it. I\u0027m very weakened now. Do you know that I no longer see colors?\"\\n\\n Jonas\u0027s heart broke. He reached for The Giver\u0027s hand.\\n\\n \"You have the colors,\" The Giver told him. \"And you have the courage. I will help you to have the strength.\"\\n\\n \"A year ago,\" Jonas reminded him, \"when I had just become a Twelve, when I began to see the first color, you told me that the beginning had been different for you. But that I wouldn\u0027t understand.\"\\n\\n The Giver brightened. \"That\u0027s true. And do you know, Jonas, that with all your knowledge now, with all your memories, with all you\u0027ve learned—still you won\u0027t understand? Because I\u0027ve been a little selfish. I haven\u0027t given any of it to you. I wanted to keep it for myself to the last.\"\\n\\n \"Keep what?\"\\n\\n \"When I was just a boy, younger than you, it began to come to me. But it wasn\u0027t the seeing-beyond for me. It was different. For me, it was hearing-beyond.\"\\n\\n Jonas frowned, trying to figure that out. \"What did you hear?\" he asked.\\n\\n \"Music,\" The Giver said, smiling. \"I began to hear something truly remarkable, and it is called music. I\u0027ll give you some before I go.\"\\n\\n Jonas shook his head emphatically. \"No, Giver,\" he said. \"I want you to keep that, to have with you, when I\u0027m gone.\" \\n\\n","sourceLink":"https://allnovel.net/the-giver-the-giver-quartet-1/page-19.html","bookId":1701,"book":{"id":1701,"title":"The Giver (The Giver Quartet #1)","description":"Storyline: The Giver (The Giver Quartet #1) \\n Jonas\u0027 world is perfect. Everything is under control. There is no war or fear or pain. There are no choices. Every person is assigned a role in the Community. When Jonas turns twelve, he is singled out to receive special training from The Giver. The Giver alone holds the memories of the true pain and pleasure of life. Now, it is time for Jonas to receive the truth. There is no turning back.\\n","cover":"https://allnovel.net/images/the-giver-the-giver-quartet-1.jpg","author":"Lois Lowry","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-giver-the-giver-quartet-1.html","creation":"Oct 5, 2019 8:57:52 AM","modification":"Oct 5, 2019 9:58:56 AM"}}
