{"id":90413,"no":24,"title":"Page 24","content":"What if you open the box and there are bugs in it?\\n\\n The bastard! I put my ear to the box and shake it. Doesn’t sound like there are bugs in it. Doesn’t sound like there is anything in it. The box is light as a feather. I sigh at myself as my curiosity gets the better of me and I open it hesitantly. There’s a small vile of orange colored liquid in the very center. On closer inspection, the vial has Chinese writing on it. Considering I don’t speak or know any Chinese, this doesn’t help me. I have no idea what I’m looking at.\\n\\n Just as I pick up my cell phone to text Ash, the phone chimes in my hand. It’s a message from Asher and I chuckle because I forgot I changed his name in my phone to ASSer. I open it and it contains a link to a website. I click the link and see a picture of the exact vial I have in my hands. I scroll down and read the information. The vial contains an old Chinese remedy which is used as massage oil.\\n\\n Scrunching my face, I hold the vial close to my nose and sniff. It smells sweet like vanilla.\\n\\n There isn’t enough oil in the vial to have a full body massage. There’s barely enough in there to massage a foot. I read on and when I get to the part that describes the vials contents as intimate pleasure oil, my eyes widen in interest.\\n\\n Oh, it’s that kind of oil!\\n\\n Skimming through the rest of the page information, I get to the end of the page and almost run down the hall and into my room to try this stuff out. It said it takes around twenty minutes for it to start working and that you only need to use a single drop on your pleasure center. Opening the vial, I hold out my index finger and place a single drop on it. Rubbing my thumb and finger together, I shimmy out of my pants and underwear and massage it into my ‘pleasure center’. Not a minute passes before I feel tingling down below.\\n\\n Starting to feel antsy, I move my ass into the kitchen and walk around. A few minutes of doing nothing but walking around, starts to make me even antsier. The tingling between my legs is so intense my face is flushed bright red, my heart races and my breathing heavies. It almost feels like I’m going to have an or-\\n\\n “Oh, God! Oh my Goddd! Shit! Fuck! Jesus Christ!” I hold onto the counter for support. My legs shake and my eyes roll back as I come hard. From doing nothing.\\n\\n This oil shit is the shit!\\n\\n On jelly legs, I walk to my room and flop backwards onto my bed. I’ve officially forgiven Ash for whatever the fuck I was pissed at him about. Walking around in only a tee, I quickly put on a pair of underwear, grab my keys and head next door. I unlock the door, breathing heavily and walk into Ash’s place.\\n\\n There he sits behind one of the computer monitors stroking his cock and with a moan I fall to my knees. The tingling between my legs intensifies. He smirks like the ass he is. He knew exactly what he was doing to me. Crawling over to him, I look up at the monitor and gasp.\\n\\n That’s my bed. In my room. That’s my bed in my room!\\n\\n I choke out, “You’ve been watching me?”\\n\\n He nods and smiles, “The cameras were for safety…of course.”\\n\\n Another orgasm isn’t far behind. I turn my flushed face up to him and beg, “Please fix me!”\\n\\n He shakes his head and tuts, “I’d love to. I really would.” Leaning down, he grips the back of my neck and says huskily, “But you didn’t ask me nicely.”\\n\\n I moan, “Please, Asher! Please fuck me! Oh God, please!”\\n\\n Already lowering his pants, obviously mollified, he says softly, “That’s my girl.” Walking around me, he kneels behind me and tightly grips my ponytail. He leans over me and whispers into my ear, “Buckle up.”\\n\\n In one fell swoop, he pulls down my panties and thrusts into me. Gasping for breath, I come again. He growls and thrusts into me over and over. He states, “You were naughty. Naughty girls get punished.” I shriek when he slaps my ass. The tingles intensify and I whimper.\\n\\n Not again!\\n\\n He spanks me while thrusting into me and I cry out, “I can’t take anymore, Ash! You need to stop!”\\n\\n Gripping my hair tighter and pulling it back to expose my throat, he says in perfect calm, “You will take your punishment tonight or we’ll do this all over again night after night until you ride it out.”\\n\\n Holy fuck, it turns me on when he gets like this! I know what he says isn’t an empty threat and it’s not like I actually want to stop.\\n\\n Can you die from a pleasure overload?\\n\\n Without warning, I come again. I shriek and moan. My legs shake while my eyes roll back. Ash wraps an arm around my stomach for support and pounds into me. His balls slap my clit with every thrust and a few seconds later I come again. Squealing and sobbing all at once, I yell out, “I’m sorry! I won’t do it again!”\\n\\n Ash pants, “Do what?”\\n\\n I cry out, “I have no idea!”\\n\\n Ash chuckles before he groans long and hard. Pulling my hair, he leans over me to whisper in my ear, “Fucking beautiful when you lose control. You are perfect. Take it, baby. You want my come?”\\n\\n “Yes! Give it to me!” I yell out.\\n\\n He groans. “Here it comes, baby.”\\n\\n He grinds his crotch against mine and I moan long and low. He snaps, “Give it to me, Nat!”\\n\\n And my traitorous body does. This orgasm is so intense it hurts. I sob through it and hear Ash say, “Here it comes, girl.”\\n\\n His body stiffens and he groans with every jerk of his orgasm. After a moment, he walks away from me, leaving me a panting mess on the floor. I look over at him as he wipes the wetness away from his thighs. I guess I came a lot. A whimper breaks free from my throat when the tingles start again. Ash opens the fridge, takes a carton out and brings it to me. He asks, “You read the instructions, babe?”\\n\\n Whimpering, I nod. He sighs and says, “Obviously not good enough.”\\n\\n He pours something cool over my ‘pleasure center’, which has officially overloaded. Using his hand, he gently washes me and the tingles stop. I cry out, “Thank you, God!”\\n\\n Ash chuckles and holds up the carton to show me. It’s milk. I squawk, “Milk?”\\n\\n He raises his brows and nods. Like I’m the stupid one! Exhausted and sated, I whisper, “Sweet baby Jesus, that was something else.”\\n\\n Pushing my hair out of my face, he says, “No more demon witch lady?”\\n\\n I cringe, “Nuh uh. Nope.” I close my eyes and Ash lifts me. Unable to open my eyes, I feel him lower me onto something soft. I assume it’s his bed. He climbs in next to me and takes hold of my hand. Kissing my brow, he whispers, “Goodnight, pretty girl.”\\n\\n Half asleep, I whisper, “Night, Ash. Love you.”\\n\\n Then promptly pass out.\\n\\n Waking earlier than I expected, I look over at a sleeping Asher.\\n\\n No more nightmares. Yay!\\n\\n Smiling, I stretch and slip out of bed. I walk over to the kitchen and get a glass of water. I make my way back to bed and my heart swells watching him sleep. He looks at peace. Too bad I have to do this.\\n\\n I pour the contents of my glass over his head. Ash coughs and sputters. He looks up at me like I’ve gone cuckoo bananas and says, “Fucking devil woman! What the fuck?”\\n\\n Matter-of-factly, I tell him, “That’s for putting cameras in my place and watching me without me knowing.”\\n\\n His face actually loses some of its steam and he opens his mouth to say something, but I cut him off by kneeling on the bed and kissing him deeply. His argument forgotten, he wraps his arms around me and pulls me to him. Pulling away slightly, he says, “Wait. I have to know something.”\\n\\n I look up at him and nod. He says, “Do you love me?”\\n\\n And I almost choke. My face flushes and I squeak, “What?”\\n\\n He runs a hand through his hair and tells me, “Last night when you were falling asleep, you said you loved me.”\\n\\n Oh shit. Mother fucking sleep talk! Look at what you did?\\n\\n I sputter, “I- ah- I’m not- What I mean is I don’t kn-”\\n\\n Taking hold of my hand, he says softly, “Loving someone’s not a bad thing, right?”\\n\\n He’s genuinely asking me like he doesn’t know.\\n\\n This makes me sad.\\n\\n Squeezing his hand, I cup his cheek and confirm, “No, sweetie. Loving someone can be a really good thing.”\\n\\n He nods and avoids my gaze when he asks again slowly, “So, do you, ya know, love me?”\\n\\n I don’t answer for a long while. Fear of rejection creeps up my chest and into my throat. Ash looks so much like a child right now. Unsure of himself and a little naïve. I kiss his lips and say against them, “Yeah, baby. I love you.”\\n\\n Pulling back from me and looking me in the eye, he rambles, “Okay. Okay, good. This is nice. I mean, I feel nice. Yeah, okay. This is okay.”\\n\\n Hmmm, not the answer I was expecting. Nor the one I was hoping for.\\n\\n This makes me even sadder.\\n\\n My heart hurts.\\n\\n Ash doesn’t love me back.\\n\\n Putting on a brave face, I smile at him and move to get up. With furrowed brows, he pulls me back to him and whispers, “Never made love before.”\\n\\n Leaning forward, he kisses my stunned and lax mouth. I lean back and ask, “What’s happening here?”\\n\\n He smiles. “I get that you don’t get it yet.”\\n\\n I whisper wide-eyed, “Get what?”\\n\\n His brow furrows but he softens it with a smile. “That you’re my girl.”\\n\\n I’m stunned. I whisper, “I don’t know what to do with this new information.”\\n\\n His lip twitches as he responds, “Just hold onto me and ride the wave, babe.”\\n\\n Blinking once, twice, I respond on a whisper, “Okay.”\\n\\n He lowers his face to mine and kisses me again. A new type of kiss. A gentle, loving kiss.\\n\\n “This is new for me, so be patient. I’m bound to fuck up once or twice,” he explains.\\n\\n Nodding slowly, I circle his neck and place my mouth against his. He moans into my mouth and pulls me into him. His arms wrap around my back and he strokes me sweetly with every kiss. His lips are like wine and I’m feeling love drunk. Reaching for the bottom of his tee, I lift it up and over his head. He does the same to me and for the first time, we don’t take our eyes off each other. This time it’s different. We take our time exploring each other and removing items of clothing til we sit opposite each other naked. His hand reaches out and I curve my face into his touch. His eyes are hooded with lust but there’s more there. I can’t quite put my finger on it.\\n\\n Moving back from me, Ash sits in the center of the bed with his back to the heardboard. He holds his hand out to me and with a small smile, I take it. When I’m close enough, he lifts me and adjusts me to straddle him. I sit on his thighs and move slightly so his cockhead kisses my folds. I rock against him and he groans, wrapping his arms around me. Never closing his eyes, he captures my lips in a deep and sensual kiss.\\n\\n If I ever had doubts before, I take them all back. I can safely say I am in love with Asher Collins.\\n\\n I’ve never seen this side of him before. I doubt anyone has.\\n\\n This thought makes me head-over-heels happy.\\n\\n Unable to stand the imaginary distance any longer, I lift myself, move forward a little and sink down onto him. Wrapping my arms around his neck, I kiss him and with my feet planted on the bed, I lift and drop. Slowly. Almost slow enough to be classed as torture.\\n\\n Getting into a rhythm, Ash drops his hands to my ass and squeezes. I hold his face in my hands and search his face for some clue to what he’s feeling. He doesn’t give much away, but I see he’s looking at me differently. Tenderly.\\n\\n I like it.\\n\\n Changing it up, I lower myself onto him and grind back and forth. He groans and grips my ass tighter, warmth spreads through my belly and my pussy clenches.\\n\\n Almost there.\\n\\n I don’t ever want this to stop. The feelings that charge through me right now are strong and empowering. I love that we’re discovering something unknown together. The tingles start and I whisper, “Love you, Ash,” before taking his mouth in deep, wet kisses. He returns my kisses enthusiastically and thrusts up into me. He moans as I start to come and pulls me down into his body. Without a word, he stills and I feel his cock jerk in me.\\n\\n High on bliss, I lean my forehead onto his shoulder and hug him tight. He wraps his arms around me and kisses my shoulder once, twice, three times. “So that was making love?”\\n\\n Lifting my head, I smile sleepily. “Yeah, I guess. I’d never done it before.” Taking a huge risk here, I go on, “I think it only works when two people love each other though.”\\n\\n His face falls and his brow furrows. He whispers, “Oh.”\\n\\n And there’s my answer.\\n\\n He doesn’t love me.\\n\\n Hiding my hurt, I wrap my arms around his neck and squeeze my eyes shut to stop the tears from leaking. He strokes my naked back lovingly and says, “Well, either way, I liked it.”\\n\\n Resting my head on his shoulder, I reply quietly, “I’m glad, sweetie.”\\n\\n Feeling like a complete ass, I almost excuse myself when his phone vibrates on the nightstand. Being closer to it, I pick it up and read the display.\\n\\n Grace calling.\\n\\n Who the fuck is Grace?\\n\\n Handing the phone over to Ash with an annoyed expression, my attitude changes when he takes the phone from my hand, reads the display through furrowed brows then throws the phone as hard as he can. It hits the wall and smashes into pieces. Shocked and a little edgy, I start to slide off him but he holds me firm and gruffly states, “Stay. Just for a bit longer.”\\n\\n There’s a hint of desperation in his voice and I know something is bothering him. Naked and still on his lap, my arms band around his neck and I rest my head on his shoulder once more. I can hear his heart racing through his neck. I don’t know what just happened, but I want to be there for him.\\n\\n My non-boyfriend needs me.\\n\\n Chapter Twenty\\n\\n My girl\\n\\n Never thought I’d see the day when I actually wanted to stay in bed with a broad and just hold her. But that’s exactly what I did this morning.\\n\\n Getting Nat to tell me how she felt about me? Hard. \\n\\n","sourceLink":"https://allnovel.net/love-thy-neighbour-friend-zoned-2/page-24.html","bookId":2799,"book":{"id":2799,"title":"Love Thy Neighbour (Friend-Zoned #2)","description":"Storyline: Love Thy Neighbour (Friend-Zoned #2) \\n Asher \u0027Ghost\u0027 Collins and Natalie Kovac shared a passionate night together. One neither of them can forget. \\n So why is it so hard for them to be around each other? \\n With no hope of the two getting along they decide to go their separate ways. And somehow end up closer than they\u0027ve ever been. \\n Will friendship ever be enough for the pair?\\n","cover":"https://allnovel.net/images/love-thy-neighbour-friend-zoned-2.jpg","author":"Belle Aurora","type":"Humorous","source":"allnovel","link":"https://allnovel.net/love-thy-neighbour-friend-zoned-2.html","creation":"Oct 5, 2019 9:01:30 AM","modification":"Oct 5, 2019 5:41:26 PM"}}
