{"id":90396,"no":7,"title":"Page 7","content":"He smirks, and it’s so beautiful that I want to lick him. He lowers his face and buries it into the side of my neck.\n God, that feels amazing.\n I’m becoming desperate for some form of connection. Any connection. And I make a very stupid decision. I run my hand down his chest, scraping my fingernails roughly along his ribs and stomach til I get to the zipper of his jeans. Before I know what’s happening, Cole lifts me in one fell swoop, steps into the apartment and kicks the door closed behind us.\n No! This isn’t supposed to be happening!\n Quiet, brain! We’re getting to the good part!\n He supports my booty with his forearms, and I run my fingertips gently down his cheeks as we search one another’s face. “Sofa,” I whisper.\n He walks over to the sofa with me wrapped around him. He sits carefully and I straddle him. I can feel his hard length through his jeans and it aligns perfectly with my sweet spot. My body moves of its own accord. I grind against him and moan.\n The friction is amazing.\n Cole’s eyes roll back and he groans. He grips my hips and mutters, “Baby. Mouth.”\n I lean down and kiss his lips once softly. Then I press harder against his lips, open my mouth a little and gently caress them with my tongue. He growls against my lips and it makes me even wetter. His muscular arms curl around my lower and upper back and he holds me tight. He pulls away slightly and says, “I’ve never connected with someone like this before.”\n I answer honestly. “Me either.”\n We’re magnetic together and it astounds me.\n He pulls me down so my forehead touches his. “This is moving fast, don’t you think?”\n “Yeah, it really is. We should stop. Like, now.” I exhale and nod as I respond sullenly.\n He chuckles and gently caresses my cheek. “I’m glad you sound torn up about it, sunshine. I want to kiss that pout away though.” He pushes a stray hair behind my ear and suggests, “Why don’t we just order in?”\n Taking a moment to think about it, I toy with his collar and admit, “That does sound good.”\n He smiles, pulls me down to him and kisses me deeply.\n I’m lost.\n Cole’s kisses are addictive.\n After a minute, I pull away and chuckle. “I’d better get up or we’ll end up on here all night.”\n He sighs, gets up and very obviously adjusts his erection. I flush and giggle. He play frowns and murmurs, “Laugh it up, sunshine. If you don’t quit tempting me, I might just ravish you.”\n Was that meant to be a threat or a promise?\n Smiling, I move to the kitchen and remove all the takeout menus from the top of the fridge. We decide on pizza. Cole orders and I text the girls my whereabouts, then we sit back down on the sofa. It takes about thirty seconds before we’re all over each other again. Cole has somehow managed to position himself on top of me and the weight feels so good. I wrap my arms around his neck. He holds himself up on his forearms so he isn’t squishing me and places whisper-soft kisses on my lips. I can’t help but smile against his lips. He’s so gentle for such a big guy.\n My stomach dips when he strokes his fingertips along the side of my breast.\n Yes! Do it!\n I want more. Now.\n My hand skims his neck, moves down his broad chest and stomach til I reach the zipper of his jeans.\n Ding Dong.\n We both lift our heads and look to the door.\n Oh, you are freakin’ kidding me!\n Cole groans then chuckles and buries his face into my chest. Still chuckling, he says, “I think you better get that. If I answer the door like this, I’m going to scare someone.” This comes out muffled.\n We both laugh and stand. Cole reaches into his pocket, hands me a fifty and I glare at it.\n Then I glare at him.\n He states, “If we went out, I would’ve paid for dinner anyway, so just pay the damn guy and get your sexy ass back here so we can pick up where we left off.”\n I blink.\n That is totally acceptable reasoning.\n I run to the door and Cole laughs. I open the door, throw the money at the stunned teenage delivery boy, snatch up the pizza then slam the door shut.\n I hear a muffled, “Th- thank you!” from the other side of the door. On a mission, I throw the pizza on the kitchen counter, walk towards Cole and ask. “How do you feel about cold pizza?”\n “Love it.” Cole replies on a smirk.\n I nod vigorously. “Me too.” I take his hand and lead him to my bedroom.\n I don’t plan on having sex with Cole tonight but figure if we’re going to make out, we may as well be somewhere comfortable. Once inside my room, I push him back onto my bed and straddle him. His arms wrap around my lower back. I lower my face to his and breathe him in.\n “This is crazy,” he whispers.\n I softly kiss his lips before I respond, “Batshit crazy.”\n He smirks and murmurs, “Insane in the membrane.”\n “Mad as a March hare.” I giggle.\n He chuckles. “One flew over the cuckoo’s nest.” We both burst into fits of laughter, so hard it shakes the bed.\n My heart swells.\n This is exactly how Tina and I joke. We can’t seem to stop. The both of us fight hilariously to get the last word in and usually take a huge detour from what we started talking about. I can’t seem to remove the idiotic smile on my face, but am slightly appeased when I see Cole wearing an identical idiotic smile.\n God, we’re dorks!\n Still smiling, I ask, “Where were we?”\n Cole squints and looks up as if thinking, then flips me fast as lightning onto my back. He lowers his face and kisses me slowly and meaningfully. He lifts his face, his expression serious. “I know sex is out of the question tonight. I wouldn’t even ask for it, babe. But there is something I want to do so badly that I think I might just die if you don’t let me.”\n My stomach flips.\n My serious expression matches his. “What exactly would that be?” I ask cautiously.\n He kisses me again. Against my lips he murmurs, “I want to taste you.”\n My stomach drops. Right out of my vagina.\n With wide eyes, I choke out, “Okay.”\n What the fecking feck?\n I mentally argue with myself.\n Good me: I just agreed to let Cole do that? We don’t even know each other!\n Horny me: Oh, shut your pie hole! A super hottie hot guy wants to give you some serious pleasure! What’s the problem?\n Good me: Hmmm. I’m not sure, brain. Hold on. It’ll come to me. Nope. No problem!\n Toot toot!\n Horny me: Hooray! We miss this!\n Oh, we totally did. I haven’t been with anyone since Ghost. That was an age ago. It led to me believing I was pregnant with Ghost’s child, setting up a doctor’s appointment and finding out I have PCOS which is the abbreviated term for Polycystic Ovary Syndrome. It basically means I have cysts on my ovaries and uterus. My period was always irregular and I only went on the pill two years ago to regulate it. Even after a year of taking the pill my period didn’t normalize. I would only get spotting once every five to six months. Which I thought was awesome.\n I mean, c’mon! Who likes getting their period?\n Not me!\n The doctor ordered an ultrasound. I was expecting to hear a heartbeat. Not Umm’s and Ahh’s.\n When I saw the look on the doctor’s face, I knew it wasn’t good news. He talked a bit about PCOS and then explained to me the reason I wasn’t getting my periods was because I have cysts on top on cysts on my ovaries. My ovaries are so badly damaged and covered in scar tissue it’s very likely I won’t ever have my own children, and on the off chance I got pregnant, there would be no guarantee I’d carry full-term. The kind doctor took my hands in his, and as gently as possible told me I am a candidate for a hysterectomy. That was the point I broke down.\n Tina once offered to be a surrogate for me. I love her for that, but until I find someone I’m serious about, it’s not something I’ll even think about.\n I try not to get my hopes up about the children thing, but it’s something I’ve wanted since I was a little girl. I’d already planned my family and it would consist of me, a not-yet-named daddy, two sweet girls and one naughty boy. And two seriously ugly-cute pug dogs named Pizza and Donut.\n That’s my family.\n At least, it was.\n Tina, Mimi and Lola all know about this. What they don’t know is just how seriously it cut me. And it cut me deep. The blade ran right through the heart, down my sternum and twisted in my gut. Although you can’t die from pain, this particular brand of pain makes you feel like you’re dying a very slow, tortured and excruciating death. My chest still aches when I think about it.\n Cole brings me back to reality. “Panties off, sunshine.” He reaches under my long skirt and runs his hands up my legs, takes hold of my panties and lowers them. I know I haven’t waxed, but if it’s what he wants, who am I to deny him?\n He leaves a trail of wet kisses up my leg and whispers against my inner thigh. “I’m gonna rock your world, sunshine.” He runs his nose gently up my folds and breathes me in.\n Pure sex.\n It’s dirty.\n I love it.\n My stomach and core tighten simultaneously.\n Then Cole proceeds to rock my world.\n Chapter Five\n Friends\n The next morning I wake with a start.\n What the heck? Where is that noise coming from?\n Buzz-buzz, buzz-buzz, buzz-buzz\n Is there a goddamn bee in my bed?\n The thought of a bee in my bed makes me jump up like a jack-in-the-box. So, here I stand on my bed, hardly awake and disorientated, mimicking a wrestling stance to fight a bee that I’m not one hundred percent sure exists.\n A frown forms on my face. Something’s wrong here. My eyes focus on the flashing light produced by my cell phone on my nightstand.\n I lower my grappling stance and hop off the bed.\n Squinting, I pick up my cell phone and check the time. It reads 6:24am.\n You’re freakin’ kidding me!\n The person who just texted me obviously has a death wish. With a sigh, I open the offending text message and a surprised smile forms on my face when I see it’s from Cole.\n Last night was hot. So hot I thought we’d burn the sheets. Or, at least, I’d burn the sheets. He did exactly what he said he would.\n He rocked my world.\n Cole made sure of that. He licked me, sucked me and made out with my pussy til I was almost in tears. The ass wouldn’t let me come and was enjoying it thoroughly. Every time I hurled sex-induced abuse at him, he would chuckle. Then it finally happened. And angels sang.\n My legs shook, my core convulsed and I was spent. I fell into a sex coma.\n Cole let me be for a little while. I subconsciously heard shuffling feet and running water, then I was being wiped with something soft and warm. Still in an endorphin-filled daze, I could only smile.\n He scooped me up and walked me to the lounge room, placed me on the sofa and brought me the cold pizza. We ate in silence. Staring at each other and smiling like the idiots we are.\n When we finished eating, we sat wrapped up in each other, necking like a couple of teenagers. And even though it was cheesy, it was nice. So nice, I didn’t want him to go. During the remainder of the night, I mentally argued with myself. If oral sex was that great with Cole, the real thing would have to be spectacular.\n Maybe it would rival sex with Ghost. I hope it rivals sex with Ghost.\n I mentally sigh.\n Nothing rivals sex with Ghost.\n Before I knew it, it was close to midnight and Cole was getting ready to leave. Putting on the shirt I tore off him, and the shoes he took off to be more comfortable, I walked him to the door and pulled him down to place a chaste kiss on his full lips. This was obviously the wrong thing to do because he growled and pushed me up against the wall where he savagely kissed the hell out of me for another few minutes. He pulled away from me. I ran my fingers through his hair, cupped his cheeks and searched his face. He looked indecisive. So, naturally, I squeaked when he picked me up, forcing my legs to wrap around his waist, and carried me back to my room for round two. I smile at the memory. The second time, he let me come after ten minutes. Ten minutes of sweet torture. Attempting to leave a second time, I walked him back to the door but when I went to kiss him, he stopped me with a firm, “No.”\n I am really liking Cole. Cole the caveman. Cole the sweetheart. I like him both ways.\n This brings us to now. I open the text message. My eyes widen and I flush before bursting into laughter.\n Cole: I figured it out. You taste like my grandmother’s blueberry pie.\n I respond immediately.\n Me: Holy shitballs, Cole! You can’t wake me up like that. You damn near gave me a heart attack.\n Cole: I thought I loved my grandmother’s blueberry pie til I tried yours.\n Flushing a bright red, my core begins to moisten. I’m getting hot and bothered, I type quickly.\n Me: You’re welcome to a slice anytime you like…but I’ll make you work for it.\n Cole: Fuck yeah, sunshine. Working for it is half the fun.\n Me: You’re making me hot. That’s not fair :(\n Cole: I’ll make it up to you if you let me see you tonight ;)\n My thoughts immediately drift to Ghost. The cooking show he likes is on tonight. I thought we’d stay in and watch. I begin arguing with myself.\n Why are you making Ghost a priority?\n I’m not making him a priority. He’s my friend. That’s what friends do.\n Think, girl. How much are you getting out of this friendship? Who’s getting the better end of the deal here?\n Fuck you, brain. You’re a bitter bitch. Ghost may not be great to me, but he isn’t bad to me.\n Don’t get hurt.\n Yeah, yeah. I’ll make sure of that.\n I sigh and text Cole.\n Me: Sorry, honey. Got plans with friends tonight. Maybe tomorrow?\n A few minutes pass and I’m suddenly worried that Cole is pissed with me.\n Cole: Sure thing, sunshine. Tomorrow. It’s a date.\n Relief washes over me. It’s not like I lied to him. I just didn’t tell him which friend I was hanging out with. Alone. In my apartment. All night. \n","sourceLink":"https://allnovel.net/love-thy-neighbour-friend-zoned-2/page-7.html","bookId":2799,"book":{"id":2799,"title":"Love Thy Neighbour (Friend-Zoned #2)","description":"Storyline: \n Love Thy Neighbour (Friend-Zoned #2) \n Asher \u0027Ghost\u0027 Collins and Natalie Kovac shared a passionate night together. One neither of them can forget. \n So why is it so hard for them to be around each other? \n With no hope of the two getting along they decide to go their separate ways. And somehow end up closer than they\u0027ve ever been. \n Will friendship ever be enough for the pair?\n \n","cover":"https://allnovel.net/images/love-thy-neighbour-friend-zoned-2.jpg","author":"Belle Aurora","type":"Humorous","source":"allnovel","link":"https://allnovel.net/love-thy-neighbour-friend-zoned-2.html","creation":"Oct 5, 2019 9:01:30 AM","modification":"Oct 5, 2019 5:41:26 PM"}}
