{"id":70551,"no":32,"title":"Page 32","content":"\\n\\n “Uh-huh. Want me to get it?”\\n\\n “Please.” Kane watched the uneven rise and fall of Ginger’s chest. Choppy breathing. Flushed face.\\n\\n Sweat soaking her skin. He swiped away a few stray tendrils stuck to her damp neck. “Ah sugar, what am I gonna do with you? You still won’t ask for help when you need it.” He ran the backs of his knuckles down her cheek and murmured, “I’m stickin’ around to take care of you, whether you like it or not.”\\n\\n Hayden returned and handed him the thermometer.\\n\\n Kane hadn’t a clue how to use it. “How does this thing work?”\\n\\n “You hafta put it in her ear. Probably she should be awake.” Hayden stood in front of Kane and shook Ginger’s shoulder. “Mommy?”\\n\\n No response.\\n\\n Hayden whispered, “I couldn’t wake her up before, either.”\\n\\n It pained him to do it, but Kane pinched the underside of her arm.\\n\\n “Ouch. Stop.” She mumbled, “Leave me alone,” and attempted to turn away.\\n\\n “Mommy?”\\n\\n She rolled flat, blindly reaching for Hayden’s hand. “I’m here. Just give me a sec.”\\n\\n “We need to take your temperature.”\\n\\n Her eyes opened. She blinked at Kane as if he was a hallucination. “Kane?”\\n\\n “Yep. Let’s get you upright.” He supported her with a hand on her back. “Hold still.” He pointed at the thermometer. “Why don’t you do it since you know how it works.”\\n\\n Hayden inserted the plastic tip into Ginger’s ear. “Is it in?”\\n\\n Ginger adjusted his hold on it. “Okay. Now it’s in.”\\n\\n Click. Pause. Then a drawn-out beep.\\n\\n Hayden studied the digital read out. “It says 102.”\\n\\n “I’m so hot. And I can’t keep my eyes open.”\\n\\n “Have you taken anything to drop your fever?”\\n\\n She shook her head. “Just antibiotics. I get these nasty sinus infections and sometimes I get a fever and sometimes I don’t. This time I did.”\\n\\n “You want aspirin or Tylenol?”\\n\\n “Tylenol. It’s in the middle drawer in my bathroom vanity.”\\n\\n “I’ll get you a glass of water,” Hayden said and took off.\\n\\n Kane shook out two pills and handed them over when Hayden returned with the water. “Bottoms up.”\\n\\n After Ginger drained the water glass, she rolled back down on the mattress. Her eyes were still cloudy with fever as her gaze flicked between Kane and her son. “How long have you been here?”\\n\\n “About ten minutes. Hayden called me because he was worried about you.”\\n\\n “What time is it?”\\n\\n “Almost eleven.”\\n\\n She squinted at the window. “Eleven…at night?”\\n\\n “Uh-huh.”\\n\\n Shock flashed across her face. She looked at Hayden. Her eyes glazed with tears. “Oh, baby. I’m sorry you’ve been alone…”\\n\\n “I’m okay. But when I couldn’t wake you I called Buck.”\\n\\n “And I am mighty glad you did, sport. Why don’t you head to the kitchen and figure out what you wanna eat? I’ll be there in a sec.”\\n\\n Hayden laid his head on his mother’s chest. “We’ll take care of you, Mommy. Just like me’n Buck did last time.”\\n\\n “Thanks.”\\n\\n Ginger broke down the second Hayden fled the room. “I am the most horrible mother on the planet.”\\n\\n Tears streamed down her face. “Leaving an eight-year-old boy to fend for himself while I was sacked out in my room? What if he’d gotten hurt? What if he’d locked himself outside? What if—”\\n\\n “Stop. C’mere.” Kane gathered her in his arms. “He’s fine. He’s a smart boy.”\\n\\n “Oh God, Kane, don’t be nice to me. I don’t deserve it.” She muffled her cries against his chest and he felt the heat of her feverish skin through his shirt.\\n\\n “Ginger, sugar, cut yourself some slack. You can’t help bein’ sick.”\\n\\n “But I’m never sick. And even if I am, I can still take care of my kid.”\\n\\n “This might be what you lawyers call ‘extenuating circumstances’, doncha think?”\\n\\n “That’s not a good excuse for neglecting my child.”\\n\\n Kane rested his chin on top of her head. “Nothin’ I say will ease your guilt?”\\n\\n “N-no,” she stuttered.\\n\\n “How about the fact Hayden played Xbox all day while you were conked out?”\\n\\n She made a sobbing laugh sound. “Really?”\\n\\n “Yep. Probably was a good thing he let you sleep because you must’ve needed it. But don’t you dare rat me out.”\\n\\n “I won’t.” She tipped her head back and looked at him. “Thank you for coming over.”\\n\\n “Anytime.” He smoothed the tiny wild curls springing up from her hairline. “You hungry? I can fix you something while I’m makin’ Hayden a snack.”\\n\\n “No, thanks.”\\n\\n Ginger gave him such a somber look his heart sank. Was she throwing him out, now that she was awake?\\n\\n “What?” he said, a little testily.\\n\\n “Are you tired of coming to my rescue?”\\n\\n Never. Kane smooched both her cheeks. “Nope. I like playin’ the part of the brave knight who saves the beautiful damsel in distress. Besides, lookin’ after you and Hayden ain’t exactly a chore, Ginger. I like doin’ it. A lot.”\\n\\n “Why?”\\n\\n “Honestly? My whole life Kade’s been seen as the responsible one. The stand-up guy. And I’ve been seen as the good-time guy. No responsibilities beyond ranch work. People around here assume I prefer bein’ a bachelor and tryin’ to score with every hot chick…rather than look harder to see the real truth.”\\n\\n “What’s the real truth, Kane?”\\n\\n “I want the life everyone thinks I’m tryin’ so hard to avoid. It don’t matter how much I’ve changed…\\n\\n they see me as they want.” Kane traced the indent in her chin. “It means a lot that you see me differently. I know you want my help even when it nearly kills you to ask for it when you don’t think you need it. I like that you let me take care of you. Even when it’s hard as the dickens to admit you like me takin’ care of you.\\n\\n You trust me with your son. You trust me on a level no one ever has, Red.”\\n\\n “You’ve never given me a reason not to trust you.”\\n\\n “Good. I hope that don’t ever change.” He resettled her on the pillow. “Need anything before I continue my knightly duties?”\\n\\n She shook her head and closed her eyes.\\n\\n Would Ginger remember that he’d basically poured his heart out? He sure hoped so.\\n\\n In the kitchen, Hayden sat at the counter eating a bowl of Oreos cereal. Kane frowned. “I thought I was fixin’ you something to eat.”\\n\\n Hayden shrugged. “I like cereal.”\\n\\n “What have you eaten today?”\\n\\n “Cereal.”\\n\\n Kane rolled his eyes. “Fine. But tomorrow, you’re eatin’ real food. No cereal.”\\n\\n “Not even for breakfast?”\\n\\n “Nope.”\\n\\n “Aw, man.” Hayden looked up at him and shoved his glasses back in place on his nose. “Are you staying over?”\\n\\n “I think it’d probably be best, don’t you? In case you or your mama needs something during the night?”\\n\\n Hayden nodded. “Where are you sleeping? Cause I’ve got Lego junk on the bottom bunk.”\\n\\n “I’ll crash on the couch.”\\n\\n “Or you could stay in my mom’s room. I bet she wouldn’t mind. I wouldn’t mind either.”\\n\\n Nice, the other male in Ginger’s life gave him permission to share her bed. He fought a smile. “We’ll see.”\\n\\n When Hayden started to yawn, Kane let him check on his mother before he started his bedtime rituals.\\n\\n Then Kane tucked him in the upper bunk.\\n\\n Kane cleaned up Hayden’s mess in the living room and the kitchen. He locked the doors and debated on switching on the TV, but the chance to watch Ginger while she slept had a stronger pull than mindlessly flipping through channels.\\n\\n In her bedroom he stripped down to his T-shirt and boxers. She didn’t move when he crawled onto her bed. He straightened out the quilt and sheet that’d twisted into a ball because Ginger had kicked them off in her feverish state. He left her half of the covers in the middle of the bed and tucked the other half around himself.\\n\\n As many times as Kane imagined spending the night—the whole night—in her bed, he hated she was sick and hurting. He reached for her hand, wanting to offer her comfort, wanting to assure her that he was right beside her if she needed him. He strummed his thumb across her knuckles, content just to touch her.\\n\\n She emitted a satisfied-sounding sigh, threading her fingers though his.\\n\\n A few hours later, the bed started to shake, instantly putting Kane on alert. He touched her arm to wake her. “Ginger? You all right?”\\n\\n “No. I’m c-cold. Like I have ice in my veins c-cold.”\\n\\n “Your fever must’ve broken.”\\n\\n “Great.” Her body shook.\\n\\n “C’mere. I’ll warm you.”\\n\\n She scooted beneath the pile of covers, pressing her cheek into his chest, curling into him—nearly on top of him. Her skin had gone from fiery to clammy. He pulled her more tightly against his body, trying to stop the worst of the tremors.\\n\\n “You’re as toasty as a furnace,” she murmured.\\n\\n “Just hot-blooded, I guess.”\\n\\n “In many ways.”\\n\\n He smiled, stroking her back.\\n\\n “I’m glad you’re here.”\\n\\n “Me too.”\\n\\n “I’m really glad you don’t mind taking care of me, Kane. I’m glad you don’t think that makes me weak, or clingy or needy.”\\n\\n “Red, you are the strongest woman I know.”\\n\\n Kane thought she’d fallen asleep, but she spoke again very softly. “Do you know I haven’t slept in the same bed, all night, with a man…since I was about twenty-four?” \\n\\n","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-32.html","bookId":2689,"book":{"id":2689,"title":"Raising Kane (Rough Riders #9)","description":"Storyline: Raising Kane (Rough Riders #9) \\n She surrendered the reins. Now he\u0027s raising the stakes. \\n When a patch of ice sends attorney Ginger Paulson head-over-high-heels down a flight of stairs, she has no one to care for her young son and her invalid father - until lethally sexy Kane McKay shows up at the hospital, determined to prove his cowboy chivalry. Past experience has inoculated her against take-charge men, but even Ginger isn\u0027t immune to Kane\u0027s invasive charm and Built Ford Tough body. \\n For two years rancher Kane McKay has followed the Little Buddies mentoring program\u0027s cardinal rule - hands off his Little Buddy Hayden\u0027s mama. But one look at Ginger\u0027s bruised body and Kane is through watching the stubborn woman take care of everyone but herself. The feisty, curvy redhead needs his help, and he\u0027ll give her the hands-on type whether she likes it or not. \\n After Kane throws out doctor\u0027s orders and issues his own demands - her full sexual submission - Ginger realizes Kane\u0027s caring nature extends beyond just fulfilling her physical needs. \\n Can the former hell-raiser convince the gun-shy single mom to look beyond his past - toward a shared future? \\n Warning: Contains one sweet and hot hunk of cowboy manflesh who uses every sexual trick in the book to render a sassy, fast-talking attorney speechless and put a new twist on the term \"binding arbitration\".\\n","cover":"https://allnovel.net/images/raising-kane-rough-riders-9.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/raising-kane-rough-riders-9.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:16:41 AM"}}
