{"id":18830,"no":9,"title":"CHAPTER VIII","content":"In the cold light of a wintry morning Smith appeared in Jamestown, escorted by twelve warriors headed by Rawhunt. The joyful shout of those who had stood his friends warmed his heart. How sweetly sound the voices of friends when one is delivered from deadly peril! All came to shake his hand and rejoice over him, except the malicious Wingfield and the band of plotters. What evil combination of circumstances had brought back the mainspring to set the watch to work again, and destroy their well-laid plans for sailing for home in the pinnace? Wingfield immediately set to work again to hatch another plot for getting rid of the hated Captain. “Ratcliffe, I have thought of a plan whereby we may soon put an end to this doughty soldier. We will say that according to the Levitical Law his life should pay the forfeit for the death of Robinson and Emry.” “An excellent idea,” returned Ratcliffe. “I tell you, man, your brains are worth76 their weight in gold. We have enough men on our side to condemn him. I, as governor, will call the council together and speedily settle matters, then we can return home from this God-forsaken country.” So Captain Smith was again brought before his judges to plead for his life. No protestations of innocence were of any avail, for the Jeffreys of the court had already decided on his doom. Wingfield, as presiding judge, rose to deliver sentence, his evil heart gloating over each word he uttered. “To-morrow at noon you shall be hanged by the neck until dead.” Lying in the wooden fort, guarded by grim and vengeful men, John Smith’s thoughts went traveling over the years of his life. Again he was a slave in the land of the Turks. God had rescued him through His agent, the beautiful princess. Perhaps He would again send a deliverer if his faith remained strong. Before the curtains of night parted to let the sun-god roll his chariot through, the ship of Captain Newport came sailing up the stream. It was an answer to John Smith’s prayers. A joyful clamor of voices mingled with the barking of dogs greeted the tough old77 sea captain as he made his way down the ship’s ladder. “What is the news from home? Whom have you brought over? Have you food and apparel on board, and where are the letters?” The questions were eager and numberless. “One thing at a time,” answered the worthy old sea-dog. “Do you expect us to stand here in the freezing cold to give you news? Lead the way to a fire where we may thaw the marrow in our bones. Gad, but you have the coldest ice-house over here it has ever been my lot to enter!” The whole procession then made its way to the fort, as it was the largest house of accommodation. Great sticks of pitch pine lighted up the interior and revealed the prisoner lying in a corner. “What is the meaning of this outrage?” thundered Newport. “Why is Captain Smith a prisoner?” His questions were soon answered, and, turning fiercely upon Ratcliffe, he hurled maledictions upon him. “Release him instantly or else some other gibbering head will adorn the gallows to-morrow! I will be answerable to the London Company.” Captain Smith’s guards sullenly undid78 his bonds, and he came forward to hear the news from home. First he cast his eyes upon the new adventurers, and he saw that no hope for the settlement lay in them. Soft, cushiony hands were not going to wield the axe and sight the gun. Seating himself upon a rough stool before the fire, the messenger from home began to dole out his packet of mail. “Two for you, Martin, three for Ratcliffe, and one for you, Wingfield. Looks like a woman’s hand and an uneducated one at that. Nothing for you, Laydon, I am sorry to say.” The fortunate ones eagerly seized their letters and were soon deep in their contents. Those who had received no mail clamored for news. “Fair and softly. Give me time to get my breath, and one of you men fetch me a cup of sack from yonder package near the door. Ah,” came his voice between his gulps, “how liquor warms the cockles of a man’s heart. Now I will begin. “First of all, the reading of the Word of God”—here he lifted his hat reverently—“is rapidly spreading among the poor as well as the rich. Men’s minds are more set on serious things than in the reign of our good ‘Queen Bess,’ God rest her soul!79 The Puritan sect is making great headway, but I do not like their sour looks and lank hair.” “How are King James and Parliament getting on?” said George Percy. “And what of my kinsman, Lord Percy?” “Ill, man, ill. King James is driving Parliament to distraction by his forced levying of taxes and reckless expenditure of money without their consent. I do not know how long they will hold out. To all their remonstrances he replies, ‘I am King by divine right, and am under no duty to consult any will but mine own.’ As for your kinsman, Lord Percy, he still keeps Sir Walter Raleigh company in the Tower of London. All the brilliant wits of the day visit them. Chief among them is Will Shakespeare. That canting Scotchman Carr, now Earl of Somerset, if you please, has the upper hand at Court. Strange rumors are afloat concerning the murder of Overby. It is whispered that Carr and his wife, once Lady Essex, had a hand in that; and hark, a word in your ear, the London Company is mightily disgruntled because no gold has been sent back from the colony. You gallants get to work and hunt for the precious metal.” “Put not such thoughts into their heads,”80 interposed Captain Smith in a whisper. “I tell you there is no gold in these parts. Better exhort them to set to work and put this settlement on a firm basis. Just now it is like a city built on shifting sand. Discontent and jealousy rock the government like a ship in a storm.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2860/79041.html","bookId":1207,"book":{"id":1207,"title":"The Daughter of Virginia Dare","description":"简介： The sunbeams were playing hide and seek with the ripples around the prows of three small vessels lying at anchor in the harbor of Portsmouth. Their decks were crowded with the colonists going to seek a home on the soil of Virginia. On the wharf all w...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2860","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
