{"id":99465,"no":14,"title":"Page 14","content":"8\\n\\n STRENGTH IN WHAT REMAINS\\n\\n Raphael stood, hands in his pockets, and looked up at the demon towers, shimmering dark red. “Something’s going on,” he said. “Something unusual.”\\n\\n Simon wanted to snap back that the unusual thing that was going on was that he’d just been kidnapped and taken to Idris for the second time in his life, but he was feeling too nauseated. He’d forgotten the way a Portal seemed to take you apart when you went through it and reassemble you on the other side with important pieces missing.\\n\\n Also, Raphael was right. Something was going on. Simon had been in Alicante before, and he remembered the roads and the canals, the hill rising over it all with the Gard at the top. He remembered that on ordinary nights the streets were quiet, lit by the pale glow of the towers. But there was noise tonight, largely coming from the Gard and the hill, where lights were dancing as if a dozen bonfires had been lit. The demon towers were glowing an eerie red-gold.\\n\\n “They change the color of the towers to convey messages,” said Raphael. “Gold for marriages and celebrations. Blue for the Accords.”\\n\\n “What does red mean?” Simon asked.\\n\\n “Magic,” said Raphael, his dark eyes narrowed. “Danger.”\\n\\n He turned in a slow circle, looking around the quiet street, the large houses by the canal side. He was about a head shorter than Simon. Simon wondered how old he’d been when he’d been Turned. Fourteen? Fifteen? Only a little older than Maureen. Who had Turned him? Magnus knew but had never told.\\n\\n “The Inquisitor’s house is there,” Raphael said, and pointed at one of the largest of the houses, with a pointed roof and balconies out over the canal. “But it is dark.”\\n\\n Simon couldn’t deny that fact, though his unbeating heart gave a little leap as he looked at the place. Isabelle was living there now; one of those windows was her window. “They must all be up at the Gard,” he said. “They do that, for meetings and things.” He had no fond memories of the Gard himself, having been imprisoned there by the last Inquisitor. “We could go up there, I guess. See what’s going on.”\\n\\n “Yes, thank you. I am aware of their ‘meetings and things,’ ” Raphael snapped, but he looked uncertain in a way Simon couldn’t recall him looking before. “Whatever is happening, it is Shadowhunter business. There is a house, not far from here, that has been granted to the vampire representative on the Council. We may go there.”\\n\\n “Together?” Simon said.\\n\\n “It is a very large house,” Raphael said. “You will be at one end of it and I at the other.”\\n\\n Simon raised his eyebrows. He wasn’t entirely sure what he had expected would happen, but spending the night in a house with Raphael hadn’t occurred to him. It wasn’t that he thought Raphael was going to kill him in his sleep. But the thought of sharing living quarters with someone who seemed to dislike him intensely and always had was odd.\\n\\n Simon’s vision was clear and precise now—one of the few things he really liked about being a vampire—and he could see details even at a distance. He saw her before she could have seen him. She was walking along quickly, her head down, her dark hair in the long braid she often wore it in when fighting. She was in gear, and her boots tapped against the cobblestones as she walked.\\n\\n You’re a heartbreaker, Isabelle Lightwood.\\n\\n Simon turned to Raphael. “Go away,” he said.\\n\\n Raphael smirked. “La belle Isabelle,” he said. “It is hopeless, you know, you and she.”\\n\\n “Because I’m a vampire and she’s a Shadowhunter?”\\n\\n “No. She’s just—how do you say it—out of your league?”\\n\\n Isabelle was halfway down the street now. Simon gritted his teeth. “Salt my game, and I’ll stake you. I mean it.”\\n\\n Raphael shrugged innocently but didn’t move. Simon turned away from him and stepped out of the shadows, into the street.\\n\\n Isabelle halted instantly, her hand going to the whip coiled at her belt. A moment later she blinked in shock, her hand dropping, her voice uncertain: “Simon?”\\n\\n Simon felt suddenly awkward. Maybe she wouldn’t appreciate his suddenly appearing in Alicante like this—this was her world, not his. “I—” he began, but he got no further, because Isabelle had launched herself at him and thrown her arms around him, nearly knocking him off his feet.\\n\\n Simon let himself close his eyes and bury his face against her neck. He could feel her heart beating, but violently pushed aside any thoughts of blood. She was soft and strong in his arms, her hair tickling his face, and holding her, he felt normal, wonderfully normal, like any teenage boy in love with a girl.\\n\\n In love. He jerked back with a start and found himself looking at Izzy from a few inches away, her huge dark eyes shining. “I can’t believe you’re here,” she said, breathless. “I was wishing you were and thinking about how long it would be before I could see you, and—Oh, my God, what are you wearing?”\\n\\n Simon looked down at his puffy shirt and leather pants. He was vaguely aware of Raphael, somewhere in the shadows, snickering. “It’s kind of a long story,” he said. “Do you think we could go inside?”\\n\\n \\n\\n Magnus turned the silver box with the initials on it over in his hands, his cat’s eyes gleaming in the witchlit dimness of Amatis’s cellar.\\n\\n Jocelyn was gazing at him with a look of curious anxiety. Luke couldn’t help thinking about all the times Jocelyn had taken Clary to Magnus’s loft when Clary had been a child, all the times the three of them had sat together, an unlikely trio, as Clary grew up and older and began to remember what she was supposed to forget. “Anything?” Jocelyn asked.\\n\\n “You have to give me time,” Magnus said, poking the box with a finger. “Magical booby-traps, curses, the like, they can be pretty subtly hidden.”\\n\\n “Take your time,” said Luke, leaning back against a table shoved into a cobwebby corner. Long ago it had been his mother’s kitchen table. He recognized the pattern of careless knife marks across the wooden top, even the dent in one of the legs he’d made when he’d kicked it as a teenager.\\n\\n It had been Amatis’s for years. It had been hers when she’d been married to Stephen and had sometimes hosted dinner parties at the Herondale house. It had been hers after the divorce, after Stephen had moved out to the countryside manor house with his new wife. The whole cellar in fact was stacked with old furniture: items Luke recognized as having belonged to their parents, paintings and knickknacks from the time Amatis had been married. He wondered why she had hidden them away down here. Perhaps she hadn’t been able to bear to look at them.\\n\\n “I don’t think there’s anything wrong with it,” Magnus said finally, setting the box back on the shelf where Jocelyn had shoved it, unwilling to have the item in the house but unwilling to throw it away, either. He shivered and rubbed his hands together. He was swathed in a gray and black coat that made him look like a hard-boiled detective; Jocelyn hadn’t given him a chance to hang his coat up when he’d arrived on their doorstep, just grabbed him by the arm and dragged him down to the cellar. “No snares, no traps, no magic at all.”\\n\\n Jocelyn looked a bit sheepish. “Thanks,” she said. “For looking at it. I can be a bit paranoid. And after what just happened in London—”\\n\\n “What did happen in London?”\\n\\n “We don’t know that much,” said Luke. “We got a fire-message about it this afternoon from the Gard, but not a lot of details. London was one of the few Institutes that hadn’t emptied yet. Apparently Sebastian and his forces tried to attack. They were rebuffed by some kind of protection spell, something even the Council didn’t know about. Something that warned the Shadowhunters what was coming and led them to safety.”\\n\\n “A ghost,” Magnus said. A smile hovered around his mouth. “A spirit, sworn to protect the place. She’s been there for a hundred and thirty years.”\\n\\n “She?” Jocelyn said, leaning back against a dusty wall. “A ghost? Really? What was her name?”\\n\\n “You would recognize her last name, if I told it to you, but she wouldn’t like that.” Magnus’s gaze was faraway. “I hope this means she’s found peace.” He snapped back to attention. “Anyway,” he said. “I hadn’t meant to drag the conversation in this direction. It isn’t why I came to you.”\\n\\n “I guessed as much,” said Luke. “We appreciate the visit, though I admit I was surprised to see you on our doorstep. It’s not where I thought you’d go.”\\n\\n I thought you’d go to the Lightwoods’ hung in the air between them, unsaid.\\n\\n “I had a life before Alec,” Magnus snapped. “I’m the High Warlock of Brooklyn. I am here to take a Council seat on behalf of Lilith’s Children.”\\n\\n “I thought Catarina Loss was the warlock representative,” said Luke, surprised.\\n\\n “She was,” Magnus admitted. “She made me take her place so I could come here and see Alec.” He sighed. “She in fact made this particular pitch to me while we were in the Hunter’s Moon. And that’s what I wanted to talk to you about.”\\n\\n Luke sat down on the rickety table. “Did you see Bat?” he asked. Bat tended to set up office in the Hunter’s Moon during the days, rather than the police station; it was unofficial, but everyone knew that was where to find him.\\n\\n “Yes. He’d just gotten a call from Maia.” Magnus ran a hand through his black hair. “Sebastian doesn’t exactly appreciate being rebuffed,” he said slowly, and Luke felt his nerves tighten. Magnus was clearly hesitant to impart bad news. “It looks like after he attempted to attack the London Institute and was unsuccessful, he turned his attention to the Praetor Lupus. Apparently he doesn’t have much use for lycanthropes—can’t turn them into Endarkened—so he burned the place to the ground and murdered them all. He killed Jordan Kyle in front of Maia. He let her live so she could deliver a message.”\\n\\n Jocelyn hugged her arms around herself. “My God.”\\n\\n “What was the message?” Luke said, finding his voice.\\n\\n “It was a message to Downworlders,” said Magnus. “I talked to Maia on the phone. She had me memorize it. Apparently he said, ‘Tell all the Downworlders that I am in pursuit of vengeance, and I will have it. I will deal this way with any who ally themselves with Shadowhunters. I have no argument with your kind, unless you follow the Nephilim into battle, in which case you will be food for my blade and the blades of my army, until the last of you is cut from the surface of this world.’ ”\\n\\n Jocelyn made a ragged sound. “He sounds just like his father, doesn’t he?”\\n\\n Luke looked at Magnus. “Are you going to deliver that message at the Council?”\\n\\n Magnus tapped at his chin with a glittery fingernail. “No,” he said. “But I’m not going to conceal it from the Downworlders, either. My loyalty is not to Shadowhunters over them.”\\n\\n Not like yours. The words hung between them, unspoken.\\n\\n “I have this,” Magnus said, taking a piece of paper from his pocket. Luke recognized it, since he had one of his own. “Will you be at the dinner tomorrow night?”\\n\\n “I will. Faeries take invitations like that very seriously. Meliorn and the Court would be insulted if I didn’t go.”\\n\\n “I plan to tell them then,” Magnus said.\\n\\n “And if they panic?” said Luke. “If they abandon the Council and the Nephilim?”\\n\\n “It’s not as if what happened at the Praetor can be concealed.”\\n\\n “Sebastian’s message could,” said Jocelyn. “He’s trying to frighten the Downworlders, Magnus. He’s trying to make them stand back while he destroys the Nephilim.”\\n\\n “It would be their right,” said Magnus.\\n\\n “If they do, do you think that the Nephilim will ever forgive them?” said Jocelyn. “The Clave is not forgiving. They are more unforgiving than God himself.”\\n\\n “Jocelyn,” said Luke. “It’s not Magnus’s fault.”\\n\\n But Jocelyn was still looking at Magnus. “What,” she said, “would Tessa tell you to do?”\\n\\n “Please, Jocelyn,” Magnus said. “You hardly know her. She would preach honesty; she usually does. Concealing the truth never works. When you live long enough, you can see that.”\\n\\n Jocelyn looked down at her hands—her artist’s hands, that Luke had always loved, agile and careful and stained with ink. “I am not a Shadowhunter anymore,” she said. “I fled from them. I told you both that. But a world without Shadowhunters in it—I am afraid of that.”\\n\\n “There was a world before the Nephilim,” said Magnus. “There will be one after.”\\n\\n “A world we can survive in? My son—” Jocelyn began, and broke off as a hammering sound came from upstairs. Someone was pounding on the front door. “Clary?” she wondered aloud. “She might have forgotten her key again.”\\n\\n “I’ll get it,” Luke said, and stood up. He exchanged a brief look with Jocelyn as he left the cellar, his mind whirling. Jordan dead, Maia grieving. Sebastian trying to pit Downworlders against Shadowhunters.\\n\\n He drew the front door open, and a blast of cold night air came in. Standing on the doorstep was a young woman with pale curling blond hair, dressed in gear. Helen Blackthorn. Luke barely had time to register that the demon towers above them were glowing bloodred when she spoke.\\n\\n “I’ve come with a message from the Gard,” she said. “It’s about Clary.”\\n\\n \\n\\n “Maia.”\\n\\n A soft voice out of the silence. Maia turned over, not wanting to open her eyes. There was something terrible waiting out there in the darkness, something that she could escape if she just slept and slept forever.\\n\\n “Maia.” He was looking at her out of the shadows, pale eyes and dark skin. Her brother, Daniel. As she watched, he tore the wings from a butterfly and let its body fall, twitching, to the ground.\\n\\n “Maia, please.” A light touch on her arm. She bolted upright, her whole body recoiling. Her back hit a wall and she gasped, peeling her eyes open. They were sticky, her eyelashes fringed with salt. She had been crying in her sleep.\\n\\n She was in a half-lit room, a single window looking out onto a winding downtown street. She could see the leafless boughs of trees through the smeared glass and the edge of something metal—a fire escape, she guessed.\\n\\n She glanced down—a narrow bed with an iron headboard and a thin blanket that she had kicked to the foot. Her back against a brick wall. A single chair by the bed, old and splintered. Bat sat in it, his eyes wide, slowly lowering his hand.\\n\\n “I’m sorry,” he said.\\n\\n “Don’t,” she ground out. “Don’t touch me.”\\n\\n “You were screaming,” he said. “In your sleep.”\\n\\n She hugged her arms around herself. She was wearing jeans and a tank top. The sweater she had been wearing on Long Island was missing, and the skin on her arms prickled with gooseflesh. “Where are my clothes?” she said. “My jacket, my sweater—”\\n\\n Bat cleared his throat. “They were covered in blood, Maia.”\\n\\n “Right,” she said. Her heart was drumming in her chest.\\n\\n “You remember what happened?” he asked.\\n\\n She closed her eyes. She remembered it all: the drive, the truck, the burning building, the beach covered in bodies. Jordan collapsing against her, his blood running down on and around her like water, mixing with the sand. Your boyfriend’s dead.\\n\\n “Jordan,” she said, though she already knew.\\n\\n Bat’s face was grave; there was a greenish cast to his brown eyes that made them shine in the half-light. It was a face she knew well. He was one of the first werewolves she’d ever met. They’d dated until she’d told him she thought she was too new to the city, too jittery, too much not over Jordan for a relationship. He’d broken up with her the next day; surprisingly they had stayed friends. “He’s dead,” he said. “Along with almost all the Praetor Lupus. Praetor Scott, the students—a few survived. Maia, why were you there? What were you doing at the Praetor?”\\n\\n Maia told him about Simon’s disappearance, the phone call to Jordan from the Praetor, their frantic drive to Long Island, the discovery of the Praetor in ruins.\\n\\n Bat cleared his throat. “I do have some of Jordan’s things. His keys, his Praetor pendant—”\\n\\n Maia felt as if she couldn’t catch her breath. “No, I don’t want—I don’t want his things,” she said. “He would have wanted Simon to have the pendant. When we find Simon, he should have it.”\\n\\n Bat didn’t push the issue. “I do have some good news,” he said. “We heard from Idris: your friend Simon’s all right. He’s there, actually, with the Shadowhunters.”\\n\\n “Oh.” Maia felt the tight knot around her heart loosen slightly with relief.\\n\\n “I should have told you right away,” he apologized. “It’s just—I was worried about you. You were in bad shape when we brought you back to headquarters. You’ve been sleeping since then.”\\n\\n I wanted to sleep forever.\\n\\n “I know you already told Magnus,” added Bat, his face strained. “But explain it to me again, why Sebastian Morgenstern would target lycanthropes.”\\n\\n “He said it was a message.” Maia heard the flatness in her own voice as if from a distance. “He wanted us to know that it was because werewolves are allies with the Shadowhunters, and that this was what he planned to do to all the Nephilim’s allies.”\\n\\n “I’ll never pause again, never stand still, till either death hath closed these eyes of mine, or fortune given me measure of revenge.”\\n\\n “New York is empty of Shadowhunters now, and Luke is in Idris with them. They’re putting up extra wards. Soon we’ll barely be able to get messages in and out.” Bat shifted in his chair; Maia sensed there was something he wasn’t telling her.\\n\\n “What is it?” she said.\\n\\n His eyes darted away.\\n\\n “Bat . . .”\\n\\n “Do you know Rufus Hastings?”\\n\\n Rufus. Maia remembered the first time she’d been to the Praetor Lupus, a scarred face, an angry man exiting Prateor Scott’s office in a rage. “Not really.”\\n\\n “He survived the massacre. He’s here in the station, with us. He’s been filling us in,” said Bat. “And he’s been talking to the others about Luke. Saying that he’s more of a Shadowhunter than a lycanthrope, that he doesn’t have pack loyalty, that the pack needs a new leader now.”\\n\\n “You’re the leader,” she said. “You’re second in command.”\\n\\n “Yeah, and I was put in that position by Luke. That means I can’t be trusted either.”\\n\\n Maia slid to the edge of the bed. Her whole body ached; she felt it as she put her bare feet on the cold stone floor. “No one’s listening to him, are they?”\\n\\n Bat shrugged.\\n\\n “That’s ridiculous. After what’s happened, we need to be unified, not to have someone trying to split us up. Shadowhunters are our allies—”\\n\\n “Which is why Sebastian targeted us.”\\n\\n “He’d target us anyway. He’s no friend to Downworlders. He’s Valentine Morgenstern’s son.” Her eyes burned. “He might be trying to get us to abandon the Nephilim temporarily, so he can go after them, but if he managed to wipe them off the earth, all he’d do is come for us next.”\\n\\n Bat clasped and unclasped his hands, then seemed to come to a decision. “I know you’re right,” he said, and went over to a table in the corner of the room. He returned with a jacket for her, socks and boots. He handed them over. “Just—do me a favor and don’t say anything like that this afternoon. Emotions are going to be running pretty high as it is.”\\n\\n She shrugged the jacket on. “This afternoon? What’s this afternoon?”\\n\\n He sighed. “The funeral,” he said. \\n\\n","sourceLink":"https://allnovel.net/city-of-heavenly-fire-the-mortal-instruments-6/page-14.html","bookId":2008,"book":{"id":2008,"title":"City of Heavenly Fire (The Mortal Instruments #6)","description":"Storyline: In this dazzling and long-awaited conclusion to the acclaimed Mortal Instruments series, Clary and her friends fight the greatest evil they have ever faced: Clary\u0027s own brother. \\n Sebastian Morgenstern is on the move, systematically turning Shadowhunter against Shadowhunter. Bearing the Infernal Cup, he transforms Shadowhunters into creatures out of nightmare, tearing apart families and lovers as the ranks of his Endarkened army swell. \\n The embattled Shadowhunters withdraw to Idris - but not even the famed demon towers of Alicante can keep Sebastian at bay. And with the Nephilim trapped in Idris, who will guard the world against demons? \\n When one of the greatest betrayals the Nephilim have ever known is revealed, Clary, Jace, Isabelle, Simon, and Alec must flee - even if their journey takes them deep into the demon realms, where no Shadowhunter has set foot before, and from which no human being has ever returned... \\n Love will be sacrificed and lives lost in the terrible battle for the fate of the word in the thrilling final installment of the classic urban fantasy series The Mortal Instruments!\\n","cover":"https://allnovel.net/images/city-of-heavenly-fire-the-mortal-instruments-6.jpg","author":"Cassandra Clare","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/city-of-heavenly-fire-the-mortal-instruments-6.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:40:54 PM"}}
