{"id":99471,"no":20,"title":"Page 20","content":"11\\n\\n THE BEST IS LOST\\n\\n “Clary. Jace. Wake up.”\\n\\n Clary raised her head and almost yelped as a twinge shot through her stiff neck. She’d fallen asleep curled up against Jace’s shoulder; he was asleep too, wedged into the corner of the sofa with his jacket wadded up under his head as a pillow. The hilt of his sword dug uncomfortably into Clary’s hip as he groaned and straightened up.\\n\\n The Consul stood over them, dressed in Council robes, unsmiling. Jace scrambled to his feet. “Consul,” he said¸ in as dignified a voice as he could muster with his clothes rumpled and his light hair sticking out in every possible direction.\\n\\n “We nearly forgot the two of you were in here,” Jia said. “The Council meeting has begun.”\\n\\n Clary got to her feet more slowly, working out the cricks in her back and neck. Her mouth was as dry as chalk, and her body ached with tension and exhaustion. “Where’s my mother?” she said. “Where’s Luke?”\\n\\n “I’ll wait for you in the hall,” Jia said, but she didn’t move.\\n\\n Jace was sliding his arms into his jacket. “We’ll be right along, Consul.”\\n\\n There was something in the Consul’s voice that made Clary look at her again. Jia was pretty, like her daughter Aline, but at the moment there were sharp lines of tension at the corners of her mouth and eyes. Clary had seen that look before.\\n\\n “What’s going on?” she demanded. “There’s something wrong, isn’t there? Where’s my mother? Where’s Luke?”\\n\\n “We’re not sure,” Jia said quietly. “They never responded to the message that we sent to them last night.”\\n\\n Too many shocks, delivered too quickly, had left Clary numb. She didn’t gasp or exclaim, only felt a coldness spread through her veins. She seized up Heosphoros from the table where she’d left it, and shoved it through her belt. Without another word she pushed past the Consul, into the hallway outside.\\n\\n Simon was waiting there. He looked rumpled and exhausted, pale even for a vampire. She reached to squeeze his hand, fingers brushing across the gold leaf ring on his finger as she did.\\n\\n “Simon’s coming to the Council meeting,” Clary said, her look daring the Consul to say anything in return.\\n\\n Jia simply nodded. She looked like someone who was too tired to argue anymore. “He can be the Night Children’s representative.”\\n\\n “But Raphael was going to stand in for the representative,” Simon protested, alarmed. “I’m not prepared—”\\n\\n “We haven’t been able to reach any of the Downworld representatives, Raphael included.” Jia began to make her way down the hall. The walls were wood, with the pale color and sharp scent of freshly cut lumber. This must have been part of the Gard that had been rebuilt after the Mortal War—Clary had been too tired to notice the night before. Runes of angelic power were cut into the walls at intervals. Each glowed with a deep light, illuminating the windowless corridor.\\n\\n “What do you mean, you haven’t been able to reach them?” Clary demanded, hurrying after Jia. Simon and Jace followed. The corridor curved, leading deeper into the heart of the Gard. Clary could hear a dull roar, like the sound of the ocean, just ahead of them.\\n\\n “Neither Luke nor your mother came back from their appointment at the house of the Fair Folk.” The Consul paused in a large antechamber. There was a good deal of natural light here, pouring through windows made up of alternating squares of plain and colored glass. Double doors stood before them, blazoned with the triptych of the Angel and the Mortal Instruments.\\n\\n “I don’t understand,” Clary said, her voice rising. “So they’re still there? At Meliorn’s?”\\n\\n Jia shook her head. “The house is empty.”\\n\\n “But—what about Meliorn, what about Magnus?”\\n\\n “Nothing is certain yet,” Jia said. “There is no one in the house, nor are any of the representatives responding to messages. Patrick is out searching the city now with a team of guards.”\\n\\n “Was there blood in the house?” Jace asked. “Signs of a struggle, anything?”\\n\\n Jia shook her head. “No. The food was still on the table. It was as if they just—vanished into thin air.”\\n\\n “There’s more, isn’t there?” Clary said. “I can tell by your expression that there’s more.”\\n\\n Jia didn’t answer, just pushed the door of the Council room open. Noise poured out into the antechamber. This was the sound Clary had been hearing, like the crash of the ocean. She hurried past the Consul and paused in the doorway, hovering uncertainly.\\n\\n The Council room, so orderly only a few days before, was full of shouting Shadowhunters. Everyone was standing, some in groups and some apart. Most of the groups were arguing. Clary couldn’t make out the words, but she could see the angry gestures. Her eyes scanned the crowd for familiar faces—no Luke, no Jocelyn, but there were the Lightwoods, Robert in his Inquisitor’s robes beside Maryse; there were Aline and Helen, and the crowd of Blackthorn children.\\n\\n And there, down in the center of the amphitheater, were the four carved wooden seats of the Downworlders, set around the lecterns in a half circle. They were empty, and splashed across the floorboards in front of them was a single word, scrawled in a crooked hand, in what looked like sticky gold paint:\\n\\n Veni.\\n\\n Jace moved past Clary, into the room. His shoulders were tight as he stared down at the scrawl. “That’s ichor,” he said. “Angel blood.”\\n\\n In a flash Clary saw the library at the Institute, the floor slicked with blood and feathers, the angel’s hollow bones.\\n\\n Erchomai.\\n\\n I am coming.\\n\\n And now the single word: Veni.\\n\\n I have come.\\n\\n A second message. Oh, Sebastian had been busy. Stupid, she thought, so stupid of her to think he’d come only for her, that it hadn’t been part of something larger, that he hadn’t wanted more, more destruction, more terror, more upheaval. She thought of his smirk when she’d mentioned the battle at the Citadel. Of course it had been more than an attack; it had been a distraction. Turning the gaze of the Nephilim outward from Alicante, making them search the world for him and his Endarkened, panicking them over the wounded and dead. And in the meantime Sebastian had found his way to the heart of the Gard and painted the floor in blood.\\n\\n Near the dais was a group of Silent Brothers in their bone-colored robes, faces hidden by hoods. Her memory sparking, Clary turned to Jace. “Brother Zachariah—I never got a chance to ask you if you knew whether he was all right?”\\n\\n Jace was staring at the writing on the dais, a sick look on his face. “I saw him in the Basilias. He’s all right. He’s—different.”\\n\\n “Good different?”\\n\\n “Human different,” Jace said, and before Clary could ask him what he meant, she heard someone call her name.\\n\\n Down in the center of the room, she saw a hand rise out of the crowd, waving toward her frantically. Isabelle. She was standing with Alec, a little distance from their parents. Clary heard Jia call out after her, but she was pushing through the crowd already, Jace and Simon at her heels. She sensed curious stares being cast in her direction. Everyone knew who she was, after all. Knew who they all were. Valentine’s daughter, Valentine’s adopted son, and the Daylighter vampire.\\n\\n “Clary!” Isabelle called as Clary, Jace, and Simon pulled free of the staring onlookers and nearly fell into the Lightwood siblings, who had managed to clear a small space for themselves in the middle of the crowd. Isabelle shot an irritated glance at Simon before reaching out to hug Jace and Clary. As soon as she released Jace, Alec pulled him over by the sleeve and hung on, his knuckles whitening around the fabric. Jace looked surprised, but said nothing.\\n\\n “Is it true?” Isabelle said to Clary. “Sebastian was at your house last night?”\\n\\n “At Amatis’s, yes—how did you know?” Clary demanded.\\n\\n “Our father’s the Inquisitor; of course we know,” said Alec. “Rumors about Sebastian being in the city were all everyone was talking about before they opened up the Council room and we saw—this.”\\n\\n “It’s true,” Simon added. “The Consul asked me about it when she woke me up—like I’d know anything. I slept through it,” he added as Isabelle shot him an inquiring look.\\n\\n “Did the Consul say anything to you about this?” Alec demanded, sweeping an arm toward the grim scene below. “Did Sebastian?”\\n\\n “No,” Clary said. “Sebastian doesn’t exactly share his plans.”\\n\\n “He shouldn’t have been able to get to the Downworld representatives. Not only is Alicante guarded, but each of their safe houses is warded,” said Alec. There was a pulse going in his throat like a hammer; his hand, where it rested on Jace’s sleeve, was shaking with a fine tremor. “They were at dinner. They should have been safe.” He let go of Jace and jammed his hands into his pockets. “And Magnus—Magnus wasn’t even supposed to be here. Catarina was coming instead of him.” He looked at Simon. “I saw you with him in Angel Square on the night of the battle,” he said. “Did he say why he was in Alicante?”\\n\\n Simon shook his head. “He just shooed me away. He was healing Clary.”\\n\\n “Maybe this is a bluff,” Alec said. “Maybe Sebastian is trying to make us think he’s done something to the Downworld representatives to throw us off—”\\n\\n “We don’t know that he’s done anything to them. But—they are missing,” Jace said quietly, and Alec looked away, as if he couldn’t bear to meet their gazes.\\n\\n “Veni,” Isabelle whispered, looking at the dais. “Why . . . ?”\\n\\n “He’s telling us he has power,” Clary said. “Power none of us even begin to understand.” She thought of the way he’d appeared in her room and then disappeared. Of the way the ground had opened under his feet at the Citadel, as if the earth were welcoming him in, hiding him from the threat of the world above.\\n\\n A sharp report rang out through the room, the bell that called the Council to order. Jia had moved to the lectern, an armed Clave guard in hooded robes on either side of her.\\n\\n “Shadowhunters,” she said, and the word echoed as clearly through the room as if she’d used a microphone. “Please be silent.”\\n\\n The room subsided gradually into quiet, though from the rebellious looks on quite a few faces, it was an uncooperative quiet. “Consul Penhallow!” called out Kadir. “What answers do you have for us? What is the meaning of this—this desecration?”\\n\\n “We’re not sure,” said Jia. “It happened in the night, in between one watch of guards and another.”\\n\\n “This is vengeance,” said a thin, dark-haired Shadowhunter whom Clary recognized as the head of the Budapest Institute. Lazlo Balogh, she thought his name was. “Vengeance for our victories in London and at the Citadel.”\\n\\n “We didn’t have victories in London and at the Citadel, Lazlo,” said Jia. “The London Institute turned out to be protected by a force even we were unaware of, one we cannot replicate. The Shadowhunters there were warned and led to safety. Even then, a few were injured: None of Sebastian’s forces were harmed. At best it could be called a successful retreat.”\\n\\n “But the attack on the Citadel,” Lazlo protested. “He did not enter the Citadel. He did not reach the armory there—”\\n\\n “But neither did he lose. We sent through sixty warriors, and he killed thirty and injured ten. He had forty warriors, and he lost perhaps fifteen. If it hadn’t been for what happened when he wounded Jace Lightwood, his forty would have slaughtered our sixty.”\\n\\n “We’re Shadowhunters,” said Nasreen Choudhury. “We are used to defending that which we must defend with our last breaths, our last drops of blood.”\\n\\n “A noble idea,” said Josiane Pontmercy, from the Marseilles Conclave, “but perhaps not entirely practical.”\\n\\n “We were too conservative in the number we sent to face him at the Citadel,” said Robert Lightwood, his booming voice carrying through the room. “We have estimated since the attacks that Sebastian has four hundred Endarkened warriors on his side. Simply given the numbers, a head-to-head battle now between his forces and all Shadowhunters would mean that he would lose.”\\n\\n “So what we need to do is fight him as soon as possible, before he Turns any other Shadowhunters,” said Diana Wrayburn.\\n\\n “You can’t fight what you can’t find,” said the Consul. “Our attempts to track him continue to prove fruitless.” She raised her voice. “Sebastian Morgenstern’s best plan now is to lure us out in small numbers. He needs us to send out scouting parties to hunt demons, or to hunt him. We must stay together, here, in Idris, where he cannot confront us. If we split up, if we leave our homeland, then we will lose.”\\n\\n “He’ll wait us out,” said a blond Shadowhunter from the Copenhagen Conclave.\\n\\n “We have to believe he doesn’t have the patience for that,” said Jia. “We have to assume he will attack, and when he does, our superior numbers will defeat him.”\\n\\n “There’s more than patience to be considered,” said Balogh. “We left our Institutes, we came here, with the understanding that we would be returning once we had held a Council with the Downworld representatives. Without us out in the world, who will protect it? We have a mandate, a mandate from Heaven, to protect the world, to hold back the demons. We cannot do that from Idris.”\\n\\n “All the wards are at full strength,” said Robert. “Wrangel Island is working overtime. And given our new cooperation with Downworlders, we will have to rely on them to keep the Accords. That was part of what we were going to discuss at the Council today—”\\n\\n “Well, good luck to you with that,” said Josiane Pontmercy, “considering that the representatives of Downworld are missing.”\\n\\n Missing. The word fell into the silence like a pebble into water, sending out ripples through the room. Clary felt Alec stiffen, minutely, at her side. She hadn’t been letting herself think about it, hadn’t been letting herself believe that they could really be gone. It was a trick Sebastian was playing on them, she kept telling herself. A cruel trick, but nothing more.\\n\\n “We don’t know that!” Jia protested. “Guards are out searching now—”\\n\\n “Sebastian wrote on the floor in front of their very seats!” shouted a man with a bandaged arm. He was the head of the Mexico City Institute and had been at the Citadel battle. Clary thought his last name was Rosales. “Veni. ‘I am come.’ Just as he sent us a message with the death of the angel in New York, now he strikes at us in the heart of the Gard—”\\n\\n “But he didn’t strike at us,” Diana interrupted. “He struck at the representatives of Downworld.”\\n\\n “To strike at our allies is to strike at us,” called Maryse. “They are members of the Council, with all the attendant rights that represents.”\\n\\n “We don’t even know what happened to them!” snapped someone in the crowd. “They could be perfectly all right—”\\n\\n “Then where are they?” shouted Alec, and even Jace looked startled to hear Alec raise his voice. Alec was glowering, his blue eyes dark, and Clary was suddenly reminded of the angry boy she had met in the Institute what felt like so long ago. “Has anyone tried to track them?”\\n\\n “We have,” said Jia. “It hasn’t worked. Not all of them can be tracked. You cannot track a warlock, or the dead—” Jia broke off with a sudden gasp. Without warning the Clave guard on her left had come up behind her and seized her by the back of her robes. A shout ran through the assembly as he yanked her back, placing the blade of a long, silver dagger against her throat.\\n\\n “Nephilim!” he roared, and his hood fell away, showing the blank eyes and swirling, unfamiliar Marks of the Endarkened. A roar began to rise from the crowd, cut off quickly as the guard dug his blade farther into Jia’s throat. Blood bloomed around it, visible even from a distance.\\n\\n “Nephilim!” the man roared again. Clary’s mind struggled to place him—he seemed somehow familiar. He was tall, brown-haired, probably around forty. His arms were thickly muscled, the veins standing out like ropes as he struggled to hold Jia still. “Stay where you are! Do not approach, or your Consul dies!”\\n\\n Aline screamed. Helen had hold of her, visibly restraining her from running forward. Behind them the Blackthorn children huddled around Julian, who was carrying his youngest brother in his arms; Drusilla had her face pressed against his side. Emma, her hair bright even at a distance, stood with Cortana out, protecting the others.\\n\\n “That’s Matthias Gonzales,” said Alec in a shocked voice. “He was head of the Buenos Aires Institute—”\\n\\n “Silence!” roared the man behind Jia—Matthias—and an uneasy silence fell. Most Shadowhunters stood, like Jace and Alec, with their hands halfway to their weapons. Isabelle was clutching the handle of her whip. “Hear me, Shadowhunters!” Matthias cried, his eyes burning with a fanatic light. “Hear me, for I was one of you. Blindly following the rule of the Clave, convinced of my safety within the wards of Idris, protected by the light of the Angel! But there is no safety here.” He jerked his chin to the side, indicating the scrawl on the floor. “None are safe, not even Heaven’s messengers. That is the reach of the power of the Infernal Cup, and of he who holds it.”\\n\\n A murmur ran through the crowd. Robert Lightwood pushed forward, his face anxious as he looked at Jia, and the blade at her throat. “What does he want?” he demanded. “Valentine’s son. What does he want from us?”\\n\\n “Oh, he wants many things,” said the Endarkened Shadowhunter. “But for now he will content himself with the gift of his sister and adoptive brother. Give him Clarissa Morgenstern and Jace Lightwood, and avert disaster.”\\n\\n Clary heard Jace suck in his breath. She looked at him, panicking; she could feel the gaze of the whole room on her, and felt as if she were dissolving, like salt in water.\\n\\n “We are Nephilim,” Robert said coldly. “We do not trade away our own. He knows that.”\\n\\n “We of the Infernal Cup have in our possession five of your allies,” was the reply. “Meliorn of the Fair Folk, Raphael Santiago of the Night’s Children, Luke Garroway of the Moon’s Children, Jocelyn Morgenstern of the Nephilim, and Magnus Bane of the Children of Lilith. If you do not give us Clarissa and Jonathan, they will be put to the deaths of iron and silver, of fire and rowan. And when your Downworld allies learn that you have sacrificed their representatives because you would not give up your own, they will turn on you. They will join with us, and you will find yourselves fighting not just he who holds the Infernal Cup, but all of Downworld.”\\n\\n Clary felt a wave of dizziness, so intense that it was almost sickness, pass over her. She had known—of course she had known, with a creeping knowledge that was not certainty and could not be dismissed—that her mother and Luke and Magnus were in danger, but to hear it was something else. She began to shiver, the words of an incoherent prayer repeating over and over in her head: Mom, Luke, be all right, please be all right. Let Magnus be all right, for Alec. Please.\\n\\n She heard Isabelle’s voice in her head too, saying that Sebastian could not fight them and all of Downworld. But he had found a neat way to turn it back on them: If harm came to the Downworld representatives now, it would seem the Shadowhunters’ fault.\\n\\n Jace’s expression had gone bleak, but he met her eyes with the same understanding that had lodged like a needle in her heart. They could not stand back and let this happen. They would go to Sebastian. It was the only choice.\\n\\n She started forward, meaning to call out, but she found herself jerked back by a hard grip on her wrist. She turned, expecting Simon, and saw to her surprise that it was Isabelle. “Don’t,” Isabelle said.\\n\\n “You are a fool and a follower,” snapped Kadir, his eyes angry as he regarded Matthias. “No Downworlders will hold us accountable for not sacrificing two of our children to Jonathan Morgenstern’s pyre of corpses.”\\n\\n “Oh, but he will not kill them,” said Matthias with vicious glee. “You have his word on the Angel that no harm will come to the Morgenstern girl or the Lightwood boy. They are his family, and he desires them by his side. So there is no sacrifice.”\\n\\n Clary felt something brush her cheek—it was Jace. He had kissed her, quickly, and she remembered Sebastian’s Judas kiss the night before and whirled to catch at him, but he was gone already, away from all of them, striding out onto the aisle of stairs between the benches. “I will go!” he shouted, and his voice rang through the room. “I will go, willingly.” His sword was in his hand. He threw it down, where it clattered on the steps. “I will go with Sebastian,” he said, into the silence that followed. “Just leave Clary out of it. Let her stay. Take me alone.”\\n\\n “Jace, no,” Alec said, but his voice was drowned by the clamor that ran through the room, voices rising like smoke and curling up toward the ceiling, and Jace stood calmly, with his hands out, showing he had no weapons, his hair shining under the light of the runes. A sacrificial angel.\\n\\n Matthias Gonzales laughed. “There will be no bargain without Clarissa,” he said. “Sebastian demands her, and I deliver what my master demands.”\\n\\n “You think we’re fools,” Jace said. “Actually, I know better than that. You don’t think at all. You’re a mouthpiece for a demon, that’s all you are. You don’t care about anything anymore. Not family or blood or honor. You’re no longer human.”\\n\\n Matthias sneered. “Why would anyone want to be human?”\\n\\n “Because your bargain is worthless,” said Jace. “So we give ourselves up, and Sebastian returns his hostages. Then what? You’ve been at such pains to tell us how much better he is than the Nephilim, how much stronger, how much cleverer. How he can strike at us here in Alicante, and all our wards and all our guards can’t keep him out. How he’ll destroy us all. If you want to bargain with someone, you offer them a chance to win. If you were human, you’d know that.”\\n\\n In the silence that followed, Clary thought you could have heard a drop of blood strike the floor. Matthias was still, his blade still pinned against Jia’s throat, his lips shaping words as if he were whispering something, or reciting something he had heard—\\n\\n Or listening, she realized, listening to words being whispered into his ear . . .\\n\\n “You cannot win,” Matthias said finally, and Jace laughed, that sharp acerbic laugh Clary had first fallen in love with. Not a sacrificial angel, she thought, but an avenging one, all gold and blood and fire, confident even in the face of defeat.\\n\\n “You see what I mean,” Jace said. “Then what does it matter if we die now or die later—”\\n\\n “You cannot win,” said Matthias, “but you can survive. Those of you who choose it can be changed by the Infernal Cup; you will become soldiers of the Morning Star, and you will rule the world with Jonathan Morgenstern as your leader. Those who choose to remain the children of Raziel may do so, as long as you remain in Idris. The borders of Idris will be sealed, closing it away from the rest of the world, which will belong to us. This land granted you by the Angel, you will keep, and keeping within its borders, you will be safe. That, you can be promised.”\\n\\n Jace glared. “Sebastian’s promises mean nothing.”\\n\\n “His promises are all you have,” said Matthias. “Keep your alliance with Downworlders, stay within the borders of Idris, and you will survive. But this offer stands only so long as you give yourselves willingly up to our master. You and Clarissa both. There is no negotiation.” \\n\\n","sourceLink":"https://allnovel.net/city-of-heavenly-fire-the-mortal-instruments-6/page-20.html","bookId":2008,"book":{"id":2008,"title":"City of Heavenly Fire (The Mortal Instruments #6)","description":"Storyline: In this dazzling and long-awaited conclusion to the acclaimed Mortal Instruments series, Clary and her friends fight the greatest evil they have ever faced: Clary\u0027s own brother. \\n Sebastian Morgenstern is on the move, systematically turning Shadowhunter against Shadowhunter. Bearing the Infernal Cup, he transforms Shadowhunters into creatures out of nightmare, tearing apart families and lovers as the ranks of his Endarkened army swell. \\n The embattled Shadowhunters withdraw to Idris - but not even the famed demon towers of Alicante can keep Sebastian at bay. And with the Nephilim trapped in Idris, who will guard the world against demons? \\n When one of the greatest betrayals the Nephilim have ever known is revealed, Clary, Jace, Isabelle, Simon, and Alec must flee - even if their journey takes them deep into the demon realms, where no Shadowhunter has set foot before, and from which no human being has ever returned... \\n Love will be sacrificed and lives lost in the terrible battle for the fate of the word in the thrilling final installment of the classic urban fantasy series The Mortal Instruments!\\n","cover":"https://allnovel.net/images/city-of-heavenly-fire-the-mortal-instruments-6.jpg","author":"Cassandra Clare","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/city-of-heavenly-fire-the-mortal-instruments-6.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:40:54 PM"}}
