{"id":101105,"no":37,"title":"Page 37","content":"A fire burned in the middle of the cave, the smoke furling up toward the high domed ceiling, lost in shadow. Simon could feel the heat from the fire, a tense crackling against his skin more than the real sensation of warmth. He guessed it was cold in the cave, from the fact that Alec had bundled himself up in a bulky sweater and carefully wrapped a blanket around Isabelle, who was sleeping stretched out across the floor, her head on her brother’s lap. But Simon couldn’t feel it, not really.\\n\\n Clary and Jace had gone to check the tunnels and make sure they were still free of demons and other possible stray nasties. Alec hadn’t wanted to leave Isabelle, and Simon had been too weak and dizzy to contemplate moving much. Not that he had let that fact be known. Technically he was on watch, listening for anything that might come at them from the shadows.\\n\\n Alec was staring into the flames. The yellow light made him look tired, older. “Thanks,” he said, suddenly.\\n\\n Simon almost jumped. Alec hadn’t said a word to him since What are you doing? “For what?”\\n\\n “Saving my sister,” said Alec. He brushed a hand through Isabelle’s dark hair. “I know,” he said, a little haltingly. “I mean, I knew, when we came here, that this could be a suicide mission. I know it’s dangerous. I know I can’t really expect us all to survive. But I thought it would be me, not Izzy. . . .”\\n\\n “Why?” Simon said. His head was pounding, his mouth dry.\\n\\n “Because I’d rather it was me,” Alec said. “She’s—Isabelle. She’s smart and tough and a good fighter. Better than me. She deserves to be all right, to be happy.” He looked at Simon through the fire. “You have a sister, don’t you?”\\n\\n Simon was jolted by the question—New York seemed a world, a lifetime away. “Rebecca,” he said. “That’s her name.”\\n\\n “And what would you do to someone who made her unhappy?”\\n\\n Simon eyed Alec warily. “I would reason with them,” he said. “Talk it out. Maybe an understanding hug.”\\n\\n Alec snorted and seemed about to reply; then his head snapped around, as if he’d heard something. Simon raised an eyebrow. It wasn’t often a human heard something before a vampire did. A moment later he recognized the sound himself, and understood: It was Jace’s voice. Illumination danced at the end of the far tunnel, and Clary and Jace appeared, Clary holding a witchlight in her hand.\\n\\n Even in her boots Clary barely came to Jace’s shoulder. They weren’t touching, but they moved together toward the fire. Simon thought that while they had seemed like a couple ever since the first time they’d come back from Idris, they seemed like something more now. They seemed like a team.\\n\\n “Anything interesting?” Alec asked as Jace came to sit beside the fire.\\n\\n “Clary put glamour runes on the cave entrances. No one should be able to see that there’s any way in here.”\\n\\n “How long will they last?”\\n\\n “Overnight, probably into tomorrow,” said Clary, glancing at Izzy. “What with the runes wearing off quicker here, I’ll have to check them later.”\\n\\n “And I’ve got a better idea of where we’re positioned in terms of Alicante. I’m pretty sure that the rock wasteland where we were last night”—Jace pointed at the rightmost tunnel—“looks out over what I think used to be Brocelind Forest.”\\n\\n Alec half-closed his eyes. “That’s depressing. The forest was—beautiful.”\\n\\n “Not anymore.” Jace shook his head. “Just wasteland, as far as you can see.” He bent and touched Isabelle’s hair, and Simon felt a small pointless flare of jealousy—that he could touch her so carelessly, show his affection without thinking. “How is she?”\\n\\n “Good. Sleeping.”\\n\\n “Think she’ll be well enough to move by tomorrow?” Jace’s voice was anxious. “We can’t stay here. We’ve sent up enough warnings that we’re present. If we don’t get to Sebastian, he’ll find us first. And we’re running out of food.”\\n\\n Simon lost Alec’s murmured response; a sudden stabbing pain shot through him, and he doubled up. He felt robbed of his breath, except he didn’t breathe. Nevertheless his chest hurt, as if something had been ripped out of it.\\n\\n “Simon. Simon!” Clary said sharply, her hand on his shoulder, and he looked up at her, his eyes streaming tears tinged with blood. “God, Simon, what’s wrong?” she asked, frantic.\\n\\n He sat up slowly. The pain was already starting to ebb. “I don’t know. It was like someone stuck a knife into my chest.”\\n\\n Jace was swiftly on his knees in front of him, his fingers under Simon’s chin. His pale gold gaze searched Simon’s face. “Raphael,” Jace said finally, in a flat voice. “He’s your sire, the one whose blood made you a vampire.”\\n\\n Simon nodded. “So?”\\n\\n Jace shook his head. “Nothing,” he muttered. “When did you last feed?”\\n\\n “I’m fine,” Simon said, but Clary had already caught at his right hand and lifted it; the gold faerie ring shone on his finger. The hand itself was dead white, the veins under the skin showing black, like a network of cracks in marble. “You’re not fine—haven’t you fed? You lost all that blood!”\\n\\n “Clary—”\\n\\n “Where are the bottles you brought?” She cast around, looking for his bag, and found it shoved against the wall. She yanked it toward her. “Simon, if you don’t start taking better care of yourself—”\\n\\n “Don’t.” He grabbed the strap of the bag away from her; she glared at him. “They broke,” he said. “The bottles broke, when we were fighting the demons in the Accords Hall. The blood’s gone.”\\n\\n Clary stood up. “Simon Lewis,” she said furiously. “Why didn’t you say something?”\\n\\n “Say something about what?” Jace moved away from Simon.\\n\\n “Simon’s starving,” Clary explained. “He lost blood healing Izzy, and his supply was wrecked in the Hall—”\\n\\n “Why didn’t you say something?” Jace asked, rising and pushing back a lock of blond hair.\\n\\n “Because,” Simon said. “It’s not like there’s animals I can feed on here.”\\n\\n “There’s us,” Jace said.\\n\\n “I don’t want to feed on my friends’ blood.”\\n\\n “Why not?” Jace stepped past the fire and looked down at Simon; his expression was open and curious. “We’ve been here before, haven’t we? Last time you were starving, I gave you my blood. It was a little homoerotic, maybe, but I’m secure in my sexuality.”\\n\\n Simon sighed internally; he could tell that under the flippancy, Jace was completely serious in his offer. Probably less because it was sexy than because Jace had a death wish the size of Brooklyn.\\n\\n “I’m not biting someone whose veins are full of heavenly fire,” Simon said. “I have no desire to be toasted from the inside out.”\\n\\n Clary swept her hair back, baring her throat. “Look, drink my blood. I always said you were welcome to it—”\\n\\n “No,” Jace said immediately, and Simon saw him remembering the hold in Valentine’s ship, the way Simon had said I would have killed you, and Jace had replied, wonderingly, I would have let you.\\n\\n “Oh, for God’s sake. I’ll do it.” Alec stood up, carefully repositioning Izzy on the blanket. He tucked the edge around her and straightened.\\n\\n Simon let his head fall back against the wall of the cave. “You don’t even like me. Now you’re offering me your blood?”\\n\\n “You saved my sister. I owe you.” Alec shrugged, his shadow long and dark in the light of the flames.\\n\\n “Right.” Simon swallowed awkwardly. “Okay.”\\n\\n Clary reached her hand down. After a moment Simon took it and let her haul him to his feet. He couldn’t help staring across the room at Isabelle, asleep, half-wrapped in Alec’s blue blanket. She was breathing, slow and steady. Izzy, still breathing, because of him.\\n\\n Simon took a step toward Alec, and stumbled. Alec caught him and steadied him. His grip on Simon’s shoulder was hard. Simon could feel Alec’s tension in it, and he suddenly realized how bizarre the situation was: Jace and Clary gawking openly at them, Alec looking as if he were bracing himself to have a bucket of ice water dumped over his head.\\n\\n Alec turned his head a little to the left, baring his throat. He was staring off fixedly at the opposite wall. Simon decided he looked less like someone who was about to have ice water dumped on their head and more like someone about to endure an embarrassing exam at the doctor’s office.\\n\\n “I am not doing this in front of everyone,” Simon announced.\\n\\n “It’s not spin the bottle, Simon,” said Clary. “It’s just food. Not that you’re food, Alec,” she added when he glared. She held her hands up. “Never mind.”\\n\\n “Oh, for the Angel’s—” Alec began, and closed his hand around Simon’s upper arm. “Come on,” he said, and dragged Simon partway down the tunnel that led back toward the gate, just far enough so that the others faded out of view, disappearing behind a jut of rock.\\n\\n Though Simon did hear the last thing Jace said, just before they faded out of earshot. “What? They need privacy. It’s an intimate moment.”\\n\\n “I think you should just let me die,” Simon said.\\n\\n “Shut up,” Alec said, and pushed him up against the cave wall. He eyed Simon thoughtfully. “Does it have to be my neck?”\\n\\n “No,” Simon said, feeling as if he had wandered into a bizarre dream. “Wrists are okay too.”\\n\\n Alec began to push up the sleeve of his sweater. His arm was bare and pale except where the Marks were, and Simon could see his veins under his skin. Despite himself, he felt the sting of hunger, rousing him from exhaustion: He could smell blood, soft and salty, rich with the tang of daylight. Shadowhunter blood, like Izzy’s. He ran his tongue along his upper teeth and was only a little surprised to feel his canines hardening and sharpening into fangs.\\n\\n “I just want you to know,” Alec said as he held his wrist out, “that I realize that to you vampires this feeding business sometimes equals sexy times.”\\n\\n Simon’s eyes widened.\\n\\n “My sister may have told me more than I wanted to know,” Alec admitted. “Anyway, my point is that I am not attracted to you in the slightest.”\\n\\n “Right,” Simon said, and took Alec’s hand. He tried for a brotherly sort of grasp, but it didn’t quite work, considering that he had to bend Alec’s hand back to bare the vulnerable part of his wrist. “Well, you don’t ring my bells either, so I guess we’re even. Although, you could have faked it for five—”\\n\\n “No, I couldn’t,” Alec said. “I hate it when straight guys think all gay guys are attracted to them. I’m not attracted to every guy any more than you’re attracted to every girl.”\\n\\n Simon took a deep, purposeful breath. It was always a strange feeling, breathing when he didn’t need to, but it was calming. “Alec,” he said. “Chill. I don’t think you’re in love with me. In fact, most of the time I think you hate me.”\\n\\n Alec paused. “I don’t hate you. Why would I hate you?”\\n\\n “Because I’m a Downworlder? Because I’m a vampire who’s in love with your sister and you think she’s too good for me?”\\n\\n “Don’t you?” Alec said, but it was without rancor; after a moment he smiled a little, that Lightwood smile that lit up his face and made Simon think of Izzy. “She’s my little sister. I think she’s too good for everyone. But you—you’re a good person, Simon. Regardless of whether you’re a vampire, too. You’re loyal and you’re smart and you—you make Isabelle happy. I don’t know why, but you do. I know I didn’t like you when I met you. But that changed. And I’d hardly judge my sister for dating a Downworlder.”\\n\\n Simon stood very still. Alec was all right with warlocks, he thought. That much was obvious enough. But warlocks were born what they were. Alec was the most conservative of the Lightwood children—he wasn’t chaos-loving or risk-taking like Jace and Isabelle—and Simon had always felt it in him, that sense that a vampire was a human transformed into something wrong.\\n\\n “You wouldn’t agree to being a vampire,” Simon said. “Not even to be with Magnus forever. Right? You didn’t want to live forever; you wanted to take his immortality away. That’s why he broke up with you.”\\n\\n Alec flinched. “No,” he said. “No, I wouldn’t want to be a vampire.”\\n\\n “So you do think I’m less than you,” Simon said.\\n\\n Alec’s voice cracked. “I’m trying,” he said, and Simon felt it, felt how much Alec wanted to mean it, maybe even did mean it a little bit. And after all, if Simon hadn’t been a vampire, he would still have been a mundane, still lesser. He felt Alec’s pulse surge in the wrist he was holding. “Go ahead,” Alec said, exhaling his words, clearly in an agony of waiting. “Just—do it.”\\n\\n “Brace yourself,” Simon said, and lifted Alec’s wrist to his mouth. Despite the tension between them, his body, hungry and deprived, responded. His muscles tightened and his fang teeth snapped out of their own accord. He saw Alec’s eyes darken with surprise and fear. Hunger spread like a fire through Simon’s body, and he spoke out of the drowning depths of it, struggling to try to say something human to Alec. He hoped he was audible enough to be understood around his fangs. “I’m sorry about Magnus.”\\n\\n “Me too. Now bite,” Alec said, and Simon did, his fangs piercing fast and clean through the skin, the blood exploding into his mouth. He heard Alec gasp, and Simon gripped involuntarily tighter, as if to prevent Alec from trying to pull away. But Alec didn’t try. His wild heartbeat was audible to Simon, pounding down through his veins like the tolling of a bell. Along with Alec’s blood, Simon could taste the metal of fear, the spark of pain, and the eager flame of something else, something he had tasted the first time he had drunk Jace’s blood on the filthy metal floor of Valentine’s ship. Maybe all Shadowhunters did have a death wish, after all. \\n\\n","sourceLink":"https://allnovel.net/city-of-heavenly-fire-the-mortal-instruments-6/page-37.html","bookId":2008,"book":{"id":2008,"title":"City of Heavenly Fire (The Mortal Instruments #6)","description":"Storyline: In this dazzling and long-awaited conclusion to the acclaimed Mortal Instruments series, Clary and her friends fight the greatest evil they have ever faced: Clary\u0027s own brother. \\n Sebastian Morgenstern is on the move, systematically turning Shadowhunter against Shadowhunter. Bearing the Infernal Cup, he transforms Shadowhunters into creatures out of nightmare, tearing apart families and lovers as the ranks of his Endarkened army swell. \\n The embattled Shadowhunters withdraw to Idris - but not even the famed demon towers of Alicante can keep Sebastian at bay. And with the Nephilim trapped in Idris, who will guard the world against demons? \\n When one of the greatest betrayals the Nephilim have ever known is revealed, Clary, Jace, Isabelle, Simon, and Alec must flee - even if their journey takes them deep into the demon realms, where no Shadowhunter has set foot before, and from which no human being has ever returned... \\n Love will be sacrificed and lives lost in the terrible battle for the fate of the word in the thrilling final installment of the classic urban fantasy series The Mortal Instruments!\\n","cover":"https://allnovel.net/images/city-of-heavenly-fire-the-mortal-instruments-6.jpg","author":"Cassandra Clare","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/city-of-heavenly-fire-the-mortal-instruments-6.html","creation":"Oct 5, 2019 8:58:14 AM","modification":"Oct 5, 2019 6:40:54 PM"}}
