{"id":67512,"no":153,"title":"Page 153","content":"That would have to end.\n Tonight.\n She tugged at her collar at a red light and tried to ignore the bothersome feeling that she was missing something important, something, she sensed, that had to do with the damned film. Staring through her windshield where the steady drizzle was being slapped away by her wipers, she decided she needed to change up her game to solve this case. Aside from going through the routine motions of the investigation of the homicides, she needed to think outside of the box. The masks and the movie were the connections between the murders of Holly Dennison in LA and Brandi Potts, here, in Portland. There was no doubt in Nash’s mind that they were killed by the same person, but they were also part of a bigger plan that included Cassie Kramer, if she were to be believed about how she ended up with yet another similar bizarre mask.\n Had Cassie gotten the mask as a warning? Did the killer leave them with the intended victims before actually murdering them? Had Cassie Kramer just gotten lucky and escaped California before the killer could strike? If that were the case, why not take her out up here in Portland? Why kill Brandi? And why hadn’t either of the victims reported receiving them?\n She glanced in her rearview mirror and saw a row of headlights. A delivery van idled beside her in the next lane, but she barely noticed she was so caught up in her own thoughts.\n How did the masks and murders fit in with the disappearance of Allie Kramer? Was Allie, too, a victim, possibly already dead, maybe even wearing one of those obscene masks and left somewhere obscure, not yet found? Or was she behind the homicides?\n Really? From a rising star in Hollywood to homicidal maniac?\n That didn’t pencil out.\n And why put her own distorted image on her victims?\n Again—it didn’t make any sense.\n The light changed.\n Nash punched the accelerator, cut in front of the slow-moving van and drove through the rain to the office. She parked across the street, waited impatiently for the pedestrian light to change, then feeling as if she were running out of time, hurried through the crush of people. She jogged into the building and after catching an elevator car, tapped her foot impatiently as it slowly climbed to the floor for the Homicide Division.\n Once in the office again, she hung up her wet coat, then, in her cubicle, settled into her desk chair where she opened the packet from Mercy Hospital again and studied the information. It wasn’t much, but she did glean that Belva Nelson had been little more than a part-time employee over a span of five years. The hospital had been called St. Mary’s at the time, some thirty years ago, and Belva had been hired to cover shifts in neurology, surgery, recovery, and maternity.\n Nash felt a little sizzle in her blood as she stared at the list. There was the neurological link. Cassie had mental issues; perhaps they’d been inherited from someone in her family. Her father? Mother? And then there was the maternity listing.\n She did quick mental calculations.\n As far as she knew, Jenna Hughes did not grow up in Portland, but what if she had gotten pregnant, been a girl “in trouble”? The timing would be about right if Jenna had been a teen, and though it seemed a stretch, maybe not so much. Nash’s eyes narrowed. Today’s morals weren’t the same as they had been thirty to forty years ago. Teen mothers weren’t as likely to keep their babies. Oftentimes pregnancies were hidden, girls giving up their babies after leaving school.\n Was it possible?\n Did Jenna have another child?\n One born before Cassie?\n Nash’s heartbeat ticked up. She sensed she might be onto something. Then again, she could be wrong in many ways. Even if Jenna had given a baby up for adoption, what would that child have to do with any of this? Could he or she be involved? A killer? An accomplice?\n Whoa, whoa, whoa! Don’t go jumping off the deep end here. You need facts. Cold, hard facts. Not some ill-founded concept straight out of one of Edwina’s soap operas. Think, Rhonda, think.\n She tapped her fingers on the edge of her desk and stared at the information a few more seconds before punching out the number for vital records. If Jenna Hughes had borne a child in Oregon, there would be some record of it. Nash just had to look.\n “Seek and ye shall find,” she whispered.\n For the first time in a week, Nash actually smiled. \n","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-153.html","bookId":2675,"book":{"id":2675,"title":"After She\u0027s Gone (West Coast #3)","description":"Storyline: \n In this explosive new thriller, #1 New York Times bestselling author Lisa Jackson delves into the deep bond between two sisters and their shared dream that becomes a harrowing nightmare of madness, hatred and jealousy… \n Cassie Kramer and her younger sister, Allie, learned the hazards of fame long ago. Together, they’d survived the horror of a crazed fan who nearly killed their mother, former Hollywood actress Jenna Hughes. Still, Cassie moved to L.A., urging Allie to follow. As a team, they’d take the town by storm. But Allie, finally free of small-town Oregon, and just that little bit more beautiful, also proved to be more talented—and driven. Where Cassie got bit parts, Allie rose to stardom. But now her body double has been shot on the set of her latest movie—and Allie is missing. \n Police discover that the last call to Allie’s phone came from Cassie, though she has no recollection of making it. Instead of looking like a concerned relative, Cassie is starting to look like a suspect—the jealous sister who finally grew sick of playing a supporting role. As the tabloids go into a frenzy, Cassie ends up on a Portland psych ward. Is she just imagining the sinister figure who comes to her bedside, whispering about Allie—a visitor of whom there is no record? Is someone trying to help—or drive her mad? \n Convinced she’s the only one who can find Allie, Cassie checks herself out of the hospital. But a sudden slew of macabre murders— each victim masked with a likeness of a member of Cassie’s family—makes Cassie fear for her safety and her sanity. The only way to end the nightmare is to find out what really happened to Allie. And with each discovery, Cassie realizes that no one can be trusted to keep her safe—least of all herself…\n \n","cover":"https://allnovel.net/images/after-she-s-gone-west-coast-3.jpg","author":"Lisa Jackson","type":"Thriller","source":"allnovel","link":"https://allnovel.net/after-she-s-gone-west-coast-3.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:02:33 AM"}}
