{"id":67513,"no":154,"title":"Page 154","content":"“What’s this all about?” Trent asked as Cassie, behind the wheel of her Honda, turned into the lane leading to her mother’s house. They were on their way to Portland to Dean Arnette’s party, but Jenna had called and insisted that they stop by her house first. “Don’t know,” Cassie said as she pulled up to the rambling house she’d called home for most of her teens, a home she’d once hated. She still had ambivalent feelings toward the rustic, now renovated, ranch house. “But it sounded urgent. Jenna wouldn’t take ‘no’ for an answer. Believe me, I tried to beg off, but, uh-uh. No dice.” Yanking her keys from the ignition, she felt more than a little trepidation. Jenna had been insistent. And there hadn’t been an iota of levity in her request, no, make that demand. “Please, Cassie, do this,” she’d said. “But we’re already late.” “I don’t care.” Jenna had sighed, played the trump “Mom” card. “Look, I don’t ask for much. Do me this one favor.” So Cassie had buckled and here she was, walking across the porch to the front door. Her breath caught as she spied her grim-faced mother peering out the window. An icy feeling of déjà vu crawled through her mind. Whitney Stone’s footage had shown Allie at that very window, peeking out, then disappearing as she headed for the front door. Oh, Jesus. Something happened. Allie! Heart in her throat, Cassie was about to reach for the handle when the door flew open and Jenna, pale as death, sailed over the threshold to hug her daughter fiercely, as if she were afraid Cassie would disappear into thin air. Like Allie. “Hey. Mom. Are you okay? What happened?” she asked. Jenna was actually shaking. “Mom?” she asked, still in her mother’s embrace. Looking over Jenna’s shoulder, Cassie caught Trent’s eye and cast him an I-don’t-get-this glance, then saw movement on the other side of the door when Carter, unshaven, his jaw set, appeared in the hallway. “Come on in,” her stepfather said, his voice low, his face serious. As if someone had died. Cassie’s heart sank. All her fears congealed. “Oh, God, Mom, is it Allie? Is she all right?” “Oh, honey, I don’t know.” Jenna’s voice broke. Cassie yanked herself free and held her mother at arm’s length so she could stare into Jenna’s tortured eyes. “What is it? What happened?” “I . . . we haven’t heard anything about Allie,” Jenna said, tears forming as a gust of wind raced across the porch. “Then what? Are you okay?” Her mother and stepfather exchanged glances. “Come inside,” Jenna said, blinking and managing a frail smile. “I need to talk to you.” Another time, Cassie would have protested. Jenna knew that they were late, they’d talked about it on the phone, so, the fact that Jenna was so insistent coupled with Jenna’s emotional state warned Cassie that something major was up. Something not good. Apprehension propelled her into the house and she felt Trent’s hand on her elbow as she followed Jenna and Shane into the kitchen with Trent one step behind. Like most of the other rooms in the house, the kitchen had been updated since she lived there—new tile floors, appliances, and countertops—but the layout much the same. She stood at the island and wondered what in the world was going on. Her mother had always been theatrical, but this? It was over the top, even for Jenna Hughes. “Can I . . .” Jenna started, seeming to have composed herself a bit. She swiped almost angrily at the unwanted tears. “Can I get you coffee or a drink or—?” “No! Just tell me what’s going on!” Cassie interrupted. “You look like someone died.” Jenna stiffened, then said to Shane, “Well, I need something. Strong.” “You got it.” Her husband was already reaching into a cupboard for a bottle of some kind of whiskey. He poured two short glasses, added ice from the freezer, then raising his eyebrows in a silent question, looked at Trent. Cassie’s husband’s face was as somber as Carter’s, his jaw set in granite. He gave a quick shake of his head. “Another time.”","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-154.html","bookId":2675,"book":{"id":2675,"title":"After She\u0027s Gone (West Coast #3)","description":"Storyline: In this explosive new thriller, #1 New York Times bestselling author Lisa Jackson delves into the deep bond between two sisters and their shared dream that becomes a harrowing nightmare of madness, hatred and jealousy… Cassie Kramer and her younger sister, Allie, learned the hazards of fame long ago. Together, they’d survived the horror of a crazed fan who nearly killed their mother, former Hollywood actress Jenna Hughes. Still, Cassie moved to L.A., urging Allie to follow. As a team, they’d take the town by storm. But Allie, finally free of small-town Oregon, and just that little bit more beautiful, also proved to be more talented—and driven. Where Cassie got bit parts, Allie rose to stardom. But now her body double has been shot on the set of her latest movie—and Allie is missing. Police discover that the last call to Allie’s phone came from Cassie, though she has no recollection of making it. Instead of looking like a concerned relative, Cassie is starting to look like a suspect—the jealous sister who finally grew sick of playing a supporting role. As the tabloids go into a frenzy, Cassie ends up on a Portland psych ward. Is she just imagining the sinister figure who comes to her bedside, whispering about Allie—a visitor of whom there is no record? Is someone trying to help—or drive her mad? Convinced she’s the only one who can find Allie, Cassie checks herself out of the hospital. But a sudden slew of macabre murders— each victim masked with a likeness of a member of Cassie’s family—makes Cassie fear for her safety and her sanity. The only way to end the nightmare is to find out what really happened to Allie. And with each discovery, Cassie realizes that no one can be trusted to keep her safe—least of all herself…","cover":"https://allnovel.net/images/after-she-s-gone-west-coast-3.jpg","author":"Lisa Jackson","type":"Thriller","source":"allnovel","link":"https://allnovel.net/after-she-s-gone-west-coast-3.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:02:33 AM"}}
