{"id":67378,"no":19,"title":"Page 19","content":"“Cass.” He was wearing a black shirt, beat-up jeans, and glasses. His usual three-day beard stubble looked closer to five or six and made him appear more intellectual than he actually was, like he was trying on his Johnny Depp vibe. At five-ten, he was lean and well muscled from hours working out in the gym, and every bit the image of a leading man in Hollywood. His tousled dark hair, deep-set eyes, strong jaw, and slightly off-center smile had helped make McNary a definitive male A-lister.\n And he was an ass. A real ass.\n Cassie knew.\n Hadn’t she once, stupidly, almost fallen for him? Almost, she reminded herself.\n “So?” she said, and repeated, “Why are you here?”\n “Probably doing the same thing you are,” he said with a shrug. “Trying to figure out what happened to Allie.”\n “You have a key?” She stepped into the living room with its gleaming hardwood floor.\n He hitched his chin toward the front door. “My place is across the hall, so we thought it was best to be able to check on each other’s apartment. I’m moving out at the end of the month. The film’s wrapped and it’s time to move on. Got another gig. Action-adventure. New genre for me.”\n If he thought she would congratulate him or even comment, he was wrong and the silence stretched until he said, “But, you know, I thought I’d take one last look around.”\n “With the lights off?”\n “I was just leaving. Already turned ’em off.”\n “Most people do it at the door, you know, so they don’t bump into anything on their way out.”\n “I know my way around,” he said, and crossed the living space to stop in the entry, close enough to Cassie to make her want to back up a step. “I’m not ‘most people,’ am I?”\n “No, you’re not,” she agreed coolly. God, he was smug, and though she hated to admit it, a decent, maybe even more than decent, actor. For a few weeks, before he met Allie, she’d even dated him. She’d been an idiot, but he was charming, in a self-serving manner, and when he focused on a woman, you could feel the heat. She certainly had. But now she knew there was a little snake oil running through his veins. “You were here looking for some clue to help you find Allie?”\n He frowned. “Well, yeah . . . and . . . I just wanted to, you know, occupy her space. We did have a thing.”\n “I thought you two had broken up again.”\n A shoulder lifted and fell. “With Allie, it was tough,” he admitted in a moment where he seemed to let down his guard. “I don’t have to tell you that. Half the time she was a woman in control of her destiny, the other half she was an emotional child looking for someone to save her.”\n “Like you?”\n “Exactly.” He hesitated, then added, “And sometimes . . . it was like I didn’t even know her. As if she really was someone else. You know what I mean, right?” He stared at her hard.\n She did, but wasn’t going to admit it. There were many sides to Allie. The bookish nerd. The successful Hollywood actress. The insecure little girl. The hateful, jealous bitch. But Cassie wasn’t going to voice her opinion. She didn’t trust his motives. They were always self-serving. She motioned to the interior of the apartment. “So, while you were playing detective, did you find anything?”\n A quick shake of his head.\n Her gaze swept the neat interior. “Who cleaned up? Not the police.”\n “Your mom, I think.”\n She felt another stab of guilt that she hadn’t yet called Jenna. “You talked to her?”\n “A while back, once the cops had done their thing and were done. I don’t think Jenna could stand it, the mess, I mean. And well . . .” He shrugged. “All of it.”\n Again the bad feeling that she was being a stubborn, uncaring daughter wormed its way through her brain. “I take it you haven’t heard from Allie?”\n He looked up quickly, anger flaring, his gaze drilling into her. “If I had, would I be here?”\n “I don’t know. Would you?”\n Shaking his head, he muttered, “You never let it go, do you?”\n “What?”\n “Everything and anything.” His tone was sharp, his famed mercurial temper showing itself, his too-handsome face flushing in an instant. His fists actually balled before he stretched his fingers. “No reason to tiptoe around. You have trust issues, Cass.” \n","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-19.html","bookId":2675,"book":{"id":2675,"title":"After She\u0027s Gone (West Coast #3)","description":"Storyline: \n In this explosive new thriller, #1 New York Times bestselling author Lisa Jackson delves into the deep bond between two sisters and their shared dream that becomes a harrowing nightmare of madness, hatred and jealousy… \n Cassie Kramer and her younger sister, Allie, learned the hazards of fame long ago. Together, they’d survived the horror of a crazed fan who nearly killed their mother, former Hollywood actress Jenna Hughes. Still, Cassie moved to L.A., urging Allie to follow. As a team, they’d take the town by storm. But Allie, finally free of small-town Oregon, and just that little bit more beautiful, also proved to be more talented—and driven. Where Cassie got bit parts, Allie rose to stardom. But now her body double has been shot on the set of her latest movie—and Allie is missing. \n Police discover that the last call to Allie’s phone came from Cassie, though she has no recollection of making it. Instead of looking like a concerned relative, Cassie is starting to look like a suspect—the jealous sister who finally grew sick of playing a supporting role. As the tabloids go into a frenzy, Cassie ends up on a Portland psych ward. Is she just imagining the sinister figure who comes to her bedside, whispering about Allie—a visitor of whom there is no record? Is someone trying to help—or drive her mad? \n Convinced she’s the only one who can find Allie, Cassie checks herself out of the hospital. But a sudden slew of macabre murders— each victim masked with a likeness of a member of Cassie’s family—makes Cassie fear for her safety and her sanity. The only way to end the nightmare is to find out what really happened to Allie. And with each discovery, Cassie realizes that no one can be trusted to keep her safe—least of all herself…\n \n","cover":"https://allnovel.net/images/after-she-s-gone-west-coast-3.jpg","author":"Lisa Jackson","type":"Thriller","source":"allnovel","link":"https://allnovel.net/after-she-s-gone-west-coast-3.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:02:33 AM"}}
