{"id":67435,"no":76,"title":"Page 76","content":"Jesus Holy Christ! Fear slithered through him. His throat went dry. If he hadn’t just peed, he would have pissed himself right then and there. He backed away fast, around the Chevy again. Oh, God. Oh, shit. Oh, hell! Frantically he scrabbled in his pocket for his phone, yanked it out, then promptly dropped it on the wet asphalt. The damned cell skated away from him, but he managed to scoop it up while scraping his fingers on the rough pavement that was still wet and warm with his own damned urine. He didn’t care. Heart thudding with fear, the alcohol in his bloodstream seemed to dissipate as he heard a footfall behind him. He turned quickly, fear making his breath come in quick, shallow breaths. “I need help,” he said to the darkness, but the parking lot was empty, the footstep all part of his wild, frenzied imagination. “Help! Someone! I need help here!” he yelled. With shaking fingers, he ignored the acrid stench of piss and punched in 9-1-1. His gaze slid back to that white, grotesque face. “Nine-one-one,” an operator answered. “Please state your name and nature of your emergency—” “Get someone here. Now! Do you hear me? Get them here.” “Sir, if you would tell me where you are and what’s happening—” “I don’t know what’s happening. But she’s dead! She’s fuckin’ dead!” “Who’s dead, sir?” the firm voice asked. “Where are you?” “I don’t know her . . . She’s a . . . freak. Oh, my God, just send someone!” In a full-blown panic he looked around, trying to focus on a street sign but he couldn’t think straight. “Shit, where am I? By the Pinwheel. The bar. In . . . Venice on Pacific and . . . crap, I don’t know what the cross street is. But she’s in the parking lot. I’m telling you, there’s a fuckin’ dead body on the floor—I mean on the ground. I was taking a whiz, for fuck’s sake, I nearly tripped over her.” His voice was rising and he backed away from the body, the freaking dead body. “Get someone here,” he screamed. “NOW!” CHAPTER 17 Detective Jonas Hayes stared down at the body. At three in the damned morning. He’d seen a lot of weird shit in his years on the force in LA, but tonight’s crime scene was right up there with the most bizarre. Three police cruisers blocked the entrance of the parking lot, their light bars strobing the area in bright flashes of red and blue, making the scene even more eerie. The air was as still as it ever got in this part of town, little traffic, the smell of the ocean faint in the luminescence of streetlights and a few thin clouds. The ME was on his way, several techs already working the parking lot, looking for trace evidence and snapping pictures. Even at this unholy hour a handful of onlookers had gathered, mostly barflies who had been kicked out as the establishments had closed. The looky-loos talked among themselves, speculated drunkenly, probably were piecing together what was going on due to a passing interest in CSI, Law \u0026 Order, or in one older guy’s case Murder, She Wrote or Dragnet or some such crap. Hayes paid them no mind as he took in the crime scene. The victim’s purse held a driver’s license for Holly Dennison, though ID hadn’t been completely established as the victim, left sprawled on the pavement, a gunshot wound to her chest, had been wearing a mask, a bizarre twisted image of Allie Kramer, the missing movie star who had recently disappeared. The dead woman’s identification was still unconfirmed, but probably could be surmised. If she was Holly Dennison, her most recent employment had been with Galactic West Productions as part of the set crew for Dead Heat, the movie starring the missing Allie Kramer. As Hayes had been working on the disappearance of Dead Heat’s lead actress, he recognized her head shot, even though the picture was distorted, the eyes cut to allow vision . . . maybe. Had Holly been wearing the mask before she was killed, hence the eyeholes? Or had the mask been placed over her head postmortem? But why? And who? “Who found her?” he asked one of the beat cops who was standing guard near the entrance of the lot. “Guy by the name of Mitch Stevens. He’d been at the Pinwheel next door and according to the barkeep had been cut off and thrown out. He’d come over here to take a leak and literally stumbled over her.” The cop hitched his head to a small group standing near a parked Camaro with a bold racing stripe. Two cops were talking to a twenty-to-thirty-year-old who looked like he wanted to be anywhere but in this parking lot.","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-76.html","bookId":2675,"book":{"id":2675,"title":"After She\u0027s Gone (West Coast #3)","description":"Storyline: In this explosive new thriller, #1 New York Times bestselling author Lisa Jackson delves into the deep bond between two sisters and their shared dream that becomes a harrowing nightmare of madness, hatred and jealousy… Cassie Kramer and her younger sister, Allie, learned the hazards of fame long ago. Together, they’d survived the horror of a crazed fan who nearly killed their mother, former Hollywood actress Jenna Hughes. Still, Cassie moved to L.A., urging Allie to follow. As a team, they’d take the town by storm. But Allie, finally free of small-town Oregon, and just that little bit more beautiful, also proved to be more talented—and driven. Where Cassie got bit parts, Allie rose to stardom. But now her body double has been shot on the set of her latest movie—and Allie is missing. Police discover that the last call to Allie’s phone came from Cassie, though she has no recollection of making it. Instead of looking like a concerned relative, Cassie is starting to look like a suspect—the jealous sister who finally grew sick of playing a supporting role. As the tabloids go into a frenzy, Cassie ends up on a Portland psych ward. Is she just imagining the sinister figure who comes to her bedside, whispering about Allie—a visitor of whom there is no record? Is someone trying to help—or drive her mad? Convinced she’s the only one who can find Allie, Cassie checks herself out of the hospital. But a sudden slew of macabre murders— each victim masked with a likeness of a member of Cassie’s family—makes Cassie fear for her safety and her sanity. The only way to end the nightmare is to find out what really happened to Allie. And with each discovery, Cassie realizes that no one can be trusted to keep her safe—least of all herself…","cover":"https://allnovel.net/images/after-she-s-gone-west-coast-3.jpg","author":"Lisa Jackson","type":"Thriller","source":"allnovel","link":"https://allnovel.net/after-she-s-gone-west-coast-3.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:02:33 AM"}}
