{"id":67451,"no":92,"title":"Page 92","content":"“Look, Cass, I don’t know how to make you get it. I really don’t know Allie, only through you as my sister-in-law. As for this”—he thumped the tiny screen with a finger—“I have no idea what it means. None.”\n He was so emphatic, she almost believed him. Which sent her back to square one. “Are you sure?”\n “Jesus, Cass. I don’t know your damned sister! I didn’t sleep with her!”\n A man in a baseball cap who had been forking a bite of meat loaf into his mouth turned his head. Trent noticed the guy and lowered his voice. “That’s it, Cassie!” he warned. “You’ve got to find a way to trust me.”\n “I’m trying.”\n “Try harder.” Scowling, he studied the message on her phone and appeared to somehow rein in his anger. “So this is what you’ve got? Santa Fe 07?”\n “Yeah.”\n “A message from your doctor?” He slid the phone across the table that was topped in Formica straight out of the 1960s, and dug into the rest of his meal.\n Cassie nodded.\n “Could the text have been sent to you by mistake?”\n “I suppose.” She’d considered that possibility herself. “Or maybe it’s just gobbledygook. You know, maybe the doctor let one of her grandchildren play with it and . . . no, I don’t think so.” Virginia Sherling didn’t seem like the kind of woman who would let kids touch anything associated with her professional life, and Cassie wasn’t sure the woman had ever been married or had a child.\n “Did you call her? Ask her about it?”\n “Called. Didn’t leave a message.” She frowned. “I’m her patient, her mental patient. I didn’t want to leave some kind of voice mail she might misinterpret.”\n “By thinking you were . . . what? Hallucinating about a text? It would show on her phone, too.”\n “It’s touchy with the doctor. Dr. Sherling didn’t release me. In fact, she thought my leaving Mercy wasn’t the best idea, and she said so.” She pushed aside the remains of her sandwich. “I decided to leave it alone for a while. Besides, everything at the hospital was so out of sync,” she admitted.\n “What do you mean?”\n She hesitated.\n “Cass? If you want me to help, you have to confide in me.”\n “Hey, I didn’t ask for your help. You showed up on my doorstep. Remember?”\n “Okay.”\n “Okay?”\n She might have said more but the lift of one eyebrow, silently accusing her of not acknowledging that she might want his help, no matter how hard she protested, caused her to rethink her position. Knowing she was probably making a mistake of immense proportions, she nevertheless told him about her dream in the hospital, about the nurse from an earlier era telling her that her sister was alive. But she kept the part about the reasons she’d checked herself in, the hallucinations and blackouts to herself. She saw no reason to muddle the issue. At least not yet.\n He didn’t remark, just kept right on eating while he listened. When he was finished, he pushed his plate aside.\n “You think the nurse was real,” he said.\n “Rinko said he saw her.”\n “Rinko?” Trent repeated, his eyes narrowing. “The kid at the hospital with all the car stats?”\n “And sports statistics,” she said, fishing into a side pocket of her purse again. “You know him?”\n “I met him. When I came to the hospital looking for you. He said you didn’t want to talk to me.”\n “I didn’t. I told him so.”\n “He conveyed the message very succinctly.”\n She figured as much and changed the topic of conversation before it turned too personal. She’d spent enough time feeling the pain of the breakup, or trying to trust Trent and believe that he hadn’t fallen in love with and taken Allie to bed. That still had the power to make her stomach churn. Nor did she want to consider the fate of their marriage. Doomed? Or repairable? She wasn’t even sure what she wanted, so she decided it was best not to go there. Not on this trip. Not again. So she said, “Rinko’s nearly a genius, but he’s got issues. Severe issues, I gather, though I don’t know what they are. Otherwise he wouldn’t be in Mercy Hospital indefinitely. But, if you ask him a question about any team in the nineteenth or twentieth or twenty-first century, he’s got names, numbers, and RBIs or TDs or goals or three-pointers or assists or . . . whatever. I think it’s impossible to trip him up.” She found the little earring in the side pocket of her purse and set it on the table between them. \n","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-92.html","bookId":2675,"book":{"id":2675,"title":"After She\u0027s Gone (West Coast #3)","description":"Storyline: \n In this explosive new thriller, #1 New York Times bestselling author Lisa Jackson delves into the deep bond between two sisters and their shared dream that becomes a harrowing nightmare of madness, hatred and jealousy… \n Cassie Kramer and her younger sister, Allie, learned the hazards of fame long ago. Together, they’d survived the horror of a crazed fan who nearly killed their mother, former Hollywood actress Jenna Hughes. Still, Cassie moved to L.A., urging Allie to follow. As a team, they’d take the town by storm. But Allie, finally free of small-town Oregon, and just that little bit more beautiful, also proved to be more talented—and driven. Where Cassie got bit parts, Allie rose to stardom. But now her body double has been shot on the set of her latest movie—and Allie is missing. \n Police discover that the last call to Allie’s phone came from Cassie, though she has no recollection of making it. Instead of looking like a concerned relative, Cassie is starting to look like a suspect—the jealous sister who finally grew sick of playing a supporting role. As the tabloids go into a frenzy, Cassie ends up on a Portland psych ward. Is she just imagining the sinister figure who comes to her bedside, whispering about Allie—a visitor of whom there is no record? Is someone trying to help—or drive her mad? \n Convinced she’s the only one who can find Allie, Cassie checks herself out of the hospital. But a sudden slew of macabre murders— each victim masked with a likeness of a member of Cassie’s family—makes Cassie fear for her safety and her sanity. The only way to end the nightmare is to find out what really happened to Allie. And with each discovery, Cassie realizes that no one can be trusted to keep her safe—least of all herself…\n \n","cover":"https://allnovel.net/images/after-she-s-gone-west-coast-3.jpg","author":"Lisa Jackson","type":"Thriller","source":"allnovel","link":"https://allnovel.net/after-she-s-gone-west-coast-3.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:02:33 AM"}}
