{"id":84021,"no":14,"title":"Page 14","content":"\n Letters.\n He went down on one knee to look. The moon was riding high, so bright it was hard to look at, lending more than enough light so he could see . . .\n I-D-I-O-T.\n He grinned down on her. \"Oh, baby,\" he said, and gently reached out to touch her thick, glorious fur. \"It must be love.\"\n Chapter Thirteen\n Moira moved silently through her room. Jared was asleep in her bed in the mansion, but she was too tired to be surprised. Sunrise after the moon had ridden her always left its mark; all she wanted was a quick shower and a ten-hour nap.\n She remembered last night fairly clearly. Of course she didn\u0027t process information the same way as a human and a wolf. But she remembered seeing him in the clearing, knowing he had watched her Change.\n She remembered her hot shame, and running.\n And then he\u0027d come after her, Moira recalled.\n She turned on the shower and stepped inside before the water had time to warm. He had come, had run after her yelling the silliest things, and making as much noise as a herd of rhinos on speed. Derik had actually rolled onto his back and waved all four paws in the air; it had been just too funny.\n And despite his feelings on the subject of Jared—his loudly voiced feelings—Derik, a creature of irresistible curiosity, had gone back. He always liked a good show. Moira had followed, more concerned that Jared would trip and drive a branch through his eye than anything else.\n And there he had been, scratched, bleeding from half a dozen places, and smelling strongly of the werewolf blood Jeannie had no doubt transfused into him. He hadn\u0027t flinched from her wolf form, hadn\u0027t pulled a gun on her.\n Instead, he had told her the most amazing things. And touched her fur with a child\u0027s wonder. Even now, she could hardly believe he\u0027d done that.\n But now what? Happily ever after? Was it possible? More, was it what she wanted?\n She finished showering, toweled herself dry, then slipped into bed. Beside her, Jared didn\u0027t even stir.\n She wasn\u0027t surprised; he was likely more tired than she was.\n Time enough to worry about their future (what future?) later.\n She woke, practically purring. Flexed, hard. Gasped. And came, her orgasm a sweet surprise, like peeling an orange and finding a chocolate inside.\n Jared\u0027s head was between her thighs, his fingers held her apart as he slowly and steadily licked, licked, licked. Given how wet she felt—how terrific she felt!—he\u0027d obviously been at this for a few minutes at least.\n \"Jared . . .\" A groan.\n He laughed against her flesh. \"Shut up, darling.\" His tongue, inside her. Now gone, and lightly stabbing her throbbing clit. His fingers, inside her, now gone. Rubbing, getting slick with her juice.\n She could smell his arousal, violent and sharp, like cedar on fire. His need kindled her own; she realized she wasn\u0027t gasping, she was panting, heaving for breath, desperate to have him inside her.\n And part of her, the fraction of the one percent of her concentration not focused on coming again, thought this was just fine. He wouldn\u0027t be here with me, touching me, if he didn\u0027t still want to be with me. She felt the sweet spasms of another orgasm ripple through her, and moaned.\n \"Jared,\" she said again, and reached for him.\n \"Moira, sweetie, I\u0027m going to need a little help here.\" He was moving up her body, touching her everywhere with hands that smelled like sex. \"Also, you\u0027re going to marry me.\"\n \"I—\"\n \"But just so there\u0027s no doubt. I mean, I get that you\u0027re ten times stronger than me and twice as smart. No problem. But between us, sugar, there\u0027s never going to be any doubt about who wears the pants in the Rocke family.\"\n \"Can\u0027t you stop talking,\" she groaned, wild with impatience, \"and fuck me?\"\n \"Sure thing.\" He had crawled up far enough so that he was crouching over her chest, kneeling on her hands. The pressure was firm, but not painful. Her leverage, however, was for shit. \"But first I need your mouth.\"\n \"Wha—\" Then his hot, hard length was pushing past her lips, his musky scent was in her nostrils, her throat. He throbbed between her cheeks. She shifted her weight to take more of him, and realized she couldn\u0027t move.\n Not that this was such a problem. But still. The idea. Jared had her pinned and despite her strength, there (was his cock, thick and rude) wasn\u0027t much to be done about it. Not that Jared (was rocking back and forth, pushing himself in and out of her mouth) would ever hurt her, but the fact was, she was giving him a blowjob whether she liked it or not. She (could feel her jaws forced wide, to accommodate him, could taste his saltiness) happened to like it. But wasn\u0027t that beside the point?\n Then he was pulsing and her mouth was flooded with that bitter sweetness so peculiar to semen. He groaned as she swallowed, and his hands were in her hair, roughly caressing her curls.\n He pulled out, and away, and collapsed beside her. \"Definitely not the most PC moment of my life,\" he sighed, and pulled her into his arms.\n \"Do you even know what that stands for?\" She tried to be irritated, but in truth, felt almost indecently satisfied. She could still taste him in her mouth.\n \"Perfect Cookies. You are, you know.\"\n \"What?\" She cuddled against his side, ran her fingers gently over the scratches on his chest.\n \"Going to marry me.\"\n \"Gosh, Jared, are you sure ! I mean, I\u0027m so demented about being a werewolf and all . . .\"\n He squinched his eyes shut. \"Okay, okay, I deserved that, have mercy. I suck, all right? Although, not as well as you do . . .\"\n She poked him in the ribs, hard. \"Pig. And excuse me, but I can\u0027t help being astonished at how easy this is. I mean . . . Jared . . . I\u0027m one of the monsters. The creature you sought for years.\"\n \"Nope. Geraldine . . . she was the creature. You\u0027re the woman I love.\"\n She digested that in silence, absently toying with the hair on his chest.\n \"I mean, Geraldine was just one person in the . . . the group. Pack. Whatever. One person . . . she didn\u0027t define the pack. I can\u0027t paint all the other werewolves with the same brush.\" He paused expectantly.\n \"What do you want, applause?\" She smiled and rolled her eyes at him. \"You\u0027re not telling me anything I don\u0027t know.\"\n \"All I\u0027m saying is, werewolves are like anybody else. They\u0027re some really fabulous ones—\" He squeezed her. \"—and some major assholes, but most of them are in between.\" Another expectant pause.\n \"Jared, I know all this. I\u0027ve been trying to get this idea through your head for days.\"\n \"Well,\" he said tentatively, \"what kind of werewolf do you think I\u0027ll be?\"\n She went up on one elbow; stared at him. \"What?\"\n \"Jeannie gave me a whole pint of werewolf blood . . .\"\n \"I know; I smelled it on you last night.\"\n \". . . so I could get healed and go after you. I guess I\u0027ll get pretty hairy in a month or so.\" He contemplated his chest a little worriedly. \"Hairier, I mean.\"\n Astonishment left her wordless for a long moment. \"You thought that the transfusion would make you pack . . . and you did it anyway. So you could find me.\" She could feel her face get hot; her eyes filled.\n \"Oh, Jared . . .\"\n \"Don\u0027t cry, babe. You can show me all the werewolf tricks. It\u0027ll be fine.\"\n \". . . you\u0027re such an idiot.\"\n One golden eyebrow went up. \"That\u0027s not very romantic.\"\n \"I told you before,\" she explained, laughing through her tears, \"being a werewolf isn\u0027t something you can catch. You either are one, or you aren\u0027t. You could have a transfusion every day for a year, but you\u0027d never howl at the moon.\" She kissed him on the mouth, a hearty smack. \"But to think that you didn\u0027t know . . . and you did it anyway . . . I love you. For all sorts of reasons, but most of all for this.\"\n \"Hey, it was nothing,\" he bragged. \"And I love you, too. And you are going to marry me.\"\n \"Yes, so you keep telling me.\"\n He showed her his vulnerable side as he squeezed her again. \"Yeah, but you haven\u0027t answered.\"\n \"Of course I\u0027ll marry you. I\u0027ve been waiting for you . . .\" She thought back over the vista of lonely years.\n \". . . for a long time.\"\n He kissed her again, a hearty smack on the mouth. \"I\u0027ve got about a million questions. Like, if you shave your legs when you\u0027re in your human form, will your wolf form have bare legs? And how much Nair do you go through in a month, anyway?\"\n She closed her eyes. \"I think I liked it better when you refused to see the truth.\"\n \"And what if we\u0027re making love and the moon comes up? I mean, I\u0027m an open-minded guy, but—\"\n \"Jared,\" she groaned, \"you\u0027re killing me. And you\u0027d better be teasing, because that\u0027s both ridiculous and disgusting. I can see I\u0027m going to have to get you some books.\"\n \"So, how strong are you? Can you lift a car up over your head?\"\n \"Jared . . .\"\n \"Not a serious car, like a Cadillac . . . how about a Volkswagen, could you lift a Volkswagen?\"\n \"Jared!\"\n \"Quick! Let\u0027s arm wrestle. Winner has to do all the dishes for life.\"\n She poked him in the shoulder, hard. \"I can\u0027t believe I yearned for the day you\u0027d accept the truth.\"\n \"Be careful what you wish for, bay-bee.\" His teasing grin faded and he looked at her anxiously.\n \"Can we have kids? I mean . . . can you . . . with a regular guy?\"\n \"Yes.\" And they\u0027ll be very special. You never knew what you got when a human mated with a werewolf. You might get a werewolf. You might get a human. You might get a human with extraordinary strength and agility. You might get a werewolf who could control their Change. It was always a toss of the dice. It was always exciting.\n \"What will they be?\" His gaze was curious, wondering. His fingers moved softly over her belly, as if already feeling for the life within. She could feel him against her thigh, already hard again, and hot. \n","sourceLink":"https://allnovel.net/jared-s-wolf-wyndham-werewolf-2/page-14.html","bookId":1883,"book":{"id":1883,"title":"Jared\u0027s Wolf (Wyndham Werewolf #2)","description":"Storyline: \n Jared\u0027s Wolf (Wyndham Werewolf #2) \n Jared Rocke will do anything avenge his sister\u0027s death, even believe in werewolves. What he doesn?t believe is that he\u0027s attracted to Moira Wolfbauer, the she-wolf sworn to protect her pack. In Jared\u0027s Wolf, two enemies must join forces to stop a killer while learning that love defies all boundaries--even those between species.\n \n","cover":"https://allnovel.net/images/jared-s-wolf-wyndham-werewolf-2.jpg","author":"MaryJanice Davidson","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/jared-s-wolf-wyndham-werewolf-2.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:55:52 PM"}}
