{"id":84010,"no":2,"title":"Page 2","content":"\\n\\n \"I\u0027m glad you asked,\" he said. Unfortunately, she\u0027d forgotten the question. \"That\u0027s a bad place. Do you work there? Do they force you? It doesn\u0027t matter. You don\u0027t have to go back, sweetie.\"\\n\\n \"Thanks, sweetie. \" Ugh. Had this oaf been sent to warn the Wyndhams about something? Alarm pierced the fog produced by the drug. \"Is Michael in danger? Or Jeannie?\"\\n\\n His face didn\u0027t change, but his lips went white. And his scent . . . it shifted so quickly it nearly burned her nostrils. Acrid smoke. The smell of danger, the smell of hate. \"How long have you known him?\" he asked slowly, pleasantly. \"Wyndham?\"\\n\\n Be careful, Moira. \"Forever,\" she said shortly. \"He\u0027s my boss.\" And a whole host of other things you\u0027ll never, never understand. \"And if he\u0027s in trouble, you\u0027ve got to tell me. And if you\u0027re bringing trouble to him or his, I\u0027ll kill you.\"\\n\\n \"God, you\u0027re beautiful,\" he said softly, which was not the usual response to a death threat. \"You should see how fierce you look. He\u0027s not worth that kind of loyalty. If you knew what he was . . .\"\\n\\n If you knew what I am . . . She was starting to get really, really angry. Oh, for a full moon right about now! It wasn\u0027t just the humiliation of being snatched practically from her front yard. It was that he was an ordinary man, nothing special at all, and he had made it look easy. \"Who are you?\" she practically snapped.\\n\\n \"The UPS guy. But we were talking about you, cutie.\"\\n\\n \"We were not.\" She felt like leaping from the bed and throttling the information out of him. \"And you haven\u0027t answered my question.\"\\n\\n \"Well,\" he said with maddening reason, \"you haven\u0027t, either.\"\\n\\n Like that, is it? Think you can outsmart me, monkey boy? We\u0027ll see.\\n\\n \"My jaw,\" she said, \"hurts like hell.\" She made her eyes go big; blinked pathetically. \"Why\u0027d you hit me?\\n\\n I wasn\u0027t doing anything.\"\\n\\n Monkey boy had the grace to look embarrassed. \"Sorry,\" he muttered. \"I didn\u0027t want you to raise the alarm. Besides, you don\u0027t want to be there, anyway, hon. It\u0027s a bad place. It\u0027s going to get a lot worse, too.\"\\n\\n Moira wasn\u0027t listening anymore. Her head was clearing, though her body still felt as limp as overcooked pasta. An alarming series of facts was ripping through her brain.\\n\\n Fact: this man managed to get on the grounds without anyone spotting him until he was on top of her.\\n\\n Fact: he knew how to fight.\\n\\n Fact: he had come armed.\\n\\n Fact: he had drugged her, taken her away, and no one knew, and no one had stopped him.\\n\\n Fact: he didn\u0027t like Michael.\\n\\n Fact: he seemed to like her.\\n\\n Fact: she had to stop this man.\\n\\n Fact: she couldn\u0027t do shit until she had her strength back.\\n\\n Fact: she couldn\u0027t let him leave until she had her strength back. More, she wouldn\u0027t leave, not until she better understood exactly what he represented for her pack.\\n\\n Conclusion? Nakedness was in her future. Possibly quite a lot of it. He was a man and she had, quite frankly, a nice rack. He\u0027d take one look at her tits and forget everything except his name. She\u0027d buy recovery time and pump him for all the information she could.\\n\\n It was annoying: she could count on one hand how many times she\u0027d gotten laid in the last two years; she was extremely selective. Or, as her friend Derik put it, \"weirdly frigid.\" Now she had to expend precious energy to seduce this human.\\n\\n Moira was not a promiscuous woman by any means . . . not, in fact, strictly a woman at all. A pack animal first and forever, everything she was, did, and said was shaped by that knowledge, that identity.\\n\\n When the leader was in danger, the pack was in danger.\\n\\n When the pack was in danger, she\u0027d do whatever it took.\\n\\n \"My head,\" she whispered, breath-soft.\\n\\n \"What?\" the idiot said, bending closer.\\n\\n Fighting the urge to shriek, \"Gotcha!\" , she put her mouth right near the cup of his ear and murmured,\\n\\n \"My head hurts soooooo much . . . may I please have a glass of water?\"\\n\\n \"Oh. Sure. I\u0027m sorry, I should have . . .\" Moron Boy moved away, and she couldn\u0027t help staring at the exceptional way his butt filled out the seat of his jeans. Yes indeedy, the world-class ass had a world-class ass. She wrenched her thoughts back on a more business-like track . . . then remembered his butt sort of was the business at hand, at least until her metabolism blasted the last of that hateful trank out of her system.\\n\\n The idiot came back with a glass of water, which she promptly spilled all over her blouse. \"Oh, it\u0027s cold!\"\\n\\n she squealed, inwardly groaning—Derik would be laughing his head off if he could see this—and outwardly shuddering as her nipples came to stiff attention. What\u0027s-his-face had been helping her sit up, and nearly dropped her back into the pillows. \"Do you have a shirt I can borrow?\" She fumbled at the buttons of her soaked blouse.\\n\\n Jared blinked, taking in Moira\u0027s smooth, pale skin as she stripped the wet fabric away. He wondered if she had a fever. He wondered if he had a fever. He knew who this little cookie was. He\u0027d taken her prints while she\u0027d been unconscious, scanned them into his laptop, and found out her name over an hour ago.\\n\\n Technology was swell.\\n\\n Moira Wolfbauer, place of residence: Wyndham Manor. Place of business: Wyndham Manor.\\n\\n Employer: Michael Wyndham. But she\u0027d tried her hand at social work just out of college, lucky for him, and thus her prints were on file. Mother deceased, father unknown. He\u0027d pretended to know none of this, of course, and began a gentle interrogation, and hadn\u0027t been pleased to hear how protective she was toward the Wyndhams.\\n\\n Obviously fond of the asshole, what was she up to? She\u0027d threatened to kill him, had assaulted him, and was pulling off her blouse and—yep, there went the bra—a frothy, lilac-colored concoction that exactly matched her eyes.\\n\\n All right.\\n\\n It would take more than a wet blouse to distract him.\\n\\n He was Jared Rocke and he would have his vengeance. He was Jared Rocke and she had the nicest rack he\u0027d ever seen, all creamy white skin with nipples the color of wild roses. He was Jared . . . uh . . .\\n\\n Rocke . . . and . . .\\n\\n \"Aren\u0027t you cold?\" he asked hoarsely.\\n\\n \"Extremely,\" she whispered, her hands on his shoulders, pulling him down, her mouth by his ear, her small white teeth sinking into his earlobe, and the sensation shot straight from his ear to his groin.\\n\\n He groped, seeking a blanket to cover her, and instead his hands found the delicious firmness of her breasts. She arched against him, her tongue in his ear, and his mouth found her throat. She wriggled delightfully, tugged at him, and then his shirt was sliding off his shoulders and floating to the floor.\\n\\n Her wriggling had been to good effect; she was nude, he was nude, their clothes a tumbled heap on the floor. Her soft skin made for an erotic contrast against the wool blankets, and for a moment all he could do was stare. Her violet eyes were huge, dominating her face, the arched golden brows above them making her look sweetly surprised. Her short hair was a delightful muss of tumbled blonde curls, curls so light they were almost silver, and her limbs were slim but strong-looking. Her nails were short, almost brutally so, and he had time for a quick, analytic thought: They\u0027re short because she bites them all the time. He wondered what a cookie this cute had to worry about. Men probably fell over themselves trying to take care of her.\\n\\n Then she opened her arms and he fell into her embrace, and that was the end of his analysis. For the first time in years, thoughts of vengeance fled his mind as he buried himself in her creamy softness.\\n\\n Moira braced herself for the oaf\u0027s full weight, but to her surprise he caught himself on his hands and came into her gently, almost carefully. His hand caressed her messy hair, and then his mouth came down on hers, his tongue skimming across her teeth and, when she obligingly parted her lips, probing her mouth. His taste overwhelmed her, all smoky masculine heat, and she gasped.\\n\\n She\u0027d never mated with someone who wasn\u0027t pack. This was partly out of self-imposed obligation to her mother and partly out of pure concern. She had always, in some part of her subconscious, worried about hurting an ordinary man. And really, wasn\u0027t that her problem? She had promised her mother she wouldn\u0027t mate into the pack . . . but couldn\u0027t bring herself to mate with an ordinary human. Now here she was, buying time, and he didn\u0027t seem so ordinary, this man, and his hands, what his hands were doing, that didn\u0027t seem all that ordinary eitherrrrrrrrrrr . . .\\n\\n \"Oh!\" Her hips bucked. He moved, kneeling beside her, and his thumb settled back atop her clitoris, his fingers spread and resting against her thighs, barely touching, almost not touching, but moving so slowly and delicately that she could almost . . . feel it . . . and it was driving her crazy. Meanwhile, he had reached for her breast, was pinching her nipple between his thumb and forefinger, hard enough to almost hurt. Between the throbbing of her nipple and the light, delicate, feathery touch between her legs, she was halfway to a climax. Ridiculous! He\u0027d been touching her for less than a minute. She wasn\u0027t a goddamned windup doll. She didn\u0027t even like him. She didn\u0027t even . . . she didn\u0027t . . . she . . . she felt a flood of heat between her legs and reached out.\\n\\n She found him, hard and hot and long, and squeezed, and his eyes tipped up and he stared blindly at the ceiling, the muscles in his neck standing out in rigid relief. He turned his hand and his thumb was now wiggling inside her.\\n\\n Moira reached for him again but he kept that maddening distance, almost as if he were afraid to be too close to her. She opened her eyes wide, and in the afternoon light had a postcard-perfect look at him, at the way the light bathed him, made him seem more tan than he was. She could see the muscles moving beneath his taut flesh and, reaching up, felt the tension in his abdomen. He was holding himself back, rigidly so, and she wondered why. She could smell his urgent lust and it kindled her own; she knew he wanted to shove her down and bury himself inside her until they were both screaming. So why did he hold back?\\n\\n More, she wondered how she could have gotten caught up so quickly in what had started out as a stalling technique, an act she had been prepared to dislike, or at least find dull. \\n\\n","sourceLink":"https://allnovel.net/jared-s-wolf-wyndham-werewolf-2/page-2.html","bookId":1883,"book":{"id":1883,"title":"Jared\u0027s Wolf (Wyndham Werewolf #2)","description":"Storyline: Jared\u0027s Wolf (Wyndham Werewolf #2) \\n Jared Rocke will do anything avenge his sister\u0027s death, even believe in werewolves. What he doesn?t believe is that he\u0027s attracted to Moira Wolfbauer, the she-wolf sworn to protect her pack. In Jared\u0027s Wolf, two enemies must join forces to stop a killer while learning that love defies all boundaries--even those between species.\\n","cover":"https://allnovel.net/images/jared-s-wolf-wyndham-werewolf-2.jpg","author":"MaryJanice Davidson","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/jared-s-wolf-wyndham-werewolf-2.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:55:52 PM"}}
