{"id":84448,"no":16,"title":"Page 16","content":"Kellan looked over from the couch apologetically, as I finished walking down the steps. \"Hey, sorry. We didn\u0027t mean to wake you.\" Matt looked over from the comfortable chair and smiled at me. I didn\u0027t see Evan anywhere. \"You didn\u0027t...bad dream.\" I shrugged my shoulders. He half-smiled at me. \"Beer?\" he asked, holding up his own a little. \"Sure.\" I didn\u0027t want to go back to sleep for awhile anyway. He left to get me one from the kitchen, while I stood awkwardly behind Matt in the chair. Griffin went back to flipping channels on the TV. Matt turned to watch as well. Kellan reappeared a minute later and handing me a beer, nodded over to the couch. I followed him. Griffin sat on the end of the couch, near the table, and set his beer down, frowning slightly. He didn\u0027t seem to be finding whatever he was looking for. I quickly passed Kellan and sat on the opposite side of the couch. Smiling at me and shaking his head, Kellan took the middle, sitting close to me, which made me grin. I scooted over to him and pressed against his side, pulling my feet up to the couch, my knees angled in, towards him. I had gotten so used to snuggling with him, that it was just a habit now. He smiled down at me, putting an arm around my thighs and nudging me playfully with his shoulder. I rested my head against it and smiled back. Still looking frustrated, Griffin said, \"You know, I\u0027ve been thinking.\" Matt groaned loudly and I laughed at him. Griffin ignored us both. \"When this band breaks up...\" I raised my head and my eyebrows at that and Kellan grinned at me. \"I think I\u0027ll do God-rock.\" Involuntarily, I spat back up the beer I had just taken a sip of. Luckily, most made it back in the bottle...the rest I started coughing on. Kellan smiled at me around his mouthful of beer and shaking his head at Griffin, rolled his eyes. Matt turned his spiky, blonde head to stare at Griffin incredulously. \"God-rock...you? Reeeally.\" Griffin smiled, still flipping through channels. \"Yeah! All those hot, horny virgins. Are you kidding me!\" He grinned devilishly while I continued choking on my beer. Finally, he smiled and stopped flipping through channels, apparently finding whatever it was he was looking for. I swallowed a few times and took a long draw of beer to soothe my throat. Griffin said the oddest things sometimes. He really was kind of perfect for Anna. Sighing at that thought, I looked over at the television and finally noticed what he had stopped on. It looked like porn...or some cable show that was close enough to it. I could feel my cheeks flushing and I stared down at my bottle. Matt and Griffin settled back to watch while Kellan looked over at me curiously. I tried to stay composed. If I got up and left, Griffin would have a field day the next time I saw him at the bar. If I just sat here and pretended to watch with them for awhile, he would probably just let it go. The noises from the TV weren\u0027t helping with my blush however. Really, why did guys watch this stuff? Why was Kellan watching me? Eventually, he leaned over and whispered in my ear, \"Are you uncomfortable?\" I shook my head no. I didn\u0027t want him thinking me any more prudish than he probably already did. In fact, if he could just ignore me and watch his smut, that would be great. I wondered how long I would need to sit here, until I could slip out unnoticed by the guys. Accepting my answer, Kellan leaned forward slightly, blocking my view of Griffin and Griffin\u0027s view of me. Grateful, I smiled and looked up at his face. He was intently watching the television set and I found the look on his face interesting. I had no desire to watch the movie, but watching Kellan watch it was fascinating. At first he simply watched, but after awhile his eyes started changing, started burning with an alluring intenseness. He took a sip of his beer and swallowed, his mouth lingering on the bottle for an extra few seconds. His lips parted slightly, his breath seemed to just fractionally increase. Still intently watching the screen, he brought his tongue slowly over his lower lip and then dragged his teeth even more slowly across them. The move was so distractingly sexy that a soft noise escaped my throat and my breath caught. The sound of the TV drowned me out, but Kellan, being so close to me, noticed. His smoldering blue eyes slid to mine. I could see why no woman resisted him with a gaze like that. I could feel my breath quicken in response. I couldn\u0027t imagine anyone telling that look no. Would I if he did anything? What was he thinking right now? I had no idea... His breath noticeably quickened in response to mine. Suddenly his gaze flicked down to my lips and I knew. I knew exactly what he was thinking. He shouldn\u0027t be thinking that. I shouldn\u0027t want him to think that. He touched his bottom lip with his tongue again and his gaze flicked back up to mine for a second. His eyes burned even deeper. He looked back down to my lips and started moving towards me. My heart raced. I knew I needed to push him back, I just couldn\u0027t think straight enough to remember why? I couldn\u0027t move. I closed my eyes as I felt him draw even nearer. I was hyperaware of how close his body was to mine - his side pressing against me, his arm still across my thighs, his hand upon my leg. That knowledge, and the passionate noises from the TV, sent chills down my spine. After what felt like an eternity, he finally touched me, but not how I had been expecting him to. His forehead touched mine and he rested his nose against mine. I could feel him breathing softly, but intensely, against me. Instinctually, I raised my chin to find his lips, a low noise escaping my throat again. A micro-second before our mouths fully touched, when I could feel the heat of his skin, the barest brush of a lip, he glided his nose down along my cheek. I gasped at the close, but no-contact. He exhaled heavily down my throat, an enticing noise escaping his lips, making me shudder. He stayed there, taking two ragged breaths, while I unconsciously melted even more against his body, my knees turning even more into him, the hand on my lap dropping onto his thigh. I started to turn my head back towards his mouth. He smelled so good... Suddenly he grabbed my hand on his thigh and almost painfully squeezed it. He ran his lips up to my ear and whispered roughly, \"Come with me.\" Not sure what he was going to do, not sure what I was going to do, I stood and followed him out of the room. Matt and Griffin, who I had forgotten were even here, didn\u0027t look our way as we passed by. Surprisingly, he led me to the kitchen. I wasn\u0027t sure what he would do when we got there. I pictured him, once out of view of the guys, pulling me into him for a long, hot passionate kiss. I pictured his hands tangling in my hair, pulling me tight to him. I pictured his entire body pressed against mine. By the time we were in the kitchen, I was breathing a little raggedly. Kellan, however...was perfectly fine. He let go of my hand as we got to the kitchen and poured a glass of water, setting his beer down on the counter. Confused, and a little annoyed at his quick change of emotion, I wondered if I had just imagined that little almost-incident in the living room. It had seemed like there was this electricity between us. He had been about to kiss me, I was pretty sure of that. Disturbingly enough, I had been about to kiss him as well. It was...confusing. He smiled warmly, like nothing weird had just happened. Handing me the glass of water, he took my beer and set it on the counter near his. I took a deep breath, calming my body, as I suddenly felt very, very stupid. Of course nothing had almost happened. He was a regular guy, who got turned on watching some stupid, sexy movie, like any guy would, and I had somehow turned that into him wanting me specifically. God, I must have looked like such an idiot with my eyes closed, waiting for him to kiss me. Embarrassment flashed through me and I gulped down my water, thankful for a reason to not look at him. I peered back up when he spoke. \"Sorry about the movie choice...\" He smiled and laughed a little. \"Griffin is, well...Griffin.\" He shrugged. Completely changing the subject, he said, \"You seemed upset earlier on the stairs. You want to talk about your dream?\" He leaned back against the counter near the fridge, crossing his arms against his chest, looking perfectly composed and relaxed. Still feeling foolish, I muttered, \"I don\u0027t remember it...just that it was bad.\" \"Oh,\" he said quietly, suddenly looking thoughtful. Wishing I had just stayed in bed, I set down my nearly empty glass and started to walk past him. \"I\u0027m tired...good night, Kellan.\" He smiled at me as I walked past. \"Good night, Kiera,\" he nearly whispered. Avoiding watching Matt, Griffin or the seemingly endless erotic movie they were watching, I instead looked back through the living room to the rear window in the kitchen. There was enough reflection in the glass for me to clearly see Kellan, still leaning against the counter, but now he was slumped against it, pinching the bridge of his nose with his fingers. He looked to have a headache. I wondered about that, but hurried up the stairs, not wanting him to notice me in the reflection watching him. And I really wanted to shut out the noise of that stupid, stupid movie. I blushed slightly when I saw him the next morning, but he only smiled and offered me a cup of coffee. He made no mention of my embarrassing gaffe and I wasn\u0027t about to bring it up. Sitting across from him at the table, I noticed that he was wearing his Douchebags shirt again. I frowned over at him and he paled slightly. \"What?\" he asked quietly, looking a little nervous. Not understanding his reaction, I pointed to his shirt. \"You never did get me one, you know,\" I said, as lightly as I could manage. He visibly relaxed. \"Oh...you\u0027re right.\" He nodded at me. Then he shrugged and standing up, slipped the shirt off. I openly gaped at him as he flipped it right side out and slipped it over me. I couldn\u0027t even speak. His body drew all of my attention as he fixed the shirt around me. I couldn\u0027t even help him. He had to put my arms through the holes like I was two. \"There. You can have mine.\" He smiled warmly, still standing in front of me, not bothered in the slightest that he was now half-dressed. My face was heating up and I was pretty sure I was blushing deeply. \"I didn\u0027t mean...you didn\u0027t have to...\" I couldn\u0027t even form a complete sentence. He laughed softly. \"Don\u0027t worry about it. I can get more. You wouldn\u0027t believe how many of those damn things Griffin made.\" He laughed again then turned to leave the room. I couldn\u0027t help but gape at his muscular back as he left, the broad muscular shoulders narrowing slightly at his chest then more at the waist, naturally forcing the eye line down. He looked back at the entryway and caught me staring at him. He looked down and half-smiled. \"I\u0027ll be right back.\" He looked back up at me, still smiling adorably and I blushed deeply, yet again. Then the smell caught me. I actually closed my eyes it was so powerfully wonderful. I grabbed the bottom of the shirt and inhaled deeply. I don\u0027t know if it was his soap, his expensive shampoo, his laundry detergent, some cologne or just his natural scent, but he always smelled so incredibly good and now I was saturated in his smell. I was sitting there, inhaling his shirt like an idiot when he came back into the room. He cocked his head to the side and smiled at me curiously, as I blushed deeply again and dropped his shirt. I suddenly wished I had never woken up this morning. How many ways could I look like an idiot in twenty-four hours? He sat back down in his chair and finished his coffee, his shirt now a striking blue that made his eyes seem even more intensely blue. I swallowed and concentrated on drinking my coffee. We went about our day normally. I did laundry, he did the dishes. I vacuumed, he played his guitar. But I felt embarrassed all day. Last night had been mortifying. I was planning on staying far away from him. I was planning that, but, of course, when he went to watch TV for a little bit before leaving to meet with the guys, I looked at the couch longingly. He noticed and held his arm out, patting the cushion beside his hip with his other hand. I couldn\u0027t help it. I smiled and instantly cuddled into his side, resting my head on his shoulder. I was kind of addicted to it. The weekend went by with plenty of handholding, cuddling on the couch, lingering hugs in the kitchen, resting on his lap, and lying in the backyard, but no more embarrassing near-kiss incidents. Before I knew it, it was Monday morning, and school was starting the very next day. A phone call that afternoon incited my irritation...and my nerves.","sourceLink":"https://allnovel.net/thoughtless-thoughtless-1/page-16.html","bookId":1887,"book":{"id":1887,"title":"Thoughtless (Thoughtless #1)","description":"Storyline: Thoughtless (Thoughtless #1) For almost two years now, Kiera\u0027s boyfriend, Denny, has been everything she\u0027s ever wanted: loving, tender and endlessly devoted to her. When they head off to a new city to start their lives together, Denny at his dream job and Kiera at a top-notch university, everything seems perfect. Then an unforeseen obligation forces the happy couple apart. Feeling lonely, confused, and in need of comfort, Kiera turns to an unexpected source—a local rock star named Kellan Kyle. At first, he\u0027s purely a friend that she can lean on, but as her loneliness grows, so does their relationship. And then one night everything changes...and none of them will ever be the same.","cover":"https://allnovel.net/images/thoughtless-thoughtless-1.jpg","author":"S.C. Stephens","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/thoughtless-thoughtless-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:58:24 PM"}}
