{"id":84472,"no":40,"title":"Page 40","content":"He looked at me quizzically. \"What? Why?\" I swallowed my embarrassment at asking him that, and as calmly as I could manage, said, \"Well, you asked about Denny and me. It\u0027s only fair.\" He smiled and looked down at the sheets. \"I guess I did, didn\u0027t I.\" He looked back up at me. \"Sorry about that...that really wasn\u0027t any of my business.\" I smiled back. \"Just answer the question.\" I was so glad he had used that line on me now, since I was getting so much use out of it. He laughed and thought for a moment. I raised my eyebrow; he had to think about it? He laughed again at my expression. \"Well...she was a girl from the neighborhood, sixteen, I think...very pretty. She seemed to like me...\" He smiled and shrugged. \"It was just a couple times one summer.\" \"Oh...why, what happened?\" I asked quietly. He brought his hand up, to run his fingers through my hair. \"I got her pregnant and she had to move in with her Aunt to have the baby.\" I flipped over on my side to face him. \"What!\" He laughed and touched his finger to my nose. \"I\u0027m just kidding, Kiera.\" I pushed him back on the pillows and grunted at him. \"That\u0027s not nice.\" He sat back up on his elbow. \"You bought it though. You must think the worst of me.\" He sighed softly and looked sad for half a second. \"I\u0027m not a monster, Kiera.\" His tone was serious. I propped myself up on an elbow as well. \"You\u0027re no angel either, Kyle.\" I smiled at him wryly, which made his smile return. \"So, what really did happen to the girl?\" \"Nothing so dramatic. She went to her school, I went to mine.\" He shrugged. \"Different paths...\" I looked at him, confused. \"I thought you said she was a neighbor. Why were you in different schools?\" He looked at me blankly. \"We weren\u0027t in the same grade.\" I tried to comprehend what that meant. \"But, she was sixteen...how old were you?\" He looked at me oddly. \"Not sixteen...\" he whispered. \"But...\" \"You should get some sleep, Kiera...it\u0027s late.\" I could literally hear the door closing on that conversation. I was still trying to figure out the math in my head. If he wasn\u0027t in high school with her, then that put him at the very oldest, fourteen. It hurt my heart a little. I brought a hand out from the covers and held his with it, and his warm smile eventually returned. We both settled back on the pillows and he reached out for me, pulling me to his chest. I sighed with contentment as I listened to his steady, slow heartbeat. He really was fine with this, maybe it wasn\u0027t such a bad idea after all. He brought both arms around me, one hand stroking my hair, the other rubbing my back. It felt warm and nice. I smiled and nestled more into his chest. I felt him kiss the top of my head. Well, I guess that was okay, relatively safe...still pretty innocent. I ran my fingers along where he had been hurt on his side, and then lightly trailed them up his chest. Even with his shirt on, I could feel the lines of his defined muscles. I could also feel his heartbeat increase and he sighed softly as he pulled me tighter to him. I pushed up to look at him; his face was still serene, and he was watching me adoringly. \"Kellan, maybe we shouldn\u0027t...\" \"I\u0027m fine, Kiera...get some sleep,\" he whispered, still smiling softly. I lay back down, but nestled into his shoulder, instead of his chest. I grabbed the hand that had been stroking my back and laced my fingers through his, then brought our entwined hands up to my cheek and laid my head on them. He sighed happily and kissed my head again. \"Kellan...?\" \"Really, I\u0027m fine, Kiera...\" I looked up at his face. \"No, I was just wondering...why do you want to do this with me? I mean, you know it\u0027s not going anywhere...why waste your time?\" He shifted to look at me better. \"No time with you is wasted, Kiera.\" His voice was soft, the way he said my name, like a caress. \"If this is all...\" He smiled sadly and left it at that. I couldn\u0027t stop gazing at his achingly perfect face. I started remembering every touch, every word... If this is all he had with me, then he would take it. Is that what he meant? It broke my heart. He had wondered if he was hurting me...was I hurting him? Did he just want me, or did he care for me? I released our hands and reached up to stroke his cheek. He looked so sad. I hated it when he looked so sad... He suddenly leaned over and kissed the very corner of my mouth, barely brushing my bottom lip. He left his head there and breathed lightly down my neck. I was too shocked to react; my thumb was still stroking his cheek. I held my breath. He lowered his lips to my jaw and kissed me softly, then he kissed under my jaw. His hand slipped under the covers and moved to my waist, pulling me closer to him. His breathing increased, as he made a noise in his throat and trailed his lips down my neck. His hand clenched and unclenched my skin and he stopped kissing my throat, pulling back to rest his forehead against mine. His breaths were shallow, his face looked torn; this was clearly against my rules. \"Kiera...?\" He struggled for control. The look on his face, the lingering feeling of his lips on my skin, froze me. He was giving me a chance, right now, but all I could stare at were his eyes, quickly filling with passion, his lips coming closer to mine. His gaze flicked to my eyes, my lips, then back to my eyes. He was so torn, I was mesmerized by it. My hand still on his cheek moved over, so I could run my fingers across his amazingly soft, partially opened lips. He made a noise and closed his eyes, his breath shallow and fast. I left my fingers there across his lips and he pressed our lips together, my fingers in-between, like we were kissing, without actually kissing. We were going way beyond innocent now. I needed to end this. I needed to get up and go to my room. This was a horrible idea... I couldn\u0027t move though. My breath sped up in response to his. He kissed my fingers softly, his eyes still closed, his breath intense. Just a few more seconds couldn\u0027t hurt anything, I convinced myself. We weren\u0027t really doing anything that wrong. His hand from my waist came up to my wrist. He started to pull my fingers down from his lips. \"I want to feel you...\" He got them partway down, and fully pressed against my upper lip. That\u0027s when I woke up. I pushed him as far away from me as possible and scrambled out of the bed. He sat up, breathless, and I was startled to realize I was breathless as well. \"Kiera, I\u0027m so sorry. I won\u0027t...\" He swallowed a couple times to try and control his breathing. \"No, Kellan...this was a really bad idea. I\u0027m going to go to my room.\" I pointed at him. \"Alone.\" He started to get up. \"Wait...I\u0027m fine, just give me a minute. It will pass...\" I put both arms up. \"No...please stay here. I can\u0027t...I can\u0027t do this. That was too close, Kellan. This is too hard.\" I backed up to the door. \"Wait, Kiera...I\u0027ll do better. Don\u0027t...don\u0027t end this...\" His eyes were instantly so sad, that I paused. \"I need to be alone tonight. We\u0027ll talk tomorrow, okay?\" He nodded and said nothing further, so I turned and left. Mentally I berated myself. What did I think was going to happen? That was a really stupid idea...this whole thing is a bad idea. As nice as it might feel, it\u0027s not fair to all three of us. I stared at my ceiling for most of the night, wondering what he was thinking about, what he was doing, if he was sleeping, if I could just crawl back into bed with him, if I should... When I did fall asleep, I dreamed about him in vivid, glorious detail. In my dream, I did not get out of his bed. In my dream, we did very little actual sleeping. He knocked on my door early the next morning and opened it when I answered him. He walked into my room and sat on the edge of the bed. He was in different clothes, dressed and perfect for the day already. \"Mornin\u0027,\" he said quietly. \"Are you still mad at me?\" \"No...\" Having him on my bed was too much. The memory of last night, and my vivid dream, still had me weak in the knees. \"You shouldn\u0027t be in here, Kellan. It\u0027s disrespectful to Denny.\" He chuckled and looked away. \"You think, of all the things we\u0027ve done together, that me sitting on his bed is what he would find the most offensive?\" He looked back to me as I glared icily at him. \"Sorry...okay.\" He backed off with his hands held up and stopped in the doorway. \"Better?\" I sat up on the bed, feeling stupid. He was right of course, but still... \"Yes, thank you.\" He sighed and I looked up at him, still standing in the doorway. \"I can\u0027t talk to you from here,\" he quietly said, holding his hand out for me. Sighing, I walked over and took it. He smiled and led me downstairs. On the way, he spoke softly. \"I am sorry about last night. You were right, that wasn\u0027t a good idea. I did try though.\" He looked over at me hopefully, like he should get a reward for at least trying. I sighed again as I looked over at him. \"This isn\u0027t a game, Kellan,\" I said quietly. He stopped on the bottom step and turned to face me on the step above. \"I know that, Kiera.\" His tone and look were more serious. I laced my arms around his neck and he relaxed. \"Then don\u0027t take it that far again.\" I wasn\u0027t ready for this to end either. \"Innocent, remember.\" He smiled and lifted me down to the bottom of the stairs, to stand beside him. \"Innocent, right. I can do that.\" Still smiling, he grabbed my hand and led me to the kitchen. Mentally I sighed, this wasn\u0027t a good plan. I was being an idiot. Chapter 14 Tipping Point We decided to spend our free Saturday together taking an Amtrak up north. I\u0027d never been on a train before and it made me a little nervous at first, until Kellan held my hand. Then I relaxed against him in the seat and we watched the world speed by with the rocking motion of the train. It was an amazing view, what with the snow-capped mountains in the distance and the greenness of the seemingly abundant Evergreens whizzing by. I loved it here. I\u0027d only been here a few months, but I already loved this State. We got out at a small touristy town and walked around the city hand in hand. Without the fear of someone we knew watching us, we were much closer, and a lot less careful than we usually were with each other. We stopped often to look out over the river surging beside us or to look into a quaint shop as we walked by it, and he would hold me tight against his chest. I would turn into him and delight in his warmth and tenderness. Something changed between us (again) after last night in his bed. I wasn\u0027t sure what it was exactly, just that our gazes were longer, and our touches were, while he was careful to not break any more of my rules, a little more intimate. Lines were starting to blur. It bothered me. It excited me. Eventually, we made our way back down south so I could go to work. I sighed as Seattle came back into view. It had been so freeing to be with him openly, with no fear of being caught. I had enjoyed our little outing...and I knew it probably wouldn\u0027t happen again for a long time. I looked up at his face as he gazed out the window. He had a slight frown on his full lips and I wondered if he was thinking the same thing that I was. I watched the sunlight bounce off his eyes, altering the deep blue color into a lighter shade. I smiled at how amazingly beautiful his eyes were. He looked down at me then and smiled in return. The urge to kiss him overcame me, and I had to look straight ahead and close my eyes. \"You okay?\" he asked softly. \"Motion sickness...it will pass. I just need a minute.\" I wasn\u0027t sure why I lied to him. He would have understood if I told him the truth. Well, honestly he would have understood too much, and I wasn\u0027t positive that after last night, he wouldn\u0027t press his advantage instead of giving me space. And at the moment, I just needed a little space. I had to keep my eyes closed until the train completely stopped. Honestly, it was just ridiculous how attracted to him I was. Once we were situated, he drove me straight to Pete\u0027s. He stayed at the bar with me until the D-Bags arrived, and they started their set. Kellan had been right about his previous night\u0027s \"performance\" - the place was buzzing, and I was flitting from person to person all night long. By the end of the night, I was exhausted. I got a ride home with Jenny, instead of Kellan, which I think with the frown he gave me when I told him, may have hurt his feelings a little. But Denny would be home, and even though he\u0027d probably be sleeping, I didn\u0027t want Kellan and me to arrive home together. After our amazing weekend, I felt like it would be a neon sign of what had passed between us, and I couldn\u0027t risk that. I hoped Kellan wasn\u0027t too hurt.","sourceLink":"https://allnovel.net/thoughtless-thoughtless-1/page-40.html","bookId":1887,"book":{"id":1887,"title":"Thoughtless (Thoughtless #1)","description":"Storyline: Thoughtless (Thoughtless #1) For almost two years now, Kiera\u0027s boyfriend, Denny, has been everything she\u0027s ever wanted: loving, tender and endlessly devoted to her. When they head off to a new city to start their lives together, Denny at his dream job and Kiera at a top-notch university, everything seems perfect. Then an unforeseen obligation forces the happy couple apart. Feeling lonely, confused, and in need of comfort, Kiera turns to an unexpected source—a local rock star named Kellan Kyle. At first, he\u0027s purely a friend that she can lean on, but as her loneliness grows, so does their relationship. And then one night everything changes...and none of them will ever be the same.","cover":"https://allnovel.net/images/thoughtless-thoughtless-1.jpg","author":"S.C. Stephens","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/thoughtless-thoughtless-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:58:24 PM"}}
