{"id":84500,"no":68,"title":"Page 68","content":"Breathless, I gaped at him. \"What happened to your...rules?\" \"I never was good at following rules.\" He smiled and moved in to kiss me. \"And I never could say no to your begging anyway...\" he finished softly, kissing my neck. He slipped off his jeans and kissed me again. \"Wait...\" I pushed him back again. \"I thought you didn\u0027t want to do this...\" I looked over at the door, \"here.\" He slid his hand into my underwear and I gasped. \"If I\u0027m yours and you\u0027re mine...then I will take you, wherever and whenever I can,\" he growled in my ear, his intensity making me moan lightly. \"I love you, Kellan,\" I whispered, bringing his face back to mine. \"I love you, Kiera. I will make you so happy,\" he whispered seriously. I bit my lip and started pulling off his boxers. \"Yes, I know you will.\" Chapter 23 Consequences I shifted on his bed for the hundredth time. Kellan\u0027s arm was around me and he was sleeping soundly, his cheek resting on his other arm, his face turned towards me, all doubt and worry erased from his perfect features. I wasn\u0027t quite so sure it was erased from mine. I\u0027d finally chosen, and in the heat of the moment, I\u0027d chosen Kellan. It all still felt a little surreal to me. I snuggled into Kellan\u0027s side and he sighed contently. I tried to imagine being with him like this every night, having the open relationship with him that he wanted - that we wanted. It had been such a taboo idea for so long, that I couldn\u0027t quite envision it at the moment. I shifted again on the bed. There was one final hurdle to tackle before I could really picture going forward with Kellan...and it was one that was tearing my heart apart. Denny. I should get up now and sneak back into our room. I shouldn\u0027t risk him finding out this way. I shouldn\u0027t have risked making love to Kellan last night...again. I just, I seem to not always have the best judgment when it came to that amazing man. But Kellan was right, it was a bad idea. Denny should never catch the two of us being intimate like that. I remembered his reaction in my dream. I couldn\u0027t even begin to imagine his real reaction if he walked in on us. Especially now that he knew I lied, now that he was suspicious. I should tell him. I should finally tell him...everything. I just had no idea how. Sighing, I lifted Kellan\u0027s arm off of me. He mumbled something in his sleep and started to reach out for me again. I smiled and brushing a lock of hair off his forehead, kissed him softly. I grabbed my hastily flung clothes and slipped them back on, then I opened his door and with a final glance at his peaceful body, his sheet half-heartedly draped over his physical perfection, I shut it and headed back to my room. I slipped into my bed as stealthily as I could. Denny didn\u0027t stir when I carefully lay down next to him, and I didn\u0027t look at him this time. I kept my back to him and carefully breathed in and out. I waited for him to move, for him to roll me over and demand where I\u0027d been. He didn\u0027t. He slept as soundly as Kellan had been. Eventually exhaustion took me and I gave in to the slumber, intimate thoughts of Kellan on my mind. I awoke a short while later from a particularly good dream, anxious to see him again. Denny was still sleeping, but I was positive Kellan would not be. I quickly darted to the bathroom to freshen up, and then quietly dashed downstairs. As predicted, Kellan was leaning against the counter, a fresh pot of coffee brewing behind him, smiling over at me and looking completely perfect, dressed in my favorite bright blue shirt that made his eyes seem inhumanly blue. \"Morn-\" He didn\u0027t get a chance to finish his greeting before my lips were locked on his and my hands were twisted in that fabulous hair. He returned my kiss eagerly, his hands cupping my cheeks. Between our lips, I muttered, \"I missed you.\" \"I missed you too,\" he muttered back. \"I hated waking up with you gone.\" You would think we hadn\u0027t seen each other in days, instead of hours. I luxuriated in the smell of him, the feel of him, the taste of him. I reveled in his warmth, in his tender hands traveling down my shoulders, in the feel of his hair between my fingertips, and his tongue brushing against mine. I never wanted him to stop kissing me. That was when he suddenly pulled away from me, taking a few steps towards the table. \"We should talk about Denny, Kiera...\" Just then, Denny walked into the kitchen. \"What about me?\" he asked curtly. Kellan and I were luckily a few paces apart when Denny had unexpectedly appeared in the entryway, but my heart shifted instantly into triple time. Kellan was more composed, and smoothly said, \"I was just asking Kiera if you would be interested in hangin\u0027 with me and the guys today. There\u0027s this thing at EMP-\" Denny cut him off while I gaped at him. Did he just come up with that on the fly, or was that really his plan for today? \"No, we\u0027ll stay here.\" I didn\u0027t miss his inflection on the word \"we\u0027ll\" and neither did Kellan. His face paler, he said, \"Okay...come by if you change your mind. We\u0027ll be there all day.\" An odd tension built up in the kitchen and Kellan finally broke the silence. \"I\u0027d better go...pick up the guys.\" And with a final meaningful glance at me behind Denny\u0027s back, he left the two of us alone, in the suddenly too quiet kitchen. A few moments later, I heard the door close and Kellan\u0027s car growl to life and drive away. And just like that, he was gone and my heart dropped a little. By his final look, I knew he was giving me time to \"talk\" to Denny, and I wasn\u0027t ready yet. I wasn\u0027t even sure if I could do it. I mean, how do you tear someone to pieces that you still care for? And I do...even throughout everything, I still loved him. Love doesn\u0027t exactly come with an off switch. I spent the bulk of the afternoon laying on the couch, sleeping...or pretending to, while Denny watched over me from the chair, the TV playing in the background purely a distraction for the overwhelming silence between us. I wasn\u0027t ready to destroy him yet. I wasn\u0027t sure if I would ever be ready for that. I didn\u0027t know how to tell someone who had been everything to me for so long, that it was over. I could feel his dark eyes resting on me all day...thinking. Denny was brilliant, the only reason he hadn\u0027t put it all together yet was pure devotion to me. He refused to see my flaws and he hated to cause me pain. Acknowledging my betrayal, would force him to do both. He may have been avoiding the words, but I saw it in his eyes - the fear, the doubt. I knew that eventually he would gather the courage to ask me that dreaded question: Are you in love with someone else? Every look he gave me, every time he touched me, every conversation he did start with me, I was sure he was going to ask me. Ask me if I was leaving him. Ask me if I was in love with Kellan. I tensed in anticipation every time. I didn\u0027t know what I would say if he did ask. But the questions never came... He never once asked me about the lie he had caught me in last night. He never once asked me for the real reason for the awful slap I had given Kellan. On the few instances we did speak that horridly long afternoon, he seemed to be purposefully avoiding any topic of conversation that might bring up Kellan. By the end of the day, his expression was darker, his mood introspective. Eventually all conversation dried up, and I began avoiding his dark accusatory glances. Kellan did eventually come back, late, hours after the sun set on our chilly little home. He walked into the kitchen and saw Denny and I finishing a silent dinner. Kellan glanced over to me, probably wondering if I had talked to him at all. I could only shake my head nearly imperceptibly, no. He understood. His face was torn, and I thought he might turn around and leave again, but calming himself, he put his keys on the counter and grabbed a beer from the fridge. His disheartened eyes haunted me though and I couldn\u0027t help but to stare at him, even though I knew Denny was intently watching me. I so wanted to go over to him and explain, but I knew I couldn\u0027t. His eyes not leaving mine, Denny spoke over to Kellan, \"Hey, mate. I think we should all go out. How about The Shack? We could go dancing again?\" His accent inflected oddly on the word dancing. My heart jumped. Why would he want to go back there? I forced my eyes back to my plate. I could hear Kellan shifting uncomfortably. \"Yeah... sure,\" he said quietly. My heart started to race and I kept my head down, concentrating on my food and my breathing. This was not good...not good at all. Kellan turned and took his beer to his room. Denny and I finished our awkward meal in silence, his eyes never straying far from mine. Finishing before him, I mumbled something about getting ready and stumbled my way upstairs to prepare for a night that I felt would be as equally horrific as the last time we had all gone there together. Kellan\u0027s door was closed as I passed it and I briefly wondered if I should pop in and explain why I had chickened out in talking to Denny today. I couldn\u0027t though. I wasn\u0027t ready for that conversation either. I sighed and went to the bathroom to rearrange my hair, redo my makeup - anything to stop my mind from spinning. Finally in the car ride over, Denny broke his hours long silence. \"Have you decided what you want to do for winter break?\" he asked, an oddly flat tone in his accented voice. He looked over to me and his expression softened for the first time all day, moisture glistening in his eyes. \"I\u0027d really like to take you home with me...over the holidays. Will you think about it, Kiera?\" His voice wavered a bit on my name. I clearly heard the real question he was asking me: Will you choose me? I could only nod at him, moisture stinging my own eyes as well. I turned to look out the window at the city flying by me. That was how my insides felt, that I was flying towards something, and it was too late to stop it. Denny and I beat Kellan there. He seemed to be delaying the inevitable weirdness, I wished I could. Denny pulled us straight through the bar, to the doors leading to the beer garden in back. I noticed a sign on the door as he opened it, \"Winter fest - beat the chill\". Apparently we were celebrating the iciness in the air. Even though the weather was really too chilly to just sit around and drink beer, there were a lot of people outside and Denny led me to the same table as the last fateful time we were here. I had no idea if he did that deliberately or not. My eyes flicked back to the gate, back to the espresso stand. Did he know about that night? I tried to force my stomach to stop turning. He ordered drinks for the three of us and we sipped our beers in silence, Denny looking thoughtful. My breath inadvertently caught when Kellan walked out of the bar. I hadn\u0027t meant for it to happen. I prayed Denny didn\u0027t see it happen. He was just so...breathtaking. He walked smoothly to our table, his eyes oddly at peace. He even smiled over at Denny while he took a seat by me. My heart sped a little, part nerves, part from his nearness. The bar was busy, the music coming from speakers all around the beer garden loud, and several people were out on the make-shift dance floor having a good time in the approaching-frigid air. I hoped Denny wasn\u0027t serious about the dancing, I didn\u0027t think I could fake that right now, the way my heart and stomach were flopping around. I watched the drunken people warming their bodies with physical movement, while I started to shiver a bit from the cold. Again I wondered why Denny sat us out here, and not inside the warm bar. I put my cold hands in my lap, resisting the instinct to reach under the table and grab Kellan\u0027s. I don\u0027t know how long we sat there in silence, Kellan and I watching the crowd, but studiously ignoring each other, Denny watching me intently, but eventually, Denny\u0027s work phone rang. Startled, I looked over at him while he smoothly picked it up. He spoke a few sentences then closed it. Sighing, he looked over to me. \"I\u0027m sorry. They need me to come in.\" Looking over me to Kellan, he said, \"Can you take her home? I have to go.\" Kellan simply nodded and Denny stood to leave. I was too shocked by the turn of events to speak properly. Denny leaned down to me. \"Will you think about what I asked?\" he said quietly. I mumbled an okay and grabbing my cheeks in both hands, he kissed me so deeply that I groaned and instinctively brought my hands up to his neck. My heart raced and I was slightly breathless as he pulled away. Kellan shifted noisily in his chair and for a second, I had a horrifying image of Kellan starting something with him. He cleared his throat and shifted in his chair again as Denny said goodbye to both of us and turning, left the bar. I watched him leave, my heart still racing. His beautiful face turned once at the door, to give me a final glance goodbye. He nodded a little and smiled fractionally when he saw me still watching him, and then he entered the bar to leave out the front doors.","sourceLink":"https://allnovel.net/thoughtless-thoughtless-1/page-68.html","bookId":1887,"book":{"id":1887,"title":"Thoughtless (Thoughtless #1)","description":"Storyline: Thoughtless (Thoughtless #1) For almost two years now, Kiera\u0027s boyfriend, Denny, has been everything she\u0027s ever wanted: loving, tender and endlessly devoted to her. When they head off to a new city to start their lives together, Denny at his dream job and Kiera at a top-notch university, everything seems perfect. Then an unforeseen obligation forces the happy couple apart. Feeling lonely, confused, and in need of comfort, Kiera turns to an unexpected source—a local rock star named Kellan Kyle. At first, he\u0027s purely a friend that she can lean on, but as her loneliness grows, so does their relationship. And then one night everything changes...and none of them will ever be the same.","cover":"https://allnovel.net/images/thoughtless-thoughtless-1.jpg","author":"S.C. Stephens","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/thoughtless-thoughtless-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:58:24 PM"}}
