{"id":40589,"no":17,"title":"CHAPTER XV. DEAD.","content":"It was a magnificent, sunshiny morning when the great paddle-wheel steamer of the Pacific Mail Steamship Company raised its anchor and started forth on its twenty-three days\u0027 journey to San Francisco. As it rounded the point it passed almost within a stone\u0027s throw of the inward-bound French mail-boat from Hong-Kong. Mme. Van der Beck, who, lying back in a deck chair, had been gazing languidly at the French vessel through a pair of opera-glasses, suddenly raised herself in her chair, and, uttering a piercing shriek, fell back in a dead faint. Quickly turning his gaze in the direction of the passing ship Frederick was able, even without the assistance of the glasses, to recognize in one of the passengers on the hurricane deck Nina\u0027s husband, Mr. Van der Beck. \n \n A moment later the French vessel rounded into the bay and passed out of sight, while the American mail steamer proceeded out to sea. Nina was borne down to her cabin, and a long time elapsed before she could be restored to consciousness. From that time forth she sank day by day. The glimpse which she had caught of her bitterly wronged husband had proved a final and crushing blow, and although her love for Frederick never wavered, yet it was easy to perceive that her heart was filled with remorse at the fatal step which she had taken in eloping with him from Batavia. \n \n One evening some ten days after their departure from Japan, Mme. Van der Beck, who was feeling more oppressed and restless than usual, insisted on being carried up [Pg 142] on deck, where she was laid on a cane lounge and propped up with cushions. \n \n The night was a beautiful one. The dark-blue waters of the Pacific were so calm and still that they reflected the myriads of stars, and the full moon shed its soft, silvery light on the track of foam made by the vessel in its rapid progress. \n \n Nina at first lay perfectly still looking up at the sky, and now and again gently stroking Frederick\u0027s hand, which she had taken in both her own. The young man, who was sitting on a camp-stool close at her side, looked unusually sad and listless, and from time to time his eyes scanned her colorless face as it rested on the white pillows, with an expression of mingled remorse and sorrow. He knew that her days were numbered, and for once in his life he was on the verge of regretting what he had done. After all, this poor woman\u0027s only crime had been that she had loved him too well. She had always tried her very best to render him happy, and he had, in return, brought on her nothing but sorrow and death. \n \n Suddenly Nina raised herself slightly and said in a low, exhausted voice: \n \n “My darling, I have been very happy with you. But you must not grieve! It is best so! It is best so!” \n \n This was the first time that she had ever alluded to the possibility of her death; and Frederick, greatly shocked, exclaimed: \n \n “Why, what do you mean, dear? What are you talking about? I don\u0027t understand you.” \n \n “Oh! yes, you do! You know well that I am dying! You love me so much that you do not like to think of the possibility thereof. But I feel sure that it is better for us to talk about it now that the time of separation is so near at hand. I shall never reach America. I feel it; and I want to arrange everything for you before I go!” \n \n [Pg 143] \n \n “Nonsense, Nina! Don\u0027t talk in that way, my dear girl! I cannot spare you. This voyage was all that was wanted to set you up. You are only suffering from langour and weakness. In a few days you will be yourself again.” \n \n She shook her head gently, and turning her face toward him replied, while tears welled up in her large, soft eyes and glittered like diamonds in the moonlight. \n \n “I have only one wish, Frederick. I want you to return to—to—my husband—all that I have taken from him. My own fortune and my jewels you must keep. They are yours. I have written a kind of last will or testament this afternoon, leaving to you all I have. But it has long been a subject of bitter remorse to me that I should have taken away one penny of what belonged to him. Will you promise me, dear, to fulfil my last wishes in this matter?” \n \n “Why, of course—certainly; anything you please, my dear girl. But for my sake stop talking of so terrible a possibility as your leaving me. I cannot bear it.” \n \n Raising her small, emaciated hand to his lips he kissed it tenderly. As he lifted his eyes once more to her face he was startled by the change he saw there. Her thin and delicate features had become drawn and haggard, and her eyes were dull as if a film had gathered over them. \n \n He started up alarmed. He was not himself that night and he felt ashamed of the softness which had crept unawares into his head. He bent over the dying woman and moistened her parched lips with a few drops of brandy and water. She looked up at him somewhat revived and murmured wistfully: \n \n “Take me in your arms, darling. I shall die easier so.” \n \n He knelt down beside her and gently drew her head onto his shoulder. For a few minutes there was perfect silence. Then, suddenly, Nina threw her arms around his neck, gasping: \n \n [Pg 144] \n \n “Don\u0027t let me die! Hold me closer, Frederick! Keep me here.” \n \n She clung to him in terror for a second. Then a spasm shook her from head to foot, and relaxing her hold, she sank back on her pillow. \n \n Nina Van der Beck was dead, and one more life was added to the number of Frederick von Waldberg\u0027s victims. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1822/52893.html","bookId":1025,"book":{"id":1025,"title":"A servant of Satan","description":"简介： Prado was a wonderful fellow, said Chief Inspector Byrnes, of the New York police, recently, and for criminal ingenuity and devilishness stands without a peer. I question whether cupidity lay at the foundation of his diabolical work, inclining to the...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1822","creation":"Aug 1, 2019 12:24:09 AM","modification":"Aug 1, 2019 12:24:09 AM"}}
