{"id":112066,"no":42,"title":"Page 42","content":"Michael\u0027s earlier disorientation worsened as they drove back home. The roads which they\u0027d followed earlier looked even more unfamiliar when he tried to navigate his way back again. The journey was made more difficult by the fact that he kept glancing back in the rear view mirror to check that Emma was still following. He felt surprisingly uncomfortable without her in the seat next to him. He had come to rely on having her around much more than he\u0027d realised. He still felt like he hardly knew her, but the truth of the matter was that he had shared more pain, despair and raw emotion with her than with any other person in the twenty-nine years of his life so far. He threw the Landrover around a sharp bend in the road and then slammed on the brakes to avoid the back end of a milk float which was jutting out into the road, the front of the float having smashed into a low stone wall. He missed it by inches, and the closeness of a collision shocked him back into concentrating on safely returning to the farm house. Another quick glance in the mirror revealed that Emma was still close behind. The winding road gradually opened out and became straighter. In the near distance he could see a row of three isolated grey cottages. From one of the buildings (it seemed to be the middle one) a single figure emerged and staggered into the middle of the road. It stopped and turned to face him. \u0027Fucking hell,\u0027 Michael said under his breath to himself as he stared at the pathetic body in front of him. \u0027Just look at that stupid fucking thing.\u0027 He pushed his foot down harder on the accelerator, the Landrover quickly gaining more and more speed. At that precise moment Michael focussed all his pent up anger, fears and frustrations on that one pitiful creature. For a few seconds he felt that destroying it would somehow make amends for the loss of just about everything and anything that had ever mattered to him. As Michael raced ahead the distance between the two cars increased. Concerned and confused and certain that something was wrong, Emma accelerated to try and keep up with him. The body in the middle of the road lifted its tired arms into the air above its head and began to wave Michael down. \u0027Jesus Christ,\u0027 he muttered. It took a full few seconds for the true importance of what he was seeing to sink in, and by that time he was almost upon the body. It was moving with more direction, purpose and intent than he\u0027d seen from any of the corpses before. Instinctively he slammed his foot down on the brake and brought the Landrover to a sudden juddering halt. He knew before he\u0027d stopped that it was a survivor that stood in the road ahead of him. Even from a few meters away he could tell from the expression on the man\u0027s face and by the way he carried himself and reacted that he was still alive. \u0027Thank God,\u0027 the diminutive man gasped as he approached Michael. He looked up as Emma stopped the car a short distance behind the Landrover. \u0027Thank God,\u0027 he said again, \u0027you\u0027re the first people I\u0027ve seen in weeks...\u0027 \u0027Are you all right?\u0027 Emma asked. She was already out of her car and walking towards the man. \u0027I\u0027m okay,\u0027 he replied quickly, chattering like a nervous child. \u0027I\u0027m better now I\u0027ve seen you two. I thought I was the only one left around here. I was going to...\u0027 \u0027What\u0027s your name?\u0027 Michael asked abruptly, cutting across him. \u0027Philip, Philip Evans,\u0027 he answered. \u0027And where do you live?\u0027 The little man gestured towards his house. \u0027Here,\u0027 he said, simply. \u0027Then let\u0027s get inside,\u0027 Michael suggested. \u0027It\u0027s not a good idea for us to be standing out here like this.\u0027 Philip obediently turned and led the others back towards his cottage. Emma looked him up and down as she followed him indoors. He was short and shabbily dressed. A noticeable stoop made him appear much shorter than he actually was and his grubby clothes were worn and had obviously not been cleaned or even changed for several days, maybe a week. His tired face was ruddy, pockmarked and unshaven and his hair greasy, ruffled and unkempt. Philip itched and scratched at himself continually. They stepped through the low front door and found that inside the house was as vile, odious and squalid as its owner. Dark, dank and musty, it was the perfect breeding ground for countless deadly germs and diseases. Michael immediately wanted to turn around and leave but he knew that he couldn\u0027t. No matter what his first impressions of Philip Evans were he was a survivor and, as such, he felt duty bound to try and do something for him. He was the first survivor they had seen since they\u0027d left the city. More to the point, he was the first survivor they\u0027d found since that first night in the community centre back in Northwich. \u0027Sit down,\u0027 Philip said as he closed the door behind them and ushered them both into the living room. \u0027Please sit down and make yourselves comfortable.\u0027 Emma glanced down at the sofa next to her and decided to remain standing. It was covered with crumpled food wrappers, crumbs and other, less easily identifiable rubbish. \u0027Can I get you a drink?\u0027 he asked politely. \u0027I\u0027m sorry, I\u0027m just so surprised to see you both. When I heard the noise of your engines I thought that...\u0027 His words faded in volume as he disappeared into the kitchen to fetch drinks (despite neither of the survivors having taken him up on his offer). Glad to be alone for a moment, Michael seized the opportunity to speak privately to Emma. \u0027So what do you think?\u0027 he whispered. \u0027About what?\u0027 she replied. \u0027About him,\u0027 he hissed. \u0027What do you think we should do?\u0027 She thought for a moment. She knew what she had to say but didn\u0027t particularly want to say it. \u0027He\u0027s a survivor and we should offer to take him with us,\u0027 she said with obvious reluctance. \u0027But...?\u0027 he pressed, sensing that she wasn\u0027t telling him everything. \u0027But look at the state of this place,\u0027 she continued, gesturing at their cold and stale surroundings. \u0027Christ, this house is disgusting. It\u0027s making me feel sick just standing here, and by the look of him he\u0027s bound to be contagious, isn\u0027t he?\u0027 \u0027We don\u0027t know that for certain, do we?\u0027 Michael argued despite the fact that he agreed with her completely. \u0027We\u0027ve got to try and do something for him, haven\u0027t we?\u0027 She nodded dejectedly and then changed the sour expression on her face as Philip returned to the room, still talking. \u0027...and after that when we couldn\u0027t find him we decided that something was definitely wrong,\u0027 he babbled, his voice tired. The little man paused and stood still to cough. It was a violent, hacking noise, like a smoker\u0027s rasping early morning cough, and he struggled to catch his breath. \u0027You all right?\u0027 Michael asked. Philip looked up and nodded, his face flushed and red. \u0027Fine,\u0027 he wheezed. \u0027Just picked up a bit of an infection I think.\u0027 He carried a circular metal tray which he put down on the table after brushing a layer of rubbish down onto the dirty carpet with a single sweep of his arm. He handed Emma a chipped mug and then passed one to Michael. Emma peered into her cup and sniffed it. It was undiluted lemon cordial. She glanced across at Michael who discreetly shook his head and gestured for her to put the mug down. \u0027Do you know what\u0027s happened?\u0027 Philip asked. \u0027Haven\u0027t got a clue,\u0027 Michael replied. \u0027I searched the village but I couldn\u0027t find anyone else alive. I can\u0027t drive so I haven\u0027t been able to get into town. I\u0027ve just been stuck here waiting for someone to come,\u0027 he stopped talking for a second and looked at Michael again. \u0027Are you two from town? Are there many of you there?\u0027 Emma answered. \u0027We came here from Northwich just over a week ago,\u0027 she replied. \u0027And there are just the two of us now. We left a few people there but other than that we hadn\u0027t seen anyone until we found you.\u0027 Philip sank down into an armchair with an expression of bitter disappointment on his face. \u0027That\u0027s not good news,\u0027 he muttered. \u0027I\u0027ve been stuck here waiting and I haven\u0027t been able to do anything. My telephone\u0027s not working and the electricity\u0027s been cut off and...\u0027 \u0027Philip,\u0027 Michael interrupted, \u0027just listen to me for a minute. Whatever happened here has happened right across the country as far as we know. Just about everyone is dead...\u0027 \u0027I\u0027ve seen some people,\u0027 the little man whittered, not listening, \u0027but they\u0027re not right. They come when they hear me, but they\u0027re sick. They bang on the door for hours trying to get inside but I just lock it and sit in the back room until they go.\u0027 \u0027We think you should come with us,\u0027 Michael continued. \u0027We\u0027re living in a farm house a few miles from here and we both think it would be better for you if you were to...\u0027 Philip still wasn\u0027t listening. \u0027Do you know what makes them act like that? I really don\u0027t like it. Mother\u0027s not well and it upsets her when I tell her that...\u0027 \u0027Your mother\u0027s here as well?\u0027 Emma asked. \u0027Of course she is,\u0027 he replied. \u0027She can come with us,\u0027 Michael offered. \u0027We should get your things together and get out of here as quickly as we can.\u0027 \u0027She won\u0027t like leaving,\u0027 Philip mumbled, \u0027she\u0027s lived here since she and Dad got married.\u0027 \u0027Maybe you\u0027ll be able to come back,\u0027 Emma said, sensing that Michael was keen to get moving and doing her best to sensitively persuade Philip to leave. Philip thought for a moment and then nodded. \u0027You\u0027re right,\u0027 he finally said. \u0027It\u0027s probably for the best if we all stick together. I\u0027ll go and tell Mum.\u0027 With that he turned and walked towards a door in the corner of the room. Beyond the door was a narrow, twisting staircase which he began to climb. Emma instinctively followed but Michael stopped her. \u0027What\u0027s the matter?\u0027 she asked. \u0027Let me go first.\u0027 Philip was already at the top of the stairs waiting breathlessly. As Michael approached he lifted a single finger to his chapped lips. \u0027Be quiet please,\u0027 he whispered. \u0027Mum\u0027s found all of this a little hard to deal with and I don\u0027t want to frighten her. She\u0027s very old and she\u0027s not been well these last few months.\u0027 Michael nodded and managed a half-smile despite the fact that the air at the top of the stairs was rancid and he could clearly hear the ominous humming of germ-carrying flies close nearby. Philip pushed the door open slightly and stuck his head into his mother\u0027s room. He stopped and turned back to face the other two. \u0027Give me a minute with her, will you?\u0027 he asked. He disappeared into the room and pushed the door shut behind him but Michael followed immediately. Philip didn\u0027t notice. \u0027Mum,\u0027 he said softly as he crouched down at the side of the bed. \u0027Mum, there are some people here who can help us. We\u0027re going to go back with them for a few days until things settle down again.\u0027 Michael stood a short distance behind Philip. Emma cautiously entered the room and walked over to stand next to him. He leant down and grabbed hold of her arm. With tension and fear obvious in his voice he hissed at her to quickly go back downstairs. \u0027Why?\u0027 she quietly asked. She took a single step forward to get a better view of Philip\u0027s mother and then covered her mouth with horror and disgust. Mrs Evans\u0027 skin was discoloured and decayed, her hair lank and greasy. Flies buzzed around her decomposing flesh and were feeding on her constantly writhing body. Michael walked up to the bed and pulled back the soiled sheets which covered the old lady. Ignoring Philip\u0027s protestations he stared down at her emaciated body. She was tied to the bed with strong ropes which were stretched tight across her stained night-dress. She\u0027d been dead since the first morning. \u0027I had to tie her down,\u0027 Philip stammered anxiously. \u0027She wouldn\u0027t stay in bed. When the doctor saw her last he said she had to stay in bed until she was better...\u0027 \u0027Philip,\u0027 he sighed, \u0027your mum\u0027s dead.\u0027 \u0027Don\u0027t be stupid,\u0027 the little man scoffed, laughing with disbelief. \u0027How can she be dead? She\u0027s not well, that\u0027s all. Bloody hell, how can she be dead you daft bugger?\u0027 \u0027This has happened to millions of people, Philip,\u0027 Emma said, fighting to keep control of her nerves and her stomach. \u0027I know it sounds crazy, but most of the people who...\u0027 \u0027Dead people can\u0027t move,\u0027 he shouted, resting his hand on his mother\u0027s shoulder. \u0027How can she be dead if she\u0027s moving? Answer me that?\u0027 \u0027Living people don\u0027t rot,\u0027 Michael replied. \u0027Now your choice is simple, either come with us now and leave her here, or you both stay.\u0027 \u0027I can\u0027t go without Mum,\u0027 he wailed. \u0027I can\u0027t leave her here on her own, can I?\u0027 Michael took hold of Emma\u0027s arm and gently pushed her back towards the stairs. \u0027Wait for me by the front door,\u0027 he said quickly. \u0027I\u0027ll be down in a couple of seconds.\u0027 He turned back to try and reason with Philip. \u0027Come on, just accept it will you?\u0027 he began. \u0027Your mother is dead. She might still be moving, but she\u0027s as good as dead. She\u0027s the same as those other people you\u0027ve seen outside.\u0027 Emma listened anxiously as she crept back down the stairs. She waited on the bottom step for Michael. \u0027What are you going to do if you stay here?\u0027 he continued. \u0027You probably haven\u0027t got much food or drink and your health is suffering. We\u0027re your best chance, Philip. Get your stuff together and come with us.\u0027 \u0027Not without Mum. I can\u0027t leave without her.\u0027 Michael shook his head dejectedly. \u0027No,\u0027 he said simply. Without any warning something inside Philip snapped. In a fraction of a second the meek little man became an uncontrolled animal. His fears and frustrations bottled up since the nightmare had begun, he suddenly exploded with fury and savage emotion, lunging at Michael and sending him flying across the bedroom. Surprised by the force and the violence of the unexpected attack, Michael lost his balance and tripped backwards through the doorway. With Philip desperately holding onto him, the two men tumbled down the stairs and came to rest in a heap at Emma\u0027s feet. \u0027Get back to the car!\u0027 Michael yelled as he struggled to hold the other man down. \u0027Get the fucking engine started!\u0027 Despite having the speed and intentions of a man possessed, Philip was weak and slight of stature and it didn\u0027t take much effort on Michael\u0027s part to overpower him. He wrenched him around and grasped his scrawny neck in a dangerously tight headlock. He dragged Philip towards the front door of the cottage, ignoring his pitiful, wheezing cries. There were three bodies in the road between the car and the van. Emma ran past them and climbed into the car and started the engine. The corpses - joined by more from the shadows nearby - began to crowd around her. She struggled to see between them and waited anxiously for Michael to appear. More bodies were reacting to the sounds of the struggle inside the building and were heading towards the cottage. Emma accelerated, hoping that the sound of the car\u0027s engine would distract them and give Michael and Philip a chance to get out. A couple of stumbling figures turned around awkwardly and staggered towards the car. An equal number continued to move closer to the house. Michael looked up and saw that there were corpses in the doorway. Philip, sensing that he had been distracted momentarily, managed to squirm free. He took a few steps away from Michael and wiped tears from his eyes, oblivious to the danger of the approaching cadavers. \u0027Why can\u0027t I bring her with me?\u0027 he pleaded, still refusing to accept the bitter truth. Michael grabbed hold of his arm to pull him out of the house but he recoiled and managed to twist himself free again. A body reached out and grabbed hold of Philip\u0027s shoulders. Another caught hold of one of his legs. Terrified, he began to kick and scream. \u0027Get them off me!\u0027 he yelled. \u0027Please, get them off!\u0027 Michael tore the creatures away from him and pushed them back out into the street. He looked up and saw that there were about twenty figures around Emma\u0027s car and he could see her panicked face staring back at him through the glass. He knew that he had to make a choice and he had to make it immediately. Keep trying to persuade Philip to leave without his mother or just leave without either of them. He glanced back at the pathetic shell of a man who stood in the middle of his living room, whimpering and snivelling. The decision was made. Michael ran out through the doorway, pushing bodies to the side, and pausing only to pull the door shut behind him hoping to give Philip something of a chance. He fought his way through the ragged crowd and climbed into the Landrover and started the engine. From where he sat all that he could see was a mass of grotesque, decaying faces staring back at him. He gave a couple of short blasts on the horn and, when Emma did the same in reply, he pushed down on the accelerator and moved away. The decomposing bodies offered hardly any resistance. He watched in the mirror until he was sure that Emma was following and then put his foot down.","sourceLink":"https://allnovel.net/autumn-autumn-1/page-42.html","bookId":2557,"book":{"id":2557,"title":"Autumn (Autumn #1)","description":"Storyline: Autumn (Autumn #1) A bastard hybrid of War of the Worlds and Night of the Living Dead, Autumn chronicles the struggle of a small group of survivors forced to contend with a world torn apart by a deadly disease. After 99% of the population of the planet is killed in less than 24 hours, for the very few who have managed to stay alive, things are about to get much worse. Animated by \"phase two\" of some unknown contagion, the dead begin to rise. At first slow, blind, dumb and lumbering, quickly the bodies regain their most basic senses and abilities... sight, hearing, locomotion... As well as the instinct toward aggression and violence. Held back only by the restraints of their rapidly decomposing flesh, the dead seem to have only one single goal - to lumber forth and destroy the sole remaining attraction in the silent, lifeless world: those who have survived the plague, who now find themselves outnumbered 1,000,000 to 1... Without ever using the \u0027Z\u0027 word, Autumn offers a new perspective on the traditional zombie story. There\u0027s no flesh eating, no fast-moving corpses, no gore for gore\u0027s sake. Combining the atmosphere and tone of George Romero\u0027s classic living dead films with the attitude and awareness of 28 Days (and Weeks) later, this horrifying and suspenseful novel is filled with relentless cold, dark fear.","cover":"https://allnovel.net/images/autumn-autumn-1.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/autumn-autumn-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:48:44 AM"}}
