{"id":112072,"no":48,"title":"Page 48","content":"Michael Collins\n We drove for hours, only stopping once in all that time to siphon more fuel from a crashed car on a deserted stretch of road.\n We gave up for the night when I couldn\u0027t keep awake to drive any longer. We\u0027d been following a twisting road which led along one exposed edge of a high mountain valley when I spotted an empty car park. Emma didn\u0027t want to drive. We decided to rest.\n I parked the car, stopped the engine and got out. A stupid thing to do, perhaps, but it didn\u0027t seem to matter anymore. If any bodies were near by (and I couldn\u0027t see any) then what could they do to us? What could they take from us? We had nothing and we could lock ourselves into the Landrover if we needed to.\n We were in a beautiful place, and for a short time nothing seemed to matter. The moon was high and proud in the sky and the night was still. Across the valley a steep, jagged mountain-face climbed away from us. It was as remote and inhospitable a place as we could have hoped to find.\n \u0027You all right?\u0027 Emma asked as she walked round to stand next to me. I nodded and instinctively pulled her close. The warmth of her body was comforting.\n \u0027Want to keep going?\u0027 she asked me suddenly.\n \u0027Don\u0027t know,\u0027 I answered truthfully. \u0027Do you?\u0027\n She shrugged her shoulders.\n \u0027Is there any point?\u0027\n \u0027There\u0027s got to be somewhere we can go,\u0027 I said. \u0027Somewhere they can\u0027t get to. Another Penn Farm...\u0027\n I looked down into her face and stopped talking. She was half-smiling, and her expression seemed to be telling me that although she really did want to believe me, she didn\u0027t. Tears of pain and frustration began to roll down her delicate cheeks from her tired eyes.\n In silence we clambered into the back of the Landrover together and lay there on the floor, holding each other tightly.\n \u0027We\u0027ll be okay,\u0027 I heard myself say.\n She smiled briefly and then buried her head in my chest.\n We had nothing left to lose but our lives. We lay there in the darkness and waited for morning. \n","sourceLink":"https://allnovel.net/autumn-autumn-1/page-48.html","bookId":2557,"book":{"id":2557,"title":"Autumn (Autumn #1)","description":"Storyline: \n Autumn (Autumn #1) \n A bastard hybrid of War of the Worlds and Night of the Living Dead, Autumn chronicles the struggle of a small group of survivors forced to contend with a world torn apart by a deadly disease. After 99% of the population of the planet is killed in less than 24 hours, for the very few who have managed to stay alive, things are about to get much worse. Animated by \"phase two\" of some unknown contagion, the dead begin to rise. At first slow, blind, dumb and lumbering, quickly the bodies regain their most basic senses and abilities... sight, hearing, locomotion... As well as the instinct toward aggression and violence. Held back only by the restraints of their rapidly decomposing flesh, the dead seem to have only one single goal - to lumber forth and destroy the sole remaining attraction in the silent, lifeless world: those who have survived the plague, who now find themselves outnumbered 1,000,000 to 1... \n Without ever using the \u0027Z\u0027 word, Autumn offers a new perspective on the traditional zombie story. There\u0027s no flesh eating, no fast-moving corpses, no gore for gore\u0027s sake. Combining the atmosphere and tone of George Romero\u0027s classic living dead films with the attitude and awareness of 28 Days (and Weeks) later, this horrifying and suspenseful novel is filled with relentless cold, dark fear.\n \n","cover":"https://allnovel.net/images/autumn-autumn-1.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/autumn-autumn-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:48:44 AM"}}
