{"id":112032,"no":6,"title":"Page 6","content":"Michael Collins was the last to arrive at the hall but the first to get his head together. More than his head, perhaps, it was his stomach that forced him into action. Just before midday, after a long, slow and painful morning, he decided it was time to eat. In the main storeroom he found tables, chairs and a collection of camping equipment labelled up as belonging to the 4th Whitchurch Scout Group. In a large metal chest he found two gas burners and, next to the chest itself, four half-full gas bottles. In minutes he\u0027d set the burners up on a table and was keeping himself busy by heating up a catering-size can of vegetable soup and a similar sized can of baked beans which he\u0027d found. Obviously left over from camps held in the summer just gone, the food was an unexpected and welcome discovery. More than that, preparing the food was a distraction. Something to take his mind off what had happened outside the flimsy walls of the Whitchurch Community Hall. The rest of the survivors sat in silence in the main hall. Some lay flat on the cold brown linoleum floor while others sat on chairs with their heads held in their hands. No-one spoke. Other than Michael no-one moved. No-one even dared to make eye contact with anyone else. Twenty-six people who may as well have been in twenty-six different rooms. Twenty-six people who couldn\u0027t believe what had happened to the world around them and who couldn\u0027t bear to think about what might happen next. In the last day each one of them had experienced more pain, confusion and loss than they would normally have expected to suffer in their entire lifetime. What made these emotions even more unbearable today, however, was the complete lack of explanation. The lack of reason. Coupled with that was the fact that everything had happened so suddenly and without warning. And now that it had happened, there was no-one they could look to for answers. Each cold, lonely and frightened person knew as little as the cold, lonely and frightened person next to them. Michael sensed that he was being watched. Out of the corner of his eye he could see that a girl sitting nearby was staring at him. She was rocking on a blue plastic chair and watching him intently. It made him feel uncomfortable. Much as he wanted someone to break the silence and talk to him, deep down he didn\u0027t really want to say anything. He had a million questions to ask, but he didn\u0027t know where to start and it seemed that the most sensible option was to stay silent. The girl got up out of her chair and tentatively walked towards him. She stood there for a moment, about a metre and a half away, before taking a final step closer and clearing her throat. \u0027I\u0027m Emma,\u0027 she said quietly, \u0027Emma Mitchell.\u0027 He looked up, managed half a smile, and then looked down again. \u0027Is there anything I can do?\u0027 she asked. \u0027Do you want any help?\u0027 Michael shook his head and stared into the soup he was stirring. He watched the chunks of vegetable spinning around and wished that she\u0027d go away. He didn\u0027t want to talk. He didn\u0027t want to start a conversation because a conversation would inevitably lead to talking about what had happened to the rest of the world outside and at that moment in time that was the last thing he wanted to think about. Problem was, it was all that he could think about. \u0027Shall I try and find some mugs?\u0027 Emma mumbled. She was damn sure that he was going to talk. He was the only person in the room who had done anything all morning and her logic and reason dictated that he was the person it would be most worth starting a conversation with. Emma found the silence and the lack of communication stifling, so much so that a short while ago she\u0027d almost got up and left the hall. Sensing that she wasn\u0027t going to go away, Michael looked up again. \u0027I found some mugs in the stores,\u0027 he muttered. \u0027Thanks anyway.\u0027 \u0027No problem,\u0027 she replied. After another few seconds of silence, Michael spoke again. \u0027I\u0027m Michael,\u0027 he said. \u0027Look, I\u0027m sorry but...\u0027 He stopped speaking because he didn\u0027t really know what it was he trying to say. Emma understood, nodded dejectedly and was about to turn and walk away. The thought of the stunted conversation ending before it had really started was enough to force Michael to make an effort. He began trying to think of things to say that would keep her at the table with him. It was involuntary at first, but within seconds he\u0027d realised that he really didn\u0027t want her to go. \u0027I\u0027m sorry,\u0027 he said again. \u0027It\u0027s just with everything that\u0027s... I mean I don\u0027t know why I...\u0027 \u0027I hate soup,\u0027 Emma grunted, deliberately interrupting and steering the conversation into safer, neutral waters. \u0027Especially vegetable. Christ, I can\u0027t stand bloody vegetable soup.\u0027 \u0027Nor me,\u0027 Michael admitted. \u0027Hope someone likes it though. There\u0027s four tins of it in there.\u0027 As quickly as it had began the brief dialogue ended. There just wasn\u0027t anything to say. Small talk seemed unnecessary and inappropriate. Neither of them wanted to talk about what had happened but both knew that they couldn\u0027t avoid it. Emma took a deep breath and tried again. \u0027Were you far from here when it...\u0027 Michael shook his head. \u0027A couple of miles. I spent most of yesterday wandering around. I\u0027ve been all over town but my house is only twenty minutes walk away.\u0027 He stirred the soup again and then felt obliged to ask her the same question back. \u0027My place is just the other side of the park.\u0027 She replied. \u0027I spent yesterday in bed.\u0027 \u0027In bed?\u0027 She nodded and leant against the nearest wall. \u0027Didn\u0027t seem to be much else to do. I just put my head under the covers and pretended that nothing had happened. Until I heard the music, that was.\u0027 \u0027Bloody masterstroke playing that music.\u0027 Michael ladled a generous serving of beans into a dish and handed it to Emma. She picked up a plastic spoon from the table and poked at the hot food for a couple of seconds before tentatively tasting a mouthful. She didn\u0027t want to eat but she was starving. She hadn\u0027t even thought about food since her aborted shopping trip yesterday morning. A couple of the other survivors were looking their way. Michael didn\u0027t know whether it was the food that was attracting their attention or the fact that he and Emma were talking. Before she\u0027d come across he\u0027d said less than twenty words all morning. It seemed that the two of them communicating had acted like a release valve of sorts. As he watched more and more of the shell-like survivors began to show signs of life. Half an hour later and the food had been eaten. There were now two or three conversations taking place around the hall. Small groups of survivors huddled together while others remained alone. Some people talked (and the relief on their faces was obvious) while others cried. The sound of sobbing could clearly be heard over the muted discussions. Emma and Michael had stayed together. They had talked sporadically and had learnt a little about each other. Michael had learnt that Emma was a medical student and Emma learnt that Michael worked with computers. Michael, she discovered, lived alone. His parents had recently moved to Edinburgh with his two younger brothers. She had told him that she\u0027d chosen to study in Northwich and that her family lived in a small village on the east coast. Neither of them could bring themselves to talk much about their families in any detail as neither knew if the people they loved were still alive. \u0027What did this?\u0027 Michael asked. He\u0027d tried to ask the question a couple of times before but hadn\u0027t quite managed to force the words out. He knew that Emma couldn\u0027t answer, but it helped just to have asked. She shrugged her shoulders. \u0027Don\u0027t know, some kind of virus perhaps?\u0027 \u0027But how could it have killed so many people? And so quickly?\u0027 \u0027Don\u0027t know,\u0027 she said again. \u0027Christ, I watched thirty kids die in just a couple of minutes, how on earth could anything...\u0027 She was staring at him. He stopped talking. \u0027Sorry,\u0027 he mumbled. \u0027It\u0027s okay,\u0027 she sighed. Another awkward, pregnant pause followed. \u0027You warm enough?\u0027 Michael eventually asked. Emma nodded. \u0027I\u0027m okay.\u0027 \u0027I\u0027m freezing. I tell you there are holes in the walls of this place. I stood in one corner this morning and I could push the bloody walls apart! It wouldn\u0027t take much to bring this place down.\u0027 \u0027That\u0027s reassuring, thanks.\u0027 Michael shut up quickly, regretting his clumsy words. The last thing anyone wanted to hear was how vulnerable they were in the hall. Shabby, ramshackle and draughty it might be, but today it was all they had. There were countless stronger and safer buildings outside, but no-one wanted to take a single step outside the front door for fear of what they might find there. Michael watched as Stuart Jeffries and another man (whose name he thought was Carl) sat in deep conversation in the far corner of the room with a third figure who was hidden from view by Jeffries\u0027 back. Jeffries had been the first one to arrive at the hall, and he\u0027d made a point of telling everyone who\u0027d arrived subsequently that he\u0027d been the one who had found their shelter as if they should be grateful. In a world where position and stature now counted for nothing, he seemed to be clinging on desperately to his self-perceived \u0027status\u0027. Perhaps it made him feel important. Perhaps it made him feel like he had a reason to survive. The conversation in the corner continued and Michael began to watch intently. He could sense that frustrations were beginning to boil to the surface by the increasing volume of the voices. Less than five minutes earlier they had been mumbling quietly and privately. Now every survivor could hear every word of what was being said. \u0027No way, I\u0027m not going outside,\u0027 Jeffries snapped, his voice strained and tired. \u0027What\u0027s the point? What\u0027s outside?\u0027 The man hidden in the shadows replied. \u0027So what else should we do then? How long can we stay here? It\u0027s cold and uncomfortable in here. We\u0027ve got no food and no supplies and we\u0027ve got to go out if we\u0027re going to survive. Besides, we need to know what\u0027s happening out there. For all we know we could be shut away in here with help just around the corner...\u0027 \u0027We\u0027re not going to get any help,\u0027 Jeffries argued. \u0027How do you know?\u0027 Carl asked. His voice was calm but there was obvious irritation and frustration in his tone. \u0027How the hell do you know there\u0027s no-one to help us? We won\u0027t know until we get out there.\u0027 \u0027I\u0027m not going out.\u0027 \u0027Yes, we\u0027ve already established that,\u0027 the hidden man sighed. \u0027You\u0027re going to stay in here until you fucking starve to death...\u0027 \u0027Don\u0027t get smart,\u0027 Jeffries spat. \u0027Don\u0027t get fucking smart with me.\u0027 Michael sensed that the friction in the corner might be about to turn into violence. He didn\u0027t know whether to get involved or just stay out of the way. \u0027I know what you\u0027re saying, Stuart,\u0027 Carl said cautiously, \u0027but we need to do something. We can\u0027t just sit here and wait indefinitely.\u0027 Jeffries looked as if he was trying desperately to think of something to say. Maybe he was having trouble trying to reason the argument. How could you apply any logic and order to such a bleak and inexplicable situation? Unable to find the words to express how he was feeling he began to cry, and the fact that he was unable to contain his emotions seemed to make him even angrier. He wiped away his tears with the back of his hand, hoping that the others hadn\u0027t noticed, but knowing full well that everyone had. \u0027I just don\u0027t want to go out there,\u0027 he cried, finally being honest and forcing his words out between gasps and sobs. \u0027I just don\u0027t want to see it all again. I want to stay here.\u0027 With that he got up and left the room, shoving his chair back across the floor. It clattered against the radiator and the sudden noise caused everyone to look up. Seconds later the ominous silence was shattered again as the toilet door slammed shut. Carl looked at the man in the corner for a second before shrugging his shoulders and getting up and walking away in the opposite direction. \u0027The whole bloody world is falling apart,\u0027 Michael said under his breath as he watched. \u0027What do you mean falling apart?\u0027 Emma asked quietly. \u0027It\u0027s already happened, mate. There\u0027s nothing left. This is it.\u0027 He looked up and around at his cold grey surroundings and glanced at each one of the empty shells of people scattered about the place. She was right. She was painfully right.","sourceLink":"https://allnovel.net/autumn-autumn-1/page-6.html","bookId":2557,"book":{"id":2557,"title":"Autumn (Autumn #1)","description":"Storyline: Autumn (Autumn #1) A bastard hybrid of War of the Worlds and Night of the Living Dead, Autumn chronicles the struggle of a small group of survivors forced to contend with a world torn apart by a deadly disease. After 99% of the population of the planet is killed in less than 24 hours, for the very few who have managed to stay alive, things are about to get much worse. Animated by \"phase two\" of some unknown contagion, the dead begin to rise. At first slow, blind, dumb and lumbering, quickly the bodies regain their most basic senses and abilities... sight, hearing, locomotion... As well as the instinct toward aggression and violence. Held back only by the restraints of their rapidly decomposing flesh, the dead seem to have only one single goal - to lumber forth and destroy the sole remaining attraction in the silent, lifeless world: those who have survived the plague, who now find themselves outnumbered 1,000,000 to 1... Without ever using the \u0027Z\u0027 word, Autumn offers a new perspective on the traditional zombie story. There\u0027s no flesh eating, no fast-moving corpses, no gore for gore\u0027s sake. Combining the atmosphere and tone of George Romero\u0027s classic living dead films with the attitude and awareness of 28 Days (and Weeks) later, this horrifying and suspenseful novel is filled with relentless cold, dark fear.","cover":"https://allnovel.net/images/autumn-autumn-1.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/autumn-autumn-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:48:44 AM"}}
