{"id":10363,"no":192,"title":"CHAPTER 192","content":"“Piss on wildfire and your cock burns off,” old seamen liked to say. Still, Ser Imry had warned them to expect a taste of the alchemists’ vile substance. Fortunately, there were few true pyromancers left. They will soon run out, Ser Imry had assured them. Davos reeled off commands; one bank of oars pushed off while the other backed water, and the galley came about. Lady Marya had won clear too, and a good thing; the fire was spreading over Queen Alysanne and her foes faster than he would have believed possible. Men wreathed in green flame leapt into the water, shrieking like nothing human. on the walls of King’s Landing, spitfires were belching death, and the great trebuchets behind the Mud Gate were throwing boulders. One the size of an ox crashed down between Black Betha and Wraith, rocking both ships and soaking every man on deck. Another, not much smaller, found Bold Laughter. The Velaryon galley exploded like a child’s toy dropped from a tower, spraying splinters as long as a man’s arm. Through black smoke and swirling green fire, Davos glimpsed a swarm of small boats bearing downriver: a confusion of ferries and wherries, barges, skiffs, rowboats, and hulks that looked too rotten to float. It stank of desperation; such driftwood could not turn the tide of a fight, only get in the way. The lines of battle were hopelessly ensnarled, he saw. Off to port, Lord Steffon, Ragged fenna, and Swift Sword had broken through and were sweeping upriver. The starboard wing was heavily engaged, however, and the center had shattered under the stones of those trebuchets, some captains turning downstream, others veering to port, anything to escape that crushing rain. Fury had swung her aft catapult to fire back at the city, but she lacked the range; the barrels of pitch were shattering under the walls. Sceptre had lost most of her oars, and Faithful had been rammed and was starting to list. He took Black Betha between them, and struck a glancing blow at Queen Cersei’s ornate carved-and-gilded pleasure barge, laden with soldiers instead of sweetmeats now. The collision spilled a dozen of them into the river, where Betha’s archers picked them off as they tried to stay afloat. Matthos’s shout alerted him to the danger from port; one of the Lannister galleys was coming about to ram. “Hard to starboard,” Davos shouted. His men used their oars to push free of the barge, while others turned the galley so her prow faced the onrushing White Hart. For a moment he feared he’d been too slow, that he was about to be sunk, but the current helped swing Black Betha, and when the impact came it was only a glancing blow, the two hulls scraping against each other, both ships snapping oars. A jagged piece of wood flew past his head, sharp as any spear. Davos flinched. “Board her!” he shouted. Grappling lines were flung. He drew his sword and led them over the rail himself. The crew of the White Hart met them at the rail, but Black Betha’s men-at-arms swept over them in a screaming steel tide. Davos fought through the press, looking for the other captain, but the man was dead before he reached him. As he stood over the body, someone caught him from behind with an axe, but his helm turned the blow, and his skull was left ringing when it might have been split. Dazed, it was all he could do to roll. His attacker charged screaming. Davos grasped his sword in both hands and drove it up point first into the man’s belly. One of his crewmen pulled him back to his feet. “Captain ser, the Hart is ours.” It was true, Davos saw. Most of the enemy were dead, dying, or yielded. He took off his helm, wiped blood from his face, and made his way back to his own ship, trodding carefully on boards slimy with men’s guts. Matthos lent him a hand to help him back over the rail. For those few instants, Black Betha and White Hart were the calm eye in the midst of the storm. Queen Alysanne and Lady of Silk, still locked together, were a ranging green inferno, drifting downriver and dragging pieces of Lady’s Shame. One of the Myrish galleys had slammed into them and was now afire as well. Cat was taking on men from the fastsinking Courageous. The captain of Dragonsbane had driven her between two quays, ripping out her bottom; her crew poured ashore with the archers and men-at-arms to join the assault on the walls. Red Raven, rammed, was slowly listing. Stag of the Sea was fighting fires and boarders both, but the fiery heart had been raised over Joffrey’s Loyal Man. Fury, her proud bow smashed in by a boulder, was engaged with Godsgrace. He saw Lord Velaryon’s Pride of Driftmark crash between two Lannister river runners, overturning one and lighting the other up with fire arrows. On the south bank, knights were leading their mounts aboard the cogs, and some of the smaller galleys were already making their way across, laden with men-at-arms. They had to thread cautiously between sinking ships and patches of drifting wildfire. The whole of King Stannis’s fleet was in the river now, save for Salladhor Saan’s Lyseni. Soon enough they would control the Blackwater. Ser Imry will have his victory, Davos thought, and Stannis will bring his host across, but gods be good, the cost of this... “Captain ser!” Matthos touched his shoulder. It was Swordfish, her two banks of oars lifting and falling. She had never brought down her sails, and some burning pitch had caught in her rigging. The flames spread as Davos watched, creeping out over ropes and sails until she trailed a head of yellow flame. Her ungainly iron ram, fashioned after the likeness of the fish from which she took her name, parted the surface of the river before her. Directly ahead, drifting toward her and swinging around to present a tempting plump target, was one of the Lannister hulks, floating low in the water. Slow green blood was leaking out between her boards. When he saw that, Davos Seaworth’s heart stopped beating. “No,” he said. “No, NOOOOOOOO!” Above the roar and crash of battle, no one heard him but Matthos. Certainly the captain of the Swordfish did not, intent as he was on finally spearing something with his ungainly fat sword. The Swordfish went to battle speed. Davos lifted his maimed hand to clutch at the leather pouch that held his fingerbones. With a grinding, splintering, tearing crash, Swordfish split the rotted hulk asunder. She burst like an overripe fruit, but no fruit had ever screamed that shattering wooden scream. From inside her Davos saw green gushing from a thousand broken jars, poison from the entrails of a dying beast, glistening, shining, spreading across the surface of the river... “Back water,” he roared. “Away. Get us off her, back water, back water!” The grappling lines were cut, and Davos felt the deck move under his feet as Black Betha pushed free of White Hart. Her oars slid down into the water. Then he heard a short sharp woof, as if someone had blown in his ear. Half a heartbeat later came the roar. The deck vanished beneath him, and black water smashed him across the face, filling his nose and mouth. He was choking, drowning. Unsure which way was up, Davos wrestled the river in blind panic until suddenly he broke the surface. He spat out water, sucked in air, grabbed hold of the nearest chunk of debris, and held on. Swordfish and the hulk were gone, blackened bodies were floating downstream beside him, and choking men clinging to bits of smoking wood. Fifty feet high, a swirling demon of green flame danced upon the river. It had a dozen hands, in each a whip, and whatever they touched burst into fire. He saw Black Betha burning, and White Hart and Loyal Man to either side. Piety, Cat, Courageous, Sceptre, Red Raven, Harridan, Faithful, Fury, they had all gone up, Kingslander and Godsgrace as well, the demon was eating his own. Lord Velaryon’s shining Pride of Driftmark was trying to turn, but the demon ran a lazy green finger across her silvery oars and they flared up like so many tapers. For an instant she seemed to be stroking the river with two banks of long bright torches. The current had him in its teeth by then, spinning him around and around. He kicked to avoid a floating patch of wildfire. My sons, Davos thought, but there was no way to look for them amidst the roaring chaos. Another hulk heavy with wildfire went up behind him. The Blackwater itself seemed to boil in its bed, and burning spars and burning men and pieces of broken ships filled the air. I’m being swept out into the bay. It wouldn’t be as bad there; he ought to be able to make shore, he was a strong swimmer. Salladhor Saan’s galleys would be out in the bay as well, Ser Imry had commanded them to stand off... And then the current turned him about again, and Davos saw what awaited him downstream. The chain. Gods save us, they’ve raised the chain. Where the river broadened out into Blackwater Bay, the boom stretched taut, a bare two or three feet above the water. Already a dozen galleys had crashed into it, and the current was pushing others against them. Almost all were aflame, and the rest soon would be. Davos could make out the striped hulls of Salladhor Saan’s ships beyond, but he knew he would never reach them. A wall of red-hot steel, blazing wood, and swirling green flame stretched before him. The mouth of the Blackwater Rush had turned into the mouth of hell. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1522/45618.html","bookId":1301,"book":{"id":1301,"title":"冰与火之歌:A CLASH OF KINGS 列王的纷争","description":"简介： The comets tail spread across the dawn, a red slash that bled above the crags of Dragonstone like a wound in the pink and purple sky. The maester stood on the windswept balcony outside his chambers. It was here the ravens came, after long flight. The...","cover":"http://novel.tingroom.com/file/upload/201603/25/13-30-26-59-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1522","creation":"Aug 1, 2019 12:24:49 AM","modification":"Aug 1, 2019 12:24:49 AM"}}
