{"id":68938,"no":10,"title":"Page 10","content":"Part 2 Impact Minus Fifty-Five\n 9\n ALVAR KRESH STARED out the window of his home, and watched the rain come pouring down. Rain-lifegiving, welcoming rain. It was a rare thing for the city of Hades, and always a most welcome one.\n But the rain and the darkness made the way impossible to see, and made the going slippery. Flash floods could wash out the road altogether. It was best to stay in one place, stay inside and home and dry in the rain. But Kresh could see another, larger, and more dangerous storm, one that had swept across the planet, Comet Grieg bearing down in its wake. In that larger storm, the storm of politics and decision and danger, Kresh had no choice but to move forward, to venture out and choose the direction that would lead to safety.\n If any direction could do so. If there was any way to choose a path, or any way to know that it would lead in the direction it seemed to go.\n What was to be done?\n Alvar Kresh had faced many decisions in his life, made many choices that affected many people, but never had he felt the loneliness of decision more. If only Lentrall had discovered his damnable comet sooner. If only there were more time.\n \"What am I going to dot\u0027 he asked the rain, speaking softly enough that his voice would not carry. But there were no answers, no guidance there. He turned around and looked around his living room. Fredda and Donald were there, watching him, waiting for him to speak to them.\n It was a big, comfortable, informal room. Fredda had redecorated it in soft and gentle colors, pastel shades of yellow and white, with soft rugs and comfortable chairs and cheerful abstract murals on the walls. Kresh would not have picked out any of it for himself, and yet, somehow, it all suited him very well. It felt more like a home than any place he had ever lived by himself. Warm, and safe, and bright.\n But then Kresh saw the room flash white for a split second as a lightning bolt lit up the window behind him. The thunder came quickly after, a booming roar that seemed powerful enough to shake the room apart.\n A well-timed reminder, it was, that they were not safe, that they could build all the buildings and walls and barriers they liked. The world would still be outside, unpredictable, uncontrollable, unknowable.\n And why merely imagine the chance of Comet Grieg being spotted earlier? Comet Grieg could just as easily have been left undiscovered until it was much closer, until it was too late to even consider diverting it. Or else the comet\u0027s natural, undiverted orbit could just as easily have been too far off to even contemplate moving it. Or the damned thing could have been heading in for an unplanned, uncontrolled direct hit on the planet. What would they have done then?\n But no. \"What if\" was no longer the question. Alvar Kresh, and Alvar Kresh alone, had to answer another question.\n \"What now?\" he asked Fredda and Donald. \"What is to be done?\"\n There was a long moment\u0027s pause before either of them replied, the rain on the roof a fitting, brooding background to the mood of the room.\n \"I don\u0027t know,\" said Fredda at last. \"Either leave the comet alone or bring it in to drop on our heads. Those are the two things you can do. It seems to me that either one could save all the life on the planet from destruction-or actually bring on that destruction. Are we doomed if we do nothing? Can we drop the comet without killing us all?\"\n Kresh made a thoughtful little noise in his throat. \"That\u0027s what it comes down to, isn\u0027t it?\" He considered for a moment, and then went on. \"Of course, the traditional Spacer response would be to do nothing at all,\" said Kresh. \"Let it alone, let it pass. If there is no way to know if it would be better to act, why then far better to leave the thing alone. If you do nothing, then there is nothing you can be blamed for if things go wrong.\"\n \"Another proud legacy of the Three Laws,\" Fredda said. \"Be safe, do nothing, take no chances.\"\n \"If the Three Laws teach humans to avoid taking needless risks now and again, I for one see that as a very strong argument in their favor,\" said Donald, speaking for the first time. \"But even the First Law contains an injunction against inaction. A robot cannot stand idly by. It must act to prevent harm to humans.\"\n Kresh looked toward Donald with a smile. \"Are you saying that a robot faced with this decision would choose to bring down the comet? Is that what you would do?\"\n Donald held up his hands palm out and shook his head back and forth vigorously. \"By no means, Governor. I am quite literally incapable of making this decision. It would be a physical impossibility for me to do it, and more than likely suicidal to attempt it. So it would be for any properly constructed Three Law robot.\"\n \"How so?\"\n \"The First Law enjoins us against doing harm to humans, and against inaction at such times when robotic action would prevent harm to humans.\" Donald\u0027s speech became labored as he spoke. It was plain that even discussing the issues in a hypothetical context was difficult for him. \"In this case, both action or inaction might or might not cause or prevent harm to humans. Attempting to deal with such a difficult problem, with the lives of so many present and potential humans in the bal-balance would cause...would cause irreparable damage to any pospospositronic brain, as the question produced cascading First-Law/First-Law conflictzzz.\" Donald\u0027s eyes grew a bit dimmer, and his movements seemed oddly sluggish as he put his arms back down at his side.\n \"All right, Donald,\" said Kresh, in his firmest and most reassuring voice. He stepped over to the robot and put his hand on Donald\u0027s sloping shoulder. \"It\u0027s all right. You are not the one who will have to make that decision. I order you to stop considering it at this time.\" There were times when only the words of a robot\u0027s direct master could be enough to snap the robot out of such a state.\n Donald\u0027s eyes faded out all but completely for a moment, and then came back to their normal brightness. He seemed to be looking at nothing at all for a few seconds, but then his eyes began to track again, and he looked straight at Kresh. \"Thank-thank you, sir. It was most unwise of me to consider the question so closely, even when called upon to do so.\"\n Kresh nodded absently, knowing that he had brought it on himself. He had asked Donald why a robot could not make such a decision, and a question was, in essence, an order. It required constant caution, endless care, to deal with the delicacy of a Three-Law robot\u0027s sensibilities and sensitivities. Sometimes Kresh was deeply tired of it all. There were even times when he was ready to concede that the Settlers might have a point. Maybe some parts of life would be easier without robots.\n Not as if they had such an option at the moment. But if robots could not be trusted to face such a situation...Kresh turned toward Donald again. \"Donald, I hereby order you to turn around and face the wall, and to shut off all your audio inputs until you see my wife or me waving at you. Do you understand?\"\n \"Yes, sir. Of course.\" Donald turned his back on Kresh and Fredda. \"I have now shut down my audio receptors.\"\n \"Very good,\" said Kresh. More damn fool precautions, but that couldn\u0027t be helped. At least now Donald would be unable to hear or eavesdrop. Now they would be able to talk without fear of saying the wrong thing in front of the robot and accidentally setting up a damn fool First Law crisis. Kresh turned toward Fredda. \"What about the Robotic Planetary Control Center?\" he asked. \"I wanted to consult with it-and with the Computational Planetary Control Center-before I reached a decision.\"\n \"Well, what about them?\" Fredda asked.\n The two control centers were the heart of the reterraforming effort, performing all the calculations and analyses of each new project before it was launched. The original intent had been to build a single control center. There were two basic designs to choose between. One was a Settler-style computational unit, basically a massively complex and powerful, but quite nonsentient, computer. The other was a Spacer-style robotic unit that would be based on a hugely powerful positronic brain, fully imbued with the Three Laws. It would, in effect, be a robot mind without a robot body.\n There had been a tremendous controversy over whether to trust the fate of the planet to a mindless machine, or to a robotic brain that would refuse to take necessary risks. It was easy to imagine a robotic control unit choosing to avoid harm to one human, rather than permit a project vital to the future of the planet. The robotics experts all promised that it didn\u0027t work that way, but experts had been wrong before. Governor Grieg had died before he could reveal his choice between the two systems. In one of the first acts of his administration, Kresh had decided to build both, and interconnect them so that the two systems worked in consensus with each other. In theory, if the two systems could not reach agreement on what to do, or not to do, they were to call in human referees to decide the issue. In practice, the two systems had agreed with each other far more often than anyone could have hoped. Thus far, there had only been a half dozen or so very minor issues that had required human decisions.\n A vast planetary network of sensors and probes, orbiting satellites, mobile units, and on-site investigators, both robotic and human, fed a constant stream of information to both units-and both units fed back a constant stream of instructions and commands to the humans and robots and automatic machines in the field.\n The two interconnected control centers were the only devices on the planet capable of handling the constant stream of incoming data and outgoing instructions. It was plainly obvious that the two of them would have to be consulted regarding the plan to drop a comet on the planet, but Kresh did not wish to risk the sanity of the robotic unit. \"You saw what just happened to Donald,\" he said. \"Will I burn the Robotic Center out if I ask it what I should do?\"\n Fredda smiled reassuringly. \"There wouldn\u0027t be much point in having a Robotic Control Center that couldn\u0027t consider risks to the planet without damaging itself,\" she said. \"It took some doing, but we installed some special...safeguards, shall we say, that should keep it from experiencing any serious First Law conflict.\"\n \"Good, good,\" said Kresh, a bit absently. \"At least that\u0027s one less thing to worry about. At least we know that part is all right.\"\n \"Do we?\" Fredda asked. \"I wonder. When Lentrall asked me about Donald\u0027s name, and how it was not from Shakespeare, that made me wonder.\"\n \"Wonder what?\"\n \"I was absolutely certain it was from Shakespeare. No doubt at all in my mind. I never bothered to double-check, any more than I would have bothered to double-check the spelling of my own name. I thought I knew it-and I was dead wrong.\"\n \"We all make mistakes,\" Kresh said.\n \"Yes, yes, of course,\" Fredda said, impatiently. \"But that\u0027s not the point. In a sense, it\u0027s a trivial mistake. But it came out of a trusted database. Who knows how long ago the dataset got scrambled, or what else in it is wrong? And if that database can be wrong, lots of other things can be as well. What else is there that we think we know? What other hard fact that we think we have absolutely right will turn out to be absolutely dead wrong? What else do we think we know?\"\n There was a moment of long and uncomfortable silence.\n But uncertainty surrounded all of life. To wait until one was sure was to remain frozen in place until it was too late. \"We\u0027ll never be able to answer that question,\" said Kresh. He paused for a moment and thought. \"You\u0027re thinking like a scientist,\" he said. \"And up until now, I\u0027ve been thinking like a politician. Maybe it\u0027s time to think like a police officer.\"\n \"I must admit that I do not see how the police viewpoint would be of much use in this situation,\" said Fredda.\n \"Because back when I was a policeman, I knew I didn\u0027t know,\" said Kresh. \"I knew, on every case, that some knowledge was hidden, and that I would never have absolutely complete or totally accurate information. But I still had to act. I still had to decide. I had to take the facts I had-or thought I had-and ride them as far as they would take me.\" He stepped around Donald so he was facing the robot. He waved his hand in front of Donald\u0027s face. \"All right, Donald,\" he said. \"You can turn around and listen now.\"\n \"Thank you, sir,\" Donald replied.\n Kresh smiled at Donald, then paused a moment and walked to the center of the room. He looked from Donald to Fredda, and then turned around to look at the rainstorm again, to look at nothing at all. \"By the time I know enough to decide what to do, it will be too late to decide. Therefore, we will work on the assumption that we are going to divert Comet Grieg. All preparations will go forward as if we were indeed planning to do the job.\"\n \"So we pretend that you\u0027ve decided?\" Fredda asked.\n \"More or less,\" Kresh said. \"It will buy me some time. I won\u0027t have to decide until it\u0027s actually time to deflect the comet.\"\n \"That\u0027s a dangerous move,\" Fredda said. \"It\u0027s going to be hard to make all the investment of time and effort and money and then pull back at the last moment.\"\n \"It\u0027s not the best way to do it,\" Kresh agreed. \"But can you think of any way that\u0027s less bad? That at least gives us time to examine our options?\"\n \"No,\" Fredda admitted.\n \"Then I think we\u0027d better do it my way,\" said Kresh.\n \"That leaves us with a hell of a lot to do,\" Fredda said. \"There\u0027s the space-side interception and diversion to set up, the targeting to plan, the site survey of wherever the comet\u0027s going to hit, evacuation of people and equipment, emergency preparations for the cities, food stockpiles to lay in-\"\n \"Excuse me, Dr. Leving, but, if I may say so, that is the sort of organizational job I was made to do.\"\n Kresh smiled. Fredda ought to know that. She had made Donald in the first place. It was as close to a joke as Donald was ever likely to get. \"Point taken,\" Kresh said. \"Donald, I want you to get started on the initial organizational tasks right now. Project management is to be your primary duty, and you are to avoid allowing other tasks to interfere. You are to perform no further personal service for me unless specifically ordered to do so. Report to me via hyperwave in three hours, time as to project status. Thereafter, you are to consult with me as you see fit. Fredda, with Donald tied up, I\u0027m afraid I\u0027m going to have to borrow Oberon as a pilot. I have a feeling Donald would not permit me to do the flying myself in this weather.\"\n \"Absolutely not,\" said Donald.\n \"But-but where are you going at this hour of the night?\" Fredda asked.\n \"Out,\" said Kresh. \"No one seems to know anything for sure in this whole business. It\u0027s just about time I got some advice from someone who knows what\u0027s going on.\"\n THERE\u0027S NO LOGICAL reason to make this trip, Kresh told himself as he stepped out of the elevator car into the covered rooftop hangar of his house. And that was true, as far as it went. No doubt Kresh could have gotten all the information he needed by sitting at his own comm panel in his own house.\n But there were times when being on the scene, being there in the flesh, was useful. There would be some little detail, something that might have been overlooked, or never noticed at all, if seen only through a viewscreen, or heard through a speaker.\n Besides, the journey itself would be of use. There were times when it was important to be alone, to have time to think. Alone even from one\u0027s personal robot, from one\u0027s trusted wife. Alvar Kresh sensed that this was one of those times when he had to be alone-if for no other reason than to remind himself that he would have to make his decision alone. And he would have the duration of the flight all to himself. Fredda\u0027s robot Oberon scarcely counted as company, and besides, he was taking the long-range aircar. It had a separate passenger compartment behind the cockpit. He stepped aboard, and Oberon followed behind him. Kresh took a seat by the port-side window, allowed Oberon to lock and double-check his seat restraint, and then watched as Oberon stepped forward to the pilot\u0027s compartment and shut the hatch behind himself.\n Alone. Yes, a very good idea, to be alone. Good to get out of the city, see something-at least a little something-of the planet again, while he was considering its fate. The thought appealed to him as Oberon powered up the aircar and it lifted a half-meter or so off the deck of the hangar. The outer doors opened, and the aircar slowly eased out into the driving rain. If anything, the storm had grown more intense.\n Suddenly the aircar was in the middle of the storm, bucking and swaying in the darkness, the rain crashing down on the hull and the ports with incredible violence. Just for a moment, Alvar Kresh would have been just as glad to have stayed at home-but Oberon would not have started the flight if he had not been confident of his ability to deliver Kresh safely to his destination. Kresh certainly would not have been willing to pilot the craft in this sort of weather.\n But even as he grabbed at the arms of his seat and braced himself against the bouncing, bone-rattling ride, there was part of him that knew no fear at all, because a robot was at the controls, and robots and danger to humans simply could not exist in the same place. There were few things in the universe in which Alvar Kresh could place absolute faith, but robots were one of them.\n But tell that to the weather. The storm boomed and roared outside the long-range aircar as it fought for altitude, the banging and rattling getting worse with every moment. Just at the moment when Kresh was ready to decide his faith in robots was not all that absolute, the aircar broke free, punched a hole in the clouds and climbed out into the clear and placid skies above.\n Smooth sailing after the storm, Kresh told himself as he looked down on the storm clouds below. A nice symbol, that. Maybe even a good omen.\n But Kresh knew better, of course. When it came to signs and omens, he had no faith at all.\n The aircar turned toward the southeast and settled in for its flight to the island of Purgatory.\n DAVLO LENTRALL STUMBLED blindly from the aircar and out into the rain-swept darkness of his own front yard. Kaelor stepped out after him, gently threaded his left arm through his master\u0027s right, and led him toward the front door of the house.\n Davlo followed half-consciously, barely aware of where he was or what he was doing. He was in shock, that was all there was to it. It had taken some time for the full impact of what had happened to hit him, but now, at last, it had.\n The one part of him that was still more or less aware had refused to let the police aircar hover forward into the garage attached to the house, even though there was plenty of room and it would have saved him getting drenched in the rain. No. No. He would not let the police in his house, not even that far. Not if he could help it.\n It was irrational, and he knew it, and he didn\u0027t care. Even though he knew perfectly well that the police had been all through the place in his absence, running their security checks and installing their monitoring devices. Even though he knew they would remain just outside his property line, scanning and probing and watching the storming darkness. Even if he knew all that was right, and sensible, given the fact that people with very few qualms about going too far had chosen him for a target. It might well be that the survival of the planet depended on his staying alive-but just at the moment, Davlo Lentrall did not even care about that.\n He moved on leaden feet toward his front door, waited while Kaelor opened it for him, bundled him inside, and closed it behind him. He obeyed unresistingly as Kaelor led him to the center of the main parlor and stripped off his sopping-wet outer garments then and there. Kaelor vanished and returned instantly with a stack of towels and a warm blanket. One of the household robots materialized with a mug of something steaming hot. And then the robots left him alone.\n Davlo found himself sitting in the main parlor, his hair and skin still damp, bundled up in a blanket, drinking the hot soup without tasting it, staring at the far wall without seeing it.\n It had all fallen in. All of it. Davlo Lentrall had never, not once in his life, doubted himself. Never, not once in his life, had he doubted that he was capable of handling whatever life put before him. He was smarter than, sharper than, quicker than, better than other people, and he knew it. He had always known it.\n Until today. Until a bunch of faceless kidnappers took him in completely with their tricks to keep him away from his security detail. Until a robot tossed him around like a rag doll, and shoved him under a park bench for safekeeping. Until a police officer whom Davlo would have dismissed as being of only average intelligence had made all the right guesses, all the right moves, taken all the right chances, and put his own life in grave peril, so as to save Davlo.\n But even all that, galling as it was, would not have been so bad. But it all served as nothing more than background for the real story, the real humiliation.\n Davlo Lentrall had been scared. No. It was time to be honest, at least with himself. He had been terrified. He was still terrified. When the moment had come, when the emergency had popped up from out of nowhere, the Davlo Lentrall of his imagination-the cool, confident, commanding fellow who could handle whatever life threw at him without the least amount of trouble-that Davlo Lentrall had vanished in a puff of smoke.\n It didn\u0027t matter that a courageous, in-control Davlo Lentrall would have ended up shoved under that park bench just the same, that there was nothing he could have done from start to finish to change things, no matter how brave or cowardly he was.\n It was that the Davlo Lentrall who was smarter and better than all the rest, the Davlo Lentrall with the nerve to tell the planet\u0027s foremost robot designer that she had made a mistake naming her robot, suddenly wasn\u0027t there anymore.\n Lentrall had never really known how would react in an emergency, because he had never been in an emergency. But now he knew. From now on, Davlo Lentrall could not help but know that fear could leave him absolutely incapable of action.\n Lentrall took another sip of the hot soup, and, for the first time since had arrived home, really noticed where he was, what he was doing. The soup was good, warming, filling.\n So he had dropped the ball today. So be it. What did it matter? There was nothing even the bravest man alive could have done that would have made any difference. And did it really matter so much if Commander Justen Devray was the hero of the afternoon? Would anyone even remember this afternoon\u0027 s incident, when they wrote the history books? No. They would remember that Dr. Davlo Lentrall had discovered Comet Grieg, and spearheaded the effort that had led to Grieg\u0027s impact, and to the salvation of the planet.\n Yes. Yes. Lentrall finished off the last of the soup in a single swallow, and got to his feet. The blanket still wrapped around his body, he made his way to his home office, in the far corner of the ground floor. Yes. Comet Grieg. That was what they would remember, not this afternoon\u0027s foolish humiliation.\n And the best way to wipe the memory of today\u0027s disaster from his mind would be to get back to work, immediately, on the Comet Grieg project. Kaelor had been quite right to point out there were a large number of unresolved problems to deal with. No time like the present to deal with them. He could call up the appropriate computer files from here and set to work on them.\n It, of course, never so much as crossed Davlo\u0027s mind to consider where, precisely, the computer files actually were. It had never so much as dawned on him that they had an actually physical location, a position in space that held them. They were simply there, in the massively interlinked comm and computer system that interlinked all the comm terminals in the city and all the planet\u0027s outposts of civilization. He could call them up from any place, any time, and set to work on them, whenever he liked.\n He had never given the matter much consideration, any more than he would have stopped to remember that the air was there for him to breathe whenever he wanted, or that his household robots knew when to serve him soup.\n Lentrall sat down at his home office comm station and activated his files on Comet Grieg. At least he tried to do so.\n Because, quite suddenly, it was as if the air wasn\u0027t there for him to breathe anymore.\n THE FLIGHT OVER the Great Bay had been smooth as silk, the aircar leaving the storm behind with the coastline. That was not too surprising. The climate people had told Kresh that it was a typical pattern: warm, moist air dumping its moisture the moment it came in contact with the cool, dry air over land. Part of it had to do with the air being forced up by the mountain ranges just inland from the city of Hades. The wind blew the air up the side of the hill, and the higher the air went, the more its barometric pressure dropped and the less moisture it could hold. So the water came out of the air, and it rained. A rain shadow effect, they called it.\n But if it could work on the mainland, it could work just as handily on the windward side of an island. Especially a nice, big island like Purgatory. The prevailing winds over the island were from the south. Oberon flew Kresh\u0027 s aircar in from the northwest, up and over the central peak of the island-and then right back down into weather every bit as heavy as what they had left behind at Hades.\n The aircar dropped down into the clouds, and was instantly engulfed by the raging storm. Kresh grabbed at his armrests again as the aircar bucked and heaved and bounced allover the sky, thunder booming all around as lightning lit up the storm-tossed skies outside his viewport. Suddenly Kresh was caught in the urge to get forward, to get to the cockpit and see what was going on, to grasp hold of the controls and take over. But if that was not panic talking, it was the next best thing.\n Kresh forced himself to relax, to ease back. It was going to be all right. Oberon was a good pilot. He looked out the viewport, and down at the rain, far below. He could not help but think back to another storm on Purgatory, five years before. A storm brought on by the weatherfields, the huge forcefields generated at the Terraforming Center. A storm that had raged that night when Chanto Grieg was murdered. At least tonight, in this storm, there was no disaster waiting to strike. Kresh smiled to himself. Talk about misplaced confidence. How the devil could he know what schedules were kept by disasters? They tended to come up whenever they pleased, without bothering to consult the likes of Alvar Kresh.\n There was a harder bump than any before, and suddenly the aircar had stopped moving. Startled, Kresh blinked and looked out the viewport. It took him a moment to realize they were on the ground.\n The door to the aircar\u0027s cockpit opened and Oberon stepped into the main cabin. \"We have arrived, sir,\" he said in his low, almost gravelly, voice. \"As you can see, sir, the weather is extremely inclement. As there is no covered access between the landing pad and the entrance, perhaps you might wish to wait until the weather has cleared before you set out.\"\n Kresh peered through the viewport, using his hand to block the glare from the cabin\u0027s interior lights. He spotted the entrance to the Terraforming Center. \"It can\u0027t be more than a hundred meters or so to the door,\" Kresh said. \"Why the devil should I wait?\"\n \"As you see fit, sir. If you think it a wise idea to go immediately.\"\n Damned busybody nursemaid of a robot. Kresh indulged himself with a brief flash of temper. If he waited around until the weather was just right, would Oberon then hint that he should wait until he had had a full meal and a nice long nap before setting out on the arduous thirty-second journey across the parking lot? They were on the clock here, and he had already been worrying that he had wasted too much time.\n \"I think it\u0027s a wise idea, all right,\" Kresh growled. \"In fact I find it downright brilliant. \" He undid his seat restraint, got up, and grabbed his rain poncho from the seat opposite, where he had tossed it down after coming aboard. The thing was still a trifle damp, but no matter. He pulled it on over himself, adjusted the hood, and glared at Oberon. \"I\u0027d suggest you stay here for the time being,\" he said, \"unless you think it a wise idea to get in my way.\"\n Plainly, Oberon did not think it a wise idea to reply to that. Kresh turned his back on the robot, grabbed the hatch handle, and yanked up on it. The hatch unlatched, and Kresh gave it a good hard shove. It swung open and he stepped out into the roaring weather.\n The driving rain caught him full in the face, coming down cold and hard. Kresh held up his hand to shield his face, and squinted through the downpour. He walked around to the opposite side of the ship, and then straight ahead, toward the entrance to the Terraforming Center. The wind grabbed at his poncho, blowing it flat against his body and sending its hem flapping and slapping wildly behind him. He leaned into the wind, struggling to hold the poncho hood on top of his head as the wind did its best to pull it off, and the rain blew in regardless.\n A pair of big double glass doors, the sort that opened at the center, formed the main entrance of the Terraforming Center. Kresh got to them and almost grabbed at the handles before he realized that wouldn\u0027t work. He wasn\u0027t going to get in unless he followed the rules-rules he had approved himself. \"VOICEPRINT!\" he shouted above the noise of the storm.\n \"Auto-voiceprint system ready,\" an utterly depersonalized voice replied from nowhere in particular. Even though Kresh had been expecting a reply, it still startled him. The voice was clearly artificial-calm, emotionless, bloodless.\n Kresh answered back in a somewhat lower tone of voice. If he could hear the voiceprint, probably it could hear him. \"Name-Governor Alvar Kresh,\" he said. \"Password-Terra Grande.\"\n \"Identity confirmed, clearance to enter confirmed,\" the voice replied. The doors unlatched. Kresh, impatient and eager to get out of the rain, grabbed the handles of both doors and pulled them a bit too hard. The wind caught at the left side door and yanked it out of his hand, bouncing it against the left-side wall before it swung back. There was a second, inner pair of doors that swung inward, and Kresh shoved them out of his way without breaking stride.\n He had not been here in a long time, but he still knew his way around. He turned left and marched down the main hallway toward the third set of doors. The first two doorways in the hallway were perfectly ordinary affairs, but not the entrance to Room 103. It was a huge, armored steel hatch that more closely resembled the doors of a vault than anything else. The door was locked down and secured, as it should have been, but there was a palmprint button by the side of the door. Kresh slapped his hand down on it. After a moment, there was a bump, a clunk, and a thud and the massive door swung outward.\n Kresh ducked inside the moment the door was open wide enough to do so. A startled-looking middle-aged woman in a lab coat was working at a desk just inside the door. She stared open-mouthed at the intruder, then got to her feet. She seemed about to protest, and two or three of the robots took a step or two closer, as if they feared that the intruder might intend harm to the woman. But then Kresh threw back the hood of his poncho. It was clear that the woman and the robots recognized him instantly-but knowing who he was only seemed to increase their sense of bewilderment.\n But Alvar Kresh was not much interested in the emotional state of the swing-shift technical staff. He barely looked at them. He looked around until he spotted two huge and gleaming hemispherical enclosures, each about five meters across, each sitting on a plinth or thick pillar, about the diameter of the hemisphere on top of it. The pillars raised the bases of the hemispheres up to just about eye level. One of the hemispheres was a smooth and perfectly rounded dome, the other a geodesic form, made up of flat panels, with all manner of complicated devices and cables and conduits hanging off it at every angle. Kresh nodded at the two machines, and spoke.\n \"I want to talk to the twins,\" he said. \n","sourceLink":"https://allnovel.net/utopia-isaac-asimov-s-caliban-3/page-10.html","bookId":1730,"book":{"id":1730,"title":"Utopia (Isaac Asimov\u0027s Caliban #3)","description":"Storyline: \n Utopia (Isaac Asimov\u0027s Caliban #3) \n Third in a powerful trilogy that examines Asimov\u0027s Three Laws of Robotics--a challenge welcomed and sanctioned by Isaac Asimov, and written with his cooperation.\n \n","cover":"https://allnovel.net/images/utopia-isaac-asimov-s-caliban-3.jpg","author":"Roger MacBride Allen","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/utopia-isaac-asimov-s-caliban-3.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:11:12 AM"}}
