{"id":68939,"no":11,"title":"Page 11","content":"DR. LESCHAR SOGGDON opened her mouth and shut it, then opened it again and left it that way for a moment before she found her voice. \"You\u0027re-you\u0027re Governor Kresh,\" she said at last.\\n\\n \"Yes,\" her visitor replied testily. \"I know I am. And I need to talk to the twins concerning some climate projections. Now.\"\\n\\n Soggdon was now at even more of a loss. \"Sir, it doesn\u0027t work that way. You can\u0027t just come in and-\"\\n\\n \"I can,\" Kresh said. \"I should know. I wrote the regulations.\"\\n\\n \"Oh, yes, yes, sir, of course. I wasn\u0027t suggesting that you were not allowed to come here. It is merely a question of having the training and the understanding of our procedures here. It would probably be wiser for you to submit your questions in writing to the General Terraforming Committee and then-\"\\n\\n \"Who are you?\" Kresh asked, interrupting her. \"What is your position here?\"\\n\\n Soggdon flushed and drew herself up to her full height, bringing her eyes roughly level With the base of Kresh\u0027s neck. \"I am Dr. Leschar Soggdon,\" she said with as much dignity as she could muster. \"I\u0027m the night shift supervisor here.\"\\n\\n \"Very well, Dr. Soggdon. Please listen carefully. I have come here precisely for the reason that I want-I need-to avoid that sort of delay and caution. I am here on a matter of the greatest urgency and importance, and I must be certain I am getting my information direct from the source. I cannot take the chance of some expert misinterpreting my questions or the answers from the twins. I cannot wait for the General Committee to have a conference and debate the merits and the meaning of my questions. I have to ask my questions now, and get an answer now. Is that clear? Because if it is not, you\u0027re fired.\"\\n\\n \"I ah-ah-ah, sir, I ah-\"\\n\\n \"Yes? Do you have other job prospects?\"\\n\\n She swallowed hard and started again. \"Very well,\" Soggdon said at last. \"But, sir, with all due respect, I would ask that you sign a statement that you proceeded against my advice and specifically ordered me to cooperate.\"\\n\\n \"I\u0027ll sign whatever you like,\" Kresh said. \"But right now let me talk to the twins.\" The governor peeled off his poncho and handed it to the nearest robot. He walked to the far side of the huge room, where the two massive hemispherical enclosures sat. Inside were the two Terraforming Control Centers, one a Spacer-made sessile robotic unit, and the other a Settler-made computational system.\\n\\n A sort of combination desk and communications console sat facing the two machines. Governor Kresh pulled out the chair and sat down at it. \"All right, then,\" he said. \"What do I do?\"\\n\\n Soggdon was severely tempted simply to show the man the proper controls to operate and let him charge ahead as directly as he liked. But she knew just how much damage even a minor slip of the tongue could produce. The idea of having Unit Dee caught in a major First Law conflict just because Kresh wanted to have his own way was too much for her. She had to speak up. \"Sir,\" she said, \"I\u0027m sorry, but you have to understand a few things before you start, and I\u0027m going to make sure you understand them, even if it means I lose my job. Otherwise you could cause any amount of damage to Unit Dee.\"\\n\\n Kresh looked up at her in annoyed surprise, but then his expression softened, just a bit. \"All right,\" he said. \"I always tell myself that I prefer it when people stand up to me. I guess this is my big chance to prove it. Tell me what I should know, but don\u0027t take too long about it. You can start by telling me what \u0027D\u0027 means.\"\\n\\n His question took her by surprise. Soggdon looked at him carefully before she spoke. How could a man who didn\u0027t even know what-or who-Unit Dee was expect to barge in here and take over? \"I didn\u0027t mean the letter \u0027D,\u0027 sir. I meant Unit Dee. That\u0027s what we call the robotic terraforming control unit. Unit Dee.\"\\n\\n Kresh frowned and looked over at the two units, and seemed to notice for the first time the two neatly lettered signs, one attached to each of the two hemispheres. The sign on the front of the rounded-off dome read Unit Dee, and the one on the angular geodesic dome read Unit Dum.\\n\\n \"Ah. I see,\" he said. \"I confess I don\u0027t know much about how you run things here. I visited here once or twice during construction, but not since you\u0027ve been operational. I know the code name for the two Control Units is still \u0027the twins\u0027-but not much else. I suppose those names stand for something. Acronyms?\"\\n\\n Soggdon frowned. For someone determined to charge in here and take over, he certainly was ready to get distracted by side issues. \"I believe the name Unit Dee referred to the fourth and final design considered. From there it seemed to develop into a sort of private joke among the day shift staff,\" she said. \"I must confess I never bothered to find out what the joke was. It might have something to do with Unit Dum being, well, dumb, nonsentient, but I\u0027ve never understood the exact significance of Unit Dee.\" Soggdon shrugged. She had never been much known for her sense of humor.\\n\\n \"All right,\" said the governor. \"All that to one side,\" he went on, \"what do I need to know to avoid producing damage to the twins?\"\\n\\n \"Well, Unit Dee is the only one likely to suffer damage. Unit Dum is a non sentient computation device, not a robot. He has a pseudo-self-aware interface that allows him to converse, to a limited extent, but he\u0027s not a robot and he\u0027s not subject to the Three Laws. Unit Dee is a different story. She\u0027s really not much more than an enormous positronic brain hooked up to a large number of interface links. A robot brain without a conventional robot body-but she is, for all intents and purposes, a Three-Law robot. Just one that can\u0027t move.\"\\n\\n \"So what is the difficulty?\" Kresh demanded, clearly on the verge of losing his patience again.\\n\\n \"That should be obvious,\" Soggdon replied, realizing just a second too late how rude a thing that was to say. \"That is-well, my apologies, sir, but please consider that Unit Dee is charged with remaking an entire planet, a planet that is home to millions of human beings. She was designed to be capable of processing truly huge amounts of information, and to make extremely long-range predictions, and to work at both the largest scale and the smallest level of detail.\"\\n\\n \"What of it?\"\\n\\n \"Well, obviously, in the task of remaking a planet, there are going to be accidents. There are going to be people displaced from their homes, people who suffer in floods and droughts and storms deliberately produced by the actions and orders of these two control systems. They will, inevitably, cause some harm to some humans somewhere.\"\\n\\n \"I thought that the system had been built to endure that sort of First Law conflict. I\u0027ve read about systems that dealt with large projects and were programmed to consider benefit or harm to humanity as a whole, rather than to individuals.\"\\n\\n Soggdon shook her head. \"That only works in very limited or specialized cases-and I\u0027ve never heard of it working permanently. Sooner or later, robotic thinking machines programmed to think that way can\u0027t do it anymore. They bum out or fail in any of a hundred ways-and the cases you\u0027re talking about are robots who were expected to deal with very distant, abstract sorts of situations. Unit Dee has to worry about an endless series of day-by-day decisions affecting millions of individual people-some of whom she is dealing with directly, talking to them, sending and receiving messages and data. She can\u0027t think that way. She can\u0027t avoid thinking about people as individuals.\"\\n\\n \"So what is the solution?\" Kresh asked.\\n\\n Soggdon took a deep breath and then went on, very quickly, as if she wanted to get it over with as soon as possible. She raised her hand and made a broad, sweeping gesture. \"Unit Dee thinks this is all a simulation,\" she said;\\n\\n \"What?\" Kresh said.\\n\\n \"She thinks that the entire terraforming project, in fact the whole planet of Inferno, is nothing more than a very complex and sophisticated simulation set up to learn more in preparation for a real terraforming project some time in the future.\"\\n\\n \"But that\u0027s absurd!\" Kresh objected. \"No one could believe that.\"\\n\\n \"Well, fortunately for us all, it would seem that Unit Dee can.\"\\n\\n \"But there\u0027s so much evidence to the contrary! The world is too detailed to be a simulation!\"\\n\\n \"We limit what she can see, and know, very carefully,\" Soggdon replied. \"Remember, we control all of her inputs. She only receives the information we give her. In fact, sometimes we deliberately introduce spurious errors, or send her images and information that don\u0027t quite make sense. Then we correct the \u0027mistakes\u0027 and move on. It makes things seem less real-and also establishes the idea that things can go wrong. That way when we do make mistakes in calculations, or discover that we\u0027ve overlooked a variable, or have just plain let her see something she shouldn\u0027t have, we can correct it without her getting suspicious. She thinks Inferno is a made-up place, invented for her benefit. So far as she knows, she is actually in a laboratory on Baleyworld. She thinks the project is an attempt to lea-n how to interact with Settler hardware for future terraforming projects. \" Soggdon hesitated for a moment, and then decided she might as well give him the worst of the bad news all at once. \"In fact, Governor, she believes that you are part of the simulation.\"\\n\\n \"What!\"\\n\\n \"It was necessary, believe me. If she thought you were a real person, she would of course wonder what you were doing in the made-up world of her simulation. We have to work very hard to make her believe the real world is something we have made up for her.\"\\n\\n \"And so you had to tell her that I did not really exist. \"\\n\\n \"Precisely. From her point of view, sapient beings are divided into three groups-one, those who exist in the real world, but don\u0027t have anything to do with her; two, real-world people here in the lab and in the field who talk with her and interact with her-and three, simulants, simulated intelligences.\"\\n\\n \"Simulants,\" Kresh said, very clearly not making it into a question. He was ordering her to explain the term, not asking her to do so.\\n\\n \"Ah, yes, sir. That\u0027s the standard industry term for the made-up humans and robots placed in a simulation. Unit Dee believes that the entire population of Inferno is really nothing more than a collection of simulants-and you are a member of that population.\"\\n\\n \"Are you trying to tell me I can\u0027t talk to her because she\u0027ll realize that I\u0027m not made-up?\" Kresh asked...\\n\\n \"Oh, no, sir! There should be no problem at all in your talking with Unit Dee. She talks every day with ecological engineers and field service robots and so on. But she believes them all to be doing nothing more than playing their parts. It is essential that she believe the same thing about you.\"\\n\\n \"Or else she\u0027ll start wondering if her simulated reality is actually the real world, and start wondering if her actions have caused harm to humans,\" said Kresh.\\n\\n \"She has actually caused the death of several humans already,\" Soggdon replied. \"Unavoidably, accidentally, and only to save other humans at other times and places. She has dealt reasonably well with those incidents-but only because she thought she was dealing with simulants. And, I might add, she does have a tendency to believe in her simulants, to care about them. They are they only world she\u0027s ever known.\"\\n\\n \"They are the only world there is,\" said Kresh. \"Her simulants are real-life people.\"\\n\\n \"Of course, of course, but my point is that she knows they are imaginary, and yet has begun to believe in them. She believes in them in the way one might care about characters in a work of fiction, or the way a pet owner might talk to her nonsentient pet. On some level Unit Dee knows her simulants are not real. But she still takes a genuine interest in them, and still experiences genuine, if mild, First Law conflict when one of them dies and she might, conceivably, have prevented it. Causing the death of simulants has been extremely difficult for her.\\n\\n \"If she were to find out she had been killing real people-well, that would be the end. She might simply experience massive First Law conflict and lock up altogether, suffer brainlock and die. Or worse, she might survive.\"\\n\\n \"Why would it be worse if she survived?\" Kresh asked.\\n\\n Soggdon let out a long weary sigh and shook her head. She looked up at the massive hemisphere and shook her head. \"I don\u0027t know. I can guess. At best, I think she would find ways to shut down the whole operation. We\u0027d try to stop her, of course, but she\u0027s too well hooked in, and she\u0027s awfully fast. I expect she\u0027d order power shutdowns, find some way to deactivate Unit Dum so he couldn\u0027t run the show on his own, erase computer files-that sort of thing. She\u0027d cancel the reterraforming project because it could cause injury to humans.\"\\n\\n \"The best sounds pretty bad. And at worst?\"\\n\\n \"At worst, she would try to undo the damage, put things back the way they were. \" Soggdon allowed herself a humorless smile. \"She\u0027d set to work trying to un-reterraform the planet. Galaxy alone knows what that would end up like. We\u0027d shut her down, of course, or at least try to do so. But I don\u0027t need to exaggerate the damage she could do.\"\\n\\n Kresh nodded thoughtfully. \"No, you don\u0027t,\" he said. \"But I still need to talk with her-and with Unit Dum. You haven\u0027t said much about him, I notice.\"\\n\\n Soggdon shrugged. \"There\u0027s not much to say. I suppose we shouldn\u0027t even call him a he-he\u0027s definitely an it, a soulless, mindless, machine that can do its job very, very, well. When you speak with him, you\u0027ll really be dealing with his pseudoself-aware interface, a personality interface-and, I might add, it is quite deliberately not a very good one. We don\u0027t want to fool ourselves into thinking Unit Dum is something he is not.\"\\n\\n \"But it sounds as if he could handle the situation if Unit Dee did shut down.\"\\n\\n \"In theory, yes, Unit Dum could run the whole terraforming project by himself. In practice, all of us here believe you were quite wise not to put all your trust in a single control system. We need redundancy. We need to have a second opinion. Besides which, the two of them make a good team. They work well together. They are probably three or four times as effective working together as either would be alone. And anyway, we\u0027re only a few years into a project that could take a century or more. It\u0027s way too early to think about risking our primary operating procedure and trusting the whole job to backups. What if the backup runs into trouble?\"\\n\\n \"All your points are well taken,\" said Governor Kresh. \"So-what are the precautions I should take in talking to them?\"\\n\\n \"Don\u0027t lose your temper if Unit Dee is condescending to you in some way. She doesn\u0027t really think you\u0027re real, after all. You are really nothing more than one of the game pieces, as far as she is concerned. Don\u0027t be thrown off if she seems to know a great deal about you, and lets you know it. Don\u0027t correct her if she gets something wrong, either. We\u0027ve made various adjustments to her information files for one reason or another-some deliberate errors to make it seem like a simulation, and others we set up for some procedural reason or another. Try to remember you\u0027re not real. That\u0027s the main thing. As for the rest of it, you\u0027ll be talking to her via audio on a headset, and I\u0027ll be monitoring. If there\u0027s anything else you need to know, I\u0027ll cut in.\"\\n\\n Governor Kresh nodded thoughtfully. \"Have you ever noticed, Dr. Soggdon, just how much of our energy goes into dealing with the Three Laws? Getting around them, trying to make the world conform to them?\"\\n\\n At first, the offhand remark shocked Soggdon. Not because she disagreed with his words-far from it-but because Kresh was willing speak them. Well, if the governor was in a mood to dabble with heresy, why not indulge in it herself? \"I\u0027ve thought that for a long time, Governor,\" she said. \"I think the case could be made that this world is in as much trouble as it is because of the Three Laws. They\u0027ve made us too cautious, made us worry too much about making sure today is like yesterday, and far too timid to dare plan for tomorrow.\"\\n\\n Kresh laughed. \"Not a bad line, that,\" he said. \"You might catch me stealing it for use in a speech one of these fine days. \" The governor looked from the Unit Dee Controller to the Unit Dum Controller, and then back up at Soggdon. \"All right,\" he said. \"Let\u0027s get this thing set up.\"\\n\\n \"GOOOD MORRN-ING. GOVVVENORR Kressh.\" Two voices came through the headphone to address him in unison-one a light, feminine soprano, the other a gravelly, slightly slurred, and genderless alto. They spoke the same words at the same time, but they did not synchronize with each other exactly.\\n\\n The voices seemed to be coming from out of nowhere at all. No doubt that was an audio illusion produced by the stereo effect of the headphones, but it was nonetheless disconcerting. Alvar Kresh frowned and looked behind himself, as if he expected there to be two robots there, one standing behind each ear. He knew perfectly well there would be nothing to see, but there was some part of him that had to check all the same.\\n\\n The whole setup seemed lunatic, irrational-but the iron hand of the Three Laws dictated that there be some such arrangement. Kresh decided to make the best of it. \"Good morning,\" he said, speaking into the headset\u0027s microphone. \"I take it I am addressing both Unit Dee and Unit Dum?\"\\n\\n \"Thaat izz comect, Governorrr,\" the two voices replied. \"Somme vizzzitors finnnd iiit dissconcerrrting to hear usss both. Shalll we filllter ouut onne voice?\"\\n\\n \"That might be helpful,\" Kresh said. Disconcerting was far too mild a word. The two voices speaking as one was downright eerie.\\n\\n \"Very well,\" the feminine voice said in his left ear, by itself, speaking with a sudden brisk, clipped tone, a jarring change from what had come before. Perhaps she found it easier to speak without the need to synchronize with Unit Dum. \"Both of us are still on-line to you, but you will hear only one of us at a time. We will shift from one speaker to the other from time to time to remind you of our dual presence.\" The voice he heard was almost excessively cheerful, with an oddly youthful tone to it. A playful voice, full of amusement and good humor.\\n\\n \"This higher-pitched voice I hear now,\" Kresh said, \"it is Unit Dee?\"\\n\\n \"That is correct, sir.\"\\n\\n Suddenly the other voice, low-pitched, impersonal and slightly slurred, spoke into his right ear. \"This is the voice of Unit Dum.\"\\n\\n \"Good. Fine. Whatever. I need to speak with you both.\"\\n\\n \"Please go ahead, Governor,\" said Unit Dee in his left ear again. Kresh began to wonder if the voice-switching was some sort of game Unit Dee was playing, a way of putting him off his stride. If so, it was not going to work.\\n\\n \"I intend to,\" he said. \"I want to talk to you about an old project, from the period of the first effort to terraform this world!\u0027\\n\\n \"And what would that be?\" asked Unit Dee.\\n\\n \"The proposal to create a Polar Sea as a means of moderating planetary temperatures. I want you to consider an idea based on that old concept.\"\\n\\n \"Ready to accept input,\" said the gravelly, mechanical voice in his right ear. It was plain that very little effort had gone into giving Unit Dum a simulated personality. That was, perhaps, just as well. Kresh had the sense of talking to a schizophrenic as it was.\\n\\n \"Here is the idea. Assume that, in the present day, the existing Polar Depression were flooded, with inlets to the Southern Ocean provided by cutting a canal through the Utopia region on the eastern side of Terra Grande, and by redirecting the flow of the River Lethe in the west. Assume the work could be done very rapidly, within a few years\u0027 time.\"\\n\\n There was the briefest of pauses. \"This would cause a Polar Sea to form,\" Unit Dum went on. \"However, the concept is implausible. There is no way of performing such an enormous engineering task in any practical length of time.\"\\n\\n \"Even if we could do it, I\u0027m sure the collateral damage to existing ecosystems and property would be huge,\" said Unit Dee, clearly talking more to Unit Dum than to Kresh.\\n\\n \"Current projections show the issues of damage to ecosystems and property become moot in between two and two point five standard centuries,\" Unit Dum replied.\\n\\n \"Why do they become moot?\" Kresh asked, fearing the answer.\\n\\n \"Because,\" Unit Dee replied, her voice clearly unhappy, \"our current projection shows all ecosystems collapsing and all humans-the owners of the property-either dying or being evacuated from the planet by that time.\"\\n\\n Kresh was genuinely surprised. \"I was not aware that the numbers were that bad. I thought we at least had a chance at survival.\"\\n\\n \"Oh, yes,\" said Unit Dee. \"There is at least a chance human life will survive here. That is in large degree a matter of choice for your descendants. Human beings can survive on a lifeless, airless, sterile ball of rock if they choose to do so. If the city of Hades were domed over or rebuilt underground, and properly shielded, it could no doubt sustain a reduced population indefinitely after the climate collapses.\"\\n\\n \"But things are improving\"\u0027 Kresh protested. \"We\u0027re turning things around!\"\\n\\n \"So you are-for the moment, in localized areas. But there is little or no doubt that the current short-term improvements cannot be sustained and extended in the longer term. There is simply not enough labor or equipment to expand the zones of improved climate far enough, and establish them firmly enough, for them to be self-sustaining.\"\\n\\n \"And therefore there is no real point in worrying over ecological damage or property loss,\" Kresh said. \"Fine. Disregard those two points-or, rather, factor in the results of attempting to deal with them, of efforts to repair the damage.\"\\n\\n \"The calculation involves a near-infinite number of variables,\" said Unit Dum. \"Recommend a pre screening process to select range of near best-case scenarios and eliminate obviously failed variants.\"\\n\\n \"Approved,\" Kresh said.\\n\\n \"Even the prescreening process will take a few minutes,\" said Unit Dee. \"Please stand by.\"\\n\\n \"As if I had much choice,\" Kresh said to no one in particular. He sat there, looking from Unit Dee\u0027s smooth and perfect hemispherical enclosure to the boxy, awkward, hard-edged looking enclosure around Unit Dum. Dum\u0027s enclosure, or containment, or whatever, at least had the merit of looking like machinery. Dum looked like it did something, was hooked into things, made things happen. It was hardware and wires. It was solid, firmly attached to reality by power cables and datastreams. Dum was of this world.\\n\\n In many more senses than one, Dee plainly was not. She was sheltered from the rude outside universe. She was the smooth and perfect one, sealed off in her idealized containment enclosure that needed special treatment. Dee looked more like an abstract sculpture than a working robot. She looked liked something that was supposed to stand off, aloof, on her own, a divine being or magic totem to be consulted rather than a machine meant to do work. And was that so far off? Kresh glanced at Soggdon on the far side of the lab, pretending to be puttering around with something or other while she kept a nervous, unhappy eye on Kresh.\\n\\n Yes, indeed. Unit Dee had her acolytes, her priests, who ministered to her whims and did their best to rearrange the world to suit her convenience, who walked on eggshells rather than anger or upset the divine being on whom all things depended. Kresh thought suddenly of the oracles of near-forgotten legend. They had been beings of great power-but of great caprice and trickery as well. Their predictions would always come true-but never in the way expected, and always at an unexpected price. Not a pleasant thought.\\n\\n \"I believe we are ready to begin with the main processing of the problem,\" Dee said, her voice corning so abruptly into the silence that Kresh jumped ten centimeters in the air. \"Would you care to observe our work?\" she asked.\\n\\n \"Ah, yes, certainly,\" said Kresh, having no idea what she had in mind.\\n\\n The lights faded abruptly, and, flashing into being with the silence and suddenness of a far-off lightning strike, a globe of the planet Inferno appeared in the air between Kresh\u0027 s seat at the console and the enclosures for the two control units.\\n\\n The globe was a holographic image, about three meters in diameter, showing the planet\u0027s surface with greater precision than Kresh had ever seen. Every detail was razor-sharp. Even the city of Hades was clearly visible on the shores of the Great Bay. Kresh had the feeling that if he stepped up close enough to the globe and peered intently enough, he would be able to see the individual buildings of the city.\\n\\n Inferno was a study in blue ocean and brown-and-tan land, with a pathetically few dots and spots of cool and lovely green visible here and there on the immense bulk of Terra Grande. Kresh tried to tell himself that they were making progress, that it was something just that their efforts were on a large enough scale to be plainly visible from space. But he wasn\u0027t all that convincing, even to himself. Somehow, over the last few days, it had come home to him that the great efforts they had made were as nothing, that the noble progress he had been so proud of scarcely represented forward movement.\\n\\n But he did not have time to consider long. The globe turned over on its side, so that the northern polar regions were facing Kresh directly. Then, as he watched, the landscape began to change, shift, mutate. The River Lethe, a thin blue line running from the mountains west of the Great Bay, suddenly widened, and a new line of blue began to cut its way toward the Polar Depression, until the combined canal and river cut through the length of Terra Grande. Yes, Kresh could see it. Dredge the canal deep enough to allow a flow into the upper reaches of the Lethe, takes steps to make sure the channel scoured itself deeper instead of silting over, and it would work. Water would flow from the Polar Sea into the Great Bay. Assuming there was a Polar Sea, of course. At the present time, as shown in the simulation, there was nothing but dull white ice, a significant fraction of the planetary water supply locked up in the deep freeze where it could do no one any good.\\n\\n But Dum and Dee were far from done with their modeling. Kresh looked to the western regions of Terra Grande. It was plain that things were not quite so simple or straightforward there. Again and again, a wedge-shaped channel of blue water appeared. The northernmost portion of its channel constantly shifted position, widened, narrowed, expanded, contracted, vanished altogether for a moment and then reappeared somewhere else. Plainly, the two control units were searching for the optimum positioning of the channel.\\n\\n At long last the image settled down to a wide channel cutting straight north through the Utopia region. Kresh shook his head and swore under his breath. The optimum channel the two control units had chosen followed almost exactly the same path Lentrall had shown him. Maybe the pushy young upstart did know what he was talking about.\\n\\n \"Channel pattern as presented within one percent of theoretical optimum configuration,\" Unit Dum announced. \"That figure is well inside accumulated combined uncertainty factors of many variables.\"\\n\\n \"In other words, it is as close as we can get right now-and very much close enough for a first approximation,\" said Unit Dee. \"We are now ready for preliminary long-range climate calculation.\"\\n\\n Kresh half-expected to see the planet\u0027s surface evolve and change, as he had seen so many times before on simglobes and other climate simulators. And he did see at least a little bit of that-or thought he did. But the globe itself was covered in a blizzard of layered data displays that sprawled over its surface. Isobar mappings for temperature, air pressure, humidity, color-coded scatter diagrams of populations for a hundred different species, rainfall pattern displays, seasonal jet-stream shifts, and a dozen other symbol systems Kresh couldn\u0027t even begin to recognize, all of them shifting, rising, dropping, interacting and reacting with each other, a storm of numbers and symbols that covered the planet. The changes came faster and faster, until the symbols and numbers and data tags merged into each other, blurred into a faintly flickering cloud of gray that shrouded the entire planet.\\n\\n And then, in the blink of an eye, it stopped. The cloud of numbers was gone.\\n\\n A new planet hung in the air before Kresh. One in which the old world could be clearly seen, and recognized, but new and different all the same. Alvar Kresh had seen many hypothetical Infernos in his day, seen its possible futures presented a hundred times in a hundred different ways. But he had never seen this Inferno before. The tiny, isolated, spots of green here and there were gone, or rather grown and merged together into a blanket of cool, lush green than covered half of Terra Grande. There were still deserts, here and there, but they were the exception, not the rule-and even a properly terraformed planet needed some desert environments.\\n\\n The sterile, frozen, lifeless ice of the northern polar icecap had vanished completely, replaced by the Polar Sea, a deep-blue expanse of life-giving liquid water. Even at this scale, even to Kresh\u0027s untrained eye, he could see that sea levels had raised worldwide. He wondered for a moment where the water had come from. Had the control units assumed that the importation of comet ice would continue? Or was the water-level rise caused by thawing out the icecaps and breaking up the permafrost? No matter. The fact was that the water was there, that life was there.\\n\\n \"That\u0027s the best, most positive projection I\u0027ve ever seen,\" Soggdon said. Kresh, a trifle startled, turned and looked over his shoulder. She was standing right behind his chair, gazing at the globe display in astonishment. \"Hold on. I want to do a blind feed of the audio to your headset.\"\\n\\n \"What\u0027s a blind feed?\" Kresh asked.\\n\\n Soggdon picked up a headset identical to the one Kresh wore. Soggdon looked to Kresh as she put them on. \"Dee and Dum will think you cannot hear what they say to me. When she talks to you, she is talking to a simulant. When she talks to me, a real human being, she cuts all links to any simulants, so as not to complicate the experiment by letting the simulants hear things they shouldn\u0027t. In reality you\u0027ll be able to hear it. But it is important-vitally important-that you have no reaction to what she says to me, or vice versa. In Dee\u0027s universe, you are just a simulated personality inside a computer. I am a real person outside the computer. You have no way of knowing I exist. Do you understand?\"\\n\\n \"Yes,\" said Kresh, hoping he did. He had the sense that he had stepped into a hall of mirrors. It was getting hard to tell the fantasies from the realities.\\n\\n \"Good,\" said Soggdon, and turned on the manual switch on her headset. \"Dee, Dum-this is Soggdon monitoring from outside the simulation.\"\\n\\n \"Good mornnning, Doctor. Weee havvve beeen connnversssing with the Kresh simulllannt. \" The two voices spoke in unison again, but Soggdon did not seem to be bothered by it. Having heard each voice by itself, Kresh was able to notice something that had escaped him before. When the two units spoke in unison, it was not merely the two chanting together. The voice of the two together spoke in a cadence that did not belong to either of the two speaking by itself. The unison voice made different word choices, responded in a way that was different from Dee or Dum. The unison voice was not merely two beings talking as one. It was the two merging into one new being, in some ways greater, in some ways lesser than the sum of its parts. Dee and Dum linked so intimately that they became a third, and distinct, personality. Or was it merely Dee who did so? If Dum was truly nonsentient, then he could have no personality. Plainly there were mysteries to delve into-but just as plainly they would have to wait for another day. \"The Kresh simulant asked us to consider the result of producing a Polar Sea.\"\\n\\n \"Yes, I know,\" said Soggdon. \"And I see you have produced an impressive planetary projection as a result. Would either or both of you care to comment on it?\"\\n\\n \"Both willl speeak, and then eachhh,\" said the unison voice. \"We havvve prrojected forward four ttthousand yearss, as we have found that a wellll-planned operrational sequenzzze will result in a zzzero-maintenance planetary ecologggy within apprrroximately three hundred years. In our projection, the planetary climmmate remainss intrinsically stable, selfffcorrecting, and self-enhancing throughout the period of the metasimulation. There is no apparent danger of recollapse evident in any of the data for the end of the metasimulation period.\"\\n\\n Kresh frowned. Metasimulation? Then he understood. The unison voice was using the term to refer to a simulation inside a simulation-which was what it had been, so far as Dum and Dee were concerned.\\n\\n Dum spoke next. \"Reference to unit Dum\u0027s prior objections in regard to ecological and economic damage. Projections show that the damage to the general ecology and gross planetary product caused by digging inlets for the Polar Sea would be fully compensated for within fifteen years of project completion.\"\\n\\n But if the first two aspects of the combined control system made it all seem wonderful, the third voice pulled everything back down to reality. \"It all sounds quite splendid,\" said Dee. \"There is, of course, the slight problem of it being quite impossible. We ran the metasimulation based on the assumption that it would be possible to dig the channels. It is not possible to dig them. An interesting exercise, I grant you-but it is not one that has a great deal of connection to the world of our simulation.\"\\n\\n \"I was afraid she was going to say that,\" Soggdon muttered as she switched off her mike. \"You\u0027d think she\u0027d be the least sensible of the three possible personality aspects, but instead Dee\u0027s always the one to stick the pin in the balloon. She always reminds us of the practicalities.\"\\n\\n \"Maybe this time they\u0027re a bit more possible than you think,\" Kresh said. He keyed his own mike back on, and tried to phrase things so that he would not reveal that he had overheard the conversation with Soggdon.\\n\\n \"Unit Dee, that\u0027s a very promising projection there. I take it you think creating the Polar Sea would be a good idea?\"\\n\\n \"It is a good idea that cannot be realized, Governor,\" said Unit Dee. \"You do not have the resources, the energy sources, or the time to construct the needed inlets.\"\\n\\n \"That is incorrect,\" Kresh said. \"It is possible there is a practical, doable, way to dig those inlets. I came here to have you evaluate the proposed procedure. I first wanted to see if the effort would be worthwhile. I see now that it would be.\"\\n\\n \"What is the procedure in question?\" asked Unit Dee.\\n\\n Kresh hesitated a moment, but then gave up. There was no way to describe the idea that didn\u0027t sound dangerous, desperate, even insane. Well, maybe it was all three. So be it. \"We\u0027re going to break a comet up, and drop the fragments in a line running from the Southern Ocean to the Polar Depression,\" he said. Even as he spoke, he realized that he hadn\u0027t put any modifiers or conditionals in. He hadn\u0027t said they might, or they could, or they were thinking of it. He had said they were going to do it. Had he made up his mind without knowing it?\\n\\n But Dum and Dee-and Soggdon-plainly had more on their minds than Kresh\u0027s reaction to his own words. There was dead silence for a full thirty seconds before any of them reacted. The perfect holographic image of the Inferno of the future flickered and wavered and almost vanished altogether before it resolidified.\\n\\n Unit Dee recovered first. \"Am I to under-under-understand that you intend this as a serious idea?\" she asked. The stress in her voice was plain, her words coming out with painful slowness.\\n\\n \"Not good,\" said Soggdon, her headset mike still off. She turned toward a side console, paged through several screenfuls of information, and shook her head. \"I warned you she took her simulants seriously,\" she said. \"These readings show you\u0027ve set off a mild First Law conflict in her. You can\u0027t just come in here and play games with her, make up things like that.\"\\n\\n Kresh cut his own mike. \"I\u0027m not making things up,\" he said. \"And I\u0027m not playing games. There is a serious plan in motion to drop a fragmented comet on the Utopia region.\"\\n\\n \"But that\u0027s suicidal!\" Soggdon protested.\\n\\n \"What difference does it make if the planet\u0027s going to be dead in two hundred years?\" Kresh snapped. \"And as for Dee, I suggest it is time you start lying to her in earnest. Remind her it\u0027s all a simulation, an experiment. Remind her that Inferno isn\u0027t real, and no one will be harmed.\"\\n\\n \"Tell her that?\" Soggdon asked, plainly shocked. \"No. I will not feed her dangerous and false data. Absolutely not. You can tell her yourself.\"\\n\\n Kresh drew in his breath, ready to shout in the woman\u0027s face, give her the dressing-down she deserved. But no. It would do no good. It was plainly obvious that she was not thinking with the slightest degree of rationality or sense-and he needed her, needed her help, needed her rational and sensible. She was part of the team that had set up this charade. She was the one who would have to prop it up. He would have to reason with her, coolly, calmly. \"It would do no good for me to tell her any such thing,\" he said. \"She thinks I\u0027m a simulant. Simulants don\u0027t know they are simulants. She would not believe me telling her there was no danger-because she does not believe me to be human. And she does not believe that because you have lied to her.\"\\n\\n \"That\u0027s different. That\u0027s part of the experiment design. It\u0027s not false data.\"\\n\\n \"Nonsense,\" Kresh said, a bit more steel coming into his voice as the gentleness left it. \"You have set up this entire situation for the sole purpose of allowing her to take risks, to do her job, while believing she could no harm to humans.\"\\n\\n \"But-\"\\n\\n Kresh kept talking, rolling right over her protests. \"I could even do damage to her if I told her it was just a simulation. There must be some doubt in her mind as to whether her simulants-the people of Inferno-are real. Otherwise she would not be experiencing the slightest First Law conflict concerning them. If I assured her that I was not real, Space alone knows what she would make of that paradox. It seems to me as likely as not that she would reach the conclusion that I was real, and that I was lying to her. If I lie to her, she might realize the truth-and then where would you be, Dr. Soggdon? Only you can do it. Only you can reassure her. And you must do it.\"\\n\\n Soggdon glared at Kresh, the anger and fear plain on her face as she switched on her mike again. \"Dee, this is Dr. Soggdon. I am still monitoring the simulation. I am detecting what appear to be First Law conflicts in the positronic pathing display. There is no First Law element to the simulated circumstances under consideration.\" Soggdon hesitated, made a face, and then spoke again. \"There is absolutely no possibility of harm to human beings,\" she said. \"Do you understand?\"\\n\\n There was another distinct pause, and Kresh thought he detected another, but much slighter, flicker in the image of the Inferno that was to be. But then Dee spoke again, and her voice was firm and confident. \"Yes, Doctor Soggdon. I do understand,\" she said. \"Thank you. Excuse me. I must return to my conversation with the simulant governor.\" Another pause, and then Dee was speaking to Kresh. \"I beg your pardon, Governor. Other processing demands took my time up for the moment.\"\\n\\n \"Quite all right,\" Kresh said. Of course, Dee was no doubt linked to a thousand other sites and operations, and probably having a dozen other conversations with field workers right now. It was not quite a little white lie, but it was certainly close enough to being one. Robots were supposed to be incapable of lying-but this one was clever enough to manage a truthful and yet misleading statement. Dee was a sophisticated unit indeed.\\n\\n \"Can you tell me more about this...idea under discussion?\" Dee asked him.\\n\\n \"Certainly,\" said Kresh. \"The idea is to evacuate everyone from the target area, and provide safeguards for the population outside the target area.\" It could not hurt to emphasize safety procedures first off. Let her know that even the fictional simulants would be safe. They needed as many defenses as possible against a First Law reaction. \"Once that is accomplished, a large comet is to be broken up and the fragments targeted individually, the overlapping craters running through existing lowlands. More conventional earth-moving will no doubt be required afterwards, but the linked and overlapping craters will form the basis for the Utopia Inlet.\"\\n\\n \"I see,\" Dee replied, her voice still strained and tense. \"Unit Dum and I will require a great deal more information before we can evaluate this plan.\"\\n\\n \"Certainly,\" said Kresh. He pulled a piece of paper out of his tunic and unfolded it. \"Refer to network access node 43l3, identity Davlo Lentrall, subgroup 9l9, referent code Comet Grieg.\" Lentrall had given him the access address earlier. Now seemed the moment to put it to good use. \"Examine the data there and you will be able to do your evaluations,\" said Kresh.\\n\\n \"There is no identity Davlo Lentrall on access node 43l3,\" Dee said at once.\\n\\n \"What?\" said Kresh.\\n\\n \"No one named Davlo Lentrall is linked into that access node,\" said Dee.\\n\\n \"The number must be wrong, or something,\" said Kresh.\\n\\n \"Quite likely,\" said Dee. \"I\u0027m going to hand off to Dum. He is directly linked to the network in question and can perform the search more effectively.\"\\n\\n \"There is no Davlo Lentrall on node 4313,\" Dum announced, almost at once, speaking in an even flatter monotone than usual. \"Searching all net nodes. No Davlo Lentrall found. Searching maintenance archives. Information on identity Davlo Lentrall discovered.\"\\n\\n \"Report on that information,\" Kresh said. How could Lentrall\u0027s files have vanished off the net? Something was wrong. Something was seriously and dangerously wrong.\\n\\n \"Network action logs show that all files, including all backups, linked to the identity Davlo Lentrall, were invasively and irrevocably erased from the network eighteen hours, ten minutes, and three seconds ago,\" Unit Dum announced.\\n\\n Kresh was stunned. He looked to Soggdon, not quite knowing why he hoped for an answer from that quarter. He switched off his mike and spoke to her. \"I don\u0027t understand,\" he said. \"How could it all be erased? Why would anyone do that?\"\\n\\n \"I don\u0027t know,\" she said. \"He used a term I\u0027m not familiar with in this context. Let me check.\" She keyed on her own mike again. \"Dum, this is Soggdon, monitoring. Define meaning of the term \u0027invasive\u0027 in present situation.\"\\n\\n \"Invasive-contextual definition: performed by an invader, an attack from the outside, the act of an invader.\"\\n\\n \"In other words,\" said Kresh, his voice as cold and hard as he could make it, \"someone has broken in and deliberately destroyed the files. \" He suddenly remembered what Fredda had said, about the things you thought you knew. She had said something about never really being sure about what you knew. Here it was, happening again. He had thought he knew where the comet was. Now he knew he did not. \"It would seem,\" he said, \"that someone out there agrees with you, Dr. Soggdon. They don\u0027t want anyone playing with comets.\" \\n\\n","sourceLink":"https://allnovel.net/utopia-isaac-asimov-s-caliban-3/page-11.html","bookId":1730,"book":{"id":1730,"title":"Utopia (Isaac Asimov\u0027s Caliban #3)","description":"Storyline: Utopia (Isaac Asimov\u0027s Caliban #3) \\n Third in a powerful trilogy that examines Asimov\u0027s Three Laws of Robotics--a challenge welcomed and sanctioned by Isaac Asimov, and written with his cooperation.\\n","cover":"https://allnovel.net/images/utopia-isaac-asimov-s-caliban-3.jpg","author":"Roger MacBride Allen","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/utopia-isaac-asimov-s-caliban-3.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:11:12 AM"}}
