{"id":68930,"no":2,"title":"Page 2","content":"Part 1 Impact Minus Sixty-Two 1 A BLINDING FLASH of light erupted in the depths of space, a massive explosion that blazed like a second sun. A cold, dark lump of matter, eighteen kilometers in diameter, was caught in the blast, and deflected toward a new heading, toward a slightly changed orbit. The power of the blast should have been enough to shatter the comet, but, somehow, it held together. The surface of the cometary body was heated by the explosion, and small pockets of volatiles boiled up and out, sending jets of gases flaring out across the darkness. The laws of action and reaction work equally well, whether or not the action is intentional. The jets of gas served as natural rocket thrusters, accelerating the comet in unexpected directions, throwing it off its carefully calculated course. But other jets flared almost at once, artificial ones that compensated for the uncontrolled thrust. The control thrusters had to fire more and more frequently as the comet moved in closer to the inner planets of the star system. It soon became plain that the comet was heading straight for a planet in the inner system, a world of blue and brown and tan, a world that was nearly all water in the southern hemisphere, and nearly all dried-out desert in the north. The comet fell in toward the planet, closer and closer. The comet warmed as it came in nearer to the star the planet orbited. Its surface began to boil and vaporize, gases and dust blowing off into space, forming up into a tail that stretched itself out behind the comet. The comet suddenly broke up. The fragments spaced themselves out into a neat line, like beads on a string. The fragments moved closer, closer to the planet. \"Move from time factor positive one hundred to positive factor ten time dilation,\" said a disembodied voice in the darkness. Time seemed to slow, the fragments suddenly moving at a fraction of their original velocity, easing themselves slowly down out of orbit. \"Give me a view closer to Inferno,\" the same voice commanded, and the image suddenly swelled in size. \"That\u0027s still way too fast. Time dilation to negative factor five,\" the voice ordered. Once again, the clock slowed down, but even so, events moved quickly. The comet fragments were moving with incredible speed as they slammed into the planet\u0027s upper atmosphere, and even with time slowed to a fifth its normal speed, it still took scant seconds for the fragments to force their way down through the atmosphere and slam into the planet. The largest fragment hit first, striking on land just north of the shoreline. The second crashed into the planet just north of the first, slamming into the peaks of a low range of hills. The other fragments struck, one after another, in a line running straight to the North Pole, blazing stars of light blooming for brief moments before they were engulfed in cloud and smoke, dust and debris \"It worked,\" the voice said. \"Freeze sequence at that point. Simglobe off. Room lights on.\" The image of the planet aflame died away, and the lights came up to reveal a perfectly ordinary living room in a perfectly ordinary residence. The only unusual object in the room was the highly sophisticated simglobe projector sitting in the center of the room. Davlo Lentrall walked over to the low, stubby cylinder that was the simglobe unit, and tapped the top of it with his finger. Not even the most advanced Settler models could do what this unit could do. He ought to know. He had designed and built it himself. He savored the satisfaction of the moment, and all the effort that had gone before it. It was his, all his. He had discovered the comet. In a rare burst of modesty, he had named it, not for himself, as called for by tradition, but for Chanto Grieg, the murdered governor who had spurred the reterraforming project that had saved the planet. Or at least bought the planet some time, so that Davlo Lentrall and Comet Grieg could finish the work that Chanto Grieg had begun. There was a symmetry there, a bit of poetry that would appeal to the historians. Posterity would remember Davlo Lentrall, no matter what the comet was called. Of course, there was no point in discussing such matters with his robotic assistant. Kaelor would only remind him of the things that were bound to go wrong. But Davlo could not let such a triumphant moment go without saying something. \"It worked,\" he said at last. \"Of course the simglobe works, Master Lentrall. It has worked every time you operated it. Why should it fail now?\" \"I meant the comet-capture, Kaelor, not the simulator.\" \"I must point out that you forced it to work,\" said the robot Kaelor. \"What, exactly, do you mean?\" Lentrall asked. Kaelor was a useful servant, but dealing with him required a good deal of patience. \"I mean, sir, that you are making a series of unwarranted assumptions.\" Davlo held back his temper, and forced himself to be patient. Kaelor had been designed and built to Davlo\u0027s custom specifications, the most important of which was to hold First Law potential to the lowest possible level when judging hypothetical situations. A lab-assistant robot with First Law set to the normally super-high levels of Infernal robots would have been utterly incapable of assisting him on the sorts of experiments Davlo was interested in. Even before he had stumbled across Comet Grieg, Davlo had been involved in Operation Snowball, a project that required the contemplation of a great many risky alternatives in order to find the safest way to proceed. There was scarcely a Three-Law robot on the planet who would have been willing to work on Snowball, let alone operate the simglobe to test ideas for bringing Comet Grieg in. Few robots would even be willing to help set up the problem, on the grounds that the simulation could pave the way for letting a real comet strike the real planet-which would be dangerous to humans in the extreme. Davlo had therefore ordered a custom-built robot for his Snowball work, and been glad to have him when he realized Grieg\u0027s potential. It had taken a lot of argument and discussion with the robot designer, an exceedingly conservative gentleman who was most reluctant to put the slightest restriction on First Law, but the result was Constricted First Law 001-CFL-001. Tradition and convention would have required Davlo to named CFL-001 something like Caefal, or Cuffle, or even, as one waggish colleague suggested, Careful. But none of those appealed to Davlo, and he had come up with Kaelor instead. But, either as a side effect of constricted First-Law potential, or merely as the consequence of the normal random subpathings of his positronic brain, Kaelor was also possessed of a dour, even depressive, outlook on life and the universe. \"What are these assumptions, Kaelor?\" \"You\u0027re assuming you can hold the comet together during the original guidance explosion,\" said Kaelor, \"and then assuming you can split it apart in precisely the manner you wish, exactly when you wish. Furthermore, you have not resolved the issue of solar heating and its effects. I also have doubts about your being able to control the comet\u0027s outgassing. You have also been quite arbitrary about the number of fragments needed for the job, and, finally, you have not dealt with the incredibly delicate timing and guidance control needed for final-phase targeting and atmospheric entry. Success requires a degree of precision in all these matters that I see no way of accomplishing.\" \"I am aware of all those problems,\" said Davlo. \"If we were only to begin after we had solved all the problems, we would never begin at all. But I have demonstrated that the basic plan will work. Or at least that it can. Now I just have to convince my superiors. But in my considered opinion, I have proved we can drop Comet Grieg onto Inferno, and save the planet.\" \"Granting your assumptions, I suppose you are right,\" the robot replied in dour tones. \"I only wonder if you can manage to do it without killing everybody.\" JUSTEN DEVRAY, COMMANDER of the Combined Inferno Police, sat in the unmarked and slightly battered aircar and watched the sun come up over parkland of idyllic green. He was tired. Deathly tired. But being tired was part of the job description on this duty. That was part of what he was here to learn. It had seemed like a very sensible theory, going around to every bureau of the Combined Infernal Police, getting a firsthand idea of the sort of police work he had never had the chance to do, back in the old days. It had, in fact, been Justen\u0027s own idea, and it was teaching him a lot. Now he knew for certain that stakeout duty was both duller and more exhausting than he had thought possible. And he was starting to suspect that a nice, soft office job had more to recommend than he had realized. Justen\u0027s unmarked aircar was parked a hundred meters or so away from the surface entrance to the vast underground complex known as Settlertown. The entrance itself was a mushroom-shaped arrangement, with a central pillar that contained the elevator shaft, and a wide, rounded, overhanging roof that spread out from the pillar to keep the weather off anyone waiting for a car down to the interior. The entrance shaft stood just inside the gate to the huge park the Settlers had built over their underground city. The landscaping of the park was all Settler work as well, of course, a demonstration of their skill in terraforming. But the design of Settlertown did not concern Justen Devray. The job of the officer on this stakeout was to keep on a watch on the people going in and out of Settlertown. There were, of course, other entrances to the vast series of artificial caverns and chambers below. The CIP had watches on those, as well. But the main entrance was the real prize, at least according to the CIP\u0027s intelligence unit. The big fish used the main entrance. Their ranks, or at least their cover stories, would demand it. More importantly, the amateurs used the main entrance. Everyone on both sides knew that all the entrances to Settlertown were watched, even the most rarely used ones. According to most theories of field operation, the best way to avoid being noticed was to use the busiest entrance, in hopes of getting lost in the shuffle. Sometimes it even worked. Especially now, at midmorning, there was a great deal of coming and going. It was far from simple to monitor it all. Something else for Justen to learn. There were, of course, plenty of legitimate reasons for people to go in and out of Settlertown, and lots of people, Spacer and Settler, who did indeed go in and out. But some fraction of that number had no good reason for being there at all. Those were the ones who gave the CIP stakeout its reason for being. The CIP never used the same car twice in a row for this stakeout job, even though the real professionals on the other side knew perfectly well they were being observed, and had no doubt gotten quite good at spotting the CIP\u0027s stakeout, no matter what car they were using. That was beside the point. However the CIP ran the stakeout, the pros in Settlertown would be able to spot them. But not so the amateurs, the dropins. Change the car often enough, routinely vary the spot where you parked it, and the odds were reasonably good that an amateur could go in and out a dozen times without being able to spot the surveillance car. Justen Devray shifted in his seat and tried to get a trifle more comfortable. He felt cooped up, hemmed in. He smiled to himself. It wasn\u0027t just the car that had him feeling a little bit trapped. It was the job. In the old days, Justen had run the Governor\u0027s Rangers, a service with the dual responsibility of enforcing the law outside the cities and managing a number of reterraforming projects. Even Justen was willing to admit it had been an awkward combination of responsibilities. A little under five years before, Alvar Kresh had reorganized the Rangers, leaving them with no other duties than their terraforming projects, and merging their law-enforcement commands with the City of Hades Sheriff\u0027s Department to form the Combined Inferno Police. Kresh had put Devray in charge of the new service. Justen had taken the job willingly enough, but there were plenty of times he regretted the decision. Running the planetary police more or less required him to live in the planetary capital, and Justen Devray could not get used to the city of Hades, or to city life in general. He often found himself wishing to be back in the Rangers, working on some conservation job or terraforming project out in high plains north of the city. Despite his desk work, Justen still had the tanned skin, tousled blond hair, and deep blue eyes to match that of an outdoorsman. The previous years out in the wind and weather had at least etched some character into his face, and life in the city had not erased any of it. Even so, he still looked unfashionably young, and one glance at him was enough to see he did not belong in a city. Although he felt as if he were very much on his own, Justen had company in the battered aircar. There were two robots with him. One was Gervad 112, his personal robot of some years standing. Gervad was a General Ranger Deployment robot, a GRD unit of the sort that had been general issue for the Rangers some years before. The other was a Security, Patrol, and Rescue robot, an SPR, more casually called Sapper 323. After the night when the previous governor, Chanto Grieg, was murdered with a whole squad of Sappers on guard around him, the model suddenly, and rather unfairly, had gained a bad reputation. What had happened to them could have happened to any model of robot. Still, no major security service was willing to use them any more. Justen hadn\u0027t even tried to hang on to the Rangers\u0027 SPRs. The rank and file did not trust them, and would not use them. As a result, most of the Sappers had been sold off at rock-bottom prices to all sorts of slightly disreputable organizations and people. That in turn meant that a Sapper made good camouflage. No one who saw Devray with a Sapper in tow was going to think he was a cop, let alone the most senior police official on the planet. The depressing fact was that the two robots could have done the watching just as well without Devray. Better, probably. However, it did not do to dwell on such matters. The plain fact of the matter was that humans were not really much needed for most kinds of work. \"The male subject in red pants and blue tunic is not on my list of identified subjects,\" the SPR announced. The special features of the SPR design really shone in identity work. They were nearly as good as humans at visual pattern matching and comparison-or, to put it another way, at recognizing faces and people. And, of course, they had virtually infallible memories. When a Sapper said it recognized someone, or that it did not recognize something, it was best to take it seriously. Right at the moment it meant that someone who wasn\u0027t supposed to be going into Settlertown was doing just that. Justen Devray, suddenly wide awake and alert, peered through the forward windshield, eagerly trying to get a good look at the person in question. There was a knot of about ten or twelve people waiting for the next elevator car to arrive. \"Gervad,\" he asked his personal robot, \"do you know him?\" Gervad had the current official CIP mugshot file in his memory store. \"Sir, I have at least a tentative pattern match, but I am afraid that it seems rather an improbable one.\" \"Let me be the judge of that,\" said Justen, still trying to get a good look at the man in question. It wasn\u0027t easy, with the throng of people all around him. If the fellow actually had intelligence training, he would of course do his best to blend in. \"What\u0027s your pattern match?\" \"The observed subject matches with one Barnsell Ardosa, a junior researcher in astrophysics at the University of Hades. As it seems unlikely in the extreme that there would be much of interest to the Settlers coming from that source, I would suggest that I have likely made an inaccurate match.\" Justen was just about to agree with Gervad, but just then he finally spotted his quarry. There he was: a big, burly, round-faced man with dark skin. He was completely bald on the top of his head but had a thin fringe of snow-white hair that clung to the sides, thicker toward the back of his head, and fading out completely just forward of the ears. He had a bushy mustache and a distinctly worried look on his face. For just the briefest of moments, Ardosa-if it was Ardosa-seemed to be looking straight at Devray. And in that moment, Devray decided that Gervad should have more faith in his own pattern-matching skills. Justen Devray had never been near the university\u0027s astrophysics department. But Justen Devray was absolutely certain he had seen that face before. But the devil take him if he could figure out where. ALVAR KRESH, GOVERNOR of the Planet Inferno, glared up at the young man who stood at the other side of his desk. \"You\u0027re not helping your cause,\" he said. \"I told you that I would consider your proposal, and I will consider it. I have been considering it. But I am not going to be rushed into a decision. Not on something this big.\" \"There is no time to do anything but rush,\" his visitor replied, his voice urgent and insistent. \"We have lost time already. I ran my final simulations three days ago-and it has taken me that long to get in to see you. This is a danger, and an opportunity, far greater than you understand. Perhaps greater than you can understand.\" \"What a tactful thing to say to the governor of the planet,\" said Kresh, his tone of voice as sour as his words. \"But even if comprehending it is beyond my poor abilities, I suppose that you are capable of seeing the big picture?\" \"I beg your pardon, sir. I didn\u0027t mean to put it that way,\" said Davlo Lentrall, coloring just a bit. \"No,\" Kresh said tiredly, \"you probably didn\u0027t.\" He sighed, and considered his visitor with the practiced eye of an ex-policeman. Lentrall was dark-skinned and lantern-jawed, with an angular face and intense dark-brown eyes. His hair was jet black and cut short enough to stand up straight. Height average, build medium. Then Kresh reminded himself that he wasn\u0027t a policeman anymore, but a politician, and he needed to judge the fellow\u0027s character, not note his physical description. It was plain to see the salient factor in Lentrall\u0027 s personality: he was young, with all the brazen self-confidence of youth. Perhaps other cultures, Settler cultures, might regard youth as attractive, or let youthful zeal serve to excuse a multitude of sins. But Spacer culture was old, and its ways were old. Most of its people were old as well. For the average citizen, the exuberance and passion of youth was, at most, a distant, and slightly distasteful, memory, and Lentrall was a walking reminder of why that was. Brashness, impetuosity, and arrogance rarely won any friends. But there was some possibility that the message Lentrall carried was important, no matter how annoying the messenger might be. \"Let\u0027s both back off on this, just for the moment,\" Kresh said. \"We\u0027re not getting anywhere anyway.\" Lentrall shifted uncomfortably on his feet. He seemed to debate the idea of protesting again, and then think better of it. \"Very well, sir,\" he said. \"I-I apologize for my outburst. It\u0027s just that the strain of all this, the thought that the survival of the planet might be in my hands-it\u0027s a lot to deal with.\" \"I know,\" Kresh said, his voice suddenly gentle. \"I know it very well. I have been living with just that thought for years now.\" Once again, Lentrall reddened a bit. \"Yes, sir. I know you have. It\u0027s just the idea of letting this chance slip away. But even so, I shouldn\u0027t have presumed to, to-\" \"That\u0027s all right, son. Let\u0027s just leave it there. We\u0027ll talk again in a few days. In fact, tomorrow. Come in tomorrow morning. I will bring my wife, and you can give the full presentation to both of us. I would very much value her opinion on all this.\" And that was true for more reasons than he would care to share with young Dr. Lentrall just at the moment. \"Yes, sir. I\u0027ll do that. Tomorrow, first thing. Would ten be all right?\" \"That would be perfect. Donald, get the door for our guest, will you?\" \"Of course, sir.\" Donald 111, Kresh\u0027s personal robot, stepped out of his wall niche and walked smoothly across the floor. He led Lentrall to the door, activated the door controls, and watched Lentrall leave. Donald was a short, rounded-off sort of robot, all smooth curves and no hard edges, quite specifically designed to be as nondescript and nonthreatening in appearance as possible. He was sky-blue in color, the sky-blue of the old Hades Sheriff\u0027s Department, a hold-over from the days when Kresh was the sheriff of the city-and there was a sheriff. Perhaps Kresh should have had Fredda recoat him in some other color. But Kresh liked the reminder of those days, when he had dealt with problems a lot smaller than the ones he had now-even if they had seemed quite large enough at the time. Donald closed the door after Lentrall and turned back to face Kresh. \"Your opinion, Donald?\" \"Of what sir? The message, or the man who delivered it?\" \"Both, I suppose. But start with the messenger. Quite a determined young man, isn\u0027t he?\" \"Yes, sir. If I may say so, he puts me in mind of what I know of your own early days.\" Kresh looked toward Donald suspiciously. \"What do you know about my early days?\" he demanded. \"How could you know about them? You weren\u0027t even built until after I was sheriff.\" \"True enough, sir, but you have been my master for many years now, and I have made you my study. After all, the better I know you, the better I can serve you. I have examined all the extant records regarding you. And, unless every record is misleading or inaccurate, that young man there bears a striking resemblance to the man you were at his age.\" \"Donald, that comes dangerously close to being sentimental.\" \"I trust not, sir. I do not have any of the emotional overlay protocols needed to experience sentimentality. Rather, I have merely stated an objective opinion.\" \"Have you indeed?\" Kresh asked. \"Well, if you have, it is a most disconcerting one.\" Kresh stood up and stretched. It had been a long day, and Lentrall had given him a lot to think about. \"Come on, Donald, let\u0027s go home.\" \"Yes, sir.\" Donald turned back toward the door, unlocked it, and reopened it. He led Kresh and out of the office, down the hallway, and over to the governor\u0027s private elevator. The elevator door opened, and man and robot stepped into it. The door closed behind them, and carried them up toward the roof of Government Tower, where Kresh\u0027s private aircar waited in a secured hangar. There were actually two landing pads on the roof-a smaller one on the very apex of the building, for the use of the governor only, and a larger one about fifteen meters lower down. The governor\u0027s private landing pad had been added after the Grieg incident, by the simple expedient of building a ten-meter-wide, hollow stresscrete-and-steel pillar in one corner of the existing landing pad. The builders then put a flat disk thirty meters across atop of the pillar and used heavy buttressing to reinforce it. There was a small observation post built into the pillar itself, about ten meters above the original landing pad. The CIP used it as a sort of control tower for the main landing area. Locked doors, private elevators, secured hangars, controlled-access landing pads. Kresh brooded over it all as they rode up in the elevator. Sometimes it seemed to Kresh that the walls between him and the world he was supposed to be governing were impossibly high. How could he run the planet if the whole system conspired to keep him cut off from it all, in the name of his own safety? On the other hand, his immediate predecessor had been murdered in cold blood. The were reasons for the walls, the barriers that were everywhere. Even the roof had walls. The elevator doors opened, and Kresh stepped out onto his private rooftop landing pad, warmed by an evening sun. But instead of walking toward the hangar, he went over to the edge of the platform. A low wall, about one hundred thirty centimeters tall, surrounded the landing pad. Like just about everything else on this planet, it was intended as a safety measure, but it also just happened to be the right height for Kresh to fold his arms on top of the wall, rest his chin on his forearms, and think. He could lean on the wall and look out over the world, and think his own thoughts undisturbed. Not completely undisturbed, of course. That never happened. Not on a Spacer world. Kresh could hear Donald behind him, moving in close to protect Kresh against whatever imaginary danger the robot might choose to worry about: the wall giving way, an impossible gust of wind blowing in some inconceivable direction and sucking Kresh up into the air before throwing him clear of the edge of the building, Kresh suddenly giving way to some long-hidden-and completely imaginary-urge to self-destruction and deciding to fling himself over the edge. There was no end to the dooms and dangers a Three-Law robot could imagine. And that, of course, was part of the problem. But don\u0027t worry about it now. Take now, take the moment, and look out at the city of Hades, at the sky, at the world. Alvar Kresh looked out over the world he governed, the world put into his keeping. Kresh was a big, burly, broad-shouldered man with a strong-featured, expressive face. He was light-skinned, with a thatch of thick white hair that stood up bottle-brush straight from his head. There were times when he started to think the years were catching up with him, and the thought did flit through his mind tonight-no doubt inspired by Donald\u0027s comparison of Lentrall with Kresh the younger. Had he, Kresh, ever been that prickly, that pushy, that sure of himself when there was no good reason to be sure? No, he told himself. Let that go, too. Let it all drift away, to be caught by the wind and carried to the far horizon. Let the office and the duties and the worries go, and just look. Just look, and see. For, in truth, there was much worth seeing. The planet Inferno had come a long way in the five years Kresh had been governor-and Kresh took no small measure of pride in knowing that he had some fair-sized part in making that true. He took a deep breath, and the air was cool and sweet, fresh and alive. When Kresh had taken office, the city of Hades had been all but literally on the verge of drying up and blowing away, The deserts had been spreading, the plants dying, the flower beds and gardens covered with the dust that blew into town with every gust of wind. But now the deserts were retreating, not advancing. At least here, at least around the city, they were beating back the desert. Now the breeze carried the scents of life, of green things and freshness. Now he could look out and see green where once there had been brown and ocher. Now the city of Hades, and the land around it, were coming back to life. The price had been high, there was no doubt of that. For five years now, the people of Inferno had been enduring restrictions on the use of robots that would have been unimaginable on any other Spacer world. But the planet of Inferno, the world itself, had had more need of that robot labor than its people did. Kresh\u0027 s predecessor, Chanto Grieg, had drafted a large fraction of Inferno\u0027s robotic population into government service. He had taken robots away from household duties and put them to work on terraforming and reclamation projects. Robots that had served as assistant cooks and stand-by drivers, robots that had served no other function than to wait until someone wanted to enter or leave a room, and then push the button that activated the automatic door, robots that had been wasted on the most menial and absurd of tasks, suddenly found themselves planting trees, operating earth-moving equipment, hand-pollinating flowers, and raising fish and insects and mammals to be released into the wild. To this very day, there were those who moaned and complained about the terrible hardships imposed by the robotic labor laws. But it seemed there were fewer and fewer such complainers as time went by. People were getting used to the idea of living with fewer robots. People had discovered-or rediscovered-the pleasure of doing things for themselves. Things were changing, and changing for the better. The question was-would the change be enough? Kresh knew that the fate of the planet was still balanced on a knife edge. Locally, things might be improving. But from a global perspective, thing were... No. Never mind. Worry about it all later. Lentrall\u0027s idea had-had disturbed him. No question about it. He needed to hear what Fredda would say about it. Kresh turned away from the view of the city, and headed toward his aircar. \"Come on, Donald,\" he said again, \"let\u0027s go home.\" IT WAS LUCKY. Kresh told himself as Donald flew him home, that Spacers had a long tradition of respecting each other\u0027s privacy, and of defending their own. Otherwise, the scandalous nature of his own domestic arrangements might well have brought a thunderstorm of controversy down upon his head. To get the worst of it over with first, Alvar Kresh and his wife, Fredda Leving, lived together, and maintained only one household. In the typical Spacer marriage, husband and wife each had their own household, and spent a large fraction of their time apart from each other. It was more or less expected that newlyweds would spend an inordinate amount of time together, but the typical pattern was for a couple to spend less and less time together as the years went by. A couple who had been married some years might see each other once a week, or once a month. Some older marriages didn\u0027t so much end as wear out; the two partners might never see each other at all, from year\u0027s end to year\u0027s end. While divorce was simple enough on Inferno, many couples couldn\u0027t even work up the energy to go through the legal motions. They stayed married out of sheer inertia. Alvar Kresh had discovered, much to his own surprise, that his own marriage was not corning anywhere close to following any such pattern. Three years after their wedding, he and Fredda still spent every night not only under the same roof but, even more scandalously, in the same room-and the same bed. While there was nothing seen as actually wrong or immoral in such an arrangement, it was most unusual in Infernal society. If it had gotten around, the good people of Inferno would Rave thought their governor and his wife most peculiar. And that in itself was strange, in Kresh\u0027 s mind, at least. He stared out the window, at the green and lovely city below, reflecting once again on the peculiar ways of his own people. Infernals prided themselves on being quite open-minded when it came to questions of personal relationships. And so they were-at least in theory. But Kresh had learned, over the years, that while their minds might be open to the idea of most sorts of physical relationships, their hearts were far less prepared to deal with the idea of emotional intimacy. The idea, the theory, of sex was something an Infernal could deal with. The fact, the reality, of sex would bring a blush to an Infernal\u0027s face, but he or she could at least countenance such a thing. The idea of love was something most could not deal with at all. Infernals were Spacers, and Spacers had always been a people who kept their distance, physical and emotional, from each other. At least Infernals had never gone to the extremes of some Spacer worlds, worlds that had no real cities, no towns, no villages, only widely scattered villas, with one human and an army of robots making up the average household. But Infernals were not exactly a gregarious people. That Kresh and Fredda slept together on occasion would be seen as perfectly acceptable. That they slept together every night, in the same bed, would be seen as a trifle odd. That they had their meals together, spent their free time together, and were in each other\u0027s company as much as possible-that would be seen as quite beyond the pale. Infernals simply did not open up to each other, expose themselves to each other, that way. They did not make themselves vulnerable to each other. More fools they, Kresh told himself. They would never know the strength, the confidence, the sense of security that Fredda gave to Kresh. He could only hope he gave as much to her. Kresh knew the Infernals, and what they would say if they knew. He knew how the idea would float up from somewhere that his unconventional home life made him unsuited to continue as governor, or that Fredda obviously had an undue influence on him. Even as it was, they said she was far too young for him-and Infernals were suspicious of youth. They said she was entirely too cozy with the Settlers. Simcor Beddle, leader of the Ironheads, was never reluctant to put that notion about at one of his mass meetings-and there was at least a grain of truth in it. Fredda did tend toward the Settler view on a number of subjects. Beddle was already leading a whispering campaign, putting it about that her radical ideas were dangerous. But then, Kresh was inclined to believe that himself. Fredda and he had some remarkably vigorous arguments on the subject of robots, among other things. If Kresh had been a private citizen, he would not have much cared if the rest of the universe knew every detail of his domestic arrangements. But the last thing he needed at this point was for his personal affairs to become an issue. Better, far better, to keep such matters well away from the public eye and avoid the talk in the first place. Kresh paid lip service to the conventions. He maintained-but did not use-fully staffed and equipped living quarters at Government Tower. The only time he put them to use was after official entertainments of one sort or another. At such times, he would make a show of retiring to his own private rooms in Government Tower at the end of the evening, long after Fredda had gone home to \"her\" house. Sometimes, if the hour was very late, they would actually spend the night apart, but, more often than not, Donald would end up secretly flying one of them to where the other waited. All of it was quite absurd. But better such nocturnal charades than the poisonous gossip that would result if the story got around that Alvar Kresh was passionately in love with his wife. Kresh remembered arguing with Chanto Grieg, just hours before Grieg\u0027s death. Grieg had tried to explain to Kresh how the job of posturing, of pretending, of smoothing over, was vital to the job of governance, that he could not get to his real work until all the nonsense had been dealt with. Kresh had not quite believed it then-but he had learned the truth of it since. Simcor Beddle had taught him that much. Kresh had learned the hard way that he could do nothing unless he first neutralized the Ironheads. The Ironheads. Kresh smiled to himself as he imagined what Beddle and his crew could do with the news if they discovered everything about the goings-on at the Kresh-Leving household. There were things more shocking than romance. For the sake of domestic harmony, Kresh himself spent a lot of time pretending he knew less than he did about what went on when he was away from home. Best if he could pretend he did not know all about the meetings of subversive robots taking place in his own house. It was bad enough that he himself knew. But if Beddle ever found out-oh, yes, there was need enough for privacy. There was a change in sound of the aircar\u0027s engine, and Kresh came back to himself as the car banked smoothly to one side and eased down out of the sky. He blinked and looked toward the front of the craft, out the forward viewport. There it was. There was home. The aircar settled in for a landing. FREDDA LEVING STOOD up from her chair and looked across the table at the two robots. \"It would be best if you both were going,\" she said. \"My husband will be home at any moment.\" The smaller of the two robots, the jet-black one, rose from his chair and regarded his hostess thoughtfully. \"Surely your husband is aware that we meet here with you.\" \"Of course he is,\" she said. \"But it is best for all concerned that we do not rub his nose in it.\" \"I do not understand,\" said the black robot. He was Prospero, self-proclaimed leader of the New Law robots. He was a gleaming metallic black, about a hundred eighty centimeters tall, with the solid, heavy-set body design common to many of the New Laws. His eyes glowed a deep, burning orange that seemed to make his personality all the more intense. \"If he knows we come here, why conceal it from him?\" \"I do not understand why you ask questions to which you already know the answer,\" Fredda replied. Prospero swiveled his head about to glance at his companion and then swung abruptly back toward Fredda. \" Do I know the answer?\" he asked in a suspicious voice. The larger of the two robots stood as well, and looked toward his companion. \"There are times, friend Prospero,\" said Caliban, \"when I believe that you quite deliberately play at being ignorant. The governor wants no contact with us. He tolerates, but does not approve of, these meetings. The less we bring them to his official attention, the more likely they are to continue.\" Caliban stood over two meters tall, his body metallic red in color, his eyes a penetrating glowing blue. His appearance was striking, even intimidating, but far less so than his reputation. Caliban the Lawless, they still called him, sometimes. Caliban, the robot accused, but cleared, of attempting the murder of his creator-of Fredda Leving herself. Prospero regarded his companion for a moment before he replied. \"The need for discretion,\" he said. \"Yes, I have heard that answer before. But I am far from sure that I know it is the true answer.\" \"And what purpose would it serve for me to lie to you?\" Caliban asked. For a Three-Law robot, the very idea of lying would be difficult to imagine, but Caliban was a No Law robot, and, in theory at least, just as able to lie as any human. \"Perhaps you would have no purpose in lying,\" Prospero said, looking back toward Fredda. \"But others might well have reasons to deceive you.\" \"You are not at your most tactful today,\" said Fredda. \"And I must confess I don\u0027t see why our perfectly true answers should not satisfy you. Nor can I see what motive I would have for lying to you and Caliban.\" \"I might add that I do not understand your motive for offending our principal benefactor,\" said Caliban. Prospero hesitated, and looked from one of them to the other. \"My apologies,\" he said at last. \"There are times when my understanding of human psychology fails me, even when I am attempting to learn more. I was attempting to gauge your emotional reaction to such an accusation, Dr. Leving.\" \"I would have to believe in the sincerity of the accusation before I could have much of a reaction to it,\" said Fredda. \"Yes,\" said Prospero. \"Of course.\" But if Fredda Leving was sure of anything at that moment, she was sure that Prospero had not given her all of the story-and perhaps had not given her any of the true story. But what motive would Prospero have for playing such a strange game? It was rare indeed when she felt completely sure that she understood Prospero. She had long known he was one of her less stable creations. But he was the undisputed leader of the New Law robots. She had no real choice but to deal with him. \"In any event,\" said Caliban, \"it is time for us both to be leaving. I have no doubt, Dr. Leving, that we shall all meet again soon.\" \"I look forward to it,\" said Fredda. The jet-black robot regarded first Fredda, and then Caliban. \"Very well,\" he said. \"We will depart. But I doubt that I will be the first or last robot to observe that the more I know about humans, the less I understand them.\" Fredda Leving sighed wearily. There were times when it was frustrating in the extreme listening to Three-Law robots holding forth on the subject of human behavior. Prospero and the other New Laws were even worse. At least Three-Law robots were not judgmental. Prospero had an opinion about everything. Fredda could almost imagine him as the last priest of some long-forgotten human religion, always ready to debate any intricate point of theology, so long as it was of no interest or importance to anyone at all. There were times Caliban was no better. She had designed and built both of these robots by herself. Surely she could have designed their brains so they didn\u0027t spend their days logic-chopping. But it was too late now. \"Whatever you think of my reasons for doing so,\" she said, \"I must ask you again to leave, by the back way. Our next appointment is in three days, is it not?\" \"Yes,\" said Prospero. \"We have several other appointments that will take up the intervening time.\" \"Fine then. Return in three days, in the afternoon, and we will conclude our business.\" Caliban nodded his head toward her, in what was almost a bow. \"Very well,\" he said in a most courteous tone. \"We will see you at that time.\" Prospero took no interest in courtesy. He simply turned, opened the door, and left the room, leaving all the farewells to his companion. Caliban had to hurry just to keep up with him. Fredda watched them go, and found herself once again wondering about Prospero. She did not understand what went on behind those glowing eyes. There was something not quite right about a robot that-that secretive. She shook her head as she crossed the room. Not much point in worrying about it now. She sealed the door shut behind them and scrambled the keypad. Only she and Caliban and Prospero knew the door\u0027s keypad combination. And there were times she thought seriously about taking at least one name off that list.","sourceLink":"https://allnovel.net/utopia-isaac-asimov-s-caliban-3/page-2.html","bookId":1730,"book":{"id":1730,"title":"Utopia (Isaac Asimov\u0027s Caliban #3)","description":"Storyline: Utopia (Isaac Asimov\u0027s Caliban #3) Third in a powerful trilogy that examines Asimov\u0027s Three Laws of Robotics--a challenge welcomed and sanctioned by Isaac Asimov, and written with his cooperation.","cover":"https://allnovel.net/images/utopia-isaac-asimov-s-caliban-3.jpg","author":"Roger MacBride Allen","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/utopia-isaac-asimov-s-caliban-3.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:11:12 AM"}}
