{"id":68934,"no":6,"title":"Page 6","content":"5\n \"HE\u0027S GOING IN... Cinta Melloy announced into the audio-only handset as she stared out the window. The watch team, and the snatch team on standby, were both listening. She shook her head worriedly as she watched the CIP transport setting down on the roof. And there went Devray off the rooftop pad, just as the transport set down. \"Our young man is going in the front door, the head of the competition has just left, and his friends are just setting down topside. \" Even as she spoke, she realized that she was being too cryptic. This operation had been so rushed there had been no time to set up code names or communications shorthand. Better to be clear about what she was saying and avoid screwups. She spoke again. \"Lentrall has just gone in. I just spotted Devray\u0027s aircar leaving-and what looks like a full CIP security team has just landed on the roof. I think they\u0027re going to start baby-sitting Lentrall here and now.\"\n There were risks in speaking in clear, of course, but she was sure-at least moderately sure-that the Combined Infernal Police hadn\u0027t tapped this comm system yet. They were getting much better at counterintelligence, but it was by no means easy to detect, let alone tap, a concealed hardwire line.\n Of course, the CIP knew about this watch-keeping station, right across the street from Government Tower, just as the Settlers knew all about the CIP watch kept on the main entrance to Settlertown. That was all part of the game. But knowing which office held the watch-keeping station was a far cry from locating the hard-wire line and tapping it without being detected.\n \"If they start covering Lentrall now that\u0027s not so good,\" replied a voice at the other end of the line.\n Cinta Melloy realized she should not have been surprised that Tonya Welton was monitoring. But she was worried by just how involved in this operation Tonya Welton was getting. Most of the time, Welton kept far away from Cinta\u0027s SSS, and for good reason. No responsible leader wants to be too close to the people in charge of dirty tricks. But this case was different. Tonya was staying close. Too close.\n \"Stand by,\" Cinta said, and flipped switches that cut out the watch team and the snatch teams. \"We\u0027re private now, Madame Welton. Ma\u0027am, you really shouldn\u0027t speak when the operations people can hear you. You may have just blown away all our compartmentalization, assuming they recognize your voice.\"\n \"Let\u0027s worry about that later, shall we?\" Welton said, as if the question were of no importance whatsoever. \"What was that about baby-sitters?\"\n \"What looks like a full CIP protection squad landed on the roof just as Lentrall went inside. My guess is that they\u0027ll start on bodyguard duty the moment he comes out of the building.\"\n \"And it will be more or less impossible for us to grab him once they are in place,\" Tonya said.\n \"Yes, ma\u0027am,\" Cinta said, making no effort to hide the relief in her voice. She had wanted no part of this crazy operation.\n \"Then we better get to him before the bodyguards do,\" said Tonya. \"Go get him.\"\n \"What?!\" Cinta half-shouted.\n \"You heard me, Melloy. This is a direct order. Get him as he comes out of the building. My best guess is that you have an hour or so to get your team ready. I suggest you get moving.\"\n THE DOOR OPENED smoothly enough that one could have been forgiven for thinking the person who entered had a right to be there. No forcing of the lock, no furtive gimmicking of the security electronics. Jadelo Gildern was not that clumsy a person. He slipped the device he had used on the door into his pocket and stepped into Davlo Lentrall\u0027s work office. He slid the door shut behind him and let out a small sigh. Gildern looked calm enough as he stood there and looked about the smallish room, but in truth the man was scared to death, his heart pounding so loudly in his chest that he felt sure it could be heard down the hallway.\n Gildern knew he was not a brave man. The risks he took and the dangers he faced in his security work were all, always and ultimately, for his own benefit, his own personal gain. Even if the routes he took to gain that benefit were sometimes labyrinthine, the final destination was always there, in sight. Whatever he did, he did for himself.\n And he would be very surprised indeed if this expedition to Lentrall\u0027s office did not do him a great deal of good-all the more good for his having first told Beddle it was extremely risky.\n In reality, there was very little risk at all. If Gildern had indeed gone after the computer data files, the odds of discovery and of capture would indeed have been fairly high. But the very fact that the data system security was so good played into Gildern\u0027s hands. Good security made people feel safe. People who felt safe relaxed. And people who were relaxed made mistakes.\n One such mistake was in assuming that good security in one area meant security in all the others was equally good. This assumption was often mistaken-as in the matter of the door lock Gildern had just gotten past. The computer security was good, so the physical security had to be good, so it was perfectly safe to leave books and papers and notes lying around, so long as the door was locked. Gildern had hoped that Lentrall\u0027s train of thought had worked that way, and it seemed as if it had. The on-line computer files would likely have been of very little use in any event. Gildern was no technician, no scientist. It would likely take so long to analyze a technical report that the moment would be lost. No. What he was after were papers he could photograph. He wanted scribbled notes, summaries prepared to explain things to outsiders. And if he got lucky, datapads chock full of information Gildern could download and take with him.\n The office was neat, but not so neat that it was a robot who had done the tidying. Gildern needed to look no further than the books on the shelf, slightly out of true with each other, than the papers that stacked up without being precisely squared up, than the way the chair sat in the middle of the floor instead of being shoved in neatly under the desk, for it to be instantly obvious to Gildern that Lentrall kept this room up himself. All to the good. If Gildern accidentally left something not precisely as he found it, it would more likely go unnoticed. And besides, if the man himself kept order here, the system of order itself might well tell Gildern something about the man.\n He set to work searching Davlo Lentrall\u0027s office.\n FREDDA LEVING WATCHED her husband enter the room, and saw how his expression changed the moment the door was sealed behind him. The look of calm imperturbability vanished, and a deeply troubled expression took its place. He looked to her, and seemed to understand what she had seen. He smiled, a bit sadly, a bit worriedly. \"I didn\u0027t used to be able to do that, back when I was just a policeman,\" he said. \"It used to be that I could let my face express whatever it wanted. Politics does strange things to a man.\"\n Fredda got off her chair and took her husband by the hand. \"I don\u0027t know whether I should be happy to see you drop the act in front of me, or upset to see that you put on an act at all,\" she said.\n \"Probably both,\" he said, a tone of apology in his voice.\n \"What was it Devray wanted to tell you?\"\n \"That our friends and our enemies-who mayor may not be the same people-probably already know most of what we\u0027ve been trying to keep secret from them.\"\n \"And from me.\" Fredda moved a step or two away from her husband, folded her arms, and perched herself on the corner of his desk. \"Maybe if they already know, you could finally break down and tell me what it\u0027s all about.\"\n Kresh started to pace, up and down the length of the office, his hands clasped behind his back-a rare but certain sign of anxiety and impatience. \"Where is the fellow?\" he asked of the open air, and then glanced toward his wife without breaking stride. \"It\u0027s not that I wanted to keep it secret from you. I just wanted you to hear it the same way I did. I wanted your opinion of-of it, without hearing about my biases or opinions, one way or the other.\"\n \"Well, you\u0027ve certainly managed to keep from telling me much. All I know for sure is that it could mean trouble for the New Law robots.\"\n Kresh stopped in his pacing and looked up at his wife again. \"It could mean trouble for everyone,\" he said. \"Ah, here\u0027s the man of the hour now.\"\n The door slid open, and a young, energetic-looking young man came in, accompanied by a very ordinary-looking dun-colored robot of medium height and build. The robot immediately took up a position in one of the wall niches. But if the robot was entirely nondescript, the man was anything but. With his angular face, dark complexion, bristle-cut hair, and intense eyes, he was striking, rather than conventionally handsome. Whether or not Davlo Lentrall truly was a man at the center of important affairs, he at least looked as if he was.\n \"Good morning to you, Dr. Leving,\" Lentrall said, bowing slightly to her, an old-fashioned, courtly sort of gesture. He turned to her husband. \"And good morning to you as well, sir.\"\n \"Good morning,\" said Kresh. There was a couch against one wall in the office. The governor sat down on it, and Fredda sat down next to him. Kresh gestured to a comfortable chair facing the couch. \"Please, Dr. Lentrall, have a seat.\"\n But Lentrall did not sit down. Instead he stood there, plainly struggling to act calmer than he truly was. \"Sir, I must tell you something, even if it sounds a bit absurd. I-I believe that I am being followed.\"\n Kresh smiled sadly. \"I\u0027m sorry to say that doesn\u0027t sound the least bit absurd,\" said Kresh. \"The police commander himself was just here, telling me just how interested certain parties were in you. I\u0027d be surprised if someone hadn\u0027t put a tail on you.\"\n Davlo nodded and seemed to relax, just a trifle. \"In a strange way, that\u0027s a relief. I think I\u0027d rather have someone actually following me than to be suffering paranoid delusions.\"\n \"Trust me, son. In this life, one does not exclude the other. But be that as it may, sit down, take a deep breath, and then-then we can talk about the matter in question.\"\n \"Yes, sir.\" Davlo sat down rather gingerly, as if he half expected the chair to snap under his weight, or that some sort of trap was going to spring out of the armrests and grab him.\n Fredda noted that the room was not laid out as it normally was, and that her husband was not in his usual place. Her husband had obviously ordered the room rearranged so as to lower the emotional stakes as much as possible. For this morning, Alvar Kresh was not in the thronelike chair, not behind the imposing barrier of his ornate desk. He was sitting in a posture of slightly exaggerated relaxation on the couch. The chair Lentrall was in actually put him a little above Alvar\u0027s eye level. The low table between the couch and Lentrall\u0027s chair served as a sort of barrier, a neutral buffer zone that kept anyone from invading Lentrall\u0027s personal space. Even Alvar\u0027s calm expression and faint half-smile were part of the show.\n And Fredda suddenly realized that she was part of the show as well. Alvar wanted her to do the talking, have Lentrall address her. Did he think Lentrall would react more calmly talking to someone closer to his own age, a woman without official rank? Or was it that Alvar wanted to put himself in the position of observer, get himself outside the conversation, so that he could watch and judge impartially, without getting involved? Or maybe he didn\u0027t have a reason at all. Maybe it was just political instinct at work, unanalyzed gut feeling.\n \"Donald,\" Kresh said, \"bring our guest some refreshment.\"\n \"Certainly, sir.\" Donald stepped forward and addressed Lentrall. \"What would you care for?\" he asked.\n \"Nothing.\" Lentrall regarded Donald for a moment with an expression of curiosity on his face. He turned toward Fredda.\n \"Dr. Leving, I wonder if you might indulge my curiosity for a moment. This robot here. Am I correct in believing that you designed and built it?\"\n \"That\u0027s right.\"\n \"I see. You are a well-known figure, of course, and so too are many of your creations.\"\n Kresh chuckled darkly. \"That\u0027s putting it mildly.\" Lentrall looked toward Kresh, and smiled thinly. \"I suppose you have a point, sir. But what confuses me is the name. \u0027Donald.\u0027\"\n \"It\u0027s a fancy of mine to use character names from an ancient storyteller for all my custom-made robots,\" said Fredda. \"A man who lived on old Earth, in the pre-robotic era. A man by the name of-\"\n \"Shakespeare,\" said Lentrall. \"I know that. William Shakespeare. And just incidentally, I think it might be more accurate to call him a poet and a playwright, rather than a storyteller. I have studied him myself. That\u0027s what made me wonder. The names of your other robots: Caliban, Prospero, Ariel. All Shakespeare. I even saw some sort of feature story about your home, and noticed your current personal robot is named Oberon. Shakespeare again. That is why I wonder. Why the name \u0027Donald\u0027?\"\n \"I beg your pardon?\"\n \"Sir, if I might be of assistance,\" Donald said, addressing Lentrall. \"I am named for a minor character in the play Macbeth.\"\n \"But there is no character by that name in the play,\" Lentrall replied. \"I know the play well. In fact, I am morally certain there is no character by the name \u0027Donald\u0027 anywhere in Shakespeare.\" Lentrall thought for a moment. \"There is a Donalbain in Macbeth,\" he suggested. \" \u0027Donald\u0027 must be a corruption of \u0027Donalbain.\u0027\"\n \"Sir, forgive me for correcting you, but I have just consulted my on-board dataset, and I have confirmed the character is named \u0027Donald.\u0027\"\n \"Of course he is, in your copy,\" Lentrall said. \"If Dr. Leving\u0027s copy was corrupted, and your on-board reference is based on it, of course it has the name wrong as well. A lot of errors creep into the ancient texts over time.\"\n \"Might it be possible, sir, that your copy of the play is in error?\" Donald suggested.\n \"Anything might be possible, but I very much doubt my copy is in error. I am something of a collector of such things, and I possess four different sets of Shakespeare, three as datasets and one a hard copy. There\u0027s not a \u0027Donald\u0027 in any of them.\"\n \"I see,\" said Donald, clearly taken aback by Lentrall\u0027s news. \"Clearly I must review my on-board dataset.\"\n \"Interesting,\" said Lentrall as Donald retreated to his wall niche. \"I suppose the moral is that we never know quite as much as we think we know. Wouldn\u0027t you agree, Dr. Leving?\"\n \"Hmmm? What? Oh, yes.\" Fredda felt completely thrown off her stride. How could she have made a mistake like that? What other mistakes had she made over the years without even knowing it? It was remarkable how such a trivial error could make her feel so embarrassed.\n And it was also remarkable that Lentrall could be rude and arrogant enough to call her on it the moment they met. Yet the fellow seemed to have no idea that had been rude. Davlo Lentrall was a most peculiar young man-and not one with the sort of skills and personality required to get far in politics. Lucky for him he had chosen another field.\n But none of this was getting the discussion moving. \"Perhaps it is time to turn to the matter at hand,\" she said.\n \"Absolutely,\" said Lentrall. \"How much do you know so far?\"\n Fredda hesitated, and glanced toward her husband. But his impassive expression gave her no clue. \"Just to be clear, Dr. Lentrall, my husband has told me nothing at all. He wanted me to hear it all from you. So please, start at the beginning.\"\n \"Right,\" Lentrall said, in a tone close enough to brusque that it made no difference. \"The basic point is that I believe I have found a way to enhance the terraforming process and permanently stabilize the climate.\"\n \"But only by putting the lives of perhaps millions of people at risk,\" said Lentrall \u0027 s robot from its niche.\n \"Be quiet, Kaelor,\" Lentrall said impatiently.\n \"First Law compelled me to say at least that much,\" the robot replied, in an aggrieved tone of voice. \"Your plan of action would put many human beings in danger.\"\n \"I would hardly call it danger,\" Lentrall said testily. \"Rather, very slight risk. But if my plan succeeds, it will mean greater safety and comfort for generations of humans yet to come.\"\n \"That argument contains far too many hypotheticals to be of any interest to me,\" Kaelor replied.\n \"You have made your point now,\" Lentrall said. \"I order you to be quiet.\" He shook his head and looked to Fredda. \"I know you are famous for building superb robots,\" he said. \"But there are times when I wonder if the Settlers don\u0027t have a point.\"\n \"The same thought has crossed my mind more than once,\" said Fredda. \"But please go on. How do you propose to stabilize the climate?\"\n \"By flooding the north pole,\" Lentrall said. \"I call it the Polar Sea Project.\"\n \"What, precisely, would that accomplish?\" Fredda asked. Lentrall stared hard at her for a moment, as if she had just asked what use robotic labor might be. \"Let me go back a bit,\" he said at last. \"In fact, let me go all the way back. As you might know, when the first Spacers arrived at this planet, what they found was a desert world that consisted of two large and distinct geologic regions. The southernmost two-thirds of the planet were lowlands, while the northernmost third was covered by a huge plateau, much higher in elevation than the southern hemisphere. For that precise reason, Inferno was regarded as a marginal candidate for terraforming.\"\n \"Why?\"\n \"Because when water was introduced onto the planet, it would obviously all pool in the south-as indeed it has. Today we call the northern uplands the continent of Terra Grande, and the southern lowlands have been flooded to form the Southern Ocean. This gives the planet one water-covered pole and one landlocked one.\"\n \"And what difference does that make?\"\n \"A great deal of difference. Water absorbs heat energy far more efficiently than the atmosphere can. Water can circulate, carrying that heat along with it. Temperatures in the southern hemisphere are much more moderate and stable than they are in the north, because warm water can flow over the south pole and the polar regions, warming them up. Cold polar water can move toward the temperate zones and cool them off. I am oversimplifying things tremendously, of course, but that is the basic idea.\"\n \"And that can\u0027 t happen in the north, because there is no water,\" Fredda said, glancing toward her husband. But his face was completely expressionless. He was watching this game, not playing it.\n Lentrall nodded eagerly. \"Precisely. Terra Grande is a huge, monolithic continent. It completely covers the northern third of the planet\u0027s surface. Because no water can flow over the North Pole region, there is little chance for temperatures to moderate themselves in the northern hemisphere. The tropical regions of the northern hemisphere are too hot, while the polar regions are too cold. If you look at a map, you will see that the southern edge of Terra Grande-where most of the people live-more or less borders the northern edge of the north tropical zone. Right here, in Hades, we should be right in the center of the temperate regions. But the temperate regions are shrinking, and we are very near the northern border of the habitable zone, at least by some standards. Actually, there are a few rather stringent Settler measures by which the city of Hades is, technically, uninhabitable. Because of insufficient rainfall, I believe. Be that as it may, the habitable zone of this planet is already little more than a narrow strip, five or six hundred kilometers wide, along the southern coast of Terra Grande. And that strip is still shrinking, despite our best efforts, and despite local successes.\"\n \"I thought the terraforming project was gaining ground,\" Fredda said, looking toward her husband.\n \"It is,\" said Alvar. \"In places. Mostly in the places where people live. We are losing ground elsewhere-but we are doing much better around Hades and in the Great Bay region generally. Once we have this part of the world under control, we hope to expand outward.\"\n \"If you get the chance,\" Lentrall said. \"Current projections show it could go either way. You\u0027re relying on a high-point balance. It\u0027s unstable.\"\n \"What\u0027s a high-point balance?\" Fredda asked.\n Lentrall smiled as he reached into the breast pocket of his tunic and pulled out a large coin-a Settler coin, Fredda could not help but notice. He had it so ready to hand that Fredda assumed he had put it there deliberately, just to be ready to make his point.,\n \"This is a high-point balance,\" he said. He held his left hand with the index finger pointed straight up, and carefully placed the coin on the tip of his index finger. \"In theory, I could hold this coin here indefinitely,\" he said. \"All I have to do is keep my finger completely steady, keep my arm from moving, keep from being jostled-while, at the same time compensating for any minute gusts of air, any very slight tremor in the building. And of course, I have to be sure I don\u0027t overcompensate while trying to correct for some very minor-\"\n But at that moment, the coin suddenly fell from his finger and landed ringingly on the stone floor of the office. Somehow the sound of it striking the floor was much louder than Fredda had expected.\n \"I\u0027ve just given you a pretty fair metaphor for the present state of Inferno\u0027s planetary climate. It is stable for the moment, but if there is the slightest perturbation, there will be trouble. There is no negative feedback in the system, nothing working against a perturbation to push the system back toward stability. Ever since the first climate engineer started to work here, the balance point for Inferno\u0027s climate has been a high point tottering between two extremes, with the slightest shift capable of sending the whole thing crashing down into overheating or supercooling. We have to get everything exactly right every time, or else...\" He nodded toward the coin on the floor.\n \"But you have a solution,\" Fredda said, her voice not entirely friendly. Lentrall was making no effort to convince, or explain, or discuss matters. He was lecturing, dictating, instructing her. He was speaking in tones that were a strange combination of arrogance and condescension. He was talking down to her, as if she were a child, explaining to her why doing things his way, the sensible way, was for her own good.\n \"I have a solution,\" he said. He reached down, picked up the coin, and placed it in the palm of his hand. \"We put the planet in a low-point balance, like this.\" He shook his hand back and forth, and jiggled it around vigorously. The coin stayed in his palm. Once or twice, he managed to dislodge it briefly, but then it dropped back into place. \"As you can see, it\u0027s much harder to perturb something out of a low-point balance, and it will tend to return to its balance point once a perturbation is removed. Now, a Polar Sea would move the global climate into a stable low-point system that would require massive effort to dislodge into instability.\n \"As I have said, the problem is the absence of water circulation in the northern hemisphere. If there were a way to let water accumulate in the northern polar regions, while providing inlets and outlets to the Southern Ocean, then warm water could flow north to warm the poles, and cold water could come south to cool the ocean-and the land areas near the coast. That would give us a low-point balance, where the natural force working on the planet would be self-correcting. If things got too hot, the cold polar waters would cool them off. If the temperatures dropped too much, tropical waters would warm them up. We need water over both poles.\"\n \"But there are a number of terraformed planets without water on both poles,\" Fredda objected. \"And I recall, even Earth had one pole with land on it-and the other with highly restricted water flow. I think the pole with water on it was even frozen over most of the time.\"\n Lentrall smiled again, and it was not a warm or friendly expression. Rather, it was the debater\u0027s smile of triumph, something close to a condescending sneer. She had fallen into the trap he had laid, and now he could move in for the kill. \"I have answers to all that,\" he said. \"I think you will find that they all strengthen my argument. Regarding the terraformed planets with land-locked poles, I can tell you that all of them have bodies of water that get much closer to the poles than we have on Inferno.\"\n \"What about the examples she cited from Earth?\" Kresh asked.\n \"First, the natural oceans of Earth were far deeper than the artificial oceans of any terraformed planet,\" Lentrall said. \"Because they were deeper, they held much more water and served as a much more effective heat sink.\n \"Second, they covered far more of the surface of the planet than on most terraformed worlds. Three-fourths of Earth was water. Slightly less than two-thirds of Inferno\u0027s surface is water, and it has more water coverage than any other wholly terraformed world. The difference between three-fourths and two-thirds may not sound like much, but it is substantial-and, as I have said, measured by volume, and not surface area, Inferno\u0027s oceans are much smaller than Earth\u0027s.\n \"Third, even if Earth\u0027s oceans did not have free and open access to either pole, once again, they reached close enough to allow substantial heat exchange\n \"Fourth, the land-locked South Pole of Earth was far colder than the water-covered North Pole, which just goes to show my point that liquid water served to moderate temperatures. While the surface of the Arctic Ocean was frozen over, there were still a lot of water-and a lot of water currents-below the ice.\n \"Finally, Earth\u0027s climate was remarkable for its instability. It suffered severe ice ages, which were triggered by very small fluctuations in this variable or that. There is substantial evidence that the impeded flow of water over the poles was a major contributing factor to this instability. I would submit that all of these facts regarding Old Earth strengthen, rather than weaken, the argument in favor of a water flow over the North Pole.\"\n \"Hmmph.\" Fredda didn\u0027t trust herself to say anything more. The infuriating thing was that the man was right. He did marshal his arguments well. But there was so much in his tone, in his attitude, in his behavior, that made her want to disagree with him, made her want to argue with him, tooth and nail.\n \"Go on, Dr. Lentrall,\" said Alvar, his voice an absolute study in neutrality. \"What is your backing for all this?\"\n \"An excellent question, Governor,\" Lentrall said, in a tone of voice that made it sound as if he were praising a bright schoolboy. \"As you are no doubt aware, the original terraforming plans for Inferno called for the creation of just such a Polar Sea. I have derived most of my information from those old studies.\"\n \"Why did they cancel the plans for the Polar Sea?\" Fredda asked.\n \"Partly it was politics and scheduling. Building the Polar Sea would have slowed the whole project up for years, and there was pressure to land colonists on the planet as soon as possible. By that time, a great number of things had already gone wrong with the terraforming project. There was some thought given to abandoning the planet altogether. Costs were getting out of control. But that would have done terrible damage to Spacer pride and prestige. The engineers were ordered to complete the project, but they were not given the time or the resources or the money to do it properly. They really had no choice but to cut corners. And the Polar Sea was one they could cut. Not doing it freed up enough resources to let them complete the rest of the terraforming project.\"\n \"A generous interpretation,\" said Kresh. \"I\u0027 ve studied the old files and reports as well. I\u0027d say they didn\u0027t come close to completion of the terraforming project. What they did was declare that they had completed it. The terraformers of Inferno knew exactly the mess they were creating. I found at least three reports predicting a planetary climate collapse-and all three predicted that it would happen right about now, give or take a few years.\"\n Lentrall looked annoyed at Kresh for interrupting the flow of his speech. \"In any case, the original planning documents clearly call for establishing a substantial flow of water in and over the polar regions. All of their projections showed that it would moderate and stabilize the planetary climate, as well as increasing rainfall throughout Terra Grande.\"\n \"Pretty big job, digging an ocean,\" Fredda said. Lentrall smiled again, and the expression didn\u0027t make her like him any more. \"Yes it is,\" he agreed. \"But most of the work has been done for us already. Kaelor, bring me my map case.\"\n Lentrall\u0027s robot came forward. It opened a storage compartment in the front of its torso, drew out a long, thin tube, and handed the tube to Lentrall. Lentrall opened the tube and pulled out a map printed on glossy stock. \"This shows the north polar regions of Inferno,\" he said, spreading the map out on the low table in front of him. \"One of the features of the Infernal landscape that we tend not to notice is that it is rather heavily cratered. Part of the reason for this is that the original settlers chose city sites in the regions with the lightest crater cover. Besides which, most of the craters are heavily eroded. But most of Terra Grande-and most of the flooded lowlands that now make up the ocean floor-are quite heavily cratered.\"\n Lentrall stabbed a finger down on the exact center of the map. \"As you can see, a pair of very large overlapping craters sit astride the North Pole, a formation generally known as the Polar Depression. You will note two things about the Depression. One, that nearly all of the land area inside it is below sea level. Two, there are actually permanent icecaps inside the craters. Those icecaps used to be seasonal in nature. They are now permanent, and they are growing. Every year during northern summer they melt back a bit-but every winter the storms deposit more snow, and the icecaps grow more than they have shrunk. More and more of the planet\u0027s fresh water is being locked up at the north pole. If there were a channel bringing in warm tropical water, it would melt back the icecaps in short order. If a channel could be opened from the Southern Ocean to the Polar Depression, the waters would rush in, forming the Polar Sea.\"\n \"What you\u0027re saying is that we have a ready-made seabed,\" said Fredda, \"and it is already partly filled with water-frozen water, but water all the same. Which means that all we have to do is dig the channel.\"\n \"Not a simple matter, or a small one,\" Kresh said. \"And there would either have to be two channels dug, or one channel large enough to encompass both a northward and southward flow.\"\n \"We\u0027d need both, actually,\" Lentrall said. \"One channel that could accommodate two-way flow, and one that would simply serve as a sort of huge pressure-relief valve. The second outlet would not generally carry huge amounts of water, but it would make it possible to regulate the amount of water in the Polar Sea.\"\n \"How do manage to get water to flow in two directions at once through one channel?\" Fredda asked.\n \"Actually, that is one of the more straightforward parts of the business,\" said Lentrall. \"It happens all the time in natural oceans. The warm water moves on top, while the counterflow of cold water moves on the bottom. A sort of natural temperature barrier, or thermocline, develops. The two currents are quite distinct from each other. They can even have different concentrations of trace elements. For all intents and purposes, they do not intermix. In the present case, the cold counterflow to the south should also serve to scour out the initial channel through the process of water erosion.\"\n \"You make it all seem so simple,\" said Fredda, not making any great effort to keep the sarcasm out of her voice. \"Why it is it no one has ever thought of it before?\"\n But Lentrall was clearly immune to sarcasm, no doubt because he was virtually unable to detect it. \"Oh, many people have thought of it before,\" he said. \"The problem is that no one has been able to find a way to go about digging the necessary channels until now. The job was too big and too expensive to do with any conceivable sort of conventional digging equipment. If we started right now, with an all-out effort to dig the channel, we wouldn\u0027t get halfway done before the climate collapsed.\"\n \"But you, and you alone, have found the way,\" said Fredda.\n That jibe almost seemed to strike home. \"Well, yes,\" Lentrall said, suddenly just a trifle cautious. \"Yes, I have.\"\n \"How?\" asked Fredda. \"How in the devil are you going to do it?\"\n Lentrall was now plainly startled. He looked from Fredda to Alvar and then back again. \"You mean he didn\u0027t even tell you that much? He didn\u0027t explain?\"\n \"No,\" Fredda said. She glanced at her husband, but it was plain he was not going to say anything. \"The governor wanted me to hear it from you.\"\n \"I see,\" Lentrall said, clearly taken aback. \"I thought you knew that part.\"\n \"But I don\u0027t,\" said Fredda, more than a little annoyed. \"So I ask you again to tell me now. How are you going to do it?\"\n Davlo Lentrall fiddled with the map for a moment. He cleared his throat. He sat up straight in his chair, and looked straight at Fredda. \"It\u0027s quite simple,\" he said. \"I intend to drop a comet onto the planet.\" \n","sourceLink":"https://allnovel.net/utopia-isaac-asimov-s-caliban-3/page-6.html","bookId":1730,"book":{"id":1730,"title":"Utopia (Isaac Asimov\u0027s Caliban #3)","description":"Storyline: \n Utopia (Isaac Asimov\u0027s Caliban #3) \n Third in a powerful trilogy that examines Asimov\u0027s Three Laws of Robotics--a challenge welcomed and sanctioned by Isaac Asimov, and written with his cooperation.\n \n","cover":"https://allnovel.net/images/utopia-isaac-asimov-s-caliban-3.jpg","author":"Roger MacBride Allen","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/utopia-isaac-asimov-s-caliban-3.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:11:12 AM"}}
