{"id":84261,"no":26,"title":"Page 26","content":"A Time to Say Goodbye\\n\\n As the hour of long speeches and \u0027make your life mean something\u0027 well wishes finally passed, the first rows of students stood to make their way to the stage. They were antsy as they waited in a line while the principal addressed them one at a time. A spattering of applause came after each name as that student grabbed their coiled piece of symbolic paper.\\n\\n Occasionally one student\u0027s name would inspire greater applause than another. That was usually due to a small prank that student was pulling (although no one tried anything as dramatic as flashing the crowd, like Darren would have). Sometimes it was because that student was perceived as popular, like the thunderous noises Brittany received. But I knew better than anyone that popularity didn\u0027t have anything to do with worthiness, and I was content with the fact that I\u0027d probably only receive a near silent, polite form of clapping.\\n\\n Finally, my row stood to a burst of applause (that I think had more to do with the fact that we were the last row, than the student\u0027s name currently being called) and we made our way to the waiting area. Sawyer looked back at me when her name was the next to be called and gave me a dazzling smile. I smiled back, happy that after all was said and done, I\u0027d still have her. That warmth was going to stay with me for several years to come, maybe forever.\\n\\n Her name was finally called and I brought my fingers to my mouth, whistling in a near ear-splitting sort of way for her. Her applause had been decently loud anyway (she had done a much better job of integrating herself this year than I had), but I liked doing my part to help her feel wanted. It was the least I could do.\\n\\n She giggled as she took her diploma and shook the principal\u0027s hand. Her cheeks were flushed from the slight embarrassment of everyone\u0027s eyes on her, and she was gorgeous to me as she headed down the stairs on the other side of the gym. She kept eyes with me as she walked back to her seat, a wry smile on her lips and a slight shake to her head. She was well aware that I\u0027d created the ruckus. I chuckled as I watched her sit down.\\n\\n By then, I was next in line, and the last to go up. A silence hit the room the second before my name was called. I felt the heat of every set of eyes on me and raised my chin, determined to make it through this. Some people still thought poorly of me, and most couldn\u0027t help but think of the tragedy when they looked at me, but I didn\u0027t need to let my sorrowful past define me. As Sawyer had told me once, we can choose who we want to be.\\n\\n \"Lucas Michael West,\" the principal flatly intoned.\\n\\n The applause started off just as light as I\u0027d imagined it would, but by the time I made it to the center of the stage, it was significantly louder. Not anywhere near the level that Brittany\u0027s saunter across the stage had inspired, but elevated nonetheless. A smile crept up to the corner of my lip as I let the acceptance I\u0027d been so sure I\u0027d never get wash over me. I let my own acceptance wash over me as well. What was that Beth had told me? You can\u0027t accept forgiveness from others, until you forgive yourself? My smile widened as I let myself bask in that forgiveness. It felt better than I\u0027d felt in awhile.\\n\\n I firmly grabbed the principal\u0027s hand and shook it, taking my diploma with my other hand. She gave me a tight lipped smile and a brief nod of her head. Her handshake was crisp, brief and to the point - you\u0027ve graduated, great, next please. After we\u0027d separated, she started turning back to the microphone, obviously assuming that I\u0027d continue down the stage and make my way to my seat without her direction. I didn\u0027t intend to do that yet though.\\n\\n Fighting a sudden nervous knot in my stomach, I stepped in front of her, directly in front of the microphone. Looking startled at my bold maneuver, she only stopped and stared at me, instead of pulling me back. I took her moment of hesitation to look out at the crowd of shocked faces.\\n\\n Quiet instantly fell on the gym as people wondered what the heck I was doing. I cleared the frog out of my throat and started the speech I\u0027d only just thought of while sitting and waiting for my turn.\\n\\n \"My name is Lucas West,\" I paused, my cheeks going a bit red as I realized that even if they hadn\u0027t already known that, which I was sure most of them did, the principal had just announced it over the microphone. \"But, you all already know that.\" My eyes drifted over the crowd, spotting my mother with red eyes, looking proud, but confused. \"I know you all want to get on with your evening...but I can\u0027t let this night go by without acknowledging...the three people who should be standing up here with me tonight.\"\\n\\n From somewhere in the pin-droppingly silent gym, I imagined that I heard Mr. Varner sigh. I swallowed and glanced at the principal, she looked torn from jerking me away and letting me finish, since I obviously had the attention of everyone out there. I tried to ignore that fact as I continued on with what I had to do. My eyes went back to the assemblage before me. I sought out Sawyer and held her gaze, pulling strength from her approving eyes.\\n\\n \"Darren McCord...Samantha Carter...and...Lillian Tate.\" My voice cracked on Lil\u0027s name, but I ignored it. My eyes flicked over the crowd, resting on the people I knew and the people I didn\u0027t know. \"They died one year ago tonight and deserve some recognition. I ask that we all take a moment of silence, for the three lives that were lost. They may be gone...\" my eyes shifted to rest on Josh\u0027s, his face white, his cheeks wet, \"...but they are not forgotten.\"\\n\\n I lowered my head and felt a rustling of several bodies doing the same. A thick silence permeated the room and all I could think about was that night. I tried to focus more on the earlier part of the evening - laughing with Sammy, clowning around with Darren, kissing Lillian. Up until the end, it had been an amazing night for all three of us. It brought me some odd sort of peace that their last night on earth, was a good one.\\n\\n When my memories had run its course, my head lifted. I gazed out over the crowd again. Some heads were still down in reflection, some faces already in tears, and some others were staring at me with a hardened expression, maybe wishing I hadn\u0027t brought this up here, maybe still believing the gossip that swirled around the town. When I felt the principal take a step towards me, I continued before she could stop me.\\n\\n \"I know a lot of assumptions about me...and that night, have been going around this town, and I know I haven\u0027t done much to dissuade those rumors...\" I watched every head lift to regard me, and as my voice through the microphone died out, complete silence fell over the room again. \"Maybe my silence even helped to make the rumors seem true.\"\\n\\n Locking eyes with Sawyer, I swallowed and continued, \"I hope you can all understand that...that I\u0027ve been going through some stuff.\" Sawyer gave me a warm smile and I started talking like I did when I was alone with my counselor, not conscious of the eyes on me, just feeling the need to release this burden from my shoulders.\\n\\n \"I remember everything about the accident.\" I shook my head as I kept my eyes on Sawyer\u0027s glistening ones. \"I\u0027ve always remembered everything.\" I heard a buzzing noise start around the gym as people absorbed that, and my eyes went back to the crowd. A lot of the students weren\u0027t surprised by this, I had been speaking to them more often of late, but some of the adults in the audience seemed genuinely surprised, and a few seemed angered.\\n\\n I closed my eyes and sighed, wishing I didn\u0027t have to do this. Wishing my friends were sitting in their seats, laughing at me making a spectacle of myself. But wishing changes nothing and this was my reality, a reality I needed to share tonight. \"Darren, Lil and Sammy were drinking...Darren was very drunk. I\u0027d been drinking soda, so I took the keys from him.\" I looked up and out at the crowd. Silence had hit the gym again upon my words and I found an odd sort of strength from that. I\u0027d been sort of worried that some disbeliever would have stood up and started verbally abusing me at that point, but everyone was still seated, listening.\\n\\n \"The wreck wasn\u0027t caused because I\u0027d been...messed up.\" I closed my eyes. \"It was that freak rainstorm. We hit it on the way home and Darren\u0027s car started hydroplaning on the road.\" I paused, feeling the slice of pain that always hit me at this point. I reopened my eyes and searched the audience until I connected with my mother\u0027s. I focused on the love I felt pouring from her and in a much quieter voice, continued. \"I made a mistake. I was driving too fast and all I wanted was to stop...so I slammed on the brakes. I completely lost control of the car and we were right at that sharp corner. I couldn\u0027t do anything to stop us and we hit the rail hard...and went over.\" I kept my eyes on my mom\u0027s, tears streaming down her cheeks as she started to lightly cry. My voice cracked when it started again. \"I made a mistake...and they all died because of it.\"\\n\\n I looked back over the crowd and saw several faces with unshed tears and several more with wet cheeks. I was a little startled to realize that mine were wet as well. \"They were my best friends and I miss them every day, and I know several of you feel the same way.\" I let my eyes drift back down to the seniors before me. \"They would have loved to be here, graduating with us today.\"\\n\\n I swallowed noisily. \"I would give anything to be able to go back to that night a year ago, knowing what I know today, and change everything that happened. I\u0027d leave earlier, or drive slower, or make us all walk home even.\" I sighed, knowing that once again, wishing did nothing. \"No...I\u0027d convince them all not to go in the first place. I\u0027d convince them to stay at my place and stay safe. I know I can\u0027t go back and change anything, but, I\u0027d give anything to have my friends...our friends back.\"\\n\\n I sniffed and searched the thoughtful eyes of the students in front of me, most of them in tears. I stopped when my eyes came upon Sawyer\u0027s again. Hers were as wet as mine as she nodded her encouragement. \"I\u0027ve thought of joining them so many times. I thought everyone\u0027s life would be better if I\u0027d never survived, if I was dead as well. And I wanted to die. I tried to...die with them.\" I looked back at my mom\u0027s face and registered the pale whiteness as her mind went back to that awful day by the highway, when I\u0027d been set on taking my own life.\\n\\n I swallowed and spoke directly at her. \"I wanted to make everyone\u0027s life easier. I wanted my torture to end.\" I cocked my head as I watched her start to sob quietly in the stands. Neil put a comforting hand across her shoulders and pulled her to his side. Sawyer\u0027s parents, their faces as wet and distraught as my mom\u0027s, patted her back in sympathy. My eyes drifted from her down to Josh. He was staring at me wide-eyed with his mouth open. He hadn\u0027t known that I\u0027d actually gone from wanting to die, to trying to make it happen. With a small voice I spoke to him. \"But I can\u0027t change the past and I have to live with what I\u0027ve done. And I will.\"\\n\\n Peeling my eyes away from Josh\u0027s stricken face and my mom\u0027s pain, I inhaled a deep, cleansing breath and swept the room again. \"If some of you still choose to believe the lies, and still choose to hate me...I won\u0027t hold that against you.\" I set my jaw and raised my chin. \"But, I won\u0027t be joining you in hating me anymore. I made a mistake, a mistake that anyone could have made.\" My voice and face softened and I looked down and lightly shook my head. \"I\u0027ve taken my penance, and now...I\u0027m moving forward. Now, I\u0027ll do what Darren, Sammy and Lillian would have wanted me to do.\" I looked back up, my eyes automatically going to Sawyer\u0027s beaming face. \"Now, I\u0027ll live.\"\\n\\n I stepped away from the podium and blinked a few times while I looked around. There was no stoic clapping like you\u0027d expect after a speech like that, just a few sniffles and a few muttered words, and a sea of appraising, thoughtful faces. I wasn\u0027t sure if my speech had changed anyone\u0027s feelings about me - those who still believed the worst, after all this time, would probably always believe the worst, but I\u0027d needed to do it and as I stepped down to rejoin my classmates, I felt a calm peace flowing through me that I had.\\n\\n The principal quickly wrapped up the evening and then the entire gym erupted in celebration. I joined in. I\u0027d done it. I\u0027d made it through the year in more or less one piece. As the crowd of graduated students began to disperse, I found Sawyer and lifted her about a foot in the air. She squealed and hugged me tight, whispering how proud of me she was for my speech. I set her down and grabbed her face, giving her a long, slow kiss that didn\u0027t end until some of the students around us started clapping our backs to congratulate us.\\n\\n Many more people gave me approving words for my silent tribute to our lost classmates than I\u0027d thought would. Ms. Reynolds came up to me with tears on her cheeks, telling me my speech was beautiful. Mrs. Solheim approached me a minute later, making Sawyer laugh when she called me Tom. At hearing Sawyers\u0027 voice, she\u0027d turned to acknowledge her and blinked, shaking her head, like she was looking at something that couldn\u0027t be real. Sawyer looked at her oddly, but I understood my flighty teacher\u0027s reaction. Mrs. Solheim probably thought she was seeing art come to life right in front of her face. I\u0027d drawn and painted and sculpted various versions of Sawyer all year, and even though Mrs. Solheim had talked to Sawyer at the beginning of the school year, when Sawyer had been collecting homework assignments for me, I don\u0027t think she\u0027d realized that my subject was an actual person until this very second.\\n\\n As I watched my odd teacher recover herself and turn to float among the seniors, a hand clapped my back. I twisted to see Coach standing behind me. I blinked and shook my head, like I was seeing something that couldn\u0027t be real. Coach had actual tears in his eyes. With pride clear on his face, he clapped my shoulder and drew me in for a swift hug. That startled me too.\\n\\n Quickly letting go, he crossed his arms over his chest and leaned back, appraising me. \"That was nice, Luc...what you did.\" He lightly shook his head and gruffly said, \"Stupid principal should have done it.\" I lightly smiled at that and nodded my agreement. He sniffed again, his eyes getting even mistier. Extending his hand to me, he spoke in a genuinely heartfelt voice, \"You\u0027re a good man, Lucas. It\u0027s been an honor knowing you.\"\\n\\n My eyes misted as well as I grabbed his hand and shook it. \"You too, Coach.\" I heard Sawyer beside me sniffle and I put my arm around her waist as Coach and I released each other. She laid her head on my shoulder as I smiled at the much softer looking Coach in front of me. For once, we felt more like equals than a teacher and a student. I suppose that was a natural feeling to have after graduating though. He clasped my shoulder again, turning like he was leaving.\\n\\n \"Coach?\" I said as he twisted. He looked back at me with raised eyebrows and I again saw the resemblance to me that Darren used to tease me constantly about. One day I\u0027d have to ask Mom if we were related. Maybe distant cousins or something? \"Thank you, for your help with college.\"\\n\\n He smirked and shook his head. \"That was all you, Lucas.\" Abruptly his face got that stern \"coach\" look that he could do so well. \"But don\u0027t make me look bad in front of my sister\u0027s husband.\"\\n\\n I smiled and shook my head as he walked off.\\n\\n Several students came up to Sawyer and me after that, offering congratulations and appreciations for my speech. Even Will came up to me and grudgingly told me that my moment of silence was a nice thing to do. Of course, then he tried to make me fall as Sawyer and I headed for the bleachers to rejoin our parents. It wasn\u0027t as if Will had instantly grown up since being handed an honorific piece of paper.\\n\\n Shaking my head at his weak attempt, I clasped Sawyer\u0027s hand and we headed over to where her parents were animatedly talking with my mom and Neil. Sawyer\u0027s mom had wet cheeks and her face beamed when she glanced at me. I suddenly had the thought that she\u0027d finally seen me as a potential husband for her daughter tonight, and she approved. I couldn\u0027t help but smile at that thought.\\n\\n Just as we took the first step to climb up to them, Josh stepped down to stand in front of me. His face was tired and currently blank, but his dark eyes looked like they\u0027d been wrung out a couple times. I motioned for Sawyer to go ahead, telling her I\u0027d be there in a minute. She nodded and squeezed my hand before letting go.\\n\\n Josh\u0027s eyes watched her leave before slowly turning back to mine. I swallowed, waiting for him to speak to me. After another couple seconds of silence, he finally did. \"That was really nice...what you did for Darren, for all of them. Thank you.\"\\n\\n I felt my eyes watering and didn\u0027t know what to say in return. I felt myself nodding and saying, \"They deserved some recognition...especially today.\" My voice was soft and a touch hoarse.\\n\\n Josh\u0027s eyes watered as well and he clapped me on the shoulder before twisting to walk past me on the stairs. I turned to watch him leave, mentally wishing him a happier year next year. Once on the gym floor, he turned to look back at me. His eyes studied mine for a moment before he nodded and quietly said, \"I believe you, Lucas. Good luck next year.\"\\n\\n Those damn tears in my eyes trailed down my cheeks as I nodded and told him my earlier silent well wishes out loud. He nodded back to me, and then turned and disappeared into the sea of robed students and their parents milling about the gym floor.\\n\\n After congratulatory hugs from Sawyer\u0027s mom and surprisingly, her dad as well, I was engulfed by my mother, who sobbed and told me repeatedly that she loved me and was very proud of me. I tried to pull away from her near hysterics, but then I stopped and let the slight woman cry on my shoulder as long as she needed to. I\u0027d done something to her when I\u0027d tried to stop my life and this was her way of healing. I wouldn\u0027t deny her that.\\n\\n When she was finally more put together, Neil gave me a swift hug and a handshake, and took her hand, leading her from the gym, back to his home, where they were probably going to make love all evening. I closed my eyes and shook my head after having that thought. I said goodbye to Sawyer\u0027s parents, who had a word with Sally before leaving the gym and heading home alone. By the look on their faces as they waved at the door, Sally had convinced them that Sawyer was indeed going to her party.\\n\\n I gave her a sly smile as I realized why she hadn\u0027t broken the news to her friend yet. She gave me a wry smile back, her adorable dimple smiling at me too. \"Sally is an awful liar. Now that she\u0027s convinced my parents that I\u0027m really going to be at her house all night, I\u0027m pretty much free until morning,\" she explained. Giving me a quick kiss she added, \"I\u0027m going to go tell her what\u0027s really up.\"\\n\\n I smiled as she pulled away, but then frowned. \"Do your parents still not trust you?\"\\n\\n She laughed and stepped back into me, her arms going around my neck as she leaned up for a kiss. \"They trust me fine. But you? They\u0027re pretty sure you would use any opportunity to get into my pants.\" She laughed again and I laughed with her.\\n\\n My hands ran around her waist, imagining that dress again. \"It\u0027s not getting into your pants that\u0027s interesting me right now.\" I cupped her backside through her robe and she giggled. Leaning in close I added, \"You are going to keep that dress on for awhile longer...right?\"\\n\\n She laughed again, giving me another light kiss before disentangling us. \"Oh yes, Luc. I wasn\u0027t about to change something that makes your eyes look like that.\"\\n\\n She walked away then, to go talk to Sally, and I furrowed my brow. \"Like what?\" I called across the gym to her. She turned her head and laughed, but didn\u0027t answer me. I grinned as I watched my beautiful girl walk over to her friend to break the news.\\n\\n Sorry Sally, tonight my angel is staying with me. I loved that thought.\\n\\n Walking hand in hand with Sawyer to the parking lot, I started gearing myself up for the drive back home. I knew I could do it, but I still had to give myself a mental pep talk. I waved at various groups of people that we walked past, a little amazed at how different things were now, than at the beginning of the year. I\u0027d made it, though. As hard as it had been, it was over now. I clenched Sawyer\u0027s hand as we reached the first parked cars.\\n\\n \"Lucas?\"\\n\\n A voice calling to me got Sawyer\u0027s and my attention and we stopped walking and turned to look behind us. I smiled brightly at seeing Beth come trotting over to greet us. Her red curls bounced around her shoulders as the wide smile on her face matched mine. \"Good, you\u0027re still here.\"\\n\\n \"Hi, Beth,\" I said, releasing Sawyer\u0027s hand so I could give her a warm hug.\\n\\n She returned it, her hands coming down to my arms as we pulled apart. Pride showed in her pale eyes as she looked over my face. \"That was amazing, Lucas, just...amazing.\" I blushed and looked down. It wasn\u0027t that incredible. She laughed and I looked back up at her. \"No, I\u0027m not exaggerating. Considering where you started this year, that,\" she indicated behind her with her head, \"was amazing.\"\\n\\n I smiled and shook my head. My face getting serious on me, I looked over hers. \"Thank you...for not giving up on me.\" I raised one lip wryly. \"Or having me committed.\"\\n\\n She laughed again and shook her head. \"I\u0027d never have done either of those things, Lucas.\" She patted my arm, looking over to Sawyer before turning back to me. \"You call me if you need...anything, okay?\" I nodded again and gave her another swift hug. In my ear she whispered, \"I told you we\u0027d get you there, Luc.\"\\n\\n I bit my lip and nodded as we separated a final time. I grabbed Sawyer\u0027s hand and turned with her to leave. As we did, Beth knowingly said, \"Have a good night you two.\" Sawyer giggled and I turned my head to look back at Beth, giving her a quick grin. I could still hear her light laughter when we reached Sawyer\u0027s car.\\n\\n It felt like just moments later that Sawyer and I were standing alone in my bedroom. The room was subtly lit by the half moon hanging thousands of miles above us and the intimacy of its pale light wrapped around us. We stood by the side of my bed and simply gazed at each other. My heart warmed at the sight of her silver-in-the-moonlight eyes drinking me in. I sighed and lowered my head to hers, giving her a soft kiss, filling it with every ounce of love that I felt for her.\\n\\n \"I love you,\" I whispered between our kiss, feeling the need to verbalize what I felt for her too.\\n\\n She sighed with a sound that matched mine, her lips equally as soft and filled with love. Her hands came up to my face, one stopping at my cheek, the other tangling in my hair. The move brought her body closer to mine and her breasts pressed against my chest. I could feel the rigid peaks of her nipples pressing through her silky dress and a moan escaped me.\\n\\n \"I love you too,\" she whispered.\\n\\n My hands came up to rest on her hips, our lips moving more intently now. As my hands circled her backside, she made a soft noise and stepped into me, her hips resting against mine. I was hard, ready for her and I heard an, \"Oh, Lucas,\" fall from her lips before my tongue stole all speech from her.\\n\\n My fingers lightly traveled up her slightly trembling body to her neck, threading through some long, silky strands of her hair before finding the zipper of that fabulous dress. I groaned as I pulled the zipper down, anxious to see what was underneath and sorry to see that thin, clingy material leave her curves. I pulled back, my breath coming harder through my parted lips. Hers was as well.\\n\\n Pulling the now gray looking dress down her shoulders, I exposed her creamy skin inch-by-inch. She gasped when her shoulders were free. I gasped when her breasts were free. Following that silky fabric down the contours of her body, I shoved it to a point just past her hips, and then dropped it. It fell to her feet in a loose pile and I took a second to admire the scantily clad beauty before me.\\n\\n Her bra and underwear were a startling white. They had to be, for they seemed to glow in the pale light of the moon. They were lacey and provocative, barely containing her curves, her breasts nearly spilling out of the partial cups. My head bent to automatically taste the tender skin above her breast while my fingers wrapped around to unveil them. Her fingers loosened my tie and started making short work of the buttons on my shirt as I unclasped her bra.\\n\\n She pulled me over to my bed, stepping out of her shoes and the pile of her dress. I kicked off my shoes as I followed her, my head still bent, my mouth and tongue rolling over her exposed nipples. She pulled off my tie and shirt when the backs of her legs hit the bed. She started in on my slacks when I moved over to the other breast.\\n\\n I was barely conscious of my pants sliding down my legs, my whole being focused on feeling her body. It wasn\u0027t until her hand wrapped around me that I became aware of my body again. I groaned and found my way back to her mouth. Our kisses were more passionate now, as our fingers and palms explored the other.\\n\\n Our breaths nearly as frantic as our mouths, she pulled my neck, urging me to lie down with her. I did, pausing only momentarily to slip off my socks and underwear. She watched me with hungry eyes until I joined her again. I laid on top of her, pressing my achingly hard arousal against her underwear. I could feel how ready she was for me too and I swore under my breath. She grinded her hips against me and a low swear passed from her lips as well.\\n\\n I trailed my mouth and tongue down her body, wanting to know what every part of her tasted like. Every section was different: the trace amount of flowery perfume along her neck, the barest hint of sweat between her breasts, the faint amount of lavender body wash around her belly button. My fingers looped around her underwear, and tugged them down. As I watched them slide down her thighs, the only thought in my head was - I needed to taste her everywhere.\\n\\n I threw them over my shoulder and let my hands travel back up her thighs, pushing them apart as I kissed along the inside. I heard her breath hitch in anticipation. It made me throb. I stared at the spot I wanted to be inside more than anything. She was drenched for me and her hips squirmed in my hands. I knew she wanted me to be inside her too. And I would be...in a minute.\\n\\n Just as I was bringing my tongue down to taste that moisture, her hands pushed back on my shoulders. My breath was heavy and my eyes felt hooded as I snapped them up to hers; hers were heavy with desire too as she looked down on me, but I could also see a hint of uncertainty.\\n\\n Sawyer and I were completely comfortable with each other, but this...? For her, this was probably more intimate than everything we\u0027d already done. For me too, I suppose. If our positions were reversed, I\u0027d probably be feeling a little self-conscious about myself, regardless of how comfortable I was with her. Even boundless love didn\u0027t always overcome insecurity. I understood that. Truth be told, I was a little nervous about this too, as I\u0027d never done it either, but I wanted us to experience everything together, even if it kind of scared us.\\n\\n She apparently felt the same. After staring down at me for just a moment, she bit her lip, and then reached over to cup my cheek, her thumb ring, the only adornment on her body, cool on my warm skin. She drew me right to her center and relaxed her legs, opening herself to me; welcoming me as she always did. I didn\u0027t hesitate. I dropped my mouth to that delicate skin and ran my tongue along the core of her. I heard the groan I made, but I was instantly drowned out by the loud cry from her. Her hips bucked underneath me and I steadied her, not nearly done yet. I stroked and sucked and enjoyed every drop of her desire for me. Her hand threaded through my hair as her hips started a rhythm with my tongue. The taste...was indescribable.\\n\\n \"Lucas...that feels so...\" She started panting and moaning in a pattern I knew well and I ached with the thought of making her come this way. Just when I started to wonder if I could, her need-filled voice rang in my ears. \"Oh god, oh god, Lucas...I\u0027m...I\u0027m...\"\\n\\n She didn\u0027t even have time to say it, as I\u0027d slipped a couple fingers inside of her and she\u0027d instantly come around me. I moaned as I felt and heard and tasted her orgasm. I was so in tune with her body, it was almost like I was her and I\u0027d just come as well, even though my throbbing body assured me that I hadn\u0027t.\\n\\n I pulled away, breathless and aching. She reached down for my face and pulled me to her mouth. We both moaned together at her taste between us. Needing her so bad I could barely take it anymore, I slid into her and cried out in her mouth when our hips rested together.\\n\\n We stayed connected, without moving, until my body calmed down a bit. Then we slowly began pulling apart and coming together. We both exhaled in relief as I filled her and she enveloped me. It was the most intensely profound connection I\u0027d ever had, emotionally or physically, with another human being. Our movements stayed slow and unhurried as we experienced the other in the silvery near-dark of my bedroom. I whispered in her ear how much I loved her and she murmured that she loved me in return.\\n\\n We rocked together in complete unison, feeling like we\u0027d done this for years instead of months. Eventually our joint need drove us to move faster and faster, until I felt all of my other senses dulling, as my body focused on one outcome. I heard myself moaning and heard her beg for me to come in her. I didn\u0027t need to be told twice. With a few more deep thrusts, I started to come, crying her name as I spilled inside her. She clutched me tight and I surprisingly heard her cry out again, coming again.\\n\\n We slowed our movements and I carefully started to remove myself from her. Her fingers went to my hips, stilling me. \"No...please, stay, just for a little bit.\"\\n\\n I left myself inside of her, and let the rest of me carefully sag on top of her. \"As long as you want, Sawyer,\" I murmured breathlessly.\\n\\n Her hands came up to my back, tracing light patterns into my skin, as her legs wrapped around me, almost trying to pull me even closer, and, we couldn\u0027t get any closer. She brought her hands up to hold my head as I lay across her, my breath still fast, my heart still racing. Her fingers tugged through my hair, stroking repeatedly, and my body slowly started calming down. She kissed my head as I buried it in her neck. When I felt a wetness on my cheek, I pulled back, confused. Looking up at her face, I noticed that she was lightly crying.\\n\\n I immediately pulled out of her and adjusted some of my body weight off of her. \"I\u0027m sorry, am I hurting you?\" I whispered, wiping tears off her cheeks.\\n\\n She looked up at the ceiling, shaking her head and looking embarrassed as she swallowed and swiped some fingers under her eyes. \"No, no of course not.\"\\n\\n Still confused, I scrunched my brow and swept my hands over her face, not wanting her to feel anything but happy, like me. Seeing my face, she sighed and rolled her eyes, a slight laugh escaping her. \"Sorry, I\u0027m totally being a girl right now.\"\\n\\n \"Sawyer?\"\\n\\n She brought her hands to my cheeks, soothing my fears with a warm smile. \"I\u0027m sorry. It\u0027s just...with everything we\u0027ve both gone through...\" She sighed and searched my face, new tears moistening her eyes. \"This is overwhelming, what I feel for you...and sometimes...\" Her voice warbled, but she swallowed and steadied herself. With a clearer voice she said, \"Sometimes, I can\u0027t believe we made it here...together.\"\\n\\n I sighed and rested my head on hers. \"I know exactly what you mean,\" I whispered, rocking my head against hers and kissing her tenderly for a few minutes, enjoying seeing her as overwhelmed as I sometimes felt.\\n\\n When I pulled away, she bit her lip. \"I have a confession.\" I cocked an eyebrow at her. She grinned devilishly before answering me. \"While that was...amazing, Lucas, sex really wasn\u0027t why I wanted to stay with you tonight.\"\\n\\n I lifted my head and shifted to her side. She twisted to face me, her legs entangling with mine. \"No?\" I said distractedly, as I ran my fingers through her hair.\\n\\n She bit her lip again and shook her head, her eyes darting down to my chest, before lifting to meet mine again. \"No.\" Her hand came up to cup my cheek, stroking soft circles into my skin. \"I wanted to make sure you were okay tonight...in case it was difficult for you. In case you had a dream.\"\\n\\n I stopped stroking her hair as I started understanding what she meant. She\u0027d planned on staying with me tonight, because it was the one year anniversary of my friends\u0027 deaths. She was worried I\u0027d have a nightmare and wake up screaming...alone. And she didn\u0027t want me to be alone; she never wanted me to be alone. I sighed and lightly shook my head, amazed at her compassion. I leaned in to lightly kiss her.\\n\\n \"I\u0027ll be fine, Sawyer.\" Resting my head against hers, I whispered, \"But I am glad you\u0027re here.\" I hadn\u0027t dreamt of them in so long, that I was pretty sure I wouldn\u0027t tonight. But...you never know.\\n\\n I pulled her tight to me, reveling in the lemony scent of her hair as my face buried into her shoulder. Her arms came up to rub random patterns into my back and I felt exhaustion start to take me over. I whispered how much I loved her, and then gave into it.\\n\\n I gradually became aware that I was back at school. I was in the first floor hallway of the main building. I looked around the empty space, and all I saw was locker upon locker. Some were closed, some were open; papers and books spilling out of them to the floor. Some posters taped on the wall were torn and battered - one from the Safe and Sound club, wishing all the kids a \"safe\" summer, had been suspended over the archway leading outside, but was now ripped in two, the loose pieces hanging around the doorframe like paper curtains.\\n\\n The floor of the hall was littered with stray pieces of paper, streamers, tassels from graduation caps and scores of commencement ceremony pamphlets. It was like the entire student body had ripped out of here after graduation, littering and messing up the place in their joy of school being over, if only for the summer, for those not leaving these halls for good. The janitors were gonna be pissed.\\n\\n Laughter from the opposite end of the hall got my attention, and I turned to look. A wide smile broke out on my face as I watched Darren, Sammy and Lillian materialize and start to walk towards me. They were all wearing their caps and gowns, scrolled diplomas held tightly in Sammy and Lillian\u0027s hands. Darren, walking in the middle of the girls, was tightly holding their free hands as they all three looked at each other with bright, smiling faces.\\n\\n As one, they turned their heads to stare at me. Every face was calm and peaceful. Every set of eyes was warm and loving. Mine misted over at seeing them again. It had been months. Darren nodded at me, a warm grin on his face, his dark eyes glowing with the life I knew they didn\u0027t really have anymore. His dark hair, stuck out every which way, as untamable as himself.\\n\\n On his right, Sammy beamed with a bright smile. Her auburn hair seemed to find every ray of light in the room and glowed like an autumn sunset. Her golden eyes regarded mine with a slight hint of moisture, and she nodded as well. After acknowledging her greeting, my eyes shifted to Darren\u0027s left, to the first love of my life.\\n\\n She gleamed as golden as the sun. Her pale hair was nearly painful to look at, and her eyes were a bright blue, as perfect as a cloudless spring day. Her smile was brilliant as she gazed at me. My breath caught at seeing it. Even long deceased, her beauty still tore my heart.\\n\\n \"Hello, Lucas.\" Her voice, so long gone from my ears, closed up my throat and I shut my eyes, absorbing that sound forever.\\n\\n After long seconds, I reopened them. They had all stepped closer to me during my silence and were standing in a small circle around me. Each one reached out to touch a part of me; Sammy on the side of me, touched a shoulder, Darren on the other side of me, touched my other shoulder, and Lillian directly in front of me, reached up to touch my chest. I inhaled at the warmth and peace in their physical contact. Much like before, they felt completely real.\\n\\n I smiled at each one in turn, my eyes lingering on Lillian last. \"I never thought I\u0027d see you again,\" I said, when I could finally speak.\\n\\n Lillian\u0027s eyes watered and a slight frown marred her features. \"We never meant to push you over the edge, Lucas\" She shook her head, her pale hair under her graduation cap brushing over her shoulders. \"We only wanted to help.\"\\n\\n I felt Darren\u0027s hand on my shoulder tighten and I twisted to look at him. \"Yeah, we\u0027re sorry about being...harsh.\"\\n\\n I shook my head at them all. \"It\u0027s not your fault. What I almost did...that wasn\u0027t your fault.\"\\n\\n Lillian\u0027s hand came up to my cheek, drawing my eyes back to her. \"It wasn\u0027t your fault either, Luc.\" I knew what she meant. I knew she was now referring to the accident that had claimed them. I swallowed and felt the tears rise in my eyes. \"It was just an accident, Lucas. That\u0027s all.\"\\n\\n I swallowed again, my throat feeling raw and dry. \"I know,\" I whispered. \"I know.\"\\n\\n She smiled brilliantly again and I felt my heart fill at seeing the joy on her face. Her hand patted my chest, smoothing out the plain t-shirt I was wearing. \"You seem better.\" She shook her head again. \"You don\u0027t know how much peace that gives us.\"\\n\\n I looked over all of them again, seeing that peace clearly in their features. It was like looking at a mirror image of my soul, which I suppose every meeting with my dream friends had been - a representation of some part of my conscious that had needed to work things out, so I could eventually heal. \"I think I understand your peace perfectly.\" My eyes rested on hers again. \"I feel it too.\"\\n\\n Almost as if on cue, Lillian and Sammy turned to look at Darren and then took several steps away from me. They leaned back against the lockers and turned to talk to each other, tuning Darren and I out. Their clothes changed to basic jeans and t-shirts and for a moment, they looked exactly like I\u0027d expect to run across them between classes. The sight made me smile.\\n\\n Darren bumped his fist into my shoulder and I twisted to look at him. He was in regular clothes now too and had a devilish grin on his face. I grinned at seeing it. Looking over his shoulder at Lil, he quickly turned back to me and lowered his voice.\\n\\n \"Hey, good job on the...you know.\" He raised his eyebrows suggestively and I flushed, knowing he meant the end of my virginal status, that had been an ongoing joke between us.\\n\\n I slightly shook my head. \"Gee, thanks.\"\\n\\n He laughed and then a more serious expression took over his face. \"You\u0027re a man now.\" He barely got through saying it, before breaking out into more laughter.\\n\\n \"Oh god,\" I sighed and shook my head, watching an oblivious Lil over his shoulder. I suppose she knew, since they all knew what was in my head. I oddly didn\u0027t feel as guilty about that as I would have. I guess I really had moved on. I shifted my focus back to a still laughing Darren. A chuckle finally escaped me as I memorized his gleeful face. \"Are you done?\"\\n\\n He clapped my shoulder and sighed contently. \"Yeah, I guess so.\"\\n\\n As the laughter died between us, his face got serious for real. \"She\u0027s good for you, you know.\"\\n\\n I smiled over at him, knowing exactly who he was talking about. \"Yeah, I know.\" I thought of my physical body, bare, and securely wrapped in Sawyer\u0027s warm embrace and sighed contently. \"I know.\"\\n\\n He glanced over his shoulder at Sammy, who looked over at him and smiled the soft smile that she only ever gave him. He looked back at me, pure contentment on his face. \"Don\u0027t ever forget it.\"\\n\\n I shook my head. \"I never could.\"\\n\\n He smiled and nodded and then looked down for a moment. When he looked back up, his eyes were moist. \"You were my best friend, Lucas.\" He shook his head, his eyes glistening more. I felt mine glistening in response. \"You were my brother.\" His hand came up to my shoulder. \"I love you, Lucas.\"\\n\\n I sniffed and nodded. \"I love you too, Darren. You were my family.\"\\n\\n I gave him a firm hug, clapping him on the back as he clapped me. Pulling apart, he jokingly slugged my shoulder and I laughed. Smiling and stepping back he said, \"Thank you...for being there for Josh. I know he can be a dick, but he needs you.\"\\n\\n I nodded my head at him and smiled as I watched him walk over to Lil and pick her up in a warm, friendly hug. As I watched Lil giggle and struggle to get away, Sammy was suddenly standing directly in front of me.\\n\\n \"Lucas!\" She exuberantly encased me in a hug and laughing at her display, I clenched her back just as warmly. She pulled back, her golden eyes taking me in, just as surely as I was taking her in. \"You are still the best,\" she beamed.\\n\\n \"And so are you, Sammy.\" I shook my head, regarding my beautiful sister, by friendship, if not by blood. \"I don\u0027t know if I ever told you, but you were the sunshine in my day. You made everyone around you happier, just be being there.\" I let out a soft sigh. \"You have no idea how much I miss that.\"\\n\\n She grinned and tilted her head. \"Right back at you, Lucas.\"\\n\\n I shook my head at her comment and looked over her shoulder to Darren, talking with Lil. Sammy turned and followed my gaze. \"Be good to him, he needs you.\"\\n\\n She smiled at my words and turned back to me. \"I know...I need him too.\" She leaned forward and gave me a soft kiss on the cheek. \"I love you, Lucas.\"\\n\\n I swallowed back the emotion in my throat and gave her a swift hug. \"I love you too, Sammy.\"\\n\\n She turned from my grasp and walked across the hall to Darren. He gave her a dazzling smile as he slung his arms around her waist and drew her into him. He bent down to kiss her and I smiled at seeing the love they had shared so easily in life. I hoped that wherever they had gone, that had followed them there.\\n\\n As I watched their tenderness, I felt a warm hand slip into mine. \"They always were good together.\"\\n\\n I looked down at Lil\u0027s golden head as she stood by my side, also watching Darren and Sammy. She looked up at me when she felt my eyes on her, a slight smile on her lips. \"So were we,\" I whispered.\\n\\n She smiled wider and rested her head on my shoulder. \"You\u0027re lucky to have her, to have someone who loves you that much.\" She looked up at me after she said that, moisture in her eyes as well as adoration.\\n\\n I swallowed at the remembered look of love on her face, but a slight smile came to my lips at the remembered look of love on Sawyer\u0027s face. \"I know.\" My smile shifted to a frown as I turned my back on Darren and Sammy to focus solely on Lil. Gently grabbing her arms, I looked down on her and searched her eyes. \"I loved you, Lillian, I always loved you.\" I looked down at the ground and shook my head. \"I wish I\u0027d told you that while you were alive.\"\\n\\n Her hand came up to my chin, lifting my head so I met her eye again. \"I always knew how you felt, Lucas.\" A brilliant smile lit her entire face. \"And I always loved you too.\"\\n\\n I sighed as I looked over her beauty, on the inside and the outside. As her arms went around my waist, mine went around her shoulders, drawing her in tight. Into her hair, I told her, \"You will always be my first true love and I\u0027ll never forget you or stop loving you.\" I kissed her head before laying my cheek on it. \"Some things never stop.\"\\n\\n She shifted underneath me and I lifted my head to let her look up at me. Her eyes were moist again. \"I feel the same, Luc. I\u0027ve always felt the same.\" She leaned up and gave me a soft kiss and I closed my eyes, memorizing it. When she pulled away, she whispered, \"You and I will be eternally connected but...I want you to have a good life, Lucas.\" I opened my eyes after she said that and she shook her head, a smile on her lips even as a tear rolled down her cheek. \"I want you to live and be happy...you and Sawyer both.\"\\n\\n I brushed the tear away with my thumb. \"I wish you\u0027d known her. You would have really liked her.\"\\n\\n She nodded, her smile widening. \"Yeah, I wish I\u0027d known her too.\" She laughed softly and my core brightened at hearing the sound; I\u0027d never forget that sound. \"Of course, if I\u0027d known her...you wouldn\u0027t.\" She gave me a twisted smile and slightly shook her head as she added, \"At least, not like you do now.\"\\n\\n I looked down, feeling that guilt that I hadn\u0027t felt earlier, just slightly starting to creep up on me. Being okay while talking about sex with Darren was one thing, standing right in front of Lil while she referenced it, quite another. \"Lil...\"\\n\\n Her hand came back up to my chin, making me stare at her again. \"Don\u0027t, Luc. It was meant to be. I wanted you with her, from nearly the beginning.\" She gave me a pointed glance. \"There\u0027s a reason you and I could never...go there.\" She shook her head. \"We weren\u0027t supposed to. It was always supposed to be you and Sawyer.\" She shrugged her shoulders. \"You\u0027re both alive and in love, and I don\u0027t begrudge you for either of those things.\"\\n\\n I sighed as I looked over her clear, untroubled blue eyes. \"You\u0027re right...you always were right.\"\\n\\n She smiled and laughed lightly again. \"I know.\" She bit her lip and tilted her head to the side. \"I\u0027ll miss you.\"\\n\\n My arms around her shoulders tightened as I pressed her to me, nearly squeezing the non-existent life from her. \"I\u0027ll miss you too.\"\\n\\n We held each other for long moments, while I memorized everything that I could about her: the peachy smell of her body wash, the way her pale hair caught the lights, the feel of her slender, but curvy body against mine, the way her fingers felt as she lightly rubbed them along my back. I inhaled deep, tucking it all away to the corner of my brain that would always belong to her.\\n\\n My eyes were wet as we pulled apart. I raised a corner of my lip, feeling the end of this goodbye approaching, not that I\u0027d say that word to any of them. Our arms simultaneously slipped from each other\u0027s bodies down to our hands. Our fingers laced together as we leaned into the other, heads pressed together. \"Until we meet again then?\" she said quietly, feeling the approaching goodbye as well.\\n\\n I smiled and lightly nodded against her head. \"Yes...whenever that may be.\"\\n\\n \"I hope it\u0027s a lifetime from now, Lucas.\" She leaned up to brush our lips together. I reveled in the warmth of her kiss, feeling both the love and friendship behind it. She met my eye when she pulled away. \"We\u0027ll be waiting for you.\"\\n\\n As our bodies pulled apart, our fingers finally separating, Darren and Sammy stepped up to Lillian and each took one of her hands. She looked at each in turn and then the three of them turned to smile at me. I looked at each friend, at each loved one and slowly exhaled.\\n\\n \"You will always be a part of me...all of you.\" My eyes watered uncontrollably, and the tears finally did make it down my cheeks, but my smile was exultant and the overriding emotion I felt was joy - joy that I\u0027d known them, joy that I\u0027d loved them and joy that, in my own way, I\u0027d always be connected to them.\\n\\n They all beamed at me, all with tears either in their eyes or in Sammy\u0027s case, dripping off her chin. Darren sniffed and reached out to clap my shoulder. \"Just don\u0027t let that part...be all of who you are. Stay in the real world, Lucas, you belong there.\" He nodded at me, clutching my shoulder before releasing it.\\n\\n I nodded back at him and then at each of them. \"I know. I will. But I\u0027m keeping you all with me,\" I patted my chest, \"here...always.\" As more tears dripped off my cheeks, I slowly shook my head. \"I\u0027m a better person for knowing each of you. Thank you, for the friendship you gave me. I\u0027ll never forget it.\"\\n\\n We each hugged again, longer this time than before, and then Darren grabbed each girl\u0027s hand and started leading them down the hall, to the main doors highlighted in that slightly twisting paper curtain. I stayed standing in the same spot I\u0027d been before, a huge smile on my tearstained face, as in my watery vision, I watched Darren sling his arms around Sammy and Lil\u0027s shoulders and pull them in tight. He kicked at some of the papers and streamers on the floor, launching some up to land on the girls. They all three laughed, the sound nearly breaking my heart with the joy it gave me.\\n\\n As they reached the door, they started to fade into a sort of transparency. When I could just barely make out their hazy appearance, Lil turned her head to me. Over Darren\u0027s shoulder she smiled warmly, winked, and then nodded. I returned her warm smile and her nod, and just as they finally vaporized into the stale air of that hallway that we\u0027d walked countless times in real life, a warm hand grabbed mine.\\n\\n I looked down on my black-haired angel with the most beautiful shade of gray eyes. Sawyer looked up at me with clear love and adoration on her face. I smiled at her and felt the familiar, calming comfort that she always gave me. She squeezed my hand tight and leaned into my side. Wiping my tears dry with her fingers, she whispered, \"Come on, Lucas...it\u0027s time to wake up now.\"\\n\\n I nodded, sighing contently, and then, for the first time since the accident that had taken my beloved friends from me...I completely woke up.\\n\\n ***The End*** \\n\\n","sourceLink":"https://allnovel.net/collision-course/page-26.html","bookId":1886,"book":{"id":1886,"title":"Collision Course","description":"Storyline: Lucas had it all  popularity, a devoted girlfriend, a brotherly best friend, and a loving mother who would do anything for him. His life was right on course to be a successful and fulfilling one, until the crash changed everything. It happened late one night during a sudden downpour. That evening, three young lives were lost and one life was left irrevocably altered. As the lone survivor, Lucas finds himself surrounded by swirling gossip of reckless drunkenness from the small town he used to warmly call home. Amid his own guilt and self-hatred, Lucas struggles to find hope, find peace, and maybe, even find love again.\\n","cover":"https://allnovel.net/images/collision-course.jpg","author":"S.C. Stephens","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/collision-course.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:57:36 PM"}}
