{"id":84240,"no":5,"title":"Page 5","content":"Feels Like Home to Me\n Math was taught by Mrs. Chambers. She was short and wide with frizzy, brown hair and an exuberance for mathematics that I\u0027d never understand. She bounced around the front of the room, clearly excited to teach our absorbing minds all the intricate facets of advanced equations. As Sawyer and I took a seat in our preferred section in the very back row, I hoped that she allowed calculators.\n As usual now, several students stared at me as they entered the room. Several stared at Sawyer now too. I ignored the stares, Sawyer calmly returned them. I cringed when three members of the football team entered. They each sat around the smartest girl in our class and with the adoring looks she gave each of them, I was pretty sure they\u0027d each get \"tutored\" and would have no problems passing this class. They also each gave me a hard stare before settling into their seats, luckily, near the front of the room. None of them bothered me though. Maybe Will had proclaimed me his whipping boy and they simply weren\u0027t allowed. Or maybe their plan was just to ignore me. I shoved back the memories I had of each of them clapping me on the back after a tough win last year. It was almost hard to believe that at one time I\u0027d considered the team near-family.\n Mrs. Chambers energetically started taking attendance. She stuttered on my name and looked up at me with a surprised face, like she\u0027d only just realized who I was, and that I was in her class. Apparently things outside of addition and subtraction took awhile to filter though her brain. I uttered \"here\" and stared down at my desk, not wanting to see yet another teacher giving me either condemning or sympathetic looks.\n The class went by with the numbing boringness of an uninteresting subject being shoved down your throat. Math wasn\u0027t a high point for me on a good day...and today wasn\u0027t exactly a good day. It was better than yesterday, but still, not a great day.\n I spaced out halfway through the lecture and visions of Sammy sighing and leaning her chin in her hand in front of me filled my head. I imagined Darren beside her smiling indecently and whispering dirty words. She\u0027d giggle quietly and whisper back at him to shut up, which only made the words he\u0027d spout at her even dirtier. I\u0027d watched them play this game before. By the end of class, she\u0027d be faintly blushing, either embarrassed...or possibly turned on. I tried not to think about it either way.\n I felt a remembered vision of Lillian by my side, but I didn\u0027t turn to look. In my vision, I heard her laugh softly at Darren and Sammy. I closed my eyes at hearing that remembered laugh in my head. It had been the most beautiful sound in the world. I slowly opened my eyes and considered turning my head to let this vision completely take me over...but I resisted. I remembered my dream and the ache I\u0027d felt when that dream ended. As much as I\u0027d like to dwell in memories of her, if I did it now, I\u0027d probably start embarrassingly bawling.\n Instead, I clenched my fists and dug my fingers into my palms, banishing the image of Darren and Sammy\u0027s flirting, forcing my mind to the present. I struggled to absorb the lesson being taught but felt eyes on me, and finally turned my head. Sawyer was watching me with a slightly concerned look. She\u0027d probably seen my twisting emotions, and after our moment by the lockers, probably thought I was going to either completely break down or bolt. I forced my body to relax and smiled at her, letting her completely memory-free face, bring me back to calmness. If I was going to make it through a year of this, I really needed to shut my mind off better. She smiled back at me, her fingers twirling around a dark strand of hair. She looked up at the boisterous teacher and then back at me. She cocked her head slightly and mouthed \u0027are you okay\u0027? I forced a wider smile and nodded, returning my gaze back to the teacher. Yeah, I definitely needed to relax.\n After Math was lunch. I sat at my desk and pretended to flip through the math book, like I was horribly interested in the subject. I wasn\u0027t. I just wanted the entire room to clear out before I bailed. I wasn\u0027t planning on heading to the cafeteria with the rest of them. I wasn\u0027t sure where I was going to go, but doing a perp walk through that room wasn\u0027t something I wanted to partake in.\n Unfortunately, my feigned interest in mathematics led to Mrs. Chambers coming up to me and chatting my ear off about it. She seemed oblivious of the whispers and rumors around me as the other students left the classroom, the jocks giving me a final glare before they left with their real teacher, the straight \u0027A\u0027 student who clearly worshipped them. With her energetic personality, it was hard to gauge what Mrs. Chambers thought about me, and about the wreck. That didn\u0027t have anything to do with math so she didn\u0027t discuss it, but she did go into an exceedingly long lecture on the infinitely surprising ways trigonometry can be applied to everyday life.\n I think she would have chatted with me for the entire lunch period, except for the fact that Sawyer smoothly interjected herself and politely excused the both of us. Mrs. Chambers seemed reluctant to let her potential protege go (I probably feigned my interest a little too well, what with the nodding and agreeing with her at every possible opportunity), but eventually the peppy woman backed off and Sawyer and I left the now completely empty classroom.\n \"Thanks,\" I muttered as we walked down the cleared out hall.\n She grinned over at me. \"Not a problem. I didn\u0027t realize you were such a nerd.\" She grinned even wider at me.\n I matched her wide grin as I looked over her pale, gray eyes and shockingly dark hair. \"That\u0027s me...total dork.\"\n I adjusted my \u0027getting heavy\u0027 backpack and shoved my hands in my jeans pockets. Sawyer slung her arm through the hole along my side that I\u0027d created by pushing my fingers in my denims, and walked close by my side. It was sort of an intimate move and instantly memories of walking down these very halls with Lil that way assaulted me. I remembered her pale, blue eyes looking up to my hazel ones as she\u0027d leaned her head on my shoulder. \"What do you want to do for lunch? We could eat with Darren and Sammy...or...\" she bit her peach stained lip and raised her eyebrows suggestively, \"we could try making out in the closet again?\" She laughed huskily and squeezed me tight. \"Maybe we won\u0027t get interrupted by another couple this time?\"\n I shut my eyes and stopped walking. I jerked my body away from Sawyer, knowing I was being rude, but needing the memory of Lillian to leave me. Not yet...it hurt too much. I felt my eyes well up and my breath quicken. God, calm down. I should be able to think of her. Can\u0027t I at least think of her?\n \"Luc?\"\n For a moment the vision was still so strong, that I heard Lil\u0027s voice again and not Sawyer\u0027s. I pushed that feeling back, along with those stubborn tears, and forced my eyes open. Sawyer was watery in my vision and I knew that for the second time today, I was about to lose some tears in front of her. She had such a hurt and compassionate look on her face that I felt my body relaxing and my breath returning. I concentrated on the things about her that were nothing like Lil, nothing like anyone who could stoke a memory in me - the slope of her nose, the angle of her chin, the slight almond shaping of her eyes that hinted at some Asian heritage, somewhere deep in her blood.\n Focusing on her uniqueness shut my mind off, and I gave her a slight smile as her lips turned to a slight frown. \"Sorry,\" I muttered as I resumed walking. She waited a couple steps and then she met up with me, her head down, her hands now in my letterman\u0027s jacket that she was wearing. I wondered for a moment if she\u0027d read too much into me giving her that jacket yesterday. Maybe she thought we were a couple now? If so, my rejection just now had probably hurt her feelings. I suppose I did owe her an explanation. I looked over at where she was studying the ground while we walked.\n \"It\u0027s not you, Sawyer.\" She looked up at me with her brows scrunched together. I nodded my head back to where I had my latest freak-out. \"Lil and I used to...\" my voice choked up and I had to clear it to keep talking, \"we used to be like that and for a moment, I remembered how it was with her and I just can\u0027t...\" I closed my eyes and swallowed roughly. I felt Sawyer\u0027s hand on my arm and opened my eyes. We reached the stairs and I stopped on the top one. \"I\u0027m sorry if I have to push you away sometimes. I\u0027m just not ready to...be that close to someone...right now.\"\n God, I hoped she wasn\u0027t offended by that.\n She didn\u0027t appear to be. Her cheeks flushed and a look of understanding seemed to hit her. She looked back down the hallway at where we\u0027d been and then back to me. \"I\u0027m sorry, Lucas. I wasn\u0027t trying to...\" She shrugged and looked a little embarrassed. \"I\u0027m not trying to... I\u0027m just really comfortable with you. But I know you\u0027re going through something awful and probably don\u0027t feel the same way about me...\"\n I smirked and cocked my head. \"You have no idea, Sawyer...none. I don\u0027t think I\u0027d have lasted twenty minutes today if it weren\u0027t for you.\" I shook my head. \"If you only knew how much...peace I find with you.\"\n She smiled genuinely after I said that, but then she twisted her lips. \"I\u0027m not trying to replace her, Luc. I just want to be your friend.\"\n I looked at her for a long time and a comfortable silence built between us. Finally, I whispered, \"You are my friend...you\u0027re the only one I\u0027ve got.\" I may have only known her a day, but the truth of that sentence rang through every part of me.\n Her eyes watered and she stepped towards me uncertainly, like she wanted to hug me, but wasn\u0027t sure if that was okay. I closed the distance for her, bringing my arms around her as platonically as I could. We both sighed at the comfort that brought us and after a moment we pulled apart and continued our walk out of the building, to who knows where.\n We ended up eating our lunch in her Camaro in the parking lot. It was perfect. She\u0027d parked on the edge of the lot and the very few people we saw, didn\u0027t come out that far to bother us. She flipped the switch on her car and turned the radio on to a sixties rock station. I relaxed back in the seat and grabbed my lunch out of my backpack; sometime in my haze last night, I\u0027d made one. When Sawyer didn\u0027t appear to have anything but an apple in her bag, I gave her half my sandwich and a bag of pretzels. She smiled apologetically, but didn\u0027t refuse my offer, and we finished out the lunch period in the confined comfort of her vehicle.\n When the clock on her dash showed that our free time was up, we headed back out to the campus, to finish up our day. Sawyer made her way to her fifth period computer class, where she planned on killing time on the internet whenever she could. I grinned at her as we parted ways. I had Astronomy, in the squat, rectangular building that also housed the Science classes. As I walked along the sidewalk under the overhang, I remembered that this was my class with Sammy and Lil. They would have sat side by side in front of me, gossiping about the latest celebrity foible or fashion faux-pas. I smiled as I pictured Sammy\u0027s reddish hair brushing against Lil\u0027s pale hair. I pictured Lil turning in her seat to look at me and wink and felt my heart seize. Swallowing, I banished the vision I wasn\u0027t ready to have yet, and walked up to the outside door that led to my class.\n Tugging on the heavy door, my eyes immediately spotted Josh when I opened it. His eyes also immediately locked onto mine and narrowed in anger, a state he seemed to permanently reside in. He sat next to some cheerleaders and Randy from the football team. He looked back at Randy and whispered something and Randy glanced up at me entering the room and scowled. Great.\n Keeping my head down, I made my way to an empty seat in the back, on the other end of the small room from them. Unfortunately, Josh had other ideas. He walked across the room to stand right in front of me. I counted to three as he stood there, fists clenched at his sides. The teacher was at the front of the room, writing something on the board as kids filtered through the door, so I figured Josh wasn\u0027t going to try and slug me. Taking a deep breath, I looked up at him.\n \"What, Josh?\" I said quietly.\n His jaw clenched before it relaxed slightly. \"I got detention because of you, dickwad.\" I wondered how him slamming me against a locker was my fault, but didn\u0027t say anything. He leaned in close at my silence. \"I finally made varsity this year. If you get me kicked off the team, I\u0027ll...I\u0027ll...\" He searched my face as he searched for words.\n \"You\u0027ll what, Josh? Kill me?\" My lip curled in a tired smile.\n His face went red all over as he stared at me in a sudden rage. I turned my head to stare straight ahead of me as I felt eyes in the room watching our every move. I was sure more than a few of those eyes were willing Josh to finally hit me. In a weird way, I sort of wanted Josh to hit me again. Maybe it would get it out of his system this time, if he did it in front of so many people, and maybe then our relationship could...well, at least not be so antagonistic. The teacher cleared his throat as the bell rang and out of the corner of my eye, I saw Josh flinch a little at the unexpected sound.\n Josh looked around at the sound of students sitting. He turned back to me and looked me up and down. \"This isn\u0027t over, Lucas.\"\n I sighed as he walked back to his seat. \"I didn\u0027t think it was, Josh.\"\n He shot me a glare once he sat back down with Randy and I wondered if he\u0027d heard me. I shook my head and thought that Darren would get a kick out of his brother so worked up over me. Darren and I got along pretty well, for the most part, but we\u0027d certainly had our disagreements before. He\u0027d actually slugged me once, when he\u0027d thought I\u0027d hit on Sammy.\n Someone in school had started the rumor that we\u0027d been kissing in the library and he\u0027d immediately punched me the next time he saw me. That had thrown me, especially since the rumor was completely not true, and I hadn\u0027t even heard it yet. I\u0027d been walking with Sammy at the time and she\u0027d wailed on Darren after he\u0027d swung at me. She\u0027d started laughing once he confessed why he\u0027d done it and then they\u0027d spent five minutes sucking face while I rubbed my sore jaw. Darren had apologized for slugging me and I\u0027d accepted his apology...by slugging him right back. Eye for an eye, right?\n As class began, I smiled over the memory of Darren\u0027s shocked face that had quickly turned into an amused one. We\u0027d play fought after that for fifteen minutes while Sammy laughed at the both of us. I\u0027m pretty sure the words, \"you guys are morons\" crossed her lips at some point. I never did find out who\u0027d started that little rumor. I\u0027m sure whoever it was, was probably having a field day with me now.\n The class went by at a quick pace. I actually found the subject fascinating and found myself paying attention, instead of the normal daydreaming about my long gone friends that I had been doing so much of today. All too soon, I found the bell ringing and our teacher, a shriveled older man named Mr. Thomson, whose balding hair was matched with thick rimmed glasses, making him the epitome of a Science nerd, gestured some sort of goodbye with his hand and turned back to the board, erasing his drawings for the next class. I waited for Josh to leave before I stood. He gave me a glare that I was sort of getting used to from him, and then he ducked out the door with Randy and one of the blonde cheerleaders.\n I stood and picked up my bag before making my way to the exit. Josh luckily wasn\u0027t outside waiting for me, as I sort of expected him to be, and aside from a few stares, I made my way to my final class in peace. That class was again going to be the four of us. It was going to be our goof off class before Darren and I went to football practice and the girls went to volleyball practice. Art. It was located in what almost looked like a shack, opposite the back door to the gym. I ducked into the class and found that people were already starting to draw or doodle on paper and weren\u0027t paying any attention to me whatsoever. I smiled briefly as I found a seat.\n I sat at an easel and waited for the teacher, Mrs. Solheim, a woman who looked to still be stuck in the sixties with wavy, waist length hair and a look of self-medicated peace on her face, to walk over to me. She smiled widely when she approached me and the warmth in it shocked me for a moment...until she called me Tom. I shook my head and said, \"No, I\u0027m Lucas\". Then she frowned and nodded slowly, like she suddenly remembered who I was...and what I\u0027d done.\n She glanced at a couple of the empty seats in the room and I had the feeling that she was seeing my long gone friends too. I followed her eyesight, and momentarily saw Darren making a \u0027she\u0027s loopy\u0027 signal with his fingers, making my vision of Sammy, laugh into her hand. Before I could stop it, I had a vision of Lil giving Darren an admonishing look, her full lips puckered in displeasure. I remembered that dream of kissing those lips last night and felt my eyes get heavy as her beautiful, shiny hair shook around her shoulders, when she shook her head at Darren. My breath seized as her face turned towards me and I watched in awe as the lips curled into an easy smile and she opened her mouth to speak.\n \"Lucas?\"\n I blinked at the unfamiliar voice coming from her lips and glanced up at Mrs. Solheim who was trying to explain the assignment that I\u0027d missed the introduction to yesterday. I\u0027d been completely wrapped in my memories and I\u0027d tuned her out. I had no idea what she\u0027d been talking about. I swallowed the ache in my throat at seeing Lil so clearly again and forced myself to concentrate on the teacher.\n \"I\u0027m sorry...what?\"\n She sighed and rolled her eyes, explaining the assignment again to me. Her looking at me like I was the space case and not her, was sort of funny, but I couldn\u0027t find it in myself to laugh. That vision of my girlfriend had been a sudden one. I hadn\u0027t been prepared for it, not that I ever was. As the teacher walked away, I felt the ache in my chest start to turn towards despair. I flicked my eyes around the room, wishing Sawyer had this class with me too, but she didn\u0027t, she wasn\u0027t there. I\u0027d have to get through this on my own. I closed my eyes and pictured Sawyer\u0027s face - her black as night hair and stormy gray eyes. It was an odd combination, but an appealing one too. The vision of her face held no added recollections of my friends, only a peace that I could almost feel washing over my body. My pain momentarily left me. I opened my eyes and picked up a pencil on the easel. Our assignment was to draw something that felt like home. At that moment, and as odd as the thought was, only one thing felt like home to me. Very carefully, and in as much detail as I could do in an hour, I began to draw her face...Sawyer\u0027s face.\n After class, I was a bit startled to see her actual face again. I\u0027d been walking out of the shack building and debating walking home, when I\u0027d nearly run right into her. She\u0027d just come out of one of the rooms attached to the back of the gym. One of the rooms was used for the band, the other for the choir. I wondered which one she belonged to, but didn\u0027t ask her because she looked like she\u0027d been crying. She startled as she bumped against me and looked up into my face. My jacket was in her hands and her bag was haphazardly slung over her shoulder, crammed papers visible in the top of it, like she\u0027d fled the room in a hurry.\n I cocked my head at her, concerned. \"Are you alright?\"\n She swiped a hand under her eyelids and smiled stiffly. \"Yeah, I\u0027m fine.\" She flicked a glance over her shoulder and my eyes followed. She was looking at a tall, honey-haired girl coming out of the choir room. I frowned when I recognized her - Brittany Faulkner. The Faulkner family was the oldest in our small town. Their ancestors were the founding fathers of the town actually. That\u0027s right - our town had actual freaking Founding Fathers. The town was still big on heritage and all of the Faulkners had a holier-than-thou attitude. They also had a good sum of money to go along with that prestige and in a way, kind of ruled the town. And Brittany...ruled the school.\n She\u0027d been a part of our social circle with Darren, Sammy, Lil and I. She was again, one of those people that I wasn\u0027t sure why we were friends with her. She was in no way nice. But she was attractive, very attractive, and she\u0027d had her eye on me since the ninth grade. She was actually the first girl that let me feel her up. It had happened after practice my freshman year and I\u0027d always known that it wouldn\u0027t have necessarily had to stop at my hands up her shirt. I\u0027d always known that I could have gone much farther with her...I just hadn\u0027t wanted to.\n Sawyer\u0027s eyes quickly averted from Brittany\u0027s glare, as her brown eyes swept over to our position. I continued to look at her, wondering just what she\u0027d done or said to Sawyer. An odd look crossed her face; her eyes narrowed at me in contempt, much like Josh\u0027s actually, but her lips curled into a small, inviting smile, like I could still do more than just feel her up...she would just hate me at the same time. I scrunched my brow as I watched her, watch me.\n Brittany smirked and then stalked off. Brittany had been in a huff around me ever since I\u0027d started dating Lil, maybe even before that, but definitely after Lil and I\u0027d hooked up. I suspected she was jealous, but she never really had acted like she was, it was just an odd sort of feeling I used to get hanging around her. A sudden light went off in my head as I wondered if she was the one that used to circulate cheating rumors around about me.\n After she walked away, I focused my attention back to where Sawyer was putting my jacket back on. \"Is she bugging you?\" I asked her quietly.\n She shook her head. \"Don\u0027t worry about it, Luc. I can handle bitches.\"\n I frowned and started to reply when she met and held my gaze. Her eyes were back to their crystal clear peacefulness and her voice dropped to that oddly serious tone. \"I\u0027ve dealt with much worse. I can deal with her.\" She shook her head as I wondered what she meant. \"It\u0027s nothing.\"\n I shrugged, figuring she\u0027d tell me when and if she was ready. An idea struck me as I realized I\u0027d made it through an entire school day and we were now free. I smiled a genuine smile for the first time all day. \"We\u0027re done, Sawyer...we\u0027re free.\" I smiled wider as she grinned at me crookedly. \"Want to come over to my house?\" I leaned in and raised an eyebrow. \"We have Hot Pockets.\"\n She laughed and started to nod, but then she closed her eyes and her happy look fell into a disgruntled one. \"Ugh, I can\u0027t.\" I started to ask why as my face fell as well, but she answered before I could. \"I had to sign up for that Safe and Sound club. \" She sighed and kicked a rock on the ground. \"Part of my probation,\" she muttered sullenly.\n \"Oh. You\u0027re joining the purity club...really?\"\n She looked back up at me and grimaced. \"Not by choice. It was the only way my parents would give me the tiniest bit of slack.\" She sighed and her shoulders slumped.\n I cocked an eyebrow at her as I looked over her crestfallen face. \"Did you burn down your old school or something?\"\n She grinned crookedly at me and then laughed. \"I wish.\" Her eyes took on a guarded look. \"No, it was...something else.\" She looked away, obviously not wanting to talk about it, and I let the conversation drop. Again, she\u0027d tell me if she was ready. I wasn\u0027t about to push.\n \"All right then...let\u0027s go.\"\n She looked back to me with a satisfyingly startled face. \"What? You\u0027re coming?\"\n I shrugged. \"I\u0027ve got nothing else to do...and I could use a ride home.\"\n She laughed again and hugged me tight. I savored the warmth of her embrace and delighted that I had actually made someone in this school happy...by staying. I laughed and hugged her back. She pulled away from me abruptly and looked a touch embarrassed for her sudden attack. I laughed at the look on her face and we started walking back towards the main building.\n We walked past groups of kids heading out to the parking lot, and watched other groups of kids head out to the numerous buses all parked and waiting for them. Several students eyed us walking together, but she and I both ignored them. We were getting good at this, although I did still feel a little bad that just my presence was causing a small gossip storm to swirl around her. I hoped Brittany wasn\u0027t attacking her over me...maybe for her wearing my jacket, or something stupid like that.\n \"Don\u0027t you have practice?\" she asked quietly as we walked, her fingers picking at the sleeves of my jacket, her habit of playing with them still apparently in full effect.\n I smiled sadly as I looked down on her. \"No. Not this year. Not anymore.\" I thought about Josh, Randy, Will and all the others on my old team meeting with Coach on the field right about now. While I was glad I wouldn\u0027t be running into any of them anymore today, a part of me missed my old routine. But that had changed, along with everything else.\n Sawyer looked up at me with curious eyes. \"It just doesn\u0027t seem so important anymore,\" I answered her unasked question quietly. Her pale eyes regarded me with a deep understanding and she nodded, like she knew exactly what I meant. I smiled softly and felt that deep connection again as we walked the rest of the way in silence.\n The purity club met on the first floor in the main building. As we approached the classroom door we saw the handmade sign taped over the window - Safe and Sound Club: Because We Care About You. I rolled my eyes. God, I really didn\u0027t want to be here, but I hadn\u0027t wanted to part ways with Sawyer yet either. I was still sort of hoping she\u0027d come over later. It would make the night go by a lot faster, if I could share a chunk of it with her.\n Sawyer put her hand on the knob and turned to look at me. She rolled her eyes too and sighed softly. \"Ready?\" she muttered.\n \"Sure,\" I answered, as she swung the door open.\n The room wasn\u0027t very full, not too surprising, I suppose. There were maybe eight people there and the supervising teacher, Ms. Reynolds. She brightened as Sawyer entered the room and I thought she\u0027d start glowing when she noticed me.\n \"Sawyer, Lucas. I\u0027m so glad you decided to join us.\" She came over and put a hand on my shoulder as she said that and again, I felt like her statement was just for my benefit. We gave her halfhearted grins and she directed us to some open seats.\n A wave of whispers followed us as we made our way to the back of the room. We sat on a couple desks, pushing them close together, and dangling our feet off the edge. We waited silently as a couple more students trickled in. Sawyer looked down and started playing with the hem of my jacket sleeve around her wrist while I scanned the room. I caught more than a couple people giving me questioning glances. A couple people smiled sardonically and one even smiled encouragingly, but the majority frowned slightly, sure I was only here to mock their stupid club probably. Well, I wasn\u0027t. I wasn\u0027t here to mock or engage. I was here to spend time with Sawyer. As the stares kept up, I started wondering if that was a bad idea and I should have just parted ways with her. Oh well.\n Eventually Ms. Reynolds started the meeting and thanked us all for coming. She assured everyone that together we could help steer the student body to a clean and sober life. I bit back an amused smile. One tiny club was going to stop high schoolers from rebelling with secret parties and illegally obtained alcohol? I don\u0027t think so. Sawyer snickered softly beside me, and then skillfully switched it to a cough in her hand when a couple people glanced back and glared at her. I bumped her shoulder with mine and whispered for her to take this seriously. She looked up at my half grin and laughed.\n After the introductions, we were subjected to an hour of choosing club positions. The speeches for the potential President went on for fifteen minutes. By the actual vote, I was ready to make for the hills, but I stuck it out and enjoyed Sawyer\u0027s presence on the desk beside me as we whispered more interesting speeches for the candidates in the back of the room during the entire meeting. Sawyer brought me to near laughing out loud several times with her dry sense of humor. In some ways she really reminded me of Darren, and I had the sudden feeling that he really would have liked her.\n Luckily, neither Sawyer nor I were nominated for any positions, and eventually the elections ended with Sally Hoffen winning the coveted Presidential position. I picked up my stuff to get out of there and just when I was going to ask Sawyer if she still wanted to come over, Ms. Reynolds walked up to our side.\n \"Lucas...could I speak to you for a moment?\" Her young face looked greatly concerned and I cringed at whatever she wanted. I didn\u0027t have it in me to deny a direct request made by a teacher though.\n \"Um...sure,\" I said slowly.\n Sawyer beside me slung her bag over her shoulder and gave me a sympathetic look. \"Sorry, Luc, I can\u0027t hang around. My parents are expecting me home right after the meeting.\" My face fell as I looked over hers. Damn, I\u0027d so been hoping that we could hang out longer, but she had to go. Damn, I was going to have to walk home now too. She put a hand on my arm and muttered, \"Have a good night. See ya tomorrow.\"\n I nodded and watched her comforting presence leave the room. With a soft sigh, I turned to face Ms. Reynolds, who was watching her leave as well. Finally, she turned to face me and her lips compressed to a thin line. \"You didn\u0027t take that very seriously.\" I scrunched my brows as I tried to absorb what she meant. Seeing my confusion, she filled in the blanks. \"The meeting, the entire time you were either spacing out or talking to Sawyer.\" She lowered her voice and leaned into me, bringing her hand back up to my arm. \"You, of all people, Lucas, should take this seriously. We\u0027re here to help you.\" Her voice conveyed her true concern for what she clearly saw as a severely troubled teen and I immediately bristled at the implication.\n I jerked away from her. \"I came here for Sawyer.\" I shook my head, suddenly feeling very angry. \"I\u0027m not interested in your little club.\" The sneer in my voice was unmistakable and Ms. Reynolds straightened and backed up a step.\n She set her jaw at my tone and her eyes flashed with something that almost looked like anger too. \"Well, for your future...I hope you reconsider.\" Her face softened as her sudden anger left her. \"We\u0027re always here for you, Lucas.\"\n Shaking my head, I turned away from her and left the room. Her implication was all too clear - you have a problem and you need to join our little group so we can get you sober. God, since when did being drunk once in my life constitute a drinking problem. Just goes to show you how easy it can be for people to believe the lie...and how resistant people can be to believe the truth.\n In a huff, I made my way to the parking lot which let out to the street that took me home. I didn\u0027t like being angry at Ms. Reynolds. I did like her and she was only concerned over my well being, one of the few individuals in this town that did actually care about me. I was just tired of being looked at like some after school special.\n Halfway through the parking lot, a horn beeping snapped me out of my reverie. In a daze, I looked over at what car was making the noise. I stopped walking and cocked my head when I noticed Sawyer\u0027s Camaro driving towards me. My lips automatically curled into a smile as she pulled up alongside me. I bent down as she rolled down her window.\n \"What are you still doing here?\" I asked her.\n She smiled and shrugged, her hand resting over the steering wheel. \"I just remembered that you probably needed a ride.\" She shook her dark head. \"My parents can wait a few minutes.\"\n I smiled and walked around the front of her car to get in the passenger\u0027s side. Settling into the, getting familiar, bucket seat, I inhaled the clean scent of lemons and sighed at not having to walk home after all. Laying my head back on the seat, I rolled it to the side to look at her while she pulled the car forward. \"You don\u0027t have to do this. I don\u0027t want you to get in trouble because of me.\"\n She laughed and looked over at me. \"I\u0027m already in a constant state of trouble. Really, this is nothing.\" Her smile turned into a concerned look as she turned back to face the road. \"What did Ms. Reynolds want?\"\n I sighed and ran a hand though my hair. \"Oh, just your basic, you\u0027ve got a problem, let us help you speech.\" I exhaled roughly and stared out the window at the small town streaking by. \"You\u0027d think I was Lindsey Lohan for how they all look at me.\"\n She snorted and I looked back at her. \"I don\u0027t think they\u0027re looking at you like you\u0027re a wacked out, washed up starlet.\" She looked over at me and grinned and I couldn\u0027t help but grin back.\n \"You know what I mean,\" I muttered.\n She laughed again and turned back to the road. Then her look got more serious. \"Did you...did you drink a lot, Lucas?\" She looked over at me as I tried to keep a scowl from my face. Apparently I hadn\u0027t done a very good job, because she quickly added, \"I just...I don\u0027t know, Lucas. I\u0027ve only just met you. I don\u0027t know what you were like before....\" She shrugged. \"I do still believe that you weren\u0027t that night, but I was just wondering why they are all so quick to believe the stories.\"\n I relaxed and looked back to the sidewalk blurring by. I shouldn\u0027t get snippy at her, it was a fair question. She really didn\u0027t know me, and I\u0027m sure she\u0027d been getting an earful of unpleasant information on me. She must wonder if my being sober that night was the rarity. Softly, I sighed into the window.\n \"No...I\u0027ve never been a really big drinker. I just didn\u0027t care for it, for being out of control like that.\" I sighed and looked back at her. \"I\u0027ve been drunk exactly once in my life...and it was sort of a disaster.\" I shook my head and looked back out the front window. \"They all know that about me too. My...resistance was sort of an inside joke with my friends. \u0027Oh, let\u0027s get Lucas drunk - cue the Mission Impossible theme\u0027.\" I sighed again and felt her hand snake over to clench mine. I laced our fingers together and relaxed even further into her touch.\n \"Why do they all believe it then?\"\n I exhaled softly and looked over as her eyes intently studied the road. \"I don\u0027t know.\"\n She squeezed my hand and we let the conversation fade. A warm silence fell upon the car and I closed my eyes and concentrated on the feeling of her tiny hand in mine. It was nice to hold someone\u0027s hand again. I stroked my thumb along the side of hers and felt her hand stiffen slightly before relaxing. Her skin was soft and silky and I smiled at the feeling of it sliding under my skin. I was sure my hand felt rough in comparison, but Sawyer never complained or pulled her hand away, just continued to let me hold hers and stroke it with mine.\n I pushed back the memories of doing this with Lil as Sawyer\u0027s car sped to my house. Lil and I had held hands a lot, but usually only walking between classes in the more traditional \u0027cup\u0027 hold. If we were alone in a quiet car...well, we were generally doing more than holding hands. I pushed those memories back as well. Trying to distract my mind from wandering down an alley I wasn\u0027t ready for yet, I focused on the dips and curves of Sawyer\u0027s hand as my thumb stretched out to feel more of it. I swept my thumb over the back of her hand, sliding over the long, elegant bones and the smooth knuckles. I adjusted my hand so I could sweep my thumb up to her palm, feeling the hill-like edges that led down to the valley in the exact center. Then my thumb traveled straight down that valley, heading towards her petite wrist.\n She abruptly jerked her hand away from mine and startled, I opened my eyes. I blushed a bit, thinking I\u0027d gone beyond the terms of our friendship with my little \"body exploration\" and was about to sputter an apology, when I noticed she was turning the steering wheel to pull into the drive of my home. I studied her face as she did that, but I didn\u0027t see any irritation or embarrassment, actually, she looked kind of blank as she straightened the wheel and put the car in park.\n She looked over at me and that apology was still on the tip of my tongue, but she beat me to it. \"We\u0027re here...\" She looked at me a little sheepishly and ran the hand I\u0027d darn near been caressing, back through her hair, tucking some dark strands behind her ear.\n I glanced at my house and then back to her. \"Oh...thanks for the ride.\" She nodded and smiled slightly at me. I couldn\u0027t shake the feeling that I\u0027d messed up, so that apology finally did seep out of me. \"I\u0027m sorry about...\" I pointed to her hand that was picking at her jacket sleeve. \"I just...I wasn\u0027t thinking. I\u0027m sorry if that made you uncomfortable.\"\n She looked down and I thought I saw a light coloring flush her cheeks, but her hair had fallen down around her face and I couldn\u0027t be sure. I resisted the urge to sweep that hair back so I could see her better. \"It\u0027s fine, Lucas. I liked it...\" I felt a lingering \"but\" in the air, but she didn\u0027t say anything else. That non-explanation filled the car with a strange tension and I opened my door to break it. She finally looked back up at me when I did.\n I put one foot out the door and paused, looking back at her. \"I know you have to go, but...do you want to come in?\" I grinned crookedly at her. \"After all, you\u0027re already in trouble.\"\n She smiled a little and then looked down at her hand...the hand. \"No, I better not push it.\" She looked back up at me. \"I\u0027ll see you tomorrow, Lucas.\"\n I had the sudden feeling that she would have said yes if that awkward moment in the car hadn\u0027t happened and a strange guilt washed through me. I looked down at my foot on the pavement before swinging my head back around to her waiting gray eyes. \"Okay. See you, Sawyer.\" I started to stand and then stopped, settling my weight back down to the car seat. Meeting her eye again, I told her, \"Thank you...for today. I don\u0027t think I\u0027d of made it without you.\" I smiled warmly on the end and she returned it, her eyes searching my face.\n I wondered what she was looking for, when she finally replied. \"You\u0027re welcome, Luc...any time.\" She sighed softly and then her eyes settled back to mine. I smiled, nodded and started to exit the car. I was halfway standing when she spoke. \"Luc?\" I turned in the door to look back at her. \"Do you want me to pick you up in the morning? So you don\u0027t have to walk,\" she quickly added.\n I grinned widely at the thought of both spending more time with her, and not having to walk all the way to school again tomorrow. Plus the added bonus of avoiding hopping on another bus, should the weather take a turn for the worse. \"I\u0027d love that...thank you.\"\n Her wide grin matched my own and I jauntily exited the car and shut it. I was grinning and waving goodbye like an idiot when she pulled out of the drive and sped away, back towards town. I wondered where she lived for a moment and then, shoving my hands in my pockets, turned and made my way inside my small house for an exciting night of doing homework, watching bland television shows and maybe for dinner, just for something different...ham and cheese Hot Pockets. \n","sourceLink":"https://allnovel.net/collision-course/page-5.html","bookId":1886,"book":{"id":1886,"title":"Collision Course","description":"Storyline: \n Lucas had it all – popularity, a devoted girlfriend, a brotherly best friend, and a loving mother who would do anything for him. His life was right on course to be a successful and fulfilling one, until the crash changed everything. It happened late one night during a sudden downpour. That evening, three young lives were lost and one life was left irrevocably altered. As the lone survivor, Lucas finds himself surrounded by swirling gossip of reckless drunkenness from the small town he used to warmly call home. Amid his own guilt and self-hatred, Lucas struggles to find hope, find peace, and maybe, even find love again.\n \n","cover":"https://allnovel.net/images/collision-course.jpg","author":"S.C. Stephens","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/collision-course.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 4:57:36 PM"}}
