{"id":40622,"no":24,"title":"CHAPTER XXIII. THE FIRE AT THE HOTEL.","content":"On the day following the scene at the police station Maurice Vane stopped at the Grandon House to interview our hero. “I must thank you for the interest you have taken in this matter, Joe,” said he. “It is not every lad who would put himself out to such an extent.” “I wanted to see justice done, Mr. Vane,” answered our hero, modestly. “Things have taken a sudden change since I saw you last summer,” went on Maurice Vane. “Perhaps it will be as well if I tell my whole story.” “I\u0027d like first rate to hear it.” “After I got those shares of stock I felt that I had been swindled, and I was very anxious to get hold of the rascals. But as time went on and I could not locate them I resolved to look into the deal a little more minutely and see if there was any chance of getting my money, or a portion of it, back.” “I should have done the same.” “I wrote to a friend out West and he put me in communication with a mining expert who set to work to find out all about the mine. The expert sent me word, late in the fall, that the mine was, in his opinion, located on a vein of gold well worth working.” “What did you do then?” “I wanted to go West at once and look into the matter personally, but an aunt died and I had to settle up her estate and see to the care of her two children, and that held me back. Then winter came on, and I knew I\u0027d have to let matters rest until spring.” “Are you going out there in the spring?” “Yes,—as early as possible, too.” “I hope you find the mine a valuable one, Mr. Vane.” “I place great reliance on what the mining expert said, for he is known as a man who makes no mistakes.” “Then, if the mine proves of value, you\u0027ll have gotten a cheap piece of property after all.” “Yes, indeed.” “Won\u0027t those swindlers be mad when they hear of this!” “Most likely, my lad; but they have nobody to blame but themselves. I bought their shares in good faith, while they sold them in bad faith.” “Is your title perfectly clear now?” “Absolutely so.” “Then I hope the mine proves to be worth millions.” “Thank you, my boy.” “I\u0027d like to own a mine like that myself.” “Would you? Well, perhaps you will some day.” “It\u0027s not likely. A hotel boy doesn\u0027t earn enough to buy a mine,” and our hero laughed. “If I find the mine worth working and open up for business, how would you like to go out there and work for me?” “I\u0027d like it very much, Mr. Vane.” “Very well, I\u0027ll bear that in mind,” answered the possessor of the mining shares. “Why don\u0027t you buy up the rest of the mining shares first?” “I am going to do so—if I can locate them.” “Perhaps the owners will sell cheap.” “I shall explain the situation and make a fair offer. I do not believe in any underhand work,” was the ready answer. “Then you are not like some men I have met,” said Joe, and told about Ulmer Montgomery and his so-called antiquities. “That man will never amount to anything, Joe—mark my words. He will always be a hanger-on as we call them, in the business world.” “I believe you, sir.” “Honesty pays in the long run. A rogue may make something at the start but sooner or later he will find himself exposed.” Maurice Vane remained at the hotel for a week and then left to go to Chicago on business. From that point he was going to Montana as soon as the weather permitted. After that several weeks slipped by without anything unusual happening. During those days Joe fell in again with Felix Gussing. “We are going to move to Riverside,” said the dude, if such he may still be called, although he was a good business man. “I have rented a house there—the old Martin place—and if you ever come to the town you must visit us.” “Thank you, I will,” answered our hero. “My wife thinks a great deal of you and you must stop at the house during your stay at Riverside,” went on Felix Gussing. A change came for Joe much quicker than was anticipated. One night, late in the winter, he was just preparing to retire, when he smelt smoke. He ran out of his room and to an air shaft and saw the smoke coming up thickly. “The hotel must be on fire!” he thought. “If it is, I\u0027ll have to notify the management!” He jumped rather than ran down the several stairways to the hotel office. Here he told the proprietor and the cashier. An examination was made and the fire was located in the laundry. “Go and awaken all the guests,” said Mr. Drew, and Joe ran off to do as bidden. Other boys did the same, and before long the guests were hurrying through the hallways and down the elevators and stairs. By this time the smoke was coming thickly, and presently a sheet of flame burst through at the rear of the hotel. The fire alarm had been given and several engines and a hook-and-ladder company dashed on the scene. “Are your guests all out?” demanded a police officer. “I believe so,” answered Mr. Drew. “I\u0027m going to take a look around,” said Joe, and darted upstairs once more. He visited room after room, only to find them empty. From the rear of the hotel came the crackling of flames and down in the street the fire engines were pounding away, sending their streams of water into the structure. On the third floor of the building our hero came across an old lady who was rather queer in her mind. The lady was also lame and walked with great difficulty. “Oh, Joseph! what is the trouble?” she cried. “The hotel is on fire, Mrs. Dalley. Come, let me help you out.” “On fire! Oh, I must save my canary!” And the old lady started back for her room. “You haven\u0027t got time, Mrs. Dalley. Come with me.” “I cannot let my dear Dick perish!” answered the old lady, firmly. Joe looked along the hall and saw that the flames were moving swiftly toward the room the old lady had occupied. To enter the apartment would be highly dangerous. “You simply can\u0027t go after the bird, madam,” he said. “Come with me!” “My bird! my bird!” screamed Mrs. Dalley, and tried to run, or rather hobble, towards her room, despite the smoke that was now rolling over her head. “You must come with me!” exclaimed Joe, and drew her back. She tried to struggle and then, without warning, fainted in his arms. The burden was a heavy one, but our hero did not shirk the task before him. He half dragged and half carried the unconscious lady to the nearest staircase and almost fell to the bottom. The smoke on the second floor was so thick he could scarcely see. But he kept on and went down another flight and reached the office. He could hardly breathe and the tears were running down both cheeks. “Hullo there, boy!” came the call of a fireman, as he appeared through the smoke. “Better get out of here!” “Help me with this lady,” answered Joe. “A lady! Oh, all right!” And in a moment more the fireman had Mrs. Dalley over his shoulder and was carrying her out. Joe came close behind. The lady was taken to a nearby drug store where she speedily revived. By the prompt efforts of the fire department only a small portion of the hotel was burnt. But the whole building was water-soaked, and all of the boarders had to move out, and then the place was closed up. “Out of a place once again,” thought our hero, rather dismally. “What\u0027s to do next?” This was not an easy question to answer. He looked around for another opening but, finding none, resolved to pay a visit to Riverside. “I can call on the Gussings, and on Ned,” he thought. “I know all of them will be glad to see me. And maybe Mr. Mallison will be wanting to make some arrangements for next summer. I suppose he\u0027ll run the boats as usual.” “Going to leave Philadelphia, eh?” said Frank. “Do you intend to come back, Joe?” “I don\u0027t know yet, Frank.” “Well, I wish you luck.” “I wish you the same.” “If you go to work for Mallison this summer, maybe you can get me a job too.” “I\u0027ll remember that,” answered our hero. His preparations were soon made, and then he boarded a train for Riverside. He did not dream of the surprises in store for him. \n \n","sourceLink":"http://novel.tingroom.com/ertong/2981/82218.html","bookId":342,"book":{"id":342,"title":"Joe The Hotel Boy","description":"简介： A number of years ago the author of this story set out to depict life among the boys of a great city, and especially among those who had to make their own way in the world. Among those already described are the ways of newsboys, match boys, peddlers,...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2981","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
