{"id":19175,"no":15,"title":"CHAPTER XV. SUSPICION.","content":"Julius had been about the streets all day, and felt tired. He threw himself down in the corner, and was soon asleep. Marlowe and Jack kept on with their game, the latter wholly unconscious of the thoughts that were passing through the mind of his companion. Finally Marlowe, at the conclusion of a game, said: \"I won\u0027t play any more to-night, Jack.\" \"Tired, eh?\" \"Tired of playing, but I\u0027ve got something to say to you.\" \"Out with it,\" said Morgan, tilting his chair back against the wall. \"Wait a minute.\" Saying this, Marlowe rose from his seat, and advancing to the corner, leaned over the sleeping boy, and listened intently to his deep regular breathing. \"What\u0027s up?\" asked Morgan, surprised. \"I wanted to make sure that the boy was asleep,\" answered Marlowe. \"Why? Don\u0027t you want him to hear?\" \"No, I don\u0027t; for what I have to say is about him.\" \"Go ahead.\" \"I mistrust that he\u0027s going to sell us, Jack.\" \"What!\" exclaimed Morgan. \"Don\u0027t speak so loud. You might wake him.\" As he spoke, Marlowe came back and resumed his seat, bending over and speaking to Jack in a low tone. \"What have you got into your head, Marlowe?\" said Jack incredulously. \"Julius sell us! Impossible!\" \"Why impossible?\" \"He\u0027d never think of such a thing. What put it into your head?\" \"I\u0027ll tell you. Do you see that coat he brought home?\" \"Yes. What of it?\" \"The boy—Paul Hoffman—gave it to him. I saw him buy it this afternoon in a secondhand store in Chatham street.\" \"Are you sure the coat is the same?\" \"Yes; I know it by a spot I noticed at the time. Now, what should he take the trouble to buy a coat for unless the boy had done him some service? It\u0027s different from giving him an old coat he had thrown aside.\" \"That\u0027s so,\" said Jack thoughtfully. \"Perhaps he\u0027s took a fancy to Julius.\" \"Perhaps he has,\" repeated Marlowe incredulously. \"You know he ain\u0027t rich enough to buy coats to give away.\" \"I can\u0027t think the boy would betray us,\" said Jack slowly. \"Perhaps he wouldn\u0027t; I ain\u0027t sure; but we must guard against it.\" \"How?\" \"We must attack the house sooner than we meant. Suppose we say Saturday night?\" \"The boy will be in the house.\" \"It can\u0027t be helped. If he makes trouble we must silence him.\" \"I\u0027d rather have a clear field Monday night.\" \"So would I; but suppose the cops are waiting for us?\" \"If I thought Julius would do that,\" said Jack, scowling at the sleeping boy, \"I\u0027d kill him myself.\" \"I don\u0027t see why we can\u0027t do it Saturday night. We can easily overpower young Hoffman. As for Julius, he\u0027ll be asleep. Of course, he mustn\u0027t know of our change of plan.\" \"If you think it best,\" said Morgan in a tone of indecision; \"but I\u0027m almost sure I can trust the boy.\" \"I trust nobody,\" said Marlowe. \"I wouldn\u0027t trust my own brother, if he had an interest in goin\u0027 against me.\" \"Do you trust me?\" asked Jack, smiling. \"Yes, I trust you, for we are both in the same boat. It wouldn\u0027t do you any good to betray me.\" \"Yes, we\u0027re both in the same boat, but you\u0027re steerin\u0027. Well, Marlowe, just make your plans, and count me in. You always had a better headpiece than I.\" \"Then Saturday night let it be. To-day\u0027s Thursday.\" \"Then we have only two days to get ready.\" \"It will do.\" \"We\u0027ll lock the boy in that night, so he can\u0027t make mischief if he wakes up and finds that we are gone.\" During this conversation Julius remained fast asleep. Jack soon lay down, and Marlowe also, the latter having taken up his quarters with his friend. The next morning Julius was the first to wake. He leaned on his elbow and looked carelessly at the sleepers. Big, bloated, with a coarse, ruffianly face, Jack lay back with his mouth open, anything but a sleeping beauty. Julius had never thought much of his appearance, but now that he had himself begun to cherish some faint aspirations to elevate himself above his present condition, he looked upon his associates with different eyes, and it struck him forcibly that his guardian had a decidedly disreputable look. \"I won\u0027t stay with him long,\" thought Julius. \"If he\u0027s took by the cops, I\u0027ll set up for myself and never go back to him.\" Marlowe lay alongside of his companion, not so disreputable as he in appearance, but not a whit better as regards character. He was the abler of the two mentally, and so was the more dangerous. As Julius looked at him carelessly, he was startled to hear Marlowe talk in his sleep. He was prompted by a natural curiosity to listen, and this was what he heard: \"Don\u0027t trust the boy! Make it Saturday night.\" These words fastened the attention of Julius. His heart beat quicker as it was revealed to him that his want of fidelity was discovered, or at least suspected. He lay quite still, hoping to hear more. But Marlowe said nothing in addition. Indeed, these words were the precursor of his waking. Julius saw the indications of this, and prudently closed his own eyes and counterfeited sleep. So when Marlowe in turn looked about him he saw, as he thought, that both his companions were asleep. He did not get up, for there was nothing to call him up early. He was not one of the toiling thousands who are interested in the passage of eight-hour laws. Eight hours of honest industry would not have been to his taste. He turned over, but did not again fall asleep. Meanwhile Julius, after a sufficient interval, appeared to wake up. He rose from his couch, and gave himself a general shake. This was his way of making his morning toilet. \"Are you awake, Julius?\" asked Marlowe. \"Yes.\" \"You sleep sound don\u0027t you?\" \"Like a top.\" \"How did they treat you at that house in Madison avenue?\" \"They was kind to me. They gave me some supper.\" \"Did they ask you if you had a father?\" \"Yes.\" \"What did you tell \u0027em?\" \"That I hadn\u0027t got none.\" \"Did they ask who you lived with?\" \"Yes,\" said Julius, after a slight pause. \"And you told \u0027em?\" \"I told \u0027em I lived with a friend some of the time, when he wasn\u0027t absent in the country,\" said Julius, grinning, as he referred to Jack\u0027s frequent terms of enforced seclusion. \"Was you ever at the Island, Julius?\" \"No.\" \"That\u0027s odd! You don\u0027t do credit to Jack\u0027s teaching.\" \"Likely I\u0027ll go some time,\" said Julius, who, knowing that he was suspected, thought it would not do to seem too virtuous. \"It ain\u0027t so bad when you\u0027re used to it. Let me see that coat.\" Julius tossed it over to Marlowe. It was the only part of his clothing which he had taken off when he went to bed. \"It\u0027s a good coat.\" \"Yes, a bully one.\" \"The boy—young Hoffman—used to wear it, didn\u0027t he?\" \"Likely he did, but he\u0027s a good deal too big to wear it now.\" \"How big is he?\" \"Most as tall as Jack,\" said Julius, Jack being considerably shorter than Marlowe. \"Big enough to make trouble. However, he\u0027ll get a telegram Monday, to go over to Brooklyn, that\u0027ll get him out of the way.\" \"That\u0027s a good plan, that is!\" said Julius, knowing very well that it was only said to deceive him. \"Shall you see him to-day?\" \"If you want me to.\" \"I don\u0027t know,\" said Marlowe. \"Do you know where he sleeps?\" \"No,\" said Julius. \"You didn\u0027t tell me to ask.\" \"Of course not. It would only make him suspect something. But I didn\u0027t know but you heard something said, as you did about the safe.\" He eyed Julius keenly as he spoke, and the boy perceiving it, concluded that this was the cause of the sudden suspicion which appeared to have been formed in Marlowe\u0027s mind. Of course he knew nothing of the coat, as Paul had not told him of having purchased it. \"I didn\u0027t hear nothin\u0027 said about it,\" he answered. \"If he\u0027s away, you won\u0027t mind.\" \"That\u0027s true. I suppose you didn\u0027t find out where his mother sleeps.\" \"Yes, I did. It\u0027s the front basement. There was a bed in the room.\" Marlowe asked no further questions, and the conversation dropped. Julius threw his blacking-box over his back, and opening the door went out. His mind was busily occupied with the revelation which he had unexpectedly overhead. It seemed clear that the plans of the burglars had been changed, and that the attack was to be made on Saturday night, and not on Monday night, as first proposed. He must tell Paul Hoffman, for he had made his choice between his new friend and his old guardian. On the one side was respectability; on the other a disreputable life, and Julius had seen enough of what it had brought to Jack not to relish the prospect in his own case. He determined to acquaint Paul with the change of plan, and went around to Broadway for that purpose. But Paul had not got opened for business. He had delayed in order to do an errand for his mother. \"I can go later,\" thought Julius. \"It will do just as well.\" In this he was mistaken, as we shall see. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3003/82875.html","bookId":298,"book":{"id":298,"title":"Slow and Sure","description":"简介： I wonder how he will like my new picture, said Jimmy, a delicate boy of eight, whose refined features, thoughtful look, and high brow showed that his mind by no means shared the weakness of his body. Though only eight years of age he already manifest...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3003","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
