{"id":19186,"no":26,"title":"CHAPTER XXVI. FROM THE SIDEWALK TO THE SHOP.","content":"One morning, some months later, Paul was looking over the advertising columns of the Herald. As his eye glanced carelessly over the Chances for Business, his attention was drawn to the following: \"FOR SALE The stock and fixtures of a gentlemen\u0027s small furnishing store. Good reasons for selling. Apply at No. — Sixth avenue.\" \"I wonder how much it would cost,\" thought Paul. \"I wish I had a small store instead of a stand. I could make more money. Besides, it would be more comfortable in cold and stormy weather.\" It was a raw morning in November. Paul had his hands in his pockets, and had much ado to keep warm. But he knew that worse days were to come. The winter before he had suffered not a little on some days when he felt the necessity of keeping at his business. \"Let me see,\" he reflected. \"I have about six hundred dollars. That is something, but it wouldn\u0027t go far toward stocking a store. Still, I have a great mind to go up and look at the place, and inquire about terms.\" The more Paul thought about it, the more he felt a desire to go. He accordingly got a boy, in whom he felt confidence, to attend his stand, while he himself jumped on a Sixth avenue car and rode up to the shop advertised. On entering he found it small, but neat, and to all appearance a good stand for business. The proprietor, a man of thirty-five or thereabouts, came forward. \"What can I show you?\" he asked. \"I saw your advertisement in the Herald,\" said Paul, \"and came to inquire about it. You want to sell out?\" \"Yes. It is on account of my wife\u0027s health. The doctor says the city air doesn\u0027t agree with her, and orders her into the country. I don\u0027t want to be separated from her, and, besides, I have a chance to open a store in a country town where my uncle lives.\" \"Is this a good stand for business?\" \"Excellent. I am making more money here than I can expect to outside of the city; but of course that is not to be put in the scale against my wife\u0027s health. Were you thinking of going into the business?\" \"I should like to, but I have not much capital. At what price do you value your stock?\" \"At two thousand dollars.\" \"That is more money than I have got.\" \"I\u0027ll tell you what I will do. If you will give me a thousand dollars down, and give me good security for the balance, payable a year hence, I will sell out to you.\" \"What is the rent?\" \"A thousand dollars.\" \"Isn\u0027t that a good deal?\" \"In proportion to the value of my stock, it is, but I keep turning it over. Last year, after paying rent and all expenses, including wages to a boy of seventeen, who assisted me, I cleared two thousand dollars.\" To Paul this seemed considerable. It would be a great improvement upon his present position, and he would enjoy much more being the owner of a store than of a street stand. But where would he get the money? \"Couldn\u0027t you take less than a thousand dollars down?\" he asked. The man shook his head. \"I need that amount at once,\" he said. \"You had better accept my terms. You can\u0027t do better. Can\u0027t you raise the money somewhere?\" \"I will see,\" said Paul. He had thought of Mr. Preston. He knew that Mr. Preston was his friend, and that he was fully able to assist him. He would go and see him, and consult him about the matter, not directly asking him for help, but giving him an opportunity to offer. \"I will come back to-morrow and give you my answer,\" he said. \"Come to-night, if you can.\" \"Very well, I will, if possible.\" Paul was fortunate enough to find Mr. Preston in. \"Good-morning, Paul,\" said the merchant, pleasantly; \"what can I do for you this morning?\" \"I want to consult you on a matter of business, Mr. Preston.\" \"I shall be glad to advise you as well as I can.\" Hereupon Paul explained the matter, first displaying the advertisement. \"Do you think the shop favorably situated for business?\" asked Mr. Preston. \"Yes, sir.\" \"Is it pretty well stocked?\" \"Yes, sir. If I had it I might want to increase the stock a little.\" \"So the man asks a thousand dollars cash?\" \"Yes, sir.\" \"How much money have you?\" \"Six hundred.\" \"Well, Paul, I think favorably of your plan. If you want to take the shop, I will lend you the money you need, and stand security for the remainder.\" \"Thank you, sir,\" said Paul, joyfully. \"Wait a minute till you hear my conditions. This is strictly a business arrangement between us. I expect you to pay me interest at the legal rate, and to pay it punctually as it falls due. You understand that?\" \"Yes, sir, that is only fair.\" \"As you say, it is only fair, yet borrowers are apt to forget it. They will make all sorts of promises when they want to borrow, and break them afterward. Even honest men will think it is enough to pay interest whenever it is convenient, forgetting that by their neglect they are injuring their credit. Some years since I helped two former clerks to establish themselves in business. Both were honest; but while one was prompt in all his engagements, and waited upon me on the very day the interest came due with the money ready, the other obliged me to send for it, and then put me off on every occasion, though he paid finally. The result was, that after a while I assisted the first cheerfully to extend his business. The second, hearing of it, made a similar application, which I promptly refused. Do you wonder at it?\" \"Not at all, sir. I think you were perfectly right.\" \"Be prompt in all your engagements. That is a good rule in business, and in everything else. I have confidence in your integrity, and shall be very glad to assist you. Go and finish your negotiation, and when you want the money come to me.\" \"Thank you, sir, not only for your kind offer, but for your advice.\" \"He is going to succeed,\" said the merchant, as Paul went out. \"He will some day be a prosperous man.\" The merchant was pleased at the respect with which his advice was received. Young America is very apt to regard the counsel of the old and experienced as of slight value; but in this they make a great mistake. There are plenty of young men, who, from their own self-sufficiency and impatience of good advice, go to financial ruin every year. He shows wisdom who avails himself of the experience of other men, avoiding their errors, and imitating what in them is worthy of imitation. Paul returned to the shop and made a careful examination of the stock. He came to the conclusion that the price asked was not excessive, and agreed to pay it. In the course of two days the transfer was concluded, and Paul transferred the small stock of his necktie stand to the shop which he had taken. During all this time he had said nothing to his mother of the change he had made. He wanted to surprise her. \"Mother,\" he said, on the second morning of his possession, \"I want you to take a little walk with me this morning.\" \"May I go too, Paul?\" asked Jimmy. \"Yes, Jimmy, I meant to invite you. So get your cap.\" \"Where shall we walk to, Paul?\" asked his mother. \"I don\u0027t mean to tell you just yet. You will soon know.\" \"Is it a secret?\" asked Mrs. Hoffman, smiling. \"Yes; it is a great secret.\" \"Then I will try to stifle my curiosity for a time.\" \"What is it, Paul? Whisper it to me,\" said Jimmy. \"You must wait, too,\" said Paul. \"I believe you are more curious than mother.\" They had not far to walk. When they reached the shop the sign told them nothing, for Paul had not yet had time to have his own put up. He had given the order to a sign-painter, but it would take time to fulfill it. \"I want to go in here a minute,\" he said. \"Shall we wait outside?\" asked his mother. \"No; come in. I would like to have you see the shop.\" The three entered. A young clerk, who had been in the employ of the former proprietor, and whom Paul had agreed to retain at the same wages, was behind the counter. \"Good-morning, Mr. Hoffman,\" he said. \"Have you sold anything this morning?\" asked Paul. \"Yes, sir; I have entered the sales on the slate.\" \"Let me see them.\" \"A new style of necktie is out. I think it will be well to get it. It was asked for this morning.\" \"Very well. Just make a memorandum of it.\" \"Paul,\" said Mrs. Hoffman, who had listened to the conversation in surprise, \"have you anything to do with this store?\" \"I am the proprietor,\" answered Paul, smiling. \"Is it true? How did it happen?\" \"I wanted to surprise you, mother, and so I told you nothing about it.\" \"When did you come into it?\" \"This is only the second day. Mr. Preston helped me, or I could not have carried out the arrangement.\" \"Do you think you can pay all your expenses and make money?\" asked Mrs. Hoffman, a little frightened when she heard of the rent which Paul had agreed to pay. \"I mean to try, mother. I don\u0027t feel much afraid. I shall devote myself faithfully to business, and if I don\u0027t do well it won\u0027t be my fault.\" We have kept our promise, and shown how Paul advanced slowly but surely from the humble position of a street merchant to be the proprietor of a shop. Now that several years have elapsed, I am able to say that he succeeded, even beyond his anticipations. At the end of two years he took a larger shop and engaged two extra clerks. Prompt in his engagements, and of thorough integrity, he is likely to be even more prosperous as the years roll on. His mother is no longer dependent upon him. Mr. Henderson, the English artist, now able to obtain purchasers for his pictures at remunerative prices, asked her to become his wife and a mother to his little girl, and, after a little hesitation, she consented, partly, I think, because Jimmy liked the artist so much. Mr. Henderson took pains to instruct Jimmy and develop his talent, with such encouraging success that Paul\u0027s prediction seems likely to be fulfilled, and I shall not be surprised if the name of James Hoffman should, before many years, rank among the most prominent in the list of our artists. Julius, as I have already stated, left the streets of New York for a home in the West. His old enemies, Jack Morgan and Tom Marlowe, were sentenced to a long imprisonment in Sing Sing. Marlowe threatens vengeance upon Julius whenever he gets free from prison. Whether he will have an opportunity of carrying out his threat I cannot tell.","sourceLink":"http://novel.tingroom.com/ertong/3003/82886.html","bookId":298,"book":{"id":298,"title":"Slow and Sure","description":"简介： I wonder how he will like my new picture, said Jimmy, a delicate boy of eight, whose refined features, thoughtful look, and high brow showed that his mind by no means shared the weakness of his body. Though only eight years of age he already manifest...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3003","creation":"Aug 1, 2019 12:18:31 AM","modification":"Aug 1, 2019 12:18:31 AM"}}
