{"id":98581,"no":10,"title":"Page 10","content":"“What’s that?” Eli asks.\n “Go,” Vick and I tell him at the same time, and we scramble fast, faster, cut and bleeding and bruised. Hunted.\n After a few moments, Vick pauses and I push past him. We have to get deep inside the slot canyon now. “Careful,” I call back. “Ground’s rocky.” I hear Eli and Vick breathing behind me.\n “What was that?” Eli asks again as soon as we get inside.\n “Someone followed us,” Vick says. “And got shot down.”\n “We can stop for a minute,” I say, climbing under a large overhang of rock. Vick and Eli scramble in with me.\n Vick’s breathing is raspy. I look at him. “It’s fine,” he says. “It happens when I run, especially where there’s dust.”\n “Who shot them down?” Eli asks. “The Enemy?”\n Vick doesn’t say anything.\n “Who?” Eli asks, voice shrill.\n “I don’t know,” Vick says. “I really don’t.”\n “You don’t know?” Eli says.\n “No one knows anything,” Vick says. “Except Ky. He thinks he’s found the truth in a girl.”\n Hate boils up in me, pure exhausted rage, but before I can do anything, Vick adds, “Who knows. He might be right.” He pushes away from the rocky wall he’s leaning against. “Let’s go. You first.”\n The canyon air burns cold in my throat as I draw in my breath and wait for my eyes to adjust and the shades of darkness to turn into shapes of rocks and plants. “This way,” I say. “Shine your flashlights low if you need them, but the moon should be enough.”\n The Society likes to keep things from us, but the wind doesn’t care what we know. It brings hints of what has happened as we slip farther into the canyon—the smell of smoke and a white substance that falls on us. White ash. I don’t for one moment think that it’s snow.\n Chapter 10\n CASSIA\n When we land I want to be the first off the air ship, to see if Ky is there. But I remember what he told me back in the Borough about blending in, so I stay in the middle of the group of girls and search for Ky in the rows and rows of black-coated boys standing before us.\n He’s not here.\n “Remember,” the Official says to the boys, “treat these new villagers as you treat the others. No violence of any kind. We’ll be watching and listening.”\n No one responds. There doesn’t seem to be a leader. Next to me, Indie shifts her weight. A girl behind us stifles a sob.\n “Come forward to get your rations,” the Official says, and there is no pushing. No shoving. The boys all drift into a line and file past. It must have rained last night. Their boots are thick with red clay mud.\n I look at each face.\n Some seem terrified; some seem cunning and dangerous. None seem kind. They have all seen too much. I watch their backs, their hands as they take the supplies, their faces as they pass the Official. They don’t fight over the food; there is some for everyone. They fill their canteens from big blue barrels of water.\n I’m sorting them, I realize. And then I think, What if I had to sort myself? I wonder. What would I see? Would I see someone who is going to survive?\n I try to look down at myself, at the girl who watches the Official and the Officers pack up and leave in the air ship. She wears unfamiliar clothes and looks hungrily at faces she does not know. I look down on her tangled brown hair, the way she stands small and straight, even after the Officers and Official leave and one of the boys steps forward to tell the new girls that there is no crop, that the Enemy shoots every night, that the Society has stopped giving out weapons and that the weapons never worked anyway, that everyone in the camp has been sent here to die and no one knows why.\n The girl stays straight and strong when others sink to their knees because she knew this all along. She can’t quit, can’t throw her hands in the air or cry tears into the dirt because she has someone to find. Alone out of all the girls, she smiles a little.\n Yes, I tell myself. She is going to survive.\n Indie asks me for the packet. I hand it to her and, as she slips something from inside the tablets and hands them back, I realize I still don’t know what it was that she needed to hide. But now is not the time to ask. There’s another, more urgent question to answer: Where is Ky?\n “I am looking for someone,” I say loudly. “His name is Ky.” Some have already begun to leave, now that the boy has finished telling us the truth.\n “He has dark hair and blue eyes,” I call out, louder. “He came from a city, but he knows this land, too. He has words.” I wonder if he’s found a way to sell them, barter them for something out here.\n People stare back with different colors of eyes—blue, brown, green, gray. But none of the colors are Ky’s; none of the blues are quite right.\n “You should try to rest now,” the boy who told us the truth says. “It’s hard to sleep at night. That’s when they usually fire.” He seems exhausted, and I see a miniport in his hand as he turns away. Was he the leader once? Does he keep on delivering information now out of habit?\n Others turn away, too. The apathy here frightens me more than the situation itself. These people don’t seem to know about any rebellion or Rising. If no one cares anymore, if everyone has given up, who will help me find Ky?\n “I can’t sleep,” a girl from our air ship says softly. “What if it’s my last day?”\n At least she can talk. Some of the others seem almost catatonic with shock. I see a boy walk over to one of the girls, say something. She shrugs, looks back at us, walks away with him.\n My heart beats faster. Should I stop her? What will he do?\n “Have you looked at their boots?” Indie whispers to me.\n I nod. I’ve noticed the mud on them and the boots themselves—thick-soled and made of rubber. They’re like ours, except the sides of their soles are scarred with notches. I have an idea of what they must mean, what they must mark. Days survived. My heart sinks because none of the boys have very many cuts in their boots. And Ky has been gone for almost twelve weeks.\n People shuffle away. They seem to be going to the places where they sleep, minding their own business, but a few boys circle our group of girls. They look hungry.\n Don’t sort, I tell myself. See.\n They have very few notches carved in their soles. They aren’t apathetic yet. They still want things. They are new. They likely haven’t been here long enough to know Ky.\n You’re still sorting. See.\n One has burned hands and black powder all over his boots, clear up to his knees; he stands at the back of the group. He sees me looking at his hands and locks eyes with me, makes a gesture I do not like. But I hold his gaze. I try to see.\n “You know him,” I say to the boy. “You know who I’m talking about.”\n I don’t expect him to admit it, but he nods.\n “Where is he?” I ask.\n “Dead,” the boy says.\n “You lie,” I say, pushing down the rush of tears and the worry inside. “But I’ll listen to you when you want to tell the truth.”\n “What makes you think I’d tell you anything?” he asks.\n “You don’t have much time left to talk,” I say. “None of us do.”\n Indie stands next to me, her eyes on the horizon. She looks for what might come our way. Others gather near us, listening.\n For a moment, it seems that the boy might speak, but then he laughs and turns away.\n But I’m not worried. I know he’ll be back—I saw it in his eyes. And I’ll be ready.\n The day passes long and short at the same time. Everyone waits. The pack of boys returns, but something keeps them at a distance from our group. Perhaps it is the threat of the old leader, who stays near us, miniport at hand to report anything untoward. Do they fear the consequences if they injure us and the Official comes back?\n I’m eating my foilware dinner with the other girls when I see the burned-hand boy coming back toward me. I stand up and hold out the last of my food. The portions are so small here; anyone who’s been out here for long must be starving.\n “Stupid,” Indie mutters next to me, but she stands up, too. After helping each other on the air ship we seem to have become allied somehow.\n “You bribing me?” the boy asks, venom in his voice, as he gets closer and sees my outstretched offering of meat-and-carb casserole.\n “Of course,” I say. “You’re the only one who was there. You’re the only one who knows.”\n “I could just take it,” he says. “I could take anything I wanted from you.”\n “You could,” I say. “But it wouldn’t be smart.”\n “Why not?” he says.\n “Because no one else will listen the way I will,” I say. “No one else wants to know. But I do. I want to know what you saw.”\n He hesitates.\n “The others don’t want to hear about it, do they?” I ask.\n He leans back and brushes a hand through his hair, a gesture left over from another time, I think, because it is short now, like all the other boys’. “All right,” he says. “But it was in a different camp. The one I was in before I came here. It might not be the same person. The Ky I know had words, like you said.”\n “What words did he have?” I ask.\n The boy shrugs. “Ones to say over the dead.”\n “What did they sound like?” I ask.\n “I don’t remember much,” he says. “Something about a Pilot.”\n I blink in surprise. Ky knew the words of the Tennyson poem, too. How? Then I remember that day in the woods when I first opened the compact. Ky told me later that he saw me. Perhaps he saw that poem too, over my shoulder, or perhaps I whispered it aloud as I read it again and again there in the woods. I smile. So we share the second poem, too.\n Indie looks back and forth between the boy and me, her eyes curious. “What did he mean about the Pilot?” she asks.\n The boy shrugs. “I don’t know. It was something he said whenever people died. That’s all.” Then the boy begins to laugh, a sound without any humor in it. “But he must have been saying those words for hours that last night.”\n “What happened the last night?”\n “There was a firing,” he says, no more laughter. “The worst one of all.”\n “When was it?”\n He looks down at his boot. “Two nights ago,” he says, as if he can hardly believe it. “Feels like it’s been longer than that.”\n “You saw him that night?” I say, my heart racing. If this boy is to be believed, Ky was alive and near two nights ago. “Are you sure? You saw his face?”\n “Not his face,” the boy says, “his back. He and his friend Vick ran off and left us for dead. They left us to die so they could save themselves. Only six of us survived. I don’t know where the Officers took the other five after they brought me here. I’m the only one in this camp.”\n Indie glances at me, her eyes questioning, asking Is it him? It doesn’t seem like Ky, to leave people behind, and yet it does seem like Ky to find the one chance in a hopeless situation and take it. “So he took off the night of the firing. And left you—” I can’t finish the sentence. \n","sourceLink":"https://allnovel.net/crossed-matched-2/page-10.html","bookId":1644,"book":{"id":1644,"title":"Crossed (Matched #2)","description":"Storyline: \n Crossed (Matched #2) \n The Society chooses everything. \n The books you read. \n The music you listen to. \n The person you love. \n Yet for Cassia the rules have changed. Ky has been taken and she will sacrifice everything to find him. \n And when Cassia discovers Ky has escaped to the wild frontiers beyond the Society there is hope. \n But on the edge of society nothing is as it seems...\n \n","cover":"https://allnovel.net/images/crossed-matched-2.jpg","author":"Ally Condie","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/crossed-matched-2.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:34:47 PM"}}
