{"id":98607,"no":36,"title":"Page 36","content":"“What is that?” Eli asks.\\n\\n “A boat,” Hunter says. He doesn’t elaborate. Indie, Cassia, and Eli stare at the heavy roll of plastic in disbelief.\\n\\n “I’ve never seen a boat like that,” Indie says.\\n\\n “I’ve never seen a boat,” Cassia and Eli say at the same time, and then she smiles at him.\\n\\n “It’s for the stream,” Indie realizes. “So some of us can get to the Rising fast.”\\n\\n “But the stream’s all broken up,” Eli says.\\n\\n “It won’t be anymore,” I tell him. “A rain like this will have run it back together.”\\n\\n “So who’s going in the boat?” Indie asks.\\n\\n “We don’t know yet,” I say. I don’t look over at Cassia. I haven’t been able to meet her eyes since she found me burning the map.\\n\\n Eli hands me a pack. “I brought this for you,” he says. “Food, some things from the cave.”\\n\\n “Thanks, Eli,” I say.\\n\\n “There’s something else,” he whispers to me. “Can I show you?”\\n\\n I nod. “Hurry.”\\n\\n Eli makes sure that the others can’t see and then he holds out—\\n\\n A tube from the blue-lit Cavern.\\n\\n “Eli,” I say in surprise. I take the tube from him and turn it over. Inside the liquid rolls and shifts. When I read the name engraved on the outside I draw in my breath sharply. “You shouldn’t have taken this.”\\n\\n “I couldn’t help it,” Eli says.\\n\\n I should break the tube against the ground or let it go in the river. Instead I put it in my pocket.\\n\\n The rain has loosened rocks and turned the ground to mud. It won’t take much to trigger a landslide and render the path to the caves impassable, but we also have to seal off the doors of the cave without destroying what’s inside.\\n\\n Hunter shows me the plan; a neatly organized diagram of where and how and what to wire. It’s impressive. “Did you make this?” I ask.\\n\\n “No,” he says. “Our leader did before she left. Anna.”\\n\\n Anna, I think. Did my father know her, too?\\n\\n I don’t ask. I follow her diagram and Hunter’s adjustments. The rain pounds down above us and we do our best to keep the explosives dry.\\n\\n “Go down and tell the others that I’m going to set the fuse,” Hunter says.\\n\\n “I’ll do it,” I say.\\n\\n Hunter looks at me. “This was my assignment,” he says. “Anna trusted me to get it right.”\\n\\n “You know this land better than I do,” I say. “You know the farmers. If something goes wrong with the fuse, you’re the one who can get everyone else out of here.”\\n\\n “This isn’t some kind of self-punishment, is it?” Hunter asks me. “Because you were going to burn the map?”\\n\\n “No,” I say. “It’s just the truth.”\\n\\n Hunter looks at me and then nods his head.\\n\\n I set the timer on the fuse and run. It’s instinct—I should have plenty of time. My feet hit the ground near the stream and I sprint toward the others. I haven’t quite reached them when I hear the explosion go off.\\n\\n I can’t help myself—I turn and look.\\n\\n The few small trees clinging to the cliff seem to come away first; their roots tear away rocks and dirt with them. For a moment I see the dark distinct tangles of each life and then I realize the whole cliff beneath them slides too. The path severs into fragments and is turned under by water, mud, rock.\\n\\n And the slide keeps going.\\n\\n Too far, I realize, it’s coming too far and too close. It’s going to reach the township.\\n\\n One of the houses groans and breaks and gives way to the mud.\\n\\n Another.\\n\\n The earth pushes through the township, splintering boards, shattering glass, snapping trees.\\n\\n And then it goes into the river and stops.\\n\\n The slide has cut a clean, slick, red-mud-and-rock swath through the township, and it’s dammed part of the stream. The water will rise and the canyon might flood. Even as I think this, I see the others spilling out of the house and hurrying toward the path.\\n\\n I run to help Hunter with the boat. It’s for her. If what she wants is the Rising, I will help her reach it.\\n\\n Chapter 42\\n\\n CASSIA\\n\\n The walk out is slow-going and miserable; we all slip and fall and get up again, over and over. We’re painted in mud by the time we find a cave large enough for all of us to crowd inside. The boat won’t fit. We have to leave it outside on the path and I hear the rain drumming on the boat’s plastic hide. We haven’t made it to the cave with the dancing girls; this cave is tiny and littered with rocks and refuse.\\n\\n For a moment, no one can overcome exhaustion enough to speak. Our packs lie next to us. As we carried them and the weight became heavier and heavier with each muddy step, I imagined throwing out food, water, even papers. I glance over at Indie. The first time we climbed out to the plain, I was sick. She carried my pack most of the way.\\n\\n “Thank you,” I say to her now.\\n\\n “For what?” She sounds surprised, wary.\\n\\n “For carrying my things for me when we came through here the first time,” I say.\\n\\n Ky raises his head and looks at me. It’s the first time he’s really done so since the confrontation in the township. It feels good to see his eyes again. In the gloom of the cave, they are black.\\n\\n “We should talk,” Hunter says. He’s right. What we all know, but have not said, is that everyone cannot fit in the boat. “What is everyone going to do?”\\n\\n “I’m going to find the Rising,” Indie says immediately.\\n\\n Eli shakes his head. He doesn’t know yet and I understand exactly how he feels. We both want the Rising, but Ky doesn’t trust it. And, in spite of everything that happened with the map I know we both still trust Ky.\\n\\n “I still intend to find the other farmers,” Hunter says.\\n\\n “You could go on without us,” Indie says to Hunter. “But you’re helping us. Why?”\\n\\n “I’m the one who broke the tubes,” Hunter says. “The Society might not have come for you so quickly if I hadn’t done that.” Though he’s only a few years older than we are, he seems much wiser. Perhaps it is having a child; perhaps living in such a hard place; or maybe he would have been this way in the Society, too, in an easy comfortable life. “Besides,” Hunter says, “while we carry the boat, you help with our packs. It is in our best interest to help each other out of the Carving. Then we can go our separate ways.”\\n\\n Ky doesn’t say anything.\\n\\n The rain comes down outside and I think of the piece of his story that he gave me back in the Borough that said, When it rains, I remember. I vowed to remember, too. And I recall how Ky told me to trade the poems. He didn’t warn me away from the Tennyson one, even though he knew I had it too, and even though he knew it might help me discover the Rising. He left those choices—of what to trade and what to do with what I found—up to me.\\n\\n “What is it you hate about the Rising, Ky?” I ask him softly. I don’t want to do this in front of everyone else; but what other option do I have? “I need to decide where to go. So does Eli. It would help us if you explained why you hate it so much.”\\n\\n Ky looks down at his hands and I remember the picture he gave me back in the Society, the one that showed him holding the words mother and father. “They never came to help us,” he says. “With the Rising, rebellion ends in death for you and the people you love. Anyone who survives is left behind to turn into someone else.”\\n\\n “But the Enemy killed your family,” Indie says. “Not the Rising.”\\n\\n “I don’t trust them,” Ky says. “My father did. I don’t.”\\n\\n “Do you?” Indie asks Hunter.\\n\\n “I’m not certain,” Hunter says. “The last time the Rising came into our canyon was years ago.” We all, even Ky, lean forward to listen. “They told us they’d managed to infiltrate everywhere, even Central, and they tried again to convince us to join them.” Hunter smiles a little. “Anna proved too stubborn. We lived for generations on our own and she thought that we should keep doing it.”\\n\\n “They’re the ones who sent in those pamphlets,” Ky says.\\n\\n Hunter nods. “They sent the map we’re using, too. They hoped we’d change our minds and come to find them.”\\n\\n “How did they know you could read the code on the map?” Indie asks.\\n\\n “It’s our own code,” Hunter says. “We used it in the township sometimes when we didn’t want an outsider to know what we were saying.”\\n\\n He reaches into his pack and pulls out one of the headlamps. Night has fully fallen outside the cave.\\n\\n “They knew the code from some of our youth who left to join up with them.” Hunter switches on the light and sets it on the ground for us to see each other by. “The farmers as a whole never joined, but now and then a few of our younger people did. I left to find the Rising myself, once.”\\n\\n “You did?” I ask in surprise.\\n\\n “I never made it,” Hunter says. “I got as far as the stream on the plain before I came back.”\\n\\n “Why?” I ask.\\n\\n “Catherine.” Hunter’s voice is hoarse. “Sarah’s mother. She wasn’t Sarah’s mother then, of course. But Catherine could never have left the township and I decided I couldn’t leave her.”\\n\\n “Why couldn’t she leave?”\\n\\n “She was going to be the next leader,” he says. “She was Anna’s daughter, and she was exactly like Anna. When Anna died, there would have been a vote to accept or reject her oldest child as the leader, and we all would have accepted Catherine. Everyone loved her. But she died giving birth to Sarah.”\\n\\n The light inside the cave illuminates our muddy boots while our faces disappear into the darkness. I hear him taking something out of his pack.\\n\\n “Anna left you,” I say, stunned. “She left you, and she left her granddaughter—”\\n\\n “She had to do it,” Hunter says. “She had other children and grandchildren and a township to lead.” He pauses. “You see why we’re reluctant to judge the Rising too harshly. They want the greater good for their group. We cannot fault them when we do the same.”\\n\\n “It’s different,” Ky says. “You’ve been here since the beginning of the Society. Rebellions come and go.”\\n\\n “How did you escape all those years ago?” Indie asks eagerly.\\n\\n “We didn’t,” Hunter says. “They let us leave.” While he tells the story, he draws the lines of blue back on his arms with a piece of chalk he’s taken from his bag.\\n\\n “You have to remember that the people back then chose the Society and its controls as a way to prevent a future Warming event and as a way to help eliminate illness. We did not, so we left. We would not participate in the Society; so we would not receive its benefits or protection. We would farm and eat and keep to ourselves and they would leave us alone. For a long time, they did. And if any came, we cut them down.”\\n\\n Hunter continues. “Before all the original villagers in the Outer Provinces died, they used to come into our canyon for help. They told stories of being sent away for loving the wrong person or wanting a different occupation. Some came to join with us, and others came to trade with us. After the time of the Hundreds, our papers and books had become incredibly valuable.” He sighs. “There have always been people like the Archivists. I’m sure there still are. But we were cut off when the villages died.” \\n\\n","sourceLink":"https://allnovel.net/crossed-matched-2/page-36.html","bookId":1644,"book":{"id":1644,"title":"Crossed (Matched #2)","description":"Storyline: Crossed (Matched #2) \\n The Society chooses everything. \\n The books you read. \\n The music you listen to. \\n The person you love. \\n Yet for Cassia the rules have changed. Ky has been taken and she will sacrifice everything to find him. \\n And when Cassia discovers Ky has escaped to the wild frontiers beyond the Society there is hope. \\n But on the edge of society nothing is as it seems...\\n","cover":"https://allnovel.net/images/crossed-matched-2.jpg","author":"Ally Condie","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/crossed-matched-2.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:34:47 PM"}}
