{"id":98576,"no":5,"title":"Page 5","content":"The flood may bear me far,\\n\\n I hope to see my Pilot face to face\\n\\n When I have crossed the bar.”\\n\\n I don’t see how there can be more than this. How anything from these bodies can last when they die so easily and decay so fast. Still, part of me wants to believe that the flood of death carries us someplace after all. That there’s someone to see at the end. That’s the part of me that says the words over the dead when I know they don’t hear a thing I say.\\n\\n “Why do you say that every time?” Vick asks me.\\n\\n “I like the sound.”\\n\\n Vick waits. He wants me to speak more but I won’t. “You know what it means?” he asks, finally.\\n\\n “It’s about someone hoping for more,” I tell him noncommittally. “It’s part of a poem from before the Society.” Not from the poem that belongs to Cassia and me. I won’t speak those words to anyone again until I can tell them to her. The poem I say now is the other one she found in her artifact when she opened it that day in the woods.\\n\\n She didn’t know I was there. I stood, watching her read the paper. I saw her lips forming the words of a poem I didn’t know, and then of one I did. When I realized what she was saying about the Pilot, I stepped forward and a stick snapped under my foot.\\n\\n “Doesn’t do them any good,” Vick tells me, gesturing to one of the bodies and then shoving his sandy hair back from his face in irritation. They won’t give us scissors or razors for cutting our hair or shaving—too easy to turn into weapons to kill each other or ourselves. It doesn’t usually matter. Only Vick and I have been out here long enough to have hair that falls into our eyes. “So that’s all it is? Some old poem?”\\n\\n I shrug.\\n\\n It’s a mistake.\\n\\n Usually, Vick doesn’t care when I don’t answer him, but this time I see a challenge in his eyes. I start planning the best way to take him down. The increase in firings has affected him, too. Put him on edge. He’s bigger than me but not by much, and I learned to fight out here years ago. Now that I am back I remember it, like the snow on the plateau. My muscles tense.\\n\\n But Vick stops. “You never cut notches in your boot,” he says, his voice back to even and his eyes back to calm.\\n\\n “No,” I agree.\\n\\n “Why?”\\n\\n “No one needs to know,” I say.\\n\\n “To know what? How long you’ve lasted?” Vick asks.\\n\\n “To know anything about me,” I say.\\n\\n We leave the graves behind and take a break for lunch, sitting on a group of sandstone boulders outside of the village. The colors are the red orange brown of my childhood, and their texture is the same: dry and rough and—in November—cold.\\n\\n I use the narrow end of the decoy gun to scratch a mark into the sandstone. I don’t want anyone to know I can write, so I don’t write her name.\\n\\n Instead I draw a curve. A wave. Like an ocean, or a piece of green silk rolling in the wind.\\n\\n Scratch, scratch. The sandstone, shaped by other forces, water and wind, is now altered by me. Which I like. I always carve myself into what others want me to be. With Cassia on the Hill—only then was I truly myself.\\n\\n I’m not ready yet to draw her face. I don’t even know if I can. But I scratch another curve into the rock. It looks a little like the C I first taught her to write. I make the curve again, remembering her hand.\\n\\n Vick leans over to see what I’m doing. “That doesn’t look like anything.”\\n\\n “It looks like the moon,” I tell him. “When it’s thin.”\\n\\n Vick glances up at the plateau. Earlier today some air ships came for the bodies. That hasn’t happened before. I don’t know what the Society has done with them, but I wish I’d thought to climb up to the top and write something to mark the decoys’ passing.\\n\\n Because now there is nothing to say that they were ever there. The snow melted before they could make a footprint in it. Their lives ended before they even knew what they could be.\\n\\n “You think that boy was lucky?” I ask Vick. “The one who died in camp, before we came to the villages?”\\n\\n “Lucky,” Vick says, as if he doesn’t know what the word means. And maybe he doesn’t. Luck is not a word the Society encourages. And it’s not something we have much of out here.\\n\\n There was a firing our first night out in the villages. We all started running to take cover. A few of the boys ran out into the street with their guns and shot at the sky. Vick and I ended up in the same house with one or two others. I don’t remember their names. They’re gone now.\\n\\n “Why aren’t you out there trying to shoot back?” Vick asked me then. We hadn’t talked to each other much since we put the boy in the river.\\n\\n “No reason to,” I said. “The ammunition isn’t real.” I put my standard-issue gun on the ground next to me.\\n\\n Vick puts his gun down, too. “How long have you known?”\\n\\n “Since they gave them to us on our way here,” I said. “What about you?”\\n\\n “The same,” Vick answered. “We should have told the others.”\\n\\n “I know,” I said. “I was stupid. I thought we’d have a little more time.”\\n\\n “Time,” Vick said, “is what we don’t have.”\\n\\n The world shattered outside and someone else started screaming.\\n\\n “I wish I had a gun that worked,” Vick said. “I’d blow everyone on those air ships away. Pieces of them would come down like fireworks.”\\n\\n “Finished,” Vick says now, folding up his foilware into a sharp silver square. “We’d better get back to work.”\\n\\n “I wonder why they don’t just give us blue tablets,” I say. “Then they wouldn’t have to bother with our meals.”\\n\\n Vick looks at me as if I’m crazy. “You don’t know?”\\n\\n “Know what?” I ask.\\n\\n “The blue tablets don’t save you. They stop you. If you take one, you’ll slow down and stay where you are until someone finds you or you die waiting. Two will finish you outright.”\\n\\n I shake my head and look up at the sky, but I’m not looking for anything. I only look to see the blue. I hold my hand up and block out the sun so I can see the sky around it better. No clouds.\\n\\n “Sorry,” Vick says, “but it’s true.”\\n\\n I glance over at Vick. I think I see concern on his stone-hard face. It’s so ludicrous, all of it, that I start to laugh, and Vick laughs too. “I should have known,” I say. “If something happened to the Society, they wouldn’t want anyone to live on without them.”\\n\\n A few hours later we hear a beep from the miniport Vick carries. He pulls it from his belt loop and checks the screen. Vick’s the only decoy who has a miniport—a device roughly the same size as a datapod. Miniports, however, can be used for communication. A datapod only stores information. Vick keeps the miniport with him most of the time, but now and then—like when he tells new decoys the truth about the village and the guns—he hides the port somewhere for a little while.\\n\\n We’re pretty sure that the Society tracks our location by the miniport. We don’t know if they can listen in on us too, the way they can on the larger ports. Vick thinks so. He thinks the Society listens all the time. I don’t think they care.\\n\\n “What do they want?” I ask Vick as he reads the message on his screen.\\n\\n “We’re moving,” he says.\\n\\n Others fall in line with us as we walk to meet the ships that land silently outside of the village. The Officers act hurried, as usual. They don’t like to spend much time out here. I’m not sure if it’s because of us or because of the Enemy. I wonder who they think is the bigger threat.\\n\\n He’s young, but the Officer in charge of this transfer reminds me of the one who used to be in charge of us on the Hill back in Oria. His expression says How did I end up here? What am I supposed to do with these people?\\n\\n “So,” he says, looking out at us. “Up on the plateau. What was that? What happened there? The casualties wouldn’t have been nearly so bad if you’d all stayed down in the village.”\\n\\n “There was snow up there this morning and they went up to get it,” I say. “We’re always thirsty.”\\n\\n “You’re sure that’s the only reason they were up there?”\\n\\n “There aren’t many reasons to do anything,” Vick says. “Hunger. Thirst. Not dying. That’s all there is. So if you don’t believe us, take your pick from the other two.”\\n\\n “Maybe they hiked up there for the view,” the Officer suggests.\\n\\n Vick laughs, and it’s not a good sound. “Where are the replacements?”\\n\\n “They’re on the ship,” the Officer says. “We’re going to take you all to a new village, and we’ll give you more supplies.”\\n\\n “And more water,” Vick says. Though he’s unarmed and at the mercy of the Officer he sounds like he’s the one giving the orders. The Officer smiles. The Society isn’t human but the people who work for it sometimes are.\\n\\n “And more water,” the Officer says.\\n\\n Vick and I both curse under our breath when we see the replacements on the air ship. They are young, much younger than us. They look to be fourteen, thirteen. Their eyes are wide. Frightened. One of them, the youngest-looking kid, looks a little like Cassia’s brother, Bram. He’s darker-skinned than Bram, darker than me, even, but his eyes are bright like Bram’s. Before it was cut, his hair must have been curly like Bram’s.\\n\\n “The Society must be running out of bodies,” I say to Vick, keeping my voice low.\\n\\n “Maybe that’s the plan,” he says.\\n\\n We both know the Society wants the Aberrations dead. It explains why we’re dumped out here. Why we don’t get to fight. But there’s another question, one I can’t answer:\\n\\n Why do they hate us so much?\\n\\n We fly blind. The air ship is windowless except for the pilot’s compartment.\\n\\n So it’s not until we step outside that I know where we are.\\n\\n I don’t know the village itself but I know the area. The field we walk is orange-sanded and black-rocked, yellow-grassed with plants that grew green this summer. There are fields like this one all over the Outer Provinces. But I still know exactly where I am because of what I see in front of me.\\n\\n I’m home.\\n\\n It hurts.\\n\\n There it is on the horizon—the landmark of my childhood.\\n\\n The Carving.\\n\\n From where we are now, I can’t see all of it—just pieces of red or orange sandstone jutting up here and there. But when you get closer—when you reach the edge and look into the Carving—you realize that the stones aren’t small at all. They’re the tips of formations as large as mountains.\\n\\n The Carving isn’t one canyon, one mountain, but many—a network of interlocking formations that goes on for miles. The land rises and falls like water, its high jagged peaks and deep slot canyons striped with the colors of the Outer Provinces—gradations of orange, red, white. In the faraway stretches of the Carving the fire colors of the sandstone grow shadowed with blue from distant clouds. \\n\\n","sourceLink":"https://allnovel.net/crossed-matched-2/page-5.html","bookId":1644,"book":{"id":1644,"title":"Crossed (Matched #2)","description":"Storyline: Crossed (Matched #2) \\n The Society chooses everything. \\n The books you read. \\n The music you listen to. \\n The person you love. \\n Yet for Cassia the rules have changed. Ky has been taken and she will sacrifice everything to find him. \\n And when Cassia discovers Ky has escaped to the wild frontiers beyond the Society there is hope. \\n But on the edge of society nothing is as it seems...\\n","cover":"https://allnovel.net/images/crossed-matched-2.jpg","author":"Ally Condie","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/crossed-matched-2.html","creation":"Oct 5, 2019 8:57:48 AM","modification":"Oct 5, 2019 6:34:47 PM"}}
