{"id":70044,"no":18,"title":"Page 18","content":"MARIA PRESTON FLOATED INTO THE SIXTH-FLOOR Caprice restaurant in Hong Kong\u0027s Four Seasons Hotel. In a chiffon caftan, dripping in newly bought pearls from the Guangzhou City jewelry district, she waved the newspaper excitedly at her husband.\\n\\n \"Have you seen this, Andy?\"\\n\\n \"Seen what, my love?\"\\n\\n \"Grace Brookstein\u0027s escaped from prison!\"\\n\\n Andrew Preston went white. \"Escaped? What do you mean she\u0027s escaped? That\u0027s not possible.\" Snatching the paper, he read the front-page story.\\n\\n A major police operation was under way last night in New York after convicted con artist Grace Brookstein apparently broke out of a maximum-security facility in Westchester County. Brookstein, one of the most notorious women in America, is believed to have stolen upward of $70 billion in a conspiracy masterminded by her late husband, Leonard...\\n\\n \"Can you believe it?\" Maria giggled as she poured herself a large glass of fresh orange juice. \"Escaped from jail. It\u0027s like something out of Desperate Housewives. Next thing you know she\u0027ll wake up in the shower with amnesia and the last twenty years will never have happened! Do you think they\u0027ll catch her?\"\\n\\n Andrew was too stunned to speak. This was a disaster. A catastrophe. Just when he thought the whole nightmare was behind him, Grace had to pull a stunt like this and reopen old wounds. Maria seemed to think it was some sort of joke. But then why wouldn\u0027t she? She had no idea of the stress he\u0027d been under. As long as she had money to spend - this trip to Hong Kong alone had cost over $40,000, not including the astronomical sums Maria had \"saved\" on pearl jewelry - she was happy. What was it to her if Andrew hadn\u0027t slept properly in over a year? If he lay in their bed in the $12,000-a-night presidential suite overlooking Victoria Harbor and Kowloon Bay, bent double with stomach cramps and crippling migraines, haunted by nightmares involving Lenny Brookstein and the scarred, terrifying face of a man named Donald Anthony Le Bron? Had it not been for Maria, he would never have done what he did. Never have betrayed a friend, never have become a thief, never have had cause to associate with the likes of Le Bron. And yet he couldn\u0027t tell her. He just couldn\u0027t.\\n\\n Most distressing of all was the alopecia. Since last Christmas, Andrew\u0027s hair had started falling out in clumps, like a dog with mange. He panicked. I\u0027m falling to pieces. Literally. It\u0027s the beginning of the end.\\n\\n Thank God it was John Merrivale who had to deal with the FBI day in, day out, and not him. The stress would have finished him off. Andrew could hear John\u0027s voice in his head now, repeating the mantra: \"Just stick to the story and you\u0027ll be f-fine. We both will.\"\\n\\n So far, they had. But Grace\u0027s escape could change everything.\\n\\n \"Andy, are you listening to me? I said, do you think they\u0027ll catch her?\"\\n\\n \"Yes. I\u0027m sure they\u0027ll catch her.\" They have to.\\n\\n \"What will happen to her then, do you think?\"\\n\\n \"I don\u0027t know. They\u0027ll take her back to jail, I suppose.\"\\n\\n Andrew thought about Grace Brookstein, the sweet, naive child he\u0027d known for all those years. Poor Grace. She was the only truly innocent victim in all of this. Unfortunately, that was what happened to pure little lambs. They got slaughtered.\\n\\n Maria sipped her orange juice contentedly. \"Don\u0027t look so miserable, Andy. Anyone would think it was you the police were after. Now give me back the newspaper, would you? There\u0027s a gorgeous Balenciaga dress in the fashion pages. I\u0027m thinking of having it copied.\"\\n\\n JACK WARNER SAW THE NEWS ON TELEVISION. He was in a bar with Fred Farrell, his campaign manager, discussing his reelection strategy. When he saw Grace\u0027s face on the TV screen, he choked on his pistachios.\\n\\n \"Holy mother of God. Can you believe this?\"\\n\\n Fred Farrell couldn\u0027t. People didn\u0027t break out of places like Bedford Hills. Not in real life. Especially not petite, blond trophy wives like Grace Brookstein.\\n\\n \"You\u0027ll have to make a statement.\"\\n\\n Fred Farrell\u0027s brilliant political mind was already whirring. This was not a good time for the Quorum scandal to come back and haunt them. Grace would probably be caught within a few hours, but the renewed media interest in the Brookstein case could last for months. Jack must not be dragged into it.\\n\\n \"I\u0027ll write you something. In the meantime, go home and lay low.\"\\n\\n Jack Warner went home. During the hour-long drive to Westchester, he composed his thoughts. Fred Farrell didn\u0027t know the half of it. He knew about the gambling debts, and Lenny Brookstein\u0027s refusal to pay them. But Jack Warner had other skeletons in his closet besides gambling. Explosive secrets that could destroy him and put an end to all his political hopes.\\n\\n Lenny knew the truth. But Lenny\u0027s dead, burning in hell, where he belongs.\\n\\n The question was, had he taken his knowledge with him to his watery grave? Or had he shared what he knew with his beloved wife? While Grace was safely under lock and key, it didn\u0027t matter. But now she was out, running for her life. A loose cannon, with nothing to lose.\\n\\n I can\u0027t let that bitch destroy me. I won\u0027t.\\n\\n Honor ran out to the driveway to meet him. Her eyes were red and swollen. It was obvious she\u0027d been crying. \"Oh, Jack! Have you seen the news?\"\\n\\n \"Of course I\u0027ve seen it.\" He bundled her indoors. The press could show up at any minute. \"For God\u0027s sake, pull yourself together. Why are you crying?\"\\n\\n Honor didn\u0027t know. She\u0027d always envied Grace. Resented her. Hated her even. At the same time, her baby sister\u0027s conviction troubled her. Grace was no more capable of perpetrating a sophisticated fraud than she was of changing a tire or filling out a tax return. Honor knew that better than anyone. I should have spoken up for her in court. Or at least visited her in prison. But I didn\u0027t. I did what Jack told me to. I always do what Jack tells me to.\\n\\n \"They said on the news that someone might shoot her. That she\u0027s in more danger from the public than she is from the police.\"\\n\\n \"So?\" Jack wasn\u0027t interested in Grace\u0027s problems. He was interested in his own. \"Fred\u0027s writing me a statement. Until then, I want you and the kids to stay in the house. Don\u0027t talk to anyone about Grace. Do you understand?\"\\n\\n Honor nodded.\\n\\n \"If she tries to contact you, you must inform me immediately. Not the police. Me.\"\\n\\n \"Yes, Jack.\"\\n\\n He started up the stairs. Honor called after him. \"Jack? Why do you think she did it?\"\\n\\n \"What do you mean?\"\\n\\n \"I mean why did she escape? She must have known the danger she was putting herself in. Not to mention blowing any chance of an appeal. It just seems so...reckless. So out of character.\"\\n\\n Jack Warner shrugged. \"Maybe she\u0027s changed. Prison does change people, you know.\"\\n\\n So does politics, thought Honor. She looked at herself in the hall mirror and shivered. She did not recognize the person she\u0027d become.\\n\\n \"ESCAPED? GOOD GOD.\"\\n\\n Michael Gray had spent the day on his new boat, an anniversary present from Connie. He didn\u0027t hear the news till they sat down to dinner that evening.\\n\\n \"I know. I wouldn\u0027t have thought she had it in her. Stowed away in a delivery truck, if you can believe that. So much for \u0027maximum security.\u0027\"\\n\\n Michael looked pained. \"Do you think we should...I don\u0027t know, try to help her in some way?\"\\n\\n Connie\u0027s eyes widened. \"Help her? Whatever do you mean? How can we possibly help her? More to the point, why should we help her, after what she\u0027s done?\"\\n\\n Michael Gray loved his wife, and deferred to her opinions about her own sister. But he\u0027d never felt comfortable about the collective washing of hands and turning of backs that had followed Grace\u0027s trial. It hadn\u0027t felt right at the time. Now, somehow, it felt less right than ever.\\n\\n So much had changed since that fateful trip to Nantucket a year and a half ago. Back then, Lenny and Grace had had everything - a perfect marriage, a fortune - and he and Connie had had nothing. Michael Gray had not forgotten the darkness of those days. Losing his job at Lehman was like losing a parent. Lehman Brothers had been much more than an employer. It had given Michael his identity, his self-worth. When the company failed, it felt like a death. But Michael had had no time to mourn. He\u0027d been plunged into one crisis after another, watching his savings disappear, then the house. Worst of all was the distance that began to grow between him and Connie. Michael Gray felt he could have borne anything with his wife\u0027s support. But with each blow, Connie withdrew from him further. Even the way she looked at him in those days, so disappointed, so disgusted, almost as if what had happened were his fault, as if she blamed him for their suffering...the memory could still cause him to break out in a cold sweat.\\n\\n All that was only eighteen months ago, yet it felt like another lifetime. Since then, they\u0027d lived through Quorum\u0027s collapse, Lenny\u0027s death, Grace\u0027s arrest, the trial...and now this. It was surreal. As Grace\u0027s fortunes had declined, so some invisible string seemed to pull Michael and Connie\u0027s lives upward, out of the mire and back into the warmth of the sun. Michael got a job with a boutique advisory firm. The salary wasn\u0027t great but he had equity. More important, he had a reason to get out of bed in the mornings again. You couldn\u0027t put a price on that. Connie became less distant and more loving. The disappointment was gone. In its place was the old familiar look of love, that unique combination of trust, lust and respect that made Michael feel he could move mountains. He loved her so much.\\n\\n She\u0027s my strength and my weakness. I\u0027d die for her and I\u0027d kill for her. And she knows it.\\n\\n But the best was yet to come. A few months after Grace began her sentence at Bedford Hills, Connie was called to a meeting by her attorney. Apparently some distant, elderly relative had left her something in her will. Michael was expecting a few shares, or perhaps a piece of jewelry.\\n\\n In fact, his wife had been left $15 million.\\n\\n That night she made love to him with a passion Michael hadn\u0027t known in her since before they married. He made a joke. \"I guess being a woman of means suits you, honey.\"\\n\\n Connie beamed. \"I guess it does. Let\u0027s buy a new house, Mike. This place holds too many painful memories.\"\\n\\n \"Hey, come on. It holds some good memories, too, doesn\u0027t it? This is where the kids were born. Do you really want to leave?\"\\n\\n Connie didn\u0027t hesitate. \"Yes. I want a new start. For all of us. No looking back.\"\\n\\n They sold the house.\\n\\n \"I CAN\u0027T BELIEVE YOU\u0027D SERIOUSLY WANT to help Grace? Where did that spring from?\"\\n\\n They were in the formal sitting room of their new town house. Connie had gone all out for their first Christmas, decorating the entire house in silver and white. A traditionalist, she refused to take down any of the decorations till Twelfth Night. Michael felt like he was coming home to Santa\u0027s grotto.\\n\\n \"I don\u0027t know. Nowhere specific. We have so much, that\u0027s all.\"\\n\\n \"And Grace doesn\u0027t?\" Connie laughed bitterly. Whenever the conversation turned to Grace or Lenny, her anger seemed to reemerge, like a caged demon unleashed. \"That Quorum money is out there somewhere, Mike. The FBI is convinced little Gracie knows where it is. Who are we to say different?\"\\n\\n Mike wanted to say, Her family, but he didn\u0027t. He was too afraid.\\n\\n Connie saw the fear in his eyes and felt her own fear subside.\\n\\n Good. He\u0027s not going to force the issue. He loves me too much.\\n\\n Connie was puzzled by her sister\u0027s escape. The Grace she knew would never have had the chutzpah to plan anything so daring, never mind see it through and outfox the police. Deep down Connie knew that Grace had had nothing to do with stealing the Quorum billions.\\n\\n It\u0027s not the money she\u0027s after. It\u0027s something else.\\n\\n The truth, perhaps?\\n\\n Mike still had no idea about Connie\u0027s affair with Lenny Brookstein. Nor had he questioned her mysterious inheritance. He\u0027s so trusting. Just like Grace. Connie wanted it to stay that way.\\n\\n Wrapping her arms around Michael\u0027s neck, she whispered, \"I want us to be happy, darling. To put the past behind us. Don\u0027t you?\"\\n\\n \"Of course I do, my darling.\" He hugged her back fiercely.\\n\\n \"So no more talk about helping Grace. That chapter in our lives is closed forever.\" \\n\\n","sourceLink":"https://allnovel.net/after-the-darkness/page-18.html","bookId":2373,"book":{"id":2373,"title":"After the Darkness","description":"Storyline: Grace Brookstein lived a luxurious lifestyle despite the economic free fall in the US. Then suddenly her billionaire husband Lenny mysteriously disappeares in a tragic sailing accident. Along with Lenny\u0027s disappearance, Lenny\u0027s hedge fund, the Quorum, that has a $75 billion investment is also missing and everyone believes that Grace stole the money. She was convicted and imprisoned. Grace believed that she is framed. Now alone and no one to turn to, she is determined to find out who is framing her and is desperate for revenge.\\n","cover":"https://allnovel.net/images/after-the-darkness.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/after-the-darkness.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:14:57 AM"}}
