{"id":70061,"no":35,"title":"Page 35","content":"THREE WEEKS LATER\\n\\n GRACE CLUNG TO THE RAIL of the fishing boat, wondering if it was physically possible for her to throw up a seventh time.\\n\\n The waves off the coast of Mombasa, Kenya, were vast and terrifying. From a distance each looked like the giant, grimacing mouth of a cobra, rearing up, jaws wide, ready to strike. Up close they were simply walls of water, gray, angry and destructive, mercilessly pounding the rickety wooden trawler. For the first few hours, Grace was afraid she might die. Later, once the seasickness really took hold, she was afraid she might not die. Lying exhausted on her simple wooden bunk, she wondered what possessed people to get into a boat for fun.\\n\\n Eventually the ocean calmed. Out on deck, a blazing African sun shimmered in a sky so blue and cloudless it looked like something from a cartoon. Grace watched the three young Kenyan men lower their nets into the water. There was a simple beauty about the way they worked, silently passing the heavy nets between them, muscles rippling with effort beneath their shiny black skin. When they first set sail, Grace had willed them to hurry. She\u0027d paid eight thousand shillings for her passage, almost a thousand U.S. dollars, a fortune to men like these, and she expected a speedy crossing. Now, if it hadn\u0027t been for the nausea, she would almost have enjoyed the trip.\\n\\n She felt as if she\u0027d been running forever. After she left Gavin Williams smoking in his automotive funeral pyre, she\u0027d hitchhiked to Portsmouth, Virginia. Knowing that the cash from Williams\u0027s wallet would not last long, she\u0027d taken a risk and sent an uncoded e-mail to Karen\u0027s friend, asking for new supplies, money and a fake ID good enough to fool the staff at nearby Norfolk airport. For three days Grace lay low at her motel praying for a package to arrive and anxiously scanning the news channels for word of her escape, or of Gavin Williams\u0027s murder. None came. The powers that be must have hoped they\u0027d find her before she caused them any more embarrassment. By the end of the third day, she was starting to despair that her e-mail had been intercepted when the motel owner informed her that a FedEx envelope had arrived. \"Linda Reynolds. That\u0027s you, right?\"\\n\\n Grace\u0027s heart soared. One day, when all this was over, she would repay her debt to Karen\u0027s mysterious contact, this stranger who had risked so much to help her. Right now, though, she had work to do. Her first call was to Mitch Connors.\\n\\n \"Grace! Thank God you\u0027re alive. Did Williams hurt you? Where are you?\"\\n\\n The sound of his voice made Grace smile.\\n\\n \"Sorry. Can\u0027t tell you. But I\u0027m fine.\"\\n\\n \"Listen, Grace, I know about John Merrivale.\"\\n\\n \"It\u0027s true, then? John killed Lenny?\"\\n\\n Mitch sighed. \"It\u0027s looking that way, yes. We think he was behind the fraud, too. He\u0027s been hoodwinking the FBI this whole time. But for God\u0027s sake, don\u0027t do anything stupid, okay? Everyone knows now - the FBI, the CIA. John\u0027ll get what\u0027s coming to him just as soon as they bring him in.\"\\n\\n \"Bring him in? He\u0027s missing?\"\\n\\n In the silence that followed, Grace could hear Mitch kicking himself. What the hell did I say that for? \"Grace, honey, I\u0027m on your side. You know that.\"\\n\\n Grace blushed. Lenny used to call her \"honey.\" She couldn\u0027t decide if she liked hearing the endearment from Mitch or resented it.\\n\\n \"But you have to let justice take its course. Turn yourself in. Let the feds deal with Merrivale. Grace...Grace?\"\\n\\n After she hung up, Grace sat on her motel bed for a long time, thinking.\\n\\n So John was on the run now. A fugitive. Like me.\\n\\n Everyone was looking for him, that\u0027s what Mitch said. But not because he\u0027d murdered Lenny. No one gave a damn about that. Because they thought he\u0027d taken the money. The stupid money, that was all that mattered to the FBI. Not right and wrong. Not justice. America had forgotten what justice meant. If it ever really knew.\\n\\n Grace closed her eyes. She tried to put herself in John Merrivale\u0027s shoes.\\n\\n Where would I go? With the whole world looking for me. Where would I hide?\\n\\n A few minutes later, Grace opened her eyes. Of course.\\n\\n She picked up the phone. \"I\u0027d like you to send a cab please. Norfolk International Airport. Uh-huh. As soon as you can get one here.\"\\n\\n BACK ON THE FISHING BOAT, LISTENING to the soft lapping of the waves as the warm African sun kissed her face, Grace smiled to herself again, thinking about her revelation in that grimy Virginia motel room and how it had brought her here, halfway across the world. Or perhaps revelation was the wrong word? Memory. It was a memory that had told her where John Merrivale would run, a memory that made her certain of where he was now. The memory was so sweet, Grace closed her eyes and savored it again...\\n\\n IT WAS THE MONTH BEFORE SHE and Lenny got married. They were in France, in a charming little bastide Lenny had rented in the hilltop town of Ramatuelle, a ten-minute drive from Saint-Tropez.\\n\\n Grace sighed. \"I never want to leave here. It\u0027s enchanting.\"\\n\\n They were having dinner with Marie La Classe, Lenny\u0027s French real estate broker, and John and Caroline Merrivale.\\n\\n \"Don\u0027t you find it a bit quiet?\" said Caroline. She\u0027d been lobbying since the start of the vacation for the four of them to move into Le Byblos, or better yet have Lenny\u0027s yacht sail up from Sardinia so they could lord it over the smaller boats in the harbor. What was the point in coming all the way to Saint-Tropez and spending the entire week stranded up a mountain in a dull little village no one had ever heard of?\\n\\n \"S-some people like the quiet,\" John ventured timidly. Caroline shot him a thunderous look.\\n\\n \"It makes me feel like the princess in a tower,\" Grace gushed, beaming at Lenny, who beamed back. \"Like I\u0027m stranded on the most beautiful island and no one can reach me.\"\\n\\n \"\u0027Ave you ever been to Madagascar?\"\\n\\n They all turned to look at Marie.\\n\\n \"All the culture of France, combined with the natural beauty of Africa, encapsulated in a single, unspoiled island. I grew up there.\"\\n\\n \"It sounds magical,\" said Grace.\\n\\n \"It is. You would love it. The wildlife, the scenery, the view from Fort Dauphin is one of the wonders of the world. Je vous assure.\"\\n\\n \"I\u0027ll tell you something else about Madagascar.\" Lenny grinned that naughty, schoolboy grin of his, stabbing a piece of perfectly cooked lobster tail with his fork. \"It\u0027s a crook\u0027s paradise. No extradition treaty with the United States. Did you know that, Marie?\"\\n\\n Marie smiled politely. \"I did not.\"\\n\\n Caroline said, \"Well, if John ever robs a bank, we\u0027ll move there. In the meantime, I, for one, am pining for a bit of civilization. Who\u0027s on for a trip to Les Caves after dinner?\"\\n\\n THE PROPERTY WAS IN ANTANANARIVO, ON a hilly, cobbled street that might have been lifted brick by brick from Ramatuelle. With its two-foot-thick stone walls and imposing turrets, it was more like a small castle than a house. A retreat, in every sense of the word.\\n\\n Lenny looked at Grace. \"Is this the one?\"\\n\\n They\u0027d been in Madagascar less than two days, with Marie La Classe acting as their tour guide, and already Grace had fallen in love. They both had.\\n\\n \"This is the one.\"\\n\\n Lenny pulled out a checkbook, wrote a check for 10 percent more than the asking price and handed it to Marie. He turned to Grace and smiled. \"Happy one-month anniversary, Gracie.\"\\n\\n Grace had been so happy, she\u0027d danced in the street.\\n\\n They called the house \"Le Cocon\" - the cocoon. They planned to retire there.\\n\\n JOHN MERRIVALE WASN\u0027T WELL. HIS DOCTOR prescribed antidepressants and a month of total peace.\\n\\n \"Here.\" Lenny pressed the keys to Le Cocon into his hands. \"Take as long as you need. There\u0027s a housekeeper, Madame Thomas, in permanent residence. She\u0027ll wash and cook for you, but otherwise you\u0027ll be alone.\"\\n\\n John was touched, but the idea wasn\u0027t practical. \"I c-can\u0027t just disappear to Madagascar. What about Quorum?\"\\n\\n \"We\u0027ll be fine.\"\\n\\n \"C-Caroline will never agree to it.\"\\n\\n \"Leave Caroline to me.\"\\n\\n When he returned to New York six weeks later, John was a new man. He showed Lenny and Grace the photographs. Himself, strolling the cobbled streets of Upper Town in Antananarivo, relaxing in the hot springs of Antsirabe, trekking through the rain forest at Ranomafana.\\n\\n Of course, his happiness didn\u0027t last. Caroline made sure of that. But Grace would never forget the look of childlike wonder on John\u0027s face when he spoke of Madagascar. He even approached Lenny privately about buying Le Cocon.\\n\\n \"Name your price.\"\\n\\n Lenny smiled. \"Sorry, buddy. Any house but that one. The guest suite will always have your name on it. But she\u0027s not for sale.\"\\n\\n GRACE CALLED TO THE FISHERMEN. \"Combien de temps encore?\"\\n\\n \"Environ deux heures. Trois peut-etre. Vous allez bien?\"\\n\\n Grace wasn\u0027t doing fine. But she would be once they got there. Reaching into the knapsack she never let out of her sight, she fingered Gavin Williams\u0027s gun lovingly, stroking it the way a child might a teddy bear. She wondered how long it would take her to track John down once they got to the island. Le Cocon had been sold when Quorum was liquidated. The buyer was a Dutch Internet entrepreneur, a man named Jan Beerens.\\n\\n I\u0027ll start with him. \\n\\n","sourceLink":"https://allnovel.net/after-the-darkness/page-35.html","bookId":2373,"book":{"id":2373,"title":"After the Darkness","description":"Storyline: Grace Brookstein lived a luxurious lifestyle despite the economic free fall in the US. Then suddenly her billionaire husband Lenny mysteriously disappeares in a tragic sailing accident. Along with Lenny\u0027s disappearance, Lenny\u0027s hedge fund, the Quorum, that has a $75 billion investment is also missing and everyone believes that Grace stole the money. She was convicted and imprisoned. Grace believed that she is framed. Now alone and no one to turn to, she is determined to find out who is framing her and is desperate for revenge.\\n","cover":"https://allnovel.net/images/after-the-darkness.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/after-the-darkness.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:14:57 AM"}}
