{"id":31435,"no":17,"title":"The Fiend","content":"Esquire (January 1935) \n \n On June 3, 1895, on a country road near Stillwater, Minnesota, Mrs. Crenshaw Engels and her seven year old son, Mark, were waylaid and murdered by a fiend, under circumstances so atrocious that, fortunately, it is not necessary to set them down here. \n \n Crenshaw Engels, the husband and father, was a photographer in Stillwater. He was a great reader and considered “a little unsafe,” for he had spoken his mind frankly about the railroad-agrarian struggles of the time — but no one denied that he was a devoted family man, and the catastrophe visited upon him hung over the little town for many weeks. There was a move to lynch the perpetrator of the horror, for Minnesota did not permit the capital punishment it deserved, but the instigators were foiled by the big stone penitentiary close at hand. \n \n The cloud hung over Engel’s home so that folks went there only in moods of penitence, of fear or guilt, hoping that they would be visited in turn should their lives ever chance to trek under a black sky. The photography studio suffered also: the routine of being posed, the necessary silences and pauses in the process, permitted the clients too much time to regard the prematurely aged face of Crenshaw Engels, and high school students, newly married couples, mothers of new babies, were always glad to escape from the place into the open air. So Crenshaw’s business fell off and he went through a time of hardship — finally liquidating the lease, the apparatus and the good will, and wearing out the money obtained. He sold his house for a little more than its two mortgages, went to board and took a position clerking in Radamacher’s Department Store. \n \n In the sight of his neighbors he had become a man ruined by adversity, a man manqué, a man emptied. But in the last opinion they were wrong — he was empty of all save one thing. His memory was long as a Jew’s, and though his heart was in the grave he was sane as when his wife and son had started on their last walk that summer morning. At the first trial he lost control and got at the Fiend, seizing him by the necktie — and then had been dragged off with the Fiend’s tie in such a knot that the man was nearly garotted. \n \n At the second trial Crenshaw cried aloud once. Afterwards he went to all the members of the state legislature in the county and handed them a bill he had written himself for the introduction of capital punishment in the state — the bill to be retroactive on criminals condemned to life imprisonment. The bill fell through; it was on the day Crenshaw heard this that he got inside the penitentiary by a ruse and was only apprehended in time to be prevented from shooting the Fiend in his cell. \n \n Crenshaw was given a suspended sentence and for some months it was assumed that the agony was fading gradually from his mind. In fact when he presented himself to the warden in another r?le a year after the crime, the official was sympathetic to his statement that he had had a change of heart and felt he could only emerge from the valley of shadow by forgiveness, that he wanted to help the Fiend, show him the True Path by means of good books and appeals to his buried better nature. So, after being carefully searched, Crenshaw was permitted to sit for half an hour in the corridor outside the Fiend’s cell. \n \n But had the warden suspected the truth he would not have permitted the visit — for, far from forgiving, Crenshaw’s plan was to wreak upon the Fiend a mental revenge to replace the physical one of which he was subducted. \n \n When he faced the Fiend, Crenshaw felt his scalp tingle. From behind the bars a roly-poly man, who somehow made his convict’s uniform resemble a business suit, a man with thick brown-rimmed glasses and the trim air of an insurance salesman, looked at him uncertainly. Feeling faint Crenshaw sat down in the chair that had been brought for him. \n \n “The air around you stinks!” he cried suddenly. “This whole corridor, this whole prison.” \n \n “I suppose it does,” admitted the Fiend, “I noticed it too.” \n \n “You’ll have time to notice it,” Crenshaw muttered. “All your life you’ll pace up and down stinking in that little cell, with everything getting blacker and blacker. And after that there’ll be hell waiting for you. For all eternity you’ll be shut in a little space, but in hell it’ll be so small that you can’t stand up or stretch out.” \n \n “Will it now?” asked the Fiend concerned. \n \n “It will!” said Crenshaw. “You’ll be alone with your own vile thoughts in that little space, forever and ever and ever. You’ll itch with corruption so that you can never sleep, and you’ll always be thirsty, with water just out of reach.” \n \n “Will I now?” repeated the Fiend, even more concerned. “I remember once —” \n \n “All the time you’ll be full of horror,” Crenshaw interrupted. “You’ll be like a person just about to go crazy but can’t go crazy. All the time you’ll be thinking that it’s forever and ever.” \n \n “That’s bad,” said the Fiend, shaking his head gloomily. “That’s real bad.” \n \n “Now listen here to me,” went on Crenshaw. “I’ve brought you some books you’re going to read. It’s arranged that you get no books or papers except what I bring you.” \n \n As a beginning Crenshaw had brought half a dozen books which his vagarious curiosity had collected over as many years. They comprised a German doctor’s thousand case histories of sexual abnormality — cases with no cures, no hopes, no prognoses, cases listed cold; a series of sermons by a New England Divine of the Great Revival which pictured the tortures of the damned in hell; a collection of horror stories; and a volume of erotic pieces from each of which the last two pages, containing the consummations, had been torn out; a volume of detective stories mutilated in the same manner. A tome of the Newgate calendar completed the batch. These Crenshaw handed through the bars — the Fiend took them and put them on his iron cot. \n \n This was the first of Crenshaw’s long series of fortnightly visits. Always he brought with him something somber and menacing to say, something dark and terrible to read — save that once when the Fiend had had nothing to read for a long time he brought him four inspiringly titled books — that proved to have nothing but blank paper inside. Another time, pretending to concede a point, he promised to bring newspapers — he brought ten copies of the yellowed journal that had reported the crime and the arrest. Sometimes he obtained medical books that showed in color the red and blue and green ravages of leprosy and skin disease, the mounds of shattered cells, the verminous tissue and brown corrupted blood. \n \n And there was no sewer of the publishing world from which he did not obtain records of all that was gross and vile in man. \n \n Crenshaw could not keep this up indefinitely both because of the expense and because of the exhaustibility of such books. When five years had passed he leaned toward another form of torture. He built up false hopes in the Fiend with protests of his own change of heart and manoeuvres for a pardon, and then dashed the hopes to pieces. Or else he pretended to have a pistol with him, or an inflammatory substance that would make the cell a raging Inferno and consume the Fiend in two minutes — once he threw a dummy bottle into the cell and listened in delight to the screams as the Fiend ran back and forth waiting for the explosion. At other times he would pretend grimly that the legislature had passed a new law which provided that the Fiend would be executed in a few hours. \n \n A decade passed. Crenshaw was gray at forty — he was white at fifty when the alternating routine of his fortnightly visits to the graves of his loved ones and to the penitentiary had become the only part of his life — the long days at Radamacher’s were only a weary dream. Sometimes he went and sat outside the Fiend’s cell, with no word said during the half hour he was allowed to be there. The Fiend too had grown white in twenty years. He was very respectable-looking with his horn-rimmed glasses and his white hair. He seemed to have a great respect for Crenshaw and even when the latter, in a renewal of diminishing vitality, promised him one day that on his very next visit he was going to bring a revolver and end the matter, he nodded gravely as if in agreement, said, “I suppose so. Yes, I suppose you’re perfectly right,” and did not mention the matter to the guards. On the occasion of the next visit he was waiting with his hands on the bars of the cell looking at Crenshaw both hopefully and desperately. At certain tensions and strains death takes on, indeed, the quality of a great adventure as any soldier can testify. \n \n Years passed. Crenshaw was promoted to floor manager at Radamacher’s — there were new generations now that did not know of his tragedy and regarded him as an austere nonentity. He came into a little legacy and bought new stones for the graves of his wife and son. He knew he would soon be retired and while a third decade lapsed through the white winters, the short sweet smoky summers, it became more and more plain to him that the time had come to put an end to the Fiend; to avoid any mischance by which the other would survive him. \n \n The moment he fixed upon came at the exact end of thirty years. Crenshaw had long owned the pistol with which it would be accomplished; he had fingered the shells lovingly and calculated the lodgement of each in the Fiend’s body, so that death would be sure but lingering — he studied the tales of abdominal wounds in the war news and delighted in the agony that made victims pray to be killed. \n \n After that, what happened to him did not matter. \n \n When the day came he had no trouble in smuggling the pistol into the penitentiary. But to his surprise he found the Fiend scrunched up upon his iron cot, instead of waiting for him avidly by the bars. \n \n “I’m sick,” the Fiend said. “My stomach’s been burning me up all morning. They gave me a physic but now it’s worse and nobody comes.” \n \n Crenshaw fancied momentarily that this was a premonition in the man’s bowels of a bullet that would shortly ride ragged through that spot. \n \n “Come up to the bars,” he said mildly. \n \n “I can’t move.” \n \n “Yes, you can.” \n \n “I’m doubled up. All doubled up.” \n \n “Come doubled up then.” \n \n With an effort the Fiend moved himself, only to fall on his side on the cement floor. He groaned and then lay quiet for a minute, after which, still bent in two, he began to drag himself a foot at a time toward the bars. \n \n Suddenly Crenshaw set off at a run toward the end of the corridor. \n \n “I want the prison doctor,” he demanded of the guard, “That man’s sick — sick, I tell you.” \n \n “The doctor has —” \n \n “Get him — get him now!” \n \n The guard hesitated, but Crenshaw had become a tolerated, even privileged person around the prison, and in a moment the guard took down his phone and called the infirmary. \n \n All that afternoon Crenshaw waited in the bare area inside the gates, walking up and down with his hands behind his back. From time to time he went to the front entrance and demanded of the guard: \n \n “Any news?” \n \n “Nothing yet. They’ll call me when there’s anything.” \n \n Late in the afternoon the Warden appeared at the door, looked about and spotted Crenshaw. The latter, all alert, hastened over. \n \n “He’s dead,” the Warden said. “His appendix burst. They did everything they could.” \n \n “Dead,” Crenshaw repeated. \n \n “I’m sorry to bring you this news. I know how —” \n \n “It’s all right,” said Crenshaw, and licking his lips. “So he’s dead.” \n \n The Warden lit a cigarette. \n \n “While you’re here, Mr. Engels, I wonder if you can let me have that pass that was issued to you — I can turn it in to the office. That is — I suppose you won’t need it any more.” \n \n Crenshaw took the blue card from his wallet and handed it over. The Warden shook hands with him. \n \n “One thing more,” Crenshaw demanded as the Warden turned away. “Which is the — the window of the infirmary?” \n \n “It’s on the interior court, you can’t see it from here.” \n \n “Oh.” \n \n When the Warden had gone Crenshaw still stood there a long time, the tears running out down his face. He could not collect his thoughts and he began by trying to remember what day it was; Saturday, the day, every other week, on which he came to see the Fiend. \n \n He would not see the Fiend two weeks from now. \n \n In a misery of solitude and despair he muttered aloud: “So he is dead. He has left me.” And then with a long sigh of mingled grief and fear, “So I have lost him — my only friend — now I am alone.” \n \n He was still saying that to himself as he passed through the outer gate, and as his coat caught in the great swing of the outer door the guard opened up to release it, he heard a reiteration of the words: \n \n “I’m alone. At last — at last I am alone.” \n \n Once more he called on the Fiend, after many weeks. \n \n “But he’s dead,” the Warden told him kindly. \n \n “Oh, yes,” Crenshaw said. “I guess I must have forgotten.” \n \n And he set off back home, his boots sinking deep into the white diamond surface of the flats. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1357/40711.html","bookId":1452,"book":{"id":1452,"title":"Taps at Reveille","description":"简介： It was a hot afternoon in May and Mrs. Buckner thought that a pitcher of fruit lemonade might prevent the boys from filling up on ice cream at the drug store. She belonged to that generation, since retired, upon whom the great revolution in American...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1357","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
