{"id":90970,"no":4,"title":"Page 4","content":"Words flashed through Jenny\u0027s mind. Did I ever tell you about this amusement park nightmare I had when I was a kid-?\" \"Listen.\" She turned around abruptly. \"Besides Michael, has anybody else had amusement park nightmares?\" Audrey stopped, flashlight drooping. After a moment she said in a subdued voice, \"I have.\" Dee said quietly, \"Me, too.\" \"And so have I,\" Jenny said. \"Maybe it\u0027s one of those universal things-\" \"An archetype,\" Michael interrupted pugnaciously, his voice wobbling slightly. \"But so what? That doesn\u0027t mean anything... .\" Jenny realized then just how bad his dreams must have been. \"Don\u0027t be silly, Michael,\" Audrey said, very gently. She reached out and Michael snuck a finger into her hand. \"You think?\" she said to Jenny. \"I don\u0027t know. It\u0027s nothing like I expected. It looks like Joyland, but-\" \"But Julian can make anything look like anything,\" Audrey finished crisply. Dee looked around, then chuckled. \"All right! Listen, you idiots,\" she said, turning back to them. \"This is good. If it is the Shadow World-or part of it-it\u0027s a place we\u0027ve been. We\u0027ll have an advantage, because we know the terrain. And it\u0027s better than blue-and-green blizzards, or whatever Jenny saw out that window last time, right?\" Audrey nodded without enthusiasm. Michael didn\u0027t move. \"And if it\u0027s not the Shadow World, we\u0027re in real trouble. Because it means we\u0027ve blown our chance to find Tom and Zach. Maybe our only chance.\" \"Cest juste,\" Audrey said. \"I forgot.\" Jenny hadn\u0027t forgotten. \"We\u0027d better check around. See if this is the real Joyland or-\" She didn\u0027t need to finish the sentence. She didn\u0027t know exactly how they were supposed to tell. The place certainly looked authentic. They crept through the silent park, heading automatically for the front gates, passing a restaurant, dark and still. \"What\u0027s that?\" Audrey hissed. \"I hear something.\" It was the sound of water. Faint, coming from up ahead. \"It\u0027s the Fish Pond,\" Jenny said. She recognized the booth with its red-shingle roof. It was dark, like the other attractions. But when they reached it, she saw that the opaque water was swirling around its circular channel. \"They wouldn\u0027t leave that on all night,\" Audrey said, needle-sharp. \"Would they? Would they?\" Jenny\u0027s pulse, which had been beating erratically, settled into a slow, heavy thumping. \"You know what, Toto? I don\u0027t think we\u0027re in Kansas anymore,\" she whispered. \"Well, well,\" Dee said, stepping forward. \"How about this?\" There was a fishing pole leaning against the booth. Dee hooked an index finger around it. \"Ah. Now. I have a very bad feeling about that,\" Michael said. It was the first time he\u0027d spoken in minutes. Jenny understood what he meant. It was too obvious, too inviting. But they didn\u0027t know they weren\u0027t in Joyland. It was possible that the park might leave the water going at night. Maybe it kept algae from growing or something. \"Shall I?\" Dee said, twirling the pole. \"Or shall I?\" \"You\u0027re enjoying yourself, aren\u0027t you?\" Michael said, and there was something flatly resentful about his voice. \"But there\u0027s other people here, you know. Whatever trouble you make affects us, too....\" \"Oh, come on, you guys. It\u0027s the only way to find out, isn\u0027t it?\" Jenny chewed her lip. Sometimes Dee\u0027s recklessness went out-of-bounds, and nobody but Jenny could stop her. If Jenny didn\u0027t say anything, Dee would do it. Jenny hesitated. Dee lowered the line into the dark, rushing water. Jenny realized that she and Audrey and Michael were all braced. None of them was stupid. If this was the Shadow World, something bad would happen. Something bad. The line dangled in the water, slack. Dee jiggled the pole while Jenny thought of all the things that might come up. Dead kittens. Severed hands. Mutant marine life. Julian knew what you were thinking. He took things from your mind and made them real. So if they were in the Shadow World, then the worst thing-the worst thing that any of them was thinking- \"A bite,\" Dee said. \"No, maybe it\u0027s just caught.\" She leaned over to look, catching the thick yarnlike line in her bare hand and tugging. \"Dee-\" \"Come on, come on.\" Dee tugged, then reached into the water to grope. \"What\u0027s wrong with-\" \"Dee, don\u0027t-\" Audrey screamed. The water erupted. Jenny had seen a geyser once, not Old Faithful, but a smaller one. This looked just the same. There was an explosion of mud-colored water, straight up. It splattered across Jenny\u0027s face and beaded on her windbreaker. Then it just stayed there, until Jenny suddenly realized that it wasn\u0027t water at all, it was something that had come out of the water. Something that had come out and grabbed hold of Dee. A man-it had hands like a man that were around Dee\u0027s throat. But something kept Jenny\u0027s brain from recognizing it as a man. In another instant she saw what it was. The thing had no head. Its body ended at the shoulders with the stump of a neck. The thing had volition, though, even if it didn\u0027t have a brain. It was trying to drag Dee under the water. All this passed through Jenny\u0027s mind in less than a second. Plenty long enough, though, for the thing to wrestle Dee almost to the water\u0027s surface. I\u0027m not brave. I don\u0027t know how to fight. But she was grabbing at the thing\u0027s arm with both hands. To her horror, her fingernails sank in, penetrating the arm beneath the tatter of a sleeve. It smelled. It smelled incredibly. Something terrible had happened to the flesh, turning it into a kind of white, waxy stuff that quivered loosely on its bones. Like-like that clammy clinging stuff novelty stores use for flesh. Jenny\u0027s little brother Joey had a fake snake made out of it. But this creature\u0027s flesh was nothing fake. When Jenny involuntarily snatched her hand back, she saw that her nails were full of it. Everyone was shouting. Somebody was screaming, and after another second Jenny recognized her own voice. With both legs trapped up against the booth and Michael and Audrey hanging on to her, Dee didn\u0027t have room to kick. She was fumbling with the knife at her belt. She got it free and her arm went up-and then Michael yanked her and the wicked-looking river knife fell into the swirling water. \"Her shirt! Her shirt! Her shirt!\" Michael was yelling. The body now had Dee by the collar. Michael was trying to pull Dee out of the shirt, but the buttons in front were holding. Jenny didn\u0027t want to touch the headless thing with her bare hands again. She didn\u0027t, she didn\u0027t-but then the thing wrestled Dee\u0027s head almost into the water, and Jenny found herself grabbing its rubbery arm again. It was bent over, dunking Dee\u0027s head like someone dunking wash in a river, and Jenny stared directly into its neck-stump. Nothing about its body was nice to look at. What flesh could be seen through the rags of clothes was grotesque-bloated and swollen until it looked like a Kewpie doll that had been boiled and then inflated with a bicycle pump. The screaming and shouting were still going on. None of their pulling was doing any good. Without conscious thought, Jenny found herself scrambling over the wall of the booth, over the channel. One leg dangled in the rushing water, then she was standing in the booth behind the headless thing. \"Pull, Michael! Pull!\" Jenny grabbed the thing from behind, arms closing around its waist just above the water level. The waist squashed, like an overripe peach. She could feel things shifting inside the dripping clothes. Her cheek was pressed up against the back of its wet shirt. She locked one of her hands around the opposite wrist and pulled harder. Oh, God-the smell. She opened her mouth to scream again at Michael and gagged instead She couldn\u0027t see anything that was going on in front. All she could do was hang on and keep pulling backward. The thing seemed to be rooted in the water. She couldn\u0027t drag it out. It was a ghastly tug-of-war, with her pulling at the body and Michael and Audrey pulling at Dee. But suddenly she felt something give. The body lurched backward, the tension was gone. Dee was free. Jenny let go and staggered into the wall of prizes behind her. The thing\u0027s arms flailed for a moment, coming in contact with nothing but air. Then, as if something had grabbed its feet and jerked it sharply downward, it disappeared into the dark water. Everything was silent again. Jenny was sitting in a litter of plastic whistles, cellophane leis, Matchbox cars, and stuffed koalas. She picked herself up, swaying, and looked over the water channel. Dee was sprawled almost on Michael\u0027s lap. Audrey was half kneeling, half crouching beside them. Everyone was breathing hard. Dee looked up first. \"Jump over quick,\" she said in the voice of someone who\u0027s had strep throat for a week. \"I don\u0027t think it can see, but it can feel when you touch the water.\" Jenny jumped over quick, discovering in the process that she\u0027d hurt her ankle sometime, and then all four of them just sat on the asphalt for a while. They were too tired and stunned to talk. \"Whatever it was, it wasn\u0027t human,\" Audrey said at last. \"I mean-apart from the head-a human body couldn\u0027t look like that.\" \"Adipocere,\" Michael got out. \"It\u0027s what human flesh turns to after a while under water. It\u0027s almost like soap. My dad had a mask like that once-he got rid of it because it freaked me out.\" Michael\u0027s father wrote science fiction and had a collection of masks and costumes. \"Then that whole thing was your fault,\" Dee said unkindly, voice still hoarse. \"Your nightmare.\" Michael, surprisingly, looked hopeful. \"You think so? Then maybe I don\u0027t have to worry anymore. Maybe the worst\u0027s over-for me.\" \"If your dad had a mask, it wasn\u0027t headless, was it?\" Jenny said. \"No. What?\" Michael looked confused. \"I mean that monster wasn\u0027t exactly what you had nightmares about. I think Julian is putting his own little twist on things this time. Besides ...\" Something had been nagging at Jenny since the figure had come shooting up out of the water. A feeling of familiarity. But how could she be familiar with something as monstrous and repulsive as that? Audrey was right, it hadn\u0027t even looked human, except that it had two legs and two arms and wore clothes. ... Wore clothes ... dank and stinking ... tattered and dark with water ... but familiar. A long flannel shirt, black-and-blue plaid, unbuttoned. \"Oh, my God. Oh, my God, oh, my God-\" Jenny had gotten to her knees, her voice shrill. \"Oh, my God, no, it was Slug! Don\u0027t you see? It was Slug, it was Slug...\" She was almost screaming. The others were staring at her with sick horror in their eyes. Slug Martell and P. C. Serrani were the two tough guys who had stolen the paper house from Jenny\u0027s living room-and disappeared into the Shadow World. None of Jenny\u0027s friends had much sympathy for them, but this ... nobody deserved this. \"It wasn\u0027t Slug,\" Audrey whispered. \"It was. It was!\" \"Okay.\" Dee, eyes wide, scrambled on her knees over to Jenny. She put her arms, slim but hard as a boy\u0027s, around Jenny. \"Just stay cool.\" \"No, don\u0027t you see?\" Jenny\u0027s voice was wild and keening. \"Don\u0027t you see? That was Slug, without a head. In Michael\u0027s dream he saw Summer\u0027s head. What if we find Summer\u0027s body, like that? What if we find Summer?\" \"Damn.\" Dee pulled back and looked at Jenny. \"I know you think it\u0027s somehow your fault that Summer died-\" \"But what if she\u0027s not dead? What if she\u0027s wandering around here-\" Jenny could feel herself spiraling out of control. She was hyperventilating, hands frozen into claws at chest level. Dee slapped her. It was clearly meant to be restorative and it worked, mainly because Jenny was utterly shocked. Dee often threatened physical violence but never, ever used it except in self-defense. Never. Jenny gave a sort of hiccup and stopped having hysterics. \"It\u0027s bad,\" Dee said, her dark eyes with their slightly amber-tinted pupils close to Jenny\u0027s and unwavering. \"It\u0027s really bad, and nobody\u0027s saying it isn\u0027t.\" She fingered her throat. \"But we have to stay calm, because otherwise we\u0027re dead. Obviously we\u0027re in the Shadow World-I guess nobody is going to argue about that\"-she glanced behind her at Audrey and Michael-\"and this is some new Game Julian has dreamed up for us. We don\u0027t know what to expect, we don\u0027t even know the rules. But one thing we do know: If we let it get to us, we\u0027re dead before we start. Right?\" She shook Jenny a little. \"Right?\" Jenny looked into those eyes with their lashes thick as spring grass and black as soot. It was true. Jenny had to get a grip, for the sake of the rest of them. For Tom\u0027s sake. She couldn\u0027t afford to go crazy right now. She hiccuped again and unsteadily said, \"Right.\" \"We all have to stay calm,\" Dee said, with another glance at Michael and Audrey. \"And we need some weapons. I lost my knife, and if there are any more of those things around...\" Jenny realized suddenly that she\u0027d never even thought of getting Tom\u0027s Swiss Army knife out of her fanny pack. She wasn\u0027t used to fighting. She quickly unzipped the pack and reached in to make sure the knife was safe. \"I\u0027ve got this,\" she said, holding it out to Dee. \"Okay, but it\u0027s too small. We need something big to fight those suckers.\" Audrey spoke up in a small, controlled voice. \"There were picks and things in the mine ride today. I saw them this afternoon.\" \"She\u0027s right!\" Michael said, excited. \"They had all those scenes with miners-with axes and shovels and all sorts of stuff. Let\u0027s go.\" Jenny got up slowly. \"I need to get cleaned up first. There\u0027s got to be a bathroom around here somewhere.\" Her jeans were wet from the channel water, but even worse was the stinking ooze on her windbreaker and hands. There was a bathroom beside the restaurant, and it was open. Jenny washed her jeans as best she could. The windbreaker she threw in the trash, along with her damp sweater. She washed her hands and face over and over and then stood under the blower trying to dry her shirt and jeans. She and Dee guarded the rest room entrance while Michael and Audrey took their turn washing, and Jenny noticed a squashed cigarette butt on the ground. She stared at it for several minutes, the night breeze cool on her damp jeans. Every detail, she thought. Julian must have re-created everything in the real park, making it realistic down to the tiniest detail. Which didn\u0027t mean there weren\u0027t nasty, unrealistic surprises around any given corner. They\u0027d only been here half an hour, and already one of them had nearly died. On his own ground Julian\u0027s illusions were real-or real enough that no amount of disbelief would shake them. In the Shadow World he was the master. Jenny had the feeling that all her worst amusement park nightmares were about to come true. And we haven\u0027t even seen Julian yet, she thought. He\u0027s got to be here, somewhere, laughing himself sick at us. As they set off for the mine ride, Audrey said, \"I hear music.\" The music seemed to be coming from a distant corner of the park-somewhere in back, maybe near the arcade. For an instant Jenny saw lights glimmering through the trees. But the rides they passed were dark and still. The bumper cars were motionless humps like frozen cattle, and Jenny got a whiff of the graphite that kept the metal floor slippery. What is it about amusement parks? she wondered as the bulk of a roller coaster blotted out the stars. What makes them give people nightmares? It\u0027s because there\u0027s something mystical about them, she thought. About some of them, anyway-not the really new, totally sanitized, Hallmark-Pepsi-Colgate kind, but some of the older ones, or the ones that had older sections. In some of those there was something mystical, ancient-significant. Something more than met the eye. The lights twinkled like will-o\u0027-the-wisps up ahead, but Jenny and the others never seemed to get any closer to them. The music was so faint that she couldn\u0027t make out the tune. Then she heard a new sound, a slap-pad, slap-pad like quick bare footsteps. Dee whirled instantly to face it. Jenny clutched Tom\u0027s knife. An hour ago she would have been afraid to walk around with it open-it was sharp-and now she was afraid to close it. Four flashlights swept the manicured shrubbery, illuminating nothing more sinister than a clock made of flowers. Then Michael shouted, \"There!\" Something was scampering across a path on the other side of the shrubbery. The flashlights picked out a slate-colored figure. It was moving too fast for Jenny to get a good look at it, but her impression was of something very small and impossibly deformed. Something like a withered gray fetus. It disappeared behind-or into-the Whip. \"Should we go after it?\" Dee asked. Dee was asking? She must be half dead, Jenny thought. She said, \"No. It\u0027s not bothering us, and we\u0027re not armed yet.\" It gave her a vaguely military and important feeling to say armed. \"Let\u0027s get to the mine ride first.\" \"But what was it?\" Audrey said. \"It looked like a monkey,\" said Michael. \"It was little,\" Jenny said-and then she thought of something. Her dream. The little man in the elevator, the man with the mask. Can we take you? We can carry you. The Shadow Men might ask something like that-but that wizened thing couldn\u0027t have been a Shadow Man. The Shadow Men were beautiful, frighteningly and heartbreakingly beautiful. \"Whatever it was, we\u0027d better watch our backs,\" Dee said. \"There might be more of them.\" The mine ride was as dark as everything else. Jenny shined her flashlight on the freestanding control box with its little lights and switches. \"We don\u0027t have to use that, do we?\" Michael said. \"No, I don\u0027t think so,\" said Jenny. She glanced behind her at the miniature train that stood waiting by the loading platform, then turned her flashlight on the track. \"I think the train runs on its own power-see how the track looks just like a regular train track?-but it doesn\u0027t matter. I think we should walk.\" Audrey opened her mouth as if to protest, then shut it again. All four flashlights converged on the mouth of the \"cave\" where the track disappeared. In the ordinary park this cave was a dark and fanciful gold mine full of ghostly miners, flooded shafts, skeletons, bats, and dynamite. In the Shadow Park, it might hold anything. \"Let\u0027s do it,\" Jenny said. Going into the cave was like being swallowed. As they walked slowly along the track, Jenny glanced back and saw a circle of lighter black behind them-the outside world, getting smaller and smaller. At about this point in the ordinary ride there had been colored lights and mist around the train, probably meant to show you were going back in time to gold mining days. Tonight, there was just a musty damp smell. There were no lights to illuminate the scenes in the cave, either, and it gave Jenny a jolt when her flashlight caught a figure in the shadows. It was a mustached miner with rolled-up sleeves, loading dynamite into a hole in the rock while two other miners watched. \"That one\u0027s holding a sledgehammer,\" Dee said. \"Yeah, but it\u0027s way too heavy. None of us could even pick it up,\" Jenny said. \"We\u0027d better see what\u0027s farther down. I do remember pickaxes and things.\" \"We can\u0027t get lost as long as we follow the track,\" Michael added. Jenny noticed he seemed almost cheerful now. Dee shrugged and they went on. The next scene showed what happened after the dynamite went off-a cave-in that left the three miners trapped beneath a wall of boulders. In the ordinary ride there had been screams and moans of \"Let me out!\" and \"Help me!\" It was almost scarier without the sound effects, Jenny thought. The figures in the boulders were scary as waxworks, while the flashlights made shadows leap on the cave wall behind them. Jenny found herself staring at one clawed hand reaching above the tumbled rocks. \"Are they moving?\" \"It\u0027s your hand shaking,\" Audrey said in an edged voice. \"It\u0027s all just papier-mache,\" Michael said and thumped the cave wall. It sounded like hitting a surfboard. \"Ow. I lied. It\u0027s fiberglass.\" There were more scenes: a flooded shaft with real water, a hanging, even a wilderness saloon with skeletons as patrons. They climbed up to examine the saloon. \"These bottles might work,\" Dee said, taking one from a bony hand. Strange, Jenny realized-the bottle didn\u0027t look like modern glass. It was thick and milky with age and it said crown distilleries co. on the front.","sourceLink":"https://allnovel.net/the-forbidden-game-the-kill-the-forbidden-game-3/page-4.html","bookId":2101,"book":{"id":2101,"title":"The Forbidden Game: The Kill (The Forbidden Game #3)","description":"Storyline: This book was the best! i just read it again (for about the hundredth time *S*) and i cried as much as when i read it the first time. is it just me... or was julian the hottest character?!? wow!!! why on earth did jenny choose tom over julian? tom was nice yeah, but he was kinda boring and plain. julian was so compelling and seductive, i wish he was real! forget about jenny, if he wanted a girl that could appreciate him... *S* i\u0027m not obsessed with him or anything, and i know he\u0027s just fiction, but LJS has created a truly unforgettable character. the endind of this book was soooo sad! when julian died i was crying so much. at the beginning he was the typical \"bad guy,\" but at the end he proved himself worthy. he actually gave up his existance (can\u0027t say life can i?) to save jenny...","cover":"https://allnovel.net/images/the-forbidden-game-the-kill-the-forbidden-game-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-forbidden-game-the-kill-the-forbidden-game-3.html","creation":"Oct 5, 2019 8:58:20 AM","modification":"Oct 5, 2019 5:45:48 PM"}}
