{"id":15668,"no":24,"title":"CHAPTER XXIV. A ROOM AT THE ALBEMARLE HOTEL.","content":"The stranger was tall and well formed. He had certainly showed moral weakness in yielding to the fascinations of drink, but he looked like a smart man of business. “Wait a minute,” he said, “and I will talk to you.” He went to a stationary washtub, and bathed his head freely. “There,” he said, after he had rubbed his face vigorously with a towel. “I feel fifty per cent better. There is nothing like cold water after all.” “Inside as well as outside,” added Paul, with a smile. “That’s where you are right, my boy. Evidently your head is level. You say you are a telegraph boy?” “Yes sir.” “How do you like it?” “Fairly well—for the present.” “You wouldn’t like to follow it permanently, eh?” “No, sir; by the time I got to be fifty or sixty, I might like to change to something else.” “You might be able to retire on a fortune.” “It would be a very small one, judging from my weekly pay.” “I think myself, unless you are wedded to the business, you might pass your time more profitably. What do you think you would like?” “To enter some business house where I could rise[135] step by step as I deserved it,” answered Paul, with animation. “You have the right idea. Now let me tell you why I inquire. In the fall my father will establish a branch house here, with myself at the head of it. I don’t mind telling you that if I had lost the money I have with me, it is doubtful whether he would have trusted me so far. Now, thanks to your prompt assistance, I have been spared the natural result of my folly, and my father will never know the risk I have run. So you see that you have rendered me an important service.” “I am sincerely glad of it, sir.” “I mean that you shall be, and on your account. If I establish myself here, I shall want a young assistant on whose intelligence and fidelity I can rely. Do you know any such person?” “I hope you mean me,” said Paul eagerly. “It is just the opening I have been looking for, for a long time.” “I do mean you. Have you a father or mother?” “No, sir; unhappily not.” “Have you no one belonging to you, then?” asked the young man with a look of sympathy. “No, sir, I can’t say that I have. I live with an old man who is not related to me. It is better than being alone.” “Doesn’t he rely upon you to contribute to his support?” “He does, but he need not. He is a miser and has money deposited in the Bowery Savings Bank, and elsewhere, I expect. I think he has enough to carry him through to the end of his life.” “If he is a miser you probably don’t live very luxuriously.” “We live in a poor room in an east side tenement house, sir,” answered Paul. [136] “You are not contented with that, I take it.” “No, sir; when I compare it with the place where I spent this evening, it makes me mortified and ashamed.” “You were at a party, you said?” “Yes, sir, in a fine brown stone mansion up town.” “Isn’t it a little unusual for a telegraph boy living in a tenement house to be invited to a fashionable party?” “Yes, sir, but these are very kind friends of mine, who overlook my poor social position, and notice me as much as if I lived in a house as good as their own.” “I think they must be uncommon people, but I approve them for all that. ‘A man’s a man for a’ that,’ as Robert Burns says in his poem. That is, it makes no difference whether he is rich or poor, whether he lives in a palace or a hovel, if there is good stuff in him, he deserves honor.” “I would like to see the whole poem,” said Paul. “I think Burns is right.” “So do I, but I must not forget that it is late, and I am keeping you from your bed. I have not told you my name yet.” “No, sir.” “It is Eliot Wade. The firm name is William O. Wade \u0026 Co., of St Louis. We have a wholesale clothing house, and propose to establish a similar one in New York. Now, when this arrangement is effected, how can I communicate with you?” “If you will write to Paul Parton, A. D. T., No. —— Broadway, I shall receive the letter. If I leave the telegraph service before, I will tell them where to send any letter which is received.” “And in case both fail, you will be sure to learn our place from the advertising columns of the newspapers. In that case, call and inquire for me.” “Thank you, sir. I will be sure to do so.” [137] “You will be likely to find it to your advantage.” Paul, concluding that there was nothing more to be said, rose to go. “Good night, Mr. Wade,” he said. “I consider myself lucky in having met you.” “I can return the compliment. But I have not yet got through with you.” “I beg your pardon,” said Paul, resuming his seat. “You don’t suppose I would send you away without an immediate acknowledgment of the service you have done me tonight?” “The future employment which you promised me I consider a very valuable acknowledgment.” “That will, I hope, prove so, but there is nothing like a bird in the hand.” As Eliot Wade spoke, he produced the wallet which had been saved to him by the intrepidity and presence of mind of Paul, and drew therefrom a bank note, which he tendered to Number 91. “Accept that with my thanks added,” he said. Paul looked at the bill and his face expressed the amazement he felt. It was a hundred dollar bill! “You don’t mean to give me so much as this, Mr. Wade,” he ejaculated. “Why not?” asked the young man, with a smile. “It is a good deal too much.” “On the other hand, it is about fifty dollars too little. Ten per cent on the sum saved would be one hundred and fifty dollars, and it is worth that. However, I will reserve that for a future occasion. Consider me fifty dollars in your debt.” “You are very liberal,” said Paul earnestly, “and I heartily thank you. You can imagine that a hundred dollars is a large sum to a poor telegraph boy.” “Now,” said the young man, smiling, “let me give you a piece of advice, suggested by my own experience.[138] Don’t drop into any drinking saloon on your way home, or you may fall into the hands of a sharper, as I did.” “I will remember your caution, sir,” said Paul, smiling. “It may be safer for you to ride home, as the hour is late.” “I will do so, sir. Good night and thank you.” “It seems to me that you are born under a lucky star, No. 91,” said Paul to himself. “In a single evening I have received a sum of money equal to half a year’s wages. If old Jerry only knew it, I should not dare to fall asleep in the same room with him.” He took the green car whose terminus was the Grand Street Ferry, and in less than half an hour he reached the door of his humble lodging. He went upstairs and entered the bed chamber—which contrasted so strongly with the handsomely furnished hotel room which he had just left. He expected to find old Jerry fast asleep, but he was mistaken. The old man was lying on his poor bed in a cramped position, his eyes open, moaning piteously. “What is the matter, Jerry?” he asked, approaching the bed. “I am sick, Paul,” said the old man. “I—I am feeling very miserable! Do you think I am going to die?”","sourceLink":"http://novel.tingroom.com/ertong/2951/81130.html","bookId":463,"book":{"id":463,"title":"Adventures of a Telegraph Boy or \u0027Number 91\u0027","description":"简介： On Broadway, not far from the St. Nicholas Hotel, is an office of the American District Telegraph. Let us enter.A part of the office is railed off, within which the superintendent has a desk, and receives orders for boys to be sent to different parts...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2951","creation":"Aug 1, 2019 12:18:49 AM","modification":"Aug 1, 2019 12:18:49 AM"}}
