{"id":39368,"no":42,"title":"CHAPTER XXXIX. — THE LAST BREAKFAST","content":"And that day was not long in coming; indeed, it came with terrible alacrity; much too quickly for Gertrude, much too quickly for Norman; and much too quickly for Alaric\u0027s lawyer. To Alaric only did the time pass slowly, for he found himself utterly without employment. Norman and Uncle Bat between them had raised something about ?6,000; but when the day came on which they were prepared to dispose of the shares, the Limehouse bridge was found to be worth nothing. They were, as the broker had said, ticklish stock; so ticklish that no one would have them at any price. When Undy, together with his agent from Tillietudlem, went into the market about the same time to dispose of theirs, they were equally unsuccessful. How the agent looked and spoke and felt may be imagined; for the agent had made large advances, and had no other security; but Undy had borne such looks and speeches before, and merely said that it was very odd—extremely odd; he had been greatly deceived by Mr. Piles. Mr. Piles also said it was very odd; but he did not appear to be nearly so much annoyed as the agent from Tillietudlem; and it was whispered that, queer as things now looked, Messrs. Blocks, Piles, and Cofferdam, had not made a bad thing of the bridge. Overture after overture was made to the lawyer employed by Mrs. Val\u0027s party. Norman first offered the ?6,000 and the shares; then when the shares were utterly rejected by the share-buying world, he offered to make himself personally responsible for the remainder of the debt, and to bind himself by bond to pay it within six months. At first these propositions were listened to, and Alaric\u0027s friends were led to believe that the matter would be handled in such a way that the prosecution would fall to the ground. But at last all composition was refused. The adverse attorney declared, first, that he was not able to accept any money payment short of the full amount with interest, and then he averred, that as criminal proceedings had been taken they could not now be stayed. Whether or no Alaric\u0027s night attack had anything to do with this, whether Undy had been the means of instigating this rigid adherence to justice, we are not prepared to say. That day for which Gertrude had prayed her mother\u0027s assistance came all too soon. They had become at last aware that the trial must go on. Charley was with them on the last evening, and completed their despair by telling them that their attorney had resolved to make no further efforts at a compromise. Perhaps the most painful feeling to Gertrude through the whole of the last fortnight had been the total prostration of her husband\u0027s energy, and almost of his intellect; he seemed to have lost the power of judging for himself, and of thinking and deciding what conduct would be best for him in his present condition. He who had been so energetic, so full of life, so ready for all emergencies, so clever at devices, so able to manage not only for himself but for his friends, he was, as it were, paralysed and unmanned. He sat from morning to night looking at the empty fire-grate, and hardly ventured to speak of the ordeal that he had to undergo. His lawyer was to call for him on the morning of the trial, and Mrs. Woodward was to be at the house soon after he had left it. He had not yet seen her since the inquiry had commenced, and it was very plain that he did not wish to do so. Mrs. Woodward was to be there and to remain till his fate had been decided, and then— Not a word had yet been said as to the chance of his not returning; but Mrs. Woodward was aware that he would probably be unable to do so, and felt, that if such should be the case, she could not leave her daughter alone. And so Alaric and his wife sat down to breakfast on that last morning. She had brought their boy down; but as she perceived that the child\u0027s presence did not please his father, he had been sent back to the nursery, and they were alone. She poured out his tea for him, put bread upon his plate, and then sat down close beside him, endeavouring to persuade him to eat. She had never yet found fault with him, she had never even ventured to give him counsel, but now she longed to entreat him to collect himself and take a man\u0027s part in the coming trial. He sat in the seat prepared for him, but, instead of eating, he thrust his hands after his accustomed manner into his pockets and sat glowering at the tea-cups. \u0027Come, Alaric, won\u0027t you eat your breakfast?\u0027 said she. \u0027No; breakfast! no-how can I eat now? how can you think that I could eat at such a time as this? Do you take yours; never mind me.\u0027 \u0027But, dearest, you will be faint if you do not eat; think what you have to go through; remember how many eyes will be on you to-day.\u0027 He shuddered violently as she spoke, and motioned to her with his hand not to go on with what she was saying. \u0027I know, I know,\u0027 said she passionately, \u0027dearest, dearest love—I know how dreadful it is; would that I could bear it for you! would that I could!\u0027 He turned away his head, for a tear was in his eye. It was the first that had come to his assistance since this sorrow had come upon him. \u0027Don\u0027t turn from me, dearest Alaric; do not turn from me now at our last moments. To me at least you are the same noble Alaric that you ever were.\u0027 \u0027Noble!\u0027 said he, with all the self-scorn which he so truly felt. \u0027To me you are, now as ever; but, Alaric, I do so fear that you will want strength, physical strength, you know, to go through all this. I would have you bear yourself like a man before them all.\u0027 \u0027It will be but little matter,\u0027 said he. \u0027It will be matter. It will be matter to me. My darling, darling husband, rouse yourself,\u0027 and she knelt before his knees and prayed to him; \u0027for my sake do it; eat and drink that you may have the power of a man when all the world is looking at you. If God forgives us our sins, surely we should so carry ourselves that men may not be ashamed to do so.\u0027 He did not answer her, but he turned to the table and broke the bread, and put his lips to the cup. And then she gave him food as she would give it to a child, and he with a child\u0027s obedience ate and drank what was put before him. As he did so, every now and again a single tear forced itself beneath his eyelid and trickled down his face, and in some degree Gertrude was comforted. He had hardly finished his enforced breakfast when the cab and the lawyer came to the door. The learned gentleman had the good taste not to come in, and so the servant told them that Mr. Gitemthruet was there. \u0027Say that your master will be with him in a minute,\u0027 said Gertrude, quite coolly; and then the room door was again closed, and the husband and wife had now to say adieu. Alaric rose from his chair and made a faint attempt to smile. \u0027Well, Gertrude,\u0027 said he, \u0027it has come at last.\u0027 She rushed into his embrace, and throwing her arms around him, buried her face upon his breast. \u0027Alaric, Alaric, my husband! my love, my best, my own, my only love!\u0027 \u0027I cannot say much now, Gertrude, but I know how good you are; you will come and see me, if they will let you, won\u0027t you?\u0027 \u0027See you!\u0027 said she, starting back, but still holding him and looking up earnestly into his face. \u0027See you!\u0027 and then she poured out her love with all the passion of a Ruth: \u0027\"Whither thou goest, I will go; and where thou lodgest, I will lodge.... Where thou diest, will I die, and there will I be buried; the Lord do so to me, and more also, if aught but death part thee and me.\" See you, Alaric; oh, it cannot be that they will hinder the wife from being with her husband. But, Alaric,\u0027 she went on, \u0027do not droop now, love—will you?\u0027 \u0027I cannot brazen it out,\u0027 said he. \u0027I know too well what it is that I have done.\u0027 \u0027No, not that, Alaric; I would not have that. But remember, all is not over, whatever they may do. Ah, how little will really be over, whatever they can do! You have repented, have you not, Alaric?\u0027 \u0027I think so, I hope so,\u0027 said Alaric, with his eyes upon the ground. \u0027You have repented, and are right before God; do not fear then what man can do to you. I would not have you brazen, Alaric; but be manly, be collected, be your own self, the man that I have loved, the man that I do now love so well, better, better than ever;\u0027 and she threw herself on him and kissed him and clung to him, and stroked his hair and put her hand upon his face, and then holding him from her, looked up to him as though he were a hero whom she all but worshipped. \u0027Gertrude, Gertrude—that I should have brought you to this!\u0027 \u0027Never mind,\u0027 said she; \u0027we will win through it yet—we will yet be happy together, far, far away from here—remember that—let that support you through all. And now, Alaric, you will come up for one moment and kiss him before you go.\u0027 \u0027The man will be impatient.\u0027 \u0027Never mind; let him be impatient—you shall not go away without blessing your boy; come up, Alaric.\u0027 And she took him by the hand and led him like a child into the nursery. \u0027Where is the nurse? bring him here—papa is going away— Alley, boy, give papa a big kiss.\u0027 Alaric, for the first time for the fortnight, took the little fellow into his arms and kissed him. \u0027God bless you, my bairn,\u0027 said he, \u0027and grant that all this may never be visited against you, here or hereafter!\u0027 \u0027And now go,\u0027 said Gertrude, as they descended the stairs together, \u0027and may God in His mercy watch over and protect you and give you back to me! And, Alaric, wherever you are I will be close to you, remember that. I will be quite, quite close to you. Now, one kiss—oh, dearest, dearest Alaric—there—there—now go.\u0027 And so he went, and Gertrude shutting herself into her room threw herself on to the bed, and wept aloud.","sourceLink":"http://novel.tingroom.com/duanpian/2748/75764.html","bookId":1354,"book":{"id":1354,"title":"The Three Clerks","description":"简介： There is the proper mood and the just environment for the reading as well as for the writing of works of fiction, and there can be no better place for the enjoying of a novel by Anthony Trollope than under a tree in Kensington Gardens of a summer day...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2748","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
