{"id":39369,"no":43,"title":"CHAPTER XL MR. CHAFFANBRASS","content":"We must now follow Alaric to his trial. He was, of course, much too soon at court. All people always are, who are brought to the court perforce, criminals for instance, and witnesses, and other such-like unfortunate wretches; whereas many of those who only go there to earn their bread are very often as much too late. He was to be tried at the Old Bailey. As I have never seen the place, and as so many others have seen it, I will not attempt to describe it. Here Mr. Gitemthruet was quite at home; he hustled and jostled, elbowed and ordered, as though he were the second great man of the place, and the client whom he was to defend was the first. In this latter opinion he was certainly right. Alaric was the hero of the day, and people made way for him as though he had won a victory in India, and was going to receive the freedom of the city in a box. As he passed by, a gleam of light fell on him from a window, and at the instant three different artists had him photographed, daguerreotyped, and bedevilled; four graphic members of the public press took down the details of his hat, whiskers, coat, trousers, and boots; and the sub-editor of the Daily Delight observed that \u0027there was a slight tremor in the first footstep which he took within the precincts of the prison, but in every other respect his demeanour was dignified and his presence manly; he had light-brown gloves, one of which was on his left hand, but the other was allowed to swing from his fingers. The court was extremely crowded, and some fair ladies appeared there to grace its customarily ungracious walls. On the bench we observed Lord Killtime, Sir Gregory Hardlines, and Mr. Whip Vigil. Mr. Undecimus Scott, who had been summoned as a witness by the prisoner, was also accommodated by the sheriffs with a seat.\u0027 Such was the opening paragraph of the seven columns which were devoted by the Daily Delight to the all-absorbing subject. But Mr. Gitemthruet made his way through artists, reporters, and the agitated crowd with that happy air of command which can so easily be assumed by men at a moment\u0027s notice, when they feel themselves to be for that moment of importance. \u0027Come this way, Mr. Tudor; follow me and we will get on without any trouble; just follow me close,\u0027 said Mr. Gitemthruet to his client, in a whisper which was audible to not a few. Tudor, who was essaying, and not altogether unsuccessfully, to bear the public gaze undismayed, did as he was bid, and followed Mr. Gitemthruet. \u0027Now,\u0027 said the attorney, \u0027we\u0027ll sit here—Mr. Chaffanbrass will be close to us, there; so that I can touch him up as we go along; of course, you know, you can make any suggestion, only you must do it through me. Here\u0027s his lordship; uncommon well he looks, don\u0027t he? You\u0027d hardly believe him to be seventy-seven, but he\u0027s not a day less, if he isn\u0027t any more; and he has as much work in him yet as you or I, pretty nearly. If you want to insure a man\u0027s life, Mr. Tudor, put him on the bench; then he\u0027ll never die. We lawyers are not like bishops, who are always for giving up, and going out on a pension.\u0027 But Alaric was not at the moment inclined to meditate much on the long years of judges. He was thinking, or perhaps trying to think, whether it would not be better for him to save this crowd that was now gathered together all further trouble, and plead guilty at once. He knew he was guilty, he could not understand that it was possible that any juryman should have a doubt about it; he had taken the money that did not belong to him; that would be made quite clear; he had taken it, and had not repaid it; there was the absolute corpus delicti in court, in the shape of a deficiency of some thousands of pounds. What possible doubt would there be in the breast of anyone as to his guilt? Why should he vex his own soul by making himself for a livelong day the gazing-stock for the multitude? Why should he trouble all those wigged counsellors, when one word from him would set all at rest? \u0027Mr. Gitemthruet, I think I\u0027ll plead guilty,\u0027 said he. \u0027Plead what!\u0027 said Mr. Gitemthruet, turning round upon his client with a sharp, angry look. It was the first time that his attorney had shown any sign of disgust, displeasure, or even disapprobation since he had taken Alaric\u0027s matter in hand. \u0027Plead what! Ah, you\u0027re joking, I know; upon my soul you gave me a start.\u0027 Alaric endeavoured to explain to him that he was not joking, nor in a mood to joke; but that he really thought the least vexatious course would be for him to plead guilty. \u0027Then I tell you it would be the most vexatious proceeding ever I heard of in all my practice. But you are in my hands, Mr. Tudor, and you can\u0027t do it. You have done me the honour to come to me, and now you must be ruled by me. Plead guilty! Why, with such a case as you have got, you would disgrace yourself for ever if you did so. Think of your friends, Mr. Tudor, if you won\u0027t think of me or of yourself.\u0027 His lawyer\u0027s eloquence converted him, and he resolved that he would run his chance. During this time all manner of little legal preliminaries had been going on; and now the court was ready for business; the jury were in their box, the court-keeper cried silence, and Mr. Gitemthruet was busy among his papers with frantic energy. But nothing was yet seen of the great Mr. Chaffanbrass. \u0027I believe we may go on with the trial for breach of trust,\u0027 said the judge. \u0027I do not know why we are waiting.\u0027 Then up and spoke Mr. Younglad, who was Alaric\u0027s junior counsel. Mr. Younglad was a promising common-law barrister, now commencing his career, of whom his friends were beginning to hope that he might, if he kept his shoulders well to the collar, at some distant period make a living out of his profession. He was between forty and forty-five years of age, and had already overcome the natural diffidence of youth in addressing a learned bench and a crowded court. \u0027My lud,\u0027 said Younglad, \u0027my learned friend, Mr. Chaffanbrass, who leads for the prisoner, is not yet in court. Perhaps, my lud, on behalf of my client, I may ask for a few moments\u0027 delay.\u0027 \u0027And if Mr. Chaffanbrass has undertaken to lead for the prisoner, why is he not in court?\u0027 said the judge, looking as though he had uttered a poser which must altogether settle Mr. Younglad\u0027s business. But Mr. Younglad had not been sitting, and walking and listening, let alone talking occasionally, in criminal courts, for the last twenty years, to be settled so easily. \u0027My lud, if your ludship will indulge me with five minutes\u0027 delay—we will not ask more than five minutes—your ludship knows, no one better, the very onerous duties—\u0027 \u0027When I was at the bar I took no briefs to which I could not attend,\u0027 said the judge. \u0027I am sure you did not, my lud; and my learned friend, should he ever sit in your ludship\u0027s seat, will be able to say as much for himself, when at some future time he may be—; but, my lud, Mr. Chaffanbrass is now in court.\u0027 And as he spoke, Mr. Chaffanbrass, carrying in his hand a huge old blue bag, which, as he entered, he took from his clerk\u0027s hands, and bearing on the top of his head a wig that apparently had not been dressed for the last ten years, made his way in among the barristers, caring little on whose toes he trod, whose papers he upset, or whom he elbowed on his road. Mr. Chaffanbrass was the cock of this dunghill, and well he knew how to make his crowing heard there. \u0027And now, pray, let us lose no more time,\u0027 said the judge. \u0027My lord, if time has been lost through me, I am very sorry; but if your lordship\u0027s horse had fallen down in the street as mine did just now——\u0027 \u0027My horse never falls down in the street, Mr. Chaffanbrass.\u0027 \u0027Some beasts, my lord, can always keep their legs under them, and others can\u0027t; and men are pretty much in the same condition. I hope the former may be the case with your lordship and your lordship\u0027s cob for many years.\u0027 The judge, knowing of old that nothing could prevent Mr. Chaffanbrass from having the last word, now held his peace, and the trial began. There are not now too many pages left to us for the completion of our tale; but, nevertheless, we must say a few words about Mr. Chaffanbrass. He was one of an order of barristers by no means yet extinct, but of whom it may be said that their peculiarities are somewhat less often seen than they were when Mr. Chaffanbrass was in his prime. He confined his practice almost entirely to one class of work, the defence, namely, of culprits arraigned for heavy crimes, and in this he was, if not unrivalled, at least unequalled. Rivals he had, who, thick as the skins of such men may be presumed to be, not unfrequently writhed beneath the lashes which his tongue could inflict. To such a perfection had he carried his skill and power of fence, so certain was he in attack, so invulnerable when attacked, that few men cared to come within the reach of his forensic flail. To the old stagers who were generally opposed to him, the gentlemen who conducted prosecutions on the part of the Crown, and customarily spent their time and skill in trying to hang those marauders on the public safety whom it was the special business of Mr. Chaffanbrass to preserve unhung, to these he was, if not civil, at least forbearing; but when any barrister, who was comparatively a stranger to him, ventured to oppose him, there was no measure to his impudent sarcasm and offensive sneers. Those, however, who most dreaded Mr. Chaffanbrass, and who had most occasion to do so, were the witnesses. A rival lawyer could find a protection on the bench when his powers of endurance were tried too far; but a witness in a court of law has no protection. He comes there unfeed, without hope of guerdon, to give such assistance to the State in repressing crime and assisting justice as his knowledge in this particular case may enable him to afford; and justice, in order to ascertain whether his testimony be true, finds it necessary to subject him to torture. One would naturally imagine that an undisturbed thread of clear evidence would be best obtained from a man whose position was made easy and whose mind was not harassed; but this is not the fact: to turn a witness to good account, he must be badgered this way and that till he is nearly mad; he must be made a laughingstock for the court; his very truths must be turned into falsehoods, so that he may be falsely shamed; he must be accused of all manner of villany, threatened with all manner of punishment; he must be made to feel that he has no friend near him, that the world is all against him; he must be confounded till he forget his right hand from his left, till his mind be turned into chaos, and his heart into water; and then let him give his evidence. What will fall from his lips when in this wretched collapse must be of special value, for the best talents of practised forensic heroes are daily used to bring it about; and no member of the Humane Society interferes to protect the wretch. Some sorts of torture are, as it were, tacitly allowed even among humane people. Eels are skinned alive, and witnesses are sacrificed, and no one\u0027s blood curdles at the sight, no soft heart is sickened at the cruelty. To apply the thumbscrew, the boot, and the rack to the victim before him was the work of Mr. Chaffanbrass\u0027s life. And it may be said of him that the labour he delighted in physicked pain. He was as little averse to this toil as the cat is to that of catching mice. And, indeed, he was not unlike a cat in his method of proceeding; for he would, as it were, hold his prey for a while between his paws, and pat him with gentle taps before he tore him. He would ask a few civil little questions in his softest voice, glaring out of his wicked old eye as he did so at those around him, and then, when he had his mouse well in hand, out would come his envenomed claw, and the wretched animal would feel the fatal wound in his tenderest part. Mankind in general take pleasure in cruelty, though those who are civilized abstain from it on principle. On the whole Mr. Chaffanbrass is popular at the Old Bailey. Men congregate to hear him turn a witness inside out, and chuckle with an inward pleasure at the success of his cruelty. This Mr. Chaffanbrass knows, and, like an actor who is kept up to his high mark by the necessity of maintaining his character, he never allows himself to grow dull over his work. Therefore Mr. Chaffanbrass bullies when it is quite unnecessary that he should bully; it is a labour of love; and though he is now old, and stiff in his joints, though ease would be dear to him, though like a gladiator satiated with blood, he would as regards himself be so pleased to sheathe his sword, yet he never spares himself. He never spares himself, and he never spares his victim. As a lawyer, in the broad and high sense of the word, it may be presumed that Mr. Chaffanbrass knows little or nothing. He has, indeed, no occasion for such knowledge. His business is to perplex a witness and bamboozle a jury, and in doing that he is generally successful. He seldom cares for carrying the judge with him: such tactics, indeed, as his are not likely to tell upon a judge. That which he loves is, that a judge should charge against him, and a jury give a verdict in his favour. When he achieves that he feels that he has earned his money. Let others, the young lads and spooneys of his profession, undertake the milk-and-water work of defending injured innocence; it is all but an insult to his practised ingenuity to invite his assistance to such tasteless business. Give him a case in which he has all the world against him; Justice with her sword raised high to strike; Truth with open mouth and speaking eyes to tell the bloody tale; outraged humanity shrieking for punishment; a case from which Mercy herself, with averted eyes, has loathing turned and bade her sterner sister do her work; give him such a case as this, and then you will see Mr. Chaffanbrass in his glory. Let him, by the use of his high art, rescue from the gallows and turn loose upon the world the wretch whose hands are reeking with the blood of father, mother, wife, and brother, and you may see Mr. Chaffanbrass, elated with conscious worth, rub his happy hands with infinite complacency. Then will his ambition be satisfied, and he will feel that in the verdict of the jury he has received the honour due to his genius. He will have succeeded in turning black into white, in washing the blackamoor, in dressing in the fair robe of innocence the foulest, filthiest wretch of his day; and as he returns to his home, he will be proudly conscious that he is no little man. In person, however, Mr. Chaffanbrass is a little man, and a very dirty little man. He has all manner of nasty tricks about him, which make him a disagreeable neighbour to barristers sitting near to him. He is profuse with snuff, and very generous with his handkerchief. He is always at work upon his teeth, which do not do much credit to his industry. His wig is never at ease upon his head, but is poked about by him, sometimes over one ear, sometimes over the other, now on the back of his head, and then on his nose; and it is impossible to say in which guise he looks most cruel, most sharp, and most intolerable. His linen is never clean, his hands never washed, and his clothes apparently never new. He is about five feet six in height, and even with that stoops greatly. His custom is to lean forward, resting with both hands on the sort of desk before him, and then to fix his small brown basilisk eye on the victim in the box before him. In this position he will remain unmoved by the hour together, unless the elevation and fall of his thick eyebrows and the partial closing of his wicked eyes can be called motion. But his tongue! that moves; there is the weapon which he knows how to use! Such is Mr. Chaffanbrass in public life; and those who only know him in public life can hardly believe that at home he is one of the most easy, good-tempered, amiable old gentlemen that ever was pooh-poohed by his grown-up daughters, and occasionally told to keep himself quiet in a corner. Such, however, is his private character. Not that he is a fool in his own house; Mr. Chaffanbrass can never be a fool; but he is so essentially good-natured, so devoid of any feeling of domestic tyranny, so placid in his domesticities, that he chooses to be ruled by his own children. But in his own way he is fond of hospitality; he delights in a cosy glass of old port with an old friend in whose company he may be allowed to sit in his old coat and old slippers. He delights also in his books, in his daughters\u0027 music, and in three or four live pet dogs, and birds, and squirrels, whom morning and night he feeds with his own hands. He is charitable, too, and subscribes largely to hospitals founded for the relief of the suffering poor. Such was Mr. Chaffanbrass, who had been selected by the astute Mr. Gitemthruet to act as leading counsel on behalf of Alaric. If any human wisdom could effect the escape of a client in such jeopardy, the wisdom of Mr. Chaffanbrass would be likely to do it; but, in truth, the evidence was so strong against him, that even this Newgate hero almost feared the result. I will not try the patience of anyone by stating in detail all the circumstances of the trial. In doing so I should only copy, or, at any rate, might copy, the proceedings at some of those modern causes c閘鑒res with which all those who love such subjects are familiar. And why should I force such matters on those who do not love them? The usual opening speech was made by the chief man on the prosecuting side, who, in the usual manner, declared \u0027that his only object was justice; that his heart bled within him to see a man of such acknowledged public utility as Mr. Tudor in such a position; that he sincerely hoped that the jury might find it possible to acquit him, but that—\u0027 And then went into his \u0027but\u0027 with so much venom that it was clearly discernible to all, that in spite of his protestations, his heart was set upon a conviction. When he had finished, the witnesses for the prosecution were called—the poor wretches whose fate it was to be impaled alive that day by Mr. Chaffanbrass. They gave their evidence, and in due course were impaled. Mr. Chaffanbrass had never been greater. The day was hot, and he thrust his wig back till it stuck rather on the top of his coat-collar than on his head; his forehead seemed to come out like the head of a dog from his kennel, and he grinned with his black teeth, and his savage eyes twinkled, till the witnesses sank almost out of sight as they gazed at him. And yet they had very little to prove, and nothing that he could disprove. They had to speak merely to certain banking transactions, to say that certain moneys had been so paid in and so drawn out, in stating which they had their office books to depend on. But not the less on this account were they made victims. To one clerk it was suggested that he might now and then, once in three months or so, make an error in a figure; and, having acknowledged this, he was driven about until he admitted that it was very possible that every entry he made in the bank books in the course of the year was false. \u0027And you, such as you,\u0027 said Mr. Chaffanbrass, \u0027do you dare to come forward to give evidence on commercial affairs? Go down, sir, and hide your ignominy.\u0027 The wretch, convinced that he was ruined for ever, slunk out of court, and was ashamed to show himself at his place of business for the next three days. There were ten or twelve witnesses, all much of the same sort, who proved among them that this sum of twenty thousand pounds had been placed at Alaric\u0027s disposal, and that now, alas! the twenty thousand pounds were not forthcoming. It seemed to be a very simple case; and, to Alaric\u0027s own understanding, it seemed impossible that his counsel should do anything for him. But as each impaled victim shrank with agonized terror from the torture, Mr. Gitemthruet would turn round to Alaric and assure him that they were going on well, quite as well as he had expected. Mr. Chaffanbrass was really exerting himself; and when Mr. Chaffanbrass did really exert himself he rarely failed. And so the long day faded itself away in the hot sweltering court, and his lordship, at about seven o\u0027clock, declared his intention of adjourning. Of course a cause c閘鑒re such as this was not going to decide itself in one day. Alaric\u0027s guilt was clear as daylight to all concerned; but a man who had risen to be a Civil Service Commissioner, and to be entrusted with the guardianship of twenty thousand pounds, was not to be treated like a butcher who had merely smothered his wife in an ordinary way, or a housebreaker who had followed his professional career to its natural end; more than that was due to the rank and station of the man, and to the very respectable retaining fee with which Mr. Gitemthruet had found himself enabled to secure the venom of Mr. Chaffanbrass. So the jury retired to regale themselves en masse at a neighbouring coffee-house; Alaric was again permitted to be at large on bail (the amiable policeman in mufti still attending him at a distance); and Mr. Chaffanbrass and his lordship retired to prepare themselves by rest for the morrow\u0027s labours. But what was Alaric to do? He soon found himself under the guardianship of the constant Gitemthruet in a neighbouring tavern, and his cousin Charley was with him. Charley had been in court the whole day, except that he had twice posted down to the West End in a cab to let Gertrude and Mrs. Woodward know how things were going on. He had posted down and posted back again, and, crowded as the court had been, he had contrived to make his way in, using that air of authority to which the strongest-minded policeman will always bow; till at last the very policemen assisted him, as though he were in some way connected with the trial. On his last visit at Gertrude\u0027s house he had told her that it was very improbable that the trial should be finished that day. She had then said nothing as to Alaric\u0027s return to his own house; it had indeed not occurred to her that he would be at liberty to do so: Charley at once caught at this, and strongly recommended his cousin to remain where he was. \u0027You will gain nothing by going home,\u0027 said he; \u0027Gertrude does not expect you; Mrs. Woodward is there; and it will be better for all parties that you should remain.\u0027 Mr. Gitemthruet strongly backed his advice, and Alaric, so counselled, resolved to remain where he was. Charley promised to stay with him, and the policeman in mufti, without making any promise at all, silently acquiesced in the arrangement. Charley made one more visit to the West, saw Norman at his lodgings, and Mrs. Woodward and Gertrude in Albany Place, and then returned to make a night of it with Alaric. We need hardly say that Charley made a night of it in a very different manner from that to which he and his brother navvies were so well accustomed.","sourceLink":"http://novel.tingroom.com/duanpian/2748/75765.html","bookId":1354,"book":{"id":1354,"title":"The Three Clerks","description":"简介： There is the proper mood and the just environment for the reading as well as for the writing of works of fiction, and there can be no better place for the enjoying of a novel by Anthony Trollope than under a tree in Kensington Gardens of a summer day...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2748","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
