{"id":39373,"no":47,"title":"CHAPTER XLIV. — THE CRIMINAL POPULATION IS DISPOSED OF","content":"Before we put Alaric on board the ship which is to take him away from the land in which he might have run so exalted a career, we must say one word as to the fate and fortunes of his old friend Undy Scott. This gentleman has not been represented in our pages as an amiable or high-minded person. He has indeed been the bad spirit of the tale, the Siva of our mythology, the devil that has led our hero into temptation, the incarnation of evil, which it is always necessary that the novelist should have personified in one of his characters to enable him to bring about his misfortunes, his tragedies, and various requisite catastrophes. Scott had his Varney and such-like; Dickens his Bill Sykes and such-like; all of whom are properly disposed of before the end of those volumes in which are described their respective careers. I have ventured to introduce to my readers, as my devil, Mr. Undy Scott, M.P. for the Tillietudlem district burghs; and I also feel myself bound to dispose of him, though of him I regret I cannot make so decent an end as was done with Sir Richard Varney and Bill Sykes. He deserves, however, as severe a fate as either of those heroes. With the former we will not attempt to compare him, as the vices and devilry of the days of Queen Elizabeth are in no way similar to those in which we indulge; but with Bill Sykes we may contrast him, as they flourished in the same era, and had their points of similitude, as well as their points of difference. They were both apparently born to prey on their own species; they both resolutely adhered to a fixed rule that they would in nowise earn their bread, and to a rule equally fixed that, though they would earn no bread, they would consume much. They were both of them blessed with a total absence of sensibility and an utter disregard to the pain of others, and had no other use for a heart than that of a machine for maintaining the circulation of the blood. It is but little to say that neither of them ever acted on principle, on a knowledge, that is, of right and wrong, and a selection of the right; in their studies of the science of evil they had progressed much further than this, and had taught themselves to believe that that which other men called virtue was, on its own account, to be regarded as mawkish, insipid, and useless for such purposes as the acquisition of money or pleasure; whereas vice was, on its own account, to be preferred, as offering the only road to those things which they were desirous of possessing. So far there was a great resemblance between Bill Sykes and Mr. Scott; but then came the points of difference, which must give to the latter a great pre-eminence in the eyes of that master whom they had both so worthily served. Bill could not boast the merit of selecting the course which he had run; he had served the Devil, having had, as it were, no choice in the matter; he was born and bred and educated an evil-doer, and could hardly have deserted from the colours of his great Captain, without some spiritual interposition to enable him to do so. To Undy a warmer reward must surely be due: he had been placed fairly on the world\u0027s surface, with power to choose between good and bad, and had deliberately taken the latter; to him had, at any rate, been explained the theory of meum and tuum, and he had resolved that he liked tuum better than meum; he had learnt that there is a God ruling over us, and a Devil hankering after us, and had made up his mind that he would belong to the latter. Bread and water would have come to him naturally without any villany on his part, aye, and meat and milk, and wine and oil, the fat things of the world; but he elected to be a villain; he liked to do the Devil\u0027s bidding.—Surely he was the better servant; surely he shall have the richer reward. And yet poor Bill Sykes, for whom here I would willingly say a word or two, could I, by so saying, mitigate the wrath against him, is always held as the more detestable scoundrel. Lady, you now know them both. Is it not the fact, that, knowing him as you do, you could spend a pleasant hour enough with Mr. Scott, sitting next to him at dinner; whereas your blood would creep within you, your hair would stand on end, your voice would stick in your throat, if you were suddenly told that Bill Sykes was in your presence? Poor Bill! I have a sort of love for him, as he walks about wretched with that dog of his, though I know that it is necessary to hang him. Yes, Bill; I, your friend, cannot gainsay that, must acknowledge that. Hard as the case may be, you must be hung; hung out of the way of further mischief; my spoons, my wife\u0027s throat, my children\u0027s brains, demand that. You, Bill, and polecats, and such-like, must be squelched when we can come across you, seeing that you make yourself so universally disagreeable. It is your ordained nature to be disagreeable; you plead silently. I know it; I admit the hardship of your case; but still, my Bill, self-preservation is the first law of nature. You must be hung. But, while hanging you, I admit that you are more sinned against than sinning. There is another, Bill, another, who will surely take account of this in some way, though it is not for me to tell you how. Yes, I hang Bill Sykes with soft regret; but with what a savage joy, with what exultation of heart, with what alacrity of eager soul, with what aptitude of mind to the deed, would I hang my friend, Undy Scott, the member of Parliament for the Tillietudlem burghs, if I could but get at his throat for such a purpose! Hang him! aye, as high as Haman! In this there would be no regret, no vacillation of purpose, no doubt as to the propriety of the sacrifice, no feeling that I was so treating him, not for his own desert, but for my advantage. We hang men, I believe, with this object only, that we should deter others from crime; but in hanging Bill we shall hardly deter his brother. Bill Sykes must look to crime for his bread, seeing that he has been so educated, seeing that we have not yet taught him another trade. But if I could hang Undy Scott, I think I should deter some others. The figure of Undy swinging from a gibbet at the broad end of Lombard Street would have an effect. Ah! my fingers itch to be at the rope. Fate, however, and the laws are averse. To gibbet him, in one sense, would have been my privilege, had I drunk deeper from that Castalian rill whose dark waters are tinged with the gall of poetic indignation; but as in other sense I may not hang him, I will tell how he was driven from his club, and how he ceased to number himself among the legislators of his country. Undy Scott, among his other good qualities, possessed an enormous quantity of that which schoolboys in these days call \u0027cheek.\u0027 He was not easily browbeaten, and was generally prepared to browbeat others. Mr. Chaffanbrass certainly did get the better of him; but then Mr. Chaffanbrass was on his own dunghill. Could Undy Scott have had Mr. Chaffanbrass down at the clubs, there would have been, perhaps, another tale to tell. Give me the cock that can crow in any yard; such cocks, however, we know are scarce. Undy Scott, as he left the Old Bailey, was aware that he had cut a sorry figure, and felt that he must immediately do something to put himself right again, at any rate before his portion of the world. He must perform some exploit uncommonly cheeky in order to cover his late discomfiture. To get the better of Mr. Chaffanbrass at the Old Bailey had been beyond him; but he might yet do something at the clubs to set aside the unanimous verdict which had been given against him in the city. Nay, he must do something, unless he was prepared to go to the wall utterly, and at once. Going to the wall with Undy would mean absolute ruin; he lived but on the cheekiness of his gait and habits; he had become member of Parliament, Government official, railway director, and club aristocrat, merely by dint of cheek. He had now received a great blow; he had stood before a crowd, and been annihilated by the better cheek of Mr. Chaffanbrass, and, therefore, it behoved him at once to do something. When the perfume of the rose grows stale, the flower is at once thrown aside, and carried off as foul refuse. It behoved Undy to see that his perfume was maintained in its purity, or he, too, would be carried off. The club to which Undy more especially belonged was called the Downing; and of this Alaric was also a member, having been introduced into it by his friend. Here had Alaric spent by far too many of the hours of his married life, and had become well known and popular. At the time of his conviction, the summer was far advanced; it was then August; but Parliament was still sitting, and there were sufficient club men remaining in London to create a daily gathering at the Downing. On the day following that on which the verdict was found, Undy convened a special committee of the club, in order that he might submit to it a proposition which he thought it indispensable should come from him; so, at least, he declared. The committee did assemble, and when Undy met it, he saw among the faces before him not a few with whom he would willingly have dispensed. However, he had come there to exercise his cheek; no one there should cow him; the wig of Mr. Chaffanbrass was, at any rate, absent. And so he submitted his proposition. I need not trouble my readers with the neat little speech in which it was made. Undy was true to himself, and the speech was neat. The proposition was this: that as he had unfortunately been the means of introducing Mr. Alaric Tudor to the club, he considered it to be his duty to suggest that the name of that gentleman should be struck off the books. He then expressed his unmitigated disgust at the crime of which Tudor had been found guilty, uttered some nice little platitudes in the cause of virtue, and expressed a hope \u0027that he might so far refer to a personal matter as to say that his father\u0027s family would take care that the lady, whose fortune had been the subject of the trial, should not lose one penny through the dishonesty of her trustee.\u0027 Oh, Undy, as high as Haman, if I could! as high as Haman! and if not in Lombard Street, then on that open ground where Waterloo Place bisects Pall Mall, so that all the clubs might see thee! \u0027He would advert,\u0027 he said, \u0027to one other matter, though, perhaps, his doing so was unnecessary. It was probably known to them all that he had been a witness at the late trial; an iniquitous attempt had been made by the prisoner\u0027s counsel to connect his name with the prisoner\u0027s guilt. They all too well knew the latitude allowed to lawyers in the criminal courts, to pay much attention to this. Had he\u0027 (Undy Scott) \u0027in any way infringed the laws of his country, he was there to answer for it. But he would go further than this, and declare that if any member of that club doubted his probity in the matter, he was perfectly willing to submit to such member documents which would,\u0027 \u0026c., \u0026c. He finished his speech, and an awful silence reigned around him. No enthusiastic ardour welcomed the well-loved Undy back to his club, and comforted him after the rough usage of the unpolished Chaffanbrass. No ten or twenty combined voices expressed, by their clamorous negation of the last-proposed process, that their Undy was above reproach. The eyes around looked into him with no friendly alacrity. Undy, Undy, more cheek still, still more cheek, or you are surely lost. \u0027If,\u0027 said he, in a well-assumed indignant tone of injured innocence, \u0027there be any in the club who do suspect me of anything unbecoming a gentleman in this affair, I am willing to retire from it till the matter shall have been investigated; but in such case I demand that the investigation be immediate.\u0027 Oh, Undy, Undy, the supply of cheek is not bad; it is all but unlimited; but yet it suffices thee not. \u0027Can there be positions in this modern West End world of mine,\u0027 thought Undy to himself, \u0027in which cheek, unbounded cheek, will not suffice?\u0027 Oh, Undy, they are rare; but still there are such, and this, unfortunately for thee, seemeth to be one of them. And then got up a discreet old baronet, one who moveth not often in the affairs around him, but who, when he moveth, stirreth many waters; a man of broad acres, and a quiet, well-assured fame which has grown to him without his seeking it, as barnacles grow to the stout keel when it has been long a-swimming; him, of all men, would Undy have wished to see unconcerned with these matters. Not in many words, nor eloquent did Sir Thomas speak. \u0027He felt it his duty,\u0027 he said, \u0027to second the proposal made by Mr. Scott for removing Mr. Tudor from amongst them. He had watched this trial with some care, and he pitied Mr. Tudor from the bottom of his heart. He would not have thought that he could have felt so strong a sympathy for a man convicted of dishonesty. But, Mr. Tudor had been convicted, and he must incur the penalties of his fault. One of these penalties must, undoubtedly, be his banishment from this club. He therefore seconded Mr. Scott\u0027s proposal.\u0027 He then stood silent for a moment, having finished that task; but yet he did not sit down. Why, oh, why does he not sit down? why, O Undy, does he thus stand, looking at the surface of the table on which he is leaning? \u0027And now,\u0027 he said, \u0027he had another proposition to make; and that was that Mr. Undecimus Scott should also be expelled from the club,\u0027 and having so spoken, in a voice of unusual energy, he then sat down. And now, Undy, you may as well pack up, and be off, without further fuss, to Boulogne, Ostend, or some such idle Elysium, with such money-scrapings as you may be able to collect together. No importunity will avail thee anything against the judges and jurymen who are now trying thee. One word from that silent old baronet was worse to thee than all that Mr. Chaffanbrass could say. Come! pack up; and begone. But he was still a Member of Parliament. The Parliament, however, was about to be dissolved, and, of course, it would be useless for him to stand again; he, like Mr. M\u0027Buffer had had his spell of it, and he recognized the necessity of vanishing. He at first thought that his life as a legislator might be allowed to come to a natural end, that he might die as it were in his bed, without suffering the acute pain of applying for the Chiltern Hundreds. In this, however, he found himself wrong. The injured honour of all the Tillietudlemites rose against him with one indignant shout; and a rumour, a horrid rumour, of a severer fate met his ears. He applied at once for the now coveted sinecure,—and was refused. Her Majesty could not consent to entrust to him the duties of the situation in question—; and in lieu thereof the House expelled him by its unanimous voice. And now, indeed, it was time for him to pack and begone. He was now liable to the vulgarest persecution from the vulgar herd; his very tailor and bootmaker would beleaguer him, and coarse unwashed bailiffs take him by the collar. Yes, now indeed, it was time to be off. And off he was. He paid one fleeting visit to my Lord at Cauldkail Castle, collecting what little he might; another to his honourable wife, adding some slender increase to his little budget, and then he was off. Whither, it is needless to say—to Hamburg perhaps, or to Ems, or the richer tables of Homburg. How he flourished for a while with ambiguous success; how he talked to the young English tourists of what he had done when in Parliament, especially for the rights of married women; how he poked his \u0027Honourable\u0027 card in every one\u0027s way, and lugged Lord Gaberlunzie into all conversations; how his face became pimply and his wardrobe seedy; and how at last his wretched life will ooze out from him in some dark corner, like the filthy juice of a decayed fungus which makes hideous the hidden wall on which it bursts, all this is unnecessary more particularly to describe. He is probably still living, and those who desire his acquaintance will find him creeping round some gambling table, and trying to look as though he had in his pocket ample means to secure those hoards of money which men are so listlessly raking about. From our view he has now vanished. It was a bitter February morning, when two cabs stood packing themselves at No. 5, Paradise Row, Millbank. It was hardly yet six o\u0027clock, and Paradise Row was dark as Erebus; that solitary gas-light sticking out from the wall of the prison only made darkness visible; the tallow candles which were brought in and out with every article that was stuffed under a seat, or into a corner, would get themselves blown out; and the sleet which was falling fast made the wicks wet, so that they could with difficulty be relighted. But at last the cabs were packed with luggage, and into one got Gertrude with her husband, her baby, and her mother; and into the other Charley handed Linda, then Alley, and lastly, the youthful maiden, who humbly begged his pardon as she stepped up to the vehicle; and then, having given due directions to the driver, he not without difficulty squeezed himself into the remaining space. Such journeys as these are always made at a slow pace. Cabmen know very well who must go fast, and who may go slow. Women with children going on board an emigrant vessel at six o\u0027clock on a February morning may be taken very slowly. And very slowly Gertrude and her party were taken. Time had been—nay, it was but the other day—when Alaric\u0027s impatient soul would have spurned at such a pace as this. But now he sat tranquil enough. His wife held one of his hands, and the other he pressed against his eyes, as though shading them from the light. Light there was none, but he had not yet learnt to face Mrs. Woodward even in the darkness. He had come out of the prison on the day before, and had spent an evening with her. It is needless to say that no one had upbraided him, that no one had hinted that his backslidings had caused all this present misery, had brought them all to that wretched cabin, and would on the morrow separate, perhaps for ever, a mother and a child who loved each other so dearly. No one spoke to him of this; perhaps no one thought of it; he, however, did so think of it that he could not hold his head up before them. \u0027He was ill,\u0027 Gertrude said; \u0027his long confinement had prostrated him; but the sea air would revive him in a day or two.\u0027 And then she made herself busy, and got the tea for them, and strove, not wholly in vain,\u0027 to drive dull care away!\u0027 But slowly as the cabs went in spite of Charley\u0027s vocal execrations, they did get to the docks in time. Who, indeed, was ever too late at the docks? Who, that ever went there, had not to linger, linger, linger, till every shred of patience was clean worn out? They got to the docks in time, and got on board that fast-sailing, clipper-built, never-beaten, always-healthy ship, the Flash of Lightning, 5,600 tons, A 1. Why, we have often wondered, are ships designated as A 1, seeing that all ships are of that class? Where is the excellence, seeing that all share it? Of course the Flash of Lightning was A 1. The author has for years been looking out, and has not yet found a ship advertised as A 2, or even as B 1. What is this catalogue of comparative excellence, of which there is but one visible number? The world, we think, makes a great mistake on the subject of saying, or acting, farewell. The word or deed should partake of the suddenness of electricity; but we all drawl through it at a snail\u0027s pace. We are supposed to tear ourselves from our friends; but tearing is a process which should be done quickly. What is so wretched as lingering over a last kiss, giving the hand for the third time, saying over and over again, \u0027Good-bye, John, God bless you; and mind you write!\u0027 Who has not seen his dearest friends standing round the window of a railway carriage, while the train would not start, and has not longed to say to them, \u0027Stand not upon the order of your going, but go at once!\u0027 And of all such farewells, the ship\u0027s farewell is the longest and the most dreary. One sits on a damp bench, snuffing up the odour of oil and ropes, cudgelling one\u0027s brains to think what further word of increased tenderness can be spoken. No tenderer word can be spoken. One returns again and again to the weather, to coats and cloaks, perhaps even to sandwiches and the sherry flask. All effect is thus destroyed, and a trespass is made even on the domain of feeling. I remember a line of poetry, learnt in my earliest youth, and which I believe to have emanated from a sentimental Frenchman, a man of genius, with whom my parents were acquainted. It is as follows:— Are you go?—Is you gone?—And I left?—Vera vell! Now the whole business of a farewell is contained in that line. When the moment comes, let that be said; let that be said and felt, and then let the dear ones depart. Mrs. Woodward and Gertrude—God bless them!—had never studied the subject. They knew no better than to sit in the nasty cabin, surrounded by boxes, stewards, porters, children, and abominations of every kind, holding each other\u0027s hands, and pressing damp handkerchiefs to their eyes. The delay, the lingering, upset even Gertrude, and brought her for a moment down to the usual level of leave-taking womanhood. Alaric, the meanwhile, stood leaning over the taffrail with Charley, as mute as the fishes beneath him. \u0027Write to us the moment you get there,\u0027 said Charley. How often had the injunction been given! \u0027And now we had better get off—you\u0027ll be better when we are gone, Alaric,\u0027—Charley had some sense of the truth about him—\u0027and, Alaric, take my word for it, I\u0027ll come and set the Melbourne Weights and Measures to rights before long—I\u0027ll come and weigh your gold for you.\u0027 \u0027We had better be going now,\u0027 said Charley, looking down into the cabin; \u0027they may let loose and be off any moment now.\u0027 \u0027Oh, Charley, not yet, not yet,\u0027 said Linda, clinging to her sister. \u0027You\u0027ll have to go down to the Nore, if you stay; that\u0027s all,\u0027 said Charley. And then again began the kissing and the crying. Yes, ye dear ones—it is hard to part—it is hard for the mother to see the child of her bosom torn from her for ever; it is cruel that sisters should be severed: it is a harsh sentence for the world to give, that of such a separation as this. These, O ye loving hearts, are the penalties of love! Those that are content to love must always be content to pay them. \u0027Go, mamma, go,\u0027 said Gertrude; \u0027dearest, best, sweetest mother—my own, own mother; go, Linda, darling Linda. Give my kindest love to Harry—Charley, you and Harry will be good to mamma, I know you will. And mamma\u0027—and then she whispered to her mother one last prayer in Charley\u0027s favour—\u0027she may love him now, indeed she may.\u0027 Alaric came to them at the last moment—\u0027Mrs. Woodward,\u0027 said he, \u0027say that you forgive me.\u0027 \u0027I do,\u0027 said she, embracing him—\u0027God knows that I do;—but, Alaric, remember what a treasure you possess.\u0027 And so they parted. May God speed the wanderers! \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2748/75769.html","bookId":1354,"book":{"id":1354,"title":"The Three Clerks","description":"简介： There is the proper mood and the just environment for the reading as well as for the writing of works of fiction, and there can be no better place for the enjoying of a novel by Anthony Trollope than under a tree in Kensington Gardens of a summer day...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2748","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
