{"id":19897,"no":13,"title":"CHAPTER XIII. LOVE","content":"We stared at one another for quite sixty seconds: she standing white-faced and tongue-tied near her chair, I kneeling by the open portmanteau to display the cloak. When I would have spoken, she flung up a protesting hand to silence me. \n \n \"How do you know it is my cloak?\" \n \n \"The embroidery in blue silk repeats the initials of your name.\" \n \n \"And you found it in the field, where the motor car was stranded?\" \n \n \"I did, concealed in a hedge.\" \n \n \"Where I concealed it?\" \n \n \"I don\u0027t say that.\" \n \n Gertrude stepped back and clutched at her breast. \"Don\u0027t you believe that I am the woman who stole your car?\" \n \n \"No, I don\u0027t.\" \n \n \"Don\u0027t you believe that I murdered Anne for the sake of the eye?\" \n \n \"No, I don\u0027t.\" \n \n \"But on what ground\"--she flung abroad her arms--\"do you believe me to be innocent?\" \n \n \"I love you.\" \n \n \"You love me,\" she repeated mechanically. \n \n I rose, still holding the cloak in my arms, and spoke vehemently. \"Of course you must have seen for days that I love you. I came here because I fell in love with your photograph, and because I found this.\" I shook the cloak. \"Yes! Can you not understand that I desired to save you.\" \n \n \"To save me. From what?\" \n \n \"From arrest. Had anyone but myself found the cloak you would have been in prison long, long ago. But I told no one about my discovery. I hid the cloak in my portmanteau and came here to seek an explanation. I knew that you would be able to exculpate yourself.\" \n \n \"Then you needed an explanation?\" she asked in low tones. \n \n \"Only that I might learn how to save you. I needed no explanation to assure me that you are innocent. For a moment I had my doubts, when Miss Destiny spoke to me, yesterday----\" \n \n Gertrude interrupted with a cry and the scarlet blood flushed her cheeks swiftly. \"Aunt Julia has been speaking to you?\" \n \n \"I have been speaking to Aunt Julia. Listen. I saw long ago that your aunt was not your friend, and I feared lest she should make mischief. I therefore called to see her yesterday, so that I might learn how much she knows. She told me----\" \n \n \"I know what she told you,\" interrupted Gertrude again, and flung back her head; \"she came to me this morning, as I explained, and said all manner of dreadful things.\" \n \n \"Such as----?\" \n \n \"I shall tell you, so that you may see I place myself entirely in your hands, Mr. Vance. Aunt Julia declared that I was at Mootley on the evening of the murder; that the hat-pin with which Anne was stabbed belonged to me; and that she saw my white cloak on the lady who drove the motor car, whom she believed to be myself escaping. She threatened to tell the police all these things unless I gave her half of the fifty thousand pounds. As if I could--as if I could!\" wailed Gertrude, dropping into her seat. \"I do not know where it is.\" \n \n \"Why not learn from the glass eye?\" \n \n She looked up astonished. \"I have not got the glass eye.\" \n \n I stared in my turn. \"Listen, Miss Monk. In the face of what you have told me, and of what your aunt has said, I believe that you are innocent.\" \n \n \"Thank God for that,\" she muttered. \"I could not have endured an accusation from you.\" \n \n On hearing this it was with the greatest difficulty that I prevented myself from taking her in my arms to kiss away the tears. But there was much to be cleared up before I could do that, as I wished her to understand my entire belief in her innocence. \"But,\" I went on with emphasis, \"while I know that your account of the interview with Mrs. Caldershaw is correct, I ask you to trust me--as I am your firm friend--fully.\" \n \n \"I have trusted you fully,\" she said plaintively. \n \n \"What about the glass eye? Are you sure that Mrs. Caldershaw did not allow you to carry it away when you left by the back door to escape meeting this mysterious person you speak of.\" \n \n \"I am quite sure,\" said Gertrude, rising with great dignity, \"that Mrs. Caldershaw\u0027s glass eye was in her head when I ran from her house. I was in such a hurry to escape meeting the person I mentioned that I left my cloak behind me, and also one of the blue glass-headed pins which fastened my hat. I can guess what happened. The assassin killed Anne with the hat-pin, stole the glass eye, and then assumed my cloak to escape, and perhaps,\" she added, with an afterthought, \"to throw the blame of the crime on me.\" \n \n \"And the assassin was this person whom you did not wish to meet?\" \n \n Her hands trembled. \"I think not: I hope not. I--I--I can\u0027t answer your questions, Mr. Vance. But why,\" she continued hurriedly, \"why do you mention the glass eye in connection with my not having--as you declare--trusted you fully?\" \n \n \"Because I saw the very eye on the small table near the middle window of the drawing-room at The Lodge.\" \n \n She rose quickly and looked aghast. \"You--saw-the--glass eye there?\" she said slowly. \"When?\" \n \n \"Yesterday.\" And I rapidly explained the circumstance. \"I thought that you had the eye in your pocket when I came afterwards into the room with your father,\" I said, \"and because I fancied Miss Destiny might have seen it, I went along, in your interest, to interview her. But from what she said I am convinced that you had concealed it before she could set eyes on it.\" \n \n \"Stop!\" cried Gertrude. \"I did not conceal it. I never saw the glass eye save in Anne\u0027s head. If I had that eye you must think me guilty.\" And her eyes searched my face. \n \n \"No,\" I said firmly; \"I only thought that perhaps, not quite trusting me, you did not say that Anne Caldershaw had given it to you.\" \n \n \"But she did not. I have told everything. You know the reason why I went to Mootley, and all that took place. I left Anne in good health and walked to Murchester to catch the train. Don\u0027t you believe me?\" \n \n \"Oh,\" I advanced towards her anxiously, \"can\u0027t you see that I believe you entirely. Nothing will ever persuade me that you are guilty. All I ask is for absolute confidence, so that I can find the true assassin and free you from the danger of being denounced by your vindictive aunt.\" \n \n \"I have given you my absolute confidence,\" she said with dignity, yet not unmoved by my declaration. \n \n \"Not entirely. I do not know the sex or the name of the person from whom you fled at the corner shop.\" \n \n Gertrude turned swiftly towards the window. \"I can answer no question on that point,\" she said in low tones. \n \n \"Do you think this person had possession of the eye?\" I persisted. \n \n \"No! no! no! Ask me no more, I have told you all that I can tell you.\" \n \n \"I will only ask one question, which--if I am to learn the truth about this case, and save you from arrest--I must have answered. Do you believe that the person in question is guilty?\" \n \n She turned with a pearly-white face. \"No, the person is not guilty. Do you wish me to swear it?\" \n \n Her question was sarcastic, and I winced. \"I believe your bare word,\" I said somewhat coldly; \"have I not proved my belief?\" \n \n \"Forgive me.\" In her turn she moved towards me, and laid a beseeching hand on my arm. \"You are my best friend and indeed my only friend. I have no one but you to trust.\" \n \n \"And love?\" I asked, trying to catch her hands. \"No! no!\" she drew away; \"not yet.\" \n \n \"Yes, now. We must understand one another. I am not content with friendship, Gertrude, I want your love.\" \n \n \"But--but it is so sudden!\" she stammered. \n \n \"Sudden. When I have been eating my heart out ever since I set eyes on your portrait? Oh, my dear, you can\u0027t believe that.\" \n \n \"But--but,\" she made another objection. \"There is so much to talk about.\" \n \n \"We can talk all the easier when we understand one another. Surely you can see how devoted I am to you.\" \n \n \"I know that; oh yes, I know that; indeed I do.\" \n \n \"Then--\" I held out my hands. \n \n \"Mr. Vance?\" \n \n \"Call me by my name.\" \n \n \"Indeed I can\u0027t--oh no--oh no.\" \n \n \"Gertrude!\" this time I became masterful and possessed myself of her unwilling hands, \"is there anyone else?\" \n \n \"No; certainly there is not.\" \n \n \"You don\u0027t love Striver.\" \n \n \"The idea! I never heard such nonsense.\" \n \n \"You are about to hear a good deal of nonsense. When a sensible man such as I am is in love, he talks his heart out.\" \n \n She did not draw away her hands, but laughed softly in spite of her fears and insistent troubles. \"What you say can never be nonsense.\" \n \n \"Then you love me?\" I demanded persistently. \"Yes; it\u0027s no use my denying it, I do love you.\" \n \n \"Gertrude!\" I caught her fully in my arms and, before she could turn her head aside, had pressed my lips to her own. She bore the embrace for one moment, then pushed me away, and retreating to the armchair sat down to cry softly. I followed. \"Gertrude darling!\" \n \n \"Oh, what is the use of talking? How can we behave in this way, when all things are wrong? I do love you: it is useless to say that I do not. But my heart aches with pain.\" \n \n \"Darling,\" I knelt beside her, \"I am here to help you.\" \n \n \"I know. I accept your help gladly, and I thank God for having sent a good man to help me.\" \n \n \"Dear, don\u0027t think of me as good, I have no end of faults.\" \n \n \"You would not be human otherwise, and for those faults I love you all the more, Mr.----\" \n \n \"Gertrude?\" \n \n \"Well then, Cyrus.\" \n \n \"Dearest, my own; you will marry me?\" \n \n \"Some day, when----\" She suddenly rose, and assumed a resolute air. \"Cyrus, we must not fiddle while our Rome is burning. Tell me how the glass eye came to be at The Lodge?\" \n \n I fell into her humor, as I saw that she regarded the position of things as far too serious to permit simple love dalliance. \"My dear, I can\u0027t tell you unless----\" \n \n \"I never saw the eye,\" she interrupted impatiently. \"Don\u0027t you believe me.\" \n \n \"Yes. You never saw the eye. Was Miss Destiny in the drawing-room?\" \n \n \"No; we both went up to my bedroom when she came into the house, and I saw her out of the gate just before I returned to the house to meet you and my father. Why do you ask that question? Do you think my aunt----?\" \n \n \"Oh no. Miss Destiny did not arrive at Mootley until the crime was committed. She could not have got possession of the glass eye. I only wished to be sure that she had not seen it. As she did not enter the drawing-room, and as I have cross-questioned her, it is evident that she knows nothing on that point. Then there\u0027s Giles?\" \n \n \"Who is Giles?\" \n \n \"He is a man who lives at Mootley, and who caught me in the back room with Mrs. Caldershaw\u0027s dead body. He came over to see Striver about the lease of the corner shop, and was in the garden of The Lodge. I wondered if he might have placed the glass eye on the table.\" \n \n \"Why should he? Does he know anything of the secret?\" \n \n \"I don\u0027t think so, and indeed he is an honest man, who would not harm anyone, my dear. I don\u0027t think Giles had the eye. Then Striver----\" \n \n \"Oh, Cyrus, he did not go to Mootley until the funeral. Do you suspect him?\" \n \n \"Not of the murder. But it is just possible that the eye was not taken by the assassin, and that Striver found it when he was in the shop hunting amongst the papers of his late aunt.\" \n \n \"That is a new idea, since you have always believed that the murder was committed for the sake of the eye.\" \n \n \"I don\u0027t know what to believe,\" I said wearily, passing my hand across my forehead. \"Still someone must have placed the eye on the table, and why not Striver, who was working in the garden?\" \n \n \"I don\u0027t see--supposing your theory of the murder is true--how he could have got possession of the eye. It might be another one?\" \n \n \"I don\u0027t think so, Gertrude, for in the concave of the eye I saw a piece of white metal--silver, I fancy. On that, I truly believe, the hiding-place of the diamonds is indicated.\" \n \n \"But if Joseph had the eye,\" she persisted, \"although I do not see how he could have got it, he would use it to find the diamonds, and thus would not have placed it on the table.\" \n \n \"You forget,\" I said quickly, \"that the hiding place of the eye is indicated in cipher, according to Mrs. Caldershaw. Joseph might have found the eye in the corner house--I don\u0027t accuse him of murder--and, being unable to read the cipher, might have placed the eye on the table to implicate you.\" \n \n \"Why should he, when he says that he loves me?\" \n \n \"For that very reason. He is jealous of me, and knows that you will never marry him. If by implicating you he could secure your arrest, and then could save you by confessing that he found the eye and placed it on the table, he might think you would marry him out of gratitude.\" \n \n \"Oh, the idea is absurd,\" said Gertrude petulantly. \"It\u0027s such a roundabout way of going to work. Let us ask Joseph?\" \n \n \"No,\" I said cautiously; \"after all what I say is merely theoretical. If Joseph did not place the eye on the table, it is no use our letting him know that it was there. It would supply him with a weapon.\" \n \n \"Then you don\u0027t think he----\" \n \n \"I can\u0027t say what I think; as I said before,\" I muttered, rising to pace the room, \"if I were a born detective I might unravel this mystery. As it is I can\u0027t see my way to the truth.\" \n \n \"If the truth is never known,\" remarked Gertrude, after a pause, \"what does it matter?\" \n \n \"This much. You will always be in danger of being denounced by your aunt.\" \n \n \"Not if I give her half the fifty thousand pounds.\" \n \n \"Quite so, my dear, but there again, the truth must be discovered, as you can\u0027t gain possession of the money otherwise. Can you trust your servant?\" \n \n \"Eliza? Oh yes. She has been with us for years. She could not have placed the eye on the drawing-room table. What time did you see it?\" \n \n \"About three o\u0027clock. I was about to enter the room through the middle window, which was open, and saw it suddenly. Then your father called me. When I returned in half-an-hour you were in the room and the eye was gone.\" \n \n \"I had just entered the drawing-room a few moments before you came with papa,\" said Gertrude thoughtfully; \"and I entered through the window, as I had been seeing my aunt out of the gate. The eye certainly was not on the table then. I should have seen it otherwise, as you did.\" \n \n \"Well then, it was gone just before half-past three,\" I remarked, \"and I saw it at the hour. When you were in the drawing-room before that time did you see anything?\" \n \n \"No,\" replied Gertrude impatiently, \"I told you I never saw the eye at all, Cyrus. I did not enter the drawing-room after luncheon until half-past three o\u0027clock. In the morning I certainly saw nothing.\" \n \n \"Was your father in the drawing-room after luncheon?\" \n \n \"Not to my knowledge. He was pottering round the greenhouses. Surely you don\u0027t suspect papa?\" and her color rose. \n \n \"No; certainly not. Only I wondered if he had seen it.\" \n \n \"He could not have seen it, else he would have picked it up to show me.\" \n \n \"Well,\" I said, with a long-drawn sigh, for the mystery of the thing perplexed me, \"I don\u0027t know who placed it there, or who took it away. Perhaps Striver removed it,\" I added with an afterthought. \n \n \"Why should he?\" \n \n \"Why shouldn\u0027t he?\" I echoed. \"It\u0027s the very thing he wanted, since when I saw him at Mootley he was hunting for the eye to secure the money.\" \n \n \"But you said----\" \n \n \"I know what I said,\" was my cross interruption. \"So far as I can see there is no chance of learning the truth, as I dare not risk speaking to Striver lest I place a weapon in his hand. I don\u0027t know what to do.\" \n \n \"Well, dear,\" said Gertrude, rising to take her departure \"if you ask my opinion, I think it is best to leave matters alone.\" \n \n \"But you will be in danger from your aunt\u0027s tongue.\" \n \n \"I don\u0027t think so. I have promised to give her half the money when it is found, and she won\u0027t risk losing that, since she is such a miser. Anne is dead and buried, so let sleeping dogs lie.\" \n \n \"And marry you?\" I asked tenderly. \n \n \"Yes, and marry me.\" She came forward, threw her arms round my neck and whispered: \"Cyrus let us think of ourselves and our happiness, and leave this mystery alone.\" \n \n \"Well,\" I shrugged my shoulders and slipped my arm round her waist, \"I only wished to learn the truth in order to shield you, although I don\u0027t deny that the mystery of the case appeals to me. But if you are content to leave it alone and marry me, so am I. Let us relegate the murder of Mrs. Caldershaw to the already long list of undiscovered crimes.\" \n \n \"And the cloak?\" asked Gertrude, her eyes falling on it. \n \n \"I\u0027ll wrap it up in a parcel, and you can take it back to hang in your wardrobe. Eliza knows that you have a white cloak, and will never connect it with the Mootley murder, even though she read an account of the case.\" \n \n \"She has not,\" said Gertrude shaking her head; \"she never reads any of the newspapers, and only knows that Anne is murdered. She may hear talk, of course, but I don\u0027t fancy she\u0027ll trouble her head.\" \n \n \"Does she know that you went to Mootley on that day?\" \n \n \"No; I told her that I was going to London, for you see I did not wish my father to know that I had been to see Anne.\" \n \n \"Why not?\" \n \n \"Can you ask, knowing what I said about my uncle\u0027s mistrust of my father. If papa knew what I had found out about the diamonds, and had gone to see Anne about the matter, he would--at the time--had I been successful, have insisted on my giving him the jewels. For that reason I kept my visit secret from everyone, save my aunt. I was forced to let her know, as she had arranged to see Anne on that day, and we were bound to meet.\" \n \n \"Did you tell Miss Destiny about the diary?\" \n \n \"Yes. It was necessary for me to ask her if she thought that Anne would be honest enough to give me the cipher. She told me that she believed there would be no difficulty in getting it, as Anne, having nursed me, was devoted to my interest. But you see,\" ended Gertrude with a sigh, \"Anne would only help me on condition that I agreed to marry Joseph.\" \n \n \"Then you don\u0027t intend to let your father have the diamonds when they are found?\" I asked, wrapping up the cloak in brown paper. \n \n \"No, dear. Papa is the best of men, but he does not know the value of money, and if he gained possession of fifty thousand pounds would only squander it. The five hundred a year he has settled on me after his death, and he can\u0027t spend the capital. I shall give papa plenty of money within reason when he asks for it, and when the jewels are mine.\" \n \n \"Oh, he\u0027ll ask for it right enough,\" I muttered cynically. \"However, Gertrude, you must first catch your hare. We must search for the diamonds. It may be that they are hidden in the house.\" \n \n \"No. It has been turned upside down without result.\" \n \n \"I wish I had found time to glance at the cipher, which certainly must have been written on that piece of silver attached to the eye,\" I muttered regretfully. \"However, it\u0027s too late now, nothing can be done.\" \n \n \"Nothing,\" echoed Gertrude, taking the parcel from me and advancing towards the door. \"Leave the matter alone, Cyrus, and let us be happy.\" \n \n I flew after her. \"Gertrude, you are going without----\" \n \n \"Dear, I forgot.\" She paused to kiss me fondly, and then departed. \n \n After that I cared very little if the mystery were solved or not. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2042/58235.html","bookId":610,"book":{"id":610,"title":"The Disappearing Eye","description":"简介： Adventures are to the adventurous, said Cannington, with the air of a man who believes that he is saying something undeniably smart....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2042","creation":"Aug 1, 2019 12:19:02 AM","modification":"Aug 1, 2019 12:19:02 AM"}}
