{"id":44111,"no":18,"title":"CHAPTER XVII. THE DOG FIGHT.","content":"S aturday afternoon walks, when there were no special games on hand, became an institution among what may be called Jack Simpson\u0027s set at Stokebridge. The young fellows had followed his lead with all seriousness, and a stranger passing would have been astonished at the talk, so grave and serious was it. In colliery villages, as at school, the lad who is alike the head of the school and the champion at all games, is looked up to and admired and imitated, and his power for good or for evil is almost unlimited among his fellows. Thus the Saturday afternoon walks became supplements to the evening classes, and questions of all kinds were propounded to Jack, whose attainments they regarded as prodigious. On such an afternoon, as Jack was giving his friends a brief sketch of the sun and its satellites, and of the wonders of the telescope, they heard bursts of applause by many voices, and a low, deep growling of dogs. \"It is a dog fight,\" one of the lads exclaimed. [Pg 167] \"It is a brutal sport,\" Jack said. \"Let us go another way.\" One of the young fellows had, however, climbed a gate to see what was going on beyond the hedge. \"Jack,\" he exclaimed, \"there is Bill Haden fighting his old bitch Flora against Tom Walker\u0027s Jess, and I think the pup is a-killing the old dorg.\" With a bound Jack Simpson sprang into the field, where some twenty or thirty men were standing looking at a dog fight. One dog had got the other down and was evidently killing it. \"Throw up the sponge, Bill,\" the miners shouted. \"The old dorg\u0027s no good agin the purp.\" Jack dashed into the ring, with a kick he sent the young dog flying across the ring, and picked up Flora, who, game to the last, struggled to get at her foe. A burst of indignation and anger broke from the men. \"Let un be.\" \"Put her down.\" \"Dang thee, how dare\u0027st meddle here?\" \"I\u0027ll knock thee head off,\" and other shouts sounded loudly and threateningly. \"For shame!\" Jack said indignantly. \"Be ye men! For shame, Bill Haden, to match thy old dog, twelve year old, wi\u0027 a young un. She\u0027s been a good dorg, and hast brought thee many a ten-pun note. If be\u0027est tired of her, gi\u0027 her poison, but I woant stand by and see her mangled.\" \"How dare \u0027ee kick my dorg?\" a miner said coming angrily forward; \"how dare \u0027ee come here and hinder sport?\" [Pg 168] \"Sport!\" Jack said indignantly, \"there be no sport in it. It is brutal cruelty.\" \"The match be got to be fought out,\" another said, \"unless Bill Haden throws up the sponge for his dog.\" \"Come,\" Tom Walker said putting his hand on Jack\u0027s shoulder, \"get out o\u0027 this; if it warn\u0027t for Bill Haden I\u0027d knock thee head off. We be coom to see spoort, and we mean to see it.\" \"Spoort!\" Jack said passionately. \"If it\u0027s spoort thee want\u0027st I\u0027ll give it thee. Flora sha\u0027n\u0027t go into the ring agin, but oi ull. I\u0027ll fight the best man among ye, be he which he will.\" A chorus of wonder broke from the colliers. \"Then thou\u0027st get to fight me,\" Tom Walker said. \"I b\u0027liev\u0027,\" he went on looking round, \"there bean\u0027t no man here ull question that. Thou\u0027st wanted a leathering for soom time, Jack Simpson, wi\u0027 thy larning and thy ways, and I\u0027m not sorry to be the man to gi\u0027 it thee.\" \"No, no,\" Bill Haden said, and the men round for the most part echoed his words. \"\u0027Taint fair for thee to take t\u0027 lad at his word. He be roight. I hadn\u0027t ought to ha\u0027 matched Flora no more. She ha\u0027 been a good bitch in her time, but she be past it, and I\u0027ll own up that thy pup ha\u0027 beaten her, and pay thee the two pounds I lay on her, if ee\u0027ll let this matter be.\" \"Noa,\" Tom Walker said, \"the young \u0027un ha\u0027 challenged the best man here, and I be a-goaing to lick him if he doant draw back.\" [Pg 169] \"I shall not draw back,\" Jack said divesting himself of his coat, waistcoat, and shirt. \"Flora got licked a\u0027cause she was too old, maybe I\u0027ll be licked a\u0027cause I be too young; but she made a good foight, and so\u0027ll oi. No, dad, I won\u0027t ha\u0027 you to back me. Harry here shall do that.\" The ring was formed again. The lads stood on one side, the men on the other. It was understood now that there was to be a fight, and no one had another word to say. \"I\u0027ll lay a fi\u0027-pound note to a shilling on the old un,\" a miner said. \"I\u0027ll take \u0027ee,\" Bill Haden answered. \"It hain\u0027t a great risk to run, and Jack is as game as Flora.\" Several other bets were made at similar odds, the lads, although they deemed the conflict hopeless, yet supporting their champion. Tom Walker stood but little taller than Jack, who was about five feet six, and would probably grow two inches more; but he was three stone heavier, Jack being a pound or two only over ten while the pitman reached thirteen. The latter was the acknowledged champion of the Vaughan pits, as Jack was incontestably the leader among the lads. The disproportion in weight and muscle was enormous; but Jack had not a spare ounce of flesh on his bones, while the pitman was fleshy and out of condition. It is not necessary to give the details of the fight, which lasted over an hour. In the earlier portion Jack [Pg 170]was knocked down again and again, and was several times barely able to come up to the call of time; but his bull-dog strain, as he called it, gradually told, while intemperate habits and want of condition did so as surely upon his opponent. The derisive shouts with which the men had hailed every knock-down blow early in the fight soon subsided, and exclamations of admiration at the pluck with which Jack, reeling and confused, came up time after time took their place. \"It be a foight arter all,\" one of them said at the end of the first ten minutes. \"I wouldn\u0027t lay more nor ten to one now.\" \"I\u0027ll take as many tens to one as any o\u0027 ye like to lay,\" Bill Haden said, but no one cared to lay even these odds. At the end of half an hour the betting was only two to one. Jack, who had always \"given his head,\" that is, had always ducked so as to receive the blows on the top of his head, where they were supposed to do less harm, was as strong as he was after the first five minutes. Tom Walker was panting with fatigue, wild and furious at his want of success over an adversary he had despised. The cheers of the lads, silent at first, rose louder with each round, and culminated in a yell of triumph when, at the end of fifty-five minutes, Tom Walker, having for the third time in succession been knocked down, was absolutely unable to rise at the call of \"time\" to renew the fight. JACK IS VICTORIOUS. JACK IS VICTORIOUS. [Pg 171]Never had an event created such a sensation in Stokebridge. At first the news was received with absolute incredulity, but when it became thoroughly understood that Bill Haden\u0027s boy, Jack Simpson, had licked Tom Walker, the wonder knew no bounds. So struck were some of the men with Jack\u0027s courage and endurance, that the offer was made to him that, if he liked to go to Birmingham and put himself under that noted pugilist the \"Chicken,\" his expenses would be paid, and ￡50 be forthcoming for his first match. Jack, knowing that this offer was made in good faith and with good intentions, and was in accordance with the custom of mining villages, declined it courteously and thankfully, but firmly, to the surprise and disappointment of his would-be backers, who had flattered themselves that Stokebridge was going to produce a champion middle-weight. He had not come unscathed from the fight, for it proved that one of his ribs had been broken by a heavy body hit; and he was for some weeks in the hands of the doctor, and was longer still before he could again take his place in the pit. Bill Haden\u0027s pride in him was unbounded, and during his illness poor old Flora, who seemed to recognize in him her champion, lay on his bed with her black muzzle in the hand not occupied with a book. The victory which Jack had won gave the finishing stroke to his popularity and influence among his companions, and silenced definitely and for ever the sneers [Pg 172]of the minority who had held out against the change which he had brought about. He himself felt no elation at his victory, and objected to the subject even being alluded to. \"It was just a question of wind and last,\" he said. \"I was nigh being done for at the end o\u0027 the first three rounds. I just managed to hold on, and then it was a certainty. If Tom Walker had been in condition he would have finished me in ten minutes. If he had come on working as a getter, I should ha\u0027 been nowhere; he\u0027s a weigher now and makes fat, and his muscles are flabby. The best dorg can\u0027t fight when he\u0027s out o\u0027 condition.\" But in spite of that, the lads knew that it was only bull-dog courage that had enabled Jack to hold out over these bad ten minutes. As for Jane Haden, her reproaches to her husband for in the first place matching Flora against a young dog, and in the second for allowing Jack to fight so noted a man as Tom Walker, were so fierce and vehement, that until Jack was able to leave his bed and take his place by the fire, Bill was but little at home; spending all his time, even at meals, in that place of refuge from his wife\u0027s tongue,—\"the Chequers.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3173/87028.html","bookId":861,"book":{"id":861,"title":"Facing Death","description":"简介： A row of brick-built houses with slate roofs, at the edge of a large mining village in Staffordshire. The houses are dingy and colourless, and without relief of any kind. So are those in the next row, so in the street beyond, and throughout the whole...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3173","creation":"Aug 1, 2019 12:23:37 AM","modification":"Aug 1, 2019 12:23:37 AM"}}
