{"id":44121,"no":28,"title":"CHAPTER XXVII. RESCUED.","content":"A stranger arriving at Stokebridge on that Sunday morning might have thought that a fair or some similar festivity was going on, so great was the number of people who passed out of the station as each train came in. For the day Stokebridge was the great point of attraction for excursionists from all parts of Staffordshire. Not that there was anything to see. The Vaughan mine looked still and deserted; no smoke issued from its chimneys; and a strong body of police kept all, except those who had business there, from approaching within a certain distance of the shaft. Still less was there to see in Stokebridge itself. Every blind was down—for scarce a house but had lost at least one of its members; and in the darkened room women sat, silently weeping for the dead far below. For the last four days work had been entirely suspended through the district; and the men of the other collieries, as well as those of the Vaughan who, belonging to the other shift, had escaped, hung about the pit [Pg 260]yard, in the vague hope of being able in some way to be useful. Within an hour of the explosion the managers of the surrounding pits had assembled; and in spite of the fact that the three volunteers who had first descended were, without doubt, killed, plenty of other brave fellows volunteered their services, and would have gone down if permitted. But the repeated explosions, and the fact that the lower part of the shaft was now blocked up, decided the experienced men who had assembled that such a course would be madness—an opinion which was thoroughly endorsed by Mr. Hardinge and other government inspectors and mining authorities, who arrived within a few hours of the accident. It was unanimously agreed that the pit was on fire, for a light smoke curled up from the pit mouth, and some already began to whisper that it would have to be closed up. There are few things more painful than to come to the conclusion that nothing can be done, when women, half mad with sorrow and anxiety, are imploring men to make an effort to save those below. Jane Haden, quiet and tearless, sat gazing at the fatal shaft, when she was touched on the shoulder. She looked up, and saw Harry. \"Thou art not down with them then, Harry?\" \"No; I almost wish I was,\" Harry said. \"I came up with Jack, and hurried away to get breakfast. When I heard the blow I ran up, and found Jack had just gone down. If I had only been near I might have [Pg 261]gone with him;\" and the young man spoke in regret at not having shared his friend\u0027s fate rather than in gladness at his own escape. \"Dost think there\u0027s any hope, Harry?\" \"It\u0027s no use lying, and there\u0027s no hope for Jack, mother,\" Harry said; \"but if any one\u0027s saved it\u0027s like to be your Bill. He was up in the old workings, a long way off from the part where the strength of the blow would come.\" \"It\u0027s no use telling me, Harry; I ask, but I know how it is. There ain\u0027t a chance—not a chance at all. If the pit\u0027s afire they\u0027ll have to flood it, and then it will be weeks before they pump it out again; and when they bring Jack and Bill up I sha\u0027n\u0027t know \u0027em. That\u0027s what I feel, I sha\u0027n\u0027t even know \u0027em.\" \"Don\u0027t wait here, Mrs. Haden; nought can be done now; the inspectors and managers will meet this evening, and consult what is best to be done.\" \"Is your father down, Harry? I can\u0027t think of aught but my own, or I\u0027d have asked afore.\" \"No; he is in the other shift. My brother Willy is down. Come, mother, let me take you home.\" But Mrs. Haden would not move, but sat with scores of other women, watching the mouth of the pit, and the smoke curling up, till night fell. The news spread round Stokebridge late in the evening that the managers had determined to shut up the mouth of the pit, if there was still smoke in the morning. Then, as is always the case when such a [Pg 262]determination is arrived at, there was a cry of grief and anger throughout the village, and all who had friends below protested that it would be nothing short of murder to cut off the supply of air. Women went down to the inn where the meeting was held, and raved like wild creatures; but the miners of the district could not but own the step was necessary, for that the only chance to extinguish the fire was by cutting off the air, unless the dreadful alternative of drowning the pit was resorted to. In the morning the smoke still curled up, and the pit\u0027s mouth was closed. Boards were placed over both the shafts, and earth was heaped upon them, so as to cut off altogether the supply of air, and so stifle the fire. This was on Thursday morning. Nothing was done on Friday; and on Saturday afternoon the mining authorities met again in council. There were experts there now from all parts of the kingdom—for the extent of the catastrophe had sent a thrill of horror through the land. It was agreed that the earth and staging should be removed next morning early, and that if smoke still came up, water should be turned in from the canal. At six in the morning a number of the leading authorities met at the mine. Men had during the night removed the greater part of the earth, and the rest was now taken off, and the planks withdrawn. At once a volume of smoke poured out. This was in any case expected; and it was not for another half-hour, when [Pg 263]the accumulated smoke had cleared off, and a straight but unbroken column began to rise as before, that the conviction that the pit was still on fire seized all present. \"I fear that there is no alternative,\" Mr. Hardinge said; \"the pit must be flooded.\" There was not a dissentient voice; and the party moved towards the canal to see what would be the best method of letting in the water, when a cry from the men standing round caused them to turn, and they saw a dense white column rise from the shaft. \"Steam!\" every one cried in astonishment. A low rumbling sound came from the pit. \"What can have happened?\" Mr. Hardinge exclaimed, in surprise. \"This is most extraordinary!\" All crowded round the pit mouth, and could distinctly hear a distant roaring sound. Presently this died away. Gradually the steam ceased to rise, and the air above the pit mouth was clear. \"There is no smoke rising,\" one of the inspectors said. \"What on earth can have happened? Let us lower a light down.\" Hoisting gear and rope had been prepared on the first day, in case it should be necessary to lower any one, for the wire rope had snapped when the attempt had been made to draw up the cage after the second explosion, and the sudden release from the strain had caused the engine to fly round, breaking some gear, and for the time disabling it from further work. A [Pg 264]hundred and forty fathoms of rope, the depth of the shaft being a hundred and twenty, had been prepared, and was in readiness to be passed over a pulley suspended above the shaft. A lighted candle in a candlestick was placed on a sort of tray, which was fastened to the rope, and then it was lowered gradually down. Eagerly those above watched it as it descended—down—down, till it became a mere speck below. Then it suddenly disappeared. \"Stop,\" Mr. Hardinge, who was directing the operations, said. \"There are six more fathoms yet, sir—nigh seven—before it gets to the hundred-and-twenty fathom mark.\" \"Draw up carefully, lads. What can have put the light out forty feet from the bottom of the shaft? Choke-damp, I suppose; but it\u0027s very singular.\" When the candle came up to the surface there was a cry of astonishment; the tray and the candle were wet! The whole of those present were astounded, and Mr. Hardinge at once determined to descend himself and verify this extraordinary occurrence. There was no fear of an explosion now. Taking a miner\u0027s lamp, he took his seat in a sling, and was lowered down. Just before the rope had run out to the point at which the light was extinguished he gave the signal to stop by jerking a thin rope which he held in his hands. There was a pause, and in a minute or two came two jerks, the signal to haul up. \"It is so,\" he said, when he gained the surface; [Pg 265]\"there are forty feet of water in the shaft, but where it came from is more than I can tell.\" Much astonished at this singular occurrence, the group of mining engineers walked back to breakfast at Stokebridge, where the population were greatly excited at the news that the pit was flooded. To the miners it was a subject of the greatest surprise, while the friends of those in the pit received the news as the death-blow of their last hopes. It was now impossible that any one could be alive in the pit. At ten o\u0027clock the mining authorities went again to discuss the curious phenomenon. All agreed that it was out of the question that so large a quantity of water had accumulated in any old workings, for the plan of the pit had been repeatedly inspected by them all. Some inclined to the belief that there must have been some immense natural cavern above the workings, and that when the fire in the pit burned away the pillars left to support the roof, this must have fallen in, and let the water in the cavern into the mine; others pointed out that there was no example whatever of a cavern of such dimensions as this must have been, being found in the coal formation, and pointed to the worked-out Logan pit, which was known to be full of water, as the probable source of supply. During the previous four days the plan had been discussed of cutting through from the Logan, which was known to have been worked nearly up to the Vaughan boundary. This would enable them to enter the pit and [Pg 266]rescue any miners who might be alive, but the fact that to erect pumping gear and get out the water would be an affair of many weeks, if not months, had caused the idea to be abandoned as soon as broached. To those who argued that the water had come from the Logan, it was pointed out that there were certainly several yards of solid coal between the Vaughan and the Logan still standing, and that as the force of the explosion was evidently near the Vaughan shaft it was incredible that this barrier between the pits should have been shattered. However, it was decided to solve the question one way or the other by an immediate visit to the top of the old Logan shaft. They were just starting when they heard a movement in the street, and men setting off to run. A moment later a miner entered the room hurriedly. \"There be a big smoke coming up from the old Logan shaft; it be too light for coal smoke, and I don\u0027t think it be steam either.\" With exclamations of surprise the whole party seized their hats and hurried off. It was twenty minutes\u0027 sharp walking to the shaft, where, by the time they reached it, a large crowd of miners and others were already assembled. As they approached, eager men ran forward to meet them. \"It be gunpowder smoke, sir!\" There was indeed no mistaking the sulphurous smell. \"It\u0027s one of two things,\" Mr. Hardinge said; \"either the fire has spread to the upper workings, some powder [Pg 267]bags have exploded, and the shock has brought down the dividing wall, in which case the powder smoke might possibly find its way out when the water from the Logan drained in; or else, in some miraculous way some of the men have made their escape, and are letting off powder to call our attention. At any rate let us drop a small stone or two down. If any one be below he will know he is noticed.\" Then he turned to the miners standing round: \"I want the pulley and rope that we were using at the Vaughan, and that small cage that was put together to work with it. I want two or three strong poles, to form a tripod over the pit here, and a few long planks to make a stage.\" Fifty willing men hurried off to fetch the required materials. \"The smoke is getting thinner, a good deal,\" one of the managers said. \"Now if you\u0027ll hold me, I will give a shout down.\" The mouth of the pit was surrounded by a wooden fencing, to prevent any one from falling down it. The speaker got over this and lay down on his face, working nearer to the edge, which sloped dangerously down, while others, following in the same way, held his legs, and were in their turn held by others. When his head and shoulders were fairly over the pit he gave a loud shout. There was a death-like silence on the part of the crowd standing round, and all of those close could hear a faint murmur come from below. [Pg 268] Then arose a cheer, echoed again and again, and then half-a-dozen fleet-footed boys started for Stokebridge with the news that some of the imprisoned pitmen were still alive. Mr. Hardinge wrote on a piece of paper, \"Keep up your courage; in an hour\u0027s time the cage will come down;\" wrapped it round a stone, and dropped it down. A messenger was despatched to the Vaughan, for the police force stationed there to come up at once to keep back the excited crowd, and with orders that the stretchers and blankets in readiness should be brought on; while another went into Stokebridge for a surgeon, and for a supply of wine, brandy, and food, and two or three vehicles. No sooner were the men sent off than Mr. Hardinge said, in a loud tone: \"Every moment must be of consequence; they must be starving. Will any one here who has food give it for them?\" The word was passed through the crowd, and a score of picnic baskets were at once offered. Filling one of them full with sandwiches from the rest, Mr. Hardinge tied the lid securely on, and threw it down the shaft. \"There is no fear of their standing under the shaft,\" he said; \"they will know we shall be working here, and that stones might fall.\" In less than an hour, thanks to the willing work of many hands, a platform was constructed across the mouth of the Logan shaft, and a tripod of strong poles fixed in its place. The police kept the crowd, by this [Pg 269]time very many thousands strong, back in a wide circle round the shaft, none being allowed inside save those who had near relatives in the Vaughan. These were for the most part women, who had rushed wildly up without bonnets or shawls—just as they stood when the report reached them that there were yet some survivors of the explosion. At full speed they had hurried along the road—some pale and still despairing, refusing to allow hope to rise again, but unable to stay away from the fatal pit; others crying as they ran; some even laughing in hysterical excitement. Most excited, because most hopeful, were those whose husbands had stalls in the old workings, for it had from the first been believed that while all in the main workings were probably killed at once by the first explosion, those in the old workings might have survived for days. Jane Haden walked steadily along the road, accompanied by Harry Shepherd, who had brought her the news, and by Nelly Hardy. \"I will go,\" she said, \"but it is of no use; they are both gone, and I shall never see them again.\" Then she had put on her bonnet and shawl, deliberately and slowly, and had started at her ordinary pace, protesting all along against its being supposed that she entertained the slightest hope; but when she neared the spot, her quivering lips and twitching fingers belied her words. Nelly remained outside the crowd, but Harry made a way for Jane Haden through the outside circle of spectators. [Pg 270] A smaller circle, of some thirty yards in diameter, was kept round the shaft, and within this only those directing the operations were allowed to enter. Mr. Hardinge and one of the local managers took their places in the cage. The rope was held by twenty men, who at first stood at its full length from the shaft, and then advanced at a walk towards it, thus allowing the cage to descend steadily and easily, without jerks. As they came close to the shaft the signal rope was shaken; another step or two, slowly and carefully taken, and the rope was seen to sway slightly. The cage was at the bottom of the shaft. Three minutes\u0027 pause, the signal rope shook, and the men with the end of the rope, started again to walk from the shaft. As they increased their distance, the excitement in the great crowd grew; and when the cage showed above the surface, and it was seen that it contained three miners, a hoarse cheer arose. The men were assisted from the cage, and surrounded for a moment by those in authority; and one of the head men raised his hand for silence, and then shouted: \"Mr. Brook and twenty others are saved!\" An announcement which was received with another and even more hearty cheer. SAVED! SAVED! Passing on, the rescued men moved forward to where the women stood, anxiously gazing. Blackened as they were with coal-dust, they were recognizable, and with wild screams of joy three women burst from the rest and threw themselves in their arms. But only for [Pg 271]a moment could they indulge in this burst of happiness, for the other women crowded round. \"Who is alive? For God\u0027s sake tell us! who is alive?\" Then one by one the names were told, each greeted with cries of joy, till the last name was spoken; and then came a burst of wailing and lamentation from those who had listened in vain for the names of those they loved. Jane Haden had not risen from the seat she had taken on a block of broken brickwork. \"No, no!\" she said to Harry; \"I will not hope! I will not hope!\" and while Harry moved closer to the group, to hear the names of the saved, she sat with her face buried in her hands. The very first names given were those of Jack Simpson and Bill Haden, and with a shout of joy he rushed back. The step told its tale, and Jane Haden looked up, rose as if with a hidden spring, and looked at him. \"Both saved!\" he exclaimed; and with a strange cry Jane Haden swayed, and fell insensible. An hour later, and the last survivor of those who were below in the Vaughan pit stood on the surface, the last cage load being Mr. Brook, Jack Simpson, and Mr. Hardinge. By this time the mourners had left the scene, and there was nothing to check the delight felt at the recovery from the tomb, as it was considered, of so many of those deemed lost. When Mr. Brook—who was a popular employer, and [Pg 272]whose popularity was now increased by his having, although involuntarily, shared the dangers of his men—stepped from the cage, the enthusiasm was tremendous. The crowd broke the cordon of police and rushed forward, cheering loudly. Mr. Hardinge, after a minute or two, held up his hand for silence, and helped Mr. Brook on to a heap of stones. Although Mr. Brook, as well as the rest, had already recovered much, thanks to the basket of food thrown down to them, and to the supply of weak brandy and water, and of soup, which those who had first descended had carried with them, he was yet so weakened by his long fast that he was unable to speak. He could only wave his hand in token of his thanks, and sobs of emotion choked his words. Mr. Hardinge, however, who had, during the hour below, learned all that had taken place, and had spoken for some time apart with Mr. Brook, now stood up beside him. \"My friends,\" he said, in a loud clear voice, which was heard over the whole crowd, \"Mr. Brook is too much shaken by what he has gone through to speak, but he desires me to thank you most heartily in his name for your kind greeting. He wishes to say that, under God, his life, and the lives of those with him, have been saved by the skill, courage, and science of his under-viewer, Jack Simpson. Mr. Brook has consulted me on the subject, and I thoroughly agree with what he intends to do, and can certify to Jack Simpson\u0027s ability, young as he is, to fill any post to which he [Pg 273]may be appointed. In a short time I hope that the Vaughan pit will be pumped out and at work again, and when it is, Mr. Jack Simpson will be its manager!\" The story of the escape from death had already been told briefly by the miners as they came to the surface, and had passed from mouth to mouth among the crowd, and Mr. Hardinge\u0027s announcement was greeted with a storm of enthusiasm. Jack was seized by a score of sturdy pitmen, and would have been carried in triumph, were it not that the startling announcement, coming after such a long and intense strain, proved too much for him, and he fainted in the arms of his admirers. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3173/87038.html","bookId":861,"book":{"id":861,"title":"Facing Death","description":"简介： A row of brick-built houses with slate roofs, at the edge of a large mining village in Staffordshire. The houses are dingy and colourless, and without relief of any kind. So are those in the next row, so in the street beyond, and throughout the whole...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3173","creation":"Aug 1, 2019 12:23:37 AM","modification":"Aug 1, 2019 12:23:37 AM"}}
