{"id":82719,"no":9,"title":"Page 9","content":"Early Tuesday morning, on what will officially be my first day at Garrison, I pull back the curtain and catch a glimpse of the dark, angry sky. The brooding clouds, all dressed up and nowhere to go, lie stagnant overhead like a layer of black coals. The evergreens stretch their branches toward heaven in hopes to burst the pregnant sacks, but are impotent to the challenge, and the earth remains dry, thirsty for something that might never come. The sun has no hope in a place like this. I\u0027m not sure I can get used to a world without sunshine, but the snow, the friendly footprints of the birds and squirrels stamped throughout the roadside, more than make up for its loss. Then there\u0027s Cruise. The way his smile widens when he sees me, those brilliant flashing teeth that would make pearls ashamed of their color, the five o\u0027clock shadow affording him that perennial bad-boy look. He reduces me to dust and ashes without even trying. There\u0027s no doubt Cruise Elton is unforgivably sexy. How I long for him to be mine. How thirsty I am for his body and soul to want me the way I desperately want him. I wonder if that shower of affection will ever come. If it will ever be genuine or just some lesson on how to score a homerun. The double dating debacle runs through my mind. I\u0027m such an idiot for thinking Cruise would ever want to be my date. But he sort of was in the end, and that\u0027s all that matters. I can still feel his fingers relaxing over mine, warming me with his palm, the current that ran through us, alive and anxious. Cruise and his affection seem as innocent as a downed power line thrashing in a pool of water. Loving Cruise would only hurt in the end, cause irreparable damage if I\u0027m not careful. But I\u0027m not all that interested in being careful anymore. I tumble out of bed and find a note on the kitchen table. Have an early meeting. See you in class. I\u0027m pretty sure he meant at school. I doubt I have any classes with a graduate student. I rush through my morning routine and put on the warmest clothes possible. It looks like a nuclear winter has set in out there. God, I hope those classrooms at Garrison have the heaters turned up full throttle. I step outside and the icy wind knifes through all four layers of clothing like a sickle hacking through weeds. My skin enlivens from the blowtorch effect. This is what I imagined love would be like, the beauty of the landscape luring you in then the surprise of the flames as you burn under the guise of your own foolishness. And, as foolish as it sounds, I wish Cruise would step into that fire with me. God knows I\u0027m looking forward to the burn. I\u0027d do anything to melt with Cruise. Garrison University is a superhighway of bicycles, bodies, and brick buildings as tall and ornate as cathedrals. A tower sits in the center, erect, proud, and well, in every way a monument to all things phallic. A giant metal-framed globe sits on top, declaring it the tallest structure on campus. I gaze at it an inordinate amount of time and wonder how frightening it would feel to be perched on top of its skeletal frame, how fragile the world would look from that vantage point. I move through the crowd and soak in the people, the luxurious landscape that puts to shame the tiny junior college I went to back home. The stone benches with students sitting beneath the trees, expensively dressed girls with tall leather boots, warm wool coats and supple leather handbags. I keep forgetting most everyone at Garrison is a child of privilege, save for the few like me who managed to score a scholarship. But I\u0027m here. I\u0027ve escaped the soup kitchen that was my mother\u0027s home, the dreadful beat box neighborhood where she landed us time after time. And now, Morgan and I are both quasi independent, freeing my mother of the lead shoes we had been for the better half of two decades. Here I am at Garrison, officially on my own. It feels as if the very next step I take will usher me over the threshold into adulthood. I love it here. I can finally breathe. Then there\u0027s Cruise, who perhaps is the best thing Garrison, Carrington, and Massachusetts as a whole have going for them, at least in my eyes. Everything in me soars at the prospect of seeing Cruise today, as if living together could never be enough. Bodies begin to thin out, and the bicycles whirl by more spastic than before, so I hustle over to the liberal arts building for my first class of the day, gender relations. I hike my way to the second floor of an over-bright building. Everything looks new and immaculate inside with its glossy white walls and floors to match. The walls are devoid of the graffiti and informational posters I\u0027ve grown accustomed to at my last school. The hint of fresh paint lingers in the air - the scent of pine cleaner layered just beneath that. Room 228A. This is it. I peer inside. It\u0027s nearly full with row after row of students crammed behind tiny desks, the same ones they had at my old J.C. I\u0027m not sure why this surprises me. A girl swoops inside, and I slide in after her taking a seat in the second row. I hate sitting anywhere near the front. It\u0027s the not-so-fun zone because everybody knows your odds of getting picked on go up astronomically. My backpack hardly fits at my feet, and I find this more than slightly irritating. For some reason I thought the forty thousand dollar price difference would add some square footage to my seating area. The professor stands with his back turned to the class. He\u0027s tall, dressed in a tweed jacket and brown cords - looks nice enough. He busies himself writing something on the chalkboard. Chalk. For sure I thought they\u0027d have those interactive whiteboards gracing this institution of overpriced learning. My mother used to joke you could replace the S in Garrison with a dollar sign. It\u0027s nothing but the best at Garrison, she would chime. But even my J.C. had the slightly more appealing whiteboards to tool around on. The professor remains diligent in his primitive communication endeavor as a trail of dust snows down from his fingertips. God, he looks gorgeous from behind. He sort of reminds me of Cruise the way his hair narrows to his neck in neat waves. In fact, the way he just jerked his shoulder reminds me of a muscular twitch I\u0027ve seen Cruise demonstrate on more than one occasion. I would know. I\u0027ve been watching Cruise Elton like a freaking hawk these past three weeks. I memorized his nuances, studied them like it were a new field in science, his breathing pattern could keep me mesmerized for years. He turns around and inventories the population until he lands right on me with that killer smile. A breath gets caught in my throat. Shit! It is Cruise! I straighten in my seat completely caught off guard by the fact I\u0027ve secretly been devising a plan to sleep with faculty of all people. It feels innately dirty and oh so delicious all at the same time. I give a private wave before sinking in my seat a little. \"Love.\" He steps away from the blackboard and reveals the word scrawled out in large block letters. \"Welcome to Gender Relations. Professor Bradshaw is out indefinitely for the semester, and until he\u0027s able to reprise his role I\u0027ll be stepping in. You can call me Cruise or Mr. Elton if you feel so moved.\" He glances up at me and the curve of a wicked smile ignites. \"Master, if you like.\" Half the girls in class have a Cruise-gasam at the quasi innuendo. A thin girl with a razor-sharp haircut leans in and whispers. \"Can you believe this?\" She looks completely unfazed by Cruise\u0027s godlike qualities and sudden desire to be addressed in such an egotistical manner. \"Nope, I can\u0027t believe this at all.\" I give a wry smile, never taking my eyes off Mr. Elton. God, he cleans up nice. He even shaved for the occasion - he\u0027s wearing a tie and shiny brown shoes, which totally make him look official and everything. To think I came this close to raking up against one of my professors. Not that he\u0027s a bona fide professor. He\u0027s more of a sexy fill-in, but still. A wave of heat spreads through me as he passes out the syllabus. He hands a thick stack to the girl seated to my left and one to me before moving on. Gender Relations Spring Semester Syllabus On your Knees Tongues and Tickles Art of Whoredom Touch me, Tease me, Lick me, Please me. The Fine Art of Moaning Skin on Skin Ask and You Shall Receive Strip Xbox Body Frosting Role Playing and Erotic Fantasy; A journey into mental imagery Show and Tell Master and Servant Sex Video Sex Video? What the hell is this? Porn 101? Oh my God, this is completely perverse. Cruise is going to get himself sued or fired, or worse. Obviously, he\u0027s got some sex addiction if he plans on living out these scenarios with each one of us. I scan the room quickly, expecting half the class to burst out laughing or screaming, but they don\u0027t say a word. The extras get passed in my direction and I gloss over one. Gender Relations: Spring Semester Read: The Great Gatsby Essays and quizzes are listed, and I take a paper for myself before shooting a look to the not-so-funny man in question. He\u0027s got his arms folded across his chest, and he\u0027s leering at me with his lips curled to the side. He\u0027s so enjoying this, I can tell. It\u0027s illegal and unethical to proposition a student, let alone gift her with incriminating evidence should I be moved to initiate legal action. But I\u0027m not. I\u0027m moved to see what the \"Fine Art of Moaning\" might entail. The rest of the class fades to nothing as I negotiate the deep recesses of my mind and envelop myself in a warped fantasy that involves a whole lot of vocal cords and very little clothing. \"Good morning.\" Cruise paces until he sits on the edge of his desk. \"I\u0027d like to open the class with having each of you introduce yourselves and share your position on love in the sensual, sexual sense. And why, outside of the preservation of the species, do you feel it continues to prosper as the single most valued human desire.\" He starts in the front and goes student by student as they give a dry, rather morose view of their position on sensual love. Three girls in a row give an expository on how love degrades women and reduces our species to nothing more than a sexual porthole of pleasure, and I nod in silent agreement. Cruise twists his lips as he considers the words of the last girl. You\u0027d think Cruise himself just knocked the feminist movement down three full decades the way the girl in the bright pink rain slicker cut him off at the balls for implying that love was the \"single most valued human desire.\" Things are falling to shit quickly, and a part of me feels sorry for him. Although, I\u0027m still a little miffed he didn\u0027t tell me he\u0027d be morphing into my teacher in the literal sense since he was already sort of filling that role anyway. Plus that whole sexual syllabus just makes me roll my eyes, even though I plan on going over it in detail as soon as I\u0027m alone. I have to admit, the \"Role Playing and Erotic Fantasy; a journey into mental imagery\" does sound interesting. \"Ms. Jordan?\" Cruise calls from the front and I spike up in my seat. \"Yes? Oh, right, love. Um...\" I pull a strand of hair over my lips the way I do when I\u0027m nervous and consider it a moment. \"Your views?\" He leers into me with those bedroom eyes, and my stomach bottoms out. \"You could share your past views, present views, that is, if they\u0027ve evolved at all.\" He says it low with the deep register of his voice, while smoldering at me openly in front of the class. Something about this forbidden foreplay lights an inferno around me, makes me choke on the prospect of every item on that syllabus occurring in real time. What am I saying? Cruise Elton looks at every girl that way. And to think otherwise is only setting myself up for a spectacular fall. \"I think love is nothing but a fallacy propagated by the greeting card industry and a billion-dollar bridal enterprise that feeds into the fantasy of every little girl.\" I say it a little louder than called for. \"I think the divorce rate in this country is solid evidence that love and all of its trappings are nothing more than an illusion propagated by fairytales that promise \u0027happily ever after\u0027 in a world where neither happy nor ever after truly exist. At the end of the day all that really remains is high-octane lust - enough to fuel a rocket ship - still doesn\u0027t make it real.\" His cheek cinches to the side and his dimple goes off, but no smile. He still manages to melt me in the process. There\u0027s that high-octane lust I was talking about. It\u0027s as if my hormones insist on making the point for me. \"Perhaps, Ms. Jordan\" - he locks me in with a heated gaze - \"you simply haven\u0027t met the right person yet.\" He moves onto the next student, but that cold steely look he gave makes me shudder. Why do I get the feeling I\u0027ve just done something terribly wrong - like stomped out the rosebush of our love before it ever had a chance to blossom. The thin girl next to me clears her throat before giving an answer. She turns to face me fully. The harsh lights from above annunciate the fact she\u0027s sporting a rather burgeoning girl-stache as she frowns. \"I\u0027m sorry for you.\" She says it short and simple, and my face burns with color. She reverts her attention back to Cruise. \"My parents have been married for almost thirty-years. They say \u0027I love you\u0027 and kiss each other hello and goodbye. They\u0027ve raised four kids together, and they still go out on dates.\" She cuts me a look as if I\u0027ve just slashed open the bellies of a hundred newborn puppies. \"I believe in love because it exists. I don\u0027t take other peoples\u0027 failures and make them my own. I will find love, and it will prosper.\" A stunted applause comes from the back of the room and builds until the entire class is roaring and cheering, spontaneously jumping to their feet, with the exception of a well beaten down me. The class goes on that way with everyone declaring themselves team love, while I seem to be garnering more than my fair share of dirty looks. You would think I were secretly spearheading a matrimonial apocalypse, or I\u0027ve made it my personal crusade to take down Valentine\u0027s Day. The class ends and bodies drain from the room. I wait until the last of the stragglers dissipate before making my way to the front. \"I see you\u0027ve outfitted me with a syllabus tailor made for your sexual pleasure.\" I mean for it to come out peppered with humor, but it comes out a sad admission from the one who all but declared herself anti-love. Anyway, that\u0027s basically how I introduced myself to Cruise, so he should be the least surprised. He glances up at me from behind his large mahogany desk, looking dangerously sexy as he takes off his glasses. He walks over, wraps his arms around my waist and holds me for a long span of time. I take in his scent - memorize the girth of his body entangled with mine. He feels safe, nourishing, and hearty, as though I\u0027ve hungered for Cruise my entire life and now I had the vitamins, the essential minerals I needed to survive. All along I had been anemic in the very thing I decried - love. Cruise was the iron my marrow so desperately needed. He kick-started my body again, put God\u0027s own breath in my soul, and I had the nerve to deny him right to his face, openly calling these feelings budding inside me a flat-out lie. A ragged breath escapes from me, and then the unthinkable happens. Tears begin to fall, and I\u0027m weeping a river over his freshly pressed dress shirt. It\u0027s as if I\u0027d carried a weight around with me my whole life, a heart of lead and granite. And today, in front of God and Cruise and about fifty of my newest peers, I dropped it. It lay shattered at my feet because I didn\u0027t want it anymore. I do want to believe in love. I want all of its trappings, and if it costs me my sanity and a very good divorce lawyer, so be it. I pull back and gasp at the mess I\u0027ve made of Cruise. His shirt has turned to velum, and his skin glows beneath. Two necrotic butterflies stain his once-pristine dress shirt, and I\u0027m mortified at what I\u0027ve done. \"I\u0027m so sorry,\" I say, gently tapping the mess with my fingers. God knows I can only make things worse. It seems to be my specialty. \"Come here.\" His dimple goes off as he buries a smile in his cheek. Cruise exudes his affection for me. All of his formidable lust pours out like oil, spilling its riches right into my soul. He leans in and blesses me with a soft peck, then dives in for something deeper, kissing me thoroughly, fully, and intensely on his quest to leave no lingual stone unturned as his tongue warms mine. Cruise pulls away and his mouth opens as if he\u0027s about to say something - say it. A breath gets caught in my throat at the prospect, and I wait but it never comes. I wonder if it ever will. Cruise Kenny. I don\u0027t remember ever walking around campus with a goofy grin on my face when I professed to \"love\" Blair. In fact, quite the opposite, I dragged my ass all over town like a beaten down wuss with my tail between my legs - hardly smiled at anyone. That was a relationship filled with death and dying. I lived out each of the seven stages of grief every day, and twice on Sunday. I should write her a thank you note for letting me out of the tower and escaping exorbitant legal fees somewhere down the line. Although, her father is a notorious divorce attorney and would have probably only billed me my half. Looks like I avoided having my ass handed to me twice. I hustle over in the direction of the administration building. A puff of fog illuminates the campus soft as a gas lamp. Kenny lit up my world. She peeled off the layer of hurt I\u0027ve been hiding under all these months, filled me with her presence, and now the entire universe glows under her beautiful light. Horton Hall comes upon me with its arched Roman colonnades, and I run up and duck inside. It\u0027s warm and suddenly, I have the urge to take off this thick ape suit I\u0027ve strapped myself in. But Kenny left her calling card on my chest, and I\u0027m certain the board would have its curiosity aroused at the sight of those tragic smudges. Back in September, I applied for a fellowship, and now the committee has called me in. I\u0027m amped as to what it might mean - hopefully dollar signs. If I get it, I might actually afford to feed myself, and Kenny, too. I\u0027d move heaven and earth to have her stay at the house forever even if she thinks the concept of love is just an illusion. Kenny is a dove with a broken wing, and I want to be the one to help her mend it. In the office, members of affluent academia line the periphery with the dean of graduate admissions, the dean of doctoral studies next to him, as well as Professor Bradshaw - and, holy crap, he looks like a corpse. \"Cruise.\" He stands to greet me, and I take his hand in both of mine, afraid he might keel over and explode into dust. He\u0027s lost about fifty pounds, and he hardly had it on him to begin with. His skin is pale and thin as parchment with dark circles beneath each eye. If ever there was death on the move, it was encapsulated in Bernie Bradshaw. I\u0027d ask how the chemo was going, but I think I know. \"Did you enjoy your first class?\" He gives a pleasant smile as he lands hard in his seat. \"It went great. Better than expected. I appreciate the opportunity.\" \"Fantastic,\" Dr. Barney, Dean of admissions, interjects. \"I hope you\u0027ll appreciate this new opportunity that\u0027s about to come your way. You might even call this your lucky day.\" I glance at the three of them. I\u0027m a lot of things - lucky isn\u0027t one of them. \"Unfortunately for Garrison\" - Dr. Barney offers a morbid nod - \"Professor Bradshaw has decided it\u0027s best for him to step down at this time.\" \"I\u0027m sorry to hear that.\" Shit. Knew it wasn\u0027t good. I swallow hard. Bradshaw has been a mentor to me. He assisted in structuring my thesis, tailoring it for a surefire admit to the doctoral program. \"Cruise\" - Barney leans in - \"we\u0027d like to know if you\u0027d be willing to take over for the rest of the semester?\" He glances over at Bradshaw. \"We realize you signed on to help out with a few classes, but this would mean running the course on your own. Professor Novak volunteered to oversee the situation. Technically, it will be considered co-teaching. Although, Professor Bradshaw assures us you\u0027re more than capable of running the show on your own. Your passion for gender studies hasn\u0027t gone unrecognized. However, we understand you have your own coursework to tend to, and should you decline, we would certainly support you either way.\" A surge of adrenaline races through me. Hell yes, I want to shout but somehow manage to remain subdued. \"Should you accept\" - Professor Bradshaw expels the words as if he were utilizing his dying breath to birth them - \"you\u0027ll have the tuition of one course credited to your fellowship as income, this semester.\" He withholds a smile and tilts his head back with pride. \"I got the fellowship?\" A credit for one course no less? \"Congratulations.\" Dr. Barney bears his yellow fangs, and I\u0027m more than glad to see them. \"As a part of your doctoral studies, we\u0027d appreciate it if you would continue teaching the class in the fall as well. It will be a pleasure to watch you grow as you, yourself, become an esteemed colleague right here at Garrison.\" \"Thank you.\" My heart lets off a few irregular beats like it\u0027s misfiring. It all feels surreal. Kenny and now the fellowship? I\u0027ve got a gut feeling someone upstairs is making more than their fair share of errors, but I\u0027ll be the last one to point it out. \"It\u0027s an honor to be considered. I accept.\" The three of them stand, and I shake their hands in turn. I pull Professor Bradshaw into a half-hug and accidentally brush up against the bony protrusions of his spine. \"I won\u0027t let you down,\" I whisper. \"I promise.\" His bushy brows lift, revealing a network of green and blue veins beneath his onion-thin flesh. \"You\u0027d better not. There were far more qualified candidates, but I knew you had the fire in your belly. You\u0027ll carry out the program much better than any of those dry wells. Just remember\" - he clasps both his hands over mine - \"believe what you teach. What was the topic today?\" \"Love.\" \"Do you believe in it?\" Kenny blinks through my mind. \"More than ever.\" I bolt out of the administration building feeling like I\u0027ve just won the scholastic lottery because, holy fucking shit, I have. That stupid grin takes over as I head into the stream of bodies rushing to their next classes. The ground is dusted with a layer of snow, and the first thing that comes to mind is Kenny and her serious lack of winter clothes. I\u0027ll take her shopping to celebrate. I\u0027ve got an entire semester\u0027s worth of loans I don\u0027t need to worry about, and even though I\u0027m sitting under a mountain of financial duress, I\u0027ll gladly treat Kenny to something that can keep her pneumonia-free for the next several months. Hell, I might even take her to dinner. Although the fellowship still doesn\u0027t change the fact I\u0027m a little low on spending cash at the moment. I sweep my eyes over the vicinity, hoping to see her and with my newfound luck, I just might. I scan every dark-haired girl as far as the eye can see and none of them even come close to the beauty that Kenny holds. Kenny is an exotic flower in a sea of common houseplants. All last semester, I sat at the University Bar and Grill and listened to Cal rate girls in ratio to how many beers it would take for him to sleep with them. I never once found them exceptional, but that night at Sigma Phi when Kenny walked in, I couldn\u0027t take my eyes off that face - that mind-blowing body, her heart-stopping beauty was alarming in every good way. She openly defied my thesis on the heresy of love at first sight. I knew then I had to have her, if only for a night. A lifetime seemed like an impossibility in the least, and now, it didn\u0027t seem like enough time at all. I stop just shy of the bookstore and glance at the corkboard filled with requests and opportunities. A bright yellow sign catches my eye. Need $200? Not shy? We want your body! Contact Professor Webber. Art department. I tear a fringe off the sheet, with a number on it, and tuck it in my pocket. I think I just found Kenny\u0027s new winter coat and boots. A familiar head of blond hair catches my attention from inside the bookstore and I peer in to confirm my worst nightmare. Blair. She rocks steady on her heels while browsing the literature section. She peers out from over her book as though she\u0027s been eyeing me all along. I turn and head in the opposite direction. Shit. She can\u0027t be here. She transferred to Dartmouth to follow the idiot whose dick she impaled herself onto before she officially dumped me. I take a deep breath, giving one final scan of the campus for Kenny before taking off. Blair can\u0027t be back. Garrison isn\u0027t big enough.","sourceLink":"https://allnovel.net/someone-to-love-someone-to-love-1/page-9.html","bookId":1870,"book":{"id":1870,"title":"Someone to Love (Someone to Love #1)","description":"Storyline: Someone to Love (Someone to Love #1) What happens when two people who don’t believe in love, happen to fall madly into the most beautiful relationship they could ever imagine? A train wreck. When twenty-year-old Kendall Jordan transfers clear across country to Garrison University, the last thing she’s looking for is a one-night stand. Unfortunately, that’s exactly what, gorgeous, Cruise Elton offers. Kendall has long since come to realize that love is an illusion that never lasts, and Cruise couldn’t agree more—but something deep inside her wants him all for herself. So, Kendall devises a seat of the pants plan to “play the player” and proposes that Cruise tutor her in becoming a female version of himself, Garrison University’s own playboy. Real feelings begin to emerge, and neither Kendall nor Cruise know how to classify them. Everything they once thought they knew is redefined as they discover, in one another, Someone to Love.","cover":"https://allnovel.net/images/someone-to-love-someone-to-love-1.jpg","author":"Addison Moore","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/someone-to-love-someone-to-love-1.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:45:51 PM"}}
