{"id":68066,"no":18,"title":"Page 18","content":"While Sid was trying to figure it all out, the bull noticed the tanks. It stared at them for a while, then pawed the ground and lumbered into a run.\n It was going to charge a tank.\n \"Daft bugger, you\u0027ll break your head,\" Sid muttered.\n The soldiers were watching the bull too. They seemed to think it was very funny.\n The bull ran full-tilt into the tank, its horns piercing the armour-plated side of the vehicle. Sid hoped fervently that British tanks were stronger than the American ones.\n There was a loud hissing noise as the bull worked its horns free. The tank collapsed like a deflated balloon. The American soldiers fell all over each other, laughing.\n It was all quite strange.\n Percival Godliman walked quickly across Parliament Square, carrying an umbrella. He wore a dark striped suit under his raincoat, and his black shoes were highly polished-at least they had been until he stepped out into the rain. It was not every day-come to that, it was not every year-that he had a private audience with Mr Churchill.\n A career soldier would have been nervous at going with such bad news to see the supreme commander of the nation\u0027s armed forces. Godliman was not nervous; a distinguished historian had nothing to fear, he told himself, from soldiers and politicians, not unless his view of history was a good deal more radical than Godliman\u0027s was. Not nervous, then, but worried.\n Distinctly worried.\n He was thinking about the effort, the forethought, the care, the money, and the manpower that had gone into the creation of the totally ersatz First United States Army Group stationed in Eeast Anglia: the four hundred landing ships, made of canvas and scaffolding floated on oil drums, that thronged the harbours and estuaries; the carefully manufactured inflatable dummies of tanks, artillery, trucks, half-tracks, and even ammunition dumps; the complaints planted in the correspondence columns of the local newspapers about the decline in moral standards since the arrival of thousands of American troops in the area; the phony oil dock at Dover, designed by Britain\u0027s most distinguished architect and built out of cardboard and old sewage pipes by craftsmen borrowed from film studios; the carefully faked reports transmitted to Hamburg by German agents who had been \"turned\" by the XX Committee; and the incessant radio chatter, broadcast for the benefit of the German listening posts, consisting of messages compiled by professional writers of fiction, and including such as \"1/5th Queen\u0027s Royal Regiment report a number of civilian women, presumably unauthorised, in the baggage train. What are we going to do with them-take them to Calais?\" No question, a good deal had been achieved. The signs indicated that the Germans had bought it. And now the whole elaborate deception had been put in jeopardy because of one damned spy: a spy Godliman had failed to catch. Which, of course, was the reason for his command performance today.\n His short birdlike paces measured the Westminster pavement to the small doorway at No. 2, Great George Street. The armed guard standing beside the wall of sandbags examined his pass and waved him in. He crossed the lobby and went down the stairs to Churchill\u0027s underground headquarters.\n It was like going below decks on a battleship. Protected from bombs by a four-foot-thick ceiling of reinforced concrete, the command post featured steel bulkhead doors and roof props of ancient timber. As Godliman entered the map room a cluster of youngish people with solemn faces emerged from the conference room beyond. An aide followed them a moment later, and spotted Godliman.\n \"You\u0027re very punctual, sir,\" the aide said. \"He\u0027s ready for you.\"\n Godliman stepped into the small, comfortable conference room. There were rugs on the floor and a picture of the king on the wall. An electric fan stirred the tobacco smoke in the air. Churchill sat at the head of an old mirror-smooth table in the centre of which was a statuette of a faun: the emblem of Churchill\u0027s own deception outfit, the London Controlling Section. Godliman decided not to salute. Churchill said, \"Sit down, Professor.\"\n Godliman suddenly realised that Churchill was not a big man but he sat like a big man: shoulders hunched, elbows on the arms of his chair, chin lowered, legs apart. He was wearing a solicitor\u0027s black-and-stripes: short black jacket and striped grey trousers with a spotted blue bow tie and a brilliant white shirt. Despite his stocky frame and his paunch, the hand holding the fountain pen was delicate, thin-fingered. His complexion was baby-pink. The other hand held a cigar, and on the table beside the papers stood a glass containing what looked like whisky. He was making notes in the margin of a typewritten report, and as he scribbled he occasionally muttered. Godliman was not really awed by the great man. As a peacetime statesman Churchill had been, in Godliman\u0027s view, something of a disaster. However, the man had the qualities of a great warrior chieftain, and Godliman very much respected him for that. (Churchill modestly denied being the British lion, saying that he merely was privileged to give the roar; Godliman thought that assessment was just about right.) He looked up abruptly now. \"I suppose there\u0027s no doubt this damned spy has discovered what we\u0027re up to?\"\n \"None whatsoever, sir,\" Godliman said.\n \"You think he\u0027s got away?\"\n \"We chased him to Aberdeen. It\u0027s almost certain that he left there two nights ago in a stolen boat, presumably for a rendezvous in the North Sea. However, he can\u0027t have been far out of port when the storm blew up. He may have met the U-boat before the storm hit, but it\u0027s unlikely. In all probability he drowned. I\u0027m sorry we can\u0027t offer more definite information.\"\n \"So am I,\" Churchill said, and suddenly he seemed angry, though not with Godliman. He got out of his chair and went over to the clock on the wall, staring as if mesmerised at the inscription, Victoria R.I., Ministry of Works, 1889. Then as if he had forgotten that Godliman was there, he began to pace up and down alongside the table, muttering to himself. Godliman was able to make out the words, and what he heard astonished him. The great man was mumbling: \"This stocky figure, with a slight stoop, striding up and down, suddenly unconscious of any presence beyond his own thoughts...\" It was as if Churchill were acting out a Hollywood screenplay that he wrote as he went along.\n The performance ended as abruptly as it had begun, and if the man knew he had been behaving eccentrically, he gave no sign of it. He sat down, handed Godliman a sheet of paper and said, \"This is the German order of battle as of last week.\"\n Godliman read:\n \u0027Russian front: 122 infantry divisions, 25 panzer divisions, 19 miscellaneous divisions; Italy amp; Balkans: 39 infantry divisions, 9 panzer divisions, 4 miscellaneous divisions; Western front: 64 infantry divisions, 12 panzer divisions, 12 miscellaneous divisions; Germany: 3 infantry divisions, 1 panzer division, 4 miscellaneous divisions.\u0027\n Churchill said: \"Of those twelve panzer divisions in the west, only one is actually on the Normandy coast. The great SS divisions, Das Reich and Adolf Hitler, are at Toulouse and Brussels respectively and show no signs of moving. What does an this tell you, professor?\"\n \"Our deception and cover plans seem to have been successfull,\" Godliman answered, and realised the trust Churchill had placed in him. Until this moment, Normandy had never been mentioned to him, not by his uncle Colonel Terry or anybody else, though he had deduced as much, knowing as he did about the artificial buildup aimed at Calais. Of course, he still did not know the date of the invasion, D-Day, and was grateful that he did not.\n \"Totally successful,\" Churchill said. \"They are confused and uncertain, and their best guesses about our intentions are wildly wrong. And yet...\" he paused for effect, \"And yet, despite all that...\" He picked up another piece of paper from the table and read it aloud. \"\u0027Our chances of holding the beachhead, particularly after the Germans get their buildup, are only fifty-fifty.\u0027\"\n He put his cigar down, and his voice became quite soft. \"It has taken the total military and industrial might of the whole English-speaking world-the greatest civilisation since the Roman Elmpire-four years to win this fifty-fifty chance. If this spy gets out, we lose even that. Which is to say, we lose everything.\"\n He stared at Godliman for a moment, then picked up his pen with a frail white hand. \"Don\u0027t bring me probabilities, professor. Bring me Die Nadel.\"\n He looked down and began to write. After a moment Godliman got up and quietly left the room.\n Cigarette tobacco burns at 800 degrees centigrade. However, the coal at the end of the cigarette is normally surrounded by a thin layer of ash. To cause a burn, the cigarette has to be pressed against the skin for the better part of a second a glancing touch will hardly be felt. This applies even to the eyes; blinking is the fastest involuntary reaction of the human body. Only amateurs throw cigarettes, and David Rose was an amateur; a thoroughly frustrated and action-starved amateur. Professionals ignore them.\n Faber ignored the lighted cigarette that David Rose threw at him. He was right, because the cigarette glanced off his forehead and fell to the metal floor of the jeep. He made a grab for David\u0027s gun, which was an error. He should, he instantly realised, have drawn his stiletto and stabbed David: David might have shot him first but David had never before pointed a gun at a human being, let alone killed somebody, so he would almost certainly have hesitated and in that moment Faber could have killed him. Faber decided he could blame his recent lapse into humanity for such intolerable miscalculation. It would be his last.\n David had both hands on the midsection of the gun-left hand on the barrel, right hand around the breech-and had pulled the weapon about six inches from its rack when Faber got a one-handed grip on the muzzle. David tugged the gun toward himself, but for a moment Faber\u0027s grasp held the gun pointed at the windscreen.\n Faber was a strong man, but David was exceptionally strong. His shoulders, arms and wrists had moved his body and his wheelchair for four years, and the muscles had become abnormally developed. Furthermore he had both hands on the gun in front of him, and Faber was holding on with one hand at an awkward angle. David tugged again, more determinedly this time, and the muzzle slipped from Faber\u0027s grasp.\n At that instant, with the shotgun pointed at his belly and David\u0027s finger curling around the trigger, Faber felt very close to death.\n He jerked upward, catapulting himself out of his seat. His head hit the canvas roof of the jeep as the gun exploded with a crash that numbed the ears and produced a physical pain behind the eyes. The window by the passenger seat shattered into small pieces and the rain blew in through the empty frame. Faber twisted his body and fell back, not onto his own seat but across David. He got both hands to David\u0027s throat and squeezed his thumbs.\n David tried to bring the gun around between their bodies to fire the other barrel, but the weapon was too big. Faber looked into his eyes, and saw... what? Exhilaration. Of course the man finally had a chance to fight for his country. Then his expression changed as his body felt the lack of oxygen and he began to fight for breath.\n David released his grip on the gun and brought both elbows back as far as he could, then punched Faber\u0027s lower ribs with a powerful double jab. Faber screwed up his face in pain, but he held his grip on David\u0027s throat, knowing he could withstand David\u0027s punches longer than David could hold his breath.\n David must have had the same thought. He crossed his forearms between their bodies and pushed Faber away; then, when the gap was a few inches wide, he brought his hands up in an upward-and-outward blow against Faber\u0027s arms, breaking the stranglehold. He bunched his right fist and swung downward with a powerful but unscientific punch that landed on Faber\u0027s cheekbone and brought water to his eyes.\n Faber replied with a series of body jabs; David continued to bruise his face. They were too close together to do real damage to each other in a short time, but David\u0027s greater strength began to tell.\n Almost in admiration, Faber realised that David had shrewdly picked the time and place for the fight: he had had the advantages of surprise, the gun, and the confined space in which his muscle counted for much and Faber\u0027s better balance and greater manoeuvrability counted for little. He had only erred, really, in his bravado-understandable perhaps-about finding the film can, giving Faber a moment of warning.\n Faber shifted his weight slightly and his hip came into contact with the gearshift, throwing the transmission into forward. The engine was still running and the car jerked, throwing him off balance. David used the opportunity to release a long straight left that-more by luck than by judgment-caught Faber flush on the chin and threw him clear across the cab of the jeep. His head cracked against the A-post, he slumped with his shoulder on the door handle, the door opened, and he fell out of the car in a backward somersault to land on his face in the mud.\n For a moment he was too dazed to move. When he opened his eyes he could see nothing but flashes of blue lightning against a misty red background. He heard the engine of the jeep racing. He shook his head trying to clear the fireworks from his vision, and struggled onto his hands and knees. The sound of the jeep receded and then came closer again. He turned his head toward the noise, and as the colours in front of his eyes dissolved and disappeared he saw the vehicle bearing down on him.\n David was going to run him over.\n With the front bumper less than a yard from his face he threw himself sideways. He felt a blast of wind. A fender struck his outflung foot as the jeep roared past, its heavy-gauge tyres tearing up the spongy turf and spitting mud. He rolled over twice in the wet grass, then got to one knee. His foot hurt. He watched the jeep turn in a tight circle and come for him again.\n He could see David\u0027s face through the windscreen. The young man was leaning forward, hunched over the steering wheel, his lips actually drawn back over his teeth in a savage, almost crazy, grin... apparently the frustrated warrior imagining himself in the cockpit of a Spitfire, coming down out of the sun at an enemy plane with all eight Browning machine guns blazing 1,260 rounds per minute.\n Faber moved toward the cliff edge. The jeep gathered speed. Faber knew that, for a moment at least, he was incapable of running. He looked over the cliff-a rocky, almost vertical slope-to the angry sea a hundred feet below. The jeep was coming straight down the cliff edge toward him. Faber looked up and down for a ledge, or even a foothold. There was none. The jeep was four or five yards away, travelling at something like forty miles per hour. Its wheels were less than two feet from the cliff edge. Faber dropped flat and swung his legs out into space, supporting his weight on his forearms as he hung on the brink.\n The wheels passed him within inches. A few yards further on one tyre actually slipped over the edge. For a moment Faber thought the whole vehicle would slide over and fall into the sea below, but the other three wheels dragged the jeep to safety.\n The ground under Faber\u0027s arms shifted. The vibration of the jeep\u0027s passing had loosened the earth. He felt himself slip a fraction. One hundred feet below, the sea boiled among the rocks. Faber stretched one arm to its farthest extent and dug his fingers deep into the soft ground. He felt a nail tear, and ignored it. He repeated the process with his other arm. With two hands anchored in the earth he pulled himself upward. It was agonisingly slow, but eventually his head drew level with his hands, his hips reached firm ground, and he was able to swivel around and roll away from the edge.\n The jeep was turning again. Faber ran toward it.\n His foot was painful, but not, he decided, broken. David accelerated for another pass. Faber turned and ran at right angles to the jeep\u0027s direction, forcing David to turn the wheel and consequently slow down.\n Faber knew he could not keep this up much longer; he was certain to tire before David did. This had to be the last pass.\n He ran faster. David steered an interception course, headed for a point in front of Faber. Faber doubled back, and the jeep zigzagged. It was now quite close. Faber broke into a sprint, his course forcing David to drive in a tight circle. The jeep was getting slower and Faber was getting closer.\n There were only a few yards between them when David realised what Faber was up to. He steered away but it was too late. Faber rushed to the jeep\u0027s side and threw himself upward, landing face down on the top of the canvas roof.\n He lay there for a few seconds, catching his breath. His injured foot felt as if it was being held in a fire; his lungs ached.\n The jeep was still moving. Faber drew the stiletto from its sheath under his sleeve and cut a long, jagged tear in the canvas roof. The material flapped downward and Faber found himself staring at the back of David\u0027s head.\n David looked up and back; a look of astonishment crossed his face. Faber drew back his arm for a knife thrust...\n David jammed the throttle open and heaved the wheel around. The jeep leaped forward and lifted on two wheels as it screeched around in a tight curve.\n Faber struggled to stay on. The jeep, still gathering speed, crashed down onto four wheels, then lifted again. It teetered precariously for a few yards, the wheels slipped on the sodden ground, and the vehicle toppled onto its side with a grinding crash.\n Faber was thrown several yards and landed awkwardly, the breath knocked out of him by the impact. It was several seconds before he could move.\n The jeep\u0027s crazy course had once again taken it perilously close to the cliff.\n Faber saw his knife in the grass a few yards away.\n He picked it up, then turned to the jeep.\n Somehow, David had got himself and his wheelchair out through the ripped roof, and he was now sitting in the chair and pushing himself away along the cliff edge. Faber, running after him, had to acknowledge his courage.\n David must have heard the footsteps, because just before Faber caught up with the chair it stopped dead and spun around; and Faber glimpsed a heavy wrench in David\u0027s hand.\n Faber crashed into the wheelchair, overturning it. His last thought was that both of them and the chair might end up in the sea below and then the wrench hit the back of his head and he blacked out.\n When he came to, the wheelchair lay beside him, but David was nowhere to be seen. He stood up and looked around in dazed puzzlement.\n \"Here.\"\n The voice came from over the cliff. David must have just been able to hit him with the wrench before being flung from the chair and over the edge.\n Faber crawled to the cliff and looked over.\n David had one hand around the stem of a bush that grew just under the lip of the cliff. The other hand was jammed into a small crevice in the rock.\n He hung suspended, just as Faber had a few minutes earlier. His bravado had gone now.\n \"Pull me up, for God\u0027s sake,\" he called hoarsely.\n Faber leaned closer. \"How did you know about the film?\" he said.\n \"Help me, please.\"\n \"Tell me about the film.\"\n \"Oh, God.\" David made a mighty effort to concentrate. \"When you went to Tom\u0027s outhouse you left your jacket drying in the kitchen, Tom went upstairs for more whisky and I went through your pockets and I found the negatives.\"\n \"And that was evidence enough for you to try to kill me?\"\n \"That, and what you did with my wife in my house... no Englishman would behave like that \"\n Faber could not help laughing. The man was a boy, after all. \"Where are the negatives now?\"\n \"In my pocket...\"\n \"Give them to me, and I\u0027ll pull you up.\"\n \"You\u0027ll have to take them. I can\u0027t let go. Hurry...\"\n Faber lay flat on his stomach and reached down, under David\u0027s oilskin, to the breast pocket of his jacket. He sighed in relief as his fingers reached the film can and carefully withdrew it. He looked at the films; they all seemed to be there. He put the can in the pocket of his jacket, buttoned the flap, and reached down to David again. No more mistakes. He took hold of the bush David was clinging to and uprooted it with a savage jerk.\n David screamed, \"No!\" and scrabbled desperately for grip as his other hand slipped inexorably out of the crack in the rock.\n \"It\u0027s not fair,\" he screamed, and then his hand came away from the crevice.\n He seemed to hang in midair for a moment, then dropped, bouncing twice against the cliff on his way down, until he hit the water with a splash.\n Faber watched for a while to make sure he did not come up again. \"Not fair? Not fair? Don\u0027t you know there\u0027s a war on?\"\n He looked down at the sea for some minutes. Once he thought he saw a flash of yellow oilskin on the surface but it was gone before he could focus on it. There was just the sea and the rocks.\n Suddenly he felt terribly tired. His injuries penetrated his consciousness one by one: the damaged foot, the bump on his head, the bruises all over his face. David Rose had been something of a fool, also a braggart and a poor husband, and he had died screaming for mercy; but he had been a brave man, and he had died for his country, which had been his contribution. Faber wondered whether his own death would be as good. He turned away from the cliff edge and walked back toward the overturned jeep.\n Percival Godliman felt refreshed, determined, even-rare for him-inspired. When he reflected on it, this made him uncomfortable. Pep-talks were for the rank-and-file, and intellectuals believed themselves immune from inspirational speeches. Yet, although he knew that the great man\u0027s performance had been carefully scripted, the crescendos and diminuendos of the speech predetermined like a symphony, nevertheless it had worked on him, as effectively as if he had been the captain of the school cricket team hearing last-minute exhortations from the games master. He got back to his office itching to do something.\n He dropped his umbrella in the umbrella stand, hung up his wet raincoat, and looked at himself in the mirror on the inside of the cupboard door. Without doubt something had happened to his face since he became one of England\u0027s spycatchers. The other day he had come across a photograph of himself taken in 1936, with a group of students at a seminar in Oxford. In those days he actually looked older than he did now: pale skin, wispy hair, the patchy shave and ill-fitting clothes of a retired man. The wispy hair had gone; he was now bald except for a monkish fringe. His clothes were those of a business executive, not a teacher. It seemed to him-he might, he supposed, have been imagining it-that the set of his jaw was firmer, his eyes were brighter, and he took more care shaving. He sat down behind his desk and lit a cigarette. That innovation was not welcome; he had developed a cough, tried to give it up, and discovered that he had become addicted. But almost everybody smoked in wartime Britain, even some of the women. Well, they were doing men\u0027s jobs; they were entitled to masculine vices. The smoke caught in Godliman\u0027s throat, making him cough. He put the cigarette out in the tin lid he used for an ashtray (crockery was scarce).\n The trouble with being inspired to perform the impossible, he reflected, was that the inspiration gave you no clues to the practical means. He recalled his college thesis about the travels of an obscure mediaeval monk called Thomas of the Tree. Godliman had set himself the minor but difficult task of plotting the monk\u0027s itinerary over a five-year period. There had been a baffling gap of eight months when he had been either in Paris or Canterbury but Godliman had been unable to determine which, and this had threatened the value of the whole project. The records he was using simply did not contain the information. If the monk\u0027s stay had gone unrecorded, then there was no way to find out where he had been and that was that. With the optimism of youth, young Godliman had refused to believe that the information was just not there, and he had worked on the assumption that somewhere there had to be a record of how Thomas had spent those months despite the well-known fact that almost everything that happened in the Middle Ages went unrecorded. If Thomas was not in Paris or Canterbury he must have been in transit between the two, Godliman had argued; and then he had found shipping records in an Amsterdam museum that showed that Thomas had boarded a vessel bound for Dover that got blown off course and was eventually wrecked on the Irish coast. This model piece of historical research was what got Godliman his professorship.\n He might try applying that kind of thinking to the problem of what had harpened to Faber.\n It was most likely that Faber had drowned. If he had not, then he was probably in Germany by now.\n Neither of those possibilities presented any course of action Godliman could follow, so they should be discounted. He must assume that Faber was alive and had reached land somewhere. He left his office and went down one flight of stairs to the map room. His uncle, Colonel Terry, was there, standing in front of the map of Europe with a cigarette between his lips. Godliman realised that this was a familiar sight in the War Office these days: senior men standing entranced at maps, silently making their own computations of whether the war would he won or lost. He guessed it was because all the plans had been made, the vast machine had been set in motion, and for those who made the big decisions there was nothing to do but wait and see if they had been right.\n Terry saw bin come in and said, \"How did you get on with the great man?\"\n \"He was drinking whisky.\" Godliman said.\n \"He drinks all day. But it never seems to make any difference to him.\" Terry said \"What did he say?\"\n \"He wants Die Nadel\u0027s head on a platter.\" Godliman crossed the room to the wall map of Great Britain and put a finger on Aberdeen. \"If you were sending a U-hoat in to pick up a fugitive spy, what would you think was the nearest the sub could safely come to the coast?\"\n Terry stood beside him and looked at the map. \"I wouldn\u0027t want to come closer than the three-mile limit. But for preference I\u0027d stop ten miles out.\"\n \"Right.\" Godliman drew two pencil lines parallel to the coast, three miles and ten miles out respectively. \"Now, if you were an amateur sailor setting out from Aberdeen in a smallish fishing boat, how far would you go before you began to get nervous?\"\n \"You mean, what\u0027s a reasonable distance to travel in such a boat?\"\n \"Indeed.\"\n Terry shrugged. \"Ask the Navy. I\u0027d say fifteen or twenty miles.\"\n \"I agree.\" Godliman drew an arc of twenty miles radius with its centre on Aberdeen. \"Now if Faber is alive, he\u0027s either back on the mainland or somewhere within this space.\" He indicated the area bounded by the parallel lines and the arc.\n \"There\u0027s no land in that area.\"\n \"Have we got a bigger map?\"\n Terry pulled open a drawer and got out a large-scale map of Scotland. He spread it on top of the chest. Godliman copied the pencil marks from the smaller map onto the larger.\n There was still no land within the area.\n \"But look,\" Godliman said. Just to the east of the ten-mile limit was a long, narrow island.\n Terry peered closer. \"Storm Island,\" he read. \"How apt.\"\n Godliman snapped his fingers. \"Could be...\"\n \"Can you send someone there?\"\n \"When the storm clears. Bloggs is up there. I\u0027ll get a plane laid on for him. He can take off the minute the weather improves.\" He went to the door.\n \"Good luck,\" Terry called after him.\n Godliman took the stairs two at a time to the next floor and entered his offlce. He picked up the phone. \"Get Mr Bloggs in Aberdeen, please.\"\n While he waited he doodled on his blotter, drawing the island. It was shaped like the top half of a walking stick, with the crook at the western end.\n It must have been about ten miles long and perhaps a mile wide. He wondered what sort of place it was: a barren lump of rock, or a thriving community of farmers? If Faber was there he might still be able to contact his U-boat; Bloggs would have to get to the island before the submarine.\n \"I have Mr Bloggs,\" the switchboard girl said.\n \"Fred?\"\n \"Hello, Percy.\"\n \"I think he\u0027s on an island called Storm Island.\"\n \"No, he\u0027s not,\" Bloggs said. \"We\u0027ve just arrested him.\" (He hoped.)\n The stiletto was nine inches long, with an engraved handle and a stubby little crosspiece. Its needlelike point was extremely sharp. Bloggs thought it looked like a highly efficient killing instrument. It had recently been polished.\n Bloggs and Detective Chief-Inspector Kincaid stood looking at it, neither man wanting to touch it.\n \"He was trying to catch a bus to Edinburgh,\" Kincaid said. \"A P.C. spotted him at the ticket office and asked for his identification. He dropped his suitcase and ran. A woman bus conductor hit him over the head with her ticket machine. He took ten minutes to come around.\"\n \"Let\u0027s have a look at him \" Bloggs said.\n They went down the corridor to the cells. \"This one,\" Kincaid said.\n Bloggs looked through the judas. The man sat on a stool in the far corner of the cell with his back against the wall. His legs were crossed, his eves closed, his hands in his pockets. \"He\u0027s been in cells before,\" Bloggs remarked.\n The man was tall, with a long, handsome face and dark hair. It could have been the man in the photograph, but it was hard to be certain.\n \"Want to go in?\" Kincaid asked.\n \"In a minute. What was in his suitcase, apart from the stiletto?\"\n \"The tools of a burglar\u0027s trade, quite a lot of money in small notes, a pistol and some ammunition, black clothes and crepe-soled shoes, and five hundred Lucky Strike cigarettes.\"\n \"No photographs or film negatives?\"\n Kincaid shook his head.\n \"Balls,\" Bloggs said with feeling.\n \"Papers identify him as Peter Fredericks, of Wembley, Middlesex. Says he\u0027s an unemployed toolmaker looking for work.\"\n \"Toolmaker?\" Bloggs said sceptically. \"There hasn\u0027t been an unemployed toolmaker in Britain in the last four years. You\u0027d think a spy would know that. Still...\"\n Kincaid asked, \"Shall I start the questioning, or will you?\"\n \"You.\"\n Kincaid opened the door and Bloggs followed him in. The man in the corner opened his eyes incuriously. He did not alter his position.\n Kincaid sat at a small, plain table. Bloggs leaned against the wall.\n Kincaid said, \"What\u0027s your real name?\"\n \"Peter Fredericks.\"\n \"What are you doing so far from home?\"\n \"Looking for work.\"\n \"Why aren\u0027t you in the army?\"\n \"Weak heart.\"\n \"Where have you been for the last few days?\" \n","sourceLink":"https://allnovel.net/eye-of-the-needle/page-18.html","bookId":2679,"book":{"id":2679,"title":"Eye Of The Needle","description":"Storyline: \n One enemy spy knows the secret to the Allies\u0027 greatest deception, a brilliant aristocrat and ruthless assassin -- code name: \"The Needle\" -- who holds the key to ultimate Nazi victory. \n Only one person stands in his way: a lonely Englishwoman on an isolated island, who is beginning to love the killer who has mysteriously entered her life. \n All will come to a terrifying conclusion in Ken Follett\u0027s unsurpassed and unforgettable masterwork of suspense, intrigue, and the dangerous machinations of the human heart.\n \n","cover":"https://allnovel.net/images/eye-of-the-needle.jpg","author":"Ken Follett","type":"Thriller","source":"allnovel","link":"https://allnovel.net/eye-of-the-needle.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:07:36 AM"}}
