{"id":68055,"no":7,"title":"Page 7","content":"Mother said, \"Shall we turn around? I think we\u0027ve gone far enough for one day.\"\n In the kitchen one evening Lucy said to David, \"I\u0027d like Mother to stay another two weeks, if she will.\" Mother was upstairs putting Jo to bed, telling him a story.\n \"Isn\u0027t a fortnight long enough for you to dissect my personality?\" David said.\n \"Don\u0027t be silly. David.\"\n He wheeled himself over to her chair. \"Are you telling me you don\u0027t talk about me?\"\n \"Of course we talk about you-you\u0027re my husband.\"\n \"What do you say to her?\"\n \"Why are you so worried?\" Lucy said, not without malice.\n \"What are you so ashamed of?\"\n \"Damn you, I\u0027ve nothing to be ashamed of. No one wants his personal life talked about by a pair of gossiping women.\n \"We don\u0027t gossip about you.\"\n \"What do you say?\"\n \"Aren\u0027t you touchy!\"\n \"Answer my question.\"\n \"I say I want to leave you, and she tries to talk me out of it.\"\n He spun round and wheeled away. \"Tell her not to bother for my sake.\"\n She called, \"Do you mean that?\"\n He stopped. \"I don\u0027t need anybody, do you understand? I can manage alone.\"\n \"And what about me?\" she said quietly. \"Perhaps I need somebody.\"\n \"What for?\"\n \"To love me.\"\n Mother came in, and sensed the atmosphere. \"He\u0027s fast asleep,\" she said. \"Dropped off before Cinderella got to the ball. I think I\u0027ll pack a few things, not to leave it all until tomorrow.\" She went out again.\n \"Do you think it will ever change, David?\" Lucy asked.\n \"I don\u0027t know what you mean.\"\n \"Will we ever be... the way we were, before the wedding?\"\n \"My legs won\u0027t grow back, if that\u0027s what you mean.\"\n \"Oh, God, don\u0027t you know that doesn\u0027t bother me? I just want to be loved.\"\n David shrugged. \"That\u0027s your problem.\" He went out before she started to cry.\n Mother did not stay the second fortnight. Lucy walked with her down to the jetty the next day. It was raining hard, and they both wore macintoshes.\n They stood in silence waiting for the boat, watching the rain pit the sea with tiny craters. Mother held Jo in her arms. \"Things will change, in time, you know,\" she said. \"Four years is nothing in a marriage.\"\n Lucy said, \"I don\u0027t know, but there\u0027s not much I can do. There\u0027s Jo, and the war, and David\u0027s condition. How can I leave?\" The boat arrived, and Lucy exchanged her mother for three boxes of groceries and five letters. The water was choppy. Mother sat in the boat\u0027s tiny cabin. They waved her around the headland. Lucy felt very lonely.\n Jo began to cry. \"I don\u0027t want Gran to go away!\"\n \"Nor do I,\" said Lucy.\n Godliman and Bloggs walked side by side along the pavement of a bomb-damaged London shopping street. They were a mismatched pair: the stooped, bird-like professor, with pebble-lensed spectacles and a pipe, not looking where he was going, taking short, scurrying steps; and the flat-footed youngster, blond and purposeful, in his detective\u0027s raincoat and melodramatic hat; a cartoon looking for a caption.\n Godliman was saying, \"I think Die Nadel is well-connected.\"\n \"Why?\"\n \"The only way he could be so insubordinate with impunity. It\u0027s this \u0027Regards to Willi\u0027 line. It must refer to Canaris.\"\n \"You think he was pals with Canaris?\"\n \"He\u0027s pals with somebody-perhaps someone more powerful than Canaris was.\"\n \"I have the feeling this is leading somewhere.\"\n \"People who are well-connected generally make those connexions at school, or university, or staff college. Look at that.\"\n They were outside a shop that had a huge empty space where once there had been a plate-glass window. A rough sign, hand-painted and nailed to the window-frame, said, \u0027Even more open than usual\u0027.\n Bloggs laughed, \"I saw one outside a bombed police station: \u0027Be good, we are still open\u0027\"\n \"It\u0027s become a minor art form.\"\n They walked on. Bloggs said, \"So, what if Die Nadel did go to school with someone high in the Wehrmacht?\"\n \"People always have their pictures taken at school. Middleton, down in the basement at Kensington-that house where MI6 used to be before the war-he\u0027s got a collection of thousands of photographs of German officers: school photos, binges in the Mess, passing-out parades, shaking hands with Adolf, newspaper pictures, everything.\"\n \"I see,\" Bloggs said. \"So if you\u0027re right, and Die Nadel has been through Germany\u0027s equivalent of Eton and Sandhurst, we\u0027ve probably got a picture of him.\"\n \"Almost certainly. Spies are notoriously camera-shy, but they don\u0027t become spies in school. It will be a youthful Die Nadel that we\u0027ll find in Middleton\u0027s files.\"\n They skirted a huge crater outside a barber\u0027s. The shop was intact, but the traditional red-and-white-striped pole lay in shards on the pavement. The sign in the window said, \u0027We\u0027ve had a close shave-come and get one yourself\u0027.\n \"How will we recognise him? No one has ever seen him,\" Bloggs said.\n \"Yes, they have. At Mrs Garden\u0027s boarding house in Highgate they know him quite well.\"\n The Victorian house stood on a hill overlooking London. It was built of red brick, and Bloggs thought it looked angry at the damage Hitler was doing to its city. It was high up, a good place from which to broadcast. Die Nadel would have lived on the top floor. Bloggs wondered what secrets he had transmitted to Hamburg from this place in the dark days of 1940: map references for aircraft factories and steelworks, details of coastal defences, political gossip, gas masks and Anderson shelters and sandbags, British morale, bomb damage reports, \"Well done, boys, you got Christine Bloggs at last-\" Shut up.\n The door was opened by an elderly man in a black jacket and striped trousers.\n \"Good morning. I\u0027m Inspector Bloggs, from Scotland Yard. I\u0027d like a word with the householder, please.\"\n Bloggs saw fear come to the man\u0027s eyes, then a young woman appeared in the doorway behind him and said, \"Come in, please.\"\n The tiled hall smelled of wax polish. Bloggs hung his hat and coat on a stand. The old man disappeared into the depths of the house, and the woman led Bloggs into a lounge. It was expensively furnished in a rich, old-fashioned way. There were bottles of whisky, gin, and sherry on a trolley; all the bottles were unopened. The woman sat on a floral armchair and crossed her legs.\n \"Why is the old man frightened of the police?\" Bloggs said.\n \"My father-in-law is a German Jew. He came here in 1935 to escape Hitler, and in 1940 you put him in a concentration camp. His wife killed herself at the prospect. He has just been released from the Isle of Man. He had a letter from the King, apologising for the inconvenience to which he had been put.\"\n Bloggs said, \"We don\u0027t have concentration camps.\"\n \"We invented them. In South Africa. Didn\u0027t you know? We go on about our history, but we forget bits. We\u0027re so good at blinding ourselves to unpleasant facts.\"\n \"Perhaps it\u0027s just as well.\"\n \"What?\"\n \"In 1939 we blinded ourselves to the unpleasant fact that we alone couldn\u0027t win a war with Germany and look what happened.\"\n \"That\u0027s what my father-in-law says. He\u0027s not as cynical as I. What can we do to assist Scotland Yard?\"\n Bloggs had been enjoying the debate, and now it was with reluctance that he turned his attention to work. \"It\u0027s about a murder that took place here four years ago.\"\n \"So long!\"\n \"Some new evidence may have come to light.\"\n \"I know about it, of course. The previous owner was killed by a tenant. My husband bought the house from her executor-she had no heirs.\"\n \"I want to trace the other people who were tenants at that time.\"\n \"Yes.\" The woman\u0027s hostility had gone now, and her intelligent face showed the effort of recollection. \"When we arrived there were three who had been here before the murder: a retired naval officer, a salesman, and a young boy from Yorkshire. The boy joined the Army; he still writes to us. The salesman was called up and he died at sea. I know because two of his five wives got in touch with us! And the Commander is still here.\"\n \"Still here?\" That was a piece of luck. \"I\u0027d like to see him, please.\"\n \"Surely.\" She stood up. \"He\u0027s aged a lot. I\u0027ll take you to his room.\"\n They went up the carpeted stairs to the first floor. She said, \"While you\u0027re talking to him, I\u0027ll look up the last letter from the boy in the Army.\" She knocked on the door. It was more than Bloggs\u0027 landlady would have done, he thought wryly. A voice called, \"It\u0027s open,\" and Bloggs went in.\n The Commander sat in a chair by the window with a blanket over his knees. He wore a blazer, a collar and a tie, and spectacles. His hair was thin, his moustache grey, his skin loose and wrinkled over a face that might once have been strong. The room was the home of a man living on memories: there were paintings of sailing ships, a sextant and a telescope, and a photograph of himself as a boy aboard HMS Winchester.\n \"Look at this,\" he said without turning round. \"Tell me why that chap isn\u0027t in the Navy.\"\n Bloggs crossed to the window. A horse-drawn baker\u0027s van was at the curb outside the house, the elderly horse dipping into its nosebag while the deliveries were made. That \"chap\" was a woman with short blonde hair, in trousers. She had a magnificent bust. Bloggs laughed. \"It\u0027s a woman in trousers,\" he said.\n \"Bless my soul, so it is!\" The Commander turned around. \"Can\u0027t tell thee days, you know. Women in trousers!\"\n Bloggs introduced himself. \"We\u0027ve reopened the case of a murder committed here in 1940. I believe you lived here at the same time as the main suspect, one Henry Faber.\"\n \"Indeed! What can I do to help?\"\n \"How well do you remember Faber?\"\n \"Perfectly. Tall chap, dark hair, well-spoken, quiet. Rather shabby clothes. If you were the kind who judges by appearances, you might well mistake him. I didn\u0027t dislike him. Wouldn\u0027t have minded getting to know him better, but he didn\u0027t want that. I suppose he was about your age.\"\n Bloggs suppressed a smile-he was used to people assuming he must be older simply because he was a detective.\n The Commander added, \"I\u0027m sure he didn\u0027t do it, you know. I know a bit about character. You can\u0027t command a ship without learning and if that man was a sex maniac, I\u0027m Hermann Goering.\"\n Bloggs suddenly connected the blonde in trousers with the mistake about his age, and the conclusion depressed him. He said, \"You know, you should always ask to see a policeman\u0027s warrant card.\"\n The Commander was slightly taken aback. \"All right, then, let\u0027s have it.\"\n Bloggs opened his wallet and folded it to display the picture of Christine. \"Here.\"\n The Commander studied it for a moment, then said, \"A very good likeness.\" Bloggs sighed. The old man was very nearly blind. He stood up. \"That\u0027s all, for now,\" he said. \"Thank you.\"\n \"Any time. Whatever I can do to help. I\u0027m not much value to England these days. You\u0027ve got to be pretty useless to get invalided out of the Home Guard, you know.\"\n \"Good-bye.\" Bloggs went out.\n The woman was in the hall downstairs. She handed Bloggs a letter. \"The boy\u0027s address is a Forces box number,\" she said. \"Parkin\u0027s his name... no doubt you\u0027ll be able to find out where he is.\"\n \"You knew the Commander would be no use,\" Bloggs said.\n \"I suppose not. But a visitor makes his day.\" She opened the door. On impulse, Bloggs said, \"Will you have dinner with me?\"\n A shadow crossed her face. \"My husband is still on the Isle of Man.\"\n \"I\u0027m sorry... I thought-\"\n \"It\u0027s all right. I\u0027m flattered.\"\n \"I wanted to convince you we\u0027re not the Gestapo.\"\n \"I know you\u0027re not. A woman alone just gets bitter.\"\n Bloggs said, \"I lost my wife in the bombing.\"\n \"Then you know how it makes you hate.\"\n \"Yes,\" said Bloggs. \"It makes you hate.\" He went down the steps. The door closed behind him. It had started to rain...\n It had been raining then too.\n Bloggs was late home. He had been going over some new material with Godliman. Now he was hurrying, so that he would have half an hour with Christine before she went out to drive her ambulance. It was dark, and the raid had already started. The things Christine saw at night were so awful she had stopped talking about them.\n Bloggs was proud of her, proud. The people she worked with said she was better than two men. She hurtled through blacked-out London, driving like a veteran, taking corners on two wheels, whistling and cracking jokes as the city turned to flame around her. Fearless, they called her. Bloggs knew better; she was terrified, but she would not let it show. He knew because he saw her eyes in the morning when he got up and she went to bed; when her guard was down and it was over for a few hours; he knew it was not fearlessness but courage, and he was proud.\n It was raining harder when he got off the bus. He pulled down his hat and put up his collar. In a tobacconist\u0027s he bought cigarettes for Christine. She had started smoking recently, like a lot of women. The shopkeeper would let him have only five, because of the shortage. He put them in a Woolworth\u0027s bakelite cigarette case.\n A policeman stopped him and asked for his identity card; another two minutes wasted. An ambulance passed him, similar to the one Christine drove; a requisitioned fruit truck, painted grey.\n He began to get nervous as he approached home. The explosions were sounding closer, and he could hear the aircraft clearly. The East End was in for another bruising tonight; he would sleep in the Morrison shelter. There was a big one, terribly close, and he quickened his step. He would eat his supper in the shelter, too.\n He turned into his own street, saw the ambulances and the fire engines, and broke into a run.\n The bomb had landed on his side of the street, around the middle. It must be close to his own home. Jesus in heaven, not us, no! There had been a direct hit on the roof, and the house was literally flattened. He raced up to the crowd of people: neighbours and firemen and volunteers. \"Is my wife all right? Is she out? Is she in there?\"\n A fireman looked at him. \"Nobody\u0027s come out of there, mate.\"\n Rescuers were picking over the rubble. Suddenly one of them shouted, \"Over here!\" Then he said, \"Jesus, it\u0027s Fearless Bloggs!\"\n Frederick dashed to where the man stood. Christine was underneath a huge chunk of brickwork. Her face was visible; the eyes were closed. The rescuer called, \"Lifting gear, boys, sharp\u0027s the word.\" Christine moaned and stirred.\n \"She\u0027s alive!\" Bloggs said. He knelt down beside her and got his hand under the edge of the lump of rubble. The rescuer said, \"You won\u0027t shift that, son.\"\n The brickwork lifted.\n \"God, youll kill yourself,\" the rescuer said, and bent down to help.\n When it was two feet off the ground they got their shoulders under it. The weight was off Christine now. A third man joined in, and a fourth. They all straightened up together. Bloggs said, \"I\u0027ll lift her out.\"\n He crawled under the sloping roof of brick and cradled his wife in his arms. \"Fuck me-it\u0027s slipping!\" someone shouted.\n Bloggs scurried out from under with Christine held tightly to his chest. As soon as he was clear the rescuers let go of the rubble and jumped away. It fell back to earth with a sickening thud, and when Bloggs realised that that had landed on Christine, he knew she was going to die.\n He carried her to the ambulance, and it took off immediately. She opened her eyes again once, before she died, and said, \"You\u0027ll have to win the war without me kiddo.\"\n More than a year later, as he walked downhill from Highgate into the bowl of London, with the rain on his face mingling with the tears again, he thought the woman in the spy\u0027s house had said a mighty truth: It makes you hate.\n In war boys become men, and men become soldiers and soldiers get promoted; and this is why Bill Parkin, aged eighteen, late of a boarding house in Highgate, who should have been an apprentice in his father\u0027s tannery at Scarborough, was believed by the Army to be twenty-one, promoted to sergeant, and given the job of leading his advance squad through a hot, dry forest toward a dusty, whitewashed Italian village.\n The Italians had surrendered but the Germans had not, and it was the Germans who were defending Italy against the combined British-American invasion. The Allies were going to Rome, and for Sergeant Parkin\u0027s squad it was a long walk.\n They came out of the forest at the top of a hill, and lay flat on their bellies to look down on the village. Parkin got out his binoculars and said, \"What wouldn\u0027t I fookin\u0027 give for a fookin\u0027 cup of fookin\u0027 tea.\" He had taken to drinking and cigarettes and women, and his language was like that of soldiers everywhere. He no longer went to prayer meetings. Some of these villages were defended and some were not. Parkin recognised that as sound tactics: you didn\u0027t know which were undefended, so you approached them all cautiously, and caution cost time. The downside of the hill held little cover -just a few bushes-and the village began at its foot. There were a few white houses, a river with a wooden bridge, then more houses around a little piazza with a town hall and a clock tower. There was a clear line of sight from the tower to the bridge. If the enemy were here at all, they would be in the town hall. A few figures worked in the surrounding fields; God knew who they were. They might be genuine peasants, or any one of a host of factions: fascists, mafia, corsos, partigianos, communisti... or even Germans. You didn\u0027t know whose side they would be on until the shooting started.\n Parkin said, \"All right, Corporal.\"\n Corporal Watkins disappeared back into the forest and emerged, five minutes later, on the dirt road into the village, wearing a civilian hat and a filthy old blanket over his uniform. He shambled, rather than walked, and over his shoulder was a bundle that could have been anything from a bag of onions to a dead rabbit. He reached the near edge of the village and vanished into the darkness of a low cottage.\n After a moment he came out. Standing close to the wall, where he could not be seen from the village, he looked toward the soldiers on the hilltop and waved: one, two, three.\n The squad scrambled down the hillside into the village. \"All the houses empty Sarge,\" Watkins said. Parkin nodded. It meant nothing.\n They moved through the houses to the edge of the river. Parkin said. \"Your turn, Smiler. Swim the Mississippi here.\"\n Private \u0027Smiler\u0027 Hudson put his equipment in a neat pile, took off his helmet, boots, and tunic, and slid into the narrow stream. He emerged on the far side, climbed the bank, and disappeared among the houses. This time there was a longer wait: more area to check. Finally Hudson walked back across the wooden bridge. \"If they\u0027re \u0027ere, they\u0027re \u0027iding.\" he said.\n He retrieved his gear and the squad crossed the bridge into the village. They kept to the sides of the street as they walked toward the piazza. A bird flew off a roof and startled Parkin. Some of the men kicked open a few doors as they passed. There was nobody.\n They stood at the edge of the piazza. Parkin nodded at the town hall. \"Did you go inside that place, Smiler?\"\n \"Yes, sir.\"\n \"Looks like the village is ours, then.\"\n \"Yes, sir.\"\n Parkin stepped forward to cross the piazza, and then it broke. There was a crash of rifles, and bullets hailed all around them. Someone screamed. Parkin was running, dodging, ducking. Watkins, in front of him, shouted with pain and clutched his leg. Parkin picked him up bodily. A bullet clanged off his tin hat. He raced for the nearest house, charged the door, and fell inside.\n The shooting stopped. Parkin risked a look outside. One man lay wounded in the piazza: Hudson. Hudson moved, and a solitary shot rang out. Then he was still. Parkin said, \"Fookin\u0027 bastards.\"\n Watkins was doing something to his leg, cursing.\n \"Bullet still in there?\" Parkin said.\n Watkins yelled, \"Ouch!\" then grinned and held something up. \"Not any more.\"\n Parkin looked outside again. \"They\u0027re in the clock tower. You wouldn\u0027t think there was room. Can\u0027t be many of them.\"\n \"They can shoot, though.\"\n \"Yes. They\u0027ve got us pinned.\" Parkin frowned. \"Got any fireworks?\"\n \"Aye.\"\n \"Let\u0027s have a look.\" Parkin opened Watkins\u0027 pack and took out the dynamite. \"Here. Fix me a ten-second fuse.\"\n The others were in the house across the street. Parkin called out \"Hey!\" A face appeared at the door. \"Sarge?\"\n \"I\u0027m going to throw a tomato. When I shout, give me covering fire.\" Right now Parkin lit a cigarette. Watkins handed him a bundle of dynamite. Parkin shouted, \"Fire!\" He lit the fuse with the cigarette, stepped into the street, drew back his arm, and threw the bomb at the clock tower. He ducked back into the house, the fire of his own men ringing in his ears. A bullet shaved the woodwork, and he caught a splinter under his chin. He heard the dynamite explode.\n Before he could look, someone across the street shouted, \"Bullseye!\"\n Parkin stepped outside. The ancient clock tower had crumbled. A chime sounded incongruously as dust settled over the ruins.\n Watkins said, \"You ever play cricket? That was a bloody good shot.\"\n Parkin walked to the centre of the piazza. There seemed to be enough human spare parts to make about three Germans. \"The tower was pretty unsteady anyway,\" he said. \"It would probably have fallen down if we\u0027d \u0027ave sneezed at it together.\" He turned away. \"Another day, another dollar.\" It was a phrase he\u0027d heard the Yanks use. \n","sourceLink":"https://allnovel.net/eye-of-the-needle/page-7.html","bookId":2679,"book":{"id":2679,"title":"Eye Of The Needle","description":"Storyline: \n One enemy spy knows the secret to the Allies\u0027 greatest deception, a brilliant aristocrat and ruthless assassin -- code name: \"The Needle\" -- who holds the key to ultimate Nazi victory. \n Only one person stands in his way: a lonely Englishwoman on an isolated island, who is beginning to love the killer who has mysteriously entered her life. \n All will come to a terrifying conclusion in Ken Follett\u0027s unsurpassed and unforgettable masterwork of suspense, intrigue, and the dangerous machinations of the human heart.\n \n","cover":"https://allnovel.net/images/eye-of-the-needle.jpg","author":"Ken Follett","type":"Thriller","source":"allnovel","link":"https://allnovel.net/eye-of-the-needle.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:07:36 AM"}}
