{"id":7566,"no":10,"title":"Chapter 10","content":"10:1 [hgb] 挪 亚 的 儿 子 闪 ， 含 ， 雅 弗 的 后 代 ， 记 在 下 面 。 洪 水 以 后 ， 他 们 都 生 了 儿 子 。 \\n\\n [kjv] Now these are the generations of the sons of Noah, Shem, Ham, and Japheth: and unto them were sons born after the flood. \\n\\n [bbe] Now these are the generations of the sons of Noah, Shem, Ham, and Japheth: these are the sons which they had after the great flow of waters \\n\\n 10:2 [hgb] 雅 弗 的 儿 子 是 歌 篾 ， 玛 各 ， 玛 代 ， 雅 完 ， 土 巴 ， 米 设 ， 提 拉 。 \\n\\n [kjv] The sons of Japheth; Gomer, and Magog, and Madai, and Javan, and Tubal, and Meshech, and Tiras. \\n\\n [bbe] The sons of Japheth: Gomer and Magog and Madai and Javan and Tubal and Meshech and Tiras. \\n\\n 10:3 [hgb] 歌 篾 的 儿 子 是 亚 实 基 拿 ， 利 法 ， 陀 迦 玛 。 \\n\\n [kjv] And the sons of Gomer; Ashkenaz, and Riphath, and Togarmah. \\n\\n [bbe] And the sons of Gomer: Ashkenaz and Riphath and Togarmah. \\n\\n 10:4 [hgb] 雅 完 的 儿 子 是 以 利 沙 ， 他 施 ， 基 提 ， 多 单 。 \\n\\n [kjv] And the sons of Javan; Elishah, and Tarshish, Kittim, and Dodanim. \\n\\n [bbe] And the sons of Javan: Elishah and Tarshish, the Kittim and the Dodanim. \\n\\n 10:5 [hgb] 这 些 人 的 后 裔 ， 将 各 国 的 地 土 ， 海 岛 ， 分 开 居 住 ， 各 随 各 的 方 言 ， 宗 族 立 国 。 \\n\\n [kjv] By these were the isles of the Gentiles divided in their lands; every one after his tongue, after their families, in their nations. \\n\\n [bbe] From these came the nations of the sea-lands, with their different families and languages. \\n\\n 10:6 [hgb] 含 的 儿 子 是 古 实 ， 麦 西 ， 弗 ， 迦 南 。 \\n\\n [kjv] And the sons of Ham; Cush, and Mizraim, and Phut, and Canaan. \\n\\n [bbe] And the sons of Ham: Cush and Mizraim and Put and Canaan. \\n\\n 10:7 [hgb] 古 实 的 儿 子 是 西 巴 ， 哈 腓 拉 ， 撒 弗 他 ， 拉 玛 ， 撒 弗 提 迦 。 拉 玛 的 儿 子 是 示 巴 ， 底 但 。 \\n\\n [kjv] And the sons of Cush; Seba, and Havilah, and Sabtah, and Raamah, and Sabtechah: and the sons of Raamah; Sheba, and Dedan. \\n\\n [bbe] And the sons of Cush: Seba and Havilah and Sabtah and Raamah and Sabteca; and the sons of Raamah: Sheba and Dedan. \\n\\n 10:8 [hgb] 古 实 又 生 宁 录 ， 他 为 世 上 英 雄 之 首 。 \\n\\n [kjv] And Cush begat Nimrod: he began to be a mighty one in the earth. \\n\\n [bbe] And Cush was the father of Nimrod, who was the first of the great men of the earth. \\n\\n 10:9 [hgb] 他 在 耶 和 华 面 前 是 个 英 勇 的 猎 户 ， 所 以 俗 语 说 ， 像 宁 录 在 耶 和 华 面 前 是 个 英 勇 的 猎 户 。 \\n\\n [kjv] He was a mighty hunter before the LORD: wherefore it is said, Even as Nimrod the mighty hunter before the LORD. \\n\\n [bbe] He was a very great bowman, so that there is a saying, Like Nimrod, a very great bowman. \\n\\n 10:10 [hgb] 他 国 的 起 头 是 巴 别 ， 以 力 ， 亚 甲 ， 甲 尼 ， 都 在 示 拿 地 。 \\n\\n [kjv] And the beginning of his kingdom was Babel, and Erech, and Accad, and Calneh, in the land of Shinar. \\n\\n [bbe] And at the first, his kingdom was Babel and Erech and Accad and Calneh, in the land of Shinar. \\n\\n 10:11 [hgb] 他 从 那 地 出 来 往 亚 述 去 ， 建 造 尼 尼 微 ， 利 河 伯 ， 迦 拉 ， \\n\\n [kjv] Out of that land went forth Asshur, and builded Nineveh, and the city Rehoboth, and Calah, \\n\\n [bbe] From that land he went out into Assyria, building Nineveh with its wide streets and Calah, \\n\\n 10:12 [hgb] 和 尼 尼 微 ， 迦 拉 中 间 的 利 鲜 ， 这 就 是 那 大 城 。 \\n\\n [kjv] And Resen between Nineveh and Calah: the same is a great city. \\n\\n [bbe] And Resen between Nineveh and Calah, which is a very great town. \\n\\n 10:13 [hgb] 麦 西 生 路 低 人 ， 亚 拿 米 人 ， 利 哈 比 人 ， 拿 弗 土 希 人 ， \\n\\n [kjv] And Mizraim begat Ludim, and Anamim, and Lehabim, and Naphtuhim, \\n\\n [bbe] And Mizraim was the father of the Ludim and Anamim and Lehabim and Naphtuhim; \\n\\n 10:14 [hgb] 帕 斯 鲁 细 人 ， 迦 斯 路 希 人 ， 迦 斐 托 人 。 从 迦 斐 托 出 来 的 有 非 利 士 人 。 \\n\\n [kjv] And Pathrusim, and Casluhim, (out of whom came Philistim,) and Caphtorim. \\n\\n [bbe] And Pathrusim and Casluhim and Caphtorim, from whom came the Philistines. \\n\\n 10:15 [hgb] 迦 南 生 长 子 西 顿 ， 又 生 赫 \\n\\n [kjv] And Canaan begat Sidon his first born, and Heth, \\n\\n [bbe] And Canaan was the father of Zidon, who was his oldest son, and Heth, \\n\\n 10:16 [hgb] 和 耶 布 斯 人 ， 亚 摩 利 人 ， 革 迦 撒 人 ， \\n\\n [kjv] And the Jebusite, and the Amorite, and the Girgasite, \\n\\n [bbe] And the Jebusite and the Amorite and the Girgashite, \\n\\n 10:17 [hgb] 希 未 人 ， 亚 基 人 ， 西 尼 人 ， \\n\\n [kjv] And the Hivite, and the Arkite, and the Sinite, \\n\\n [bbe] And the Hivite and the Arkite and the Sinite, \\n\\n 10:18 [hgb] 亚 瓦 底 人 ， 洗 玛 利 人 ， 哈 马 人 ， 后 来 迦 南 的 诸 族 分 散 了 。 \\n\\n [kjv] And the Arvadite, and the Zemarite, and the Hamathite: and afterward were the families of the Canaanites spread abroad. \\n\\n [bbe] And the Arvadite and the Zemarite and the Hamathite; after that the families of the Canaanites went far and wide in all directions; \\n\\n 10:19 [hgb] 迦 南 的 境 界 是 从 西 顿 向 基 拉 耳 的 路 上 ， 直 到 迦 萨 ， 又 向 所 多 玛 ， 蛾 摩 拉 ， 押 玛 ， 洗 扁 的 路 上 ， 直 到 拉 沙 。 \\n\\n [kjv] And the border of the Canaanites was from Sidon, as thou comest to Gerar, unto Gaza; as thou goest, unto Sodom, and Gomorrah, and Admah, and Zeboim, even unto Lasha. \\n\\n [bbe] Their country stretching from Zidon to Gaza, in the direction of Gerar; and to Lasha, in the direction of Sodom and Gomorrah and Admah and Zeboiim. \\n\\n 10:20 [hgb] 这 就 是 含 的 后 裔 ， 各 随 他 们 的 宗 族 ， 方 言 ， 所 住 的 地 土 ， 邦 国 。 \\n\\n [kjv] These are the sons of Ham, after their families, after their tongues, in their countries, and in their nations. \\n\\n [bbe] All these, with their different families, languages, lands, and nations, are the offspring of Ham. \\n\\n 10:21 [hgb] 雅 弗 的 哥 哥 闪 ， 是 希 伯 子 孙 之 祖 ， 他 也 生 了 儿 子 。 \\n\\n [kjv] Unto Shem also, the father of all the children of Eber, the brother of Japheth the elder, even to him were children born. \\n\\n [bbe] And Shem, the older brother of Japheth, the father of the children of Eber, had other sons in addition. \\n\\n 10:22 [hgb] 闪 的 儿 子 是 以 拦 ， 亚 述 ， 亚 法 撒 ， 路 德 ， 亚 兰 。 \\n\\n [kjv] The children of Shem; Elam, and Asshur, and Arphaxad, and Lud, and Aram. \\n\\n [bbe] These are the sons of Shem: Elam and Asshur and Arpachshad and Lud and Aram. \\n\\n 10:23 [hgb] 亚 兰 的 儿 子 是 乌 斯 ， 户 勒 ， 基 帖 ， 玛 施 。 \\n\\n [kjv] And the children of Aram; Uz, and Hul, and Gether, and Mash. \\n\\n [bbe] And the sons of Aram: Uz and Hul and Gether and Mash. \\n\\n 10:24 [hgb] 亚 法 撒 生 沙 拉 。 沙 拉 生 希 伯 。 \\n\\n [kjv] And Arphaxad begat Salah; and Salah begat Eber. \\n\\n [bbe] And Arpachshad became the father of Shelah; and Shelah became the father of Eber. \\n\\n 10:25 [hgb] 希 伯 生 了 两 个 儿 子 ， 一 个 名 叫 法 勒 （ 法 勒 就 是 分 的 意 思 ） ， 因 为 那 时 人 就 分 地 居 住 。 法 勒 的 兄 弟 名 叫 约 坍 。 \\n\\n [kjv] And unto Eber were born two sons: the name of one was Peleg; for in his days was the earth divided; and his brother\u0027s name was Joktan. \\n\\n [bbe] And Eber had two sons: the name of the one was Peleg, because in his time the peoples of the earth became separate; and his brother\u0027s name was Joktan. \\n\\n 10:26 [hgb] 约 坍 生 亚 摩 答 ， 沙 列 ， 哈 萨 玛 非 ， 耶 拉 ， \\n\\n [kjv] And Joktan begat Almodad, and Sheleph, and Hazarmaveth, and Jerah, \\n\\n [bbe] And Joktan was the father of Almodad and Sheleph and Hazarmaveth and Jerah \\n\\n 10:27 [hgb] 哈 多 兰 ， 乌 萨 ， 德 拉 ， \\n\\n [kjv] And Hadoram, and Uzal, and Diklah, \\n\\n [bbe] And Hadoram and Uzal and Diklah \\n\\n 10:28 [hgb] 俄 巴 路 ， 亚 比 玛 利 ， 示 巴 ， \\n\\n [kjv] And Obal, and Abimael, and Sheba, \\n\\n [bbe] And Obal and Abimael and Sheba \\n\\n 10:29 [hgb] 阿 斐 ， 哈 腓 拉 ， 约 巴 ， 这 都 是 约 坍 的 儿 子 。 \\n\\n [kjv] And Ophir, and Havilah, and Jobab: all these were the sons of Joktan. \\n\\n [bbe] And Ophir and Havilah and Jobab; all these were the sons of Joktan. \\n\\n 10:30 [hgb] 他 们 所 住 的 地 方 ， 是 从 米 沙 直 到 西 发 东 边 的 山 。 \\n\\n [kjv] And their dwelling was from Mesha, as thou goest unto Sephar a mount of the east. \\n\\n [bbe] And their country was from Mesha, in the direction of Sephar, the mountain of the east. \\n\\n 10:31 [hgb] 这 就 是 闪 的 子 孙 ， 各 随 他 们 的 宗 族 ， 方 言 ， 所 住 的 地 土 ， 邦 国 。 \\n\\n [kjv] These are the sons of Shem, after their families, after their tongues, in their lands, after their nations. \\n\\n [bbe] These, with their families and their languages and their lands and their nations, are the offspring of Shem. \\n\\n 10:32 [hgb] 这 些 都 是 挪 亚 三 个 儿 子 的 宗 族 ， 各 随 他 们 的 支 派 立 国 。 洪 水 以 后 ， 他 们 在 地 上 分 为 邦 国 。 \\n\\n [kjv] These are the families of the sons of Noah, after their generations, in their nations: and by these were the nations divided in the earth after the flood. \\n\\n [bbe] These are the families of the sons of Noah, in the order of their generations and their nations: from these came all the nations of the earth after the great flow of waters. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/zongjiao/6/359.html","bookId":247,"book":{"id":247,"title":"Genesis创世纪(双语小说)","description":"简介： In the beginning God created the heaven and the earth. And the earth was without form, and void; and darkness was upon the face of the deep. And the Spirit of God moved upon ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/zongjiao/6","creation":"Aug 1, 2019 12:18:26 AM","modification":"Aug 1, 2019 12:23:56 AM"}}
