{"id":7589,"no":33,"title":"Chapter 33","content":"33:1 [hgb] 雅 各 举 目 观 看 ， 见 以 扫 来 了 ， 后 头 跟 着 四 百 人 ， 他 就 把 孩 子 们 分 开 交 给 利 亚 ， 拉 结 ， 和 两 个 使 女 ， [kjv] And Jacob lifted up his eyes, and looked, and, behold, Esau came, and with him four hundred men. And he divided the children unto Leah, and unto Rachel, and unto the two handmaids. [bbe] Then Jacob, lifting up his eyes, saw Esau coming with his four hundred men. So he made a division of the children between Leah and Rachel and the two women-servants. 33:2 [hgb] 并 且 叫 两 个 使 女 和 她 们 的 孩 子 在 前 头 ， 利 亚 和 她 的 孩 子 在 后 头 ， 拉 结 和 约 瑟 在 尽 后 头 。 [kjv] And he put the handmaids and their children foremost, and Leah and her children after, and Rachel and Joseph hindermost. [bbe] He put the servants and their children in front, Leah and her children after them, and Rachel and Joseph at the back. 33:3 [hgb] 他 自 己 在 他 们 前 头 过 去 ， 一 连 七 次 俯 伏 在 地 才 就 近 他 哥 哥 。 [kjv] And he passed over before them, and bowed himself to the ground seven times, until he came near to his brother. [bbe] And he himself, going before them, went down on his face to the earth seven times till he came near his brother. 33:4 [hgb] 以 扫 跑 来 迎 接 他 ， 将 他 抱 住 ， 又 搂 着 他 的 颈 项 ， 与 他 亲 嘴 ， 两 个 人 就 哭 了 。 [kjv] And Esau ran to meet him, and embraced him, and fell on his neck, and kissed him: and they wept. [bbe] Then Esau came running up to him, and folding him in his arms, gave him a kiss: and the two of them were overcome with weeping. 33:5 [hgb] 以 扫 举 目 看 见 妇 人 孩 子 ， 就 说 ， 这 些 和 你 同 行 的 是 谁 呢 ？ 雅 各 说 ， 这 些 孩 子 是 神 施 恩 给 你 的 仆 人 的 。 [kjv] And he lifted up his eyes, and saw the women and the children; and said, Who are those with thee? And he said, The children which God hath graciously given thy servant. [bbe] Then Esau, lifting up his eyes, saw the women and the children, and said, Who are these with you? And he said, The children whom God in his mercy has given to your servant. 33:6 [hgb] 于 是 两 个 使 女 和 她 们 的 孩 子 前 来 下 拜 。 [kjv] Then the handmaidens came near, they and their children, and they bowed themselves. [bbe] Then the servants and their children came near, and went down on their faces. 33:7 [hgb] 利 亚 和 她 的 孩 子 也 前 来 下 拜 。 随 后 约 瑟 和 拉 结 也 前 来 下 拜 。 [kjv] And Leah also with her children came near, and bowed themselves: and after came Joseph near and Rachel, and they bowed themselves. [bbe] And Leah came near with her children, and then Joseph and Rachel, and they did the same. 33:8 [hgb] 以 扫 说 ， 我 所 遇 见 的 这 些 群 畜 是 什 么 意 思 呢 ？ 雅 各 说 ， 是 要 在 我 主 面 前 蒙 恩 的 。 [kjv] And he said, What meanest thou by all this drove which I met? And he said, These are to find grace in the sight of my lord. [bbe] And he said, What were all those herds which I saw on the way? And Jacob said, They were an offering so that I might have grace in my lord\u0027s eyes. 33:9 [hgb] 以 扫 说 ， 兄 弟 阿 ， 我 的 已 经 够 了 ， 你 的 仍 归 你 吧 。 [kjv] And Esau said, I have enough, my brother; keep that thou hast unto thyself. [bbe] But Esau said, I have enough; keep what is yours, my brother, for yourself. 33:10 [hgb] 雅 各 说 ， 不 然 ， 我 若 在 你 眼 前 蒙 恩 ， 就 求 你 从 我 手 里 收 下 这 礼 物 。 因 为 我 见 了 你 的 面 ， 如 同 见 了 神 的 面 ， 并 且 你 容 纳 了 我 。 [kjv] And Jacob said, Nay, I pray thee, if now I have found grace in thy sight, then receive my present at my hand: for therefore I have seen thy face, as though I had seen the face of God, and thou wast pleased with me. [bbe] And Jacob said, Not so; but if I have grace in your eyes, take them as a sign of my love, for I have seen your face as one may see the face of God, and you have been pleased with me. 33:11 [hgb] 求 你 收 下 我 带 来 给 你 的 礼 物 。 因 为 神 恩 待 我 ， 使 我 充 足 。 雅 各 再 三 地 求 他 ， 他 才 收 下 了 。 [kjv] Take, I pray thee, my blessing that is brought to thee; because God hath dealt graciously with me, and because I have enough. And he urged him, and he took it. [bbe] Take my offering then, with my blessing; for God has been very good to me and I have enough: so at his strong request, he took it. 33:12 [hgb] 以 扫 说 ， 我 们 可 以 起 身 前 往 ， 我 在 你 前 头 走 。 [kjv] And he said, Let us take our journey, and let us go, and I will go before thee. [bbe] And he said, Let us go on our journey together, and I will go in front. 33:13 [hgb] 雅 各 对 他 说 ， 我 主 知 道 孩 子 们 年 幼 娇 嫩 ， 牛 羊 也 正 在 乳 养 的 时 候 ， 若 是 催 赶 一 天 ， 群 畜 都 必 死 了 。 [kjv] And he said unto him, My lord knoweth that the children are tender, and the flocks and herds with young are with me: and if men should overdrive them one day, all the flock will die. [bbe] But Jacob said, My lord may see that the children are only small, and there are young ones in my flocks and herds: one day\u0027s over-driving will be the destruction of all the flock. 33:14 [hgb] 求 我 主 在 仆 人 前 头 走 ， 我 要 量 着 在 我 面 前 群 畜 和 孩 子 的 力 量 慢 慢 地 前 行 ， 直 走 到 西 珥 我 主 那 里 。 [kjv] Let my lord, I pray thee, pass over before his servant: and I will lead on softly, according as the cattle that goeth before me and the children be able to endure, until I come unto my lord unto Seir. [bbe] Do you, my lord, go on before your servant; I will come on slowly, at the rate at which the cattle and the children are able to go, till I come to my lord at Seir. 33:15 [hgb] 以 扫 说 ， 容 我 把 跟 随 我 的 人 留 几 个 在 你 这 里 。 雅 各 说 ， 何 必 呢 ？ 只 要 在 我 主 眼 前 蒙 恩 就 是 了 。 [kjv] And Esau said, Let me now leave with thee some of the folk that are with me. And he said, What needeth it? let me find grace in the sight of my lord. [bbe] And Esau said, Then keep some of my men with you. And he said, What need is there for that, if my lord is pleased with me? 33:16 [hgb] 于 是 ， 以 扫 当 日 起 行 ， 回 往 西 珥 去 了 。 [kjv] So Esau returned that day on his way unto Seir. [bbe] So Esau, turning back that day, went on his way to Seir. 33:17 [hgb] 雅 各 就 往 疏 割 去 ， 在 那 里 为 自 己 盖 造 房 屋 ， 又 为 牲 畜 搭 棚 。 因 此 那 地 方 名 叫 疏 割 （ 就 是 棚 的 意 思 ） 。 [kjv] And Jacob journeyed to Succoth, and built him an house, and made booths for his cattle: therefore the name of the place is called Succoth. [bbe] And Jacob went on to Succoth, where he made a house for himself and put up tents for his cattle: for this reason the place was named Succoth. 33:18 [hgb] 雅 各 从 巴 旦 亚 兰 回 来 的 时 候 ， 平 平 安 安 地 到 了 迦 南 地 的 示 剑 城 ， 在 城 东 支 搭 帐 棚 ， [kjv] And Jacob came to Shalem, a city of Shechem, which is in the land of Canaan, when he came from Padanaram; and pitched his tent before the city. [bbe] So Jacob came safely from Paddan-aram to the town of Shechem in the land of Canaan, and put up his tents near the town. 33:19 [hgb] 就 用 一 百 块 银 子 向 示 剑 的 父 亲 ， 哈 抹 的 子 孙 买 了 支 帐 棚 的 那 块 地 ， [kjv] And he bought a parcel of a field, where he had spread his tent, at the hand of the children of Hamor, Shechem\u0027s father, for an hundred pieces of money. [bbe] And for a hundred bits of money he got from the children of Hamor, the builder of Shechem, the field in which he had put up his tents. 33:20 [hgb] 在 那 里 筑 了 一 座 坛 ， 起 名 叫 伊 利 伊 罗 伊 以 色 列 （ 就 是 神 ， 以 色 列 神 的 意 思 ） 。 [kjv] And he erected there an altar, and called it EleloheIsrael. [bbe] And there he put up an altar, naming it El, the God of Israel.","sourceLink":"http://novel.tingroom.com/zongjiao/6/382.html","bookId":247,"book":{"id":247,"title":"Genesis创世纪(双语小说)","description":"简介： In the beginning God created the heaven and the earth. And the earth was without form, and void; and darkness was upon the face of the deep. And the Spirit of God moved upon ...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/zongjiao/6","creation":"Aug 1, 2019 12:18:26 AM","modification":"Aug 1, 2019 12:23:56 AM"}}
