{"id":36862,"no":36,"title":"CHAPTER XXXV—A CRY","content":"The third week had nearly elapsed, and as yet no one was allowed to see the patient. For a time Stephen was inclined to be chagrined. It is not pleasant to have even the most generous and benevolent intentions thwarted; and she had set her mind on making much of this man whom fate and his own bravery had thrown athwart her life. But in these days Stephen was in some ways a changed woman. She had so much that she wished to forget and that she would have given worlds to recall, that she could not bear even to think of any militant or even questioning attitude. She even began to take herself to task more seriously than she had ever done with regard to social and conventional duties. When she found her house full of so many and so varied guests, it was borne in upon her that such a position as her own, with such consequent duties, called for the presence of some elder person of her own sex and of her own class. No better proof of Stephen’s intellectual process and its result could be adduced than her first act of recognition: she summoned an elderly lady to live with her and matronise her house. This lady, the widow of a distant relation, complied with all the charted requirements of respectability, and had what to Stephen’s eyes was a positive gift: that of minding her own business and not interfering in any matter whatever. Lady de Lannoy, she felt, was her own master and quite able to take care of herself. Her own presence was all that convention required. So she limited herself to this duty, with admirable result to all, herself included. After a few days Stephen would almost forget that she was present. Mr. Hilton kept bravely to his undertaking. He never gave even a hint of his hopes of the restoration of sight; and he was so assiduous in his attention that there arose no opportunity of accidental discovery of the secret. He knew that when the time did come he would find himself in a very unpleasant situation. Want of confidence, and even of intentional deceit, might be attributed to him; and he would not be able to deny nor explain. He was, however; determined to stick to his word. If he could but save his patient’s sight he would be satisfied. But to Stephen all the mystery seemed to grow out of its first shadowy importance into something real. There was coming to her a vague idea that she would do well not to manifest any concern, any anxiety, any curiosity. Instinct was at work; she was content to trust it, and wait. One forenoon she received by messenger a letter which interested her much. So much that at first she was unwilling to show it to anyone, and took it to her own boudoir to read over again in privacy. She had a sort of feeling of expectancy with regard to it; such as sensitive natures feel before a thunderstorm. The letter was natural enough in itself. It was dated that morning from Varilands, a neighbouring estate which marched with Lannoy to the south. ‘My Dear Madam,—Will you pardon me a great liberty, and allow my little girl and me to come to see you to-day? I shall explain when we meet. When I say that we are Americans and have come seven thousand miles for the purpose, you will, I am sure, understand that it is no common interest which has brought us, and it will be the excuse for our eagerness. I should write you more fully, but as the matter is a confidential one I thought it would be better to speak. We shall be doubly grateful if you will have the kindness to see us alone. I write as a mother in making this appeal to your kindness; for my child—she is only a little over eight years old—has the matter so deeply in her heart that any disappointment or undue delay would I fear affect her health. We presume to take your kindness for granted and will call a little before twelve o’clock. ‘I may perhaps say (in case you should feel any hesitation as to my bona fides) that my husband purchased some years ago this estate. We were to have come here to live in the early summer, but were kept in the West by some important business of his. ‘Believe me, yours sincerely, ‘Alice Stonehouse.’ Stephen had, of course, no hesitation as to receiving the lady. Even had there been objection, the curiosity she had in common with her kind would have swept difficulties aside. She gave orders that when Mrs. Stonehouse arrived with her daughter they were to be shown at once into the Mandarin drawing-room. That they would probably stay for lunch. She would see them alone. A little before twelve o’clock Mrs. Stonehouse and Pearl arrived, and were shown into the room where Lady de Lannoy awaited them. The high sun, streaming in from the side, shone on her beautiful hair, making it look like living gold. When the Americans came in they were for an instant entranced by her beauty. One glance at Mrs. Stonehouse’s sweet sympathetic face was enough to establish her in Stephen’s good graces forever. As for Pearl, she was like one who has unexpectedly seen a fairy or a goddess. She had been keeping guardedly behind her mother, but on the instant she came out fearlessly into the open. Stephen advanced quickly and shook hands with Mrs. Stonehouse, saying heartily: ‘I am so glad you have come. I am honoured in being trusted.’ ‘Thank you so much, Lady de Lannoy. I felt that you would not mind, especially when you know why we came. Indeed I had no choice. Pearl insisted on it; and when Pearl is urgent—we who love her have all to give way. This is Pearl!’ In an instant Stephen was on her knees by the beautiful child. The red rosebud of a mouth was raised to her kiss, and the little arms went lovingly round her neck and clung to her. As the mother looked on delighted she thought she had never seen a more beautiful sight. The two faces so different, and yet with so much in common. The red hair and the flaxen, both tints of gold. The fine colour of each heightened to a bright flush in their eagerness. Stephen was so little used to children, and yet loved them so, that all the womanhood in her, which is possible motherhood, went out in an instant to the lovely eager child. She felt the keenest pleasure when the little thing, having rubbed her silk-gloved palms over her face, and then holding her away so that she could see her many beauties, whispered in her ear: ‘How pretty you are!’ ‘You darling!’ whispered Stephen in reply. ‘We must love each other very much, you and I!’ When the two ladies had sat down, Stephen holding Pearl in her lap, Mrs. Stonehouse said: ‘I suppose you have wondered, Lady de Lannoy, what has brought us here?’ ‘Indeed I was very much interested.’ ‘Then I had better tell you all from the beginning so that you may understand.’ She proceeded to give the details of the meeting with Mr. Robinson on the Scoriac. Of how Pearl took to him and insisted on making him her special friend; of the terrible incident of her being swept overboard, and of the gallant rescue. Mrs. Stonehouse was much moved as she spoke. All that fearful time, of which the minutes had seemed years of agony, came back to her so vividly at times that she could hardly speak. Pearl listened too; all eagerness, but without fear. Stephen was greatly moved and held Pearl close to her all the time, as though protecting her. When the mother spoke of her feeling when she saw the brave man struggling up and down the giant waves, and now and again losing sight of him in the trough of the sea, she put out one hand and held the mother’s with a grasp which vibrated in sympathy, whilst the great tears welled over in her eyes and ran down her cheeks. Pearl, watching her keenly, said nothing, but taking her tiny cambric handkerchief from her pocket silently wiped the tears away, and clung all the tighter. It was her turn to protect now! Pearl’s own time for tears came when her mother began to tell this new and sympathetic friend of how she became so much attached to her rescuer that when she knew he would not be coming to the West with them, but going off to the wildest region of the far North, her health became impaired; and that it was only when Mr. Robinson promised to come back to see her within three years that she was at all comforted. And how, ever since, she had held the man in her heart and thought of him every day; sleeping as well as waking, for he was a factor in her dreams! Stephen was more than ever moved, for the child’s constancy touched her as well as her grief. She strained the little thing in her strong young arms, as though the fervency of her grasp would bring belief and comfort; as it did. She in her turn dried the others’ eyes. Then Mrs. Stonehouse went on with her story: ‘We were at Banff, high up in the Rockies, when we read of the burning and wrecking of the Dominion. It is, as you know, a Montreal boat of the Allan Line; so that naturally there was a full telegraphic report in all the Canadian papers. When we read of the brave man who swam ashore with the line and who was unable to reach the port but swam out across the bay, Pearl took it for granted that it must have been “The Man,” as she always called Mr. Robinson. When by the next paper we learned that the man’s name was Robinson nothing would convince her that it was not her Mr. Robinson. My husband, I may tell you, had firmly come to the same conclusion. He had ever since the rescue of our child always looked for any news from Alaska, whither he knew Mr. Robinson had gone. He learned that up away in the very far North a new goldfield had been discovered by a man of the same name; and that a new town, Robinson City, began to grow up in the wilderness, where the condition of life from the cold was a new experience to even the most hardy gold miners. Then we began to think that the young hero who had so gallantly saved our darling was meeting some of his reward . . . !’ She paused, her voice breaking. Stephen was in a glow of holy feeling. Gladness, joy, gratitude, enthusiasm; she knew not which. It all seemed like a noble dream which was coming true. Mrs. Stonehouse went on:- ‘From Californian papers of last month we learned that Robinson, of Robinson City, had sailed for San Francisco, but had disappeared when the ship touched at Portland; and then the whole chain of his identity seemed complete. Nothing would satisfy Pearl but that we should come at once to England and see “The Man,” who was wounded and blind, and do what we could for him. Her father could not then come himself; he had important work on hand which he could not leave without some preparation. But he is following us and may be here at any time. ‘And now, we want you to help us, Lady de Lannoy. We are not sure yet of the identity of Mr. Robinson, but we shall know the instant we see him, or hear his voice. We have learned that he is still here. Won’t you let us? Do let us see him as soon as ever you can!’ There was a pleading tone in her voice which alone would have moved Stephen, even had she not been wrought up already by the glowing fervour of her new friend. But she paused. She did not know what to say; how to tell them that as yet she herself knew nothing. She, too, in the depths of her own heart knew—knew—that it was the same Robinson. And she also knew that both identities were one with another. The beating of her heart and the wild surging of her blood told her all. She was afraid to speak lest her voice should betray her. She could not even think. She would have to be alone for that. Mrs. Stonehouse, with the wisdom and power of age, waited, suspending judgment. But Pearl was in a fever of anxiety; she could imagine nothing which could keep her away from The Man. But she saw that there was some difficulty, some cause of delay. So she too added her pleading. Putting her mouth close to Lady de Lannoy’s ear she whispered very faintly, very caressingly: ‘What is your name? Your own name? Your very own name?’ ‘Stephen, my darling!’ ‘Oh, won’t you let us see The Man, Stephen; dear Stephen! I love him so; and I do so want to see him. It is ages till I see him! Won’t you let me? I shall be so good—Stephen!’ And she strained her closer in her little arms and kissed her all over face, cheeks and forehead and eyes and mouth wooingly. Stephen returned the embrace and the kisses, but remained silent a little longer. Then she found voice: ‘I hardly know what to say. Believe me, I should—I shall, do all I can; but the fact is that I am not in authority. The Doctor has taken him in charge and will not let anyone go near him: He will not even have a nurse, but watches and attends to him himself. He says it might be fatal if anything should occur to agitate him. Why, even I am not allowed to see him!’ ‘Haven’t you seen him yet at all; ever, ever, Stephen?’ asked Pearl, all her timidity gone. Stephen smiled—a wan smile it was, as she answered: ‘I saw him in the water, but it was too far away to distinguish. And it was only by firelight.’ ‘Oh yes, I know,’ said Pearl; ‘Mother and Daddy told me how you had burned the house down to give him light. Didn’t you want to see him more after that? I should!’ Stephen drew the impulsive child closer as she answered: ‘Indeed I did, dear. But I had to think of what was good for him. I went to his room the next day when he was awake, and the Doctor let me come in for only a moment.’ ‘Well! What did you see. Didn’t you know him?’ She forgot that the other did not know him from her point of view. But the question went through Stephen’s heart like a sword. What would she not have given to have known him! What would she not give to know him now! . . . She spoke mechanically: ‘The room was quite dark. It is necessary, the Doctor says, that he be kept in the dark. I saw only a big beard, partly burned away by the fire; and a great bandage which covered his eyes!’ Pearl’s hold relaxed, she slipped like an eel to the floor and ran over to her mother. Her new friend was all very well, but no one would do as well as mother when she was in trouble. ‘Oh mother, mother! My Robinson had no beard!’ Her mother stroked her face comfortingly as she answered: ‘But, my dear, it is more than two years since you saw him. Two years and three months, for it was in June that we crossed.’ How the date thrilled Stephen. It verified her assumption. Mrs. Stonehouse did not notice, but went on: ‘His beard would have grown. Men wear beards up in the cold place where he was.’ Pearl kissed her; there was no need for words. Throwing herself again on Stephen’s knees she went on with her questioning: ‘But didn’t you hear him?’ ‘I heard very little, darling. He was very weak. It was only the morning after the wreck, and he spoke in a whisper!’ Then with an instinct of self-preservation she added: ‘But how could I learn anything by hearing him when he was a stranger to me? I had never even heard of Mr. Robinson!’ As she was speaking she found her own ideas, the proofs of her own conviction growing. This was surely another link in the chain of proving that all three men were but one. But in such case Harold must know; must have tried to hide his identity! She feared, with keen eyes upon her, to pursue the thought. But her blood began to grow cold and her brain to swim. With an effort she went on: ‘Even since then I have not been allowed to go near him. Of course I must obey orders. I am waiting as patiently as I can. But we must ask the Doctor if he thinks his patient will see you—will let you see him—though he will not let me.’ This she added with a touch of what she felt: regret rather than bitter ness. There was no room for bitterness in her full heart where Harold was concerned. ‘Will you ask the Doctor now?’ Pearl did not let grass grow under her feet. For answer Stephen rang the bell, and when a servant appeared asked: ‘Is Mr. Hilton in the house?’ ‘I think not, your Ladyship. He said he was going over to Port Lannoch. Shall I inquire if he left word at what time he would be back?’ ‘If you please!’ The man returned in a few minutes with the butler, who said: ‘Mr. Hilton said, your Ladyship, that he expected to be back by one o’clock at latest.’ ‘Please ask him on his arrival if he will kindly come here at once. Do not let us be disturbed until then.’ The butler bowed and withdrew. ‘Now,’ said Stephen, ‘as we have to wait till our tyrant comes, won’t you tell me all that went on after The Man had left you?’ Pearl brightened up at once. Stephen would have given anything to get away even for a while. Beliefs and hopes and fears were surging up, till she felt choking. But the habit of her life, especially her life of the last two years, gave her self-control. And so she waited, trying with all her might to follow the child’s prattle. After a long wait Pearl exclaimed: ‘Oh! I do wish that Doctor would come. I want to see The Man!’ She was so restless, marching about the room, that Stephen said: ‘Would you like to go out on the balcony, darling; of course if Mother will let you? It is quite safe, I assure you, Mrs. Stonehouse. It is wide and open and is just above the flower-borders, with a stone tail. You can see the road from it by which Mr. Hilton comes from Port Lannoch. He will be riding.’ Pearl yielded at once to the diversion. It would at any rate be something to do, to watch. Stephen opened the French window and the child ran out on the balcony. When Stephen came back to her seat Mrs. Stonehouse said quietly: ‘I am glad she is away for a few minutes. She has been over wrought, and I am always afraid for her. She is so sensitive. And after all she is only a baby!’ ‘She is a darling!’ said Stephen impulsively; and she meant it. Mrs. Stonehouse smiled gratefully as she went on: ‘I suppose you noticed what a hold on her imagination that episode of Mollie Watford at the bank had. Mr. Stonehouse is, as perhaps you know, a very rich man. He has made his fortune himself, and most honourably; and we are all very proud of him, and of it. So Pearl does not think of the money for itself. But the feeling was everything; she really loves Mr. Robinson; as indeed she ought! He has done so much for us that it would be a pride and a privilege for us to show our gratitude. My husband, between ourselves, wanted to make him his partner. He tells me that, quite independent of our feeling towards him, he is just the man he wanted. And if indeed it was he who discovered the Alaskan goldfield and organised and ruled Robinson City, it is a proof that Mr. Stonehouse’s judgment was sound. Now he is injured, and blind; and our little Pearl loves him. If indeed he be the man we believe he is, then we may be able to do something which all his millions cannot buy. He will come to us, and be as a son to us, and a brother to Pearl. We will be his eyes; and nothing but love and patience will guide his footsteps!’ She paused, her mouth quivering; then she went on: ‘If it is not our Mr. Robinson, then it will be our pleasure to do all that is necessary for his comfort. If he is a poor man he will never want . . . It will be a privilege to save so gallant a man from hardship . . . ’ Here she came to a stop. Stephen too was glad of the pause, for the emotion which the words and their remembrances evoked was choking her. Had not Harold been as her own father’s son. As her own brother! . . . She turned away, fearing lest her face should betray her. All at once Mrs. Stonehouse started to her feet, her face suddenly white with fear; for a cry had come to their ears. A cry which even Stephen knew as Pearl’s. The mother ran to the window. The balcony was empty. She came back into the room, and, ran to the door. But on the instant a voice that both women knew was heard from without: ‘Help there! Help, I say! The child has fainted. Is there no one there? And I am blind!’ \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3234/88516.html","bookId":683,"book":{"id":683,"title":"The Man","description":"简介： Stephen Norman of Normanstand had remained a bachelor until close on middle age, when the fact took hold of him that there was no immediate heir to his great estate. Whereupon, with his wonted decision, he set about looking for a wife....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3234","creation":"Aug 1, 2019 12:19:09 AM","modification":"Aug 1, 2019 12:19:09 AM"}}
