{"id":17842,"no":11,"title":"CHAPTER XI ON THE TRAIL","content":"Rather stiff and cramped from their long ride in the train, Noddy and his two companions were not as alert as they might have been under other circumstances. They moved slowly along the station platform, trying, as it were, to locate themselves, and in doing this they did not catch sight of the boys they had set out to follow. The Motor Boys, however, had seen their enemies and the need of instant action occurred to them. Bob was the first to act, or, rather, to suggest action, and he cried: “Don’t let them see us! They’re trying to find us, but the longer we can keep out of their sight the better!” “Good idea,” commented Tinny, who had been briefly told about the actions of the bully. “Come around this side of the station. My car is there and we can hop in and be down the trail before those fellows get the cinders out of their eyes.” Arrangements had previously been made to send the baggage of the boys, the professor, and[93] Bill Cromley on to Tinny’s mine-house by a motor truck, so all that the travelers had to carry were their valises. Of course, Uriah Snodgrass had his pockets filled with bugs and insects, as well as with glass-topped boxes in which he hoped to catch other specimens. But as he was always thus laden it was a matter of no comment, though, to Tinny, of some curiosity. So it but remained for the party to act on Bob’s sensible suggestion, slip around the side of the station and get the building between them and Noddy’s “gang,” as the Motor Boys referred to Noddy’s party. This was done, and before the bully and his companions had more than turned themselves around, Jerry and his friends were in Tinny’s auto, speeding down the trail that led to Thunder Mountain. This was the name of a small mining settlement, as well as the general name of this whole section. “That was a close call!” exclaimed Ned, as they were hurrying away. “I’ll advertise the fact that it was!” said Jerry. “Do you think Noddy Nixon saw you?” asked Bill Cromley. “Don’t believe so,” replied Bob. “We were too quick for him.” “I thought you said you had shaken him,” remarked[94] Tinny, as he guided his car along the mountain trail. “We thought we had,” Ned remarked. “We hoped so, anyhow.” “And they were watching us all the while!” ejaculated Jerry regretfully. “They just sneaked along and took the second section.” “Well, he’d better not try any of his tricks out here,” threatened Tinny Mallison. “We don’t stand for any nonsense in Thunder Mountain. Of course, every man has his rights, and Noddy Nixon will be entitled to his. But if he starts anything that he can’t finish it will be all up with him.” “Noddy is just the kind to do that,” murmured Jerry. “Well, anyhow, I’m glad we’re here, Tinny. And now it’s up to you to show us a good gold mine.” “I’ll do that, boys!” exclaimed the Westerner earnestly. “I’m not saying my holdings are the richest in the world, but they’ll pay well, I’m sure, as soon as we can begin developing them. I need capital and help, and that’s why I called on you fellows. How do you like it out here as far as you’ve seen?” The Motor Boys looked about on the wild but wondrously beautiful scenery surrounding them. In the distance were tall mountain peaks, and nearer them towered peaks equally impressive.[95] It was a rugged country, sparsely settled, but with great possibilities. Here and there gushing mountain torrents chattered their way down the gashed cliffs. “It’s great!” declared Ned, taking a long breath. “Beats France all to smithers!” commented Bob. “I never could get used to the food we had over there, anyhow, though of course it was a lot better chow than the other soldiers got.” Then he wondered why his chums laughed. “I think we’re going to like it here,” Jerry said. “There’s a pretty good mine,” and Tinny pointed out some men at work on a shaft inside of a mountain, boring a hole into the rock and dirt to get at the hidden gold. “Is yours like that?” asked Ned. “Rather better, I think,” Tinny said. “I’ve got a slab shack instead of a tent, and try to live in a fashion a bit civilized. Those fellows are just starting in,” and he indicated the tent in which the miners were living while trying for a “strike.” “This air sure does smell good to me!” exclaimed Cromley, taking a long breath as they rolled past another mining camp. “I’ve been wanting to get back here for a long time.” “How far is this from Blue Rock?” asked Jerry of the old miner. [96] “Oh, not so far,” was the vague answer. “It won’t take very long to get there in a car like this—that is, provided Mr. Mallison wants to go,” and Bill seemed somewhat depressed by the little faith the mine owner had shown in his story. “Oh, I’ll go, if you fellows want to,” said Tinny, with an accommodating air. “And, mind you, I don’t say that that stage didn’t go over the cliff, horses and all. In fact, I know it did. But as far as finding the chest of gold goes—nothing to it, boys, nothing to it! Why, there are thousands of holes and pockets on the mountainside it might have disappeared into.” “We’ll have a try, anyhow,” decided Ned. “That is, if we don’t strike it rich in your mine, Tinny.” “Well, we may strike it rich, and then, again, we may have only moderate success,” was the answer. “I know there’s gold to be had in my holdings. I’ve had it tested and it assays well. Of course, it may peter out after we’ve gone in a way, but the surface indications and the trend of the ledge seem to indicate that it will get richer and thicker the farther we go. If I hadn’t believed that, I wouldn’t have sent for you fellows. But, with all that, you may get a chance to have a stab at Blue Rock.” “I’d like to go back to look at the place,” said Bill Cromley. “Some partners of mine and me[97] tried to locate the chest once, but we didn’t have any luck. I know where it ought to be found, but things don’t always turn out the way they ought to.” “Indeed they don’t,” said Tinny, with a laugh. He pointed out the sights along the way, the boys being much interested in what they saw. They passed through small towns and again through lonely stretches where not so much as a miner’s tent was observed. “Nice car you have,” said Jerry, as he noted the smoothness with which the auto ran along. “Not bad,” admitted Tinny. “It’s just what I need out here. What did you do with yours, Jerry?” “Sold it in Chicago.” “He’s going to buy a twelve-cylinder if this mine turns out anyway at all well,” joked Ned. “What do you think of that Noddy Nixon crowd, anyhow?” asked Tinny, after a while. “I mean do you think they’re likely to do any mischief?” “You never can tell what Noddy will do,” was Jerry’s reply. “And now that he has Dolt Haven with him, it’s even more of a guess. If it was just Jack Pender I wouldn’t take much stock in it, as Jack is a weakling and a coward. But Haven, so I imagine, while he doesn’t know much, is just ignorant enough to be dangerous.” [98] “We’ll have to keep our eyes on them; that’s all,” remarked Tinny. “But they don’t know where we’ve gone,” observed Bob. “They can easily find out if they know you fellows have come out here to my claim,” said Mallison. “Everybody knows where my shack is.” “Oh, Noddy can trace us, of course,” admitted Jerry. “Some one at Livingston is sure to have seen us get into your car, Tinny, and they’ll tell if asked. The only thing is that we have Noddy guessing for a while, anyhow.” “The more trouble we can give him, the better,” declared Ned. Professor Snodgrass, who had been breathing in deep of the wonderful and vitalizing air and looking about on the wildly beautiful scene, suddenly made a dive for the side of the car. “There he goes! There he goes!” he cried, pointing. “Who, Noddy Nixon?” exclaimed Tinny, as he jammed on the brakes. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3069/84833.html","bookId":985,"book":{"id":985,"title":"The Motor Boys on Thunder Mountain","description":"简介： What do you think of it, fellows? asked Jerry Hopkins. The tall lad ruffled in his hand some sheets of paper covered with typewriting. He looked closely at his two chums....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3069","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
