{"id":17857,"no":26,"title":"CHAPTER XXVI A BLUE ROCK SLIDE","content":"Amid the silence that followed Jerry’s ringing cry—a silence that came after that great crash—there was no answer from Ned. He seemed absolutely to have vanished from the scene. For a moment a sense of impending, if not actual, disaster held them all motionless. Then Tinny cried: “Come on! We’ve got to get Ned!” But Jerry, swinging his horse across the trail, barred for an instant the progress of Mallison. “Wait!” shouted Jerry above the howling of the wind and the pattering of the rain. “Don’t ride your horse there! The trail may have gone down in a landslide!” “That’s right!” Tinny answered. “Poor Ned!” All their hearts were heavy with fear. Bob and the mine foreman pulled back their horses when they saw Tinny and Jerry dismounting. “We’d better go up there—the edge of the place where Ned went over—on foot,” said Jerry. [214] With the downpour of rain, the fierceness of the lightning and the terrific force of the thunder seemed to be lessened. It was as though the flashes and explosions had torn a hole in the sky to let the flood down, and, having accomplished this, the electricity was held in abeyance for a time. But in an instant all of them were drenched, so torrential was the fall of rain. “Hold the horses, Bob, while we go forward and look,” suggested Tinny, handing the reins of his animal to the stout lad, while Jerry did the same with Cromley. Cautiously the two made their way down the rain-drenched trail to the spot where Ned had last been seen. But in the fast-gathering blackness they saw no cavern, no hole where the road had dropped away or where it had been covered in a landslide. And the theory of a landslide lost its plausibility when they recalled that they had heard no sound of shifting rocks and trees. Before them, winding its way down Thunder Mountain, was the trail, in as good shape as that part which lay behind them, and over which they had traveled since finding the old miner. “What in the world happened?” murmured Jerry, in somewhat of a daze. “Where did Ned disappear to?” Tinny was about to answer that he did not know, or, at best, knew only as much as Jerry[215] could gather from what they saw, when above the roar of the storm a voice suddenly hailed them. “Hey! What’s the matter with you fellows? Why don’t you come in out of the wet?” some one wanted to know. “It’s Ned!” joyfully cried Jerry. Then Tinny saw Ned standing in what seemed to be the entrance of a cave in the side of the mountain. Back of the lad could be observed his horse. Their position, snug and sheltered, was in grim contrast to that of the others. “Are you all right, Ned?” cried Jerry, his voice trembling from the reaction on finding his chum safe. “Right? Of course I am! Why didn’t you come in here? I thought you were right behind me. It’s a dandy place, dry as a bone, and you can’t get struck by lightning in here.” “He’s right,” said Tinny. “And we’ll have more and worse lightning soon, if this storm is like all the others on Thunder Mountain. Come on back, Jerry. We’ll all go into that cave.” Returning to Bob and Cromley, who had remained with the horses, Jerry and Tinny soon explained that Ned was safe in a sheltering cave. “Gosh, that’s good!” murmured Bob. “We can build a fire in there and dry out—and eat!” he added, as a sort of afterthought. “In a big cave, is he?” asked Cromley, as he[216] climbed rather stiffly into his saddle, for his recent fall had jarred him. “I didn’t know there was a cave on this side of Thunder Mountain.” “Neither did I,” replied Tinny. “I shouldn’t be surprised to find that this cave had been uncovered by a landslide. I mean to say that the cave was always there, of course, under the mountain, but the entrance to it was blocked. A landslide would open the mouth.” “We’ll soon find out,” said Jerry. Through the rain, which seemed to come down harder than ever, they rode over the edge of a little hill on the trail until they were in front of the cave in which Ned had taken shelter. “Come on in—it’s fine!” cried Ned. Tinny looked about before he would permit this, however. He wanted to see if his theory would prove, and he wanted to make sure that it would be safe. “That’s what happened here,” he said. “There’s been a landslide within the last day or two. It carried away the dirt, rock and trees and bushes that were in front of the entrance to this cave. I don’t believe any one knew of its existence before.” “I saw it, all of a sudden, as I was riding along,” explained Ned, as his companions rode in—for the entrance was high enough to permit this, after Mallison had signified that it seemed safe enough. “I thought this was one of the[217] shelter places you spoke of, Tinny, and I supposed you were right behind me.” “No,” said the mine owner, “I never knew about this. It’s a new one to me. Where I thought we could get shelter is at the old cabin less than a mile from here. But this will do very well—better in fact. There’s no danger from lightning in here.” As he spoke there was another flash, like the terrifying ones that had snapped about before the rain came, and a great crash of thunder reverberated down the mountain slopes. “It’s doing its best to get at us, though,” remarked Jerry, as he slid out of the rain-soaked saddle, an example followed by the others. “It can’t get in here,” chuckled Ned. “Say, isn’t this a great place, though? It’s a made-to-order barn, house and everything. Get the saddles off and we can build a fire. There’s a lot of dry wood.” He indicated some off to one side. Just enough of the fast-disappearing daylight, gloomy as it was, remained to show the heap of wood. It seemed to have been deposited there by some subsiding flood, and when the travelers took out their flashlights and pressed the switches, in the gleams it could be seen that once the cave had held water. The marks of the different depths, or levels, were visible on the rocky walls. “Now we can have a meal,” remarked Bob, as[218] he began to loosen the pack he transported on his horse. Each one carried part of the camping outfit, consisting of blankets, food, and cooking utensils. “Will it be safe to make a fire in here?” he asked. “Why not?” inquired Jerry. “There’s nothing much to burn.” “I thought maybe the smoke would smother us.” “There’s a good draft in here,” declared Ned. “The air is good and fresh. Go on, Chunky, light up. Some hot coffee will go to the right spot.” The saddles were taken off and the horses tethered further back in the cavern. Its extent was not even guessed at, but it seemed large. Cromley found some dried grass, probably carried in and left there when water had entered the cave, and this served as fodder for the horses, the animals seeming to relish it. Stripping off most of their wet garments, the refugees gathered about the genial blaze Bob started, and while their clothes were hanging about on pinnacles of rock to dry, a meal was gotten ready. As Ned had observed, there was a good draft in the cave, and the smoke went up, losing itself in the vastness of the vaulted roof. Near the entrance the wind blew in, bringing rain with it.[219] Also the sound of the storm could be heard. While the coffee was boiling Jerry and Tinny, wrapping blankets about them, blankets that had been kept dry inside the rubber-covered saddle roll, walked to the cave entrance. As they reached it and looked out into the almost complete darkness, they were startled by a great flash of lightning. In its glare they saw a strange sight. Across the trail was the side of a hill, and as the two looked part of this hill seemed to separate and slide down, being loosened by the rain or because lightning shattered some holding rock. “Another landslide!” cried Tinny. “I’m glad we aren’t out there!” “Look! Look!” shouted Jerry. “See the blue rock! Blue rock, Tinny!” He pointed to a mass of earth and stones sliding down into a gulch, and in the vivid glare of the lightning it could be seen that the rock was as blue as indigo!","sourceLink":"http://novel.tingroom.com/duanpian/3069/84848.html","bookId":985,"book":{"id":985,"title":"The Motor Boys on Thunder Mountain","description":"简介： What do you think of it, fellows? asked Jerry Hopkins. The tall lad ruffled in his hand some sheets of paper covered with typewriting. He looked closely at his two chums....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3069","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
