{"id":82955,"no":18,"title":"Page 18","content":"NEW THARPE SAT ALONE IN THE CABIN\u0027S FRONT ROOM. THE FIRE had almost played itself out, but was kept alive by errant thrusts of wind that swooped down the chimney and fanned the coals. Atop the mantel, next to a framed snapshot of his father and mother, a single kerosene lamp held an unblinking eye of flame. The wind blasted against the side of the cabin with fierce velocity, making shrill pipings as it found chinks in the walls. He was half expecting the thin old roof to tear away suddenly and spin upward into the sky like a top. The wind\u0027s whistling sounded all too close t\" the note Nathan\u0027s yo-yo had made. From around the bend he could hear the gruff barking of Birdie, the big red hound that belonged to the Claytons. New couldn\u0027t sleep. His cuts were still bothering him, though they were healing nicely under the bandages. He\u0027d tossed and turned for a long time on his cot, but rest eluded him. The city woman\u0027s face was on his mind, and the things she\u0027d said to him at the Broadleaf haunted him. He kept seeing that poster on the wall; when he imagined Nathan\u0027s picture up there with the others, his stomach felt squeezed by a powerful hand. He stared at the lamp on the mantel, and knew he would never see his brother again. The Pumpkin Man had taken Nathan; when the Pumpkin Man struck, there was no coming home, ever again. But why did it have to be that way, he asked himself. What was the Pumpkin Man, and why had no one ever seen him? No one, New realized, except himself. He was the man of the house. Wasn\u0027t there something he could do, some way to strike back at the Pumpkin Man for stealing his brother away? He felt so helpless, so weak! His hands clenched into fists, and a lightning bolt of confused rage seemed to rip through his brain. The kerosene lamp trembled, clinking against the stones. New\u0027s eyes narrowed. Had the lamp moved, or hadn\u0027t it? In his room, the magic knife was hidden under his mattress. When it had hit the ceiling over his mother\u0027s head, Myra had stood like a statue, her face drained of color. She\u0027d given a short, soft gasp, and New had seen a wet glint of fear in her eyes. Then she\u0027d slammed the door shut and retreated to her own room, where New had heard her crying. She hadn\u0027t spoken to him for several hours after that. Then it was back to her baking pies in the kitchen, baking more of them than ever, and all the while chattering too merrily about how the men would eventually find Nathan, he would return home, and then everything would be like it was before, only better, because Nathan and New would\u0027ve learned a valuable lesson about being on time. Either he was going crazy, he decided, or the kerosene lamp had moved. And if he had made it move . . . then was the magic in the knife - or in him? He pushed away all thoughts of his mother, the Pumpkin Man, and Nathan. The whine of the wind became a whisper. Move, he commanded. Nothing happened. He wasn\u0027t doing it right, wasn\u0027t thinking hard enough. He didn\u0027t have magic! It was in the knife, after all! But in his mind he envisioned the lamp lifting from the mantel, lifting higher and higher until it was almost up to the roof. He clenched his hand around the chair\u0027s armrests, and thought, Move! Like a bucking bronco, the chair began to jump under him. He cried out in amazement and held on. The chair balanced on one leg and spun wildly, then crashed to the floor. As New scrambled up, he realized the light in the room had changed. The lamp. The lamp had risen from the mantel some three feet, and was hovering just under the roof. \"Lord,\" New breathed softly. And then the lamp started to fall, to shatter on the mantel. He thought of burning kerosene, the house on fire, and he said, \"No!\" The lamp wobbled, slowed its descent, and very gently clinked back onto the mantel. He was going crazy, he thought. Crazy as a loon. Either that, or he\u0027d been witched. One was just as horrible a prospect as the other. Floorboards creaked. New turned to find his mother standing in the room, one hand up to her throat. She looked as though the merest breath of wind might cause her to crumble like a column of ashes. \"It ain\u0027t the knife,\" was all he could think to say. \"It\u0027s me, Ma.\" Her voice came in a strained whisper: \"Yes.\" \"I made the lamp move, Ma. Just like I made the knife move. What\u0027s happenin\u0027 to me? How come I can do it?\" A cold blade of panic pierced him. Witched! he thought. How? Why? \"I don\u0027t know,\" Myra said. Then she slowly dropped her hand from her throat and stood looking at the fallen chair. With an effort she shuffled forward and righted the chair, running her hands over the wood as if she expected to feel something alive in it. \"I\u0027m witched. It must\u0027ve happened when I fell into that pit, Ma. Whatever it is, that\u0027s where it started.\" She shook her head. \"No. That ain\u0027t where it started, New. And if you\u0027re witched . . . then so was your pa.\" \"Ma\u0027am?\" \"Your pa,\" she repeated. Her face was pale, her gaze unfocused. Wind shrilled down the chimney and made the coals glow like red lanterns. \"I don\u0027t know why, I don\u0027t know how - but I know your pa was a strange man. He was a good man, New, a God-fearin\u0027 man, but there was strangeness in him all the same.\" She lifted her eyes to meet his. \"He had a powerful temper. It took him over sometimes. One time he got mad at me for something - I forget what now, somethin\u0027 silly - and the furniture in this house started to jump like grasshoppers. I\u0027ve seen him break windows without even touchin\u0027 \u0027em. One night I woke up and found your pa standin\u0027 outside in a drivin\u0027 rainstorm. The truck\u0027s headlights were a-flashin\u0027 off and on. New\" - she blinked, her mouth contorting - \"I swear to you that I watched the whole front of the truck lift off the ground like a rearin\u0027 horse. Then it set back down again, real slow and pretty as you please. It made the hair stand up on my head to think that your pa had it in him to do such things. He wouldn\u0027t talk much about it, \u0027cause he didn\u0027t seem to understand it hisself, but he did say he\u0027d done tilings at school where he was raised - like makin\u0027 tables dance, or one time throwin\u0027 a bully into a fence just by thinkin\u0027 hard about it happenin\u0027. He said he didn\u0027t know why he could, New, but that such things were easy for him, and had been since he was about eleven or twelve years old. \u0027Course, he didn\u0027t let everybody know about it, for fear of what people would say.\" \"What would they say,\" New asked, \"if they knew about me, Ma? That I was cursed? Under a spell? How come it\u0027s happened to me all of a sudden? A couple of days ago, before I fell into that pit, I was just like everybody else.\" He shook his head, distraught and confused. \"Now . . . I don\u0027t know what I am, Ma! Or why I\u0027m able to do such a thing as make that lamp move without touchin\u0027 it!\" \"That I can\u0027t say. Your pa worked on keepin\u0027 hisself under control. He said that the only time he let hisself go was when he came across a rusted lug nut or somethin\u0027 heavy that he couldn\u0027t lift just with his arm muscles.\" She nodded toward the lamp. \"I saw what you did. I saw that knife this mornin\u0027, and I knew whatever was in your pa was in you, too. It may not have been in Nathan; but then maybe it was, who can say? I cried because it scared me so much, New. It took me back to rememberin\u0027 the things your pa could do. He was a good man, but . . . I think there was a part of him that wasn\u0027t so good.\" New frowned. \"Why?\" She walked to a window and looked out. Birdie was still barking, around the bend at the Clayton house. It was another moment before Myra answered. \"He was troubled, New. I don\u0027t know why, and neither did he. It was more than the things he could move with his mind.\" She paused, and released her breath between her teeth. \"He never slept so good,\" she said softly. \"He got up in the middle of the night and sat in this room for hours - just like you were sittin\u0027 in here when I looked in. Bobby saw things in his head when he closed his eyes. He saw fire and destruction and death, so bad he couldn\u0027t bear to tell me about \u0027em . . . and I couldn\u0027t bear to listen. He saw the earth splittin\u0027 open and houses fallin\u0027 in, and people on fire. It was like the end of the world, he said. The end of the world was goin\u0027 on, right behind his eyes.\" She turned toward him, and New was struck by how frail she looked. There was more to be said; he could see it in the darkness of her stare. \"He saw the Lodge in his mind, New. He saw it all lit up like a party was goin\u0027 on inside, a celebration or somethin\u0027. And in his mind he was dressed in a suit, and he knew he lived inside that Lodge and he had everythin\u0027 he could ever ask for. Anythin\u0027 he wanted was given to him. He said he could feel that Lodge, pullin\u0027 at him day \u0027n night. And a voice in his head, New - the most beautiful voice in the world, callin\u0027 him to come down to Usherland. He said he wanted to go into that house more than anythin\u0027, but he knew that if he did, he\u0027d never come back out again. At least, not the same as when he\u0027d gone in.\" New\u0027s spine had stiffened. He\u0027d felt the Lodge pulling at him, too, and that was why he stopped at The Devil\u0027s Tongue every chance he got, to dream about living at Usherland. He\u0027d thought they were just foolish daydreams, but now he wasn\u0027t sure. \"Usherland is a haunted place,\" Myra said. \"And that Lodge is its evil soul. God only knows what\u0027s gone on inside there, over the years. I\u0027ll tell you this, New - Bobby followed what was callin\u0027 him, and he went down to Usherland. He stood on the lakeshore and looked at that Lodge for a long, long time. When he came back home, his face was dead white, and he told me that if ever he wanted to leave this house after dark, to hold the shotgun on him till he\u0027d got hisself under control again. He was a brave man, New, but there was somethin\u0027 down in that Lodge that wanted him, and whatever it was, it scared Bobby so much he took to sleepin\u0027 with ropes tyin\u0027 him to the bed. He tried hard not to let you boys know how troubled he was. Whatever is down there kept on a-pullin\u0027 at him and a-tauntin\u0027 him.\" She brushed the hair away from her face with a trembling hand, and stared at the glowing embers. \"He said . . . it was all he could do to keep from listenin\u0027 to what that Lodge wanted him to do.\" New\u0027s throat was dry, and he swallowed. \"What, Ma? What was it?\" \"Kill us,\" she replied. \"Every one of us. Burn this house to the ground. And then find the old man.\" \"The old man? You mean the Mountain King?\" \"Yes. Him. Find the Mountain King and . . . not just kill him, New, but tear him into pieces. Put the pieces in a sack and take them to the Lodge. That\u0027s what would give him entry.\" \"The Mountain King? He\u0027s just a crazy old man . . . ain\u0027t he?\" Myra nodded. \"Bobby planned to go up to the ruins to find the old man, but before he could, that tire blew up in his face at the garage. He wanted to talk to him, to see if maybe the old man knew somethin\u0027 about the Lodge; he never got the chance. I . . . never breathed this to a soul, New. And I\u0027ll never say it again. But I think . . . somehow it was the Lodge that killed your pa. It murdered him before he could get to the old man.\" \"No,\" New said, \"it was just an accident. The Lodge . . . ain\u0027t alive. It\u0027s just made out of stone.\" \"You got to promise me,\" she begged, \"not to ever go down to Usherland. Don\u0027t let nobody else know you can move things with your mind. And most of all, don\u0027t talk about the Pumpkin Man - especially to no damned outsider!\" He had no intention of going to Usherland, and he was too stunned by this new-found ability to even conceive of telling anyone about it; but the last point stuck in his craw. He felt that the Dunstan woman sincerely wanted to find out more about the Pumpkin Man, and maybe by telling her what he\u0027d seen, he could, in some small way at least, help Nathan - or atone for his own guilt at having been unable to free Nathan from the creature\u0027s grasp. He was the man of the house; shouldn\u0027t he make his own decisions? \"Promise me,\" Myra said. It took an effort for him to nod his head. She seemed to breathe easier. \"You ought to go on to bed now. Get your rest. Your hurts still botherin\u0027 you?\" \"A little. They itch.\" She grunted softly. \"Your pa taught me how to make that medicine I put on you. Said it would take the sting out of just about anythin\u0027.\" Wind rattled the window behind her, and again she peered into the darkness. Birdie\u0027s bark had changed to an occasional guttural baying. \"Dog\u0027s makin\u0027 a lot of noise tonight, ain\u0027t he? It\u0027s the wind, I reckon, that\u0027s got Birdie spooked. Your pa knew a lot about the weather. He could sit and watch the clouds and say right to the minute when the next rain was comin\u0027.\" Her voice had become wistful, and now she pressed the fingers of one hand against the cold glass. \"Bobby was a good man. You know, he used to like to believe that his pa was a sailor. The captain of a ship. An admiral, even. At the school, when he was growin\u0027 up, he liked to read about the Pilgrims and such, all those folks who came over from England in boats. He used to dream about boats with big white sails stretched in the wind - though I don\u0027t think he ever saw the ocean, \u0027cept in pictures. He was a good man, and full of life.\" Wind whined through the wall cracks once more, and in his mind New heard the whistling of his brother\u0027s toy. \"Wind\u0027s been risin\u0027 two nights in a row,\" Myra said. \"Your pa always told me that meant rain three, four days away. Might be in for some bad weather.\" She glanced up at the roof. \"Ought to get some new timbers and shingles up there before the cold hits, I reckon.\" \"Yes ma\u0027am.\" She looked at him for a few seconds, then said, \"Better get on to bed.\" \"I will directly.\" \"We\u0027ll talk more about it tomorrow,\" she said, and they both knew what she meant. Then Myra turned away and left the room. New heard her door close behind her. He sank down into the chair again. His insides were quaking, and his mind was a storm of confusion. Why had his pa been able to do such things? And why was he suddenly able to, when for years he\u0027d just been as normal as anybody else? It was too much for him to grasp: a floating knife, a hovering lamp, dancing furniture, and a truck that reared like a wild stallion were things of witchcraft - the kind of sorcery. New thought, that only the Devil himself could command. It was no secret that evil prowled Briartop Mountain in many guises, from the Pumpkin Man to the black panther known as Greediguts by the locals. They were never seen, but everyone knew they were out there in the darkness, waiting. And now New had to wonder what kind of man his pa had really been. He looked at the picture on the mantel. It didn\u0027t tell the whole story. What kind of power had been hiding behind Bobby Tharpe\u0027s face? And what had been trying to lure him down to Usherland with the promise of wealth and luxury? New felt as if his back were bending under the weight of his thoughts. After some more thinking that only took him in circles, he stood up and took the lamp off the mantel, then went back to his room. As he readied himself for bed and blew out the flame, he heard Birdie howl. The howling went on for almost a minute - then abruptly cut off. After that, New didn\u0027t hear Birdie anymore. And in the dense woods across the road from the Tharpe cabin, the figure that had been standing there for more than an hour slowly turned away and disappeared into the night.","sourceLink":"https://allnovel.net/usher-s-passing/page-18.html","bookId":2474,"book":{"id":2474,"title":"Usher\u0027s Passing","description":"Storyline: In this most gothic of Robert McCammon\u0027s novels, setting is key: the continuing saga of the Usher family (descended from the brother of Roderick and Madeline of Edgar Poe\u0027s \"Fall of the House of Usher\") takes place in the weird and picturesque heart of the North Carolina mountains. The haughty, aristocratic Ushers live in a mansion near Asheville; the poor but crafty mountain folk (whose families are just as ancient) live on Briartop Mountain nearby. At harvest time, when the book\u0027s action unfolds, the mountains are a blaze of color. Add to the mixture a sinister history of mountain kids disappearing every year, a journalist investigating those disappearances, a monster called \"The Pumpkin Man,\" moldy books and paintings in a huge old library at the Usher estate, and a secret chamber with a strange device involving a brass pendulum and tuning forks--and you\u0027ve got a splendid recipe for atmospheric horror.","cover":"https://allnovel.net/images/usher-s-passing.jpg","author":"Robert McCammon","type":"Horror","source":"allnovel","link":"https://allnovel.net/usher-s-passing.html","creation":"Oct 5, 2019 8:58:46 AM","modification":"Oct 5, 2019 4:46:55 PM"}}
