{"id":93921,"no":14,"title":"Page 14","content":"\"A burn?\" She halted. \"That\u0027s like a stream, right?\" She began to edge back under cover. \"I don\u0027t do burns. And a league sounds really far at the moment, so don\u0027t worry about me. I\u0027ll be fine.\" \"What, a braw lass like you. worried by some wee burn?\" \"But I think it\u0027s getting too late in the day…\" \"Och. it\u0027s never too late. Come, my fair lady, perform your ablutions in nature\u0027s temple. You\u0027ll find a quick wash with naught but the sky overhead good for the soul.\" He took her hand from the dirt and gave a gentle tug. She didn\u0027t budge. \"I\u0027m not great when it comes to water and the great outdoors.\" James considered Magda for a moment, peering at her in the shadows of her tent. He gave a slight nod. \"Then I promise to stay by your side. Come.\" The playfulness was gone from his tone, his voice kind as he guided her back out. \"You\u0027ll feel the better for it.\" He helped her to standing. \"Truly. Less than half a league and you can lean on me as we go.\" \"But… won\u0027t the men look?\" \"They dare not.\" He took her arm, and Magda let him lead her, walking in silence across a broad glen. It was lush and green and, at that moment, it felt very wide -open. She imagined the men\u0027s gazes at her back, no less keen for the distance they were putting between them. \"The men will be able to see,\" she muttered finally, deeply concerned over how exactly she was supposed to manage in some surely frigid burn, and looking for any excuse to back out. James barked out a loud laugh and, catching her hand in his, tugged her into a run. She gave a startled shriek, then raced to keep up with him. \"If you\u0027ll not believe me, see for your own self.\" They jogged up a low sloping hill and Magda had to pump her arms to make it to the top. By the time they crested, she was winded, and laughing despite herself. \"You see?\" A stream wound its way around the other side of the hill. Though small, she wouldn\u0027t have called it a burn. It rushed along quickly and, even though a cluster of gray rocks choked one section into a narrow channel, the water didn\u0027t look very shallow. James pointed to a small copse of trees on the nearest bank. \"Your bath, fair lass.\" The walk downhill was more precarious, and she tentatively picked her way down, as much to avoid slipping as to come to terms with what lay ahead. \"I\u0027ll not disturb you.\" They reached the trees, and James began to back away. \"No!\" Magda put her hand to her mouth, self-conscious at the shout that had escaped her. \"I mean, no. I… urn… I don\u0027t have any soap.\" \"What is it?\" \"You don\u0027t have soap in the seventeenth century?\" \"Och, lass, of course we have soap.\" He stepped closer to her, taking her chin between his thumb and finger. \"I meant, what is troubling you? I can see that the matter is not merely that you want for soap.\" \"Well… I\u0027ll need it to wash.\" \"Soap is not what\u0027s fashing you at present, hen, and we both know it.\" He playfully tilted her head from side to side. \"No, I see some other worry robbing the peace from your bonny face.\" \"I…\" She turned her face from him. \"I guess I\u0027m a little afraid of water.\" \"Afraid of a wee burn such as this?\" He began to make light of it, then cut short. Magda was wringing her hands in front of her, looking back up the hill as if fantasizing about her escape. \"You are frightened,\" he said with astonishment. \"Whyever for?\" \"I\u0027d rather not go into it.\" James didn\u0027t pause a beat before giving one quick nod of assent, and she was grateful. He simply took her hand and began to lead her toward the trees clustered along the water\u0027s edge. \"But what are you doing?\" Anxiety hitched her voice again. \"Fret not. You shall have your bath.\" He removed his coat and used it to sweep the damp, leafy debris from one of the larger rocks, then sat her down atop it. \"And your soap too.\" Her fingers curled around the edge of the rock, cold and sharp beneath her, and she shot him a wary look. \"Trust me.\" He disappeared further into the trees. \"I\u0027ll be but a moment,\" she heard him shout from a distance. Magda sat on the rock, trying not to panic at the sound of burbling water. She felt cursed that such a tranquil thing could be such a source of angst. That she couldn\u0027t do something so simple as bathe outside without having a panic attack. \"Oh!\" she cried. James had returned, startling her with a light touch to her shoulder. \"Easy, hen.\" Cradling her elbows, he stood her up and led her a few paces downstream to the other side of the rocks. The water sounded even louder there, dashing against the large gray stones, whirling into eddies on the other side. She stiffened in his arms. \"I swear to you, this is the shallowest part. I\u0027ll be right here with you.\" He nodded to the rock she\u0027d just left. \"You have but to call if you need me. And, on my honor, my back shall remain ever turned.\" He winked at her, crossing his heart in earnest. She eased a bit, and even managed a crooked half smile. \"Remove what you will. No men will see you here. Or just knot your skirts if you prefer. You\u0027ll see, you\u0027ll be as fresh as a flower. Ah,\" he added, patting his coat pocket. \"I\u0027d almost forgot. You understand I\u0027ve no soap to hand… we discussed that at length already, aye?\" He gave her a wicked grin. \"But I did gather these for you.\" White petals appeared in his palm with a flourish, bringing a burst of rich, sweet perfume. \"Scotch rose for a Scottish bath.\" She hesitated, confused. \"What do I do with them?\" \"Oh I don\u0027t know the ways of lasses, hen. I thought you could rub them on yourself perhaps? Use them as you will. Or not, if you don\u0027t wish it. Whatever gives you pleasure.\" He placed the soft white petals in her hand and, with an elaborate bow, turned to sit on the rock, his back set firmly to her. Magda stood paralyzed at the waters edge. She studied the soft petals in her hand and laid them in a careful pile on the ground. She looked at James then, studying his back, trying to imagine the expression on his face. He would be gracious, patient, sitting there for as long as she\u0027d need him. She glanced at the stream, and then down at her feet. She really did need to wash. If she remained standing, she\u0027d be okay. The water was moving quite slowly, especially on the other side of the rocks. She could pretend it was just a large bathtub. A large, cold, and relatively dirty bathtub. Magda slid one leather slipper off, followed by a low woolen stocking. Cool mud crept between her toes, sending a shiver of pleasure up her body. She was so sore, and so dirty her skin itched with it. She could just dunk her feet in, at the very least. The cold might even soothe the aching in her legs. She squirmed quickly out of her other shoe and stocking, had her skirts in a knot, and was in the knee -high water before she could give herself a chance to rethink it. She looked at James again. His feet were kicked out on the rock in front of him. Late-afternoon sunlight shone weakly through the trees, dappling the buff color of his britches in shades of yellow and gray. He leaned back on his hands, his shirt pulled tight at his shoulders and over his outstretched arms. He\u0027d hear her splashing. She imagined he\u0027d smile at the sound of it. James was right there. No harm would come to her. The other me n were far away, and she trusted he\u0027d have their hides if they tried to sneak so much as a peek. Magda trotted back out of the water and, before she could change her mind, tugged the laces of her bodice free and slipped her dress over her head. \"Done already?\" \"Don\u0027t turn around!\" He chuckled quietly, a husky, masculine sound almost out of earshot. \"I\u0027d not think of it, hen.\" She splashed back in, feeling suddenly exposed despite the shift that was as long and as thick as any dress she\u0027d have worn in her own time. Magda leaned over and cupped her hand in the water. She stood there, watching the crystal clear stream flow over her palm, the image of her hand fracturing and wavering under the swirling water. It was brisk, but it felt so good, invigorating her after such an arduous ride. She splashed up, rubbing under her arms and chafing along her calves. She soon adjusted to the temperature and was lost for a while in the sheer pleasure of cool water sloughing dirt and sweat and horse from her body. \"You\u0027d have more luxurious accommodations than this, then.\" She froze at the sound of his voice and peered at him. He\u0027d eased back further, leaning on his elbows. \"Where you\u0027re from,\" he added in an easy voice. \"You would\u0027ve washed in much grander baths, I\u0027m certain. \" She relaxed a little. He clearly had no intention of stealing so much as a glimpse of her. \"How can you tell?\" \"How could I not?\" James laughed. \"Considering the fear you bring to such a wee trickle as this, it\u0027s not difficult to imagine you don\u0027t often find yourself bathing en plein air.\" \"No.\" She examined the dirt packed hard at her fingertips. \"Not exactly.\" She plucked a yellow leaf from atop a nearby rock and used the stem to scrape her nails clean. \"Though I guess this isn\u0027t so bad.\" \"Not so bad? You\u0027re a funny one, hen. Just give a look around. Not so bad indeed.\" Magda stood straight. Her feet and calves were numb to the cold now, but she found she liked the sensation, and burrowed her feet more deeply into the powdery silt of the streambed. Alder trees reached high all around, their rounded leaves fluttering in the breeze. She focused her senses outward, attuned to the occasional plop of their tiny cones dropping from branches high above. She breathed in, and crisp air filled her lungs, rejuvenating her. When was the last time she\u0027d stood among the trees like this? Seen trees in someplace other than Central Park? Surely not since her brother\u0027s death. Peter. What would he make of all this? Would she be nearly so calm about this whole situation if Pete were alive, at home waiting for her? No, she\u0027d be hysterical. Stomping, raging, freaking out. Not bathing in an idyllic babbling brook with some famous hero of old.","sourceLink":"https://allnovel.net/sword-of-the-highlands-highlands-2/page-14.html","bookId":1616,"book":{"id":1616,"title":"Sword of the Highlands (Highlands #2)","description":"Storyline: Sword of the Highlands (Highlands #2) One minute, she\u0027s New York heiress and art curator Magda Deacon, enraptured by the Highlander captured in an old portrait. The next, she\u0027s falling through time to 17th-century Scotland--and embarking on the most erotic journey of her life.","cover":"https://allnovel.net/images/sword-of-the-highlands-highlands-2.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/sword-of-the-highlands-highlands-2.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:04:26 PM"}}
