{"id":93931,"no":24,"title":"Page 24","content":"Napier rushed to her side, and placing his arm gently at her back, he steered her to a chair by the fire. \"Poor girl. I\u0027m told you have a story for me. I\u0027d hear it as we return to Montrose. I vow you\u0027ll have my every effort to return you home, safely and soundly.\" \"But,\" her voice wavered, uncertain. \"I\u0027m no longer sure I can go home,\" she said, thinking how they\u0027d been unable to track down Brother Lonan. Then she realized, even more so, she couldn\u0027t go home because she had to know what would become of James. It had been slowly dawning on her that she needed to witness his fate for herself. \"Well…\" Napier was flummoxed, and his generally impeccably genteel demeanor was no longer doing much to mask it. \"We\u0027ll get you back to my Margaret,\" he announced, suddenly sure. \"She will help us sort this to rights.\" Magda merely stared at her hands clenched in her lap. \"You\u0027ll not fret, dear girl.\" Napier spoke softly and surely. \"James shall return to you, a king\u0027s army at his back.\" She stood, chafing her arms by the hearth, greedy for the last of the fire\u0027s dying heat. Magda knew she should rest—they were to leave for Montrose at dawn—but she wasn\u0027t ready to lie down for the night. James had said she should go home, but she knew now that she couldn\u0027t leave him. He thought she was the one in danger, but Magda knew it was he who faced the greatest risk. She\u0027d fooled herself, thinking it was merely the historian in her who needed to see it through, who wanted to witness history happen in real time. But now Magda knew the need ran even deeper. She had to stay for herself. And for James. She had considered what it would be to turn from his fate. She could simply go home, choosing to read his end in the pages of history. The thought sat like ice in her belly. She imagined it. how she\u0027d return to her time only to search hungrily for any painting, or book, or artifact that would tell his story, delivering him to her side. But reading history wouldn\u0027t truly bring James back. The answers she\u0027d find would leave her hollow, the pages at her fingertips, her might- have-been. Or. courageous, she could seize her own fate. James wanted Magda to find her way home, but he thought he had a battle to fight, triumphant. He\u0027d have her out of harm\u0027s way. Little did he realize that he was the one who was truly in danger. She stoked the fire one last time, suddenly warmed through. For the first time in her life she\u0027d stand her ground. She thought of Peter, and how she hadn\u0027t been able to save him. Considered her parents, and how they\u0027d tried to have a say in every aspect of her life, from dictating which schools she\u0027d attend to steering the right men her way. But now was her time to take an active part in the living of her life. She wouldn\u0027t just study history, she would be a part of it. Magda laughed quietly to herself, and turned to scamper into bed for the night. Where a strange man sat, staring at her, lips curled into a feral half smile. \"What the—\" Magda instinctively clasped her arms to her chest, concealing herself under her thin nightgown. \"I see your swain has abandoned you. Pity,\" the man said, running his eyes hungrily up and down her body, lit from behind by the fire\u0027s soft glow. \"We find ourselves in rough countryside, the sort where a woman has want of a man, and yet it seems yours is no longer in need of you.\" \"Excuse me!\" she said, finding her voice. \"Please leave this room now.\" \"And so. as I was saying,\" he patronized, \"I\u0027ve decided to take your care upon myself.\" His lips, thin and shining as if just licked, peeled apart to reveal the tip of his tongue clamped between small teeth. \"You see, I too am abandoned,\" he continued in mock despair. \"Your paramour has taken us all unawares and is reportedly off to meet the king. No man turns his back on me,\" he growled. \"Who knew the Marquis of Montrose had such pluck?\" \"James is not my paramour, and I have no need for a caretaker, so if you\u0027d please just \"— He barked out a laugh. \"James, is it? So\"—he assessed her thoughtfully—\"you are indeed intime with our marquis. An interesting development.\" Ignoring her outraged gasp, he oozed, \"Oh, but where are my manners? I must introduce myself. I am Archibald Campbell, Marquis of Argyll, at your command.\" Magda stared at the jowly letch in front of her, speechless. This wasn\u0027t supposed to be happening. The kindly Napier was going to come for her tomorrow morning. She would wait for James, or she would return home. She wasn\u0027t supposed to be caught helpless in a real seventeenth-century nightmare. \"Help!\" she shrieked, bolting for the door. \"Somebody help!\" Campbell was on her in an instant, his chubby hands gripping her upper arms like two vises. \"Tut-tut.\" He shook his head, his tone one of exaggerated dismay. \"Poor duck. Your companions have all gone to Aberdeen. To celebrate my victory. And you here, alone. Oh,\" Campbell added brightly, \"not completely alone. Just you and that old sot Napier, who seems to find himself knocked insensate at the moment.\" Panicked, her eyes flicked around the room, looking everywhere but at his face. Was there something she could use as a weapon? Some tool by the fireplace? Campbell gave her a strong shake, pulling her close. \"What is it?\" he asked playfully. He\u0027d pulled her face near to his crimson velvet coat. \"Ah, have you eyes for this trinket?\" He let go one arm and fingered a long, straight pin stuck garishly at his breast. A re ddish-brown stone at its tip shone dully in the firelight. \"It was a… gift,\" he chuckled salaciously, \"from a fine Aberdeen-shire lady. If James can have his blue rag, I thought it best to have my own emblem.\" He stroked her cheek with his knuckles. \"If you show me your every kindness, perhaps I will make you a gift.\" \"The only thing I require of you is your exit,\" Magda snarled. Her escalating fear spiked her confidence, and she spit at him and clawed for his face. He grabbed her wrist and jerked it down to her side. She struggled frantically, kicking at his calves with her painfully bare feet, trying to knee him and shake her body free from his grip. \"Get out!\" \"I think not, dear.\" Campbell pushed her backward. \"But fear not. Your fate is in your marquis\u0027s hands. I\u0027ll not sully myself with you. Yet.\" He wrenched both her hands up. pinning them against the wall with his forearm over their heads. He took a swath of her hair, wrapped it once around his fist and slowly pulled it through his hand. \"I find I\u0027ve a taste for battle, not for used whores with hair the color of rust.\" He leaned his face close to hers, and the sour stink of his breath turned her stomach. Campbell ducked to take her earlobe between his teeth and bit down hard, silencing her shriek with a damp palm pushed hard to her mouth. \"We\u0027ll make our way back to my lands in Argyll.\" She felt spittle on her cheeks as he whispered in her ear, \"Clans along the way shall kneel, or enrich my coffers.\" \"But he\u0027s a Campbell!\" Tom shouted, frantic. \" How could you let a Campbell take our Magda?\" \"I—\" Napier was stricken. Rubbing the lump on the back of his head, he deflated, sitting on Magda\u0027s bed to reread Campbell\u0027s note yet one more time. \"He claims the lass as his own. Says James has discarded her, and he is the storm that sweeps the chaff from the field.\" \"The bastard dares be poetic.\" Tom sat by Napier\u0027s side. \"\u0027Twas not your fault, I know. He caught you unawares. The Campbell is capable of great treachery. Now up with you,\" he added, mustering an optimistic tone. \"We must get word to James.\" \"Don\u0027t you see?\" Napier asked, subdued. \"James will be gone from Montrose by now.\" The other man began to speak. \"Aye,\" Napier interrupted him, anticipating Tom\u0027s next thought. \"We can—and we will—send word to Oxford. But open your eyes, Tom. That girl is as a cloud of smoke on the wind.\" Chapter 18 \"Eat.\" Campbell nudged the tin platter toward her with his foot. Magda contemplated the hard bread and white cheese on the ground before her. Two days had pas sed since being captured by the Campbell clan, and she hadn\u0027t consumed much more than water. Even when Campbell had hustled her roughly onto his horse and off to his distant camp, she\u0027d been in a fog of disbelief. It had quickly shattered, though, on her first night. She\u0027d heard a struggle and, straining her eyes into the darkness, had spied a girl no older than twenty rushing from Campbell\u0027s tent, torn dress clutched to her chest. The sound of the girl\u0027s sobs, convulsive and reedy, had pierced the night, robbing Magda of her appetite, even as she\u0027d felt a remote kernel of resolve crystallize deep inside. At first, she\u0027d hoped for rescue, fantasizing that every hillock or copse of trees along the road concealed James, who would surely burst out at any moment to save her. He was out there, somewhere. Did he think of her, she wondered, or was Magda just a brief chapter, now concluded, in his greater adventure? Would he rescue her, if he knew? Or perhaps he already did know of her capture and chose instead to continue on his current course. Her throat closed at the thought, and she blinked rapidly. She\u0027d rather die than let Campbell see her tears. Campbell squinted at her, his thin, perpetually moist lips peeled from his teeth. \"Too good for my food, is it?\" He tapped the plate once more with his foot. \"I can see to it that you\u0027re offered none, if that\u0027s your preference.\" Knowing she needed to preserve her strength, Magda lifted the cheese to her mouth and gnawed off a bit from the corner. Tart with age, it flaked onto her tongue, its sourness turning her stomach. She made herself dissolve the dry lump in her mouth, and swallow. \"That\u0027s it,\" he said, sneering. \"Need to keep your strength up. I\u0027ve plans for you, lass. Big plans.\" She eyed him wordlessly, willing him to disappear, not bothering to mask her contempt. Campbell laughed, amused by her impotent outrage. \"Eat fast, woman. We\u0027ve a hard day of riding ahead.\"","sourceLink":"https://allnovel.net/sword-of-the-highlands-highlands-2/page-24.html","bookId":1616,"book":{"id":1616,"title":"Sword of the Highlands (Highlands #2)","description":"Storyline: Sword of the Highlands (Highlands #2) One minute, she\u0027s New York heiress and art curator Magda Deacon, enraptured by the Highlander captured in an old portrait. The next, she\u0027s falling through time to 17th-century Scotland--and embarking on the most erotic journey of her life.","cover":"https://allnovel.net/images/sword-of-the-highlands-highlands-2.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/sword-of-the-highlands-highlands-2.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:04:26 PM"}}
