{"id":93936,"no":29,"title":"Page 29","content":"Wary uncertainty flashed in her eyes. \"There\u0027s no shame about it.\" Lonan pressed it into her hand. \"I smell the blood, child. This is a natural styptic. It will speed your healing.\" She stroked it between her fingers, and it was cool and spongy, with a lush velvety texture only possible in nature. \"What is it?\" \"It\u0027s merely touchwood, dear.\" She shook her head, confused. \"If I tell you it\u0027s a fungus that grows like a shelf from the sides of trees, will you still place it between your legs?\" \"Certainly not,\" she stiffened her back, trying to muster the picture of robust health. \"Well,\" he said, amusement quirking his features, \"then I suppose I mustn\u0027t tell you that.\" Relief at her successful escape had loosened something in her belly, and she laughed. Lonan joined her, and his scar once again deformed his features, one half of him joyful and the other misshapen into a grimacing mask. Magda forced herself to hold his gaze, though she had to fight herself from flicking her eyes to the left side of his face. \"You\u0027re wondering what happened.\" She raised her brows in mock innocence, and he met her charade with patience . \"To my face, child. I can see you\u0027re wondering what it is that befell me.\" \"Well, I…\" \"Do not be ashamed. Wonderment is what drives men to more and greater things. \u0027It was through the feeling of wonder that men now and at first began to philosophize .\u0027\" Magda looked baffled. \"Aristotle\u0027s words, not mine. I am not nearly so circumspect.\" Lonan eased himself into a chair by the hearth and began. \"\u0027Twas the Battle of Glenlivet, many, many years ago. I was just a lad yet. I\u0027m a Gordon by birth, you see. Perhap s that is why, to this day, despite being a forgiving man of God, I have no affection for Clan Campbell. But that is a tale for another day,\" he added ominously. \"It was my first battle, and I bore a virgin sword, as it were. Yet, unlike the other lads, more fascinating to me than any war play was how faith was enough to gird two thousand men and lead them to triumph over an army ten-thousand strong. \"Though many men were heroes that day, to me the greatest champion was my uncle. I\u0027m no crusader,\" he confessed in a lighthearted tone, \"and the lion\u0027s heart of my youth has faded into something closer to the lamb\u0027s, but those questions of battle, why men fight and what gives them courage, those are questions of which I\u0027ll never tire. \"I was injured that day—gravely, as you can see—and though I know now it was the frenzy of battle that numbed me to my wounds, at the time I felt certain it was God\u0027s hand at work. That the cross hanging at my neck and the holy water dampening my shirt was the only armor I needed. \"You could say I found God at the edge of a sword.\" Lonan lifted his hands to the fire, and Magda could see the pain in his joints writ on his face. \"I\u0027ve since that day devoted myself to scholarly inquiry that I may better understand we human animals. I\u0027m a bit of a mendicant, I confess, but other holy men are always happy to take me in, sharing books and food in God\u0027s name, in places just like this.\" His hand shook with age as he gestured to the room around them. \"So where is this?\" she asked. \"Do you ask of this island, or of this time?\" Magda froze at his implication, and Brother Lonan continued without pause. \"First things first, the island. But\"—he handed her a tin cup filled with golden liquid—\"I insist you drink this, child. It will help.\" Skeptical, she brought the cup to her nose and inhaled a smell like peat fire and the sea, biting through her senses. She took a tentative sip, and it was like liquid smoke slipping down her throat. It curled through her body and warmed her, uncoiling muscles in its wake. \"What is this?\" She sipped again, deciding that the flavor was toasty, and faintly salty. \"I once made my tonics by mixing pink centaury with whisky but, in my age and wisdom, I have simplified it. Magdalen,\" he said, pouring a measure of liquid into his own cup, \"you have before you a dram of whisky. And, may I say, it calms the nerves as efficiently as any herbal tincture. \" Slainte mhath, child,\" he added, raising his cup to hers. \"I bid you welcome to Inchmahome Priory.\" He sipped for a time in silence, and Magda let herself enjoy the pleasant buzz that hummed through her. Leaning her head back, she unclenched her jaw and slowly allowed herself to consider the pain between her legs, the ache in her bottom, and the stiffness between her shoulders. \"That was the Loch of Menteith you just swam. Most simply choose to arrive by boat.\" An amused appreciation played on the right side of his face. \"Robert the Bruce himself favored Inchmahome. He came often.\" Lonan gestured to the walls around them. \"It\u0027s in disrepair now, as you can see.\" She glanced up at the ceiling arching low overhead. The claustrophobic feel was only intensified by the thousands of stones used for bricks, their thin irregular rectangles pressing down from above, seeming ready to crumble at any moment. \"Once the province of Augustinian monks,\" Lonan spoke, pulling her attention back to him, \"Inchmahome welcomes all scholars, including the occasional wayward Dominican,\" he said, gesturing to himself with a smile. \"Some say that a spit of land on Menteith\u0027s southern shore was built by fairy folk.\" He shrugged with a hint of condescension. \"I see,\" she said, the whisky giving ease to her voice. \"You only believe in time travel. Nothing so preposterous as fairies for you.\" Her attempt at humor was met with sternness. \"Time travel is a law of physics, not an abomination to Christianity,\" he said, alluding to the old Celtic beliefs. \"The nature of time is as intertwined with the universe as the beat of the tides. It is in the service of God and His people that I apply my scholarship to it, as I would to any other course of study.\" Lonan considered her as he would a child, and he softened. \"But I demand too much of you. Come,\" he pulled himself to the edge of his chair and slowly stood. \"I will show you your room. You and I have much time together yet.\" And, with that ominous statement resonating in her, Lonan walked Magda to the small cell she would call her own. The men had long returned to Castle Gloom and their furious chief, short a wench and one stud horse. The lace was the first to rise, tickling the surface of the lake with its tattered, stained fingers. Gradually the green plaid rose to meet it, the wool thick with water and moving sluggishly, like some angry spectral body exhumed from the deep. It bobbed there for a time, on the choppy waves, until it disappeared again, pulled slowly back to the bottom. Chapter 21 After he\u0027d been recognized outside Dumfries, James and his men had traveled by night, resting as best they could by day. They had purposefully steered clear of Edinburgh, not far from Falkirk to the east. It was near dawn they approached what appeared to be a simple crofter\u0027s cottage near Falkirk Moor. \"How can you know they\u0027re friendly?\" Rollo asked, reining in to study the cottage. Red light flickered intermittently through a crack under the door. \"I suppose there\u0027s naught I know for sure, is there?\" James replied cavalierly, eliciting a scowl from Rollo. James slid off his horse, and Sibbald, shrugging his shoulders, joined him. While James helped Rollo dismount, the colonel tied off their horses with a long lead. The animals immediately set to grazing. \"I do know,\" James said, \"that there was a time this particular cottage was a Royalist outpost.\" Rollo eased to the ground, where he began to pound life back into his legs. \"Let\u0027s hope the Covenanters haven\u0027t beaten us here.\" \"I\u0027ll see who\u0027s keeping the fires burning,\" James said. Before his companions could stop him, he was knocking on the door as if for a pleasant afternoon visit, rather than the predawn refuge they sought in a war-torn country. The door opened, and Rollo and Sibbald at once put their hands to the swords at their sides, wary and alert. Though he was the same height as James, the man filling the doorway was much wider. Where James was lithe muscle, this man was pure, thick brawn. A small peat fire crackled in the hearth at his back, illuminating him from behind, casting his already dark features into frightening blackness. \"The Graham, is it?\" he growled in a thick burr. \"James Graham of Montrose?\" \"Indeed,\" James replied in a friendly tone. Though his posture remained at ease, James\u0027s right hand was tensed, fingers curled toward the sword hilt at his side. \"And whose acquaintance do I have the pleasure of making?\" The man let out a laugh sounding much like a roar, and grabbed James into a bear hug. The man pushed James away, and holding his shoulders, avidly studied his face as if James were his long-lost brother. \"I am Alasdair MacColla Ciotach MacDomhnaill.\" He clapped James hard on the shoulder. \"Alasdair the son of Colla the left-handed, of the Clan MacDonald.\" \"I know my Gaelic, Alasdair MacColla,\" James replied, \"but you still haven\u0027t told me who you are.\" MacColla roared another laugh, \"Aye, Charles warned you were a canny one.\" Grinning broadly, he added, \"I\u0027m the man come to help hunt for Campbells.\" MacColla gestured to the room behind him. \"Come. come. We\u0027ve much to discuss, and I\u0027d do it proper, with a skalk and porridge.\" \" Skalk?\" Rollo\u0027s voice came fro m the darkness. \"The man means to drink whisky for breakfast,\" Sibbald said. \"I could use a morning dram myself,\" he added, striding to the door. The men passed around the quaich, and by the time the shallow wooden bowl was empty, they were at ease. \"The Campbells took our land. They took my father prisoner. And, when I was forced to seek refuge with the Clan MacDonald in Ireland, they took my country from me.\" MacColla polished the empty quaich with a corner of his tartan, his bushy black eyebrows furrowed in thought. \"And now \u0027tis time for me to take something from the Campbells.\"","sourceLink":"https://allnovel.net/sword-of-the-highlands-highlands-2/page-29.html","bookId":1616,"book":{"id":1616,"title":"Sword of the Highlands (Highlands #2)","description":"Storyline: Sword of the Highlands (Highlands #2) One minute, she\u0027s New York heiress and art curator Magda Deacon, enraptured by the Highlander captured in an old portrait. The next, she\u0027s falling through time to 17th-century Scotland--and embarking on the most erotic journey of her life.","cover":"https://allnovel.net/images/sword-of-the-highlands-highlands-2.jpg","author":"Veronica Wolff","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/sword-of-the-highlands-highlands-2.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:04:26 PM"}}
