{"id":94844,"no":21,"title":"Page 21","content":"I crossed Heron Row a block down from Tam’s place and stopped. Sirens was closed during the day, but apparently that didn’t stop Tam from having visitors. This wasn’t just any visitor. I knew this lady. Or at least knew of her. Primari A’Zahra Nuru had a direct connection to, and the ear of, the Mal’Salin family. The primari, or shamaness of the royal blood, had taught the goblin queen mother, as well as the late queen. She had also been Tam’s teacher and mentor. When Sathrik, the queen’s eldest son, took the throne after his mother’s sudden death, he encouraged Primari Nuru to retire. He provided her with a modest house and annual income in Mermeia, far removed from the goblin court. It seemed the new king didn’t want his dead mother’s tutor underfoot. Hardly unexpected considering A’Zahra Nuru’s rumored abilities and Sathrik’s recent activities, most notably the questionable circumstances of his mother’s death. Primari A’Zahra Nuru was hardly retired. According to Markus, she was Prince Chigaru Mal’Salin’s most trusted advisor. And now here she was visiting Tam. Chigaru’s retainers had taken on King Sathrik’s Khrynsani guards in Nigel’s garden last night. A’Zahra Nuru drops in on her former student this morning. The odds were against a coincidence. If I wanted answers, it looked like I had come to the right place. The diminutive goblin wore a simple gown of pale mauve silk, and her silvery white hair was elaborately styled and held in place with tiny, jeweled pins. More pale gems glittered on the lobes of her upswept ears. As with Tarsilia, the years had been kind to A’Zahra Nuru. Her pale gray skin was still smooth over high cheekbones and fine features. The primari must have wanted to see Tam very badly to be out on a bright, sunny morning. Goblins were mainly nocturnal, by preference bordering on necessity. They could be out during the day, but their dark eyes were painfully sensitive to sunlight, and most chose to just remain inside. Shops and businesses in the Goblin District were open during the day, but kept extended hours in the evening for the convenience and comfort of their clientele. During the day, the windows were kept shuttered and the interiors dimly lit. Any human or elven customers had to make do the best they could. If goblins ventured out during the day, they wore dark-lensed spectacles. A’Zahra Nuru wore a stylish pair of these perched on the bridge of her patrician nose. The amulet tingled in the center of my chest, and I had the sensation that someone had just woken up from a long nap. It knew something I didn’t, and I suspected the goblin primari had everything to do with it. She hadn’t hesitated in her progress down Heron Row, but I knew that she had sensed me, the amulet, or both. My hand instinctively went to the disk, and I pulled farther back into the shadows of a side street. What she was using weren’t shields. It was a searching spell, completely silent and more complex than anything I could have attempted, let alone pulled off. It spread toward me like surface ripples on a pool. Sensing something that subtle was another first for me. I didn’t try to stop it. I knew better. A block or deflection would have announced my presence like slamming a door in Nuru’s patrician face. My stomach fluttered as the spell flowed through me. The primari hesitated a fraction of a second, then continued on her way. I continued breathing again. The amulet was proving to be as good a watchdog as it was a nuisance. But just because it growled at strangers didn’t mean I was going to trust it with my own neck. I waited until the primari was well down Heron Row before crossing the street to Sirens’ front door. Tam’s bouncers weren’t on duty, but Tam’s wards certainly were. And they were at full power. Tam’s wards at half-strength were something to behold, full power would take care of anything short of a magical tidal wave. It looked like a certain goblin primaru was feeling a little insecure this morning, and I was willing to bet that insecurity started last night and intensified with his mentor’s visit this morning. I knocked, even though I was sure Tam’s wards had already announced me. After a few moments, a small section of the door slid open, just large enough for the pair of amber eyes that looked out. I recognized the eyes and the elf they belonged to. Lorcan Karst, Tam’s floor manager. I heard the sound of locks being unfastened and wards being shifted. The door opened. Lorcan was tall and lithe, and like most elves, deceptively slim and much stronger than he looked. Lorcan in particular was more dangerous in other ways than most realized. Rarely did anything happen that he couldn’t control—one way or another. “Mistress Benares, what a pleasant surprise. What can I do for you?” He didn’t look surprised to see me—pleasantly or otherwise. “Is your boss in?” I asked. “He is.” “If he’s not too busy, I need to speak with him.” I paused. “And if he’s busy, I’m willing to wait.” Lorcan stepped aside and ushered me into the dimly lit interior. “I will ask. May I have Kell get you anything from the bar while you wait?” The barkeep looked up from his work and waved in greeting. I smiled back. “Nothing, thanks,” I told Lorcan. “Morning, Kell,” I called across the empty dance floor. The big goblin continued to put away glasses. “It’s been too long. Where have you been keeping yourself?” “Here and there. The usual.” I paused to let my eyes adjust to the dim lighting. Many of Tam’s employees were also goblins, and Tam wanted his people to be comfortable. I had been here often enough to know where everything was, but I wasn’t in the mood to trip over a wayward chair. To my left, next to the long, sleek bar, was an area with only a pair of elaborately carved doors behind a small desk. Tom had commissioned the doors from a local artist. I had looked closely at the panels. Once. I don’t blush easily, but suffice it to say what the carvings look like from across the room are entirely different from what they really are. Behind those doors, and up a flight of stairs was the most exclusive gambling parlor in Mermeia. Gambling wasn’t illegal in Mermeia, but exploiting certain magical advantages was. Combining gambling and sorcerers was either a very good or a very bad idea—depending on which side of the table you were on. For sheer profitability, a fancy Conclave education had nothing on what a moderately talented sorcerer could learn and earn in an upscale Mermeian gambling parlor. Nudging a pair of rolling dice, manipulating a deck, compelling your fellow players to study the insides of their eyelids while you did a little reconstructive work on the game board. The possibilities were nearly endless. Tam ran a legitimate establishment, or at least that’s what the city watch believed. I didn’t buy it for a minute. Lorcan escorted me to my favorite booth against the back wall. I knew the way, but the elf was a gentleman and a good manager, so I let him do his job. “I will let Primaru Nathrach know you are here,” he said. I nodded. Tam already knew I was here, but I was willing to let protocol take its course. Lorcan vanished behind a discreet set of velvet drapes concealing the narrow hallway leading to Tam’s private office, and Kell had disappeared into the back room, so I made myself at home. Other booths in Tam’s place were better for being seen, but this booth was better for seeing—and leaving. Even in Sirens’ relatively safe surroundings, having access to the back door, and to the alley and canal beyond was occasionally useful. Tam liked keeping behavior in his place as civilized as possible. An occasional discreet vanishing act on my part did wonders for sustaining our friendship. My gaze drifted to the stage. The evening’s entertainment was setting up. One of them, a young goblin, had stopped and stood openly watching me. I watched him right back, and considering how easy he was on the eyes, it wasn’t hard work. He had the body of a dancer, all sleek muscle, and he was dressed to accentuate every angle. Knowing a thing or two about muscle tone and what it takes to acquire and maintain it, I knew that his hadn’t come entirely from dancing, though no doubt he did that well enough or Tam wouldn’t have hired him. He looked toward Tam’s office and bowed slightly. “My primaru.” I turned to find Tamnais Nathrach watching us both with amusement. Seeing Tam always made me breathe funny. Like many goblins, Tam wore his black hair long. Normally it was pulled away from his face with a silver clasp. This morning it was loose, slightly disheveled and fell in a shimmering wave to the middle of his back. Looked like someone had spent the night here. Tam crossed the floor to me like a big, beautiful, and dangerous cat that had just awakened from a very satisfying nap. If I listened closely enough, I could probably hear him purr. He wore trousers and matching boots of dark, soft leather. Over that was a long silk dressing robe woven with an intricate pattern of silver and blue. He let the robe fall open, treating me to a view of smooth, silvery chest. Tam noted my appreciative glance with a sly smile and a bit of fang peeking into view. He nodded toward the stage. “I see the two of you have met.” “Not really,” I said. “We are ready, my primaru, if you would like to listen,” the young goblin said. “Very much so.” In a whisper of silk, Tam slid into the booth next to me. While the musicians prepared, Tam took my hand and barely brushed my palm with his lips. Seeing Tam made me breathe funny; touching Tam made me forget how. “It’s been too long,” he whispered, his dark eyes shining in the half light. Kell had said the same thing. Somehow it was different coming from Tam. I didn’t have to be told why. After the night I’d had, on top of virtually no sleep, I thought I’d probably spook horses and scare small children. From the look I was on the receiving end of, Tam didn’t agree. Though knowing Tam, he probably hadn’t noticed anything going on above my neck. Tam and his voice were like fine, dark silk—he was provocative, his voice was seduction itself, and both made you feel completely decadent. I wasn’t entirely immune to his charms, and I didn’t entirely mind. I had always told myself that Tam didn’t mean anything personal by it. It was a harmless little game that we both enjoyed. Perhaps if I told myself that long enough I’d begin to believe it.","sourceLink":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1/page-21.html","bookId":1620,"book":{"id":1620,"title":"Magic Lost, Trouble Found (Raine Benares #1)","description":"Storyline: Magic Lost, Trouble Found (Raine Benares #1) A girl with attitude. An all-powerful amulet. This could only mean trouble. My name is Raine Benares. I’m a seeker. The people who hire me are usually happy when I find things. But some things are better left unfound… Raine is a sorceress of moderate powers, from an extended family of smugglers and thieves. With a mix of street smarts and magic spells, she can usually take care of herself. But when her friend Quentin, a not-quite-reformed thief, steals an amulet from the home of a powerful necromancer, Raine finds herself wrapped up in more trouble than she cares for. She likes attention as much as the next girl, but having an army of militant goblins hunting her down is not her idea of a good time. The amulet they’re after holds limitless power, derived from an ancient, soul-stealing stone. And when Raine takes possession of the item, it takes possession of her. Now her moderate powers are increasing beyond anything she could imagine—but is the resumé enhancement worth her soul?","cover":"https://allnovel.net/images/magic-lost-trouble-found-raine-benares-1.jpg","author":"Lisa Shearin","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:09:30 PM"}}
