{"id":94874,"no":52,"title":"Page 52","content":"\n My question and attitude took him by surprise.\n “You will give me the beacon,” he demanded.\n There were definite advantages to having an absurdly tight bodice—and a beacon that refused to leave. I looked down just to make sure. Nope, nothing was coming up through that cleavage.\n I almost laughed. “I’m afraid that’s not physically possible.”\n His grip tightened. He had to have expected my response, but it didn’t make him any happier to hear it.\n He looked down to where the diamond chain vanished between my breasts. I didn’t like that look one bit. Mychael didn’t either. He took two steps toward us.\n The goblin prince pulled me back against him. “No closer.”\n Mychael stopped. His eyes flicked to something just past my left shoulder. I was betting I’d only need one guess—Prince Chigaru’s friends wanted to keep him company. Vegard was keeping me company, too—from a discreet distance. He stayed put, for now. Too much of a crowd would draw attention we did not want.\n “You are wearing the beacon,” Chigaru said. “You will remove it. Now.”\n “We’ve been over this before, Your Highness. I take the beacon off, I die.”\n He pressed the dagger harder against my bodice. “The same is true if you refuse.”\n He had me there.\n “A lady dying in your arms isn’t the kind of attention you want to attract,” Mychael said, his voice soft and low.\n Magic spun into the air at the sound of his voice. He risked detection, but with a dagger against my ribs, so did I. I wasn’t going to die quietly. Mychael’s casting was for the prince’s ears only, but that didn’t stop goosebumps from prickling at the back of my neck—though that could have been as much from the goblin’s warm breath and the proximity of his fangs to my throat, as from Mychael’s voice.\n A slight figure appeared by the prince’s side, on the edge of my vision. I didn’t have to see her clearly to know who she was.\n “There need not be violence.” Primari A’Zahra Nuru’s voice was quiet, but firm. “We can reach a compromise.”\n A quartet of the king’s guards were beginning to look entirely too interested in us.\n “But not here,” she urged. “Into the gardens, quickly.”\n The possibility of being dragged into the bushes by a goblin prince was one of the reasons why noble elven ladies feared foliage. Who knew it’d happen to me?\n “Or I could just scream now and save us all the trouble,” I said. “Dying isn’t agreeable to me, regardless of how or where it happens.”\n In an instant, Prince Chigaru shifted his grip from my arm to my waist, pulling me tight against him. The dagger’s pressure never lessened. “Then we will all die at the hands of my brother’s guards.”\n “Your brother has never seen my face,” I told him, talking fast behind my fan. “Nukpana isn’t here. No one has ever seen the Countess of Eilde. I’m safe. I can’t say the same for you.”\n “Peace, both of you,” Primari Nuru snapped. “All of you. We share the same goal; threatening each other does nothing to help us reach it. Please, let us all step outside.”\n In my experience, an invitation to step outside has never been a good thing. That it came from a goblin primari did nothing to change my opinion.\n The king’s guards making their way toward us through the press of guests might believe that I was the Countess of Eilde, but there would be questions, especially since I was in the immediate vicinity of a renegade goblin prince. His arm was locked around my waist. How much more immediate could you get? They didn’t know he was the prince. Yet. But ordering him to remove his mask would change our status pretty quick. Questions or detention meant delays. We couldn’t afford any delays.\n “May we be of service, my lady?” one of them asked.\n I sank back against Prince Chigaru’s chest and weakly fluttered my fan back and forth. “Thank you, but no. A warm night and too much dancing.” I offered a wan smile for their benefit. “And far too much excitement.”\n The guard glanced curiously at the prince. I didn’t wait for his question.\n “This gallant gentleman was kind enough to remain with me until my husband returned with refreshments. We’re old friends.” I reached up with my free hand and patted the goblin prince on the cheek.\n I felt rather than heard the growl rumble low in the prince’s chest. I took the hint and removed my hand, but I took my time doing it.\n Mychael stepped in close, putting himself in the line of vision between the Mal’Salin captain and Prince Chigaru. “A Caesolian red always works wonders, doesn’t it, my love?”\n I smiled up at him. “Almost always.”\n I took the glass in one hand and Mychael’s extended hand in the other. He drew me away, and Prince Chigaru had no choice but to release me. He sheathed the dagger behind his back and no one was any the wiser.\n I took a healthy swig of wine as I stepped into the circle of Mychael’s arms. “Thank you, darling. I feel better already.”\n “The cool air of the gardens will do you a world of good, my dear,” the primari suggested, looking every bit like the gallant gentleman’s maiden aunt.\n I nodded. “I think that’s exactly what I need.”\n Mychael held out his other hand to Primari Nuru, in courtly fashion. “Will you allow me to escort you, my lady?”\n To the primari’s credit, she didn’t hesitate before placing her hand in Mychael’s. The Guardian’s hand closed over it. The prince drew in his breath with a hiss. Someone didn’t like his teacher’s decision.\n Mychael and I, along with the primari, led the way onto the terrace, followed by Vegard and Prince Chigaru. Four of Chigaru’s goblin guards followed at a discreet distance. I recognized two of them from The Ruins. From the murderous looks I was getting, they remembered me, too. Once again I was going to be in a garden with goblins who didn’t like me.\n Being outside was a definite improvement. If there was going to be violence, at least there was more room for it. What made me feel even better was Garadin holding the door open for us, drink in hand, looking completely relaxed. I knew the truth. He was relaxed because he was confident. Garadin had a spell that could take out everyone on the terrace. Piaras and Riston were waiting near the stone stairs leading down into the gardens. Piaras recognized our new friends. He started to come to me, but Garadin’s cautioning gesture stopped him.\n “We need to leave the terrace, or disperse,” I said to no one in particular. “Both would be nice.”\n “There is a gazebo in the center of the garden,” Mychael said. “It should give us the privacy we need to reach an equitable solution. The others could wait within sight and earshot for security purposes. Is that agreeable?”\n “I don’t think that’s agreeable to anyone,” I said. “But right now, I’ll settle for just getting off this terrace.”\n Under congenial circumstances, the gazebo would have been a perfectly lovely place for a quiet talk, or for two lovers to steal a few secretive moments together. Unfortunately neither description applied to us. Garadin, Piaras and the two Guardians waited near a small rose garden about ten feet behind us. Chigaru’s guards were at a similar distance in the opposite direction.\n In a rustle of gossamer fabric, the primari seated herself on one of the stone benches. Prince Chigaru stood behind the bench at her right shoulder, his dark eyes still on me. I opted to remain standing, my eyes more or less even with his. Somehow I felt safer that way.\n “You should not have come tonight, my primari,” the prince told the tiny goblin. “It is not safe for you here.”\n “And your safety is assured?” she shot back, though not unkindly. “You should not worry about me.” She reached up and affectionately patted the prince’s hand on her shoulder. “Has Mistress Benares agreed to assist us?”\n “We were just getting to that,” the goblin prince said.\n “Perhaps I might help.”\n Getting to that? Might help? This was all too strange for me. The prince made it sound as though we had just taken a pleasant turn around the dance floor, and now I felt like I was about to be interrogated by someone’s elderly grandmother.\n I stood straighter, not that I had much choice in that dress. “You have a strange way of asking for help, Your Highness.” I turned to the primari. “Two nights ago, he ordered a friend of mine kidnapped to use as bait to catch me. I was told he would be killed unless I cooperated. We were then tied up, and taken against our wills into The Ruins where your darling prince threatened my friend with torture unless I agreed to help him find the Saghred.”\n “Was any undue violence or coercion used against you or your friend?” Chigaru asked mildly.\n I couldn’t believe what I was hearing. I heard Piaras’s gasp of disbelief behind me.\n “Undue violence?” My voice went up a couple of octaves. I couldn’t help it. “As opposed to justifiable?”\n The goblin prince shook his head. “Merely necessary.”\n “The ends justify the means?”\n He almost smiled. “Precisely. So you do understand.”\n “No, I don’t!”\n “Raine,” Mychael said by way of warning.\n I shot him a look, then took a breath and blew it out. I continued, but quieter. “Then tonight, His Most Serene Highness sticks a dagger in my ribs and says that unless I help him, he’ll kill me. Perhaps this type of behavior isn’t serious to a goblin, but we elves take that kind of thing personally. I know I do.”\n The look the primari gave the prince was the same one Tarsilia gave Piaras when she caught him sneaking cookies before supper. Then the tiny goblin shook her head and actually made tsking sounds.\n “He acted out of concern for our people,” she tried to assure me. “His methods may seem somewhat questionable, but his heart is in the right place.” \n","sourceLink":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1/page-52.html","bookId":1620,"book":{"id":1620,"title":"Magic Lost, Trouble Found (Raine Benares #1)","description":"Storyline: \n Magic Lost, Trouble Found (Raine Benares #1) \n A girl with attitude. An all-powerful amulet. \n This could only mean trouble. \n My name is Raine Benares. I’m a seeker. The people who hire me are usually happy when I find things. But some things are better left unfound… \n Raine is a sorceress of moderate powers, from an extended family of smugglers and thieves. With a mix of street smarts and magic spells, she can usually take care of herself. But when her friend Quentin, a not-quite-reformed thief, steals an amulet from the home of a powerful necromancer, Raine finds herself wrapped up in more trouble than she cares for. She likes attention as much as the next girl, but having an army of militant goblins hunting her down is not her idea of a good time. The amulet they’re after holds limitless power, derived from an ancient, soul-stealing stone. And when Raine takes possession of the item, it takes possession of her. \n Now her moderate powers are increasing beyond anything she could imagine—but is the resumé enhancement worth her soul?\n \n","cover":"https://allnovel.net/images/magic-lost-trouble-found-raine-benares-1.jpg","author":"Lisa Shearin","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1.html","creation":"Oct 5, 2019 8:57:47 AM","modification":"Oct 5, 2019 6:09:30 PM"}}
