{"id":30470,"no":14,"title":"CHAPTER XIV.","content":"Miss Harwood came into the drawing-room in the afternoon, at five o’clock, when the little party were all assembled, with an open note in her hand. “Fancy, mamma, how annoying,” she said, “Charley cannot come to dinner. Some engagement, business, has turned{80} up; and he says, since you kindly allow him to dispense with ceremony——” “Oh, I should think so,” cried Mrs. Harwood. “Let him keep any business engagement, for goodness’ sake. He has not too many of them, I fear.” “He has more than you think,” said Gussy. “His time is far more taken up than you suppose.” “Well,” said Mrs. Harwood, “he might have let us know sooner, and then I should not have ordered those partridges. Game is thrown away upon women. You all like a chicken just as well.” “I’ll tell cook,” said Gussy, “to put them aside for to-morrow; but I don’t suppose he knew till the last moment.” Janet had been going on with her work very demurely, taking no notice, feeling somewhat guilty, yet recognizing with a throb of elation that she was not the unimportant person they all thought her. Janet was of opinion that it was best to have no secrets, for secrets have an infallible certainty of being found out. So she lifted her voice at this point and said, “I saw Mr. Meredith in Mimpriss’s when I was there for the crewels. He was choosing some music.” “Did he tell you he was not coming?” Gussy asked, somewhat breathlessly. “He held up a song,” said Janet, and said, “This is for to-night.” Which was quite true. To keep back a little is very different, she said to herself, from telling a fib. And now any gossip might tell them she had been seen with Mr. Meredith, and no harm could come. “Ah! you see it must have been quite sudden, mamma. Did you notice, Miss Summerhayes, what the song was?” “I saw Tosti’s name at the bottom of the page, but I did not look at it more closely,” said Janet. “He held it up to me while I was getting my crewels, and said something about your voice.” “He should not speak of my voice or of me at all in a shop,” said Gussy, with a bright look and an air of flattered grievance. To think that he could not refrain from speaking of her, even in a shop, to anybody whom he might meet, was sweet to poor Gussy, as it was also sweet to blame him, and resent his foolish, lover-like weakness. “Well,” she said, “I suppose it will be for to-morrow night. I will tell cook about the partridges, mamma.” There could be no doubt that Janet felt a little guilty as she dressed for dinner—guilty and curious, too. He had said he{81} should not dine, but he had meant to come all the same. Would he come, after all? and on what pretence? How would he make it seem consistent with his business engagement? What would he do? It was a curious question, and she could not help feeling that her r?le and that of Gussy were reversed, and that it was she who would listen for the step and the ringing of the bell, though solely out of curiosity to know what would happen. Janet made herself a little more smart than usual; she could scarcely have told why. She relaxed a little the profound gloom of her mourning. There was a little additional light in her eyes. She was curious, very curious, to know whether he would do it, and how he would do it. Her instinct was mischievous—perhaps a little malicious—a sort of drawing-room wickedness, mere fun, not anything else. It would be interesting to see with what ingenuousness he would account for his unlooked-for appearance, how gravely he would recount the manner in which he got rid of his business engagement. Janet felt that she would have difficulty in keeping her countenance while he ran through his excuses. And she realized to herself Gussy’s serious attention, her congratulations to him on having been able to get away, and Mrs. Harwood’s remark that she hoped he would never neglect any business engagement which was of importance. Janet held her breath in anticipation, to keep down the laugh which she knew would try to come. And he would look at her with audacious eyes, lifting his eyebrows, claiming her as a fellow conspirator. There could be no doubt that it would be “fun.” All of them so serious, taking the matter in the gravest way, while she would receive that glance aside, that reminder that they were in a plot together. Yet it was no plot. Janet could truly say that she had nothing, nothing to do with it. If he was so impudent as to cheat his friends, it was no fault of hers: and no doubt it was very wrong of him. But it was a piquant break upon the monotony, and Janet could not deny even to herself that the fun was uppermost, and that she expected to be much amused. It all happened exactly as she had foreseen. Gussy took her place opposite her mother with the most absolute tranquillity. Her usual little strain of expectation, which was always there, even on the evenings when he was not expected, when it was only possible that he might come, had altogether fallen to-night. She looked at her work with eyes which had no other meaning, never held her breath at a passing sound, nor paused to listen; became, indeed, again the mild Gussy, undisturbed by emotion, with whom Janet had first made ac{82}quaintance. The sight of this relapse into quietude gave Janet a great compunction; more even than had Miss Harwood shown acute disappointment; and she felt in herself, as she had foreseen, all the signs of the suspense and expectation from which the other had escaped. In the stillness of the night she heard, or thought she heard, steps coming from a long distance: she caught her breath at every passing sound. When a cinder fell from the hearth, she gave a little jump, as if it were some one coming. Her ears were keener than they had ever been in her life. The sense of fun gave way in Janet’s mind to a sense of guilt as she thus listened and watched in spite of herself. And yet she had done nothing wrong; the fault, she said to herself, if there was one, was not at all her fault. But Janet felt like a little conspirator, sitting there among them, knowing the surprise that was coming and that they were about to be deceived. When nine o’clock struck, however, which it did very audibly, in the long pauses of conversation, Janet said to herself, half with relief and half with disappointment, that now he would not come. Gussy had closed the piano before dinner; there was no glimmer from the white keyboard. The evening was going to pass over quite tranquilly, like one of the quiet evenings before Mr. Charles Meredith appeared. Just as she had concluded upon this, with, to do her justice, quite as much relief as disappointment, the sudden sound of the bell came tingling through the quiet, making Janet jump, who was off her guard. Gussy, who expected nothing, scarcely stirred. “Who can that be so late?” said Mrs. Harwood: “it can’t be Charley Meredith to-night.” “It must be a parcel or something,” said Gussy, “or perhaps a telegram from Dolff to say when he is coming. He is fond of telegrams—It is some one coming in,” she said, after a pause, raising her head. “Perhaps it’s Dolff himself,” said Julia, getting up with one spring from the rug. She rushed to the door, while they all watched. Julia opened it, looked out, and closed it again with indignation. “After all, it’s Charley Meredith again,” said the young lady, “and now, I suppose, we shall have to go to bed.” Gussy rose up, her quietness all gone. She said, “Ah!” in an indescribable tone, as if coming from the bottom of her heart. “Ju, how rude you are, shutting the door in his face!” said Mrs. Harwood. “You seem to wish to make the very{83} worst impression, as if you were a savage. Well, Charley! this is a surprise. We made sure we should not see you to-night.” “I hope it’s not disagreeable,” said Meredith, coming in briskly with his roll of music, as usual. He managed, even in that first moment, to give a side glance at Janet, which she somehow caught trembling under her eyelids. Oh, it might be fun! but it was horrid, too. She felt herself a conspirator, a deceiver, all that was most dreadful, and did not dare to raise her eyes. But nothing could be more assured and easy than his explanation. “I found I could shake off my man sooner than I expected. Talks about business, don’t you know, Mrs. Harwood—you ought to know—mean endless maundering on one side, and half-a-dozen words on the other. If your advice is worth anything, it can always be said in half-a-dozen words.” “I would never hurry a client, Charley,” said Mrs. Harwood, shaking her head; “in all I’ve had to do with the law I’ve always seen that; and my brother, who, you know, was a Q.C., always said so. Never hurry a client; let them get it all out.” “Oh, I think he got it all out, and we parted the best of friends. He’s only in town for a few days, and he wanted to go to the theatre; so I took him to the ‘Gayety,’ and gave him my blessing. And here I am, not much later than usual. I beg your pardon, Miss Summerhayes, I did not see you. How do you do to-night?” What a look he gave her as, pretending to see her for the first time, he made a step in her direction. Gussy afterwards took him much to task for slighting the governess. “Just because she is the governess one ought to be more than usually attentive not to hurt her feelings,” said Gussy. But, then, she did not see that look, which so tempted Janet to laughter, yet overwhelmed her with a sense of guilt. His eyebrows went up almost into his hair as he looked at Janet. He gave her the slightest nod of understanding. “You see!” he seemed to say. Janet felt herself drawn into his circle, made his comrade, his confidant. And it was funny; but, oh, so horrid, too! “Clients come, more or less,” he said. “I am not quite so briefless as I was. I think I may say I am getting on, and my devotion to my work is boundless. I know how much depends upon it.” He gave Gussy a look as he said this, which caused two blushes instead of one, for the color came crimson to Jane{84}t’s face as she stooped over her work, as well as in a soft rose to Gussy’s colorless cheeks. “Ah! it’s more music, I fear, than law,” said Mrs. Harwood, again shaking her head. “Well, both are best,” said the young man, looking at Gussy again. “Music gets me on in one way, law in the other. I have to consider what is needed all round.” “You can always make out a good case for yourself, Charley.” “I hope so, Mrs. Harwood; and for my clients, too.” Gussy was silenced by these allusions, which were so very plain. Her eyes seemed to swim in a soft and liquid brightness. Her face had the rose-tint which makes up for all deficiencies in character and color. This evening, which had begun in resigned dulness, was it to end more brightly than any other? She was silent in the flood of silent happiness that filled her heart. And Janet sat by, the little conspirator, who was behind the scenes and knew the difference! Oh, how wicked, how angry, how helpless she felt! It was not fun at all, but treachery, a falsehood that made her ashamed to the very bottom of her heart; unless this, indeed, was the truth, and Janet the little dupe whom he was making a fool of, which would be better than the other, yet even more exasperating. She kept her eyes fixed upon her work, and her needle flew, and her cheeks burned. Never, never, never, thought Janet, would she speak to Mr. Meredith again. There was at least half-an-hour spent in conversation, and then the visitor unrolled his new song. “I wish you would try this,” he said; “our concert is coming on, and we must settle what we are going to do.” “Gussy is to sing in the quartets,” said Mrs. Harwood. “In more than quartets. She is to perform a duet with me.” “Oh, is that what you are thinking of? Isn’t it a little conspicuous? These things are all very well in a drawing-room—but on a public platform!” “Mother—it is to amuse the poor.” “Oh, yes. I know what you mean with your amusements for the poor. You amuse yourselves very much first of all, and then you call it an act of charity. I am not a great person for amusing the poor. It would not amuse me at all to go out in a cold night and listen to your concert, and I don’t think a woman of my age in the back slums would like it a bit better. We would both prefer our fireside and our work.{85}” “But suppose the poor creature had no fire, Mrs. Harwood?” “Then give her some firing, which would be far more sensible. She wants coals, and you give her a song. Of course you will do it your own way. Singing to them is the fad of your generation. Coals and groceries have always been mine.” “But about this duet,” said Meredith, with an indulgent smile. “As for it being conspicuous,” said Gussy, “that is nonsense, mamma: for people sing according as their voices suit, and not for any other reason. And Charley and I are such old friends. We surely may sing together.” “Or do anything else together,” he said. “Oh! have it your own way,” said Mrs. Harwood. “It is quite useless for me to interfere.” “You mean a much more gracious permission, dear Mrs. Harwood, than you say. Ah! here is Miss Summerhayes to play for us, if she will be so good. And I think you will be so good, for nobody could play so well without liking to do it. No, I can’t have you bothered with that, Gussy. You must give your whole attention to the song. Come! Why, the piano is shut up, and there are no lights.” “You forget,” said Gussy, “we did not expect you to-night.” “And you never have any music except when I am here! That is a pity, though it’s a great compliment. May I light the candles? Now, come—it is to be a lesson to-night. Miss Summerhayes will play, and I shall coach, and correct, and do all sorts of dreadful things, as if I were Cantalino. You shall have everything over again that Cantalino inflicts upon me.” In this way, with every kind of seduction, Gussy was got to the piano, and received her lesson, which was half a gratification and half the reverse, for Miss Harwood did not quite like to be put in the place of a learner before Janet, while it made her happy to be “coached,” and trained, and interrupted, praised, and encouraged by her lover. Was he her lover? Janet seated with her back to them, with a new and difficult accompaniment to occupy her fingers, could not resolve this question to herself; sometimes men are not at all loyal and yet are in love. They discuss their beloved one, or even their fiancée, with the first comer. They ask other men’s opinion of her. They talk of their own execution, when they are to be “turned off,” and similar vulgarities, and yet are lovers in the curious contradiction of nature. Was this all? Was his{86} criticism of Gussy only his unmeaning banter? and his joke played upon her to-night, did it mean nothing? Janet sat at the piano, and thumped and pondered, with her cheeks blazing crimson and her hands flying from one end of the instrument to another. She was a very good accompanist. She might not, perhaps, have any instinct of self-sacrifice in life, but she had learnt that it was of the first importance in art. She played for the singer, not for herself, supporting her in her weak notes, giving place to her strong ones, making her own performance the background of the other. And, as Janet felt much ashamed of herself and of the part which she had been made to play in this night’s performance, she was more self-sacrificing, more bent upon making herself secondary and the singer first than ever. When the singing was over, even Mrs. Harwood applauded. “You should always have Miss Summerhayes to play your accompaniments, Gussy. She does it beautifully. She brings out your voice as I never heard it before. I begin to think that no one can sing and play too. You brought out her voice quite beautifully, Miss Summerhayes.” “A word of applause for the coach, too,” said Meredith, with a laugh. Gussy, pleased with her little success, stood, with an uneasy glance at Janet, not knowing what to say. She was more disposed to applaud the coach than the little governess. She stood hesitating between them, now and then giving Janet a doubtful look. She was far too much assured in her own superior place to be jealous of Janet. Jealous of Janet! She would as soon have thought of being jealous of a cat. But still it annoyed her slightly that Janet should have such a share even in this little drawing-room triumph. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3298/90206.html","bookId":453,"book":{"id":453,"title":"The Story of a Governess","description":"简介： Janet Summerhayes did not start in life with the feelings usually attributed to the young governess when beginning what is certainly a very thankless trade, with about as little prospect of continued prosperity as any in the world. Many representatio...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3298","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
