{"id":30475,"no":19,"title":"CHAPTER XIX.","content":"Meredith paused at the door inspecting the quiet interior thus thrown open to him—in which he was not looked for, and where, accordingly, his arrival remained unobserved—the doors being all open still for the exit of Dolff. It startled him a little to find in how like its ordinary condition everything was, and how little sign of the absence of a habitual visitor was about the place. There were a hundred signs of Dolff, but even the place near Gussy usually though tacitly reserved for himself was filled up, and Gussy sat at the eternal woman’s work which, in some circumstances, is so exasperating to a man, as composed as if he had never crossed her horizon. They were all at it, Mrs. Harwood with her crewels, Janet with something else. He wondered, half-angrily, if they would go on forever with their heads bowed over that infernal sewing whatever might happen, even that quick little thing, that creature born under more variable skies, the governess. She, however, was the first to find him out. A consciousness of some new element in the warm atmosphere, something that had not been there a minute before, moved Janet. She looked up and uttered a faint exclamation. Ah! he had thought there was no difference, but there had been a difference. Gussy had been sitting like a statue, quite still, but not the faintest thrill of movement in her. She did{112} not expect him, or anyone, she was not thinking of him, or anyone, quite self-contained, self-absorbed. He was almost ashamed to think how he had been thinking of her, complacently realizing her suspense, and disappointment, and wonder at his non-appearance. The extreme composure of her aspect gave Meredith a shock which would have done much to redress the balance between them. She did not even raise her head at Janet’s exclamation. It was Mrs. Harwood who did that, crying out, “God bless me! Charley!” with a pleasure of which there could be no doubt. And a sort of shock passed over Gussy, electric, spasmodic, he could not tell what it was, something that moved her from the crown of light hair on her head to the tip of the shoe which was visible under her gown. It all passed in a minute, nay, in a second, as so many a crisis does. He could see it go over her; had not his eyes been opened by a sense of guilt, and by various other convictions, he might have known nothing of it; but he did, and suddenly became aware that he had something more to deal with than a girl’s momentary annoyance at the absence of the man whom she was beginning to care for. At the end of that moment, when he had come forward to shake hands with Mrs. Harwood, Gussy rose, and gave him her hand with perfect composure. On her side she was quite sure that she had betrayed nothing, not even the mere surprise which would have been so natural. “You have been a great stranger, Charley,” said Mrs. Harwood. “Yes, indeed,” he said, “no one can know that so well as I. I have been driven to the end of my patience. I kept hoping that one of you would take a little interest, and ask what I was about.” He kept his eyes on Gussy, but Gussy never moved or gave sign of consciousness. “My dear boy,” said Mrs. Harwood, “women never like to interfere—to ask what a young man is about. You are so much more your own masters than we are. We know very well that if you want to come you will come, and if you don’t——” “How unjust you are with your general principles! Here is one poor miserable exception, then, to the rule—who has tried to come, and thought he could manage it evening after evening. Well, it is all in the way of business. You have always been afraid I was idle. What will you say when I tell you that I have been in chambers—sometimes till eight and nine o’clock every night?{113}” “I shall hope it means a lot of new clients, Charley,” the old lady said. “Well, I think it does.” He did not wink at Janet—oh, no! that would have been vulgarity itself—the sort of communication which takes place between the footman in a play and the chamber-maid who is in his confidence. Mr. Charles Meredith’s manners were irreproachable, and vulgarity in that kind of way impossible to him. But he did catch Janet’s attention with a corner of his eye, as it were, which expressed something a little different from the open look which was bent on Mrs. Harwood—or, rather, on Gussy, at whom he glanced as he spoke. And then he entered into certain details. Mrs. Harwood, though she was disabled and incapable of getting out of her chair, was an excellent woman of business, and she entered into the particulars of his narrative with great interest. She said at the end, with a satisfied nod of her head, “Well, Charley, I hope we may now feel that you are beginning to catch the rising tide.” “I hope so, too,” said the young man. And then it seemed to dawn upon him that these agreeable auguries might lead him too far. “A little time will tell,” he said, “whether it’s a real beginning or only a flash in the pan. I am afraid to calculate upon anything too soon. In three months or so, if all goes on well——” Janet asked herself, with a keenness of inquiry which took her by surprise, what, oh, what did he mean by three months? Was that said for Gussy? Was it said for anyone else? Did he, by any possibility, think that she cared—that it pleased her to know that he was deceiving Mrs. Harwood and her daughter? She felt very angry at the whole matter, which she thought she saw through so completely, but which, after all, she did not in the least see through. Janet thought that for some reason or other this young man was “amusing himself,” according to the ordinary jargon, with Miss Harwood’s too-little concealed devotion, that he secretly made fun of the woman who loved him, and was preparing, when the time came, a disenchantment for her and revelation of his own sentiments, which would probably break Gussy’s heart. It can scarcely be said that Janet felt those sentiments of moral indignation which such a deliberate treachery ought to have called forth. She was still so far in the kitten stage that it half amused her to see Mr. Meredith “taking in” Miss Harwood. It amused her to think that probably he had been having some wild party of his young men friends (a party of young men always{114} seems wild, riotous, full of inconceivable frolic and enjoyment to a girl’s fancy) in his chambers, on some of those evenings which he so demurely represented to the old lady as full of business. She could not help an inclination to laugh at that. It is the kind of deceit which has always been laughed at from the beginning of time. But she felt angry about the three months. What did he mean by three months? Was it for Gussy to lull her suspicions? Was it for—anyone else? Janet felt as if she were being made a party to some unkind scheme which had not merely fun for its purpose. Why should he look at her in that comic way when he said anything particularly grave? Janet turned round her little shoulder to Mr. Meredith, and became more and more engrossed in her needlework. But yet it was strange that whatever she did he succeeded in catching her eye. “Some one has been singing,” he said, presently, with a little start of surprise. “I brought something with me I thought Gussy would like—but you have been singing without me?” He turned round upon her suddenly at this point. Gussy had been very quiet; she had said scarcely anything. She had allowed him to go through all those explanations with her mother. At first she had closed her heart, as she thought, against them; but it is not so easy to close a heart when it is suddenly melted by a touch of thaw after a frost. Gussy had been frozen up hard as December—or even February—could do it. But what is frost when there comes that indescribable, that subtle, invisible breath which in a moment undoes what it has taken nights and days of black frost to do? What a good thing it is to think that the frost which works underhand and throws its ribs across the streams, and its icicles from the roofs by degrees, takes days to make ice that will “bear,” and that the sweeter influence can bring all that bondage to ruin in an hour or two! Gussy’s heart had frozen up, putting on an additional layer of ice every day; but in a moment it was all gone, sliding away in blocks, in shapeless masses, upon the irresistible flood. The flood, of course, is all the stronger from that mass of melted stuff that sweeps into it, giving an impetus to every swollen current. Gussy made an effort to feel as if this melting and softening had not been, as if she were as she had been an hour before; but what attempt could be more ineffectual? Frost may counterfeit a thaw on the surface when the sun shines; but what thaw can counterfeit frost. It was not among the things that are possible. “I have not been singing,” she said, softly, her eyes wandering, in spite of her, to the little roll in his hand. “You for{115}get we have had something else to amuse us all these evenings. It is Dolff who has been singing.” “And a very nice voice he has got, now that it has been trained a little, poor boy,” said his mother, “though I am not very sure that I like his taste in songs.” “And Miss Summerhayes plays for him,” said Meredith, turning round upon Janet with a laugh. He faced her this time, looking at her frankly, not trying to catch any corner of her eye. His look had a gleam of merriment and saucy satisfaction which make Janet glow with anger. “Didn’t I tell you so?” he seemed to say with his raised eyebrows. He laughed out with a genial roar of amusement. “I knew Miss Summerhayes would play for him,” he cried. How did he know anything of the kind? How dared he laugh in that meaning way? How dared he look at Janet as if he had found her out; as if she, too, had a scheme like himself? Janet gave him a look in return which might have turned a more sensitive man to stone, and she said, with great dignity, wrapping herself up in the humility of her governess-state as in a mantle: “I am here to play for anyone who wishes for my services, Mr. Meredith, as I think you ought to know.” “Good heavens,” cried Mrs. Harwood, “my dear child! I hope you don’t take it in that serious way. If it is so disagreeable to you, my dear, you shall never be asked to humor poor Dolff again.” “Oh, Mrs. Harwood, that is not what I meant! I am very glad to do it for anyone, but I don’t like to hear people talk—to hear people laugh——” “The little thing is in a temper,” said Meredith, aside to Gussy, “have I said anything so very dreadful? Come and try whether they have thumped the piano all to pieces, and then we can talk.” “I don’t know that you have said anything dreadful. And we can talk very well here,” said Gussy, in the same undertone. “She is like a little turkey-cock,” said Meredith. “What has been going on? To think that something should always turn up, a farce or a tragedy, when one is out of the way for a few days.” Gussy asked herself, with a catching of the breath, if it were a farce or a tragedy? How true that was! No, it would not be a tragedy now—now that he had come back. “Nothing has been going on—except some silly songs,” she said.{116} It did not occur to her that her own songs were silly, or that there might be two meanings to the word, but Meredith was more ready in his comprehension. “Ah, some silly songs!” he said. Upon which Gussy, feeling more and more the soft welling-up from under the crackling frost, of the warmer waters, felt a compunction. “Poor Dolff,” she said, “is not altogether exalted in his tastes, you know. And he has taken a music-hall craze. I suppose it is from the music-hall they come, all those wonderful performances. But he likes them, it appears, as well—as well——” “As we like ours,” said Meredith. “Well, ours——” she colored a little as she said the word; but why should she not say it, seeing he had thus given her the cue? “Ours are better worth liking. At the same time,” said Gussy, returning to her old self, “we are all so silly in this family that we can’t do anything without doing a great deal too much of it. We can’t, I fear, take anything moderately. We do it with all our heart.” “That is why you do it so well,” said Meredith. His voice had a slight quaver in it, which might have been taken in more senses than one. It might have meant emotion, and again it might have meant a suppressed laugh, for to imagine that Dolff sang his music-hall songs exceptionally well because he sang them with all his heart was a little trying to the gravity. But now that he had set up a conversation sotto voce, and now that Gussy had been brought back to talking of what was habitually done “in the family,” Mr. Meredith felt that he had got back upon the old ground. As for Janet, she packed up her sewing things in her little basket, and begged Mrs. Harwood’s permission to retire. “I have a little headache,” she said. Good Mrs. Harwood was much concerned and very sorry, but agreed that quiet and going to bed early was the best thing for a headache. And when the lovers—were they the lovers?—went to the other room, Janet rose and stole away. She was not gone so soon but that she heard Meredith burst into a laugh over Dolff’s songs, which were all scattered about. He sang a snatch of one of them mockingly as she was going out, and caught her with a wave of his hand, an elevation of his eyebrows, and a slight nod of his head. He would not let her escape, he who had so easily made up his own difficulties, but must discharge that arrow at her, hold that whip of mockery over her. Janet closed the door upon herself with a studied{117} quiet, which was even more demonstrative of her state of mind than had she shut it with a violent slam, as Julia would have done; but it was more hard to suppress the pants of her laboring, angry breath. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3298/90211.html","bookId":453,"book":{"id":453,"title":"The Story of a Governess","description":"简介： Janet Summerhayes did not start in life with the feelings usually attributed to the young governess when beginning what is certainly a very thankless trade, with about as little prospect of continued prosperity as any in the world. Many representatio...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3298","creation":"Aug 1, 2019 12:18:47 AM","modification":"Aug 1, 2019 12:18:47 AM"}}
