{"id":19149,"no":17,"title":"CHAPTER XVII","content":"The tooting and whistling of the train began. The men filed outside. In the crush Cash Hawkins, who had been drinking steadily until he was now in a decided state of inebriation, slunk down to the other end of the platform. Henry and Sir John assisted Diana to the car. The cow-boys swarmed along the platform—Jim alone stood in the deserted saloon. \n \n Before he was aware of what was happening—that the train was about to carry away this tie of his former life—he heard Diana\u0027s voice call \"Jim.\" She slipped from the lower step on which she stood and ran towards him. \n \n \"Diana!\" He seized her out-stretched hands—he must say something to her, but she would not let him speak. \n \n \"I shall always thank God for this day, Jim, I couldn\u0027t believe you were—I never have. Now I know the sacrifices you have made for me—now I know I have the right to ask God to bless you and keep you and make you happy.\" Her voice broke; tears were falling on his hand. \n \n Lady Elizabeth or Henry would never discuss the cause of Jim\u0027s departure. She had always persistently defended him to the world, and to-day her intuition had told her that for her sake Jim had shielded his cousin—her husband! How could she accept it? \n \n \"And you, Diana—tell me you are happy.\" \n \n \"Happy?\" Her eyes told him that it was only possible for her to be happy now that she knew the truth. \"I sha\u0027n\u0027t mind the future now so terribly, because I can respect somebody.\" \n \n Dan passed the open door. \"All aboard, lady,\" he briskly called. \n \n \"Good-bye, Jim. God bless you!\" She felt herself being helped aboard by Dan; she tried to wave her hand to Jim. The car moved, the whistling and ringing of the bell told of their departure. \n \n It was Henry who led her to a chair and left her there. That day he paid in full for his life\u0027s misdeeds. \n \n Jim never attempted to see the receding car; he could hear the noise of the departing train and the cries of the boys as they hooted their good-byes. \n \n \"Kiss the baby for me.\" It was big Bill\u0027s voice. \n \n \"What a baby Bill is himself!\" Jim found himself saying. \n \n \"Tell Sadie to write,\" called Shorty. \n \n \"Und say—say for me too, you bet.\" The voice of the German was drowned in the roar from the rest of the boys. Only Grouchy, in silence, looked on contemptuously. \n \n From down the platform came the yells of the men. Even Nick had deserted his bar. Still, Jim did not move. He could hear it all; he knew what was happening—that the train was steaming away. He found himself watching flies settle on a beer-glass. Then he fell into a chair, let his head slip on to his arms that lay across the table, his back to the big entrance and to the smaller one at the other side of the room. There was no movement from him that told of the agonies he was enduring. The flies buzzed at will about the place. \n \n The door at the side swung silently open and Nat-u-ritch slipped into the room. In her soft moccasins her steps made no sound. She crept towards Jim, amazed to see him lying thus. She shook her head—she could not understand this mystery. She was about to move closer to Jim when she heard some one coming. \n \n Through the door at the back she could see the crowds returning from the departed train, while from the other direction came Cash Hawkins—she could see him clearly. Closer came his steps. Quickly she slid behind the door, and from without peered into the saloon. Cash, aflame with passion and liquor, entered and saw that Jim was alone. \n \n He drew both his guns. With an evil smile he advanced upon Jim. \"Damn you, I\u0027ve got you!\" he hissed; but before he could pull the trigger there was a flash, a report, and Cash\u0027s hands were thrown up in a convulsive movement while he pitched forward on his face. Dazed, bewildered, Jim got to his feet and mechanically pulled his gun; then, before he was aware of what had happened, he was bending over the body of Hawkins. \n \n The report was followed by an excitable rush of the crowd into the saloon. The gamblers and cattlemen were headed by Bud Hardy, the County Sheriff. Big Bill, Andy, Grouchy, and Shorty went at once to Jim, who still stood close to the prostrate figure cf Cash Hawkins. Pete quickly knelt beside the body, and turned Cash over to examine him. Bud Hardy stood in the centre of the room. \n \n \"Hold on there! Nobody leaves without my permission.\" Then to Pete, \"How is he?\" \n \n \"He\u0027s cashed in, Sheriff. Plumb through the heart. Don\u0027t think I ever see neater work.\" He laid the body on its back and crossed the arms over the breast. \n \n Hardy walked direct to Jim. \"Jim Carston, hand over your gun.\" \n \n \"And who are you?\" Jim asked, as he looked at the tall, bulky figure of Bud Hardy. He had forgotten that Bill, earlier in the afternoon, had pointed out this man to him, and warned him of his friendship with Cash Hawkins. \n \n Gathered about Bud were Hawkins\u0027s faction, who resented the Englishman\u0027s presence among them, and with them several who, only a few hours ago, had been cheering Jim. Bud Hardy answered his question with tolerant amusement. \n \n \"The County Sheriff,\" he said. \n \n To the surprise of all, Jim advanced and handed his gun to Bud. \n \n \"Come on, you\u0027re my prisoner.\" Even Bud felt that this was extremely difficult. No resistance from the prisoner—no denial! It was unusual. But as he stepped towards Jim he was stopped by Bill. \n \n \"Wait a minute, Bud; don\u0027t be in such a ferocious hurry. Where you goin\u0027 to take him to?\" \n \n Bill\u0027s heart beat fast, but he gave no sign of the fear that filled him. He knew what this might mean for the boss. The faces of the other men of Jim\u0027s ranch grew gray—they too realized, far more than Jim did, that it was not the justice of the law that was to be his, but—well, the crowds grew blood-thirsty sometimes in Maverick. They had seen sights that the boss had not—an ugly swinging vision passed before their eyes, but no hint was given of this by the men. Each one knew that it would be the most unwise move they could make for the boss\u0027s sake. \n \n Bill\u0027s big, slow voice was heard again in its careless drawl. \"Wait a minute, Bud; don\u0027t be in such a ferocious hurry. Where you goin\u0027 to take him to?\" \n \n \"County jail, of course, at Jansen,\" was Hardy\u0027s answer. \n \n Bill then asked, as he surveyed Hawkins\u0027s gang, who were whispering together with several of the hangers-on of the place, \"How do you know the friends of the deceased won\u0027t take him away from you and hang him to the nearest telegraph-pole, eh?\" \n \n It was lightly said, and as he said it Bill laid his big hand on Bud\u0027s shoulder. He must conciliate the Sheriff, gain time—anything. \n \n But Bud shook Bill off. \"Are you goin\u0027 to interfere with me in the discharge of my duty?\" he blustered. \n \n \"Not a bit, Bud, not a bit,\" Bill said; then, with sudden resolve—it would mean his life, and the lives of others against them, perhaps, but he meant to fight if necessary—he added: \"But we\u0027re goin\u0027 to see that you do it. We ain\u0027t afraid of a trial and a jury.\" He took the crowd into his confidence. \"There isn\u0027t a jury in the State that wouldn\u0027t present the prisoner with a vote of thanks and a silver service for gettin\u0027 rid of Cash Hawkins.\" \n \n He turned to Bud with his men about him. \"Who\u0027s goin\u0027 to help you take him seventy-five miles to jail?\" he demanded. \"Will you swear us in?\" \n \n But Bud only answered, \"You can\u0027t intimidate me, Bill.\" \n \n \"As defunct has a gun in each hand it\u0027s a plain case of self-defence, anyway.\" Bill pointed to the two revolvers still clutched in the dead man\u0027s stiffening hands. \n \n \"I don\u0027t stand for this,\" thundered Bud. \"Clear the room.\" \n \n He had been rather a friend of Big Bill\u0027s—most of them were in Maverick—so he had listened to him longer than he would have to any of the other men, but now he was through with his arguments, he must assert his authority. \n \n \"Clear the room; this prisoner goes with me.\" \n \n There was a movement from the crowd. Bill looked appealingly at Jim. Why would not the boss speak? Just as the crowds had reached the doors Jim said to Bud, who was advancing to formally arrest him: \n \n \"Wait a minute. Take the trouble to examine my gun.\" \n \n Bud lifted Jim\u0027s gun and looked at it closely. \"Well?\" he asked. \n \n \"You see it hasn\u0027t been discharged.\" \n \n Bud quickly verified the fact that the gun was completely loaded. He paused a moment irresolute. Then, with a sudden suspicion, he said: \n \n \"You\u0027ve had time to reload it.\" \n \n The men were eagerly watching the scene between the two men. \n \n \"Smell it,\" Jim said, quietly. \"I haven\u0027t had time to clean it.\" \n \n \"Ah!\" Bill breathed. It was like Jim to play the trump card. \n \n Bud Hardy lifted the revolver to his nose. It was as clean and fresh-smelling as a bit of cold steel. There could be no doubt that it had not been used, and Jim had all these men as witnesses to prove it. It would be useless to try to make a case of this. Bud knew when he was beaten. He took the revolver and handed it to Jim. \n \n \"Well, who did it, then?\" He glanced at Jim\u0027s men. \"Would you\u0027s all oblige me by giving me a sniff of your guns?\" \n \n The relief was so great that the men hysterically crowded Bud, and almost as one man they thrust their revolvers into Bud\u0027s face. \n \n \"Here\u0027s my smoke,\" said one. \n \n Bud drew back. \"One at a time—one at a time,\" he gasped—\"if you please.\" \n \n Then one by one the men filed past him as each held his revolver to Bud\u0027s nose. \n \n \"Here\u0027s my smoke-machine,\" Bill said. It was passed by Bud without a word. \n \n \"Und mine,\" said Andy. \n \n Grouchy jerked his into Bud\u0027s face with the words, \"Here\u0027s mine, and not a notch on it.\" And Bud could not deny the truth of the assertion. \n \n All that Shorty nervously demanded was, \"How\u0027s that?\" as he jerked the revolver into Bud\u0027s face. \n \n In Maverick this was evidence enough for Bud—evidence that so far all were free to go. \n \n \"Why didn\u0027t you\u0027s all say so before?\" he growled, annoyed at the turn affairs had taken. Then he saw the expression on their faces, laughter and glee as they crowded around Jim; when they looked at him, tolerant amusement. The smelling of the smoke-machines they regarded as a fine new move on their part. \n \n \"Damn it,\" Bud thundered. \"You\u0027ve been astringin\u0027 me while the guilty man\u0027s escaped; but I\u0027ll git him—I\u0027ll git him yet.\" \n \n Jim saved! It was all that the boys wanted. With a whoop-la, they tore after Bud. Down the platform they fled, all in excitement with the new sensation of the moment—the hunt with Bud for the guilty man. \n \n Near the table lay a gray glove. Jim stooped and picked it up, and put it quietly to his lips. Bill, who had lingered near the door, suddenly turned and came back to Jim and put his arm about him. \n \n \"You just escaped lynchin\u0027, Jim.\" And Jim knew that Bill spoke the truth. \n \n He held the glove folded close in his hand as he answered, \"Yes, I\u0027m almost sorry.\" \n \n Bill\u0027s face became grave. What did the boss mean? Was the game too hard for him? Was he afraid he would lose on the ranch deal? He patted him tenderly, almost like a mother humoring a wayward child, without saying a word. Jim sank into a chair. Bill understood—the boss would like to be alone, so he sauntered up to the back and joined Nick. In his heart there was but one thought: Jim should see how well they would all serve him. He swore a mighty oath that he would see the others did so, too. \n \n Left alone, Jim sat staring straight ahead of him. Suddenly he realized that the body of Cash Hawkins was still lying there. He shuddered at the cruel forgetfulness of the men. He leaned forward and spoke his thoughts aloud: \n \n \"Who killed Cash Hawkins?\" \n \n He felt a sudden touch on his hand; he turned; there, kneeling at his feet, was Nat-u-ritch, who had entered unobserved and crept beside him. As he looked at her she drew herself up nearer to him, and, leaning her chin on her hand, said: \n \n \"Me kill um.\" \n \n Jim\u0027s only answer was to place his hand over her face while he hurriedly looked about the saloon. No one could have heard her. He drew her to her feet and motioned her to go, saying that he would follow shortly. \n \n That night Jim learned the truth, and his friendship with Nat-u-ritch began. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2048/58386.html","bookId":576,"book":{"id":576,"title":"The Squaw Man","description":"简介： It was Jim\u0027s last day at home. He stood in the centre of the fragrant garden and watched the glory of color suffusing the Surrey hills towards the west. With a sigh he turned away and walked to the house....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2048","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
