{"id":71144,"no":1,"title":"Page 1","content":"KEEP YOUR FRIENDS CLOSE….\n Have you ever had a friend turn on you? Just totally transform from someone you thought you knew into someone…else? I’m not talking your boyfriend from nursery school who grows up and gets gawky and ugly and zitty, or your friend from camp whom you’ve got nothing to say to when she comes to visit you over Christmas break, or even a girl in your clique who suddenly breaks away and turns goth or into one of those granola Outward Bound kids. No. I’m talking about your soul mate. The girl you know everything about. Who knows everything about you. One day she turns around and is a completely different person.\n Well, it happens. It happened in Rosewood.\n “Watch it, Aria. Your face is going to freeze like that.” Spencer Hastings unwrapped an orange Popsicle and slid it into her mouth. She was referring to the squinty-eyed drunk-pirate face her best friend, Aria Montgomery, was making as she tried to get her Sony Handycam to focus.\n “You sound like my mom, Spence.” Emily Fields laughed, adjusting her T-shirt, which had a picture of a baby chicken in goggles on it and said, INSTANT SWIM CHICK! JUST ADD WATER! Her friends had forbidden Emily from wearing her goofy swimming T-shirts—\n “Instant Swim Dork! Just add loser!” Alison DiLaurentis had joked when Emily walked in.\n “Your mom says that too?” Hanna Marin asked, throwing away her green-stained Popsicle stick. Hanna always ate faster than anyone else. “Your face will freeze that way,” she mimicked.\n Alison looked Hanna up and down and cackled. “Your mom should’ve warned you that your butt would freeze that way.”\n Hanna’s face fell as she pulled down her pink-and-white striped T-shirt—she’d borrowed it from Ali, and it kept riding up, revealing a white strip of her stomach. Alison tapped Hanna’s shin with her flip-flop. “Just joking.”\n It was a Friday night in May near the end of seventh grade, and best friends Alison, Hanna, Spencer, Aria, and Emily were gathered in Spencer’s family’s plushly decorated family room, with the Popsicle box, a big bottle of cherry vanilla Diet Dr Pepper, and their cell phones splayed out on the coffee table. A month ago, Ali had come to school with a brand-new LG flip phone, and the others had rushed out to buy their own that very day. They all had pink leather holsters to match Ali’s, too—well, all except for Aria, whose holster was made of pink mohair. She’d knitted it herself.\n Aria moved the camera’s lever back and forth to zoom in and out. “And anyway, my face isn’t going to freeze like this. I’m concentrating on setting up this shot. This is for posterity. For when we become famous.”\n “Well, we all know I’m going to get famous.” Alison thrust back her shoulders and turned her head to the side, revealing her swanlike neck.\n “Why are you going to be famous?” Spencer challenged, sounding bitchier than she probably meant to.\n “I’m going to have my own show. I’ll be a smarter, cuter Paris Hilton.”\n Spencer snorted. But Emily pursed her pale lips, considering, and Hanna nodded, truly believing. This was Ali. She wouldn’t stay here in Rosewood, Pennsylvania, for long. Sure, Rosewood was glamorous by most standards—all its residents looked like walk-on models for a Town \u0026 Country photo shoot—but they all knew Ali was destined for greater things.\n She’d plucked them out of oblivion a year and a half ago to be her best friends. With Ali by their sides, they had become the girls of Rosewood Day, the private school they attended. They had such power now—to deem who was cool and who wasn’t, to throw the best parties, to nab the best seats in study hall, to run for student office and win by an overwhelming number of votes. Well, that last one only applied to Spencer. Aside from a few twists and turns—and accidentally blinding Jenna Cavanaugh, which they tried their hardest not to think about—their lives had transformed from passable to perfect.\n “How about we film a talk show?” Aria suggested. She considered herself the friends’ official filmmaker—one of the many things she wanted to be when she grew up was the next Jean-Luc Godard, some abstract French director.\n “Ali, you’re famous. And Spencer, you’re the interviewer.”\n “I’ll be the makeup girl,” Hanna volunteered, rooting through her backpack to find her polka-dotted vinyl makeup bag.\n “I’ll do hair.” Emily pushed her reddish-blond bob behind her ears and rushed to Ali’s side. “You have gorgeous hair, chérie,” she said to Ali in a faux-French accent.\n Ali slid her Popsicle out of her mouth. “Doesn’t chérie mean girlfriend?”\n The others were quick to laugh, but Emily paled. “No, that’s petite amie.” Lately, Em was sensitive when Ali made jokes at her expense. She never used to be.\n “Okay,” Aria said, making sure the camera was level.\n “You guys ready?”\n Spencer flopped on the couch and placed a rhinestone tiara left over from a New Year’s party on her head. She’d been carrying the crown around all night.\n “You can’t wear that,” Ali snapped.\n “Why not?” Spencer adjusted the crown so it was straight.\n “Because. If anything, I’m the princess.”\n “Why do you always get to be the princess?” Spencer muttered under her breath. A nervous ripple swept through the others. Spencer and Ali weren’t getting along, and no one knew why.\n Ali’s cell phone let out a bleat. She reached down, flipped it open, and tilted it away so no one else could see. “Sweet.” Her fingers flew across the keypad as she typed a text.\n “Who are you writing to?” Emily’s voice sounded eggshell-thin and small.\n “Can’t tell. Sorry.” Ali didn’t look up.\n “You can’t tell?” Spencer was irate. “What do you mean you can’t tell?”\n Ali glanced up. “Sorry, princess. You don’t have to know everything.” Ali closed her phone and set it on the leather couch. “Don’t start filming yet, Aria. I have to pee.” She dashed out of Spencer’s family room toward the hall bathroom, plopping her Popsicle stick in the trash as she went.\n Once they heard the bathroom door close, Spencer was the first to speak. “Don’t you just want to kill her sometimes?”\n The others flinched. They never bad-mouthed Ali. It was as blasphemous as burning the Rosewood Day official flag on school property, or admitting that Johnny Depp really wasn’t that cute—that he was actually kind of old and creepy.\n Of course, on the inside, they felt a little differently. This spring, Ali hadn’t been around as much. She’d gotten closer with the high school girls on her JV field hockey squad and never invited Aria, Emily, Spencer, or Hanna to join them at lunch or come with them to the King James Mall.\n And Ali had begun to keep secrets. Secret texts, secret phone calls, secret giggles about things she wouldn’t tell them. Sometimes they’d see Ali’s screen name online, but when they tried to IM her, she wouldn’t respond. They’d bared their souls to Ali—telling her things they hadn’t told the others, things they didn’t want anyone to know—and they expected her to reciprocate. Hadn’t Ali made them all promise a year ago, after the horrible thing with Jenna happened, that they would tell one another everything, absolutely everything, until the end of time?\n The girls hated to think of what eighth grade would be like if things kept going like this. But it didn’t mean they hated Ali.\n Aria wound a piece of long, dark hair around her fingers and laughed nervously. “Kill her because she’s so cute, maybe.” She hit the camera’s power switch, turning it on.\n “And because she wears a size zero,” Hanna added.\n “That’s what I meant.” Spencer glanced at Ali’s phone, which was wedged between two couch cushions. “Want to read her texts?”\n “I do,” Hanna whispered.\n Emily stood up from her perch on the couch’s arm. “I don’t know….” She started inching away from Ali’s phone, as if just being close to it incriminated her.\n Spencer scooped up Ali’s cell. She looked curiously at the blank screen. “C’mon. Don’t you want to know who texted her?”\n “It was probably just Katy,” Emily whispered, referring to one of Ali’s hockey friends. “You should put it down, Spence.”\n Aria took the camera off the tripod and walked toward Spencer. “Let’s do it.”\n They gathered around. Spencer opened the phone and pushed a button. “It’s locked.”\n “Do you know her password?” Aria asked, still filming.\n “Try her birthday,” Hanna whispered. She took the phone from Spencer and punched in the digits. The screen didn’t change. “What do I do now?”\n They heard Ali’s voice before they saw her. “What are you guys doing?”\n Spencer dropped Ali’s phone back onto the couch. Hanna stepped back so abruptly, she banged her shin against the coffee table.\n Ali stomped through the door to the family room, her eyebrows knitted together. “Were you looking at my phone?”\n “Of course not!” Hanna cried.\n “We were,” Emily admitted, sitting on the couch, then standing up again. Aria shot her a look and then hid behind the camera lens.\n But Ali was no longer paying attention. Spencer’s older sister, Melissa, a senior in high school, burst into the Hastings’ kitchen from the garage. A takeout bag from Otto, a restaurant near the Hastings’ neighborhood, hung from her wrists. Her adorable boyfriend, Ian, was with her. Ali stood up straighter. Spencer smoothed her dirty-blond hair and straightened her tiara.\n Ian stepped into the family room. “Hey, girls.”\n “Hi,” Spencer said in a loud voice. “How are you, Ian?”\n “I’m cool.” Ian smiled at Spencer. “Cute crown.”\n “Thanks!” Spencer fluttered her coal-black eyelashes.\n Ali rolled her eyes. “Be a little more obvious,” she singsonged under her breath.\n But it was hard not to crush on Ian. He had curly blond hair, perfect white teeth, and stunning blue eyes, and none of them could forget the recent soccer game where he’d changed his shirt midquarter and, for five glorious seconds, they’d gotten a full-on view of his naked chest. It was almost universally believed that his gorgeousness was wasted on Melissa, who was totally prudish and acted way too much like Mrs. Hastings, Spencer’s mother.\n Ian plopped down on the edge of the couch near Ali. “So, what are you girls doing?”\n “Oh, not much,” Aria said, adjusting the camera’s focus. “Making a film.”\n “A film?” Ian looked amused. “Can I be in it?”\n “Of course,” Spencer said quickly. She plopped down on the other side of him.\n Ian grinned into the camera. “So what are my lines?”\n “It’s a talk show,” Spencer explained. She glanced at Ali, gauging her reaction, but Ali didn’t respond. “I’m the host. You and Ali are my guests. I’ll do you first.” \n","sourceLink":"https://allnovel.net/perfect-pretty-little-liars-3/page-1.html","bookId":2380,"book":{"id":2380,"title":"Perfect (Pretty Little Liars #3)","description":"Storyline: \n Perfect (Pretty Little Liars #3) \n In Rosewood, Pennsylvania, four perfect-looking girls aren\u0027t nearly as perfect as they seem. \n Aria can\u0027t resist her forbidden ex. Hanna is on the verge of losing her BFF. Emily is freaking out over a simple kiss. And Spencer can\u0027t keep her hands off anything that belongs to her sister. \n Lucky me. I know these pretty little liars better than they know themselves. But it\u0027s hard keeping all of their secrets to myself. They better do as I say . . . or else!\n \n","cover":"https://allnovel.net/images/perfect-pretty-little-liars-3.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/perfect-pretty-little-liars-3.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:19:06 AM"}}
