{"id":71155,"no":12,"title":"Page 12","content":"“So why didn’t you tell me about it?”\\n\\n Aria glanced at him. “Byron told me not to.”\\n\\n Mike took a violent bite of PowerBar. “It was okay, though, to tell Alison DiLaurentis. And it’s okay for her to say it in a video that’s all over the news.”\\n\\n “Mike…” Aria started. “I didn’t tell her. She was with me when it happened.”\\n\\n “Whatever,” Mike grunted, colliding with the shark mascot as he pushed angrily through the natatorium’s double doors. Aria considered going after him but didn’t. She was reminded, suddenly, of the time in Reykjavík when she was supposed to baby-sit Mike but had gone off to the Blue Lagoon geothermal spa with her boyfriend, Hallbjorn, instead. When she returned, smelling like sulfur and covered in curative salt, she’d discovered that Mike had set half the backyard’s wood trellis on fire. Aria had gotten in deep trouble for it—and really, it had been her fault. She’d noticed Mike eagerly eyeing the kitchen matches before she left for the lagoon. She could have stopped him. She probably could have stopped Byron, too.\\n\\n “So this one’s yours,” Sean said, leading Aria down his mahogany-floored, immaculately clean hallway to a large, white bedroom. It had a bay window with a window seat, gauzy white curtains, and a white bouquet of flowers on the end table.\\n\\n “I love it.” The room looked like the Parisian boutique hotel room her family stayed in the time her father was interviewed on Parisian television for being an expert on gnomes. “You sure it’s okay for me to stay?”\\n\\n “Of course.” Sean gave her a demure kiss on the cheek. “I’ll let you get settled.”\\n\\n Aria looked out the window at the pinkish, late-Tuesday sky and couldn’t help comparing this view to hers at home. The Ackards’ estate was nestled in the deep woods and surrounded by at least ten acres of untouched land. The nearest property, a castlelike monolith with medieval-style turrets, was at least three football fields away. Aria’s house was in a lovely but rickety neighborhood close to the college. The only thing she could see of her neighbors’ yard was their unfortunate collection of birdbaths, stone animals, and lawn jockeys.\\n\\n “Everything okay with the room?” Mrs. Ackard, Sean’s stepmother, asked as Aria drifted downstairs into the kitchen.\\n\\n “It’s great,” Aria said. “Thank you so much.”\\n\\n Mrs. Ackard gave her a sweet smile in return. She was blond, a bit pudgy, with inquisitive blue eyes and a mouth that looked like it was smiling even when she wasn’t. When Aria closed her eyes and pictured a mom, Mrs. Ackard was pretty much what she imagined. Sean had told her that before she married his dad she’d worked as a magazine editor in Philadelphia, but now she was a fulltime housewife, keeping the Ackards’ monstrous house looking photo-shoot ready at all times. The apples in the wooden bowl on the island were unbruised, the magazines in the living room rack all faced the same direction, and the tassels on the giant Oriental rug were even, as if they’d just been combed.\\n\\n “I’m making mushroom ravioli,” Mrs. Ackard said, inviting Aria to come over and smell a pot of sauce.\\n\\n “Sean said you’re a vegetarian.”\\n\\n “I am,” Aria answered softly. “But you didn’t have to do that for me.”\\n\\n “It’s no trouble,” Mrs. Ackard said warmly. There were also scalloped potatoes, a tomato salad, and a loaf of the hearty, gourmet seven-grain bread from Fresh Fields that Ella always scoffed at, saying anyone who paid $10.99 for some flour and water ought to have his head examined.\\n\\n Mrs. Ackard pulled the wooden spoon out of the pot and rested it on the counter. “You were good friends with Alison DiLaurentis, weren’t you? I saw that video of you girls on the news.”\\n\\n Aria ducked her head. “That’s right.” A lump grew in her throat. Seeing Ali so alive in that video had brought Aria’s grief to the surface all over again.\\n\\n To Aria’s surprise, Mrs. Ackard wrapped her arm around her shoulder and gave her a little squeeze. “I’m so sorry,” she murmured. “I can’t imagine what that’s like.”\\n\\n Tears prickled at Aria’s eyes. It felt good to be nestled in a mom’s arms, even if she wasn’t her mom.\\n\\n Sean sat next to Aria at dinner, and everything was the antithesis of how it went at Aria’s house. The Ackards put their napkins on their laps, there was no television news droning in the background, and Mr. Ackard, who was rangy and balding but had a charismatic smile, didn’t read the newspaper at the table. The younger Ackard twins, Colin and Aidan, kept their elbows off the table and didn’t poke each other with their forks—Aria could only imagine what atrocities Mike would commit if he had a twin.\\n\\n “Thank you,” Aria said as Mrs. Ackard poured more milk in her glass, even though Byron and Ella had always said milk contained synthetic hormones and caused cancer. Aria had told Ezra about her parents’ ban on milk the evening she’d spent at his apartment a few weeks ago. Ezra had laughed, saying his family had their freak-show granola moments, too.\\n\\n Aria laid down her fork. How had Ezra crept into her peaceful dinnertime thoughts? She quickly eyed Sean, who was chewing a forkful of potatoes. She leaned over and touched his wrist. He smiled.\\n\\n “Sean tells us you’re taking AP classes, Aria,” Mr. Ackard said, spearing a carrot.\\n\\n Aria shrugged. “Just English and AP studio art.”\\n\\n “English lit was my major in college,” Mrs. Ackard said enthusiastically. “What are you reading right now?”\\n\\n “The Scarlet Letter.”\\n\\n “I love that book!” Mrs. Ackard cried, taking a small sip of red wine. “It really shows how restrictive the Puritan society used to be. Poor Hester Prynne.”\\n\\n Aria chewed on the inside of her cheek. If only Aria had talked to Mrs. Ackard before she branded Meredith.\\n\\n “The Scarlet Letter.” Mr. Ackard put his finger to his lips. “They made that into a movie, didn’t they?”\\n\\n “Uh-huh,” Sean said. “With Demi Moore.”\\n\\n “The one where the man falls in love with a younger girl, right?” Mr. Ackard added. “So scandalous.”\\n\\n Aria drew in her breath. She felt like everyone was looking at her, but in reality, only Sean was. His eyes were wide and drawn down, mortified. I’m sorry, his expression said. “No, David,” Mrs. Ackard said quietly, in a voice that indicated she had some idea of Aria’s situation. “That’s Lolita.”\\n\\n “Oh. Right.” Mr. Ackard shrugged, apparently not realizing his faux pas. “I get them all mixed up.”\\n\\n After dinner, Sean and the twins went upstairs to do their homework, and Aria followed. Her guest room was quiet and inviting. Some time between dinner and now, Mrs. Ackard had put a box of Kleenex and a vase of lavender on her nightstand. The flowers’ grandmotherly smell filled the room. Aria flopped on her bed, switched on the local news for company, and opened Gmail on her laptop. There was one new note. The name of the sender was a series of garbled letters and numbers. Aria felt her heart stop as she double-clicked it open.\\n\\n Aria: Don’t you think Sean should know about that extra-credit work you did with a certain English teacher? Real relationships are built on truth, after all.\\n\\n —A\\n\\n Just then, the central heating shut off, making Aria sit up straighter. Outside, a twig snapped. Then another. Someone was watching.\\n\\n She crept to the window and peered out. The pine trees cast lumpy shadows across the tennis court. A security camera perched on the edge of the house slowly swiveled from right to left. There was a flicker of light, then nothing.\\n\\n When she looked back into her room, something on the news caught her eye. New stalker sighting, the banner at the bottom of the screen said. “We’ve received news that a few people have seen the Rosewood Stalker,” said a reporter, as Aria turned up the volume. “Stand by for details.”\\n\\n There was an image of a police car in front of a behemoth of a house with castlelike turrets. Aria turned to the window again—there they were. And sure enough, a blue police siren was now flashing against the far-off pines.\\n\\n She stepped into the hall. Sean’s door was shut; Bloc Party drifted out. “Sean?” She pushed his bedroom door open. His books were strewn all over his desk, but his desk chair was empty. There was an indentation on his perfectly made bed where his body had been. His window was open, and a chilly breeze blew in, making the curtains dance like ghosts.\\n\\n Aria didn’t know what else to do, so she went back to her computer. That’s when she saw a new e-mail.\\n\\n P.S. I may be a bitch, but I’m not a murderer. Here’s a clue for the clueless: someone wanted something of Ali’s. The killer is closer than you think.\\n\\n —A\\n\\n 12\\n\\n AH, COURT LIFE\\n\\n Tuesday evening, Hanna strolled down the main concourse at the King James Mall, puzzling over her BlackBerry. She’d sent Mona a text asking R we still meeting 4 my dress fitting? but she hadn’t received a response.\\n\\n Mona was probably still annoyed at her because of the Frenniversary thing, but whatever. Hanna had tried to explain why her old friends had been at her house, but Mona had interrupted her before she could even start, declaring in her frostiest voice, “I saw you and your besties on the news. Congrats on your big TV debut.” Then she hung up. So sure she was pissed, but Hanna knew Mona couldn’t stay mad for long. If she did, who would be her BFF?\\n\\n Hanna passed Rive Gauche, the mall brasserie where they were supposed to have their Frenniversary dinner yesterday. It was a copy of Balthazar in New York, which was a copy of zillions of cafés in Paris. She caught sight of a group of girls at Hanna’s and Mona’s favorite banquette. One of the girls was Naomi. The next was Riley. And the girl next to her was…Mona.\\n\\n Hanna did a double take. What was Mona doing with…them?\\n\\n Even though the lights in Rive Gauche were dim and romantic, Mona was wearing her pink-tinted aviators. Naomi, Riley, Kelly Hamilton, and Nicole Hudson—Naomi and Riley’s bitchy sophomore toadies—surrounded her, and a big, uneaten plate of fries sat in the middle of the table. Mona appeared to be telling a story, waving her hands around animatedly and widening her big, blue eyes. She came to a punch line, and the others hooted.\\n\\n Hanna squared her shoulders. She strode through the café’s antique brown door. Naomi was the first to notice her. Naomi nudged Kelly, and they whispered together.\\n\\n “What are you girls doing here?” she demanded, standing over Riley and Naomi.\\n\\n Mona leaned forward on her elbows. “Well, isn’t this a surprise? I didn’t know if you still wanted to be on the court, since you’re so busy with your old friends.” She flicked her hair over her shoulder and took a sip of Diet Coke.\\n\\n Hanna rolled her eyes and settled on the end of the dark red banquette bench. “Of course I still want to be on your court, drama whore.”\\n\\n Mona gave her a bland smile. “’Kay, tubbykins.”\\n\\n “Bitch,” Hanna shot back.\\n\\n “Slut,” Mona said. Hanna giggled…and so did Naomi, Riley, and the others. Sometimes she and Mona got in mock-fights like this, although normally they didn’t have an audience. \\n\\n","sourceLink":"https://allnovel.net/perfect-pretty-little-liars-3/page-12.html","bookId":2380,"book":{"id":2380,"title":"Perfect (Pretty Little Liars #3)","description":"Storyline: Perfect (Pretty Little Liars #3) \\n In Rosewood, Pennsylvania, four perfect-looking girls aren\u0027t nearly as perfect as they seem. \\n Aria can\u0027t resist her forbidden ex. Hanna is on the verge of losing her BFF. Emily is freaking out over a simple kiss. And Spencer can\u0027t keep her hands off anything that belongs to her sister. \\n Lucky me. I know these pretty little liars better than they know themselves. But it\u0027s hard keeping all of their secrets to myself. They better do as I say . . . or else!\\n","cover":"https://allnovel.net/images/perfect-pretty-little-liars-3.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/perfect-pretty-little-liars-3.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:19:06 AM"}}
