{"id":71176,"no":33,"title":"Page 33","content":"Aria felt sick. They all knew Spencer liked Ian. She talked about him constantly: how her sister didn’t deserve him, how he was so funny, how cute he was when he ate dinner at their house. And all of them had wondered if Ali was keeping a big secret—it could have been this. Ali must have told Spencer. And Spencer couldn’t deal.\\n\\n Aria put more pieces together. Ali had run out of Spencer’s barn…and turned up not that far away, in a hole in her own backyard. Spencer knew that the workers were going to fill the hole with concrete the very next day. A’s note had said: You all knew every inch of her backyard. But for one of you, it was so, so easy.\\n\\n Aria sat motionless for a few seconds, then picked up her own phone and dialed Emily’s number. The phone rang six times before Emily answered. “Hello?” Emily’s voice sounded like she’d been crying.\\n\\n “Did I wake you up?” Aria asked.\\n\\n “I haven’t gone to sleep yet.”\\n\\n Aria frowned. “Are you okay?”\\n\\n “No,” Emily’s voice cracked. Aria heard a sniffle. “My parents are sending me away. I’m leaving Rosewood in the morning. Because of A.”\\n\\n Aria leaned back. “What? Why?”\\n\\n “It’s not even worth getting into.” Emily sounded defeated.\\n\\n “You have to meet me,” Aria said. “Right now.”\\n\\n “Didn’t you hear what I said? I’m punished. I’m beyond punished.”\\n\\n “You have to.” Aria turned into the booth, trying to hide what she was about to say from the diner staff as best she could. “I think I know who killed Ali.”\\n\\n Silence. “No, you don’t,” Emily said.\\n\\n “I do. We have to call Hanna.”\\n\\n There was scratching at Emily’s end of the phone. After a short pause, her voice came back. “Aria,” she whispered, “I’m getting another call. It’s Hanna.”\\n\\n A shiver went through Aria. “Put her on three-way.”\\n\\n There was a click, and Aria heard Hanna’s voice. “You guys,” Hanna was saying. She sounded out of breath and the connection was rumbly, like Hanna was talking through a fan. “You’re not going to believe this. A messed up. I mean, I think A messed up. I got this note from this number and I suddenly knew whose number it was, and…”\\n\\n In the background, Aria heard a horn honk. “Meet me at our spot,” Hanna said. “The Rosewood Day swings.”\\n\\n “Okay,” Aria breathed. “Emily, can you come pick me up at the Hollis Diner?”\\n\\n “Sure,” Emily whispered.\\n\\n “Good,” Hanna said. “Hurry.”\\n\\n 35\\n\\n WORDS WHISPERED FROM THE PAST\\n\\n Spencer shut her eyes. When she opened them, she was standing outside the barn in her backyard. She looked around. Had she been transported here? Had she run out here and not remembered?\\n\\n Suddenly, the barn door swung open and Ali stormed out. “Fine,” Ali said over her shoulder, arms swinging confidently. “See ya.” She walked right past Spencer, as if Spencer were a ghost.\\n\\n It was the night Ali went missing again. Spencer started breathing faster. As much as she didn’t want to be here, she knew that she needed to see all of this—to remember as much as she could.\\n\\n “Fine!” she heard herself scream from inside the barn. As Ali stormed down the path, Spencer, younger and smaller, flew to the porch. “Ali!” the thirteen-year-old Spencer screamed, looking around.\\n\\n Then, it was like the seventeen-year-old Spencer and the thirteen-year-old Spencer merged into one. She could suddenly feel all the emotions of her younger self. There was fear: what had she done, telling Ali to leave? There was paranoia: none of them had ever challenged Ali. And Ali was angry with her. What was she going to do?\\n\\n “Ali!” Spencer screamed. The tiny, pagoda-shaped lanterns on the footpath back to the main house provided only a whisper of light. It seemed like things were moving in the woods. Years ago, Melissa had told Spencer that evil trolls lived in the trees. The trolls hated Spencer and wanted to hack off her hair.\\n\\n Spencer walked to where the path split: she could either go toward her house, or toward the woods that bounded her property. She wished she’d brought a flashlight. A bat swooped out of the trees. As it flew away, Spencer noticed someone far down the path near the woods, hunched over and looking at her cell phone. Ali.\\n\\n “What are you doing?” Spencer called out.\\n\\n Ali narrowed her eyes. “I’m going somewhere way cooler than hanging out with you guys.”\\n\\n Spencer stiffened. “Fine,” she said proudly. “Go.”\\n\\n Ali sank onto one hip. The crickets chirped at least twenty times before she spoke again. “You try to steal everything away from me. But you can’t have this.”\\n\\n “Can’t have what?” Spencer shivered in her tissue-thin T-shirt.\\n\\n Ali laughed nastily. “You know.”\\n\\n Spencer blinked. “No…I don’t.”\\n\\n “Come on. You read about it in my diary, didn’t you?”\\n\\n “I wouldn’t read your stupid diary,” Spencer spat. “I don’t care.”\\n\\n “Right.” Ali took a step toward Spencer. “You care way too much.”\\n\\n “You’re delusional,” Spencer sputtered.\\n\\n “No, I’m not.” Ali was right next to her now. “You are.”\\n\\n Anger boiled up inside Spencer, and she shoved Ali on the shoulder. It was forceful enough to make Ali stagger back, losing her footing on the path’s rocks, which were slippery with dew. The older Spencer winced. She felt like she was a pawn, being dragged along for the ride. A look of surprise crossed Ali’s face, but it quickly turned to mocking. “Friends don’t shove friends.”\\n\\n “Well, maybe we’re not friends,” Spencer said.\\n\\n “Guess not,” Ali said. Her eyes danced. The look on her face indicated she had something really juicy to say. There was a long pause before she spoke, as if she was considering her words very, very carefully. Hang on, Spencer urged herself. REMEMBER.\\n\\n “You think kissing Ian was so special,” Ali growled.\\n\\n “But you know what he told me? That you didn’t even know how.”\\n\\n Spencer searched Ali’s face. “Ian…wait. Ian told you that? When?”\\n\\n “When we were on our date.”\\n\\n Spencer stared at her.\\n\\n Ali rolled her eyes. “You’re so lame, acting like you don’t know we’re together. But of course you do, Spence. That’s why you liked him, isn’t it? Because I’m with him? Because your sister’s with him?” She shrugged. “The only reason he kissed you the other night was because I asked him to. He didn’t want to, but I begged.”\\n\\n Spencer’s eyes boggled. “Why?”\\n\\n Ali shrugged. “I wanted to see if he would do anything for me.” Her face went into a mock pout. “Oh, Spence. Did you really believe he liked you?”\\n\\n Spencer took a step back. Lightning bugs strobed in the sky. There was a poisonous smile on Ali’s face. Don’t do it, Spencer screamed to herself. Please! It doesn’t matter! Don’t!\\n\\n But it happened anyway. Spencer reached out and pushed Ali as hard as she could. Ali slid backward, her eyes widening in alarm. She fell straight into the stone wall that surrounded the Hastings property. There was a terrible crack. Spencer covered her eyes and turned away. The air smelled metallic, like blood. An owl screeched in the trees.\\n\\n When she took her hands away from her eyes, she was back in her bedroom again, curled up and screaming.\\n\\n Spencer sat up and checked the clock. It was 2:30 A.M. Her head throbbed. The lights were all still on, she was lying on top of her covers, and she was still wearing her black party dress and Elsa Peretti silver bean necklace. She hadn’t washed her face or brushed her hair one hundred times, her typical before-bed rituals. She ran her hands over her arms and legs. There was a purplish bruise on her thigh. She touched it and it ached.\\n\\n She clapped a hand over her mouth. That memory. She instantly knew all of it was true. Ali was with Ian. And she had forgotten all of it. That was the part of the night that was missing.\\n\\n She walked to her door, but the handle wouldn’t turn. Her heart started to pound. “Hello?” she called tentatively. “Is someone there? I’m locked in.”\\n\\n No one answered.\\n\\n Spencer felt her pulse start to speed up. Something felt really, really wrong. Part of the night surged back to her. The Scrabble game. LIAR SJH. A sending Melissa the Golden Orchid essay. And…and then what? She cupped her hands over the crown of her head, as if trying to jostle the memory free. And then what?\\n\\n All at once, she couldn’t control her breathing. She started to hyperventilate, sinking to her knees on the ivory carpet. Calm down, she told herself, curling into a ball and trying to breathe easily in and out. But it felt like her lungs were filled with Styrofoam peanuts. She felt like she was drowning. “Help!” she cried weakly.\\n\\n “Spencer?” Her father’s voice emerged from the other side of the door. “What’s going on?”\\n\\n Spencer jumped up and ran to the door. “Daddy? I’m locked in! Let me out!”\\n\\n “Spencer, you’re in there for your own good. You scared us.”\\n\\n “Scared you?” Spencer asked. “H-how?” She stared at her reflection in the mirror on the back of her bedroom door. Yes, it was still her. She hadn’t woken up in someone else’s life.\\n\\n “We’ve taken Melissa to the hospital,” her father said.\\n\\n Spencer suddenly lost equilibrium. Melissa? Hospital? Why? She shut her eyes and saw a flash of Melissa falling away from her, down the stairs. Or was that Ali falling? Spencer’s hands shook. She couldn’t remember. “Is Melissa all right?”\\n\\n “We hope so. Stay there,” her father said from outside the door, sounding wary. Perhaps he was afraid of her—perhaps that was why he wasn’t coming in.\\n\\n She sat on her bed, stunned, for a long time. How could she not have remembered this? How could she not remember hurting Melissa? What if she did lots of horrible things and, in the next second, erased them?\\n\\n Ali’s murderer is right in front of you, A had said. Just when Spencer was looking in the mirror. Could it be?\\n\\n Her cell phone, which was sitting on her desk, began to ring. Spencer stood up slowly and looked at the screen on her Sidekick. Hanna.\\n\\n Spencer opened her phone. She pressed her ear to the receiver.\\n\\n “Spencer?” Hanna jumped right in. “I know something. You have to meet me.”\\n\\n Spencer’s stomach tightened and her mind whirled. Ali’s killer is right in front of you. She killed Ali. She didn’t kill Ali. It was like pulling petals off a flower: he loves me, he loves me not. Perhaps she could meet Hanna and…and what? Confess?\\n\\n No. It couldn’t be true. Ali had turned up in a hole in her backyard…not on the path against the stone wall. Spencer couldn’t have carried Ali to her backyard. She wasn’t strong enough, right? She wanted to tell someone about this. Hanna. And Emily. Aria, too. They would tell her she was crazy, that she couldn’t have killed Ali. \\n\\n","sourceLink":"https://allnovel.net/perfect-pretty-little-liars-3/page-33.html","bookId":2380,"book":{"id":2380,"title":"Perfect (Pretty Little Liars #3)","description":"Storyline: Perfect (Pretty Little Liars #3) \\n In Rosewood, Pennsylvania, four perfect-looking girls aren\u0027t nearly as perfect as they seem. \\n Aria can\u0027t resist her forbidden ex. Hanna is on the verge of losing her BFF. Emily is freaking out over a simple kiss. And Spencer can\u0027t keep her hands off anything that belongs to her sister. \\n Lucky me. I know these pretty little liars better than they know themselves. But it\u0027s hard keeping all of their secrets to myself. They better do as I say . . . or else!\\n","cover":"https://allnovel.net/images/perfect-pretty-little-liars-3.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/perfect-pretty-little-liars-3.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:19:06 AM"}}
