{"id":71150,"no":7,"title":"Page 7","content":"“Yeah,” Spencer mumbled.\\n\\n “He’s in your neighborhood. Hanging out in the woods.”\\n\\n Spencer dodged a divot in the dry grass. “It’s probably just some loser,” she huffed. But Spencer couldn’t help but think of A. How many times had A texted her about something that it seemed no one could have seen? Now she looked out into the trees, almost certain she’d see a shadowy figure. But there was no one.\\n\\n They started running normally again, passing the Rosewood Day duck pond, the sculpture garden, and the cornfields. When they looped toward the bleachers, Kirsten squinted and pointed toward the low metal benches that held the girls’ hockey equipment. “Is that your sister?”\\n\\n Spencer flinched. Melissa was standing next to Ian Thomas, their new assistant coach. It was the very same Ian Thomas Melissa had dated when Spencer was in seventh grade—and the same Ian Thomas who had kissed Spencer in her driveway years ago.\\n\\n They finished their loop and Spencer came to a halt in front of Melissa and Ian. Her sister had changed into an outfit that was nearly identical to what their mother had been wearing earlier: stovepipe jeans, white tee, and an expensive Dior watch. She even wore Chanel No. 5, just like Mom. Such a good little clone, Spencer thought. “What are you doing here?” she demanded, out of breath.\\n\\n Melissa leaned her elbow on one of the Gatorade jugs resting on the bench, her antique gold charm bracelet tinkling against her wrist. “What, a big sister can’t watch her little sister play?” But then her saccharine smile faded, and she snaked an arm around Ian’s waist. “It also helps that my boyfriend’s the coach.”\\n\\n Spencer wrinkled her nose. She’d always suspected Melissa had never gotten over Ian. They’d broken up shortly after graduation. Ian was still as cute as ever, with his blond, wavy hair, beautifully proportioned body, and lazy, arrogant smile. “Well, good for you,” Spencer answered, wanting out of this conversation. The less she spoke to Melissa, the better—at least until the Golden Orchid thing was over. If only the judges would hurry the hell up and knock Spencer’s plagiarized paper out of the running.\\n\\n She reached for her gear bag, pulled out her shin guards, and fastened one around her left shin. Then she fastened the other around her right. Then she unfastened both, refastening them much tighter. She pulled up her socks and then pulled them down again. Repeat, repeat, repeat.\\n\\n “Someone’s awfully OCD today,” Melissa teased. She turned to Ian. “Oh, did you hear the big Spencer news? She won the Golden Orchid. The Philadelphia Sentinel is coming over to interview her this week.”\\n\\n “I didn’t win,” Spencer barked quickly. “I was only nominated.”\\n\\n “Oh, I’m sure you will win,” Melissa simpered, in a way Spencer couldn’t quite read. When her sister gave Spencer a wink, she felt a pinch of terror. Did she know?\\n\\n Ian let out a whistle. “A Golden Orchid? Damn! You Hastings sisters—smart, beautiful, and athletic. You should see the way Spence tears up the field, Mel. She plays a mean center.”\\n\\n Melissa pursed her shiny lips, thinking. “Remember when Coach had me play center because Zoe had mono?” she chirped to Ian. “I scored two goals. In one quarter.”\\n\\n Spencer gritted her teeth. She’d known Melissa couldn’t be charitable for long. Yet again, Melissa had turned something completely innocent into a competition. Spencer scrolled through the long list in her head for an appropriate fake-nice insult but then decided to screw it. This wasn’t the time to pick a fight with Melissa. “I’m sure it rocked, Mel,” she conceded. “I bet you’re a way better center than I am.”\\n\\n Her sister froze. The little gremlin that Spencer was certain lived inside Melissa’s head was confused. Clearly it hadn’t expected Spencer to say something nice.\\n\\n Spencer smiled at her sister and then at Ian. He held her gaze for a moment and then gave her a little conspiratorial wink.\\n\\n Spencer’s insides flipped. She still got gooey when Ian looked at her. Even three years later, Spencer remembered every single detail about their kiss. Ian had been wearing a soft gray Nike T-shirt, green army shorts, and brown Merrills. He smelled like cut grass and cinnamon gum. One second, Spencer was giving him a good-bye peck on his cheek—she’d gone out to flirt, nothing more. The next second, he was pressing her up against the side of his car. Spencer had been so surprised, she’d kept her eyes open.\\n\\n Ian blew the whistle, breaking Spencer out of her thoughts. She jogged back to her team, and Ian followed. “All right, guys.” Ian clapped his hands. The team surrounded him, taking in Ian’s golden face longingly. “Please don’t hate me, but we’re going to do Indian sprints, crouching drills, and hill running today. Coach’s orders.”\\n\\n Everyone, including Spencer, groaned. “I told you not to hate me!” Ian cried.\\n\\n “Can’t we do something else?” Kirsten whined.\\n\\n “Just think how much butt you’re going to kick for our game against Pritchard Prep,” Ian said. “And how about this? If we get through the entire drill, I’ll take you guys to Merlin after practice tomorrow.”\\n\\n The hockey team whooped. Merlin was famous for its low-calorie chocolate ice cream that tasted better than the full-fat stuff.\\n\\n As Spencer leaned over the bench to fasten her shin guards—again—she felt Ian standing above her. When she glanced up at him, he was smiling. “For the record,” Ian said in a low voice, shadowing his face from her teammates, “you play center better than your sister does. No question about it.”\\n\\n “Thanks.” Spencer smiled. Her nose tickled with the smell of cut grass and Ian’s Neutrogena sunscreen. Her heart pitter-pattered. “That means a lot.”\\n\\n “And I meant the other stuff, too.” The left corner of Ian’s mouth pulled up into a half-smile.\\n\\n Spencer felt a faint, trembling thrill. Did he mean the “smart” and “beautiful” stuff? She glanced across the field to where Melissa was standing. Her sister leaned over her BlackBerry, not paying a bit of attention.\\n\\n Good.\\n\\n 7\\n\\n NOTHING LIKE AN OLD-FASHIONED INTERROGATION\\n\\n Monday evening, Hanna parked her Prius in her side driveway and hopped out. All she had to do was change clothes, and then she was off to meet Mona for their dinner. Showing up in her Rosewood Day blazer and pleated skirt would be an insult to the institution of Frenniversaries. She had to get out of these long sleeves—she’d been sweating all day. Hanna had spritzed herself with her Evian mineral water spray bottle about a hundred times on the drive home, but she still felt overheated.\\n\\n When she rounded the corner, she noticed her mother’s champagne-colored Lexus next to the garage and stopped short. What was her mom doing home? Ms. Marin usually worked über-long hours at McManus \u0026 Tate, her Philadelphia advertising firm. She often didn’t get back until after 10 P.M.\\n\\n Then Hanna noticed the four other cars, stuffed one after the other against the garage: the silver Mercedes coupe was definitely Spencer’s, the white Volvo Emily’s, and the clunky green Subaru Aria’s. The last car was a white Ford with the words ROSEWOOD POLICE DEPARTMENT emblazoned on the side.\\n\\n What the hell?\\n\\n “Hanna.”\\n\\n Hanna’s mother stood on the side porch. She still had on her sleek black pantsuit and high snakeskin heels.\\n\\n “What’s going on?” Hanna demanded, annoyed.\\n\\n “Why are my old friends here?”\\n\\n “I tried calling you. You didn’t pick up,” her mother said. “Officer Wilden wanted to ask you girls some questions about Alison. They’re out back.”\\n\\n Hanna pulled her BlackBerry out of her pocket. Sure enough, she had three missed calls, all from her mom.\\n\\n Her mother turned. Hanna followed her into the house and through the kitchen. She paused by the granite-topped telephone table. “Do I have any messages?”\\n\\n “Yes, one.” Hanna’s heart leapt, but then her mother added, “Mr. Ackard. They’re doing some reorganization at the burn clinic, and they won’t need your help anymore.”\\n\\n Hanna blinked. That was a nice surprise. “Anyone…else?”\\n\\n The corners of Ms. Marin’s eyes turned down, understanding. “No.” She gently touched Hanna’s arm. “I’m sorry, Han. He hasn’t called.”\\n\\n Despite Hanna’s otherwise back-to-perfect life, the silence from her father made her ache. How could he so easily cut Hanna out of his life? Didn’t he realize she’d had a very good reason to ditch their dinner and go to Foxy? Didn’t he know he shouldn’t have invited his fiancée, Isabel, and her perfect daughter, Kate, to their special weekend? But then, Hanna’s father would be marrying plain, squirrelly Isabel soon—and Kate would officially be his stepdaughter. Maybe he hadn’t called Hanna back because Hanna was one daughter too many.\\n\\n Whatever, Hanna told herself, taking off her blazer and straightening her sheer pink Rebecca Taylor camisole. Kate was a prissy bitch—if her father chose Kate over her, then they deserved each other.\\n\\n When she looked through the French doors to the back porch, Spencer, Aria, and Emily were indeed sitting around the giant teak patio table, the light from the stained-glass window sparkling against their cheeks. Officer Wilden, the newest member of Rosewood’s police force and Ms. Marin’s newest boyfriend, stood near the Weber grill.\\n\\n It was surreal to see her three ex–best friends here. The last time they’d sat on Hanna’s back porch had been at the end of seventh grade—and Hanna had been the dorkiest and ugliest of the group. But now, Emily’s shoulders had broadened and her hair had a slight greenish tint. Spencer looked stressed and constipated. And Aria was a zombie, with her black hair and pale skin. If Hanna was a couture Proenza Schouler, then Aria was a pilly, ill-fitting sweatshirt dress from the Target line.\\n\\n Hanna took a deep breath and pushed through the French doors. Wilden turned around. There was a serious look on his face. The tiniest bit of a black tattoo peeked out from under the collar of his cop uniform. It still amazed Hanna that Wilden, a former Rosewood Day badass, had gone into law enforcement. “Hanna. Have a seat.”\\n\\n Hanna scraped a chair back from the table and slumped down next to Spencer. “Is this going to take long?” She examined her pink diamond-encrusted Dior watch. “I’m late for something.”\\n\\n “Not if we get started,” Wilden looked around at all of them. Spencer stared at her fingernails, Aria chomped on her gum with her eyes freakishly closed, and Emily fixated on the citronella candle in the middle of the table, like she was about to cry.\\n\\n “First thing,” Wilden said. “Someone has leaked a homemade video of you girls to the press.” He glanced at Aria. “It was one of the videos you gave the Rosewood PD years ago. So you might see it on TV—all the news channels got it. We’re looking for whoever leaked it—and they’ll be punished. I wanted to let you girls know first.”\\n\\n “Which video is it?” Aria asked.\\n\\n “Something about text messages?” he answered. \\n\\n","sourceLink":"https://allnovel.net/perfect-pretty-little-liars-3/page-7.html","bookId":2380,"book":{"id":2380,"title":"Perfect (Pretty Little Liars #3)","description":"Storyline: Perfect (Pretty Little Liars #3) \\n In Rosewood, Pennsylvania, four perfect-looking girls aren\u0027t nearly as perfect as they seem. \\n Aria can\u0027t resist her forbidden ex. Hanna is on the verge of losing her BFF. Emily is freaking out over a simple kiss. And Spencer can\u0027t keep her hands off anything that belongs to her sister. \\n Lucky me. I know these pretty little liars better than they know themselves. But it\u0027s hard keeping all of their secrets to myself. They better do as I say . . . or else!\\n","cover":"https://allnovel.net/images/perfect-pretty-little-liars-3.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/perfect-pretty-little-liars-3.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:19:06 AM"}}
