{"id":107305,"no":17,"title":"Page 17","content":"\"I was sorry to learn of the fire at Mansion Belcrady, Comes,\" the Konige said as she looked away from the four perfect egg-shaped blue sapphires lying in their ivory box to Rakoczy Ferancsi, who had presented them to her; around them many of her Court were gathered, vying for notice and favor. For this glittering occasion, where all her Court was charged with making a lavish and rich showing, the Konige had donned a long-trained double bleihaut, one of cloth-of-gold, and the other of parti-colored Italian velvet over a chainse of Mosul-cotton. Instead of gorget and wimple, she wore a chaplet of fretted gold and a tall necklace of topazes and pearls with three tear-drop diamonds depending from it in frames of rose-shaped gold. The reception hall of the Konige\u0027s Court in Vaclav Castle was very grand, decorated with swags of evergreens, alight with such a vast array of candles that it was deemed brighter than the fading day beyond the shuttered windows. Fresh rushes were strewn on the floor, and odors rising from the kitchens promised a magnificent feast.\\n\\n \"Dear Royal is most gracious,\" said Rakoczy with a deep French bow. As the occasion demanded, he, too, was elegant in his huch of black-red Damascus silk lined with a herringbone pattern of darkest weasel-pelts, the square, open sleeves lined in red satin and edged in rubies. His chainse was of black Ankara wool, woven to the fineness of Coan linen; his braccae were of supple Persian leather dyed dark-red, and his thick-soled Hungarian estivaux were black, reaching up his leg to just below his knee. The ruby-studded silver-link collar stood out against his clothing, and the pectoral of his eclipse device was magnificent with silver raised wings over a large black sapphire. His silver coronet shone on his brow.\\n\\n \"It is doubly duteous of you to have brought these jewels to me when you have more pressing matters demanding your attention,\" she said, running her finger over the lid of the box. Her torpid demeanor and downcast eyes were at odds with the splendor of the Court.\\n\\n \"I am here in Praha to serve you, dear Royal.\"\\n\\n \"You keep to your task quite well,\" she approved, but in so flat a voice that he would not have been convinced of her sincerity had he not been aware it was her melancholy speaking. \"My grandfather did well in sending you to me.\" This was somewhat more persuasive. Her quirky smile was a bit more animated.\\n\\n \"He wished to see you resplendently adorned, dear Royal, as befits a Konige of such high degree,\" said Rakoczy, thinking as he did how tedious court-ship could be. \"If you and Konig Bela are pleased, what can I be but delighted.\"\\n\\n \"What gallantry,\" she remarked. \"For someone from so remote a region, you have the conduct of a Prince of the Blood.\"\\n\\n Rakoczy could not suppress a faint, ironic smile. \"Dear Royal gives me much praise.\"\\n\\n She looked away, touching her necklace, her eyes distant. \"How is it you do not give me pearls, Comes?\"\\n\\n Rakoczy had answered this question many times over the centuries, and said promptly and truthfully, \"Among those of my blood, pearls are said to bring tears, which I would never wish upon you, dear Royal.\" He assumed she would not pursue the matter; pearls were the one jewel he could not make in his athanor: he relied on Eclipse Trading to keep him supplied.\\n\\n She considered his answer, her eyes distant, and finally said, \"I will inform you when I have chosen the gift I wish to give the Konig through your generosity.\"\\n\\n \"I await the hour,\" said Rakoczy.\\n\\n The Konige acknowledged his bow with a formulaic remark: \"For your service you may be sure of my gratitude.\" She waved him away.\\n\\n Stepping back with a second bow, Rakoczy found himself next to Csenge of Somogy, whose magnificent bleihaut of peach-colored wool embroidered with colored silks and golden thread to show a vast array of flowers and birds almost concealed her air of deep fatigue. \"Good evening,\" he said to her, lowering his head respectfully.\\n\\n She returned the greeting in an abrupt fashion. \"Comes.\" She glared at him, as if trying to break his composure; when she did not succeed, she relented enough to ask, \"And how do you find the dear Royal this evening? She gave you a goodly amount of her time.\"\\n\\n \"The Konige seems lethargic,\" Rakoczy observed. \"I had hoped she would be recovered from her delivery by now.\"\\n\\n \"So has the Konig,\" Csenge rejoined, looking about sharply to try to discover if she had been overheard. \"She likes your gift well enough,\" Csenge said in a tone that made it impossible to guess whether she meant the remark as a compliment or a recrimination.\\n\\n \"Then I am handsomely rewarded, but that does not lessen my concern for her,\" said Rakoczy cordially, unperturbed by Csenge\u0027s brusque remark.\\n\\n \"Just as well,\" said Csenge, considering him through narrowed eyes. \"My cousin won\u0027t be here for this occasion, or not for a while. She is taking care of the Little Royals.\"\\n\\n Rakoczy heard this calmly. \"If you will be kind enough to remember me to her, I would thank you.\"\\n\\n \"Certainly.\" She eyed him suspiciously. \"Is it that you\u0027re waiting for Rozsa of Borsod to return? Is my cousin less interesting, being little more than a child, than Rozsa is?\"\\n\\n \"I had heard that Rozsa was coming back,\" Rakoczy said smoothly. \"The Konige will be glad of her company.\"\\n\\n This was not the kind of response Csenge had expected; she shifted the subject. \"What do you plan to do for the Konig\u0027s departure festivities?\"\\n\\n \"I have no notion,\" he replied genially. \"Dear Royal has not told me what she would like me to do for her. I await her instruction.\"\\n\\n \"And you have nothing to suggest?\" Csenge inquired. \"No idea that the Konige might settle upon? No inspiration at all?\"\\n\\n Rakoczy took a moment to weigh his answer. \"I am charged with pleasing the Konige, so in matters of this sort, it is fitting that I rely upon her to tell me what would please her most. It would please neither of us if I were to provide her with something unsatisfactory. It is one thing to present her and her daughters with jewels, as Konig Bela has charged me to do, but her husband is not the same as her grandfather, and the dear Royal\u0027s decision on what Konig Otakar is due must remain with her. She will know best what she wants Otakar to have from her, and it will be my task to make it for her, when she informs me what it is to be; I would not presume to know what she wants.\" He gave her an urbane smile. \"Or do you think I err in that?\"\\n\\n Csenge hardly took more than a moment to consider. \"You should recommend something to her; she is disinterested, as you remarked. Surely you can see that she is apathetic, can\u0027t you?\"\\n\\n \"I can, and that is troubling,\" Rakoczy said.\\n\\n \"She is in God\u0027s Hands, as are we all,\" Csenge said as piously as possible. \"We must all bow to His Will.\"\\n\\n \"Then I will be content to wait until God moves her to decide.\" It was an argument that Csenge would never dispute.\\n\\n \"Well, be ready to do her bidding when she finally makes it known.\" Csenge lifted her head, her jaw at a defiant angle.\\n\\n \"Yes. That is my intention.\" He lowered his head again. \"If you will permit me to-\"\\n\\n \"Oh, yes,\" Csenge said impatiently, having found no nuggets of secrets in anything he said, or his manner. \"Go, by all means.\"\\n\\n Rakoczy moved away toward Counselor Smiricti and Counselor Hlavka, who stood together near the main fireplace, their Court garments burnished by the fire\u0027s shine. Both men wore several gold rings, but no jewels, and no hats, as the Konig\u0027s Law required. Smiricti, in a huch of Damascus silk over a chainse of ecru wool, ducked his head as he noticed Rakoczy. \"Comes Santu-Germaniu. A happy encounter. Let me make Counselor Hlavka Innec known to you.\" He gestured to his companion, who ducked his head.\\n\\n \"Counselor Hlavka,\" said Rakoczy.\\n\\n \"Comes Santu-Germaniu,\" said Hlavka with a flourish of his hand, then added, \"You\u0027re the one at Mansion Belcrady, aren\u0027t you? The exile, or so they say.\" His huch was of heavy, amber-colored Venetian silk and lined in marten-fur; his chainse was of light-blue Anatolian cotton, and his braccae were thickly embroidered with his family trade-mark, a mallet and a pair of farrier\u0027s tongs. His color was high and his eyes were shiny, indications that he had drunk all the toasts that had begun the gathering at mid-afternoon, and very likely more than toasts.\\n\\n \"I am he.\"\\n\\n \"We heard of your fire; a sad misfortune.\" Hlavka turned to Smiricti once more. \"There is a rumor that the fire was deliberately set.\"\\n\\n \"I have heard the same,\" said Smiricti.\\n\\n \"A bad business, if it\u0027s true.\" His innuendo was conspicuous; he continued to ignore Rakoczy. \"Didn\u0027t you tell me that you had recommended Bartech of Tabor for the rebuilding of the damaged furnace and chimney?\"\\n\\n \"I did. And Szigmon to make the new roof. Everyone speaks well of his skills.\" Smiricti smiled, going on effusively, \"Masters in their Guilds, both of them, with well-reputed apprentices and reputations of the highest order. Both of them know the Comes is one of the Konige\u0027s Court, and will be diligent in their work.\"\\n\\n \"When will they be able to start that work?\" Hlavka asked, still not speaking directly to Rakoczy.\\n\\n \"As soon as the weather improves; to do anything now while the rains continue, that would lead to wasted effort. We are devoting some time to planning what is to be built, and how,\" said Rakoczy as if he had been included in the discussion. \"The damaged parts of the bake-house have already been cleared away. My baker is having to use the kitchen ovens for his loaves while the bake-house cannot be used.\"\\n\\n Hlavka nodded, his gaze flicking about the hall as if to make note of everyone in attendance. \"It must be inconvenient for you, Comes, not having a bake-house for your mansion. But surely the repairs will begin shortly,\" he said, sounding a bit distracted.\\n\\n \"It certainly is inconvenient for my cook who wants to have his kitchen back. He and the baker do nothing but wrangle.\" Rakoczy shook his head. \"It\u0027s their temperaments; they clash.\"\\n\\n \"How ... lax, to have so little authority over your household,\" said Hlavka with a snide half-smile.\\n\\n Rakoczy refused to be provoked, shrugging and saying, \"You know how it is with exiles. We must depend on the good-will of those around us.\"\\n\\n \"We would like to thank you for all you\u0027ve done to help us be rid of the rats,\" said Smiricti, after an awkward silence, striving to maintain the courtesy required.\\n\\n \"I was gratified that you asked me,\" Rakoczy said.\\n\\n \"Oh, yes,\" said Hlavka; his next words were almost an accusation. \"Your poisons made short work of many of them.\"\\n\\n Smiricti intervened before Hlavka could entirely forget himself and insult Rakoczy beyond all acceptable limits. \"Our slaves have been put to work secreting your poison-boxes where rats have been found before. We hope to avoid another such infestation as the one we had last year.\" He glanced at Hlavka as if to warn him to hold his tongue.\\n\\n Rakoczy saw that Smiricti was discomfited by Hlavka\u0027s behavior, and so he inclined his head. \"Perhaps we can speak more privately in a day or two?\"\\n\\n \"I will send a messenger; you may assign the time.\" Smiricti gave him a grateful, chagrined, lopsided smile. \"I look forward to it.\"\\n\\n Moving away from the two Counselors, Rakoczy saw Hovarth Pisti standing a little apart from the rest of the company, staring into the dining hall beyond the reception hall, his demeanor both anticipatory and bored; Rakoczy made for the tapestry-weaver, nodding his greeting. \"Are your apprentices with you?\"\\n\\n \"My apprentices are working on the tapestry for the Konig\u0027s departure. We have twenty-two more days, three of them Sabbaths, so we must work on two feast days. Episcopus Fauvinel has granted us a dispensation for those.\" He gave a harried chuckle. \"The Konige didn\u0027t decide what the subject should be until four days past, so we will have to labor well into the night to have it ready.\"\\n\\n \"The work is an honor, of course,\" Rakoczy said.\\n\\n \"Oh, yes. It is why Konig Bela sent me here. It is a fine distinction he has extended to me and my apprentices. I know that Konig Bela has noted all we have done for Konige Kunigunde. We gain favor from Konig Bela and Konig Otakar when we please the Konige.\" His expression turned smug. \"And unlike you, I can expect to be richly recompensed for all I and my apprentices do, by Konig Otakar as well as by Konig Bela.\"\\n\\n Rakoczy\u0027s deportment did not change; he gave no sign of vexation at Hovarth Pisti\u0027s condescension, and no offense at his disparaging remarks. \"I do have a reward of sorts,\" he said. \"My fief is safe as long as I fulfill the requirements of Konig Bela and his granddaughter. That reward is more than sufficient for me.\"\\n\\n \"Not an easy bargain, even for so wealthy a man as you are, Comes.\" He ducked his head and moved away as three buisines sounded a call from the minstrels\u0027 gallery, and a herald stepped to the railing.\\n\\n \"In the most gracious name of Kunigunde of Halicz, Konige of Bohemia,\" he announced, \"you are all welcome to the Konige\u0027s Court, summoned for the purpose of arranging the festivities to mark the departure of Przemysl Otakar II, Konig of Bohemia, with his army, to the field of battle, where, with God\u0027s Grace, he will enlarge his conquests and be named Holy Roman Emperor. The Konig will leave on the twenty-seventh day of March unless the weather delays him. The celebration for his departure will begin on the twenty-fifth day of March and last until the Konig and his army are outside the walls of Praha. May God favor and defend the Konige and her daughters, and grant victory to our Konig.\"\\n\\n A cheer went up, only to be overwhelmed by the braying of the buisines; as the brazen echoes died, a consort of shawms and gitterns and a tabor took the place of the buisine-players, beginning their part of the Court\u0027s music with the popular song Praise to the Virgin. After that, they played Hills and Meadow, an engaging, wistful melody. When they finished, Episcopus Fauvinel came to the railing and raised his hands; everyone in the reception hall dropped to their knees and crossed themselves.\\n\\n \"In the Name of the Father, of the Son, and the Holy Spirit, Amen,\" the Episcopus intoned in Church Latin.\\n\\n \"Amen,\" the Court echoed, a few of the Konige\u0027s Court taking out their rosaries from under their chainses, and beginning to run the beads through their fingers, their lips moving in prayer.\\n\\n Episcopus Fauvinel waited until he was confident of the Konige\u0027s attention; when he was sure he had it, he addressed the Court. \"Let us all give thanks to Merciful God in His manifest Glory. God has given illustrious favor to Bohemia and all its territories, the which you must all show your gratitude, through adherence to God\u0027s Law and the offering of Masses. To show your worthiness for God\u0027s Blessing, may you, each and all, serve the Konige to her honor, the honor of Konig Otakar, and the honor of Bohemia. May you, each and all, bring esteem to the Konige\u0027s Court and show no contempt for other Courts in doing so. May you, each and all, seek to ennoble the Royal House of Przemysl and of Halicz to greater heights. May you, each and all, welcome the benefices that come to you from your service with humility and piety. May you, each and all, give praises to God for providing so excellent an opportunity to demonstrate your fealty, for it is through Him that you are advanced for your loyalty and devotion, first to God, then to the Konig and Konige, of which you ought to be mindful every hour of your lives. Amen.\"\\n\\n Another chorus of Amen answered him, and a rustle of garments as the assembled Court arose, all silent until the Episcopus stepped back behind the musicians, signaling that the Episcopal audience was at an end. Once again the tabor set the beat; the shawms and gitterns struck up another song-Love Does Me Great Wrong.\\n\\n On the far side of the hall, Rakoczy saw that Imbolya was deep in conversation with Rytir Leutpald Verschluss, one of Konig Otakar\u0027s German Guards; her expression was earnest but he was not paying much attention to her words, but was taking in her appearance and the richness of her clothes.\\n\\n As conversation crescendoed in the vast hall, Rakoczy found a small nook in the wall to the left of the main fireplace and stepped into it; he could watch the Court from here without being readily seen. It was a bit of a risk, for if he were discovered he might be accused of spying, but he was willing to take the chance; there were many questions he sought to have answered, and hoped that this vantage-point would provide him the means to learn by watching.\\n\\n \"Comes,\" said a voice just outside the alcove.\\n\\n Rakoczy concealed the twinge of alarm that shot through him. \"Yes?\"\\n\\n Tahir moved into the opening, his gaudy clothes showing he would be performing that evening. \"Are you well?\"\\n\\n \"Yes, Tahir,\" said Rakoczy. \"I am quite well.\"\\n\\n \"Then you must be hiding,\" Tahir decided. \"Not that I find that unwise, hiding.\"\\n\\n \"No; I am observing.\"\\n\\n \"So!\" The dwarf tumbler slapped his thigh. \"Good fortune to you.\" He ducked his head and walked away.\\n\\n Rakoczy remained where he was, watching the Konige\u0027s company, taking note of the ebb and flow of the Court until the buisines sounded to summon the Court to supper, when he slipped away from the nook and made his way to the end of the dining hall, looking for one of the Konige\u0027s ladies-in-waiting. He finally caught sight of Gyongyi of Tolan, and approached her. \"A word with you, Lady,\" he said, bowing.\\n\\n Gyongyi blinked. \"Comes,\" she responded, courtisying him. \"What do you require?\"\\n\\n \"I ask you, if you would, to inform the dear Royal that I will send a messenger to her tomorrow to receive her commission.\"\\n\\n \"Certainly,\" said Gyongyi, trying to contain her curiosity.\\n\\n \"You are most graciously acquiescent; you have my thanks,\" said Rakoczy, and took a step away from her, bowing as he went.\\n\\n \"Comes,\" she said, halting him. \"Aren\u0027t you joining the banquet?\"\\n\\n \"Alas, no. The customs of my blood forbid it, for we traditionally dine in private, as dear Royal is aware. And in any case, there are those among the courtiers who believe I am a spy for Konig Bela, and are not sanguine when I attend these functions. My presence could prove awkward for the Konige, so it is best if I leave.\" He bowed one last time before going to the vestibule to claim his mantel.\\n\\n The under-steward handed him his garment, and asked, \"Do you need a horse or a carriage from the Konige\u0027s stable to return to your mansion, Comes? Or have you either horse or carriage waiting for you here?\"\\n\\n \"Mansion Belcrady is not far from here.\" He swung the mantel around his shoulders. \"I walked up the ridge; I can as easily walk down.\"\\n\\n \"Then you will need an escort.\" The under-steward ducked his head.\\n\\n \"For so short a distance? Thank you, but I think not.\" He passed on into the entry hall, where more servants opened the door for him. He stepped out into the forecourt, and paused to stare at the red, violet, and luminous dark-blue remnants of sunset that flashed under the clouds that stretched over the world like a gigantic tent. He could tell more rain was coming, and that it would be heavier than what they had just had. He went across the forecourt to the main gate and rang the bell to summon the warder.\\n\\n \"Oh. It\u0027s you,\" said the warder when he arrived. \"I should have known. No one but you leaves before the banquet.\" He laughed once before he drew back the massive bolt and tugged the gate open enough for Rakoczy to pass through it. \"God give you a good night, Comes.\"\\n\\n \"And to you, good warder,\" Rakoczy called back to him, tossing him a golden Vaclav as the warder tugged the gate closed once more. Out in the fading daylight, Rakoczy thought the streets unexpectedly empty; not many people were about, and those who were seemed harried as they rushed along, going down the hill; most of them wore crucifixes conspicuously, and a few had Otakar\u0027s lion on simple badges on their shoulders. The reason for this display was soon apparent as a shout went out from the main gates of Praha, and Rakoczy remembered that five deserters were being hanged in chains at sunset, the Konig officiating at the beginning of their slow execution; the first had just been dropped; the other four would suffer the same fate shortly. Frowning, Rakoczy found himself moving more quickly, and as he lengthened his stride, he heard the sound of hasty footsteps behind him. Although he told himself he was being foolish, he swung around, hoping to see who was there, but once again the street was empty.\\n\\n The distance between Vaclav Castle and Mansion Belcrady was not great, but for Rakoczy it stretched out ahead of him like the vastness of the Silk Road. He considered running at speed-which, for him, was almost as fast as a galloping horse-but quickly rejected the idea, for if he was not being followed, he might draw the kind of attention to himself that he sought most to avoid. Yet he kept moving at a rapid clip, hoping to force his follower to betray himself.\\n\\n Rakoczy heard the sound of trotting hooves on the cobbles, and a moment later, three of Otakar\u0027s German Guard emerged from the side-street, all but dragging two hooded men after them as they turned up the hill toward Vaclav Castle. They paid no attention to the Comes.\\n\\n At the gate to Mansion Belcrady, Rakoczy slipped in through the warder\u0027s door without attracting Minek\u0027s attention, or the notice of most of his household. He made his way to the kitchen garden, and entered the manse by the side-door, startling Kornemon, who was carrying a load of wood in a copper tub with wooden handles into the kitchen.\\n\\n \"Comes,\" he exclaimed. \"I didn\u0027t know you had returned.\" He ducked his head respectfully.\\n\\n \"I have, as you see,\" he told the stoker. \"What has happened in my absence?\"\\n\\n The stoker did not answer at once. \"The bricklayer and two of his apprentices were here for a time. They left not long ago. They said they would be back in a day or so, if the weather is clear.\" He looked up at the ceiling, shifting the tub from one hand to another. \"Someone from the Council Court came and spoke with Barnon. Illes went to the horse-fair, but you knew that.\"\\n\\n \"He went on my orders,\" said Rakoczy, wondering what it was that Kornemon was trying so hard to conceal. \"And the rest of the household-what of them?\"\\n\\n \"For the most part all is well,\" said Kornemon.\\n\\n \"For the most part? What is not well?\"\\n\\n \"It\u0027s not for me to say,\" Kornemon declared.\\n\\n \"It is, when I ask,\" Rakoczy said gently but with an authority that demanded an answer.\\n\\n Kornemon sighed. \"Pacar and Tymek fought again.\"\\n\\n Rakoczy was silent for a long moment. \"Was either of them hurt?\"\\n\\n \"Not badly when you consider what they might have done.\" He shrugged. \"Pacar has a lump on his head and Tymek\u0027s knuckles are scraped, but Barnon and Ambroz stopped them before anything in the kitchen was damaged, or a knife was found.\"\\n\\n \"Most commendable. Do you happen to know what the fight was about?\"\\n\\n \"I don\u0027t know,\" Kornemon said evasively. He fidgeted, glancing in the direction of the kitchen. \"Comes, I ought to-\"\\n\\n \"And where was Hruther during all this?\" Rakoczy asked; it was most unlike his manservant to allow such a ruction to take place. He could not help but feel anxious; he tried not to show his apprehension.\\n\\n \"I don\u0027t know,\" said Kornemon. \"I should get this wood to the kitchen.\"\\n\\n Rakoczy nodded and made a sign of dismissal. He waited a short while, in case another servant should happen by, one who would be more forthcoming, who could explain what had become of Hruther. When no one appeared, he went toward the main hall, planning to go to his workroom in the hope that Hruther had left him a message to account for his absence.\\n\\n Text of a letter from Balint of Santu-Germaniu at Santu-Germaniu to Rakoczy Ferancsi, Comes Santu-Germaniu, in Praha, dictated to Frater Lorand, written on vellum, carried by private courier, never delivered.\\n\\n To the most esteemed Rakoczy Ferancsi, Comes Santu-Germaniu, presently at Mansion Belcrady in Praha, Bohemia, the most respectful greetings of your steward, Balint of Santu-Germaniu, by the good offices of Frater Lorand, on this, the first day of March in the 1270th Year of Salvation:\\n\\n My most well-regarded Comes,\\n\\n This is to inform you that winter is still keeping the Carpathians in its grip, and it appears that spring will arrive later than usual this year. We have had inconsistent weather, all of it bad. There was a week of warm days, when the snows began to melt, which ended in two days of rain, and, as the cold returned, became ice, making your stronghold ice-bound, and giving the appearance of remaining so into April if the local weather-witches are to be believed. This will mean that we will plow and plant later than usual, which may effect the harvest when it comes around, which may mean that we will have to part with more of the harvest than we can spare when Konig Bela\u0027s men come for their taxes. I ask you to inform me what you want me to do if we should have such problems as I anticipate. It may be that I am worried for no good reason, but as your steward, you advised me to keep all eventualities in mind.\\n\\n The commander of the fortress at Santa-Ioanne came here three months ago and claimed ten sheep, ten hogs, and four foals in the name of Konig Bela. Since you instructed me not to deny the Konig\u0027s men, I made no objection to their raid, for raid it was, but I am afraid that when the spring comes, they will return with the intention of taking more, which I doubt we can provide without putting your fief at a disadvantage. We have already seen wolves in the forest, and if they start to plunder our livestock, then the Konig\u0027s men will leave us in a very poor state. I ask for your permission to send Sylvanu to the horse-and-cattle fair at Cluj in May, to buy a few mares with foals at their sides, and some other livestock as well.\\n\\n Three shepherds died while driving their flocks into their pens and barns not long after the first snowfall. Rumor has it that they were caught in an avalanche, but others say they were taken by bandits to be sold as slaves to the Byzantines. Some believe that they ran away. This is the fourth time such disappearances have happened in the last year. At first I assumed that it was an avalanche, but almost none of the sheep were lost, as we discovered when we rounded them up, and that leaves raiding parties. Most of the bandits keep to the plains, where they have a greater chance to take captives and plunder, but those seeking slaves are another matter, for they seek to take men, women, and children, and get away with little notice. With you gone, it is likely that these outlaws come here because you are not allowed to keep soldiers to track down those raiders, so they may raid with impunity. I ask you to petition the Konig for the protection of men-at-arms, or allow those of us in your household to keep arms to help drive off the raiders.\\n\\n There is a record of accounts included with this letter, showing how we have fared since the first snowfall. As you see, the costs for feed has risen. The repair to the cattle barn is complete at the cost of twenty silver coins and eight lambs. We will need to work on the stable next summer, and that may prove as expensive as the barn to repair. As you ordered, the cisterns were cleaned of algae. The dung farmer emptied the latrines and dung channels before the first snowfall. The linen has been washed in saffron-water, and anything in need of darning has been given to the needlewomen. Ten wagon-loads of wood were brought in for the winter, and six of them are still left; the cost was five gold Vaclavs and five silver Emperors. New fences have been built around the chicken coops and rabbit hutches to keep out martens and foxes, and seem to have worked well. We have three barrels of lanthorn-oil left, twenty-two dozen wax candles, and fifty-three barrels of new wine have been laid down. We have turnips, onions, cabbages, and apples in the root-cellar, and thumb-cabages, onions, peppers, and cucumbers pickling in barrels. We may run short of food by spring, but we will manage.\\n\\n The weavers are busy this winter, and we will have more cloth than usual to offer at the market fair, unless the Konig\u0027s men decide to claim half of it as taxes due. The goat-hair mantels and blankets have turned out particularly well; the woolen bleihauts our needlewomen make should fetch a good price, as well, and if they continue to keep up their present pace of weaving and sewing, there will be an extra set of clothes for all the household and still have much to take to market.\\n\\n May God move the Konig to soon grant you the right to return to your fief. All of your vassals pray for you, and ask God to watch over you in that foreign place.\\n\\n Balint of Santu-Germaniu\\n\\n Steward of Santu-Germaniu\\n\\n by the hand of the scribe Frater Lorand \\n\\n","sourceLink":"https://allnovel.net/an-embarrassment-of-riches-saint-germain-24/page-17.html","bookId":2506,"book":{"id":2506,"title":"An Embarrassment of Riches (Saint-Germain #24)","description":"Storyline: An Embarrassment of Riches (Saint-Germain #24) \\n More than two decades strong, the Saint-Germain cycle is one of the most compelling works of dark fantasy and horror of our age. Historically accurate, often involving key events or figures from throughout world history, these deeply emotional novels have a devoted readership. Each novel is written as a stand-alone and they are not chronologically consecutive, so readers may enter the saga with any book and move backward or forward in time as they choose, from Pharaonic Egypt to Paris in the 1700s, from the fall of the Roman Empire to World War II Europe. \\n In An Embarrassment of Riches, the vampire Count finds himself a virtual prisoner in the Court of Kunigunde in Bohemia in the 1200s. Rakoczy Ferncsi, as Saint-Germain is known, passes his days making jewels to delight Queen Kunigunde and trying not to become involved in the Court\u0027s intrigues. In this, the vampire fails. Handsome, apparently wealthy, and obviously unmarried, he soon finds himself being sexually blackmailed by Rozsa, an ambitious lady-in-waiting. If he does not satisfy her, she will denounce him to the priests and he\u0027ll be burned at the stake, resulting in his True Death. Despite his care, the vampire makes more than one enemy at the Bohemian Court, and by the end of An Embarrassment of Riches, the Count can see only one road to freedom...through death.\\n","cover":"https://allnovel.net/images/an-embarrassment-of-riches-saint-germain-24.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/an-embarrassment-of-riches-saint-germain-24.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:05:36 PM"}}
