{"id":107308,"no":20,"title":"Page 20","content":"ILISKA OF SZOUSA\\n\\n Prologue\\n\\n Text of a decree issued by the Counselors of Praha; published throughout the city and read in every church on the 6th day of April, 1270.\\n\\n Be it known to all the people of Praha:\\n\\n 1) At the order of the Episcopus Fauvinel and the Counselors of Praha, the Beggars\u0027 Guild is given continuance on their order to hunt and kill any and all rats found in the city, and to be paid one silver Apostle for every ten rat bodies presented at the Council Court.\\n\\n 2) Every resident of Praha has the permission of the Episcopus and the Counselors of Praha to kill rats; they may also claim the same bounty as the one provided for the Beggars\u0027 Guild.\\n\\n 3) Those owning property within the walls of the city are charged with the duty to kill any and all rats that may be found on said property, regardless of the use made of said property; they may also claim the bounty levied against the rats.\\n\\n 4) The bounty on cats is herewith rescinded; no cat, with or without a household to claim it, may be killed so long as it is able to catch and kill rats and mice, and no charges of witchcraft may be made against any cat or household with cats within the city walls; those who are uncertain regarding any cats may take them to any priest in the city to be blessed.\\n\\n 5) All warehouses within the city walls henceforth are required to keep cats to control the rats that are known to infest warehouses, where they proliferate in great numbers.\\n\\n 6) Those failing to observe the orders of this decree will be subject to fines up to four golden Vaclavs for failure to comply with the terms herein. Repeated offenses will cause the assessed fines to be doubled at every lapse.\\n\\n God bless the City of Praha, the Konig, the Konige, the Episcopus, and the Counselors of Praha. \\n\\n","sourceLink":"https://allnovel.net/an-embarrassment-of-riches-saint-germain-24/page-20.html","bookId":2506,"book":{"id":2506,"title":"An Embarrassment of Riches (Saint-Germain #24)","description":"Storyline: An Embarrassment of Riches (Saint-Germain #24) \\n More than two decades strong, the Saint-Germain cycle is one of the most compelling works of dark fantasy and horror of our age. Historically accurate, often involving key events or figures from throughout world history, these deeply emotional novels have a devoted readership. Each novel is written as a stand-alone and they are not chronologically consecutive, so readers may enter the saga with any book and move backward or forward in time as they choose, from Pharaonic Egypt to Paris in the 1700s, from the fall of the Roman Empire to World War II Europe. \\n In An Embarrassment of Riches, the vampire Count finds himself a virtual prisoner in the Court of Kunigunde in Bohemia in the 1200s. Rakoczy Ferncsi, as Saint-Germain is known, passes his days making jewels to delight Queen Kunigunde and trying not to become involved in the Court\u0027s intrigues. In this, the vampire fails. Handsome, apparently wealthy, and obviously unmarried, he soon finds himself being sexually blackmailed by Rozsa, an ambitious lady-in-waiting. If he does not satisfy her, she will denounce him to the priests and he\u0027ll be burned at the stake, resulting in his True Death. Despite his care, the vampire makes more than one enemy at the Bohemian Court, and by the end of An Embarrassment of Riches, the Count can see only one road to freedom...through death.\\n","cover":"https://allnovel.net/images/an-embarrassment-of-riches-saint-germain-24.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/an-embarrassment-of-riches-saint-germain-24.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:05:36 PM"}}
