{"id":107293,"no":4,"title":"Page 4","content":"Konige Kunigunde lay back on her padded-leather Byzantine couch, frowning with discomfort. Five months into her pregnancy and she was feeling miserable; her back hurt, her feet were swollen, her guts were in turmoil, and the heat had given her a vise-like headache. If only she might be allowed to remove her heavy damask-silk bleihaut and lie about in her linen chainse, as a merchant\u0027s wife might do-but that was unthinkable. She was Konige, and that imposed certain duties upon her, no matter how she felt; she was obliged to maintain her appearance for the sake of her position. She would have to endure as best she could. But this afternoon not even her solarium offered her any relief from her distress; the open windows brought only the odors of the middens. She felt her baby shift inside her and she made herself lie still, thinking as she did that she had to carry herself as if her womb were made of thin glass, and everything she did required her to consider first the potential heir she carried. Hating what she saw in her mirror, she made a sound between a groan and a sigh.\\n\\n The two of her ladies assigned to her company came to her side: Csenge of Somogy and Imbolya of Heves, both of them dressed on account of the heat in light unbleached cotton bleihauts with the thinnest of linen chainses beneath them. Csenge, being the older of the two, spoke first. \"What would you like us to get for your relief, dear Royal?\"\\n\\n \"I don\u0027t know,\" muttered Kunigunde. \"Cover my looking-glass. If you could make the room cooler, or the day less oppressive...\" She waved her hand to show she knew this was impossible.\\n\\n \"Pray God, we shall have rain soon and the air will clear.\" Csenge, too, was enervated by the sultry weather, but knew she did not have the right to rest while the Konige was in her care.\\n\\n \"Shall I fetch Klotild? Or ask her to prepare a cordial for you?\" asked Imbolya, tentatively, her face flushed from the heat. She was younger than Kunigunde was when she married, not quite fifteen, a slender birch of a girl with a generous mouth, a straight nose, light-brown hair, and hazel eyes; she had a youthful lack of certainty in herself.\\n\\n \"What use is a midwife now?\" Csenge challenged as she selected one of three chairs in the room and moved it nearer to the couch. \"There is no sign of trouble.\"\\n\\n \"She is also an herb-woman, cousin,\" Imbolya reminded Csenge with the kind of helpful eagerness that made her cousin flinch. \"She may have some means of making our Konige more at ease. For the good of her baby.\"\\n\\n \"Pray God it is a son,\" said Csenge piously, and all three women crossed themselves.\\n\\n \"For the sake of Bohemia and Hungary,\" said Imbolya.\\n\\n \"Do you think Klotild could help me?\" Kunigunde asked, trying not to whine; she reminded herself again what was expected of her as Konige of Bohemia-the production of a viable heir and an example of conduct worthy the wife of a Christian King, as well as securing the terms of the treaty between her grandfather and her husband.\\n\\n \"I\u0027ll go and ask,\" said Imbolya, and left the Konige\u0027s side.\\n\\n Csenge watched her leave. \"A bit skittish,\" she said as if to herself.\\n\\n \"She\u0027s still half a child,\" Kunigunde said quietly, as if she were vastly older than Imbolya. \"Your guidance will help her.\"\\n\\n Satisfied that she had impressed the Konige, Csenge shrugged. \"Yes. She\u0027s new; she\u0027ll learn. Shall I send for Tirz Agoston to play for you?\"\\n\\n \"No.\" She knew she should explain her refusal, but nothing came to mind.\\n\\n \"Would you like me to rub your feet?\"\\n\\n \"I suppose so,\" said Kunigunde, who realized that her lady-in-waiting needed to do something for her. \"Yes, if you would. And turn the mirror away.\" Her chainse was sticking to her body and it was not a pleasant sensation. \"Do you think it would harm my child if I were to bathe?\"\\n\\n Csenge considered the question. \"Klotild would know better than I, but if bathing would make you more comfortable, I doubt it could be too harmful.\" She dropped into her chair.\\n\\n \"I will speak to her myself, later.\" She took a deep breath. \"Who is with my daughter this hour?\"\\n\\n \"Rozsa and Betrica are with Kinga,\" she said, using the four-year-old\u0027s nickname. \"They will tend to her until Teca and Milica take her into their care at sundown.\"\\n\\n \"She was fussy this morning,\" said the Konige.\\n\\n \"It\u0027s the heat,\" said Csenge. \"The leaves are wilting on the trees.\"\\n\\n \"Well, at least it should bring us a rich harvest.\" She tugged at her bleihaut, exposing her lightest solers.\\n\\n \"Would you like me to use wool-fat while I rub? It should soothe your skin, soften it. There is the jar of it that Comes Santu-Germaniu sent four days since, in your private room. He said it has ginger and arnica mixed in it.\" She spoke soothingly as she removed the Konige\u0027s solers, exposing Kunigunde\u0027s bare feet, the upper flesh puffy from pressing against the straps of the solers. \"Would you like me to wash them first?\"\\n\\n \"That would be nice. If you can find some cool water,\" said the Konige.\\n\\n \"Cool water it shall be.\" She rose and went to the door. \"Gyongyi, the Konige would like a basin of cool water,\" she called to the waiting-woman sitting in the open window at the end of the corridor.\\n\\n Gyongyi of Tolna, a sturdily built woman with pock-marked skin and a lantern jaw, who was a few years older than Csenge, got up quickly and ducked her head before hurrying away toward the stairs and the distant kitchens.\\n\\n On her couch, Kunigunde turned her head toward the windows. \"No clouds,\" she said in disappointment.\\n\\n \"Not in the east, no: there may be some in the west,\" said Csenge, coming back to the Konige\u0027s side. She wished Imbolya would return so that she could have a little rest. They could not leave the Konige alone, but Csenge was so uncomfortable, she wondered why Kunigunde had not sent her away to rest, as she had done with her body-servant Davni, who was a commoner, and a Bohemian, not Hungarian and noble as she was. Feeling ill-used, she patted her brow with the edge of her sleeve. The heat had made her nauseated and she knew she would soon become dizzy if she had no chance to lie down. It had happened before, but not with such vehemence as she feared might now be the case. There was a sourness in her mouth and a tightness in her throat that did not bode well. If only Erzebet of Arad was not laid low with a fever, she could demand some relief, and not only from her flibbertigibbet cousin-running off to the midwife like that!-but from tried and tested women of maturity and good sense, women who would not abandon the Konige so recklessly.\\n\\n \"Pader Stanislas said it will rain tonight, or tomorrow at the latest,\" Kunigunde said; the Polish Augustinian served as her scribe and secretary and was the most educated man in her immediate Court, one whose pronouncements were highly regarded. \"He has been praying for rain for the last three days.\"\\n\\n \"A pity God hasn\u0027t answered him yet,\" said Csenge, forcing a smile to her face to avoid a rebuke for such irreligious sentiments; she remembered to turn the mirror arround.\\n\\n Kunigunde did not return her smile. \"He says it must come.\"\\n\\n \"May God hear his prayers, and say \u0027Yes\u0027,\" said Csenge, her smile widening to a grimace, for it seemed as likely to her that God would say \"no\", and such an idea was truly blasphemous. The heat was working in her, like the flames of Hell.\\n\\n \"And say we all \u0027Amen.\u0027 \" Kunigunde rubbed her forehead.\\n\\n Acquiescently Csenge crossed herself. \"Amen, dear Royal.\"\\n\\n \"We often have a few hot days around the Solstice, don\u0027t we; this is more of the same,\" Kunigunde observed, as if acknowledging it made it more bearable. \"It sets the fruit and heartens the fields.\"\\n\\n It took an effort for Csenge not to make a sharp retort; it took all her training to remain courteous. The smile remained fixed on her lips, and she drew up a chair to the foot of the couch, saying as she did, \"Gyongyi will bring the basin shortly, and my cousin will return from Klotild, and soon you will be more comfortable, dear Royal, and your babe less restless.\"\\n\\n \"I would rather he be active; it would mean a lusty child, which would please the King.\" She pressed her lips together, recalling the remonstration she had received for delivering a girl as a first-born.\\n\\n \"A boy born at harvest-time is said to garner plenty to himself,\" said Csenge.\\n\\n Kunigunde sighed. \"That\u0027s all to the good, but-\" She stopped. She had no right to complain; she had a duty to Hungary. God had put her in her high position to do His Will, and if that honor brought occasional discomfort, she needed to renew her faith so that she would not become prey for Satan and his thousand Devils who were said to find every weakness in women.\\n\\n Csenge patted Kunigunde\u0027s foot, speaking to her gently to provide solace as well as relief. \"Don\u0027t fret, my Konige. Summer will end and your boy will be born, and Bohemia will rejoice with Hungary, in spite of the war.\" She wiped her brow again. \"God provides the heat in summer so that we will not starve in winter. To doubt His Wisdom and Mercy is the course of damnation.\" She had heard this often from Episcopus Fauvinel, as had all the Konige\u0027s Court.\\n\\n \"Deo gratias,\" Kunigunde murmured, crossing herself; she waited a moment for Csenge to do the same. \"We must have faith, Csenge.\"\\n\\n \"Certainly we must,\" said Csenge, masking her irritation with a prim humility.\\n\\n \"Without faith, we are lost to God,\" Kunigunde persisted.\\n\\n If only it were not so hot, thought Csenge. If only it would rain. She realized she had to say something. \"And God tests our faith through hardships-yes, I know.\" This was more skeptical than she intended. \"Just as He sends this heat to fortify the land and try His people, to strengthen them.\"\\n\\n \"So we must endure this trial.\" Kunigunde sighed again.\\n\\n \"Episcopus Fauvinel will offer Mass for rain tomorrow,\" Csenge said by way of providing encouragement.\\n\\n \"And it will rain in France,\" said the Konige, whose misgivings about the French bishop were well-known. She put her hand to her mouth, more for form\u0027s sake than any real desire to unsay the words.\\n\\n Because it was expected of her, Csenge laughed. \"So it may.\"\\n\\n A tap on the door announced the return of Gyongyi, a basin in hand. \"From the cistern in the kitchen cellar,\" she said as she came into the solarium, ducking her head in recognition of the Konige. \"I brought a drying cloth with me.\"\\n\\n Before Kunigunde could speak, Csenge was on her feet, reaching for the basin and cloth. \"You come in good time. Did you happen to see my wandering cousin?\"\\n\\n \"No,\" said Gyongyi. \"Where has she gone?\"\\n\\n \"To Klotild, to see if she has anything that might ease the Konige\u0027s present distress. So much heat may prove harmful to the child, my cousin believes.\" She pursed her mouth to show her opinion of the notion. \"What herbs can do to change the weather, I cannot think. If she has such power, it would smack of witc-\"\\n\\n \"She made a poultice for Erzebet,\" said Gyongyi, keeping Csenge from finishing the word.\\n\\n \"And Erzebet is still feverish, so perhaps Klotild isn\u0027t-\"\\n\\n \"Remedies take time,\" said the Konige sharply, cutting off the exchange between the two waiting-women; she went on in a quieter tone, \"Erzebet has been ailing for some days. It will be a while before her fever passes.\"\\n\\n \"Of course,\" said Gyongyi.\\n\\n \"Let me tend to your feet, dear Royal,\" said Csenge, ignoring Gyongyi\u0027s efforts to claim the opportunity to tend to the Konige, taking her place in the chair, the basin balanced in her lap against the foot of the couch. To secure her command of their circumstances, she added, \"Gyongyi, there\u0027s a chalcedony jar on the table in our Konige\u0027s private room. Would you be good enough to fetch it for me, so I can rub its ointment into Kunigunde\u0027s feet?\"\\n\\n Gyongyi gave Csenge a sharp look, but went to get the chalcedony jar.\\n\\n With a little maneuvering, Csenge managed to get Kunigunde\u0027s right foot into the basin, where she washed it gently, noticing how truly swollen the foot was. \"You should lie here for an hour or more, for the sake of your feet, my Konige.\"\\n\\n \"It is an accumulation of phlegmatic humors in the body,\" said Kunigunde, repeating what Pader Stanislas had told her the day before.\\n\\n \"All the more reason for you to rest,\" said Csenge, lifting her foot from the water and patting it dry with the cloth.\\n\\n \"The coolness is very pleasant,\" said Kunigunde, offering her left foot.\\n\\n \"Then I am more than gratified,\" said Csenge, gently massaging her foot and ankle. When she had dried the Konige\u0027s left foot, she dropped the cloth on the floor next to her chair, then rose and went to dump the water out the open window, and returned to her chair. \"As soon as Gyongyi comes back, I\u0027ll-\"\\n\\n As if answering a summons, Gyongyi came through the door, the green chalcedony jar in her hands. \"I found it, dear Royal,\" she said, ducking her head before giving the jar to Csenge.\\n\\n \"Thank you, Gyongyi,\" said Kunigunde; her headache was making her feel slightly dizzy, which she strove to conceal, reminding herself that she could give her suffering to God and the Blessed Virgin.\\n\\n Csenge opened the jar and dipped three fingers into the yellow ointment. \"It smells very nice,\" she declared as she reached for the Konige\u0027s right foot.\\n\\n \"How pleasant,\" said Gyongyi, starting toward the door. \"Is there anything I may do for you, dear Royal?\"\\n\\n \"Not for the moment, thank you,\" said Kunigunde.\\n\\n Gyongyi ducked her head, then left the solarium to return to her place at the corridor window; she was fanning herself with her open hand as she pulled the door closed.\\n\\n Carefully Csenge spread the ointment over Kunigunde\u0027s foot, making sure to work slowly. \"There is much virtue in this,\" she said as the scent of the ginger filled the room.\\n\\n \"Won\u0027t it make my foot swell more?\" Kunigunde asked, unable to hide her anxiety.\\n\\n \"I suppose that\u0027s what the arnica is for,\" said Csenge, feeling her hands start to tingle. \"Lie still, dear Royal, and let me tend to you.\"\\n\\n Kunigunde closed her eyes, and tried not to see the vivid depictions of Hell that Pader Stanislas had impressed upon her during morning devotions. There were special torments in Hell reserved for women who did not present their husbands with sons, and if her next child should also be a daughter, then she would have to answer for her failure before God. At the time she had asked if the birth of daughters was not God\u0027s Will, as all things on earth were. But Pader Stanislas had reminded her that only God or the Devil could change the world, and when a woman obstinately refused to deliver sons, as it was her duty to do, it showed that she had come under the influence of the Devil. Had not God sent His Son, to save mankind? Why, after such a sacrifice, would He send daughters to Christians? Daughters, like Eve, were the allies of the Devil. She murmured a protest, and was jarred from her unhappy reverie by Csenge breaking off her massage and beginning an upbraiding of her cousin. The Konige opened her eyes.\\n\\n Imbolya was back, holding out a cup. \"Dear Royal,\" she said, a bit out of breath. \"This is from Klotild; she says it will make you more comfortable and release the waters pent up in your body, but do no harm to your babe.\"\\n\\n \"Pader Stanislas said it is phlegmatic humors that try me,\" Kunigunde told her two waiting-women.\\n\\n \"This will help those humors as well,\" said Imbolya. \"Phlegm attracts water, according to Klotild.\" She gave the cup to the Konige.\\n\\n Kunigunde sniffed at the dark-green liquid suspiciously. \"What\u0027s in it; did she say?\"\\n\\n \"She told me it had juniper berries, parsley, celery seed, milk thistle, willow bark, and feverfew. I will drink some if you like.\" She ducked her head. \"They were ground with a mortar-and-pestle and mixed with spring water. It will encourage the elimination of moisture and lessen the tendency to accumulate heat in the flesh.\"\\n\\n With a slight shrug, Kunigunde made herself drink. \"I don\u0027t like the taste.\"\\n\\n \"Klotild said you would not,\" Imbolya told her. \"She also said that if this provided relief she\u0027ll make more for you tonight.\"\\n\\n Setting the cup down, Kunigunde said to Csenge. \"The ointment is quite pleasant. The prickle it gives is ... agreeable. You may rub my other foot.\"\\n\\n \"What pleases you, dear Royal, pleases me to do.\" It was the required response, and she made no effort to attempt to sound sincere. Csenge brushed the wisps of hair that had fallen around her hair, using the back of her wrist so that she would get none of the ointment on her face. \"If you will recline again?\"\\n\\n \"I thank you.\" With a sigh, Kunigunde lay back once more and let Csenge rub her foot. She tried to keep her mind on happy things, so that her child would have a good-natured temperament, but her thoughts kept turning to Pader Stanislas\u0027 exhortations, and little as she wanted it, she could not keep from recalling the horrendous visions the priest had conjured.\\n\\n \"Be easy, my Konige,\" Csenge whispered as she finished her task and rubbed her hands on the drying sheet.\\n\\n Imbolya, who had been sitting on the bench away from the windows, rose and came toward the couch. \"Should we let her sleep?\" she asked her cousin in a hushed voice.\\n\\n \"For a while,\" said Csenge, feeling Imbolya\u0027s quiet inquiry go through her head like iron spikes. \"Is Gyongyi still in the corridor?\"\\n\\n \"I suppose so. Would you like me to go and look?\" Imbolya asked.\\n\\n \"If you would be so good,\" said Csenge, trying not to make her request abrupt; Imbolya was too young to think brusque responses anything but chastisement; by the way Imbolya\u0027s lips thinned, Csenge realized she had been too short with her. \"Thank you, cousin,\" she added, to soften her request.\\n\\n \"Of course,\" said Imbolya, and went to the door, her head held a bit too high.\\n\\n \"Do you dislike her?\" Kunigunde muttered, her eyes still closed.\\n\\n \"She\u0027s very young,\" said Csenge.\\n\\n \"True enough, but do you dislike her?\" The question was slightly louder but much more pointed.\\n\\n Startled, Csenge stared down at the Konige. \"I ... It\u0027s hard to say ... I don\u0027t dislike her ... exactly. She can read, you know.\" She disliked Rozsa of Borsod for her prettiness and the high favor her husband enjoyed in the King\u0027s Court; she disliked Teca of Veszbrem for her endless praise of her dead husband. Imbolya annoyed her, and that was entirely different.\\n\\n \"Then what is it, exactly? Is it family rivalry, perhaps? Have you been agonistic in any way? Do you dislike having her at my Court? Or is it simply that she is so young? What bothers you about her?\" Kunigunde inquired; caught off guard, Csenge could think of nothing more to say. \"Csenge of Somogy, I asked you a question.\"\\n\\n The ringing in her ears was louder; Csenge saw spangles around the center of her gaze, and as her queasiness grew worse, she put her hand to her mouth. \"Pardon, dear Royal. I fear I am about to be sick,\" she said, and without ceremony, stumbled up from her chair and hurried unsteadily out of the solarium, making for her small room on the floor below. All but tumbling down the steep staircase, she leaned against the wall as she rushed for her apartment. She found the chamber-pot just in time, and when she had vomited into it, she remained on her knees, panting, trying to stop the clamor in her head. She was astonished by what she had done; what would the Konige make of her flight? She might well be offended that Csenge had not answered her. Perhaps she would order her to absent herself from the Konige\u0027s Court. If that were to happen, how would she reestablish her position with Kunigunde? What would her husband say when he learned of what she had done?\\n\\n A soft knock on the door warned of the arrival of Imbolya, with whom she shared the cell-like room. \"Cousin Csenge? Are you all right?\"\\n\\n \"I will need a house-slave to-\"\\n\\n \"-remove the chamber-pot, yes. I\u0027ve sent for one of them already.\" Imbolya opened the door a crack; the wedge of light this admitted made Csenge\u0027s eyes burn. \"Do you want water, or wine, or apple cider?\"\\n\\n Just the mention of these made Csenge\u0027s stomach clench. \"Not now.\"\\n\\n \"Then a damp cloth for your forehead? Would you like me to get a potion for you from Klotild?\" Imbolya sounded so sympathetic that Csenge ground her teeth.\\n\\n \"Don\u0027t bother. I will be better presently. Attend to the Konige.\" She felt another cramp in her abdomen, and she shivered as her muscles tightened. \"God and the Virgin!\" she mumbled. \"What\u0027s happening to me?\"\\n\\n \"Are you certain you don\u0027t need any help?\" Imbolya persisted. \"You don\u0027t sound-\"\\n\\n \"I will be well shortly.\"\\n\\n \"Shall I send for Frater Lovre to aid you?\"\\n\\n The thought of the half-blind monk patting at her with his flaccid hands sent another surge of nausea through Csenge. She swallowed convulsively. \"I do not need anything,\" she said with great precision. \"I will be better if you leave me alone.\"\\n\\n It took a long moment for Imbolya to accept this rebuke; she remained at the door, peering into the dark room. \"Shall I come back later? \"\\n\\n \"It is your room as well as mine; I can hardly keep you out.\" She felt very, very tired. \"Do as you think you must.\"\\n\\n \"I\u0027m worried for you, cousin,\" said Imbolya in a tone that meant she was worried for herself. \"You are not well, and it may be that because of you, our Konige is not well. We are sworn to preserve her in health at all costs.\" She stood very straight at the edge of the door. \"Do let me come in. I can succor you.\"\\n\\n \"Not just now,\" said Csenge. \"I am still at some loss...\" Her bowels twisted once more. \"I\u0027d like to think that...\" She bent over and retched.\\n\\n Imbolya pushed the door open enough to see Csenge; the two stared at each other. \"What am I to do, if you are so compromised?\\n\\n \"You fear I have taken a contagion? Is that it?\" Csenge demanded, putting the chamber-pot aside. \"You think I should be moved out of the Konige\u0027s Court until I recover, like Erzebet?\" The very notion was intolerable, for once out of the Konige\u0027s Court, she could as easily be replaced as allowed to return.\\n\\n \"I ... I ... don\u0027t know,\" said Imbolya unhappily.\\n\\n \"Then keep your thoughts to yourself,\" snapped Csenge as she wiped her mouth.\\n\\n \"But if the Konige should become ill-\"\\n\\n \"It is the heat,\" said Csenge. \"Everyone is suffering from it.\"\\n\\n Imbolya hesitated, unwilling to go against her influential cousin, yet keenly aware of what she was required to do as a lady-in-waiting. Finally she put her hands to her eyes and wept with frustration. She took a step toward Csenge. \"You should lie down,\" she said, trying to stop her tears. \"Truly, cousin, you are not well.\"\\n\\n \"No, I shouldn\u0027t lie down; I should go and help Rozsa with Kinga. It is time.\" Csenge got unsteadily to her feet, one arm extended to secure her balance. After an attempt at walking, she gave up. \"But I\u0027m going to send you in my stead. Since you are worried that I might have a fever, it would be best if I didn\u0027t venture near the child, or the mother.\" She tottered over to her bed. \"There. Are you satisfied? Do you want anything more of me?\"\\n\\n \"Shall I help you to undress?\" Imbolya asked.\\n\\n \"I can manage for myself,\" said Csenge firmly. \"Tell dear Royal that I\u0027m overheated and need to lie down. Then go to-\"\\n\\n \"Rozsa of Borsod,\" said Imbolya, accepting her task.\\n\\n \"Tell her you\u0027ll remain with Kinga through supper and see her to Teca and Betrica\u0027s care for the night.\" Csenge resisted another urge to throw up, and wondered briefly if her dislike of Rozsa was the cause.\\n\\n \"I will,\" Imbolya promised her.\\n\\n Bile rose on the back of Csenge\u0027s tongue, and this time she noticed a second taste in its acridity. \"Did you eat the fish-stew at dinner?\" she asked.\\n\\n \"No,\" said Imbolya. \"I had the lamb-ribs. And the pheasant with chestnuts; it was dry.\"\\n\\n \"Ask if others who had the fish-stew have felt unwell,\" said Csenge. \"I keep tasting fish.\" Very carefully she sat on her bed, doing nothing hurriedly; she felt her insides roil.\\n\\n \"Do you think that it was tainted?\" Imbolya\u0027s shock was tempered with relief.\\n\\n \"Fish taints quickly, and in this heat...\" She left the rest unsaid.\\n\\n \"It would be a bad thing, of course, and many may have suffered from it, but better tainted fish than fever,\" Imbolya said, and dared to touch Csenge\u0027s arm. \"Shall I ask before or after I watch the dear Little Royal?\"\\n\\n It was tempting to lash out at the girl, but Csenge decided she needed Imbolya\u0027s help just now too much to berate her. \"Before, of course. If the fish was tainted, then there\u0027s no need to alarm the Konige with rumors of fevers, is there?\" This last was pointed and underscored by a single, hard stare.\\n\\n \"N ... no,\" said Imbolya, keenly aware of her cousin\u0027s intent. \"I wouldn\u0027t want to add to dear Royal\u0027s upset, considering how wretched the heat has already made her. But if there is another cause for your-\"\\n\\n Csenge nodded. \"If it isn\u0027t the fish, you may tell the Konige that I am prostrated by the heat, but say nothing about a fever. Nothing.\"\\n\\n \"If Rozsa asks? What am I to tell her?\"\\n\\n \"The same thing,\" said Csenge. \"You have to make it plain that I am not ill, just struck by the weather. I\u0027m not the only one, by the Virgin, I\u0027m not.\"\\n\\n \"They say the Devil revels in the heat,\" Imbolya remarked, crossing herself. \"He could summon up a plague, couldn\u0027t he?\"\\n\\n \"If God allows it,\" Csenge said darkly. \"If we have strayed from Him, God will chastise us for our failure.\" This time, when she crossed herself, she longed for the comfort of Pader Lupu, her old Confessor, who always made her see God\u0027s Plan in every misfortune. Here at Court, she knew better than to rely on the priests to support her. \"Go on. Find out about the fish and then take up my post with Kinga.\"\\n\\n \"Of course. Of course, cousin; at once,\" said Imbolya, and hurried out of the room, closing the door before she went off down the hall that led to the great hall and the kitchens.\\n\\n Satisfied that she finally would be left alone, Csenge reached out with her foot, snagged the chamber-pot, and pulled it toward her; she could tell she would need it again before long.\\n\\n Text of a letter from Counselor Smiricti Detrich of Praha to the apothecary Huon of Paris at his shop in Praha, written by Frater Ulric and delivered by messenger.\\n\\n To the accomplished French apothecary, Huon of Paris, the greetings of Smiricti Detrich, Counselor of Praha, on this, the twenty-third day of May in the 1269th Year of Salvation,\\n\\n My dear Master Apothecary,\\n\\n I wish to secure from you such nostrums and potions as you have to treat obstinate flux. I fear that all of my household must succumb to it unless you have a means of treating it unknown to the physicians of the city. One of my slaves, an older man with a habitual cough, has already died of it, and all but two have shown some signs of it. The servants in the household are also afflicted, and that gives me cause for concern, in that it may soon reach my family and me.\\n\\n The city is afraid the wells may have been poisoned, which would account for the spread of the sickness. If you have some means of determining if this is a justified fear, I and the other Counselors would be most grateful. We would provide you a stipend for any work you might do to improve the quality of the wells, if they are truly the source of the contagion. As the apothecary to Episcopus Fauvinel, we are certain you have the ability to produce a cure for whatever it is that is making so many in Praha sick.\\n\\n If you would be good enough to call upon me at my house, I will discuss all the aspects of the current outbreak that I have discovered, including the spread of it, and the nature of the miasma that may be spreading from the wells to the people. In the meantime, Episcopus Fauvinel has authorized the priests in all the churches of the city to offer Masses of healing, and encouraged those who are well to show their Christian charity and visit those who are suffering from this affliction. Although there have been few deaths among those contracting the illness, we, the Counselors, have declared that a pit for burial of all those dying of it should be dug and consecrated outside the walls, so that no lingering infection may spread from those interred.\\n\\n My servant will bring me your answer, and if you require it, will guide you to my door.\\n\\n May God bless you for your help to those in need.\\n\\n Smiricti Detrich\\n\\n Counselor of Praha (his mark)\\n\\n by the hand of Frater Ulric \\n\\n","sourceLink":"https://allnovel.net/an-embarrassment-of-riches-saint-germain-24/page-4.html","bookId":2506,"book":{"id":2506,"title":"An Embarrassment of Riches (Saint-Germain #24)","description":"Storyline: An Embarrassment of Riches (Saint-Germain #24) \\n More than two decades strong, the Saint-Germain cycle is one of the most compelling works of dark fantasy and horror of our age. Historically accurate, often involving key events or figures from throughout world history, these deeply emotional novels have a devoted readership. Each novel is written as a stand-alone and they are not chronologically consecutive, so readers may enter the saga with any book and move backward or forward in time as they choose, from Pharaonic Egypt to Paris in the 1700s, from the fall of the Roman Empire to World War II Europe. \\n In An Embarrassment of Riches, the vampire Count finds himself a virtual prisoner in the Court of Kunigunde in Bohemia in the 1200s. Rakoczy Ferncsi, as Saint-Germain is known, passes his days making jewels to delight Queen Kunigunde and trying not to become involved in the Court\u0027s intrigues. In this, the vampire fails. Handsome, apparently wealthy, and obviously unmarried, he soon finds himself being sexually blackmailed by Rozsa, an ambitious lady-in-waiting. If he does not satisfy her, she will denounce him to the priests and he\u0027ll be burned at the stake, resulting in his True Death. Despite his care, the vampire makes more than one enemy at the Bohemian Court, and by the end of An Embarrassment of Riches, the Count can see only one road to freedom...through death.\\n","cover":"https://allnovel.net/images/an-embarrassment-of-riches-saint-germain-24.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/an-embarrassment-of-riches-saint-germain-24.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:05:36 PM"}}
