{"id":107297,"no":8,"title":"Page 8","content":"RAKOCZY FERANCSI, COMES SANTU-GERMANIU Prologue Text of a letter from Smiricti Detrich, Counselor of Praha, to Rakoczy Ferancsi, Comes Santu-Germaniu, at Mansion Belcrady in Praha, carried by Council messenger. To the highly esteemed Comes Santu-Germaniu at Mansion Belcrady, the greetings of Smiricti Detrich, Counselor of Praha, by the hand of the Counselor\u0027s scribe and clerk, Frater Ulric, on this, the second day of September, in the 1269th year of Salvation, Most worthy Comes, It is my duty to inform you that the Counselors of Praha have met to determine the taxes for the city; those laid upon the Mansion Belcrady have increased, due to the high cost of Konig Otakar\u0027s campaign in the south, which is a decision that I have been given the privilege of informing you. I regret to tell you that you will be asked to pay another six standard ingots of gold beyond what you have already provided us to support his campaign. All foreigners are being assessed additional monies, so this is not intended to inconvenience you and no other. However, as you have the grandest establishment, the actual amount required of you is larger than for other foreign residents in the city. I am of the opinion that your rate is too high, even for an exile. The rest of the Counselors disagree, and I must capitulate to their wishes or resign my post; the latter course would benefit neither of us, and so I have acquiesced, in the hope that I might, in future, be in a position to advocate for you. I ask you to comply with these demands now, and trust me to do what is in my power to intercede for you next May. You will have until the beginning of Advent to pay the amount due or to find other housing. I know this is abrupt, and for that, I ask your understanding; you have been a most upright and responsible resident, for all you are an exile, and it troubles me to see the hand of the Konig\u0027s necessity fall so heavily on you, but this must be God\u0027s Will, for He has brought you here in Konig Otakar\u0027s time of need. Your gold will help the Konig to make the most of the winter without reducing his own treasury. Production of gold has already been increased at the mines, and Konig Otakar has money from those efforts coming to him in quantity, but the bulk of the sums will not be ready until the spring, and the costs he is encountering are immediate. The Konig is determined to see his army enter the field next spring fully armed and ready for whatever Comes Rudolph von Hapsburg of Austria may have in store for him, which requires a large outlay before the Nativity so that the smiths and armorers may spend the winter preparing all that the Konig requires. I am disinclined to deny Otakar what he seeks, for he has succeeded so well that the Hand of God is certainly in his successes, and those of us who aid him now will gain Royal favor in this life and the approval of God in the next. That the brunt of these costs will be borne by you is unfortunate, but as the loyal vassal of Konig Otakar, I must continue to ensure that everything is done to bring about his vision of a Bohemian Empire. With the Konig preparing to return to Praha and the Konige about to give him his long-sought heir, there will be grand occasions for celebration in the city, and therefore we must prepare to show our loyalty and corroboration of the greatness of this reign: to that end I implore you, if you are able to spare more money, to contribute toward the occasions that will herald the arrival of the Nativity Season. We will put forth the embodiments of our rejoicing. A civic procession and Royal Contest is planned already, and will require stands for those attending, as well as display wagons for the Guilds and great Houses of all Praha. Episcopus Fauvinel has already promised that he will have his troupe of dwarves and hunchbacks perform their antics in the procession. And that he will bless the occasion. Any donation you make to any aspect of the festivities will stand you in good stead with the Council as well as the Konige\u0027s Court, and therefore I implore you to do what you may to add to our coffers and our splendid occasions. I also ask that you impart to me any ideas you may have for improving the welcome we will give the Konig when he once again enters our gates. Perhaps you will agree to meet with me in ten days\u0027 time? This week, unless the Konige gives birth, of course, I will be spending most of my days with my fellow-Counselors deciding the suit brought by the Beggars\u0027 Guild against the rats that are so plentiful in Praha. Episcopus Fauvinel has given his permission for the suit to proceed as promptly as possible, and the Council is happy to accommodate him in this matter. If the suit is decided in favor of the Beggars\u0027 Guild, then we will have to hire an experienced rat-catcher and pay to have the rats killed, as well as offer rewards for those who are willing to help rid the city of the rats, but if the rats prevail, then any member of the Beggars\u0027 Guild caught killing a rat will have his hand struck off, and any resident of the city found to be killing rats will be fined three ingots of silver. Since this is an issue of significance, and given that there are so many other demands at this time, until we have reached a decision in regard to the Beggars\u0027 Guild suit, I fear I will not be available to you before the ten days have passed. With deep gratitude to you for your many helpful acts and for your gracious acquiescence in delivering your assessed portion toward our glorifying Bohemia and Przemysl Otakar II in his time of victory, Smiricti Detrich Counselor of Praha by the hand of Frater Ulric, Hieronymite monk","sourceLink":"https://allnovel.net/an-embarrassment-of-riches-saint-germain-24/page-8.html","bookId":2506,"book":{"id":2506,"title":"An Embarrassment of Riches (Saint-Germain #24)","description":"Storyline: An Embarrassment of Riches (Saint-Germain #24) More than two decades strong, the Saint-Germain cycle is one of the most compelling works of dark fantasy and horror of our age. Historically accurate, often involving key events or figures from throughout world history, these deeply emotional novels have a devoted readership. Each novel is written as a stand-alone and they are not chronologically consecutive, so readers may enter the saga with any book and move backward or forward in time as they choose, from Pharaonic Egypt to Paris in the 1700s, from the fall of the Roman Empire to World War II Europe. In An Embarrassment of Riches, the vampire Count finds himself a virtual prisoner in the Court of Kunigunde in Bohemia in the 1200s. Rakoczy Ferncsi, as Saint-Germain is known, passes his days making jewels to delight Queen Kunigunde and trying not to become involved in the Court\u0027s intrigues. In this, the vampire fails. Handsome, apparently wealthy, and obviously unmarried, he soon finds himself being sexually blackmailed by Rozsa, an ambitious lady-in-waiting. If he does not satisfy her, she will denounce him to the priests and he\u0027ll be burned at the stake, resulting in his True Death. Despite his care, the vampire makes more than one enemy at the Bohemian Court, and by the end of An Embarrassment of Riches, the Count can see only one road to freedom...through death.","cover":"https://allnovel.net/images/an-embarrassment-of-riches-saint-germain-24.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/an-embarrassment-of-riches-saint-germain-24.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:05:36 PM"}}
