{"id":103265,"no":11,"title":"Page 11","content":"The Wiley Beck office Christmas party would begin with a lunch catered by two feuding Greek brothers who made the best baklava in the city. The bar opened at precisely eleven forty-five-three bars actually-and soon thereafter things got sloppy. Stanley Wiley would be the first to get smashed-he\u0027d blame it on the loaded eggnog-and he\u0027d stand on a box at the end of the conference table and deliver the same speech he\u0027d given a week earlier at the black-tie Christmas dinner. Then they\u0027d present him with a gift, a shotgun or a new sand wedge or some other useless souvenir that he\u0027d practically cry over, then quietly give to a client months later. There\u0027d be other gifts, some speeches and gags, and a song or two as the booze flowed. Two male strippers appeared one year, and, to the beat of a howling boom box, disrobed down to their leopard thongs while the men ran for cover and the secretaries squealed with delight. Dox, Luther\u0027s secretary, had squealed the loudest and still had photos of the boys. In a memo, Stanley had banned future strippers. By five, some of the most starched and staid accountants at Wiley Beck would be groping or attempting to grope some of the homeliest secretaries. Getting plastered was accepted behavior. They\u0027d haul Stanley to his office and fill him with coffee before he could go home. The firm hired cars so no one would drive. All in all, it was a mess. But the partners loved it because it was a good drunk away from their wives, who\u0027d been properly entertained at the firm\u0027s fancy Christmas dinner and had never been invited to the office party. The secretaries loved it because they saw and heard things they could tuck away and use as blackmail for the rest of the year. Luther hated the Christmas party even in a good year. He drank little and never got drunk, and every year he was embarrassed for his colleagues as they made fools of themselves. So he stayed in his office with his door locked and tended to last-minute details. Then some music started down the hall just after 11 A.M. Luther found the right moment and disappeared. It was the twenty-third of December. He wouldn\u0027t return until the sixth of January, and by then the office would be back to normal. Good riddance. He stepped into the travel agency to say good-bye to Biff, but she was already gone, off to a fabulous new resort in Mexico that offered a holiday package. He walked briskly to his car, quite proud that he was skipping the madness up on the sixth floor. He drove toward the mall, for one last tanning session, one last look at the crush of idiots who\u0027d waited till almost the last minute to buy whatever was left in the stores. The traffic was dense and slow, and when he finally arrived at the mall a traffic cop was blocking the entrance. Parking lots were full. No more room. Go away. Gladly, thought Luther. He met Nora for lunch at a crowded bakery in the District. They\u0027d actually made a reservation, something unheard of for the rest of the year. He was late. She\u0027d been crying. \"It\u0027s Bev Scheel,\" she said. \"Went for a checkup yesterday. The cancer\u0027s back, for the third time.\" Though Luther and Walt had never been close, their wives had managed to maintain good relations over the past couple of years. Truth was, for many years no one on Hemlock had much to do with the Scheels. They\u0027d worked hard to have more, and their higher income had always been on display. \"It\u0027s spread to her lungs,\" Nora said, wiping her eyes. They ordered sparkling water. \"And they suspect it\u0027s in her kidneys and liver.\" Luther winced as the horrific disease crept on. \"That\u0027s awful,\" he said in a low voice. \"This could be her last Christmas.\" \"Did her doctor say that?\" he asked, wary of amateur prognostications. \"No, I did.\" They dwelt on the Scheels far too long, and when Luther\u0027d had enough he said, \"We leave in forty-eight hours. Cheers.\" They touched plastic glasses and Nora managed a smile. Halfway through their salads, Luther asked, \"Any regrets?\" She shook her head no, swallowed, and said, \"Oh, I\u0027ve missed the tree at times, the decorations, the music, the memories, I guess. But not the traffic and shopping and stress. It was a great idea, Luther.\" \"I\u0027m a genius.\" \"Let\u0027s not get carried away. You think Blair will even think about Christmas?\" \"Not if she\u0027s lucky. Doubt it,\" he said with a mouthful. \"She\u0027s working with a bunch of heathen savages who worship rivers and such. Why should they take a break for Christmas?\" \"That\u0027s a little harsh, Luther. Savages?\" \"Just kidding, dear. I\u0027m sure they\u0027re gentle people. Not to worry.\" \"She said she never looks at a calendar.\" \"Now that\u0027s impressive. I\u0027ve got two calendars in my office and I still forget which day it is.\" Millie from the Women\u0027s Clinic barged in with a hug for Nora and a Merry Christmas for Luther, who would\u0027ve otherwise been irritated except that Millie was tall and lanky and very cute for a woman her age. Early fifties. \"You heard about Bev Scheel,\" Millie whispered as if Luther had suddenly vanished. Now he was irritated. He prayed bed never be stricken with some dreadful disease, not in this city. The volunteer women would know about it before he did. Give me a heart attack or a car wreck, something quick. Something that cannot be whispered about while I linger. Millie finally left, and they finished their salads. Luther was famished as he paid the check, and caught himself once again dreaming of the luxurious spreads of food in the Island Princess brochures. Nora had errands to run. Luther did not. He drove to Hemlock, parked in his driveway, a little relieved that there were no neighbors loitering near his house. In the daily mail there were four more anonymous Frosty Christmas cards, these postmarked in Rochester, Fort Worth, Green Bay, and St. Louis. Frohmeyer\u0027s bunch at the university traveled a lot, and Luther suspected this was their little game. Frohmeyer was restless and creative enough to mastermind such a prank. Thirty-one Frosty cards had now been received, two all the way from Vancouver. Luther was saving them, and when he returned from the Caribbean he planned to stuff them in a large envelope and mail them, anonymously of course, to Vic Frohmeyer, two doors down. \"They\u0027ll arrive with all of his credit card bills,\" Luther said to himself as he put the Frosty cards in a drawer with the others. He made a fire, settled under a quilt in his chair, and fell asleep. It was a rowdy night on Hemlock. Marauding bands of boisterous carolers took turns at the Krank house. Often they were assisted by neighbors seized by the spirit of the moment. At one point, a chant of \"We Want Frosty!\" erupted behind a choir from the Lions Club. Handmade signs demanding \"Free Frosty\" appeared, the first hammered into the ground by none other than Spike Frohmeyer. He and his little gang were up and dawn Hemlock, on skateboards and bikes, yelling and reveling in their pre-Christmas Eve exuberance. An impromptu block party materialized. Trish Trogdon fixed hot cocoa for the kids while her husband, Wes, rigged up speakers in the driveway. Soon \"Frosty the Snowman\" and \"Jingle Bells\" were wafting through the night, interrupted only when a real choir arrived to serenade the Kranks. Wes played a selection of favorites, but his favorite that night was \"Frosty.\" The Krank home remained dark and quiet, locked and secure. Nora was in the bedroom gathering what she wanted to pack. Luther was in the basement, trying to read.","sourceLink":"https://allnovel.net/skipping-christmas/page-11.html","bookId":2639,"book":{"id":2639,"title":"Skipping Christmas","description":"Storyline: Imagine a year without Christmas. No crowded shops, no corny office parties, no fruitcakes, no unwanted presents. That\u0027s just what Luther and Nora Krank have in mind when they decide that, just this once, they\u0027ll skip the holiday altogether. Theirs will be the only house on the street without a rooftop Frosty the snowman; they won\u0027t be hosting their annual Christmas Eve bash; they aren\u0027t even going to have a tree. They won\u0027t need one, because come December 25 they\u0027re setting sail on a Caribbean cruise. But, as this weary couple is about to discover, skipping Christmas brings enormous consequences - and isn\u0027t half as easy as they\u0027d imagined. A classic tale for modern times, Skipping Christmas offers a hilarious look at the chaos and frenzy that has become part of our holiday tradition.","cover":"https://allnovel.net/images/skipping-christmas.jpg","author":"John Grisham","type":"Humorous","source":"allnovel","link":"https://allnovel.net/skipping-christmas.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:22:30 PM"}}
