{"id":66073,"no":3,"title":"Page 3","content":"She drove back to D.C. in her Suburban and argued with herself the whole way. If the news is really bad, when do I involve Stuyvesant? Now? Later? In the end she pulled over on Dupont Circle and called him at home and asked him the question direct.\n \"I\u0027ll get involved when I need to,\" he said. \"Who did you use?\"\n \"Joe Reacher\u0027s brother.\"\n \"Our Joe Reacher? I didn\u0027t know he had a brother.\"\n \"Well, he did.\"\n \"What\u0027s he like?\"\n \"Just like Joe, maybe a little rougher.\"\n \"Older or younger?\"\n \"Both,\" Froelich said. \"He started out younger, and now he\u0027s older.\"\n Stuyvesant went quiet for a moment.\n \"Is he as smart as Joe?\" he asked.\n \"I don\u0027t know yet,\" Froelich said.\n Stuyvesant went quiet again. \"So call me when you need to. But sooner rather than later, OK? And don\u0027t say anything to anybody else.\"\n She ended the call and threaded back into the Sunday traffic and drove the last mile and parked outside the hotel. The desk was expecting her and sent her straight up to 1201, twelfth floor. She followed a waiter through the door. He was carrying a tray with a pot of coffee and two upside-down cups on saucers. No milk, no sugar, no spoons, and a single pink rose in a narrow china vase. The room was standard-issue city hotel. Two queen beds, flowery prints at the window, bland lithographs on the walls, a table, two chairs, a desk with a complicated phone, a credenza with a television, a connecting door to the next room. Reacher was sitting on the nearer bed. He was wearing a black nylon warm-up jacket with a black T-shirt and black jeans and black shoes. He had an earpiece in his ear and a pretty good fake Secret Service pin in the collar of the jacket. He was clean shaven and his hair had been cut very short and was neatly combed.\n \"What have you got for me?\" she asked.\n \"Later,\" he said.\n The waiter put the tray on the table and backed silently out of the room. Froelich watched the door click shut behind him and turned back to Reacher. Paused a beat.\n \"You look just like one of us,\" she said.\n \"You owe me lots of money,\" he said.\n \"Twenty grand?\"\n He smiled. \"Most of that. They told you about it?\"\n She nodded. \"But why a cashier\u0027s check? That puzzled me.\"\n \"It won\u0027t, soon.\"\n He stood up and stepped across to the table. Righted the cups and picked up the pot and poured the coffee.\n \"You timed the room service well,\" she said.\n He smiled again. \"I knew where you were, I knew you\u0027d be driving back. It\u0027s Sunday, no traffic. Easy enough to derive an ETA.\"\n \"So what have you got to tell me?\"\n \"That you\u0027re good,\" he said. \"That you\u0027re really, really good. That I don\u0027t think anybody else could do this better than you.\"\n She went quiet. \"But?\"\n \"But you\u0027re not good enough. You need to face that whoever it is out there could walk right in and get the job done.\"\n \"I never said there\u0027s anybody out there.\"\n He said nothing.\n \"Just give me the information, Reacher.\"\n \"Three and a half,\" he said.\n \"Three and a half what? Out of ten?\"\n \"No, Armstrong\u0027s dead, three and a half times over.\"\n She stared at him. \"Already?\"\n \"That\u0027s how I score it,\" he said.\n \"What do you mean, a half?\"\n \"Three definites and one possible.\"\n She stopped halfway to the table and just stood there, bewildered.\n \"In five days?\" she said. \"How? What aren\u0027t we doing?\"\n \"Have some coffee,\" he said.\n She moved toward the table like an automaton. He handed her a cup. She took it and backed away to the bed. The cup rattled in the saucer.\n \"Two main approaches,\" Reacher said. \"Like in the movies, John Malkovich or Edward Fox. You\u0027ve seen those movies?\"\n She nodded blankly. \"We have a guy monitoring the movies. In the Office of Protection Research. He analyzes all the assassination movies. John Malkovich made In the Line of Fire with Clint Eastwood.\"\n \"And Rene Russo,\" Reacher said. \"She was pretty good.\"\n \"Edward Fox was in The Day of the Jackal, way back.\"\n Reacher nodded. \"John Malkovich was looking to take out the President of the United States, and Edward Fox was looking to take out the President of France. Two competent assassins, working solo. But there was a fundamental difference between them. John Malkovich knew all along he wasn\u0027t going to survive the mission. He knew he\u0027d die a second after the President. But Edward Fox aimed to get away with it.\"\n \"He didn\u0027t, though.\"\n \"It was a movie, Froelich. Had to end that way. He could have gotten away with it, easy as anything.\"\n \"So?\"\n \"It gives us two strategies to consider. A close-up suicide mission, or a clean long-distance job.\"\n \"We know all that. I told you, we have a person working on it. We get transcripts, analyses, memos, position papers. We talk to the screenwriters sometimes, if there\u0027s new stuff. We want to know where they get their ideas from.\"\n \"Learn anything?\"\n She shrugged and sipped her coffee and he saw her trawl back through her memory, like she had all the transcripts and all the memos and all the position papers stashed away in a mental filing cabinet.\n \"The Day of the Jackal impressed us, I think,\" she said. \"Edward Fox played a pro shooter who had a rifle built so it could be disguised as a crutch for a handicapped veteran. He used the disguise to get into a nearby building some hours before a public appearance and planned a long-range head shot from a high-floor window. He was using a silencer, so he could get away afterward. Could have worked, in theory. But the story was set a long time ago. Before I was born. Early sixties, I think. General de Gaulle, after the Algerian crisis, wasn\u0027t it? We enforce far wider perimeters now. The movie was a factor in that, I guess. Plus our own problems in the early sixties, of course.\"\n \"And In the Line of Fire?\" Reacher asked.\n \"John Malkovich played a renegade CIA operative,\" she said. \"He manufactured a plastic pistol in his basement so he could beat the metal detectors and conned his way into a campaign rally and intended to shoot the President from very close range. Whereupon, as you say, we would have taken him down immediately.\"\n \"But old Clint jumped into the path of the bullet,\" Reacher said. \"Good movie, I thought.\"\n \"Implausible, we thought,\" Froelich answered. \"Two main faults. First, the idea that you can build a working pistol from hobbyist material is absurd. We look at stuff like that all the time. His gun would have exploded, blown his hand off at the wrist. The bullet would have just fallen out of the wreckage onto the floor. And second, he spent about a hundred thousand dollars along the way. Lots and lots of travel, phony offices for mail drops, plus a fifty-thousand-dollar donation to the party that got him into the campaign rally in the first place. Our assessment was a maniac personality like that wouldn\u0027t have big bucks to spend. We dismissed it.\"\n \"It was only a movie,\" Reacher said. \"But it was illustrative.\"\n \"Of what?\"\n \"Of the idea of getting into a rally and attacking the target from close quarters, as opposed to the old idea of going for long-distance safety.\"\n Froelich paused. Then she smiled, a little warily at first, like a grave danger might be receding into the distance.\n \"Is this all you\u0027ve got?\" she said. \"Ideas? You had me worried.\"\n \"Like the rally here on Thursday night,\" Reacher said. \"A thousand guests. Time and place announced in advance. Advertised, even.\"\n \"You found the transition\u0027s website?\"\n Reacher nodded. \"It was very useful. Lots of information.\"\n \"We vet it all.\"\n \"But it still told me every place Armstrong\u0027s going to be,\" Reacher said. \"And when. And in what kind of a context. Like the rally right here, Thursday night. With the thousand guests.\"\n \"What about them?\"\n \"One of them was a dark-haired woman who got hold of Armstrong\u0027s hand and pulled him a little off-balance.\"\n She stared at him. \"You were there?\"\n He shook his head. \"No, but I heard about it.\"\n \"How?\"\n He ignored the question. \"Did you see it?\"\n \"Only on video,\" she said. \"Afterward.\"\n \"That woman could have killed Armstrong. That was the first opportunity. Up to that point you were doing real well. You were scoring A-plus during the government stuff around the Capitol.\"\n She smiled again, a little dismissively. \"Could have? You\u0027re wasting my time, Reacher. I wanted better than could have. I mean, anything could happen. A bolt of lightning could hit the building. A meteorite, even. The universe could stop expanding and time could reverse. That woman was an invited guest. She was a party contributor. She passed through two metal detectors and she was ID-checked at the door.\"\n \"Like John Malkovich.\"\n \"We\u0027ve been through that.\"\n \"Suppose she was a martial-arts expert. Maybe military-trained in black ops. She could have broken Armstrong\u0027s neck like you could break a pencil.\"\n \"Suppose, suppose.\"\n \"Suppose she was armed.\"\n \"She wasn\u0027t. She passed through two metal detectors.\"\n Reacher put his hand in the pocket of his jacket and came out with a slim brown object.\n \"Ever seen one of these?\" he asked.\n It looked like a penknife, maybe three and a half inches long. A curved handle. He clicked a button and a speckled brown blade snapped outward.\n \"This is entirely ceramic,\" he said. \"Same basic stuff as a bathroom tile. Harder than anything except a diamond. Certainly harder than steel, and sharper than steel. And it doesn\u0027t trigger a metal detector. That woman could have been carrying this thing. She could have slit Armstrong open from his belly button to his chin with it. Or cut his throat. Or stuck it in his eye.\"\n He passed the weapon over. Froelich took it and studied it.\n \"Made by a firm called Boker,\" Reacher said. \"In Solingen, Germany. They\u0027re expensive, but they\u0027re relatively available.\"\n Froelich shrugged. \"OK, so you bought a knife. Doesn\u0027t prove anything.\"\n \"That knife was in the ballroom Thursday night. It was clutched in that woman\u0027s left hand, in her pocket, with the blade open, all the time she was shaking Armstrong\u0027s hand and pulling him close. She got his belly within three inches of it.\"\n Froelich stared at him. \"Are you serious? Who was she?\"\n \"She was a party supporter called Elizabeth Wright, from Elizabeth, New Jersey, as it happens. She gave the campaign four thousand bucks, a grand each in her name, her husband\u0027s, and her two kids\u0027. She stuffed envelopes for a month, put a big sign in her front yard, and operated a phone tree on Election Day.\"\n \"So why would she carry a knife?\"\n \"Well, actually, she didn\u0027t.\"\n He stood up and walked to the connecting door. Pulled his half open and knocked hard on the inner half.\n \"OK, Neagley,\" he called.\n The inner door opened and a woman walked in from the next room. She was somewhere in her late thirties, medium height and slim, dressed in blue jeans and a soft gray sweatshirt. She had dark hair. Dark eyes. A great smile. The way she moved and the tendons in her wrists spoke of serious gym time.\n \"You\u0027re the woman on the video,\" Froelich said.\n Reacher smiled. \"Frances Neagley, meet M. E. Froelich. M. E. Froelich, meet Frances Neagley.\"\n \"Emmy?\" Frances Neagley said. \"Like the television thing?\"\n \"Initials,\" Reacher said.\n Froelich stared at him. \"Who is she?\"\n \"The best Master Sergeant I ever worked with. Beyond expert-qualified on every kind of close-quarters combat you can think of. Scares the hell out of me, certainly. She got cut loose around the same time I did. Works as a security consultant in Chicago.\"\n \"Chicago,\" Froelich repeated. \"That\u0027s why the check went there.\"\n Reacher nodded. \"She funded everything, because I don\u0027t have a credit card or a checkbook. As you already know, probably.\"\n \"So what happened to Elizabeth Wright from New Jersey?\"\n \"I bought these clothes,\" Reacher said. \"Or rather, you bought them for me. And the shoes. Sunglasses, too. My version of Secret Service fatigues. I went to the barber. Shaved every day. I wanted to look plausible. Then I wanted a lone woman from New Jersey, so I met a couple of Newark flights at the airport here on Thursday. Watched the crowd and latched onto Ms. Wright and told her I was a Secret Service agent and there was a big security snafu going on and she should come with me.\"\n \"How did you know she was headed to the rally?\"\n \"I didn\u0027t. I just looked at all the women coming out of baggage claim and tried to judge by how they looked and what they were carrying. Wasn\u0027t easy. Elizabeth Wright was the sixth woman I approached.\"\n \"And she believed you?\"\n \"I had impressive ID. I bought this radio earpiece from Radio Shack, two bucks. Little electrical cord disappearing down the back of my neck, see? I had a rented Town Car, black. I looked the part, believe me. She believed me. She was quite excited about the whole thing, really. I brought her back to this room and guarded her all evening while Neagley took over. I kept listening to my earpiece and talking into my watch.\"\n Froelich switched her gaze across to Neagley.\n \"We wanted New Jersey for a reason,\" Neagley said. \"Their driver\u0027s licenses are the easiest to forge, you know that? I had a laptop and a color printer with me. I\u0027d just gotten through making Reacher\u0027s Secret Service ID for him. No idea if it was anything like the real thing, but it sure looked good. So I made up a Jersey license with my picture and her name and address on it, printed it out, laminated it with a thing we bought from Staples for sixty bucks, sandpapered the edges clean, scuffed it around a little bit, and shoved it in my bag. Then I dressed up some and took Ms. Wright\u0027s party invitation with me and headed downstairs. I got into the ballroom OK. With the knife in my pocket.\"\n \"And?\"\n \"I hung around, then I got hold of your guy. Held on for a spell.\"\n Froelich looked straight at her. \"How would you have done it?\"\n \"I had hold of his right hand in my right. I pulled him close, he rotated slightly, I had a clear shot at the right side of his neck. Three-and-a-half-inch blade, I\u0027d have stuck it through his carotid artery. Then jerked it around some. He\u0027d have bled to death inside thirty seconds. I was one arm movement away from doing it. Your guys were ten feet away. They\u0027d have plugged me afterward for sure, but they couldn\u0027t have stopped me from getting it done.\"\n Froelich was pale and silent. Neagley looked away.\n \"Without the knife would have been harder,\" she said. \"But not impossible. Breaking his neck would have been tricky because he\u0027s got some muscle up there. I\u0027d have had to do a quick two-step to get his weight moving, and if your guys were fast enough they might have stopped me halfway. So I guess I\u0027d have gone with a blow to his larynx, hard enough to crush it. A jab with my left elbow would have done the trick. I\u0027d have been dead before him, probably, but he\u0027d have suffocated right afterward, unless you\u0027ve got people that could do an emergency tracheotomy on the ballroom floor within a minute or so, which I guess you don\u0027t have.\"\n \"No,\" Froelich said. \"We don\u0027t have.\"\n Then she fell silent again.\n \"Sorry to ruin your day,\" Neagley said. \"But hey, you wanted to know this stuff, right? No point doing a security audit and not telling you the outcome.\"\n Froelich nodded. \"What did you whisper to him?\"\n \"I said, I\u0027ve got a knife. Just for the hell of it. But very quietly. If anybody had challenged me I was going to claim I\u0027d said, where\u0027s your wife? Like I was coming on to him. I imagine that happens, time to time.\"\n Froelich nodded again.\n \"It does,\" she said. \"Time to time. What else?\"\n \"Well, he\u0027s safe in his house,\" Neagley said.\n \"You checked?\"\n \"Every day,\" Reacher said. \"We\u0027ve been on the ground in Georgetown since Tuesday night.\"\n \"I didn\u0027t see you.\"\n \"That was the plan.\"\n \"How did you know where he lives?\"\n \"We followed your limos.\"\n Froelich said nothing.\n \"Good limos,\" Reacher said. \"Slick tactics.\"\n \"Friday morning was especially good,\" Neagley said.\n \"But the rest of Friday was pretty bad,\" Reacher said. \"Lack of coordination produced a major communications error.\"\n \"Where?\"\n \"Your D.C. people had video of the ballroom but clearly your New York people never saw it, because as well as being the woman in the party dress Thursday night Neagley was also one of the photographers outside the Stock Exchange.\"\n \"Some North Dakota paper has a website,\" Neagley said. \"Like all of them, with a graphic of their masthead. I downloaded it and modified it into a press pass. Laminated it and put brass eyelets in it and slung it around my neck with a nylon cord. Trawled the secondhand stores in lower Manhattan for battered old photo gear. Kept a camera up in front of my face the whole time so Armstrong wouldn\u0027t recognize me.\"\n \"You should operate an access list,\" Reacher said. \"Control it, somehow.\"\n \"We can\u0027t,\" Froelich said. \"It\u0027s a constitutional thing. The First Amendment guarantees journalistic access, any old time they want it. But they were all searched.\"\n \"I wasn\u0027t carrying,\" Neagley said. \"I was just breaching your security for the hell of it. But I could have been carrying, that\u0027s for damn sure. I could have gotten a bazooka past that kind of a search.\"\n Reacher stood up and stepped to the credenza. Pulled open a drawer and took out a stack of photographs. They were commercial one-hour six-by-four-inch color prints. He held up the first picture. It was a low-angle shot of Armstrong standing outside the Stock Exchange with the carved lintel inscription floating like a halo over his head.\n \"Neagley\u0027s,\" Reacher said. \"Good picture, I thought. Maybe we should sell it to a magazine, defray some of the twenty grand.\"\n He stepped back to the bed and sat down and passed the photograph to Froelich. She took it and stared at it.\n \"Point is I was four feet away,\" Neagley said. \"I could have gotten to him if I\u0027d wanted to. A John Malkovich situation again, but what the hell.\"\n Froelich nodded blankly. Reacher dealt the next print, like a playing card. It was a grainy telephoto picture clearly taken from a great distance, looking down from way above street level. It showed Armstrong outside the Stock Exchange, tiny in the center of the frame. There was a crude gunsight drawn around his head with a ballpoint pen.\n \"This is the half,\" Reacher said. \"I was on the sixtieth floor of an office building three hundred yards away. Inside the police perimeter, but higher than they were checking.\"\n \"With a rifle?\"\n He shook his head. \"With a piece of wood the same size and shape as a rifle. And another camera, obviously. And a big lens. But I played it out for real. I wanted to see if it was possible. I figured people wouldn\u0027t like to see a rifle-shaped package, so I got a big square box from a computer monitor and put the wood in diagonally, top corner to bottom corner. Then I just wheeled it into the elevator on a hand truck, pretended it was real heavy. I saw a few cops. I was wearing these clothes without the fake pin or the earpiece. I guess they thought I was a delivery driver or something. Friday after the closing bell, the district was getting quiet enough to be convenient. I found a window in an empty conference room. It wouldn\u0027t open, so I guess I\u0027d have had to cut out a circle of glass. But I could have taken a shot, just like I took the picture. And I\u0027d have been Edward Fox. I could have gotten clean away.\"\n Froelich nodded, reluctantly.\n \"Why only a half?\" she asked. \"Looks like you had him fair and square.\"\n \"Not in Manhattan,\" Reacher said. \"I was about nine hundred feet away and six hundred feet up. That\u0027s an eleven-hundred-foot shot, give or take. Not a problem for me ordinarily, but the wind currents and the thermals around those towers turn it into a lottery. They\u0027re always changing, second to second. Swirling, up and down and side to side. They make it so you can\u0027t guarantee a hit. That\u0027s the good news, really. No competent rifleman would try a distance shot in Manhattan. Only an idiot would, and an idiot\u0027s going to miss anyway.\"\n Froelich nodded again, a little relieved.\n \"OK,\" she said.\n So she\u0027s not worried about an idiot, Reacher thought. Must be a professional.\n \"So,\" he said. \"Call it a total score of three, if you want, and forget the half. Don\u0027t worry about New York at all. It was tenuous.\"\n \"But Bismarck wasn\u0027t tenuous,\" Neagley said. \"We got there about midnight. Commercial flights, through Chicago.\"\n \"I called you from a mile away,\" Reacher said. \"About the musicians.\"\n He dealt the next two photographs.\n \"Infrared film,\" he said. \"In the dark.\"\n The first picture showed the back of the Armstrong family house. The colors were washed out and distorted, because of the infrared photography. But it was a fairly close shot. Every detail was clearly visible. Doors, windows. Froelich could even see one of her agents, standing in the yard.\n \"Where were you?\" she asked.\n \"On the neighbor\u0027s property,\" Reacher said. \"Maybe fifty feet away. Simple night maneuver, infiltration in the dark. Standard infantry techniques, quiet and stealthy. Couple of dogs barked some, but we got around them. The state troopers in the cars didn\u0027t see a thing.\"\n Neagley pointed to the second picture. It showed the front of the house. Same colors, same detail, same distance.\n \"I was across the street, at the front,\" she said. \"Behind somebody\u0027s garage.\"\n Reacher sat forward on the bed. \"Plan would have been to have an M16 each, with the grenade launcher on it. Plus some other full-auto long guns. Maybe even M60 machine guns on tripods. We certainly had enough time to set them up. We\u0027d have put phosphorous grenades into the building with the M16s, simultaneously front and back, one each, ground floor, and either Armstrong would burn up in bed or we\u0027d shoot him down as he ran out the door or jumped out the window. We\u0027d have timed it for maybe four in the morning. Shock would have been total. Confusion would have been tremendous. We could have taken your agents out in the melee, easy as anything. We could have chewed the whole house to splinters. We\u0027d have probably exfiltrated OK too, and then it would have boiled down to a standard manhunt situation, which wouldn\u0027t have been ideal out there in the boonies, but we\u0027d probably have made it, with a bit of luck. Edward Fox again.\"\n There was silence.\n \"I don\u0027t believe it,\" Froelich said. She stared at the pictures. \"This can\u0027t be Friday night. This was some other night. You weren\u0027t really there.\"\n Reacher said nothing.\n \"Were you?\" she asked.\n \"Well, check this out,\" Reacher said. He handed her another photograph. It was a telephoto shot. It showed her sitting in the apartment window above the garage, staring out into the darkness, holding her cell phone. Her heat signature was picked up in strange reds and oranges and purples. But it was her. No doubt about it. Like she was close enough to touch.\n \"I was calling New Jersey,\" she said, quietly. \"Your musician friends got away OK.\"\n \"Good,\" Reacher said. \"Thanks for arranging it.\"\n She stared at the three infrared pictures, one after the other, and said nothing.\n \"So the ballroom and the family house were definites,\" Reacher said. \"Two-zip for the bad guys. But the next day was the real clincher. Yesterday. That rally at the church.\"\n He passed the last photo across. It was regular daylight film, taken from a high angle. It showed Armstrong in his heavy overcoat walking across the community center lawns. The late golden sun threw a long shadow out behind him. He was surrounded by a loose knot of people, but his head was clearly visible. It had another crude gunsight inked around it.\n \"I was in the church tower,\" Reacher said.\n \"The church was locked.\"\n \"At eight o\u0027clock in the morning. I\u0027d been in there since five.\"\n \"It was searched.\"\n \"I was up where the bells were. At the top of a wooden ladder, behind a trapdoor. I put pepper on the ladder. Your dogs lost interest and stayed on the first floor.\"\n \"It was a local unit.\"\n \"They were sloppy.\"\n \"I thought about canceling the event.\"\n \"You should have.\"\n \"Then I thought about asking him to wear a vest.\"\n \"Wouldn\u0027t have mattered. I would have aimed at his head. It was a beautiful day, Froelich. Clear sky, sunny, no wind at all. Cool, dense air. True air. I was a couple hundred feet away. I could have shot his eyes out.\"\n She went quiet.\n \"John Malkovich or Edward Fox?\" she asked.\n \"I\u0027d have hit Armstrong and then as many other people as I could, three or four seconds. Cops mostly, I guess, but women and children too. I\u0027d have aimed to wound them, not kill them. In the stomach, probably. More effective that way. People flopping around and bleeding all over the place, it would have created mass panic. Enough to get away, probably. I\u0027d have busted out of the church within ten seconds and gotten away into the surrounding subdivision fast enough. Neagley was standing by in a car. She\u0027d have been rolling soon as she heard the shots. So I\u0027d probably have been Edward Fox.\"\n Froelich stood up and walked to the window. Put her hands palms down on the sill and stared out at the weather.\n \"This is a disaster,\" she said.\n Reacher said nothing.\n \"I guess I didn\u0027t anticipate your level of focus,\" she said. \"I didn\u0027t know it was going to be all-out guerrilla warfare.\"\n Reacher shrugged. \"Assassins aren\u0027t necessarily going to be the gentlest people you\u0027ll ever meet. And they\u0027re the ones who make the rules here.\"\n Froelich nodded. \"And I didn\u0027t know you were going to get help, especially not from a woman.\"\n \"I kind of warned you,\" Reacher said. \"I told you it couldn\u0027t work if you were watching for me coming. You can\u0027t expect assassins to call ahead with their plans.\"\n \"I know,\" she said. \"But I was imagining a lone man, is all.\"\n \"It\u0027s always going to be a team,\" Reacher said. \"There are no lone men.\"\n He saw an ironic half smile reflected in the glass.\n \"So you don\u0027t believe the Warren Report?\" she asked.\n He shook his head.\n \"Neither do you,\" he said. \"No professional ever will.\"\n \"I don\u0027t feel like much of a professional today,\" she said.\n Neagley stood up and stepped over and perched on the sill, next to Froelich, her back against the glass.\n \"Context,\" she said. \"That\u0027s what you\u0027ve got to think about. It\u0027s not so bad. Reacher and I were United States Army Criminal Investigation Division specialists. We were trained in all kinds of ways. Trained to think, mostly. Trained to be inventive. And to be ruthless, for sure, and self-confident. And tougher than the people we were responsible for, and some of them were plenty tough. So we\u0027re very unusual. People as specialized as us, there\u0027s not more than maybe ten thousand in the whole country.\"\n \"Ten thousand is a lot,\" Froelich said.\n \"Out of two hundred eighty-one million? And how many of them are currently the right age and available and motivated? It\u0027s a statistically irrelevant fraction. So don\u0027t sweat it. You\u0027ve got an impossible job. You\u0027re required to leave him vulnerable. Because he\u0027s a politician. He\u0027s got to do all this visible stuff. We would never have dreamed of letting anybody do what Armstrong does. Never in a million years. It would have been completely out of the question.\"\n Froelich turned around and faced the room. Swallowed once and nodded vaguely into the middle distance.\n \"Thanks,\" she said. \"For trying to make me feel better. But I\u0027ve got some thinking to do, don\u0027t I?\"\n \"Perimeters,\" Reacher said. \"Keep the perimeters to a half-mile all around, keep the public away from him, and keep at least four agents literally within touching distance at all times. That\u0027s all you can do.\"\n Froelich shook her head.\n \"Can\u0027t do it,\" she said. \"It would be considered unreasonable. Undemocratic, even. And there are going to be hundreds of weeks like this one over the next three years. After three years it\u0027ll start to get worse because they\u0027ll be in their final year and they\u0027ll be trying to get reelected and everything will have to be looser still. And about seven years from now Armstrong will start looking for the nomination in his own right. Seen how they do that? Crowd scenes all over the place from New Hampshire onward? Town meetings in shirtsleeves? Fund-raisers? It\u0027s a complete nightmare.\"\n The room went quiet. Neagley peeled off the windowsill and walked across the room to the credenza. Took two thin files out of the drawer the photographs had been in. She held up the first.\n \"A written report,\" she said. \"Salient points and recommendations, from a professional perspective.\"\n \"OK,\" Froelich said.\n Neagley held up the second file.\n \"And our expenses,\" she said. \"They\u0027re all accounted for. Receipts and all. You should make the check payable to Reacher. It was his money.\"\n \"OK,\" Froelich said again. She took the files and clasped them to her chest, like they offered her protection from something.\n \"And there\u0027s Elizabeth Wright from New Jersey,\" Reacher said. \"Don\u0027t forget her. She needs to be taken care of. I told her that to make up for missing the reception you\u0027d probably invite her to the Inauguration Ball.\"\n \"OK,\" Froelich said for the third time. \"The Ball, whatever. I\u0027ll speak to somebody about it.\"\n Then she just stood still.\n \"This is a disaster,\" she said again.\n \"You\u0027ve got an impossible job,\" Reacher said. \"Don\u0027t beat up on yourself.\"\n She nodded. \"Joe used to tell me the same thing. He said, in the circumstances, we should consider a ninety-five percent success rate a triumph.\"\n \"Ninety-four percent,\" Reacher said. \"You\u0027ve lost one President out of eighteen since you guys took over. Six percent failure rate. That\u0027s not too bad.\"\n \"Ninety-four, ninety-five,\" she said. \"Whatever, I guess he was right.\"\n \"Joe was right about a lot of things, the way I recall it.\"\n \"But we\u0027ve never lost a Vice President,\" she said. \"Not yet.\"\n She put the files under one arm and stacked the photographs on the credenza and butted them around with her fingertips until they were neatly piled. Picked them up and put them in her bag. Then she glanced at each of the four walls in turn, like she was memorizing their exact details. A distracted little gesture. She nodded at nothing in particular and headed for the door.\n \"Got to go,\" she said.\n She walked out of the room and the door sucked shut behind her. There was silence for a spell. Then Neagley stood up straight at the end of one of the beds and clamped the cuffs of her sweatshirt in her palms and stretched her arms high above her head. She tilted her head back and yawned. Her hair cascaded over her shoulders. The hem of her shirt rode up and Reacher saw hard muscle above the waistband of her jeans. It was ridged like a turtle\u0027s back.\n \"You still look good,\" he said.\n \"So do you, in black.\"\n \"Feels like a uniform,\" he said. \"Five years since I last wore one.\"\n Neagley finished stretching. Smoothed her hair and pulled the hem of her shirt back down into place.\n \"Are we done here?\" she asked.\n \"Tired?\"\n \"Exhausted. We worked our butts off, ruining that poor woman\u0027s day.\"\n \"What did you think of her?\"\n \"I liked her. And like I told her, I think she\u0027s got an impossible job. And all in all, I think she\u0027s pretty good at it. I doubt if anybody else could do it better. And I think she kind of knows that too, but it\u0027s burning her up that she\u0027s forced to settle for ninety-five percent instead of a hundred.\"\n \"I agree.\"\n \"Who\u0027s this guy Joe she was talking about?\"\n \"An old boyfriend.\"\n \"You knew him?\"\n \"My brother. She dated him.\"\n \"When?\"\n \"They broke up six years ago.\"\n \"What\u0027s he like?\"\n Reacher glanced at the floor. Didn\u0027t correct the is to a was.\n \"Like a civilized version of me,\" he said.\n \"So maybe she\u0027ll want to date you, too. Civilized can be an overrated virtue. And collecting the complete set is always fun for a girl.\"\n Reacher said nothing. The room went quiet.\n \"I guess I\u0027ll head home,\" Neagley said. \"Back to Chicago. Back to the real world. But I got to say, it was a pleasure working with you again.\"\n \"Liar.\"\n \"No, really, I mean it.\"\n \"So stick around. A buck gets ten she\u0027ll be back inside an hour.\"\n Neagley smiled. \"What, to ask you out?\"\n Reacher shook his head. \"No, to tell us what her real problem is.\" \n","sourceLink":"https://allnovel.net/without-fail-jack-reacher-6/page-3.html","bookId":2344,"book":{"id":2344,"title":"Without Fail (Jack Reacher #6)","description":"Storyline: \n Without Fail (Jack Reacher #6) \n by Lee Child , Dick Hill (Narrator) \n Skilled, cautious, and anonymous, Jack Reacher is perfect for the job: to assassinate the vice president of the United States. Theoretically, of course. A female Secret Service agent wants Reacher to find the holes in her system, and fast - because a covert group already has the vice president in their sights. They\u0027ve planned well. There\u0027s just one thing they didn\u0027t plan on: Reacher.\n \n","cover":"https://allnovel.net/images/without-fail-jack-reacher-6.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/without-fail-jack-reacher-6.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 9:59:43 AM"}}
