{"id":66076,"no":6,"title":"Page 6","content":"It was waiting for them in the center of the long table in the conference room. A small crowd of people had gathered around it. The halogen spots in the ceiling lit it perfectly. There was a brown nine-by-twelve envelope with a metal closure and a torn flap. And a single sheet of white letter-size paper. On it were printed ten words: The day upon which Armstrong will die is fast approaching. The message was split into two lines, exactly centered between the margins and set slightly above the middle of the paper. There was nothing else visible. People stared at it in silence. The guy in the suit from the reception desk pushed backward through the crowd and spoke to Froelich.\n \"I handled the envelope,\" he said. \"I didn\u0027t touch the letter. Just spilled it out.\"\n \"How did it arrive?\" she asked.\n \"The garage guard took a bathroom break. Came back and found it on the ledge inside his booth. He brought it straight up to me. So I guess his prints are on the envelope too.\"\n \"When, exactly?\"\n \"Half hour ago.\"\n \"How does the garage guard work his breaks?\" Reacher asked.\n The room went quiet. People turned toward the new voice. The desk guy started in with a fierce who-the-hell-are-you look. But then he saw Froelich\u0027s face and shrugged and answered obediently.\n \"He locks the barrier down,\" he said. \"That\u0027s how. Runs to the bathroom, runs back. Maybe two or three times a shift. He\u0027s down there eight hours at a stretch.\"\n Froelich nodded. \"Nobody\u0027s blaming him. Anybody call a forensic team yet?\"\n \"We waited for you.\"\n \"OK, leave it on the table, nobody touch it, and seal this room tight.\"\n \"Is there a camera in the garage?\" Reacher asked.\n \"Yes, there is.\"\n \"So get Nendick to bring us tonight\u0027s tape, right now.\"\n Neagley craned over the table. \"Rather florid wording, don\u0027t you think? And \u0027fast\u0027 definitely takes the prediction defense away, I would say. Turns the whole thing into an overt threat.\"\n Froelich nodded.\n \"You got that right,\" she said slowly. \"If this is somebody\u0027s idea of a game or a joke, it just turned very serious very suddenly.\"\n She said it loud and clear and Reacher caught her purpose fast enough to watch the faces in the room. There was absolutely no reaction on any of them. Froelich checked her watch.\n \"Armstrong\u0027s in the air,\" she said. \"On his way home to Georgetown.\"\n Then she was quiet for a beat.\n \"Call out an extra team,\" she said. \"Half to Andrews, half to Armstrong\u0027s house. And put an extra vehicle in the convoy. And take an indirect route back.\"\n There was a split second of hesitation and then people started moving with the practiced efficiency of an elite team readying itself for action. Reacher watched them carefully, and he liked what he saw. Then he and Neagley followed Froelich back to her office. She called an FBI number and asked for a forensic team, urgent. Listened to the reply and hung up.\n \"Not that there\u0027s much doubt about what they\u0027ll find,\" she said, to nobody in particular. Then Nendick knocked and came in, carrying two videotapes.\n \"Two cameras,\" he said. \"One is inside the booth, high up, looking down and sideways, supposed to ID individual drivers in their cars. The other is outside, looking straight up the alley, supposed to pick up approaching vehicles.\"\n He put both cassettes on the desk and went back out. Froelich picked up the first tape and scooted her chair over to her television set. Put the tape in and pressed play. It was the sideways view from inside the booth. The angle was high, but it was about right to catch a driver framed in a car window. She wound back thirty-five minutes. Pressed play again. The guard was shown sitting on his stool with the back of his left shoulder in shot. Doing nothing. She fast-wound forward until he stood up. He touched a couple of buttons and disappeared. Nothing happened for thirty seconds. Then an arm snaked into view from the extreme right edge of the picture. Just an arm, in a heavy soft sleeve. A tweed overcoat, maybe. The hand on the end of it was gloved in leather. There was an envelope in the hand. It was pushed through the half-closed sliding window and dropped onto the ledge. Then the arm disappeared.\n \"He knew about the camera,\" Froelich said.\n \"Clearly,\" Neagley said. \"He was a yard shy of the booth, stretching out.\"\n \"But did he know about the other camera?\" Reacher asked.\n Froelich ejected the first tape and inserted the second. Wound backward thirty-five minutes. Pressed play. The view was straight up the alley. The quality was poor. There were pools of light from outdoor spotlights and the contrast with areas of darkness was vivid. The shadows lacked detail. The angle was high and tight. The top of the picture cut off well before the street end of the alley. The bottom of the shot stopped maybe six feet in front of the booth. But the width was good. Very good. Both walls of the alley were clearly in view. There was no way of approaching the garage entrance without passing through the camera\u0027s field of vision.\n The tape ran. Nothing happened. They watched the timecode counter until it reached a point twenty seconds before the arm had appeared. Then they watched the screen. A figure appeared at the top. Definitely male. No doubt about it. There was no mistaking the shoulders or the walk. He was wearing a heavy tweed overcoat, maybe gray or dark brown. Dark pants, heavy shoes, a muffler around his neck. And a hat on his head. A wide-brimmed hat, dark in color, tilted way down in front. He walked with his chin tucked down. The video picked up a perfect view of the crown of his hat, all the way down the alley.\n \"He knew about the second camera,\" Reacher said.\n The tape ran on. The guy walked fast, but purposefully, not hurrying, not running, not out of control. He had the envelope in his right hand, holding it flat against his body. He disappeared out of the bottom of the shot and reappeared three seconds later. Without the envelope. He walked at the same purposeful pace all the way back up the alley and out of shot at the top of the screen.\n Froelich froze the tape. \"Description?\"\n \"Impossible,\" Neagley said. \"Male, a little short and squat. Right-handed, probably. No visible limp. Apart from that we don\u0027t know diddly. We saw nothing.\"\n \"Maybe not too squat,\" Reacher said. \"The angle foreshortens things a little.\"\n \"He had inside knowledge,\" Froelich said. \"He knew about the cameras and the bathroom breaks. So he\u0027s one of us.\"\n \"Not necessarily,\" Reacher said. \"He could be an outsider who staked you out. The exterior camera must be visible if you\u0027re looking for it. And he could assume the interior camera. Most places have them. And a couple of nights\u0027 surveillance would teach him the bathroom break procedure. But you know what? Insider or outsider, we drove right past him. We must have. When we went out to see the cleaners. Because even if he\u0027s an insider, he needed to time the bathroom break exactly right. So he needed to be watching. He must have been across the street for a couple of hours, looking down the alley. Maybe with binoculars.\"\n The office went quiet.\n \"I didn\u0027t see anybody,\" Froelich said.\n \"Me neither,\" Neagley said.\n \"I had my eyes closed,\" Reacher said.\n \"We wouldn\u0027t have seen him,\" Froelich said. \"He hears a vehicle coming up the ramp, he ducks out of sight, surely.\"\n \"I guess so,\" Reacher said. \"But we were real close to him, temporarily.\"\n \"Shit,\" Froelich said.\n \"Yeah, shit,\" Neagley echoed.\n \"So what do we do?\" Froelich asked.\n \"Nothing,\" Reacher said. \"Nothing we can do. This was more than forty minutes ago. If he\u0027s an insider, he\u0027s back home by now. Maybe tucked up in bed. If he\u0027s an outsider, he\u0027s already on I-95 or something, west or north or south, maybe thirty miles away. We can\u0027t call the troopers in four states and ask them to look for a right-handed man in a car who doesn\u0027t limp, no better description than that.\"\n \"They could look for an overcoat and a hat on the backseat or in the trunk.\"\n \"It\u0027s November, Froelich. Everybody\u0027s got a hat and a coat with them.\"\n \"So what do we do?\" she asked again.\n \"Hope for the best, plan for the worst. Concentrate on Armstrong, just in case this whole thing is for real. Keep him wrapped up tight. Like Stuyvesant said, threatening isn\u0027t necessarily the same thing as succeeding.\"\n \"What\u0027s his schedule?\" Neagley asked.\n \"Home tonight, the Hill tomorrow,\" Froelich said.\n \"So you\u0027ll be OK. You scored perfect around the Capitol. If Reacher and I couldn\u0027t get to him there, no squat guy in an overcoat is going to. Assuming a squat guy in an overcoat wants to, instead of just shaking you up for the fun of it.\"\n \"You think?\"\n \"Like Stuyvesant said, take a deep breath and tough it out. Be confident.\"\n \"Doesn\u0027t feel good. I need to know who this guy is.\"\n \"We\u0027ll find out who he is, sooner or later. Until then, if you can\u0027t attack at one end you have to defend at the other.\"\n \"She\u0027s right,\" Reacher said. \"Concentrate on Armstrong, just in case.\"\n Froelich nodded vaguely and took the tape out of the machine and put the first one back in. Restarted it and stared at the screen until the garage guard came back from his bathroom break and noticed the envelope and picked it up and hurried out of shot with it.\n \"Doesn\u0027t feel good,\" she said again.\n An FBI forensic crew came by an hour later and photographed the sheet of paper on the conference room table. They used an office ruler for a scale reference and then used a pair of sterile plastic tweezers to lift the paper and the envelope into separate evidence bags. Froelich signed a form to keep the chain of evidence intact and they took both items away for examination. Then she got on the phone for twenty minutes and tracked Armstrong all the way out of the Marine helicopter at Andrews and all the way home.\n \"OK, we\u0027re secure,\" she said. \"For now.\"\n Neagley yawned and stretched. \"So take a break. Be ready for a hard week.\"\n \"I feel stupid,\" Froelich said. \"I don\u0027t know if this is a game or for real.\"\n \"You feel too much,\" Neagley said.\n Froelich looked at the ceiling. \"What would Joe do now?\"\n Reacher paused and smiled. \"Go to the store and buy a suit, probably.\"\n \"No, seriously.\"\n \"He\u0027d close his eyes for a minute and work it all out like it was a chess puzzle. He read Karl Marx, you know that? He said Marx had this trick of explaining everything with one single question, which was, who benefits?\"\n \"So?\"\n \"Let\u0027s say it is an insider doing this. Karl Marx would say, OK, the insider plans to benefit from it. Joe would ask, OK, how does he plan to benefit from it?\"\n \"By making me look bad in front of Stuyvesant.\"\n \"And getting you demoted or fired or whatever, because that rewards him in some way. That would be his aim. But that would be his only aim. Situation like that, there\u0027s no serious threat against Armstrong. That\u0027s an important point. And then Joe would say, OK, suppose it\u0027s not an insider, suppose it\u0027s an outsider. How does he plan to benefit?\"\n \"By assassinating Armstrong.\"\n \"Which gratifies him in some other way. So Joe would say what you\u0027ve got to do is proceed as if it\u0027s an outsider, and proceed very calmly and without panicking, and above all successfully. That\u0027s two birds with one stone. If you\u0027re calm, you deny the insider his benefit. If you\u0027re successful, you deny the outsider his benefit.\"\n Froelich nodded, frustrated. \"But which is it? What did the cleaners tell you?\"\n \"Nothing,\" Reacher said. \"My read is somebody they know persuaded them to smuggle it in, but they aren\u0027t admitting to anything.\"\n \"I\u0027ll tell Armstrong to stay home tomorrow.\"\n Reacher shook his head. \"You can\u0027t. You do that, you\u0027ll be seeing shadows every day and he\u0027ll be in hiding for the next four years. Just stay calm and tough it out.\"\n \"Easy to say.\"\n \"Easy to do. Just take a deep breath.\"\n Froelich was still and silent for a spell. Then she nodded.\n \"OK,\" she said. \"I\u0027ll get you a driver. Be back here at nine in the morning. There\u0027ll be another strategy meeting. Exactly a week after the last one.\"\n The morning was damp and very cold, like nature wanted to be done with fall and get started with winter. Exhaust fumes drifted down the streets in low white clouds and pedestrians hurried by on the sidewalks with their faces ducked deep into scarves. Neagley and Reacher met at eight-forty at the cab line outside the hotel and found a Secret Service Town Car waiting for them. It was double-parked with the engine running and the driver standing next to it. He was maybe thirty years old, dressed in a dark overcoat and gloves, and he was up on his toes, scanning the crowd anxiously. He was breathing hard and his breath was pluming in the air.\n \"He looks worried,\" Neagley said.\n The inside of the car was hot. The driver didn\u0027t speak once during the journey. Didn\u0027t even say his name. Just bulled through the morning traffic and squealed into the underground garage. Led them at a fast walk into the interior lobby and into the elevator. Up three floors and across to the reception desk. It was manned by a different guy. He pointed down the corridor toward the conference room.\n \"Started without you,\" he said. \"You better hurry.\"\n The conference room was empty apart from Froelich and Stuyvesant sitting face-to-face across the width of the table. They were both still and silent. Both pale. On the polished wood between them lay two photographs. One was the official FBI crime scene eight-by-ten of the previous day\u0027s ten-word message: The day upon which Armstrong will die is fast approaching. The other was a hasty Polaroid of another sheet of paper. Reacher stepped close and bent to look.\n \"Shit,\" he said.\n The Polaroid showed a single sheet of letter-sized paper, exactly like the first three in every detail. It followed the same format, a printed message neatly centered near the middle of the page. Nine words: A demonstration of your vulnerability will be staged today.\n \"When did it come?\" he asked.\n \"This morning,\" Froelich said. \"In the mail. Addressed to Armstrong at his office. But we\u0027re bringing all his mail through here now.\"\n \"Where is it from?\"\n \"Orlando, Florida, postmarked Friday.\"\n \"Another popular tourist destination,\" Stuyvesant said.\n Reacher nodded. \"Forensics on yesterday\u0027s?\"\n \"Just got a heads-up by phone,\" Froelich said. \"Everything\u0027s identical, thumbprint and all. I\u0027m sure this one will be the same. They\u0027re working on it now.\"\n Reacher stared at the pictures. The thumbprints were completely invisible, but he felt he could just about see them there, like they were glowing in the dark.\n \"I had the cleaners arrested,\" Stuyvesant said.\n Nobody spoke.\n \"Gut call?\" Stuyvesant said. \"Joke or real?\"\n \"Real,\" Neagley said. \"I think.\"\n \"Doesn\u0027t matter yet,\" Reacher said. \"Because nothing\u0027s happened yet. But we act like it\u0027s for real until we know otherwise.\"\n Stuyvesant nodded. \"That was Froelich\u0027s recommendation. She quoted Karl Marx at me. The Communist Manifesto.\"\n \"Das Kapital, actually,\" Reacher said. He picked up the Polaroid and looked at it again. The focus was a little soft and the paper was very white from the strobe, but there was no mistaking what the message meant.\n \"Two questions,\" he said. \"First, how secure are his movements today?\"\n \"As good as it gets,\" Froelich said. \"I\u0027ve doubled his detail. He\u0027s scheduled to leave home at eleven. I\u0027m using the armored stretch again instead of the Town Car. Full motorcade. We\u0027re using awnings across the sidewalks at both ends. He won\u0027t see open air at any point. We\u0027ll tell him it\u0027s another rehearsal procedure.\"\n \"He still doesn\u0027t know about this yet?\"\n \"No,\" Froelich said.\n \"Standard practice,\" Stuyvesant said. \"We don\u0027t tell them.\"\n \"Thousands of threats a year,\" Neagley said.\n Stuyvesant nodded. \"Exactly. Most of them are background noise. We wait until we\u0027re absolutely sure. And even then, we don\u0027t always make a big point out of it. They\u0027ve got better things to do. It\u0027s our job to worry.\"\n \"OK, second question,\" Reacher said. \"Where\u0027s his wife? And he has a grown-up kid, right? We have to assume that messing with his family would be a pretty good demonstration of his vulnerability.\"\n Froelich nodded. \"His wife is back here in D.C. She came in from North Dakota yesterday. As long as she stays in or near the house she\u0027s OK. His daughter is doing graduate work in Antarctica. Meteorology, or something. She\u0027s in a hut surrounded by a hundred thousand square miles of ice. Better protection than we could give her.\"\n Reacher put the Polaroid back down on the table.\n \"Are you confident?\" he asked. \"About today?\"\n \"I\u0027m nervous as hell.\"\n \"But?\"\n \"I\u0027m as confident as I can be.\"\n \"I want Neagley and me on the ground, observing.\"\n \"Think we\u0027re going to screw up?\"\n \"No, but I think you\u0027re going to have your hands full. If the guy\u0027s in the neighborhood, you might be too busy to spot him. And he\u0027ll have to be in the neighborhood if he\u0027s for real and he wants to stage a demonstration of something.\"\n \"OK,\" Stuyvesant said. \"You and Ms. Neagley, on the ground, observing.\"\n Froelich drove them to Georgetown in her Suburban. They arrived just before ten o\u0027clock. They got out three blocks short of Armstrong\u0027s house and Froelich drove on. It was a cold day, but a watery sun was trying its best. Neagley stood still and glanced around, all four directions.\n \"Deployment?\" she asked.\n \"Circles, on a three-block radius. You go clockwise and I\u0027ll go counterclockwise. Then you stay south and I\u0027ll stay north. Meet back at the house after he\u0027s gone.\"\n Neagley nodded and walked away west. Reacher went east into the weak morning sun. He wasn\u0027t especially familiar with Georgetown. Apart from short periods during the previous week spent watching Armstrong\u0027s house he had explored it only once, briefly, just after he left the service. He was familiar with the college feel and the coffee shops and the smart houses. But he didn\u0027t know it like a cop knows his beat. A cop depends on a sense of inappropriateness. What doesn\u0027t fit? What\u0027s out of the ordinary? What\u0027s the wrong type of face or the wrong type of car for the neighborhood? Impossible to answer those questions without long habituation to a place. And maybe impossible to answer them at all in a place like Georgetown. Everybody who lives there comes from somewhere else. They\u0027re there for a reason, to study at the university or to work in the government. It\u0027s a transient place. It has a temporary, shifting population. You graduate, you leave. You get voted out, you go someplace else. You get rich, you move to Chevy Chase. You go broke, you go sleep in a park.\n So just about everybody he saw was suspicious. He could have made a case against any of them. Who belonged? An old Porsche with a blown muffler rumbled past him. Oklahoma plates. An unshaven driver. Who was he? A brand new Mercury Sable was parked nose-to-tail with a rusted-out Rabbit. The Sable was red and almost certainly a rental. Who was using it? Some guy just in for the day for a special purpose? He detoured next to it and glanced in through the windows at the rear seat. No overcoat, no hat. No open ream of Georgia-Pacific office paper. No box of latex medical gloves. And who owned the Rabbit? A graduate student? Or some backwoods anarchist with a Hewlett-Packard printer at home?\n There were people on the sidewalks. Maybe four or five of them visible at any one time in any one direction. Young, old, white, black, brown. Men, women, young people carrying backpacks full of books. Some of them hurrying, some of them strolling. Some of them obviously on their way to the market, some of them obviously on their way back. Some of them looking like they had no particular place to go. He watched them all in the corner of his eye, but nothing special jumped out at him.\n Time to time he checked upper-story windows as he walked. There were a lot of them. It was good rifle territory. A warren of houses, back gates, narrow alleys. But a rifle would be no good against an armored stretch limo. The guy would need an antitank missile for that. Of which there were plenty to choose from. The AT-4 would be favorite. It was a three-foot disposable fiberglass tube that fired a six-and-a-half pound projectile through eleven inches of armor. Then the BASE principle took over. Behind Armor Secondary Effect. The entrance hole stayed small and tight, so the explosive event stayed confined to the interior of the vehicle. Armstrong would be reduced to little floating carbon pieces not much bigger than charred wedding confetti. Reacher glanced up at the windows. He doubted that a limo would have much armor plate in the roof, anyway. He made a mental note to ask Froelich about it. And to ask if she often rode in the same car as her charge.\n He turned a corner and came out at the top of Armstrong\u0027s street. Looked up at the high windows again. A mere demonstration wouldn\u0027t require an actual missile. A rifle would be functionally ineffective, but it would make a point. A couple of chips in the limo\u0027s bulletproof glass would serve some kind of notice. A paintball gun would do the trick. A couple of red splatters on the rear window would be a message. But the upper-floor windows were quiet as far as the eye could see. They were clean and neat and draped and closed against the cold. The houses themselves were quiet and calm, serene and prosperous.\n There was a small crowd of onlookers watching the Secret Service team erect an awning between Armstrong\u0027s house and the curb. It was like a long narrow white tent. Heavy white canvas, completely opaque. The house end fitted flat against the brick around Armstrong\u0027s front door. The curb end had a radius like a jetway at an airport. It would hug the profile of the limo. The limo\u0027s door would open right inside it. Armstrong would pass from the safety of his house straight into the armored car without ever being visible to an observer.\n Reacher walked a circle around the group of curious people. They looked unthreatening. Neighbors, mostly, he guessed. Dressed like they weren\u0027t going far. He moved back up the street and continued the search for open upper-story windows. That would be inappropriate, because of the weather. But there weren\u0027t any. He looked for people loitering. There were plenty of those. There was a block where every second storefront was a coffee shop, and there were people passing time in every one of them. Sipping espresso, reading papers, talking on cell phones, writing in cramped notebooks, playing with electronic organizers.\n He picked a coffee shop that gave him a good view south down the street and a marginal view east and west and bought a tall regular, black, and took a table. Sat down to wait and watch. At ten fifty-five a black Suburban came up the street and parked tight against the curb just north of the tent. It was followed by a black Cadillac stretch that parked tight against the tent\u0027s opening. Behind that was a black Town Car. All three vehicles looked very heavy. All three had reinforced window frames and one-way glass. Four agents spilled out of the lead Suburban and took up stations on the sidewalk, two of them north of the house and two of them south. Two Metro Police cruisers snuffled up the street and the first stopped right in the center of the road well ahead of the Secret Service convoy and the second hung back well behind it. They lit up their light bars to hold the traffic. There wasn\u0027t much. A blue Chevy Malibu and a gold Lexus SUV waited to get by. Reacher had seen neither vehicle before. Neither had been out cruising the area. He looked at the tent and tried to guess when Armstrong was passing through it. Impossible. He was still gazing at the house end when he heard the faint thump of an armored door closing and the four agents stepped back to their Suburban and the whole convoy took off. The lead cop car leapt forward and the Suburban and the Cadillac and the Town Car fell in behind it and moved fast up the street. The second police cruiser brought up the rear. All five vehicles turned east right in front of Reacher\u0027s coffee shop. Tires squealed on the pavement. The cars accelerated. He watched them disappear. Then he turned back and watched the small crowd in the street disperse. The whole neighborhood went quiet and still.\n They watched the motorcade drive away from a vantage point about eighty yards from where Reacher was sitting. Their surveillance confirmed what they already knew. Professional pride prevented them from writing off his commute to work as actually impossible, but as a viable opportunity it was going to be way down on their list. Way, way down. Right there at the bottom. Which made it all the more fortunate that the transition website offered so many other tempting choices.\n They walked a circuitous route through the streets and made it back to their rented red Sable without incident.\n Reacher finished his last mouthful of coffee and walked down toward Armstrong\u0027s house. He stepped off the sidewalk where the tent blocked it. It was a white canvas tunnel leading directly to Armstrong\u0027s front door. The door was closed. He walked on and stepped back on the sidewalk and met Neagley coming up from the opposite direction.\n \"OK?\" he asked her.\n \"Opportunities,\" she said. \"Didn\u0027t see anybody about to exploit any of them.\"\n \"Me neither.\"\n \"I like the tent and the armored car.\"\n Reacher nodded. \"Takes rifles out of the equation.\"\n \"Not entirely,\" Neagley said. \"A.50 sniper rifle would get through the armor. With the Browning AP round, or the API.\"\n He made a face. Either bullet was a formidable proposition. The standard armor-piercing item just blasted through steel plate, and the alternative armor-piercing incendiary burned its way through. But in the end he shook his head.\n \"No chance to aim,\" he said. \"First you\u0027d have to wait until the car was rolling, to be sure he was in it. Then you\u0027re putting a bullet into a large moving vehicle with dark windows. Hundred-to-one you\u0027d hit Armstrong himself inside.\"\n \"So you\u0027d need an AT- 4.\"\n \"What I thought.\"\n \"Either with the high-explosive against the car, or else you could use it to put a phosphorous bomb into the house.\"\n \"From where?\"\n \"I\u0027d use an upper-floor window in a house behind Armstrong\u0027s. Across the alley, in back. Their defense is mostly concentrated on the front.\"\n \"How would you get in?\"\n \"Phony utility guy, water company, electric company. Anybody who could get in carrying a big toolbox.\"\n Reacher nodded. Said nothing.\n \"It\u0027s going to be a hell of a four years,\" Neagley said.\n \"Or eight.\"\n Then there was the hiss of tires and the sound of a big engine behind them and they turned to see Froelich easing up in her Suburban. She stopped alongside them, twenty yards short of Armstrong\u0027s house. Gestured them into the vehicle. Neagley got in the front and Reacher sprawled in the back.\n \"See anybody?\" Froelich asked.\n \"Lots of people,\" Reacher said. \"Wouldn\u0027t buy a cheap watch from any of them.\"\n Froelich took her foot off the brake and let the engine\u0027s idle speed crawl the car along the road. She kept it tight in the gutter and stopped it again when the nearside rear door was exactly level with the end of the tent. Lifted her hand from the wheel and spoke into the microphone wired to her wrist.\n \"One, ready,\" she said.\n Reacher looked to his right down the length of the canvas tunnel and saw the front door open and a man step out. It was Brook Armstrong. No doubt about it. His photograph had been all over the papers for five solid months and Reacher had spent four whole days watching his every move. He was wearing a khaki raincoat and carrying a leather briefcase. He walked through the tent, not fast, not slow. An agent in a suit watched him from the door.\n \"The convoy was a decoy,\" Froelich said. \"We do it that way, time to time.\"\n \"Fooled me,\" Reacher said.\n \"Don\u0027t tell him this isn\u0027t a rehearsal,\" Froelich said. \"Remember he\u0027s not aware of anything yet.\"\n Reacher sat up straight and moved over to make room. Armstrong opened the door and climbed in beside him.\n \"Morning, M. E.,\" he said.\n \"Morning, sir,\" she replied. \"These are associates of mine, Jack Reacher and Frances Neagley.\"\n Neagley half-turned and Armstrong threaded a long arm over the seat to shake her hand.\n \"I know you,\" he said. \"I met you at the party on Thursday evening. You\u0027re a contributor, aren\u0027t you?\"\n \"She\u0027s a security person, actually,\" Froelich said. \"We had a little cloak-and-dagger stuff going there. An efficiency analysis.\"\n \"I was impressed,\" Neagley said.\n \"Excellent,\" Armstrong said to her. \"Believe me, ma\u0027am, I\u0027m very grateful for the care everybody takes of me. Way more than I deserve. Really.\"\n He was magnificent, Reacher thought. His voice and his face and his eyes spoke of nothing but boundless fascination with Neagley alone. Like he would rather talk to her than do anything else in the whole world. And he had one hell of a visual memory, to place one face in a thousand from four days ago. That was clear. A born politician. He turned and shook Reacher\u0027s hand and lit up the car with a smile of genuine pleasure.\n \"Pleased to meet you, Mr. Reacher,\" he said.\n \"Pleasure\u0027s all mine,\" Reacher said. Then he found himself smiling back. He liked the guy, immediately. He had charm to burn. There was charisma coming off him like heat. And even if you discounted ninety-nine percent of it as political bullshit you could still like the fragment that was left. You could like it a lot.\n \"You in security too?\" Armstrong asked him.\n \"Adviser,\" Reacher said.\n \"Well, you guys do a hell of a great job. Glad to have you aboard.\"\n There was a tiny sound from Froelich\u0027s earpiece and she took off down the street and made her way toward Wisconsin Avenue. Merged into the traffic stream and headed south and east for the center of town. The sun had disappeared again and the city looked gray through the deep tint in the windows. Armstrong made a little sound like a happy sigh and looked out at it, like he was still thrilled with it. Under the raincoat he was immaculate in a suit and a broadcloth shirt and a silk tie. He looked larger than life. Reacher had five years and three inches and fifty pounds on him but felt small and dull and shabby in comparison. But the guy also looked real. Very genuine. You could forget the suit and the tie and picture him in a torn old plaid jacket, out there splitting logs in his yard. He looked like a very serious politician, but a fun guy, too. He was tall and wired with energy. Blue eyes, plain features, unruly hair flecked with gold. He looked fit. Not with the kind of polish a gym gives you, but like he was just born strong. He had good hands. A slim gold wedding ring and no others. Cracked, untidy nails.\n \"Ex-military, am I right?\" he asked.\n \"Me?\" Neagley said.\n \"Both of you, I should think. You\u0027re both a little wary. He\u0027s checking me out and you\u0027re checking the windows, especially at the lights. I recognize the signs. My dad was military.\"\n \"Career guy?\"\n Armstrong smiled. \"You didn\u0027t read my campaign bios? He planned on a career, but he was invalided out before I was born and started a lumber business. Never lost the look, though. He always walked the walk, that\u0027s for sure.\"\n Froelich came off M Street and headed parallel with Pennsylvania Avenue, past the Executive Office Building, past the front of the White House. Armstrong craned to look out at it. Smiled, with the laugh lines deepening around his eyes.\n \"Unbelievable, isn\u0027t it?\" he said. \"Out of everybody who\u0027s surprised I\u0027m going to be a part of that, I\u0027m the most surprised of all, believe me.\"\n Froelich drove straight past her own office in the Treasury Building and headed for the Capitol dome in the distance.\n \"Wasn\u0027t there a Reacher at Treasury?\" Armstrong asked.\n Hell of a memory for names, too, Reacher thought.\n \"My elder brother,\" he said.\n \"Small world,\" Armstrong said.\n Froelich made it onto Constitution Avenue and drove past the side of the Capitol. Made a left onto First Street and headed for a white tent leading to a side door in the Senate Offices. There were two Secret Service Town Cars flanking the tent. Four agents out on the sidewalks, looking cautious and cold. Froelich drove straight for the tent and eased to a stop tight against the curb. Checked her position and rolled forward a foot to put Armstrong\u0027s door right inside the canvas shelter. Reacher saw a group of three agents waiting inside the tunnel. One of them stepped forward and opened the Suburban\u0027s door. Armstrong raised his eyebrows, like he was bemused by all the attention.\n \"Good meeting you both,\" he said. \"And thanks, M.E.\"\n Then he stepped out into the canvas gloom and shut the door and the agents surrounded him and walked him down the length of the tent toward the building. Reacher glimpsed uniformed Capitol security people waiting inside. Armstrong stepped through the door and it closed solidly behind him. Froelich pulled away from the curb and eased around the parked cars and headed north in the direction of Union Station.\n \"OK,\" she said, like she was very relieved. \"So far so good.\"\n \"You took a chance there,\" Reacher said.\n \"Two in two hundred eighty-one million,\" Neagley said.\n \"What are you talking about?\"\n \"Could have been one of us who sent the letters.\"\n Froelich smiled. \"My guess is it wasn\u0027t. What did you think of him?\"\n \"I liked him,\" Reacher said. \"I really did.\"\n \"Me too,\" Neagley said. \"I\u0027ve liked him since Thursday. So now what?\"\n \"He\u0027s in there all day for meetings. Lunch in the dining room. We\u0027ll take him home around seven o\u0027clock. His wife is home. So we\u0027ll rent them a video or something. Keep them locked up tight all evening.\"\n \"We need intelligence,\" Reacher said. \"We don\u0027t know what exact form this demonstration might take. Or where it will be. Could be anything from graffiti upward. We don\u0027t want to let it pass us by without noticing. If it happens at all.\"\n Froelich nodded. \"We\u0027ll check at midnight. Assuming we get to midnight.\"\n \"And I want Neagley to interview the cleaners again. We get what we need from them, we can put our minds at rest.\"\n \"I\u0027d like to do that,\" Froelich said.\n They dropped Neagley at the Federal lockup and then drove back to Froelich\u0027s office. Written FBI forensic reports were in on the latest two messages. They were identical to the first two in every respect. But there was a supplementary report from a Bureau chemist. He had detected something unusual about the thumbprints.\n \"Squalene,\" Froelich said. \"You ever heard of that?\"\n Reacher shook his head.\n \"It\u0027s an acyclic hydrocarbon. A type of oil. There are traces of it present in the thumbprints. Slightly more on the third and fourth than the first and second.\"\n \"Prints always have oils. That\u0027s how they get made.\"\n \"But usually it\u0027s regular human finger oil. This stuff is different. C-thirty-H-fifty. It\u0027s a fish oil. Shark-liver oil, basically.\"\n She passed the paper across her desk. It was covered in complicated stuff about organic chemistry. Squalene was a natural oil used as an old-fashioned lubricant for delicate machinery, like clockwork watches. There was an addendum at the bottom which said that when hydrogenated, squalene with an e becomes squalane with an a.\n \"What\u0027s hydrogenated?\" Reacher asked.\n \"You add water?\" Froelich said. \"Like hydroelectric power?\"\n He shrugged and she pulled a dictionary off the shelf and flicked through to H.\n \"No,\" she said. \"It means you add extra hydrogen atoms to the molecule.\"\n \"Well, that makes everything clear as mud. I scored pretty low in chemistry.\"\n \"It means this guy could be a shark fisherman.\"\n \"Or he guts fish for a living,\" Reacher said. \"Or he works in a fish store. Or he\u0027s an antique watchmaker with his hands dirty from lubricating something.\"\n Froelich opened a drawer and flipped through a file and pulled a single sheet. Passed it across. It was a life-size fluoroscope photograph of a thumbprint.\n \"This our guy?\" Reacher asked.\n Froelich nodded. It was a very clear print. Maybe the clearest print Reacher had ever seen. All the ridges and whorls were exactly delineated. It was bold and astonishingly provocative. And it was big. Very big. The pad of the thumb measured nearly an inch and a half across. Reacher pressed his own thumb alongside it. His thumb was smaller, and he didn\u0027t have the most delicate hands in the world.\n \"That\u0027s not a watchmaker\u0027s thumb,\" Froelich said.\n Reacher nodded slowly. The guy must have hands like bunches of bananas. And rough skin, to print with that degree of clarity.\n \"Manual worker,\" he said.\n \"Shark fisherman,\" Froelich said. \"Where do they catch a lot of sharks?\"\n \"Florida, maybe.\"\n \"Orlando\u0027s in Florida.\"\n Her phone rang. She picked it up and her face fell. She looked up at the ceiling and pressed the phone into her shoulder.\n \"Armstrong needs to go over to the Department of Labor,\" she said. \"And he wants to walk.\" \n","sourceLink":"https://allnovel.net/without-fail-jack-reacher-6/page-6.html","bookId":2344,"book":{"id":2344,"title":"Without Fail (Jack Reacher #6)","description":"Storyline: \n Without Fail (Jack Reacher #6) \n by Lee Child , Dick Hill (Narrator) \n Skilled, cautious, and anonymous, Jack Reacher is perfect for the job: to assassinate the vice president of the United States. Theoretically, of course. A female Secret Service agent wants Reacher to find the holes in her system, and fast - because a covert group already has the vice president in their sights. They\u0027ve planned well. There\u0027s just one thing they didn\u0027t plan on: Reacher.\n \n","cover":"https://allnovel.net/images/without-fail-jack-reacher-6.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/without-fail-jack-reacher-6.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 9:59:43 AM"}}
