{"id":16070,"no":1,"title":"PREFACE","content":"The materials out of which this book is made were taken mainly from two sources: a description and explanation of the Abbey ruins by Mr. W. H. St. John Hope, and a collection and annotation of the Abbey records by Mr. John Richard Walbran. \\n\\n \\n\\n The ruins have been minutely examined by Mr. St. John Hope, who has left no stone unconsidered. He has brought to his study of the Abbey a profound knowledge of monastic architecture. The account of his investigations is published in the fifteenth volume of the “Yorkshire Arch?ological Journal,” to which is appended a historical ground-plan of the Abbey, drawn by Mr. Harold Brakspear. The Marquess of Ripon has had copies of this plan framed and placed in various parts of the buildings for the information of visitors. Through the courtesy of Mr. Hope and Mr. Brakspear I am enabled to give a reduced version of this excellent plan. \\n\\n \\n\\n The records have been gathered together by Mr. Walbran, and printed, with many learned and interesting notes, in two volumes of the publications of the Surtees Society, entitled “Memorials of Fountains Abbey.{x}” They begin with a contemporary narrative of the foundation of the Abbey, and extend to the grant which the king made of the Abbey lands after the suppression. They include the chronicle of the administrations of the abbots; the deed of the ground on which the Abbey stands; a series of royal charters and a series of papal privileges; various records of the dealings of the Monastery with its neighbours, clerical and lay; letters to Thomas Cromwell from Layton and Legh, the commissioners at whose demand the Abbey was surrendered, and from Marmaduke Bradley, the abbot who surrendered it; and the king’s assignment of pensions by name to the abbot and the monks after the dissolution. \\n\\n \\n\\n Of these documents, the longest and most interesting is the contemporary account of the foundation—Narratio de fundatione Fontanis Monasterii. It was written by Hugh, a monk of the daughter house of Kirkstall, upon information given him by Serlo, an aged brother then resident in that abbey, who had once lived at Fountains. Serlo was almost a hundred years old when he sat in the sun in the cloister of Kirkstall, and told this story of his early days, answering Hugh’s questions. “It is now,” he says, “the sixty-ninth year of my conversion. When I first went to Fountains to associate myself to that{xi} holy brotherhood, I was, as I remember, about beginning my thirtieth year.” The Abbey, at that time, as he tells us in another place, was five years old; but he had been acquainted with the brethren before. “When the monks left the monastery of York, I myself was present. I had known their names and faces from my boyhood; I was born in their country, was brought up amongst them, and to several of them I was related by ties of blood. And although I am, as thou may see, far advanced in years, I am very grateful to my old age that my memory remains unimpaired, and particularly retentive of those things committed to it in early years. Such things, therefore, relating to the origin of the Monastery of Fountains, which I personally witnessed, or have gathered from the credible report of my elders, I will now relate.” \\n\\n \\n\\n Serlo spent ten years at Fountains, leaving in 1147, with the colony which founded Kirkstall. After that, the chronicler writes not from personal observation, but from near acquaintance. There would naturally be frequent communication between the mother and the daughter house. The reminiscences end with the death of the sixth abbot, in 1190. Thence the history proceeds, by the hand of Hugh and others, to recount the administration of the seventh and eighth{xii} abbots, and mention is made in the last sentence of the ninth and tenth. \\n\\n \\n\\n In addition to these books, information is to be had concerning the Cistercian Order in its official documents. These are the Life of St. Stephen Harding, the chief founder; the Exordium (1120), a history of the beginning of the Order; the Charta Charitatis (1119), its constitution; the Rule of St. Benedict, to whose strict keeping the Cistercians were pledged; the Usus Antiquiores or Consuetudines, the Customs of the Society; and the Instituta Capitali Generalis, or laws passed during several hundred years by the General Chapter for the government of the Order. A life of St. Stephen, in English, was published in 1844, under the editorship of John Henry Newman, as the first in a projected series of lives of the English saints. The Rule of St. Benedict is admirably summarised in the article on Monachism in the “Encyclop?dia Britannica.” The Institutes have been printed in successive numbers of the “Yorkshire Arch?ological Journal” (vols. ix., x. and xi.) by the Rev. J. T. Fowler. The other documents are assembled in the 166th volume of Migne’s “Patrologia Latina.” \\n\\n \\n\\n In the Rites of Durham, a contemporary account of the customs of a Benedictine abbey, light is thrown upon obscure passages{xiii} in these official documents, and much help is given in the way of homely detail towards an understanding of the routine of the monastic day. Dean Stubbs, in his lectures on Ely Cathedral, and the Rev. John Henry Blunt, in his account of Sion House, prefixed to his edition of the “Myroure of oure Ladye,” take us pleasantly into the refectory, telling us what the monastic folk had for dinner, and with what curious signs they communicated one with another during the silent meal. \\n\\n \\n\\n The writer gratefully acknowledges the friendly services of the Dean of Ripon and of Charles Edward Eardley Childers, of Pittsburg, and the courtesy of the Marquess and Marchioness of Ripon during his locumtenency of Studley Church, in the summer of 1901. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1603/47579.html","bookId":1251,"book":{"id":1251,"title":"Fountains Abbey","description":"简介： The materials out of which this book is made were taken mainly from two sources: a description and explanation of the Abbey ruins by Mr. W. H. St. John Hope, and a collection and annotation of the Abbey records by Mr. John Richard Walbran....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1603","creation":"Aug 1, 2019 12:24:43 AM","modification":"Aug 1, 2019 12:24:43 AM"}}
