{"id":18541,"no":30,"title":"CHAPTER XXVIII. TEMPERING STEEL.","content":"Tempering may be called a mystery of the smith-shop; this operation has that attraction which characterises every process that is mysterious, especially such as are connected with, or belong to mechanical manipulation. A strange and perhaps fortunate habit of the mind is to be greatly interested in what is not well understood, and to disregard what is capable of plain demonstration. \n \n An old smith who has stood at the forge for a score of years will take the same interest in tempering processes that a novice will. When a piece is to be tempered which is liable to spring or break, and the risk is great, he will enter upon it with the same zeal and interest that he would have done when learning his trade. \n \n No one has been able to explain clearly why a sudden change of temperature hardens steel, nor why it assumes various shades of colour at different degrees of hardness; we only know the fact, and that steel fortunately has such properties. \n \n Every one who uses tools should understand how to temper them, whether they be for iron or wood. Experiments with tempered tools is the only means of determining the proper degree of hardness, and as smiths, except with their own tools, have to rely upon the explanations of others as to proper hardening, it follows that tempering is generally a source of complaint. \n \n Tempering, as a term, is used to comprehend both hardening and drawing; as a process it depends mainly upon judgment instead of skill, and has no such connection with forging as to be performed by smiths only. Tempering requires a different fire from those employed in forging, and also more care and precision than blacksmiths can exercise, unless there are furnaces and baths especially arranged for tempering tools. \n \n A difficulty which arises in hardening tools is because of the contraction of the steel which takes place in proportion to the change of temperature; and as the time of cooling is in proportion to the thickness or size of a piece, it follows, of course, that there is a great strain and a tendency to break the thinner parts before the thicker parts have time to cool; this strain may take place either from cooling one side first, or more rapidly than another. \n \n The following propositions in regard to tempering, comprehend the main points to be observed: \n \n The permanent contraction of steel in tempering is as the degree of hardness imparted to it by the bath. \n \n The time in which the contraction takes place is as the temperature of the bath and the cross section of the piece; in other words the heat passes off gradually from the surface to the centre. \n \n Thin sections of steel tools being projections from the mass which supports the edges, are cooled first, and if provision is not made to allow for contraction they are torn asunder. \n \n The main point in hardening and the most that can be done to avoid irregular contraction, is to apply the bath so that it will act first and strongest on the thickest parts. If a piece is tapering or in the form of a wedge, the thick end should enter the bath first; a cold chisel for instance that is wide enough to endanger cracking should be put into the bath with the head [116] downward. \n \n The upflow of currents of warmed water are a common cause of irregular cooling and springing of steel tools in hardening; the water that is heated, rises vertically, and the least inclination of a piece from a perpendicular position, allows a warm current to flow up one side. \n \n The most effectual means of securing a uniform effect from a tempering bath is by violent agitation, either of the bath or the piece; this also adds to the rapidity of cooling. \n \n The effect of tempering baths is as their conducting power; chemicals except as they may contribute to the conducting properties of a bath, may safely be disregarded. For baths, cold or ice water loaded with salt for extreme hardness, and warm oil for tools that are thin and do not require to be very hard, are the two extremes outside of which nothing is required in ordinary practice. \n \n In the case of tools composed partly of iron and partly of steel, steel laid as it is called, the tendency to crack in hardening may be avoided in most cases by hammering the steel edge at a low temperature until it is so expanded that when cooled in hardening it will only contract to a state of rest and correspond to the iron part; the same result may be produced by curving a piece, giving convexity to the steel side before hardening. \n \n Tools should never be tempered by immersing their edges or cutting parts in the bath, and then allowing the heat to \"run down\" to attain a proper temper at the edge. I am well aware that this is attacking a general custom, but it is none the less wrong for that reason. Tools so hardened have a gradually diminishing temper from their point or edge, so that no part is properly tempered, and they require continual re-hardening, which spoils the steel; besides, the extreme edge, the only part which is tempered to a proper shade, is usually spoiled by heating and must be ground away to begin with. No latheman who has once had a set of tools tempered throughout by slow drawing, either in an oven, or on a hot plate, will ever consent to point hardening afterwards. A plate of iron, two to two and one-half inches thick, placed over the top of a tool dressing fire, makes a convenient arrangement for tempering tools, besides adding greatly to the convenience of slow heating, which is almost as important as slow drawing. The writer has by actual experiment determined that the amount of tool dressing [117] and tempering, to say nothing of time wasted in grinding tools, may in ordinary machine fitting be reduced one-third by \"oven tempering.\" \n \n As to the shades that appear in drawing temper, or tempering it is sometimes called, it is quite useless to repeat any of the old rules about \"straw colour, violet, orange, blue,\" and so on; the learner knows as much after such instruction as before. The shades of temper must be seen to be learned, and as no one is likely to have use for such knowledge before having opportunities to see tempering performed, the following plan is suggested for learning the different shades. Procure eight pieces of cast steel about two inches long by one inch wide and three-eighths of an inch thick, heat them to a high red heat and drop them into a salt bath; preserve one without tempering to show the white shade of extreme hardness, and polish one side of each of the remaining seven pieces; then give them to an experienced workman to be drawn to seven varying shades of temper ranging from the white piece to the dark blue colour of soft steel. On the backs of these pieces labels can be pasted describing the technical names of the shades and the general uses to which tools of corresponding hardness are adapted. \n \n This will form an interesting collection of specimens and accustom the eye to the various tints, which after some experience will be instantly recognised when seen separately. \n \n It may be remarked as a general rule that the hardness of cutting tools is \"inverse as the hardness of the material to be cut,\" which seems anomalous, and no doubt is so, if nothing but the cutting properties of edges is considered; but all cutting edges are subjected to transverse strain, and the amount of this strain is generally as the hardness of the material acted upon; hence the degree of temper has of necessity to be such as to guard against breaking the edges. Tools for cutting wood, for example, can be much harder than for cutting iron, or to state it better, tools for cutting wood are harder than those usually employed for cutting iron; for if iron tools were always as carefully formed and as carefully used as those employed in cutting wood, they could be equally hard. \n \n Forges, pneumatic machinery for blast, machinery for handling large pieces, and other details connected with forging, are easily understood from examples. \n \n (1.) What causes tools to bend or break in hardening?—(2.) What means can be employed to prevent injury to tools in hardening?—(3.) Can the shades of temper be produced on a piece of steel without hardening?—(4.) What forms a limit of hardness for cutting tools?—(5.) What are the objects of steel-laying tools instead of making them of solid steel? \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2128/60269.html","bookId":485,"book":{"id":485,"title":"The Economy of Workshop Mainipulation","description":"简介： In adding another to the large number of books which treat upon Mechanics, and especially of that class devoted to what is called Mechanical Engineering, it will be proper to explain some of the reasons for preparing the present work; and as these ex...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2128","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
