{"id":18544,"no":33,"title":"CHAPTER XXXI. PLANING OR RECIPROCATING MACHINES.","content":"The term planing should properly be applied only to machines that produce planes or flat surfaces, but the technical use of the term includes all cutting performed in right lines, or by what may be called a straight movement of tools. \\n\\n \\n\\n As no motion except rotary can be continuous, and as rotary movement of tools is almost exclusively confined to shaping cylindrical pieces, a proper distinction between machine tools which operate in straight lines, and those which operate with circular movement, will be to call them by the names of rotary and reciprocating. \\n\\n \\n\\n It may be noticed that all machines, except milling machines, which act in straight lines and produce plane surfaces have reciprocating movement; the class includes planing, slotting and shaping machines; these, with lathes, constitute nearly the whole equipment of an ordinary fitting shop. \\n\\n \\n\\n It is strange, considering the simplicity of construction and the very important office filled by machines for cutting on plane surfaces, that they were not sooner invented and applied in metal work. Many men yet working at finishing, can remember when all flat surfaces were chipped and filed, and that long after engine lathes had reached a state of efficiency and were generally employed, planing machines were not known. This is no doubt to be accounted for in the fact that reciprocal movement, except that produced by cranks or eccentrics, was unknown or regarded as impracticable for useful purposes until late years, and when finally applied it was thought impracticable to have such movements operate automatically. This may seem quite absurd to even an apprentice of the present time, yet such reciprocating movement, as a mechanical problem, is by no means so simple as it may at first appear. \\n\\n \\n\\n [129] \\n\\n \\n\\n A planing machine platen, for instance, moves at a uniform rate of speed each way, and by its own motion shifts or reverses the driving power at each extreme of the stroke. Presuming that there were no examples to be examined, an apprentice would find many easier problems to explain than how a planing machine can shift its own belts. If a platen or table disengages the power that is moving it, the platen stops; if the momentum carries it enough farther to engage or connect other mechanism to drive the platen in the opposite direction, the moment such mechanism comes into gear the platen must stop, and no movement can take place to completely engage clutches or shift belts. This is a curious problem that will be referred to again. \\n\\n \\n\\n Reciprocating tools are divided into those wherein the cutting movement is given to the tools, as in shaping and slotting machines, and machines wherein the cutting movement is given to the material to be planed, as in a common planing machine. Very strangely we find in general practice that machine tools for both the heaviest and the lightest class of work, such as shaping, and butting, operate upon the first principle, while pieces of a medium size are generally planed by being moved in contact with stationary tools. \\n\\n \\n\\n This problem of whether to move the material or to move the tools in planing, is an old one; both opinion and practice vary to some extent, yet practice is fast settling down into constant rules. \\n\\n \\n\\n Judged upon theoretical grounds, and leaving out the mechanical conditions of operation, it would at once be conceded that a proper plan would be to move the lightest body; that is, if the tools and their attachments were heavier than the material to be acted upon, then the material should be moved for the cutting action, and vice versa. But in practice there are other conditions to be considered more important than a question of the relative weight of reciprocating parts; and it must be remembered that in solving any problem pertaining to machine action, the conditions of operation are to be considered first and have precedence over problems of strain, arrangement, or even the general principles of construction; that is, the conditions of operating must form a base from which proportions, arrangements, and so on, must be deduced. A standard planing machine, such as is employed for most kinds of work, is arranged with a running platen or carriage upon which the material is fastened and traversed beneath the cutting tools. [130] The uniformity of arrangement and design in machines of this kind in all countries wherever they are made, must lead to the conclusion that there are substantial reasons for employing running platens instead of giving a cutting movement to the tools. \\n\\n \\n\\n A planing machine with a running platen occupies nearly twice as much floor space, and requires a frame at least one-third longer than if the platen were fixed and the tools performed the cutting movement. The weight which has to be traversed, including the carriage, will in nearly all cases exceed what it would be with a tool movement; so that there must exist some very strong reasons in favour of a moving platen, which I will now attempt to explain, or at least point out some of the more prominent causes which have led to the common arrangement of planing machines. \\n\\n \\n\\n Strains caused by cutting action, in planing or other machines, fall within and are resisted by the framing; even when the tools are supported by one frame and the material by another, such frames have to be connected by means of foundations which become a constituent part of the framing in such cases. \\n\\n \\n\\n Direct action and reaction are equal; if a force is exerted in any direction there must be an equal force acting in the opposite direction; a machine must absorb its own strains. \\n\\n \\n\\n Keeping this in view, and referring to an ordinary planing machine with which the reader is presumed to be familiar, the focal point of the cutting strain is at the edge of the tools, and radiates from this point as from a centre to the various parts of the machine frame, and through the joints fixed and movable between the tools and the frame; to follow back from this cutting point through the mechanism to the frame proper; first starting with the tool and its supports and going to the main frame; then starting from the material to be planed, and following back in the other direction, until we reach the point where the strains are absorbed by the main frame, examining the joints which intervene in the two cases, there will appear some reasons for running carriages. \\n\\n \\n\\n Beginning at the tool there is, first, a clamped joint between the tool and the swing block; second, a movable pivoted joint between the block and shoe piece; third, a clamped joint between the shoe piece and the front saddle; fourth, a moving joint [131] where the front saddle is gibed to the swing or quadrant plate; fifth, a clamp joint between the quadrant plate and the main saddle; sixth, a moving joint between the main saddle and the cross head; seventh, a clamp joint between the cross head and standards; and eighth, bolted joints between the standards and the main frame; making in all eight distinct joints between the tool and the frame proper, three moving, four clamped, and one bolted joint. \\n\\n \\n\\n Starting again from the cutting point, and going the other way from the tool to the frame, there is, first, a clamped and stayed joint between the material and platen, next, a running joint between the platen and frame; this is all; one joint that is firm beyond any chance of movement, and a moving joint that is not held by adjustable gibs, but by gravity; a force which acts equally at all times, and is the most reliable means of maintaining a steady contact between moving parts. \\n\\n \\n\\n Reviewing these mechanical conditions, we may at once see sufficient reasons for the platen movement of planing machines; and that it would be objectionable, if not impossible, to add a traversing or cutting action to tools already supported through the medium of eight joints. To traverse for cutting would require a moving gib joint in place of the bolted one, between the standards and main frame, leading to a complication of joints and movements quite impracticable. \\n\\n \\n\\n These are, however, not the only reasons which have led to a running platen for planing machines, although they are the most important. \\n\\n \\n\\n If a cutting movement were performed by the tool supports, it would necessarily follow that the larger a piece to be planed, and the greater the distance from the platen to the cutting point, the farther a tool must be from its supports; a reversal of the conditions required; because the heavier the work the greater the cutting strain will be, and the tool supports less able to withstand the strains to be resisted. \\n\\n \\n\\n It may be assumed that the same conditions apply to the standards of a common planing machine, but the case is different; the upright framing is easily made strong enough by increasing its depth; but the strain upon running joints is as the distance from them at which a force is applied, or to employ a technical phrase, as the amount of overhang. With a moving platen the larger and heavier a piece to be planed, the more [132] firmly a platen is held down; and as the cross section of pieces usually increases with their depth, the result is that a planing machine properly constructed will act nearly as well on thick as thin pieces. \\n\\n \\n\\n The lifting strain at the front end of a platen is of course increased as the height at which the cutting is done above its top, but this has not in practice been found a difficulty of any importance, and has not even required extra length or weight of platens beyond what is demanded to receive pieces to be planed and to resist flexion in fastening heavy work. The reversing movement of planing machine platens already alluded to is one of the most complex problems in machine tool movement. \\n\\n \\n\\n Platens as a rule run back at twice the forward or cutting movement, and as the motion is uniform throughout each stroke, it requires to be stopped at the extremes by meeting some elastic or yielding resistance which, to use a steam phrase, \"cushions\" or absorbs the momentum, and starts the platen back for the return stroke. \\n\\n \\n\\n This object is attained in planing machines by the friction of the belts, which not only cushions the platen like a spring, but in being shifted opposes a gradually increasing resistance until the momentum is overcome and the motion reversed. By multiplying the movement of the platen with levers or other mechanism, and by reason of the movement that is attained by momentum after the driving power ceases to act, it is found practicable to have a platen \u0027shift its own belts,\u0027 a result that would never have been reached by theoretical deductions, and was no doubt discovered by experiment, like the automatic movement of engine valves is said to have been. \\n\\n \\n\\n It is not intended to claim that this platen-reversing motion cannot, like any other mechanical movement, be resolved mathematically, but that the mechanical conditions are so obscure and the invention made at a time that warrants the supposition of accidental discovery. \\n\\n \\n\\n In the driving gearing of planing machines, conditions which favour the reversing movement are high speed and narrow driving belts. The time in which belts may be shifted is as their speed and width; to be shifted a belt must be deflected or bent edgewise, and from this cause wind spirally in order to pass from one pulley to another. To bend or deflect a belt edgewise there will be required a force in proportion to its width, and [133] the time of passing from one pulley to another is as the number of revolutions made by the pulleys. \\n\\n \\n\\n Planing machines of the most improved construction are driven by two belts instead of one, and many mechanical expedients have been adopted to move the belts differentially, so that both should not be on the driving pulley at the same time, but move one before the other in alternate order. This is easily attained by simply arranging the two belts with the distance between them equal to one and one-half or one and three-fourth times the width of the driving pulley. The effect is the same as that accomplished by differential shifting gearing, with the advantage of permitting an adjustment of the relative movement of the belts. \\n\\n \\n\\n Another principle in planing machines which deserves notice is the manner of driving carriages or platens; this is usually performed by means of spur wheels and a rack. A rack movement is smooth enough, and effective enough so far as a mechanical connection between the driving gearing and a platen, but there is a difficulty met with from the torsion and elasticity of cross-shafts and a train of reducing gearing. In all other machines for metal cutting, it has been a studied object to have the supports for both the tools and the material as rigid as possible; but in the common type of planing machines, such as have rack and pinion movement, there is a controversion of this principle, inasmuch as a train of wheels and several cross-shafts constitute a very effective spring between the driving power and the point of cutting, a matter that is easily proved by planing across the teeth of a rack, or the threads of a screw, on a machine arranged with spur wheels and the ordinary reducing gearing. It is true the inertia of a platen is interposed and in a measure overcomes this elasticity, but in no degree that amounts to a remedy. \\n\\n \\n\\n A planing machine invented by Mr Bodmer in 1841, and since improved by Mr William Sellers of Philadelphia, is free from this elastic action of the platen, which is moved by a tangent wheel or screw pinion. In Bodmer\u0027s machine the shaft carrying the pinion was parallel to the platen, but in Sellers\u0027 machine is set on a shaft with its axis diagonal to the line of the platen movement, so that the teeth or threads of the pinion act partly by a screw motion, and partly by a progressive forward movement like the teeth of wheels. The rack on the platen of Mr Sellers\u0027 [134] machine is arranged with its teeth at a proper angle to balance the friction arising from the rubbing action of the pinion, which angle has been demonstrated as correct at 5°, the ordinary coefficient of friction; as the pinion-shaft is strongly supported at each side of the pinion, and the thrust of the cutting force falls mainly in the line of the pinion shaft, there is but little if any elasticity, so that the motion is positive and smooth. \\n\\n \\n\\n The gearing of these machines is alluded to here mainly for the purpose of calling attention to what constitutes a new and singular mechanical movement, one that will furnish a most interesting study, and deserves a more extended application in producing slow reciprocating motion. \\n\\n \\n\\n (1.) Can the driving power be employed directly to shift the belts of a planing machine?—(2.) Why are planing machines generally constructed with a running carriage instead of running tools?—(3.) What objection exists in employing a train of spur wheels to drive a planing machine carriage?—(4.) What is gained by shifting the belts of a planing machine differentially?—(5.) What produces the screeching of belts so common with planing machines?—(6.) What conditions favour the shifting of planing machine belts? \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2128/60272.html","bookId":485,"book":{"id":485,"title":"The Economy of Workshop Mainipulation","description":"简介： In adding another to the large number of books which treat upon Mechanics, and especially of that class devoted to what is called Mechanical Engineering, it will be proper to explain some of the reasons for preparing the present work; and as these ex...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2128","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
