{"id":18548,"no":37,"title":"CHAPTER XXXV. MILLING.","content":"Milling relates to metal cutting with serrated rotary cutters, and differs in many respects from either planing or turning. The movement of the cutting edges can be more rapid than with tools which act continuously, because the edges are cooled during the intervals between each cut; that is, if a milling tool has twenty teeth, any single tooth or edge acts only from a fifteenth to a twentieth part of the time; and as the cutting distance or time of cutting is rarely long enough to generate much heat, the speed of such tools may be one-half greater than for turning, drilling, or planing tools. Another distinction between milling and other tools is the perfect and rigid manner in which the cutting edges are supported; they are short and blunt, besides being usually carried on short rigid mandrils. A result of this rigid support of the tools is seen in the length of the cutting edges that can be employed, which are sometimes four inches or more in length. It is true the amount of material cut away in milling is much less than the edge movement will indicate when compared with turning or planing; yet the displacing capacity of a milling machine exceeds that of either a lathe or a planing machine. Theoretically the cutting or displacing capacity of any metal or wood cutting machine, is as the length of the edges multiplied into the speed of their cutting movement; a rule which applies very uniformly in wood cutting, and also in metal cutting within certain limits; but the strains that arise in metal cutting are so great that they may exceed all means of resisting them either in the material acted upon, or in the means of supporting tools, so that the length of cutting edges is limited. In turning chilled rolls at Pittsburg, [141] tools to six inches wide are employed, and the effect produced is as the length of the edge; but the depth of the cut is slight, and the operation is only possible because of the extreme rigidity of the pieces turned, and the tools being supported without movable joints as in common lathes. Under certain conditions a given quantity of soft iron or steel may be cut away at less expense, and with greater accuracy, by milling than by any other process. A milling tool with twenty edges should represent as much wearing capacity as a like number of separate tools, and may be said to equal twenty duplicate tools; hence, in cutting grooves, notches, or similar work, a milling tool is equivalent to a large number of duplicate single tools, which cannot be made or set with the same truth; so that milling secures accuracy and duplication, objects which are in many cases more important than speed. Milling, as explained, being a more rapid process than either planing or turning, it seems strange that so few machines of this kind are employed in engineering shops. This points to some difficulty to be contended with in milling, which is not altogether apparent, because economic reasons would long ago have led to a more extended use of milling processes, if the results were as profitable as the speed of cutting indicates. This is, however, not the case, except on certain kinds of material, and only for certain kinds of work. The advantages gained by milling, as stated, are speed, duplication, and accuracy; the disadvantages are the expense of preparing tools and their perishability. A solid milling cutter must be an accurately finished piece of work, made with more precision than can be expected in the work it is to perform. This accuracy cannot be attained by ordinary processes, because such tools, when tempered, are liable to become distorted in shape, and frequently break. When hardened they must be finished by grinding processes, if intended for any accurate work; in fact, no tools, except gauging implements, involve more expense to prepare, and none are so liable to accident when in use. Such tools consist of a combination of cutting edges, all of which may be said to depend on each one; because if one breaks, the next in order will have a double duty to perform, and will soon follow—a reversal of the old adage, that \u0027union is strength,\u0027 [142] if by strength is meant endurance. In planing and turning, the tools require no exact form; they can be roughly made, except the edge, and even this, in most cases, is shaped by the eye. Such tools are maintained at a trifling expense, and the destruction of an edge is a matter of no consequence. The form, temper, and strength can be continually adapted to the varying conditions of the work and the hardness of material. The line of division between planing and milling is fixed by two circumstances—the hardness and uniformity of the material to be cut, and the importance of duplication. Brass, clean iron, soft steel, or any homogeneous metal not hard enough to cause risk to the tools, can be milled at less expense than planed, provided there is enough work of a uniform character to justify the expense of milling tools. Cutting the teeth of wheels is an example where milling is profitable, but not to the extent generally supposed. In the manufacture of small arms, sewing machines, clocks, and especially watches, where there is a constant and exact duplication of parts, milling is indispensable. Such manufactures are in some cases founded on milling operations, as will be pointed out in another chapter. Milling tools large enough to admit of detachable cutters being employed, are not so expensive to maintain as solid tools. Edge movement can sometimes be multiplied in this way, so as to greatly exceed what a single tool will perform. Milling tools are employed at Crewe for roughing out the slots in locomotive crank axles. A number of detachable tools are mounted on a strong disc, so that four to six will act at one time; in this way the displacement exceeds what a lathe can perform when acting continuously with two tools. Rotary planing machines constructed on the milling principle, have been tried for plane surfaces, but with indifferent success, except for rough work. There is nothing in the construction or operation of milling machines but what will be at once understood by a learner who sees them in operation. The whole intricacy of the process lies in its application or economic value, and but very few, even among the most skilled, are able in all cases to decide when milling can be employed to advantage. Theoretical conclusions, aside from practical experience, will lead one to suppose that milling can be applied in nearly all kinds of work, an opinion [143] which has in many cases led to serious mistakes. (1.) If milling tools operate faster than planing or turning tools, why are they not more employed?—(2.) How may the effect produced by cutting tools generally be computed?—(3.) To what class of work are milling machines especially suited?—(4.) Why do milling processes produce more accurate dimensions than are attainable by turning or planing?—(5.) Why can some branches of manufacture be said to depend on milling processes?","sourceLink":"http://novel.tingroom.com/jingdian/2128/60276.html","bookId":485,"book":{"id":485,"title":"The Economy of Workshop Mainipulation","description":"简介： In adding another to the large number of books which treat upon Mechanics, and especially of that class devoted to what is called Mechanical Engineering, it will be proper to explain some of the reasons for preparing the present work; and as these ex...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2128","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
