{"id":27339,"no":15,"title":"XIII WHY MR. DOG IS TAME","content":"There were quite a number of dogs on the plantation—foxhounds, harriers, a sheep dog, and two black-and-tan hounds that had been trained to tree coons and ’possums. In these, the little boy took an abiding interest, and he soon came to know the name and history of each individual dog. There was Jonah, son of Hodo, leader of the foxhounds, Jewel, leader of the harriers, and Walter, the sheep dog, who drove up the cows and hogs every evening. Indeed, it was not long before the little boy knew as much about the dogs as Uncle Remus did. He imagined he knew more, for one day he informed the old man that once upon a time all dogs were wild, and roamed about the woods and fields just as the wild animals do now. [231] “You see me settin’ here,” Uncle Remus remarked; “well, suh, ol’ ez I is, I’d like mighty well ter fin’ out how you come ter know ’bout deze happenin’s way back yander.” The little boy made no secret of the matter; he answered with pride that his mother had been reading to him out of a great big book with pictures in it. Uncle Remus stretched his arms above his head, and opened wide his eyes. Astonishment took possession of his countenance. The child laughed with delight when he saw the amazement of Uncle Remus. “Yes,” he went on, “mother read about all the wild animals. The book said that when the dogs were wild they used to go in droves, just as the wolves do now.” “Yasser, dat’s so!” exclaimed Uncle Remus with admiration, “an’ ef you keep on like you gwine, ’twon’t be long ’fo’ you’ll know lot’s mo’ ’bout de creeturs dan what I does—lot’s mo’.” Then he became confidential—“Wuz dey anything in de big book, honey, ’bout de time dat de Dog start in fer ter live wid Mr. Man?” The little boy shook his head. If there was anything about[232] it in the big book from which his mother had been reading, she had kept it to herself. “Well, I’m mighty glad dey ain’t nothin’ in dar ’bout it, kaze ef dey had ’a’ been, I’d ’a’ been bleeze ter gi’ up my job, kaze when dey gits ter puttin’ tales in a book, dat’s a sign.” “A sign of what, Uncle Remus?” “Des a sign, honey—a plain sign. Ef you dunner what a sign is, I’ll never tell you.” “When did the Dog begin to live with Mr. Man?” the little boy inquired. “Once he was wild, and now he is tame. How did he become tame?” “Ah-yi! den you got de idee dat ol’ man Remus know sump’n n’er what ain’t down in de books?” “Why, you asked me if there was anything in the big book that told about the time when the Dog went to live with Mr. Man,” the little boy replied. “Dat’s what I done,” exclaimed Uncle Remus with a laugh. “An’ I done it kaze I laid off ter tel you ’bout it one er deze odd-come-shorts when de[233] moon ridin’ high, an’ de win’ playin’ a chune in de big pine.” “Why not tell it now?” the little boy asked. “Le’ me see, is I well er is I sick? Is I full er is I hongry? Ef I done fergot what I had fer dinner day ’fo’ yistiddy, den ’tain’t no use fer ter try ter tell a tale ’bout ol’ times. Wuz it cake? No, ’twant cake. Wuz it chicken-pie? No, ’twant chicken-pie. What, den? Ah-h-h! Now I knows: ’Twuz tater custard, an’ it seem like I kin tas’e it yit. Yasser! Day ’fo’ yistiddy wuz so long ago dat it look like a dream.” “It wasn’t any dream,” the little boy declared. “Mother wouldn’t let me have any at the house, and when grandmother sent your dinner, she put two pieces of potato custard on a plate, and you said that one of them was for me.” “An’ you e’t it,” Uncle Remus declared; “you e’t it, an’ you liked it so well dat you sot yo’ eye on my piece, an’ ef I hadn’t ’a’ grabbed it, I boun’ I wouldn’t ’a’ had no tater custard.” The little boy laughed and blushed. “How did you know I wanted the other piece?” he asked. [234] “I know it by my nose an’ my two big toes,” Uncle Remus replied. “Put a boy in smellin’ distance uv a piece er tater custard, an’ it seem like de custard will fly up an’ hit him in de mouf, no matter how much he try ter dodge.” Uncle Remus paused and pulled a raveling from his shirt-sleeve, looking at the little boy meanwhile. “I know very well you haven’t forgotten the story,” remarked the child, “for grandmother says you never forgot anything, especially the old-time tales.” “Well, suh, I speck she knows. She been knowin’ me ev’ry sence she wuz a baby gal, an’ mo’ dan dat, she know right p’int blank what I’m a-thinkin’ ’bout when she kin git her eye on me.” “And she says she never caught you tellin’ a fib.” “Is she say dat?” Uncle Remus inquired with a broad grin. “Ef she did, I’m lots sharper dan I looks ter be, kaze many and many’s de time when I been skeer’d white, thinkin’ she done cotch me. Tooby sho’, tooby sho’!” [235] “But what about the Dog, Uncle Remus?” “What dog, honey? Oh, you’ll hatter scuzen me—I’m lots older dan what I looks ter be. You mean de Dog what tuck up at Mr. Man’s house. Well, ol’ Brer Dog wuz e’en about like he is deze days, scratchin’ fer fleas, an’ growlin’ over his vittles stidder sayin’ grace, an’ berryin’ de bones when he had one too many. He wuz des like he is now, ’ceppin’ dat he wuz wil’. He galloped wid Brer Fox, an’ loped wid Brer Wolf, an’ cantered wid Brer Coon. He went all de gaits, an’ he had dez ez good a time ez any un um, an’ des ez bad a time. “Now, one day, some’rs ’twix’ Monday mornin’ an’ Saddy night, he wuz settin’ in de shade scratchin’ hisse’f, an’ he wuz tooken wid a spell er thinkin’. He’d des come thoo a mighty hard winter wid de yuther creeturs, an’ he up an’ say ter hisse’f dat ef he had ter do like dat one mo’ season, it’d be de en’ er him an’ his fambly. You could count his ribs, an’ his hip-bones stuck out like de horns on a hat-rack. “Whiles he wuz settin’ dar, scratchin’ an’[236] studyin’, an’ studyin’ an’ scratchin’, who should come meanderin’ down de big road but ol’ Brer Wolf; an’ it ’uz ‘Hello, Brer Dog! you look like you ain’t seed de inside uv a smokehouse fer quite a whet. I ain’t sayin’ dat I got much fer ter brag on, kaze I ain’t in no better fix dan what you is. De colder it gits, de skacer de vittles grows.’ An’ den he ax Brer Dog whar he gwine an’ how soon he gwineter git dar. Brer Dog make answer dat it don’t make no diffunce whar he go ef he don’t fin’ dinner ready. “Brer Wolf ’low dat de way ter git dinner is ter make a fier, kaze ’tain’t no use fer ter try ter eat ef dey don’t do dat. Ef dey don’t git nothin’ fer ter cook, dey’ll have a place whar dey kin keep warm. Brer Dog say he see whar Brer Wolf is dead right, but whar dey gwine git a fier? Brer Wolf say de quickest way is ter borry a chunk fum Mr. Man er his ol’ ’oman. But when it come ter sayin’ who gwine atter it, dey bofe kinder hung back, kaze dey know’d dat Mr. Man had a walkin’-cane what he kin p’int at anybody an’ snap a cap on it an’ blow de light right out. [237] “But bimeby, Brer Dog say’ll go atter de chunk er fier, an’ he ain’t no mo’ dan say dat, ’fo’ off he put, an’ he travel so peart, dat ’twant long ’fo’ he come ter Mr. Man’s house. When he got ter de gate he sot down an’ done some mo’ studyin’, an’ ef de gate had ’a’ been shot, he’d ’a’ turned right roun’ an’ went back like he come; but some er de chillun had been playin’ out in de yard, an’ dey lef’ de gate open, an so dar ’twuz. Study ez he mought, he can’t fin’ no skuce fer gwine back widout de chunk er fier. An’ in he went. “Well, talk ’bout folks bein’ ’umble; you ain’t seed no ’umble-come-tumble twel you see Brer Dog when he went in dat gate. He ain’t take time fer ter look roun’, he so skeer’d. He hear hogs a-gruntin’ an’ pigs a-squealin’, he hear hens a-cacklin’ an’ roosters crowin’, but he ain’t turn his head. He had sense ’nuff not ter go in de house by de front way. He went roun’ de back way whar de kitchen wuz, an’ when he got dar he ’fraid ter go any furder. He went ter de do’, he did, an’ he ’fraid ter knock. He hear chillun laughin’ an’[238] playin’ in dar, an’ fer de fust time in all his born days, he ’gun ter feel lonesome. “Bimeby, some un open de do’ an’ den shot it right quick. But Brer Dog ain’t see nobody; he ’uz too ’umble-come-tumble fer dat. He wuz lookin’ at de groun’, an’ wonderin’ what ’uz gwineter happen nex’. It must ’a’ been one er de chillun what open de do’, kaze ’twant long ’fo’ here come Mr. Man wid de walkin’-cane what had fier in it. He come ter de do’, he did, an’ he say, ‘What you want here?’ Brer Dog wuz too skeer’d fer ter talk; all he kin do is ter des wag his tail. Mr. Man, he ’low, ‘You in de wrong house, an’ you better go on whar you got some business.’ “Brer Dog, he crouch down close ter de groun’, an’ wag his tail. Mr. Man, he look at ’im, an’ he ain’t know whedder fer ter turn loose his gun er not, but his ol’ ’oman, she hear him talkin’, an’ she come ter de do’, an’ see Brer Dog crouchin’ dar, ’umbler dan de’ ’umblest, an’ she say, ‘Po’ feller! you ain’t gwine ter hurt nobody, is you?’ an’ Brer Dog ’low, ‘No, ma’am, I ain’t; I des[239] come fer ter borry a chunk er fier.’ An’ she say, ‘What in de name er goodness does you want wid fier? Is you gwine ter burn us out’n house an’ home?’ Brer Dog ’low, ‘No, ma’am! dat I ain’t; I des wanter git warm.’ Den de ’oman say, ‘I clean fergot ’bout de col’ wedder—come in de kitchen here an’ warm yo’se’f much ez you wanter.’ “Dat wuz mighty good news fer Brer Dog, an’ in he went. Dey wuz a nice big fier on de h’ath, an’ de chillun wuz settin’ all roun’ eatin’ der dinner. Dey make room fer Brer Dog, an’ down he sot in a warm cornder, an’ ’twant long ’fo’ he wuz feelin’ right splimmy-splammy. But he wuz mighty hongry. He sot dar, he did, an’ watch de chillun’ eatin’ der ashcake an’ buttermilk, an’ his eyeballs ’ud foller eve’y mouffle dey e’t. De ’oman, she notice dis, an’ she went ter de cubberd an’ got a piece er warm ashcake, an’ put it down on de h’ath. “Brer Dog ain’t need no secon’ invite—he des gobble up de ashcake ’fo’ you kin say Jack Robberson wid yo’ mouf shot. He ain’t had nigh[240] nuff, but he know’d better dan ter show what his appetites wuz. He ’gun ter feel good, an’ den he got down on his hunkers, an’ lay his head down on his fo’paws, an’ make like he gwine ter sleep. Atter ’while, he smell Brer Wolf, an’ he raise his head an’ look todes de do’. Mr. Man he tuck notice, an’ he say he b’lieve dey’s some un sneakin’ roun’. Brer Dog raise his head, an’ snuff todes de do’, an’ growl ter hisse’f. So Mr. Man tuck down his gun fum over de fireplace, an’ went out. De fust thing he see when he git out in de yard wuz Brer Wolf runnin’ out de gate, an’ he up wid his gun—bang!—an’ he hear Brer Wolf holler. All he got wuz a han’ful er ha’r, but he come mighty nigh gittin’ de whole hide. “Well, atter dat, Mr. Man fin’ out dat Brer Dog could do ’im a heap er good, fus’ one way an’ den an’er. He could head de cows off when dey make a break thoo de woods, he could take keer er de sheep, an’ he could warn Mr. Man when some er de yuther creeturs wuz prowlin’ roun’. An’ den he wuz some comp’ny when Mr.[241] Man went huntin’. He could trail de game, an’ he could fin’ his way home fum anywheres; an’ he could play wid de chillun des like he wuz one un um. “’Twant long ’fo’ he got fat, an’ one day when he wuz amblin’ in de woods, he meet up wid Brer Wolf. He howdied at ’im, he did, but Brer Wolf won’t skacely look at ’im. Atter ’while he say, ‘Brer Dog, why ’n’t you come back dat day when you went atter fier?’ Brer Dog p’int ter de collar on his neck. He ’low, ‘You see dis? Well, it’ll tell you lots better dan what I kin.’ Brer Wolf say,’You mighty fat. Why can’t I come dar an’ do like you does?’ Brer Dog ’low, ‘Dey ain’t nothin’ fer ter hinder you.’ “So de next mornin’, bright an’ early, Brer Wolf knock at Mr. Man’s do’. Mr. Man peep out an’ see who ’tis, an’ tuck down his gun an’ went out. Brer Wolf try ter be perlite, an’ he smile. But when he smile he show’d all his tushes, an’ dis kinder skeer Mr. Man. He say, ‘What you doin’ sneakin’ roun’ here?’ Brer Wolf try ter be mo’ perliter dan ever, an’ he grin fum year ter[242] year. Dis show all his tushes, an’ Mr. Man lammed aloose at ’im. An’ dat ’uz de las’ time dat Brer Wolf ever try ter live wid Mr. Man, an fum dat time on down ter dis day, it ’uz war ’twix Brer Wolf an’ Brer Dog.” \n \n","sourceLink":"http://novel.tingroom.com/ertong/2811/77708.html","bookId":502,"book":{"id":502,"title":"Told by Uncle Remus","description":"简介： The main reason why Uncle Remus retired from business as a story-teller was because the little boy to whom he had told his tales grew to be a very big boy, and grew and grew till he couldnt grow any bigger. Meanwhile, his father and mother moved to A...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2811","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
