{"id":74325,"no":25,"title":"Page 25","content":"Ridge: Did he?\\n\\n Me: Yes.\\n\\n Ridge: Don’t let him in here again.\\n\\n Me: I wasn’t planning on it. BTW, you’re kind of being a jerk right now.\\n\\n He glances up at me and shrugs.\\n\\n Ridge: It’s my apartment, and I don’t want him here. Don’t let him in again.\\n\\n I don’t like his attitude right now, and to be honest, the fact that he just referred to this as his apartment doesn’t sit right with me. It feels like a low blow to remind me that I’m at his mercy. I don’t bother responding. In fact, I toss the phone onto the couch so he can’t text me, and I head toward my room.\\n\\n When I reach my bedroom door, my emotions catch up with me. I’m not sure if it’s seeing Hunter again and having all of those hurtful feelings resurface or if it’s the fact that Ridge is being an asshole. Whatever it is, the tears begin to well in my eyes, and I hate that I’m letting either of them get to me in the first place.\\n\\n Ridge grabs my shoulder and turns me around to face him, but I keep my eyes trained on the wall behind him. I don’t even want to look him in the eye. He puts my phone back in my hand, wanting me to read whatever he just texted, but I still don’t want to. I throw the phone toward the couch again, but he intercepts it, then tries to force it back into my hand. I take it this time, but I press the power button down until the phone shuts off, and then I toss it onto the couch again. I look him in the eye now, and his expression is angry. He takes two steps toward the coffee table, grabs a pen out of the drawer, and walks back to me. He takes my hand, but I pull it from him, still not wanting to know what he has to say to me. I’ve had enough apologies for tonight. I try to turn away from him, but he grabs my arm and presses it against the door, holding it forcefully while he writes on it. When he’s finished writing, I pull my arm away and watch as he tosses his pen onto the couch, then walks back to his bedroom. I look down at my arm.\\n\\n Let him in next time if he’s really what you want.\\n\\n My barrier completely breaks. Reading his angry words depletes me of whatever strength I had left to hold back my tears. I rush through my bedroom door and straight into the bathroom. I turn on the faucet and squirt soap into my hands, then begin scrubbing his words off my arm while I cry. I don’t even look up when the door to his bedroom opens, but I see him out of my peripheral vision as he closes the door behind him and slowly walks toward me. I’m still scrubbing the ink off my arm and sniffling back the tears when he reaches across me for the soap.\\n\\n He dispenses some onto the palm of his hand, then wraps his fingers around my wrist. The tenderness in his touch lashes out and scars my heart. He runs the soap up my wrist where the words begin and lathers my skin as I drop my other hand away and grip the edge of the sink, allowing him to wash his words away.\\n\\n He’s apologizing.\\n\\n He massages his thumbs into the words, rubbing them away with the water.\\n\\n I’m still staring down at my arm, but I can feel his gaze directly on me. I’m aware of the exaggerated breaths I have to take in now that he’s next to me, so I attempt to slow them down until there are no longer traces of ink on my skin.\\n\\n He grabs a hand towel and dries my arm, then releases me. I bring my arm to my chest and hold it with my other hand, not knowing what move to make now. I finally bring my eyes to meet his, and I instantaneously forget why I’m even upset with him in the first place.\\n\\n His expression is reassuring and apologetic and maybe even a little longing. He turns and walks out of the bathroom, then returns seconds later with my phone. He powers it on and hands it to me while he leans against the counter, still looking at me regretfully.\\n\\n Ridge: I’m sorry. I didn’t mean what I said. I thought maybe you were entertaining the thought of accepting his apology, and it upset me. You deserve better than him.\\n\\n Me: He showed up unannounced. I would never take him back, Ridge. I was just hoping an apology from him would help me move on from the betrayal a little quicker.\\n\\n Ridge: Did it help at all?\\n\\n Me: Not really. I feel even more pissed than before he showed up.\\n\\n As Ridge reads my text, I notice the tension ease in his expression. His reaction to my situation with Hunter borders on jealousy, and I hate that this makes me feel good. I hate that every time something Ridge-related makes me feel good, it’s immediately followed up with guilt. Why do things between the two of us have to be so complicated?\\n\\n I wish we could keep things simple, but I have no idea how to do that.\\n\\n Ridge: Let’s go write an angry song about him. That might help.\\n\\n He looks at me with a sly grin, and it makes my insides swirl and melt. Then I freeze just as fast from the guilt of those feelings.\\n\\n For once, it would be nice not to be consumed with shame.\\n\\n I nod and follow him to his room.\\n\\n Ridge\\n\\n I’m sitting on the floor again. It’s not the most comfortable place to play, but it’s much better than being on the bed next to her. I can never seem to focus on the actual music when I’m in her personal space and she’s in mine.\\n\\n She requested that I play one of the songs I used to play when I sat out on my balcony to practice, so we’ve been working through it. She’s lying on her stomach, writing on her notepad. Erasing and writing, erasing and writing. I’m sitting here on the floor, not even playing. I’ve played the song enough for her to know the melody by now, so I’m just waiting while I watch her.\\n\\n I love how she focuses so intently on the lyrics, as if she’s in her own world and I’m just a lucky observer. Every now and then, she’ll tuck the hair behind her ear that keeps spilling in front of her face. My favorite thing to watch her do is erase her words. Every time the eraser meets the paper, she pulls her top lip in with her bottom teeth and chews on it.\\n\\n I hate that it’s my favorite thing to watch her do, because it shouldn’t be. It triggers all these what-ifs in my head, and my mind begins imagining things it shouldn’t be imagining. I begin to picture myself lying next to her on the bed while she writes. I imagine her lip being tucked in while I’m just inches from her, looking down on the words she’s written. I imagine her glancing up at me, noticing what she’s doing to me with her small, innocent gestures. I imagine her rolling onto her back, welcoming me to create secrets with her that’ll never leave this room.\\n\\n I close my eyes, wanting to do whatever I can to stop the thoughts. They make me feel just as guilty as if I were to act on them. Sort of similar to how I felt a couple of hours ago when I thought there was a chance she was getting back together with Hunter.\\n\\n I was pissed.\\n\\n I was jealous.\\n\\n I was having thoughts and feelings I knew I shouldn’t be having, and it was scaring the shit out of me. I’ve never had an issue with jealousy until now, and I don’t like the person it’s turning me into. Especially when the jealousy I’m feeling has nothing to do with the girl I’m in an actual relationship with.\\n\\n I flinch when something hits me on the forehead. I immediately open my eyes and look at Sydney. She’s on the bed, laughing, pointing at my phone. I pick it up and read her text.\\n\\n Sydney: Are you falling asleep? We aren’t finished.\\n\\n Me: No. Just thinking.\\n\\n She moves over on the bed to make more room and pats the spot next to her.\\n\\n Sydney: Come think right here so you can read these. I have most of the lyrics down, but I’m hung up on the chorus. I’m not sure what you want.\\n\\n We haven’t openly discussed the fact that we don’t write on the bed together anymore. She’s focused on the lyrics, though, so I need to pull my shit together and focus on them, too. I set my guitar down and pull myself up, then walk to the bed and lie beside her. I take the notebook out of her hands and pull it in front of me to read what she’s written so far.\\n\\n She smells good.\\n\\n Damn.\\n\\n I try to block off my senses somehow, but I know it’s a wasted effort. Instead, I focus on the words she’s written, quickly impressed at how effortlessly they come to her.\\n\\n Why don’t we keep, keep it simple\\n\\n You talk to your friends, and I’ll be here to mingle\\n\\n But you know that I, I want to be\\n\\n Right by your side like I ought to be\\n\\n And you know that I, I want to see\\n\\n The way that your eyes seem to follow me\\n\\n After reading what she’s written, I hand her back the notebook and pick up my phone. I’m confused about the lyrics, because they aren’t at all what I was expecting. I’m not sure I like them.\\n\\n Me: I thought we were writing an angry song about Hunter.\\n\\n She shrugs, then begins texting me back.\\n\\n Sydney: I tried. The subject of Hunter doesn’t really inspire me anymore. You don’t have to use them if you don’t like them. I can try something different.\\n\\n I stare at her text, not sure how to respond. I don’t like the lyrics, but not because they aren’t good. It’s because the words she’s written down make me think she’s somehow able to read my mind.\\n\\n Me: I love them.\\n\\n She smiles and says, “Thank you.” She flips onto her back, and I catch myself appreciating this moment and this night and her low-cut dress way more than I probably should. When my eyes make their way back to hers, she’s watching me, plainly aware of what’s going through my head. Eyes don’t lie, unfortunately.\\n\\n When neither of us breaks our gaze, I’m forced to swallow the huge lump in my throat.\\n\\n Don’t get yourself in trouble, Ridge.\\n\\n Thank God she sits up when she does.\\n\\n Sydney: I’m not sure where you want the chorus to come in. This song is a little more upbeat than the ones I’m used to. I’ve written three different ones, but I don’t like how any of them sound. I’m stuck.\\n\\n Me: Let me watch you sing it one more time.\\n\\n I roll off the bed and grab the guitar, then take it back to the bed but sit on the edge this time. We turn to face each other, and I play while she sings. When we make it to the chorus, she stops singing and shrugs, letting me know this is where she’s stuck. I take her notebook and read the lyrics over a few times. I glance up at her without being too obvious about it and write the first thing that comes to mind.\\n\\n And I must confess my interest\\n\\n The way that you move when you’re in that dress\\n\\n It’s making me feel like I want to be\\n\\n The only man that you ever see\\n\\n I pause from writing and look up at her again, feeling every bit of the words in this chorus. I think we both know the words we write have to do with each other, but that doesn’t seem to stop us at all. If we keep having moments like these with words that are way too honest, we’ll both end up in trouble. I quickly look back down at the paper as more lyrics begin to enter my head.\\n\\n Whoa, oh, oh, oh\\n\\n I’m in trouble, trouble\\n\\n Whoa, oh, oh, oh\\n\\n I’m in trouble now\\n\\n I refuse to look up at her again while I write. I keep my mind focused on the words that somehow seem to flow from my fingertips every time we’re together. I don’t question what’s inspiring me or what they mean.\\n\\n I don’t question it . . . because it’s obvious.\\n\\n But it’s art. Art is just an expression. An expression isn’t the same as an act, as much as it sometimes feels that way. Writing lyrics isn’t the same as directly informing someone of your feelings. \\n\\n","sourceLink":"https://allnovel.net/maybe-someday/page-25.html","bookId":2711,"book":{"id":2711,"title":"Maybe Someday","description":"Storyline: At twenty-two years old, aspiring musician Sydney Blake has a great life: She’s in college, working a steady job, in love with her wonderful boyfriend, Hunter, and rooming with her good friend, Tori. But everything changes when she discovers Hunter cheating on her with Tori—and she is left trying to decide what to do next. \\n Sydney becomes captivated by her mysterious neighbor, Ridge Lawson. She can’t take her eyes off him or stop listening to the daily guitar playing he does out on his balcony. She can feel the harmony and vibrations in his music. And there’s something about Sydney that Ridge can’t ignore, either: He seems to have finally found his muse. When their inevitable encounter happens, they soon find themselves needing each other in more ways than one…\\n","cover":"https://allnovel.net/images/maybe-someday.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/maybe-someday.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:30:21 AM"}}
