{"id":74339,"no":32,"title":"Page 32","content":"We walk into the apartment, and he tosses his keys onto the bar as I shut the door behind me. He doesn’t even turn around to look at me as he stalks off toward his bedroom.\\n\\n “Good night,” I say. I might have said it with a little bit of sarcastic bite, but at least I’m not screaming, “Screw you, Warren!” which is kind of what I feel like saying.\\n\\n He pauses, then turns around to face me. I watch him nervously, because whatever he’s about to say to me isn’t “good night.” His eyes narrow as he tilts his head, shaking it slowly. “Can I ask you a question?” he finally says, eyeing me with curiosity.\\n\\n “As long as you promise never again to begin a question by asking whether or not you can propose a question.”\\n\\n I want to laugh at my use of Ridge’s comment, but Warren doesn’t even crack a smile. It only makes things much more awkward. I shift on my feet. “What’s your question, Warren?” I say with a sigh.\\n\\n He folds his arms over his chest and walks toward me. I swallow my nervousness as he leans forward to speak to me, barely a foot away. “Do you just need someone to fuck you?”\\n\\n Breathe in, breathe out.\\n\\n Expand, contract.\\n\\n Beat beat, pause. Beat beat, pause.\\n\\n “What?” I say, dumbfounded. I’m positive I didn’t hear him right.\\n\\n He lowers his head a few inches until he’s at eye level with me. “Do you just need someone to fuck you?” he says, with more precise enunciation this time. “Because if that’s all it is, I’ll bend you over the couch right now and fuck you so hard you’ll never think about Ridge again.” He continues to stare at me, cold and heartless.\\n\\n Think before you react, Sydney.\\n\\n For several seconds, all I can do is shake my head in disbelief. Why would he say that? Why would he say something so disrespectful to me? This isn’t Warren. I don’t know who this asshole is standing in front of me, but it definitely isn’t Warren.\\n\\n Before I allow myself time to think, I react. I pull my arm back, then make four punches my lifetime average as my fist meets his cheek.\\n\\n Shit.\\n\\n That hurt.\\n\\n I look up at him, and his hand is covering his cheek. His eyes are wide, and he’s looking at me with more surprise than pain. He takes a step back, and I keep my eyes focused hard on his.\\n\\n I grab my fist and pull it up to my chest, pissed that I’m going to have another hurt hand. I wait before going to the kitchen to get ice for it, though. I might need to hit him again.\\n\\n I’m confused by his obvious anger toward me for the past twenty-four hours. My mind rushes through anything I could have said or done to him that would make him feel this much hatred toward me.\\n\\n He sighs and tilts his head back, pulling his hands through his hair. He gives no explanation for his hateful words, and I try to understand them, but I can’t. I’ve done nothing to him to warrant something that harsh.\\n\\n Maybe that’s his problem, though. Perhaps the fact that I’ve done nothing to him—or with him—is what’s pissing him off like this.\\n\\n “Is this jealousy?” I ask. “Is that what’s making you this evil, wretched excuse for a human being? Because I never slept with you?”\\n\\n He takes a step forward, and I immediately back up until I fall down onto the couch. He bends down, bringing himself to my eye level.\\n\\n “I don’t want to screw you, Sydney. And I am definitely not jealous.” He pushes himself away from the couch. Away from me.\\n\\n He’s scaring the living shit out of me, and I want to pack my suitcases and leave tonight and never, ever see any of these people again.\\n\\n I begin crying into my hands. I hear him sigh heavily, and he drops down onto the couch beside me. I pull my feet up and turn my knees away from him, curling into the far corner of the couch. We sit like this for several minutes, and I want to stand up and run to my room, but I don’t. I feel as if I’d have to ask permission, because I don’t even know if I have a room here anymore.\\n\\n “I’m sorry,” he finally says, breaking the silence with something other than my crying. “God, I’m sorry. I just . . . I’m trying to understand what the hell you’re doing.”\\n\\n I wipe my face with my shirt and glance at him. His face is a jumbled mixture of sadness and sorrow, and I don’t understand anything he’s feeling.\\n\\n “What is your problem with me, Warren? I’ve never been anything but nice to you. I’ve even been nice to your bitch of a girlfriend, and believe me, that takes effort.”\\n\\n He nods in agreement. “I know,” he says, exasperated. “I know, I know, I know. You are a nice person.” He laces his fingers together and stretches his arms out, then brings them back down with a heavy sigh. “And I know you have good intentions. You have a good heart. And a pretty good right swing,” he says, grinning slyly. “I guess that’s why I’m so mad, though. I know you have a good heart, so why in the hell haven’t you moved out yet?” His words hurt me more now than the vulgar ones he spit at me five minutes ago.\\n\\n “If you and Ridge wanted me gone this bad, why did you both wait until this weekend to tell me?”\\n\\n My question seems to catch Warren off-guard, because his eyes cut to mine briefly before he looks away again. He doesn’t answer that question, though. Instead, he begins to prepare one of his own. “Has Ridge ever told you the story of how he met Maggie?” he asks.\\n\\n I shake my head, completely confused by the direction this conversation has taken.\\n\\n “I was seventeen, and Ridge had just turned eighteen,” he says. He leans back against the couch and stares down at his hands.\\n\\n I recall Ridge saying he began dating Maggie when he was nineteen, but I keep silent and let him continue.\\n\\n “We had been dating for about six weeks, and . . .”\\n\\n Scratch that thought. Can no longer keep silent. “We?” I ask hesitantly. “As in you and Ridge?”\\n\\n “No, dumbass. As in me and Maggie.”\\n\\n I try to hide my shock, but he doesn’t look at me long enough to even see my reaction.\\n\\n “Maggie was my girlfriend first. I met her at a fund-raising event for children who were deaf. I was there with my parents, who were both on the committee.” He pulls his hands behind his head and leans against the couch.\\n\\n “Ridge was with me the first time I saw her. We both thought she was the most beautiful thing we had ever laid eyes on, but, fortunately for me, my eyes landed on her about five seconds before his did, so I called dibs. Of course, neither one of us expected to actually have a chance with her. I mean, you’ve seen her. She’s incredible.” He pauses for a moment, then props a leg on the table in front of us.\\n\\n “Anyway, I spent the whole day flirting with her. Charming her with my good looks and my killer body.”\\n\\n I laugh, but only out of courtesy.\\n\\n “She agreed to go on a date with me, so I told her I’d pick her up that Friday night. I took her out, made her laugh, took her back home, and kissed her. It was great, so I asked her out again, and she agreed. I took her out for a second date, then a third date. I liked her. We got along well; she laughed at my jokes. She also got along with Ridge, which scored major points in my book. The girl and the best friend have to get along, or one of the two will suffer. Luckily, we all got along great. On our fourth date, I asked her if she wanted to make it official, and she agreed. I was stoked, because I knew she was by far the hottest girl I’d ever dated or ever would date. I couldn’t let her slip away, especially before I was able to go all the way with her.”\\n\\n He laughs. “I remember saying that to Ridge the same night. Told him if there was one girl on this earth I needed to devirginize, it was Maggie. Told him I’d go on a hundred dates with her if that’s what it took. He turned his head to me and signed, ‘What about a hundred and one?’ I laughed, because I didn’t understand what the hell Ridge meant. I didn’t understand at the time that he liked her the way he did, and I never really understood all the little gems he would spout. Still don’t. Looking back on the whole situation and the way he would sit there and have to listen to the punk-ass things I said about her, I’m surprised he didn’t punch me sooner than he did.”\\n\\n “He punched you?” I ask. “Why? Because you talked about screwing her?”\\n\\n He shakes his head, and a look of guilt washes over him. “No,” he says quietly. “Because I did screw her.”\\n\\n He sighs but continues. “We were staying the night at Ridge and Brennan’s. Maggie spent a lot of time over there with me, and we had been dating for about six weeks. I know that’s not long in virgin weeks, but it’s a damn eternity in guy weeks. We were lying in bed together, and she told me she was ready to go all the way, but before she would have sex with me, there was something she needed to tell me. She said I had a right to know, and she wouldn’t feel right continuing a relationship until I was fully informed. I remember panicking, thinking she was about to tell me she was a dude or some shit like that.”\\n\\n He glances at me and raises an eyebrow. “Because let’s be honest, Syd. There are some really hot transvestite-looking dudes out there.”\\n\\n He laughs and looks straight ahead again. “That’s when she told me about her illness. Told me about the statistics . . . the fact that she didn’t want children . . . the reality of how much time she had left. She said she wanted to lay the truth out for me because it wouldn’t be fair to anyone who saw something long-term with her. She said the likelihood of her making it to the age of forty or even thirty-five was small. She said she needed to be with someone who understood that. Someone who accepted that.”\\n\\n “You didn’t want that responsibility?” I ask him.\\n\\n He shakes his head slowly. “Sydney, I didn’t care about the responsibility. I was a seventeen-year-old guy, in bed with the most beautiful girl I had ever seen, and all she was asking me to do was agree to love her. When she mentioned the words ‘future’ and ‘husband’ and not wanting kids, it took all I had not to roll my eyes, because in my head, those were a lifetime away. I would be with a million girls before then. I didn’t know how to think that far ahead, so I just did what I thought any guy would do in that situation. I reassured her and told her that her illness didn’t matter to me and that I loved her. Then I kissed her, took off her clothes, and took her virginity.”\\n\\n He hangs his head in what looks like shame. “After she left the next morning, I was bragging to Ridge about finally getting to bang a virgin. Probably went into way too much detail. I also mentioned the conversation we had beforehand and told him all about her illness. I was brutally honest with him to a fault sometimes. I told him that her whole situation kind of freaked me out and that I was going to give it two weeks before I broke up with her so I wouldn’t look like such a douche. That’s when he beat the living shit out of me.”\\n\\n My eyes widen. “Good for Ridge,” I say.\\n\\n Warren nods. “Yeah. Apparently, he liked her a whole lot more than he let on, but he just kept his mouth shut and allowed me to make an ass of myself for the whole six weeks I dated her. I should have caught on about how he felt, but Ridge is a lot more selfless than I am. He would have never done anything to betray what we had, but after that night, he lost a whole lot of respect for me. And that hurt, Sydney. He’s like my brother. I felt like I had disappointed the one person I looked up to the most.” \\n\\n","sourceLink":"https://allnovel.net/maybe-someday/page-32.html","bookId":2711,"book":{"id":2711,"title":"Maybe Someday","description":"Storyline: At twenty-two years old, aspiring musician Sydney Blake has a great life: She’s in college, working a steady job, in love with her wonderful boyfriend, Hunter, and rooming with her good friend, Tori. But everything changes when she discovers Hunter cheating on her with Tori—and she is left trying to decide what to do next. \\n Sydney becomes captivated by her mysterious neighbor, Ridge Lawson. She can’t take her eyes off him or stop listening to the daily guitar playing he does out on his balcony. She can feel the harmony and vibrations in his music. And there’s something about Sydney that Ridge can’t ignore, either: He seems to have finally found his muse. When their inevitable encounter happens, they soon find themselves needing each other in more ways than one…\\n","cover":"https://allnovel.net/images/maybe-someday.jpg","author":"Colleen Hoover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/maybe-someday.html","creation":"Oct 5, 2019 8:59:12 AM","modification":"Oct 5, 2019 10:30:21 AM"}}
