{"id":96293,"no":23,"title":"Page 23","content":"“They’re the only tree I know that’s like that.”\\n\\n “Well, see, it makes them real easy to climb. And that’s what they believe he did, climbed up into one of the trees to wait for a victim to pass by.”\\n\\n “I think I can see where this is going.”\\n\\n “And then, because he had a something-point-something blood alcohol level, he lost his balance and fell, and he landed on his head and broke his neck and died.”\\n\\n “The world is a dangerous place.”\\n\\n “But a little less so,” she said, “now that he’s not in it anymore.”\\n\\n Her name was Julia Emilie Roussard. She’d written it on the fly-leaf of one of the books he picked up.\\n\\n It took him two days to use it. For all the conversations they had, there was somehow never an occasion where he could fit her name into one of his sentences.\\n\\n He took her out to lunch after they picked up his eyeglasses (with a complimentary leather case bearing the optometrist’s name and address, and an impregnated strip of cloth for cleaning the lenses). On the way home she reminded him that he’d talked about two losses, his best friend and his most prized possession. Who was the friend, she wondered, and what was the possession?\\n\\n He answered the second part first. His stamp collection, gone when he got into his apartment.\\n\\n “You’re a stamp collector? Seriously?”\\n\\n “Well, it was a hobby, but I was pretty serious about it. I gave it a lot of my time, and put quite a bit of money into it.” He told her a little about his collection, and how the childhood hobby had drawn him back in as an adult.\\n\\n “And the friend?”\\n\\n “It was a woman,” he said.\\n\\n “Your wife? No, you said you’ve never been married.”\\n\\n “Not a wife, not a girlfriend. It was never physical, it wasn’t that kind of a relationship. I suppose you could say she was a business associate, but we were very close.”\\n\\n “When you say business associate…”\\n\\n He nodded. “She was killed by the same people who set me up. They tried to make it look as though she’d burned herself up in a fire, but they didn’t try too hard. They set a fire any rookie investigator would spot right away as arson, and they left her with two bullets in her head.” He shrugged. “They probably didn’t care what the cops called it. It’s not like anybody could do anything about it.”\\n\\n “Do you miss her?”\\n\\n “All the time. That’s probably the reason I talk so much. I wouldn’t ordinarily, not on such short acquaintance. There’s two reasons, actually, and one is that you’re very easy to talk to, but the other is that I’m used to talking to Dot, and she’s gone.”\\n\\n “That was her name? Dot?”\\n\\n “Dorothea, actually. I always thought it was Dorothy, and either I got it wrong or the papers did, because Dorothea was the way it appeared in the press coverage of the fire. But all anyone ever called her was Dot.”\\n\\n “I never had a nickname.”\\n\\n “People always call you Julia?” There!\\n\\n “Except for the kids, who have to call me Miss Roussard. That’s the first time you’ve ever used my name, do you realize that?”\\n\\n “You never told me what it was.”\\n\\n “I didn’t?”\\n\\n “I figured there’d be papers in the house, but I didn’t want to snoop around. You’d tell me when you wanted to.”\\n\\n “I thought you knew. I just took it for granted we had that conversation. You saved my life and I got to watch you break a man’s neck and then you walked me home and we drank coffee in the kitchen. How could you not know my name?”\\n\\n “I opened a book,” he said, “and there it was. Oh, for God’s sake.”\\n\\n “What?”\\n\\n “Well, how did I even know it was you? Maybe you bought the book secondhand, or maybe it came down in the family.”\\n\\n “No, it’s me.”\\n\\n “Julia Emilie Roussard.”\\n\\n “Oui, monsieur. C’est moi.”\\n\\n “French?”\\n\\n “On my daddy’s side, Irish on my mama’s. I told you she died young, didn’t I?”\\n\\n “You told me she went gray early.”\\n\\n “And died early, too. Thirty-six years old, and she left the table one night and went straight to bed because she felt a little feverish, and the next morning she was dead.”\\n\\n “My God.”\\n\\n “Viral meningitis. She was healthy one day and dead the next, and I don’t think my daddy ever did understand what happened to him. To her of course, but also to him. And to me, and I was eleven at the time.” She looked at him. “I’m thirty-eight now. I’m two years older than she was when she died.”\\n\\n “And you don’t have a single gray hair, either.”\\n\\n She laughed, delighted. He said he was several years older than that, and she told him he looked it. “With your new haircut,” she said. “I think what we’ll do is bleach it, and then dye it a nice medium brown. If you’re not happy with the way it turns out, we can always dye it back to the way it is now.”\\n\\n But it turned out fine. Mousy brown, Julia called it, and said that women supplied by nature with hair that color were often moved to do something about it. “Because it’s kind of blah, you know? It doesn’t attract attention.”\\n\\n Perfect.\\n\\n If her father even noticed the difference, he didn’t see fit to comment on it. Keller, checking the mirror, decided the lighter color went with the professorial effect, which the bifocals had reinforced big-time. The glasses, now that he was getting used to them, were a revelation. He hadn’t exactly needed them, he’d been getting along fine without them, but there was no question they improved his distance vision. Out walking on St. Charles Avenue, he could make out street signs he’d have squinted at previously.\\n\\n He went for that walk on a day when Julia was teaching, and a plump brown dumpling of a woman named Lucille came to see to Mr. Roussard. When Julia got home he was waiting for her on the front stoop. “It’s all arranged,” he said. “Lucille’s agreed to stay late, so let’s you and I go to an early movie and a nice dinner.”\\n\\n The movie was a romantic comedy, with Hugh Grant in the Cary Grant role. Dinner was in the French Quarter, served in a high-ceilinged room by waiters who looked almost old enough to be playing Dixieland jazz at Preservation Hall. Keller ordered a bottle of wine with dinner, and they each had a glass and agreed it was very nice, but they left the rest of the bottle unfinished.\\n\\n They’d taken her car, and when it came time to drive home she handed him her keys. It was a mild night, and the air had a tropical feel to it. Sultry, he thought. That was the word for it.\\n\\n Neither of them spoke on the way home. Lucille lived nearby, and wouldn’t accept a ride, and just shook her head when Keller offered to walk her home.\\n\\n He waited in the kitchen while Julia checked on her father. He couldn’t sit still and walked around, opening doors, peering into cupboards. Everything’s close to perfect, he thought, and now you’re about to screw it up.\\n\\n It seemed to him that she was taking forever, but then she came up behind him and stood looking over his shoulder. “All these sets of dishes,” she said. “Things accumulate when a family lives in the same place forever. There’ll be some yard sale here one of these days.”\\n\\n “It’s nice, living in a place with a history.”\\n\\n “I suppose.”\\n\\n He turned toward her and smelled her perfume. She hadn’t been wearing scent earlier.\\n\\n He drew her close, kissed her.\\n\\n 25\\n\\n “You know what I was worried about? I was afraid I wouldn’t remember how to do it.”\\n\\n “I guess it all came back to you,” he said. “Been a while, has it?”\\n\\n “Ages.”\\n\\n “Same for me.”\\n\\n “Oh, come on,” she said. “You, running around the country, having adventures everywhere?”\\n\\n “The running around I’ve been doing lately, the only women who spoke to me were asking me did I want to supersize that order of fries. Imagine if they asked you that at a good restaurant. ‘Sir, would you care to supersize that coq au vin?’”\\n\\n “But before Des Moines,” she said. “I’ll bet you had a girl in every port.”\\n\\n “Hardly. I’m trying to remember the last time I was… with anybody. All I can tell you is it’s been a long time.”\\n\\n “My daddy asked me if we were sleeping together.”\\n\\n “Just now?”\\n\\n “No, he never even stirred. I think Lucille let him get at the Maker’s Mark. The doctor doesn’t want him drinking, but he doesn’t want him smoking, either, and I say what difference can it possibly make? No, this was a couple of days ago. ‘You an’ that fine-looking young man sleeping together, chère?’ You’re still a young man to Daddy, even the way I got your hair fixed.”\\n\\n “He asked me, too.”\\n\\n “He didn’t!”\\n\\n “That first time you left me alone with him. He came right out and asked me if I was sleeping with you.”\\n\\n “I don’t know why I should be surprised. It’s just like him. What did you say?”\\n\\n “That I wasn’t, of course. What’s so funny?”\\n\\n “Well, that’s not what I told him.”\\n\\n He propped himself up on an elbow, stared at her. “Why on earth would you—”\\n\\n “Because I didn’t want to tell him one thing and then have to go back and tell him another. Oh, come on, don’t tell me you didn’t know this was going to happen.”\\n\\n “Well, I had hopes.”\\n\\n “‘Well, I had hopes.’ You must have known when you asked me out to dinner.”\\n\\n “By that time,” he said, “they were high hopes.”\\n\\n “I was afraid you’d make a move that first night. Inviting you to stay here, and after I did it struck me that you might think that was more of an invitation than I had in mind. And that would have been the last thing I wanted just then.”\\n\\n “After what happened in the park? It was the last thing I would have suggested.”\\n\\n “All I wanted,” she said, “was to do a favor for someone who had saved my life. Except—”\\n\\n “Except what?”\\n\\n “Well, I wasn’t thinking this consciously at the time. But looking back, I might not have dragged you home if you didn’t look real cute.”\\n\\n “Cute?”\\n\\n “With your full head of shaggy dark hair. Don’t worry, you’re even cuter now.” She reached to stroke his hair. “There’s only one thing. I don’t know what to call you.”\\n\\n “Oh.”\\n\\n “I know your name, or at least the names they put in the paper. But I haven’t called you by name, or asked what to call you, because I don’t want to say the wrong thing sometime with other people around. And you were talking about getting a new set of ID.”\\n\\n “Yes, I want to get started on that.”\\n\\n “Well, you don’t know what name it’ll be, do you? So I want to wait until you do and start out calling you by your new name.” \\n\\n","sourceLink":"https://allnovel.net/hit-and-run-keller-4/page-23.html","bookId":2315,"book":{"id":2315,"title":"Hit and Run (Keller #4)","description":"Storyline: Hit and Run (Keller #4) \\n Keller\u0027s a hit man. For years now he\u0027s had places to go and people to kill. \\n But enough is enough. He\u0027s got money in the bank and just one last job standing between him and retirement. So he carries it out with his usual professionalism, and he heads home, and guess what? \\n One more job. Paid in advance, so what\u0027s he going to do? Give the money back?In Des Moines, Keller stalks his designated target and waits for the client to give him the go-ahead. And one fine morning he\u0027s picking out stamps for his collection (Sweden 1-5, the official reprints) at a shop in Urbandale when somebody guns down the charismatic governor of Ohio. \\n Back at his motel, Keller\u0027s watching TV when they show the killer\u0027s face. And there\u0027s something all too familiar about that face. . . . \\n Keller calls his associate Dot in White Plains, but there is no answer. He\u0027s stranded halfway across the country, every cop in America\u0027s just seen his picture, his ID and credit cards are no longer good, and he just spent almost all of his cash on the stamps. \\n Now what?\\n","cover":"https://allnovel.net/images/hit-and-run-keller-4.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hit-and-run-keller-4.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:19:33 PM"}}
