{"id":96309,"no":39,"title":"Page 39","content":"The only problem was that the parking spot was on the wrong side of the fairway. To get to the woods you had to cross the fairway, easy enough for Keller, but not so easy for a man with a broken leg. Keller could put an arm around Taggert and take most of his weight, but what would the two of them look like to anybody playing the hole? And you couldn’t just wait until a foursome played through, not with the amount of time it would take to get Taggert across the fairway; by the time they were halfway across, the next group of golfers would be at the tee.\n One man trotting across a fairway, that was nothing remarkable. Two men, one unable to walk, the other struggling to assist him — even someone as singleminded as a golfer would zoom over on his cart to see what was wrong, and what he could do to help.\n And could Taggert make it across, even with support? His entire lower leg, including the knee joint, was swollen and inflamed. They’d removed his shoe earlier, when Taggert complained that his foot had grown too large for it, and now it was larger still, twice the size of the other one.\n No, the man couldn’t go anywhere.\n “You’re going to have to wait here,” Keller told him. “In the trunk.”\n “The trunk!”\n “It won’t be that uncomfortable, and you won’t be in there that long. As soon as my work’s done, I’ll run you to a hospital and you can get that taken care of.”\n “But what if—”\n “If I don’t come back?”\n “I didn’t want to say that.”\n “Well, it’s possible. But there’s a latch, remember? You’re the one who told me about it. For kids playing refrigerator.”\n “How am I supposed to reach it with my hands tied behind my back?”\n “That’s a point,” Keller conceded, and clipped the wire on Taggert’s wrists. It still was no easy matter getting him into the trunk, and throughout it Taggert reeled off a litany of complaints — his leg was killing him, he could barely move his fingers, his shoulders felt dislocated, di dah di dah di dah.\n “It won’t be long,” Keller said. He put the shotgun on the floor of the trunk, near Taggert’s swollen foot, and checked to make sure that the revolver was fully loaded.\n “You’re leaving me the gun?”\n “The shotgun? I don’t want to carry it around on the golf course. Too easy for somebody to spot it.”\n “So you’re leaving it with me?”\n “Although I suppose they’d just mistake it for a four wood. But it’s bulky, I don’t want to carry it.”\n There was a car coming. Keller turned so his face wouldn’t show, waited for the car to pass. Meanwhile, Taggert said he was glad Keller trusted him enough to leave the shotgun with him.\n “It’s not exactly a matter of trust,” Keller said.\n 40\n When four golfers played a round together, you called it a foursome. Benjamin Wheeler was grouped with two other men, so it stood to reason that you’d call them a threesome, but you couldn’t use that word nowadays without imagining all three of them in bed, twisted into some unlikely position. Keller figured there ought to be a way around it, but he wasn’t sure what it might be. A trio? Maybe.\n He stood in the woods halfway up the fairway of the seventh hole. He’d left his jacket in the car, and was dressed in a pair of dark slacks and a polo shirt, reasonable attire for a golf course. He didn’t think anyone had seen him stride across the fairway, but if they had, there’d been nothing in his appearance to set off any alarms. The question might arise as to just what he was doing there, without cart or clubs, lurking among the trees and bushes.\n But then lurking was suspicious by definition, wasn’t it? The trick in lurking was to appear to be doing something else, but Keller couldn’t think of anything. What would anyone do there other than lurk? Well, look for a lost golf ball, he thought, but the companionable thing to do when you came upon someone so engaged was to help him look for it, and that was the last thing he wanted.\n Best, then, not to be noticed at all. And so he kept himself deep enough in the woods to pass unnoticed, surfacing now and then to inspect each arriving group of golfers, making sure Wheeler was not one of their number, and then slipping back once again into the shadows.\n In Arizona — Tucson, not Sedona — Keller had once rented a house on a golf course. He hadn’t been interested in either the house or the game, but it was the only way he could find to gain access to his quarry’s gated community. (If its residents were all bisexual, Dot had suggested, you might call it a double-gaited community.) His one-month sublet had brought with it membership in the on-premises country club, and access to its championship golf course. Keller had made use of the club’s bar and restaurant and hobnobbed with its golfer members, without ever quite managing to pick up a golf club or set foot on the course.\n Of course he’d watched the sport on television, though never with enormous enthusiasm. He found it more bearable than basketball or hockey, if less involving than football or baseball. The scenery, undulating expanses of green enlivened by tan sand traps shaped like amoebas, was restful to look at, and the announcers spoke in low tones, and sometimes even kept their mouths shut. The only way to improve on something like that, Keller sometimes thought, was to turn off the set altogether.\n Now, as Keller watched from the woods, he had no announcers to contend with, and no commercials, either. The tee was two hundred fifty yards to his left, the green almost that far to his right, and what he mostly saw were golfers gliding past him in their carts. Golf was what prosperous men did for exercise, but there didn’t seem to be much exercise involved. A good walk spoiled, he’d heard the game called, but that was back when there was some actual walking involved in it. Now all you did was ride from one shot to the next.\n He had to pay close attention, because he wasn’t sure he’d be able to spot Benjamin Wheeler. The face in the photographs was distinctive enough, certainly, but how distinctive would it be at two hundred yards?\n For the first time in months, Keller had a handgun tucked into the waistband of his trousers, pressing against the small of his back. He’d left the shotgun in the trunk of the Cadillac, and was just as glad, but he found himself wishing he’d brought the other long gun, the rifle. Not to try a shot at distance, but because the thing had been fitted with a scope sight, and the scope all by itself would be useful now as an aid in spotting his target. Meanwhile he stared hard at every golfer who came along, and none proved to be the man he was waiting for.\n Soon, he thought. They’d been scheduled to tee off at 11:15, and how much time was each hole likely to take? Some of the passing foursomes, he noted, took longer than others. Some golfers pulled two or three clubs from their bag before settling on the one they wanted for the shot, then prepared themselves with several practice swings, and finally tossed a handful of grass in the air to give them a read on wind direction and velocity. Others went straight to the ball, stepped up to it, addressed it (“Hello, ball!”) and gave it a whack.\n And, of course, the better golfers were faster, because the slower ones took more strokes. Keller couldn’t really see what they were doing once they got to the green, but it seemed to take some of them forever to get off it.\n A certain percentage of them hit slices, with the ball curving around sharply to the golfer’s right, sometimes into the light rough a few yards from Keller, sometimes into the deep rough where he was lurking. Each time he retreated deeper into the woods, remaining there until the golfer found his errant ball or gave up the hunt and played another. Now if Wheeler would have the decency to hit a shot like that, and then trot over to look for his ball…\n Soon, Keller thought.\n He spotted Wheeler the minute the man reached the seventh tee.\n With glasses, Keller had eyes like a hawk, but even an eagle would have had trouble at that distance. And Wheeler wasn’t facing him directly, so it was hard to explain how he was able to recognize the man. Something about his stance, maybe — but since Keller was seeing the man for the first time, how did he know what his stance looked like? Maybe it was pure animal instinct, the predator sensing the presence of his prey.\n Once he’d identified the man, he knew he wouldn’t have to worry about spotting him again. Wheeler, conservatively dressed in all three of the shots Dot had printed out, hewed to a different sartorial standard on the golf course. His golf slacks were bright purple, and his shirt was a Day-Glo canary yellow. He wore a tam-style cap, too, the kind with wedge-shaped pieces like slices of pizza, with a little button where they met in the middle of the pie, and the slices were scarlet and lime green.\n It was amazing, Keller thought, how a man could dress like a banker the rest of the time and then turn into a peacock on the golf course. But it did make it easy to tell the players apart.\n Another man had evidently won the last hole, which gave him the honor of teeing off first. He topped the ball and hit a roller down the middle of the fairway, not a lot of distance but a shot that wouldn’t get him in any trouble. It stopped fifty yards or so short of Keller.\n Wheeler was next. To me, Keller urged silently. Hit it over here, Ben. Drop your shoulder, pull up on the ball, and slice the hell out of it.\n Keller had been watching golfers today for long enough so that it seemed like forever, and of course he’d seen the pros enough times on TV. And Wheeler’s form, from what he could see of it, was nothing great. A pro could very likely have found ten things wrong with his swing, from his stance all the way to his follow-through, but evidently the ball didn’t know what a bad swing it was, because it took off as if Tiger Woods himself had just swatted it. Straight down the middle of the fairway, and damned if it didn’t reach where Keller was waiting and carry a few yards beyond him.\n And then of course the third man, who must have been last on the preceding hole, did what he could to be last on this one as well. He hit just the shot Keller had hoped for from Wheeler, a wicked slice that was bad from the moment it left the tee. The golfer knew it, too, letting the club fall, putting his face in his hands. His buddies consoled him, or teased him — it was impossible for Keller to tell which — and then they all mounted their motorized carts and headed down the fairway for their second shots.\n Keller had watched the ball land, and moved back into the woods, making sure he was out of sight when the unfortunate golfer got there. But it took him forever to get there, the idiot, because he looked all over the place and couldn’t find the damn thing.\n “Hey, Eddie, you want help there?”\n The offer came from Wheeler. Yes, Keller thought. Yes, please, come over here and give him a hand. But Eddie said no, he’d find it in a minute, and then he did, and jogged back to his cart for a club, and came back and managed to find the ball again.\n Half a dozen strides, Keller thought, and he’d have him. The driver who’d led off, whose ball hadn’t carried very far, had already taken his second shot. Wheeler was up ahead, planning his own shot, tossing bits of grass in the air. Nobody was looking at Eddie, who was pretty well screened from their view by the trees and bushes. Half a dozen strides and he’d have him, and he wouldn’t need the gun, his hands would do the job, and it would be over. \n","sourceLink":"https://allnovel.net/hit-and-run-keller-4/page-39.html","bookId":2315,"book":{"id":2315,"title":"Hit and Run (Keller #4)","description":"Storyline: \n Hit and Run (Keller #4) \n Keller\u0027s a hit man. For years now he\u0027s had places to go and people to kill. \n But enough is enough. He\u0027s got money in the bank and just one last job standing between him and retirement. So he carries it out with his usual professionalism, and he heads home, and guess what? \n One more job. Paid in advance, so what\u0027s he going to do? Give the money back?In Des Moines, Keller stalks his designated target and waits for the client to give him the go-ahead. And one fine morning he\u0027s picking out stamps for his collection (Sweden 1-5, the official reprints) at a shop in Urbandale when somebody guns down the charismatic governor of Ohio. \n Back at his motel, Keller\u0027s watching TV when they show the killer\u0027s face. And there\u0027s something all too familiar about that face. . . . \n Keller calls his associate Dot in White Plains, but there is no answer. He\u0027s stranded halfway across the country, every cop in America\u0027s just seen his picture, his ID and credit cards are no longer good, and he just spent almost all of his cash on the stamps. \n Now what?\n \n","cover":"https://allnovel.net/images/hit-and-run-keller-4.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/hit-and-run-keller-4.html","creation":"Oct 5, 2019 8:58:35 AM","modification":"Oct 5, 2019 6:19:33 PM"}}
