{"id":57839,"no":118,"title":"Vol 6 Chapter 5-1","content":"Vol 6: Chapter 5-1.\\n\\n Zheng’s group finally reached the marketplace. They split up into two groups according to plan. One group went to stock up the supplies while the other went to buy horses.\\n\\n “Yes, we only want horses, not camels. If you don’t have enough horses, we will get the rest from other merchants,” Jonathan said to the merchant as he pinched a gold nugget with his fingers.\\n\\n One had to admit that the plus side to greed was the ability to take every advantage possible in bargaining. Despite the unwillingness when he handed away the gold nugget, he actually had a whole gold bar in his pocket, the money Zheng gave him for taking on the task.\\n\\n The two groups finished their tasks within an hour. All the merchants showed great passion under the influence of gold and prepared everything they needed in such a short period of time. Without many more words, they took their supplies and left for a little warehouse on their horses.\\n\\n Ardeth led them inside the warehouse, an empty warehouse. He pulled a chain on the group and\\n\\n opened up an entrance to a tunnel. And at the same time, two guns pointed at them from the entrance.\\n\\n Ardeth yelled something then two men in black climbed out. They showed him respect and Ardeth nodded to them, then said to Zheng. “Follow me. The weapons are below.”\\n\\n The basement wasn’t too big, but contained a large quantity of weapons. Aside from cannons, it basically had every weapon available in this era, including machine guns taken off a fighter jet. Just like how it was in the movie, Ardeth picked the machine gun and some explosives.\\n\\n After everyone was ready, Honglu quickly said, “Have the two of them come with us. After we leave the marketplace, one will take part of our communication devices to the big group, the other will take the rest of the devices and head toward Hamunaptra at half our speed. As to us, we will each rotate between three horses and get to Hamunaptra as fast as possible. We will give them a surprise whether they arrive before us or not.”\\n\\n Just like this, the group left the marketplace again. To avoid getting mind controlled, everyone —including Honglu, who couldn’t actually fight—headed toward Hamunaptra. “It’s the third time we’ve crossed this place. I hope there won’t be a fourth,” Zheng said as he sat on the saddle looking over this desert.\\n\\n Evelyn laughed. “That’s not worded right. If we can’t see this a fourth time, doesn’t it mean that we died in Hamunaptra? It should be we must see it a fourth time.”\\n\\n Zheng laughed at it. This was something only the players understood. They would go back to God’s dimension if they finished the mission, so there’s no chance of seeing this scenery again. Otherwise it would mean they failed and were chasing them or running away. Both of which could end in a wipe. “I am tired of running. Might as well bet it all and settle everything in Hamunaptra. All the issues started there and will end there!” Zheng looked at the Na ring. It had several grenades that weren’t there before. The team decided to bury Tengyi on a hill outside the marketplace and found these grenades on his body. “Let everything end there!”\\n\\n The hardships were unimaginable when traveling nonstop and rotating between three horses. They felt like their bodies were falling apart. Fortunately Lan’s stamina buff kept them going. They reduced the travel time from several days to just one day and night.\\n\\n It was 4am, just one more hour before they reached Hamunaptra, right before sunrise. Then they felt the ground tremble and the intensity was gradually becoming more obvious.\\n\\n Everyone turned around but it was pitch black. They couldn’t see anything beyond a hundred meters. Zero rode to the top of a little hill and looked out. “A large area of the sand is rolling toward us. Doesn’t seem like a sandstorm, it’s only a meter or two in height. It’s the mummies! So many of them and they are coming so fast!”\\n\\n These mummies had no stamina bar, nor could they feel pain or death. Several thousand mummies were running nonstop at a speed that could rival horses.\\n\\n Right as Zero finished his words, another wave of rolling sand came into view along with clopping sounds. Ten thousand black cavalry guards were charging at the mummies. Though both parties were at quite some distance. If it wasn’t for his Hawkeye, he wouldn’t be able to see them. Zero immediately rode back to the group. “Really? Everyone pick up your speed. We will give them a surprise!” Zheng yelled and led the way to Hamunaptra.\\n\\n The group finally reached Hamunaptra at sunrise. Hamunaptra looked magnificent under the golden sunlight, as if it had gone back through time to Egypt’s prosperous era. But no one had the time to appreciate this scenery as a dozen planes flew into Hamunaptra.\\n\\n Everyone hid in the shadows between several stone pillars for the planes to pass. Then Zheng asked Zero, “Can you snipe the planes down?”\\n\\n Zero sighed. “Won’t be able to get all of them. No problem if it’s only a few. The Gauss rifle is powerful but it takes too long to reload. I can only shoot three times before the planes land. I think this is the reason they brought so many planes, to avoid getting sniped.”\\n\\n Everyone sighed as this chance went to waste. Zheng exhaled and said, “Then follow our original plan. Zero is responsible for sniping that Indian woman and Heng will protect you. Remember to run after one shot whether it hits or not. Everyone else come with me into the tomb. Then we will split up to search for the statue of Ra. Whoever finds it signals with a gunshot.”\\n\\n Zheng repeated their plan then walked to the entrance to the tomb. He turned around and looked at Zero and Heng again before entering. Zero was searching for a suitable spot whereas Heng was adjusting his bow. During this moment Zheng turned around, a hand grabbed his neck from behind and lifted him up.\\n\\n By the entrance to the tomb, a hand formed by sand suddenly appeared. More sand gathered around it and formed Imhotep’s figure. He threw Zheng into the tomb. Zheng collided with a wall but because the wall was rather fragile, he went through it and collided with something metallic.\\n\\n Ardeth and Jie were nearest to the entrance. They both opened fire at Imhotep. Yet it was shown that even magical bullets were ineffective against him in Cairo, so these normal bullets they were now using were even more so. The bullets shot through him then the hole instantly recovered. O’Connell fired with his rifle but to no avail. Imhotep stood there unharmed then transformed into a sandstorm.\\n\\n Yinkong reacted immediately but she only got to pull out her dagger before that sandstorm went into the tomb and disappeared from their view.\\n\\n At the same time.\\n\\n Bang!\\n\\n The Gauss rifle made its shot at Zero’s target.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-6-chapter-5-1","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
