{"id":57903,"no":182,"title":"Vol 9: Chapter 8-3.","content":"Vol 9: Chapter 8-3. ChengXiao\u0027s eyes were shining. \"Of course the Xian enchanted needles. Is there really Xian energy?\" Zheng shook his head. \"There isn\u0027t Xian energy, that\u0027s just in the name. The description of this item is, forged using method of the Xians. It is said that even if you miss the acupoint while inserting it, the needle can still increase the subject\u0027s recovery rate. However, if you know acupuncture, this item can be a great medical equipment. Though the surgical equipment is also a sci-fi item.\" ChengXiao interrupted him. \"The Xian enchanted needles without question. Think about it, will you use knifes in a SM play? Needles, whips, candles are the thing.\" \"Let\u0027s continue. For the defensive item, I think the Dharmacakra is great for you.\" Zheng was having a headache and quickly changed the topic. But ChengXiao shook his head. \"No, you forgot that I already used a rank D reward. So I don\u0027t have an extra C reward to get a defensive item. Go on with the rank C weapon.\" Zheng looked at him in confusion then remembered the girl that he created and nodded. \"For close to mid range weapon, I suggest the MA-M8 beam tomahawk. It has a ten meter long gravity chain. When you throw it at your target, it will cause an explosion if the microcomputer detects the distance between you and the tomahawk is higher than five meters. This weapon can be used in both close range and mid range.\" ChengXiao pointed at himself and said. \"You mean you want someone this handsome to use an axe? An axe that only appeared in anime? Do you know how ugly the robot that uses this axe is? I don\u0027t want it! I would rather use a beam saber than the tomahawk!\" Zheng laughed. \"You are out. The current trend is not about cool anymore. It\u0027s about getting hardcore. But it\u0027s difficult for a handsome lad like you to act hardcore, so you may as well just use a weapon that shows it. It complements your handsomeness perfectly.\" ChengXiao scratched his head. \"Haha, I am flattered. I am not that handsome, just a little bit. It\u0027s the tomahawk then. Haha.\" Zheng let out a sigh of relief. He was quite impressed with ChengXiao not choosing a defensive item, because that meant throwing away a chance to live. Even though Honglu would make one of the defensive shields for him, but that\u0027s not on par with a magical item like the Dharmacakra, which should be able to block one hit from a Newborn. ChengXiao\u0027s choice of getting the needles was a sacrifice for the team. Zheng thought for a moment then said. \"I have only considered these three points. However, since you have two rank D rewards left, I think you should just save them in case there\u0027s a sudden need for them. If we had the extra rewards before the last movie, we wouldn\u0027t had been in a passive position.\" ChengXiao nodded then closed his eyes under the sphere as everyone else did. When he opened his eyes, his hand was holding onto a box made of jade. There were twenty golden needles inside the box. Touching the needles gave him a chilling sensation. Looking carefully, the needles were emitting a very faint light. \"Good stuff! Living up to its name!\" ChengXiao exclaimed. His medical knowledge was solid. He could tell the value of the needles as soon as he took one out. The reason it only cost a rank C reward was because they were not weapons. ChengXiao believed its value could compare with rank A items when used by people skilled with them. In contrast to the little box, the white tomahawk was huge. However, it only weighed twenty kilograms, probably due to its materials. ChengXiao grabbed the axe. A flash of light blinked on the axe. He could felt an invisible chain connected to its handle, the gravity chain. ChengXiao held up the tomahawk and laughed. \"How does it look? Handsome?\" Everyone started laughing along at his pose, a somewhat handsome young man laughing while holding an axe. It took them quite a while before they stopped. ChengXiao grabbed the invisible chain and threw the tomahawk out. When it reached ten meters away, it caused an explosion and a meter wide hole on the floor. The platform was very special. Its floor was a layer of granite, but any damage done to it would be recovered the next day. So no one said anything about the hole and was just impressed with its power. The lightning sparkles during its explosion also looked flashy. Zheng laughed then said to everyone. \"I am the only one left. I have two options, enhance my Qi to rank B but I am not sure if it will retain the corrosive property. I also don\u0027t have any ability other than the movement technique that requires Qi. So I am not too dependent on it. My second option is exchanging an ability. I want to get a close combat fighting ability. Best if it works with a weapon.\" Honglu thought about it then said. \"I think the first option is better. Enhancing Qi will also increase your stats and the effectiveness of the movement technique. In contrast, if you get an ability, you might not have the Qi to utilize it. If the corrosiveness goes away then let it be. You will eventually have to enhance the Qi.\" Heng also nodded. \"Yeah, you don\u0027t have to exchange an offensive ability. Like the Focused ability is more useful to me than anything else. I think enhanced Qi is pretty good.\" The others agreed because enhancing Qi would increase Zheng\u0027s survivability more, but getting a combat ability might have him just end up killing the enemy when he gets killed. Zheng nodded. \"Ok, it\u0027s Qi then. Hoho, there are so many abilities that utilize Qi. Most of them are rank B and above. There\u0027s a rank AA ability called Ten Steps Kill. It sounds so cool and rank AA, so it should be quite powerful too.\" After saying that, he had no choice but to enhance high level Qi. \"High level Qi, rating 87. Suitable for movies requiring close combat. Greatly increases the quantity of Qi, can also buff stats temporarily. Requires 2500 points, rank B reward, and intermediate level Qi.\" After selecting the enhancement, he floated up just like before. Countless particles entered his body. When the enhancement was completed, he gave off a sense of filled with power. The pool of Qi in his navel circulated throughout his body, giving him a comfortable feeling like being submerged in warm water. It took quite a while before the Qi returned to its pool. \"Great!\" Zheng howled then activated the movement technique. He used to be able to jump two meters high and he could now jump up to four meters. This was only the most basic movement technique. He couldn\u0027t imagine how strong were the ones that were given a name, and what about the combat abilities? Zheng was lost in his imaginations. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-9-chapter-8-03","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” The world shall change when you click YES. In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. Who is the true enemy?","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
