{"id":57904,"no":183,"title":"Vol 9: Chapter 9-1.","content":"Vol 9: Chapter 9-1. The first five days were spent testing new enhancements and abilities. Everyone took a peaceful rest in the remaining days. The previous movie was probably too stressful. Even though it was only an hour, but everyone was running for their lives the whole time. The time was short, yet the stress was more than any other movie they had been through. The other reason was the team battle next movie. Although the preparations were made but who could say they would live? A few days of training wouldn’t make much of a difference, so they’d rather just enjoy life for a while. These are the days everyone wanted. 50 points could turn the basement into a realistic world with sunrise, wind, and rain. The only thing strange was a set of stairs out of no where. On the sixth day, the group planned a field trip together in Zheng’s room. He and Lori studied a documentary of the Alps to create its scenery in the basement. The area spanned 100 kilometers. Aside from the snowy mountains were a green prairie with a little river. This looked like a natural, unpolluted resort. It would have been destroyed by tourists in the real world. Everyone gathered in Zheng’s room the next day. Four men and five women entered the basement each carrying food and drinks, charcoal and plates. The main ingredient for barbecue was the fish from he river. Zheng specifically put a wide variety of freshwater fish in it. Fishing was also a part of spending their time leisurely. Everyone exclaimed at the scenery as soon as they entered. The entrance was on a little hill. Looking ahead of them was a green field of grass waving from the wind. Further away was a set of slowly mountains, then a clear blue sky, and golden sunlight, making this place seem like heaven. They walked down the hill into a forest with a river not far away. “It’s beautiful!” Lan was the first to compliment, followed by Ran and ChengXiao’s girl. They laughed then took Lori and Yinkong’s hands as they headed toward the river. Each of the girls had their unique beauty that was complemented by the scenery. The girls played by the river and looked so happy. Even Yinkong had a smile on her face. Zheng and the other men had begun setting up the grill, clearing the field, and set up a big pot. “Ok, ladies. Let’s go pick some mushrooms. Haha.” ChengXiao laughed pervertedly. The reply was a punch each girl. Yinkong’s first was the hardest and destroyed all his dreams at once. ChengXiao was very resilient. He quickly flipped back up and laughed. “Such lovely girls. They’re so cute even when they’re hitting.” “Don’t think so…” The other three men wiped the sweat on their forehead. After setting up the place, they each took a fishing rod to the river. Zheng brought out a little box and said. “Haha, super baits, 5 points for a box. The description said that every type of fish will like them.” They smelled an exotic scent as soon as they opened the box. The bait was a high density paste. Even though it was small but there was more than enough to use. Honglu put a little paste on the hook and cast it in the river. “Are there a lot of fish here? What varieties?” Zheng also cast the hook out and sat down by the river. “Don’t underestimate this little river. It\u0027s only six meters wide but also several meters deep. If you don’t know how to swim, you should sit back a little more. There’s ayu, eel, giant sword minnow, saury, roughskin sculpin, etc. All of them are rare species since the fish don’t cost any points. Following down the stream, you will see a lake. There’s a crocodile in the lake. I heard crocodile meat tastes delicate. Find a time to give a a try.” Honglu sighed. “To be honest, I don’t like to eat fish. The little bones are too easy to get stuck in your throat. In contrast, I think insects taste good. Give them a try. Like honey bee pupae, or fried centipede, or grilled spider. These insects taste very flavorful.” Zheng and Heng massaged their stomaches. ChengXiao went up to Honglu with a laugh. “Insect feast? I had been eating them since I was a kid. My mom liked to give me these insects and said the more venomous they are, the better they taste. Haha.” Honglu nodded then he felt a pull on his fishing rod. The string was also pulling away from him. Heng immediately grabbed the rod and pulled it up. Zheng also came over to help. “These strings are made of glass fiber, not even a whale can snap them. Here it comes!” An eel like fish was pulled from the water. Zheng studied these fish the day before and said. “This is the marbled eel. It was said to be delicious and doesn’t have the little bones.” Just then, Heng pulled his own rod and a large flat fish came out of the water. The baits lived up to its name. Their buckets were filled with fish within just ten minutes. They had to release some back into the water to prevent overflowing. The girls still hadn’t come back so the men lay on the grass and chatted as they smoked cigarettes. “So the government isn’t selecting people from the army but from the special forces and people with special abilities?” Zheng asked. ChengXiao said. “Right. This is Colonel Xuan’s order. To be honest, I was shocked when I just entered, because he was dead. Do you know how excellent he was? He’s strong in combat, aside from locking techniques, I can’t win against him in any area. His wisdom is unimaginable. He’s the person I look up to.” Zheng fell into silence for a moment then muttered. “Are you also from the same military base? How do you know Xuan?” “My uncle is a researcher in the military. I went along with him and entered the periphery of the base when I was a kid and met Colonel Xuan. He’s like a classic representation of ‘don’t come near’. Even though he doesn’t say anything cold but that apathetic expression rejected everyone.” Zheng sighed and didn’t say anything. As the singing of birds came from afar, this was a leisure he had not felt in a long time. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-9-chapter-9-01","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” The world shall change when you click YES. In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. Who is the true enemy?","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
