{"id":57906,"no":185,"title":"Vol 10: Chapter 1-1.","content":"Vol 10: Chapter 1-1.\\n\\n Zheng was calm during this half awake state. He didn’t realize when had it started that he wasn’t scared of death or battles. He just wanted to try his best to overcome the difficulties.\\n\\n \\n\\n \\n\\n As soon as he opened his eyes, he looked to the ground. There were only two newbies this time, one man and one woman. Both of them were dressed normally. The man was in his mid twenties, and the woman in her early twenties. They should be normal people.\\n\\n \\n\\n \\n\\n This was an office room with one desk and one chair. On the desk were a computer and various documents scattered. The difficulty of this movie was very little. It was an eight-person difficulty, not much more difficult compared to the first Resident Evil movie.\\n\\n \\n\\n \\n\\n “Is this the police station?” Honglu looked out the windows and muttered.\\n\\n \\n\\n \\n\\n Everyone’s eyes followed. People were screaming outside, the police trying to calm people down, yet these people bit anyone they caught, and some bystanders watched in fear. The outside was in a chaos.\\n\\n \\n\\n \\n\\n Zheng took a look then said. “Honglu, where is the plot up to?”\\n\\n \\n\\n \\n\\n Honglu thought for a moment then said. “I don’t know our current location. There weren’t too many police stations in the movie. I think that one that still has cops inside should be in the beginning. The virus had just leaked out from the lab, so only some people were infected. Umbrella corporation knew it’s not going well and sent people to transport the scientists away. The plot should be during this point.”\\n\\n \\n\\n \\n\\n Zheng nodded. “If that’s so then we aren’t in danger. ChengXiao, did you exchange the antidotes? The ones that work within thirty seconds.”\\n\\n \\n\\n \\n\\n ChengXiao replied complaining. “I told you the Xian needles can solve most viruses. You just won’t believe me…”\\n\\n \\n\\n \\n\\n “Did you get it?” Zheng and Honglu both yelled and shocked him. He immediately nodded his head.\\n\\n \\n\\n \\n\\n Zheng let out a sigh of relief. He sat next to the others and said. “Let’s see the mission first. Perhaps we…”\\n\\n \\n\\n \\n\\n The words on the watch killed his mood to speak.\\n\\n \\n\\n \\n\\n “Find the daughter of the researcher. Help her escape the Raccoon City checkpoint. Awards each member a rank D reward. Team Devil will enter the world after the researcher’s daughter is found. Location is entrance is random. Killing a normal member awards 2000 points, a rank C reward. Killing an unlocked member awards 7000 points, a rank B reward. Minus one point for each member in your team killed. Plus one point for each member of the other team you kill. The final score multiplied by 2000 will be added as points at the end.”\\n\\n \\n\\n \\n\\n Everyone looked at this message in a daze. No one ever thought about encountering the two special teams after hearing their existence from Zheng. Yet, this actually happened. Their luck was through the bottom.\\n\\n \\n\\n \\n\\n Honglu pulled several strands of hair off and said angrily. “How is this possible? Why did these two teams enter a team battle with the normal teams? This isn’t rational!”\\n\\n \\n\\n \\n\\n No one answered him and just looked at Zheng. Zheng sighed. “This is my fault. God didn’t mention the possibility of team Devil and team Celestial encountering the normal teams, but since God also treats them as a team, then this should be how it works. Honglu, try to analyze their power.”\\n\\n \\n\\n \\n\\n Honglu had calmed down and said bitterly. “I have thought about encountering them ever since you told me, just that I never thought it would be so fast. Furthermore, I think team Devil is scarier than team Celestial.”\\n\\n \\n\\n \\n\\n “The basic requirement for entering team Celestial is the second stage of the unlocked mode. This is their advantage. A newly formed team Celestial will definitely win against a newly formed team Devil. However, team Devil has a higher rate of growth.”\\n\\n \\n\\n \\n\\n “From the information God had given us, team Devil is composed of players with the highest potentials. Like Zheng, you are already cloned to the team, and I still can’t figure out how much potential you have. Think about it, a normal person growing to such an extent within several movies. Furthermore, it’s under the condition that the Guide had problems. You lived and formed a team. Your potential greatly surpassed ours.”\\n\\n \\n\\n \\n\\n Zheng asked. “Leave my problem for later. I am more concerned about how strong they would be.”\\n\\n \\n\\n \\n\\n Honglu shook his head with a bitter smile. “If team Devil has ten people, three of them has the same potential as you, three of them has 80% of your potential, three of them has 50% of your potential, and one person has more potential than you, we are dead if they lived through five movies. They also won’t give a weaker team any chance to speak. They will want to kill us for the points and rewards.”\\n\\n \\n\\n \\n\\n Zheng took a deep breath and said. “We are already determined to be the weaker team for entering the movie earlier. Then can we escape this city as soon as we find the girl? If we completed the mission, then they won’t be able to catch us. Lan, scan the city for its layout, find the checkpoint and the little girl.”\\n\\n \\n\\n \\n\\n Lan replied. “I haven’t seen the girl so I can’t find her. I don’t know which mental figure belongs to her. As for the city layout and the checkpoint…”\\n\\n \\n\\n \\n\\n She closed her eyes for ten seconds then opened them with surprise. “I get the layout but not the checkpoint. This city is too big. I can only reach seventy kilometers and that’s not the boundary of the city. Do you want me to search for it by focusing on a straight line?” Lan muttered.\\n\\n \\n\\n \\n\\n Zheng shook his head. “No, the plot probably changed for the city to be this big. The original city wasn’t so big and would only take several hours to reach the checkpoint by car. Lan, check how big this city is.”\\n\\n \\n\\n \\n\\n Lan nodded and closed her eyes. “The city boundary from this direction is three hundred kilometers away. If we are in the center, then this city has a diameter of six hundred kilometers.”\\n\\n \\n\\n \\n\\n Honglu sighed. “The plot has indeed changed. A normal big city is only two hundred kilometer square, but this city is several hundreds. God’s intention is straightforward. It doesn’t allow us to reach the checkpoint too fast after finding the girl, which would eliminate the chance of encountering team Devil. With a city this big, it will be our ability if we can avoid team Devil all the way. However, when we are running to the checkpoint, they should have enough time to catch up to us. This is what God wishes, for the two teams to fight!”\\n\\n \\n\\n \\n\\n “Or let team Devil kill us, so this team of selected will evolve further.”\\n\\n \\n\\n \\n\\n Everyone fell into silence in contrast to the screaming outside the room.\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-10-chapter-1-01","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
