{"id":57943,"no":222,"title":"Vol 11: Chapter 3-2.","content":"Vol 11: Chapter 3-2.\n \"Even though you gave me a lot of gold, but are you sure this skateboard can fly us? Especially such a long distance to Hamunaptra? Don’t kid me. Let\u0027s stay with the supplies group. Not like you need this little bit of extra time.\" Jonathan gave him a weird look as he looked at the basket hanging below the Sky Stick. \n \n Zheng laughed. \"Relax, this hoverboard can carry 800 kg. I don\u0027t think any of us four people weight more than 200 kg. Haha, I also included the weight of the basket in my estimate. If you are still worried, we will fly at a low height for a bit.\" \n \n In the end, O\u0027Connell and the other two couldn\u0027t hold their curiosities and entered the basket. The three of them calmed down when the Sky Stick was flying steadily. Jonathan yelled. \"Zheng, this thing is so convenient. Do you have the design papers? I have a few friends who work in manufacturing. Maybe we can mass produce this thing and sell it. It should worth more than an airplane with its speed. How about fifty fifty on the profits? Uh, fine. You get sixty, or seventy? Hey, it can\u0027t get more than eighty.\" \n \n Zheng felt peaceful as he listened to the voices from below. This was the feeling of being with comrades. He finally get to experience this feeling again after Resident Evil. These people once fought along with him after all. \n \n The Sky Stick\u0027s speed was lowered due to the extra basket and people and its energy was depleting at twice the normal rate. It could last thirty more hours at this rate, then it had to be recharged in God\u0027s dimension unless he could swap the solid state energy cubes. \n \n (The energy cubes cost 300 points each, one of the most expensive energies. However, the Sky Stick is convenient until I can get a BB or A tier flying sword. So I should carry a few energy cubes when I have the extra points.) \n \n Zheng thought as he flew. About two hours later, Hamunaptra came in sight. The whole site was filled with workers as they looked down from the sky. The scene of several thousand people working looked astonishing. The first layer of Hamunaptra was almost finished excavating. The Medjais cried every time a golden object was unearthed. Jonathan\u0027s breathing suddenly became heavy. \n \n Once they landed, Ardeth and several elders came over. \"It didn\u0027t even took a whole afternoon for you to bring them over. Do you have another one? It can carry so many people.\" \n \n Zheng smiled apologetically. \"Just one. This is expensive even in our world, much more expensive than gold. But I can bring you the design papers when I get a chance.\" \n \n Ardeth seemed disappointed but he said with a laughter. \"Leave it for next time then. The elders have come to a conclusion that if you obtain the Spear of Osiris and defeat ten of our strongest warriors barehanded, we will give you the information of the bracelet. The ten warriors will use weapons.\" \n \n Zheng felt pretty pleased with himself then Ardeth said in a low voice next to him. \"They dug up a gold statue of Ra in the afternoon that\u0027s at least 15 tons. The old men almost gone crazy so they agreed to it quite readily.\" \n \n Zheng laughed and took out the short staff from his ring. \"Ha, my luck is amazing. Do you remember that report of the spear gotten stolen? The one that stole it was Jonathan.\" \n \n Ardeth was surprised and also laughed. \"So, it\u0027s Jonathan. It\u0027s surely an easy task for him.\" \n \n Jonathan interjected. \"Oh please, I am just borrowing. Don\u0027t slander my reputation.\" \n \n Everyone ignored him. O\u0027Connell said. \"What kind of rules is this to fight ten people with weapons barehanded? Can\u0027t you use your power as a tribe leader?\" \n \n Ardeth shrugged. \"Nothing I can do. The elders are the second highest ranked aside from the priest. They can remove my position as the leader easily. In fact, they always thought of the Scorpion King\u0027s treasures as theirs. They don\u0027t want anyone else to obtain it even if they can\u0027t. This test is designed to make it difficult for you. They probably don\u0027t want to see you obtaining the treasure.\" \n \n Zheng suddenly smiled at the elders who were confused by it. He twisted open the spear and aimed it at an empty area. Everyone looked at him quietly, waiting for him to throw it. \n \n (It can take in both qi and blood energy. What about the fusion of these two energies?) \n \n Zheng channeled both energies to his arm then entered the spear. It sucked in his energies continuously like an abyss. Once the spear started glowing in a golden light, Zheng gave a shout and threw it out. \n \n The spear crossed 1500 meters then pierced into the ground. A golden light emerged from it. There was no sound of explosions but it created a hole of eight meters wide and three meters deep. \n \n The destructive power shocked even Zheng. When he channeled both energies to the axe, it only gave the axe extra corrosive properties and toughness. The spear was different. Was it because of it being a quest item? Was there a lot of this type of items? \n \n The elders were also shocked. They yelled and several men started running to the spear. However, Zheng was much faster than them with the movement technique. He surpassed them and grabbed the spear. The men stared at him with hostility. \n \n The elders looked anxious as they talked to Ardeth. Ardeth seemed enraged by it. \n \n Zheng could have guessed what they were talking about. The elders couldn\u0027t let go of a treasure like this. The spear didn\u0027t have such destructive power in the movie when O\u0027Connell used it. So it was probably the same as the Book of the Dead and the Book of Amun-Ra that only had an effect when the players used it. He laughed and said. \"No problem. You want to try its power? No one else can bring out its power. Go ahead and give it a try.\" He handed the spear to them. \n \n One of the elder grabbed the spear before Ardeth could say anything, then gave it to a large man. The man aimed it at a hill and took a deep breath. He ran a few steps then threw it out. \n \n However, there was no glow of any kind. The spear flew almost a hundred meters and hit the hill. The hill stood there intact. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-11-chapter-3-02","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \n The world shall change when you click YES. \n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \n Who is the true enemy?\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
