{"id":57980,"no":259,"title":"Vol 12: Chapter 5-1.","content":"Vol 12: Chapter 5-1.\\n\\n The bees took a while to respond. A few seconds later, they heard a horrifying sound. The sound of countless flying insects flapping their wings. At the same time, the bees on the outer shell began to charge at them. \\n\\n \\n\\n Zheng yelled. \"Detonate!\" \\n\\n \\n\\n WangXia indeed had the talent in modifying bombs. He created the stink bombs and modified the timed bombs to remote controlled detonation in less than an hour. He also removed part of the explosive powder so as to not destroy the stink bombs in the detonation. This looked impressive to Zheng but Kampa and Xuan looked rather casual about it. Perhaps this kind of talent was normal among the special forces. \\n\\n \\n\\n WangXia pressed the detonation button as soon as Zheng yelled. Black smoke rose along the explosion from several locations and covered the facility. \\n\\n \\n\\n The looked up to see a black wave flying out from the facility. In the beginning the bees were just the size of a palm. But as time went on, the bees were becoming bigger and bigger. In the end, the twinbees were the size of an adult arm. Black smoke finally came out from the facility behind the bees. Zheng took a deep breath and carried Xuan and ran toward the facility. \\n\\n \\n\\n The moment they went into the smoke, over a hundred bees jumped at them. Xuan took out his pistols and began shooting at both sides and their back. Even with so many bees here, not one could come near them. \\n\\n \\n\\n Zheng entered the unlocked state when they entered the smoke. He activated the movement technique. In just a few seconds he approached the entrance of the facility then jumped in. \\n\\n \\n\\n A thick smoke filled the inside of the facility. Normal people wouldn’t have been able to see a thing. A thick slimy liquid covered the walls. This liquid didn’t smell anything like honey at all but rather smelled like blood. If you were to look closely, you would find out the liquid was composed with blood. \\n\\n \\n\\n Though Zheng didn\u0027t have the time to care about this sort of thing. He was running at his limit under normal conditions. In fact, he was jumping along the walls and pillars which increased his speed by quite a lot. He reached the main lobby of the facility in just twenty seconds. \\n\\n \\n\\n This room could barely be recognized as a lobby. There were dark, red hives all over the place. Inside the hives were either eggs the size of ostrich eggs or large maggots. The density of these things agitated Zheng. His speed was reduced since even the floor was covered with hives. Each step would drown his leg in thick bloody liquid. This room felt worse than that of the Alien hive. \\n\\n \\n\\n Neither he nor Xuan could speak under the smoke. Xuan pointed to the left side of the lobby. Zheng then stepped hard onto the ground, crushing a hive and jumped up. He jumped across seven meters then kicked the wall. He broke through the wall. Behind it was a room for document storage. However, the room was a mess at this point. No documents could be seen and the floor was covered in blood. A pungent and rancid smell floated along with the smoke. \\n\\n \\n\\n Zheng took out the axe and began clearing the hives in this room. Suddenly, they heard a ding and their hearts skipped a beat. He put his hand into the hive his axe hit and pulled out a safe. \\n\\n \\n\\n A minute had passed at this point. Zheng had no time to waste. He hacked open the safe. Xuan also got down from his back. There was no need for them to exchange any worlds. Zheng started running toward the door while Xuan began to go through almost a hundred pieces of document from the safe. \\n\\n \\n\\n Time! Time! Zheng could hold a breath for over five minutes but not Xuan. He had to kill the queen bee within a minute or else Xuan would die from suffocation or get swarmed by the bees. \\n\\n \\n\\n The lobby was actually the size of half a soccer field. Which was reasonable since this facility was designed to research dinosaurs. But due to this size and the number of hives residing here, it looked extremely creepy. Yet, Zheng had to look for the queen bee in this environment. \\n\\n \\n\\n He heard a buzzing sound and immediately turned his head over. Several gigantic bees were flying at him from the ceiling. These gigantic bees were almost half his size and didn’t seem to be affected by the smoke. They could see Zheng from afar and were approaching at an incredible speed. \\n\\n \\n\\n Zheng suddenly remembered Xuan said the queen bees were different from queen ants in that they didn\u0027t just reproduce, but also had the highest attack power among all the bees. There should also be ten or more male bees guarding the queens. These male bees were the kings and were larger than normal bees. \\n\\n \\n\\n \"Insects have much higher strength and reaction speed than reptiles. Ants can lift twenty times their weight, something no other species could achieve. Even though it is uncertain if they retain the same multiplier as their size grows, but reptiles would never surpass the strength and reaction speed of insects at the same size.\" \\n\\n \\n\\n Zheng only had time to recall this conversation. As soon as he lifted the axe to block in front of him, a male bee had slapped its tail at the axe. The huge force almost knocked the axe off his hands. Zheng was under the first stage and using qi at this moment, so his strength was several times higher than a normal person. Which meant the male bee\u0027s strength was at least ten times that of a normal person. \\n\\n \\n\\n \"Ah!\" Zheng was pushed back several meters. The insects\u0027 strength was beyond his expectation but he had been through so many trials already. He fought his way through Aliens, ghosts, zombies, nemesis, and other strong fighters. Those enemies were nothing less than these insects. He entered the second stage of the unlocked mode. His arms enlarged and his reaction speed increased. As another male bee charged at him, he swung the axe horizontally and slashed the bee in half. \\n\\n \\n\\n Danger also meant rewards. He had grown stronger and stronger each time he survived the life and death trials. He could fight these insects even if he didn\u0027t use Explosion. If it was anyone else in his place, like Kampa would not have the reaction speed to catch the bees despite the EMP rifle was powerful enough. \\n\\n \\n\\n Sci-fi weapons were useful, but they couldn\u0027t be all. Evolution and becoming strong was the best way to deal with danger! \\n\\n \\n\\n Zheng slashed another male bee then charged at where they were coming from! \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-12-chapter-5-01","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
