{"id":58016,"no":295,"title":"Vol 13: Chapter 10-2.","content":"Vol 13: Chapter 10-2.\\n\\n Brown hair\u0027s face was completely deformed. The kick also punctured a hole in his chest. Either of these wounds was fatal to any normal person. \\n\\n \\n\\n However, he was like a shapeshifting insect without a specified body. The wounds began regenerating. Flesh and bone branched out to fill in the wounds. In just several seconds, he was able to got himself down from the streetlight. Though his back was bent. The smash probably broke his spine. Yet this also healed in no time. The dragon and Zheng\u0027s regenerating rates paled in comparison. \\n\\n \\n\\n Brown hair touched his body then raised his head to give Zheng a cold smile. \"Very good. Very strong. I had felt that my evolution stopped recently because I was surrounded by a bunch of trash and low level species. It was useless absorbing their bodies. Without a strong force to give me comparisons and fight with me, this perfect body of mine couldn\u0027t improve further. I mistaken you. You are a high level being like me. I can taste the essence of that high level species from your blood. Such a delicious taste. Just one bite of it and I can feel my body evolving again. Become part of me. Use your full strength to make this perfect body evolve again!\" \\n\\n \\n\\n Brown hair charged at Zheng. The concrete ground exploded with every step he took. His strength increased again. Not only strength but also speed. He reached Zheng in just three to four seconds. Dozens of blood vessels from his body stabbed toward Zheng like a rain of arrows. \\n\\n \\n\\n Zheng frowned. He used over 70% of his strength during explosion but the monster came back at him without any wound. He wasn\u0027t sure if this was an ability of the mask or a native ability of the fourth stage. Growing stronger when faced against tough opponents? \\n\\n \\n\\n He jumped up over five meters high using the movement technique and Explosion. The blood vessels stabbed under him. Then he dropped down and stepped the vessels to the ground. The force smashed the blood vessels and a half meter deep hole on the ground. However, the baby boy in his arm cried before he could take the next action. \\n\\n \\n\\n Zheng felt irritated. The monster couldn\u0027t rival him in the Explosion state but the monster also didn\u0027t care about the life of the boy. Zheng couldn\u0027t do the same since the boy\u0027s life was linked to the 10000 points punishment for the team. Furthermore, he would also choose to protect the boy with his life since the boy was O\u0027Connell and Evelyn\u0027s child. He cursed and ran toward the exit. \\n\\n \\n\\n Brown hair\u0027s strength and speed were still increasing. It seemed like once he fought Zheng, his body would continue evolving until it reached the same strength and speed as Zheng in his Explosion state. \\n\\n \\n\\n \"Zero, can you hear me? Shoot his legs. He needs time to recover. We have to limit his mobility for now.\" Zheng was aware he couldn\u0027t kill the monster at this time since he had to protect the boy. \\n\\n \\n\\n About two seconds later, he heard Zero\u0027s reply. \"I can see him but my hands can\u0027t keep up with the speed. I need you to slow him dow for one to two seconds.\" \\n\\n \\n\\n \"Ok! Kampa, can you see us? Once his legs get shot, tear him to pieces. WangXia, I need you to lob a bomb over. Set it to five seconds. Throw it as soon as Zero shot his legs. I am not fighting alone! His body may be strong but our strength as a team will tear him to pieces!\" \\n\\n \\n\\n The soul link connected the whole team closely together. They could plan and react to any situation immediately. \\n\\n \\n\\n Zheng held onto the the boy with one arm and swung his other arm at brown hair. Two hands smashed together. Brown hair\u0027s bones immediately broke but the impact also pushed Zheng back a step. He was still in Explosion state! Brown hair\u0027s strength and speed continued increasing even during the fight. Tiny scales started appearing on its skin. And two bones were protruding on his back. \\n\\n \\n\\n When Zheng broke his arm, brown hair reached his other arm toward Zheng\u0027s head. His fingers burst open and five ligaments shot out. Zheng held his place. \"Now! Zero!\" \\n\\n \\n\\n Bang! Brown hair instantly fell to the ground. One of his leg was shot into paste. His body couldn\u0027t block off the force from the Gauss sniper rifle. The ligaments didn\u0027t reach Zheng\u0027s head after all. While brown hair rolled on the ground, Zheng jumped away. A second later, the EMP rifle roared and tore the man and the ground apart. In just a few seconds, his whole body was in pieces. \\n\\n \\n\\n Zheng jumped once more to grab the bomb that was coming in the air. He threw the bomb behind then entered Destruction. \\n\\n \\n\\n \"Soru!\" Zheng charged to the end of the exhibition center in almost an instant. An explosion went off in the center. The blastwave crushed all the decorations and lights. \\n\\n \\n\\n Zheng held the boy tight in his arms and stood in place with his back toward the blastwave. The dragonshard actually activated and blocked all the fragments and stones flying at him. \\n\\n \\n\\n After the blastwave subsided, he turned around to see the exhibition center became a total wreckage with a ten meter hole in the center. Dark smoke and fire were all over the place. \\n\\n \\n\\n Zheng immediately contacted Lan. \"Scan the whole exhibition area and its surrounding. See if there\u0027s anything moving that has no mental energy.\" \\n\\n \\n\\n Lan paused for a while before she said. \"There are still a lot of vampires. None of them has any mental energy. I will send the results over to your mind.\" \\n\\n \\n\\n Zheng closed his eyes to receive the results then sighed. They couldn\u0027t lock onto brown hair with so many vampires here. There was also no way to tell if he was still alive or some part of his body ran away. \\n\\n \\n\\n \"Let\u0027s go. We will go find the movie characters.\" Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-13-chapter-10-02","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
