{"id":57724,"no":3,"title":"Vol 1 Chapter 2-1","content":"Zheng and the newbies followed the mercenaries in panic. They didn\u0027t know what to do. They came from a modern, civilized world and when they\u0027d first experienced these fantasy-esque scenes, they thought it was all just a dream. To be honest, Zheng was rather delighted. After being bored with the real world, he needed some kind of stimulation. Whether it\u0027s one night stands, getting into fights, or even drugs, they were just part of the real world. Once you wake up, you would be back at that boring world. But that wasn\u0027t what he wanted. He wanted something more exciting. He was delighted when he first learned of this world. Not only could he experience all these worlds, but he could also enhance himself with points. Because he saw so many horror movies, as long as the first few worlds belonged to movies he had seen, then he would just become stronger and never die. Once he became strong enough and nothing could kill him, he would be able to go to any world and live however he like. And if he got bored of this place, he would just go back to the real world. That was what Zheng imagined. Until the sound of those two explosions came. It shattered his fantasy. Heaven didn\u0027t exist, and this place wasn\u0027t heaven. This was hell. He was just a little bug in the eyes of God. Human lives were worth nothing more than just explosions. He... didn\u0027t want to die. The cast didn\u0027t notice those explosions. They didn\u0027t even notice two people were missing. When they reached the bottom of the stairs, a mercenary said, \"Status. Red Queen is locked onto us. She knows we\u0027re here.\" \"Who\u0027s the Red Queen?\" Alice asked One with curiosity. \"A state of the art artificial intelligence. She is the computer that controls the Hive.\" Everyone reached the bottom. Jie turned around and looked at the people panting with a smirk. \"Keep going guys. You\u0027re lucky if you live through this. To be honest, luck is already by your side. This movie has a very easy difficulty. One of the few movies where you can solve problems with guns. Once you survive this movie, you will have 1000 points to enhance yourself.\" As the group moved forward, laboratories appeared on the sides. These labs were filled with water. Corpses of researchers floated inside. Zheng also knew that these corpses were already infected. Once the central computer restarts, they would be freed from any restrains. \"This is going to slow us down. Our route to the Queen takes us straight through these labs,\" a mercenary said. \"Rain, JD, see how bad the flooding is.\" One ordered. \"Kaplan, Jie, find us an alternate route.\" Jie waved at Zheng\u0027s group and went ahead casually. After the four were gone, Spence asked, \"What happened here?\" One looked at everyone then answered, \"Five hours ago, Red Queen went homicidal. Sealed the Hive and killed everyone down here. When we realized what was happening, my team was dispatched to shut her down.\" The main characters looked puzzled. \"Why did she do it?\" Alice asked. One shook his head, \"That we don\u0027t know. But outside interference is a possibility.\" As One was talking, a figure appeared through the window of the lab closest to Matt. He looked closely, realized that was a floating corpse and jumped back. Everyone was surprised, even Zheng\u0027s group. They looked toward that lab and saw a pale female corpse. The cast quickly calmed down, but Zheng\u0027s group was scared and shivering. Perhaps you couldn\u0027t feel it in the theaters, but when you were experiencing this, especially when you knew that corpse was a zombie, this sense of fear was unimaginable. Zheng\u0027s mind blanked out. Then a hand tapped his shoulder. The slightest sound was enough to freak anyone out this moment. He immediately jumped backward a few feets before turning around to take a look. The glasses girl was standing there laughing at him. \"Hey! Why don\u0027t we introduce ourselves? Since our lives are on the same line.\" The three men agreed. Glasses Girl then said, \"My name is Zhan Lan, sounds like a boy\u0027s name right? I am an author. Before I came to this place, I always complained about the lack of inspiration. Little did I know I came to a world with limitless inspiration. This is probably retribution. Ha!\" Zheng returned with a friendly smile, \"Zheng Zha. I was a manager. Uhm. Before I came here I complained about the world being too boring and wanted some excitement... Though this place seems a little too much.\" Lan smiled and shook his hands, \"That\u0027s what I felt too!\" The middle age man smiled along with them, \"Mou Gang, I was a truck driver. Before I came here, I complained about my wife being too stingy, and that my son didn\u0027t live up to our expectations. I clicked YES when I was playing online games with my friends, then I came here.\" At last the boy said, \"Li Xiaoyi, high school student. Well, I complained about a lot of things, but this place doesn\u0027t seem bad. As long as I live, I can become a super human. According to what Jie said, you may be able to retain your powers if you manage to go back. I am tired of being bullied in school. If I can go back, I will kill those assholes!\" The boy let out a savage expression. The three adults looked at each other. They knew that this boy was probably bullied constantly in school. He was disappointed in reality. It seemed like the common ground for everyone here was being disappointed with reality. Jie and Kaplan came back. When he walked passed Lan, he suddenly tapped on her shoulder heavily. Lan let out a scream while Jie walked over to One laughing out loud. \"Sir. I found an alternate route, but it\u0027s gonna cost us time. We double back, cut through Dining Hall B, then we\u0027re right back on track.\" Kaplan said. By now, the other two mercenaries were back also. \"Sir, no go. The whole level\u0027s flooded.\" One nodded, \"Alright, we\u0027re behind schedule. So let\u0027s move it.\" Zheng\u0027s group followed them reluctantly. Fortunately, the mercenaries didn\u0027t start running again. Finally, they stopped in front of a metal door. They opened the door with a computer and cautiously moved in while holding onto their guns. This was a room with many metal cases. Anyone who watched the movie should know that inside those cases were Hunters. Once the central computer closed down, they would be a hundred times more dangerous than zombies. A mercenary looked at his computer, \"Dining Hall B. That\u0027s what it says on the map.\" One walked over to him while Matt chimed in, \"Maybe the corporation\u0027s keeping a few secrets down here.\" One looked at Matt without answering, \"JD, Rain, and Jie keep the prisoner here and secure the exit.\" At the same time, a mercenary said, \"Sir, halon levels are nonexistent in this room. I think the system malfunctioned.\" One nodded, \"JD, Rain and Jie, there may be survivors. Give me a search line, but keep it tight.\" The three nodded, but Jie sneered and took out a tobacco. He knew that there were no survivors, though there were quite a few zombies. Lan suddenly walked over to Jie and asked in a low voice, \"I want to know something, can we change the movie\u0027s plot?\" Jie nodded, \"Continue, what else do you want to ask?\" She laughed, \"Can we bomb this place? If we kill all the Hunters in this room, then we could gain a few thousand points.\" Jie laughed with her, \"You\u0027re not wrong. We could get a few thousand points for bombing this place, but I have two questions. First, do you think they will let us do it?\" He pointed to the mercenaries. \"They don\u0027t know what these are, and don\u0027t know what happens after the central computer is closed. If they see us doing something strange, they would probably shoot us first thing. Which may release the Hunters earlier. God wouldn\u0027t let you change the plot so easily, and even if you did, it will probably increase the difficulty and cause some accidents. Understand?\" \"The second question is, what do you rely on the most to survive in these movies?\" Lan paused for a bit, she touched her forehead and answered, \"Power? No, luck? It\u0027s not reliable... Probably knowing the plot?\" \"Bingo. Knowing the plot is our biggest advantage, so when I am not a hundred percent confident, I won\u0027t change anything. And whoever tries to change the plot for points, I don\u0027t mind sending him to hell.\" Zheng was listening to their conversation all along. Then he realized Jie was looking at him with a sense of pity and mockery... as though he was looking at a dead man. This made Zheng very uncomfortable. At this moment, One said, \"Okay, the rest of you come with me.\" They went through a few doors and arrived at a control room. Of course the Red Queen had already gone out of control. This room could no longer control the whole laboratory. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-1-chapter-2-1","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” The world shall change when you click YES. In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. Who is the true enemy?","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
