{"id":58060,"no":339,"title":"Vol 14: Chapter 13-1.","content":"Vol 14: Chapter 13-1.\\n\\n The surviving expedition army had returned from Klendathu. Less than five thousand made it back in this hundred thousand army. The survivors were all under Zheng’s lead. Data had shown the army created a miracle big enough to save the higher ups from their crisis. The decision to change the general was brought up again. This general who emphasized offense might continue his position. \\n\\n \\n\\n The media showed two extremes in their reporting. They mocked the inability of the military and federation on the one hand and praised the bravery of the five thousand trooper army with exaggeration on the other. How did people protect their pride in a defeat? They had to emphasize the strength and bravery their people displayed in the battle. Thus, every one of the five thousand trooper army was awarded medals and other awards. Hundreds were promoted to sergeants to lead the next army. And Zheng’s group of four were mentioned the most and given the name Miracle 4. \\n\\n \\n\\n “Good, very good.” Neos smiled coldly as he read the newspaper. There were only three people next to him. The middle age man, a girl, and Snow. \\n\\n \\n\\n He murmured. “They took the right step in some sense. The higher their exposure is, the lower our chance of doing anything to them. This is a fight of influence. When their influence in this world surpasses our position in the military, the only choice we will have left is to come to an agreement with them to exchange information.” \\n\\n \\n\\n The middle age man paused for a moment then said. “I don’t understand why do you want to annihilate team China so much? Judging from the current situation, we are not enemies where only one team can live. We can attempt to contact them before the mission is revealed. I think they have some hesitation too. They definitely know more secrets about the movie worlds than us since they are the strongest team. Secrets like the two books the last team we came in contact mentioned. Perhaps we can find out more info of this type from team China.” \\n\\n \\n\\n Neos sighed. “Don’t be naive. One reason is they are the strongest team, and the second reason is how do you think of our team?” \\n\\n \\n\\n The man paused. Neos continued calmly. “You don’t need me to say it right? I joined the team late. I have no combat ability other than my wit. The Sanjiyan bloodline only enhances calculation in the beginning stage. Telekinetic force surfaces after rank A and my combat effectiveness is extremely low before that. The other five people are split into two groups. Marnie and Rose are a couple. They are used to acting on their own. Hawfor leads the other group. They stick together merely because they are all scared of dying. So since we have the influence advantage in this battle, we have to gain more points and rewards. At the same time, I hope to obtain the position I should have in the team. We must find out team China’s members before they found out the incongruence in our team.” \\n\\n \\n\\n The girl asked. “But how are we going to find them? Going through all five thousand people? It’s near impossible if you don’t allow Snow to use scan.” \\n\\n \\n\\n Neos picked up a chocolate bar from the table. “Yes. Every event needs a turning point to continue. Judging from the hints, we will first assume this movie is a seven to nine people difficulty movie. Then we have to find the three to five people hiding. Although we can find some traces through the survivors, that alone won’t be enough. Furthermore, it requires at least a colonel rank officer to access the complete name and squad list. They can easily find out someone is investigating them if I do this. So I need a turning point.” \\n\\n \\n\\n “Turning point?” The man and girl asked. \\n\\n \\n\\n Neos gave a cold smile. “Correct. Do you know why I kept stressing we have to annihilate team China? The last reason is I need Hawfor to underestimate them. I need them to start trouble. I have been repeatedly warning them not to attack team China while reminding them that we have to annihilate team China. This will cause them probe. And that is my goal. Let them be the pawns to initiate the turning point. Make team China expose their weakness, or at least let us find out their strength. If they aren’t much more powerful than us, we won’t have to hesitate so much. If they are indeed so powerful, don’t you think Hawfor’s group is a hindrance? Our team should be more powerful without them. Haha.” \\n\\n \\n\\n “Zheng.” \\n\\n \\n\\n Zheng turned around and saw Xuan eating a red apple. He smiled and said. “You won’t have energy without meat. You eat too little. It’s always fruits and veggies. That’s not enough nutrients.” \\n\\n \\n\\n They were inside the cafeteria of the starship. It was lunch time. Zheng hadn’t come in touch with Lan, Zero, and Gando since boarding the starship two days ago. \\n\\n \\n\\n Xuan frowned as he looked at the steak and veggies on Zheng’s plate. “The color is too ugly. Anyway, I have been paying attention to if any medium rank officers accessed our records but unfortunately, no. The military higher ups had sent several people over. It seems like they will be here to award us. The probability of the other team obtaining marshal rank is near zero. The highest they can reach should be senior colonel. Which means they haven’t done anything in these two days.” \\n\\n \\n\\n Zheng said. “That’s good. What’s wrong? They wouldn’t need to investigate us if they aren’t planning to fight us.” \\n\\n \\n\\n Xuan gave him a cold smile. “It’s the exact opposite. If they aren’t planning to fight us, they will investigate us to imitate safe contact. If they don’t show any action, then I can only think of two reasons. One, they plan to avoid us because the strength we showed scared them. This probability is near zero because we haven’t showed anything in front of them. Two, they are planning to test our strength directly.” \\n\\n \\n\\n Zheng thought for a bit and said. “Aren’t your words contradicting themselves? Why would they have the confidence to test us when we are the strongest team? And if they want to beat us directly, what do they need their influence for?” \\n\\n \\n\\n Xuan nodded with a smile. “Correct. Since the events are contradicting, it led me to think of a possibility. Their team isn’t working together. They are different from us in that they are still fighting for authority of the team. If that’s the case, it makes sense they didn’t investigate us. Their brain plans to abandon part of their members or use these members to find their turning point.” \\n\\n \\n\\n “Every puzzle needs a turning point to complete. Similarly, we haven’t come in contact with them. All they know is the four of us. Our paths are parallel if they don’t access the records to investigate us. They have to cross path with us to find out our members. Either by us initiating the contact or them. If my conjectures are correct, someone from their team will probe us. It may be on you, or me, or Kampa, or WangXia. However, it is most likely you.” \\n\\n \\n\\n Zheng pointed at himself and said. “Why me? Do I look that weak?” \\n\\n \\n\\n Xuan smiled. “No. Because the three of us look stronger. You lose out on the quality of a soldier. That’s why they will likely choose you. My suggestion is kill anyone who provokes! They will naturally get anxious with the death of a member and negative point. That’s when they will expose their weakness!” \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-14-chapter-13-01","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
