{"id":58067,"no":346,"title":"Vol 14: Chapter 16-1.","content":"Vol 14: Chapter 16-1. “That’s the situation. Gando disappeared.” Xuan said calmly as he took a bite off the watermelon. Zheng returned from the starship Rose was in. On afternoon the next day, Xuan, Kampa, WangXia and Zheng agreed to meet during lunch. Xuan said this shocking news and dazed the other three. Zheng slammed the table at once as he stood up. His movement was too big and knocked the chair tumbling. The other people in the cafeteria turned to him confused. When they recognized it was Zheng, they nodded with admiration. Some even stood up to salute. Zheng smiled apologetically then said to Xuan in a low voice. “What do you mean? How can a person disappear? Are you joking with me?” Xuan ate his watermelon leisurely. “Not joking with you. He indeed disappeared. I couldn’t find him in the surveillance system when I checked it at noon today. Then I checked the squad he’s in. He hadn’t come back to his room since last night. That’s our situation. Do you have any plans on mind?” Zheng was biting his teeth with anger. He sat down and continued in the low voice. “It was you doing the analysis and talking the whole time and now you ask me if I have any plans? I remember you said you won’t test Gando with any traps, won’t let him die. What is this? He disappeared! You…” Xuan put down the watermelon rind then picked up a red apple and took a bite. “Is he dead?” Zheng was losing himself from anger and said in a rage. “How can I know if he’s dead! Uh. He’s not dead.” He realized he was wrong after he said these words because once any team member dies, everyone else would be told they lose one point. Which meant Gando disappeared but he was safe, at least for now. Xuan said calmly. “Get it? Nothing happened to him now. we just have to rescue him before he dies. This shouldn’t be difficult, right?” After Zheng calmed down from his rage, he thought for a moment. “You mean he’s currently under the control of team Africa? He should be in their starship and we just need to head over to find him? If team Africa can set up such a big trap, this won’t be simple. I also have something to ask you. Now that you mentioned it yourself, we will hear your explanation in a bit.” “Explanation?” Xuan replied just one word. He seemed unconcerned. Once Kampa and WangXia finished eating, they all came to Zheng’s room. Zheng told them his deduction, shocking Kampa and WangXia the more he went on. They stared back at Zheng dumbfounded. Zheng ended his talk with. “It’s shocking right? The plan is huge and there are traps within traps. I don’t know how the details go but Xuan’s plan is shocking.” “Not really. Hoho.” Kampa laughed. WangXia scratched his head and said. “Right. Compared to the plan, your deduction is more shocking. Haha. Never knew you are actually strong enough to guess what Xuan is thinking. Don’t you think this is inconceivable?” Zheng paused for quite a while before realizing what they meant. They basically said his intelligence shouldn’t allow him to understand Xuan’s thoughts. Once he got Xuan’s thoughts, the actual thing unimaginable is him. “Please. The question about my intelligence aside, is this what you are really thinking, Xuan? You use all of us as baits and set up a scheme surrounding the enemy’s scheme. You even want to stir up a battle within the military. But don’t we only get points for starships we destroy ourselves? Can you actually gain points like this? One careless mistake and we will sink into danger.” Xuan sat down and listened to him. When he finished, Xuan gave him a glance of praise. “Every plan comes with danger. The difference is its degree. The fact is the other team lost when they sent people to test you. They lost whether they have those rune word stones or not. I merely borrowed the influence. Believe me. There is over a 70% chance of success if you follow my plan to the end.” Zheng immediately followed. “The success rate is high but that’s betting with our whole team. Don’t you feel that everyone of us should be aware of what we are going to face next? If we are only following your arrangements passively, it feels…” Xuan said. “We have a 70% chance to survive if we follow this plan. Otherwise, if you want to find out the other team’s members then fight them in close combat, which steps into their trap, we have over 50% chance of getting wiped. If I tell everyone the plan, there’s a 100% chance of it being leaked.” “Why?” The other three all asked. Xuan smiled. “To take precautions against the chance that they have a user who can control a person’s mind after Gando gets caught and prevent them from searching through his memory. This plan can’t be revealed to most team members. Even if Gando doesn’t get controlled or memory searched, there’s a high chance of him saying all our names out. Of course, in order to protect himself, he won’t say them all at once. I think he will gradually expose our names during these three to five days. That’s why the plan can’t be revealed to anyone in the team.” Zheng sighed. So from what you said, you planned to let them capture Gando since the beginning. Is this really part of your plan? Why? I can’t think of how this plan can go on. The other team aren’t dolls that are waiting to get beat up. And from what I can see, they still have the advantage. How can you gain control over most troops? This isn’t an easy task.” Xuan didn’t say anything. He walked over to the computer and turned it on then said as he looked at the screen. “This scheme was set up by the other team that makes use of parasite bugs as an excuse and the influence of their military rank. Once people think that we are being controlled by bugs, we lost. The most malicious part is that the only thing we can do is find them out before they find us and kill them without anyone knowing it. Once they pointed us out first, we won’t be able to counterattack because that will label us as being controlled.” “So I had to set another scheme over this scheme. Zheng, your improvement is impressive but your thoughts entered the wrong path. That is why do we have to be scared? This is a double edged sword. The key to their accusation is our achievement in the battle, that we lasted seven hours and killed hundred thousands of bugs. This makes the military higher ups feel relieved but they would also suspect us. But don’t we have anything to rely upon? This achievement is our biggest support!” “When a person with hero status get doubted, who would it benefit the most if this person is a real hero? The Arachnids! If we aren’t controlled by bugs, then everyone will think that it helped the bugs when we get killed. Instead of letting these people regret after killing us, we will make them hesitate right now. This is the key to my plan.” “The military officials will arrive in three to five days. If they think they have won by that time, they will release our information to the officials. Which will make the troopers capture or isolate us. My plan also executes at that same time. Since they are using the high ranking officials, we will use the low ranks. No need to make the officials believe us. We just need the troopers to believe us. The officials are controlled by the bugs. They slander the heroes and took control over the general in order to kill off all the troopers.” “The key to give them the belief of victory is to allow them to capture Gando!” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-14-chapter-16-01","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” The world shall change when you click YES. In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. Who is the true enemy?","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
