{"id":57759,"no":38,"title":"Vol 2 Chapter 7-2","content":"Vol 2: Chapter 7-2. The five of them went toward room 15. The hall leading up was covered with a mucus-like substance. A layer of the steel underneath was corroded. Fortunately, it seemed that its acidity lessens over time. Xuan touched the secretion on the wall with a finger cautiously. “The acidity has been oxidized a lot. This is good, even if our bodies get covered in this secretion during combat, we won’t have to worry about it being lethal.” Zheng stepped on it then frowned. “But it’s too slippery. If the floor is covered with this when we fight the Queen, I’m afraid it will be difficult to keep our balance.” Xuan thought for a moment. “No, even if the battleground is covered with secretion, it is to our advantage. Then we won’t have to worry about the Queen’s blood corroding the spacecraft. Compare that to movement obstacles, I would rather have the battleground covered with this.” Zheng smiled bitterly. He looked at Xuan. “To be honest, what are the chances of us surviving this movie?” Xuan looked at him calmly. “I told you, 30%. This is considering that you will hit with the throw. If you miss your first throw, then two or three people will die within thirty seconds. Within this time frame you have another chance. If you miss again, then we will all die. Similarly, this is also our last chance. If we can’t get ahold of it, we will all die after three days. Out of all the decisions I have made in my life, this one has the lowest probability. It feels rather depressing to think of it.” Zheng was silent for a while. He patted Xuan’s shoulders and said, “Even though I don’t know how to comfort you. And though you probably don’t need anyone to comfort you. But… live on, we can all live. No matter what, I won’t die here!” “Though our chance of survival is really only 30%…” Xuan replied emotionlessly without taking a look at Zheng. Suddenly, Zero’s voice came from afar. “There’s something!” The two looked at each other, then Zheng said to Jie and Lan, “Follow me closely. Don’t fall behind or do anything else. Let’s go!” He took the lead and headed toward Zero. Zero was standing by a corner ahead of them. He waited for the four to come over silently then pointed to the front. “Can’t get pass, it’s full of this secretion.” Zheng looked forward and saw the hall behind Zero was blocked with a very thick layer of secretion. It looked like the inside of an organism. He carefully sliced the secretion. By sense of touch, this layer wasn’t tough. Contrarily, he could easily slice through it and it’s only a few centimeters thick. So Zheng easily cut through the layer but the area behind it gave him a fright. A thick layer of secretion covered everywhere, the wall, the ground, and the ceiling. If where they just came from still belonged to the spacecraft, then from this point on, it was the real Alien nest. It felt like walking on flesh, and the walls felt like a living organism. Xuan suddenly said, “Zero, the lights are dim here. You have the best vision, take a look at the things on that side, are those Alien eggs?” Zero focused his eyes and looked at it carefully. After quite a while he shook his head. “I can’t see clearly. The lights are covered with this disgusting secretion. It’s too dim here.” Xuan nodded then turned to Zheng. “These Alien eggs won’t attack anything outside twenty meters. So we can safely approach it. Estimating by the distance we have passed, this should be around room 3. Moving onward is warehouse 1 and 2. The Queen is probably there.” Zheng nodded then said to the people behind him. “You guys stay here. I will go take a look at whether or not those are eggs… Zero, if something appears behind me, please take care of it. I trust your aim.” Zero nodded silently. Zheng walked inside the nest with a laugh. Stepping in, it felt soft, just like stepping on flesh. This feeling gave him goose bumps. Due to the lack of adequate lighting, he could only see things up to ten meters. It took him almost a minute to cautiously approach the egg-like things. When he reached ten meters of them, he finally recognized these oval shaped eggs. “Yes, these are the Alien eggs!” Zheng shouted without turning his head. He suddenly saw the eggs were slowly opening up. In this movies, this signified that the larvae were coming out. There were several dozens of eggs here, if all of them releases a larva, they would likely hide inside the layer of secretion and attack the people. Once someone became a host, he would become an Alien within several hours. Without thinking, Zheng raised his semi-automatic rifle and started shooting at the eggs. They were easily shot into pieces. Their shells weren’t too tough, but even so, a few larvae came out. These larvae jumped at an incredible speed. They closed up on Zheng within a few jumps. At the same time, gunshots came from behind. The larvae were shot into pieces midair. Zheng turned around and saw Zero holding a submachine gun. Zheng smiled at him and Zero, who had been acting cold this whole time, smiled back. Xuan ran over calmly. He crouched beside the egg shells and studied carefully. He stood up after a while. “The Queen will enter a feeble state after laying eggs. The shells of these eggs are soft. They’re different from the toughness that I remember… I think the Queen laid her eggs not long ago.” Zheng took a deep breath. “Since we are at this point already, we will have to do everything to kill that big thing… let’s go! Kill that last Alien and go back to God’s place alive!” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-2-chapter-7-2","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” The world shall change when you click YES. In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. Who is the true enemy?","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
