{"id":58173,"no":452,"title":"Vol 16 Chapter 19-2","content":"The riders were startled. Not one of the hundreds of them caught Zheng’s movement. His speed was simply too fast and secondly, everyone’s eyes were looking at Gimli until the moment the red sword was placed next to their leader’s neck. No one dared to move at this moment.\n Aragorn and Legolas were also appalled. It wouldn’t be as serious a problem if it were someone else holding the sword. They knew how strong Zheng was, someone who took down hundreds of Uruks. The riders were well trained but their numbers here weren’t enough for him to kill.\n Aragorn immediately stepped in front of Zheng. “This is a misunderstanding… Riders of Rohan, I am Aragorn, son of Arathorn. This is Gimli, son of Glóin, and Legolas, from the Woodland realm. These are friends of Gandalf the Grey and brave warriors of man. We are friends of Rohan and of Théoden, your king. There is no need to point your spears at us.”\n The leader didn’t panic. He waited for Zheng to move the sword away then said. “Théoden no longer recognizes friend from foe. Not even his own kin. Saruman the White has gained control of him.” The leader removed his helm, revealing a tired face.\n The riders withdrew their spears.\n The leader continued. “Saruman has poisoned the mind of the king and claimed lordship over this land. My company are those loyal to Rohan. And for that, we are banished. The White Wizard is cunning. He walks here and there they say, as an old man, hooded and cloaked. And everywhere his spies slip past our nets.”\n Aragorn let out a sigh of relief. He reapplied the riders mistook them for spies, hence the hostility. He said. “We are no spies. We track a band of Uruk-hai westward across the plains. They have taken two of our friends captive.”\n The leader pondered. “We encountered the Uruk-hai during the night. To our surprise, it looked as though a terrifying thing was chasing after them. They continued running after seeing us. We did notice a woman and a Hobbit among them.”\n Zheng said. “That’s the right group then. The woman and Hobbit are our comrades. Did you see any other humans?”\n The leader shook his head. “No other man. We did not find any woman or Hobbit after the battle. They might have ran or they might have died to our horses. We piled the carcasses and burned them.” He pointed to smoke in the distance, about a few kilometers away on a low ground.\n Aragorn met eyes with the players. No one said a word. The movie characters were worried but team China knew team Africa had entered the woods according to the plot.\n The leader looked over the nine of them then said something to his adjutant. Several riders then brought over seven horses.\n “May these horses bear you to better fortune than the former masters. Look for your friends, but do not trust the hope. It has forsaken these lands.” He put his helm back on then mounted on his horse. He headed through the riders.\n The riders departed as fast as they had came. A few minutes later and they were far away, leaving the group of nine and seven horses in the field. Oh, and there was the skeleton horse carrying a frozen statue.\n Zheng and Aragorn nodded to each other. They each mounted on a horse. Lan and YinKong mounted on one. Gimli and Legolas mounted one. Then the group rode toward the burning carcasses.\n They arrived at the smoking area before long. Several spears stood on the ground, each had a head of Uruk at its end. In the center of the area was a two meter tall pile of dead bodies. The number of Uruks was approximately a hundred. There was no hope of finding any survivor among these bodies. They had to search the weapons and items for traces.\n Some time passed, Gimli pulled a charred belt from the weapon pile. He cried. “It\u0027s one of their little belts. They may have been…”\n “No!” Aragorn did not look at the belt. He looked to the side and some tracks. “A Hobbit lay here. He crawled. And a woman crawled over here. Look here, traces of shoes that belonged to man.”\n While Aragorn was searching for the traces, team China examined the wounds on the Uruks since they knew the captives were fine.\n Zheng looked at a cut off head and said. “Cut by a dull anti-cavalry saber. The charging speed from a horse gives it enough destructive force without a sharp blade. Yet, the head doesn’t look surprised. So it wasn’t killed by the riders charging at the band. This wound has trace of battle Qi.”\n He turned around to face the other five members. “I saw Aragorn use his battle Qi. The battle Qi transfers to his sword and increases its toughness. It can even block my light blade. Which means after the riders first charged at the Uruks, they continued to fight them in a melee battle. It had to be battle Qi that allowed him to cut such a clean wound using a dull saber without the momentum from a charge… Why are you looking at me like that?”\n Aside from Xuan, everyone else seemed stunned. It was as though he was saying bizarre things.\n “Well.” ChengXiao said in a serious tone. “It would be normal if Aragorn was the one saying these things. But bro, aren’t you roleplaying too seriously? Do you really believe you are an experienced mercenary in this world? You were an office worker.”\n Zheng scratched his head. “We have been fighting with our lives everyday aside from the days in God’s dimension. I can’t not learn these things even if I try to. The consequence from using Tiger’s Soul taught me how to control my strength when using a blade and how slashes function. Battle Qi is also similar to Qi so… I seemed to have become an expert without realizing it. Haha.”\n Xuan ignored his laughter. He continued examining the burned bodies and intact heads. “Around 70 to 80 percent of the riders can use battle Qi. The rest might be new recruits. They have excellent capacities. And with battle Qi, these riders can rival Uruks two to three times their number.”\n “Right, I also thought about it. If we have a thousand riders and fifty elves that can use Explosive Shot, we won’t have to fear the other two teams. Though these elven archers are rare. They also won’t participate in the war. The other thing is the Nemesis…” Zheng laughed.\n Xuan continued after him. “Get it. The Nemesis can retain most of the person’s prior abilities and unlock the first to second stage. It also enhances a person’s body to ten folds his stats. If we can transform the Uruk leaders that can use Explosive Shot to Nemesis, twenty of them would be enough to deter the other two teams. Is this what you were going to say?”\n Zheng nodded. “Right, right. No matter how strong they are individually, as a team, or with their influence, a thousand of these riders and twenty of those Nemesis give us the power to go wherever we want. There’s no need to worry about team East America or team Celestial.”\n “Oh?” Xuan sneered. “What about the final Ringwraith? Are you certain the Explosive Shot can hit it? What if Sauron is more powerful than the Balrog? Can you kill it with this group? And… what if there’s someone as strong as your clone in team Celestial or team East America? You are too optimistic. I don’t know what kind of feeling this is, but I feel that I might die in this battle.”\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-16-chapter-19-02","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \n The world shall change when you click YES. \n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \n Who is the true enemy?\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
