{"id":58208,"no":487,"title":"Vol 17 Chapter 1-2","content":"That was the start of the plan… These words struck a blow to their confidence. So Zheng thought. The rest of the team members also had the same thought. All the calculations that happened up to this point were merely the beginning of the scheme. No one else on the platform here would come up with such schemes.\\n\\n “Following that, our team split into two groups. One of the reasons is to make HaoTian wear the device after my death. He will gain control of the Nemesis but I will gain control of him at the same time. His threat will only be disarmed under such condition. Furthermore, my death will puzzle Adam’s decision making… Then I assigned Zero… And I left Rohan under the aid of Legolas…”\\n\\n Xuan gave a detailed account of the battle in the Lord of the Rings. How he planned using the blessing and achieved victory with his death. Afterward, he led their group to force team Celestial to a compromise. Each step of his plan was closely linked to Adam’s plan. Zheng was sweating when he learned there was someone stronger than Luo YingLong in team Celestial.\\n\\n “Correct. The limit of our team’s strength is approximately half of the full team Celestial. Based on this fact, team Celestial lives up to being the second strongest team in the realm, with team Devil being the strongest. Our rank hovers between third to fifth.” Xuan said with certainty.\\n\\n “Is that so?” Zheng smiled bitterly. He patted Xuan’s shoulder and said loudly. “Anyway. It was all thanks to you this time. We might really have gotten wiped, not to mention the results we achieved… But damn you. Did you think we wouldn’t worry about you? You are not a machine. You are our comrade. A comrade that we can depend our lives on and fight by our sides!”\\n\\n “Comrade…” Xuan lowered his head slightly. He pushed his glasses and said. “You can only be comrades if you survive. The dead can’t talk.”\\n\\n “Haha. Who said the dead can’t talk? Weren’t you talking before?” Zheng laughed and patted his shoulder again.\\n\\n Xuan rubbed his shoulder. He couldn’t feel the pain but he seemingly heard a cracking sound coming from his shoulder blade. He didn’t feel this would accomplish anything but he suspected Zheng was getting his revenge, using the act of excitement to hit him.\\n\\n “As to killing HaoTian. The reason I killed him as soon as we return instead of waiting for the heal was because I couldn’t be sure if God would heal the part of his mind that was controlled. The only choice was to kill him, even though he obtained a sizable amount of rewards and points.” Xuan said.\\n\\n Zheng finally remembered about the rewards and said with surprise. “Oh yea. Rewards and points. Our profits are superb, more than any other movie we have been through. I also brought back the Nightmare.”\\n\\n The ladies noticed his mount way earlier. The skeleton horse was rather scary to them. Except Kampa’s woman showing interest as she uttered words like cool. She stared at the Nightmare with a pair of glittering eyes., The other women’s reactions were rather normal.\\n\\n Zheng frowned when he tried to recall what they should have earned in the Lord of the Ring. “It doesn’t add up. We lost one point from your death. Four newbies got killed afterward. We were down three points if we don’t count HaoTian. I killed one member from team Celestial. Zero killed one. Shouldn’t we be at negative 6000 points with just this? I earned some points but Kampa and the others…”\\n\\n Xuan shook his head and said in a mockery. “Have you forgotten the mission reward? Each movie character that survived is 1000 points, and minus 1000 for each character that died. In the end, we lost three Hobbits, Theoden, Denethor, and one of his son. These are all noted as mission characters, which amount to 5000 points. However, we have more surviving characters in comparison. Aragorn, Legolas, Gimli, one Hobbit, Gandalf, Boromir, Eomer. So that’s 2000 points we obtained. Each of the battles at Helm’s Deep, Gondor, Mordor is 3000 points. The base reward for any movie is 1000 points. The main missions by themselves are 12000 points. You killed a Balrog that’s worth 8000 points and a rank A reward. An unlocked member worth 7000 points and a rank B reward. Two Ringwraiths totalling 10000 points and a rank B reward, two rank C rewards. You should end with 31000 points after deducting the 6000 points. And one rank A reward, two rank B rewards, two rank C rewards.”\\n\\n Zheng was shaking as he listened. He was excited and anxious. It was like a poor person suddenly hit the lottery. Zheng wasn’t exactly so poor but he had to carefully consider every point he spent. All the exchanges involving ranked rewards needed to be discussed with the team in case they missed something for the next movie. The sudden wealth struck his mind. He spaced out for some time before walking up to God.\\n\\n “Man, happiness came all too sudden. Do I really have 30000 points? And so many ranked rewards…” Zheng muttered. He had seemingly lost himself and laughed like an autistic person.\\n\\n Xuan ignored him and went under God. He began checking his own rewards and points.\\n\\n Zheng’s conscious returned. Basing on Xuan’s calculation, even those who didn’t really do anything would receive 6000 points. That by itself was a plenty for a regular movie. Everyone had enough to exchange for a lot. The amount of ranked rewards they had was not bad either. Zheng earned a lot and so did the rest of the team.\\n\\n YinKong walked out from underneath God. Her eyes were glittering with a hint of excitement. It was such a rare sight for someone normally so cold. She took several deep breaths then said. “I have two rank B rewards…”\u2028\u2028Zheng said with a smile. “Yeah, you killed a level 8 Ringwraith. Your rewards are of course plentiful.”\\n\\n “And two rank A rewards.” YinKong finished. She looked straight into Zheng.\\n\\n Zheng froze in a shock. Everyone else froze. They looked at YinKong in a sense of confusion. ChengXiao roared. “The joke’s gone too far! Do you really get bonus rewards and points for having huge cups? It also came with interest… insanely high interest. Two As for two Bs.” He looked struggling from resignation.\\n\\n YinKong kicked the ground and flashed over to ChengXiao. Her elbow struck his throat. ChengXiao immediately squatted down and coughed, unable to utter another word.\\n\\n Xuan turned around. “That means Sauron has been killed. As I speculated, his life dwelled in the ring. When we brought the ring back to God’s Dimension, Sauron’s entrance was illegal. He was a movie character but we did not exchange for the right to bring him back. According to the rules, God should have erased him. And the rewards from the kill landed onto YinKong.”\\n\\n “Haha…” Zheng’s laughter was tearing his mouth. If it wasn’t for Lori being by the side, he would have grabbed YinKong and pinned in circles. A rank B reward used to make two teams fight with their lives and now there were two rank A rewards…\\n\\n The surprise wasn’t over. YinKong pulled out a ring glowing with a dark light. The ring itself didn’t look unique. But all ten members knew this was the One Ring worn on the broken arm.\\n\\n YinKong nodded lightly. “Its function is…”\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-17-chapter-1-02","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
