{"id":58229,"no":508,"title":"Vol 17 Chapter 11-1","content":"The rolling mushroom cloud rose hundreds of meters high in an instant. The orange cloud shrunk inward abruptly. Its color turned white in the next instant. It radiated light and heat like a mini sun. The white fireball exploded with might greater than before. A gigantic white mushroom cloud rose up the sky again.\\n\\n “Should I call this beautiful or terrifying?” Zheng took off the sunglasses. He noticed his body was able to withstand the bright white light without the sunglasses. It was a bit glaring but bearable. He looked straight into the white flame with his bare eyes, dazzled by the rapidly changing forms of the cloud.\\n\\n Zheng was having a bad feeling from what Xuan had just said. Based on Xuan’s personality, he wouldn’t do or say anything needless. If Xuan wasn’t referring to something then there was a new scheme targeting him.\\n\\n (It makes me worry no matter how I see this. Would be good if HongLu’s here. He could at least deduce what Xuan is thinking… How is it going at their side? Can the three of them safely lure away the Decepticons? Can HongLu’s plan succeed? Has Xuan really not noticed it?) Zheng pondered but his thoughts became a mess and he had to stop thinking. He put his attention toward the unique scene in front. Explosion from the most powerful nuclear bombs was a unique sight in some sense.\\n\\n Two more intercontinental nuclear missiles struck the ruin that was St. Louis within the next hour. That endless mushroom cloud, the burning flame and shockwaves turned this place into a white colored hell. The brightness was not that far away from that of the sun. They couldn’t see through this light into the fortress inside. The three hydrogen bombs were indeed extremely powerful. Stones brought up by the gales flew with the force of bullets. The team had to hide behind objects and wait for the gales to weaken.\\n\\n The gales died down as time as time passed. The incoming wind still carried an intense heatwave. Once the heatwave also died down, Lan said in a low voice. “Something’s off, Zheng. A lot of American troops and tanks are marching from the west toward the center of explosion. Were these troops gathered there the whole time?”\\n\\n “An army?” Zheng was surprised. He looked to Xuan. “Is it your plan to let the army attack the fortress once the nuclear strikes are over? It’s a good thing for us whether they could obtain the AllSpark or not. It takes less effort to seize the AllSpark from the military or they could expend the forces of the Decepticons and help us.”\\n\\n Xuan shook his head. “First, this isn’t my plan. Second, a thousand normal robots can wipe off this army. They won’t kill off a large number of robots as you imagined. So…”\\n\\n “So?”\\n\\n On the other side of St. Louis, the other group was watching the American army march toward the fortress. The troops wore biohazard suits. The tanks drove in the center of the army. There were also military trucks and motorbikes. The American army suffered huge losses in this disaster but their old stockpile of military vehicles could still arm a decent army.\\n\\n “An army of several hundred thousands attacking one area appear mighty but the power of their weapons… especially without air support could only attract the attention of most of the robots. Relying on them to take out robots in a large quantity isn’t going to happen.” HongLu wasn’t looking well.\\n\\n Kampa nodded. “The American military is powerful but that is built on the basis of the quality of their soldiers and top of the line equipment. When the equipment declined by so many generations, their strength is greatly affected. Human wave attacks are useless against robots.”\\n\\n HongLu nodded. “Right. The American army alone isn’t a safe bet. We should follow them into the fortress. We can lure a few more robots away while they battled the robots.” HongLu got up and was going to walk out from their hiding place.\\n\\n YinKong suddenly grabbed a hold of him. “No. We can’t leave here until after the American army entered the fortress.”\\n\\n HongLu was surprised. “Oh? Why? What’s wrong with sneaking behind them?”\\n\\n “Xuan said to me when he handed me the CD.” YinKong said calmly. “If you took the CD away and set up the American army to march into the fortress, I will have to stop you from following them until the whole army entered the fortress.”\\n\\n HongLu\u0027s mind was lost for a moment and asked. “Why didn\u0027t you tell me what Xuan said beforehand?”\\n\\n YinKong gave him a good look. “I also didn’t tell Xuan your plan. I said I won’t help either of you.”\\n\\n HongLu had no energy to listen to what she say anymore. He crouched and grabbed the hair in front of his forehead as he pondered.\\n\\n (That means he knew I would scheme the American army since the very beginning? Where did he get such confidence? And why did he have YinKong stop me from following the army? If I am in the same situation, if I knew he would set up the American army to attack the fortress after three hydrogen bombs struck the place, a lot of the normal robots have been destroyed by this point, the only thing I would do is…) HongLu’s expression changed.\\n\\n He raised his head at once and looked to the sky. Nothing. Yet, he still searched in panic. After quite some time, he dropped to the floor, looking defeated. “Sigh. It isn’t here yet but by the time the American army reach the fortress, the final strike will come. Damn it. I helped him complete the final step. Couldn’t he smell the scent of blood on his hands from wiping off several hundred thousand people at once?”\\n\\n Kampa and YinKong seemed confused. Kampa asked. “What happened? Isn’t your plan going well? Even though the army’s strength declined but they could still hold off a lot of robots. Is there a flaw in the plan?”\\n\\n HongLu said, a little depressed. “The biggest flaw is their strength is too low. They could hold the robots only for a limited time and couldn’t destroy that many robots. If anything goes wrong, the other group will get sandwiched by robots from two sides. This isn’t allowed to happen. Both Xuan and I speculated the Decepticons have a barrier like technology. Can the hydrogen bombs break the barrier? Can the bombs break the core defense after tearing apart the steel fortress? Nuclear bombs are powerful but even humans have created shelters, so not to mention the aliens with more advanced technologies. The only way to actually kill off the robots in large number is to strike them when they opened up their defense system to fight the human army.”\\n\\n Kampa and YinKong’s expressions also changed. Even someone like YinKong seemed rather shocked. However, they felt this was the kind of means Xuan would use. Apathetic. And only people like Xuan would come up with such plans.\\n\\n The American army marched into the ruin that was St. Louis. HongLu’s group could hear the explosions and gunfire coming from the city center. The battle became increasingly intense and continued for ten minutes. Suddenly, another intercontinental nuclear missile crossed the sky and flew toward the center of the battlefield as though to prove what HongLu just said. Its flight merely took a few minutes. The missile did not explode above the city like the three before. It drove right into the ground and then a deafening explosion followed.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-17-chapter-11-01","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
