{"id":58260,"no":539,"title":"Vol 18 Chapter 9-2","content":"Team China dropped to only seven members all of a sudden. The rest of the members vanished, including the memories of them. Zheng was the only person to still remember their names. Despair clouded Zheng. He never once felt so close to the border of despair. The situation had no relation to his combat strength at all. The despair came from his inability to see anything, to touch anything. All he could do was witness his team disappearing one by one while he didn’t even come to touch Freddy. He was defeated by helplessness. Xuan was Zheng’s biggest support. He didn’t know why Xuan had been quiet throughout the movie, which differed from his person in the previous movies. In this case, Xuan must be preparing for something. He would not do anything without a value… However, that relied on a premise… The other five members turned to Xuan after Zheng spoke. They had equal amount of faith in him. LiuYu though seemed curious at what someone who rarely spoke could do to bring the team back. So he asked ChengXiao. Xuan was as calm as always, as though nothing mattered to him. He shook his head and said, “There is no solution to this movie… at least for the moment. There’s nothing I can help you.” “Lies!” Zheng lifted him by the collar and shouted. “You are lying. This movie could be too difficult for us but it’s not the same to you! No! You shouldn’t even feel the difficulty! How could you have admitted defeat?” Xuan patted his collar, picked up a book and began to read. He replied, “We can only wait… Quietly wait.” Wait? Just keep waiting quietly? Zheng’s hand moved but he suppressed what he was going to do. He sat down on the floor and pinched the hair in front of his forehead. The other five members didn’t know what happened between the two of them. After a while of thinking and coming up with no idea, they all sat down. The room fell into silence. (No. I still can’t be certain. The possibility is higher than 60% but if I am wrong, his life… His personality and actions are also similar to how he has always been. Am I just too paranoid?) (The second point is, judging by all the information, Freddy has only appeared in front of me. I am the only person who have seen him. Perhaps some other members saw him but they all disappeared. I am the only one who have seen him and am still here. He had to put me to sleep in order to avoid meeting me directly. But why?) Zheng had entered the third stage. His simulation had reached a fairly high degree compared to before. He couldn’t perfectly simulate HongLu’s thinking process but it was enough for him to solve a lot of questions. HongLu was way above them after all. (If Freddy’s main attacks aren’t physical and rely on breaking through a person’s mental defense, then dragging him into the despair dream, does that mean everything that has happened so far is for the purpose of breaking my defense?) Zheng frowned. This was the first time he came up with this possibility. He might reach something by following this train of thoughts. (If that is the case, could it be possible… this is all my dream? Everyone aside from me is fake. Then it can explain their disappearances and vanishing memories. The fake members are the origin of my nightmare. All I have to do to stop the origin is to eliminate them and then wake up. But this is too risky. What if they aren’t fake? My mental defense will collapse at the instant I attack them. I will hesitate and feel unease from attacking even if they are fake. These feelings will open up a gap in my heart. Furthermore, my mental state has been unstable. Pressing myself to kill my team will break my defense either way.) “Damn it! I can’t get rid of the origin even knowing what it is. Then there is the question of how to wake up after getting rid of the origin.” Zheng pulled a few hair from irritation. His mind was in a mess. The situation was more muddled than his mind. He was pushed up against a wall. Just then, LiuYu carefully came up to him and said, “Hey, Zheng. Are we really in a dream?” Zheng looked at him with surprise and nodded. “Yes. We are indeed in a dream. I can’t be 100% sure but judging from what has been happening, it should be the case.” LiuYu followed, “If this is a dream, then we should be able to imagine our strength. A disabled boy could stand up in his dream in the third movie. He could even become a wizard. Why can’t our imaginations come true in this dream? Maybe we are still in the real world.” (No! I get it!) Zheng was thrilled. He Patted LiuYu on the shoulder then twirled his hair. (It’s our belief. Or perhaps the habit of our consciousness. This dream world is too real. So real that it’s like the Matrix. We can’t break through the confinement of our imagination despite being in a dream. That’s due to the habit of our consciousness. If my analysis is correct, my mind is the foundation of this dream. Then there’s one thing unique in this world!) Zheng scanned over the people in the room then moved his eyes away. (Which means the three newbies did die in front of me. The rest of the members disappeared. The newbies are complete strangers to me. I know nothing of their past, of the gaps in their hearts. That’s the reason Freddy selected me. I have the biggest gaps in my mental defense. I lust for everyone to return to the real world, which becomes a weak spot at this point. And I know of the past of the members. I get what HongLu was trying to say. We have to wait for the key to solve the puzzle. And then once it’s confirmed, the last step is to eliminate the nightmare.) Zheng took a deep breath then stood up. He walked toward the stairs and said, “There’s no point staying in the living room since people are still disappearing. I will go sleep in a bedroom. Call me if something happens. You can also find a room to sleep or continue to stay in the living room.” Xuan headed up the stairs after Zheng was gone. Five people were left in the living room. LiuYu asked, “What happened to Zheng? Is it something that I said?” Everyone looked to the stairs clueless. No one answered his question. A few seconds later, YinKong also got up and walked up stair. The four people left got goosebumps as they continued to stare. ChengXiao forced an awkward laugher and said, “We… should continue to stay here. Those three are psychopaths. I don’t want to be in the second floor with them. How about we stay here?” The rest nodded, especially LiuYu. He was scared of being alone the most. He was the weakest person here since he was a newbie. Zheng pulled a string of hair as he walked up the stairs. “If my deduction holds, I will save you all! That is our only chance of surviving.” Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-18-chapter-9-02","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” The world shall change when you click YES. In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. Who is the true enemy?","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
