{"id":58270,"no":549,"title":"Vol 18 Chapter 12-5","content":"While WangXia, TengYi and LiuYu were in danger, a new circumstance developed between YinKong and ZhuiKong.\\n\\n The despair dream and the safe dream were merely separated by a thought. If one could see through the illusions that shrouded their mind, then they could jump out of the despair dream or gain control of it, turning Freddy into their marionette.\\n\\n However, someone who could achieve this feat would have ascended beyond human. For humans, the other way to escape from the despair dream was to see through their inner self and overcome the heart’s devil. If they failed, then their minds would sink into the dream for eternity, until their physical bodies die off.\\n\\n YinKong was trapped in her heart’s devil. They were the person and the event that she could never let go. The event in which ZhuiKong killed their childhood friends. No matter what the cause was, no matter what the truth was, it had become a fact. So what if he had a reason? Those friends could never return to life.\\n\\n YinKong fought ZhuiKong while troubled by her feelings. Her admiration had turned into hatred. Yet, within the hatred was a hint of hesitation. This was a pointless fight given her condition. Furthermore, ZhuiKong was way stronger than her to begin with. Wounds filled her body. Her mind would forever be trapped in this place if the fight continued.\\n\\n YinKong slashed the sword at ZhuiKong. The sword hit a thin piece of wire. Sparks flew from the impact. While the hit lost the majority of the force, ZhuiKong flicked his finger at the side of the blade. A huge force struck YinKong’s hands. Infinitesimal control could transfer all the force in a hit without any loss in the process and could direct the exerted force.\\n\\n YinKong wasn’t weak and she also reached the second stage. When the force struck her hands, she slid the sword into the ground to disperse it. Even then, her hands felt sour and numb.\\n\\n ZhuiKong did not speak again since they clashed weapons. He maintained a warmhearted smile on the face, yet his eyes felt cold as ice. It made anyone who looked into his eyes shiver. His attacks were not as sharp as the real person despite being able to block off YinKong’s attacks at ease. The real ZhuiKong would have disarmed YinKong by now.\\n\\n “What a fool for an assassin to use a sword like a warrior. Especially a two handed sword from the Medieval age. Are you still the genius that I know of? The person who was way stronger than everyone since you were a child?” ZhuiKong flicked the sword away.\\n\\n YinKong didn’t know if it was an illusion that ZhuiKong seemed to have gotten stronger. His strength was growing with each passing second. He also spoke more than before.\\n\\n “My dear little cousin. Do you know you have attracted all my attention since we were small? You are the stars to me… You shine with the brilliance of a comet. You are my little apple… I protect and wait for you to grow, then pick you off. You are a once in a millennium genius that descended on the clan. Your strength exceeded everyone’s imagination. You have a marvelous babyface and big breasts. Just thinking about obtaining you gets me madly excited.” He pointed at his crouch which had stood up. YinKong slashed the sword at him.\\n\\n “Haha.” ZhuiKong leaped away from the invisible sword by just a few centimeters. The moment he landed back on the ground, YinKong lost track of him. ZhuiKong was standing behind her the next instant. Two fingers lightly caressed her throat.\\n\\n “But I was wrong. You are not the once in a millennium genius. You can\u0027t even beat me. You abandoned the skills of an assassin. You abandoned the way of an assassin. You always hope of obtaining friends and comrades. But assassins don’t need comrades. They are merely an obstacle to your path of becoming strong. No wonder your strength has become feeble. You have become a rotten apple after you abandoned the way of assassin. Let me kill you, and then your friends so you will meet in hell. Haha…”\\n\\n The hand holding YinKong’s neck gradually transformed into a glove with blades. Its fingers gripped her neck and the blades sliced into her.\\n\\n Tears had stopped coming out. Her eyes looked out of focus like when a person entered the unlocked mode. Yet, a closer look would discover the difference. These eyes… looked identical to the first time Zheng entered the fourth stage. There were no impurities. The only thing in these eyes was pure killing intent, pure than anything else in the world.\\n\\n “No… The way of an assassin… is merely killing the target. Whether the weapons are blades, guns, bombs, or fingers… as long as you can kill the target. That’s an assassin. The way of an assassin does not exist.\\n\\n “Comrades are only obstacles? Without them, I would have died long ago. Only the weak will think of comrades as obstacles… The more fragile the person, the more they feared feelings.\\n\\n “And…”\\n\\n YinKong’s hands turned into a flurry. She moved in the same unseenable speed as ZhuiKong. The next moment, she was standing with a human head in her hand. It was ZhuiKong’s head.\\n\\n “Don’t provoke me with what happened to my friends. Even though I once killed two of my friends, I paid the price with the me that I am. You will also pay the price for awakening those who had been dead! So… pay with your life!”\\n\\n WangXia, TengYi and LiuYu roared as the wrecking ball flew toward them. They were running at their full speed already while carrying LiuYu. A wind pressure struck their backs and they leaped forward. The ball smashed at the land behind them, missing them by just one meter. It left a two meter crater on the ground. A direct hit would have merged them with the ground.\\n\\n The three people barely got on their feet when the ball was set in motion again. It was impossible to dodge this one. WangXia channeled all the remaining demon energy to his arm. He planned to throw the other two away but he probably couldn’t run.\\n\\n As the ball reached its height, a figure shot out straight from the the house. In the second that the ball was falling, it crossed over a hundred meters and blocked in front of the three people.\\n\\n By the time WangXia, TengYi and LiuYu registered what just happened, the ball had split into halves. The figure ran along the chain toward the truck. Its speed was visible to the bare eyes yet it crossed distance faster than anything else. The figure dashed into the cab and the window glass exploded after the fact.\\n\\n The Freddy inside this truck died before he could react. The figure then charged at the two other trucks. Without anyone controlling the first truck, it continued driving straight ahead at the three people. They finally woke up and ran toward the house, escaping the truck by a fraction. The truck collided with a wall of the house, stirring up a layer of dust.\\n\\n WangXia, TengYi and LiuYu leaned against another wall and breathed heavily. They felt lucky and puzzled after the escape. That figure seemed ever so familiar to them. Yet, it didn’t look like Zheng. It must be a member of the team. But who else in this team possessed such incredible close combat strength?\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-18-chapter-12-05","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
