{"id":58274,"no":553,"title":"Vol 18 Chapter 12-9","content":"ChengXiao stopped his feet in the center of the street. He looked out to Xuan who was barely visible from the distance.\n ChengXiao yelled to Heng, \"If you insist up to this point, I have no other choice but to blieve in you. We are comrades… Heng, let us place a bet. We will stand here and he won\u0027t hit us with this shot. You won\u0027t be able to shoot if I am dodging while carrying you. So I will stay here. The moment he fires, I will throw you up. Then you shoot that whatever four arrow shot at him. If he hits us, we are dead. He your shot fails, we are dead. Damn it. I am a fucking retard to take this bet with you… Heng! My life is in your hand!\"\n Heng tightened his grip of the silver bow without saying a word in reply. He stared at the figure in the distance.\n Two hundred meters away, Xuan was walking toward them. The three arrow Explosive Shot did absolutely no damage to him, not even a scratch. The Lambda Driver possessed a strict limitation. However, its power was nearly flawless in both offense and defense. This fake Xuan was like a symbol of invincibility.\n Heng and ChengXiao both took a deep breath. They watched as Xuan raised his pistol. ChengXiao threw Heng up at once. At the same time, a shockwave blasted toward them and passed by just two meters from their side. The wind generated by the shockwave sent ChengXiao flying for over ten meters. He knocked his head on the ground. Luckily, this wind did not affect Heng who was in the air as much. He entered that absolute focus state again. His mind and energy were focused on the four arrows in his fingers. Everything in his eyes vanished, only Xuan remained.\n (I have to hit. I have to hit… I have to hit! There are a lot of things I have to do. I have to repay her, revive her, and our future… I have to hit!)\n The four arrows finally left the bow. They collided with each other consecutively until one arrow remained. The arrow seemed to have lost its traces in the visible world. It felt as though time had stopped, and the world was frozen. Only the arrow continued flying toward Xuan\u0027s chest. Bang! The arrow collided with the uniquely colored barrier.\n Heng and ChengXiao\u0027s gazes were fixed on the arrow. Everything happened in just an instant. The arrow forced itself through the barrier. Once centimeter. Two centimeter. The two felt that they could see the whole process as the arrow pierced through the barrier and into Xuan\u0027s chest. It carried Xuan flying and smashed into a building.\n ChengXiao immediately ran toward where Heng was falling down and caught him before he hit the ground. He cried excitedly, \"Nice, you got him. We finally killed him! You broke the power of faith!\"\n Heng panted heavily and said in a hurried tone, \"Run! That shot was probably very weak after it broke through the barrier. I don\u0027t even know if it could damage him. I think the shot is only going to delay him for a bit. Let\u0027s run. We have to meet up with the others first. Somehow, I have a sense that they could defeat this Xuan.\"\n ChengXiao put Heng on his back and ran.\n Behind them, the building that Xuan collided into collapsed. Nothing moved for a while. It really appeared that Xuan had been killed.\n A long time passed after ChengXiao and Heng left. The collapsed building exploded. Xuan stood in the center of the explosion. His face was pale and an arrow was half way into his chest. Yet, the shot didn\u0027t kill him after all as the barrier blocked off most of the force.\n Xuan pulled the arrow off his chest and threw it onto the ground without glancing at it. +4 enchanted arrows had a corrosive property. So the flesh near the wound began to corrode similar to being poured sulfuric acid. His face showed no sign feeling just like the real Xuan. Then he ran after ChengXiao and Heng with the two Gauss pistols in hand.\n WangXia, TengYi, and LiuYu were having an unusually easy time at the moment. YinKong\u0027s strength suddenly grew so much that she was slaughtering Freddy like pigs. Freddy had been killed over ten times outside the house. Unpiloted trucks and tanks were parked outside.\n WangXia asked curiously, \"You are strong. I never knew you are so strong even though we trained together. I think you can even beat Zheng if you ambush him with this speed.\"\n YinKong smiled, showing a completely different temperament from her usual coldness. She looked like the girl next door if not for the ocassional coldness from within her pupils. If you described her as an assassin with a handsome metrosexual face, she was now expressing a womanly glamour. The three men couldn\u0027t help but peeped at her.\n \"This is troublesome…\" YinKong shook her head and sighed as she looked to the sky. \"We are really going to die if this continues. Don\u0027t know if that stupid Zheng see through the truths of this movie or not.\"\n WangXia asked, \"Truth? What truth? Isn\u0027t it overcoming the gap in your heart?\"\n YinKong nodded, \"That is one of the truths. Everyone\u0027s gap is different. If this movie is really built upon Zheng\u0027s consciousness like TengYi said, then Freddy is going to target the one thing he won\u0027t let go in addition.\"\n \"The thing he won\u0027t let go?\"\n \"Yes.\" YinKong said with a smile. \"For him, it should be something very simple, to live on, whether himself or the team. This is the desire that has supported him to go on ever since he entered God\u0027s realm. Yet, this same desire to live on is now his biggest enemy. If he fails to see through himself, he, and us will all be wiped in this world. Of course, Xuan will probably be the only person to return since he hasn\u0027t entered the dream world. No wonder no one makes it out of A Nightmare on Elm Street alive.\"\n The other three people followed YinKong\u0027s gaze to the sky. A small dot loomed in from thd distance. LiuYu asked, \"What\u0027s that?\"\n \"Helicopter.\" YinKong rubbed his hair.\n The men cried, \"Helicopter?\"\n \"Right. Armed helicopter.\"\n As the dot was getting nearer and nearer to the house, their expressions changed. It was indeed an armed helicopter. When the helicopter reached within a thousand meters, a missile flew toward them.\n WangXia, TengYi and LiuYu cried while they ran. However, it was too late to dodge. YinKong though stood in place.\n (She\u0027s actually not bad. She wasted the power of the fourth stage in this body but her talent is not less than mine… I couldn\u0027t think of this Shining attack.)\n YinKong looked at the incoming missile with indifference. Her hands and arms suddenly blurred. This was YinKong\u0027s self-created ability to slash the sword with the high speed of The Shining. The resulting air wave attack could reach up to a hundred meters.\n WangXia, TengYi and LiuYu opened their mouths and eyes wide. They saw YinKong\u0027s arms and a large area in front of her began to warp like the bending of light around a fire. The warping advanced forward and in an instance, collided with the missile.\n The missile exploded but the warping even carried this explosion a hundred meters further away before stopping.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-18-chapter-12-09","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \n The world shall change when you click YES. \n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \n Who is the true enemy?\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
