{"id":58289,"no":568,"title":"Vol 19 Chapter 3-2","content":"An undercurrent swirled in Shanghai since the beginning of the year. Few knew of what was happening beneath the surface and most were completely unaware. Many belonging to the upper class or with readily access to information could only guess the Japanese army was planning another massacre or a repeat of the Nanjing Massacre in Shanghai.\n Speculations and rumors steadily drove Shanghai into a chaos. Those few who participated in the battle to seize the thing belonging to legends did not have the effort to spare for the common people. Worse yet, the foreign forces stationed in Shanghai further pushed the city into the chaos because they also wanted that thing. There was no one to stop the chaos.\n Jonathan looked out the window at the street. In his hand was a piece of faintly purplish gold. He threw the gold up and down. When a gust of wind swept near from behind, he sighed, “Dude, stop coming up in your sand form. It creeps me out.”\n A bald man dressed in a black robe appeared behind him. He shrugged, “DingLi’s dead. The sigil I placed on him suddenly vanished two minutes ago. This place is perhaps not safe anymore.”\n “Oh.” Jonathan replied then turned around to face a box sitting on the corner of the room. He put the gold into the box and lifted it up. “What are you still waiting for? We need to escape!”\n Imhotep had grown accustomed to his actions and said, “I finally believe that you escaped from the tomb by yourself when everyone else was killed. If running is a talent, your gift is as amazing as a miracle. Let’s go. We will find any place to stay.”\n “By the way, why does it seem like you don’t like gold?” Jonathan asked as he put on his backpack.\n Imhotep frowned. “I was a high priest. I had all the wealth you can imagine. Nothing was far away as long as I wished for it. Why would I take an extra look at mere gold?”\n “If that’s the case…” Jonathan’s eyes glimmered. “Why don’t you give me your share of the gold? You don’t need them anyway. I have no trouble with the weight.”\n Imhotep looked at Jonathan’s big backpack. It carried four hundred kilograms of gold but the bag weighted less than five kilograms due to an object with anti-gravity property. Even though they had known each other for a long time, he couldn’t find the words to say to this wish that belonged to the lowly slaves.\n “No!” A woman’s voice came from the hallway.\n A gorgeous woman stared at Jonathan and said, “What are you trying to do? The gold is our pay to bring you out of China. I only picked some small pretty looking stuff. And you are still not satisfied?”\n Her personality was violent in comparison with her beauty. Jonathan giggled but didn’t dare to say anything in return.\n Imhotep took the woman’s hand and said to Jonathan, “Let’s go find a ship that will depart. Those five monsters in yellow clothes can revive and come at any time. I might not be able to save you next time. We need to leave as soon as possible.”\n “Don’t you think it’s difficult to find a ship?” Jonathan said. “I have asked everyone I know. Not even the most powerful person in Shanghai could escort us out and he got killed. And I was planning to give him the Buddha head as his pay.”\n Jonathan murmured as he walked out the room. Imhotep and the woman walked casually behind him, hand in hand. They had no worry about Jonathan dying. For someone with the attribute of a cockroach, he would probably be the last to die after the everyone else.\n DingLi had been killed but Jonathan had a backup location to stay. Though the fear wasn’t coming from any human but those unknown creatures in the darkness, creatures that can damage even Imhotep.\n The time was past midnight when team China arrived at Asia. The team landed inside an alley under the cover of the dark sky. After putting the Sky Sticks away, each person carried a sleeping member of their back and moved on.\n “Let’s find a hotel first. We will find a news agency to post the message tomorrow. Ok?” Zheng said.\n Everyone looked around Shanghai in the 1940s with interest. It became one of the biggest cities in the world since this era, despite its home country suffered at the same time, despite the unimaginable sins that riddled the city.\n Pedestrians quickly caught the team after they came out of the alley. Their attires were a mismatch with this era, neither Chinese like nor western. There was an unseen gap that separated the team from everyone else on the street. Women carefully avoided them. Furthermore, the several sleeping members gave off a sense of kidnap or murder.\n “Looks just like the old society as expected. Law and order are nearly non existent.” ChengXiao muttered.\n The rest of the team followed his gaze to witness several dozen people with axes surrounded a smaller group with guns. The numbers disadvantage led to two people falling from the smaller group despite having guns. The others in this group were running away. Strangely, several people in police uniform nearby were simply standing there and smoking.\n “This looks familiar.” ChengXiao said with excitement. “It’s interesting the mafias always fight during midnight. But don’t you feel like this scene is straight from Kung Fu Hustle? Usually after the fight is over, their head will shout, ‘Cops, come clean up!’, and then leave like a victor. The cops will just follow order without uttering a word…”\n He spoke in a loud volume and pointed at the cops. The street lights in this big city illuminated his actions vividly. The civilians quietly stepped away and the cops began walking toward them with looks of anger.\n “What are you doing? What’s with these people?” The unkempt uniform made the cops look like ruffians or perhaps they were merely hooligans. The head of the cops glanced at ChengXiao with his baton in hand.\n ChengXiao acted shocked. He studied the cop from left to right until the cop was going to erupt. Then he asked Zheng and Xuan, “Can I kill this guy?”\n Before Zheng could speak, Xuan replied without even taking his eyes off the documents in hand. “Kill him. It doesn’t matter. Our goal isn’t to complete this movie, just a bonus mission. This world won’t restrict our actions much. As long as it doesn’t affect my plan, just kill off any threats.”\n “Oh.” ChengXiao giggled then turned to the cops with a smile.\n These cops were stunned in place. They hadn’t seen anyone more arrogant than this man who straight up talked about murdering on the open street. Even the mafias wouldn’t speak such topic in broad daylight. Just like the fight that just happened when the Qingbang wanted to revenge their leader DingLi from being killed, the gang informed the police their plans before hand.\n “Well then.” ChengXiao jumped four meters high in the form of a bird. By the time he landed, the cop with the baton had his head flew off. ChengXiao smiled at the remaining cops who called for the Qingbang’s members in panic.\n As ChengXiao was going to charge in, he heard Zheng’s voice. He was expecting Zheng to stop him but what came out was completely different.\n “Don’t kill all of them. Leave one alive.”\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-19-chapter-3-02","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \n The world shall change when you click YES. \n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \n Who is the true enemy?\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
