{"id":58320,"no":599,"title":"Vol 19 Chapter 11-4","content":"Half of Rui-Kong’s combat strength came from her psyche techniques and half came from infinitesimal control in a similar manner to YinKong’s techniques. By confining force in a tiny space and perfecting every attack, each of her movements could inflict fatal damage whether it was a slight push of the hand or a jump kick. This method of attacking possessed enormous power but it also posed a high level of requirement on the user. The fourth stage was the bare minimum needed to utilize it. Furthermore, when using the same technique, there was still a power difference between Rui-Kong and YinKong. Rui-Kong was much weaker at using this technique than YinKong.\\n\\n Even so, the power displayed by Rui-Kong was still immense. She leaped seven meters from the tree and before the two people on the tree crown could react, she had already smacked them off the tree with two hits. There was no visible injury on the two people’s body. Though their pupils had rolled off the front of their eyes, signaling that they had fallen unconscious.\\n\\n Fu-Kong readied his knife again as the fight commenced. However, Li-Kong stopped him. The strongly built young man laughed out loud and said, “Since the girl has chosen to fight us alone, it would be shameful if we were to use throwing knives in addition to ganging up on her… Everyone go! Even if it’s only one of them, we have to score one point back for our comrades!”\\n\\n YinKong was holding a few pieces of rocks in case Fu-Kong decided to use flying knives. She didn’t mind that Fu-Kong wouldn’t use the flying knives and kept the rocks in her hands. Though Li-Kong’s words made her rolled her eyes. The man was shameless when they ambushed with so many people and used flying knives. If she weren’t standing on the side without joining the fight, they would without a doubt be using the flying knives already.\\n\\n Anyway, similar fights had happened a few times before. Everyone held back a little despite being in different teams. This was not an actual assassination mission after all. Food was part of the reason but more so that they were looking to get their faces back and for entertainment. Knowing this, YinKong decided not to join.\\n\\n Rui-Kong stood on top the tree crown and looked toward Li-Kong with a smile. While Li-Kong stared straight back at her and laughed, over ten people came out from the forest. These people surrounded the tree Rui-Kong was standing on from all sides.\\n\\n Rui-Kong giggled then leaped down on a young man and girl who were dashing at her. The two were surprised but their steps did not waver. Just then, Rui-Kong snapped her fingers. The girl’s expression abruptly changed as she sprung on the young man’s back. In just the blink of an eye, Rui-Kong had already closed in on the young man. He had nowhere to dodge when her fist smashed straight onto his face and he collapsed unconscious.\\n\\n “Be careful! She started using mind control! Enter the highest stage of your unlocked mode. It will at least delay her!” Li-Kong yelled.\\n\\n Yet, he was too late. Five girls had fallen under Rui-Kong’s control in just this brief moment. Most guys were either knocked out by her or by the girls she controlled. Less than twenty seconds after the fight started, only a few guys were still standing and all the girls had lost control of themselves.\\n\\n Li-Kong sighed then said to Fu-Kong who was still on his side, “I am going to go… Don’t use flying knives. YinKong’s not going to show mercy. You are simply terrible in close range so just stand here.” He charged at Rui-Kong as he laughed.\\n\\n Rui-Kong giggled at the muscle man. “We have fought several times already. Your pure power does counter my infinitesimal technique but your muscle brain isn’t going to block my mind control. Do you still want to fight?”\\n\\n “Of course!” Li-Kong acted boldly. “Why not? Come control me!”\\n\\n He had dashed twenty meters while they talked. Every step he took crossed ten meters’ distance. His muscle enlarged and looked like a steel armor covering his body. At eight meters away from Rui-Kong, he smashed his fist forward, scraping by a tree on its way. The tree’s bark exploded. The wind generated by the smash carried the shredded pieces of the bark to Rui-Kong.\\n\\n Rui-Kong instinctively shut her eyes. She immediately realized what just happened when another gust of wind approached. This wind was much stronger than the previous attack. She leaped backward as she murmured the word shameless.\\n\\n “What do you mean shameless? Haha… all’s fair in a war. And the same in a fight!” Li-Kong clearly heard her word. His fist struck the ground where Rui-Kong was standing. The power smashed a hole on the ground. He dashed at Rui-Kong again, clinging onto the advantage he just obtained.\\n\\n The two people each dashed ten meters away. Nothing on the way could stop Li-Kong’s advance. The trees were only a bucket’s diameter thick and stood no chance against his fists. Power was not his only trait. His feet moved in a way that supplemented his strikes.\\n\\n Zheng observed as a spectator. Li-Kong’s power was innate to him. He abandoned dexterous techniques when he reached the second stage and focused his effort on pure power, raising it to an abnormally high level. Zheng recalled their battle against team India from way back. Team India also had a powerfully built man but that man was nowhere near as strong as Li-Kong, both in the progress of the unlocking the genetic constraint and techniques. Overall, Li-Kong was actually quite strong once Zheng tried to make a comparison. He would only hold a small advantage if he refrained from using Explosion, Destruction, the fourth stage and Dragon Transformation.\\n\\n Li-Kong’s attacks chased Rui-Kong without giving her a break. The two were similar in close combat level so it was difficult for Rui-Kong to catch up once she lost the initiative.\\n\\n (I can’t let this go on. Relying on close combat alone is unfavorable for me. His style literally counters mine… I should use mental abilities. Probably not strong enough to control him since he’s in the third stage, but I should at least be able to see his incoming attacks, just like how the previous fight went.)\\n\\n Rui-Kong made up her mind and snapped her fingers. Her mind immediately came in contact with Li-Kong’s mind.\\n\\n \\n\\n \\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-19-chapter-11-04","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
