{"id":58331,"no":610,"title":"Vol 19 Chapter 13-6","content":"Twenty seven hours until the seven day limit. The location was at the coast of the U.S., bordering the Pacific Ocean. The catastrophe that happened to Tokyo had been verified. Aside from the cruise that team China saved during the incident, airplanes departed from North Korea also verified Tokyo’s condition within an hour. Japan lost a third of its land spanning from where used to be Tokyo Harbor to Tokyo’s nearby provinces. A good portion of the country was still suffering from earthquakes, volcano eruptions, tsunamis. Millions died in the initial estimate. Mankind had never been in such an awkward circumstance. Extinction… a word that was only associated with science fictions came forth to the real world. Man’s initial reaction was what a joke. And then disbelief. And then fury. The United States also received the message that the Chinese immortals were flying over the Pacific Ocean toward them. The United States was the next to be razed and the destruction of the world would continue from there. It was a country many times bigger than Japan. Yet, no country could bear destruction on the scale that Japan suffered, not even once. Following the fury, the government assembled all its fleets near the Pacific coast. Ambassadors residing in China began emergency negotiations with the Chinese government in order to get in contact with the immortals. “That’s not an issue.” Xuan calmly said, holding a piece of silver plate. “However, where’s the Buddha statue? The next target will begin at the United States if we do not get the statue. Also let them know we will destroy… the fleets gathered on the Pacific Ocean. Enough with this conversation. There is only one last piece to the statue. We will stop when we have it or we will destroy the world!” The Kuomintang officials standing on the other site of the plate fell to a silence. A strange feeling that no words could describe struck them upon receiving the message of the fall of Tokyo. They were proud of the immortals of their country and feared the terrifying power of their weapon. Furthermore, the whole of mankind might become the next Tokyo before long. If the last piece of the statue was found, China would have a hidden power that could intimidate the world. All the Chinese with knowledge of the situation held mixed feelings. This was the fifth call Xuan received after Tokyo had fallen. The Communist Party contacted him twice. Many foreign powers requested to contact team China but the two parties of China were the only ones who could do so. The aftermath caused by the fall of Tokyo slowly developed in the next several hours. “You’re not wrong.” ChengXiao watched Xuan folded the silver plate then asked. “But don’t we only have enough energy stones to fire one more shot? How can we destroy the world?” “Of course we can’t.” Xuan admitted. “The previous shot was fired at the Magic Cannon’s highest output. We can’t use it as a regular weapon. It exists as a mean of intimidation and last resort. We only need to use a small quantity of energy stones for normal situations. As for the situation right now… have you forgotten the energy stones Zheng brought back from the Lord of the Rings? I brought them all with me. Although compensating for the lack of higher rank energy stones with higher quantity reduces the conversion efficiency, we can still achieve five shots of equal power.” The rest of the team simultaneously asked. “Five shots? They’re enough to destroy the world?” “They can.” Xuan nodded. “Five shots can destroy North America. If we hit the continental shelf, it will trigger a magnitude 12 earthquake. Water will pour into the continent and sink it to the bottom of the ocean. The tsunamis that follow will sweep the world at the same scale as the flood from mythologies, whether it’s the flood from Genesis as told by the bible or the Great Flood of Gun-Yu from Asian mythology. This flood will destroy our young technological civilization. A mini ice age will come upon the Earth once the earthquakes and flood subsided because the fall of America will affect the two poles, shattering and melting the icebergs. The mini ice age would last for three hundred years, killing those who survived the earthquakes and flood. By the time Earth recovers, human technology will regress three thousand years. Mankind begins again from slavery societies.” Everyone stared at Xuan in a dumbfounded expression. ChengXiao clapped his hands together and said. “Mankind regresses to slavery societies… What does it have to do with our goal?” Xuan glanced at him. “Nothing. Similarly, what does destroying the world has to do with obtaining the Buddha statue? Listen. Destroying the world is a mean and not the goal. If we still don’t get the last piece after three shots of the Magic Cannon, then this last piece might have been lost in somewhere remote. Perhaps no one in the whole world knows where it is. Perhaps the Saints of the West erased it. The situation becomes a death trap that we couldn’t escape. Five shots of the Magic Cannon are enough to give us the answer, whether we get the last piece or destroy mankind.” “You’re not wrong…” ChengXiao whispered. “But why do I feel that you want to destroy mankind? Are you thinking of sinking America to test your hypothesis?” Xuan ignored him and sped up the Sky Stick. The rest of the group gave a bitter smile then followed. Several minutes later, the silhouette of North America came into their sights. Someone contacted Xuan again. He opened the silver plate with patience. A very familiar voice came through. “Xuan! Did you use the Magic Cannon?” It was Zheng’s voice, sounding furious. There was a gap of silence before he calmed down. “I don’t care about the Magic Cannon. But you are planning to blast North America. Have you forgotten that O’Connel and the other main characters are in the United States? Do you plan to kill our comrades?” Xuan gave him a sneer. “They are only your comrades… And it took you long enough, two days later than I expected. How is the effect of the glasses?” Zheng was still holding himself fine up to this point, but the word glasses ignited a fire within him. He roared at the silver plate. “Fuck your glasses! What the heck are those? Glasses? I crushed them the moment I woke up!” “Is that so?” Xuan’s tone remained calm as always. “Then give me a rank D reward after we return. The materials of the glasses need a ranked reward.” “Do you think I will abide?” Zheng calmed himself for a good while before he spoke again. “It’s rather weird over here. YinKong did wake up but she’s not the true YinKong. Uh, by that I meant the YinKong before she entered God’s Realm, or actually that’s not the true YinKong either. This YinKong is the one after she entered God’s Realm… It’s complicated but that’s the gist. I will give you the details after we meet.” Xuan was confused but he was not someone with curiosity. “Then we will return at any time after twelve hours. You must preserve your strength during this period because we don’t have much time left. Once we return, we will enter the tomb, at which point you must be in perfect condition. Don’t lose to the god.” “Even though that’s what you said, hehe…” Zheng giggled like a dimwit. He then said in a low voice. “I believe in your scheme. Zero has told me the situation. It crosses the line a little but I believe that… death brings them the greatest peace. Don’t feel burdened and move forward! I will always be your support!” “Sounds like the dream triggered you.” The pointless conversation ended. The rest of the team cheered up with Zheng waking on the last day. Even though the next step in the plan shot their morale, it was still a good feeling to hear a comrade waking up. The next step was to blast the Pacific coast of the United States, centering around San Francisco and spanning to Oakland and San Jose. Judging by the damage on Tokyo, the United States would lose at least a twentieth of its land. A much greater area would be affected. “Let’s choose a ship from the fleets below.” Xuan pointed to the surface of the ocean. He dived down on the Sky Stick and landed on a ship. The Gauss pistols had slipped into his hands. Heng and the rest knew that he wasn’t just planning to shoot four holes on the ship. He would clear the fleets and then alter the United States from the world map! Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-19-chapter-13-06","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” The world shall change when you click YES. In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. Who is the true enemy?","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
