{"id":58346,"no":625,"title":"Vol 20 Chapter 1-1","content":"\"That\u0027s the basic situation. We are lucky that no one died in this mission. The spoils don\u0027t line up with our expectation but at least we have something in our pockets… This bonus mission ended wonderfully.\" Xuan said.\n Team China sat in a circle inside a little inn in Egypt. This was the entrance to this world unique to the team. Once the time arrived, they would be returned to God\u0027s dimension. This time was only two days away. During the final days in this mission, everyone was too lazy to move after a rough adventure. They decided to settle down in this city. They went fishing, chatted, and then napped. Such laid-back days were far and few in between for them.\n Xuan didn\u0027t wake up until the last several days. He expended too much mental energy and life force in the battle. If one were to judge his age by his appearance, they would have assumed he was over fifty. Though the dude\u0027s face looked as indifferent and calm as always after he woke up. The way he talked didn\u0027t change at all. The loss of a good chunk of his age barely had any effect on him.\n \"You call this lucky?\" Zheng pointed at his arm.\n The arm that wielded Tiger\u0027s Soul had withered. He could no longer move this arm. He couldn\u0027t even feel any sensation, no pain nor itch. It was as though the arm had died. Circulating energy into the arm had no effect either. The state of the arm scared him but fortunately, the wither was contained to the arm that wielded the sword. The rest of his body was completely fine.\n Xuan nodded. He pointed to a black and white crystal in Zheng\u0027s hand and said. “Like you said, Cultivation mainly produces two forms of energy, positive and negative. Perhaps there are variations to each of these energies but those do not stray far from essence of the two forms. You don’t have the methods to control any of these two forms. Refined Qi has a positive affinity to the human body which allowed you to use it without harm. Magic on the other hand is a negative energy. In this case, it’s like the sea to a swimmer. Those who can swim can conquer this sea and those who do not will drown. Your arm has drowned. Just wait until we return to God’s dimension and heal yourself.”\n Zheng sighed without saying much in response. He looked left and right. Inside this inn lay only the members who were still in their dreams. The rest of the team were out enjoying and resting themselves using this free time that was uneasy to come by. Zheng and Xuan were the only two who couldn’t do so due to their injuries.\n “Enough about my arm… I have two things I want to mention. The first thing is YinKong. I gave you a complete account of the events from the dream and you said the second persona emerged while the original persona fell into a sleep. But my question is about our comrade. Where is the YinKong who has accompanied us all this time? The girl who was quiet but has a delicate heart. The girl who knew all these assassination techniques. And the girl who always had a romance novel in her hand. Where is she? Is she still alive?” Zheng’s volume increased with every word he said. The last of those words were almost shouting.\n Xuan sneered at him. “Is that really why you are asking? Not because the original persona is cautious against you? So, the inner lolicon of you feels she has escaped your control and desperately wants to find the little loli that treats you and everyone as comrades?”\n Redness shot up on Zheng’s face. His voice was nervous and his words were rushed. “I wish for the original girl to come back but it’s not as terrible as you think! Solely because she’s our important comrade! Not loli this loli that. I never had any intention to make a move on her! I am just worried that she suddenly became an alter persona created by another person. I can’t accept it! I don’t wish for our comrade to be merely an illusion!”\n Xuan put away that sneer and pushed his glasses with a finger. “Whether it’s the original persona or the alter persona, they are both created by her. To give you a poor analogy, if you hate broccoli but that’s all you are allowed to eat, most normal people would bite their teeth and swallow it. This is a process of endurance. However, when it comes to situations much worse than eating broccoli, like death terror, sadness, or pain unbearable to the heart, the process becomes an escape of the mind. The original persona will manifest an alter persona. This is the source of typical schizophrenia, which I believe is the case with YinKong. There’s no this she and that she. They are just her escaping the pain of the past. The quiet she put up a face that deterred everyone because she’s scared of bonding with new friends and become injured again. However, you still treated her as a comrade… Perhaps comrade is the one word that gives her the most pain.”\n Zheng was stunned. His hand touched Xuan’s forehead and asked with curiosity. “What did you eat to make you speak with such empathy? Or is something horrible going to happen soon? Or are you scheming something again? Fuck it! I am telling you, you better let me know beforehand no matter what you are going to do this time!”\n Xuan turned his head around. “Not scheming anything.”\n “Not scheming… then why did you turn your head around!” Zheng shouted.\n Xuan didn’t look at Zheng. He uttered as if speaking to himself. “No one is born with trust to other people. Have you forgotten our past? When trust was established between strangers, and then strangers become comrades. Do what you have done before… She’s still YinKong, right?”\n Zheng opened his lips as if he wanted to say something. Yet, seeing that never changing expressionless face in front of him, he simply nodded. “That’s all for the first thing. She’s usually still the YinKong that we know. Is her original persona limited to a few minutes each time? Kind of feels like Ultraman… Ahem. The second thing is how’s the research on the things I brought back going? Those are Cultivation manuals and items! The future of team China is in your hands.”\n Xuan said. “It hasn’t been twenty-four hours since I got them. What do you think I am?”\n “Doraemon… Okay. Take your time with the research after you return. Can you at least tell me why does the Cultivation I saw differ from the Cultivation I knew? What’s supposed to be an antiquated training method turned out to be super advanced technology. At least that Cultivation appeared like technology. Did we get tricked? Was the whole mission a trap set up by the Saints of the West and the Cultivation they put in place was an illusion to bait us?” Zheng asked a series of questions then stared at Xuan. These questions arose the moment he entered the Sky Tower and stayed with him until now. The person in this team who was most likely to have the answer was Xuan.\n “Unlikely. Over an 80% probability that the Sky Tower belonged to Cultivators. As to your question…” Xuan thought for a moment. “What are your images of Xuanhuan, fantasy and magical worlds? The worlds that are in novels and games.”\n Zheng paused for a second before replying. “Uh. Magical worlds? Like the Middle Age with sword and magic, knights, kings, demons and monsters? The Lord of the Rings world is a representation of magical worlds. What’s wrong?”\n “Time.” Xuan looked straight at Zheng. “Any civilization that exists is reasonable. If it exists, it will advance. Our civilization advances on the path of technology. Through thousands of years of advancements and regressions, our civilization accumulated the assets to erupt from the ground like a fountain and formed the modern civilization. The worlds that you imaged are the Middle Ages of those worlds. Even a magical world will not always stay in the Middle Age. It will advance. Technology allows any human to fly in the air. The same can happen with magic through inscriptions, rune words and energy technologies. How about a carpet that can fly? Anti-gravity rune words powered by energy has the same concept as anti-gravity generators in sci-fi worlds. The only difference being one achieves this outcome through rune word knowledge and the other through machine knowledge. Civilizations will advance. When a civilization fails to advance, it will be eliminated by advancing civilizations. Furthermore, due to the needs of humans, all civilizations will advance toward the same goals, whether it’s through Cultivation, technology or magic.”\n Xuan paused for a second before continuing. “Based on the rune word formulas and formations we currently possess, the results achieved have a 98% similarity to a circuit board in modern technology. Do you understand it now? Cultivation is also a form of technology even though it takes a different path from our own. Cultivation seeks the truth of the universe. All those profound manuals and poems that can transcend a person to the top of the world that you read in novels? So profound that not even the author understands what he’s writing are not Cultivation. Cultivation is simply the science and technology that utilize the truth of the universe.\n “Mortal’s wisdom is always filled with foolish thoughts, complicating what’s supposedly a simple matter. The gap between Cultivation technology and modern technology of the real world is approximately a thousand years. If our machine technology advances at the same pace for another thousand years, we will probably reach Cultivation, or actually, the entrance to Cultivation. That’s all there is for now. Detailed data of the glowing rocks and the two items will have to wait until we return.”\n Zheng stared at Xuan dumbfounded for a while. He gave an autistic laughter and said. “Hoho. I still don’t understand but I get one thing. Cultivation is a form of advanced technology. Okay. Understand. It was my fault for asking that question. Go get some rest.” He scratched his head as he walked toward the door, muttering something about “Doraemon’s wisdom.”\n Xuan ignored Zheng’s leaving. With an annoying person gone, he could finally close his eyes and think through some things. However, Zheng suddenly turned around at the door and asked another question. “Have you finished the arrangements regarding China? How are the two parties going to death with the world after the disaster we have caused? Will the rest of the world unite together and invade China? Should we do something?”\n Xuan opened his eyes with a cold laugh. He shook his head. “It… doesn’t matter anymore. If I am not wrong, the state of the world will become what you nationalistic youths dream of… that’s all.”\n “That’s all… what exactly is it!”\n Nanjing, China. Liveliness slowly bloomed in this city after the Nanjing Massacre. Chinese political figures returned to the city and a huge number of ambassadors also arrived. They couldn’t not come.\n “Chairman Chiang, are you certain we should say this to the British ambassador? Reclaiming the concession, removing the interest from our debt, holding them responsible for the Opium War, claiming indemnity for the wars that followed and signing all these contracts that affect the British Empire’s interest in China, are you sure we should say the same things to the other countries? We will shock our international allies.”\n “Damn your mother. It’s our turn to shock. Allies? You can resign from the foreign minister position and get someone else here. Tons of people want to put their name down in history. Let me tell you, history has changed path. This history no longer belongs to Europe, or Caucasians! As long as that pillar stands, we will have the time to develop and grow. The billion of our family will rise again! We bent our knees and begged when we were weak. What do they have to keep us down now? Let them know it’s their choice. We will see who are the ones to be anxious if they don’t sign!”\n A ten-meter-long glowing crystal pillar stood in the center of Nanjing. WangXia asked Zheng to slice this pillar with Tiger’s Soul from the tomb before they left. In his words, this was a little gift he wanted to leave to the Chinese of this world before they return. The Chinese had suffered too many ordeals. He would bear the hate for being a nationalistic youth if only the Chinese could endure less suffering.\n “When the crystal falls, so do the other nations.”\n Zheng asked WangXia at the time. “How effective do you think this is?”\n “I don’t know.” WangXia frowned. “They have to pave the road for their own future. Sixty percent of China’s feebleness came from the people themselves. Only forty percent was caused by other races. This pillar erased that forty percent. It will be up to the Chinese now. If they still fight among themselves, no number of pillars or even the Magic Cannon can save them from being an affluenza generation.”\n Team China left the world.\n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-20-chapter-1-01","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \n The world shall change when you click YES. \n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \n Who is the true enemy?\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
