{"id":58431,"no":710,"title":"Vol 22 Chapter 8-5","content":"“True, letting the enemy capture a person or two was the strategy decided, but…”\\n\\n Zheng said softly, “But if they’re too weak, killing off a few here as a deterrence would also work as a way to protect our members. Besides, I didn’t say before whether or not to hold back. We’ll let one or two run away at the critical moment. The rest don’t need to leave, and can stay here.”\\n\\n “You feel very resentful because of Xuan and Honglu’s annoying plan, right?” Cheng Xiao laughed at the side.\\n\\n Zheng didn’t reply, merely taking out Tiger’s Soul, shaking it. Seeing that resentful look of his, it was obvious that Cheng Xiao’s words had hit the nail on the head. This movie world wasn’t his stage, but that of the three team’s strategists competing. Whether it was him, the other members of team China, or even team East Sea and his clone, they were but chess pieces for the strategist’s battle. If it was just this it wouldn’t matter, but...\\n\\n “Xuan just had to set up such an annoying scheme. We have might but we can’t not retreat, and have to watch team East Sea hit at us, and even let them capture our members. It’s really…” He couldn’t help but grouse. Although it was done softly, Cheng Xiao besides him could still hear it.\\n\\n Cheng Xiao chuckled, about to say something. However, Zheng raised a hand, stopping him.\\n\\n “They’re here.”\\n\\n Cheng Xiao had originally been all smiles. It didn’t change even after hearing that, that smile still remaining. He stood behind Zheng, the two staring out at sea as if nothing had happened.\\n\\n “Zheng, they’re here so fast…”\\n\\n Cheng Xiao’s Nanto Suicho Ken was a fist art that primarily manipulated the wind to kill the enemy. However, he had a knack for sensing the wind flow. So, although his body’s quality was far inferior to Zheng, he wasn’t much worse than the Zheng when it came to determining someone’s location through listening to the wind.\\n\\n Zheng slightly nodded his head, not saying anything. He eve kept Tiger’s Soul, his back facing the direction team East Sea was attacking from. He silently stood within that storm...\\n\\n ***\\n\\n Team East Sea’s warships weren’t far from the destroyer. Of course, it still wouldn’t be visible with the naked eye. After all, this storm was the best cover. It was amazing for a normal person to even see out a hundred metres, unless they were a God’s Realm team member.\\n\\n “We’ll do it here. These warships aren’t able to enter the stage of a battle between God’s Realm teams. Letting them attack will instead end up with them being annihilated by team China. We still need to rely on them to go back, so we can’t let these warships attack.”\\n\\n Sora looked at Miyata Kuraki careful look, then hurriedly turned away. “And, we’re not making a surprise attack, but a sneak attack. We have be careful in the middle ground of these two, as we’re far inferior to team China. Whether in a direct confrontation or attacking them suddenly, even half of their teams power will be enough to kill the five of us as long as team China recovers from their surprise. So, we can only sneak attack, and not barge in. We’ll leave the warships here, and only we’ll go.”\\n\\n The muscular baldie laughed coldly. “That’s easy to say. Without the coordination of these warships, we’ll face a bitter battle as soon as we’re discovered. We won’t even be able to escape. Has your mind gone rusty? These warships were originally sent as consumables to cover us. Not even mentioning you, even the fleet commander is clear on this. Why do you think so many fast warships were deployed? Or… are you a spy of those yellow monkeys? That’ll explain why you’ve been so kind to those yellow pigs!”\\n\\n Sora Aoi’s face suddenly turned green and white, and she hurriedly looked at Miyata Kuraki. However, she saw him looking comfortingly at her. Her heart relaxed, but she immediately turned enraged. The target of her anger was naturally that muscular baldie with no brain to mouth filter.\\n\\n “I’ll let it pass for all those times normally when you peek at me, although that gaze of yours is both disgusting and filthy. However, you can’t speak such nonsense about me!”\\n\\n Sora Aoi’s pupils gradually turned from black to silver. Her entire eyes seemed to shine with white light, with unspeakable ferociousness. The muscular baldie still retained that unconcerned look of his, perhaps believing that his team leader would stop Sora Aoi. However, who expected that by the time Sora Aoi’s eyes turned completely white, Miyata Kuraki wouldn’t utter a single word. The baldie could no longer remain silent, and cold sweat began to flow.\\n\\n “I, I’m just taking it at face value. I also didn’t say you’re definitely one of those yellow pigs, but only that your performance has constantly been disappointing. Why do you keep calling those yellow pigs Chinese?” The baldie’s mouth went weak, but he still obstinately spoke.\\n\\n Sora Aoi didn’t say anything. She grit her teeth and look coldly at the baldie. Gradually, a spatial distortion appeared between them. It was as if light couldn’t pass through freely. Seeing the current situation, the baldie couldn’t help but shout, and the muscles on his body began to swell up, looking as if he was about to go all out.\\n\\n “Enough!”\\n\\n Miyata Kuraki suddenly drew his sword and placed it between them. The distorted space was slashed into nothingness, and the muscular baldie hurriedly stopped his actions. He successfully leapt several metres away, and only then did the cold seat on his body finally began to flow down. Sora Aoi’s eyes also returned to normal, only that it was tearing up, and she looked at Miyata Kuraki with an aggrieved expression.\\n\\n Miyata Kuraki coughed unnaturally. Only then did he look viciously at the muscular baldie. “Shut up! Do you really think I won’t punish you, Koinu Maosu! You always don’t have a brain to mouth filter!”\\n\\n Koinu Maosu mumbled a few things, and stood there with his head lowered. He looked extremely terrified, and hadn’t recovered yet.\\n\\n Miyata Kuraki looked at Sora Aoi again, coughing unnaturally once again. “Sora Aoi, your suggestion is indeed slightly risky. If we’re discovered, we won’t be able to flee. However, we also can’t have all the warships attack. How about this, we’ll leave two behind, and the rest will follow behind us to attack. At that time, we can use the chaos to escape. What do you think?”\\n\\n Sora Aoi opened her mouth, wanting to say something. However, when she saw Miyata Kuraki’s slightly helpless expression, she swallowed her words. She knew clearly that this team leader was good in many aspects, only that he valued his team members’ lives too much. There were many times where he ended up hesitating and indecisive, instead causing chaos. For example, Koinu Maosu. Was he qualified of team leader treating him like that?\\n\\n Miyata Kuraki didn’t know of the feelings in Sora Aoi’s heart. He only looked into the distance, saying, “Then begin the battle! Sora Aoi, scan the entire destroyer. Under the precondition of not breaking the other side’s psyche force screen, do your best to provide information and the other side’s location. And, protect Kamimiya Tonomoto well.”\\n\\n “Koinu Maosu, you’re responsible for attacking with me. Immediately assist me in subduing them when we notice the enemy. Your explosive power in melee is considerable. As long as we take them by surprise, it’s not a problem capturing one or two. Miseichi, you’ll in charge of handling the long distance attackers and tying down any who come to assist. You just need to create for us a safe window of time.” Miyata Kuraki look at that slender and tall man, Miseichi. Miseichi nodded, showing his agreement.\\n\\n When everything had been assigned, Miyata Kuraki exhaled a breath, then turned to the old man besides him. “Kamimiya Tonomoto, I’ll have to trouble you. Let’s begin!”\\n\\n The old man nodded, and then his hands seemed to draw something in front of him. His mouth also began to recite something, and following the strokes his hand drew, a dark surface five square metres in size appeared before him, Liquid seemed to be swirling within the black surface, and a giant claw abruptly extended out.\\n\\n An entirely pitch-black giant monster, both like and unlike a bird, rose out of the black surface. It looked like an eagle, only that it was four to five metres in length, reaching ten if its wings were to be expanded. It was ferocious and horrifying, scaring people as if it were a ghost.\\n\\n “Let’s go!”\\n\\n Miyata Kuraki jumped onto the giant eagle first, before the rest followed. Only Sora Aoi stayed at her original position, looking worriedly at Miyata Kuraki. Miyata Kuraki turned backed and said, “I’ll leave it all to you. Let the remaining warships attack the team China’s destroyer, and protect Kamimiya Tonomoto. He’s not comparable to us, and has no combat power apart from the protoghost.” Finished speaking, he turned away. With a whoosh of the giant eagle’s wings, a sound like that of metal clanging, the giant eagle had already charged over ten metres into the sky in the next second, speeding into the distance like a gale.\\n\\n “God restricted personal flying equipment, but there aren’t restrictions on innate flight abilities! We have someone who can fly. Could team China not have anyone who can fly?” Sora Aoi sighed internally. She turned towards those dumbfounded soldiers behind, and hurriedly said, “Tell the captain, begin the attack! Apart from our warship, let all the other warships attack the destroyer… I’ll leave it to you all!”\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-22-chapter-8-5","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
