{"id":58479,"no":758,"title":"Vol 23 Chapter 10-1: The Imperfect Strongest Causality-type Weapon(I)","content":"Team China had split into squads before entering Raccoon City. One of the squads was the main combat force for the final battle despite being only six in number, comprising of Zheng and Xuan, who were top tier in the realm. The squad’s strength was incredible, enough to forcibly go against team Devil… Of course being able to go against them didn’t guarantee victory. These were two separate matters.\n The other squad were more in number and although they couldn’t quite match up to the first squad, they still had experts of various fields. They also had team China’s number two strategist Xiao Honglu. It was a team existing specially for ambushes. As long as a suitable opportunity arose, they could suddenly charge out to give a ferocious bite… and it would be one that cut to the bone.\n They only needed to occupy a single missile base based on Xuan’s initial request. Occupying all wasn\u0027t necessary as while Xuan had given them a lot of the super virus, its volume wasn\u0027t too much. Several warheads would be enough to disseminate the virus throughout the city. Using such a team and a strategist did seem to be overkill, but there was no other choice. Only Honglu could familiarly operate various kinds of modern weaponry and fire missiles apart from Xuan in team China.\n And to avoid the squad from being too weak and making clone Xuan not fix his sights on Zheng and the rest, this team had become this current situation. They were powerful in certain extremes and could launch sudden attacks, but they were unable to pose a fatal threat to team Devil and the Angel Alliance...\n “What an awkward position… we can’t possibly be spending this final battle as deliverymen, right?” Honglu muttered as he sulked.\n They were at a missile base’s missile firing platform. Honglu had in the long time since entering the realm, enjoyed reading books of all sorts in his spare time. This was indeed lived up to his reputation as a genius, or someone with a highly developed central nervous system. Although he wasn\u0027t quite at Xuan\u0027s level, he would still be a pinnacle strategist in other teams.\n When Honglu said this and everyone all spontaneously looked at him, the little boy’s face reddened and he said hurriedly, “Fine fine. No need to look at me like that, I was just grousing a little. Relax, I’ll be carefully considering the intent behind Xuan\u0027s scheme. I won\u0027t say anything more about not understanding.”\n Frankly speaking, the act of splitting up hadn\u0027t been one Honglu approved of. But in that situation where they lacked any usable intel or clues, he couldn\u0027t not agree as he wasn\u0027t able to come up with another actionable plan. He couldn\u0027t match up to the greatest strategist Xuan under the circumstances of having equal intel and clues. So, he could only helplessly agree to split up.\n (But… Is Xuan’s splitting up this time purely as he said, just to disseminate the virus and affect team Devil\u0027s line of vision?)\n Honglu couldn\u0027t understand Xuan\u0027s scheme and calculations. What was deep in the recesses of that man’s mind couldn\u0027t be guessed by anybody… except he himself.\n Hence, after plucking many hairs and under the repeated questioning of the other squad members, Honglu finally snapped that he didn\u0027t know, revealing the true disposition of his age group… a childish tantrum.\n Honglu only finally meekly apologised to the rest when he entered the missile base and began to operate the platform\u0027s controls. After all, the squad’s mission wasn\u0027t one that would let him throw a child\u0027s tantrum. He had to guess Xuan\u0027s intent, just like in Independence Day, and lay the scheme for the final battle in concert with him!\n (But I really don\u0027t get what Xuan is thinking? Is this squad really just to confuse team Devil’s line of sight? That doesn\u0027t make sense. After all, the foundation of our hypothesis is that we think team Devil has some sort of omniscience. That\u0027s how they can know we split into squads. But if they do have some kind of omniscience, there\u0027s no way clone Xuan will be confused by such a small trick. They\u0027re Xuans after all and they have both stand at the highest level of intelligence.)\n Honglu pulled his hair off in vexation. He looked at a missile soar into the sky towards Raccoon City. His heart was instead becoming less and less confident at what was going on as he repeatedly guessed at Xuan\u0027s thoughts.\n Honglu inhaled a deep breath. He suddenly asked Lan who was besides him, “Big sis Lan, let me ask you something. Let\u0027s say there was a pair of eyes that could constantly monitor you at every moment and know every action of yours. It can also watch someone else, but the pair of eyes can only keep track of what he’s doing when it\u0027s watching him and won\u0027t know what\u0027s happening during the times it\u0027s not watching. Let me ask, how would you pass a message you don\u0027t want the eyes to know to the other person?”\n This analogy sounded incredibly like team China’s current situation of one strong squad and one weak squad. As expected, Lan was lost in thought. The pretty girl’s forehead seemed to protrude slightly more than an ordinary person’s, which gave her a sort of unique charm of the gentle and quiet sort. After thinking it through carefully, she said, “This eye can know everything about me? Does this mean for the moment it starts watching me, or does it mean it can know everything about me from birth to death with just one look?”\n Honglu froze upon hearing this. He frowned, “If it knows everything past and future, that\u0027s undoubtedly the domain of a god. Team Devil shouldn\u0027t have reached this level yet, or else they’ll have long since completely crushed team Celestial and us. I think this omniscience should be… you should think of it as a psyche force scan with no limitations of distance or plane.”\n “If so, when did these eyes start watching me? If he’s watching me, I just need to find a moment before that and use an encoded method to pass on a message to the other person. As for whether he can understand or not, that\u0027s up to the other person’s intelligence.” Lan said after considering it.\n “If so…”\n Honglu suddenly said loudly to Zero. “Zero, check all the virus containers Xuan gave us carefully. Check if there’s a message he left us without leaking the virus out!”\n Not long after, everyone indeed found a piece of paper Xuan left inside. There were only some strange numbers inside, seemingly without any sense to them. Honglu couldn\u0027t comprehend them whether he used Morse code or any other. In truth, these numbers seemed meaningless, written randomly without any thought put into it.\n “What does ‘X’ mean? This is the sole letter on the paper, with the rest being a meaningless stream of numbers. Damn it, don’t tell me I’m supposed to guess it. I really want to see how team Devil’s Xuan tries to guess it!”\n Honglu turned the paper from side to side. He even wet a small bit of the paper, but the truth told him it was just a piece of ordinary paper that couldn\u0027t be any more ordinary. This meant the letter and numbers on it were hiding some secret. But without any rules being informed, how could anyone easily figure out the irregular numbers someone else randomly scribled? This wasn\u0027t a novel’s plot after all!\n “X?\n “X? Damn, X what? X-files? That\u0027s not impossible…”\n ***\n Team Devil\u0027s location...\n When team Devil split into two squads, clone Xuan had already made Zhang Xiaoxue activate the Godseal Board, or rather, use the remaining causality points to activate it. As long as there were any changes that affected the battlefield, the Godseal Board would have a notification for it, then monitor the location of that team for up to forty eight hours. This was at great cost to team Devil. They would have to endure even more severe spacetime reversal and have to expend almost all of their causality points. It could be said it was an all-or-nothing choice for them.\n The Godseal Board was akin to opium. Not using it was an incredible pity, and it was like it seduced the soul. After all, it represented the pinnacle of ancient rune technology. It was the strongest conceptual weapon, also known as causality type weapons. This was the strongest and ultimate weapon of the yellow race’s Saints and Cultivators. It was a completely different path of science from the Western white race’s Saints and Cultivators that emphasised the genetic constraint, biological science and natural science.\n “Team China obtained the yellow race Cultivator’s legacy. From the treasures as well as the equipment created by my original that the Godseal Board listed, they should have Cultivation techniques, and a complete set at that.”\n Clone Xuan looked at everyone. “Know what this means? If it\u0027s just Cultivation technologies, we already obtained them once in Zu Mountain. You also already trained it to the Nascent Soul stage, right?” Clone Xuan pointed at a middle-aged Chinese man. His get-up was strange. He was wearing spectacles, but his clothes were a set of ancient Chinese robes, and he carried a sharp sword on his back. It was unconventional no matter how you looked at it.\n “But your strength isn\u0027t even a tenth of Luo Yinglong. That\u0027s a fact. It\u0027s not that your Cultivation level is too much worse than his, but that you don\u0027t have any other means to attack other than a flying sword. You only have a better body than ordinary people and a few methods to use Refined Qi. But that isn\u0027t much better than other enhancements like the vampire’s Blood Energy, practising Qi or demonic energy… Based on us, that Cultivation that\u0027s been praised to the high heavens doesn\u0027t seem like much. It\u0027s just a slightly stronger technique. But is that the whole truth?”\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-23-chapter-10-1","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \n The world shall change when you click YES. \n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \n Who is the true enemy?\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
