{"id":58499,"no":778,"title":"Vol 23 Chapter 15-2: Meeting again(II)","content":"Xuan clearly understood that team China was slightly weaker than team Devil. Before team Devil obtained the Godseal Board, they could have pushed the advantage of having two strategists to have a cooperative scheme. They would have a fifty percent chance of beating team Devil. King versus king and soldiers against soldiers was the best for team China, while team Devil who maintained superiority would definitely attempt to avoid it.\\n\\n It was a turning point when they obtained the Godseal Board. It made team Devil much stronger, but it also intensified the amount of variables.\\n\\n The first variable was discovering Adam’s Human Instrumentality Project and the truth behind the Angel Alliance. It left clone Xuan with no choice but to think of a way to eliminate team Celestial or minimise their threat.\\n\\n The second variable was about luck, the consequence of using the Godseal Board. After it was obtained, its bearer didn\u0027t even need to use it. Causality points would accumulate even through just human interaction, leading to the rejection of the universe. Due to the relation of causation, it was team Devil that led to the bearer even possessing it. Thus, the whole team Devil were targets of the rejection.\\n\\n The third variable was clone Xuan knowing of team China’s power in advance, especially Zheng’s power level. It could be said that candidates to rival him could no longer be found in the realm outside of clone Zheng. Thus, why was there a need to choose a risky chaotic battle if clone Zheng could comfortably beat his original? Although it was practically guaranteed to be victorious over team China in a chaotic battle, how many survivors would team Devil have after a pyrrhic victory? That was what Xuan meant when he said to team China about past experiences shaping our thinking. Team Devil’s absolute faith in their Zheng and team China’s in their Zheng led to a king versus king and soldiers against soldiers battle perfectly coming into place. The third varaible was the greatest chips of both side, the Zhengs!\\n\\n “Know what I’m thinking now?” Xuan looked at the two before him as he said indifferently. With a flick of his hands, two Gauss pistols fell into them. He then began to take the initial stances of gun-kata. \\n\\n “The squad’s battle? That’s my gift in return for the Jade Disc of Creation. Although I don\u0027t know what instructions you gave them, but they won\u0027t be able to get far from there before our battle ends if they have to eliminate team Celestial and face all the secondary combat force members of team Devil I deployed. Together with the virus you released, I have reason to believe… that these cannon fodder are all going to die. This final battle… shall be decided by us!”\\n\\n The clone Xuan’s gave a flick of his hands as he spoke as well, causing two guns to land in his hands as well. He made the exact same initial stances of gun-kata Xuan made, looking like an identical mirror image of Xuan apart from clothes.\\n\\n “You truly have lost. My clone, you’re merely treating the secondary combat force as cannon fodder? You really have lost.”\\n\\n “Past experience shapes thinking. That’s what I’m thinking now.”\\n\\n Xuan shut his eyes. When they opened once again, they were filled with fervent passion. Then, he pulled the trigger on the two before him.\\n\\n Past experience shaped one’s thinking. Two same people under two utterly different environments, had become two people that couldn\u0027t be anymore different…\\n\\n ***\\n\\n Clone Xuan hadn’t informed the other four about team China’s arrival. Apart from Zhang Xiaoxue who knew what was going on through the Godseal Board, the four were all in the dark. They were clone Yanwei and clone Hao Tian, as well as two others team China had never encountered before. One was a man carrying an ancient sword and another was a girl in a traditional Chinese clothes.\\n\\n Their reaction was speedy and they had abruptly already dispersed in all directions. Unfortunately, they weren\u0027t able to determine what had happened without a psyche force user nearby to link their minds. It was only when the four had burst out of the warehouse that they seriously took a look at the four from team China.\\n\\n (What is Xuan thinking? He first sent away people in two waves, then left us to stand guard here. Is he conspiring to abandon us?) The four thought inwardly.\\n\\n However, upon team China’s appearance, two amongst them had their eyes flash. One was clone Yanwei who stared dead at Heng, while the other was the man carrying an ancient sword who stared dead at Luo Yinglong.\\n\\n People of Heng and Luo Yinglong’s level were extremely sensitive to killing intent. As a long range archer, Heng’s perceptiveness was instinctual. Luo Yinglong was a Nascent Soul Cultivator, so his perceptiveness naturally didn\u0027t need to be said. When two stares locked onto them, the two quickly fled into the densely packed tall buildings at their side. The other two, Cheng Xiao and Imhotep were briefly stunned, before one used Nanto Suicho Ken to flee while the other transformed into a sandstorm and vanished.\\n\\n (Heng…) Clone Yanwei’s eyes were completely bloodshot, as if blood was about to flow from it any moment. \\n\\n She muttered something to herself as she looked at the direction Heng was headed in.\\n\\n She picked up a shining white bow next to her, before launching an energy arrow in to the sky. The arrow flew over a hundred metres into the sky, before exploding into a flower of shining white energy. It was at this point she followed in hot pursuit of Heng, entering the vast region of buildings as well.\\n\\n The other three stayed quietly at their spots. Although they didn\u0027t have a way to communicate now, they all had their own unique ways of battling, cooperating, surviving and communicating when in adverse circumstances. The arrow clone Yanwei had fired represented that she had found her prey, and a personal declaration that it was her prey alone. If any other members interfered… they would face two enemies, clone Yanwei as well as the member of team China.\\n\\n (There’s someone other than that pervert Zhao Zhuikong who would use a personal declaration?)\\n\\n The three were astonished. It had to be known that this personal declaration meant that the person wouldn’t stop until either that person or the enemy died. This even included challenges against other team members. As a team with the law of the jungle, members had be more powerful, vicious and terrifying than anyone else to survive. \\n\\n The team didn’t stop infighting outside of clone Xuan’s schemes. For example, Zhao Zhuikong would use the personal declaration to continuously expunge several powerful people who newly entered team Devil. He would expunge them, not kill them. Likely, their greatest wish before dying was to be able to die.\\n\\n This remaining three weren\u0027t strong combatants who had only just entered, or rookies who only looked strong on the outside but were actually weak. They were all the main combat force of team Devil, and all had a deep understanding of clone Yanwei’s strength. They naturally wouldn\u0027t do something dumb like disturbing their own people in this decisive final battle with team China. They had a more important job to do, namely the remaining three from team China.\\n\\n The man with a sword sucked in a breath sharply, before tossing out the sword to let it hover in the air, giving a long shout towards the sky as he did so. Instead of emitting the azure colour it naturally had, it instead let out an ash coloured light. He stepped on it and flew off.\\n\\n “Two left.” The two left from team Devil, Hao Tian and the girl wearing traditional Chinese clothes muttered to themselves. They knew the man carrying a sword definitely chose Luo Yinglong who had just joined team China. Then, two were left in team China...\\n\\n (What’s left will depend on Xuan.)\\n\\n The two looked silently at the warehouse. The one ranked second in team Devil was battling there. Perhaps, his power was enough to even challenge clone Zheng after obtaining the Godseal Board…\\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-23-chapter-15-2","bookId":1512,"book":{"id":1512,"title":"Terror Infinity","description":"“Want to know the meaning of life? Want to live… a real life?” \\n The world shall change when you click YES. \\n In God’s dimension, you have to keep getting stronger, keep evolving to survive the never-ending horror movies. \\n Will you kill everyone in your way to reach the end as a lone king? Or fight along with your comrades and survive through the support of friends? Everything is just for staying alive, until you find the secret of God’s dimension. \\n Who is the true enemy?\\n","cover":"http://cunovel.com/img/TI.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/terror-infinity","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:21 AM"}}
