{"id":7414,"no":35,"title":"Part 3 Chapter 7","content":"\"I HAD a small pocket pistol. I had procured it while still a boy, at that droll age when the stories of duels and highwaymen begin to delight one, and when one imagines oneself nobly standing fire at some future day, in a duel.\n \"There were a couple of old bullets in the bag which contained the pistol, and powder enough in an old flask for two or three charges.\n \"The pistol was a wretched thing, very crooked and wouldn\u0027t carry farther than fifteen paces at the most. However, it would send your skull flying well enough if you pressed the muzzle of it against your temple.\n \"I determined to die at Pavlofsk at sunrise, in the park--so as to make no commotion in the house.\n \"This \u0027explanation\u0027 will make the matter clear enough to the police. Students of psychology, and anyone else who likes, may make what they please of it. I should not like this paper, however, to be made public. I request the prince to keep a copy himself, and to give a copy to Aglaya Ivanovna Epanchin. This is my last will and testament. As for my skeleton, I bequeath it to the Medical Academy for the benefit of science.\n \"I recognize no jurisdiction over myself, and I know that I am now beyond the power of laws and judges.\n \"A little while ago a very amusing idea struck me. What if I were now to commit some terrible crime--murder ten fellow-creatures, for instance, or anything else that is thought most shocking and dreadful in this world--what a dilemma my judges would be in, with a criminal who only has a fortnight to live in any case, now that the rack and other forms of torture are abolished! Why, I should die comfortably in their own hospital--in a warm, clean room, with an attentive doctor--probably much more comfortably than I should at home.\n \"I don\u0027t understand why people in my position do not oftener indulge in such ideas--if only for a joke! Perhaps they do! Who knows! There are plenty of merry souls among us!\n \"But though I do not recognize any jurisdiction over myself, still I know that I shall be judged, when I am nothing but a voiceless lump of clay; therefore I do not wish to go before I have left a word of reply--the reply of a free man--not one forced to justify himself--oh no! I have no need to ask forgiveness of anyone. I wish to say a word merely because I happen to desire it of my own free will.\n \"Here, in the first place, comes a strange thought!\n \"Who, in the name of what Law, would think of disputing my full personal right over the fortnight of life left to me? What jurisdiction can be brought to bear upon the case? Who would wish me, not only to be sentenced, but to endure the sentence to the end? Surely there exists no man who would wish such a thing--why should anyone desire it? For the sake of morality? Well, I can understand that if I were to make an attempt upon my own life while in the enjoyment of full health and vigour--my life which might have been \u0027useful,\u0027 etc., etc.--morality might reproach me, according to the old routine, for disposing of my life without permission--or whatever its tenet may be. But now, NOW, when my sentence is out and my days numbered! How can morality have need of my last breaths, and why should I die listening to the consolations offered by the prince, who, without doubt, would not omit to demonstrate that death is actually a benefactor to me? (Christians like him always end up with that--it is their pet theory.) And what do they want with their ridiculous \u0027Pavlofsk trees\u0027? To sweeten my last hours? Cannot they understand that the more I forget myself, the more I let myself become attached to these last illusions of life and love, by means of which they try to hide from me Meyer\u0027s wall, and all that is so plainly written on it--the more unhappy they make me? What is the use of all your nature to me--all your parks and trees, your sunsets and sunrises, your blue skies and your self-satisfied faces--when all this wealth of beauty and happiness begins with the fact that it accounts me--only me--one too many! What is the good of all this beauty and glory to me, when every second, every moment, I cannot but be aware that this little fly which buzzes around my head in the sun\u0027s rays--even this little fly is a sharer and participator in all the glory of the universe, and knows its place and is happy in it;--while I--only I, am an outcast, and have been blind to the fact hitherto, thanks to my simplicity! Oh! I know well how the prince and others would like me, instead of indulging in all these wicked words of my own, to sing, to the glory and triumph of morality, that well-known verse of Gilbert\u0027s:\n \"\u00270, puissent voir longtemps votre beaute sacree Tant d\u0027amis, sourds a mes adieux! Qu\u0027ils meurent pleins de jours, que leur mort soit pleuree, Qu\u0027un ami leur ferme les yeux!\u0027\n \"But believe me, believe me, my simple-hearted friends, that in this highly moral verse, in this academical blessing to the world in general in the French language, is hidden the intensest gall and bitterness; but so well concealed is the venom, that I dare say the poet actually persuaded himself that his words were full of the tears of pardon and peace, instead of the bitterness of disappointment and malice, and so died in the delusion.\n \"Do you know there is a limit of ignominy, beyond which man\u0027s consciousness of shame cannot go, and after which begins satisfaction in shame? Well, of course humility is a great force in that sense, I admit that--though not in the sense in which religion accounts humility to be strength!\n \"Religion!--I admit eternal life--and perhaps I always did admit it.\n \"Admitted that consciousness is called into existence by the will of a Higher Power; admitted that this consciousness looks out upon the world and says \u0027I am;\u0027 and admitted that the Higher Power wills that the consciousness so called into existence, be suddenly extinguished (for so--for some unexplained reason--it is and must be)--still there comes the eternal question--why must I be humble through all this? Is it not enough that I am devoured, without my being expected to bless the power that devours me? Surely--surely I need not suppose that Somebody--there--will be offended because I do not wish to live out the fortnight allowed me? I don\u0027t believe it.\n \"It is much simpler, and far more likely, to believe that my death is needed--the death of an insignificant atom--in order to fulfil the general harmony of the universe--in order to make even some plus or minus in the sum of existence. Just as every day the death of numbers of beings is necessary because without their annihilation the rest cannot live on--(although we must admit that the idea is not a particularly grand one in itself!)\n \"However--admit the fact! Admit that without such perpetual devouring of one another the world cannot continue to exist, or could never have been organized--I am ever ready to confess that I cannot understand why this is so--but I\u0027ll tell you what I DO know, for certain. If I have once been given to understand and realize that I AM--what does it matter to me that the world is organized on a system full of errors and that otherwise it cannot be organized at all? Who will or can judge me after this? Say what you like--the thing is impossible and unjust!\n \"And meanwhile I have never been able, in spite of my great desire to do so, to persuade myself that there is no future existence, and no Providence.\n \"The fact of the matter is that all this DOES exist, but that we know absolutely nothing about the future life and its laws!\n \"But it is so difficult, and even impossible to understand, that surely I am not to be blamed because I could not fathom the incomprehensible?\n \"Of course I know they say that one must be obedient, and of course, too, the prince is one of those who say so: that one must be obedient without questions, out of pure goodness of heart, and that for my worthy conduct in this matter I shall meet with reward in another world. We degrade God when we attribute our own ideas to Him, out of annoyance that we cannot fathom His ways.\n \"Again, I repeat, I cannot be blamed because I am unable to understand that which it is not given to mankind to fathom. Why am I to be judged because I could not comprehend the Will and Laws of Providence? No, we had better drop religion.\n \"And enough of this. By the time I have got so far in the reading of my document the sun will be up and the huge force of his rays will be acting upon the living world. So be it. I shall die gazing straight at the great Fountain of life and power; I do not want this life!\n \"If I had had the power to prevent my own birth I should certainly never have consented to accept existence under such ridiculous conditions. However, I have the power to end my existence, although I do but give back days that are already numbered. It is an insignificant gift, and my revolt is equally insignificant.\n \"Final explanation: I die, not in the least because I am unable to support these next three weeks. Oh no, I should find strength enough, and if I wished it I could obtain consolation from the thought of the injury that is done me. But I am not a French poet, and I do not desire such consolation. And finally, nature has so limited my capacity for work or activity of any kind, in allotting me but three weeks of time, that suicide is about the only thing left that I can begin and end in the time of my own free will.\n \"Perhaps then I am anxious to take advantage of my last chance of doing something for myself. A protest is sometimes no small thing.\"\n The explanation was finished; Hippolyte paused at last.\n There is, in extreme cases, a final stage of cynical candour when a nervous man, excited, and beside himself with emotion, will be afraid of nothing and ready for any sort of scandal, nay, glad of it. The extraordinary, almost unnatural, tension of the nerves which upheld Hippolyte up to this point, had now arrived at this final stage. This poor feeble boy of eighteen--exhausted by disease--looked for all the world as weak and frail as a leaflet torn from its parent tree and trembling in the breeze; but no sooner had his eye swept over his audience, for the first time during the whole of the last hour, than the most contemptuous, the most haughty expression of repugnance lighted up his face. He defied them all, as it were. But his hearers were indignant, too; they rose to their feet with annoyance. Fatigue, the wine consumed, the strain of listening so long, all added to the disagreeable impression which the reading had made upon them.\n Suddenly Hippolyte jumped up as though he had been shot.\n \"The sun is rising,\" he cried, seeing the gilded tops of the trees, and pointing to them as to a miracle. \"See, it is rising now!\"\n \"Well, what then? Did you suppose it wasn\u0027t going to rise?\" asked Ferdishenko.\n \"It\u0027s going to be atrociously hot again all day,\" said Gania, with an air of annoyance, taking his hat. \"A month of this... Are you coming home, Ptitsin?\" Hippolyte listened to this in amazement, almost amounting to stupefaction. Suddenly he became deadly pale and shuddered.\n \"You manage your composure too awkwardly. I see you wish to insult me,\" he cried to Gania. \"You--you are a cur!\" He looked at Gania with an expression of malice.\n \"What on earth is the matter with the boy? What phenomenal feeble-mindedness!\" exclaimed Ferdishenko.\n \"Oh, he\u0027s simply a fool,\" said Gania.\n Hippolyte braced himself up a little.\n \"I understand, gentlemen,\" he began, trembling as before, and stumbling over every word,\" that I have deserved your resentment, and--and am sorry that I should have troubled you with this raving nonsense\" (pointing to his article),\"or rather, I am sorry that I have not troubled you enough.\" He smiled feebly. \"Have I troubled you, Evgenie Pavlovitch?\" He suddenly turned on Evgenie with this question. \"Tell me now, have I troubled you or not?\"\n \"Well, it was a little drawn out, perhaps; but--\"\n \"Come, speak out! Don\u0027t lie, for once in your life--speak out!\" continued Hippolyte, quivering with agitation.\n \"Oh, my good sir, I assure you it\u0027s entirely the same to me. Please leave me in peace,\" said Evgenie, angrily, turning his back on him.\n \"Good-night, prince,\" said Ptitsin, approaching his host.\n \"What are you thinking of? Don\u0027t go, he\u0027ll blow his brains out in a minute!\" cried Vera Lebedeff, rushing up to Hippolyte and catching hold of his hands in a torment of alarm. \"What are you thinking of? He said he would blow his brains out at sunrise.\"\n \"Oh, he won\u0027t shoot himself!\" cried several voices, sarcastically.\n \"Gentlemen, you\u0027d better look out,\" cried Colia, also seizing Hippolyte by the hand. \"Just look at him! Prince, what are you thinking of?\" Vera and Colia, and Keller, and Burdovsky were all crowding round Hippolyte now and holding him down.\n \"He has the right--the right--\"-murmured Burdovsky. \"Excuse me, prince, but what are your arrangements?\" asked Lebedeff, tipsy and exasperated, going up to Muishkin.\n \"What do you mean by \u0027arrangements\u0027?\"\n \"No, no, excuse me! I\u0027m master of this house, though I do not wish to lack respect towards you. You are master of the house too, in a way; but I can\u0027t allow this sort of thing--\"\n \"He won\u0027t shoot himself; the boy is only playing the fool,\" said General Ivolgin, suddenly and unexpectedly, with indignation.\n \"I know he won\u0027t, I know he won\u0027t, general; but I--I\u0027m master here!\"\n \"Listen, Mr. Terentieff,\" said Ptitsin, who had bidden the prince good-night, and was now holding out his hand to Hippolyte; \"I think you remark in that manuscript of yours, that you bequeath your skeleton to the Academy. Are you referring to your own skeleton--I mean, your very bones?\"\n \"Yes, my bones, I--\"\n \"Quite so, I see; because, you know, little mistakes have occurred now and then. There was a case--\"\n Why do you tease him?\" cried the prince, suddenly.\n \"You\u0027ve moved him to tears,\" added Ferdishenko. But Hippolyte was by no means weeping. He was about to move from his place, when his four guards rushed at him and seized him once more. There was a laugh at this.\n \"He led up to this on purpose. He took the trouble of writing all that so that people should come and grab him by the arm,\" observed Rogojin. \"Good-night, prince. What a time we\u0027ve sat here, my very bones ache!\"\n \"If you really intended to shoot yourself, Terentieff,\" said Evgenie Pavlovitch, laughing, \"if I were you, after all these compliments, I should just not shoot myself in order to vex them all.\"\n \"They are very anxious to see me blow my brains out,\" said Hippolyte, bitterly.\n \"Yes, they\u0027ll be awfully annoyed if they don\u0027t see it.\"\n \"Then you think they won\u0027t see it?\"\n \"I am not trying to egg you on. On the contrary, I think it very likely that you may shoot yourself; but the principal thing is to keep cool,\" said Evgenie with a drawl, and with great condescension.\n \"I only now perceive what a terrible mistake I made in reading this article to them,\" said Hippolyte, suddenly, addressing Evgenie, and looking at him with an expression of trust and confidence, as though he were applying to a friend for counsel.\n \"Yes, it\u0027s a droll situation; I really don\u0027t know what advice to give you,\" replied Evgenie, laughing. Hippolyte gazed steadfastly at him, but said nothing. To look at him one might have supposed that he was unconscious at intervals.\n \"Excuse me,\" said Lebedeff, \"but did you observe the young gentleman\u0027s style? \u0027I\u0027ll go and blow my brains out in the park,\u0027 says he,\u0027 so as not to disturb anyone.\u0027 He thinks he won\u0027t disturb anybody if he goes three yards away, into the park, and blows his brains out there.\"\n \"Gentlemen--\" began the prince.\n \"No, no, excuse me, most revered prince,\" Lebedeff interrupted, excitedly. \"Since you must have observed yourself that this is no joke, and since at least half your guests must also have concluded that after all that has been said this youth MUST blow his brains out for honour\u0027s sake--I--as master of this house, and before these witnesses, now call upon you to take steps.\"\n \"Yes, but what am I to do, Lebedeff? What steps am I to take? I am ready.\"\n \"I\u0027ll tell you. In the first place he must immediately deliver up the pistol which he boasted of, with all its appurtenances. If he does this I shall consent to his being allowed to spend the night in this house--considering his feeble state of health, and of course conditionally upon his being under proper supervision. But tomorrow he must go elsewhere. Excuse me, prince! Should he refuse to deliver up his weapon, then I shall instantly seize one of his arms and General Ivolgin the other, and we shall hold him until the police arrive and take the matter into their own hands. Mr. Ferdishenko will kindly fetch them.\"\n At this there was a dreadful noise; Lebedeff danced about in his excitement; Ferdishenko prepared to go for the police; Gania frantically insisted that it was all nonsense, \"for nobody was going to shoot themselves.\" Evgenie Pavlovitch said nothing.\n \"Prince,\" whispered Hippolyte, suddenly, his eyes all ablaze, \"you don\u0027t suppose that I did not foresee all this hatred?\" He looked at the prince as though he expected him to reply, for a moment. \"Enough!\" he added at length, and addressing the whole company, he cried: \"It\u0027s all my fault, gentlemen! Lebedeff, here\u0027s the key,\" (he took out a small bunch of keys); \"this one, the last but one--Colia will show you--Colia, where\u0027s Colia?\" he cried, looking straight at Colia and not seeing him. \"Yes, he\u0027ll show you; he packed the bag with me this morning. Take him up, Colia; my bag is upstairs in the prince\u0027s study, under the table. Here\u0027s the key, and in the little case you\u0027ll find my pistol and the powder, and all. Colia packed it himself, Mr. Lebedeff; he\u0027ll show you; but it\u0027s on condition that tomorrow morning, when I leave for Petersburg, you will give me back my pistol, do you hear? I do this for the prince\u0027s sake, not yours.\"\n \"Capital, that\u0027s much better!\" cried Lebedeff, and seizing the key he made off in haste.\n Colia stopped a moment as though he wished to say something; but Lebedeff dragged him away.\n Hippolyte looked around at the laughing guests. The prince observed that his teeth were chattering as though in a violent attack of ague.\n \"What brutes they all are!\" he whispered to the prince. Whenever he addressed him he lowered his voice.\n \"Let them alone, you\u0027re too weak now--\"\n Yes, directly; I\u0027ll go away directly. I\u0027ll--\"\n Suddenly he embraced Muishkin.\n \"Perhaps you think I am mad, eh?\" he asked him, laughing very strangely.\n \"No, but you--\"\n \"Directly, directly! Stand still a moment, I wish to look in your eyes; don\u0027t speak--stand so--let me look at you! I am bidding farewell to mankind.\"\n He stood so for ten seconds, gazing at the prince, motionless, deadly pale, his temples wet with perspiration; he held the prince\u0027s hand in a strange grip, as though afraid to let him go.\n \"Hippolyte, Hippolyte, what is the matter with you?\" cried Muishkin.\n \"Directly! There, that\u0027s enough. I\u0027ll lie down directly. I must drink to the sun\u0027s health. I wish to--I insist upon it! Let go!\"\n He seized a glass from the table, broke away from the prince, and in a moment had reached the terrace steps.\n Keller insisted afterwards that he had held his right hand in his pocket all the while, when he was speaking to the prince, and that he had held the latter\u0027s shoulder with his left hand only. This circumstance, Keller affirmed, had led him to feel some suspicion from the first. However this may be, Keller ran after Hippolyte, but he was too late.\n He caught sight of something flashing in Hippolyte\u0027s right hand, and saw that it was a pistol. He rushed at him, but at that very instant Hippolyte raised the pistol to his temple and pulled the trigger. There followed a sharp metallic click, but no report.\n When Keller seized the would-be suicide, the latter fell forward into his arms, probably actually believing that he was shot. Keller had hold of the pistol now. Hippolyte was immediately placed in a chair, while the whole company thronged around excitedly, talking and asking each other questions. Every one of them had heard the snap of the trigger, and yet they saw a live and apparently unharmed man before them.\n Hippolyte himself sat quite unconscious of what was going on, and gazed around with a senseless expression.\n Lebedeff and Colia came rushing up at this moment.\n \"What is it?\" someone asked, breathlessly--\"A misfire?\"\n \"Perhaps it wasn\u0027t loaded,\" said several voices.\n \"It\u0027s loaded all right,\" said Keller, examining the pistol, \"but--\"\n \"What! did it miss fire?\"\n \"There was no cap in it,\" Keller announced.\n It would be difficult to describe the pitiable scene that now followed. The first sensation of alarm soon gave place to amusement; some burst out laughing loud and heartily, and seemed to find a malicious satisfaction in the joke. Poor Hippolyte sobbed hysterically; he wrung his hands; he approached everyone in turn--even Ferdishenko--and took them by both hands, and swore solemnly that he had forgotten--absolutely forgotten-- \"accidentally, and not on purpose,\"--to put a cap in--that he \"had ten of them, at least, in his pocket.\" He pulled them out and showed them to everyone; he protested that he had not liked to put one in beforehand for fear of an accidental explosion in his pocket. That he had thought he would have lots of time to put it in afterwards--when required--and, that, in the heat of the moment, he had forgotten all about it. He threw himself upon the prince, then on Evgenie Pavlovitch. He entreated Keller to give him back the pistol, and he\u0027d soon show them all that \"his honour--his honour,\"--but he was \"dishonoured, now, for ever!\"\n He fell senseless at last--and was carried into the prince\u0027s study.\n Lebedeff, now quite sobered down, sent for a doctor; and he and his daughter, with Burdovsky and General Ivolgin, remained by the sick man\u0027s couch.\n When he was carried away unconscious, Keller stood in the middle of the room, and made the following declaration to the company in general, in a loud tone of voice, with emphasis upon each word.\n \"Gentlemen, if any one of you casts any doubt again, before me, upon Hippolyte\u0027s good faith, or hints that the cap was forgotten intentionally, or suggests that this unhappy boy was acting a part before us, I beg to announce that the person so speaking shall account to me for his words.\"\n No one replied.\n The company departed very quickly, in a mass. Ptitsin, Gania, and Rogojin went away together.\n The prince was much astonished that Evgenie Pavlovitch changed his mind, and took his departure without the conversation he had requested.\n \"Why, you wished to have a talk with me when the others left?\" he said.\n \"Quite so,\" said Evgenie, sitting down suddenly beside him, \"but I have changed my mind for the time being. I confess, I am too disturbed, and so, I think, are you; and the matter as to which I wished to consult you is too serious to tackle with one\u0027s mind even a little disturbed; too serious both for myself and for you. You see, prince, for once in my life I wish to perform an absolutely honest action, that is, an action with no ulterior motive; and I think I am hardly in a condition to talk of it just at this moment, and--and--well, we\u0027ll discuss it another time. Perhaps the matter may gain in clearness if we wait for two or three days--just the two or three days which I must spend in Petersburg.\"\n Here he rose again from his chair, so that it seemed strange that he should have thought it worth while to sit down at all.\n The prince thought, too, that he looked vexed and annoyed, and not nearly so friendly towards himself as he had been earlier in the night.\n \"I suppose you will go to the sufferer\u0027s bedside now?\" he added.\n \"Yes, I am afraid...\" began the prince.\n \"Oh, you needn\u0027t fear! He\u0027ll live another six weeks all right. Very likely he will recover altogether; but I strongly advise you to pack him off tomorrow.\"\n \"I think I may have offended him by saying nothing just now. I am afraid he may suspect that I doubted his good faith,--about shooting himself, you know. What do you think, Evgenie Pavlovitch?\"\n \"Not a bit of it! You are much too good to him; you shouldn\u0027t care a hang about what he thinks. I have heard of such things before, but never came across, till tonight, a man who would actually shoot himself in order to gain a vulgar notoriety, or blow out his brains for spite, if he finds that people don\u0027t care to pat him on the back for his sanguinary intentions. But what astonishes me more than anything is the fellow\u0027s candid confession of weakness. You\u0027d better get rid of him tomorrow, in any case.\n \"Do you think he will make another attempt?\"\n \"Oh no, not he, not now! But you have to be very careful with this sort of gentleman. Crime is too often the last resource of these petty nonentities. This young fellow is quite capable of cutting the throats of ten people, simply for a lark, as he told us in his \u0027explanation.\u0027 I assure you those confounded words of his will not let me sleep.\"\n \"I think you disturb yourself too much.\"\n \"What an extraordinary person you are, prince! Do you mean to say that you doubt the fact that he is capable of murdering ten men?\"\n \"I daren\u0027t say, one way or the other; all this is very strange-- but--\"\n \"Well, as you like, just as you like,\" said Evgenie Pavlovitch, irritably. \"Only you are such a plucky fellow, take care you don\u0027t get included among the ten victims!\"\n \"Oh, he is much more likely not to kill anyone at all,\" said the prince, gazing thoughtfully at Evgenie. The latter laughed disagreeably.\n \"Well, au revoir! Did you observe that he \u0027willed\u0027 a copy of his confession to Aglaya Ivanovna?\"\n \"Yes, I did; I am thinking of it.\"\n \"In connection with \u0027the ten,\u0027 eh?\" laughed Evgenie, as he left the room.\n An hour later, towards four o\u0027clock, the prince went into the park. He had endeavoured to fall asleep, but could not, owing to the painful beating of his heart.\n He had left things quiet and peaceful; the invalid was fast asleep, and the doctor, who had been called in, had stated that there was no special danger. Lebedeff, Colia, and Burdovsky were lying down in the sick-room, ready to take it in turns to watch. There was nothing to fear, therefore, at home.\n But the prince\u0027s mental perturbation increased every moment. He wandered about the park, looking absently around him, and paused in astonishment when he suddenly found himself in the empty space with the rows of chairs round it, near the Vauxhall. The look of the place struck him as dreadful now: so he turned round and went by the path which he had followed with the Epanchins on the way to the band, until he reached the green bench which Aglaya had pointed out for their rendezvous. He sat down on it and suddenly burst into a loud fit of laughter, immediately followed by a feeling of irritation. His disturbance of mind continued; he felt that he must go away somewhere, anywhere.\n Above his head some little bird sang out, of a sudden; he began to peer about for it among the leaves. Suddenly the bird darted out of the tree and away, and instantly he thought of the \"fly buzzing about in the sun\u0027s rays\" that Hippolyte had talked of; how that it knew its place and was a participator in the universal life, while he alone was an \"outcast.\" This picture had impressed him at the time, and he meditated upon it now. An old, forgotten memory awoke in his brain, and suddenly burst into clearness and light. It was a recollection of Switzerland, during the first year of his cure, the very first months. At that time he had been pretty nearly an idiot still; he could not speak properly, and had difficulty in understanding when others spoke to him. He climbed the mountain-side, one sunny morning, and wandered long and aimlessly with a certain thought in his brain, which would not become clear. Above him was the blazing sky, below, the lake; all around was the horizon, clear and infinite. He looked out upon this, long and anxiously. He remembered how he had stretched out his arms towards the beautiful, boundless blue of the horizon, and wept, and wept. What had so tormented him was the idea that he was a stranger to all this, that he was outside this glorious festival.\n What was this universe? What was this grand, eternal pageant to which he had yearned from his childhood up, and in which he could never take part? Every morning the same magnificent sun; every morning the same rainbow in the waterfall; every evening the same glow on the snow-mountains.\n Every little fly that buzzed in the sun\u0027s rays was a singer in the universal chorus, \"knew its place, and was happy in it. \"Every blade of grass grew and was happy. Everything knew its path and loved it, went forth with a song and returned with a song; only he knew nothing, understood nothing, neither men nor words, nor any of nature\u0027s voices; he was a stranger and an outcast.\n Oh, he could not then speak these words, or express all he felt! He had been tormented dumbly; but now it appeared to him that he must have said these very words--even then--and that Hippolyte must have taken his picture of the little fly from his tears and words of that time.\n He was sure of it, and his heart beat excitedly at the thought, he knew not why.\n He fell asleep on the bench; but his mental disquiet continued through his slumbers.\n Just before he dozed off, the idea of Hippolyte murdering ten men flitted through his brain, and he smiled at the absurdity of such a thought.\n Around him all was quiet; only the flutter and whisper of the leaves broke the silence, but broke it only to cause it to appear yet more deep and still.\n He dreamed many dreams as he sat there, and all were full of disquiet, so that he shuddered every moment.\n At length a woman seemed to approach him. He knew her, oh! he knew her only too well. He could always name her and recognize her anywhere; but, strange, she seemed to have quite a different face from hers, as he had known it, and he felt a tormenting desire to be able to say she was not the same woman. In the face before him there was such dreadful remorse and horror that he thought she must be a criminal, that she must have just committed some awful crime.\n Tears were trembling on her white cheek. She beckoned him, but placed her finger on her lip as though to warn him that he must follow her very quietly. His heart froze within him. He wouldn\u0027t, he COULDN\u0027T confess her to be a criminal, and yet he felt that something dreadful would happen the next moment, something which would blast his whole life.\n She seemed to wish to show him something, not far off, in the park.\n He rose from his seat in order to follow her, when a bright, clear peal of laughter rang out by his side. He felt somebody\u0027s hand suddenly in his own, seized it, pressed it hard, and awoke. Before him stood Aglaya, laughing aloud.\n \n 我有一支袖珍小手枪，在我还是个孩子的时候，我就开始玩这东西了，那是一个可笑的年龄，会开始喜欢有关决斗、强盗袭击的故事，想象着有人向我挑起决斗，我又怎么气字轩昂地面对对方的枪口。在放小手枪的抽屉里还找到了两颗子弹，而在角制火药筒里则有够装三发的火药。这把手枪很糟糕，打出去的子弹总是偏离的，射程总共才１５步；但是，如果紧贴着太阳穴开枪，当然是能叫头颅搬家的。\n 我打算在帕夫洛夫斯克日出时去公园里死，这样可以不会惊动别墅里的任何人。我的《解释》足以向警方说明全部情况。爱好心理学的人以及有必要了解的人会从中得出他们愿意得出的结论，但是，我不愿意将这份手稿公之于众。我请求公爵保留一份在自己那里，另一份交给阿格拉娅·伊万诺夫娜·叶潘钦娜。这是我的意愿。我把我的骨骼遗赠给医学院以利于科学研究。\n 我不承认要对我进行审判的法官，我知道，我现在不受法庭的任何约束。还是不久前有个提议令我棒腹大笑：假若我突然想起现在要杀死随便哪个人，哪怕一下子杀死十个人，或者做什么被认为是这个世界上最可怕的事，在废除了体罚和肉刑的情况下，面对我这么一个只能活两三个星期的人，法庭会陷于何种尴尬的境地？我会在他们医院里受到医生的悉心治疗，会舒舒服服，暖暖和和地死去，也许，比在自己家里还舒服、暖和得多。我不明白，处在我这样状况的人怎么想不到这样的念头，哪怕仅仅是为了开个玩笑？不过，也许想到了；即使在我们中间也能找到许多寻开心的人。\n 但是，即使我不承认对我进行审判，我还是知道我会受到审判的，那时我已是一个又聋又哑的被告人。我不想不留一句答词就离开人世，我的答词是自由的而不是被迫作出的，也不是为了辩护，－－哦，不！我无须向谁请求宽恕，也没有什么要请求宽恕，--就因为我自己愿意这样做。\n 首先，这里有一个奇怪的思想：谁会想出来现在对我享有二三周生命期限的权利提出异议？凭什么？出于什么动机？这又关法庭什么事？究竟谁需要让我不仅仅判刑，而且还要乖乖地服满刑期？难道真的有人需要这样？是为了道德？我迂明白，假如我在身强力壮、风华正茂的时候加害于自己的生命，而它“本来是能有益于我亲近的人的”等等，那么按照陈腐的因循守旧的观念，道德还是会谴责我擅自处理自己的生命，或者什么它自己才知道的罪名。但是现在，在已经对我宣读了刑期的现在呢？除了您的生命之外，哪一种道德还需要您交出生命的最后一个原子时发生的最后一声嘶哑的感叹？而那时您还在倾听公爵的安慰，他用自己的基督精神来论证，一定会得出一个幸福的思想：实际上您死去甚至更好。（像他这样的基督教徒总是会接受这种思想的，这是他们老生常谈的话题。）他们讲那些可笑的“帕夫洛夫斯克的树木”想干什么？是想使我生命的最后时辰减轻痛苦？他们想用生命和爱的幻影来遮挡我的梅那罗夫墙和那上面所写的坦诚纯朴的一切，难道他们不明白，我越是想忘怀，越是沉缅于这最后幻影，他们就越使我不幸？整个这不散的筵席从一开始就认为唯独我是多余的人，那么你们的自然，你们的帕夫洛夫斯克公园，你们的日出日落，你们的蔚蓝的天空和你们的万事满意的脸庞，对于我来说又有何用呢？所有这一切美景对我来说又有什么意义？我现在每分每秒应该也必须知道，甚至现在沐浴着阳光、在我身边嗡嗡叫的这只小小的苍蝇，也是这场筵席和合唱的参加者，也知道自己的地位，并热爱自己的这一席之地和感到幸福，而唯独我一人是个被人唾弃的人，仅仅因为我的怯懦畏缩。才至今还不明白这一点！哦，我可是知道的，公爵和他们大伙儿多么想把我引向那一步：使我不讲所有这些“狡猾和恶毒的”话，而出于品行端正和为了道德的胜利来吟唱一节米尔瓦的经典名诗：\n Ｏ，ｐｕｉｓｓｅｎｔ ｖｏｌｒ ｖｏｔｒｅ ｂｅａｕｔｅ ｓａｃｒｅｅ　　Ｔａｎｔ　ｄ’ａｍｉｓ ｓｏｕｄｓ ａ ｍｅｓ ａｄｉｅｗ！　　Ｑｕｉｌｓ ｍｅｕｒｅｎｔ ｐｅｉｎｓ ｄｅ ｊｏｕｒｓ，ｑｕｅ ｌｅｕｒ ｍｏｒｔ ｓｏｉｔ ｐｌｅｕｒｅｅ，　　Ｑｄ’ｕｎ ａｍｉ ｌｅｕｒ ｆｅｒｍｅ ｌｅｓ ｙｅｕｘ！＊\n 但是请相信，天真纯朴的人们，请相信，就是在这节品格高尚的哀诗中，在这种用法语诗向世界表示的经院式祝福中，也潜藏着那么多隐蔽的痛苦，那么多不可调和、在韵律中自行缓解的怨恨，甚至诗人本人也许也会陷于窘境，把这种怨恨当作是平静的泪水，而且就这样死去；愿他的灵魂安息！要知道，意识到自己的微不足道和软弱无力这样的耻辱是有限度的，人已经不能超过这个限度，并且正是从这个极限开始在自己的耻辱中感受到巨大的满足……当然喏，在这个意义上顺忍是一种巨大的力量，我承认这一点，虽然这不是宗教把顺忍看做是力量那样一种含义。\n 宗教！我承认永恒的生命，也许，过去也一直承认的。就让最高意志的力量点燃意识，就让这意识环顾世界后说：“我存在着！”，就让这最高力量突然确定这意识消亡，因为那里为了某种需要就是这样安排的（甚至不做解释究竟为了什么），需要这样，就让它这样吧，我可以承认这一切，但是，终究仍然有一个永恒的问题：在这种情况下为了什么需要我的顺忍？难道不能就这么把我吃了而不要求我赞美把我吃了？难道那里真的有人会因为我不想继续活两个星期而生气？我不相信这一点；而且正确得多的假设是，这里需要我这微不足道的生命，一个原子的生命，不过是为了某种普遍的总体协调添加一分子，为了某个正和负，为了某种对比等等，等等，就像每天需要牺牲许许多多生物的生命一样，没有它们的死亡剩下的世界就不可能维持（虽然应该指出，这本身并不是很豁达的思想）。但是随它去吧！我同意，不然的话，也就是要是没有不断的彼此消亡，世界是怎么也不可能安排好的；我甚至愿意承认，对于这种安排我一点也不理解，但是有一点我肯定知道：既然已经让我意识到“我存在着”，那么世界安排得有错误，不然它就不能维持，这些还关我什么事？这以后谁会来指责我了为了什么指责我？随您怎么想，这一切是不可能的，不公平的。\n ＊哦，对我离世置若罔闻的朋友，但愿他们看见您神圣的美！但愿他们在暮年寿终正寝，但愿有人对他们的死哀位，但愿朋友为他们合上双眼。\n 然而，不管我怀有多大的愿望，我从来也不能设想没有未来的生命和天命。更确切些说，这一切是存在的，但我们对未来的生命及其规律丝毫不理解。但是，既然是这么困难、甚至完全不可能理解这一点，那么，难道我要对无力理喻这无法理解的事物负责吗？确实，他们说（当然，公爵也跟他们在一起），这件事上需要听从，需要不加反对地、唯唯诺诺地听从，在阴间一定会奖赏我的这种温顺。我们血于不能理解天命而烦恼，常常用我们的概念来解释它，因而就过分地贬低了它。但是我又要重复说，既然不可能理解它，那么也很难对不让人理解的东西负责，既然这样，又怎么能指责我不理解天命的真正意志和规律呢？不，最好还是撇下宗教不谈。\n 再说也已经谈够了，当我将谈到这里的时候，太阳一定已经升起，“在天空中发出轰响”，无穷宏伟的力量倾泻在普天之下。随它去吧！我将直接望着生命和力量的源泉而死去，我不想要这生命了！如果我有权不降生到世上来，我一定不会接受在这样嘲弄人的条件下生存，但是我还有权力死去，虽然我献出的已是屈指可数的日子。权力不大，所以造反也不大。\n 最后一点说明：我死完全不是因为不能承受这三个星期；哦，我有足够的力量，假若我愿意，那么光是意识到我听遭受的委屈就足以安慰了；但我不是法国诗人，也不想要这样的安慰。说到底，也是一种罪恶初诱惑：大自然限制我的活动到了这样的程度，只判给我三个星期的时间，也许，自杀是唯一一件我还能按照自己的意愿来得及开始和结束的，事，也好，也许我是想到用一下最后的可能性来办这件事？抗议有时不是一桩小事……”\n “解释”结尾了；伊波利特终于停下来了……\n 在极端情况下坦率可以达到恬不知耻至极的程度，当一个神经质的人受了刺激并失去自制力的时候，他已经什么都不怕，甚至准备闹出任何荒唐事来，还会为此而高兴；他会扑向人们，而同时自己则怀有一个模糊但坚定的目的，一分钟后一定要从钟楼上跳下去，以此一下子了结在这种情况下会有的一切困惑。逐渐降临的体力衰竭通常是这种状态的征兆。到目前为止一直支撑着伊波利特的异常的、不自然的紧张已经达到了最后阶段。这个１８岁的小年轻被疾病耗尽了元气，显得十分虚弱，就像从树上掉下来的一片颤抖的树叶；但是他刚刚来得及扫视自己的听众，--这是最近一小时内的第一次，--在他的目光和微笑中马上就流露出最高傲，最轻蔑和得罪人的厌恶神情。他急于向人们挑战，但听众十发气忿。大家懊恼地从桌旁站起来。发出一片响声。疲倦、香槟、紧张加剧了乱糟糟和仿佛是污秽的印象，如果可以这样形容的话。\n 突然伊波利特很快地从椅子上跳起来，犹如把他从座位上拉下来一样。\n “太阳出来了！”他看见闪耀着光芒的树梢呼叫起来，一边像指着奇迹一般指给公爵看，“出来了！”\n “您以为不会出来了还是怎么的？”费尔迪先科说。\n “又得炙烤一整天，”加尼亚手里拿着帽子，伸着懒腰，打着呵欠，漫不经心地烦恼地喃喃着，“这样干旱一个月怎么得了！我们走不走，普季岑？”\n 伊波利特听着，惊讶得呆如木鸡；突然他脸色白得可怕，全身颤抖着。\n “您很笨拙地做出您那种冷漠的样子来侮辱我，”他凝视着加尼亚，对他说，“您是个坏蛋！”\n “嘿，这真是鬼知道是怎么回事，这么放肆！”费尔先科喊了起来，“多么少见的体弱力衰！”\n “简直是傻瓜！”加尼亚说。\n 伊波利特勉强克制住自己。\n “我明白，诸位，”他开始说，一边仍然打着颤，每个字都断断续续地说出来。“我会遭到您个人的报复。……我很后悔用这些胡言（他指了下手稿）来折磨您，不过，我也后悔没有把您折磨死……（他愚蠢地笑了一下），折磨死了吧，叶甫盖尼·帕夫洛维奇？”他突然转向他问，“折磨死了没有？您说！”\n “有点冗长，不过……”\n “全都说出来！别撒谎，哪怕一生中就这一次！”伊波利特颤栗着，命令着。\n “哦，我根本就无所谓！对不起，请您让我安宁些吧，”叶甫盖尼·帕夫洛维奇厌恶地背转身去。\n “祝您安睡，公爵，”普季岑走近公爵说。\n “他马上就会开枪自杀的，你们怎么啦！瞧他！”维拉喊了一声，异常惊恐地冲向伊波利特，甚至抓住他的手，“他不是说过，太阳出来的时候就开枪自尽，你们怎么啦。”\n “他不会开枪自尽的！”有几个声音幸灾乐祸地低声说，其中也有加尼亚。\n “诸位，请小心！”科利亚也抓住伊波利特的一只手，喊道，“你们只看看他！公爵！公爵，您怎么啦！”\n 伊波利特身边围聚着维拉、科利亚，凯勒尔和布尔多夫斯基；四个人全都用手抓住他。\n “他有权利，有权利！……”布尔多夫斯基喃喃着，其实他也完全茫然失措。\n “请问，公爵，您有什么吩咐？”列别杰夫走近公爵，他醉醺醺、恶狠狠，一副无赖的样子。\n “什么吩咐？”\n “不；请允许我说；我是主人，虽然我并不想不尊重您。即使您也是主人，但我不愿意在我的房子里发生这样的事……就这样。”\n “他不会开枪自尽的；这小子在胡闹！”伊活尔京将军气忿而又过于自信地出人意料嚷着。\n “将军说得真不错！”费尔迪先科附和说。\n “我知道他不会开枪自杀，将军，万分尊敬的将军，但毕竟……因为我是这里的主人。”\n “听着，捷连季耶夫先生，”突然普季岑在跟公爵告别后把手递给了伊波利特，“您好像在自己的手稿里讲的您的骨胳，说要遗赠给科学院？您这是说的您的骨骼，您自己的，也就是说要遗赠自己的骨头？”\n “是的，我的骨头……”\n “这就好了。不然可能会弄错，据说，已经有过这样的事情。”\n “您干吗要招惹他。”公爵突然喊起来。\n “把人家眼泪都逗出来了，”费尔迪光科补了一句。\n 但伊波利特根本没有哭。他本想移动一下位置，但是围住他的四个人一下子突然抓住了他的手，响起了笑声。\n “他就是要别人抓住他的手，他读手稿就为这个目的，”罗戈任指出，“再见，公爵。唉，坐得大久了，骨头都疼了。”\n “捷连季耶夫，如果您真的想开枪自杀，”叶甫盖尼·帕夫洛维奇笑起来说，“如果我处于您的地位，在听了这样的恭维话后，就偏偏不自杀，气死他们。”\n “他们非常想看到我开枪自杀！”伊波利特冲着他气势汹汹地说。\n 他像是准备进攻似的说。\n “他们看不到，所以就着恼。”\n “这么说您也认为，他们是看不到的喏？”\n “我不来煽动您；相反，我认为，您开枪自杀是非常可能的。主要是您别生气……”叶甫盖尼·帕夫洛维奇用一种庇护弱者的语气拉长了调子说。\n “我现在才明白，我念这篇手稿是犯了一个可怕的错误！”伊波利特说，他忽然流露出十分信赖的神情望着叶甫盖尼·帕夫洛维奇，仿佛请朋友出出友好的主意。\n “处境是可笑的，但是……真的，我不知道该向您建议什么好，”叶甫盖尼·帕夫洛维奇微笑着回答。\n 伊波处待严厉地目不转睛地盯着他，一语不发，可以想到，他有时完全想入神了。\n “不，请让我说几句，这不过是一种姿态，”列别杰夫说，“说什么‘我要在公园里自杀，免得惊动任何人！’他下台阶往公园里走三步，就不惊扰别人了，这是他才这么想。”\n “诸位……”公爵本已开始说。\n “不，请让我说，万分尊敬的公爵，”列别杰夫愤恨地抓住话题不放，“因为您自己也看到这不是玩笑话，因为您客人中至少有一半也是那种意见并深信，现在，在这里讲了许多话以后，他出于爱面子也一定会开枪自杀，所以我作为事主当着证人们宣布，我请你们予以协助！”\n “应该做什么，列别杰夫？我准备着协助您。”\n “是这样：首先让他立即交出在我们面前加以吹嘘的手枪以及全部弹药，如果他交出来，鉴于他有病，我同意让他今晚在这屋里过夜，当然，得在我的监视之下，但是明天一定得请他走，随便他去哪里；对不起，公爵！如果他不交出武器，那么我马上，立即扭住他的胳膊，我扭一只，将军扭另一只。同时迅即派人去报告警察，那时这事就转到警察局来审理了，费尔迫先科，看在老交情上，去走一趟吧。”\n 顿时喧哗声起。列别杰夫异常激动，已经失去分寸：费尔迪先科准备去警察局；加尼亚发狂地坚持谁也不会开枪自杀。叶甫盖尼·帕夫洛维奇沉默语。\n “公爵，您曾经从钟楼上跳下来过吗？”伊波利特忽然对他低语说。\n “没有……”公爵天真的答道。\n “难道您以为，我没有预见到所有这一切憎恨吗？”伊波利特又低声说道，他眼睛一闪一闪望着公爵，仿佛真的等待着他的回答。“够了！”他突然对所有在场的人喊了起来，“我有过错……比所有的人都大的过错！列别杰夫，这是钥匙（他掏出钱包，从里面取出连着三四把小钥匙的钢钥匙圈），就是这把，最后第二把……科利亚会指给您看的……科利亚！科利亚在什么地方。”他望着科利亚，却视而不见地喊着，“是的……他会指给您看的；不久前他和我一起把东西放进包里的。科利亚，带他去吧；我的包在公爵书房桌子底下……用这把钥题，我的手枪和火药筒……在下面一只小箱子里。不久前是他亲手放的，列别杰夫先生，他会拿给您看的，但是有个条件，明天一早我去彼得堡时，您要把手枪还给我。您听到了吧？我把枪交给您，这样做是为了公爵，而不是为了您。”\n “这样就更好！”列别杰夫抓着钥匙，刻毒地冷笑着，跑到隔壁房间去了。\n 科利亚停住不走，本想说什么，但列别杰夫拽着拖走他了。\n 伊波利特望着嘻笑的客人们，公爵发觉，他的牙齿在磕碰，就像强烈的寒颤时那样。\n “他们全都是坏蛋！”伊波利特气愤若狂地又对公爵低语说。当他跟公爵说话时，总是俯身低语的。\n “别管他们；您很虚弱……”\n “马上，马上……我马上就走……”\n 突然他拥抱了公爵。\n “也许，您认为我发疯了？”他望了一眼公爵，奇怪地笑了起来。\n “不，但是您……”\n “马上，马上，您别作声；什么都别说；您站着……我想看一下您的眼睛……您这样站，我来看。我要跟一个大写的人告别。”\n 他站在那里，望着公爵，一动也不动，也不吭声，这样有１０秒钟。他异常苍白，双鬓都汗湿了，有点奇怪地一只手抓住公爵，仿佛怕把他放了。\n “伊波利特，伊波利特，您怎么啦？”公爵喊了起来。\n “马上……够了……我就去躺下。我要为太阳的健康喝一口……我想，我想，别管我。”\n 他很快地从桌上抓起一只酒杯，猛地离开原地，一瞬间便走到了下露台台阶口，公爵本已跟在他后面跑去，但结果却是，像故意似的，就在这一霎那时甫盖尼·帕夫洛维奇向他伸过手来向他告辞。过了一秒钟，突然露台上响起了众人的喊叫声；接着便是一分钟异常慌乱的景象。\n 发生的是这么一回事：\n 伊波利特定近紧靠下露台的台阶口就停了下来，他左手拿着酒杯，把右手伸进大衣右侧的口袋里。事后凯勒尔肯定地说，还是在这以前伊波利恃就一直把这只手放在右边口袋里；在跟公爵说话时，左手抓住他的肩和领子，这只右手则在口袋里，凯勒尔要人们相信，当时他的手就第一次产生怀疑。不管怎样，某种不安使他也跟在伊波利特后面跑去。但他没有赶得上。他只看见伊波利特的右手中突然有什么东西闪了一下，就在这一秒钟里小小的袖珍手枪已经紧贴在他的太阳穴上，凯勒尔扑过去抓他的手，但在同一秒钟伊波利特扣动了扳机。扳机发出于涩刺耳的喀嚏声，但是接着并没有枪声。当凯勒尔抱住伊波利特的时候，后者倒在了他的怀里，好像失去了知觉，也许，他真的以为他已经被打死了。手枪已经落在凯勒尔手中。有人扶住伊波利特，给他端来椅子，让他坐下，大家都聚拢在周围，喊叫着，询问着。大家都听到了扳机的喀嚓声，看见的却是个活人，甚至没有一丝擦伤。伊波利特本人坐在那里，他不明白发生了什么事，毫无表情的目光环视着周围所有的人。列别杰夫和科利亚在这一刻奔了进来。\n “没打响？”周围的人纷纷问。\n “也许，没装子弹？”另有些人猜测。\n “装了！”凯勒尔检查了手枪宣布说，“但是……”\n “难道卡壳了？”\n “根本就没有火帽，”凯勒尔告诉大家。\n 很难叙述接下来那可怜的一幕。最初的普遍惊恐很快地就开始被笑声所取代；有些人甚至哈哈大笑起来，在这件事中找到了幸灾乐祸的快感。伊波利特歇斯底里似地号啕大哭，扳捏着自己的双手，扑向大家，甚至也扑向费尔迪先科，用双手抓住他，向他发誓，他忘了，“无意间完全忘了，而不是故意忘了放火帽，说“这些火帽全都在这里，在他背心口袋里，有十个”（他拿给周围众人看），说他之所以没有早点安上火帽，是怕枪在口袋里意外走火，他以为需要的时候总是来得及装上的，可是突然却忘了。他奔向公爵，奔向叶甫盖尼·帕夫洛维奇，恳求凯勒尔把枪还给他，他马上向大家证明“什么是他的名誉，名誉……”而现在他就是“永远名誉扫地了！……”\n 最后，他真的失去知觉倒下了。大家把他抬到公爵的书房里。列别杰夫已完全清醒了，立即派人去叫医生，自己则和女儿、儿子、布尔多夫斯基以及将军一起留在病人的床边。等把失去知觉的伊波利特抬走后，凯勒尔站在房间中央，一字一顿清清楚楚，情绪激昂地大声宣布：\n “诸位，如果我们中有人再要当着我面说出怀疑火帽是故意忘了的话，或者确认那个不幸的年轻人只是演了一场喜剧，那么我就会跟这个人过不去。”\n 但是没有人答理他。最后客人们结伙匆匆散去。普季岑，加尼亚和罗戈任一起动身。\n 公爵对于叶甫盖尼·帕夫洛维奇改变主意未做解释就要离去，感到很是惊讶。\n “您不是想等大家散去后跟我谈话吗？”他问叶甫盖尼·帕夫洛维奇。\n “确实是这样，”叶甫盖尼·帕夫洛维奇说，一边突然坐到椅子上，也让公爵坐到自己身旁。“但是现在我临时改变了主意。我向您承认，我有点不好意思，您也是一样。我的思绪很乱；此外，我想跟您解释的事对我来说是太重要了，对您也是。公爵，要知道，我很想在一生中哪怕就一次做一件完全光明磊落的事，也就是说完全没有别的用心，但我认为，我现在，就此刻，还不完全能去做这件光明磊落的事，再说您，也许，也是……那样……还有……算了，我们以后再解释吧。我现在要去彼得堡，如果我们等上三天，也许，事情会变得明朗些，对我对您都是这样。”\n 说罢他又从椅子上站起身，因而使人觉得奇怪：刚才何必要坐下呢？公爵也觉得，叶甫盖尼·帕夫洛维奇不甚满意和颇为恼怒，甚至看起人来也带着敌意，目光中流露的神色完全不是刚才那种样子。\n “顺便问一下，您现在要去看病人吗。”\n “是的……我担心，”公爵说。\n “别担心；他肯走能活六个星期，甚至也许还会在这康复。不过最好明天就把他赶走。”\n “我什么都没说……也许，我真的就此促使他干了这种事？他可能认为我怀疑他会自杀。您怎么想，叶甫盖尼·帕夫洛维奇。”\n “一点儿也不是。您太善良，所以还在耿耿于怀。我听说过这种事，但是实际上从来也没有看到过一一个人会为了让人家夸他或者因为人家不夸他而赌气故意自杀。主要的是，我不相信这种毫不俺饰的软弱无力！可您明天反正得把他赶走。”\n ”您认为他会再次开枪自杀吗？”\n “不会，现在他不会自杀了。但是请当心我们这些自产的拉塞内＊！我再次告诉您，犯罪对于这种没有才能、没有耐心、贪得无厌、毫无价值的人来说是太平常的庇护所。”\n “难道这是个拉塞内？”\n “本质是一样的，虽然也许扮演的角色不一样。您会看到，正像他自己刚才给我们念的《解释》里说的那样，其实只是为了‘开个玩笑’。就想杀死十个人，即使这位先生没有能耐这佯干，可现在这些话也弄得我无法安睡。”\n “也许，您大多虑了。”\n “您真让人惊奇，公爵；您不相信，他现在就能杀死十个人？”\n “我不敢回答您；这一切非常奇怪，但是……”\n “好吧，随您，随您！”叶甫盖尼·帕夫洛维奇恼火地收尾说，“况且您是个非常勇敢的人；只不过您自己别掉进那十个人中去。”\n “最大的可能是，他不会杀死任何人，”公爵若有所思地望看叶甫盖尼·帕夫洛维奇，说。\n 叶甫盖尼·帕夫洛维奇气忿地大笑起来。\n “再见，该走了！您注意到没有，他要把自己“自白”的副本遗赠给阿格拉娅·伊万诺夫娜？”\n “是的，注意到了……我正在想这件事。”\n “这就好，以防他杀死十个人，”叶甫盖尼·帕夫洛维奇又笑了起来，然后就走出去了。\n 过了１小时，已经３点多了，公爵去了公园。他本试图在家里睡觉，但是睡不着，心跳厉害，不过，家里一切已经安排停当，尽可能安宁平静下来；病人已经睡着了，请来的医生声你，他已经没有特别的危险了，列别杰夫、科利亚、布尔多夫斯基睡在病人房间里，以便流值班；因此，已经没什么可担心的了。\n 但是公爵自己的不安却一分钟一分钟地在增长。他在公园徘徊，心不在焉地看着自己周围的景物，当他走到车站前的广场并看见一排空荡荡的长椅和乐队的谱架时，他惊讶地停了下来。这个地方使他吃惊，并且不知为什么令人觉得十分不像样子，他转身往回走，沿着昨天与叶潘钦母女走去车站的那条路径直走到指定约会的那张绿色长椅，在上面坐下后，突然纵声大笑起来，但又立即因此而异常愤慨。烦闷苦恼继续围绕着他；他真想离开去什么地方……他不知道去哪里，他头顶上方一只小鸟在树上啼啭，他便开始在叶丛中寻觅它；突然小鸟从树上腾空飞起，就在这一刻他不知为什么想起了那只“沐浴着炽热的阳光”的“苍蝇”，伊波利特这样写它，说“它知道自己的地位，是大合唱的参加者，唯独他一人是被抛弃者”。这句话刚才就使他大为震惊，现在又想起了它。一段早已忘却的回忆在他心间萌动，现在一下子变清晰了。\n ＊拉塞内，十九世纪二十年代蛋动巴黎的一刑事案件的中心人物，极端残酷的杀人犯。\n 这是在瑞士，他进行治疗的第１年，甚至是最初几个且。当时他还完全是个白痴，甚至都不会好好说话，有时也不能理解要求他做什么。有一次他走进山里去，那是一个阳光明媚的白天，他怀着一种痛苦的、怎么也不能具体体现的思想在那里踯躅良久。在他面前是辉耀的天空，下面是一汪湖水，四周的天涯清彻明净、无边无际。他久久地望着，心中则非常痛苦。现在他回想起来，当时他向这光明、无涯的青空伸出自己的双手，潸然泪下，使他感到痛苦的是，所有这一切跟他完全没有缘份。这不散的筵席是什么样的？这常年的盛大节日是什么样的？很久以前，从童年起，这筵席、这节日就一直吸引着他，可又怎么也接近不了、加入不了。每天早晨都升起这么光明灿烂的太阳，每天早晨瀑布倾泻处彩虹飞架；每天傍晚远方天际那座最高的雪峰都燃起朱红的火焰；每个“小小的苍蝇沐浴着炽热的阳光，在他身边嗡嗡叫，他是整个这场大合唱的参加者，他知道自己的位置，热爱这一席之地并感到幸福”；每一棵小草都在生长并感到幸福！万物都有自己的路，万物也都知道自己的路，它们唱着歌儿离去，唱着歌儿来临；只有他一个人什么也不知道，什么也不明白，不了解人们，也不理解声音，一切都与他无缘，他是个被抛弃的人。哦，当然，当时他不会用这些话来讲，也不会讲出自己的问题；他默默无声暗自痛苦：但是现在他觉得，他在那时就说了这一切，说了所有这些话，还有，有关苍蝇的话伊波利特正是从他本人那，从他当时的话里和泪水里拿去的。他深信这一点，不知为什么这个念头使他的心直跳……\n 他在长椅上微微睡着了，但是即使梦中他也仍然忐忑不安。就在入睡前他想起，伊波利特会打死十个人，对于这一荒廖的设想他一笑了之。他的周围是一片美妙、清新的沉寂，只有树\n \n \n","sourceLink":"http://novel.tingroom.com/shuangyu/256/2400.html","bookId":242,"book":{"id":242,"title":"白痴 The Idiot","description":"简介： The Idiot is a novel written by 19th century Russian author Fyodor Dostoyevsky. It was first published serially in Russkiy Vestnik between 1868 and 1869. The Idiot is ranked beside some of Dostoevsky\u0027s other works as one of the most brillia...","cover":"http://novel.tingroom.com/uploads/110321/1-1103211443111N.JPG","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/256","creation":"Aug 1, 2019 12:18:26 AM","modification":"Aug 1, 2019 12:18:26 AM"}}
