{"id":38089,"no":4,"title":"CHAPTER IV.","content":"What pleasure, sir, find we in life, to lock it From action and adventure?—Cymbeline. Morning came, and the Leslies departed. Morton watched the lumbering carriage till it disappeared down the rugged gorge of the Notch, then drew a deep breath, and ruefully betook himself to his day\u0027s sport. He explored, rod in hand, the black pools and plunging cascades of the Saco; but for once that he thought of the trout, he thought ten times of Edith Leslie. Towards night, however, he returned with a basket reasonably well filled; and, as he drew near the inn, he saw a young man, of his own age, or thereabouts, sitting under the porch. He had a cast of features which, in a feudal country, would have been taken as the sign of noble birth; and though he wore a slouched felt hat and a rough tweed frock, though his attitude was careless, though he held between his teeth a common clay pipe, at which he puffed with much relish, and though he was conversing on easy terms with two attenuated old Vermont farmers, with faces like a pair of baked apples,—yet none but the most unpractised eye would have taken him for other than a gentleman. As soon as Morton saw him, he shouted a joyful greeting, to which Mr. Edward Meredith, rising and going to meet his friend, replied with no less emphasis. \"I thought,\" said Morton, \"that you meant to do the dutiful this time, and stay with your father and family at the sea shore.\" \"Couldn\u0027t stand the sea shore,\" said Meredith, seating himself again; \"so I came up to the mountains to see what you were doing.\" \"You couldn\u0027t have done better; but come this way, out of earshot.\" \"Colonel,\" said Meredith, in a tone of melancholy remonstrance, \"this seat is a good seat, an easy seat, a pleasant seat. Why do you want to root me up?\" \"Come on, man,\" replied Morton. \"Show the way, then, Jack-a-lantern. But where do you want to lead me? I won\u0027t sit on the rail fence, and I won\u0027t sit on the grass.\" \"There\u0027s a bench here for you.\" \"Has it a back?\" \"Yes, it has a back. There it is.\" Meredith carefully removed a few twigs and shavings which lay upon the bench, seated himself, rested his arm along the back, and began puffing at his pipe again. But scarcely had he thus composed himself when the tea bell rang from the house. \"Do you hear that, now? Another move to make! Didn\u0027t I tell you so?\" \"Not that I remember.\" \"Please to explain, colonel, what you expect to gain by always bobbing about as you do, like a drop of quicksilver.\" \"To hear you, one would take you for the laziest fellow in the universe.\" \"There\u0027s reason in all things. I keep my vital energies against the time of need, instead of wasting them in unnecessary gyrations. Ladies at the table! New Yorkers in full feather, or I\u0027ll be shot! Now, what the deuse have lace and ribbons to do in a place like this?\" During the meal, the presence of the strangers was a check upon their conversation. \"Crawford,\" said Meredith, when it was over, \"have you had that sofa taken into my room?\" \"Yes, sir.\" \"And the arm chair?\" \"Yes, sir.\" \"And the candles?\" \"Yes, sir.\" \"All right. Now, then, colonel, allons.\" The name of colonel was Morton\u0027s college sobriquet. Meredith led the way into a room which adjoined his bed chamber, and which, under his direction, had assumed an air of great comfort. Morton took possession of the sofa; his friend of the arm chair. \"What\u0027s the word with you?\" began the latter; \"are you bound for the Adirondacks, the Margalloway, or the Penobscot?\" \"To the Margalloway, I think. You mean to go with me, I hope.\" \"To the Margalloway, or the antipodes, or any place this side of the North Pole.\" \"Then, if you say so, we\u0027ll set off to-morrow.\" \"Gently, colonel. One day\u0027s fishing here. We have six weeks before us. What sort of thing is that that you are smoking?\" \"Try, and judge for yourself,\" said Morton, handing his cigar case. Meredith took a sample of its contents between his fingers, and examined it with attention. \"I always thought you were a kind of heathen, and now I know it. Where did you pick up that cigar?\" \"Do you find it so very bad?\" \"It would not poison a man, and perhaps might pass for a little better than none at all. But nobody except a pagan would touch it when any thing better could be had.\" \"I forgot to bring any from town, and had to supply myself on the way.\" \"That goes to redeem your character. Fling those away, or give them to the landlord; I have plenty of better ones. But a pipe is the best thing at a place like this, and especially at camp, in the woods.\" \"So I have often heard you say.\" \"Mine, though, made a sensation, not long ago.\" \"How was that?\" \"The whole brood of the Stubbs, bag and baggage, passed here this afternoon.\" \"Thank Heaven they did not stop.\" \"They came in their private carriage. I nodded to Ben, and touched my hat to Mrs. S. You should have seen their faces. They thought there must be something out of joint in the mechanism of the universe, when a person of their acquaintance could be seen smoking a pipe at a tavern door, like a bog-trotting Irishman.\" \"You should have asked Ben to go with us.\" \"It would be the worst martyrdom the poor devil ever had to pass through. Ben seemed displeased with the scenery. He says that the White Mountains are nothing to any one who, like himself, has seen the Alps.\" \"Pray when did Stubb see the Alps?\" \"O, the whole family have seen the Alps,—the Alps, Italy, the Rhine, the nobility and gentry, and every thing else that Europe affords. They all swear by Europe, and hold the soil of America dirt cheap. You can see with half an eye what they are—an uncommonly bad imitation of an indifferent model.\" \"Let them pass for what they are worth. Have you come armed and equipped—rifle, blanket, hatchet, and so forth?\" \"Yes, and I have brought an oil cloth tent.\" \"So much the better; it is more convenient than a birch bark shanty.\" \"I give you notice that I mean to take my ease in that tent.\" \"I hope you will.\" \"One can be comfortable in the woods, as well as elsewhere. Remember, colonel, that we are out for amusement, and not after scalps. Last summer, you drove ahead, rain or shine, through thickets, and swamps, and ponds, as if you were on some errand of life and death. For this once, have mercy on frail humanity, and moderate your ardor.\" Morton gave the pledge required. They passed the evening in arranging the details of their journey, set forth and spent three or four weeks in the forest between the settled districts of Canada and Maine, poling their canoe up lonely streams, meeting no human face, but smoking their pipes in great contentment by their evening camp fire. They chased a bear, and lost him in a windfall; killed two moose, six deer, and trout without number; and underwent, with exemplary patience, a martyrdom of midges, black flies, and mosquitoes. And when, at last, they turned their faces homeward, they wiled the way with plans of longer journeyings,—more bear, more moose, more deer, more trout, more midges, black flies, and mosquitoes. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2850/78620.html","bookId":1216,"book":{"id":1216,"title":"Vassall Morton","description":"简介： Remote from towns he ran his godly race.Goldsmith....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2850","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
