{"id":38138,"no":53,"title":"CHAPTER LIII.","content":"The paths of glory lead but to the grave.—Gray\u0027s Elegy. Mr. Shingles had an acquaintance among the gentlemen of the press; and, chancing to meet his quill-driving friend, he told him Morton\u0027s story. It appeared, accordingly, beautifully embellished, in one of the evening papers, and was copied, the next morning, into several others. Consequently, Morton had scarcely risen from breakfast, when he was visited by half a dozen persons, editors and others, eager to hear his adventures, for the gratification of their own curiosity, or that of the public. As he detested such visitations, and as several of his callers, from their countenances alone, inspired him with an earnest longing to kick them down stairs, he hastened to avoid the nuisance by escaping into the street. Since the tidings he had heard from Shingles, his native town had lost all attraction for him; in fact he shrank from going thither, and willingly lingered another day in New York. Going to Buckland\u0027s lodgings, he renewed his persuasions of the evening before, and strongly urged him to leave New York. Buckland assented to every thing he said; and, hearing of a ship about to sail for the East Indies, Morton went with his friend to the merchant to whom she belonged, and induced him to engage a passage in her. Returning to his hotel at about two o\u0027clock, a waiter brought him a card, telling him that a boy had just left it for him. It was Rosny\u0027s; and on it were scrawled with a pencil the following concise and characteristic words:— Dear M.: Uncle Sam in a deuse of a hurry. Ordered to the island this afternoon. Off for Mexico to-morrow. Sorry not to see you, but haven\u0027t a minute to spare. Good luck.—Au revoir. Yours till doomsday, ROSNY. Morton went to the recruiting office where he had been with Rosny on the day before, learned the time and place of the embarkation, was on the spot at the hour named, and in a few minutes saw Rosny striding down the wharf in most unmilitary haste, his hair fluttering in the wind. He was so engrossed in making certain arrangements, and issuing his mandates to the soldiers who were to row him and some other officers to Governor\u0027s Island, that he did not observe Morton, who stood quietly leaning against a post. \"Hallo, Dick,\" said the latter at length. \"Haven\u0027t you eyes to see your friends?\" Rosny turned, in great surprise, and greeted him most emphatically. \"Come, Morton,\" he said, as he was stepping into the boat, \"you\u0027ll change your mind after all,—won\u0027t you?—and meet me at Vera Cruz.\" \"I\u0027ll sit at home, and read your exploits in the papers,\" replied Morton. \"Well; a wilful man must have his way. Adieu.\" \"Good by. May you live to be a general, or any thing else you like, short of the presidency.\" \"Why, shouldn\u0027t I make a good president?\" \"No.\" \"What? too progressive,—too wide awake,—too enlightened, ey?\" \"Yes, and too pugnacious.\" \"There you are again, Boston all over. I\u0027ll be president yet, if only to spite the Bostonites. You shall write my life, and I\u0027ll give you an office for it. Farewell.\" Morton watched the receding boat till it was almost out of sight, waved his hat to Rosny, who waved his own in return, and walked back to the hotel, wondering what would be the issue of his old classmate\u0027s ambitious schemes. How, among a throng of brave men, Rosny gained a name for determined daring;—how, on every occasion that offered, he displayed the fire of the Frenchman, and the stubborn mettle of the Saxon, whose blood mingled in his veins;—how, though sick and wounded, he dragged himself from the hospital at Puebla, and, mounting his horse, pushed forward with the advancing columns;—how gallantly, under the murdering storm of musketry and grape, he led his intrepid blackguards up the rocks of Chapultepec;—how, while shouting among the foremost, he climbed the hostile rampart, a bullet plunged into his brain, and dashed him, quivering and dead, to the foot of the scaling ladders;—all this, and more likewise, is it not written in the New York Herald? About a year after Rosny\u0027s departure, Morton chanced to be again in New York, when, in going out one morning, he beheld all the symptoms of some impending solemnity. Flags, festooned with crape, were strung across Broadway from building to building. The shops were half closed, and the streets were fast filling with people. Patriot citizens, exchanging the yardstick for the sword, strode the sidewalk in gorgeous panoply; and now and then a mounted warrior cantered along the pavement, struggling to keep his balance on his fiery coach horse. In an hour or two more, the pageant was in full operation. Looking from his hotel window Morton beheld a radiant river of shining bayonets, many colored plumes, and martial millinery, solemnly flowing down the middle of Broadway, to strange and lugubrious music, between melancholy shores of black broadcloth and beaver hats. At length a train of hearses appeared slowly advancing to the wailing music of the bands, encircled by the harmless sabres of the civic warriors, playing soldier, around the remains of those who had borne the part in tragic earnest. Over every hearse the national flag was drooping, and upon each was inscribed the name of its unconscious tenant. They were officers slain in battle during the last Mexican campaign. Four of the hearses passed. Morton read the names. They were all unknown to him; but as the fifth approached, he looked, started, and looked again; for wrought in white upon the sable drapery he saw, distinct and clear, the name of Rosny. Descending to the street, he joined the procession; he even underwent the funeral oration at the City Hall; and when it was over, shouldering through the crowd, he stood by the side of all that remained of his old classmate. Rosny\u0027s cap, and the sword he had used so well, lay on the lid of the coffin; and Morton turned away, with eyes not quite dry, as he recalled his many genial traits and his undaunted spirit. To resume. On returning to his hotel after taking leave of Rosny, Morton found a note awaiting him, directed in a female hand. He opened it, and read the signature,—Ellen Ashland,—the name of a lady whom he had well known in Boston, and who, just before he had sailed for Europe, had been married to an eminent lawyer of his acquaintance. She wrote that she had seen an account of his escape from prison, and arrival in New York, in the morning paper,—expressed an earnest wish to see him, and invited him to visit her at the New York Hotel, where she was spending a few days with her husband. As the time named was almost come, Morton called a coach, and drove up town. His friend received him with a peculiar warmth and earnestness of manner. Morton had known her as a person of marked character and strong but strictly governed emotions, not always permitting the expression of a feeling to keep pace with the feeling itself. He greatly liked and esteemed her, and her presence disarmed him, in a great degree, of his usual reserve. Her husband had been absent all day in Brooklyn, and would not return till late in the evening. \"It is five years since I have spoken to a lady,\" said Morton, as he seated himself at the tea table. As he was not scrupulous to wear a mask before her, she quickly discovered the depressed condition of his mind; and on her charging him with being very much out of spirits, he admitted that he was so. \"One would think,\" she observed, \"that after the sufferings that you have passed, you would have come home in a different mood of mind.\" \"And so I did,\" said Morton. \"You seem in no great haste to see your friends and relations in Boston.\" \"I have no near relations there.\" \"But you have friends.\" \"Yes; I have heard from them. I met an acquaintance yesterday.\" \"You have heard, then——\" And she bent her eyes upon his face, with a look searching but full of kindness, as if studying his thoughts. \"Five years,\" she continued, \"is a long time. Great changes may have taken place.\" \"Changes have taken place,\" said Morton. \"You have lost none of your intimate friends, as far as I know them; but some have left Boston, and some are married.\" Morton did not look up; but an undefined expression passed across his face, like the shadow of a black cloud. When, a moment after, he raised his eyes, he saw those of Mrs. Ashland fixed upon him with the same earnest gaze as before. Such scrutiny from another would have been intolerable to him; but in her it gave him no uneasiness. A servant entering changed for a time the character of their conversation. A quarter of an hour afterwards they were again alone, and Morton was seated near the window, when his friend approached him, her features kindling with a look of ill-suppressed feeling, laid her hand on his shoulder, and said, \"Vassall,\"—she had always before addressed him as Mr. Morton,—\"my heart bleeds for you—for you and for Edith Leslie.\" Morton looked up till he met her eyes. The surprise, the sudden consciousness that she was privy to his grief, the warm and heartfelt woman\u0027s sympathy that he read in every line of her face, were too much for his manhood, and he burst into tears.","sourceLink":"http://novel.tingroom.com/duanpian/2850/78669.html","bookId":1216,"book":{"id":1216,"title":"Vassall Morton","description":"简介： Remote from towns he ran his godly race.Goldsmith....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2850","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
