{"id":100182,"no":19,"title":"Page 19","content":"Trying to be tactful, I said, more gently than usual, “You’re both very kind, and I regret giving you cause for concern, but—” “You can’t be other than who you are,” Momma Oaks finished. “And that means doing what you think is right. I understand, child. Truly I do.” “I’ll miss having you around the house,” Edmund said gruffly, and I believed he meant it. “I’ll make you some sturdy boots tonight, fit for fighting.” “Thank you.” Edmund regarded Stalker and Fade briefly and then said, “It seems to me your friends could use a pair too. I don’t promise they’ll be ready in the morning, but I’ll send a runner to the fields with them.” I doubted he could find anybody willing, given the current dangers, but I didn’t want to discourage his kindness. So I said nothing while he knelt and took measurements for the two boys. Stalker in particular seemed stunned by the gesture; I wondered if anyone had ever done anything for him because they wanted to. It made me regret our lack of closeness because I couldn’t offer comfort without upsetting Fade. I wasn’t altogether sure why that should be so, but they had territorial instincts like all young animals, I supposed. “I have to go tell Smith I won’t be around to help with the crafting for a while,” Stalker said, once Edmund finished with his feet. “I’d better let Mr. Jensen know too.” Fade didn’t look pleased with the task. I addressed the question to my foster parents, trying belatedly to make them feel included in my planning. “If you don’t mind, I’ll accompany Fade?” “Come home after,” Momma Oaks said. “I’ll make you a special supper. Heaven only knows how long it will be before you have a decent meal again.” Out there, food would be the least of our worries, but I recognized her need to contribute what she could. And who was to say that memory of a delicious dinner wouldn’t hold me later, reminding me why I was fighting? Nobody would hear from me that the cooks and builders didn’t matter. We all had our roles to play. Fade linked our fingers as we moved toward the livery. His grasp felt warm and sure, a certainty in a world full of shifting ground. He was beautiful in a way that hurt me, but it was the sweetest pain I ever knew, better even than the scars I took on my naming day. This ache swelled my heart and made me want to pull his head down to mine, even with the whole town looking on. “I haven’t thanked you for stepping forward with me,” I said. “Don’t thank me for doing what my heart asks, Deuce. I’ll be with you as long as you let me.” Which seemed like an odd thing for him to say. I’d never once asked him to leave me alone, even when I thought he was crazy. But maybe it had to do with his frequent losses. In his heart, I suspected he thought nothing could last forever, not even us. And that one day, I’d go away like his sire and dam had done—or that he’d be sent from me, for some reason we couldn’t yet fathom. I resolved, then, deep in my soul never to let him go. I’d be the one never to leave him. I’d prove to him that some things could be for always—that we could be. As we approached the stable, an angry voice bawled out, “Where the devil you been, boy? This crap won’t shovel itself.” “Devil” and “crap” were foreign terms, but from Fade’s taut, angry expression, they weren’t nice, and he’d heard them before. “On patrol. I’m heading out tomorrow on permanent assignment, so you’ll need to find somebody else to work in my stead.” “The devil I will,” Jensen said, stepping into view. He was an unprepossessing man, weedy in height and manner. A strong, unfamiliar scent clung to him, sharp and somewhat fermented. “Do I need to take the strap to you again?” My vision went red at the idea he had been whipping Fade, who had never mentioned a word about it. Didn’t he trust me? “Elder Bigwater accepted him,” I said quietly. “I don’t figure you have a choice in the matter.” The liveryman pushed by us with even more foul words—or I guessed they were by Fade’s clenched fist. I put my hand on his. “Get your things, and come with me. You’re not spending another night here.” Reprieve When I came through the front door, the Oakses’ house smelled of home. It was funny I should think such a thing, now that I was leaving for the guard outpost we were establishing in the fields, but the scent of fresh baked bread had become ingrained in my head as synonymous with safety and comfort. Momma Oaks came out of the kitchen, drying her hands on her apron. Since I hadn’t asked her if we could have guests—and Fade had all his things in hand—puzzlement flickered on her face. “What’s this?” she asked, inviting me to clarify. Since Fade clearly didn’t want to talk about it, I told my side. “He needs to spend the night here. Mr. Jensen threatened to take a strap to him for leaving, and I think it’s not the first time.” She straightened her shoulders, mouth firming into a white line at the idea. “That he’s threatened … or actually done it?” I guessed that did matter. Sometimes people’s bark was worse than their bite, but I didn’t think that was the case. So I said, “Raise your shirt.” If I was wrong, there would be nothing to see. His dark eyes snapped at me with shamed ferocity, and the leaden feel of my stomach told me I was right. Fade didn’t want to do this, but with Momma Oaks waiting with a worried look, he complied. His stomach was fine—and then he turned. There, across his lovely, muscled back lay the evidence of his months in Salvation. Welts lay atop welts, some cracked and scabbed over, others red striped, and beneath it all lay blue-green bruises that said it had been going on almost since he moved from the Oakses’ house. I could see in her face that the woman wished she had kept him with her, despite the impropriety. Salvation hadn’t been as good to him as it had me. “Arlo Jensen won’t get away with this,” she said with a tight fury. “Edmund!” Fade tried to hide his humiliation, but I could see this was just making him feel worse. And yet, if we did nothing, then the despicable worm who hurt him wouldn’t pay for his crimes. When Edmund saw what his wife wanted him to, his whole face went red, and he clenched his fists. “I’ll attend to it,” he growled, stomping out the door. Momma Oaks took Fade’s hand, gently, and led him to the kitchen. “Dinner’s almost done, but I need to treat your back.” He flinched reflexively, recoiling from the idea of her tending him. She read the rejection, and the sorrow in her expression said she understood that he wouldn’t trust easily. So she assembled the supplies and put her hand on my shoulder. “I’ll go lay the table. It might be better if you take care of him.” “Do you mind?” I asked. “I’d rather you did it.” His tone said he wanted to pretend it never happened, but that wouldn’t make the injuries go away. “Then I will. Take your shirt off.” He complied, laying it on the table beside him. We seldom ate in the kitchen, but the worktable would serve this purpose. My hands trembled a little. This wasn’t like rubbing salve on battle wounds. Those didn’t bother me. These did, because a human—who didn’t have the excuse of mutation, disease, or insanity, whatever ailed the Freaks—had inflicted them. I washed my hands in the soapy water and then dampened a towel. More than anything, I feared hurting him, but he trusted me to do this. I just wished he had told me sooner, though since we hadn’t talked much, I supposed I didn’t blame him. Tegan could have helped him, or even Stalker. There was no reason for him to submit to such maltreatment. Trying to be gentle, I washed his back, pausing when I felt him flinch. His knuckles whitened on the edge of the table, his head bowed. I couldn’t tell what he was thinking. “Almost done,” I whispered. For the last step, I smoothed healing salve all over, as light as I could. He shuddered a little, but I had no idea if I was hurting him. With my fingertips, I traced each strap mark, each bruise, and by the time I finished, I wanted to find Arlo Jensen and cut him into Freak bait. The mere thought gave me immense satisfaction. The places where his skin had broken open didn’t appear to be infected, so there was no need for a deeper treatment, and they had clean scabs, so I didn’t apply bandages either. “Finished?” Before I could answer, he pushed to his feet and shrugged back into his shirt. He wouldn’t look at me, as if I had betrayed him. “Fade? Are you mad?” “Not at you.” But it seemed so. “If I hadn’t told her—” “It’s fine,” he snapped. “It’s not. What’s in your head right now?” “I probably had it coming,” he bit out. “Tegan’s fine. You’re fine. Even Stalker seems to get along with his foster dad. And I was smart-mouthed, angry, because—” He gestured between us. Because of us. Because of me. “So it probably had something to do with my attitude.” He shrugged. I was already shaking my head. “No matter what you said to him or how you said it, this wasn’t right. It was his failure, not yours. It wasn’t your fault.” He hid so much, this boy of mine. I took a step toward him and before I could move again, he did, and then he was in my arms. He couldn’t stand for anyone but me to touch him. And so, I held him carefully, wondering if I’d ever hurt him with a casual caress. Not that he would’ve shown me. He had suffered unimaginable pain already, and these scars would add to the many he’d collected over the years. Fade dropped his head just enough, resting his chin on my shoulder, and we stood that way until I heard Momma Oaks moving about in the dining room. Then the front door opened and closed. Edmund was back. Fade stepped away then, and I laced our fingers together, drawing him with me into the other room. “It’s settled,” Edmund said with satisfaction. Momma Oaks demanded to know: “What happened?” “I took the matter to Elder Bigwater. You know he has strong feelings about the mistreatment of children. Jensen will receive ten lashes and a day in the stocks.” He turned to Fade. “Not that it matters, but Arlo’s off the wagon. If we had known, we never would have entrusted him with your safety.” “Off the wagon?” I asked. My foster mother explained, “He’s been in the corn liquor. He’s a mean drunk. And I am so sorry. Of course you can spend the night here … and you’re welcome when growing season’s over too.” She was determinedly cheerful, fixed on the certainty we were both coming back. “He can have my room.” I left Fade to chat with Edmund while I went to deal with the claw wound on my stomach. The throb had dulled to a low heat, only sharpening when I twisted at the waist. Momma Oaks fussed while she treated me, shaking her head.","sourceLink":"https://allnovel.net/outpost-razorland-2/page-19.html","bookId":1653,"book":{"id":1653,"title":"Outpost (Razorland #2)","description":"Storyline: Outpost (Razorland #2) Deuce’s whole world has changed. Down below, she was considered an adult. Now, topside in a town called Salvation, she’s a brat in need of training in the eyes of the townsfolk. She doesn\u0027t fit in with the other girls: Deuce only knows how to fight. To make matters worse, her Hunter partner, Fade, keeps Deuce at a distance. Her feelings for Fade haven’t changed, but he seems not to want her around anymore. Confused and lonely, she starts looking for a way out. Deuce signs up to serve in the summer patrols—those who make sure the planters can work the fields without danger. It should be routine, but things have been changing on the surface, just as they did below ground. The Freaks have grown smarter. They’re watching. Waiting. Planning. The monsters don’t intend to let Salvation survive, and it may take a girl like Deuce to turn back the tide.","cover":"https://allnovel.net/images/outpost-razorland-2.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/outpost-razorland-2.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:49:52 PM"}}
