{"id":100191,"no":28,"title":"Page 28","content":"Momma Oaks left so I could finish getting ready, but she was beaming, so I knew I’d made her happy by not arguing. After I put on the blue dress, I stroked the soft fabric, admiring the fit. My foster mother did beautiful work, every bit as skilled as Edmund’s boots. The gown came down to my ankles and the skirt belled out, but the bodice had no adornment, just a heart-shaped neck and graceful little sleeves that stopped just beneath my shoulders. Tonight, I showed my scars proudly.\\n\\n I swept down the stairs to find Fade waiting for me at the bottom. His dark eyes widened, and for the first time since I’d known him, he was speechless. He stared up at me like I was everything he ever wanted. My heart skipped at the intensity of that expression, but it was a little scary, too, to have that much power. I took a step toward him, despite my uncertainty.\\n\\n Edmund cleared his throat. “Pretty as a picture, isn’t she?”\\n\\n Fade only nodded. His hungry stare brought color to my cheeks, and I was too conscious of the warmth of his fingers when he touched me. Just on the arm, but my skin was bare, and it felt shocking, intimate, too daring in front of my foster parents. Nodding in answer to Momma Oaks’s excited chatter and Edmund’s more measured farewell, the two of us went out into the night, into fresh air and bright music.\\n\\n “I want to drag you off and hide you away,” he whispered.\\n\\n “Why?”\\n\\n “I always knew you were beautiful, but now everyone else will too. I won’t be able to keep other boys away from you, and it’ll make me crazy.”\\n\\n I laughed, thinking he was trying to make me feel less self-conscious about the dress and my hair, which tickled the back of my neck each time I moved. But he kept his hand on my arm, as if he thought someone would pop up to steal me away. Dazzling heat blazed between us, fiercer than the lamps hung around the green.\\n\\n Not far from the dancers, he pulled me into the shadows and drew me up against him. “One kiss before I have to share you.”\\n\\n Hardly knowing myself, as Deuce the girl held sway tonight—and the Huntress watched with quiet embarrassment—I tipped my face up. His mouth touched mine, light as a breath, but brushed again and again, a tease, until I reached up and cupped his face in my hands. Then the kiss flared like lightning, deeper and more thorough than he’d ever dared before. When his tongue touched mine, I pulled back, shocked and breathless.\\n\\n “Where did you learn that?”\\n\\n “You’d only get mad if I told you.”\\n\\n I muttered beneath my breath. Probably, he was right. I didn’t want to hear he’d kissed some girl down below. If there had been another female for him since we arrived in Salvation, I needed to cut off all her hair and beat her half to death. The strength of that impulse scared me, and I took a step back. Deuce the girl was every bit as vicious as the Huntress, it seemed.\\n\\n He read my mood, even in the shadows, and he ran a hand under my artificial curls, fingers hot and tender against the nape of my neck. A shiver rolled through me. I felt helpless to resist him, incapable of knowing what was best for me. But this was Fade; he would never hurt me.\\n\\n “It doesn’t matter now,” he whispered. “There’s only you.”\\n\\n I didn’t like the certainty that he had secrets, but then Fade didn’t like the fact that Stalker watched me like a hungry wolf, either; so I couldn’t hold it against him if he had felt like this before, if someone else had taught him about tasting a girl as if her mouth was full of honey.\\n\\n “Do you want to dance?” I asked.\\n\\n In reply, he took my hand and led me to the lamp-lit green, where other couples were already spinning. It took me a few moments to pick up the steps, but this wasn’t too different from what we’d done at the feast down below; only here you did it with one partner instead of the whole community. I liked the intimacy of his hand on mine, our bodies moving in perfect rhythm, guided by the music and instincts that heated me all over. I didn’t trust those impulses. Fade smiled at me as if he could read my thoughts. The night was cool on my bare arms, and his body warmed mine.\\n\\n Eventually, we paused to nibble at the refreshments that had been laid out. Tegan joined us, looking bright and pretty in a pink dress. A boy stood next to her, older, I thought, but I couldn’t remember meeting him. Politely, she performed the introductions. “Zachariah Bigwater, these are my friends Deuce and Fade.”\\n\\n Must be Justine’s brother.\\n\\n “You don’t have two names?” he asked.\\n\\n “Only need one,” Fade said.\\n\\n His manner wasn’t short, exactly, but I sensed his impatience. This was our evening, and he didn’t intend to spend it in conversation with the elder’s heir. Zachariah must be a nice person if Tegan liked him, but I shared Fade’s quiet urgency. Our time together was melting away. Tonight, I didn’t even want to sleep.\\n\\n “People call me Zach,” he said then.\\n\\n “It’s nice to meet you,” I offered, not really meaning it.\\n\\n Tegan flashed me a knowing grin. “How do the fields look? I’m heading out tomorrow to do some upkeep.”\\n\\n “No major problems.”\\n\\n Beside me, Fade folded his arms in a hostile posture. I leaned against his side and gently dug my elbow in. While I didn’t know Zach, Tegan was a friend, and I hadn’t seen her for a while.\\n\\n But Zach could read cues; he turned to Tegan. “Want to dance?”\\n\\n The request revealed tact and sensitivity, as her leg might not hold up to a rollicking number, but the music had slowed. Relieved of the burden of courtesy when the other two moved off, Fade drew me against him, closer than the other couples. I didn’t protest. Instead I leaned my head against his shoulder and let him guide my movements. That demanded trust I couldn’t offer anyone else.\\n\\n A scornful, speculative whisper pierced my dreamy reverie. “D’you think she’s got knives strapped beneath those skirts?”\\n\\n Someone snickered. “Probably.”\\n\\n I pretended not to hear, but Fade’s fingers tightened on my waist. From the tension in his body, he was ready to fight on my behalf. Again. I put a hand on his cheek. “It doesn’t matter.”\\n\\n “Maybe he likes girls who act like boys.”\\n\\n That time, it took all my strength to hold on to Fade. He wasn’t dancing anymore, but merely standing while other couples whirled around us. His black, black eyes burned like dark stars, as coldly wrathful as I’d ever seen. If he got ahold of those idiots from school, they wouldn’t walk for weeks. Moonlight silvered his features, lending him a fierce, unearthly beauty.\\n\\n “Let’s just go.” I had an idea that it would cause trouble for Longshot if we got into a fight while on furlough.\\n\\n “I think she looks pretty,” Merry said. She was one of the girls who had been kind at Justine’s party.\\n\\n “Well enough,” someone else admitted.\\n\\n “I’m going to ask her to dance.” Fade didn’t like that either, but it was no reason to punch the boy in the face.\\n\\n I didn’t know his name until he came over. Terrence was shy and quiet, but he moved well enough. He kept plenty of space between us—and half the song passed before he spoke. “I hope Fade’s not mad. I thought this might calm everybody down.”\\n\\n “It seems to be working.” It was a good plan. The rest of our schoolmates had lost interest as soon as I proved willing to dance just like any other girl.\\n\\n But afterward, it was like Terrence had opened the door, and once cracked, curiosity poured through. The one who had been cruel didn’t ask, of course, but others did. I danced with five boys before Fade lost patience and reclaimed my hand. This was proper exercise, I thought, breathless from all the twirling.\\n\\n “Told you,” he muttered. “Now I won’t get another moment alone with you.”\\n\\n “You could ask for one.” My voice came out husky because if we slipped away, privacy would lead to more kissing. Shivers of anticipation curled through me.\\n\\n “Want to go for a walk?”\\n\\n I nodded, and his fingers threaded through mine in an unmistakable claim as he led me away from the green.\\n\\n Endless\\n\\n I followed Fade through town, expecting we’d wind up in the swing behind my house, but instead he led me in a direction that became more familiar with each step. In time, he stopped at the unfinished house where I’d trained with Stalker, before I realized those midnight visits gave him ideas.\\n\\n “Shall we go inside?” I asked softly, wondering if he’d stumbled on this spot by coincidence or if he had a motive for bringing me here.\\n\\n “Is there some reason we shouldn’t?”\\n\\n I shook my head.\\n\\n Fade crept up to the window. “I’ll go in first and unlatch the door for you.”\\n\\n When I’d come with Stalker, we both went in that way, but I wasn’t dressed for climbing. So I nodded and pressed close to the frame, hoping nobody would spot me; I felt conspicuous in my blue dress. The wait quickened my heartbeat, making the minor misdeed more exciting. Soon, Fade pulled me into the cool, dark house. At once, I saw evidence of the errand he’d mentioned earlier and wondered if my foster father would approve.\\n\\n Spread on the dusty floor was the blanket he’d carried from down below, and he had scrounged a candle for each corner of the cover. Smiling, he got out the device he’d inherited from his sire; in the tunnels, he clicked it when he was nervous, so it threw sparks in the dark. This time he held it longer … and the candles glowed into lovely, glimmering life.\\n\\n “You were pretty sure you could get me here,” I observed.\\n\\n “Just good planning. Besides, you suggested we take some time to ourselves.”\\n\\n I eyed him warily, despite the romantic scene. “What do you think we’re doing on that bedroll?”\\n\\n “Sitting. It would be a shame if you got your dress dirty.”\\n\\n He had a point; if I came home grubby, Momma Oaks would demand to know what I’d been doing. “And the candles?”\\n\\n “I want to see your face. Do you trust me?”\\n\\n In answer I offered my hand, and he drew me down beside him. The cover was big enough for both of us as long as I sat close, and Fade showed no intention of letting me put any distance between us. He wound his arms about me and cuddled me to his chest. When he tugged me closer still, I settled between his legs, both nervous and excited. His warm breath stirred my curls, misted my neck, and I shivered.\\n\\n “Cold?”\\n\\n “No.” In fact, I might have a fever. The chills got worse when he ran his palms up my bare arms.\\n\\n “I can’t believe you’re here with me,” he whispered in my ear.\\n\\n “Where else would I be?”\\n\\n “Here with him.” Fade paused. “Again.”\\n\\n The good feelings died away, replaced with dread. I sat very still. “How do you know—”\\n\\n “Because I saw you. It wasn’t just my smart mouth that drove Jensen crazy, Deuce. Some nights I’d sneak out, wondering what the two of you were doing in here. And why it wasn’t me.”\\n\\n A moment of shock held me motionless. This was the deep-seated doubt Fade had never been able to bring himself to voice. It had been eating at him for months, and he’d finally decided to confront me here. I might have feared his purpose, but I did trust him … and I had no dark secret to confess. \\n\\n","sourceLink":"https://allnovel.net/outpost-razorland-2/page-28.html","bookId":1653,"book":{"id":1653,"title":"Outpost (Razorland #2)","description":"Storyline: Outpost (Razorland #2) \\n Deuce’s whole world has changed. \\n Down below, she was considered an adult. Now, topside in a town called Salvation, she’s a brat in need of training in the eyes of the townsfolk. She doesn\u0027t fit in with the other girls: Deuce only knows how to fight. \\n To make matters worse, her Hunter partner, Fade, keeps Deuce at a distance. Her feelings for Fade haven’t changed, but he seems not to want her around anymore. Confused and lonely, she starts looking for a way out. \\n Deuce signs up to serve in the summer patrols—those who make sure the planters can work the fields without danger. It should be routine, but things have been changing on the surface, just as they did below ground. The Freaks have grown smarter. They’re watching. Waiting. Planning. The monsters don’t intend to let Salvation survive, and it may take a girl like Deuce to turn back the tide.\\n","cover":"https://allnovel.net/images/outpost-razorland-2.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/outpost-razorland-2.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:49:52 PM"}}
