{"id":22744,"no":7,"title":"VI. THE DEAR LITTLE PUPPY.","content":"Well, it doesn’t look such a very little Puppy, does it? But then, you see, Alice had grown very small indeed: and that’s what makes the Puppy look so large. When Alice had eaten one of those little magic cakes, that she found in the White Rabbit’s house, it made her get quite small, directly, so that she could get through the door: or else she could never have got out of the house again. Wouldn’t that have been a pity? Because then she wouldn’t have dreamed all the other curious things that we’re going to read about. \n \n So it really was a little Puppy, you see. And isn’t it a little pet? And look at the way[22] it’s barking at the little stick that Alice is holding out for it! You can see she was a little afraid of it, all the time, because she’s got behind that great thistle, for fear it should run over her. That would have been just about as bad, for her, as it would be for you to be run over by a waggon and four horses! \n \n Have you got a little pet puppy at your home? If you have, I hope you’re always kind to it, and give it nice things to eat. \n \n Once upon a time, I knew some little children, about as big as you; and they had a little pet dog of their own; and it was called Dash. And this is what they told me about its birthday-treat. \n \n “Do you know, one day we remembered it was Dash’s birthday that day. So we said ‘Let’s give Dash a nice birthday-treat, like what we have on our birthdays!’ So we thought and we thought ‘Now, what is it we like best of all, on our birthdays?’ And we thought and we thought. And at last we all called out together “Why, its oatmeal-porridge, of course!” So of[23] course we thought Dash would be quite sure to like it very much, too. \n a puppy and Alice when she was just small \n \n “So we went to the cook, and we got her to make a saucerful of nice oatmeal-porridge. And then we called Dash into the house, and we said ‘Now, Dash, you’re going to have your birthday-treat!’ We expected Dash would jump for joy: but it didn’t, one bit! \n \n “So we put the saucer down before it, and we said ‘Now, Dash, don’t be greedy! Eat it nicely, like a good dog!’ \n \n “So Dash just tasted it with the tip of its tongue: and then it made, oh, such a horrid face! And then, do you know, it did hate it so, it wouldn’t eat a bit more of it! So we had to put it all down its throat with a spoon!” \n \n I wonder if Alice will give this little Puppy some porridge? I don’t think she can, because she hasn’t got any with her. I can’t see any saucer in the picture. \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/1831/53093.html","bookId":630,"book":{"id":630,"title":"The Nursery Alice","description":"简介： I have reason to believe that Alices Adventures in Wonderland has been read by some hundreds of English Children, aged from Five to Fifteen: also by Children, aged from Fifteen to Twenty-five: yet again by Children, aged from Twenty-five to Thirty-fi...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1831","creation":"Aug 1, 2019 12:19:03 AM","modification":"Aug 1, 2019 12:19:03 AM"}}
