{"id":103021,"no":10,"title":"Page 10","content":"9\\n\\n THE NEXT night, I rose from my attic hiding place and went directly out in search of Dora. I didn\u0027t want to see or hear any more of David or Armand. I knew I couldn\u0027t be prevented from what I had to do.\\n\\n How I meant to do it, that was the question. They had unwittingly confirmed something for me. I was not totally mad. I was not imagining everything that was happening around me. Some of it, perhaps, I was imagining, but not all.\\n\\n Whatever the case, I decided upon a radical course of action with Dora, and one which neither David nor Armand could conceivably have approved.\\n\\n Knowing more than a little about her habits and her whereabouts, I caught up with Dora as she was coming out of the television studio on Chartres Street in the Quarter. She\u0027d spent the entire afternoon taping an hour-long show, and then visiting with her audience afterwards. I waited in the doorway of a nearby shop as she said farewell to the last of her \"sisters\" or seeming worshippers. They were young women, though not girls, and very firm believers in changing the world with Dora, and had about them a careless, nonconformist air.\\n\\n They hurried off, and Dora went the other way towards the square and towards her car. She wore a slender black wool coat and wool stockings with heels that were very high, her very favorites for dancing on her program, and with her little cap of black hair she looked extremely dramatic and fragile, and horribly vulnerable in a world of mortal males.\\n\\n I caught her around the waist before she knew what was happening.\\n\\n We were rising so fast, I knew she could not see or understand anything, and I said very close to her ear, \"You\u0027re with me, and you\u0027re safe.\" Then I wrapped her totally in my arms, so that no harm at all could come to her from the wind or the speed we were traveling, and I went up just as high as I dared to go with her, uncovered and vulnerable and depending upon me, listening keenly beneath the howl of the wind for the proper functioning of her heart and her lungs.\\n\\n I felt her relaxing in my arms, or more truly, she simply remained trusting. It was as surprising as everything else about her. She had buried her face in my coat, as though too afraid to try to look around her, but this was really more a practical matter in the cold than anything else. At one point, I opened my coat, and covered her with one side of it, and we went on.\\n\\n The journey took longer than I had supposed; I simply could not take a fragile human being up that high into the air. But it was nothing as tedious or dangerous as it might have been had we taken a fuming and stinking and highly explosive jet plane.\\n\\n Within less than an hour, I was standing with her inside the glass doors of the Olympic Tower. She awoke in my arms as if from a deep sleep. I realized this had been inevitable. She\u0027d lost consciousness, for a series of physical and mental reasons, but she came to herself at once, her heels striking the floor, and looked at me with huge owl eyes, and then out at the side of St. Patrick\u0027s rising in all its obdurate glory across the street.\\n\\n \"Come on,\" I said, \"I\u0027m taking you to your father\u0027s things.\" We made for the elevators.\\n\\n She hurried after me, eagerly, the way that vampires dream mortals will do it, which never, never happens, as if all this were wondrous and there was no reason under Heaven to be afraid.\\n\\n \"I don\u0027t have much time,\" I said. We were in the elevator speeding\\n\\n upwards. \"There is something chasing me and I don\u0027t know what it wants of me. But I had to bring you here. And I\u0027ll see that you get home safe.\"\\n\\n I explained that I knew of no rooftop entrances to this building; indeed, the whole place was new to me, or I would have brought her in that way, and I explained this now, embarrassed that we would cover a continent in an hour and then take a rattling, sucking, and shimmering elevator that seemed only slightly less marvelous than the gift of vampiric flight.\\n\\n The doors opened onto the correct floor. I put the key in her hand, and guided her towards the apartment. \"You open it, everything inside is yours.\"\\n\\n She looked at me for a moment, a slight frown on her forehead, then she stroked carelessly at her wind-torn hair, and put the key in the lock and opened the door.\\n\\n \"Roger\u0027s things,\" she said with the first breath she took.\\n\\n She knew them by the smell as any antiquarian might have known them, these icons and relics. Then she saw the marble angel, poised in the corridor, with the glass wall way beyond it, and I thought she was going to faint in my arms.\\n\\n She slumped backwards as if counting upon me to catch her and support her. I held her with the tips of my fingers, as afraid as ever that I might accidentally bruise her.\\n\\n \"Dear God,\" she said under her breath. Her heart was racing, but it was hearty and very young and capable of tremendous endurance. \"We are here, and you\u0027ve been telling me true things.\"\\n\\n She sprang loose from me before I could answer and walked briskly past the angel and into the larger front room of the place. The spires of St. Patrick\u0027s were visible just below the level of the window. And everywhere were these cumbersome packages of plastic through which one could detect the shape of a crucifix or saint. The books of Wynken were on the table, of course, but I wasn\u0027t going to press her on that just now.\\n\\n She turned to me, and I could feel her studying me, assessing me. I am so sensitive to this sort of appraisal that I actually think my vanity is rooted in each of my cells.\\n\\n She murmured some words in Latin, but I didn\u0027t catch them, and no automatic translation came up in my mind.\\n\\n \"What did you say?\"\\n\\n \"Lucifer, Son of Morning,\" she whispered, staring at me with frank admiration. Then she plopped down into a large leather chair. It was one of the many tiresome furnishings of the place, meant for businessmen but completely comfortable. Her eyes were still locked on me.\\n\\n \"No, that\u0027s not who I am,\" I said. \"I\u0027m only what I told you and nothing more. But that\u0027s who\u0027s after me.\"\\n\\n \"The Devil?\"\\n\\n \"Yes. Now listen, I\u0027m going to tell you everything, and then you must give me your advice. Meantime\u0026iexcl;\u0026ordf;\" I turned around, yes, there was the file cabinet. \"Your inheritance, everything, money you have now that you don\u0027t know about, clean and taxed and proper, it\u0027s all explained in black folders in those files. Your father died wanting you to have this for your church. If you turn away from it, don\u0027t be so sure it\u0027s God\u0027s will. Remember, your father is dead. His blood cleansed the money.\"\\n\\n Did I believe this? Well, it sure as hell was what Roger wanted me to tell her.\\n\\n \"Roger said to say this,\" I added, trying to sound extremely sure of myself.\\n\\n \"I understand you,\" she said. \"You\u0027re worrying about something that doesn\u0027t really matter now. Come here, please, let me hold you. You\u0027re shivering.\"\\n\\n \"I\u0027m shivering!\"\\n\\n \"It\u0027s warm in here, but you don\u0027t seem to feel it. Come.\"\\n\\n I knelt down in front of her and suddenly took her in my arms the way I had Armand. I laid my head against hers. She was cold but would never even on the day of her burial be as cold as I was, nothing young. Her mother had been a maid in the Garden District, like many an Irish maid. And Roger\u0027s Uncle Mickey was one of those easygoing characters who made nothing of himself in anyone\u0027s eyes at all.\\n\\n \"My father never knew about the real life of Uncle Mickey. My mother\u0027s mother told me to show me what airs my father put on, and what a fool he was, and how humble his origins had been.\"\\n\\n \"Yes, I see.\"\\n\\n \"My father had loved Uncle Mickey. Uncle Mickey had died when my father was a boy. Uncle Mickey had a cleft palate and a glass eye, and I remember my father showing me his picture and telling me the story of how Uncle Mickey lost his eye. Uncle Mickey had loved fireworks, and once he\u0027d been playing with firecrackers and one had gone off in a tin can, and wham, the can hit him in the eye. That\u0027s the story I always believed about Uncle Mickey. I knew him only from the picture. My grandmother and my great-uncle were dead before I was born.\"\\n\\n \"Right. And then your mother\u0027s people told you different.\"\\n\\n \"My mother\u0027s father was a cop. He knew all about Roger\u0027s family, that Roger\u0027s grandfather had been a drunk and so had Uncle Mickey, more or less. Uncle Mickey had also been a tout for a bookie when he was young. And one time, he held back on a bet. In other words, he kept the money rather than placing the bet as he should have, and unfortunately the horse won.\"\\n\\n \"I follow you.\"\\n\\n \"Uncle Mickey, very young and very scared I imagine, was in Corona\u0027s Bar in the Irish Channel.\"\\n\\n \"On Magazine Street,\" I said. \"That bar was there for years and years. Maybe a century.\"\\n\\n \"Yes, and the bookie\u0027s henchmen came in and dragged Uncle Mickey to the back of the bar. My mother\u0027s father saw it all. He was there, but he couldn\u0027t do anything about it. Nobody could. Nobody would. Nobody dared. But this is what my grandfather saw. The men beat and kicked Uncle Mickey. They were the ones who hurt the roof of his mouth so he talked as if something were wrong with him. And they kicked out his eye. They kicked it across the floor. And the way my grandfather said it every time he told it was, \u0027Dora, they could have saved that eye, except those guys stepped on it. They deliberately stepped on it with those pointed shoes.\u0027 \"\\n\\n human could be that cold. I had sopped up the winter\u0027s worst as though I were porous marble, which I suppose I was.\\n\\n \"Dora, Dora, Dora,\" I whispered. \"How he loved you, and how much he wanted everything to be right for you, Dora.\"\\n\\n Her scent was strong, but so was I.\\n\\n \"Lestat, explain about the Devil,\" she said.\\n\\n I sat down on the carpet so that I could look up at her. She was perched on the edge of her chair, knees bare, black coat carelessly open now, and a streak of gold scarf showing, her face pale but very flushed, in a way that made her radiant and at the same time a little enchanted, as though she were no more human than me.\\n\\n \"Even your father couldn\u0027t really describe your beauty,\" I said.\\n\\n \"Temple virgin, nymph of the wood.\"\\n\\n \"My father said that to you?\"\\n\\n \"Yes. But the Devil, ah, the Devil told me to ask you a question.\\n\\n To ask you the truth about Uncle Mickey\u0027s eye!\" I had just remembered it. I had not remembered to tell either David or Armand about this, but what difference could that possibly make?\\n\\n She was surprised by these words, and very impressed. She sank back a little into the chair. \"The Devil told you these words?\"\\n\\n \"He gave it to me as a gift. He wants me to help him. He says he\u0027s not evil. He says that God is his adversary. I\u0027ll tell you everything, but he gave me these words as some sort of little extra gift, what do we call it in New Orleans, lagniappe? To convince me that he is what he says he is.\"\\n\\n She gave a little gesture of confusion, hand flying to her temple as she shook her head. \"Wait. The truth about Uncle Mickey\u0027s eye, you\u0027re sure he said that? My father didn\u0027t say anything about Uncle Mickey?\"\\n\\n \"No, and I never caught any such image from your father\u0027s heart or soul, either. The Devil said Roger didn\u0027t know the truth. What does it mean?\"\\n\\n \"My father didn\u0027t know the truth,\" she said. \"He never knew. His mother never told him the truth. It was his uncle Mickey, my grandmother\u0027s brother. And it was my mother\u0027s people who told me the real story\u0026iexcl;\u0026ordf;Terry\u0027s people. It was like this, my father\u0027s mother was rich and had a beautiful house on St. Charles Avenue.\"\\n\\n \"I know the place, I know all about it. Roger met Terry there.\"\\n\\n Yes, exactly, but my grandmother had been poor when she was.\\n\\n She stopped.\\n\\n \"And Roger never knew this.\"\\n\\n \"Nobody knows it who is alive,\" she said. \"Except for me, of course. My grandfather\u0027s dead. For all I know, everyone who was ever there is dead. Uncle Mickey died in the early fifties. Roger used to take me out to the cemetery to visit his grave. Roger had always loved him. Uncle Mickey with his hollow voice and his glass eye. Everybody sort of loved him, the way Roger told it. And even my mother\u0027s people said that too. He was a sweetheart. He was a night watchman before he died. He rented rooms on Magazine Street right over Baer\u0027s Bakery. He died of pneumonia in the hospital before anyone even knew he was ill. And Roger never knew the truth about Uncle Mickey\u0027s eye. We would have spoken of it if he had, naturally.\"\\n\\n I sat there pondering, or rather picturing what she had described. No images came from her, she was closed tight, but her voice had been effortlessly generous. I knew Corona\u0027s. So did anyone who had ever walked Magazine Street in those famous blocks of the Irish hey-day. I knew the criminals with their pointed shoes. Crushing the eye.\\n\\n \"They just stepped on it and squashed it,\" said Dora, as though she could read my thoughts. \"My grandfather always said, \u0027They could have saved it, if they hadn\u0027t stepped on it the way they did with those pointed shoes.\u0027\"\\n\\n A silence fell between us.\\n\\n \"This proves nothing,\" I said.\\n\\n \"It proves your friend, or enemy, knows secrets, that\u0027s what it proves.\"\\n\\n \"But it doesn\u0027t prove he\u0027s the Devil,\" I said, \"and why would he choose such a story, of all things?\"\\n\\n \"Maybe he was there,\" she said with a bitter smile.\\n\\n We both gave that a little laugh.\\n\\n \"You said this was the Devil but he wasn\u0027t evil,\" she prompted me. She looked persuasive and trusting and thoroughly in command.\\n\\n I had the feeling that I had been absolutely correct in seeking her advice. She was regarding me steadily.\\n\\n \"Tell me what this Devil has done,\" she said.\\n\\n I told her the whole tale. I had to admit how I stalked her father and I couldn\u0027t remember if I had told her that before. I told her about the Devil stalking me in similar fashion, going through it all, just as I had for David and Armand, and found myself finishing with those puzzling words, \"And I\u0027ll tell you this about him, whatever he is, he has a sleepless mind in his heart, and an insatiable personality! And that\u0027s true. When I first used those words to describe him, they just occurred to me as if from nowhere. I don\u0027t know what part of my mind intuited such a thing. But it\u0027s true.\"\\n\\n \"Say again?\" she asked.\\n\\n I did.\\n\\n She lapsed into total silence. Her eyes became tiny and she sat with one hand curled under her chin.\\n\\n \"Lestat, I\u0027m going to make an absurd request of you. Send for some food. Or get me something to eat and drink. I have to ponder this.\"\\n\\n I found myself leaping to my feet. \"Anything you wish,\" I said.\\n\\n \"Doesn\u0027t matter at all. Sustenance. I haven\u0027t eaten since yesterday. I don\u0027t want my thoughts distorted by an accidental fast. You go, get something for nourishment and bring it back here. And I want to be alone here, to pray, to think, and to walk back and forth among Father\u0027s things. Now, there is no chance this demon will take you sooner than promised?\"\\n\\n \"I don\u0027t know any more than I told you. I don\u0027t think so. Look, I\u0027ll get you good food and drink.\"\\n\\n I went on the errand immediately, leaving the building in mortal fashion and seeking out one of those crowded midtown restaurants from which to purchase a whole meal for her that could be packed up and kept hot until I returned. I brought her several bottles of some pure, brand-name water, since that\u0027s what mortals seem to crave in these times, and then I took my time going back up, the bundle in my arms.\\n\\n Only as the elevator opened on our floor did I realize how unusual my actions had been. I, two hundred years old, ferocious and proud by nature, had just gone on an errand for a mortal girl because she asked me very directly to do it.\\n\\n Of course there were mediating circumstances! I\u0027d kidnapped her and brought her over hundreds of miles! I needed her. Hell, I loved her.\\n\\n But what I\u0027d learnt from this simple incident was this: She did have a power, which saints often have, to make others obey. Without question, I\u0027d gone to get the food for her. Cheerfully gone myself, as though there were grace in it.\\n\\n It took her less than six and one half minutes to devour the meal. I\u0027ve never seen anyone eat so fast. She stacked up everything and took it into the kitchen. I had to draw her away from the chores, and bring her back into the room. This gave me a chance both to hold her warm, fragile hands and to be very close to her.\\n\\n \"What is your advice?\"\\n\\n She sat down and pondered, or drew together her thoughts.\\n\\n \"I think you have little to lose by cooperating with this being. It\u0027s perfectly obvious he could destroy you anytime he wanted. He has many ways. You slept in your house, even after you knew that he, the Ordinary Man, as you call him, knew the location. Obviously you aren\u0027t afraid of him on any material level. And in his realm, you were able to exert sufficient force to push him away from you. What do you risk by cooperating? Suppose he can take you to Heaven or Hell. The implication is that you can still refuse to help him, can\u0027t you?\\n\\n You can still say, to use his own fine language, \u0027I don\u0027t see things from your point of view.\u0027 \"\\n\\n \"Yes.\"\\n\\n \"What I\u0027m saying is, if you open yourself to what he wants to show you, that does not mean you have accepted him, does it? On the contrary, the obligation lies with him to make you see from his perspective, or so it seems. Besides, the point is, you break the rules whatever they are.\"\\n\\n \"He can\u0027t be tricking me into Hell, you mean.\"\\n\\n \"You serious? You think God would let people be tricked into Hell?\"\\n\\n \"I\u0027m not people, Dora. I\u0027m what I am. I don\u0027t mean to draw any parallels with God in my repetitive epithets. I only mean I\u0027m evil. Very evil. I know I am. I have been since I started to feed on humans.\\n\\n I\u0027m Cain, the slayer of his brothers.\"\\n\\n \"Then God could put you in Hell anytime he wanted. Why not?\"\\n\\n I shook my head. \"I wish I knew. I wish I knew why He hasn\u0027t. I wish I knew. But what you\u0027re saying is that there is power involved here on both sides.\"\\n\\n \"Clearly.\"\\n\\n \"And to believe in some sort of trickery is almost superstitious.\"\\n\\n \"Precisely. If you go to Heaven, if you speak with God....\" She stopped.\\n\\n \"Would you go if he were asking you to help him, if he were tell-\"\\n\\n I brought the meal inside the apartment and set it down for her on the table. The apartment was now flooded with her mingling aromas, including that of her menses, that special, perfumed blood collecting neatly between her legs. The place breathed with her.\\n\\n I ignored the predictable raging desire to feast on her till she dropped.\\n\\n She was sitting crouched over in the chair, hands locked together, staring before her. I saw that the black leather folders were open all over the floor. She knew about her inheritance or had some idea of it.\\n\\n She wasn\u0027t looking at that, however, and she seemed absolutely unsurprised by my return.\\n\\n She drifted towards the table now, as though she couldn\u0027t break out of her reverie. Meantime, I stirred about in the kitchen drawers of the apartment for plates and utensils for her, found some mildly inoffensive stainless-steel forks and knives and a china plate. I set these down for her, and laid out the cartons of steaming food\u0026iexcl;\u0026ordf;meat and vegetables and such, and some sort of sweet concoction, all of it as alien to me as it had always been, as if I hadn\u0027t recently been in a mortal body and tasted real food. I didn\u0027t want to think about that experience!\\n\\n \"Thank you,\" she said absently, without so much as looking at me. \"You are a darling for having done it.\" She opened a bottle of the water and drank it all greedily.\\n\\n I watched her throat as she did this. I didn\u0027t let myself think about her in any way except lovingly, but the scent of her was enough to drive me out of the place.\\n\\n That\u0027s it, I vowed. If you feel you cannot control this desire, then you leave!\\n\\n She ate the food indifferently, almost mechanically, and then looked up at me.\\n\\n \"Oh, forgive me, do sit down, please. You can\u0027t eat, can you? You can\u0027t take this kind of nourishment.\"\\n\\n \"No,\" I said. \"But I can sit down.\"\\n\\n I sat next to her, trying not to watch her or breathe her scent any more than I had to. I looked directly across the room, out the glass at the white sky. If snow was falling now, I couldn\u0027t tell, but it had to be. Because I couldn\u0027t see anything but the whiteness. Yes, that meant that either New York had disappeared without a trace, or that it was snowing outside.\\n\\n \"What could you possibly lose by doing it?\" she said.\\n\\n I didn\u0027t answer.\\n\\n She walked about, thinking, her black hair falling forward in a curl against her cheek, her long black-clad legs looking painfully thin yet graceful as she paced. She had let go of the black coat a long time ago, and I realized now that she wore only a thin black silk dress. I smelled her blood again, her secret, fragrant, female blood.\\n\\n I looked away from her.\\n\\n She said, \"I know what I have to lose in such matters. If I believe in God, and there is no God, then I can lose my life. I can end up on a deathbed realizing I\u0027ve wasted the only real experience of the universe I\u0027ll ever be permitted to have.\"\\n\\n \"Yes, exactly, that\u0027s what I thought when I was alive. I wasn\u0027t going to waste my life believing in something that was unprovable and out of the question. I wanted to know what I was permitted to see and feel and taste in my life.\"\\n\\n \"Exactly. But you see, your situation is different. You are a vampire.\\n\\n You are, theologically speaking, a demon. You are powerful in your own way, and you cannot die naturally. You have an edge.\"\\n\\n I thought about it.\\n\\n \"Do you know what happened today in the world,\" she said, \"just this one day? We always begin our broadcast with such reports; do you know how many people died in Bosnia? In Russia? In Africa? How many skirmishes were fought or murders committed?\"\\n\\n \"I know what you\u0027re saying.\"\\n\\n \"What I\u0027m saying is, it\u0027s highly unlikely this thing has the power to trick you into anything. So go with it. Let it show you what it promises. And if I\u0027m wrong ...if you\u0027re tricked into Hell, then I\u0027ve made a horrible mistake.\"\\n\\n \"No, you haven\u0027t. You\u0027ve avenged your father\u0027s death, that\u0027s all. But I agree with you. Trickery is too petty to be involved here. I\u0027m going by instincts. And I\u0027ll tell you something else about Memnoch, the Devil, something maybe that will surprise you.\"\\n\\n \"That you like him? I know that. I understood that all along.\"\\n\\n \"How is that possible? I don\u0027t like myself, you know. I love my-self, of course, I\u0027m committed to myself till my dying day. But I don\u0027t like myself.\"\\n\\n \"You told me something last night,\" she said. \"You said that if I needed you I was to call to you with my thoughts, my heart.\"\\n\\n ing you he wasn\u0027t evil, but that he was the adversary of God, that he could change your mind on things?\"\\n\\n \"I don\u0027t know,\" she said. \"I might. I would maintain my free will throughout the experience, but I very well might.\"\\n\\n \"That\u0027s just it. Free will. Am I losing my will and my mind?\"\\n\\n \"You seem to be in full possession of both and an enormous amount of supernatural strength.\"\\n\\n \"Do you sense the evil in me?\"\\n\\n \"No, you\u0027re too beautiful for that, you know it.\"\\n\\n \"But there must be something rotten and vicious inside me that you can feel and see.\"\\n\\n \"You\u0027re asking for consolation and I can\u0027t give that to you,\" she said. \"No, I don\u0027t sense it. I believe the things you\u0027ve told me.\" \"Why?\"\\n\\n She thought for a long time. Then she stood up and went to the glass wall.\\n\\n \"I have put a question to the supernatural,\" she said, looking down, perhaps at the roof of the cathedral. I could not see it from where I stood. \"I have asked it to give me a vision.\"\\n\\n \"And you think I might be the answer.\"\\n\\n \"Possibly,\" she said, turning and looking at me again. \"That is not to say that all of this is happening because of Dora and what Dora wants. It is, after all, happening to you. But I have asked for a vision, and I\u0027ve been given a series of miraculous incidents, and yes, I believe you, as surely as I believe in the existence of and the goodness of God.\"\\n\\n She came towards me, stepping carefully through the scattered folders.\\n\\n \"You know, none of us can say why God allows evil.\"\\n\\n \"Yes.\"\\n\\n \"Or whence it came into the world. But the world over, there are millions of us\u0026iexcl;\u0026ordf;People of the Book\u0026iexcl;\u0026ordf;Moslem, Jew, Catholic, Protestant\u0026iexcl;\u0026ordf;descendants of Abraham\u0026iexcl;\u0026ordf;and over and over we keep being drawn into tales and schemes in which evil is present, in which there is a Devil, in which there is some element that God allows, some adversary, to use your friend\u0027s word.\"\\n\\n \"Yes. Adversary. That\u0027s exactly what he said.\"\\n\\n \"I trust in God,\" she said.\\n\\n \"And you\u0027re saying I should do that too?\"\\n\\n \"Yes.\"\\n\\n \"You do the same. If you go with this creature, and you need me, call to me. Let me say it this way: If you cannot pull away of your own volition and you need my intercession, then send out your call! I\u0027ll hear you. And I\u0027ll cry out to the heavens for you. Not for justice but for mercy. Will you make me that promise?\"\\n\\n \"Of course.\"\\n\\n \"What will you do now?\" she asked.\\n\\n \"Spend the remaining hours with you, taking care of your affairs. Making sure, through my numerous mortal alliances, that nothing can hurt you in terms of all these possessions.\"\\n\\n \"My father\u0027s done it,\" she said. \"Believe me. He\u0027s covered it very cleverly.\"\\n\\n \"Are you sure?\"\\n\\n \"He did it with his usual brilliance. He left more money to fall into the hands of his enemies than the fortune he left to me. They have no need to go looking for anyone. Once they realize he is dead, they will begin to snatch his available assets right and left.\"\\n\\n \"You are certain of all this.\"\\n\\n \"Without question. Put your affairs in order tonight. You don\u0027t need to worry about mine. Take care of yourself, that you are ready to embark on this.\"\\n\\n I watched her for a long time. I was still seated at the table. She stood with her back to the glass. It struck me that she had been drawn against it in black ink except for her white face.\\n\\n \"Is there a God, Dora?\" I whispered. I had spoken these same words so many times! I had asked this question of Gretchen when I was flesh and blood in her arms.\\n\\n \"Yes, there is a God, Lestat,\" Dora answered. \"Be assured of it. Maybe you\u0027ve been praying to Him so loud and so long that finally He has paid attention. Sometimes I wonder if that isn\u0027t the disposition of God, not to hear us when we cry, to deliberately shut His ears!\"\\n\\n \"Shall I leave you here or take you home?\"\\n\\n \"Leave me. I don\u0027t ever want to make a journey like that again. I will spend a good part of the rest of my life trying to remember it precisely and failing to do so. I want to stay here in New York with my father\u0027s things. With regard to the money? Your mission has been accomplished.\"\\n\\n \"And you accept the relics, the fortune.\"\\n\\n \"Yes, of course, I accept them. I\u0027ll keep Roger\u0027s precious books until such time as they can be properly offered for others to see\u0026iexcl;\u0026ordf;his beloved heretical Wynken de Wilde.\"\\n\\n \"Do you require anything further of me?\" I asked.\\n\\n \"Do you think ... do you think you love God?\"\\n\\n \"Absolutely not.\"\\n\\n \"Why do you say that?\"\\n\\n \"How could I?\" I asked. \"How could anyone love Him? What did you just tell me yourself about the world? Don\u0027t you see, everybody hates God now. It\u0027s not that God is dead in the twentieth century. It\u0027s that everybody hates Him! At least I think so. Maybe that\u0027s what Memnoch is trying to say.\"\\n\\n She was amazed. She frowned with disappointment and yearning. She wanted to say something. She gestured, as though trying to take invisible flowers from the air to show me their beauty, who knows?\\n\\n \"No, I hate Him,\" I said.\\n\\n She made the Sign of the Cross and put her hands together.\\n\\n \"Are you praying for me?\"\\n\\n \"Yes,\" she said. \"If I never lay eyes on you again after tonight, if I never come across a single shred of evidence that you really exist or were here with me, or that any of these things were said, I\u0027ll still be transformed by you as I am now. You are my miracle of sorts. You\u0027re greater proof than millions of mortals have ever been given. You\u0027re proof not only of the supernatural and the mysterious and the wondrous, you\u0027re proof of exactly what I believed\"\\n\\n \"I see.\" I smiled. It was all so logical and symmetrical. And true. I smiled, truly smiled, and shook my head. \"I hate to leave you,\" I said.\\n\\n \"Go,\" she said, and then she clenched her fists. \"Ask God what He wants of us!\" she said furiously. \"You\u0027re right. We hate Him!\" The anger blazed in her eyes, and then subsided, and she stared at me, her eyes looking larger and brighter because they were wet now with salt and tears.\\n\\n \"Good-bye, my darling,\" I said. This was so extraordinary and painful.\\n\\n I went out into the heavy, drifting snow.\\n\\n The doors of the great cathedral of St. Patrick\u0027s were closed and bolted, and I stood at the foot of the stone steps looking up at the high Olympic Tower, wondering if Dora could see me as I stood here, freezing in the cold, and letting the snow strike my face, softly, persistently, harmfully, and with beauty.\\n\\n \"All right, Memnoch,\" I said aloud. \"No need to wait any longer.\\n\\n Come now, please, if you will.\"\\n\\n Immediately I heard the footsteps!\\n\\n It was as though they were echoing in the monstrous hollow of Fifth Avenue, among the hideous Towers of Babel, and I had cast my lot with the whirlwind.\\n\\n I turned round and round. There was not a mortal in sight!\\n\\n \"Memnoch the Devil!\" I shouted. \"I\u0027m ready!\"\\n\\n I was perishing with fear.\\n\\n \"Prove your point to me, Memnoch. You have to do that!\" I called.\\n\\n The steps were getting louder. Oh, he was up to his finest tricks.\\n\\n \"Remember, you have to make me see it from your point of view! That\u0027s what you promised!\"\\n\\n A wind was collecting, but from where I couldn\u0027t tell. All of the great metropolis seemed empty, frozen, my tomb. The snow swirled and thickened before the cathedral. The towers faded.\\n\\n I heard his voice right beside me, bodiless and intimate. \"All right, my beloved one,\" he said. \"We\u0027ll begin now.\" \\n\\n","sourceLink":"https://allnovel.net/memnoch-the-devil-the-vampire-chronicles-5/page-10.html","bookId":2213,"book":{"id":2213,"title":"Memnoch the Devil (The Vampire Chronicles #5)","description":"Storyline: Memnoch the Devil (The Vampire Chronicles #5) \\n The fifth volume of Rice\u0027s Vampire Chronicles is one of her most controversial books. The tale begins in New York, where Lestat, the coolest of Rice\u0027s vampire heroes, is stalking a big-time cocaine dealer and religious-art smuggler--this guy should get it in the neck. Lestat is also growing fascinated with the dealer\u0027s lovely daughter, a TV evangelist who\u0027s not a fraud. Lestat is also being stalked himself, by some shadowy guy who turns out to be Memnoch, the devil, who spirits him away. From here on, the book might have been called Interview with the Devil (by a Vampire). It\u0027s a rousing story interrupted by a long debate with the devil. Memnoch isn\u0027t the devil as ordinarily conceived: he got the boot from God because he objected to God\u0027s heartless indifference to human misery. Memnoch takes Lestat to heaven, hell, and throughout history.\\n","cover":"https://allnovel.net/images/memnoch-the-devil-the-vampire-chronicles-5.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/memnoch-the-devil-the-vampire-chronicles-5.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:18:25 PM"}}
