{"id":103024,"no":13,"title":"Page 13","content":"12\n G3D SAID: \u0027Wait!\u0027 So I found myself stopped at the gates of Heaven, along with all my companions, the angels who generally went and did what I did, and Michael and Gabriel and Uriel, though not among my companions, were there too.\n \" \u0027Memnoch, my accuser,\u0027 said God, and the words were spoken with the characteristic gentleness and a great effulgence of light. \u0027Before you come into Heaven, and you begin your diatribe, go back down to the Earth and study all you have seen thoroughly and with respect\u0026iexcl;\u0026ordf;by this I mean humankind\u0026iexcl;\u0026ordf;so that when you come to me, you have given yourself every chance to understand and to behold all I have done. I tell you now that Humankind is part of Nature, and subject to the Laws of Nature which you have seen unfold all along. No one should understand better than you, save I.\n \" \u0027But go, see again for yourself. Then, and only then, will I call together a convocation in Heaven, of all angels, of all ranks and all endowments, and I will listen to what you have to say. Take with you those who seek the same answers you seek and leave me those angels who have never cared, nor taken notice, nor thought of anything but to live in My Light.\u0027 \"\n Memnoch paused.\n We walked slowly along the bank of the narrow sea until we came to a place where several boulders made a natural place to sit and to rest. I wasn\u0027t feeling weariness in any real physical sense, but the change of posture seemed to sharpen all my fears, and concentration, and eagerness to hear what he said. He sat beside me, turned to me slightly on his left, and his wings once again faded. But first they rose, and stretched out, the left far above my head and the whole wingspan startling me. But then they disappeared. There simply wasn\u0027t room for them when Memnoch was seated, at least not for them to be folded behind him, so they were gone.\n He continued: \"Immediately following these words,\" he said, \"there was a great commotion in Heaven over who wanted to go down and examine the Creation with me and who did not. Now understand, angels were all over Creation as it was, as I\u0027ve told you, and many had already been years on Earth, and fallen in love with creeks, and valleys, and even the deserts which had begun to appear. But this was a special message the Lord had given me\u0026iexcl;\u0026ordf;Go and Learn All You Can About Mankind\u0026iexcl;\u0026ordf;and there was some question as to who was as interested or as passionate about the mysteries of the human race as was I.\"\n \"Wait a minute,\" I interrupted. \"If you forgive me. How many angels are there? You quoted God as saying \u0027all ranks,\u0027 and \u0027all endowments.\u0027 \"\n \"Surely you\u0027ve heard some of the truth,\" he answered, \"from the lore. God created us first\u0026iexcl;\u0026ordf;the archangels\u0026iexcl;\u0026ordf;Memnoch, Michael, Gabriel, Uriel, and many others whose names have never been discovered\u0026iexcl;\u0026ordf;either inadvertently or deliberately\u0026iexcl;\u0026ordf;so I would rather not say. The whole number of archangels? Fifty. And we were the First Made as I said, though who exactly came before whom has become a hysterical subject of argument in Heaven, and one in which I lost interest a long time ago. Besides, I\u0027m convinced I am the first anyway. But it doesn\u0027t matter.\n \"We are those who communicate in the most direct way with God, and also with Earth. That\u0027s why we have been labeled Guardian Angels, as well as Archangels, and sometimes in the religious literature we are given a low rank. We don\u0027t have a low rank. What we have is the greatest personality and the greatest flexibility, between God and man.\"\n \"I see. And Raziel? And Metatron? And Remiel?\"\n He smiled. \"I knew these names would be familiar to you,\" he said. \"They all have their place among the Archangels, but I cannot possibly explain all of this to you now. You\u0027ll know when you\u0027re dead. And also it\u0027s almost too much for a human mind, even a vampiric mind, such as your own, to comprehend.\"\n \"Very well,\" I said. \"But what you\u0027re saying is the names refer to actual entities. Sariel is an entity.\"\n \"Yes.\"\n \"Zagzagel.\"\n \"Yes, an entity. Now let me continue. Let me stick with the schemes. We, as I told you, are God\u0027s Messengers, and Most Powerful Angels, and I was fast becoming God\u0027s Accuser, as you can see!\" \"And Satan means accuser,\" I said. \"And all those other dreadful names you don\u0027t like are in some way connected with that idea. Accuser.\"\n \"Exactly,\" he replied. \"And the early religious writers, knowing only bits and pieces of the truth, thought it was man whom I accused, not God; but there are reasons for this, as you\u0027ll soon see. You might say I have become the Great Accuser of everybody.\" He seemed mildly exasperated, but then his voice resumed, very calm and measured. \"But my name is Memnoch,\" he reminded me, \"and there is no angel more powerful or clever than I am and there never was.\"\n \"I see,\" I said, meaning this to be polite. And also because I actually didn\u0027t question this statement at all. Why should I?\n \"The Nine Choirs?\" I asked.\n \"All there,\" he said. \"The Nine Choirs, of course, making up the bene ha elohim. And very well described by Hebrew and Christian scholars, thanks to times of revelation and perhaps disaster, though one would be hard put to determine the nature of each event. The First Triad is made of Three Choirs, the Seraphim, Cherubim, and Thrones or Ophanim, as I prefer to call them. And this First Triad is in general locked to the glory of God. They are in His thrall, thrive in the light which can blind or dazzle others, and almost never get very far from the light at all.\n \"At times when I am angry and making speeches to all of Heaven, I accuse them ... if you\u0027ll pardon the expression again\u0026iexcl;\u0026ordf;of being held to God as if by a magnet and not having a free will or personality such as we possess. But they have these things, they do, even the Ophanim, who are in general the least articulate or eloquent\u0026iexcl;\u0026ordf;in fact, Ophanim are likely to say nothing for eons\u0026iexcl;\u0026ordf;and any of these First Triad can be sent by God to do this and that, and have appeared on Earth, and some of the Seraphim have made rather spectacular appearances to men and women as well. To their credit, they adore God utterly, they experience without reserve the ecstasy of His presence, and He fills them completely so that they do not ask questions of Him and they are more docile, or more truly aware of God, depending on one\u0027s point of view.\n \"The Second Triad has Three Choirs which have been given the names by men of Dominations, Virtues, and Powers. But to tell the truth, there is very little difference between these angels and the First Triad. The Second Triad is a little farther from the Light of God and perhaps as close as it can come, given its endowments, and perhaps it is not so clever when it comes to logic or questions. Who knows?\n Certainly the Second is more docile altogether; but then there is more coming and going from the Second Triad, from Earth to Heaven, than from the devoted and magnetized and sometimes arrogant Seraphim. You can see how this could lead to much discussion.\"\n \"I think I understand it.\"\n \"Both triads sing continuously when they are in Heaven, and most of the time when they are on Earth; their songs rise to Heaven spontaneously and continuously; they don\u0027t erupt with the deliberate jubilation of my song or the songs of those like me. Nor do they fall silent for long periods as my kind\u0026iexcl;\u0026ordf;Archangels\u0026iexcl;\u0026ordf;are apt to do.\n \"When you\u0027re dead you\u0027ll be able to hear the song of all these triads. It would destroy you now if you did. I\u0027ve let you hear part of the Din of Heaven, but that\u0027s all it can be to you, a din\u0026iexcl;\u0026ordf;the sound of song and mingled laughter, and seemingly erratic eruptions of beautiful sound.\"\n I nodded. It had been both painful and gorgeous to hear it.\n \"The Lowest Triad is supposed to include Principalities, Archangels, and Angels,\" he continued, \"but this is misleading, as I said. For we, the Archangels, are in fact the most powerful and the most important, have the most personality, and are the most questioning and concerned.\n \"The other angels think we are flawed on that account. It does not occur to the average Seraph to plead for mercy for mankind.\n \"But here you have the rough scheme of things. The angels are innumerable. And there is mobility among angels, some drifting closer to God than others, and then away when the majesty is too great for them, and they choose to slip back and sing a softer song. It\u0027s continuous.\n \"Now, the important thing is that the Guardian Angels of Earth, the Watchers, those who became intent upon the Creation, came from all these ranks! Even from the very Seraphim there have come Guardians who have spent millions of years on Earth and then gone Home. Going and coming is common. The disposition I describe is innate but not fixed.\n \"Angels aren\u0027t perfect. You can see that already. They are Created Beings. They don\u0027t know everything God knows, that\u0027s obvious to you and everyone else. But they know a great deal; they know all that can be known in Time if they wish to know it; and that is where angels differ, you see. Some wish to know everything in Time, and some care only for God and God\u0027s reflection in those of His most devoted souls.\"\n \"I see, then. What you\u0027re saying is everybody\u0027s right about it, and everybody\u0027s sort of wrong.\"\n \"More right than wrong. Angels are individuals, that is the key. We Who Fell are no single species, unless being the brightest, the most clever, and the most comprehending makes us a species, which I don\u0027t think it does.\"\n \"Go on.\"\n He laughed. \"You think I\u0027m going to stop now?\"\n \"I don\u0027t know,\" I said. \"Where do I fit in? I don\u0027t mean me, Lestat de Lioncourt, I mean what I am . .. the vampire I am.\"\n \"You\u0027re an earthbound phenomenon, just like a ghost. We\u0027ll get to that in a moment. When God sent us down to Earth to Watch, specifically to observe all Mankind, we were as curious about the dead as the living\u0026iexcl;\u0026ordf;this wreath of souls we could see and hear, gathered about the world, and which we called Sheol immediately because it seemed to us that the realm of these weeping souls was the realm of pure gloom. \u0027Sheol\u0027 means gloom.\"\n \"And the spirit that made the vampires\u0026iexcl;\u0026ordf;\"\n \"Wait. It\u0027s very simple. Let me present it, however, as it came to me. If I don\u0027t do that, how can you understand my position? What I ask of you\u0026iexcl;\u0026ordf;to be my lieutenant\u0026iexcl;\u0026ordf;is so personal and so total that you can\u0027t fully grasp it unless you listen.\"\n \"Please go on.\"\n \"All right. A gathering of Angels decided to go with me, to draw as close as possible to Matter in order to pull together for ourselves our entire knowledge, to better comprehend, as God had asked us to do. Michael came with me. And so did a host of other archangels.\n There were a few Seraphim. There were a few Ophanim. And some of the lower orders which are the least intelligent angels, but nevertheless angels, and much in love with Creation and curious as to what was making me so angry with God.\n \"I can\u0027t give you the number of how many we were. But when we reached the earth, we went our separate ways to perceive things, and came together often and instantly and agreed upon what we had seen.\n \"What united us was our interest in the statement of God that Humankind was part of Nature. We just couldn\u0027t see how this was true. We went exploring.\n \"Very quickly, I learnt that men and women lived now in large groups, very unlike the other primates, that they built shelters for themselves, that they painted their bodies with various colors, that the women often lived separate from the men, and that they believed in something invisible. Now what was that? Was it the souls of the ancestors, the dearly departed who were still locked in the air of Earth, disembodied and confused?\n \"Yes, it was the souls of ancestors, but the humans worshipped other entities as well. They imagined a God who had made the Wild Beasts and to him they made blood sacrifice on Altars, thinking this aspect of Almighty God to be a personality of very distinct limits and rather easy to please or displease.\n \"Now, I can\u0027t say all this was a big surprise to me. I\u0027d seen the early signs of it. After all, I telescoped millions of years for you in my Revelations. But when I drew near to these altars, when I heard the specific prayer to the God of the Wild Animals; when I began to see the care and deliberation of the sacrifice\u0026iexcl;\u0026ordf;the slaying of a ram or a deer\u0026iexcl;\u0026ordf;I was much struck by the fact that not only had these humans come to look like Angels, but they had guessed at the truth.\n \"They had come upon it instinctively! There was a God. They knew. They didn\u0027t know what He was like but they knew. And this instinctive knowledge seemed to spring from the same essence as did their surviving spiritual souls. Let me be even clearer.\n \"Self-consciousness, and the awareness of one\u0027s own death\u0026iexcl;\u0026ordf;this had created a sense of distinct individuality in humans, and this individuality feared death; feared annihilation! Saw it, knew what it was, saw it happening. And prayed for a God that He would not let such a thing have no meaning in the world.\n \"And it was this very same tenacity\u0026iexcl;\u0026ordf;the tenacity of this individuality\u0026iexcl;\u0026ordf;that made the human soul stay alive after it left the body, imitating the shape of the body, holding itself together, so to speak, clinging to life, as it were, perpetuating itself, by shaping itself according to the only world it knew.\"\n I didn\u0027t speak. I was wound up in the story and only wanted for him to continue. But naturally I thought of Roger. I thought very distinctly of Roger because Roger was the only ghost I\u0027d ever known. And what Memnoch had just described was a highly organized and very willful version of Roger.\n \"Oh, yes, precisely,\" said Memnoch, \"which is probably why it is just as well that he came to you, though at the time I regarded it as one of the greatest annoyances in the world.\"\n \"You didn\u0027t want Roger to come to me?\"\n \"I watched. I listened. I was amazed, as you were, but I have been amazed by other ghosts before him. It wasn\u0027t that extraordinary, but no, it certainly wasn\u0027t something orchestrated by me, if that\u0027s what you mean.\"\n \"But it happened so close to your coming! It seems connected.\"\n \"Does it? What\u0027s the connection? Look for it inside yourself. Don\u0027t you think the dead have tried to speak before? Don\u0027t you think the ghosts of your victims have come howling after you? Admittedly, the ghosts of your victims usually pass in total bliss and confusion, unaware of you as the instrument of their death. But that\u0027s not always the case. Maybe what has changed is you! And as we know, you loved this mortal man, Roger, you admired him, you understood his vanity and love of the sacred and the mysterious and the costly, because you have these traits within yourself.\"\n \"Yes, all of that\u0027s true, without doubt,\" I said. \"I still think you had something to do with his coming.\"\n He was shocked. He looked at me for a long moment as if he were going to become angry, and then he laughed.\n \"Why?\" he asked. \"Why would I bother with such an apparition? You know what I\u0027m asking of you! You know what it means! You\u0027re no stranger to the mystical or the theological revelation. You knew when you were a living man\u0026iexcl;\u0026ordf;the boy back in France who realized he might die without knowing the meaning of the universe and ran to the village priest to demand of the poor fellow, \u0027Do you believe in God?\u0027\"\n \"Yes, but it just all happened at the same time. And when you claim there\u0027s no connection, I just... I don\u0027t believe it,\" I said.\n \"You are the damnedest creature! You really are!\" he said. His exasperation was mild and patient but still there. \"Lestat, don\u0027t you see that what impelled you towards the complexity of Roger and his daughter, Dora, was the same thing that compelled me to come to you? You had come to a point where you were reaching out for the supernatural. You were crying to Heaven to be laid waste! Your taking David, that was perhaps your first real step towards utter moral peril! You could forgive yourself for having made the child vampire Claudia, because you were young and stupid.\n \"But to bring David over, against his will! To take the soul of David and make it vampiric? That was a crime of crimes. That was a crime that cries to Heaven, for the love of God. David, whom we had an interest in him and whatever path he might take.\"\n \"Ah, so the appearance to David was deliberate.\"\n \"I thought I said so.\"\n \"But Roger and Dora, they were simply in the way.\"\n \"Yes. Of course, you chose the brightest and most alluring victim! You chose a man who was as good at what he did\u0026iexcl;\u0026ordf;his criminality, his racketeering, his thieving\u0026iexcl;\u0026ordf;as you are good at what you are. It was a bolder step. Your hunger is growing. It becomes ever more dangerous to you and those around you. You don\u0027t take the downfallen and the bereft and the cutthroats any longer. When you reached for Roger, you reached for the power and the glory, but so what?\" \"I\u0027m torn,\" I whispered.\n \"Why?\"\n \"Because I feel love for you,\" I said, \"and that\u0027s something I always pay attention to, as we both know. I feel drawn into you. I want to know what else you have to tell me! And yet I think you\u0027re lying about Roger. And about Dora. I think it is all connected. And when I think of God Incarnate\u0026iexcl;\u0026ordf;\" I broke off, unable to continue.\n I was flooded by the sensations of Heaven, or what I could still remember, what I could still feel, and the breath did leave me in a sorrow that was far greater than any I ever expressed in tears.\n I must have closed my eyes. Because when I opened them, I realized Memnoch was holding both my hands in his. His hands felt warm and very strong and uncommonly smooth. How cold my own must have felt to him. His hands were larger; flawless. My hands were ...my strange white, slender, glittering hands. My fingernails flashed like ice in the sun as they always do.\n He drew away, and it was excruciating. My hands remained rigid, clasped, and utterly alone.\n He was standing yards away from me, his back to me, looking out over the narrow sea. His wings were apparent, huge, and moving uneasily, as if an inner tension caused him to work the invisible muscular apparatus to which they were attached. He looked perfect, irresistible, and desperate.\n \"Maybe God is right!\" he said with rage in his low voice, staring not at me but at the sea.\n \"Right about what?\" I stood up.\n He wouldn\u0027t look at me.\n \"Memnoch,\" I said, \"please go on. There are moments when I feel I\u0027ll collapse beneath the things being made known to me. But go on. Please, please go on.\"\n \"That\u0027s your way of apologizing, isn\u0027t it?\" he asked gently. He turned around, towards me. The wings vanished. He walked slowly up to me, and past me, and sat down again on my right. His robe was hemmed in dust from the ground. I absorbed the detail before I actually thought about it. There was a tiny bit of leaf, green leaf, caught in the long flowing tangles of his hair.\n \"No, not really,\" I said. \"It wasn\u0027t an apology. I usually say exactly what I mean.\"\n I studied his face\u0026iexcl;\u0026ordf;the sculpted profile, the utter absence of hair on otherwise magnificently human-looking skin. Indescribable. If you turn and look at a statue in a Renaissance church, and you see it is bigger all over than you are, that it is perfect, you don\u0027t get frightened because it\u0027s stone. But this was alive.\n He turned as if he\u0027d just noticed I was looking at him. He stared down into my eyes. Then he bent forwards, his eyes very clear, and filled with myriad colors, and I felt his lips, smooth, evenly and modestly moist, touch my cheek. I felt a burn of life through the hard coldness of my self. I felt a raging flame that caught every particle of me, as only blood can do it, living blood. I felt a pain in my heart. I might have laid my finger on my chest in the very place.\n \"What do you feel!\" I asked, refusing to be ravaged.\n \"I feel the blood of hundreds,\" he whispered. \"I feel a soul who has known a thousand souls.\"\n \"Known? Or merely destroyed?\"\n \"Will you send me away out of hatred for yourself?\" he asked.\n \"Or shall I continue with my story?\"\n \"Please, please go on.\"\n \"Man had invented or discovered God,\" he said. His voice was calm now and back to the same polite and almost humble instructive manner. \"And in some instances, tribes worshipped more than one such deity who was perceived to have created this or that part of the world. And yes, humans knew of the souls of the dead surviving; and they did reach out to these souls and make offerings to them. They brought offerings to their graves. They cried out to these dead souls. They begged for their help in the hunt, and in the birthing of a child, in all things.\n Rum we angels peered into Sheol, as we passed into it, invisible, our essence causing no disturbance in a realm that was purely souls at that point ...souls and nothing but souls ... we realized these souls were strengthened in their survival by the attentions of those living on earth, by the love being sent to them by humans, by the thoughts of them in human minds. It was a process.\n \"And just as with angels, these souls were individuals with varying degrees of intellect, interest, or curiosity. They were hosts as well to all human emotions, though in many, mercifully, all emotion was on the wane.\n \"Some souls, for example, knew they were dead, and sought to respond to the prayers of their children, and actively attempted to advise, speaking with all the power they could muster in a spiritual voice. They struggled to appear to their children. Sometimes they broke through for fleeting seconds, gathering to themselves swirling particles of matter by the sheer force of their invisible essence. Other times they made themselves visible in dreams, when the soul of the sleeping human was opened to other souls. They told their children of the bitterness and darkness of death, and that they must be brave and strong in life. They gave their children advice.\n \"And they seemed, in some instances at least, to know that the belief and attention of their sons and daughters strengthened them. They requested offerings and prayers, they reminded the children of their duty. These souls were to some extent the least confused, except for one thing. They thought they had seen all there was to be seen.\" \"No hint of Heaven?\" I asked.\n \"No, and no light from Heaven penetrated Sheol, nor any music. From Sheol one saw the darkness and the stars, and the people of Earth.\"\n \"Unbearable.\"\n \"Not if you think you are a god to your children and can still derive strength from the mere sight of the libations they pour on your grave. Not if you feel pleasure in those who hearken to your advice and anger at those who don\u0027t, and not if you can communicate occasionally, sometimes with spectacular results.\"\n \"I see, of course. And gods they seemed to their children.\"\n \"Ancestral gods of a certain kind. Not the Creator of All. Human beings had distinct ideas on both questions, as I\u0027ve said.\n \"I became greatly absorbed with this whole question of Sheol. I traveled the length and breadth of Sheol. Some of these souls didn\u0027t know they were dead. They knew only they were lost and blind and miserable and they cried all the time like infant humans. They were so weak I don\u0027t even think they felt the presence of other souls.\n \"Other souls were clearly deluded. They thought they were still alive! They chased after their kindred, trying vainly to get the oblivious son or daughter to listen, when of course the kindred could not hear or see them; and these, these who thought they were still living, well, these had no presence of mind to gather matter to make themselves appear or to come to the living in a dream, because they didn\u0027t know they were dead.\"\n \"Yes.\"\n \"To continue, some souls knew they were ghosts when they came to mortals. Others thought they were alive and the whole world had turned against them. Others simply drifted, seeing and hearing the sounds of other living beings but remote from this as if in a stupor or dream. And some souls died.\n \"Before my very eyes, some died. And soon I realized many were dying. The dying soul would last a week, perhaps a month in human time, after its separation from the human body, retaining its shape, and then begin to fade. The essence would gradually disperse, just as did the essence inside an animal upon its death. Gone into the air, returned perhaps to the energy and essence of God.\"\n \"That\u0027s what happened?\" I asked desperately. \"Their energy went back into the Creator; the light of a candle returned to the eternal fire?\"\n \"I don\u0027t know. And that I didn\u0027t see, little flames wafted to Heaven, drawn aloft by a mighty and loving blaze. No, I saw nothing of the kind.\n \"From Sheol the Light of God was not visible. For Sheol, the consolation of God did not exist. Yet these were spiritual beings, made in our image and His image, and clinging to that image and hungering for a life beyond death. That was the agony. The hunger for the life beyond death.\"\n \"If that was absent at the time of the death, would the soul simply be extinguished?\" I asked.\n \"No, not at all. The hunger seemed innate. The hunger had to die out in Sheol before the soul would disintegrate. Indeed, souls went through many, many experiences in Sheol, and those who had become the strongest were those who perceived themselves as gods, or humans passed into the realm of the good God, and attentive to humans; and these souls gained power even to sway the others and strengthen them sometimes and keep them from fading away.\"\n He paused as if not sure how to proceed. Then, he went on: \"There were some souls who understood things in a different way. They knew they weren\u0027t gods. They knew they were dead humans. They knew they didn\u0027t really have the right to change the destiny of those who prayed to them; they knew that the libations essentially were symbolic. These souls understood the meaning of the concept symbolic. They knew. And they knew they were dead and they perceived themselves to be lost. They would have reentered the flesh if they could have. For there in the flesh was all the light and warmth and comfort that they had ever known and could still see. And sometimes these souls managed to do exactly that!\n \"I witnessed it in various different fashions. I saw these souls deliberately descend and take possession of a stupefied mortal, take over his limbs and brain and live in him until the man gained the strength to throw the soul off. You know these things. All men do\u0026iexcl;\u0026ordf;what is involved in possession. You have possessed a body that wasn\u0027t yours, and your body has been possessed by another soul.\" \"Yes.\"\n \"But this was the dawn of such invention. And to watch these clever souls learn the rules of it, to see them grow ever more powerful, was something to behold.\n \"And what I could not fail to be frightened by, being the Accuser as I am, and horrified by Nature, as God calls it, what I could not ignore was that these souls did have an effect on living women and men! There were those living humans already who had become oracles. They would smoke or drink some potion to render their own minds passive, so that a dead soul might speak with their voice!\n \"And because these powerful spirits\u0026iexcl;\u0026ordf;for I should call them spirits now\u0026iexcl;\u0026ordf;because these powerful spirits knew only what Earth and Sheol could teach them, they might urge human beings on to terrible mistakes. I saw them order men into battle; I saw them order executions. I saw them demand blood sacrifice of human beings.\"\n \"You saw the Creation of Religion out of Man,\" I said.\n \"Yes, insofar as Man can Create anything. Let us not forget Who Created us all.\"\n \"The other angels, how did they fare with these revelations?\"\n \"We gathered, exchanged stories in amazement, then went off again on our own explorations; we were more entangled with the earth than we had ever been. But essentially, the reactions of angels varied. Some, the Seraphim mainly, thought the whole process was downright marvelous; that God deserved a thousand anthems in praise that his Creation should lead to a being who could evolve an invisible deity from itself who would then command it to ever greater efforts at survival or war.\n \"Then there were those who thought, \u0027This is an error, this is an abomination! These are the souls of humans pretending to be Gods! This is unspeakable and must be stopped immediately.\u0027\n \"And then there was my passionate reaction: \u0027This is really ghastly and it is headed for worse and worse disasters! This is the beginning of an entirely new stage of human life, bodiless, yet purposeful and ignorant, which is gaining momentum every second, and filling the atmosphere of the world with potent interfering entities as ignorant as the humans round whom they swirled.\u0027 \"\n \"Surely some of the other angels agreed with you.\"\n \"Yes, some were as vehement, but as Michael said, \u0027Trust in God, Memnoch, Who has done this. God knows the Divine Scheme.\u0027\n \"Michael and I had the most extensive dialogues. Raphael and Gabriel and Uriel had not come down, by the way, as part of this mission. And the reason for that is fairly simple. Almost never do all of those four go the same way. It\u0027s a law with them, a custom, a ... a vocation, that two are always on hand in heaven for the call of God; and never do all four leave at once. In this instance, Michael was the only one who wanted to come.\n \"Does this Archangel Michael still exist now?\"\n \"Of course he exists! You\u0027ll meet him. You could meet him now if you wish, but no, he wouldn\u0027t come now. He wouldn\u0027t. He\u0027s on the side of God. But you\u0027ll be no stranger to him if you join with me. In fact, you might be surprised by how sympathetic Michael can be to my endeavors. But my endeavors are not unreconcilable to heaven, surely, or I would not be allowed to do what I do.\"\n He looked sharply at me.\n \"All those of the bene ha elohim whom I describe to you are alive now. They are immortal. How could you think it would be any other way? Now, there were souls in Sheol at that time who no longer exist, not in any form I know of, but perhaps they do in some form known to God.\"\n \"I understand. It was a stupid-sounding question,\" I admitted.\n \"As you watched all this, as it filled you with fear, how did you relate it to God\u0027s statement about nature? That you would see humankind were part of nature.\"\n \"I couldn\u0027t except in terms of the endless exchange of energy and Matter. The souls were energy; yet they retained a knowledge from Matter. Beyond that, I could not reconcile it. But for Michael, there was another view. We were on a stairway, were we not? The lowest molecules of inorganic matter constituted the lowest steps. These disembodied souls occupied the step above man yet below angels. It was all one flowing procession to Michael, but then again, Michael trusted that God was doing all this deliberately and wanted it this way.\n \"I could not believe this! Because the suffering of the souls horrified me. It hurt Michael too. He covered his ears. And the death of the souls horrified me. If souls could live, then why not let all know!\n And were they doomed forever to exist in this gloom? What else in nature remained so static? Had they become as sentient asteroids forever orbiting the planet, moons that could scream and cry and weep? \"I asked Michael, \u0027What will happen? Tribes pray to different souls. These souls become their gods. Some are stronger than others. Look at the war everywhere, the battle.\u0027\n \" \u0027But Memnoch,\u0027 he said, \u0027primates did this before they had souls. Everything in Nature eats and is eaten. This is what God has been trying to tell you since you first began to cry out in protest at the sound of suffering from the Earth. These soul-god-spirits are expressions of humans, and part of humankind, born of humans and sustained by humans, and even if these spirits grow in strength to where they can manipulate living people exquisitely, they are nevertheless born out of Matter and part of Nature as God said.\u0027\n \" \u0027So nature is this unspeakable unfolding horror,\u0027 I said. \u0027It is not enough that a shark swallows whole the infant dolphin and that the butterfly is crushed in the teeth of the wolf who chews it up, oblivious to its beauty. It\u0027s not enough. Nature must go further, and spin from matter these spirits in torment. Nature comes this close to Heaven, but is so far short of it that only Sheol will do for the name of this place.\u0027\n \"This speech was too much for Michael. One cannot speak this way to the Archangel Michael. Just doesn\u0027t work. So at once he turned away from me, not angrily, not in cowardice that God\u0027s thunderbolt might miss me by a fraction and shatter his left wing. But he turned away in silence, as if to say, Memnoch you are impatient and unwise. Then he turned and mercifully said, \u0027Memnoch, you do not look deep enough. These souls have only begun their evolution. Who knows how strong they may become? Man has stepped into the invisible. What if he is meant to become as we are?\u0027\n \" \u0027But how is that to happen, Michael?\u0027 I demanded. \u0027How are these souls to know what are angels and what is Heaven? Do you think if we made ourselves visible to them and told them that they ...\u0027 I stopped. Even I knew this was unthinkable. I wouldn\u0027t have dared. Not in millions of years would I have dared.\n \"But no sooner had this thought occurred to us, had we begun brooding over it, than other angels gathered with us, and said, \u0027Look, living people know that we are here.\u0027\n \" \u0027How so?\u0027 I demanded. As sorry as I felt for humanity, I didn\u0027t consider mortal men and women very smart. But these angels explained immediately.\n \" \u0027Some have sensed our presence. They sense it as they sense the presence of a dead soul. It is the same part of the brain which perceives other things invisible; I tell you we have been glimpsed and we shall now be imagined by these people. You will see.\u0027\n \" \u0027This can\u0027t be God\u0027s wish,\u0027 said Michael. \u0027I say we return to Heaven at once.\u0027\n \"The majority agreed with him instantly, the way angels agree, without a sound. I stood alone looking at the entire multitude.\n \" \u0027Well?\u0027 I said. \u0027God has given me my mission. I cannot go back until I understand,\u0027 I insisted. \u0027And I don\u0027t understand.\u0027\n \"There ensued a huge argument. But finally Michael kissed me as angels always kiss, tenderly on the lips and cheeks, and went up to Heaven, and the whole league ascended with him.\n \"And I remained, standing on the earth alone. I did not pray to God; I did not look to men; I looked into myself and I thought, What shall I do? I do not wish to be seen as an angel. I do not wish to be worshipped like these surviving souls. I do not wish to anger God; but I have to fulfill His commandment to me. I have to understand. Now, I am invisible. But what if I can do what these clever souls do\u0026iexcl;\u0026ordf;that is, gather matter to me to make for myself a body\u0026iexcl;\u0026ordf;gather sufficient tiny particles from all the world\u0026iexcl;\u0026ordf;and who knows better than I do what a man is made of, having seen him evolve from his earliest stages, who knows better the makeup of tissue and cell and bone and fiber and brain matter than I know? Except God?\n \"So I did it. I focused my entire will and strength upon constructing for myself a living sheath of human flesh, complete in all parts, and I chose\u0026iexcl;\u0026ordf;without even thinking about it\u0026iexcl;\u0026ordf;to be male. Does this require an explanation?\"\n \"Not really,\" I said. \"I would imagine you had seen enough of rape, childbirth, and helpless struggle to make the wiser choice. I know I have.\"\n \"Correct. But sometimes I wonder. Sometimes I wonder if things would have been entirely different if I had chosen to be female. I could have. The females resemble us more, truly. But if we are both, then surely we are more male than female. It is not in equal parts.\" \"From what you\u0027ve shown me of yourself, I tend to agree.\"\n \"So. I became sheathed in flesh. It took a little longer than one might suppose. I had to consciously evoke every bit of knowledge in my angelic memory; I had to construct the body, and then insert my essence in it exactly in the manner in which the natural life essence would have been inside it; and I had to surrender, that is, encase myself within this body, really go into it, and fill out its limits and not panic. Then I had to look through its eyes.\"\n I nodded quietly with a trace of a smile. Having given up my vampire body for a human one, I could perhaps imagine a small particle of what Memnoch had experienced. I wasn\u0027t about to boast that I understood.\n \"The process involved no pain,\" he said. \"Only submission. And for no good reason, really, or I should say from simple Nature, to use God\u0027s favorite word, I sheathed my own self, my own essence in flesh. Only the wings-did I leave out of the scheme altogether, and so I stood as tall as an angel, and as I walked to the water of a clear pool near me and looked down in it, I saw Memnoch for the first time in material form. I saw exactly myself, my fair hair, my eyes, my skin, all the gifts God had given me in invisible form made manifest in flesh. \"I realized immediately that this was too much! I was too large all over; I was blazing with the essence inside me! This would not work. And so instantly I began to reshape and scale down the entire body until it resembled more myself the size of a man.\n \"You\u0027ll know how to do all this once you\u0027re with me,\" he said, \"if you choose to come, and die, and be my lieutenant. But let me say for now that this is neither impossible nor terribly simple. It is not like pressing the keys of a complex computer program and sitting back and watching the machine execute the commands one by one. On the other hand, it is not cumbersome and overly conscious. It merely takes angelic knowledge, angelic patience, and angelic will.\n \"Now a man stood beside the pool, naked, blond of hair and light of eye, very similar to many of those who inhabited the region, though perhaps more nearly perfect, and endowed with physical organs of reasonable but not splendid size.\n \"Now as my essence went into these organs, into the scrotum and the penis, to be specific, I felt something which had been utterly unknown to me as an angel. Utterly unknown. It was compounded of many realizations. I knew gender, I knew maleness; I knew a certain human vulnerability firsthand now rather than from watching and sensing; and I was very surprised at how powerful I felt.\n \"I had expected to be quaking with humility in this form! To be shivering with indignity at the mere smallness of myself, and my immobility and a host of other things\u0026iexcl;\u0026ordf;things you felt when you swapped your vampire body for that of a man.\"\n \"I remember vividly.\"\n \"But I didn\u0027t feel this. I had never been material. I had never, never thought about doing it. I had never, never even thought of wanting to see what I might look like in an earthly mirror. I knew my image from its reflection in the eyes of other angels. I knew my parts because I could see them with my angelic eyes.\n \"But now I was a man. I felt the brain inside my skull. I felt its wet, intricate, and near-chaotic mechanics; its layers and layers of tissue, involving as it does the earliest stages of evolution, and wedding them to a wealth of higher cells in the cortex in a manner that seemed utterly illogical and yet totally natural\u0026iexcl;\u0026ordf;natural if you knew what I, as an angel, knew.\"\n \"Such as what?\" I asked, making it as polite as I could.\n \"Such as that emotions stirred in the limbic part of my brain could take hold of me without having first made themselves known to my consciousness,\" he said. \"That can\u0027t happen with an angel. Our emotions cannot slip by our conscious minds. We cannot feel irrational terror. At least I don\u0027t think so. And whatever the case, I certainly didn\u0027t think so then when I stood on the earth, in the flesh of a man.\"\n \"Could you have been wounded, or killed, in this form?\" I asked.\n \"No. I\u0027ll get to that in a minute, as a matter of fact. But as I was in a wild, wooded area, as I was in this very valley which is Palestine, if you would know it, before it was ever called Palestine, as I was here, I was aware that this body was food for wild animals, and so I did create around myself, of angelic essence, an extremely strong shield. It behaved electrically. That is, when an animal approached me, which happened almost immediately, it was repulsed by this shield.\n \"And thus shielded, I decided to start walking all through the nearby settlements of men and to look at things, knowing full well no one could hurt me or push me or attack me or anything else. Yet I would not appear miraculous. On the contrary, I would seem to dodge the blows if any were dealt, and I would seek to behave in such a matter that nobody noticed me at all.\n \"I waited for nightfall, and went to the nearest encampment, which was the largest in the area and had grown so in strength that it now exacted tribute from other encampments nearby. This was a huge circular walled gathering place, full of individual huts in which men and women lived. Fires burnt in each hut. There was a central place where everyone gathered. There were gates to be locked at night.\n \"I slipped inside, slumped down beside a hut, and watched for hours what the people of this encampment did in the twilight and then by dark. I crept from place to place. I peered inside the little doorways. I watched many things.\n \"The next day, I watched from the forest. I tracked a band of hunters, so that they did not see me, but I could see them. When I was glimpsed, I ran, which seemed the acceptable and predictable behavior. Nobody chased me.\n \"I hung around the thriving life of these humans for three days and three nights, and during this time, I knew their limits, I knew their bodily needs and aches, and I had gradually come to know their lust, because all of a sudden, I discovered it flaming inside of me.\n \"This is how it happened. Twilight. The third day. I had come to an entire score of conclusions as to why these people were not part of Nature. I had an entire case to make to God. I was almost about to leave.\n \"But one thing which has always fascinated angels, and which I had not experienced in the flesh, was sexual union. Now as an invisible angel one can come quite close to those coupled, and see into their half-shut eyes, and hear their cries, and touch the flushed flesh of the woman\u0027s breast and feel her heart race.\n \"Countless times I\u0027d done this. And I realized now that passionate union\u0026iexcl;\u0026ordf;a true experience of it\u0026iexcl;\u0026ordf;could be crucial to my case. I knew thirst, I knew hunger, I knew pain, I knew weariness, I knew about how these people lived and felt and thought and talked to each other. But I really didn\u0027t know what happened in sexual union.\n \"And at twilight on the third day, as I stood by this very sea, here, far, far from the encampment, looking towards it miles to our right, there came towards me as if out of nowhere a beautiful woman\u0026iexcl;\u0026ordf;a daughter of man.\n \"Now, I had seen scores of beautiful women! As I told you, when I first beheld the beauty of women ... before men had become quite so smooth and hairless ... it had been one of the shocks of Physical Evolution for me. And of course during these three days, I had from afar studied many beautiful women. But, in my subterfuge, I hadn\u0027t dared to go very close. After all, I was in the flesh and trying to go unnoticed.\n \"But three days, mark me, I had had this body. And the organs of this body, being perfectly made, responded at once to the sight of this woman, who came walking boldly along the banks of the sea, a rebel woman, without a guardian male or other females, a young, bold, slightly angry, longhaired and beautiful girl.\n \"Her garment was no more than a coarse animal skin, with a chewed leather belt around it, and she was barefoot and her legs were naked from the knee down. Her hair was long and dark, and her eyes blue\u0026iexcl;\u0026ordf;a beguiling combination. And her face very youthful yet full of the character imparted to a face by anger and rebellion\u0026iexcl;\u0026ordf;a girl filled with pain and recklessness and some desire to do herself harm. \"She saw me.\n \"She stopped, realizing her vulnerability. And I, never having bothered with garments, stood naked, looking at her. And the organ in me wanted her, wanted her immediately and violently; and I felt the first promise of what that union might be like. That is, the first stirring of real desire. For three days, I had lived by the mind as an angel. Now the body spoke and I listened with an angel\u0027s ears.\n \"She meantime did not run from me, but took several steps closer; and in her reckless heart made a resolution, based upon what experience I couldn\u0027t know, but she made it; that she would open her arms to me if I wanted her. And with the smoothest, most graceful movement of her hips, and with a gesture of her right hand, lifting her hair and then dropping it, she let me know.\n \"I went to her and she took my hand and led me up those rocks, there, to where the cave is, you can see it, just over your left shoulder and up the slope. She took me there, and by the time we reached the entrance, I realized that she was flaming for me as I was flaming for her.\n \"She was no virgin, this girl. Whatever her story, she was not ignorant of passion. She knew what it was, and she wanted it, and the lunge of her hips towards me was deliberate, and when she kissed me and put her tongue into my mouth, she knew what she sought.\n \"I was overcome. For one instant I held her back, merely to look at her, in her mysterious material beauty, a thing of flesh and decay that nevertheless rivaled any angel I\u0027d ever seen, and then I gave her back her kisses, brutally, making her laugh and push her breasts against me.\n \"Within seconds, we had fallen down together on the mossy floor of the cave as I had seen mortals do a thousand times. And when my organ went inside of her, when I felt the passion, I knew then what no angel could possibly know! It had nothing to do with reason, or observation, or sympathy, or listening, or learning, or trying to grasp. I was in her flesh and consumed with lust, and so was she, and the tender muscles of her hairy little vaginal mouth clamped down upon me as if she meant to devour me, and as I thrust inside of her, again and again, she went blood red in her consummation, and her eyes rolled back into her head and her heart stood still.\n \"I came at the same moment. I felt the ejaculate shoot from my body into her. I felt it fill the warm, tight cavity. My body continued to writhe with the same rhythm, and then the feeling, the indescribable and wholly new feeling, slowly ebbed and went away.\n \"I lay exhausted beside her, my arm over her, and my mouth sought the side of her face and kissed her, and I said in her language, in a rush of words, \u0027I love you, I love you, I love you, sweet and beautiful creature, I love you!\u0027\n \"And to this she gave a yielding and respectful smile, and snuggled close to me, and then seemed about to weep. Her carelessness had led her to a tenderness! Her soul suffered inside her, and I felt it through the palms of her hands!\n \"But in me there was a tumult of knowledge! I had felt the orgasm! I had felt the highly developed physical sensations that come to fulfillment when humans sexually mate! I stared at the ceiling of the cave, unable to move, unable to speak.\n \"Then very gradually, I realized something had startled her. She clung to me, then she rose on her knees, and she ran away.\n \"I sat up. The light had come down from Heaven! It was coming down from Heaven and it was God\u0027s light and it was looking for me! I rushed to my knees and to my feet and ran out into the light.\n \" \u0027Here I am, Lord!\u0027 I cried. \u0027Lord, I am full of joy! Lord, God, what I have felt, Lord!\u0027 And I let out a great anthem, and as I did so the material particles of my body dissolved about me, shorn off by me, almost as if by the power of my angel voice, and I rose to my full height and spread my wings and sang in thanks to Heaven, for what I had known in this woman\u0027s arms.\n \"The voice of God came quiet yet full of wrath.\n \" \u0027Memnoch!\u0027 He said. \u0027You are an Angel! What is an Angel, a Son of God, doing with a Daughter of Men!\u0027\n \"Before I could answer, the light had withdrawn and left me with the whirlwind, and turning, my wings caught in it, I saw the mortal woman was only there, at the bank of the sea, and that she had seen and heard something inexplicable to her, and now in terror she fled.\n \"She ran and I was carried upwards to the very gates of Heaven, and then those gates for the first time took on height and shape for me as they had for you, and they were slammed shut against me, and the Light struck me and down I went, forced down, plummeting as you plummeted in my arms, only I was alone, alone as I was slammed again, invisible, but bruised and broken and crying, against the wet earth.\n \" \u0027You, my Watcher, what have you done!\u0027 said the voice of God, small and certain by my ear.\n \"I started to weep, uncontrollably. \u0027Lord, God, this is a terrible misunderstanding. Let me... let me lay my case before you\u0026iexcl;\u0026shy;\u0027\n \" \u0027Stay with the mortals you love so much!\u0027 He said. \u0027Let them minister to you, for I will not listen until my anger is cooled. Embrace the flesh you crave, and with which you are polluted. You won\u0027t come into my sight again until I send for you, and that shall be by my choice.\u0027\n \"The wind rose again, swirling, and as I turned over on my back, I realized I was wingless, and in the flesh once more and the size of a man.\n \"I was in the body I had created for myself, generously reassembled for me by the Almighty, down to the last cell, and I lay hurting and aching and weak on the ground, moaning, and sad.\n \"I had never heard myself cry before with a human voice. I was not loud. I was not full of challenge or desperation. I was too sure of myself still as an Angel. I was too sure God loved me. I knew He was angry, yes, but He\u0027d been angry with me many, many times before.\n \"What I felt was the agony of separation from Him! I could not at will ascend to Heaven! I could not leave this flesh. And as I sat up and lifted my arms, I realized I was trying to do this with my whole being, and I couldn\u0027t do it, and then sadness came over me, so great, so lonely, and so total that I could only bow my head.\n \"The night had begun. The stars filled the firmament and were as distant from me as if I had never known Heaven at all. I closed my eyes, and I heard the souls of Sheol wailing. I heard them pressing near me, asking me what I was, what had they witnessed, whence had I been thrown to the earth? Before I had gone unnoticed, my transformation having been quiet and secret, but when God had thrust me downwards, I had fallen spectacularly as an angel and immediately into the shape of a man.\n \"All Sheol was crying in curiosity and foment.\n \" \u0027Lord, what do I say to them? Help me!\u0027 I prayed.\n \"And then came the perfume of the woman near me. I turned and I saw her creeping towards me cautiously, and, when she saw my face, when she saw my tears and my distress, she came boldly towards me, slipping her warm breasts against my chest again, and clasping in her trembling hands my head.\" \n","sourceLink":"https://allnovel.net/memnoch-the-devil-the-vampire-chronicles-5/page-13.html","bookId":2213,"book":{"id":2213,"title":"Memnoch the Devil (The Vampire Chronicles #5)","description":"Storyline: \n Memnoch the Devil (The Vampire Chronicles #5) \n The fifth volume of Rice\u0027s Vampire Chronicles is one of her most controversial books. The tale begins in New York, where Lestat, the coolest of Rice\u0027s vampire heroes, is stalking a big-time cocaine dealer and religious-art smuggler--this guy should get it in the neck. Lestat is also growing fascinated with the dealer\u0027s lovely daughter, a TV evangelist who\u0027s not a fraud. Lestat is also being stalked himself, by some shadowy guy who turns out to be Memnoch, the devil, who spirits him away. From here on, the book might have been called Interview with the Devil (by a Vampire). It\u0027s a rousing story interrupted by a long debate with the devil. Memnoch isn\u0027t the devil as ordinarily conceived: he got the boot from God because he objected to God\u0027s heartless indifference to human misery. Memnoch takes Lestat to heaven, hell, and throughout history.\n \n","cover":"https://allnovel.net/images/memnoch-the-devil-the-vampire-chronicles-5.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/memnoch-the-devil-the-vampire-chronicles-5.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:18:25 PM"}}
