{"id":110558,"no":11,"title":"Page 11","content":"ELEVEN \"YOU NEED SOMETHING TO WEAR?\" Lissa asked. \"Hmm?\" I glanced over at her. We were waiting for Mr. Nagy\u0027s Slavic art class to start, and I was preoccupied with listening to Mia adamantly deny the claims about her parents to one of her friends. \"It\u0027s not like they\u0027re servants or anything,\" she exclaimed, clearly flustered. Straightening her face, she tried for haughtiness. \"They\u0027re practically advisors. The Drozdovs don\u0027t decide anything without them.\" I choked on a laugh, and Lissa shook her head. \"You\u0027re enjoying this way too much.\" \"Because it\u0027s awesome. What\u0027d you just ask me?\" I dug through my bag, messily looking for my lip gloss. I made a face when I found it. It was almost empty; I didn\u0027t know where I was going to score some more. \"I asked if you need something to wear tonight,\" she said. \"Well, yeah, of course I do. But none of your stuff fits me.\" \"What are you going to do?\" I shrugged my shoulders. \"Improvise, like always. I don\u0027t really care anyway. I\u0027m just glad Kirova\u0027s letting me go.\" We had an assembly tonight. It was November 1, All Saints\u0027 Day - which also meant we\u0027d been back almost a month now. A royal group was visiting the school, including Queen Tatiana herself. Honestly, that wasn\u0027t what excited me. She\u0027d visited the Academy before. It was pretty common and a lot less cool than it sounded. Besides, after living among humans and elected leaders, I didn\u0027t think much of stiff royals. Still, I\u0027d gotten permission to go because everyone else would be there. It was a chance to hang out with actual people for a change and not stay locked in my dorm room. A little freedom was definitely worth the pain of sitting through a few boring speeches. I didn\u0027t stay to chat with Lissa after school like I usually did. Dimitri had stuck to his promise about extra trainings, and I was trying to stick to mine. I now had two additional hours of practice with him, one before and one after school. The more I watched him in action, the more I understood the badass-god reputation. He clearly knew a lot - his six molnija marks proved as much - and I burned to have him teach me what he knew. When I arrived at the gym, I noticed he was wearing a T-shirt and loose running pants, as opposed to his usual jeans. It was a good look for him. Really good. Stop looking, I immediately told myself. He positioned me so that we stood facing each other on the mat and crossed his arms. \"What\u0027s the first problem you\u0027ll run into when facing a Strigoi?\" \"They\u0027re immortal?\" \"Think of something more basic.\" More basic than that? I considered. \"They could be bigger than me. And stronger.\" Most Strigoi - unless they\u0027d been human first - had the same height as their Moroi cousins. Strigoi also had better strength, reflexes, and senses than dhampirs. That\u0027s why guardians trained so hard; we had a \"learning curve\" to compensate for. Dimitri nodded. \"That makes it difficult but not impossible. You can usually use a person\u0027s extra height and weight against them.\" He turned and demonstrated several maneuvers, pointing out where to move and how to strike someone. Going through the motions with him, I gained some insight into why I took such a regular beating in group practice. I absorbed his techniques quickly and couldn\u0027t wait to actually use them. Near the end of our time together, he let me try. \"Go ahead,\" he said. \"Try to hit me.\" I didn\u0027t need to be told twice. Lunging forward, I tried to land a blow and was promptly blocked and knocked down onto the mat. Pain surged through my body, but I refused to give in to it. I jumped up again, hoping to catch him off guard. I didn\u0027t. After several more failed attempts, I stood up and held out my hands in a gesture of truce. \"Okay, what am I doing wrong?\" \"Nothing.\" I wasn\u0027t as convinced. \"If I wasn\u0027t doing anything wrong, I\u0027d have rendered you unconscious by now.\" \"Unlikely. Your moves are all correct, but this is the first time you\u0027ve really tried. I\u0027ve done it for years.\" I shook my head and rolled my eyes at his older-and-wiser manner. He\u0027d once told me he was twenty-four. \"Whatever you say, Grandpa. Can we try it again?\" \"We\u0027re out of time. Don\u0027t you want to get ready?\" I looked at the dusty clock on the wall and perked up. Almost time for the banquet. The thought made me giddy I felt like Cinderella, but without the clothes. \"Hell, yeah, I do.\" He walked off ahead of me. Studying him carefully, I realized I couldn\u0027t let the opportunity go by. I leapt at his back, positioning myself exactly the way he\u0027d taught me. I had the element of surprise. Everything was perfect, and he wouldn\u0027t even see me coming. Before I could make contact, he spun around at a ridiculously high speed. In one deft motion, he grabbed me like I weighed nothing and threw me to the ground, pinning me there. I groaned. \"I didn\u0027t do anything wrong!\" His eyes looked levelly into mine as he held my wrists, but he didn\u0027t look as serious as he had during the lesson. He seemed to find this funny. \"The battle cry sort of gave you away. Try not to yell next time.\" \"Would it have really made a difference if I\u0027d been quiet?\" He thought about it. \"No. Probably not.\" I sighed loudly, still in too much of a good mood to really let this disappointment get me down. There were some advantages to having such a kick-ass mentor - one who also happened to have a foot of height on me and outweighed me considerably. And that wasn\u0027t even considering his strength. He wasn\u0027t bulky but his body had a lot of hard, lean muscle. If I could ever beat him, I could beat anyone. All of a sudden, it occurred to me that he was still holding me down. The skin on his fingers was warm as he clutched my wrists. His face hovered inches from my own, and his legs and torso were actually pressing against mine. Some of his long brown hair hung around his face, and he appeared to be noticing me too, almost like he had that night in the lounge. And oh God, did he smell good. Breathing became difficult for me, and it had nothing to do with the workout or my lungs being crushed. I would have given anything to be able to read his mind right then. Ever since that night in the lounge, I\u0027d noticed him watching me with this same, studious expression. He never actually did it during the trainings themselves - those were business. But before and after, he would sometimes lighten up just a little, and I\u0027d see him look at me in a way that was almost admiring. And sometimes, if I was really, really lucky, he\u0027d smile at me. A real smile, too - not the dry one that accompanied the sarcasm we tossed around so often. I didn\u0027t want to admit it to anyone - not to Lissa, not even to myself - but some days, I lived for those smiles. They lit up his face. \"Gorgeous\" no longer adequately described him. Hoping to appear calm, I tried to think of something professional and guardian-related to say. Instead, I said, \"So um...you got any other moves to show me?\" His lips twitched, and for a moment, I thought I was going to get one of those smiles. My heart leapt. Then, with visible effort, he pushed the smile back and once more became my tough-love mentor. He shifted off me, leaned back on his heels, and rose. \"Come on. We should go.\" I scrambled to my own feet and followed him out of the gym. He didn\u0027t look back as he walked, and I mentally kicked myself on the way back to my room. I was crushing on my mentor. Crushing on my older mentor. I had to be out of my mind. He was seven years older than me. Old enough to be my...well, okay, nothing. But still older than me. Seven years was a lot. He\u0027d been learning to write when I was born. When I\u0027d been learning to write and throw books at my teachers, he\u0027d probably been kissing girls. Probably lots of girls, considering how he looked. I so did not need this complication in my life right now. I found a passable sweater back in my room and after a quick shower, I headed off across campus to the reception. Despite the looming stone walls, fancy statues, and turrets on the outsides of the buildings, the Academy\u0027s insides were quite modern. We had Wi-Fi, fluorescent lights, and just about anything else technological you could imagine. The commons in particular looked pretty much like the cafeterias I\u0027d eaten in while in Portland and Chicago, with simple rectangular tables, soothing taupe walls, and a little room off to the side where our dubiously prepared meals were served. Someone had at least hung framed black-and-white photos along the walls in an effort to decorate it, but I didn\u0027t really consider pictures of vases and leafless trees \"art.\" Tonight, however, someone had managed to transform the normally boring commons into a bona fide dining room. Vases spilling over with crimson roses and delicate white lilies. Glowing candles. Tablecloths made of - wait for it - bloodred linen. The effect was gorgeous. It was hard to believe this was the same place I usually ate chicken patty sandwiches in. It looked fit for, well, a queen. The tables had been arranged in straight lines, creating an aisle down the middle of the room. We had assigned seating, and naturally, I couldn\u0027t sit anywhere near Lissa. She sat in the front with the other Moroi; I was in the back with the novices. But she did catch my eye when I entered and flashed me a smile. She\u0027d borrowed a dress from Natalie - blue, silky, and strapless - that looked amazing with her pale features. Who\u0027d known Natalie owned anything so good? It made my sweater lose a few cool points. They always conducted these formal banquets in the same way. A head table sat on a dais at the front of the room, where we could all ooh and ahh and watch Queen Tatiana and other royals eat dinner. Guardians lined the walls, as stiff and formal as statues. Dimitri stood among them, and a weird feeling twisted my stomach as I recalled what had happened in the gym. His eyes stared straight ahead, as if focusing on nothing and everything in the room at once. When the time came for the royals\u0027 entrance, we all stood up respectfully and watched as they walked down the aisle. I recognized a few, mostly those who had children attending the Academy. Victor Dashkov was among them, walking slowly and with a cane. While I was happy to see him, I cringed to watch each agonizing step he took toward the front of the room. Once that group had passed, four solemn guardians with red-and-black-pin-striped jackets entered the commons. Everyone but the guardians along the walls sank to our knees in a silly show of loyalty. What a lot of ceremony and posturing, I thought wearily. Moroi monarchs were chosen by the previous monarch from within the royal families. The king or queen couldn\u0027t choose one of his or her own direct descendents, and a council from the noble and royal families could dispute the choice with enough cause. That almost never happened, though. Queen Tatiana followed her guards, wearing a red silk dress and matching jacket. She was in her early sixties and had dark gray hair bobbed to her chin and crowned with a Miss America-type tiara. She moved into the room slowly, like she was taking a stroll, four more guardians at her back. She moved through the novices\u0027 section fairly quickly, though she did nod and smile here and there. Dhampirs might just be the half-human, illegitimate children of the Moroi, but we trained and dedicated our lives to serving and protecting them. The likelihood was strong that many of us gathered here would die young, and the queen had to show her respect for that. When she got to the Moroi section, she paused longer and actually spoke to a few students. It was a big deal to be acknowledged, mostly a sign that someone\u0027s parents had gotten in good with her. Naturally, the royals got the most attention. She didn\u0027t really say much to them that was all that interesting, mostly just a lot of fancy words. \"Vasilisa Dragomir.\" My head shot up. Alarm coursed through the bond at the sound of her name. Breaking protocol, I pushed out of my position and wiggled over to get a better view, knowing no one would notice me when the queen herself had personally singled out the last of the Dragomirs. Everyone was eager to see what the monarch had to say to Lissa the runaway princess. \"We heard you had returned. We are glad to have the Dragomirs back, even though only one remains. We deeply regret the loss of your parents and your brother; they were among the finest of the Moroi, their deaths a true tragedy.\" I\u0027d never really understood the royal \"we\" thing, but otherwise, everything sounded okay. \"You have an interesting name,\" she continued. \"Many heroines in Russian fairy tales are named Vasilisa. Vasilisa the Brave, Vasilisa the Beautiful. They are different young women, all having the same name and the same excellent qualities: strength, intelligence, discipline, and virtue. All accomplish great things, triumphing over their adversaries. \"Likewise, the Dragomir name commands its own respect. Dragomir kings and queens have ruled wisely and justly in our history. They have used their powers for miraculous ends. They have slain Strigoi, fighting right alongside their guardians. They are royal for a reason.\" She waited a moment, letting the weight of her words sink in. I could feel the mood changing in the room, as well as the surprise and shy pleasure creeping out from Lissa. This would shake the social balance. We could probably expect a few wannabes trying to get in good with Lissa tomorrow. \"Yes,\" Tatiana continued, \"you are doubly named with power. Your names represent the finest qualities people have to offer and hearken back in time to deeds of greatness and valor.\" She paused a moment. \"But, as you have demonstrated, names do not make a person. Nor do they have any bearing on how that person turns out.\" And with that verbal slap in the face, she turned away and continued her procession. A collective shock filled the room. I briefly contemplated and then dismissed any attempts at jumping into the aisle and tackling the queen. Half a dozen guardians would have me down on the floor before I\u0027d even taken five steps. So I sat impatiently through dinner, all the while feeling Lissa\u0027s absolute mortification. When the post-dinner reception followed, Lissa made a beeline for the doors leading out to the courtyard. I followed, but got delayed having to weave around and avoid the mingling, socializing people. She\u0027d wandered outside to an adjacent courtyard, one that matched the Academy\u0027s grand external style. A roof of carved, twisting wood covered the garden, with little holes here and there to let in some light, but not enough to cause damage to Moroi. Trees, leaves now gone for the winter, lined the area and guarded paths leading out to other gardens, courtyards, and the main quadrangle. A pond, also emptied for the winter, lay in a corner, and standing over it was an imposing statue of St. Vladimir himself. Carved of gray rock, he wore long robes and had a beard and mustache. Rounding a corner, I stopped when I saw Natalie had beaten me to Lissa. I considered interrupting but stepped back before they could see me. Spying might be bad, but I was suddenly very curious to hear what Natalie had to say to Lissa. \"She shouldn\u0027t have said that,\" Natalie said. She wore a yellow dress similar in cut to Lissa\u0027s, but somehow lacked the grace and poise to make it look as good. Yellow was also a terrible color on her. It clashed with her black hair, which she\u0027d put up into an off-center bun. \"It wasn\u0027t right,\" she went on. \"Don\u0027t let it bother you.\" \"Kind of late for that.\" Lissa\u0027s eyes were locked firmly on the stone walkway below. \"She was wrong.\" \"She\u0027s right,\" Lissa exclaimed. \"My parents...and Andre...they would have hated me for what I did.\" \"No, they wouldn\u0027t have.\" Natalie spoke in a gentle voice. \"It was stupid to run away. Irresponsible.\" \"So what? You made a mistake. I make mistakes all the time. The other day, I was doing this assignment in science, and it was for chapter ten, and I\u0027d actually read chapter elev - \" Natalie stopped herself and, in a remarkable show of restraint, got herself back on track. \"People change. We\u0027re always changing, right? You aren\u0027t the same as you were then. I\u0027m not the same as I was then.\" Actually, Natalie seemed exactly the same to me, but that didn\u0027t bother me so much anymore. She\u0027d grown on me. \"Besides,\" she added, \"was running away really a mistake? You must have done it for a reason. You must have gotten something out of it, right? There was a lot of bad stuff going on with you, wasn\u0027t there? With your parents and your brother. I mean, maybe it was the right thing to do.\" Lissa hid a smile. Both of us were pretty sure Natalie was trying to find out why we had left - just like everyone else in the school. She sort of sucked at being sneaky. \"I don\u0027t know if it was, no,\" Lissa answered. \"I was weak. Andre wouldn\u0027t have run away. He was so good. Good at everything. Good at getting along with people and all that royal crap.\" \"You\u0027re good at that too.\" \"I guess. But I don\u0027t like it. I mean, I like people...but most of what they do is so fake. That\u0027s what I don\u0027t like.\" \"Then don\u0027t feel bad about not getting involved,\" Natalie said. \"I don\u0027t hang out with all those people either, and look at me. I\u0027m just fine. Daddy says he doesn\u0027t care if I hang out with the royals or not. He just wants me to be happy.\" \"And that,\" I said, finally making my appearance, \"is why he should be ruling instead of that bitch of a queen. He got robbed.\" Natalie nearly jumped ten feet. I felt pretty confident her vocabulary of swear words mostly consisted of \"golly\" and \"darn.\" \"I wondered where you were,\" said Lissa. Natalie looked back and forth between us, suddenly seeming a little embarrassed to be right between the best-friends dream team. She shifted uncomfortably and tucked some messy hair behind her ear. \"Well...I should go find Daddy. I\u0027ll see you back in the room.\" \"See you,\" said Lissa. \"And thanks.\" Natalie hurried off. \"Does she really call him ¡®Daddy\u0027?\" Lissa cut me a look. \"Leave her alone. She\u0027s nice.\" \"She is, actually. I heard what she said, and as much as I hate to admit it, there was nothing there I could really make fun of. It was all true.\" I paused. \"I\u0027ll kill her, you know. The queen, not Natalie. Screw the guardians. I\u0027ll do it. She can\u0027t get away with that.\" \"God, Rose! Don\u0027t say that. They\u0027ll arrest you for treason. Just let it go.\" \"Let it go? After what she said to you? In front of everyone?\" She didn\u0027t answer or even look at me. Instead, she toyed absentmindedly with the branches of a scraggly bush that had gone dormant for the winter. There was a vulnerable look about her that I recognized - and feared. \"Hey.\" I lowered my voice. \"Don\u0027t look like that. She doesn\u0027t know what she\u0027s talking about, okay? Don\u0027t let this get you down. Don\u0027t do anything you shouldn\u0027t.\" She glanced back up at me. \"It\u0027s going to happen again, isn\u0027t it?\" she whispered. Her hand, still clutching the tree, began to tremble. \"Not if you don\u0027t let it.\" I tried to look at her wrists without being too obvious. \"You haven\u0027t?...\" \"No.\" She shook her head and blinked back tears. \"I haven\u0027t wanted to. I was upset after the fox, but it\u0027s been okay. I like the coasting thing. I miss seeing you, but everything\u0027s been all right. I like...\" She paused. I could hear the word forming in her mind. \"Christian.\" \"I wish you couldn\u0027t do that. Or wouldn\u0027t.\" \"Sorry. Do I need to give you the Christian\u0027s-a-psychopathic-loser talk again?\" \"I think I\u0027ve got it memorized after the last ten times,\" she muttered. I started to launch into number eleven when I heard the sound of laughter and the clatter of high heels on stone. Mia walked toward us with a few friends in tow but no Aaron. Immediately my defenses snapped on. Internally, Lissa was still shaken over the queen\u0027s comments. Sorrow and humiliation were swirling inside of her. She felt embarrassed over what others must think of her now and kept thinking about how her family would have hated her for running away. I didn\u0027t believe that, but it felt real to her, and her dark emotions churned and churned. She was not okay, no matter how casual she\u0027d just tried to act, and I was worried she might do something reckless. Mia was the last person she needed to see right now. \"What do you want?\" I demanded. Mia smiled haughtily at Lissa and ignored me, taking a few steps forward. \"Just wanted to know what it\u0027s like to be so important and so royal. You must be so excited that the queen talked to you.\" Giggles surfaced from the gathering group. \"You\u0027re standing too close.\" I stepped between them, and Mia flinched a little, possibly still worried I might break her arm. \"And hey at least the queen knew her name, which is more than I can say for you and your wannabe-royal act. Or your parents.\" I could see the pain that caused her. Man, she wanted to be royal so badly. \"At least I see my parents,\" she retorted. \"At least I know who they both are. God only knows who your father is. And your mom\u0027s one of the most famous guardians around, but she couldn\u0027t care less about you either. Everyone knows she never visits. Probably was glad when you were gone. If she even noticed.\" That hurt. I clenched my teeth. \"Yeah, well, at least she\u0027s famous. She really does advise royals and nobles. She doesn\u0027t clean up after them.\" I heard one of her friends snicker behind her. Mia opened her mouth, no doubt to unleash one of the many retorts she\u0027d had to accumulate since the story started going around, when the lightbulb suddenly went off in her head. \"It was you,\" she said, eyes wide. \"Someone told me Jesse\u0027d started it, but he couldn\u0027t have known anything about me. He got it from you. When you slept with him.\" Now she was really starting to piss me off. \"I didn\u0027t sleep with him.\" Mia pointed at Lissa and glared back at me. \"So that\u0027s it, huh? You do her dirty work because she\u0027s too pathetic to do it herself. You aren\u0027t always going to be able to protect her,\" she warned. \"You aren\u0027t safe either.\" Empty threats. I leaned forward, making my voice as menacing as possible. In my current mood, it wasn\u0027t difficult. \"Yeah? Try and touch me now and find out.\" I hoped she would. I wanted her to. We didn\u0027t need her messed-up vendetta in our lives just now. She was a distraction - one I very much wanted to punch right now. Looking past her, I saw Dimitri move out into the garden, eyes searching for something - or someone. I had a pretty good idea who it was. When he saw me, he strode forward, shifting his attention when he noticed the crowd gathered around us. Guardians can smell a fight a mile away. Of course, a six-year-old could have smelled this fight. Dimitri stood beside me and crossed his arms. \"Everything all right?\" \"Sure thing, Guardian Belikov.\" I smiled as I said it, but I was furious. Raging, even. This whole Mia confrontation had only made Lissa feel worse. \"We were just swapping family stories. Ever heard Mia\u0027s? It\u0027s fascinating.\" \"Come on,\" said Mia to her followers. She led them off, but not before she\u0027d given me one last, chilling look. I didn\u0027t need to read her mind to know what it said. This wasn\u0027t over. She was going to try to get one or both of us back. Fine. Bring it on, Mia. \"I\u0027m supposed to take you back to your dorm,\" Dimitri told me drily. \"You weren\u0027t about to just start a fight, were you?\" \"Of course not,\" I said, my eyes still staring at the empty doorway Mia had disappeared through. \"I don\u0027t start fights where people can see them.\" \"Rose,\" groaned Lissa. \"Let\u0027s go. Good night, Princess.\" He turned, but I didn\u0027t move. \"You going to be okay, Liss?\" She nodded. \"I\u0027m fine.\" It was such a lie, I couldn\u0027t believe she had the nerve to try to put it past me. I didn\u0027t need the bond to see tears shining in her eyes. We should never have come back to this place, I realized bleakly. \"Liss...\" She gave me a small, sad smile and nodded in Dimitri\u0027s direction. \"I told you, I\u0027m fine. You\u0027ve got to go.\" Reluctantly, I followed him. He led me out toward the other side of the garden. \"We may need to add an extra training on self-control,\" he noted. \"I have plenty of self contr - hey!\" I stopped talking as I saw Christian slip past us, moving down the path we\u0027d just come from. I hadn\u0027t seen him at the reception, but if Kirova had released me to come tonight, I suppose she would have done the same for him. \"You going to see Lissa?\" I demanded, shifting my Mia rage to him. He stuffed his hands into his pockets and gave me that look of bad-boy indifference. \"What if I am?\" \"Rose, this isn\u0027t the time,\" said Dimitri. But it was so the time. Lissa had ignored my warnings about Christian for weeks. It was time to go to the source and stop their ridiculous flirtation once and for all. \"Why don\u0027t you just leave her alone? Are you so messed up and desperate for attention that you can\u0027t tell when someone doesn\u0027t like you?\" He scowled. \"You\u0027re some crazy stalker, and she knows it. She\u0027s told me all about your weird obsession - how you\u0027re always hanging out in the attic together, how you set Ralf on fire to impress her. She thinks you\u0027re a freak, but she\u0027s too nice to say anything.\" His face had paled, and something dark churned in his eyes. \"But you aren\u0027t too nice?\" \"No. Not when I feel sorry for someone.\" \"Enough,\" said Dimitri, steering me away. \"Thanks for ¡®helping,\u0027 then,\" snapped Christian, his voice dripping with animosity. \"No problem,\" I called back over my shoulder. When we\u0027d gone a little ways, I stole a glance behind me and saw Christian standing just outside the garden. He\u0027d stopped walking and now stood staring down the path that led to Lissa in the courtyard. Shadows covered his face as he thought, and then, after a few moments, he turned around and headed back toward the Moroi dorms.","sourceLink":"https://allnovel.net/vampire-academy-vampire-academy-1/page-11.html","bookId":2060,"book":{"id":2060,"title":"Vampire Academy (Vampire Academy #1)","description":"Storyline: Vampire Academy Series 1: Vampire Academy After two years on the run, best friends Rose, half-human/half-vampire, and Lissa, a mortal vampire princess, are caught and returned to St. Vladimir\u0027s Academy. Up until then, Rose had kept Lissa safe from her enemies; school, however, brings both girls additional challenges and responsibilities. How they handle peer pressure, nasty gossip, new relationships, and anonymous threats may mean life or death. Likable narrator Rose hides doubts about her friend behind a tough exterior; orphan Lissa, while coping with difficult emotional issues such as depression and survivor\u0027s guilt, uses her emerging gifts for good. Mead\u0027s absorbing, debut YA novel, the first in a new series, blends intricately detailed fantasy with a contemporary setting, teen-relevant issues, and a diverse, if sometimes sterotyped, cast of supporting characters. Occasional steamy sex and a scattering of vulgar language demand mature readers, but teens able to handle the edgy elements will speed through this vamp story and anticipate the next installment.","cover":"https://allnovel.net/images/vampire-academy-vampire-academy-1.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/vampire-academy-vampire-academy-1.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:00:42 AM"}}
