{"id":110554,"no":6,"title":"Page 6","content":"SIX\\n\\n AS MUCH AS LISSA AND Christian\u0027s meeting bothered me, it gave me an idea the next day.\\n\\n \"Hey, Kirova - er, Ms. Kirova.\" I stood in the doorway of her office, not having bothered to make an appointment. She raised her eyes from some paperwork, clearly annoyed to see me.\\n\\n \"Yes, Miss Hathaway?\"\\n\\n \"Does my house arrest mean I can\u0027t go to church?\"\\n\\n \"I beg your pardon?\"\\n\\n \"You said that whenever I\u0027m not in class or practice, I have to stay in the dorm. But what about church on Sundays? I don\u0027t think it\u0027s really fair to keep me away from my religious¡um, needs.\" Or deprive me of another chance - no matter how short and boring - to hang out with Lissa.\\n\\n She pushed her glasses up the bridge of her nose. \"I wasn\u0027t aware you had any religious needs.\"\\n\\n \"I found Jesus while I was gone.\"\\n\\n \"Isn\u0027t your mother an atheist?\" she asked skeptically.\\n\\n \"And my dad\u0027s probably Muslim. But I\u0027ve moved on to my own path. You shouldn\u0027t keep me from it.\"\\n\\n She made a noise that sort of sounded like a snicker. \"No, Miss Hathaway, I should not. Very well. You may attend services on Sundays.\"\\n\\n The victory was short-lived, however, because church was every bit as lame as I remembered when I attended a few days later. I did get to sit next to Lissa, though, which made me feel like I was getting away with something. Mostly I just people-watched. Church was optional for students, but with so many Eastern European families, a lot of students were Eastern Orthodox Christians and attended either because they believed or because their parents made them.\\n\\n Christian sat on the opposite side of the aisle, pretending to be just as holy as he\u0027d said. As much as I didn\u0027t like him, his fake faith still made me smile. Dimitri sat in the back, face lined with shadows, and, like me, didn\u0027t take communion. As thoughtful as he looked, I wondered if he even listened to the service. I tuned in and out.\\n\\n \"Following God\u0027s path is never easy,\" the priest was saying. \"Even St. Vladimir, this school\u0027s own patron saint, had a difficult time. He was so filled with spirit that people often flocked around him, enthralled just to listen and be in his presence. So great was his spirit, the old texts say, that he could heal the sick. Yet despite these gifts, many did not respect him. They mocked him, claiming he was misguided and confused.\"\\n\\n Which was a nice way of saying Vladimir was insane. Everyone knew it. He was one of a handful of Moroi saints, so the priest liked to talk about him a lot. I\u0027d heard all about him, many times over, before we left. Great. It looked like I had an eternity of Sundays to hear his story over and over again.\\n\\n \"¡and so it was with shadow-kissed Anna.\"\\n\\n I jerked my head up. I had no idea what the priest was talking about now, because I hadn\u0027t been listening for some time. But those words burned into me. Shadow-kissed. It had been a while since I heard them, but I\u0027d never forgotten them. I waited, hoping he\u0027d continue, but he\u0027d already moved on to the next part of the service. The sermon was over.\\n\\n Church concluded, and as Lissa turned to go, I shook my head at her. \"Wait for me. I\u0027ll be right there.\"\\n\\n I pushed my way through the crowd, up to the front, where the priest was speaking with a few people. I waited impatiently while he finished. Natalie was there, asking him about volunteer work she could do. Ugh. When she finished, she left, greeting me as she passed.\\n\\n The priest raised his eyebrows when he saw me. \"Hello, Rose. It\u0027s nice to see you again.\"\\n\\n \"Yeah¡you too,\" I said. \"I heard you talking about Anna. About how she was ¡®shadow-kissed.\u0027 What does that mean?\"\\n\\n He frowned. \"I\u0027m not entirely sure. She lived a very long time ago. It was often common to refer to people by titles that reflected some of their traits. It might have been given to make her sound fierce.\"\\n\\n I tried to hide my disappointment. \"Oh. So who was she?\"\\n\\n This time his frown was disapproving rather than thoughtful. \"I mentioned it a number of times.\"\\n\\n \"Oh. I must have, um, missed that.\"\\n\\n His disapproval grew, and he turned around. \"Wait just a moment.\"\\n\\n He disappeared through the door near the altar, the one Lissa had taken to the attic. I considered fleeing but thought God might strike me down for that. Less than a minute later, the priest returned with a book. He handed it to me. Moroi Saints.\\n\\n \"You can learn about her in here. The next time I see you, I\u0027d like to hear what you\u0027ve learned.\"\\n\\n I scowled as I walked away. Great. Homework from the priest.\\n\\n In the chapel\u0027s entry way, I found Lissa talking to Aaron. She smiled as she spoke, and the feelings coming off her were happy, though certainly not infatuated.\\n\\n \"You\u0027re kidding,\" she exclaimed.\\n\\n He shook his head. \"Nope.\"\\n\\n Seeing me stroll over, she turned to me. \"Rose, you\u0027re never going to believe this. You know Abby Badica? And Xander? Their guardian wants to resign. And marry another guardian.\"\\n\\n Now this was exciting gossip. A scandal, actually. \"Seriously? Are they, like, going to run off together?\"\\n\\n She nodded. \"They\u0027re getting a house. Going to get jobs with humans, I guess.\"\\n\\n I glanced at Aaron, who had suddenly turned shy with me there. \"How are Abby and Xander dealing with that?\"\\n\\n \"Okay. Embarrassed. They think it\u0027s stupid.\" Then he realized who he was speaking to. \"Oh. I didn\u0027t mean - \"\\n\\n \"Whatever.\" I gave him a tight smile. \"It is stupid.\"\\n\\n Wow. I was stunned. The rebellious part me of loved any story where people \"fought the system.\" Only, in this case, they were fighting my system, the one I\u0027d been trained to believe in my entire life.\\n\\n Dhampirs and Moroi had a strange arrangement. Dhampirs had originally been born from Moroi mixing with humans. Unfortunately, dhampirs couldn\u0027t reproduce with each other - or with humans. It was a weird genetic thing. Mules were the same way, I\u0027d been told, though that wasn\u0027t a comparison I really liked hearing. Dhampirs and full Moroi could have children together, and, through another genetic oddity, their kids came out as standard dhampirs, with half human genes, half vampire genes.\\n\\n With Moroi being the only ones with whom dhampirs could reproduce, we had to stay close to them and intermingle with them. Likewise, it became important to us that the Moroi simply survived. Without them, we were done. And with the way Strigoi loved picking off Moroi, their survival became a legitimate concern for us.\\n\\n That was how the guardian system developed. Dhampirs couldn\u0027t work magic, but we made great warriors. We\u0027d inherited enhanced senses and reflexes from our vampire genes and better strength and endurance from our human genes. We also weren\u0027t limited by a need for blood or trouble with sunlight. Sure, we weren\u0027t as powerful as the Strigoi, but we trained hard, and guardians did a kick-ass job at keeping Moroi safe. Most dhampirs felt it was worth risking their own lives to make sure our kind could still keep having children.\\n\\n Since Moroi usually wanted to have and raise Moroi children, you didn\u0027t find a lot of long-term Moroi-dhampir romances. You especially didn\u0027t find a lot of Moroi women hooking up with dhampir guys. But plenty of young Moroi men liked fooling around with dhampir women, although those guys usually went on to marry Moroi women. That left a lot of single dhampir mothers, but we were tough and could handle it.\\n\\n However, many dhampir mothers chose not to become guardians in order to raise their children. These women sometimes worked \"regular\" jobs with Moroi or humans; some of them lived together in communities. These communities had a bad reputation. I don\u0027t know how much of it was true, but rumors said Moroi men visited all the time for sex, and that some dhampir women let them drink blood while doing it. Blood whores.\\n\\n Regardless, almost all guardians were men, which meant there were a lot more Moroi than guardians. Most dhampir guys accepted that they wouldn\u0027t have kids. They knew it was their job to protect Moroi while their sisters and cousins had babies.\\n\\n Some dhampir women, like my mother, still felt it was their duty to become guardians - even if it meant not raising their own kids. After I\u0027d been born, she\u0027d handed me over to be raised by Moroi. Moroi and dhampirs start school pretty young, and the Academy had essentially taken over as my parent by the time I was four.\\n\\n Between her example and my life at the Academy, I believed wholeheartedly that it was a dhampir\u0027s job to protect Moroi. It was part of our heritage, and it was the only way we\u0027d keep going. It was that simple.\\n\\n And that was what made what the Badicas\u0027 guardian had done so shocking. He\u0027d abandoned his Moroi and run off with another guardian, which meant she\u0027d abandoned her Moroi. They couldn\u0027t even have children together, and now two families were unprotected. What was the point? No one cared if teenage dhampirs dated or if adult dhampirs had flings. But a long-term relationship? Particularly one that involved them running away? A complete waste. And a disgrace.\\n\\n After a little more speculation on the Badicas, Lissa and I left Aaron. As we stepped outside, I heard a funny shifting sound and then something sliding. Too late, I realized what was happening, just as a pile of slush slid off the chapel\u0027s roof and onto us. It was early October, and we\u0027d had early snow last night that had started melting almost immediately. As a result, the stuff that fell on us was very wet and very cold.\\n\\n Lissa took the brunt of it, but I still yelped as icy water landed on my hair and neck. A few others squealed nearby too, having caught the edge of the mini-avalanche.\\n\\n \"You okay?\" I asked her. Her coat was drenched, and her platinum hair clung to the sides of her face.\\n\\n \"Y-yeah,\" she said through chattering teeth.\\n\\n I pulled off my coat and handed it to her. It had a slick surface and had repelled most of the water. \"Take yours off.\"\\n\\n \"But you\u0027ll be - \"\\n\\n \"Take this.\"\\n\\n She did, and as she slipped on my coat, I finally tuned into the laughter that always follows these situations. I avoided the eyes, instead focusing on holding Lissa\u0027s wet jacket while she changed.\\n\\n \"Wish you hadn\u0027t been wearing a coat, Rose,\" said Ralf Sarcozy an unusually bulky and plump Moroi. I hated him. \"That shirt would have looked good wet.\"\\n\\n \"That shirt\u0027s so ugly it should be burned. Did you get that from a homeless person?\"\\n\\n I glanced up as Mia walked over and looped her arm through Aaron\u0027s. Her blond curls were arranged perfectly, and she had on an awesome pair of black heels that would have looked much better on me. At least they made her look taller, I\u0027d give her that. Aaron had been a few steps behind us but had miraculously avoided being nailed by the slush. Seeing how smug she looked, I decided there\u0027d been no miracles involved.\\n\\n \"I suppose you want to offer to burn it, huh?\" I asked, refusing to let her know how much that insult bugged me. I knew perfectly well my fashion sense had slipped over the last two years. \"Oh, wait - fire isn\u0027t your element, is it? You work with water. What a coincidence that a bunch just fell on us.\"\\n\\n Mia looked as if she\u0027d been insulted, but the gleam in her eyes showed that she was enjoying this way too much to be an innocent bystander. \"What\u0027s that supposed to mean?\"\\n\\n \"Nothing to me. But Ms. Kirova will probably have something to say when she finds out you used magic against another student.\"\\n\\n \"That wasn\u0027t an attack,\" she scoffed. \"And it wasn\u0027t me. It was an act of God.\"\\n\\n A few others laughed, much to her delight. In my imagination, I responded with, So is this, and then slammed her into the side of the church. In real life, Lissa simply nudged me and said, \"Let\u0027s go.\"\\n\\n She and I walked off toward our respective dorms, leaving behind laughter and jokes about our wet states and how Lissa wouldn\u0027t know anything about specialization. Inside, I seethed. I had to do something about Mia, I realized. In addition to the general irritation of Mia\u0027s bitchiness, I didn\u0027t want Lissa to have to deal with any more stress than she had to. We\u0027d been okay this first week, and I wanted to keep it that way.\\n\\n \"You know,\" I said, \"I\u0027m thinking more and more that you stealing Aaron back is a good thing. It\u0027ll teach Bitch Doll a lesson. I bet it\u0027d be easy, too. He\u0027s still crazy about you.\"\\n\\n \"I don\u0027t want to teach anyone a lesson,\" said Lissa. \"And I\u0027m not crazy about him.\"\\n\\n \"Come on, she picks fights and talks about us behind our backs. She accused me of getting jeans from the Salvation Army yesterday.\"\\n\\n \"Your jeans are from the Salvation Army.\"\\n\\n \"Well, yeah,\" I snorted, \"but she has no right making fun of them when she\u0027s wearing stuff from Target.\"\\n\\n \"Hey, there\u0027s nothing wrong with Target. I like Target.\"\\n\\n \"So do I. That\u0027s not the point. She\u0027s trying to pass her stuff off like it\u0027s freaking Stella McCartney.\"\\n\\n \"And that\u0027s a crime?\"\\n\\n I affected a solemn face. \"Absolutely. You\u0027ve gotta take revenge.\"\\n\\n \"I told you, I\u0027m not interested in revenge.\" Lissa cut me a sidelong look. \"And you shouldn\u0027t be either.\"\\n\\n I smiled as innocently as I could, and when we parted ways, I felt relieved again that she couldn\u0027t read my thoughts.\\n\\n \"So when\u0027s the big catfight going to happen?\"\\n\\n Mason was waiting for me outside our dorm after I\u0027d parted ways with Lissa. He looked lazy and cute, leaning against the wall with crossed arms as he watched me.\\n\\n \"I\u0027m sure I don\u0027t know what you mean.\"\\n\\n He unfolded himself and walked with me into the building, handing me his coat, since I\u0027d let Lissa go off with my dry one. \"I saw you guys sparring outside the chapel. Have you no respect for the house of God?\"\\n\\n I snorted. \"You\u0027ve got about as much respect for it as I do, you heathen. You didn\u0027t even go. Besides, as you said, we were outside.\"\\n\\n \"And you still didn\u0027t answer the question.\"\\n\\n I just grinned and slipped on his coat.\\n\\n We stood in the common area of our dorm, a well-supervised lounge and study area where male and female students could mingle, along with Moroi guests. Being Sunday, it was pretty crowded with those cramming for last-minute assignments due tomorrow. Spying a small, empty table, I grabbed Mason\u0027s arm and pulled him toward it.\\n\\n \"Aren\u0027t you supposed to go straight to your room?\"\\n\\n I hunkered down in my seat, glancing around warily. \"There are so many people here today, it\u0027ll take them a while to notice me. God, I\u0027m so sick of being locked away. And it\u0027s only been a week.\"\\n\\n \"I\u0027m sick of it too. We missed you last night. A bunch of us went and shot pool in the rec room. Eddie was on fire.\"\\n\\n I groaned. \"Don\u0027t tell me that. I don\u0027t want to hear about your glamorous social life.\"\\n\\n \"All right.\" He propped his elbow up on the table and rested his chin in his hand. \"Then tell me about Mia. You\u0027re just going to turn around and punch her one day, aren\u0027t you? I think I remember you doing that at least ten times with people that pissed you off.\"\\n\\n \"I\u0027m a new, reformed Rose,\" I said, doing my best impression of demure. Which wasn\u0027t very good. He emitted a choking sort of laugh. \"Besides, if I do that, I\u0027ll have broken my probation with Kirova. Gotta walk the straight and narrow.\"\\n\\n \"In other words, find some way to get back at Mia that you won\u0027t get in trouble for.\"\\n\\n I felt a smile tug at the corners of my lips. \"You know what I like about you, Mase? You think just like I do.\"\\n\\n \"Frightening concept,\" he replied drily. \"So tell me what you think of this: I might know something about her, but I probably shouldn\u0027t tell you¡\"\\n\\n I leaned forward. \"Oh, you already tipped me off. You\u0027ve got to tell me now.\"\\n\\n \"It\u0027d be wrong,\" he teased. \"How do I know you\u0027d use this knowledge for good instead of evil?\"\\n\\n I batted my eyelashes. \"Can you resist this face?\"\\n\\n He took a moment to study me. \"No. I can\u0027t, actually. Okay, here you go: Mia isn\u0027t royal.\"\\n\\n I slouched back in my chair. \"No kidding. I already knew that. I\u0027ve known who\u0027s royal since I was two.\"\\n\\n \"Yeah, but there\u0027s more than just that. Her parents work for one of the Drozdov lords.\" I waved my hand impatiently. A lot of Moroi worked out in the human world, but Moroi society had plenty of jobs for its own kind too. Someone had to fill them. \"Cleaning stuff. Practically servants. Her dad cuts grass, and her mom\u0027s a maid.\"\\n\\n I actually had a healthy respect for anyone who pulled a full day\u0027s work, regardless of the job. People everywhere had to do crappy stuff to make a living. But, much like with Target, it became another matter altogether when someone was trying to pass herself off as something else. And in the week that I\u0027d been here, I\u0027d picked up on how desperately Mia wanted to fit in with the school elite.\\n\\n \"No one knows,\" I said thoughtfully.\\n\\n \"And she doesn\u0027t want them to. You know how the royals are.\" He paused. \"Well, except for Lissa, of course. They\u0027d give Mia a hard time over it.\"\\n\\n \"How do you know all this?\"\\n\\n \"My uncle\u0027s a guardian for the Drozdovs.\"\\n\\n \"And you\u0027ve just been sitting on this secret, huh?\"\\n\\n \"Until you broke me. So which path will you choose: good or evil?\"\\n\\n \"I think I\u0027ll give her a grace - \"\\n\\n \"Miss Hathaway, you know you aren\u0027t supposed to be here.\"\\n\\n One of the dorm matrons stood over us, disapproval all over her face.\\n\\n I hadn\u0027t been joking when I said Mason thought like me. He could bullshit as well as I could. \"We have a group project to do for our humanities class. How are we supposed to do it if Rose is in isolation?\"\\n\\n The matron narrowed her eyes. \"You don\u0027t look like you\u0027re doing work.\"\\n\\n I slid over the priest\u0027s book and opened it at random. I\u0027d placed it on the table when we sat down. \"We\u0027re, um, working on this.\"\\n\\n She still looked suspicious. \"One hour. I\u0027ll give you one more hour down here, and I\u0027d better actually see you working.\"\\n\\n \"Yes, ma\u0027am,\" said Mason straight-faced. \"Absolutely.\"\\n\\n She wandered off, still eyeing us. \"My hero,\" I declared.\\n\\n He pointed at the book. \"What is this?\"\\n\\n \"Something the priest gave me. I had a question about the service.\"\\n\\n He stared at me, astonished.\\n\\n \"Oh, stop it and look interested.\" I skimmed the index. \"I\u0027m trying to find some woman named Anna.\"\\n\\n Mason slid his chair over so that he was sitting right beside me. \"All right. Let\u0027s ¡®study.\u0027 \"\\n\\n I found a page number, and it took me to the section on St. Vladimir, not surprisingly. We read through the chapter, scanning for Anna\u0027s name. When we found it, the author didn\u0027t have much to say about her. He did include an excerpt written by some guy who had apparently lived at the same time as St. Vladimir:\\n\\n And with Vladimir always is Anna, the daughter of Fyodor. Their love is as chaste and pure as that of brother and sister, and many times has she defended him from Strigoi who would seek to destroy him and his holiness. Likewise, it is she who comforts him when the spirit becomes too much to bear, and Satan\u0027s darkness tries to smother him and weaken his own health and body. This too she defends against, for they have been bound together ever since he saved her life as a child. It is a sign of God\u0027s love that He has sent the blessed Vladimir a guardian such as her, one who is shadow-kissed and always knows what is in his heart and mind.\\n\\n \"There you go,\" Mason said. \"She was his guardian.\"\\n\\n \"It doesn\u0027t say what ¡®shadow-kissed\u0027 means.\"\\n\\n \"Probably doesn\u0027t mean anything.\"\\n\\n Something in me didn\u0027t believe that. I read it again, trying to make sense of the old-fashioned language. Mason watched me curiously, looking like he very much wanted to help.\\n\\n \"Maybe they were hooking up,\" he suggested.\\n\\n I laughed. \"He was a saint.\"\\n\\n \"So? Saints probably like sex too. That ¡®brother and sister\u0027 stuff is probably a cover.\" He pointed to one of the lines. \"See? They were ¡®bound\u0027 together.\" He winked. \"It\u0027s code.\"\\n\\n Bound. It was a weird word choice, but that didn\u0027t necessarily mean Anna and Vladimir were ripping each other\u0027s clothes off.\\n\\n \"I don\u0027t think so. They\u0027re just close. Guys and girls can just be friends.\" I said it pointedly, and he gave me a dry look.\\n\\n \"Yeah? We\u0027re friends, and I don\u0027t know what\u0027s in your ¡®heart and mind.\u0027 \" Mason put on a fake philosopher\u0027s look. \"Of course, some might argue that one can never know what\u0027s in the heart of a woman - \"\\n\\n \"Oh, shut up,\" I groaned, punching him in the arm.\\n\\n \"For they are strange and mysterious creatures,\" he continued in his scholarly voice, \"and a man must be a mind reader if he ever wishes to make them happy.\"\\n\\n I started giggling uncontrollably and knew I\u0027d probably get in trouble again. \"Well, try to read my mind and stop being such a - \"\\n\\n I stopped laughing and looked back down at the book.\\n\\n Bound together and always knows what is in his heart and mind.\\n\\n They had a bond, I realized. I would have bet everything I owned - which wasn\u0027t much - on it. The revelation was astonishing. There were lots of vague stories and myths about how guardians and Moroi ¡®used to have bonds.\u0027 But this was the first I\u0027d ever heard of anyone specific that it had happened to.\\n\\n Mason had noticed my startled reaction. \"You okay? You look kind of weird.\"\\n\\n I shrugged it off. \"Yeah. Fine.\" \\n\\n","sourceLink":"https://allnovel.net/vampire-academy-vampire-academy-1/page-6.html","bookId":2060,"book":{"id":2060,"title":"Vampire Academy (Vampire Academy #1)","description":"Storyline: Vampire Academy Series 1: Vampire Academy \\n After two years on the run, best friends Rose, half-human/half-vampire, and Lissa, a mortal vampire princess, are caught and returned to St. Vladimir\u0027s Academy. Up until then, Rose had kept Lissa safe from her enemies; school, however, brings both girls additional challenges and responsibilities. How they handle peer pressure, nasty gossip, new relationships, and anonymous threats may mean life or death. Likable narrator Rose hides doubts about her friend behind a tough exterior; orphan Lissa, while coping with difficult emotional issues such as depression and survivor\u0027s guilt, uses her emerging gifts for good. Mead\u0027s absorbing, debut YA novel, the first in a new series, blends intricately detailed fantasy with a contemporary setting, teen-relevant issues, and a diverse, if sometimes sterotyped, cast of supporting characters. Occasional steamy sex and a scattering of vulgar language demand mature readers, but teens able to handle the edgy elements will speed through this vamp story and anticipate the next installment.\\n","cover":"https://allnovel.net/images/vampire-academy-vampire-academy-1.jpg","author":"Richelle Mead","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/vampire-academy-vampire-academy-1.html","creation":"Oct 5, 2019 8:58:18 AM","modification":"Oct 6, 2019 12:00:42 AM"}}
