{"id":16098,"no":24,"title":"CHAPTER XXIV A TREK HOMEWARD","content":"A dog train waited outside the Keechewan Mission. It was a long train—ten teams of malemutes and huskies—an impatient train, too, for not only the dogs but the drivers as well, waited impatiently for the word of command that would set it in motion. Brake-boards were passed firmly into the snow, the feet holding them in place becoming cramped as the moments passed and still the leader did not appear. Presently a door creaked open and a tall young man, laden with two heavy mail sacks, emerged to the street. It was Dick Kent—and he was smiling. Behind Dick came Dr. Brady and the cassocked figure of a Catholic priest, Father Bleriot. The two last named persons walked side-by-side, talking and laughing. The priest’s right arm was thrust in friendly fashion through that of the physician’s, and, as the three figures came to a halt directly opposite the sledge, to which a team of beautiful gray malemutes were harnessed, the doctor declared: 224 “So we’re to go back at last. I see you have everything ready, Dick. Nothing to do now except pull our worthless freight out of here.” “Monsieur does himself an injustice,” beamed the priest. “You have reason to feel proud—you and your friends. Hope and happiness and tranquility have come again to Keechewan.” “Have you any message that I can take to Inspector Cameron?” Dick asked. “It is there in the sack,” Father Bleriot pointed to one of the mail pouches Dick had placed in the empty sleigh. “A letter, monsieur, written from my heart and sealed with tears of thankfulness. All one night I sat and wrote that letter, page after page, to the good inspector, and when I had finished, monsieur, I found that I had expressed not even one small part of what I wished to say.” “Cameron will understand,” Dr. Brady reassured him. “And now you go,” said the priest regretfully. “You embark upon a difficult journey. You go south without even a pause to rest.” “It will not seem so far this time,” stated Dick, turning toward his sledge. “Well, thank you Father, for your kindness and hospitality. We must go now. Dr. Brady, you’ve worked hard, so we’re giving you the place of honor here with the mail.” 225 They shook hands again. Dr. Brady was bundled into the sleigh. At a signal from Dick, impatient feet were lifted from brake-boards, whips cracked, and the train whirled away amid a flurry of fine snow. Father Bleriot, a somewhat lonely figure, stood and waved his farewell, his expressive dark eyes lighting with satisfaction, as there came to him the cheers of scores of happy householders, who lined the streets to watch the party go by. Speeding southward, the dog train soon left the village behind. The bleak landscape of the Barrens settled around them. Rolling drifts of crusted snow stretched away to the horizon. The wind shrieked up from behind, a cold wind which froze the hot breath of the huskies, and painted their lean, gray flanks with a white coat of frost. Hour after hour, then day after day, the cavalcade bore on. The Barrens vanished. A streak of dun-colored forest slowly advanced and silently enwrapped them. The forest led them to a chain of hills. The hills carried them begrudgingly to a valley. The valley flung them into a meadow, which, in turn, by various stages, brought them to another forest, another valley, across lakes, down ravines, over rivers, on and on and on, until at last, when they had almost begun to believe that the trail would never end, weary yet exuberant, they drove into the compound at Fort Mackenzie. 226 There followed a scene which to Dick at least seemed somewhat confused and vague. He remembered helping to carry Corporal Rand into the barracks. He recalled a good deal of shouting and laughing. A throng pressed forward, sledges were unloaded, drivers darted here and there. Sandy and Toma joined Dick, and they were standing there, talking excitedly, when a crimson-coated figure pushed his way through the crowd and approached them. “Welcome back,” Constable Whitehall shouted. “Glad to see you all home again. The inspector is waiting for you.” The three boys followed the police orderly to Cameron’s office, followed him in a state of mind in which excitement, happiness and relief intermingled. They had expected to find the grizzled police official sitting, as was his wont, sternly erect in his chair, lips pursed, steel-gray eyes levelled upon them. But to their surprise, as the door swung open, revealing the room beyond, the inspector was standing—not behind—but in front of his desk. 227 The grim look was not there. True, his eyes were upon them, and he did not speak for a moment, as they filed in and halted awkwardly in front of him. Then Dick noticed the smile: warm and friendly, a sort of paternal smile that wholly transfigured and enlivened his features, that had the curious effect of making the boys forget their shyness and feel at ease. And while Dick was making a mental note of this, Cameron had suddenly come forward and was shaking them by the hand, talking and joking, winking slyly at Constable Whitehall. “You young rascals! No need to tell me that everything didn’t come out all right. Don’t try to deceive me. I see it—see it shining in your eyes. Constable Whitehall, bring over those chairs. That’s better. Sit down. Now, Dick—— Sit down, I tell you, while Richard here relates his experiences.” In a few words, Dick told his story. Yet he was out of breath when he had finished, and a little incoherent when he tried to answer the few sharp questions Cameron fired at him. “At any rate,” smiled the inspector, “you got there, and you came back. From what you’ve already told me, I gather that you had trouble at Keechewan. Was that the only trouble you had?” “Yes, sir,” answered the bewildered young leader. “Why, Dick,” Sandy reminded him, “we had trouble on the trail—lots of it.” “So we did,” remembered Dick. “I’d forgotten about that. We picked up Lamont on our way back, but Fontaine and the rest left us—skipped out.” “They’re here,” said Cameron grimly, “—in jail! We can eliminate them. Now, about this Lamont?” 228 “I shoot him,” declared Toma briefly. “You did?”—sharply. “Yes, sir.” “Why?” “Him bad fellow.” Cameron’s mouth twitched at the corners. “Is he hurt badly?” “He’ll be all right in a few weeks, inspector,” Dick came quickly to his chum’s rescue. “Was Toma justified in doing this?” Cameron inquired, turning to Sandy and Dick. Two young men quickly nodded their affirmation. “Well, that’s all I want to know. I’ll overlook it this time, Toma. You’ve already told me, Dick, about Corporal Rand. Took him to the barracks, you say?” “Yes.” Inspector Cameron rose from his chair and paced slowly up and down the room. For a time he seemed oblivious of their presence. He had become grim and forbidding now, stern and austere—not at all the companionable and affable person he had been at the beginning of their interview. Dick and Sandy exchanged questioning glances, then their eyes stole furtively toward the door. The footbeats came to a sudden pause in front of them. 229 “I’m grateful to all of you—very grateful! I’m proud of you. Of course, I’ll pay you well. You deserve it.” Cameron was smiling again. His voice had lost its sharp edge. “Now, if there is anything that I can do. If——” Dick interrupted him. It was the opportunity he had been looking for. “There’s one favor, inspector,” he cleared his throat. “There’s one thing we’d like—Sandy and Toma and I. You see, we’ve talked it over. We don’t want the money. Money isn’t everything. We were glad to help out in an emergency. Glad—but——” “Yes; yes, my boy. What is it?” “We’d be ever so much obliged to you, sir, and thankful, if you’d dismiss the charge against Corporal Rand.” If Dick had hurled a bomb under Cameron’s desk it could not have caused more consternation and surprise. Whitehall started back and his mouth gaped open. Inspector Cameron blinked, gulped several times, and attempted to cover his confusion by blowing his nose. A deep and oppressive silence settled over the room. 230 Not until then, did Dick realize that he had committed an unpardonable breach of official etiquette. He had smashed precedent and dignity to bits. He had violated the code. He had taken advantage of his position. As the full consciousness of the enormity of his crime came over him, he hung his head, his cheeks flaming to match the color of the inspector’s tunic. Suddenly the tension snapped. Inspector Cameron broke into a roar of laughter. He slapped his thighs and still choking with merriment, turned to his orderly. “Whitehall, you—you see how helpless I am. I ask you to become my witness. I’m powerless. This is blackmail. Conduct these young ruffians outside. And, Whitehall——” he paused abruptly. The constable’s heels clicked as he came sharply to attention. “Yes, sir.” “Tell Corporal Rand that I’ll see him at once.” The End","sourceLink":"http://novel.tingroom.com/jingdian/1585/47128.html","bookId":1255,"book":{"id":1255,"title":"Dick Kent with the Malemute Mail","description":"简介： A discouraged, dishevelled human figure crossed a narrow woodland to the west of a chain of hills, thence made his way slowly down to a sun-baked valley or depression, many miles in extent. The valley was rough, broken, repellent to the eye. For the...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1585","creation":"Aug 1, 2019 12:24:43 AM","modification":"Aug 1, 2019 12:24:43 AM"}}
