{"id":64689,"no":12,"title":"Page 12","content":"“So are you, and you and I are about as compatible as me and vanilla.”\n “Fair enough,” I conceded, effectively giving up.\n I was a failure of a matchmaker.\n Frankie met the girl we’d been talking about, Estella, less than ten minutes later. The irony about the whole thing was that Estella was noticeably into Frankie, blatantly flirting with her right from the start.\n Estella was a shapely little Brazilian, with long, thick, wavy brown hair. She was maybe an inch shorter than Frankie and had an outgoing, fiery personality. She also liked to wear very little in terms of clothing, which gave her yet another thing in common with Frankie.\n Frankie wasn’t having it. She was nice to the girl, but not at all flirtatious.\n “It’s hard to explain a preference like mine,” Frankie explained when the girl had finally flitted off. “I’m attracted to Estella. She’s highly fuckable, but that is not the point. I couldn’t be who I need to be with her, and I won’t settle for less.”\n “How do you ever find anyone? It’s hard enough finding decent people to date and then throwing something like that in the mix…”\n “It’s not easy. Not at all. But I’ll tell you what, I won’t ever be finding that somebody at a college bar. I’d rather be celibate for life than try vanilla again. Does nothing for me.”\n “So you have tried it?”\n “Not with a lot of success, and not since I was too young to know better. A preference like mine…it’s a dark thing, in a way, but when I get it right, God, there’s nothing like it. Regular sex could never compare. Has all the excitement of a board game to me.”\n “How long has it been since you’ve, yanno, found someone?”\n “I parted ways with my last sub over a year ago. Like I said, it’s not easy for me to find someone that’s compatible.”\n I felt like a jerk for asking so many questions, because suddenly, she sounded very sad. “It’s none of my business. I was being nosy. I’m sorry.”\n “Don’t be sorry. You’re my friend. I make it a point to be open with friends. I want you to know who I am, and my sexuality is a huge part of that. It’s unusual enough that it is part of what defines me. I’ve made peace with that. And dating sucks for everyone. I’m far from alone there.”\n “Very true.”\n Estella came back, smiling at Frankie and holding two martinis. I’d thought she’d gotten the hint, but I saw that I was wrong.\n “I love tattoos,” she told Frankie, handing her one of the drinks.\n “Oh yeah?” Frankie asked politely, taking a sip of the drink. “I have a tattoo parlor. If you’re ever thinking about getting ink, you should come to me.”\n Estella blinked, looking fascinated. “I was just talking about the ink you have on you. I didn’t realize you were an artist. I’d love to come look at designs. Where is your shop? I’m new in town. I don’t have, how do you say, connections?”\n Frankie looked more drawn in with every word the other woman said. Estella did have a sexy accent. “You don’t need to have connections to get a tattoo.”\n Estella giggled, and the way Frankie smiled at that gave me the tiniest sliver of hope.\n “I meant directions, not connections.” She giggled some more. She really was adorable.\n She leaned into Frankie, touching her arm. She was interested, and not even trying to hide it. “I’d love to be your canvas. I think ink is art.”\n If she’d known Frankie for years, the girl could not have had a better pick up line for her.\n “That’s actually my motto. It’s even on my cards.” Frankie reached into her pocket, pulling one out. “The address is on the card, but my joint is up in the mall at the Cavendish casino. You can’t miss it.”\n Estella bounced a bit in her excitement, and I saw Frankie’s eyes glue straight to her generous chest. “The Cavendish Hotel? How exciting to have a parlor there! It is a beautiful casino.”\n “Do you watch a lot of TV?” Frankie asked her.\n “Television? I used to watch a lot. It helped me with my English, but I don’t have time to watch it anymore.”\n Frankie looked relieved, and didn’t mention her own reality show. I didn’t blame her. It had to be hard not to attract the wrong people, being that high profile.\n “What do I owe you for the drink?” she asked.\n Estella waved her off, giving her a very friendly smile. “It was my treat. Unless, of course, you want to kiss me. I never turn down a kiss from a beautiful woman.”\n Frankie’s mouth twisted ruefully. “I don’t give out kisses for drinks.”\n “Then it is free. Will you kiss me now?”\n Frankie shook her head, looking more uncomfortable than I’d ever seen her. “It doesn’t work like that with me. Don’t get me wrong. You’re beautiful, but I don’t do easy hookups.”\n “Who says this is easy? I want you. I don’t see the point of hiding it, but that doesn’t make it easy.”\n Frankie grabbed Estella’s wrist, pulling the other woman’s body against hers. Being nearly the same height, they lined up perfectly. They were a striking sight, two beautiful women embracing, looking like they were about to kiss. I knew I wasn’t the only one in the bar staring at them.\n Frankie didn’t kiss her though, instead putting her lips to Estella’s ear.\n What she said to the other woman, I could only imagine, but Estella wasn’t pulling away in horror. On the contrary, her jaw went slack, her eyes glassy. I would have bet money she was turned on.\n It was several fascinating minutes before Frankie pulled back, making very solid eye contact with Estella before she grabbed a handful of the woman’s wavy brown hair, dragging their mouths together for one of the sexiest kisses I’d ever seen in my life.\n When Frankie finally pulled back, she smiled at the other woman. Something in that smile, in the way her expression had changed, made me think she’d taken control of their dynamic, gone from prey to predator.\n “That’s the only free kiss you’ll ever get from me, Estella. The rest you’ll have to earn. My number’s on that card if you want to talk about it.”\n Frankie turned away from her, obviously thinking the matter was settled, but Estella grabbed her arm before she could take a step.\n “Wait! I do! I want to talk about it. I’d like to…do what you mentioned.”\n Frankie swallowed hard, back to looking uncomfortable. “Is it something you’ve tried before?”\n She shook her head. “No, but I’ve thought about it. I’ve…fantasized about it.” She glanced around as she said it, as though afraid they’d be overheard. I wasn’t going to be the one to tell her that half the bar was listening in.\n To say Frankie looked intrigued was putting it mildly. “Have you now?” she asked softly. “I might just be able to work with that. Give me a call tomorrow, if you don’t change your mind after you’ve slept on it.”\n Estella didn’t let go of her arm. She wasn’t done. “I won’t be able to sleep. I want to spend the night with you. I don’t want to wait.”\n “It shouldn’t be a rash decision. You should take your time and think about it.”\n “Please. I know what I want. Trust me that much, at least.”\n And so I found myself driving to Frankie’s house, two lesbians going at it in the back of my beat-up car. Frankie claimed that she’d taken a taxi to the bar, and didn’t want to wait for one to pick them up, and Estella had gotten a ride from one of the other dancers.\n I didn’t mind playing chauffeur, unabashedly thrilled that Frankie might have found someone she could be compatible with.\n Someone’s shirt, I thought it was Estella’s, though it was hard to tell in the dark, landed in the passenger’s seat.\n “Whoa,” I said under my breath.\n “God, her fucking tits are real,” Frankie said loudly.\n Was she talking to me? “Oh yeah?” I responded in the most appropriate way I could think of.\n “Yeah. I fucking love real tits. They are hard as hell to find in Vegas.”\n “Well, that’s nice,” I said pleasantly, thinking this was the strangest car ride I’d ever had.\n “Do I get to touch you?” Estella asked her.\n “If you are very, very good, you will earn that right when I say, but not before. Even if it is just handholding, I will be doing all of the touching. You okay with that? Is this going to be too much for you?”\n Estella’s swift and firm denial made me smile. I wanted this to work out for them.\n “The correct response will always end in Mistress Abelli.”\n I felt suddenly like a voyeur, that little tidbit feeling like an intrusion into Frankie’s other ‘side.’\n “Yes, Mistress Abelli,” Estella told her in a breathless voice.\n “Dayum,” I said under my breath. I knew Frankie was hardcore, but damn me if that stuff wasn’t kind of hot.\n Tristan seemed just as happy as I was about Frankie’s potential love match when I called him before bed.\n The background noise on his end was bad. It sounded like he was in a small room with about a thousand giggling women.\n “Where are you?” I asked him. It sounded like a party or a club.\n “At some party for the record people.” He sounded distracted.\n “Well, I’ll let you go. You sound busy. Hopefully we can talk tomorrow.”\n “Sounds good. Tomorrow, then.”\n “‘Kay.”\n I hung up, feeling edgy and upset, suddenly plagued by a wave of discontent. Here we were, apart most of the time, and I couldn’t even go out and dance without worrying about what he’d think.\n Meanwhile, he was at God only knew what kind of a party. Real trust was an elusive thing for me, given my track record with men, and Tristan’s track record with sex.\n He could be doing absolutely anything he wanted, and I’d never know.\n I felt our distance so keenly in that moment, not just in miles but in intimacy. What was it that kept us together? We didn’t even live in the same city now, and he apparently didn’t need me anymore.\n I tossed and turned all night, tortured by the thought that I may not really even know him at all.\n CHAPTER TEN\n TRISTAN\n I hung up the phone, glaring at Dean, who was laughing, draped over some chick I’d never seen before across the room.\n The band shared a small house near the recording studio. It was not ideal, being that we didn’t even get our own bedrooms, and the living area was small enough to be useless.\n And instead of getting weekends off, like they’d promised us, we worked through them half the time, making it feel more and more like we were living here, instead of in Vegas.\n It was wearing on me, to say the least.\n And, pissing me off just as badly, the record was being stalled at every turn. Dean had gone into full on self-destruct mode, spouting off bullshit about having creative differences with Kenny, slowing down a process that was already too slow. \n","sourceLink":"https://allnovel.net/rock-bottom-tristan-danika-2/page-12.html","bookId":1930,"book":{"id":1930,"title":"Rock Bottom (Tristan \u0026 Danika #2)","description":"Storyline: \n Rock Bottom (Tristan \u0026 Danika #2) \n Their love had the power of a runaway freight train, and the potential to be just as destructive. \n The tempestuous sequel to Bad Things picks up where the first book left off. Reeling from a profound loss, Tristan and Danika struggle to pick up the pieces and build a life together, but the hard habits of a lifetime are not so easy to escape. \n Rock Bottom takes us on a dual point of view journey through addiction and desire, through love and agony, and answers the question we’ve been asking since these characters were introduced in Grounded: “What happened between Tristan and Danika?” \n DANIKA \n Even love couldn’t cushion a fall like ours. My love for Tristan was so big that I felt consumed by it, and even so, it was not enough to overpower our combined demons. \n I struggled. I yelled and screamed. I scratched and kicked. \n I fought like hell, but even the most determined fighters have to stop before they break. \n No one could say I didn’t fight for him. \n “I love you,” I spoke softly into his ear. \n He gripped me harder. “I can’t ever lose you, Danika. I’m not sure I’d survive it.” \n “You’ve got me. And I’m not going anywhere. Not ever.” \n I meant the words when I said them, but life had other plans for us. \n I’d have given my life for that fight. In fact, I very nearly did. \n TRISTAN \n She was the one. \n If I’d ever had a doubt, I didn’t now. She was the one I’d be thinking about, longing for, until I took my last breath. If I lost her tomorrow, I’d pine for her like a lovesick fool. \n This was the kind of love that only hit you once in your life.\n \n","cover":"https://allnovel.net/images/rock-bottom-tristan-danika-2.jpg","author":"R.K. Lilley","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rock-bottom-tristan-danika-2.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:54:57 AM"}}
