{"id":38734,"no":19,"title":"CHAPTER XIX. DIAMOND CUT DIAMOND.","content":"On the morning after the day when Miss Gillespie had made so successful a debut among the company assembled at Redmoor, Mr. Effingham, lounging quietly up the road from the Mitford Arms, rang at the lodge-gate, and after a few minutes\u0027 conversation with the old portress, passed up the avenue. His conversation was purely of a pleasant character; there was no inquiry as to who he was, or what he wanted,--all that had been settled long ago. He was a gentleman from London, who was writing a book \u0027bout all the old fam\u0027ly houses, and was going to put our place into it. He knew Sir Charles, and had his leave to come and go when he liked. A civil-spoken gentleman he was, and talked most wonderful; never passed the lodge without stopping to say something. Perhaps of all Mr. Effingham\u0027s peculiarities, this impressed the old woman the most; for, like all country people of her class who live a solitary and quiet life, she was thoroughly reticent, and it is questionable whether, beyond the ordinary salutations to those with whom she was brought in contact, she uttered more than a dozen sentences in a week. But Mr. Effingham\u0027s light airy chatter was very welcome to the old lady, and, combined with the politeness which he always exhibited, had rendered him a great favourite. A considerable alteration had been effected in Mr. Effingham\u0027s outward man since his first visit to Redmoor. As in the former instance, his first step on receiving the ten pounds from Sir Charles was to purchase a new suit of clothes. He bought them at the neighbouring town, and in pursuance of his intention to assume a literary or artistic character, he had endeavoured to render his apparel suitable, or, as he called it, \"to make up for the part.\" So he now wore a large slouch felt wideawake hat, a dark velveteen jacket, long waistcoat, gray trousers, and ankle-jack boots. Had he carried out his own views of literary attire, he would have adopted a long dressing-gown and Turkish trousers, such as he had seen in the portraits of celebrated authors; but he felt that these would be out of place in the country, and might attract attention. He, however, armed himself with a large notebook and a pencil of portentous thickness, with which he was in the habit of jotting down visionary memoranda whenever he found himself observed. By the initiated and the upper classes this last-described act may have been recognized as an indisputable literary trait; but by the lower orders Mr. Effingham was regarded as a mystic potentate of the turf, whose visit to the Mitford arms had mysterious connection with the proximity of Sir Danesbury Boucher\u0027s stables, where Lime-juice, the third favourite for the Derby, was in training; while the entries of the memoranda were by the same people ascribed to the exercise of a process known to them as the booking of bets. The March morning was so splendid in its freshness and bright glittering sunlight, that Mr. Effingham, although little given to admiring the beauties of nature, could not resist occasionally stopping and looking round him. The old elms forming the avenue were just putting forth their first buds; far away on either side stretched broad alternations of turf in level, hill, and glade, all glistening with the morning dew; while on the horizon fronting him, and behind the house, could be seen the outline of the great Redmoor. The jolly old house stood like some red-faced giant, its mullioned windows winking at the sunlight, the house itself just waking into life. From the stable-yard came a string of rugged and hooded horses for exercise. The gardeners were crossing from the conservatory bearing choice flowers for the decoration of the rooms. At the porch was standing the head-keeper, accompanied by two splendid dogs; a groom on horseback, with the swollen post-bag slung round him, passed Mr. Effingham in the avenue; everywhere around were signs of wealth and prosperity. \"Yes,\" said Mr. Effingham to himself, as he stopped and surveyed the scene, \"this is better than my lodgings in Doory Lane, this is! No end better! And why should this fellow have it, and not me--that\u0027s what I want to know? I could do it up pretty brown, here, I\u0027m thinkin\u0027; not like him--not in the same way, that is, but quite as good. There mighn\u0027t be so many nobs, but there\u0027d be plenty of good fellers; and as for the nobs, Lord bless you, when they found there was plenty of good grub and drink, and good fun to be had, they\u0027d come fast enough. I should just like to try it, that\u0027s all; I\u0027d show him. And why shouldn\u0027t I try it? Not in this way, perhaps--not to cut it quite so fat as this, but still reg\u0027lar comfortable and nice. A nice little box at Finchley or Hampstead, with a bit o\u0027 lawn, and a pony-trap, and chickens, and a spare bed for a pal,--that\u0027s my notion of comfort! And why shouldn\u0027t I have it, if I play my cards properly? Damme, I will have it! I\u0027m sick of cadgin\u0027 about from hand to mouth, never knowin\u0027 what\u0027s goin\u0027 to turn up next. This bit o\u0027 stiff ought to be worth anything to me--anything in reason, that is to say. So, when I\u0027ve once got it from our friend here, and that won\u0027t be just yet,--I must get her away from here, and have her well under my thumb, before I try that on,--when I once get, that docyment, I\u0027ll take it straight to Sir Charles, and let him have it for a sum down--must be a big sum too--and then I\u0027ll cut the whole lot of \u0027em, and go and live somewhere in the country by myself! That\u0027s what I\u0027ll do!\" L\u0027appétit vient en mangeant. When Mr. Effingham was utterly destitute he accommodated himself to his position, and lived on, from hand to mouth, in the best way he could. He retired to the back-ways and slums then, and seeing very few people much better off than he was himself, his envy and jealousy were not excited. Sir Charles\u0027s ten pounds had disturbed the little man\u0027s mental equilibrium; the readiness with which they melted in his grasp showed him how easily he could get rid of a hundred, of a thousand, of ten thousand. The sight of the comfort and luxury of Redmoor contrasted horribly with the wretchedness of his own lodging, and lashed him into a storm of rage. \"It\u0027s too bad!\" said he, striking his stick against the tree by which he was standing,--\"it\u0027s too bad that there should be all this lot of money in the world, and that I should have none of it, while this cove here--O yes, if you please, my horses goin\u0027 out with the grooms; my gardeners a bringin\u0027 pines and melons and all the rest of it; my keeper a-waitin\u0027 to know how many pheasants I\u0027m going to kill to-day! Damme, it\u0027s sickening!\" Mr. Effingham struck the tree again, pushed his hat over his eyes, and started off in his walk. When he had proceeded about half-way up the avenue, he climbed the iron fence, and started off to the right over the park, until he reached a little knoll, on the top of which were two magnificent cedars. On the other side of these cedars, and completely hidden by them from the house, was a carved rustic seat. On reaching the top of the knoll, Mr. Effingham looked round, and seeing nobody, sat down, put his feet up, and made himself most comfortable. A lengthened contemplation of the cedars, however, instead, as might have been expected, of bringing calm to his perturbed soul, served only to remind him that they, in common with all the surroundings, were the property of somebody else, and that on that somebody else he had a tremendous hold, provided he went properly to work. \"And I\u0027ll do it!\" said he, taking his feet off the bench, and pushing the felt wideawake hat into all kinds of shapes in his excitement,--\"I\u0027ll do it too! Now, let me see! My friend will be here presently--let me just run through what\u0027s to be done. Quiet\u0027s the game with her, I think; no bullyrag and bluster--quiet and soft. No connection with any one here--never even heard the name--sent by the other parties--I\u0027m so innocent. Yes, I think that will do; then, when we\u0027ve once started together, I can make my own terms.--How late she is! She must be awfully down on her luck at being spotted down here, and she must suspect something by the quick way in which she agreed to meet me here when I spoke to her yesterday as she was walkin\u0027 with the young \u0027un,--made no bones about it at all. She won\u0027t fail me, I suppose.\" Oh no, she would not fail him. There she was, crossing the park apparently from the back of the stables, and making straight for the cedars. Could it be she? A figure bent nearly double, dressed in an old-fashioned black-silk cloak and a poke-bonnet, and leaning on a thick umbrella. It was not until she was well under the shadow of the cedars, that she straightened herself, pushed back her bonnet, and stood revealed as Miss Gillespie. \"Good-morning,\" said she, so crisply and blithely that Mr. Effingham, who had expected she would adopt a very, different tone, was quite astonished; \"I\u0027m afraid I\u0027m a little late, Mr. ----; you did not favour me with your name; but the fact is, as you probably know, I am not my own mistress, and my services were required just as I was about to start.\" \"All right, miss,\" said Mr. Effingham, taking off his hat, and making a bow as near as possible after the manner of walking-gentlemen on the stage--a proceeding with which the limpness of the wideawake\u0027s brim interfered considerably; \"my name\u0027s Effingham.\" \"Indeed! what a pretty name! so romantic. You would not mind my sitting down, would you? No; that\u0027s all right. And now, Mr. Effingham, I suppose you want something of me, don\u0027t you, after that mysterious communication which you made to me yesterday when I was walking with my pupil? Poor child! she\u0027s been in a state of wonderment ever since; and I\u0027ve had to invent such stories about you. And what is it you want, Mr. Effingham?\" Mr. Effingham scarcely liked the tone; he felt he was being \"chaffed;\" so he thought he would bring matters to a crisis by saying, \"My name\u0027s not Effingham--at least, not more than yours is Gillespie.\" \"Oh, I perceive,\" said she with a little nod. \"My name\u0027s Butler as much as yours is Ponsford. Now d\u0027ye see?\" \"O yes; now I see perfectly. Butler, eh? Any relation of a man named Tony Butler who is now dead?\" \"Yes--his brother. He may have spoken to you of a brother in America.\" \"In America! ay, ay. Well, Mr. Butler,\" she continued with a bright smile, \"now I know that you\u0027re the brother of Tony Butler, there\u0027s scarcely any need of repeating my question whether you wanted anything; for--pardon me--you could hardly belong to that interesting family without wanting something. The question is, what do you want? Money? and if so, how much?\" \"No; I don\u0027t want money--\" \"That\u0027s very unlike Tony Butler. I shall begin to discredit your statements,\" said she, still with the pleasant smile. \"At least not yet, nor from you. But I do want something.\" \"Ye-es, and that is--\" \"I want you to go away from here with me at once.\" \"To go away from here! O no. Connu, my dear Mr. Butler; I see the whole of the play. This is not your own business at all, dear sir. You dance, and kick your legs and swing your arms very well; but you are a puppet, and the gentleman who pulls the strings lives over yonder;\" and she pointed with her umbrella to Redmoor House. \"I can\u0027t make out what you mean.\" \"O yes, you can. \u0027A master I have, and I am his man.\u0027 You are Sir Charles Mitford\u0027s man, Mr. Butler; and he has set you on to tell me that I must leave this place and rid him of my influence. Now, you may go back to Sir Charles Mitford, your master, and tell him that I set him utterly at defiance; that I won\u0027t move, and that he can\u0027t make me. Do you hear that, my dear Mr. Butler?\" She had risen from her seat, and stood erect before him, looking very grand and savage. Her companion knew that the success of his scheme depended wholly upon the manner in which he carried out the next move, and accordingly he threw all his power into the acting of it. \"You\u0027re one of those who answer their own questions, I see,\" said he with perfect calmness. \"I\u0027ve met lots o\u0027 that sort in my travels, and I never found \u0027em do so much good as those that waited. All you\u0027ve been saying\u0027s Greek to me. Who\u0027s Sir Charles Mitford? I\u0027ve heard of him, of course, as the swell that lives in that house. They\u0027ve never done talking of him at the Mitford Arms and all about there. But what\u0027s he to do with you? I suppose it don\u0027t matter to him who his friends\u0027 governesses is. He\u0027s not sweet on you, is he? If so, he wouldn\u0027t want you to go away. And what\u0027s he to do with me? and how\u0027s he likely to hear of my having been in the place? I haven\u0027t left my card upon him, I promise you,\" said Mr. Effingham with a grim humour. Miss Gillespie looked at him hard, very hard. But his perfect command of feature had often stood Mr. Effingham in good stead, and it did not desert him now. The saucy laughter on his lips corresponded with the easy bantering tone of his voice; he sat swinging his legs and sucking his stick, the incarnation of insolence. So far he was triumphant. She waited a minute or two, biting her lips, and turning her plans in her mind. Then she said, \"Granting what you say--and it was rather a preposterous proposition of mine, I admit--you are still a puppet in somebody\u0027s hands. You had no knowledge of my previous life, and yet you come to me and say I must come away at once with you. Why must I come away?\" \"Because you\u0027re wanted.\" \"And by whom?\" \"By the crew of the Albatross. Ah, I thought you wouldn\u0027t be quite so much amused and so full of your grins when I mentioned them.\" \"Oh,\" said she, recovering herself, \"I can still grin when there\u0027s anything to amuse me. But we seem to have changed places; now you\u0027re talking riddles which I cannot understand.\" \"Can\u0027t you? then I must explain them for you. If what I\u0027m told is right--but it\u0027s very little I know--you belonged to that crew yourself once. My brother Tony was one of them, I understand; and though he\u0027s dead now, there\u0027s several of \u0027em left. Old Lyons, for instance,--you recollect him? Crockett, Griffiths--\" \"Suppose, to avoid giving you further trouble, I say I do recollect them, what then?\" \"You\u0027re angry, although you smile; I can see that fast enough. But what\u0027s the good of being angry with me? You know when a feller gets into their hands what chance he has. You know that fast enough, or ought to. Well, I\u0027m in their hands, and have to do what they order me.\" \"And they\u0027ve ordered you to come down to me?\" \"They found out where you were, and sent me after you.\" \"Ha! And what on earth can have induced them, after a certain lapse of time, to be so suddenly solicitous of my welfare?\" said Miss Gillespie, laughingly. \"There was never any great love between any of those you have named and myself. I have no money for them to rob me of, nor do I see that I can be of any great use to them.\" \"I don\u0027t know that,\" said Mr. Effingham, laying his forefinger knowingly alongside his nose. \"You see, you\u0027re a pretty gal, and you\u0027ve rather got over me--\" \"Flattered, I am sure,\" said Miss Gillespie, showing all her teeth. \"No, it ain\u0027t that,\" said he, with a dim perception that his compliment was not too graciously received; \"it ain\u0027t that; but I do like a pretty girl somehow. Well, you see, they don\u0027t let me much into their secrets--don\u0027t tell me the reason why I\u0027m told to do so and so; they only tell me to go and do it. But I don\u0027t mind tellin\u0027 you--taking an interest in you, as I\u0027ve just said--that, from what they\u0027ve let drop accidentally, I think you can be of great use to them.\" \"Indeed! have you any notion how?\" \"Well, now look here. I\u0027m blowin\u0027 their gaff to you, and you know what I should get if they knew it; so swear you\u0027ll never let on. From what I can make out, there\u0027s certain games which you used to do for them that they\u0027ve never been able to find anybody to come near you in. I mean the Mysterious Lady, the fortune-tellin\u0027, and the electro-biology business.\" Some scenes recalled to her memory by these words seemed to amuse Miss Gillespie, and she laughed heartily. \"But that\u0027s \u0027general work,\u0027\" continued Mr. Effingham; \"what they want you particularly for just now is this. Some swell, so far as I can make out, came to grief early in life, and made a mistake in putting somebody else\u0027s name to paper; what they call forgery, you know.\" She nodded. \"Old Lyons has got hold of this paper, and he wants to put the screw on the swell and make him bleed. Now there\u0027s none of the lot has half your manner, nor, as they say, half your tact; and that\u0027s why, as I believe, is the reason they want you back in town amongst them.\" \"Ah! to--what did you say?--\u0027to put the screw on a swell and make him bleed,\u0027 wasn\u0027t it? How very nice! Well, now you\u0027ve obeyed your orders, and it\u0027s for me to speak. And suppose--just suppose for the fun of the thing--I were to hold by my original decision and declare I would not come, what would you do?\" \"I should go back to town and tell \u0027em all that had passed.\" \"And they?--what would they do?\" \"I can tell you that, because that was part of my instructions. Old Lyons put that very plain. \u0027If she rides rusty,\u0027 he says,--\u0027and she\u0027s got a temper of her own, I can tell you,--just let her know from me that I\u0027ll ruin her. I\u0027ll never leave her; she knows me of old; it won\u0027t be merely,\u0027 he says, \u0027her being turned away in disgrace out of where she is now; but I\u0027ll never leave her. She may go where she likes, but I\u0027ve found her out once, and I\u0027ll find her out again; I\u0027ll foller her up, and I\u0027ll be the ruin of her,\u0027 he says, \u0027so sure\u0027s her name\u0027s what it is.\u0027\" He looked up to see the effect of his speech, but Miss Gillespie was looking full at him with an expression of great interest and a very pleasant smile, as if she were listening to the narration of a thrilling story with which she had no connection save that of listener. \"Did he indeed say all that?\" said she, after a pause. \"Oh, he\u0027s a most terrible old man, and whatever he determines on, he never fails of carrying out. However, I think I won\u0027t put him to much trouble this time.\" \"How do you mean?\" \"Well, do you know I\u0027ve a strong mind to save you any further worry, and to crown you with glory by allowing you to carry me back in triumph.\" \"You don\u0027t say so! but this is too sudden, you know. I don\u0027t put much trust in such sudden conversions.\" \"Mine is not the least sudden. I generally act on the impulse of the moment. That now urges me to go back to my old life. The shackles of this respectability are beginning to strain a little. I feel cramped by them occasionally, and I suppose I have originally something of the Bohemian in my nature, for you have fired me with au ardent longing for freedom and irresponsibility.\" \"That\u0027s right!\" cried Mr. Effingham, delighted at the success of his scheme; \"that\u0027s just as it should be. It\u0027s all very well for those swells to live on here, and go on their daily round. They\u0027ve got the best of it, so far as they know; but they haven\u0027t seen as much as we have. They don\u0027t know the pleasure of--well, of pitting your wits against somebody else who think themselves deuced sharp, and beating them, do they?\" \"No,\" said Miss Gillespie, with her crispest little laugh; \"of course they don\u0027t.\" \"Well, now,\" said Mr. Effingham, \"you know what old Lyons is, reg\u0027lar man of business; want\u0027s everything done at once, right off the reel. When will you be ready to start?\" \"What a practical man you are, Mr. Butler!\" cried she, still laughing; \"it will be quite delightful to get back again into the society of practical people after all this easy-going laissez-aller time. But you must not be too hard upon me at first. I\u0027ve several things to do.\" \"You won\u0027t be saying \u0027goodbye\u0027 to anybody or anything of that sort?\" \"O no, nothing of that sort, you may depend.\" \"That\u0027s right; you mean putting your things together, eh?\" \"Yes; packing and getting ready to start.\" \"Well, twenty-four hours will be enough for that, I should think. Suppose we say to-morrow at noon?\" \"Ye-es, give me a little longer: say two in the afternoon, then I shall be perfectly ready.\" \"And where shall we meet?\" \"We must get across to the rail at once. Not to Torquay; there\u0027s a small station nearer here, where they won\u0027t think of looking for us. Not that I suppose they\u0027d take any trouble of that kind when they find I\u0027m once gone. However, it\u0027s best to be prepared. Can you drive?\" \"I should think so!\" said Mr. Effingham with a chuckle. \"I\u0027ve driven most things, from a shofle-cab in town to the mail-sleigh in Canada!\" \"How very nice!\" said she; \"that will do beautifully, then. You must get a gig or a dog-cart, or something light, from some place in Torquay. I shall have very little luggage, and have it all ready at a little side-gate of the park, which you can see--over there,\" again bringing the umbrella into requisition. \"That gate is invisible from the house; it\u0027s perfectly quiet and unfrequented, and I have a key of it. That once closed behind me I\u0027m thoroughly safe.\" \"And there\u0027s no chance of our being met, and you being recognized?\" \"Not the very smallest. The people staying in the house will all be at luncheon; the gardeners and stable-people, should we come across any, will all be in that state of comatose repletion which succeeds the after-dinner tobacco. Besides, very few of them know me by sight; and the road which I have pointed out skirts the Redmoor, and is very little frequented.\" \"That\u0027ll do! that will be first-rate! Now, let me see if all\u0027s understood. A dog-cart to be ready to-morrow at yon gate of the park, at two o\u0027clock sharp. There you\u0027ll be and your luggage--eh? By the by, how\u0027s that to get there?\" \"I told you it would be very little; and there\u0027s a boy devoted to my service, who will carry it.\" \"All right,--I only wanted to know. Two o\u0027clock to-morrow, then.\" He put out his hand, and as she lightly touched it with the tips of her fingers, offered to seize hers and convey it to his lips; but she slid it through his clumsy fist, and had pulled the poke-bonnet over her face, resumed the bent walk and the clumsy umbrella, and was making her way back across the park almost before he had missed her. \"And if ever a man did a good day\u0027s work, I\u0027ve done one this blessed morning,\" said Mr. Effingham, as he strolled quietly back through the avenue. \"They may talk about great genius, if they please. Great genius means getting hold of a good idea at the right minute, and strikin\u0027 while the iron\u0027s hot. That\u0027s great genius! and they was two great ideas which I\u0027ve worked just now! That pretendin\u0027 to know nothin\u0027 of the Bart., and gammonin\u0027 her that old Lyons sent me after her, was first-rate! I thought old Lyons\u0027s name would bring her round. They\u0027re all afraid of him, it seems. Now when we\u0027ve got some distance on the road, I\u0027ll tell her the truth, or, at least, as much as I choose, and just sound her about the bill. D\u0027Ossay, my boy, you\u0027ve done a good day\u0027s work, and can afford to go into Torquay and dine like a swell to-night!\" \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3078/85027.html","bookId":966,"book":{"id":966,"title":"Running the Gauntlet","description":"简介： Throughout the length and breadth of this London of ours there were few legal firms, no matter of how old standing, doing a better, larger ready-money business than that of Moss and Moss of Cursitor Street, Chancery Lane. Looked down upon? Well, one...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3078","creation":"Aug 1, 2019 12:24:02 AM","modification":"Aug 1, 2019 12:24:02 AM"}}
