{"id":9463,"no":11,"title":"CHAPTER IX","content":"OPPOSITION TO THE CENTRALIZATION OF THE GOVERNMENT—GENERAL PROSPERITY The centralization of France in Napoleon’s hands was not to be allowed to go on without interference. Jacobinism, republicanism, royalism, were deeply-rooted sentiments, and it was not long before they began to struggle for expression. Early in the Consulate, plots of many descriptions were unearthed. The most serious before 1803 was that known as the “Opera Plot,” or “Plot of the 3d Niv?se” (December 24, 1800), when a bomb was placed in the street, to be exploded as the First Consul’s carriage passed. By an accident he was saved, and, in spite of the shock, went on to the opera. Madame Junot, who was there, gives a graphic description of the way the news was received by the house: “The first thirty measures of the oratorio were scarcely played, when a strong explosion like a cannon was heard. “‘What does that mean?’ exclaimed Junot with emotion. He opened the door of the loge and looked into the corridor.... ‘It is strange; how can they be firing cannon at this hour?’ And then ‘I should have known it. Give me my hat; I am going to find out what it is....’ “At this moment the loge of the First Consul opened, and he himself appeared with Generals Lannes, Lauriston, Berthier, and Duroc. Smiling, he saluted the immense crowd, which mingled cries like those of love with its applause. Madame Bonaparte followed him in a few seconds.... “Junot was going to enter the loge to see for himself the serene air 134of the First Consul that I had just remarked, when Duroc came up to us with troubled face. “‘The First Consul has just escaped death,’ he said quickly to Junot. ‘Go down and see him; he wants to talk to you.’ ... But a dull sound commenced to spread from parterre to orchestra, from orchestra to amphitheatre, and thence to the loges. “‘The First Consul has just been attacked in the Rue Saint Nicaise,’ it was whispered. Soon the truth was circulated in the salle; at the same instant, and as by an electric shock, one and the same acclamation arose, one and the same look enveloped Napoleon, as if in a protecting love. “What agitation preceded the explosion of national anger which was represented in that first quarter of an hour, by that crowd whose fury for so black an attack could not be expressed by words! Women sobbed aloud, men shivered with indignation. Whatever the banner they followed, they were united heart and arm in this case to show that differences of opinion did not bring with them differences in understanding honor.” It was such attempts, and suspicion of like ones, that led to the extension of the police service. One of the ablest and craftiest men of the Revolution became Napoleon’s head of police in the Consulate, Fouché. A consummate actor and skilful flatterer, hampered by no conscience other than the duty of keeping in place, he acted a curious and entertaining part. Detective work was for him a game which he played with intense relish. He was a veritable amateur of plots, and never gayer than when tracing them. Napoleon admired Fouché, but he did not trust him, and, to offset him, formed a private police to spy on his work. He never succeeded in finding anyone sufficiently fine to match the chief, who several times was malicious enough to contrive plots himself, to excite and mislead the private agents. The system of espionage went so far that letters were regularly opened. It was commonly said that those who did not want their letters read, did not send them by post; and though it was hardly necessary, as in the Revolution, to send them in pies, in coat-linings, or hat-crowns, yet care 135and prudence had to be exercised in handling all political letters. It was difficult to get officials for the post-office who could be relied on to intercept the proper letters; and in 1802, the Postmaster-General, Monsieur Bernard, the father of the beautiful Madame Récamier, was found to be concealing an active royalist correspondence, and to be permitting the circulation of a quantity of seditious pamphlets. His arrest and imprisonment made a great commotion in his daughter’s circle, which was one of social and intellectual importance. Through the intercessions of Bernadotte, Monsieur Bernard was pardoned by Napoleon. The cabinet noir, as the department of the post-office which did this work was called, was in existence when Napoleon came to the Consulate, and he rather restricted than increased its operations. It has never been entirely given up, as many an inoffensive foreigner in France can testify. The theatre and press were also subjected to a strict censorship. In 1800 the number of newspapers in Paris was reduced to twelve; and in three years there were but eight left, with a total subscription list of eighteen thousand six hundred and thirty. Napoleon’s contempt for journalists and editors equalled that he had for lawyers, whom he called a “heap of babblers and revolutionists.” Neither class could, in his judgment, be allowed to go free. 136 “THE GENERAL OF THE GRAND ARMY.” This pencil portrait by David is nothing but a rapid sketch, but its iconographic interest is undeniable. David doubtless executed this design towards the end of 1797, after Bonaparte’s return from Italy. It belongs to Monsieur Cheramy, a Paris lawyer.—A. D. 137The salons were watched, and it is certain that those whose habitués criticised Napoleon freely were reported. One serious rupture resulted from the supervision of the salons, that with Madame de Sta?l. She had been an ardent admirer of Napoleon in the beginning of the Consulate, and Bourrienne tells several amusing stories of the disgust Napoleon showed at the letters of admiration and sentiment which she wrote him even so far back as the Italian campaign. If the secretary is to be believed, Madame de Sta?l told Napoleon, in one of these letters, that they were certainly created for each other, that it was an error in human institutions that the mild and tranquil Josephine was united to his fate, that nature evidently had intended for a hero such as he, her own soul of fire. Napoleon tore the letter to pieces, and he took pains thereafter to announce with great bluntness to Madame de Sta?l, whenever he met her, his own notions of women, which certainly were anything but “modern.” As the centralization of the government increased, Madame de Sta?l and her friends criticized Napoleon more freely and sharply than they would have done, no doubt, had she not been incensed by his personal attitude towards her. This hostility increased until, in 1803, the First Consul ordered her out of France. “The arrival of this woman, like that of a bird of omen, has always been the signal for some trouble,” he said in giving the order. “It is not my intention to allow her to remain in France.” In 1807 this order was repeated, and many of Madame de Sta?l’s friends were included in the proscription: “I have written to the Minister of Police to send Madame de Sta?l to Geneva. This woman continues her trade of intriguer. She went near Paris in spite of my orders. She is a veritable plague. Speak seriously to the Minister, for I shall be obliged to have her seized by the gendarmerie. Keep an eye upon Benjamin Constant; if he meddles with anything I shall send him to his wife at Brunswick. I will not tolerate this clique.” But when one compares the policy of restriction during the Consulate with what it had been under the old régime and during the Revolution, it certainly was far in advance in liberty, discretion, and humanity. The republican government to-day, in its repression of anarchy, and socialism has acted with less wisdom and less respect for freedom of thought than Napoleon did at this period of his career; and that, too, in circumstances less complicated and critical. 138If there were still dull rumors of discontent, a cabinet noir, a restricted press, a censorship over the theatre, proscriptions, even imprisonments and executions, on the whole France was happy. “Not only did the interior wheels of the machine commence to run smoothly,” says the Duchesse d’Abrantès, “but the arts themselves, that most peaceful part of the interior administration, gave striking proofs of the returning prosperity of France. The exposition at the Salon that year (1800) was remarkably fine. Guérin, David, Gérard, Girodet, a crowd of great talents, spurred on by the emulation which always awakes the fire of genius, produced works which must some time place our school at a high rank.” The art treasures of Europe were pouring into France. Under the direction of Denon, that indefatigable dilettante and student, who had collected in the expedition in Egypt more entertaining material than the whole Institute, and had written a report of it which will always be preferred to the “Great Work,” the galleries of Paris were reorganized and opened two days of the week to the people. Napoleon inaugurated this practice himself. Not only was Paris supplied with galleries; those department museums which to-day surprise and delight the tourist in France were then created at Angers, Antwerp, Autun, Bordeaux, Brussels, Caen, Dijon, Geneva, Grenoble, Le Mans, Lille, Lyons, Mayence, Marseilles, Montpellier, Nancy, Nantes, Rennes, Rouen, Strasburg, Toulouse, and Tours. The prix de Rome, for which there had been no money in the treasury for some time, was re?stablished. Every effort was made to stimulate scientific research. The case of Volta is one to the point. In 1801 Bonaparte called the eminent physicist to Paris to repeat his experiments before the Institute. He proposed that a medal should be given him, with a sum of money, and in his honor he established 139a prize of sixty thousand francs, to be awarded to any one who should make a discovery similar in value to Volta’s.[1] An American—Robert Fulton—was about the same time encouraged by the First Consul. Fulton was experimenting with his submarine torpedo and diving boat, and for four years had been living in Paris and besieging the Directory to grant him attention and funds. Napoleon took the matter up as soon as Fulton brought it to him, ordered a commission appointed to look into the invention, and a grant of ten thousand francs for the necessary experiments. The Institute was reorganized, and to encourage science and the arts he founded, in 1804, twenty-two prizes, nine of which were of ten thousand francs each, and thirteen of five thousand francs each. They were to be awarded every ten years by the emperor himself, on the 18th Brumaire. The first distribution of these prizes was to have taken place in 1809, but the judges could not agree on the laureates; and before a conclusion was reached, the empire had fallen. 140 BONAPARTE AS GENERAL, CONSUL, MEMBER OF THE INSTITUTE. These busts are in Sèvres biscuit. The first, which is much superior to the other two, is attributed to Boizot. The manufactory of Sèvres produced many such busts, especially in the consular period, and Bonaparte, anxious to see his face everywhere, encouraged the production and diffusion of them. I have before me an official document which shows that from the commencement of the year VI. to the end of the year IX. the factory produced more than four hundred busts and thirteen hundred medallions of Bonaparte.—A. D. 141In literature and in music, as in art and science, there was a renewal of activity. A circle of poets and writers gathered about the First Consul. Paisiello was summoned to Paris to direct the opera and conservatory of music. There was a revival of dignity and taste in strong contrast to the license and carelessness of the Revolution. The incroyable passed away. The Greek costume disappeared from the street. Men and women began again to dress, to act, to talk, according to conventional forms. Society recovered its systematic ways of doing things, and soon few signs of the general dissolution which had prevailed for ten years were to be seen. Once more the traveller crossed France in peace; peasant and laborer went undisturbed about their work, and slept without fear. Again the people danced in the fields and “sang their songs as they had in the days before the Revolution.” “France has nothing to ask from Heaven,” said Regnault de Saint Jean d’Angély, “but that the sun may continue to shine, the rain to fall on our fields, and the earth to render the seed fruitful.” 142 NAPOLEON IN 1803. Painted by A. Gérard in 1803. Engraved by Richomme in 1835. 1. The Volta prize has been awarded only three or four times. An award of particular interest to Americans was that made in 1880 to Dr. Alexander Graham Bell, the inventor of the telephone. The amount of the prize was a little less than ten thousand dollars. Dr. Bell, being already in affluent circumstances, upon receiving this prize, set it apart to be used for the benefit of the deaf, in whose welfare he had for many years taken a great interest. He invested it in another invention of his, which proved to be very profitable, so that the fund came to amount to one hundred thousand dollars. This he termed the Volta Fund. Some of this fund has been applied by Dr. Bell to the organization of the Volta Bureau, which collects all valuable information that can be obtained with reference to not only deaf-mutes as a class, but to deaf-mutes individually. Twenty-five thousand dollars has been given to the Association for the Promotion of Teaching Speech to the Deaf. Napoleon is thus indirectly the founder of one of the most interesting and valuable present undertakings of the country. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3074/84904.html","bookId":980,"book":{"id":980,"title":"A Life of Napoleon Bonaparte","description":"简介： The chief source of illustration for this volume, as in the case of the Napoleon papers in McClures Magazine, is the great collection of engravings of Mr. Gardiner G. Hubbard, which has been generously placed at the service of the publishers. In orde...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3074","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
