{"id":9477,"no":25,"title":"CHAPTER XXIII","content":"THE SECOND FUNERAL OF NAPOLEON—REMOVAL OF NAPOLEON’S REMAINS FROM ST. HELENA TO THE BANKS OF THE SEINE IN 1840 It is my wish that my ashes may repose on the banks of the Seine, in the midst of the French people, whom I have loved so well.—Testament of Napoleon, 2d Clause. He wants not this; but France shall feel the want Of this last consolation, thought so scant; Her honor, fame, and faith demand his bones, To rear above a pyramid of thrones; Or carried onward, in the battle’s van, To form, like Guesclin’s dust, her talisman. But be it as it is, the time may come, His name shall beat the alarm like Ziska’s drum. —Byron, in The Age of Bronze. On May 12, 1840, Louis Philippe being king of the French people, the Chamber of Deputies was busy with a discussion on sugar tariffs. It had been dragging somewhat, and the members were showing signs of restlessness. Suddenly the Count de Rémusat, then Minister of the Interior, appeared, and asked a hearing for a communication from the government. “Gentlemen,” he said, “the king has ordered his Royal Highness Monseigneur the Prince de Joinville[2] to go with his frigate to the island of St. Helena, there to collect the remains of the Emperor Napoleon.” A tremor ran over the House. The announcement was utterly unexpected. Napoleon to come back! The body seemed electrified, and the voice of the minister was drowned for a moment in applause. When he went on it was to say: 296 DEATH MASK OF NAPOLEON, MADE BY DR. ANTOMMARCHI AT ST. HELENA, 1821. Calamatta, 1834. Calamatta produced the mask from the cast taken by Dr. Antommarchi, the physician of Napoleon at St. Helena, in 1834, grouping around it portraits (chiefly from Ingres’s drawings) of Madame Dudevant and others. 297“We have come to ask for an appropriation which shall enable us to receive the remains in a fitting manner, and to raise an enduring tomb to Napoleon.” “Très bien! Très bien!” cried the House. “The government, anxious to discharge a great national duty, asked England for the precious treasure which fortune had put into her hands. “The thought of France was welcomed as soon as expressed. Listen to the reply of our magnanimous ally: “‘The government of her Majesty hopes that the promptness of her response will be considered in France as a proof of her desire to efface the last traces of those national animosities which armed France and England against each other in the life of the emperor. The government of her Majesty dares to hope that if such sentiments still exist in certain quarters, they will be buried in the tomb where the remains of Napoleon are to be deposited.’” The reading of this generous and dignified communication caused a profound sensation, and cries of “Bravo! bravo!” re-echoed through the hall. The minister, so well received, grew eloquent. “England is right, gentlemen; the noble way in which restitution has been made will knit the bonds which unite us. It will wipe out all traces of a sorrowful past. The time has come when the two nations should remember only their glory. The frigate freighted with the mortal remains of Napoleon will return to the mouth of the Seine. They will be placed in the Invalides. A solemn celebration and grand religious and military ceremonies will consecrate the tomb which must guard them forever. “It is important, gentlemen, that this august sepulchre should not remain exposed in a public place, in the midst of a noisy and inappreciative populace. It should be in a silent and sacred spot, where all those who honor glory and genius, grandeur and misfortune, can visit it and meditate. 298“He was emperor and king. He was the legitimate sovereign of our country. He is entitled to burial at Saint-Denis. But the ordinary royal sepulchre is not enough for Napoleon. He should reign and command forever in the spot where the country’s soldiers repose, and where those who are called to defend it will seek their inspiration. His sword will be placed on his tomb. “Art will raise beneath the dome of the temple consecrated to the god of battles a tomb worthy, if that be possible, of the name which shall be engraved upon it. This monument must have a simple beauty, grand outlines, and that appearance of eternal strength which defies the action of time. Napoleon must have a monument lasting as his memory.... “Hereafter France and France alone, will possess all that remains of Napoleon. His tomb, like his fame, will belong to no one but his country. The monarchy of 1830 is the only and the legitimate heir of the past of which France is so proud. It is the duty of this monarchy, which was the first to rally all the forces and to conciliate all the aspirations of the French Revolution, fearlessly to raise and honor the statue and the tomb of the popular hero. There is one thing, one only, which does not fear comparison with glory—that is liberty.” Throughout this speech, every word of which was an astonishment to the Chamber, sincere and deep emotion prevailed. At intervals enthusiastic applause burst forth. For a moment all party distinctions were forgotten. The whole House was under the sway of that strange and powerful emotion which Napoleon, as no other leader who ever lived, was able to inspire. When the minister followed his speech by the draft of a law for a special credit of one million francs, a member, beside himself with excitement, moved that rules be laid 299aside and the law voted without the legal preliminaries. The president refused to put so irregular a motion, but the House would not be quiet. The deputies left their places, formed in groups in the hemicycle, surrounded the minister, congratulating him with fervor. They walked up and down, gesticulating and shouting. It was fully half an hour before the president was able to bring them to order, and then they were in anything but a working mood. “The president must close this session,” cried an agitated member; “the law which has just been proposed has caused too great emotion for us to return now to discussing sugar.” But the president replied very properly, and a little sententiously, that the Chamber owed its time to the country’s business, and that it must give it. And, in spite of their excitement, the members had to go back to their sugar. But how had it come about that the French government had dared burst upon the country with so astounding a communication. There were many explanations offered. A curious story which went abroad took the credit from the king and gave it to O’Connell, the Irish agitator. As the story went, O’Connell had warned Lord Palmerston that he proposed to present a bill in the Commons for returning Napoleon’s remains to France. “Take care,” said Lord Palmerston. “Instead of pleasing the French government, you may embarrass it seriously.” “That is not the question,” answered O’Connell. “The question for me is what I ought to do. Now, my duty is to propose to the Commons to return the emperor’s bones. England’s duty is to welcome the motion. I shall make my propositions, then, without disturbing myself about whom they will flatter or wound.” “So be it,” said Lord Palmerston. “Only give me fifteen days.” 300“Very well,” answered O’Connell. Immediately Lord Palmerston wrote to Monsieur Thiers, then at the head of the French Ministry, that he was about to be forced to tell the country that England had never refused to return the remains of Napoleon to France, because France had never asked that they be returned. As the story goes, Monsieur Thiers advised Louis Philippe to forestall O’Connell, and thus it came about that Napoleon’s remains were returned to France. The grande pensée, as the idea was immediately called, seems, however, to have originated with Monsieur Thiers, who saw in it a means of reawakening interest in Louis Philippe. He believed that the very audacity of the act would create admiration and applause. Then, too, it was in harmony with the claim of the régime; that is, that the government of 1830 united all that was best in all the past governments of France, and so was stronger than any one of them. The mania of both king and minister for collecting and restoring made them think favorably of the idea. Already Louis Philippe had inaugurated galleries at Versailles, and hung them with miles of canvas, celebrating the victories of all his predecessors. In the gallery of portraits he had placed Marie Antoinette and Louis XVI. beside Madame Roland, Charlotte Corday, Robespierre, and Napoleon and his marshals. He had already replaced the statue of Napoleon on the top of the Column Vend?me. He had restored cathedrals, churches, and chateaux, put up statues and monuments, and all this he had done with studied indifference to the politics of the individuals honored. Yet while so many little important personages were being exalted, the remains of the greatest leader France had ever known, were lying in a far away island. Louis Philippe 301felt that no monument he could build to the heroes of the past would equal restoring Napoleon’s remains. The matter was simpler, because it was almost certain that England would not block the path. The entente cordiale, whose base had been laid by Talleyrand nearly ten years earlier, had become a comparatively solid peace, and either nation was willing to go out of the way, if necessary, to do the other a neighborly kindness. France was so full of good will that she was even willing to ask a favor. Her confidence was well placed. Two days after Guizot, then the French minister to England, had explained the project to Lord Palmerston, and made his request, he had his reply. The remains of the “emperor” were at the disposition of the French. Of the “emperor,” notice! After twenty-five years England recalled the act of her ministers in 1815, and recognized that France made Napoleon emperor as well as general. The announcement that Napoleon’s remains were to be brought back, produced the same effect upon the country at large that it had upon the Chamber—a moment of acute emotion, of all-forgetting enthusiasm. But in the Chamber and the country the feeling was short-lived. The political aspects of the bold movement were too conspicuous. A chorus of criticisms and forebodings arose. It was more of Monsieur Thiers’ clap-trap, said those opposed to the English policy of the government. What particularly angered this party, was the words “magnanimous ally” in the minister’s address. The Bonapartes feigned to despise the proposed ceremony. It was insufficient for the greatness of their hero. One million francs could not possibly produce the display the object demanded. Another point of theirs was more serious. The emperor was the legitimate sovereign of the 302country, they said, quoting from the minister’s speech to the Chamber, and they added: “His title was founded on the senatus consultum of the year 12, which, by an equal number of suffrages, secured the succession to his brother Joseph. It was then unquestionably Joseph Bonaparte who was proclaimed emperor of the French by the Minister of the Interior, and amid the applause of the deputies.” Scoffers said that Louis Philippe must have discovered that his soft mantle of popularity was about worn out, if he was going to make one of the old gray redingote of a man whom he had called a monster. The Legitimists denied that Napoleon was a legitimate sovereign with a right to sleep at Saint-Denis like a Bourbon or a Valois. The Orleanists were wounded by the hopes they saw inspired in the Bonapartists by this declaration. The Republicans resented the honor done to the man whom they held up as the greatest of all despots. There was a conviction among many that the restoration was premature, and probably would bring on the country an agitation which would endanger the stability of the throne. It was tempting the Bonaparte pretensions certainly, and perhaps arousing a tremendous popular sentiment to support them. While the press and government, the clubs and cafés, discussed the political side of the question, the populace quietly revived the Napoleon legend. Within two days after the government had announced its intentions, commerce had begun to take advantage of the financial possibilities in the approaching ceremony. New editions of the “Lives” of Napoleon which Vernet and Raffet had illustrated, were advertised. Dumas’ “Life” and Thiers’ “Consulate and Empire” were announced. Memoirs of the period, like those of the Duchesse d’Abrantès and of Marmont, were revived. 303As on the announcement of Napoleon’s death in 1821, there was an inundation of pamphlets in verse and prose; of portraits and war compositions, lithographs, engravings, and wood-cuts; of thousands of little objects such as the French know so well how to make. The shops and street carts were heaped with every conceivable article à la Napoléon. The legend grew as the people gazed. On July 7th the “Belle Poule,” the vessel which was to conduct the Prince de Joinville, the commander of the expedition, to St. Helena, sailed from Toulon accompanied by the “Favorite.” In the suite of the Prince were several old friends of Napoleon: the Baron las Cases, General Gourgaud, Count Bertrand, and four of his former servants. All these persons had been with him at St. Helena. The Prince de Joinville had not received his orders to go on the expedition with great pleasure. Two of his brothers had just been sent to Africa to fight, and he envied them their opportunities for adventures and glory; and, besides, he was sick of a most plebeian complaint, the measles. “One day as I lay in high fever,” he says in his “Memoirs,” “I saw my father appear, followed by Monsieur de Rémusat, then Minister of the Interior. This unusual visit filled me with astonishment, and my surprise increased when my father said, ‘Joinville, you are to go out to St. Helena and bring back Napoleon’s coffin.’ If I had not been in bed already I should have fallen down flat, and at first blush I felt no wise flattered when I compared the warlike campaign my brothers were on with the undertaker’s job I was being sent to perform in the other hemisphere. But I served my country, and I had no right to discuss my orders.” If the young prince was privately a little ashamed of his task, publicly he adapted himself admirably to the occasion. 304 NAPOLEON’S TOMB AT ST. HELENA. From a recent photograph. 305A voyage of sixty-six days brought the “Belle Poule,” on October 8th, to St. Helena, where she was welcomed by the English with every honor. Indeed, throughout the affair the attitude of the English was dignified and generous. They showed plainly their desire to satisfy and flatter the pride and sentiment of the French. It had been decided that the exhumation of the body and its transfer to the French should take place on the twenty-fifth anniversary of the arrival of Napoleon at the island. The disinterment was begun at midnight on October 15th, the English conducting the work, and a number of the French, including those of the party who had been with Napoleon at his death, being present. The work was one of extraordinary difficulty, for the same remarkable precautions against escape were taken in Napoleon’s death as had been in his life. The grave in the Valley of Napoleon, as the place had come to be called, was surrounded by an iron railing set in a heavy stone curb. Over the grave was a covering of six-inch stone which admitted to a vault eleven feet deep, eight feet long, and four feet eight inches broad. The vault was apparently filled with earth, but digging down some seven feet a layer of Roman cement was found; this broken, laid bare a layer of rough-hewn stone ten inches thick, and fastened together by iron clamps. It took four and one-half hours to remove this layer. The stone up, the slab forming the lid of the interior sarcophagus was exposed, enclosed in a border of Roman cement strongly attached to the walls of the vault. So stoutly had all these various coverings been sealed with cement and bound by iron bands, that it took the large party of laborers ten hours to reach the coffin. As soon as exposed the coffin was purified, sprinkled with holy water, consecrated by a De Profundis, and then raised 306with the greatest care, and carried into a tent which had been prepared for it. After the religious ceremonies, the inner coffins were opened. “The outermost coffin was slightly injured,” says an eye witness; “then came one of lead, which was in good condition, and enclosed two others—one of tin and one of wood. The last coffin was lined inside with white satin, which, having become detached by the effect of time, had fallen upon the body and enveloped it like a winding-sheet, and had become slightly attached to it. “It is difficult to describe with what anxiety and emotion those who were present waited for the moment which was to expose to them all that was left of the Emperor Napoleon. Notwithstanding the singular state of preservation of the tomb and coffins, we could scarcely hope to find anything but some misshapen remains of the least perishable part of the costume to evidence the identity of the body. But when Dr. Guillard raised the sheet of satin, an indescribable feeling of surprise and affection was experienced by the spectators, many of whom burst into tears. The emperor himself was before their eyes! The features of the face, though changed, were perfectly recognizable; the hands extremely beautiful; his well known costume had suffered but little, and the colors were easily distinguished. The attitude itself was full of ease, and but for the fragments of satin lining which covered, as with fine gauze, several parts of the uniform, we might have believed we still saw Napoleon lying on his bed of state.” A solemn procession was now formed, and the coffin borne over the rugged hills of St. Helena to the quay. “We were all deeply impressed,” says the Prince de Joinville, “when the coffin was seen coming slowly down the mountain side to the firing of cannon, escorted by British infantry with arms reversed, the band playing, to the dull rolling 307accompaniment of the drums, that splendid funeral march which English people call the Dead March in Saul.” At the head of the quay, the Prince de Joinville, attended by the officers of the French vessels, was waiting to receive the remains of the emperor. In the midst of the most solemn military funeral rites the French embarked with their precious charge. “The scene at that moment was very fine,” continues the prince. “A magnificent sunset had been succeeded by a twilight of the deepest calm. The British authorities and the troops stood motionless on the beach, while our ship’s guns fired a royal salute. I stood in the stern of my long-boat, over which floated a magnificent tricolor flag, worked by the ladies of St. Helena. Beside me were the generals and superior officers. The pick of my topmen, all in white, with crape on their arms, and bareheaded like ourselves, rowed the boat in silence, and with the most admirable precision. We advanced with majestic slowness, escorted by the boats bearing the staff. It was very touching, and a deep national sentiment seemed to hover over the whole scene.” But no sooner did the coffin reach the French cutter than mourning was changed to triumph. Flags were unfurled, masts squared, drums set a-beating, and salvos poured from ports and vessels. The emperor had come back to his own! Three days later the “Belle Poule” was en route for France. One incident alone marked her return. A passing vessel brought the news that war had been declared between France and England. The Prince de Joinville was only twenty-two, a hot-headed youth, and the news of war immediately convinced him that England had her fleet out watching for him, ready to carry off Napoleon again. He rose to the height of his fears. The elegant furnishings of the saloons of his vessel were torn out and thrown overboard 308to make room for the batteries; the men were made ready for fighting, and everybody on board was compelled to take an oath to sink the vessel before allowing the remains to be taken. This done, the “Belle Poule” went her way peacefully to Cherbourg, where she arrived on November 30th, forty-three days after leaving St. Helena. The town of Cherbourg owes much to Napoleon—her splendid harbors, and great tracts of land rescued from the sea—and she honored the return of his remains with every pomp. Even the poor of the town were made to rejoice by lavish gifts in the emperor’s honor; and one of the chief squares—one he had redeemed from the sea—became the Place Napoleon. The vessels lay eight days at Cherbourg, for the arrival had been a fortnight earlier than was anticipated, and nothing was ready for the celebration at Paris; but the time was none too long for the thousands who flocked in interminable processions to the vessels. When the vessels left for Havre, Cherbourg was so excited that she did what must have seemed to the nervous inhabitants an extravagance, even in Napoleon’s honor, she fired a thousand guns! The passage of the flotilla from Cherbourg to Paris took seven days. At almost every town and hamlet elaborate demonstrations were made. At Havre and Rouen they were especially magnificent. A striking feature of the river cortége was the ceremonies at the various bridges under which the vessels passed. The most elaborate of these was at Rouen, where the central arch of the suspension bridge had been formed into an immense arch of triumph. The decorations were the exclusive work of wounded legionary officers and soldiers of the Empire. When the vessel bearing the coffin passed under, the veterans showered down upon it wreaths of flowers and branches of laurel. 309These elaborate and grandiose ceremonies were not, however, the really touching feature of the passage. The hill-sides and river-banks were crowded with people from all the surrounding country, who sometimes even pressed into the river in order better to see the vessels. Those on the flotilla saw aged peasants firing salutes with ancient muskets, old men kneeling with uncovered heads on the sod, and others, their heads in their hands weeping—these men were veterans of the Empire paying homage to the passage of their hero. It was on the afternoon of December 14th, just as the sun was setting radiantly behind Mt. Valerian, that the flotilla reached Courbevoie, a few miles from Paris, where Napoleon’s body was first to touch French soil. The bridge at Courbevoie, the islands of Neuilly, the hills which rise from the Seine, were crowded, far as the eye could reach, with a throng drawn from the entire country around. The flotilla as it approached was a brilliant sight. At the head was the “Dorade,” a cross at her prow, and, behind, the coffin. It was draped in purple velvet, surrounded by flags and garlands of oak and cypress, and surmounted by a canopy of black velvet ornamented with silver and masses of floating black plumes. Between cross and coffin stood the Prince de Joinville in full uniform, and behind him Generals Bertrand and Gourgaud and the Abbé Coquereau, almoner of the expedition. The vessels following the “Dorade” bore the crews of the “Belle Poule” and the “Favorite” and the military bands. A magnificent funeral boat, on whose deck there was a temple of bronzed wood, hung with splendid draperies of purple and gold, brought up the official procession. Behind followed numberless craft of all descriptions. Majestic funeral marches and salvos of artillery accompanied the advance. 310 THE FUNERAL PROCESSION IN PARIS. FUNERAL CAR PASSING DOWN THE CHAMPS ELYSéES. 311At Courbevoie the flotilla anchored. Notwithstanding the intense cold, thousands of people camped all night on the hill-sides and shores, their bivouac fires illuminating the landscape. Only those who have seen Paris on the day of a great fête or ceremony can picture to themselves the 15th of December, 1840. The day was intensely cold, eight degrees below the freezing point, but at five o’clock in the morning, when the drums began beating, and the guns booming, the populace poured forth, taking up their positions along the line of the expected procession. This line was fully three miles in length, and ran from Courbevoie to the Arc de Triomphe by way of Neuilly, thence down the Champs Elysées, across the Place and Bridge de la Concorde, and along the quai to the Esplanade des Invalides. From one end to the other it was packed on either side a hundred deep, before nine o’clock. The journals of the day compute the number of visitors expected in Paris as about half a million. Inside and outside of the H?tel des Invalides alone, thirty-six thousand places were given to the Minister of the Interior, and that did not cover one-tenth of the requests he received. It is certain that nearly a million persons saw the entry of Napoleon’s remains. The people hung from the trees, crowded the roofs, stood on ladders of every description, filled the windows, and literally swarmed over the walks and grass plots. A brisk business went on in elevated positions. A ladder rung cost five francs ($1.00); the man who had a cart across which he had laid boards, rented standing-room at from five to ten francs. As for windows and balconies—they sold for fabulous prices, in spite of the fact that the placard fenêtrés et balcons à louer appeared in almost every house from Neuilly to the Invalides, even in many a magnificent hotel of the Champs Elysées. Fifty francs ($10.00) was the price of the meanest window; a good one cost one hundred francs ($20.00); three thousand francs ($600.00) 312were paid for good balconies. One speculator rented a vacant house for the day for five thousand francs ($1,000.00), and made money on his investment. The crowd made every preparation to keep warm; some of them carried foot-stoves filled with live coals, others little hand-warmers. At intervals along the procession great masses of the spectators danced to keep up their circulation. Vendors of all sorts of articles did a thriving business. Every article was, of course, Napoleonized; one even bought gauffrettes and Madeleines cut out in the shape of Napoleons. There were badges of every form—imperial eagles, bees, crowns, even the petit chapeau. Many pamphlets in prose and verse had a great sale, especially those of Casimir Delavigne, Victor Hugo, and Barthélemy; though all these stately odes were far outstripped by one song, thousands upon thousands of copies of which were sold. It ran: “Premier capitaine du monde Depuis le siége de Toulon, Tant sur la terre que sur l’onde Tout redoutait Napoleon. “Du Nil au nord de la Tamise! Devant lui l’ennemi fuyait, Avant de combattre, il tremblait Voyant sa redingote grise.” The cortége which had brought this crowd together was magnificent in the extreme. A brilliant military display formed the first portion: gendarmerie, municipal guards, officers, infantry, cavalry, artillery, cadets from the important schools, national guards. But this had little effect on the crowd. The genuine interest began when Marengo, Napoleon’s famous battle-horse appeared—it was not Marengo, but it looked like him, which for spectacular purposes was just as well; and the saddle and bridle were genuine. The defile now became exciting. The commission of St. 313Helena appeared in carriages, then the Marshals of France, the Prince de Joinville, the crews of the vessels which had been to St. Helena, finally the funeral car, a magnificent creation over thirty feet high, its design and ornaments symbolic. Sixteen black horses in splendid trappings drew the car, whose funeral pall was held by a marshal and an admiral of France, by the Duc de Reggio and General Bertrand. The passing of the car was everywhere greeted with sincere emotion, profound reverence. Even the opposition recognized the genuineness of the feeling; many of them owned to sharing it for one moment of self-forgetfulness, and they began to ask themselves, as Lamartine had asked the Chamber six months before, what they had been thinking of to allow the French heart and imagination to be so fired? Even cynical Englishmen who looked on with stern or contemptuous countenances, said to themselves meditatively that night, as they sat by their fire resting, “Something good must have been in this man, something loving and kindly, that has kept his name so cherished in the popular memory and gained him such lasting reverence and affection.” Following the car came those who had been intimately associated with the emperor in his life—his aides-de-camp and civil and military officers. Many of them had been with him in famous battles; some were at Fontainebleau in 1814, others at Malmaison in 1815. The veterans of the Imperial Guard followed; behind them a deputation from Ajaccio. From Courbevoie to the H?tel des Invalides, one walked through a hedge of elaborate decorations—of bees, eagles, crowns, N’s; of bucklers, banners, and wreaths bearing the names of famous victories; of urns blazing with incense; of rostral columns; masts bearing trophies of arms and clusters of flags; flaming tripods; allegorical statues; triumphal arches; great banks of seats draped in imperial 314purple and packed with spectators, and phalanges of soldiers. On the top of the Arc de Triomphe was an imposing apotheosis of Napoleon. Each side of the Pont de la Concorde was adorned with huge statues. On the Esplanade des Invalides the car passed between an avenue of thirty-two statues of great French kings, heroes, and heroines—Charles Martel, Charlemagne, Clovis, Bayard, Jeanne d’Arc, Latour d’Auvergne, Ney. The chivalry and valor of France welcomed Napoleon home. Oddly enough, this hedge of statues ended in one of Napoleon himself; the incongruity of the arrangements struck even the gamins. “Tiens,” cried one urchin, “voilà comme l’empereur fait la queue à lui-mème.” (“Hello, see there how the emperor brings up his own procession.”) The procession passed quietly from one end to the other of the route, to the great relief of the authorities. Difficulty was anticipated from several sources: from the Anglophobes, the Revolutionists, the Legitimists, the Bonapartists, and the great mass of dissatisfied, who, no matter what form of rule they are under, are always against the government. The greatest fear seems to have been on the part of the English. Thackeray, who was in town at the time, gives an amusing picture of his own nervousness on the morning of the 15th. “Did the French nation, or did they not, intend to offer up some of us English over the imperial grave? And were the games to be concluded by a massacre? It was said in the newspapers that Lord Granville had despatched circulars to all the English residents in Paris, begging them to keep their homes. The French journals announced this news, and warned us charitably of the fate intended for us. Had Lord Granville written? Certainly not to me. Or had he written to all except me? And was I the victim—the doomed one?—to be seized directly I showed my face in the Champs Elysées, and torn in pieces by French patriotism to the frantic chorus of the 315Marseillaise? Depend on it, Madame, that high and low in this city on Tuesday were not altogether at their ease, and that the bravest felt no small tremor. And be sure of this, that as his Majesty Louis Philippe took his nightcap off his royal head that morning, he prayed heartily that he might at night put it on in safety.” Fortunately Thackeray’s courage conquered, and so we have the entertaining “Second Funeral of Napoleon,” by “Michael Angelo Titmarsh.” In spite of all forebodings, the hostile displays were nothing more than occasional cries of “A bas les Anglais,” a few attempts to promenade the tricolor flag and drown Le Premier Capitaine du Monde by the Marseillaise, and a strong indignation when it was learned that the representatives of the allies had refused to be present at the final ceremony. Most of the observers of the funeral attributed the good order of the crowd to the cold. A correspondent of the “National Intelligence” of that date says: “If this business had fallen in the month of June or July, with all its excitements, spontaneous and elaborate, I should have deemed a sanguinary struggle between the government and the mob certain or highly probable. The present military array might answer for an approaching army of Cossacks. Forty or fifty thousand troops remain in the barracks within and camps without, besides the regular soldiery and National Guards in the field, ready to act against the domestic enemy. “Providentially the cold increased to the utmost keenness; the genial currents of the insurrectionary and revolutionary soul were frozen.” The climax of the pageant was in the temple of the Invalides. The spacious church was draped in the most magnificent and lavish fashion, and adorned with a perfect bewilderment of imperial emblems. The light was shut out by hangings of violet velvet; tripods blazing with colored flames, and thousands upon thousands of waxen candles in brilliant candelabra lighted the temple. Under the dome, in the place of the altar, stood the catafalque which was to receive the coffin. 316 THE FUNERAL MASS IN THE CHURCH OF THE HOTEL DES INVALIDES. THE CATAFALQUE ON WHICH THE COFFIN RESTS IS SEEN IN THE DISTANCE. 317From early in the morning the galleries, choir, and tribunes of the Invalides were packed by a distinguished company. There were the Deputies and Senators—neither of which had been represented in the cortége—the judicial and educational bodies, the officers of army and navy, the ambassadors and representatives of foreign governments, the king, and the court. But none of these dignitaries were of more than passing interest that day. The centre of attention, until the coffin entered, was the few old soldiers of the Empire to be seen in the company; most prominent of these was Marshal Moncey, the decrepit governor of the Invalides. It was two o’clock in the afternoon when the Archbishop of Paris, preceded by a splendid cross-bearer, and followed by sixteen incense boys and long rows of white-clad priests, left the church to meet the procession. They returned soon. Following them were the Prince de Joinville and a select few from the grand cortége without, attending Napoleon’s coffin. As it passed, the great assemblage was swayed by an extraordinary emotion. There is no one of those who have described the day who does not speak of the sudden, intense agitation which thrilled the company, whether he refers to it half-humorously as Thackeray, who told how “everybody’s heart was thumping as hard as possible,” or cries with Victor Hugo: “Sire: En ce moment-là, vouz aurez pour royaume. Tous les fronts, tous les c?urs qui battront sous le ciel, Les nations feront asseoir votre fant?me, Au trone universel.” The king descended from his throne and advanced to meet the cortége. “Sire,” said the Prince de Joinville, “I 318present to you the body of Napoleon, which, in accordance with your commands, I have brought back to France.” “I receive it in the name of France,” replied Louis Philippe. Such at least is what the “Moniteur” affirms was said, but the “Moniteur” is an official journal whose business is, not to tell what really happens, but what the government would prefer to have happen. The Prince de Joinville gives a different version: “The king received the body at the entrance to the nave, and there rather a comical scene took place. It appears that a little speech which I was to have delivered when I met my father, and also the answer he was to give me, had been drawn up in council, only the authorities had omitted to inform me concerning it. So when I arrived I simply saluted with my sword, and then stood aside. I saw, indeed, that this silent salute, followed by retreat, had thrown something out; but my father after a moment’s hesitation, improvised some appropriate sentence, and the matter was arranged in the ‘Moniteur.’” Beside the king stood an officer, bearing a cushion; on it lay the sword of Austerlitz. Marshal Soult handed it to the king, who, turning to Bertrand, said: “General, I commission you to place the emperor’s glorious sword on the bier.” And Bertrand, trembling with emotion, laid the sword reverently on his idol’s coffin. The great company watched the scene in deepest silence. The only sound which broke the stillness was the half-stifled sobs of the gray-haired soldiers of the Invalides, who stood in places of honor near the catafalque. The king and the procession returned to their places, and then followed a majestic funeral mass. The Requiem of Mozart, as rendered that day by all the great singers of Paris, is one of the historic musical performances of France. 319The archbishop then sprinkled the coffin with holy water, the king taking the brush from him for the same sacred duty. The funeral was over. Napoleon lay at last “on the banks of the Seine, among the people whom he had so loved.” For eight days after the ceremony the church remained open to the public, and in spite of the terrible cold thousands stood from morning until night waiting patiently their turn to enter. After hours of waiting, they frequently were sent away, only to come back earlier the next day. In this company were numbers of veterans of the imperial army who had made the journey to Paris from distant parts of the kingdom. In the delegation from Belgium were many who had walked part of the way, not being able to pay full coach fare. Banquets and dinners followed the funeral. At one of these, a “sacred toast to the immortal memory” was drunk kneeling. In a dozen theatres of Paris the translation of the remains was dramatized. At the Porte Saint-Martin, the actor who took the part of Sir Hudson Lowe had a season of terror, he being in constant danger of violence from the wrought-up audience. The advertising columns of the newspapers of the day blazed for weeks with announcements of Napoleonized articles; the holiday gifts prepared for the booths of the boulevards and squares, and for the magnificent shops of the Palais Royal and the fashionable streets, whatever their nature—to eat, to wear, to look at—were made up as memorials. Paris seemed to be Napoleon-mad. In the February following the funeral, the coffin of Napoleon was transferred from the catafalque in the centre of the church to a chapelle ardente in the basement at one side. The chapel was richly draped in silk and gold, and hung with trophies. On the coffin lay the imperial crown, 320the emperor’s sword, and the hat which he had worn at Eylau, and which he had given to Gros when he ordered the battle of Eylau painted. Over the coffin waved the flags taken at Austerlitz. Here Napoleon’s body lay until the mausoleum was finished. This magnificent structure was designed by Visconti, the eminent architect, who had planned the entire decorations of the 15th of December. Visconti utterly ignored the appropriations in executing the monument, ordering what he wanted, regardless of its cost. For the marble from which Pradier made the twelve colossal figures around the tomb, he sent to Carrara; the porphyry which was used to inclose the coffin, he obtained in Finland. In this magnificent sepulchre Napoleon still sleeps. Duroc and Bertrand lie on either side of the entrance to the chamber, guarding him in death as in life; and to the right and left of the entrance to the church are the tombs of his brothers Jerome and Joseph. On the stones about him are inscribed the names he made glorious! over him are draped scores of trophies; attending him are the veterans of the Invalides. “Qu’il dorme en paix sous cette voute! C’est un casque bien fait, sans doute, Pour cette tête de géant.” 2. The Prince of Joinville was the third son of Louis Philippe. 322 JOSEPHINE, EMPRESS OF THE FRENCH. Reproduction of the model of the marble statue exhibited in the Salon of 1857, and executed for the town of St. Pierre (Martinique), the native country of Josephine. This statue as by the sculptor Vital-Dubray. The plaster cast is in the Versailles museum. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3074/84918.html","bookId":980,"book":{"id":980,"title":"A Life of Napoleon Bonaparte","description":"简介： The chief source of illustration for this volume, as in the case of the Napoleon papers in McClures Magazine, is the great collection of engravings of Mr. Gardiner G. Hubbard, which has been generously placed at the service of the publishers. In orde...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3074","creation":"Aug 1, 2019 12:24:05 AM","modification":"Aug 1, 2019 12:24:05 AM"}}
