{"id":64245,"no":13,"title":"Page 13","content":"\"You sound a little blue.\" \"Do I? I think it\u0027s just that I\u0027m running out of gas. The trial was keeping me going. Now that it\u0027s over I feel like a puppet with the strings cut.\" \"You just need some rest.\" \"I hope you\u0027re right. I have this superstitious sense that the trial was holding Will at bay, that he couldn\u0027t take me out as long as I had work that had to be done. Now all of a sudden I\u0027ve got a bad feeling about the whole situation that I never had before.\" \"You just didn\u0027t allow yourself to feel it before.\" \"Maybe. And maybe I\u0027ll feel better after a good night\u0027s sleep. I know goddam well I\u0027ll feel better after a drink.\" \"Most people do,\" I said. \"That\u0027s why they put the stuff in bottles.\" \"Well, I\u0027m going to uncap the bottle and let the genie out. It\u0027ll be the first one today. If you were here I\u0027d pour you a club soda.\" \"I\u0027ll have one here,\" I said, \"and think of you.\" \"Have a Coke. Make it a real celebration.\" \"I\u0027ll do that.\" There was a pause, and then he said, \"I wish I knew you better.\" \"Oh?\" \"I wish there were more time. Forget I said that, all right? I\u0027m too tired to make sense. Maybe I\u0027ll skip that drink and just go to bed.\" But he didn\u0027t skip the drink. Instead he went into the front room, where one of his bodyguards was posted. \"I\u0027m going to have a drink,\" he announced. \"I don\u0027t suppose I can talk you into joining me.\" They\u0027d gone through this ritual before. \"Mean my job if I did, Mr. Whitfield.\" \"I wouldn\u0027t tell anybody,\" Whitfield said. \"On the other hand, I want you razor-sharp if our boy Will comes through that door, so I shouldn\u0027t be pushing drinks at you. How about a soft drink? Or some coffee?\" \"I got a pot brewing in the kitchen. I\u0027ll have some after you turn in. Don\u0027t worry about me, Mr. Whitfield. I\u0027ll be fine.\" Whitfield took a glass from on top of the bar, went into the kitchen for ice cubes, came back and uncapped the bottle of scotch. He filled the glass and put the cap on the bottle. \"Your name\u0027s Kevin,\" he said to the bodyguard, \"and I must have heard your last name, but I don\u0027t seem to remember it.\" \"Kevin Dahlgren, sir.\" \"Now I remember. Do you like your work, Kevin?\" \"It\u0027s a good job.\" \"You don\u0027t find it boring?\" \"Boring\u0027s just fine with me, sir. If something happens I\u0027m ready, but if nothing happens I\u0027m happy.\" \"That\u0027s a healthy attitude,\" Whitfield told him. \"You probably wouldn\u0027t have minded starting Tony Furillo\u0027s car.\" \"Sir?\" \"Never mind. I ought to drink this, wouldn\u0027t you say? I poured it, I ought to drink it. Isn\u0027t that how it works?\" \"Up to you, Mr. Whitfield.\" \"Up to me,\" Whitfield said. \"You\u0027re absolutely right.\" He raised the glass in a wordless toast, then took a long drink. Dahlgren\u0027s eyes went to the bookcase. He was a reader, and there was a lot to read in this apartment. It was no hardship, sitting in a comfortable chair with a good book for eight hours, helping yourself to coffee when you wanted it. It was nice to get paid for something you\u0027d do on your own time. That\u0027s what he was thinking when he heard the man he was guarding make a sharp sound, a sort of strangled gasp. He turned at the sound and watched Adrian Whitfield clutch his chest and pitch forward onto the carpet. 7 \"It\u0027s like he saw it coming,\" Kevin Dahlgren said. He was a tall, broad-shouldered man in his early thirties, his light brown hair cropped close to his broad skull, his light brown eyes alert behind his eyeglasses. He looked at once capable and thoughtful, as if he might be a studious thug. \"I was the last person to talk to him,\" I said. \"Except for yourself, of course.\" \"Right.\" \"He was tired, and I think that soured his outlook. But maybe he had a premonition, or just some sense that he\u0027d reached the end of the line.\" \"He offered me a drink. Not that I even considered taking it. On the job, and a bodyguard job at that? They\u0027d drop me like a hot rock if I ever did anything like that, and they\u0027d be right to do it. I wasn\u0027t even tempted, but now I\u0027m picturing what would have happened if I said yes. We clink glasses, we drink up, and boom! We hit the deck together. Or maybe I\u0027d have been the first to take a drink, because he was sort of stalling. So I\u0027d be dead and he\u0027d be here talking to you.\" \"But that\u0027s not how it happened.\" \"No.\" \"When you met him and entered the apartment…\" \"You want me to go over that? Sure thing. My shift started at ten P.M., and I reported to the Park Avenue residence, where I met up with Samuel Mettnick, who was sharing the ten-to-six shift with me. We stationed ourselves downstairs in the lobby. The two fellows on the previous shift brought Mr. Whitfield home in the limo and turned him over to us at ten-ten. Sam Mettnick and I rode upstairs with Mr. Whitfield, observing the usual security procedures as far as entering and exiting the elevator, and so forth.\" \"Who opened the door of the apartment?\" \"I did, and went in first. There was a whistle indicating the burglar alarm was set, so I went to the keypad and keyed in the response code. Then I checked all the rooms to make sure the place was empty. Then I returned to the front room and Sam went downstairs and I locked the door and made sure it was secure. Then Mr. Whitfield went off through his bedroom to use the bathroom, and I guess stopped in his bedroom and used the phone before returning to the front room. And you know the rest.\" \"You\u0027d been in the apartment before.\" \"Yes, sir, for several nights running. From ten o\u0027clock on.\" \"And you didn\u0027t notice anything out of place when you entered.\" \"There were no signs of intrusion. Anything like that and I\u0027d have grabbed Mr. Whitfield and got him the hell out of there. As for anything out of place, all I can say is everything looked normal to me, same as on previous nights. The thing is, I\u0027d been relieved at six that morning, so my counterpart on the six A.M.-to-two P.M. shift would have been the last person in there. Whether anything had been moved around since he and Mr. Whitfield left to go to court, that\u0027s something I couldn\u0027t say.\" \"But there was nothing about the appearance of the room that drew a comment from Whitfield.\" \"You mean like, \u0027What\u0027s this bottle doing over here?\u0027 No, nothing like that. Though to tell you the truth I\u0027m not sure he would have noticed. You know the mood he was in.\" \"Yes.\" \"He seemed abstracted, if that\u0027s the word I want. Sort of out of sync. Right before he took the drink-\" He snapped his fingers. \"I know what it reminded me of.\" \"What\u0027s that, Kevin?\" \"It\u0027s a scene in a movie I saw, but don\u0027t ask me the name of it. This one character\u0027s an alcoholic and he hasn\u0027t had a drink in, I don\u0027t know, months or years, anyway a long time. And he pours one and looks at it and drinks it.\" \"And that\u0027s how Whitfield looked at his drink.\" \"Kind of.\" \"But he had a glass of scotch every night, didn\u0027t he?\" \"I guess so. I wasn\u0027t always there to see him have it. Some nights he was already home when my shift started, so I would just come up and relieve the man from the earlier shift. Other times he\u0027d already had his drink before I got him. As far as being an alcoholic, I\u0027d say he was anything but. I never saw him take more than one drink a night.\" \"When I talked to him,\" I said, \"he said he was about to have his first drink of the day.\" \"I think he said as much to me. I wasn\u0027t with him earlier, but I can testify he didn\u0027t have it on his breath.\" \"Would you have noticed it if he had?\" \"I think so, yes. I was standing right next to him in the elevator, and I\u0027ve got a pretty good sense of smell. I can tell you he had Italian food for dinner. Plus I hadn\u0027t had anything to drink all that day, and when you\u0027re not drinking yourself it makes you much more aware of the smell of alcohol on somebody else.\" \"That\u0027s true.\" \"It\u0027s the same thing with cigarettes. I used to smoke, and all those years I never smelled smoke on anybody, me or anybody else. I quit four years ago, and now I can just about smell a heavy smoker from the opposite side of an airport. That\u0027s stretching it, but you know what I mean.\" \"Sure.\" \"So I guess it was his first drink of the night. Jesus.\" \"What, Kevin?\" \"Well, it\u0027s not funny, but I was just thinking. One thing for sure, it was his last.\" I didn\u0027t have to take Kevin Dahlgren\u0027s word about the acuity of his sense of smell. He\u0027d proved it shortly after Adrian Whitfield collapsed. Dahlgren\u0027s immediate assumption had been that he was in the presence of a man having a heart attack, and he reacted as he\u0027d been trained to react and began performing CPR. At the onset of the procedure, he had of course smelled alcohol on Whitfield. But there was another odor present as well, the odor of almonds, and while Dahlgren had never smelled this particular almondy scent before, he was sufficiently familiar with its description to guess what it was. He picked up Whitfield\u0027s empty glass from where it had fallen and noted the same bitter almond scent. Accordingly, he discontinued CPR and called the Poison Control number, although his instincts told him there was nothing to be done. The woman he spoke to told him essentially the same thing; about the best thing she could suggest was that he try to get the victim breathing again, and his heart beating. He took a moment to call 911, then resumed CPR for lack of anything better to do. He was still at it when the cops got there. That was shortly after eleven, and New York One was on the air with a news flash well before midnight, beating Channel Seven by a full five minutes. I didn\u0027t have the set on, however, and Elaine and I went to bed around a quarter of one without knowing that a client of mine had died a couple of miles away from the ingestion of a lethal dose of cyanide. Sometimes Elaine starts the day with \"Good Morning America\" or the \"Today\" show, but she\u0027s just as likely to play classical music on the radio, and when I joined her in the kitchen the next morning she was listening to what we both thought was Mozart. It turned out to be Haydn, but by the time they said as much she had left for the gym. I turned off the radio-if I\u0027d left it on I\u0027d have heard a newscast at the top of the hour, and Whitfield\u0027s death would have been the first or second item. I had a second cup of coffee and the half bagel she had left unfinished. Then I went out to get a paper. The phone was ringing when I left the apartment, but I was already halfway out the door. I kept going and let the machine answer it. If I\u0027d picked it up myself I\u0027d have received word of Whitfield\u0027s death from Wally Donn, but instead I walked to the newsstand, where twin stacks of the News and the Post rested side by side on adjacent upended plastic milk crates. \"LAWYER WHITFIELD DEAD\" cried the News, while the Post went right ahead and solved the crime for us. \"WILL KILLS #5!\" I bought both papers and went home, played Wally\u0027s message and called him back. \"What a hell of a thing,\" he said. \"Personal security work\u0027s the most clear-cut part of the business. All you have to do is keep the client alive. Long as he\u0027s got a pulse, you did your job right. Matt, you know the procedures we set up for Whitfield. It was a good routine, and I had good men on it. And there\u0027s cyanide in the fucking scotch bottle and we come off looking like shit.\"","sourceLink":"https://allnovel.net/even-the-wicked-matthew-scudder-13/page-13.html","bookId":2331,"book":{"id":2331,"title":"Even the Wicked (Matthew Scudder #13)","description":"Storyline: Even the Wicked (Matthew Scudder #13) Matthew Scudder knows that justice is an elusive commodity in the big city, where a harmless man can be shot dead in a public place criminals fly free through holes in a tattered legal system. But now a vigilante is roaming among the millions, executing those he fees deserve to die. He calls himself \"The Will of the People\"—an ingenious serial killer who announces his specific murderous intentions to the media before carrying through on his threats. A child molester, a Mafia don, a violent anti-abortionist—even the protected and untouchable are being ruthlessly erased by New York\u0027s latest celebrity avenger.","cover":"https://allnovel.net/images/even-the-wicked-matthew-scudder-13.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/even-the-wicked-matthew-scudder-13.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:53:24 AM"}}
