{"id":111963,"no":17,"title":"Page 17","content":"Thank God the trains are running today. It took hours to get home yesterday and I don\u0027t want to be out on the streets any longer than I have to be tonight. It only took a few minutes to get from the square to the station and I didn\u0027t have to wait long for a train. Christ knows what Tina\u0027s going to say to me tomorrow if I go back to work. I could call her from my mobile now and explain what\u0027s happened but I don\u0027t want to. I don\u0027t want to speak to anyone. I just want to get home. There are just three carriages on this train. There can\u0027t be any more than twenty people on board. I\u0027ve found myself a seat as far away from everyone else as possible. This is literally the last seat on the train, right at the very back of the third carriage. There are two other people in here with me. They\u0027re both nearer the front, one on either side of the aisle. I find myself trying to watch them constantly, scared that one of them might turn because as long as the train is moving I\u0027m trapped in here with them. Now and then I see one of them look around. They\u0027re as anxious as I am. My stomach is churning and I feel like I\u0027m going to throw up. I don\u0027t know whether it\u0027s the movement of the train or nerves that\u0027s making me feel sick. We\u0027re pulling into the last station before home. Christ, I hope no-one gets on here. I\u0027ve got my mobile phone in my hand and I have had since I got on. I want to call Lizzie and tell her I\u0027m on my way back but I can\u0027t bring myself to do it. How stupid is that? I don\u0027t want to talk out loud because I don\u0027t want to attract any attention to myself. I don\u0027t want to do anything that\u0027s going to give the other passengers any reason to even look at me. The train slows down and stops. I look out onto the platform (trying not to make it obvious that I\u0027m staring) and watch as a handful of people shuffle quietly towards the train doors. One person from this carriage gets up and gets off and another passenger arrives. It\u0027s a man in a long grey trench coat with a laptop bag slung over his shoulder. I do everything I can to avoid making eye contact with him but I have to keep watching. I have to see where he\u0027s going. Is he coming this way? Shit, he is. I quickly look down at the floor now, desperate not to let him know that I was watching. Is he still coming towards me? Is he getting closer? He\u0027s stopped. I\u0027m sure he must have stopped and I can\u0027t believe how relieved I suddenly feel. Christ, this is stupid. Am I paranoid? Am I the only one acting this way? I can\u0027t believe I am. Very, very carefully and moving very, very slowly I allow myself to look up and around again. The train judders and jolts as it shunts out of the station and I cautiously pull myself up using the back of the seat in front of me for support. The newly arrived passenger is sitting halfway down the carriage on the other side of the aisle. He looks like he\u0027s deliberately put as much distance between me and the third passenger as he can. Thank God. I press my head against the window and watch the familiar sights and landmarks rush by. It all looks the same but everything feels different this afternoon. Not far now. Almost home.","sourceLink":"https://allnovel.net/hater-hater-1/page-17.html","bookId":2555,"book":{"id":2555,"title":"Hater (Hater #1)","description":"Storyline: Hater (Hater #1) A modern take on the classic “apocalyptic” novel, Hater tells the story of Danny McCoyne, an everyman forced to contend with a world gone mad, as society is rocked by a sudden increase in violent assaults. Christened “Haters” by the media, the attackers strike without warning and seemingly without reason. Within seconds, normally rational, self-controlled people become frenzied, vicious killers. As the carnage mounts, one thing soon is clear: everyone, irrespective of race, gender, age, or class, has the potential to become either a Hater or a victim. At any moment, even friends and family can turn on one another with violent intent. In the face of this mindless terror, all McCoyne can do is secure his family, seek shelter, and watch as the world falls apart. But when he bolts the front door, the question remains: Is he shutting the danger out or locking it in?","cover":"https://allnovel.net/images/hater-hater-1.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/hater-hater-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:43:58 AM"}}
