{"id":111978,"no":33,"title":"Page 33","content":"I\u0027m washed and changed and ready to go but I can\u0027t bring myself to leave. The reality of what has happened is finally hitting home. The adrenaline and nervous fear has disappeared and now I\u0027m left feeling empty, confused and scared. I\u0027ve realised I\u0027ve lost everything. I\u0027m standing in Edward and Josh\u0027s bedroom now just looking around. It\u0027s too painful... I can\u0027t put into words how this is making me feel. I know that my boys are within touching distance but somehow I also know that they\u0027re gone and I\u0027ll never be with them again. I pick up a toy - a piece of nothing, just a cheap plastic hamburger meal giveaway gift - and it fills me with pain. Josh had this about three weeks ago. Harry gave us some money. We were out late and we filled the kids up with fast food. It was the first time Josh had had a meal to himself. He was so proud of it. He spent more time playing with this bloody toy than he did eating his burger. I have to let them go. I go through to the bedroom that Lizzie and I shared and I pick the bag I\u0027ve packed up off the bed. The wardrobe door is open. I look along Lizzie\u0027s clothes rail and all the different outfits I see remind me of so many times. It fills me with a gut-wrenching sadness. All the memories I have - every second of the life I\u0027ve led since I first met her - suddenly means nothing. It would have been easier if they\u0027d died. I know what I am now, and I know that Lizzie, Edward and Josh are different. I don\u0027t understand the differences between us, but I know beyond any doubt that they are insurmountable. I know that I\u0027ll never be with my partner and children again. As for Ellis... she\u0027s like me and I\u0027ll fight with my last breath to get her back. I\u0027m trying to shift the body in the kitchen. In spite of the hate I saw in Harry\u0027s eyes I don\u0027t want to leave him like this - half-dressed and twisted and slumped in the corner of the room. I pull his feet to try and straighten him out but his limbs are stiff and unresponsive. I fetch a duvet from the bedroom and drape it over the corpse. While I\u0027m trying to move the body there\u0027s a noise. I get up and run to the living room to look out of the broken window. Two army trucks have pulled into the road and I know that I have to get out of here quickly. I don\u0027t know for sure anymore whether these soldiers will help me or turn against me but I can\u0027t take any chances. What about the woman I saw shot dead in the street earlier this morning? Was she like me or like the others? Was she a Hater too? Move. Get moving now and don\u0027t stop. But where do I go? The trucks are getting closer. I swing my bag up onto my shoulder and run out of the flat and into the lobby. Where now? Will they check the flats upstairs? Could I risk hiding there? I know I have to get myself away from here and I sprint towards the rear exit. I try to open the fire door but it\u0027s padlocked shut. Christ, how long has it been like that? What would have happened to Lizzie and the kids if there\u0027d been a fire? Doesn\u0027t matter now. I look back and I can see movement right outside the apartment block. They\u0027re coming. Keep moving. Just keep moving. The door to the other ground floor flat is open. I\u0027m inside it now and it stinks. No-one\u0027s lived here officially for the last six months but it\u0027s been used regularly by tramps, junkies, dossers and God knows who and what else. Its layout is a mirror image of my flat. I run through to the kitchen and force the window above the sink open. I can hear soldiers inside the building now. I can hear their heavy booted footsteps in the lobby. I scramble through the window and jump down into the overgrown communal back garden. I\u0027m out. Without thinking I run through the long grass to the end of the garden then quickly scramble up the muddy bank which separates our block from the gardens of the privately owned houses which back onto us. I run along the ends of the gardens until I reach a tall wooden fence. I have to try and climb over it. I drag myself up, the muscles in my arms burning with effort, and manage to swing one leg over the top of the fence. I flick myself over and fall onto the pavement on the other side, landing painfully amongst the dog shit, litter and weeds. I stand up, brush myself down and run on.","sourceLink":"https://allnovel.net/hater-hater-1/page-33.html","bookId":2555,"book":{"id":2555,"title":"Hater (Hater #1)","description":"Storyline: Hater (Hater #1) A modern take on the classic “apocalyptic” novel, Hater tells the story of Danny McCoyne, an everyman forced to contend with a world gone mad, as society is rocked by a sudden increase in violent assaults. Christened “Haters” by the media, the attackers strike without warning and seemingly without reason. Within seconds, normally rational, self-controlled people become frenzied, vicious killers. As the carnage mounts, one thing soon is clear: everyone, irrespective of race, gender, age, or class, has the potential to become either a Hater or a victim. At any moment, even friends and family can turn on one another with violent intent. In the face of this mindless terror, all McCoyne can do is secure his family, seek shelter, and watch as the world falls apart. But when he bolts the front door, the question remains: Is he shutting the danger out or locking it in?","cover":"https://allnovel.net/images/hater-hater-1.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/hater-hater-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:43:58 AM"}}
