{"id":111987,"no":44,"title":"Page 44","content":"It\u0027s late and out here the world is silent. The noise of battle has long since faded away to nothing. Still surrounded by hordes of others we move quickly through the empty countryside. Armed scouts guide us through the darkness. I don\u0027t know where we\u0027re going, but I know that I can trust these people and I follow on regardless. I have a feeling in the pit of my stomach which tells me that before long I might finally start getting answers to some of the thousands of questions I\u0027ve been desperate to ask.\\n\\n We\u0027ve marched for more than an hour now and have seen and heard no-one else. Our route has avoided all roads and buildings and virtually all other signs of civilisation. Now we\u0027re moving along the base of a deep valley, shielded from view by trees and bushes.\\n\\n We stop.\\n\\n \u0027In here,\u0027 one of our guides says, ushering us towards a large copse. Without question we move into the trees, stopping only when we\u0027ve reached the densest part of the woods. The light in here is almost non-existent. One of the scouts kicks around in the undergrowth, seeming to be looking for something. Her foot strikes a small mound in the leaf-covered ground. She bends down and grabs the strap of a bag which one of them must have hidden there previously. She pulls the strap and drags up a large rucksack. Leaves and dirt fall from it as she stands it up and brushes it down. She opens the pack and starts to empty it out.\\n\\n \u0027Sit down and rest,\u0027 one of the other scouts says as his colleague throws packets of food and bottles of water to us. \u0027Get your strength back,\u0027 he continues, \u0027then listen to the message and leave.\u0027\\n\\n The message? What message? What\u0027s he talking about? I decide that I\u0027ll find out later. Right now eating my first food in more than a day is more important than anything else.\\n\\n I\u0027m sitting with three other people. In the middle of us is a mobile phone, set up ready to play the message. This message, our guides inform us, is as close to the truth as we\u0027ll get tonight. It has been distributed as a file by people like us and has spread around the country like a computer virus. It now sits on hundreds of thousands of phones, computers, media players and other devices, too widespread to be deleted.\\n\\n \u0027Chris who?\u0027 a man sitting next to me asks.\\n\\n \u0027Chris Ankin,\u0027 one of the guides replies.\\n\\n \u0027Who the hell\u0027s he?\u0027\\n\\n \u0027He was a politician,\u0027 he explains. \u0027Used to be fairly high-ranking in Defence. He was an adviser to the government when it began. He got to hear a hell of a lot of information before he changed.\u0027\\n\\n \u0027So where is he now?\u0027\\n\\n \u0027Rumour has it he\u0027s dead.\u0027\\n\\n \u0027Great.\u0027\\n\\n \u0027Doesn\u0027t matter. He did what he wanted to do before they got him.\u0027\\n\\n \u0027What was that?\u0027\\n\\n \u0027He wanted to let us know what was happening. He wanted to warn us. He wanted to try and coordinate us.\u0027\\n\\n \u0027Coordinate us?\u0027\\n\\n \u0027Make sure we all know what we have to do.\u0027\\n\\n \u0027And what\u0027s that?\u0027\\n\\n \u0027Why don\u0027t you just play the fucking message?\u0027\\n\\n The man leans forward and picks up the phone. He struggles with the controls for a second but soon manages to locate the file and starts it playing. At first the words are hard to make out. He adjusts the volume and lifts up the phone so that we can all hear what\u0027s being said.\\n\\n \u0027If you\u0027re listening to this,\u0027 Ankin\u0027s weary voice says, sounding tinny and distorted, \u0027chances are you don\u0027t have a clue what\u0027s happened to you or what\u0027s happened to the rest of the country. You won\u0027t know why you feel the way you do or why your life has just been turned upside down. I\u0027ll give you some information but I won\u0027t be able to answer all of your questions. I\u0027ll tell you what I know but that\u0027s not what\u0027s important now. Ultimately it doesn\u0027t matter why this has happened or what caused it, what matters is how we deal with it. Because of the unprecedented nature of the change and its effects on our society we need to act now and we need to act quickly. There will be time enough to look for reasons when the fight is over.\u0027\\n\\n I shuffle on the ground and glance at the other faces gathered around the telephone. They stare at the small handset with bewildered expressions. I\u0027m not sure if anyone believes what they\u0027re hearing.\\n\\n \u0027Put simply,\u0027 Ankin\u0027s voice continues, \u0027there is a fundamental genetic difference between us and them. A fundamental and basic difference which, until now, has remained dormant. I can\u0027t yet tell you why, but something has happened to trigger a change, and that change has created the hate. If you\u0027re hoping for me to give you a more scientific explanation, I can\u0027t. If you\u0027re waiting for me to explain why we can no longer exist alongside the people we loved, lived with and worked with just a couple of weeks ago, I can\u0027t. One day we\u0027ll understand, but today we don\u0027t have the luxury of having either the time or resources to find out.\\n\\n \u0027Initially it was presumed that the change was limited to just a small minority of people. Before it happened to me, while I was still in office, I saw figures which indicated that our numbers are much greater than was first thought. It\u0027s likely that as many as three people in every ten are like us. That\u0027s around thirty percent of the population. That\u0027s enough to take the fight to them and stand a chance.\\n\\n \u0027The change strips away some of the restraint we used to have. In very basic terms it makes us less susceptible to bullshit and more likely to take action. The change seems almost to amplify our instincts. We immediately know who is like us and we know who isn\u0027t. We know who poses a threat to us and who is on our side. Many of the layers of conditioning and control imposed upon us by society have been stripped away by the change and no longer apply. Now you fight when you need to fight and you destroy the enemy because you know that they will destroy you if you give them half a chance.\\n\\n \u0027Until now we\u0027ve discriminated against each other according to race, religion, age, gender and just about every other differentiation imaginable. Look around you tonight and you\u0027ll see that those differences are gone. Now, to put things as simplistically as possible, there is just \u0027us\u0027 and \u0027them\u0027, and it is impossible for us to coexist. We have no alternative but to fight, and we must keep fighting until we have wiped them out.\\n\\n \u0027The change has spread across the world with an incredible speed. No corner of the planet has been left untouched. We are everywhere. You must remember that we are not the underdogs. Their advantage over us is in physical numbers only. We have served at every level and among us we have experts in every profession. Among us we have every skill imaginable. We have everything we need to fight them and destroy them.\\n\\n \u0027Forget your past. Forget your families and friends and who you used to be. In time some kind of normality will be restored. Until then we have no alternative but to fight.\u0027\\n\\n The message ends and I look at the phone in disbelief. Is this a joke? Can any of this really be true? For a moment I\u0027m overloaded, unable to take it all in. Then my mind begins to fill with memories of the events of the last week and particularly of the last day - the killings, the battles, the bloodshed, the emotions - and I know that every word I\u0027ve just heard is true. I remember the feelings of strength and power I felt as I killed the enemy soldiers with my hands just a few hours ago and I know that it\u0027s all real. Impossible and unproven but real. \\n\\n","sourceLink":"https://allnovel.net/hater-hater-1/page-44.html","bookId":2555,"book":{"id":2555,"title":"Hater (Hater #1)","description":"Storyline: Hater (Hater #1) \\n A modern take on the classic “apocalyptic” novel, Hater tells the story of Danny McCoyne, an everyman forced to contend with a world gone mad, as society is rocked by a sudden increase in violent assaults. Christened “Haters” by the media, the attackers strike without warning and seemingly without reason. Within seconds, normally rational, self-controlled people become frenzied, vicious killers. As the carnage mounts, one thing soon is clear: everyone, irrespective of race, gender, age, or class, has the potential to become either a Hater or a victim. At any moment, even friends and family can turn on one another with violent intent. In the face of this mindless terror, all McCoyne can do is secure his family, seek shelter, and watch as the world falls apart. But when he bolts the front door, the question remains: Is he shutting the danger out or locking it in?\\n","cover":"https://allnovel.net/images/hater-hater-1.jpg","author":"David Moody","type":"Horror","source":"allnovel","link":"https://allnovel.net/hater-hater-1.html","creation":"Oct 5, 2019 8:58:52 AM","modification":"Oct 6, 2019 12:43:58 AM"}}
