{"id":97307,"no":10,"title":"Page 10","content":"\"Of course.\"\n Moneo had not dared to broach the subject of Siona to Idaho. Time enough for that later, but now the God Emperor had said a disturbing thing. Had there been a change in plans?\n Moneo returned his attention to the God Emperor and lowered his voice.\n \"Love a companion, Lord\u0027? But you said the Duncan...\"\n \"I said love, not breed with!\"\n Moneo trembled, thinking of how his own mating had been arranged, the wrenching away from...\n No! Best not follow those memories!\n There had been affection, even a real love... later, but in the first days...\n \"You are woolgathering again, Moneo.\"\n \"Forgive me, Lord, but when you speak of love...\"\n \"You think I have no tender thoughts\u0027!\"\n \"It\u0027s not that, Lord, but...\"\n \"You think I have no memories of love and breeding, then?\" The cart swerved toward Moneo, forcing him to dodge away, frightened by the glowering look on the Lord Leto\u0027s face.\n \"Lord, I beg your...\"\n \"This body may never have known such tenderness, but all of the memories are mine!\"\n Moneo could see the signs of the Worm growing more dominant in the God Emperor\u0027s body and there was no escaping recognition of this mood.\n I am in grave danger. We all are.\n Moneo grew aware of every sound around him, the creaking of the Royal Cart, the coughs and low conversation from the entourage, the feet on the roadway. There was an exhalation of cinnamon from the God Emperor. The air here between the enclosing rock walls still held its morning chill and there was dampness from the river.\n Was it the moisture bringing out the Worm?\n \"Listen to me, Moneo, as though your life depended on it.\"\n \"Yes, Lord,\" Moneo whispered, and he knew his life did depend on the care he took now, not only in listening but in observing.\n \"Part of me dwells forever underground without thought,\" Leto said. \"That part reacts. It does things without a care for knowing or logic.\"\n Moneo nodded. his attention glued on the God Emperor\u0027s face. Were the eyes about to glaze?\n \"I am forced to stand off and watch such things, nothing more,\" Leto said. \"Such a reaction could cause your death. The choice is not mine. Do you hear?\"\n \" I hear you, Lord,\" Moneo whispered.\n \"There is no such thing as choice in such an event! You accept it. merely accept it. You will never understand it or know it. What do you say to that\u0027?\"\n \"I fear the unknown, Lord.\"\n \"But I don\u0027t fear it. Tell me why!\"\n Moneo had been expecting a crisis such as this and, now that it had come, he almost welcomed it. He knew that his life depended on his answer. He stared at his God Emperor, mind racing.\n \"It is because of all your memories, Lord.\" ..Yes?\"\n An incomplete answer, then. Moneo grasped at words. \"You see everything that we know... all of it as it once was-unknown! A surprise to you... a surprise must be merely something new for you to know?\" As he spoke, Moneo realized he had put a defensive question mark on something that should have been a bold statement, but the God Emperor only smiled.\n \"For such wisdom I grant you a boon, Moneo. What is your wish\u0027,\"Sudden relief only opened a path for other fears to emerge \"Could I bring Siona back to the Citadel?\"\n \"That will cause me to test her sooner.\"\n \"She must be separated from her companions, Lord.\"\n \"Very well.\"\n \"My Lord is gracious.\"\n \" I am selfish.\"\n The God Emperor turned away from Moneo then and fell silent.\n Looking along the segmented body, Moneo observed that the Worm signs had subsided somewhat. This had turned out well after all. He thought then of the Fremen with their petition and fear returned.\n That was a mistake. They will only arouse Him again. Why did l say they could present their petition?\n The Fremen would be waiting up ahead, marshaled on this side of the river with their foolish papers waving in their hands.\n Moneo marched in silence, his apprehension increasing with each step.\n - \u003d Over here sand blows; over there sand blows.\n Over there a rich man waits; over here I wait.\n - The Voice of Shai-Hulud,\n From the Oral History SISTER CHENOEH\u0027S account, found among her papers after her death:\n I obey both my tenets as a Bene Gesserit and the commands of the God Emperor by withholding these words from my report while secreting them that they may be found when I am gone. For the Lord Leto said to me: \"You will return to your Superiors with my message, but these words keep secret for now. I will visit my rage upon your Sisterhood if you fail.\"\n As the Reverend Mother Syaksa warned me before I left: \"You must do nothing which will bring down his wrath upon us.\u0027.\n While I ran beside the Lord Leto on that short peregrination of which I had spoken, I thought to ask him about his likeness to a Reverend Mother. I said:\n \"Lord, I know how it is that a Reverend Mother acquires the memories of her ancestors and of others. How was it with you?\"\n \"It was a design of our genetic history and the working of the spice. My twin sister, Ghanima, and I were awakened in the womb, aroused before birth into the presence of our ancestral memories.\"\n \"Lord... my Sisterhood calls that Abomination.\"\n \"And rightly so,\" the Lord Leto said. \"The ancestral numbers can be overwhelming. And who knows before the event which force will command such a horde-good or evil?\"\n \"Lord, how did you overcome such a force?\u0027\n I did not overcome it,\" the Lord Leto said. \"But the persistence of the pharaonic model saved both Ghani and me. Do you know that model, Sister Chenoeh?\"\n \"We of the Sisterhood are well coached in history, Lord.\"\n \"Yes, but you do not think of this as I do,\" the Lord Leto said. \"I speak of a disease of government which was caught by the Greeks who spread it to the Romans who distributed it so far and wide that it never has completely died out.\"\n \"Does my Lord speak riddles?\"\n \"No riddles. I hate this thing, but it saved us. Ghani and I formed powerful internal alliances with ancestors who followed the pharaonic model. They helped us form a mingled identity within that long dormant mob.\"\n \"I find this disturbing, Lord.\"\n \"And well you should.\"\n \"Why are you telling me this now, Lord? You have never answered one of us before in this manner, not that I know of.\"\n \"Because you listen well, Sister Chenoeh; because you will obey me and because I will never see you again.\"\n The Lord Leto spoke those strange words to me and then he asked:\n \"Why have you not inquired about what your Sisterhood calls my insane tyranny?\"\n Emboldened by his manner, I ventured to say: \"Lord, we know about some of your bloody executions. They trouble us.\"\n The Lord Leto then did a strange thing. He closed his eyes as we went, and he said:\n \"Because I know you have been trained to record accurately whatever words you hear, I will speak to you now, Sister Chenoeh, as though you were a page in one of my journals. Preserve these words well, for I do not want them lost.\"\n I assure my Sisterhood now that what follows, exactly as he spoke them, are the words uttered then by the Lord Leto:\n \"To my certain knowledge, when I am no longer consciously present here among you, when I am here only as a fearsome creature of the desert, many people will look back upon me as a tyrant.\n \"Fair enough. I have been tyrannical.\n \"A tyrant-not fully human, not insane, merely a tyrant. But even ordinary tyrants have motives and feelings beyond those usually assigned them by facile historians, and they will think of me as a great tyrant. Thus. my feelings and motives are a legacy I would preserve lest history distort them too much. History has a way of magnifying some characteristics while it discards others.\n \"People will try to understand me and to frame me in their words. They will seek truth. But the truth always carries the ambiguity of the words used to express it.\n \"You will not understand me. The harder you try the more remote I will become until finally I vanish into eternal myth-a Living God at last!\n \"That\u0027s it, you see. I am not a leader nor even a guide. A god. Remember that. I am quite different from leaders and guides. Gods need take no responsibility for anything except genesis. Gods accept everything and thus accept nothing. Gods must be identifiable yet remain anonymous. Gods do not need a spirit world. My spirits dwell within me. answerable to my slightest summons. I share with you, because it pleases me to do so, what I have learned about them and through them. They are my truth.\n \"Beware of the truth, gentle Sister. Although much sought after, truth can be dangerous to the seeker. Myths and reassuring lies are much easier to find and believe. If you find a truth, even a temporary one, it can demand that you make painful changes. Conceal your truths within words. Natural ambiguity will protect you then. Words are much easier to absorb than are the sharp Delphic stabs of wordless portent. With words, you can cry out in the chorus:\n \"Why didn\u0027t someone warn me?\"\n \"But I did warn you. I warned you by example, not with words.\"\n \"There are inevitably more than enough words. You record them in your marvelous memory even now. And someday, my journals will be discovered-more words. I warn you that you read my words at your peril. The wordless movement of terrible events lies just below their surface. Be deaf! You do not need to hear or, hearing, you do not need to remember. How soothing it is to forget. And how dangerous!\n \"Words such as mine have long been recognized for their mysterious power. There is a secret knowledge here which can be used to rule the forgetful. My truths are the substance of myths and lies which tyrants have always counted on to maneuver the masses for selfish design.\n \"You see? I share it all with you, even the greatest mystery of all time, the mystery by which I compose my life. I reveal it to you in words:\n \"The only past which endures lies wordlessly within you.\"\n The God Emperor fell silent then. I dared to ask: \"Are those all of the words that my Lord wishes me to preserve`.\u0027\"\n \"Those are the words,\" the God Emperor said, and I thought he sounded tired, discouraged. He had the sound of someone uttering a last testament. I recalled that he had said he would never see me again, and I was fearful but I praise my teachers because the fear did not emerge in my voice.\n \"Lord Leto,\" I said, \"these journals of which you speak, for whom are they written?\"\n \"For posterity after the span of millennia. I personalize those distant readers, Sister Chenoeh. I think of them as distant cousins filled with family curiosities. They are intent on unraveling the dramas which only I can recount. They want to make the personal connections to their own lives. They want the meanings, the truth!\"\n \"But you warn us against truth, Lord,\" I said.\n \"Indeed! All of history is a malleable instrument in my hands. Ohhh, I have accumulated all of these pasts and I possess every fact-yet the facts are mine to use as I will and, even using them truthfully, I change them. What am I speaking to you now? What is a diary, a journal`? Words.\"\n Again, the Lord Leto fell silent. I weighed the portent of what he had said, weighed it against the admonition of Reverend Mother Syaksa, and against the things that the God Emperor had uttered to me earlier. He said I was his messenger and thus I felt that I was under his protection and might dare more than any other. Thus it was that I said:\n \"Lord Leto, you have said that you will not see me again. Does that mean you are about to die?\"\n I swear it here in my record of this event, the Lord Leto laughed! Then he said:\n \"No, gentle Sister, it is you who will die. You will not live to be a Reverend Mother. Do not be saddened by this for by your presence here today, by carrying my message back to the Sisterhood, by preserving my secret words as well, you will achieve a far greater status. You become here an integral part of my myth. Our distant cousins will pray to you for intercession with me!\"\n Again, the Lord Leto laughed, but it was gentle laughter and he smiled upon me warmly. I find it difficult to record here with that accuracy which I am enjoined to employ in every accounting such as this one, yet in the moment that the Lord Leto spoke these terrible words to me, I felt a profound bond of friendship with him, as though some physical thing had leaped between us, tying us together in a way that words cannot fully describe. It was not until the instant of this experience that I understood what he had meant by the wordless truth. It happened, yet I cannot describe it.\n - \u003d\n Archivists\u0027 note:\n Because of intervening events, the discovery of this private record is now little more than a footnote to history, interesting because it contains one of the earliest references to the God Emperor\u0027s secret journals. For those wishing to explore further into this account, reference may be made to Archive Records, subheadings: Chenoeh, Holy Sister Quintinius Violet: Chenoeh Report, The, and Melange Rejection, Medical Aspects of. (Footnote: Sister Quintinius Violet Chenoeh died in the fists third year of her Sisterhood, the cause being ascribed to melange incompatibility during her attempt to achieve the.status of Reverend Mother.) Our ancestor, Assur-nasir-apli, who was known as the cruelest of the cruel, seized the throne by slaying his own father and starting the reign of the sword. His conquests included the Ururnia Lake region. which led him to Commagene and Khabur. His son received tribute from the Shuites, from Tyre, Sidon, Gebel and even from Jehu, son of Omri whose very name struck terror into thousands. The conquests which began with Assur-nasirapli carried arms into Media and later into Israel, Damascus, Edom. Arpad, Babylon and Umlias. Does anyone remember these names and places now? I have given you enough clues: Try to name the planet.\n - The Stolen Journals THF AIR was stagnant deep within the carved cut of the Royal Road leading down to the flat approach to the bridge across the Idaho River. The road turned to the right out of the manmade immensity of rock and earth. Moneo, walking beside the Royal Cart, saw the paved ribbon leading across a narrow ridgetop to the lacery of plasteel which was the bridge almost a kilometer distant.\n The river, still deep in a chasm, turned inward toward him on the right and then ran straight through multi-stage cascades toward the far side of the Forbidden Forest where the confining walls dropped down almost to the level of the water. There at the outskirts of Onn lay the orchards and gardens which helped to feed the city.\n Moneo, looking at the distant stretch of river visible from where he walked, saw that the canyon top was bathed in light, while the water still flowed in shadows broken only by the faint silvery shimmering of the cascades.\n Straight ahead of him, the road to the bridge was brilliant in sunlight, the dark shadows of erosion gullies on both sides set off like arrows to indicate the correct path. The rising sun already had made the roadway hot. The air trembled above it, a warning of the day to come.\n We\u0027ll be safely into the City before the worst of the heat, Moneo thought.\n He trotted along in the weary patience which always overcame him at this point, his gaze fixed forward in expectation of the petitioning Museum Fremen. They would come up out of one of the erosion gullies, he knew. Somewhere on this side of the bridge. That was the agreement he had made with them. No way to stop them now. And the God Emperor still showed signs of the Worm.\n Leto heard the Fremen before any of his party either saw or heard them.\n \"Listen!\" he called.\n Moneo came to full alert.\n Leto rolled his body on the cart, arched the front upward cent of the bubble shield and peered ahead.\n Moneo knew this kind of thing well. The God Emperor\u0027s senses, so much more acute than any of those around him, had detected a disturbance ahead. The Fremen were beginning to move up to the road. Moneo let himself fall back one pace and moved out to the limit of his dutiful position. He heard it himself then.\n There was the sound of gravel spilling.\n The first Fremen appeared, coming up out of gullies on both sides of the road no more than a hundred meters ahead of the Royal party.\n Duncan Idaho dashed forward and slowed himself to a trot beside Moneo.\n \"Are those the Fremen?\" Idaho asked.\n \"Yes.\" Moneo spoke with his attention on the God Emperor, who had lowered his bulk back onto the cart.\n The Museum Fremen assembled on the road, dropped their outer robes to reveal inner robes of red and purple. Moneo gaped. The Fremen were togged out as pilgrims with some kind of black garment under the colorful robes. The ones in the foreground waved rolls of paper as the entire group began singing and dancing toward the royal entourage.\n \"A petition, Lord,\" the leaders cried. \"Hear our petition!\"\n \"Duncan!\" Leto cried. \"Clear them out!\"\n Fish Speakers surged forward through the courtiers as their Lord shouted. Idaho waved them forward and began running toward the approaching mob. The guards formed a phalanx, Idaho at the apex.\n Leto slammed closed the bubble cover of his cart, increased its speed and called out in an amplified roar: \"Clear away! Clear away!\"\n The Museum Fremen, seeing the guards run forward, the cart picking up speed as Leto shouted, made as though to open a path up the center of the road. Moneo, forced to run to keep up with the cart, his attention momentarily on the running footsteps of the courtiers behind him, saw the first unexpected change of program by the Fremen.\n As one person, the chanting throng threw off the pilgrim cloaks to reveal black uniforms identical to those worn by Idaho.\n What are they doing? Moneo wondered.\n Even while he was asking himself this question, Moneo saw the flesh of the approaching faces melt away in Face Dancer mockery, every face resolving into a likeness of Duncan Idaho.\n \"Face Dancers!\" someone screamed.\n Leto, too, had been distracted by the confusion of events, the sounds of many feet running on the road, the barked orders as Fish Speakers formed their phalanx. He had applied more speed to his cart, closing the distance between himself and the guards, beginning then to ring a warning bell and sound the cart\u0027s distortion klaxon. White noise blared across the scene, disorienting even some of the Fish Speakers who were conditioned to it.\n At that instant, the petitioners discarded their pilgrim cloaks and began the transformation maneuver, their faces flickering into likenesses of Duncan Idaho. Leto heard the scream: \"Face Dancers!\" He identified its source, a consort clerk in Royal Accounting.\n Leto\u0027s initial reaction was amusement.\n Guards and Face Dancers collided. Screams and shouts replaced the petitioners\u0027 chanting. Leto recognized Tleilaxu bat- the-commands. A thick knot of Fish Speakers formed around the black clad figure of his Duncan. The guards were obeying Leto\u0027s oft repeated instruction to protect their ghola-commander.\n But how will they tell him from the others.\n Leto brought his cart almost to a stop. He could see Fish Speakers on the left swinging their stunclubs. Sunlight flashed from knives. Then came the buzzing hum of lasguns, a sound Leto\u0027s grandmother had once described as \"the most terrible in our universe.\" More hoarse shouts and screams erupted from the vanguard.\n Leto reacted with the first sound of lasguns. He swerved the Royal Cart off the road to his right, shifted from wheels to suspensors and drove the vehicle back like a battering ram into a clot of Face Dancers trying to enter the fray from his side. Turning in a tight arc, he hit more of them on the other side, feeling the crushing impact of flesh against plasteel, a red spray of blood, then he was down off the road into an erosion gully. The brown serrated sides of the gully flashed past him. He swept upward and swooped across the river canyon to a high, rock-girt viewpoint beside the Royal Road. There, he stopped and turned, well beyond the range of hand-held lasguns.\n What a surprise!\n Laughter shook his great body with grunting, trembling convulsions. Slowly, the amusement subsided.\n From his vantage, Leto could see the bridge and the area of the attack. Bodies lay in tangled disarray all across the scene and into the flanking gullies. He recognized courtier finery, Fish Speaker uniforms, the bloodied black of the Face Dancer disguises. Surviving courtiers huddled in the background while Fish Speakers sped among the fallen making sure the attackers were dead with a swift knife stroke into each body.\n Leto swept his gaze across the scene searching for the black uniform of his Duncan. There was not one such uniform standing. Not one! Leto put down a surge of frustration, then saw a clutch of Fish Speaker guards among the courtiers and... and a naked figure there.\n Naked!\n It was Duncan! Naked! Of course! The Duncan Idaho without a uniform was not a Face Dancer.\n Again, laughter shook him. Surprises on both sides. What a shock that must have been to the attackers. Obviously, they\n had not prepared themselves for such a response.\n Leto eased his cart out onto the roadway, dropped the wheels into position and rolled down to the bridge. He crossed the bridge with a sense of deja vu, aware of the countless bridges in his memories, the crossings to view the aftermaths of battles. As he cleared the bridge. Idaho broke from the knot of guards and ran toward him, skipping and dodging the bodies. Leto stopped his cart and stared at the naked runner. The Duncan was like a Greek warrior-messenger dashing toward his commander to report the outcome of battle. The condensation of history stunned Leto\u0027s memories.\n Idaho skidded to a stop beside the cart. Leto opened the bubble cover.\n \"Face Dancers, every damned one\u0027\" Idaho panted.\n Not trying to conceal his amusement, Leto asked: \"Whose idea was it to strip off your uniform?\"\n \"Mine! But they wouldn\u0027t let me fight!\"\n Moneo came running up then with a group of guards. One of the Fish Speakers tossed a guard\u0027s blue cloak to Idaho, calling out: \"We\u0027re trying to salvage a complete uniform from the bodies.\"\n \"I ripped mine off,\" Idaho explained.\n \"Did any of the Face Dancers escape?\" Moneo asked.\n \"Not a one,\" Idaho said. \"I admit your women are good fighters, but why wouldn\u0027t they let me get into...\"\n \"Because they have instructions to protect you,\" Leto said. \"They always protect the most valuable...\"\n \"Four of them died getting me out of there!\" Idaho said.\n \"We lost more than thirty people altogether, Lord,\" Moneo said. \"We\u0027re still counting.\"\n \"How many Face Dancers?\" Leto asked.\n \"It looks like there were an even fifty of them, Lord,\" Moneo said. He spoke softly, a stricken look on his face.\n Leto began to chuckle.\n \"Why are you laughing?\" Idaho demanded. \"More than thirty of our people...\"\n \"But the Tleilaxu were so inept,\" Leto said. \"Do you not realize that only about five hundred years ago they would\u0027ve been far more efficient, far more dangerous. Imagine them daring that foolish masquerade! And not anticipating your brilliant response!\"\n \"They had lasguns,\" Idaho said.\n Leto twisted his bulky forward segments around and pointed at a hole burned in his canopy almost at the cart\u0027, midpoint A melted and fused starburst surrounded the hole \"They hit several other places underneath,\" Leto said \"Fortunately, they did not damage any suspensors or wheels.\"\n Idaho stared at the hole in the canopy. noted that it lined up with Leto\u0027s body.\n \"Didn\u0027t it hit you?\" he asked.\n \"Oh, yes,\" Leto said.\n \"Are you injured?\" \"I am immune to lasguns,\" Leto lied. \"When we get time, I will demonstrate.\"\n \"Well, I\u0027m not immune.\" Idaho said. \"And neither are your guards. Every one of us should have a shield belt.\"\n \"Shields are banned throughout the Empire.\" Leto said. \"It is a capital offense to have a shield.\"\n \"The question of shields,\" Moneo ventured.\n Idaho thought Moneo was asking for an explanation of shields and said: \"The belts develop a force field which will repel any object trying to enter at a dangerous speed. They have one major drawback. If you intersect the force field with a lasgun beam, the resultant explosion rivals that of a very large fusion bomb. Attacker and attacked go together.\"\n Moneo only stared at Idaho, who nodded.\n \"I see why they were banned,\" Idaho said. \"I presume the Great Convention against atomics is still in force and working well?\"\n \"Working even better since we searched out all of the Family atomics and removed them to a safe place,\" Leto said. \"But we do not have time to discuss such matters here.\"\n \"We can discuss one thing,\" Idaho said. \"Walking out here in the open is too dangerous. We should...\"\u0027 \"It is the tradition and we will continue it,\" Leto said.\n Moneo leaned close to Idaho\u0027s ear. \"You are disturbing the Lord Leto,\" he said.\n \"But...\"\n \"Have you not considered how much easier it is to control a walking population?\" Moneo asked.\n Idaho jerked around to stare into Moneo\u0027s eyes with sudden comprehension.\n Leto took the opportunity to begin issuing orders. \"Moneo, see that there is no sign of the attack left here, not one spot of blood or a torn rag of clothing-nothing.\"\n \"Yes, Lord.\"\n Idaho turned at the sound of people pressing close around them, saw that all of the survivors, even the wounded wearing emergency bandages, had come up to listen.\n \"All of you,\" Leto said, addressing the throng around the cart. \"Not a word of this. Let the Tleilaxu worry.\" He looked at Idaho.\n \"Duncan, how did those Face Dancers get into a region where only my Museum Fremen should roam free?\"\n Idaho glanced involuntarily at Moneo.\n \"Lord, it is my fault,\" Moneo said. \"I was the one who arranged for the Fremen to present their petition here. I even reassured Duncan Idaho about them.\"\n \"I recall your mentioning the petition,\" Leto said.\n \"I thought it might amuse you, Lord.\"\n \"Petitions do not amuse me, they annoy me. I am especially annoyed by petitions from people whose one purpose in my scheme of things is to preserve the ancient forms.\"\n \"Lord, it was just that you have spoken so many times about the boredom of these peregrinations into...\"\n \"But I am not here to ease the boredom of others!\"\n \"Lord?\"\n \"The Museum Fremen understand nothing about the old ways. They are only good at going through the motions. This naturally bores them and their petitions always seek to introduce changes. That\u0027s what annoys me. I will not permit changes. Now, where did you learn of the supposed petition?\"\n \"From the Fremen themselves,\" Moneo said. \"A dele...\" He broke off, scowling.\n \"Were the members of the delegation known to you\u0027.\u0027\"\n \"Of course, Lord. Otherwise I\u0027d...\"\n \"They\u0027re dead,\" Idaho said.\n Moneo looked at him, uncomprehending.\n \"The people you knew were killed and replaced by Face Dancer mimics,\" Idaho said.\n \"I have been remiss,\" Leto said. \"I should\u0027ve taught all of you how to detect Face Dancers. It will be corrected now that they grow foolishly bold.\"\n \"Why are they so bold?\" Idaho asked.\n \"Perhaps to distract us from something else,\" Moneo said.\n Leto smiled at Moneo. Under the stress of personal threat, the majordomo\u0027s mind worked well. He had failed his Lord by mistaking Face Dancer mimics for known Fremen. Now, Moneo felt that his continued service might depend upon those abilities for which the God Emperor had originally chosen him. \"And now we have time to prepare ourselves,\" Leto said. \"Distract us from what?\" Idaho demanded.\n \"From another plot in which they participate,\" Leto said. \"They think I will punish them severely for this, but the Tleilaxu core remains safe because of you, Duncan.\"\n \"They didn\u0027t intend to fail here,\" Idaho said.\n \"But it was a contingency for which they were prepared,\" Moneo said.\n \"They believe I will not destroy them because they hold the original cells of my Duncan Idaho,\" Leto said. \"Do you understand, Duncan?\" \n","sourceLink":"https://allnovel.net/god-emperor-of-dune-dune-chronicles-4/page-10.html","bookId":2156,"book":{"id":2156,"title":"God Emperor of Dune (Dune Chronicles #4)","description":"Storyline: \n God Emperor of Dune (Dune Chronicles #4) \n More than three thousand years have passed since the first events recorded in DUNE. Only one link survives with those tumultuous times: the grotesque figure of Leto Atreides, son of the prophet Paul Muad\u0027Dib, and now the virtually immortal God Emperor of Dune. He alone understands the future, and he knows with a terrible certainty that the evolution of his race is at an end unless he can breed new qualities into his species. But to achieve his final victory, Leto Atreides must also bring about his own downfall...\n \n","cover":"https://allnovel.net/images/god-emperor-of-dune-dune-chronicles-4.jpg","author":"Frank Herbert","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/god-emperor-of-dune-dune-chronicles-4.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:25:21 PM"}}
