{"id":69764,"no":1,"title":"Page 1","content":"At the age of seventeen, working as a delivery boy at Afremow\u0027s drugstore in Chicago was the perfect job, because it made it possible for me to steal enough sleeping pills to commit suicide. I was not certain exactly how many pills I would need, so I arbitrarily decided on twenty, and I was careful to pocket only a few at a time so as not to arouse the suspicion of our pharmacist. I had read that whiskey and sleeping pills were a deadly combination, and I intended to mix them, to make sure I would die. It was Saturday - the Saturday I had been waiting for. My parents would be away for the weekend and my brother, Richard, was staying at a friend\u0027s. Our apartment would be deserted, so there would be no one there to interfere with my plan. At six o\u0027clock, the pharmacist called out, \"Closing time.\" He had no idea how right he was. It was time to close out all the things that were wrong with my life. I knew it wasn\u0027t just me. It was the whole country. The year was 1934, and America was going through a devastating crisis. The stock market had crashed five years before and thousands of banks had failed. Businesses were folding everywhere. More than thirteen million people had lost their jobs and were desperate. Wages had plunged to as low as a nickel an hour. A million vagabonds, including two hundred thousand children, were roaming the country. We were in the grip of a disastrous depression. Former millionaires were committing suicide, and executives were selling apples in the streets. The most popular song was \"Gloomy Sunday.\" I had memorized some of the lyrics: Gloomy is Sunday With shadows I spend it all My heart and I Have decided to end it all The world was bleak, and it fit my mood perfectly. I had reached the depths of despair. I could see no rhyme or reason for my existence. I felt dislocated and lost. I was miserable and desperately longing for something that I couldn\u0027t define or name. We lived near Lake Michigan, only a few blocks from the shore, and one night I walked down there to try to calm myself. It was a windy night, and the sky was filled with clouds. I looked up and said, \"If there is a God, show yourself to me.\" And as I stood there staring at the sky, the clouds merged together, forming a huge face. There was a sudden flash of lightning that gave the face blazing eyes. I ran all the way home in a panic. I lived with my family in a small, third-floor apartment in Rogers Park. The great showman Mike Todd said that he was often broke but he never felt poor. I, however, felt poor all the time because we were living in the demeaning kind of grinding poverty where, in a freezing winter, you had to keep the radiator off to save money and you learned to turn the lights out when not in use. You squeezed the last drops out of the ketchup bottle and the last dab of toothpaste out of the tube. But I was about to escape all that. When I arrived at our dreary apartment, it was deserted. My parents had already left for the weekend and my brother had gone. There was no one to stop me from what I intended to do. I walked into the little bedroom that Richard and I shared and I carefully removed the bag of sleeping pills I had hidden under the dresser. Next, I went into the kitchen, took a bottle of bourbon from the shelf where my father kept it, and carried it back to the bedroom. I looked at the pills and the bourbon and I wondered how long it would take for them to work. I poured some whiskey into a glass and raised it to my lips. I would not let myself think about what I was doing. I took a swallow of the whiskey, and the acrid taste of it made me choke. I picked up a handful of sleeping pills and started to raise them to my mouth, when a voice said, \"What are you doing?\" I spun around, spilling some of the whiskey and dropping some of the pills. My father was standing in the bedroom doorway. He moved closer. \"I didn\u0027t know you drank.\" I looked at him, stunned. \"I - I thought you were gone.\" \"I forgot something. I\u0027ll ask you again: What are you doing?\" He took the glass of whiskey from my hand. My mind was racing. \"Nothing - nothing.\" He was frowning. \"This isn\u0027t like you, Sidney. What\u0027s wrong?\" He saw the pile of sleeping pills. \"My God! What\u0027s going on here? What are these?\" No plausible lie came to my mind. I said defiantly, \"They\u0027re sleeping pills.\" \"Why?\" \"I\u0027m going to - to commit suicide.\" There was a silence. Then my father said, \"I had no idea you were so unhappy.\" \"You can\u0027t stop me, because if you stop me now I\u0027ll do it tomorrow.\" He stood there, studying me. \"It\u0027s your life. You can do anything you want with it.\" He hesitated. \"If you\u0027re not in too big a hurry, why don\u0027t we go for a little walk?\" I knew exactly what he was thinking. My father was a salesman. He was going to try to talk me out of my plan, but he didn\u0027t have a chance. I knew what I was going to do. I said, \"All right.\" \"Put on a coat. You don\u0027t want to catch cold.\" The irony of that made me smile. Five minutes later, my father and I were headed down windswept streets that were empty of pedestrians because of the freezing temperature. After a long silence, my father said, \"Tell me about it, son. Why do you want to commit suicide?\" Where could I begin? How could I explain to him how lonely and trapped I felt? I desperately wanted a better life - but there was no better life for me. I wanted a wonderful future and there was no wonderful future. I had glowing daydreams, but at the end of the day, I was a delivery boy working in a drugstore. My fantasy was to go to college, but there was no money for that. My dream had been to become a writer. I had written dozens of short stories and sent them to Story magazine, Collier\u0027s, and The Saturday Evening Post, and I had gotten back printed rejections. I had finally decided I couldn\u0027t spend the rest of my life in this suffocating misery. My father was talking to me. \". . . and there are so many beautiful places in the world you haven\u0027t seen . . .\" I tuned him out. If he leaves tonight, I can go on with my plan. \". . . you\u0027d love Rome . . .\" If he tries to stop me now, I\u0027ll do it when he leaves. I was busy with my thoughts, barely listening to what he was saying. \"Sidney, you told me that you wanted to be a writer more than anything in the world.\" He suddenly had my attention. \"That was yesterday.\" \"What about tomorrow?\" I looked at him, puzzled. \"What?\" \"You don\u0027t know what can happen tomorrow. Life is like a novel, isn\u0027t it? It\u0027s filled with suspense. You have no idea what\u0027s going to happen until you turn the page.\" \"I know what\u0027s going to happen. Nothing.\" \"You don\u0027t really know that, do you? Every day is a different page, Sidney, and they can be full of surprises. You\u0027ll never know what\u0027s next until you turn the page.\" I thought about that. He did have a point. Every tomorrow was like the next page of a novel. We turned the corner and walked down a deserted street. \"If you really want to commit suicide, Sidney, I understand. But I\u0027d hate to see you close the book too soon and miss all the excitement that could happen to you on the next page - the page you\u0027re going to write.\" Don\u0027t close the book too soon . . . Was I closing it too soon? Something wonderful could happen tomorrow. Either my father was a superb salesman or I wasn\u0027t fully committed to ending my life, because by the end of the next block, I had decided to postpone my plan. But I intended to keep my options open.","sourceLink":"https://allnovel.net/the-other-side-of-me/page-1.html","bookId":2371,"book":{"id":2371,"title":"The Other Side of Me","description":"Storyline: Growing up in 1930s America, the young Sidney knew what it was to struggle to get by. Millions were out of work and the Sheldon family was forced to journey around America in search of employment. Grabbing every chance he could, Sidney worked nights as a bus-boy, a clerk, an usher - anything - but he dreamt of becoming something more. His dream was to become a writer and to break into Hollywood. By a stroke of luck, he found work as a reader for David Selznick, a top Hollywood producer, and the dream began to materialise.","cover":"https://allnovel.net/images/the-other-side-of-me.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-other-side-of-me.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:14:00 AM"}}
