{"id":66319,"no":11,"title":"Page 11","content":"Reacher had once read that boat shoes had been invented by a yachtsman looking for better grip on slippery decks. The guy had taken a regular smooth-soled athletic shoe and cut tiny stripes into the rubber with a straight razor. He had experimented and ended up with the cuts lateral and wavy and close together. They had done the trick, like a miniature tire tread. A whole new industry had grown up. The style had migrated by association from yachts to slips to marinas to boardwalks to summer sidewalks. Now boat shoes were everywhere. Reacher didn\u0027t like them much. They were thin and light and insubstantial.\\n\\n But they were quiet.\\n\\n He had seen the guy in the leather coat as soon as he stepped out of the Marriott\u0027s fire door. It would have been hard not to. Thirty yards distant, shallow angle, decent illumination from vapor lights on poles all over the place. His glance had flicked left and he had seen him quite clearly. Seen him react. Seen him stop. Seen him thereby identify himself as an opponent. Reacher had set out walking straight ahead and had scrutinized the afterimage his night vision had retained. What kind of an opponent was this guy? Reacher had closed his eyes and concentrated, two or three paces.\\n\\n Generic Caucasian, medium height, medium weight, red face and fair hair tinted orange and yellow by the streetlights.\\n\\n Cop or not?\\n\\n Not. Because of the jacket. It was a boxy square-shouldered double-breasted style made of chestnut-colored leather. By day it would be a definite shade of red-brown. And it had a glossy patina. It was definitely shiny. Not American. Not even from the kind of fire-sale store that sells leather garments for forty-nine bucks. It was a foreign style. Eastern European, just like the suit the twisted old guy had worn in the plaza. Not cheap. Just different. Russian, Bulgarian, Estonian, somewhere in there.\\n\\n So, not a cop.\\n\\n Reacher walked on. He kept his own footsteps quiet and focused on the sounds behind him, forty yards back. Shorter strides, thicker soles, the slap of leather, the faint crunch of grit, the thump of a rubber three-quarter heel. This wasn\u0027t Charlie. No way would anybody call this guy small. Not large, but definitely not small, either. And he didn\u0027t have black hair. And this wasn\u0027t the guy who had killed the girl. Not big enough. So, add one to the tally. Not four of them. Five of them. At least. Maybe more.\\n\\n Plan?\\n\\n Was this guy armed? Possibly, but only with a handgun. He hadn\u0027t been carrying anything longer. And Reacher was sanguine about his chances as a moving target a hundred and twenty feet in front of a guy with a handgun. Handguns were across-the-room weapons, not down-the-street propositions. Average range for a successful engagement with a handgun was about twelve feet. He was ten times more distant. And he would hear the sound of the slide in the stillness. He would have time to react.\\n\\n So, what was the plan? It was tempting to think about doubling back and taking the guy down. Just for fun. For retaliation. Reacher liked retaliation. Get your retaliation in first was his credo. Show them what they\u0027re dealing with.\\n\\n Maybe.\\n\\n Or maybe not. Or maybe later.\\n\\n He took a random turn and walked on. He kept his steps silent. He kept his pace steady. He let the guy behind him fall into the rhythm. Like hypnosis. Left, right, left, right. He forced everything out of his mind except the distant footsteps behind him. He zoomed in on them. Concentrated on them. They were there, faint but perceptible. Crunch, crunch, crunch, crunch. Left, right, left, right. Like hypnosis. He heard the sound of a cell phone being dialed. Just ten little electronic squawks, very quiet, almost inaudible, coming at him on the breeze in a random little sequence.\\n\\n He walked on. Left, right, left, right. The streets were deserted. Downtown was dead after working hours were over. The city still had some way to go before it grew a vibrant urban community. That was for sure. He walked on. Heard faint sibilant whispering, forty yards behind him. The cell phone. Who are you talking to, pal? He walked on. Then he stopped on the next corner. Glanced right and turned left into a wide straight cross-street, behind the cover of a four-story building.\\n\\n Then he ran. Five paces, ten, fifteen, twenty, fast and silent, across the street to the right-hand sidewalk, past the first alley he saw, into the second. He crouched back in the shadows, in a blank gray double doorway. A fire exit, maybe from a theater or a movie house. He lay down flat on his front. The guy had been used to a vertical target. Instinctively he would be looking six feet off the ground. A low shape on the floor would mean less to him.\\n\\n Reacher waited. He heard footsteps on the opposite sidewalk. The guy had seen his quarry turn a tight radius from the left-hand sidewalk of one street onto the left-hand sidewalk of the next street. Therefore subconsciously he would concentrate on the left, not the right. His first thought would be to look for still-vertical shapes in the alleys and the doorways on the left.\\n\\n Reacher waited. The footsteps kept on coming. Close now. Then Reacher saw the guy. He was on the left-hand sidewalk. He was moving slow. He was looking indecisive. He was glancing ahead, glancing left, glancing ahead. He had a cell phone up at his ear. He stopped. Stood still. Looked back over his right shoulder, at the doorways and the alleys on the other side of the street. Worth checking?\\n\\n Yes.\\n\\n The guy moved sideways and backwards like a crab, diagonally, facing the street ahead of him and searching the right-hand sidewalk all at the same time. He moved out of Reacher\u0027s field of view like a film running in reverse. Reacher stood up silently and moved deeper into the alley into total darkness at its far end. He found a fat vertical kitchen vent and slid around behind it. Crouched on his haunches and waited.\\n\\n It was a long wait. Then the footsteps came back. On the sidewalk. Into the alley. Slow, soft, careful. The guy was on his toes. No sound from the heels. Just the scrape of leather soles on grit. They rustled gently and low-level echoes of the sound came back off the alley\u0027s walls. The guy came closer. And closer.\\n\\n He came close enough to smell.\\n\\n Cologne, sweat, leather. He stopped four feet from where Reacher was hidden and peered hopelessly into the darkness. Reacher thought: Another step and you\u0027re history, pal. Just one more and it\u0027s Game Over for you.\\n\\n The guy turned around. Walked back to the street.\\n\\n Reacher stood up and followed him, swift and silent. Tables turned. Now I\u0027m behind you. Time to hunt the hunters.\\n\\n Reacher was bigger than most human beings and in some ways quite clumsy, but he could be light on his feet when he needed to be and had always been good at covert pursuit. It was a skill born of long practice. Mostly it employed caution and anticipation. You had to know when your quarry was going to slow, stop, turn, check. And if you didn\u0027t know, you had to err on the side of caution. Better to hide and fall ten extra yards behind than give yourself away.\\n\\n The guy in the leather coat searched every alley and every doorway on both sides of the street. Not well, but adequately. He searched and he moved forward, prey to the mistake that all adequate people make: I didn\u0027t screw up yet. He\u0027s still somewhere up ahead. He spoke twice on his cell phone. Quietly, but with agitation obvious in the tenor of his whisper. Reacher slipped from shadow to shadow behind him, hanging well back because the bright lights at the end of the street were getting close. The guy\u0027s searches became faster and more cursory. Hopeless and panicked, all at the same time. He made it to within twenty feet of the next turn and stopped dead and stood still.\\n\\n And gave up. Just quit. He stood in the middle of the sidewalk and listened to his phone and said something in reply and then dropped his arms to his sides and all the covert rigidity went out of his body. He slumped a little and walked straight ahead, fast and big and loud and obvious like a guy with no purpose in the world except getting directly from A to B. Reacher waited long enough to be certain it wasn\u0027t a trick. Then he followed, moving silently from shadow to shadow.\\n\\n Raskin walked past the sports bar\u0027s door and headed up the street. He could see Linsky\u0027s car in the distance. And Chenko\u0027s. The two Cadillacs were parked nose-to-tail at the curb, waiting for him. Waiting for the failure. Waiting for the hole in the air. Well, here I am, he thought.\\n\\n But Linsky was civil about it. Mainly because to criticize one of the Zec\u0027s appointees was to criticize the Zec himself, and nobody would dare to do that.\\n\\n \"He probably took a wrong turn,\" Linsky said. \"Maybe he didn\u0027t intend to be on that particular street at all. He probably doubled back through the alleys. Or else went into one of them to take a leak. Delayed himself and came out behind you.\"\\n\\n \"Did you check behind you?\" Vladimir asked.\\n\\n \"Of course I did,\" Raskin lied.\\n\\n \"So what now?\" Chenko asked.\\n\\n \"I\u0027ll call the Zec,\" Linsky said.\\n\\n \"He\u0027ll be royally pissed,\" Vladimir said. \"We nearly had the guy.\"\\n\\n Linsky dialed his phone. Relayed the bad news and listened to the response. Raskin watched his face. But Linsky\u0027s face was always unreadable. A skill born of long practice, and vital necessity. And it was a short call. A short response. Indecipherable. Just faint plastic sounds in the earpiece.\\n\\n Linsky clicked off.\\n\\n \"We keep on looking,\" he said. \"On a half-mile radius of where Raskin last saw him. The Zec is sending us Sokolov. He says we\u0027re sure of success with five of us.\"\\n\\n \"We\u0027re sure of nothing,\" Chenko said. \"Except a big pain in the ass and no sleep tonight.\"\\n\\n Linsky held out his phone. \"So call the Zec and tell him that.\"\\n\\n Chenko said nothing.\\n\\n \"Take the north, Chenko,\" Linsky said to him. \"Vladimir, the south. Raskin, head back east. I\u0027ll take the west. Sokolov can fill in where we need him when he gets here.\"\\n\\n Raskin headed back east, the way he had come, as fast as he could. He saw the sense in the Zec\u0027s plan. He had last seen Reacher about fifteen minutes ago, and a furtive man moving cautiously couldn\u0027t cover more than half a mile in fifteen minutes. So elementary logic dictated where Reacher must be. He was somewhere inside a circle a mile across. They had found him once. They could find him again.\\n\\n He made it all the way down the wide straight cross-street and turned south toward the raised highway. Retracing his steps. He passed through the shadows under the highway and headed for the vacant lot on the next corner. Kept close to the wall. Made the turn.\\n\\n Then the wall fell on him.\\n\\n At least that was what it felt like. He was hit a staggering blow from behind and he fell to his knees and his vision went dark. Then he was hit again and his lights went out and he pitched forward on his face. Last thing he felt before he lost consciousness was a hand in his pocket, stealing his cell phone.\\n\\n Reacher headed back under the highway with the cell phone warm in his hand. He leaned his shoulder against a concrete pillar as wide as a motel room and slid around it until his body was in the shadow and his hands were in the light from a lamp on a pole far above him. He took out the torn card with Emerson\u0027s numbers on it and dialed his cell.\\n\\n \"Yes?\" Emerson said.\\n\\n \"Guess who?\" Reacher said.\\n\\n \"This isn\u0027t a game, Reacher.\"\\n\\n \"Only because you\u0027re losing.\"\\n\\n Emerson said nothing.\\n\\n \"How easy am I to find?\" Reacher asked.\\n\\n No reply.\\n\\n \"Got a pen and paper?\"\\n\\n \"Of course I do.\"\\n\\n \"So listen up,\" Reacher said. \"And take notes.\" He recited the plate numbers from the two Cadillacs. \"My guess is one of those cars was in the garage before Friday, leaving the cone. You should trace the plates, check the tapes, ask some questions. You\u0027ll find some kind of an organization with at least six men. I heard some names. Raskin and Sokolov, who seem to be low-level guys. Then Chenko and Vladimir. Vladimir looks good for the guy who killed the girl. He\u0027s as big as a house. Then there\u0027s some kind of a lieutenant whose name I didn\u0027t get. He\u0027s about sixty and has an old spinal injury. He talked to his boss and referred to him as the Zec.\"\\n\\n \"Those are Russian names.\"\\n\\n \"You think?\"\\n\\n \"Except Zec. What kind of a name is Zec?\"\\n\\n \"It\u0027s not Zec. It\u0027s the Zec. It\u0027s a word. A word, being used as a name.\"\\n\\n \"What does it mean?\"\\n\\n \"Look it up. Read some history books.\"\\n\\n There was a pause. The sound of writing.\\n\\n \"You should come in,\" Emerson said. \"Talk to me face-to-face.\"\\n\\n \"Not yet,\" Reacher said. \"Do your job and I\u0027ll think about it.\"\\n\\n \"I am doing my job. I\u0027m hunting a fugitive. You killed that girl. Not some guy whose name you claim you heard, as big as a house.\"\\n\\n \"One more thing,\" Reacher said. \"I think the guy called Chenko also goes by the name of Charlie and is James Barr\u0027s friend.\"\\n\\n \"Why?\"\\n\\n \"The description. Small guy, dark, with black hair that sticks up like a brush.\"\\n\\n \"James Barr has got a Russian friend? Not according to our inquiries.\"\\n\\n \"Like I said, do your job.\"\\n\\n \"We\u0027re doing it. Nobody mentioned a Russian friend.\"\\n\\n \"He sounds American. I think he was involved with what happened on Friday, which means maybe this whole crew was involved.\"\\n\\n \"Involved how?\"\\n\\n \"I don\u0027t know. But I plan to find out. I\u0027ll call you tomorrow.\"\\n\\n \"You\u0027ll be in jail tomorrow.\"\\n\\n \"Like I\u0027m in jail now? Dream on, Emerson.\"\\n\\n \"Where are you?\"\\n\\n \"Close by,\" Reacher said. \"Sleep well, Detective.\"\\n\\n He clicked the phone off and put Emerson\u0027s number back in his pocket and took out Helen Rodin\u0027s. Dialed it and moved around the concrete pillar into deep shadow.\\n\\n \"Yes?\" Helen Rodin said.\\n\\n \"This is Reacher.\"\\n\\n \"Are you OK? The cop is right outside my door now.\"\\n\\n \"Suits me,\" Reacher said. \"Suits him too, I expect. He\u0027s probably getting forty bucks an hour for the overtime.\"\\n\\n \"They put your face on the six o\u0027clock news. It\u0027s a big story.\"\\n\\n \"Don\u0027t worry about me.\"\\n\\n \"Where are you?\"\\n\\n \"Free and clear. Making progress. I saw Charlie. I gave Emerson his plate number. Are you making progress?\"\\n\\n \"Not really. All I\u0027ve got is five random names. No reason I can see why anybody told James Barr to shoot any one of them.\"\\n\\n \"You need Franklin. You need research.\"\\n\\n \"I can\u0027t afford Franklin.\"\\n\\n \"I want you to find that address in Kentucky for me.\"\\n\\n \"Kentucky?\"\\n\\n \"Where James Barr went to shoot.\"\\n\\n Reacher heard her juggle the phone and flip through paper. Then she came back and read out an address. It meant nothing to Reacher. A road, a town, a state, a zip.\\n\\n \"What\u0027s Kentucky got to do with anything?\" Helen asked.\\n\\n Reacher heard a car on the street. Close by, to his left, fat tires rolling slow. He slid around the pillar and looked. A PD prowl car, crawling, lights off. Two cops in the front, craning their necks, looking right, looking left.\\n\\n \"Got to go,\" he said. He clicked the phone off and put it on the ground at the base of the pillar. Emerson\u0027s caller ID would have trapped the number and any cell phone\u0027s physical location could be tracked by the recognition pulse that it sends to the network, once every fifteen seconds, regular as clockwork. So Reacher left the phone in the dirt and headed west, forty feet below the raised roadbed.\\n\\n Ten minutes later he was opposite the back of the black glass tower, in the shadows under the highway, facing the vehicle ramp. There was an empty cop car parked on the curb. It looked still and cold. Settled. Like it had been there for a spell. The guy outside Helen\u0027s door, Reacher thought. He crossed the street and walked down the ramp. Into the underground garage. The concrete was all painted dirty white and there were fluorescent tubes blazing every fifteen feet. There were pools of light and pools of darkness. Reacher felt like he was walking out of the wings across a succession of brightly-lit stages. The ceiling was low. There were fat square pillars holding up the building. The service core was in the center. The whole space was cold and silent and about forty yards deep and maybe three times as wide.\\n\\n Forty yards deep.\\n\\n Just like the new extension on First Street. Reacher stepped over and put his back against the front wall. Walked all the way across to the back wall. Thirty-five paces. He turned like a swimmer at the end of a lap and walked back. Thirty-five paces. He crossed diagonally to the far corner. The garage was dark back there. He threaded between two NBC vans and found the blue Ford Mustang he guessed belonged to Ann Yanni. It was clean and shiny. Recently waxed. It had small windows, because of the convertible top. A raked windshield. Tinted glass.\\n\\n He tried the passenger door. Locked. He moved around the hood and tried the driver\u0027s door. The handle moved. Unlocked. He glanced around and opened the door.\\n\\n No alarm.\\n\\n He reached inside and touched the unlock button. There was a triple thunk as both door locks and the trunk lock unlatched. He closed the driver\u0027s door and stepped back to the trunk. The spare tire was under the floor. Nested inside the wheel were the jack and a length of metal pipe that both worked the jack and undid the wheel nuts. He took the pipe out and closed the trunk. Stepped around to the passenger side and opened the door and got inside the car.\\n\\n The interior smelled of perfume and coffee. He opened the glove box and found a stack of road maps and a small leather folder the size of a purse diary. Inside the folder were an insurance slip and an auto registration, both made out to Ms. Janine Lorna Ann Yanni at a local Indiana address. He put the folder away again and closed the glove box. Found the right levers and lowered his seat as far as it would go. He reclined the back all the way, which wasn\u0027t far. Then he moved the whole seat backward to give himself as much legroom as he could get. He untucked his shirt and rested the pipe in his lap and lay back in the seat. Stretched. He had about three hours to wait. He tried to sleep. Sleep when you can was the old army rule.\\n\\n First thing Emerson did was contact the phone company. He confirmed that the number his caller ID had caught was a cell phone. The service contract was written out to a business operating under the name Specialized Services of Indiana. Emerson tasked a first-year detective to track the business and told the phone company to track the phone. Initial progress was mixed. Specialized Services of Indiana dead-ended because it was owned by an offshore trust in Bermuda and had no local address. But the phone company reported that the cell phone was stationary and was showing up on three cells at once, which meant it had to be in the downtown area and would be easy to triangulate.\\n\\n Rosemary Barr sweet-talked her way past the Board of Corrections desk on the sixth floor of the hospital and was granted an out-of-hours visit with her brother. But when she got to his room she found he was deeply asleep. Her sweet talk was wasted. She sat for thirty minutes but James didn\u0027t wake up. She watched the monitors. His heartbeat was strong and regular. His breathing was fine. He was still handcuffed and his head was still clamped but his body was perfectly still. She checked his chart, to make sure he was being properly cared for. She saw the doctor\u0027s scribbled note: possible early-onset PA? She had no idea what that meant, and late in the evening she couldn\u0027t find anyone willing to explain it to her.\\n\\n The phone company marked the cell phone\u0027s location on a large-scale city map and faxed it to Emerson. Emerson tore it out of the machine and spent five minutes trying to make sense of it. He was expecting to find the three arrows meeting at a hotel, or a bar, or a restaurant. Instead they met on a vacant lot under the raised highway. He had a brief image in his mind of Reacher sleeping rough in a cardboard box. Then he concluded that the phone was abandoned, which was confirmed ten minutes later by the patrol car he sent out to check.\\n\\n And then just for formality\u0027s sake he fired up his computer and entered the plate numbers Reacher had given him. They came back as late-model Cadillac DeVilles, both black, both registered to Specialized Services of Indiana. He wrote dead end on the sheet of paper and dropped it in a file.\\n\\n Reacher woke up every time he heard the elevator motors start. The sound whined down the shaft through the cables and the moving cars rumbled. The first three times were false alarms. Just anonymous office people heading home after a long day at work. Every forty minutes or so they came down alone and walked wearily to their cars and drove away. Three times the tang of cold exhaust fumes drifted and three times the garage went quiet again and three times Reacher went back to sleep.\\n\\n The fourth time, he stayed awake. He heard the elevator start and checked his watch. Eleven forty-five. Showtime. He waited and heard the elevator doors open. This time, it wasn\u0027t just another lone guy in a suit. It was a big crowd. Eight or ten people. Noisy. It was the whole cast and crew from the NBC affiliate\u0027s eleven o\u0027clock news.\\n\\n Reacher pressed himself down in the Mustang\u0027s passenger seat and hid the tire iron underneath the tails of his shirt. It was cold against the skin of his stomach. He stared up at the fabric roof and waited.\\n\\n A heavy guy in baggy jeans passed through the darkness within five feet of the Mustang\u0027s front fender. He had a ragged gray beard and was wearing a Grateful Dead T-shirt under a torn cotton cardigan. Not on-screen talent. Maybe a cameraman. He walked on toward a silver pickup and climbed inside. Then came a man in a sharkskin suit and orange makeup. He had big hair and white teeth. Definitely on-screen talent, maybe weather, maybe sports. He passed by on the Mustang\u0027s other side and got into a white Ford Taurus. Then came three women together, young, casual dress, maybe the studio director and the floor manager and the vision mixer. They squeezed between the Mustang\u0027s trunk and a broadcast van. The car rocked three times as they nudged it. Then they split up and headed for their own separate rides.\\n\\n Then came three more people.\\n\\n Then came Ann Yanni.\\n\\n Reacher didn\u0027t notice her individually until she put her hand on her car\u0027s door handle. She paused and called something out to one of the others. She got an answer, said something else, and then opened the door. She came in butt-first, swiveling and ducking her head. She was wearing old jeans and a new silk blouse. It looked expensive. Reacher guessed she had been on camera, but at an anchor\u0027s desk, visible from the waist up only. Her hair was stiff with spray. She dumped herself in the seat and shut her door. Then she glanced to her right.\\n\\n \"Keep very quiet,\" Reacher said to her. \"Or I\u0027ll shoot you.\"\\n\\n He jabbed the tire iron at her, under his shirt. Half-inch wide, long and straight, it looked plausible. She stared at it in shock. Face-to-face two feet away she looked thinner and older than she looked on the television screen. There were fine lines all around her eyes, full of makeup. But she was very beautiful. She had impossibly perfect features, bold and vivid and larger than life, like most TV people. Her blouse had a formal collar but was open three buttons. Prim and sexy, at the same time.\\n\\n \"Hands where I can see them,\" Reacher said. \"In your lap.\" He didn\u0027t want her to go for the horn. \"Keys on the console.\" He didn\u0027t want her to hit the panic button. The new Fords he had driven had a little red button on the remote fob. He assumed it set off an alarm.\\n\\n \"Just sit tight,\" he said. \"Nice and quiet. We\u0027ll be OK.\"\\n\\n He clicked the button on his side and locked the car.\\n\\n \"I know who you are,\" she said.\\n\\n \"So do I,\" he said.\\n\\n He kept the tire iron in place and waited. Yanni sat still, hands in her lap, breathing hard, looking more and more scared as all around them her colleagues\u0027 cars started up. Blue haze drifted. People drove away, one by one. No backward glances. The end of a long day.\\n\\n \"Keep very quiet,\" Reacher said again, as a reminder. \"Then we\u0027ll be OK.\"\\n\\n Yanni glanced left, glanced right. Tension in her body.\\n\\n \"Don\u0027t do it,\" Reacher said. \"Don\u0027t do anything. Or I\u0027ll pull the trigger. Gut shot. Or thigh. You\u0027ll take twenty minutes to bleed out. Lots of pain.\"\\n\\n \"What do you want?\" Yanni asked.\\n\\n \"I want you to be quiet and sit still. Just for a few more minutes.\"\\n\\n She clamped her teeth and went quiet and sat still. The last car drove away. The white Taurus. The guy with the hair. The weatherman, or the sportscaster. There was tire squeal as he turned and engine noise as he gunned up the ramp. Then those sounds faded out and the garage went completely silent.\\n\\n \"What do you want?\" Yanni asked again. Her voice wobbled. Her eyes were huge. She was trembling. She was thinking rape, murder, torture, dismemberment.\\n\\n Reacher turned on the dome light.\\n\\n \"I want you to win the Pulitzer Prize,\" he said.\\n\\n \"What?\"\\n\\n \"Or the Emmy or whatever it is you guys get.\"\\n\\n \"What?\"\\n\\n \"I want you to listen to a story,\" he said.\\n\\n \"What story?\"\\n\\n \"Watch,\" Reacher said.\\n\\n He lifted his shirt. Showed her the tire iron resting against his stomach. She stared at it. Or at his shrapnel scar. Or both. He wasn\u0027t sure. He balanced the tire iron in his palm. Held it up in the light.\\n\\n \"From your trunk,\" he said. \"Not a gun.\"\\n\\n He clicked the button on the door and unlocked the car.\\n\\n \"You\u0027re free to go,\" he said. \"Whenever you want.\"\\n\\n She put her hand on the handle.\\n\\n \"But if you go, I go,\" Reacher said. \"You won\u0027t see me again. You\u0027ll miss the story. Someone else will get it.\"\\n\\n \"We\u0027ve been running your picture all night,\" she said. \"And the cops have got Wanted posters all over town. You killed Alexandra Dupree.\"\\n\\n Reacher shook his head. \"Actually I didn\u0027t, and that\u0027s part of the story.\"\\n\\n \"What story?\" she said again.\\n\\n \"Last Friday,\" Reacher said. \"It wasn\u0027t what it seemed.\"\\n\\n \"I\u0027m going to get out of the car now,\" Yanni said.\\n\\n \"No,\" Reacher said. \"I\u0027ll get out. I apologize if I upset you. But I need your help and you need mine. So I\u0027ll get out. You lock the doors, start the car, keep your foot on the brake, and open your window an inch. We\u0027ll talk through the window. You can drive off anytime you want.\"\\n\\n She said nothing. Just stared straight ahead as if she could make him vanish by not looking at him. He opened his door. Slid out and turned and laid the tire iron gently on the seat. Then he closed the door and just stood there. He tucked his shirt in. He heard the thunk of her door locks. She started her engine. Her brake lights flared red. He saw her reach up and switch off the dome light. Her face disappeared into shadow. He heard the transmission move out of Park. Her back-up lights flashed white as she moved the selector through Reverse into Drive. Then her brake lights went out and the engine roared and she drove off in a fast wide circle through the empty garage. Her tires squealed. Grippy rubber on smooth concrete. The squeals echoed. She lined up for the exit ramp and accelerated hard.\\n\\n Then she jammed on the brakes.\\n\\n The Mustang came to rest with its front wheels on the base of the ramp. Reacher walked toward it, crouching a little so he could see through the small rear window. No cell phone. She was just sitting there, staring straight ahead, hands on the wheel. The brake lights blazed red, so bright they hurt. The exhaust pipes burbled. White fumes kicked backward. Drops of water dripped out and made tiny twin pools on the floor.\\n\\n Reacher walked around to her window and stayed three feet away. She buzzed the glass down an inch and a half. He dropped into a crouch so he could see her face.\\n\\n \"Why do I need your help?\" she asked.\\n\\n \"Because Friday was over too soon for you,\" he said. \"But you can get it back. There\u0027s another layer. It\u0027s a big story. You\u0027ll win prizes. You\u0027ll get a better job. CNN will beat a path to your door.\"\\n\\n \"You think I\u0027m that ambitious?\"\\n\\n \"I think you\u0027re a journalist.\"\\n\\n \"What does that mean?\"\\n\\n \"That in the end, journalists like stories. They like the truth.\"\\n\\n She paused, almost a whole minute. Stared straight ahead. The car ticked and clicked as it warmed up. Reacher could sense the idle speed straining against the brakes. Then he saw her glance down and move her arm and shove the selector into Park. The Mustang rolled back six inches and stopped. Reacher shuffled sideways to stay level with the window. Yanni turned her head and looked straight at him.\\n\\n \"So tell me the story,\" she said. \"Tell me the truth.\"\\n\\n He told her the story, and the truth. He sat cross-legged on the concrete floor, so as to appear immobile and unthreatening. He left nothing out. He ran through all the events, all the inferences, all the theories, all the guesses. At the end he just stopped talking and waited for her reaction.\\n\\n \"Where were you when Sandy was killed?\" she asked.\\n\\n \"Asleep in the motor court.\"\\n\\n \"Alone?\"\\n\\n \"All night. Room eight. I slept very well.\"\\n\\n \"No alibi.\"\\n\\n \"You never have an alibi when you need one. That\u0027s a universal law of nature.\"\\n\\n She looked at him for a long moment.\\n\\n \"What do you want me to do?\" she said.\\n\\n \"I want you to research the victims.\"\\n\\n She paused.\\n\\n \"We could do that,\" she said. \"We have researchers.\"\\n\\n \"Not good enough,\" Reacher said. \"I want you to hire a guy called Franklin. Helen Rodin can tell you about him. She\u0027s in this building, two floors above you.\"\\n\\n \"Why hasn\u0027t she hired this Franklin guy herself?\"\\n\\n \"Because she can\u0027t afford him. You can. I assume you\u0027ve got a budget. A week of Franklin\u0027s time probably costs less than one of your weather guy\u0027s haircuts.\"\\n\\n \"And then what?\"\\n\\n \"Then we put it all together.\"\\n\\n \"How big is this?\"\\n\\n \"Pulitzer-sized. Emmy-sized. New-job-sized.\"\\n\\n \"How would you know? You\u0027re not in the business.\"\\n\\n \"I was in the army. I would guess this is worth a Bronze Star. That\u0027s probably a rough equivalent. Better than a poke in the eye with a sharp stick.\"\\n\\n \"I don\u0027t know,\" she said. \"I should turn you in.\"\\n\\n \"You can\u0027t,\" he said. \"You pull out a phone and I\u0027ll take off up the ramp. They won\u0027t find me. They\u0027ve been trying all day.\"\\n\\n \"I don\u0027t really care about prizes,\" she said.\\n\\n \"So do it for fun,\" he said. \"Do it for professional satisfaction.\"\\n\\n He rocked sideways and took out the napkin with Helen Rodin\u0027s number on it. Held it edge-on at the crack of the window. Yanni took it from him, delicately, trying to avoid touching his fingers with hers.\\n\\n \"Call Helen,\" Reacher said. \"Right now. She\u0027ll vouch for me.\"\\n\\n Yanni took a cell phone out of her purse and turned it on. Watched the screen and waited until it was ready and then dialed the number. She passed the napkin back. Listened to the phone.\\n\\n \"Helen Rodin?\" she said. Then she buzzed the window all the way up and Reacher didn\u0027t hear any of the conversation. He gambled that it was really Helen she was speaking to. It was possible that she had looked at the napkin and dialed another number entirely. Not 911, because she had dialed ten digits. But she might have called the cops\u0027 main desk. A reporter might know that number by heart.\\n\\n But it was Helen on the line. Yanni buzzed the window down again and passed him her phone through the gap.\\n\\n \"Is this for real?\" Helen asked him.\\n\\n \"I don\u0027t think she\u0027s decided yet,\" Reacher said. \"But it might work out.\"\\n\\n \"Is it a good idea?\"\\n\\n \"She\u0027s got resources. And having the media watching our backs might help us.\"\\n\\n \"Put her back on.\"\\n\\n Reacher passed the phone through the window. This time Yanni kept the glass down so that Reacher heard her end of the rest of the conversation. Initially she sounded skeptical, and then neutral, and then somewhat convinced. She arranged to meet on the fourth floor first thing in the morning. Then she clicked the phone off.\\n\\n \"There\u0027s a cop outside her door,\" Reacher said.\\n\\n \"She told me that,\" Yanni said. \"But they\u0027re looking for you, not me.\"\\n\\n \"What exactly are you going to do?\"\\n\\n \"I haven\u0027t decided yet.\"\\n\\n Reacher said nothing.\\n\\n \"I guess I need to understand where you\u0027re coming from first,\" Yanni said. \"Obviously you don\u0027t care anything about James Barr himself. So is this all for the sister? Rosemary?\"\\n\\n Reacher watched her watching him. A woman, a journalist.\\n\\n \"Partly for Rosemary,\" he said.\\n\\n \"But?\"\\n\\n \"Mostly for the puppet master. He\u0027s sitting there thinking he\u0027s as smart as a whip. I don\u0027t like that. Never have. Makes me want to show him what smart really is.\"\\n\\n \"Like a challenge?\"\\n\\n \"He had a girl killed, Yanni. She was just a dumb sweet kid looking for a little fun. He pushed open the wrong door there. So he deserves to have something come out at him. That\u0027s the challenge.\"\\n\\n \"You hardly knew her.\"\\n\\n \"That doesn\u0027t make her any less innocent.\"\\n\\n \"OK.\"\\n\\n \"OK what?\"\\n\\n \"NBC will spring for Franklin. Then we\u0027ll see where that takes us.\"\\n\\n \"Thanks,\" Reacher said. \"I appreciate it.\"\\n\\n \"You should.\"\\n\\n \"I apologize again. For scaring you.\"\\n\\n \"I nearly died of fright.\"\\n\\n \"I\u0027m very sorry.\"\\n\\n \"Anything else?\"\\n\\n \"Yes,\" Reacher said. \"I need to borrow your car.\"\\n\\n \"My car?\"\\n\\n \"Your car.\"\\n\\n \"What for?\"\\n\\n \"To sleep in and then to go to Kentucky in.\"\\n\\n \"What\u0027s in Kentucky?\"\\n\\n \"Part of the puzzle.\"\\n\\n Yanni shook her head. \"This is nuts.\"\\n\\n \"I\u0027m a careful driver.\"\\n\\n \"I\u0027d be aiding and abetting a fugitive criminal.\"\\n\\n \"I\u0027m not a criminal,\" Reacher said. \"A criminal is someone who has been convicted of a crime after a trial. Therefore I\u0027m not a fugitive, either. I haven\u0027t been arrested or charged. I\u0027m a suspect, that\u0027s all.\"\\n\\n \"I can\u0027t lend you my car after running your picture all night.\"\\n\\n \"You could say you didn\u0027t recognize me. It\u0027s a sketch, not a photograph. Maybe it isn\u0027t totally accurate.\"\\n\\n \"Your hair is different.\"\\n\\n \"There you go. I had it cut this morning.\"\\n\\n \"But I would recognize your name. I wouldn\u0027t lend my car to a stranger without at least knowing his name, would I?\"\\n\\n \"Maybe I gave you a false name. You met a guy with a different name who didn\u0027t look much like the sketch, that\u0027s all.\"\\n\\n \"What name?\"\\n\\n \"Joe Gordon,\" Reacher said.\\n\\n \"Who\u0027s he?\"\\n\\n \"Yankees\u0027 second baseman in 1940. They finished third. Not Joe\u0027s fault. He had a decent career. He played exactly one thousand games and got exactly one thousand hits.\"\\n\\n \"You know a lot.\"\\n\\n \"I\u0027ll know more tomorrow if you lend me your car.\"\\n\\n \"How would I get home tonight?\"\\n\\n \"I\u0027ll drive you.\"\\n\\n \"Then you\u0027ll know where I live.\"\\n\\n \"I already know where you live. I checked your registration. To make sure it was your car.\"\\n\\n Yanni said nothing.\\n\\n \"Don\u0027t worry,\" Reacher said. \"If I wanted to hurt you, you\u0027d already be hurt, don\u0027t you think?\"\\n\\n She said nothing.\\n\\n \"I\u0027m a careful driver,\" he said again. \"I\u0027ll get you home safe.\"\\n\\n \"I\u0027ll call a cab,\" she said. \"Better for you that way. The roads are quiet now and this is a distinctive car. The cops know it\u0027s mine. They stop me all the time. They claim I\u0027m speeding but really they want an autograph or they want to look down my shirt.\"\\n\\n She used her phone again and told a driver to meet her inside the garage. Then she climbed out of the car and left the motor running.\\n\\n \"Go park in a dark corner,\" she said. \"Safer for you if you don\u0027t leave before the morning rush.\"\\n\\n \"Thanks,\" Reacher said.\\n\\n \"And do it now,\" she said. \"Your face has been all over the news and the cab driver will have been watching. At least I hope he was watching. I need the ratings.\"\\n\\n \"Thanks,\" Reacher said again.\\n\\n Ann Yanni walked away and stood at the bottom of the ramp like she was waiting for a bus. Reacher slid into her seat and racked it back and reversed the car deep into the garage. Then he swung it around and parked nose-in in a distant corner. He shut it down and watched in the mirror. Five minutes later a green-and-white Crown Vic rolled down the ramp and Ann Yanni climbed into the back. The cab turned and drove out to the street and the garage went quiet.\\n\\n Reacher stayed in Ann Yanni\u0027s Mustang but he didn\u0027t stay in the garage under the black glass tower. Too risky. If Yanni had a change of heart he would be a sitting duck. He could picture her getting hit by cold feet or a crisis of conscience and picking up the phone and calling Emerson. He\u0027s fast asleep in my car in the corner of the garage at work. Right now. So three minutes after her cab left he started up again and drove out and around to the garage on First Street. It was empty. He went up to the second level and parked in the slot that James Barr had supposedly used. He didn\u0027t put money in the meter. Just pulled out Yanni\u0027s stack of road maps and planned his route and then pushed back on the wheel and reclined the seat and went back to sleep.\\n\\n He woke himself up five hours later, before dawn, and set out on the drive south to Kentucky. He saw three cop cars before he passed the city limits. But they didn\u0027t pay him any attention. They were too busy hunting Jack Reacher to waste time harassing a cute news anchor. \\n\\n","sourceLink":"https://allnovel.net/one-shot-jack-reacher-9/page-11.html","bookId":2347,"book":{"id":2347,"title":"One Shot (Jack Reacher #9)","description":"Storyline: One Shot (Jack Reacher #9) \\n Six shots. Five dead. One heartland city thrown into a state of terror. But within hours the cops have it solved: a slam-dunk case. Except for one thing. The accused man says: You got the wrong guy. Then he says: Get Reacher for me. And sure enough, from the world he lives in--no phone, no address, no commitments-ex-military investigator Jack Reacher is coming. In Lee Child\u0027s astonishing new thriller, Reacher\u0027s arrival will change everything--about a case that isn\u0027t what it seems, about lives tangled in baffling ways, about a killer who missed one shot-and by doing so give Jack Reacher one shot at the truth.... \\n The gunman worked from a parking structure just thirty yards away-point-blank range for a trained military sniper like James Barr. His victims were in the wrong place at the wrong time. But why does Barr want Reacher at his side? There are good reasons why Reacher is the last person Barr would want to see. But when Reacher hears Barr\u0027s own words, he understands. And a slam-dunk case explodes. Soon Reacher is teamed with a young defense lawyer who is working against her D.A. father and dueling with a prosecution team that has an explosive secret of its own. Like most things Reacher has known in life, this case is a complex battlefield. But, as always, in battle, Reacher is at his best. \\n Moving in the shadows, picking his spots, Reacher gets closer and closer to the unseen enemy who is pulling the strings. And for Reacher, the only way to take him down is to know his ruthlessness and respect his cunning-and then match him shot for shot.... \"From the Hardcover edition.\"\\n","cover":"https://allnovel.net/images/one-shot-jack-reacher-9.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/one-shot-jack-reacher-9.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:00:34 AM"}}
