{"id":66323,"no":15,"title":"Page 15","content":"Franklin pushed his chair back to make space and the others all crowded around the screen together. Reacher and Helen Rodin ended up shoulder to shoulder. No more animosity. Just the thrill of pursuit.\\n\\n Most of the document was taken up with coded headers and source information. Letters, numbers, times, origins. The substantive message was short. Two months previously, Mrs. Oline Anne Archer had made a missing persons report concerning her husband. His name was Edward Stratton Archer. He had left the marital home for work early on a routine Monday and had not returned by end-of-business on Wednesday, which was when the report was made.\\n\\n \"Is he still missing?\" Helen asked.\\n\\n \"Yes,\" Franklin said. He pointed to a letter A buried in the code at the top of the screen. \"It\u0027s still active.\"\\n\\n \"So let\u0027s go talk to Oline\u0027s friends,\" Reacher said. \"We need some background here.\"\\n\\n \"Now?\" Franklin said.\\n\\n \"We\u0027ve only got twelve hours,\" Reacher said. \"No time to waste.\"\\n\\n Franklin wrote down names and addresses for Oline Archer\u0027s co-worker and neighbor. He handed the paper to Ann Yanni, because she was paying his bill.\\n\\n \"I\u0027ll stay here,\" he said. \"I\u0027ll see if the husband shows up in the databases. This could be a coincidence. Maybe he\u0027s got a wife in every state. Wouldn\u0027t be the first time.\"\\n\\n \"I don\u0027t believe in coincidences,\" Reacher said. \"So don\u0027t waste your time. Find a phone number for me instead. A guy called Cash. Former Marine. He owns the range where James Barr went to shoot. Down in Kentucky. Call him for me.\"\\n\\n \"Message?\"\\n\\n \"Give him my name. Tell him to get his ass in his Humvee. Tell him to drive up here tonight. Tell him there\u0027s a whole new Invitational going on.\"\\n\\n \"Invitational?\"\\n\\n \"He\u0027ll understand. Tell him to bring his M24. With a night scope. And whatever else he\u0027s got lying around.\"\\n\\n Reacher followed Ann Yanni and Helen Rodin down the stairs. They got into Helen\u0027s Saturn, the women in the front and Reacher in the back. Reacher figured they would all have preferred the Mustang, but it only had two seats.\\n\\n \"Where first?\" Helen asked.\\n\\n \"Which is closer?\" Reacher asked back.\\n\\n \"The co-worker.\"\\n\\n \"OK, her first.\"\\n\\n Traffic was slow. Roads were torn up and construction traffic was lumbering in and out of work zones. Reacher glanced between his watch and the windows. Daylight was fading. Evening was coming. Time ticking away.\\n\\n The co-worker lived in a plain heartland suburb east of town. It was filled with a grid of straight residential streets. The streets were lined on both sides by modest ranch houses. The houses had small lots, flags on poles, hoops over the garage doors, satellite dishes on brick chimneys. Some of the sidewalk trees had faded yellow ribbons tied around them. Reacher guessed they symbolized solidarity with troops serving overseas. Which conflict, he wasn\u0027t sure. What the point was, he had no idea. He had served overseas for most of thirteen years and had never met anyone who cared what was tied to trees back home. As long as someone sent paychecks and food and water and bullets, and wives stayed faithful, most guys were happy enough.\\n\\n The sun was going down behind them and Helen was driving slowly with her head ducked forward so she could see the house numbers early. She spotted the one she wanted and pulled into a driveway and parked behind a small sedan. It was new. Reacher recognized the brand name from his walk up the four-lane: America\u0027s Best Warranty!\\n\\n The co-worker herself was a tired and harassed woman of about thirty-five. She opened her door and stepped out to the stoop and pulled the door shut behind her to block out the noise from what sounded like a dozen kids running riot inside. She recognized Ann Yanni immediately. Even glanced beyond her, looking for a camera crew.\\n\\n \"Yes?\" she said.\\n\\n \"We need to talk about Oline Archer,\" Helen Rodin said.\\n\\n The woman said nothing. She looked conflicted, like she knew she was supposed to think it was tasteless to talk about victims of tragedy to journalists. But apparently Ann Yanni\u0027s celebrity status overcame her reluctance.\\n\\n \"OK,\" she said. \"What do you want to know? Oline was a lovely person and all of us at the office miss her terribly.\"\\n\\n The nature of randomness, Reacher thought. Random slayings always involved people described as lovely afterward. Nobody ever said She was a rat-faced fink and I\u0027m glad she\u0027s dead. Whoever it was did us all a favor. That never happened.\\n\\n \"We need to know something about her husband,\" Helen said.\\n\\n \"I never met her husband,\" the woman said.\\n\\n \"Did Oline talk about him?\"\\n\\n \"A little, I guess. Now and then. His name is Ted, I think.\"\\n\\n \"What does he do?\"\\n\\n \"He\u0027s in business. I\u0027m not sure what kind of business.\"\\n\\n \"Did Oline say anything about him being missing?\"\\n\\n \"Missing?\"\\n\\n \"Oline reported him missing two months ago.\"\\n\\n \"I know she seemed terribly worried. I think he was having problems with his business. In fact I think he\u0027d been having problems for a year or two. That\u0027s why Oline went back to work.\"\\n\\n \"She didn\u0027t always work?\"\\n\\n \"Oh, no, ma\u0027am. I think she did way back, and then she gave it up. But she had to come back. Because of circumstances. Whatever the opposite of rags to riches is.\"\\n\\n \"Riches to rags,\" Reacher said.\\n\\n \"Yes, like that,\" the woman said. \"She needed her job, financially. I think she was embarrassed about it.\"\\n\\n \"But she didn\u0027t give you details?\" Ann Yanni asked.\\n\\n \"She was a very private person,\" the woman said.\\n\\n \"It\u0027s important.\"\\n\\n \"She would get kind of distracted. That wasn\u0027t like her. About a week before she was killed she was gone most of one afternoon. That wasn\u0027t like her, either.\"\\n\\n \"Do you know what she was doing?\"\\n\\n \"No, I really don\u0027t.\"\\n\\n \"Anything you remember about her husband would help us.\"\\n\\n The woman shook her head. \"His name is Ted. That\u0027s all I can say for sure.\"\\n\\n \"OK, thanks,\" Helen said.\\n\\n She turned and headed back to her car. Yanni and Reacher followed her. The woman on the stoop stared after them, disappointed, like she had failed an audition.\\n\\n Ann Yanni said, \"Strike one. But don\u0027t worry. It always happens that way. Sometimes I think we should just skip the first person on the list. They never know anything.\"\\n\\n Reacher was uncomfortable in the back of the car. His pants pocket had gotten underneath him and a coin was digging edge-on into his thigh. He squirmed around and pulled it out. It was a quarter, new and shiny. He looked at it for a minute and then he put it in the other pocket.\\n\\n \"I agree,\" he said. \"We should have skipped her. My fault. Stands to reason a co-worker wouldn\u0027t know much. People are cagy around co-workers. Especially rich people fallen on hard times.\"\\n\\n \"The neighbor will know more,\" Yanni said.\\n\\n \"We hope,\" Helen said.\\n\\n They were caught in crosstown traffic. They were headed from the eastern suburbs to the western, and it was a slow, slow ride. Reacher was glancing between his watch and the windows again. The sun was low on the horizon ahead of them. Behind them it was already twilight.\\n\\n Time ticking away.\\n\\n Rosemary Barr moved in her chair and struggled against the tape binding her wrists.\\n\\n \"We know it was Charlie who did it,\" she said.\\n\\n \"Charlie?\" the Zec repeated.\\n\\n \"My brother\u0027s so-called friend.\"\\n\\n \"Chenko,\" the Zec said. \"His name is Chenko. And yes, he did it. Tactically it was his plan. He did well. Of course, his physique helped. He was able to wear his own shoes inside your brother\u0027s. He had to roll the pants and the raincoat sleeves.\"\\n\\n \"But we know,\" Rosemary said.\\n\\n \"But who knows? And what exactly do they bring to the party?\"\\n\\n \"Helen Rodin knows.\"\\n\\n \"You\u0027ll dismiss her as your lawyer. You\u0027ll terminate the representation. Ms. Rodin will be unable to repeat anything she learned while your relationship was privileged. Linsky, am I right?\"\\n\\n Linsky nodded. He was six feet away, on the sofa, propped at an odd angle to rest his back.\\n\\n \"That\u0027s the law,\" he said. \"Here in America.\"\\n\\n \"Franklin knows,\" Rosemary said. \"And Ann Yanni.\"\\n\\n \"Hearsay,\" the Zec said. \"Theories, speculation, and innuendo. Those two have no persuasive evidence. And no credibility, either. Private detectives and television journalists are exactly the kind of people who peddle ridiculous and alternative explanations for events like these. It\u0027s to be expected. Its absence would be unusual. Apparently a president was killed in this country more than forty years ago and people like them still claim that the real truth has not yet been uncovered.\"\\n\\n Rosemary said nothing.\\n\\n \"Your deposition will be definitive,\" the Zec said. \"You\u0027ll go to Rodin and you\u0027ll give sworn testimony about how your brother plotted and planned. About how he told you what he was intending. In detail. The time, the place, everything. You\u0027ll say that to your sincere and everlasting regret you didn\u0027t take him seriously. Then some poor excuse for a public defender will take one look at your evidence and plead your brother guilty and the whole thing will be over.\"\\n\\n \"I won\u0027t do it,\" Rosemary said.\\n\\n The Zec looked straight at her.\\n\\n \"You will do it,\" he said. \"I promise you that. Twenty-four hours from now you\u0027ll be begging to do it. You\u0027ll be insane with fear that we might change our minds and not let you do it.\"\\n\\n The room went quiet. Rosemary glanced at the Zec as if she had something to say. Then she glanced away. But the Zec answered her anyway. He had heard her message loud and clear.\\n\\n \"No, we won\u0027t be there with you at the deposition,\" he said. \"But we will know what you tell them. Within minutes. And don\u0027t think about a little detour to the bus depot. For one thing, we\u0027ll have your brother killed. For another, there\u0027s no country in the world we can\u0027t find you in.\"\\n\\n Rosemary said nothing.\\n\\n \"Anyway,\" the Zec said. \"Let\u0027s not argue. It\u0027s unproductive. And pointless. You\u0027ll tell them what we tell you to tell them. You will, you know. You\u0027ll see. You\u0027ll be desperate to. You\u0027ll be wishing we had arranged an earlier appointment for you. At the courthouse. You\u0027ll spend the waiting time on your knees pleading for a chance to show us how word-perfect you are. That\u0027s how it usually happens. We\u0027re very good at what we do. We learned at the feet of masters.\"\\n\\n \"My brother has Parkinson\u0027s disease,\" Rosemary said.\\n\\n \"Diagnosed when?\" the Zec asked, because he knew the answer.\\n\\n \"It\u0027s been developing.\"\\n\\n The Zec shook his head. \"Too subjective to be helpful. Who\u0027s to say it\u0027s not a similar condition brought on suddenly by his recent injury? If not, then who\u0027s to say such a condition is a true handicap anyway? When shooting from such a close range? If the public defender brings in an expert, then Rodin will bring in three. He\u0027ll find doctors who will swear that Little Annie Oakley was racked with Parkinson\u0027s disease from the very day she was born.\"\\n\\n \"Reacher knows,\" Rosemary said.\\n\\n \"The soldier? The soldier will be dead by morning. Dead, or a runaway.\"\\n\\n \"He won\u0027t run away.\"\\n\\n \"Therefore he\u0027ll be dead. He\u0027ll come for you tonight. We\u0027ll be ready for him.\"\\n\\n Rosemary said nothing.\\n\\n \"Men have come for us before in the night,\" the Zec said. \"Many times, in many places. And yet we\u0027re still here. Da, Linsky?\"\\n\\n Linsky nodded again.\\n\\n \"We\u0027re still here,\" he said.\\n\\n \"When will he come?\" the Zec asked.\\n\\n \"I don\u0027t know,\" Rosemary said.\\n\\n \"Four o\u0027clock in the morning,\" Linsky said. \"He\u0027s an American. They\u0027re trained that four o\u0027clock in the morning is the best time for a surprise attack.\"\\n\\n \"Direction?\"\\n\\n \"From the north would make the most sense. The stone-crushing plant would conceal his staging area and leave him only two hundred yards of open ground to cover. But I think he\u0027ll double-bluff us there. He\u0027ll avoid the north, because he knows it\u0027s best.\"\\n\\n \"Not from the west,\" the Zec said.\\n\\n Linsky shook his head. \"I agree. Not down the driveway. Too straight and open. He\u0027ll come from the south or the east.\"\\n\\n \"Put Vladimir in with Sokolov,\" the Zec said to him. \"Tell them to watch the south and the east very carefully. But tell them to keep an eye out north and west, too. All four directions must be monitored continuously, just in case. Then put Chenko in the upstairs hallway with his rifle. He can be ready to deploy to whichever window is appropriate. With Chenko, one shot will be enough.\"\\n\\n Then he turned to Rosemary Barr.\\n\\n \"Meanwhile we\u0027ll put you somewhere safe,\" he told her. \"Your tutorials will start as soon as the soldier is buried.\"\\n\\n The outer western suburbs were bedroom communities for people who worked in the city, so the traffic stayed bad all the way out. The houses were much grander than in the east. They were all two-story, all varied, all well maintained. They all had big lots and pools and ambitious evergreen landscaping. With the last of the sunset behind them they looked like pictures in a brochure.\\n\\n \"Tight-ass middle class,\" Reacher said.\\n\\n \"What we all aspire to,\" Yanni said.\\n\\n \"They won\u0027t want to talk,\" Reacher said. \"Not their style.\"\\n\\n \"They\u0027ll talk,\" Yanni said. \"Everyone talks to me.\"\\n\\n They drove past the Archer place slowly. There was a cast-metal sign on thin chains under the mailbox: Ted and Oline Archer. Beyond it, across a broad open lawn, the house looked closed-up and dark and silent. It was a big Tudor place. Dull brown beams, cream stucco. Three-car garage. Nobody home, Reacher thought.\\n\\n The neighbor they were looking for lived across the street and one lot to the north. Hers was a place about the same size as the Archers\u0027 but done in an Italianate style. Stone accents, little crenellated towers, dark green sun awnings on the south-facing ground-floor windows. The evening light was fading away to darkness and lamps were coming on behind draped windows. The whole street looked warm and rested and quiet and very satisfied with itself. Reacher said, \"They sleep safely in their beds because rough men stand ready in the night to visit violence on those who would do them harm.\"\\n\\n \"You know George Orwell?\" Yanni asked.\\n\\n \"I went to college,\" Reacher said. \"West Point is technically a college.\"\\n\\n Yanni said, \"The existing social order is a swindle and its cherished beliefs mostly delusions.\"\\n\\n \"It is not possible for any thinking person to live in such a society as our own without wanting to change it,\" Reacher said.\\n\\n \"I\u0027m sure these are perfectly nice people,\" Helen said.\\n\\n \"But will they talk to us?\"\\n\\n \"They\u0027ll talk,\" Yanni said. \"Everyone talks.\"\\n\\n Helen pulled into a long limestone driveway and parked about twenty feet behind an imported SUV that had big chrome wheels. The front door of the house was made of ancient gray weathered oak with iron banding that had nail heads as big as golf balls. It felt like you could step through it straight into the Renaissance.\\n\\n \"Property is theft,\" Reacher said.\\n\\n \"Proudhon,\" Yanni said. \"Property is desirable, is a positive good in the world.\"\\n\\n \"Abraham Lincoln,\" Reacher said. \"In his first State of the Union.\"\\n\\n There was an iron knocker shaped like a quoit in a lion\u0027s mouth. Helen lifted it and used it to thump on the door. Then she found a discreet electric bell push and pressed that, too. They heard no answering sound inside the house. Heavy door, thick walls. Helen tried again with the bell, and before she got her finger off the button, the door sucked back off copper weatherproofing strips and opened like a vault. A guy was standing there with his hand on the inside handle.\\n\\n \"Yes?\" he said. He was somewhere in his forties, solid, prosperous, probably a golf club member, maybe an Elk, maybe a Rotarian. He was wearing corduroy pants and a patterned sweater. He was the kind of guy who gets home and immediately changes clothes as a matter of routine.\\n\\n \"Is your wife at home?\" Helen asked. \"We\u0027d like to speak with her about Oline Archer.\"\\n\\n \"About Oline?\" the guy said. He was looking at Ann Yanni.\\n\\n \"I\u0027m a lawyer,\" Helen said.\\n\\n \"What is there to be said about Oline?\"\\n\\n \"Maybe more than you think,\" Yanni said.\\n\\n \"You\u0027re not a lawyer.\"\\n\\n \"I\u0027m here as a journalist,\" Yanni said. \"But not on a human interest story. Nothing tacky. There might have been a miscarriage of justice. That\u0027s the issue here.\"\\n\\n \"A miscarriage in what way?\"\\n\\n \"They might have arrested the wrong man for the shootings. That\u0027s why I\u0027m here. That\u0027s why we\u0027re all here.\"\\n\\n Reacher watched the guy. He was standing there, holding the door, trying to decide. In the end he just sighed and stepped back.\\n\\n \"You better come in,\" he said.\\n\\n Everyone talks.\\n\\n He led the way through a muted yellow hallway to a living room. It was spacious and immaculate. Velvet furniture, little mahogany tables, a stone fireplace. No television. There was probably a separate room for that. A den, or a home theater. Or perhaps they didn\u0027t watch television. Reacher saw Ann Yanni calculating the odds.\\n\\n \"I\u0027ll get my wife,\" the guy said.\\n\\n He came back a minute later with a handsome woman a little younger than himself. She was wearing pressed jeans and a sweatshirt the same yellow as the hallway walls. Penny loafers on her feet. No socks. She had hair that had been expensively styled to look casual and windswept. She was medium height and lean in a way that spoke of diet books and serious time in aerobics classes.\\n\\n \"What\u0027s this about?\" she asked.\\n\\n \"Ted Archer,\" Helen said.\\n\\n \"Ted? I thought you told my husband it was about Oline.\"\\n\\n \"We think there may be a connection. Between his situation and hers.\"\\n\\n \"How could there be a connection? Surely what happened to Oline was completely out of the blue.\"\\n\\n \"Maybe it wasn\u0027t.\"\\n\\n \"I don\u0027t understand.\"\\n\\n \"We suspect that Oline might have been a specific target, kind of hidden behind the confusion of the other four victims.\"\\n\\n \"Wouldn\u0027t that be a matter for the police?\"\\n\\n Helen paused. \"At the moment the police seem satisfied with what they\u0027ve got.\"\\n\\n The woman glanced at her husband.\\n\\n \"Then I\u0027m not sure we should talk about it,\" he said.\\n\\n \"At all?\" Yanni asked. \"Or just to me?\"\\n\\n \"I\u0027m not sure if we would want to be on television.\"\\n\\n Reacher smiled to himself. The other side of the tracks.\\n\\n \"This is deep background only,\" Yanni said. \"It\u0027s entirely up to you whether your names are used.\"\\n\\n The woman sat down on a sofa and her husband sat next to her, very close. Reacher smiled to himself again. They had subconsciously adopted the standard couple-on-a-sofa pose that television interviews used all the time. Two faces close together, ideally framed for a tight camera shot. Yanni took her cue and sat in an armchair facing them, perched right on the edge, leaning forward, her elbows on her knees, a frank and open expression on her face. Helen took another chair. Reacher stepped away to the window. Used a finger to move the drapes aside. It was fully dark outside.\\n\\n Time ticking away.\\n\\n \"Tell us about Ted Archer,\" Yanni said. \"Please.\" A simple request, only six words, but her tone said: I think you two are the most interesting people in the world and I would love to be your friend. For a moment Reacher thought Yanni had missed her way. She would have been a great cop.\\n\\n \"Ted had business problems,\" the woman said.\\n\\n \"Is that why he disappeared?\" Yanni asked.\\n\\n The woman shrugged. \"That was Oline\u0027s initial assumption.\"\\n\\n \"But?\"\\n\\n \"Ultimately she rejected that explanation. And I think she was right to. Ted wasn\u0027t that kind of a man. And his problems weren\u0027t those kind of problems. The fact is, he was getting screwed rotten and he was mad as hell about it and he was fighting. And people who fight don\u0027t just walk away. I mean, do they?\"\\n\\n \"How was he getting screwed?\"\\n\\n The woman glanced at her husband. He leaned forward. Boy stuff. \"His principal customer stopped buying from him. Which happens. Power in the marketplace ebbs and flows. So Ted offered to renegotiate. Offered to drop his price. No dice. So he offered to drop it more. He told me he got to the point where he was giving it away. Still no dice. They just wouldn\u0027t buy.\"\\n\\n \"What do you think was happening?\" Yanni asked. Keep talking, sir.\\n\\n \"Corruption,\" the guy said. \"Under-the-table inducements. It was completely obvious. One of Ted\u0027s competitors was offering kickbacks. No way for an honest man to compete with that.\"\\n\\n \"When did this start?\"\\n\\n \"About two years ago. It was a major problem for them. Financially they went downhill very fast. No cash flow. Ted sold his car. Oline had to go out to work. The DMV thing was all she could find. They made her supervisor after about a month.\" He smiled a thin smile, proud of his class. \"Another year, she\u0027d have been running the place. She\u0027d have been Commissioner.\"\\n\\n \"What was Ted doing about it? How was he fighting?\"\\n\\n \"He was trying to find out which competitor it was.\"\\n\\n \"Did he find out?\"\\n\\n \"We don\u0027t know. He was trying for a long time, and then he went missing.\"\\n\\n \"Didn\u0027t Oline include this in her report?\"\\n\\n The guy sat back and his wife leaned forward again. Shook her head. \"Oline didn\u0027t want to. Not back then. It was all unproven. All speculation. She didn\u0027t want to throw accusations around. And it wasn\u0027t definitely connected. I guess the way we\u0027re telling it now it sounds more obvious than it was at the time. I mean, Ted wasn\u0027t Sherlock Holmes or anything. He wasn\u0027t on the case twenty-four/ seven. He was still doing normal stuff. He was just talking to people when he could, you know, asking questions, comparing notes, comparing prices, trying to put it all together. It was a two-year period. Occasional conversations, phone calls, inquiries, things like that. It didn\u0027t seem dangerous, certainly.\"\\n\\n \"Did Oline ever go to anyone with this? Later, maybe?\"\\n\\n The woman nodded. \"She stewed for two months after he disappeared. We talked. She was up and down with it. Eventually she decided there had to be a connection. I agreed with her. She didn\u0027t know what to do. I told her she should call the police.\"\\n\\n \"And did she?\"\\n\\n \"She didn\u0027t call. She went personally. She felt they would take her more seriously face-to-face. Not that they did, apparently. Nothing happened. It was like dropping a stone down a well and never hearing the splash.\"\\n\\n \"When did she go?\"\\n\\n \"A week before the thing in the plaza last Friday.\"\\n\\n Nobody spoke. Then, kindly, gently, Ann Yanni asked the obvious question: \"You didn\u0027t suspect a connection?\"\\n\\n The woman shook her head. \"Why would we? It seemed to be a total coincidence. The shootings were random, weren\u0027t they? You said so yourself. On the television news. We heard you say it. Five random victims, in the wrong place at the wrong time.\"\\n\\n Nobody spoke.\\n\\n Reacher turned away from the window.\\n\\n \"What business was Ted Archer in?\" he asked.\\n\\n \"I\u0027m sorry, I assumed you knew,\" the husband said. \"He owns a quarry. Huge place about forty miles north of here. Cement, concrete, crushed stone. Vertically integrated, very efficient.\"\\n\\n \"And who was the customer who backed off?\"\\n\\n \"The city,\" the guy said.\\n\\n \"Big customer.\"\\n\\n \"As big as they come. All this construction going on right now is manna from heaven for people in that business. The city sold ninety million in tax-free municipals just to cover the first year. Add in the inevitable overruns and it\u0027s a nine-figure bonanza for somebody.\"\\n\\n \"What car did Ted sell?\"\\n\\n \"A Mercedes-Benz.\"\\n\\n \"Then what did he drive?\"\\n\\n \"He used a truck from work.\"\\n\\n \"Did you see it?\"\\n\\n \"Every day for two years.\"\\n\\n \"What was it?\"\\n\\n \"A pickup. A Chevy, I think.\"\\n\\n \"An old brown Silverado? Plain steel wheels?\"\\n\\n The guy stared. \"How did you know that?\"\\n\\n \"One more question,\" Reacher said. \"For your wife.\"\\n\\n She looked at him.\\n\\n \"After Oline went to the cops, did she tell you who it was she talked to? Was it a detective called Emerson?\"\\n\\n The woman was already shaking her head. \"I told Oline if she didn\u0027t want to call she should go to the station house, but she said it was too far, because she never got that long of a lunch hour. She said she\u0027d go to the DA instead. His office is much closer to the DMV. And Oline was like that anyway. She preferred to go straight to the top. So she took it to Alex Rodin himself.\"\\n\\n Helen Rodin was completely silent on the drive back to town. So silent she quivered and vibrated and shook with it. Her lips were clamped and her cheeks were sucked in and her eyes were wide-open. Her silence made it impossible for Reacher or Yanni to speak. She drove like a robot, competently, not fast, not slow, displaying a mechanical compliance with lane markers and stoplights and yield signs. She parked on the apron below Franklin\u0027s office and left the motor running and said, \"You two go on ahead. I just can\u0027t do this.\"\\n\\n Ann Yanni got out and walked over to the staircase. Reacher stayed in the car and leaned forward over the seat.\\n\\n \"It\u0027ll be OK,\" he said.\\n\\n \"It won\u0027t.\"\\n\\n \"Helen, pull the keys and get your ass upstairs. You\u0027re an officer of the court and you\u0027ve got a client in trouble.\" Then he opened his door and climbed out of the car and by the time he had walked around the trunk she was waiting for him at the foot of the stairs.\\n\\n Franklin was in front of his computer, as always. He told Reacher that Cash was on his way up from Kentucky, no questions asked. Told him that Ted Archer hadn\u0027t shown up anywhere else in the databases. Then he noticed the silence and the tension.\\n\\n \"What\u0027s up?\" he asked.\\n\\n \"We\u0027re one step away,\" Reacher said. \"Ted Archer was in the concrete business and he was frozen out of all these new city construction contracts by a competitor who was offering bribes. He tried to prove it and must have been getting very close to succeeding, because the competitor offed him.\"\\n\\n \"Can you prove that?\"\\n\\n \"Only by inference. We\u0027ll never find his body without digging up First Street again. But I know where his truck is. It\u0027s in Jeb Oliver\u0027s barn.\"\\n\\n \"Why there?\"\\n\\n \"They used Oliver for things they can\u0027t do themselves. For when they don\u0027t want to show their faces, or for when they can\u0027t. Presumably Archer knew them and wouldn\u0027t have gone near them. But Oliver was just a local kid. Maybe he staged a flat tire or hitched a ride. Archer would have walked right into it. Then the bad guys hid the body and Oliver hid the truck.\"\\n\\n \"Oline Archer didn\u0027t suspect anything?\"\\n\\n \"She did eventually,\" Reacher said. \"She sat on it two months and then presumably she pieced together enough to make some kind of sense out of it. Then she started to go public with it and all kinds of private alarm bells must have gone off, because a week later she was dead. Staged the way it was because to have a missing husband and then a murdered wife two months later would have raised too many flags. But as long as it looked random it was going to be seen as coincidental.\"\\n\\n \"Who had Oline taken it to? Emerson?\"\\n\\n Reacher said nothing.\\n\\n \"She took it to my father,\" Helen Rodin said.\\n\\n There was silence for a long moment.\\n\\n \"So what now?\" Franklin said.\\n\\n \"You need to hit that keyboard again,\" Reacher said. \"Whoever got the city contracts has pretty much defined himself as the bad guy here. So we need to know who he is. And where he\u0027s based.\"\\n\\n \"Public record,\" Franklin said.\\n\\n \"So check it.\"\\n\\n Franklin turned away in the silence and started his fingers pattering over the keys. He pointed and clicked for a minute. Then he came up with the answer.\\n\\n \"Specialized Services of Indiana,\" he said. \"They own all the current city contracts for cement, concrete, and crushed stone. Many, many millions of dollars.\"\\n\\n \"Where are they?\"\\n\\n \"That was the good news.\"\\n\\n \"What\u0027s the bad?\"\\n\\n \"There\u0027s no paperwork. They\u0027re a trust registered in Bermuda. They don\u0027t have to file anything.\"\\n\\n \"What kind of a system is that?\"\\n\\n Franklin didn\u0027t answer.\\n\\n \"A Bermuda trust needs a local lawyer.\" Helen\u0027s voice was low, quiet, resigned. Reacher recalled the plate outside A. A. Rodin\u0027s office: the name, followed by the letters that denoted the law degree.\\n\\n Franklin clicked his way through two more screens.\\n\\n \"There\u0027s a phone number,\" he said. \"That\u0027s all we\u0027ve got.\"\\n\\n \"What is it?\" Helen asked.\\n\\n Franklin read it out.\\n\\n \"That\u0027s not my father\u0027s number,\" Helen said.\\n\\n Franklin clicked his way into a reverse directory. Typed in the number and the screen changed and gave him a name and a business address.\\n\\n \"John Mistrov,\" he said.\\n\\n \"Russian name,\" Reacher said.\\n\\n \"I guess so.\"\\n\\n \"Do you know him?\"\\n\\n \"Vaguely. He\u0027s a wills and trusts guy. One-man band. I\u0027ve never worked for him.\"\\n\\n Reacher checked his watch. \"Can you find a home address?\"\\n\\n Franklin went into a regular directory. Typed in the name and came up with a domestic listing.\\n\\n \"Should I call him?\" he said.\\n\\n Reacher shook his head. \"We\u0027ll pay him a visit. Face-to-face works better when time is short.\"\\n\\n Vladimir made his way down to the ground-floor surveillance room. Sokolov was in a rolling chair in front of the long table that carried the four television monitors. From left to right they were labeled North, East, South, and West, which made sense if a person viewed the world from a clockwise perspective. Sokolov was scooting his chair slowly down the line, examining each picture, moving on, returning from West to North with a powerful push off the wall. All four screens were misty and green, because it was dark outside and the thermal imaging had kicked in. Occasionally a bright dot could be seen moving fast in the distance. An animal. Nocturnal. Fox, skunk, raccoon, or a pet cat or a lost dog far from home. The North monitor showed a glow from the crushing plant. It would fade as the idle machines cooled. Apart from that all the backgrounds were a deep olive color, because there was nothing out there except for miles of fields constantly misted with cold water from the always-turning irrigation booms.\\n\\n Vladimir pulled up a second wheeled chair and sat down on Sokolov\u0027s left. He would watch North and East. Sokolov would concentrate on the South and West. That way they each had responsibility for one likely direction and one unlikely. It was a fair distribution of labor.\\n\\n Upstairs in the third-floor hallway Chenko loaded his own Super Match. Ten rounds, Lake City.308s. One thing Americans did right was ammunition. He opened all the bedroom doors to speed his access north, south, east, or west, as required. He walked to a window and turned his night scope on. Set it for seventy-five yards. He figured he would get the call when the soldier was about a hundred and fifty yards out. That was about the practical limit for the cameras. He would step to the right window and acquire the target when it was still more than a hundred yards distant. He would track its progress. He would let it come to him. When it was seventy-five yards out, he would kill it.\\n\\n He raised the rifle. Checked the image. It was bright and clear. He watched a fox cross the open ground east to west. Good hunting, my little friend. He walked back to the hallway and propped the gun against the wall and sat down in a straight-backed chair to wait.\\n\\n Helen Rodin insisted on staying behind in Franklin\u0027s office. So Reacher and Yanni went out alone, in the Mustang. The streets were dark and quiet. Yanni drove. She knew her way around. The address they were looking for was a loft building carved out of an old warehouse halfway between the river wharf and the railhead. Yanni said it was a part of the new urban strategy. SoHo comes to the heartland. She said she had thought about buying in the same building.\\n\\n Then she said, \"We should put Helen on suicide watch.\"\\n\\n \"She\u0027ll be OK,\" Reacher said.\\n\\n \"You think?\"\\n\\n \"I\u0027m pretty sure.\"\\n\\n \"What if it was your old man?\"\\n\\n Reacher didn\u0027t answer that. Yanni slowed as the bulk of a large brick building loomed through the darkness.\\n\\n \"You can ask first,\" Reacher said. \"If he doesn\u0027t answer, I\u0027ll ask second.\"\\n\\n \"He\u0027ll answer,\" Yanni said. \"They all answer.\"\\n\\n But John Mistrov didn\u0027t. He was a thin guy of about forty-five. He was dressed like a post-divorce midlife-crisis victim. Acid-rinsed too-tight jeans, black T-shirt, no shoes. They found him all alone in a big white loft apartment eating Chinese food from paper cartons. Initially he was very pleased to see Ann Yanni. Maybe hanging out with celebrities was a part of the lifestyle glamour that the new development had promised. But his early enthusiasm faded fast. It disappeared completely when Yanni ran through her suspicions and then insisted on knowing the names behind the trust.\\n\\n \"I can\u0027t tell you,\" he said. \"Surely you understand there are confidentiality issues here. Surely you understand that.\"\\n\\n \"I understand that serious crimes have been committed,\" Yanni said. \"That\u0027s what I understand. And you need to understand that, too. You need to choose up sides, right now, fast, before this thing goes public.\"\\n\\n \"No comment,\" the guy said.\\n\\n \"There\u0027s no downside here,\" Yanni said gently. \"These names we want, they\u0027ll all be in jail tomorrow. No comebacks.\"\\n\\n \"No comment,\" the guy said again.\\n\\n \"You want to go down with them?\" Yanni asked. Sharply. \"Like an accessory? Or do you want to get out from under? It\u0027s your choice. But one way or the other you\u0027re going to be on the news tomorrow night. Either doing the perp walk or standing there looking good, like, Oh my God, I had no idea, I was only too happy to help.\"\\n\\n \"No comment,\" the guy said for the third time.\\n\\n Loud, clear, and smug.\\n\\n Yanni gave up. Shrugged, and glanced at Reacher. Reacher checked his watch. Time ticking away. He stepped up close.\\n\\n \"You got medical insurance?\" he asked.\\n\\n The guy nodded.\\n\\n \"Dental plan?\"\\n\\n The guy nodded again.\\n\\n Reacher hit him in the mouth. Right-handed, short swing, hard blow.\\n\\n \"Get that fixed,\" he said.\\n\\n The guy rocked back a step and doubled over and then came up coughing with blood all over his chin. Cut lips, loose teeth all rimed with red.\\n\\n \"Names,\" Reacher said. \"Now. Or I\u0027ll take you apart a piece at a time.\"\\n\\n The guy hesitated. Mistake. Reacher hit him again. Then the guy came up with names, six of them, and descriptions, and an address, all from a position flat on the floor and all in a voice thick and bubbly with mouthfuls of blood.\\n\\n Reacher glanced at Yanni.\\n\\n \"They all answer,\" he said.\\n\\n In the dark in the Mustang on the way back, Ann Yanni said, \"He\u0027ll call and warn them.\"\\n\\n \"He won\u0027t,\" Reacher said. \"He just betrayed them. So my guess is he\u0027ll be going on a long vacation tomorrow.\"\\n\\n \"You hope.\"\\n\\n \"Doesn\u0027t matter anyway. They already know I\u0027m coming for them. Another warning wouldn\u0027t make a difference.\"\\n\\n \"You have a very direct style. One they don\u0027t mention in Journalism 101.\"\\n\\n \"I could teach you. It\u0027s about surprise, really. If you can surprise them you don\u0027t have to hit them very hard.\"\\n\\n Yanni dictated to Franklin the names that John Mistrov had given up. Four of them corresponded with names Reacher had already heard: Charlie Smith, Konstantin Raskin, Vladimir Shumilov, and Pavel Sokolov. The fifth was Grigor Linsky, which Reacher figured had to be the damaged man in the boxy suit, because the sixth name had been given simply as Zec Chelovek.\\n\\n \"I thought you said zec was a word,\" Franklin said.\\n\\n \"It is,\" Reacher said. \"And so is Chelovek. It\u0027s a transliteration of their word for human being. Zec Chelovek means prisoner-human being. Like Prisoner Man.\"\\n\\n \"The others aren\u0027t using code names.\"\\n\\n \"Neither is the Zec, probably. Maybe that\u0027s all he\u0027s got left. Maybe he forgot his real name. Maybe we all would, in the Gulag.\"\\n\\n \"You sound sorry for him,\" Yanni said.\\n\\n \"I\u0027m not sorry for him,\" Reacher said. \"I\u0027m just trying to understand him.\"\\n\\n \"No mention of my father,\" Helen said.\\n\\n Reacher nodded. \"The Zec is the puppet master. He\u0027s at the top of the tree.\"\\n\\n \"Which means my father is just an employee.\"\\n\\n \"Don\u0027t worry about that now. Focus on Rosemary.\"\\n\\n Franklin used an online map and figured out that the address John Mistrov had spilled related to a stone-crushing plant built next to a quarry eight miles north and west of the city. Then he searched the tax rolls and confirmed that Specialized Services of Indiana was its registered owner. Then he searched the rolls all over again and found that the only other real estate registered to the trust was a house on the lot adjacent to the stone-crushing plant. Yanni said she knew the area.\\n\\n \"Anything else out there?\" Reacher asked her.\\n\\n She shook her head. \"Nothing but farmland for miles.\"\\n\\n \"OK,\" Reacher said. \"There you go. That\u0027s where Rosemary is.\"\\n\\n He checked his watch. Ten o\u0027clock in the evening.\\n\\n \"So what now?\" Yanni said.\\n\\n \"Now we wait,\" Reacher said.\\n\\n \"For what?\"\\n\\n \"For Cash to get here from Kentucky. And then we wait some more.\"\\n\\n \"For what?\"\\n\\n Reacher smiled.\\n\\n \"For the dead of night,\" he said.\\n\\n Franklin made coffee. Yanni told TV stories, about people she had known, about things she had seen, about governors\u0027 girlfriends, politicians\u0027 wives\u0027 lovers, rigged ballots, crooked unions, about acres of marijuana growing behind circular screens of tall corn on the edges of Indiana fields. Then Franklin talked about his years as a cop. Then Reacher talked about his years since the army, the wandering, the exploring, his rootless invisible life.\\n\\n Helen Rodin said nothing at all.\\n\\n At eleven o\u0027clock exactly they heard the rattle of a big diesel engine beating off the brick outside. Reacher stepped to the window and saw Cash\u0027s Humvee nosing onto the parking apron. Too noisy, he thought. We can\u0027t use it.\\n\\n Or maybe we can.\\n\\n \"The Marines are here,\" he said.\\n\\n They heard Cash\u0027s feet on the outside stairs. Heard his knock on the door. Reacher went out to the hallway to open up. Cash came in, brisk, solid, reassuring. He was dressed all in black. Black canvas pants, black canvas windbreaker. Reacher introduced him all around. Yanni, Franklin, Helen Rodin. Everyone shook hands and Cash took a seat. Inside twenty minutes he was up to speed and totally on board.\\n\\n \"Do we have a plan?\" he asked.\\n\\n \"We\u0027re about to make one,\" Reacher said. Yanni went out to her car for the maps. Franklin cleared away the coffee cups and made space on the table. Yanni chose the right map. Spread it out flat.\\n\\n \"It\u0027s like a giant chessboard out there,\" she said. \"Every square is a field a hundred yards across. There are roads laid out in a grid, north to south, west to east, about twenty fields apart.\" Then she pointed. Slim finger, painted nail. \"But right here we\u0027ve got two roads that meet, and southeast of the corner they make we\u0027ve got an empty space three fields wide and five fields high. No agriculture there. The northern part is the stone-crushing plant and the house is south of it. I\u0027ve seen it and it stands about two hundred yards off the road, all alone in the middle of absolutely nothing. No landscaping, no vegetation. But no fence, either.\"\\n\\n \"Flat?\" Reacher asked.\\n\\n \"As a pool table,\" Yanni said.\\n\\n \"Dark out there,\" Cash said.\\n\\n \"As the Earl of Hell\u0027s waistcoat,\" Reacher said. \"And I guess if there\u0027s no fence it means they\u0027re using cameras. With some kind of thermal imaging at night. Some kind of infrared.\"\\n\\n \"How fast can you run two hundred yards?\" Cash asked.\\n\\n \"Me?\" Reacher said. \"Slow enough they could mail-order a rifle to shoot me with.\"\\n\\n \"What\u0027s the best approach?\"\\n\\n \"Walk in from the north,\" Reacher said. \"Without a doubt. We could get into the stone place straight off the road and just hike through it. Then we could lie up as long as we wanted. Good concealment until the last minute.\"\\n\\n \"Can\u0027t walk in from anywhere if they\u0027ve got thermal cameras.\"\\n\\n \"We\u0027ll worry about that later.\"\\n\\n \"OK, but they\u0027ll anticipate the north.\"\\n\\n Reacher nodded. \"We\u0027ll pass on the north. Too obvious.\"\\n\\n \"South or east would be next best. Because presumably the driveway comes in from the west. Probably too straight and too open.\"\\n\\n \"They\u0027ll be thinking the same thing.\"\\n\\n \"Makes us both right.\"\\n\\n \"I kind of like the driveway,\" Reacher said. \"What will it be? Paved?\"\\n\\n \"Crushed limestone,\" Yanni said. \"They\u0027ve got plenty to spare.\"\\n\\n \"Noisy,\" Cash said.\\n\\n \"It\u0027ll have retained a little daytime heat,\" Reacher said. \"It\u0027ll be warmer than the dirt. It\u0027ll put a stripe of color down their thermal picture. If the contrast isn\u0027t great it\u0027ll give a shadow zone either side.\"\\n\\n \"Are you kidding?\" Cash said. \"You\u0027re going to be forty or fifty degrees hotter than ambient temperature. You\u0027re going to show up like a road flare.\"\\n\\n \"They\u0027re going to be paying attention south and east.\"\\n\\n \"Not exclusively.\"\\n\\n \"You got a better idea?\"\\n\\n \"What about a full frontal assault? With vehicles?\"\\n\\n Reacher smiled. \"If it absolutely positively has to be destroyed by morning, call the United States Marine Corps.\"\\n\\n \"Roger that,\" Cash said.\\n\\n \"Too dangerous,\" Reacher said. \"We can\u0027t give them a second\u0027s warning and we can\u0027t turn the place into a free-fire zone. We\u0027ve got Rosemary to think about.\"\\n\\n Nobody spoke.\\n\\n \"I like the driveway,\" Reacher said again.\\n\\n Cash glanced at Helen Rodin.\\n\\n \"We could just call in the cops,\" he said. \"You know, if it\u0027s the DA who\u0027s the bad guy here. A couple of SWAT teams could do it.\"\\n\\n \"Same problem,\" Reacher said. \"Rosemary would be dead before they got near the door.\"\\n\\n \"Cut the power lines? Kill the cameras?\"\\n\\n \"Same problem. It\u0027s an announcement ahead of time.\"\\n\\n \"Your call.\"\\n\\n \"The driveway,\" Reacher said. \"I like the driveway.\"\\n\\n \"But what about the cameras?\"\\n\\n \"I\u0027ll think of something,\" Reacher said. He stepped over to the table. Stared down at the map. Then he turned back to Cash. \"Does your truck have a CD player?\"\\n\\n Cash nodded. \"Part of the comfort package.\"\\n\\n \"Do you mind if Franklin drives it?\"\\n\\n \"Franklin can have it. I\u0027d prefer a sedan.\"\\n\\n \"OK, your Humvee is our approach vehicle. Franklin can drive us there, let us out, and then get straight back here.\"\\n\\n \"Us?\" Yanni said. \"Are we all going?\"\\n\\n \"You bet your ass,\" Reacher said. \"Four of us there, with Franklin back here as the comms center.\"\\n\\n \"Good,\" Yanni said.\\n\\n \"We need cell phones,\" Reacher said.\\n\\n \"I\u0027ve got one,\" Yanni said.\\n\\n \"Me too,\" Cash said.\\n\\n \"Me too,\" Helen said.\\n\\n \"I don\u0027t,\" Reacher said.\\n\\n Franklin took a small Nokia out of his pocket.\\n\\n \"Take mine,\" he said.\\n\\n Reacher took it. \"Can you set up a conference call? Four cell phones and your desk phone? As soon as you get back here?\"\\n\\n Franklin nodded. \"Give me your numbers.\"\\n\\n \"And turn the ringers off,\" Reacher said.\\n\\n \"When are we doing this?\" Cash asked.\\n\\n \"Four o\u0027clock in the morning is my favorite time,\" Reacher said. \"But they\u0027ll be expecting that. We learned it from them. Four in the morning is when the KGB went knocking on doors. Least resistance. It\u0027s a biorhythm thing. So we\u0027ll surprise them. We\u0027ll do it at two-thirty.\"\\n\\n \"If you surprise them you don\u0027t have to hit them very hard?\" Yanni said.\\n\\n Reacher shook his head. \"In this situation if we surprise them they won\u0027t hit me very hard.\"\\n\\n \"Where am I going to be?\" Cash asked.\\n\\n \"Southwest corner of the gravel plant,\" Reacher said. \"Looking south and east at the house. You can cover the west and the north sides simultaneously. With your rifle.\"\\n\\n \"OK.\"\\n\\n \"What did you bring for me?\"\\n\\n Cash dug in the pocket of his windbreaker and came out with a knife in a sheath. He tossed it across the room. Reacher caught it. It was a standard-issue Navy SEAL SRK. Their survival-rescue knife. Carbon steel, black epoxy, seven-inch blade. Not new.\\n\\n \"This is it?\" Reacher said.\\n\\n \"All I\u0027ve got,\" Cash said. \"The only weapons I own are my rifle and that knife.\"\\n\\n \"You\u0027re kidding.\"\\n\\n \"I\u0027m a businessman, not a psycho.\"\\n\\n \"Christ\u0027s sake, Gunny, I\u0027ll be taking a knife to a gunfight? Isn\u0027t it supposed to be the other way around?\"\\n\\n \"All I\u0027ve got,\" Cash said again.\\n\\n \"Great.\"\\n\\n \"You can take a gun from the first one you cut. Face it, if you don\u0027t get close enough to cut one of them you aren\u0027t going to win anyway.\"\\n\\n Reacher said nothing.\\n\\n They waited. Midnight. Twelve-thirty. Yanni fiddled with her cell phone and made a call. Reacher ran through the plan one more time. First in his head, then out loud, until everyone was clear. Details, dispositions, refinements, adjustments.\\n\\n \"But we might still change everything,\" he said. \"When we get there. No substitute for seeing the actual terrain.\"\\n\\n They waited. One o\u0027clock. One-thirty. Reacher started to allow himself to think about the endgame. About what would come after the victory. He turned to Franklin.\\n\\n \"Who is Emerson\u0027s number two?\" he asked.\\n\\n \"A woman called Donna Bianca,\" Franklin said.\\n\\n \"Is she any good?\"\\n\\n \"She\u0027s his number two.\"\\n\\n \"She\u0027ll need to be there. Afterward. It\u0027s going to be a real three-ring circus. Too much for one pair of hands. I want you to bring Emerson and Donna Bianca out there. And Alex Rodin, of course. After we win.\"\\n\\n \"They\u0027ll be in bed.\"\\n\\n \"So wake them up.\"\\n\\n \"If we win,\" Franklin said.\\n\\n At one forty-five people started to get restless. Helen Rodin stepped over and squatted down next to Reacher. She picked up the knife. Looked at it. Put it back down.\\n\\n \"Why are you doing this?\" she asked.\\n\\n \"Because I can. And because of the girl.\"\\n\\n \"You\u0027ll get yourself killed.\"\\n\\n \"Unlikely,\" Reacher said. \"These are old men and idiots. I\u0027ve survived worse.\"\\n\\n \"You\u0027re just saying that.\"\\n\\n \"If I get in OK, I\u0027ll be safe enough. Room-to-room isn\u0027t hard. People get very scared with a prowler loose in the house. They hate it.\"\\n\\n \"But you won\u0027t get in OK. They\u0027ll see you coming.\"\\n\\n Reacher dug in his left-hand pocket and came out with the shiny new quarter that had bothered him in the car. Handed it to her.\\n\\n \"For you,\" he said.\\n\\n She looked at it. \"Something to remember you by?\"\\n\\n \"Something to remember tonight by.\"\\n\\n Then he checked his watch. Stood up.\\n\\n \"Let\u0027s do it,\" he said. \\n\\n","sourceLink":"https://allnovel.net/one-shot-jack-reacher-9/page-15.html","bookId":2347,"book":{"id":2347,"title":"One Shot (Jack Reacher #9)","description":"Storyline: One Shot (Jack Reacher #9) \\n Six shots. Five dead. One heartland city thrown into a state of terror. But within hours the cops have it solved: a slam-dunk case. Except for one thing. The accused man says: You got the wrong guy. Then he says: Get Reacher for me. And sure enough, from the world he lives in--no phone, no address, no commitments-ex-military investigator Jack Reacher is coming. In Lee Child\u0027s astonishing new thriller, Reacher\u0027s arrival will change everything--about a case that isn\u0027t what it seems, about lives tangled in baffling ways, about a killer who missed one shot-and by doing so give Jack Reacher one shot at the truth.... \\n The gunman worked from a parking structure just thirty yards away-point-blank range for a trained military sniper like James Barr. His victims were in the wrong place at the wrong time. But why does Barr want Reacher at his side? There are good reasons why Reacher is the last person Barr would want to see. But when Reacher hears Barr\u0027s own words, he understands. And a slam-dunk case explodes. Soon Reacher is teamed with a young defense lawyer who is working against her D.A. father and dueling with a prosecution team that has an explosive secret of its own. Like most things Reacher has known in life, this case is a complex battlefield. But, as always, in battle, Reacher is at his best. \\n Moving in the shadows, picking his spots, Reacher gets closer and closer to the unseen enemy who is pulling the strings. And for Reacher, the only way to take him down is to know his ruthlessness and respect his cunning-and then match him shot for shot.... \"From the Hardcover edition.\"\\n","cover":"https://allnovel.net/images/one-shot-jack-reacher-9.jpg","author":"Lee Child","type":"Mystery","source":"allnovel","link":"https://allnovel.net/one-shot-jack-reacher-9.html","creation":"Oct 5, 2019 8:58:37 AM","modification":"Oct 5, 2019 10:00:34 AM"}}
