{"id":73558,"no":29,"title":"Page 29","content":"Message for Marcia Stanley soon had an expectant audience gathered around him. He hobbled stiffly off the cushion, stood up and took a deep breath. Then he said in a shaky voice, \"First I must ask. Is there anyone here answering to the name of Marcia Overstrand?\" \"You know there is,\" said Marcia impatiently. \"I still have to ask, Your Honor. Part of the procedure,\" said the Message Rat. He continued. \"I am come here to deliver a message to Marcia Overstrand, ex-ExtraOrdinary Wizard - \" \"What?\" gasped Marcia. \"Ex? What does that idiot rat mean, ex-ExtraOrdinary Wizard?\" \"Calm down, Marcia,\" said Aunt Zelda. \"Wait and see what he has to say.\" Stanley carried on, \"The message is sent at seven o\u0027clock in the morning...\" The rat paused to work out just how many days ago it had been sent. As a true professional, Stanley had kept a record of his time imprisoned in the cage by scratching a line for each day on one of the bars. He knew he had done thirty-nine days with Mad Jack, but he had no idea how many days he had spent delirious in front of the fire in Keeper\u0027s Cottage, \"...er ... a long time ago, by proxy, from one Silas Heap residing in the Castle - \" \"What\u0027s proxy mean?\" asked Nicko. Stanley tapped his foot impatiently. He didn\u0027t like interruptions, especially when the message was so old that he was afraid he may not remember it. He coughed impatiently. \"Message begins: Dear Marcia, I hope you are keeping well. I am well and am at the Castle. I would be grateful if you would meet me outside the Palace as soon as possible. There has been a development. I will be at the Palace Gate at midnight, every night, until your arrival. Looking forward to seeing you, With best wishes, Silas Heap \"Message ends.\" Stanley sat back down on his cushion and breathed a sigh of relief. Job done. He may have taken the longest time a Message Rat had ever taken to deliver a message, but he\u0027d done it. He allowed himself a small smile even though he was still on duty. There was silence for a moment, and then Marcia exploded. \"Typical, just typical! He doesn\u0027t even make an effort to get back before the Big Freeze, then, when he finally does get around to sending a message, he doesn\u0027t bother to even mention my KeepSafe. I give up. I should have gone myself.\" \"But what about Simon?\" asked Jenna anxiously. \"And why hasn\u0027t Dad sent a message to us too?\" \"Doesn\u0027t sound much like Dad anyway,\" grunted Nicko. \"No,\" agreed Marcia. \"It was far too polite.\" \"Well, I suppose it was by proxy,\" said Aunt Zelda uncertainly. \"What does proxy mean?\" Nicko asked again. \"It means a stand-in. Someone else gave the message to the Rat Office. Silas must have been unable to get there. Which is to be expected, I suppose. I wonder who the proxy was?\" Stanley said nothing, even though he knew perfectly well that the proxy was the Supreme Custodian. Although no longer a Confidential Rat, he was still bound by the Rat Office code. And that meant all conversations within the Rat Office were Highly Confidential. But the Message Rat felt awkward. These Wizard people had rescued him, looked after him and probably saved his life. Stanley shifted about and looked at the floor. Something was going on, he thought, and he didn\u0027t want to be part of it. This whole message had been a complete nightmare from start to finish. Marcia walked over to the desk and slammed her book shut with a bang. \"How dare Silas ignore something as important as my KeepSafe?\" she said angrily. \"Does he not know that the whole point of an Ordinary Wizard is to serve the ExtraOrdinary Wizard? I will not put up with his insubordinate attitude any longer. I intend to find him and give him a piece of my mind.\" \"Marcia, is that wise?\" asked Aunt Zelda quietly. \"I am still the ExtraOrdinary Wizard and I will not be kept away,\" Marcia declared. \"Well, I suggest you sleep on it,\" said Aunt Zelda sensibly. \"Things always look better in the morning.\" Later that night, Boy 412 lay in the flickering light of the fire, listening to Nicko\u0027s snuffles and Jenna\u0027s regular breathing. He had been woken up by Maxie\u0027s loud snores, which resonated through the ceiling. Maxie was meant to sleep downstairs but he still sneaked up to lie on Silas\u0027s bed if he thought he could get away with it. In fact, when Maxie started snoring downstairs, Boy 412 often gave the wolfhound a shove and helped him on his way. But that night Boy 412 realized that he was listening to something else apart from the snores of a wolfhound with sinus trouble. Creaking floorboards above his head ... stealthy footsteps on the stairs ... the squeak of the second-to-last creaky step ... Who was that? What was that? All the ghost stories that he had ever been told came back to Boy 412 as he heard the quiet swish of a cloak along the stone floor and knew that whoever, or whatever, it was had entered the same room. Boy 412 sat up very slowly, his heart beating fast, and stared into the gloom. A dark figure was moving stealthily toward the book that Marcia had left on the desk. The figure picked up the book and tucked it into its cloak, then she saw the whites of Boy 412\u0027s eyes staring at her out of the darkness. \"It\u0027s me,\" whispered Marcia. She beckoned Boy 412 over to her. He slipped silently out of his quilt and padded across the stone floor to see what she wanted. \"How anyone is expected to sleep in the same room as that animal I do not understand,\" Marcia whispered crossly. Boy 412 smiled sheepishly. He didn\u0027t say that it was he who had pushed Maxie up the stairs in the first place. \"I\u0027m Returning tonight,\" said Marcia. \"I\u0027m going to use the Midnight Minutes, just to make sure of things. You should remember that, the minutes on either side of midnight are the best time to Travel safely. Especially if there are those abroad who may wish you harm. Which I suspect there are. I shall make for the Palace Gate and sort that Silas Heap out. Now, what\u0027s the time?\" Marcia pulled out her timepiece. \"Two minutes to midnight. I will be back soon. Perhaps you could tell Zelda.\" Marcia looked at Boy 412 and remembered that he hadn\u0027t uttered a word since he had told them his rank and number in the WizardTower. \"Oh, well, it doesn\u0027t matter if you don\u0027t. She\u0027ll guess where I\u0027ve gone.\" Boy 412 suddenly thought of something important. He fumbled in the pocket of his sweater and drew out the Charm that Marcia had given him when she had asked him to be her Apprentice. He held the tiny pair of silver wings in his palm and looked at them a little regretfully. They glinted silver and gold in the Magykal glow that was beginning to surround Marcia. Boy 412 offered the Charm back to Marcia - he thought he should no longer have it, since there was no way he was ever going to be her Apprentice - but Marcia shook her head and knelt down beside him. \"No,\" she whispered. \"I still hope you will change your mind and decide to be my Apprentice. Think about it while I\u0027m away. Now, it\u0027s one minute to midnight. Stand back.\" The air around Marcia grew cold, and a shiver of strong Magyk swept around her and filled the air with an electric charge. Boy 412 retreated to the fireside, a little scared but fascinated too. Marcia closed her eyes and started to mutter something long and complicated in a language he had never heard before, and as he watched, Boy 412 saw the same Magykal haze appear that he had first seen when he was sitting in Muriel in the Deppen Ditch. Suddenly Marcia threw her cloak over herself so that she was covered from head to toe, and as she did so, the purple of the Magyk haze and the purple of the cloak mixed together. There was a loud hiss, like water dropping onto hot metal, and Marcia disappeared, leaving only a faint shadow that lingered for a few moments. At the Palace Gate, at twenty minutes past midnight, a platoon of Guards was on duty, just as it had been every night for the past fifty bitterly cold nights. The Guards were frozen and were expecting yet another long boring night doing nothing but stamping their feet and humoring the Supreme Custodian, who had some strange idea that the ex-ExtraOrdinary Wizard was going to turn up right there. Just like that. Of course she never had, and they didn\u0027t expect her to either. But still, every night he sent them out to wait and get their toes frozen into blocks of ice. So when a faint purple shadow began to emerge in their midst, none of the Guards really believed what was happening. \"It\u0027s her,\" one of them whispered, half afraid of the Magyk that suddenly swirled in the air and sent uncomfortable charges of electricity through their black metal helmets. The Guards unsheathed their swords and watched as the hazy shadow composed itself into a tall figure wrapped in the purple cloak of an ExtraOrdinary Wizard. Marcia Overstrand had Appeared right in the middle of the Supreme Custodian\u0027s trap. She was taken by surprise, and without her KeepSafe and the protection of the Midnight Minutes - for Marcia was twenty minutes late - she was not able to stop the Captain of the Guard from ripping the Akhu Amulet from her neck. Ten minutes later Marcia was lying at the bottom of Dungeon Number One, which was a deep, dark chimney buried in the foundations of the Castle. Marcia lay stunned, trapped in the middle of a Vortex of Shadows and Shades that DomDaniel had, with great pleasure, set up especially for her. That night was the worst night of Marcia\u0027s life. She lay helpless in a pool of foul water, resting on a pile of bones of the dungeon\u0027s previous occupants, tormented by the moaning and the screaming of the Shadows and Shades that whirled around her and drained her Magykal powers. It was not until the next morning - when, luckily, an Ancient ghost got lost and happened to pass through the wall of Dungeon Number One - that anyone apart from DomDaniel and the Supreme Custodian knew where she was. The Ancient brought Alther to her, but there was nothing he could do except sit by her and encourage her to stay alive. Alther needed all his powers of persuasion, for Marcia was in despair. In a fit of temper with Silas she knew she had lost everything that Alther had fought for when he deposed DomDaniel. For once again DomDaniel had the Akhu Amulet tied around his fat neck, and it was he, not Marcia Overstrand, who truly was now the ExtraOrdinary Wizard.","sourceLink":"https://allnovel.net/magyk-septimus-heap-1/page-29.html","bookId":2704,"book":{"id":2704,"title":"Magyk (Septimus Heap #1)","description":"Storyline: Magyk (Septimus Heap #1) The seventh son of the seventh son, aptly named Septimus Heap, is stolen the night he is born by a midwife who pronounces him dead. That same night, the baby\u0027s father, Silas Heap, comes across a bundle in the snow containing a new born girl with violet eyes. The Heaps take this helpless newborn into their home, name her Jenna, and raise her as their own. But who is this mysterious baby girl, and what really happened to their beloved son Septimus?","cover":"https://allnovel.net/images/magyk-septimus-heap-1.jpg","author":"Angie Sage","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/magyk-septimus-heap-1.html","creation":"Oct 5, 2019 8:59:10 AM","modification":"Oct 5, 2019 10:27:26 AM"}}
