{"id":102089,"no":16,"title":"Page 16","content":"\"No one motioned for us to sit or offered us anything, and finally the woman told me in German I might take the horses into the stable if I liked. She was staring at me with those slightly wild, red-rimmed eyes, and then her face softened. She told me she\u0027d stand at the inn door for me with a lantern, but I must hurry and leave the child here.\\n\\n \"But something else had distracted me, a scent I detected beneath the heavy fragrance of burning wood and the wine. It was the scent of death. I could feel Claudia\u0027s hand press my chest, and I saw her tiny finger pointing to a door at the foot of the stairs. The scent came from there.\\n\\n \"The woman had a cup of wine waiting when I returned, and a bowl of broth. I sat down, Claudia on my knee, her head turned away from the fire towards that mysterious door. All eyes were fixed on us as before, except for the foreigner. I could see his profile now clearly. He was much younger than I\u0027d thought, his haggard appearance stemming from emotion. He had a lean but very pleasant face actually, his light, freckled skin making him seem like a boy. His wide, blue eyes were fixed on the fire as though he were talking to it, and his eyelashes and eyebrows were golden in the light, which gave him a very innocent, open expression. But he was miserable, disturbed, drunk. Suddenly he turned to me, and I saw he\u0027d been crying.\u0027Do you speak English?\u0027 he said, his voice booming in the silence.\\n\\n \"\u0027Yes, I do,\u0027 I said to him. And he glanced at the others, triumphantly. They stared at him stonily.\\n\\n \"\u0027You speak English!\u0027 he cried, his lips stretching into a bitter smile, his eyes moving around the ceiling and then fixing on mine.\u0027Get out of this country,\u0027 he said.\u0027Get out of it now. Tales your carriage, your horses, drive them till they drop, but get out of it!\u0027 Then his shoulders convulsed as if he were sick. He put his hand to his mouth. The woman who stood against the wall now, her arms folded over her soiled apron, said calmly in German,\u0027At dawn you can go. At dawn.\u0027\\n\\n \"\u0027But what is it?\u0027 I whispered to her; and then I looked to him. He was watching me, his eyes glassy and red. No one spoke. A log fell heavily in the fire.\\n\\n \"\u0027Won\u0027t you tell me?\u0027 I asked the Englishman gently. He stood up. For a moment I thought he was going to fall. He loomed over me, a much taller man than myself, his head pitching forward, then backward, before he righted himself and put his hands on the edge of the table. His black coat was stained with wine, and so was his shirt cuff.\u0027You want to see?\u0027 he gasped as he peered into my eyes.\u0027Do you want to see for yourself?\u0027 There was a soft, pathetic tone to his voice as he spoke these words.\\n\\n \" \u0027Leave the child!\u0027 said the woman abruptly, with a quick, imperious gesture.\\n\\n \"\u0027She\u0027s sleeping,\u0027 I said. And, rising, I followed the Englishman to the door at the foot of the stairs.\\n\\n \"There was a slight commotion as those nearest the door moved away from it. And we entered a small parlor together.\\n\\n \"Only one candle burned on the sideboard, and the first thing I saw was a row of delicately painted plates on a shelf. There were curtains on the small ,window, and a gleaming picture of the Virgin Mary and Christ child on the wall. But the walls and chairs barely enclosed a great oak table, and on that table lay the body of a young woman, her white hands folded on her breast, her auburn hair mussed and tucked about her thin, white throat and under her shoulders. Her pretty face was already hard with death. Amber rosary beads gleamed around her wrist and down the side of her dark wool skirt. And beside her lay a very pretty red felt hat with a wide, soft brim and a \u0027veil, and a pair of dark gloves. It was all laid there as if she would very soon rise and put these things on. And the Englishman patted the hat carefully now as he drew close to her. He was on the verge of breaking down altogether. He\u0027d drawn a large handkerchief out of his coat, and he had put it to his face.\u0027Do you know what they want to do with her?\u0027 he whispered as he looked at me.\u0027Do you have any idea?\u0027\\n\\n \"The woman came in behind us and reached for his arm, but he roughly shook her off.\u0027Do you know?\u0027 he demanded of me with his eyes fierce.\u0027Savages!\u0027\\n\\n \"\u0027You stop now! she said under her breath.\\n\\n \"He clenched his teeth and shook his head, so that a shock of his red hair loosened in his eyes.\u0027You get away from me,\u0027 he said to the woman in German.\u0027Get away from me.\u0027 Someone was whispering in the other room. The Englishman looked again at the young woman, and his eyes filled with tears.\u0027So innocent,\u0027 he said softly; and then he glanced at the ceiling and, making a fist with his right hand, he gasped,\u0027Damn you... God! Damn you!\u0027\\n\\n \"\u0027Lord,\u0027 the woman whispered, and quickly she made the Sign of the Cross.\\n\\n \"\u0027Do you see this?\u0027 he asked me. And he pried very carefully at the lace of the dead woman\u0027s throat, as though he could not, did not wish to actually touch the hardening flesh. Thereon her throat, unmistakable, were the two puncture wounds, as I\u0027d seen them a thousand times upon a thousand, engraved in the yellowing skin. The man drew his hands up to his face, his tall, lean body rocking on the balls of his feet.\u0027I think I\u0027m going mad!\u0027 he said.\\n\\n \"\u0027Come now,\u0027 said the woman, holding onto him as he struggled, her face suddenly flushed.\\n\\n \" \u0027Let him be,\u0027 I said to her. \u0027Just let him be. I\u0027ll take care of him.\u0027\\n\\n \"Her mouth contorted.\u0027I\u0027ll throw you all out of here, out into that dark, if you don\u0027t stop.\u0027 She was too weary for this, too close to some breaking point herself. But then she turned her back on us, drawing her shawl tight around her, and padded softly out, the men who\u0027d gathered at the door making way for her.\\n\\n \"The Englishman was crying.\\n\\n \"I could see what I must do, but it wasn\u0027t only that I wanted so much to learn from him, my heart pounding with silent excitement. It was heartrending to see him this way. Fate brought me too mercilessly close to him.\\n\\n \"\u0027I\u0027ll stay with you,\u0027 I offered. And I brought two chairs up beside the table. He sat down heavily, his eyes on the flickering candle at his side. I shut the door, and the walls seemed to recede and the circle of the candle to grow brighter around his bowed head. He leaned back against the sideboard and wiped his face with his handkerchief. Then he drew a leatherbound flask from his pocket and offered it to me, and I said no.\\n\\n \"\u0027Do you want to tell me what happened?\u0027\\n\\n \"He nodded. \"\u0027Perhaps you can bring some sanity to this place,\u0027 he said.\u0027You\u0027re a Frenchman, aren\u0027t you? You know, I\u0027m English.\u0027\\n\\n \"\u0027Yes,\u0027 I nodded.\\n\\n \"And then, pressing my hand fervently, the liquor so dulling his senses that he never felt the coldness of it, he told me his name was Morgan and he needed me desperately, more than he\u0027d ever needed anyone in his life. And at that moment, holding that hand, feeling the fever of it, I did a strange thing. I told him my name, which I confided to almost no one. But he was looking at the dead woman as if he hadn\u0027t heard me, his lips forming what appeared to be the faintest smile, the tears standing in his eyes. His expression would have moved any human being; it might have been more than some could bear.\\n\\n \"\u0027I did this,\u0027 he said, nodding.\u0027I brought her here.\u0027 And he raised his eyebrows as if wondering at it.\\n\\n \"\u0027No,\u0027 I said quickly.\u0027You didn\u0027t do it. Tell me who did.\u0027\\n\\n \"But then he seemed confused, lost in thought. \u0027I\u0027d never been out of England,\u0027 he started.\u0027I was painting, you see... as if it mattered now... the paintings, the book! I thought it all so quaint! So picturesque!\u0027 His eyes moved over the room, his voice trailing off. For a long time he looked at her again, and then softly he said to her,\u0027Emily,\u0027 and I felt I\u0027d glimpsed something precious he held to his heart.\\n\\n \"Gradually, then, the story began to come. A honeymoon journey, through Germany, into this country, wherever the regular coaches would carry them, wherever Morgan found scenes to paint. And they\u0027d come to this remote place finally because there was a ruined monastery nearby which was said to be a very well reserved place.\\n\\n \"But Morgan and Emily had never reached that monastery. Tragedy had been waiting for them here.\\n\\n \"It turned out the regular coaches did not come this way, and Morgan had paid a farmer to bring them by cart. But the afternoon they arrived, there was a great commotion in the cemetery outside of town. The farmer, taking one look, refused to leave his cart to see further.\\n\\n \"\u0027It was some kind of procession, it seemed,\u0027 Morgan said,\u0027with all the people outfitted in their best, and some with flowers; and the truth was I thought it quite fascinating. I wanted to see it. I was so eager I had the fellow leave us, bags and all. We could see the village just up ahead. Actually it was I more than Emily, of course, but she was so agreeable, you see. I left her, finally, seated on our suitcases, and I went on up the hill without her. Did you see it when you were coming, the cemetery? No, of course you didn\u0027t. Thank God that carriage of yours brought you here safe and sound. Though, if you\u0027d driven on, no matter how bad off your horses were... \u0027 He stopped.\\n\\n \"\u0027What\u0027s the danger?\u0027 I urged him, gently.\\n\\n \" \u0027Ah... danger! Barbarians!\u0027 he murmured. And he glanced at the door. Then he took another drink from his flask and capped it.\\n\\n \" Well, it was no procession. I saw that right off,\u0027 he said.\u0027The people wouldn\u0027t even speak to me when I came up-you know what they are; but they had no objection to letting me watch. The truth was, you wouldn\u0027t have thought I was standing there at all. You won\u0027t believe me when I tell you what I saw, but you must believe me; because if you don\u0027t, I\u0027m mad, I know it.\u0027\\n\\n \"\u0027I will believe you, go on,\u0027 I said.\\n\\n \"\u0027Well, the cemetery was full of fresh graves, I saw that at once, some of them with new wooden crosses and some of them just mounds of earth with flowers still fresh; and the peasants there, they were holding flowers, a few of them, as though they meant to be trimming these graves; but all of them were standing stock-still, their eyes on these two fellows who had a white horse by the bridle-and what an animal that was! It was pawing and stomping and shying to one side, as if it wanted no part of the place; a beautiful thing it was, though, a splendid animal-a stallion, and pure white. Well, at some point-and I couldn\u0027t tell you how they agreed upon it, because not a one of them said a word-one fellow, the leader, I think, gave the horse a tremendous whack with the handle of a shovel,, and it took off up the hill, just wild. You can imagine, I thought that was the last we\u0027d see of that horse for a while for sure. But I was wrong. In a minute it had slowed to a gallop, and it was turning around amongst the old graves and coming back down the hill towards the newer ones. And the people all stood there watching it. No one made a sound. And here it came trotting right over the mounds, right through the flowers, and no one made a move to get hold of the bridle. And then suddenly it came to a stop, right on one of the graves\u0027\\n\\n \"He wiped at his eyes, but the tears were almost gone. He seemed fascinated with his tale, as I was.\\n\\n \"\u0027Well, here\u0027s what happened,\u0027 he continued.\u0027The animal just stood there. And suddenly a cry went up from the crowd. No, it wasn\u0027t a cry, it was as though they were all gasping and moaning, and then everything went quiet. And the horse was just standing there, tossing its head; and finally this fellow who was the leader burst forward and shouted to several of the others; and one of the women-she screamed, and threw herself on the grave almost under the horse\u0027s hooves. I came up then as close as I could. I could see the stone with the deceased\u0027s name on it; it was a young woman, dead only six months, the dates carved right there, and there was this miserable woman on her knees in the dirt, with her arms around the stone now, as if she meant to pull it right up out of the earth. And these fellows trying to pick her up and get her away.\\n\\n \"\u0027Now I almost turned back, but I couldn\u0027t, not until I saw what they meant to do. And, of course, Emily was quite safe, and none of these people took the slightest notice of either of us. Well, two of them finally did have that woman up, and then the other had come with shovels and had begun to dig right into the grave. Pretty soon one of them was down in the grave, and everyone was so still you could hear the slightest sound, that shovel digging in there and the earth thrown up in a heap. I can\u0027t tell you what it was like. Here was the sun high above us and not a cloud in the sky, and all of them standing around, holding onto one another now, and even that pathetic woman... \u0027 He stopped now, because his eyes had fallen on Emily. I just sat there waiting for him. I could hear the whiskey when he lifted the flask again, and I felt glad for him that there was so much there, that he could drink it and deaden this pain.\u0027It might as well have been midnight on that hill,\u0027 he said, looking at me, his voice very low.\u0027That\u0027s how it felt. And then I could hear this fellow in the grave. He was cracking the coffin lid with his shovel! Then out came the broken boards. He was just tossing them out, right and left. And suddenly he let out an awful cry. The other fellows drew up close, and all at once there was a rush to the grave; and then they all fell back like a wave, all of them crying out, and some of them turning and trying to push away. And the poor woman, she was wild, bending her knees, and trying to get free of those men that were holding onto her. Well, I couldn\u0027t help but go up. I don\u0027t suppose anything could have kept me away; and I\u0027ll tell you that\u0027s the first time I\u0027ve ever done such a thing, and, God help me, it\u0027s to be the last. Now, you must believe me, you must! But there, right there in that coffin, with that fellow standing on the broken boards over her feet, was the dead woman, and I tell you... I tell you she was as fresh, as pink \u003dhis voice cracked, and he sat there, his eyes wide, his hand poised as if he held something invisible in his fingers, pleading with me to believe him-`as pink as if she were alive! Buried six months! And there she lay! The shroud was thrown back off her, and her hands lay on her breast just as if she were asleep.\u0027\\n\\n \"He sighed. His hand dropped to his leg and he shook his head, and for a moment he just sat staring.\u0027I swear to you!\u0027 he said.\u0027And then this fellow who was in the grave, he bent down and lifted the dead woman\u0027s hand. I tell you that arm moved as freely as my arm! And he held her hand out as if he were looking at her nails. Then he shouted; and that woman beside the grave, she was kicking at those fellows and shoving at the earth with her foot, so it fell right down in the corpse\u0027s face and hair. And oh, she was so pretty, that dead woman; oh, if you could have seen her, and what they did then!\u0027\\n\\n \"\u0027Tell me what they did,\u0027 I said to him softly. But I knew before he said it.\\n\\n \"\u0027I tell you... \u0027 he said.\u0027We don\u0027t know the meaning of something like that until we see it!\u0027 And he looked at me, his eyebrow arched as if he were confiding a terrible secret.\u0027We just don\u0027t know.\u0027\\n\\n \"\u0027No, we don\u0027t,\u0027 I said.\\n\\n \"\u0027I\u0027ll tell you. They took a stake, a wooden stake, mind you; and this one in the grave, he took -the stake with a hammer and he put it right to her breast. I didn\u0027t believe it! And then with one great blow he drove it right into her. I tell you, I couldn\u0027t have moved even if I\u0027d wanted to; I was rooted there. And then that fellow, that beastly fellow, he reached up for his shovel and with both his arms he drove it sharp, right into the dead woman\u0027s throat. The head was off like that\u0027 He shut his eyes, his face contorted, and put his head to the side.\\n\\n \"I looked at him, but I wasn\u0027t seeing him at all. I was seeing this woman in her grave with the head severed, and I was feeling the most keen revulsion inside myself, as if a hand were pressing on my throat and my insides were coming up inside me and I couldn\u0027t breathe. Then I felt Claudia\u0027s lip against my wrist She was staring at Morgan, and apparently she had been for some time.\\n\\n \"Slowly Morgan looked up at me, his eyes wild.\u0027It\u0027s what they want to do with her,\u0027 he said.\u0027With Emily! Well I won\u0027t let them.\u0027 He shook his head adamantly.\u0027I won\u0027t let them. You\u0027ve got to help me, Louis.\u0027 His lips were trembling, and his face so distorted now by his sudden desperation that I might have recoiled from it despite myself.\u0027The same blood flows in our veins, you and I. I mean, French, English, we\u0027re civilized men, Louis. They\u0027re savages!\u0027\\n\\n \"`Try to be calm now, Morgan,\u0027 I said, reaching out for him.\u0027I want you to tell me what happened then. You and Emily. \u0027\\n\\n \"He was struggling for his bottle. I drew it out of his pocket, and he took off the cap.\u0027That\u0027s a fellow, Louis; that\u0027s a friend,\u0027 he said emphatically.\u0027You see, I took her away fast. They were going to burn that corpse right there in the cemetery; and Emily was not to see that, not while I... \u0027 He shook his head\u0027There wasn\u0027t a carriage to be found that would take us out of here; not a single one of them would leave now for the two days\u0027 drive to get us to a decent place!\u0027\\n\\n \"\u0027But how did they explain it to you, Morgan?\u0027 insisted. I could see he did not have much time left.\\n\\n \"\u0027Vampires!\u0027 he burst out, the whiskey sloshing on his hand.\u0027Vampires, Louis. Can you believe that!\u0027 And he gestured to the door with the bottle. \u0027A plague of vampires! All this in whispers, as if the devil himself were listening at the door! Of course, God have mercy, they put a stop to it. That unfortunate woman in the cemetery, they\u0027d stopped her from clawing her way up nightly to feed on the rest of us!\u0027 He put the bottle to his lips.\u0027Oh... God... \u0027 he moaned. \\n\\n","sourceLink":"https://allnovel.net/interview-with-the-vampire-the-vampire-chronicles-1/page-16.html","bookId":2209,"book":{"id":2209,"title":"Interview with the Vampire (The Vampire Chronicles #1)","description":"Storyline: Interview With The Vampire (The Vampire Chronicles #1) \\n Here are the confessions of a vampire. Hypnotic, shocking, and chillingly erotic, this is a novel of mesmerizing beauty and astonishing force—a story of danger and flight, of love and loss, of suspense and resolution, and of the extraordinary power of the senses. It is a novel only Anne Rice could write.\\n","cover":"https://allnovel.net/images/interview-with-the-vampire-the-vampire-chronicles-1.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/interview-with-the-vampire-the-vampire-chronicles-1.html","creation":"Oct 5, 2019 8:58:27 AM","modification":"Oct 5, 2019 10:10:41 PM"}}
