{"id":44999,"no":14,"title":"CHAPTER XIII FAMILY INFLUENCES IN RELIGION","content":"We saw in the last chapter that the feelings with which The role of parent-regarding feelings in primitive notions concerning the Divine men tend to look upon the holders of the highest earthly dignity and power—the heads of churches, states and empires—are to a large extent derived from those which had originally shaped and coloured the child\u0027s attitude towards its parents. From the position of supreme human authority to that of superhuman power is, in imagination, but one further step; and accordingly we find that the tendencies and emotions connected with the parents can frequently and easily, by a further process of displacement, bridge over the gulf between kings and gods; and, by their association with the ideas of the Superhuman and the Divine, become important factors in moulding the religious feelings of mankind. Apart from this however, reasons for the transfer of many of the parent-regarding emotions to the sphere of religion are not far to seek. There exists a close and obvious correspondence between the attitude of the young child towards his parents and that of man towards the superhuman powers which he personifies as God, the Divine Father. In both cases the individual\u0027s life and destiny are controlled by powers that seem, in comparison with his own puny capacity and understanding, to be immeasurable in their might and mystery. In both cases the health, happiness and even the very existence of the individual seem to be dependent upon the beneficence and approval of these powers; powers which can be terrible, and against which no effort will avail, if once aroused to wrath; but which nevertheless can be to some extent controlled and made to work in harmony with the individual\u0027s needs and[134] desires, if the latter will but conduct himself towards them obediently and with due persuasiveness and understanding. Small wonder then that the adult human being, confronted with the mighty forces of nature, the laws of which he is compelled to follow, if he would avoid destruction, but which—especially if he be ignorant or uncivilised—he cannot comprehend, tends to revert to the attitude of mind in which, in childhood, he looked upon his parents as the forces—equally powerful, as they then seemed, and equally inscrutable—that controlled his fate. In proportion as the child, with increasing age and experience, loses the delusions he had entertained as regards the all-powerfulness, all-knowingness and all-goodness of his parents, he begins to realise, both from his own experience and from instruction and tradition, that there are powers in the Universe which exceed the greatest human might, powers before whom the child\u0027s own parents—together with all other mortals—must acknowledge their own humility and impotence, powers so vast that it may seem only reasonable and befitting to regard the wielder of them as the possessor of those qualities of omnipotence and omniscience that were once, in the crude ignorance of infancy, vaguely attributed to the parents and to other adult persons of importance. The divine and superhuman forces, about which the child thus begins to have some notions, constitute in this way a very natural substitute for the exaggerated and idealised estimation of the parents which the child\u0027s increasing knowledge of human life compels him to abandon, but which he nevertheless, as we have seen (cp. above p. 55), gives up reluctantly. The displacement of the parent-regarding emotions and The divine and the human parent tendencies in this direction is, in the case of the individual, often further facilitated in the three following ways:—(1) owing to the generally pronounced animistic tendency of the primitive mind, the child naturally and indeed inevitably conceives of natural forces in a personal and usually in a human form; (2) the child early learns to conceive of the supreme forces of the Universe as creative—creative on a large scale, just as his own parents and other human beings are creative on a small scale; further he learns that he owes his own creation to God as much as to his own parents—to God ultimately, to his parents proximately; (3) in both these respects the[135] individual tendency to endow the Divinity with attributes derived from the parents is greatly stimulated and reinforced by the suggestive power of religious tradition, working through the channels of direct teaching or of representation in language, literature and art. The correspondence between the divine and the human Remoter ancestors as divine parent substitutes parent is one that, for these reasons among others, is very deeply rooted in the human mind. In an advanced stage of culture it may find its most natural expression in the related concepts of an ultimate and an immediate creator respectively, but at a more primitive mental level it is usually brought into connection with the distinction between remoter ancestors and immediate parents. There can be no doubt that the most important aspects of the theory and practice of religion are very largely derived from, and influenced by, ancestor worship, even though they may not, as Herbert Spencer has contended[162], have entirely originated from this source. Granted the fundamental assumption of animism—the existence of an individual soul or spirit which is to some extent independent of the body and may survive bodily death—it becomes easy to attribute to one\u0027s dead parents or to one\u0027s remoter ancestors powers that exceed those of persons who are still alive. There is not, as in the case of the living, any obvious and well defined limit to their capacity, and it becomes possible therefore to displace freely on to them the exaggerated notions which it is no longer possible to hold with regard to parents who are still subject to the conditions of earthly existence. The tendency which thus arises is reinforced by the very general fear of the dead[163], which easily attributes to its objects an exaggerated power—especially for evil. The more remote[136] the ancestors in time, the more easy does it become to assign to them a power which is manifestly superior to that of the living, though the ideas of the ancestors and of their power necessarily become at the same time more shadowy and vague. The conditions are thus given for a religion of simple Unsatisfying features of simple ancestor worship ancestor worship, such as has existed in very many parts of the world[164] and has often continued to exist alongside of a wider state religion, as for instance in Rome. As a rule however a further step is involved, probably because a simple ancestor worship of this kind is both too indefinite and too individualistic to prove permanently satisfactory, either from the point of view of the individual himself or of the community of which he forms a part. It is too indefinite because it does not provide any sufficiently clear and characteristic object or objects upon which the displaced parent-regarding feelings can be directed; and it is too individualistic because, so long as each family is thrown back solely upon its own ancestors as objects of worship, the religious feelings and tendencies aroused lack the stimulating force which they derive from the co-operation of the herd instinct (in virtue of which the individual is particularly liable to be affected by the emotions to which his fellows give expression)[165] and through which alone, in many cases, religion is able to become a permanent and stable form of expression for the displaced parent-regarding tendencies of childhood and a social force which has proved to be of the greatest importance in the history and development of mankind. For these and other reasons, ancestor worship is not often The All-Father found in its pure and simple form, but is usually complicated and modified in at least two important ways:—(1) a single ancestor is selected as the originator and founder of the family, the high patriarchal attributes being for the most part reserved for him alone; (2) this same ancestor is regarded as the founder, not merely of a single family, but of the whole clan, tribe, nation or other social unit, or, by a further extension, of the whole human race, of all living beings or, ultimately, of the whole Universe. There is thus created the notion of a[137] single All-Father, who serves at once as the supreme and most satisfying embodiment of the father-ideal for the individual and as a potent means of strengthening and uniting the community through the sense of brotherhood and loyalty that attaches to a common worship and a common origin from a divine ancestor. The satisfying character of the religious concept that is here reached is apt to be still further increased by a complete or partial fusion of the notion of the divine father with that of the kingly father which we have already discussed. The mythical divine ancestor, the founder of the race, is frequently supposed to have been originally a king also, and it is usual for the reigning line of sovereigns to trace their descent more especially from him. Very often too the kings, or at any rate the greater ones among them, receive divine honours at their death, being then worshipped along with the other illustrious ancestors of the tribe, having but exchanged their earthly power for a more exalted throne in heaven. It is in the early stages of tribal ancestor worship of the Totemism kind we have been here considering that we come across a widespread social and religious system so curious in nature that it may undoubtedly rank as one of the most remarkable discoveries brought about by the study of primitive man. I refer, of course, to Totemism. In Totemism the mythical ancestor takes on a non-human form, being as a rule some animal, but sometimes also a plant or even an inanimate object. All examples of the totem class are, as a rule, held sacred by those who belong to the respective totem, and must be treated with care and reverence, but (in the case of animal Exogamy totems at any rate) are sometimes killed and eaten at a solemn sacrificial feast. Combined with these religious or quasi-religious manifestations of Totemism there are usually to be found certain well marked features of social organization. A single totem is not, as a rule, common to a whole tribe, but each tribe consists of two or more (most often four, but sometimes as many as eight) totem clans, which are all strictly exogamous, no man being allowed to take a wife from his own clan; the field of choice being indeed sometimes still further restricted, in such a way that the women of only one small section of the total tribe are available for this purpose. The sociological[138] and psychological influences that led to the creation of the totemic system in a number of widely separated parts of the world are still to a large extent a matter of dispute. A number of theories have been propounded on the subject, and although many of them are suggestive, there is perhaps no single one as that fully and satisfactorily accounts for all the facts[166]. Among The totem as a father the few points that emerge clearly from the investigations and discussions to which the matter has given rise is the connection of the totem with the father. It has been shown that the totem spirit regularly, either to a complete or to a partial extent, plays the father\u0027s part in the creation of the child; the substitution of totem for father being rendered easier by the existence of a confused and ignorant state of mind on the subject of paternity; which makes it conceivable that the spirit of an animal or other object should enter into the mother\u0027s womb and thus produce conception[167]. That this vagueness on the subject of paternity in the mind of primitive man finds its counterpart even in civilised societies[168] is shown by the many legends of a supernormal birth in which the father is dispensed with or is replaced by some non-human being[169]. The deep rooted and persistent nature Relics of Totemism in religion of the tendency to totemism is shown also by the very frequent[139] occurrence at all stages of culture of theriomorphic gods, whose cult often leads to certain animals or classes of animals being regarded as sacred, just as in the case of totemic communities. Even when the gods are no longer habitually regarded as animals, they still occasionally take on animal form (cp. the frequent animal disguises of Zeus) or are connected with, or represented by, animal symbols (cp. the dove, the pelican, the and in the individual mind lamb, the fish and the ass in Christianity). In the individual mind of the civilised person animals are frequently utilised as symbols of the parents in dreams and other productions of the Unconscious[170]. There are indeed persons who experience a peculiar fascination for some kind of animal, which they regard with mixed feelings among which love, admiration, awe, disgust and hate are often to be found; those emotions usually predominating which are most prominent in the individual\u0027s relations to his father. Thus in one case well known to the present writer, in which the ideas connected with the father were chiefly those of goodness and wisdom, the hostile aspects being much repressed, the owl was looked upon very much in the light of an individual totem, the solemn stare and pouting figure of the bird appearing to symbolise the kindly beneficence and immense wisdom of the (earthly and heavenly) father—with just so much of mystery and possibility of evil as to add a tinge of awe and horror to the total attitude. Freud[171] and Ferenczi[172] have each reported interesting cases in this connection, in both of which the father-regarding tendencies and emotions had become displaced on to a particular kind of animal (in one case the horse, in the other the fowl) with the result that[140] this animal exercised an intense and persistent fascination, in which opposing elements of love and hate could clearly be distinguished[173]. If, as thus seems probable, we have in Totemism a peculiar The psychological connection between Totemism and Exogamy form of displacement of the feelings originally directed to the parents (and especially the father), it is not surprising that Totemism should be frequently accompanied by manifestations of the other, and sexual, aspect of the ?dipus complex. Such manifestations are, in effect, not far to seek and are in all probability to be found in the system of Exogamy which almost invariably accompanies the institution of Totemism. Whether or not Exogamy is co-eval with Totemism (some authorities think that it is of later origin), there is now a very fair measure of agreement that Exogamy has (consciously[174] or unconsciously) been created as a means of avoiding incest. If this view is correct it would appear that the connection between Totemism and Exogamy (a connection the nature of which had for long been anything but clear) is due to the fact that the two institutions have respectively come into being as the result of the operation of two closely-joined psychic factors, namely the two principal elements of the ?dipus complex. Just as in the individual mind, the presence in any high degree of one of these elements tends to bring about the presence of the other, so too in societies, the manifestations of the one element tend to be closely correlated with the manifestations of the other[175]. In touching on the subject of Exogamy, we have come very near to the most fundamental sociological problems connected with the main theme of this book. To these problems and to the whole question of the meaning of Exogamy we shall return in a later chapter. For the moment we must leave them, in order to pass on to the consideration of certain other[141] aspects of the influence upon religion of psychic tendencies connected with the family. We have seen that the child\u0027s attitude towards his father The ambivalent attitude towards the father as reflected in religion is usually an ambivalent one, i. e. it is determined partly by tenderness and affection and partly by hostility or fear. Naturally the relative predominance of one or other motive varies from one case to another, both as regards the religious life of individuals and as regards the beliefs and forms of worship adopted by various races, nations, sects or denominations. Thus the paternal qualities ascribed to the deity are sometimes derived chiefly from that attitude of the child towards its father in virtue of which it sees in him a being full of helpful wisdom and tender pity, to whom it can turn for encouragement, guidance and assistance in the difficult affairs of life, and especially in times of trouble; sometimes on the other hand more emphasis is laid upon those aspects of the father in which he appears as a severe and perhaps cruel master or tyrant who enforces strict obedience to his harsh commands and who inflicts dire penalties upon all who dare to oppose his wishes or defy his laws. In the higher forms of religion the more directly hostile relations between child and parent are seldom openly manifested, the conception of the father as wicked or immoral tending to disappear with increasing culture, though the notion of obedience to a stern, relentless authority may be maintained. This in its turn however frequently gives place to the idea of the kindly, helpful and forgiving father, according to a process of development which in many respects appears to resemble the evolution of thought as regards the relations of the individual to the state or the king, to which we have already drawn attention. It is a change of this nature for instance that, more perhaps than all else, marks the step from Judaism to Christianity; the latter giving promise of a reign of kindliness and forgiveness in place of the harsh and uncompromising exercise of paternal authority so characteristic of the former. It is for this reason that Christianity (at any rate in its primitive form) especially appealed to and encouraged the poor, the weak and the helpless, those who were most in need of kindness and assistance; and by so doing has encountered the opposition or contempt of those who see the paternal authority (and therefore its projection as the authority[142] of the Universe) in a sterner shape[176], or of those who (like Nietzsche\u0027s Supermen), in their own sense of power and independence, despise all who, as though they were still children, require the assistance of a beneficent father to help them through their lives. In polytheistic religions, or those with polytheistic tendencies, The splitting up of parental attributes among two or more divinities the different paternal qualities may be divided among a number of divinities; though as a rule there is a single heavenly father who combines in his person the most exalted aspects of creative and paternal power. Especially frequent is the splitting up of what appear to be the desirable and undesirable aspects of the father and the attribution of them to distinct deities, so that a kind, benevolent, forgiving and protecting divinity, upon the one hand, is contrasted with a stern, wicked and cruel one upon the other. The mediaeval conception of the Devil corresponds for instance, as has been shown by The Devil Ernest Jones[177] in his suggestive work upon this subject, to a deity thus obtained by the splitting off of the evil attributes of the father; a deity upon whom hatred, fear and even contempt may be freely poured and who can conveniently be made responsible for men\u0027s ill deeds and evil thoughts[178]; the[143] attitude towards the heavenly father being correspondingly purged of these undesirable features. The process of duplication, which is frequently operative in other fields than that of religion, The dissociation of good and evil in theology and in the individual mind particularly in those of myth and legend[179] arises of course as a consequence of the psychical antagonism and resulting dissociation between the love and the hate attitudes towards the father, and can easily be made use of in religion owing to the general correspondence that may appear to exist between the benevolent and malevolent aspects of the all-powerful parent and the equally inexplicable and uncontrollable aspects of the natural forces to which the adult human being is exposed. In this way both the love and the hate elements in the primitive levels of the mind have relatively free play without becoming involved in moral or emotional conflicts or in intellectual contradiction; the double (ambivalent) mental attitude being projected so as to form a dualistic principle of the Universe. Although of all the members of the family, the father, as The mother regarding feelings in religion its head, most frequently and regularly undergoes apotheosis, the other members of the family are not without considerable influence on the conceptions that are formed as to the nature and qualities of divine beings. Foremost as regards such influence, after the father, is of course the mother. In a strict monotheism the mother elements would seem to be almost always, if not invariably, subordinate to those of the father; the former, so far as they are represented at all, being submerged or incorporated into the latter[180]. But very few religions remain[144] strictly and consistently monotheistic; and in most of those that show tendencies towards polytheism the mother elements are represented in a separate person or a separate principle. Thus, both in primitive and in more advanced forms of religion it is usual to find mother goddesses who bear the same relation to the earthly mother as does the father-god to the earthly father. Nevertheless, it would appear that the mother-goddess is, The mother-son relationship and its repression at a certain stage of culture at any rate, liable to meet with opposition from which the corresponding father-god is usually exempt. This opposition would seem to be due to the admixture of incestuous passion which is brought over into religion from the original attachment of the child (and especially of course the son) to his earthly mother. The relations between mother and son fairly often find expression in religious stories, as in the cases of Cybele and Attis, Ishtar and Tammuz, Mary and Christ and (in the displaced form of brother and sister love) Isis and Osiris. As a rule however the mother-son relationship is not permanent but is disturbed and broken by evil plottings and brutal actions on the part of some third person (usually a father or a brother substitute), as a result of which the young son-god often meets with his death. The relations of Attis and of Christ to their mothers are of special interest in this connection, inasmuch as they plainly indicate the existence of an inner inhibition on the son\u0027s part as well as a separation brought about by interference from without. Attis according at least to some versions of his story, unmans himself on discovering the incestuous nature of his affection (as ?dipus himself had done, in a symbolic form, by putting out his eyes). In Christ the repression of the mother-regarding tendencies seems to have led to an attitude of aloofness towards his mother, and through her towards all women (cp. his words \"Woman, what have I to do with thee?,\" John 2, 4)—an attitude that has profoundly affected his followers throughout the ages: for in the history of the Christian religion there is The struggle round the mother element in Christianity evidence—even apart from its notorious aversion from and distrust of women in general—of the existence of a constant[145] struggle centering round the idea of the divine mother. In the early days of the Church there are accounts and rumours of sects which endeavoured to establish the worship of Mary alongside that of the Father and the Son, and there is evidence to show that the notion of the Holy Ghost corresponds in one of its aspects to that of a female deity who completes the natural trinity of Father, Mother and Son[181]. In the Roman Church Mary, as the mother of Christ, has received a widespread and often profound (though to some extent of course unofficial) adoration, being regarded perhaps especially as the helper in time of trouble, to whom men and women may go for comfort, protection, guidance or forgiveness in just the same way as they did to their earthly mother in their childhood: an adoration which has tended to call forth a feeling of disgust and horror in the Protestant Church, in which the more primite Christian tradition of the repression of the mother-regarding feelings has in this respect been kept alive[182]. [146] The doctrine of the Immaculate Conception, which has The Immaculate Conception played such a prominent part in Christian theology and theological discussion, is of course only one of the many similar instances of the notion of the supernatural birth[183]. Like many of these other instances, it is due, not merely to the fact of its being a relic from a time when there was little certainty or knowledge as to the nature of paternity, but to the fact that it constitutes an active expression of a strong (though usually unconscious) wish—a wish that is compounded from a number of separate, though of course related, elements, of which the chief are perhaps the following:—(1) the desire for \"purity\" on the part of the mother, in order that she may belong to the revered rather than to the sexually attractive but despised group of women (cp. above p. 110)—a desire which at the same time purifies the mother-regarding love of its grosser elements and renders it less liable to repression; (2) the desire to be independent of the father and to owe nothing to him (cp. above p. 109); (3) a desire to avoid sexual jealousy of the father together with the envy, hostility or contempt that would inevitably—especially in view of the general Christian attitude towards sex—accompany the notion of the father as a sexually active being. These factors combine to make the idea of sexual relations between the parents one that is peculiarly distasteful to their children, particularly when it is a question not of ordinary human parents with their admitted imperfections but of their heavenly and perfected counterparts, and the doctrine of the Immaculate Conception satisfactorily removes the necessity for this idea[184]. In more primitive forms of religion the correspondence of Open depiction of the parents and of the ?dipus complex in primitive religions the heavenly family to the earthly family and the projection on to the former of the feelings and tendencies aroused in connection with the latter (and particularly those which enter into the ?dipus complex) can as a rule be even more clearly and unmistakably observed. Thus in primitive cosmogonies[185][147] there are usually two world parents whose relations to each other are disturbed by their children, the son as a rule becoming hostile to the father, deposing him from his position of authority, killing or unmanning him or separating him from the mother. Of these world parents the father is very frequently regarded as a personification of the heavens, while the mother is identified with the Earth[186]; Heaven and Earth being sometimes considered as having been separated by their children from the close embrace in which they had previously been lying (as in the case of Atlas, who in this way keeps Heaven apart from Earth—a story which has many parallels, especially in Polynesian Mythology). In the Greek version Ouranos and Gaia (of whom the latter seems to have been the mother of the former, their union being thus incestuous) are separated by their son Cronos, who, at the instigation of his mother, deposes and castrates his father and marries his sisters Cybele, the mother of the gods. In the next generation these barbarous relations between parents and children are repeated. Cronos, fearing that he in his turn will become a victim to the same treatment as that which he himself had accorded to his father, endeavours to escape the threatened danger by eating his children as soon as they are born. Zeus however, being saved by a stratagem of his mother, performs the very act which his father had sought to prevent, and himself becomes firmly seated on the throne of Heaven and is married to his sister Hera. In primitive myths of this kind we see the hostile relations Indications of mental conflict and repression between successive generations displayed crudely and nakedly, without any attempt at disguise or concealment. In others, probably dating from a more cultured epoch, there are signs of a mental conflict, the hostile actions being no longer performed with the same singleness of purpose and freedom from inhibition, but being accompanied by indications of a sense of[148] guilt, or of an ability to understand or sympathise with the opponent\u0027s point of view. In the battle of the Titans against Zeus, some of the former fought on the side of the gods (i. e. Rebellion and punishment defended their parents) and those who rebelled against the paternal power were in the end defeated and punished (though the punishment itself may sometimes—by a piece of over-determination—constitute a continuation of the rebellious deed, as in the above-mentioned case of Atlas); Adam and Eve, on transgressing the divine prohibition to eat of the tree of knowledge (cp. the forbidden question motive, p. 104) are turned out of Eden; the builders of the Tower of Babel (cp. the attempt to storm Heaven by Otos and Ephialtes in Greek mythology) likewise meet with disaster; and in the noble story of Prometheus, who stole the fire[187] from Heaven to benefit mankind, the offender is brought into conflict with the father from the highest motives and bears his punishment with a resignation and fortitude that places him among the most splendid figures in Greek tragedy. Christ himself is only one of the last of the long line of filial insurgents, substituting as he does, to a considerable extent, the milder rule of the Son for the harsher regime of the Judaic Father-God. In so doing he surrenders his life, thus suffering the penalty which, in one form or another, overtook his predecessors. In his case however, as in theirs, the penalty itself is over-determined. Christ dies:—in the first place, as a scapegoat, taking upon himself the guilt of his brothers and hence becoming the saviour of mankind, who are by his sacrifice freed from the consequences of their equal guilt[188]; secondly, as one who suffers the talion punishment for the original sin of the son towards the father, the guilt attaching to the death of the father being wiped out by the death of the son; thirdly, by this very sacrifice manifesting his divine nature and raising himself to a place alongside the father, thus ultimately pointing the way to a reconciliation between father and son (a reconciliation that is already hinted at in the story of Prometheus). [149] Not only religious beliefs, but many religious rites, ceremonies Family influences in religious rites and practices and practices may be shown to be connected with the ideas, feelings and tendencies which centre round the family. We have already seen how the rite of baptism (besides of course its significance as a purification or washing away of sin)[189] is linked on to the ideas of re-birth and initiation, with Baptism and Confirmation all that these imply (cp. above Chs. VIII and IX). Still more intimately connected with the idea of initiation, and corresponding to the initiation ceremonies that are performed at the time of adolescence in so many parts of the world, is the Christian sacrament of Confirmation; which can, appropriately enough, only be conducted by a senior member of the Church (father representative). Of particular interest in this connection is the central rite The Communion of the Christian Church—the sacrament of the Communion[190], which has connections with the practices and beliefs of Totemism, with the widespread religious rite of sacrifice and with the relations between father and son to which we have just had occasion to refer. Although Totemism is by many authorities supposed to Totemic and sacrificial elements in the Communion have been foreign to the culture and religions of those peoples from whom western civilisation has chiefly sprung, Robertson Smith has brought much evidence to show that many of the religious and social practices of the Semitic races bear traces Their psychological significance of totemic origin[191]. Among these not the least important are those connected with sacrifice—animal and human. In animal sacrifice the slaughtered animal was originally regarded as a kinsman[192]; it was also at the same time related to or identified with the god who protected the animal and in whose honour the animal was slain[193]; it was also in many cases regarded with mingled feelings of reverence and horror very similar to those with which the totem animal is often looked upon[194], the Semitic concept of Uncleanness corresponding closely to the [150]Polynesian notion of Taboo. In these respects we have a striking resemblance to Totemism as practised in more primitive communities. Now we have seen that the totem animal is, in one of its most important aspects, a father surrogate. The slaying of the totem animal, therefore, ultimately represents the murder of the father; at the same time the slaughtered animal represents a sacrifice in honour of the father and a gift to him. We have here an example of the ambivalent attitude towards the totem-father; the father, as the God to whom the sacrifice is offered, is honoured and regarded with affection; the father, as the animal, is cruelly killed. At the same time the victim would appear in another aspect to stand as a substitute for the son who, as we have seen, may be slain instead of the father, atoning by his own death for the intended or wished-for murder of the father. As regards the eating of the sacrifice, it may perhaps in one respect be regarded as the consummation of the hostile act. Cronos eats his children in order to be sure of getting rid of them; and the swallowing of children or even of grown men by an ogre, giant, monster or witch is a not uncommon theme in folklore. The eating of the parents by the children in their turn is a natural and obvious form of revenge; and has actually been practised by some primitive people[195]. At the same time eating may be regarded as an honour or as a sign of affection; as is necessarily to some extent the case, since the totem animal represents the god and is itself as a rule sacred and inviolable except in certain circumstances. This aspect indeed obviously plays a part of great importance in the Christian sacrament in its present form[196]. The most important aspect of all however is that in virtue of which the eater is supposed to acquire or to participate in the nature, qualities or properties of that which is eaten, the worshipper thus becoming one with the God whose flesh and blood he consumes; in this way at one and the same time:—(a) himself acquiring directly some of the qualities of the[151] divinity, (b) becoming assured of his kinship with God, the common meal being regarded as the especial symbol of this kinship (as indeed of kinship in general)[197], (c) becoming likewise assured of his kinship with his fellow worshippers, all becoming brothers by participation in the divine meal and in the underlying ideas—including of course the original father hatred and the atonement for this—which this meal implies. Thus it appears that the food which is consumed in the Communion represents:— (1) the Father (a) as hated and killed, (b) as honoured. (2) the Son, as slain to atone for the father-murder and offered up in honour to the Father. The actual consumption of the food represents:— (1) the eating of the Father (a) as a sign of hostility, (b) as a sign of honour or affection, (c) as a means of partaking of the divine nature (i. e. acquiring the father attributes). (2) the eating of the Son, as a means of establishing identity with him and thus sharing in the atonement which he has made by his sacrifice. (3) the establishment of a sense of communion and of kinship between the fellow worshippers themselves and between them and the deity, through participation in the divine meal with all that this implies. We thus see that, as regards both religious beliefs and The influence of family tendencies in religion religious practices, the emotions, feelings and tendencies originally aroused in connection with the family play a part of great importance. The gods in whose form man has personified the natural forces of the Universe, or whom he has himself called into being, are to a very large extent projections of the infantile conceptions of the parents—beings whom he has created in his phantasy to serve as objects on to whom might be transferred that part of what remains of his primitive attitude towards the parents which has found no adequate sublimation on to living human beings. Sometimes the phantasy is worked out entirely in the dramatic form, the desires and tendencies connected with the family finding their projected[152] expression in the behaviour of the divine beings. It is for this reason that the conduct of the gods is, from the moral standpoint, often below rather than above the human standard; the crude and primitive wishes belonging to the infancy of the individual and the race, wishes that so far as adult and civilised life is concerned have been outgrown or at least repressed and held in check, finding a relatively unobstructed outlet in the (usually archaic) forms and ritual of religion. At other times it is only the figures of the gods themselves that are projected, the worshipper remaining himself in intimate contact with them through a relationship which represents a sublimated form of that which existed between child and parent. In spite of its basis in primitive infantile fixations, there Value of religion as a form of displacement can of course be no doubt that religion has performed a work of very great value in the history of human culture. Both in the case of the individual and in that of the race the displacement of the primitive tendencies directed towards members of the family has been, as we have seen, a matter of the greatest importance, but at the same time of the greatest difficulty, in the history of mental and moral development. The provision of a suitable outlet for those parts and aspects of the tendencies in question which could find no adequate object among living human beings was of itself no mean service. The establishment of a moral authority which should stand in the same relation to adult men as parents do to children, thus affording a higher sanction for morality than could otherwise be obtained under primitive conditions; the solidification of the social bond between neighbours and fellow tribesmen, through the consciousness of a common worship and a common parentage from the same divine ancestor; the utilisation of the exaggerated and idealised notions that had been formed concerning the parents in early childhood, to create the concept of a being of more than human virtue, a being who enjoined the nearest possible approach to his own divine perfection on the part of his human followers, thus contributing in no small measure to the raising of the level of morality; the confirmation (through the idealised and sublimated love of the divine parents) of the stage of object-love as contrasted with the lower stage of Narcissism[198];[153] the stimulation of interest in natural forces, objects and events by endowing them with the strong emotional tone originally connected with the parents; these are some (and only some) of the benefits which humanity has derived from the displacement of the primitive parent-regarding feelings that is involved in religion. It is easy of course to point to the numerous evils that religion has directly or indirectly brought about; conservatism,[154] intolerance, persistent opposition to the progress of scientific or unprejudiced thought, the fostering of manifold delusions and absurdities, the retention of vast masses of mankind in superstitious fear and ignorance when they should have been acquiring confidence and knowledge. In spite however of these and of the many other very serious charges that may be brought against it, religion can claim to have played a very necessary and beneficial r?le in the past history of culture. Sublimation is, as we have seen, a process that works slowly and by finely graduated steps, so that neither in the individual nor the race can we expect to see far-reaching moral transformations rapidly and easily achieved. The feelings and tendencies of the child in relation to the family environment are in many of their aspects so primitive and crude and yet so powerful and persistent, that we must welcome gladly any means of displacement that has proved itself of value to the individual and to Society. It is for this service, above all others, that we are indebted to religion in the past. As regards the future, it is evident that the needs of The future of religion humanity to which religion has ministered will, in some sense at any rate, long continue to exist. The backward pull of the tendencies of infancy and childhood, forming, as they do, the foundation upon which all subsequent desires and aspirations are built up; the closeness of the similarity between the situation of the adult confronted with the vast and overwhelming power of Nature and that of the child who helplessly depends upon his parents both for happiness and life—these are influences which may well continue to make religion in some form a permanent necessity. Nevertheless it would appear that the future progress of human culture will demand a very considerable modification and purification of most existing religious forms. The study of the psychology of religion is showing that these forms are, for the most part, based on crude unconscious motives which have to be outgrown and superseded if civilisation is to prosper and advance. In retaining and fostering these forms we are in many cases playing into the hands, not of the higher, but of the baser and more primitive aspects of our nature, aspects which, at our present level of development, it is necessary indeed to understand, but not to venerate or even to approve. Even in[155] so far as the forms of religion give expression not so much to the direct promptings of these baser aspects as to the reactions we have formed against them, it must be remembered that true moral advance lies in sublimation rather than in repression and that so long as the human mind confines itself to the purely negative task of opposing its own primitive tendencies, it will never achieve either true emancipation or true progress[199]. Further, the study of religion shows that the conceptions which religion has formed as to the nature and working of the Universe have arisen as products of the human emotions, having no necessary counterparts in the real world; much the same indeed in this respect as the inventions of the fairy stories and imaginative games of childhood or the day-dreams, romances and novels of a later age. In adult life such phantasies must either be abandoned or, if indulged in, recognised for what they are—productions of the mind which, apart from objective evidence, have no valid claim upon reality. They may indeed guide us in our ideals and aspirations and so lead ultimately to the reconstruction of the outer world through our own efforts, but in themselves they must be held distinct from the order of reality belonging to this outer world. Only so will Man achieve his full stature and be able to play that part in Nature\u0027s scheme of things to which, in virtue of his intellectual powers and his moral aspirations, he appears to be entitled. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2797/77385.html","bookId":1286,"book":{"id":1286,"title":"The psycho-analytic study of the family","description":"简介： The circumstances that have led to the production of this little book are, I think, sufficiently explained in the introductory chapter; there is, therefore, no need to dwell upon them here. It is only necessary perhaps to warn the reader that he will...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2797","creation":"Aug 1, 2019 12:24:48 AM","modification":"Aug 1, 2019 12:24:48 AM"}}
