{"id":45005,"no":20,"title":"CHAPTER XIX ETHICAL AND PRACTICAL APPLICATIONS—DEPENDENCE ASPECTS","content":"All that we have said with regard to the weaning of the Our conclusions with regard to the love and hate aspects hold good for the dependence aspects child from the love relationship that binds him to the family applies with but little alteration to the dependence relationships. During his earliest years the child is necessarily dependent on his parents (or their substitutes) both for the actual means of his subsistence and for guidance and protection. As he grows up however (as we have seen specially in Chapters III and IV) the dependence on his family should gradually diminish, so that at maturity he should be able in most respects to face the world as an independent individual. The duty of the parents, or failing them of the community, The duty of parents to provide for offspring now well recognised in regard to the provision of material necessities for offspring is now sufficiently recognised, so that there is little need to insist upon it here. We may perhaps only suggest in passing that the profound and complex nature of the satisfactions which parents have in their children, and which we had occasion to refer to in Chapter XIV, would very possibly make the communistic rearing of children on a large scale as unsatisfying and inadequate from the point of view of the parents as it would probably be from that of the children themselves. The duty of the parents or their substitutes in the direction The necessity for the gradual loosening of the dependence tie is however not fully realised of gradually weaning the child from his initial condition of dependence has however received less adequate recognition nor has the difficult and delicate nature of this duty been sufficiently appreciated. On the economic and social sides indeed it is admitted that it is incumbent upon parents to[231] provide their children with the means of earning their living and of taking their place generally among their social equals; though with regard to girls the views as to what was necessary as regards education for these purposes has, up till comparatively recently, often been lamentably narrow. In this country there is even now in many quarters a failure to realise the full nature of parental responsibilities with regard to daughters; much less financial provision being frequently made in their case, both for higher and professional education and for the expenses incidental to marriage, than in the case of sons; lack of adequate provision in these respects inevitably tending of course to produce an undue degree of dependence—economical and moral—on the parents. If, on the economic side, the duty of weaning children especially as regards the psychological aspect of this tie from their primitive dependence on the family is thus not yet always fully recognised, the recognition of the corresponding duties on the psychological side is still less complete. Parents are often unwilling to abandon the jurisdiction and control which they have been accustomed to exercise over their children and which may have become very pleasant to them, both as providing an agreeable source of interest and as ministering to their sense of power. Often too in the beginning it may be easier for them to help their children than to let the latter learn to help themselves. Not infrequently also they are directly or indirectly encouraged in this course by the children themselves, who, out of laziness or failure in initiative, prefer that their lives should be regulated by their parents rather than that they should make the effort and take on the responsibility of regulating it themselves. Sometimes, moreover, parents are unwilling to relinquish the management of their childrens\u0027 lives for fear of the disasters that may overtake these latter through ignorance and inexperience; or again because of an exaggerated tenderness which makes them loth to abandon those manifestations of affection which parental assistance may imply. It must be understood however that none of these motives—powerful though some of them may be—provide an adequate excuse for the omission to carry out the weaning process, which, as we have seen, is of such vast importance for the development of the full capacities of the individual. It can scarcely be too frequently emphasised that[232] parents who bring their children up without regard to the necessity of this emancipation are guilty of a very serious neglect of their childrens\u0027 welfare[270]. [233] The danger is perhaps greatest in the case of strong The danger is greatest in the case of parents of strong personality willed, self-assertive and energetic parents, who in any case, as we have seen, are likely to exert a powerful influence over their children, and who, by an undue insistence on the authority which they possess, may easily cripple all initiative on the part of these latter. In parents who themselves are weak and averse from serious effort there is though there may be difficulties also in the case of weak parents naturally less likelihood of this occurring: in such cases the danger lies more frequently in the direction of their devoting too little time, trouble or guidance to their children: or else in their adoption of a changeable and inconsistent attitude—petting, indulging, spoiling and bribing one minute, bullying, nagging and punishing the next; being now overstrict, now easy-going. Here, as in the case of the love-weaning, it is difficult or Necessity of parental readjustment impossible for parents to carry out satisfactorily the steps necessary for the gradual emancipation of their children, except in so far as they are able to make a corresponding readjustment of their own emotions and tendencies. New interests and occupations must gradually take the place of those that formerly centred round the children; otherwise there is likely to arise a blank in the affective life, which may lead to much unhappiness and even to neurosis. In considering the question of the emancipation of children Too prolonged parental jurisdiction is a cause of filio-parental hatred in later life from the authority and influence of their parents, it is well to bear in mind also that it is the exercise of this authority and influence which affords the principal occasion for the development or continuance of the hatred of children towards their parents in adolescent or adult life. The arousal of some hatred in the early years of childhood may indeed be inevitable. Its continuance into later life, with all the misery that this is apt to entail, may probably in nearly every case be avoided, provided that the stage of infantile jealousy has been successfully[234] surmounted and that the child is endowed with something approaching the usual degree of amenability and sympathy with the point of view and susceptibilities of others; the rest is very largely a matter of the careful relaxation of parental authority and of the granting of reasonable and ever increasing amounts of liberty and of opportunity for self-guidance and self-control. What we have here said as regards the necessity for the The dependence of children upon parent-substitutes must also be gradually reduced gradual relaxation of parental control applies of course not only to the parents themselves but to their substitutes—guardians, nurses, teachers and others who are placed in similar positions of trust and authority. There is indeed reason to believe that in these quarters the necessity of emancipation is often more in need of emphasis than among actual parents. Particularly is this the case with regard to certain institutions, where children would seem to be brought up with but little freedom or opportunity to learn the nature and conditions of autonomy or to adapt themselves to the varied circumstances of the outer world. In many of our schools also there is to some extent a lack of proper understanding or application of the principles which demand the gradual relaxation of parental and quasi-parental authority. Though here, as a rule, the evil is in practice less serious than it would at first appear to be; the granting of autonomy and the cultivation of responsibility and self-control in some directions usually compensating in large measure for the petty and foolish restrictions to which adolescent boys and girls, or even fully grown young men and women, are subjected in some of our larger and better known educational establishments. These last considerations point the way to certain wider The ethics of the family must however be brought into connection with wider social questions issues that are connected with the ethics of the family—issues with which we have already been brought face to face in Chapters XIII and XIV, and which we need therefore only refer to here by way of recapitulation. We have seen in these chapters that there exists a correlation between certain aspects or stages of development of the family on the one hand and certain forms of social or ethical institutions or organizations—particularly in the sphere of education, politics and religion—upon the other. Inasmuch as the attitude of the individual towards his teacher, his social or political superior, or his God, is to a very considerable extent derived from, and dependent[235] on, that of the child towards his parent (the former attitude being a displacement of the latter), it is obvious that moral considerations and decisions with regard to the relationship of parent and child cannot altogether be divorced from the wider questions involved in the relations of the individual to his religious, social, and educational environment. Thus it would be, in the main, a foolish and useless proceeding to urge, as we have done, the desirability of a Our ethical conclusions in the two cases must harmonise with one another gradual emancipation of the growing child from the controlling and protecting influences of the parents, unless we are at the same time willing to permit a corresponding growth of autonomy in school and college. Again, if we were right in assuming a connection, on the one hand between a highly developed patria potestas and a relatively stable and unprogressive political condition, and on the other between the relaxation of parental authority and a state of rapid political development and loosening of governmental authority, then it would (in the absence of any counteracting influence) be absurd to demand the complete emancipation of the individual from his family, if at the same time we desired to uphold autocracy in government or to increase the stability of political and social forms. Nor, once more, would the encouragement of children to become independent of their fathers be logically compatible with the maintenance of a religion of the Judaic type, in which the severe and all-powerful Father-God is but a displacement of an earthly father whose stem authority is unquestioned within the bounds of his own family. It must be realised that our attitude in the one case must be brought into harmony with our views in the other. Our ultimate conclusions as to what is desirable within the family must be arrived at only after due consideration of their wider outside bearings; and again, our opinions on these wider issues may profitably be reviewed in the light of the knowledge that is gained by a biological and psychological study of the family. In the present pages we have followed in the main the The extent of this harmony latter course. Nevertheless it would appear that on the whole the conclusions we have arrived at by this method are not in any way seriously incompatible with the general tendencies of contemporary thought. While recognising the necessity and desirability of the family influences in early life, we have for[236] the most part demanded emancipation of the individual from any such growth and retention of these influences as would be liable to hamper or delay his personal development. This is well in harmony with the tendencies which are manifested nowadays towards freedom in education, with the analogous tendencies aiming at the overthrow of autocracy and the establishment of democracy in politics and with the growing toleration and increasing abandonment of the Judaic attitude in religion. In education there would seem to be almost complete in education agreement between the implications of our own conclusions and all the more modern and progressive tendencies in discipline and teaching; it is only with the antiquated remains of systems that are now universally condemned by all reformers that there remain any serious elements of conflict. In religion the agreement is also very considerable, though in religion perhaps less thoroughgoing; there are perhaps many who would still retain the notion of a quasi-anthropomorphic Father-God as an extra-mental reality, even though the purely mental origin of such a God has become apparent. It is in politics however that such discrepancy as there in politics exists is perhaps most apparent. Although the primitive political father—the autocrat—would seem to be rapidly disappearing, it is fairly clear that there exists a tendency to resurrect some of the parental attributes and give them a political application by bestowing them upon the State. The world-war has taught us the necessity of implicit obedience to the State and its representatives—military and civil; the right of independent thought, action and criticism being to a large extent suspended and the minute details of our lives being subject to order and inspection in much the same way as in our childhood they were subject to the supervision of our parents. Again, modern socialistic thought—especially in its cruder aspects—has produced a state of mind, as a result of which the individual becomes to a large extent absolved from the responsibility for his own education, progress and maintenance, or for those of his children. The adult individual is thus led to transfer on to the State that attitude of dependence which he originally adopted in relation to his parents, failing to this extent to attain that full degree of self-reliance and[237] independence which we have had in view in considering the gradual emancipation of children from their parents. In these respects it would seem that the conclusions arrived at in the course of our study of the family would point to a rather larger measure of Individualism than is contemplated by the great body of contemporary political thought. If our conclusions are correct, there is a danger in too wide a ramification of state provision and state control, inasmuch as it is liable to prevent that full development of individual power, initiative and self-reliance which can only be obtained by a high degree of emancipation from the primitive attitude of dependence on the parents. If, on the other hand, it is considered that the advantages of a far-reaching and complex state organization override those attending the full development of individuality, it is obvious that our ethical conclusions with regard to the family may have to be correspondingly revised. There remains but one more set of ethical considerations The individual\u0027s relations to his family in later life to review before we finally take leave of the reader. Supposing that the relations of the individual to his family environment have successfully passed through the stages we have outlined and that the individual has at maturity attained the desirable degree of emancipation from, and independence of, the influences emanating from his family, there remains the problem of defining more precisely the nature of his relations to his family after he has reached maturity. It is evident enough from our previous considerations that these relations will be loose and far from binding. It is also fairly clear that they must be such as to be capable of being broken altogether without causing any very considerable They must be capable of being broken altogether amount of distress or inconvenience to any of the parties concerned. Sooner or later these relations are necessarily broken by the great divider Death, and even before this final and inevitable separation, distance, diversity of occupation or other considerations may place the members of a once closely knit family entirely out of touch with one another. According to our principles it is obviously desirable that these unavoidable though it is natural that some relationship should be maintained separations should involve no element of bitter regret or paralysing sorrow. Supposing however that circumstances are such as to make possible relations of some degree of intimacy between[238] the members of a family, all of whom have reached maturity, what will be the desirable extent and nature of this relationship? Presupposing always a satisfactory previous history on the lines we have considered, there would seem reason to think that some kind of relationship will, and should be, usually maintained. The common interests, affections and associations formed during a lengthy and highly important period of life will, in the absence of reasons to the contrary, usually constitute sufficient ground for the continuance throughout life of the intimacies that have been formed between those who lived so long together and have so long been subject in varying degree to each other\u0027s influence. We must remember, however, that there very often are except where (as often happens) there are definite reasons to the contrary reasons to the contrary. In many cases, for instance, the love or dependence fixations in an individual\u0027s mind are such that continued intimacy with the parents will seriously detract from that individual\u0027s capacity to make the best of life. Frequent meeting with the parents may sap his energy or deprive him of initiative and self-reliance in the manner we have studied: or again, it may cause serious interference with his love life, as where the constant arousal of the not wholly outgrown love impulses to father or mother may appreciably diminish the affection available for husband or wife respectively, thus producing an unhappy marriage. For similar reasons frequent meetings between brothers and sisters may often be disadvantageous. Still more clearly is it undesirable to continue family intimacies where not love but hatred is the predominant tendency aroused and fostered by these intimacies. In such cases it is evident hypocrisy for the parties concerned to meet more often than is absolutely necessary: the frequent stirring up of conscious or unconscious hatred can only cause unhappiness, unprofitable and dangerous mental conflict or deterioration of character; and the more that relatives who are unable to \"get on\" with one another keep apart, the better it will be for all concerned. With these wide and sweeping reservations however, it would probably seem to accord best with psychological and sociological considerations if at any rate some moderate degree of connection be maintained between relatives, whom circumstances have not definitely set apart. Given freedom[239] from all undesirable fixations (whether of hatred or of love), brothers and sisters have at least as good reasons for being permanently helpful and agreeable to one another as have friends who have been intimate with one another in the course of school, college, social or professional life. Still closer perhaps in some ways are the bonds that may permanently unite parents and children. The long period through which they have been bound to one another by ties that are biologically justifiable and necessary would seem to produce a psychological effect that inevitably tends to persist in some degree throughout the remainder of life. The relations of child to parent and of parent to child are so fundamental to all human existence and human intercourse, that most, if not all, of our mental life, in so far as it has reference to our fellow creatures, is to some extent reminiscent of them, or affected by them. We can never root out from our mind the tendencies connected with this most intimate and essential of human connections; and this being so, it would only be in accordance with the most fundamental promptings of our nature to permit a certain proportion of the energy involved in these tendencies to continue to flow in its original direction. This is not to say however that the manifestations of this But the relations between parents and children must undergo profound modification as time passes energy will not undergo considerable alteration as time passes. As children grow up and parents grow older, the former increase, the latter decrease in natural strength and ability of mind and body. In course of time therefore the attitude which parents and children naturally and reasonably adopt towards each other must gradually change to suit the varying conditions. At first children are dependent on the guidance and protection of their parents, who must make the necessary efforts to help and rear their offspring. Later on this differentiated relationship should give place to one in which parents and children are on equal terms. Finally, the original relationships may become to some extent reversed and, if parents and children are still within reach of one another, the former may come to look to the latter for some return of that help and protection that they themselves had previously afforded. In this last situation, we see a form of the relationship, The care of the aged by their children which appears to be peculiar to human society. Throughout the animal world and even in many primitive human communities[240] there is no thought or care or tenderness devoted to old age. The increasing moralisation of human character (in which the relationship between parent and child has probably played a is culturally very desirable leading part) has brought it about that at least some degree of attention is given in all civilised societies to the needs—material and mental—of those who are no longer able fully to support themselves or to carry on their life without assistance. In any society in which the family is a permanent and firmly organised social unit, the duty of caring for the aged will naturally fall to some extent upon their children. This care of elderly, lonely or infirm parents by their children may perhaps legitimately be considered one of the most beautiful and touching expressions of specifically human morality—a point in which Man has definitely risen superior to the conditions of a brutal struggle for existence. As such it both deserves, and stands in need of, every encouragement and support which a developed and enlightened system of practical Ethics can afford. It is not however free from certain ethical difficulties of its own. Thus, it might seem at first as though the care and though it has of necessity its limitations attention that a person of mature age may bestow upon his parents is but a just and reasonable return for the benefits which he himself received from these parents in his infancy and youth. Biologically however the cases are not similar. The care of parents for their young is necessary for the perpetuation of the race. The care bestowed upon the aged and infirm who are no longer able to provide adequately for themselves is of no direct value in the struggle for existence; it may even be a disadvantage in this struggle, a luxury that can only be afforded when the struggle is relaxed or when all competing individuals or races have adopted the practice. Further, from the point of view of the race, the real equivalent that is given in return for the benefits received from parents in early life lies in the corresponding benefits bestowed upon the next generation in its turn, and the double burden of maintaining and caring for both the young and the old may be definitely beyond the powers of many. Fortunately, it but rarely happens, even at the extreme end of a long life, that the old are entirely dependent upon the care and efforts of others. In a civilised society they usually remain permanently able to provide for a considerable[241] Satisfactory family conditions conduce to happiness in old age part of their immediate needs, and the sounder and more stable is their own and the general economic condition, the more is this the case. On the whole it is perhaps rather on the psychological than on the strictly economic side that they will be in need of assistance, and here it is that the principles that have emerged from the study of the facts and tendencies with which we have been concerned in this book may prove of use. In so far as family life is able to proceed and develop on the lines which a true morality based on sound psychological principles and an adequate psychological knowledge would seem to indicate as most desirable, it should be possible for the older members of the family to participate freely in the joys and satisfactions which they may still find within the family circle and to escape the danger of being excluded from these satisfactions, by the disappointments and misunderstandings, or by the unhappiness and bitterness that the faulty development of the family so frequently, and so disastrously, brings in its train. The old tend always to live to some extent vicariously: they find a great part of their interests and their pleasures in the contemplation of the doings of others who are younger than themselves: their own lives are projected into those of their children and their grandchildren, and by means of this projection they enjoy the most natural compensation for the decline of their own personal interests and capacities. If they have found this compensation, it may well be said that life\u0027s concluding chapter has shaped itself for them in a form as satisfactory as any which it is granted to human nature to enjoy. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2797/77391.html","bookId":1286,"book":{"id":1286,"title":"The psycho-analytic study of the family","description":"简介： The circumstances that have led to the production of this little book are, I think, sufficiently explained in the introductory chapter; there is, therefore, no need to dwell upon them here. It is only necessary perhaps to warn the reader that he will...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2797","creation":"Aug 1, 2019 12:24:48 AM","modification":"Aug 1, 2019 12:24:48 AM"}}
