{"id":86824,"no":61,"title":"Page 61","content":"\n “All right. Now I want you to stand.”\n He helped her, because she was a little shaky, and got even more so when he stayed on one knee, looking up at her. He put his hand against her face. “What happened in the parking lot at Surreal won’t ever happen again.”\n She started to shake her head, but he wouldn’t let himself off the hook for it. “It was inexcusable. If you want me as your Master, then you accept and understand that the guilt and blame for that night lies entirely with me.”\n She looked away, tears gathering once more, though she tried to wipe them away with the handkerchief she held in her free hand. She sniffed. “Dana said if you were really sorry, you’d let them tie you up naked, rub you down with kerosene and zap you with a Taser.”\n “Sorry doesn’t mean I’ve taken leave of my fucking senses. Especially when it comes to Reverend Dana. She’s about as bad as you are for taking advantage.”\n She cocked her head. That guarded look was still there, but it had lessened by a significant degree. He’d win her trust back. She was going to give him the chance to do so, thank God. He hadn’t completely fucked it up.\n “Cass said you’d owe me until the day you die, but that you’d made amends with Matt and the others. Something about restoring you to rights with the code of chivalry.” Her silken brow rose, a small smile playing around her soft lips. “What did they make you do?”\n He sighed, looked away. “Not going to tell you.”\n “Yes, you are.” Her slim fingers crept under his jaw, teased his face back toward her. “You find me irresistible. You just told me so.”\n “I said I love you,” he said sternly. “That’s very different.”\n “No. It’s not.” She dimpled, and of course he couldn’t resist her. Besides which, she’d worry it out of him like a terrier digging a rat out of a hole. Jesus, she was going to be so such a pain in his ass. He’d probably lose all his hair before he hit forty. “Tell me.”\n “Nope.”\n “Yes.”\n “No.”\n “Please? Pretty please?” She batted her eyes at him.\n He chuckled. “Do that again and I’ll smack your ass, right here in front of the fish.”\n Of course she batted her eyes again, then shrieked as he rose and tossed her over his shoulder, giving her a resounding slap on her soft buttock. He had to resist the urge to take hold of it, squeeze and enjoy the pleasure of touching what was his. She braced herself with hands curled in his shirt, docile in his hold, conveying that she would give him anything he wanted. It was an effort to put her back on her feet, even more so when her hands remained fastened to him, her body leaning against his. He could tell she was still waiting for an answer. Tenacious female. He relented.\n “I’m not allowed to drink for a year.”\n Her eyes softened, her mouth getting serious, but he didn’t want to take her there. So he gave her the other part of it. The really painful part. “And I gave away my car.”\n “What?” Those eyes widened to saucer shape. “The Mercedes? Your half-a-million-dollar sports car? The high-performance engineering piece of art?”\n “Yeah. Thanks for reminding me. I donated it to the upcoming auction for the new domestic-violence shelter.”\n Marcie’s gaze darkened then, and her hands cupped his face. “Ben, you didn’t…even that night, when you were so angry…I knew you weren’t going to hurt me.”\n “Marcie.” He touched her lower lip. Though faint, the mark was still there where she’d hit the car. “I did hurt you. I laid hands on you in anger. That’s the one thing a Master never does to his sub, and a man never does to a woman. Not ever,” he repeated, underscoring it.\n “You weren’t angry. Not at me.”\n “Which made it even worse. I’m done discussing it,” he said.\n The voice Marcie heard was his Master’s voice, which brought her nerve endings to full alert at once, even as his hand tightened on her wrist. To restrain, not to harm, an entirely different connotation. “It’s done,” he said. “Except for what I owe you.”\n There was no changing certain things about the K\u0026A men, any more than a woman could change the shape of a knight’s heart. She accepted that, loved him all the more for it. “How much will they get for it?” she asked.\n He sighed. “Lewis, legal counsel for Sonoco, will bid on it. Matt sent him an email, telling him it’s up for auction because I lost a bet. He knew Lewis won’t be able to resist rubbing my nose in it, but he’s a good guy—I’ll deny that if you tell him. He’ll bid a fair price. His revenge will probably take care of the shelter’s operating expenses for the next two years.”\n “Or you could bid against him.” She gave him a hopeful expression. “Since you insist that you owe me something, you could buy me your car. Even Cass would agree that’s a sufficient level of remorse.”\n He snorted. “Not likely. I know Cassandra Moira. If I lie down under a convoy of semis, it wouldn’t be sufficient. Plus, you behind the wheel of the McLaren would make me old before my time.”\n “Bet I could drive it faster than you ever have, you big pussy.”\n He slung her back over his shoulder despite her squeal, ignoring her thump on his broad back. Snagging his coat from the ground, he started back down the dock. “I can see all my spare time’s going to be spent teaching you to be a proper slave. After we take care of what I should have given you from the very beginning.”\n “What?” She was trying to look up into his face, working her way around his side like a sinuous python. Once they were off the dock, he let her down, holding her by the waist. With her looking up into his face, wondering, it hit him square in the gut. She was so goddamn beautiful. So strong, so brave, so intelligent. It all underscored what he’d blocked when she was too young for it to be appropriate, the clues he’d ignored… Like how much he’d missed her letters the past two years. Or his punch-in-the-gut reaction when she walked back into his office.\n It all boiled down to one thing—that overwhelming sense that she was his.\n His slave, his submissive. He saw it even now, in the way her eyes searched his face, anticipating what it was he was about to say, what he wanted, how she could serve him. She didn’t realize that the mere fact she was breathing and near was enough for him.\n It was unexpected, and he wasn’t sure he fully trusted it. He’d wanted something like it for so long, but he’d lied to himself over and over, run smoke screens over those yearnings. It was hard to clear all that out in a moment, particularly when he’d spent so much time rebuffing her. Now he was going to have the pleasure of fully embracing what she was offering, and though he was feeling a sharp urgency to get started, his Dom side impatient to fully claim her, he needed some time to adjust to it, to prepare. To make sure the experience was everything she desired and more.\n Still, he’d opened a door, and she wasn’t going to leave it alone. She was such a kid. It almost made him grin. “What should you have given me from the beginning?” she demanded.\n He put the coat back over her shoulders against the incoming evening chill. Then he tucked her under his arm and started back toward the house. They’d set up a pavilion tent and soft music was drifting out from under it, a time for friends and family to relax and reminisce about Jeremy. About the importance of family, whether of blood or the kind that a person was lucky enough to find during his life. He tightened his arm around her.\n “It’s time to make you mine, the way I should have done it the moment you walked into my office. Not tonight, but soon.” He stopped then, faced her. “Are you ready for that, Marcie? You know what belonging to me means.”\n She nodded, quivered under his hands. “Yes, Master. I do. I want that more than anything.”\n “All right then. In three weeks, I’ll send you instructions and you’ll follow them.”\n “Three—” She bit her lip. “All right, Master. Will the others—”\n At his second quelling look, she broke off the question, settled. She wouldn’t always be so malleable, God help him, but he expected that was part of what he loved about her.\n He knew what she’d been about to ask. The other K\u0026A men had always been involved in making a woman part of their circle. He saw no reason for Marcie to be any different, when she obviously wanted that. Yet she was unique to him, to his heart. His, in a way she wouldn’t be to any of the others, even as they contributed to her pleasure. He felt the edge of it in his teeth, like blood to a predator, and had to curb that impatience once again. Not today. She was impatient with the idea of three weeks. She had no idea what that wait was going to do to him, but he was going to do it right.\n Right now, she needed something else from him. She was starting to drag her feet, her eyes on that pavilion ahead. The past week or so had been about arranging all the details, the service. This was the epilogue, a pavilion of people saying goodbye and facing the truth that her older brother was gone. An older brother who’d once been her hero, until he’d become a nightmare.\n They were crossing a footbridge over one of the creeks. When Marcie stopped, listening to the music coming from the pavilion, he stopped with her, giving her time.\n “I’ll Stand By You, by the Pretenders. Cass used to sing that when we were young.” She started to hum it, closing her eyes.\n She opened them when he turned her toward him. Sliding one arm around her waist, he took her other hand in his, against his chest, and began to sway with her. He picked up the hum, going along with it. Hell, people didn’t dance at funerals, but he didn’t really care. She let out a weary sigh, relaxed a little more in his arms.\n He could be here for this, and for every need she had after this moment. She might think he was her Master, holding all the reins, but when push came to shove, he couldn’t deny her anything. \n","sourceLink":"https://allnovel.net/hostile-takeover-knights-of-the-board-room-5/page-61.html","bookId":1904,"book":{"id":1904,"title":"Hostile Takeover (Knights of the Board Room #5)","description":"Storyline: \n Hostile Takeover (Knights of the Board Room #5) \n Ben is the last unattached member of the five-man executive team of K\u0026A Associates. The other four, all Masters, have found the submissive of their dreams. That’s fine. The sharp-edged lawyer knows he’s the most hardcore of all of them, with extreme tastes as a Master he satisfies physically through experienced club submissives. He doesn’t really need anything more than that. \n Marcie has loved Ben since she was sixteen. He’s never behaved as anything more than a protective big brother, a family friend. But now she’s twenty three and starting her career as a corporate investigator. She may be a blood-and-bone deep submissive, but she won’t hesitate to use her aggressive talents to prove she’s meant to be his. With a Master as tough as Ben, she’ll have to take whatever measures are needed—even if her deepest desire isn’t a hostile takeover of his heart, but an unconditional surrender to it.\n \n","cover":"https://allnovel.net/images/hostile-takeover-knights-of-the-board-room-5.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/hostile-takeover-knights-of-the-board-room-5.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:16:13 PM"}}
