{"id":86830,"no":68,"title":"Page 68","content":"\\n\\n “Eyes down, Marcie.”\\n\\n She obeyed, and had the pleasure and anticipation of watching him take that thick cock in his hand. She’d love to watch him masturbate, see how those strong fingers milked seed out of the thick organ. The night he’d told her he was doing that in front of the TV, she imagined him ordering her to stay on her knees next to him, eyes down while he jacked off. Then he’d torment her further by letting her clean him with her tongue, licking his seed off his balls and thighs, the base of his shaft, the broad head.\\n\\n His other arm slid through the ropes, around her waist, palm settling on her buttock to use the ropes’ flexibility to angle her properly for him. It tilted her away from him, so that with her head firmly anchored to the web, she had to strain her gaze to keep looking down as he’d ordered and see as much as she could within that range.\\n\\n He pushed into her pussy, stretching her out with excruciating slowness, that harrowing, almost too-full feeling she’d never tire of experiencing. He kept going until his thighs pressed against the inside of hers. He kept his hand on her ass, but brought the other one back to the side of her neck, fingers twisting in her hair tight. He withdrew, then slid back in, keeping his eyes on hers.\\n\\n No words; none needed. This was a taking, his mouth in that ruthless set, eyes unwavering, and she returned that in full measure, holding the lock, letting him see her helpless pleasure, hear the unintelligible pleas for her Master that broke from her lips, increasing the fire in his eyes. He was building her up to that incredible peak again, and bound as she was, she had no control. He had it all. But it wasn’t a one-sided thing. She could see his total attention on her, how her surrender absorbed him…overwhelmed him, brought him into an untouchable space with her. It was just the two of them, giving, taking, until those two sides were fully twined together, the two of them fused.\\n\\n He came closer, put his mouth on hers. It brought her to life like a detonator. She tried to devour him, would have if she hadn’t been so completely restrained. As it was, she made little crazed sounds in her throat, conveying her madness without words. She needed him, needed him.\\n\\n Oh God, his cock felt good. He was pressed to her now, his chest a broad wall against her bound breasts, pelvis rocking against her thighs. The angle was precarious, narrow, and it rubbed him against her clit in a tiny, teasing touch. In, out. With how thick he was, every thrust and withdrawal made her burn even hotter, the excruciating stretch of his size keeping the climax just out of reach for the moment. Scraping his teeth against hers, he nipped, tongue teasing her lips as he held her head still. He was a master at building an explosion inside a finite space, the pressure becoming so dense until she was sure she’d shatter from the inside out. But she squeezed down on him. She wanted him to come with her, get lost in this, stay in that bubble together.\\n\\n “I love you,” she whispered. “Please come for me, Master.”\\n\\n “You…first.”\\n\\n His voice was satisfyingly hoarse. It infused her with pleasure and power, and she had to hear him come, wanted to know she’d been able to give him that. “Please, Master.”\\n\\n “Always…trying to…argue.” He pulled his lips back from his teeth, maybe a feral grin, maybe a rictus of control, trying to hold back his climax. “Right now, Marcie. Obey your Master. Your pussy is mine. You do what I tell you to do with it…or you won’t be sitting for a week.”\\n\\n Putting his hand between them then, he found her clit. That mere brush of friction and she lost control. She protested, a brief plea, and then she was coming, milking him hard with the spasms, such that she got what she wanted as well. He came right in the middle of her own climax, grunting at the intensity of it, making tears spring to her eyes as his fingers bruised in their hold on her buttock. She liked the idea of those bruises, but it was all part of a whirling vortex of sensation as she screamed out her pleasure once again, her body unable to resist anything he desired of her.\\n\\n He was her Master, after all.\\n\\n When that climax left her, so did every scrap of energy she had. It wasn’t just the physical. There was a haze over her mind, a numb aftermath of ecstasy, a postpartum experience that kept her drifting, malleable, limp. She was aware of him freeing her. He put the collar back on her, as well as the tether. Twining it around his wrist, he lifted her tenderly as a child cradled in his arms. He walked through those thick plastic curtains, and they were in a well-appointed loft apartment with masculine furniture, a big flat-screen, a kitchen full of silver appliances. There were intriguing pieces of art on the walls.\\n\\n Moving across that space, he took her into a large bathroom. She smelled fragrant steam, sensed flickering candlelight.\\n\\n She was shivering, but he stepped into a large Jacuzzi tub, sat down, putting her between his knees, wrapping an arm around her middle and pressing her head back on his shoulder. She didn’t know how long the tub had been running or who had drawn the bath. Jon had likely invented something to keep the water nice and hot.\\n\\n “No talking,” Ben said quietly. “Not unless I give you permission.”\\n\\n She didn’t think she could form words anyway, so that was good. But she drifted around in that haze as he wet her hair, cleaned it, fingers combing, massaging her nape. Then he shifted her around to all fours and attached the tether to a ring on the tub wall to keep her in that position. Using a moisturizing soap, he cleaned her skin, then followed that up with a warming oil he worked all over her body, paying particular attention to her joints and muscles. Her nipples still held that steel bar, replaced by him, and it was a provocative weight in her all-fours position. Then he turned his attention to her pussy and ass.\\n\\n He cleaned her thoroughly, embarrassingly so, then worked in more soothing oils, spreading her legs out farther, making her whimper at the ripples of response he started. She was so sensitive, as if that climax had permanently awoken nerve endings that responded with jolts of pleasure to his every touch.\\n\\n Unhooking the tether, he spoke in a quiet rumble against her ear. “Put your arms around me, baby.”\\n\\n She did, and he lifted her out of the tub, taking her to her knees on a stack of soft towels. He used a couple others to dry her while she leaned against the inside of his right leg. He massaged her head for a long time, almost putting her to sleep. She could barely keep her head up by the time he combed her hair, but he steadied her chin with one hand.\\n\\n “Didn’t think…you did this.”\\n\\n When his fingers stilled, she realized she’d spoken aloud. “Sorry,” she mumbled. “Didn’t mean to talk.”\\n\\n “I’ll give you a pass on that one. Tell me what you meant.”\\n\\n She laid her head on his bare thigh, managed to lever her gaze open enough to see he’d donned a pair of short, clingy boxers. She could see the size of him beneath it, the generous curve of his balls, and she wanted to touch, nip. Squeeze. She took a steadying breath. “I guess…because of how you are, I thought you’d have somebody else handle aftercare.”\\n\\n “Hand you off like a serving girl who’s met my needs?”\\n\\n “Something like that. Which is kind of a turn-on, the psych…sic…psychology of it.” She fumbled with her thick tongue. “But I like this even better.”\\n\\n “I like this too.” He braided her hair into two tails, wrapped them together and used a band to hold them back off her face. Sensing he was gathering his thoughts, she didn’t speak.\\n\\n “In the not-too-distant future, I will take you to the K\u0026A boardroom and allow the others to pleasure you there. It’s another little tradition we have.”\\n\\n She knew that, thanks to Dana’s provocative description. Savannah and Cass had both experienced the full sensual onslaught of the five K\u0026A men in their boardroom, before either had committed their hearts to their respective Masters. Dana and Rachel had enjoyed it later. For Dana it had been a special birthday present; for Rachel, her first wedding anniversary.\\n\\n In the short time Marcie had been working for Ben, she hadn’t had the chance to sneak in and check it out, but from Dana she knew the K\u0026A boardroom had some ingenious engineering, thanks to Jon’s aptitude and the other men’s imaginations. It was the ultimate adult Transformer, the table, screens and cameras able to serve an entirely different purpose when the men desired them to do so.\\n\\n “I decided not to do that tonight,” Ben continued. He stroked her hair, a more tender touch that drew her eyes up to his serious face. “For a long time,” he said quietly, holding her gaze, “I rejected the possibility of someone belonging to me totally, of serving me the way I wanted. My demands can be extreme, so I learned to behave as if I didn’t want that. But what I really wanted, always wanted, was someone to belong to me fully. Like this. I wanted to prepare her from head to toe, take care of everything, because you’re mine, entirely. To care for, to punish, to pleasure. This first time, I wanted you to experience that in a more personal space. A space that was mine alone.”\\n\\n Her heart cracked open. “What can your slave do for you now?” she whispered.\\n\\n “Whatever I demand.” His hands remained gentle, despite the intriguing threat. “But she has a choice to make first.”\\n\\n Reaching toward a drawer, he opened it, removed a carved wooden box. When he flipped it open, her heart jumped in her throat and stayed there.\\n\\n It was a collar. Simple, elegant stainless steel, with a key-pin-locking mechanism and matching cuffs. She’d seen a variety of more complex and decorative collars, but in a blink she understood that this meshed with the type of Master Ben was. Something that made it clear in no uncertain terms that this was a collar and cuffs for his property, his submissive. There was an etching on each. Three forget-me-nots. As she tilted the collar toward the light, her eyes stung. Always yours was etched on the inside.\\n\\n He met her gaze. “Last chance, Marcie. I put these on, you’re mine, irrevocably. You’ve been a student of who and what the K\u0026A men are for a long time. You’re my choice, and that’s forever. You put these on, you take them off only when I give you permission to do so, and that’s probably only going to be for their cleaning and care.” \\n\\n","sourceLink":"https://allnovel.net/hostile-takeover-knights-of-the-board-room-5/page-68.html","bookId":1904,"book":{"id":1904,"title":"Hostile Takeover (Knights of the Board Room #5)","description":"Storyline: Hostile Takeover (Knights of the Board Room #5) \\n Ben is the last unattached member of the five-man executive team of K\u0026A Associates. The other four, all Masters, have found the submissive of their dreams. That’s fine. The sharp-edged lawyer knows he’s the most hardcore of all of them, with extreme tastes as a Master he satisfies physically through experienced club submissives. He doesn’t really need anything more than that. \\n Marcie has loved Ben since she was sixteen. He’s never behaved as anything more than a protective big brother, a family friend. But now she’s twenty three and starting her career as a corporate investigator. She may be a blood-and-bone deep submissive, but she won’t hesitate to use her aggressive talents to prove she’s meant to be his. With a Master as tough as Ben, she’ll have to take whatever measures are needed—even if her deepest desire isn’t a hostile takeover of his heart, but an unconditional surrender to it.\\n","cover":"https://allnovel.net/images/hostile-takeover-knights-of-the-board-room-5.jpg","author":"Joey W. Hill","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/hostile-takeover-knights-of-the-board-room-5.html","creation":"Oct 5, 2019 8:58:07 AM","modification":"Oct 5, 2019 5:16:13 PM"}}
