{"id":3127,"no":31,"title":"Chapter 31","content":"They met once, Mr. and Mr. Kumar, the baker and theteacher. The first Mr. Kumar had expressed the wish to seethe zoo. \"All these years and I\u0027ve never seen it. It\u0027s so closeby, too. Will you show it to me?\" he asked. \n \"Yes, of course,\" I replied. \"It would be an honour.\" Weagreed to meet at the main gate the next day after school. \n I worried all that day. I scolded myself, \"You fool! Why didyou say the main gate? At any time there will be a crowd ofpeople there. Have you forgotten how plain he looks? You\u0027llnever recognize him!\" If I walked by him without seeing him‘he would be hurt. He would think I had changed my mindand didn\u0027t want to be seen with a poor Muslim baker. Hewould leave without saying a word. He wouldn\u0027t be angry – hewould accept my claims that it was the sun in my eyes – buthe wouldn\u0027t want to come to the zoo any more. I could see ithappening that way. I had to recognize him. I would hide andwait until I was certain it was him, that\u0027s what I would do. ButI had noticed before that it was when I tried my hardest torecognize him that I was least able to pick him out. The veryeffort seemed to blind me. \n At the appointed hour I stopd squarely before the main gateof the zoo and started rubbing my eyes with both hands. \n \"What are you doing?\"It was Raj, a friend. \n \"I\u0027m busy.\"\"You\u0027re busy rubbing your eyes?\"\"Go away.\"\"Let\u0027s go to Beach Road.\"\"I\u0027m waiting for someone.\"\"Well, you\u0027ll miss him if you keep rubbing your eyes likethat.\"\"Thank you for the information. Have fun on Beach Road.\"\"How about Government Park?\"\"I can\u0027t, I tell you.\"\"Come on.\"\"Please, Raj, move on!\"He left. I went back to rubbing my eyes. \n \"Will you help me with my math homework, Pi?\"It was Ajith, another friend. \n \"Later. Go away.\"\"Hello, Piscine.\"It was Mrs. Radhakrishna, a friend of Mother\u0027s. In a fewmore words I eased her on her way. \n \"Excuse me. Where\u0027s Laporte Street?\"A stranger. \n \"That way.\"\"How much is admission to the zoo?\"Another stranger. \n \"Five rupees. The ticket booth is right there.\"\"Has the chlorine got to your eyes?\"It was Mamaji. \n \"Hello, Mamaji. No, it hasn\u0027t.\"\"Is your father around?\"\"I think so.\"\"See you tomorrow morning.\"\"Yes, Mamaji.\"\"I am here, Piscine.\"My hands froze over my eyes. That voice. Strange in afamiliar way, familiar in a strange way. I felt a smile welling upin me. \n \"Salaam alaykum, Mr. Kumar! How good to see you.\"\"Wa alaykum as-salaam. Is something wrong with youreyes?\"\"No, nothing. Just a bit of dust.\"\"They look quite red.\"\"It\u0027s nothing.\"He headed for the ticket booth but I called him back \"No,no. Not for you, master.\"It was with pride that I waved the ticket collector\u0027s handaway and showed Mr. Kumar into the zoo. \n He marvelled at everything, at how to tall trees came tallgiraffes, how carnivores were supplied with herbivores andherbivores with grass, how some creatures crowded the dayand others the night, how some that needed sharp beaks hadsharp beaks and others that needed limber limbs had limberlimbs. It made me happy that he was so impressed. \n He quoted from the Holy Qur\u0027an: \"In all this there aremessages indeed for a people who use their reason.\"We came to the zebras. Mr. Kumar had never heard ofsuch creatures, let alone seen one. He was dumbfounded. \n \"They\u0027re called zebras,\" I said. \n \"Have they been painted with a brush?\"\"No, no. They look like that naturally.\"\"What happens when it rains?\"\"Nothing.\"\"The stripes don\u0027t melt?\"\"No.\"I had brought some carrots. There was one left, a large andsturdy specimen. I took it out of the bag. At that moment Iheard a slight scraping of gravel to my right. It was Mr. \n Kumar, coming up to the railing in his usual limping and rollinggait. \n \"Hello, sir.\"\"Hello, Pi.\"The baker, a shy but dignified man, nodded at the teacher,who nodded back. \n An alert zebra had noticed my carrot and had come up tothe low fence. It twitched its ears and stamped the groundsoftly. I broke the carrot in two and gave one half to Mr. \n Kumar and one half to Mr. Kumar. \"Thank you, Piscine,\" saidone; \"Thank you, Pi,\" said the other. Mr. Kumar went first,dipping his hand over the fence. The zebra\u0027s thick, strong,black lips grasped the carrot eagerly. Mr. Kumar wouldn\u0027t letgo. The zebra sank its teeth into the carrot and snapped it intwo. It crunched loudly on the treat for a few seconds, thenreached for the remaining piece, lips flowing over Mr. Kumar\u0027sfingertips. He released the carrot and touched the zebra\u0027s softnose. \n It was Mr. Kumar\u0027s turn. He wasn\u0027t so demanding of thezebra. Once it had his half of the carrot between its lips, he letgo. The lips hurriedly moved the carrot into the mouth. \n Mr. and Mr. Kumar looked delighted. \"A zebra, you say?\"said Mr. Kumar. \"That\u0027s right,\" I replied. \"It belongs to thesame family as the ass and the horse.\"\"The Rolls-Royce of equids,\" said Mr. Kumar. \n \"What a wondrous creature,\" said Mr. Kumar. \n \"This one\u0027s a Grant\u0027s zebra,\" I said. \n Mr. Kumar said, \"Equus burchelli boehmi.\"Mr. Kumar said, \"Allahu akbar.\"I said, \"It\u0027s very pretty.\"We looked on. \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/1841/53349.html","bookId":122,"book":{"id":122,"title":"少年派的奇幻漂流 Life of Pi","description":"简介： 少年派遇到一次海难，家人全部丧生，他与一只孟加拉虎在救生小船上漂流了227天，人与虎建立起一种奇特的关系，并最终共同战胜困境获得重生。...","cover":"http://novel.tingroom.com/file/upload/201707/24/15-28-28-36-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1841","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
