{"id":3147,"no":51,"title":"Chapter 51","content":"But that first time I had a good look at the lifeboat I didnot see the detail I wanted. The surface of the stern and sidebenches was continuous and unbroken, as were the sides ofthe buoyancy tanks. The floor lay flat against the hull; therecould be no cache beneath it. It was certain: there was nolocker or box or any other sort of container anywhere. Onlysmooth, uninterrupted orange surfaces. \n My estimation of captains and ship chandlers wavered. Myhopes for survival flickered. My thirst remained. \n And what if the supplies were at the bow, beneath thetarpaulin? I turned and crawled back. I felt like a dried-outlizard. I pushed down on the tarpaulin. It was tautly stretched. \n If I unrolled it, I would give myself access to what suppliesmight be stored below. But that meant creating an openingonto Richard Parker\u0027s den. \n There was no question. Thirst pushed me on. I eased theoar from under the tarpaulin. I placed the lifebuoy around mywaist. I laid the oar across the bow. I leaned over the gunneland with my thumbs pushed from under one of the hooks therope that held down the tarpaulin. I had a difficult time of it. \n But after the first hook, it was easier with the second and thethird. I did the same on the other side of the stem. Thetarpaulin became slack beneath my elbows. I was lying flat onit, my legs pointed towards the stern. \n I unrolled it a little. Immediately I was rewarded. The bowwas like the stern; it had an end bench. And upon it, just afew inches from the stem, a hasp glittered like a diamond. \n There was the outline of a lid. My heart began to pound. Iunrolled the tarpaulin further. I peeked under. The lid wasshaped like a rounded-out triangle, three feet wide and two feetdeep. At that moment I perceived an orange mass. I jerkedmy head back. But the orange wasn\u0027t moving and didn\u0027t lookright. I looked again. It wasn\u0027t a tiger. It was a life jacket. \n There were a number of life jackets at the back of RichardParker\u0027s den. \n A shiver went through my body. Between the life jackets,partially, as if through some leaves, I had my first,unambiguous, clear-headed glimpse of Richard Parker. It washis haunches I could see, and part of his back. Tawny andstriped and simply enormous. He was facing the stern, lying flaton his stomach. He was still except for the breathing motion ofhis sides. I blinked in disbelief at how close he was. He wasright there, two feet beneath me. Stretching, I could havepinched his bottom. And between us there was nothing but athin tarpaulin, easily got round. \n \"God preserve me!\" No supplication was ever morepassionate yet more gently carried by the breath. I layabsolutely motionless. \n I had to have water. I brought my hand down and quietlyundid the hasp. I pulled on the lid. It opened onto a locker. \n I have just mentioned the notion of details that becomelifesavers. Here was one: the lid was hinged an inch or sofrom the edge of the bow bench – which meant that as thelid opened, it became a barrier that closed off the twelve inchesof open space between tarpaulin and bench through whichRichard Parker could get to me after pushing aside the lifejackets. I opened the lid till it fell against the crosswise oar andthe edge of the tarpaulin. I moved onto the stem, facing theboat, one foot on the edge of the open locker, the otheragainst the lid. If Richard Parker decided to attack me frombelow, he would have to push on the lid. Such a push wouldboth warn me and help me fall backwards into the water withthe lifebuoy. If he came the other way, climbing atop thetarpaulin from astern, I was in the best position to see himearly and, again, take to the water. I looked about the lifeboat. \n I couldn\u0027t see any sharks. \n I looked down between my legs. I thought I would faint forjoy. The open locker glistened with shiny new things. Oh, thedelight of the manufactured good, the man-made device, thecreated thing! That moment of material revelation brought anintensity of pleasure – a heady mix of hope, surprise, disbelief,thrill, gratitude, all crushed into one – unequalled in my life byany Christmas, birthday, wedding, Diwali or other gift-givingoccasion. I was positively giddy with happiness. \n My eyes immediately fell upon what I was looking for. \n Whether in a bottle, a tin can or a carton, water isunmistakably packaged. On this lifeboat, the wine of life wasserved in pale golden cans that fit nicely in the hand. DrinkingWater said the vintage label in black letters. HP Foods Ltd. \n were the vintners. 500 ml were the contents. There werestacks of these cans, too many to count at a glance. \n With a shaking hand I reached down and picked one up. Itwas cool to the touch and heavy. I shook it. The bubble of airinside made a dull glub glub glub sound. I was about to bedelivered from my hellish thirst. My pulse raced at the thought. \n I only had to open the can. \n I paused. How would I do that? \n I had a can – surely I had a can opener? I looked in thelocker. There was a great quantity of things. I rummagedabout. I was losing patience. Aching expectation had run itsfruitful course. I had to drink now – or I would die. I couldnot find the desired instrument. But there was no time foruseless distress. Action was needed. Could I prise it open withmy fingernails? I tried. I couldn\u0027t. My teeth? It wasn\u0027t worthtrying. I looked over the gunnel. The tarpaulin hooks. Short,blunt, solid. I kneeled on the bench and leaned over. Holdingthe can with both my hands, I sharply brought it up against ahook. A good dint. I did it again. Another dint next to the first. \n By dint of dinting, I managed the trick. A pearl of waterappeared. I licked it off. I turned the can and banged theopposite side of the top against the hook to make anotherhole. I worked like a fiend. I made a larger hole. I sat backon the gunnel. I held the can up to my face. I opened mymouth. I tilted the can. \n My feelings can perhaps be imagined, but they can hardlybe described. To the gurgling beat of my greedy throat, pure,delicious, beautiful, crystalline water flowed into my system. \n Liquid life, it was. I drained that golden cup to the very lastdrop, sucking at the hole to catch any remaining moisture. Iwent, \"Ahhhhhh!\", tossed the can overboard and got anotherone. I opened it the way I had the first and its contentsvanished just as quickly. That can sailed overboard too, and Iopened the next one. Which, shortly, also ended up in theocean. Another can was dispatched. I drank four cans, twolitres of that most exquisite of nectars, before I stopped. Youmight think such a rapid intake of water after prolonged thirstmight upset my system. Nonsense! I never felt better in mylife. Why, feel my brow! My forehead was wet with fresh,clean, refreshing perspiration. Everything in me, right down tothe pores of my skin, was expressing joy. \n A sense of well-being quickly overcame me. My mouthbecame moist and soft. I forgot about the back of my throat. \n My skin relaxed. My joints moved with greater ease. My heartbegan to beat like a merry drum and blood started flowingthrough my veins like cars from a wedding party honking theirway through town. Strength and suppleness came back to mymuscles. My head became clearer. Truly, I was coming back tolife from the dead. It was glorious, it was glorious. I tell you, tobe drunk on alcohol is disgraceful, but to be drunk on water isnoble and ecstatic. I basked in bliss and plenitude for severalminutes. \n A certain emptiness made itself felt. I touched my belly. Itwas a hard and hollow cavity. Food would be nice now. Amasala dosai with a coconut chutney – hmmmmm! Evenbetter: oothappam! HMMMMM! Oh! I brought my hands tomy mouth – IDLI! The mere thought of the word provoked ashot of pain behind my jaws and a deluge of saliva in mymouth. My right hand started twitching. It reached and nearlytouched the delicious flattened balls of parboiled rice in myimagination. It sank its fingers into their steaming hot flesh… Itformed a ball soaked with sauce… It brought it to my mouth…I chewed… Oh, it was exquisitely painful! \n I looked into the locker for food. I found cartons of SevenOceans Standard Emergency Ration, from faraway, exoticBergen, Norway. The breakfast that was to make up for ninemissed meals, not to mention odd tiffins that Mother hadbrought along, came in a half-kilo block, dense, solid andvacuum-packed in silver-coloured plastic that was covered withinstructions in twelve languages. In English it said the rationconsisted of eighteen fortified biscuits of baked wheat, animalfat and glucose, and that no more than six should be eaten ina twenty-four-hour period. Pity about the fat, but given theexceptional circumstances the vegetarian part of me wouldsimply pinch its nose and bear it. \n At the top of the block were the words Tear here to openand a black arrow pointing to the edge of the plastic. Theedge gave way under my fingers. Nine wax-paper-wrappedrectangular bars tumbled out. I unwrapped one. It naturallybroke into two. Two nearly square biscuits, pale in colour andfragrant in smell. I bit into one. Lord, who would havethought? I never suspected. It was a secret held from me: \n Norwegian cuisine was the best in the world! These biscuitswere amazingly good. They were savoury and delicate to thepalate, neither too sweet nor too salty. They broke up underthe teeth with a delightful crunching sound. Mixed with saliva,they made a granular paste that was enchantment to thetongue and mouth. And when I swallowed, my stomach hadonly one thing to say: Hallelujah! \n The whole package disappeared in a few minutes, wrappingpaper flying away in the wind. I considered opening anothercarton, but I thought better. No harm in exercising a littlerestraint. Actually, with half a kilo of emergency ration in mystomach, I felt quite heavy. \n I decided I should find out what exactly was in the treasurechest before me. It was a large locker, larger than its opening. \n The space extended right down to the hull and ran some littleways into the side benches. I lowered my feet into the lockerand sat on its edge, my back against the stem. I counted thecartons of Seven Ocean. I had eaten one; there were thirty-oneleft. According to the instructions, each 500-gram carton wassupposed to last one survivor three days. That meant I hadfood rations to last me – 31 X 3 – 93 days! The instructionsalso suggested survivors restrict themselves to half a litre ofwater every twenty-four hours. I counted the cans of water. \n There were 124. Each contained half a litre. So I had waterrations to last me 124 days. Never had simple arithmeticbrought such a smile to my face. \n What else did I have? I plunged my arm eagerly into thelocker and brought up one marvellous object after another. \n Each one, no matter what it was, soothed me. I was so sorelyin need of company and comfort that the attention brought tomaking each one of these mass-produced goods felt like aspecial attention paid to me. I repeatedly mumbled, \"Thank you! \n Thank you! Thank you!\" \n \n \n","sourceLink":"http://novel.tingroom.com/kehuan/1841/53400.html","bookId":122,"book":{"id":122,"title":"少年派的奇幻漂流 Life of Pi","description":"简介： 少年派遇到一次海难，家人全部丧生，他与一只孟加拉虎在救生小船上漂流了227天，人与虎建立起一种奇特的关系，并最终共同战胜困境获得重生。...","cover":"http://novel.tingroom.com/file/upload/201707/24/15-28-28-36-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1841","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
