{"id":3169,"no":73,"title":"Chapter 73","content":"My greatest wish – other than salvation – was to have abook. A long book with a never-ending story. One I could readagain and again, with new eyes and a fresh understandingeach time. Alas, there was no scripture in the lifeboat. I was adisconsolate Arjuna in a battered chariot without the benefit ofKrishna\u0027s words. The first time I came upon a Bible in thebedside table of a hotel room in Canada, I burst into tears. Isent a contribution to the Gideons the very next day, with anote urging them to spread the range of their activity to allplaces where worn and weary travellers might lay down theirheads, not just to hotel rooms, and that they should leave notonly Bibles, but other sacred writings as well. I cannot think ofa better way to spread the faith. No thundering from a pulpit,no condemnation from bad churches, no peer pressure, just abook of scripture quietly waiting to say hello, as gentle andpowerful as a little girl\u0027s kiss on your cheek. At the very least, if I had had a good novel! But there wasonly the survival manual, which I must have read ten thousandtimes over the course of my ordeal. I kept a diary. It\u0027s hard to read. I wrote as small as I could. I was afraid I would run out of paper. There\u0027s not much to it. Words scratched on a page trying to capture a reality thatoverwhelmed me. I started it a week or so after the sinking ofthe Tsimtsum. Before that I was too busy and scattered. Theentries are not dated or numbered. What strikes me now ishow time is captured. Several days, several weeks, all on onepage. I talked about what you might expect: about things thathappened and how I felt, about what I caught and what Ididn\u0027t, about seas and weather, about problems and solutions,about Richard Parker. All very practical stuff.","sourceLink":"http://novel.tingroom.com/kehuan/1841/53422.html","bookId":122,"book":{"id":122,"title":"少年派的奇幻漂流 Life of Pi","description":"简介： 少年派遇到一次海难，家人全部丧生，他与一只孟加拉虎在救生小船上漂流了227天，人与虎建立起一种奇特的关系，并最终共同战胜困境获得重生。...","cover":"http://novel.tingroom.com/file/upload/201707/24/15-28-28-36-1.jpg","type":"Science Fiction","link":"http://novel.tingroom.com/kehuan/1841","creation":"Aug 1, 2019 12:18:19 AM","modification":"Aug 1, 2019 12:18:19 AM"}}
