{"id":99779,"no":3,"title":"Page 3","content":"“Jax!”\\n\\n At first, I think I’m imagining the call, but I look over my shoulder and spot Doc crossing the hangar yard, Evelyn not far behind him. No. No, no, no, no. Looking backward, I stumble, and Hit pulls me on, not looking back. She didn’t hear. Better if I hadn’t, then I wouldn’t know the collateral damage.\\n\\n “Run!” I scream, but it’s too late. “Saul, run!”\\n\\n They’re almost to the skiff now. Doc glances up, then takes Evelyn’s hand. Even from this distance, I can see his resolve. Tears stream down my face; I suspect I’m to blame. The light expands, swallowing the ground, leaving me with a picture of their last moments in my mind’s eye. We reach the outer edges of the burning trees as the explosion rocks the hangar yard. I don’t see them die, but I feel it in my bones. Even at this distance, the impact sends us flying head over ass toward the fires deeper in the jungle. I land in the shallows of the river that feeds my mother’s water stores and lie there for a moment, my blood washing out into the current. I flex my fingers in the water, stunned, and watching the ribbons of red trail away. An orphaned quote stirs in my mind—wars, terrible wars, and the Tiber foaming with so much blood. I can’t remember where I read it or who wrote it first, but it seems apropos.\\n\\n “The Morgut caught our signal this time,” Hit guesses, pushing upright.\\n\\n “Doc and Evie were back there. I think our message drew them out of hiding.” There’s no way to be sure, of course, but nothing else makes sense. Afterward, I wish I hadn’t said anything.\\n\\n Pain and grief dawns in her dark eyes; I can tell she gets it. Our survival came at the cost of theirs, and they possessed brilliant, inimitable scientific minds. I consider now the cost to future progress, and the promise I made to Loras going unfulfilled. I shake my head, but I can’t change this. I can only bear the scars, as I have always done, as I ever do.\\n\\n Doc saved my life so many times over the turns. He comforted me, and he gave me the strength to go on when I faltered. In some ways, he was like a friend and father combined. And the loss of his calm logic and his kind heart might beggar me. Evie, I hadn’t known as well, but she had the good sense to love him. She had been brave and stoic, a worthy companion, if only he’d had time to get over Rose’s death.\\n\\n But neither has any time now. Pain wells up in a crimson rush.\\n\\n “We didn’t know,” she says softly, and I take her hand as we kneel in the river, our tears spilling with the fast-flowing water.\\n\\n Those brief moments are the only ones we can allow for grief; mourning must come later. For we’re cut off, no way to know if our warnings have been heeded or if the rest of our loved ones survive. Now we’re completely alone.\\n\\n CHAPTER 3\\n\\n “I wish we knew what’s going on up there.” Despite the smoke, I don’t break from the cover of the trees in case the Morgut send armed drone ships for recon.\\n\\n “Me, too.”\\n\\n Hit stands with a hand shading her eyes, peering up through the blackened canopy as if she can pierce the foliage, the cloud cover, and the barrier of the atmosphere to see the battle overhead with the naked eye. I sympathize with her desperation; like me, she doesn’t know if her lover survived the battle, and we both carry the knowledge that we lived when Doc and Evelyn did not. It’s absurd and senseless. Silently, we push deeper into the jungle and look for a place to hide.\\n\\n Rescue will come, I tell myself. We’re not simply waiting for the Morgut to finish conquering Venice Minor.\\n\\n “Here,” I say eventually.\\n\\n Though covered in moss and vines, the shelter looks like an old groundskeeper’s hut. At first, I wonder if there’s a comm panel in there, but we shouldn’t risk another message, even if there is. We don’t want them blowing up this location, too. Humidity makes the door stick, swollen from the dampness in the air, but with some effort, Hit shoves it open. Inside, it’s dim and hot, moist with mildew.\\n\\n “Think there are any spores in here?” she asks.\\n\\n “Hope not.” If they take root in our lungs, we could be in deep trouble without proper medical facilities and no idea when—or if—help is coming. Bluerot is one of the many strains of fungus that can thrive in the human body; I’d rather not test the nanites to that degree.\\n\\n Even the faint light can’t disguise the derelict nature of the place. Spiders have long since laid claim, and the hammock has been chewed to strings, which now hang in forlorn rags. Otherwise, nothing lives here but dirt and mold, certainly no comm. I imagined a hero’s welcome when we returned from grimspace. There would be furious screaming first, of course, followed by obligatory punishment. And then everyone would cheer . . . because what we did, nobody’s ever done before. Yet here we are, hiding from the battle. There are no ships to steal, no help to summon. From Hit’s expression, that doesn’t sit any better with her.\\n\\n “As soon as you feel up to it, we’re getting out of here.”\\n\\n I nod. Wearily, I sink down onto the floor and lean my head back against the wall; I can’t feel the rumble of the bombs anymore. On the surface, that seems like it’s a good thing, but I imagine them raining down on innocent tourists. Their dying screams fill my head, and I feel raw, as if I’m at fault for them, too. So many restless ghosts. When I close my eyes, I see Doc and Evelyn, joining hands at the last. They seemed so small against the destruction raining down upon them—two souls, surrounded by burnt metal and flaming wreckage. They had no chance. No chance at happiness. It’s beyond wrong that a man of peace should become a casualty of war.\\n\\n “I should’ve found some way to stop this.”\\n\\n “Yeah? How?” Her tone is kind enough, but her expression reveals impatience. “I know we’re not as close as you and Dina, but I figure there will never be a better time for some straight talk.\\n\\n “You’ve let March get inside your head so you don’t see things like a normal person anymore. He has this epic sense of personal responsibility, and you’ve let that become your code as well. Honest to Mary, I don’t see how you could’ve done more. This guilt is a joke, and it’s exhausting to watch you martyr yourself. Now shut the frag up and get some rest, so we can hike out of here.”\\n\\n “Yes, ma’am.”\\n\\n I’m too weary and heartsick to sleep, but I don’t burden Hit. She’s right; it’s tremendous ego to think I could’ve prevented this. And for the first time, I accept that maybe war was coming even if I hadn’t toppled the Corp. It might just be Farwan fighting the Morgut now, instead of the Conglomerate.\\n\\n But Doc and Evie? I am all but positive that was me. I sent that second signal because I wanted March to be safe so much that I didn’t contemplate the risk. I was afraid he’d jump before the message I bounced to Tarn went out as general orders, so I acted to save the Dauntless. I don’t know for sure that Doc heard our message, but I can’t imagine what else drew them out at precisely that time. I don’t believe in coincidence, which means I’m guilty.\\n\\n I wish it wasn’t true. They’re too smart, too vital, to be gone. Part of me hopes beyond reason that this is a dreadful mix-up. Eventually we’ll find out that they’re not lost, vaporized beneath the infernal heat of Morgut weapons—that Doc found somewhere to hide, where the bombs couldn’t touch him—but I know what I saw in those last moments. There is no mistake, and denial solves nothing.\\n\\n On the Triumph, just before I left, he was red-eyed, eyes burning with pain. Doc’s raw grief when he lost Rose, the woman who had loved him all their lives, threatened to make him do something stupid. I had feared enough for his life that I put the AI on watch. My only consolation in this fragged-up mess is that Evelyn loved Saul, no matter the ambivalence of his own heart, so at least they were together at the end, and he did not die alone.\\n\\n Despite my sad spirit, I try to get some rest, and as we sit in silence, rain drums on the roof. By nightfall, I’m ready to move, but it’s going to be a miserable march. At least I studied maps of the immediate area, the last time we were here; before coming up with the plan to steal the shuttle, we debated hiking out on foot, despite the dangerous fauna.\\n\\n “There’s a city fifty-five kilometers northeast of here.”\\n\\n My mother never traveled there, of course. Not when she had a villa with her own private hangar. There was no reason. Remembering Ramona gives me a little pang, as I must count her among the heroic dead. She surprised me at the end. Surprised the whole galaxy, I guess. She would be so furious right now to see what the Morgut have done to the place. I can almost hear her saying, And that’s the trouble with foreigners, Sirantha.\\n\\n “By the time we get there, the Morgut may have reduced it to rubble.”\\n\\n Yeah, I’m aware. But I don’t know what else to do. Our personal comms don’t have the range to signal far enough to do us any good. I’m not even sure if Tarn got my message or if the whole fleet has been lost. Mary, I hope not. In that scenario, killing would be too good for me.\\n\\n “But there’s a better chance of us finding functioning equipment there.”\\n\\n Hit consults her handheld and gets us started in the right direction. With nothing more to say, we stick to the cover of the jungle. Animals snarl in the darkness, calls and cries that raise gooseflesh on my arms. At least the rain has put out the fires, though damaged branches come crashing down with the weight of the water. I learn to stay light on my feet, avoiding the deadfall as it drops from the canopy. The downpour doesn’t let up, so before long, we’re both soaked to the skin.\\n\\n “In this weather,” Hit said, “we could be walking most of the night.”\\n\\n “No shortage of water, at least.”\\n\\n She flashes me a fleeting, rueful smile. The night passes in a tangle of dark leaves, near misses with the native fauna, and sheer exhaustion. It’s not cold, but the wet sinks into my bones, making me feel as though I’ll never remember what it’s like to be comfortable again. Still we keep moving, and at daybreak, the rain stops.\\n\\n Hit shoots a furred thing with too many eyes and teeth as it leaps toward us from the branches above. The animal falls with a thud, revealing green-spotted fur. I’ve never seen anything like it, but she kneels, slices it open, and checks the meat.\\n\\n “We can eat it,” she says. “If we must.”\\n\\n Dear Mary. I’ve never eaten fresh flesh.\\n\\n “Wouldn’t we need to cook it? That would slow us down.”\\n\\n She nods. “Point.”\\n\\n I’m just as glad it worked out this way. I don’t want to see how things get turned into food, even if this beast tried to eat us first. We walk on and leave it behind for some other creature to feast on.\\n\\n Eventually, we come to a point where we can’t continue, and we rest, rolled up in giant leaves. Insects bite me as I try to sleep, tortured by images of Doc and Evelyn. Worry over March haunts me, but I force myself to relax, one muscle at a time. Hit takes the first watch.\\n\\n Creatures prowl around our campsite, some smaller than the one we killed. Others sound bigger, but they won’t close as long as we can find dry wood for a fire. I don’t rest well, even when I’m not on guard duty. The need to locate freshwater and forage slows our travel; but as we can, Hit and I keep moving toward Castello, the capital of Venice Minor. \\n\\n","sourceLink":"https://allnovel.net/aftermath-sirantha-jax-5/page-3.html","bookId":1650,"book":{"id":1650,"title":"Aftermath (Sirantha Jax #5)","description":"Storyline: Aftermath (Sirantha Jax #5) \\n DEAD HEROES GET MONUMENTS. LIVE ONES GET TRIALS. \\n Sirantha Jax has the right genes—ones that enable her to “jump” faster-than-light ships through grimspace. But it’s also in her genetic makeup to go it alone. It’s a character trait that has gotten her into—and out of—hot water time and time again, but now she’s caused one of the most horrific events in military history… \\n During the war against murderous, flesh-eating aliens, Sirantha went AWOL and shifted grimspace beacons to keep the enemy from invading humanity’s homeworld. The cost of her actions: the destruction of modern interstellar travel—and the lives of six hundred Conglomerate soldiers. \\n Accused of dereliction of duty, desertion, mass murder, and high treason, Sirantha is on trial for her life. And only time will tell if she’s one of the Conglomerate’s greatest heroes—or most infamous criminals…\\n","cover":"https://allnovel.net/images/aftermath-sirantha-jax-5.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/aftermath-sirantha-jax-5.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:45:56 PM"}}
