{"id":99785,"no":9,"title":"Page 9","content":"I hold up my right hand, and say, “I do.”\\n\\n In the next hour, in her office lab, she strips away most of my humanity and all of my dignity. The ordeal starts with a battery of tests, some more invasive than others. She ret-scans me, tests my blood and DNA. She’s quick and competent, at least, comparing the processed samples with what they already have on file. I don’t see the point.\\n\\n At my look, Carlotta explains, “It’s to make sure you’re Sirantha Jax. Sometimes wealthy defendants hire a stand- in willing to do their time in exchange for a payout.”\\n\\n Now, there’s an idea. If only I’d thought to have a double waiting in the wings. But I’m grateful she explained the situation to me; the guards treated me like I’m less than self-willed, a package to deliver. After she finishes, she scans me thoroughly, then a frown builds between her brows, and she isn’t a pretty woman to start with. Her protuberant forehead hangs heavy over deep-set eyes, giving her a primitive look.\\n\\n “You have a lot of implants.”\\n\\n I shrug. That’s not illegal unless I use them to avoid incarceration.\\n\\n She hands me a datapad. “Please describe the nature and purpose of each.”\\n\\n As requested, I take it and tap in the information. She skims, then asks, “Two pieces of experimental tech? How can we validate the truth of your claims?”\\n\\n “Commander March can verify.”\\n\\n Right now, she only knows about the regulatory implant and my language chip. For obvious reasons, I didn’t mention the nanites. Those don’t show up on routine checks, and I can only imagine what she’d say if she found out.\\n\\n “Pardon me,” she says.\\n\\n A privacy partition goes up around her desk, and the rest of her office goes into lockdown, just in case I take the notion to try to go back out the way I came. Because leaving would be that simple. With my nerves becoming more ragged with each moment, I wait for the verdict. When she finishes, she doesn’t tell me what he said, but she does approve my implants and move forward.\\n\\n “I’d like to hire counsel now,” I say.\\n\\n “Not my department. We’re finished.”\\n\\n Then Carlotta turns me over to a team in masks and white coveralls. I tell myself this is part of the process, meant to break me down and change my perception of myself as a free being. Knowing that doesn’t help fight their practiced strategies, though; fear prickles through me, past my resolve. I thought I’d faced every horrible thing the universe had to offer. Yet right now, I don’t feel prepared for this.\\n\\n “Strip,” orders a disembodied voice. “And put your clothing in the chute.”\\n\\n I obey. It’s cold in the white room, so my skin pimples, my scars purpling beneath the harsh overhead lights. The team in white watches me through the glastique from the other side of the wall; I presume it’s standard decon procedure in case someone finds a way to breach the chamber. Robotic brushes drop from the ceiling and scour me from head to toe. Sometimes the pressure hurts, but the shame is worse. Water sprays from everywhere, blinding me. Then they treat me with chemical sanitizer; I recognize the lemony scent. I’m sure it’s become SOP because they drag some fugitives out of truly foul and hellish hiding places. So everyone has to be clean before they come in. That, and it hammers home how completely you’ve lost control of everything. Hope leaves me then; it’s a pale, fluttering thing against the far wall. I watch it go through the stinging of my eyes.\\n\\n “Proceed.”\\n\\n The door opens at the far end, and I stumble, naked and bleary-eyed, into another area, where I find prison garb waiting—gray pants and shirt, dingy underwear. They’ve given me slippers, too, and there are no ties or fasteners that I could use to hurt myself . . . or anyone else.\\n\\n “You have two minutes to dress.”\\n\\n Frag. This place makes Perlas Station look like a bowl of choclaste cream. I scramble into my new togs, realizing they’ve effectively isolated me from my old life in a surprisingly short time. A woman dressed as a guard enters then; she’s the oldest person I’ve seen in the facility, with a face hard as hewn rock.\\n\\n “Bend forward and lift your hair.”\\n\\n A sharp pinch steals my breath. “What did you do?”\\n\\n “Imprinted your identification number. It comes with a tracking chip, so don’t even think about running. This way now.”\\n\\n Without another word, she leads me down a grim hallway. Overhead, the indestructible glastique covers the lights, nothing a prisoner could break for use as a weapon. There are no cracks or seams in the walls either; they’ve been poured in one slab out of a cement polymer that can’t be broken with less than ten thousand pounds of pressure. Glowing arrows on the floor light our path.\\n\\n The guard stops outside a plain white door. “When it opens, step inside. Failure to comply with any commands given by jurisprudence personnel will result in behavioral correction.”\\n\\n That sounds worse than dream therapy. I acknowledge her words with a weary nod and do as I’m told. Inside my cell, it’s just as bleak: gray walls, a bunk, and that’s all. I assume I’ll be taken to meals and to use the facilities, but when I ask, the woman just grunts at me.\\n\\n “I wish to hire a barrister,” I repeat, this time to my guard, as she’s leaving.\\n\\n “I’ll pass that along,” she says in the same tone as frag off.\\n\\n The door closes, lock engaged, alarm armed. No way out. This has to be a violation of my rights; I should be permitted to consult with legal counsel before being locked away. Yet based on the scene at the spaceport, I can’t deny the situation is volatile. It’s possible they’ve put me here for my protection. Since there’s nothing else to do, I lie down on the bunk and stare up at the ceiling.\\n\\n Hours pass in this fashion, or at least I think they do. Eventually, I sleep, and awaken to a polite, AI voice. “Please stand back from the door, prisoner 838.”\\n\\n I have a number now; she imprinted it on the back of my neck. As instructed, I remain where I am.\\n\\n It’s a different guard this time, also female. She appears to be in late middle age without any signs of Rejuvenex treatments. Her body is heavy and strong, more than a match for me, should I get any ideas.\\n\\n “The jurisprudence center employs a large human workforce,” I note.\\n\\n “Bots can be hacked and reprogrammed. People can’t.”\\n\\n But they can be bribed. Wisely, I don’t say this aloud.\\n\\n She goes on, “Follow me.”\\n\\n I see no point in asking where we’re going; it isn’t like I have any choice over my movements henceforth. Resistance will just earn me behavioral correction. So I follow her down the bleak gray hall. At the four-way, she makes a left turn and leads me to a set of security doors. The locks in place require a code, her pass card, and a ret-scan. Once she finishes, we pass through and into what looks like a visiting center.\\n\\n For the first time, I see other prisoners in stalls made of more unbreakable glastique, where they can be supervised at all times.\\n\\n “Hold out your hands,” the guard orders. When I comply, she shackles them at the wrists. “You will be permitted fifteen minutes for legal consultation. Second booth to the left.”\\n\\n Puzzled, I head toward the stall she indicated, and the door pops open at my approach. So everything is automated. I don’t recognize the woman waiting for me; she’s sharply tailored in black with her brown hair pinned up in a complicated arrangement. Impossible to say how old she is, but she bears the smooth, ageless look I associate with Ramona, which means she’s had top-notch Rejuvenex treatments. If nothing else, it says she’s a capable barrister because she can afford them.\\n\\n Her clothes are real fabric, another mark that she’s high- priced, and they’ve been hand-altered to fit her perfectly—nothing straight out of a wardrober for this woman. I admit it adds to her aura of perfect confidence. She stands as she notices me but doesn’t offer a hand to shake. Instead, she turns her face up to the ceiling.\\n\\n “Please turn off all monitoring software at this time. I’m invoking counsel-client privilege.”\\n\\n “Acknowledged,” replies the imperturbable AI. “Switching to visual human surveillance only.”\\n\\n I step into the stall and take a seat opposite her at the table that has been formed out of glastique. There are no loose parts in here, either, just as in the halls and in the cell, nothing that could instigate an escape—a well-designed prison, this one. She consults her handheld.\\n\\n “Thanks for joining me, Ms. Jax. I’m Nola Hale, and I’ve been hired to defend you against all criminal charges.”\\n\\n “By who?”\\n\\n “Irrelevant. As we have only a short time, I’d prefer to be efficient.”\\n\\n I nod. “What do you need to know?”\\n\\n “Everything. But we don’t have time for that today. I intend to defend you pursuant to Title 19.”\\n\\n “What does that mean?”\\n\\n “That everything you did, you did with executive authority. Did Tarn tell you that your mission was of the utmost importance?”\\n\\n “He may have.” Honestly, at this moment, I can’t remember.\\n\\n “Under Title 19, in times of war, the chancellor may commission an agent to act on behalf of the Conglomerate in its best interests, disregarding all other legislation and jurisdictions in order to act for the greater good. Such an agent cannot be held accountable for lesser crimes, if the discharged duty was, in fact, imperative for the Conglomerate’s survival.”\\n\\n “So you intend to argue that I was so commissioned.”\\n\\n “It will be enough if I can convince the tribunal that you believed you were acting with executive authority.”\\n\\n “Do you believe that?”\\n\\n “It doesn’t matter what I believe,” Ms. Hale says briskly. “But I will ask this: Did you believe you were preserving the Conglomerate’s interests?”\\n\\n I consider the bombing on Venice Minor and imagine the consequences if the Morgut had reached New Terra. “Absolutely.”\\n\\n “Good. My job is easier. I only have to create doubt, whereas the prosecution must prove guilt.”\\n\\n “That doesn’t sound simple.”\\n\\n “Don’t worry about that. Just let me do my job. Now, I need you to tell me about every conversation you can remember with Chancellor Tarn, and, after that, I need to hear about your mission to change the beacons.”\\n\\n That’s a lot of talking, and before I’m halfway done relating everything I can recall about Tarn and his various orders, a buzzer goes off.\\n\\n The barrister stands. “Our time’s up. I’ll be back to hear the rest, and then we’ll talk again once I lay the foundation for your defense.”\\n\\n “How long before my trial?”\\n\\n “Ordinarily, it could take months, even turns, but they need to process you quickly. They’re rioting outside already . . . It will be madness if it’s permitted to escalate.”\\n\\n “Rioting?” I pause on my way out. “Why?”\\n\\n “Some want the death penalty. Others want you freed. It’s a polarizing case.”\\n\\n “Can you win?”\\n\\n “If anyone can,” she answers without false modesty. “See you soon, Ms. Jax.” \\n\\n","sourceLink":"https://allnovel.net/aftermath-sirantha-jax-5/page-9.html","bookId":1650,"book":{"id":1650,"title":"Aftermath (Sirantha Jax #5)","description":"Storyline: Aftermath (Sirantha Jax #5) \\n DEAD HEROES GET MONUMENTS. LIVE ONES GET TRIALS. \\n Sirantha Jax has the right genes—ones that enable her to “jump” faster-than-light ships through grimspace. But it’s also in her genetic makeup to go it alone. It’s a character trait that has gotten her into—and out of—hot water time and time again, but now she’s caused one of the most horrific events in military history… \\n During the war against murderous, flesh-eating aliens, Sirantha went AWOL and shifted grimspace beacons to keep the enemy from invading humanity’s homeworld. The cost of her actions: the destruction of modern interstellar travel—and the lives of six hundred Conglomerate soldiers. \\n Accused of dereliction of duty, desertion, mass murder, and high treason, Sirantha is on trial for her life. And only time will tell if she’s one of the Conglomerate’s greatest heroes—or most infamous criminals…\\n","cover":"https://allnovel.net/images/aftermath-sirantha-jax-5.jpg","author":"Ann Aguirre","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/aftermath-sirantha-jax-5.html","creation":"Oct 5, 2019 8:57:50 AM","modification":"Oct 5, 2019 6:45:56 PM"}}
