{"id":34019,"no":15,"title":"CHAPTER XV. UP THE RIVER","content":"Berty and her grandmother were having a quiet little picnic together. They had gone away up the river to Cloverdale, and, landing among the green meadows, had followed a path leading to a small hill crowned by a grove of elm-trees. \n \n Here Berty had established her grandmother on a rug with cushions, magazines, and a new book, and the ever-present knitting. \n \n Thinking that the little old lady wished to have a nap, Berty left her, and, accompanied by a mongrel dog who had come from River Street with them, roamed somewhat disconsolately along the river bank. \n \n This proceeding on her part just suited the occupant of a second boat, who, unknown to Berty, had watched her pink and white one all the way from the city. \n \n With strong, steady strokes he pulled near the[176] bank where the girl stood knee-deep in the high meadow-grass, then, with a hypocritical start, pretended to recognize her for the first time, just as he was rowing by. \n \n “How de do, Berty—what are you doing here?” \n \n “Grandma and I are having a picnic,” she said, in a lugubrious voice. \n \n “A picnic,” he repeated, incredulously, “you mean a funeral.” \n \n “I mean what I say,” she replied, crossly. \n \n “Might a fellow land?” he asked, his eyes dancing mischievously. \n \n “A fellow can land, or move on, or swim, or fly, for aught I care,” she responded, ungraciously. \n \n He jumped up, sprang out of his boat, and fastened it to the same stake where Berty’s was moored. \n \n “You’ve been looking cross-eyed at the sun,” he said, taking off his hat and fanning himself. \n \n “Take care that you don’t do the same thing,” said Berty. \n \n He looked at her sharply. She was cross, pure and simple, and with a satisfied smile he went on, “Might a fellow sit down on this grass? It looks uncommonly comfortable.” \n \n “Oh, yes,” said Berty, seating herself near him. “One might as well sit as stand.” \n \n “‘YOU’RE DYING TO TEASE ME’” \n \n [177] \n \n “This is pleasant,” said Tom, happily, leaning on one elbow with his hat over his eyes, and gazing dreamily at the river. \n \n “It is the prettiest river in the world,” remarked Berty, decidedly. \n \n “Come now—how many rivers have you seen?” inquired Tom. \n \n “Lots of them.” \n \n “And you have never been out of your native State.” \n \n “I have been to Boston, and New York, and New Orleans. How strange that you should forget it,” replied Berty, wrathfully. \n \n “What’s made you mad, Berty?” inquired Tom, with a brotherly air. \n \n “You know,” she said, sulkily, “you’re dying to tease me.” \n \n “Poor little girl,” murmured Tom, under his breath. Then he said, aloud, “Peter Jimson is in our house morning, noon, and night now.” \n \n “Don’t I know it!” exclaimed Berty, indignantly, “and you are encouraging him, and you can’t bear him.” \n \n “Come now, Berty,” said Tom, protestingly. “‘Can’t bear’ is a strong expression. I never thought much about him till he began sending business[178] my way. I tell you that makes a lot of difference. It isn’t in human nature to look critically at a man who gives you a helping hand in the struggle for existence. Unless he’s a monster, which Jimson isn’t.” \n \n “And he has helped you?” asked Berty, curiously. \n \n “Lots—he has a big influence in the city. Don’t you know about it?” \n \n “About his influence?” \n \n “No—about his favouring me.” \n \n “He tells me nothing now,” and her tone was bitter. \n \n “You’ve been a good friend to him, Berty. He is never tired of singing your praises.” \n \n “To whom does he sing? To Selina?” \n \n “I don’t know. I’m not with them much.” \n \n “Then he sings them to you?” \n \n “Yes, just as soon as I pitch him the tune.” \n \n “I should think you’d know enough of me,” said Berty, peevishly. “I’m sure you’re one of the earliest objects I remember seeing in life.” \n \n “Come now, Berty,” he replied, good-naturedly, “you needn’t be flinging my age up to me. I’m only six years older than you, anyway.” \n \n “Well, that is an age.” \n \n [179] \n \n “How did you and Jimson fall out?” asked Tom, curiously. “I’d give considerable to know.” \n \n “You’ll never know, now that I see you want to,” replied Berty, vigorously. \n \n Tom meditatively chewed a piece of meadow-grass, then said, easily, “I spoke in the language of exaggeration. We all do it. Of course, I guess that you had a quarrel. Jimson was dancing about you morning, noon, and night, till he took a fancy to Selina. Then you were jealous.” \n \n “It wasn’t that at all,” said Berty, unguardedly. “I wouldn’t be so silly. He broke his word about a package of silk.” \n \n “Oh,” replied Tom, coolly, “that was the silk Selina was so delighted to get. He sent a boy to Boston for it.” \n \n “Yes, and the arrangement, the very last arrangement, was for me to present it when it came. Several days went by; and I thought it queer I didn’t hear from him. Then I met him in the street. ‘Couldn’t the boy match the silk?’ I asked. \n \n “‘Oh, yes,’ he said, ‘he brought it fast enough.’ \n \n “‘And where is it?’ I asked. \n \n “‘Miss Everest has it.’ \n \n “‘Miss Everest?’ I said. ‘How did she get it?’ \n \n “‘Well,’ he said, ‘when it came, I just couldn’t[180] resist. I caught it from the boy. I took a carriage to her house—she was just at breakfast, but she came out, and I gave it to her.’ \n \n “‘And what did she say?’ I asked. Now this is where I blame him, Tom. Just think, after all my kindness to him, and coaching him as to the ways of women, he just said, coolly, ‘I can’t tell you.’ \n \n “‘Can’t tell me?’ I repeated. ‘You’ve got to. I’m more interested in this affair than you are.’ \n \n “‘I—I can’t,’ he stammered. ‘I’ve seen Miss Everest several times since, and she says you’re only a child—not to tell everything to you.’ \n \n “‘Only a child!’ I said. ‘Very well!’ and I stalked away. He sent me a bouquet of carnations and maidenhair that evening, but of course flowers had no effect on me.” \n \n “Selina is jealous of you,” said Tom, promptly. \n \n “I’m not jealous of her,” returned Berty, sweetly. “I wish her every happiness, but I do think the Mayor might have been more open.” \n \n “If he’s got to dance after Selina, his work’s cut out,” said Tom. \n \n “Do you think she will marry him?” asked Berty, eagerly. \n \n “Marry him—of course she will. I never saw[181] her so pleased over anything as she was over that silk affair. Jimson is a good-hearted fellow, Berty.” \n \n “Good-hearted, yes, but he doesn’t keep his promises. He hasn’t got those pigeon-boxes up yet.” \n \n “What pigeon-boxes?” \n \n “He promised to have some nailed on the shed for me. The boxes are all made, but not put up.” \n \n “I’ll do it,” said Tom, generously. “I’ll come to-morrow.” \n \n “To-morrow will be Sunday.” \n \n “Monday, then. Monday afternoon as soon as the office closes.” \n \n “Very well,” said Berty, with a sigh, “but you’ll probably forget. My friends don’t seem to be standing by me lately.” \n \n “Your friends—why, you are the heroine of the city—confound it, what is that dog doing?” \n \n Berty’s mongrel friend, taking advantage of Tom’s absorbing interest in his companion, had lain down on the grass behind him and had chewed a piece out of his coat. \n \n “Look at it—the rascal,” exclaimed Tom, twisting round his blue serge garment—“a clean bite. What kind of a dog is this? Get out, you brute.” \n \n “Don’t scold him,” said Berty, holding out a[182] hand to the culprit. “He doesn’t know any better. He is young and cutting teeth.” \n \n “Well, I wish he’d cut them on some other man—look at that coat. It’s ruined.” \n \n “Can’t you get it mended?” \n \n “Who would do it for me?” \n \n “Send it to your tailor.” \n \n “It’s too shabby—I just keep it for boating.” \n \n “Ask your mother or Selina.” \n \n “They’re too busy with fancy work. Selina is working peonies all over the place. She’s got to use up that pound of silk.” \n \n “I don’t know what you’ll do, then,” observed Berty, in an uninterested way, “unless,” with sudden vivacity, “you give me the coat for a poor person.” \n \n “Not I—I can’t afford that. I’ll tell you, Berty, I ought to get a wife.” \n \n “Why, so you should,” said the young girl, kindly. “It’s time you were getting settled. Have you any one in mind?” \n \n “I know the kind of a girl I want,” said Tom, evasively. “I do wish you’d help me pick her out.” \n \n Berty shook her head with sudden wariness. “I forgot, I’m not going to meddle with match-making[183] any more. You’re sure to get a snub from the person you’re trying hardest to benefit.” \n \n “I promise you that the girl I choose will never snub you,” said Tom, solemnly. \n \n “There was Selina,” replied Berty, bitterly, “I just loved her, and thought her beautiful and stately like a picture, and far above Mr. Jimson, and now she says I’m a child—a child!” \n \n “It’s too bad,” said Tom, sympathetically, “but Selina was always a little bit wrapped up in herself.” \n \n “I had even got as far as the engagement-ring,” continued Berty. “I thought a red stone—a garnet or a ruby—would be less common than the diamond that everybody has.” \n \n “Would you prefer a red stone for yourself?” asked Tom, artlessly. \n \n “Yes, I should think I would.” \n \n “Well, you see Selina wants to choose for herself. You women like to manage your own affairs.” \n \n “But Mr. Jimson is just as bad. He’s as stubborn as a mule when I want to advise him.” \n \n “I guess we all like to run our own concerns,” said Tom, good-humouredly, “but to come back to my girl, Berty, I do wish you would help me. You understand women so much better than I do.” \n \n [184] \n \n “Didn’t I just tell you that I wouldn’t meddle with matrimonial affairs again—not for any one. Not even if dear Grandma were to ask me.” \n \n “Well, now, we all have a great respect for Grandma,” said Tom, warmly, “but I scarcely think she is likely to think of giving you another grandfather.” \n \n “Oh, you wretch!” said Berty, irritably. “I don’t mean for herself. I mean for Bonny, or you, or some of her young friends.” \n \n “Well, as your decision is irrevocable, I suppose I mustn’t tease,” observed Tom, slowly getting up and looking out over the river, “but I would really like you to help me. Perhaps Margaretta will. Good-bye, Berty.” \n \n “Grandma and I are going to have a cup of tea presently,” said Berty, staring out over the meadows without looking at him. “We’ve brought a kettle and some eatables. If you would like to stay, I know Grandma would be glad to have you.” \n \n “Thank you, but I don’t think I’d better accept Grandma’s kind invitation. My mind is full of this important business of choosing a wife, and I want to find some one who will give me good advice. Margaretta will just about be going to dinner by the time I get back to the city. I’ll change my duds,[185] and get over just about the minute that the third course goes in.” \n \n “What kind of a girl do you want?” said Berty, staring up at him. \n \n “A tall girl, much taller than you, or even Margaretta. Tall and flaxen-haired like a doll.” \n \n “And blue eyes, I suppose,” said Berty, sarcastically. \n \n “Oh, yes, blue as the sky, and tapering fingers—white fingers, not brown from boating and out-of-door life.” \n \n “You want a hothouse plant,” said Berty, disdainfully. \n \n “You’ve put my very idea in words,” said Tom, in an ecstasy, as he again sat down on the grass near her. “I’d admire to wait on one of those half-sick creatures. It seems to me if I could wrap her in a white shawl in the morning, and come back at night and find her in the same place, I’d be perfectly happy. Now these healthy, athletic creatures with strong opinions scurry all over the place. You never know where to find them.” \n \n “Suppose you advertise.” \n \n “I dare say I’ll have to. I don’t know any one of just the type I want here in Riverport, but I thought perhaps you might know one. It doesn’t[186] matter if she lives outside. I wouldn’t mind going a little way.” \n \n “There’s Matty DeLong,” replied Berty. “She has neuralgia terribly, but then her hair isn’t light.” \n \n “I don’t want a neuralgic victim. It’s just a kind of general debility girl I want.” \n \n “What about the doctor’s bills?” \n \n “I’ll pay them,” said Tom, enthusiastically. “Give me domestic peace even at the expense of bills.” \n \n “I expect I’d be a terrible termagant if I married,” observed Berty, thoughtfully. \n \n Her companion made no reply to this assertion. \n \n “If I asked a man for money, and he wouldn’t give it to me, I think I’d want to pound him to a jelly,” continued Berty, warmly. \n \n “I expect he’d let you,” observed Tom, meekly, “but you’re not thinking of marriage for yourself, are you, Berty?” \n \n “No,” she said, snappishly, “only when the subject is so much discussed, I can’t help having ideas put into my head.” \n \n “I suppose you’d like a Boston man, wouldn’t you?” inquired Tom, demurely. \n \n “I don’t know. Anybody that was a stranger and celebrated would do.” \n \n [187] \n \n “You’re like me in one respect. You want a brand-new article, not something you’ve been used to seeing since infancy.” \n \n “I should like a President,” said Berty, wistfully, “but when men come to the presidential chair they’re all too old for me.” \n \n “But it must be ennobling for you to have such an ambitious spirit,” observed Tom. \n \n “It does make me feel nice—Hark! isn’t that Grandma calling?” \n \n “Yes,” replied Tom. “Let us go see what she wants.” \n \n “Berty, Berty,” the distant voice was saying, “isn’t it time to put the kettle on? We must get home before dark.” \n \n “Yes, Grandma, dear,” called Berty. “Tom Everest is here. He will help me find some sticks. You please sit still and rest—come, Tom, and speak to her first,” and smiling and playing with the dancing mongrel pup, Berty ran up the slope. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1690/49762.html","bookId":1167,"book":{"id":1167,"title":"The Story of the Gravelys","description":"简介： Certain chapters of this story first appeared in The Youths Companion. The author wishes to acknowledge the courtesy of the editors in permitting her to republish them in the present volume.Messrs. L. C. Page and Company wish also to acknowledge the...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1690","creation":"Aug 1, 2019 12:24:33 AM","modification":"Aug 1, 2019 12:24:33 AM"}}
