{"id":34020,"no":16,"title":"CHAPTER XVI. BERTY’S TRAMP","content":"Berty was away out on the lonely road leading from the iron works to the city. Grandma had not been well all day, and Berty had gone to ask Bonny to spend the night in the River Street house. Since the boy’s admission into Roger’s office he had virtually lived in Roger’s house. Not that he loved Margaretta and Roger more than he loved his grandmother and Berty, but the Grand Avenue style of living was more in accord with his aristocratic tastes than the plain ways of the house in River Street. So the boy really had two homes. Berty, who had been in the house with her grandmother all through the morning, had enjoyed the long walk out to the iron works, and was now enjoying the long walk home. It was a perfect afternoon. “How I love the[189] late summer,” murmured the girl, and she gazed admiringly about her at the ripening grain fields, the heavily foliaged trees, the tufts of goldenrod flowering beside the dusty road. Away off there in the distance was a moving cloud of dust coming from the city. Nearer at hand, it resolved itself into a man who was shuffling along in a lazy way, and kicking up very much more dust than there was any necessity of doing. Berty stared at him. She knew most of the citizens of Riverport by sight, and whether she knew them by sight or not, she could tell by their general appearance whether they belonged to the place. This man was a stranger—a seedy, poor-looking man with a brown face, and he was observing her as intently as she was observing him. Arrived opposite her, he stopped. “Lady,” he said, in a whining voice, “please give a poor sick man some money to buy medicine.” “What’s the matter with you?” she asked, promptly. “An awful internal trouble, lady,” he said, laying his hand on his side. “Intermittent pains come on every evening at this time.” “You don’t look ill,” replied Berty, suspiciously. “Your face is as bronzed as a sailor’s.” [190] “The doctors prescribed outdoor air, lady,” he went on, whiningly. “I haven’t any money for you.” The man, from his station in the road, looked back toward the city, then forward in the direction of the iron works. There was not a soul in sight, and as quick as a flash an angry sentence sprang to the girl’s lips, “Let me by.” “But, lady, I want some money,” he said, persistently, and he stood in her way. She surveyed him contemptuously. “You want to make me give you some, but I tell you you couldn’t do it.” “Couldn’t I, lady?” he replied, half-sneeringly, half-admiringly. “No,” said Berty, promptly, “because, in the first place, I’d be so mad that you couldn’t get it from me. You’re only a little man, and I guess a gymnasium-trained girl like myself could knock you about considerably. Then look here,” and, stepping back, she suddenly flashed something long and sharp and steely from her head. “Do you see that hat-pin? It would sting you like a wasp,” and she stabbed the air with it. The man snickered. “You’ve plenty of sand, but I guess I could get your purse if I tried.” [191] “Oh, how angry you make me,” returned the girl, with a fiery glance. “Now I can understand how one can let oneself be killed for an idea. You might possibly overcome me, you might get my purse, but you couldn’t kill the mad in me if you chopped me in a thousand little pieces.” “Lady,” said the man, teasingly, “I guess you’d give in before then, though I’ve no doubt but what your temper would carry you considerable far.” “And suppose you got my purse,” said Berty, haughtily, “what good would it do you? Wouldn’t I scream? I’ve got a voice like a steam-whistle; and the iron works close in five minutes, and this road will be alive with good honest workmen. They’d hunt you down like a rabbit.” For the first time a shade of uneasiness passed over his face. But he speedily became cool. “Good evening, lady, excuse me for frightening you,” and, pulling at his battered hat, he started to pass on. “Stop!” said Berty, commandingly, “who are you, and why did you come to Riverport?” He lazily propped himself against a tree by the roadside. “It was in my line of march.” “Are you a tramp?” “Well, yes, I suppose I am.” “Where were you born?” [192] “In New Hampshire.” “You weren’t born a tramp?” “Great Harry!” muttered the man, taking off his hat and pushing back from his forehead the dark hair sprinkled with gray, “it seems a hundred years since I was born. My father was a well-to-do farmer, young lady, if you want to know, and he gave me a good education.” “A good education,” repeated Berty, “and now you have sunk so low as to stop women and beg for money.” “Just that low,” he said, indifferently, “and from a greater height than you think.” “What was the height?” asked Berty, eagerly. “I was once a physician in Boston,” he returned, with a miserable remnant of pride. “You a physician!” exclaimed Berty, “and now a tramp!” “A tramp pure and simple.” “What made you give up your profession?” “Well, I was born lazy, and then I drank, and I drink, and I always shall drink.” “A drunkard!” murmured Berty, pityingly. “Poor fellow!” The man looked at her curiously. “How old are you?” she asked, suddenly. [193] “Forty-five.” “Have you tried to reform?” “Formerly—not now.” “Oh, how queer people are,” said the girl, musingly. “How little I can understand you. How little you can understand me. Now if I could only get inside your mind, and know what you are thinking about.” “I’m thinking about my supper, lady,” he said, flippantly; then, as she looked carefully at him, he went on, carelessly, “Once I was young like you. Now I don’t go in for sentiment. I feed and sleep. That’s all I care about.” “And do you do no work?” “Not a stroke.” “And you have no money?” “Not a cent.” “But how do you live?” “Off good people like you,” he said, wheedlingly. “You’re going to give me a hot supper, I guess.” “Follow me,” said Berty, suddenly setting off toward the city, and the man sauntered after her. When they reached River Street, she opened the gate leading into the yard and beckoned to him. “I can’t take you in the house,” she said, in a[194] low voice, as he followed her. “My grandmother is ill, and then our house is very clean.” “And I am very unclean,” he said, jocularly surveying himself, “though I’m by no means as bad as an ash-heap tramp.” “But I’ll put you into the shed,” continued Berty. “There are only a few guinea-pigs there. They are quiet little things, and won’t hurt you.” “I hope you won’t give me husks for supper,” murmured the tramp. Berty eyed him severely. His condition to her was too serious for jesting, and she by no means approved of his attempts at humour. “I’ll bring you out something to eat,” she said, “and if you want to stay all night, I’ll drag you out a mattress.” “I accept your offer with thankfulness, lady,” he replied.","sourceLink":"http://novel.tingroom.com/jingdian/1690/49763.html","bookId":1167,"book":{"id":1167,"title":"The Story of the Gravelys","description":"简介： Certain chapters of this story first appeared in The Youths Companion. The author wishes to acknowledge the courtesy of the editors in permitting her to republish them in the present volume.Messrs. L. C. Page and Company wish also to acknowledge the...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1690","creation":"Aug 1, 2019 12:24:33 AM","modification":"Aug 1, 2019 12:24:33 AM"}}
