{"id":34023,"no":19,"title":"CHAPTER XIX. AT THE BOARD OF WATER-WORKS","content":"“There she comes,” murmured one of the clerks, in the board of water-works offices. \n \n “Who?” murmured the other clerk. \n \n “The beggar-girl,” responded the first one. \n \n The chairman of the board heard them, and looked fearfully over his shoulder. \n \n Roger, Tom, and Bonny knew that Berty’s frequent visits to the city hall had gained for her a nickname, occasioned by the character of her visits. She was always urging the claims of the poor, hence she was classed with them. They carefully shielded from her the knowledge of this nickname, and supposed she knew nothing of it. \n \n However, she did know. Some whisper of the “beggar-girl” had reached her ears, and was a matter of chagrin to her. \n \n The chairman of the board of water-works knew all about her. He knew that if the clerks had seen[218] her passing along the glass corridor outside his office she was probably coming to him; she probably wanted something. \n \n One clerk was his nephew, the other his second cousin, so he was on terms of familiarity with them, and at the present moment was in the outer office discussing with them the chances that a certain bill had of passing the city council. \n \n The door of his own inner office stood open, but of what use to take refuge there? If the beggar-girl really wished to see a man on business, she always waited for him. \n \n He looked despairingly about him. A high, old-fashioned desk stood near. Under it was a foot-stool. As a knock came at the door, he ungracefully folded his long, lank limbs, quickly sat down on the foot-stool, and said, in a low voice, “I’ve gone to Portland for a week!” Then he fearfully awaited results. \n \n Berty, followed by her friend, the mongrel pup, walked into the room and asked if Mr. Morehall were in. \n \n “No,” said the second cousin, gravely, “he has been called to Portland on important business—will be gone a week.” \n \n The girl’s face clouded; she stood leaning against[219] the railing that separated the room into two parts, and, as she did so, her weight pushed open the gate that the second cousin had just hastily swung together. \n \n The pup ran in, and being of quick wits and an inquiring disposition wondered what that man was doing curled up in a corner, instead of being on his feet like the other two. \n \n He began to sniff round him. Perhaps there was something peculiar about him. No—he seemed to be like other men, a trifle anxious and red-faced, perhaps, but still normal. He gave a playful bark, as if to say, “I dare you to come out.” \n \n Berty heard him, and turned swiftly. “Mugwump, if you worry another rat, I’ll never give you a walk again.” \n \n The two young men were in a quandary. Whether to go to the assistance of their chief, or whether to affect indifference, was vexing their clerical souls. Berty, more quick-witted than the pup, was prompt to notice their peculiar expressions. \n \n “Please don’t let him worry a rat,” she said, beseechingly, “it makes him so cruel. Rats have a dreadfully hard time! Oh, please call him off. He’s got it in his mouth. I hear him.” \n \n The chairman, in his perplexity, had thrown him[220] a glove from his pocket, and Mugwump was mouthing and chewing it deliciously. \n \n “He’ll kill it,” exclaimed Berty. “Oh! let me in,” and before the confused clerks could prevent her, she had pushed open the gate and had followed the dog. \n \n Her face was a study. Low down on the floor sat the deceiving chairman, with Mugwump prancing before him. \n \n “Mr. Morehall!” she exclaimed; then she stopped. \n \n The chairman, with a flaming face, unfolded his long limbs, crawled out of his retreat, stumbled over the dog, partly fell, recovered himself, and finally got to his feet. After throwing an indignant glance at the two clerks, who were in a pitiable state of restrained merriment, he concentrated his attention on Berty. She blushed, too, as she divined what had been the case. \n \n “You were trying to hide from me,” she said, after a long pause. \n \n He could not deny it, though he stammered something about it being a warm day, and the lower part of the desk being a cool retreat. \n \n “Now you are telling me a story,” said Berty, sternly, “you, the chairman of the board of water-works—a city official, afraid of me!” \n \n [221] \n \n He said nothing, and she went on, wistfully, “Am I, then, so terrible? Do you men all hate the beggar-girl?” \n \n Her three hearers immediately fell into a state of shamefacedness. \n \n “What have I done?” she continued, sadly, “what have I done to be so disliked?” \n \n No one answered her, and she went on. “When I lived on Grand Avenue and thought only of amusing myself, everybody liked me. Why is it that every one hates me since I went to River Street and am trying to make myself useful?” \n \n To Mr. Morehall’s dismay, her lip was quivering, and big tears began to roll down her cheeks. \n \n “Come in here,” he said, leading the way to his own room. \n \n Berty sat down in an armchair and quietly continued to cry, while Mr. Morehall eyed her with distress and increasing anxiety. \n \n “Have a glass of water, do,” said the tall man, seizing a pitcher near him, “and don’t feel bad. Upon my word, I didn’t know what I was doing.” \n \n “It—it isn’t you only,” gasped Berty. “It is everybody. Please excuse me, but I am tired and worried this morning. I’ve had some sick friends on our street—that’s what I came to see you about.[222] The autumn is starting in so dry that we are almost choked with dust. River Street hasn’t been watered for a week.” \n \n “Hasn’t it?” said Mr. Morehall, slowly. \n \n “Grand Avenue was always watered,” continued Berty, as she rested her head against the back of the chair, “even soaked. I never thought about dust in summer. Why is River Street neglected?” \n \n “River Street citizens don’t pay such heavy taxes,” suggested Mr. Morehall. \n \n “But they pay all they can, sir.” \n \n “Poor people are shiftless,” said the official, with a shrug of his shoulders. \n \n “That’s what everybody says,” exclaimed Berty, despairingly. “All well-to-do people that I talk to dismiss the poorer classes in that way. But poor people aren’t all shiftless.” \n \n “Not all, perhaps,” said Mr. Morehall, amiably, and with inward rejoicing that Berty was wiping away her tears. \n \n “And there must be poor people,” continued Berty. “We can’t all be rich. It’s impossible. Who would work for the prosperous, if all were independent?” \n \n “What I meant,” replied Mr. Morehall, “was[223] that poverty is very often the result of a lack of personal exertion on the part of the poor.” \n \n “Yes, sir, but I am not just now advocating the cause of the helpless. It is rather the claims of the respectable poor. I know heaps of people on River Street who have only a pittance to live on. Their parents had only the same. They are not dissipated. They work hard and pay what they can to the city. My argument is that these poorer children of the city should be especially well looked after, just as in a family the delicate or afflicted child is the most petted.” \n \n “Now you are aiming at the ideal,” said Mr. Morehall, with an uneasy smile. \n \n “No, sir, not the ideal, but the practical. Some one was telling me what the city has to spend for prisons, hospitals, and our asylums. Why, it would pay us a thousandfold better to take care of these people before they get to be a burden on us.” \n \n “They are so abominably ungrateful,” muttered Mr. Morehall. \n \n “And so would I be,” exclaimed Berty, “if I were always having charity flung in my face. Let the city give the poor their rights. They ask no more. It’s no disgrace to be born poor. But if I am a working girl in River Street I must lodge in a[224] worm-eaten, rat-haunted tenement-house. I must rise from an unwholesome bed, and put on badly made, uncomfortable clothing. I must eat a scanty breakfast, and go to toil in a stuffy, unventilated room. I must come home at night to my dusty, unwatered street, and then I must, before I go to sleep, kneel down and thank God that I live in a Christian country—why, it’s enough to make one a pagan just to think of it! I don’t see why the poor don’t organize. They are meeker than I would be. It makes me wild to see River Street neglected. If any street is left unwatered, it ought to be Grand Avenue rather than River Street, for the rich have gardens and can go to the country, while the poor must live on the street in summer.” \n \n “Now you are oppressing the rich,” said Mr. Morehall, promptly. \n \n “Heaven forbid,” said the girl, wearily. “Equal rights for all—” \n \n “The poor have a good friend in you,” he said, with reluctant admiration. \n \n “Will you have our street watered, sir?” asked Berty, rising. \n \n “I’ll try to. I’ll have to ask for an appropriation. We’ll want another cart and horse, and an extra man.” \n \n [225] \n \n “That means delay,” said Berty, despairingly, “and in the meantime the dust blows about in clouds. It enters the windows and settles on the tables and chairs. It chokes the lungs of consumptives struggling for breath, and little babies gasping for air. Then the mothers put the windows down, and they breathe over and over again the polluted air. And this is stifling autumn weather—come spend a day in River Street, sir.” \n \n “Miss Gravely,” said the man, with a certain frank bluntness and good-will, “excuse my plain speaking, but you enthuse too much. Those poor people aren’t made of the same stuff that you are. They don’t suffer to the extent that you do under the same conditions.” \n \n Berty was about to leave the room, but she turned round on him with flashing eyes. “Do you mean to say that God has created two sets of creatures—one set with fine nerves and sensitive bodies, the other callous and unsensitive to comfort or discomfort?” \n \n “That’s about the measure of it.” \n \n “And where would you draw the line?” she asked, with assumed calmness. \n \n Mr. Morehall did not know Berty well. His family, though one of the highest respectability, moved in another circle. If he had had the pleasure[226] of an intimate acquaintance with the energetic young person before him, he would have known that her compressed lips, her half-closed eyes, and her tense forehead betokened an overwhelming and suppressed anger. \n \n Therefore, unaware of the drawn sword suspended over his head, he went on, unsuspiciously. “To tell the truth, I think there’s a lot in heredity. Now there are some families you never find scrabbling round for something to eat. I never heard of a poor Gravely, or a Travers, or a Stanisfield, or a Morehall. It’s in the blood to get on. No one can down you.” \n \n He paused consequentially, and Berty, biting her lip, waited for him to go on. However, happening to look at the clock, he stopped short. This talk was interesting, but he would like to get back to business. \n \n “Mr. Morehall,” said Berty, in a still voice, “do you know that there are a legion of poor Traverses up in the northern part of the State, that Grandma used to send boxes to every month?” \n \n “No,” he said, in surprise, “I never heard that.” \n \n “And old Mr. Stanisfield took two of his own cousins out of the poorhouse three years ago, and supports them?” \n \n [227] \n \n “You astonish me,” murmured the confused man. \n \n “And, moreover,” continued Berty, with a new gleam in her eye, “since you have been frank with me, I may be frank with you, and say that two of the people for whom I want River Street made sweet and wholesome are old Abner Morehall and his wife, from Cloverdale.” \n \n “Abner Morehall!” exclaimed the man, incredulously. \n \n “Yes, Abner Morehall, your own uncle.” \n \n “But—I didn’t know—why didn’t he tell?—” stammered Mr. Morehall, confusedly. \n \n “Yes—why do you suppose he didn’t tell you?” said Berty. “That’s the blood—the better blood than that of paupers. He was ashamed to have you know of his misfortune.” \n \n “He thought I wouldn’t help him,” burst out her companion, and, with shame and chagrin in his eyes, he sat down at the table and put his hand to his head. “It’s those confounded notes,” he said, at last. “I often told him he ought never to put his name to paper.” \n \n “It was his generosity and kindness—his implicit faith in his fellow men,” continued Berty, warmly; “and now, Mr. Morehall, can you say[228] that ‘blood,’ or shrewdness, or anything else, will always keep misfortune from a certain family? Who is to assure you that your great-great-grandchildren will not be living on River Street?” \n \n No one could assure the disturbed man that this contingency might not arise, and, lifting his head, he gazed at Berty as if she were some bird of ill-omen. \n \n “You will come to see your relatives, I suppose?” she murmured. \n \n He made an assenting gesture with his hand. \n \n “They are two dear old people. They give tone to the street—and you will send a watering-cart this afternoon?” \n \n He made another assenting gesture. He did not care to talk, and Berty slipped quietly from his office. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1690/49766.html","bookId":1167,"book":{"id":1167,"title":"The Story of the Gravelys","description":"简介： Certain chapters of this story first appeared in The Youths Companion. The author wishes to acknowledge the courtesy of the editors in permitting her to republish them in the present volume.Messrs. L. C. Page and Company wish also to acknowledge the...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1690","creation":"Aug 1, 2019 12:24:33 AM","modification":"Aug 1, 2019 12:24:33 AM"}}
