{"id":34010,"no":6,"title":"CHAPTER VI. BONNY’S ORDEAL","content":"“What’s the matter, Roger?” asked his wife, when he went home. “Nothing,” said the young man, wearily, but he went to bed early, and, rising early the next morning, strode off to the iron works without taking his breakfast. How he loved the handsome lad, his wife’s double. What could he do, what could he say? Until now he had considered the boy inferior in character to his two sisters. But, as he had often assured himself, the stock was good, and the strength and energy latent in Bonny were now looming to the fore. He was emerging from boyhood into manhood, and his childish, happy-go-lucky disposition of youth was warring with the growing forces of more mature age. The morning wore on, and his gloominess increased, until his father shortly told him that he didn’t look well, and he had better go home. [69] “I’m all right,” Roger was saying, almost harshly, when there was a ring at his telephone. The National Bank wanted to speak to him. “Hello,” said Roger. “Can you come up to the bank?” asked some one, in a jerky voice. “Have had a robbery—young Gravely hurt.” Roger dashed from his seat, seized his hat, and with a hurried word to his father, rushed outside. A delivery-cart was standing before the door. He did not stop to see whose it was, but seizing the reins, urged the horse toward the centre of the city. There was a crowd around the bank, but the cordon of police let him through. Inside was a group of bank officials, reporters, and detectives. The president’s face was flushed and angry. “Yes we have had a loss,” he said to Roger. “Oh, young Gravely—his grandmother came for him.” Roger elbowed his way out and took a cab to River Street. Here it was quiet. The noise of the bank robbery had not reached this neighbourhood. He ran up-stairs three steps at a time to Bonny’s large room in the top of the house, and softly pushed open the door. Bonny was in bed. Grandma, Berty, a woman of[70] the neighbourhood, and a doctor were bending over him. Roger could see that the boy’s face was pale and bandaged. “Bonny,” he said, involuntarily. The boy heard him and opened his eyes. “All right, Roger,” he murmured, feebly. “I stood by the fort, but I—guess—you’ll—have—to—excuse—me—to-night,” and his voice trailed off into unconsciousness. The doctor looked impatiently over his shoulder, and Roger crept out into the hall. Grandma sent Berty after him. “Oh, Roger,” she whispered, “we had such a fright.” “What is it—how was it?” asked Roger, eagerly. “Why, the circus-parade was passing the bank. Every clerk but Bonny left his desk to go look at it. They don’t seem to know why he stayed. When the parade passed, and the clerks went back, he was lying on the floor with his face and head cut.” “I know why he stayed,” muttered Roger. “He was trying to do his duty. Thank God, he was not killed. Is he much hurt?” “Some bad flesh wounds. The doctor says he[71] must be kept quiet, but he doesn’t think his brain is injured. Oh, Roger, we are so thankful his life was spared.” “Probably the thieves didn’t try to kill him. If I can do nothing, I’ll go find out something about the affair. I must telephone Margaretta. She will be upset if she hears from strangers.” “Yes, go,” said Berty, “and ask her to come to us.” Late that evening, the doctor, to quiet his feverish patient, permitted him to have five minutes’ conversation with his brother-in-law. Roger seized the hand lying on the coverlet, and pressed it silently. “Did they catch the thieves?” asked Bonny, huskily. “One of them, my boy—how do you think the detectives made sure of him?” “Don’t know.” “He was hanging around the circus-crowd, trying to mix up with it—he had some of your yellow hairs on his coat-sleeve.” Bonny smiled faintly. “The police expect him to turn State’s evidence,” continued Roger. “How much did the bank lose?” [72] “Fifteen thousand dollars.” “But they’ll get it back, Roger?” “Yes, if they catch the other fellow, and they’re sure to do it. Bonny, you’re not to talk. Just tell me if this is straight—I want it for the papers. You stood at your desk, all the others ran to the street door. Then—” “Then,” said Bonny, “I was mad. I wanted to look at the circus, but I had promised you not to shirk. But I just gritted my teeth as I stood there. I was staring after the others when I heard a little noise in the president’s room. I turned round, and saw a man peeping out. I had no revolver, and I didn’t know where Danvers kept his, and like an idiot I never thought to scream. I just grabbed for Buckley’s camera. You know he is a photographic fiend.” “Yes,” smiled Roger, and he thought of what the captured thief had asked one of the policemen guarding him: “How’s that gritty little demon that tried to snap us?” “I was just pressing the button,” went on Bonny, “when the man leaped like a cat, and, first thing I knew, he was smashing me over the head with that camera. There was such a row in the street that the others didn’t hear it.” [73] “Five minutes are up,” said the doctor, coming into the room. “One minute, Roger,” said the boy, feebly. “I had a second before I got whacked, and in that second I thought, ‘Here’s a specimen of the leisure class toward which I am drifting. I’ll stay with the workers,’ so, Roger, we’ll not call off that contract of ours to-night.” “All right,” said Roger, beaming on him, and backing toward the door. “It’s to stand—for how long?” “For ever!” said the boy, with sudden force, just as the doctor gently pushed him back on his pillow, and, putting a teaspoonful of medicine to his lips, said, “Now, young sir, you take this.” Roger, with a smiling face, sought Grandma and Berty on the veranda at the back of the house. “He’ll be all right in a day or two.” “Yes, it is the shock that has upset him more than the wounds,” said Berty. “The burglars only wanted to silence him.” “Grandma, do you know the bank is going to discharge every man-Jack but Bonny?” said Roger. Grandma’s eyes sparkled, then she became thoughtful. “What, all those old fellows?” exclaimed Berty. [74] “Bonny won’t stay,” said Grandma, quietly. “He would feel like a prig.” “I am going to take him in the iron works with me,” said Roger. “I won’t be denied. He will make a first-class business man.” “Under your tuition,” said Grandma, with a proud look at him. “Hush,” said Berty, “the newsboys are calling an extra.” They all listened. “Extry edeetion Evening Noose—cap-tchure of the second burrgg-lar of the great bank robbery.” “Good,” cried Berty, “they’ve caught the second man. Roger, dear, go get us a paper.” The young man ran nimbly down-stairs. “How he loves Bonny!” said Berty. “What a good brother-in-law!” Grandma said nothing, but her inscrutable gaze went away down the river. “And, Grandma,” went on Berty, “let me tell you what Bonny whispered to me before I left the room. He said, ‘I’ve sometimes got mad with Grandma for always harping on keeping the family together, but I see now that if you keep your own family together, you keep your business family together.’” [75] Grandma did not reply. Her gaze was still down the river, but the girl, watching her lips, saw them softly form the words, “Thank God!” Bonny’s ordeal was past, and it had better fitted him for other and perhaps more severe ordeals in his life to come.","sourceLink":"http://novel.tingroom.com/jingdian/1690/49753.html","bookId":1167,"book":{"id":1167,"title":"The Story of the Gravelys","description":"简介： Certain chapters of this story first appeared in The Youths Companion. The author wishes to acknowledge the courtesy of the editors in permitting her to republish them in the present volume.Messrs. L. C. Page and Company wish also to acknowledge the...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1690","creation":"Aug 1, 2019 12:24:33 AM","modification":"Aug 1, 2019 12:24:33 AM"}}
