{"id":38317,"no":14,"title":"CHAPTER XIV. THE CURSE OF A GOOD INTENTION","content":"There is one that keepeth silence and is found wise. Sister Cecilia received—nay, she almost welcomed—the news of Jem Agar\u0027s death in an intensely Christian spirit. She looked upon it in the light of a chastening-a sort of moral cold bath, unpleasant at the time, but cleanly and refreshing in its effect. Intense goodness and virtue of the jubby-jubby order seem frequently to produce this result. Trouble—provided that it be not personal—is elevated to a position which it was never intended to occupy by an all-seeing Providence. There are some people who step into the troubles of others as into the chastening bath above referred to, and splash about. They pretend to feel deeply bereavements which cannot reasonably be expected to affect them, and go about the world with a well-scrubbed air of conscious virtue, saying in manner if not in words, “Look at me; my troubles compass me about, but my innate goodness enables me to take them in the proper spirit and to be cheerful despite all.” This was precisely Sister Cecilia\u0027s attitude towards her small world of Stagholme, after the news of the young Squire\u0027s death had cast a gloom over the whole neighbourhood. “Ah!” she would say to some honest cottage mother who had more true feeling in her rough little finger than Sister Cecilia possessed in her whole heart. “These trials are sent to us for our good. The ways of Providence are strange, Mrs. Martin—strange to us now.” “Yes, miss; that they be,” Mrs. Martin replied, looking at her with the hard and far-seeing gaze of a poor mother who has known trouble in its least romantic form. And Sister Cecilia, with that blindness which comes from systematically closing the eyes to the earthly side of earthly things, never realised that the small change of sympathy is often slightly aggravating. At this period she took to calling Jem Agar her “poor boy.” The grave seems to have the power of completely altering the past, and with persons of the stamp of Sister Cecilia death appears not only to wipe out all sin, but to impair the memory of the living to such an extent that the individuality of the deceased is no longer recognisable. Jem never had in any sense of the word been her boy. His feelings for her had passed from the distrust of childhood to the lofty contempt of a schoolboy for all things preternaturally virtuous, finally settling down into the more tolerant contempt of manhood. The dead, however, have perforce to accept much affection which they scornfully refused in life. “Poor Jem!” said Sister Cecilia to Mrs. Agar the day after that lady\u0027s visit to Gray\u0027s Inn. “I always thought that perhaps he and dear Dora would come to—to some understanding.” She stirred her tea with patient, suffering head inclined at a resigned angle. “Do you think there was any understanding between them?” inquired Mrs. Agar. “Well—I should not like to say.” Which, being translated, meant that she would like to say, but did not know. It had always been a pet scheme of Mrs. Agar\u0027s that Dora should marry Arthur; firstly, because she would have nearly two thousand pounds a year on the death of her parents; and, secondly, because she was a capable person with plenty of common-sense. These two adjuncts—namely, money and common-sense—Mrs. Agar wisely looked for in candidates for the flaccid hand of her son. “I will try and find out,” said Sister Cecilia after a pause. Mrs. Agar said nothing. She was meditating over this last stroke of fate in favour of her scheme, and her thoughts were disturbed by that distrust in the continuance of good fortune which usually spoils the enjoyment of the unscrupulous in those good things which they have obtained for themselves. So Sister Cecilia took it for granted that she was doing the will of the mistress of Stagholme when she wrote a note that same evening inviting Dora to have tea with her the following afternoon. At the hour appointed Dora arrived, and was duly shown into the little cottage drawing-room, of which the decoration hovered between the avowedly devout and the economo-aesthetic. Sister Cecilia swept down upon her with a speechless emotion which, in the nature of things (and Sister Cecilia), could not well be of long duration. “My dear,” she whispered, “God will give you strength to bear this awful trial.” Dora recovered her breath and re-arranged her crushed habiliments before inquiring, with just sufficient feeling to save her from downright rudeness, “What is the matter; has something else happened?” Sister Cecilia drew back. She was vaguely conscious of having run mentally against a brick wall. There was something new and unusual about Dora which she could not understand—something, if she could only have seen it, suggestive of the quiet, strong man in whose honour the whole parish wore mourning. But Sister Cecilia was not a subtle woman. She had had so little experience of the world, of men and of women, that she fell easily into the error of thinking that they were all to be treated alike and with equal success by little maxims culled from fourpenny-halfpenny devotional books. “No, dear,” she exclaimed; “I was referring to our terrible loss. My heart has been bleeding for you—” “It is very kind, I\u0027m sure,” said Dora quietly; “I forgot that I had not seen you since the news reached us.” It is probable that her self-control cost her more than she suspected. Her lips were drawn and dry. She wore a thick veil, which she carefully abstained from lifting above the level of her eyes. “I am sure,” moaned Sister Cecilia, “it has been a most trying time for us all. I wonder that Mrs. Agar has borne up so bravely. Her health is wonderful, considering.” Dora sat looking straight in front of her. She was withdrawing her gloves slowly. Her face was that of a person whose mind was made up for the endurance of an operation. The twaddling voice, the characteristic reference to health, were intensely aggravating. There are some women who talk of their own health before the dead are buried. They do not seem to be able to separate grief from bodily ill. Clad in crape, they rush to the seaside, and there, presumably because grief affects their legs, they hire a man to wheel themselves and Sorrow in a bath-chair. Why—oh, why! does bereavement drive women into bath-chairs on the King\u0027s Road, or the Lees, or the Hoe? “Wonderful!” said Dora. Sister Cecilia, busying herself with the teapot, proceeded to blow her own trumpet with the bare-facedness of true virtue. “I have been with her constantly,” she said. “I think it is better for us all to tell of our grief; I think that we are given speech for that purpose. For although one may only be able to offer sympathy and perhaps a little advice, it is always a relief to speak of one\u0027s sorrow.” “I suppose it is,” admitted Dora from her strong-hold of reserve, “for some people.” “Oh, yes!” exclaimed Sister Cecilia, all heedless of the sarcasm. For extreme charity is proof against such. It covers other things besides a multitude of sins. Wielded foolishly it runs amuck like a too luxuriant creeper, and often kills commonsense. “And that is why I asked you to come, dear. I thought that you might want to confide in some one—that you might want to unburden your heart to one who feels for you as if this sorrow were her own—” “Only one piece of sugar, thank you,” interrupted Dora. “Thank you. No. Bread and butter, please. It is very kind of you, Sister Cecilia. But, you see, when I have any unburdening to do there is always mother, and if I want any advice there is always father.” “Yes, dear. But sometimes even one\u0027s parents are not quite the persons to whom one would turn in times of grief.” “Oh!” observed Dora, without much enthusiasm. Unconsciously Sister Cecilia was doing the very best thing possible for Dora, She was arousing in her the spirit of antagonism—hardening a stricken heart, as it were, by a fresh challenge. She was teaching Dora to fight for what we learn to deem most sacred—namely, the right to monopolise our own thoughts and feelings. Sister Cecilia is not, one may assume, the only good woman in the world who cannot draw a definite line between sympathy and mere curiosity. With many the display of sympathy is nothing but a half-conscious bait to attract a shoal of further details. Self-reliance was lurking somewhere in this girl\u0027s character, but it had never been developed by the pressure of circumstances. Reserve she had seen practised by her father, but the actual advantages thereof were only now beginning to be apparent to her. The body, we are told, adapts itself to abnormal circumstances; so is it with the mind. Already Dora was beginning, as they say at sea, to find her feet; to take that stand amidst her environments which she was forced to hold, practically alone, thereafter. And Sister Cecilia, with that blind faith in a good motive which gives almost as much trouble as actual vice, floundered on in the path she had mapped out for herself. “You know, dear,” she said, looking out of the window with a sentimental droop of her thin, inquisitive lips, “I cannot help feeling that this—this terrible blow means more to you than it does to us.” “Why?” inquired Dora practically. Sister Cecilia was silent, with one of those aggravating silences which do not allow even the satisfaction of a flat contradiction. A meaning silence is a coward\u0027s argument. She was beginning to feel slightly nervous before this child, ignorant that childhood is not always a matter of years and calendar months. “Why?” asked Dora again. Sister Cecilia looked rather bewildered. “Well, dear, I thought perhaps—I always thought that my poor boy entertained some feeling—you understand?” “No,” replied Dora, borrowing for the moment her father\u0027s most crushing deliberation of manner, “I cannot say I do. When you say your \u0027poor boy,\u0027 are you referring to Jem?” Sister Cecilia assented with a resigned nod worthy of the very earliest martyr. “Then, as every one has discovered so many virtues in him—quite suddenly—we had better emulate one of them, and have at the least the good feeling to hold our tongues about any feelings he may have entertained. Do you not think so, Sister Cecilia?” “Well, dear, I only thought to act as might be best for you,” said the well-intentioned meddler, with the drawl of the professionally misunderstood. “I have no doubt of that,” returned Dora, with an equanimity which was again strangely suggestive of Jem Agar. “But in future you will be consulting my welfare much more effectively by refraining from action on my behalf at all.” “As you will, dear; as you will,” in the hopeless tone of age, experience, and wisdom forced to stand idle while youth and folly rush headlong down the hill. “Yes,” returned Dora calmly; “I know that, thank you. And now, I think, we had better change the subject.” The subject was therefore changed; but Sister Cecilia, having, as it were, whetted her appetite for details, was not at her ease with other food for the mind, and presently Dora left. The girl went back into her small world with a new knowledge gained—the knowledge that in all and through all we are really quite alone. There can be only one companion, and if that one be absent, there are only so many talking-machines left to us. And many of us pass the whole of our lives in conversation with them. So it is; and we know not why. In a subtle way she felt stronger for this little tussle—a fight is always exhilarating. She felt that from henceforth the memory of Jem was hers, and hers alone, to defend and to cherish. It was not much of a consolation. No. But then this is a world of small mercies, where some of us get an hour or some mean portion of a day when we want a lifetime. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2871/79433.html","bookId":1177,"book":{"id":1177,"title":"From One Generation to Another","description":"简介： Il faut se garder des premiers mouvements, parce qu\u0027ils sont presque toujours honntes.Dearest Anna,I see from the newspaper before me of March 13, that I am reported dead. Before attempting to investigate the origin of this mistake, I hasten to write...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2871","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
