{"id":38330,"no":27,"title":"CHAPTER XXVII. AT BAY","content":"To thine own self be true; And it must follow as the night the day Thou canst not then be false to any man. Human nature is, after all, a hopeless failure. Not even the very best instinct is safe. It will probably be turned sooner or later to evil account. The best instinct in Anna Agar was her maternal love, and upon this strong rock she finally wrecked her barque. She was one of those women who hold that, so long as the object is unselfish, the means used to obtain it cannot well be evil. She did not say this in so many words, because she was quite without principle, good or bad, and she invariably acted on impulse. Her impulse at this time was to turn as much of heaven and earth as came under her influence to compel Dora to marry Arthur. That Arthur should be unhappy, and should be allowed to continue in that common condition, was a thought that she could not tolerate or allow. Something must be done, and it was characteristic of the woman that that something should present itself to her in the form of the handy and useful lie. In a strait we all naturally turn to that accomplishment in which we consider ourselves most proficient. The blusterer blusters; the profane man swears; the tearful woman weeps—and weeping, by the way, is no mean accomplishment if it be used at the right moment. Mrs. Agar naturally meditated on that form of diplomacy which is sometimes called lying. The truth would not serve her purpose (not that she had given it a fair trial), and therefore she would forsake the straight path for that other one which hath many turnings. Dora absolutely refused to come to Stagholme while Arthur was there—a delicacy of feeling, which, by the way, was quite incomprehensible to Mrs. Agar. It was necessary for Arthur\u0027s happiness that he should see Dora again and try the effect of another necktie and further eloquence. Therefore, Dora must be made by subterfuge to see Arthur. “Dear Dora,” she wrote, “it will be a great grief to me if this unfortunate attachment of my poor boy\u0027s is allowed to interfere with the affection which has existed between us since your infancy. Come, dear, and see me to-morrow afternoon. I shall be quite alone, and the subject which, of course, occupies the first place in my thoughts will, if you wish it, be tabooed. “Your affectionate old Friend, “ANNA AGAR.” “It will be quite easy,” reflected this diplomatic lady as she folded the letter—almost illegible on account of its impetuosity—“for Arthur to come back from East Burgen earlier than I expected him.” The rest she left to chance, which was very kind but not quite necessary, for chance had already taken possession of the rest, and was even at that moment making her arrangements. Dora read the letter in the garden beneath the laburnum-tree, where she spent a large part of her life. Before reaching the end of the epistle she had determined to go. She was a young person of spirit as well as of discrimination, and in obedience to the urging of the former was quite ready to show Mrs. Agar, and Arthur too, if need be, that she was not afraid of them. She was distinctly conscious of the increasing power of her own strength of purpose as she made this resolution, and as she walked across the park the next afternoon her feeling was one very near akin to elation. It is only the strong who mistrust their own power. Dora Glynde had always looked upon herself as a somewhat weak and easily led person; she was beginning to feel her own strength now and to rejoice in it. From the first she half-suspected a trap of some sort. Such a subterfuge was eminently characteristic of Mrs. Agar, and that lady\u0027s manner of welcoming her only increased the suspicion. The mistress of Stagholme was positively crackling with an excitement which even her best friend could not have called suppressed. There was no suppression whatever about it. “So good of you,” she panted, “to come, Dora dear!” And she searched madly for her pocket handkerchief. “Not at all,” replied Dora, very calmly. “And now, dear,” went on the lady of the house, “are we going to talk about it?” The question was somewhat futile, for it was easy to see that she was not in a condition to talk of anything else. “I think not,” replied Dora. She had a way of using the word “think” when she was positive. “The question was raised the last time I saw you, and I do not think that any good resulted from it.” Mrs. Agar\u0027s face dropped. In some ways she was a child still, and a childish woman of fifty is as aggravating a creature as walks upon this earth. Dora remembered every word of the interview referred to, while Mrs. Agar had almost forgotten it. It is to the common-minded that common proverbs and sayings of the people apply. Hard words had not the power of breaking anything in Mrs. Agar\u0027s being. “Of course,” she said, “I don\u0027t wish to talk about it, if you don\u0027t. It is most painful to me.” She had dragged forward a second chair, only separated from that occupied by Dora by the tea-table. “Arthur,” she said, with a lamentable assumption of cheerfulness, “has driven over to East Burgen to get some things I wanted. He will not be back for ever so long.” She reflected that he was overdue at that moment, and that the butler had orders to send him to the library as soon as he returned. “I was sorry to hear,” said Dora, quite naturally, “that he had not passed his examination.” Mrs. Agar glanced at her cunningly; she was always looking for second meanings in the most innocent remarks, hardly guilty of an original meaning. At this moment the door leading through a smaller library into the dining-room opened and Arthur came quietly in. He changed colour and hesitated, but only for a moment. Then he remembered that before all things a gentleman must be a gentleman. He came forward and held out his hand. “How do you do?” he said, and for a moment he was quite dignified. “I am glad to see you here with mother. I did not know that I was going to interrupt a téte-à-téte, tea. No tea, thanks, mother; no.” “Have you brought the things I wanted? You are earlier than I expected,” blurted out the lady of the house unskillfully. “Yes, I have brought them.” “I must go and see if they are right,” said Mrs. Agar, rising, and before he could stop her she passed out of the door by which he had entered. For a moment there was an awkward silence, then Dora spoke—after the door had been reluctantly closed from without. “I suppose,” she said, “that this was done on purpose?” “Not by me, Dora.” She merely bowed her head. “Do you believe me?” he asked. “Yes.” She continued to sip her tea, and he actually handed her a plate of biscuits. “Is it still No?” he asked abruptly. “Yes.” Perhaps her fresh youthful beauty moved him, perhaps it was merely opposition that raised his love suddenly to the dignity of a passion that made him for once forget himself, his clothes, his personal appearance, and the gentlemanly modulation of his voice. For a moment he was almost a man. He almost touched the height of a man\u0027s ascendency over woman. “You may say No now,” he cried, “but I shall have you yet. Some day you will say Yes.” It was then for the first time that Dora realised that this man did actually love her according to his lights. But never for an instant did she admit in her own mind the possibility of succumbing to Arthur\u0027s will. It is not by words that men command women. They must first command their respect, and that is never gained by words. Dora was conscious of a feeling of sudden, unspeakable pain. Arthur had only succeeded in convincing her that she could have submitted to a man\u0027s will, wholly and without reserve; but not to the will of Arthur Agar. He had only showed her that such a submission would in itself have been a greater happiness than she had ever tasted. But she knew at once that only one man ever had, ever could have had, the power of exacting such submission; and he commanded it, not by word of mouth (for he never seemed to ask it), but by something strong and just and good within himself, before which her whole being bowed down. We never know how we appear in the eyes of our neighbours, friends or lovers. Arthur was at that moment in Dora\u0027s eyes a mere sham, aping something he could never attain. He had seized her two hands in his nervous and delicate fingers, from which she easily withdrew them. The action was natural enough, strong enough. But he completely spoiled the effect by the words he spoke in his thin tenor voice. “No, Arthur,” she said. “No, Arthur; since you mention the future, I may as well tell you now that my answer will never be anything but No. At one time I thought that it might be different. I told my mother that possibly, after a great many years, I might think otherwise; but I retract that. I shall never think otherwise. And if you imagine that you can force me to do so, please lay aside that hope at once.” “Then there is some one else!” cried Arthur, with an apparent irrelevance. “I know there is some one else.” Dora seemed to be reflecting. She looked over his head, out of the window, where the fleecy summer clouds floated idly over the sky. She turned and looked deliberately at the door by which Mrs. Agar had disappeared. It was standing ajar. Then again she reflected, weighing something in her mind. “Yes,” she replied half-dreamily at length. “I think you have a right to know—there is some one else.” “Was,” corrected Arthur, with the womanly intuition which was given to him with other womanly traits. “Was and is,” replied Dora quietly. “His being dead makes no difference so far as you are concerned.” “Then it was Jem! I was sure it was Jem,” said a third voice. In the excitement of the moment Mrs. Agar forgot that when ladies and gentlemen stoop to eavesdropping they generally retire discreetly and return after a few moments, humming a tune, hymns preferred. “I knew that you were there,” said Dora, with a calmness which was not pleasant to the ear. “I saw your black dress through the crack of the door. You did not stand quite still, which was a pity, because the sunlight was on the floor behind you. I was not surprised; it was worthy of you.” “I take God to witness,” cried Mrs. Agar, “that I only heard the last words as I came back into the room.” “Don\u0027t,” said Dora, “that is blasphemy.” “Arthur,” cried Mrs. Agar, “will you hear your mother called names?” “We will not wrangle,” said Dora, rising with something very like a smile on her face. “Yes, if you want to know, it was Jem. I have only his memory, but still I can be faithful to that. I don\u0027t care if all the world knows; that is why I told you behind the door. I am not ashamed of it. I always did care for Jem.” There was a little pause, for mother and son had nothing to answer. Dora turned to take her gloves, which she had laid on a side table, and as she did so the other door opened, the principal door leading to the hall. Moreover, it was opened without the menial pause, and they all turned in surprise, knowing that there were only servants in the house. In the doorway stood Jem, brown-faced, lean, and anxious-looking. There was something wolf-like in his face, with the fierce blue eyes shining from beneath dark lashes, the fair moustache pushed forward by set lips. Behind him the keen face of Seymour Michael peered nervously, restlessly from side to side. He was distinctly suggestive of a rat in a trap. And beyond him, in the gloom of the old arras-hung hall, a third man, seemingly standing guard over Seymour Michael, for he was not looking into the room but watching every movement made by the General—tall man, dark, upright, with a silent, clean-shaven face, a total stranger to them all. But his manner was not that of a stranger, he seemed to have something to do there. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2871/79446.html","bookId":1177,"book":{"id":1177,"title":"From One Generation to Another","description":"简介： Il faut se garder des premiers mouvements, parce qu\u0027ils sont presque toujours honntes.Dearest Anna,I see from the newspaper before me of March 13, that I am reported dead. Before attempting to investigate the origin of this mistake, I hasten to write...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2871","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
