{"id":38307,"no":4,"title":"CHAPTER IV. FREIGHTED","content":"I shall remember while the light lives yet, And in the darkness I shall not forget. Seymour Michael was no coward where hard words and no hard knocks were to be exchanged. His faith in his own keenness of intellect and unscrupulousness of tongue was unbounded. He smiled when he read Anna Agar\u0027s letter over a dainty breakfast at his club the next morning. The cunning of it was obvious to his cunning comprehension, and the fact of her suppressing her newly-acquired surname only convinced him that she knew but little about himself. That same evening at four o\u0027clock he presented himself at the lordly hall-door of Mr. Hethbridge. Since first he had raised his hand to this knocker, fingering his letter of introduction to the East India director, Seymour Michael had learnt many things, but the knowledge was not yet his that indiscriminate untruths are apt to fly home to roost. Anna Agar had easily managed to send her mother out of the house; her husband spent his days as far from Clapham as circumstances would allow. She was seated on a sofa at the far end of the room when Seymour Michael was shown in, and the first thing that struck her was his diminutiveness. After the hearty country gentlemen who habitually carried mud into the Stagholme drawing-room, this small-limbed dapper soldier of fortune looked almost puny. But there is a depth in every woman\u0027s heart which is only to be reached by one man. Whatever betide them both, that one is different from the rest all through life. Neither of these two persons spoke until the servant had closed the door. Then, as is usual in such cases, the more indifferent spoke first. “Why did you never write to me?” said Seymour Michael, fixing his mournful glance on her face. “Because I thought you were dead.” “You never got my letter contradicting the report?” “No,” she answered, with so cheap a cunning that it deceived him. “And,” he went on, with the heartlessness of a small man, for large men respect woman with a deeper chivalry than every puny knight yet compassed, “and you did not trouble to inquire. You did not even give me six months\u0027 grace to cool in my grave.” “How did you send your letter?” she asked, with a suppressed excitement which he misread entirely. “By the usual route. I wrote off at once.” “Liar! liar! liar!” she shrieked. She had risen, and stood pointing an accusatory finger at him. Then suddenly the dramatic force of the situation seemed to fail, and she burst out laughing. For some seconds it seemed as if her laughter was getting beyond her control, but at last she checked it with a gurgle. The complete success of the trap which she had laid for him almost disappointed her. Few things are more disappointing than complete success. She hated him, and yet for the sake of the one gleam of good love that had flickered once in her essentially sordid heart, she had nourished a vague hope that he would clear himself—that at all events he would have the cleverness to see through her stratagem. “Liar!” she repeated. “In this room last night—not twenty-four hours ago—Mr. Wynderton told me all about it. He said that you told several men in his presence that you did not love me, and that your death reported in the papers was the best way of breaking off the engagement.” Seymour Michael\u0027s eyes never wavered. For once they were still, with that solemn depth of gaze which tells of the curse laid on a smitten, miserable race. It was strange that before honest men and women his glance wavered ever—he could never meet honest eyes; but looking at Anna Agar they were as steady as those of a true man. “Wynderton,” ho said, “the man whose promotion I stopped, by a report against him for looting.” When Nature makes a fool in the guise of a woman she turns out a finished work. Mrs. Agar\u0027s eyes actually lighted up. Seymour Michael saw; but he knew that he had no case. Nevertheless, in view of the Squire\u0027s advanced age (a fact of which he had made sure), he attempted to carry through a forlorn hope. “And you believe this man before you believe me?” said Michael. It is strange how often one hears the word “believe” on the lips of those whose veracity is doubtful. Now it happened that Mr. Hethbridge had spoken of Wynderton at breakfast that morning in terms which left no doubt as to the untruth of the statement just made in regard to him. But even this would have been passed over by the woman who had a natural tendency towards falsehood herself, had not Seymour Michael made a hideous mistake. A wiser man than any of us has said that there is a time for all things. Most distinctly defined is the time for making love. More men come to grief by making too much love than too little. Seymour Michael, being heartless, deemed erroneously that this was a propitious moment to essay the power which had once been his over this woman. He accompanied his reproachful speech with a tender glance, which in olden times had never failed to call forth an answering look of love in her eyes. Now, it suddenly aroused her to realise the extent of her hatred. In some subtle way it humiliated her; for she looked back into the past, and saw herself therein a dupe to this man. “No!” she cried, and her raised voice had a sudden twang in it—suggestive of the streets; of the People. “No—you needn\u0027t trouble to make soft eyes at me. I know you now—I know that what that man said was true. He called you a coward and a cad. You are worse! You are a Jew—a mean, lying Jew.” There are few greater trials to a man\u0027s dignity than vituperation from the lips of a woman. She walked towards him, clumsily, menacingly and raised her hand as if to strike him. Seymour Michael\u0027s brown face turned yellow beneath her blazing anger. “Sit down!” he commanded, “and don\u0027t make a fool of yourself.” He was mean enough to pay her back in her own coin—the paltry, loud-ringing coin which is all that a woman has. “I do not mean to wrangle,” he said coolly; “but I may as well tell you now that I never cared a jot for you. I was laughing at you in my sleeve all the time. I did not want you but your money. I concluded that the money would be too dear at the price, so I determined to throw you over. The way I chose to do it was as good as any other, because it saved me the trouble of writing to you.” Anna Agar had obeyed him. She was sitting down in a stiff-backed arm-chair, looking stupidly at the pattern of the carpet as if it were something new to her. Between physical pain and mental excitement she was beginning to wander. She was the sort of woman to lose control over her mind with a temperature of one hundred and one. Michael looked keenly at her. He had a racial terror of physical ailment. He saw that something was wrong, but his knowledge went no further. He had never seen a woman faint, so limited had been his experience of the sex. “Come,” he said consolingly, “it is all for the best. We made a mistake. In a few years we shall look back to this, and thank Heaven for saving us many years of unhappiness. We are not suited to each other, Anna. We never should have been happy.” It was characteristic of the man to be more afraid of a fainting fit than of a broken heart. He went to her side and stood, not daring to touch her, for fear of arousing another of those fits of passion in her which neither of them seemed to understand. At length she spoke in a singular monotonous tone which an experienced doctor would have recognised at once as the speech of a tongue unguided for the time being. She did not look up, but kept her eyes fixed on the carpet as if reading there. “Some day,” she said, “I will pay you back. Some day—some day. I do not know how, but I feel that you will be sorry you ever did this.” Twenty-five years afterwards these words came back to him in a flash. They passed through his brain—conglomerate—in a flash, in a hundredth part of the time required to speak them. Even at the time of hearing them, spoken in that voice which did not seem to belong to Anna Hethbridge at all, he turned pale. For all the hatred that burnt within her like a fire smouldered in the deliberate tones of her voice. Hatred and love can teach us more in a moment than the experience of a lifetime; for through either of them we see ourselves face to face. This hatred made Anna Agar in twenty-four hours, and the woman thus created went through a lifetime unchanged. Michael went towards the bell. “I am going to ring,” he said, “for your maid.” “Twice,” she muttered in the same vague way. He obeyed her, ringing twice. Presently the woman came. “Your mistress,” said Michael in a low voice to her at the door, “has been suddenly seized with faintness. I leave her to you.” Without looking round he passed through the doorway and out into his own self-seeking life. But Anna Agar\u0027s revenge began from that moment. To a man of his nature, in whose veins ran the taint of a semi-superstitious Oriental blood, there was a nameless terror in the hatred of a human being, however helpless. Surely the hell of the coward will be a twilight land of vague shadowy dangers ever approaching and receding. In such a land Seymour Michael moved for some months, until he returned to India; and there, in the daily round of a new life, he gradually learnt to shake off the past. The world is very large despite chance meetings. It is easy enough to find room for two even in the same county, with the exercise of a little care. Twenty-five years elapsed before these two met again, and then they only had time to exchange a glance. By that time the result of their own actions had passed beyond their control. Seymour Michael walked across the Common, which was in those days still wild and almost beautiful; and on the whole he was pleased with the result of this interview. He knew that it was destined to come sooner or later—he had known that all along; and it might have been worse. It is characteristic of an untruthful nature to be impervious to the shame of mere detection. In Eastern countries the liar detected smiles in one\u0027s face. Detection is to an Oriental no punishment; something more tangible is required to pierce his mental epidermis. Being quite incapable of a strong love this man was innocent of consuming hatred. He therefore vaguely wondered whether the day might come wherein he would once more lay siege to the affections of Anna Agar, a rich widow. Had he seen the face of the woman whom he had just left as it lay at that moment, hardly less pale than the pillow between the fluted mahogany pillars of a huge four-post bed, he would not have understood its meaning. He would never have divined that the dull gleam shining between her half-closed eyelids was simple hatred of himself, that the restless, twitching lips were whispering curses upon his head, that the half-stunned brain was struggling back to circulation and thought for the sole purpose of devising hurt to him. Seymour Michael, ignorant of all this, went peaceably back to his club, where he dressed, dined, and proceeded to pass the evening at a theatre. That night, while he was displaying his diamond studs in the stalls of Drury Lane Theatre, was born into the world—long before his time—a child, Arthur Agar, destined to walk the smoothest paths of life, literally in silk attire; for he grew up to love such things. But the ways of Nature are strange. She is very quiet; patient as death itself. She holds her hand for years—sometimes for a generation—but she strikes at last. She is more cruel than man, or even than woman which is saying much, She is the best friend we have, and the worst foe, for she never forgives an outrage. Nature raised her hand over this puny, whimpering child, Arthur Agar. She never forgot a mother\u0027s selfish passion. She forgets nothing. When first he opened his little pink lids upon the world he looked round with a scared wonder in a pair of colourless blue-grey eyes; and that vague look of expectation never left his eyes in later life. It almost seemed as if the infant orbs could see ahead into the future—could discern the lowering hand of outraged Nature. This hand was suspended over the ill-fated, poorly-endowed head for years, then Nature struck—hard. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2871/79423.html","bookId":1177,"book":{"id":1177,"title":"From One Generation to Another","description":"简介： Il faut se garder des premiers mouvements, parce qu\u0027ils sont presque toujours honntes.Dearest Anna,I see from the newspaper before me of March 13, that I am reported dead. Before attempting to investigate the origin of this mistake, I hasten to write...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2871","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
