{"id":38308,"no":5,"title":"CHAPTER V. AFTER NINETEEN YEARS","content":"A sharp judgment shall be to them that be in high places. “Yes, dear. I have great news for you to take back to your mother. Jem has got his commission—in a Goorkha regiment!” The lady who spoke leant back in her chair, half turning her head, but not looking entirely round in the direction of the only other occupant of the room—a girl of nineteen. “In a Goorkha regiment, Aunt Anna?” repeated the girl; “what is that? It sounds as if he would have to black his face and wear a turban. It suggests curry and gymkhanas (whatever they may be) and pyjamas and bananas and other pickles. A Goorkha regiment.” There was a faint drop in her tone—on the last three words, which to very keen ears might have signified reproach, but the hearer was not keen—merely cunning, which is quite a different matter. “Yes, dear. They tell me that these Indian regiments are much the best for a young man who is likely to get on. There are so many more chances of promotions and—er—er—distinction.” The girl was standing by the open window, and she turned her head without otherwise moving, looking at the speaker with a pair of exceedingly discriminating eyes. “Bosh, my dear aunt!” she whispered confidingly to the blind-cord. “Yes,” pursued the lady, with the eager credulity of her first mother, ever ready to believe the last speaker when belief is convenient—“Yes. Sister Cecilia tells me that all the great men began in the Indian Service.” “Oh! I wonder where they finished. Royal Academy—finishing Academy. Regimentals and a gold frame—leaning heroically on a mild-looking cannon with battles in the background.” “Yes, dear,” replied Mrs. Agar, who only half understood Dora Glynde at all times; “it is such a good thing for Jem. Such a splendid opportunity, you know!” “Yes,” echoed the girl, with a twist of her humorous lips. “Splendid!” She had turned again, and was looking out of the window across a soft old lawn where two Wellingtonians towered side by side like sentries. Without glancing in the direction of her companion she knew the expression of Mrs. Agar\u0027s face, the direction of her gaze; the very thought in her shallow mind. She knew that Mrs. Agar was sitting with her arms on the little davenport, gazing rapturously at the photograph of an insipid young man with a silk-faced smoking jacket; with clean linen, clean countenance, clean hands, immaculate hair, and a general air of being too weak to be mean. “Sister Cecilia,” went on the elder lady, “seems to know all about it.” It is useless to attempt concealment of the fact that at this juncture Dora Glynde made a face—an honest schoolgirl behind-your-back Face—indicative of supreme scorn for some person or persons unspecified. Hers was a countenance which lent itself admirably to the purpose, with lips full of humour, and capable, as such lips are, of expressing a great and wonderful tenderness. The face, du reste, was that of a healthy, fair-skinned English girl, liable to honest change from pale to pink, according to the dictates of an arbitrary climate. Her eyes were of a dark grey-blue, straightforward and steady, with a shadow of thought in them which made wise people respect her presence. She was not painfully beautiful, like the heroine of a novel—nor abnormally plain, like the antitype who has found her way into fiction, and there (alone) brings all hearts to her feet. “Is Jem glad?” she asked cheerfully. “Is he thirsting for gore and glory?” “Oh, delighted! Arthur will be so pleased too. Dear boy, he is so interested in soldiers, but of course he could not go into the army! He is too delicate—besides, the life is rough, and the risks are very great.” Mrs. Agar was speaking with her head slightly inclined to one side, and she never raised her adoring eyes from the photograph of the insipid young man. Had she done so she would have seen a look of patient, if comic, resignation come over the face of her youthful companion at the mention of her son\u0027s name. “I will tell mother,” said Dora Glynde, purposely ignoring Arthur Agar, whose name was always dragged sooner or later into every conversation. “Fancy Jem in a helmet, or a turban, with his face blacked! All the same, if I were a man I should be a soldier. When does he go—to join his regiment?” “Oh, almost at once.” The girl winced, quietly, between herself and the blind-cord. “And in the meantime,” she said lightly, “I suppose he is fully engaged in buying swords and guns and bomb-shells, or whatever the Goorkhas use in warfare.” “He is coming home to-morrow for Sunday,” replied Jem Agar\u0027s stepmother absently. She was thinking of her own son, and therefore did not hear the quick sigh which was almost a gasp; did not note the sudden light in the girl\u0027s eyes. Dora Glynde was rather a solitary-minded young person. The only child of elderly parents, she had never learnt in the nursery to indulge in the indiscretions of confiding girlhood. She had the good fortune to be without a bosom-friend who related her most sacred secrets to other bosom friends and so on, as is the way of maidens. From her father she had inherited a discriminating mind and a most admirable habit of reserve. She was quite happy when alone, which, according to La Bruyère, is a great safeguard against all evil. She wanted to be alone now, and therefore passed out of the open window with a non-committing “Good-bye, Aunt Anna!” “Good-bye, dear,” replied the lady, awaking suddenly from a reverie. But by the time she had turned round in her chair, the girl was gone. Dora crossed the lawn, passing between the sentinel pines and crossing the moat by the narrow footbridge. She climbed the railing with all the ease of nineteen years and struck a bee-line across the park. She never raised her eyes from the ground, never paused in her swinging gait, until she reached the brown hush of the beechwood which divided the Rectory garden from the southern extremity of the park. Having climbed the railing again she sat on a mossy mound at the foot of a huge beech tree. Her manner of doing so subtly indicated that she did not only know the spot, but was in the habit of sitting there, possibly to think. A youthful privilege of doubtful value, for, as we get busier in life we have to do the thinking as we go along. “Oh!” she muttered, “oh, how awful!” A new expression had come over her face. She looked older, and all the vivacity had suddenly left her lips. While she was still sitting there the crisp sound of footsteps on the fallen leaves approached through the wood. Looking up she saw her father, following the winding path through the spinney towards his home. A grave man was the Rector of Stagholme in his declining years; hopelessly, wisely pessimistic, with sudden youthful returns of interest in matters literary and theological. As he came he read a book. Instantly the expression of Dora\u0027s face changed. She rose and went towards him, smiling contemptuously towards his lowering gravity. He looked up, gave a little grunt of recognition, and closed his book. “Father,” she said, “I\u0027ve just heard a piece of news.” “Bad, I suppose.” She laughed. “Well,” she answered, “I suppose we shall survive it. Jem has got his commission, in a Goorkha regiment.” “Goorkha regiment? Nonsense!” “Aunt Anna has just told me so. She is very pleased, and seems prepared for the—best.” “That is the custom of fools, to be prepared for the best—only.” The Rector gave a despairing shrug of the shoulders. He was a man who allowed himself, after the manner of the ancients with whom he lived mentally, a few gestures. He smoked a very expressive cigarette. He was smoking one at this moment, and threw it away half consumed. This divine was possessed of a rooted conviction that the Almighty made a great mistake whenever He invested temporal power in a woman, whom he was ungallantly inclined to classify under a celebrated dictum of Mr. Carlyle\u0027s respecting the population of these happy Isles, who, truth to tell, care not one jot what Mr. Carlyle may think of them. The Reverend Thomas Glynde and his daughter walked all the way home without exchanging another word. In the Rectory drawing-room they found Mrs. Glynde, small, nervous, worried. She had evidently devoted considerable thought and attention to the preservation of the hot buttered toast. Poor humble little soul, she was quite content to minister to the bodily requirements of her spouse, having long been convinced of the inferiority of her own sex in every respect except a certain limited knowledge of housekeeping matters. She was vaguely conscious of inferiority to Dora from a literary point of view, and talked with abject humility to her own daughter of all things appertaining to books. But on all other points connected with the child of her old age this quiet little woman was absolute mistress. Years before the Rector had made a great mistake; he had, as the plain-spoken East Burgen doctor put it, made an ass of himself on the matter of a childish illness, thereby imperilling Dora\u0027s half-fledged little life. Mrs. Glynde had then, like a diminutive tigress, stood up boldly before her awesome lord and master, saying such things to him that the remembrance of them made her catch her breath even now. From that time forth the Rector was allowed to hold forth on symptoms to his heart\u0027s content, to take down from his library shelf a stout misguided book of medical short-cuts to the grave, but nothing more. He never referred to the asinine business, and in the course of years he forgave the doctor (having in view the fact that that practitioner had been carried away by a right and proper sense of the importance of the case), but he tacitly acknowledged that in the practice of home-administered medical assistance, his knowledge was second to a mother\u0027s instinct. “It appears,” he said sharply, while he was stirring his tea, “that Jem Agar has got his commission in a Goorkha regiment.” Now Mrs. Glynde knew more about the organisation of the heavenly bands than of the administration of the Indian army. She did not know whether to rejoice or lament, and having been sharply pulled up—any time during the last twenty years—for doing one or the other in the wrong place, she meekly took soundings. “What is that, dear?” she inquired. “The Goorkhas are native Indian soldiers,” explained the Rector. “Very good fellows, no doubt. They get all the hard knocks in small frontier wars and none of the half-pence. What the woman can have been thinking of, I don\u0027t know.” Mrs. Glynde was anxiously glancing towards Dora, who was nicking the nose of a sportive kitten with the tassel of the tea-cosy. “And will he go to India?” she asked, with laudable mental grovellings in the mire of her own ignorance. “Course he will.” “And,” added Dora cheerfully, “he will come home covered with glory and medals, with a weakness for strong pickles and hot language—I mean hot pickles and strong language.” “But,” said Mrs. Glynde rather breathlessly, “are they never stationed in England?” “No—never,” replied her husband snappishly. Mrs. Glynde had a pink patch on each cheek—precisely on the spot whore two such patches had appeared years ago when the doctor spoke so strongly. Those patches were maternal, and only appeared when Dora\u0027s affairs, spiritual or temporal, were concerned. “I don\u0027t know,” put in Dora again, “but I have a sort of lurking conviction that Jem will have to wear a turban and red morocco boots.” “But,” pursued Mrs. Glynde, with that courage which cometh with a red patch on either cheek, “I always thought these Indian regiments were meant for people who are badly off.” The Rector gave a short laugh. “You are not so very far wrong, my dear,” he admitted. “And no one can say that Jem is badly off. He will be very rich some day.” The Rector assumed an air of superior discretion, to which he usually treated his women-folk when he thought fit to consider that they were touching on matters beyond their jurisdiction. “Some more tea, please, mother,” put in Dora appropriately. “Excuse my appetite. I suppose it is the autumn air.” There was a short silence, during which Mrs. Glynde sought to propitiate her angered spouse with sodden toast and a second brew of tea. “I always said,” observed the Rector at last, “that your cousin was a fool.” And in some indefinite way Mrs. Glynde felt that she was once more responsible.","sourceLink":"http://novel.tingroom.com/duanpian/2871/79424.html","bookId":1177,"book":{"id":1177,"title":"From One Generation to Another","description":"简介： Il faut se garder des premiers mouvements, parce qu\u0027ils sont presque toujours honntes.Dearest Anna,I see from the newspaper before me of March 13, that I am reported dead. Before attempting to investigate the origin of this mistake, I hasten to write...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2871","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
