{"id":111745,"no":16,"title":"Page 16","content":"\"You have got to be kidding,\" Poppy said.\n Phil just gaped.\n \"No. I\u0027m perfectly serious. You\u0027re witches of thesecond kind. Remember what I told you?\"\n \"There are the kind of witches that know theirheritage and get trained-and the kind that don\u0027t.Who just have powers. And humans call that kind-\"\n \"Psychics!\" James chorused with her. \"Telepaths.Clairvoyants,\" he went on alone. There was something in his voice between laughing and crying.\"Poppy, that\u0027s what youare. That\u0027s why you picked up on telepathy so quickly. That\u0027s why you had clair voyant dreams.\"\n \"And that\u0027s why Phil heard me,\" Poppy said.\n \"Oh, no,\" Phil said. \"Not me. Come on.\"\n \"Phil, you\u0027re twins,\" James said. \"You have the same ancestors. Pace it, you\u0027re a witch. That\u0027s why I couldn\u0027t control your mind.\"\"Oh, no,\"Phil said. \"No.\"He flopped back in his seat. \"No,\"he said again, but more weakly.\n \"But whose side do we get it from?\" Poppy wondered.\n \"Dad\u0027s. Of course.\" The voice from the backseatwas very faint.\n \"Well, that would seemlogical, but-\"\n \"It\u0027s the truth. Don\u0027t you remember how Dad wasalways talking about seeing weird things? Havingdreams about things before they happened? And,Poppy, he heard you yell in yourdream. When you were calling for James. James heard it, and I heardit, and Dad heard it, too.\"\n \"Then that settles it. Oh, and it explains otherthings about all of us-all those times we\u0027ve had feelingsabout things-hunches, whatever. Even youhave hunches, Phil.\"\n \"I had one that James was creepy, and I wasright.\"\n \"Phill---\"\n \"And maybe a few others,\" Phil said fatalistically.\"I knew it was James driving up this afternoon. Ithought I just had a fine ear for car engines.\"\n Poppy was shivering with delight and astonishment, but she couldn\u0027t quite understand James.James was absolutely beaming. Filled with unbelieving elation that she could feel like streamers andfireworks in the air. \"What, James?\"\n \"Poppy, don\u0027t you see?\" James actually pounded\n the steering wheel in joy. \"It means that even before\n you became a vampire, youwere a Night Person.Asecret witch. You have every right to know about the Night World. You belong there.\"\n The world turned upside down and Poppy couldn\u0027t breathe. At last she whispered. \"Oh . . .\"\n \"And webelong together. Nobody can separate us.We don\u0027t have to hide.\"\n \"Oh...\"Poppy whispered again. Then she said,\"James, pull the car over. I want to kiss you.\"\n When they were in motion once more, Phil said, \"But where are you two going to go now? Poppycan\u0027t come home.\"\n \"I know,\" Poppy said softly. She had accepted that.There was no going back for her; the old life wasover. Nothing to do but build a new one.\n \"And you can\u0027t just wander around from place toplace,\" Phil said, doggedly persistent.\n \"We won\u0027t,\" Poppy said calmly. \"We\u0027ll go to Dad.\"\n It was perfect. Poppy could feel James think, Ofcourse.\n They would go to her father, the always-late, always-impractical, always-affectionate parent. Herfather the witch who didn\u0027t know he was a witch.Who probably thought he was crazy when his powersacted up.\n He\u0027d give them a place to stay, and that was all they needed, really. That and each other. The whole Night World would be open to them, whenever theywanted to explore it. Maybe they could come back\n and visit Thea sometime. Maybe they could dance atone of Thierry\u0027s parties.\n \"If we can findDad, that is,\" Poppy said, struck by sudden alarm.\n \"You can,\" Phil said. \"He flew out last night, buthe left an address. For the first time.\"\n \"Maybe somehow he knew,\" James said.\n They rode for a while, and then Phil cleared his throat and said, \"You know, I just had a thought. I don\u0027t want any part of the Night World, you understand-I don\u0027t carewhat my heritage is. I just wantto live like a human-and I want everybody to bedear on that....\"\n \"We\u0027re dear, Phil,\" James interrupted. \"Believeme. Nobody in the Night World is going to force youin. You can live like a human all you want as long as you avoid Night People and keep your mouth shut.\"\n \"Okay. Good. But here\u0027s my thought. I still don\u0027tapprove of vampires, but it occurs to me that maybethey\u0027re not as completely bad as they seem. I mean,vampires don\u0027t treat their food any worse than humans do. When you think of what we do to cows ...at least they don\u0027t breed humans in pens.\"\n \"I wouldn\u0027t bet on it,\" James said, suddenly grim.\"I\u0027ve heard rumors about the olddays....\"\n \"You always have to argue, don\u0027t you? But my other thought was that you\u0027re part of Nature, and Nature just is what it is. It\u0027s not always pretty, but ... well, it\u0027s Nature, and there it is.\" He wound upglumly, \"Maybe that doesn\u0027t make any sense.\"\n \"It makes sense to me,\" James said, entirely serious. \"And-thanks.\" He paused to look back at Philinacknowledgment. Poppy felt a sting behind hereyes. If he admits we\u0027re part of Nature, she thought,then he doesn\u0027t believe we\u0027re unnatural anymore.\n It meant a lot.\n She said, \"Well, you know, I\u0027vebeen thinking, too.And it occurs to me that maybe there are otherchoices for feeding besides just jumping on humans when they don\u0027t expect it. Like \u0027 animals. I mean, isthere any reason their blood won\u0027t work?\"\n \"It\u0027s not the same as human blood,\" James said.\"But it\u0027s a possibility. I\u0027ve fed on animals. Deer aregood. Rabbits are okay. Possums stink.\"\n \"And then there must be somepeople who\u0027d bewilling donors. Thea was a donor for me. We could ask other witches.\"\n \"Maybe,\" James said. He grinned suddenly. \"Iknew a witch back home who was verywilling. Nameof Gisele. But you couldn\u0027t ask them to do it everyday, you know. You\u0027d have to give them time to recover.\"\n \"I know, but maybe we could alternate. Animals one day and witches the next. Hey, maybe even werewolves on weekends!\"\n \"I\u0027d rather bite a possum,\" James said.\n Poppy socked him in the arm. \"The point is, maybewe don\u0027t have to be horrible bloodsucking monsters.Maybe we can be decentbloodsucking monsters.\"\n \"Maybe,\" James said quietly, almost wistfully.\n \"Hear, hear,\" Phil said very seriously from theback.\n \"And we can do it together,\" Poppy said to James.\n He took his eyes off the road to smile at her. Andthere was nothing wistful about his gaze. Nothingcool or mysterious or secretive, either.\n \"Together,\" he said out loud. And mentally headded, Ican\u0027t wait. With that telepathy of yoursyourealize what we can do, don\u0027t you?\n Poppy stared, then felt an effervescent rush that almost shot her out of the car. Oh, James-do youthink?\n I\u0027m certain. The only thing that makes exchanging blood so special is that it enhances telepathy. But you don\u0027t needany enhancementyou little dreamer.\n Poppy sat back to try and still her heart.\n They would be able to join their minds again. Anytime they wanted. She could imagine it, being sweptinto James\u0027s mind, feeling him surrender histhoughts to hers.\n Merging like two drops of water. Together in a waythat humans could never know.\n I can\u0027t wait, either,she told him. Ithink I\u0027m going tolike being a witch.\n Phil cleared his throat. \"If you guys want someprivacy.. .\"\n \"We can\u0027t have any,\" James said. \"Not with youaround. Obviously.\"\n \"I can\u0027t help it,\" Phil said through his teeth.\"You\u0027re the ones who\u0027re yelling.\"\n \"We\u0027re not yelling. You\u0027re snooping.\"\n \"Both of you give it a rest,\" Poppy said. But she felt warm and glowing all over. She couldn\u0027t resistadding to Phil, \"So, if you\u0027re willing to give us someprivacy, that means you trust James alone withyour sister....\"\n \"I didn\u0027t saythat.\"\n \"You didn\u0027t have to,\" Poppy said.\n She was happy.\n It was very late the next day. Almost midnight, infact. The witching hour. Poppy was standing in a place she\u0027d thought she\u0027d never see again, her mother\u0027s bedroom.\n James was waiting outside with a carload of stuff,including one large suitcase of Poppy\u0027s CDs, smuggledfor them by Phil. In a few minutes James and Poppywould be heading for the East Coast and Poppy\u0027sfather.\n But first, there was something Poppy had to do.\n She glided quietly toward the king-size bed, making no more noise than a shadow, not disturbing either of the sleepers. She stopped by her mother\u0027sstill form.\n She stood looking down, and then she spoke withher mind.\n I know you think this is a dream, Mom. I know youdon\u0027t believe in spirits. But I had to tell you that I\u0027m allright. I\u0027m all right, and I\u0027m happy, and even if you don\u0027tunderstand, please try to believe. Just this once, be!ieve in what you can\u0027t see.\n She paused, then added, Ilove you, Mom. I alwayswill.\n When she left the room, her mother was stillasleep---andsmiling.\n Outside, Phil was standing by the Integra. Poppyhugged him and he hugged back, hard.\n \"Goodbye,\" she whispered. She got into the car.James stuck his hand out the window toward Phil.\n Phil took it without hesitation.\n \"Thank you,\" James said. \"For everything.\"\n \"No, thank you.\"Phil said. His smile and his voicewere both shaky. \"Take care of her. . . and of yourself.\" He stepped back, blinking.\n Poppy blew him a kiss. Then she and James droveoff together into the night. \n","sourceLink":"https://allnovel.net/night-world-secret-vampire-night-world-1/page-16.html","bookId":2076,"book":{"id":2076,"title":"Night World : Secret Vampire (Night World #1)","description":"Storyline: \n Secret Vampire (Night World Book 1) \n Love was never so scary...The Night World is all around us - a secret society of vampires, werewolves, witches and creatures of darkness. They\u0027re beautiful - and deadly - and it\u0027s so easy to fall in love...Poppy is dying. Her best friend, James, can offer her eternal life - as a vampire. One kiss and she sees into his soul. But can she follow him into death...And beyond?\n \n","cover":"https://allnovel.net/images/night-world-secret-vampire-night-world-1.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-world-secret-vampire-night-world-1.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 6, 2019 12:33:23 AM"}}
