{"id":111738,"no":9,"title":"Page 9","content":"Poppy shifted on her bed.\\n\\n She was unhappy. It was a hot, restless unhappiness that seemed to swarm underneath her skin.Coming from her body instead of from her mind. Ifshe hadn\u0027t been so weak, she would have gotten upand tried to run the feeling off. But she had spaghetti for muscles now and she wasn\u0027t running anywhere.\\n\\n Her mind was simply cloudy. She didn\u0027t try tothink much anymore. She was happiest when shewas asleep.\\n\\n But tonight she couldn\u0027t sleep. She could still taste the wild cherry Popsicle in the corners of her mouth.She would have tried to wash the taste away, but the thought of water made her feel vaguely nauseated.\\n\\n Water\u0027s no good. Not what I need.\\n\\n Poppy turned over and pressed her face into the pillow. She didn\u0027t know what she needed, but sheknew she wasn\u0027t getting it.\\n\\n A soft sound came from the hallway. Footsteps. The footsteps of at least two people. It didn\u0027t soundlike her mother and Cliff, and anyway they\u0027d goneto bed.\\n\\n There was the lightest of knocks at her door, thena fan of light opened on the floor as the door cracked.Phil whispered, \"Poppy, you asleep? Can I come in?\"\\n\\n To Poppy\u0027s slowly rising indignation, he was coming in, without waiting for an answer. And someone was with him.\\n\\n Not just someone.Theone. The one who had hurtPoppy worst of all. The betrayer. James.\\n\\n Anger gave Poppy the strength to sit up. \"Go away!I\u0027ll hurt you!\" The most primitive and basic ofwarning-off messages. An animal reaction.\\n\\n \"Poppy, please let me talk to you,\" James said. Andthen something amazing happened. Even Poppy, in herbefuddled state, recognized that it was amazing.\\n\\n Phil said, \"Please do it, Poppy. Just listen to him.\"\\n\\n Phil siding with James?\\n\\n Poppy was too confused to protest as James cameand knelt by her bedside.\\n\\n \"Poppy, I know you\u0027re upset. And it\u0027s my fault; I made a mistake. I didn\u0027t want Phil to know whatwas really going on, and I told him I was just pretending to care for you. But it wasn\u0027t true.\"\\n\\n Poppy frowned.\\n\\n \"If you search your feelings, you\u0027llknowit\u0027s nottrue. You\u0027re turning into a telepath, and I think youalready have enough power to read me.\"\\n\\n Behind James, Phil stirred as if uneasy at the mention of telepathy. \"I can tell you it\u0027s not true,\" he said,causing both Poppy and James to look at him in surprise.\"That\u0027s one thing I found out from talking to you,\" headded, speaking to James without looking at him. \"Youmay be some kind of monster, but you really do care about Poppy. You\u0027re not trying to hurt her.\"\\n\\n \"Nowyou finally get it? After causing all this-?\"James broke off and shook his head, turning back toPoppy. \"Poppy, concentrate. Feel what I\u0027m feeling. Find the truth for yourself.\"\\n\\n I won\u0027t and you can\u0027t make me, Poppy thought.But the part of her that wanted to find out the truthwas stronger than the irrational, angry part. Tentatively shereachedfor James-not with her hand, but with her mind. She couldn\u0027t have described to anyone how she did it. She just did it.\\n\\n And she found James\u0027s mind, diamond-bright andburning with intensity. It wasn\u0027t the same as beingone with him, the way she had been when theyshared blood. It was like looking at him from theoutside, sensing his emotions from a distance. But it was enough. The warmth and longing and protectiveness he had for her were all dear. So was theanguish: the pain he felt to know that she was hurting-,and that she hated him.\\n\\n Poppy\u0027s eyes filled. \"You really do care,\" she whispered.\\n\\n James\u0027s gray eyes met hers, and there was a lookin them Poppy couldn\u0027t remember seeing before.\"There are two cardinal rules in the Night World,\" he said steadily. \"One is not to tell humans that it exists. The other is not to fall in love with a human. I\u0027ve broken both of them.\"\\n\\n Poppy was aware, vaguely, that Phillip was walkingout of the room. The fan of light contracted as hehalf-shut the door behind him. James\u0027s face waspartly in shadow.\\n\\n \"I could never tell you how I felt about you,\"James said. \"I couldn\u0027t even admit it to myself. Because it puts you in terrible danger. You can\u0027t imagine what kind of danger.\"\\n\\n \"And you, too,\" Poppy said. It was the first time she\u0027d really thought about this. Now the ideaemerged from her muddled consciousness like a bubble in a pot of stew. \"I mean,\" she said slowly, puzzling it out, \"if it\u0027sagainstthe rules to tell a human or love a human, and you break the rules, then theremust be some punishment foryou... .\"Even as shesaid it, she sensed what the punishment was.\\n\\n More of James\u0027s face went into shadow. \"Don\u0027t you worry about that,\" he said in his old voice, hiscool-guy voice.\\n\\n Poppy never took advice, not even from James. Asurge of irritation and anger swept through her-ananimal surge, like the feverish restlessness. She could feel her eyes narrow and her fingers claw.\\n\\n \"Don\u0027t you tell me what to worry about!\"\\n\\n He frowned. \"Don\u0027t you tell me not to tell you-\"he began, and then broke off. \"What am I doing?\\n\\n You\u0027re still sick with the change and I\u0027m just sittinghere.\" He rolled up a sleeve of his windbreaker and drew a fingernail along his wrist. Where the nail cut,blood welled up.\\n\\n It looked black in the darkness. But Poppy found her eyes fixing on its liquid beading in fascination.Her lips parted and her breath came faster.\\n\\n \"Come on,\" James said, and held his wrist in frontof her. The next second Poppy had pounced and fixed her mouth on it as if she were trying to savehim from a snakebite.\\n\\n It was so natural, so easy.Thisis what she\u0027d neededwhen she was dispatching Phil to get Popsicles andcranberry juice. This sweet, heady stuff was the realthing and nothing else was like it. Poppy suckedavidly.\\n\\n It was all good: the closeness, therich,dark-red taste; the strength and vitality that flooded through her, warming her to her fingertips. But best, better than any mere sensation, was the touch of James\u0027smind. It made her giddy with pleasure.\\n\\n How could she ever have mistrusted him?Itseemed ridiculous now that she couldfeel, directly, how he felt about her. She would never know anyone the way she knew James.\\n\\n I\u0027m sorry, she thought to him, and felt her thoughtaccepted, forgiven, cherished. Held gently by the cradling of James\u0027s mind.\\n\\n It wasn\u0027t your fault,he told her.\\n\\n Poppy\u0027s mind seemed to be clearing with every second that went by. It was like waking up out of a deep and uncomfortable sleep.Idon\u0027t ever want thisto end,she thought, not really directing it at James, just thinking it.\\n\\n But she felt a reaction in him-and then felt himbury the reaction quickly. Not quickly enough. Poppyhad sensed it.\\n\\n Vampires don\u0027t do this to each other.\\n\\n Poppy was shocked. They would never have thisglory again after she changed? She wouldn\u0027t believethat; she refused. There must be away....\\n\\n Again, she felt the beginning of a reaction inJames, but just as she was chasing it, he gently pulledhis wrist back. \"You\u0027d better not take any more tonight,\" he said, and his real-world voice soundedstrange to Poppy\u0027s ears. It wasn\u0027t as muchJames ashis mental voice, and now she couldn\u0027t really feelhim properly. They were two separate beings. The isolation was awful.\\n\\n How could she survive if she could never touch hismind again? If she had to use words,which suddenlyseemed as clumsy as smoke signals for communication? If she could never feel him fully, his whole being open to her?\\n\\n It was cruel and unfair and all vampires must beidiots if they settled for anything less.\\n\\n Before she could open her mouth to begin theclumsy process of verbally explaining this to James, the door moved. Phillip looked around it.\\n\\n \"Come on in,\" James said. \"We\u0027ve got a lot totalk about.\"\\n\\n Phil was staring at Poppy. \"Are you. . .\"Hestopped and swallowed before finishing in a husky whisper. \"Better?\"\\n\\n It didn\u0027t take telepathy to sense his disgust. Heglanced at her mouth, and then quickly away. Poppyrealized what he must be seeing. A stain as if she\u0027dbeen eating berries. She rubbed at her lips with theback of her hand.\\n\\n What she wanted to say was, it isn\u0027t disgusting. It\u0027spart of Nature. It\u0027s a way of giving life, pure life. It\u0027s secret and beautiful. It\u0027s all right.\\n\\n What she said was, \"Don\u0027t knock it till you\u0027vetried it.\"\\n\\n Phillip\u0027s face convulsed in horror. And the weirdthing was that on this subject James was in perfectagreement with him. Poppy could sense it-Jamesthought sharing blood was dark and evil, too. He wasfilled with guilt. Poppy heaved a long, exasperated sigh, and added,\"Boys. \"\\n\\n \"You\u0027re better,\" Phil said, cracking a faint smile.\\n\\n \"I guess I was pretty bizarre before,\" Poppy said.\"Sorry.\"\\n\\n \"Prettyis not the word.,,\\n\\n \u0027qt wasn\u0027t her fault,\" James said shortly to Phil.\"She was dying-and hallucinating, sort of. Notenough blood to the brain.\"\\n\\n Poppy shook her head. \"I don\u0027t get it. You didn\u0027ttake that much blood from me the last time. Howcould I not have enough blood to the brain?\"\\n\\n \"It\u0027s not that,\" James said. \"The two kinds of bloodreact against each other-they fight each other. Look,if you want a scientific explanation, it\u0027s somethinglike this. Vampire blood destroys the hemoglobinthe red cells-in human blood. Once it destroys enough of the red cells, you stop getting the oxygenyou need to think straight. And when it destroysmore, you don\u0027t have the oxygen you need to live.\"\\n\\n \"So vampire blood is like poison,\" Phil said, in thetones of someone who knew it all along.\\n\\n James shrugged. He wasn\u0027t looking at either Poppyor Phil. \"In some ways. But in other ways it\u0027s like auniversal cure. It makes wounds heal fast, makesflesh regenerate. Vampires can live on very little oxygen because their cells are so resilient. Vampire blooddoes everything-except carry oxygen.\"\\n\\n A light went on in Poppy\u0027s brain. Dawning revelation-the mystery of Count Dracula explained. \"Waita minute,\" she said. \"Is that why you need human blood?\"\\n\\n \"That\u0027s one of the reasons,\" James said. \"There aresome...some more mystical things human blooddoes for us, but keeping us alive is the most basicone. We take a little and that carries oxygen throughour system until our own blood destroys it. Then wetake a little more.\"\\n\\n Poppy settled back. \"So that\u0027s it. And it isnatural....\"\\n\\n \"Nothing about this is natural,\" Phil said, his disgust surfacing again.\\n\\n \"Yes, it is; it\u0027s like whatdoyouca!lit, from biologylass. Symbiosis-\"\\n\\n \"It doesn\u0027tmatterwhat it\u0027s like,\" James said. \"Wecan\u0027t sit here and talk about it. We\u0027ve got to makeplans.\"\\n\\n There was an abrupt silence as Poppy realized whatkind of plans he was talking about. She could tellPhil was realizing it, too.\\n\\n \"You\u0027re not out of danger yet,\" James said softly,his eyes holding Poppy\u0027s. \"It\u0027s going to take one more exchangeof blood, and you should have it as soon as possible. Otherwise, you might relapse again. Butwe\u0027re going to have to plan the next exchangecarefully-\"\\n\\n \"Why?\" Phil said, at his most deliberatelyobstructive.\\n\\n \"Because it\u0027s going to kill me,\" Poppy said flatly before James could answer. And when Phil flinched she went on ruthlessly, \"That\u0027s what this is allabout,Phil. It\u0027s not some little game James and I are playing. We have to deal with the reality, and the reality isthat one way or another I\u0027m going to die soon. And I\u0027d rather die and wake up a vampire- than die andnot wake up at all.\"\\n\\n There was another silence, during which James puthis hand on hers. It was only then that Poppy realized she was shaking.\\n\\n Phil looked up. Poppy could see that his face wasdrawn, his eyes dark. \"We\u0027re twins. So how\u0027d youget so much older than me?\" he said in a mutedvoice.\\n\\n A little hush, and then James said, \"I think tomorrow night would be a good time to do it. It\u0027s Friday-do you think you can get your mom and Cliff out ofthe house for the night?\"\\n\\n Phil blinked. \"I guess-if Poppy seems better, theymight go out for a little while. If I said I\u0027d staywith her.\"\\n\\n \"Convince them they need a break. I don\u0027t want them around.\"\\n\\n \"Can\u0027t you just make them not notice anything? Like you did with that nurse at the hospital?\"Poppy asked.\\n\\n \"Not if I\u0027m going to be concentrating onyou,\"James said. \"And there are certain people who can\u0027tbe influenced by mind control at all-your brother,here, is one of them. Your mom could be another.\"\\n\\n \"All right; I\u0027ll get them to go out,\" Phillip said. Hegulped, obviously uncomfortable and trying to hideit. \"And once they\u0027re gone...then what?\"\\n\\n James looked at him inscrutably. \"Then Poppy andI do what we have to do. And then you and Iwatch TV.\"\\n\\n \"Watch TV,\" Phil repeated, sounding numb.\\n\\n \"I\u0027ve got to be here when the doctor comes-andthe people from the funeral home.\"\\n\\n Phil looked utterly horrified at the mention of thefuneral home. For that matter, Poppy didn\u0027t feel toocheerful about it herself. If it weren\u0027t for the rich,strange blood coursing inside her, calming her ...\\n\\n \"Why?\"Phillip was demanding of James.\\n\\n James shook his head, very slightly. His face wasexpressionless. \"I just do,\" he said. \"You\u0027ll understand later. For now, just trust me.\"\\n\\n Poppy derided not to pursue it.\\n\\n \"So you guys are going to have to make up tomorrow,\" she said. \"In front of Mom and Cliff. Otherwiseit\u0027ll be too weird for you to hang out together.\"\\n\\n \"It\u0027ll be too weird no matter what,\" Phil said underhis breath. \"All right. Come over tomorrow afternoon and we\u0027ll make up. And I\u0027ll get them to leave us with Poppy.\"\\n\\n James nodded. \"I\u0027d better go now.\" He stood. Philstepped back to let him out the door, but James hesitated by Poppy.\\n\\n \"You gonna be all right?\" he asked in a low voice.\\n\\n Poppy nodded staunchly.\\n\\n \"Tomorrow, then.\" He touched her cheek with hisfingertips. The briefest contact, but it made Poppy\u0027sheart leap and it turned her words into the truth.Shewouldbe all right.\\n\\n They looked at each other a moment, then Jamesturned away.\\n\\n Tomorrow, Poppy thought, watching the doorclose behind him. Tomorrow is the day I die.\\n\\n One thing about it, Poppy thought-not many people were privileged toknow exactly when they weregoing to die. So not many people had the chance tosay goodbye the way she planned to.\\n\\n It didn\u0027t matter that she wasn\u0027t reallydying. Whena caterpillar changes into a butterfly it loses its caterpillar life. No more shinnying up twigs, no moreeating leaves.\\n\\n No more El Camino High School, Poppy thought.No more sleeping in this bed.\\n\\n She was going to have to leave it all behind. Herfamily,her hometown. Her entire human life. Shewas starting out into a strange new future with noidea of what was ahead. All she could do was trustJames-and trust her own ability to adapt.\\n\\n It was like looking at a pale and curving roadstretching in front of her, and not being able to seewhere it went as it disappeared into the darkness.\\n\\n No more Rollerblading down the boardwalk atVenice Beach, Poppy thought. No more slap of wetfeet on concrete at the Tamashaw public pool. Nomore shopping at the Village.\\n\\n To say goodbye, she looked at every corner of herroom. Goodbye white-painted dresser. Goodbye deskwhere she had sat writing hundreds of letters-asproven by the stains where she\u0027d dropped sealing wax on the wood. Goodbye bed, goodbye misty white bed curtains that had made her feel like anArabian princess in a fairy tale. Goodbye stereo.\\n\\n ouch,she thought. My stereo. And my CDs.I can\u0027tleave them; I can\u0027t....\\n\\n But of course she could. She would have to.\\n\\n It was probably just as well that she had to dealwith the stereo before she walked out of her room.It built her up to start dealing with the loss ofpeople.\\n\\n \"Hi, Mom,\" she said shakily, in the kitchen.\\n\\n \"Poppy! I didn\u0027t know you were up.\"\\n\\n She hugged her mother hard, in that one momentaware of so many little sensations: the kitchen tileunder her bare feet, the faint coconut smell thatdung to her mother\u0027s hair from her shampoo. Hermother\u0027s arms around her, and the warmth of hermother\u0027s body.\\n\\n \"Are you hungry, sweetie? You look so much better.\"\\n\\n Poppy couldn\u0027t stand to look into her mother\u0027sanxiously hopeful face, and the thought of food madeher nauseated. She burrowed back into her mother\u0027s shoulder.\\n\\n \"Just hold me a minute,\" she said.\\n\\n It came to her, then, that she wasn\u0027t going to beable to say goodbye to everything after all. She couldn\u0027t tie up all the loose ends of her life in one afternoon. She might be privileged to know that this was her last day here, but she was going out just likeeveryone else-unprepared.\\n\\n \"Just remember I love you,\" she muttered into hermother\u0027s shoulder, blinking back tears.\\n\\n She let her mother put her back to bed, then. Shespent the rest of the day making phone calls. Trying to learna little bit about the life she was about toexit, the people she was supposed to know. Trying to appreciate it all, fast,before she had to leave it.\\n\\n \"So, Elaine, I miss you,\" she said into the mouthpiece, her eyes fixed on the sunlight coming in her window.\\n\\n \"So, Brady, how\u0027s it going?\"\\n\\n \"So, Laura,thanks for the flowers.\"\\n\\n \"Poppy, are youokay?\"they all said. \"When arewe going tosee you again?\"\\n\\n Poppy couldn\u0027t answer. She wished she could callher dad, but nobody knew where he was.\\n\\n She also wished she had actuallyreadthe play OurTownwhen she\u0027d been assigned it last year, instead of using Cliff Notes and quick thinking to fake it. All shecould remember now was that it was about a dead girlwho got the chance to look at one ordinary day in herlife and really appreciate it. It might have helped hersort out her own feelings now-but it was too late.\\n\\n I wasted a lot of high school, Poppy realized. I usedmy brains to outsmart the teachers-and that reallywasn\u0027t very smart at all.\\n\\n She discovered in herself a new respect for Phil,who actually used his brain to learn things. Maybeher brother wasn\u0027t just a pitiful straitlaced grind afterall. Maybe-oh,God-he\u0027dbeen right all along.\\n\\n I\u0027m changing so much, Poppy thought, and sheshivered.\\n\\n Whether it was the strange alien blood in her orthe cancer itself or just part of growing up, she didn\u0027tknow. But she was changing.\\n\\n The doorbell rang. Poppy knew who it was withoutleaving the room. She could sense James.\\n\\n He\u0027s here to start the play, Poppy thought, and looked at her dock. Incredible. It was almost four o\u0027clock already.\\n\\n Time literally seemed to be flying by.\\n\\n Don\u0027t panic. You have hours yet, she told herself,and picked up the phone again. But it seemed onlyminutes later that her mother came knocking on thebedroom door.\\n\\n \"Sweetie,Phil thinks we shouldgoout--andJames has come over-but I told him I don\u0027t thinkyou want to see him-and I don\u0027t really want to leave you at night....\" Her mother was uncharacteristically flustered.\\n\\n \"No, I\u0027m happy to see James. Really. And I thinkyoushould take a break. Really.\\n\\n \"Well--I\u0027m glad you and James have made up. ButI still don\u0027t know....\"\\n\\n It took time to convince her, to persuade her that Poppy was so much better, that Poppy had weeks or months ahead of her to live. That there was no reason to stick around on this particular Friday night.\\n\\n But at last Poppy\u0027s mother kissed her and agreed. And then there was nothing to do but say goodbyeto Cliff. Poppy got a hug from him and finally forgavehim for not being her dad.\\n\\n You did your best, she thought as she disengagedfrom his crisp dark suit and looked at his boyishlysquare jaw. And you\u0027re going to be the one to take care of Mom-afterward. So I forgive you. You\u0027re all right, really.\\n\\n And then Cliff and her mom were walking out,and it was the last time, the very last time to saygoodbye. Poppy called it after them and they both turned and smiled.\\n\\n When they were gone, James and Phil came into Poppy\u0027s room. Poppy looked at James. His gray eyeswere opaque, revealing nothing of his feelings.\\n\\n \"Now?\" she said, and her voice trembled slightly.\\n\\n \"Now.\" \\n\\n","sourceLink":"https://allnovel.net/night-world-secret-vampire-night-world-1/page-9.html","bookId":2076,"book":{"id":2076,"title":"Night World : Secret Vampire (Night World #1)","description":"Storyline: Secret Vampire (Night World Book 1) \\n Love was never so scary...The Night World is all around us - a secret society of vampires, werewolves, witches and creatures of darkness. They\u0027re beautiful - and deadly - and it\u0027s so easy to fall in love...Poppy is dying. Her best friend, James, can offer her eternal life - as a vampire. One kiss and she sees into his soul. But can she follow him into death...And beyond?\\n","cover":"https://allnovel.net/images/night-world-secret-vampire-night-world-1.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/night-world-secret-vampire-night-world-1.html","creation":"Oct 5, 2019 8:58:19 AM","modification":"Oct 6, 2019 12:33:23 AM"}}
