{"id":107430,"no":1,"title":"Page 1","content":"San Francisco, 18 May,\\n\\n At last! And only four days later than anticipated when we left the mountains. Had I been willing to travel on the river from Sacramento, we would have arrived on the date anticipated… My native earth should be in one of the warehouses, waiting for me, which is just as well, as 1 have got down to less than a single chest of it.\\n\\n My escorts brought me to a very proper boarding-house on Sacramento Street, and have gone on themselves to find suitable lodgings. A Mrs. Imogene Mullinton, a very respectable widow from Vermont, owns this place and takes only reputable single women. She has given me a suite of three rooms at the top of the house, her best, and for it I am to pay $75 a month, or any fraction of a month, a very high price for such accommodations, but I have discovered that everything in San Francisco is expensive. The suite will do until I can arrange to rent a house for three or four months…\\n\\n Tomorrow I will have to pay off my escorts, which will require a trip to the bank to establish my credit here, and to begin making my acquaintance with the city. Doubtless the excellent Mrs. Mullinton can direct me to Lucas and Turner; the documents from their Saint Louis offices should be sufficient bona fides to satisfy them.\\n\\n At the corner of Jackson and Montgomery, the new Lucas and Turner building was one of the most impressive in the burgeoning city; located near the shore of the bay and the many long wharves that bristled far out into the water, the bank was well situated to sense the thriving financial pulse of San Francisco.\\n\\n Madelaine, wearing the one good morning dress she had left from her long travels, stepped out of the hackney cab and made her way through the jostling crowds on the wooden sidewalk to the bank itself. As she stepped inside, she felt both relief and regret at once again being back in the world of commerce, progress, and good society. Holding her valise firmly, she avoided the tellers\u0027 cages and instead approached the nearest of the desks, saying, \"Pardon me, but will you be kind enough to direct me to the senior orncer of the bank.\"\\n\\n The man at the desk looked up sharply. \"Have you an appointment, ma\u0027am?\" he asked, noticing her French accent with faint disapproval, and showing a lack of interest that Made-laine disliked, though she concealed it well enough. He was hardly more than twenty-two or -three and sported a dashing mustache at variance with his sober garments.\\n\\n \"No, I am just arrived in San Francisco,\" she said, and opened her valise, taking out a sheaf of documents, her manner determined; she did not want to deal with so officious an underling as this fellow. \"I am Madelaine de Montalia. As you can see from this—\" she offered him one of the folded sheets of paper \"—I have a considerable sum on deposit with your Saint Louis bank and I require the attention of your senior officer at his earliest convenience.\"\\n\\n The secretary took the letter and read it, his manner turning from indulgent to impressed as he reviewed the figures; he frowned as he read through them a second time, as if he was not convinced of what he saw. Folding the letter with care, he rose and belatedly gave Madelaine a show of respect he had lacked earlier. \"Good gracious, Madame de Montalia. It is an unexpected pleasure to welcome you to Lucas and Turner.\"\\n\\n \"Thank you,\" said Madelaine with a fine aristocratic nod she had perfected in her childhood. \"Now, if you will please show me to the senior officer? You may use those documents to introduce me, if that is necessary.\"\\n\\n \"Of course, of course,\" he said, so mellifluously that Madelaine had an urge to box his ears for such obsequiousness. He opened the little gate that separated the desks from the rest of the floor, and stood aside for her as she went through, her head up, the deep-g-een taffeta of her morning dress rustling as she moved. \"If you will allow me to go ahead and…\" He made a gesture indicating a smoothing of the way.\\n\\n She sighed. \"Is that necessary?\"\\n\\n He made an apologetic grimace. \"Well, you see, there are very few wealthy young women alone in San Francisco. And you were not expected.\" Again he gestured to express his concern.\\n\\n \"No doubt,\" she said, and halted in front of a large door of polished oak. While the secretary rapped, Madelaine examined her brooch watch, thinking she would be fortunate to be out of the bank much before noon.\\n\\n \"Come in,\" came the crisp order from a sharp, husky voice.\\n\\n The secretary made a slight bow to Madelaine, then stepped into the office, discreetly closing the door behind him, only to emerge a few minutes later, all smiles and half bows, to open the door wide for her in order to usher her into the oak-paneled office of the senior officer of the bank.\\n\\n The man who rose behind the orderly desk surprised Madelaine a little; he was younger than she expected—no more than his mid-thirties—sharp-featured, wiry and tall, with bright-red hair and steel-colored eyes, and a pinched look about his mouth as if he were in constant discomfort. His dark suit was neat as a uniform, and he greeted her with fastidious correctness. \"William T. Sherman, senior officer of Lucas and Taylor in San Francisco, at your service, Madame de Mon-talia.\"\\n\\n She took his hand at once. \"A pleasure, Mr. Sherman,\" she said, liking his decisive manner. \"I hope you will be willing to help me establish an account here.\"\\n\\n His face did not change, but a glint appeared in his eyes. \"Certainly.\" He signaled to the secretary. \"Jenkins, leave us to it. And don\u0027t close the door.\"\\n\\n Madelaine saw that the secretary was flustered. \"But I thought—\" he said.\\n\\n \"I will handle the opening of this account. Given the size of this woman\u0027s resources, such an account would need my authorization in any case.\" He came around the end of the desk not only to bring a chair for Madelaine, but to hurry Jenkins out of his office. He carried the Queen Anne chair to a place directly across the desk from his, and held it for Madelaine. \"Madame?\"\\n\\n As she sat down, Madelaine smiled up at Sherman. \"Thank you,\" she said and noticed a quick frown flicker across his face.\\n\\n Taking his place behind the desk once more, Sherman spread out two of the letters in her packet of documents on the wide expanse of leather-edged blotter. \"I see you deposited ninety-five thousand pounds sterling in the Saint Louis office of this bank in 1848. The most recent accounting, from a year ago, shows your balance only slightly reduced.\" He regarded her with curiosity. \"That is a considerable fortune, Madame. And odd, that it should be in pounds sterling, not francs.\"\\n\\n \"I inherited most of it,\" she said, not quite truthfully, for in the last century she had been able to increase her wealth far beyond what her father had amassed. \"And I have lived in London for more than ten years before I came here. Much of my money is in England.\" She made no mention of funds she had in France, Italy, and Switzerland.\\n\\n \"And you have not squandered it, it would seem. Very prudent. Unusual, you will permit me to say, in a young woman.\" He looked at her with increasing interest. \"What do you want me to do for you? How much were you planning to transfer to this bank? In dollars?\"\\n\\n \"I would think that twenty-five thousand would be sufficient,\" she said. \"In dollars.\"\\n\\n He coughed once. \"Yes; I should think so. More than sufficient Unless you are determined to cut a dash in society, you will find the sum ample. That\u0027s five times my annual salary.\" He confided this with a chuckle and a scowl. \"Very well, Madame,\" he went on affably. \"I will put the transaction in order. In the meantime, you will be free to draw upon funds up to… shall we say, five thousand dollars?\"\\n\\n Madelaine nodded. \"That would be quite satisfactory, since you are able to contrive to live on it for a year, though prices here are much higher than I anticipated. Still, I should be able to practice good economy.\"\\n\\n \"You certainly have until now, given the state of your account.\" He cocked his head, a speculative light in his eyes, his long fingers moving restlessly as if searching for a pencil or a cigar. \"Unless these funds have only recently been passed to your control? In that case, I would recommend you seek an able advisor, to guide you in the matters of investment management—\"\\n\\n \"Mr. Sherman—\" she interrupted, only to be cut off.\\n\\n \"Forgive me. None of my business. But I can\u0027t help but wonder how it comes about that you want twenty-five thousand now and have spent less than half of that in the last seven years?\" He braced his elbows on the desk and leaned forward, his chin propped on his joined hands.\\n\\n \"My studies did not require it,\" she answered, determined not to be affronted by his directness.\\n\\n \"Ah. You were at school,\" he said, his expression lighten-ing. He slapped his hands on the blotter and sat back, his question answered to his satisfaction.\\n\\n \"Something of the sort,\" she responded, in a manner she thought was almost worthy of Saint-Germain.\\n\\n San Francisco, 23 May,\\n\\n Mrs. Mullinton has given me the address of an excellent dressmaker, and the first of my new clothes should be delivered tomorrow. There are six other ensembles on order, to be delivered in three weeks. Once I have settled in, I will need to order more… I suppose it is worth getting back into corsets for the pleasure of wearing silk again.\\n\\n There is a private concert tomorrow afternoon that Mrs. Mullinton wishes to attend and has asked me to accompany her to. Now that she knows I have money and social position, she is determined to make the most of both of them, convinced I will add to her consequence in the town. If I am to remain here for three or four months, I will need to enlarge my acquaintances or risk speculation and gossip, which would do me no good at all… Perhaps I will find someone who is to my liking, whom I please, who is willing to be very, very discreet. In a place like this, lapses are not easily forgotten by anyone… \\n\\n","sourceLink":"https://allnovel.net/in-the-face-of-death-madelaine-de-montalia-2/page-1.html","bookId":2508,"book":{"id":2508,"title":"In the Face of Death (Madelaine de Montalia #2)","description":"Storyline: In the Face of Death (Madelaine de Montalia #2) \\n This erotic and historical vampire novel is set in America in the years before and during the Civil War and features Madaleine de Montalia, sometime lover of Count Saint-Germain; General William Tecumseh Sherman; and, in a supporting role, Saint-Germain himself. Madaleine lives with and studies the native tribes of America, trying to document their culture and knowledge before they are changed unalterably by contact with the settlers new to North America, only to find herself in the middle of some of the most horrifying events of the war. The stubborn and highly disciplined Tecumseh wrestles with his conscience as he falls in love with Madelaine, while the strong-willed Madaleine is torn between her love for Tecumseh and the demands of her nature.\\n","cover":"https://allnovel.net/images/in-the-face-of-death-madelaine-de-montalia-2.jpg","author":"Chelsea Quinn Yarbro","type":"Horror","source":"allnovel","link":"https://allnovel.net/in-the-face-of-death-madelaine-de-montalia-2.html","creation":"Oct 5, 2019 8:58:48 AM","modification":"Oct 5, 2019 11:07:47 PM"}}
