{"id":15797,"no":2,"title":"Chapter 2","content":"Tonight, he thought, I might find another like myself. Surely, someone is down here; I\u0027ll find someone if I keep searching. I must find someone! \\n\\n \\n\\n But he knew he would not. He knew he would find only chill emptiness ahead of him in the tunnels. \\n\\n \\n\\n For three long years he had been searching for another man or woman down here in this world under the city. For three years he had prowled the seven hundred miles of storm drains which threaded their way under the skin of Los Angeles like the veins in a giant\u0027s body—and he had found nothing. Nothing. \\n\\n \\n\\n Even now, after all the days and nights of search, he could not really accept the fact that he was alone, that he was the last man alive in a city of seven million, that all the others were dead. \\n\\n \\n\\n He paused, resting his back against the cold stone. Some of them were moving over the street above his head. He listened to the sharp scuffling sounds on the pavement and swore bitterly. \\n\\n \\n\\n \"Damn you,\" said Lewis Stillman levelly. \"Damn all of you!\" \\n\\n \\n\\n Lewis Stillman was running down the long tunnels. Behind him a tide of midget shadows washed from wall to wall; high keening cries, doubled and tripled by echoes, rang in his ears. Claws reached for him; he felt panting breath, like hot smoke, on the back of his neck; his lungs were bursting, his entire body aflame. \\n\\n \\n\\n He looked down at his fast-pumping legs, doing their job with pistoned precision. He listened to the sharp slap of his heels against the floor of the tunnel—and he thought: I might die at any moment, but my legs will escape! They will run on down the endless drains and never be caught. They move so fast while my heavy awkward upper-body rocks and sways above them, slowing them down, tiring them—making them angry. How my legs must hate me! I must be clever and humor them, beg them to take me along to safety. How well they run, how sleek and fine! \\n\\n \\n\\n Then he felt himself coming apart. His legs were detaching themselves from his upper-body. He cried out in horror, flailing the air with his arms, beseeching them not to leave him behind. But the legs cruelly continued to unfasten themselves. In a cold surge of terror, Lewis Stillman felt himself tipping, falling toward the damp floor—while his legs raced on with a wild animal life of their own. He opened his mouth, high above the insane legs, and screamed. \\n\\n \\n\\n Ending the nightmare. \\n\\n \\n\\n He sat up stiffly in his cot, gasping, drenched in sweat. He drew in a long shuddering breath and reached for a cigarette. He lit it with a trembling hand. \\n\\n \\n\\n The nightmares were getting worse. He realized that his mind was rebelling as he slept, spilling forth the bottled-up fears of the day during the night hours. \\n\\n \\n\\n He thought once more about the beginning six years ago, about why he was still alive, the last of his kind. The alien ships had struck Earth suddenly, without warning. Their attack had been thorough and deadly. In a matter of hours the aliens had accomplished their clever mission—and the men and women of Earth were destroyed. A few survived, he was certain. He had never met any of them, but he was convinced they existed. Los Angeles was not the world, after all, and if he escaped so must have others around the globe. He\u0027d been working alone in the drains when the alien ships appeared, finishing a special job for the construction company on B tunnel. He could still hear the weird sound of the mammoth ships and feel the intense heat of their passage. \\n\\n \\n\\n Hunger had forced him out and overnight he became a curiosity. The last man alive. For three years he was not harmed. He worked with them, taught them many things, and tried to win their confidence. But, eventually, certain ones came to hate him, to be jealous of his relationship with the others. Luckily he had been able to escape to the drains. That was three years ago and now they had forgotten him. \\n\\n \\n\\n His later excursions to the upper level of the city had been made under cover of darkness—and he never ventured out unless his food supply dwindled. Water was provided by rain during the wet-months—and by bottled liquids during the dry. \\n\\n \\n\\n He had built his one-room structure directly to the side of an overhead grating—not close enough to risk their seeing it, but close enough for light to seep in during the sunlight hours. He missed the warm feel of open sun on his body almost as much as he missed the companionship of others, but he could not think of risking himself above the drains by day. \\n\\n \\n\\n Sometimes he got insane thoughts. Sometimes, when the loneliness closed in like an immense fist and he could no longer stand the sound of his own voice, he would think of bringing one of them down with him, into the drains. One at a time, they could be handled. Then he\u0027d remember their sharp savage eyes, their animal ferocity, and he would realize that the idea was impossible. If one of their kind disappeared, suddenly and without trace, others would certainly become suspicious, begin to search for him—and it would all be over. \\n\\n \\n\\n Lewis Stillman settled back into his pillow, pulling the blankets tight about his body. He closed his eyes and tried not to listen to the distant screams, pipings and reedy cries filtering down from the street above his head. \\n\\n \\n\\n Finally he slept. \\n\\n \\n\\n He spent the afternoon with paper women. He lingered over the pages of some yellowed fashion magazines, looking at all the beautifully photographed models in their fine clothes. All slim and enchanting, these page-women, with their cool enticing eyes and perfect smiles, all grace and softness and glitter and swirled cloth. He touched their images with gentle fingers, stroking the tawny paper hair, as though, by some magic formula, he might imbue them with life. It was easy to imagine that these women had never really lived at all—that they were simply painted, in microscopic detail, by sly artists to give the illusion of photos. He didn\u0027t like to think about these women and how they died. \\n\\n \\n\\n That evening Lewis Stillman watched the moon, round and high and yellow in the night sky, and he thought of his father, and of the long hikes through the moonlit Maine countryside, of hunting trips and warm campfires, of the Maine woods, rich and green in summer. He thought of his father\u0027s hopes for his future and the words of that tall, gray-haired figure came back to him. \\n\\n \\n\\n \"You\u0027ll be a fine doctor, Lewis. Study and work hard and you\u0027ll succeed. I know you will.\" \\n\\n \\n\\n He remembered the long winter evenings of study at his father\u0027s great mahogany desk, pouring over medical books and journals, taking notes, sifting and re-sifting facts. He remembered one set of books in particular—Erickson\u0027s monumental three-volume text on surgery, richly bound and stamped in gold. He had always loved these books, above all others. \\n\\n \\n\\n What had gone wrong along the way? Somehow, the dream had faded, the bright goal vanished and was lost. After a year of pre-med at the University of Southern Cal, he had given up medicine; he had become discouraged and quit college to take a laborer\u0027s job with a construction company. How ironic that this move should have saved his life! He\u0027d wanted to work with his hands, to sweat and labor with the muscles of his body. He\u0027d wanted to earn enough to marry Joan and then, later perhaps, he would have returned to finish his courses. It all seemed so far away now, his reason for quitting, for letting his father down. \\n\\n \\n\\n Now, at this moment, an overwhelming desire gripped him, a desire to pour over Erickson\u0027s pages once again, to re-create, even for a brief moment, the comfort and happiness of his childhood. \\n\\n \\n\\n He\u0027d seen a duplicate set on the second floor of Pickwick\u0027s book store in Hollywood, in their used book department, and now he knew he must go after them, bring the books back with him to the drains. It was a dangerous and foolish desire, but he knew he would obey it. Despite the risk of death, he would go after the books tonight. Tonight. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2405/66930.html","bookId":557,"book":{"id":557,"title":"Small World","description":"简介： In the waiting windless dark, Lewis Stillman pressed into the building-front shadows along Wilshire Boulevard. Breathing softly, the automatic poised and ready in his hand, he advanced with animal stealth toward Western, gliding over the night-cool c...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2405","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
