{"id":82385,"no":17,"title":"Page 17","content":"As much as I hated going back to school after spring break, I knew at least my daylight hours brought a safe reprieve from Jagger.\\n\\n I returned to Dullsville High a different person than when I had left--as if being the only goth in a conservative town hadn\u0027t made me different enough. I couldn\u0027t concentrate in class, knowing I was privy to a secret world of vampires.\\n\\n Classmates continued to bury their heads in textbooks and anticipate the next soccer game, while I doodled in my journal and couldn\u0027t wait for the next sunset.\\n\\n I was still an outcast, but I think my classmates got a rise that Trevor had been dethroned from his kingdom. And although they didn\u0027t high-five me in the hallway or invite me to their parties, I was actually given a cutter\u0027s privilege at the drinking fountain.\\n\\n \"It\u0027s a shame Alexander is homeschooled. It would be nice to eat lunch as a foursome,\" Becky said at lunch on the baseball bleachers. \"Yeah, that would rock.\"\\n\\n \"But still, we should do something together.\"\\n\\n \"How about going to the drive-in?\" Matt asked, as he walked up the bleachers behind me. \"Kissing Coffins is playing tonight. Admission is half price if you wear a costume.\"\\n\\n \"Cool! I\u0027ve always wanted to see it on the big screen. I\u0027m sure Alexander would love to go.\"\\n\\n \"And I\u0027ll be able to see what happens to Jenny,\" Becky said excitedly. \"I can dress as one of the town\u0027s vampires and wear a cape.\"\\n\\n \"And fangs!\" I added.\\n\\n Just then Trevor walked onto the field with his soccer-snob groupies. He looked up at Matt, who sat down next to Becky.\\n\\n As much as Trevor tormented me and as pathetic as I thought he was, I felt a tinge of pity for him. He was an even sadder case now that he was Matt-less. I watched Matt offer Becky his sandwich.\\n\\n \"I\u0027m glad you got traded to our team,\" I said to Matt, who closed his brown bag and gave me a warm smile.\\n\\n After school, Becky and I searched through my closet to find her a costume to wear to the drive-in.\\n\\n \"Man, you do have a lot of black,\" she said, as I tossed out dozens of skirts and shirts for her to choose from.\\n\\n Becky modeled black tights, a black miniskirt, and a lacy black chemise. \"That\u0027s perfect. You\u0027ll be one of the members of the vampire gang who tries to convert Jenny. I just need my outfit.\"\\n\\n I heard my mom\u0027s SUV pull into the driveway, and Becky and I raced to meet her at the back door.\\n\\n \"Can I have an advance on my allowance?\" I asked hurriedly.\\n\\n \"Calm down,\" she advised. \"Don\u0027t I even get a hello?\"\\n\\n \"Hello,\" I replied. \"Now, can I have an advance on my allowance?\"\\n\\n \"I hope you didn\u0027t bid on a Hello Batty toaster on eBay again. I thought we told you--\"\\n\\n \"I want to dye my hair blond.\"\\n\\n \"Blond?\" she asked, shocked. \"You are not going to ruin your gorgeous black hair.\"\\n\\n \"But it needs to be blond to complete my costume.\"\\n\\n \"Are you in a play?\"\\n\\n \"Well, sort of.\"\\n\\n \"For school?\"\\n\\n \"No, I just need your help.\"\\n\\n \"Well, I have some wigs from college in the box I emptied for Nightmare. I know there\u0027s an auburn one. There may be a blond one, too.\"\\n\\n \"Can we go see?\" I begged.\\n\\n Mom reluctantly put her purse down on the kitchen table, and Becky and I followed her into my parents\u0027 bedroom. She rummaged through an old Harrod\u0027s shopping bag. \"Here it is!\" she exclaimed, as if she\u0027d found a sunken treasure. She handed me a weathered blond wig. \"I wore this in college. Your father loved it!\"\\n\\n I rolled my eyes. \"I also need a white dress,\" I confessed.\\n\\n She looked at me, pleased, as if her rebellious daughter were finally asking to borrow pearls. \"I\u0027ll see what I have!\" she replied gleefully.\\n\\n She picked up a pair of flared denims with rhinestones from the box. \"Do you believe I once wore these?\" she asked, holding them against her pleated Ann Taylor skirt.\\n\\n \"I have a white blouse,\" she said.\\n\\n \"Ahh. Here\u0027s a white eyelet skirt.\"\\n\\n \"Perfect.\"\\n\\n My mom stuck the wig on my head, and I held the clothes in front of me.\\n\\n \"It\u0027s like looking at a teenage version of myself,\" she said fondly.\\n\\n I threw the skirt and blouse in the wash, and Becky and I returned to my room.\\n\\n \"We are so going to rock!\" I said. \"But we just need one thing to complete our outfits.\"\\n\\n I hunted through my dresser drawers, closet shelves, and boxes underneath my bed.\\n\\n Halloween was months ago, and in a town like Dullsville it was easier to find a fake Prada purse than fake teeth.\\n\\n Frustrated, I banged on Billy Boy\u0027s door. He opened it slightly, sticking his Charlie Brown--shaped head out. I could barely see Henry typing at my brother\u0027s computer. \"Did you take my vampire teeth?\" I accused him.\\n\\n \"Why would I want your nasty saliva near me?\" Billy Boy said, starting to close the door on me.\\n\\n \"Well, I can\u0027t find them, and I have to have them for tonight,\" I argued, pressing the door back open.\\n\\n Henry rushed over to the door. \"I have some,\" he offered. \"Never been used.\"\\n\\n Henry and Billy Boy rode their bikes, and I followed with Becky on mine. We must have been quite a sight as we headed to Henry\u0027s house at the edge of Oakley Woods--two goths and two nerds riding alongside one another.\\n\\n We parked our bikes in Henry\u0027s driveway and entered the colonial-style five-bedroom house.\\n\\n We were greeted by his housekeeper, who was folding laundry.\\n\\n We walked up the pristine wooden stairs to his bedroom. A NO YUPPIES ALLOWED sign hung on his door.\\n\\n \"I like that,\" I said.\\n\\n A spongy black doormat rested on the floor, and a million dead bolts sealed his door.\\n\\n \"What are you hiding inside? Secret recipes of cafeteria food?\" I asked.\\n\\n After he unlocked the outside dead bolts, he stepped onto the mat. His bedroom door sprung open automatically.\\n\\n Henry had a loft bed, with a metallic blue computer underneath. Stars were pasted on his ceiling, I\u0027m sure in astronomically correct order. A solar system mobile hung from his ceiling fan. A telescope stood by his window.\\n\\n He slid open his walk-in closet doors to reveal neatly stacked, clear plastic shoe boxes.\\n\\n \"Five dollars gets you samples,\" he said, pointing to them.\\n\\n Each box was labeled: ACNE, BLOOD, PIMPLES. PUKE. SCARS.\\n\\n \"Who wants to have more pimples?\" I asked.\\n\\n \"And I have smells. Here,\" he said, opening a beaker and pushing it under my nose.\\n\\n \"Gross!\" I said, repulsed. \"It smells like the bathroom after Billy Boy uses it.\"\\n\\n \"Shut up!\" my brother said.\\n\\n \"I like to pour this on Mrs. Louis\u0027s chair sometimes,\" he said proudly. \"Look around. I have them alphabetized.\"\\n\\n \"I should have known.\"\\n\\n Becky and I each handed over our money and loaded our pockets with ghoulish goodies.\\n\\n When we were finished, Henry held a box before me as if he were holding the Holy Grail. He opened it, revealing two exact replicas of human teeth in the shape of fangs.\\n\\n \"With the glue, seven dollars.\"\\n\\n I knew I had only six in my purse.\\n\\n \"Five dollars and a stick of gum,\" I offered.\\n\\n \"Six. And your school picture,\" he countered. I looked hard at him, then at Becky.\\n\\n \"But you inscribed it to me!\" she said.\\n\\n \"Please,\" I begged, flashing her my puppydog eyes.\\n\\n She opened her wallet and handed Henry the picture.\\n\\n I handed him the money and left before he changed his mind.\\n\\n As I headed out to meet Alexander for our date, I found my parents in the kitchen, paying bills.\\n\\n \"I\u0027m going to be out a teensy bit late tonight,\" I advised.\\n\\n \"It\u0027s a school night,\" my mother said.\\n\\n \"I know, but we\u0027re going to the drive-in,\" I said with a smile.\\n\\n \"Why don\u0027t you wait until the weekend?\" my mom asked.\\n\\n \"Because tonight\u0027s half price if you wear a costume. Becky and Matt are going, too.\"\\n\\n \"Becky?\" my mother asked, surprised.\\n\\n \"Yes, my little Becky. It\u0027ll be our first double date. Besides, I already did my homework, and we have a sub for first bell anyway.\"\\n\\n \"Seems like you had all your excuses lined up,\" my father said.\\n\\n \"I\u0027ll take care of the dishes all week,\" I said to my mother. \"And Dad, I\u0027ll wash your car.\" \"Last time you washed my car, you put Wicked Wiccas stickers on it.\"\\n\\n \"But you have to admit, it looked cool.\"\\n\\n \"And last time you took care of the dishes, you broke Grandma\u0027s teapot,\" my mother remembered.\\n\\n \"Fine. Then we have a deal,\" I began. \"I\u0027ll just go to the movie, and I\u0027ll save you trouble by not doing your chores.\"\\n\\n \"How did that just happen?\" my dad wondered, as I headed for the front door. \"And when you\u0027re finished with that blond wig, your mother needs it back.\"\\n\\n I slung my backpack filled with my Kissing Coffins accessories on my shoulder and grabbed a container of garlic powder from the kitchen. I held it tightly in my hand, as if I were holding a can of Mace, as I walked to the Mansion. If Jagger jumped out at me, I wanted to be protected.\\n\\n I felt a familiar lurking presence as I turned the corner to Benson Hill. I saw a rustling in a bush and blond strands poking through the branches. I took a deep breath, and I quietly opened the container of garlic powder and threw it hard, directly into the brush.\\n\\n \"Ouch!\" a male\u0027s voice cried.\\n\\n Trevor jumped out of the bush and held his forehead.\\n\\n \"What are you doing?\" I shouted at him.\\n\\n \"I saw you coming up the road and wanted to scare you,\" he said, rubbing his wound.\\n\\n \"You don\u0027t have to hide. Your face alone could scare Frankenstein.\" I grabbed the container from the sidewalk and replaced it in my purse.\\n\\n I walked away, and Trevor continued to follow me as we drew closer to the gate.\\n\\n \"I really don\u0027t have time for you anymore,\" I said. \"I\u0027m going to the drive-in.\" And I slipped past the slightly open iron gate.\\n\\n \"You have a pretty good arm. You should try out for the baseball team. And tell your gothic boyfriend,\" he called, \"if he wants to apply, they could use a batboy.\"\\n\\n I left Trevor and was walking up the Mansion\u0027s driveway when I overheard him talking to someone outside the gate. I glanced back and saw my nemesis from behind, standing next to a guy with white hair.\\n\\n I stopped. Jagger and Trevor? A dangerous duo.\\n\\n I sneaked back down the driveway and hid behind a bush next to the wrought-iron gate.\\n\\n \"Hey, watch out, dude!\" Trevor hollered. He must have bumped into Jagger in the darkness.\\n\\n I could only imagine Trevor\u0027s reaction to the shock of seeing the pale, tattooed, multipierced Jagger walking alone on a darkened street. I wasn\u0027t sure if Trevor would hit him or take off running.\\n\\n \"Sorry,\" Jagger said in a cool voice. \"I didn\u0027t see you coming.\\n\\n \"It\u0027s so dark around here,\" Jagger continued, shifting his feet.\\n\\n \"Yeah, I think the Sterlings knock out the streetlamps on purpose.\" Jagger laughed. \"That babe you were walking with. She\u0027s your girlfriend?\" he asked.\\n\\n \"Raven? She\u0027s my nightmare. No, she hangs out with the dude who lives in the Mansion. I\u0027ve never seen you around here before,\" he said, scrutinizing him.\\n\\n \"I\u0027m just visiting. I\u0027m Sterling\u0027s friend.\"\\n\\n \"Friend? I didn\u0027t think he had any,\" he said with a laugh. \"Well, you better catch him before they go to the drive-in.\"\\n\\n \"The drive-in?\" Jagger asked.\\n\\n \"Yeah. It\u0027s built on an ancient burial ground,\" he whispered, as if revealing a secret. \"I\u0027ve heard that late at night, you can see ghosts eating popcorn.\"\\n\\n \"Burial ground?\" Jagger wondered aloud. \"Perfect.\"\\n\\n \"For what?\" Trevor asked, confused.\\n\\n \"Uh...a club initiation,\" Jagger rambled. \"But it\u0027s a very exclusive club...Maybe in the future you could join.\"\\n\\n \"Thanks anyway. Soccer takes all my free time. Besides, Sterling doesn\u0027t seem like the type to belong to a club.\"\\n\\n \"He\u0027s already a member. I just have to persuade Raven to join. Maybe I\u0027ll surprise them there,\" Jagger said. \"Can you point me in the right direction?\"\\n\\n \"Follow me,\" Jagger\u0027s new ally said. \"It\u0027s on the way to the game.\"\\n\\n As the two left together, my mouth hung open in disbelief. Jagger was planning to have a covenant ceremony tonight at the drive-in, with me as his covenant girl!\\n\\n I needed a plan fast.\\n\\n I took a deep breath and tried to think. If I canceled our double date, Jagger could return to my house, putting not only me but my family in danger.\\n\\n I didn\u0027t have much time to find a way to keep Jagger away for good without ending up as his dinner. Why couldn\u0027t Alexander and I just enjoy a movie together? Like Kissing Coffins, which reflected my own imminent situation--a movie about the vampire Vladimir Livingston, who tried to save the innocent mortal ingenue Jenny from the depths of the darkened Underworld.\\n\\n And then it hit me.\\n\\n Jagger was planning to take me tonight at the drive-in? But he couldn\u0027t. Not if I was already taken by someone else first. \\n\\n","sourceLink":"https://allnovel.net/kissing-coffins-vampire-kisses-2/page-17.html","bookId":1867,"book":{"id":1867,"title":"Kissing Coffins (Vampire Kisses #2)","description":"Storyline: Kissing Coffins (Vampire Kisses #2) \\n Not far from Dullsville, someone\u0027s lurking in the dark. . . . \\n After meeting the handsome and shadowy Alexander Sterling, goth-girl Raven\u0027s dark world has a bright, new glow. But as in her favorite movie, \"Kissing Coffins,\" Raven knows that love always has its complications, especially when Alexander has a big secret to guard. \\n When Alexander suddenly disappears, Raven leaves Dullsville to begin a dangerous search to find him. Can she stay safe, no matter who--or what--she encounters on the way?\\n","cover":"https://allnovel.net/images/kissing-coffins-vampire-kisses-2.jpg","author":"Ellen Schreiber","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/kissing-coffins-vampire-kisses-2.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:43:32 PM"}}
