{"id":41639,"no":10,"title":"PIGEONS AND SQUABS","content":"WHEN pigeons are kept for squab-raising it is one of the most profitable ventures in which suburbanites or real country folks can embark. The young are ready for market when four weeks old; the average wholesale price is three dollars a dozen. Private customers will pay forty cents a pair all through the winter months, and a good pair of mature birds will raise two squabs every four weeks for nine months in the year, which means that each old pair of birds should provide one and one-half dozen squabs, which will market for four dollars and fifty cents. The cost of keep is supposed to be fifty cents a year, but ever allowing one dollar a year, there should be three dollars and fifty cents clear profit. These estimates are made on good homer pigeons, well housed and cared for, not common nondescript birds, leading a half-wild existence, with only old-fashioned shelter behind a row of holes high up in the barn, where the nests are exposed to every storm; besides which, the young of mongrel pigeons only weigh five or six ounces when four weeks old, and are so scrawny and unappetising that they are difficult to market at any price, whilst homers at the same age weigh from twelve to twenty ounces, and are white-skinned 80 and plump. The mature homers will cost about two dollars a pair from any of the recognised lofts, but it is no use buying elsewhere, for unless birds are mated pairs, you may have another season wasted. Pigeons are faithful creatures and remain in pairs for years, and if an accident happens to one of them will frequently refuse to mate a second time the same season. Young birds which are only paired at the time of sale are likely to object to the mates chosen for them, and proceed to exercise personal choice when liberated amid a flock of strange birds. So be wise and buy only from reliable experienced breeders. The most convenient house for squab-raising is built like a chicken-coop, about twelve feet wide, eight feet high in front, sloping to six feet at the back, and any length, according to the number of birds kept. Have plenty of windows in front of the house, and openings six inches square, three feet apart, all along the back of the house about a foot from the roof. Run a nine-inch board the entire length of the house as a platform for the birds to alight on as they go in and out, and it is just as well to have a similar board just under the holes on the inside of the house. Put up three or four perches near the front windows, so that the birds can fly from side to side of the house on wet days for exercise. The number of birds which can be kept in each house can be easiest estimated by the nests. Each pair of brooders must be provided with nest-boxes divided into two compartments twelve inches square. 81 They can be arranged in tiers all along the side, back and front walls, and from floor to ceiling. Put the first tier about eighteen inches above the floor, as the birds don’t seem to like the lower nests. Fasten small perches about a foot long to the partition on each box, for the convenience of the birds as they fly back and forth, and when feeding their young. Before the house is occupied, it should be thoroughly whitewashed, the floor covered with sand or ground plaster, and earthenware dishes known as “nappies,” which cost one dollar a dozen, must be put in, one into each compartment. Suspend a bundle of cut hay in one corner of the house, as some birds like to make their own nests, though others seem to think that a handful of tobacco-stems, which it is well to place in each nappy as a check to vermin, is quite nest enough. Drinking-fountains and feeding-boxes into which the birds can only get their beaks are imperative for pigeons, for they are most particular and will not take defiled food or drink unless positively starved into it. Yet if they have open feed and water boxes, they will scatter the contents all over the floor. There is a galvanised-iron feeding-box costing one dollar on the market which has seven openings, so that many birds can feed at the same time. Water-fountains of the same material are virtually indestructible, and cost only fifty cents. The yard and fly must of course be entirely closed for pigeons, and should be four feet higher than the 82 front of the house, so that the birds can use the roof for a sun-parlour. We use four-by-four joists, cut into twelve-foot lengths, for the front of the house, as they can be nailed to the house and need not be sunk into the ground, as those at the side and far end must be. The joists for the sides and end are cut into thirteen-and-one-half-foot lengths, which allows a foot and a half to go into the ground. These measurements allow the use of four-foot netting without any waste. For a house twelve feet long, I think the yard should be at least fifty feet. Erect several perches at the far end of the yard, a platform about two feet wide and four feet long on legs three feet high in the centre of the yard for the bath-tubs to stand on. Pigeons must have a bath, for cleanliness is a necessity; a pan about two feet square and four inches deep is the best size, and they can be bought in galvanised iron for one dollar each. Red-wheat, Kafir-corn, cracked corn, Canadian field-peas, German millet and hemp-seed are all appropriate for pigeons. They should be alternated, or one or two mixed together. Of course, sometimes one grain is cheaper than another, or easier to get in certain districts, but don’t use any one grain exclusively. Pigeons must have variety. We follow the rations recommended by W. E. Rice, a very experienced pigeon-raiser. Morning: Equal parts of cracked corn, Kafir-corn and wheat. Evening: Cracked corn and Canadian peas. These regular meals are put into the feed-boxes in quantity 83 sufficient to insure the birds having a constant supply. Treats which we feed at odd times, such as millet, hemp and rice, are thrown on the ground, for, as they are only fed in comparatively small quantities, they are eaten up at once, and so there is no danger of their being soiled. Remember always to buy red, not white, wheat, for the latter is very apt to cause diarrhea. Once a week we give them a meal of stale bread which has been steeped in skim-milk and squeezed almost dry again, for we have lots of skim-milk, and the bread we get from a baker in the town for twenty-five cents a barrel. Freight costs another twenty-five cents, but even at fifty cents a barrel we find it an economical feed when there are a lot of squabs to be fattened for the market. The parent birds take all the trouble and responsibility of feeding and raising the young right up to the time they are ready for market. The hen-bird lays two eggs, with one day intervening, which take eighteen days to incubate. After the eggs are hatched, both birds devote their entire energies to feeding the youngsters for about two weeks, for both have the power to secrete the predigested substance often called pigeon’s milk, on which nestlings are exclusively fed for the first few days. At the end of two weeks the hen has usually laid two more eggs in the second nest, so that by the time the squabs in the first nest are ready for market, the second eggs are ready to hatch. It is this double family which necessitates two nests for each pair of birds. 84 Cleanliness is even more imperative in the pigeon-house than in the hen-house. Never neglect to scald out the earthenware nest, and whitewash the compartment it stands in, every time squabs are removed for market, for it is only by such rigid system that the place can be kept in a sanitary condition. Pigeons must have shell, salt and charcoal to be healthy, so there should be a self-feeder with three compartments in each house. When ordering, specify that the oyster-shell is for pigeons, as it is to be broken up smaller than for the hens. The rock salt and charcoal should be ground to about the size of rice. During the heavy breeding season we crush most of the grain, and always peas, for when the parent birds are rushed for time between their two nests they are very liable to pick up whole grain and feed to the young birds before they are able to digest it. Until we discovered this carelessness, we often had a dead squab in the nest. The feed-boxes can be kept filled up, as pigeons never overeat, and must have access to food at all times when they have young ones to feed. If you start with a few pairs of birds, the best way to increase the number is to sell the squabs, and use the money to buy mature birds, for it takes pigeons six months to reach maturity, and it is necessary to have two extra houses in which to keep the growing birds, as they should not be allowed to remain in the regular brood-pen. If, however, you have specially-mated birds and desire to raise their progeny, you must watch the nests, and as soon as the young ones 85 get out on the floor (the old ones generally push them out when the eggs in the second nest hatch), they can fend for themselves, and should be removed to a nursery-house, where all feed must be cracked to the size of rice for several weeks. When one desires to build up size and good points, it is necessary to have two nursery-houses, and so be in a position to select the best birds from different parentage to mate. To illustrate: The nestlings from one side of the house should go into Nursery No. 1, nestlings from the other side into Nursery No. 2. Our nurseries are only seven by ten feet, so we never have more than twenty birds in each, and they can be taken within a few days of each other, in this way making very little difference in age when it comes to mating-time. When the younger ones in the nurseries are between six and seven months old, we take a bird from each and put them into a mating-cage, which is really a coop, four feet long, two and one-half feet deep and two feet high, which is fastened up in a corner of the feed-house. The coop is divided into two compartments by a wire-netting door. A bird is put into each compartment. If they are male and female, they will commence within a week or two to coo and talk to each other through the wire, at which time the compartment is fastened up to the top of the cage, and they are allowed to have the run of the coop for three or four days, after which they are put into a regular breeding-house, where they will soon take possession of the nest. If, however, the birds chosen simply 86 ignore each other after they are put into the mating-cage, one of them is removed to another cage, and two more birds are taken from the nursery-house and put into the two compartments. In this way we go through the nests until we have them all paired. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2935/80610.html","bookId":1094,"book":{"id":1094,"title":"Making Home Profitable","description":"简介： IT is just sixteen years since misfortune brought about our emancipation. A disastrous business venture made it necessary to curtail expenses. Rent being an especially heavy item, the hunt for a cheaper habitation commenced. Toiling up and down innum...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2935","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
