{"id":41656,"no":27,"title":"RAISING PIGS","content":"A COUNTRY home large enough to maintain a cow should certainly keep a pig, if things are to be run on a profitable basis, for the skim-milk, buttermilk and waste vegetables cannot be satisfactorily disposed of, unless there is a pig to consume them. Build the sty first. Ours is built on the English plan, a sleeping-compartment six feet square, five feet high in front, three feet at back. Outer compartment of same size, with walls three feet high, floor slanting slightly to the front. There is a trough in each corner of the open compartment. The floor of the sleeping-room is six inches higher than the outer compartment, and the whole building, except the roof, is made of concrete, so can be easily and thoroughly cleansed. If several sows are to be kept, each must have a sty, and there should be one or two large ones for young stock. The piggery should be as far from the house and water-supply as possible. If funds have to be very carefully dispensed, start with a pair of young ones, which usually can be bought in any farming district in the spring for about six dollars a pair when six weeks old. They will need a little extra care at first, a warm bed of common hay 200 or dry leaves over straw. It is advisable to watch them at feeding-time to see that they eat. The first week boil a quart of wheat-bran, pounded oatmeal (hulled oats very coarsely ground), coarse corn-meal and white middlings, and twelve quarts of water for half an hour. Let stand until cold, then add skim-milk sufficient to make it like rather thick gruel. Give four quarts three times a day for two pigs. Gradually accustom them to vegetables. Outside leaves of cabbage, lettuce and other greens, potato-peelings and peapods can all be utilised. Boil until tender, mix a little bran or round oats with them, and feed once a day. After a week or ten days gradually reduce the gruel and substitute regular feed, bearing in mind always that frame must be built before fattening is attempted. If there is plenty of cash in the exchequer, time can be saved by purchasing a mature sow due to farrow in April. When making your selection, choose a placid-looking animal with a reputation for being a good mother. A vicious, bad-tempered pig is a menace on a home farm. Moreover, the vicious sow is generally a bad mother. Probably no animal is more easily affected by the treatment it receives when young than a pig. Treated kindly, they become tractable, gentle creatures; if abused, surly and dangerous. For this reason it is perhaps better for the amateur to commence with a pair of little ones, or one old sow. Suppose you have bought a sow after breeding; you may expect little ones in sixteen weeks. Her litter may consist of 201 any number from six to fourteen. Let her have plenty of exercise until a few days before she is due, then restrict her range to her own sty. For safety, it is well to make a fender-like frame that will stand about six inches above the floor and the same from the side-walls. Then if Mrs. Mother is careless enough to roll over, any baby that happens to be in danger of being crushed can escape under the fender. We used some old oak fence-rails, cutting them to fit snugly across from wall to wall, and bored large auger-holes seven inches from each end. Strong bolts and nuts were put through the corners, and blocks of wood six inches square are placed for it to rest on; being bolted together, they are easily taken apart and in and out of the pens, as they are not wanted after the little ones are a few days old. Have the sleeping-compartment thoroughly cleaned out and bedded with straw and the fender put in place four or five days before the litter is expected, and don’t disturb it after that until they are four or five days old. Put a small quantity of clean straw in the outer compartment during the last week. About a month before farrowing-time let bran and ground oats predominate in the sow’s rations, and add a little linseed-meal. She should be kept in full vigour, but not allowed to get fat, for which reason corn is best eliminated from her food. After the litter has arrived give nothing heavier than a little bran-gruel for twenty-four hours. Feed lightly for two or three days, then increase, giving her about all she wants; 202 at the end of ten days commence to add corn-meal in limited quantities and green food of some sort, unless the weather is such that the family can go out to pasture. There should be a little opening in the outer compartment large enough for the youngsters to creep through, and outside a fenced-in yard, in which there is no trough. When the babies are two weeks old give them a little grain. They will soon learn to help themselves, and so reduce the trouble at weaning-time. We take the mother away when they are six or seven weeks old and let her run with the herd until again near farrowing-time. If a boar is kept, he should have his own sty and a separate yard. His food should be good, but not too fattening. The best age is between one and five years. To keep pigs successfully on the home farm, you must disabuse your mind of the idea that they are naturally dirty creatures, for they really are not. Given clean quarters, a stream to bathe in, and wholesome feed, they are as self-respecting as any animal on the farm. If there is no brook nor spring-place near the pasture, a large patch of sod should be removed, and the hollow filled with water. After a few weeks let it dry up, and make a new bath. See that no horrible half-mouldy swill-barrels are kept around. Table scraps, excepting meat, vegetable peelings, small potatoes, apples, in fact all unmarketable vegetables, are boiled in the food-cooker with about the same amount of salt that we should use in cooking for the table. When everything is soft, bran, 203 crushed oats, shorts or middlings are stirred in to make it into a thick porridge, the whole being closely covered and allowed to stand until cold. Sometimes cornstalks are chopped and boiled in the same way. When a feed-cooker is used, preparing the food is very little trouble, and most certainly it goes further than uncooked. Each animal has a pailful night and morning. Skim-milk and buttermilk, when there is any to spare, and a forkful of ensilage in the winter when there is no pasture. Water stands before them all the time in one of the cement troughs, into which twice a week a pailful of coal-ashes is put to aid digestion, and once a week an ounce of sulphur and charcoal is added to the feed. When pigs weigh about one hundred pounds, corn can commence to take the place of their grain, for from then on fattening is the one end and aim of management. The fleshy, small or medium pig, which weighs from two hundred and fifty to three hundred pounds brings a better price in the Eastern markets nowadays than the large greasy pig, so that returns are realised more quickly, and it pays to force them with the best of food. If by any chance a sow should farrow late in November, it is more profitable to market the little ones as sucking pigs than to try to keep them through the cold of January and February. Ham and bacon is necessarily a staple in country households, and a real luxury when home-cured. As soon as the meat is cool, it must be cured, for should it become frozen, it is impossible to turn it into good ham and bacon. Sugar 204 and Wiltshire are the two preferred methods. There is a small hand-machine on the market, specially made for injecting the liquid for the Wiltshire method. The positive price I don’t know, but I believe it is about ten dollars. However, I have used a white metal syringe, which holds thirty-six ounces and answered very well for the small quantity undertaken. The process given in an old English receipt is as follows: Add to five gallons of water, twelve pounds of salt, one pound of saltpetre, one ounce of salt prunella, two pounds of brown sugar. Bring slowly to the boiling point, let simmer for fifteen minutes, skim; when cool it is ready to use in the injecting machine or syringe. Insert the syringe in the flesh, and inject the pickle. This is to be done every few inches over the entire surface of the meat, to insure the full piece being permeated with the liquid. Lay the meat on the slab, powder with saltpetre, lay the rind side downwards and cover the cut side with a thick coating of salt. The work should be done on a stone slab, or hardwood bench with raised edges. Let the meat remain fifteen days, and recover with fresh salt. After seven days more, wash the meat with clean cloths, and hang up to dry for several days before smoking. The dry sugar-cured method, is, I think, to be preferred in this country, because it is more generally liked. Place the hams and sides on a slab, and proceed as follows: Mix five pounds of salt with three pounds of brown sugar and two ounces of saltpetre. Thoroughly rub all parts of the meat, every third day 205 for three weeks, after which, wash and wipe and dry for smoking. Of course, you know that nothing but hard wood must be used for the fire. Green hickory is the best. Sausages should be composed of one-third bread—stale bread grated. Never use new or moistened bread. Casings only cost five cents a pound, so it is better to buy them already prepared. A good mixture is five parts lean pork, one part fat, two parts veal or mutton. Pass through the chopping machine, then to every eight pounds add one teaspoonful of dried and finely powdered sage, thyme, and marjoram, two teaspoonfuls each of mustard, pepper and salt. Add the bread-crumbs last, thoroughly mix, and fill the casings. Make short, fat links.","sourceLink":"http://novel.tingroom.com/duanpian/2935/80627.html","bookId":1094,"book":{"id":1094,"title":"Making Home Profitable","description":"简介： IT is just sixteen years since misfortune brought about our emancipation. A disastrous business venture made it necessary to curtail expenses. Rent being an especially heavy item, the hunt for a cheaper habitation commenced. Toiling up and down innum...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2935","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
