{"id":41632,"no":3,"title":"THE SITTING HEN AND THE INCUBATOR","content":"LOOKING back over the memories of my farm initiation, it seems as if I had not fully realised the possibilities of my new undertaking until the first incubator was inaugurated. As I have already told you, I did all the first year’s hatch under hens, and still set every hen that evinces any desire to assume the cares of motherhood, because it seems Nature’s plan to keep the egg machine in good working order. If a broody hen is not allowed to sit, it takes several days of incarceration to break up her desire, then several days more after she is freed before she commences to lay, and invariably the sitting fever will attack her again within a few weeks. Now, incubation takes only three weeks; brooding of chicks, another four or six weeks, and Mrs. Biddy has had a complete rest, followed by vigorous exercise while scratching for her babies. So when she is returned to the yard she is in perfect condition to produce eggs. Let Biddy sit whenever she wants to, but don’t wait her pleasure in the early spring, for you might have no young chickens to sell when they bring good prices. THE SELECTION OF THE INCUBATOR There are a great many incubators on the market, some heated by hot air, others by hot water. If you 30 select any one of the standard makes advertised you will get a good, practical hatcher. Printed instructions for setting up and running are sent out with every machine, but they don’t emphasise all the important points quite strongly enough for amateurs. Lots of people can’t drive a screw home accurately, and fail to realise that if the head is slightly to the right or left it throws the fixture which is being attached to the machine out of plumb, and a hair’s breadth makes a difference when such delicate appliances as thermostatic rods (the power which controls the heat), are concerned. A blunder supplies much knowledge. I should never have realised the necessity for absolute exactness if one of the screws used in attaching the lamp support to our second incubator had not gone slightly awry. It caused the chimney almost to touch one side of the socket into which it fits. That, in turn, drew the flame to one side, and caused it to smoke at night when turned up for extra heat. It was a very little blunder, apparently, but it almost spoiled the incubator, and quite spoiled the hatch. To be sure that the incubator fixtures are plumb, use a spirit level, the only safe guide. After starting the machine, practise running it for a few days before putting in the eggs. When the heat reaches one hundred and two and one-half degrees, with the escape dial hanging the width of a match from the opening, put in the trays, which, being cold, will lower the heat, and should close the dial until the trays become warm, and the thermometer in the machine again registers one 31 hundred and two and one-half, when the dial should once more be dangling the match width above the opening. Should the closing and opening not take place as the heat varies, the machine is not properly adjusted, and you must practise until it will bear the test before putting in the eggs. The thermometers are supposed to have been tested before they are shipped, but it is well to buy an extra one and compare them; or get your doctor, who is sure to have an accurate thermometer, to do it for you. The egg tester comes with the incubator. It is a tin, funnel-like chimney that fits over the lamp, and has a projecting opening, bordered with black, before which to hold the eggs. The first test should be made on the seventh day; the second on the fifteenth day. Hold the egg, large end uppermost, in front of the opening. If it looks perfectly clear it is infertile and can be used to feed young chicks. If it shows a dark-red spot with spidery legs it is fertile, and must be returned to the incubator. Dead germs are rarely discernible at the first testing, except to the expert eye. By the fifteenth, the veriest amateur will be able to detect them. Successful incubation depends principally on being able to maintain the amount of heat and moisture necessary at the different stages of development. A thermometer is furnished with most incubators, but as yet hygrometers are not, so it is advisable to buy one. For as they only cost $1.50 each, it would be pennywise and pound-foolish to do without one. Having these two little instruments to tell exactly the amount of heat 32 and moisture present in the machine, simplifies the work wonderfully. Personally, I like to have the thermometer register 102 degrees, and the hygrometer 75, when I first put the eggs in the incubator. The second week, the heat is increased to 102?, and the moisture lowered to 70 degrees. The third week, heat from 102? to 103; moisture not over 45 until the nineteenth day, when the moisture is again increased to 55 or 60 degrees. The reason for such fluctuation in the moisture may need some explanation. During the first stages of incubation it is necessary to prevent the escape of the water which is part of the egg, as it is needed to keep the albumen in the right condition for the development of the germ. After the tenth day, when the embryo is formed, the water should be gradually allowed to evaporate, so that the amount of air inside the shell increases, as it is needed to aid the circulation of the blood and permit the growth of the chick. Increasing the moisture again on the nineteenth day is simply done to soften the inside skin of the egg and make it easy for the chick to break through. When extra moisture is to be supplied, place a pan of wet sand or a damp sponge in the bottom of the incubator. If the machine is standing in a very damp cellar, the difficulty is often to keep down the moisture rather than to increase it. In this case, keep the trays out of the machine for a greater length of time when you turn the eggs each day, and open the ventilators. Probably the safest 33 and simplest way to learn how to gauge this important point of moisture, is to set a hen at the same time that you start the incubator, and then compare the development of the air-cell in the egg every few days. If the development is too slow, open the ventilators at the side of the incubator wider, and air the eggs a little longer each day when you have the trays out to turn the eggs. Reverse affairs if the development is too quick. It is better to run the machine a degree or two above the given temperature than below it, especially during the last few days. After the morning of the twentieth day don’t open the incubator until the hatch is over, or until late on the twenty-second day, and don’t get nervous if the temperature runs to one hundred and four or even to one hundred and five; it is caused by the animal heat of the chicks, and will do them no harm. Turning down the lamp slightly will of course reduce the heat; but be very careful not to let it run below one hundred and three during the last twenty-four hours. Low temperature prolongs the hatch, weakens the chickens and makes them susceptible to all sorts of ailments. Individual outdoor brooders I think are the best, for in very cold weather they can stand in a light outhouse. I used to monopolise the summer kitchen from February to April, and then have them placed out in the orchard. Placing an outdoor brooder under cover is really only for the convenience of the attendant, for they are storm proof. If you commence with an incubator that holds one hundred and twenty to one hundred 34 and sixty eggs you will require two brooders, and if in a cold or Northern locality, some small house which can be warmed during very cold weather, if you propose commencing to incubate in January. A brooder supposed to hold one hundred chickens will accommodate that number comfortably for about nine days, after which not more than fifty should be kept in it. Hence the necessity for two brooders. When the chicks are six weeks old in cold weather, and four weeks old in moderate weather, they can be removed to the small house (the temperature of which should be kept at sixty degrees during the night). Remember, incubation takes only twenty-one days, so you must allow at least three weeks to elapse before starting the incubator a second time. Give the brooder a good coat of whitewash inside before using it. Cover the drum which furnishes the heat under the hover with two or three thicknesses of flannel, to make it soft for the little bodies to cuddle up against. Cover the floor of the hover compartment with a piece of old carpet or felt, and the outside compartment with sweepings from the haymow. Have the heat running steadily at ninety-five degrees for several hours before the chicks are to be put into it, and keep it at that heat the first seven or eight days. Then gradually let it fall to seventy-five degrees. Of course, I mean the heat under the hover. The rest of the brooder will be—and should be—several degrees lower. 35 THE CARE OF THE CHICKS IN THE BROODER Keep fresh water in vessels into which the chicks can get only their bills in the outer compartment. Never neglect seeing that they are all safely cuddled up to the heat at dusk. During the bright, sunny hours in the middle of the day let the chicks have plenty of fresh air in the playroom; at feeding time, when they are all busy, give the hover compartment a thorough airing. When Biddy is doing the brooding, remember she is pretty sure to need dusting with some good insect powder. The nest box she sat in should have been cleaned, and a handful of camphor balls scattered under the hay of the nest. Moreover, each hen should be dusted before setting, twice during the twenty-one days, three days after the hatch is out, and each week so long as she broods the chicks. Fresh air, warmth and good food prevent many troubles almost impossible to cure if once contracted; so look to the little things. Thirty hours must be allowed for the proper digestion and assimilation of the yolk, which is absorbed into the abdomen immediately before the chick breaks through the shell. When Biddy has done the hatching do not move her to the brood coop for twenty-four hours, unless she is flighty and keeps getting off the nest, in which case it is better to keep the chicks in a covered box by the kitchen stove until some more motherly hen can be persuaded to adopt them. Always 36 try to set two or three hens at the same time. Good hens that are well fed and have not been bothered with vermin seldom give any trouble about the last twenty-four hours. HOW TO DIVERSIFY THE DAILY RATION Now about the all-important question of feeding: For the first two or three days get ten pounds of rape and millet seed, pin-head oatmeal and cracked corn, charcoal, and fine, sharp grit. Mix all together. If you cannot get pin-head oatmeal, buy hulled oats and break them up fine. The grain must also be cracked quite fine; in fact, it is safer to put the mixture through a sieve which will allow nothing larger than millet to go through. Then there is no danger of chicks being choked. Feed the mixture by scattering among the sweepings, to encourage the chicks to scratch and take exercise. Morning and evening make a mash by chopping a hard-boiled egg, shell and all, green onion tops or sprouts. Mix with stale bread crumbs, and feed on a flat pie plate or strip of wood. After the chicks are two weeks old the oats and corn need not be quite so fine—more the size of hemp seed, which can be added to the mixture; so can cracked wheat or barley, and the mash can be made of ground corn and oats, with onions and scalded liver, chopped, three times a week (about a small cupful to a quart of mash). What I mean by scalded liver is liver dropped into a kettle of boiling water and let boil up once. Leave 37 to cool in the water. Quite raw it is too strong for little chicks. For a change I mix the grain with scalding milk two or three times a week. Never make more at a time than will be fed within the next few hours, as it sours. Pot cheese is a favourite dish with all poultry, and very wholesome. If there is any tendency to bowel trouble, give them rice water in place of the drinking water. Keep brooders and brood coops clean and dry. The grass around the coops should be kept cut loose, so that the chicks can run about easily. See that every coop is closed at night, and do not let the chicks out while the grass is dewy. Don’t give the hens too many chicks to brood in winter, for if she cannot keep them close to her they will die of chill.","sourceLink":"http://novel.tingroom.com/duanpian/2935/80603.html","bookId":1094,"book":{"id":1094,"title":"Making Home Profitable","description":"简介： IT is just sixteen years since misfortune brought about our emancipation. A disastrous business venture made it necessary to curtail expenses. Rent being an especially heavy item, the hunt for a cheaper habitation commenced. Toiling up and down innum...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2935","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
