{"id":41635,"no":6,"title":"THE POULTRY YARD","content":"The large hoppers are nothing more than boxes, five feet long, two feet wide and six inches deep, over which is placed an A-shaped cover, made of slats, one 49 inch apart, to prevent the birds getting into the box and scratching the grain onto the ground, where it will be wasted. For water, five-gallon kegs are used, with an automatic escape, which keeps a small pan continually full. Both feed and water are placed under a rough shelter, to protect them from sun and rain. Using such large receptacles, it is only necessary to fill them every other day. Feed consists of a dry mash, composed of ten pounds of wheat bran, ten pounds of ground oats, one pound of white middlings, one pound of old-process oil-meal and ten pounds of beef scraps, all well mixed. In addition to that, they receive at night a feed of wheat and cracked corn—two parts of the former to one of the latter. About half a pint is scattered in front of each coop, at about four P. M. Grit is supplied in large quantities. Being near a stone-crusher, we buy the screenings by the cart-load and dump it in heaps on the outskirts of the orchard, where it does not show, but is quite accessible to the chicks. On these rations, without any variation, the pullets are kept until September, when they are transferred to their winter quarters—houses twelve feet wide, ten feet high in front, sloping to eight feet at the back. Each house is divided by wire netting into twelve-foot compartments, in each of which forty birds are kept. Winter feeding commences as soon as the birds are settled in their houses, and consists of the same mash as when on range, except that ten pounds of corn-meal 50 is added, and, instead of the ten pounds of commercial beef scraps, sixteen pounds of freshly cracked green bone is used, and, in place of being before them all the time, it is fed once a day, just what they will eat up clean in fifteen minutes. Until three years ago, we used to moisten the mash and feed at eight o’clock in the morning. Now we feed it dry, at 2 P. M.; at night, wheat, cracked and whole corn, scattered over cut straw, which covers the floor of the house. The proportions are three pounds of whole corn, one pound of wheat and two pounds of cracked corn. The birds are always eager for the whole corn, and, as they run about to pick it up, the cracked corn and wheat get shaken down into the litter, so they rarely get any but the whole corn at night, which fills up their crops and keeps them warm until morning, when the fine grain induces them to scratch—vigorous exercise, which sets their blood circulating and keeps them busy until 8 A. M., when the drinking-fountains are filled up with hot water. For green food we use Swiss chard, cabbage and rape until frost destroys the supply, after which we resort to clover hay, chopped and steamed. It is fed at about 11 A. M., a large panful to each compartment, and at the same time a pint of wheat and cracked oats is scattered on the floor. Sharp grit and oyster-shells are always before them, and in very cold weather the drinking-fountains are filled up again with hot water at eleven and three o’clock. If you have no orchard, or other partly shady place 51 for coops, it will be necessary to erect some sort of shelters for the birds to rest under during the heat of the day. Any sort of material or shape will do, so long as protection from the sun is afforded. If free range is quite impossible (as it often is for suburban poultry-keepers), the birds must be given as large yards as possible and supplied with lots of scratching material, over which small grain must be scattered two or three times a day. Fresh green bone will be better than the beef scraps. Vegetable food is most imperative under such circumstances. Sow a large patch of Swiss chard; it is a true cut-and-come-again crop. Oats and rape are also useful crops for poultry-keepers who can give their birds free range through the summer. A word of warning: If you are reduced to cutting grass, or use lawn-clippings, be careful to have them cut into short lengths of not more than an inch, otherwise the birds may become crop-bound. The cockerels which go into the market-pen are fattened and sold as quickly as possible, except the few we keep for stock, and these are given large yards and fed in the same manner as pullets on range. For fattening birds, use ground corn and oats in equal parts, add half a part of charcoal and moisten with skim-milk. Give plenty of green food and sharp grit. Feed little and often. All expedition must be used in the matter of marketing, for every day’s delay after they reach the desired weight is a dead loss. Constant culling and marketing is one of the great 52 secrets of success. Culling must be observed just as rigidly when selecting winter stock. Discard any faulty birds. There are always some in every flock, even if the parent birds have been blue-ribbon specimens: Crooked tails or feet, ear-lobes which are red instead of white, or white instead of red, according to the variety you may be keeping. Wyandottes, Orpingtons, Plymouth Rocks, Brahmas or Cochins should all have bright-red ear-lobes. Leghorns, Minorcas and Andalusians should be pure white. It is a bright, energetic-looking pullet which makes the best layer, and it is not profitable to keep any but the best layers, so put them into small pens and fatten. The young roosters bring good prices in the fall, and their absence from the farm reduces feed-bills and prevents crowding in the house, which is always disastrous. Do not delay, after September first, in getting the pullets into their winter quarters, for it is most important that they become accustomed to their new surroundings and reconciled to the change from free range to semi-inactivity. It often takes five or six weeks for them to become accustomed to the new conditions, and, unless they have time to adjust themselves, they won’t start laying until cold weather sets in, which means that the egg-crop is likely to be unprofitably delayed. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2935/80606.html","bookId":1094,"book":{"id":1094,"title":"Making Home Profitable","description":"简介： IT is just sixteen years since misfortune brought about our emancipation. A disastrous business venture made it necessary to curtail expenses. Rent being an especially heavy item, the hunt for a cheaper habitation commenced. Toiling up and down innum...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2935","creation":"Aug 1, 2019 12:24:20 AM","modification":"Aug 1, 2019 12:24:20 AM"}}
