{"id":82805,"no":29,"title":"Page 29","content":"“Your heat, I hate losing it.” He stands, pulling up his jeans; and I wrap my arms around him, shoving my face into his chest, breathing him in. “Shower,” he says, swinging me up into his arms, carrying me into the bathroom. That night after we stripped the bed, Trevor in his normal position, his body on top of mine—I thank my dad for sending me a man like Trevor. I don’t know why, but I know that he has something to do with Trevor being placed in my life. Chapter 11 Trevor \"I thought we talked about this?\" I look at Liz, and then back down at the round case of pills that are taunting me from the counter. I told her that I want to start working on getting her pregnant. I need to know that she is tied to me in a way that is unbreakable. Yeah, she has my ring on her finger, and in a week she\u0027ll have my last name. But that\u0027s not going to be enough. It might make me a controlling dick, but I need it. I have to know that we have something to tie us together through eternity. \"No, you talked about it. You said what you wanted, and I told you that I don\u0027t want the same thing.\" \"Baby, I know you want the same thing as me.\" \"In Trevor\u0027s universe, I\u0027m sure you think that.\" She stands, taking her plate to the sink. \"You love July.\" My anger is starting to surface, and I know that I need to stop before I say something I can’t take back. \"I do,\" she whispers. I can see tears forming in her eyes. \"Talk to me; tell me what the fuck is going through your head?\" I yell. Her eyes meet mine, and there is so much pain looking back at me that I flinch. \"I can\u0027t do it,\" she whispers, right before she runs out of the house. It takes a second to realize that the sound I hear is her car spitting up gravel in the driveway. \"Fuck!\" I roar, picking up her pill case and crushing it in my fist, before I throw them across the room, grab my keys, and head out to find my fiancée. I have driven all over town, and called everyone and anyone who might know where Liz is, but no one has heard a word from her. Logically, I know that she\u0027s okay, but I feel sick with worry and know I won\u0027t be able to breathe easy until I can see her and touch her. Something in my brain makes me drive by the cemetery where her father is buried. When I see her car parked outside the gate, all the things I didn\u0027t understand, the things she has been keeping bottled up, slide into place. Shutting off the engine, I hop out of the truck and walk through the giant iron gates. I look to the left, seeing a bright blue blur off in the distance. When I get closer, I see Liz kneeling, her head to the ground in front of her father’s grave. Watching her small body shaking with sobs, my gut tightens, and my stomach drops. Seeing the woman I love in this kind of pain kills me. Once I reach her, I pull her into my arms, breathing her in. \"I can\u0027t do it. I love you, but I can\u0027t have your baby,\" she cries, her voice filled with so much pain that it feels like my skin is splitting open. \"Baby, what happened to your mom and dad is not going to happen to me and you.\" I feel her trying to climb into me; I hold her closer, trying to absorb some of her pain. \"Your dad would want you to be as happy as possible,\" I whisper into her hair, running my hands up and down her back, trying to comfort her. \"I’m af–afraid that I’ll leave a kid behind like I was left behind. I d–d–don’t want that to happen,\" she stutters out, her body rocking against mine with the strength of her tears. \"Breathe, baby.\" I\u0027m trying to speak quietly, stroking my hand down her back. \"You know that we can\u0027t predict the future, but you and I not sharing the love that we have for each other with a life that we create together would be devastating to me. I love you so much more than I ever thought was possible to love another person. You have made me a better person, taught me that love—real love—is unconditional, and has no strings attached, and is given without expecting anything in return.\" I pull her face away from my body so I can see her eyes. \"I want to share everything with you. All the good and the bad that life has to offer, I want you by my side for all of it. \"What happens if one or both of us dies? What happens then?\" \"You can\u0027t live your life thinking ’what if‘. There are too many variables.\" I tell her honestly. \"Do you think that if your dad knew that he was going to leave you while he was still young, while you were still young, that he wouldn\u0027t have wanted the time he had with you, Tim, and your mom? Or do you think that even with his time cut short, that he appreciated every single second that he had with y’all, knowing that he had his family and people who loved him.” “He left me!” She cries harder. “He did leave, but he never left you. He is always with you.” “I miss him.” “I know you do, baby,” I struggle out against the lump in my throat. “I know you do.” “I don’t want anyone to miss me.” Her words are so quiet, that I hardly make them out. “If something happened to you, I wouldn’t know how to go on without you. I would miss you every day; so would everyone else that you have given even the smallest amount of your time to. Every person you come in contact with is lucky to know someone like you. Knowing the kind of woman you are lets me know that when you become the mother to our children, they will be lucky, because you love so completely with everything you have.” “I don’t know if I can do it.” “Tell me,” I say, pulling her face out of my neck, looking into her eyes. As much as it would kill me to not have a child with her, if that is what she truly wanted, I would do it for her. “You don’t want a baby?” Her face goes slack; tears start to fall harder. “When I think about never having a baby, it makes me feel sick,” she whispers. “But when I think about having a baby, I feel panic.” I nod my head in understanding. “Have you ever talked to anyone about losing your dad?” She shakes her head. “Would you, if I went with you?” “Do you think I’m crazy?” “No, baby. I think that you haven’t ever had a chance to deal with losing your dad. Maybe talking to someone will help you get some closure.” “I’m not ready to have a baby, Trevor. I love you and know that it’s something that you want, but I just…I’m not ready. I don’t know if I will ever be ready.” As much as her words make my heart ache, I know she’s right. Until she is completely ready, it wouldn’t be fair to force something on her that could give her anxiety; especially when it is supposed to be something that is celebrated. “When, or if, you’re ever ready, we will talk about it then.” “I don’t want to prevent you from having a family.” “You’re my family, and if you’re all I have for the rest of my days, I will be okay with that.” She starts crying again, this time harder than before. “It will be okay, baby. One day at a time, we will work through this.” “I don’t want to lose you.” “I’m not going anywhere; not without you.” “Okay.” “Okay,” I say back. “Let’s go home.” “Please.” I walk back out of the cemetery with Liz tucked under my arm. When we reach her car, I look down at her. Her beautiful eyes are puffy and red; she looks exhausted. “I’m gonna call the boys and have them come get your car to bring it home so you don’t have to drive.” “I’m okay.” “I know, but you’re not driving. Get in the truck; I’m going to move your car over to the parking lot.” “Fine,” she grumbles, making me smile for the first time today. “Be right back.” I open the truck door, lifting her in, pull her face down to mine, and give her a quick kiss, before slamming the door closed. I jog to her car, slide behind the wheel, pull it into the parking lot, and shove the keys under the seat. I call Nico, asking him if he can have someone drop him off and drive Liz’s car home for me. He agrees immediately; I hang up and jog back across the parking lot to where my truck is parked in front of the cemetery, open the door, and slide in. “How do you feel about taking a nap?” I ask, pulling her across the seat by the waist of her jeans. “I could use a nap, but I’m supposed to meet the seamstress for my last fitting.” As soon as the words are out, her body stiffens. I can see the wheels in her head turning. “If you even think for one fucking minute that we’re not getting married next week, you’re out of your damn mind,” I growl, a little more anger leaking into my words than I wanted, but fuck that; we’re getting married. “Are you sure?” “Fuck yes.” I watch as she chews her lower lip, her eyes coming to mine. “I told you before that one way or another, we’re getting married. Even if I have to drag you down the damn aisle, you will have my last name in a week.” “Then I need to go have my last fitting.” “What time?” She looks at the dash, then back to me. “Six.” “Alright, we have a few hours. We can go home and relax till then.” I put the truck in drive, flipping a U-turn onto the main road. Once on the road, I pull her under my arm; her head lays against my chest, and the silence of the cab allows me to concentrate on her even breathing, the sound so soothing that my body relaxes, and I just enjoy the feel of her next to me. The entire way home, I think for the first time how easily this could be lost, and how lost I would be without it. It’s been five days since Liz broke down about having a baby. Five days of wedding planning, lots of laughter, and tons of family. Tomorrow, I marry the woman I will be spending the rest of my life with. This last week has been good for Liz—for the both of us, really. For the first time ever, Liz spoke to her mom about her father’s death. Her mom surprised Liz by telling her that shortly after she and Liz started to rebuild their relationship, she started seeing a counselor to help her work through the grief she was feeling. I was pissed when Liz told me this, mad that she never thought to have her children talk to someone about their own feelings and what they were going through. I wanted to rage about the situation, but logically knew it would do no one any good to have me flip the fuck out about something that happened years ago. After Liz talked with her mom, she agreed that it was time to talk to someone about how she’s been feeling, and the fear she lives with every day, thinking that something bad is going to happen to her or someone she loves. I never knew how much she had been holding in until the day of her first session, two days after her breakdown in the cemetery. She called me, asking if I could come get her from the building where her doctor’s practice was. I could hear the tears in her voice when I answered; she sounded so lost. When we got home, she opened up about the conversation she had with her doctor. She said he explained that she had a form of anxiety, and a mild case of PTSD, brought on by the loss of her father and the lack of acceptance from her mother after his death. The doctor explained that with sessions and medication, she would be able to learn how to process what she is feeling in a positive manner, instead of trying to bury it the way she always has. I know that it’s going to be a lot of work for her, but I also know my woman is strong and can handle anything; and if there is ever a point when she thinks she won’t be able to make it, I will pick her up and carry her.","sourceLink":"https://allnovel.net/until-trevor-until-2/page-29.html","bookId":2745,"book":{"id":2745,"title":"Until Trevor (Until #2)","description":"Storyline: Until Trevor (Until #2) Trevor Mayson had his life planned out - make the family business successful and play the field for a few more years before eventually settling down. Then he sees her. Liz Hayes was beautiful, shy and everything that he could ever want...but she didn\u0027t fit into his plans. After Trevor painfully rejects her, Liz finally starts to move on, but Trevor is finding it difficult to truly let her go. It seems the more he tries to stay away, the more intense his feelings for her become. Like a stretched rubber band, he can only take so much before snapping. Liz Hayes is done waiting for Trevor and isn\u0027t interested in getting her heart broken by him again, but Trevor is making it difficult for her to forget him when he shoves his way back into her life. Can Trevor prove to her that he is worth falling in love with again, and is he ready to change his life plan to let her into his heart?","cover":"https://allnovel.net/images/until-trevor-until-2.jpg","author":"Aurora Rose Reynolds","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/until-trevor-until-2.html","creation":"Oct 5, 2019 8:59:20 AM","modification":"Oct 5, 2019 4:46:15 PM"}}
