{"id":67798,"no":23,"title":"Page 23","content":"“Actually, no.” Aria turned away and hugged a pillow to her chest. Fury pulsed inside her like a second heart. “I don’t want Klaudia to teach me anything.”\\n\\n The bed springs squeaked as Noel sat back down. “I thought you guys were friends. Klaudia adores you!”\\n\\n A bitter chuckle escaped from Aria’s lips. “I highly doubt that.”\\n\\n “What do you mean?”\\n\\n Noel was staring at her with such a puzzled look on his face. Aria thought about the texts Klaudia had written about both of them. Should she tell Noel . . . or would that make her look like a psycho?\\n\\n “I just don’t trust her around you,” Aria said. “I see the way she looks at you.”\\n\\n Noel’s face fell. “Don’t be like that, Aria. I’ve told you a million times you have no reason to be jealous.”\\n\\n “It’s not jealousy,” Aria argued. “It’s the truth.”\\n\\n Noel pulled his sweatshirt over his head and stuffed his feet into his Timberland boots. “Come on.” He extended his hand for her, his tone of voice more distant than it had been just a few minutes before.\\n\\n Reluctantly, Aria got dressed and followed him out—what other choice did she have? Klaudia was waiting for them in a chair across the hall, already dressed in skin-tight ski pants, a shapely white ski jacket with pink lining, and matching pink hat and gloves. She jumped up when she saw Noel and grabbed his hand. “Ready for hiihto?”\\n\\n “Totally,” Noel said jovially. He nudged Aria. “We’re both ready.”\\n\\n Klaudia’s gaze flickered briefly to Aria. Her irises morphed from dark blue to an inky, venomous black. “Good,” she said in a chilling voice. An expression crossed her face that Aria couldn’t immediately decipher.\\n\\n But as Klaudia turned, walked out of the lobby, and promptly hopped on a chair lift without inviting Aria along, Aria got the message loud and clear. Klaudia had heard everything Aria said to Noel in the hotel room. The expression on her face meant This is war.\\n\\n Chapter 21\\n\\n Some stripping and some teasing\\n\\n “Okay, kids,” Mr. Pennythistle said. “The porters will take your things to your rooms. We’ll meet at Smith and Wollensky at eight for dinner.”\\n\\n It was Friday afternoon, and Spencer, her mother, Zach, Amelia, and Mr. Pennythistle had just arrived in the lobby of the Hudson Hotel on Fifty-eighth Street in New York, which had the moody lighting of a nightclub. The air smelled like expensive leather valises. Skinny model-types writhed and sipped cocktails in the various bar areas. A bumbling tourist squinted at a guidebook in the low light. Various languages floated through the cavernous space.\\n\\n The only reason they were staying at the Hudson and not somewhere genteel like the Waldorf or the Four Seasons was because Mr. Pennythistle did business with the hotelier and got all of their rooms for free. Mr. Donald Trump of the Main Line was apparently a cheap bastard.\\n\\n Mrs. Hastings gave Spencer, Zach, and Amelia a half-wave and then made a break for the elevator bank to the street—maybe she wasn’t a fan of the nightclub-style hotel, either. Mr. Pennythistle followed her. After they were gone, Zach fiddled with his iPhone. “So. What do you guys want to do?”\\n\\n Spencer rocked back and forth on her heels. She was tempted to ask Zach if he wanted to visit Chelsea, the gay capital of New York City. Or maybe the Meatpacking District—there were some amazing men’s shops there.\\n\\n Accepting that Zach was into guys had been easier than Spencer thought. Now, they could be BFFs and tell each other everything, watch episodes of The Real Housewives of Beverly Hills, and argue over Robert Pattinson’s hotness. And now that there wasn’t any sexual tension between them, Spencer had felt comfortable sleeping on Zach’s shoulder on the Amtrak ride here, taking a sip from his Coke, and smacking his butt to tell him his jeans looked awesome.\\n\\n Unfortunately, they were stuck with Amelia today—Mr. Pennythistle had been very specific about not letting Amelia go off by herself—and Spencer couldn’t very well suggest Chelsea in front of her. Amelia looked miserable to be here—and particularly dowdy today. While Spencer had chosen a chic outfit of black denim jeggings, a Juicy faux-fur jacket, and Pour la Victoire spike-heel booties, and Zach wore a fitted John Varvatos hooded anorak, dark-wash jeans, and black Converse, Amelia looked like a combination of a fifth grader and a prudish middle-aged woman off to church. She wore a crisp white blouse, a plaid skirt that fell past her knees, black wooly tights, and—ugh—Mary Janes. Just being around her brought down Spencer’s style quotient.\\n\\n “We should go to Barneys,” Spencer suggested. “Amelia needs a makeover.”\\n\\n Amelia made a face. “Ex-cuse me?”\\n\\n “Oh my God.” Zach’s eyes gleamed. “That’s a fantastic idea.”\\n\\n “I don’t need a makeover.” Amelia crossed her arms over her chest. “I like my clothes!”\\n\\n “I’m sorry, but your clothes are awful,” Spencer said.\\n\\n Amelia’s eyes zeroed in on Spencer’s sky-high heels. “Who made you an expert?”\\n\\n “Christian Louboutin,” Spencer said with authority.\\n\\n “Spencer’s right.” Zach moved out of the way of a blond Swedish couple pulling two Vuitton bags toward the elevator bank. “You look like you’re ready to go to the convent.”\\n\\n “Two to one, you’re outnumbered.” Spencer grabbed Amelia’s hand. “You need a new everything, and Fifth Avenue is just around the corner. Come on.”\\n\\n She dragged Amelia down the escalators. Zach caught Spencer’s eye and smiled.\\n\\n On the street, cabs zoomed and honked. A man noisily pushed a hot dog cart. The Time Warner towers soared overhead, silver and sleek. Spencer adored New York, even though her last visit had been disastrous. She’d met with her surrogate birth mother, who drained her college account, much to A’s delight.\\n\\n As they walked down Fifty-eighth Street, a poster in a travel agent’s window caught her eye. Come to Jamaica and feel all right!\\n\\n The blood drained from her head. There, in poster-sized photographs, was The Cliffs: the pool with the pineapple decal on the bottom. The purplish cliffs and turquoise sea. The roof deck and restaurant where they’d met Tabitha. The crow’s nest and the long, empty expanse of beach. If Spencer squinted, she could almost make out where they’d stood after everything happened . . .\\n\\n “Spencer? Is everything okay?”\\n\\n Zach and Amelia stared at her from a few paces away. Busy pedestrians wove around them with annoyance. Spencer looked at the poster again. A’s notes shot through her head like a bullet train. Someone knew. Someone had seen them. Someone might tell.\\n\\n “Spence?”\\n\\n The strong scent of burnt soft pretzel from a cart wafted into Spencer’s nose. Straightening up, she turned away from the travel agent’s window. “I’m fine,” she murmured softly, pulling her coat around her and rushing toward them.\\n\\n If only she could believe that.\\n\\n Barneys pulsed with rich women comparing leather gloves, girls spritzing Chanel No. 5 on their wrists, and hot men ogling the Kiehl’s skin cream display. “This place is divine,” Spencer said as she stepped through the revolving doors, inhaling the heady scent of luxury.\\n\\n “It’s just a store,” Amelia said grumpily.\\n\\n They had to practically drag Amelia up to the Co-op on 8, which brimmed with thousands of wardrobe options. Amelia looked at everything with distaste. “You’re trying things on,” Spencer urged. She held up a Diane von Furstenberg dress. “The wrap dress is a style essential,” she said in her best personal-shopper voice. “Especially because you’re straight up and down. It’ll give you a semblance of a waist.”\\n\\n Amelia scowled. “I don’t want a waist!”\\n\\n “I guess you never want to have sex, either,” Spencer said breezily.\\n\\n Zach giggled and helped her pull several more dresses off the rack. Amelia eyed him suspiciously. “Why are you helping with this? I thought you hated shopping.”\\n\\n Spencer almost opened her mouth to protest—what gay guy hated shopping?—but she refrained. Zach shrugged and bumped Spencer with his hip. “What else am I going to do?”\\n\\n After choosing several pairs of jeans, various skirts and blouses, and a whole array of dresses, Spencer and Zach led Amelia to the dressing area and shoved her into one of the tiny rooms. “You’re going to be transformed,” Spencer told her. “I promise.”\\n\\n Amelia groaned, but locked the door behind her. Spencer and Zach sat on the little couch next to the three-way mirror like anxious parents. The door slowly creaked open, and Amelia stepped out wearing a pair of Rag \u0026 Bone skinny jeans, a VPL flutter-sleeve top, and a pair of sleek brown booties with two-inch heels. There was a frightened look on her face, and she took mincing steps in the tottering heels toward the mirror.\\n\\n “Amelia,” Zach gasped.\\n\\n Spencer leapt to her feet. “You look incredible!”\\n\\n Amelia opened her mouth to protest, but then shut it again when she saw her reflection. There was no way she couldn’t say she looked good: Her legs were long and thin, her butt—who knew she even had one?—was round and perky, and the blouse elegantly complemented her skin. “This outfit is . . . nice,” she deemed primly.\\n\\n “It’s more than nice!” Zach said.\\n\\n Amelia gazed at the price tag on the jeans. “It’s really expensive.”\\n\\n Spencer arched a brow. “I think your dad can handle it.”\\n\\n “Try on more!” Zach cried, shoving her back into the tiny booth.\\n\\n One by one, Amelia tried on new outfits, her hard, bitchy exterior slowly melting away. She even did a tiny twirl in one of the Diane von Furstenberg dresses. By the sixth outfit, she wasn’t even wobbling in the heels. And by the twelfth, Spencer felt so comfortable that Amelia wouldn’t run away screaming that she tried on a fitted Alexander Wang cocktail dress she’d picked out for herself.\\n\\n Sliding it over her head, she reached around to fasten the back but couldn’t quite grab the zipper. “Zach?” She poked her head out of the dressing room. “Can you help?”\\n\\n Zach opened the door farther and stood behind her. Spencer’s whole back, including the edge of her red lacy thong, were in full view. Their eyes met in the mirror.\\n\\n “Thanks for paying attention to my sister,” Zach said. “I know she’s kind of prissy. But you’ve really brought her out of her shell.”\\n\\n “I’m happy to help.” Spencer smiled. “Makeovers always work wonders.”\\n\\n Zach’s eyes remained on hers in the mirror. He still didn’t pull up the zipper. Then, slowly, he touched the small of her back with his palm. His warm, smooth hand sent tingles up Spencer’s spine. She turned to face him. He moved his arms up and wrapped them around her waist. They stood just inches from one another, so close that Spencer could smell Zach’s breath mints. In just seconds, their lips would touch. Thousands of questions swarmed in Spencer’s head. But you said you were . . . Are you?. . . What is this . . . ? \\n\\n","sourceLink":"https://allnovel.net/twisted-pretty-little-liars-9/page-23.html","bookId":2677,"book":{"id":2677,"title":"Twisted (Pretty Little Liars #9)","description":"Storyline: Twisted (Pretty Little Liars #9) \\n It’s been a year since the torturous notes from A stopped and the mystery of Alison DiLaurentis’s disappearance was finally put to rest. Now seniors in high school, Aria, Spencer, Hanna, and Emily are older, but they’re not any wiser. The pretty little liars have more secrets than ever - twisted secrets that could destroy the perfect lives they’ve worked so hard to rebuild. \\n Aria’s jealous of her boyfriend’s new exchange student. Spencer’s getting a little too cozy with her soon-to-be-stepbrother. Hanna’s one scandalous photo away from ruining her dad’s Senate campaign. And Emily will do anything to get a swim scholarship. \\n Worst of all: Last spring break in Jamaica, they did something unforgivable. The girls are desperate to forget that fateful night, but they should know better than anyone that all secrets wash ashore... eventually.\\n","cover":"https://allnovel.net/images/twisted-pretty-little-liars-9.jpg","author":"Sara Shepard","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/twisted-pretty-little-liars-9.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:06:27 AM"}}
