{"id":67805,"no":30,"title":"Page 30","content":"The girl stuck out her bottom lip. “Why are you so afraid of me?”\n “You know why,” Hanna whispered, staring into the girl’s crazed eyes. “You’re Alison DiLaurentis.”\n A flicker of something—maybe surprise, maybe amusement—passed across the girl’s face. “The dead girl?” She pressed her hand to her chest. “The crazy murderer? Now why would you say something horrible like that?”\n “Because of everything you’ve said to us!” Aria said behind Hanna. “Everything you know! A-and because of the burns on your body. Are those from the fire?”\n The girl glanced at her burned arms and smiled playfully. “Maybe. But I didn’t survive that fire, did I?”\n “No one really knows what happened,” Emily said shakily. “Everyone thought you died, but . . .”\n “But what?” the girl interrupted in a teasing voice, her eyes gleaming. “But I escaped? Any ideas how that could have happened, Em?”\n Emily paled and took a step back. Hanna, Spencer, and Aria glanced at her for a moment, not knowing what the girl was getting at.\n Then, the girl advanced toward Hanna. Hanna shrieked and jumped away. “What’s the matter?” The girl looked offended. “What do you think I’m going to do?”\n “Leave me alone!” Hanna screamed, lurching back. The rough bamboo that lined the walls scraped against her skin. She sensed the open air behind her, the wall giving way to a thirty-foot drop. The ocean crashed far, far below.\n “Don’t touch her!” Aria ran up to the girl, grabbed her arm, and spun her around. “Didn’t you hear her? She wants you to leave her alone!”\n “Just tell us who you are, okay?” Spencer called behind Aria. “Just be honest.”\n A slow smile spread across the girl’s face. “You want an honest answer? Okay. I’m Tabitha. And I’m fabulous.”\n Everyone gasped. Hanna was pretty sure she screamed. Ali always said that.\n Tabitha really was Ali.\n Ali broke from Aria’s grasp and turned for Hanna again. Hanna tried to press against the wall, but her ankle turned and she lost her balance. She wheeled around, face-to-face with the crashing ocean below. With just one push, she’d fall down, down, down . . .\n “Help!” Hanna screamed now in the elevator just as she’d screamed then. “Someone help me!”\n Suddenly, the lights snapped on again. The car bounced once, throwing Hanna to the ground. The motor began to whir, dragging the car toward the lobby.\n The bell dinged. The door opened smoothly at the ground floor, as if nothing had been amiss. Hanna stepped out into the empty atrium, her heart chugging fast, her body both sweating and shivering, and the horrible memories she’d long suppressed now flying around her head like a flock of geese caught inside a shopping mall. It had happened. All of it had happened. A was right—the past was never far away.\n Something off to the left caught her eye. A small, gray utilities closet stood slightly open. ELEVATOR, said a sign on the door. Levers, gauges, and switches lined the wall. It certainly hadn’t been open when Hanna arrived a half hour ago. In fact, she’d never seen it open before today.\n She peered into the room and sniffed. It smelled the slightest bit like vanilla soap. Someone had been in the elevator room, tampering with the controls. And Hanna knew just who it was.\n Ali.\n Chapter 28\n When push comes to shove\n That same morning, Aria pulled on her ski pants, layered on an extra pair of socks and a wooly sweater, strapped on her ski boots, and waddled out to the slopes. The Kahn boys were milling around outside the lodge, gearing up and surveying the latest snowfall. Klaudia sat alone on a green bench, strapping on her skis.\n When Noel noticed Aria, a tiny, repentant smile crossed his face. “Hey.”\n “Hey.” Aria crunched over to him.\n “You sleep okay?” Noel said in a stilted, overly polite voice.\n Aria nodded. “Just fine.” Then she turned to Klaudia. “I want to talk to you.”\n Klaudia glanced at Aria for a split second, then looked away. “I busy.”\n Aria gritted her teeth. This was going to be harder than she thought. But she had to talk to Klaudia. She’d come to a decision.\n After she’d gone up to her room last night, she’d had horrible waking nightmares of the Kahn boys having their way with Klaudia in the tub. She’d picked up her phone a million times, daring herself to compose an It’s over text to Noel, but she kept putting it down, something inside her not quite ready.\n Then, about forty-five minutes later, she’d heard footsteps in the hallway and ran to the peephole and looked out. Noel plunged the keycard into his room across the hall. He was alone. There was no sign of his brothers or Klaudia. And then, five minutes later, a text appeared on Aria’s phone: Good night. See you tomorrow. XX, Noel.\n Nothing had happened between Noel and Klaudia. The jealousy that had been present in Aria ever since she was friends with Ali was eating her alive. It had almost destroyed her relationship with Noel once; she couldn’t let it happen again. Klaudia was going to be living with the Kahns until June. If Aria ever wanted to feel comfortable at the Kahns’ again—with Noel again—she had to make peace with her.\n “Please?” Aria placed a hand on Klaudia’s shoulder. “I need to apologize.”\n Klaudia shook her off. “I have nothing to say to you. I embarrassed and hurt.” Then she skied over to one of the chairlifts and waited for the next gondola.\n “Wait!” Aria cried, snapping on her own skis and sliding after her. Just as Klaudia sat down on the gondola, Aria jumped on, too.\n “Idiot!” Klaudia spat, moving as far to one side of the lift as she could. “What you doing?”\n “I need to talk to you,” Aria insisted. “It’s important.”\n “Aria?” Noel cried worriedly behind her. “Uh, you forgot your poles!” He waved two long, thin sticks in the air. “And that lift is for a double-black diamond!”\n Aria hesitated. They were already twenty feet off the ground. Empty gondolas swayed back and forth behind them. Skiers zigzagged below, suddenly looking like minuscule ants.\n “It’s okay!” she called bravely. Hopefully she could just stay on the gondola and ride it back down.\n Then Aria looked at Klaudia, who was pointedly faced the opposite direction, staring at the pines. “I owe you an apology. I shouldn’t have embarrassed you last night. I didn’t realize what Finland’s cultural practices were. I’m sorry.” Aria didn’t really believe that everyone in Finland hot-tubbed naked, but it was easier just to let Klaudia believe she did for now and move on.\n Klaudia didn’t move a muscle. Even her skis remained motionless.\n Aria sighed and continued. “I have a jealousy problem. I loved Noel when I was in sixth and seventh grades, when there was no chance of us ever hooking up. So when he was interested in me last year, I didn’t exactly believe it was real. Sometimes I just let that jealousy get the best of me, and that’s what I was doing with you. I . . . well, I accidentally read one of your texts to your friend Tanja. You said I was a peikko. A troll.”\n Klaudia whipped around. That got her attention. “You spy on me?”\n “I didn’t mean to,” Aria said quickly. “It was just lying there, and . . . well, I’m sorry. For a while, I was really mad at you—it sounded like you wanted Noel, and it hurt that you thought I was a troll when I thought we were becoming friends. But I’m over it. Sometimes people talk behind friends’ backs. That’s life. But we’re going to be seeing a lot of each other, so I want us to be friends again. Can we have a truce?”\n A swirl of wind blew Klaudia’s icy-blond hair over her face. On the slope below, someone wiped out in a cloud of white. The top of the mountain appeared over the crest. A big sign in the snow said LIFT BAR TO DISEMBARK.\n Silently, Klaudia pushed the bar up, gripped her ski poles hard, and met Aria’s eyes. There was a forgiving look on her face, and for a moment, Aria thought she was going to apologize and everything would go back to normal.\n But then Klaudia’s lips curled into a conniving smile. “Actually, Aria, I’m going to fuck your boyfriend. Tonight.”\n Aria stared at her. It felt like Klaudia had just punched her in the throat. “Excuse me?”\n Klaudia scooted closer to Aria. “I’m going to fuck your boyfriend,” she said again—in textbook-perfect English. “Tonight. And there’s nothing you can do about it.”\n It was like they were in a horror movie where a character suddenly became possessed by a demon. Who was this well-spoken, nerves-of-steel girl? Klaudia’s face had transformed from helpless sex kitten to ruthless boyfriend stealer. And even more than that, the look in her eyes was almost dangerous, as though she meant Aria harm. Aria remembered the last time she’d seen that look: on Tabitha’s—Ali’s—face when she threatened Hanna on the roof deck in Jamaica.\n The memory rushed in hard and fast, as though it had been patiently waiting for nearly a year to rear its ugly head. Aria hadn’t believed Tabitha was Ali until Tabitha started threatening Hanna on the crow’s nest. Then, suddenly, it seemed so . . . real. Tabitha’s every gesture, her every aggressive movement was exactly like how Ali had behaved the night she’d tried to kill them in the Poconos.\n All of a sudden, Aria saw what the others already knew. Ali was here. She’d tried to sneak back into their lives in disguise. And Aria had almost let her.\n “Please!” Hanna had wailed as Ali pinned her to the wall that surrounded the balcony. “Leave me alone!”\n Every protective instinct in Aria’s body kicked in. She inserted herself between the two of them. “Don’t touch her!”\n Ali turned to Aria, looking at her like she was crazy. “What do you think I’m going to do? I just want to show her the view.”\n But Aria wasn’t falling for that. “I know what you’re going to do!”\n Ali moved away from Hanna and lunged for Aria instead. Now it was Aria’s turn to lose her balance and get a terrifying view of the crashing whitecaps below.\n “Aria!” someone shrieked behind them. Glass shattered. Aria’s knee banged against the low wall, scraping off skin. Ali barreled for Aria again, her arms stretched out in front of her. Aria stared into her wide, crazed eyes, clearly seeing Ali inside. She had come to kill them, just like she’d killed Courtney, Ian, and Jenna. She was going to throw them over the roof one by one.\n It was unclear what had happened next. The only thing Aria remembered was feeling a burst of strength, grabbing Ali’s arms, spinning her around, and pushing her hard. Ali’s feet left the ground. An unnatural sound came out of her mouth. Her arms flailed desperately around her, but suddenly she seemed boneless and feather-light. Before anyone could do anything, she tipped into the black, empty space.\n Someone screamed. Someone else gasped. Ali’s body spilled over the low wall, first her head and shoulders disappearing, then her torso, then her butt and legs, and then her feet. She tumbled into the darkness, not even making a sound as she plunged down the face of the resort. \n","sourceLink":"https://allnovel.net/twisted-pretty-little-liars-9/page-30.html","bookId":2677,"book":{"id":2677,"title":"Twisted (Pretty Little Liars #9)","description":"Storyline: \n Twisted (Pretty Little Liars #9) \n It’s been a year since the torturous notes from A stopped and the mystery of Alison DiLaurentis’s disappearance was finally put to rest. Now seniors in high school, Aria, Spencer, Hanna, and Emily are older, but they’re not any wiser. The pretty little liars have more secrets than ever - twisted secrets that could destroy the perfect lives they’ve worked so hard to rebuild. \n Aria’s jealous of her boyfriend’s new exchange student. Spencer’s getting a little too cozy with her soon-to-be-stepbrother. Hanna’s one scandalous photo away from ruining her dad’s Senate campaign. And Emily will do anything to get a swim scholarship. \n Worst of all: Last spring break in Jamaica, they did something unforgivable. The girls are desperate to forget that fateful night, but they should know better than anyone that all secrets wash ashore... eventually.\n \n","cover":"https://allnovel.net/images/twisted-pretty-little-liars-9.jpg","author":"Sara Shepard","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/twisted-pretty-little-liars-9.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:06:27 AM"}}
