{"id":67810,"no":35,"title":"Page 35","content":"“The parents have just identified the deceased by three pins in her ankle bone from an old accident,” the newscaster explained, the photo of Ali minimizing to the corner of the screen. “They’ve released this photograph of what she looked like just before she disappeared. Her name was Tabitha Clark from New Jersey.” For a moment, Aria thought her brain had malfunctioned. She swung around and stared at Spencer at the exact same time Spencer turned to look at her. Emily leapt to her feet. Hanna tipped closer to the TV, as if she didn’t believe it. “Wait a minute, what did she just say?” Hanna said. “Her name was Tabitha Clark,” Spencer repeated in monotone, looking stunned. “From New Jersey.” “But . . . no!” Aria’s head started to spin. “Her name wasn’t Tabitha! It was Alison! Our Alison!” Spencer whipped around and pointed at Emily. “You were sure of it! You looked at her and said ‘That’s Ali’!” “She knew things only Ali knew!” Emily cried. “You guys believed it, too!” “We all did,” Aria whispered, staring dazedly ahead. The newscaster continued. The girls turned back to the screen. “According to her parents, Tabitha had run away from home about a year ago. She was always a troubled child, first suffering from a near-fatal house fire when she was thirteen years old, then undergoing agonizing reconstructive surgeries to deal with the burns. Her parents knew she’d been in Jamaica, but they didn’t realize anything was wrong until five months ago, when she didn’t check in with them as usual. They tracked down her friends, who said they hadn’t heard from Tabitha in more than a year.” The newscaster paused and sadly shook her head. “I’m just getting word that Mr. and Mrs. Clark have been looking for her for months to no avail. It’s heartbreaking that their long search for their daughter had to end in such tragedy.” Another image appeared on the screen. It was a picture of Tabitha in a cheerleading uniform, surrounded by girls Aria had never seen before. Then, there was a photo of Tabitha standing in front of a stadium, wearing an oversized New Jersey Devils T-shirt and giving a thumbs-up. Ali never would have worn something as garish as a New Jersey Devils T-shirt. Hanna clutched the side of her head. “You guys . . . what’s happening?” Aria’s heart thumped so fast she was sure it was going to burst out of her chest. The worst possible thought clanged in her head. By the looks on her friends’ faces, she was sure they were thinking the exact same thing. She took in a deep breath and said the scariest thing she could even imagine out loud: “Guys, Tabitha wasn’t Ali. We killed an innocent girl.” Chapter 35 Don’t close your eyes . . . Emily sank to the floor, the awful truth swarming in her head like a hive of bees. Tabitha wasn’t Ali. Tabitha was innocent. We killed an innocent girl. It didn’t seem possible, and yet there it was on the screen. Tabitha had a whole life that was nothing like Ali’s. She had parents. A home. Her burns had been from a house fire when she was young, not an explosion in the Poconos. Whatever she was doing to them in Jamaica must have been a silly ruse, a dare she’d wagered with herself, a game of chicken she didn’t want to lose. “M-maybe she just heard about us on the news or something,” Aria said out loud, echoing everyone’s thoughts. “Maybe she followed the tabloid websites, all those news reports . . .” “There might have been sites that told more about us than we realized,” Spencer murmured faintly, her eyes glazed and unblinking. “Maybe she was, like, obsessed. And when she saw us . . .” “. . . she thought she’d fuck with us,” Hanna finished, placing her head in her hands and rocking her body side to side. “You guys, I was about to go to the police about this. I was going to tell them about A, and Ali, and even what we did in Jamaica.” “Jesus,” Spencer whispered. “Thank God you didn’t.” Tears pricked Hanna’s eyes. “Oh God. Oh God. What have we done? They’re going to trace the murder back to us!” “A sent that picture of me and Tabitha dancing,” Emily whispered. “It’s proof we knew her. What if A sent that photo to Tabitha’s parents, maybe? Or the cops?” “Wait a minute.” Aria pointed at the screen. The reporter was pressing her finger into her ear again, clearly receiving a new set of information. “The sheriff is deeming this death an accident,” she said. “Given the proximity to the The Cliffs resort, which is notorious for underage drinking and partying, investigators hypothesize that Ms. Clark had too much to drink one night and died in a tragic accident.” The camera cut to a shot of the sheriff, a tall Jamaican in a shiny blue uniform. He stood on a makeshift platform right behind the dilapidated fishing boat that had exhumed Tabitha’s bones. “Our guess is that Ms. Clark decided to go swimming while intoxicated,” he said into a series of microphones. “The Cliffs resort has had trouble with underage drinking, and it’s time to put a stop to it. As of today, the resort is shut down indefinitely.” Flashbulbs popped. Reporters lobbed questions. Emily sat back in her chair, feeling numb. Spencer blinked. Aria pulled her knees up to her chest. Hanna shook her head and burst into tears again. Emily knew she should feel relieved, but the feeling didn’t come. She knew the truth. It hadn’t been an accident. Tabitha’s blood was on their hands. The fireplace snapped and crackled. The sharp, woodsy smell reminded Emily of so many things at once—like the campfire they’d sat around in the woods the summer after the Jenna Thing. By dying firelight, Ali had presented them with their string bracelets, making them promise never to tell what they’d done until the day they died. The bracelet on Tabitha’s wrist had been eerily identical to the ones Ali had made for them, three different colors of blue string wound together to make the colors of a clear, clean lake. But it must have been a coincidence. And now, they had a new secret they had to keep until the day they died. One that was way, way worse than the last. The smoky smell reminded Emily of something else, too: the charred, blazing Poconos cabin the day Ali set fire to it, hoping to kill them all. For a brief moment, Emily allowed herself to revisit the memory of when she’d raced toward the kitchen door, desperate to get free. Ali had been there, too, grappling to get out before the others so she could barricade them inside. But Emily caught Ali’s arm and spun her around. “How could you do this?” she demanded. Ali’s eyes blazed. A small smile appeared on her lips. “You bitches ruined my life.” “But . . . I loved you,” Emily cried. Ali giggled. “You’re such a loser, Emily.” Emily squeezed Ali’s shoulders hard. And then, a loud boom filled the air. The next thing Emily knew, she was lying on the ground by the door. As she scrambled for safety, she knocked something to the floor. It was an orange tassel that had hung over the doorknob ever since she could remember. Every time Emily entered the Poconos house, giggling with Ali, ready for a fun weekend, she’d run her fingers through the tassel’s silky threads. It made her feel like she was home. Not knowing quite why, Emily slipped the tassel into her pocket. Then, she glanced over her shoulder one more time. She saw something she would never tell another soul, partly because she wasn’t sure it was true or something she’d hallucinated after inhaling too much smoke, partly because she knew her friends wouldn’t believe her, and partly because it was too scary and awful to even utter out loud. When she’d looked back through the open doorway into the about-to-explode house, Ali wasn’t anywhere. Had she been surrounded by too much smoke? Had she simply crawled farther into the kitchen and resigned herself to death? Or maybe, just maybe, she was trying desperately to get out of the house, too. What Emily did next she would never forget. Instead of slamming the door hard, even shoving an Adirondack chair in front of it to make sure Ali wouldn’t escape, she’d left the door unlatched and ajar. One weak push, and Ali would be out. Safe. Free. Emily just couldn’t let her die in there. Even if Ali had said all those horrible things, even if Ali had broken Emily’s heart in a million different ways, she couldn’t do that. Now, in Spencer’s den, Emily reached into her pocket and touched the silky orange tassel once more. That horrible scene in Jamaica flashed before her eyes. Everyone thought you died in the fire, Emily had said to the girl they all swore was Ali. But— But what? The girl interrupted. But I escaped? Any ideas how that could have happened, Em? Then she’d pointedly glanced at Emily’s pocket as though she had X-ray vision and could see the orange tassel Emily had carried everywhere even then, the tassel that hung on the very door that had allowed for Ali’s escape. Tabitha knew what Emily had done. But . . . how? When Emily’s phone beeped in her bag, shrill and loud in the silent room, she nearly jumped out of her skin. Moments later, Spencer’s cell phone buzzed. Aria’s let out a car honk. Hanna’s made a bird-tweet. The noises cycled once more, the ringing and buzzing a cacophony of wails. The girls stared at one another, terrified. If Tabitha wasn’t Ali, and Tabitha had died that night, then who was doing this to them? Ali still could have survived the fire. Was A still Ali, tormenting them with the juiciest, most heinous secret of their lives? Slowly, Spencer reached for her phone. So did Aria, then Hanna. Emily pulled her own phone out of her bag and stared at the screen. ONE NEW TEXT. From anonymous. Of course. You think that’s all I know, bitches? It’s only the tip of the iceberg . . . and I’m just getting warmed up. –A","sourceLink":"https://allnovel.net/twisted-pretty-little-liars-9/page-35.html","bookId":2677,"book":{"id":2677,"title":"Twisted (Pretty Little Liars #9)","description":"Storyline: Twisted (Pretty Little Liars #9) It’s been a year since the torturous notes from A stopped and the mystery of Alison DiLaurentis’s disappearance was finally put to rest. Now seniors in high school, Aria, Spencer, Hanna, and Emily are older, but they’re not any wiser. The pretty little liars have more secrets than ever - twisted secrets that could destroy the perfect lives they’ve worked so hard to rebuild. Aria’s jealous of her boyfriend’s new exchange student. Spencer’s getting a little too cozy with her soon-to-be-stepbrother. Hanna’s one scandalous photo away from ruining her dad’s Senate campaign. And Emily will do anything to get a swim scholarship. Worst of all: Last spring break in Jamaica, they did something unforgivable. The girls are desperate to forget that fateful night, but they should know better than anyone that all secrets wash ashore... eventually.","cover":"https://allnovel.net/images/twisted-pretty-little-liars-9.jpg","author":"Sara Shepard","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/twisted-pretty-little-liars-9.html","creation":"Oct 5, 2019 8:59:04 AM","modification":"Oct 5, 2019 10:06:27 AM"}}
