{"id":25337,"no":4,"title":"CHAPTER IV. THE ELDEST SON.","content":"The young men separated when they left the Manor,—one to his farm, and another to his merchandise, as Laurie said. It is our business at the present moment to follow only the eldest. Ben went back to his chambers in the Albany, his personal head-quarters, though he did not occupy them for more than three months in the year. Though he was called Ben, his name was the solemn family name of Benedict. It suited him better than the contraction. He was one of those men who are in the way of taking things very much in earnest,—too much in earnest, some people thought. The fashion of the period had accustomed him to the light outward appearance and pretence of general indifference common to his kind; but in his heart he was not indifferent to anything. He had felt his advantages keenly, taking all the more anxious care that no one should suspect him of doing so; and he felt his downfall now, to the bottom of his heart. He went back to London, which seemed the only place to go to in the emer{50}gency. He had been on a pleasant visit at a pleasant house when the call came to his father’s death-bed. Now, in September, when he had not a friend remaining in town, he took his solitary way there, and went to the handsome, forlorn rooms, the very rent of which would now have swallowed up so great a part of his income. He went in listlessly, amid all the tokens of his former life, almost hating the signs of a luxury so far beyond his means. Ben had taste as well as Laurie, though in a different way. His chambers were furnished daintily, as became a man accustomed to spend as he pleased and spare nothing. It had always been a comfort to Mr. Renton’s practical eye, that his son’s knick-knacks were all knick-knacks of a thoroughly saleable kind,—things which had a real value; and the same thought, as he entered, brought a smile upon Ben’s face. ‘I shall make some money out of the d——d trash,’ he said to himself bitterly, thrusting away with his foot a little graceful guéridon, on which stood a Sèvres déje?ner service. The toy tottered, and would have fallen, but that he put out his hand by instinct to save it. Then,—if the reader will not despise him for it,—it must be allowed that Ben sank down into a chair, and did something equivalent to what a woman would have done had she cried. He muttered ill things of himself under his breath,—he called himself a confounded fool to risk by his ill-temper anything that might bring him the money he stood so much in{51} need of,—and then he covered his eyes with his hands, and felt a sudden contraction in his throat. He had nobody to appeal to, nobody to consult. He had the problem of life to resolve for himself as he best could, and he had lost a father whom he loved, not a week before. All these thoughts came over him as he went into his old rooms, where all his favourite possessions were. Of course, neither the rooms nor their ornaments could be retained. All that Ben could pretend to now was of a much humbler description; but he would not hand over to another even the pain of putting things in order, and making ready for the final sacrifice. His servant would have to be given up too. He had not the means of hiring help to do anything that he could do for himself. Henceforward he would have to learn to do things for himself, and here was the first thing to do. \\n\\n \\n\\n It is true that he would have given up these same rooms without a pang for various other reasons;—had he been going to take possession of the house in Berkeley Square, which now, he supposed, would either be let or shut up;—had he been going abroad, or, indeed, for almost any other reasonable cause;—just as the people would do who break their hearts over the hall, or rectory, or deceased father’s house, which they would have abandoned joyfully a dozen times in as many years, had a pleasant chance come in their way. It was the wreck of circumstance surrounding this change which wounded Ben; the{52} breaking up of all his habits, and failure of everything he had been used to. When he had recovered himself a little, he took a disconsolate stroll through the rooms, and reckoned up what his things had cost him;—his pictures,—some of which were copies picked up abroad, and some chef-d’?uvres of young artists at home, which Laurie had persuaded him to give good prices for;—the cabinets he had attained after unexampled efforts at Lady Bertram’s sale,—his choice little collection of old Dresden,—even his pipes and his whips, and a hundred other trifles, which, when he counted them up, had cost heaps of money. Some of them, alas! were not even paid for, which was the worst sting of all. Ben had been in debt before now, and cared little enough, perhaps too little for it. He had felt the weight of wealth behind him, and that he could pay his arrears without much difficulty when he chose to make the effort. But now everything was changed. It is only when debt becomes a necessity that it is a burden. He felt it now, dragging him down, as it were staring into his face, hemming him in. Debt for bits of china, and pretty follies of furniture! And now, for aught he could tell, he might not have enough for daily bread. To be sure, a man could not starve upon two hundred a-year; but there are such different ways of starving. And his whole first year’s income would not be nearly enough to pay off his rent, and his man, and the expenses of the break-up, not to speak of tradesmen.{53} Such reflections were so novel to him that he sat down again in despair, with his brain going round and round. He did not even know how to set about being ruined. There was nobody in town likely to buy his pretty things at this time of the year, or to take his rooms off his hands. He had come up fully resolved to be sufficient to himself, to manage everything himself, and to give no one the opportunity of pity or remark. But it was less easy than he supposed. As for his servant, he had been with him at the Manor, and had heard, or found out, or divined, as servants do, something of what had happened, and was not unprepared for dismissal. ‘Yes, sir,’ he said, without hesitation, when his master spoke to him. ‘I hope it’s not that I don’t give satisfaction, sir: I’ve always done my best.’ \\n\\n \\n\\n ‘No, no,’ said Ben, with a young man’s unnecessary explanatoriness. ‘I can’t afford now to keep anybody but myself. I am very sorry. It is not that I have any objection to you.’ \\n\\n \\n\\n ‘Yes, sir,’ said the man once more. ‘Of course it’s understood that there’s board-wages, sir, if I’m sent away in a hurry before the end of the month?’ \\n\\n \\n\\n ‘Have what you like,’ said Ben, with a little indignation; ‘if that’s all; give me a note exactly of what’s owing to you, and you can take yourself off as soon as you like.’ \\n\\n \\n\\n ‘Yes, sir; but it looks pecooliar being sent away so sudden,’ said the fellow standing his ground.{54} ‘Perhaps you would not mind just giving a bit of an explanation to any gentleman as may come about my character. I hope you consider I deserve a good character, sir. Gentlemen, and ‘specially ladies, is very apt to ask, “How was it as you was turned away?”’ \\n\\n \\n\\n ‘You may go now,’ said Ben, coldly. ‘I have nothing more to say to you. I’ll give you your money as soon as you’re ready to go.’ \\n\\n \\n\\n ‘But my character, sir?’ insisted the man. Ben, in his wrath, seized his hat and went off, leaving Morris holding the door open with these words on his lips. He was unreasonably angry in spite of his better judgment. The very first man he had spoken to after his downfall was so entirely indifferent to his concerns, so wrapped up in his own! What were Morris’s board-wages or miserable character in comparison to Ben’s overthrow and changed existence? He went out angry—in a passion, as Morris said not without reason. Naturally the man had his own theory of the whole matter, and held it for certain that his master had been going to the bad, or why should his father disinherit him?—to which question, indeed, it was difficult to make any answer. Ben’s next errand was to a fashionable auctioneer and house-agent, who was very civil, and yet very different from what he had been when the young man of fashion took his rooms. ‘Going abroad, sir?’ Mr. Robins said, with a certain scrutiny which{55} made the young fellow, for the first time in his life, feel himself a doubtful character, required to give an account of himself. \\n\\n \\n\\n ‘Perhaps. I can’t say,’ he answered; ‘but these rooms have become too expensive for me, anyhow, and I want to sell my things.’ \\n\\n \\n\\n ‘The worst possible time to do it,’ said the auctioneer, shaking his head. ‘There is not a soul in town, sir, as you know as well as I do. Even in our humble way, we are going to the country ourselves. They would not fetch a third of their proper price now.’ \\n\\n \\n\\n ‘But I want the money,’ said Ben; ‘and I can’t keep up the place. I must get rid of them now.’ \\n\\n \\n\\n ‘I can take your orders, of course, sir,’ said Mr. Robins, deprecatingly; ‘but it will be at a frightful sacrifice. Nobody but dealers will look at them now,—and we all know what dealers are. Buy in the cheapest market and sell in the dearest,—a fine maxim, sir, for trade; but ruinous for fancy articles, when you have to push them to a sale, and there’s nobody to buy.’ \\n\\n \\n\\n ‘I can’t help myself,’ said Ben, abruptly. He had almost said, ‘What would you advise me to do?’ But his mind was in such a restless state, that the pendulum had veered back again to its first throb of obstinacy ere he could say the other words. And the orders were taken accordingly. Then he went to his club with the listlessness of a man who does not{56} know what to do. What was he to do? Supposing he could make his club his home, with a bedroom somewhere to sleep in, and the Manor and his friends to fall back upon—would that do? Probably he could manage it, even on his small income, by dint of economy,—that unknown quality to which ignorance gave a certain appearance of facility. With no servant, no expensive habits, no entertainment of friends, he might be able to manage. This was what some one of his spiritual enemies whispered in Ben’s ear. The next moment he jumped up and began to walk about the long vacant room,—of which at the moment he was the sole occupant,—with sudden agitation. His idle, pleasant life had come natural to him in the past; but already, though so little time had elapsed, it was no longer natural. To spend seven years of his existence planning how to save shillings and keep up appearances,—to live, he a young man at the height of his strength and powers, the life of a genteel old maid! That was impossible. A day-labourer would be better, he said to himself. But it is so easy to say that. He knew well enough that he could not be a day-labourer; and what could he be? \\n\\n \\n\\n He had come thus far in his uncomfortable thoughts when somebody struck him familiarly on the shoulder, with an exclamation of surprise. ‘You here!’ said the new-comer. ‘You in London when there is nobody in it, Ben Renton! You are the last fellow I expected to see.{57}’ \\n\\n \\n\\n ‘What, Hillyard!’ said Ben, though his cordiality was languid in comparison. ‘Back so soon? Have you made your fortune already?’ And as he spoke it occurred to him that going to Australia must be the thing to do. \\n\\n \\n\\n ‘Not much of that,’ said his friend, who was very brown and very hairy, and in clothes that would not bear examination. ‘That is easier said than done. I have spent all I had, which comes to about the same thing; and now I’ve come back to try my luck at home,—my ill-luck, I should say.’ \\n\\n \\n\\n ‘Then it is no good going to Australia,’ was the thought that passed, rapid as the light, through Ben’s mind. ‘But I thought all sorts of people made fortunes at the diggings, or in the bush, or whatever you call it,’ was what he said. \\n\\n \\n\\n ‘Yes, that’s how one deceives one’s self,’ said the adventurer. ‘One throws everything together in a lump, and one thinks it’s all right; whereas it’s all wrong, you know. If I had been brought up to be a shepherd, I might have got on in the bush; and if I had been brought up a bricklayer’s labourer, I might have succeeded at the diggings; but I was not, you see. And even in these elevated branches of industry the requirements are quite different. Let us have some dinner, Renton. It’s great luck to find any one to hob-and-nob with, especially such a fellow as you.’ \\n\\n \\n\\n ‘Dinner!’ said Ben amazed, looking at his watch. ‘Why, it’s only three o’clock.{58}’ \\n\\n \\n\\n Upon which Mr. Hillyard burst into a great laugh. ‘I forgot I was back in civilisation,’ he said; ‘but I must have something to eat, whatever you call it. Yes, here I am, no better than when I went away. I believe it’s all luck, after all. Some fellows get on like a house on fire. Some are thankful for bread and cheese all their lives. Some, if they work themselves sick, don’t get that. What’s the good of making one’s self miserable?—it’s all fate.’ \\n\\n \\n\\n ‘I suppose one must live, however, in spite of fate,’ said Ben, not caring much what were the first words that came to his lips, nor with any positive meaning in what he said. \\n\\n \\n\\n ‘Oh, I never was one of your tragical heroes,’ said Hillyard; ‘better luck next time is always my motto; though, mind you, I’m not so sure that one is bound to live in spite of everything. I don’t see the necessity. If there’s anything better to go to, why shouldn’t one have a try for it? And if there isn’t, what does it matter? It’s a man’s own responsibility. If he likes to face it, let him, and don’t abuse the poor devil as if he were a pickpocket. Why, there was a fellow the other day,—and, by the way, I am taking his things home to his mother, which is a nice commission,—who squared off his fate with a bullet, by my side. I must say, I can’t blame him for one. Things could not well be worse up there,’ said this savage philosopher, waving his hand vaguely towards the roof, ‘than they were down below. But{59} this is a queer sort of talk when one has just come home, and to a favourite of fortune like you.’ \\n\\n \\n\\n ‘I am not much of a favourite of fortune just now,’ said Ben, with a certain longing for human sympathy. ‘But I’ll tell you about that afterwards. Now you have come home, are you going to stay in town, or what do you mean to do?’ \\n\\n \\n\\n The question was asked not quite in good faith, for it glided vaguely across Ben’s mind that the plans of a man who had long lived on his wits might suggest something for his own aid; and the answer was not more ingenuous, for it naturally occurred to Hillyard that his friend, who had the liberal hospitality of a great country-house to fall back on, and the probability of a shooting-box somewhere of his own, might intend to offer him an invitation, and so bridge over some portion of those autumn months, which were of so little use to a man who is looking for something to do. \\n\\n \\n\\n ‘I shall get along, I suppose, in the old way,’ he said, shrugging his shoulders. ‘I’ll serve up my Australian experiences for the papers, perhaps; or do them philosophically, with all their chances and dangers for intending emigrants, for the “Monthly,” if I can get hold of Rathbone; or go in as a coach. I flatter myself I could give the Colonial Secretary a hint or two if I could get at him. A little tall talk hurts no one. The fact is, I don’t know what I am going to be about,’ he added with a sigh. ‘Living on{60} one’s wits is hard work enough. I have kept up nothing of old days except the club, which is always a kind of haven; though, I daresay, that sounds strange to you.’ \\n\\n \\n\\n ‘Not now,’ said Ben, with a contraction in his throat. ‘I am as poor as you, and more helpless. I rather think I am good for nothing. I suppose I shall get used to it in time, but it’s not a pleasant feeling as yet.’ And then he told his companion all with a curious effusion, which did not surprise Hillyard more than it did himself. He had resolved to say nothing to anyone,—to lock up his troubles in his own breast, and seek no advice even from his oldest friends; and here he was unbosoming himself to the first-comer,—a man whom he had not seen for two years, and who was by no means one of his close friends. He was not aware, poor fellow, what necessity of nature it was that moved him. He justified himself afterwards by the reflection that Hillyard was, so to speak, a stranger and safe confidant,—that there was nobody in town to whom he could repeat it,—that he was a brother in misfortune, shifty and full of expedients, and might help him. But all these were after-thoughts. His real impulse was the mere instinct of nature to relieve himself from the secret pressure of a burden which was more than his unaccustomed shoulders could bear. \\n\\n \\n\\n Hillyard was much amazed and mystified by the{61} strange tale, and could with difficulty be brought to believe it. But he was very sympathetic and consolatory when his first incredulity was got over. ‘After all, it’s only for seven years,’ he said; ‘that is not so very much in a life. If I knew I should come into a good estate at forty,—ay, or at fifty,—I shouldn’t mind the struggle now; and you will be only a little over thirty. It’s nothing,—it’s absolutely nothing. You’re down just now, and taken by surprise, and out of spirits with what’s happened, and all that. But things will look better presently. You think it’s hard to struggle and work, and never know where you’re to get to-morrow’s dinner,’ said the adventurer, with a certain light kindling in his eyes; ‘but sometimes it gives a wonderful relish to life. You enjoy the dinner all the better. It’s more exciting than fox-hunting, or even elephant-hunting; and what does a fellow want in life but lots of excitement and movement and stir? As long,’ he added, after a pause, ‘as your strength lasts, and your mind, and your spirit, it is all very well. I don’t care for tame well-being, with no risks in it. It will be nothing but fun for you.’ \\n\\n \\n\\n ‘I don’t see the fun,’ said Ben; but certainly the dark clouds over him were moved by the suggestion. ‘And I have not your knowledge or resources. Absolutely, if you’ll believe me, I have not an idea what to do.{62}’ \\n\\n \\n\\n ‘So I should think,’ said Hillyard. ‘It would be odd if you had, plunged into it like this, without a moment’s notice. Lie on your oars, my dear fellow, for a day or two, and come about with me. We may hit on something, you know; and, at all events, a few days’ waiting can do you no harm.’ \\n\\n \\n\\n By this time his meal had been served to him, and its arrival interrupted the talk. Ben rose and walked away to a distant window, already feeling some qualms of self-disgust at what he had done. As he stood looking out upon the flood of human beings, each absorbed in his own interests, he felt, perhaps for the first time in his life, how utterly unimportant to the world was his individual comfort, or that of any one mortal creature. He was no more to the crowd, not so much, as one drop of perfume or of bitterness would be to the pleasant Thames as it floated past his father’s house,—not near so much. The sea would be a juster emblem,—that sea which swallowed up rivers and showed no increase, which threw forth its lavish atoms to the air and knew no diminution. He had been an important personage up to this moment, even in his own opinion, though he had always known theoretically the insignificance of the individual. But he knew it now with a certainty beyond theory. When Hillyard and he were driven against the rocks, who would know the difference or be any the wiser? He who a month ago would have compassionately{63} taken Hillyard home with him, to give him a little time to consider, was now, under the adventurer’s guidance, a more hopeless adventurer than Hillyard. Ben’s thoughts were not pleasant as he stood and looked out, watching the stream,—deep, no doubt, with human passion, sorrow, and perplexity, but so inexpressive on the surface,—which kept flowing on like water, as perennial and unbroken. His own life flitted before him like a dream as he stood looking out,—so useless, and luxurious, and free; so care-laden and overwhelmed by storms; so vague and doubtful in the future. Had he even known what would await him in the end his fate would have been less hard. Perhaps his very efforts to work out the time of his probation might secure the loss of his birthright. He might find that he worked the wrong way, that he had missed the end, even after his best exertions. A funeral procession was making its way at the moment up the busy street, to which it gave so strange a moral. And Ben turned away his head and sat down, sickened by the sight of the slow hearse with its waving plumes. To think he should have been defrauded even of his natural grief, even of the softening of his heart, which should have come over his father’s grave! Was the inmate of that other coffin leaving a wrong behind him, casting a stone with his dead hands to crush his children? This, no doubt, was a harsh way of taking his trouble; but{64} there are men to whom all crosses come harshly, and Ben Renton was one of them. Hillyard, satisfied and comfortable, with a slight flush of bodily well-being on his face, came up to him as he mused, with a glass of sherry in his hand. \\n\\n \\n\\n ‘Not bad wine,’ he said, with a sigh of comfort, ‘and not a bad dinner, I can tell you, to a man fresh from the backwoods. Ben, I’ve got a wretched thing to do, and I want you to go with me. You’re out of spirits, at any rate, and it will do you no harm.’ \\n\\n \\n\\n ‘What is it?’ said Ben. \\n\\n \\n\\n ‘I am going to see the mother of the poor fellow I told you of. She’s a widow living somewhere about Manchester Square. I rather think he was the only son. He made a mull of it at some of those confounded examinations, and rushed out to Australia in despair; and all went wrong with him there, and he squared it off, as I told you. I have to take her some of his things. You look more like the kind of thing, with your black clothes and your grave face, than I do. Stand by me, Ben, and I’ll stand by you.’ \\n\\n \\n\\n ‘As you please,’ said Ben, languidly. Already the familiarity of his new-old friend jarred on him a little. But he did not care what he did at that moment; he did not much care even what became of him. He had nothing to do and nobody to see. It was as easy to go to Manchester Square as anywhere else, though the locality was not delectable. He suf{65}fered Hillyard to take his arm and draw him along, without much interest one way or another, not seeing how his compliance with such a trifling request could particularly affect even the hour of time which it occupied, much less his character or his life. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2696/74098.html","bookId":1462,"book":{"id":1462,"title":"The Three Brothers","description":"简介： The reason why Mr. Rentons sons were sent out into the world in the humble manner, and with the results we are about to record, must be first told, in order that their history may be comprehensible to the reader. Had they been a poor mans sons no exp...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2696","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
