{"id":11231,"no":8,"title":"BOOK VIII. THE CAPTIVE BOUND","content":"They sat with the twilight shadows about them. Memories too poignant assailed them, and her hand trembled as it lay upon his arm. “How strange it was!” she whispered. “Have we kept the faith?” “Who knows?” he answered; and in a low voice he read— “And long the way appears, which seem’d so short To the less practised eye of sanguine youth; And high the mountain-tops, in cloudy air, The mountain-tops where is the throne of Truth, Tops in life’s morning-sun so bright and bare!” Section 1. This was a golden hour in Thyrsis’ life. The gates of wonder were flung open, and all things were touched with a new and mystic glow. He scarcely realized it at the time; for once he was too much moved to think about his own emotions, the artist was altogether lost in the man. Even the room in which he lodged was relieved of its sordidness; it was a thing that men had made, and so a part of the mystery of becoming. He yearned for some one to whom he could impart his great emotion; but because of the loneliness of his life he could find no one but the keeper of his lodging-house. Even she became a human thing to him, because of her interest in the great tidings. If all the world loved a lover, it loved yet more one through whom the supreme purpose of love had been accomplished. Thyrsis went each day to the hospital, to watch the new miracle unfolding itself; to see the Child asserting its existence as a being with a life of its own. He could never tire of watching it; he watched it asleep, with the faint heaving of its body, and the soft, warm odor that clung to it; he watched its awakenings—the opening of its eyes, and the sucking movements that it made perpetually with its lips. They had dressed it up now, and hid some of its strangeness; but each morning the nurse would undress it, and give it a bath; and then he marvelled at the short crooked legs, and the tiny red hands that clutched incessantly at the air, and the strange prehensile feet, that carried one back to distant ages, hinting at the secrets of Nature’s workshop. Sometimes they would permit him to hold this mystic creature in his arms—after much exhortation, and assurance that his left arm was properly placed at the back of its head. One found out in this way what a serious business life really was. Corydon lay back among her pillows and smiled at these things. Most wonderful it was to him to see how swiftly she recovered from her ordeal, how hourly the flush of health seemed to steal back into her cheeks. He became ashamed of the memory of his convulsive anguish and his blind rebellions. He saw now that her pain had not been as other pain; it was a constructive pain, a part of the task of her life. It was a battle in which she had fought and conquered; and now she sat, throned in her triumphal chariot, acclaimed by the plaudits of a multitude of hopes and joys unseen. There came the miracle of the milk. Incessantly the Child’s lips moved, and its hands groped out; it was an embodied demand for new experience—for life, it knew not what. But Nature knew, and had timed the event to this hour. And Thyrsis watched the phenomenon, marvelling—as one marvels at the feat of engineers, who tunnel from opposite sides of a mountain, and meet in the centre without the error of an inch. It was in accordance with the impression which Corydon made upon him, as a dispenser of abundance, a goddess of fruitfulness, that there should have been more milk than the Child needed. The balance had to be drawn off with a little vacuum-pump; and Thyrsis would watch the tiny jets as they sprayed upon the glass bulb. The milk was rich and golden-hued; he tasted it, with mingled wonder and shuddering. These procedures filled the room with a warm, luscious odor, as of a dairy; they were eminently domestic procedures, such as in fancy he had been wont to tease her about. But he had few jests at present—he was in the inner chambers of the temple of life, and hushed and stilled with awe. The things that he had witnessed in that room were never to be forgotten; each hour he pledged himself anew, to the uttermost limits of his life. The voice of skeptic reason was altogether silent in him now. And also he was interested to observe that all protest was ended in Corydon; the impulses of motherhood had now undisputed sway in her. Section 2. BUT even in such an hour of consecration, the sordid world outside would not leave him unmolested. It was as if the black clouds had parted for a moment, while the sunlight poured through; and now again they rolled together. The great surgeon, who had told Thyrsis that he would wait for his money, professed now to have forgotten his agreement. Perhaps he had really forgotten it—who could tell, with the many things he had upon his mind? At any rate, Corydon found herself suddenly confronted with a bill, which she was powerless to pay; with white cheeks and trembling lips she told Thyrsis about it—and so came more worry and humiliation. The very food that she ate became tasteless to her, because she felt she had no right to it; and in a few days she was begging Thyrsis to take her away. So he helped to carry her downstairs, and back to her parents’ home; and then he returned to his own lonely room, and sat for hours in the bitter cold, with his teeth set tightly, and the nails dug into the palms of his hands. It so happened that just then the editor was beginning to change his mind about “The Hearer of Truth”; and so he had new agonies of anxiety and disappointment. Again he might not come to see Corydon; and this led to a great misfortune. For she could not do without him now, her craving for him was an obsession; and so she left her bed too soon, and climbed the stairs to his room. Again and again she did this, in spite of his protests; and when, a little later, the doctors found that she had what they called “womb-trouble”, they attributed it to this. Perhaps it was not really so, but Corydon believed it, and through all the years she laid upon it the blame for innumerable headaches and backaches. Thus an episode that might have been soon forgotten, stayed with her, as the symbol of all the agonies of which her life was made. She would come, bringing the baby with her; and they would lay it upon the bed, and then sit and talk, for hours upon hours, wrestling with their problems. Later on, when Corydon was able, they would go to the park, craving the fresh air. But in midwinter there were few days when they could sit upon a bench for long; and so they would walk and walk, until Corydon was exhausted, and he would have to help her back to the room. Thyrsis in these days was like a wild animal in a cage; pacing back and forth and testing every corner of his prison. But they never thought of giving up; never in all their lives did that possibility come into their discourse. And doggedly, blindly, they kept on with their studies. Corydon mastered new lists of German words, and they read Freitag’s “Verlorene Handscrift” together, and von Scheffel’s “Ekkehard”, and even attempted “Iphigenie auf Tauris”—though in truth they found it difficult to detach themselves to quite that extent from the world of every-day. It is not an easy matter to experience the pure katharsis of tragedy, with a baby in the room who has to be nursed every hour or two, and who is liable to awaken at any moment and make some demand. He was such an intricate and complicated baby, with so many things to be understood—belly-bands and diapers and irrational length of skirts. Sometimes, when Corydon was quite exhausted, the attending to these matters fell to Thyrsis, who became for the time a most domestic poet. He once sent an editorial-room into roars of merriment by offering to review a book upon the feeding of infants. But he told himself that even the hilarious editors had been infants once upon a time; and he had divined that there were secrets about life to be learned, and great art-works to be dreamed, even amid belly-bands and diapers. Also, Thyrsis would brave a great deal of ridicule in order to be paid a dollar for the reading of a book that he really wanted to read. For books that one wanted to read came so seldom; and dollars were so difficult to earn! It seemed as if the task grew harder every week. He went without cuffs, and wore old and frayed collars, and washed his solitary necktie until it was threadbare, and lived upon prunes and crackers, and gave up the gas-stove in his room—and still he could scarcely manage to get together the weekly rent. He studied the magazines in the libraries, and racked his wits for new ideas to interest their editors. He haunted editorial-rooms until his presence became a burden, and he brought new agonies and humiliations upon himself. He would part from Corydon in the afternoon, and shut himself in his room; and sitting in bed to keep warm, he would work until midnight at some new variety of pot-boiler. After which he would go out to walk and clear his brain—and even then, exhausted as he was, his vision would come to him again, wonderful and soul-shaking. So he would walk on, and go back to write until nearly dawn at something he really loved. Section 3. It was so that he wrote his poem, “Caradrion”. It was out of thoughts of Corydon, and of the tears which they shed in each other’s presence, that this poem was made. Thyrsis had a fondness for burrowing into strange old books, in which one found the primitive wonder of the soul of man, first awakening to the mystery of life. Such a book was Physiologus, with his tales of strange beasts and magic jewels. “There is a bird called Caradrion”, Thyrsis had read.... “And if the sick man can be healed, Caradrion goes to him, and touches him upon the mouth, and takes his sickness from him; and so the man is made well.” And out of this hint he had fashioned the legend of the two children who had grown up together in “the little cot, fringed round with tender green”; one of them Cedric, and one Eileen—for he had given the names that Corydon preferred. They grew “unto the days of love”, so the story ran— “And Cedric bent above her, stooping light, To press a kiss upon her tender cheek. And said, ‘Eileen, I love thee; yea I love, And loved thee ever, thou my soul’s delight.’ So time sped on, until there came “To Cedric once a strange unlovely thought, That haunted him and would not let him be. ‘Eileen,’ he said, ‘there is a thing called death, Of which men speak with trembling at the lips; And I have thought how it would be with me If I should never gaze upon thee more.’” So Cedric went to find out about these matters; he sought a witch—“the haggard woman, held in awe.” “He found her crouching by a caldron fire; Far gleams of light fled through the vault away. And tongues of darkness flickered on the wall. Then Cedric said, ‘I seek the fate to know’. And the witch laughed, and gazed on him and sang: ‘Fashioned in the shadow-land, Out into darkness hurled; Trusted to the Storm-wind’s hand, By the Passion-tempest whirled! Ever straining, Never gaining, Never keeping, Young or old! Whither going Never knowing, Wherefore weeping, Never told! Rising, falling, disappearing, Seeking, calling, hating, fearing; Blasted by the lightning shock, Trampled in the earthquake rock; Were I man I would not plead In the roll of fate to read!’ “Then Cedric shuddered, but he said again, ‘I seek the fate,’ and the witch waved her hand; And straight a peal of thunder shook the ground, And clanged and battered on the cavern walls, Like some huge boulder leaping down the cliff. And blinding light flashed out, and seething fire Shattered the seamy crags and heaving floor.” And so in a vision of terror Cedric saw the little vale, and the cot “fringed round with tender green”; and upon the lawn he saw Eileen, lying as one dead. “And Cedric sprang, and cried, ‘My love! Eileen!’ And on the instant came a thunder-crash Like to the sound of old primeval days, Of mountain-heaving shock and earthquake roar, Of whirling planets shattered in the dark.” And so, half wild with grief and despair, Cedric wandered forth into the world; and after great suffering, the birds took pity upon him, and gave him advice—that he should seek Caradrion. “‘Caradrion?’ cried Cedric, starting up, ‘Speak swiftly, ere too late, where dwelleth he?’ ‘Ah, that I know not,’ spake the little voice, ‘Yet keep thy courage, seek thou out the stork, The ancient stork that saw from earliest days, Sitting in primal contemplation lost, Sphinx-like, seraphic, and oracular, Watching the strange procession of men’s dreams.’” But the stork was cruel and would not heed him, and led Cedric a weary chase through the marshes and the brakes. But Cedric pursued, and finally seized the bird by the throat, and forced the secret from him— “‘Fare southward still, Fronting the sun’s midnoon, all-piercing shaft, Unto the land where daylight burns as fire; Where the rank earth in choking vapor steams, And fierce luxurious vegetation reeks. So shalt thou come upon a seamèd rock, Towering to meet the sun’s fierce-flashing might, Baring its granite forehead to the sky. There on its summit, in a cavern deep, Dwells what thou seekest, half a bird, half man, Caradrion, the consecrate to pain.’” Then came the long journey and the search for the seamèd rock. “‘Twas night; and vapors, curling, choked the ground, And the rock writhed like flesh of one in pain. But Cedric mounted up to find the cave, Crying aloud: ‘I seek Caradrion.’ And so, till from the cavern depth a voice: ‘Come not, except to sorrow thou be born.’ And Cedric, panting, stretched his shrunken arms: ‘Another’s sorrow would I change to joy, And mine own joy to sorrow; help thou me.’ To which the voice, sunk low, replied: ‘Come thou.’ And Cedric came, unfearing, in the dark, And saw in gloomy night a form in pain, With wings stretched wide, and beating faint and fast. ‘Art thou Caradrion?’ he murmured swift, And echo gave reply, ‘Caradrion’.” So Cedric told of his errand, and pleaded for help; he heard the answer of the voice: “‘Yea, I can save her, if thou be a soul That can dare pain and face the rage of fate; A soul that feareth not to look on death.’ ‘Speak on,’ said Cedric, shaking, and he spoke: ‘This is my law, that am Caradrion, Whose way is sorrow and whose end is death; That by my pain some fleeting grace I win, Some joy unto another I can give. Far through this world of woe I seek, and find Some soul crushed utterly, and steeped in pain; And when it sleeps, I stoop on silent wing, And with a kiss take all its woe away— Take it for mine, and then into this cave Return alone, the blessing’s price to pay.’ Then up sprang Cedric. ‘Nay,’ he,’ cried, ‘then swift, Ere life be gone!’ But once more spake the voice: ‘Nay, boy, my race is run, my power is spent; This hope alone I give thee, as thou wilt; Whoso stands by and sees my heart-throb cease, Who tastes its blood, my power and form are his, And forth he fares in solitary flight, Caradrion, the consecrate to pain. And so my word is said; now hide thee far In the cave’s night, and wrestle there in prayer.’ But Cedric said, ‘My prayer is done; I wait.’ So in the cave the hours of night sped by, And sounds came forth as when a woman fights In savage pain a life from hers to free.” Then in the dawn a dark shadow flew from the cave, and sped across the blue, and came to the little vale, where Eileen lay dying, as he had seen her in the vision in the “haggard woman’s” cavern. “Then Cedric sprang, and cried, ‘My love! Eileen!’ And Eileen heard him not; nor knew he wept.— For mighty sorrow burst from out his heart, And flooded all his being, and he sunk, And moaned: ‘Eileen, I love thee! Yea, I love, And loved thee ever; and I can not think That I shall never gaze upon thee more. My life for thine—ah, that were naught to give, Meant not the gift to see thee nevermore! Never to hear thy voice. Nay, nay, Eileen, Gaze on me, speak to me, give me but one word, And I will go and never more return.’ But Eileen answered not; he touched her hand, And she felt nothing. Then he whispered, low, ‘Oh, may God keep thee—for it must be done— Guard thee, and bless thee, thou my soul’s delight! And when thou waken’st, wilt thou think of me, Of Cedric, him that loved thee, oh so true? Nay, for they said thou shouldst no sorrow know, And that would be a sorrow, yea, it would. And must thou then forget me, thou my love? And canst not give me but one single word, To tell me that I do not die in vain? Gaze at me, Eileen, see, thy love is here, Here as of old, above thee stooping light, To press a kiss upon thy tender lips.— Ah, I can kiss thee—kiss thee, my Eileen, Kiss as of yore, with all my passion’s woe!’ And as he spoke he pressed her to his heart, Long, long, with yearning, and he felt the leap Of molten metal through his throbbing veins; His eyes shot fire, and anguish racked his limbs, And he fell back, and reeled, and clutched his brow. An instant only gazed he on her face, And saw new life within her gray cheek leap, And her dark eyelids tremble. Then with moan, And fearful struggle, swift he fled away, That she might nothing of his strife perceive. And then, reminded of his gift of flight, He started from the earth, and beat aloft, Each sweep of his great wings a torture-stroke Upon his fainting heart. And thus away, With languid flight he moved, and Eileen, raised In new-born joy from off her couch of pain, Saw a strange bird into the distance fade.” And so Cedric went back to the seamèd rock, and there he heard a voice calling, “I seek Caradrion!” And as before he answered, “Come not, except to sorrow thou be born!” And again, in the cave— “The hours of night sped by. And sounds came forth as when a woman fights In savage pain, a life from hers to free. But Eileen dwelt within the happy vale, Thinking no thought of him that went away.” Section 4. This had come so very easily to Thyrsis that he could not believe that it was good. “Just a little story,” he said to Corydon, when he read it to her, and he was surprised to see how it affected her—how the tears welled into her eyes, and she clung to him sobbing. It meant more to her than any other thing that he had written; it was the very voice of their tenderness and their grief. Then Thyrsis took it to the one editor he knew who was a lover of poetry, and was surprised again, at this man’s delight. But he smiled sadly as he realized that the editor did not use poetry—they did not praise so recklessly when it was a question of something to be purchased! “The poem is too long for any magazine,” was the verdict, “and it’s not long enough for a book. And besides, poetry doesn’t sell.” But none the less Thyrsis, who would never take a defeat, began to offer it about; and so “Caradrion” was added to the list of stamp-consuming manuscripts, and set out to see the world at the expense of its creator’s stomach. So there was one more wasted vision, one more futile effort—and one more grapple with despair, in the hours when he and his wife sat wrapped in a blanket in the tenement-room. Corydon was growing more nervous and unhappy every day, it seemed to him. There were, apparently, endless humiliations to be experienced by a woman “whose husband did not support her”. Some zealous relative had suggested to her the idea that the “hall-boys” might think she was not really married; and so now she was impelled to speculate upon the psychology of these Ethiopian functionaries, and look for slights and disapproval from them! Thyrsis, from much work and little sleep, was haggard and wild of aspect; the cry of the world, “Take a position!” rang in his ears day and night. The springs of book-reviews had dried up entirely, and by sheer starvation he was forced to a stage lower yet. A former college friend was editing a work of “contemporary biography”, and offered Thyrsis some hack-writing. It meant the carrying home of huge bundles of correspondence from the world’s most brightly-shining lights, and the making up of biographical sketches from their eulogies of themselves. With every light there came a portrait, showing what manner of light it was. As for Thyrsis, he did his writing with the feeling that he would like to explore with a poniard the interiors of each one of these people. For nearly three months now an eminent editor had been trying to summon up the courage to accept “The Hearer of Truth”. He had written several letters to tell the author how good a work it was; and now that it was to be definitely rejected, he soothed his conscience by inviting the author to lunch. The function came off at one of the most august and stately of the city’s clubs, a marble building near Fifth Avenue, where Thyrsis, with a new clean collar, and his worn shoes newly shined, passed under the suspicious eyes of the liveried menials, and was ushered before the eminent editor. About the vast room were portraits of bygone dignitaries; and there were great leather-upholstered arm-chairs in which one might see the dignitaries of the present—some of them with little tables at their sides, and decanters and soda and cracked ice. They went into the dining-room, where everyone spoke and ate in whispers, and the waiters flitted about like black and white ghosts; and while Thyrsis consumed a cupful of cold bouillon, and a squab en casserole, and a plate of what might be described as an honorific salad, he listened to the soft-voiced editor discussing the problem of his future career. The editor’s theme was what the public wanted. The world had existed for a long time, it seemed, and was not easily to be changed; it was necessary for an author to take its prejudices into consideration—especially if he was young, and unknown, and—er—dependent upon his own resources. It seemed to Thyrsis, as he listened, that the great man must have arranged this luncheon as a stage-setting for his remarks—planning it on purpose to light a blaze of bitterness in the soul of the hungry poet. “Look at me,” he seemed to say—“this is the way the job is done. Once I was poor and unknown like you—actually, though you might not credit it, a raw boy from the country. But I had taste and talent, and I was judicious; and so now for thirty years I have been at the head of one of the country’s leading magazines. And see—by my mere word I am able to bring you here into the very citadel of power! For these men about you are the masters of the metropolis. There is a rich publisher—his name is a household word—and you saw how he touched me on the shoulder. There is an ex-mayor of the city—you saw how he nodded to me! Yonder is the head of one of the oldest and most exclusive of the city’s landed families—even with him I am acquainted! And this is power! You may know it by all these signs of mahogany furniture, and leather upholstery, and waiters of reverential deportment. You may know it by the signs of respectability and awesomeness and chaste abundance. Make haste to pay homage to it, and enroll yourself in its service!” Thyrsis held himself in, and parted from the editor with all courtesy; but then, as he walked down Fifth Avenue, his fury burst into flame. Here, too, was power—here, too, the signs of it! Palaces of granite and marble, arid towering apartment-hotels; an endless vista of carriages and automobiles, with rich women lolling in them, or descending into shops whose windows blazed with jewels and silver and gold. Here were the masters of the metropolis, the masters of life; the dispensers of patronage—that “public” which he had to please. He would bring his vision and lay it at their feet, and they would give him or deny him opportunity! And what was it that they wanted? Was it worship and consecration and love? One could read the answer in their purse-proud glances; in the barriers of steel and bronze with which they protected the gates of their palaces; in the aspects of their flunkeys, whose casual glances were like blows in the face. One could read the answer in the pitiful features of the little errand-girl who went past, carrying some bit of their splendor to them; or of the ragged beggar, who hovered in the shelter of a side-street, fearing their displeasure. No, they were not lovers of life, and protectors; they were parasites and destroyers, devourers of the hopes of humanity! Their splendors were the distilled essence of the tears and agonies of millions of defeated people—their jewels were drops of blood from the heart of the human race! Section 5. So, with rage and bitterness, Thyrsis was gnawing out his soul in the night-time; distilling those fierce poisons which he was to pour into the next of his works—the most terrible of them all, and the one which the world would never forgive him. There came another episode, to bring matters to a crisis. In the far Northwest lived another branch of Thyrsis’ family, the head of which had become what the papers called a “lumber-king”. One of this great man’s radiant daughters was to be married, and the family made the selecting of her trousseau the occasion for a flying visit to the metropolis. So there were family reunions, and Thyrsis was invited to bring his wife and call. Corydon voiced her perplexity. “What do they want to see us for?” she asked. “I belong to their line,” he said. “But—you are poor!” she exclaimed. “I know,” he said, “but the family’s the family, and they are too proud to be snobbish.” “But—why do they ask me?” Thyrsis pondered. “They know we have published a book,” he said. “It must be their tribute to literature.” “Are they people of culture?” she asked. “Not unless they’ve tried very hard,” he answered. “But they have old traditions—and they want to be aristocratic.” “I won’t go,” said Corydon. “I couldn’t stand them.” And so Thyrsis went alone—to that same temple of luxury where he had called upon the college-professor. And there he met the lumber-king, who was tall and imposing of aspect; and the lumber-queen, who was verging on stoutness; and the three lumber-princesses, who were disturbing creatures for a poet to gaze upon. It seemed to Thyrsis that he had been dwelling in the slums all his life—so sharp was the shock which came to him at the meeting with these young girls. They were exquisite beyond telling: the graceful lines of their figures, the perfect features, the radiant complexions; the soft, filmy gowns they wore, the faint, intoxicating perfumes that clung to them, the atmosphere of serenity which they radiated. There was that in Thyrsis which thrilled at their presence—he had been born into such a world, and might have had such a woman for his mate. But he put such thoughts from him—he had made his choice long ago, and it was not the primrose-path. Perhaps he was over-sensitive, acutely aware of himself as a strange creature with no cuffs, and with hardly any soles to his shoes. And all the time of these women was taken up by the arrival of packages of gowns and millinery; their conversation was of diamonds and automobiles, and the forthcoming honeymoon upon the Riviera. So it was hard for him not to feel bitterness; hard for him to keep his thoughts from going back to the lonely child-wife wandering about in the park—to all her deprivations, her blasted hopes and dying glories of soul. The family was going to the matinée; as there was room in their car, they asked Thyrsis to go with them. So he watched the lumber-king (who had refused to lend him money, but had offered him a “position”) draw out a bank-note from a large roll, and pay for a box in one of Broadway’s great palaces of art. And now—having been advised so often to study what the public wanted—now Thyrsis had a chance to recline at his ease and follow the advice. “The Princess of Prague”, it was called; it was a “musical comedy”; and evidently exactly what the public wanted, for the house was crowded to the doors. The leading comedian was said by the papers to be receiving a salary of a thousand dollars a week. He held the center of the stage, clad in the costume of a lieutenant of marines, and winked and grinned, and performed antics, and sang songs of no doubtful significance, and emitted a fusillade of cynical jests. He was supposed to be half-drunk, and making love to a run-away princess—who would at one moment accept his caresses, and then spurn him coquettishly, and then execute an unlovely dance with him. In between these diverting procedures a chorus would come on, a score or so of highly-painted women, hopping and gliding about, each time clad in new costumes more cunningly indecent than the last. From beginning to end of this piece there was not a single line of real humor, a spark of human sentiment, a gleam of intelligence; it was a kind of delirium tremens of the drama. To Thyrsis it seemed as if a whole civilization, with all its resources of science and art—its music and painting and costumes, its poets and composers, its actors, singers, orchestra, and audience—had all at once fallen victims to an attack of St. Vitus’ dance. He sat and listened, while the theatre full of people roared and howled its applause; while the family beside him—mother and father and daughters—laughed over jokes that made him ashamed to turn and look at them. In the end the realization of what this scene meant—not only the break-down of a civilization, but the trap in which his own spirit was caught—made him sick and faint all over. He had to ask to be excused, and went out and sat in the lobby until the “show” was done. The family found him there, and the bride-to-be inquired if he “felt better”; then, looking at his pale face, an idea occurred to her, and after a bit of hesitation, she asked him if he would not stay to dinner. In her mind was the conflict between pity for this poor boy, and doubt as to the fitness of his costume; and Thyrsis, having read her mind in a flash, was divided between his humiliation, and his desire for some food. In the end the baser motive won; he buried his pride, and went to dinner.—And so, as the fates had planned it, the impulse to his next book was born. Section 6. There came another guest to the meal—the rector of the fashionable church which the family attended at home. He was a young man, renowned for the charm of his oratory; smooth-shaven, pink-and-white-cheeked, exquisite in his manners, gracious and insinuating. His ideas and his language and his morals were all as perfectly polished as his finger-nails; and never before in his life had Thyrsis had such a red rag waved in his face. But he had come there for the dinner, and he attended to that, and let Dr. Holland provide the flow of soul; until at the very end, when the doctor was sipping his demi-tasse. The conversation had come, by some devious route, to Vegetarianism; and the clergyman was disapproving of it. That made no difference to Thyrsis, who was not a vegetarian, and knew nothing about it; but how he hated the arguments the man advanced! For that which made the doctor an anti-vegetarian was an attitude to life, which had also made him a Republican and an Imperialist, a graduate of Harvard and a beneficiary of the Apostolic Succession. Because life was a survival of the fittest, and because God had intended the less fit to take the doctor’s word as their sentence of extermination. The duty of animals, as the clergyman set it forth to them, was to convert plant-tissue into a more concentrated and perfect form of nutriment. “The protein of animal flesh,” he was saying, “is more nearly allied to human tissue; and so it is clearly more fitted for our food.” Here Thyrsis entered the conversation. “Doctor Holland,” he said, mildly, “I should think it would occur to you to follow your argument to its conclusion.” The other turned to look at him. “What conclusion?” he asked. “I should think you would become a cannibal,” Thyrsis replied. And then there was silence at the table. When Dr. Holland spoke again it was to hurry the conversation elsewhere; and from time to time thereafter he would steal a puzzled glance at Thyrsis. But this the boy did not see. His thoughts had gone whirling on; here, in this elegant dining-room, the throes of creation seized hold of him. For this was the image he had been seeking, the phrase that would embrace it all and express it all—the concentrated bitterness of his poisoned life! Yes, he had them! He had them, with all their glory and their power! They were Cannibals. Cannibals! So, when he set out from the hotel, he did not go home, but walked instead for uncounted hours in the park. And in those hours he lived through the whole of his new book, the unspeakable book—“The Higher Cannibalism”! In the morning he told Corydon about it. She cried in terror, “But, Thyrsis, nobody would publish it!” “Of course not,” said he. “But then,” she asked, “how can you write it?” “I shall write it,” he said, “if I have to die when I get through”. So he shut himself up in his room once more. Section 7. A famous scientist began the story—reasoning along the lines of Dr. Holland’s argument. The grass took the inorganic matter, and made it into food; the steer ate the grass, and carried it to the next stage; and beyond that was one stage more. So the scientist began making experiments—in a quiet way, of course. He reported the results before a learned scientific body, but his colleagues were so scandalized that the matter was hushed up. The seed had been sown, however. A younger man took up the idea, and made researches in the South Seas—substantiating the claim that those races which took to anthropophagy had invariably supplanted the others. The new investigator printed his findings in a book which was circulated privately; and pretty soon he was called into consultation by the master-mind of the country’s finance—the richest man in the world. This man was old and bald and feeble; and now suddenly there came to him a new lease of life—new health and new enthusiasm. It was given out that he had got it by wandering about bare-footed in the grass, and playing golf all day—an explanation which the public accepted without question. No one remarked the fact that the old man began devoting his wealth to the establishing of foundling asylums; nor did any one think it suspicious that the younger generation of this multi-millionaire should rise so suddenly to power and fame. But there began to be strange rumors and suspicions. There were young writers, who had developed a new technique, and had carried poetic utterance to undreamed of heights; and in this poetry were cryptic allusions, hints of diabolic things. A Socialist paper printed the ménu of a banquet given by these “Neo-Nietzscheans”, and demanded to know what one was to understand by filet de mouton blanc, and wherein lay the subtle humor of paté de petit bête. And at last the storm broke—a youth scarcely in his teens published a book of poems in which the dread secret was blazoned forth to the world with mocking defiance. There were frantic attempts to suppress this book, but they failed; and then a prosecuting officer, eager for notoriety, placed the youth upon trial for his life. And so the issue was drawn. The public at large awakened to a dazed realization of the head-way which the new idea had made. It had become a cult of the ruling-class, the esoteric religion of the state; everywhere its defenders sprang up—it seemed as if all the intellectual as well as the material power of the community was under its spell. To oppose it was not merely bad form—it was to incur a stigma of moral inferiority, to be the victim of a “slave-ethic”. With the scientific world, of course, its victory was speedy; the new doctrine was in line with recognized evolutionary teaching. The great names of Darwin and Spencer were invoked in its support; and, of course, when it came to economic science, there could be no two opinions. Had laissez-faire ever meant anything, if laissez-faire did not mean this? At the very outset, the country was startled by the publication of a book by a college professor, famed as a leading sociologist, in which the case was presented without any attempt at sophistication. It was a fact, needing no attestation, that the mass of mankind had always lived in a state of slavery. At the present hour, under the forms of democracy, there were a quarter of a million men killed every year in industry, and half a million women living by prostitution, and two million children earning wages, and ten million people in want; and in comparison with these things, how humane was the new cult, how honest and above-board, how clean and economical! For the first time there could be offered to the submerged tenth a real social function to be performed. Once let the new teaching be applied upon a world-wide scale, and the proletariat might follow its natural impulse to multiply without limit; there would be no more “race-suicide” to trouble the souls of eminent statesmen. And this at the time when the attention of the community was focussed upon the new cause célèbre! When the public prints were filled with an acrimonious discussion as to the meaning of the instructions given to the jury. If anyone chose to will his body to a purchaser, said the judge, and then go and commit suicide, there was no law to prevent him; and, of course, the subsequent purposes of the purchaser had nothing to do with the point at issue. This was a matter of taste—here the learned justice rapped for order—a matter of prejudice, largely, and the question at issue was one of law. There was no law controlling a man’s dietetic idiosyncrasies, and it was to be doubted if constitutionally any such law would stand—certainly not in a federal court, unless it chanced to be a matter of interstate commerce. In their bewilderment and dismay, the people turned to the Church. Surely the doctrines of Christianity would stand like a barricade against this monstrous cult. But already within the Church there had been rumors and disturbances; and now suddenly a bishop arose and voiced his protest against this attempt “to drag the Church into the mire of political controversy.” It must be made perfectly clear, said the bishop, that Christianity was a religion, and not a dietetic dogma. Its purpose was to save the souls of men, and not to concern itself with their bodies. It had been stated that we should have the poor always with us; which made clear the futility of attempting to change the facts of Nature. Also it was certain that the founder of Christianity had been a meat-eater; and though there might be more than one interpretation placed upon his command concerning little children—- There we might leave Thyrsis with the established Church. He had it just where he wanted it, and he shook it until its smoothly-shaven pink and white cheeks turned purple, and the demi-tasse went flying out of its beautifully manicured fingers! And while he did it he laughed aloud in hideous glee, and in his soul was a cry like the hunting-call of the lone gray wolf, that he had heard at midnight in his wilderness camp. So far a journey had come the little boy who had been dressed up in scarlet and purple robes, and had carried the bishop’s train at the confirmation service! And so heavy a penalty did the church pay for its alliance with “good society”! Section 8. Thyrsis paid a week’s living expenses to have this manuscript copied; and then he took it about to the publishers. First came his friend Mr. Ardsley, who had become his chief adviser. When Thyrsis went to see him, Mr. Ardsley drew out an envelope from his desk, and took from it the opinion of his reader. “‘What in the world is the matter with this boy?’” he read. “That’s the opening sentence.” And then he fixed his eyes upon the boy. “What in the world is the matter?” he asked. Thyrsis sat silent; there was no reply he could make. He was strongly tempted to say to the man, “The matter is that I am not getting enough to eat!” But already Thyrsis himself had judged “The Higher Cannibalism” and repudiated it. It was born of his pain and weakness, and it was not the work he had come into the world to do. So at the end he had placed a poem, which told of a visit from his muse, after the fashion of Musset’s “Nuits”; the muse had been sad and silent, and in the end the poet had torn up the product of his hours of despair, and had renewed his faith with the gracious one. Meantime the long winter months dragged by, and still there was no gleam of hope. For Corydon it was even harder than for her husband. He at least was expressing his feelings, while she could only pine and chafe, without any sort of vent. Her life was a matter of colorless routine, in which each day was like the last, except in increased monotony. She tried hard not to let him see how she suffered; but sometimes the tears would come. And her unhappiness was bad for the child, which in the beginning had been robust and magnificent, but now was not growing properly. Thyrsis would have ridiculed the idea that nervousness could affect her milk; but the time came when, in later life, he saw the poisons of fatigue and fear in test-tubes, and so he understood why the child had not been able to lift its head until it was a year old, and had then been well on the way to having “rickets.” All their life was so different from the way they had dreamed it! The dream still lured them; but its voice grew fainter and more remote. How were they to keep it real to themselves, how were they to hold it? Their existence was made up of endless sordidness, of dreary commonplace, that opposed them with its passive inertia where it did not actively attack them. “Ah, Thyrsis!” Corydon would cry to him, “this will kill us if it lasts too long!” For one thing, they no longer heard any music at all—She was not strong enough to practice the piano; and his violin was gone. Here in the great city an endless stream of concerts and operas and recitals flowed past; and here were they, like starving children who press their faces against a pastry-cook’s window and devour the sweets with their eyes. Thyrsis kept up with musical and dramatic progress by reading the accounts in the papers and magazines; but this was a good deal like slaking one’s thirst with a mirage. He used to wonder sometimes if he were to write to these great artists—would they invite him to hear them, or would they too despise him? He never had the courage to try. Once in the course of the long winter some one presented Corydon with two tickets to the opera, and they went together, in a state of utter bliss. It was an unusual experience for Thyrsis, for their seats were in the orchestra, and hitherto he had always heard his operas from the upper rows in the fifth balcony, where the air was hot and stifling, and the singers appeared as a pair of tiny arms that waved, and a head (frequently a bald head) that emitted a thin, far-distant voice. This had become to him one of the conventions of the opera; and now to discover the singers as full-sized human beings, with faces and legs and loud voices, was very disturbing to his sense of illusion. Also, alas, they had not been free to select the opera. It was “La Traviata”; and there was not much food for their hungry souls in this farrago of artificiality and sham sentiment. They shut their eyes and tried to enjoy the music, forgetting the gallant young men of fashion and their fascinating mistresses. But even the music, it seemed, was tainted; or could it be, Thyrsis wondered, that he could no longer lose himself in the pure joy of melody? Many kinds of corruption he had by this time learned about; the corruption of men, and of women, and of children; the corruption of painting and sculpture, of poetry and the drama. But the corruption of music was something which even yet he could not face; for music was the very voice of the soul—the well-spring from which life itself was derived. Thyrsis thought, as he and Corydon wandered about in the foyers of this palatial opera-house, was there anywhere on earth a place in which heaven and hell came so close together. A place where the lust and pride of the flesh displayed themselves in all their glory; and in contrast with the purest ecstasies the human spirit had attained! He pointed out one rich dowager who swept past them; her breasts all but jostling out of her corsage as she walked, her stomach squeezed into a sort of armor-plate of jewels, her cheeks powdered and painted, her head weighted with false hair and a tiara of diamonds, her face like a mask of pride and scorn. And then, in juxtaposition with that, the Waldweben and the Feuerzauber, or the grim and awful tragedy of the Siegfried funeral-march! There were people in this opera-house who knew what such music meant; Thyrsis had read it in their faces, in that suffocating top-gallery. He wondered if some day the demons that were evoked by the music might not call to them and lead them in revolt, to drive the money-changers from the temple once again! Section 9. Another editor was reading “The Hearer of Truth,” and a publisher was hovering on the brink of venturing “The Higher Cannibalism”; and so the two had new hopes to lure them on. When the spring-time had come, they would once more escape from the city, and would put up their tent on the lake-shore! They spent long afternoons picturing just how they would live—what they would eat, and what they would wear, and what they would study. As for Cedric—so they had called the baby—they saw him playing beneath the big tree in front of the tent. And what fun they would have giving him his bath on the little beach inside the point! “I’ll fix up a clothes-basket for him to sleep in!” declared Thyrsis. “Nonsense, dear!” said Corydon. “I’ve told you many times before—we’ll have to have a crib for him!” “But why?” cried he; and there would follow an argument which gave pain to his economical soul. Corydon declared herself willing to do her share in the matter of saving money; but it seemed to him that whenever he suggested a concrete idea, there would be objections. “We can get up at dawn,” he would say, “and save the cost of oil.” “Yes,” she would answer. “And we can do our own laundry,” he would continue. But immediately another argument would begin; it was impossible to persuade Corydon that diapers could be washed in cold water, even when one had the whole of the Great Lakes for a washtub. They would go on to contemplate the glorious time when they would have money enough to build a home of their own, that could be inhabited in winter as well as in summer; Corydon always referred to it with the line from “Caradrion”—“the little cot, fringed round with tender green.” It would be fine for the baby, they agreed—he should never have to go back to the city again. Thyrsis had a vision of him as he would be in that home: a brown and freckled country boy, with what were known, in the dialect of “dam-fool talk”, as “yagged panties and bare feets”. But Corydon would protest at that picture. “It’s all right,” she said, “to put up with ugliness if you have to. But what’s the use of making a fetish of it?” “It wouldn’t be ugliness,” replied he. “It would be Nature! ‘Blessings on thee, little man!’” “That’s all very well. But I want Cedric to have curls—” “Curls!” he cried. “And then a Fauntleroy suit, I suppose!” “No—at least not while we’re poor. But I want him to look decent——” “If you have curls, then you’ll want a nurse-maid to brush them!” “Nonsense, Thyrsis! Can’t a mother take care of her child’s own hair?” “Some mothers can—they have nothing better to do. But if you were going in for the hair-dresser’s art, why did you cut off your own?” And so would come yet new discussions. “You’ll be wanting me to maintain an establishment!” Thyrsis would cry, whenever these aesthetic impulses manifested themselves. He seemed to be haunted by that image of an establishment. All married men came to it in the end—there seemed to be something in matrimony that predisposed to it; and far better adopt at once the ideals and habits of the gypsies, than to settle into respectability with a nurse-maid and a cook! Thyrsis was under the necessity of sweeping clean his soul, because of all the luxury and wantonness he saw in this metropolis, and the madness to which it goaded his soul. Some day fame would come to him, he knew—wealth also, perhaps; and oh, there must be one man in all the city who was not corrupted, who did not learn extravagance and self-indulgence, who practiced as well as preached the life of faith! And so, again and again, he and Corydon would renew the pledges of their courtship-days—pledges to a discipline of Spartan sternness. Poor as he was, Thyrsis still found time to figure over the things he meant to do when he got money: the publishing-house that was to bring out his books at cost, and the free reading-rooms and the circulating libraries. Also, he wanted to edit a magazine; for there was a great truth which he wished to teach the world. “We must make these things that we have suffered count for something!” he would say to Corydon, again and again. “We must use them to open people’s eyes!” He was thinking how, when at last he had escaped from the pit, he would be in a position to speak for those others who were left behind. Men would heed him then, and he could show them how impossible it was for the creative artist to do his work, and at the same time carry on the struggle for bread. He would induce some rich man to set aside a fund for the endowment of young writers; and so the man who had a real message might no longer have to starve. Thyrsis had by this time tried all the world, and he knew that there was no one to understand. Just about now he was utterly stranded, and had to borrow money for even his next day’s food. And oh, the humiliations and insults that came with these loans! And worse yet, the humiliations and insults that came without any loans! There was one rich man who advanced him ten dollars; Thyrsis, when he returned it, sent a check he had received from some out-of-town magazine—and in return was rebuked by the rich man for failing to include the “exchange” on the check. Thyrsis wrote humbly to inquire what manner of thing the “exchange” on a check might be; and learned that he was still in the rich man’s debt to the sum of ten cents! His case was the more hopeless, he found, because he was a married man. The world might have pardoned a young free-lance who was willing to “rough it” and take his chances for a while; but a man who had a wife and child—and was still prating about poetry! To the world the possession of a wife and child meant self-indulgence; and when a man had fallen into that trap, he simply had to settle down and take the consequence. How could Thyrsis explain that his marriage had not been as other men’s? How could he hint at such a thing, without proving himself a cad? Section 10. The work of “contemporary biography” had come to an end; there followed weeks of seeking, and then another opening appeared—Mr. Ardsley offered him a chance to do some manuscript-reading. This was really a splendid opportunity, for the work would not be difficult, and the payment would be five dollars for each manuscript. Thyrsis accepted joyfully, and forthwith carried off a couple of embryo books to his room. It was a new and curious occupation, which opened up to him whole worlds whose existence he had not previously suspected. Through his review-writing he had become acquainted with the books that had seen the light of day; now he made the startling discovery that for every one that was born, there were hundreds, perhaps thousands, that died in the womb. He could see how it went—the hordes of half-educated people who read books and were moved to write something like them. Each manuscript was a separate tragedy; and often there would be a letter or a preface to make certain that one did not miss the sense of it. Here would be a settlement-worker, burning with a message, but unable to draw a character or to write dialogue; here would be a business-man, who had studied up the dialect of the region where he spent his summer vacations, and whose style was so crude that one winced as he turned the pages; here would be a poor bookkeeper, or a type-writer, or other cog in the business machine, who had read of the fortunes made by writers of fiction, and had spent all his hours of leisure for a year in composing a tale of the grand monde, or some feeble imitation of the sugar-coated “historical romance” of the hour. Sometimes as he read these manuscripts, a shudder would come over Thyrsis; how they made him realize the odds in the game of life! These thousands and tens of thousands panting and striving for success; and he lost in the throng of them! What madness it seemed to imagine that he might climb over their heads—that he had been chosen to scale the heights of fame! Their letters and prefaces sounded like a satire upon his own attitude, a reductio ad absurdum of his claims to “genius”. Here, for instance, was a man who wrote to introduce himself as America’s first epic poet—stating incidentally that he was an inspector of gas-meters, and had a wife and six children. His poem occupied some six hundred foolscap sheets, finely bound up by hand; it set forth the soul-states of a Byron from Alabama—an aristocratic hero who was refused by the lady of his heart, and voiced his anger and perplexity in a long speech, two lines of which stamped themselves forever upon the mind of the reader—- “But I! he cried. My limbs are straight, My purse well-filled, my veins all F. F. V.!” As a method of earning one’s living, this was almost too good to be true. The worse the manuscripts were the easier was his task; in fact, when he came upon one which showed traces of real power and interest he cursed his fate, for then it might take several days to earn his five dollars. But for the most part the manuscripts were bad enough, and he could have earned a year’s income in a week, if only there had been enough of them. So he made a great effort to succeed at the work, and filled his reports with epigrams and keen observations, carefully adapted to what he knew was Mr. Ardsley’s point of view. He allowed time for these devices to be effective, and then paid a visit to find out about the prospects. “Mr. Ardsley,” he began, “I am going to try to meet you half way with a book.” “Ah!” said the other. “I want to write a novel that you can publish. I believe that I can do it.” Mr. Ardsley warmed immediately. “I have always been certain that you could,” said he. He went on to expound to Thyrsis the ethics of opportunism—how it would not be necessary to be false to his convictions, to write anything that he did not believe—but simply to put his convictions into a popular form, and to impart no more than the public could swallow at the first mouthful. Thyrsis told him the outline of a plot. He would write a story of the struggles of a young author in the metropolis—not such a young author as himself, a rebel and a frenzied egotist, but a plain, everyday young author whom other people could care about. He had the “local color” for such a tale, and he could do it without too much waste of time. Mr. Ardsley thought it an excellent idea. After which Thyrsis came, very cautiously, to the meat of the matter. “I want to get away into the country to write it,” he said; “and so I wanted to ask you about the manuscripts you are sending me. Have you found my work satisfactory?” “Why, yes,” said the other. “And do you think you can send them through the summer?” “I presume so. It depends upon how many come to us.” “You—you couldn’t arrange to let me have any more of them?” “Not at present,” said Mr. Ardsley. “You see, I have regular readers, whose work I know. I’ll send you what I have to spare.” “Thank you,” said Thyrsis. “I’ll be glad to have all you can give me.” So he went away; and in the little room he and Corydon had an anxious consultation. He had been getting about twenty dollars a month; which was not enough for the family to exist upon. “Our only hope is a new book,” he declared; and Corydon saw that was the truth. “Each week that I stay here is a loss,” he added. “I have to pay room-rent.” “But can you stand tenting out in April?” asked she. “I’ll chance it,” he replied—“if you’ll say the word.” She saw that her duty was before her; she must nerve herself and face it, though it tore her heartstrings. She must stay and take care of the baby, while he went away to work! He sat and held her hands, and saw her bite her lips and fight to keep back the tears in her eyes. Their hearts had grown together, so that it was like tearing their flesh to separate them. They had never imagined that such a thing could come into their lives. “Thyrsis,” she whispered—“you’ll forget me!” He pressed her hands more tightly. “No, dear! No!” he said. “But you’ll get used to living without me!” she cried. “And it’s the time in my life when I need you most!” “I will stay, dearest, if you say so.” She exclaimed, “No, no! I must stand it!” And seeing her grief, his heart breaking with pity, a strange impulse came to Thyrsis. He took her hands in his, and knelt down before her, and began to pray. It had been years since he had thought of prayer, and Corydon had never thought of it in her life. It came from the deeps of him—a few stammering words, simple, almost childish, yet exquisite as music. He prayed that they might have courage to keep up the fight, that they might be able to hold their love before them, that nothing might ever dim their vision of each other. It was a prayer without theology or metaphysics—a prayer to the unknown gods; but it set free the well-spring of tenderness and pity within them; and when he finished Corydon was sobbing upon his shoulder. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3235/88526.html","bookId":682,"book":{"id":682,"title":"Love\u0027s Pilgrimage","description":"简介： It was the Highway of Lost Men. They shivered, and drew their shoulders together as they walked, for it was night, and a cold, sleety rain was falling. The lights from saloons and pawn-shops fell upon their facesfaces haggard and gaunt with misery, o...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3235","creation":"Aug 1, 2019 12:19:09 AM","modification":"Aug 1, 2019 12:19:09 AM"}}
