{"id":45310,"no":2,"title":"Chapter 2 - Injury Of The Self-Inflicted Nature","content":"Part 1 The cups were tall and ancient, filled with mellow, thirty-year old wine. The green-clad, middle-aged man poured six cups. Dragon Fifth said, “You alone can accomplish a task set for three people. You should also be able to drink the wine of three.” Liu Changjie replied. “This is good wine. I could drink thirty cups!” His alcohol tolerance was high, and he drank quickly. And got drunk. People who have a high alcohol tolerance but drink quickly, also can get drunk easily. Suddenly, he slipped off the bench as if it were made from slick mud. Dragon Fifth crouched next to him and stared, as if he were meditating. The fragrance of wine drifted throughout the room, and outside it was very quiet. After a very long time, Dragon Fifth suddenly said, “Ask.” Lan Tianmeng immediately approached. Grabbing Liu Changjie by the hair, he poured half a pot of wine onto his face. Sometimes wine makes drunk people sober. “What is your surname?” said Lan Tianmeng. “What is your given name?” “I’m surnamed Liu. Given name Changjie.” It seemed Liu Changjie’s tongue was swollen to twice its normal size. “Where did you grow up?” “Jinan Prefecture, Yang Liu Village.” [1] “Who taught you martial arts?” “I taught myself.” Liu Changjie giggled. “No one is good enough to be my master, and I have the Book of Heaven.” This wasn’t all just drunk talk. In the world, there were many secret martial arts manuals that had been lost for ages, then were suddenly discovered again. Lan Tianmeng continued: “Have you mastered all the techniques of this martial art?” “I’ve studied enough. I’m not stupid.” “Who sent you here?” “I sent myself. At first I was thinking of killing Dragon Fifth.” He suddenly smiled. “If I killed him, then I would be the most famous person under heaven.” “It seems that you’re unable to kill him, after all.” “I’m not stupid.” Liu Changjie continued. “Being the second most famous person under heaven is good too … He asks me to sit, asks me to drink, he must also be able to see my ability.” Lan Tianmeng wanted to continue questioning him, but Dragon Fifh waved his hand. “That’s enough.” “What should I do with him?” Dragon Fifh’s face was once again filled with a weary expression. “He’s completely drunk,” he said coldly. Lan Tianmeng nodded, and suddenly punched Liu Changjie in the ribs. Part 2 Starlight glittered and the full moon was like a large block of ice. Liu Changjie was suddenly woken by a sharp pain, to find himself hanging like a wind chime from the eaves of the Heavenly Fragrance pavilion. The late night wind of July carried a sharp chill. The cold wind cut across his body like a knife. His clothes were ripped to shreds, so badly that it looked like his bones must be broken. His mouth dripped with blood and with bile, sour and bitter. His body was the same, completely covered with blood and vomit. He looked like a stray dog that had just been severely beaten. The Heavenly Fragrance Pavilion’s lamps had long been extinguished, and the shop across the street had shuttered its front entrance.. And Dragon Fifth? Who knew his whereabouts? No one ever knew. There was no light. No people. No sound. The long street was filled with trash, and in the darkness of the night it seemed ugly, stupid and broken, just like Liu Changjie as he hung from the eaves of the building. If you put yourself up for sell, and receive a severe beating in return, what feeling would you have in your heart? Liu Changjie suddenly summoned all the power in his body to shout out, “Dragon Fifth, you son of a b*tch! You …” He used every bad word he knew to curse Dragon Fifth as loudly as possible. On this late, silent night, anyone within ten streets could clearly hear his curses. Suddenly, the sound of clapping could be heard from very far away, and a laughing voice: “Great cursing! Excellent cursing! Really f*cking excellent cursing!” The sound of laughing was accompanied by the sound of galloping horses. Three horses dashed urgently down the long street, and came to a sudden stop under the eaves of the building. The leader of the small group looked up at Liu Changjie and laughed. “It’s been a long time since I’ve heard anyone willing to curse that son of b*tch. You simply must keep cursing him. You definitely can’t stop!” He had eyebrows as thick as a sword, and a beard like a dragon’s. He had a wild appearance, but his eyes were the eyes of a very intelligent person. Liu Changjie stared at him and said, “You like me cursing that son of a b*tch?” The bearded fellow laughingly replied, “I love it!” “Ok. Help me down, and I’ll keep cursing him.” “I specifically came to help you down.” “Oh?” “After hearing your cursing, I came immediately.” “Why?” asked Liu Changjie. With an air of pride, the bearded man said, “Because other than me, there’s no one willing to help someone who Dragon Fifth hangs from the eaves.” “You know me?” “I didn’t know you before, but as of now, you’re my friend.” “Why?” “Because as of now you are Dragon Fifth’s enemy. Any enemy of Dragon Fifth is a friend of mine.” “Who are you?” “I’m Meng Fei,” responded the bearded man. [2] “You’re Iron Guts “Meng Chang,” Meng Fei?” The bearded man looked up at him. “Correct. I’m the Meng Fei who’s not afraid to die.” Other than people who don’t fear death, who would be willing to oppose Dragon Fifth? ** Liu Changjie sat there, feeling like a sticky rice dumpling, wound up tight, unable to release his emotions. [2] Meng Fei sat across the table, looking at him. Suddenly he stuck out his hand, thumb raised up, and said, “Great! Really, a true man!” Liu Changjie smiled bitterly. “Getting beaten up counts as being a true man?” “Considering that you were almost beaten to death by that son of a b*tch and still had the guts to curse him. Well, yes you’re definitely a true man!” Meng Fei slammed his fist onto the table. “I should crush those bastards to death one by one.” “Why don’t you?” asked Liu Changjie. Meng Fei sighed. “Because I’m not good enough.” Liu Changjie laughed. “You not only have guts, you’re honest, too.” “I don’t have any other good qualities, except that I have the guts to oppose Dragon Fifth.” “It’s strange.” “What’s strange?” “Why hasn’t he come to kill you?” Meng Fei laughed. “Because he wants to display his tolerance and show his amazing benevolance. Let people know that he won’t even deign to recognize a person like me. He’s really just a son of a b*tch.” “Actually,” said Liu Changjie, “he can’t be a son of a b*tch, because he can’t even compare to a dog.” Meng Fei laughed. “Right! Completely correct! I have to drink to that!” Laughing, he called for wine and continued: “You can recover here from your injuries. I’ve already prepared two of the best types of medicine for you.” “One of them is wine?” asked Liu Changjie. Meng Fei laughed loudly. “Absolutely! It doesn’t matter who you are, it’s always beneficial to have a cup of nice wine.” He looked at Liu Changjie and shook his head. “But under these circumstances, a cup of wine won’t help. You need at least three hundred cups to have any positive effect.” Liu Changjie couldn’t stop laughing. “Other than wine, what other good medicine is there?” Meng Fei didn’t respond. He didn’t need to. People had begun to bring wine into the room. Six women; six young, beautiful women. Liu Changjie’s eyes lit up. He loved beautiful women, and there was no way to hide it. Meng Fei let out a loud laugh. “I’m sure you understand. It doesn’t matter who you are, it’s always beneficial to have a good woman.” Liu Changjie laughed. “But under these circumstances, a good woman won’t help. At the least, six are needed.” Meng Fei looked at him and then let out a sigh. “You’re not only honest, you also have guts. “Oh?” “To deal with six beautiful women is probably harder than dealing with Dragon Fifth.” ** Meng Fei was completely correct. Wine and women really were good for Liu Changjie. His injuries recovered even more rapidly than imagined. Meng Fei was completely incorrect. Liu Changjie might have problems dealing with Dragon Fifth, but he was definitely a master at dealing with women. He wasn’t just good at it, he was a professional. At this point, Meng Fei and he were good friends. They were the happiest when they had women and wine at hand, and curses for Dragon Fifth on their lips. And an audience. All the people in this place were enemies of Dragon Fifth. Only people who had suffered losses at his hand, yet escaped death, would be invited by Meng Fei here, to be entertained with the finest wine and women, then sent away with travel expenses covered. The two characters in the nickname “Meng Chang” came from this practice. As for the “Iron Guts” nickname, it simply meant that he didn’t fear death. Only people who didn’t fear death would dare to oppose Dragon Fifth. Much wine was imbibed, and the cursing proceeded with vigor. It was already late at night [3]. Those who were only listening were tired, but those who were cursing Dragon Fifth were filled with energy. Eventually, there were only two people left in the room, and they had already drunk enough wine for ten people. Liu Changjie suddenly asked Meng Fei, “Were you also beaten up by him?” Meng Fei shook his head. “Never.” “Did he kill your son? Steal your wife?” “No.” “So why do you hate him so much?” “Because he’s a son of a b*tch.” Liu Changjie was silent for a moment. “Actually, he isn’t really a son of a b*tch.” Meng Fei laughed. “I know. He doesn’t even compare to dogs.” Liu Changjie was silent again, but then laughed. “Actually, he is a little bit better than dogs.” Meng Fei stared at him for a long moment. Then he reluctantly agreed. “Maybe a little better. But at the most he’s only a little better.” “At least he’s a little smarter than a dog.” Meng Fei agreed reluctantly. “There are definitely some dogs in the world that are not as smart as him.” “After all,” said Liu Changjie, “A person like ‘Lion King’ Lan Tianmeng is willing to be his lackey; it shows that even if he isn’t a great person, he at least is willing to treat people well sometimes. Otherwise, no one would be willing to work so hard for him.” “He didn’t treat you well,” said Meng Fei coldly. Liu Changjie sighed. “Actually, it’s not a big surprise. I’m just a stranger, and he had no idea who I was. How could he know whether or not I could really help him with his task?” Meng Fei suddenly slapped the table and jumped up. Staring at Liu Changjie, he shouted, “What’s that supposed to mean!? He beat you half to death, and you’re suddenly talking about going to work for him again!?” “I’m just thinking,” said Liu Changjie calmly. “Maybe there was a reason he treated me like that. He doesn’t seem like a completely unreasonable person.” Meng Fei laughed coldly. “Don’t tell me you want to go see him again, and ask him why he beat you?” “That’s exactly what I’m saying.” Meng Fei stared hatefully. “Leave!” he roared. “Get the hell out of here! Leave through the back door. The faster you get the hell out of here, the better!” Liu Changjie stood up and headed toward the door in the back of the room. The doorway was narrow, and the door had been closed this whole time. On the other side was not a courtyard as expected, but instead, an exquisitely decorated private room. There was no other door in the room, not even anything that looked like a door. But, inside, there were two people. ** Dragon Fifth reclined on a leopard skin couch, resting with eyes closed. The green-robed, middle-aged man with white stockings stood over a small, red clay oven, warming wine. Lan Tianmeng was nowhere to be seen. As soon as Liu Changjie opened the door, he caught sight of them. He was neither afraid nor startled. This astonishing turn of events seemed to come as no surprise to him. Dragon Fifth opened his eyes and stared at him, and the corners of his mouth twisted into a smile. “Now I know why you’re not the least bit famous,” he said. Liu Changjie stood there listening. “Practicing martial art requires a lot of time and effort,” Dragon Fifth continued with a smile. “And women are the same. You’re good at both things. How could you have time and energy for anything else?” Liu Changjie laughed. “There are even other things I can do well that you don’t know about.” “Such as?” “Drinking.” “You can definitely drink a lot.” “But, I don’t get drunk very quickly.” “Oh?” “Today I’ve had much more to drink than the day I met you. And today I’m not the least bit drunk.” Dragon Fifth suddenly stopped laughing. A look as sharp as a blade suddenly filled his eyes as he stared at Liu Changjie. Liu Changjie stood there quietly, not avoiding his gaze. “Sit,” said Dragon Fifth. “Please, sit.” Liu Changjie sat. “It seems I’ve underestimated you,” said Dragon Fifth. “It’s not that you underestimated me. You didn’t trust me, that’s all.” “You’re a stranger.” “So you needed to investigate my background. See if I was telling the truth.” “You really aren’t stupid,” said Dragon Fifth. “If what I said was true, it’s still not too late to use me. If what I said wasn’t true, then it’s still not too late to kill me. After all, I’ve been in your grasp this whole time.” “Oh?” “Meng Fei saving me,” said Liu Changjie, “was obviously arranged by you. His arrival was far too coincidental.” “What else do you know?” “I know that a person like you would definitely need a few enemies like Meng Fei. Enemies can do things for you that friends can’t do… At the least, they can hear about things your friends would never hear about.” Dragon Fifth sighed again. “It seems you are anything but stupid. You’re actually quite intelligent.” Liu Changjie did not deny it. Dragon Fifth continued, “If you knew about my relationship with Meng Fei all along, then you must have also decided a long time ago to come looking for me.” “If not, then why would I wait here for so long?” “So you were pretending to be drunk that day?” “As I said, my alcohol tolerance is really high.” “But,” said Dragon Fifth icily, “you made one mistake.” “You think I shouldn’t have admitted that just now?” Dragon Fifth nodded his head. “A smart person would not only pretend to be drunk, they would also pretend to be confused. One person finding out the truth about your deception would be too much, and your life wouldn’t continue for very long.” Liu Changjie laughed. “Of course I have some good reasons for telling you.” “Like what?” “You coming back for me indicates that you investigated me, found out that what I said was true, and are prepared to use me.” “Keep going.” “The matter you wanted Du Qi and the others to handle, it was obviously something very important. You definitely would not want to use a confused drunkard to handle it.” “You’re trying to convince me that you are capable of helping me accomplish this task, aren’t you?” Liu Changjie nodded. “When you reach thirty years of age, if you haven’t accomplished something to shock the heavens and rock the earth, you might never be able to.” Dragon Fifth gazed at him, his pale white face covered with a smile. “Can you have a few more drinks with me?” he asked suddenly. Part 3 The alcohol arrived, already heated. Dragon Fifth lifted his cup slowly and said, “It’s not often that I drink wine, and not often that I toast others. But today, I must toast you three times.” Liu Changjie forced himself not to let any sort of excited or thankful expression appear in his eyes. It was definitely not easy for Dragon Fifth to toast him like this. Dragon Fifth drank the first cup and smiled. “I drink to you because I’m very happy. I truly believe that you can accomplish this task.” “I’ll devote myself to it entirely.” “This task… It’s not only very important, it’s also very dangerous, and extremely confidential.” His expression once again was very serious. “The way I treated you that day … it wasn’t only because I didn’t trust you.” Liu Changjie listened attentively. Dragon Fifth continued, “I couldn’t let anyone know that you are working for me. So I needed everyone to believe that we are enemies, that you hate me to the bones.” This was definitely mutual deception, the trick of self-inflicted injury. [4] Liu Changjie understood, but was unsure about one thing: “So even Lan Tianmeng doesn’t know all the details?” Dragon Fifth nodded. “The fewer people who know the details, the less danger you will be in, and the greater your chances of success.” Liu Changjie suddenly realized that Dragon Fifth only truly trusted two people: the green-robed middle-aged man with white stockings, and Meng Fei. “I said before,” Dragon Fifth continued, “I don’t have friends, and I don’t have enemies.” “Yes, you said that before.” “Except, it’s not true.” Dragon Fifth had a very strange expression on his face. “I not only have a friend, I also have an enemy, and a wife.” Moved, Liu Changjie said, “Who are they?” “Not they. Her.” Liu Changjie didn’t understand. Dragon Fifth went on, “My friend is also my enemy, and also my wife. They are all the same person.” Liu Changjie was even more confused, and couldn’t help but ask, “Who is she?” “Her name is Qiu Hengbo.” Liu Changjie was shocked. “You mean Madam Autumn?” [5] “You’ve heard of her?” “I’m afraid there isn’t a person in Jianghu who doesn’t know who she is.” “However,” said Dragon Fifth coldly, “you definitely didn’t know that she was my wife.” “Was?” “Even though we aren’t husband and wife any more, we are still friends.” “But …” Dragon Fifth’s pale face had turned ashen. “Her hatred for me long ago seeped to the very marrow of her bones. In fact, the reason she married me was because she hated me.” Yet again, Liu Changjie was confused, but he wasn’t willing to ask more questions. When dealing with people like Dragon Fifth, it was generally better not to understand too much about their secrets. Dragon Fifth had closed his mouth, and his eyes as well. He did not seem willing move, let alone say anything further. After some time had passed, he asked, “Have you seen my martial arts?” “No.” “Do you know how powerful they are?” “I don’t.” He closed his eyes again and then slowly stretched out a hand. It was pale white and very delicate. His hand made a slow clawing gesture in the air. Suddenly, miraculously, from within the small red clay oven, a burning hot coal lifted up and flew into his hand. His hand slowly closed over the red-hot coal. Moments later, he spread his hand to reveal nothing but grey ash. “I’m not just showing off my martial arts,” Dragon Fifth said coldly. “I’m illustrating two important points.” Liu Changjie asked no questions. He knew Dragon Fifth would make his point. As expected, he went on. “Even though I have mastered this type of martial art, I still can’t handle this matter myself.” He gazed at the cold ash in his palm. “The feelings we had for each other, are like this dead ash, impossible to rekindle.” ** This was definitely a strange and interesting affair, and the two people involved completely without equal. One was the greatest hero under heaven, the other was the most beautiful and mysterious woman in the world. Even though Liu Changjie didn’t know a lot about the world, he had long ago heard legends of Madam Autumn. There were many legends. And all the stories about her were just like she herself, mysterious and beautiful. All the heroes in Jianghu wanted to lay eyes on her. But no one ever laid eyes on her. Therefore, many people had taken to calling her “Madam Lovesickness,” because of the countless men who pined after her. Who would ever have imagined that “Madam Lovesickness” would turn out to be Dragon Fifth’s wife? And who could fathom the mystery and strangeness of their relationship? She was not only his wife, but also his friend. But why was she his enemy? They were the ideal couple, and one would think they would love each other dearly. How could they ever divorce? There must be a complex and unusual story involved, and Liu Changjie was anxious to hear more. But anyone who knew Dragon Fifth’s method of communication knew that it was like he himself; as with a mystical dragon, if you caught sight of the head, the tail would be nowhere in sight. Suddenly, he switched topics. “It happened a long time ago,” he said indifferently. “Not very many people in the world know about it. In fact, almost no one. You don’t really need to know the details.” Liu Changjie didn’t let his disappointment show. After all, he was very good at controlling himself. “You only need to know one thing,” said Dragon Fifth. Liu Changjie sat listening. “The person I want you to go deal with is her. I need you to go to her, and retrieve an object for me.” “Retrieve?” “If you want to use the word steal,” said Dragon Fifth coolly, “I guess there’s no harm.” Liu Changjie let out a breath. “Well, at the last, I need to know two more things.” “Yes?” “Where am I going? And what am I stealing?” Dragon Fifth answered the second question first. “You will be stealing a box.” He motioned with his hand, and the green-robed man stepped forward. He placed a box onto the table. It was made from gold, and the top was decorated with a delicate Dragon and Phoenix design, inlaid with jasper. “It looks exactly like this,” said Dragon Fifth. Liu Changjie couldn’t hold back. “What’s inside it?” Dragon Fifth hesitated.”You don’t really need to know,” he said, “but I suppose it wouldn’t hurt to tell you. Inside the box is a bottle of medicine.” Liu Changjie was surprised. “That’s it? Just a bottle of medicine?” Dragon Fifth nodded. “Yes. But as far as I’m concerned, that bottle of medicine is more valuable than all the riches in the world.” He gazed sharply at Liu Changjie, and continued, “I’m sure you can tell that I’m sick.” Of course Liu Changjie could tell. But, he also knew that this one sick person, by merely waving a hand, could have most of the healthy people in the world killed if he wished. Seeing the expression on his face, Dragon Fifth laughed. “I know what you’re thinking. There are many sick people in the world, and among them, I am the most frightening. But when all is said and done, sick is still sick.” Liu Changjie hesitated for a moment, then asked, “That one bottle of medicine can cure your illness?” “Do you know the story of Hou Yi and Chang’e?” [6] After shooting the nine suns, Hou Yi visited the Western Paradise and beseeched the Queen of Heaven to give him a bottle containing the elixir of immortality. Unfortunately, the elixir was stolen by Chang’e. Even though Chang’e attained immortality, the price she paid was an eternity of loneliness. “Chang’e regretted stealing the elixir, and only the deep green sea and blue heavens accompanied her in her loneliness.” “Our story,” said Dragon Fifth, “is the same as theirs.” He didn’t say anything more, but Liu Changjie understood. Perhaps Dragon Fifth had some congenital condition, or perhaps he had performed fire deviation when practicing martial arts. In any case, he’d acquired some strange illness, and it tormented him like maggots gnawing on his bones. Then finally, he had acquired some sort of mystical elixir that could cure his sickness, only to have it stolen away by his wife. Therefore, he had sought out someone to help deal with her. And of course, he was also afraid of the information leaking out. Dragon Fifth’s gaze was fixed on a faraway place, and the expression on his face was either pain or loneliness. Could it be that in this story, the lonely one was not Chang’e but Hou Yi? Dragon Fifth gradually said, “I know that after she stole the medicine, she had no regrets, and felt no loneliness. Actualy, she used that bottle to force me to do many things I otherwise would never have done.” The pain and loneliness in his eyes had transformed into a pernicious anger. “I must not hesitate any longer. I must retrieve that bottle of medicine!” Liu Changjie couldn’t hold back any longer. “Where is it?” he asked. “Getting it, taking something so valuable right out of her hands, is not a simple matter.” Liu Changjie knew this already. “She hid the box in a small cave in the Qixia Mountains. Then she found seven expert fighters, fugitives who had fled Jianghu and had no place to go, and hired them to guard the cave.” Liu Changjie suddenly thought of the man who could kill others faster than lightning, “One Hand, Seven Assassins” Du Qi. “Blocking the entrance of the secret room in the cave is an iron gate weighing about 1,000 pounds.” Liu Changjie suddenly thought of the miraculous strength of Shi Zhong. “Inside the secret room is a hidden door, and that is where the box is located. To open the door, you must first pick seven locks. The locks were crafted by the most skilled and famous craftsmen in the world.” Liu Changjie suddenly thought of Gongsun Miao. “The most important thing to remember, though, is that her residence is located very close to the cave. If the slightest alarm is raised, she will be there almost immediately. And once she arrives, no one in the world would be able to take the box away.” Liu Changjie let out a breath. He suddenly understood something very important: Dragon Fifth wasn’t just afraid of Madam Autumn because of the bottle of medicine she held hostage. At least half his fear was because of her martial arts. Her martial ability was clearly no less than that of Dragon Fifth’s. “Luckily,” continued Dragon Fifth, “she has a very ridiculous habit: she sleeps every day from eleven in the morning until one in the afternoon, and before she sleeps she must cover every inch of her body with a special honey oil of her own manufacture.” The hateful expression once again returned to his face. “This practice takes at least one hour every day. During that time, she locks herself in her room. Even if the heavens collapsed, she wouldn’t know.” Liu Changjie finally started to understand why they ended up divorcing. If he had a wife who wife spent an hour every day on such a ridiculous practice, he wouldn’t be able to take it either. Most men in the world probably wouldn’t be able to take this type of custom. Anyone would think that being forced to sleep with a wife covered in honey oil was a frightful thing. Seeing the expression on Liu Changjie’s face, Dragon Fifth said, “It really is a disgusting thing. But that hour is the only chance you will have to make your move.” “So,” said Liu Changjie, “I will have one hour to kill the seven fugitives, lift the iron gate, pick the seven locks, grab the box, and escape at least fifty miles away before she can start pursuing me.” Dragon Fifth nodded. “As I said, this really is a job for three people.” Liu Changjie sighed and laughed bitterly. “And it really does require Du Qi, Shi Zhong and Gongsun Miao, all three of them.” “But you already destroyed them,” replied Dragon Fifth icily. “I won’t be able to find anyone like them ever again.” Liu Changjie understood how he felt. “So I definitely must help you.” “Are you certain you can handle it?” “Not really.” Dragon Fifth’s eyes narrowed. Liu Changjie continued calmly, “It doesn’t matter what I do in my life, I never start out feeling confident.” “But in the end, you always accomplish everything you set out to do.” Liu Changjie laughed. “My lack of confidence is the reason I’m so cautious and careful.” Dragon Fifth laughed. “Good. Very good. I love cautious and careful people.” “Unfortunately, I’m not really sure what to do next.” “Why?” “Because I still don’t know where the cave is.” Dragon Fifth laughed again. Smiling, he waved a hand. The green-robed middle-aged man stepped forward and placed a bank note onto the table. “This is worth fifty-thousand pieces of silver. Take it, and go have some fun for a few days.” Liu Changjie took it immediately. “I only hope that you can spend all fifty-thousand within ten days.” “It won’t be easy to spend it all,” laughed Liu Changjie, “but I can find some women to buy houses for and the rest I can lose gambling.” “Those two plans are practically the same,” said Dragon Fifth with an amused expression. “You should have no problem spending the money. Whoever takes this job, they need to relax a bit before setting out. Otherwise, they might not be able to handle the difficulties later.” “What difficulties?” said Liu Changjie indifferently. “I’m not old and useless like Lan Tianmeng.” Dragon Fifth laughed loudly. The middle-aged man looked at him, shocked. No one had ever seen him laugh so loudly before. But the laughing ended quickly, and once again his face was somber. “After the ten days are up, you won’t have any more chances to sleep with women or drink even a drop of wine.” “I have the feeling that after ten days like this, I won’t be interested in women at all for a while.” “Good. Very good. After the ten days, I’ll send someone to find you and take you to the cave.” He suddenly appeared to be very weary again. He waved a hand and said, “You can go now.” Liu Changjie made to leave. “What did you think of those six women outside?” “They were great.” “If you feel like it, there’s no harm in taking them with you.” “Are all the other women in the world dead or something?” “No.” “If there are still other women in the world, what do I need those six for?” Part 4 Liu Changjie left. As Dragon Fifth watched him go, the sharp expression once again shone in his face. “What do you think of him?” he asked suddenly. The green-robed, middle-aged man with white stockings stood tall and straight next to the door. After a long time, he responded, “He’s a very dangerous person.” He spoke every word very slowly, as if he had carefully deliberated before opening his mouth. “A blade is also very dangerous,” replied Dragon Fifth. The green-robed man nodded. “A blade can be used to kill others, but it can also cut your own hand.” “And if the blade was in your hand?” “I never cut myself.” Dragon Fifth laughed dully. “I like to make use of dangerous people, just as you like to make use of a swift blade.” “I understand.” “I knew you would…” This time when he closed his eyes, he didn’t open them again. It seemed he had fallen asleep. Liu Changjie was long gone from Meng Fei’s residence. ** He didn’t see Meng Fei, and he didn’t see the six women. As he walked along, he didn’t even see the shadow of another person. Meng Fei clearly didn’t really like to see people off, and Liu Changjie didn’t like to be seen off. He walked slowly along the road, looking very calm and relaxed. He looked exactly like a person should who has fifty-thousand pieces of silver to get rid of in ten days of fun. His only problem was, what exactly was he going to do? How could he get rid of all the money? Anyone who had this problem wouldn’t feel annoyed. Actually, everyone likes to think about what they would do if they had this problem. In fact, people who don’t have fifty-thousand pieces of silver love to fantasize about the possibility. Fifty thousand, and a ten crazy days of vacation. Any person who thought of something like this would definitely laugh themselves awake. ** Hangzhou was a bustling city. And inside bustling cities, there naturally existed plenty of gambling and women. And these were two things one could definitely spend a lot of money on. Especially gambling. Liu Changjie first found several of the most expensive women, then got really drunk, and then went gambling. Getting really drunk and then gambling is like hitting your head against a big rock; any winning that happens is extremely strange. But, strange things happen all the time. Liu Changjie unexpectedly won, earning another fifty thousand! At first, he decided to spend the fifty thousand on five women. But the next day, he realized that each of the five women he’d found was more annoying than the next, more ugly than the next, so much so that they weren’t even worth one thousand. A lot of men are like this. Late at night, they get drunk and find a woman who is as beautiful as a goddess. Then, the next morning, they suddenly find that she’s changed. So he fled the brothel as if he was running for his life, and immediately found another. He got drunk, and then decided that he’d definitely found the right place. The women here really were goddesses. But the next morning, he suddenly realized that the women here were even more annoying than the women from the first place, even more ugly, so bad that he couldn’t even look at them. Later, the Madam of the brothel would tell people that from the time she started working at age 12, until the time she became the Madam, she had never encountered a more heartless customer as “that man surnamed Liu.” He really was a fickle person. ** When Liu Changjie left the Heavenly Fragrance Pavilion, it was already afternoon time. He had just spent eighty pieces of silver to order a table full of the restaurant’s entire line of “Eight Treasures” dishes. Then he asked the waiter to place the dishes on the table and look at them. Afterwards, he paid one hundred and twenty silver and left. He didn’t eat one bite, he just glanced at the dishes. After all, it’s said that rich people are often like this; they order dishes and just sit there watching others eat. Thankfully, the previous night he lost a bit, but he still had more than seventy thousand silver left. He suddenly thought to himself that to spend fifty thousand in ten days wasn’t that easy a matter after all. Right now spring was changing into summer, the weather was wonderful, and the sunshine was as fresh as the glance of a virgin. He decided to head out of the city again. Maybe the cool breezes of the city outskirts would help him think of a way to spend the money. He bought two fine horses and a new carriage, then hired a strong young driver. He spent a very little bit of effort along with one thousand five hundred silver. Sometimes money really did help you to save time. Outside the city, he caught sight of the distant, green mountains, their gentle curves just like the breasts of a virgin. He told the driver to bring the carriage to a stop underneath a willow tree. He got out and started to walk along the lakeshore. A light breeze blew along the surface of the lake; the rippling water looked like the navel of a virgin. It seemed that anything beautiful caused him to think of women. He laughed in his heart. He thought to himself, “I really am a womanizer.” As he started to think along these lines, he suddenly caught site of a woman ten times more beautiful than the sunlight, the distant mountains, or the rippling lake. The woman was standing in a small courtyard, feeding chickens, wearing green robes. The front flap of her garment was folded up and full of rice; her plump, soft mouth pursed as she made clucking sounds at the chickens. He had never seen a more exquisite and delicate mouth. It was hot, and her garments were thin, the collar loosened to reveal a delicate white neck. It would cause anyone to think of other parts of her body. And that was not to mention her bare feet, which were adorned only with wooden clogs. “Her clogged feet as white as hoarfrost, no need to wear tabi socks.” [7] Liu Changjie suddenly thought that whoever wrote these two lines of poetry really didn’t understand women. Who would ever use the word “hoarfrost” to describe a woman’s foot? Much better to describe them as milky, like white jade, or as bright as a freshly peeled boiled egg. From within the house suddenly emerged a man. He was older, and his face seemed hateful, especially his eyes, which stared at the woman’s plump, round posterior. He suddenly stepped forward and rubbed her rear end, then tried to pull her into the house. The woman chuckled and shook her head, pointing to the sun in the sky. She clearly was saying that it was too early, there was no reason to be anxious. The man was obviously her husband. Thinking about how the man would drag her into bed once it was dark, Liu Changjie suddenly had an almost uncontrollable urge to strike him square on the nose. Sadly for anyone who would like to see such a scene, Liu Changjie was not such an irrational person. Even if he wanted to strike someone in the face in such a way, he wouldn’t use his fist. He suddenly rushed back to the city, took all the bank notes and exchanged them for silver ingots. Then he returned to the lake. The woman wasn’t feeding the ducks any more. The couple were already sitting at the gate. He was drinking tea, she was mending clothes. Her fingers were long and delicate, if she used them to stroke the body of a man, the feeling would definitely … Liu Changjie couldn’t endure any longer. He knocked on the gate, and without waiting for a response, pushed it open and entered. The man stood up, glaring. “Who are you? What are you doing her?” Liu Changjie laughed. “I’m surnamed Liu, and I came here just to visit you two!” “I don’t know you!” Liu Changjie smiled, and produced one of the silver ingots. “But you know these, don’t you?” Of course, everyone knew what they were. The man’s eyes seemed to glaze over. “That’s silver. A silver ingot.” “How many ingots like this do you have?” The man was speechless. He obviously didn’t have any silver ingots. The woman couldn’t help but walk over to look; her feet couldn’t stop. Things like ingots have an innate attractiveness, and even if they don’t suck people in physically, they can definitely dampen most peoples’ conscience. Liu Changjie laughed. He waved his hand, and the driver immediately produced four large boxes filled with silver ingots, placing them in the courtyard. “This here is worth fifty silver, and these boxes altogether contain one thousand two hundred ingots.” The man’s eyes bulged. The woman’s face was crimson and she breathed raggedly, just like a young woman whose heart raced as she caught site of her first lover. “Do you want these ingots?” The man nodded immediately. “Okay,” said Liu Changjie. “If you want them, I’ll give them to you.” The man’s eyes seemed about to pop out of his head. “You can take two of the boxes and go now,” said Liu Changjie. “Go anywhere you want. The carriage will take you there, as long as you return in seven days.” Smiling, and looking at the woman out of the corner of his eye, he continued, “The other boxes, leave here with your wife. They will all be here for you when you return.” The man’s face turned crimson, and sweat began dripping down his face. He looked back at his wife. She wasn’t looking at him. Her two beautiful eyes were staring at the boxes of silver. The man stuck out his tongue and licked his ruddy lips. He stammered, “You … you … what do you think?” She bit her lip, then suddenly turned her head and ran back into the house. The man made to follow, then stopped. He had already been sucked in by the silver. “You just have to leave for seven days,” said Liu Changjie suddenly. “Seven days aren’t a very long time.” The man grabbed an ingot from one of the boxes and bit it, so hard that his teeth almost broke. Of course the silver was real. “You can come back in seven days, and your wife…” The man didn’t wait for him to finish speaking. Using all the strength he could muster, he dragged a box of silver into the carriage with him. The driver helped him with the other box. Panting, embracing the silver, the man said, “Go! Get out of here quickly! Go anywhere, as far as possible!” Liu Changjie laughed again. As the carriage sped away, he lifted up the remaining two boxes of silver and carried them slowly into the house. He closed the door and bolted it. The door to the inner room was open, the door curtain half raised. The women sat on the bed inside, biting her lip, her face as flush as a peach blossom. Liu Changjie entered smiling. “What are you thinking?” he asked softly. “I’m thinking that you’re really a f*cking bastard. Nobody would think of something like this except a person like you.” Liu Changjie sighed, and laughed bitterly. “I just made a bet with myself. If Hu Yue’er’s first sentence didn’t contain the word ‘f*cking,’ I wouldn’t look at a woman for three months.” [1] Liu Changjie’s home village is “Yang Liu,” the same Yang Liu he used when describing his name, which means “Willow and Poplar trees” and contains the same “Liu” as his surname. [2] Here, sticky rice dumpling refers to zongzi, which are traditionally eaten during Dragonboat Festival, and are wrapped in a bamboo leaf and tied up with string. [3] The Chinese narrative is not very clear about how much time passes at Meng Fei’s during this part, but from information gleaned later, it seems that it was several days. The night it describes here is after that. [4] This part consists of two really cool Chinese phrases. The first is 周瑜打黄盖 zhōuyú dǎ huáng gài, a story from the Three Kingdoms period, where Huang Gai lets himself be beaten by General Zhou Yu, to trick Cao Cao. This is part of the Battle of Red Cliff section of the story. The other phrase is 苦肉计 kǔròujì, which is also part of the title of this chapter. It basically means to hurt yourself to win the confidence of the enemy. [5] The word I\u0027m translating as Autumn actually implies a little more than just Autumn. It\u0027s a word that means \"limpid Autumn water,\" often used to describe a woman\u0027s eyes (according to the dictionary). But that\u0027s a little bit complicated so I\u0027m sticking with Autumn. [6] I’m sure most people familiar with Chinese culture will know something about the story of Hou Yi and Chang’e. Here’s links to wikipedia articles on them in case you’re interested in learning more about the background. http://en.wikipedia.org/wiki/Hou_Yi http://en.wikipedia.org/wiki/Chang_E [7] The word “tabi” is actually Japanese, referring to the type of socks that have a separation between the big toe and the other toes. These type of socks existed in China too, but I’m not sure of any other word for them in English other than the Japanese word. Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/7-killers/7k-chapter-7-1","bookId":1495,"book":{"id":1495,"title":"7 Killers","description":"Dragon Fifth is a powerful lord with incredible martial arts, and yet is wasting away from a fatal disease. The only medicine which can cure his sickness lies in the clutches of his venomous ex-wife, Madam Lovesickness, and is guarded by seven dangerous killers, fugitives of the martial world. Into this treacherous love spat tumbles Liu Changjie, a skilled martial artist who loves drinking and women, but has a mysterious past. All is not what it seems in this wuxia heist story. Can you decipher the mystery before the final reveal? (There are only seven chapters in this novel, but they are very long chapters. In total, the story is of equal length to roughly 20-25 average web novel chapters)","cover":"http://cunovel.com/img/7K.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/7-killers","creation":"Sep 10, 2019 12:39:28 AM","modification":"Sep 25, 2019 12:27:33 AM"}}
