{"id":45315,"no":7,"title":"Chapter 7 Capturing the dragon empty handed","content":"Part 1\n Power of Hu was obviously just a person too.\n But he was a very extraordinary person. In his life, he had accomplished many extraordinary things.\n When he first started to roam Jianghu, people were already calling him “the Fox.”\n Of course, other than his fox-like craftiness, he was also as patient as a camel, as hardworking as a farm ox, as vicious as a bird of prey, as nimble as a pigeon, and as sharp as a sword.\n Sadly, he had already grown old.\n His vision had grown dim, his muscles slack, his reflexes slow. He also had contracted a serious case of rheumatism, and had spent years bed-ridden, to the point where he could no longer even stand up.\n Luckily, his intelligence had not grown dim, and was in fact sharper than ever. His method of handling affairs was also more prudent and careful than ever.\n So down to this day, he still commanded much respect.\n **\n It was an ancient hall, spacious and tall, yet filled with an unspeakable gloominess.\n The tables and chairs were also archaic, the color of the paint fading away. When wind blew into the hall, it carried along dust, which settled onto everything, including guests.\n The wind blew.\n Liu Changjie helped Dragon Fifth brush the dust off of his body, then muttered, “They really should clean this place up.”\n Dragon Fifth looked at him. “You have dust all over yourself, too.”\n Liu Changjie laughed. “I don’t care. Some people are destined to roll around in mud and dust.”\n “And you’re one of those people?”\n Liu Changjie nodded. “But you aren’t. Patriarch Hu isn’t either.”\n “Do you really need to compare me to him?” asked Dragon Fifth coolly.\n “You two are basically the same type of person,” said Liu Changjie. “Inherently superior.”\n Dragon Fifth said nothing.\n The large hall was once again silent. The wind blew the paper windows, which sounded like the falling of leaves.\n Autumn was dying, and soon it would snow.\n “Is the master here?” called out Liu Changjie.\n “Yes.” The doorman was old. “Wait in the hall, I’ll notify him you’re here.”\n The old man had a full head of white hair, and his face was covered with scars. It was safe to assume this man was Power of Hu’s partner, and that they been through hell and high water together.\n As such, he wasn’t very polite. But, Liu Changjie was willing to forgive him, and waited in the main hall. He waited for a very long time.\n And Hu Yue’er?\n She should know that Liu Changjie was here. Why didn’t she appear?\n Liu Changjie didn’t ask. Actually, there was no one to ask even if he wanted to.\n He had been to this place twice, and had only ever seen three people here. Power of Hu, Hu Yue’er, and the old doorman.\n But, if you think you could come and go as you please in this place, you would be wrong, and you would pay dearly.\n And the meaning of “pay dearly” is, you would pay with your life!\n Patriarch Hu’s career had spanned decades, and it was hard to say how many criminals he had apprehended.\n It was even harder to say how many people sought revenge against him. Many of those people had come to this place to try.\n And of the people who had come, not one had ever left alive.\n **\n The moonlight was beginning to fade, and the hall grew gloomier and gloomier.\n Patriarch Hu still hadn’t appeared.\n Dragon Fifth could not help but laugh coldly. “It seems he really is arrogant.”\n “You’re not the only arrogant person in the world,” replied Liu Changjie coolly. “In any case, if I were you, I wouldn’t be anxious to see him.”\n “Isn’t he anxious to see me?”\n “He doesn’t need to be anxious.”\n “Because I’m like a fish in a net?”\n “In his eyes, you’re a poisonous dragon.”\n “Oh?”\n “He is a very cautious person. Without checking everything thoroughly, he would never come to see you.”\n “Check what?”\n “Check to see if the poisoned dragon really has become a fish, and then check to see if the fish is useful.”\n “Check with who?”\n “Who understands you the best? Who knows the most about this whole matter?”\n “Lan Tianmeng?”\n Liu Changjie smiled.\n “He’s here too?” said Dragon Fifth.\n “I think he just arrived.”\n Dragon Fifth was again silent.\n And at that moment could be heard the hoarse, smiling voice of an old man. “My apologies for keeping you waiting so long.”\n Part 2\n In the long, wide hall were several arched doors covered with screens, separating the hall into five areas.\n Liu Changjie and Dragon Fifth were in the first area, and the voice emanated from the last.\n They could see a pale, emaciated old man, wrapped in a fox-fur robe, sitting in a large wheelchair.\n Behind the chair, pushing it forward, was the old doorman, and Lan Tianmeng.\n Suddenly, a clanging sound rang out, and four sets of iron bars fell down, covering the arching doorways, completely cutting off Liu Changjie from Patriarch Hu.\n The bars were as thick as a child’s arm. Even a thousand men and horses together would have a hard time getting past them\n Liu Changjie didn’t care. The first time he was here, he had seen the same thing. The one who cared was Dragon Fifth.\n It wasn’t until this moment that he truly understood how cautious and careful Power of Hu was. There really was no one who could compare.\n Liu Changjie had already stood up, and bowed, smiling.\n “Master, are you well?”\n Power of Hu’s eyes narrowed into lines as he laughed. “I’m very well. You are well. We’re all well.”\n Liu Changjie smiled. “There’s only one person who isn’t well.”\n Power of Hu said, “Heaven’s net is wide meshed, nothing escapes it. The way of Heaven is fair, but the guilty will not escape. [1] I always knew that eventually he would end up like this.” Smiling, he continued, “And I didn’t misjudge you, either. I knew you wouldn’t disappoint me.”\n Liu Changjie glanced at Lan Tianmeng and laughed. “Everything that happened, you already told the master?”\n Lan Tianmeng rubbed the scabs on his face and laughed bitterly. “If you had hit any harder, I’m afraid I wouldn’t have been able to tell him anything.” [2]\n Power of Hu laughed loudly. “As of now, you two can finally call it even. Don’t put these things to heart.”\n He suddenly waved a hand and turned his head. “Remove these things.”\n “These things” were the four sets of iron bars.\n When the scar-faced old doorman hesitated, Power of Hu’s eyebrows furrowed. “Don’t forget, Master Liu is our brother. There should be no obstacles between brothers.”\n “What a good set of brothers,” said Dragon Fifth with a dark smile. “One is a lacky, the other is a fox.”\n Power of Hu’s facial expression didn’t change. With a smile, he said, “Don’t forget, only brothers like us continue to live. People like you will be sent to death without a proper burial, one by one.”\n **\n The iron bars were gone.\n Power of Hu said, “Give the package to Master Liu. And bring the poisonous dragon to me. I want to have a look.”\n The old man immediately brought forth a package wrapped in brocade cloth. Inside the package was a set of green clothing.\n It was the same set of clothing Liu Changjie and Hu Yue’er had worn the night they professed their love for each other. It still smelled like her.\n Power of Hu said, “Before she left, she especially requested to leave these for you.”\n Liu Changjie’s heart skipped a beat. “She … where did she go?”\n A sad expression fell onto Power of Hu’s sallow, hoary face. “A place where everyone goes to.”\n “A place that you can never return from?”\n “The moon has phases of darkness and light,” said Power of Hu. “And people have partings and reunions. [3] You’re still young, you should be able to accept this.”\n Liu Changjie grew stiff.\n Could Hu Yue’er really be dead?\n She was constantly giving him instructions, telling him to be safe and stay alive, how could she be the one to die?\n How could she have died so suddenly, so early?\n Liu Changjie didn’t dare believe it, didn’t want to believe it.\n And yet, he couldn’t deny it.\n Power of Hu sighed again, looked more aged and haggard than before. “From the time she was small she had a foul disease, difficult to treat. She knew that she could pass at any time. She hid the truth from you all this time, and the reason she would never marry you was because she didn’t want to break your heart.”\n Liu Changjie didn’t move, didn’t say anything.\n After all, he was not a passionate and impulsive youth, ready to burst out with emotion. He stood there stupidly, as if he had turned into stone.\n Lan Tianmeng also sighed. “I always tell people not to drink, but right now …” A wine jug appeared in his hands, and he walked forward. “You really should have a drink or two...”\n The wine was already warmed.\n It seemed he had prepared it especially for Liu Changjie.\n For someone whose heart has already been broken, what other comfort in the world is there than drinking?\n But why drink?\n When wine penetrates the restless heart, will it not turn into tears of lovesickness?\n And yet, why not drink?\n The happiness that comes with being drunk is always a good thing.\n Liu Changjie suddenly grabbed the wine jug. Laughing reluctantly, he said, “Have a drink with me.”\n “I don’t drink,” said Lan Tianmeng. He gave a forced laugh. “The blood in my mouth still isn’t dry, I shouldn’t drink even a drop.”\n “Even if you don’t want to drink, you still have to drink.”\n Lan Tianmeng stared, shocked.\n “Even if you don’t want to drink, you still have to drink.” What did this mean? Who would have thought that Liu Changjie had even more shocking plans in mind?\n He suddenly tilted up the wine jug, aiming to pour the wine into Lan Tianmeng’s mouth.\n Lan Tianmeng’s face twisted.\n The scar-faced old man’s face also twisted.\n Only Power of Hu remained expressionless. He waved his hand, and three dots of light shot forth like cold stars, toward Dragon Fifth.\n Dragon Fifth’s acupuncture points had been sealed, and he had just been dragged over by the old man like a dead fish.\n But, as soon as the three dots shot forth, his body flew into the air.\n He looked like a divine dragon soaring in the heavens.\n Power of Hu, normally as cold as deadwood and as solid as a rock, looked shocked.\n There was a tinkling sound, and sparks showered across the room as his hidden weapons weapons embedded themselves into limestone floor.\n And then, there was another tinkling sound. Lan Tianmeng’s fist shot out, not to strike Liu Changjie’s face, but to shatter the jug of wine.\n The wine in the pot splashed out, flying like sparks, splattering all over his face and into his eyes.\n It was as if he had been struck by the most dreadful hidden weapon in the world. He cried out hoarsely and, rubbing his eyes with his hands, charged wildly away.\n Could it be that the wine in the jug was poisoned?\n Liu Changjie had already completed the task assigned by Power of Hu. Why would he order someone to poison him to death?\n And how could the prisoner captured by Liu Changjie, the completely immobilized Dragon Fifth, suddenly fly into the air like a divine dragon?\n Part 3\n There was no wind.\n Outside the window, leaden clouds filled the skies like a huge ink painting. [4]\n The sad and shrill shrieking had ceased.\n As soon as Lan Tianmeng charged forth, he had reached the stone steps leading outside. And then he fell, and his powerful, stalwart body shriveling and drying up.\n As soon as Liu Changjie saw him fall, he turned his head. Dragon Fifth had floated back to the ground.\n Power of Hu sat there, unmoving. His expression had returned to normal, and he was muttering under his breath.\n “Seven steps. He only made it seven steps.”\n Liu Changjie let out a soft sigh. “The poison was very powerful.”\n “I mixed it myself,” said Power of Hu.\n “For me?”\n Power of Hu nodded. “You’re going to be sorry.”\n “Sorry?”\n “The flavor of the wine was very good.” His eyes seemed to carry a look of sorrow. “It was too good for Lan Tianmeng.”\n “Oh.”\n “He was not a good person, his death was also too good.”\n “Death is death…”\n “There are many types of death,” interrupted Power of Hu.\n “And his death, what type was it?”\n “His death was happy.”\n “Because it was quick?”\n Power of Hu nodded “The faster you die, the less pain there is. Only good people deserve this kind of death.”\n He lifted his head and stared at Liu Changjie. A strange smile appeared on his face, and after a while he said, “I always thought you were a good person, so I mixed the poisoned wine especially for you.”\n Liu Changjie laughed. “Hearing this, it seems I should havefer thanks.”\n “You definitely should thank me.”\n “But, you forgot about something.”\n “Oh, what?”\n “You forgot to ask me whether or not I wanted to die.”\n “When I want to kill people,” said Power of Hu coolly, “I never ask whether or not they want to die. I only ask whether or not they deserve to die.”\n Liu Changjie sighed. “It makes sense.”\n “And so, you should be dead now.”\n “But I’m not. Is it because I’m not a good person?”\n Power of Hu laughed. “You definitely aren’t.”\n “If I was a good person, I would never have realized that you wanted to kill me.”\n “How did you figure it out?”\n “I knew from the very beginning.”\n “Oh.”\n “From the very beginning I suspected that the true criminal was not Dragon Fifth, but you.”\n “Oh.”\n “Mainly because all these cases cropped up after you retired. Dragon Fifth isn’t scared of you at all. If he was really the perpetrator, he wouldn’t need to wait for your retirement.”\n “This line of reasoning isn’t enough.”\n “Among these cases, every single one was carried off perfectly. Not one clue was left behind. Only a true expert on crime could be so efficient.”\n “Dragon Fifth isn’t a true expert?”\n “He isn’t.”\n “How can you tell?”\n “Because I am an expert. I can tell.”\n “You were sure about this?”\n “No, so I had to get some evidence.”\n “And so you went after Dragon Fifth.”\n Liu Changjie nodded. “That also made you trust me, and let your guard down. Otherwise I wouldn’t be able to get close to you.” He laughed. “If I didn’t bring Dragon Fifth here with me, would you have called for the bars to be removed?”\n Power of Hu sighed. “I really did misjudge you. You really aren’t a good person.”\n “And I didn’t misjudge you at all.”\n Power of Hu laughed again, but the laughter didn’t reach his eyes.\n “What kind of person am I, then?” he said with a smile. “Can you really tell?”\n “No one can match your caution and intelligence,” said Liu Changjie. “But sadly, you are too ambitious for your own good.”\n Power of Hu sat listening.\n “When you started your crime spree, maybe you intended to stop. But after you started, you couldn’t. You just couldn’t be content with what you had.”\n Power of Hu looked at him, his pupils two tiny dots of ice.\n “And so your crimes grew greater and greater, more and more. You knew that it was dangerous, but you also knew that even though you were retired, they would eventually come to you for help.”\n He seemed to be somewhat caught up with emotion. “Once a person receives a free meal from the government, they will never be able to get the taste out of their mouth.” [5]\n “And so,” said Power of Hu, “I definitely needed to find some to be a scapegoat, and take the blame for all the cases.”\n “Because if you cleared all the cases, then you would be able to get away scot free.”\n Power of Hu smiled. “It seems you really are an expert.”\n “But there was still something I couldn’t figure out. Why did you pick Dragon Fifth?”\n “You couldn’t figure it out?”\n “Anyone else you picked as a scapegoat would have been easier to handle than Dragon Fifth.”\n Power of Hu glanced at Dragon Fifth. He had sat down in the most comfortable seat he could find.\n He seemed very calm and relaxed, as if this matter had nothing to do with him.\n Power of Hu sighed. “I shouldn’t have picked him. He really is too difficult to deal with.”\n “But you had no choice.”\n “Oh? Why?”\n “Because you weren’t the only person to make the decision.”\n “Oh.”\n “You have a partner, a person who had long ago decided that Dragon Fifth needed to die.”\n “When did you figure that out?”\n “When I arrived at Madam Lovesickness’s place.”\n “Don’t tell me my partner is Qiu Hengbo?”\n Liu Changjie nodded. “She shouldn’t have known that I would go after for her. And yet she was prepared all along, waiting for me.”\n “And you suspect that I told her?”\n “The only people who knew about it, other than me, were Dragon Fifth, Qiu Huhua and Hu Yue’er.”\n “And, of course, you wouldn’t tell her.”\n “Neither would Dragon Fifth or Qin Huhua.”\n Power of Hu couldn’t deny this.\n “So I thought about it a lot, and decided that there was only one way for Qiu Hengbo to find out—if you two had been collaborating all along.” He laughed again. “Furthermore, I might not be a good judge of people, but six plus one is seven. Even I could calculate this debt.”\n Power of Hu frowned. He didn’t understand.\n “I already knew that Qiu Hengbo’s secret cave was guarded by seven people. But Hu Yue’er only told me the names of six people. That day at the inn in the Qixia Mountains, I only saw six people.”\n “You saw Tang Qing, Shan Yifei, Soul Enticing Lao Zhao, Iron Monk, Li the Mastiff, and the hermaphrodite?”\n Liu Changjie nodded. “So I thought it was very strange. Where was the other person?”\n “And now you figured it out?”\n “After thinking about it, there’s only one explanation.”\n “Which is?”\n “She never talked about the seventh person, because I know that person.”\n “And who is it?”\n “If it isn’t Wang Nan, then it must be Hu Yue’er.”\n Wang Nan was the man at the farmhouse, pretending to be Hu Yue’er’s greedy husband.\n “I obviously knew that Wang Nan isn’t a real country bumpkin, and he’s also not a real constable.”\n “You knew all about him?”\n “It’s because I didn’t know that I was suspicious.”\n Power of Hu sighed. “You thought things through very thoroughly. Even more thoroughly than me.”\n “There’s also some things you haven’t figured out.”\n “Many things.”\n “Such as?”\n “You didn’t really capture Dragon Fifth?”\n “You yourself said he is not an easy person to deal with.”\n “He didn’t really kill Qin Huhua?”\n “Qin Huhua is his very good friend, in fact, his only true friend. He wouldn’t kill this type of friend.”\n “So everything was just an act, played out for Lan Tianmeng?”\n “I realized early on that you definitely would have an undercover agent next to Dragon Fifth.”\n “So you intentionally allowed Lan Tianmeng to return first and tell me everything he saw.”\n “I beat him up a bit, not to vent my anger, but to get you to trust me.”\n Power of Hu laughed bitterly. “I really never imagined that you and Dragon Fifth would work together to put on such a show.”\n “Now can you imagine it?”\n “After you saw Qiu Hengbo, you never met with him, did you?”\n “No.”\n “Then, how did you plan everything out?”\n Liu Changjie laughed suddenly. “Do you know why I purposely pissed off Kong Lanjun?”\n Power of Hu shook his head.\n “Because I wanted her to take the empty box back.”\n “What secret was in the box?”\n “Nothing special, just a script.”\n “The script to your little act.”\n “I knew Kong Lanjun would take the box back to Dragon Fifth, and that he would look at the script and be willing to play along.” He continued, laughing, “You clearly didn’t misjudge him, and neither did I. However, it seems he is much more intelligent than either of us imagined. His acting was much better than mine.”\n “You forgot one of the roles,” said Dragon Fifth, suddenly.\n “Qin Huhua,” said Liu Changjie with a smile. “He acted very well too.”\n “But he was worried,” replied Dragon Fifth.\n “Worried that my plan wouldn’t work?”\n Dragon Fifth nodded.\n “But you went through with it,” said Liu Changjie.\n “That’s because he was the only one who was worried.”\n “You weren’t worried?”\n Dragon Fifth laughed. “I don’t have very many friends, and there aren’t very many people who I’ve misjudged.”\n “What kind of person do you think Power of Hu is?”\n “His greatest weakness isn’t a greedy heart.”\n “What is it?”\n “An evil heart.”\n “Your perception is more accurate than mine.” He sighed, and turned toward Power of Hu. “If you hadn’t been so eager to kill us, we might still not be sure of your guilt!”\n “You’re sure now?”\n “Without a doubt.”\n “But it seems you’ve forgotten something,” said Power of Hu.\n “What’s that?”\n “The thief used flying skills to enter the Prince’s private compound. I’m a paralyzed cripple.”\n Liu Changjie laughed.\n “You don’t believe me?” asked Power of Hu.\n “If you were me, would you believe?”\n Power of Hu looked at him, looked at Dragon Fifth, and then laughed. “If I were you, I wouldn’t believe.”\n This time when he laughed, the laughter reached his eyes. The laughter in his eyes was like that of a crafty fox, or a poisonous scorpion. He turned his head toward the old man and said, “Do you believe?”\n “I believe.”\n “You believe that my two legs are completely numb?”\n “Yes.”\n “Where are your blades?”\n “Here.”\n The old man’s face was expressionless as he slowly stretched out his hands. He flipped his hands over and two blades appeared. They were not long, but appeared to be extremely sharp.\n With a smile, Power of Hu asked, “Are your blades sharp?”\n “Very sharp.”\n “If sharp blades like yours stab someone’s legs, would it hurt?”\n “It would hurt very much.”\n “And if they stabbed my legs?”\n “It wouldn’t hurt.”\n “Why not?”\n “Because your legs are crippled.”\n “Are you sure?”\n The old man said, “Let’s try.”\n His face was still expressionless. His hands shot forth and the blades flashed, stabbing directly into Power of Hu’s legs. The foot long blades were embedded all the way to the hilt.\n Crimson blood flowed down. Power of Hu continued to smile. “If it’s true, then I have no pain.”\n The old man lowered his head. The wrinkles on his face distorted. He sighed and slowly said, “It’s true. I always believed.”\n Power of Hu lifted his head, smiling, and looked at Liu Changjie and Dragon Fifth. “What about you two? Now do you believe?”\n There was no response. And no need for a response.\n The wind outside blew, bringing with it the faint scent of osmanthus flowers.\n Dragon Fifth sighed lightly. “It seems like it might rain tonight,” he said lightly.\n He stood up slowly and, flicking the dust off his garments, turned his head and left. Liu Changjie watched him go, and sighed. “It will definitely rain tonight,” he murmured.\n He also walked away. When he reached the door, he turned his head and said, “I don’t want to get wet, but I should go.”\n Power of Hu smiled. “I don’t want you to get wet either. You’re not a good person, but you’re not that bad either.”\n “There’s one more thing I want to ask you.”\n “Go ahead.”\n “You have a good reputation, a good position. Many people look up to you, and you have lived a comfortable life.”\n “That’s the result of my years of hard work.”\n “I know.” He sighed. “And it’s because I know that I don’t understand.”\n “What don’t you understand?”\n “You struggled hard all those years to reach this day. You have everything, and you’ve already grown old. Why would you do this thing?”\n Power of Hu was silent for a while. Finally, he said, “At first, I didn’t understand either. Why would a person who grows older become more greedy? It’s not like you can take the money with you to the coffin.”\n “And do you understand now?”\n Power of Hu nodded slowly. “I now realize that the reason old people become greedy is that they see things more clearly, and they realize that nothing in the world is more real than money.”\n “I still don’t understand.”\n Power of Hu laughed. “When you live to be my age, you will understand.”\n Liu Changjie hesitated. He was outside the door now, but he couldn’t help from looking back again. “What about Yu’er?”\n “You want to see her?”\n He nodded. “Whether she is dead or alive, I want to see her again.”\n Power of Hu closed his eyes. “Sadly,” he said, “whether she is dead or alive, you can’t see her.”\n **\n The wind blew in again, bringing with it a fine mist of rain.\n Power of Hu opened his eyes, and looked at the blades embedded in his legs. Suddenly his whole body writhed in pain.\n The rain was cold, very cold.\n “Autumn is deep. It’s only going to get more and more cold,” Power of Hu muttered to himself. Suddenly, he grabbed the blades in his legs and pulled them out.\n __________\n (1) These two lines are quotes from Laozi.\n (2) The word used in Chinese is actually “scar.” But sometimes this word is also used to describe scabs. The narrative isn’t very clear about how much time has passed, but I don’t think it has been long enough for scars to for, so I’m translating it as scab.\n (3) In Chinese it’s pretty clear that he’s offering words of comfort regarding someone who has died. But I think it’s doubly meaningful because her surname is the character for moon.\n (4) The specific kind of painting that is referred to here is this type: http://goo.gl/J1X3uV\n (5) There’s a play on words here that doesn’t translate well. The word for “free meal from the government” would be translated character-by-character as “public door meal.” So the full literal translation is, “once a person eats a public door meal, they will forever imagine going out through that door.”\n \n \n \n \n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/7-killers/7k-chapter-7-6","bookId":1495,"book":{"id":1495,"title":"7 Killers","description":"Dragon Fifth is a powerful lord with incredible martial arts, and yet is wasting away from a fatal disease. The only medicine which can cure his sickness lies in the clutches of his venomous ex-wife, Madam Lovesickness, and is guarded by seven dangerous killers, fugitives of the martial world. Into this treacherous love spat tumbles Liu Changjie, a skilled martial artist who loves drinking and women, but has a mysterious past. All is not what it seems in this wuxia heist story. Can you decipher the mystery before the final reveal? (There are only seven chapters in this novel, but they are very long chapters. In total, the story is of equal length to roughly 20-25 average web novel chapters)\n","cover":"http://cunovel.com/img/7K.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/7-killers","creation":"Sep 10, 2019 12:39:28 AM","modification":"Sep 25, 2019 12:27:33 AM"}}
