{"id":72461,"no":16,"title":"Page 16","content":"“Ah, ah, ah!” Iris wagged her finger. “You just wanted to know if she had a boyfriend, not what his name was.” She patted Emily’s thigh. “All in good time, honey. Now, I believe we have more things on my bucket list to get to, don’t we?”\n Then she yanked the list out of her bag and consulted it. Emily bit down hard on the inside of her lip, trying to swallow her frustration. After all, she had no choice but to play Iris’s game.\n Especially if it led to some answers. And Ali.\n 12\n Kissing and Telling\n On Monday, Aria stood in the Rosewood Day gym. The bleachers had been folded up to make more room on the basketball court, the air smelled like rubber sneakers, and a flickering fluorescent light in the rafters was doing its best to break her concentration. The six girls on the decorations committee, all with smooth, long hair, perfectly toned bodies, and matching Tory Burch flats, stood in a circle around her, awaiting instructions. Aria knew she should be thrilled to be bossing around Typical Rosewoods, but instead she just felt on edge.\n “Um, okay, so the theme is The Starry Night,” Aria said shakily, holding up a big picture of the Van Gogh painting in a library book. Just holding it, pointing at it, made her feel like a marked woman. She was sure all the girls could tell exactly what was hiding in her closet—and exactly what she’d done.\n She coughed and continued. “So, I’m going to hire a company that specializes in papier-mâché sculptures to do some big moons and stars for us—since we have to do this by the end of the week, we need some outside help.” That was the nice thing about Rosewood Day: They had a big budget for decorations. “I’ve also called up a company that custom-dyes table linens and can even make interesting slipcovers for the chairs. But the seven of us should definitely paint at least one of the murals. But, um, I was thinking The Night Café instead. It’s much more romantic, don’t you think?”\n A pert-nosed blond girl named Tara raised her hand. “Um, the theme is The Starry Night for a reason,” she said in a haughty, nasal voice, glancing derisively at Aria’s thigh-high pleather boots.\n The other girls murmured their agreement.\n “Um, I guess you have a point,” Aria mumbled, even though the idea of painting a Starry Night mural made her twitchy. It was like she’d have a big bull’s-eye on her forehead, saying, Hey, cops! Want to know why I know this painting so well? I’ve got the practice version in my closet!\n Off Spencer’s suggestion, she’d moved the painting to the very back of her closet, behind a box of old sweatshirts. Her mom had knocked on the door as Aria was finishing up.\n “Whatcha doing?” Ella had asked, bursting into her room just like she always did.\n “Don’t come in here!” Aria shrieked before she could restrain herself. “I’m cleaning!”\n Ella stopped in the doorway. “Aria Montgomery, cleaning? I thought I’d never see the day.” She tossed something into the room. “This came for you today.”\n It was a letter with Aria’s address on the front, nothing else. For a seizing second, Aria feared A had written to her again, but when she opened it up, it was an invitation to an art apprenticeship in Holland next year. Which would be amazing . . . except Aria would never go so far away from Noel. She threw it into her drawer, then stared at her mom’s disappearing figure down the hall. What a disaster. Not only were her friends guilty by association, but was her mom, too? If the cops came for the painting, what if they didn’t believe Ella didn’t know it was here?\n And how the hell had someone gotten into the house? There had been no sign of forced entry, which meant whoever got in had a key. Byron and Meredith had a spare key. Spencer had a key from the time she’d fed Polo while the family was away. The cleaning lady had a key, too.\n And so did Noel.\n Of course, that didn’t mean Noel was A. Though she could hear the other girls’ voices in her head: Ask Noel where he was the day you found the painting in your closet. It was weird that Noel had been late to the newspaper editing class. Aria had asked where he’d been, too, but he hadn’t given her a straight answer. And what about Tabitha’s necklace, the one that Noel supposedly “found” on the beach in St. Martin? her friends might say next. With a little digging, Noel could have figured out who Graham was—he’d been all over the Tabitha memorial site. Or if he was in touch with Ali, she could have just told him everything, since Ali and Tabitha had been friends!\n Aria shut her eyes. Even the idea that Noel had been friends with “Courtney”—aka Real Ali—made her shiver. There were a lot of things about “Courtney’s” return to Rosewood that she’d tried her hardest to forget, and Noel’s involvement with her was one of them. It did seem like a strange coincidence that they’d been in a support group together, and Noel had really encouraged Aria to give “Courtney” a chance. What if he’d known she was Real Ali all along and was helping her out with her plan?\n “Earth to Aria!” called a snooty voice in the corner. Aria snapped out of her thoughts and blinked. The committee girls snickered.\n She forced a smile, mumbling something about re-creating Van Gogh paintings on big canvases using an overhead projector. The girls shrugged and got to work gathering up supplies and finding copies of the paintings online. Suddenly feeling exhausted, Aria flopped onto a folding chair in the corner and let out a breath. Her palms were shaking. Her head felt faint. She was losing it. Noel absolutely could not be A—he was her boyfriend. He didn’t know Courtney was Real Ali. He wouldn’t do that to her. End of story.\n As if on cue, two strong arms wrapped around her waist. “You’re such a liar,” Noel growled into the spot between her neck and her shoulder.\n Aria stiffened. “W-what?”\n Noel pulled her up and spun her around. “You told me you needed a ride home, but then I saw your car in the student lot . . . and I find you here!” He cuffed her arm and gave the stink-eye to the Van Gogh portrait on Aria’s laptop. “Are you cheating on me with Vincent van Gogh?”\n “What? No!” Aria almost shrieked, her cheeks reddening at the word cheating.\n “I know.” Noel gave Aria a crazy look. “I’m just teasing you.”\n Aria felt her heart slow down. “S-sorry,” she stammered. “I forgot about the decor meeting.”\n “It’s cool.” Noel nuzzled her neck. “I wouldn’t want you to miss this.” Then he touched her hands. “So you are happy about the job, right?”\n Aria’s gaze drifted back to the committee girls, who were now priming the canvases for paint. “Uh-huh,” she murmured, trying to sound sincere.\n Noel cocked his head. “That didn’t sound very convincing.”\n Aria’s head felt muddied. She looked up at Noel, then marched toward the hall. “I need to ask you something.” After a moment, Noel followed her.\n The freshly mopped floors sparkled and smelled like lemon. Outside the floor-to-ceiling windows, Aria swore she saw someone duck behind the journalism barn. She stared out fixedly, her heart in her throat. No one appeared.\n Then she faced Noel, who smelled like cologne and looked adorable in his Rosewood Day Lacrosse hoodie. “You were late to class the day they announced I would be the decor chairwoman.”\n Noel’s expression hardened. “So?”\n Was he acting defensive? Guilty? Aria rubbed out an imaginary spot on the floor with her toe, contemplating how to ask the question. Where were you? was so distrustful; it might make things worse. Instead, she found herself blurting out, “Do you ever think about Ali? Both the Alis?”\n Noel blinked. “What do you mean?”\n “Well, it affected you, too. You were friends with her—with them. Did you ever . . . I don’t know, suspect anything after Courtney and Ali switched places? How about when the real Ali returned to Rosewood after Ian Thomas died?”\n A muscle above Noel’s eye twitched. “I . . .” He trailed off, looking totally flustered. “Why are you asking me these things?”\n Aria swallowed hard and looked across the hall into a chemistry classroom. Someone had stuck a daisy into an empty Bunsen burner. “I’ve just been thinking about Ali and Courtney lately, that’s all. Actually, you and Ali—the real Ali. You know, that time when you kissed at the Valentine’s Day dance.”\n Noel stepped back, his shoes squeaking on the polished floor. “That’s a funny way of saying it. Ali kissed me, remember?”\n Aria pressed her lips together and said nothing.\n Noel made a noise at the back of his throat. “Haven’t we been through this? She, like, pounced on me.”\n Aria picked at her nails. “I know, but you were so nice to her. You kept urging me to give her a chance. You were in her support group. You . . .”\n Noel’s mouth hung open. “Are you asking me if I liked her? If I, I don’t know, knew?”\n Aria stared at him. “Maybe. Yeah.”\n In the background, a bunch of band kids rushed past, giggling and shoving. Noel blinked. He scratched his ear. But he didn’t answer her question. Aria’s whole body felt snappy. It seemed like Noel was trying to figure out how to word something. But if he had a simple, honest answer, wouldn’t he just come out and say it?\n Noel jingled his keys in his pocket. “I don’t know where this is coming from all of a sudden. Or how it relates to being the decor chairperson,” he said finally.\n “Just answer the question,” Aria said. “I need you to tell me you didn’t like her at that time.”\n “I didn’t.” The annoyed look melted from Noel’s face, and he gently took her hands. “I liked you, and I would never cheat on you, not even with Courtney or Ali or whoever that was. I was horrified when she kissed me. And when I found out it was all to manipulate you to go with her to the Poconos . . .” He shut his eyes and grimaced. “It’s too awful to think about.”\n “Okay, okay,” Aria said. But the prickly feeling didn’t go away. It felt like Noel was almost being too melodramatic, like he was acting or something. But was she just thinking that because Spencer and the others had planted suspicions in her mind?\n She broke Noel’s grip and turned toward the door. “I need some air.” Maybe it was rehashing Real Ali’s return, maybe it was the panic she’d felt when she thought Noel was lying, but she felt like she couldn’t breathe.\n Noel had the good sense not to follow her outside. A misty rain was falling, and the strong scent of grass tickled her nostrils. As she climbed the slope, she saw her family’s brown Subaru looming in the distance. Even from down the hill, she could tell there was something caught under the windshield wiper. It looked like a note.\n Aria started to run. She yanked the printout, which had grown soggy from the mist, from under the wiper and stared at it, her fingers trembling. It was another news article. Investigation of Prized Van Gogh Study Painting Reopened. \n","sourceLink":"https://allnovel.net/crushed-pretty-little-liars-13/page-16.html","bookId":2389,"book":{"id":2389,"title":"Crushed (Pretty Little Liars #13)","description":"Storyline: \n Crushed (Pretty Little Liars #13) \n In the thirteenth Pretty Little Liars novel, the secrets are more crushing than ever... \n It\u0027s springtime in Rosewood, but while everyone else is searching for the perfect prom dress, Hanna, Spencer, Emily, and Aria are on a different kind of hunt: They\u0027re looking for A... \n Hanna puts her campaign for prom queen on the back burner to volunteer at a burn clinic, where one of A\u0027s victims is recovering. Emily digs into Ali\u0027s past at the mental hospital with some very crazy consequences. Spencer contacts an amateur private eye to help her stalk her stalker. But when their sessions get a little too private, they may forget to keep their eyes on A. And Aria\u0027s worried that A is even closer than she thought. When her dark secret from Iceland comes to light, she discovers that maybe, just maybe, the one person she\u0027s been trying to hide the truth from has known all along. \n The liars are finally taking the fight to A. But no matter what they do, A\u0027s always one step ahead, ready to crush the girls completely.\n \n","cover":"https://allnovel.net/images/crushed-pretty-little-liars-13.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/crushed-pretty-little-liars-13.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:23:45 AM"}}
