{"id":72447,"no":2,"title":"Page 2","content":"“He didn’t know my last name,” Aria said, placing the towel over the radiator and walking into the hall again. “Maybe I’ll be okay. But whatever you do, please don’t tell . . .”\\n\\n She trailed off, glancing behind her. Noel stood at the bottom of the stairs by the back door, dressed in a hoodie and jeans, though they weren’t the same hoodie and jeans he’d worn earlier that night. His forehead was slick with sweat like it always was after drinking, but there was a knowing look on his face that made Aria’s insides seize. What had he just heard?\\n\\n “There you are.” Noel climbed up the stairs and patted Aria’s wet head. “You take a shower?”\\n\\n “Uh, yeah.” Aria crossed her legs to hide the gash on her knee. “Where were you?”\\n\\n Noel gestured down the stairs. “Smoking a joint.”\\n\\n Aria considered making a snarky comment, but she refrained—who was she to judge? She grabbed Noel’s hand instead. “Come on. Let’s go to bed.”\\n\\n Her eyes were wide open as they climbed under the covers. Noel shifted next to her, his bare legs prickly against hers. “So where were you?” There was bitterness in his voice. “At the bar with Gayloff?”\\n\\n Aria turned away, the guilt oozing out of her pores as pungently as the schnapps oozed from Noel’s. She bristled, anticipating a fight. But then Noel put his arms around her and pulled her close.\\n\\n “Let’s call a truce. This trip has been weird. I’ve been weird. And I’m sorry.”\\n\\n Aria’s eyes welled with tears. That was exactly what she needed to hear . . . about five hours too late. She wrapped her arms around Noel and squeezed tight. “I’m sorry, too.” She’d never meant something so much.\\n\\n “Nothing to be sorry about,” Noel said sleepily. “I love you, A . . .”\\n\\n He mumbled into his pillow as he drifted off to sleep. For a split second, Aria thought she’d heard him say something else. Something strange. But then again, Noel was drunk. Even if he had said what she thought he had, he certainly didn’t mean it. It wasn’t like Aria would bring it up to him tomorrow, either.\\n\\n She never wanted to mention this night again.\\n\\n The next morning, Hanna, Aria, Noel, and Mike checked out of the guesthouse and departed for the airport. They went through the security line and stocked up on snacks and trashy magazines for the long plane ride home. If Aria seemed jittery, Noel didn’t question it. When Noel complained about the puny airport not having a McDonald’s, Aria didn’t snap at him. When Hanna and Aria spoke even less than usual, neither Mike nor Noel remarked. I’m just tired, they planned to say if anyone questioned them. It’s been a long trip. I miss my bed.\\n\\n The plane had satellite TV, and Aria flipped to CNN International after boarding. Suddenly, there it was: a shot of the chateau. It was even more ramshackle and haunted-looking than she remembered. Break-in at Brennan Manor, read the headline.\\n\\n A video showed the shadowy, closed-up, spiderwebbed rooms. Then there was a blurry insurance photo of Starry Night . . . and a police sketch of Olaf. “This is the thief who got away with the painting, as described to the police by a witness who lived down the road,” said the reporter. “Authorities are on the hunt for him now.”\\n\\n Aria’s mouth hung open. Olaf made it out?\\n\\n Hanna stared at the TV screen in horror. The situation had changed. Valuable art had been stolen, and Aria had helped facilitate that. Hanna thought of the art-theft cases her father had worked on when he practiced law: Even people who knew about the crime were guilty. Now she was one of those people.\\n\\n Aria touched Hanna’s forearm, sensing what she was thinking. “Olaf was smart, Han. He won’t get caught . . . meaning he’ll never say I was with him. The police will never be able to connect me to the crime. No one will ever know that you know, either. Just don’t tell anyone else, okay? Not even Emily and Spencer.”\\n\\n Hanna turned away and stared at the runway, trying to lose herself. Maybe Aria was right. Maybe this Olaf guy, whoever he was, could evade the police. That was the only way Aria’s secret would remain safe. That was the only way Hanna would remain safe, too.\\n\\n And, mercifully, they were safe, for almost a year. The story surfaced in the news from time to time, but there weren’t many details, and the reporters never mentioned an accomplice. One time, Hanna watched a report with Spencer and Emily in the room, the secret like hot lava inside her. But she didn’t say anything. She couldn’t betray Aria’s trust. Aria didn’t dare tell them, either—the less those girls knew, the better.\\n\\n After a while, what happened didn’t haunt Aria as much anymore. Olaf had disappeared into oblivion, and he’d taken the painting with him. Things had improved between her and Noel, too, that Iceland trip a distant memory. She was safe. No one knew.\\n\\n Wishful thinking. Someone did know—and that person was keeping this secret very, very quiet until the time was right. And now, at the end of the girls’ senior year, that very same someone decided to make it public.\\n\\n The third—and scariest—A.\\n\\n 1\\n\\n Watch Your Back\\n\\n On a sunny Monday morning, Spencer Hastings walked into her kitchen and was greeted by the smell of coffee and steamed milk. Her mother; her mother’s fiancé, Nicholas Pennythistle; his daughter, Amelia; and Spencer’s sister, Melissa, were sitting around the farmhouse table watching the news. A coifed man was giving a follow-up report on an explosion that had occurred on a cruise ship off the coast of Bermuda one week before.\\n\\n “Authorities are still looking into the cause of the explosion that forced all passengers on the cruise ship to evacuate,” he said. “New evidence suggests that the blast originated in the boiler room. A video surveillance tape that was recovered shows two grainy figures. It’s unclear whether the individuals in the video caused the explosion or if it was a freak accident.”\\n\\n Mrs. Hastings set down the coffee carafe. “I can’t believe they still don’t know what happened.”\\n\\n Melissa, who was in Rosewood visiting friends, glanced at Spencer. “Of all the cruises, it would be yours to have a crazy Unabomber on board.”\\n\\n “I’m glad I wasn’t on that boat.” Amelia, who was two years younger than Spencer and had wild curly hair, a pug nose, and a penchant for sweater sets and Mary Janes—even after the makeover Spencer had given her in New York City—snorted haughtily. “Were you guys on a suicide mission? Is that why you went rogue and sailed to that cove instead of to shore?”\\n\\n Spencer padded toward the toaster, ignoring her. But Amelia kept talking. “That’s what everyone’s saying, you know—you and your three friends have cracked. Maybe you need to live in Dad’s panic room twenty-four-seven, huh?”\\n\\n Mr. Pennythistle gave Amelia a stern look. “That’s enough.”\\n\\n Mrs. Hastings set a cup of coffee down in front of her fiancé. “You have a panic room, Nicholas?” she asked, seemingly eager to change the subject. She hadn’t exactly learned how to discipline Amelia yet.\\n\\n Mr. Pennythistle laced his fingers together. “At the model home in Crestview Estates. I built it after those mob guys moved into some of the surrounding neighborhoods—you never know. And besides, a certain kind of buyer might like that sort of thing. Of course, I doubt Spencer could attend Princeton from there. There’s no Internet access.”\\n\\n Spencer started to chuckle, but then stopped. Mr. Pennythistle probably wasn’t making a joke—he was a brilliant land developer, a real estate mogul, and a pretty good cook, but he definitely wasn’t a comedian. Still, she didn’t mind him—he made a wicked gumbo every Saturday, played her favorite sports radio station in the kitchen when he was cooking, and even let Spencer drive his pimped-out Range Rover now and then. If only his daughter were bearable.\\n\\n Spencer slipped two slices of rye bread into the slots of the toaster. Amelia had a point, of course—trouble was following her everywhere. Maybe she should go to a panic room for a while. Not only had Spencer been on the Splendor of the Seas, but one of her best friends, Aria Montgomery, had also been in the boiler room when the explosion occurred. Equally disconcerting, Aria had come into possession of a locket on that cruise that belonged to Tabitha Clark, a girl they’d accidentally hurt in Jamaica last year. At the time, they’d thought Tabitha was the real Alison DiLaurentis, the evil twin who’d stalked and nearly killed Spencer and the others at the DiLaurentises’ Poconos vacation home in an explosive fire. They’d thought Ali was back for revenge, so Aria had pushed the girl off a roof to get rid of her for good.\\n\\n But then the news came out that Tabitha wasn’t Real Ali—she was an innocent girl. That was when the nightmare began.\\n\\n Tabitha’s necklace connected them to the night Tabitha was killed—the girls were sure that their diabolical stalker, New A, had planted it on Aria to frame her. They knew they couldn’t just throw away the necklace on the ship—A would find it and get it back to them. So instead of evacuating to the shore after the explosion, Spencer, Aria, and their friends Emily Fields and Hanna Marin stole a motorized life raft and sailed to a cove Spencer had heard about in her scuba diving class. They buried the locket somewhere A would never look, but then their raft was punctured—surely A’s plan, too. A rescue crew arrived in the nick of time.\\n\\n After that mess, they decided to come clean about what they’d done to Tabitha—it was the only way to get A off their backs. They’d met at Aria’s house to make the call to the authorities, but as they were on hold with the chief investigator on the case, a news flash came on TV. Tabitha Clark’s autopsy report was in—she’d been killed by blunt-force trauma to the head, not from a fall off the roof. That didn’t make sense, though; none of the girls had hit her. Meaning . . . they didn’t do it.\\n\\n Seconds later, they received a message from A. You got me, bitches—I did it. And guess what? You’re next.\\n\\n A charred smell roused Spencer from her thoughts. Smoke was pouring out of the toaster. “Shit,” she whispered, hitting the lever to pop the toast up. When she turned around, everyone at the table was staring. There was a wisp of a smirk on Amelia’s face. Melissa looked worried.\\n\\n “You okay?” Mrs. Hastings asked.\\n\\n “I’m fine,” Spencer said quickly, dropping the hot pieces of bread into the oversized marble sink. Yes, it was a huge relief that they hadn’t killed Tabitha, but A still had a ton of dirt on them, including pictures of them on the roof deck that night. A could say the girls had gone down to the beach when they discovered that Tabitha hadn’t died and finished her off. And A’s confessional text wouldn’t hold up in court—I did it could mean anything.\\n\\n And what about You’re next? Who was A? Who could want to kill them so badly? The same day they were going to confess, Emily had told the girls that she’d left the door open for Real Ali at the Poconos house, allowing her to possibly escape the blast. So she could be alive . . . and she could be A. It made the most sense: Real Ali was the only person that crazy. \\n\\n","sourceLink":"https://allnovel.net/crushed-pretty-little-liars-13/page-2.html","bookId":2389,"book":{"id":2389,"title":"Crushed (Pretty Little Liars #13)","description":"Storyline: Crushed (Pretty Little Liars #13) \\n In the thirteenth Pretty Little Liars novel, the secrets are more crushing than ever... \\n It\u0027s springtime in Rosewood, but while everyone else is searching for the perfect prom dress, Hanna, Spencer, Emily, and Aria are on a different kind of hunt: They\u0027re looking for A... \\n Hanna puts her campaign for prom queen on the back burner to volunteer at a burn clinic, where one of A\u0027s victims is recovering. Emily digs into Ali\u0027s past at the mental hospital with some very crazy consequences. Spencer contacts an amateur private eye to help her stalk her stalker. But when their sessions get a little too private, they may forget to keep their eyes on A. And Aria\u0027s worried that A is even closer than she thought. When her dark secret from Iceland comes to light, she discovers that maybe, just maybe, the one person she\u0027s been trying to hide the truth from has known all along. \\n The liars are finally taking the fight to A. But no matter what they do, A\u0027s always one step ahead, ready to crush the girls completely.\\n","cover":"https://allnovel.net/images/crushed-pretty-little-liars-13.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/crushed-pretty-little-liars-13.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:23:45 AM"}}
