{"id":72450,"no":5,"title":"Page 5","content":"Emily fiddled with a studded leather bracelet on a display tray. “So when do you think I’ll hear from Carolyn?” Mrs. Fields refolded a T-shirt she’d been looking at, carefully avoiding Emily’s gaze. “I’m sure she’ll call you soon.” “Does she really want to apologize?” Mrs. Fields’s eyelid twitched. “We should concentrate on you and me, don’t you think? I’m so happy that we’re out together. I hope we can do this more often.” Emily cocked her head. “So . . . that means Carolyn is still really mad?” Mrs. Fields’s cell phone blared, and she made a big production of rooting through her bag to find it. “I need to take this,” she said briskly, even though Emily was pretty sure it was only her dad . . . or maybe Carolyn herself. Emily leaned against a rack of jackets and sighed. Okay, so things weren’t perfect yet. Mrs. Fields had told her that Carolyn wanted to let bygones be bygones, but Emily had seen no indication of that yet. Nor had she and her family had a conversation about Emily’s pregnancy or the baby. But these things took time, right? Banana pancakes were still a huge gesture. As her mom slipped through the front door, Emily pulled out her own phone and checked her e-mail. There was one new message from the Rosewood Day May Day Senior Prom Committee: Don’t forget to buy a ticket for the Senior Prom! May 7, 7 PM. The Four Seasons Hotel, 1 Logan Square, Philadelphia. Dinner and dancing. A lonely feeling swept through her. She’d already bought a ticket for prom; her friends were making her go. But the only person Emily wanted to invite—a girl named Jordan Richards she’d met on the cruise—couldn’t come. Thankfully, there were no new alerts about Tabitha. Emily’s finger bumped the button to her photo gallery, and suddenly, a picture of Alison DiLaurentis stared back. It was the real Alison DiLaurentis, the girl who’d come back to Rosewood last year and later revealed herself as A. Emily had snapped the photo of Ali in her bedroom the day Ali had kissed her. It’s me, Em, Emily could practically hear Ali saying. I’m back. I’ve wanted to do that again for so long. I’ve missed you so much. Emily had continued to love Ali despite everything. Even after Ali had confessed that she’d killed her own sister, Emily held out hope that she’d come to her senses and atone for what she’d done. Her love for Ali had been so intense that she’d left the door open for her in the Poconos instead of barricading it shut and letting the girls’ would-be killer burn. She’d kept the secret for a while, but she finally told her friends last week. Now, they were starting to believe what Emily knew all along: Real Ali wasn’t dead, and she was their New A. That meant that Real Ali had witnessed all of the girls’ transgressions last summer, including Emily smuggling her baby out of the hospital and away from Gayle Riggs, a woman she’d thought was crazy—and a woman who was now dead. Ali might have been in Jamaica, too, and she might be Tabitha’s real killer. It also meant Real Ali had been on the cruise ship last week. How had they not seen her? How had no one seen her? Emily’s thumb hovered over DELETE. After A had threatened her baby’s life, she’d finally come to hate Real Ali. And yet she couldn’t quite bring herself to get rid of the one photo she had of her. Sighing, Emily scrolled to the end of her photo gallery and looked at a picture of another girl she was pretty sure she loved. Jordan grinned into the camera. Her body was backlit by the blazing Puerto Rican sun, and blue water stretched behind her for miles. Emily touched the screen, wishing she could feel Jordan’s soft cheek one more time. “She’s hot.” The shaved-head salesgirl glanced over Emily’s shoulder at Jordan’s photo. “That your girlfriend?” Emily smiled bashfully. “Kind of.” One corner of the girl’s lip curled into a smile. “What’s that mean?” Emily slipped the phone into her pocket. It means she’s a fugitive. It means she jumped off a cruise ship in Bermuda to avoid the FBI, and I have no idea where she is now or when I’ll see her again. She wandered toward the shoe section, which smelled heavily of leather and rubber. She would never forget those last few minutes she and Jordan were together. In Jordan’s past life, she’d been Katherine DeLong, the Preppy Thief, the girl who stole boats, cars, and planes. When Emily met her, she’d just escaped from prison and changed her name, and was ready for a new start. The FBI agents, probably alerted by Real Ali/New A, chased both of them to the ship’s railing. Jordan had given Emily one last look, then dived into the bay to escape. When Emily returned home, she’d received a postcard from Jordan. We’ll see each other again. Emily was dying to write back, but Jordan wasn’t stupid enough to include a return address. Wherever she was—Thailand, Brazil, some teeny island off the coast of Spain—she was hopefully hiding well enough to evade the cops. Emily ran her fingers over the smooth leather of a display pair of Doc Martens, getting an idea. She pulled out her phone again, opened the Twitter app, and logged into her account. Then she copy-pasted the prom invite into a new tweet. PROM IS IN TWO WEEKS, she typed. WISH I COULD TAKE MY TRUE LOVE. She hit TWEET, feeling satisfied. Hopefully Jordan would see it and understand what it meant. And even though Jordan probably wouldn’t reply, at least she’d know Emily was thinking about her. When her phone buzzed a second later, her spirits soared—Jordan already! But the e-mail was from someone named Special Agent Jasmine Fuji. NEED TO SPEAK WITH YOU ABOUT TABITHA CLARK. Emily’s vision narrowed. The growling voices in the song pumping through the store’s speakers suddenly sounded like vicious dogs. Pressing herself into a back corner, she opened the e-mail. Dear Miss Fields, it read. I’m a special agent in charge of the Tabitha Clark murder investigation. Your name was on a list of guests at The Cliffs resort in Negril, Jamaica, at the same time Miss Clark was there. Procedure dictates that I interview everyone to get a better picture of what happened that night. Please contact me at your earliest convenience. Sincerely, Special Agent Jasmine Fuji. “Emily?” Her mother was staring at her, her faux-croc purse tucked under her arm. “Are you okay?” Emily licked her dry lips. There was no way she could talk to a cop. Jasmine Fuji would know instantly she was lying. Mrs. Fields took her arm. “You’re so pale. Let’s get some air.” The street smelled of car exhaust and stale beer from the dive bar next door. Emily took heaving breaths, trying to tell herself this wasn’t a big deal. But it was. She couldn’t lie to a federal agent. Beep. Dizzily, she glanced at her phone again. As if on cue, a text message from an anonymous sender had come in. Emily gasped as she read the note. Wait until I tell Agent Fuji that you and your GF are perfect for each other—you’re both cold-blooded criminals. —A 4 No One Knows What Aria Did Last Summer “Go, Noel, go!” Aria Montgomery screamed from the sidelines of the lacrosse field the following afternoon at lunchtime. Her boyfriend, Noel Kahn, dashed across the grass and tried for his fifth goal in a row. Aria held her breath as the ball sailed into the net. “Yes!” she screamed, slapping hands with Hanna. The lacrosse team was raising money for the local homeless shelter, and people had placed donation bets on which player could get the most balls past the goalie in under a minute. Naturally, Aria had ten bucks on Noel. Once the minute was up—Noel was in second place after Jim Freed—Noel trotted over to her. “You were amazing!” Aria squealed, wrapping her arms around him. “Thanks, babe.” Noel kissed her long and hard, making the backs of Aria’s legs tingle. Even though they’d been dating for over a year, Aria’s stomach still flipped when she smelled his slightly lemony, slightly sweaty post-workout scent. Hanna, who had just greeted her own lacrosse-playing boyfriend, Aria’s brother, Mike, nudged Noel. “I can’t believe you’ve turned Aria into a lacrosse groupie. I didn’t think it was possible.” Noel took a mock bow. “It was hard work, but totally worth it.” “Aw, thanks.” Aria pulled her cardigan tighter around her shoulders. It was chilly for late April, and the gray sky threatened rain. Hanna was right: If someone had told her at the beginning of her junior year that she’d be watching the lacrosse charity event during lunch instead of, say, working on a sculpture, she would have laughed her head off. And if that person had said she would be dating Noel Kahn, she would have fallen off her chair. Aria had crushed on Noel big-time when she and Ali were friends in middle school, but after Noel liked Ali instead, she’d sworn off him. Then, when she returned from her family’s three-year sabbatical in Iceland, she was no longer the kind of girl who dated preppy lacrosse players. Or so she’d thought. The coach blew the whistle. Noel scooped up his stick, gave Aria another kiss, and trotted with Mike toward the middle of the field to be with their team. Aria’s heart swelled as she stared at his strong, straight back and taut calves. When the girls had been about to confess to the police about killing Tabitha, all she could think of was never seeing Noel again—never kissing him, holding his hand, even lying on the couch and listening to him loudly chew pretzels. Although they hadn’t confessed, she still felt like she was on borrowed time with him. After the boys were a safe distance away, Aria cleared her throat. “So I got a weird message yesterday.” She showed Hanna the screen on her phone. Your name was on a list of guests at The Cliffs during Tabitha Clark’s murder. . . . We need to speak as soon as possible. . . . I appreciate your cooperation. Hanna nodded. “I got this, too. So did Spencer and Emily—and Mike,” she said. “Did Noel?” The boys had been on the Jamaica vacation with them. Aria stiffened, glancing at Noel in his lacrosse pads and cleats. He’d just jumped on Mason Byers’s back, and Mason was swinging around, trying to get him off. “Um, I haven’t asked him,” she said in a low voice. “Noel didn’t see us talking to Tabitha, though. And he and Mike definitely didn’t see . . . you know. It’s not like they’ll say anything weird.” As soon as the words came out of her mouth, she wasn’t sure if she believed them. On the trip, Noel had paid no mind to Tabitha except to say that she seemed somehow familiar. Then, when Tabitha’s body had washed ashore and it was all over the news, Noel often changed the channel, half the time not even registering that they’d been in Jamaica the same time she had. Only recently had he begun to perk up at the story. Now, every time her picture appeared on TV, he squinted at it curiously, saying, “Doesn’t she remind you of someone?” What if he’d noticed how jumpy Aria was whenever a Tabitha story came on? What if he innocently mentioned that Tabitha reminded him of Ali? There were all sorts of inadvertent, unintentional ways Noel could incriminate her.","sourceLink":"https://allnovel.net/crushed-pretty-little-liars-13/page-5.html","bookId":2389,"book":{"id":2389,"title":"Crushed (Pretty Little Liars #13)","description":"Storyline: Crushed (Pretty Little Liars #13) In the thirteenth Pretty Little Liars novel, the secrets are more crushing than ever... It\u0027s springtime in Rosewood, but while everyone else is searching for the perfect prom dress, Hanna, Spencer, Emily, and Aria are on a different kind of hunt: They\u0027re looking for A... Hanna puts her campaign for prom queen on the back burner to volunteer at a burn clinic, where one of A\u0027s victims is recovering. Emily digs into Ali\u0027s past at the mental hospital with some very crazy consequences. Spencer contacts an amateur private eye to help her stalk her stalker. But when their sessions get a little too private, they may forget to keep their eyes on A. And Aria\u0027s worried that A is even closer than she thought. When her dark secret from Iceland comes to light, she discovers that maybe, just maybe, the one person she\u0027s been trying to hide the truth from has known all along. The liars are finally taking the fight to A. But no matter what they do, A\u0027s always one step ahead, ready to crush the girls completely.","cover":"https://allnovel.net/images/crushed-pretty-little-liars-13.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/crushed-pretty-little-liars-13.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:23:45 AM"}}
