{"id":70173,"no":27,"title":"Page 27","content":"\\n\\n Regardless, it was hot as sin watching her enchant Brock—a man who was not easily enchanted.\\n\\n An hour later, Cam was on his third shot and Domini and Brock had quit drinking entirely.\\n\\n But they hadn’t stopped the sexy banter, arguing the pros and cons of mail-order brides. “Not speaking the same language would be a huge bonus,” Brock pointed out. “Then she couldn’t nag me.”\\n\\n “You, Brock Tennyson, are trying to get under my skin.”\\n\\n “No, sweetheart, I’m trying to get into your pants.” He waggled his eyebrows suggestively. “Is it working?”\\n\\n She laughed—a little nervously—but she didn’t say no.\\n\\n “I’m gonna take your silence as a yes. Hot damn!” Brock grabbed her hand, acting like he was dragging her away.\\n\\n “Stop. I know you were kidding.” Domini sent Cam a questioning look. “Right?”\\n\\n Tension hung in the air.\\n\\n “You’re a big girl, Domini. Do what you want.”\\n\\n “But…” She looked torn. “Don’t…aren’t you supposed to…”\\n\\n Scream no, you’re mine! Yes. Cam tossed off a cool, “Give you permission?”\\n\\n She nodded warily.\\n\\n Brock sucked in a breath. “Shit, Cam. She said you two had one date and I thought… Why didn’t you tell me it was that way between you two?”\\n\\n Domini spun on Brock. “What way?”\\n\\n “Cam’s way.”\\n\\n “How do you know—”\\n\\n “Because I’ve known him a long time, Domini, and I know what he prefers.”\\n\\n Cam flashed Domini a wolfish smile. “Surprised?”\\n\\n She shook her head before addressing Brock. “And you aren’t like Cam?”\\n\\n “No.” Brock slurped from a water bottle. “I like to watch. Damn, do I like to watch. Sometimes I join in. When control freak here lets me.”\\n\\n Cam caught the flare of interest in Domini’s eyes.\\n\\n Whoa. That reaction was unexpected. But then again, Cam hadn’t delved much into finding out Domini’s sexual fantasies because he’d been fulfilling his role as her dominant lover and that’d been enough for him.\\n\\n But was it enough for her?\\n\\n Right then Cam knew he’d have to decide how far he was willing to let them take this flirtation. He and Brock had shared women in the past. It’d been no big deal.\\n\\n But now it was different. Could he orchestrate a sexual situation between his best friend and the woman he’d fallen in love with? Or would he want to rip the hands off the man who’d saved his life just because he’d put them on her?\\n\\n Did Domini think she could handle a threesome?\\n\\n Too fucking bad. No way in hell was Brock touching her, no matter what she thought she wanted. No. Way.\\n\\n What kind of lover would you be if you didn’t see to her sexual needs? Even if they were in direct conflict with yours?\\n\\n Fuck that. She’s mine.\\n\\n Is she? Does she know that?\\n\\n No.\\n\\n Dammit. If he snarled and showed jealousy, not only would Domini realize he’d developed serious feelings for her, but so would Brock.\\n\\n What better way to prove his control over her than to command her to satisfy another man? And bonus: it’d prove to Brock that Cam McKay might’ve lost his leg, but he hadn’t lost his edge. He still owned the ability to bend a woman to his sexual whims.\\n\\n Decision made, Cam casually asked, “Domini. Have you ever been with two men at once?”\\n\\n “Umm. No.”\\n\\n “Does the thought of two men fucking you at the same time turn you on?” When her response was a long time coming, he said, “Answer me.”\\n\\n Domini didn’t look away. “Yes.”\\n\\n “If I were to demand you blow me while Brock watches, you’d do it.”\\n\\n Not a question, yet she nodded anyway.\\n\\n “Then come here.”\\n\\n She sauntered over, her head held high, her white-blonde hair flowing around her angelic face, her arctic eyes bright, her mouth curved in a small smile.\\n\\n Cam curled his hand around her neck and centered her body between his legs. He brought his mouth down on hers hard, taking the brutal kiss he craved. When he’d thoroughly flustered her with his possessive kiss, he slid his lips to her ear. “If you don’t want to do this, princess, say so now.”\\n\\n Her voice was so subdued he strained to hear it. “I gave myself to you without restriction. Whatever you want, you can have.”\\n\\n “Good answer, baby. And you can show me. Now.”\\n\\n He walked to the fireplace in the living room, expecting Domini to follow. From the corner of his eye, he saw Brock flop on the couch. The move looked lazy. Bored. Cam knew it was anything but.\\n\\n As Domini approached him, he unbuttoned his shirt. She didn’t lower her eyes or keep her hands clasped behind her back. The subservient posture and attitude crap didn’t appeal to either of them, thank God. But she did not balk at letting him have complete control.\\n\\n She said, “You didn’t wear a T-shirt.”\\n\\n Cam smiled. “See? I listen to you.”\\n\\n “I’m glad.” Her fingers trailed over the sprinkling of chest hair. Her palms smoothed his pecs, his ribs, and his belly. She angled her head to lap at the hollow of his throat.\\n\\n A tremor threatened to break free from that sexy innocent lick.\\n\\n Domini’s delicate butterfly touches were a stunning contrast to the hard nips and deep sucking kisses she used on his nipples.\\n\\n “Enough. Unbutton my pants.” The khakis were loose enough once she’d released the snap, they pooled around his ankles. “On your knees.” She looked up at him and Cam couldn’t resist brushing the hair from her face. “Your hands can be on my hips or my ass. Choose.”\\n\\n She peeled the boxers down and didn’t spend significant time gawking at his prosthesis, but neither did she ignore it. She mouthed the length of his shaft, teasing it with hot breath and firm nibbles. Then she sucked it into the wetness and heat that never failed to make his breath catch.\\n\\n Cam braced his right hand on the oak mantel and gathered her hair in his left hand, keeping a clear shot for Brock. He knew how hot the visual looked—Domini’s bobbing head as his cock pumped in and out of her hungry mouth.\\n\\n But the visual wasn’t nearly as hot as the reality of her sucking him off.\\n\\n “Baby, your mouth is pure heaven. You know how I like it.”\\n\\n Domini kept him wet, she kept him deep, and she kept sucking until Cam felt his balls lift.\\n\\n He shoved his cock until her lips were stretched around the base. He tightened his hold on her hair, but not hard enough to sting her scalp. “Suck it all down, every fuckin’ drop. Swallow. More, baby, don’t choke. Breathe. That’s it.”\\n\\n Hot pulse after hot pulse shot out the end of his dick, and she sucked in tandem to every pulsation, leaving him depleted. Sated. Dizzy. He would’ve staggered and probably crashed to the ground if not for the hold Domini maintained on his hips.\\n\\n The supreme glow of satisfaction she wore whenever she’d pleased him was heady stuff and it humbled him. He murmured, “Thank you.”\\n\\n Wordlessly, Domini nuzzled his left thigh, then his right.\\n\\n “Are you ready?”\\n\\n She peered up at him. “Ready for what?”\\n\\n “For me and Brock to fuck you.”\\n\\n Chapter Thirteen\\n\\n Being with two men? At the same time?\\n\\n A million thoughts spun crazily in Domini’s head.\\n\\n First: yes! I want this. Followed quickly by: no! I can’t do this.\\n\\n What about after the fun and sexual games ended? Would she be hot and happy in the moment but feel used when it was over? Could she look Brock in the eye without embarrassment? What about Cam? How would he react after his friend fucked her?\\n\\n Even as Domini considered the repercussions, she knew she’d do it. Not for Cam, not for Brock, for her own curiosity.\\n\\n Cam helped her to her feet. “Tell me what you’re thinking.”\\n\\n “I’m nervous.”\\n\\n “Because you’ve never—”\\n\\n “—done anything remotely close to this.”\\n\\n His deep chuckle vibrated throughout her body. “Brock and I have. Trust us.”\\n\\n She said, “Okay,” in a breathless rush.\\n\\n Cam placed his mouth on her ear. “Remember something. I decide what I’ll let him to do you. Not you. Definitely not him.” After a lingering kiss, Cam said, “Take your shirt and bra off.”\\n\\n Domini stripped and hated the burning in her cheeks.\\n\\n “Brock, grab a towel and the vegetable oil from the kitchen. Get the captain’s chair out of the dining room and bring it in here.”\\n\\n Brock grinned and returned promptly, setting the chair by the end of the couch and the other items on the side table.\\n\\n Cam lowered into the seat and motioned to Domini. He zigzagged his rough-skinned finger from her left hipbone to her right and her belly trembled beneath his sure touch. He clamped his hands on her waist and turned her sideways.\\n\\n Brock sauntered forward. Naked. When had he gotten naked? His left hand pumped his cock, his gaze fixed firmly on her face. “I’d like to taste your pretty mouth, lick those full pink lips before I see them wrapped around my dick, but since that’s not the way Cam plays…can I touch them?”\\n\\n Domini opened her mouth to respond, only to have Cam answer for her. “Just her lips, nothin’ else.”\\n\\n Cam’s possessive answer sent a shiver through her.\\n\\n Brock’s right hand came up. He outlined her lips with a languid sweep of his thumb. He brushed it just far enough inside her mouth that the wet rim of her lip dampened the pad. He hissed when she darted her tongue and licked it.\\n\\n “Ever had a black man, baby?”\\n\\n “No.”\\n\\n “You know what they say…”\\n\\n Brock laughed and ignored Cam’s warning growl as his hand followed the line of her throat to her shoulder. He gently pushed until she fell to her knees.\\n\\n Then that black cock was in her face. It wasn’t as long as Cam’s, which meant she’d have an easier time deep throating him. But the cockhead was plumper. The shaft was thicker. Brock’s skin tone was beautiful, a rich dark brown. His shortly trimmed pubic hair was pure black. She had just latched onto his hips when Cam’s voice broke through the sounds of Brock’s heavy breathing. \\n\\n","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-27.html","bookId":2687,"book":{"id":2687,"title":"Shoulda Been a Cowboy (Rough Riders #7)","description":"Storyline: Shoulda Been a Cowboy (Rough Riders #7) \\n The bigger they are, the harder they fall--in love. \\n Soldier Cameron McKay has found his niche, and it ain\u0027t ropin\u0027 steers and wearin\u0027 spurs. His deputy sheriff job, plus battle injuries that ended his military career, keep him right where he wants to be: Off the ranch and away from his family\u0027s pity. His darkest war memories are on lockdown, leaving him skeptical he\u0027ll ever find a woman who wants a man who\u0027s less than whole. \\n Domini Katzinski has had to control every aspect of her life since age eleven, when she was orphaned in the Ukraine. Watching others\u0027 relationships crumble has convinced her to focus on the short-term and find a take-charge man to whom she can relinquish total sexual control. Cam fits the bill: gorgeous, with a brooding vulnerability no one else seems to see. Plus, he has his own handcuffs. \\n Once Cam gets over his surprise that sweet, shy Domini wants to be dominated, he is back to issuing orders. Their passion is as hot as a rocket-propelled grenade--and if Domini has her way, it\u0027s a one-shot deal. Cam wants more, and launches a full-out sensual assault...until tragedy strikes, forcing him to change tactics as he tries to keep past demons from blowing their future together all to hell...\\n","cover":"https://allnovel.net/images/shoulda-been-a-cowboy-rough-riders-7.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:15:10 AM"}}
