{"id":70182,"no":36,"title":"Page 36","content":"“Practically zero,” Ginger answered. “Fine. Domini and I will get married. Today.” “What? Cam. No. What are you doing?” Domini was flustered and pale and about to start hyperventilating. Cam aimed a cool look at her and faced Ginger. “Could you give us a minute alone please?” Ginger didn’t bat an eye at his request. “Certainly.” As soon as Ginger was gone, Domini blurted, “Cam, what are you doing?” Cam said, “Do you want Anton? Yes or no?” “Yes! But I don’t want him temporarily. I want him permanently.” “I know. You can have him if you marry me.” She gaped at him. “Us? Married? But…I thought we’d break things off now that everything in my life has changed.” Don’t bite her head off for thinking so lowly of you. “Domini. I’m not the kind of man who bails when things get tough. You should know that.” “But married? Us? Really?” “Do you have a better solution?” “Umm. No.” Was that hope or panic glazing her eyes? “You’d do that for me, Cam?” I’d do anything for you. “Look, I know you’ve sworn to never get married. Neither of us envisioned this kind of scenario. So this solution makes perfect sense for a situation that was thrust on you. If you marry me, you get to keep Anton.” “Would this be temporary?” Fuck no. It’s for good, it’s for real, it’s forever and ever amen. “Is the thought of marrying me, even for a little while, so awful?” he asked softly. Domini shook her head. “Then marry me.” She stared at him, a million questions in her eyes. “Will anyone know the real reason we’re getting married?” “No. We’ll keep it strictly between us.” “Why are you doing this?” Because I love you. Because you’ll think I’m being selfless. Because by giving you the one thing you want so badly, Anton, I get the only thing I want: you. “Cam?” He cleared the emotion from his throat and told a bald-faced lie. “Because it’s the right thing to do.” Domini didn’t smile. She didn’t fling herself into his arms. She didn’t happily shriek the word…yes. Sweat broke out under his collar. Cam figured the lie was about to bite him in the ass. If he confessed the truth, shouting his love for her to the rafters, would that sway her to say yes? Or scare her into saying no? “So what’s your answer, princess?” “Yes, I’ll marry you.” Cam could’ve floated out of the room. When Ginger returned, Cam announced, “We’re getting married as soon as possible.” “Congratulations!” Ginger beamed at both of them. “However, the courthouse is closed today.” “Tomorrow then,” Cam insisted. Domini’s face went pasty white. “After I receive confirmation of the marriage, I’ll file a rebuttal with the Department of Social Services, requesting Anton DeMarco immediately be placed in the foster care of Cameron and Domini McKay.” Ginger grinned again. “I do so love a happy ending.” Cam wondered if Ginger’s happiness stemmed from figuring out a way to buck the legal system. Lawyers got off on shit like that all the time. “Stick around Wyoming the next couple of weeks until we’re through the preliminary foster care assignment process. Then you can jet off for a romantic honeymoon.” “Understood. Thanks.” Cam helped Domini to her feet. She seemed to be having a hard time functioning. Not Cam. Cam felt like doing a jig. Domini wobbled to Cam’s truck on jelly-like legs. Domini and I will get married. Today. She’d almost passed out hearing Cam’s matter-of-fact tone. Like it was no big deal. Like it was already a done deal. By this time tomorrow Cam McKay would be her husband. Unreal. She sagged against the front bumper of his truck, twisting the necklace chain around her finger. As soon as they’d walked out the door, Cam’s cell phone rang with police business and he instructed her to wait for him. So, they’d had no chance to discuss this bizarre development. What was she supposed to say to him anyway? Ask him why he was suddenly willing to take on the responsibility of a wife and a child? A child he didn’t know? It made zero sense. Why was he volunteering to turn his life upside down? Cam loved his privacy. He loved living by himself to the point his own family was rarely welcomed into his sanctuary. Why would Cam offer to open his home and his life not only her, but to a rambunctious boy with emotional scars? Sex. Pure and simple. It might’ve been different if Cam had confessed his undying love for her. But he hadn’t. He’d merely resigned himself to doing the right thing. When Domini asked him if the marriage was temporary, he’d hedged. So maybe Cam wasn’t treating this as a lifetime vow. Maybe the spectacular sex was enough incentive to keep up the appearance of a real marriage for a while. But once she started the adoption process, his “do the right thing” mission would be successful and he’d be free to move on. If that was the case, then there was no reason to tell Cam anything about her medical issues because it wouldn’t matter. She’d be his wife for as long as it took her to adopt Anton. Now that made perfect sense. She’d consider this a business arrangement. She’d keep her finances separate. Keep her job. Keep everything simple. Domini just had to keep herself from falling in love with him. A Cam-sized shadow fell over her. “Sorry about that. I traded with Sayzers to get the next two days off.” He touched her face and offered a dazzling smile. “The ceremony is one o’clock tomorrow afternoon.” Ask him why he’s doing this. Force him to give you a real reason. But Domini couldn’t get her tongue unstuck from the roof of her mouth. “Talk to me, princess. The look on your face is scaring the holy hell outta me.” “I-I can’t…” White specks wavered in front of her eyes. She couldn’t suck enough air into her lungs. Blood whooshed in her ears. Her heart threatened to beat out of her chest. Oh God. Please, not now. “Domini? Baby, what’s wrong?” “I can’t breathe.” She flapped her hand in front of her face as if that would help. “Shit.” Cam hauled her to her feet. He put his palms over her ears and tipped her head to look directly into her eyes. “Breathe with me. Nice and slow, okay?” Below her line of vision, she could see his chest expand as he inhaled. She followed his lead. In. Out. In. Out. “Good. Three more. Come on, you’re doin’ great.” Finally, she felt calmer, but she was still embarrassed. She focused on the placket of his uniform shirt and tried to blink the tears back. “Sorry.” “Don’t apologize.” Cam kept stroking the side of her face. “Should I be worried you had a panic attack at the thought of marrying me?” Domini’s gaze flew to his. “No! It’s not you! It’s me. This happens when I’m stressed and I can’t remember ever being more stressed in my life. I want Anton, but what do I know about raising him? Babysitting isn’t the same as living with him every day for the next eleven years. What if I’m not the best choice? And then you offer to marry me, which you’ve got to admit—” “Hey now. Relax.” His hands tightened on her scalp. “No reason to get worked up again. Breathe.” She concentrated on breathing slowly. “Does this happen often, princess?” “Not as much as it used to.” Her eyes searched his. “I’m not exactly a prize, Cam. I have issues and baggage and…damage that I don’t know if I’ll ever get over.” “I have plenty of my own issues, most of which you’ve already seen and dealt with, so I think that makes us pretty evenly matched.” He wiped a tear from the corner of her eye. “So are you feeling calmer now?” “No! I am getting married tomorrow! I don’t have a wedding dress. My best friend is dead and I don’t have anyone else to talk to. I don’t have a clue if I’m supposed to pack everything tonight. Are we moving in with you right away? Do you want me to tell Anton we’re getting married, or should we do it together? And who all is coming to the wedding? What about the other legal stuff? We hardly discussed that with Ginger—” Cam placed his finger over her mouth, stopping her tirade. “You can really work up a head of steam, can’t you?” He traced her lips with the pad of his thumb. “One thing at a time. You and Anton will be living with me as soon as we exchange I do’s. You can tell him the happy news because I’ll be wrapping up a few things at my place tonight to get ready for you to move in. “As far as the ceremony? You and me are the only ones who matter. We’ll need witnesses and I’d like Colt to stand up for me. I can talk to Keely and see if she’ll help you figure out some of the girly stuff since she’s been through a dozen weddings.” “But—” “Ah-ah. I ain’t done. Now, what haven’t we addressed as far as legal issues?” “I think we should have a prenuptial agreement.” Cam’s eyes narrowed dangerously. “Why?” “Because I don’t want your money if this doesn’t work out. I will want sole custody of Anton and I won’t expect you to pay child support for him. And Skylar mentioned legal issues Jessie’s dealing with, as far as Luke’s stake in the McKay Ranch—” “Forget it. None of that shit matters. We’ll figure it out as we go along.” Cam leaned in so they were nose to nose. “You are changing your name.”","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-36.html","bookId":2687,"book":{"id":2687,"title":"Shoulda Been a Cowboy (Rough Riders #7)","description":"Storyline: Shoulda Been a Cowboy (Rough Riders #7) The bigger they are, the harder they fall--in love. Soldier Cameron McKay has found his niche, and it ain\u0027t ropin\u0027 steers and wearin\u0027 spurs. His deputy sheriff job, plus battle injuries that ended his military career, keep him right where he wants to be: Off the ranch and away from his family\u0027s pity. His darkest war memories are on lockdown, leaving him skeptical he\u0027ll ever find a woman who wants a man who\u0027s less than whole. Domini Katzinski has had to control every aspect of her life since age eleven, when she was orphaned in the Ukraine. Watching others\u0027 relationships crumble has convinced her to focus on the short-term and find a take-charge man to whom she can relinquish total sexual control. Cam fits the bill: gorgeous, with a brooding vulnerability no one else seems to see. Plus, he has his own handcuffs. Once Cam gets over his surprise that sweet, shy Domini wants to be dominated, he is back to issuing orders. Their passion is as hot as a rocket-propelled grenade--and if Domini has her way, it\u0027s a one-shot deal. Cam wants more, and launches a full-out sensual assault...until tragedy strikes, forcing him to change tactics as he tries to keep past demons from blowing their future together all to hell...","cover":"https://allnovel.net/images/shoulda-been-a-cowboy-rough-riders-7.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:15:10 AM"}}
