{"id":70191,"no":45,"title":"Page 45","content":"\n “Fuck!” He hissed against the sudden pain. “Fuck fuck fuck! Motherfucking piece of shit!”\n The sliding glass door opened. Footsteps vibrated the wooden deck as Anton raced toward him. “Holy crap. Are you okay?”\n No. Fuck no. Cam couldn’t put pressure on his stump even if it hadn’t detached from the prosthesis. “Can you run into my bedroom and get my crutches?”\n “Um. Sure. Where are they?”\n “By the nightstand.”\n He ran back inside.\n Less than a minute later Cam heard the clatter of metal and opened his eyes. Anton held out the crutches. “Here.”\n “Thanks.” Cam struggled upright. With the aid of the crutches he made it into the house without falling on his ass.\n Anton stayed behind him. Watchful. Sometimes the kid was so much like Domini he was surprised Anton hadn’t sprung from her womb.\n His stump hadn’t detached, but it’d been wrenched hard enough Cam knew in order to wear the prosthetic at work tomorrow, he couldn’t wear it for the rest of the night.\n So much for hiding in his room. He couldn’t leave Anton unattended.\n “Cam?”\n He glanced over his shoulder and realized he was blocking the doorway. “Sorry.” He hopped sideways. “Can you get by now?”\n “Yeah. Do you need any more help?”\n “Nope. I’ve got it,” he replied briskly.\n Anton’s smile slipped. “Oh. So what’re you gonna do now?”\n “Go to my room, get changed and take this off. Why? Did you need something?”\n Anton shrugged. “I need help with my homework.”\n “They’re giving you homework in second grade?”\n “Spelling. You just have to read the words and I write ’em down.”\n “I can probably handle that. Get your stuff out and set up at the breakfast bar. I’ll be right back.”\n Cam ditched his uniform and slipped on an old army PT shirt and a pair of sweatpants altered into shorts. They hung low enough that the fabric covered his stump completely. He stared at himself in the bathroom mirror. Why was he afraid of the stares and questions of a seven-year-old boy?\n Talk about ridiculous.\n Still, he was uncomfortable shuffling into the kitchen.\n Anton’s head lifted. He automatically focused on the empty space below Cam’s left thigh. Then when he realized he’d been staring, his cheeks reddened and he quickly turned back to his notebook.\n Cam took the barstool to the left of Anton. He propped his crutches on the support beam that framed the breakfast bar area and leaned across the countertop. “So? Whatcha got?”\n Paper rattled and Anton slid a sheet in front of him. “Read me those words on the left.”\n “Starting with imagine?”\n “Yep.” Anton waited, pencil poised above the wide-ruled lines, car-shaped eraser at the ready.\n “The first word is: delight.”\n He frowned. “That’s not the first word. The first word is imagine.”\n “I like mixing things up. Keeping you on your toes. Making sure you can spell them out of order.”\n “Domini doesn’t do it that way.”\n “I’m not Domini.”\n It didn’t take long and they were through the list.\n “The last word is: antidisestablishmentarianism.”\n Anton’s blue eyes bugged out. “What? That’s not on the list.”\n Cam grinned. “I’m kidding. When I was in school that was the longest word in the dictionary. I’m sure there’s something worse than that these days. I just wanted to see if you were paying attention.”\n “I bet I could spell it.”\n “I bet you could too. The last word is resist.”\n Anton smiled when Cam checked his paper and he’d gotten all the words right.\n “You are a great speller.”\n He blushed and ducked his head.\n Cam knew nothing about Anton’s school activities besides when the bus let him off. That was pretty sad actually.\n So change it.\n “I’ll bet you’re good at math, too?”\n “Yep.”\n “I never was worth a crap in math.”\n “Any more homework?”\n “Nah.” Anton’s legs swung beneath the barstool.\n Silence filled the air except for the hum of the dishwasher.\n Man. He sucked at this.\n You’re never going to get better if you don’t try. Start simple.\n Cam sighed. “You wanna watch TV with me or something?”\n “Sure.”\n When Anton plopped down on Cam’s left side, close enough their hips touched, Cam didn’t mind the invasion of his space as much as he’d thought.\n Chapter Twenty-Two\n Week Eight…\n The queasy feeling wouldn’t let up.\n Domini ate crackers, drank soda water, but every time she stood up too fast, she got dizzy.\n “Domini, sweetie, you okay?” Neva asked.\n “Just a little lightheaded. I’m sure it’ll pass. I haven’t been getting much sleep.”\n Neva smiled in her sweet, grandmotherly way. “Child, with all that you’ve been through in the last two months…not to mention being a newlywed…I don’t imagine letting you rest is on the top of the deputy’s agenda.”\n How true that was. Cam was insatiable. He was fabulous. And Domini was so crazy in love with her husband it wasn’t funny.\n She patted Domini’s hand. “If you need anything, you let me know, okay?”\n “Thanks, Neva.”\n Domini noticed a spatula underneath the prep station and bent to pick it up. When she stood, spots danced in front of her eyes, her hearing muffled, and then everything went black.\n A lifetime later she heard, “Domini? Can you hear me?”\n She was cold. Her head hurt. And why couldn’t she open her eyes? “Yes.”\n “Stop pissing around with this, Dave, and call the ambulance.”\n That brought Domini out of her stupor. “No. I’m fine, you can’t—”\n “Easy.” Gentle hands pushed her shoulders down. “We’ll get you taken care of.”\n “What happened?”\n “You passed out, that’s what happened,” Beatrice snapped. “Dammit, you went down like a sack of potatoes.”\n “I don’t remember.”\n “Which is why we need to call the ambulance, because something ain’t right with you.”\n Domini opened her eyes. “You can’t do that. Cam is on duty and all ambulance calls go through dispatch first. He’d hear it and freak out.”\n “Honey, he is your husband. He should freak out. He should be there when you talk to the doctor.”\n “No. He’s got—” no idea I’ve been keeping something really big from him, “—too much going on today to hold my hand when I’m perfectly fine.”\n Bea wouldn’t let up. “I don’t know what your deal is, Domini, but you’re not perfectly fine. I’ll agree not to call an ambulance, if you let Neva drive you to the hospital. Right now.”\n Dave and Neva murmured their agreement with Bea’s assessment.\n “No hospital.”\n “The doctor then. I’ll call Doc Monroe. I know she’ll get you in right away.”\n Damn. Doc Monroe was the last person Domini wanted to see, but it appeared she’d have no choice. “Okay. Call her.” She looked at the concerned faces hovering above her. “But no one calls Cam, got it? I will talk to him after I’ve seen Doctor Monroe. There’s no reason to make him worry.”\n “Neva. Get your car and bring it around back.”\n Neva disappeared. Bea left to make the call, leaving Domini with Dave. She attempted a smile. “Help me up?”\n Dave extended a hand and Domini slowly rose to her feet.\n “See? I’m fine.”\n He just shook his head. “No. You’re stubborn.”\n At the doctor’s office, Domini convinced Neva to return to Dewey’s to help with the lunch rush. But Neva walked her into the clinic, making sure Domini didn’t skip out on her appointment.\n She filled out the medical forms, intentionally leaving some sections blank. Although medical records were supposed to be confidential, in a town the size of Sundance, Domini wasn’t taking chances.\n A young nurse called out, “Domini McKay?”\n Domini followed the nurse back through the maze of exam rooms and ran straight into…Keely. She couldn’t go anywhere in this town without running into a member of Cam’s family.\n Keely’s blue eyes narrowed. “You look like a ghost. What’s wrong with you?”\n “What are you doing here?”\n “Doc Monroe and I are working on a project together and I’m wrapping a few things up. Where’s Cam?”\n “At work. What project?”\n “Nice try, sis, with the bait and switch, but you didn’t answer my question. What’s wrong with you?”\n “Maybe she didn’t answer because that’s none of your business,” the nurse retorted. “This way, Mrs. McKay.” She led her into an exam room in the farthest corner and shut the door in Keely’s face. The nurse gave her a tight smile. “I’ll get rid of her, don’t worry.”\n “Thank you.”\n The nurse weighed her, took her blood pressure and her temperature. Then she drew a vial of blood. She gestured to the gown on the exam table. “You’ll need to get undressed completely. Put the gown on with the opening in the front. The doctor will be in shortly.”\n Domini perched on the exam table. Before too long her eyes began to droop and she laid back. The last thing she remembered was the crinkly sound of the paper beneath her bare butt as she tried to get comfortable.\n Two sharp raps on the door startled her awake.\n Doctor Monroe strode in and smiled. “I’d ask how you are, but the fact you’re here is pretty much my answer.” She sat on the rolling stool and flipped through the papers on the clipboard. “Why don’t you tell me what’s going on?” \n","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-45.html","bookId":2687,"book":{"id":2687,"title":"Shoulda Been a Cowboy (Rough Riders #7)","description":"Storyline: \n Shoulda Been a Cowboy (Rough Riders #7) \n The bigger they are, the harder they fall--in love. \n Soldier Cameron McKay has found his niche, and it ain\u0027t ropin\u0027 steers and wearin\u0027 spurs. His deputy sheriff job, plus battle injuries that ended his military career, keep him right where he wants to be: Off the ranch and away from his family\u0027s pity. His darkest war memories are on lockdown, leaving him skeptical he\u0027ll ever find a woman who wants a man who\u0027s less than whole. \n Domini Katzinski has had to control every aspect of her life since age eleven, when she was orphaned in the Ukraine. Watching others\u0027 relationships crumble has convinced her to focus on the short-term and find a take-charge man to whom she can relinquish total sexual control. Cam fits the bill: gorgeous, with a brooding vulnerability no one else seems to see. Plus, he has his own handcuffs. \n Once Cam gets over his surprise that sweet, shy Domini wants to be dominated, he is back to issuing orders. Their passion is as hot as a rocket-propelled grenade--and if Domini has her way, it\u0027s a one-shot deal. Cam wants more, and launches a full-out sensual assault...until tragedy strikes, forcing him to change tactics as he tries to keep past demons from blowing their future together all to hell...\n \n","cover":"https://allnovel.net/images/shoulda-been-a-cowboy-rough-riders-7.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:15:10 AM"}}
