{"id":832,"no":29,"title":"Chapter 15 Fanny\u0027s revenge","content":"That afternoon Joseph Poorgrass was bringing Fanny\u0027s coffin back from Casterbridge. Feeling a little frightened of the dead body behind him in the cart，and de-pressed by the autumn fog，he stopped for some beer at a pub，where he met Jan Coggan and Laban Tall. There Gabriel Oak found the three men，completely drunk，two hours later. As Joseph was clearly incapable of driving the cart，Gabriel drove it to Weatherbury himself. On the way into the village，the vicar stopped him. \\n\\n \\n\\n ‘I\u0027m afraid it\u0027s too late now for the burial，’he said，‘but I can arrange for the body to be buried tomorrow. ’ \\n\\n \\n\\n ‘I could take the coffin to the church for the night，sir，’offered Gabriel，hoping to prevent Bathsheba from seeing it. \\n\\n \\n\\n But just then Bathsheba herself appeared. ‘No，Gabriel，’she said. ‘Poor Fanny must rest in her old home for her last night. Bring the coffin into the house. ’ \\n\\n \\n\\n The coffin was carried into a small sitting-room and Gabriel was left alone with it. In spite of all his care，the worst had happened，and Bathsheba was about to make a terrible discovery. But suddenly he had an idea. He looked at the words written simply on the coffin lid—Fanny Robin and child. With a cloth Gabriel carefully removed the last two words. Quietly he left the room. \\n\\n \\n\\n Bathsheba was in a strange mood. She felt lonely and miser-able，but she had not stopped loving her husband，in spite of her anxiety about his past. She was waiting for him to come home，when Liddy knocked and entered. \\n\\n \\n\\n ‘Ma\u0027am，Maryann has just heard something…’she hesitated a little. ‘Not about you or us，ma\u0027am. About Fanny. There\u0027s a story in Weatherbury that…’Liddy whis-pered in her mistress\u0027s ear. \\n\\n \\n\\n Bathsheba trembled from head to foot. \\n\\n \\n\\n ‘I don\u0027t believe it！’she cried. ‘There\u0027s only one name on the coffin lid！But I suppose it could be true. ’ \\n\\n \\n\\n She said no more，and Liddy went quietly out of the room. Bathsheba felt almost sure she knew the truth about Fanny and Troy，but she wanted to be certain. She entered the sitting-room where the coffin lay. Holding her hot hands to her fore-head she cried，‘Tell me your secret，Fanny！I hope it isn\u0027t true there are two of you！If I could only look. at you，I\u0027d know！’ \\n\\n \\n\\n After a pause，she added slowly，‘And I will. ’ \\n\\n \\n\\n A few moments later，she stood beside the uncovered coffin. Staring in，she said，‘It was best to know the worst，and I know it now！’Her tears fell fast beside the dead pair in the coffin，tears for Fanny and for herself. Although Bathsheba，not Fanny，had married Troy，in death Fanny was the winner. She was taking her revenge now on Bathsheba for the difficulties she had experienced in her life. \\n\\n \\n\\n Bathsheba forgot the passing of time as she looked at Fanny\u0027s cold white face and yellow hair，and did not realize Troy had arrived home. He threw open the door and came in. He did not guess who was in the coffin. \\n\\n \\n\\n ‘What\u0027s the matter？Who\u0027s dead？’he asked. \\n\\n \\n\\n Bathsheba tried to push past him. ‘Let me out！’she cried. \\n\\n \\n\\n ‘No，stay，I insist！’He held her arm and together they looked into the coffin. \\n\\n \\n\\n Troy stood completely still when he saw the mother and ba-by. Little by little his shoulders bent forward，and his face showed deep sadness. Bathsheba was watching his expression closely，and she had never been more miserable. Slowly Troy knelt to give Fanny Robin a gentle kiss. \\n\\n \\n\\n Bathsheba threw her arms round his neck，crying wildly from the depths of her heart，‘Don\u0027t，don\u0027t kiss them！Oh Frank，no！I love you better than she did！Kiss me too，Frank！You will kiss me too，Frank！’ \\n\\n \\n\\n Troy looked puzzled for a moment，not expecting this child-like cry from his proud wife. But then he pushed her away. \\n\\n \\n\\n ‘I will not kiss you！’he said. \\n\\n \\n\\n ‘Can you give me a reason？’asked Bathsheba，fighting to control herself. Perhaps it was unfortunate that she asked. \\n\\n \\n\\n ‘I\u0027ve been a bad，black-hearted man，but this woman，dead as she is，is more to me than you ever were，or are，or can be. I would have married her，if I\u0027d never seen your beau-tiful face！And I wish I had married her！’He turned to Fanny. ‘But never mind，darling，’he said，‘in the sight of God you are my wife！’ \\n\\n \\n\\n At these words a long，low cry of despair and anger came from Bathsheba\u0027s lips. ‘If she\u0027s—that，what—am I？’ \\n\\n \\n\\n ‘You are nothing to me，nothing，’said Troy heartlessly. ‘A ceremony in front of a vicar doesn\u0027t make a marriage. I don\u0027t consider myself your husband. ’ \\n\\n \\n\\n Bathsheba wanted only to get away from him and his words. She ran straight out of the house. She stayed out all night，wrapped in a cloak，waiting for the coffin to be taken for burial. As soon as the men had taken it away the next morning，she re-entered the house，very cautiously to avoid Troy，but her husband had gone out very early and did not return. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/1015/30565.html","bookId":29,"book":{"id":29,"title":"远离尘嚣 Far from the madding crowd","description":"简介： 《远离尘嚣（Far from the madding crowd）》发表于一八七四年，是哈代第一部成功的长篇，也是他此后一系列以威塞克斯乡村为背景的优秀长篇小说的第一部。这些小说包括《还乡记》（1878）、《卡斯特桥市长》（1886）、《德伯家的苔丝》（1891）以及《无名的裘德》（1896...","cover":"http://novel.tingroom.com/file/upload/201404/21/10-06-12-99-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/1015","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
