{"id":810,"no":7,"title":"Chapter 4 Fanny Robin disappears","content":"The farm manager had advised Gabriel to go straight to the malthouse in Weatherbury，to ask for somewhere to stay. That was the place where the men of the village spent their evenings，drinking beer and talking by the fire. When Gabriel entered the warm，dark room，some of Bathsheba\u0027s workers recognized him. \\n\\n \\n\\n ‘Come in，shepherd，you\u0027re welcome，’said one. \\n\\n \\n\\n ‘Gabriel Oak is my name，neighbours. ’ \\n\\n \\n\\n The ancient maltster，with his white hair and long white beard，turned his old head stiffly towards Gabriel. ‘Gabriel Oak of Norcombe！’he said. ‘I knew your grandparents well！My boy Jacob and his young son Billy know your family too. ’His boy Jacob was bald and toothless，and young Billy was about forty. \\n\\n \\n\\n ‘You must be very old，maltster，’said Gabriel politely，‘to have such an old son as Jacob here. ’ \\n\\n \\n\\n ‘Yes，I\u0027ve lived for over a hundred years，’replied the little old man proudly. ‘Sit down and drink with us，shepherd. ’ \\n\\n \\n\\n The cup of warm beer passed round the circle of drinkers. There was silence for a moment. Then Gabriel turned the conversation to the matter closest to his heart. \\n\\n \\n\\n ‘What kind of mistress is Miss Everdene？’he asked. \\n\\n \\n\\n ‘We know almost nothing of her，shepherd，’answered Jan Coggan，a big，cheerful man with a red face. ‘She only arrived here a few days ago，when her uncle died. But the Everdenes are a good family to work for. Of course，it\u0027s the farm manager who\u0027ll be giving us our orders. ’ \\n\\n \\n\\n ‘Ah！’said the maltster，frowning. ‘Benjy Pennyways！’ \\n\\n \\n\\n ‘You can\u0027t trust him！’added Jacob darkly. \\n\\n \\n\\n Soon afterwards Gabriel left with Jan Coggan，who had offered the shepherd a bed in his house. The remaining men were just preparing to leave when suddenly a young man called Laban Tall rushed into the malthouse，almost too excited to speak. \\n\\n \\n\\n ‘It\u0027s Benjy Pennyways！’he cried. ‘Miss Everdene\u0027s caught him stealing wheat from the barn！She\u0027s sent him away！And worse than that——Fanny Robin，you know，Miss Everdene\u0027s youngest maid，is missing！The mistress wants us to look for her tomorrow. And Billy Smallbury，she wants you to go to Casterbridge，to see if you can find the young soldier who\u0027s been courting Fanny. ’ \\n\\n \\n\\n That night the news spread fast round the village，but did not reach Gabriel，whose dreams were only of Bathsheba. Through the long slow hours of darkness he saw her lovely face and forgot that she did not love him. \\n\\n \\n\\n The next morning Bathsheba and her maid Liddy were dust-ing some books，when a visitor arrived at the front door. It was Mr Boldwood，who had a large farm in Weatherbury. \\n\\n \\n\\n ‘I can\u0027t see him like this，Liddy！’said Bathsheba，looking in horror at her dusty dress. ‘Go down and tell him I\u0027m busy. ’ \\n\\n \\n\\n When Liddy came back， after Mr Boldwood had gone，Bathsheba asked，‘What did he want， Liddy？ And who is he，exactly？’ \\n\\n \\n\\n ‘He just wanted to ask if Fanny had been found，miss. You know，as she had no family or friends，he was kind enough to pay for her to go to school，and found her a job here with your uncle. He\u0027s your neighbour. His farm is next to yours. ’ \\n\\n \\n\\n ‘Is he married？ And how old is he？’ \\n\\n \\n\\n ‘He isn\u0027t married. He\u0027s abeut forty，very handsome—and rich. All the girls in the area have tried to persuade him to marry. But he just doesn\u0027t seem interested in women. Have you ever had an offer of marriage，miss？’ \\n\\n \\n\\n ‘Yes，I have，Liddy，’answered Bathsheba after a pause，thinking of Gabriel. ‘But he wasn\u0027t quite good enough for me. ’ \\n\\n \\n\\n ‘Oh，how nice to be able to refuse，when most of us are glad to accept the first offer！ And did you love him，miss？’ \\n\\n \\n\\n ‘Oh no. But I rather liked him. ’ \\n\\n \\n\\n In the afternoon Bathsheba called her workers together，and spoke to them in the old hall of the farmhouse. \\n\\n \\n\\n ‘Men，I want to tell you that I\u0027m not going to employ a new farm manager. I shall manage the farm myself. ’There were gasps of surprise from the men. She gave her orders for the next week\u0027s farm work and then turned to one of the 46 men. ‘Billy Smallbury， what have you discovered about Fanny Robin？’ \\n\\n \\n\\n ‘I think she\u0027s run away with her young man，ma\u0027am. The soldiers have left Casterbridge，and I suppose she\u0027s gone with them. ’ \\n\\n \\n\\n ‘Well，perhaps we\u0027ll discover more later. One of you can go and tell Mr Boldwood what Billy says. Now，men，I hope I can trust you all to do your work well for me. Goodnight. ’ \\n\\n \\n\\n Later that evening，in a town many miles north of Weather bury，a small white shape could be seen walking slowly along a path beside a large building. It was a dull，snowy night，with heavy grey clouds hanging low in the sky，the kind of night when hopes are destroyed and love is lost. \\n\\n \\n\\n ‘One. Two. Three. Four. Five. ’The white shape was counting windows in the building. Then it began to throw small stones，covered in snow，at the fifth window. At last the window opened，and a man called out，‘Who\u0027s there？’ \\n\\n \\n\\n ‘Is that Sergeant Troy？’asked a girl\u0027s voice. \\n\\n \\n\\n ‘Yes，’answered the man. ‘Who are you？’ \\n\\n \\n\\n ‘Oh Frank，don\u0027t you know me？’cried the girl desperately. \\n\\n \\n\\n ‘I\u0027m your—I\u0027m Fanny Robin. ’ \\n\\n \\n\\n ‘Fanny！’gasped the man in surprise. ‘How did you get here？’ \\n\\n \\n\\n ‘I walked most of the way from Weatherbury. But，Frank，are you glad to see me？ Frank，when will it be？’ \\n\\n \\n\\n ‘What are you talking about？’ \\n\\n \\n\\n ‘You know，you promised. When shall we be married，Frank？’ \\n\\n \\n\\n ‘Oh，I see. Well—you need proper clothes—we must inform the vicar. It takes time. I didn\u0027t expect you to come so soon. ’ \\n\\n \\n\\n ‘Oh Frank，I love you so！And—you said you\u0027d marry me—’ \\n\\n \\n\\n ‘Don\u0027t cry now！It\u0027s foolish. If I said so，of course I will. I\u0027ll come and see you tomorrow to decide the details. ’ \\n\\n \\n\\n ‘Oh yes，Frank，do！I\u0027m staying at Mrs Twill’s in North Street. Come tomorrow，Frank！Goodnight，Frank！’ \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/1015/30543.html","bookId":29,"book":{"id":29,"title":"远离尘嚣 Far from the madding crowd","description":"简介： 《远离尘嚣（Far from the madding crowd）》发表于一八七四年，是哈代第一部成功的长篇，也是他此后一系列以威塞克斯乡村为背景的优秀长篇小说的第一部。这些小说包括《还乡记》（1878）、《卡斯特桥市长》（1886）、《德伯家的苔丝》（1891）以及《无名的裘德》（1896...","cover":"http://novel.tingroom.com/file/upload/201404/21/10-06-12-99-1.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/1015","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
