{"id":37132,"no":1,"title":"CHAPTER I PLANS","content":"It was the third week in September when the Fairfields left the seashore and returned to their Vernondale home. \\n\\n \\n\\n “Now, my child,” said Mr. Fairfield, as they sat on the veranda after dinner, “I will unfold to you my plans for the coming winter, and you may accept, or reject, or amend them as you please.” \\n\\n \\n\\n “Proceed,” said Patty, settling herself comfortably in her wicker chair; “I feel in an amiable mood this evening, and will probably agree to anything you may suggest.” \\n\\n \\n\\n “I’ve been thinking for some time,” went on her father, “that I don’t want to spend the coming winter in Vernondale. I would much rather be in New York.” \\n\\n \\n\\n “Reason number one—Nan,” said Patty, checking it off on her forefinger and smiling at her father. \\n\\n \\n\\n “Yes,” he responded, with an answering smile, “she is reason number one, but there are others.” \\n\\n \\n\\n To readers who are unfamiliar with Patty’s earlier history we may say right here that her mother had died when Patty was but three years old. At present she lived with her father in their little home in Vernondale, an establishment of which Patty greatly prided herself on her management. \\n\\n \\n\\n Recently Mr. Fairfield had become engaged to Miss Nan Allen, a young lady who lived in Philadelphia, and who was a dear friend of Patty’s. \\n\\n \\n\\n “You know,” Mr. Fairfield went on, “this Vernondale house was only an experiment, and although it has proved successful in its own way, I want to try another experiment of a winter in the city. As you so wisely discern, it is partly for the sake of being nearer to Nan. The Allens will spend part of the winter in New York, and, too, Philadelphia is more easily accessible from there than from here. We shall not be married until spring, and so your absolute monarchy will extend through the winter, and you can then abdicate in favor of the new queen.” \\n\\n \\n\\n “And I’ll be glad enough to do it,” cried Patty; “it isn’t abdication at all; or if it is, I’m glad of it. I’m perfectly delighted that you’re going to marry Nan, and though it does seem ridiculous to have one of my own friends for a stepmother, yet she’s six years older than I am, and if she wants to rule me with a rod of iron, she may.” \\n\\n \\n\\n “I fancy there won’t be much stepmothering about it; I’m afraid you’ll be two refractory children, and I’ll have to take care of you both.” \\n\\n \\n\\n “I don’t know about that,” said Patty, laughing. “You’ve become so absurdly young yourself of late that I think I shall have to take care of you two. But tell me some more about your New York plans. Shall we have a house of our own?” \\n\\n \\n\\n “No; I think not—this winter. Although you are all that is admirable by way of a housekeeper, I’ve come to the conclusion that it’s too much responsibility for you; and of course, would be much more so in the city. So I think we’ll take a suite of rooms in some nice apartment hotel. This, you see, will make it more convenient for me in regard to my business; for I’m quite ready to confess that I’m tired of enjoying a commuter’s privileges. From our city home I could probably reach my office in less than half an hour, while from here it takes me fully an hour and a half, besides the discomforts of the railroad and ferry trip.” \\n\\n \\n\\n “That would be nice,” said Patty thoughtfully; “then we wouldn’t have to have breakfast so early, and I wouldn’t have to wait for you so long at night.” \\n\\n \\n\\n “Another thing,” went on her father, “is your own education. I want you to have a year or two at some good school in the city, and I do not want you to go back and forth every day from here. And you ought to take singing lessons, and there are lots of things you ought to learn. During your rather migratory life of the past two years your education has really been neglected, and it won’t do. You’re growing up, to be sure, but you’re still a schoolgirl, and must remain one for a couple of years more at least. When we take Nan into the family she can look after the housekeeping, and so you will be free to attend to your studies; but this winter, as I say, you must not have household cares to interfere. And so a few rooms in some nice hotel will make a home for us that shall be cosey and pleasant, and yet not fill your life with the cares and duties of housekeeping.” \\n\\n \\n\\n “All right, papa,” said Patty, “I think it will be lovely, and I’m ready to go, right straight off. Of course I’m sorry to leave the Vernondale girls, and they’ll be as mad as hops at me for going; but I do love the city, and I think we’ll have a beautiful time. When shall we start?” \\n\\n \\n\\n “Not to-night,” said Mr. Fairfield, smiling at his impetuous daughter; “there are some trifling details to be settled first. You see, you’re a country girl, my child, and deplorably ignorant of city ways. Has it occurred to you that it would hardly do for you and me to live alone in a city hotel? For I must necessarily be down at my office all day, and, too, I shall probably make occasional trips to Philadelphia. At such times you would be alone in our apartment, which is, of course, out of the question. Have you anything to suggest?” \\n\\n \\n\\n “I never thought of that. I thought we could live together there just the same as we do here. You’re always away all day.” \\n\\n \\n\\n “Yes, but here there are the three servants to look after you. And, too, conventions are not quite the same in New York and Vernondale. I don’t want a governess for you, for I want you to have the experiences of school life.” \\n\\n \\n\\n “I might have a maid,” said Patty, anxious to suggest something. “I might take Pansy.” \\n\\n \\n\\n “No,” said her father, “that isn’t the kind of person you require. The third person in our home must be a lady who can look after you and advise you, and occasionally go about with you.” \\n\\n \\n\\n “Well then, marry Nan right away, and let her do all this.” \\n\\n \\n\\n “That would do admirably, but there is one obstacle. I laid that plan before Nan herself, and she positively refused to come and be one of us before next spring.” \\n\\n \\n\\n “Well, what can we do?” asked Patty. \\n\\n \\n\\n “Why, I think this the solution of the problem: Let us take Grandma Elliott to spend the winter with us.” \\n\\n \\n\\n “Just the thing!” exclaimed Patty, clapping her hands; “she’s the very one! she loves to live in the city and she’s lived there so much she knows all about it, and I’m sure she’d be glad to go.” \\n\\n \\n\\n “Yes, she would be just the right one; she’s a very wise lady, and although she’s perhaps sixty years old, she is as active and energetic as many much younger women. She is quite conversant with the proprieties, and would know even better than I just what you can and can’t do. For you must know, Patty girl, that your life in New York will be more restricted in many ways than it is here. There are certain rules that must be observed, and while I want you to have a good time and a happy time, yet you must realise that you are still only a schoolgirl, and must conduct yourself as such.” \\n\\n \\n\\n “Can’t I go to anything except school, papa?” asked Patty, looking a little dismayed. \\n\\n \\n\\n “Well, perhaps on nice afternoons I might take you for a walk around the block,” said her father, laughing at her anxious face. “But suppose we go over and see what Grandma Elliott has to say about it.” \\n\\n \\n\\n “All right,” said Patty, “but you must protect me from Marian’s ferocity. She’ll be as mad as a raging lion.” \\n\\n \\n\\n When the question of the Fairfields’ permanent residence was under discussion a year earlier, Grandma Elliott was perhaps the only one in favour of their living in New York. The younger Mrs. Elliott, who was Mr. Fairfield’s sister, had most decidedly been of the opinion that a home in the small town of Vernondale was in every way better adapted to Patty’s welfare. \\n\\n \\n\\n Patty’s cousins had vociferously agreed to this, and the result was that Mr. Fairfield had taken a house in Vernondale for a year. Patty had proved a most satisfactory little housekeeper, for she had a real talent for household management, but even Aunt Alice had at last come to agree with Mr. Fairfield that the responsibilities were rather heavy for a schoolgirl. \\n\\n \\n\\n As Patty had anticipated, the Elliott children, and especially Marian, received the news with expressions of emphatic disapproval. \\n\\n \\n\\n “I knew you’d do it!” wailed Marian, “but I think it’s perfectly horrid, and I’ll never forgive you as long as I live! I don’t want you to go away from Vernondale, and you won’t like it a bit in New York, I know you won’t. You can’t do anything at all; you can’t go out into the street without a chaperon, and a maid, and two policemen! And whatever will the Tea Club do without you?” \\n\\n \\n\\n “I’ll have all the Tea Club come in to a meeting at my house,” said Patty, anxious to pacify her cousin. \\n\\n \\n\\n “We won’t come! we’ll none of us ever speak to you again! we’ll cross your name off the books and forget that you ever existed!” \\n\\n \\n\\n It was so seldom that the gentle Marian became excited over anything that Patty felt really sorry, and tried her best to put the matter in its most attractive light. \\n\\n \\n\\n “Don’t talk like that, Marian,” she said; “papa has decided that we are to go, and so there’s no use in discussing that part of it. Now the thing to do is to find the bright side and look on that.” \\n\\n \\n\\n This was Patty Fairfield’s philosophy in a nutshell. All her life she had not only unquestioningly accepted the inevitable, but had immediately found its bright side and ignored all others. This was partly the cause and partly the effect of her bright sunshiny disposition and her uniformly happy and contented frame of mind. \\n\\n \\n\\n “Just think, Marian,” she went on, “you can come to see me and we can have lots of fun. We’ll have all the girls come over while you’re there, and it will be jolly to have a Tea Club meeting in a hotel.” \\n\\n \\n\\n “Yes, that will be fun,” assented Marian, “but after the meeting we’ll all have to come home and leave you there. I suppose I’m selfish, but I don’t care! I don’t want you to go away from Vernondale, Patty Fairfield, and I think you’re a mean old thing to go!” \\n\\n \\n\\n It seemed impossible to do anything with Marian in her present mood, so Patty turned to Aunt Alice for sympathy. \\n\\n \\n\\n “I feel quite as sorry to have you go as Marian does,” said Mrs. Elliott, looking lovingly at her niece, “though I don’t express myself in such violent language. But Brother Fred has been talking to me and he has convinced me that it is a good plan in many ways. So I am going to give you up bravely, and I think that after a while Marian will be able to face the matter more calmly.” \\n\\n \\n\\n “I don’t think it’s half bad,” broke in Frank Elliott; “of course we shall miss Patty like the dickens, but I shall spend much of my time visiting her in New York.” \\n\\n \\n\\n “Do,” said Patty, delighted at this unlooked-for support; “come just as often as you like and I’ll guarantee that you’ll have a good time.” \\n\\n \\n\\n Then Mr. Fairfield proposed his plan of taking Grandma Elliott to spend the winter with them in the city. \\n\\n \\n\\n Grandma’s eyes beamed with delight as she listened, for the old lady was urban in her tastes and had lived far the greater part of her life in New York. \\n\\n \\n\\n Aunt Alice and Uncle Charlie heartily approved of this arrangement. \\n\\n \\n\\n “We shall miss you dreadfully,” said Mr. Elliott to his mother, “but we shall let you go cheerfully, for I well know how much you will enjoy it.” \\n\\n \\n\\n But Marian set up another howl. \\n\\n \\n\\n “It’s bad enough to have Patty go,” she said, “but to have Grandma go, too, is terrible. I suppose you’ll take mother and little Gilbert, as well.” \\n\\n \\n\\n “Marian, you’re a goose!” said Patty, laughing. “If you don’t stop talking like that, I’ll take you along and keep you there all winter.” \\n\\n \\n\\n “I don’t want to do that,” said Marian, “but I don’t want you to go either. I know one thing, though—after you’ve been there a week you’ll be so disgusted you’ll come trailing back again.” \\n\\n \\n\\n “And after you’ve visited me for a week you’ll be so enchanted that you won’t want to come trailing back,” said Patty, laughing at her cousin’s woe-begone expression. \\n\\n \\n\\n “When are you going?” asked Marian in a tone of final resignation. \\n\\n \\n\\n “Very soon,” said Mr. Fairfield, “for I want to get this ignorant daughter of mine into school as quickly as possible. Indeed, we shall go as soon as Grandma Elliott is ready to accompany us.” \\n\\n \\n\\n “You won’t have to wait long for me,” said Grandma; “I shall be all ready by the time you have found your house.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1980/56648.html","bookId":711,"book":{"id":711,"title":"Patty in the City","description":"简介： It was the third week in September when the Fairfields left the seashore and returned to their Vernondale home....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1980","creation":"Aug 1, 2019 12:19:11 AM","modification":"Aug 1, 2019 12:19:11 AM"}}
