{"id":96115,"no":10,"title":"Page 10","content":"I coasted my way home and was parking my bike in the garage when I heard the sound of something hovering a few feet away from me. Cautiously I tiptoed toward the door, my flashlight primed for any maverick vampires.\\n\\n I saw nothing. Just my dad\u0027s parked SUV. I was sure it was a hungry raccoon foraging for leftovers in our garbage can.\\n\\n Then I heard a twig snap.And footsteps.\\n\\n I decided to make a run for it. Our back door was only ten yards away from the garage. All I could think of was Freddy Krueger. Michael Myers.Or hockey-masked Jason. Crazy horror movie stalkers haunted my thoughts. I\u0027d seen far too many scary movies to shake them from my mind,Think kids shows , I thought.Barney .Teletubbies.Dora . Those images frightened me more.\\n\\n If I had my keys ready, I\u0027d make it safely inside before anything could cause me bodily harm. I took a deep breath and geared up to charge forth. But before I took my first step, I was caught in a surprising trap. It wasn\u0027t Trevor blocking my escape in the shadow from the garage, or even the most nefarious vampire of all-Alexander\u0027s enemy,Jagger Maxwell. It was Alexander.\\n\\n \"Oh... It\u0027s just you. Thank goodness!\" I made my way to hug him, but he kept his arms folded.\\n\\n \"Where were you?\" he asked. He stood stern as my father had many times when I\u0027d broken curfew.\\n\\n \"I just went out for a ride,\" I said truthfully.\\n\\n \"By yourself?At night?\"\\n\\n \"It\u0027s still early. My bike has a light on it.\" All true.\\n\\n \"Then what\u0027s that for?\" he asked, pointing to my flashlight. \"Were you searching for something?Or rathersomeone?\"\\n\\n \"It\u0027s always good to have extra light. I\u0027m not like you: I can\u0027t see in the dark.\" I grimaced, hoping he\u0027d grin back. His stony expression remained fixed.\\n\\n \"I went to your house,\" I confessed. \"Everyone in Dullsville, including Matt, Becky, and Trevor, has spotted your parents. All I had was a vague memory of a portrait you\u0027d painted of them. I wanted to see them for myself.\"\\n\\n I felt awful. My impatience had gotten the best of me once again. I\u0027m not sure how I\u0027d feel if Alexander was sneaking around my house, trying to ogle my parents as if they were subjects in a Generated by ABC Amber LIT Converter,sideshow. I was no better than the local gossipmongers.\\n\\n I waited what seemed like an eternity for Alexander\u0027s response. I was so ashamed of myself I barely made eye contact.\\n\\n My boyfriend took my wrist and gently drew me to him.\\n\\n \"I think I might have to place you under arrest for trespassing. But I always go easy on pretty girls who confess,\" he said ominously.\\n\\n \"You knew, didn\u0027t you? I\u0027m that predictable?\"\\n\\n \"It was just a matter of time before I spotted you hiding in our bushes.\"\\n\\n \"So you\u0027re not mad?\"\\n\\n \"I\u0027m not through with you yet. Are you prepared to accept your punishment?\"\\n\\n I nodded reluctantly. I wasn\u0027t sure what a vampire\u0027s punishment might be. But I was ready to find out.\\n\\n \"I sentence you to a thousand kisses,\" he said.\\n\\n \"Can I begin now?\"\\n\\n He finally smiled. I pressed my lips to his and snuggled against him.\\n\\n When we broke away, I apologized again.\\n\\n \"It\u0027s okay. It\u0027s time that you meet them. But for tonight, you\u0027ll have to settle for me.\" Alexander winked.\\n\\n And for the next hour I continued to fulfill my sentence.\\n\\n Another letter arrived mysteriously-only this time it was at my house.\\n\\n \"You have mail,\" my mom said when I got home the following day. \"It\u0027s on the kitchen table.\"\\n\\n I wasn\u0027t used to receiving cards when it wasn\u0027t my birthday or a holiday. Even if it was a college brochure, I was excited something was addressed to me.\\n\\n A deep purple envelope lay next to our pastel blue salt and pepper shakers.\\n\\n In beautiful black calligraphy it read:Miss Raven Madison. Like Alexander\u0027s mail it was devoid of postmarks or stamps. On the back it had a candle-waxed pressed seal of an S.\\n\\n I almost tore into it when I remembered how Alexander opened his mail.\\n\\n \"Mom,\" I called. \"Do we have a letter opener?\"\\n\\n \"I think there\u0027s one in your dad\u0027s desk.\"\\n\\n I opened the French doors to my dad\u0027s office. He had a dark oak desk topped with family pictures. I scanned the desk for any sharp objects but didn\u0027t find anything other than a few pens and a golf tee. I was growing antsy and rifled through his desk drawer.\\n\\n Finally, underneath a file folder, I found a gold letter opener, the end in the shape of a tennis racket. I carefully slit open the envelope.\\n\\n I pulled out the note card and read:\\n\\n Mr. and Mrs. Constantine Sterling\\n\\n request the pleasure of jour company\\n\\n for dinner this Friday at sunset\\n\\n TheSterlingMansion\\n\\n Benson Hill\\n\\n It was official. I was finally going to meet Alexander\u0027s parents, and I had the invitation to prove it! \\n\\n","sourceLink":"https://allnovel.net/royal-blood-vampire-kisses-6/page-10.html","bookId":2145,"book":{"id":2145,"title":"Royal Blood (Vampire Kisses #6)","description":"Storyline: Royal Blood (Vampire Kisses #6) \\n Summer break is over, and Raven is hardly eager to be returning to Dullsville High. Not only does school mean daily interaction with preppy pest Trevor Mitchell, but her sleep-filled days and romantic nights with her immortal boyfriend, Alexander, must come to an end. Plus the shock of morning classes isn\u0027t the only change in store.\\n","cover":"https://allnovel.net/images/royal-blood-vampire-kisses-6.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/royal-blood-vampire-kisses-6.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:18:38 PM"}}
