{"id":96130,"no":25,"title":"Page 25","content":"Unfortunately the next guy\u0027s face I had to see was Trevor\u0027s.\n \"We haven\u0027t answered everything,\" my nemesis said, finding me on the lawn after school.\n \"I think you can fill in the blanks,\" I replied.\n \"I can give you a lift home. We could do it in the car.\"\n I glared back.\n \"I mean the assignment,\" Trevor said, raising an eyebrow.\n \"I\u0027d rather walk.\"\n \"When are you going to admit that you are avoiding me because you\u0027re hot for me?\"\n \"When hell freezes over.\"\n \"You should know about hell-you live there. How about you step up to the plate and finish the job?\" Trevor challenged.\n I thought for a moment. I was slightly taken with the idea of having my owngoth fashion magazine like Becky and I had discussed, but I couldn\u0027t possibly share that with Trevor. I\u0027d only be ridiculed. Instead I said, \"Okay, Soccer Boy. Figure out a career for me. Something that will make me money so I can be self-reliant.\"\n Trevor opened his notebook. I could see several typed pages of his essay were already complete.\n \"What\u0027s wrong with a man taking care of you?\" he asked.\"Someone rich.And powerful.\"\n \"I already have that.\" I admitted.\n \"And blond.\"\n \"I like dark hair.\"\n \"And popular.\"\n He did have me on that. Neither Alexander nor I were popular.But Trevor Mitchell? He could have been voted prom king in the first grade.\n \"Isn\u0027t fame important to you?\" he asked, inching closer.\"Everyone knowing your name?\"\n \"I think they already do.\"\n \"But not for the right reasons,\" he said with a chuckle.\n \"I\u0027m not interested in being famous. I\u0027m interested in being me.\"\n Trevor shook his head and jotted a few notes down in his notebook. \"So where did we leave off? Do your parents want you to follow in their footsteps? \"\n \"No. Is this over yet?\" I whined.\n \"What do you like to do on a rainy day?\" he asked.\n \"Sit outside.\"\n \"What do you like to do on a sunny day?\"\n \"Sleep.\"\n \"Doyou think of yourself as creative?\"\n \"No.\"\n \"You don\u0027t?\" he asked, surprised. \"With the way you dress and make yourself up? I think you\u0027ve always been creative. Like a clown.\"\n \"Do you want me to take you down now? Or do it in front of the class?\"\n \"Calm down. What is your favorite outfit?\"\n \"Hmm.My corset prom dress.\"\n \"When you close your eyes, who do you dream about?\"\n \"Alexander.\"\n \"If you had one guy in school to kiss, who would that be?\" he asked, leaning toward me.\n \"This isn\u0027t on the sheet. None of these questions are, bonehead!\"\n With Trevor, sometimes it was difficult to keep straight who was kidding who.\n \"I was just making sure you were paying attention.Fve finished the interview portion. Now I can just write the essay.\"\n \"So- we don\u0027t have to meet again?\"\n \"I\u0027ve finished my part,\" he said coyly, and gave me the completed interview sheet. \"Now it\u0027s time to finish your questions about me.\"\n Trevor\u0027s interview sheet was blank. I quickly jotted down some answers to the questions and handed it to him.\n \"You won\u0027t get an A for handwriting,\" he said.\n Trevor and I rose and dusted the dirt off our jeans. \"Our next date will be in front of class,\" he said.\n I couldn\u0027t help but feel a twinge of kindness toward him, as he had inadvertently helped Alexander remain in the Mansion.\n \"I\u0027m off to meet my father,\" he said as he got into hisCamaro . \"Did you hear? My dad might buy the Mansion.\"\n I stopped dead in my tracks.\n \"What did you say?\"\n Hegrinned a wicked grin. \"I was waiting to tell you until after I got my interview portion completed... We were talking about the Mansion at dinner last night and how word around town is no one will buy it because it\u0027s a hideous money pit. My dad said that the land upon which it sits is valuable property in its own right. It will be cheaper to hire a wrecking ball and bulldozer. Just thought you\u0027d want to know. It\u0027ll make a great strip mall.\"\n I was floored. I had no idea my own plan would turn against me. And of course, Trevor was just the person to do it.\n \"No- you can\u0027t buy it!\" I said,my body filled with rage. \"You can\u0027t buy it-and you can\u0027t tear it down.\"\n \"I know I can\u0027t, Monster Girl. But my dad can.\"\n Trevor\u0027s father owned half the town ofDullsville . I wouldn\u0027t ever want Benson Hill to fall into that half.\n \"I\u0027ll tell my dad to save a few bricks when he tears it down. You can have them as a souvenir. I won\u0027t charge you very much, since they\u0027re worthless,\" he said, and rolled up his window and sped off. \n","sourceLink":"https://allnovel.net/royal-blood-vampire-kisses-6/page-25.html","bookId":2145,"book":{"id":2145,"title":"Royal Blood (Vampire Kisses #6)","description":"Storyline: \n Royal Blood (Vampire Kisses #6) \n Summer break is over, and Raven is hardly eager to be returning to Dullsville High. Not only does school mean daily interaction with preppy pest Trevor Mitchell, but her sleep-filled days and romantic nights with her immortal boyfriend, Alexander, must come to an end. Plus the shock of morning classes isn\u0027t the only change in store.\n \n","cover":"https://allnovel.net/images/royal-blood-vampire-kisses-6.jpg","author":"Ellen Schreiber","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/royal-blood-vampire-kisses-6.html","creation":"Oct 5, 2019 8:58:23 AM","modification":"Oct 5, 2019 6:18:38 PM"}}
