{"id":25793,"no":4,"title":"CHAPTER III. HOW TOM GOT ON.","content":"About this time Tom took account of stock. He had come out to California with the noble and praiseworthy purpose of earning money to help his father pay off the mortgage on his little farm. He was the more anxious to succeed, because two hundred dollars of the amount had been raised to defray his expenses across the continent. The mortgage, amounting now to twenty-two hundred dollars, was held by Squire Hudson, a wealthy resident of the same town, who hoped eventually to find an excuse for fore-closing the mortgage, and ejecting Mr. Nelson\u0027s family. He was actuated not alone by mercenary motives, but also to gratify an ancient grudge. In early life Mrs. Nelson, Tom\u0027s mother, had rejected the suit of the wealthy squire, and this insult, as he chose to characterize it, he had never forgotten or forgiven.[Pg 28] Had Tom been aware of the Squire\u0027s feelings, towards his family, he never would have been willing to have the mortgage increased for his sake, much as he wished to go to California. But neither Tom nor his father dreamed of Squire Hudson\u0027s secret animosity, and regarded his willingness to advance the extra two hundred dollars as an evidence of friendship. But I have said that Tom took account of stock—in other words, ascertained how much he was worth. First, then, of the money borrowed for his trip—the original two hundred dollars—he had twenty-five dollars left over. Besides this sum, after paying all expenses, he had accumulated, by hard work and strict economy, fifty dollars\u0027 worth of gold-dust. \"I wish father had this money,\" said Tom to his tent-mate, Ferguson. \"I am afraid he stands in need of it.\" \"There may be a way to send it to him, Tom.\" \"I wish there were.\" \"There\u0027s one of our party going to San Francisco[Pg 29] next week. He can buy a draft there, and send it to your father.\" \"Who is going?\" asked Tom, eagerly. \"John Miles. You can trust him with the money, Tom.\" \"Of course I can. I\u0027d trust John Miles with any sum.\" \"Who\u0027s that taking liberties with my name?\" asked a manly voice, and John Miles himself stepped into the tent, bending his head as he entered. \"I hear you are going to San Francisco, John?\" \"Yes, I start next week.\" \"Will you come back again?\" \"I intend to. I am going to prospect a little, and buy some things for myself and Captain Fletcher.\" \"Will you do me a favor?\" \"Of course I will, if it isn\u0027t too large a one,\" answered Miles. Tom explained what he wished, and John Miles cordially assented.[Pg 30] \"You\u0027re a good boy, Tom,\" he said, \"to think of your father so soon.\" \"I feel anxious about him,\" said Tom. \"He raised money to send me out here, and I don\u0027t want him to suffer for it.\" \"That\u0027s the right way to feel, Tom. I wish I had a father and mother to look out for,\" said Miles, soberly, \"but you\u0027re in better luck than I. Both died when I was a mere lad. How much do you want to send?\" \"Seventy-five dollars.\" \"Have you saved up so much already?\" asked Miles, in surprise. \"Part of it I had left over when I got here.\" \"Will you have any left?\" \"No.\" \"Isn\u0027t it well to reserve a little, then?\" \"Oh, I shall have some more soon,\" answered Tom, sanguine, as most boys are. \"Suppose you are sick?\" \"If he is sick he shall suffer for nothing,\" said the Scotchman. \"While I have money, Tom shall not feel the want of it.\"[Pg 31] \"Thank you, Mr. Ferguson,\" said Tom, gratefully. \"That old fellow has a heart, after all,\" thought Miles, who had been disposed to look upon Ferguson ever since their first acquaintance, as rather miserly. The Scotchman was certainly frugal, and counted his pennies carefully, but he was not mean, and had conceived a strong affection for his young companion, whom he regarded much as a son or a nephew. \"Suppose you take the money now, John,\" said Tom. \"Shall I scribble a receipt, Tom? I am afraid my writing materials have given out.\" \"I don\u0027t want any receipt,\" said Tom; \"I\u0027ll trust you without one.\" \"Nevertheless, lad,\" said the cautious Scotchman, \"it may be well—\" \"Yes, Tom, Mr. Ferguson is right. Of course I know that you trust me; but if anything should happen to me,—any accident, I mean,—the paper may be useful to you.\"[Pg 32] \"Just as you like, Mr. Miles, but I don\u0027t ask it, remember that.\" \"Yes, I will remember it, and I don\u0027t mean to meet with any accident if I can help it. Mr. Ferguson, can you oblige me with a pipeful of tobacco? I\u0027ll join you in smoking.\" Smoking was the Scotchman\u0027s solitary extravagance, not a costly one, however, as he never smoked cigars, but indulged only in a democratic clay pipe. John Miles threw himself on the ground between Tom and his Scotch friend, and watched complacently the wreaths of smoke as they curled upwards. \"Tom, you ought to smoke,\" he said. \"You don\u0027t know how much enjoyment you lose.\" \"Don\u0027t tempt the lad,\" said Ferguson. \"It\u0027s a bad habit.\" \"You smoke yourself.\" \"That is true, but it isn\u0027t well for a growing boy. It can do him no good.\" \"I smoked before I was as old as Tom.\" \"So did I, but I wish I had not.\"[Pg 33] \"Well, perhaps you\u0027re right, but it\u0027s a comfort when a man\u0027s tired or out of spirits.\" \"I am not troubled in that way,\" said Tom. \"I mean with being out of spirits.\" \"Youth is a hopeful age,\" said the Scotchman. \"When we are young we are always hoping for something good to befall us.\" \"And when one is older, how is it, Mr. Ferguson?\" \"We fear ill more than we hope for good,\" he replied. \"Then I want to remain young as long as I can.\" \"A good wish, Tom. Some men are always young in spirit; but those that have seen the evil there is in the world find it harder to be hopeful.\" \"You speak as if you had had experience of the evil, Mr. Ferguson.\" \"So I have,\" answered the Scotchman slowly. Then, after a pause, \"I will tell you about it: it\u0027s no secret.\" \"Not if it is going to pain you.\"[Pg 34] \"Oh, the pain is past. It\u0027s only a matter of money, and those wounds heal.\" \"Only a matter of money!\" said John Miles to himself. \"I must have misjudged Ferguson. I thought money was all in all with him. I did not think he would speak so lightly of it.\" \"When I was a young man,\" Ferguson began, \"my father died, leaving me a thousand pounds, and a small annuity to my mother. With this money I felt rich, but I knew it would not support me, nor was I minded to be idle. So I began to look about me, to consider what business I had best go into, when a young man, about my own age, a clerk in a mercantile house, came to me and proposed a partnership. He was to put in five hundred pounds, and contribute his knowledge of business, which was greater than mine. He was a young man of good parts, and had a brisk, pleasant way with him, that made him a favorite in business circles. I thought it was a good chance, and, after taking a little time for thought, agreed to his proposal. So the firm of McIntire and Ferguson was[Pg 35] formed. We went into business, and for a time all seemed to go well. As my partner chose to keep the books, I was not so clear as I wished to be about matters, but we seemed to be prospering. One morning, however, on coming to business, I found that my partner had disappeared, after possessing himself of all the money he could collect on the credit of the firm. Of course we were bankrupts, or rather I was, for he left me to bear the brunt of failure.\" \"Have you ever seen him since, Mr. Ferguson?\" \"From that day to this—twenty years—I have never set eyes on Sandy McIntire.\" \"It was a mean trick to serve you, Ferguson,\" said Miles. \"Yes,\" said the Scotchman, soberly. \"I minded the loss of money, but the loss of confidence was a sore thought too, after all the trust I had put in that man.\" Presently Miles rose to go. \"I\u0027ll take care of your money, Tom,\" he said, \"and do my best to get it safely to your father.\"[Pg 36] \"Thank you, John.\" As Miles left the tent, he did not observe a crouching figure on the other side of it. It was the figure of Bill Crane, a crony of Missouri Jack, in fact, the man who helped him to fleece poor Peabody of his scanty hoard. Bill looked after Miles enviously. \"I wonder how much money he\u0027s got?\" thought Bill. \"I\u0027d like some of it, for I\u0027m bust. I must tell Jack. I don\u0027t dare to tackle him alone.\"","sourceLink":"http://novel.tingroom.com/ertong/2973/81887.html","bookId":350,"book":{"id":350,"title":"The Young Miner or Tom Nelson in California","description":"简介： A dozen men, provided with rockers, were busily engaged in gathering and washing dirt, mingled with gold-dust, on the banks of a small stream in California. It was in the early days, and this party was but one of hundreds who were scattered over the...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2973","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
