{"id":19867,"no":2,"title":"II. MR. THIMBLEFINGER’S QUEER COUNTRY.","content":"The next morning Sweetest Susan was awake early. She wanted very much to turn over and go to sleep again, for her eyes were heavy and her body was tired. But the moment she remembered the wonderful events of the night before, she sat up in bed and looked around. Drusilla was still asleep and snoring very loudly, but Sweetest Susan jumped out of bed and shook her by the shoulder. “Drusilla! Drusilla! wake up!” cried Sweetest Susan. Drusilla stopped short in her snoring and turned over with a groan. She kept her eyes closed, and in a moment she would have been snoring again, but Sweetest Susan continued to shake her and called her until she squalled out:— “Who dat? What you want? Oh, Lordy!” “Wake up, Drusilla,” said Sweetest Susan, “I want to ask you something.” [Pg 18] “Ain’t I ’wake? How kin I be any ’waker when I’m ’wake? Oh, is dat you, honey? I wuz skeer’d ’t was dat lil’ bit er ol’ ’oman. Whar she gone? Las’ time I seed her she wuz des walkin’ ’roun’ here like she wuz gwine ter tromple on me. I laid low, I did.” Sweetest Susan clasped her hands together and cried: “Oh, wasn’t it a dream, Drusilla? Did it all happen sure enough?” Drusilla shook her head wildly. “How kin we bofe have de same kind er dream? I seed de ’oman gwine on, en you seed ’er gwine on. Uh-uh! Don’t talk ter me ’bout no dreams.” The whole matter was settled when Buster John cried out from the next room: “What fuss was that you were making in there last night, squealing and squeaking?” The matter was soon explained to Buster John, and after breakfast the children went out and sat on the big wood-pile and talked it all over. The boy asked a hundred questions, but still his curiosity was not satisfied. All this time the birds were singing in the trees and the wood-sawyers sawing in the pine [Pg 19] logs. Jo-reeter, jo-reeter, jo-ree! sang the birds. Craik, craik, craik, went the wood-sawyers. SWEETEST SUSAN WAKING UP “There are fifty dozen of them,” said Buster John. “Fifty-five thousand you’d better say,” replied Sweetest Susan. “Just listen!” “No needs ter listen,” cried Drusilla. “You’d hear ’em ef you plugged up yo’ years.” Buster John put his knife-blade under a thick piece of pine bark and pried it up to find one of the busy sawyers. The bark was strong, but presently it seemed to come up of its own accord, and out jumped the queerest little man they had ever seen or even heard of except in make-believe story-books. Buster John dropped his knife, and down it went into the wood-pile. He could hear it go rattling from log to log nearly to the bottom. Sweetest Susan gave a little screech. Drusilla sat bolt upright and exclaimed:— “You all better come en go see yo’ ma. I want ter see ’er myse’f.” But there was nothing to be frightened at. The tiny man had brushed the dust and trash from his clothes, and then turned to the children with a good-humored smile. He was not above four [Pg 20] inches high. He had on a dress-coat. Drusilla afterward described it as a claw-hammer coat, velveteen knickerbockers, and silver buckles on his shoes. His hat was shaped like a thimble, and he had a tiny feather stuck in the side of it. “I’m much obliged to you for getting me out of that scrape,” he said with a bow to all the children. “It was a pretty tight place. I stayed out last night just one second and a half too late, and when I went to go home I found the door shut. So I just crawled under the bark there for a nap. The log must have turned in some way, for when I woke up and tried to crawl out I found I couldn’t manage it. I wouldn’t have minded that so much, but just then I saw one of those terrible flat-headed creatures making his way toward me. Why, his head was a sawmill! He was gnawing the wood out of his way and clearing a road to me. I tried to draw my sword, but I couldn’t get it from under me. Then I felt the bark rising. I pushed as hard as I could, and here I am.” “Ax ’im his name,” said Drusilla in an awe-stricken tone. “Ah, I forgot,” responded the little man. “I [Pg 21] know you, but you don’t know me. My name is Mr. Thimblefinger, and I shall be happy to serve you. Whenever you want me just tap three times on the head of your bed.” “Thank goodness! I don’t sleep in no bed,” exclaimed Drusilla. “That makes no difference,” said Mr. Thimblefinger. “If you sleep on a pallet just tap on the floor.” “Please, Mister, don’t talk dat a-way,” pleaded Drusilla, “kase I’ll be constant a-projeckin’ wid dat tappin’, an’ de fus’ time you come I’ll holler fire.” “Don’t notice her,” said Buster John, “she talks to hear herself talk.” “I see,” replied Mr. Thimblefinger, tapping his forehead significantly and nodding his head. “You kin nod,” said Drusilla defiantly, “but my head got mo’ in it dan you kin comb out.” “I believe you!” exclaimed Mr. Thimblefinger, “I believe you!” He spoke so earnestly that Sweetest Susan and Buster John laughed, and Drusilla laughed with them. “You dropped your knife,” said Mr. Thimblefinger. “I’m sorry of it. I can’t bring it up [Pg 22] to you, but I’ll see if I can’t crawl under and get it out.” With that he leaped nimbly from log to log and disappeared under the wood-pile. The children went down to see what he would do. They were so astonished at his droll appearance that they forgot their curiosity. “Is that a fairy, brother?” asked Sweetest Susan in a low voice. “No!” exclaimed Buster John with a lofty air, but not loudly. “Don’t you see he’s not a bit like the fairies we read about in books? Why, he was afraid of a wood-sawyer.” “That’s so,” Sweetest Susan rejoined. “He’s a witch, dat what he is,” said Drusilla. “Shucks!” whispered Buster John. He heard the voice of Mr. Thimblefinger under the wood-pile. “I’ve found it, I’ve found it!” he cried. And presently he made his appearance, dragging the knife after him. He tugged at it until he got it out, and then he sat down on a chip, wiped the perspiration from his eyes, and fanned himself with a thin flake of pine bark no bigger than a bee’s wing. [Pg 23] “Pick me up and let’s go on top of the wood-pile,” said Mr. Thimblefinger after a while. “It’s suffocating down here. Ouch! don’t tickle me, if you do I shall have a fit.” Buster John had lifted him by placing a thumb and forefinger under his arms. “And don’t squeeze me, neither,” the little man went on. “I was cramped under that bark until I’m as sore as a boil all over. Goodness! I wish I was at home!” “Where do you live?” asked Sweetest Susan when they were once more seated on the wood-pile. “Not far from here, not very far,” replied Mr. Thimblefinger, shaking his head sagely, “but it is a different country—oh, entirely different.” Sweetest Susan edged away from the little man at this, and Drusilla stretched her eyes. “What is it like?” asked Buster John boldly. Mr. Thimblefinger reflected a while, and then shook his head. “I can show it to you,” he said, “but I can’t describe it.” “Pick ’im up an’ show ’im to your ma!” exclaimed Drusilla suddenly. “No, no, no!” cried Mr. Thimblefinger, leaping to his feet. “That would spoil everything. [Pg 24] No grown person living in this country has ever seen me. No, no! don’t try that. It would spoil your luck. I wouldn’t be here now if the Dolls’ Grandmother hadn’t begged me to come with her last night. But I’ll come to see you,”—he pointed at Drusilla. “I’ll come often.” “I des said dat fer ter see what you’d say,” protested Drusilla. “You wan’ gwine ter take ’im, wuz you, honey?” This question was addressed to Buster John, who scorned to answer it. “Grown people wouldn’t understand me,” Mr. Thimblefinger explained. “They know a great deal too much to suit me.” “How do you get to your country?” inquired Buster John, who was keen for an adventure. “The nearest way is by the spring,” replied Mr. Thimblefinger. “That is the only way you could go.” “Can I go too?” asked Sweetest Susan. “And Drusilla?” “Oh, of course,” said Mr. Thimblefinger, shrugging his shoulders. “One can go or all can go.” “Do you go down the spring branch?” asked Buster John. FOLLOWING LITTLE MR. THIMBLEFINGER [Pg 25] “No, no,” replied Mr. Thimblefinger. “Below the spring and below the branch.” “Do you mean under the spring?” Sweetest Susan inquired, with some hesitation. “That’s it,” cried Mr. Thimblefinger. “Right down through the spring and under it.” “Why, we’d drown,” said Sweetest Susan. “The spring is deep.” “Well, you’ll ha’ ter ’skuze me,” exclaimed Drusilla. “Dat water’s too wet fer me.” Buster John waited for an explanation, but none was forthcoming. “We couldn’t go through the spring, you know,” he said presently. “How do you know?” asked Mr. Thimblefinger slyly. “Did you ever try it?” He asked each of the children this, and the reply was that none of them had ever tried it. “I put my foot in it once,” said Buster John, “and the water was just like other spring water. I know we can’t go through it.” “Come now!” Mr. Thimblefinger suggested, “don’t say you know. Sometimes people live to be very old and don’t know the very things they ought to know.” [Pg 26] “But I know that,” replied Buster John confidently. “Very well, then,” said Mr. Thimblefinger, pulling out a tiny watch, “did you ever feel of the water in the spring at precisely nine minutes and nine seconds after twelve o’clock?” “N-o-o-o,” replied Buster John, taken by surprise, “I don’t think I ever did.” “Of course not!” cried Mr. Thimblefinger gayly. “You had no reason. Well, at nine minutes and nine seconds after twelve o’clock the water in the spring is not wet. It is as dry as the air we breathe. It is now two minutes after twelve o’clock. We’ll go to the spring, wait until the time comes, and then you will see for yourselves.” As they went toward the spring—Mr. Thimblefinger running on before with wonderful agility—Drusilla touched Sweetest Susan on the arm. “Honey,” said she, “don’t let dat creetur pull you in de spring. Goodness knows, ef he puts his han’ on me I’m gwine ter squall.” “Will you hush?” exclaimed Buster John impatiently. “Watch out, now,” said Drusilla defiantly. [Pg 27] “Ef you gits drownded in dar I’ll sho’ tell yo’ ma.” Fortunately, there was no one near the spring, so Mr. Thimblefinger advanced boldly, followed closely by the children, though Drusilla seemed to hang back somewhat doubtfully. When they arrived there Mr. Thimblefinger took out his tiny timepiece and held it in his hand. The children watched him with breathless interest, especially Buster John, who was thrilled with the idea of having an adventure entirely different from any that he had read of in the story-books. As the little man stood there holding his watch and looking at it intently, the dinner-bell rang, first in the hallway and then in the back porch. The children remembered it afterward. “You all better go git yo’ dinner ’fo’ it git col’, stidder projeckin’ ’roun’ here wid you dunner what,” remarked Drusilla. “Now!” exclaimed Mr. Thimblefinger, “put your hand in the spring.” Buster John did as he was bid, and, to his amazement, he could feel no water. He could see it, but he couldn’t feel it. He turned pale with excitement and withdrew his hand. Then [Pg 28] he put his other hand in, but the result was the same. He plunged his arm in up to the elbow, but his sleeve remained perfectly dry. “Try it, sis,” he cried. Sweetest Susan did so, and boldly declared there was no water in the spring. She wanted Drusilla to try to wet her hand, but Drusilla sullenly declined. Mr. Thimblefinger settled the matter by walking into the spring. “Now, then, if you are going, come along,” he cried. “You have just seventeen and a half seconds.” He waved his hand from the bottom of the spring and stood waiting. A spring lizard ran near him, and he drew his sword and chased it into a hole. A crawfish showed its head, and he drove it away. Then he waved his hand again. “Come on, the coast is clear.” Buster John put his hand in the water again, and this seemed to satisfy him. He stepped boldly into the spring, and in a moment he stood by Mr. Thimblefinger, laughing, but still excited by the novelty of his experience. He called to his sister:— “Come on, sis. It’s splendid down here.” [Pg 29] “Is it wet?” she asked plaintively. “Is it cold?” “No!” replied Buster John impatiently. “Don’t be a baby.” “Come on, Drusilla! You’ve got to come. Mamma said you must go wherever we went,” cried Sweetest Susan. “No, ma’am!” exclaimed Drusilla, with emphasis. “She ain’t tol’ me ter foller you in de fier an’ needer in de water!” But Sweetest Susan didn’t wait to hear. She jumped into the spring with a splash and then stood by her brother very red in the face. “Five more seconds!” cried Mr. Thimblefinger in a businesslike way. Drusilla looked in the spring and hesitated. She could see the water plain enough, but then she could also see Sweetest Susan and Buster John, and they seemed to be very comfortable. “I’m comin’,” she yelled, “but ef you all make me git drownded in dry water I’ll ha’nt you ef it’s de las’ thing I do!” Then she shut her eyes tight, put her fingers in her ears, and leaped into the spring. She floundered around with her eyes still shut, and [Pg 30] gasped and caught her breath just like a drowning person, until she heard the others laughing at her, and then she opened her eyes with astonishment. Suddenly there was a loud, splashing sound heard above and around them and under their feet. “Watch out!” cried Mr. Thimblefinger. “Run this way! The water is getting wet again!” The way seemed to widen before them as they ran, and in a moment they found themselves below the “gum,” or “curb,” of the spring and beyond it. But as they went forward the bottom of the spring seemed to grow and expand, and the sun shining through gave a soft light that was very pleasant to the eye. The grass was green and the leaves of the trees and the flowers were pale pink and yellow. Mr. Thimblefinger seemed to be very happy. He ran along before the children as nimbly as a killdee, talking and laughing all the time. Presently Drusilla, who brought up the rear, suddenly stopped in her tracks and looked around. Then she uttered an exclamation of fright. [Pg 31] Sweetest Susan and Buster John paused to see what was the matter. “Wharbouts did we come in at?” she asked. Then, for the first time, the children saw that the bottom of the spring had seemed to expand, until it spread over their heads and around on all sides as the sky does in our country. “Don’t bother about that,” said Mr. Thimblefinger. “No matter how big it looks, it’s nothing but the bottom of the spring after all.” “But how are we to get out, please?” asked Sweetest Susan. “The same way you came in,” said Mr. Thimblefinger. “I tol’ you! I tol’ you!” exclaimed Drusilla, swinging her right arm up and down vigorously. “Ef you kin fly you kin git out, an’ you look much like flyin’. Dat what you git by not mindin’ me an’ yo’ ma!” “Tut! tut!” exclaimed Mr. Thimblefinger. “I’ll ‘sicc’ the Katydids on you if you don’t stop scaring the little girl. Come! we are not far from my house. We’ll go there and see what the neighbors have sent in for dinner.” Buster John followed him as readily as before, [Pg 32] but Sweetest Susan and Drusilla were not so eager. They had no device, however, and Drusilla made the best of it. “I ain’t skeered ez I wuz. He talk mo’ and mo’ like folks.” So they went on toward Mr. Thimblefinger’s house. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2804/77523.html","bookId":507,"book":{"id":507,"title":"Little Mr. Thimblefinger and His Queer Country","description":"简介： Once upon a time there lived on a plantation, in the very middle of Middle Georgia, a little girl and a little boy and their negro nurse. The little girls name was Sweetest Susan. That was the name her mother gave her when she was a baby, and she was...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2804","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
