{"id":97687,"no":11,"title":"Page 11","content":"Clay wondered how far ahead Graves had gone but did not want to talk to the ghost as long as he could avoid it. Not when Zarin and Munson were both likely monitoring his progress. Calling out for someone who wasn\u0027t there might cause interference he didn\u0027t want. Best to hold off a confrontation as long as possible. Still, the ghost must be far ahead, and he wondered what Graves had encountered. The corridor forked to the right, and there was another steel door. From the other side, muffled by the door, came the distant sound of music. He could barely make out the tune. Clay reached for the knob. A series of clicks sounded to his right, and he turned just in time to see metal plates in the walls sliding aside. Behind them, set into shadowy recesses in the wall, were the mouths of long gun barrels. \"Oh, shi -\" he began. The guns barked, rapid fire, a staccato burst of bullets that exploded from the wall and struck him, one after another. Clay staggered back as the bullets struck him, driving him into a window whose glass cracked but did not shatter on impact. He dropped to his knees, breath coming in gasps. The mouths of those guns plumed smoke like a dragon at rest, and then the metal plates slid back into place, hiding the weapons away. \"Son of a bitch,\" Clay snarled. He clutched at his stomach, forcing himself to keep the guise of Al Kovalik intact. A strange frisson filled the air, but he recognized it immediately. It had become familiar to him of late. The hairs on his arms and the back of his neck stood up, and he raised his eyes to see the ghost of Dr. Graves standing in front of him, one eyebrow arched quizzically. \"That looked like it hurt,\" the ghost observed. Clay laughed. He stood and stretched, ran his hands through Kovalik\u0027s gray hair, then used his shoe to brush aside the rubber bullets that were spread across the floor. Rubber bullets. Of course. No way would Munson risk sending FBI agents in here pretending to be Zarin\u0027s lackeys if there were real bullets in those guns. If the professor started to distrust one of his lackeys, or wanted to set an example, he\u0027d use a stupid trap on them, like some early James Bond villain. Clay wanted to laugh. What did the FBI agents do? They must have fallen down and had to just wait until someone came and dragged their \"corpse\" away. Course, they\u0027re probably thrilled when it happens to them, he thought. It means they can get off of this shit detail and into something else. Some of them probably piss the old lunatic off on purpose, just so they can get terminated. \"Sorry, professor,\" Clay called, assuming there was audio monitoring in the hall as well. \"You\u0027re going to have to do better than that.\" The ghost of Dr. Graves stepped up beside him. \"What are you going to do? It\u0027s a steel door. If you just break it down -\" Clay glanced at him, keenly aware that he was being observed, and that the cameras would not see the ghost. He thought about it. He could play along, explain that he\u0027d been augmented by the government and sent after Zarin, something that might sound somewhat true to both the professor and Munson, to cover up for how strong he was. But what would he buy? A couple of minutes? \"I wanted to do this quietly, but this is taking too long,\" the shapeshifter said, to everyone who was listening. \"So no more screwing around.\" He kept wearing Al Kovalik\u0027s face, just in case Munson was stupid enough not to realize right away that something was very wrong here. But he hauled back and kicked out at the steel door. It crumpled in the middle and tore off of its hinges with a shriek of metal. On the second kick, it caved in completely and clanged to the ground in the corridor beyond. \"This is going to get messy,\" Graves said as he moved past Clay into Professor Zarin\u0027s inner sanctum. \"It\u0027s been messy for sixty years,\" Clay said, not caring who was listening now. \"We\u0027re just trying to clean it up.\" The question was, how long would Munson allow this to go on? Clay knew the answer, too. Right up until the moment that stopping him became more important than keeping up the ruse of Zarin\u0027s captivity, or the moment Clay himself revealed the truth to the old nut job. Clay strode across the bent metal door. It shifted underfoot, clanking against the ground. The ghost walked beside him, soundless as ever. Now that they were inside, the music he\u0027d heard earlier was louder, and he could make out the tune. Cole Porter\u0027s \"Night and Day.\" The melody drifted along the plain, industrial hallway almost eerily, as though it were haunting the place far more than Dr. Graves ever could. \"What the hell is that music?\" Clay asked. The ghost kept pace with him. There were many rooms along the corridor, or at least many doors, all of them closed. A stairwell on the right had been blocked off, though Clay was sure he could get up that way if necessary. \"I don\u0027t know,\" Graves replied. \"I could hear it as I made my way through the place, but it kept moving, as though the source of the music was mobile.\" Clay pondered that a moment. Then he heard two clicks from the ceiling just ahead. Panels slid aside, and a trio of silver tubes lowered on robot arms, their tips glowing with red light like the burning embers on the end of a lit cigarette. \"Oh, hell, what now?\" Burst of red light erupted from the weapons, laser beams that strafed the corridor, passing through the spectral form of Dr. Graves and dancing harmlessly across the chest of Al Kovalik. Clay stared down at the lights that crisscrossed his body. He sighed. \"Come on, this is ridiculous.\" In his mind, he pictured FBI agents falling down and acting as though they\u0027d been burned horribly by the lasers, all for the benefit of a paralyzed mad scientist, watching on his little closed circuit TV. He could barely contain the urge to laugh. \"Let\u0027s go,\" he told Graves. The ghost swept along beside him. They could still hear the music, the final strains of \"Night and Day\" reaching them as they strode down the corridor and came to an elevator. Clay stared dubiously at the elevator before finally pressing the button. \"This should be fun.\" Another tune started playing eerily in the distance. Now it sounded as though it came from above them. This was another Cole Porter tune. \"I\u0027ve Got You Under My Skin.\" The elevator doors slid open almost soundlessly. They stepped inside, the ghost standing so that only half of his body was within the elevator. It looked like he had been cut in two by the doors when they closed. He stuck his head out and then pulled back into the elevator. \"Nothing out there. No one is following,\" he said. \"They\u0027re waiting to see what happens,\" Clay replied. \"They\u0027re going to have a lot of explaining to do, but they\u0027re not sure to whom, just yet.\" The old elevator rattled as it ascended. Clay stared at the numbers atop the door. The options had been limited. Basement. First floor, which they\u0027d started on. Second floor. Third floor. At random, he\u0027d chosen the second, but the elevator didn\u0027t stop there. Clay had to suppress a small chuckle. A hiss filled the elevator, and he glanced around curiously. For a moment he\u0027d thought there might be snakes slithering into the contraption, but instead he saw several vents at foot level, all of them pumping a fine greenish mist into the elevator. He sniffed the air, then glanced at the ghost. Graves seemed only slightly more substantial than the mist, his spiritual form merging with the coalescing mists. \"What do you suppose it is?\" he asked Graves. \"Dry ice?\" \"With a chemical compound,\" Graves replied. \"I\u0027m not sure if it\u0027s meant to be poison, or just to knock you unconscious. You might want to consider feigning unconsciousness to see what happens next.\" Clay shrugged. \"I don\u0027t think so. I\u0027m impatient.\" \"It\u0027s your show,\" the ghost said. \"For the moment.\" The elevator stopped on the third floor, but the doors did not open immediately. For several long minutes Clay stood with his arms crossed, whistling along to the Cole Porter melody, letting whoever might be watching through whatever cameras were in the elevator get a good look at Special Agent Al Kovalik being bored by the poison gas. A vacuum turned on, and in seconds it sucked most of the green mist out of the elevator. The doors opened. The sight that greeted them struck him mute. Just outside the elevator on the third floor stood a fat, ugly orangutan in a butler\u0027s jacket, with a small speaker-box around its neck like gaudy jewelry. The music came from the speaker. The orangutan carried a machine gun, and it was aimed right at Clay. \"Good Lord. Solomon?\" Graves whispered. \"No, come on,\" Clay said, shaking his head. \"You know the monkey?\" \"It can\u0027t be the same one,\" the ghost said quickly. \"But perhaps a descendant of the creature that once served Zarin.\" The orangutan bared its teeth and hissed at Clay - it could not see the ghost - and it stomped its foot, apparently frustrated that he wasn\u0027t paying closer attention to it. The music of Cole Porter ceased abruptly, the song cut off mid-note. The speaker crackled, and they heard labored breathing. \"Welcome, sir,\" buzzed the voice on the crackling speaker. The orangutan studied Clay suspiciously, baring its teeth again. \"Zarin,\" Graves whispered, as though up until this very moment, the ghost had been unable to believe his old nemesis still lived. \"You are both formidable and persistent. How you -\" a hacking cough interrupted, and then Zarin had to take a moment to catch its breath. \"How you managed to survive my defense systems, I shall be very curious to learn. After that, I suspect one of us will soon die.\" Clay raised his hands, staring at the orangutan a moment before turning in a slow circle, letting any cameras get a good look at him. Or, rather, at Al Kovalik. \"I didn\u0027t come here to die, Professor Zarin,\" he said, mustering as much sincerity as he could manage. \"And I haven\u0027t come here to kill you, either. I only want to ask you a few questions.\" There was a pause. The orangutan grunted and shook his machine gun as though in frustration that he hadn\u0027t been ordered to perforate Clay yet. \"Who are you?\" Zarin\u0027s rasping voice asked. He coughed again. Lying would do him no good at this point. And with luck, Agent Munson and any other observers would be so confused wondering what the hell Al Kovalik was up to that it would take a while before it occurred to them that he wasn\u0027t Al Kovalik after all. \"My name is Clay,\" he said. \"And I wanted to ask you a few questions about the murder of Doctor Leonard Graves.\" \"God damn it!\" Zarin screamed, voice shrill and speaker box crackling. \"For the last time, I did not kill Graves. I wish I had. If I knew who did, I\u0027d have killed the killer, tortured him for weeks, stripped his skin, murdered his family in front of his eyes. I wanted him . . .\" Zarin broke down in a fit of coughing that made the orangutan falter, eyes clouding with concern. When it saw Clay watching it, the ape flinched and snarled, raising the machine gun\u0027s barrel and training it on him, finger on the trigger. \". .. for myself,\" Zarin finished, when he was through with the thick, ragged coughing jag. Clay waited a few seconds until it sounded like Zarin had caught his breath. Then, carefully and clearly, he spoke. \"I believe you, Professor. I don\u0027t think you killed Doctor Graves. But I\u0027m trying to find out who did.\" Silence reigned in that impossibly surreal insane stretch of hallway. The elevator doors slid closed suddenly behind him. The ghost of Dr. Graves drifted over toward the orangutan and then started to investigate the rest of that corridor, obviously trying to figure out where Zarin was hiding. \"If you discover the identity of Graves\u0027s killer, you\u0027ll share the information with me?\" Clay nodded without hesitation. \"Absolutely.\" \"Then come in. But know this. If you make any sudden moves, Solomon will pull the trigger. And if you manage to survive being shot a second time, know that he has the strength to tear your head from your shoulders.\" \"Nice to know,\" Clay replied. \"Solomon, bring him to me.\" The orangutan hesitated, then swayed a moment, obviously disappointed that he had not been able to pull the trigger. He gestured with the gun for Clay to walk to the right, and they started off in that direction. \"Bizarre, isn\u0027t it?\" the ghost of Dr. Graves said, falling into step beside him, the orangutan following, gun train at his back. \"Oh, yes,\" Clay said, voice low. \"He\u0027s a madman,\" Graves said, grim and serious. \"The FBI have created this situation that makes him seem a buffoon to you. Don\u0027t allow yourself to forget for a moment that, no matter how insane he is, no matter how ridiculous they have made him, Professor Zarin murdered hundreds of people with his schemes. Once upon a time he was both cunning and vicious. Insane and vicious may be just as deadly a combination.\" \"I\u0027ll keep that in mind,\" Clay whispered. The orangutan poked him in the back with the barrel of the machine gun. Though he knew the gun probably had only rubber bullets or blanks in it, still it was troubling, and annoying. Even real bullets would not kill Clay, but this animal had been badly used. He faulted both Zarin and the FBI. He did not want to have to kill Solomon. \"Turn left,\" Zarin\u0027s rasp came from the speaker box behind them. Clay did as he was told. The ghost of Dr. Graves remained silent beside him, perhaps ruminating over the strange reunion that was about to take place. \"At the end of the corridor you will find a carved cherrywood door. When you reach it, knock.\" With Solomon following behind them, Clay and Graves followed Zarin\u0027s instructions. The corridor was just as featureless and industrial as the rest of the professor\u0027s lair. The cherrywood door - intricately carved with scenes from Victorian times, men driving coaches drawn by many horses, a fox hunt, ladies in beautiful dresses strolling a promenade - was the first elegant thing they had encountered. It was one of the finest pieces Clay had ever seen. He knocked. Behind him, Solomon grunted eagerly, and Clay heard the orangutan shuffling from side to side. With a click, the door swung open to reveal a beautifully appointed room hung with priceless European tapestries and lined with ornately carved bookshelves, upon which sat leather-bound volumes of great age. The high, vaulted ceiling had windows set into it so that there was a turret made almost exclusively of glass to let in the light of the day. Clay thought it ironic, here in Rochester, where the sky was so often gray, as it was today. A light rain had begun to fall, and it trickled down the turret windows in weeping streaks. On the far side of the room was a strange chamber, a kind of electronic womb only two-thirds complete. Computer screens showed readouts that would never have shown up on a modern computer. Monitors revealed images picked up from the cameras spread throughout the complex, both those that were real and those that were being fed by Munson and the rest of her team. Some of the screens showed what appeared to be other rooms in the building, laboratories and steam-driven steel construction. Clay was intrigued. If there\u0027d been time, he would love to have known what sorts of things Zarin had designed for the government in the fifty years of his bizarre captivity. But even a creature who had lived nearly forever did not always have the time he desired. In the midst of that strange electronic cocoon stood a kind of metal creche, and as they entered, rotors whirred and it began to turn in place. The machine reminded Clay of the iron lung of another era, or a strangely fashioned diving bell. It twisted in place, and he continued to cross the room with the ghost at his side and Solomon behind him. Then he was face-to-face with Professor Erasmus Zarin. \"He lives,\" Graves said beside him. Clay did not respond. He could not be sure what he now witnessed could truly be considered living. The only part of Zarin that remained visible was his head. His eyes were sunken, and his flesh pulled taut over his skull like some dried, leathery nut. When he spoke, he had few teeth, and those that did remain were yellowed and rutted. \"Professor Zarin,\" Clay said, nodding in greeting. \"Mister Clay. Whoever you are,\" Zarin said, and he grinned. It was among the most hideous sights Clay had ever witnessed. \"I must say, now that I\u0027ve got you here in person, you look somewhat familiar. Have we met?\" \"Perhaps once, a long time ago,\" Clay replied, unsure if Kovalik and Zarin had ever encountered one another in person. \"Before you ask your questions, I have one of my own.\" \"Shoot.\" The orangutan grunted something and shuffled around beside him, long arms raising and lowering the machine gun eagerly. \"No, Solomon. He did not mean that you should shoot,\" Zarin said patiently. \"It\u0027s only an expression.\" The ugly, orange-furred ape managed to look dejected and sighed. \"What\u0027s become of my operatives?\" The question had an edge of expectation. Clay was about to answer when Graves interrupted. \"Careful,\" the ghost said. \"He\u0027ll have trained them well, or thinks he has. Don\u0027t say you used gas to incapacitate them or that you beat them all yourself. He\u0027s too proud to believe it. He\u0027s angry, but he\u0027s also curious.\" Hesitating a moment, Clay looked at Graves. The ghost stood with his arms crossed, glaring at Zarin in a righteously heroic pose. Clay had never known Graves in life, but he had read of his exploits in the newspapers of the era. Even then, he had been impressed. The man had brought himself through sheer force of will to the pinnacle of humanity\u0027s ability, both physically and mentally. When he was just a wandering specter, brooding as he haunted Conan Doyle\u0027s house, it was easy to forget how significant Graves had been in life. In that moment it seemed he had never died, only gone away for a while. Clay had few choices. He could tell the truth, blowing the FBI\u0027s operation. He could claim to have shapeshifted into a mouse and snuck in, but that might also bring Agent Munson running. \"I\u0027ve developed a process through which I can bend light around me, making me effectively invisible when I wish to be. They didn\u0027t see me until it was too late. Most are unconscious. Three of them are dead.\" \"Which explains why they did not come when you tripped the silent alarms,\" Zarin said. \"Yes, there are many ...\" He had another fit of coughing. A bit of spittle ended up on his chin, but he could not wipe it away, so it remained there. \"There are many strange things about you,\" he went on. \"More technological trickery. You\u0027ll have to tell me how you survived the machine guns at the door. The gas I can imagine, and the lasers - well, if you can bend light -\" \"Exactly,\" Clay agreed. He glanced nervously at the banks of monitors behind Zarin, then at the orangutan, and finally at Graves. \"What\u0027s that you keep looking at?\" Zarin asked. \"The ghost of Doctor Graves.\" Zarin blinked, brows knitting as he processed this response. Then he smiled and uttered a small laugh that became a barking cough. When he had caught his breath he nodded. \"All right. I can see you are impatient. I remind you that Solomon would love dearly to shoot you many times. Hopefully, our discussion remains amiable. It sounds as if we desire the same thing, after all.\" \"The man who killed Doctor Graves.\" \"Precisely,\" Zarin said. He glanced at the orangutan and with a whir of rotors the massive iron sarcophagus that contained his body twisted with him. \"Solomon, behave. Do not shoot unless I give you the word. Do you understand?\" The orangutan grunted and sighed, taking a step back. But he kept the machine gun trained on Clay. \"Now, then, Mister Clay, as much as I would enjoy a longer discourse, I don\u0027t think this is going to take very long. You\u0027re going to ask a simple question or two, and I\u0027m going to give you two regrettably simple answers. Did I have anything to do with the murder of Doctor Graves? As I said, the answer is, no. Do I know anything about his murder or who might have perpetrated it? Again, no. If I did know who killed him, I would have exterminated the usurper decades ago.\" Zarin\u0027s withered head, thrust up from that iron contraption, smiled that hideous grin again. \"What else would you like to know?\" Clay ignored the question. The time had come to stop playacting for Agent Munson\u0027s sake. He glanced at the orangutan, then turned to the ghost of Doctor Graves. Sometimes his clothes appeared to be more modern, but not today. The phantom had crafted his ectoplasmic substance to look precisely the way he had at the height of his notoriety. He wore a long coat, a white shirt, open at the collar, and dark trousers, all tailor-made to accommodate his extraordinary physique. The coat hung open, and Clay could see Graves\u0027s phantom guns in their holsters under his arms. \"Do you believe him?\" he asked. Graves nodded. \"Unfortunately, I do.\" \"Maybe you should take it from here, then,\" Clay said. \"What are you doing?\" Zarin rasped, then coughed to clear his throat. \"Who . . . who are you talking to?\" Clay smiled. \"I told you. The ghost of Leonard Graves.\" \"Are you mocking me? You come into my house and you mock me?\" Zarin demanded, his voice tightening. \"I wouldn\u0027t dream of it.\" Even as he spoke, Clay noticed the specter resolving more fully. The ghost had a greater density when Graves manifested so that humans could see him. Haunting required focus. The strange misty ether that made up the substance of the ghost churned as he moved more fully out of the spirit realm and into the world of flesh and blood. Zarin cried out in surprise and fear. \"Solomon! Kill them!\" Clay braced himself. The orangutan fired. The rubber bullets staggered him, but he managed to remain standing. They passed right through Graves and thunked harmlessly off the walls and tapestries. One of them struck the binding of a particularly old book, the force of the impact destroying it. The orangutan screamed angrily, chattering, and began to stomp one foot in protest. He glanced at Clay and Graves, then at his master, and back again, waiting for a new order. Body useless and withered and trapped in a metal box, Zarin could only stare at the ghost. His breathing was ragged and drawn out, and he shook his head in denial. \"Can it be?\" he whispered. \"It is, Erasmus,\" Graves said. \"It is.\" \"But, then . . . all I have done . . . all I have believed . . .\" the paralyzed old madman said, turning to stare in horror at Clay. \"There is an afterlife?\" \"Ask the ghost.\" Zarin flinched and started another fit of coughing. He stared at Graves and shook his head again. \"The soul exists?\" \"It does,\" Graves replied. \"And I . . . am damned?\" The ghost of Dr. Graves stared at his old nemesis, a lunatic anarchist who had poisoned entire communities, taken hundreds of lives, murdered the children of political figures for his own brand of terror and influence. He crossed his arms. \"Can you imagine any other result of your actions?\" Zarin seemed to muse on this a moment. Then he nodded, taking the news in stride. \"There is no other way around it, then. I must find a way to live forever.\" Clay stared at him. The man really was insane. All too familiar with Zarin, Graves was unphased. \"Erasmus,\" the ghost said, \"what do you know about the murder of Roger Alton Bennett?\" Zarin glared at him with such venom that Clay was sure the man wished Graves alive again so that he could kill him. \"Two things, only. First, I know that I did not kill him. Second, that Mayor Bennett\u0027s murder was the perfect crime. The killer slipped past security, both at the Empire State Building and the mayor\u0027s personal bodyguards, without anyone the wiser. He left not a single clue, not a trace of his passing. And he lifted that enormously fat, slobbering fool off of his feet and hurled him bodily over the side of the observation platform. \"The only man I ever met with the cunning and the stealth and the strength to have committed that murder, sir, was Doctor Leonard Graves. But you, sir, were already dead by then.\" Clay frowned. He\u0027d made the connection as well when Kovalik talked about the fact that the only two crimes Zarin had denied committing were the murders of Graves and Mayor Bennett. But what was Graves getting at? Solomon the orangutan brandished his gun but did not fire again. He danced from one foot to the other, chattering and growing more and more agitated. His eyes were full of confusion and anger. \"Wait a moment,\" the ghost said, moving forward, his long coat swaying as though moved by some unseen wind. \"How did you discover those details of the case? I read all of the accounts of Bennett\u0027s murder, and -\" \"The police were made to look like buffoons,\" Zarin said. \"Do you honestly think such details would have been made public?\" The withered head turned to look at Clay. \"You won\u0027t forget your promise. If you find the killer, you\u0027ll return and tell me his name?\" Before Clay could respond, the room filled with a strange, eerie bit of orchestral music. It was a beautiful melody, a kind of lilting thing that might have been written for a wedding or a funeral. \"Clay,\" Graves whispered. \"Do you . . . please tell me you hear that.\" The music came from the speaker-box that hung around Solomon\u0027s neck. The orangutan stood completely still, no longer chattering or agitated. The confusion was gone from his eyes, replaced by a cold intelligence. \"Zarin,\" Clay began, turning to look at the madman. \"How do you know that music?\" Graves demanded furiously. \"If you know nothing of my murder, how do you know -\" \"It isn\u0027t me!\" Zarin protested, staring wide-eyed at his faithful pet. \"I\u0027m not doing -\" He broke off into a jag of coughing that sent yellow spittle flying from his mouth. Solomon bolted toward Zarin, silent save for the slap of his feet on the floor. Unaccompanied by the usual screech of his species, instead carried along by the music playing from that speaker-box. He leaped into the air. \"No!\" Graves shouted, crossing his arms to reach under each arm and pull his phantom guns. Clay changed shape even as he started after Solomon, turning from Al Kovalik to the towering giant whose cracked, dry, clay-like flesh was his true form. But he was too late. They were both too late. The orangutan wrapped one impossibly powerful, incredibly long arm around Zarin\u0027s throat and twisted. Bones cracked, muscle and skin tore. Had he another moment, he would have torn the lunatic\u0027s head completely off. But Graves fired. Ghost guns barked. Phantom bullets streaked across that room and punched through Solomon\u0027s torso. The orangutan was blown back off of the massive iron contraption that held Zarin\u0027s body and struck the bank of monitors. When he hit the ground, Solomon was dead. Clay ran over to the orangutan, trying not to look at the ruined mess that was Zarin\u0027s head. \"What the hell was that?\" he said. \"Why would the thing go wild like that?\" But even as he asked those questions, he knew there was more to it. He had seen the change in the beast, the cold intelligence there. Either Solomon had not been the simple ape they\u0027d thought, or there had been some other influence here. \"I\u0027ve got a better question,\" Graves said. The ghost floated toward the orangutan\u0027s broken corpse. \"What was this thing? These guns are just as much ghosts as I am, Joe. They shouldn\u0027t have hurt an ordinary animal. They only affect the supernatural.\" Clay stared at the shattered body. \"The impact and the fall did all of the visible damage.\" \"I agree,\" Graves said. \"But you saw the bullets strike. They shouldn\u0027t have touched Solomon\u0027s flesh, but they hit something.\" Clay might have said something more, but claxon alarms began to sound, filling every room. There was banging somewhere nearby, doors being flung open. Any second, Agent Munson and her people would arrive, none too pleased and with a great many questions that Clay and Graves would not feel like answering. \"We\u0027re going to need to rent another car,\" Clay said. As the ghost shimmered and vanished from the room, Clay ran toward the massive metal apparatus that had become Zarin\u0027s coffin. He leaped onto it, crouched, and leaped again, shooting upward. The ancient shapeshifter crashed through the glass turret, fragments scattering all around him. He came down hard on the roof, but even as he landed his flesh shifted and transformed, and a moment later, a tiny sparrow darted away from the sprawling Victorian manse on that hilltop and flew off across the gray skies of Rochester.","sourceLink":"https://allnovel.net/stones-unturned-the-menagerie-3/page-11.html","bookId":2602,"book":{"id":2602,"title":"Stones Unturned (The Menagerie #3)","description":"Storyline: Stones Unturned (The Menagerie #3) The Menagerie at the edge of the abyss. A powerful, demonic force seeks Danny Ferrick, a changeling and the youngest member of the Menagerie. Now Doyle\u0027s team must race to save their friend from falling into the darkness-and taking all of humanity with him.","cover":"https://allnovel.net/images/stones-unturned-the-menagerie-3.jpg","author":"Christopher Golden","type":"Horror","source":"allnovel","link":"https://allnovel.net/stones-unturned-the-menagerie-3.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:28:46 PM"}}
