{"id":3041,"no":20,"title":"chapter 20","content":"If I wanted to order a ring for myself, the inscription I should choose would be: “Nothing passes away.” I believe that nothing passes away without leaving a trace, and that every step we take, however small, has significance for our present and our future existence. What I have been through has not been for nothing. My great troubles, my patience, have touched people’s hearts, and now they don’t call me “Better-than-nothing,” they don’t laugh at me, and when I walk by the shops they don’t throw water over me. They have grown used to my being a workman, and see nothing strange in my carrying a pail of paint and putting in windows, though I am of noble rank; on the contrary, people are glad to give me orders, and I am now considered a first-rate workman, and the best foreman after Radish, who, though he has regained his health, and though, as before, he paints the cupola on the belfry without scaffolding, has no longer the force to control the workmen; instead of him I now run about the town looking for work, I engage the workmen and pay them, borrow money at a high rate of interest, and now that I myself am a contractor, I understand how it is that one may have to waste three days racing about the town in search of tilers on account of some twopenny-halfpenny job. People are civil to me, they address me politely, and in the houses where I work, they offer me tea, and send to enquire whether I wouldn’t like dinner. Children and young girls often come and look at me with curiosity and compassion. One day I was working in the Governor’s garden, painting an arbour there to look like marble. The Governor, walking in the garden, came up to the arbour and, having nothing to do, entered into conversation with me, and I reminded him how he had once summoned me to an interview with him. He looked into my face intently for a minute, then made his mouth like a round “O,” flung up his hands, and said: “I don’t remember!” I have grown older, have become silent, stern, and austere, I rarely laugh, and I am told that I have grown like Radish, and that like him I bore the workmen by my useless exhortations. Mariya Viktorovna, my former wife, is living now abroad, while her father is constructing a railway somewhere in the eastern provinces, and is buying estates there. Dr. Blagovo is also abroad. Dubetchnya has passed again into the possession of Madame Tcheprakov, who has bought it after forcing the engineer to knock the price down twenty per cent. Moisey goes about now in a bowler hat; he often drives into the town in a racing droshky on business of some sort, and stops near the bank. They say he has already bought up a mortgaged estate, and is constantly making enquiries at the bank about Dubetchnya, which he means to buy too. Poor Ivan Tcheprakov was for a long while out of work, staggering about the town and drinking. I tried to get him into our work, and for a time he painted roofs and put in window-panes in our company, and even got to like it, and stole oil, asked for tips, and drank like a regular painter. But he soon got sick of the work, and went back to Dubetchnya, and afterwards the workmen confessed to me that he had tried to persuade them to join him one night and murder Moisey and rob Madame Tcheprakov. My father has greatly aged; he is very bent, and in the evenings walks up and down near his house. I never go to see him. During an epidemic of cholera Prokofy doctored some of the shopkeepers with pepper cordial and pitch, and took money for doing so, and, as I learned from the newspapers, was flogged for abusing the doctors as he sat in his shop. His shop boy Nikolka died of cholera. Karpovna is still alive and, as always, she loves and fears her Prokofy. When she sees me, she always shakes her head mournfully, and says with a sigh: “Your life is ruined.” On working days I am busy from morning till night. On holidays, in fine weather, I take my tiny niece (my sister reckoned on a boy, but the child is a girl) and walk in a leisurely way to the cemetery. There I stand or sit down, and stay a long time gazing at the grave that is so dear to me, and tell the child that her mother lies here. Sometimes, by the graveside, I find Anyuta Blagovo. We greet each other and stand in silence, or talk of Kleopatra, of her child, of how sad life is in this world; then, going out of the cemetery we walk along in silence and she slackens her pace on purpose to walk beside me a little longer. The little girl, joyous and happy, pulls at her hand, laughing and screwing up her eyes in the bright sunlight, and we stand still and join in caressing the dear child. When we reach the town Anyuta Blagovo, agitated and flushing crimson, says good-bye to me and walks on alone, austere and respectable. . . . And no one who met her could, looking at her, imagine that she had just been walking beside me and even caressing the child. The End","sourceLink":"http://novel.tingroom.com/mingren/985/29733.html","bookId":118,"book":{"id":118,"title":"My Life: the story of a provincial","description":"简介： THE Superintendent said to me: I only keep you out of regard for your worthy father; but for that you would have been sent flying long ago. I replied to him: You flatter me too much, your Excellency, in assuming that I am capable of flying. And then...","cover":"http://novel.tingroom.com/file/upload/201403/04/10-57-40-98-1.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/985","creation":"Aug 1, 2019 12:18:17 AM","modification":"Aug 1, 2019 12:18:17 AM"}}
