{"id":3029,"no":8,"title":"chapter 8","content":"On returning home late one evening from Mariya Viktorovna’s I found waiting in my room a young police inspector in a new uniform; he was sitting at my table, looking through my books. “At last,” he said, getting up and stretching himself. “This is the third time I have been to you. The Governor commands you to present yourself before him at nine o’clock in the morning. Without fail.” He took from me a signed statement that I would act upon his Excellency’s command, and went away. This late visit of the police inspector and unexpected invitation to the Governor’s had an overwhelmingly oppressive effect upon me. From my earliest childhood I have felt terror-stricken in the presence of gendarmes, policemen, and law court officials, and now I was tormented by uneasiness, as though I were really guilty in some way. And I could not get to sleep. My nurse and Prokofy were also upset and could not sleep. My nurse had earache too; she moaned, and several times began crying with pain. Hearing that I was awake, Prokofy came into my room with a lamp and sat down at the table. “You ought to have a drink of pepper cordial,” he said, after a moment’s thought. “If one does have a drink in this vale of tears it does no harm. And if Mamma were to pour a little pepper cordial in her ear it would do her a lot of good.” Between two and three he was going to the slaughter-house for the meat. I knew I should not sleep till morning now, and to get through the time till nine o’clock I went with him. We walked with a lantern, while his boy Nikolka, aged thirteen, with blue patches on his cheeks from frostbites, a regular young brigand to judge by his expression, drove after us in the sledge, urging on the horse in a husky voice. “I suppose they will punish you at the Governor’s,” Prokofy said to me on the way. “There are rules of the trade for governors, and rules for the higher clergy, and rules for the officers, and rules for the doctors, and every class has its rules. But you haven’t kept to your rules, and you can’t be allowed.” The slaughter-house was behind the cemetery, and till then I had only seen it in the distance. It consisted of three gloomy barns, surrounded by a grey fence, and when the wind blew from that quarter on hot days in summer, it brought a stifling stench from them. Now going into the yard in the dark I did not see the barns; I kept coming across horses and sledges, some empty, some loaded up with meat. Men were walking about with lanterns, swearing in a disgusting way. Prokofy and Nikolka swore just as revoltingly, and the air was in a continual uproar with swearing, coughing, and the neighing of horses. There was a smell of dead bodies and of dung. It was thawing, the snow was changing into mud; and in the darkness it seemed to me that I was walking through pools of blood. Having piled up the sledges full of meat we set off to the butcher’s shop in the market. It began to get light. Cooks with baskets and elderly ladies in mantles came along one after another, Prokofy, with a chopper in his hand, in a white apron spattered with blood, swore fearful oaths, crossed himself at the church, shouted aloud for the whole market to hear, that he was giving away the meat at cost price and even at a loss to himself. He gave short weight and short change, the cooks saw that, but, deafened by his shouts, did not protest, and only called him a hangman. Brandishing and bringing down his terrible chopper he threw himself into picturesque attitudes, and each time uttered the sound “Geck” with a ferocious expression, and I was afraid he really would chop off somebody’s head or hand. I spent all the morning in the butcher’s shop, and when at last I went to the Governor’s, my overcoat smelt of meat and blood. My state of mind was as though I were being sent spear in hand to meet a bear. I remember the tall staircase with a striped carpet on it, and the young official, with shiny buttons, who mutely motioned me to the door with both hands, and ran to announce me. I went into a hall luxuriously but frigidly and tastelessly furnished, and the high, narrow mirrors in the spaces between the walls, and the bright yellow window curtains, struck the eye particularly unpleasantly. One could see that the governors were changed, but the furniture remained the same. Again the young official motioned me with both hands to the door, and I went up to a big green table at which a military general, with the Order of Vladimir on his breast, was standing. “Mr. Poloznev, I have asked you to come,” he began, holding a letter in his hand, and opening his mouth like a round “o,” “I have asked you to come here to inform you of this. Your highly respected father has appealed by letter and by word of mouth to the Marshal of the Nobility begging him to summon you, and to lay before you the inconsistency of your behaviour with the rank of the nobility to which you have the honour to belong. His Excellency Alexandr Pavlovitch, justly supposing that your conduct might serve as a bad example, and considering that mere persuasion on his part would not be sufficient, but that official intervention in earnest was essential, presents me here in this letter with his views in regard to you, which I share.” He said this, quietly, respectfully, standing erect, as though I were his superior officer and looking at me with no trace of severity. His face looked worn and wizened, and was all wrinkles; there were bags under his eyes; his hair was dyed; and it was impossible to tell from his appearance how old he was—forty or sixty. “I trust,” he went on, “that you appreciate the delicacy of our honoured Alexandr Pavlovitch, who has addressed himself to me not officially, but privately. I, too, have asked you to come here unofficially, and I am speaking to you, not as a Governor, but from a sincere regard for your father. And so I beg you either to alter your line of conduct and return to duties in keeping with your rank, or to avoid setting a bad example, remove to another district where you are not known, and where you can follow any occupation you please. In the other case, I shall be forced to take extreme measures.” He stood for half a minute in silence, looking at me with his mouth open. “Are you a vegetarian?” he asked. “No, your Excellency, I eat meat.” He sat down and drew some papers towards him. I bowed and went out. It was not worth while now to go to work before dinner. I went home to sleep, but could not sleep from an unpleasant, sickly feeling, induced by the slaughter house and my conversation with the Governor, and when the evening came I went, gloomy and out of sorts, to Mariya Viktorovna. I told her how I had been at the Governor’s, while she stared at me in perplexity as though she did not believe it, then suddenly began laughing gaily, loudly, irrepressibly, as only good-natured laughter-loving people can. “If only one could tell that in Petersburg!” she brought out, almost falling over with laughter, and propping herself against the table. “If one could tell that in Petersburg!”","sourceLink":"http://novel.tingroom.com/mingren/985/29721.html","bookId":118,"book":{"id":118,"title":"My Life: the story of a provincial","description":"简介： THE Superintendent said to me: I only keep you out of regard for your worthy father; but for that you would have been sent flying long ago. I replied to him: You flatter me too much, your Excellency, in assuming that I am capable of flying. And then...","cover":"http://novel.tingroom.com/file/upload/201403/04/10-57-40-98-1.jpg","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/985","creation":"Aug 1, 2019 12:18:17 AM","modification":"Aug 1, 2019 12:18:17 AM"}}
