{"id":44484,"no":3,"title":"CHAPTER III.","content":"Meanwhile Dr. Staunton and Dorothy drove quickly to The Grange. It was still very early in the morning, and when they arrived at the great hall door it was opened by Squire Harvey himself. \\n\\n \\n\\n \"That\u0027s right, Dr. Staunton!\" he exclaimed. \"I am so glad you have come. Oh, and I see you have brought a nurse. What a blessing! Now, perhaps,30 you will induce my wife to take some rest. How lucky that you were able to find a nurse in a little place like Whittington!\" \\n\\n \\n\\n \"I am very fortunate indeed,\" replied the doctor in his hearty voice. \"Nurse Fraser has been trained at St. Joseph\u0027s, and happens to be staying at Whittington for a brief holiday. She has most kindly consented to undertake the case until we can get fresh assistance from London.\" \\n\\n \\n\\n \"I will stay as long as I am wanted,\" said Dorothy in her quiet voice. \"If I can be shown to a room for a moment to take off my bonnet and cloak, I will go immediately afterward to the little patient.\" \\n\\n \\n\\n Dorothy\u0027s voice was perfectly cool and calm. She did not speak in the constrained whisper which the poor Squire thought it right to use. There was an everyday tone in her voice which at this moment was absolutely refreshing, and the sympathy in her blue eyes just gave the right quality to the cool tones. \\n\\n \\n\\n The doctor looked at her with unconcealed admiration. \"That girl is one in ten thousand,\" he said to himself. \"She will keep us all on our mettle, I can see, but there is plenty of heart underneath that cool exterior.\" \\n\\n \\n\\n The great luxurious house looked neglected and wretched. Although the father and mother were up, and one or two servants were assisting in the sickroom, the greater number of the servants were still in bed. There was no one to take Miss Fraser to a room, and the Squire looked round him in hopeless bewilderment. \\n\\n \\n\\n Dorothy saw at a glance that she must take matters into her own hands. \\n\\n \\n\\n \"I do not want to trouble you,\" she said. \"I can put my cloak and bonnet in here. I should like to put on my cap and apron before I go upstairs.\"31 \\n\\n \\n\\n She opened a door as she spoke, and went into a room where all the blinds were down, took off her outdoor things, and, taking a cap out of her bag, slipped it over her hair, tied on a white apron, and then stood ready and capable, and fresh and bright, before the Squire and the doctor. \\n\\n \\n\\n \"Now, come straight upstairs with me,\" said the doctor. \\n\\n \\n\\n They went up together; Squire Harvey followed them at a distance. When the doctor reached the first landing, he opened a green baize door, shut it behind him, and walked down a long, cool corridor which led in the direction of the nurseries. \\n\\n \\n\\n \"Now, look here,\" he said, turning and facing Dorothy, \"the great thing that we have both to do is to keep this terrible disease from spreading. One or two of the servants have been with the case from the first; the father and mother have been in and out of the room as freely and unconstrainedly as if the child had only a cold the matter with her; if they are likely to take the infection, the mischief is probably done already; but, on the chance of this not being so, I shall beg of the Squire to come into this part of the house as seldom as possible. And as to Mrs. Harvey, she must be got away; that is your task, nurse. You will allow me to call you nurse, won\u0027t you?\" \\n\\n \\n\\n \"Certainly. Call me Nurse Dorothy; I like that name best. I am called that by the children at St. Joseph\u0027s.\" \\n\\n \\n\\n \"Very well. I am sure you will be a blessing here; but a great deal of tact must be used. The position of affairs is extremely difficult.\" \\n\\n \\n\\n \"I will do my best,\" replied the nurse. The doctor gave her another look of complete satisfaction, and32 they entered the room where the little patient lay between life and death. \\n\\n \\n\\n A small cot had been drawn almost into the center of the room, the blinds were down, there was a sense of desolation, and a heavy smell in the air. \\n\\n \\n\\n \"Who has shut these windows?\" said the doctor in a voice of disapproval. \\n\\n \\n\\n He went straight across the room, drew up one of the blinds, and opened the window two or three inches. A fresh current of air immediately improved the close atmosphere. \\n\\n \\n\\n When he spoke, and when he and Nurse Fraser came into the room, a fair-haired young woman, who was on her knees by the side of the cot, started up suddenly, and gazed at them out of a pair of wide blue eyes. Her cheeks were deeply flushed, her lips were parched and dry. \\n\\n \\n\\n \"Oh, doctor,\" she said, staggering toward Dr. Staunton, \"you have come back. What a blessing! She is asleep now; perhaps she is better.\" \\n\\n \\n\\n The doctor went over and looked at the child. She was a little creature of not more than five years of age. In health she may have been pretty, she probably was; but now, the shadowy little face, the emaciated hands, the hot, dry, cracked lips, were the reverse of beautiful. They were all that was pathetic, however; and Dorothy\u0027s heart went straight out to the baby who lay there in such suffering and weakness. \\n\\n \\n\\n The doctor looked at her, and gave a significant glance toward Mrs. Harvey. \\n\\n \\n\\n Dorothy took her cue at once. \\n\\n \\n\\n \"I have come to nurse your dear little girl, madam,\" she said. \"Dr. Staunton has brought me. I have a great deal of experience, as I am superintendent of one of the children\u0027s wards at St. Joseph\u0027s33 Hospital. I think you may trust your little girl to me; but first of all, let me take you to your room and put you to bed.\" \\n\\n \\n\\n \"Put me to bed!\" said Mrs. Harvey, with a laugh which jarred on everyone\u0027s nerves. \"I have not been in bed for nights. I could not sleep. When the doctor tells me that Freda is out of danger, then I may be able to sleep, but not before—not before.\" \\n\\n \\n\\n \"Whether you sleep or not,\" continued Dorothy, \"you must come and lie down. You are completely worn out, and can do no good whatever to the child in your present condition. While she sleeps it is surely right that you should sleep too. Come, I will promise to call you if you are wanted.\" \\n\\n \\n\\n \"Yes, dear madam, let me entreat of you to go to bed,\" said the doctor. \\n\\n \\n\\n The door was opened at this moment, and the Squire came in. \\n\\n \\n\\n \"Now Elfreda,\" he said, coming up to his wife, \"you will go and take some rest, won\u0027t you?\" \\n\\n \\n\\n She looked from him to the nurse, and from the nurse to the doctor, and then her tired, bright eyes fell upon the little parched face lying on the pillow. \\n\\n \\n\\n \"I know she is going to die!\" she said, with a kind of broken sob. \"I cannot leave her. How can anyone dare to ask me to leave my little child just now?\" Her agitation became more terrible each moment. She was evidently on the verge of hysterics. \\n\\n \\n\\n Dorothy walked straight from the nursery to a sort of dressing-room which lay beyond. There was a small bed there, which was sometimes occupied by the under-nurse. A scared-looking, tired young woman was standing in this room. Dorothy gave her quick directions. \"Get clean sheets, and make this bed up immediately,\" she said.34 \\n\\n \\n\\n The girl started, but looked relieved at having anything explicit to do. She ran off to obey, and Dorothy came back to the sickroom. \\n\\n \\n\\n \"Hush!\" she said, going up to Mrs. Harvey, who was standing shaking from head to foot with dry sobs. \"You must not give way like this; it is very wrong. Remember you have not only yourself to think of.\" She bent forward and whispered a word in the young mother\u0027s ear. Mrs. Harvey started, and with a violent effort controlled herself. \\n\\n \\n\\n \"I see that you must not be separated from your child,\" continued Dorothy—\"at least, not at present. I am having a bed made up for you in the dressing-room, where you will be within call.\" \\n\\n \\n\\n \"Ah, yes, that\u0027s better,\" said the poor lady—\"that\u0027s much better.\" \\n\\n \\n\\n \"Come, then, at once,\" said Dorothy. She held out her hand. Mrs. Harvey crossed the room. She and Dorothy disappeared into the dressing-room. \\n\\n \\n\\n In ten minutes the nurse came back to Dr. Staunton. \"I have undressed her, and she is in bed,\" she said. \"She is very weak, and in a terribly nervous condition; she ought to sleep for hours. Will you prepare a composing draught for her it once?\" \\n\\n \\n\\n \"Yes,\" said the doctor; \"I have brought some medicines with me.\" \\n\\n \\n\\n He went out of the room, and returned in a minute or two with a small dose in a glass. \\n\\n \\n\\n Dorothy took it into the dressing-room. Mrs. Harvey\u0027s tired eyes were shut already. \\n\\n \\n\\n \"Now, you\u0027re to drink this,\" said Dorothy, raising her head slightly. \"Drink this—don\u0027t open your eyes. Trust. Lean on me, if you like. Believe me, that nothing would induce me not to call you if your child were in real danger, but you must sleep now—sleep, and try to believe that all will be well.\"35 \\n\\n \\n\\n \"You comfort me, nurse,\" said Mrs. Harvey. \"You are strong. I somehow believe in you.\" \\n\\n \\n\\n \"You may do so,\" said Dorothy. She bent down and kissed the hot lips. She absolutely forgot that she was only the nurse, and that the tired woman in the bed was a lady of high position. At such a moment as this they were only two women, two sisters. \\n\\n \\n\\n Dorothy waited for a moment to see the sleeping draught take effect, then, drawing down the blind, she left the room, closing the door softly behind her. \\n\\n \\n\\n When she returned to the nursery, Dr. Staunton was bending over little Freda, who had opened her eyes, and was moaning in terrible pain. \\n\\n \\n\\n \"The fever is better,\" he said, turning to the nurse; \"the feverish stage is over, and of course, although we may expect and must guard against complications, there is no reason why the child should not do well as far as that is concerned, but the state of the throat is the real anxiety. I do not like to suggest such a terrible operation as tracheotomy, but if the child does not get relief before long, I fear there is no help for it, and it must be performed.\" \\n\\n \\n\\n Dorothy bent down and examined the little patient carefully. \\n\\n \\n\\n \"I have had a good deal of experience in these cases,\" she said, after a pause, \"and have found \"—she mentioned a certain remedy which could be inhaled—\"work wonders, especially in the cases of children.\" \\n\\n \\n\\n \"I have not heard of it,\" said Dr. Staunton, knitting his brows in anxiety, \"but it sounds simple, and I see no harm in trying it.\" \\n\\n \\n\\n \"It is very simple,\" said Dorothy. \"I should like to try it.\" \\n\\n \\n\\n The child moaned and tossed on her pillow.36 \\n\\n \\n\\n The doctor went out of the room to prepare the medicine which the nurse had recommended, and Dorothy called one of the frightened servants to her side. She told her that she meant to take the child up and walk about the room with her in her arms. \\n\\n \\n\\n \"While she is out of bed I will have the windows closed,\" said the nurse, \"and of course she must be well wrapped up in blankets. She may drop off to sleep again in my arms; anyhow, the change of position and the slight movement will be most refreshing to her. Will you make the bed and put on clean sheets while I am walking about with the child?\" \\n\\n \\n\\n The girl promised to obey. \\n\\n \\n\\n \"It is very infectious, ain\u0027t it, miss?\" she said suddenly. \\n\\n \\n\\n \"It is in God\u0027s hands,\" replied the nurse. \\n\\n \\n\\n There was a sound in her voice, a sort of thrill of strength, which subjugated the girl at once, and made her forget her fears. She obeyed the nurse\u0027s directions with a will; and when, in an hour\u0027s time, Dr. Staunton returned with the remedy which Nurse Dorothy had suggested, he scarcely knew the sickroom. \\n\\n \\n\\n The little child had been laid back again in bed. Her long hair was combed away from her pale, worn face, Dorothy had plaited it neatly; the little face was washed, and looked almost cool compared with its old flushed and weary condition. The bed was neat, and in perfect order, with snowy sheets. The tired little head rested on a cool pillow. Dorothy and the maid had removed the carpets from the floor, and the room was sprinkled with a disinfectant. Two of the windows were open, and a faint sweet breath of air from the garden outside blew into the room. \\n\\n \\n\\n \"Why, nurse, this is an admirable change,\" said the doctor. \\n\\n \\n\\n \"It is necessary,\" replied Nurse Dorothy. \"There is no chance of recovery without fresh air and a cool, quiet, calm atmosphere. I think Rhoda\"—she looked at the servant as she spoke—\"will help me with this case, and I should like as few other people as possible in the room. I have promised Mrs. Harvey to call her if there is any change for the worse in the child, but my impression is she will soon be better.\" \\n\\n \\n\\n \"God grant it!\" said the doctor. \\n\\n \\n\\n \"What a blessing a good, properly-trained nurse is!\" he thought, as he went off to the room which had been prepared for him, and where he was glad to take an hour or two of much-needed rest. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/1497/44719.html","bookId":662,"book":{"id":662,"title":"A Girl in Ten Thousand","description":"简介： The speaker was a middle-aged woman. She was lying on a sofa in a shabby little parlor. The sofa was covered with horse-hair, the room had a faded paper, and faded chintz covered the shabby furniture. The woman\u0027s pleading words were emphasized by her...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1497","creation":"Aug 1, 2019 12:19:07 AM","modification":"Aug 1, 2019 12:19:07 AM"}}
