{"id":44488,"no":7,"title":"CHAPTER VII.","content":"Effie\u0027s little room faced the east. She never drew down her blind at night, and the sun was shining all over her face when her mother came in the next morning to call her. \n \n Mrs. Staunton, standing in her nightdress in the middle of the room, called Effie in a shrill voice.65 \n \n \"What in the world is the matter?\" said her daughter, sitting up, and pushing back her hair from her eyes. \n \n \"What I feared,\" said Mrs. Staunton. \"I am not going to break down; don\u0027t think it for a minute. I am as well as possible.\" She trembled all over as she spoke. There was a purple spot on one cheek, the other was deadly pale. A blue tint surrounded her lips. \"I am perfectly well,\" continued Mrs. Staunton, breathing in a labored way. \"It is only that I have got a bit of a—— Your father is ill, Effie. He has got it—the—dip—dip—diphtheria. He is almost choking. Get up, child; get up.\" \n \n \"Yes, mother,\" said Effie. \n \n She tumbled out of bed. Her pretty cheeks were flushed with sleep; her eyes, bright and shining, turned toward the eastern light for a moment. \n \n \"Oh, mother,\" she said, with a sudden burst of feeling, \"do, do let us keep up our courage! Nothing will save him if we lose our courage, mother.\" \n \n \"We won\u0027t,\" said Mrs. Staunton; \"and that\u0027s what I came to speak about. He must have good nursing—the very best. Effie, I want you to get Miss Fraser to come here.\" \n \n \"Miss Fraser! But will she leave little Freda Harvey?\" \n \n \"She must leave her—the child is completely out of danger—anyone can nurse her now. She must leave her and come here, and you must go and fetch her. Your father may lose his life in the cause of that little child. There is not a moment to lose—get up, Effie. You can go at once to The Grange. Go, go quickly and bring Dorothy Fraser. We none of us can nurse him as she will. She will do it. He has been murmuring in his sleep about her, about something she did for little Freda, clasping his66 throat all the time and suffocating. One glance showed me what ailed him when I awoke this morning. He has a hard fight before him, but he must not die—I tell you, child, your father must not die!\" \n \n \"No, no, mother! God will spare him to us,\" said Effie. Tears dimmed her eyes, she got quickly into her clothes. \n \n \"Now, I will go,\" she said. \"I will bring Dorothy back with me.\" \n \n \"If there is any difficulty,\" said Mrs. Staunton, \"if she hesitates for a moment, you must remember, there is only one thing to be done.\" \n \n \"Yes, mother; what do you mean?\" \n \n \"You must offer to nurse Freda Harvey instead of her—do you understand?\" \n \n \"And I am not to come back to father when he is ill?\" said Effie, aghast. \n \n \"That is not the point,\" exclaimed Mrs. Staunton. \"The only thing to be considered is, what will save him, and you and I, and our feelings, are of no consequence. His life is so valuable that no sacrifice is too great to keep it. Go, child, go. If you can come back, come—if not, stay.\" \n \n \"And who will manage the children—they ought not to remain in the house.\" \n \n \"Don\u0027t worry about the children. Get Dorothy as quickly as possible.\" \n \n Effie buttoned her dress and pinned on her hat, and then went out on the landing. \n \n \"Where are you going, child? Why don\u0027t you go downstairs?\" \n \n \"I must kiss father first.\" \n \n \"What folly!—why should there be this delay?\" \n \n \"I won\u0027t be a minute.\" \n \n Effie turned the handle of the bedroom door, and went softly into the room. Her father was lying on his back—there was a livid look about his face. Great beads of perspiration stood on his brow. His eyes were closed. He did not see Effie when she came into the room, but when she bent down and kissed his forehead, he opened his eyes and looked at her. He said something which she could not distinguish—he was too hoarse to make any words articulate. \n \n \"I am going for Dorothy,\" she said, with a smile,—\"she\u0027ll soon make you better,—good-by. God bless you—father. I love you—father, I love you.\" \n \n His eyes smiled at her, but his lips could not speak. \n \n She went quickly out of the room. \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/1497/44723.html","bookId":662,"book":{"id":662,"title":"A Girl in Ten Thousand","description":"简介： The speaker was a middle-aged woman. She was lying on a sofa in a shabby little parlor. The sofa was covered with horse-hair, the room had a faded paper, and faded chintz covered the shabby furniture. The woman\u0027s pleading words were emphasized by her...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1497","creation":"Aug 1, 2019 12:19:07 AM","modification":"Aug 1, 2019 12:19:07 AM"}}
