{"id":38269,"no":24,"title":"XXIII. THE MEXICANS’ CHARGE","content":"The devoted little band makes ready to measure swords with their enemies—The bugle blows as the Sabbath breaks—The Mexicans charge the Alamo with two thousand five hundred men—A terrible slaughter outside the walls—The death of Colonel Travis—The scaling of the parapets, and the death struggles in the fort—Bayonets, bowie-knives, and clubbed rifles—Where Davy Crockett fell fighting to the last—The silver bugle blows again—The end has come—The slaughter of the prisoners—The after scenes—“Thermopyl? had its messenger of defeat; the Alamo had none.” It was radiant spring-time when Davy leaned upon his rifle and looked across the Texas plains and over the hills that rose to the north and east of the valley. He had read the grim orders for the expected assault as he might have read an unimportant order of the day. No comments had been heard as the proclamation passed from hand to hand. On the walls of the Alamo and the tops of the flanking stockades were fourteen guns loaded[301] with grape and slugs, ready to be fired at a moment’s notice. Every man was supplied with bullets and a full powder-horn. Some of the garrison were Mexicans, fighting for the common cause. These were armed with rifles carrying bayonets. They were not marksmen or experts in rapid firing, but they knew their fate if defeated, and were relied upon to resist to the last. A hush fell over all the land as the sun went down, touching with tender beauty the early verdure of the plains. In the cottonwoods finches sung their vesper songs, and the redbirds piped their plaintive calls. The melody of the thrushes came from the willows along the river’s banks, so sweet and far-away that Davy seemed to stand once more by the winding current of the Obion. The odor of cedar was in the air as the people of the city prepared their evening meals over fires of the fragrant wood. The softened tones of the vesper bells came from the Mission towers, full of an infinite peace and calm, and the day merged into night, and the stars came out, and the birds were still. So ended the 5th of March at San Antonio de Bejar. [302] The fitful sleep of the garrison came to an end when word was passed around that activity had begun in the camp of the Mexicans. The sound of horses’ feet was heard as the men of Sesma’s cavalry command turned out for service at three o’clock, before the first sign of day appeared. By four o’clock the tramp of moving hosts had ceased, and in the bright moonlight the glitter of bayonets showed that the forces that were to make the assault had taken the positions assigned them. Every American took his place upon the walls of fort or stockade, and saw that the priming of his gun or rifle was renewed. As the first glimmer of dawn came out of the east, the fateful winding of a bugle broke the stillness of the Sabbath morn. Voices were faintly heard in stern command, and then, like the sweep of a tidal wave, mingled with the earthquake’s sullen roar, the unleashed hosts of Santa Anna swarmed against the massive walls of the Alamo. When near the fort they were met by a storm of grape and slugs and the bullets of the riflemen. Two thousand five hundred Mexicans took part in[303] the first attack, advancing in three columns against the eastern, western, and northern sides, but they recoiled in confusion before the withering fire. Colonel Duque was killed as he approached the northern wall, and his men were thrown into terrified confusion. Upon the other sides of the fortress the attack was at first repelled; but behind the shrinking men who faced the first fire came the forces in reserve, until they outnumbered the defenders fifteen to one, and at last they reached the walls. Finding it impossible to scale them, the whole assault was directed against the stockade upon the northern side. Here the walls were comparatively low, and the ladders could be used. In the meantime the men within were loading and firing with desperate energy. The slaughter was terrible, and two or three hundred Mexicans had fallen before the partial shelter of the walls was gained. Here they were safe from the fire of the cannon overhead, but at so close a range almost every bullet found a victim. Only the knowledge that others were hurrying to their support kept them from fleeing for their lives. [304] Travis had been killed at the northwestern angle of the parapet, while working one of the cannon defending a small breach that had been made. After repeated attempts, General Amador succeeded in scaling the walls at this point, and a swarm of Mexicans followed him. Under Morales and Mi?on, the outer defenses of the stockades had been occupied, the cannon captured, and the defenders forced to retire to the main part of the Alamo and the long barracks attached. The Texans soon fired their last shots, then swung their clubbed rifles against the mobs that pressed upon them with bayonet and sword. As these drove the Americans against the walls, their keen-edged knives were drawn for a moment of desperate conflict before they fell dying one by one. Bowie was lying in an almost helpless condition in an upper room of the barracks, but when the enemy rushed in upon him he shot down several with his pistols before he was despatched. Bonham, who had been one of the most active of the garrison, had been killed while loading a cannon. Crockett had retreated with the others into the plaza in which the long two-story[305] barracks opened. The last that is known about him is that his mutilated body was seen near the main walls of the Alamo by Mrs. Dickinson, whose life was spared by the Mexicans. The story of his capture behind a pile of dead men, whom he had killed before being overpowered, is not true. Like most of his companions, he died in his tracks, disdaining to ask for quarter. A few of his comrades are known to have attempted escape by hiding in the barracks, an act which was entirely justifiable, for the fighting was over, and longer resistance was useless. The Mexicans stood at last within the walls of the Alamo, surrounded by the dead, with no hand raised against them. The conflict had been terrible, but was soon over. It was yet an hour before the rising of the sun upon the plains when the calm, sweet notes of a bugle sounded from the midst of drifting smoke above the captured fort. The bands without were hushed, and the fierce Degüello was no longer needed to incite to fury and frantic assault. The Lone Star flag that had been so proudly raised upon Washington’s Birthday lay trampled in the[306] dust, and in its stead the tri-color of Mexico flaunted in the morning breeze. There was a rolling of drums as the victorious Santa Anna appeared before the open gates of the Alamo. Five men who had secreted themselves in the barracks were brought before him. Their captors asked what disposition should be made of the prisoners. For answer Santa Anna wheeled his horse until his back was turned. Disregarding all the tenets of military discipline, the guard about him broke ranks and fell upon the captives like a pack of wolves, and in a moment’s time the last of the defenders of the fort had gone to his final accounting. It has been generally supposed that Crockett and a few others were massacred by Santa Anna’s command; but the best evidence now disproves this, though it confirms his savage cruelty in ordering the shooting of Colonel Fannin and his men, afterwards captured at Goliad. Five hundred dead and dying Mexicans met the gaze of the victorious commander-in-chief as he rode into the fort; and the total losses of the Mexican army were between fifteen hundred and[307] sixteen hundred men. Almost two hundred Americans lay among the ghastly harvest they had reaped. The bodies of all the Americans, with the possible exception of Bowie, whose wife was a sister of the wife of Santa Anna, were at once laid upon a pile of wood and brush and burned. The Mexicans’ own dead were buried, and preparations were made for the extermination of the last vestige of rebellion. In February, 1837, Colonel Seguin removed the ashes and charred bones of the funeral pile of the defenders of the Alamo, and buried them near the fort. In after years a small monument was set up in the entrance to the State House at Austin, built from fragments of the stockade against which the tide of battle swept with such fury on that quiet Sabbath morn. Upon this monument are the names of one hundred and sixty-six men who met death before the bugle rang above the old church walls. Among the first is the name of Davy Crockett. The Alamo is now cared for by the Society of the Daughters of the Republic of Texas. The[308] patriotic ladies who compose this Society have done everything possible to restore and preserve the historic building. The four-foot walls are intact, and the roof has been rebuilt. A custodian is always in charge, and many objects of interest have been collected and placed on exhibition. Pictures of Crockett, Travis, Milam, Burleson, and others are hung upon its walls. The most characteristic of all the pictures of Davy Crockett is one painted by John L. Chapman in 1834, while Crockett was in Congress. It shows him as he looked as scout and hunter, and reveals in every feature a kindly and sympathetic nature, liable to strong emotion and sensitive to every slight. Another picture, now in the Alamo, is that of Crockett in more fashionable attire. The two are by different artists, but are so alike in almost every lineament that each is a guaranty for the other. For the use of the first of these pictures, the publishers are indebted to the Daughters of the Republic of Texas. The death of Davy Crockett and the other brave men who fell in the Alamo could not be made the occasion for interference by the United States, but[309] thousands of Americans took up their cause, and it was not long before the Stars and Stripes were lowered in salute before the battle-scarred fortress, as our army passed by on its way to Mexico. What visions came to Davy Crockett in the smoke and flame of his last fight, we do not know; but the love of his own, like an attendant angel, stood by him as he met his enemies one by one; and when the last ray of light had faded from his soul, the glory of his sacrifice grew out of the ghastly ending of a life unspoiled by false ideals, and never unfaithful to those who shared his humble home. The soft airs of the Southland play about his resting-place, and the thrush and robin sing their plaintive songs above his dust. While the laurels glorify the Limestone’s rugged hills, and the mayflowers scent the Nolichucky’s wilderness, he sleeps unmindful of their fragrance and beauty, or the singing of the birds. But his memory cannot die; his epitaph is upon the walls of the Alamo— THERMOPYL? HAD ITS MESSENGER OF DEFEAT: \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2858/79019.html","bookId":1209,"book":{"id":1209,"title":"David Crockett","description":"简介： The story of David Crockett stands apart from all others in our historya nebulous collection of traditions about a great array of facts. To the unnumbered thousands to whom his name is familiar he is often as unreal as the hero of a medi?val romance...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2858","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
