{"id":65103,"no":17,"title":"Page 17","content":"The irritating thing was that I knew he was telling the truth. Without me he definitely would be lost, and I couldn’t help feeling an annoying sense of responsibility for him. For a time I toyed with the thought of taking him with me. This, though, was plainly out of the question. He had been enough of a liability in his native land. In Italy, in Yugoslavia, in Turkey, he would be a fatal burden. When I had recovered the gold, when I had dispatched the mysterious documents to the proper place, when I had somehow cleared myself with the Irish police and the Turkish police and the American authorities and whatever other national bureaus had developed an interest in me, then I could find some way to take care of Esteban. In the meanwhile he would survive. He was too mad to get into serious trouble. And so we boarded a train to Paris, Esteban and I. We got on the train at Foix, and I got off it at Toulouse and took another train east to Nîmes and a bus northeast to Grenoble. M. Gerard Monet must have already received the cryptic note I’d sent him from Ireland. I went to his home. His wife said that he was at his wine shop-it was not quite noon-and told me how to find him. I walked to the shop and introduced myself as Pierre, who had written from Ireland. He put a finger to his lips, walked past me to the door, closed it, locked and bolted it, drew a window shade, and took me behind the counter. He was a dusty man in a dusty shop, his hair long and uncombed, his eyes a brilliant blue. “You have come,” he said. “Tell me only what I must do. That is all.” “My name is-” He held up one hand, corded with dark blue veins. “But no, do not tell me. A man can repeat only what he knows, and I wish to know nothing. My father was of the movement. My great-grandfather fell at Waterloo. Did you know that?” “No.” “For all my life I have been of the movement. I have watched. I have listened. Will anything come of it? In my lifetime? Or ever? I do not know. I will be honest with you, I doubt that anything will come of it. But who is to say? They tell me the days of Empire are over for all time. The glory of France, eh? But I do what there is for me to do. Whatever is requested, Gerard Monet will perform what he is capable of performing. But tell me nothing of yourself or your mission. When I drink, I talk. When I talk, I tell too much. What I do not know I can tell no one, drunk or sober. You understand?” “Yes.” “What do you require?” “Entry to Italy.” “You have papers?” “Perhaps.” “Pardon?” “I don’t know whether or not they’re valid. I’d rather slip across the border, if that can be arranged.” “It can. It can, and with ease.” He picked up the telephone, put through a call, talked rapidly in a low voice, then turned to me. “You can leave in an hour?” “Yes.” “In an hour my nephew will come to drive you to the border. There are places where one may cross. First we shall lunch together.” “You are kind.” “I know how to serve. The Monets have always known how to serve. Do you go to Corsica? No, do not tell me. I have never been to Corsica. Let us have lunch.” We had rolls and cheese and some rather good wine. Afterward Monet poured cognac for each of us. We raised our glasses to toast the eternal memory of Napoleon Bonaparte and pray for a speedy restoration of his line to power in France. I made my brandy last. He had three more before his nephew arrived. “A grand occupation for such as me,” he said, waving a hand to include the shop. “Eh? A wine shop for a drunkard, a dusty shop for a man with impossible dreams. You will not tell them that I drink?” “No.” “You are a good man. I drink up all the profits. I talk when I drink. Tell me nothing.” “All right.” The nephew was my age, dark, sullen, handsome, and uncommunicative. He drove a Citroën. The car was silent, the ride soft, the countryside beautiful under a hot sun. The nephew did not ask me who I was or why I wanted to go to Italy. He did not seem to care. “The old man is crazy,” he said once. I did not answer. “He thinks he’s Napoleon.” “Oh?” “Crazy,” he said. And that was all he said for the rest of the ride. He stopped the car finally at the side of the road-a narrow road winding through hilly country. From here, he said, I would have to walk cross-country. He pointed the way through the fields and asked me if I had something with me to cut the wires. I did not. He grumbled, rummaged through the trunk of the Citroën, and found a pair of wire-cutting pliers. “I don’t suppose you’ll be able to return these,” he said. “They’re not cheap, you know. Every time the old bastard calls me, it costs me money. He must think I’m made of it.” I offered to pay him for the pliers. He said they cost twenty-five francs, a little over five dollars. This was obviously untrue, but I paid the money, and he left without a word. I walked about a mile through the countryside to the six-foot barbed-wire fence dividing France and Italy. I looked in both directions and saw no sign of life. I cut out a large section of the fence and crawled through. It seemed overly simple. I got to my feet in Italy, flipped the pliers back into France, and looked around vacantly, waiting for whistles to blow or sirens to sound or bullets to whine overhead. Nothing happened. I turned, finally, and walked on into Italy. A farmer in a light pickup truck drove me as far as Torino, where I caught a train to Milan. With Mussolini gone, the Italian trains no longer ran on time. Mine was an hour late leaving Torino and lost another hour on the way to Milan. I left it in Milan and thought about buying a car. I had no contacts in Italy that lay anywhere near my route to Udine near the Yugoslav border. A secondhand Fiat would cut the distance and might be safer. I could drive without stopping and no one would notice my face, as might happen on a train. But did one need a driver’s license to purchase a car? I was not sure. I found a dealer’s lot on the northern outskirts of Milan and looked at several cars. The cheapest was 175,000 lire, a little less than three hundred dollars. I could afford to pay for it in Swiss francs. I presented my Swiss passport as identification, and the dealer took it into the shop with him. I patted the little Fiat on the fender. With luck, I thought, the car could be a tremendous asset. I would have the registration and the passport and I might be able to drive it right across the Yugoslav border without any difficulty. That would cut down the risk considerably, leaving me only one tricky border to cross-the one into Turkey. And by that time I would be able to think of something. I was sure of it. But the dealer seemed to be taking an unduly long time with my passport. I walked over to the office and saw him crouched over his desk, talking on the telephone. There was something furtive in his manner. I moved closer and caught a few words. “Swiss passport…Henri Boehm…the one you are looking for, the fugitive-” I ran like a thief. In downtown Milan I picked up a copy of the Paris edition of the New York Herald Tribune and learned what all the fuss was about. The passports were a dead issue, worthless now, a liability. Someone had connected me to the tall man who had been shot down in Dublin. The paper didn’t spell it out but explained that the fugitive Evan Michael Tanner had stolen important government documents in Ireland and was thought to be making his escape through continental Europe. They knew I had left Dublin under the false American passport and knew I had changed money under the British one at Madrid. In an alleyway I destroyed the other two passports. I broke the cases open, tore the printed matter into scraps, and tossed the scraps to the winds. I was about to do the same to the remaining passport, the one for Mustafa Ibn Ali, but it seemed to me that there might be a use for it sometime, perhaps in Yugoslavia. One never knew. The newspaper article described the black attaché case I was carrying, so I had to rid myself of that, too. I didn’t know where to throw it away, so I sold it in a secondhand store for a handful of lire. The money was scarcely enough to matter, but I was getting to the point where money mattered, even small amounts. The damned car dealer still had my Swiss francs, and I was starting to run out of cash. I buttoned under my shirt the packet of papers I had taken from the attaché case and walked to the railroad station. Would they be watching it? I had no doubt that they would. They had had a call from the car dealer, and I had confirmed his suspicions by bolting like a bat out of hell. I stopped on the way and bought a change of clothes, a hat, heavy shoes. At least I no longer matched the description the dealer would have given them. I caught a train for Venice without incident. I bought my ticket on the train, locked myself in my compartment and read the rest of the Herald Tribune. The sky was dark by the time we reached Venice. I was glad of this. I felt safer in the dark, less conspicuous. Another bus took me northeast to Udine. I felt as though I had been traveling forever, moving endlessly and to no great purpose. Plane, bus, train, hay wagon, train, bus, car, truck, train, bus-I wondered why I hadn’t flown from Dublin to Venice in the first place and cut out all the island-hopping in between. The answer, of course, was that I had wanted to get out of Dublin as quickly as possible. But I seemed to be doing everything wrong. I had put them on my trail all over again by stupidly flashing the Swiss passport in Milan. They probably realized I was on my way to Turkey. If nothing else, they obviously knew I was in Italy and would be able to guess that I was heading east. And all I could do in the meanwhile was run from burrow to burrow like a frightened rabbit. I had the names of some Croat exiles in Udine, but I couldn’t be sure they would help me. And if they did, what then? They could sneak me into Yugoslavia, and I could shuttle around from one band of Balkan conspirators to another. This time, though, I would be doing it all behind the Iron Curtain, where every third conspirator was an agent for the secret police. Marvelous. I wished, suddenly, that I could sleep. Just close my eyes and let everything go blank for a while. I had been running too long, I realized. I needed some time to let loose. That was one of the troubles with being able to live without sleep. Because one never got sleepy, one now and then failed to realize that one was tired. I had been going without any real rest since…when? Since the few hours of relative rest in the attic hideaway at the Dolans’ house in Croom. And how long ago was that? It was hard to calculate. It seemed as though the whole span of time was only one endless day, but that wasn’t right. I’d been at the Dolans’ one night, spent the next night skulking around Dublin waiting for the plane, spent the night after that waiting for Vicente to cut my throat in the hay cart, and now it was night again. No wonder it was beginning to get to me. Ljudevit Starcevic had a small farm outside of Udine. He grew vegetables, had a small grape arbor, and kept a herd of goats. When an independent Yugoslavia had been carved out of the Austro-Hungarian Empire at the close of the First World War, he had joined Stefan Radic’s Croat Peasant Party. In 1925 Radic abandoned separatism and joined the central government. Starcevic did not. He and other Croatian extremists fought the central regime. Some were killed. Starcevic, who was very young at the time, was imprisoned, escaped, and eventually wound up in Italy.","sourceLink":"https://allnovel.net/the-thief-who-couldn-t-sleep-evan-tanner-1/page-17.html","bookId":2336,"book":{"id":2336,"title":"The Thief Who Couldn\u0027t Sleep (Evan Tanner #1)","description":"Storyline: The Thief Who Couldn\u0027t Sleep (Evan Tanner #1) Evan Michael Tanner hasn\u0027t slept in more than a decade—not since a small piece of battlefield shrapnel invaded his skull and obliterated his brain\u0027s sleep center. Still, he\u0027s managed to find numerous inventive ways to occupy his waking hours. Tanner is a card-carrying member of hundreds of international organizations, from the Internal Macedonian Revolutionary Order to the Flat Earth Society—not because he believes in their myriad lost causes, he\u0027s simply a joiner by nature. Besides, it gives him something to do. The Russians think Tanner is a CIA operative on a covert mission. The CIA is certain he\u0027s a Soviet agent. Actually, he\u0027s in Turkey pursuing a fortune in hidden Armenian gold. But Tanner\u0027s up for anything, including a little spycraft, if it helps him reach his big payday. And if need be, he\u0027ll even start a small revolution . . .","cover":"https://allnovel.net/images/the-thief-who-couldn-t-sleep-evan-tanner-1.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-thief-who-couldn-t-sleep-evan-tanner-1.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:56:28 AM"}}
