{"id":65105,"no":19,"title":"Page 19","content":"I stayed the night in Kragujevac with an old widow who had a son in America. She told me that much and nothing more, asked no questions, and told me to keep away from the windows. I did this. In the morning, before the sky was light, I left her house and walked south on a road out of town. The woman had no transportation available and was unable to arrange any for me, so I took the road south, picked up a ride with a farmer as far as the little town of Kraljevo, and there caught up with a neat relay network that took me step-by-step down to Djakovica. Nine men combined to carry me a little over a hundred miles. Each took me ten or twelve or fifteen miles on horseback, turned me over to yet another man, and returned home. By nightfall I was in Tetovo in Macedonia. And there I felt safer than ever. The whole province of Macedonia is peppered with revolutionaries and conspirators. The ghost of the IMRO, the Internal Macedonian Revolutionary Organization, had never been entirely laid. In the years before the First World War the IMRO had its own underground government in the Macedonian hills, ran its own law courts, and dispensed its own revolutionary justice. Its spies and agents ran amok throughout the Balkans. And, though generations have passed since the cry of “Macedonia for the Macedonians” first echoed through that rocky would-be nation, the IMRO lives on. It may be found in every hamlet of Macedonia. It is listed even now on the U.S. attorney general’s list of subversive organizations. Of course I am a member. In Tetovo I stopped at a café for a glass of resinous wine. I had gradually changed my clothing in the course of my pilgrimage through Yugoslavia, and I was now wearing the same sort of garb as most of the men in the café. I received a few glances, perhaps because I was a stranger, but no one paid much attention to me. I drank the wine, asked directions to the address I had, and headed for Todor Prolov’s house. It was a smallish hut at the end of a drab and narrow street off the main thoroughfare, on the southeast edge of downtown Tetovo. Broken panes of glass in the casement windows had been patched with newspaper. Two dogs, thin and yellow-eyed, slept in the doorway and ignored me. I knocked at the door. The girl who opened the door had an opulent body and blonde hair like spun silk. She held a chicken bone in one hand. “Does Todor Prolov live here?” She nodded. “I wrote him a letter,” I said. “My name is Ferenc.” Her eyes, large and round to begin with, now turned to saucers. She grabbed my arm, pulled me inside. “Todor,” she shouted, “he is here! The one who wrote you! Ferenc! The American!” A horde of people clustered around me. From the center of the mob, Todor Prolov pushed forward to face me. He was a short man with a twisted face and unruly brown hair and a pair of shoulders like the entire defensive line of the Green Bay Packers. He reached out both hands and gripped my upper arms. When he spoke, he shouted. “You wrote me a letter?” he bellowed. “Yes.” “Signed Ferenc?” “Yes.” “But you are Tanner! Evan Tanner!” “Yes.” “From America?” “Yes.” A murmur of excitement ran through the group around us. Todor released my arms, stepped back, studied me, then moved closer again. “We have been waiting for you,” he said. “Ever since your letter arrived, all of Tetovo has been in a state of excitement. Excitement!” Again his hands fastened on my biceps. “And now the big question,” he roared. “Are you with us?” “Of course,” I said, puzzled. “With IMRO?” “Of course.” He stepped forward and caught me in a bear hug, lifting me up off my feet and leaving me quite breathless. He set me down, spun around, and shouted at the crowd. “America is with us!” he roared. “You have heard him speak, have you not? America will aid us! America supports Macedonia for the Macedonians! America will help us crush the tyranny of the Belgrade dictatorship! America backs our cause! America knows our history of resistance to oppression! America is with us!” Behind me the streets had suddenly filled up with Macedonians. I saw men holding guns and women with bricks and pitchforks. Everyone was shouting. “The time has come!” Todor shrieked. “Raise the barricades! March on the homes of the tyrants! Root out and destroy the oppressors! Give no quarter! Rise and die for Macedonia!” A child rushed by me holding a bottle in his hand. There was a rag stuffed into the neck of it. The rag smelled of gasoline. I turned to the girl who had opened the door for me. “What’s happening? What’s going on?” “But of course you know. You are a part of it.” “A part of what?” She hugged me with joy. “A part of our triumph,” she said. “A part of our finest hour. A part of-” “What?” “Our revolution,” she said. Chapter 13 The street had gone mad. There were so many guns going off that they no longer sounded like gunfire. It was too much to be real, more like a fireworks display on the Fourth of July. To the north a row of houses was already in flames. A police car roared past us, and men dropped to their knees to fire at it. One shot burst a tire. The car swung out of control, plowed off the street into a shop front. The police jumped out, guns ready, and the men in the street shot them down. The girl was at my side. “They’re crazy,” I said. “They’ll all be killed.” “Those who die will die in glory.” “They can’t stand off an army-” “But America will help us.” I stared at her. “You said America would help. You told Todor-” “I told him I was behind his cause. That is all.” “But you are with the CIA, are you not?” “I’m running from the CIA.” “Then, who will help my people?” “I don’t know.” Two blocks down the street a canvas-topped truck careened around the corner and pulled to a stop. Uniformed troops spilled from it. Some of them had machine guns. They crouched at the side of the truck and began firing into the crowd of Macedonians. I saw a woman cut in two by machine-gun fire. She fell, and a baby tumbled from her arms, and another blast of gunfire tore the child’s head off. Shrieking, a young girl heaved a homemade cannister bomb into the nest of soldiers. The gunfire ceased. Two of the soldiers staggered free of the truck, clutching at their wounds, and a ragged volley of shots from the rooftops cut them down. Sirens blared to the north. The whole town was alive with the fury of the uprising. The girl was still at my side, but I wasn’t paying attention to the words she said. Revolution- I had told Starcevic there would be no revolution. Not in his beloved Croatia, not anywhere. I was, after all, no revolutionary, no agent provocateur. I was simply a treasure hunter headed for a cache of gold. But it was I who had sparked this, and it was, after all, a revolution. Mills bombs, Molotov cocktails, barricades thrown up in the streets, bursts of gunfire, the screams of the wounded-these were not sound effects, not bits of the backdrop of a movie, but the sounds of a popular rising, a revolution. When one has long been conditioned to respond in a certain fashion to a certain set of stimuli, one does not think things out. One reacts and glories in it. I reacted. A police van had piled up at the barricade closing the south end of the block. A trio of uniformed troopers had taken up positions behind the barricade and were firing at us. Two had rifles, one a Sten gun. I grabbed up a brick from the ground and heaved it at them. It fell far short. Their fire came our way. I ran forward, toward the source of the firing. A youth ran beside me, pistol in hand. More shots rang out. The youth dropped, moaning, wounded in the thigh. I grabbed up his pistol. I kept running. The Sten gun swung around and pointed at me. I fired without aiming and was astonished to see the policeman spill forward, a massive hole in his throat. His blood washed out of him and coated the piled-up bedsteads and furniture of the improvised barricade. One of the other police fired at me. The bullet brushed my jacket. I ran toward him and shot him in the chest. The third one shoved a rifle in my face and pulled the trigger. The gun jammed. I clubbed him aside and kicked him in the face. He was reaching for another gun when I lowered the pistol and blew off the back of his head. A cheer went up behind me. The rebels had fired a public building in the center of town. I grabbed up the Sten gun of the first cop I had killed and pushed forward with the crowd. For four blocks almost every house we passed was in flames. In the middle of the city, we pressed in around the police station. A small force of police and soldiers had barricaded themselves inside the stationhouse. They were firing into the crowd from the windows and lobbing grenades down amongst us. I saw the girl who had been at Todor’s house putting a torch to the front door. The flames leaped. A band of men were heaving Molotov cocktails into a second-story window. The blaze spread in several places, and the crowd dropped back out of range to let the fire have its head. We shot them down as they came out. There must have been two dozen of them, not counting the ones who never got out the door. In the public square, Todor proclaimed the Independent and Sovereign Republic of Macedonia. “Historic birthright” and “sever the shackles of Serbian oppression” were phrases that kept recurring. It was, all in all, a good proclamation. He paused once, and part of the crowd, thinking he had finished, began to cheer, but he picked up again, and the cheering died down. Then he did finish the speech, and a ground swell of exhilarated applause burst from the mass of people, and for a thin fraction of a moment I actually thought the revolution would succeed. The Independent and Sovereign Republic of Macedonia, while unrecognized by the other independent and sovereign nations of the earth, did endure in fact for four hours, twenty-three minutes, and an indeterminate number of seconds. Thinking back, I cannot help viewing this lifespan as an enormous moral victory. It was at least five times the duration I would have predicted for the Republic, although it fell far short of Todor’s expectations-he had announced at one point that Free Macedonia would endure, as was claimed for the Third Reich, for a minimum of a thousand years. Those four hours were as active as any I had ever spent. After the police station fell to us, we still had to conduct mop-up operations throughout the town. It was necessary, for example, to dispatch a delegation to rouse the mayor from his bed, take him out of his house, and hang him from the tree in front of his front porch. It was also necessary to rush the town’s small Serbian quarter and massacre the inhabitants thereof. I was fortunate enough to miss out on both the hanging and the pogrom, however. During this stage of the revolution I was cloistered with Todor and Annalya. Annalya was his sister, with blonde hair and huge eyes and hour-glass body. The three of us-a troika? a triumvirate? a junta? no matter-were to plan the course of the revolution. “You shall not return to America,” Todor insisted. “You shall stay here forever in Macedonia. I will make you my prime minister.”","sourceLink":"https://allnovel.net/the-thief-who-couldn-t-sleep-evan-tanner-1/page-19.html","bookId":2336,"book":{"id":2336,"title":"The Thief Who Couldn\u0027t Sleep (Evan Tanner #1)","description":"Storyline: The Thief Who Couldn\u0027t Sleep (Evan Tanner #1) Evan Michael Tanner hasn\u0027t slept in more than a decade—not since a small piece of battlefield shrapnel invaded his skull and obliterated his brain\u0027s sleep center. Still, he\u0027s managed to find numerous inventive ways to occupy his waking hours. Tanner is a card-carrying member of hundreds of international organizations, from the Internal Macedonian Revolutionary Order to the Flat Earth Society—not because he believes in their myriad lost causes, he\u0027s simply a joiner by nature. Besides, it gives him something to do. The Russians think Tanner is a CIA operative on a covert mission. The CIA is certain he\u0027s a Soviet agent. Actually, he\u0027s in Turkey pursuing a fortune in hidden Armenian gold. But Tanner\u0027s up for anything, including a little spycraft, if it helps him reach his big payday. And if need be, he\u0027ll even start a small revolution . . .","cover":"https://allnovel.net/images/the-thief-who-couldn-t-sleep-evan-tanner-1.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-thief-who-couldn-t-sleep-evan-tanner-1.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:56:28 AM"}}
