{"id":65107,"no":21,"title":"Page 21","content":"“For the same reason.”\n “I don’t understand.”\n “Todor had to die in battle,” she said. “And you must escape. It would be bad for us if the enemy captured you. This way you are our American, mysterious, romantic. The government will know you were here with us and will be unable to lay hands on you. And our people will know you will return some day and resume the fight. So you must escape.”\n She accompanied me to the farmhouse but refused to go to Bulgaria with me. She felt she would be safe where she was and that she could not leave her people. Her place, she said, was with them. And, in that farmhouse, while other men drank bitter coffee in the kitchen, she asked me to go upstairs with her and make love to her. In a passionless voice she at once offered herself and insisted that her offer be accepted.\n It was both loving and loveless-and better than I had thought it would be. Until the moment our bodies joined, it was impossible to think of the act, let alone experience anything resembling desire. But then I was astonished by the urgency of it all. And I was more astonished yet at her cries at a moment of what might have been passion. “A son! Give me a son for Macedonia!”\n I did my best.\n It took quite a while to reach Sofia, but the city held refuge for me. My host, a priest in the Greek Orthodox Church, lived on the Street of the Tanners, appropriately enough. I did not point out this coincidence to him since I did not tell him my name. I was sent to him by an IMRO member who was also a member of an organization called the Society of the Left Hand. I had heard of this group before but knew very little about it. It seemed to be a quasi-mystic band organized centuries ago to preserve Christianity in the Ottoman Empire. For a time, in the late nineteenth century, they may have engaged in terrorism for profit. I had read that the group had long since ceased to exist, but one learns to disregard such incidental intelligence. Like Mark Twain’s obituary, the death notices of extremist groups are often somewhat premature.\n And yet, my lack of knowledge of the Society of the Left Hand greatly inhibited conversation. I dared not espouse any particular political viewpoint lest it should develop that Father Gregor did not happen to be in sympathy with that point of view. My IMRO friend had scheduled an eight-hour stay at Father Gregor’s for me, after which time I would be able to ride south toward the Turkish border with another friend of his. The first hours passed easily enough. Father Gregor’s housekeeper produced an excellent shashlik, and his cellar yielded up a commendable bottle of Tokay. Afterward we sat in his parlor and played chess. His game was better than mine, so much so that we stopped after three games; it was clearly no contest.\n As he returned the chessmen to their box he asked if I by any chance spoke English. “I would welcome the chance to speak that language,” he said. “One requires frequent practice to remain fluent in a tongue, and I have little opportunity to practice English.”\n “I have some English, Father Gregor, and would be pleased to converse with you in English.”\n “Ah, it is good. More wine?” He refilled our glasses. “In an hour we shall have a treat. Or perhaps I should say that you will share my daily treat, if it is your pleasure. At nine o’clock there is a broadcast of Radio Free Europe. Do you often hear it?”\n “No.”\n “For my part, I never miss it. And just as that program concludes there is a broadcast of Radio Moscow, also beamed to Sofia. This is another program I always enjoy hearing. Do you listen to Radio Moscow?”\n “Not often.”\n “Ah. Then, I think it shall be a treat for you. The juxtaposition of these two radio programs is a delight to me. One is dashed from one world to another, and neither of the two worlds reflected has much in common with the world one sees from Sofia. Is this your first visit to Sofia?”\n “Yes.”\n “It is a pity you cannot spend more time here. The city has charms, you know. One thinks of Bulgaria as a crude simple nation of peasants milking their goats and eating their yogurt and living a hundred years or more. One never calls to mind the striking architecture of Sofia or the busy commercial life in the city. I was born on a farm not ten miles from this city and have spent most of my life here. But I have traveled a bit. During the war it was wise to travel. One perhaps was better off if one did not spend all one’s time in one place. Do you have difficulty understanding my English?”\n “No. You speak very well.”\n “I was in London for a time. Also in Paris and for a short time in Antwerp. When the time seemed propitious I returned to Sofia. Many of my closest associates have questioned my decision to return here. Why, they wondered, would I elect to spend the remainder of my life in a solemn and often joyless Balkan city? Perhaps you ask yourself the same question.”\n I attempted something noncommittal.\n “One discovers,” he said, “that one place is rather like another. And that one’s own home, one’s ancestral home, has something special to recommend it. You go to Turkey from here, is that correct?”\n “Yes.”\n “To any particular city?”\n “Ankara.”\n “Ah, yes. I was there once many years ago, but I remember very little of the city. My own position then was similar to yours now in Sofia. I had the opportunity to visit the city but lacked the chance to tour it, to see something of its sights. It is unfortunate, I would say, that the involved man has no time for sightseeing. While the tourist, on the other hand, can examine areas at his leisure but cannot relate them to himself because they are not truly involved in his pattern of life. Would you agree?”\n I agreed. And I thought specifically of my tour of Andorra, traversing the tiny republic beneath a load of hay. The involved man-\n By the time we were ready to listen to Radio Free Europe, I still had learned no more of the nature of the Society of the Left Hand. We sat in his library, surrounded by four walls of books, while he fiddled with the dials of an antiquated short-wave radio. I thought of the U.S. television commercials, peasant families huddled together in the darkness, the radio pitched low, the listeners keeping one ear on the voice of freedom and the other ear tuned in anticipation of a knock on the door, a visit from the secret police, a beating, a forced confession, a bullet fired point-blank into the back of the neck. In our comfortable chairs, sipping our large glasses of Tokay, that particular commercial seemed violently unreal.\n Throughout the program Father Gregor kept giving vent to peals of unrestrained laughter. He was a tall man, a heavy man, and when he laughed, the walls shook. “Marvelous,” he would roar. “Extraordinary,” he would explode. And the room would rock with his laughter.\n Two news items, both delivered fairly late in the hour, were of special interest to me.\n The first was a straightforward report on the revolution in Macedonia. “Do not despair, freedom-lovers of Bulgaria,” said the intense voice of a young woman. “The spirit of independence cannot be ground out beneath the heel of communism. Last night patriots in Macedonia rose up in open rebellion against the so-called People’s Republic of Yugoslavia. Fighting with sticks and stones, men and women and children stood up on their feet and cast off their chains, fighting against insuperable odds to free themselves from the shackles of economic slavery.” The voice dropped an octave. “And once more the brute force of the tyrant crushed the spark of rebellion. Once more the Beast of Budapest trampled on the hope of a people. Once more blood ran red in the streets of yet another country wedged in the shadow of the Russian bear.” The voice reasserted itself. “Europeans, Free Europeans, take heart from the example of these Macedonian heroes! The soil of liberty is fertilized anew by their blood! They have not died in vain! Your day-the day of all mankind-shall come!”\n Father Gregor laughed and laughed.\n Later in the same program I heard my own name mentioned. I almost dropped my wine glass. This time the speaker was male.\n “Yet another act of Russian provocation has threatened the peace of the world,” the announcer proclaimed. “This time the crime is espionage, a black art that seems to have been invented in Moscow. The criminal band operates under the leadership of Evan Michael Tanner, an American citizen corrupted by the communist lies and tainted by communist bribery. Through stealth and subterfuge this traitor to the peace of the world managed to get hold of the complete dossier of the British air and coastal defenses. The key defense secrets of this gallant European nation are even this minute moving behind the Iron Curtain toward the tyrant’s home base in Moscow.\n “Yet there is still hope for mankind. Tanner, it has been learned, is on his way to a small city in northwestern Turkey, there to make contact with his superiors. Will he be intercepted? Free men everywhere, peace-loving men throughout the world, can only pray that he will…”\n There was a further denunciation of Russian espionage, but I barely heard it. My head was spinning, my palms dotted with sweat. I stole a look at Father Gregor. He seemed too absorbed in the program to pay any attention to me. He was laughing frequently now.\n British air and coastal defenses-but how could they have been stolen in Ireland? And if they had been stolen in England, why on earth would the tall man have run to Ireland with them? And for whom had he been working? And why? And-\n Gradually, as the announcer shifted to another point, I managed to work out at least a part of it. The only way it made any sense was that the Irish themselves had stolen the British plans. Then the tall man or some other member of his gang had filched the plans a second time in Dublin. That would explain why it was the gardai rather than some branch of British Intelligence that had picked up the tall man’s trail, arrested him, and eventually shot him dead.\n Who he might be and who might be his employers were still unanswerable questions. But they did not matter tremendously. What did matter was that I seemed to have a load of dynamite in my little leather satchel. It scarcely concerned me where the plans had come from or where they were supposed to be going. But the whole world now knew that I had those plans and the whole world also knew, somehow, that I was on my way to Balikesir, and this was a matter of considerable concern.\n How they had found out was another good question. Any of several persons could have told them-Kitty, the Dolans, even Esteban, although I couldn’t recall mentioning my precise destination to him. For that matter, I had left a map of Turkey in my apartment, with Balikesir circled in bright blue ink. By now it was reasonable to assume that my apartment had been searched a dozen times over, and the bright blue circle on my map would certainly have been noticed by someone. I didn’t think Kitty would have talked and I couldn’t picture the Dolans as informers, but of course if Esteban had known anything I’m sure he would have run off at the mouth to the first person who caught hold of him.\n The Radio Moscow program had an added kicker. Nothing about the British plans this time, nothing at all. But there was a brief report that went something like this:\n “Continuing their program of harassment, agents of the American Central Intelligence Agency once again launched a desperate attempt to undermine the security of one of the peace-loving socialist republics of Eastern Europe. This time our sister nation of Yugoslavia was the victim. Playing on racial friction and decadent economic drives, CIA operatives under the direction of Ivan Mikhail Tanner sparked an abortive fascist coup in the Province of Macedonia. With tons of smuggled weapons and the tactics of Washington-trained terrorists, these social fascists were able to overcome the efforts of the fine people of several Macedonian villages. Through the efforts of people in the surrounding territory, and with the aid of crack government troops from Belgrade, the Washington-inspired uprising was quickly brought under control and the wave of terror ended forever.” \n","sourceLink":"https://allnovel.net/the-thief-who-couldn-t-sleep-evan-tanner-1/page-21.html","bookId":2336,"book":{"id":2336,"title":"The Thief Who Couldn\u0027t Sleep (Evan Tanner #1)","description":"Storyline: \n The Thief Who Couldn\u0027t Sleep (Evan Tanner #1) \n Evan Michael Tanner hasn\u0027t slept in more than a decade—not since a small piece of battlefield shrapnel invaded his skull and obliterated his brain\u0027s sleep center. Still, he\u0027s managed to find numerous inventive ways to occupy his waking hours. \n Tanner is a card-carrying member of hundreds of international organizations, from the Internal Macedonian Revolutionary Order to the Flat Earth Society—not because he believes in their myriad lost causes, he\u0027s simply a joiner by nature. Besides, it gives him something to do. \n The Russians think Tanner is a CIA operative on a covert mission. The CIA is certain he\u0027s a Soviet agent. Actually, he\u0027s in Turkey pursuing a fortune in hidden Armenian gold. But Tanner\u0027s up for anything, including a little spycraft, if it helps him reach his big payday. And if need be, he\u0027ll even start a small revolution . . .\n \n","cover":"https://allnovel.net/images/the-thief-who-couldn-t-sleep-evan-tanner-1.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-thief-who-couldn-t-sleep-evan-tanner-1.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:56:28 AM"}}
