{"id":13135,"no":23,"title":"CHAPTER XXIII Where the Pig Went","content":"\"Now show me how you start the jolly old fire,\" requested Burgoyne on the following morning. Already the two officers had bathed in the sheltered creek, revelling in the warm water in spite of the fact that not so very long before they had been in dire peril in the self-same element. They recognized that there is a vast difference between \"being in the ditch\" involuntarily and taking a swim simply for the health-giving pleasure it affords. And now, feeling fresh and in the best of spirits, they were about to prepare the morning meal. \"Right-o,\" agreed Peter, and proceeded to uncover a quantity of tinder-like wood from beneath an inverted bucket, where it had been placed to shelter it from the heavy dew. \"I\u0027m not very keen on the two pieces of wood method. I prefer drilling—like this.\" He produced a strip of bamboo about two feet in length, with both ends rounded off. Arranging the tinder in a hollow piece of wood, he inserted one end of the bamboo, bending the latter by the pressure of his chest, which he protected by means of a hollow shell. Then, rapidly twirling the bow-shaped bamboo much after the fashion of a centre-brace, he persevered with the operation. Presently, thanks to the friction, a faint smoke arose from the heap of tinder. Gently blowing, he still continued to revolve the bamboo until the soft, dry wood burst into a tiny flame. \"That\u0027s the trick!\" he exclaimed triumphantly. \"It takes a lot of doing, I admit; but with a little practice one soon learns the knack of it. Now for breakfast: cold boiled fowl, taro bread and eggs roasted in hot ashes—how will that do?\" \"Scrumptious!\" declared Burgoyne. \"You must be rated chef of this establishment, old son.\" Mostyn shook his head. \"It\u0027s all very fine when you do it for fun,\" he said. \"When it\u0027s a matter of routine it\u0027s deadly monotonous. I vote we take turns.\" \"I might poison the lot of us,\" objected Alwyn. \"I\u0027ll risk that as far as I\u0027m concerned,\" declared Peter cheerfully. \"Now, then, let\u0027s search for eggs. There are dozens under the bushes. This island\u0027s like Covent Garden or Leadenhall Market. It\u0027s a wonder to me how these birds get here. Few of them seem to be able to fly.\" With keen appetites, the four castaways sat down to breakfast. Deftly Peter extricated the eggs from the warm embers and distributed them amongst the hungry crew. Then in the height of his culinary triumph came the anti-climax. Every egg was addled. \"We\u0027re not running a parliamentary election, Mr. Mostyn,\" declared Hilda, when the high-flavoured relics of by-gone days were consigned to the sea. \"Aren\u0027t we, though?\" rejoined Peter. \"Burgoyne was proposing the election of a chef. I\u0027m disqualified straight away, so that\u0027s all right.\" \"I believe you knew they were duds,\" said Alwyn. \"\u0027Pon my word, no,\" replied Mostyn emphatically. \"Another time you might try the water-test,\" suggested Hilda. \"If they float in fresh water, then they are either stale or bad. New laid ones ought to sink.\" \"Thanks,\" said Mostyn. \"I\u0027ll try and bear that in mind. Now, Miss Vivian, cold fowl? Sorry there\u0027s no bread sauce, and I\u0027ve mislaid the salt.\" \"We\u0027ll try and obtain salt by evaporation,\" suggested Burgoyne. \"How about that bully beef with the fowl? It won\u0027t keep, and it\u0027s a bit salt, too.\" Breakfast over, Alwyn proposed a thorough exploration of the island—a task interrupted on the previous day when Mostyn was found. Burgoyne had great ideas about keeping all hands busy. Provided they had plenty to do to occupy their minds, they would be happy enough. He had a horror of \"slacking\", contending that it was the first step towards discontent and misery; and the possibility of each of the castaways being at loggerheads with everyone else was to be sternly discouraged. Accordingly the four set out on their tour of investigation. The men went barefooted. Their footgear was worn out, but, as Alwyn remarked, they might just as well get accustomed to do without as wait. Hilda\u0027s shoes were badly worn. She had left the secret base wearing canvas deck-shoes already rather dilapidated. At Mostyn\u0027s suggestion they tore strips of canvas, which the girl bound round her shoes. This, she found, wore remarkably well, but Mostyn promised to find an early opportunity of making her a pair of leather sandals, for which he intended using the leather from the oars. Burgoyne took with him his revolver. He had carefully dried it after its immersion. The cartridges, being well greased and guaranteed damp-proof, should be serviceable, but his reserve of ammunition was too small to justify a trial. Mostyn carried a coil of rope that had once been the boat\u0027s halliard. Beyond remarking that it might be useful, he gave no reason for this apparently unnecessary encumbrance. Jasper Minalto took his improvised fish-spear, which quickly proved to be of use in clearing a path through the brush-wood. Following a narrow glade which had been recently traversed by a number of hoofed animals whose tracks were fairly well defined, the quartette walked in single file, Burgoyne leading, followed by Peter; then Hilda and Minalto bringing up the rear. Their first objective was the hillock Burgoyne had previously noticed from farther along shore. It stood well above the palm tops, rising abruptly on three sides and shelving gradually towards the east. A few coco-palms grew on the southern side, but elsewhere it was covered with comparatively short grass. Arriving at the summit, the explorers found that the island was but a mile or so broad but nearly twice that distance in length, the land on the north side forming a long tapering neck averaging but a hundred yards in width, with the whole of the neck thickly wooded. It was on this strip of land that Burgoyne, Hilda, and Minalto had come ashore. The reef entirely surrounded the island, although there were numerous gaps affording a communication between the open sea and the lagoon. It was on the edge of one of these channels that the life-boat struck. Had she been a couple of yards more to the south\u0027ard she might have driven ashore on the island with very little damage, or none at all had she been swept into the small harbour where Mostyn was fortunate enough to land. As the tide was almost at its ebb all the outlying reefs were exposed, disclosing a veritable death-trap for any vessel unfortunate enough to become entangled in the intricate shoals. At high-water the reefs surrounding the smaller island that Burgoyne had previously noticed were awash, only the mere hummock crowned by three palm trees being visible. \"There\u0027s one disadvantage that this island has and which Porfirio\u0027s island hasn\u0027t,\" observed Burgoyne. \"In calm weather a boat can land here almost anywhere. Properly we ought to maintain a look-out station on this hill, especially if the pirates do attempt to find us.\" \"Do you think they will?\" asked Hilda. \"They may try,\" replied Alwyn. \"That\u0027s almost a foregone conclusion. But they\u0027ll think we\u0027ve tried to make Honolulu, which is the nearest known civilized town in this part of the Pacific. If so, they\u0027re right off their course.\" \"Why didn\u0027t we?\" inquired the girl. \"Head wind and adverse current almost the whole distance,\" said Burgoyne laconically. \"I\u0027m not questioning your seamanship, Mr. Burgoyne,\" Hilda hastened to add, imagining by the Third Officer\u0027s somewhat brusque reply that he thought she had cast aspersions upon his sound judgment. \"I never had the slightest idea that you did, Miss Vivian,\" rejoined Alwyn earnestly. \"I ought to have explained. Briefly, in a sailing craft the shortest distance between two ports is not always the quickest passage. One must take prevailing winds and currents into consideration But to get to the look-out question. I think we ought to make a point of having someone up here four times a day, just to make sure that no suspicious craft is bearing down on the island. And there\u0027s another question: will Porfirio make use of that seaplane of his to try and spot us?\" \"That\u0027ll be awkward,\" remarked Peter \"unless we can collar the blighter when she\u0027s sitting.\" \"Not much use that,\" said Alwyn. \"None of us could fly the thing even if we did capture it. No, I don\u0027t want to see that seaplane again except through the sight of an anti-aircraft gun. Now, suppose we push on.\" \"Aren\u0027t we going to give the island a name, Mr. Burgoyne?\" inquired Hilda. \"It\u0027s the usual thing, I believe.\" \"Right-o,\" agreed Alwyn. \"I propose we leave the selection of a name to you.\" \"Then why not \u0027Swan Island\u0027,\" said the girl. \"From here the outline looks awfully like a swan with an exaggerated neck.\" \"So it does,\" agreed Peter. \"Done it in one, Miss Vivian.\" \"An\u0027 thet rock out along,\" said Minalto. \"Ut ought to have a name. They three trees make un look like an ole man-o-war. How\u0027d \u0027Man-o-war Rock\u0027 suit?\" \"The very ticket,\" agreed Burgoyne. \"So that\u0027s that.\" Descending the hill, the four castaways proceeded in the direction of the west side of Swan Island. Here the coco-palms were thinner in point of number, but the scrub was if anything denser than on the eastern side. Suddenly there was a commotion in the undergrowth, and three or four fat porkers dashed frantically across the path. \"Pork for supper!\" shouted Peter. In his excitement he hurled the coil of rope at the animals, without doing the slightest good. But before the last pig had disappeared in the brushwood Jasper hurled his spear with tremendous force. The aim was good, and the nail-shod tip struck the luckless animal just behind the fore-quarters. Squealing horribly; the pig rolled over on its side but before Jasper or anyone else could secure the prize it recovered its feet and dived under the thick scrub. Reckless of the consequences and loth to lose the brute, Minalto crawled under the spiky bushes, while Burgoyne and Mostyn made their way round the patch of scrub in order to try to cut off the wounded animal\u0027s retreat. Hilda, holding her hands to her ears to shut out the piteous squeals, remained on the path. The two officers were baulked in their attempt, for on the remote side of the belt of scrub the ground rose steeply to a height of about twenty feet, running right and left in an almost unbroken wall of soft rock. \"The brute can\u0027t climb that,\" declared Alwyn. \"You stop here, Peter, old son. I\u0027ll work round to the other side and we\u0027ve got him cold. How goes it, Jasper?\" he shouted to the intensely excited and exasperated Minalto, whose efforts to follow the pig were considerably hampered by hundreds of aggressive thorns. \"\u0027E be gone down to girt big hole, sir,\" replied Minalto breathlessly. \"Don\u0027t \u0027ee take on. Us\u0027ll get \u0027un.\" \"A hole, did you say?\" inquired Burgoyne. \"Go slow then.\" \"Ay, ay, sir,\" replied Jasper; then after a pause he added: \"Could you be comin\u0027 here, sir? If so, would \u0027ee bring my spear?\" Alwyn agreed to the suggestion rather hesitatingly. In default of suitable spare clothing, he was reluctant to sacrifice his already ragged garments to the attentions of the spiky thorns. Recovering the weapon that had wounded the pig, he crawled under the thicket until he rejoined Jasper. Sounding with the pole, Minalto found that the floor of the hole or cave was level, but the extreme reach of the spear failed to find the extremity of the hollow. The while the squeals of the porker were growing fainter and fainter, showing that it was on the point of death. \"What\u0027s doing, old son?\" inquired Mostyn from afar. \"Come and see, my festive,\" replied Burgoyne. \"No more of your \u0027wait and see\u0027 business. Bring your rope with you.\" Undergoing more than his fair share of laceration, Peter crawled under the brushwood. The three men crouched in the dim light that filtered through the thicket, and silently contemplated the mouth of the cave. Minalto looked upon it as a place where fresh pork was to be obtained and that soon; Peter, in the light of romance, tried to conjure up visions of the long-gone buccaneers; Alwyn, in view of possibilities, regarded it and its approach as a hiding-place should Black Strogoff and his satellites succeed in finding the castaways. \"May as well see the thing through,\" observed Burgoyne. \"It\u0027s no use hanging on to the slack.\" \"Certainly, sir,\" agreed Minalto, and proceeded to secure the rope round his waist by means of a bowline. \"Du you pay out, sir, \u0027n case there\u0027s a big drop.\" Prodding the ground with the haft of his spear, Jasper cautiously entered the cave. For the first eight or ten paces the sides of the tunnel-like entrance were fairly regular and less than a yard apart. Then he found that the cave expanded both in height and width, until it was impossible even with the spear to reach from one wall to the other. Standing upright, Minalto found that he could just touch the roof with his extended hand. Guided by the faint squeals, Jasper followed the right-hand wall until his knees came in contact with what he thought to be a large ledge of rock. Groping with his hands, he discovered that the obstruction was a large box with a hinged lid. Instantly all thoughts of the pig vanished from the man\u0027s mind, and again the long-dormant strain derived from his wrecking and smuggling ancestors reasserted itself. \"Ho! ho!\" he shouted in stentorian tones. \"We\u0027m in luck, sir. Treasure an\u0027 all!\" He fumbled with the lid, then, struck by the thought that a lot of the glamour of the discovery of hidden specie and bullion would be lost unless he viewed his find in the glare of a torch, he retraced his footsteps and rejoined Alwyn and Peter. \"Girt sea-chest!\" he announced excitedly. \"Lifted \u0027en lid, I did.\" \"And the pig?\" asked the matter-of-fact Burgoyne. \"Drat that pig!\" exclaimed Minalto explosively. \"The chest, sir. Ef us had a light, like... sort o\u0027 torch, now say?\" \"How about it, Peter?\" asked Alwyn, turning to the Wireless Officer. \"We\u0027ll manage that,\" replied Mostyn confidently. \"Let\u0027s get out of the thicket. Suppose we ought to beat a clear path through this stuff?\" Burgoyne shook his head. \"No,\" he decided; \"we won\u0027t disturb it more than necessary. The less we do the better. If we\u0027re careful we ought to be able to take a lighted torch into the cave without setting fire to the brushwood outside.\" Returning to the open, they explained the delay to Hilda, whose eagerness to explore the cave was only quelled by the knowledge that the dying pig was somewhere in that gloomy vault. She would have endured the thorny passage without complaint; but there were limits, and the expiring porker was beyond them. Hurrying back to the camp, Mostyn returned with his fire-making gear, and proceeded to work. Meanwhile Burgoyne and Minalto had wrenched off some resinous branches to serve as torches. \"All ready!\" announced Peter. With a torch burning faintly, Minalto forced his way under the scrub, Burgoyne and Mostyn following in his tracks. At the mouth of the cave they coaxed the flames into greater activity, and from it lighted two more torches. Jasper advanced boldly. He had been there before. His companions followed cautiously, until the glare of the reddish flames revealed the treasure-chest. It was in fairly good condition, having been painted white with a black lid. There were rope beckets at each end, rove through two large half-round wooden chocks. The lid creaked on its hinges as Jasper threw it back. Then he gave a howl of disappointment. All the chest contained was a rusty cutlass, a clay pipe with a broken stem, and a number of brown paper bundles containing candles all stuck together by the heat. \"So much for your treasure, Jasper!\" said Burgoyne with a laugh. \"Never mind; we found something useful, the candles especially.\" \"P\u0027raps \u0027en buried et,\" suggested Minalto hopefully, casting anxious glances at the walls and floor of the cave. Burgoyne made no remark. He was deeply interested in the construction of the cave. It was partly natural and partly artificial. Human hands had enlarged the entrance and \"faired off\" the walls. In length it was about forty feet, and twenty in breadth, with a hewn pillar in the centre to give greater support to the roof. Except for the chest there were no other relics of the previous occupier. In one corner lay the pig, by this time quite dead. \"No use stopping here,\" decided Alwyn. \"Bend that rope round the pig, Minalto, and we\u0027ll haul the brute out. Yes, bring the cutlass, Peter, and a couple of packets of candles. The others can stop, in case we want them here.\" \"Want them here?\" repeated Mostyn. \"Rather,\" replied his chum. \"This cave will make an ideal retreat if we have to hide. I hope we shan\u0027t, but we must look things fairly in the face. That\u0027s why I didn\u0027t want the brushwood cleared away. Had it not been for the pig we should not have found the cave, and so most likely no one else will.\" \"Someone did at one time,\" remarked Peter. \"Yes, but how long ago we don\u0027t know, unless that cutlass gives us a clue. I\u0027ll have a look at it when we get into the open. You see, the person or persons who enlarged this place threw the excavated material on a mound just outside. That shows they hadn\u0027t any idea of concealing the cave. Since then this scrub has sprung up and hidden it. Now then, Jasper, all ready? Heave away!\" At the mouth of the cave they extinguished their torches, leaving them leaning against the wall in case they might be required again. Then, carrying and hauling their various trophies, the three men rejoined Hilda in the open. \"Now, where\u0027s that cutlass?\" inquired Alwyn, after relating the story of how their high expectations had been thwarted. \"H\u0027m, thought so. Our predecessors on Swan Island weren\u0027t so very ancient after all. This is a cutlass-bayonet, Peter, issued to the Navy in the late \u002770\u0027s and \u002780\u0027s. That ring in the guard is where the muzzle went, but I see the spring socket is rusted away. Nice job for you, Peter. You can clean the thing up. It\u0027ll do to carve the Christmas dinner if we\u0027re here long enough.\"","sourceLink":"http://novel.tingroom.com/jingdian/1610/47719.html","bookId":1247,"book":{"id":1247,"title":"The Third Officer","description":"简介： To the accompaniment of a pungent whiff of hot oil, a miniature cascade of coal dust and frozen snow, and the rasping sound of the derrick chain, the last of the cargo for No. 3 hold of the S.S. Donibristle bumped heavily upon the mountain of crates...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1610","creation":"Aug 1, 2019 12:24:43 AM","modification":"Aug 1, 2019 12:24:43 AM"}}
