{"id":13142,"no":30,"title":"CHAPTER XXX The End of the \"Malfilio\"","content":"Burgoyne and Mostyn were radiant when they left the Admiral\u0027s presence. By contrast the faces of Messrs. Swayne, Fontayne, and O\u0027Loghlin were glum. The promptness with which the Senior Naval Officer acted had taken the wind out of their sails. They had reckoned upon the preparations taking from five to seven days, during which time the Titania was to be unloaded of her valuable cargo. \\n\\n \\n\\n \"We can\u0027t all three go,\" declared Swayne. \"One must stop behind to superintend the unshipping of the stuff and to pay off the Kanakas. Candidly, now the excitement of salving the silver is over, I\u0027d rather go to sea with the squadron any old time. But duty\u0027s duty all the world over.\" \\n\\n \\n\\n Neither Fontayne nor Paddy O\u0027Loghlin showed any willingness to forgo their share in the marine picnic to the secret base. The old chums looked very much like \"parting brass rags\" until Peter Mostyn chipped in with a suggestion. \\n\\n \\n\\n \"Why not toss for it?\" he asked. \"Sudden death. Odd man stays behind.\" \\n\\n \\n\\n Three coins spun in the air and were deftly caught by their respective owners. \\n\\n \\n\\n \"Heads!\" announced Swayne. \\n\\n \\n\\n \"Same here!\" shouted Fontayne. \"We\u0027re all right, Swayne. We\u0027re in the same galley. Now then Paddy.\" \\n\\n \\n\\n Lugubriously O\u0027Loghlin began to uncover his coin. Then his features expanded into a broad grin as he, too, disclosed the King\u0027s effigy. \\n\\n \\n\\n The next trial resulted in Swayne having a head and Fontayne a tail. That meant that one of the two was bound to be out. \\n\\n \\n\\n \"Get a move on, O\u0027Loghlin,\" yelled Fontayne. \\n\\n \\n\\n Paddy was in no hurry. He rather enjoyed prolonging the agony in view of his chum\u0027s cheerful announcement in the first round. It was a head. \\n\\n \\n\\n \"You\u0027re ship-keeper, old son,\" remarked Swayne to the now downcast Fontayne. \\n\\n \\n\\n \"I say, let\u0027s go back and interview the secretary-bird,\" suggested Burgoyne. \\n\\n \\n\\n \"What for?\" asked Swayne. \\n\\n \\n\\n \"To tell him that Fontayne\u0027s not going,\" replied Alwyn. \"I\u0027ll get him to ask the Admiral to let Jasper Minalto go instead. He jolly well deserves to go, and I\u0027ve been kicking myself for not asking permission for him before.\" \\n\\n \\n\\n This suggestion was acted upon, with the result that the Admiral\u0027s secretary promised to put the matter before the Admiral after dinner. He also added that perhaps it would be as well if he provided an additional letter of introduction to the Commodore of the squadron detailed for the operations. \\n\\n \\n\\n Punctually at noon the enumerated vessels left Port Jackson, the destroyers leading, the seaplane carrier coming next, and the light cruisers Armadale and Rockhampton bringing up the rear. \\n\\n \\n\\n On the fore-bridge of the Armadale, the light cruiser flying the Broad Pennant of the Commodore of the squadron, were Burgoyne, Mostyn, Swayne, and O\u0027Loghlin, whose presence gave rise to wild surmises on the part of the ship\u0027s officers and crew. \\n\\n \\n\\n Jasper Minalto, as lively as a sand-boy, was in one of the petty officers\u0027 messes of the same ship, and although his tongue \"went nineteen to the dozen\" not as much as a hint did he let fall of the reason for the presence of the visitors on the fore-bridge. \\n\\n \\n\\n At two bells in the afternoon watch the squadron was well clear of The Heads, and was plunging into the steep head seas, for the gale still held. At that hour the skipper of each ship opened his sealed orders and communicated their contents to the officers under his command. Within five minutes every man of the squadron knew that the objective of the operations was the destruction of a pirate vessel. Authentic details would reach them later, but until then the wildest reports pervaded the lower deck. \\n\\n \\n\\n The Commodore of the Australian flotilla was not taking undue risks. His orders were to capture or destroy, and he meant to carry out his instructions with all the means at his disposal. \\n\\n \\n\\n Having asked Burgoyne a number of questions he decided upon his plan of action. The ships were to approach to within ten miles of the secret base, the Armadale and two destroyers on the eastern, and the Rockhampton and one destroyer on the western side. By means of aerial reconnaissance he would ascertain whether the pirate cruiser had returned to the anchorage. If she had, then a long-range bombardment of the harbour would either sink her or else compel her to come out. The batteries would be attacked by bombing machines, assisted by the guns of the cruisers. \\n\\n \\n\\n \"There are no anti-aircraft guns on the island, I presume?\" asked the Commodore. \\n\\n \\n\\n \"No, sir,\" replied Burgoyne. \"At least, not to my knowledge. I\u0027ve seen almost every battery, and they are armed with 6-inch and 4.7-inch naval guns.\" \\n\\n \\n\\n \"The Malfilio when under the Russian flag had four submerged torpedo tubes,\" continued the Commodore. \"Do you happen to know if she has any torpedoes on board?\" \\n\\n \\n\\n \"I cannot say, sir,\" replied Alwyn. \"I was never on board; but, as the result of conversation with survivors from the Alvarado and Kittiwake, I know that she never employed these against any of the three vessels captured by her up to the time I left the island. She carries a small seaplane for scouting purposes.\" \\n\\n \\n\\n On the evening of the eighth day after leaving Sydney the squadron, maintaining a speed of eighteen knots, arrived at the rendezvous fifteen miles due south of the secret base. \\n\\n \\n\\n For the whole of the night vessels cruised east and west, turning sixteen points at the expiration of each hour. No steaming lights were shown; the ships were cleared for action and the guns\u0027 crews slept by their guns. No wireless was permitted. The destroyers were ordered to stand in pursuit of any vessel that might be sighted, acting upon the supposition that the pirate island was well out of the regular steamer tracks, and signal to her to stop instantly and disclose her identity. If the command were disobeyed the delinquent was to be torpedoed. \\n\\n \\n\\n But nothing occurred to necessitate this drastic step. The night wore on without anything of a suspicious nature being reported. \\n\\n \\n\\n At the first streak of dawn two scouting aircraft rose from the deck of the seaplane carrier, and disappeared in the direction of Ramon Porfirio\u0027s stronghold. In two hours they were back again, having made an exhaustive survey of the island, without, apparently, being spotted by any of the garrison. \\n\\n \\n\\n They reported that there were two merchantmen and four schooners lying in the harbour, but the Malfilio was not visible. \\n\\n \\n\\n A council of war was held to decide upon the course to be pursued. Some of the officers were in favour of attacking the island at once; others advocated the finding and destruction of the pirate cruiser as the first phase of the operations, backing up their arguments with the theory that if Porfirio discovered that his base were captured he would steam away at once to an unfrequented part of the Siberian coast. He might, then, have to run the Malfilio ashore, but there would remain the discouraging knowledge that the arch-pirate was still at large. \\n\\n \\n\\n The Commodore fell in with the second suggestion, and decided to keep his flotilla out of sight of the secret base, and to keep a sharp look-out for the pirate cruiser by means of destroyers and aircraft, the light cruisers being stationed as previously arranged, one to the east and one to the west of the island. \\n\\n \\n\\n At one bell in the first Dog Watch (4.30 p.m.) the look-out in the fore-top of the Armadale reported a seaplane approaching from the nor\u0027east. At first the seaplane, which was flying at 5000 feet, was taken to be one of the naval scouts returning; but, when she made no attempt to descend and circled high above the cruisers, suspicions were aroused as to her ownership. \\n\\n \\n\\n Presently the Armadale picked up wireless messages in code, and since none of the squadron was permitted to use her radio instruments for transmitting the inference was positive. \\n\\n \\n\\n \"She\u0027s warning the Malfilio,\" declared the Commodore. \"We\u0027ll try her with the antis.\" \\n\\n \\n\\n The cruiser\u0027s anti-aircraft guns opened fire simultaneously. Judging by the mushroom-shaped clouds of white smoke that marked the bursting of the shrapnel shells, it seemed as if the seaplane could not escape being hit. But to the disappointment of all on board the Armadale the seaplane turned and flew away apparently unharmed. \\n\\n \\n\\n All necessity for secrecy being now at an end the Commodore wirelessed the seaplane carrier, ordering two fast battleplanes to stand in pursuit, and giving instructions to the destroyer Dawson to support the aircraft. \\n\\n \\n\\n The battleplanes ascended promptly, but an hour later they returned without having sighted the pirate seaplane. The pilot of the latter was a bit of a strategist, for instead of flying back to the Malfilio he had made a wide circle with the intention of returning to the secret base, having already warned Porfirio of his great danger. \\n\\n \\n\\n But the pirate scout\u0027s luck was out. When still a good twelve miles from the island he was sighted by one of the seaplanes engaged in searching for the Malfilio. The two Australian airmen did their work neatly and effectively. Standing in pursuit they sat on the tail of the pirate seaplane, and with one burst from a Lewis gun sent the latter down in a spinning nose-dive, with the machine a mass of flames. \\n\\n \\n\\n Ramon Porfirio knew now that the game was up. One chance remained—to seek safety in flight. He had provided for the contingency, for practically the whole of the specie and bullion found on his prizes had been transferred to the Malfilio\u0027s strong room. Could he but get away with the treasure without having to share it amongst his crew he would be a rich man. He decided to take a northerly course, lie low amongst the desolate Aleutian Islands until the coast was clear, and then double back to a South American port. \\n\\n \\n\\n Unfortunately for him he had underrated the capabilities and universal use of wireless. Within an hour and a half from the time the Malfilio received the warning from her seaplane, the pirate cruiser sighted a small American tramp steaming east. The Yankee also sighted the Malfilio, and when the former picked up a non-code general call from the Armadale asking all vessels in that part of the North Pacific to report if they sighted a warship answering to the Malfilio\u0027s description, Captain Hiram Stott pulled his goatee beard and looked wise. \\n\\n \\n\\n With a keen commercial instinct he inquired by wireless whether there were any pecuniary reward for the desired information, and a reply being received in the affirmative he then promptly gave the latitude and longitude of the position where he had sighted the pirate, and also the approximate course that the Malfilio was taking. \\n\\n \\n\\n Ramon Porfirio intercepted the message. Had time permitted he would have turned in pursuit of the tramp and sent her to the bottom; but urgent affairs compelled him to carry on under every ounce of forced draught. \\n\\n \\n\\n Meanwhile the Armadale, doing thirty-three knots to the Malfilio\u0027s twenty-two, was rapidly standing in pursuit of the pirate cruiser. Night fell, without the sighting of the latter. The Commodore, inwardly perturbed, showed no trace on his bronzed features of the doubts that assailed his mind. It was quite easy, in spite of the numerical superiority of the squadron, for the pirate cruiser to be lost in the vast expanse of the moonless ocean. \\n\\n \\n\\n About one bell of the Middle Watch the masthead light of a steamer was reported, bearing 105°. A little later on her red light and then the green were visible. \\n\\n \\n\\n Thinking it advisable to dispense with wireless during the rest of the night, the Commodore gave orders for the on-coming vessel to be communicated with by means of a masthead flashing lamp. \\n\\n \\n\\n In reply to the request for her name the stranger Morsed: \"KJVT—AUBX—APVE\", which, by reference to the Mercantile Shipping Register and the International Code, revealed her to be the S.S. Lanzorate of San Francisco, bound from Olympia, U.S.A., for Batavia. \\n\\n \\n\\n The Armadale then repeated her general wireless message, and asked if the Lanzorate had seen anything of the pirate ship Malfilio, to which the vessel replied that she had seen a two-funnelled craft answering the description proceeding south by east just before sunset. A hasty reference to the chart proved conclusively that either Captain Stott or the skipper of the Lanzorate had engaged in the pleasurable pastime of talking through his hat. By no possibility could the pirate cruiser travel from one position to the other in even twice the time stated. \\n\\n \\n\\n Meanwhile the Lanzorate was passing about two miles astern of the Armadale. The former was brilliantly illuminated. Every scuttle and every window of her deck-houses was lit up; while the Armadale was now in total darkness. \\n\\n \\n\\n \"We\u0027ll have a look at that hooker,\" said the Commodore to the Navigating Lieutenant. \"Take us to within a couple of cables of her—broad on her port beam.\" \\n\\n \\n\\n A warning to the searchlight men to stand by was followed by instructions to the 9.2-guns\u0027 crews to load with armour-piercing shells with delayed action fuses. The quick-firers and machine-guns were to be trained on the stranger\u0027s bridge. \\n\\n \\n\\n Describing a wide turning circle the Armadale closed on the stranger\u0027s port beam, which was the last thing her skipper would have expected. When the Armadale\u0027s masthead signal lamp flashed, the cruiser bore one point on to the former\u0027s starboard bow, so the sudden apparition of a huge warship on her port beam was to say the least most disconcerting. \\n\\n \\n\\n Simultaneously four searchlights were unscreened from the Armadale, and four powerful beams were focused upon the stranger. Instead of showing up a small \"intermediate\" liner the rays revealed the pirate cruiser Malfilio. \\n\\n \\n\\n Ramon Porfirio, although unprepared for such a manoeuvre, had already cleared for action. The moment he saw the game was up he gave the order to open fire. \\n\\n \\n\\n The Malfilio\u0027s six-inchers crashed. Blinded by the glare of the searchlights, the gun-layers, smart enough at their work when shelling an unarmed merchantman, were frantic with the knowledge that they were up against a heavily-armed vessel. Most of the shells flew high, but one, exploding outside the shield of the Armadale\u0027s for\u0027ard 9.2, played havoc with the fore-bridge, wounding two officers and a signalman, and carrying away part of the chart-room. \\n\\n \\n\\n The Armadale\u0027s reply was prompt and terrible. Every gun that could be brought to bear upon the pirate cruiser opened fire almost before the last echoes of the Malfilio\u0027s salvo had died away. \\n\\n \\n\\n With a blinding flash that outshone the glare of the searchlights the main magazine of the Malfilio exploded. A dense cloud of smoke, like a silvery mist, hid the pirate cruiser from view; and when the last of the far-flung fragments had fallen either into the sea or upon the Armadale\u0027s deck, the shattered hull of the Malfilio had vanished, and with her went Ramon Porfirio and four hundred of the vilest sweepings of the South American and Eastern Asiatic ports. \\n\\n \\n\\n The whole business was over almost before Burgoyne and his companions realized that an action was in progress. Within a few minutes from the time when the Malfilio opened fire her disintegrated remains were foundering to the bed of the Pacific. \\n\\n \\n\\n For fifteen minutes the searchlights were kept playing upon the spot where the pirate cruiser had disappeared on the faint chance that there might be survivors. Civilization decrees that a pirate can be hanged or shot, but he must not be allowed to die a lingering death by drowning. But the search revealed no trace of any of the crew of the Malfilio. \\n\\n \\n\\n \"On bow and steaming lights! Wireless the rest of the squadron to take up pre-arranged positions off the secret base!\" \\n\\n \\n\\n Then at a modest fifteen knots, the Armadale, bearing evidences of the scratches she had received, steamed westward. One part of her mission was accomplished: the destruction of the hornet. There remained more work for her to do: to assist in the wiping out of the hornet\u0027s nest. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1610/47726.html","bookId":1247,"book":{"id":1247,"title":"The Third Officer","description":"简介： To the accompaniment of a pungent whiff of hot oil, a miniature cascade of coal dust and frozen snow, and the rasping sound of the derrick chain, the last of the cargo for No. 3 hold of the S.S. Donibristle bumped heavily upon the mountain of crates...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1610","creation":"Aug 1, 2019 12:24:43 AM","modification":"Aug 1, 2019 12:24:43 AM"}}
