{"id":36211,"no":2,"title":"CHAPTER I. THE NECESSITY OF A NEW WITNESS.","content":"THE very title of this book may give offense. \"A New Witness for God!\" will exclaim both ministry and laity of Christendom; \"are not the Old Witnesses sufficient? Has not their testimony withstood the assaults of unbelievers, atheists and agnostics alike for nineteen centuries? What need have we for a New Witness? Every weapon that hostile criticism could suggest, has been brought to bear against the tower of our faith based on the testimony of the Old Witnesses; and it stands more victorious now than ever, four square to all the winds that blow.[1] The testimony of the Old Witnesses has outlived the ridicule of Voltaire, the solemn sneers of Gibbon, the satire of Bolingbroke, the ribaldry of Paine; just as it will outlive the insidious assaults of the German mythical school, and the rationalistic school of critics, which are now much in vogue. Such the confident boast of orthodox Christians. \"Meanwhile, every diocesan conference rings with the wail over \u0027infidel opinions.\u0027 It grows notoriously more and more difficult to get educated men to take any interest in the services or doctrines of the church; * * * literature and the periodical press are becoming either more indifferent, or more hostile to the accepted Christianity year by year; the upper strata of the working class, upon whom the future of that class depends, either stand coldly aloof from all the Christian sects, or throw themselves into secularism. Passionate appeals are made to all sections of Christians, to close their ranks, not against each other, but against the \u0027skepticism rampant\u0027 among the cultivated class and the religious indifference of the democracy.\"[2] In the face of these facts, notwithstanding the confident boasts of orthodox Christians about the invulnerableness of the testimony of the Old Witnesses, it will be well for us to look a little more closely into the achievements of Christianity, Catholic as well as Protestant, and see if they are as satisfactory when measured by actual results, as they are claimed to be in the fervid rhetoric of the orthodox special pleader. What is distinctly and commonly recognized as the Christian religion, was founded some nineteen centuries ago[3], by the personal ministry of Jesus Christ, and those whom he chose as Apostles. For about three centuries it had a hard struggle for existence. The persecutions waged against it, first by the Jews, from whose religious faith it may be said to have sprung; and second, from the pagans, then in possession of all secular power, well-nigh overcame it. The \"beast\" made war upon the saints and \"prevailed against them.\" Then Constantine, the friend of Christianity, succeeded to the imperial throne of Rome, and external persecution ceased. Christian ministers were invited to the court of the emperor and loaded with wealth and honors. Magnificent churches were erected, and the hitherto despised religion became the favorite protege of the imperial government. From a precarious and wretched existence, the Christian church was suddenly raised to a position of magnificence and power. Nor was it long in playing the part of the camel which, being permitted by the kind indulgence of its master to put its head within the tent during a violent storm, next protruded its shoulders, then its whole body, and turning about kicked out its master.[4] So did the Christian ecclesiastical power with the civil power. That is to say, that which was at first granted to the church as a privilege was soon demanded as a right; and what was at first received by grace, was at the last taken by force. On the ruins of pagan Rome, rose papal Rome, and while the latter power did not abolish secular government, it did make it subservient to ecclesiasticism. From the chair of St. Peter, the Roman pontiffs ruled the world absolutely. Kings and emperors obeyed them, and all stood in awe before the throne of the triple-crowned successor of St. Peter. Finally, through the mutual jealousy and ambition of the bishops of Rome and Constantinople, a controversy arose which, in the ninth century, resulted in a great and lasting division of Christendom into two great ecclesiastical bodies; viz., the Greek Catholic or Eastern Church, and the Roman Catholic or Western Church. In the Western Church the secular or civil power continued to be regarded as subordinate to ecclesiastical authority, a sort of convenient instrument to execute the decrees of the church. Hence Roman Catholic Christianity drew to itself all that prestige in the propagation of its doctrines which comes from the authority and support of the state; and though the power of the state was held to be subordinate to that of the church, no one who has read our Christian annals can help being struck with the importance of the civil power as a factor in the propagation of Roman Catholic Christianity. The barbarous peoples who came in contact with the Christian nations, were often compelled to accept the so-called Christian religion as one of the terms of capitulation; and the fear of the sword often eked out the arguments of the priests, and was generally much more effective. I think it proper that the above statement should be emphasized by the following proofs: \"In the year 772, A. D., Charlemagne, king of the Franks, undertook to tame, and to withdraw from idolatry, the extensive nation of the Saxons, who occupied a large portion of Germany, and were almost perpetually at war with the Franks, respecting their boundaries and other things; for he hoped that if their minds could become imbued with the Christian doctrines, they would gradually lay aside their ferocity, and learn to yield submission to the empire of the Franks. The first attack upon their heathenism produced little effect, being made not with the force of arms, but by some bishops and monks whom the victor had left for that purpose among the vanquished nation. But much better success attended the subsequent wars which Charlemagne undertook, in the years 775, 776, and 780, A D., against that heroic people, so fond of liberty, and so impatient, especially of sacerdotal domination. For in these assaults, not only rewards, but also the sword and punishments were so successfully applied upon those adhering to the superstition of their ancestors, that they reluctantly ceased from resistance, and allowed the doctors whom Charles employed to administer to them Christian baptism. Widekind and Albion, indeed, who were two of the most valiant Saxon chiefs, renewed their former insurrections; and attempted to prostrate again by violence and war, that Christianity which had been set up by violence. But the martial courage, and the liberality of Charles at length brought them, in the year 785, solemnly to declare that they were Christians, and would continue to be so. * * * The Huns inhabiting Pannonia, were treated the same way as the Saxons; for Charles so exhausted and humbled them by successive wars, as to compel them to prefer becoming Christians to being slaves.\"[5] In Denmark, during the tenth century, \"the Christian cause had to struggle with great difficulties and adversities, under King Gorman, although the queen was a professed Christian. But Harald, surnamed Blatand, the son of Gorman, having been vanquished by Otto the Great, about the middle of the century, made a profession of Christianity in the year 949, and was baptized. * * * Perhaps Harald, who had his birth and education from a Christian mother, Tyra, was not greatly averse from the Christian religion; and yet it is clear that in the present transaction he yielded rather to the demands of his conqueror, than to his own inclinations. For Otto, being satisfied that the Danes would never cease to harass their neighbors with wars and rapine, if they retained the martial religion of their fathers, made it a condition of the peace with Harald that he and his people should become Christians.\"[6] \"Waldemar I., King of Denmark, obtained very great fame by the many wars he undertook against the pagan nations, the Slavs, the Wends, the Vandals, and others. He fought not only for the interests of his subjects, but likewise for the extension of Christianity; and wherever he was successful, he demolished the temples and images of the gods, the altars and groves, and commanded the Christian worship to be set up. * * * The Fins who infested Sweden with frequent inroads, were attacked by Eric IX., King of Sweden, called St. Eric, after his death, and by him subdued after many bloody battles. * * * The vanquished nation was commanded to follow the religion of the conqueror, which most of them did with reluctance and disgust.\" \"Towards the close of the century [the tenth], * * * some merchants of Bremen or of Lubec trading to Livonia, took along with them Mainhard, a regular canon of St. Augustine in the monastery of Segberg in Halsatia, to bring that warlike and uncivilized nation to the Christian faith. But as few listened to him, Mainhard consulted the Roman pontiff, who created him the first bishop of the Livonians, and desired that war should be waged against the opposers. This war, which was first waged with the Esthonians, was extended farther and prosecuted more rigorously by Berthold, the second bishop of the Livonians, after the death of Mainhard; for this, Berthold, formerly Abbot of Lucca, marched with a strong army from Saxony, and recommended Christianity not by arguments but by slaughter and battle. Following his example, the third bishop, Albert, previously a canon of Bremen, entering Livonia in the year 1198, well supported by a fresh army raised in Saxony, and fixing his camp at Riga, he instituted, by authority of Innocent III., the Roman pontiff, the military order of knight\u0027s sword-bearers, who should compel the Livonians by force of arms to submit to baptism. New forces were marched from time to time from Germany, by whose valor and that of the sword-bearers the wretched people were subdued and exhausted, so that they at last substituted the images of Christ and the saints in place of their idols.\"[7] A volume of evidence similar in import to the foregoing could be compiled, showing that from the accession of Constantine the Great down to the sixteenth century, the Roman Catholic Church did not hesitate to employ the civil power to enforce conversion and punish recalcitrants. If the Eastern Church has been less successful in extending the borders of Christianity by means of conquests waged by the civil power, it was because the division of the world it occupied afforded less opportunity than Western Europe, where a great struggle was on between the race of men made weak by the effete civilization of Rome and the more vigorous barbarians. But while the Eastern Church made less direct use of the sword to extend its dominions, it nevertheless had the state for an ally which sustained it at need. When in the sixteenth century the great revolt against the authority of the pope and the religion of the Roman Catholic Church gave birth to the Protestant churches, they, too, in the main, formed alliances with the states in which they were founded. Nay, in the very struggle for their existence, the states of Germany, of Holland, Scandinavia and of England, drew the sword in their behalf and by their support made it possible for the seceding religionists to establish churches despite all efforts of the Roman pontiffs to prevent them; and after the revolution was an accomplished fact, the states above enumerated continued to give support to the churches founded within their borders. If the church and the state in some instances were regarded as separate and distinct societies, they acted at the same time as close neighbors, and nearly interested in each other\u0027s welfare. If they lived separate, they were not estranged; and each at need gave the other support. I have thought it necessary to call the attention of the reader to the conditions in which Christianity has existed since the days of Constantine under all three great divisions of Christendom—the Roman Catholic, the Greek Catholic, and Protestant—in order that he might be reminded of the fact that circumstances of the most propitious character have existed for the propagation of the so-called Christian religion. Christendom has had at its command the wealth and intelligence of Europe; it has been able to follow the commerce of European states into every country of the world; and not only its commerce, but its conquests as well; and wherever the love of adventure or the desire for conquest has led Christian soldiers, Christian priests have either accompanied or followed them, that the gospel, in the hands of the Christian minister, might be a balm for the wounds inflicted by the sword in the hands of the Christian soldier; so that if Christian armies were a bane to the savages, the Christian priests might be an antidote! Yet with all the advantages which came to Christianity through the support of the state; with the intelligence and wealth of Europe behind it; with the privilege of following in the wake of its commerce and conquests; what has Christendom done in the way of converting the world to its religion? But a little over one-fourth of the inhabitants of the earth are even nominally Christian! There are in the world, according to statistics published on the subject: Roman Catholics ...........................206,588,206 Protestants (all sects) ................... 89,825,348 Greek and Russian Churches ................ 75,691,382 Oriental Churches ......................... 6,770,000 Making the total of all Christians........ 378,874,936. The other religions stand as follows: Brahminical Hindoos .......................120,000,000 Followers of Buddha, Shinto and Confucius .................................482,600,000 Mohammedans ...............................169,054,789 Jews ....................................... 7,612,784 Parsees (fire-worshipers in Persia) ........ 1,000,000 Pagans not otherwise enumerated ...........277,000,000 Making a total of .......................1,007,267,573[8] Surely when the superior advantages for the propagation of the Christian religion are taken into account, one could reasonably expect better results than this, after a period of nineteen centuries, sixteen of which may be said to have been of a character favorable to the extension of the borders of the church. But let us take a nearer view of the status of Christendom. As seen in the foregoing, but a little more than one-fourth of the population of the earth is even nominally Christian. No one will contend that all those nominally Christians are really Christians. Church membership may be one thing, conversion to the Christian religion quite another. If those who are Christians in name only, and church members from custom or for worldly advantage were separated from those who are Christians upon principle, upon conversion and real faith, the number of Christians in the world would be materially reduced. For it cannot be denied that when any religion becomes popular there are multitudes of insincere men who will outwardly accept it, and give it lip-service in return for the advantages that accrue to them socially, financially or politically. Moreover, Christendom is not united in one great body or church; but on the contrary it is divided into numerous contending factions whose differences are so far fundamental that there appears no prospect of reconciliation among them. The Catholics refuse to recognize any power of salvation in Protestantism. To the Catholic the Protestant is an heretic, a renegade child; and on the other hand, to the Protestant, the Catholic is an idolator, and the pope the very anti-Christ, prophesied of in scripture. Nor are the Roman and Greek Catholics much nearer at one with each other than the Roman Catholics and Protestants. Away back in the ninth century, as a result of the controversy between the Eastern and Western Churches, Pope Nicholas, in a council held at Rome, solemnly excommunicated Photius, the patriarch of Jerusalem, and had his ordination declared null and void. The Greek emperor resented this conduct of the pope, and under his sanction Photius, in his turn, convened what he called an acumenical council, in which he pronounced sentence of excommunication and deposition against the pope, and got it subscribed by twenty-one bishops and others amounting in number to one thousand. Although this breach was patched up after the death of the Emperor Michael, difficulties broke out again between the East and the West from time to time, until finally in the eleventh century, when Michael Cerularius, patriarch of Constantinople, opposed the Western Church with respect to their making use of unleavened bread in the sacrament, their observation of the Sabbath, and fasting on Saturdays, charging therein that they lived in communion with the Jews. Pope Leo IX. replied, and in his apology for the Western Churches, declaimed warmly against the false doctrine of the Greeks, and ended by placing on the altar of Santa Sophia, by his legates, a deed of excommunication against the Patriarch, Michael Cerularius. This was the final rupture. From that time the mutual hatred of the Greeks and the Latins became insuperable, insomuch that they have continued ever since separated from each other\u0027s communion.[9] Though both the Greek and the Protestant Churches are separated from the Roman Catholic Church, yet there is no union or fellowship between them; on the contrary, they hold doctrines so opposite that union between them is out of the question. At least so remote is the prospect, that all attempts at union have been ineffectual. Turn now to Protestant Christendom. Surely we shall find a union of organization and agreement of sentiment here! But no; division, on the contrary, is multiplied. Protestant Christendom is divided into numerous sects between some of which the gulf of separation is almost as broad and deep as that which separates Protestants from Catholics. Such is the distracted condition of Protestant Christendom that sects are daily multiplying, and confusion is constantly increasing. Nor can one refrain from saying with Cardinal Gibbons, that \"This multiplying of creeds is a crying scandal, and a great stumbling-block in the way of the conversion of the heathen nations.\"[10] And I will add, equally a stumbling-block to the conversion of the unbelievers living among Christians. This last class of persons named, the unbelievers living among Christians, we must now consider; and note the effect of their assaults upon Christianity. They are, for the most part, without organization; without unity of purpose, except in so far as they are united in their disbelief of revealed religion. Their position being essentially a negative one, the incentive to organization is not active. It requires unity of purpose and organization of effort to build; those who content themselves with pointing out the defects, real or imagined, of the work of the builders, or saying the structure does not answer well the purposes for which it was erected, feel no such necessity for organization as the builders do. In consequence of having no organization, infidels keep no account of their numerical strength; they publish no statistics, and therefore we have no way of estimating how numerous they are. But no one with large acquaintance in Christian countries, and who is in touch with the trend of modern religious thought, can doubt that the number of unbelievers is considerable, and their influence upon the Christian religion more damaging than Christian enthusiasts are willing to admit. What a motley crowd this great body of unbelievers is! First is the downright atheist who says plainly, \"There is no God. Nothing but blind force is operating in the universe; there is no Providence whose will can interrupt the destined course of nature.\" Providence they set down as a dream. \"The universe and all its varied phenomena are generated by natural forces out of cosmic atoms, and into atoms to be again resolved,\" is their creed. Following the atheist is the deist, who, while not one whit behind the atheist in rejecting revealed religion, is of the opinion that mind is somewhere operating in the universe, but refuses to recognize that intelligence as associated with a personality. Still that Intelligence, whatever or wherever it be, is God; but with them is always \"It,\" never \"He.\" Then comes the agnostic. He prefers to suspend his judgment on the question of Deity; and with a modesty, not always free from affectation, says, \"I don\u0027t know. The evidence in the case is not quite clear; in fact it is sometimes quite conflicting.\" He questions; is debating; but you find his sympathies, at bottom, on the side of unbelief. Next to the agnostic comes the rationalist, who, while he leaves God more or less of an open question, has his mind made up in respect to Jesus Christ. He recognizes him as a good man, though mistaken on many questions; but though he strips Jesus of all divinity, he nevertheless recognizes him as the friend of God and of man; and sees embodied in him, moreover, \"the symbol of those religious forces in man which are primitive, essential and universal.\"[11] Such are the varied classes which assail the Christian religion. Their methods of assault, though having much in common, are as varied as the kinds of unbelievers. The atheist mockingly asks if there be a God why he does not make himself manifest to all the world; why he keeps himself shrouded in mystery? Why not reveal himself to all as well as to a chosen few? Pushing aside the testimony of those who say they have stood in his presence, he boldly asserts there is no God, because no one has ever seen him; he has not made himself known to men, and in conclusion he points to the natural and uninterrupted order of things in the universe as proof that all things are governed by blind forces instead of intelligence, whether a personality or apart from personality. The deists say nearly all that the atheists say; but admitting an intelligence back of all phenomena in the universe, they pretend to read his will in the book of nature,[12] and contrast its perfections with the imperfections of all written books of revelation. To them the Bible—the Christian volume of revelation—is imperfect and contradictory; it teaches a morality and seems to tolerate practices unworthy of a Being of infinite goodness. The agnostics join with the deists in their objections. They see all the contradictions, imperfections and alleged immorality that deists see in the Christian volume of revelation; and with them question the authenticity and credibility of the scriptures. If they differ from the deists in anything, it is simply in arriving at a less positive conclusion. But the worst is to come. There has arisen within our century, mainly in Germany, a class of theological writers, who indeed profess a reverence both for the name and person of Jesus Christ, and a real regard, moreover, for the scriptures as \"embodiments of what is purest and holiest in religious feeling;\" and yet they degrade Christ to a mere name, and strip the scriptures of all their force as the word of God, by denying the historical character of the Biblical narrative. Starting with the postulate that the miraculous is impossible and never happens, or at least has never been proven,[13] they relegate the scriptures—the New Testament as well as the Old—to the realms of poetry, legend or myth, because they are filled with accounts of the miraculous.[14] This movement of theological thought had its origin in a new science, the science of historical criticism, which had its birth in our own nineteenth century. The new science consisted simply in applying to the mass of materials on which much of ancient history had been hitherto based—myths, legends and oral traditions—the rules[15] embodying the judgment of sound discretion upon the value of different sorts of evidence. The effect of the application of this principle to the materials out of which our ancient histories were constructed, was to banish to the realms of pure myth or doubtful legend much which our fathers accepted as historical fact. The relations of ancient authors are no longer received with as ready a belief as formerly; nor are all ancient authors any longer put upon the same footing and regarded as equally credible, or all parts of their work supposed to rest upon the same basis.[16] Many old, fond theories have been shattered; in some respects the whole face of antiquity has been changed,[17] and instead of now looking upon the ancients as demi-gods, and the condition in which they lived as being something supernatural, we are made to feel that they were men of like passions with ourselves, possessed of the same weaknesses, actuated by the same motives of self interest, ambition, jealousy, love, hatred; and that the conditions surrounding them were no more supernatural than those which surround us. The science of historical criticism by the application of its main principle has stripped ancient times of their prodigies, and has either brought those demi-gods of legend to earth and made them appear very human, or has banished them entirely from real existence. So long as the leading principle of this new science was applied to profane history alone; and the revolution it inaugurated confined to smashing the myths of ancient Greece, Rome, Babylon, Egypt and India, no complaints were heard. Indeed, the work was very generally applauded. But when the same principle began to be applied to what, by Christians at least, was considered sacred history, then an exception was pleaded. This difficulty was met by orthodox believers much in the same way that an earlier question, one about miracles, was met by Conyers Middleton. It will be remembered that the Catholic Church has always claimed for herself the power of working miracles from the earliest days until the present; and cites, in confirmation of her claims, testimony that seems at once respectable and sufficient. The Protestants, with the Anglican Church at their head, in the discussions to which reference is here made, conceded that the possession of the gift of working miracles was prima facie evidence of divine authority and soundness of faith.[18] So much being conceded, Protestants were puzzled when to fix the date that miracles ceased. They were certain that no miracles had happened in their times, but were equally positive that they had occurred in the early Christian centuries. But the recent testimony presented by their Catholic opponents was just as worthy of belief as the testimony of the early Christian Fathers; in some respects it was better, because it was within reach for examination. What was to be done? If this recent testimony of the Catholic Church concerning miracles was to be rejected, could the earlier testimony of the Christian Fathers stand? The discussion had reached this point when Middleton published his \"Free Inquiry,\" in which he held that the miracles claimed by the Catholic Church, both in former and recent times must stand or fall together. For if the testimony of the early Christian Fathers and contemporary witnesses could confirm the former, the testimony of the recent witnesses, being just as respectable as the former, and hence as worthy of belief, would confirm the latter. Middleton met the difficulty by rejecting all testimony to miracles after the close of the apostolic age. When it was suggested that the New Testament miracles might be treated in a like summary manner, he took the position that the New Testament account of miracles was inspired, and therefore beyond the reach of criticism. So likewise I say, orthodox Christians were disposed to meet the application of this principle of Historical Criticism under consideration. They protested against the application of it to sacred history. They insisted that the marvelous occurrences related in the Bible, and which read so much like myth or legend, were recorded by inspired writers, hence above criticism. The exception pleaded, however, was not granted. There were bold spirits both within the church as well as outside of it, who did not hesitate, at least so far as the Old Testament was concerned, to apply the new methods of criticism to sacred history. The conclusions of those who started with the hypothesis that what we call the miraculous is impossible, would not be difficult to forecast. From the outset, with them, the Old Testament was doomed. In the wonderful incidents related as the experience of the patriarchs, of Moses, Aaron, Joshua and the kings and prophets of Israel, this school of critics could discern a striking parallel to the legends of Rome, of Greece and Egypt; and as readily rejected the one as the other. They rejected also the cosmogony of Genesis, insisting that it was not the history of the creation but poetry, and as such must be regarded, but not as fact. Suspicion once cast upon the historical value of sacred writings, the critics grew bolder and declared that portions of the sacred narrative presented the appearance of being simply myths; and from this by degrees it soon became the fashion to attach a legendary character to the whole of the Old Testament. It was decided by the same class of critics that the whole narrative, in the main, rests upon oral tradition and that that tradition was not written until long after the supposed events occurred. Moreover, when the old traditions were written, the work was done by poets bent rather on glorifying their country than upon recording facts; and it is claimed that at times they did not hesitate to allow imagination to amplify the oral traditions or at need to invent new occurrences, to fill up blanks in their annals. The authorship of the sacred books was held to be a matter of great uncertainty, as well as the date at which they were written; but certainly they were not written until long after the dates usually assigned for their production. This style of criticism not only got rid of the cosmogony of Genesis, but discredited as histories the whole collection of books comprising the Old Testament. The Fall of man, that fact which gives meaning to the atonement of Christ, and without which the scheme of Christian salvation is but an idle fable—was regarded as merely a myth. So, too, were the revelations of God to the patriarchs; his communion with Enoch; his warning to Noah, together with the story of the flood; the building of Babel\u0027s tower; the visions of Abraham; the calling of Moses; the splendid display of God\u0027s power in the deliverance of Israel from bondage; the law written upon the tables of stone by the finger of God, the ark of the covenant and the visible presence of God with Israel; the visitation of angels to the prophets; their communion with God and the messages of reproof, of warning or of comfort they brought to the people—all, all were myths, distorted legends, uncertain traditions told by ecstatic poets, falsely esteemed prophets! Such was the wreck which this new science of criticism made of the Old Testament. There was scarcely a halt between the wrecking of the Old Testament by this new school of critics and their assault upon the New. Their success gave them confidence, and they attacked the Christian documents with more vigor than they had the Old Testament. By research which did not need to be very extensive in order to conduct them to the facts, they discovered that the age which witnessed the rise of the Christian religion was one in which there existed a strong preconception in favor of miracles; that is, the miraculous was universally believed, and it was held by our new school of critics that this pre-conception in favor of miracles influenced the writers of the New Testament to insert them in their narratives. Ever present in their New Testament criticism as in that of the Old, was the cardinal principle that miracles never take place—the miraculous is the impossible;[19] hence whenever our anti-miracle critics found accounts of miracles interwoven in the biographies of Jesus, or in the epistles of the apostles, they inexorably relegated them to the sphere of myth or legend.[20] Unhappily for orthodox believers who cling to the gospel narratives as reliable statements of fact, they themselves found it necessary to discard as apocryphal many of the books and writings which sprang into existence in the early Christian centuries; books which pretended to relate incidents in the life of Messiah, especially those which treated of his childhood and youth. The marvelous account of his moulding oxen, asses, birds and other figures out of clay, which at his command would walk or fly away; his power to turn his playmates into kids; his striking dead with a curse the boys who offended him; his stretching a short board to its requisite length; his silencing those who try to teach him[21]—all this, and much more, Christians had to discard as pure fable. But they stopped short with the pruning process at the books of the New Testament as we now have them. Our new school of critics, however, infatuated with the chief principle of their new science, went right on with the pruning, and made as sad work of the New Testament as they had with the Old. They rejected the miraculous in the New Testament writings as well as the account of miracles which the Christians themselves rejected in the apocryphal writings. By this step they got rid of the story of the miraculous conception and birth of Christ; of the journey of the vision-led magi; of the dream-led Joseph; of the testimony of the Holy Ghost, and of the Father at Christ\u0027s baptism; of converting water into wine; of Christ walking upon the water; of the miraculously fed multitude; of the healing of the sick by a word or with a touch; casting out devils; the raising of the dead; the earthquake; the rending of the vail of the temple; and the miraculous three hours\u0027 darkness at the crucifixion; Christ\u0027s resurrection from the dead; his appearance after the resurrection; his final ascension into heaven; and the declaration of the two angels that he would come again to the earth as he had left it: in the clouds of heaven and in great glory. The new criticism got rid of all this—all that makes Christ God, or one of the persons of the Godhead, or that ascribes to him powers above those that may be possessed by a man. Christ\u0027s divinity is destroyed by this method of criticism, and one instinctively asks what there is left, and is told—\"The manifestations of the God concealed in the depths of the human conscience.\"[22] \"God-man, eternally incarnate, not an individual but an idea!\"[23] To this then it comes at last, a Christianity without a Christ—that is, without a divine Christ; and a Christ not divine—not God manifest in the flesh, is no Christ. We had trusted that Jesus of Nazareth had been he who would have redeemed not only all Israel, but all the nations of the earth. We and our fathers had believed that he had brought life and immortality to light through the gospel; but alas! it turns out according to our new school of critics, that his \"revelations of blissful scenes of existence beyond death and the grave, are but one of the many impostures which time after time have been palmed off on credulous mankind!\" Christ but a man, \"the moralist and teacher of Capernaum and Gennesaret\"—nothing more! On a level with Socrates, or Hillel, or Philo! What a void this new school of criticism makes! A Christianity without the assurance of the resurrection! without the hope of the glorious return of the Messiah, to reward every man according to his works! The new school of critics does not question so severely as other critics have done the authenticity of the Christian documents, or the date of their origin. Indeed, one of their chief apostles concedes the authenticity of the gospels and their antiquity.[24] But after having admitted the authenticity and antiquity of the Christian documents, they then proceed to mutilate the story they relate—the gospel they teach—as to render it practically valueless to mankind. This is accomplished by regarding the Christian documents as legends,[25] from which if we would arrive at historical truth must be excluded all that is miraculous,[26] and hence all that makes Christ God. And while to the imagination of the idealist much that is of value and that is beautiful may remain in the attenuated Christianity which the new criticism would leave us, yet for the great body of humanity such a Christianity would be worthless. For however beautiful the moral precepts of the merely human Jesus may be, they will have no perceptible influence on the lives of the multitude unless back of them stands divine authority, accompanied by a conviction of the fact of man\u0027s immortality and his accountability to God for his conduct. Shorn of these parts, what remains may be beautiful; but it would be as the beauty of a man from whom the spark of life had fled—the beauty of the dead. Of course the orthodox Christian denies that this style of attack on the Christian religion has had any success. To him it is an \"attack\" which has \"failed.\" \"In spite of all the efforts of an audacious criticism,\" says one, \"as ignorant as bold—the truth of the sacred narrative stands firm, the stronger for the shocks that it has resisted; the boundless store of truth and life which for eighteen centuries has been the ailment of humanity is not (as Rationalism boasts) dissipated. God is not divested of his grace, or man of his dignity—nor is the tie between heaven and earth broken. The foundation of God—the everlasting gospel—still standeth secure—and every effort that is made to overthrow, does but more firmly establish it.\"[27] Let us examine this matter more nearly, and with less partiality than Rawlinson has done. If for the new school of critics to succeed means that the orthodox view respecting Jesus of Nazareth, and the religion he founded must be entirely overthrown by being driven out of existence, then the new criticism is an \"attack\" which has \"failed,\" for orthodox Christianity, that is, the Christianity which recognizes Christ as divine—as God, and the New Testament as divinely inspired and stating the substantial facts of Messiah\u0027s life—is still with us. There are a number of reasons why the orthodox view of Christ has not been entirely overthrown by the new criticism. First, the great body of Christians which constitute the Catholic Church have been preserved in the orthodox faith of Christ by the protecting aegis afforded by the authority of that Church. Recognizing the church as superior to the written word, alike its custodian and interpreter, and accepting the meaning which the church attaches to the Bible as infallible, Catholics, I say, have been preserved from the faith-shattering effects of the New Criticism. Second, the criticism has been conducted, in the main, and especially in the early stages of it, in the German language, and hence has been largely confined to the German nation. Third, the discussion wherever it has taken place has been carried on over the heads of the laity; it has not been within their reach, hence to a large extent it has been without effect upon them—an \"attack that has failed.\" But in each case, let it be remembered, its non-effect is the result of not coming in contact with it. In one case it has been kept away from the people by the authority of the church; in the other through the inability of the laity, outside of Germany, to understand the language in which the attack was written; and thirdly, through the inability of the masses to bring the necessary scholarship to the investigation. But, on the other hand, if to attract to itself a large following, both among clergymen and laity, and especially among scholars; if to modify prevailing orthodox opinion concerning the historical character of the Old Testament, and force concessions respecting the character at least of some parts of the Christian documents; if to permeate all Christendom—the Catholic Church perhaps excepted—with doubt concerning the divinity of Christ, and to threaten in the future the faith of millions of Christians—if to do this is to succeed, then the new criticism is succeeding, for that is what it is doing. Forty years ago it was the complaint of German orthodox writers that this German neology, as the new criticism is sometimes called, had left \"No objective ground or standpoint,\" on which the believing theological science can build with any feeling of security.[28] \"Nor,\" says the same authority, \"is the evil in question confined to Germany. The works regarded as most effective in destroying the historical faith of Christians abroad, have received an English dress, and are, it is to be feared, read by persons very ill-prepared by historical studies to withstand their specious reasonings, alike in our country and in America. The tone, moreover, of German historical writings generally is tinged with the prevailing unbelief; and the faith of the historical student is likely to be undermined, almost without his having his suspicions aroused, by covert assumptions of the mythical character of the sacred narrative, in works professing to deal chiefly, or entirely with profane subjects.\"[29] It is more than thirty years since these admissions were made; since then the German works complained of have been more generally translated and widely read than before. Besides, since then, Renan has given his \"Origins of Christianity\"[30] to the world, and by his great learning, but more especially by the power and irresistible charm of his treatment of the subject, has popularized the conceptions of the Rationalists, until now the virus of their infidelity may be said to be poisoning all Protestant Christendom. What must ever be an occasion for chagrin, not to say humiliation, to orthodox Christendom, is, its inability to meet in any effectual way the assaults of this new criticism. In Germany they complain against Strauss for having written his \"Life of Jesus\" in the German language. If he must write such a book, so full of unbelief in the orthodox conception of Jesus, he ought at least to have had the grace to have written it in Latin![31] For his rationalism Renan is driven out of the Church of Rome; but this only gives notoriety to his views, creates a desire to read his books and spreads abroad his unbelief. When the Presbyterian Church takes to task one of its most brilliant scholars[32] for accepting the results of the new criticism, he is sustained by the powerful Presbyterian Synod of New York and acquitted; and when an appeal is taken to the general assembly of the church and he is finally condemned, he is able to retort that while he was condemned by the general assembly, it was by numbers and not by intelligence that he was overcome; it was the less intelligent Presbyteries of the rural district that gave the necessary strength to his opponents. The better informed members—members from the cities and centers of education and enlightenment—were with him.[33] The defense commonly made for orthodox Christianity is an appeal to its antiquity and its past victories. Its defenders point with pride to the failure of the proud boast of Voltaire, who was foolish enough to say: \"In twenty years Christianity will be no more. My single hand shall destroy the edifice it took twelve apostles to rear.\" \"Some years after his death,\" say the orthodox, \"his very printing press was employed in printing New Testaments, and thus spreading abroad the gospel.\" Gibbon with solemn sneer devoted his gorgeous history[34] to sarcasm upon Christ and his followers. \"His estate,\" say the orthodox, \"is now in the hands of one who devotes large sums to the propagation of the very truth Gibbon labored to sap.\"[35] All this may be very well, but even in their day these men of the eighteenth century had a large following, and did much damage to orthodox belief. In fact, it is not inconsistent to claim that, in an indirect way, they were the forerunners of our new school of criticism; for many Christian scholars not satisfied with the answers made to the infidel writers of the eighteenth century have accepted the results of this new criticism as a solution of the difficulties urged against christianity by the infidels of the eighteenth century. It is time now to pause and summarize what has been thus far discussed: First, the divided state of Christendom of itself argues something wrong; for nearly every page of holy scripture urges the unity of Christ\u0027s Church. \"Is Christ divided?\"[36] is the ringing question that the apostle of the Gentiles asks the schismatically inclined church at Corinth. \"I beseech you, brethren,\" says he, \"by the name of our Lord Jesus Christ, that ye all speak the same thing, and that there be no division among you; but that ye be perfectly joined together in the same mind and the same judgment.\"[37] He then proceeds to tell them that they are utterly at fault in one saying that he was of Paul; another that he was of Apollos, and another that he was of Cephas.[38] What he would say of divided, not to say warring Christendom of today, one may not conjecture, further than to say that if the incipient divisions in Corinth provoked his condemnation, the open rupture and conflicting creeds of the Christianity of the nineteenth century would merit still harsher reproof. Second, the failure of Christianity to evangelize the world in nineteen centuries, sixteen of which, to all human judgment, appear to have been especially favorable to that evangelization, since at the back of Christianity stood the powerful nations of Europe whose commerce and conquests opened the gates of nearly all nations to Christian missionaries—argues some weakness in a religion bottomed on divine revelation and sustained through all these centuries (so Christians claim) by divine power. To be compelled to admit after all these centuries favorable to the establishment of Christianity that now only a little more than one-fourth of the population of our earth is even nominally Christian is to confess that the results do not do credit to a religion making the claims and possessing the advantages of Christianity. Third, the existence of a broad and constantly widening stream of unbelief, not only in Christian lands and apart from Christian communion, but within the very churches claiming to be churches of Christ, together with the inability of the orthodox to meet and silence the infidel revilers of the Christian religion—tells its own tale of weakness; and bears testimony of the insufficiency of the Christian evidences to bring conviction to the doubting minds of many sincere and moral people. All these considerations proclaim in trumpet-tones \"\u0027Tis time that some new prophet should appear.\" Mankind stand in need of a new witness for God—a witness who may speak not as the scribes or the pharisees, but in the clear, ringing tones of one clothed with authority from God. The world is weary of the endless wrangling of the scholastics. They settle nothing. Their speculations merely shroud all in profounder mystery, and beget more uncertainty. They darken counsel by words without knowledge. Therefore, to heal the schisms in Christendom; to bring order out of the existing chaos; to stay the stream of unbelief within the churches; to convert the Jews; to evangelize the world; to bring to pass that universal reign of truth, of peace, of liberty, of righteousness that all the prophets have predicted—the world needs a new witness for God. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3313/90548.html","bookId":403,"book":{"id":403,"title":"A New Witness for God","description":"简介： Three quarters of a century have passed away since Joseph Smith first declared that he had received a revelation from God. From that revelation and others that followed there has sprung into existence what men call a new religionMormonism; and a new...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3313","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
