{"id":36229,"no":20,"title":"CHAPTER XX.","content":"THE EVIDENCE OF PROPHECY Of all the means by which the claims of a prophet may be tested, it seems to me that an inquiry respecting the fulfillment of his prophecies is at once the most direct and positive. Has he prophesied; and have his prophecies been fulfilled? If they have, who can doubt the prophet\u0027s inspiration, or the revelations of God to him? This was the means which the Lord suggested to ancient Israel for the testing of the genuineness of a prophet\u0027s claims: \"And if thou shalt say in thy heart,\" said the Lord to Israel, \"How shall we know the word which the Lord hath not spoken? When a prophet speaketh in the name of the Lord, if the thing follow not, nor come to pass, that is the thing which the Lord hath not spoken, but the prophet hath spoken it presumptuously: thou shalt not be afraid of him.\"[1] And conversely, if the thing which the prophet speaks in the name of the Lord comes to pass, then the prophet has spoken the thing commanded him by the Lord—he has not spoken presumptuously and the people are under obligation to respect his message, since he has furnished them the highest possible evidence of his divine inspiration. I know of no more simple, yet common-sense and effective test than this. Of course it must be understood in applying it that many predictions which prophets utter may not come to pass immediately. Some of them perhaps not in the lifetime of the prophet, or even in the generation in which he lived; for some prophets have been given the power to look into the future, and predict things which the wheels of time will not bring due until the very last generation of men; but if when the time for the fulfillment of the prophecies uttered comes due they are not fulfilled, the world may know that the Lord did not speak through that prophet, but he has spoken presumptuously, without revelation from God, and the people need have no regard for him or his pretended messages. Of the value of the fulfillment of prophecy as evidence of divine inspiration it is scarcely necessary to speak. It has ever been recognized, and that properly, as a species of miracle; and therefore has been accorded all the value attached to miracles. The Lord himself has recognized the value of the evidence of prophecy; for when he would have Israel distinguish between himself and the gods of the heathens, he issued this challenge to them: \"Produce your cause, saith the Lord, bring forth your strong reasons, saith the King of Jacob. Let them bring them forth, and show us what shall happen: let them show the former things, and what they be, that we may consider them, and know the latter end of them; or declare us things for to come. Show the things that are to come hereafter, that we may know that ye are gods.\"[2] From this it appears that the power to foretell future events is regarded peculiarly as one belonging to God alone, or that spirit which emanates from him; and those who possess that power, and can point to the fulfillment of their prophecies in attestation of their inspiration and divine authority may be looked upon as possessing evidence of special and peculiar force in their favor. Before applying the test here purposed to the prophetic claims of Joseph Smith, I would remark that at least two things in relation to prophecy must be established: first, that the prediction ante-dates the events; and, second, that the events must be of a nature that no merely human foresight or judgment, unaided by divine inspiration or revelation, could have foretold them. Furthermore, I may add, that one\u0027s belief in the divine inspiration of a prophet would be materially increased, if his prophecies are of a nature to make them of importance either to the individuals or nations to whom they may be addressed. For I take it as a common-sense idea that God does not give revelation to men or inspire them in relation to trivial or unimportant things; but deals with those matters that are worthy of God\u0027s attention and communication. Hence in my opinion, many of those who have made pretensions to the prophetic gift stand condemned, because the things they bring forth are of a nature too trivial to be worthy the notice or intelligence of men, much less worthy the attention of God. The first prophecy to be considered is one not made by Joseph Smith, but one made of him by the angel Moroni, on the occasion of Joseph\u0027s first visit to the Hill Cumorah, when he beheld for the first time the plates from which he afterwards translated the Book of Mormon. But as Joseph Smith is the one who acquainted the world with this prediction I am about to quote, in a certain way it is his prophecy, and will answer all the purposes of a test such as I am making in this chapter. On the occasion of this interview with Moroni, before referred to, that the young prophet might not be deceived by the powers of darkness, he was given a vision of Satan and his hosts and their methods of deception. After the vision closed the angel said: \"Behold, notwithstanding you have seen this great display of power, by which you may be able to detect the Evil One, yet I give unto you another sign, and when it comes to pass then know that the Lord is God, and that he will fulfill his purposes, and that the knowledge that this record[3] contains will go to every nation, and kindred, and tongue and people under the whole heaven. This is the sign: When these things begin to be known, that is, when it is known that the Lord has shown unto you these things, the workers of iniquity will seek your overthrow: they will circulate falsehood to destroy your reputation, and also will seek your life; but remember this, if you are faithful, and shall hereafter continue to keep the commandments of the Lord, you shall be preserved to bring these things[4] forth; for in due time he will again give you a commandment to come and take them. When they[5] are interpreted, the Lord will give the Holy Priesthood to some, and they shall begin to proclaim this gospel and baptize by water, and after that they shall have power to give the Holy Ghost by the laying on of their hands. Then will persecution rage more and more: for the iniquities of men shall be revealed, and those who are not built upon the rock will seek to overthrow this work; but it will increase the more opposed, and spread farther and farther, increasing in knowledge till they[6] shall be sanctified and receive an inheritance where the glory of God shall rest upon them. * * * Your name[7] shall be known among the nations, for the work which the Lord will perform by your hands shall cause the righteous to rejoice and the wicked to rage; with one it shall be had in honor, with the other in reproach; yet with these it shall be a terror because of the great and marvelous work which shall follow the coming forth of this fullness of my gospel.\" It was in September, 1823, that these prophetic words were uttered by Moroni—four years before the plates of the Book of Mormon were given to Joseph Smith to translate;[8] six years before the Priesthood was given;[9] seven years before the church was organized;[10] and fourteen years before the knowledge contained in the Book of Mormon was sent to a foreign nation.[11] This prophecy, however, was first published to the world in 1834, in the Saints\u0027 Messenger and Advocate, and is taken from a letter of Oliver Cowdery\u0027s to W. W. Phelps, giving items of church history. Subsequently, in 1840, these letters were copied from the Messenger and Advocate into the Times and Seasons, from which I quote[12] the above predictions. The severe skeptic will insist that the prophecy can only be considered with reference to its fulfillment from the time it was published to the world in the Messenger and Advocate, in 1834; this at first glance would seem to cut down much of the prophetic part of the passages I am considering. It would cut out the prediction that notwithstanding the opposition that would be arrayed against the young prophet he would have power to bring forth the Book of Mormon; that the Lord would give the holy Priesthood to some; that they would begin to proclaim the gospel and baptize by water; and give the Holy Ghost by the laying on of hands. This much would be cut out by the skeptic because it could be alleged that all this it is claimed occurred before 1834, the time when the prophecy was first published. Let these items, then, be eliminated; and still the greater part of the prophecy remains to be fulfilled after 1834. The items left are, first, that a knowledge of what the Book of Mormon contains will go to every nation, and kindred, and tongue, and people under the whole heaven; second those not built upon the rock of truth will oppose the work of God, but it will increase the more it is opposed and spread farther and farther; third Joseph Smith shall be known among the nations because of the work the Lord would perform by his hands—by the righteous he would be held in honor, by the wicked in reproach. All this was fulfilled after 1834, though some of it was in process of fulfillment before and at that time—such as the work thriving in spite of opposition and the name of Joseph being received either in honor or reproach among the people. I now enter into a more particular consideration of the fulfillment of this prophecy. First, The knowledge of what the Book of Mormon contains will go to every nation, and kindred, and tongue, and people under the whole heavens. In 1834 the Book of Mormon had been published only in the English language, and but little was known of it even in the United States and Canada. Yet here is a prediction that it shall be known in all the world. Since then it has been published in the following languages: French, German, Danish, Italian, Dutch, Welsh, Swedish, Spanish, Hawaiian and Maori. It has also been translated but not yet published in Hindostanee and Modern Hebrew. Proclamation of the new dispensation, and hence also of the Book of Mormon, has been made by the elders of the church of Christ in the following nations: Great Britain, France, Germany, Holland, Belgium, Denmark, Sweden, Norway, Iceland, Finland, Italy, Switzerland, Hindostan, Malta, South Africa, Mexico, and to many of the Indian tribes of America; all the states of the American union, British America, Sandwich Islands, Samoa, Friendly Islands, New Zealand, West Indies, Turkey and Palestine. While this enumeration does not include the principal ones. That a knowledge of what the Book of Mormon contains will yet go to the remaining nations where the gospel has not yet been proclaimed, and into whose language the Book of Mormon has not yet been translated, cannot be doubted; for this item of the prophecy has been so nearly completed that the end is in sight; and if the church while in its infancy and childhood has done so much, it will not fail in its strong manhood to fulfill what remains. The proclamation of the knowledge which the Book of Mormon contains to all nations and peoples and tongues of the earth, is not an event which could have been foretold by human foresight, or shrewdness, in 1823, or even in 1834. The reception given up to that time to the Book of Mormon was anything but flattering. Only a very few people had received it. All the learned ridiculed it; the Christians mocked and rejected it because it was a new revelation. It will be remembered that it was the universal belief of Christians that the volume of revelation was completed and forever closed; and hence anything that claimed to be a new revelation was summarily rejected. In the face of all these circumstances it required more than mere human foresight on the part of a few obscure and persecuted followers of Joseph Smith to see that the time would come when proclamation of the knowledge contained in the Book of Mormon would be made in all the nations and tongues of the earth. Second, The work of the Lord will meet opposition, but it will increase the more it is opposed and spread farther and farther. The reader already knows that from its inception the work of the Lord in the new dispensation met with the most violent opposition. Only the year before Oliver Cowdery published this prophecy under consideration, twelve hundred of the Saints were driven from their lands and homes in Jackson County, Missouri, more than two hundred of their houses burned and much other property destroyed. But I am to prove that opposition met the church after 1834, and that in spite of that opposition the work increased, and a knowledge of it became more widely diffused. Be it so. Five years after the expulsion from Jackson County, Missouri, opposition so increased that the inhabitants of the state of Missouri, with the officers of the state at their head, arose against the Saints; directly or indirectly caused the death of some four hundred, and drove between twelve and fifteen thousand from their homes into exile, confiscated their lands, drove off their cattle and wantonly destroyed other property. Eight years after their expulsion from the state of Missouri, the Saints to the number of twenty thousand were driven by mob violence from the state of Illinois, into the wilderness. They fled beyond the confines of civilization—going a thousand miles beyond the frontiers of the United States, and settled in the wilds of the Rocky Mountains; where, despite the waves of persecution which have broken upon the church, it still lives, its membership more numerous than ever, the faith of the Saints more strongly established; and where from its lofty station it overlooks the world and sends its accredited representatives to all the peoples of the earth, to fulfill the decree of Jehovah that the gospel of the kingdom, in the last days, shall be preached in all the world for a witness and then shall the end come.[13] It was rather a remarkable prediction that the more the work of the Lord in the last days was opposed the more it would prosper. It was still more remarkable that it should be predicted that opposition would rise against it at all, since the great work had its birth in a land where the constitution of the government guaranteed religious liberty. The marvelous fulfillment of the prediction under these circumstances is evidence that there was behind it more than human foresight. Third, The name of Joseph Smith is to be known among the nations. The work which the Lord would perform by his hands would cause the righteous to rejoice and the wicked to rage: by the former his name would be held in honor, by the latter in reproach. The probability of Joseph Smith ever being known outside of the nation where he was born was very limited, even in 1834, much less when the prophecy was uttered by the angel in 1823. It was a strange thing to say that his name among the nations would be held either in honor or reproach. But the fulfillment of the prediction will be so generally conceded that to point out the fact is not necessary. It will be enough to say that everywhere the new dispensation of the gospel has been proclaimed, there the people have been made acquainted with the name of Joseph Smith, and there he is known for good or evil—he is held in honor or reproach—the righteous have rejoiced, the wicked have raged, and in many instances have resorted to violence in resisting the message of heaven. The fulfillment of the three items just considered in the prediction of Moroni proves the genuineness of the prophecy; and therefore I have a right to claim for it the date on which it was first delivered, the year 1823. And when considered from that date—when the existence of the Book of Mormon was as yet unknown except by Joseph Smith; when Joseph Smith was an obscure boy still in his teens and unknown outside of his own family and immediate neighborhood; before the Priesthood had been received, or the remission of sins obtained through baptism, or the Holy Ghost imparted by the laying on of hands; before the work of God prospered in spite of opposition—when considered from that date which places the prediction before all these events, how much more the prophetic character of the prediction stands out in bold relief! And who can question its divine inspiration? \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3313/90641.html","bookId":403,"book":{"id":403,"title":"A New Witness for God","description":"简介： Three quarters of a century have passed away since Joseph Smith first declared that he had received a revelation from God. From that revelation and others that followed there has sprung into existence what men call a new religionMormonism; and a new...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3313","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
