{"id":36230,"no":21,"title":"CHAPTER XXI.","content":"THE EVIDENCE OF PROPHECY—CONTINUED. Before the Church of Jesus Christ of Latter-day Saints was organized, a number of persons who had faith in the statement of Joseph Smith that he had in his possession the gold plates from which he was translating the Book of Mormon, and who believed him to be a prophet, came to inquire through him the will of the Lord concerning themselves in relation to the new dispensation about to be ushered in. Among those who thus came were the prophet\u0027s father, Joseph Smith, Sen., some time in February, 1829; Oliver Cowdery, April, 1829; Joseph Knight, Sen., May, 1829; and David Whitmer, June, 1829. The prophet inquired for the will of the Lord concerning these men as they requested, and received for them the word of the Lord through the Urim and Thummim. In each of these revelations is contained, with a little variation, the following prophecy: \"A great and marvelous work is about to come forth among the children of men * * * Behold the field is white already to harvest, therefore, whoso desireth to reap, let him thrust in his sickle with his might, and reap while the day lasts, that he may treasure up for his soul everlasting salvation in the kingdom of God; yea, whosoever will thrust in his sickle and reap, the same is called of God.\"[1] This prophecy that a great and marvelous work was about to come forth among the children of men, I say, was uttered before the translation of the Book of Mormon was completed or the church organized. How well it has been fulfilled let the history of the Church of Jesus Christ in the new dispensation, its present condition and the wonder with which the world regards it, answer. Of all the religions that have arisen since the days of Jesus Christ and the apostles, it is looked upon as the most marvelous; its growth, all things considered, has been most wonderful; it has a history the most thrilling; a present interest the most widespread; and a future that challenges more speculation than any other religious organization. The prophecy was a true one—a great and a marvelous work has come forth among the children of men. On the 24th of February, 1834, Joseph Smith received a revelation, making known to the church how to proceed concerning the brethren who had been driven from their homes in Jackson County, Missouri, the November previous. In that revelation occurs the following prophetic passage: \"Verily I say unto you, that I have decreed a decree which my people shall realize, inasmuch as they hearken from this very hour, unto the counsel which I, the Lord their God, shall give unto them. Behold they shall, for I have decreed it, begin to prevail against mine enemies from this very hour, and by hearkening to observe all the words which I, the Lord their God, shall speak unto them, they shall never cease to prevail until the kingdoms of the world are subdued under my feet, and the earth is given unto the Saints, to possess it forever and ever. But inasmuch as they keep not my commandments, and hearken not to observe all my words, the kingdoms of the world shall prevail against them, for they were set to be a light unto the world, and to be saviors of men; and inasmuch as they are not the saviors of men, they are as salt that has lost its savor, and is thenceforth good for nothing but to be cast out and trodden under foot of men. But verily I say unto you, I have decreed that your brethren which have been scattered shall return to the land of their inheritances, and build the waste places of Zion; for after much tribulation, as I have said in a former commandment, cometh the blessing. Behold this is the blessing which I have promised after your tribulations, and the tribulations of your brethren; your redemption and the redemption of your brethren, even their restoration to the land of Zion, to be established no more to be thrown down; nevertheless if they pollute their inheritances they shall be thrown down, for I will not spare them if they pollute their inheritances.\"[2] Condensed the prophecy stands thus: (1) The Saints from the 24th of February, 1834, are to begin to prevail over God\u0027s enemies; and are to continue to prevail until the kingdoms of this world are subdued under his feet—provided they hearken to his counsel: the kingdoms of this world will prevail against the saints if they hearken not to the counsels of God: (2) After much tribulation the Saints shall return and build up the waste places of Zion—they are to be restored to the land of Zion; and Zion is to be established, never more to be thrown down—provided the Saints pollute not their inheritances. The first part of the prophecy has had a remarkable fulfillment. Though there have been individuals in the church of Christ who have failed to walk in the holy counsels of God, and have reaped an abundant harvest of sorrow and shame, and many have made complete shipwreck of faith, still the church as a whole has kept reasonably well the counsel of God. The Saints may not have attained to that ideal obedience to the will of God which all recognize as desirable; but human weakness and all the circumstances by which they have been surrounded considered, I repeat that the church has reasonably well walked in accordance with the counsels of the Lord; and as a result has prevailed, so far, over all the powers that have been arrayed for its destruction. In proof of this let the present condition of the church be contrasted with what it was in February, 1834. At the time the prophecy of 1834 was uttered, a great part of the church was scattered along the Missouri bottoms, in Clay County, Missouri. The Saints had just been driven from their houses and lands in Jackson County, and were living in log huts and dug-outs,[3] and subsisting, for the time being, upon the charity of the people of Clay County. The rest of the church was scattered in branches through several states of the American union and Canada. They were without wealth, or influence; derided, scorned, distrusted, hated. Indeed, it is difficult to even imagine a situation more hopeless than that occupied by the church of Christ when this prophecy was uttered. It would be difficult to determine with any exactness the membership of the church in 1834, or the number of branches; but certainly the membership did not exceed six or eight thousand. Now[4] the membership of the church in Utah and the surrounding states and territories is more than two hundred and fifty thousand, besides those scattered throughout the United States, Europe and the Pacific Islands. There are about five hundred organized wards, grouped into thirty-six stakes of Zion,[5] each with its high council, its high priests\u0027 quorum, its several elders\u0027 quorums, etc. In addition to this there are in all the wards female relief societies, improvement associations for both sexes, the primary societies for younger children. There are 504 Sunday schools, with a total membership of 100,000. In 1834 the church had no temple; but now it has four magnificent temples wherein are performed the ordinances of the gospel both for the living and for the dead. Though but few individuals in the church can be considered wealthy, yet the Saints are a prosperous, contented, happy people. A greater percentage of them own the homes they live in and the lands they cultivate than is the case with any other community in the world; and they are freer than any other people on earth from those difficulties which perplex mankind. Peace is in their habitations, God is honored at the family altars as well as in the public sanctuaries; faith and confidence in God abound, and on every hand are evidences that the Lord has owned them and blessed them as his people. It is true that the church has had its tribulations. Immunity from them was not promised. The expulsion from the state of Missouri; the exodus from Illinois; the subsequent journey into the wilderness; the desperate struggle for existence in the early days of Utah; the judicial crusade waged against the church during the last decade; these events and all the bloodshed, wholesale imprisonment, and the suffering and sorrow incident to them rise up to proclaim that mob violence and other forces of this world have been employed to destroy the work of God, but they have not prevailed. The church of Christ still exists; its members are more numerous and stronger in faith than ever before; the Saints are more perfectly organized, happier circumstanced, more experienced; they are more confident of God\u0027s sustaining power, more convinced of their high destiny and the complete fulfillment of this noble prophecy, namely, that if they continue to hearken to the counsels of the Lord, they will continue to prevail until the kingdoms of this world are subdued under his feet, and the earth given to the Saints to possess it forever and ever. Of the second division of the prophecy little need be said, except that the first part of it, viz: that which relates to the tribulation which is to befall the Saints previous to the redemption of Zion has been, in part at least, fulfilled; and like the partial fulfillment of the first division of the prophecy, gives good earnest of the complete accomplishment of all that it predicts. In the fall of 1838, the city of Far West, inhabited by the Saints, fell into the hands of the mob forces of Missouri, and Joseph Smith and a number of his brethren, viz., his brother Hyrum Smith, Sidney Rigdon, Parley P. Pratt, Lyman Wight, George W. Robinson and Amasa Lyman were betrayed into their hands. These men were torn from their families in the most brutal manner. They were tried off hand by a court-martial of the mob officers, and condemned to be shot on the public square of Far West in the presence of their families and the Saints; but one of the officers of the mob-militia—General Doniphan—refused to sanction the murder and declared he would not allow his men to witness it. The other officers were afraid to assume the responsibility of executing the court-martial decision, and the prisoners escaped the fate designed for them. Charges of the most serious nature, including murder, arson, and robbery were then trumped up against them, intending to encompass their execution under civil procedure. Amidst the proud boasts of their captors, who brutally told their heart-broken families and the Saints that they had seen the last of their prophet, a start was made with the prisoners for Independence, Jackson County. The prospects of the betrayed men were most desperate. They were in the hands of a reckless mob whose hatred of them was intense. There was little respect at the time for law in the state. In the language of General Clark (Commander-in-Chief of the mob-militia of the state, then assembled at Far West) addressed to the Saints, their fate seemed fixed, their die cast, their doom sealed.[6] The start for Independence was made on the 2nd of November; the following morning, after spending a most wretched night, encamped on the banks of Crooked River, Joseph Smith spoke to his fellow-prisoners in low but cheerful and confident tones, and uttered this prophecy: \"Be of good cheer, brethren, the word of the Lord came to me last night that our lives should be given us, and that whatever we may suffer during this captivity, not one of our lives should be taken.\" \"Of this prophecy,\" says Elder Parley P. Pratt, \"I testify in the name of the Lord, and though spoken in secret, its public fulfillment and the miraculous escape of each of us is too notorious to need my testimony.\"[7] After enduring five weary months of captivity, which had been spent in a loathsome prison, and when the heart of the prophet was breaking within him because of the affliction of his people, betrayed by false brethren and oppressed by those in power, the word of the Lord came to him saying: \"The ends of the earth shall enquire after thy name, and fools shall have thee in derision, and hell shall mock against thee, while the pure in heart and the wise, and the noble and the virtuous shall seek counsel, and authority and blessings constantly under thy hands. And thy people shall never be turned against thee by the testimony of traitors. And although their influence shall cast thee into trouble, and into bars and walls, thou shalt be had in honor, and but for a small moment and thy voice shall be more terrible in the midst of thine enemies than the fierce lion, because of thy righteousness; and thy God shall stand by thee forever and ever.\"[8] This prophecy is contained in a letter written by the prophet and his fellow-prisoners from Liberty jail, and addressed to the Saints then settling in Quincy, Illinois, to \"those scattered abroad\" and \"to Bishop Edward Partridge in particular.\" It was written in March, 1839. The fulfillment of the prophecies contained in the above extract are notorious. While fools hold the name of the prophet in derision the wise and the virtuous from the ends of the earth have inquired and are inquiring after Joseph Smith, and the work he established; and though there were many who turned against him and became strong enemies, for they were strong men, his people were never turned against him by the testimony of traitors. While living his people were true to him, and since his death they have revered his memory. On the 8th of July, 1838, a revelation was given concerning the quorum of the Twelve Apostles. A number of vacancies existed in this quorum occasioned through apostasy of several of its members; these vacancies the prophet was commanded to fill; \"And next spring,\" said the revelation, \"let them [the apostles] depart to go over the great waters, and there promulgate my gospel, the fullness thereof, and bear record of my name. Let them take leave of my Saints in the city of Far West, on the 26th day of April next, on the building spot of my house,[9] saith the Lord.\"[10] Before the date appointed in the revelation for the Twelve to take leave of the Saints at Far West for a foreign mission, viz., the 26th of April, 1839, that city had fallen into the hands of the mob, the church leaders were cast into prison, the apostles were scattered and the great body of the church driven from the state. In the midst of these circumstances it was a matter of open boasting with the mob that there was at least one of \"old Joe Smith\u0027s\" revelations that would fail.[11] They said that there would be no meeting of the Twelve with the Saints on the 26th of April, 1839. But a consultation of the apostles who escaped from Missouri was held early in the spring of 1839, at Quincy, and they resolved return to Far West and fulfill the Lord\u0027s commandment, which, as the reader will perceive, partook of the nature of a prophecy. The undertaking was successful. Five of the apostles were at the temple site before day light of the day appointed, together with a number of high priests, elders and priests. At this meeting they excommunicated a number of persons from the church, ordained Wilford Woodruff and George A. Smith apostles, and others were ordained to the office of seventy. The apostles each prayed in turn, and a beautiful hymn called \"Adam-Ondi-Ahman\" was sung. At the conclusion of the hymn, Elder Alpheus Cutler, the master workman of the Lord\u0027s House, laid the south-east corner stone in its position, and stated that in consequence of the peculiar situation of the Saints it was deemed prudent to discontinue further labor on the house until the Lord should open the way for its completion. The apostles then took leave of some seventeen Saints who were present and started on their way to fulfill their missions beyond the Atlantic. Thus the commandment and prophecy which the mobs of Missouri so confidently boasted should fail, were fulfilled. In a revelation given in March, 1831, after telling some of the judgments and commotions which shall precede the glorious coming of the Lord Jesus, occurs this prophecy: \"But before the great day of the Lord shall come, Jacob shall flourish in the wilderness, and the Lamanites [the American Indians] shall blossom as the rose. Zion shall flourish upon the hills and rejoice upon the mountains, and shall be assembled together unto the place which I have appointed.\"[12] In order to have a complete understanding of this prophecy it is necessary to explain that the word \"Zion\" refers not only to a land called Zion, and a city called Zion, but also to a people, as will be clearly seen in the above, where \"Zion\" is not only to rejoice upon the mountains, but is also to \"be assembled together,\" which really could only be consistently said of a people. In another revelation the Lord says: \"Let Zion rejoice, for this is Zion, the pure in heart; therefore, let Zion rejoice, while all the wicked shall mourn.\"[13] With this explanation of the word \"Zion\" let us now consider the prophecy: First, then, before the great and dreadful day of the Lord, Jacob, that is Israel, or descendants of Israel, shall flourish in the wilderness. Second, the American Indians shall blossom as the rose, that is, they will be in a blessed and happy condition. Third, Zion, the pure in heart, the Saints of God, shall flourish upon the hills, rejoice upon the mountains and shall be assembled together unto the place which the Lord has appointed. The parts of the prophecy which are in progress of fulfillment are the first and third items. Israel is flourishing in the wilderness, and Zion, or the Saints of God, who are also, for the most part, descendants of Israel gathered from among the Gentile nations are rejoicing upon the mountains; and though the Lamanites are not yet blossoming as the rose, neither has \"the great day of the Lord\" come; and before that day does come, this second item of the prophecy, referring to the Lamanites, will be fulfilled. Let it be borne in mind that the prophecy was uttered in March, 1831, long ere the Saints had so much as dreamed of settling in the Rocky Mountains. At this juncture I may be permitted to introduce another prophecy of Joseph Smith\u0027s relating to this same subject, and then consider the fulfillment of both at once. Under date of August 6th, 1842, the prophet records the following in his history: \"Passed over to Montrose, Iowa, in company with General Adams, Colonel Brewer and others, and witnessed the installation of the officers of the Rising Sun Lodge of the Ancient York Masons, at Montrose, by General James Adams, deputy grand master of illinois. While the deputy grand master was engaged in giving the requisite instructions to the master elect, I had a conversation with a number of brethren, in the shade of the building, on the subject of our persecutions in Missouri, and the constant annoyance which has followed us since we were driven from that state. I prophesied that the Saints would continue to suffer much affliction and would be driven to the Rocky Mountains, many would apostatize, others would be put to death by our persecutors, or lose their lives in consequence of exposure or disease; and some of you will live to go and assist in making settlements and build cities and see the Saints become a mighty people in the midst of the Rocky Mountains.[14]\" At that date, August 6th, 1842, the Rocky Mountains seemed like a country afar off to the people of Illinois. The Missouri River was the extreme frontiers of the United States. All beyond that was well nigh an unexplored wilderness filled with savages. The church was fairly settled at Nauvoo, the state authorities were apparently very friendly, the future of the Saints in Illinois seemed propitious. Yet in the midst of all these favorable circumstances the prophet predicted much affliction for some of the Saints, death from persecution for others, apostasy for many, and for the great body of the church an exodus to the Rocky Mountains, where some of those present who were listening to the prediction, should live to assist in making settlements and building cities in the Rocky Mountains where they would see the Saints become a mighty people. There can be no question as to the reality of these two predictions, the one of March, 1831, and the other of August, 1842, or of their being of a character to test the divine inspiration of him who uttered them. That they were proclaimed some years before the events predicted in them began to be fulfilled, or even there was any thought or prospect of such events taking place, is well known; that the latter prophecy has been fulfilled to the uttermost, the whole history of the Church of Jesus Christ of Latter-day Saints from August, 1842, until now witnesses. The Saints suffered many afflictions in Illinois. Their homes, fields, stacks of grain, stock and other property were destroyed; their prophets and a number of others were killed outright by mob violence; many more perished from exposure and disease occasioned by being driven from their homes at an inclement season of the year. In those trying times, following the martyrdom of the prophet and the expulsion from Nauvoo, many turned away from the faith, and it is too generally known to need comment, that the great body of the church made its way to the Rocky Mountains, where cities, towns and villages have been founded, the wilderness subdued, and the Saints are fast becoming a mighty people. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3313/90642.html","bookId":403,"book":{"id":403,"title":"A New Witness for God","description":"简介： Three quarters of a century have passed away since Joseph Smith first declared that he had received a revelation from God. From that revelation and others that followed there has sprung into existence what men call a new religionMormonism; and a new...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3313","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
