{"id":12602,"no":24,"title":"Chapter 23 The Angel","content":"As I drifted, I dreamed. 　　Where I floated, under the dark water, I heard the happiest sound my mindcould conjure up — as beautiful, as uplifting, as it was ghastly. It wasanother snarl; a deeper, wilder roar that rang with fury. 　　I was brought back, almost to the surface, by a sharp pain slashing my upraised hand, but I couldn\u0027t find my way back far enough to open my eyes. 　　And then I knew I was dead. 　　Because, through the heavy water, I heard the sound of an angel callingmy name, calling me to the only heaven I wanted. 　　\"Oh no, Bella, no!\" the angel\u0027s voice cried in horror. 　　Behind that longed-for sound was another noise — an awful tumult that mymind shied away from. A vicious bass growling, a shocking snapping sound,and a high keening, suddenly breaking off…I tried to concentrate on the angel\u0027s voice instead. 　　\"Bella, please! Bella, listen to me, please, please, Bella, please!\" hebegged. 　　Yes, I wanted to say. Anything. But I couldn\u0027t find my lips. 　　\"Carlisle!\" the angel called, agony in his perfect voice. \"Bella, Bella,no, oh please, no, no!\" And the angel was sobbing tearless, broken sobs. 　　The angel shouldn\u0027t weep, it was wrong. I tried to find him, to tell himeverything was fine, but the water was so deep, it was pressing on me,and I couldn\u0027t breathe. 　　There was a point of pressure against my head. It hurt. Then, as thatpain broke through the darkness to me, other pains came, stronger pains. 　　I cried out, gasping, breaking through the dark pool. 　　\"Bella!\" the angel cried. 　　\"She\u0027s lost some blood, but the head wound isn\u0027t deep,\" a calm voiceinformed me. \"Watch out for her leg, it\u0027s broken.\"A howl of rage strangled on the angel\u0027s lips. 　　I felt a sharp stab in my side. This couldn\u0027t be heaven, could it? Therewas too much pain for that. 　　\"Some ribs, too, I think,\" the methodical voice continued. 　　But the sharp pains were fading. There was a new pain, a scalding pain inmy hand that was overshadowing everything else. 　　Someone was burning me. 　　\"Edward.\" I tried to tell him, but my voice was so heavy and slow. Icouldn\u0027t understand myself. 　　\"Bella, you\u0027re going to be fine. Can you hear me, Bella? I love you.\"\"Edward,\" I tried again. My voice was a little clearer. 　　\"Yes, I\u0027m here.\"\"It hurts,\" I whimpered. 　　\"I know, Bella, I know\" — and then, away from me, anguished — \"can\u0027t youdo anything?\"\"My bag, please… Hold your breath, Alice, it will help,\" Carlislepromised. 　　\"Alice?\" I groaned. 　　\"She\u0027s here, she knew where to find you.\"\"My hand hurts,\" I tried to tell him. 　　\"I know, Bella. Carlisle will give you something, it will stop.\" \"My hand is burning!\" I screamed, finally breaking through the last ofthe darkness, my eyes fluttering open. I couldn\u0027t see his face, somethingdark and warm was clouding my eyes. Why couldn\u0027t they see the fire andput it out? 　　His voice was frightened. \"Bella?\"\"The fire! Someone stop the fire!\" I screamed as it burned me. 　　\"Carlisle! Her hand!\"\"He bit her.\" Carlisle\u0027s voice was no longer calm, it was appalled. 　　I heard Edward catch his breath in horror. 　　\"Edward, you have to do it.\" It was Alice\u0027s voice, close by my head. Coolfingers brushed at the wetness in my eyes. 　　\"No!\" he bellowed. 　　\"Alice,\" I moaned. 　　\"There may be a chance,\" Carlisle said. 　　\"What?\" Edward begged. 　　\"See if you can suck the venom back out. The wound is fairly clean.\" AsCarlisle spoke, I could feel more pressure on my head, something pokingand pulling at my scalp. The pain of it was lost in the pain of the fire. 　　\"Will that work?\" Alice\u0027s voice was strained. 　　\"I don\u0027t know,\" Carlisle said. \"But we have to hurry.\"\"Carlisle, I…\" Edward hesitated. \"I don\u0027t know if I can do that.\" Therewas agony in his beautiful voice again. 　　\"It\u0027s your decision, Edward, either way. I can\u0027t help you. I have to getthis bleeding stopped here if you\u0027re going to be taking blood from herhand.\"I writhed in the grip of the fiery torture, the movement making the painin my leg flare sickeningly. 　　\"Edward!\" I screamed. I realized my eyes were closed again. I openedthem, desperate to find his face. And I found him. Finally, I could seehis perfect face, staring at me, twisted into a mask of indecision andpain. 　　\"Alice, get me something to brace her leg!\" Carlisle was bent over me,working on my head. \"Edward, you must do it now, or it will be too late.\"Edward\u0027s face was drawn. I watched his eyes as the doubt was suddenlyreplaced with a blazing determination. His jaw tightened. I felt hiscool, strong fingers on my burning hand, locking it in place. Then hishead bent over it, and his cold lips pressed against my skin. 　　At first the pain was worse. I screamed and thrashed against the coolhands that held me back. I heard Alice\u0027s voice, trying to calm me. 　　Something heavy held my leg to the floor, and Carlisle had my head lockedin the vise of his stone arms. 　　Then, slowly, my writhing calmed as my hand grew more and more numb. Thefire was dulling, focusing into an ever-smaller point. 　　I felt my consciousness slipping as the pain subsided. I was afraid tofall into the black waters again, afraid I would lose him in the darkness. 　　\"Edward,\" I tried to say, but I couldn\u0027t hear my voice. They could hearme. 　　 \"He\u0027s right here, Bella.\"\"Stay, Edward, stay with me…\"\"I will.\" His voice was strained, but somehow triumphant. 　　I sighed contentedly. The fire was gone, the other pains dulled by asleepiness seeping through my body. 　　\"Is it all out?\" Carlisle asked from somewhere far away. 　　\"Her blood tastes clean,\" Edward said quietly. \"I can taste the morphine.\"\"Bella?\" Carlisle called to me. 　　I tried to answer. \"Mmmmm?\"\"Is the fire gone?\"\"Yes,\" I sighed. \"Thank you, Edward.\"\"I love you,\" he answered. 　　\"I know,\" I breathed, so tired. 　　I heard my favorite sound in the world: Edward\u0027s quiet laugh, weak withrelief. 　　\"Bella?\" Carlisle asked again. 　　I frowned; I wanted to sleep. \"What?\"\"Where is your mother?\"\"In Florida,\" I sighed. \"He tricked me, Edward. He watched our videos.\"The outrage in my voice was pitifully frail. 　　But that reminded me. 　　\"Alice.\" I tried to open my eyes. \"Alice, the video — he knew you, Alice,he knew where you came from.\" I meant to speak urgently, but my voice wasfeeble. \"I smell gasoline,\" I added, surprised through the haze in mybrain. 　　\"It\u0027s time to move her,\" Carlisle said. 　　\"No, I want to sleep,\" I complained. 　　\"You can sleep, sweetheart, I\u0027ll carry you,\" Edward soothed me. 　　And I was in his arms, cradled against his chest — floating, all the paingone. 当我感觉自己在漂浮的时候，我做梦了。 当我漂浮着，沉入黑暗的水底的时候，我听到了我的脑子所能想象到的最令我愉快的声音——美丽的，令人振奋的声音，尽管它听起来是那么的吓人。那是另一阵咆哮声，一阵更加深邃的，更加野蛮的，充满狂怒咆哮。 我被举起的手臂上传来的剧烈的疼痛拉了回来，几乎要回到水面上了。但我的意识依然涣散着，没法让自己睁开眼睛。 然后，我知道自己已经死了。 因为，透过厚重的水面，我听到了一个天使的声音，他正呼唤着我的名字，呼唤我到达我唯一想要的天堂。 “哦不，贝拉，不！”天使的声音惊恐地大喊着。 在那充满渴望的声音背后，是另外一种嘈杂的声音——一阵我的脑子努力回避着的，吓人的骚动。一个邪恶的男低音咆哮着，一阵可怕的咔嚓声，然后是一声高亢的哀号，忽然间中断了…… 我试图不去理会那些噪音，把注意力集中到天使的声音上。 “贝拉，求你了！贝拉，听我说话，求你了，求你了，贝拉，求你了！”他恳求着。 好的。我想这样说。无论你想说什么。但我找不到我的嘴唇。 还有另外一种压力刺激着我的头。是一种疼痛。然后，当这种疼痛冲破黑暗向我袭来时，另一阵疼痛袭来，是更加强烈的痛楚。我尖叫起来，喘息着，冲出了那个黑暗的池子。 “贝拉！”天使大喊道。 “她有点失血过多，但她的头伤得并不重。”一个冷静的声音告诉我。“当心她的腿，它折断了。” 一声狂怒的咆哮被天使死死咬在唇边。 我感到身体的一侧有一种钻心的疼痛。我不可能是在天堂，不是吗？这里太痛苦了。 “还有一些毒液，我想。”那个有条不紊的声音继续说着。 但那种尖锐的疼痛正渐渐褪去。我又感到了一种新疼痛，我的手上传来一种灼烧的疼痛，这种痛楚比其他任何别的疼痛都要强烈。 某人正灼烧着我。（Someone was burning me。。。） “爱德华。”我试图告诉他，但我的声音是那么的沉重和迟缓。我甚至听不懂自己在说什么。 “贝拉，你会好起来的。你能听到我说话吗，贝拉？我爱你！” “爱德华。”我又试了一次。我的声音清楚一点了。 “是的，我在这儿。” “很痛。”我耳语着。 “我知道，贝拉，我知道”——然后，他的声音离我而去，显得很痛苦——“你不能做点什么吗？” “请你去拿我的包……屏住呼吸，爱丽丝，这会很管用。”卡莱尔保证道 “爱丽丝？”我低吟着。 “她在这里。她知道上哪儿找你。” “我的手很痛。”我试图告诉他。 “我知道，贝拉。卡莱尔会给你注射一点东西，给你止痛。” “火！快来人把火扑灭！”我尖叫着，火焰灼烧着我。 “卡莱尔！她的手！” “他咬了她。”卡莱尔的声音不再平静，开始惶恐起来。（我忽然明白了卡伦们那时为什么不放着不管让贝拉转变。。。他们觉得在贝拉有另一种选择时，这样做是在犯罪。。。） 我听到爱德华恐惧地屏住了呼吸。 “爱德华，你必须这样做。”那是爱丽丝的声音，就在靠近我头部的地方传来。冰冷的指尖轻轻抹去了我眼角的泪珠。 “不！”他吼道。 “爱丽丝。”我呻吟着。 “这也许是个机会。”卡莱尔说道。 “什么？”爱德华恳求着。 “看你能否把毒液吸出来。这个伤口相当干净。”卡莱尔说话时，我能感到我的头部传来的压迫感，某种东西正戳探着，牵扯着我的头皮。（。。。我之前一直没弄懂，难道是卡莱尔在清理贝拉头上的玻璃碎片？）但这种痛楚消失在了火焰带来的疼痛中。 “这会有用吗？”爱丽丝的声音听起来很紧张。 “我不知道。”卡莱尔说道。“但我们得抓紧时间。” “卡莱尔，我……”爱德华迟疑着。“我不知道自己能否做到。”痛苦再次出现在了他美丽的声音里。 “总之，这得由你来决定，爱德华。我帮不了你。如果你打算从她手上把毒血吸掉的话，我得让这里止血。” 我困住那阵炽热的折磨中，痛苦地翻滚着，这个举动让我腿上的疼痛若隐若现，这简直令人厌恶。 “爱德华！”我尖叫着。我发觉自己的眼睛又闭上了。我睁开双眼，不顾一切地想要找到他的脸，然后，我找到他了。我终于看到了他那完美的面孔，他正注视着我，他的五官扭曲成一张写满了犹豫和痛苦的面具。 “爱丽丝，给我点东西固定她的腿！”卡莱尔向我俯下身来，在我的头上忙碌着。“爱德华，你必须现在就做，否则就太迟了。” 然后，慢慢地，我的翻滚渐渐平息下来，我的手变得越来越麻木。火焰慢慢地褪去，集中在了一个更小的点上。 我感觉到，随着疼痛渐渐消失，我的意识也渐渐淡薄起来。我怕再次落入那黑暗的水中，害怕自己会在黑暗中失去他。 “爱德华。”我试图说话，但我根本听不见自己的声音。他们能听见我的声音。 “他就在这里，贝拉。” “留下来，爱德华，留下来陪我……” “我会的。”他的声音很紧张，但不知怎的，却洋溢着某种胜利的喜悦。 我试图回答。“嗯？” “火焰消失了吗？” “是的。”我叹息着。“谢谢你，爱德华。” “我爱你。”他答道。 “我知道。”我低声说着，感到那么的疲惫。 我听到了在这世界上我最爱的声音：爱德华安静的笑声，他的声音因为宽慰而有些无力。 “贝拉？”卡莱尔又问道。 我皱起了眉头。我只想睡觉。“什么？” “你母亲在哪里？” “在佛罗里达。”我叹了口气。“他骗了我，爱德华。他看了我们的录像。”我声音里的愤怒微弱得可悲。 但这提醒了我。 “爱丽丝。”我试图睁开眼睛。“爱丽丝，那段视频——他认识你，爱丽丝，他知道你从哪里来。”我刻意说得紧迫些，但我的声音太虚弱了。“我闻到了汽油的味道。”我补充道，惊讶穿透了我脑海里的薄雾。 “是时候挪动她了。”卡莱尔说道。 “不，我只想睡觉。”我抱怨道。 “你尽管睡，甜心，我会抱着你的。”爱德华安抚着我。 然后，我落入了他的环抱，就好像躺在摇篮里一样，紧贴着他的胸膛——我在漂浮着，所有的疼痛都消失了。 “睡吧，贝拉。”这是我所听到的最后一句话。","sourceLink":"http://novel.tingroom.com/shuangyu/139/5916.html","bookId":340,"book":{"id":340,"title":"暮光之城：暮色 Twilight","description":"简介： 17岁的女主角贝拉斯旺是一个天生运动神经差、皮肤苍白得像生病一样的普通女孩。在搬到福克斯这个偏僻且终年阴雨的小镇后，结识了一个神秘的同班男同学爱德华库伦。这个男同学来自一个素食的吸血鬼家族，但是当他闻到贝拉身上的特殊香气时，他就想吸她的血。经过一段时间...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1291865189ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/139","creation":"Aug 1, 2019 12:18:37 AM","modification":"Aug 1, 2019 12:18:37 AM"}}
