{"id":80968,"no":11,"title":"Page 11","content":"THEY HEADED OUT INTO THE BLACKNESS of the compound, the beat of the helicopter\u0027s blades getting closer. Rebecca saw its lights less than a half-mile northwest, saw that it was hovering, shining a spotlight down onto the desert-like plain. The van, they\u0027ve spotted the van. Claire saw it too, but David was looking at the warehouse-type buildings behind them as he unslung his rifle, his intense gaze taking in the layout. Rebecca could hardly see him in the pale moonlight. \"They\u0027ll have to set down outside the fence,\" he said. \"Follow me, and stay close.\" He jogged off into the darkness, the burr of the helicopter growing steadily behind them. God, I hope he sees better than I can, Rebecca thought, clutching her nine-millimeter tightly, the metal cold against her numb fingers. She and Claire jogged after him as he headed for one of the dark structures, the second from the left in the line of five. Why he\u0027d picked that one she didn\u0027t know, but David would have a reason, he always did. They ran into the corridor of black between the first and second building, fifteen feet of hard-packed arid sediment that stretched ahead of them some indeter- minate distance. The freezing air burned into her lungs, gusting out in clouds of steam she couldn\u0027t see. The whackawhacka sound of the \u0027copter drowned out their footsteps, drowned out most of what David was saying as he stopped, a door on either side of them. \"... to hide until we... can\u0027t... back...\" Rebecca shook her head and David gave it up, turning to the left, pointing his weapon at the door of the first building. Rebecca and Claire moved behind him, Rebecca wondering what he was up to; if the people from the helicopter landed to search - which they surely would - the bullet-riddled door would give them away. It looked to be made from some high- density plastic, but wasn\u0027t remarkable in any other way - it had a handle and keyhole rather than a card swipe. The building itself was some kind of stucco material, dirty and dusty, and no particular color that she could tell; the one behind them looked the same; there were no windows on either. The helicopter\u0027s searchlight was sweeping the fence at the front of the compound, its brightness piercing the cold dark like a brilliant flame. Flurries of dust were swirling up into the light, staining it, and Rebecca thought they had maybe a minute before it found them; the compound just wasn\u0027t that big. Bambambambambam! Most of the noise was swallowed up by the roar of the helicopter. Even in the darkness, Rebecca could see the line of holes, the concentration of them near the handle. David stepped forward and gave the door a hard kick, then a second - and it flew inward, a gaping black hole in the wall. The searchlight was moving back through the com-pound, the helicopter\u0027s swollen belly passing almost directly overhead as it shone its beam down on the other side of the first building, the thunder of its engine and billowing clouds of dust and making Rebecca feel as though Death were approaching; not death, but Death, some fabled beast of merciless power and relentless intention... David turned and grabbed her and Claire both, pushing them firmly toward the open door. As soon as they were through, he motioned for them to stop and to wait. David pulled his handgun and jogged across the open space, standing close to the second build-ing\u0027s door, angling his body and......BAM, the nine-millimeter round, louder than the rifle\u0027s.223s but still almost lost, as the helicopter started its sweep up their row and the door blasted inward and David leapt through the opening, just as the blinding light illuminated the ground between them. A half-second later and he would have been caught in the light. The spent casings from David\u0027s weapons were thankfully lost in the furor, spinning clouds of dust whipping up and over them and making it hard to breathe. She turned, saw that Claire had tucked her face down into her black sweatshirt, and followed suit. The cold, thick air was filtered through the fleece, and in spite of the deafening noise, Rebecca could hear her heartbeat in her ears, rapid and afraid. A second later, the light was past; a second after that the dust seemed to be settling, it was hard to tell in the black; the sudden absence of light meant their eyes would have to readjust. \"Are you alright?\" Rebecca jumped as David practically screamed in her face, just a shadow in front of her. Claire let out a little shriek. \"Sorry!\" David called. \"Come on! Other building!\" Barely able to see, Rebecca stumbled outside, Claire right next to her. David came up behind them, touching their backs, guiding them toward the second building. The \u0027copter was still moving away from them, north to south, but it would run out of things to look at very soon - and then they\u0027d land and come looking. That the helicopter was from Umbrella was a given; the only question was how many had come, and whether or not they were to be captured first or just killed outright. As they fell through the door to the second build- ing, it dawned on Rebecca what David had done. The Umbrella thugs would see the first bullet-blasted door and assume that their quarry was hiding there. And he only shot through the keyhole of this one. They\u0027ll see it eventually, but it buys us a little more time... She hoped. The darkness was almost as cold as outside and smelled like dust. A low light flickered on, David hooding his flashlight with one hand, just enough for them to see that they were surrounded by boxes. Big ones, small ones, cardboard and wood, stacked on shelves and on the floor all the way up to the slanted ceiling. In the brief second that David shone the light across the mammoth room, they saw that there had to be thousands of them. \"I\u0027m going to see what I can do about the door and cut the lights,\" David said. \"Find us a place to hide. It\u0027s our best option until we know how many there are, what scenario they\u0027re employing. They might have spook eyes, the floor\u0027s no good - somewhere high up and in a corner. Shelves would be best. Got it?\" They both nodded and the light went out, leaving them in a complete darkness; before, she could at least make out shapes and shadows. Now, Rebecca couldn\u0027t see her hand in front of her face. \"Which corner?\" Claire whispered, as if the chill black nothing they stood in demanded silence. Rebecca reached out and found Claire\u0027s hand, placing it against her back. \"Left. We go left until we run into something.\" She heard a whisper of movement behind them, as David went about his preparations. Taking a deep breath, Rebecca put her hands out in front of her and started to edge forward. Every door off of the lengthy corridor was locked, with the exception of a utility closet past the elevator; there, they found absolutely nothing of interest, un- less shelves of paper towels and styrene coffee cups were interesting. They\u0027d tried the elevator again, with no luck, and there didn\u0027t seem to be a fuse box or override switch anywhere near it. Not surprising, but Leon still felt a pang of distress. The other three were probably really worried... ... and you\u0027re not? What if something went wrong up there? Maybe the \"test\" part of this place is above-ground. And maybe Reston unleashed some of Umbrel-la\u0027s warrior specimens up there, and right now Claire is... \"What say if we run across one more locked door, we use up our grenades? I\u0027ve got two of \u0027em,\" John said, looking irritated. They\u0027d just tried the ninth door in the silent hall, and were almost to the north- ernmost curve. For all they knew, they\u0027d already passed Reston, or the passage that would lead them to him. \"Let\u0027s at least see what\u0027s around the corner before we start blowing things up,\" Leon said, though he was also losing patience. It wasn\u0027t that he\u0027d mind damag- ing some Umbrella property, but that just wasn\u0027t the priority - reuniting the team was. They\u0027d already decided that if they didn\u0027t find him soon, they\u0027d go back to the cafeteria and try to get one of the workers to fix the elevator, and to hell with Reston; the mission would be a bust, but at least they\u0027d all be alive to fight another day. Assuming we\u0027re all still alive now... They reached the corner and paused, John raising the M-16 and lowering his voice. \"I\u0027ll cover.\" Leon nodded, moving closer to the inner wall. \"On three. One... two... three...\" He took a running step away from the wall, drop- ping into a crouch and pointing his semi down the west leg of the corridor as John whipped the rifle around the corner. The hall was a lot shorter, no more than sixty feet, dead-ending in an open, doorless room. There was a door on the left...... and somebody moved across the opening at the end of the hall, the darting shape of a man. Reston. Leon saw him, a thin guy, not too tall, wearing jeans and a blue work shirt. Mr. Blue, just like they said... \"Hold it!\" John shouted, and Reston turned, startled and weaponless. He saw the M-16 and jumped away from the double-wide opening, maybe heading for an exit - - and Leon ran, pumping his arms for speed, John quickly passing him in a full-on sprint. They were inside the room in a flash and there was Reston, pushing desperately at a door on the right. He threw a terrified glance over his shoulder as they barreled into the room, his eyes wide with panic. \"It won\u0027t open!\" He screamed, his voice on the edge of hysteria. \"Open the door!\" Who\u0027s he talking to?\"Give it up, Reston,\" John growled - - and behind them, a metal sheet crashed down over the opening, shutting them into the room with a brutal, heavy dang. Leon looked down, saw that the floor was plate steel and felt the first stab of unease. Reston spun around, his hands in the air, his narrow features contorted with fear. \"I\u0027m not him, not Reston,\" he babbled, his pale face slick with sweat - - and behind them, a face appeared at the window in the metal door, distorted by the thick plexiglass but obviously grinning. An older man, dressed in a dark blue suit. Oh, no... The man looked away for a moment, one hand reaching up to touch something Leon couldn\u0027t see and a smooth, cultured voice floated into the roomfrom a speaker in the ceiling. \"Sorry, Henry,\" the man said, his moving face warped by the glass. \"And allow me to introduce myself. I\u0027m Jay Reston. And whoever you are, I\u0027m very glad to meet you. Welcome to the Planet\u0027s test program.\" Leon looked at John, who was still pointing his rifle at the near hysterical Henry. John looked back at him, and Leon could see the awareness dawning in his dark eyes, even as it dawned on him.They were in extremely deep shit. Yes! Reston laughed giddily. The gunmen were trapped, and the three on the surface were probably already being picked up by the teams - he\u0027d handled his situation, and handled it brilliantly. Of course it\u0027s no fun if there\u0027s no one around to appreciate it... but then, I have a captive audience, don\u0027t I?\"We\u0027re not scheduled to go on line for another twenty-three days,\" Reston said, smiling widely, al- ready imagining the look on Sidney\u0027s bloated face. \"At which time, I was going to host the initial run of our carefully designed program for a group of ex-tremely important people. It was going to be speci-men only, we hadn\u0027t planned on putting humans through the phases for a while yet, let alone soldiers. But now, thanks to you, I\u0027ll be able to show my little party actual footage of what our specimens were created for. By now, your friends on the surface will have been taken, sad to say - but the three of you will suffice, I think. Yes, you\u0027ll do quite nicely.\" Reston laughed again, unable to contain it. \"You may want to kill Henry before you start, though, he\u0027ll only drag you down - and he did lure you in, didn\u0027t he?\" \"You bastard!\" Henry Cole pushed away from the wall and flew at the door, pounding on it with his fists. The two-inch metal didn\u0027t even rattle in the frame. Reston shook his head, still grinning. \"I am sorry, Henry; we\u0027ll miss you terribly. You never did finish with the intercom system, did you? Or the audio... at least you hooked up this one, for which I can\u0027t thank you enough. Is it clear enough in there? Getting any static?\" Whatever demon had possessed the electrician fled, the man collapsing against the door, breathing rag- gedly. The bigger of the two armed men, the burly dark-skinned one with the rifle, stepped toward the window with a menacing expression. \"You\u0027re not gonna get us to go through any tests for you,\" he said, his deep voice quivering with rage. \"Go ahead and kill us, \u0027cause we\u0027re not alone - and Um-brella\u0027s going down, whether or not we\u0027re around to see it happen.\" Reston sighed. \"Well, you\u0027re right about not being around. But as to the rest... you\u0027re some of those S.T.A.R.S. people, aren\u0027t you? You and your grass-roots campaign are nothing to us; you\u0027re mosquitoes, an annoyance. And you will participate...\" \"Participate this,\" he spat, grabbing his crotch. Even through the thick plexi, the gesture was unmis- takable. Vulgar. Young people today, no respect for their betters... \"John, why don\u0027t you break out one of those frag grenades?\" The other one said coolly, at which point Reston sighed again. \"The walls are plaster-coated steel, and the door will withstand a lot more than you could possibly have. You\u0027d only succeed in blowing yourselves up. It would be a pity, but if you must, you must.\" They didn\u0027t seem to have a smart reply to that. No one spoke, although Reston could still hear the trou-bled gasps coming from Cole through the intercom. He\u0027d grown tired of goading them anyway; the surface teams would be putting a call in to control soon, and he really should be there. \"If you gentlemen will excuse me,\" he said. \"I have other business to attend to - like releasing our pets into their new homes. Rest assured, though, I\u0027ll be watching your debut; try to make it through at least two of the phases, if you can.\" Reston stepped away from the window to the con- trol panel on the left, and punched in the activation code. One of the men started shouting that they wouldn\u0027t go through with it, that he couldn\u0027t make them...... and then Reston hit the large green button, the one that simultaneously opened the hatch into One and released a spray of tear gas into the small ante- room from vents in the high ceiling. He stepped back to the window, interested to see how effective the process was. Within seconds, a white haze came pouring down from above, obscuring the three men. Reston heard shouts and coughing, and a second later he heard the hatch lock down, which meant they were through. The pressure plates in the floor thus unencumbered, there was a low hiss as the ventilation system kicked on, clearing the room of mist in under a minute. Nice. He\u0027d have to remember to commend which- ever designer had recommended it. \"I\u0027ll make a note,\" Reston said to no one in particular. He smoothed his lapels and turned to walk back to control, excited to see how well the men would fare against the newest additions to the Um- brella family.","sourceLink":"https://allnovel.net/underworld-resident-evil-4/page-11.html","bookId":2459,"book":{"id":2459,"title":"Underworld (Resident Evil #4)","description":"Storyline: As our heroes get closer to the truth behind the conspiracy, they storm a vast underground lab in the desert, hoping to find a way to stop the experiments of the Umbrella Corporation -- and their latest living weapons -- once and for all.","cover":"https://allnovel.net/images/underworld-resident-evil-4.jpg","author":"S.D. Perry","type":"Horror","source":"allnovel","link":"https://allnovel.net/underworld-resident-evil-4.html","creation":"Oct 5, 2019 8:58:44 AM","modification":"Oct 5, 2019 4:31:43 PM"}}
