{"id":111407,"no":13,"title":"Page 13","content":"\\n\\n All that had taken time, and he had returned home to fetch Ryan and get him onboard. It was barely after dark, so Blayde couldn’t figure out where his mate could be.“Ryan?” he called. “Where are you?” No answer. He walked to the bedroom, but found it empty. He was just starting to panic when he heard a noise outside. He practically ran to the door and there he saw Ryan, sitting on the side of the pool, his bare feet dangling in the water.\\n\\n “Hello, baby. Are you okay?” Ryan continued to gaze down at the water, dragging his toes back and forth, making tiny ripples.He hadn’t turned on any lights, so was sitting in the dark.\\n\\n “Ryan? Answer me! What are you doing out here? Why are you acting this way?”\\n\\n Ryan looked up and gave him a furious glance.“What do you care?”\\n\\n “What the hell? Of course I care. Are you angry because I was gone so long? I had a lot to do to get ready for the trip.I came back to get you.”\\n\\n “Why didn’t you tell me, Blayde?How could you do that to me?”\\n\\n Blayde walked toward him, but Ryan held out a hand to stop him.\\n\\n “No, don’t come near me.”\\n\\n Blayde stopped and folded his arms over his chest.“All right, seriously, what the fuck is up with you?”\\n\\n “You know what’s wrong with me, Blayde! That-that bite you gave me last night! You said it had venom in it!You didn’t say it would make me impotent!”\\n\\n “Impotent?” Blayde looked stunned for a moment, and then his eyes narrowed.“Wait a minute. Did you try to watch porn after Kyle put that shit in your head?” As realization hit him, he tried to hold in the laughter, but it came spilling out before he could stop it.\\n\\n “Don’t laugh at me! It’s not funny! Yes, I tried to watch some porn films while you were gone tonight, to see what Kyle was talking about, and nothing happened! Nothing!”\\n\\n “Sweetheart, you’re not impotent. You just can’t get it up for anybody but me. Look…” He pulled off his shirt and stepped out of his trousers.Blayde’s huge dick jutted out in front of him, hard enough to swing on. Ryan’s own cock bounced up enthusiastically at the sight.\\n\\n “But I don’t understand. I watched the porn, and I tried to jack off and nothing worked! Wait a minute,” he said accusingly. “Are you telling me…”\\n\\n “I’m telling you my mate can’t get hard for anyone but me.”\\n\\n Ryan scrambled to his feet and walked over to flop down on a lounge chair by the pool. “Are you seriously telling me I can’t ever…well, this is bullshit!”\\n\\n Blayde shrugged.“Sorry darling. It’s the way it works. I don’t have anything to do with it. And it’s not forever. If, for example, you decided to leave me, and stayed completely away from me for a while, then the effects would gradually fade.”\\n\\n “How gradually?”\\n\\n Blayde shrugged.“A few weeks…”\\n\\n “A few weeks! Are you fucking kidding me?”\\n\\n “Hey, I told you, I have nothing to do with it.It’s just how it is.”\\n\\n “Yeah, but you’re loving every minute, aren’t you?” Ryan stomped over to where he stood and pointed a finger at him accusingly.“You did this on purpose, and I won’t have it! I hate stupid wolves, and I hate this planet, and I hate you!” He stomped his foot again, then doubled over. More stomach cramps, Blayde realized. He picked his angry mate up in his arms and held him close to his body, his hard dick rubbing against Ryan’s.\\n\\n “Oh, baby, don’t be like that.” Bending him back over his arm, Blayde took his mouth in a searing kiss. Ryan opened his mouth in surprise and Blayde swept inside with his mouth. Ryan pulled back his head and stared at him breathlessly.\\n\\n “D-don’t! You’re trying to make me forget why I was mad.”\\n\\n “Is it working yet?”\\n\\n Ryan struggled briefly to get away, but Blayde smiled, lowered his head and murmured to him against his lips. Ryan may not have understood the actual words, but his body responded to it, and he promptly pressed his lips to Blayde’s. Blayde answered by nudgingRyan’s mouth open again with his tongue, sweeping it gently over the inside of his mouth, exploring and tasting him. The larger man kept his hand on the back of Ryan’s head so he couldn’t pull away. As the kiss went on and on, Ryan grew breathless. By the time Ryan pulled away to escape, Blayde was sure a hot red flush stained his cheeks.\\n\\n Blayde, still holding Ryan in his arms, began to walk swiftly back into the house and down the hallway to the bedroom. He put Ryan onto his feet and quickly stripped off his pants. Ryan stood very still, looking dazed and still clung to his shoulders. Blayde straightened back up and smiled a fierce smile.“Still hate me?” He took Ryan in his arms and laid him back on the mattress, pulling his legs up and pushing them back. Grabbing some lube from the table next to the bed he spread a generous amount on his fingers and pushed one gently inside Ryan’s hole. Gently stretching and pushing his finger in and out, he made sure Ryan kept his eyes on him. He took hold of Ryan’s cock in his other hand. “Look at me, sweetheart. Look at me, I said.”\\n\\n Ryan turned to face him.\\n\\n “I love you, sweetheart, and you belong to me.You don’t need to ever get hard for anybody else, because I’ll be fucking this little hole for the rest of your life.I’ll take care of you. Me, baby. Only me.”\\n\\n “All right. Only you…Blayde.”\\n\\n “That’s right, baby,” he said with a smile. He slipped in another finger and Ryan groaned, seeming to love the burn and shivering with pleasure as Blaydestroked Ryan’s prostate with the tip of one broad finger.“Want one more, darling?” He slipped in a third finger and Ryan gasped. Leaning over, Blayde kissed the head of his cock and swept it up and sucked it down in a swirling kiss. Ryan grabbed two handfuls of sheet beneath him and screamed his pleasure. Blayde pulled out his fingers, but replaced them at once with his own rigid cock, nudging his way past the guardian muscle ring and then driving his cock deep inside, so deep that his balls slapped Ryan’s ass.\\n\\n Ryan arched his back in pleasure and pumped his hips up tomeet Blayde’s, but Blayde was concentrating hard on Ryan’s cock. A copious amount of pre-cum was leaking from it, and Ryan squirmed and cried out as Blayde jacked it hard, spreading the pre-cum over his hand. When Blayde’s thumb dipped inside Ryan’s slit, Ryan cried out hoarsely and came with a shudder, bucking his hips and clutching at Blayde’s waist. Blayde followed in two short, hard thrusts and then fell on top of Ryan, both of them trying to catch their breath.\\n\\n After a minute or so, Blayde rolled over onto the bed beside Ryan, and pulled him up closer so he could cuddle with him. Nuzzling his nose in Ryan’s neck, he whispered. “Don’t go to sleep, sweetheart. I have toclean you up and take you to the ship.”\\n\\n Ryan groaned. “I’m too tired. Can’t we wait till tomorrow?”\\n\\n “No, baby. Everyone’s waiting on us now.” He heaved himself up from the bed and went into the bathroom, cleaned himself and emerged a few minutes later with a warm washcloth for Ryan. He tenderly washed him, paying special attention to his backside, until Ryan began to squirm.“Gotta make sure it’s all nice for me, baby.” He patted the cheek of Ryan’s ass. “I told you I take good care of my property.”\\n\\n Ryan smirked and pushed his hands away.“I’m clean enough, thank you. Any more and you’ll have to postpone your takeoff until later.”\\n\\n “Wish we could.” Blayde sat down on the bed beside him.“Lucas is worried we’ve taken too much time as it is. He wants to leaveby nine o’clock.” Blayde pulled Ryan into his arms and dropped a quick kiss on his forehead.“I’m going to miss you tonight,” he grumbled. “How am I supposed to get to sleep without you?”\\n\\n Ryan laughed.“You’ve never had me before last night. Surely you canmanage.”\\n\\n “Maybe, but I don’t like it. I wish there was some other way.” He stood up and sighed.“Get dressed, baby,and let’s get going.”\\n\\n Ryan stood up and pulled on his underwear and pants, then crossed over to his duffle bag and found a shirt. He slipped into his shoes and turned. Blayde stood behind him, holding handcuffs. Ryan blanched at the sight, but stuck out his wrists. Blayde put them on him and stood back to look at him.“I have to say it’s a good look for you, Ryan. I might just keep you in cuffs even after this is over.”\\n\\n “Oh, ha ha, very funny. I hate this.”\\n\\n “Mmm, but I could make you love them. Maybe by the end of this trip, you’ll be begging me to put you back in cuffs.”\\n\\n “Don’t hold your breath.” Blayde gave him a sharp look and he dropped his gaze.“I’m sorry, um, Alpha.”\\n\\n “Pack discipline is hard for you, isn’t it, sweetheart? Don’t worry, it’ll get easier. I hope.” Smiling, Blayde took hold of his arm and led him out of the house, making sure the doors were secured behind him. He picked him up and put him in the front seat of the jeep and went around to the other side.\\n\\n “Damn it,Blayde, I’m a grown man. Stop manhandling me like I’m some kid.”\\n\\n Blayde grinned.“Don’t pretend like you don’t love it.” Blayde leaned over to kiss him and ended the kiss with a little nip on his lower lip. Ryan grabbed it and looked up at Blayde in surprise.\\n\\n “That’s for being a smart ass.”\\n\\n Ryan flushed and turned his head, pouting a little, and Blayde laughed.\\n\\n After getting in and starting the motor, he turned to Ryan and spoke seriously to him. “Honey, when we get on board, I’ll be treating you like any other prisoner, only worse. We have to make this thing believable.Don’t be hurt by anything I say to you, okay?” He patted Ryan’s stomach.“I don’t want you to have a stomachache.”\\n\\n “Okay, I understand.” Ryan’s voice suddenly sounded very small, having lost all the bravado of a few minutes before. “Just…” \\n\\n","sourceLink":"https://allnovel.net/most-wanted-love-slaves-of-the-alphas-1/page-13.html","bookId":1591,"book":{"id":1591,"title":"Most Wanted (Love Slaves of the Alphas #1)","description":"Storyline: Most Wanted (Love Slaves of the Alphas #1) \\n Hot porn star Ryan Henderson is desperate. On the run for a murder he didn’t commit, he tries to hide out by selling himself at an auction for love slaves. When a handsome Lycan wolf-shifter, Blayde Balenescu buys him, Ryan thinks his prayers have been answered—only to find out he’s jumped from the frying pan into the fire! Blayde is an intergalactic bounty hunter who’s only after the money Ryan will bring in. When Ryan gets off the transport bringing him to Blayde, however, he’s startled at Blayde’s violent reaction once he touches him. Dominant Blayde has recognized Ryan as his mate, and now Blayde has to figure out not only how he can possibly convince the young man to stay with him, and allow him to teach him proper behavior, but also how he’ll manage to keep Ryan alive long enough to save him from his powerful enemies.\\n","cover":"https://allnovel.net/images/most-wanted-love-slaves-of-the-alphas-1.jpg","author":"Shannon West","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/most-wanted-love-slaves-of-the-alphas-1.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:22:57 AM"}}
