{"id":111414,"no":21,"title":"Page 21","content":"“Well, the last one wasn’t so bad. I stayed there for several cycles and I still keep in touch with those foster parents. A few before that were pretty bad though. One of them was where I first met Blaine.” “I know. Since the doctor also gave you a clean bill of health, then the problem has to be with that film Partland sent to the court.It has to be a fake.” “Like I tried to tell you, Partland has the money to get almost anything done.” “That’s just what I told Lucas. But even if we can prove the vidis a fake, it won’t solve the real problem. We’d need to get Partland to confess,or he’ll squirm out of it. He’ll say we doctored it ourselves or something. No, I don’t think we’ll ever get any justice with him, baby, but we can try to help our own situation.” “How can we do that?” Ryan asked. “By talking to the Lycan ambassador and having him grant you asylum. We could go to Lycanusitself, but Lucas knows the ambassador on Earth really well, and we’ll have less problems getting him to do it.” “What good will that do?Can’t you just go on with your life and let me be a part of it? I’d like to travel with you, help you with your work.You could show me how to do that.” “I’d love that, baby, but you’d still have this thing hanging over your head. And your handsome face is so recognizable. Even those prisoners knew who you were right away. We can’t go through life hiding out from everyone. It’s not fair to you, sweetheart. No, we’ll move to Lycanus and live there.The Alliance can’t touch us then.” Ryan sighed and sank down on one of the stools at the bar.“All right. What do we need to do?And don’t say let you handle it. We’re in this thing together, so don’t go all macho master/slave on me.” Blayde looked uncomfortable.“I can’t help it. I hate the idea of you exposing yourself to danger.” “Well, the same goes for you.” Blayde stared at him for a long moment before pulling him back in his arms. “I love you, honey. Ican’t get enough of you, and I don’t think I ever will.” “I certainly hope not,” Ryan said, smiling.“Now stand over there so I can think and tell me what we’re going to do.” “The first thing to do, I think, is to figure out just how he faked that film, so we can convince the ambassador.I’ve been thinking about it, and I want you to see it, even though I know it’s hard for you to look at. The first part of the vid is definitely Blaine, and then the next part was you, pulling at Blaine’s shoulder and pushing him down, like you said you did. Even when you climbed on top of him and faced the camera. All you. But then they must have doctored it so someone else came in to slam Blaine’s head on the floor and then back away from the body. After looking back at the vidover and over, there’s no hint of the face in that part. Whoever they got to impersonate you had his hair falling over his face.” “Makes sense,” Ryan agreed. “But how did they make it look like me?” “Do you know of any actors who look a lot like you? At least, the same size and general build? Maybe another blond with long, curly hair?” “Sure, there are a lot of them. You think that’s how they did it?” “Had to be. Put a man your size with your trademark curly blond hair in the same clothes and it would be hard to tell the difference. That and paying off a lot of people to testify against you. The hotel security videos don’t really mean anything. You admit to being there. No, it was the so-called eyewitness testimony that was so damning to you. Some of it from your own friends.We need to find them and see what he offered them to lie for him.” “Or what kinds of threats he used, more likely. He used to threaten Blaine all the time. He even tried to threaten his family, until he found out Blaine didn’t have any. That set him back a little. He even threatened me once, Blainetold me.” “Sweetheart, I h ave to ask you. Were you and Blaineever lovers?” “No.” Ryan shook his head emphatically.“Not really. We messed around a little when we were high sometimes, but that’s all it was. Blaine was more like my best friend. There was never anything romantic between us.” “Well, that’s it then.We’ll get ready to take off for Earth and the Lycan embassy.” “What if he just sends the police to pick me up once we get to Earth? And you too, for aiding and abetting?” “Well he could try, but itwon’t do him any good, because we’ll have diplomatic immunity.” “What?” Blayde smiled.“Yes, sweetheart. We can stay at the Lycan embassy, andthey’ll be glad to have us. We’ll be perfectly safe there. The Alliance wouldn’t want another war to start up over such a trifling matter as one small human like you.” “Thanks a lot.” Blayde wrapped his arms around him and kissed him again.“Not that you’re a trifling matter to me, sweetheart, not at all. Would you like me to show you just how important you are to me?” Laughing, Ryan pushed him away.“Later, Blayde. Definitely later.Right now I’m trying to understand. Tell me why the Lycan embassy would even consider letting us stay there.” Blayde came back for more, pushing Ryan against the counter and grinding his crotch into Ryan’s, ignoring his question. “Are you sure, pet? I could give you something to occupy your sweet mouth.” “I’ll bet you could. For now, though, I think I’ll pass. Tell me, Blayde.” “Okay, we’re the primary suppliers of bauxite, the most valuable mineral in the universe as far as Lycanus is concerned. We use it in the manufacture of our houses, our spaceports, our ships, almost everything. So, yes, the Lycan ambassador would be more than happy to provide the alpha and his family with refuge in their embassy.” “Even humans, like me?” “Especially humans like you, sweetheart, though with you, they can look, but not touch.” Blaydeground his cock into Ryan’s again. “This is all mine.” “Do they have human mates?” “Oh yes, a few. I told you once, Lycans love to have human males for our mates,they’re the best looking by far and the most docile. We also like the Venuvians from Venuvia Minor in the Copernicus star system, but they have a tendency to bite.” At Ryan’s look of outrage, Blayde laughed.“They’re not quite as handsome as the humans anyway. Not my human, at any rate.” “Whatever. Let me go please, so I can have something to eat.” Blayde stepped away, still chuckling.“Sorry, sweetheart.Go ahead and eat.” Ryan turned back to the food processor and took out his plate. Sitting down at the bar, he ate his dinner, but kept his eye on Blayde. Finally, he put his fork down with a sigh.“I’m too damn nervous to eat. I hate the idea of going back to Earth and getting anywhere near that bastard Partland.” “You know I won’t let him hurt you, sweetheart.” “Hurt who?” A voice from the doorway made them both look up to see Nikolai standing in the doorway. “Nikolai, I didn’t hear you there. Come in, we’re just discussing our journey back to Earth. Do you have everything ready?” “Yes, and Kyle’s going too.” Nikolai walked over to where Ryan was sitting at the counter and leaned over to whisper in his ear.“Have you forgiven me, Ryan? I’m sorry for being so hard on you.” Ryan looked up and smiled.“I forgive you. I know you were only trying to protect Blayde.” “Hey!” Blayde called over to them.“Are you flirting with my mate?” “Maybe just a little.” He smiled and walked over to sit by Blayde in the main living area. “We’re ready to head out whenever you are, Blayde. We can leave tonight.” “We can be ready. Ryan, go pack a bag, sweetheart.Although, considering we’re going to be staying at the Lycan embassy, if you really want to fit in, you could just pack a leather thong or two.I think I have a couple of those lying around.” “Yeah, in your dreams. I don’t believe that their mates really wear them like you keep telling me they do anyway. You would hate all those strange Lycans looking at my ass.” “That’s true, I suppose, but on Lycanus, it’s almost a contest to see who has the best looking mate, kind of a status symbol to parade your handsome mate in front of the others to make them envious. I could do that with you, Ryan. Just imagine how jealous I could make all those Lycan ambassadors. Besides, it will be good practice for whenwe’re living there.” “Uh-huh. Just imagine the jealous rages those Lycans would be subjected to when you saw them leering at my naked ass.” Blayde’s eyebrows drew together and he moved restlessly in his chair. Ryan came over to sit beside him on the chair arm.“But I’ll do it for you, Alpha, if youwant me to.” Blayde pulled him down into his lap.“Be careful, Ryan. I could show them how I spank this little ass too.” Nikolai laughed at the exchange.“Ryan, I have to say I never thought anybody could handle my cousin, but I think you’re well on the way to doing it. Blayde, I stilldon’t know how you managed to get Ryan to call you master.” Ryan looked blank.“Huh? What do you mean? I never call him master. Are you kidding me?” Nikolai looked puzzled. “You just did, Ryan. I heard you say Alpha.” “Yeah?” Ryan looked blank. “So? It’s what he told me to call him when I first met him.It’s his rank in the pack, and I’m supposed to.” Nikolai laughed out loud.“Is that what he told you?” Ryan turned in Blayde’s lap and narrowed his eyes at him. “Blayde? What does he mean?” Blayde tried to hide his smile, but the attempt was not successful. “We only call Lucas Alpha. When our mate calls usAlpha, it’s kind of like saying master.”","sourceLink":"https://allnovel.net/most-wanted-love-slaves-of-the-alphas-1/page-21.html","bookId":1591,"book":{"id":1591,"title":"Most Wanted (Love Slaves of the Alphas #1)","description":"Storyline: Most Wanted (Love Slaves of the Alphas #1) Hot porn star Ryan Henderson is desperate. On the run for a murder he didn’t commit, he tries to hide out by selling himself at an auction for love slaves. When a handsome Lycan wolf-shifter, Blayde Balenescu buys him, Ryan thinks his prayers have been answered—only to find out he’s jumped from the frying pan into the fire! Blayde is an intergalactic bounty hunter who’s only after the money Ryan will bring in. When Ryan gets off the transport bringing him to Blayde, however, he’s startled at Blayde’s violent reaction once he touches him. Dominant Blayde has recognized Ryan as his mate, and now Blayde has to figure out not only how he can possibly convince the young man to stay with him, and allow him to teach him proper behavior, but also how he’ll manage to keep Ryan alive long enough to save him from his powerful enemies.","cover":"https://allnovel.net/images/most-wanted-love-slaves-of-the-alphas-1.jpg","author":"Shannon West","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/most-wanted-love-slaves-of-the-alphas-1.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:22:57 AM"}}
