{"id":111400,"no":5,"title":"Page 5","content":"\n “We’re not going to the damn holding cells. I’m not putting him in there with those fucking animals. I’m taking him to my house.I’ll lock him in my bedroom.”\n Kyle widened his eyes and stared.“Are you crazy, Blayde?” He glanced back at the young man and lowered his voice even further as he leaned toward Blayde.“He’s a murderer and a thief. I knowhe’s damn beautiful, but you haven’t thought this thing through.”\n Blayde shook his head impatiently.“Just let me handle it, okay?I’ll talk to you when I get him taken care of.” He glanced at Ryan again and saw him nervously casting his eyes at the back of Blayde’s head, trying to hear what they were saying to each other. Blayde tried hard to calm himself so he could speak to him evenly. He tried a conversational gambit.“We’re taking you somewhere to spend the night.We don’t leave until tomorrow.”\n Ryan nodded, and Blayde saw him looking around himself at the scenery, such as it was. Perhaps he was savoring what he thought were some of his last moments of freedom. The countryside on Lycanus 3 was so flat, you could see for miles around. Andthere wasn’t one damn thing to be seen in that whole desolate landscape but rocks and dirt. A lot of new mates went a little crazy up here after a short time, but Blayde had always thought it was beautiful in its own way. The forests in the nearby hills soothed the Lycans’ need for the greenery of their home planet, and the sunset on the planet was really something to see. The moon, well, the moon was the main attraction for the wolves. It was easily fourtimes the size of Earth’s moon, and twice as big as that of Lycanus, and it exerted a pull on the pack that was primal and strong.\n Within about ten minutes, the houses of the settlement loomed ahead, and they pulled into the narrow little streets of their community. The houses were arranged in a grid, with some stores, a school, a clinic and a kind of recreation hall or saloon in the middle. The mines were some ten miles away because of the blasting.\n Blayde pulled into the driveway of the last house on the left hand side of a horseshoe-shaped cul-de-sac. His brother Lucas lived next door, and Kyle lived in another of the houses on this street. The other alphas all had homes close by. Their branch of the family had always been especially close, in the nature of Lycan shifters. Still, they felt more at ease in their own separate homes, but liked to be close neighbors.\n “Come inside,” he said roughly to Kyle. “We need to get him settled and then we need to talk.”\n Again, Kyle glanced at him with a puzzled, worried look. Ryan managed to jump down from the jeep and stand looking around him, but Blaydecouldn’t read his expression. Part of him wanted to wrap his arms around his sweet mate and reassure him, but he tamped down the impulse and tried to pull himself together. He really had to avoid touching Ryan. Once he started touching him, he wasn’t going to stop, not for a very long time. He pulled Ryan along by his cuffs again, taking him into the house.He was moving a little fast for the short chain on Ryan’s ankles, and Ryan stumbled once, unable to keep up. He would have fallen if Kyle hadn’t caught his arm and held Ryan upright, earning himself a furious glare from Blayde.\n “I said, don’t touch him, damn it!”\n Kyle shot back an angry look at Blayde.“Then slow down and stop pulling him off his feet. Shit, Blayde, what’s got into you?”\n Blayde only snarled and pulled him along to the end of the hall and the spare bedroom. Opening the door, he gestured for Ryan to enter the bedroom, enjoying the view of Ryan’s delectable ass in the tight, wet pants as he passed him to step inside. He turned and held up his hands.\n “Could you get me out of these so I can change clothes, please?”\n Blayde got the key from his pocket and unlocked the cuffs on his wrists and ankles, again being careful not to touch his flesh. Kyle was behind them with Ryan’s bag, and he put it inside the door. Blayde nodded at the bag.“There are your clothes.Use the shower if you want. Don’t even think about trying to get out one of the windows. They all have alarms. Give me any trouble at all, and I won’t hesitate to beat your ass.Got it?”\n Ryan nodded, a red blush staining his cheeks.“Yes, sir!” he said in what Blayde considered to be a smart aleck tone.\n “Call me Alpha.Don’t give me a hard time, human, and watch your mouth, or I might just fill it up for you.” Ryan’s eyebrows raised, his mouth fell open, and he dropped his gaze. Blayde gave him a wicked smile, and softened his tone, because he wanted so badly to kiss him just then.“I wonder if I need to strip search you.”\n He grinned at the panicky expression that flitted across Ryan’s face. “Go ahead with your shower and get some rest. You have a long trip ahead of you.I’ll be in later to bring you something to eat.”\n Ryan nodded, still with his gaze lowered. Unable to stop himself, Blayde stretched out his hand and grazed Ryan’s cheek with his fingertips. His baby needed a shave. Ryan gasped and looked up, but Blayde was already turning toward the door.“Use a razor and shave your face. Oh, and while you’re at it, take off that ridiculous patch of hair beneath your lip.I’ll give you one chance to do it yourself before I do.”\n He glanced back to see Ryan still standing open-mouthed, his hand touching his chin. He got an angry expression on his face.“Why the hell do you care if I shave or not? What is it to you?”\n Blayde took a menacing step back into the room, gratified to see his mate back up quickly. “Don’t question me, Ryan. Do as you’re told, and we won’t have any trouble. Defy me and I’ll make you wish you hadn’t.Got it?” Ryan nodded slowly, and Blayde turned to go to the door and lock it firmly behind him.\n Blayde turned to find Kyle standing beside him with the exact same incredulous gaze as he’d left on Ryan’s face. Blayde sighed heavily.“Come with me. We need to talk.”\n “Yes, I believe we do. Did I hear you tell him to call you Alpha? What the hell has gotten into you? Who is this human?You didn’t say you knew him.”\n “A lot of questions, I’ll try to answer them all, but give me a minute. I didn’t know him before, Kyle. But I do now.Let’s go sit down.”\n Kyle followed Blayde into the living room and Blayde threw himself in a big chair, hooking a leg over the arm of it. Kyle seated himself across from him on the sofa and folded his arms across his chest.“All right, you have some explaining to do. First of all, why the hell did you tell him to call you Alpha? That’s only for mates and concubines, if they’re not in our pack.”\n Blayde nodded slowly.“I know, I know. He’s in our pack from now on. Damn it, Kyle, he is my mate.”\n “He’s your what?” Kyle’s eyebrows shot to his hairline, and he jumped back up to his feet. “You’ve got to be mistaken!”\n “Hell no, don’t you think I know my own mate? My first sight of him almost knocked me down when he got off that transport. It was all I could do not to grab him up and take off with him.”\n Kyle’s face had gone pale.“Oh shit, Blayde! He’s a prisoner. On his way to serve a life sentence!”\n “I realize that!” Blayde rubbed his hands over his face impatiently.“Hell, Idon’t know how I’ll get him out of this.”\n “I’m calling Lucas.He’ll know what to do.” Kyle got out his communicator and punched in a number. “Lucas, get over here to Blayde’s house right away. We have a fucking emergency on our hands!”\n He put his communicator back in his pocket and sat down beside Blayde. The pack had become so connected since they’d come to this planet that when one of them felt pain, it upset the entire group.He could sense the turmoil in Blayde’s mind, and it was making him nervous. “Maybe you could just fuck him a few times and get it out of your system.”\n Blayde pulled his hands down from his face.“It doesn’t work that way and you know it. If, when, I fuck him,he’ll become my mate.I won’t be able to control the feelings I’ll have for him. I’m pretty sure I’ve already imprinted on him. The minute I touched him, damn, I thought the top of my head was coming off! No, this is it for me, Kyle.I don’t want another mate.It’s him for life.”\n “Shit. Does the prison moonallow conjugal visits?”\n “Oh, ha ha, very fucking funny. He’s not going to the prison moonand that’s final. It would drive us both crazy to be separated like that.I mean, he doesn’t know I’m his mate yet, but I plan to let him know very soon.”\n The front door flew open and Lucas rushed in, skidding to a stop, his big body crashing into the coffee table and causing it to collapse under his weight. He looked up from the floor at the two men staring down at him in surprise.“Might have overshot that a bit,” he said with a grin.\n Kyle reached over to help him up.“Lucas, I didn’t say the place was on fire!”\n “Yes, but from the tone in your voice I thought there must have been a prisoner break at the very least.” He took Kyle’s hand and got to his feet, gesturing down at the table. “Sorry, Blayde. I’ll buy you a new one.”\n “Aw, don’t worry about it.That’s the least of my worries.”\n Lucas looked back and forth between them.“Okay, what the hell’s going on? It’s my weekend off, and I don’t need any problems. Blayde, talk to me. You look as thoughyou’ve lost your best friend.”\n “Worse. He’s found his mate,” Kyle spoke up.\n “Really?Well, that’s normally considered to be a good thing, Blayde.” Lucas smiled down at him.“I know you don’t like the idea of being tied down, but maybehe’ll understand your job will take you away a lot. He can even go with youas long as it’s not a dangerous transport.”\n “It’s not about being tied down,” Kyle explained.“That isn’t the problem.”\n “No? Well, then, what?What are you not telling me?”\n Blayde looked up at his brother, misery written in every line of his face. “He’s my prisoner, Lucas.I have to take him to Omega 9 to serve a life sentence.” \n","sourceLink":"https://allnovel.net/most-wanted-love-slaves-of-the-alphas-1/page-5.html","bookId":1591,"book":{"id":1591,"title":"Most Wanted (Love Slaves of the Alphas #1)","description":"Storyline: \n Most Wanted (Love Slaves of the Alphas #1) \n Hot porn star Ryan Henderson is desperate. On the run for a murder he didn’t commit, he tries to hide out by selling himself at an auction for love slaves. When a handsome Lycan wolf-shifter, Blayde Balenescu buys him, Ryan thinks his prayers have been answered—only to find out he’s jumped from the frying pan into the fire! Blayde is an intergalactic bounty hunter who’s only after the money Ryan will bring in. When Ryan gets off the transport bringing him to Blayde, however, he’s startled at Blayde’s violent reaction once he touches him. Dominant Blayde has recognized Ryan as his mate, and now Blayde has to figure out not only how he can possibly convince the young man to stay with him, and allow him to teach him proper behavior, but also how he’ll manage to keep Ryan alive long enough to save him from his powerful enemies.\n \n","cover":"https://allnovel.net/images/most-wanted-love-slaves-of-the-alphas-1.jpg","author":"Shannon West","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/most-wanted-love-slaves-of-the-alphas-1.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:22:57 AM"}}
