{"id":64069,"no":21,"title":"Page 21","content":"\"She said he was a real nice guy, fun to be with. Kind of kinky.\" \"I thought call girls never talked about their famous clients.\" \"That\u0027s right, darling. And if you put your tooth under your pillow, the Tooth Fairy will come and leave you a quarter.\" \"I think I\u0027d rather keep the tooth.\" \"Well, you\u0027re just an old bear,\" she said. \"Anyway, he liked leather, and he liked to be tied up.\" \"We tried that.\" \"And you fell asleep.\" \"Because I felt safe in your presence. Look, I\u0027m sure it\u0027s interesting that Ray Gruliow\u0027s a bondage queen, but-\" \"Not to mention golden showers.\" \"Golden showers?\" \"I told you not to mention them. I bet he\u0027d take a girl to Marilyn\u0027s Chamber.\" \"Huh?\" \"Formerly the Hell-Fire Club,\" she said. \"We were talking about it the other day, remember? That\u0027s its new name, Marilyn\u0027s Chamber. As in torture chamber, I guess, and as in the former porn star. See Mick tomorrow night and you can take me there on Saturday.\" \"You really want to go?\" \"Sure, why not? I checked, and it\u0027s fifty dollars a couple and there\u0027s no pressure to do anything. And the price includes soft drinks, and that\u0027s all they serve, so you won\u0027t have to be around booze.\" \"Just whips and chains.\" \"There\u0027s a body-piercing exhibition scheduled for Saturday. You\u0027re fifty-five years old. Don\u0027t you think it\u0027s about time you witnessed a body-piercing exhibition?\" \"I don\u0027t know how I lasted this long without it.\" \"I tried on the leather outfit and I think it looks hot.\" \"I wouldn\u0027t be surprised.\" \"But it\u0027s the least bit tight. I found out it looks better if I don\u0027t wear anything under it.\" \"Be awfully warm,\" I said. \"In this weather.\" \"Well, the club\u0027s probably air-conditioned, don\u0027t you think?\" \"In a basement on Washington Street? I wouldn\u0027t count on it.\" \"So? If I sweat, I sweat.\" She moistened her lips with the tip of her tongue. \"You don\u0027t mind a little sweat, do you?\" \"No.\" \"I think I\u0027ll try that outfit on again,\" she said, \"and you can tell me what you think.\" She took my hand, drew me willingly to my feet. At the bedroom door she said, \"You had a couple of messages. TJ wants you to beep him when you have a chance. But he didn\u0027t say it was urgent, so I suppose it can wait until morning, don\u0027t you think?\" \"It\u0027ll have to,\" I said. 14 In the morning I beeped TJ and met him for breakfast across the street at the Morning Star. He was wearing the same shorts and cap, but in place of the vest he wore a denim shirt with the sleeves and collar removed and the three top buttons unbuttoned. I had already ordered and been served when he got there. He dropped into the seat opposite me and told the waiter he wanted a pair of cheeseburgers and a large order of well-done hash browns. I said, \"No french fries?\" \"For breakfast?\" \"Forgive me,\" I said. \"I lost my head.\" \"Yeah, well, you lost it earlier, sendin\u0027 me up to the Bronx chasin\u0027 down shit happened three years ago. Neighborhoods I had to go, how you gonna find anybody remembers anything? Be like tryin\u0027 to find a needle in a crack house. An\u0027 if you did, why\u0027d they want to talk about it?\" \"Well, it was a long shot,\" I said, \"but I thought it might be worth a try. I gather it was a waste of time.\" \"Who said, Fred? All I\u0027s sayin\u0027 is it be impossible. That don\u0027t mean I ain\u0027t done it.\" \"Oh?\" \"Went all over the Bronx. Went places the trains don\u0027t go. You get off the train, then you has to take a bus.\" He shook his head at the wonder of it all. \"Took a while, but I found folks used to know this Eldoniah. Thing is, that weren\u0027t the name they called him by.\" \"What did they call him?\" \"Shy.\" \"Shy? He sounded about as retiring as a cobra.\" \"Well, he retirin\u0027 now, where he\u0027s at upstate. The way he be shy, see, the gang he run with, dudes\u0027ll look you right in the eye an\u0027 pull the trigger, shoot you while they smilin\u0027 at you.\" \"That\u0027s what I heard about Eldoniah.\" \"No, see, \u0027cause he too shy for that. That\u0027s why he\u0027s so happy the day he discovered cabdrivers. No need to be lookin\u0027 \u0027em in the eye, \u0027cause all you got to do is shoot \u0027em in the back of the head.\" \"And that\u0027s why they call him Shy.\" \"Din I just say that?\" \"So as far as the street\u0027s concerned, he did those cabdrivers.\" He nodded. \"The bust was righteous. But the white dude in the Yellow wasn\u0027t one of his.\" \"They told you that?\" \"Didn\u0027t have to. The MO was all wrong.\" He grinned at my expression. \"Well, don\u0027t that be how you\u0027d say it? I gone be a detective, I might as well get down with the language. What Shy would do, he\u0027d always call a cab from one of them livery services. An\u0027 he wouldn\u0027t drop it on Audubon Avenue where they found Cloonan, \u0027cause that be a Spanish neighborhood an\u0027 he likely to attract attention there. But just to make sure, I axed people who knew him.\" \"And they talked to you?\" \"Story I told, I had the word from my mama that Eldoniah Mims was most likely my daddy. She just tol\u0027 me this right before she died, Clyde, so I was makin\u0027 it my business to see what I could find out about him.\" \"How old is Mims? I didn\u0027t think he was old enough to have been your father.\" \"He ain\u0027t, but none of the fools I talked to bothered to run the \u0027rithmetic. An\u0027 I guess Shy wasn\u0027t too shy, \u0027cause this one friend of his took me \u0027round an\u0027 introduced me to this kid and said we\u0027s evidently brothers. Kid was twelve years old an\u0027 meaner\u0027n cat shit. I don\u0027t \u0027spect he\u0027ll live to be voting age, \u0027less they save his damn life by lockin\u0027 him up for the next six years.\" He grinned. \"He glad to see me, though. Likes the idea that he\u0027s got an older brother. Someone to pull his coat, teach him the ways of the world.\" \"You\u0027ll be a good influence on him.\" He rolled his eyes. \"Only way you gone influence him is how Shy influenced those drivers. Shoot him in the back of the head. Anyway, all he told me is what I already figured out. Shy didn\u0027t do the dude in the Yellow. But you knew that, too, didn\u0027t you?\" \"It certainly looked that way.\" He washed down the last bite of cheeseburger with the last swallow of milk, pulled a napkin from the dispenser, and wiped his mouth. \"Somethin\u0027 you don\u0027t know, though.\" \"There\u0027s a great deal I don\u0027t know.\" \"Killer was white.\" \"How do you know that?\" \"Girl told me.\" \"That\u0027s damned interesting,\" I said. \"I wonder how a rumor like that got all the way to the Bronx.\" \"Who said anything about the Bronx? We talkin\u0027 Audubon Avenue in Washington Heights where the guy in the Yellow got shot.\" \"What were you doing there?\" \"Same thing I doin\u0027 everywhere, mindin\u0027 other folks\u0027s business. Did I say it a Spanish neighborhood? I didn\u0027t blend in too good.\" \"I guess your Spanish is rusty.\" \"I best get some of those tapes, learn it in my sleep. But what good\u0027s bein\u0027 able to talk Spanish in your sleep?\" He shrugged. \"Don\u0027t make no sense. What I done, I was this assistant to Melissa Mikawa, does them features on New York One?\" \"I know who you mean. You told them you were her assistant?\" \"Why not? I wasn\u0027t wearin\u0027 these clothes, Rose. Got me some long pants, neat little polo shirt, pair of penny loafers. Put on a Brooks Brothers accent to match the clothes. You think I didn\u0027t look like some kind of assistant to a TV reporter?\" \"What about the hair?\" He whipped off his cap. His hair was a tight cap of curls that rose a scant half-inch from his scalp. \"Got it cut,\" he said. \"What you think?\" \"It looks good.\" \"Looks better with the cap on,\" he said. \"Least when I\u0027m on the Deuce it does.\" From the red Kangaroo circling his waist he produced a pair of horn-rimmed glasses, put them on. \"I was wearin\u0027 these,\" he said. \"An\u0027 I was carryin\u0027 a clipboard. That\u0027s even better than the glasses. Man with a clipboard, you know he\u0027s there on legitimate business, an\u0027 everybody can\u0027t hardly wait to tell him the combination to the safe. You know who told me that?\" \"Some legendary con artist, I\u0027m sure.\" \"Yeah, well, he ain\u0027t that slick, \u0027cause he be payin\u0027 for my breakfast this morning.\" \"I told you about the clipboard?\" \" \u0027Bout a year ago. We havin\u0027 coffee, you reminiscin\u0027, tellin\u0027 me stuff. You don\u0027t recall? Well, see, I pay attention when Matthew Scudder be talkin\u0027. Even if you don\u0027t.\" \"What did you tell them on Audubon Avenue? Melissa Mikawa\u0027s planning a segment on murdered cabdrivers?\" He nodded. \"I said she doin\u0027 a story on that particular case, an\u0027 how it was never solved, \u0027cause what do they know on Audubon Avenue about Shy Mims an\u0027 his upstate huntin\u0027 lodge? I said how anybody who was aroun\u0027 when it went down, anybody who heard or saw anything, might get to be on television. An\u0027 they be gettin\u0027 to meet Melissa Mikawa. Man, they loves that bitch up in Washington Heights! She Japanese, right?\" \"If she isn\u0027t,\" I said, \"it\u0027s a hell of an act she puts on.\" \"Well, they actin\u0027 like they think she\u0027s Rican. Axin\u0027 me all this shit, what\u0027s she like, has she got a boyfriend. Time I got done makin\u0027 up stories about her, I was starting to believe \u0027em myself. Anyway, I found this one girl, she was right there when Cloonan got killed.\" \"What did she see?\" \"Saw the Yellow pull up an\u0027 park in the bus stop on the corner. Then a little while later she saw this dude get out an\u0027 close the door an\u0027 walk away.\" \" \u0027A little while later.\u0027 Five minutes? Ten minutes?\" \"Man, this was four years ago. An\u0027 she still in high school, so how old was she when it went down? An\u0027 who remembers how long a cab stands around \u0027fore some fool gets out of it? She wouldna thought anything of it at all, except later on the police came and drugged a body out of the Yellow.\" \"She didn\u0027t hear a shot.\" \"Says she didn\u0027t.\" \"He must have used a suppressor. You say she got a look at him?\" \"She got a look. Don\u0027t know how good a look it was.\" \"And she said he was white? Could he have been a white Hispanic?\" \"I said was he Spanish, and she said he was white.\" \"Like, no, he wasn\u0027t Spanish, he was white?\" \"Like that, yeah.\" \"And he got out of the cab, and-\" \"Leaned in, like he was sayin\u0027 something to the driver. Like, wait for me. That\u0027s why nobody thought nothin\u0027 when the Yellow stayed right where it was.\" \"Was the meter on?\" \"Wasn\u0027t on in the first place.\" \"He threw the flag before he pulled up to park? They do that sometimes but-\" \"What she said,\" TJ said, \"and you got to keep in mind this was four years ago-\" \"And she was just a kid, I understand that part. What did she say?\" \"Dude wasn\u0027t a fare.\" \"The passenger? The man she saw?\"","sourceLink":"https://allnovel.net/a-long-line-of-dead-men-matthew-scudder-12/page-21.html","bookId":2330,"book":{"id":2330,"title":"A Long Line of Dead Men (Matthew Scudder #12)","description":"Storyline: A Long Line of Dead Men (Matthew Scudder #12) In Manhattan, thirty men have been meeting once a year for years; they form a tontine, a secret, private club, the only purpose of which is to record the passage of time and to give a toast to the joys of life. But when these men start to die at alarming rates, murder rears its ugly head. It\u0027s clear someone is determined to kill them all. Hired by one of the members, Matt Scudder, ex-cop and recovering alcoholic, enters the world of privilege, which may as well be on another planet from the world of street hustlers and career criminals he\u0027s so familiar with. As the case draws Matt deeper and deeper, he\u0027s forced to look at his own life--his work, his loves, his friendships and his destiny.","cover":"https://allnovel.net/images/a-long-line-of-dead-men-matthew-scudder-12.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-long-line-of-dead-men-matthew-scudder-12.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:52:50 AM"}}
