{"id":64090,"no":42,"title":"Page 42","content":"\"You know I\u0027m right,\" he said. \"I know you\u0027ve always opposed capital punishment.\" \"Absolutely,\" he said. \"Unequivocally.\" \"That\u0027s not how you sound this morning.\" \"I think it\u0027s regrettable that a man like Severance could ever be released from prison. That doesn\u0027t mean I think the state should go into the business of official murder.\" \"I didn\u0027t think we were talking about the state.\" \"Oh?\" \"You want to apprehend him without involving the media or the police. I get the feeling you\u0027d like to see sentence passed and carried out in much the same manner.\" \"In other words?\" \"You want me to find him and kill him for you,\" I said. \"I won\u0027t do it.\" \"I wouldn\u0027t ask you to.\" \"I don\u0027t want to find him so you can kill him yourself, either. How would you do it? Draw straws to see who pulls the duty? Or string him up and have everybody pull on the rope?\" \"What would you do?\" \"Me?\" \"In our position.\" \"I was in your position once,\" I said. \"There was a man named… well, never mind what his name was. The point is that he had sworn to kill me. He\u0027d already killed a lot of other people. I don\u0027t know if I could have got him sent to prison, but I know they wouldn\u0027t have kept him there forever. Sooner or later they\u0027d have had to let him out.\" \"What did you do?\" \"I did what I had to do.\" \"You killed him?\" \"I did what I had to do.\" \"Do you regret it?\" \"No.\" \"Do you feel guilty?\" \"No.\" \"Would you do it again?\" \"I suppose I would,\" I said. \"If I had to.\" \"So would I,\" he said, \"if I had to. But that\u0027s not what I have in mind. I don\u0027t really believe in capital punishment whether it\u0027s the state or an individual who imposes the sentence.\" \"I\u0027m lost,\" I said. \"You\u0027ll have to explain.\" \"I intend to.\" He drank some coffee. \"I\u0027ve given this some thought,\" he said, \"and I\u0027ve talked to several of the others. How does this sound to you?\" I heard him out. I had a lot of questions and raised a lot of objections, but he had prepared well. I had no choice but to give him the verdict he wanted. \"It sounds crazy,\" I said at length, \"and the cost-\" \"That\u0027s not a problem.\" \"Well, I don\u0027t have any moral objection to it,\" I said. \"And it might work.\" 30 The first week in August I got a call around one in the afternoon. Joe Durkin said, \"Matt, I\u0027d like to talk to you. Why don\u0027t you come around the station house?\" \"I\u0027d be happy to,\" I said. \"What would be a good time?\" \"Now would be a good time,\" he said. I went straight over there, stopping en route for a couple of containers of coffee. I gave one to Joe and he lifted the lid and sniffed the steam. \"This\u0027ll spoil me,\" he said. \"I\u0027ve been getting used to squadroom coffee. What\u0027s this, French roast?\" \"I don\u0027t know.\" \"It smells great, whatever it is.\" He set it down, opened a drawer, took out one of the palm cards that had been circulating around town for a couple of weeks. It was on postcard stock and about the size of a standard postcard. One side was blank. The other showed James Severance as sketched by Ray Galindez. Beneath the sketch was a seven-digit telephone number. \"What\u0027s this?\" he said, and flipped it across the desk to me. \"Looks like a postcard,\" I said. I turned it over. \"Blank on the back. I guess you would write your message here and put the address over here on the right. The stamp would go in the corner.\" \"That\u0027s your phone number under the picture.\" \"So it is,\" I said. \"But if the picture\u0027s supposed to be me, I\u0027d have to say it\u0027s a lousy likeness.\" He reached to take the card from me, looked at me, looked at it, looked at me again. \"Somehow,\" he said, \"I don\u0027t think it\u0027s you.\" \"Neither do I.\" \"Whoever it is,\" he said, \"I got a snitch tells me the guy\u0027s picture\u0027s all over the street. Nobody knows who he is or why somebody\u0027s looking for him. So I figured I\u0027d call the number and ask.\" \"And?\" \"And I\u0027m asking.\" \"Well,\" I said, \"it\u0027s in connection with a case I\u0027m working on.\" \"No kidding.\" \"And the subject of the sketch might be an important witness.\" \"Witness to what?\" \"I can\u0027t say.\" \"What did you do, take holy orders? You\u0027re bound by the seal of the confessional?\" \"I was hired by an attorney,\" I said, \"and what was told to me comes under the umbrella of attorney-client privilege.\" \"Who hired you?\" \"Raymond Gruliow.\" \"Raymond Gruliow.\" \"That\u0027s right.\" \"Hard-Way Ray.\" \"I\u0027ve heard him called that, come to think of it.\" He took another look at the sketch. \"Guy looks familiar,\" he said. \"That\u0027s what everybody says.\" \"What\u0027s his name? That can\u0027t be confidential.\" \"If we knew his name,\" I said, \"he\u0027d be a lot easier to find.\" \"A witness saw him and sat down with an artist, and that\u0027s where the sketch came from.\" \"Something like that.\" \"I understand there\u0027s a reward.\" I looked at the palm card. \"Funny,\" I said. \"It doesn\u0027t say anything here about a reward.\" \"I heard ten grand.\" \"That\u0027s a lot of money.\" \"It seems like a lot to me,\" he said, \"when I think of what I\u0027ve done for the price of a hat. What\u0027s funny is you never brought the sketch around here.\" \"I didn\u0027t think you\u0027d recognize him. You don\u0027t, do you?\" \"No.\" \"So there wouldn\u0027t have been much point in showing you the sketch.\" He gave me a long look. He said, \"When there\u0027s that much of a reward for somebody, it\u0027s generally somebody who doesn\u0027t want to be found.\" \"Oh, I don\u0027t know,\" I said. \"What about that little boy who disappeared in SoHo? There were reward posters all over the place.\" \"That\u0027s a point. There aren\u0027t any posters with this fellow, are there?\" \"I haven\u0027t seen any.\" \"Just cards you can tuck away out of sight. Nothing on the lampposts or mailboxes, nothing tacked up on bulletin boards. Just a lot of cards circulating quietly around the neighborhoods.\" \"It\u0027s a low-budget operation, Joe.\" \"With a five-figure reward.\" \"If you say so,\" I said, \"but I still don\u0027t see anything here about a reward.\" \"No, neither do I. This is good coffee.\" \"I\u0027m glad you like it.\" \"Last time we talked,\" he said, \"you were looking into all these old cases. That painter and his wife, that gay guy who got more than he bargained for, that cabbie who picked up the wrong fare. Remember?\" \"As if it were yesterday.\" \"I\u0027ll bet. This guy here tied in with them?\" \"How could he be?\" \"Why do you always answer a question with a question?\" \"Do I have to have a reason?\" \"Fucking smartass. What\u0027s the status of those old cases, anyway?\" \"As far as I can tell,\" I said, \"they\u0027re all still dead.\" The waiting was hard to take. We got the word out on the street a good ten days before I heard from Joe Durkin. I started with a few people like Danny Boy Bell who are professionally adept at spreading and gathering information, and I gave each of them a sheaf of palm cards bearing Severance\u0027s likeness and my phone number. TJ went to work on Forty-second Street, spreading the word among the people he knew on and around the Deuce and working the cheap hotels and SRO rooming houses in the neighborhood. Gruliow made a few phone calls and sent me off to see various criminals and political outcasts he\u0027d defended over the years. Of one he said, \"This one hugged me after the trial and said to call him if I ever wanted somebody killed. I\u0027ve been tempted a few times, believe me. It\u0027s a good thing I don\u0027t believe in capital punishment, not even for ex-wives.\" I was pretty sure he\u0027d go to ground in Manhattan. If he\u0027d ever lived outside the borough, I didn\u0027t know about it. In all the months he\u0027d stalked Alan Watson, patrolling his streets in a Queensboro-Corona uniform, even (if he was telling the truth) having an affair with Watson\u0027s wife, he\u0027d chosen to live in Manhattan. He could have found a cheaper and more comfortable room a few blocks from the Q-C offices, or within easy walking distance of Watson\u0027s Forest Hills home. But he\u0027d moved instead to East Ninety-fourth Street. He\u0027d have had to take two trains to get to work, and two more to get home. So I centered the manhunt in Manhattan, and I put the most energy into those parts of town where someone like Severance wouldn\u0027t stick out like a white thumb. I hit the places that called themselves hotels or rooming houses, and I went to lunch counters and drugstores and asked if they knew where I could find a room for rent, because every neighborhood has some SRO hotels that don\u0027t hang out a sign. And we left palm cards in delis and bodegas, too, and in shoeshine parlors and ginmills and numbers drops. And then it was time to sit back and wait, time to be home in case the phone rang, and that\u0027s when it got difficult. Because it\u0027s easier when you\u0027re doing something. Sitting in my room at the Northwestern, watching a ball game or a newscast, reading a book or a newspaper, staring out the window, I couldn\u0027t avoid the thought that it was all misplaced effort, all a waste of time. He didn\u0027t have to be in Manhattan. He could be lying on a beach in California, biding his time, waiting for the New York heat to die down. He could be in Jersey or Connecticut, stalking one of the club\u0027s suburban members. While I sat here, waiting for the phone to ring, he\u0027d be sighting his target and making his kill. The day after I spoke to Durkin, I picked up the phone and called Lisa Holtzmann. I didn\u0027t even think about it. I had the phone in my hand and was dialing her number without having made any conscious decision. The phone rang four times and her machine picked up. I rang off without leaving a message. The following afternoon I called her. \"I was thinking of you,\" I told her, but I don\u0027t even know if that was true. She told me to come over, and I went. Two days later I went to the 8:30 meeting at St. Paul\u0027s. I left on the break and called her from a pay phone on the corner. No, she said, she wasn\u0027t busy. Yes, she felt like company. In her bed that night, she lay beside me and told me that she was still seeing the art director for the airline magazine. \"I\u0027ve been to bed with him,\" she said. \"He\u0027s a lucky man.\" \"I don\u0027t know why I bother planning conversations in my head. You never say what I expect you to say. Do you really think he\u0027s a lucky man? Because I don\u0027t.\" \"Why not?\" \"Because I\u0027m such a whore. I saw him the night before last. You came over during the afternoon, and then I went out to dinner with him that night. And brought him home and fucked him. I was still sore from the afternoon but I went ahead and fucked him anyway.\"","sourceLink":"https://allnovel.net/a-long-line-of-dead-men-matthew-scudder-12/page-42.html","bookId":2330,"book":{"id":2330,"title":"A Long Line of Dead Men (Matthew Scudder #12)","description":"Storyline: A Long Line of Dead Men (Matthew Scudder #12) In Manhattan, thirty men have been meeting once a year for years; they form a tontine, a secret, private club, the only purpose of which is to record the passage of time and to give a toast to the joys of life. But when these men start to die at alarming rates, murder rears its ugly head. It\u0027s clear someone is determined to kill them all. Hired by one of the members, Matt Scudder, ex-cop and recovering alcoholic, enters the world of privilege, which may as well be on another planet from the world of street hustlers and career criminals he\u0027s so familiar with. As the case draws Matt deeper and deeper, he\u0027s forced to look at his own life--his work, his loves, his friendships and his destiny.","cover":"https://allnovel.net/images/a-long-line-of-dead-men-matthew-scudder-12.jpg","author":"Lawrence Block","type":"Mystery","source":"allnovel","link":"https://allnovel.net/a-long-line-of-dead-men-matthew-scudder-12.html","creation":"Oct 5, 2019 8:58:36 AM","modification":"Oct 5, 2019 9:52:50 AM"}}
