{"id":23215,"no":6,"title":"The Piskeys’ Revenge","content":"Once upon a time, so the old story begins, there were an old man and his wife called Granfer and Grannie Nankivell, who lived on a moor, and a small grand-daughter who lived with them. \\n\\n \\n\\n Genefer was the name of this little girl. She was a small brown child. Brown as a Piskey, her grandfather said; but, brown as she was, she was exceedingly pretty. Her lips were as red as the reddest of berries, and the glow on her cheeks matched her lips. \\n\\n \\n\\n Her grandfather was a turf-cutter, and most of his days had been spent cutting turf on the Cornish moors. \\n\\n \\n\\n When this old man was between sixty and seventy he cleared out a whole bog, which happened to be a Piskey-bed. \\n\\n \\n\\n The Piskeys never like their sleeping-places to be disturbed, and when they found out Granfer Nankivell had done it, they were very angry, and set up Piskey-lights to lead him astray when he came home. But they did it in vain as far as he was concerned. The old turf-cutter was very learned in Piskeys’ wiles, and never ventured across the moors [116]without wearing one of his garments inside out, and this made him Piskey-proof, which means that the Piskeys had no power to harm him or to lead him out of his way. \\n\\n \\n\\n But the sly Little People knew a thing or two as well as Granfer Nankivell, and when they found out that their Piskey-lights failed, they set their sharp little wits to work to do him harm in some other way. \\n\\n \\n\\n After much watching they discovered that the old turf-cutter had a weakness for sweet things, and that the greatest treat his wife could give him was sugar biscuits of her own making and a big plate of junket. They also found out that Grannie Nankivell, whenever she made these delicacies, put them overnight into her spence1 for safety. \\n\\n \\n\\n They made up their minds that they would punish the old turf-cutter for taking away their nice soft green Piskey-bed by doing him out of his junket and biscuits, and they told some distant relations of theirs, the Fairy Moormen, to keep an eye upon the spence-window, and whenever they saw Grannie Nankivell bring a bowl of junket and a dish of biscuits into her spence, they must come with all speed and tell them. \\n\\n \\n\\n ‘We’ll watch too,’ they said; ‘but in case we are away dancing or setting up Piskey-lights, you must watch for us,’ which the Tiny Moormen were quite pleased to do. [117] \\n\\n \\n\\n But the moor fairies watched in vain for many a week, and just as they were beginning to fear that Grannie Nankivell was never going to make any more biscuits and junket for her husband, she set to and made some, and when they were made she took them into the spence, as she always did. \\n\\n \\n\\n The spence opened out from the kitchen, and was quite a little room in itself, with a tiny window facing the moors. In front of the window was a stone bench, and near it a square oak table. \\n\\n \\n\\n The Tiny Moormen were peeping in at the window when the old woman put the bowl of junket on the table and the dish of sugar biscuits on the bench, and the moment her back was turned they tore off to the Piskeys with the news. \\n\\n \\n\\n ‘A big round basin full of lovely cool junket,’ they cried, ‘and a dish heaping full of round biscuits, yellow and white with eggs and sugar, with which they are made. I heard the old woman say that she had never made better, and all for Granfer Nankivell, ‘cause ’tis his birthday to-morrow.’ \\n\\n \\n\\n ‘Birthday or no birthday, Granfer Nankivell shan’t taste one,’ cried the little Piskeys. ‘No fy, he shan’t! He turned us out of our beds, and we’ll do him out of his biscuits and junket, see if we won’t!’ \\n\\n \\n\\n ‘That’s right!’ said the Fairy Moormen, who were hand and glove with the Piskeys, ‘only please save some for us.’ \\n\\n \\n\\n They and the Piskeys hastened away to the turf-cutter’s cottage, and when the turf-cutter and his [118]wife had gone to bed, the Piskeys got into the spence and ate up the big bowl of junket, and passed out the biscuits to the Tiny Moormen. \\n\\n The Piskeys got in and ate up the bowl of junket, and passed out the biscuits. \\n\\n \\n\\n The Piskeys got in and ate up the bowl of junket, and passed out the biscuits. \\n\\n \\n\\n [119] \\n\\n \\n\\n When Grannie Nankivell went to her spence the next day she found the junket-bowl empty and every biscuit gone. \\n\\n \\n\\n She said she could not imagine who had taken the things, but looked suspiciously at her little granddaughter Genefer. \\n\\n \\n\\n ‘The cat must have got into the spence and done me out of my birthday treat,’ said the old turf-cutter. ‘You must shut the spence-window the next time you put a junket in there.’ \\n\\n \\n\\n ‘But the biscuits have gone as well as the junket,’ said the old woman, still looking at little Genefer. ‘Cats have no liking for sugar biscuits, that ever I heard tell of.’ \\n\\n \\n\\n The next time Grannie Nankivell took biscuits and a junket into her spence she shut the window and also the door; but when she got up the following morning and went to see if they were safe, lo and behold! the junket-bowl was again empty and the biscuits were gone. \\n\\n \\n\\n ‘’Tis a two-legged cat who has eaten up my beautiful biscuits and junket,’ she said to her husband; and she turned and looked at little Genefer. \\n\\n \\n\\n ‘I am not the two-legged cat who ate up all the nice things you made for Granfer,’ cried the child, meeting the old woman’s glance with her honest brown eyes. \\n\\n \\n\\n ‘I never said you did,’ said Grannie Nankivell; ‘but ’tis queer the junket-bowl is empty and every biscuit gone from the dish.’ [120] \\n\\n \\n\\n ‘I expect it was a dog which got into the spence and licked up the junket and ate the biscuits,’ put in the old turf-cutter. ‘I would lock and bar the spence-door, if I were you, the next time I put such nice things in there.’ \\n\\n \\n\\n ‘I will,’ she said. \\n\\n \\n\\n The next time Grannie Nankivell made biscuits and a junket she barred the window of the spence and locked the door, and the next morning, before Genefer dressed, she went to see if her junket and biscuits were all right; but the little round biscuits, which she had so carefully made and sugared, were every one gone, and the junket-bowl was quite empty, and as dry as a bone. \\n\\n \\n\\n ‘’Tis our little grandcheeld who has eaten it all!’ cried Grannie Nankivell in great anger to the old turf-cutter. ‘No cat or dog could get into a spence with door locked and window barred.’ \\n\\n \\n\\n ‘I don’t believe it was Genefer,’ said the old man stoutly. \\n\\n \\n\\n ‘If it was not Genefer, who was it, pray? Biscuits and junkets don’t eat up themselves, any more than dogs and cats can get through keyholes and barred windows.’ \\n\\n \\n\\n ‘That’s true,’ said Granfer Nankivell; ‘all the same, I am certain sure that our dear little grandcheeld would not go and eat up the things.’ \\n\\n \\n\\n ‘Then who did?’ asked the old woman with a snap. \\n\\n \\n\\n ‘The little Piskeys, I shouldn’t wonder,’ he [121]answered. ‘My great-grannie told me they were little greedy-guts, and in her days they used to skim the cream off the milk, and eat all the cheese-cakes she used to make, unless she put some for them outside on the doorstep. Regular little thieves the Piskeys were in her days. P’raps they haven’t learnt to be honest yet. There are plenty about now, and Little Moormen too, by the teheeing and tehoing I have heard lately, waiting, I dare say, to play some of their pranks on me.’ \\n\\n \\n\\n But Grannie Nankivell was still unconvinced, and still believed it was Genefer, and not the Piskeys, who ate her biscuits and junket. \\n\\n \\n\\n One evening the old woman put another bowl of junket and a dish of biscuits in the spence, and was as careful as before to bar the window and lock the door; and in the middle of the night, when her husband was fast asleep and snoring, she got up and came downstairs to see if she could find out for certain who it was that ate up her good things. When she came down, whom should she see but her little grand-daughter Genefer standing by the spence-door in her little bedgown. \\n\\n \\n\\n ‘I am fine and glad you have come, Grannie,’ whispered the child, before the old woman could say anything. ‘I believe it is the Piskeys who have eaten the junket and things you made for Granfer. I saw a dinky little fellow not much bigger than your thumb go in through the keyhole just now. They are having a fine time in there, anyhow,’ as [122]her grandmother looked at her oddly. ‘If I were you, I would look through the keyhole and see what they are doing.’ \\n\\n \\n\\n And through the keyhole the old woman looked, and saw, to her amazement, scores and scores of green-coated little men, whiskered like a man, on the oak table, standing round the junket-bowl ladling out the rich, thick junket with their tiny little hands, and half a dozen other little chaps were up in the window-sill passing out her delicious sugar biscuits to the Tiny Moormen, who were even more whiskered and bearded than their distant relations, the Piskeys. \\n\\n \\n\\n By their faces, they were all greatly enjoying themselves, and at the expense of Granfer Nankivell, the turf-cutter! \\n\\n \\n\\n Grannie Nankivell was so astonished that she lost her mouth-speech,2 but when she found it her old voice shrilled through the keyhole: \\n\\n \\n\\n ‘Filling your little bellies with the junket and biskeys I made for my old man, be ’ee?’ she cried. ‘I’ll wring the necks of every one of you—iss fy, I will!’ \\n\\n \\n\\n The old woman spoke too soon to carry out her threat, for she had no sooner spoken than the Piskeys vanished, the Tiny Moormen as well, and where they went she never knew. \\n\\n \\n\\n But her husband told her the little rascals were still in the spence when she could not see them. \\n\\n \\n\\n ‘They have the power to make themselves visible [123]or invisible, whichever is most convenient to them,’ he said. \\n\\n \\n\\n ‘They have done you out of your biscuits and junket a good many times, anyhow,’ cried the old woman. \\n\\n \\n\\n ‘Iss,’ said Granfer Nankivell, ‘they have; and as I did away with the Piskey-beds, we are quits. I only hope they will be of the same mind, and won’t come any more and eat up those nice things you make for me. I am quite longing for a plateful of junket and one of your sweet biscuits.’ \\n\\n \\n\\n Whether the Piskeys thought the old turf-cutter was sufficiently punished for clearing out their sleeping-places, or whether Grannie Nankivell’s threat to wring their necks frightened them away, we cannot tell. At all events, they and the Tiny Moormen kept away from the cottage on the moor, and whenever the old woman made sugar biscuits and sweet junket, and put them in the spence, no two-legged cat, Moormen or Piskeys, ever ate up those specially-made dainties; and little Genefer’s honesty was never again doubted. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2437/67611.html","bookId":556,"book":{"id":556,"title":"North Cornwall Fairies and Legends","description":"简介： The tales contained in this little volume of North Cornwall fairy stories, by Enys Tregarthen, are either founded on folk-lore or they are folk-lore pure and simple....","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2437","creation":"Aug 1, 2019 12:18:57 AM","modification":"Aug 1, 2019 12:18:57 AM"}}
