{"id":42839,"no":4,"title":"CHAPTER IV. THE THURSDAY RENDEZVOUS.","content":"Beryl Gaselee, in her warm leather motor-coat and close-fitting little hat, stood gazing out of the coffee-room window of the Unicorn Hotel in the quiet old cathedral town of Ripon, in Yorkshire. In the falling twilight of the wintry afternoon all looked dull and cheerless. The car stood outside with Ronald Pryor and Collins attending to some slight engine-trouble—the fast, open car which Ronnie sometimes used to such advantage. It was covered with mud, after the long run north from Suffolk, for they had started from Harbury long before daylight, and, until an hour ago, had been moving swiftly up the Great North Road, by way of Stamford, Grantham, and Doncaster to York. There they had turned away to Ripon, where, for an hour, they had eaten and rested. In a basket the waiter had placed some cold food with some bread and a bottle of wine, and this had been duly transferred to the car. All was now ready for a continuance of the journey. “Well, Beryl!” exclaimed Ronnie, returning to where the pretty young air-woman was standing before the fire. “All ready—eh?” “Quite, dear,” was her reply. “You haven’t[64] forgotten the revolvers, have you?” she asked in a low voice. “No. There’s one for each of us—and one for you if you’d like it,” he laughed. “Yes. I think I’d better have it, dear—one never knows.” “Not much good against a machine-gun, you know!” he laughed. “But a weapon always gives one confidence.” “I’ve had the flask filled with hot tea,” she said. “We shall, no doubt, want it.” “Yes. It will be a coldish job. Are you quite warm enough—quite sure you are?” he asked, as the white-haired old waiter entered the snug, warm coffee-room. “Quite,” she answered, as she drew on her fur-lined gloves. “Well—good-evening, waiter!” exclaimed Ronnie cheerily. “Good-evening, sir,” replied the old man pleasantly. Ten minutes later, with Ronnie driving, Beryl snuggled at his side, and Collins seated under the rug in the back of the car, they had passed the dark, imposing fa?ade of the grey, old cathedral and were well out upon the darkening road, through High Berrys and over Hutton Moor. At last they reached Baldersby Gate, where they turned into the long, straight Roman road which runs direct north from York, and, though a continuation of the old Watling Street, is there known as Leeming Lane. With nightfall there had arisen a cutting north-east wind, that searching breeze which all dwellers in Yorkshire know far too well, comes over with the month of February. From Baldersby Gate, past Sinderby Station,[65] through Hope Town on to Leeming village, the ancient road ran straight as an arrow, then, with a slight curve to Leeming Station, it ran on to Catterick. By this time they had passed the race-course, which lay on the left of the road before coming to the cross-roads; it was already dark, and drawing up at Catterick Bridge Station, Collins got down and lit the head-lamps, Ronald Pryor having a written permission from Whitehall to use them. Striking across through the town of Richmond they climbed the high hills over Hipswell and Barden Moor to Leyburn, and then down into Wensley Dale, famed for its cheeses, by the northern road which took them through the picturesque village of Redmire on to Askrigg as far as a darkened and lonely inn close to Hardraw Force. There they pulled up, and, entering, asked for something to eat. By that time, ten o’clock, all three were chilled to the bone, after crossing those wide, open moorlands, where the keen wind cut their faces all the time. The landlady, a stout, cheerful person, soon busied herself to provide creature comforts for the travellers, and within a quarter of an hour all were seated at a substantial meal. While the good woman was busying herself at table Ronnie suddenly became inquisitive, exclaiming: “There’s a friend of mine, a Mr. Aylesworth, who often comes up to this neighbourhood. He lives in Leeds, but he rents a cottage somewhere about here. He’s a queer and rather lonely man. Do you happen to know him?” “Oh, yes, sir! Mr. Aylesworth is quite well known in Hardraw. He has rented old Tom[66] Dalton’s cottage, up on the hill at Simon Stone, for quite eighteen months now.” “Is that far from here?” “Only about half-a-mile up Buttertubs Pass.” “Buttertubs! What a very curious name!” Beryl remarked. “Where does the pass lead to?” “Why, straight up over Abbotside Common, just below Lovely Seat, and it comes out on the high road in Swale Dale, close to Thwaite.” “Who is Dalton?” asked the airman. “Old Farmer Dalton. He’s got several cottages on his place. He himself lives over at Gayle, close to Hawes.” “Does my friend Aylesworth ever come in here?” “Oh, very often, sir!” replied the woman. “Everybody knows him. He’s such a real cheerful, good-hearted gentleman. He’s always giving away something. It’s a sad thing for many about here that there’s no treating nowadays.” “Well,” laughed Beryl, “the order is, I hear from my friends, very often broken.” “You’re right, miss,” the broad, round-faced woman admitted. “You can’t always prevent it, you know, though we folk do all we can, because of our licenses.” “So my friend Aylesworth is quite popular? I’m glad to hear that,” replied Ronnie. “He lives here constantly nowadays, I suppose?” “Oh, no, sir! He comes down here just at odd times. Sometimes in the beginning of the week; sometimes for the week-end,” was the reply. “He’s often up in London—on Government contracts, I’ve heard him say.” Beryl and her lover exchanged shrewd and meaning glances. [67]“Yes, I know that Mr. Aylesworth must be very busy,” remarked Pryor. “I suppose he comes out here just for quiet and rest?” “Yes. That’s it, sir,” replied the inn-keeper’s wife. “Only the other day he called in here, and was saying that he was so busy that it was a complete change to come here to the moors for rest and fresh air.” “You’ve had Zepps over here lately, I’ve heard. Is that true?” inquired Ronnie. “Well, they’ve passed over once or twice, they say, but I’ve been in bed and asleep. My husband was called up last month, and is now in training down in Kent. Only a week ago he wrote to me saying he hoped I wasn’t frightened by them. Somebody down in Kent had evidently spread a report that they had been over here. But I’m thankful to say I heard nothing of them.” “Do you ever get aeroplanes over?” asked Beryl. “Oh, yes, miss! We get some across in the daytime. They must have an aerodrome somewhere on the coast, I think—but I don’t know where it is.” “Do you ever hear anything of them at night?” inquired the girl. “Well, just now and then. I’ve been awakened sometimes by the humming of them passing over at night—our patrols, I suppose they are.” Ronald Pryor exchanged another meaning glance with his well-beloved. “Do they sound quite near?” he asked. “Oh! quite—unusually low. I suppose they man?uvre across the moors?” she said. “Mr. Benton, the farmer who lives over at Crosslands, quite close here, was only the other day telling me a curious story. He said he was going home[68] late the other night from Jack Sneath’s, when he heard an aeroplane above him, and he saw the machine making some flashlights—signalling to somebody. It flew round and round, hovering and signalling madly. Suddenly, he told me, the aviator cut off his engine, as though he had received an answer, and sailing over the moor, descended somewhere close by, for the hum of the engine was heard no more.” “Curious!” Pryor remarked, again glancing at his well-beloved. “Oh, no, sir!” replied the smiling woman. “It was only the night man?uvres of our splendid aircraft boys. Really everyone must admire them,” she added, unaware of Ronald Pryor’s qualifications as an air-pilot. Ten minutes later all three were out on the road again, travelling along the valley in the direction of Hawes Junction. The night was overcast and very dark, therefore Ronnie was compelled to switch on his head-lights, the road at that part being particularly dangerous. The country they were now in was a wild and lonely one, with high peaks and wide, desolate moorlands; a sparsely populated district, far removed from the busy workaday world. They had travelled as far as the old inn called the Moor Cock, where the road branches off to Kirkby Stephen, when Ronnie pulled up, and, turning, ran back again to within a mile of Hardraw. Then finding a convenient grass field, he ran the car in behind a low stone wall, where it was hidden from any passer-by. Then, each taking a flash-lamp and a revolver, they, after shutting off the lights, sought a path which at last they took, climbing up the steep hill-side. A quarter of an hour’s walk brought them to a[69] narrow, stony lane, which, after another quarter of an hour, led them to a long, low, stone-built cottage, surrounded by a clump of trees. “That’s Dalton’s cottage,” remarked Ronnie. “It answers exactly to the description we have of it. Now, Collins, you get down on the left, so as to have a good point of view while we watch for anything stirring away on the right.” It was then half-past ten o’clock. Though cold, the night was very still on those lonely moorlands. The house Ronnie and Beryl were approaching was in total darkness, a gloomy, remote place in which the mystery-man from Leeds, George Aylesworth, came for rest and quiet after the business turmoil of the great manufacturing town. At last Ronald and his companion got up quite close to the house, and finding a spot whence they had a good view of the front door, they crouched beneath an ivy-clad wall, and there, without speaking, waited, knowing that Collins was on watch at the rear of the premises. Their vigil was a long and weary one until at last the door opened. By the light within there was revealed a tall, lean man in overcoat and golf-cap. Beneath his left arm he carried something long and round, like a cylinder, while in his right hand he had a stout stick. He came out, closed the door carefully behind him, and then, passing close to where the air-woman and her lover were crouched in concealment, struck away up a steep, narrow path which led up to the summit of the Black Hill. Happily for the watchers the wind had now become rather rough, hence they were able to follow the man Aylesworth—for Ronald recognised him by the description; keeping at a respectful distance, of course, but determinedly dogging his footsteps. [70]After walking for nearly half-a-mile up a steep ascent, and over a stony path, the man Aylesworth halted at a point which gave a view of the moor, with its fells and dales, for many miles around. From where Ronald halted he could see the man faintly silhouetted against the skyline. “Look!” whispered Beryl. “What is he doing?” “Watch,” urged her companion. And as they watched they suddenly saw a beam of intense, white light, a miniature searchlight of great brilliance, pierce the darkness skyward. The man Aylesworth was manipulating what they now recognised to be an acetylene signalling apparatus, a cylinder mounted upon a light tripod of aluminium, with a bright reflector behind the gas-jet, and, from the manner that the light began to “wink,” three times in quick succession—the Morse letter “S.”—there was evidently some shutter arrangement upon it. Slowly the beam turned from north to south, making the Morse “S.” upon the clouds time after time. Suddenly the light was shut off. For five minutes by Ronald’s watch no flicker was shown. Then, once again, the series of “S’s.” was repeated in a semi-circle from north to south, and back again. Another five minutes passed in darkness. Once more the light opened out and commenced to signal the Morse flashes and flares “N. F.,” “N. F.,” “N. F.,” followed by a long beam of light skyward, slowly sweeping in a circle. Pryor glanced at his watch. It was then exactly midnight. Aylesworth had, no doubt, a rendezvous with someone. His signal could be seen from that point over a radius of fully thirty[71] miles, or even more, for Ronnie, who understood signalling, was well aware that the portable apparatus being used was one of the most intense and reliable type—one that was, indeed, being used by the German army in Flanders. For the next half-hour the signals were repeated, until, of a sudden, Beryl’s quick ears caught some unusual sound. “Hark!” she whispered. Both, on listening intently, heard the low hum of a distant aeroplane in the darkness. The light was signalling madly, and at the same time the machine, high in the vault of the night sky, was fast approaching. The pair watched, straining their eyes to discover it, but though the sound betrayed its presence, they could not discern its whereabouts until there appeared high over them a small, bright light, like a green star, which repeated the signal “N. F.,” “N. F.,” half-a-dozen times. “This is most interesting!” whispered Ronald, “Look! Why, he’s planing down.” Beryl watched, and saw how the aeroplane which had come out of the night was now making short spirals, and planing down as quickly as was practicable in that rather dangerous wind. Every moment the low hum of the engine became more and more distinct as, time after time, signals were shown in response to those flashed by the mysterious man from Leeds. Then ten minutes later the machine, which proved to be a Fokker, came to earth only about fifty yards from where Beryl and Ronald were standing. Aylesworth ran up breathlessly the moment the machine touched the grass, and with him the watchers crept swiftly up, in order to try to overhear the conversation. [72]It was in German. The aviator and his observer climbed out of the seats and stood with Mr. Aylesworth, chatting and laughing. The pilot calmly lit a cigarette, and drawing something from his pocket, gave it to the man who had been awaiting his arrival. Thereupon, Aylesworth, on his part, handed the airman a letter, saying in English: “That’s all to-night. Please tell Count von Stumnitz that the reply will not be given till Thursday next. By that time we shall have news from the North Sea.” “Excellent,” replied the aviator, who spoke English perfectly, and who, if the truth were told, had before the war lived the life of a bachelor in Jermyn Street. “I shall be over again on Thursday at midnight punctually. I must run up from the south next time. The anti-aircraft found me on the coast and fired.” “Well, if you come on Thursday I’ll have the despatch ready.” Suddenly the observer, who spoke in German, said: “I have some letters here from the Wilhelmstrasse. Will you post them for me?” “Certainly.” “They are all ready. They are written upon English paper, and English penny stamps are upon them. Therefore, they can be put into any post-box, and will not arouse suspicion. They mostly contain instructions to our good friends who are scattered over Great Britain.” Aylesworth took from the man’s hand a packet of letters tied with string—secret despatches from the German General Staff to the Kaiser’s spies in Great Britain—and thrust them into the big pocket of his overcoat. [73]The two Huns and the traitor stood there together in cheery conversation. Much that they said Ronald and Beryl could not overhear. Sometimes there was low whispering, sometimes a burst of hilarious laughter. But it was evident that all three were in perfect accord, and that the aviator and his observer were well-known to Mr. Aylesworth of Leeds. Far away—many miles off—there showed a faint tremor in the sky, the flash of a distant anti-aircraft searchlight. Now and then it trembled, then all became dark again. The pair of enemies, who that night had landed upon British soil, at last decided that it was high time for them to hie back over the North Sea, therefore they climbed again into their machine—one of the fastest and newest of the Fokker type—and for a few minutes busied themselves in testing their instruments and engine. The pilot descended again to have a final look round, after which he once more climbed up to his seat, while Aylesworth, acting as mechanic—for, if the truth be told, he had been an aviator’s mechanic at Hendon for three years before the outbreak of war—gave the propeller a swing over. There was a loud roar, the machine leapt forward over the withered heather, bumping along the uneven surface, until, gaining speed, the tail slowly lifted, and after a run of a couple of hundred yards, the Fokker skimmed easily away off the ground. As Ronnie watched in silence he saw that for another fifty yards the German pilot held her down, and then, with a rush and that quick swoop of which the Fokker is capable, up she went, and away! She made a circuit of perhaps eight hundred[74] feet and then sped somewhere into the darkness upon a straight eastward course to the coast, and over the rough North Sea. As the pair watched, still arm-in-arm, they again saw the faint tremor of our searchlights in the far distance. “Wouff! Wouff! Wouff!” sounded faintly far away. The Fokker had been picked up by our anti-aircraft boys, and was being fired upon! “Wouff! Wouff!” again sounded afar. But the bark of the shell died away, and it seemed plain that the Hun machine had, by a series of side-slips, nose-dives, and quick turns, avoided our anti-aircraft guns, and was well on its way carrying those secret communications to the German General Staff. The enemy pilot had “streaked off” eastwards, and to sea. “Now we know this fellow Aylesworth’s game!” whispered Ronnie. “Next Thursday he will be sending away some important message. Therefore, we must be here to have a finger in the enemy’s pie—eh?” “Certainly, dearest,” replied the gallant little woman at his side. “It certainly is a coup for you that you have discovered this secret means of communication between ourselves and the enemy.” “Not really,” he said in a low voice. “Our people scented the mystery, and have handed it on to me to investigate.” “Well, we know that something is leaving us on Thursday—some important information.” “Just so. And is it up to us to see that Aylesworth does not send it across the sea successfully—eh?” [75]“Let’s get away now,” urged Beryl. “He may discover us.” Ronald stood, his arm linked in that of his well-beloved. He made no remark as he watched the dark silhouette of the man Aylesworth disappear over the brow of the hill. Presently he said: “Well, dear, he hasn’t discovered us. But if all goes well we shall be back here on Thursday.” Half-an-hour later they met Collins awaiting them near the car. The mechanic became greatly interested when his master described briefly what they had seen. Then all three mounted into their seats, the lights were switched on, and they turned back to Kirkby Stephen, where they spent the remainder of the night at the old “King’s Arms,” giving a fictitious story of a breakdown. Two days later, Pryor having made a long written report to the Anti-Aircraft Headquarters, took the train from Liverpool Street Station down to Harbury Court, there to await instructions. Beryl, who was already down there with Iris, was greatly excited, for only she, Ronald, and Collins knew of the intended coup next Thursday. Zeppelins had sailed over the East Coast, and had paid the penalty for so doing. “Uncle”—the pet name for Count Zeppelin at the Potsdam Court—was, it was reported, in tears of rage. He had promised the Kaiser that he would appal Great Britain, but the British refused even to be alarmed. The Zeppelin menace, thought by the world to be so serious, had “fizzled out,” and it now seemed that the more mobile aeroplane—often with the[76] British tri-colour rings upon its wings—had taken its place. And it was one of those which Ronnie and Beryl knew would be due over that Yorkshire moor next Thursday at midnight. Ronnie spent the night at Harbury, and in the morning received a telegram calling him urgently to Whitehall. On his return, he said but little, though, from his smile, Beryl knew that he was satisfied. Wednesday came, and in his brown overalls he spent nearly the whole day with Collins in “The Hornet’s Nest.” They were getting the machine in trim for a long night flight. Both pilot and mechanic consumed many cigarettes as they worked, Ronnie examining every stay and every instrument. He satisfied himself that the Lewis gun, which could fire through the propeller, was in working order, and he tested the silencer, which he brought out from the house for that purpose, and then returned it to its place of safety from the prying eyes of the enemy. Now and then Beryl came out and watched the preparations. Thursday dawned grey and overcast, with every indication of rain. Indeed, rain fell at ten o’clock, but at eleven, it having cleared, Ronnie took Collins, and they went up for a “flip” together in order to make a final test. Beryl and her sister stood in the meadow watching the machine ascend higher and higher, until it had gained an altitude of fully twelve thousand feet. Then it seemed to hover for a moment, after which, with a long, graceful swoop, Ronnie commenced a series of aerial evolutions which Beryl, as an accomplished[77] air-woman, knew to be most difficult, and showed to her what perfect control Ronald had over the machine. The silencer was on, therefore no sound could be heard of the engines. In about twenty minutes’ time Ronnie came lightly to earth, and pulled up close to where Iris and her sister were standing. “Everything going finely!” he shouted to Beryl, as he unstrapped himself, and clambered out of the pilot’s seat. Then, when he joined her, he said: “As the crow flies the spot on the moor is about two hundred and thirty miles from here. Therefore we ought to leave soon after seven in case we lose our way.” Then, after luncheon, they spent the afternoon studying maps and marking directions by which to steer, by the lines of railway mostly. Night flying, with the lights of towns extinguished, is always a difficult matter, and, as Beryl knew by experience, it is extremely easy to lose one’s way by a single mistake. By seven o’clock darkness had already fallen; but the barometer, at which both had glanced many times with anxious eyes, showed a slow, steady rise, and with the direction of the wind, combined to create excellent conditions for flying at high altitudes. “The Hornet” had been wheeled out of its “nest,” and Beryl in her fur-lined aviation kit, her leather cap and goggles, had strapped herself in behind her lover, who, with a flash-lamp, was now busily examining the row of instruments before him. Meanwhile Collins, on the ground, shouted: “Best of luck to you, sir, and also to Miss Beryl!” “Thank you, Collins!” cried the girl. “We ought to be back by five.” [78]“All ready, Collins?” asked Ronnie at last sharply. The mechanic sprang to the propeller. “Contact, sir?” he asked. Ronnie threw over the switch with a click. The mechanic swung the big, four-bladed propeller over, when the engine started with noisy, metallic clatter, increasing until it became a deep roar. Ronnie was testing his engine. Finding it satisfactory, he quickly throttled down. Collins took the “chocks” from beneath the wheels, and the pilot “taxied” slowly across to the corner of the big field until, gaining speed, he opened up suddenly, when the machine skimmed easily off the ground, over the belt of trees, and away up into the void. As they ascended, Beryl, gazing down, saw below a few faint lights to the south-east, and knew that there lay the important town of H——, blotted out at even that early hour of the evening, for the lights visible would have only indicated a village in pre-war days. In the sky further eastwards toward the sea was a slight tremor of light showing that searchlights were already at work testing their beams, and making oblong patches of light upon the clouds. At ten thousand feet up, as the altimeter then showed, it was intensely cold, and the girl buttoned up her fur-lined coat and fastened up her wind-cuffs. The roar of the engine was too great, of course, to admit of conversation. Ronnie had not switched on the silencer, as it impeded speed, and after a long flight it might choke just at the very moment when its services were most required. Due north in the increasing darkness went “The Hornet,” skilfully handled by the most[79] intrepid of air-pilots, high over town, forest, and pasture, hill and dale, as the hours crept slowly on. Suddenly, however, Ronnie turned the machine, and began to circle over a few scattered lights. Then Beryl recognised his uncertainty. Time after time he searched for the railway line to York, but though both of them strained their eyes they could not pick it up again. Hence they were compelled, much to Ronnie’s chagrin, to make a descent in a big grass-field, where, in the blackness, they made a rather rough landing, and presently inquired their whereabouts of some villagers. To their amazement they found that beneath the hill where they had descended the railway line actually ran. And it was on account of the long tunnel they had missed it. So, ascending once more, they struck again due north by the compass, and finding the line, flew along it over Doncaster to York. Then, still continuing northwards, they reached Thirsk Junction, until five minutes later as they were approaching Northallerton, intending to strike westward and follow the line to Hawes, “The Hornet” developed serious engine trouble, and Ronnie was forced again to descend, planing down into an unploughed field. For half-an-hour, aided actively by Beryl, he was occupied in making a repair. It was then past eleven, and the girl expressed a hope that they would be at the rendezvous by midnight. “It will really be too bad if we arrive too late,” she added apprehensively. Ronnie did not reply. He was seriously contemplating giving up the expedition. The engine trouble was a very serious one. They might[80] last out perhaps another hour, but “The Hornet” could never return to Harbury with the engine in that state. This distressing fact, however, he did not tell her. “Hark!” cried Beryl suddenly. “Listen! Why, there’s a machine up—over us!” Ronald hold his breath. Yes, there was the distinct hum of a machine coming up from the east, following the railway from the main line over towards Hawes. “Oh! do let’s go up. That may be Aylesworth’s friend,” suggested Beryl. “I expect it is,” replied Ronnie grimly. “But with this engine there is danger—very grave danger—Beryl, dear. Are you quite prepared to risk it?” “I’ll risk anything with you,” was the girl’s prompt reply. “We’ve risked our lives in the air before, and we’ll do so again to-night. We must not fail now that we’re within an ace of success.” Her words spurred Ronnie to a supreme effort. With the hum of the mysterious machine in his ears, he set his teeth; then with the spanner in his hand he screwed the nut tightly, and without many further words he told his well-beloved that all was ready. They both got in, and two minutes later they were rising in the air, rapidly overhauling the mysterious machine. Those moments seemed hours to Beryl. She scarcely dared to breathe. Ronnie had switched on the silencer, and they were now speeding through the air without a sound, save for the shrill whistle of the wind through the planes. By the hum of the engine of the machine they were following they kept silently in its wake, gradually overhauling it. [81]Suddenly they saw flashes of white light from it—signals to the traitor Aylesworth in waiting below. Then they knew that they were not mistaken. Ronnie put every ounce into his crocked-up engine, knowing that if it failed they might make a nose-dive fatal to them both. Like an arrow he sped towards the aeroplane which had crept over the North Sea, and across Yorkshire to meet the man who had promised those secret despatches. Beryl saw deep below the flashes of a lamp—“N. F.,” “N. F.,” in Morse. Ronald Pryor saw it also and, suddenly turning the nose of his machine, he made a circle in silence around the enemy aeroplane. Again he circled much nearer. The German pilot was utterly ignorant of his presence, so silently did he pass through the air, until, narrowing the circle, he waited for the Fokker to plane down; then, in a flash, he flew past, and, with his hand upon the Lewis gun, he showered a veritable hail of lead upon it. The Fokker reeled, and then nose-dived to earth, with—as was afterwards found—its pilot shot through the brain, its petrol-tank pierced in five places, and one of its wings hanging limp and broken, such a terrible shower of lead had Pryor directed against it. Beryl and Ronald Pryor had perforce to return by train to Harbury, but, by previous arrangement, the man Aylesworth had been arrested, and was duly tried by court-martial. It is known that he was found guilty and condemned, but the exact sentence upon him will probably not be known until after the declaration of peace. And, after all, the doom of a traitor is best left unrecorded. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2845/78505.html","bookId":1221,"book":{"id":1221,"title":"Beryl of the Biplane","description":"简介： His companion, George Bellingham, who was in the uniform of the Royal Flying Corps, wearing the silver wings of the pilot, was perhaps three years his senior, fair-haired, grey-eyed, with a small sandy moustache trimmed to the most correct cut....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2845","creation":"Aug 1, 2019 12:24:39 AM","modification":"Aug 1, 2019 12:24:39 AM"}}
