{"id":75892,"no":42,"title":"Page 42","content":"Author: Kirsty Moseley\n Our relationship with Johnny had changed a lot too. He was actually a really close friend of mine now; he was such a nice guy and seemed to be growing in confidence every day. I think maybe that had something to do with Kate’s influence. They had been out together a couple of times, and Kate told me that he’d kissed her last night which she was positively glowing about. She actually really liked him, and I think he liked her too, which was sweet.\n Johnny had been coming to watch the Friday hockey games with us and for the last two weeks, he had even come to our ‘after game party’ for a couple of hours after too. We never spoke about my father, he never asked me anything about him and I didn’t bring him up. Occasionally, he would mention him in passing, something to do with his life or home and every time it would make me feel sick and slightly panicky.\n Today was Sunday and I was going with Johnny to watch him in a skateboarding competition. When he pulled up just after lunch time, I kissed Liam goodbye and giggled at his pouty face. “Stop pouting, Liam. I’ll be back in a couple of hours,” I said, laughing.\n He sighed dramatically. “But why can’t I come? Sundays are my days,” he grumbled, frowning.\n I smiled. “Liam, I told you, he could only get one guest pass. He asked me to go with him! Stop whining. I’ll see you later,” I instructed, kissing him again as I stood up. “Love you,” I vowed as I grabbed my keys and cellphone.\n “Love you more, Angel,” he called as I opened the door and ran to the car.\n “Hey,” Johnny greeted, smiling, as I got into his shiny little sports car.\n “Hey. You already psyched and ready for the competition?” I asked, grinning.\n He nodded. “Yeah, I’m a bit nervous though. The new trick that I’ve been practicing keeps going wrong. I’m gonna look like such a dick if I fall on my face,” he groaned, grimacing.\n “You won’t fall on your face, Johnny. Have some confidence,” I replied sternly.\n He smiled and rolled his eyes, driving us to the skate park where they had set up a huge half pipe ramp thing. Johnny had been trying to teach me a few things about skating but to be honest, like most things sporty, it just went in one ear and out of the other. If it wasn’t dancing, then I just wasn’t really that interested.\n Usually I liked to watch Liam play, but that was only to perv on him in his uniform. The ramp they had set up was absolutely huge. I felt a little sick when I looked at it. It was so high, at least fifteen foot high on each side. “Um Johnny, are you sure about this?” I asked, as we walked up to the signing in booth. Johnny handed over our competitor passes and we were given yellow wrist bands and waved in.\n “Amber, I’ll be fine, don’t worry.” He laughed as he dragged me over to the skater area where people were hanging around waiting to go on and practice.\n “Shit, Johnny, it’s so high! What if you get hurt?” I asked, swallowing the lump in my throat.\n “Hey, cut that out right now. You told me in the car to have some confidence, I expect you to do that same,” he said grinning at me. Jeez, I had confidence, but that would hurt if he fell from there! We sat there watching the other skaters have their turns. The tricks that they were doing blew my mind, somersaults, handstands, everything that you could think of.\n The whole time I just felt worse and worse. I wasn’t even sure if I could watch him do it. After about an hour, Johnny was called up to go and get ready, and my heart started trying to break out of my chest.\n “Oh God. Please be careful,” I begged.\n “I’ll try. But if I die, you can have my car,” he replied, winking at me.\n “Only if I can re-spray it pink,” I joked, trying not to show him I was terrified. He laughed and walked off quickly to the area to warm up for a few minutes.\n When it was finally his turn, I couldn’t breathe. I watched him climb the stairs to the top of the platform and position at the end with the board tipped up waiting to go. He smiled down at me and I tried to smile back - I’m pretty sure my expression looked more like a grimace though. The whistle blew, and he tipped off. I squeezed my eyes shut, listening to the people clap and cheer, but I didn’t want to see. I knew that the minute I opened my eyes, he’d fall and break his neck.\n After an hour, well, it felt like an hour anyway, it was probably only about a minute, people were clapping like crazy so I chanced opening my eyes. Johnny was walking down the stairs, no broken bones, no blood. I jumped up and clapped along with everyone else, deciding to pretend I’d watched. Next time I’d have to tell him I couldn’t come. I just wasted his spare ticket by not even watching it.\n He jogged over and hugged me tight. “That was awesome!” I chirped enthusiastically.\n He laughed and shook his head. “Yeah? Did it look good through your eyelids?” he asked, laughing harder.\n I looked at him apologetically. “I’m so sorry! I couldn’t watch it, Johnny. I felt so sick. I was so scared, I just couldn’t,” I said apologetically.\n He shook his head. “Don’t apologise, it’s fine. I landed it though,” he boasted, grinning wildly.\n I nodded. “I know, I heard people cheering,” I said a little sheepishly. I felt incredibly guilty. He’d brought me here to watch and give him support and I couldn\u0027t even do that. I guess I was a useless stepsister.\n We sat back down and he gave me a play by play of everything that I’d missed while we waited for the scores and stuff to be counted. Johnny was one of the last to go on, so we didn’t have to wait too long before the results were announced. When the guy walked on the stage I gripped his hand nervously, praying he had been scored well.\n “OK, so we had some excellent tricks today. The judges were very impressed, so congratulations,” the guy stated on the little platform. “Right so, in reverse order. Coming in third place with a score of forty-four points out of fifty, is…. Johnny Brice,” he called.\n I squealed and jumped on him excitedly as he laughed. “Oh God, Johnny, that’s awesome! I’m so proud of you,” I enthused, almost crying.\n He grinned. “Thanks, Amber. I’d better go get my trophy.” He nodded at the stage. I stood there cheering and clapping like an idiot while he went up and got his little silver trophy. He ran back and hugged me spinning me in a circle.\n “Johnny, that’s so good. Let me see it.” I practically snatched it out of his hands and looked at the little silver trophy with a little man on a skateboard.\n “I’m really pleased with forty-four points. That’s my best score.” He grinned, proudly.\n “Hey, shall we go get something to eat to celebrate? My treat,” I suggested, happily.\n “Sure. I just need to get changed first though; I can’t really go out like this.” He looked down at his ripped t-shirt, skater shorts and dirty sneakers, pulling a face.\n Why the hell would he need to change? “Johnny, I don’t care what you wear,” I said honestly, as we started walking back to his car.\n He laughed. “Amber, I look a mess. These are my competition clothes. I always wear the same thing; they’re like my lucky clothes. They’re all ripped and dirty. Besides, I’m all sweaty and stuff,” he countered, shrugging. We climbed into his car. “I’ll just nip home and change, and then we can go,” he said as he pulled out of the parking lot.\n Oh shit! He wants me to go to his house? I started to feel sick. I couldn’t go, I didn’t want to see my father, I couldn’t. I closed my eyes, willing myself not to freak out. Liam wasn’t here so I didn’t want to have a full blown panic attack.\n “I can’t,” I whispered.\n He glanced at me, confused. “You can’t go to dinner?” he asked, looking at me like I was crazy, probably because it was my idea in the first place.\n I shook my head. “I can’t go to your house, Johnny. Please, I can’t see him,” I begged as he continued to drive in the opposite direction to my house.\n “Stephen?” he asked, frowning. I nodded, unable to speak through the lump in my throat. My hands were shaking. I closed my eyes and thought of Liam, trying to stay calm. I thought of the colour of his eyes, how his hair felt when I ran my hands through it, the sound of his voice.\n “You OK?” Johnny asked, sounding concerned.\n I nodded weakly. “I don’t want to see him, Johnny,” I whispered, turning in my seat to look at him.\n He was trying to watch the road and look at me at the same time. “Why not?” he asked quietly. I shook my head. I couldn’t talk about it, especially not to him, that was his stepfather for goodness sake, he lived with him.\n “I just don’t, please.” I begged him with my eyes.\n He sighed and shook his head. “He’s not there anyway. He went away for the weekend with my mom and Matt. They’re not due back until late tonight,” he said.\n He wasn’t there?\n “Are you sure?” I asked, my body was starting to relax.\n He nodded and smiled reassuringly. “Positive. They went to Mersey for the weekend to see my grandparents. They’re not getting back until like ten or something.”\n I looked at him to make sure he wasn’t lying or trying to trick me or something. He looked like he was telling the truth. Johnny was a really nice guy, he wouldn’t do something like that to me, he wouldn’t lie. “OK,” I agreed quietly.\n He smiled and looked back at the road. “So, do I get to know why you and Jake hate Stephen so much?” he asked curiously. I closed my eyes; I really didn’t want to have this conversation with him, with anyone. Even Kate didn’t know any details about my father and my childhood.\n “Johnny, I don’t want to talk about it. It’s in the past, I prefer it to stay there,” I replied, praying that he would drop it.\n He nodded, looking a little disappointed and sad. “OK. Well, if you ever need to talk to me about anything, you can. You know that, right?” he asked as he pulled onto a really nice looking street. I nodded looking out of the window; the houses were huge, with big expensive cars in the drives. He pulled in to a driveway and I glanced up at the huge pale blue house. It looked like my dad had certainly done well for himself. \n","sourceLink":"https://allnovel.net/the-boy-who-sneaks-in-my-bedroom-window/page-42.html","bookId":1780,"book":{"id":1780,"title":"The Boy Who Sneaks in My Bedroom Window","description":"Storyline: \n Liam James, boy next door and total douchebag, is my brother’s best friend. I can’t stand him. Well, that’s not strictly true, at night I see a side of him that no one else does. Every night Liam becomes my safe haven, my protector, the one to chase the demons of my abusive childhood away and hold all the broken pieces of me together. \n He’s cocky, he’s arrogant, and he’s also some sort of playboy in training. With his ‘hit it and quit it’ mentality, he’s the last person you’d want to fall in love with. I only wish someone had told my heart that… \n The international bestselling novel, and finalist of the Goodreads choice awards YA fiction 2012.\n \n","cover":"https://allnovel.net/images/the-boy-who-sneaks-in-my-bedroom-window.jpg","author":"Kirsty Moseley","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-boy-who-sneaks-in-my-bedroom-window.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:35:56 AM"}}
