{"id":19931,"no":25,"title":"CHAPTER XXIV. CHRISTMAS.","content":"The mail came, but not the comfort. The only letter was a black-edged one addressed to Oscar. He came to his wife with the letter open in his hand, and sadly and tenderly broke to her its contents. A fit, resembling that which had attacked Mrs. Thorn in the early part of the year, had this time proved fatal. Jane wrote to her brother-in-law from the chamber in which lay a dear form in the stillness of death. Many tears did Io shed over the letter; and yet both to her and to Oscar there came a mournful consolation in the thought that the gentle lady had been saved from knowledge of the cause of the frightful death of her nephew Walter, her sister’s orphan child, whom she had brought up with her own. The dark shadow over Io’s home would throw no blackness over her mother’s grave. Thud’s grief for the loss of his parent was shown in more violent form than Io’s. He flung himself on the sofa, and cried and howled like a passionate child. There was no small admixture of selfishness in the sorrow of the poor lad. He had lost a home as well as a parent, and had now no resource to fall back upon when he needed money or help. Thud realized at last that he must swim by his own exertions, unless he intended to sink. There was in Thud at least a temporary improvement; for a while he built up no fanciful theories, obtruded on others no foolish opinions, and quietly went to his work. Io earnestly hoped that the vain lad would grow up at last into the useful, sensible man. There was a change also in Oscar, apparent in manner and mien, and shown in his countenance, which was grave but no longer gloomy. A deep peace had followed confession. No cloud hid the brightness of the Saviour’s face from the penitent sinner. Oscar had committed a crime, and was prepared to bear its penalty; but it would be in this world and not in the next. Coldstream was at last in the position of the thief on the cross: the criminal saw the blood flowing for his salvation, and heard in his heart the voice speaking in mercy and love, “Thou, even thou, shalt be in paradise with Me.” Especially did Oscar realize the blessing on him whose transgression is pardoned when he attended divine service on Christmas day. Io had given orders that every bud and blossom should be stripped from her garden to adorn the church. She had not had heart to join in the work herself; but when the Coldstreams entered the building, the soft fragrance around reminded them of the ointment poured forth on the Saviour’s feet from the broken box of alabaster. Husband and wife each brought a broken and contrite heart; both knew that it was for such that the Lord of glory had come to earth. At a later hour in the day, Oscar, when taking a solitary walk, was joined by the chaplain. Mark Lawrence had noticed with deep interest and hope the change in the expression of the face of his friend. He had observed something like hesitation in the manner of Coldstream before he turned away to quit the church in which his wife stayed to Communion. The heart of the young clergyman yearned with a brother’s love over his friend. With some hope that Oscar might at length speak freely, Lawrence came on that Christmas afternoon to his side. To the chaplain’s satisfaction, Coldstream was the first to break silence on the subject uppermost in the minds of both. “I did not turn my back to-day on the holy table because I thought that my Lord would forbid my approach,” said Coldstream in a quiet tone. “I believe that the feast is spread for the prodigal son, and that even I would be welcomed now to the Father’s table. I kept back on account of others, because, when that is known which must soon be known, communicants might be scandalized and shocked to think that they had shared the cup of blessing with a criminal such as I am.” Lawrence was silent. He was of too delicate a mind by a single word to hasten on a confession. Coldstream passed on to a somewhat different subject. “In another world how think you that a Paul would meet with a Stephen, a Manasseh with Isaiah, David with the man whom he had foully wronged, deceived, and slain?” “I think that all the redeemed will meet as brethren in the Father’s home,” replied Lawrence; “there the most deeply injured will forgive.” Oscar gave a sigh, but it was as much a sigh of relief as of sorrow. “And do you believe,” said he, “that amongst those whose robes are washed white the bitterness of remorse for crimes committed on earth will not remain to taint even the bliss of heaven?” “I believe, my dear friend, that God having blotted out all sin as a cloud is blotted from the sky, leaving no stain behind, no grief will remain, but only more fervent gratitude from those who have had the heaviest debt. Those whom Christ saves are justified, those who are justified are glorified too; no blot can rest on the beams of those who shine like the sun.” “Thanks,” said Coldstream earnestly; “and may I hope that even when you know what a sinner you have called your ‘dear friend,’ you will still retain some kindly, indulgent feeling towards him?” “I will never feel anything but warm friendship towards you whatever you may have done,” cried Mark Lawrence. With these words, and a warm press of the hand, the two men separated, for their paths lay in different directions. The brief conversation with Oscar often recurred to the mind of Lawrence, even when he sat at a festal Christmas board, with lively talk going on around. “If my conjecture be correct,” reflected the chaplain, “Coldstream has killed some man in a duel, and has bitterly repented of the deed.” \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3197/87403.html","bookId":837,"book":{"id":837,"title":"Beyond the Black Waters","description":"简介： Youll see it, Mr. Lawrence, youll see iteverything will be changed in England now that the old king is dead and the sailor William on the throne. The people are mad for changes, and shout for reform, as if it meant bread to their butter, or rather be...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3197","creation":"Aug 1, 2019 12:23:32 AM","modification":"Aug 1, 2019 12:23:32 AM"}}
