{"id":19933,"no":27,"title":"CHAPTER XXVI. PRISON LIFE.","content":"“This is the last day of the year,” observed Io to her husband, when they stood together on the deck as the vessel, sailing up the muddy Hoogly after a very rapid voyage, neared the city of palaces—“the last day of the year which begun with such hope and joy.” “And closes with such sorrow,” thought Oscar. Husband and wife each silently revolved the question, “What will the new year bring?” “Even what God will,” was the answer in Coldstream’s heart. “The worst is over, and I can peacefully await whatever He may send.” The new year began to Oscar within the walls of a prison, but he was subjected to no rigorous confinement. The man who had been his own accuser was treated as a gentleman by the officials; was allowed a separate cell, and permitted to receive daily visits from his wife. Io would have entreated to be allowed to share the cell, but Oscar forbade her making any such application. A quiet home was found for the poor young wife in a missionary’s dwelling, situated not very far from the prison; and every morning a palanquin might be seen going from that house in the direction of the gloomy building which held all that Io loved best upon earth; every day a slight form, dressed in deep mourning, passed through its stern archway. Io heard the heavy bolts drawn behind her, and glided, under the jailer’s escort, along the dreary passages which none so fair and innocent as she had ever trodden before. Something of the spirit of a Gertrude von Wart was in the bosom of Io. In a yet more terrible trial she could have said from her inmost soul,— “Hath the world aught for me to fear When death is on thy brow? The world—what means it? mine is here, I will not leave thee now.” But the long hours spent daily by Io in her husband’s cell were by no means hours of unmitigated grief. Oscar’s calmness had an effect upon the spirit of his wife, naturally so buoyant and cheerful. It was a real pleasure to Io to sit beside her husband whilst he read aloud to her, for books were not denied him. Sometimes Io would write to Oscar’s dictation—a privilege which she highly prized. The prisoner found congenial occupation in composing short meditations on the fifty-first psalm. Each day brought its verse for prayerful reflection, and each verse seemed to contain exactly the spiritual food which the penitent’s spirit required. Deliver me from blood-guiltiness, O Lord! found a strong echo in the prisoner’s soul, while the broken and contrite heart drank in with thanksgiving the assurance that it was not despised even by a perfectly holy God. Io, by Oscar’s permission, sent these meditations to the press, and they were read with profit by many who little imagined that they had been penned in a prison. Even hymns of praise, where two voices blended in humble thanksgiving, arose from Coldstream’s cell. Criminals confined near it listened and wondered, and the head jailer declared that he thought that God’s angels had begun to visit the prison. Oscar was no longer in darkness, though he was rather in twilight than in sunshine; not the evening twilight, resembling sweet memories of a happy day passed away, but rather the early twilight of hope, after a gloomy starless night, seen before the full glory bursts forth in the Eastern sky. By her husband’s express desire, Io wrote a letter to Dr. Pinfold, thanking him for kindness shown in old days, and not containing any allusion to the offer made by him which had given so much pain to the wife. Io also wrote repeatedly to her brother. But neither her letters to Thud nor that addressed to Dr. Pinfold ever received a reply. The Coldstreams were uneasy about the youth whom they had left at Moulmein, and at length made inquiries regarding him from Smith, his employer. The reply received was unsatisfactory. For some weeks young Thorn had worked fairly well under constant supervision; but as soon as he had received his first month’s salary, Thud had thrown up his situation as one unworthy of his merits, and had started off for Rangoon. Here all trace of the lad was lost. Letters sent to Rangoon were returned by the dead-letter office; nothing was known of him to whom they had been addressed. Io was never to find out what had become of her brother. In the ensuing chapter, however, the reader will find information regarding the career of Thucydides Thorn. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3197/87405.html","bookId":837,"book":{"id":837,"title":"Beyond the Black Waters","description":"简介： Youll see it, Mr. Lawrence, youll see iteverything will be changed in England now that the old king is dead and the sailor William on the throne. The people are mad for changes, and shout for reform, as if it meant bread to their butter, or rather be...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3197","creation":"Aug 1, 2019 12:23:32 AM","modification":"Aug 1, 2019 12:23:32 AM"}}
