{"id":19937,"no":31,"title":"CHAPTER XXX. CONSOLATION.","content":"As soon as Io quitted the prison cell of her husband, Oscar gave vent to the anguish which he had hardly been able to restrain in her presence. Leaving the loathed food untouched, the unhappy criminal paced up and down the narrow space in which he was confined, with hands tightly clasped and raised towards heaven with a gesture of something like despair. “The brand of Cain is upon me!” he groaned; “and like Cain, I am driven forth a vagabond on the earth. Like him, I cry, ‘My punishment is greater than I can bear!’ Is it sinful to pray that this misery may not be a prolonged one? Is it sinful to implore to be soon released from the worse than Egyptian bondage to which my mad wickedness has brought me, and to which I am dragging down with me my sweet, innocent wife?” The unexpected sound of footsteps in the corridor, then that of the key grating in the lock of his cell, startled the prisoner, for no one usually came at that hour. The heavy, nail-studded door slowly unclosed, the jailer entered to introduce a visitor, and then himself retired. “Lawrence!”—“My friend!” The brief greetings were exchanged, and the chaplain and the prisoner embraced, as brothers might embrace who were never again to meet in this world. For some minutes no other word was spoken. Oscar was the first to break the silence. “How came you to see me here—in my prison?” he asked. “I could stay away no longer,” was the chaplain’s reply. “I felt that I must see my friend once more.” “You call me friend,” said Oscar gloomily. “Friend—yes, brother!” cried Lawrence. “You forget why I am here,” said the criminal. “No, I do not forget that you are here because you had the courage to confess your deed; because you preferred punishment and disgrace to honour and ease; because you dared to pluck out the right eye. Coldstream, do you repent having made a confession?” “Never!” was the emphatic reply. “I would rather suffer any earthly misery than the terrible separation from God which I once had to endure.” “Then indeed you are my brother in Christ,” said the chaplain. “Are we not both sinners redeemed by grace?” Lawrence’s coming was to Oscar as a draught of cool and sweet refreshing water to one perishing of thirst. The friends sat down together, and long was the conversation which ensued. Coldstream spoke more freely to Lawrence of his grief than he had done to Io, for he was less afraid of inflicting pain. Lawrence gave heart-felt sympathy, and he gave consolation besides. The chaplain spoke of the tears of a David and the penitence of a Peter. He touched on the story of the woman deeply sunken in sin, who was offered freely the water of life by Him who was to die to procure it. Was not that woman to become a missionary to her own people? Was not David to prepare for the building of the Temple? Was not Peter to live an apostle and die a martyr? “God may have some work for you to do even in the place of your exile,” said Lawrence. “The Lord asks not, ‘Hast thou ever sinned greatly against Me?’ but He says, ‘Lovest thou Me?’ You can give the same answer as did the penitent Peter.” “I can, I can,” murmured Coldstream under his breath. “Then, though severed from country and friends, you have a Home and a Father on high.” After a few minutes of silent thought, Oscar said, in a hesitating tone, “Do you think that it would be sinful presumption in me to partake once more of the Supper of the Lord?” “One of my chief objects in coming to Calcutta was to see if you could receive from me Holy Communion,” said Mark. “It would be a great comfort, a great privilege,” said Coldstream; “one from which sin has for long shut me out.” The prison authorities put no difficulties in the way; they had from the first treated their unhappy charge with consideration. On the following morning the dreary cell became, as it were, a chapel. Over the rude table, on which former criminals had carved their names, a spotless white cloth was spread, covering every mark and unsightly stain. Before it knelt Oscar and his wife, with their missionary friends. It was a holy, peaceful service. Oscar felt that there was a blessing even for a sinner such as he. Blessed is he whose transgression is pardoned, and whose sin is covered; blessed is the man to whom the Lord imputeth not sin. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3197/87409.html","bookId":837,"book":{"id":837,"title":"Beyond the Black Waters","description":"简介： Youll see it, Mr. Lawrence, youll see iteverything will be changed in England now that the old king is dead and the sailor William on the throne. The people are mad for changes, and shout for reform, as if it meant bread to their butter, or rather be...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3197","creation":"Aug 1, 2019 12:23:32 AM","modification":"Aug 1, 2019 12:23:32 AM"}}
