{"id":20249,"no":14,"title":"CHAPTER XIV. TWO UNSATISFACTORY INTERVIEWS.","content":"Halbert\u0027s first emotion was surprise, his second was gratification. His rival could no longer enjoy the boat which he had envied him. Not only that, but he would get into trouble with Mr. Paine on account of the damage which it had received. Being under his care, it was his duty to keep it in good condition. \"I wonder how it happened?\" thought Halbert. \"Won\u0027t the young beggar be in a precious scrape when it\u0027s found out? Most likely he won\u0027t let Mr. Paine know.\" In this thought he judged Robert by himself. Straightway the plan suggested itself of going to the lawyer himself and informing him of Robert\u0027s delinquency. It would be a very agreeable way of taking revenge him. The plan so pleased him that he at once directed his steps toward Mr. Paine\u0027s office. On the way he overtook Hester Paine, the young lady on whose account he was chiefly incensed against Robert. Being as desirous as ever of standing in the young lady\u0027s good graces, he hurriedly advanced to her side, and lifting his hat with an air of ceremonious politeness, he said: \"Good-morning, Hester.\" Hester Paine was not particularly well pleased with the meeting. She had been made acquainted by her brother with the quarrel between Halbert and Robert, and the mean revenge which the former had taken in procuring the dismissal of the latter from the factory. Having a partiality for Robert, this was not likely to recommend his enemy in her eyes. \"Good-morning, Mr. Davis,\" she said, with cool politeness. \"You are very ceremonious this morning, Miss Hester,\" said Halbert, who liked well enough to be called \"Mr.\" by others, but not by Hester. \"Am I?\" asked Hester, indifferently. \"How so?\" \"You called me Mr. Davis.\" \"That\u0027s your name, isn\u0027t it?\" \"I am not called so by my intimate friends.\" \"No, I suppose not,\" said Hester, thus disclaiming the title. Halbert bit his lips. He was not in love, not because he was too young, but because he was too selfish to be in love with anybody except himself. But he admired Hester, and the more she slighted him the more he was determined to force her to like him. He did, however, feel a little piqued at her behavior, and that influenced his next words. \"Perhaps you\u0027d rather have the factory boy walking beside you,\" he said, with not very good judgment, if he wanted to recommend himself to her. \"There are a good many factory boys in town,\" she said. \"I can\u0027t tell unless you tell me whom you mean.\" \"I mean Robert Rushton.\" \"Perhaps I might,\" said Hester. \"He\u0027s a low fellow,\" said Halbert, bitterly. \"No one thinks so but you,\" retorted Hester, indignantly. \"My father was obliged to dismiss him from the factory.\" \"I know all about that, and who was the means of having him sent away.\" \"I suppose you mean me.\" \"Yes, Halbert Davis, I mean you, and I consider it a very mean thing to do,\" said Hester, her cheeks flushed with the indignation she felt. \"He attacked me like the low ruffian that he is,\" pleaded Halbert, in extenuation. \"If he hadn\u0027t insulted me, he wouldn\u0027t have got into trouble.\" \"You struck him first, you know you did. My brother told me all about it. You were angry because he walked home with me. I would rather go home alone any time than have your escort.\" \"You\u0027re very polite, Miss Hester,\" said Halbert, angrily. \"I can tell you some news about your favorite.\" \"If it\u0027s anything bad, I won\u0027t believe it.\" \"You\u0027ll have to believe it.\" \"Well, what is it?\" demanded Hester, who was not altogether unlike girls in general, and so felt curious to learn what it was that Halbert had to reveal. \"Your brother was foolish enough to leave his boat in Rushton\u0027s care.\" \"That is no news. Will was very glad to do Robert a favor.\" \"He\u0027ll be sorry enough now.\" \"Why will he?\" \"Because the boat is completely ruined.\" \"I don\u0027t believe it,\" said Hester, hastily. \"It\u0027s true, though. I was down at the river just now, and saw it with my own eyes. There is a great hole in the bottom, and it is hacked with a hatchet, so that it wouldn\u0027t bring half price.\" \"Do you know who did it?\" asked Hester, with the momentary thought that Halbert himself might have been tempted by his hatred into the commission of the outrage. \"No, I don\u0027t. It was only accidentally I saw it.\" \"Was Robert at the boat?\" \"No.\" \"Have you asked him about it?\" \"No, I have not seen him.\" \"Then I am sure some enemy has done it. I am sure it is no fault of his.\" \"If your brother had let me have the boat, it wouldn\u0027t have happened. I offered him a fair price for its use.\" \"He won\u0027t be sorry he refused, whatever has happened. But I must bid you good-morning, Mr. Davis,\" and the young lady, who was now at her own gate, opened it, and entered. \"She might have been polite enough to invite me in,\" said Halbert, with chagrin. \"I don\u0027t see how she can be so taken up with that low fellow.\" He waited till Hester had entered the house, and then bent his steps to Mr. Paine\u0027s office, which was a small one-story building in one corner of the yard. The lawyer was sitting at a table covered with papers, from which he looked up as Halbert entered the office. \"Sit down, Halbert,\" he said. \"Any message from your father?\" \"No, sir.\" \"No legal business of your own?\" he inquired, with a smile. \"No, sir, no legal business.\" \"Well, if you have any business, you may state it at once, as I am quite busy.\" \"It is about the boat which your son lent to Robert Rushton.\" \"I shall not interfere with that arrangement,\" said the lawyer, misunderstanding his object. \"I told your father that this morning,\" and he resumed his writing. \"I did not come to say anything about that. The boat wouldn\u0027t be of any use to me now.\" \"Why not?\" asked the lawyer, detecting something significant in the boy\u0027s tone. \"Because,\" said Halbert, in a tone which he could not divest of the satisfaction he felt at his rival\u0027s misfortune, \"the boat\u0027s completely ruined.\" Mr. Paine laid down his pen in genuine surprise. \"Explain yourself,\" he said. So Halbert told the story once more, taking good care to make the damage quite as great as it was. \"That is very strange,\" said the lawyer, thoughtfully. \"I can\u0027t conceive how such damage could have happened to the boat.\" \"Robert Rushton don\u0027t know how to manage a boat.\" \"You are mistaken. He understands it very well. I am sure the injury you speak of could not have happened when he was in charge. You say there was not only a hole in the bottom, but it was otherwise defaced and injured?\" \"Yes, sir, it looked as if it had been hacked by a hatchet.\" \"Then it is quite clear that Robert could have had nothing to do with it. It must have been done by some malicious person or persons.\" Knowing something of Halbert, Mr. Paine looked hard at him, his suspicions taking the same direction as his daughter\u0027s. But, as we know, Halbert was entirely innocent, and bore the gaze without confusion. \"I don\u0027t see why Robert hasn\u0027t been and let me know of this,\" said Mr. Paine, musing. \"He was probably afraid to tell you,\" said Halbert, with a slight sneer. \"I know him better than that. You can testify,\" added the lawyer, significantly, \"that he is not deficient in bravery.\" \"I thought I would come and tell you,\" said Halbert, coloring a little. \"I thought you would like to know.\" \"You are very kind to take so much trouble,\" said Mr. Paine, but there was neither gratitude nor cordiality in his tone. Halbert thought it was time to be going, and accordingly got up and took his leave. As he opened the office door to go out, he found himself face to face with Robert Rushton, who passed him with a slight nod, and with an air of trouble entered the presence of his friend\u0027s father.","sourceLink":"http://novel.tingroom.com/ertong/2958/81362.html","bookId":431,"book":{"id":431,"title":"Brave and Bold","description":"简介： The main schoolroom in the Millville Academy was brilliantly lighted, and the various desks were occupied by boys and girls of different ages from ten to eighteen, all busily writing under the general direction of Professor George W. Granville, Instr...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2958","creation":"Aug 1, 2019 12:18:46 AM","modification":"Aug 1, 2019 12:18:46 AM"}}
