{"id":39002,"no":1,"title":"Chapter 1","content":"Dusk, like soft blue smoke, fell with the dying spring air and settled upon the northern French village. In the uncertain light one and two story buildings set along the crooked street showed crisply, bearing a resemblance to false teeth in an ash-old face. To young Hicks, disconsolate as he leaned against the outer wall of the French canteen, upon whose smooth white surface his body made an unseemly blot, life was worth very little. For nine interminable months William Hicks had been in France, shunted from one place to another, acting out the odious office of the military police, working as a stevedore beside evil-odored blacks, helping to build cantonments and reservoirs for new soldiers ever arriving from the United States. And he was supposed to be a soldier. He had enlisted with at least the tacit understanding that he was some day to fight. At the recruiting[2] office in Cincinnati the bespangled sergeant had told him: “Join the marines and see some real action.” And the heart of William Hicks had fled to the rich brogue and campaign ribbons that the sergeant professionally wore. But was this action? Was this war? Was this for what William Hicks had come to France? Well, he told himself, it was not. Soldiering with a shovel. A hell of a way to treat a white man. There were plenty of people to dig holes in the ground, but not many of them could qualify as sharpshooters. And Hicks swelled his chest a trifle, noticing the glint of the metal marksmanship badge on his tunic. Resting beside him on the ground was a display of unopened food tins above which rose the slender necks of bottles. Of the bottles there were four, prisoning the white wine of the northern French vineyards. Excessive in number were the cans, and they looked as if their contents were edible. But Hicks was not sure. He had bought them from the wizened little French clerk who had regarded him with suspicion through the window of the canteen. For this suspicion, this slight hostility, Hicks did not blame the little Frenchman. He had, he realized, made an ass of himself by pointing to[3] ambiguously labelled cans piled on the shelves inside the canteen and saying: “la, combien?” Now he possessed a choice array of cans of whose contents he knew nothing. All that he asked was that he might be able to eat it. That morning he had marched into the town with his tired platoon from a small deserted railway station some miles distant. Once assigned to the houses in which they were to be billeted, the men had unstrapped their blankets and fallen asleep. But not Hicks. He had explored the village with an eye to disposing of the mass of soiled and torn franc-notes which he carried in his pocket. In the French canteen he had found the place for which he was looking. And so he had stood before the clerk, demanding to buy as much of the stock as he could carry. But the clerk had closed the window, leaving Hicks with a handful of French money and the tinned food and four bottles of vin blanc. Hence his disconsolation. The roll of paper felt unnatural, superfluous in his pocket. He was tempted to fling it away. In the morning the platoon would find the canteen and buy the last can, the last bottle. Restive, he ran his lean fingers through his uncombed hair, wondering vaguely whether it[4] were true that his regiment was soon to depart for the front. It must be true, he decided. There had been an untoward attitude on the part of his officers since the moment that the departure of the platoon had been made known. Their destination had been scrupulously kept from them. In corroboration, a long-range gun boomed sullenly in the distance. The noise produced in him a not unpleasant shiver of apprehension. He met it, summoning a quiet smile of scorn. Yes, he would be glad to go to the front, to that vague place from which men returned with their mutilated bodies. Not that he was vengeful. His feeling for the German army was desultory, a blend of kaleidoscopic emotions in which hate never entered. But in conflict, he felt, would arise a reason for his now unbearable existence. The grinning weakness which men called authority had followed him since the day of his enlistment at the beginning of the war. It had turned thoughts of valor into horrible nightmares, the splendor of achievement into debased bickering. Most of the men, it seemed to him, had not entered the army to further the accomplishment of a common motive; they had[5] enlisted or had been made officers and gentlemen—Congress had generously made itself the cultural father of officers—for the purpose of aiding their personal ambitions. It had darkened. Hicks gathered up his sorry feast and sauntered off through the shaking, mysterious shadows to his pallet of straw. Stretched out upon individual beds of straw which had been strewn over the stone floor, the members of the platoon were lying before a huge fireplace that drew badly in the early spring wind. In all of their nine months in France this was the first time that they had thus lain, not knowing what was to come on the following day, nor caring, being only satisfied by the warmth which came from the fireplace, by their sense of feeling intact and comfortable. In this sense of reconciliation John Pugh, the Mississippi gambler, forgot his everlasting dice-throwing, which every pay-day that the platoon had thus far known had won for him more money than his company commander received from the United States Government. He sighed, elongating his limbs beneath his blanket. He made an effort to rise, and succeeded[6] in resting the weight of his torso on his arm which he had crooked under him. Cautiously he felt for a cigarette beneath his tunic, which he was using for a pillow. He got the cigarette and a match, then held them in his hand, hesitant. His eyes, large and dolorous, searched the dimly lighted room, scanning the recumbent figures to discover whether they were asleep. Men were lying, their shoes beside their heads, their army packs, rifles, leaning against the wall and the remainder of their equipment scattered near by. They were silent, motionless. “I guess I can risk it,” thought Pugh, and he carefully struck the match and lighted his cigarette. As the match was rubbed over the floor heads appeared; the stillness was broken. “Oh, Jack, thought you didn’t have any more cigarettes.” “You got fifty francs offa me last month. I think you ought to give me a smoke!” The voice was reproachful. Effectually and instantly Pugh checked the avalanche of reproach: “Hey, you fellas, there’s beaucoup mail up at regimental headquahtas.” [7] The clumsy shadows in the darkened room answered: “Aw bunk.” “Cut out that crap.” “How do you get that way, Jack? You know there ain’t no mail up at regimental.” “Well,” Pugh sighed, “if you all don’ wanna heah f’m your mammy I don’ give a damn.... Oh-o. What you all got, Hicks?” Hicks had arrived at his billet, his arms filled with the bottles of wine and the cans of the questionable contents. Candles were lighted and set on the helmets of the men. Bodies rose to a sitting posture, eyes on Hicks. “Gimme a drink, Hicksy!” “Hooray, look what Hicks’s got.” “Yeh, gimme a drink.” The voices were clamorous. “Gimme, gimme? Was your mouth bored out with a gimlet,” Hicks jeered. “Why didn’t you buy some?” They formed a semicircle around the fireplace in front of which Hicks sat with his plunder. Over the bottles they grew noisily talkative. “Say, have you fellows seen any of these[8] new guys here?” asked Hicks. “I was walkin’ down one of the streets by the Frog canteen and one of ’em asked me if I was in the balloon corps. I told him yes, and asked him how he guessed it, and he said, ‘Oh, I saw that balloon on your cap.’” “They sure are a bunch of funny birds. I ast one of ’em how long he’d been over on this side and he said: ‘About three weeks—seen anybody that’s come over lately?’” A contingent of soldiers which had arrived in the village that afternoon were, therefore, objects of scorn and hostility. “Aw, they’re some of them fellahs that the wind blew in. Pretty soon they’ll have the home guards over here.” “They will like hell! If you could git them home guards away from home you’d sure have to hump. They’re home guards—they guard our women while we’re over here.” The speaker seemed afraid that his listeners would not understand that he was stressing the word home. “Yeh, they’s one of ’em guardin’ my gal too close. I got a lettah....” “You’re lucky to get any kind of a letter. Here I been for three months and not a word.[9] I don’t know whether they all died or what,” Hicks ended gloomily. “Aw cheer up, Hicksy, old boy. Maybe your mail was on that transport that got sunk.” A head was thrust in the door. It was the first sergeant. “Pipe down, you damned recruits. Lights are supposed to be out at eight o’clock. If you guys want to git work detail for the rest of your lives——” “All right, you dirty German spy. Git the hell out of here and let us sleep.” All of the candles had been put out as soon as the voice of the first sergeant was heard. The men had flung themselves on their beds. Now each one pretended to be asleep. “Who said that?” The first sergeant was furious. “I’ll work you birds till your shoes fall off.” The room answered with loud and affected snores. The first sergeant, in all of his fierceness, disappeared.","sourceLink":"http://novel.tingroom.com/duanpian/2861/79062.html","bookId":1191,"book":{"id":1191,"title":"Through the Wheat","description":"简介： Dusk, like soft blue smoke, fell with the dying spring air and settled upon the northern French village. In the uncertain light one and two story buildings set along the crooked street showed crisply, bearing a resemblance to false teeth in an ash-ol...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2861","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
