{"id":12845,"no":27,"title":"CHAPTER XXVII A NIGHT JOURNEY","content":"‘Let me but bear your love, I’ll bear your cares.’ At the cross-roads on the northern side of the river the two carriages parted company, the dusty equipage of General Vincente taking the road to Aranjuez that leads to the right and mounts steadily through olive groves. The other carriage—which, despite its plain and sombre colours, still had an air of grandeur and almost of royalty, with its great wheels and curved springs—turned to the left and headed for Toledo. Behind it clattered a dozen troopers, picked men, with huge swinging swords and travel-stained clothes. The dust rose in a cloud under the horses’ feet and hovered in the sullen air. There was no breath of wind, and the sun shone through a faint haze which seemed only to add to the heat. Concha lowered the window and thrust forward his long inquiring nose. ‘What is it?’ asked the General. ‘Thunder—I smell it. We shall have a storm to-night.’ He looked out mopping his brow. ‘Name of a saint! how thick the air is.’ ‘It will be clear before the morning,’ said Vincente the optimist. And the carriage rattled on towards the city of strife, where Jew, Goth and Roman, Moor and Inquisitor, have all had their day. Estella was silent, drooping with fatigue. The General alone seemed unmoved and heedless of the heat—a man of steel, as bright and ready as his own sword. There is no civilised country in the world so bare as Spain, and no part of the Peninsula so sparsely populated as the Castiles. The road ran for the most part over brown and barren uplands, with here and there a valley where wheat and olives and vineyards graced the lower slopes. The crying need of all nature was for shade; for the ilex is a small-leaved tree giving a thin shadow with no cool depths amid the branches. All was brown and barren and parched. The earth seemed to lie fainting and awaiting the rain. The horses trotted with extended necks and open mouths, their coats wet with sweat. The driver—an Andalusian, with a face like a Moorish pirate—kept encouraging them with word and rein, jerking and whipping only when they seemed likely to fall from sheer fatigue and sun-weariness. At last the sun began to set in a glow like that of a great furnace, and the reflection lay over the land in ruddy splendour. ‘Ah!’ said Concha, looking out, ‘it will be a great storm—and it will soon come.’ Vast columns of cloud were climbing up from the sunset into a sullen sky, thrown up in spreading mares’ tails by a hundred contrary gusts of wind, as if there were explosive matter in the great furnace of the west. ‘Nature is always on my side,’ said Vincente, with his chuckling laugh. He sat, watch in hand, noting the passage of the kilometres. At last the sun went down behind a distant line of hill—the watershed of the Tagus—and immediately the air was cool. Without stopping, the driver wrapped his cloak round him, and the troopers followed his example. A few minutes later a cold breeze sprung up suddenly, coming from the north and swirling the dust high in the air. ‘It is well,’ said Vincente, who assuredly saw good in everything; ‘the wind comes first, and therefore the storm will be short.’ As he spoke the thunder rolled among the hills. ‘It is almost like guns,’ he added, with a queer look in his eyes suggestive of some memory. Then, preceded by a rushing wind, the rain came, turning to hail, and stopping suddenly in a breathless pause, only to recommence with a renewed and splashing vigour. Concha drew up the windows, and the water streamed down them in a continuous ripple. Estella, who had been sleeping, roused herself. She looked fresh, and her eyes were bright with excitement. She had brought home with her from her English school that air of freshness and a dainty vigour which makes Englishwomen different from all other women in the world, and an English schoolgirl one of the brightest, purest, and sweetest of God’s creatures. Concha looked at her with his grim smile—amused at a youthfulness which could enable her to fall asleep at such a time and wake up so manifestly refreshed. A halt was made at a roadside venta, where the travellers partook of a hurried meal. Darkness came on before the horses were sufficiently rested, and by the light of an ill-smelling lamp the General had his inevitable cup of coffee. The rain had now ceased, but the sky remained overcast and the night was a dark one. The travellers took their places in the carriage, and again the monotony of the road, the steady trot of the horses, the sing-song words of encouragement of their driver, monopolised the thoughts of sleepy minds. It seemed to Estella that life was all journeys, and that she had been on the road for years. The swing of the carriage, the little varieties of the road, but served to add to her somnolence. She only half woke up when, about ten o’clock, a halt was made to change horses, and the General quitted the carriage for a few minutes to talk earnestly with two horsemen, who were apparently awaiting their arrival. No time was lost here, and the carriage went forward with an increased escort. The two new-comers rode by the carriage, one on either side. When Estella woke up, the moon had risen and the carriage was making slow progress up a long hill. She noticed that a horseman was on either side, close by the carriage window. ‘Who is that?’ she asked. ‘Conyngham,’ replied the General. ‘You sent for him?’ inquired Estella, in a hard voice. ‘Yes.’ Estella was wakeful enough now, and sat upright, looking straight in front of her. At times she glanced towards the window, which was now open, where the head of Conyngham’s charger appeared. The horse trotted steadily, with a queer jerk of the head and that willingness to do his best which gains for horses a place in the hearts of all who have to do with them. ‘Will there be fighting?’ asked Estella suddenly. The General shrugged his shoulders. ‘One cannot call it fighting. There may be a disturbance in the streets,’ he answered. Concha, quiet in his corner, with his back to the horses, watched the girl, and saw that her eyes were wide with anxiety now—quite suddenly. She, who had never thought of fear till this moment. She moved uneasily in her seat, fidgeting as the young ever do when troubled. It is only with years that we learn to bear a burden quietly. ‘Who is that?’ she asked shortly, pointing to the other window, which was closed. ‘Concep?ion Vara—Conyngham’s servant,’ replied the General, who for some reason was inclined to curtness in his speech. They were approaching Toledo, and passed through a village from time to time, where the cafés were still lighted up, and people seemed to be astir in the shadow of the houses. At last, in the main thoroughfare of a larger village within a stage of Toledo, a final halt was made to change horses. The street, dimly lighted by a couple of oil lamps swinging from gibbets at the corners of a crossroad, seemed to be peopled by shadows surreptitiously lurking in doorways. There was a false air of quiet in the houses, and peeping eyes looked out from behind the bars that covered every window, for even modern Spanish houses are barred as if for a siege, and in the ancient villages every man’s house is indeed his castle. The driver had left the box, and seemed to be having some trouble with the ostlers and stable-helps; for his voice could be heard raised in anger and urging them to greater haste. Conyngham, motionless in the saddle, touched his horse with his heel, advancing a few paces so as to screen the window. Concep?ion, on the other side, did the same, so that the travellers in the interior of the vehicle saw but the dark shape of the horses and the long cloaks of their riders. They could perceive Conyngham quickly throw back his cape in order to have a free hand. Then there came the sound of scuffling feet and an indefinable sense of strife in the very air. ‘But we will see—we will see who is in the carriage!’ cried a shrill voice, and a hoarse shout from many bibulous throats confirmed the desire. ‘Quick!’ said Conyngham’s voice. ‘Quick—take your reins—never mind the lamps.’ And the carriage swayed as the man leapt to his place. Estella made a movement to look out of the window, but Concha had stood up against it, opposing his broad back alike to curious glances or a knife or a bullet. At the other window the General, better versed in such matters, held the leather cushion upon which he had been sitting across the sash. With his left hand he restrained Estella. ‘Keep still,’ he said. ‘Sit back. Conyngham can take care of himself.’ The carriage swayed forward, and a volley of stones rattled on it like hail. It rose jerkily on one side, and bumped over some obstacle. ‘One who has his quietus,’ said Concha; ‘these royal carriages are heavy.’ The horses were galloping now. Concha sat down rubbing his back. Conyngham was galloping by the window, and they could see his spur flashing in the moonlight as he used it. The reins hung loose, and both his hands were employed elsewhere, for he had a man half across the saddle in front of him, who held to him with one arm thrown round his neck, while the other was raised and a gleam of steel was at the end of it. Concep?ion, from the other side, threw a knife over the roof of the carriage—he could hit a cork at twenty paces but he missed this time. The General, from within, leant across Estella, sword in hand, with gleaming eyes. But Conyngham seemed to have got the hold he desired, for his assailant came suddenly swinging over the horse’s neck, and one of his flying heels crashed through the window by Concha’s head, making that ecclesiastic swear like any layman. The carriage was lifted on one side again, and bumped heavily. ‘Another,’ said Concha, looking for broken glass in the folds of his cassock. ‘That is a pretty trick of Conyngham’s.’ ‘And the man is a horseman,’ added the General, sheathing his sword—‘a horseman. It warms the heart to see it.’ Then he leant out of the window and asked if any were hurt. ‘I am afraid, Excellency, that I hurt one,’ answered Vara. ‘Where the neck joins the shoulder. It is a pretty spot for the knife—nothing to turn a point.’ He rubbed a sulphur match on the leg of his trouser, and lighted a cigarette as he rode along. ‘On our side no accidents,’ continued Vara, with a careless grandeur, ‘unless the reverendo received a kick in the face.’ ‘The reverendo received a stone in the small of the back,’ growled Concha pessimistically, ‘where there was already a corner of lumbago.’ Conyngham, standing in his stirrups, was looking back. A man lay motionless on the road, and beyond, at the cross-roads, another was riding up a hill to the right at a hand gallop. ‘It is the road to Madrid,’ said Concep?ion, noting the direction of the Englishman’s glance. The General, leaning out of the carriage window, was also looking back anxiously. ‘They have sent a messenger to Madrid, Excellency, with the news that the Queen is on the road to Toledo,’ said Concep?ion. ‘It is well,’ answered Vincente, with a laugh. As they journeyed, although it was nearly midnight, there appeared from time to time, and for the most part in the neighbourhood of a village, one who seemed to have been awaiting their passage, and immediately set out on foot or horseback by one of the shorter bridle-paths that abound in Spain. No one of these spies escaped the notice of Concep?ion, whose training amid the mountains of Andalusia had sharpened his eyesight and added keenness to every sense. ‘It is like a cat walking down an alley full of dogs,’ he muttered. At last the lights of Toledo hove in sight, and across the river came the sound of the city clocks tolling the hour. ‘Midnight,’ said Concha. ‘And all respectable folk are in their beds. At night all cats are grey.’ No one heeded him. Estella was sitting upright, bright-eyed and wakeful. The General looked out of the window at every moment. Across the river they could see lights moving, and many houses that had been illuminated were suddenly dark. ‘See,’ said the General, leaning out of the window and speaking to Conyngham, ‘they have heard the sound of our wheels.’ At the farther end of the Bridge of Alcantara, on the road which now leads to the railway station, two horsemen were stationed, hidden in the shadow of the trees that border the pathway. ‘Those should be Guardias Civiles,’ said Concep?ion, who had studied the ways of those gentry all his life. ‘But they are not. They have horses that have never been taught to stand still.’ As he spoke the men vanished, moving noiselessly in the thick dust which lay on the Madrid road. The General saw them go—and smiled. These men carried word to their fellows in Madrid for the seizure of the little Queen. But before they could reach the capital the Queen Regent herself would be there—a woman in a thousand, of inflexible nerve, of infinite resource. The carriage rattled over the narrow bridge which rings hollow to the sound of wheels. It passed under the gate that Wamba built and up the tree-girt incline to the city. The streets were deserted, and no window showed a light. A watchman in his shelter, at the corner by the synagogue, peered at them over the folds of his cloak, and noting the clank of scabbard against spur, paid no further heed to a traveller who took the road with such outward signs of authority. ‘It is still enough—and quiet,’ said Concha, looking out. ‘As quiet as a watching cat,’ replied Vincente.","sourceLink":"http://novel.tingroom.com/duanpian/2872/79475.html","bookId":1166,"book":{"id":1166,"title":"In Kedar\u0027s Tents","description":"简介： It is in the staging of her comedies that fate shows herself superior to mere human invention. While we, with careful regard to scenery, place our conventional puppets on the stage and bid them play their old old parts in a manner as ancient, she rin...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2872","creation":"Aug 1, 2019 12:24:30 AM","modification":"Aug 1, 2019 12:24:30 AM"}}
