{"id":22563,"no":21,"title":"XX DOWN THROUGH CALIFORNIA","content":"The vaquero, or cowboy, had spoken truly. Beyond the hill was disclosed to view a large trading post—larger than either Bent’s Fort or Fort Laramie; built of adobe, like them, and like them fashioned with blockhouse corners, it had location more attractive, for it stood amidst wheat-fields and natural verdure, beside the sparkling American River. “El Capitan Sutter comes, se?ors,” announced the vaquero, pointing. A man had galloped from the post and its fringe of out-buildings, and was rapidly approaching the squad. A short, stout, German-featured man he was, when he arrived: with rosy complexion, blue eyes, crisp moustache, high forehead, bald pate, and a soldiery way about him. “Welcome, gentlemen,” he said, saluting. “Welcome to New Helvetia. I am Captain Sutter.” “I am Lieutenant John C. Frémont, of the United States Army, on a government survey of Oregon and the Great Basin,” explained the lieutenant, shaking hands. “We’ve been forced across the mountains. I’ve left most of the company behind, while with a[249] squad I rode in advance, for supplies. Can we get them?” “Most assuredly. All you want,” answered Captain Sutter, promptly. “Come with me.” It was late to start back, to-day, with rescue for the Fitzpatrick party; but much refreshed by the abundant food and the night’s lodging at the hospitable post of New Helvetia they took the back trail, early in the morning, with horses and provisions. On the second day out, just before reaching the Forks of the American, they sighted the Fitzpatrick party straggling along—and a sorry party that was. All the men were afoot, tottering as they led tottering horse or mule. Oliver thought that he never had seen such skeletons living; and then it occurred to him that no doubt his own party were just about as bad, and that he was accustomed to them. The Fitzpatrick party were too weak to cheer; they almost were too weak to eat; but the gaunt wan faces essayed a smile, and one or two hands were languidly waved. Camp was at once made, and the good rich beef and bread and salmon from Sutter’s Fort were distributed—cautiously, that the greedy Fitzpatrick men should not over-eat. Thomas Fitzpatrick, his ruddy face drawn and gray with exhaustion, his white hair ragged, related that because of the melting snows and the rains a number of the pack animals had fallen from slippery precipices and had been killed, their packs lost. All[250] told, out of the 104 horses and mules with which the expedition had left the Dalles of the Columbia only thirty-three arrived in the Valley of the Sacramento; thus reckoned up Lieutenant Frémont, when, on the next day, camp of the whole company was established where the American emptied into the Sacramento, two miles below New Helvetia. This New Switzerland, or New Helvetia, as Captain Sutter had named his settlement, and which was known also as Sutter’s Fort, was a most interesting place. The post walls were eighteen feet high, enclosing a rectangle 150 by 500 feet; they mounted twelve cannon and were garrisoned by forty Indians whom Captain Sutter (who had been a soldier in France) had uniformed and drilled. Lieutenant Frémont did not think much of the condition of the cannon, nor very highly of the smartness of the Indian soldiery; but all in all, the fort was rather imposing, here in the depth of California. The jovial captain lived like a Highland chief. Kit Carson called him a king. Nobody interfered with him; he had been pronounced a Mexican citizen, by the governor of Alta California—but, anyway, citizen or not, he was too strong to be driven out. Besides the forty California Indians he employed thirty white men—mechanics, trappers, farmers, etc.; and all the American trappers and settlers in this part of California were free to make his settlement headquarters. His land extended over thirty-three square miles; it[251] was being grazed and farmed; he possessed 4200 cattle, 2000 horses, 1900 sheep, and sent out many beaver-skins and much wheat. His house, inside the fort, was furnished with regular chairs and beds and tables, of heavy, clumsy manufacture, having been hand-made, from laurel, at the former Russian trading post of Ross, on the sea-shore westward. He sent vessels down the Sacramento and up to Vancouver. He operated a flour-mill and was teaching the Indians to weave hats and blankets and to farm. Yes, powerful and rich and independent was Captain Johann Augustus Sutter, of New Helvetia, above the mouth of the Rio de los Americanos, Upper California. ’Twas at his saw-mill, fifty miles above his fort, that was discovered, in the winter of 1848–49, gold; and speedily his New Helvetia became Sacramento City. The two weeks’ camp of the Frémont and Carson company, at the mouth of the American, was by no means an idle camp, devoted to sight-seeing or sitting in the Captain Sutter laurel chairs. Horses and mules and cattle were to be inspected and bought; new pack-saddles to be put together; bridles repaired, saddles repaired, ropes repaired or purchased, clothing repaired or purchased; Samuel Neal the blacksmith worked constantly at the post forge, shaping horse-shoes, bridle-bits, nails, etc.; and the Sutter flour-mill, grinding by horse-power, was in motion night and day producing flour. [252] A short council at which Captain Sutter was present determined upon the route home. “It would be folly to recross the Sierras, here,” stated the lieutenant. “I suppose the snow lies on them away into the summer.” “Yes, sir,” assured the captain. “I was thinking, then,” continued the lieutenant, “of travelling south, down the Valley of the Sacramento and up the Valley of the San Joachin, that Kit has talked so much about, for the Joe Walker Pass at the lower end of the ranges. And then to strike the Spanish Trail that runs from the Pueblo of Los Angeles to Santa Fé.” “Very good,” approved the captain. “It’s a fine, well-watered country, with plenty of game, all the way to the southern passes.” “We’re not liable to be interfered with, by the authorities, are we?” queried the lieutenant. “This is Mexican territory, and we came in without leave.” “Not so far back from the coast,” answered Captain Sutter. “But you’ll have to watch sharp, or the Indians, particularly the mansitos, or tamed Indians, as we call the Indians educated by the missions, who have returned to wild life, will steal your animals. They are very bold and clever. They even come down and try to steal our horses at New Helvetia.” “We’ll watch,” promised the lieutenant. “No white settlements, captain?” asked Kit. “None inland, any more than when you travelled[253] through fifteen years ago, sir,” said Captain Sutter. “The whole country back from the line of missions, and the few settlements, along the coast, is a paradise unused except as the haunt of the Indians. It is a fair land going to waste. Some Anglo-Saxon race should have it, and cultivate it. That race will be either England or America; mark my words.” “Let us hope, America,” responded the lieutenant. So fair was this sunny California that Samuel Neal the blacksmith and four others in the company asked to be discharged, that they might remain. The lieutenant let them go; and Samuel entered the employ of the post, at two dollars and a half a day, with promise of advance. “Anybody seen Derosier?” demanded Mr. Preuss, through the camp, on the day before departure. Already had the camp been moved, in preliminary start, up stream a short distance, to the ranch of Mr. Sinclair, former mountain-man, now a farmer. Nobody had. “He’s been gone for three days. Does anybody know anything about him?” Nobody did. And Baptiste Derosier, who had been acting oddly ever since that day, back on the trail, when he had been lost, never was seen again, nor even heard of. It was thought that he must have been drowned, or else had been waylaid by Indians, among the hills. All the[254] company were sorry, for Baptiste was a willing worker and a “bon camarade.” “Leve! Leve!” at dawn of March 24 resounded through the camp the regulation trapper call to arise. To-day was the start to be made in earnest. With more horses and mules than ever, to the number of 130; with twenty-five beef cattle and five milk cows; with plenty of flour and coffee and sugar; well-stocked the expedition might proceed upon their way. With them went an Indian boy, assigned by Captain Sutter to be herder of the cavvy, for the horses and cattle were almost as wild as buffalo. It would take an experienced Californian to drive them. Captain Sutter himself, and several other whites from the fort escorted the company a few miles, to say good-by and “good luck.” Eleven hundred and forty-two miles from the Dalles of the Columbia or 3000 miles from Fort St. Vrain had stretched the Frémont and Carson trail to New Helvetia. Now from New Helvetia to Bent’s Fort would be 3000 miles more. However, nobody shrank from the trail as planned. All were strong again in body as they had been strong in heart, and their ample pack-train gave them comfort. Nevertheless, for the first 2500 miles of their journey they could expect to find no settlement of any kind save Indian village. The lieutenant rode a splendid iron-gray Californian horse, named Sacramento, a gift from Captain[255] Sutter. The march was down the east side of the Valley of the Sacramento, back somewhat from the river; thence on into the Valley of the San Joachin, which was companion valley reaching up from the south, to meet the Valley of the Sacramento extending down from the north. The country was all that it had been pictured by Kit Carson, and promised by the lieutenant: a country of brilliant flowers, blue and yellow and white and purple, in great masses; of abundant verdure and water; of great herds of elk, deer, wild horses and cattle. And as Captain Sutter had declared, it was a country unused. As they rode, the lieutenant and Kit waxed more and more enthusiastic, and Oliver heard them say that here was where they hoped some day to live. Mindful of the cautions as to the horse-stealing Indians, the march was made strictly military. Scouts were placed ahead, and on the flanks, to beat the brush; rifle-men formed van, and rear, and between van and rear were the cavvy, pack-animals and cattle. However, no Indians were sighted until, on April 8, 280 miles from New Helvetia, at the banks of the Tulare River natives appeared. As soon as these ascertained that the Frémont and Carson men were not California soldiery, they gathered in friendly fashion, and brought otter-skins, and fish, and bread and acorn-flour. They were dark-skinned, handsome Indians. Several spoke Spanish, learned at the missions. They were well-mannered—but the lieutenant[256] and Kit thought best, on the whole, to corral the animals, at night. It was time that the pass should be near, on the left; the pass through the mountain range, to the desert. A fine broad trail pointed off to the southeast; and upon being questioned as to a pass in that direction one of the Indians nodded, with a smile showing white teeth, and with a “Si, se?or; buen camino (Yes, sir; good road).” Following this trail, on for the desert rode the Frémont and Carson company. The landscape was growing sandy and more bare. Diverging to the left, to ascend along a creek, the company entered, not Walker Pass, but that Tehachepi Pass through which to-day penetrates from desert California into valley California the Santa Fé Railroad, overland line. While encamped at the western side of the Tehachepi Pass the camp received another visitor. Down the pleasantly wooded slope he came riding, with many a jingle and much graceful sway of body—a combination of knight-errant and cowboy; and a romantic sight he made. He wore a large, peaked hat; short braided jacket reaching scarcely to his waist; black velvet trousers tight at the hips, flaring at the bottoms, and slashed along the seams with white; a sash of crimson; yellow goat-skin boots armed with the huge Spanish spurs. Bridle and saddle were lavishly decorated; chains dangled from the one, brass tacks glistened[257] in the other. But he was no Spaniard or Mexican; he was an Indian. “Buenas noches, se?ors,” he greeted, cordially, in excellent Spanish. “Good evening. I saw you enter the pass, and I have come down to bid you have no fear.” “To whom do we speak?” asked the lieutenant. “To a Christian Indian, se?or. I am from the mission San Fernando, near to the Pueblo de Nuestra Se?ora la Reina de los Angeles (the Town of Our Lady the Queen of the Angels),” he explained. “I have been, by permission of the fathers, to visit my relatives in the Sierras, beyond here. Looking back, I saw you.” “We are much obliged, se?or,” answered the lieutenant, gravely. “Alight and sit. You are acquainted with the country?” “Perfectly.” “We are on our way east, to the American States. What lies across this range?” “An arid, burning desert, se?or; impossible for man or beast.” “I remember it,” quoth Kit Carson, nodding. “I war across it with Ewing Young.” “Lower down, se?or,” corrected the Indian, politely. “By the Spanish Trail.” “That war ’fore the Spanish Trail had been broken through; but it mout have been lower down, o’ course.” [258] “Then we cannot cross directly eastward?” queried the lieutenant. “No, se?or. Even the Indians cannot. It is the Mohave Desert. But if you desire to travel east, after crossing this pass you should follow south along the foot of the mountains, where is water and grass, to the Spanish Trail to Santa Fé. By this route have just returned six Indians of a great river of the desert, who have been here trading with my people. For two days on my way to San Fernando I am travelling the same road, myself, and I will gladly be your guide.” They thanked him, and accepted his offer. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3255/89217.html","bookId":599,"book":{"id":599,"title":"With Carson and Frémont","description":"简介： The trail journals of the first two government exploring expeditions commanded by Lieutenant John Charles Frmont, of the United States Engineers, and advised by Kit Carson, mountain-man, are to be found together published, spring of 1845, as reports...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3255","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
