{"id":22564,"no":22,"title":"XXI THE VENGEANCE OF KIT CARSON","content":"The Christian Indian of the San Fernando mission rejoined the march, the next morning; amidst gooseberries, humming-birds, and yellow flowers, looked down upon by snow-caps, the pass was threaded; and a very different crossing of the Sierra Range was this, from that experienced but a few weeks back! Unexpectedly to all the company, as the trail wound down among the foot-hills on the eastern side of the range the desert unfolded to view. There it lay, waiting, like a flat, prone dragon. There it lay, as the guide had asserted: arid, burning, white-hot, with occasional blackish ridges breaking its surface like scales, and with its fevered breath, like a mist, quivering above. “The great llanos—plains,” announced the guide, dramatically waving his hand. “They have no water, they have no grass; every animal that goes upon them dies.” “The Mohave Desert, I reckon it air,” said Kit Carson, meditatively surveying. “I crossed it twice, on that Californy trip, but the trail we made war lower down.” [260] “By the Mohave River, se?or, perhaps,” suggested the guide. “Guess so.” “That is lower to the south. The Spanish Trail which your company will take follows along it.” On April 17, three weeks from New Helvetia, among the ridges by which the mountains tapered to the desert was encountered a little trail cutting east and west across the southward march. Scarcely could it be traced, so faint and rarely trodden was it; but the guide at once turned east, upon it. “It is the trail between the Spanish Trail, east, and the mission San Buenaventura, next to Santa Barbara, on the coast,” he said. He rode a few miles, and halted. “Adios,” he spoke. And indicating the thread-like trail: “This is the road. It does not lose itself; it continues on. Follow it, and you will reach the Spanish Trail ahead of the great spring caravan out of the Pueblo de los Angeles for Santa Fé of New Mexico; so you will find the grass uneaten. By that black hill yonder is water. Now I must turn off for San Fernando.” The lieutenant and Kit and Mr. Preuss and Mr. Talbot and others in the van shook hands with him, thanking him again; and the lieutenant further rewarded him with presents of knives and bright cloth. Amidst mutual “Adios (a Dios—God with you),” he left, galloping away for the mission San Fernando[261] Rey de Espa?a (Saint Ferdinand King of Spain), north of the Pueblo de los Angeles which is to-day the City Los Angeles. Through draws blazing with flowers purple, lemon and orange, and richly perfumed, the Frémont and Carson company followed the little trail eastward until at the dark ridge out upon a sandy plain they camped with water but no grass. For two days and a half the little trail led eastward. Then, on the afternoon of the third day, April 20, the advance scouts shouted and waved and waited. When Oliver, with the van, arrived at the spot, he also joined in the shout, although not wholly knowing why—save that here the little trail united with a broad, well-defined trail, north and south. “The Spanish Trail from Californy to Santy Fee, captain,” announced Kit Carson. “It must be,” agreed the lieutenant. “And it takes us north, boys! Now we can cross the mountains by way of the Great Salt Lake and the Utah Lake, to strike the head of the Arkansas. We’re not to be cheated out of the fine country.” “Hooray!” they cheered. “It’s good-by to Californy,” remarked Kit, to the lieutenant, as now the cavalcade turned into this broad trail. “We’ll come again, Kit,” asserted Lieutenant Frémont. And they did; to win the fair land for the United[262] States, and the lieutenant to make here his home, as he had hoped. So this was the famous Old Spanish Trail, was it; this bare road of rocky sand scarred by many hoofs, stretching on indefinitely athwart the rolling, sparsely verdured plains? “You might think it’s called the Spanish Trail ’cause the names on it air all Spanish,” narrated Kit Carson, as with Oliver he ambled in the dust. “But like as not it’s called so ’cause the old Spanish Fathers started it, at t’other end, in their missionary trips out o’ Santy Fee. They never cut it through, though. An American did that. I knew his family in Missouri. He war a trader, ’twixt Missouri an’ New Mexico. His name war William Wolfskill; an’ in fall o’ Eighteen-thirty he tuk a trading caravan out o’ Santy Fee for Los Angeles, an’ he made this trail to try north o’ the Heely (Gila) River trail. He thought he’d find better grass. It’s regular caravan trail, for hosses an’ mules to Santy Fee, an’ calico an’ blankets an’ stuff back ag’in.” “Seems to me that some of these tracks in the trail are fresh,” commented the lieutenant, riding up. “So I war thinking,” replied Kit. “Fresh hoof-tracks, an’ some fresh Injun tracks. Thar must be a caravan party on ahead o’ the main travel; an’ those Injun tracks likely air the six fellows spoken of by that mansito. But in sech a wind, blowing the sand, sign air hard to read.” An unpleasant gale was raging—a furious, constant[263] blast as the cooler air of the mountains on the west rushed down to fill the vacuum caused by the rising hot air of the desert on the east. The Spanish Trail continued, well marked, but with its sharp rocks speedily setting the animals to limping. It was a trail rougher than any part of the Oregon Trail. Oliver heard the lieutenant regretting that the cavvy had not been shod. The trail had been skirting a river, curious but refreshing as it flowed briskly and sparkling between low banks of the whitish sand. A few cottonwoods and willows grew along it. Oliver observed that although they were descending it, it was getting smaller instead of larger—an odd circumstance. “It’s the Mohave, I reckon,” stated Kit. “At least, when I came out with Ewing Young we followed up a river ’bout like this, hyar, on our way from the Colorado to the Californy missions. You watch it, an’ you’ll see something.” The next morning the lieutenant, during the ride, spoke suddenly: “There goes our river!” All near him looked. Kit Carson chuckled quietly. “Yes; it’s flopped for a spell. Now it’ll flow bottom-side-up till it’s ready to turn over ag’in: the bed’s on top an’ the water’s under. It’s the Mohave, sure—tho’ I’ve seen other rivers like it.” “Remarkable!” ejaculated Mr. Preuss, much interested. “It burrows like a gopher of the plains.” “Brave stream! I teenk she gets weak by the sun[264] an’ goes under to get strong, encore,” proffered Alexander Godey, gayly. “What it does is to follow the bed-rock,” explained the lieutenant. “The water sinks to the rock. Where the rock stratum lies deep, the water disappears in the sand; where the rock stratum approaches the surface, the water is brought above the sand again.” For about sixteen miles the course of the stream was dust-dry; then, suddenly, out had popped the water, in a series of welcome pools. By the tokens of bones and rags this evidently was a customary camping-ground, between marches. When Oliver, who had been busy helping herd the cavvy, returned to the fires, he beheld there six strange Indians—the six who had been spoken of by the mansito guide, and who had been in advance of the company. Five were Mohaves, and one was a California Indian who lived with them. All were naked; the Mohaves, of coppery bronze skin, straight legs, tall erect stature, were the handsomest Indians whom Oliver ever had seen. The party were equipped with unusually long bows, and each man carried a gourd, slung in a cord mesh, for water. The Californian spoke some Spanish, learned at the missions. He said that they came from a large village of the Mohaves at the crossing of the River Colorado, below the large canyons, in the desert three days’ travel eastward. “I remember the village,” confirmed Kit. “Captain Young crossed thar, when we came out in Twenty-nine.[265] Injuns war peaceable: we bought a fat mare to eat, an’ some squash, for we war nigh starved. But same Injuns had attacked another party, at the crossing, year before, so we war watching sharp.” From the camp where the Indians joined, the Frémont and Carson company followed a little further down the erratic Mohave River, eastward, although the main trail veered more northward, for the ridges. The six Indians were afoot. They claimed that when they brought back horses the northern desert Indians stole them. They also claimed to be poor and hungry; and when, upon the next day’s march, three cattle, miserably worn, must be killed, after the camp had satisfied itself the six fell to until they had left only the bones. The Indians’ banquet began in the afternoon and continued all the night. While Oliver and Jacob the colored youth (to whom the Mohaves were as interesting as he was curious to them) were watching them as by daylight they hacked and tore at the carcasses, from the camp welled a significant murmur. “Somebody coming—riding from the no’th,” announced Jacob. “Looks laike they’re in a monstrous hurry. What foh, I wonder. Huh! Two men.” “Man and boy; Mexicans,” proclaimed Oliver, keener of sight. Yes, by token of their serapes, or blanket-scarfs enveloping their shoulders, and their bell-brimmed, high conical hats, Mexicans they were; and man and boy[266] they were; riding desperately, upon foaming, sweating horses, across the trackless sand and rocks, for the camp. As soon as they arrived they were surrounded by an excited audience, and reeling in their saddles were telling their story. The man, with many rapid gestures, and staccato exclamations from the boy as well as from himself, was the chief speaker. “We are Mexicans, se?ors,” he panted. “Two out of a party of six in advance of the main caravan from the Pueblo de los Angeles for Santa Fé. Thirty horses we had, and we thought by setting out ahead we should get the better grass. Ay de mi! And what happened! The other four were my dear wife, the mother and father of this boy, and a friend Santiago Giacome, who was our guide. We found good grass, and at the camping-place of the Archilette, about eighty miles beyond here, on the main trail, se?ors, we at last made halt to wait for the caravan to overtake us. We had gone into the desert far enough, being few in numbers. But after we had been at the Archilette, unmolested, for more than a day, se?ors, several Indians ventured to visit us, from where they had been watching us. They left us, with good words, but in a few days afterward came back with an immense crowd, an army of them, se?ors; and before we could prepare defence they charged, shooting and yelling. We were only six, and two of us women, with thirty horses. Pablo (and he indicated the boy) and I were on horse-guard; part of the barbarians surrounded the herd, but[267] Giacome shouted to us to take it and flee—we must save the horses while he and this boy’s father fought to protect the women. So we did, the boy and I: we drove the animals right through the savages, and at full speed, with halts only to change saddles from one mount to another, we traversed back down the trail, until this morning we reached the camping spot of Agua de Tomaso, about twenty miles from here. Now having left the herd there, lest the savages should overtake us as well as it, we were hastening on to meet the caravan and inform it, when we sighted your camp, se?ors. Ay de mi! Alas and alas! Our four companions, two of them women, are murdered—and by this time the horses also are gone!” “Ay de mi! Mi madre y mi padre!” wailed the boy. “Alas! My mother and my father!” During the recital the company had listened intensely; and now at the close there was a sudden outburst of ejaculations. Some of the men—Baptiste Tabeau, Alexander Godey, Jacob, Sergeant Zindel, and others—were determined to start at once, to the scene of the attack. The lieutenant restrained them. “Wait,” he cautioned. “I cannot divide the force, boys. We have the camp to look after, to-night. The savages may be coming down the trail. To-morrow we will know better what to do.” “It’d be dark ’fore we got to the place whar the hosses war left,” reminded Kit, agreeing with the lieutenant. “Injuns’ll travel fast, for a ways, after they[268] take the herd, till they think they airn’t being pursued; then they’ll stop for a feast. We’ll catch ’em jest as soon if we start to-morrow, when they’ve slackened up.” Thomas Fitzpatrick concurred. The Mexican man’s name was Andrés Fuentes; the boy’s name was Pablo Hernandez. He was about eleven years old, and with his large black eyes, white teeth, smooth brown skin and regular oval features was a handsome little fellow. The twain were told to dismount, and stay. The lieutenant took them into his own mess, and promised them that on the morrow he would do what he could to avenge their wrongs. Early in the morning the camp was moving, setting course north to enter the main trail, only a few miles distant. Here were many blackish, rocky, bare ridges, with gullies of gravel and sand between. The gullies formed in the spring the beds of streams; and in places wolves had been smart enough to dig little wells, until two feet down they reached the water which they had smelled! After twenty miles, Andrés Fuentes pointed ahead. “The Agua de Tomaso—the Thomas Spring, se?ors. But I see no horses.” Pablo began to cry, as his memories revived. The advance scouts, whom Andrés and Pablo were guiding, spread and rode more cautiously, reconnoitring; but the Spring of Thomas was deserted; neither horse-herd nor Indians were there. [269] The signs were easy to read: the Indians had come in, afoot, from several directions, and had gone out driving the herd. “I think we’d better follow those rascals, lieutenant, an’ teach ’em a lesson, or the trail won’t be safe for travel, all the year,” said Kit Carson. “If the Injuns get away unpunished, with these hyar hosses, they’ll take more. They’ll consider they’re boss.” “Well,” answered the lieutenant, “go ahead, Kit. How many men do you want?” “Godey an’ I’ll do. This Mexican’ll come, too, if we’ll lend him a fresh hoss.” “Three of you, to tackle fifty?” queried the lieutenant. “Isn’t that a pretty big job?” “Wall, I reckon we’re enough to stampede the animals, an’ raise a little ha’r if necessary,” asserted Kit, quietly. “Godey’s wuth a dozen ordinary men; an’ the Mexican’s wife air captured, you remember.” “All right, Kit,” responded the lieutenant. “But we’re not asking you, or anybody, to go. That’s a risky proposition, pursuing Indians into the desert, and fighting somebody else’s battle. These are Mexicans—and their own caravan will be along, soon.” “Mexicans or not, they’re human beings, lieutenant,” declared Kit, refilling his powder-flask. “Pore critters! Think o’ having yore own wife out thar, at the mercy o’ the savages. An’ thar’ll be other parties[270] travelling the trail, with women an’ property. No, sir; those Injuns ought to be taught a lesson.” Well mounted and armed, rode away Kit and Godey and Fuentes the Mexican. Now was it mid-afternoon; the company remained in camp at the Agua de Tomaso, to await their return. There was little talk save upon the one topic: the venture of the two knights errant and their eager companion. In the dusk of evening a single figure was seen, returning from the direction wherein three had ridden. He came on slowly. The camp was alarmed. It was Fuentes, who explained that his horse had failed, but that Kit Carson and Godey were sticking to the trail. The night passed; the morning passed, and the sun crossed the zenith to afternoon. The lieutenant fidgeted, ill at ease, for Kit and Godey did not reappear. “They’ll come, captain, but they’ll find those Injuns first,” assured Thomas Fitzpatrick. “I know Kit and I know Godey. They’ll run that trail to the end. Kit never quits when once he has started.” Scarcely had he spoken, when shrill and clear pierced the hot air a faint, distant halloo—a long, high, quavering whoop, drifting in from the black ridge to the north. “A scalp halloo, or I’m an Injun myself!” exclaimed Fitzpatrick. “There’s Kit and Godey, with good news, I’ll wager.” Again rose the scalp halloo. All eyes were fastened[271] upon the ridge which closed the vista in that direction. Presently out from around a shoulder concealing a little pass emerged a jostling bunch of horses; two riders were driving; at rapid trot and lope they crossed the little strip of plain, for the camp. “Kit and Godey! I told you!” cried Thomas Fitzpatrick. “Look at the hosses?” “The very horses! Those are they—I recognize them; don’t you, Pablo?” claimed Fuentes, jubilantly; and he added, now mournful: “But I see only the two persons—the same who went. Ay de mi!” “Ay de mi! Mi madre y mi padre!” wailed Pablo. “Godey—he has scalps! See, on his gun!” directed Baptiste Tabeau, capering. “Yes! Two! Tied to the end of his gun!” “They overtook the Indians as well as the horses,” remarked the lieutenant. With whoop from Kit Carson and wide smile from Godey, triumphant the twain rode in. As said by Baptiste, from the end of Godey’s long-barrelled rifle dangled two fresh scalps, of black, Indian hair. How the camp cheered. As soon as the horses had been thrown in with herd, around Kit and Godey gathered the camp, breathless to hear the story. “Oh, Godey can tell it,” responded to the inquiries Kit. “Thar’s nothing to tell, anyhow. We followed the trail an’ found the Injuns an’ took the hosses an’ a couple o’ scalps, an’ hyar we air.” [272] “And my people, se?or—my wife, and the mother and father of Pablo, and Santiago? Nothing of them?” “Nothing of them, amigo,” said Kit Carson, gently; and turned away. Godey, by no means loath, was recounting, in his dramatic French fashion, while to his words his auditors, particularly the other French, wagged their heads. “At night we entered the mountains, but as you know there is a moon enough, and we followed the trail clear till midnight. We rode hard, my friends, for we are two mountain-men, and not afraid of these dogs of Pah-Utes, who eat horses and lizards. Then in a black gulch we must stop. Here the moon, being low, did not shine, and the trail was faint among the rocks. We must dismount, and upon hands and knees feel for it. By the sign we knew that the savages were only a few hours in advance of us. They had not eaten, and soon they would wish to taste horse. That is the use to which these desert Indians put the horse and the mule: they eat him, they do not ride him. So lest we lose the trail altogether we tied our horses, and without fire, that we should not be spied upon, in our saddle-blankets we slept upon the cold rocks until daylight. Now might we make a very small fire, of the dried sage, which gave off no smoke, by which we warmed our hands and cooked breakfast. Through the gulch we rode, and after about two miles we sighted the rascally savages. There were four lodges[273] of them, down in a bottom between bare hills. They thought that no one had pursued them, and that they were secure; for their horses were grazing without guard, and they themselves, about thirty in number, were feasting on horse, boiled and roasted. We could see the kettles and the steaks. Ma foi, my friends, but they were making very merry. Kit and I, we tied our horses below a ridge, and crept down for the horse-herd. By throwing stones and twigs at them we would edge them away, slowly, until we might stampede them. We were doing well, when, name of a dog! A fool of a young horse saw us on all fours, and up went his heels and how he snorted! That was enough. The Indians sprang to their arms. ‘Come!’ said Kit. ‘At them before they have any time!’ So down we charged, we two, yelling, and as bold as if we were two hundred. ‘Crack!’ spoke our rifles; but hein—one Indian fell; only one. ‘Scalp for me!’ I claimed. ‘I count coup on that fellow,’ claimed Kit. Pshaw! We had both shot at the same! No matter. I reloaded first, and at the crack I wiped out another. By this time arrows were whizzing around us, from those long, stout bows; one passed through my shirt-collar. Here—see? But the savages had enough; away they scampered, climbing the hills, and hiding in the rocks. They left a boy, and the two dead men. These two we scalped—when, horrible, the one who was shot twice, through and through, jumped up, howling. Wagh! I hope never to see another such a sight![274] When he howled, and before we could do what we must do, an old squaw, climbing the hill, stopped and looked back and shook her fist at us and cursed us. Maybe she was the dead man’s mother; who knows? Now we were in possession of the camp, which was cleverly hidden in a little bottom or draw, with a good spring. Four or five of the horses had been killed, for a big feast; they were cut up, all ready to fill the pots again. Many more Indians were expected; the pots, and baskets of fifty or sixty moccasins showed this. As for the boy, when he found that he was not to die immediately at our hands, he sat down and gnawed at a horse-head. Ma foi! What lack of feeling! Well, my friends, we destroyed the camp, and left there the boy, eating his horse-head, and collecting the horses we took the back trail.” “Bravo! Good!” congratulated the company. “You saw nothing of the Mexican prisoners?” queried the lieutenant. Godey shook his head. “No, captain. There was no sign. We think that they must be with the other party of the savages or else——” and Godey shrugged his shoulders, significantly. The lieutenant spoke to Fuentes, informing him. And Fuentes, and Pablo the lad, having shaken the hands of Kit and of Godey, thanking them for the scout, enveloped themselves in their serapes, apart. Sorrow sat heavy upon them. What were the horses,[275] as compared with wife, and father and mother, and friend? Oliver overheard the lieutenant talking with Theodore Talbot, the Washington tenderfoot who had won veteran’s service-stripes. “There you see an example of mountain-man work, Talbot,” was saying the lieutenant. “That’s the spirit beyond the western frontier. Here we have two men trailing Indians—a wily foe—fifty miles through an unknown country; attacking their camp, which showed four lodges, each lodge presumed to mean five to eight or more persons; driving the Indians out, and returning, with the horses, fifty miles again; all in thirty hours. And why? Not only for general good, but to avenge the wrongs suffered by Mexicans who also were strangers. I tell you, Talbot, you’ll never meet with a bolder, finer deed of arms. And who performed it? Kit Carson, of Kentucky parentage and Missouri breeding, and Alexander Godey, St. Louis Frenchman: Americans, both.”","sourceLink":"http://novel.tingroom.com/duanpian/3255/89218.html","bookId":599,"book":{"id":599,"title":"With Carson and Frémont","description":"简介： The trail journals of the first two government exploring expeditions commanded by Lieutenant John Charles Frmont, of the United States Engineers, and advised by Kit Carson, mountain-man, are to be found together published, spring of 1845, as reports...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3255","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
