{"id":22548,"no":6,"title":"V FRéMONT SAYS “ONWARD!”","content":"“Thar’s Fort John,” directed Oliver’s trail comrade, William New. This was the fourth day after the meeting with Jim Beckwith; the march had been steadily northward, with snowy mountains distant on the left, and with far bleak ridges showing ever more clear, in the north. “Thar’s Fort John,” directed William New. “Those mountains beyond it are the Black Hills, whar the Sioux an’ Cheyenne cache themselves.” “Is that the same as Fort Laramie?” asked Oliver. “Yep. That beaver has two tails, is all. John war what the Company (and by this Oliver knew that he meant the great American Fur Company) named it, an’ that’s what most o’ us old trappers call it; but ‘Laramie’ is the general name ’mongst traders, an’ some trappers too. You see, it’s on Laramie Fork o’ the North Platte, an’ that peak over it is Laramie Peak, so ‘Laramie’ ’s a natteral word.” While still riding northward as if to pass by Fort Laramie on the other side of Laramie Creek, the squad encountered a plain trail, almost a road, running east[69] and west; and into this turned at once Lieutenant Ike and fellow leader. Therefore turned into it all, as matter of course. “Hyar’s yore way to Oregon,” announced William New, for benefit of Oliver. “But thar’s been a heap o’ people passed along since a year ago. Wagh, thar has! Sign’s fresh, too—people, wagons an’ cattle!” “An’ thar’s whar we find Kit, I reckon,” spoke a horseman of the pair in front, nodding before. “Yes; an’ Injuns, too,” added his comrade. “’Drather find ’em thar than on ahead.” “See those lodges?” directed William New, to Oliver. “Sioux lodges. Few Cheyenne, but mostly Sioux—Ogalallah.” Before, beyond the sparse willows and cottonwood of the creek, stood forth boldly upon a little knoll the post of Fort Laramie or Fort John. The walls were of adobe clay, like the walls of Bent’s Fort, but whitewashed, after Mexican fashion, like many of the houses in Taos. The fort had towers, at diagonal corners, square and peaked; and over the principal gateway was another tower or sentry-box, floating the Stars and Stripes. Along the tops of the walls stood, like teeth, a row of palisades. Close beside the walls and below the post were a collection of conical white tents—evidently Indian lodges of tanned buffalo hides. Many figures were strolling about: figures in buckskins and wool, as well as figures in blankets and robes. “Thar’s Kit, or else this chile’s eyes don’t know[70] fat cow from pore bull!” exclaimed a voice. “An’ thar’s more of ’em camped nigh the river, up above!” Through the ford, where had crossed the wheels and hoofs of preceding companies, plashed the squad, at trot; at gallop mounted the rise which waited; and with trapper whoop and Indian yelp, and “Whang!” of sundry rifle, charged for the gate of old Laramie. The Indians, blanketed to their chins, stoically stared; from the walls and from the gateway the post employés witnessed, unperturbed, for they were accustomed to such arrival; a few other trappers, lounging about, whooped back, with wave of hand; and a wiry, sandy, short-legged, broad-shouldered little man, vaulting upon a horse, dashed out, full speed for the short distance, hat-brim flaring, hair and fringes streaming, to meet the incomers. “Told ’ee it war Kit! Rides like an Injun!” chuckled the previous speaker. “Hello, Kit.” “Hello, boys.” He checked his horse as quickly as he had started it. “Glad to see ye. Thar’s our camp, up above.” “Wall, got yore express, an’ hyar we air,” volunteered Ike, as all rode on. “What’s the news?” “Government expedition to the South Pass; maybe further. Lieutenant Frémont, army man, is boss; Maxwell’s hunter, I’m guide. The lieutenant’s got twenty or so fust-class St. Louis Frenchmen hired for the trip, but seemed to me I’d feel more comfortable[71] if I had some o’ my own crowd. So I sent those two Delawares to Touse, with the word.” JOHN CHARLES FRéMONT As they were about to pass the post another horseman spurred out, intercepting them. The fact that this was the “army man,” government “boss” of the expedition, was impressed upon the cavalcade, and all eyes turned to scrutinize the rider as he approached. He rode well and easily—but with somewhat longer stirrup than the short Indian-hung stirrup of the Carson men, and sitting rather more erect than was trapper custom. His costume bore scarce a trace of army uniform; he wore a short plain blue blouse, half unbuttoned, over blue flannel shirt and ordinary jean trousers tucked into high moccasins, while his head-gear was the broad curly-brimmed wool hat of the plains and mountains. He carried no sword. However, athwart his saddle-horn was lying the inevitable rifle. His figure was more slender than Kit Carson’s; he was about two inches taller, and evidently he weighed about the same. He had a full brown beard, rather compact and wavy, oval face, white skin now tanned, bold clean-cut nose jutting like the keel of a boat, and large eyes of flashing blue. He was not any older than Kit, much handsomer, altogether a different style of man—more excitable, more dashing, more like Kit was in an Indian fight. Yes, here was another type of leader. “Got your men, I see,” he addressed, reining in, with a rapid glance along the column. [72] “Yep,” drawled Kit. “Hyar they are.” “And one boy, too,” added the lieutenant, with a smile at Oliver. “That will make my boys envious.” “Wall,” remarked Kit, “he’s man an’ on the pay-roll. ’Tisn’t size that counts, always.” The camp was close ahead. It consisted of about a dozen small cone-shaped tents of dingy canvas; one tent, slightly larger than the others, and set apart, probably was Lieutenant Frémont’s tent. The camp was thronging with whites in frontier costume, with Indians and dogs; saddles and packs were stacked in piles; and out from the creek bank, in a grassy place, were grazing horses and mules. From the camp now came racing, like young Indians, upon their ponies, two boys, as if eager to inspect. One was younger than Oliver, the other was older. They, also, were dressed in easy but rough plains costume, and the younger even wore Cheyenne moccasins. With brief “Hello” they fell in alongside the leaders of the column, and accompanied it while covertly eyeing its make-up. Oliver assumed his best mountain-man pose, and with equal sly curiosity eyed them back. “No, my men will mess by themselves,” was saying Kit Carson, to Lieutenant Frémont. “O’ course, thar can be a general camp, but they’ll make their own way. That’ll avoid any trouble.” “Very well,” answered Lieutenant Frémont.[73] “That’s understood, then. I don’t feel authorized to enlist them.” To the camp rode on the Carson squad; and at the lifted hand of Kit, as signal, they were off saddle at once, to unpack and make another camp—an extension of first. While Oliver was busy, a voice spoke to him. “Your name’s Oliver, Kit says.” It was Lieutenant Frémont, accosting him with another frank smile; the two boys, bridle-lines upon arms, were with him. “I want you young gentlemen to get acquainted. Oliver, this is Henry Brant, and Randolph Benton, of St. Louis. They came out by the North Platte trail, with Kit’s party.” Oliver flushed, as he shook hands. “Are you going all the way?” asked Randolph, eagerly. He was the younger boy, with the Cheyenne moccasins; his age was about twelve. “I don’t know. We go as far as Kit goes, I guess.” “That’s all the way, then. You aren’t afraid of Indians, are you?” “Naw,” grunted Oliver, disdainfully. “We aren’t, either,” declared the older boy, Henry. He was about nineteen. And he continued, gloomily: “But we can’t go on. We’ve got to stay here at the fort, Mr. Frémont says.” “A Cheyenne boy gave me these moccasins,” informed Randolph, proudly, sticking out a foot. [74] “Yes. I knew ’em for Cheyenne moccasins, soon as I saw ’em,” answered Oliver. “But why don’t you go on?” he invited—liking both boys. “Isn’t the party going on?” “Yes; but we’re too inexperienced, Mr. Frémont thinks. And he doesn’t want to have the responsibility of us,” explained Henry; continuing, gloomily as before: “We’d go, if he’d let us; but if the Indians are bad I suppose we might be in the way, and I’d rather stay here than get anybody killed looking after us.” “So would I,” agreed Randolph, quickly. He was the livelier of the two. “We almost had a fight, coming out, anyhow; only they turned into trappers instead of Indians.” “We’ll have some fun, at the fort, I guess,” said Henry, more hopefully. “But you finish up your work, Oliver. We’ll watch you.” “Well,” admitted Oliver. “I’ll be done in a minute.” He proceeded; his two friends strolled about, keeping in touch with him. The Frémont party were composed all of St. Louis French—the majority seasoned voyageurs and trappers who as American Fur Company men had before met the Carson men on the beaver trail. They wore, some buckskins, but the greater proportion baggy jean trousers stuffed into high moccasins or boots, and belted at the waist, flannel shirts adjusted outside the[75] trousers, like blanket-coats and trimmed in red, bright neckerchiefs, and handkerchief turbans or the wool hats. A cheery, bustling, dark-faced and dark-eyed crowd they were, laughing much and singing much and joking much. “Let’s go down to the fort,” proposed Randolph, at once, when Oliver turned from his last chore. But the sun was setting behind great Laramie Peak of the Black Hills, in the west; throughout the combined camps fires were blazing; and Oliver, keenly aware of time and place, must reply: “No; this chile’s wolfish, and pots are on the fire. Meat, first. Then I’ll go.” “You eat with us, at our mess,” invited Henry. “Yes. You can, can’t you?” urged Randolph. “Buffalo meat, and coffee!” “I suppose you’re used to buffalo meat, though,” hazarded Henry, as they moved on. “Yes. That’s what we live on, mostly. Don’t have much coffee. Didn’t bring any, this trip.” “We lost nearly all of ours—a whole bag full, in the Kansas River!” chirped Randolph. “Almost as soon as we’d started. Our rubber boat tipped over when we were crossing, and Kit Carson and Mr. Maxwell and everybody had to jump into the river and rescue things. Some of the men couldn’t swim, either; but they didn’t care! Kit Carson was sick two days from his wetting.” “He’s often been in rivers. Trappers wade to[76] their waist in ice-water, setting traps or finding ’em,” explained Oliver. “Are you a trapper?” “I’m learning,” answered Oliver, cautiously. And he added, with pride: “I’m a Kit Carson man, though.” “Do those tacks in your rifle mean scalps?” “Yes.” “Did you take them?” “No; but Kit Carson did, before he gave the rifle to me. It was his rifle.” “I’d like to be a Kit Carson man,” declared Henry. “I’d as soon be a Frémont man,” retorted Randolph, loyally. “Well, it takes pluck to follow either of them, I guess,” admitted Henry. “They’re both brave. You ought to have seen them riding after buffalo! Kit Carson’s horse put his foot in a hole and threw him head over heels and ran away with the buffalo till Mr. Maxwell caught him; and the lieutenant’s horse chased so hard and got so excited that it regularly foamed at the mouth! It’s a trained buffalo horse; name is Proveau.” They squatted, trapper fashion, guns against knees, near a fire upon which a pot of stew bubbled and steamed attractively. At other fires men were toasting strips of meat held on sticks. “You came up from Taos, didn’t you?” asked Henry. [77] “Yes.” “We came clear from St. Louis. That’s about as far,” piped Randolph. “But I came from Washington, too. We left Missouri—or Mr. Chouteau’s farm just this side, the tenth of June and we got here July thirteenth. We’ve been here a week.” “Did you have any scrimmages, on the trail?” queried Oliver. “Naw,” said Henry. “Once we thought we were going to, but they were just a band of trappers on their way back to Missouri. We had some fine buffalo hunts, though. But Lieutenant Frémont almost got into a big Indian fight. He separated from us, part way; and he and Mr. Maxwell and a couple of others followed up the South Branch of the Platte River to the mountains, while we took the Oregon Trail route, up the North Branch.” “Yes; and about three hundred Injuns charged them, and there’d have been shooting if Mr. Maxwell hadn’t recognized one of the Injuns and shouted, just in time: ‘You old fool! Don’t you know me?’ Then they all shook hands, and went to the Indian village. They were Arapahoe Indians.” “What’s this expedition for, anyway?” ventured Oliver. “I’ll tell you,” proffered Randolph. “I know because Lieutenant Frémont married my sister——” “And his father’s Senator Benton of Missouri, too,” further explained Henry. “We’re second[78] cousins. That’s why we were taken along, I guess.” “Well, I’ve heard the talk, at our house in Washington, anyway,” resumed Randolph, interrupted. “It’s claimed to be an army expedition sent out by the Secretary of War to examine the country between the Missouri frontiers and the Rocky Mountains, and to get the latitude and longitude of the South Pass; but my father and some other men in Congress hope it will encourage colonists over into Oregon by describing the way to get there.” “Have you been to the South Pass?” asked Henry, of Oliver. “No, not yet; but most of our men have. That’s the big pass on the regular trapper and trader trail, over the Rockies from this side to the other side. Everybody knows the South Pass.” “Wish we were going on,” repeated Henry, wistfully. “But I guess it’s mighty serious when Kit Carson makes his will.” “Did he?” “Yes. You see, our party met a party under Jim Bridger—you know Jim Bridger, another trapper captain? (Oliver nodded.) And they all said the country beyond Laramie isn’t safe, because the Sioux swear they’ll kill every white man they find there. That scared our men pretty bad, and Kit Carson got alarmed, too; and at the fort he made his will, so that in case he’s killed his little girl he left in St. Louis at school will be provided for. She’s half Indian.” [79] “Well, he’ll go on, though, if Frémont goes on,” asserted Oliver, stoutly. “Of course. That’s why he made his will. He’s sensible. It isn’t because he’s afraid.” When supper was practically over with, and the men had lighted their pipes for a few minutes preceding night chores, a figure stepped into the midst of the lounging groups and lifted his arm, for attention. It was a slender, quick figure—that of Lieutenant Frémont. “Men,” he addressed, clearly, “to-morrow we break camp, for the outward trail again. We’re well armed, we know how to take care of ourselves, in a fight, and Mr. Bissonette, head agent at Fort Platte, has agreed to go with us, as far as we need him, as interpreter. He is a friend of the Sioux and Blackfeet, and can talk with them if we meet them. But as to these threats by the Indians and these rumors of danger, you know as well as I do how much they can be relied upon. You’ve all been in the Indian country before; you can’t expect to travel in it and not risk a fight or two. In fact, you knew it before we left St. Louis. You knew there that the Sioux and Blackfeet were unsettled, in the Laramie region. I’m going on, right on, ready for peace or war. I don’t see any good and sufficient reason why any of you should break your engagement with the government and me; but I don’t want anybody in my party who feels afraid or repents of his bargain. Let him step forward at[80] once, and I’ll release him with his discharge and his pay up to date.” There was an instant of silence, broken by a laugh as one man arose, and defiantly stood. “You wish to stay, do you?” demanded Lieutenant Frémont. The man nodded. “Are you sick, perhaps?” “No.” “Tired, then.” “Yes.” “You did not know that the South Pass was beyond Fort John, I presume!” pursued the lieutenant, sarcastically—creating another laugh. The man maintained sulky silence, hanging his head. “Well, my poor fellow, we are very sorry for you,” continued the officer. “You are welcome to your pay and discharge, and you can be making garden at the post so as to have nice vegetables ready for us when we come back!” Thus having ridiculed him, the lieutenant asked, generally: “Is there anybody else who is tired in heart or feet?” None answered—for which Oliver was glad. “Humph!” criticised Randolph, as the three boys trudged off to visit the post. “Wish now they’d take us instead. But they won’t. I’ve got to stay and wind the old chronometers every day!” The next morning Oliver (accompanied by the envious[81] and disconsolate Henry and Randolph) was paying another visit to the fort. Lieutenant Frémont, and Kit Carson and Lucien Maxwell and several of the French trappers in the Frémont company had entered the office of Mr. Boudeau, the agent, as if to say good-by; when through the gate and across the court, for the office, stalked, with great dignity, half a dozen Sioux—all chiefs. They were finely built men, several of them old. A clerk at the door of the office would wave them away; but they acted as if they did not see him, and past him they shouldered, and on in. “Come on!” whispered Randolph, to his comrades. “There’s something up. They’re from Fort Platte, at the Platte River a mile below. I’ve seen ’em there.” So, the way apparently being open, in after the Indians sidled the boys. Lieutenant Frémont was just opening a folded note, evidently brought by the Indians. They had seated themselves upon the floor, along the wall, and were waiting for the result. The white men were eyeing the missive anxiously, and waiting also. “This is a note from Mr. Bissonette at Fort Platte,” announced Lieutenant Frémont; “as follows,” and he read, in French. Then he continued: “In case some of us may not have understood it all, I’ll translate.” And again he read—flushing more as he proceeded: [82] “Fort Platte, July 1, 1842. “Mr. Frémont: The chiefs in council have just told me to warn you not to set out before the party of young men which is out shall have returned. Moreover, they tell me that they are very certain that they (the young men) will fire upon you at the first meeting. They ought to be back in seven to eight days. Pardon me for thus addressing you, but it seems to me that I should warn you of the danger. Furthermore, the chiefs who forbid you to set forth before the return of the warriors are the bearers of this note. “I am your obedient servant, “Joseph Bissonette, “by L. B. Chartrain. “The names of some of the chiefs—The Otter Hat, the Breaker of Arrows, the Black Night, the Bull’s Tail.” As the lieutenant finished, one of the seated chiefs arose, and dropping his blanket, as signal that he was about to speak, in guttural tone, with now and then a gesture, delivered a short harangue. Mr. Boudeau, the American Fur Company agent in charge of the post, translated sentence by sentence. “You have come among us at a bad time,” said the chief. “Some of our people have been killed, and our young men who have gone to the mountains are eager to avenge the blood of their relations, which has been shed by the whites. Our young men are bad, and if they meet you, they will believe that you are carrying goods and ammunition to their enemies, and will fire upon you. You have told us that this will make[83] war. We know that our great father has many soldiers and big guns, and we are anxious to keep our lives. We love the whites, and are desirous of peace. Thinking all these things, we have decided to keep you here until our warriors return. We are glad to see you among us. Our father is rich and we expected that you would have brought us presents from him—horses and guns and blankets. But we are glad to see you, anyway. We look upon your coming as the light that goes before the sun; for you will tell our great father that you have seen us, and how we are naked and poor and have nothing to eat, and he will send us all these things.” The chief sat down, and enveloped himself in his red blanket. Another chief, doffing his blanket (which was blue trimmed with red), standing also spoke. He said, like the first, that they loved the whites very much, and could not bear to have them injured when they came as friends, and that it was better for them to stay safely at the post and not go on. Then the great father at Washington would be grateful and would give his red children many blankets and horses and much food and powder and lead! Other chiefs spoke, in turn—and all blandly expressed the hope that in reward for their tender care of the expedition in forbidding it to proceed, the “great father” at Washington would liberally reward them! When the half circle of chiefs had said their say,[84] Lieutenant Frémont replied—Agent Boudeau translating his sentences into Sioux. “We thank you for your good words,” replied the lieutenant, to their up-turned solemn visages. “We know that you do not wish us to be harmed, and it will please the great father at Washington to hear about it. We should like to stay with you a long time, but the trail is waiting, we have not come to the end of it. We hope that your young men will not take us as enemies. That would be a great pity, when we come as friends. But in case that your young men might not see plainly, and blood would be shed, and perhaps many of them killed, we ask that two or three of you go with us, to signal the young men and tell them that we are friends. We ask that you go with us, as our guests, to spread your robes in my lodge and eat at my fire; and when we return safely I will give presents.” The chief in the red blanket arose. “We have heard the speech of the white chief, and it is good,” he said. “But we are old and poor and tired, and we cannot travel far on horseback. We must sit in our lodges and smoke our pipes among the women, and let our young warriors take the trail. Besides, we have no power now over the young men, and it would be bad for us if we tried to interfere on the war-path.” He seated himself, and was applauded by a chorus of grunts from his comrades. Lieutenant Frémont answered, instantly and energetically—with[85] a glance at Kit Carson as if to read approval in his sober face. “You say that you love the whites; why have you killed so many already this spring? You say you love the whites, and you are full of words about friendship; but you are unwilling to undergo the fatigue of a few days’ ride to save our lives! We do not believe what you have said; we will listen to you no more. Whatever a chief among us tells his soldiers to do, is done. We obey our chiefs. We are soldiers of the great chief your father. He has told us to come out here, and see this country and all the Indians, his children. Why should we not go on and do it? Before we came, we heard that you had killed his people and wanted to be his children no longer; but we came anyway, holding out our hands in peace. Now we find that the stories we heard are not lies, and that your young men are on the war-path and you are no more his friends and children. But we have thrown away our bodies, and will not turn back. When you told us that your young men would kill us, you did not know that our hearts were strong, and you did not count the rifles that my young men carry in their hands. We may be few, and you are many, in numbers, and you may think to kill us; but if you try there will be much crying of women in your villages, for many of your young men will stay behind and forget to return with the others from the mountains. Do you think that our great chief will let his soldiers die, and will not[86] cover their graves? Before the snows melt again his warriors will have swept away your villages as the fires in autumn sweep the prairies. Look around. See! I have pulled down my white lodges and my people are ready: when the sun is ten paces higher, we shall be on the march. If you have anything new to tell us, you should say it soon. I am done.” With that the lieutenant turned his back, and strode out; after him strode Kit Carson and Lucien Maxwell and all, even the agent, with the three boys forming the rear. Presently, at decent interval, filed forth the chiefs, blanket shrouded; they crossed the court and passed through the gate, for the lodges without. “That was a good speech, wasn’t it!” praised Randolph. “And he means what he says, too.” “Guess you start right away,” said Henry; for Lieutenant Frémont had immediately mounted his horse, at the post gate, and was dashing for the camp, followed by the other men. So, hastily vaulting into their own saddles, with a whoop the three boys, abreast, raced after.","sourceLink":"http://novel.tingroom.com/duanpian/3255/89202.html","bookId":599,"book":{"id":599,"title":"With Carson and Frémont","description":"简介： The trail journals of the first two government exploring expeditions commanded by Lieutenant John Charles Frmont, of the United States Engineers, and advised by Kit Carson, mountain-man, are to be found together published, spring of 1845, as reports...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3255","creation":"Aug 1, 2019 12:19:01 AM","modification":"Aug 1, 2019 12:19:01 AM"}}
