{"id":14806,"no":10,"title":"A LEGEND OF TICONDEROGA.","content":"Mention has been made of the death of Major Duncan Campbell of Inverawe. The following family tradition relating to it was told me in 1878 by the late Dean Stanley, to whom I am also indebted for various papers on the subject, including a letter from James Campbell, Esq., the present laird of Inverawe, and great-nephew of the hero of the tale. The same story is told, in an amplified form and with some variations, in the Legendary Tales of the Highlands of Sir Thomas Dick Lauder. As related by Dean Stanley and approved by Mr. Campbell, it is this:— The ancient castle of Inverawe stands by the banks of the Awe, in the midst of the wild and picturesque scenery of the western Highlands. Late one evening, before the middle of the last century, as the laird, Duncan Campbell, sat alone in the old hall, there was a loud knocking at the gate; and, opening it, he saw a stranger, with torn clothing and kilt besmeared with blood, who in a breathless voice begged for asylum. He went on to say that he had killed a man in a fray, and that the pursuers were at his heels. Campbell promised to shelter him. \"Swear on your dirk!\" said the stranger; and Campbell swore. He then led him to a secret recess in the depths of the castle. Scarcely was he hidden when again there was a loud knocking at the gate, and two armed men appeared. \"Your cousin Donald has been murdered, and we are looking for the murderer!\" Campbell, remembering his oath, professed to have no knowledge of the fugitive; and the men went on their way. The laird, in great agitation, lay down to rest in a large dark room, where at length he fell asleep. Waking suddenly in bewilderment and terror, he saw the ghost of the murdered Donald standing by his bedside, and heard a hollow voice pronounce the words: \"Inverawe! Inverawe! blood has been shed. Shield not the murderer!\" In the morning Campbell went to the hiding-place of the guilty man and told him that he could harbor him no longer. \"You have sworn on your dirk!\" he replied; and the laird of Inverawe, greatly perplexed and troubled, made a compromise between conflicting duties, promised not to betray his guest, led him to the neighboring mountain, and hid him in a cave. In the next night, as he lay tossing in feverish slumbers, the same stern voice awoke him, the ghost of his cousin Donald stood again at his bedside, and again he heard the same appalling words: \"Inverawe! Inverawe! blood has been shed. Shield not the murderer!\" At break of day he hastened, in strange agitation, to the cave; but it was empty, the stranger was gone. At night, as he strove in vain to sleep, the vision appeared once more, ghastly pale, but less stern of aspect than before. \"Farewell, Inverawe!\" it said; \"Farewell, till we meet at TICONDEROGA!\" The strange name dwelt in Campbell\u0027s memory. He had joined the Black Watch, or Forty-second Regiment, then employed in keeping order in the turbulent Highlands. In time he became its major; and, a year or two after the war broke out, he went with it to America. Here, to his horror, he learned that it was ordered to the attack of Ticonderoga. His story was well known among his brother officers. They combined among themselves to disarm his fears; and when they reached the fatal spot they told him on the eve of the battle, \"This is not Ticonderoga; we are not there yet; this is Fort George.\" But in the morning he came to them with haggard looks. \"I have seen him! You have deceived me! He came to my tent last night! This is Ticonderoga! I shall die to-day!\" and his prediction was fulfilled. Such is the tradition. The indisputable facts are that Major Duncan Campbell of Inverawe, his arm shattered by a bullet, was carried to Fort Edward, where, after amputation, he died and was buried. (Abercromby to Pitt, 19 August, 1758.) The stone that marks his grave may still be seen, with this inscription: \"Here lyes the Body of Duncan Campbell of Inverawe, Esqre., Major to the old Highland Regiment, aged 55 Years, who died the 17th July, 1758, of the Wounds he received in the Attack of the Retrenchment of Ticonderoga or Carrillon, on the 8th July, 1758.\" His son, Lieutenant Alexander Campbell, was severely wounded at the same time, but reached Scotland alive, and died in Glasgow. Mr. Campbell, the present Inverawe, in the letter mentioned above, says that forty-five years ago he knew an old man whose grandfather was foster-brother to the slain major of the forty-second, and who told him the following story while carrying a salmon for him to an inn near Inverawe. The old man\u0027s grandfather was sleeping with his son, then a lad, in the same room, but in another bed. This son, father of the narrator, \"was awakened,\" to borrow the words of Mr. Campbell, \"by some unaccustomed sound, and behold there was a bright light in the room, and he saw a figure, in full Highland regimentals, cross over the room and stoop down over his father\u0027s bed and give him a kiss. He was too frightened to speak, but put his head under his coverlet and went to sleep. Once more he was roused in like manner, and saw the same sight. In the morning he spoke to his father about it, who told him that it was Macdonnochie [the Gaelic patronymic of the laird of Inverawe] whom he had seen, and who came to tell him that he had been killed in a great battle in America. Sure enough, said my informant, it was on the very day that the battle of Ticonderoga was fought and the laird was killed.\" It is also said that two ladies of the family of Inverawe saw a battle in the clouds, in which the shadowy forms of Highland warriors were plainly to be descried; and that when the fatal news came from America, it was found that the time of the vision answered exactly to that of the battle in which the head of the family fell. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2851/78700.html","bookId":1215,"book":{"id":1215,"title":"Historic Handbook of the Northern Tour","description":"简介： This beautiful lake owes its name to Samuel de Champlain, the founder of Quebec. In 1609, long before the Pilgrim Fathers landed at Plymouth, he joined a band of Huron and Algonquin warriors on an expedition against their enemies, the Iroquois, since...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2851","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
