{"id":7627,"no":5,"title":"Chapter 5 Thin Air","content":"Raffles hailed a passing hansom, and had bundled me in before I realised that he was not coming with me. \\n\\n \\n\\n “Drive down to the club for Teddy’s cricket-bag,” said he; “we’ll make him get straight into flannels to save time. Order breakfast for three in half-an-hour precisely, and I’ll tell him everything before you’re back.” \\n\\n \\n\\n His eyes were shining with the prospect as I drove away, not sorry to escape the scene of that young man’s awakening to better fortune than he deserved. For in my heart I could not quite forgive the act in which Raffles and I had caught him overnight. Raffles might make as light of it as he pleased; it was impossible for another to take his affectionately lenient view, not of the moral question involved, but of the breach of faith between friend and friend. My own feeling in the matter, however, if a little jaundiced, was not so strong as to prevent me from gloating over the victory in which I had just assisted. I thought of the notorious extortioner who had fallen to our unscrupulous but not indictable wiles; and my heart tinkled with the hansom bell. I thought of the good that we had done for once, of the undoubted wrong we had contrived to right by a species of justifiable chicanery. And I forgot all about the youth whose battle we had fought and won, until I found myself ordering his breakfast, and having his cricket-bag taken out to my cab. \\n\\n \\n\\n Raffles was waiting for me in the Albany courtyard. I thought he was frowning at the sky, which was not what it had been earlier in the morning, until I remembered how little time there was to lose. \\n\\n \\n\\n “Haven’t you seen anything of him?” he cried as I jumped out. \\n\\n \\n\\n “Of whom, Raffles?” \\n\\n \\n\\n “Teddy, of course!” \\n\\n \\n\\n “Teddy Garland? Has he gone out?” \\n\\n \\n\\n “Before I got in,” said Raffles, grimly. “I wonder where the devil he is!” \\n\\n \\n\\n He had paid the cabman and taken down the bag himself. I followed him up to his rooms. \\n\\n \\n\\n “But what’s the meaning of it, Raffles?” \\n\\n \\n\\n “That’s what I want to know.” \\n\\n \\n\\n “Could he have gone out for a paper?” \\n\\n \\n\\n “They were all here before I went. I left them on his bed.” \\n\\n \\n\\n “Or for a shave?” \\n\\n \\n\\n “That’s more likely; but he’s been out nearly an hour.” \\n\\n \\n\\n “But you can’t have been gone much longer yourself, Raffles, and I understood you left him fast asleep?” \\n\\n \\n\\n “That’s the worst of it, Bunny. He must have been shamming. Barraclough saw him go out ten minutes after me.” \\n\\n \\n\\n “Could you have disturbed him when you went?” \\n\\n \\n\\n Raffles shook his head. \\n\\n \\n\\n “I never shut a door more carefully in my life. I made row enough when I came back, Bunny, on purpose to wake him up, and I can tell you it gave me a turn when there wasn’t a sound from in there! He’d shut all the doors after him; it was a second or two before I had the pluck to open them. I thought something horrible had happened!” \\n\\n \\n\\n “You don’t think so still?” \\n\\n \\n\\n “I don’t know what to think,” said Raffles, gloomily; “nothing has panned out as I thought it would. You must remember that we have given ourselves away to Dan Levy, whatever else we have done, and without doubt set up the enemy of our lives in the very next street. It’s close quarters, Bunny; we shall have an expert eye upon us for some time to come. But I should rather enjoy that than otherwise, if only Teddy hadn’t bolted in this rotten way.” \\n\\n \\n\\n Never had I known Raffles in so pessimistic a mood. I did not share his sombre view of either matter, though I confined my remarks to the one that seemed to weigh most heavily on his mind. \\n\\n \\n\\n “A guinea to a gooseberry,” I wagered, “that you find your man safe and sound at Lord’s.” \\n\\n \\n\\n “I rang them up ten minutes ago,” said Raffles. “They hadn’t heard of him then; besides, here’s his cricket-bag.” \\n\\n \\n\\n “He may have been at the club when I fetched it away — I never asked.” \\n\\n \\n\\n “I did, Bunny. I rang them up as well, just after you had left.” \\n\\n \\n\\n “Then what about his father’s house?” \\n\\n \\n\\n “That’s our one chance,” said Raffles. “They’re not on the telephone, but now that you’re here I’ve a good mind to drive out and see if Teddy’s there. You know what a state he was in last night, and you know how a thing can seem worse when you wake and remember it than it did at the time it happened. I begin to hope he’s gone straight to old Garland with the whole story; in that case he’s bound to come back for his kit; and by Jove, Bunny, there’s a step upon the stairs!” \\n\\n \\n\\n We had left the doors open behind us, and a step it was, ascending hastily enough to our floor. But it was not the step of a very young man, and Raffles was the first to recognise the fact; his face fell as we looked at each other for a single moment of suspense; in another he was out of the room, and I heard him greeting Mr. Garland on the landing. \\n\\n \\n\\n “Then you haven’t brought Teddy with you?” I heard Raffles add. \\n\\n \\n\\n “Do you mean to say he isn’t here?” replied so pleasant a voice — in accents of such acute dismay — that Mr. Garland had my sympathy before we met. \\n\\n \\n\\n “He has been,” said Raffles, “and I’m expecting him back every minute. Won’t you come in and wait, Mr. Garland?” \\n\\n \\n\\n The pleasant voice made an exclamation of premature relief; the pair entered, and I was introduced to the last person I should have suspected of being a retired brewer at all, much less of squandering his money in retirement as suggested by his son. I was prepared for a conventional embodiment of reckless prosperity, for a pseudo-military type in louder purple and finer linen than the real thing. I shook hands instead with a gentle, elderly man, whose kindly eyes beamed bravely amid careworn furrows, and whose slightly diffident yet wholly cordial address won my heart outright. \\n\\n \\n\\n “So you’ve lost no time in welcoming the wanderer!” said he. “You’re nearly as bad as my boy, who was quite bent on seeing Raffles last night or first thing this morning. He told me he should stay the night in town if necessary, and he evidently has.” \\n\\n \\n\\n There was still a trace of anxiety in the father’s manner, but there was also a twinkle in his eyes, which kindled with genial fires as Raffles gave a perfectly truthful account of the young man’s movements (as distinct from his words and deeds) overnight. \\n\\n \\n\\n “And what do you think of his great news?” asked Mr. Garland. “Was it a surprise to you, Raffles?” \\n\\n \\n\\n Raffles shook his head with a rather weary smile, and I sat up in my chair. What great news was this? \\n\\n \\n\\n “This son of mine has just got engaged,” explained Mr. Garland for my benefit. “And as a matter of fact it’s his engagement that brings me here; you gentlemen mustn’t think I want to keep an eagle eye upon him; but Miss Belsize has just wired to say she is coming up early to go with us to the match, instead of meeting at Lord’s, and I thought she would be so disappointed not to find Teddy, especially as they are bound to see very little of each other all day.” \\n\\n \\n\\n I for my part was wondering why I had not heard of Miss Belsize or this engagement from Raffles. He must himself have heard of it last thing at night in the next room, while I was star-gazing here at the open window. Yet in all the small hours he had never told me of a circumstance which extenuated young Garland’s conduct if it did nothing else. Even now it was not from Raffles that I received either word or look of explanation. But his face had suddenly lit up. \\n\\n \\n\\n “May I ask,” he exclaimed, “if the telegram was to Teddy or to you, Mr. Garland?” \\n\\n \\n\\n “It was addressed to Teddy, but of course I opened it in his absence.” \\n\\n \\n\\n “Could it have been an answer to an invitation or suggestion of his?” \\n\\n \\n\\n “Very easily. They had lunch together yesterday, and Camilla might have had to consult Lady Laura.” \\n\\n \\n\\n “Then that’s the whole thing!” cried Raffles. “Teddy was on his way home while you were on yours into town! How did you come?” \\n\\n \\n\\n “In the brougham.” \\n\\n \\n\\n “Through the Park?” \\n\\n \\n\\n “Yes.” \\n\\n \\n\\n “While he was in a hansom in Knightsbridge or Kensington Gore! That’s how you missed him,” said Raffles confidently. “If you drive straight back you’ll be in time to take him on to Lord’s.” \\n\\n \\n\\n Mr. Garland begged us both to drive back with him; and we thought we might; we decided that we would, and were all three under way in about a minute. Yet it was considerably after eleven when we bowled through Kensington to a house that I had never seen before, a house since swept away by the flowing tide of flats, but I can still see every stone and slate of it as clearly as on that summer morning more than ten years ago. It stood just off the thoroughfare, in grounds of its own out of all keeping with their metropolitan environment; they ran from one side-street to another, and further back than we could see. Vivid lawn and towering tree, brilliant beds and crystal vineries, struck one more forcibly (and favourably) than the mullioned and turreted mansion of a house. And yet a double stream of omnibuses rattled incessantly within a few yards of the steps on which the three of us soon stood nonplussed. \\n\\n \\n\\n Mr. Edward had not been seen or heard of at the house. Neither had Miss Belsize arrived; that was the one consolatory feature. \\n\\n \\n\\n “Come into the library,” said Mr. Garland; and when we were among his books, which were somewhat beautifully bound and cased in glass, he turned to Raffles and added hoarsely: “There’s something in all this I haven’t been told, and I insist on knowing what it is.” \\n\\n \\n\\n “But you know as much as I do,” protested Raffles. “I went out leaving Teddy asleep and came back to find him flown.” \\n\\n \\n\\n “What time was that?” \\n\\n \\n\\n “Between nine and half-past when I went out. I was away nearly an hour.” \\n\\n \\n\\n “Why leave him asleep at that time of morning?” \\n\\n \\n\\n “I wanted him to have every minute he could get. We had been sitting up rather late.” \\n\\n \\n\\n “But why, Raffles? What could you have to talk about all night when you were tired and it was Teddy’s business to keep fresh for today? Why, after all, should he want to see you the moment you got back? He’s not the first young fellow who’s got rather suddenly engaged to a charming girl; is he in any trouble about it, Raffles?” \\n\\n \\n\\n “About his engagement — not that I’m aware.” \\n\\n \\n\\n “Then he is in some trouble?” \\n\\n \\n\\n “He was, Mr. Garland,” answered Raffles. “I give you my word that he isn’t now.” \\n\\n \\n\\n Mr. Garland grasped the back of a chair. \\n\\n \\n\\n “Was it some money trouble, Raffles? Of course, if my boy has given you his confidence, I have no right simply as his father —” \\n\\n \\n\\n “It is hardly that, sir,” said Raffles, gently; “it is I who have no right to give him away. But if you don’t mind leaving it at that, Mr. Garland, there is perhaps no harm in my saying that it was about some little temporary embarrassment that Teddy was so anxious to see me.” \\n\\n \\n\\n “And you helped him?” cried the poor man, plainly torn between gratitude and humiliation. \\n\\n \\n\\n “Not out of my pocket,” replied Raffles, smiling. “The matter was not so serious as Teddy thought; it only required adjustment.” \\n\\n \\n\\n “God bless you, Raffles!” murmured Mr. Garland, with a catch in his voice. “I won’t ask for a single detail. My poor boy went to the right man; he knew better than to come to me. Like father, like son!” he muttered to himself, and dropped into the chair he had been handling, and bent his head over his folded arms. \\n\\n \\n\\n He seemed to have forgotten the untoward effect of Teddy’s disappearance in the peculiar humiliation of its first cause. Raffles took out his watch, and held up the dial for me to see. It was after the half-hour now; but at this moment a servant entered with a missive, and the master recovered his self-control. \\n\\n \\n\\n “This’ll be from Teddy!” he cried, fumbling with his glasses. “No; it’s for him, and by special messenger. I’d better open it. I don’t suppose it’s Miss Belsize again.” \\n\\n \\n\\n “Miss Belsize is in the drawing-room, sir,” said the man. “She said you were not to be disturbed.” \\n\\n \\n\\n “Oh, tell her we shan’t be long,” said Mr. Garland, with a new strain of trouble in his tone. “Listen to this — listen to this,” he went on before the door was shut: “‘What has happened? Lost toss. Whipham plays if you don’t turn up in time. — J. S.’” \\n\\n \\n\\n “Jack Studley,” said Raffles, “the Cambridge skipper.” \\n\\n \\n\\n “I know! I know! And Whipham’s reserve man, isn’t he?” \\n\\n \\n\\n “And another wicket-keeper, worse luck!” exclaimed Raffles. “If he turns out and takes a single ball, and Teddy is only one over late, it will still be too late for him to play.” \\n\\n \\n\\n “Then it’s too late already,” said Mr. Garland, sinking back into his chair with a groan. \\n\\n \\n\\n “But that note from Studley may have been half-an-hour on the way.” \\n\\n \\n\\n “No, Raffles, it’s not an ordinary note; it’s a message telephoned straight from Lord’s — probably within the last few minutes — to a messenger office not a hundred yards from this door!” \\n\\n \\n\\n Mr. Garland sat staring miserably at the carpet; he was beginning to look ill with perplexity and suspense. Raffles himself, who had turned his back upon us with a shrug of acquiescence in the inevitable, was a monument of discomfiture as he stood gazing through a glass door into the adjoining conservatory. There was no actual window in the library, but this door was a single sheet of plate-glass into which a man might well have walked, and I can still see Raffles in full-length silhouette upon a panel of palms and tree-ferns. I see the silhouette grow tall and straight again before my eyes, the door open, and Raffles listening with an alert lift of the head. I, too, hear something, an elfin hiss, a fairy fusillade, and then the sudden laugh with which Raffles rejoined us in the body of the room. \\n\\n \\n\\n “It’s raining!” he cried, waving a hand above his head. “Have you a barometer, Mr. Garland?” \\n\\n \\n\\n “That’s an aneroid under the lamp-bracket.” \\n\\n \\n\\n “How often do you set the indicator?” \\n\\n \\n\\n “Last thing every night. I remember it was between Fair and Change when I went to bed. It made me anxious.” \\n\\n \\n\\n “It may make you thankful now. It’s between Change and Rain this morning. And the rain’s begun, and while there’s rain there’s hope!” \\n\\n \\n\\n In a twinkling Raffles had regained all his own irresistible buoyancy and assurance. But the older man was not capable of so prompt a recovery. \\n\\n \\n\\n “Something has happened to my boy!” \\n\\n \\n\\n “But not necessarily anything terrible.” \\n\\n \\n\\n “If I knew what, Raffles — if only I knew what!” \\n\\n \\n\\n Raffles eyed the pale and twitching face with sidelong solicitude. He himself had the confident expression which always gave me confidence; the rattle on the conservatory roof was growing louder every minute. \\n\\n \\n\\n “I intend to find out,” said he; “and if the rain goes on long enough, we may still see Teddy playing when it stops. But I shall want your help, sir.” \\n\\n \\n\\n “I am ready to go with you anywhere, Raffles.” \\n\\n \\n\\n “You can only help me, Mr. Garland, by staying where you are.” \\n\\n \\n\\n “Where I am?” \\n\\n \\n\\n “In the house all day,” said Raffles firmly. “It is absolutely essential to my idea.” \\n\\n \\n\\n “And that is, Raffles?” \\n\\n \\n\\n “To save Teddy’s face, in the first instance. I shall drive straight up to Lord’s, in your brougham if I may. I know Studley rather well; he shall keep Teddy’s place open till the last possible moment.” \\n\\n \\n\\n “But how shall you account for his absence?” I asked. \\n\\n \\n\\n “I shall account for it all right,” said Raffles darkly. “I can save his face for the time being, at all events at Lord’s.” \\n\\n \\n\\n “But that’s the only place that matters,” said I. \\n\\n \\n\\n “On the contrary, Bunny, this very house matters even more as long as Miss Belsize is here. You forget that they’re engaged, and that she’s in the next room now.” \\n\\n \\n\\n “Good God!” whispered Mr. Garland. “I had forgotten that myself.” \\n\\n \\n\\n “She is the last who must know of this affair,” said Raffles, with, I thought, undue authority. “And you are the only one who can keep it from her, sir.” \\n\\n \\n\\n “I?” \\n\\n \\n\\n “Miss Belsize mustn’t go up to Lord’s this morning. She would only spoil her things, and you may tell her from me that there would be no play for an hour after this, even if it stopped this minute, which it won’t. Meanwhile let her think that Teddy’s weatherbound with the rest of them in the pavilion; but she mustn’t come until you hear from me again; and the best way to keep her here is to stay with her yourself.” \\n\\n \\n\\n “And when may I expect to hear?” asked Mr. Garland as Raffles held out his hand. \\n\\n \\n\\n “Let me see. I shall be at Lord’s in less than twenty minutes; another five or ten should polish off Studley; and then I shall barricade myself in the telephone-box and ring up every hospital in town! You see, it may be an accident after all, though I don’t think so. You won’t hear from me on the point unless it is; the fewer messengers flying about the better, if you agree with me as to the wisdom of keeping the matter dark at this end.” \\n\\n \\n\\n “Oh, yes, I agree with you, Raffles; but it will be a terribly hard task for me!” \\n\\n \\n\\n “It will, indeed, Mr. Garland. Yet no news is always good news, and I promise to come straight to you the moment I have news of any kind.” \\n\\n \\n\\n With that they shook hands, our host with an obvious reluctance that turned to a less understandable dismay as I also prepared to take my leave of him. \\n\\n \\n\\n “What!” cried he, “am I to be left quite alone to hoodwink that poor girl and hide my own anxiety?” \\n\\n \\n\\n “There’s no reason why you should come, Bunny,” said Raffles to me. “If either of them is a one-man job, it’s mine.” \\n\\n \\n\\n Our host said no more, but he looked at me so wistfully that I could not but offer to stay with him if he wished it; and when at length the drawing-room door had closed upon him and his son’s fiancee, I took an umbrella from the stand and saw Raffles through the providential downpour into the brougham. \\n\\n \\n\\n “I’m sorry, Bunny,” he muttered between the butler in the porch and the coachman on the box. “This sort of thing is neither in my line nor yours, but it serves us right for straying from the path of candid crime. We should have opened a safe for that seven hundred.” \\n\\n \\n\\n “But what do you really think is at the bottom of this extraordinary disappearance?” \\n\\n \\n\\n “Some madness or other, I’m afraid; but if that boy is still in the land of the living, I shall have him before the sun goes down on his insanity.” \\n\\n \\n\\n “And what about this engagement of his?” I pursued. “Do you disapprove of it?” \\n\\n \\n\\n “Why on earth should I?” asked Raffles, rather sharply, as he plunged from under my umbrella into the brougham. \\n\\n \\n\\n “Because you never told me when he told you,” I replied. “Is the girl beneath him?” \\n\\n \\n\\n Raffles looked at me inscrutably with his clear blue eyes. \\n\\n \\n\\n “You’d better find out for yourself,” said he. “Tell the coachman to hurry up to Lord’s — and pray that this rain may last!” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/lizhi/1007/30321.html","bookId":249,"book":{"id":249,"title":"Mr. Justice Raffles","description":"简介： Raffles had vanished from the face of the town, and even I had no conception of his whereabouts until he cabled to me to meet the 7.31 at Charing Cross next night. That was on the Tuesday before the \u0027Varsity match, or a full fortnight after his myste...","cover":"http://novel.tingroom.com/file/upload/201404/08/14-46-55-33-1.jpg","type":"Inspirational","link":"http://novel.tingroom.com/lizhi/1007","creation":"Aug 1, 2019 12:18:27 AM","modification":"Aug 1, 2019 12:18:27 AM"}}
