{"id":89705,"no":34,"title":"Page 34","content":"“I’m sure that ghosts have lingered much longer,” Angela said. “Sometimes they’re just waiting to be freed. And, I imagine, sometimes they like being ghosts and doing what they can for the living. God knows, I don’t have all the answers.” “But—you talk to ghosts!” Ashley said. Angela smiled. “Yes, but you see—they don’t have all the answers, either. This direction we’re riding in—it’s toward the bayou and the plantation next door?” “Yes, our best trails are out this way toward the bayou. Just past the outbuildings on the other side, it all turns into barbed wire for the sugar fields.” “There have to be gators out here,” Whitney commented. “There are. We leave them alone, they leave us alone,” Ashley told her. “And you’ll only see them when we’re right on the bayou. They seldom venture as far as the riding trails. They like their watery habitat.” “Alligators. Ugh,” Jenna said, shuddering. “To tell you the truth, we worry more about the snakes,” Ashley told her. “Oh, great! It might be about time to head back, eh, friends?” Jenna said. “Just a bit farther, please,” Angela said. “I want to see the Creole plantation.” “The bayou is between our property and Beaumont,” Ashley told her. “That’s all right. I just want to see it from here,” Angela said. “It’s just up ahead. There’s a twist in the trail that goes right down by the bayou,” Ashley said. “You’ll be able to see it from across the water there.” Jake parked in front of Beaumont. It was an entirely different place from Donegal Plantation, not as grand, and there was no canopy of oaks along a sweeping front drive. By car, the house was reached by a massive gravel parking lot in front. Wooden fencing surrounded the residence itself, which was only two stories. Jake had been in Beaumont himself, and he found it as fascinating as Donegal, just different. Here workrooms and space for the animals had once taken up the first floor, or raised basement, while the household had always lived in the second floor. Like many of the other plantations, Beaumont had been a working sugarcane farm, and the outbuildings remained as they had been, important parts of the tours that were given here. The Creole way of life, rather than that of the English planter, held sway here. Toby Keaton had inherited the house through his mother’s side of the family. She had been a Thibadeux, from an old French family. His father, whose family line also went back for generations, had hailed from the English who had settled in the Garden District of New Orleans. Toby had been divorced for years; his one son, now in college, was being groomed to take over the family business when Toby grew weary of it…or willing to give up being the one in charge. Jake could remember meeting Josiah Keaton; he had been a handsome yet solemn young teen when he had last seen him, aware of the responsibility that would one day be his. “Intriguing place,” Jackson said, sliding his sunglasses down on his nose as they emerged from the car. “Toby runs a good business,” Jake said. “He and Frazier have always supported one another.” Jackson looked at him. “But Donegal Plantation has become a bed-and-breakfast. Beaumont has to be doing better.” Jake shrugged. “It pulls in a higher gross, yes. But the expenses are higher, too.” “Still, Toby Keaton could want Donegal to go down. And last night, when you went after Ashley, the man made an appearance in the dark—on the other side of the bayou.” “True,” Jake said. Before the path that led to the house there was a little kiosk where tickets could be bought. A woman wearing French Creole Empire–style clothing, circa 1820, was behind the counter. “Hello,” Jake said. He flashed his badge; he didn’t know her. She was young and had probably taken work here to get through school herself. “We’re looking for Mr. Keaton. Can you tell me where to find him?” “I wish!” she said irritably. “He hasn’t been around this morning—and he’s supposed to be handing out paychecks. His car is here, but he is not.” “He lives here,” Jake said politely. “He has to be somewhere.” He pointed to an overhang in the parking area; there was a shiny new Honda parked there. “Is that his car?” he asked. “Yes.” She flushed, looking at Jake. “I’m sorry, Officer. I just don’t know where he is. I’ve tried his cell phone, but he wasn’t answering. I opened the sales window at ten, just as I’m supposed to do. Everyone who is supposed to be here working is—you can ask Dan out by the field, or Martha, who gives the tours up at the house. Maybe one of them has seen him.” Jake glanced at Jackson and thanked the girl. They walked up to the house, where a costumed interpreter—Martha, he assumed—met them at the door. “The next tour starts in thirty minutes,” she said cheerfully. “You’re welcome to explore the grounds while you wait.” Once again, they produced their badges. “Oh, dear!” Martha said. “What’s wrong? Oh, is this about poor Mr. Osgood?” “We need to speak with Mr. Keaton,” Jake said. “I wish I could help you, sir. Mr. Keaton hasn’t checked in with any of us this morning.” “Is that unusual?” Jackson asked. “Well, yes, of course. He is a hands-on man where business is concerned,” she said. She was thoughtful. “Well, of course, there was the morning after he’d met with a few of his cronies, and we found him passed out in one of the rooms we show. It was rather frightening. We have mannequins in that room to add to the historical setting, and there was the monsieur, the madame, the jeune fille—and Mr. Keaton, all messed up and on the bed between them all! My poor guests—” “He’s not there now, you’re certain, is he?” Jake interrupted. “Oh, no! I’ve had several tours through the house already today!” she said. “But I don’t suppose that anyone has searched all the outbuildings. There isn’t a guide stationed in every one. We have a girl who comes in at ten—” “Excuse me. I understand there’s someone in the field we might talk to?” Jake interrupted again. “Oh, yes, silly me, I do go on. I can see Dan now—he’s in the straw hat, over down by that wheelbarrow.” “Thank you,” Jake told her. He felt a growing concern as he and Jake walked down the expanse of sloping lawn to find Dan, a tall, muscular, African-American man sorting through an enormous pile of produce. Jake remembered Dan, though he doubted that Dan would recognize him. But Dan did. “Is that you, Jake Mallory? Sad things going on, sad things! Why, I remember you riding like wildfire all over that big plantation next door,” the man said to him, giving Jake a brief hug. “Good to see you again,” Jake said. “We’re here looking for Mr. Keaton.” “So am I,” Dan said. “Paychecks are due today, and if you don’t remind that man, he doesn’t remember to pay us.” “Do you mind if we start searching for him? Have you been in all the outbuildings today?” “I gave tours in the old kitchen and the smokehouse. I have been in all the slave quarters. They should be open, though. Martha walked around and unlocked them as soon as we came in and saw that Toby wasn’t around.” “Thanks, Dan.” “I’ll give you a hand, if you need,” Dan offered. “That’s fine, Dan. It won’t take us long,” Jake assured him. “You seem busy.” “I’d like to get these to the kitchen, but if you need me, just holler.” They started for the row of old wooden slave quarters. But before they reached the first, a bloodcurdling scream stopped them in their tracks. It came from the other side of the bayou. The scream was followed by a volley of gunshots. 11 Ashley had heard the grunting long before they’d reached the bayou. “What in the Lord’s name is that?” Angela demanded. “Gator,” Ashley told her. “Sometimes it sounds like you stumbled upon an entire pig farm. That’s the noise alligators make.” “Should we come any closer?” Whitney asked. “We’re fine. We just stay on the road and make sure that we don’t bother them. Remember, we don’t bother them, and they don’t bother us. They’re really not insane predators chasing everything that moves,” Ashley said. “They can move on land, and move fast, but, usually, they hunt in the water. They wait for their opportunity, and they snap, and then twist and turn in the water, drowning their prey. They’re as instinctive as other predators—they don’t want an eye gouged out by a flailing claw or the like. If you go to any of the gator parks, you’ll hear them sound like that when it’s mating season, or when an employee is about to hand out the chickens—dead, of course.” She was in the lead, but Whitney was right behind her. Ashley had twisted in her saddle to speak, and so she didn’t know what Whitney saw when her eyes suddenly went wide and a scream escaped her lips. Ashley turned back; she didn’t scream. She let out a gasp of horror and pulled out the shotgun she had opted to bring along on the trail. She could see why the gators were going crazy. They had been fed. Some were on the embankment; some thrashed in the water, adolescents and adults, maybe eight to ten in total. It was difficult to tell, because they were snapping at one another, the large ones going after the smaller ones. But they were all hungry for human flesh. A number of the beasts had already started in on the bodies; it almost appeared that they had been playing with mannequins. The two bodies in the water were muddied and mangled beyond description, certainly, at this point, past any sense of pain or horror. It was impossible to tell if they’d been dead when they’d been discovered by the alligators, or if the gators had gone entirely mad and attacked two human beings.","sourceLink":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2/page-34.html","bookId":2276,"book":{"id":2276,"title":"Heart of Evil (Krewe of Hunters #2)","description":"Storyline: Heart of Evil (Krewe of Hunters #2) Emerging from the bayou like an apparition, Donegal Plantation is known for its unsurpassed dining, captivating atmosphere, haunting legends... and now a corpse swinging from the marble angel that marks its cemetery\u0027s most majestic vault. A corpse discovered in nearly the same situation as that of Marshall Donegal, the patriarch killed in a skirmish just before the Civil War. Desperate for help traditional criminologists could never provide, plantation heiress Ashley Donegal turns to an elite team of paranormal investigators who blend hard forensics with rare — often inexplicable — intuition. Among the \"Krewe of Hunters\" is an old flame, Jake Mallory, a gifted musician with talent stretching far beyond the realm of the physical, and a few dark ghosts of his own. The evil the team unveils has the power to shake the plantation to its very core. Jake and Ashley are forced to risk everything to unravel secrets that will not stay buried — even in death.","cover":"https://allnovel.net/images/heart-of-evil-krewe-of-hunters-2.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:36:43 PM"}}
