{"id":89706,"no":35,"title":"Page 35","content":"Usually, upon discovering large dead prey, an alligator would drag it around until decomposition and the water softened down the bones, but when they started fighting over prey, it was like a scene out of a horror movie. The bodies might have been toys being ripped apart by children; the snapping jaws landed on limbs, and they were ripped cleanly away. Ashley took aim at the head of a large adult, aiming right between the eyes. Her shot was true; the jaws clamped shut, but then the gator began to sink. Behind her, Angela was taking aim with her pistol. Ashley shouted, “The eyes! Strike between the eyes!” Luckily, the horses had grown up around hunters, and though Varina had thrown her before, the sound of the gun didn’t bother any of the horses. Ashley emptied the second barrel of her shotgun, horrified at what she was seeing and equally horrified that she was killing so many of the beasts who were only acting as nature intended; she felt a sinking certainty that the alligators hadn’t attacked standing adults. They wouldn’t have needed to, and they wouldn’t have attacked unless an idiot had gone with food and become part of it. They would, as they were doing, go for a tasty morsel of meat that was dead and decomposing. Angela was shooting with a pistol, and her shots riddled the air as Ashley reloaded. The scent of dead alligators mingled with that of ripped flesh—and more fights erupted, but the sound of the shots was finally entering into their lima-bean-sized brains, and they began to move off at last. Ashley and Angela stopped shooting. Whitney, as stunned and shaken as the rest of them by the bizarre and horrible spectacle, fumbled for her cell phone. But before she could dial with her trembling fingers, they heard shouts. Across the bayou, men burst through the trees. Jake and Jackson were followed by Dan, Toby Keaton’s manager. He was armed with a shotgun, while Jake and Jackson had drawn pistols. They didn’t need to fire; they clearly saw the carnage, and it was evident that they were equally stunned and appalled by the sight. “Ashley! I’m getting the bodies out. Cover me,” Jake shouted, his voice stretching across the thirty feet of muck and water. He stared at the women on the horses, and back to the water, at the gators now whipping their tails to escape, and back to the dead creatures, floating absurdly between what remained of the human corpses. He started into the water. “Jake!” Jackson roared. Jake looked up. “I know what I’m doing, Jackson. Aim for the head, the eyes if you can, if anything starts to come near me.” “Jake, don’t!” Ashley screamed. But even Jackson seemed to know that Jake was right and motioned him forward. To discover anything—who the mangled bodies had been—they had to get them out of the bayou. Now. Jake, maintaining a grasp on his pistol, walked carefully into the slick muddy water of the bayou, and seemed to sink into it slowly. The deepest water here was about five feet; his head was still above water when he pushed his way past a dead alligator and reached the first body. Grasping it around the shoulder with his one hand, still watchful of any movement near him, he eased back to the bank with it. Watching, Ashley still couldn’t tell if the mud encrusted pile of death was male or female. She could see that it was missing limbs. She wiped sweat from her brow, barely blinking, watching the water for any sign of movement. An alligator could have been lurking below and heading out to strike beneath the surface, but there was no way for the great jaws to snap shut on a standing man unless the beast twisted and turned, and she would see that motion. She heard Whitney chanting behind her. “Jake, come on, Jake, Jake, Jake….” He went back for the second body while Jackson and Dan pulled the first up the bank. Dan was already on the phone, Ashley saw out of the corner of her eye. Help would be coming soon. Not soon enough for those being dragged from the bayou…. She saw a ripple in the water twenty feet from Jake. There was no way to take aim between the eyes, so she calculated a few feet before the ripple and shot, and then shot again. Willing herself not to fumble, she tore at the packaging of a cartridge and loaded again. But the ripple bobbed to the surface; she’d made a clean kill, and Jake grasped the remains of the second body and dragged it to the embankment. As he crawled out, Jackson reached down to drag him from the water and up the slick, muddy embankment. He stood up; his eyes met hers across the water, but he wasn’t smiling. He was grim. “We found Toby Keaton,” he said dully, his voice barely carrying across the water. “God in Heaven! God in his Heaven!” Augie breathed, looking at the corpses. Jake knew, of course, that finding a corpse in situ was the best possible place for a medical pathologist to first encounter a murder victim, but if they hadn’t intervened, there might not have been actual body parts to be discovered. Toby Keaton was already missing a lower leg and his left arm, and the woman—Marty Dean, of all people—had lost her right arm to the shoulder and was missing a calf and foot on the opposite leg. Lain out, high on the grassy embankment of Beaumont, they formed pieces of a grisly human puzzle. Ashley, Angela, Jenna and Whitney had described their discovery of the bodies—and the gators—once the authorities had arrived and ridden back to Donegal Plantation. “Can you tell me how they died?” Jackson asked Augie. Augie, down on his knees near the heads, looked up at Jackson. “Are you kidding me?” he asked. “I don’t think they were killed by the gators,” Jake said. “I agree, but I’m going to have to get them back to the office to determine an exact cause.” He indicated the places where flesh had been torn away. “These pieces have most probably been consumed, but I’m not seeing a blood flow on the bodies or in the water that would indicate that their hearts were still pumping when the alligators attacked, and liver temperature suggests that they’ve been dead for hours—twelve to twenty-four—but they’ve been in the bayou, so that can mess with temperature. I’m not seeing any gunshot wounds or slashes that look as if they were made by anything but giant snapping jaws. Frankly, I wouldn’t trust any of my own findings in these circumstances until I’ve had time at autopsy. Jesus! Jesus, Mary and Joseph!” Augie finished, crossing himself. “Might be the same, though,” Augie added after a moment. “Same as what?” Jackson asked sharply. “I found massive doses of benzodiazepine—a sedative—along with chlorzoxazone—a muscle relaxant—in Charles Osgood’s body. I believe that Charles was held unconscious and controlled by the two drugs until he was taken, still unconscious, to be killed at the site in the cemetery.” Jake looked at Jackson; they both held silent. Drugs were involved. Either they might start looking at M.D.s or pharmacists—or at robberies of pharmacies and doctor’s offices. Such as the offices of Dr. Ben Austin? Jake decided to see what else Augie could tell them before assuming that these two had been killed the same way. Mack Colby arrived. Both Jackson and Jake stared at him across the gruesome display of the bodies. “Hey, Doc, help me out here!” the detective protested. “We just received the reports when we were called out here. Throw us a bone, here, please. Help in any way you can.” “I’m doing my best—with what I’ve got,” Augie said. “Those reports were sent to you, too, Mr. Crow,” he said. “I emailed you a copy of my findings just about an hour ago.” Jackson nodded. Jake said, “Thanks.” “So?” Mack Colby asked. “It isn’t death by drowning, and it’s no damned accident, I’m certain,” Colby said. “So, do we proceed with this as a dual investigation as well?” he asked. “We would certainly appreciate continuing so, since Mr. Keaton has been a suspect in our existing joint investigation,” Jackson said. “Hey!” They heard a shout from one of the uniformed officers who had been searching the surroundings on the Donegal side of the bayou. “I’ve got a shotgun here,” the officer cried. He was down near the water and holding up the weapon with a gloved hand. “Probably Toby’s,” Dan offered. His dark eyes were red-rimmed; he might have had a few arguments with his employer, but it was obvious he had cared. “How the damned hell did someone get to Toby when he always went out with his shotgun?” “Maybe he saw someone he thought was a friend,” Jackson suggested. Dan’s lips pursed. “You don’t have to stand here seeing this anymore,” Jake said. “I’m just waiting for gator season,” he said gruffly. “Can’t blame a wild creature for acting like a wild creature,” Augie said, standing and placing a hand on Dan’s arm. “There was most certainly a human monster involved in this, and rest assured, the law will take care of him.” “We won’t stop,” Jake said as Dan looked at him. “Hope you find him first,” he said quietly. Jake hoped they did, too; the man was extremely tall, but he was pure muscle. And that kind of muscle combined with pain and fury could be dangerous. “You’re a good man. Don’t go trying to solve this yourself. There is no such thing as a righteous kill. You’ll wind up in prison,” Jake told him. Dan lifted his hands. “Where do we go from here?” he asked quietly. “You keep the place running for Toby’s son,” Jake told him. “Close her down for a few days. We have to get to the bottom of this,” barked Colby. “I live here, too, in one of the old smokehouses,” Dan said. “That’s fine. You stay on. But we’ll need a few days of traipsing around here,” Colby told him. He shook his head in disgust. “A bayou. A damned bayou filled with snakes and gators. Not easy to find much around here.” He looked at Jake and Jackson. “Hell, boys, you are truly welcome to this mess!”","sourceLink":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2/page-35.html","bookId":2276,"book":{"id":2276,"title":"Heart of Evil (Krewe of Hunters #2)","description":"Storyline: Heart of Evil (Krewe of Hunters #2) Emerging from the bayou like an apparition, Donegal Plantation is known for its unsurpassed dining, captivating atmosphere, haunting legends... and now a corpse swinging from the marble angel that marks its cemetery\u0027s most majestic vault. A corpse discovered in nearly the same situation as that of Marshall Donegal, the patriarch killed in a skirmish just before the Civil War. Desperate for help traditional criminologists could never provide, plantation heiress Ashley Donegal turns to an elite team of paranormal investigators who blend hard forensics with rare — often inexplicable — intuition. Among the \"Krewe of Hunters\" is an old flame, Jake Mallory, a gifted musician with talent stretching far beyond the realm of the physical, and a few dark ghosts of his own. The evil the team unveils has the power to shake the plantation to its very core. Jake and Ashley are forced to risk everything to unravel secrets that will not stay buried — even in death.","cover":"https://allnovel.net/images/heart-of-evil-krewe-of-hunters-2.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:36:43 PM"}}
