{"id":89707,"no":36,"title":"Page 36","content":"\\n\\n By the time they returned to Donegal Plantation, it was already late afternoon. The officer had brought the shotgun over to Beaumont, and Dan had positively identified it as belonging to Toby. Toby’s little bayou-crossing aluminum boat was still on the bank on the Donegal side of the water as well; he had never made it back to his own property the night before.\\n\\n Jake described his last meeting with Toby in the woods, repeating information he had already given Jackson to Mack Colby.\\n\\n “Where the hell does the reporter woman fit into it all? What was she doing out there? High-heeled type out by the bayou—makes no sense!” Mack said.\\n\\n “She was lured,” Jake said slowly. “Someone lured her out on purpose.” He paused, remembering what Ashley had told him the night before. She’d been frightened; she’d been up a tree. And she had seen someone below her. Toby—they had all assumed.\\n\\n It had been the killer.\\n\\n He felt an inner trembling and became anxious to return to the house and to the rest of the group. There hadn’t been much for the women to explain at the scene. They had come upon the feeding frenzy and shot at the alligators to get the creatures away from the bodies. Not even Colby had seen a reason to make them linger with the corpses.\\n\\n Back at the house, he quickly sought out Ashley—even before heading to the shower.\\n\\n Ashley, however, was showing her mettle. He found her sitting at the dining-room table with Angela, going over everything that had happened on the day of the reenactment. When Jake and Jackson came in, both women looked at them gravely.\\n\\n “I’m sorry. I know Toby was your neighbor and a friend,” Jake said.\\n\\n Ashley nodded. “And I’m sorry about your friend. The reporter—I didn’t know her.”\\n\\n “Well, I’m sorry, too, but we weren’t actually friends. She was in my high school class.”\\n\\n Jackson and Angela were both there, and Jake held his reserve. But he asked softly, “Are you all right?”\\n\\n “I’m fine. I’m angry. Someone is trying to destroy all of us,” Ashley said.\\n\\n Her eyes were level with his. She was just fine. She hadn’t lost her cool for a minute when he had gone into the water, and though Angela was a crack shot, he had depended on Ashley; she knew the terrain and the ancient beasts better than anyone.\\n\\n She was going to do all right.\\n\\n Jake grimaced. “I’m going to shower,” he said.\\n\\n “This certainly sounds strange after…today,” Ashley said. “But…it’s almost dinner. We’re having a vegetarian pasta dish, Beth decided.”\\n\\n Jake nodded and left the room, going upstairs.\\n\\n He was surprised, yet not really, when Ashley appeared ten minutes later; she slipped into the shower behind him and wrapped her arms around his waist, resting her head against his back. He set his hands on hers, and they listened to the beat of the water and felt the steam around them for a minute. Then he turned and took her into his arms.\\n\\n He kissed her; they touched and kissed in the hard spray for a long time.\\n\\n “Is this horrible?” she whispered.\\n\\n “No. It’s life-affirming,” he replied.\\n\\n They made love quietly, and then more passionately, beginning in the heat and steam of the clear, clean water and ending up on the softness of the bed, entwined in one another’s arms.\\n\\n When they were done, her eyes were closed, and he leaned on an elbow looking down at her. She smiled slowly, a little wistfully, somehow feeling his gaze.\\n\\n Her eyes opened.\\n\\n “You used to do that all the time,” she told him.\\n\\n “What?”\\n\\n “Watch me. It’s a bit unnerving, you know.”\\n\\n He kissed her lips lightly. “I used to watch you and wonder that you were with me.”\\n\\n She was quiet, not meeting his eyes, staring up at the ceiling. “That’s crazy. It was a wonder that you were with me.”\\n\\n “You were the one who ended it.”\\n\\n “I was…scared.”\\n\\n “Of me?”\\n\\n “Of what you seemed to know,” she said.\\n\\n He pulled her to him. “And are you still scared? Nothing about me has changed.”\\n\\n “But something about me has.” She rolled away from him and rose. “It’s going to be time to eat, and as awful as it seems after today, my stomach is beginning to growl fiercely.”\\n\\n He nodded. “It’s just biology.”\\n\\n She reached for her jeans, closing her eyes briefly. He could clearly imagine the pictures in her mind; he had seen them, too.\\n\\n She looked at him and tried to smile. “Get up! They’ll all know where we are and what we’re doing, but I’d just as soon they don’t have to come find us.”\\n\\n “They know?” he said, frowning.\\n\\n “Cameras, remember?”\\n\\n He groaned softly; he hadn’t thought of that aspect.\\n\\n “Well, they’ll know we’re safe together, and these days, that’s a good thing. I just feel a little guilty….”\\n\\n “Because of me?”\\n\\n “Because of Frazier.”\\n\\n Her grin turned real. “If we weren’t in the middle of a horrible mystery, I’d even suspect that Frazier knew exactly what you were doing and who you were working for—and called Adam just to get you back here.” She paused and kissed him lightly on the lips. “Come on down, Mr. Mallory, please.”\\n\\n Buttoning her blouse, she headed for the door.\\n\\n He watched her go, worried. Images flashed through his mind.\\n\\n Charles Osgood, hanging from the statue.\\n\\n Toby Keaton and Marty Dean…what was left of them.\\n\\n He stared at the ceiling, trying to let the logic in his mind take over. Toxicology reports would affirm, he was certain, that both victims had received a similar cocktail to that which had been given to Charles Osgood to keep him compliant until the time of his death.\\n\\n This time, though, it seemed that the killer hadn’t had any intention of keeping his victims alive for long. He had probably discovered that a good shot of his drug cocktail immediately disabled his victims.\\n\\n He knew, just as predatory alligators did, that he could be hurt himself in a fight. That was why alligators drowned their prey; they disabled them before they could be attacked in turn.\\n\\n The killer was basically a coward. But he was changing his method, like a man with an agenda. He didn’t fit the profile of a killer who sought out a certain type of victim; he didn’t molest his victims. He was there for the kill itself, and it was beginning to look like the kill itself was the goal.\\n\\n Jake’s head jerked up. A killer who had started with an agenda, and now had discovered how much he liked killing.\\n\\n He would hunger for more and would strike again. Eventually, his need would make him careless. Eventually—but how many would have to die first?\\n\\n Downstairs, Ashley found Will and Whitney speaking quietly to one another as they watched the monitors. Jackson, Angela and Jenna were holed up in the study with Frazier. Cliff hadn’t come in yet, and Beth was watching her marinara sauce simmer.\\n\\n “Ten minutes,” Beth told her. She shivered, looking back at the stove.\\n\\n Ashley decided that she’d take a walk up to the attic.\\n\\n There, she looked around. They were definitely going to need all their household help back when the killer was caught, she decided. Black dust covered just about everything; all the cases that held family bibles, period weapons, jewelry, buttons and other odd objects that had been owned by the family over the years.\\n\\n She walked over to the empty case, wondering whether they would get the Enfield back, and then wondering if she wanted it back.\\n\\n She felt someone behind her and turned quickly, but there was no one there.\\n\\n “Marshall?” she asked.\\n\\n But her ancestor didn’t appear. A sense of discomfort and aloneness filled her. She had never felt so in her own house. She hurried back out to the small attic hallways and made her way down the narrow wooden stairs.\\n\\n As she walked toward the grand staircase that led to both parlors, she paused. She saw that her ghost was now making an appearance before her on the landing.\\n\\n There was no one on the second floor then; Jake’s door—the door to the Jeb Stuart room—was open, but no one was inside.\\n\\n She walked up to Marshall, who looked tormented.\\n\\n “Were you just in that room behind me, trying to scare me?”\\n\\n “No. Why would I try to scare you?”\\n\\n “Well, I don’t know. You led me out last night to show me the gravestone, and I might have been killed.”\\n\\n “Good God, I didn’t know anyone was in the woods. And what descendant of mine would fall off a horse? You should be a better rider, young woman,” he said gruffly.\\n\\n “Did you see anything last night?” she demanded.\\n\\n “You,” he said softly.\\n\\n “Me?”\\n\\n “I followed you when I heard the thud.”\\n\\n “You’ve heard what happened today, of course.”\\n\\n “Of course. I’m damned good at being a ghost. My senses are highly attuned,” he informed her indignantly.\\n\\n “I might have been killed!” she told him.\\n\\n “Indeed. So you must cease behaving so senselessly.”\\n\\n “But you led me out! What good are you doing me?” she asked him. “Other than making me talk to myself—or my imagination, or whatever is going on.”\\n\\n “I will protect you—even from yourself!” he vowed valiantly.\\n\\n “And you weren’t behind me in the attic?” she demanded again.\\n\\n He looked toward the stairs. She was startled by the look of agony that seemed to come over his misty countenance.\\n\\n “No. I—I can’t go in the attic,” he said.\\n\\n “What?”\\n\\n “I can’t go in the attic!” he repeated. “Leave it be, damn you. I can’t go in the attic!”\\n\\n He must have been really angry with her; he disappeared in a blink.\\n\\n “I’m sane, and I have a ghost,” she mused. “Or I’m totally insane. Or my mind is trying to make me recall something.”\\n\\n As she walked down the stairs, she wondered if she had ever heard a story about Emma having had an affair with an ex-slave and producing the child who would be one of Cliff’s ancestors. \\n\\n","sourceLink":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2/page-36.html","bookId":2276,"book":{"id":2276,"title":"Heart of Evil (Krewe of Hunters #2)","description":"Storyline: Heart of Evil (Krewe of Hunters #2) \\n Emerging from the bayou like an apparition, Donegal Plantation is known for its unsurpassed dining, captivating atmosphere, haunting legends... and now a corpse swinging from the marble angel that marks its cemetery\u0027s most majestic vault. A corpse discovered in nearly the same situation as that of Marshall Donegal, the patriarch killed in a skirmish just before the Civil War. \\n Desperate for help traditional criminologists could never provide, plantation heiress Ashley Donegal turns to an elite team of paranormal investigators who blend hard forensics with rare — often inexplicable — intuition. Among the \"Krewe of Hunters\" is an old flame, Jake Mallory, a gifted musician with talent stretching far beyond the realm of the physical, and a few dark ghosts of his own. \\n The evil the team unveils has the power to shake the plantation to its very core. Jake and Ashley are forced to risk everything to unravel secrets that will not stay buried — even in death.\\n","cover":"https://allnovel.net/images/heart-of-evil-krewe-of-hunters-2.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:36:43 PM"}}
