{"id":89680,"no":9,"title":"Page 9","content":"\n Officer Montague left, mollified by Frazier Donegal over the fact that he had been called out on a ridiculous mission.\n “I’m sorry,” Ashley said to the others. The evening had started out as a party and turned into a search committee.\n “Hey,” Cliff said, grinning, “I don’t have far to go home.”\n “We’re staying in the stables anyway, kid,” Justin Binder told her. He had played a Yankee, and happily. His family hailed from Pennsylvania.\n Griffin laughed and gave her an affectionate hug. “You made me sober up, which is good. I am driving.”\n “Me, too,” John Ashton said. He held her shoulders and kissed her cheek. “Charles is just fine. I’m sure of it.”\n She thanked them all and said good-night, and they drifted away, some to the old outbuildings where they were staying, and some to their cars, parked in the lot out front and down the road.\n She stood on the porch with Beth and her grand-father. She couldn’t tell whether they thought she was being ridiculous or not, they were both so patient.\n Beth gave her a kiss on the cheek and said, “We still have about sixteen guests, and the household. I’ve got to get up early to whip up our spectacular plantation breakfast.”\n Ashley bid her good-night. It was down to her grandfather and herself, and Frazier was going to wait for her to be ready to head off to bed.\n “Something is wrong. I can feel it, Grampa,” she said.\n He set an arm around her shoulder. “You know…I have an old friend. I’ve been meaning to call him for a long time—tonight seems a good time to have a chat with him. If Charles really is gone, he may be able to help us. His name is Adam Harrison. I don’t know if you remember meeting him—I see him up in Virginia and D.C. sometimes. He worked for private concerns for many years, finding the right investigators for strange situations. Then the government started calling him, and his projects were all kind of combined for a while, civilian and federal. But he’s got a special unit now, and he’s got federal power behind him on it. His people are a select group from the Behavioral Analysis Unit of the FBI. I’ll give him a call. We’ll get someone out here to help by tomorrow. And if Charles turns up, no harm done.”\n She lowered her head. Adam Harrison. She knew the name. His unit had been involved in solving the death of Regina Holloway—it had been all over the media because she was a senator’s wife. And she knew, too, that Jake Mallory was part of that unit. She might not be a part of his world, but she hadn’t been able to miss it when she’d seen his name in the papers. She had broken off something that had been real with Jake, because he had terrified her…because he was certain that he had spoken with her father, after he had died. And now….\n Now Frazier was going to call Adam. Of course, it could come to nothing. She was panicking over a missing man because of an equally irrational dream.\n She looked out on the beautiful expanse of their property. The river rolling by. The moon high over the clouds. The vaults in the cemetery silent and ghostly and opalescent in the pale glow of night.\n Jake, I’m so…scared.\n Something was wrong. It was the oddest thing; she felt that she really understood the expression I feel it in my bones. Something wasn’t right about Charles’s disappearance, and she knew it.\n It was almost as if the past had truly merged into this eerie and haunting reality, and the collision of time here was not going to go away.\n Interlude\n He’d known for a long time what he’d had to do. The voice had been telling him for years.\n At first, of course, he had ignored it. The vision he’d seen of the past hadn’t been real. But then he’d known. He’d known who he was, and he’d come to know that the voice wouldn’t go away until he’d done what needed to be done. And he’d carefully planned it all out, though things had gone a bit strangely today. Didn’t matter, though, who was playing Marshall Donegal. It didn’t matter at all. Because, of course, an actor was just an actor.\n It was Donegal Plantation itself that needed to repay the old debt. That old debt could only be repaid one way.\n With blood.\n God bless a crowd. There was nothing in the world like mayhem, nothing like hundreds of witnesses to pull off an escapade such as he had planned, and to do it perfectly.\n There had been a horde surrounding them. One particular brunette was the right age, exceptionally pretty and with a Massachusetts accent. When she spoke, there was an r on the name Linda, and there was no r on the car she had “pahked” down the river road.\n She had giggled when she spoke to Charles, so it was easy to whisper in the man’s ear in his moment of greatest achievement and convince him that the girl was waiting to meet him.\n And in the madness surrounding everyone engaged in the action then, it was easy enough to meld into the crowd himself, and to swiftly disappear, and hurry to the river road.\n And there was Charles.\n He’d approached Charles with a smile.\n And, of course, Charles was smiling as well. At least he would go in a state of sheer happiness. It might even be a kindness. How many people got to die that happy?\n Poor, dumb Charles—he never suspected a thing. After the initial whack, he never even felt the prick of the needle.\n He’d thought it all out, exactly where he’d send Charles, because it all had to be done in plain sight. In plain sight, people never really knew what they saw.\n There were tourists heading to their cars. But they’d never notice two fellows in uniform chatting by a car. Not at an event like this. People liked to dress up.\n Maybe everyone wanted to be someone else, someone they weren’t.\n But to them, it would just appear that they were two cronies, faces covered by their broad-brimmed hats, leaning against one another as they chatted and laughed over a joke.\n Then…hide the body. Or if he had been seen, “help” an inebriated friend into a car.\n He would need more time for the pièce de résistance. Initially, it had taken him less than twenty minutes to stash Charles and rejoin all those rejoicing over the day.\n He had never felt more victorious. The difficult part, of course, would be to hide his anticipation for all that was destined to follow.\n It didn’t seem that anything could go so impossibly well.\n Ashley, damn her, though. Leave it to Ashley to be worried about Charles! Still and all, it did make the entire plan more exciting. Now, with the evening at a close, he was feeling elated.\n The place had settled down; though everyone had been willing to look for Charles, only Ashley had been really concerned. He had played with the idea of actually disposing of poor old Charles immediately, but now he was satisfied that he had decided he should make it something more dramatic—and allow time between the reenactment and the beginning of the end.\n Oh, he had worked with the others. He had searched so hard. There might have been just a few minutes when he feared someone would actually search the cars, but Charles hadn’t driven.\n It had almost been as if he’d been part of the plan.\n Now he sat next to good old Charles.\n This was necessary. The voice had said that it had to be done, and his ancestor made him know that nothing could be right until then.\n He’d never realized that he’d enjoy it all so much.\n He patted him on the back. Charles didn’t move. The drug was holding, but he’d administer more. He didn’t want the big lug waking up.\n He needed him alive until the time was right.\n Every time he’d been at Donegal recently, he’d felt as if he were being pushed harder and harder. The past was the past—so they all said. But it wasn’t. The past created the present, and he knew now that he had to use the present to set the past right. It wasn’t crazy; he’d heard the voices in his head. A collective consciousness that seemed to scream through history.\n Now, maybe, the voices would stop.\n 3\n Car bombs didn’t exactly do it for him, but Jake indulged in a few anyway.\n “Cheers!” Jenna said, dropping her shot glass into her Guinness, and swallowing down the mixture.\n “Cheat!” Will said to Whitney. “You poured your shot in—you just drink the whole thing.”\n “Hey, you drink it your way, and I’ll drink it mine!” Whitney protested.\n “You’re not doing it the Irish way,” Will said, looking to Jenna for help.\n “Drink it however you like!” Jenna said, smiling sweetly at Will.\n There was a small room in the back of the bar, and Jake, Will Chan, Jenna Duffy and Whitney Tremont had it to themselves that night, so it was nice. Jackson Crow was back at the hotel with Angela Hawkins. They’d all just met for the first time on the Holloway case, and Jackson, the skeptic, had quickly fallen in love with Angela—despite their different approaches to their work. Go figure. The entire team respected and admired them both, and they were glad that the two were indulging in some quality time together.\n And for Jake, it felt good to be in the bar with his coworkers.\n During the Holloway case, they had gotten to know one another. Will and Whitney were excellent with cameras and sound systems; Jenna was a registered nurse, something that could always come in handy when traipsing through strange landscapes and old buildings. His own expertise was computers—and computer hacking. He could usually find any piece of information on any site, public, private or even heavily coded. Yet they’d all had certain unusual experiences in life that had led them to being excellent investigators—and, together, able to discern deeper, darker undercurrents to the event they researched. Now, they also had badges. After the Holloway case, it had been deemed that they would continue to work together, and they would do so with all proper credentials as FBI agents.\n “Now, quit whining over the way a woman drinks her drink,” Jenna said and turned, leaning an elbow on their table, to talk to Whitney. She had brilliant green eyes and red hair, and a smile that could melt ice. “I want to know what else I’ve missed. The World War II museum, the Civil War museum, plantations, the zoo…” \n","sourceLink":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2/page-9.html","bookId":2276,"book":{"id":2276,"title":"Heart of Evil (Krewe of Hunters #2)","description":"Storyline: \n Heart of Evil (Krewe of Hunters #2) \n Emerging from the bayou like an apparition, Donegal Plantation is known for its unsurpassed dining, captivating atmosphere, haunting legends... and now a corpse swinging from the marble angel that marks its cemetery\u0027s most majestic vault. A corpse discovered in nearly the same situation as that of Marshall Donegal, the patriarch killed in a skirmish just before the Civil War. \n Desperate for help traditional criminologists could never provide, plantation heiress Ashley Donegal turns to an elite team of paranormal investigators who blend hard forensics with rare — often inexplicable — intuition. Among the \"Krewe of Hunters\" is an old flame, Jake Mallory, a gifted musician with talent stretching far beyond the realm of the physical, and a few dark ghosts of his own. \n The evil the team unveils has the power to shake the plantation to its very core. Jake and Ashley are forced to risk everything to unravel secrets that will not stay buried — even in death.\n \n","cover":"https://allnovel.net/images/heart-of-evil-krewe-of-hunters-2.jpg","author":"Heather Graham","type":"Mystery","source":"allnovel","link":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2.html","creation":"Oct 5, 2019 8:58:32 AM","modification":"Oct 5, 2019 5:36:43 PM"}}
