{"id":97063,"no":19,"title":"Page 19","content":"19 POST SUNSET. First taste of autumn in the warm air. Mona and Quinn appeared at the garden doors five minutes after I\u0027d called them. Every man on the dimly lit hotel terrace turned to check out the daring beauty with the flowing red hair. Whoa, short sequined job with straps, hem above her knees, and the audacious heels making her naked calf muscles flex, yes, hmmm, and Quinn in minutely tailored khaki and dress shirt and red tie, was her dazzling escort. I\u0027d been hanging back on the outskirts of the thick sinister little party, scanning one mind after another, letting the hubbub crash against me, smelling the perfume of the cigarette smoke, hot blood and male cologne, and grooving now and then on the pure avarice and cynicism of the group. Speakers all around poured out a low thumping steel-band music that came on like a collective heartbeat. The subject was women, Russian women, imported through the young arrogant pimp-slick brown hair, fashionably emaciated, Armani jacket, shiny enthusiastic face, who worked his guests, buyers all, in methamphetamine fits and starts, bragging about the \"white flesh, the blond hair, the freshness, the class\" he had coming in from his connections in Moscow and St. Petersburg. \"You\u0027ve never seen so much white gash.\" The trade was so rich they could replace the girls every six months; we pass them on down the line, don\u0027t you worry, how was that for a guarantee? \"I\u0027m talking cr¨¨me de la cr¨¨me, I\u0027m talking girls who\u0027ll score a thousand a half-hour, we package with clothes or without, I\u0027m talking unbroken flow to point of purchase- .\" Slam. He\u0027d seen Mona. She and Quinn caught up with me. Buzz on her thickening. She was the only woman on the terrace. What gives? Was she the door prize? I narrowed in on the pimp, and the big rawboned oversold bodyguard who was hovering around him, a drone in a badly cut dinner jacket with traces of white powder on his lapels. Drug slobs. All of them drug slobs. \"We\u0027re going to do it right here,\" I said in a whisper. Mona let out a cool laugh. Look at those naked arms. Whiff of cedar to the dress. Aunt Queen\u0027s closets. Quinn only smiled, sharpened for the hunt. The music thumped and went into Brazilian jazz samba. Even the white-jacketed waiters passing everywhere with little bits of ridiculous food and splashing glasses of champagne were high. The bald-headed man from Dallas pushed his way to the pimp: how much for the redhead? He wanted a right to top anybody\u0027s price, \"hear me?\" They were all giving him the word in passing whispers, and he was now staring at me full-time. A guy from Detroit with beautiful white hands was murmuring on about how he\u0027d put her up in a pad in Miami Beach and give her anything she wanted, girl like that, you couldn\u0027t let this business dumb you down to where-. I smiled at the pimp. I had my elbows on the black iron fence behind me, heel hooked on the lower bar, violet sunglasses down. Purple turtleneck, formal cut, butter-soft black leather suit coat and pants, how I love my own clothes. Mona and Quinn were dancing just a little, back and forth, Mona humming to the music. The pimp sidled over, throwing sharp highly personal smiles here and there like cheap necklaces at Mardi Gras. On my right side (she was on my left) he said, \"Give you a hundred grand for her now, no questions asked, got the cash in my coat.\" \"What if she doesn\u0027t go for it?\" I asked, eyes on the shifting clattering party. Sudden smell of caviar, cheeses, fresh fruits, hmmm. \"I\u0027ll take care of that,\" he said, with a scornful laugh. \"You just take the other guy and leave her here.\" \"And later on?\" I asked. \"There is no later on. Don\u0027t you know who I am?\" He felt sorry for me. \"You\u0027re fancy but you\u0027re stupid. Two hundred thousand for her. Take it or leave it. Five seconds. No more.\" I burst into a soft laugh. I looked into his heartless frenzied eyes. Pupils enormous. Harvard Law School, drug trade, female slavery. Up and up and down and down. He flashed his glossy perfectly bleached teeth. \"You should have asked around about me,\" he said. \"Want a job? I\u0027ll teach you so much people will think you\u0027re smart.\" \"Let\u0027s rock, baby,\" I said. I slipped my hand under his left armpit and gently swung him around so that he hit the fence between me and Mona. I bent over and covered his mouth with my left hand before he could make a sound. She pivoted and opened her lips on his throat, her hair a perfect veil of privacy. I felt the life drawn out of his frail limbs, heard her gasping swallows, his whole frame giving one full spasm. \"Leave him alive,\" I whispered. Who was I kidding? Hand on my shoulder. I looked up. The big stupid-eyed bodyguard, almost too stoned to know why he was suspicious or what to do about it, yeah right, but Quinn was already drawing him away and had him paralyzed, the guy with his broad hunched back to the press of the party and Quinn drawing quietly and slowly for the blood. What does that look like, that he\u0027s whispering in the dude\u0027s ear? Most likely. The laughing, gulping, gurgling crowd rolled on, a waiter nearly stepping on me with his precarious tray. \"No thanks, I don\u0027t need a drink,\" I said, which was true. But I liked the pale yellow color of the champagne in those glasses. And I liked the spattering and burbling and dancing of the water in the fountain in the middle of the crowd, and I liked the pure rectangular lights of all the hotel windows climbing and climbing in beauteous parallel rows above us to the rosy sky, and I liked the low raw saxophone of the jazz samba dancing with itself, and I liked the fluttering of the leaves in the potted trees, which everyone on the terrace ignored but me. I liked-. The dazed bodyguard staggered. An underling caught his arm, scheming and proud to have him at a disadvantage. The pimp was dead. Oops. Such a brilliant career slumped over the fence. Mona\u0027s eyes were electric. Drugs in the blood. \"Get the host a chair,\" I said to the first waiter I could snare. \"I think he\u0027s overdosed and he\u0027s holding.\" \"Oh Ma God!\" Half the drinks on his tray crashed into the other half. Customers turning, murmuring. After all, the host had slipped down to the tile floor. Not so good for the slave trade. Out of there. Luscious gloom of hotel mezzanine floor, marble and golden lights, mirrored elevator, swoosh of doors, glowing fields of carpet, gift shop full of pink stuffed monsters, heavy glass, outside pavements, filth, shrieks of tourist laughter, innocent and deodorized half-naked people of all ages in wrinkle-free scraps of brightly dyed clothing, paper trash in the gutters, glorious heat, screeching roar of the crowded St. Charles Street car rounding the bend onto Canal. So many . . . many good people . . . so very happy.","sourceLink":"https://allnovel.net/blood-canticle-the-vampire-chronicles-10/page-19.html","bookId":2596,"book":{"id":2596,"title":"Blood Canticle (The Vampire Chronicles #10)","description":"Storyline: Blood Canticle (The Vampire Chronicles #10) Lestat is back with a vengeance and in thrall to Rowan Mayfair. Both demon and angel, he is drawn to kill but tempted by goodness as he moves among the pantheon of Anne Rice\u0027s unforgettable characters. Julien Mayfair, his tormentor; Rowan, witch and neurosurgeon, who attracts spirits to herself, casts spells on others and finds herself dangerously drawn to Lestat; Patsy, country and western singer, who was killed by Quinn Blackwood and dumped in a swamp; Ash Templeton, a 5,000 year old Taltos whose genes live on in the Mayfairs. Now, Lestat fights to save Patsy\u0027s ghost from the dark realms of the Earthbound, to uncover the mystery of the Taltos and to decide the fate of Rowan Mayfair. Both of Anne Rice\u0027s irresistible realms - the worlds of Blackwood Farm and the Mayfair Witches - collide as Lestat struggles between his lust for blood and the quest for life, between gratification and redemption.","cover":"https://allnovel.net/images/blood-canticle-the-vampire-chronicles-10.jpg","author":"Anne Rice","type":"Horror","source":"allnovel","link":"https://allnovel.net/blood-canticle-the-vampire-chronicles-10.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:24:10 PM"}}
