{"id":84925,"no":14,"title":"Page 14","content":"“I’ll call you this week, OK?” I nod and get into my car, and as I drive away, I mentally examine myself. I hate candy-ass guys but I also hate bullies. My father was a bully. I didn’t like it then and I don’t like it now. Even bullies who are sexy as hell. Especially bullies who are sexy as hell, because they just draw me in toward something that I need to stay far away from. Because Mila was right the other night—I do tend to pick the wrong guys. I tend to be attracted to the wrong guys. Honestly, I’m starting to think that there is no one out there for me. I don’t like the guys I should, and the guys I like are bad for me. Maybe I’m destined to be alone. When I walk into my empty house, it only emphasizes that fact. I’m alone. I kick off my shoes, drop my purse on a table in the foyer and collapse into a chair in the living room with a bottle of wine. Just the bottle, no glass. I dangle my legs over the side of the chair as I think about the evening. Thoughts of Ethan make me cringe. Besides annoying me with his judgment of Pax, Ethan just lacks something. A spark, a passion. I can’t put my finger on it, but whatever it is, I doubt he’s ever going to make me feel the way I want someone to make me feel. But Gabriel does. One smoldering look from him sends my pulse racing, bully or not. We need to finish what we started. Fuck. What is wrong with me? Why am I so stuck on someone I shouldn’t want… but do? All I know is Gabriel has that certain kind of confidence. The kind that turns my stomach inside out. And there’s something else about him, too… something intriguing. I don’t even know him, but there’s something in his eyes, something dark and haunted that draws me to him. I ponder that for a minute; ponder what he might have seen in Afghanistan that was so terrible that it scarred him inside. What turned him into a panicky mess the night of the taxi accident? Because he doesn’t seem like the kind of guy who panics. In my head I see him jogging on the beach again, all huge and strong and disciplined. Judging by how sweaty he was, I bet he’d been jogging for miles and yet he was still going, just like a machine. He’s clearly a force to be reckoned with. Yet something has the power to bring him to his knees. It’s a puzzle. My eyes flutter closed as I picture Gabriel’s rippling muscles, glistening with a light sheen of sweat. I picture him crawling up and over me, rubbing against me, his fingers stroking me. Oh my God. My eyes snap open and my cheeks flush as I realize I just drifted into a fantasy about Gabriel. He’s a guy that is made of everything that scares me. He will hurt you. I know that. Yet at the same time, I know he’s a guy who can turn me on in one second flat. What the eff is wrong with me? “Madison, there is something wrong with you,” Jacey sighs, shaking her head as she sifts through a rack of spring blouses. “Seriously. I know some girls who would give their left ovary to date Ethan Eldridge and you’re standing here complaining that he doesn’t do it for you? Let’s recap, shall we? He’s gorgeous, he’s a doctor, and did I mention that he’s a gorgeous freaking doctor?” I roll my eyes as I pull out a pink tunic and examine it. It would look perfect with my gray skinny jeans so I drape it over my arm. “He’s a resident doctor and he is good-looking. But I’ve just known him too long. I want the butterflies… that fluttery feeling that you get when you meet someone amazing. And besides, why are you on Team Ethan so hard right now? I thought you wanted me to date your brother.” I stare pointedly at her and she doesn’t even have the grace to look sheepish. She simply stares back at me. “Because he was sort of rude yesterday, not exactly a great first impression. I just figured you wouldn’t want to give him a chance.” Actually, Gabe made one hell of a first impression. I smile as I think of him outside the club that night. He was so cocky and sexy in the alley behind the club, grabbing my wrist and pulling me to him. My heart speeds up just thinking about it. I shouldn’t like that shit… that alpha, ultra-confident bad-boy shit. But I do. I can’t help it. “He didn’t make a bad first impression,” I tell Jacey. “It was the second impression that sucked.” Jacey crows when she sees the expression on my face. “I knew it! I knew you liked him. Maddy, I promise you, he’s perfect for you. Just give him another chance. Puh-leeeease! It will be easy for you too. He’s going to stay here with me for a while because of Jared. Big Brother Gabriel is going to fight my battles for me.” Jacey hands me a blue peasant blouse to try on. “He’ll be with me for at least a couple of weeks. I’m sure he’ll be into the Hill a lot to eat. He doesn’t really cook.” I look up at her. “You know we have a delivery service. He won’t even have to come in. We can deliver meals right to his door.” Jacey laughs. “Whatever. You know you want to see him. I can tell.” Heaven help me, I do. But I’d never admit it to her. To admit my infatuation to her would make it real. And I can’t make it real or act on it because it’s not good for me. At all. So instead I just shake my head. “I don’t need to see him. And he’s not into me anyway, so it’s all a moot point.” That’s a lie, but I figure it might shut Jacey down. But no. Jacey glances up at me, even more interested now. “You don’t think he’s into you?” Her eyes gleam. “Because I can find out for you.” “Oh my God,” I groan. “We’re not in fourth grade. Leave it alone, Jace.” “Whatever,” Jacey mutters. “But if you change your mind, I’ll give you his number and you can call him yourself.” I can tell that she’s not sure whether I’m telling the truth or not about not wanting to see her brother. And to be honest, I’m not sure either. Because even though I know I shouldn’t, I find myself thinking about him all the time. I think about his husky voice in my ear and his hand between my legs in that taxi. I think about his dark, dark gaze and how it sets my skin on fire from across the room. But even more telling than my runaway thoughts is one interesting thing. I haven’t thrown his number away. It’s neatly folded and tucked inside my purse, along with the accompanying message. We need to finish what we started. Chapter Eight Gabriel The night is so fucking black that I can’t even see my hand in front of my face. I groan, try to move, then give up. I try to hear, try to see, try to move the rest of my body… but fail on all counts. The shadows move around me and I’m too weak to care. I don’t feel anything and I think that’s odd. I should be in fucking pain and for a second I’m panicked that I’m paralyzed. I calm down when I realize I’m probably just in shock. I groan again, trying to get up, but I realize it’s not happening. And then I smell it. Blood. Brand and Mad Dog are out there and I’ve got to see if they’re alive. The smell of blood is strong in the breeze, as well as burning metal, hissing gas and dust. Fuck. It takes me a minute, but I finally manage to flip onto my belly and drag myself by my elbows. I’m definitely not paralyzed and fuck, the pain has arrived. My head is screaming, but I’ve got to find my friends. Inch by painful inch, I pull myself through the carnage-riddled dust. A twisted piece of our Humvee is lodged in the ground to my left, and I can smell melting rubber as a tire burns to my right. And then, through the smoke, I see a face on the side of the road, bloody and mud-spattered. My heart hammers as I try like hell to get to it, to see if it’s Brand or Mad Dog… until I arrive and find that it’s neither. The girl’s eyes are wide and open. And lifeless. She stares at me, blaming me. I remember everything and the memories slam into me like a freight train. It’s all my fault. The pain in my head intensifies, like a million shards of glass, and everything fades to black. I wake up in a cold sweat, my sheets drenched with my terror, my throat bone dry. I lie still for a minute, sucking in coarse breaths of air as I try to force myself to calm down. The dream is so fucking real, though, as if every memory from that night is permanently imprinted in my mind. Which, of course, it is. I’m never going to be free of it. I reach for a glass of water to soothe my parched throat, only to find that I don’t have a nightstand here. I’d forgotten. I pull myself into a sitting position, running a hand through my hair, before I get out of bed and make my way to the kitchen in the dark. I’m still unnerved by my fucking dream, and even the shadows cast in this dark and familiar kitchen make me uneasy. The luminescent microwave clock tells me that it’s five thirty a.m. The sun should be coming up soon. I grab a bottle of water and slump into a chair at the kitchen table, gazing absently outside. Jacey’s car isn’t in the driveway, which means she didn’t come home last night. That’s a fact that pisses me off. Yes, she’s an adult. Yes, normally she could stay over at her boyfriend’s without a problem. But shit. I’m here so that she feels safe. If she doesn’t even bother to come home, there’s no sense in me being here. I drink the water, then drink one more bottle. My mouth is still dry when I’m finished. The night terrors always affect me in a very physical way… headaches, sweat, shortness of breath. It’s like I’m actually back in Afghanistan, actually reliving that night over and over. It’s a pain in the ass. I toss the bottles into the recycling bin and head to the bathroom. I know there’s no way I’m going back to sleep now. I turn the water on and I’m waiting for it to heat up when I hear the back door quietly open. Jacey. I fling open the bathroom door and storm down the hallway to find her creeping quietly through the kitchen. “Welcome home,” I say grimly as I flip on the light. She blinks in the brightness, then grins at me. “Hey, big brother,” she says, as she trips on a rug. “I didn’t mean to wake you up.” She’s obviously drunk. “You do realize that you’re supposed to be at work in a few hours,” I point out. She doesn’t seem concerned. “I’ll be fine,” she slurs. “Don’t worry about it, I’m a big girl. What’s your problem?” “My problem would be lost on you at this particular moment,” I tell her. “But trust me, we’ll be talking about it later. If you ever drive home drunk again, you won’t need Jared to manhandle you. I’ll kick your little ass myself. Go sleep it off. We’ll talk when you’re coherent.” “Whatever,” she mutters as she wobbles down the hall. “Shows how much you know. Jared’s still messing with me. He’s been texting me all night. Said he’s going to teach you a lesson.” She kicks off one of her heels, then throws the other down the hallway in frustration.","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-14.html","bookId":2759,"book":{"id":2759,"title":"If You Leave (Beautifully Broken #2)","description":"Storyline: If You Leave (Beautifully Broken #2) 26-year old Gabriel Vincent is a badass hero. Or he used to be, anyway. As an ex-Army Ranger, Gabe never thought he needed anyone. But after one horrible night in Afghanistan scars him in a way that he can\u0027t get past, he needs someone who can help him heal...even if he doesn\u0027t realize it. 25-year old Madison Hill doesn\u0027t need anybody...or so she thinks. She grew up watching her parents\u0027 messed-up abusive relationship and she knows there\u0027s no way in hell that she\u0027s ever letting that happen to her. They don\u0027t know it in the beginning, but Gabriel and Madison will soon develop a weakness: Each other. But Gabriel\u0027s got a secret, a hidden monster that he\u0027s afraid Maddy could never overcome... And Maddy\u0027s got issues that she\u0027s afraid Gabe will never understand. They quickly realize that they need each other to be whole, but at the same time they know that they\u0027ve got demons to fight. And the problem with demons is that they never die quietly.","cover":"https://allnovel.net/images/if-you-leave-beautifully-broken-2.jpg","author":"Courtney Cole","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/if-you-leave-beautifully-broken-2.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 5:02:17 PM"}}
