{"id":63727,"no":44,"title":"Page 44","content":"“Oh, wow.” “She was supposed to let the doctor know how they were working out, but she didn’t even realize she’s been acting so bizarre. It took hours of talking to her to get her to see it, and then pinpoint why.” I straightened and wiped my eyes, trying to stem my growing irritation over another woman monopolizing my man’s attention. I couldn’t discount her making up a problem just to keep Gideon spending time with her. He swapped places with me, sidestepping under the shower spray. Water coursed down his amazing body, running lovingly over the hard ridges and slabs of muscle. “So what now?” I asked. He shrugged grimly. “She’ll see her doctor tomorrow to discuss getting off the pills or switching to something else.” “Are you supposed to walk her through that?” I complained. “She’s not my responsibility.” His gaze held mine, telling me without words that he understood my fear and worry and anger. Just as he’d always understood me. “I told her as much. Then I called Giroux and told him, too. He needs to come take care of his wife.” He reached for his shampoo, which rested on a glass shelf with the rest of his personal shower items. He’d moved his stuff into my place pretty much the minute I agreed to date him, just as he had stocked his place with duplicates of my everyday items. “She was provoked, though, Eva. Deanna visited her earlier tonight with pictures she took of you and me at the video launch.” “Fabulous,” I muttered. “That explains why Deanna was here waiting to ambush me.” “Was she really?” he purred dangerously, making me pity Deanna—for about half a second. She was digging herself a nice grave. “She probably got shots of you showing up at Corinne’s place and wanted to rile me.” I crossed my arms. “She’s stalking you.” Gideon tipped his head back into the water to rinse, his biceps flexing as he ran his fingers through his hair. He was so flagrantly, sexually, beautifully male. I licked my lips, aroused by the sight of him despite my irritation with his exes. I closed the distance between us and squeezed some of his body wash into my palm. Then I ran my hands over his chest. Groaning, he looked down at me. “I love your hands on me.” “That’s good, since I can’t keep my hands off you.” He touched my cheek, his eyes soft. He searched my face, maybe gauging whether I was wearing the fuck-me look or not. I didn’t think I was. I wanted him, that never stopped, but I also wanted to enjoy just being with him. That was hard when he was blowing my mind. “I needed this,” he said. “Being with you.” “It seems like so much is coming at us, doesn’t it? We can’t catch a break. If it’s not one thing, it’s another.” My fingertips traced the hard ridges of his abdomen. Desire hummed between us, and that wonderful sense of being near someone who was precious and necessary. “But we’re doing okay, aren’t we?” His lips touched my forehead. “We’re hanging in pretty good, I’d say. But I can’t wait to take you away tomorrow. Get out of here for a while, away from everyone, and just have you all to myself.” I smiled, delighted by the thought. “I can’t wait, either.” I woke when Gideon slipped out of my bed. Blinking, I noted that the television was still on, though muted. I’d fallen asleep curled up with him, enjoying our time alone together after all the hours and days we’d been forced to spend apart. “Where are you going?” I whispered. “To bed.” He touched my cheek. “I’m crashing hard.” “Don’t go.” “Don’t ask me to stay.” I sighed, understanding his fear. “I love you.” Bending over me, Gideon pressed his lips to mine. “Don’t forget to put your passport in your purse.” “I won’t forget. Are you sure I shouldn’t pack something?” “Nothing.” He kissed me again, his lips clinging to mine. Then he was gone. I wore a light jersey wrap dress to work on Friday, something that could go from work to a long flight easily. I had no idea how far Gideon was taking me, but knew I’d be comfortable no matter what. When I got to work, I found Megumi on the phone, so we waved at each other and I headed straight to my cubicle. Ms. Field stopped by just as I settled into my chair. The executive chairman of Waters Field \u0026 Leaman looked powerful and confident in a soft gray pantsuit. “Good morning, Eva,” she said. “Have Mark stop by my office when he gets in.” I nodded, admiring her triple-strand black pearl necklace. “Will do.” When I passed along the request to Mark five minutes later, he shook his head. “Betcha we didn’t get the Adrianna Vineyards account.” “You think?” “I hate those damned cattle-call RFPs. They’re not looking for quality and experience. They just want someone who’s hungry enough to give their services away.” We’d dropped everything to meet the deadline for the request for proposal, which had been given to Mark to spearhead because he’d done such an amazing job with the Kingsman Vodka account. “Their loss,” I told him. “I know, but still … I want to win ’em all. Wish me luck that I’m wrong.” I gave him a thumbs-up and he headed to Christine Field’s office. My desk phone rang as I was pushing to my feet to grab a cup of coffee from the break room. “Mark Garrity’s office,” I answered, “Eva Tramell speaking.” “Eva, honey.” I exhaled at the sound of my mother’s watery voice. “Hi, Mom. How are you?” “Will you see me? Maybe we could have lunch?” “Sure. Today?” “If you could.” She took a breath that sounded like a sob. “I really need to see you.” “Okay.” My stomach knotted with concern. I hated hearing my mother so upset. “Do you want me to meet you somewhere?” “Clancy and I will come get you. You take lunch at noon, right?” “Yes. I’ll meet you at the curb.” “Good.” She paused. “I love you.” “I know, Mom. I love you, too.” We hung up and I stared down at the phone. How was our family going to move forward from here? I sent a quick text to Gideon, letting him know I’d have to take a rain check on lunch. I needed to get my relationship with my mom back on track. Knowing I needed more coffee to tackle the day ahead, I set off to fill up. I left my desk exactly at noon and headed down to the lobby. As the hours passed, I grew more and more excited about getting away with Gideon. Away from Corinne, and Deanna, and Brett. I’d just passed through the security turnstiles when I saw him. Jean-Fran?ois Giroux stood at the security desk, looking distinctly European and very attractive. His wavy dark hair was longer than it had been in the pictures I’d seen of him, his face less tan and his mouth harder, framed by a goatee. The pale green of his eyes was even more striking in person, even though they were red with weariness. From the small carry-on at his feet, I suspected he’d come straight to the Crossfire from the airport. “Mon Dieu. How slow are the elevators in this building?” he asked the security guard in a clipped French accent. “It’s impossible that it should take twenty minutes to come down from the top.” “Mr. Cross is on his way,” the guard replied staunchly, remaining in his chair. As if he sensed my gaze, Giroux’s head swiveled toward me and his gaze narrowed. He pushed away from the counter, striding toward me. The cut of his suit was tighter than Gideon’s, narrower at the waist and calves. The impression I got of him was too neat and rigid, a man who assumed power by enforcing rules. “Eva Tramell?” he asked, startling me with his recognition. “Mr. Giroux.” I offered my hand. He took it, then surprised me by leaning in and kissing both of my cheeks. Perfunctory, absentminded kisses, but that wasn’t the point. Even for a Frenchman, it was a familiar gesture from someone who was a total stranger to me. When he stepped back, I looked at him with raised brows. “Would you have time to speak with me?” he asked, still holding my hand. “I’m afraid not today.” I tugged away gently. Anonymity was created just by being in a massive space crowded with people rushing to and fro, but with Deanna lurking around, I couldn’t be too careful about who I was seen with. “I have a lunch date and then I’m leaving directly after work.” “Tomorrow, perhaps?” “I’ll be out of town this weekend. Monday would be the earliest.” “Out of town. With Cross?” My head canted to the side as I examined him, trying to read him. “That’s really none of your business, but yes.” I told the truth so he’d know that Gideon had a woman in his life who wasn’t Corinne. “Does it not bother you,” he said, his tone noticeably cooling, “that he used my wife to make you jealous and bring you back to him?” “Gideon wants to be friends with Corinne. Friends spend time together.” “You’re blond, but surely you can’t be so na?ve as to believe that.” “You’re stressed,” I countered, “but surely you know you’re being an ass.” I registered Gideon’s presence before I felt his hand on my arm. “You’ll apologize, Giroux,” he interjected with dangerous softness. “And do so sincerely.” Giroux shot him a look so filled with anger and loathing, it made me shift restlessly on my feet. “Making me wait is classless, Cross, even for you.” “If the insult were intentional, you’d know it.” Gideon’s mouth thinned into a line as sharp as a blade. “The apology, Giroux. I’ve never been anything but polite and respectful to Corinne. You will show Eva the same courtesy.”","sourceLink":"https://allnovel.net/entwined-with-you-crossfire-3/page-44.html","bookId":1924,"book":{"id":1924,"title":"Entwined with You (Crossfire #3)","description":"Storyline: Entwined with You (Crossfire #3) The worldwide phenomenon continues as Eva and Gideon face the demons of their pasts, and accept the consequences of their obsessive desires… From the moment I first met Gideon Cross, I recognized something in him that I needed. Something I couldn’t resist. I saw the dangerous and damaged soul inside–so much like my own. I was drawn to it. I needed him as surely as I needed my heart to beat. No one knows how much he risked for me. How much I’d been threatened, or just how dark and desperate the shadow of our pasts would become. Entwined by our secrets, we tried to defy the odds. We made our own rules and surrendered completely to the exquisite power of possession…","cover":"https://allnovel.net/images/entwined-with-you-crossfire-3.jpg","author":"Sylvia Day","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/entwined-with-you-crossfire-3.html","creation":"Oct 5, 2019 8:58:08 AM","modification":"Oct 5, 2019 9:51:22 AM"}}
