{"id":88679,"no":12,"title":"Page 12","content":"He went to Hughes and gave him the bad news, that Ellie hadn’t been able to identify the Landrys.\n Hughes couldn’t hide his disappointment. “Have her look again,” he insisted. “Maybe she was distracted when she-”\n “She’s gone through them twice now. She’s not gonna be a witness, so she doesn’t go on the list.”\n Ellie wasn’t paying any attention to the raised voices. She received two texts back to back. She read the first and decided to ignore it, but the second text was more insistent. Dr. Westfield wanted to make a deal. If she would come in and do a colon resection for him, he would let today be her last day at the hospital. The offer was too good to resist. Since Westfield didn’t need her in the OR until five o’clock and the patient was stable, she texted to say she would do it.\n “Okay, Ellie, you’re done here,” Agent Hughes reluctantly told her.\n She stood, slipped her phone into her purse and, trying to ignore Max, said, “It’s been a pleasure, gentlemen.”\n She turned to leave but stopped, realizing she hadn’t driven her car to the station.\n “I need a ride home.”\n Every man in the room immediately offered to take her. Greg was the most vocal and leapt to his feet. “I’ll drive you, and maybe we could stop for lunch.”\n Max shoved him back in the chair. “She’s not going anywhere with you.”\n Ben was intrigued by Max’s behavior. He apparently had decided he didn’t like or trust Greg, and that didn’t make any sense at all. Then he noticed the way Max was looking at Ellie. Ah, now he understood. Damn, he was slow today. He should have picked up on the signal much earlier. He stood and fished the keys out of his pocket and started toward Ellie, but Max stopped him.\n “I’ve got this,” Max muttered. He took Ellie’s arm and practically pulled her across the room toward the stairs.\n “It’s amazing,” Ellie whispered so only he could hear.\n “What?”\n “One minute you’re this aloof federal agent, and the next you’re Neanderthal man.”\n He flashed a smile. “I just want to get you out of here before Hughes shoves the Landry photos in your face.”\n Once they were in his car and on their way, she said, “Maybe Greg will be able to identify the Landrys.”\n “Yeah, maybe. He says he got a good look at Cal before he put on the sunglasses.”\n “Are you going to tell him witnesses have a way of disappearing?”\n “Hughes will talk to him.”\n “When does your flight leave?”\n “In a day or two. It depends on how much we need to do here.”\n She hated that she was going to have to say good-bye again. No kisses this time, she vowed, and no angst.\n “I forgot to say good-bye to Ben,” she remarked.\n “I’ll tell him. Listen, Ellie…”\n “Yes?”\n “I’m not forgetting about Evan Patterson. I will find him, and as soon as I do, I’ll call you.”\n “Maybe he’s back in a mental ward somewhere,” she suggested.\n “I’m checking,” he promised.\n He pulled up to her building.\n “I’m not going inside,” she told him as she unhooked her seat belt. She fished her car keys from her purse and got out before he turned off the motor.\n “You be careful,” she said in farewell. She was able to stop herself before she added, “Chasing bad guys.” How lame would that have been?\n He didn’t say good-bye to her. At least she didn’t think he did, but then she practically dived into her car and drove away. She forced herself not to look in the rearview mirror, and after she’d turned the corner, she sighed. Not too awkward, she decided. But in the back of her mind an unwanted thought nagged at her. She should have slept with him.\n TEN\n Greg Roper was a dream come true. Agent Hughes was overjoyed to have found such a strong witness to testify against the Landrys. The twenty-six-year-old had come forward the day after the shooting and had told Hughes he had seen both Cal and Erika Landry in the park.\n When Hughes met Roper at the police station to look at the photos Sunday afternoon, the agent had his suspicions that Roper was a bit of a flake because of the way he kept hitting on Ellie Sullivan, but as soon as she left the station, Roper got down to business and quickly pointed out the suspects.\n As far as Hughes was concerned, Roper was an ideal witness. He had never had any trouble with the police, had never even gotten a speeding ticket, and he had held down a good job for more than four years. Most important to Hughes was the fact that Roper wasn’t at all ambivalent about what he saw. He explained that he was crossing the park and was taking a shortcut through a thicket of shrubbery to get to his car when he saw Erika Landry. She was sitting in the passenger seat of a big Mercedes that was driving slowly down the street.\n “What was she doing?” Hughes asked.\n “She pulled down the visor to look at herself in the mirror, and then she tugged on her hair, and it all moved at once. It was a wig, and I think she was trying to fix the thing.”\n “And Cal Landry?”\n “I didn’t see his face yet, but when he parked the car at the end of the block and got out, I saw him. He stood there surveying the street, but he turned as he was bringing up his sunglasses. I was close enough to see the scar on his cheek.”\n “Why did you stay where you were? Why didn’t you keep going?”\n “I was curious. At first I thought maybe the woman was going through chemo or something and didn’t have any hair, but when she adjusted the wig, her long red hair fell loose, and she pushed it back in. She had pretty red hair. Why was she hiding it under a wig? Then I saw the man reach into his pocket and look down at something, like he was checking on it. I couldn’t see what it was, but it made me even more curious. I could tell they were up to something, and I had time, so I decided to follow them and see what it was. I guess you could say I was being nosy. They didn’t know I was there. They walked into the area of the park where the trees are pretty dense, and then suddenly they turned around and started walking really fast in the opposite direction. That’s when I saw the FBI agent running after them.”\n “Did you see Landry shoot Agent Goodman?”\n “I sure did. I saw him fire his gun in that direction where the agent was, and I saw the agent drop down, so, yes, I saw him shoot him.”\n Roper insisted that the Landrys never saw him. “Never even looked my way, but the bushes hid me. I don’t think they would have seen me if they had looked.”\n Hughes suggested strongly that Roper not discuss what he had seen with his family or friends.\n There was a BOLO on the Landrys, but Hughes fully expected the couple to appear at a police station somewhere with their attorneys flanking them. They’d say they’d heard the feds were looking for them. Even though they’d accuse the FBI of harassment, they’d cooperate and answer questions. They might even admit they were in the park, but they’d confess their innocence, and they’d have a couple of witnesses to back them up.\n Greg Roper was going to be their downfall… if Hughes could keep him alive long enough to testify.\n ELEVEN\n Ellie drove directly to the hospital and was finished with her surgery by five thirty. She was walking out the door when she was called back in. A bus filled with teenagers returning to St. Louis from a football camp had been broadsided by a semi, and there were four life-threatening injuries. Ellie did two more surgeries and didn’t get home until after three in the morning. She crawled into bed and slept twelve straight hours.\n When she awoke, she felt restless and didn’t want to be alone, which was a rare feeling for her. She decided to go to her home away from home. She called Uncle Oliver and Aunt Millie Wheatley, the dear people who had taken her in when she was twelve years old. They loved her, nurtured and protected her, and she suddenly missed them horribly.\n It wasn’t as though she hadn’t seen them in a while. She talked to them at least twice a week, sometimes more, and ate dinner at their house every other Sunday, depending on her schedule. But she had the sudden urge to spend some time with them before she left town.\n Aunt Millie answered the phone when she called.\n “May I spend the night?” Ellie asked. What was wrong with her? She sounded so pathetic.\n “Of course,” Millie answered. “Your room is always ready for you.”\n “I’ll be there in twenty.”\n Ellie immediately felt better. Just hearing the voice of someone who loved her made a difference.\n An hour later she was sitting in the Wheatley kitchen, drinking hot tea. Uncle Oliver wanted to know about her latest surgeries and, of course, wanted the details about the incident outside the hospital. She talked about the surgery but didn’t tell him she had seen the shooting. If he knew that she had been so close to the gunshots, he would have been very upset.\n When her uncle had gone to bed, she and Millie discussed the upcoming wedding in Winston Falls.\n “You’re nervous about going home, aren’t you?” Millie asked.\n “Yes. I’m afraid,” she admitted.\n “Your father would know if that monster is back in town,” she said, referring to Patterson.\n “That’s not it. I’m nervous about… them. I want to fit in the family…” She shook her head. “I don’t think I will.”\n “It will be all right. Just don’t push it,” she suggested. She reached across the table and patted Ellie’s hand.\n Anxious to change the subject, Ellie blurted, “I met someone.”\n “Oh?” Millie began to smile. “It’s about time.”\n Ellie told her about Max and what a bizarre reaction she’d had when she met him.\n “He’s all wrong for me,” she said. “He’s abrupt and gruff, and at times he can be downright rude. For a living, he carries a gun and chases bad guys. His life is the antithesis of mine. Definitely not the ideal man… and yet, there was instant attraction… almost animalistic,” she admitted. “I couldn’t control it.”\n “That’s how it was with your uncle and me. Instant attraction. Want to know a secret? We’re old now. He’s balding. I’ve gained twenty pounds and have more wrinkles than a weary bloodhound, but the attraction is still there, and it’s just as strong. If you think you might have feelings for this man, don’t fight them.”\n “There’s a problem.”\n “What is it?”\n “He lives in Honolulu.”\n Millie drummed her fingers on the table. “Honolulu, huh?”\n Ellie nodded. “A world away.”\n TWELVE\n At first, Ellie was nervous about going home. Now she dreaded it.\n She lay awake staring at the shadows that were cast on the wall by the streetlight outside her bedroom window. She had stayed up late talking to Millie, and now she couldn’t get to sleep.\n Her room was just as she had left it. Her favorite books were still lined up on the shelf above her desk. Her bed still had the light pink comforter. The bureau still had the colorful porcelain lamp that she and Millie had found at a flea market. And there were clothes in the closet that she hadn’t worn in years but couldn’t bring herself to discard. This room was her safe haven.\n It hadn’t been that way at first. When she was brought to the Wheatleys all those years ago, she was terrified and uncertain of her future; but Oliver and Millie gave her what she needed most, a secure, loving environment and time to adjust. They opened up their home and their hearts to her, and she would never be able to repay them for their generosity and kindness. When she was in their house, she felt protected.\n Winston Falls, however, would always be her real home. Her visits had been infrequent over the years, and she usually couldn’t wait to get back to see her family. This time was different.\n It had been almost eighteen months since her last trip to Winston Falls, and that had ended in disaster. She had brought her fiancé, John Noble, home to meet her parents and her sister Ava. They all seemed to like John very much-especially Ava-and everything was going well until the second day, the day that Ellie abruptly broke off her engagement and flew back to her apartment alone.\n Her parents knew what had happened-they were in the living room when Ellie went upstairs and opened the wrong door-and they were duly horrified and mortified. Ava had insisted she never meant to hurt anyone, but it was too late for apologies.\n Their mother didn’t know what to do about the situation. After pacing about the house for several hours, she made the decision to never ever discuss the unpleasant event. Their father didn’t want to be put in the position of having to take sides, so he decided to let his daughters work it out between them. He had a long talk with Ava and then let it go.\n Ellie felt devastated and hurt, but by the time she was back and settled in her apartment again, she had forgiven her parents for not throwing Ava out of the house. Once she’d calmed down, Ellie realized it was wrong of her to expect them to choose one daughter over another. She had great sympathy for them, especially her father. The poor man had put up with so much because of her. She once told him she knew that she was a perpetual thorn in his side almost from the day she was born, and he had a good laugh.\n “You, young lady, make life so much more interesting,” he’d told her.\n She wasn’t so certain about that. She knew he had his hands full with her. At age three, she was reading and doing simple math, and her vocabulary was more advanced than most adults. By age five, she was deemed a prodigy. With that realization came the responsibility for her father to protect her from being exploited. Because he was a professor in the math department at the local university, he was able to keep Ellie from being bored by scheduling individual sessions with other professors in history, sociology, English literature, anatomy, and any other subject that caught her interest.\n Her parents tried to make Ellie’s life as normal as possible, but it was difficult. She was only ten when she entered Sacred Heart High School. The social aspect of high school was difficult for her because she was so much younger than the other students, but the older boys especially looked out for her.\n Her father believed he had done a fair job of helping her live a happy and somewhat normal life until Evan Patterson came along. Patterson turned their lives upside down and dragged them through hell.\n From the moment he saw her at a summer camp for advanced science students, the seventeen-year-old Patterson became obsessed. She wasn’t aware of his interest, though, until he began walking back and forth in front of her house. Shortly after that, she started to receive photos of him and love letters. When she showed them to her father, he grew concerned that a boy so much older than Ellie was showing interest. He called Evan’s parents to voice his misgivings but was told that the boy was quiet and shy and, because he was a gifted student like Ellie, was probably showing only how much he admired her academic accomplishments. Despite their glowing praise for their son, Ellie’s father wasn’t pacified. He responded by asking two seniors to walk her to and from school. \n","sourceLink":"https://allnovel.net/the-ideal-man-buchanan-renard-9/page-12.html","bookId":1828,"book":{"id":1828,"title":"The Ideal Man (Buchanan-Renard #9)","description":"Storyline: \n New York Times bestselling author Julie Garwood delivers a contemporary romance that\u0027s pulse-pounding in every sense of the word. \n Dr. Ellie Sullivan has just completed her residency at a large urban hospital. While jogging in a park nearby, she witnesses the shooting of an FBI agent in pursuit of wanted criminals, a couple identified as the Landrys. The only person to see the shooter\u0027s face, Ellie is suddenly at the center of a criminal investigation. \n Agent Max Daniels takes over the Landry case. A no-nonsense lawman, he\u0027s definitely not the ideal man that Ellie has always imagined, yet she\u0027s attracted to him in a way she can\u0027t explain. \n Ellie heads home to Winston Falls, South Carolina, to attend her sister\u0027s wedding. Shortly after she arrives, though, she receives a surprise visitor: Max Daniels. The Landrys have been captured, and she\u0027ll be called to testify. But they\u0027ve been captured before, and each time the witnesses are scared into silence-or disappear before they can take the stand. Max vows to be Ellie\u0027s shadow until the trial, and it isn\u0027t long before sparks fly.\n \n","cover":"https://allnovel.net/images/the-ideal-man-buchanan-renard-9.jpg","author":"Julie Garwood","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-ideal-man-buchanan-renard-9.html","creation":"Oct 5, 2019 8:58:02 AM","modification":"Oct 5, 2019 5:29:41 PM"}}
