{"id":95013,"no":43,"title":"Page 43","content":"We were sitting on his balcony.\n Jiggly Jill was long gone. It turned out that Jill wasn\u0027t much of a girlfriend. She had been someone he\u0027d picked up tonight at a party. I doubted she would go to the police. Truth was, she hadn\u0027t a clue what had happened to her or what was going on, and just before she left, just as she was pulling on her clothes, I gave her a very strong suggestion to not go to the police.\n She merely nodded, grabbed her stuff, gave Andre one last, fearful look, and headed out front to wait for her taxi.\n \"Don\u0027t look so sad,\" I said. \"There\u0027s more where she came from.\"\n Andre was presently pressing a bag of frozen peas to his right eye and alternately smoking. It was multi-tasking at its best. I suspected the cigarette might be accelerating the rate at which the bag of peas was melting, but decided to keep my hypothesis to myself.\n When we listened to a car door open and heard what we both assumed was the taxi speeding off, Andre ground out his cigarette and looked at me.\n \"Who the fuck are you?\"\n \"A private investigator.\"\n He blinked. \"You\u0027re kidding.\"\n \"Nope.\"\n \"Where did you learn to fight like that?\"\n I shook my head and motioned to the pack of cigarettes. He reached down and shook one out for me. I plucked it out deftly. He next offered me a light and I leaned into it and inhaled. I exhaled a churning plume of blue-gray smoke, and said, \"If I told you, I would have to kill you.\"\n \"Fine,\" he said. \"I\u0027ve never come across someone like you.\"\n \"And I doubt you ever will again.\"\n He studied with his free eye; the other being, of course, hidden behind a melting bag of Green Giant peas. \"I believe it.\"\n I had a thought, and wondered just how far I could go with this mind-control business. I waited until he caught my eye with his one good eye, and said, \"I will tell you what I am, but when I leave your house, you will forget it completely. Understood?\"\n He looked at me - and looked at me some more - and finally, his one good eye went blank. He nodded. My suggestion had sunk home. A moment later, the dazed look disappeared, and he looked at me again as he had a moment or two before: with confusion and maybe a little awe.\n \"I\u0027m not human,\" I said. \"Not really. I\u0027m something else. Some call me a vampire.\"\n He lowered the bag of peas. His other eye was nearly swollen shut. I saw it working behind all the puffy folds, trying to see through. \"You\u0027re serious?\"\n \"Deadly.\"\n \"And that explains why you\u0027re so fast?\"\n \"Yes.\"\n \"And strong?\"\n \"Yes.\"\n He had witnessed my skills firsthand, had seen me doing things he had never seen another human do. It wasn\u0027t hard for him to accept that I was perhaps something different.\n \"But I thought vampires were, you know, only in books.\"\n \"A form of them are, yes.\"\n He was about to ask me another question and I shook my head. \"We\u0027re not here about me, Andre. Do you understand?\"\n He nodded again, resigned. He returned the peas to his swollen eye and sat back a little in his chair.\n I said, \"When did you learn the dim mak?\"\n \"Years ago. From a master in Japan.\"\n \"Have you used it before?\"\n He brought his cigarette to his lips. \"Can\u0027t vampires read minds or something?\"\n \"Often.\"\n \"So it would do me little good to lie.\"\n \"Little good.\"\n \"And what will you do with this information?\"\n \"I haven\u0027t decided yet.\"\n \"Will you go to the police?\"\n \"Maybe. But I doubt they\u0027ll believe me.\"\n He chuckled lightly. \"True.\"\n Andre Fine was thirty-six years old and well spoken, but I sensed an urban roll to his words. No surprise there, since he had grown up in New Jersey. I knew he had a long list of priors, some of them violent. He had spent six years of his life in various prisons. He was a street fighter - no doubt, a natural fighter - one who had honed his skill into something deadly.\n As I sat there looking at him, I suddenly knew why he did what he did. And how he could afford such a lifestyle. Whether it was a psychic hit or not, I didn\u0027t know. But I suddenly knew the truth.\n \"You\u0027re a hired killer,\" I said.\n He glanced at me and shook his head and smiled. \"You\u0027re good, lady.\"\n I waited. He waited. I knew his every instinct was rebelling against talking to me, but I knew he would, even without my prodding.\n \"Yes, I am. Of sorts.\"\n \"What does that mean?\"\n \"It means I can\u0027t always guarantee death. Some survive the dim mak.\" He shrugged. \"Others don\u0027t.\"\n \"Caesar Marquez was one of those who didn\u0027t.\"\n He shrugged again. The sign of a true killer. Nonchalance about life and death. Would I ever be that way? God, I hoped not.\n \"So, people hire you to kill people?\" I asked.\n \"That\u0027s how it works, lady.\"\n \"Only you can\u0027t guarantee death.\"\n He nodded. \"It\u0027s impossible to guarantee death.\"\n \"The victim dies two weeks later,\" I said, \"so no one expects foul play.\"\n He grinned at me, his cigarette dangling from his lower lip. \"That\u0027s the beauty of it, lady.\"\n \"Your hands are registered as lethal weapons, are they not?\"\n \"They are. So, you\u0027re really a vampire?\"\n \"I really am.\"\n \"Jesus.\"\n \"He\u0027s not a vampire, as far as I\u0027m aware. Give me your hands.\"\n He did, hesitantly, setting aside the peas. I wasn\u0027t compelling him to do what I wanted, but I think he thought I was, and that was good enough. I took his hands and instantly had image after image of bar fights and street fights and back alley brawls. In all of them, Andre was wearing a hood and shades. In disguise.\n \"So, you often pick fights with your unsuspecting victims.\"\n He shrugged. I\u0027d seen the dim mak being delivered, a ferocious blow that left his opponents reeling and dazed.\n \"You\u0027ve killed dozens of people,\" I said.\n He shrugged again. \"Who\u0027s keeping track?\"\n I stared at him, unblinking. He looked back at me, and promptly blinked and looked away. I sensed his fear, I also sensed he was about to do something stupid.\n I said, \"Who hired you to kill Caesar Marquez?\"\n He shook his head. \"Sorry, babe. That\u0027s where my cooperation ends, vampire or no vampire.\"\n Except as he spoke the words, I saw a brief flash. An image. It appeared briefly in his thoughts and was gone. I released his hands and he sat back with the bag of peas.\n \"You can\u0027t prove any of this,\" he said. \"No one would believe you.\"\n \"True,\" I said. \"They wouldn\u0027t believe me, but they would believe you.\"\n He sat there and thought about it and smoked, and high above us, a low cloud briefly obscured the stars. The wind also picked up. Somewhere in the Malibu Hills, a coyote howled.\n \"No one can know about what I\u0027ve done,\" he said.\n I said nothing and watched him closely. I was certain I hadn\u0027t blinked in many, many minutes. He went on.\n \"My family is so proud. Everyone is so proud. That feels good. It feels good knowing that I did my family proud. We were so poor. The money was so easy.\" He was babbling now, and I saw the tears. \"Just one punch and I make thousands, tens of thousands. Sometimes, even more.\"\n I watched and waited, catching a brief glimpse of what he was planning on doing.\n \"I can\u0027t let my family down. I can\u0027t. They\u0027re so proud.\"\n I said nothing, and watched as Andre Fine, a five-time champion fighter, was reduced to tears and incomprehensible mumbling.\n I got up and left him there on the balcony. \n","sourceLink":"https://allnovel.net/vampire-games-vampire-for-hire-6/page-43.html","bookId":2135,"book":{"id":2135,"title":"Vampire Games (Vampire for Hire #6)","description":"Storyline: \n Vampire Games (Vampire for Hire #6) \n Six years ago federal agent Samantha Moon was the perfect wife and mother, your typical soccer mom with the minivan and suburban home. Then the unthinkable happens, an attack that changes her life forever. And forever is a very long time for a vampire. Now in Vampire Games, Samantha Moon is hired to look into the suspicious death of a popular fighter - and quickly discovers there\u0027s far more to the story than meets the eye. As she uncovers clues into the boxer\u0027s past, she will come face-to-face with something unexpected...and something only whispered about. Additionally, Samantha must confront the growing supernatural powers of those closest to her - and a betrayal that will rock her world.\n \n","cover":"https://allnovel.net/images/vampire-games-vampire-for-hire-6.jpg","author":"J.R. Rain","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/vampire-games-vampire-for-hire-6.html","creation":"Oct 5, 2019 8:58:22 AM","modification":"Oct 5, 2019 6:11:03 PM"}}
