{"id":67762,"no":34,"title":"Page 34","content":"For a while we let silence stretch between us. I dry the moisture from my face with my sleeve. Then I stand up. She stands with me. I’m amazed, as I was when I realized that she had been the one to rescue me from Salvage, that we are roughly the same height.\n “So what now?” I say. “Are you taking off again?”\n “I’ll go where the resistance needs me,” she says.\n I look away from her. “So you are leaving,” I say, feeling a dull weight settle in my stomach. Of course. That’s what people do in a disordered world, a world of freedom and choice: They leave when they want. They disappear, they come back, they leave again. And you are left to pick up the pieces on your own.\n A free world is also a world of fracture, just like The Book of Shhh warned us. There is more truth in Zombieland than I wanted to believe.\n The wind blows my mother’s hair across her forehead. She twists it back behind her ear, a gesture I remember from years ago. “I need to make sure that what happened to me—what I was made to give up—doesn’t happen again to anyone.” She finds my eyes, forcing me to look at her. “But I don’t want to leave,” she adds quietly. “I—I’d like to know you now, Magdalena.”\n I cross my arms and shrug, trying to find some of the hardness I have built during my time in the Wilds. “I don’t even know where to begin,” I say.\n She spreads her hands, a gesture of submission. “Me neither. But we can, I think. I can, if you’ll let me.” She cracks a small smile. “You’re part of the resistance too, you know. This is what we do: We fight for what matters to us. Right?”\n I meet her eyes. They are the clear blue of the sky stretched high above the trees, a high ceiling of color. I remember: Portland beaches, kite flying, macaroni salads, summertime picnics, my mother’s hands, a lullaby-voice singing me to sleep.\n “Right,” I say.\n We walk back, together, to the safe house.\n Hana\n The Crypts looks different from the way I remember it.\n I’ve been here only once before, on a school trip in third grade. Weirdly, I don’t remember anything about the actual visit, only that Jen Finnegan threw up in the bus afterward, and the air stank like tuna fish, even after the bus driver opened all the windows.\n The Crypts is situated at the northern border and backs up onto the Wilds and the Presumpscot River. That’s why so many prisoners were able to escape during the Incidents. The exploding shrapnel took out huge chunks of the border wall; the inmates who made it out of their cells just ran straight into the Wilds.\n After the Incidents, the Crypts was rebuilt, and a new, modern wing was attached. The Crypts was always monstrously ugly, but now it is worse than ever: The steel-and-cement addition runs up awkwardly against the old building, made of blackened stone, with its hundreds of tiny barred windows. It’s a sunny day, and beyond the high roof, the sky is a vivid blue. The whole scene feels off to me: This is a place that should never see sunlight.\n For a minute, I stand outside the gates, wondering whether I should turn around. I came by municipal bus, which took me all the way from downtown, emptying as we got closer and closer to this, its final destination. At last, I shared the bus with only the driver and a large, heavily made-up woman wearing nurse’s scrubs. As the bus rolled away, kicking up sprays of mud and exhaust, for a wild second I thought of running after it.\n But I have to know. I must.\n So I follow the nurse as she shuffles toward the guard hut just outside the gates and flashes her ID card. The guard’s eyes flick to me, and I wordlessly pass him a piece of paper.\n He scans the photocopy. “Eleanor?”\n I nod. I don’t trust myself to speak. In the photocopy, it’s impossible to make out many of her features, or distinguish the dishwater color of her hair. But if he looks too closely, he’ll see the details don’t line up: the height, the eye color.\n Fortunately, he doesn’t. “What happened to the original?”\n “Went through the dryer,” I reply promptly. “I had to apply to SVS for a replacement.”\n He turns his gaze back to the photocopy. I hope he can’t hear my heart, which is beating loud and hard.\n Getting the photocopy was no problem. A quick phone call to Mrs. Hargrove this morning, a proposed cup of tea, a twenty-minute chat, an expressed desire to use the bathroom—and then a two-minute detour to Fred’s study instead. I couldn’t risk being identified as Fred’s future wife. If Cassie is here, it’s possible that some of the wardens know Fred, too. And if Fred finds out I’ve been poking around the Crypts . . .\n He has already told me I must not ask questions.\n “Business?”\n “Just . . . visiting.”\n The guard grunts. He hands back my paper and waves me on as the gates begin to shudder open. “Check in at the visitors’ desk,” he grunts. The nurse gives me a curious look before scuttling ahead of me across the yard. I can’t imagine there are many visitors here.\n That’s the whole point. Lock them up and let them rot.\n I cross the yard and pass through a heavy, bolted steel door, and find myself in a claustrophobic entrance hall, dominated by a metal detector and several massive guards. By the time I get through the door, the nurse has already unloaded her purse onto the conveyor belt and is standing with her arms and legs spread as a guard moves over her body with a wand, checking her for weapons. She hardly seems to notice; she’s busy chatting with the woman manning the check-in desk to the right, which is situated behind bulletproof glass.\n “Same as always,” she’s saying. “The baby kept me up all night. I’m telling you, if 2426 gives me more problems today, I’ll put his ass on lockdown.”\n “Amen,” says the woman behind the desk. Then she turns her eyes to me. “ID?”\n We repeat the procedure all over again: I slide the paper through the gap in the window, explain that the original was ruined.\n “How can I help you?” she asks.\n I’ve been crafting my story carefully for the past twenty-four hours, but still I find the words come haltingly. “I—I’m here to visit my aunt.”\n “You know what ward she’s in?”\n I shake my head. “No, see . . . I didn’t even know she was here. I mean, I just found out. For most of my life, I thought she was dead.” The woman shows no reaction to this statement. “Name?”\n “Cassandra. Cassandra O’Donnell.” I squeeze my fists and focus on the pain running through my palms as she keys the name into her computer. I’m not sure whether I’m hoping her name will come up or not.\n The woman shakes her head. She has watery blue eyes and a mass of frizzy blond hair, which in this light appears to be the same dull gray as the walls. “Nothing here. You got an intake month?”\n How many years ago did Cassie disappear? I remember overhearing at Fred’s inauguration that he has been without a pair for three years.\n I hazard a guess. “January or February. Three years ago.”\n She sighs and hauls herself out of her chair. “Only went computerized last year.” She passes out of view, then returns with a large, leather-bound book, which she sets down on her side of the counter with a bang. She flips forward a few pages, then opens a window in the glass and slides the book out to me.\n “January and February,” she says shortly. “It’s all organized by date—if she came through here, she’ll be there.”\n The book is oversized, its pages crisscrossed with spidery writing, intake dates, prisoner names, and corresponding prisoner numbers. The period from January through February runs several pages, and I’m uncomfortably aware of the woman watching me impatiently as I move my finger slowly down the column of names.\n There’s a tight feeling in my stomach. She’s not here. Of course, I might have the dates wrong—or I might have been wrong altogether. Maybe she never came to the Crypts at all.\n I think of Fred laughing, saying, She doesn’t get much of an audience these days.\n “Any luck?” the woman asks, without real interest.\n “Just a second.” A bead of sweat rolls down my spine. I flip to April and continue my search.\n Then I see a name that stops me: Melanea O.\n Melanea. That was Cassandra’s middle name; I remember overhearing that at Fred’s inauguration, and seeing it on the letter I stole from Fred’s study.\n “Here,” I say. It makes sense that Fred would not have entered her under her real name. The point, after all, was to make her disappear.\n I push the book back through the plate-glass window. The woman’s eyes slide from Melanea O to the inmate number assigned to her: 2225. She keys this into the computer, repeating the number under her breath.\n “Ward B,” she says. “New wing.” She types a few more commands into her keyboard, and a printer behind her shudders to life, regurgitating a small white sticker with VISITOR—WARD B printed neatly across it. She slides it through the window to me, along with another, thinner, leather-bound book. “Sign your name and date in the visitors’ log, and mark the name of the person you’re visiting. Place the sticker on your chest; it must be visible at all times. And you’ll have to wait for an escort. Go on through security and I’ll page someone down here to get you.”\n She runs through this last speech quickly, tonelessly. I fish a pen from my bag and write Eleanor Latterly in the allotted position, praying she doesn’t ask to see my ID card. The visitor’s log is very slender. Only three visitors have come here in the past week.\n My hands have begun to shake. I have trouble wrestling off my jacket after the security guards instruct me that it must go on the conveyor belt. My bag and shoes are also placed in trays for inspection, and I have to stand with my arms and legs spread, as the nurse did, as one of the men pats me down roughly, waving a wand between my legs and over my breasts.\n “Clear,” he says, stepping aside to let me pass. Just past security is a small waiting area, outfitted with several cheap plastic chairs and a plastic table. Beyond that, I see various hallways branching, and signs pointing the way to different wards and portions of the complex. A TV is playing in the corner, muted: a political broadcast. I avert my eyes quickly, just in case Fred comes on the screen.\n A nurse with tufts of black hair and a shiny, greasy face comes slapping down the hallway toward me, wearing blue hospital clogs and floral scrubs. Her name card reads JAN.\n “You for Ward B?” she pants at me, when she comes close. I nod. Her perfume is vanilla, sickly sweet and too strong, but it still can’t completely conceal the other smells of the place: bleach, body odor.\n “This way.” She pads in front of me to a heavy set of double doors, using a hip to bump them open.\n Beyond the doors, the atmosphere changes. The hallway we’ve entered is sparkling white. This must be the new wing. The floors, walls, and even the ceiling are made of the same spotless paneling. Even the air smells different—cleaner and newer. It’s very quiet, but as we move down the hall, I hear the occasional sounds of muffled voices, the beeping of mechanical equipment, the slap-slap-slap of another nurse’s clogs down another hallway. \n","sourceLink":"https://allnovel.net/requiem-delirium-3/page-34.html","bookId":1718,"book":{"id":1718,"title":"Requiem (Delirium #3)","description":"Storyline: \n Requiem (Delirium #3) \n Now an active member of the resistance, Lena has transformed. The nascent rebellion that was underway in Pandemonium has ignited into an all-out revolution in Requiem, and Lena is at the center of the fight. After rescuing Julian from a death sentence, Lena and her friends fled to the Wilds. But the Wilds are no longer a safe haven. Pockets of rebellion have opened throughout the country, and the government cannot deny the existence of Invalids. Regulators infiltrate the borderlands to stamp out the rebels. \n As Lena navigates the increasingly dangerous terrain of the Wilds, her best friend, Hana, lives a safe, loveless life in Portland as the fiancée of the young mayor. Requiem is told from both Lena and Hana\u0027s points of view. They live side by side in a world that divides them until, at last, their stories converge.\n \n","cover":"https://allnovel.net/images/requiem-delirium-3.jpg","author":"Lauren Oliver","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/requiem-delirium-3.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:05:22 AM"}}
