{"id":67775,"no":47,"title":"Page 47","content":"“I’ll find you,” he says, watching me with the eyes I remember. “I won’t let you go again.”\n I don’t trust myself to speak. Instead I nod, hoping that he understands me. He squeezes my hand.\n “Go,” he says.\n So I do. Grace has paused to wait for me, and I take her thin little hand in mine, and soon I find that we are running: through the sun and the lingering smoke, through the grass on the shores that have become a graveyard, while the sun continues its indifferent rotation and the water reflects nothing but sky.\n As we approach the wall, I spot Hunter and Bram, standing side by side, sweating and brown, swinging at the concrete with large pieces of metal piping. I see Pippa, standing on a portion of the wall that remains, waving a vivid green shirt like a flag. I see Coral; fierce and beautiful, she passes in and out of view as the crowd surges and shifts around her. Several feet away, my mother works with a hammer, swinging easily and gracefully, making it look like a dance: this hard and muscled woman I hardly know, a woman I have loved my whole life. She is alive. We are alive. She will get to meet Grace.\n I see Julian, too. He is shirtless, sweating, balancing on a heap of rubble, working the butt of a rifle against the wall, so that it splinters and sends a fine spray of white dust onto the people beneath him. The sun makes his hair blaze like a ring of pale fire, touches his shoulders with white wings.\n For a second, I feel a sense of overwhelming grief: for how things change, for the fact that we can never go back. I’m not certain of anything anymore. I don’t know what will happen—to me, to Alex and to Julian, to any of us.\n “Come on, Lena.” Grace is tugging at my hand.\n But it’s not about knowing. It is simply about going forward. The cureds want to know; we have chosen faith instead. I asked Grace to trust me. We will have to trust too—that the world won’t end, that tomorrow will come, and that truth will come too.\n An old line, a forbidden line from a text Raven once showed me, comes back to me now. He who jumps may fall, but he may also fly.\n It’s time to jump.\n “Let’s go,” I say to Grace, and let her lead me into the surge of people, keeping a tight hold on her hand the whole time. We push into the shouting, joyful throng, and fight our way up toward the wall. Grace scrabbles up a pile of broken-down wood and shards of shattered concrete, and I follow clumsily, until I am balancing next to her. She is shouting—louder than I have ever heard her, a babble-language of joy and freedom—and I find that I join in with her as together we begin to tear at chunks of concrete with our fingernails, watching the border dissolve, watching a new world emerge beyond it.\n Take down the walls.\n That is, after all, the whole point. You do not know what will happen if you take down the walls; you cannot see through to the other side, don’t know whether it will bring freedom or ruin, resolution or chaos. It might be paradise or destruction.\n Take down the walls.\n Otherwise you must live closely, in fear, building barricades against the unknown, saying prayers against the darkness, speaking verse of terror and tightness.\n Otherwise you may never know hell; but you will not find heaven, either. You will not know fresh air and flying.\n All of you, wherever you are: in your spiny cities, or your one-bump towns. Find it, the hard stuff, the links of metal and chink, the fragments of stone filling your stomach. And pull, and pull, and pull.\n I will make a pact with you: I will do it if you will do it, always and forever.\n Take down the walls. \n","sourceLink":"https://allnovel.net/requiem-delirium-3/page-47.html","bookId":1718,"book":{"id":1718,"title":"Requiem (Delirium #3)","description":"Storyline: \n Requiem (Delirium #3) \n Now an active member of the resistance, Lena has transformed. The nascent rebellion that was underway in Pandemonium has ignited into an all-out revolution in Requiem, and Lena is at the center of the fight. After rescuing Julian from a death sentence, Lena and her friends fled to the Wilds. But the Wilds are no longer a safe haven. Pockets of rebellion have opened throughout the country, and the government cannot deny the existence of Invalids. Regulators infiltrate the borderlands to stamp out the rebels. \n As Lena navigates the increasingly dangerous terrain of the Wilds, her best friend, Hana, lives a safe, loveless life in Portland as the fiancée of the young mayor. Requiem is told from both Lena and Hana\u0027s points of view. They live side by side in a world that divides them until, at last, their stories converge.\n \n","cover":"https://allnovel.net/images/requiem-delirium-3.jpg","author":"Lauren Oliver","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/requiem-delirium-3.html","creation":"Oct 5, 2019 8:57:53 AM","modification":"Oct 5, 2019 10:05:22 AM"}}
