{"id":30422,"no":1,"title":"THE NEW ARRIVAL","content":"The bush was alive with excitement. Mrs Koala had a brand new baby, and the news spread like wildfire. The kookaburras in the highest gum-trees heard of it, and laughed and chuckled at the idea. In and out of their burrows the rabbits came scuttling, their big brown eyes opening wide with wonder as they heard the news. Over the grass the message went where Mrs Kangaroo was quietly hopping towards her home. She fairly leapt in the air with joy. \"I must tell Mr Kangaroo!\" she cried and bounded away in great hops and leaps. Even Mrs Snake, who was having a nap, awoke, gave a wriggle, and blinked her wicked little eyes. The whole bushland was twittering with the news, for a baby bear was a great event. Mrs Koala had a baby every two years, and as Mrs Rabbit had very, very many during that time, you can just imagine how surprised everyone was. In the fork of a gum-tree, far above the ground, Mrs Koala nursed her baby, peeping every now and then at the tiny creature in her pouch. This little baby was the funniest wee creature. He was only about an inch long and covered with soft baby fur, had two big ears, compared to the size of the rest of him, a tiny black nose, and two beady eyes. His mother and father always had a surprised look on their faces, but they looked more surprised than ever now as they gazed at their baby. \\n\\n Blinky Bill \\n\\n \\n\\n He peeped at them and blinked, as much as to say, \"Aren\u0027t you glad I\u0027m here?\" \\n\\n \\n\\n Mr Koala puffed out his cheeks with pride, and his wife hugged her baby tighter than ever. \\n\\n \\n\\n There had been quite a lot of quarrelling and jealousy among the bush folk as to who should be the baby\u0027s nurse. \\n\\n \\n\\n Mrs Kookaburra was the first to offer her services, and she came flying over to the tree where the Koalas lived. Knocking on the tree with her strong beak she asked if she might come in. \\n\\n \\n\\n \"Certainly,\" said Mrs Bear, \"if you don\u0027t laugh and wake the baby up.\" \\n\\n \\n\\n \"Do you want a nurse for him?\" Mrs Kookaburra anxiously inquired. \\n\\n \\n\\n \"Yes, I do,\" Mrs Bear replied. \\n\\n \\n\\n \"Will I do?\" Mrs Kookaburra asked. \\n\\n \\n\\n \"Oh, no!\" said Mrs Bear. \"Your laugh is so loud and you chuckle so long that you\u0027d wake the baby up.\" \\n\\n \\n\\n Poor Mrs Kookaburra was very disappointed and flew off to tell Mrs Magpie about it. \\n\\n \\n\\n \"I\u0027ll go over and see if I can be the nurse,\" said Mrs Magpie. \"Mrs Bear is very particular and I\u0027m sure I will suit.\" She gave her feathers a fluff and sharpened her beak, then straight to the Koalas\u0027 home she flew. \\n\\n Go away Mrs. Snake! \\n\\n \\n\\n \"Come in,\" called Mrs Bear on hearing the peck at the tree. \\n\\n \\n\\n \"Good morning, Mrs Koala. I hear you are wanting a nurse for the baby. I\u0027m sure I could keep the young scamp in order as I\u0027ve had a few dozen myself.\" \\n\\n \\n\\n \"Thank you, Mrs Magpie,\" said Mrs Bear very politely, \"but I don\u0027t like the look of your beak. You could give a very nasty peck with it.\" \\n\\n \\n\\n \"They all want a peck sometimes,\" said Mrs Magpie in a very cross tone. At this the baby bear popped his head right out of his mother\u0027s pouch and blinked very hard. \\n\\n \"They all want a peck sometimes.\" said Mrs. Magpie. \\n\\n \\n\\n \"If you are so particular, I\u0027ll send along a friend of mine who will suit you very well.\" And saying this Mrs Magpie gave the tree a savage peck and flew off. Imagine Mrs Koala\u0027s surprise when she peeped down the tree later on and saw Mrs Snake slowly wriggling her way upwards. Oh, she was frightened! \\n\\n \\n\\n \"Go away, Mrs Snake!\" she called in a loud voice. \\n\\n \\n\\n \"I\u0027ve come to nurse the baby; Mrs Magpie sent me.\" And Mrs Snake wriggled higher up the tree. Right on to the branch where Mrs Koala sat she came, and coiled herself round the fork. \\n\\n \\n\\n \"I don\u0027t want a nurse.\" And poor frightened Mrs Bear tried to push the baby\u0027s head back in the pouch. But he would peep out. \\n\\n \\n\\n \"He\u0027s a nice little fellow, and like his daddy,\" said Mrs Snake slyly. \"I can take him along on my back for such lovely rides up and down trees and in and out big black holes.\" \\n\\n \\n\\n Hearing this Mrs Bear nearly fell off the tree with fright, and began to cry. \\n\\n \\n\\n Now Mr Koala had been listening to Mrs Snake as he sat on a branch just round the corner. Slowly he climbed over to Mrs Snake and caught her in his claws. Before anyone had time to see what was happening he pushed her off the branch and she went tumbling to the ground below. Two very frightened bears peeped down from the tree, and there they saw Mrs Snake slowly crawling away in the grass. \\n\\n \\n\\n They were just beginning to recover from this fright when a thump, thump, thump, was heard on the ground at the foot of the tree. \\n\\n \\n\\n \"Who\u0027s there?\" called Mrs Bear in a very frightened voice. \\n\\n \\n\\n \"It\u0027s just me!\" came the reply. \\n\\n \\n\\n \"Who\u0027s me?\" growled Mr Bear. \\n\\n \\n\\n \"Angelina Wallaby,\" called a very soft voice. \\n\\n \\n\\n \"Come up, come up,\" Mrs Bear replied. \\n\\n \\n\\n \"I can\u0027t climb; my tail is all wrong,\" said Angelina. \\n\\n \\n\\n \"Well, I\u0027ll come down, if Mrs Snake is nowhere about,\" said Mrs Bear. And she slowly started to scramble down the tree. Very carefully she went, always grasping the tree with her strong claws, her back showing all the time, while she cleverly looked over her shoulder now and then to see that all was safe below. It took her quite a time to reach the ground and she felt very nervous. \\n\\n \\n\\n Angelina Wallaby hopped over to her and gazed in wonderment at the baby. \\n\\n \\n\\n \"What a dear little fellow!\" she said, her great brown eyes rounding with excitement. At the same time she put out her paws to touch him. \\n\\n \\n\\n \"Oh, don\u0027t!\" cried Mrs Bear. \"He is so small and your nails might hurt him.\" \\n\\n \\n\\n \"I\u0027ve been all the morning blunting them on a stone so that I could pat him,\" said Angelina in a disappointed voice. \\n\\n \\n\\n \"Oh, I\u0027m sorry,\" said Mrs Bear. \"I did not mean to be rude, but Mrs Snake gave me such a fright.\" \\n\\n \\n\\n \"I\u0027ll be ever so gentle,\" said Angelina, \"if you let me pat him just this once.\" \\n\\n \\n\\n \"Very well,\" smiled Mrs Bear as she opened her pouch. \\n\\n \\n\\n Angelina Wallaby patted him twice, then sniffed him all over with her soft muzzly nose. Now her eyelashes caught in his little toes: but Angelina did not mind, as she had had babies herself and knew just what to do. \\n\\n \\n\\n \"I wish I could mind him for you sometimes, Mrs Bear. I\u0027d be so gentle with him.\" \\n\\n \\n\\n \"I\u0027m sure you would be the very kindest nurse,\" replied Mrs Bear. \"But what could you do for him?\" \\n\\n \\n\\n \"I would come along in the evenings, and take him out for a walk. I\u0027ve got a pouch just like yours, and I\u0027d tuck him in it and hop along very gently, so he wouldn\u0027t feel the bumps.\" \\n\\n \\n\\n \"I think that is a good idea,\" said Mrs Bear. \\n\\n \\n\\n So it was arranged that Mrs Bear should climb down the tree every evening and meet Angelina Wallaby who would take the baby for a walk in the bush. \\n\\n \\n\\n Imagine how proud Angelina felt! She hopped home very quickly that evening to tell her friends the news. \\n\\n \\n\\n Next day, just as the sun was setting, she came to the foot of the gum-tree and thumped three times on the ground with her tail. Mrs Bear peeped around the corner of her home and, seeing Angelina at the foot of the tree, called out: \\n\\n \\n\\n \"I\u0027m coming down with the baby, so watch for Mrs Snake.\" Then she carefully and slowly climbed to the bottom of the tree. \\n\\n \\n\\n \"Is the coast clear?\" she anxiously asked. \\n\\n \\n\\n \"Yes, Mrs Bear. I passed Mrs Snake on the road a mile away.\" \\n\\n \\n\\n \"Well, do be careful, Angelina; and bring him back before the day breaks. Is your pouch warm?\" And Mrs Bear inspected Angelina\u0027s pouch. \\n\\n \\n\\n \"Yes, Mrs Bear. It may be a trifle large, so I padded it well with grass; but it\u0027s very warm and not a bit draughty.\" \\n\\n \\n\\n So the baby was carefully taken from his mother\u0027s pouch and gently placed in Angelina\u0027s. \\n\\n \\n\\n Waving a paw to Mrs Bear she took a hop and then peeped down at the baby to see what he thought of it. Taking several more hops she soon started away for the bush track and in no time came to Mrs Rabbit\u0027s home. Thumping her tail on the ground, she waited a moment. Mrs Rabbit popped her head out of the burrow. \\n\\n \\n\\n \"Good evening, Mrs Rab. I\u0027ve brought the baby to show you.\" \\n\\n \\n\\n \"Good gracious, how lovely!\" said Mrs Rabbit as Angelina gently drew the baby bear from her pouch. Several more bunnies came round to inspect the new arrival. \\n\\n \\n\\n \"Just look at his ears!\" cried Mrs Rabbit. \"I\u0027m sure I\u0027d never hear with those furry things. And, oh dear, no tail!—Well, well! Take care he does not catch cold. I really think he should have a tail to keep him warm. I have a spare one hanging on the wall of the burrow. Poor Mr Rabbit was shot, and I found his skin near by; but I managed to bite off the tail and bring it home.\" Here poor Mrs Rabbit burst into tears. \\n\\n \"Here\u0027s just the thing!\" Mrs. Rabbit cried. \\n\\n \\n\\n \"Never mind, my dear,\" said Angelina soothingly. \"If it will please you, we will tie it on the baby.\" \\n\\n \\n\\n Mrs Rabbit dried her eyes with her paw and went sniffling down into the burrow. \\n\\n \\n\\n \"I won\u0027t be a moment,\" she called from somewhere down under the ground. \\n\\n \\n\\n Up she came in a very short time carrying the tail in her two front paws. \\n\\n \\n\\n \"What can we sew it on with?\" inquired Angelina. \\n\\n \\n\\n \"We\u0027ll tie it on with a piece of grass.\" And Mrs Rabbit hopped round until she found a nice long piece. \\n\\n \\n\\n \"Here\u0027s just the thing!\" she cried, and came hopping back with it in her teeth. \\n\\n \\n\\n Angelina excitedly pulled the baby out of her pouch, and together they fastened the tail on. It did look funny, as it was almost as long as the baby; but it certainly would keep him warm. \\n\\n \\n\\n Bidding her friend good night she hopped on her way. The moon was now shining brightly and all the bush was hushed, except for the sound of those little animals who are always busy at night-time. Angelina sniffed the night air with delight and felt very happy as she thought of the baby in her pouch. Hopping along between the great grey gum-trees she was suddenly startled to see Mrs Snake lying right across her pathway. \\n\\n \\n\\n \"Ha, ha, Mrs Wallaby,\" called the wicked Mrs Snake, \"so you\u0027re the baby\u0027s nurse. Well, I want to have a look at him.\" \\n\\n \\n\\n \"Oh, you can\u0027t!\" cried Angelina. \"He\u0027ll catch cold if I take him out of my pouch.\" \\n\\n \\n\\n \"No, he won\u0027t, the night is warm,\" said Mrs Snake. \"Show him to me at once.\" \\n\\n \\n\\n Angelina thought very quickly, and darting her paws into her pouch she untied the rabbit\u0027s tail and pulled it out. \\n\\n \\n\\n \"There you are, Mrs Snake,\" she cried. \"Isn\u0027t he beautiful?\" \\n\\n \\n\\n Mrs Snake did not stop to look. She sprang at the tail and bit it savagely. \\n\\n She sprang at the tail and bit it savagely. \\n\\n \\n\\n \"Ha, ha, ha,\" she laughed, \"there will be no baby to take home now.\" \\n\\n \\n\\n Poor Angelina got such a fright she did not waste a moment, but hopped away as fast as her legs could carry her. On and on she went, breathless with fear, not daring to look behind. She reached the foot of the gum-tree and thumped wildly with her tail. Mrs Bear came scurrying down the tree and listened to the story. Then grabbing her baby she quickly climbed to safety. Angelina waited at the foot of the tree until she saw Mrs Bear safely home, then hopped away to the bushland. \\n\\n \\n\\n After that, Mrs Koala decided to keep her baby at home. Every day he grew bigger and stronger, until he was six months old. Then his mother thought it quite time he learnt to ride on her back, as the pouch was getting too small to hold such a big baby. So with Mr Bear\u0027s help they taught the baby to cling to the long fur of her back and only during the cold nights was he allowed to climb into her pouch. He was now growing very big. When eight months old he could no longer crawl into the snug pouch at all. So his baby days were over. He became very cunning too. When his mother was feeding, he learnt to stretch out his arms and pull the tenderest leaves into his mouth. He soon reached the age of one year, and measured ten inches, while his weight was about three pounds. Strange as it may seem, Mrs Koala had not thought of a name for her baby. Now, she thought it quite time he was christened; so one day she talked the matter over with his father. \"Shall we call him \u0027Walter\u0027 or \u0027Bluegum\u0027?\" she inquired. \\n\\n \\n\\n \"No,\" grunted Mr Koala. \"Let\u0027s call him \u0027Blinky Bill\u0027.\" So Blinky Bill he became from that moment. \\n\\n \\n\\n \"Well, my dear, I\u0027ll arrange about the christening,\" said Mrs Koala. \"My cousin the Reverend Fluffy Ears will perform the ceremony. And, of course, we must choose his godfather and godmother.\" \\n\\n \\n\\n \"Jacko Kookaburra will be his godfather,\" said Mr Bear. \"We will send him a message over the wireless, as he is so well known; and Angelina Wallaby would be sure to jump with joy if we asked her to be godmother.\" \\n\\n \\n\\n So that night when all was quiet Mr Koala tapped out a message on the gum-leaves calling the Gippsland bush folk. \\n\\n \\n\\n \"Will Mr Jacko Kookaburra speak, please—Koala senior is calling.\" \\n\\n \\n\\n Rat-a-tat-tat—came the reply on the leaves. \\n\\n \\n\\n \"Jacko here. What can I do for you?\" \\n\\n \\n\\n \"Will you be Blinky Bill\u0027s godfather?\" Mr Koala tapped back. \\n\\n \\n\\n \"Only too pleased,\" came the quick reply. \\n\\n \\n\\n \"I\u0027ll be along next week. Sorry I\u0027m broadcasting every night this week.\" \\n\\n \\n\\n Angelina, who seldom uttered a sound, purred with pleasure when she was asked to be godmother, and hurried home to make a present for the christening. \\n\\n \\n\\n The great day arrived. In a quiet corner of the bush, down by a little stream surrounded with bells and flannel flowers, everyone came from far and near to see young Bill christened. \\n\\n \\n\\n The Reverend Fluffy Ears looked very important with a white collar made from the bark of the paper-tree. He also held in his paws a book of gum-leaves, from which he read. \\n\\n \"Silence!\" roared the Reverend Fluffy Ears. \\n\\n \\n\\n Mr and Mrs Koala smiled at everyone, and everyone smiled at Blinky Bill. Jacko looked spick and span, and of course, being a widely travelled gentleman, he took things very quietly. At the same time, he gave a dig in the ground with his beak every now and then and swallowed a fat worm. Angelina looked sweet in her nut-brown coat, and her large eyes watched Blinky Bill all the time. She had made a ball of fur for him to play with, and he cuddled and hugged it closely all the time. \\n\\n \\n\\n Mrs Rabbit rang the bells and everyone sat down or perched. \\n\\n \\n\\n The Reverend Fluffy Ears spoke as he took Blinky Bill in his arms. \\n\\n \\n\\n \"What shall I name this young bear?\" he asked. \\n\\n \\n\\n \"Blinky Bill,\" said Mr Koala. \\n\\n \\n\\n At once the bush was filled with laughter. Wild kookaburras who were no relation to Jacko had flown into a nearby tree, and they made a terrible din, chuckling and laughing at the top of their voices. Nobody could speak for the noise. \\n\\n \\n\\n \"Silence!\" roared the Reverend Fluffy Ears. But it was useless. They took no notice. \\n\\n \\n\\n \"I\u0027ll speak to the young larrikins,\" said Jacko, and he gave the call for all to listen. \\n\\n \\n\\n Immediately the laughter ceased. \\n\\n \\n\\n \"I\u0027m Jacko,\" he said, \"and if you birds up in that tree don\u0027t keep quiet I\u0027ll tell everyone over the radio what rude kookaburras you are and that you are no relation to me.\" \\n\\n \\n\\n Hearing this, the wild kookaburras became very quiet, as they wanted everyone to think they were related to Jacko. He was such a wonderful bird that if they were asked in turn who was their cousin or uncle all would reply—\"Jacko\". So you see, they had good reason to keep quiet. Blinky Bill had water from the stream sprinkled on his head, much to his surprise, and the ceremony ended without any more interruptions. He was carried home again on his mother\u0027s back, feeling very important after all the fuss and petting. That night up in the fork of the white gum-tree Mrs Koala told him that he was now a youth and that if he were a human being he would be put in knickerbockers. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/1487/44520.html","bookId":664,"book":{"id":664,"title":"Blinky Bill","description":"简介： The bush was alive with excitement. Mrs Koala had a brand new baby, and the news spread like wildfire. The kookaburras in the highest gum-trees heard of it, and laughed and chuckled at the idea. In and out of their burrows the rabbits came scuttling,...","cover":"http://novel.tingroom.com/file/upload/201602/03/11-16-26-15-1.jpg","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/1487","creation":"Aug 1, 2019 12:19:07 AM","modification":"Aug 1, 2019 12:19:07 AM"}}
