{"id":79528,"no":21,"title":"Page 21","content":"\"STOP!\" R.V. screamed as my blade descended, and something in his voice made me pause and look back. My heart sank - he had Debbie! He was holding her as Steve had, the hooks of his golden right hand pressed up into the flesh of her jaw. A couple of hooks had lightly punctured the skin and thin streams of blood trickled down the golden blades. \"Drop the knife or I slit her like a pig!\" R.V. hissed.\n If I dropped the knife, Debbie would die anyway, along with the rest of us. There was only one thing for it - I had to try and force a stand-off. Grabbing Steve by his long grey hair, I jammed my knife against the flesh of his throat. \"If she dies, he dies,\" I growled and I saw doubt fill R.V.\u0027s eyes.\n \"Don\u0027t play games with me,\" the hook-handed vampaneze warned. \"Let him go or I kill her.\"\n \"If she dies, he dies,\" I said again.\n R.V. cursed, then glanced over his shoulder for help. The battle was going the way of the vampaneze. Those who\u0027d stumbled in the first few seconds of the fight had regained their feet, and now encircled Vancha, Mr. Crepsley and Harkat, who fought back to back, protecting each other, unable to advance or retreat. Beyond the crush, Gannen Harst and the Lord of the Vampaneze looked on.\n \"Forget about them,\" I said. \"This is between you and me. It\u0027s got nothing to do with anybody else.\" I managed a weak smile. \"Or are you afraid to face me on your own?\"\n R.V. sneered. \"I\u0027m afraid of nothing, man. Except...\" He stopped.\n Guessing what he\u0027d been about to say, I put my head back and howled like a wolf. R.V.\u0027s eyes widened with fear at the sound, but then he collected himself and stood firm. \"Howling won\u0027t save your tasty little girlfriend,\" he taunted me.\n I had a strange sense of deja vu - Murlough used to speak that way about Debbie, and for a moment it was as though the spirit of the dead vampaneze was alive inside R.V. Then I put such macabre thoughts behind me and concentrated.\n \"Let\u0027s stop wasting each other\u0027s time,\" I said. \"You put Debbie aside, I\u0027ll put Steve aside, and we\u0027ll settle this man to man, winner takes all.\"\n R.V. grinned and shook his head. \"No deal. I don\u0027t have to risk my neck. I\u0027m holding all the cards.\"\n Keeping Debbie in front of him, he edged towards the exit at the opposite side of the room, skirting the vampaneze.\n \"What are you doing?\" I shouted, moving to block him.\n \"Stay back!\" he roared, digging his hooks deeper into Debbie\u0027s jaw, causing her to gasp with pain.\n I stopped uncertainly. \"Let her go,\" I said quietly, desperately.\n \"No,\" he replied. \"I\u0027m taking her. If you try to stop me, I\u0027ll kill her.\"\n \"I\u0027ll kill Steve if you do.\"\n He laughed. \"I don\u0027t care for Steve as much as you care for precious little Debbie. I\u0027ll sacrifice my friend if you\u0027ll sacrifice yours. How about it, Shan?\" I studied Debbie\u0027s round, terrified eyes, then took a step back, clearing the way for R.V. to pass. \"Wise move,\" he grunted, easing past, not turning his back on me.\n \"If you harm her...\" I sobbed.\n \"I won\u0027t,\" he said. \"Not for the time being. I want to see you squirm before I do. But if you kill Steve or come after me...\" His cold, mismatched eyes told me what would happen.\n Laughing, the hook-handed monster slipped past the vampaneze, then past Gannen Harst and his Lord, vanishing into the gloomy darkness of the tunnel beyond, taking Debbie with him, leaving me arid the others to the mercy of the vampaneze.\n Now that Debbie was beyond saving, my choices were clear. I could try to help my friends, who were trapped by the vampaneze, or go after the Vampaneze Lord. It took me no time to choose. I couldn\u0027t rescue my friends - there were just too many vampaneze and vampets - and even if I could, I wouldn\u0027t have - the Vampaneze Lord came first. I\u0027d momentarily forgotten that when Steve seized Debbie, but now my training reasserted itself. Across the way, Steve was still unconscious. No time to finish him off - I\u0027d do it later, if possible. Sneaking around the vampaneze, drawing my sword, meaning to take on Gannen Harst and the figure he guarded.\n Harst spotted me, put his fingers to his mouth and whistled loudly. Four of the vampaneze at the rear of the group looked to him, then followed the direction of his finger as he pointed towards me. Turning away from the ruckus, they blocked my path, then advanced.\n I might have tried to fight my way through them, hopeless as it was, but then I saw Gannen Harst call another two vampaneze away from the fighting. He gave the Vampaneze Lord to them and they exited down the tunnel that R.V. had fled through. Gannen Harst swung the huge door shut after them and spun a large, circular lock at the centre of it. Without the combination, it would be impossible to get through a door as thick as that.\n Gannen Harst stepped up behind the four vampaneze who were converging on me. He clicked his tongue against the roof of his mouth and the vampaneze came to a standstill. Harst looked into my eyes, then made the death\u0027s touch sign by pressing his middle finger to the centre of his forehead, the two adjacent fingers over his eyes, and spreading his thumb and little finger out wide. \"Even in death, may you be triumphant,\" he said.\n I glanced around swiftly, taking in the state of play. Close to my right, the battle still raged. Mr. Crepsley, Vancha and Harkat were cut in many places, bleeding liberally, yet none had sustained fatal wounds. They were on their feet, weapons in hand - except Vancha, whose weapons were his hands - keeping the circle of vampaneze and vampets at bay.\n I couldn\u0027t understand it. Given our foes\u0027 superior numbers, they should have overwhelmed and dispatched the trio by now. The longer the fighting progressed, the more damage we were inflicting - at least six vampets and three vampaneze were dead, and several more nursed life-threatening injuries. Yet still they fought warily, judging their blows with care, almost as though they didn\u0027t want to kill us.\n I reached a snap decision and knew what I had to do. I faced Gannen Harst and screamed, \"I\u0027ll be triumphant in life!\" in defiance, then whipped out a knife and launched it at the vampaneze, throwing it deliberately high. As the five vampaneze ahead of me ducked to avoid the knife, I swivelled and swung with my sword at the vampaneze and vampets packed tightly around Mr. Crepsley, Vancha and Harkat. Now that the Lord of the Vampaneze was beyond reach, I was free to help or perish with my friends. A few moments earlier, we\u0027d surely have perished, but the pendulum had swung round slightly in our favour. The pack had been whittled down by half a dozen members - two had left with their Lord, and four more were standing with Gannen Harst. The remaining vampaneze and vampets had spread themselves out to cover for their missing clansmen.\n My sword connected with the vampaneze to my right, and narrowly missed the throat of a vampet to my left. The vampaneze and vampet both stepped aside at the same moment, instinctively, in opposite directions, creating a gap. \"To me!\" I cried at the trio trapped in the middle of the mayhem.\n Before the gap could be filled, Harkat burst through, chopping with his axe. More vampaneze and vampets drew back, and Mr. Crepsley and Vancha hurried after Harkat, fanning out around him, turning so that they were all facing the same way, instead of having to fight back to back.\n We retreated swiftly towards the tunnel leading out of the cavern.\n \"Quick - block the exit!\" one of the four vampaneze with Gannen Harst yelled, moving forward to bar our way.\n \"Hold,\" Gannen Harst responded quietly and the vampaneze stopped. He looked back at Harst, puzzled, but Harst only shook his head grimly.\n I wasn\u0027t sure why Harst had prevented his men from blocking our one route of escape, but I didn\u0027t stop to ponder it. As we backed up towards the exit, lashing out at the vampaneze and vampets who pushed forward after us, we passed Steve. He was regaining his senses and was half sitting up. I paused as we came abreast of him, grabbed him by his hair and hauled him to his feet. He yelped and struggled, but then I stuck the edge of my sword to his throat and he went quiet. \"You\u0027re coming with us!\" I hissed in his ear. \"If we die, so do you.\" I\u0027d have killed him then and there, except I remembered what R.V. had said - if I killed Steve, he\u0027d kill Debbie.\n As we came to the mouth of the tunnel, a vampet swung a short length of chain at Vancha. The vampire grabbed the chain, yanked the vampet in, caught him by the head, and made to twist it sharply to the right, meaning to snap his neck and kill him.\n \"Enough!\" Gannen Harst bellowed and the vampaneze and vampets closing upon us instantly stopped fighting and dropped back two paces.\n Vancha relaxed his lock, but didn\u0027t release the vampet, and glared around suspiciously. \"What now?\" he muttered.\n \"I do not know,\" Mr. Crepsley said, wiping sweat and blood from his brow. \"But they fight most bizarrely. Nothing they do would surprise me.\"\n Gannen Harst pushed through the vampaneze until he was standing in front of his brother. The two didn\u0027t look alike - where Vancha was burly, gruff and rough, Gannen was slim, cultured and smooth - but there was a certain way they had of standing and inclining their heads that was very similar.\n \"Vancha,\" Gannen greeted his estranged brother.\n \"Gannen,\" Vancha replied, not letting go of the vampet, watching the other vampaneze like a hawk in case they made any sudden moves.\n Gannen looked at Mr. Crepsley, Harkat and me. \"We meet again,\" he said, \"as was destined. Last time, you had the beating of me. Now the tables have turned.\" He paused and gazed around the room at the silent vampaneze and vampets, then at their dead and dying colleagues. Then he glanced at the tunnel behind us. \"We could kill you here, in this tunnel, but you would take many of us with you,\" he sighed. \"I tire of needless bloodshed. Shall we strike a deal?\"\n \"What sort of a deal?\" Vancha grunted, trying to hide his bewilderment.\n \"It would be easier for us to slaughter you in the larger tunnels beyond this one. We could pick you off, in our own time, possibly without losing more of our men.\"\n \"You want us to make your job easier for you?\" Vancha laughed.\n \"Let me finish,\" Gannen continued. \"As things stand, you have no hope of making it back to the surface alive. If we attack you here, our losses will be great, but all four of you will certainly die. If, on the other hand, we were to give you a head start...\" He trailed off into silence, then spoke again. \"Fifteen minutes, Vancha. Leave your hostages - you can move more quickly without them - and flee. For fifteen minutes, nobody will follow. You have my word.\"\n \"This is a trick,\" Vancha snarled. \"You wouldn\u0027t let us go, not like this.\"\n \"I don\u0027t lie,\" Gannen said stiffly. \"The odds are still in our favour - we know these tunnels better than you do, and will probably catch you before you make it to freedom. But this way you have hope - and I won\u0027t have to bury any more of my friends.\"\n Vancha exchanged a furtive glance with Mr. Crepsley.\n \"What about Debbie?\" I shouted before either vampire could speak. \"I want to take her too!\"\n Gannen Harst shook his head. \"I command those in this room,\" he said, \"but not he of the hooks. She is his now.\"\n \"Not good enough,\" I snorted. \"If Debbie doesn\u0027t leave, I don\u0027t either. I\u0027ll stay here and kill as many of you as I can.\"\n \"Darren-\" Vancha began to protest.\n \"Do not argue,\" Mr. Crepsley intervened. \"I know Darren - your words would be wasted. He will not leave without her. And if he will not leave, nor will I.\"\n Vancha cursed, then looked his brother clean in the eye. \"There you have it. If they won\u0027t go, I won\u0027t either.\"\n Harkat cleared his throat. \"These fools don\u0027t speak... for me. I\u0027ll go.\" Then he smiled to show he was joking.\n Gannen spat between his feet, disgusted. In my arms, Steve stirred and groaned. Gannen studied him for a moment, then looked at his brother again. \"Let\u0027s try this then,\" Gannen said. \"R.V. and Steve Leonard are close friends. Leonard designed R.V.\u0027s hooks and persuaded us to blood him. I don\u0027t think R.V. would kill the woman if it meant Leonard\u0027s death, despite his threats. When you leave, you can take Leonard with you. If you escape, perhaps you\u0027ll be able to use him to bargain for the woman\u0027s life at a later time.\" He squinted at me warningly. \"That is the best I can do - and it\u0027s more than you have a right to expect.\"\n I thought it over, realized this was Debbie\u0027s only real hope, and nodded imperceptibly.\n \"Is that a yes?\" Gannen asked.\n \"Yes,\" I croaked.\n \"Then go now!\" he snapped. \"From the moment you start to walk, the clock begins to tick. In fifteen minutes, we come - and if we catch you, you die.\"\n At a signal from Gannen, the vampaneze and vampets drew back and regrouped around him. Gannen stood in front of them all, hands folded across his chest, waiting for us to leave.\n I shuffled forward to my three friends, pushing Steve ahead of me. Vancha still had hold of his captured vampet and was gripping him as I gripped Steve. \"Is he serious?\" I asked in a whisper.\n \"It seems so,\" Vancha replied, though I could tell he hardly believed it either.\n \"Why is he doing this?\" Mr. Crepsley asked. \"He knows it is our mission to kill the Lord of the Vampaneze. By offering us this opportunity, he frees us to perhaps recover and strike again.\"\n \"It\u0027s crazy,\" Vancha agreed, \"but we\u0027d be just as crazy to look this gift horse in the mouth. Let\u0027s get out before he changes his mind. We can debate it later - if we survive.\"\n Keeping his vampet in front of him, as a shield, Vancha retreated. I followed, an arm wrapped around Steve, who was fully conscious now, but too groggy to make a break for freedom. Mr. Crepsley and Harkat came after us. The vampaneze and vampets watched us leave. Many of the red or red-rimmed eyes were filled with loathing and disgust - but none pursued us.\n We backed up through the tunnel for a while, until we were certain we weren\u0027t being followed. Then we stopped and exchanged uncertain looks. I opened my mouth to say something, but Vancha silenced me before I spoke. \"Let\u0027s not waste time.\" Turning, he pushed his vampet ahead of him and began jogging. Harkat took off after him, shrugging helplessly at me as he passed. Mr. Crepsley pointed at me to go next, with Steve. Shoving Steve in front, I poked him in the back with the tip of my sword, and roughly encouraged him forward at a brisk pace.\n Up through the long, dark tunnels we padded, the hunters and their prisoners, beaten, bloodied, bruised and bewildered. I thought about the Vampaneze Lord, the insane R.V. and his hapless prisoner - Debbie. It tore me up inside to leave her behind, but I had no choice. Later, if I lived, I\u0027d return for her. Right now I had to think only of my own life. With a great effort, I thrust all thoughts of Debbie from my head and concentrated on the path ahead. At the back of my mind, unbidden, a clock formed, and with every footstep I could hear the hands ticking down the seconds, cutting away at our period of grace, bringing us relentlessly closer to the moment when Gannen Harst would set the vampaneze and vampets after us - freeing the hounds of hell. \n","sourceLink":"https://allnovel.net/allies-of-the-night-the-saga-of-darren-shan-8/page-21.html","bookId":2444,"book":{"id":2444,"title":"Allies of the Night (The Saga of Darren Shan #8)","description":"Storyline: \n The Saga of Darren Shan #8: Allies of the Night \n Allies of the Night is the eighth book of The Saga of Darren Shan by Darren Shan. It is part of the Vampire War Trilogy, which comprises three books: Hunters of the Dusk, Allies of the Night and Killers of the Dawn. It was first published in Great Britain by HarperCollins in 2002. It was then published in the Vampire War Trilogy in 2005. Darren, Harkat, and Mr. Crepsley go to Mr. Crepsley\u0027s hometown once again to investigate if Vampaneze had set up territories there. But soon after their arrival Darren is discovered by the police and forced to attend school. He has trouble with most of his subjects as he only has a middle school education, but luckily his English teacher is Debbie, his old girlfriend from his first visit to this city.\n \n","cover":"https://allnovel.net/images/allies-of-the-night-the-saga-of-darren-shan-8.jpg","author":"Darren Shan","type":"Horror","source":"allnovel","link":"https://allnovel.net/allies-of-the-night-the-saga-of-darren-shan-8.html","creation":"Oct 5, 2019 8:58:43 AM","modification":"Oct 5, 2019 4:17:19 PM"}}
