{"id":20394,"no":20,"title":"CHAPTER XIX — MAJUBA DAY","content":"\"Did you hear of that plucky action of Captain Philips, of the Royal Engineers, last night?\" an officer who had just ridden in from the front asked Chris that evening. \"No; I heard that the Boers set up a tremendous musketry fire in the evening after the truce was over, but no one that I have spoken to knew what it was about.\" \"Well, we ourselves didn\u0027t know till next morning. The general idea was that it was a Boer scare. They thought that we were crawling up to make a night attack, and so blazed away for all they were worth. We found out afterwards that Philips had conceived the idea that it was possible to destroy that search-light of the Boers. He had learned from prisoners that it was the last they had with them, and although we have not made any night attacks yet, it was possible we might do so in the future, and so he made up his mind to have a try to smash it up. He took with him eight blue-jackets, crawled along in the dark beyond our lines, and got in among the Boers. He had taken particular notice of points he should have to pass, boulders and so on, and he found his way there without making a blunder. There were plenty of Boers round, but no one just at the search-light. The blue-jackets all understood the working of their own search-lights; but the Boers have no electric lights, you know, and work their signals with acetylene, and so they stood on guard while Philips opened the lamp, took out the working parts, whatever they are, and shut the lamp again. Just as they had done so they heard four Boers who had been sitting talking together get up. He and his party dropped among the bushes and lay there quiet while the Boers came up to the lamp. \"\u0027We are to keep it going to-night,\u0027 one of them said, \u0027for they may take it into their heads to make an attack, thinking that after having had a truce all day we shall not be expecting trouble, and they may catch us unprepared. I expect our German officer in a few minutes; he said he would be here about ten o\u0027clock, for the rooineks are not likely to move until they think we are asleep.\u0027 \"They moved away again, and Philips and his men stole quietly off, but before they rejoined our fellows they heard a sudden shot, and in a minute a tremendous rifle fire broke out. Evidently the German had arrived and found the search-light would not act, and they concluded at once that we were marching against them, and for twenty minutes every man in the trenches blazed away at random as fast as he could load. I should say that they must have wasted a hundred thousand cartridges. As there was no reply they began to think that they had been fooled. Our fellows were just as much puzzled at the row, and fell in, thinking that the Boers might possibly be going to attack them. However, matters quieted down, and it was not until the next morning that anyone knew what it had all been about.\" \"That was a plucky thing indeed,\" Chris said; \"though, as I should hardly think we should attack at night, it may not be of much service, for the Boers have long since given up trying with their feeble flash-lights to interrupt our night signalling with Ladysmith, especially as, now the weather is finer, we can talk all day if we like with our heliograph.\" Chris was just turning in when Captain Brookfield came to the entrance of his tent. \"I have just heard, Chris, that the pontoon bridge has been successfully thrown across just below the cataract, and that the troops are all crossing. I just mention it to you. I cannot get away myself, but if I find you and your boys are—not here in the morning, I shall say nothing about it. We certainly shall not be wanted. The orders are out, and there is no mention of our corps nor any of the mounted colonials.\" \"Thank you, sir! I am very much obliged.\" Chris went round to the tents and told the others that they must be up an hour before daybreak and be ready to start at once, as there would probably be another very big fight. Then he told the natives, who were, as usual, still talking together in their tent, that they were all going off very early, and that chocolate must be ready at daybreak, and the water-skins filled, as the horses would probably be out all day. \"Will you want anything cooked, baas?\" Jack asked. \"No; we will take some tins with us. There is going to be another big fight to-morrow; as we are all going, you can go too if you like. We shall want you for the horses. Three of you can stop with them at a time, and the others can go and see what is doing, and then change about, you know, so that you can all see something. The spare horses must have plenty of food left them, and must have a good drink before we start.\" They were all astir in good time. The natives had made some hot cakes, and these they ate with their chocolate. Then they saw that the horses had a good feed, and a stock of biscuit and tinned meat for themselves was put into the saddle-bags, and when daylight broke they were across the plain and arrived at the dip in the hills through which the pontoon train had gone. Knowing where the cataract was, they were able to calculate pretty accurately where they had best dismount. This they did in a small clump of trees. Then each took a tin of meat and a couple of pounds of biscuit in his pocket. \"Now,\" Chris said to the natives, \"you had better all stay here quietly till you hear firing begin; then, Jack, you can go with the two Zulus. You can stay and look on till the middle of the day. When the sun is at its highest you must come back and let Japhet and the Swazis go. At sunset you must all be here again, and wait till we come. Perhaps we may be back sooner, and if so we shall ride away at once; and those of you who are away when we start must go back to camp at once if you find that the horses have gone when you get here. Now let\u0027s be off.\" They made their way up the hills, well pleased that there were enough trees and bushes to shield them from observation. The roar of artillery and the rattle of musketry had been going on for some time, but not with the fury that marked the commencement of an attack. A fortnight before it would have seemed to them that a great battle was in progress, but by this time they were accustomed to the almost incessant fire, and knew that although the cannonade was heavier than usual, no actual fighting was going on. They met no officers as they went along, nor did they expect to do so, for none of these would be able to leave their regiments, as even were these not included in the force told off to assault, they might be called upon later in the day. At last they reached the top of a hill whose face sloped steeply down to the river, and from here they could obtain a view of the Boer position, and of the line of railway up and down. To the right was Pieter\u0027s station, with a steep hill of the same name rising close to it. To the left of this was another strongly-posted hill, while beyond it was the scene of the fighting on Friday and Saturday, Railway Hill, which had been rechristened Hart\u0027s Hill, in honour of the commander of the brigade that had fought so valiantly. It was evident that at these three points the whole of the fighting force of the Boers had gathered. A heavy rifle fire was being kept up against the British infantry, whose passage of the river had now been discovered, and who were lying crouched behind boulders and other shelter. They now saw that the guns had all been brought forward during the night, had taken up commanding positions, and were pouring a terrible fire into the enemy\u0027s encampment at a distance of little over a mile. The enemy\u0027s guns were replying, but at this short range the naval guns were able to fire point-blank, and their shells ripped the defences erected to shelter the Boer camp into fragments, and carried destruction everywhere. On a kopje about a quarter of a mile behind and above them General Buller and his staff had taken up their position, and the lads kept themselves well within the trees to avoid observation. \"See, Chris, there are some of our fellows creeping along by the side of the river. They must be hidden from the sight of the Boers. I expect they will be the first to begin.\" All their glasses were turned upon the column of men. They were two battalions of the eth Brigade and the Dublin Fusiliers, and these, under General Barton\u0027s command, made their way down the river bank for a mile and a half. Then the lads saw that they were leaving the river and crossing the line of railway. \"They have evidently gone down there,\" Sankey said, \"because that spur just this side must hide them from the Boers on Pieter\u0027s Hill.\" The column were lost sight of for upwards of an hour, and then they appeared on the opposite crest, five hundred feet above the line; then they were lost sight of again as they passed beyond the crest. \"That is a splendid move!\" Chris exclaimed. \"By working round there they will gain the top of Pieter\u0027s Hill, and come down like a thunderbolt upon the Boers.\" The roar of artillery continued unabated. Clouds of yellowish-brown smoke floated over the Boer entrenchments, lit up occasionally by a vivid flash of a bursting lyddite shell. So terrible was the bombardment that the rifle fire of the Boers against the troops crouching behind their shelters was feeble and intermittent, as they dared not merge from their shelter-places to lift a head above their line of trenches. It was a long time before Barton\u0027s troops were again seen. Doubtless they had orders to wait for a time when they had gained their desired position, in order to allow the bombardment to do its work, and prepare the way for the assault of the other positions by the fourth and eleventh brigades. It was not, indeed, until the afternoon that the lads saw Barton\u0027s brigade sweeping along to the attack of Pieter\u0027s Hill. The Boers saw them now, and could be seen leaping out of their entrenchments, regardless of the redoubled fire of the artillery now concentrated upon them, and climbing up the hill to oppose this unexpected attack. But before they could gather in sufficient numbers the British were upon them, keeping up a terrible fire as they advanced. The Boers, however, fought sturdily. Many, indeed, had already begun to make their way along the southern face of the hill, either to join their comrades on the hill between Pieter\u0027s and Hart\u0027s, or to escape up the valleys between them, and so make their way to Bulwana, where a large force was still encamped. \"We may as well help,\" Chris said; \"the general can but blow us up.\" Delighted to be able to do even a little towards the success of the day, the party at once picked up their rifles lying beside them. \"It is about a thousand yards, I should say, to the middle of the hill. Take steady aim and try and pick them off as they leave their trenches.\" The firing began at once slowly and steadily, and occasionally there was an exclamation of satisfaction when a bullet found its mark. Five minutes later a dismounted staff-officer came down to the trees behind them. \"What men are these?\" he asked; \"the general wishes to know.\" \"We are the Johannesburg Scouts,\" Chris said. \"Are you in command, sir?\" \"Yes.\" \"Then, will you please to accompany me at once to the general.\" On arriving at the spot where the general was standing a little in advance of his staff, the latter at once recognized Chris. \"Oh, it is you, Mr. King!\" he said. \"I was afraid some of the men had left their stations. And what are you doing here?\" \"We are trying to lend a hand to the troops over there, and as we are all good shots, I think we are being of some assistance.\" \"You had no right to leave the camp, sir. I suppose you call this independent service?\" \"I do, general. I hope that we are affording some help here, and we should not be doing any good in camp; and as we have been nearly out of it through all this fighting, and there were no orders for the corps to do anything to-day, we thought we might be of use.\" \"You did wrong, sir,\" the general said, his face relaxing into a smile at the lad\u0027s defence of himself. \"Well, as you are there, you may as well stop.\" \"Thank you, sir!\" Chris said, saluting, and then hurried off to rejoin his comrades. \"He is a plucky boy,\" the general said to his staff. \"I heard the other day—though not officially, so I was not obliged to take notice of it—that he, with the twenty lads with him, rode out to a place seventy miles away, and rescued some farmers who were besieged by Boers, defeated their assailants, killed and wounded more than their own number, made the rest of them, still double their own strength, lay down their arms, and recaptured nearly two thousand head of cattle they had driven off. The news came to me from the mayor of Maritzburg, who had heard of it from a friend who had ridden in from Grey town. He wrote to me expressing his admiration at the exploit. I sent privately to their captain and questioned him about it, intending to reprimand him severely for letting them go; but he said that they had all resigned, as they had a right to do, for they are all sons of gentlemen, and draw no pay or provisions, and that he had therefore no control whatever over their actions after they left camp. I told him not to say anything about his having seen me, for that, as they had returned, I should be obliged to take notice of the matter if it came to be talked about. That young fellow who came here is the one who, with three of the others, tried to blow up the bridge at Komati-poort. He could not do that, but he played havoc with a large store of rifles, ammunition, and six or eight guns. After that I could not very well scold him.\" And he again turned his glass on the opposite hill. Here the fighting was almost over, and in a very short time all resistance had ceased. Some of the Boer guns on the next hill had now been turned round, and opened upon the captured position, which took their own in flank. An aide-de-camp was sent off to order some of the guns to be taken, if possible, up to the top of Pieter\u0027s Hill, and after immense exertions two batteries were placed there. As soon as this was accomplished, orders were sent for the rest of the infantry to advance. General Warren was in command, and the fourth brigade, under Colonel Norcott, and the eleventh, under Colonel Kitchener, now moved forward, taking advantage of what shelter could be obtained as they advanced. At the same time a strong force of colonial infantry moved to the right to attack the Boer trenches farther up the line of railway, and were soon hotly engaged. The defenders of Hart\u0027s Hill, and the position between that and Pieter\u0027s, opened a heavy fire as soon as the British infantry showed themselves; but their morale was so shaken by the terrific bombardment to which they had been subjected, by the loss of Pieter\u0027s Hill, and by the rifle fire now opened by its captors, that their fire was singularly ineffective. Many men dropped, but the loss was comparatively much smaller than that suffered by the Irish division when moving across the open on the 23rd. Taking advantage of every shelter, the troops moved steadily forward, maintaining a heavy fire whenever they did so, and winning their way steadily. Colonel Kitchener\u0027s Brigade pressed on towards Hart\u0027s Hill, which on the side by which they now attacked was far less formidable than that against which the Irish had dashed themselves. It had never entered the Boer\u0027s minds that they would be attacked from this side, and their most formidable entrenchments had all been placed to resist an assault from Colenso. Arrived at its foot, the troops were in comparative shelter among the boulders that covered the slopes. Foot by foot they made their way upwards, until at last they gathered for a final assault, and then with a loud cheer scrambled up the last slope and with fixed bayonets drove the Boers in headlong flight. A similar success attended the eleventh brigade, who just at sunset carried the centre position, and a mighty cheer broke out all along the line at the capture of what all felt to be the last serious obstacle to their advance to Ladysmith. On the right, the Colonial troops had driven the Boers in front of them for nearly three miles, capturing entrenchment after entrenchment, until they arrived at Nelthorpe station. The three camps of the Boers contained an even larger amount of spoil than had been discovered in those of Monte Cristo and Hlangwane. It seemed that they had been perfectly confident that the positions were impregnable, and had accumulated stores sufficient for a prolonged residence. It was evident, too, that the wealthier men with them had preferred this situation to the more exposed camps on the summit of the hills. The amount of provisions and stores of all kinds was large, Great quantities of rifle ammunition were found in every trench. Clothes of a superior kind proved that their owners had been residents of Johannesburg or Pretoria, and of a different class altogether from the farm-labourers and herdsmen who formed the majority of the Boer army. The haste with which they had fled, when to their astonishment they discovered that the British attack could not be repulsed, was shown by the fact that a good many watches were found on bed-places and rough tables where they had been left when the Boers rushed to arms, and in the hurry of flight had been forgotten. The number of rifles that had been thrown away was very large. Among the dead bodies found were those of two women, one quite young and the other over sixty. It was notorious that women had more than once been seen in the firing ranks of the Boers, and there were reports that Amazon corps were in course of formation in the Transvaal, the Boers, perhaps, remembering how sturdily the women of Haarlem had fought against the Spaniards in defence of their city. So complete had been the panic evinced by the headlong fight of the enemy that the general opinion was that it would be some time before they would again attempt a stand against our men, and that unless any entrenchments higher up the valley were held by men who had not witnessed what had taken place, and were commanded by leaders of the most determined character, Ladysmith would almost certainly be relieved within a couple of days, and the rescuing army would be thus rewarded for its toils and sacrifices. In a state of the wildest delight the lads returned to the spot where they had left their horses, where they found that Japhet and the two Swazis had arrived just before them. They and the Zulus were exhibiting their intense satisfaction at the defeat of the Boers by a wild war-dance. The party rode fast back to camp, for their spirits did not admit of a leisurely pace, and they left the natives to follow them more deliberately. The news had already been received in camp by the return of officers who witnessed the scene from a point near to that which the lads had attained, and its occupants were in a frenzy of delight. The Colonial corps were especially jubilant. This was the anniversary of Majuba Hill, the blackest in the history of the Colony, and one that the Boers in the Transvaal and Orange State always celebrated with great rejoicings, to the humiliation of the British Colonists. Now that disgrace was wiped out. A position even stronger than that of Majuba, fortified with enormous pains, defended by artillery and by thousands of Boers, had been captured by a British force, and although it was as yet unknown in camp, the old reverse had been doubly avenged by the surrender on that day of Cronje and his army. Late that evening an order was issued that Lord Dundonald with a squadron of Lancers and some Colonial corps, in which the Maritzburg Scouts were included, were to reconnoitre along the line of railway. All felt sure that no serious opposition was likely to be met with; the defeat of the Boers had been so crushing and complete that assuredly few of the fugitives would be found willing to again encounter the terrible artillery fire, followed by the irresistible onslaught of the infantry. That evening, in spite of the scarcity of wood, bonfires were lighted, and the Scouts gathered round them. Every bottle of spirits and wine that remained in the camp was broached, and a most joyous evening was spent. \"I shall be able to breathe freely;\" one of the colonists, a man from Johannesburg, said, \"on Majuba Day in future. I have made a point for years, whenever I wanted to do any business in Natal, to put it off till that date, so that I could get out of the Transvaal. When I could not manage it, I shut myself up and stopped in bed all day, though even there I used to grind my teeth when I heard the brutes shouting and singing in the streets. Still, to me it was not half such a humiliation as surrender day. The one was a piece of carelessness, a military blunder, no doubt; the other was a national disgrace. And though I saw Majuba myself, it did not affect me half as much as did the abject backing down of the British Government after they had collected an army at Newcastle in readiness to avenge Majuba. We could not believe the news when it came. The fury of the troops was unbounded, and I would not have given a farthing for the lives of any of the men who were the authors of the surrender, had they been in the camp that day.\" \"What were you doing there?\" Chris asked. \"I had a farm near Newcastle at that time, and two of my waggons had been taken up by the military for transport purposes. I was not on the hill, as you may suppose, or I might not be here to tell the story. I went forward with Colley. It was just the same then as it was at the beginning here. There were plenty of colonists ready to take up arms, but the military authorities would have none of them; they could manage the thing themselves without any aid from civilians. They knew that the natives had over and over again beaten the Boers, and what natives could do would be, merely child\u0027s play to British soldiers. Sir George Colley was a brave officer, and I believe had proved himself a skilful one, but he knew nothing whatever of the Boer style of fighting, while we colonists understood it perfectly, and could match them at their own game. As it turned out, the British soldiers on that occasion did not, and it made all the difference. If Sir George Colley had accepted a few hundreds of us, who knew the Boers well, as scouts and skirmishers, the affair would have turned out very differently; for, as you know, they did not succeed through the whole affair in taking one of the places held by our colonists. \"Well, we started from Newcastle, and the blundering began from the first. It was but twenty-five miles to Laing\u0027s Nek. At the time we started there was not a Boer there, for they were doubtful which line we should advance by. That twenty-five miles could have been done in a day, and there we should have been with our difficulties at an end; the baggage and stores could have come up in two or three days, and then another advance could have been made. Instead of that, six days were wasted in going over that miserable bit of ground. The Boers, of course, took advantage of the time we had given them to prepare and entrench Laing\u0027s Nek. I don\u0027t think that troubled the military authorities at all; an entrenchment thrown up by farmers and peasants could be but a worthless affair, and would not for a moment check the advance of British infantry. The consequence of all this was that we got the licking we deserved. Their entrenchment at the crest of the ridge was held by something like three thousand men. Colley had but three hundred and seventy infantry, a force in itself utterly inadequate for the work in hand. But, seeing some parties of Boer horsemen riding about, he thought it necessary to leave a strong body for the defence of his baggage, and accordingly sent only about two hundred and fifty men forward to attack the place. \"Well, we among the waggons hadn\u0027t a doubt how it was going to turn out. The one battery with us opened fire upon the entrenchment, but you who know what their entrenchments are will guess that there was little damage done; and when the soldiers went up the hill the Boers held their fire until they were close, and then literally swept them away, and, leaping over the entrenchments, took many of them prisoners. None would have got away at all if a few mounted infantry, who had managed to get up the Nek at another point, hadn\u0027t charged down and so enabled the survivors to escape. One hundred and eighty out of the two hundred and fifty were killed or taken prisoners. Colley at once fell back four miles. The Boers on their part, making sure that they had got him safe, sent a strong force round, and this planted itself on the road between him and Newcastle, but before they did so some small reinforcements joined us. Three or four days passed, and then we Colonials quite made up our mind that there was nothing for it but surrender. Colley determined at last to try and open the road back, and with about two hundred and fifty men, with four cannon—two of them mountain guns—moved out. Some sixty soldiers were left on a commanding spot to cover the passage of the Ingogo. As soon as the force under Colley had got to the opposite crest of the ravine through which the river runs, they were attacked in great force. They took shelter among the boulders, and fought as bravely as it was possible for men to fight. The guns, however, were useless, for in half an hour every officer, man and horse, was killed or wounded. However, the Boers could not pluck up courage to make a rush, and the little force held on till it was dark, by which time more than two-thirds of them were killed or wounded. A lot of rain had fallen, the Boers thought that the Ingogo could not be forded, and so, believing they would have no trouble in finishing the little force in the morning, they were careless. Colley, however, sent down and found that the water had not risen so high as to make it impossible to pass, and in the darkness, covered by the blinding rain that was falling, he and the survivors moved quietly off, crossed the river, picked up the party left on the eminence commanding it, and returned to camp. \"It was certain now that unless succoured our fate was sealed, but fortunately Evelyn Wood came up to Newcastle with a column that had been pressing forward from the sea. Colley, of course, ought to have waited for him to arrive before he moved at all, and if he had done so, things might have turned out very differently. But he made the mistake of despising the Boers, and thinking that it was nothing but a walk over. When they heard that the column had reached Newcastle the Boers cleared off the line of communication, and Colley rode into Newcastle and saw Wood. We felt that we were well out of a bad business; and were sure that the Boers, who are no good in attack, however well they fight behind shelter, would not venture to attack us, and that even if they did so we could keep them off till help came. But Colley could not let well alone. Instead of waiting till Wood came up and joined him, lie thought he might make a good stroke on his own account, and so retrieve the two defeats he had suffered; so when the 92nd Regiment came up he determined to seize Majuba Hill. \"It was well worth seizing, for it completely commanded the Boer\u0027s position on Laing\u0027s Nek, and had the whole force come up the Boers must have fallen back directly it was captured. However, Colley decided not to wait, and with about five hundred and fifty men and officers he started at night. The hill was only four miles off as the crow flies, but the ground was frightfully cut up, and it was not until after six hours of tremendous work that they reached the summit. Two hundred men were left at the bottom of the hill to keep open communications with the camp. \"From a hill close to the camp we could make out what was going on. Soon after daybreak we saw a party of mounted men ride towards the hill, where they usually stationed vedettes. They were fired at as they approached, and directly a turmoil could be seen on Laing\u0027s Nek. Waggons were inspanned, and we thought at first that they were all going to move off, but this was not so. They were only getting ready to go if they failed to recapture the hill, and in a short time we could see all their force moving towards it. Well, from where we were it seemed that the force on Majuba could have kept a hundred thousand Boers at bay, and so they ought to have done. \"For a time the Boers did not make much progress. With glasses, puffs of smoke could be made out all along the crest, and among the rocks below. The firing began in earnest at seven, and between twelve and one the Boer fire had ceased and ours died away. We thought it was all over, and went back to our waggons again. Soon after one o\u0027clock there was a sudden outburst, and the men with the glasses observed that the Boers were close up to the top of the hill. A few minutes later it was on the plateau itself that the firing was going on. \"Colley had not known the Boers. No doubt his men were completely done up with their six hours\u0027 toil among the hills and six hours\u0027 fighting, and I don\u0027t think a tenth of them were ever engaged, for Colley thought it was impossible that the position could be stormed; so he only kept a handful of men at the edge of the plateau and allowed the rest to lie down and sleep. Certainly that was the case when the Boers, who had been crawling up among the rocks and bushes, made their rush. \"Well, you all know what happened. The few men on the edge were cut down at once. The Boers dashed forward, keeping up a heavy fire. Our fellows jumped up, but numbers were shot down as they did-so, and in spite of the efforts of their officers, a panic seized them. They had far better rifles than the Boers, and had they been steady might still have driven them back; but only a few of them ever fired a shot, and but one Boer was killed and five wounded; while on our side eight officers, among them Colley himself, were killed, and seven taken prisoners. Eighty-six men were killed, one hundred and twenty-five wounded, fifty-one taken prisoners, and two missing. A few managed to make their way down the hill, and joined the party that had been left there at the bottom. \"These were also attacked, but beat off the Boers, and, maintaining perfect order, fought their way back to camp. You can imagine the consternation there was when the hideous business became known. We fell back at once to Newcastle, and mightily lucky we thought ourselves to get there safely. Fresh troops came up, and we were on the point of advancing again, confident that, after the lesson the Boers had given us, things could be managed better. Suddenly, like a thunderclap, the news came that the British Government had surrendered to the Boers, given up everything, abandoned the colonists, who had so bravely defended their towns, to their fate; and, with the exception of making a proviso that the natives should be well treated—but which, as nothing was ever done to enforce it, meant allowing the Boers to enslave and ill-treat them as they had done before—and another proviso, maintaining the purely nominal supremacy of the Queen, the treaty was simply an entire and abject surrender. \"There is not a colonist who, since that time, has not known what must come of it, and that sooner or later the question whether the Dutch or the British were to be masters of the Cape would have to be fought out. But none of us dreamt that the British Government would allow the Boers to import hundreds of thousands of rifles, two or three hundred cannon, and enormous stores of ammunition in readiness for the encounter. Well, they have done it, and we have seen the consequences. Natal has been overrun, and a considerable portion of Cape Colony. We have lost here some ten thousand men, and half as many on the other side, and we may lose as many more before the business is finished. And all this because a handful of miserable curs at home twenty years ago were ready to betray the honour of England, in order that they might make matters smooth for themselves at home.\" Just as the story came to an end the assembly blew in the camp of the Scouts, and on running in the men found that Captain Brookfield had received an order to mount at once and ride to join the cavalry under Lord Dundonald at the front, as a reconnaissance was to be made in the morning. Five minutes later all were in the saddle and trotting across the plain towards Colenso, as they were to follow the line of railway up.","sourceLink":"http://novel.tingroom.com/duanpian/3146/86459.html","bookId":807,"book":{"id":807,"title":"With Buller in Natal","description":"简介： A group of excited men were gathered in front of the Stock Exchange at Johannesburg. It was evident that something altogether unusual had happened. All wore anxious and angry expressions, but a few shook hands with each other, as if the news that so...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3146","creation":"Aug 1, 2019 12:19:35 AM","modification":"Aug 1, 2019 12:19:35 AM"}}
