{"id":99098,"no":11,"title":"Page 11","content":"Lucas hadn’t wanted to spend the day with her but her trying to get out of it just plain ticked him off. How dare she not want to be with him. They had some talking to do and she was damn well going to spend the day with him.\\n\\n “Of course I’m not too busy to take you out, Ms. Harper,” he said with venom in his voice.\\n\\n “Why don’t you go ahead and get ready so we can take off right away,” he said looking her up and down. He knew she was already dressed for the day.\\n\\n How dare he look down his nose at her? She was fighting to keep her emotions in check. She looked just fine and she wasn’t trying to impress him anyway. She would go with him, just to show him she could be in his company without being affected by it.\\n\\n “I’m ready Mr. Anderson,” she said in a voice of honey, dripping with vinegar. “You may want to clean that jam off of your face though,” she added with satisfaction. He simply glared at her, then got up from the table and walked into the house without another word. She quietly chuckled, enjoying the fact that she’d won that little battle. It felt kind of good to knock the all powerful Lucas down a notch.\\n\\n “Well, you kids seem to be getting along rather well,” Joseph said with complete sincerity. She couldn’t tell if he was serious or not. He seemed to be. Maybe the two of them hadn’t been so obvious after all. She figured you could’ve sliced the tension between them with a knife but it was good that Joseph hadn’t noticed.\\n\\n “He’s a great boss,” was all she said before looking down and picking at her breakfast. She didn’t see the amused grin on Joseph’s face.\\n\\n Lucas came back out and stood there impatiently so she took a few more bites of food as slowly as she possibly could. She noticed him glancing at his watch a few times as she sat there taking her time.\\n\\n “Now Lucas, quit being so impatient. It’s never polite to rush a lady,” Joseph spoke up.\\n\\n “We have a lot to do today, Dad. I just want to get going since I have a date to get to tonight,” he added. He noticed Amy tensed up a bit in her seat. Good, he thought. She wasn’t as unaffected as she wanted him to believe. He was surprised with how good the thought made him feel. He didn’t take rejection well, even if he didn’t want the woman. He’d been completely wrong in thinking one time with her would be enough, because he couldn’t stop thinking about her. He still wanted her, even more now than ever before.\\n\\n She finally got up and grabbed her purse off the back of her chair. “I wouldn’t want to make your young lady wait on you,” she said in a perfectly calm voice. “Thank you so much for breakfast Joseph. It was really good. Your company was even better,” she said and then followed Lucas out the door.\\n\\n “Have a good time kids.”\\n\\n “Joseph Anderson, what are you up to now?” came the voice of his wife.\\n\\n “Good morning beautiful. I was just having some breakfast with a beautiful young lady and your grumpy son,” he said in all innocence.\\n\\n “Now, we both know that’s bull. You’re match making and from the look of things between those two, it’s going very well,” she said with disapproval in her tone. “When that boy figures out what you’re up to he’s going to stop speaking to you,” she added.\\n\\n “By the time he figures it out, he will be very much in love with his wife and thanking me,” Joseph came back with. He certainly hoped that was the case. Because otherwise his wife would be right and his son would be none too happy with him. It was a risk he was willing to take.\\n\\n “Let’s go for a drive,” he said as he got up and gave Katherine a kiss.\\n\\n Was it so wrong for him to want his sons to have a love of their own, like he had with his Katherine? He didn’t think there was anything wrong with that. He decided today was going to be a great day. It had started off wonderfully with Lucas and Amy on their way to a passionate relationship.\\n\\n Chapter Five\\n\\n Amy got in the car with Lucas, immediately becoming engulfed by his scent. Why did the guy have to smell so good? She could feel a fluttering in her stomach. How could she want to be with the man after the things he’d done? She was trying not to see the good things about him because it was so much harder to maintain her distance when she let down her guard.\\n\\n They rode in silence for a while before he suddenly pulled into a parking lot. This wasn’t the car dealership. What was he doing? Maybe he was going to drop her somewhere and hope she got abducted.\\n\\n “We’re going shopping first. That way the things can be delivered and the crew can finish up your apartment,” he said in explanation. He didn’t wait for her to answer. He stepped out of the vehicle and came around to her door and opened it. When he did those small things, like treat her as a lady it made her see the more human side of him, making it harder for her to resist his charm. She would rather he acted cold so she could justify her own distance.\\n\\n She got out of the vehicle and walked next to him into the vast store. “I really don’t need any decorations. I’m sure the apartment is fine as it is,” she tried to tell him. She wasn’t comfortable with all the things she was receiving. It felt far too much like assistance.\\n\\n “One of the perks is to get the place furnished. Let’s get this done,” he stated in a voice that said deal with it, it’s going to happen.\\n\\n She soon found it was much easier to go along with him than to argue. He took her through each department, asking her preference on colors and styles. As they continued on he seemed to be enjoying himself.\\n\\n When they were finished in the store Lucas made arrangements for the items to be delivered to her apartment immediately. “We’re ahead of schedule Amy. It looks like you may be able to move into your place tonight,” he said as they exited the store. “I’m hungry. Let’s go get lunch.\\n\\n The car lot may take a while,” he commanded.\\n\\n He didn’t ask if she was hungry. He didn’t ask if she wanted to share a meal with him. He simply stated she would go to lunch with him and that’s what would happen. If she hadn’t been so hungry she would’ve refused to eat just to prove a point but she knew he wouldn’t even notice and then she was the one who’d be suffering the rest of the day.\\n\\n They ate their meal in awkward silence until; thankfully he received a phone call, which occupied him for the rest of the time. She was relieved, as she didn’t want to try and make small talk. The pressure from the day was beginning to settle on her shoulders and she was looking forward to having some time to relax on her own.\\n\\n They headed over to the car lot after lunch. She’d never owned a car before. She’d never even priced one. She knew she would get one after college but she hadn’t had the money yet. She’d taken a few drivers training courses while in college so she knew how to drive but wasn’t real comfortable behind the wheel.\\n\\n She didn’t want Lucas to know of her insecurity about it though so she decided to suck it up and brave the situation. “Do you want a manual or automatic?” was the first question he asked her.\\n\\n “I would prefer an automatic.”\\n\\n “If you want my opinion I think you should go with the Mercedes ML450 Hybrid SUV. I’ve done some research the last few days and it’s highly rated in safety. It gets great gas mileage and is recommended on the consumer reports,” he offered, sounding like a cars salesman.\\n\\n “I really don’t know anything about cars, Lucas. I wouldn’t know where to begin,” she answered. His head spun around to look at her but she was looking out at the car lot like a lost child so she didn’t notice. It was the first time she’d ever used his first name. He found that he liked the sound of it on her lips.\\n\\n He knew she didn’t realize what she’d said. In her nervousness at being there she’d temporarily let her guard down. He liked that side of her. This Amy, minus the armor, seemed much sweeter and more innocent and he wanted to wrap her in his arms. He wanted to protect her. He was finding he wanted to be with her, more than as just an employer. He liked that she wasn’t jaded to the world. He found her refreshing and was finding it harder and harder to believe she could be a manipulative woman with an ulterior motive like so many others. There was no way a woman could act that well. He wanted to pull her into his arms and kiss her again.\\n\\n He stopped himself, barely. He was in no way ready to open his heart to anyone. He would remain in control of himself and he would be able to forget about what they’d done the night before. Neither of them needed to enter into some affair that would end with her losing a job and him with regrets. He would figure things out when he had more time to think.\\n\\n “Well, if you don’t know much about cars then I hope you’ll take my advice but the choice is yours. You’ll be the one driving the vehicle,” he simply stated.\\n\\n Lucas walked her into the building and skirted around the salesmen, heading straight to the manager’s office. “Lucas, it’s good to see you again. You’re early but I’ve already pulled out the car you asked for,” said the gentleman behind the desk, who had a genuine smile and stood to shake hands with both of them.\\n\\n “Thanks Frank, I appreciate it.” Lucas was already turning to lead Amy back through the showroom and out the side doors.\\n\\n They walked out the door and sitting there was a beautiful crimson vehicle. Lucas led her over to it and opened the driver’s door for her. She looked up at him with surprise in her eyes. The car was so pretty. She was trying to be practical but it was just so pretty. She would prefer it any day over his expensive Porsche.\\n\\n Amy felt her eyes start to sting a little and quickly put her head down and took a walk around the vehicle to clear the tears away. She got herself under control and pulled herself into the driver’s seat. Before she started the car, she made sure to locate where everything was.\\n\\n Suddenly her face broke out into a huge grin and she looked for the ignition. “Where do you turn this on?” she asked, while looking at him with a confused, yet ecstatic expression on her face.\\n\\n Lucas laughed and explained that it was a push button start.\\n\\n “One of the new features of the hybrid cars are they run on electricity when you’re traveling at slower speeds. The gas will kick on when it’s needed,” he finished.\\n\\n She pushed the button and the lights came on but there was no sound. She looked at him again with confusion on her face. “How do you know it’s on if there isn’t any noise?” she asked him, genuinely puzzled.\\n\\n Lucas couldn’t help himself. He laughed out loud, really enjoying himself. She was just so unlike any other woman he knew. His open laughter at her wiped the smile from her face. She didn’t like being laughed at. “I’m not laughing at you. I just find you to be a breath of fresh air.” He continued chuckling. “Place the car in gear and trust me, it will drive for you,” he said.\\n\\n “What is this, a space car?” she muttered under her breath. He managed to keep his laughter from bursting out that time and pretended to not hear the comment. They drove around for about an hour. She loved it. It drove like it was on glass. Even once the engine kicked on there was only a purr. It was amazing and she didn’t want to stop. She almost forgot Lucas was even there with her, which was a pretty amazing feat in itself. \\n\\n","sourceLink":"https://allnovel.net/the-billionaire-wins-the-game-billionaire-bachelors-1/page-11.html","bookId":2006,"book":{"id":2006,"title":"The Billionaire Wins the Game (Billionaire Bachelors #1)","description":"Storyline: The Billionaire Wins the Game (Billionaire Bachelors #1) \\n Joseph Anderson has decided it\u0027s time for his three successful sons to find brides. Joseph wants grandchildren to fill his mansion, and he wants them immediately. His eldest son, Lucas, is successful in all areas of his life, except love, and Joseph begins matchmaking. He finds Amy Harper and deems her the perfect daughter-in-law. He just needs to get her and Lucas to both realize they\u0027re made for each other. \\n Lucas Anderson is wealthy, sexy, and stubborn. He has no desire to have any woman enter his life, causing chaos, or using his family\u0027s name. Many women have tried, and he\u0027s been successful in finding out who they are beneath their false smiles. \\n Amy Harper was raised in tragic circumstances and doesn\u0027t like pampered, rich men who have been handed everything with a silver spoon. She spent years finishing her education and then received a job with the Anderson Corporation. She instantly doesn\u0027t like her incredibly sexy boss, who is arrogant and thinks every woman should fall at his feet. \\n When Amy becomes pregnant after one reckless night of passion, she\u0027s scared he\u0027ll take the baby and run. Lucas is demanding, and used to getting his way, but Amy has just the right amount of spark to ignite his fuse, and challenges him each step of the way. \\n Lucas\u0027s father, Joseph, and his brothers Alex and Mark, offer laughter, love, and support. With the love of Lucas\u0027s family, who aren\u0027t only rich and successful, but also kind and giving, Amy starts to realize that being wealthy doesn\u0027t make or break a man, and starts to picture the happily ever after she never believed in for herself.\\n","cover":"https://allnovel.net/images/the-billionaire-wins-the-game-billionaire-bachelors-1.jpg","author":"Melody Anne","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-billionaire-wins-the-game-billionaire-bachelors-1.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:39:40 PM"}}
