{"id":99099,"no":12,"title":"Page 12","content":"“Amy, it looks to me like you love this car. Why don’t we head back to the lot and sign some papers so you can take it home?” he asked her. She looked a little disappointed that the ride would be over but nodded and turned back towards the car dealership. She didn’t want to get out once they got there but reluctantly left the vehicle. The paperwork only took about twenty minutes since Lucas was a preferred client and they had everything already prepared for him. The lot had to do a final cleanup and check out everything so they told her it would be delivered to her place that night. She was surprised by how disappointed she was she couldn’t drive it right away but she would get to in the morning. After they pulled out of the lot she figured Lucas would be taking her back to the cottage but he turned in the opposite direction. “I thought we were all done for the day?” she asked. “We’re done. Your apartment’s ready. I figured you’d want to go home and check it out,” he replied. “Yes, definitely,” she said with real enthusiasm. They pulled up to a beautiful building. It looked more like a four star hotel than an apartment complex. There was a fountain with a cupid shooting out water in the circular front entryway. It was spectacular looking. They went down inside an underground parking tunnel, where he used a card to enter and then he pulled into a parking spot where a sign had his spot reserved. “You’ll park here,” he said while pointing out a space near the elevator. He came around the car before she’d even unbuckled. He opened her car door, something she was getting used to. It felt nice to be treated like a lady, even if she knew he would do it for anyone and it didn’t make her special. They walked into the plush elevator and he pressed the only button available. “This elevator only goes to the lobby. It’s another safety precaution. We take the security of our tenants very seriously.” The elevator chimed and the doors opened to a huge lobby area that would rival the best hotels in New York. There was a great big desk sitting against the far wall with a security guard eyeing the monitors in front of him. “Good evening Mr. Anderson. You’re in early tonight,” he said before smiling at Amy. “Hello Fred. How are you doing?” “Good. Good.” He replied pleasantly. “Fred, this is our newest tenant, Ms. Harper. She will be living in nineteen-A.” he finished. “It’s real good to meet you Ms. Harper. I hope you’ll enjoy living here. It’s a great place. I work the evening shifts Tuesday through Saturday but I live here in apartment two-A if you ever need me. I already put a list of numbers in your apartment so don’t feel bad about giving me a call at any time,” he finished. Amy liked Fred instantly. He seemed to be around fifty years old and had one of those smiles that made you feel safe. She felt extremely secure in the nice building, like the rest of the world couldn’t get to her if she didn’t allow it. She liked the extra security measures in place and she also loved all the beauty. It really looked far more like a hotel the more she saw. Was Lucas sure it was an apartment complex? “Come on, I’ll give you the grand tour before showing you your place,” Lucas said before turning. He led her down a hallway to the left. They entered a doorway that had a state of the art gym in it. Lucas then led her through another door where there was a full sized pool. Her mouth almost started watering. Could it be real? She not only got a place, which she didn’t even care if it was the size of a shoe box, because she also got a swimming pool and gym and security. The next door he led her into had a hot tub and sauna. Lucas was watching her reaction to the things he never even thought about as special anymore. He was used to having things like this at his disposal. Her face lighting up in delight actually humbled him a bit. He noticed she was working hard to control her features but she would never succeed at poker. She just couldn’t hide the pleasure running across her face. He showed her the private backyard garden that had a couple of benches in it and another fountain. She knew she would spend hours in that garden reading a good book; that is, of course, after her work out and swim. Finally she lost her ability to maintain her calm and just let herself enjoy the amazing place. She actually spun around in a circle and laughed aloud. She almost grabbed him in her excitement but at the last minute pulled back. “Um, sorry about that; I tend to get too excited sometimes,” she mumbled and walked back into the building. “Well, you may want to reserve judgment until you actually see your apartment,” he said, while leading her back into the lobby. He was having a difficult time keeping the smile from his face. She was contagious in her excitement and he found her a pleasure to be around. He was trying not to like her and it wasn’t working out so well for him. He pressed the button and stepped inside. She followed him and they rode to the nineteenth floor in silence. They stepped off and she looked around. The hallways were extra wide and had some beautiful paintings hanging on the walls. It seemed like the hallway went on forever. She was surprised by the extreme size of the building. When she was told it was a corporate apartment complex, she’d just assumed it only had a couple of floors with minimal units there. But from what she was seeing, there must have been at least a hundred. As they were walking down the long hallway though, she noticed there were hardly any doors. They came towards the end and he placed a key in the door to the left. Her curiosity got the best of her and she asked him, “There aren’t many doors up here. How many apartments are on each floor?” “This floor only has two of them. They are bigger than the other units and then there are a couple of conference rooms up here as well,” he replied. “The other floors have quite a few more, but each apartment is spacious. Most of our employees have families and we want them to be comfortable living here,” he finished. They walked in the door and her breath rushed out before she could stop it. When he said the place was large, he hadn’t been kidding. It was enormous. There was a vast entryway that was tiled in a beautiful soft grey color. They stepped further into her new living room. The furniture they’d picked out was all arranged, along with a few extra items, such as a large screen television with a bunch of DVD’s on the side. She walked up to them and noticed some romantic comedies. “Esther said you told her you loved romance stories, so she picked a few movies out she thought you may like,” he said in explanation. That was such a personal thing to do, it touched her. Lucas stood back and let her wander around the apartment. There were two decent sized rooms with beds and nightstands. The main bathroom was decorated in her new linens, with a few added touches of bath and body washes that came from nice boutiques. She opened the door at the end of the hall and tears came to her eyes again. It was the master bedroom. There was a huge four poster bed in the middle of the room and it was covered in the purple comforter she’d picked out and had netting tied to each of the posts. It was the kind of bed she’d always dreamed of owning. She walked over to the bed and jumped into the middle of it and let out a little giggle. She could imagine spending many nights curled up in the bed with a great book. The apartment really was a dream come true for her. “I don’t know what to say. I’ve never known a company to be so generous. It makes me feel guilty having all this when so many people don’t have even a third of it. What if you guys hate me after a month? What if I’m a complete failure and I can’t do the job after all? This is all so much pressure,” she said, starting to feel panic. “Amy, we wouldn’t have done this for someone that we didn’t have full confidence in. You will do an amazing job, you already are. You deserve these benefits and not to repeat myself, but we do this for all executive positions,” he finished. Amy bowed her head. She wasn’t getting any treatment that they didn’t offer others and that actually made her feel better. She didn’t want to stand out. She didn’t want to feel guilty for what they’d given her. She’d never gotten gifts in her life and it was like receiving twenty-five years worth of birthday and Christmas gifts and then some. She would just enjoy it and try not to feel guilty. For now, it was all hers. She was going to enjoy her moment. Amy walked back into her living room and Lucas was standing with his back to the wall watching her. Here goes, she thought. He didn’t look as if he was planning on leaving anytime soon and she really just wanted to de-stress and enjoy her new place. If things were different she would be able to imagine the two of them snuggling together on the couch, watching one of her romantic comedies, but it would never happen. She needed him to leave so she could breathe again. She took a deep breath and remained calm. “Well, thank you for taking time out of your busy schedule to do all you did today. This place is amazing. It’s better than I could’ve ever imagined or hoped for, though I really don’t need all the space. If you want to move me into a smaller apartment and save this space for an employee with a family, I’m fine with that.” She was talking quickly so he couldn’t interrupt her. “I’m not saying I don’t love the place, because I do. It’s seriously more amazing than any place I’ve ever even seen, let alone lived in but it just seems to be such a waste of space for only me,” she continued rattling on. Without realizing what she was doing, her hand went to her stomach as she said those last words. The thought she could be pregnant at that moment was terrifying and yet oddly comforting in a weird way. Lucas knew Amy was rattling on so he wouldn’t have any time to speak. He figured he would let her talk herself out and then get his say in. When she finally stopped speaking and looked up at him, he stared at her for a moment. He saw her visibly firm her shoulders, while maintaining eye contact. She seemed angry all of the sudden and he couldn’t figure out why. “I think you should go now, Mr. Anderson. I have a lot to do tonight and I would like to get settled in please,” she said tightly. She stood there across the room from him with her arms crossed, refusing to say any more. Lucas finally stepped away from the wall and started walking towards her. It reminded her more of a prowl, than a walk. She took an involuntary step back as he got closer. She was furious at herself for showing that little bit of weakness. She decided the best defense was a strong offense. “Mr. Anderson,” she emphasized his name, “Last night was a mistake. It shouldn’t have happened and it will not repeat itself. I’m sorry if you think you deserve it or that I’m going to just roll over on my back in appreciation of all this stuff but I’m not some cheap hooker,” she finished. As she stopped speaking she was a little bit frightened by the look that came into his eyes. She took another step back without thinking about it. That seemed to make his eyes light up even more with fire. She was really pissing the man off. He must not like to be rejected. Well, he would just have to get used to it with her because she didn’t want him. Well, she did want him but she was certainly going to fight the attraction.","sourceLink":"https://allnovel.net/the-billionaire-wins-the-game-billionaire-bachelors-1/page-12.html","bookId":2006,"book":{"id":2006,"title":"The Billionaire Wins the Game (Billionaire Bachelors #1)","description":"Storyline: The Billionaire Wins the Game (Billionaire Bachelors #1) Joseph Anderson has decided it\u0027s time for his three successful sons to find brides. Joseph wants grandchildren to fill his mansion, and he wants them immediately. His eldest son, Lucas, is successful in all areas of his life, except love, and Joseph begins matchmaking. He finds Amy Harper and deems her the perfect daughter-in-law. He just needs to get her and Lucas to both realize they\u0027re made for each other. Lucas Anderson is wealthy, sexy, and stubborn. He has no desire to have any woman enter his life, causing chaos, or using his family\u0027s name. Many women have tried, and he\u0027s been successful in finding out who they are beneath their false smiles. Amy Harper was raised in tragic circumstances and doesn\u0027t like pampered, rich men who have been handed everything with a silver spoon. She spent years finishing her education and then received a job with the Anderson Corporation. She instantly doesn\u0027t like her incredibly sexy boss, who is arrogant and thinks every woman should fall at his feet. When Amy becomes pregnant after one reckless night of passion, she\u0027s scared he\u0027ll take the baby and run. Lucas is demanding, and used to getting his way, but Amy has just the right amount of spark to ignite his fuse, and challenges him each step of the way. Lucas\u0027s father, Joseph, and his brothers Alex and Mark, offer laughter, love, and support. With the love of Lucas\u0027s family, who aren\u0027t only rich and successful, but also kind and giving, Amy starts to realize that being wealthy doesn\u0027t make or break a man, and starts to picture the happily ever after she never believed in for herself.","cover":"https://allnovel.net/images/the-billionaire-wins-the-game-billionaire-bachelors-1.jpg","author":"Melody Anne","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-billionaire-wins-the-game-billionaire-bachelors-1.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:39:40 PM"}}
