{"id":99111,"no":24,"title":"Page 24","content":"They entered the beautiful suite and her nerves were stretched to the breaking point. He hadn’t spoken to her since he’d whisked her out of that disgusting room. She wasn’t sorry to see that place go.\\n\\n Maybe after they talked he would let her stay in her old apartment until the baby was born. He knew she was on strict orders to not be working right then as it could cause harm to the baby.\\n\\n She would never do anything to hurt her child. Her hand caressed her stomach as she sat down on the couch and waited to see what he had to say.\\n\\n Lucas stepped over to the phone and placed an order for some food and then sat down next to her on the couch.\\n\\n “Amy, I’ve never been as terrified as when I realized you had left me. How could you not realize what you mean to me?” he began speaking. She opened her mouth to respond, but he gently shook his head and then pulled her into his lap.\\n\\n She knew she should struggle but even though he was the reason she was in so much pain, she wanted the comfort that he was offering her. He began rubbing her back in slow circles and she had to fight off the tears that wanted to fall again. She didn’t see how there was a single tear left in her body.\\n\\n “Look at me, please,” he pleaded with her. She finally turned to look into his eyes. They seemed so filled with love and sincerity. “I love you,” he simply stated.\\n\\n She finally lost the battle to hold her tears in and they fell freely down her cheeks and her body shook gently as she was finally hearing the words she had wanted for so long.\\n\\n “I love you and only you,” he said again as he gently wiped away her tears. “What you saw today was not me clinging to another woman. She is an ex-girlfriend who was trying to get me back. If you would’ve stayed a moment longer, you would have seen that I pushed her away from me as soon as she made her move and had security remove her from the premises. Talk about being in the wrong place at the wrong time,” he finished with a sheepish grin on his face.\\n\\n She stared at him, starting to feel a ray of hope. He was saying he loved her and maybe she really had jumped to conclusions. “Why would you think I would cheat on you? Making love to you is the best sex I have ever had in my life. It’s so much more. I can never get enough of you. Why in the world would I need to go to another woman when I have you to myself every night?” he asked with confusion.\\n\\n “It makes more sense to me that you would want a woman like her. I’m not sophisticated, or gorgeous. You got trapped into being with me because of the baby. It just makes more sense than you actually being able to love me,” she broke off on a sob and could say no more.\\n\\n Lucas lifted her chin up and placed his lips on hers, cherishing the feel of their soft touch. She immediately responded to him as she always did at his lightest touch. He pulled back before things could get out of hand, which was so easy with her, as he couldn’t get enough of his wife.\\n\\n “Amy, I admit we didn’t start out the best way, but none of that matters anymore. All that matters now is how we feel about each other and how we feel about our child,” he said while running his hand over her stomach.\\n\\n “I love you so much. I’m sorry I’ve been such a fool. I was afraid to give you my heart because you already own me in every other way. I would walk through fire for you. I would hunt you down to the edges of the universe. I can’t and won’t live without you. You and our child are my reason for survival. Without you both, there is no joy or passion in my life. There is no meaning,” he said.\\n\\n She believed him. He loved her.\\n\\n He loved her!\\n\\n She’d never in her life felt such tremendous joy as at that moment, sitting on her husband’s lap with his arms wrapped tightly around her. She could see the love on his face and feel it in his body. She knew everything would be all right. She knew they were going to be the couple that beat all the odds.\\n\\n “I love you so much Lucas. I think I have loved you from the very first time we met. I tried to fight it so hard, but there is no fighting a man like you. You are who I want to be with the rest of my life,” she purred.\\n\\n Amy Threw her arms around her husband’s neck and kissed him with a passion that would keep them up for a very long time that night.\\n\\n Epilogue\\n\\n “Push, baby, push. You’re doing so great. I see her head,” Lucas mumbled in a terrified whisper.\\n\\n “Arrrgggggg...” Amy grunted as she used her last remaining strength and gave a final push. She collapsed back against the bed and then heard the sweetest sound imaginable.\\n\\n The first cry of her beautiful baby girl.\\n\\n Suddenly the doctor was placing their child on top of her chest and she was looking into the scrunched up face of her daughter throwing her very first temper tantrum.\\n\\n “She definitely has her daddy’s temperament,” Lucas laughed as he rubbed their daughter from head to toe making sure for himself that she was okay in every way. “I think she’s hungry and letting us all know,” he chuckled.\\n\\n Even exhausted Amy looked from her husband to her baby girl and felt pride and happiness as her family was growing. She could see the love and pride shining in Lucas’s eyes and it was the most beautiful thing in the world.\\n\\n “Jasmine would like to have her father hold her now,” Amy said to Lucas. He gently picked her up and held her closely to his chest. The tiny movement of her breathing was the most amazing feeling in the world. The night before, he’d been feeling her kick from the inside of Amy’s stomach. Now he was holding her in his arms.\\n\\n The doctors quickly cleaned her up and then the three of them transferred rooms. They were there no more than a few minutes when there was a knock at the door.\\n\\n “Can we come in?” said the subdued voice of her normally booming father-in-law.\\n\\n “Come in, come in, Dad, meet your very first granddaughter, Jasmine Katherine Anderson,” Lucas said proudly.\\n\\n Joseph gently took his granddaughter from his son and a tear streamed down his cheek. Things hadn’t turned out badly at all, he thought to himself. He was in a hospital, holding his brand new baby granddaughter and his son was happily married.\\n\\n His son should be thanking his old father, but Joseph knew better than to ask for any praise for all he’d done to get those kids together. His beautiful granddaughter was all the thanks he needed.\\n\\n “You two have done really well here,” Joseph said as he smiled from Amy to Lucas. “She’s the most beautiful baby I’ve ever seen in my life,” he continued on.\\n\\n He reluctantly handed the baby girl to his Katherine and watched a glow come to her face as she sat in the rocker and held the precious gift to her chest and hummed her a lullaby. “We almost got a Christmas baby,” Joseph laughed. It was December twenty third. They all agreed that Jasmine was the perfect gift for the whole family.\\n\\n “Guess we’ll have to work on giving Jasmine a little brother born on Christmas next year,” Lucas said as he looked at his wife hungrily. She was still the most beautiful thing in the world, even after the hard labor she’d endured.\\n\\n “Now son, I sure want a ton of grand babies running around that empty old mansion, but you may not want to scare your wife off. It never is a good thing to talk about child number two, when she is still feeling the pain from the first one,” he winked at Amy.\\n\\n “The pain’s already forgotten Dad. I love this baby girl more than anything in the world and want to make many siblings for her because I love your son so much and that love needs to be shared with the wonderful children I know we will make.” Joseph’s heart enlarged just a bit more at how much he loved his new daughter. He’d asked her to call him dad because he knew she didn’t have one. He truly loved her like she was one of his own kids. Since she was married to his son, she was his family now. He still loved to hear her say it though. He bent down and kissed her cheek.\\n\\n There was another knock on the door and then Amy’s smile broke out into a huge smile as Tom stepped through the doorway carrying a huge teddy bear, balloons and a large bag of chocolates.\\n\\n “Tom, I’m so glad you finally got here,” Amy said to her best friend.\\n\\n “There was an accident on the freeway or I would’ve been here an hour ago,” Tom said as he bent down and kissed her on the cheek.\\n\\n “Come and meet your God Daughter,” Amy said. Tom’s eyes instantly filled with tears as he took the precious bundle into his arms.\\n\\n “She’s perfect Amy, just like her mom,” he told her while trying to get his emotions under control. They all visited for about an hour and Amy’s heart was nearly bursting with how much love she had for the people in the room with her.\\n\\n “You did so good Amy. I’m so very proud of you. We’ll leave you kids alone now,” Joseph said as he helped his wife to her feet.\\n\\n Katherine walked over to the bed and passed her granddaughter to her mother, where she immediately started to root around for some food. That gave all the people in the room a laugh.\\n\\n “I love you too mom. I’m so glad you both were here,” Amy choked up. Katherine brushed a kiss across her cheeks and then hand in hand walked out of the room with her husband.\\n\\n The two of them turned the corner and Joseph’s eyes twinkled. “Well Katherine, one son down, two to go. I like being a grandpa and I’m getting greedy now. I want new babies every year for the next ten years or so,” he stated as if he would indeed get his wish.\\n\\n “Now Joseph, I admit this turned out really well, but you will not be doing any more meddling in your sons’ lives. They can find their own mates and find their own way,” she said sternly to her husband, even though she knew it was a futile battle.\\n\\n Joseph just wrapped his arm around his wife and whistled a tune as they headed for their car. He already had the perfect bride picked out for his middle child, Alex… \\n\\n","sourceLink":"https://allnovel.net/the-billionaire-wins-the-game-billionaire-bachelors-1/page-24.html","bookId":2006,"book":{"id":2006,"title":"The Billionaire Wins the Game (Billionaire Bachelors #1)","description":"Storyline: The Billionaire Wins the Game (Billionaire Bachelors #1) \\n Joseph Anderson has decided it\u0027s time for his three successful sons to find brides. Joseph wants grandchildren to fill his mansion, and he wants them immediately. His eldest son, Lucas, is successful in all areas of his life, except love, and Joseph begins matchmaking. He finds Amy Harper and deems her the perfect daughter-in-law. He just needs to get her and Lucas to both realize they\u0027re made for each other. \\n Lucas Anderson is wealthy, sexy, and stubborn. He has no desire to have any woman enter his life, causing chaos, or using his family\u0027s name. Many women have tried, and he\u0027s been successful in finding out who they are beneath their false smiles. \\n Amy Harper was raised in tragic circumstances and doesn\u0027t like pampered, rich men who have been handed everything with a silver spoon. She spent years finishing her education and then received a job with the Anderson Corporation. She instantly doesn\u0027t like her incredibly sexy boss, who is arrogant and thinks every woman should fall at his feet. \\n When Amy becomes pregnant after one reckless night of passion, she\u0027s scared he\u0027ll take the baby and run. Lucas is demanding, and used to getting his way, but Amy has just the right amount of spark to ignite his fuse, and challenges him each step of the way. \\n Lucas\u0027s father, Joseph, and his brothers Alex and Mark, offer laughter, love, and support. With the love of Lucas\u0027s family, who aren\u0027t only rich and successful, but also kind and giving, Amy starts to realize that being wealthy doesn\u0027t make or break a man, and starts to picture the happily ever after she never believed in for herself.\\n","cover":"https://allnovel.net/images/the-billionaire-wins-the-game-billionaire-bachelors-1.jpg","author":"Melody Anne","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-billionaire-wins-the-game-billionaire-bachelors-1.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:39:40 PM"}}
