{"id":23112,"no":4,"title":"CHAPTER IV. MR. KENYON\u0027S SECRET.","content":"W HILE this rivalry was going on between Oliver and Roland, Mr. Kenyon, remaining at home, had had a surprise and a disagreeable one. \\n\\n \\n\\n At half-past seven Roland left the house. At quarter to eight the door-bell rang, and Mr. Kenyon was informed that a gentleman wished to see him. \\n\\n \\n\\n He was looking over some business papers and the interruption did not please him. \\n\\n \\n\\n \"Who is it?\" he demanded impatiently. \\n\\n \\n\\n \"A gentleman.\" \\n\\n \\n\\n \"So I suppose. What is his name?\" \\n\\n \\n\\n \"He is a stranger, sir, and he didn\u0027t give me his name. He said he wanted to see you partic\u0027lar.\" \\n\\n \\n\\n \"Well, you may bring him up,\" said Mr. Kenyon, folding up his papers with an air of resignation. \\n\\n \\n\\n He looked up impatiently as the visitor entered, and straightway a look of dismay overspread his countenance. \\n\\n \\n\\n The visitor was a dark-complexioned man of about forty-five, with bushy black whiskers. \\n\\n \\n\\n \"Dr. Fox!\" ejaculated Mr. Kenyon mechanically. \\n\\n \\n\\n The visitor chuckled. \\n\\n \\n\\n \"So you know me, Mr.――ahem! Mr. Kenyon. I feared under the circumstances you might have forgotten me.\" \\n\\n \\n\\n \"How came you here?\" demanded Kenyon abruptly. \\n\\n \\n\\n \"A little matter of business brought me to New York, and a matter of curiosity brought me to this place.\" \\n\\n \\n\\n \"How did you trace me to—to Brentville?\" asked Mr. Kenyon, with evident uneasiness. \\n\\n \\n\\n \"I suppose that means you didn\u0027t wish to be traced, eh?\" \\n\\n \\n\\n \"And suppose I did not?\" \\n\\n \\n\\n \"I am really sorry to have disturbed you, Mr. Crandall—I beg pardon, Kenyon; but I thought you might like to hear directly from your wife.\" \\n\\n \\n\\n \"For Heaven\u0027s sake, hush!\" exclaimed Kenyon, looking round him nervously. \\n\\n \\n\\n He rose, and, walking to the door, shut it, first peering into the hall to see if anyone were listening. \\n\\n \\n\\n Dr. Fox laughed again. \\n\\n \\n\\n \"It\u0027s well to be cautious,\" he said. \"I quite approve of it—under the circumstances, Mr. Kenyon,\" he proceeded, leering at him with unpleasant familiarity. \"You\u0027re a deep one! I give you credit for being deeper than I supposed. You\u0027ve played your cards well, that\u0027s a fact.\" \\n\\n \\n\\n Mr. Kenyon bit his finger-nails to the quick in his alarm and irritation. He would like to have choked the man who sat before him, if he had dared, and possessed the requisite strength. \\n\\n \\n\\n \"You only made one mistake, my dear sir. You shouldn\u0027t have tried to deceive me. You should have taken me into your confidence. You might have known I would find out your little game.\" \\n\\n \\n\\n \"Dr. Fox,\" said Mr. Kenyon, frowning, \"your tone is very offensive. You will bear in mind that you are addressing a gentleman.\" \\n\\n \\n\\n \"Ho! ho!\" laughed the visitor. \"I really beg pardon,\" he said, marking the dark look on the face of the other. \"No offence is intended. In fact, I was rather expressing my admiration for your sharpness. It was an admirable plan, that of yours.\" \\n\\n \\n\\n \"I don\u0027t care for compliments. Why have you sought me out?\" \\n\\n \\n\\n \"A moment\u0027s patience, Mr. Kenyon. I was about to say Crandall—force of habit, sir. As I remarked, it was a capital plan to commit your wife to an insane asylum, and then take possession of her property. Did you have any difficulty about that, by the way?\" \\n\\n \\n\\n \"None of your business!\" snapped Mr. Kenyon. \\n\\n \\n\\n \"I am naturally a little curious on the subject.\" \\n\\n \\n\\n \"Confound your curiosity!\" \\n\\n \\n\\n \"And so—ho! ho!—you are popularly regarded as a widower? Perhaps you have reared a monument in the cemetery to the dear departed? Ho! ho!\" \\n\\n \\n\\n \"This is too much, sir!\" exploded Kenyon, in wrath. \"drop this subject, or I may do you a mischief.\" \\n\\n \\n\\n \"You\u0027d better think twice before you permit your feelings to overmaster you,\" said the stranger significantly. \"That\u0027s an ugly secret I possess of yours. What would the good people of Brentville say if they knew that your wife, supposed to be dead, is really confined in an insane asylum, while you, without any sanction of law, are living luxuriously on her wealth? I think, Mr. Kenyon, they would be very apt to lynch you.\" \\n\\n \\n\\n \"You have nothing to complain of, at least. You are well paid for the care of—of the person you mention.\" \\n\\n \\n\\n \"I am paid my regular price—that is all, sir.\" \\n\\n \\n\\n \"Is not that enough?\" \\n\\n \\n\\n \"Under the circumstances, it is not.\" \\n\\n \\n\\n \"Why not?\" \\n\\n \\n\\n \"Do you need to ask? To begin with, your wife――\" \\n\\n \\n\\n \"Hush!\" said Kenyon nervously. \"Call her Mrs. Crandall.\" \\n\\n \\n\\n \"Mrs. Crandall, if you will. Well, Mrs. Crandall is as sane as you are.\" \\n\\n \\n\\n \"Then she is less trouble.\" \\n\\n \\n\\n \"Not at all! She is continually imploring us to release her. It is quite a strain upon our feelings, I do assure you.\" \\n\\n \\n\\n \"Your feelings!\" repeated Kenyon disdainfully. \\n\\n \\n\\n Dr. Fox laughed. \\n\\n \\n\\n \"Really,\" he said, \"I am quite affected at times by her urgency.\" \\n\\n \\n\\n \"Does she—ever mention me?\" asked Mr. Kenyon slowly. \\n\\n \\n\\n \"Yes, but it wouldn\u0027t flatter you to hear her. She speaks of you as a cruel tyrant, who has separated her from her boy. His name is Oliver, isn\u0027t it?\" \\n\\n \\n\\n \"Yes.\" \\n\\n \\n\\n \"She mourns for him, and prays to see him once more before she dies.\" \\n\\n \\n\\n \"Is her physical health failing?\" enquired Kenyon, with sudden hopefulness. \\n\\n \\n\\n \"No; that is the strangest part of it. She retains her strength. Apparently she is determined to husband her strength, and resolved to live on in the hope of some day being restored to her son.\" \\n\\n \\n\\n Mr. Kenyon gnawed his nails more viciously than before. It had been his cherished hope that the wife whom he had so cruelly consigned to a living death would succumb beneath the accumulated weight of woe, and relieve him of all future anxiety by dying in reality. The report just received showed that such hopes were fallacious. \\n\\n \\n\\n \"Well, sir,\" he commenced, after a brief pause. \"I do not wish to prolong this interview. Tell me why you have tracked me here? What is it you require?\" \\n\\n \\n\\n \"The fact is, Mr. Kenyon,—you\u0027ll excuse my dropping the name of Crandall,—I want some money.\" \\n\\n \\n\\n \"A month since I paid, through my agent, your last quarterly bill. No more money will be due you till the 1st of December.\" \\n\\n \\n\\n \"I want a thousand dollars,\" said the visitor quietly. \\n\\n \\n\\n \"What!\" ejaculated Kenyon. \\n\\n \\n\\n \"I want a thousand dollars before I leave Brentville.\" \\n\\n \\n\\n \"You won\u0027t get it from me!\" \\n\\n \\n\\n \"Consider a moment, Mr. Crandall,—I mean Mr. Kenyon,—the result of my publishing this secret of yours. I understand that your wife\u0027s property, which you wrongfully hold, amounts to a quarter of a million of dollars. If all were known, your step-son Oliver and his mother would step into it, and you would be left out in the cold. Disagreeable, very! Can\u0027t you introduce me to Oliver?\" \\n\\n \\n\\n Mr. Kenyon\u0027s face was a study. He was like a fly in the meshes of a spider, absolutely helpless. \\n\\n \\n\\n \"If I give you a check,\" he said, \"will you leave Brentville at once?\" \\n\\n \\n\\n \"First thing to-morrow morning.\" \\n\\n \\n\\n \"Can\u0027t you go before?\" \\n\\n \\n\\n \"Not conveniently. The next town is five miles away, and I don\u0027t like night travel.\" \\n\\n \\n\\n Mr. Kenyon opened his desk and hastily dashed off a check. \\n\\n \\n\\n \"Now,\" said he, \"leave, and don\u0027t come back.\" \\n\\n \\n\\n \"You waive ceremony with a vengeance, Mr. Kenyon,\" said the visitor, depositing the check in his pocket-book with an air of satisfaction. \"Permit me to thank you for your liberality.\" \\n\\n \\n\\n As he was about to leave the room Roland dashed in. The two looked at each other curiously. \\n\\n \\n\\n \"Is this Oliver?\" asked Dr. Fox. \\n\\n \\n\\n \"No, it is my son Roland. Good-evening.\" \\n\\n \\n\\n \"I am glad to make the young gentleman\u0027s acquaintance. Hope he\u0027ll inherit his father\u0027s virtues, ha, ha!\" \\n\\n \\n\\n \"Who is that, father?\" asked Roland when the visitor had retired. \\n\\n \\n\\n \"A mere acquaintance, Roland—a man with whom I have had a little business.\" \\n\\n \\n\\n \"I don\u0027t like him.\" \\n\\n \\n\\n \"Nor I. But I must bid you good-night, my son. I am tired and need rest.\" \\n\\n \\n\\n \"I wanted to speak to you about Oliver.\" \\n\\n \\n\\n \"We will defer that till morning.\" \\n\\n \\n\\n \"Good-night, then!\" and Roland left his father a prey to anxieties which kept him awake for hours. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2088/59211.html","bookId":527,"book":{"id":527,"title":"Adrift in The City or Oliver Conrad\u0027s Plucky Fight","description":"简介： The speaker, a boy of sixteen, stood on the lawn before a handsome country mansion. He had a bat in his hand, and had sent the ball far down the street. He was fashionably dressed, and evidently felt himself a personage of no small consequence....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2088","creation":"Aug 1, 2019 12:18:53 AM","modification":"Aug 1, 2019 12:18:53 AM"}}
