{"id":26072,"no":26,"title":"BOOK TWO—LOVE’S DREAM CHAPTER I—BLUE EYES AND BLACK HAIR","content":"SHE’S coming next month, Charlie,” said Mrs. Durham, looking up from a letter. \\n\\n \\n\\n “Who is it now. Auntie, another divinity with which you are going to overwhelm me?” asked Gaston smiling as he laid his book down and leaned back in his chair. \\n\\n \\n\\n “Some one I’ve been telling you about for the last month.” \\n\\n \\n\\n “Which one?” \\n\\n \\n\\n “Oh, you wretch! You don’t think about anything except your books. I’ve been dinning that girl’s praises into your ears for fully five weeks, and you look at me in that innocent way and ask which one?” \\n\\n \\n\\n “Honestly, Aunt Margaret, you’re always telling me about some beautiful girl, I get them mixed. And then when I see them, they don’t come up to the advance notices you’ve sent out. To tell you the truth, you are such a beautiful woman, and I’ve got so used to your standard, the girls can’t measure up to it.” \\n\\n \\n\\n “You flatterer. A woman of forty-two a standard of beauty! Well, it’s sweet to hear you say it, you handsome young rascal.” \\n\\n \\n\\n “It’s the honest truth. You are one of the women who never show the addition of a year. You have spoiled my eyesight for ordinary girls.” \\n\\n \\n\\n “Hush, sir, you don’t dare to talk to any girl like you talk to me. They all say you’re afraid of them.” \\n\\n \\n\\n “Well, I am, in a sense. I’ve been disappointed so many times.” \\n\\n \\n\\n “Oh! you ’ll find her yet and when you do!”— \\n\\n \\n\\n “What do you think will happen?” \\n\\n \\n\\n “I’m certain you will be the biggest fool in the state.” \\n\\n \\n\\n “That will make it nice for the girl, won’t it?” \\n\\n \\n\\n “Yes, and I shall enjoy your antics. You who have dissected love with your brutal German philosophy, and found every girl’s faults with such ease,—it will be fun to watch you flounder in the meshes at last.” \\n\\n \\n\\n “Auntie, seriously, it will be the happiest day of my life. For four years my dreams have been growing more and more impossible. Who is this one?” \\n\\n \\n\\n “She is the most beautiful girl I know, and the brightest and the best, and if she gets hold of you she will clip your wings and bring you down to earth. I ’ll watch you with interest,” said Mrs. Durham looking over the letter again and laughing. \\n\\n \\n\\n “What are you laughing at?” \\n\\n \\n\\n “Just a little joke she gets off in this letter.” \\n\\n \\n\\n “But who is she? You haven’t told me.” \\n\\n \\n\\n “I did tell you—she’s General Worth’s daughter, Miss Sallie. She writes she is coming up to spend a month at the Springs, with her friend Helen Lowell, of Boston, and wants me to corral all the young men in the community and have them fed and in fine condition for work when they arrive.” \\n\\n \\n\\n “She evidently intends to have a good time.” \\n\\n \\n\\n “Yes, and she will.” \\n\\n \\n\\n “Fortunately my law practice is not rushing me at this season. My total receipts for June last year were two dollars and twenty-five cents. It will hardly go over two-fifty this year.” \\n\\n \\n\\n “I’ve told her you’re a rising young lawyer.” \\n\\n \\n\\n “I have plenty of room to rise, Auntie. If you will just keep on letting me board with you, I hope to work my practice up to ten dollars a month in the course of time.” \\n\\n \\n\\n “Don’t you want to hear something about Miss Sallie?” \\n\\n \\n\\n “Of course, I was just going to ask you if she’s as homely as that last one you tried to get off on me.” \\n\\n \\n\\n “I’ve told you she’s a beauty. She made a sensation at her finishing school in Baltimore. It’s funny that she was there the last year you were at the Johns Hopkins University. She’s the belle of Independence, rich, petted, and the only child of old General Worth, who thinks the sun rises and sets in her pretty blue eyes.” \\n\\n \\n\\n “So she has blue eyes?” \\n\\n \\n\\n “Yes, blue eyes and black hair.” \\n\\n \\n\\n “What a funny combination! I never saw a girl with blue eyes and black hair.” \\n\\n \\n\\n “It’s often seen in the far South. I expect you to be drowned in those blue eyes. They are big, round and child-like, and look out of their black lashes as though surprised at their dark setting. This contrast accents their dreamy beauty, and her eyes seem to swim in a dim blue mist like the point where the sea and sky meet on the horizon far out on the ocean. She is bright, witty, romantic and full of coquetry. She is determined to live her girl’s life to its full limit. She is fond of society and dances divinely.” \\n\\n \\n\\n “That’s bad. I never even cut the pigeon’s wing in my life—and I’m too old to learn.” \\n\\n \\n\\n “She has a full queenly figure, small hands and feet, delicate wrists, a dimple in one cheek only, and a mass of brown-black hair that curls when it’s going to rain.” \\n\\n \\n\\n “That’s fine, we wouldn’t need a barometer on life’s voyage, would we?” \\n\\n \\n\\n “No, but you will be looking for a pilot and a harbour before you’ve known her a month. Her upper lip is a little fuller and projects slightly over the lower, and they are both beautifully fluted and curved like the petals of a flower, which makes the most tantalising mouth a standing challenge for a kiss.” \\n\\n \\n\\n “Oh! Auntie, you’re joking! You never saw such a girl. You’re breaking into my heart, stealing glances at my ideal.” \\n\\n \\n\\n “All right, sir, wait and see for yourself. She has pretty shell-like ears, her laughter is full, contagious, and like music. She plays divinely on the piano, can’t sing a note, but dresses to kill. You might as well wind up your affairs, and get ready for the first serious work of your life. You will have your hands full after you see her.” \\n\\n \\n\\n “But did I understand you to say she’s rich?” \\n\\n \\n\\n “Yes, they say her father is worth half a million.” \\n\\n \\n\\n “Do you think she could be interested in the poor in this county?” \\n\\n \\n\\n “Yes, she doesn’t seem to know she’s an heiress. Her father, the General, is a deacon in the Baptist church at Independence, and hates dudes and fops with all his old-fashioned soul. His idea of a man is one of character, and the capacity of achievement, not merely a possessor of money. Still, I imagine he is going to give any man trouble who tries to take his daughter away from him.” \\n\\n \\n\\n “I’m afraid that money lets me out of the race.” \\n\\n \\n\\n “Nothing of the sort, when you see her you will never allow a little thing like that to worry you.” \\n\\n \\n\\n “It’s not her dollars that will worry me. It’s the fact that she’s got them and I haven’t. But, anyhow, Auntie, from your description you can book me for one night at least.” \\n\\n \\n\\n “I’m going to book you for her lackey, her slave, devoted to her every whim while she’s here. One night—the idea!” \\n\\n \\n\\n “Auntie, you’re too generous to others. I’ve no notion all this rigmarole about your Miss Sallie Worth is true. But I ’ll do anything to please you.” \\n\\n \\n\\n “Very well, I ’ll see whom you are trying to please later.” \\n\\n \\n\\n “I must go,” said Gaston, hastily rising. “I have an engagement to discuss the coming political campaign with the Hon. Allan McLeod, the present Republican boss of the state.” \\n\\n \\n\\n “I didn’t know you hobnobbed with the enemy.” \\n\\n \\n\\n “I don’t. But as far as I can understand him, he purposes to take me up on an exceeding high mountain and offer me the world and the fulness thereof. We all like to be tempted whether we fall or not. The Doctor hates McLeod. I think he holds some grudge against him. What do you think of him, Auntie? He swears by you. I used to dislike him as a boy, but he seems a pretty decent sort of fellow now, and I can’t help liking just a little anybody who loves you. I confess he has a fascination for me.” \\n\\n \\n\\n “Why do you ask my opinion of him?” slowly asked Mrs. Durham. \\n\\n \\n\\n “Because I’m not quite sure of his honesty. He talks fairly, but there’s something about him that casts a doubt over his fairest words. He says he has the most important proposition of my life to place before me to-day, and I’m at a loss how to meet him—whether as a well-meaning friend or a scheming scoundrel. He’s a puzzle to me.” \\n\\n \\n\\n “Well Charlie, I don’t mind telling you that he is a puzzle to me. I’ve always been strangely attracted to him, even when he was a big red-headed brute of a boy. The Doctor always disliked him and I thought, misjudged him. He has always paid me the supremest deference, and of late years the most subtle flattery. No woman, who feels her life a failure, as I do mine, can be indifferent to such a compliment from a man of trained mind and masterful character. This is a sore subject between the Doctor and myself. And when I see him shaking hands a little too lingeringly with admiring sisters after his services, I repay him with a chat with my devoted McLeod. Don’t ask me. I like him, and I don’t like him. I admire him and at the same time I suspect and half fear him.” \\n\\n \\n\\n “Strange we feel so much alike about him. But your heart has always been very close to mine, since you slipped your arm around me that night my mother died. I know about what he will say, and I know about what I ’ll do.” He stooped and kissed his fostermother tenderly. \\n\\n \\n\\n “Charlie, I’m in earnest about my pretty girl that’s coming. Don’t forget it.” \\n\\n \\n\\n “Bah! You’ve fooled me before.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1804/52399.html","bookId":1050,"book":{"id":1050,"title":"The Leopard\u0027s Spots","description":"简介： In answer to hundreds of letters, I wish to say that all the incidents used in Book I., which is properly the prologue of my story, were selected from authentic records, or came within my personal knowledge....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1804","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
