{"id":26050,"no":4,"title":"CHAPTER III—DEEPENING SHADOWS","content":"ON the second day after Mrs. Gaston was stricken a forlorn little boy sat in the kitchen watching Aunt Eve get supper. He saw her nod while she worked the dough for the biscuits. “Aunt Eve, I’m going to sit up to-night and every night with my Mama, ’till she gets well. I can’t sleep for hours and hours. I lie awake and cry when I hear her talking ’till I feel like I’ll die. I must do something to help her.” “Laws, honey, you’se too little. You can’t keep ’wake ’tall. You get so lonesome and skeered all by yerself.” “I don’t care, I’ve told Tom to wake me to-night if I’m asleep when he goes, and I’ll sit up from twelve ’till two o’clock and then call you.” “All right, Mammy’s darlin’ boy, but you git tired en can’t stan’ it.” So that night at midnight he took his place by the bedside. His mother was sleeping, at first. He sat and gazed with aching heart at her still, white face. She stirred, opened her eyes, saw him, and imagined he was his father. “Dearie-, I knew you would come,” she murmured. “They told me you were dead; but I knew better. What a long, long time you have been away. How brown the sun has tanned your face, but it’s just as handsome. I think handsomer than ever. And how like you is little Charlie! I knew you would be proud of him!” While she talked, her eyes had a glassy look, that seemed to take no note of anything in the room. The child listened for ten minutes, and then the horror of her strange voice, and look and words overwhelmed him. He burst into tears and threw his arms around his mother’s neck and sobbed. “Oh! Mama dear, it’s me, Charlie, your little boy, who loves you so much. Please, don’t talk that way. Please look at me like you used to. There! Let me kiss your eyes ’till they are soft and sweet again!” He covered her eyes with kisses. The mother seemed dazed for a moment, held him off at arm’s length, and then burst into laughter. “Of course, you silly, I know you. You must run to bed now. Kiss me good night.” “But you are sick, Mama, I am sitting up with you.” Again she ignored his presence. She was back in the old days with her Love. She was kissing her hand to him as he left her for his day’s work. Charlie looked at the clock. It was time to give her the soothing drops the doctor left. She took it, obedient as a child, and went on and on with interminable dreams of the past, now and then uttering strange things for a boy’s ears. But so terrible was the anguish with which he watched her, the words made little impression on his mind. It seemed to him some one was strangling him to death, and a great stone was piled on his little prostrate body. When she grew quiet, at last, and dosed, how still the house seemed! How loud the tick of the clock! How slowly the hands moved! He had never noticed this before. He watched the hands for five minutes. It seemed each minute was an hour, and five minutes were as long as a day. What strange noises in the house! Suppose a ghost should walk into the room! Well, he wouldn’t run and leave his Mama; he made up his mind to that. Some nights there were other sounds more ominous. The town was crowded with strange negroes, who were hanging around the camp of the garrison. One night a drunken gang came shouting and screaming up the alley close beside the house, firing pistols and muskets. They stopped at the house, and one of them yelled, “Burn the rebel’s house down! It’s our turn now!” The terrified boy rushed to the kitchen and called Nelse. In a minute, Nelse was on the scene. There was no more trouble that night. “De lazy black debbels,” said Nelse, as he mopped the perspiration from his brow, “I’ll teach ’em what freedom is.” The next day when the Rev. John Durham had an interview with the Commandant of the troops, he succeeded in getting a consignment of corn for seed, and to meet the threat of starvation among some families whose condition he reported. This important matter settled, he said to the officer: “Captain, we must look to you for protection. The town is swarming with vagrant negroes, bent on mischief. There are camp followers with you organizing them into some sort of union League meetings, dealing out arms and ammunition to them, and what is worse, inflaming the worst passions against their former masters, teaching them insolence and training them for crime.” “I’ll do the best I can for you Doctor, but I can’t control the camp followers who are organising the union League. They live a charmed life.” That night, as the Preacher walked home from a visit to a destitute family he encountered a burly negro on the sidewalk, dressed in an old suit of Federal uniform, evidently under the influence of whiskey. He wore a belt around his waist, in which he had thrust, conspicuously, an old horse pistol. Standing squarely across the pathway, he said to the Preacher, “Git outer de road, white man, you’se er rebel, I’se er Loyal union Leaguer!” It was his first experience with Negro insolence since the emancipation of his slaves. Quick as a flash, his right arm was raised. But he took a second thought, stepped aside, and allowed the drunken fool to pass. He went home wondering in a hazy sort of way through his excited passions what the end of it all would be. Gradually in his mind for days this towering figure of the freed Negro had been growing more and more ominous, until its menace overshadowed the poverty, the hunger, the sorrows and the devastation of the South, throwing the blight of its shadow over future generations, a veritable Black Death for the land and its people.","sourceLink":"http://novel.tingroom.com/jingdian/1804/52377.html","bookId":1050,"book":{"id":1050,"title":"The Leopard\u0027s Spots","description":"简介： In answer to hundreds of letters, I wish to say that all the incidents used in Book I., which is properly the prologue of my story, were selected from authentic records, or came within my personal knowledge....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1804","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
