{"id":26095,"no":49,"title":"CHAPTER II—FACE TO FACE WITH FATE","content":"THREE weeks before Christmas Gaston began to dream of the visit he was to make to Independence to see Sallie Worth. How long it seemed since she had kissed him in the twilight of that Pullman car and the Limited had rolled away bearing her further and further from his life! He would sit now for an hour reading her last letter, looking at her picture on his desk, and dreaming of what she would say when he sat by her side again in her own home. \n \n And then like a thunderbolt out of a clear sky came a tearful letter announcing another storm at home. Her father had again forbidden her to write. She said, at the last, that Gaston’s visit must be postponed indefinitely for the present. He gazed at the letter with a hardened look. \n \n “I will go. I ’ll face General Worth in his own home, and demand his reasons for such treatment. I am a man I am entitled to the respect of a man.” He made this declaration with a quiet force that left no doubt about his doing it. \n \n He wrote Sallie that he could not and would not endure such a fight in the dark with the General, and that he was going to Independence on the day before Christmas as she had planned at first, to have it out with him face to face. \n \n She wrote in reply and begged him under no circumstances to come until conditions were more favourable. He got this letter the day before he was to start. \n \n “I ’ll go and I ’ll see him if I have to fight my way into his house, that’s all there is to it!” he exclaimed. \n \n When he reached Independence, St. Clare met him at the depot, and gave him an eager welcome. \n \n “I’ve been expecting you, you hard-headed fool!” he said impulsively. \n \n “Well, your words are not equal to your handshake. What’s the matter?” asked Gaston. \n \n “You know what’s the matter. Miss Sallie has been to see me this afternoon, and begged me to chain you at my house if you came to town to-day.” \n \n “Well, you ’ll need handcuffs, and help to get them on,” replied Gaston with quiet decision. \n \n “Look here, old boy, you’re not going down to that house to-night with the old man threatening to kill you on sight, and your girl bordering on collapse!” \n \n “I am. I’ve been bordering on collapse for some time myself. I’m getting used to it.” \n \n “You’re a fool.” \n \n “Granted, but I ’ll risk it.” \n \n “But, man, I tell you Miss Sallie will be furious with you if you go after all the messages she has sent you.” \n \n “I ’ll risk her fury too.” \n \n “Gaston, let me beg you not to do it.” \n \n “I’m going, Bob. It isn’t any use for you to waste your breath.” \n \n “You know where my heart is, old chum,” said Bob, yielding reluctantly. “I couldn’t go down to that house to-night under the conditions you are going for the world.” \n \n “Why not? It’s the manly thing to do.” \n \n “It’s a dangerous thing to do. Fathers have killed men under such conditions.” \n \n “Well, I ’ll risk it. I’m going as soon as I can brush up a little.” \n \n Bob walked with him to the outskirts of the city, begging in vain that he should turn back, but he never slacked his pace. \n \n When he turned to go home, Bob pressed his hand and said “Good luck. And may your shadow never grow less.” \n \n Gaston walked rapidly on toward Oakwood. As he passed through the shadows of the forest near the gate, a flood of tender memories rushed over him. He was back again by her side on that morning he met her, with the first flush of love thrilling his life. He could see her looking earnestly at him as though trying to solve a riddle. He could hear her laughter full of joy and happiness. As he turned into the gateway the house flashed on him its gleaming windows from the hill top. He felt his heart sink with bitterness as he realised the contrast of his last entrance into that house, its welcomed guest, and his present unbidden intrusion. Once those lights had gleamed only a message of peace and love. Now they seemed signals of war some enemy had set on the hill to warn of his approach. \n \n He paused a moment and wiped the perspiration from his brow. It was Christmas eve, but the air was balmy and spring-like and his rapid walk had tired him. He had eaten nothing all day, had slept only a few hours the night before, and the nerve strain had been more than he knew. \n \n He looked up at the great white pillars softly shining in the starlight, and a sickening fear of a possible tragedy behind those doors crept over him. \n \n “My God!” he exclaimed, “I had rather charge a breastworks in the face of flashing guns than to go into that house to-night and meet one man!” \n \n He recognised the breach of the finer amenities of life involved in forcing his way into a home under such conditions, and it humiliated him for a moment. \n \n “We will not stickle for forms now,” he said to himself firmly. “This is war. I am to uncover the batteries of my enemy. I have hesitated long enough. I will not fight in the dark another day.” \n \n As he stepped briskly up to the door, he started at a sudden thought. What if the General had ordered the servants to slam the door in his face! The possibility of such an unforeseen insult made the cold sweat break out over his face as he rang the bell. No matter, he was in for it now, he would face hell if need be! \n \n He waited but an instant, and heard the heavy tread of a man approach the door. Instinctively he knew that the General himself was on guard, and would open the door. Evidently he had expected him. \n \n The door opened about two feet and the General glared at him livid with rage. He held one hand on the door and the other on its facing, and his towering figure filled the space. \n \n “Good evening, General!” said Gaston with embarrassment. \n \n “What do you want, sir?” he growled. \n \n “I wish to see you for a few minutes.” \n \n “Well, I don’t want to see you.” \n \n “Whether you wish to or not, you must do it sooner of later,” answered Gaston with dignity. \n \n “Indeed! Your insolence is sublime, I must say!” \n \n “The sooner you and I have a plain talk the better for both of us. It can’t be put off any longer,” Gaston continued with self control. He was looking the General straight in the eyes now, with head and broad shoulders erect and his square-cut jaws were snapping his words with a clean emphasis that was not lost on the older master of men before him. \n \n “Call at my office in the morning at ten o’clock.” he said, at length. \n \n “I will not do it. I am going home on the nine o’clock train. To-morrow is Christmas day. The issue between us is of life import to me, and it may be of equal importance to you. I will not put it off another hour!” \n \n The General glared at him. His hands began to tremble, and raising his voice, he thundered, “I am not accustomed to take orders from young upstarts. How dare you attempt to force yourself into my house when you were told again and again not to attempt it, sir?” \n \n “Your former welcome to me on three occasions when the object of my visits was as well known to you as to me, gives me, at least, the vested rights of a final interview. I demand it,” retorted Gaston curtly. \n \n “And I refuse it!” Still there was a note of indecision in his voice which Gaston was quick to catch. \n \n “General,” he protested, “you are a soldier and a gentleman. You never fought an enemy with uncivilised warfare. Yet you have allowed some one under your protection to stab me in the dark for the past year. I am entitled to know why I fight and against whom. I ask your sense of fairness as a soldier if I am not right?” \n \n The General hesitated, and finally said, as he opened the door, “Walk into the parlour.” \n \n When they were seated, Gaston plunged immediately into the question he had at heart. \n \n “Now, General, I wish to ask you plainly why you have treated me as you have since I asked you for your daughter’s hand?” \n \n “The less said about it, the better. I have good and sufficient reasons, and that settles it.” \n \n “But I have the right to know them.” \n \n “What right?” \n \n “The right of every man to face his accuser when on trial for his life.” \n \n “Bah! men don’t die nowadays for love, or women either,” the General growled. \n \n “Besides,” continued Gaston, “you are under the deepest obligations to tell me fairly your reasons.” \n \n “Obligations?” \n \n “The obligations of the commonest justice between man and man. You invited me to your home. I was your welcome guest. You encouraged my suit for your daughter’s hand.” \n \n “How dare you say such a thing, sir!” \n \n “Because she told me you did. I was led to believe that you not only looked with favour on my suit, but that you were pleased with it. I asked for your daughter. You insulted my manhood by refusing me permission even to seek an interview, and know the reasons for your change of views. Since then you have treated me with plain brutality. Now something caused this change.” \n \n “Certainly something caused it, something of tremendous importance,” said the General. \n \n “I am entitled to know what it is.” \n \n “Simply this. I received information concerning you, your habits, your associates, your character, and your family, that caused me to change my mind.” \n \n “Did you inquire as to their truth?” \n \n “It was unnecessary. I love my daughter beyond all other treasures I possess. With her future I will take no risks.” \n \n “I have the right to know the charges, General,” insisted Gaston. “I demand it.” \n \n “Well, sir, if you demand it, you will get it. I learned that you are a man of the most dissolute habits and character, that you are a hard drinker, a gambler, a rake and a spendthrift, and that your family’s history is a deplorable one.” \n \n “My family history a deplorable one!” cried Gaston, springing to his feet, with trembling clinched fists and scarlet face on which the blue veins suddenly stood out. \n \n “I begged you to spare me and yourself the pain of this,” replied the General in a softer voice. \n \n “No, I do not ask to be spared. Give me the particulars. What is the stain on my family name?” \n \n “Not a moral one, but in some respects more hopeless, a physical one. I have positive information that your people on one side are what is known in the South as poor white trash—” \n \n Gaston smiled. “I thank you, General, for your frankness. The only wrong of which I complain, is your withholding the name of the liar.” \n \n “There is no use of a fight over such things. I do not wish my daughter’s name to be smirched with it.” \n \n “Her name is as dear to me as it can possibly be to you. Never fear. You are her father, I honour you as such. I thank you for the information. I scorn to stoop to answer. The humour of it forbids an answer if I could stoop to make one. Now, General, I make you this proposition. I am not in a hurry. I will patiently wait any time you see fit to set for any developments in my life and character about which you have doubts. All I ask is the privilege of writing to the woman I love. Is not this reasonable?” \n \n “No, sir,” declared the General, “I will not have it. You are not in a position to make me a proposition of any sort. I have settled this affair. It is not open for discussion.” \n \n “You mean to say that I have no standing whatever in the case?” asked Gaston with a smile, rubbing his hand over his smooth shaved lips and chin. \n \n “Exactly. I’ve settled it. There’s nothing more to be said.” \n \n “I ’ll never give her up. She is the one woman God made for me, and you will have to put me under the ground before you have settled my end of it,” said Gaston still smiling. \n \n The old man’s face clouded for a moment, he wrinkled his brow, drew his bushy eyebrows closer and then turned toward Gaston in a persuasive way. \n \n “Look here, Gaston, don’t be a fool. It’s amusing to me to hear a youngster talk such drivel. Love is not a fatal disease for a man, or a woman. You will find that out later if you don’t know it now. I loved a half dozen girls, and when I got ready to marry, I asked the one handiest, and that seemed most suited to my temper. We married and have lived as happily as the romancers. The world is full of pretty girls. Go on about your business, and quit bothering me and mine.” \n \n “There’s only one girl for me, General!” \n \n “That’s proof positive to my mind that you are a little cracked!” he answered with a smile. \n \n Gaston laughed and shook his head. “I ’ll never give her up in this world, or the next,” he doggedly added. \n \n Again the General frowned. “Look here, young man, did it ever occur to you that your pursuit might be held the work of a low adventurer? My daughter is an heiress. You haven’t’ a dollar. Don’t you know that I will disinherit her if she marries without my consent?” \n \n “You can’t frighten me on that tack,” answered Gaston firmly. “No dollar mark has yet been placed on the doors of Southern society. Manhood, character and achievement are the keys that unlock it. You know that, and I now it. I was poorer and more obscure the day you first invited me here than to-day. And yet you gave me as hearty a welcome as her richest suitor. All I ask is time to prove to you in my life my manhood and worth,—one year, two years, five years, ten years, any time you see fit to name.” \n \n “No, sir,” firmly snapped the General, “not a day. I don’t like long engagements. Yours is ended, once and for all time. I have settled that.” \n \n “Can even a father decide the destiny of two immortal souls off hand like that?” \n \n “Now, you are assuming too much. I am not speaking for myself alone. I have laid all the facts carefully before Sallie, and she has agreed to the wisdom of my decision, and asked me to represent her in what I say this evening.” \n \n Gaston turned pale, his lips quivered, and turning to the General suddenly, he said, “That is the only important fact you have laid before me. Just let her come here, stand by your side and say that with her own lips, and I will never cross your path in life again.” \n \n The General hung his head and stammered, “No, it is not necessary. It will embarrass and humiliate her. I will not permit it.” \n \n “Then I deny your credentials!” exclaimed Gaston. \n \n The General seemed embarrassed by the failure of this fatherly subterfuge, and Gaston could not help smiling at the revelation of his weakness. He decided to press his advantage and try to see her if only for a moment. \n \n “General,” protested Gaston persuasively, “I appeal to your sense of courtesy, even to an enemy. After all that has passed between us in this house, is it fair or courteous to show me that door without one word of farewell to the woman to whom I have given my life? Or is it wise from your point of view?” \n \n Again the General hesitated. He was a big-hearted man of generous impulses, and he felt worsted in this interview somehow, but it was hard to deny such a request. He fumbled at his watch chain, arose, and said, “I will see if she desires it.” \n \n Gaston’s heart bounded with joy! If she desired it! He could feel her soul enveloping him with its love as he sat there conscious that she was somewhere in that house praying for him! \n \n He fairly choked with the pain and the joy of the certainty that in a moment he would be near her, touch her hand, see her glorious beauty and his ears drink the music of her voice. \n \n “Just step this way,” said the General, re-appearing at the door. \n \n Gaston walked into the hall and met Sallie as she emerged from the library door opposite. He tried to say something, but his throat was dry and his tongue paralysed with the wonder of her presence! Besides, the General stood grimly by like a guard over a life prisoner. \n \n He looked searchingly into her eyes as he held her hand for a moment and felt its warm impulsive pressure. Oh! the eyes of the woman we love! What are words to their language of melting tenderness, of faith and longing. Gaston felt like shouting in the General’s face his triumph. She tried to speak, but only pressed his hand again. It was enough. \n \n He bowed to the General, and left without a word. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1804/52422.html","bookId":1050,"book":{"id":1050,"title":"The Leopard\u0027s Spots","description":"简介： In answer to hundreds of letters, I wish to say that all the incidents used in Book I., which is properly the prologue of my story, were selected from authentic records, or came within my personal knowledge....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1804","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
