{"id":26101,"no":55,"title":"CHAPTER VIII—THE NEW SIMON LEGREE","content":"HARRIS immediately resigned his office in the custom house which he owed to Lowell and began a search for employment. \\n\\n \\n\\n “I will not be a pensioner of a government of hypocrites and liars,” he exclaimed as he sealed his letter of resignation. \\n\\n \\n\\n And then began his weary tramp in search of work. Day after day, week after week, he got the same answer—an emphatic refusal. The only thing open to a negro was a position as porter, or bootblack, or waiter in second-rate hotels and restaurants, or in domestic service as coachman, butler or footman. He was no more fitted for these places than he was to live with his head under water. \\n\\n \\n\\n “I will blow my brains out before I will prostitute my intellect, and my consciousness of free manhood by such degrading associates and such menial service!” he declared with sullen fury. \\n\\n \\n\\n At last he determined to lay aside his pride and education and learn a manual trade. Not a labour union would allow him to enter its ranks. \\n\\n \\n\\n He managed to earn a few dollars at odd jobs and went to New York. Here he was treated with greater brutality than in Boston. At last he got a position in a big clothing factory. He was so bright in colour that the manager never suspected that he was a negro, as he was accustomed to employing swarthy Jews from Poland and Russia. \\n\\n \\n\\n When Harris entered the factory the employees discovered within an hour his race, laid down their work, and walked out on a strike until he was removed. \\n\\n \\n\\n He again tried to break into a labour union and get the protection of its constitution and laws. He managed at last to make the acquaintance of a labour leader who had been a Quaker preacher, and was elated to discover that his name was Hugh Halliday, and that he was a son of one of the Hallidays who had assisted in the rescue of his mother and father from slavery. He told Halliday his history and begged his intercession with the labour union. \\n\\n \\n\\n “I ’ll try for you, Harris,” he said, “but it’s a doubtful experiment. The men fear the Negro as a pestilence.” \\n\\n \\n\\n “Do the best you can for me. I must have bread. I only ask a man’s chance,” answered Harris. Halliday proposed his name and backed it up with a strong personal endorsement, gave a brief sketch of his culture and accomplishments and asked that he be allowed to learn the bricklayer’s trade. \\n\\n \\n\\n When his name came up before the Brick Layers’ union, and it was announced that he was a negro, it precipitated a debate of such fury that it threatened to develop into a riot. \\n\\n \\n\\n One of the men sprang toward the presiding officer with blazing eyes, gesticulating wildly until recognised. \\n\\n \\n\\n “I have this to say,” he shouted. “No negro shall ever enter the door of this union except over my dead body. The Negro can under live us. We can not compete with him, and as a race we can not organise him. Let him stay in the South. We have no room for him here, and we will kill him if he tries to take our bread from us!” \\n\\n \\n\\n “Have you no sympathy for his age-long sufferings in slavery?” interrupted Halliday. \\n\\n \\n\\n “Slavery! of all the delusions the idea that slavery was abolished in this country in 1865 is the silliest, Slavery was never firmly established until the chattel form was abandoned for the wage system in 1865. Chattel slavery was too expensive. The wage system is cheaper. Now they never have to worry about food, or clothes, or houses, or the children, or the aged and infirm among wage slaves. \\n\\n \\n\\n “Once the master hunted the slave,—now the slave must hunt the master, beg for the privilege of serving him and trample others to death trying to fasten the chains on when a brother slave drops dead in his tracks. \\n\\n \\n\\n “No, I don’t shed any crocodile tears over the Negro slavery of the South. It was a mild form of servitude, in which the Negro had plenty to eat and wear, never suffered from cold, slept soundly and reared his children in droves with never a thought for the morrow. \\n\\n \\n\\n “Then mothers and babes were sometimes, though not often, separated by an executor’s or sheriff’s sale. Now, we know better than to allow babes to be born. Then, a babe was a valuable asset and received the utmost care. Now, we have baby farms which we fertilise with their bones. I know of one old hag in this city who has killed over two thousand babes. \\n\\n \\n\\n “What chance has your girl or mine to marry and build a home? Not one in a hundred will ever feel the breath of a babe at her breast. \\n\\n \\n\\n “No!” he closed in thunder tones. “I ’ll fight the encroachment of the Negro on our life with every power of body and soul!” \\n\\n \\n\\n A hundred men leaped to their feet at once, shouting and gesticulating. The chairman recognised a tall dark man with a Russian face, but who spoke perfect English. \\n\\n \\n\\n “I, gentlemen, am an anarchist in principle, and differ slightly in the process by which I come to the same conclusion as my friend who has taken his seat. I grieve at the necessity before the workingmen of returning to slavery. All we can hope now for a century or two centuries, is socialism. Socialism is simply a system of slavery—that is, enforced labour in which a Bureaucracy is master. We must enter again a condition of involuntary servitude for the guarantee by the State of food and clothes, shelter and children. \\n\\n \\n\\n “It is no time to weep over slavery. The one thing we demand now is the nationalisation of industries under the control of State Bureaux which will enforce labour from every citizen according to his capacity, for the simple guarantee of what the negro slave received, the satisfaction of the two elemental passions, hunger and love.” \\n\\n \\n\\n Again a clamour broke out that drowned the speaker’s voice. A Socialist and an Anarchist clinched in a fight, and for five minutes pandemonium reigned, but at the end of it Harris was tying on the sidewalk with a gash in his head, and Halliday was bending over him. \\n\\n \\n\\n When Harris had recovered from his wound, Halliday took him on a round of visits to big mills in a populous manufacturing city across in New Jersey. \\n\\n \\n\\n “These mills are all owned by Simon Legree,” he informed Harris, “and the unions have been crushed out of them by methods of which he is past master. I don’t know, but it may be possible to get you in there.” \\n\\n \\n\\n They tried a half dozen mills in vain, and at last they met a foreman who knew Halliday who consented to hear his plea. \\n\\n \\n\\n “You are fooling away your time and this man’s time, Halliday,” he told him in a friendly way. “I’d cut my right arm off sooner than take a negro in these mills and precipitate a strike.” \\n\\n \\n\\n “But would a strike occur with no union organisation?” \\n\\n \\n\\n “Yes, in a minute. You know Simon Legree who owns these mills. If a disturbance occurred here now the old devil wouldn’t hesitate to close every mill next day and beggar fifty thousand people.” \\n\\n \\n\\n “Why would he do such a stupid thing?” \\n\\n \\n\\n “Just to show the brute power of his fifty millions of dollars over the human body. The awful power in that brute’s hands, represented in that money, is something appalling. Before the war he cracked a blacksnake whip over the backs of a handful of negroes. Now look at him, in his black silk hat and faultless dress. With his millions he can commit any and every crime from theft to murder with impunity. His power is greater than a monarch. He controls fleets of ships, mines and mills, and has under his employ many thousands of men. Their families and associates make a vast population. He buys Judges, Juries, Legislatures, and Governors and with one stroke of his pen to-day can beggar thousands of people. He can equip an army of hirelings, make peace or war on his own account, or force the governments to do it for him. He has neither faith in God, nor fear of the devil. He regards all men as his enemies and all women his game. \\n\\n \\n\\n “They say he used to haunt the New Orleans’ slave market, when he was young and owned his Red River farm, occasionally spending his last dollar to buy a handsome negro girl who took his fancy. \\n\\n \\n\\n “Look at him now with his bloated face, beastly jaw, and coarse lips. He walks the streets with his lecherous eyes twinkling like a snake’s and saliva trickling from the corners of his mouth practically monarch of all he surveys. He selects his victims at his own sweet will, and with his army of hirelings to do his bidding, backed by his millions, he lives a charmed life in a round of daily crime. \\n\\n \\n\\n “How many lives he has blasted among the population of the multitude of souls dependent on him for bread, God only knows. It is said he has murdered the souls of many innocent girls in these mills—” \\n\\n \\n\\n “Surely that is an exaggeration,” broke in Halliday. \\n\\n \\n\\n “On the other hand I believe the picture is far too mild. I tell you no human mind can conceive the awful brute power over the human body his millions hold under our present conditions of life.” \\n\\n \\n\\n There was a tinge of deep personal bitterness in the man’s words that held Halliday in a spell while he continued, “Under our present conditions men and women must fight one another like beasts for food and shelter. The wildest dreams of lust and cruelty under the old system of Southern slavery would be laughed at by this modern master.” \\n\\n \\n\\n He paused a moment in painful reverie. \\n\\n \\n\\n “There lies his big yacht in the harbour now. She is just in from a cruise in the Orient. She cost half a million dollars, and carries a crew of fifty men. With them are beautiful girls hired at fancy wages connected with the stewardess’ department. She ships a new crew every trip. Not one of those young faces is ever lifted again among their friends.” \\n\\n \\n\\n He paused again and a tear coursed down his face. \\n\\n \\n\\n “I confess I am bitter. I loved one of those girls once when I was younger. She was a mere child of seventeen.” His voice broke. “Yes, she came back shattered in health and ruined. I am supporting her now at a quiet country place. She is dying. \\n\\n \\n\\n “Think of the farce of it all!” he continued passionately. \\n\\n \\n\\n “The picture of that brute with a whip in his hand beating a negro caused the most terrible war in the history of the world. Three millions of men flew at each other’s throats and for four years fought like demons. A million men and six billions of dollars worth of property were destroyed. \\n\\n \\n\\n “He was a poor harmless fool there beating his own faithful slave to death. Compare that Legree with the one of to-day, and you compare a mere stupid man with a prince of hell. But does this fiend excite the wrath of the righteous? Far from it. His very name is whispered in admiring awe by millions. He boasts that dozens of proud mothers strip their daughters to the limit the police law will allow at every social function he honours with his presence, and offer to sell him their own flesh and blood for the paltry consideration of a life interest in one-third of his estate! And he laughs at them all. His name is magic! \\n\\n \\n\\n “I know of one weak fool, a petty millionaire, whom Legree lured into a speculative trap and ruined. On his knees in his Fifth Avenue palace the whining coward kissed Legree’s feet and begged for mercy. He kicked him and sneered at his misery. At last when he had tortured him to the verge of madness he offered to spare him on one condition—that he should give him his daughter as a ransom. And he did it. \\n\\n \\n\\n “No, the brute power of such a man to-day is beyond the grasp of the human mind. His chances for debauchery and cruelty are limitless. The brain of his hirelings is put to the test to invent new crime against nature to interest his appetites. The only limit to his power of evil is the capacity of the human mind to think, and his body to act and endure. When he is exhausted, he can command the knowledge and the skill of ages and the masters of all Science to restore his strength, while satellites lick his feet and sing his praises— \\n\\n \\n\\n “Risk the whim of such a man with the lives of these poor people dependent on me? No, I’d sooner kill that negro you have brought here and take my chances of detection.” \\n\\n \\n\\n Halliday gave up the task, returned to New York, and sought the aid of the greatest labour leader in America, who had arrived in the city from the West the day before. \\n\\n \\n\\n “No, Halliday,” he said emphatically. “Send your negro back down South. We don’t want any more of them, or to come in contact with them. I have just come from the West where a desperate strike was in progress in one of Legree’s mines. Our men were toiling in the depth of the earth in midnight darkness, never seeing the light of day, for just enough to keep body and soul together. They tried to wring one little concession from their absent master, who had never condescended to honour them with his presence. What did he do? Shut down his mines, and brought up from the South a herd of negroes who came crowding to the mines to push our men back into hell. We begged them to go home and let us alone. They grinned, shuffled and looked at their white driver for the signal to go to work. I ordered the men to shoot them down like dogs. We made the Governor issue a proclamation driving them back South and warning their race that if they attempted to enter the borders of the state he would meet them with Gatling guns. \\n\\n \\n\\n “No, send your friend South. The winters up here are too cold for him and the summers too hot.” \\n\\n \\n\\n In the meantime Harris walked the streets with a storm of furious passion raging in his soul. The realisation of the shame and the horror of his position! He was the son of Eliza Harris who had fled from the kindliest form of slavery in Kentucky. He had a trained mind, and the brightest gifts of musical genius. Yet he stood that day at the door of Simon Legree and begged in vain for the privilege of serving in the meanest capacity as his slave! What a strange circle of time, those forty years of the past! \\n\\n \\n\\n And then the tempter whispered the right word at the right moment, and his fate was sealed. \\n\\n \\n\\n “There’s but one thing left. I will do it!” he exclaimed. \\n\\n \\n\\n He entered the employ of a gambling joint and deliberately began a life of crime. After a month he won five hundred dollars, and went on a strange journey, visiting the scenes in Colorado, Kansas, Indiana and Ohio where negroes had recently been burned alive. He would find the ash-heap, and place on it a wreath of costly flowers. He lingered thoughtfully over the ash-piles he found in Kansas made from the flesh of living negroes. He tried to imagine the figure of John Brown marching by his side, but instead he felt the grip of Simon Legree’s hand on his throat, living, militant, omnipotent. His soul had conquered the world. Yet even Legree had never dared to burn a negro to death in the old days of slavery. \\n\\n \\n\\n He found one of these ash-heaps at the foot of the monument in Indiana to the great Western colleague of Thaddeus Stevens, and with a sigh placed his wreath on it, and passed on into Ohio. \\n\\n \\n\\n He went to the spot where his mother had climbed up the banks of the Ohio River into the promised land of liberty, and followed the track of the old Underground Railroad for fugitive slaves a few miles. He came to a village which was once a station of this system. Here strangest of all, he found one of these ash-heaps in the public square. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1804/52428.html","bookId":1050,"book":{"id":1050,"title":"The Leopard\u0027s Spots","description":"简介： In answer to hundreds of letters, I wish to say that all the incidents used in Book I., which is properly the prologue of my story, were selected from authentic records, or came within my personal knowledge....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1804","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
