{"id":26104,"no":58,"title":"CHAPTER XI—THE HEART OF A WOMAN","content":"A WEEK after Gaston’s imprisonment Sallie Worth arrived in New York from her last trip abroad. She had cut her trip short and cabled her father of her return. She was in an agony of suspense and uncertainty about her lover. Gaston’s letters had failed to reach her for a month by reason of the war which had demoralised the mail service. Her own letters had failed to reach Gaston for a similar reason. The General hastened to New York to meet his wife and daughter and persuade Sallie to remain in the North until December. He was hopeful now that her long absence and Gaston’s absorption in politics, his bitter opposition to him personally, and the cloud under which he rested in prison, would be the final forces that would give him the victory in the long conflict he had waged for the mastery of his daughter’s heart. Before informing Sallie of the stirring events at Independence and the part Gaston had taken in them, or allowing her to learn of his imprisonment, the General sought to find the exact state of her mind. “I trust, Sallie,” he began, “you are recovering from your infatuation for this man. You know how dearly I love you. I have never taken a step in life since I looked into your baby face that wasn’t for you and your happiness.” She only looked at him wistfully and her eyes seemed to be dreaming, “I want you to have some pride. Gaston has attempted to kick me out of the councils of the party, and become the dictator of the state. His course is one of violence and radicalism. I regard him as a dangerous man, and I want you to have nothing to do with him.” She was gravely silent. “Do you believe he has been faithfully dreaming of you in your absence?” asked the General. “Yes, I do!” “Then let me disabuse your mind. It is not the way of strong men. He is absolutely absorbed in a desperate political struggle in which his personal ambition’s are first. I have seen him paying the most devoted attentions to the daughter of our rival down east, whose influence he wants, and it is rumoured among his friends that he has proposed to her.” “Who told you that?” she asked impetuously. “I had it first from Allan, but I’ve heard it since from others.” “I do not believe a word of it,” she declared. “That’s because you’re a woman and hold such silly ideals. I tell you, he wants you only because he knows you are rich, and he wishes to brow-beat me. Such a man will try to whip you before you have been his wife five years. I know that kind of man. Why can’t you trust my judgment?” “I had rather trust my heart’s intuitions, Papa, I can not be deceived in such a question.” “Well, you are being deceived. He is anything but a languishing lover. At present he is a political tiger at bay. Unless you hold him to you by some pledge he has given, he will forget you, and marry another in two years. I am a man and I know men. I thought I was desperately in love twice before I met your mother. I got over both attacks without a scratch, fell in love with her, married and have lived happily ever since. You have overestimated your own importance to him and your influence over him.” A great fear awed her into silence. For the first time in all her struggle with her father the sense suddenly came into her heart of her dependence on Gaston’s love for the very desire to live, and for the first time she realised the possibility of losing him. What if he should press his great ambitions to successful issue while she stood irresolute and tortured him with her indecision? If he could win the world’s applause without her, might he not, when successful, cease to need her? Her breast heaved with the tumult of uncertainty. What if another woman saw and loved him, and drew near to him in his hours of soul loneliness and struggle, and he had learned to see her face with joy! The conviction came crushing upon her that she had not responded bravely to this powerful man’s singular devotion into which he had poured without reserve his deepest passion. Had he weighed her and found her wanting in some dark hour in her absence? Her heart was in her throat at the thought! The General watched her keenly for several moments, and thought at last he had broken the spell. He believed he could now tell her of the cloud that hung over Gaston. “I said, Sallie, that I believed Gaston a dangerous man. I did not speak lightly. We have had terrible riots in Independence while you were absent in which Gaston was the leader of an armed revolution which overturned the city and county government. Two thousand men were under arms for a week and several were killed and wounded on both sides. The results were good as a whole, I confess. We have a decent government and we have security of property and life, but such methods will lead to civil war.” Her face grew tense, and she looked at her father with breathless interest during this recital. “Was he in danger in those riots?” she slowly asked. “Yes, and I expect him to be killed at an early day if he continues his present methods. A mob of five hundred negroes attempted to kill him. This was one of the causes that led to the Revolution.” She was on her feet now pale and trembling with excitement. “Where is he?” she gasped. “Now, my dear, it’s useless to get excited. The trouble is all over and a new Mayor and police force are in charge of the city. But he is resting under a serious cloud at present. He is held in jail at Asheville on a charge of felony, and a charge of murder is being pressed.” “In jail! in jail!” she cried incredulously while her eyes filled with tears. “Yes, and Allan believes these ugly charges will be proved in the United States court, and he will be convicted.” She did not seem to hear the last sentence. “In jail!” she repeated, “my lover, to whom I have given my life, and you, my father, while I was three thousand miles away stood by and did not lift a hand to help him?” “Has he not been my bitterest enemy, seeking to insult me!” thundered the General. “No, he never insulted you, or spoke one unkind word about you in his life. Oh! this is shameful! God forgive me that I was not here!” Tears were streaming down her face. “You hold me responsible for the crazy young scamp’s career?” cried the General indignantly. “Not another word to me!” she exclaimed. “You shall not abuse him in my presence.” The General was afraid of her when she used the tone of voice in which she uttered that sentence. He had heard it but once before, and that was when she told him she was a free woman twenty-one years old, and he had broken down. He looked at her now, fearing to speak. At length he said, “I have engaged a suite of rooms for you here at the Waldorf-Astoria, my dear, for the winter. I hope you will enjoy the season. Let us change this painful subject.” “I do not want the rooms,” she firmly replied, “I am going to Asheville on the first train.” The General stormed and raged for an hour, but she made no reply. Her mother was suffering from the effects of the voyage and took no part in this storm. “But your mother will not be able to accompany you. Surely you will not disgrace me by visiting that man in jail!” “I will. And when he is released I will return. I will visit Stella Holt. I shall have ample protection.” The General was afraid to oppose her in this dangerous mood, and begged her mother to try to prevent her going. Sallie sent Gaston a telegram that she was coming. In obedience to the General’s request her mother called her into her room that night and they had a long talk and cry in each other’s arms. Mrs. Worth did not try very hard to persuade her not to go. Down in her own woman’s soul she knew what she would do under similar conditions, and she was too honest with her child to try to deceive her. She only made love to her mother-fashion. “Oh! Mama,” cried Sallie, burying her face beside her mother as she lay in bed. “I am at a great soul crisis. I don’t know what to do. I feel lonely, helpless and heart-sick. You are a woman. Put your dear arms about me and help me to know the truth and my duty. I want to ask you a question.” “What is it, darling? I ’ll answer it, if I can,” she replied stroking her dark hair tenderly. “Do you believe these stories about Charlie’s character?” “Not one word of them!” she promptly answered. An impulsive kiss and a sob! “Dear Mother!” she said in a low tearful voice. “And now one more. Papa has been dinning into my ears his own fickleness in love when young and the fact that he knows in a long life that love is of little importance in a man’s existence. He says that I can forget and love again with equal intensity and bet’ter judgment. Can one treat thus lightly the soul’s deepest instincts and still find life rich and worthy of effort?” Her voice broke and she continued slowly and tremblingly, as she held one of her mother’s hands tightly, “Now, Mama dear, heart to heart, tell me as you would talk in your inmost soul to God, do you believe this is true? You have sounded life’s deep meaning Is this all you know of life? You love me. Tell me truly?” “No, darling, a woman can not deny this deep yearning of her soul and live. I would tear my tongue out sooner than deceive you in such an hour.” “Sweet Mother!” she softly murmured again as she kissed her good night.","sourceLink":"http://novel.tingroom.com/jingdian/1804/52431.html","bookId":1050,"book":{"id":1050,"title":"The Leopard\u0027s Spots","description":"简介： In answer to hundreds of letters, I wish to say that all the incidents used in Book I., which is properly the prologue of my story, were selected from authentic records, or came within my personal knowledge....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1804","creation":"Aug 1, 2019 12:24:16 AM","modification":"Aug 1, 2019 12:24:16 AM"}}
