{"id":98072,"no":21,"title":"Page 21","content":"When I reach the gates, Henry, our on-site security, stops me to ask if I need accompaniment on my outing.\\n\\n “I’m just going for a drive. I’ve got writer’s block,” I say. “Thought the drive would help clear my head.”\\n\\n No way in the world do I want security coming with me on this journey.\\n\\n “Sounds like a good idea,” he says with a smile.\\n\\n “I’ve got my phone with me in case anyone needs me.”\\n\\n “Okay. Enjoy your drive, Ms. Bennett.” Henry opens the gates, allowing me out.\\n\\n I’ve told him a million times to call me Tru. He still calls me Ms. Bennett every time.\\n\\n I turn out onto the street and start driving toward the exit of the gated community.\\n\\n I need to find a chemist (or drugstore, as they’re called over here), but one that’s not local. Too many people know we live around here.\\n\\n I start fiddling with the built-in satellite navigation, but unfortunately it doesn’t offer the feature “here’s your local chemist to buy pregnancy tests at.” I decide to drive until I spot one.\\n\\n I end up driving for forty-five minutes before I find a chemist that’s a decent distance from home.\\n\\n I’m in and out in a flash, thankfully unnoticed, thirty dollars lighter and three pregnancy tests heavier. One to find out. One to make sure. Another to make doubly sure.\\n\\n I drop the bag on the passenger seat, fire up the car, and tap the address in for home.\\n\\n For the whole drive, every time I catch a glimpse of the bag sitting on the seat beside me, it makes me want to throw up.\\n\\n Once I’m back in the safety of the house, I head straight for our en suite, clutching the bag to my chest like it’s a bomb about to go off.\\n\\n That’s probably quite an apt description, because if I am pregnant, I foresee explosions of the gigantic kind.\\n\\n Locking the bathroom door behind me, I drop the toilet lid and sit down.\\n\\n I pull a test from the bag.\\n\\n Swallowing back a huge lump of fear, I stare down at it.\\n\\n My future with Jake depends on what this will tell me.\\n\\n Oh God.\\n\\n Fear seeps into my bones like poison.\\n\\n Deep breaths. It’s going to be okay.\\n\\n With shaky fingers, I open the box. Briefing over the instructions, I tear the protective seal on the test and, thanking God that I need to pee right now, I do as it says and pee on the stick.\\n\\n I put the cap back on the test and place it on the top of the toilet.\\n\\n I wash my hands, then come back and kneel on the floor just in front of the toilet.\\n\\n I pick up the instructions to read again.\\n\\n Okay, so this is simple. Three minutes I have to wait and if I’m pregnant it will read: “Pregnant.”\\n\\n If I’m not: “Not Pregnant.”\\n\\n Easy, right?\\n\\n Well, no, not if I’m pregnant. It’ll be so far from easy, there won’t be a word that exists to cover it.\\n\\n How can my whole future ride on what the outcome of a tiny piece of plastic tells me?\\n\\n It feels like it should be more epic than this. Especially if I am pregnant. Something so wonderfully and terribly life-altering as this should have a bigger moment than sitting alone on my bathroom floor, waiting for a little piece of plastic to tell me my future.\\n\\n How am I going to tell Jake?\\n\\n I just can’t even begin to think how to broach the subject with him.\\n\\n I squeeze my eyes shut. Don’t think of that now. When you know, then think of it.\\n\\n How long has it been? Two minutes, I think. I should have brought my phone in with me to time it.\\n\\n Should I look now? It might be ready.\\n\\n I rise up on my knees to take a look, but fear sits me straight back down.\\n\\n I can’t do this.\\n\\n I drop my head in my hands.\\n\\n I’m just so fucking scared. I know I have to know, but I don’t want to know.\\n\\n No, come on, Tru. Woman up.\\n\\n Taking a few deep breaths, figuring it must be three minutes by now, I close my eyes as I slowly get to my feet.\\n\\n Okay, just open your eyes. Deep breath. One…two…three…\\n\\n I flick my eyes open.\\n\\n Pregnant\\n\\n Fuck.\\n\\n CHAPTER TEN\\n\\n I’m sitting by the pool on a lounger, lost in my painful thoughts, when I hear Jake’s voice. “I thought you’d be getting ready for dinner.”\\n\\n Instantly tensing, I turn to see him with his shoulder leant against the wall, watching me.\\n\\n He looks so beautiful. Achingly so. It makes my chest tighten and hurt so badly I feel like I can’t breathe. Like I’ll never be able to breathe right again.\\n\\n “Sorry, I lost track of time,” I murmur.\\n\\n “Staring out at LA?” He smiles, with a forward tilt of his head.\\n\\n “Something like that.” I get to my feet.\\n\\n “Hey, you okay?” he asks, eyeing me as I approach.\\n\\n No, I’m pregnant with our baby, Jake.\\n\\n “I’m fine,” I hear myself uttering.\\n\\n “You don’t look fine.” His eyes search mine. “You look…have you been crying?” he asks, straightening up. “Has something happened?”\\n\\n Yes. I’m pregnant.\\n\\n “No, I’m fine. I just saw one of those starving-children-in-Africa commercials, and it had me in tears by the end,” I say.\\n\\n His head turns toward the blank screen of the television.\\n\\n “You should donate to those charities,” I say, trying to distract his quickly working mind.\\n\\n “Already do.”\\n\\n How do I not already know this? Sometimes, I feel like I know everything and absolutely nothing about Jake.\\n\\n His eyes meet mine. He looks nervous. Shy. I love shy Jake.\\n\\n “You really are wonderful, you know.” I stroke my fingertips gently down his cheek. “You should let everyone see this amazing, caring side of you.”\\n\\n “Baby, this side of me is reserved for you only.”\\n\\n Overcome with love and fear, it’s quick to consume me. I can feel it spreading across my face, I wrap my arms around him, hugging him tight, pressing my face into his chest.\\n\\n Jake holds me equally as possessively, resting his cheek against my hair. “Are you sure you’re okay?” he murmurs.\\n\\n I nod, afraid to talk for fear of breaking down.\\n\\n “I hate to know you’ve been crying here alone. I hate to think of you crying, period. No more sad commercials for you, okay?”\\n\\n I swallow past the pain engulfing me. “No.” I shake my head gently.\\n\\n “I spoke with Smith today,” he says, caressing my back with his fingers.\\n\\n “And?” I lean back, looking into his face.\\n\\n Holding my gaze, I see something shift in his eyes, and then he smiles and says, “He’s in.”\\n\\n I know he’s happy. But he’s conflicted too. Feeling guilty because of Jonny.\\n\\n I want to soothe his guilt in this moment, but I’m afraid if I stay in his arms for a moment longer that I’ll crack. And right now, just before we have plans for dinner, is definitely not the right time to tell him. We need time to talk this through, not a quick, By the way, Jake, I’m pregnant. Let’s go to dinner.\\n\\n Later. I’ll tell him later.\\n\\n I release myself from his hold. “Guess I better go get ready for dinner.”\\n\\n As I’m about to leave, he catches my hand. “Tru, you would tell me if there was anything else bothering you, right?”\\n\\n “Of course,” I say, swallowing past the lie.\\n\\n I squeeze his hand, forcing a smile, then I walk into the living room, but I can feel Jake’s eyes on me the whole time.\\n\\n “What’re you having, baby?” Jake asks.\\n\\n Baby.\\n\\n I’m pregnant.\\n\\n Oh God.\\n\\n My worry and fear have grown exponentially as the night has progressed. Being alone earlier, knowing what I know, was hard enough. But being around Jake, holding the truth in, is killing me. I feel like I’m lying to him every second I don’t tell him I’m pregnant.\\n\\n I fear I’ll just blurt the words out any moment now. Focus is the key.\\n\\n I will tell Jake, I just need to find the right moment, and right now is not it.\\n\\n I glance up to see the waiter standing at our table. “Oh, um, I’ll have the mushroom ravioli, please.”\\n\\n “Would you like wine with dinner?” the waiter asks Jake.\\n\\n “Which wine, sweetheart?” Jake asks.\\n\\n Crap. I can’t drink. Not now that I’m having a baby.\\n\\n But I always have a drink with dinner when we eat out. He’ll know something is off if I say no.\\n\\n But then I think you are allowed a glass of wine every now and then when you’re pregnant, aren’t you?\\n\\n Afraid to say no, for tipping him off, I say, “Smith should choose. We are celebrating his acceptance into the band, after all. I’m really glad you’re an official part of TMS now.”\\n\\n “Me too.” Smith smiles. “As for the wine, anything with a high alcohol content works for me,” he says to Jake.\\n\\n “We’ll have a bottle of the Montrachet,” Jake orders.\\n\\n “Good choice.” The waiter takes the menus from our table and departs.\\n\\n “I love your dress,” Carly says to me over the table.\\n\\n “Thank you.” I’m wearing the Pucci print jersey dress I treated myself to on one of my shopping trips with Stuart. He picked it out for me. He has amazing taste. And I might as well get some wear out of it while I still have time.\\n\\n I’m pregnant. And I have to tell Jake.\\n\\n Fuck.\\n\\n “I love your dress too.” I force a smile.\\n\\n I actually do like her dress, I’m just forcing all my smiles tonight.\\n\\n Carly is wearing the Marc Jacobs Night Bird dress. I was eyeing it last week. It’s gorgeous. But Stuart talked me out of it. He said my boobs would have looked more stacked than the New York skyline.\\n\\n Looking at it on Carly, I know he was right. She’s a little lighter than me in the chest department, and it suits her just right.\\n\\n Oh God, don’t a woman’s boobs get bigger in pregnancy? Christ, they’re big enough as it is.\\n\\n I look over at Carly, with her lovely blonde hair, golden skin, and slim figure and remember how I always used to want to look like that growing up. I used to hate being the foreign-looking girl in a sea of blonde hair and blue eyes. Now I’m comfortable with myself mainly because of Jake. Because of how he looks at me. The way he adores me with his eyes.\\n\\n But not for much longer, because I’m going to get fat and bloated, and Jake won’t want me anymore.\\n\\n I’m going to lose him. He’s going to leave me for some thin, blonde goddess who doesn’t want to tie him down with kids.\\n\\n Panic grips a strong hold of me.\\n\\n “So you’re a writer, Tru?” Carly asks.\\n\\n “The best.” Jake smiles, putting his arm around the back of my chair, fingers resting lightly on my shoulder.\\n\\n I freeze under his touch. Thankfully he doesn’t seem to notice.\\n\\n Composing myself, I say, “I wouldn’t go that far, but yes, I write for a magazine. And I’m currently writing a book.”\\n\\n “That’s right, you’re writing the band’s bio from the tour. That must be kind of cool, writing about the guy you’re living with. I guess you just need to remember to leave out the bad habits, like leaving the toilet seat up or wet towels on the bed.” She raises an eyebrow in Smith’s direction.\\n\\n “I try to remember.” Smith raises his hands in defence. “I just slip up every now and then.” \\n\\n","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-21.html","bookId":1999,"book":{"id":1999,"title":"Wethering the Storm (The Storm #2)","description":"Storyline: Wethering the Storm (The Storm #2) \\n Music journalist Tru Bennett has done the impossible: capture the heart of rock-star bad boy Jake Wethers. Now they’re busy planning a wedding and navigating their new life together in the US. Of course Tru misses London and her best friend, Simone, but living happily ever after with Jake in LA is going to be great…right? \\n Wrong. Even the bright California sun can’t whitewash the dark side of celebrity coupledom. Greedy music execs, merciless paparazzi, and Jake’s wild past are lurking around every corner. Making matters worse, Jake announces he doesn’t want kids, which just may be a deal breaker. \\n Tru loves Jake more than anything. But when a devastating crisis threatens to destroy everything they’ve fought for, the couple must face the hard truth: What if, this time, love is not enough?\\n","cover":"https://allnovel.net/images/wethering-the-storm-the-storm-2.jpg","author":"Samantha Towle","type":"Romance","source":"allnovel","link":"https://allnovel.net/wethering-the-storm-the-storm-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:30:45 PM"}}
