{"id":98098,"no":47,"title":"Page 47","content":"“We’ll just have to make sure to take plenty of photos for him to look at when he’s older.” I lean over and kiss his cheek. “What was that for? Not that your old man is complaining about getting a kiss from his baby girl.” “Just to say thank you…for everything, Daddy.” He stares into my eyes for a long moment. “You don’t have to thank me for anything. You were the best kid a dad could ask for. Really, I’m the one who has everything to be thankful for, to have you standing here before me now.” A sob catches in his throat, and he presses his fist to his mouth. “Don’t you go crying on me.” I wrap my hand over his. “You’ll set me off, and Simone will go mental if I spoil my makeup.” He gives me a gentle nod and lowers his hand from his mouth. I wrap my arms around him, hugging him. “You know how much I love you?” he says into my hair. “I do, Daddy. And I love you the same right back.” He leans back from me, hands resting on my shoulders. “I always knew one day I’d be walking you down the aisle, and that Jake would be the one standing there waiting to marry you.” “You did?” I swallow past the tears creeping in. He nods. “The way he always looked at you, and you him…it was inevitable.” He smiles. “Come on.” He holds his arm out for me to take. “Time for me to give my girl away.” I slip my arm through, curling my fingers around him, holding on to the material of his jacket. We make our way out of the tent, and Simone is there waiting to take her place behind me. The dusk is creeping into night, but our walk is lit with lanterns. Simone straightens my dress out from behind. “Ready?” she asks. I glance back at her, and then to my dad. “For the last twenty-four years.” I smile. Dad puts his hand over mine on his arm, and we start the short walk to Jake. As we make our way through the trees, I hear “You Started” begin to lilt softly into the air. We step out of the trees into the clearing. I feel Jake’s eyes on me immediately, but I don’t look at him. I want to wait until I reach the start of the aisle, because I want a full, unrestricted view of him. This image of how he looks right now will be etched into my mind forever, and I want it to be perfect. Daddy walks me until we’re ready to begin our walk down the aisle. Then I lift my eyes to Jake. He looks as beautiful as I knew he would. He’s wearing a dark grey suit exactly like my dad’s, except that Jake’s tie is dark pink, just like the two roses in the middle of my bouquet. Then the world melts away, and there’s only him. There has only ever been him. With the way he’s looking at me right now, I can see in his beautiful eyes that he feels exactly the same. My dad gives my hand a gentle squeeze and starts to walk me up the aisle toward Jake, and I don’t for one moment take my eyes from his. “You look breathtaking,” Jake says when I reach him. “So do you.” I can’t take my eyes off him. I’m mesmerised. Jake moves his eyes from mine to my dad’s. “Thanks, Billy,” he says. I kiss my dad on the cheek before slipping my arm from his, and take Jake’s hand. Dad leans into Jake and says something into his ear. Jake looks him in the eye and nods. My dad pats him on the back, and then heads to my mum, who has a still-sleeping JJ in her arms. She smiles proudly at me and mouths, You look beautiful. I smile back and whisper, “So do you.” I look to Jake, and I’m about to ask what my dad just said to him, when the music quiets and the registrar begins to speak. “I welcome you all here today for the wedding of Jacob David Wethers and Trudy Consuela Bennett…” I listen as the registrar speaks, my eyes fixed to Jake’s, his to mine, neither of us wanting to look away from each other. “I believe Jake has something he wishes to say to Trudy before we do the official vows. The floor is all yours,” the registrar says with a smile to Jake. My face prickles, my cheeks colouring in anticipation of what he’s going to say. Jake clears his throat, running his finger into his shirt collar. He’s nervous. This man can stand up on a stage and sing his heart out in front of a hundred thousand people, but here, before me, he’s nervous. I love that. He steps closer to me. “Do you remember what I said that first night we moved into our house? What you asked me to say as my vows?” “Yes,” I whisper. “It still stands, Tru. It will always stand. My love for you is limitless, it knows no bounds. You’re in my veins. I bleed you. I belong to you…I always have and I always will.” He takes a deep breath. “You will always be my June, Tru.” My mind instantly goes back to that poignant moment Jake and I had, the one that defined us, the one that told me of the depth of Jake’s feelings for me, how he’d always seen me. “Reznor’s version or Johnny Cash’s?” I asked quietly, trying to conceal the pain from my voice. “Johnny Cash.” “Why?” He closed his eyes briefly. “Because I have a few things in common with him,” he answered, opening his eyes. “Like?” “The drugs…the women…hanging out for the girl of my dreams.” I took a sharp breath in. Tears instantly pricked the backs of my eyes. He touched my face, his thumb smoothing over my lips. “You’re my June, Tru.” With tears filling my eyes, I say to him for the first time, “And you’re my Johnny Cash, Jake.” Jake smiles widely, and then I can’t help myself. I throw my arms around his neck and kiss him deeply. In this moment, it’s just Jake and me. When we break away, breathless, I can see the fire in Jake’s eyes, and I know where his mind is at right now…because mine’s there too. “Okay,” the registrar says, clearing his throat. “Time to say your vows to each other. Jake, if you could present the rings.” Jake reaches inside his jacket and pulls out two wedding bands. The smaller one is platinum and encrusted with three pink diamonds to match my engagement ring. Jake’s is matching platinum, encrusted with three sapphires. Taking his ring from his hand, I ask, “Why sapphires?” He pushes his lips together. “Blue. It’s more manly than pink, baby.” He raises his brows, and I laugh. Then I watch, holding my breath, as Jake recites his vows, gently sliding the ring onto my finger, making me his wife. Then I do the same for him, my hand and voice trembling the whole time. “I now pronounce you husband and wife. You may kiss your bride—again.” We’re finally here. It’s taken us a long time, a lot of hard times and work, but we’ve made it. And it was worth every single moment. My heart is full of happiness as Jake takes my face in his hands and presses his lips to mine, giving me the most breath-stealing kiss he’s ever given me. My first kiss as his wife. “Finally mine, Mrs. Wethers,” he whispers over my lips. I stare straight into his blue eyes, the eyes I will spend the rest of my life staring into. “I’ve always been yours, Jake.” “Yes, you have.” He smiles, and kisses me again. EPILOGUE Adele starts to ring in my huge bag. I dig around for it. Bloody hell, I have way too much stuff in this bag. I pull some nappies and wipes out and set them on the table, then my makeup bag, one of JJ’s rattles, and a juice cup. I finally find my phone as Adele tells me she’s “Rolling in the Deep,” and I connect the call. “You took your time answering.” Jake’s voice comes down the line. “You’re calling me? You’re in the next suite, you lazy ass!” I laugh. “Stop giving me grief,” he says, chuckling. “I was just letting you know we’re ready to go down.” “We’ll be right there.” I put my phone on the table and slip my feet into my shoes. “Hey, gorgeous, come to Mama.” I put my arms out to JJ. He reaches up from his sitting position on the floor and I lift him into my arms. “Time to go get Uncle Stuart married,” I say, heading for the door. We’re in New York at the moment for Stuart and Josh’s wedding. It’s one of the few states in the US that performs same-sex marriages. Jake is Stuart’s best man, I’m bridesmaid, and JJ is page boy. Yep, that’s right, Stuart and Josh are getting married! Josh asked him the day after Jake’s and my wedding. It was so sweet. We were having breakfast together, when Josh got down on one knee in front of everyone and asked Stuart. Yes, I cried. So did every other woman at the table. All the men were manly, but I know they were touched, especially Jake. It was the perfect memory to christen our new house. Yes, you heard that right, our new house. After the wedding, Jake drove us to Littleborough, which is a fifteen-minute drive from Lumb Falls and a thirty-minute drive from Manchester. He’d bought us a house near Hollingworth Lake. When I say “house,” this is Jake we’re talking about. It’s a seven-bedroom country estate, secure with a gated entrance. It’s beautiful. We had our wedding reception there, which Jake and Stuart had already set up. The house was decorated, courtesy of Carly. It’s a beautiful second home for us. We spent a long wedding night making use of our big new bed, making up for the time the accident took away from us. Jake had told me that he’d been holding back from making love to me since I’d gotten out of the hospital as he’d wanted our wedding night to be special. And he bought the new house because he wanted us to have a home in the UK as well as LA, so we could all have the best of both worlds. Could I love that man anymore? He really is my version of perfect. My mum and dad moved in the new house. They live there permanently, and we go over regularly, but our base is still LA. We went on our honeymoon two days after the wedding. Once the press found out Jake and I had gotten married in secret, things got frenzied, as expected, so going away on our honeymoon was a good way to escape the craziness that is Jake’s life, and mine now. Our honeymoon was a long one—we were gone for four weeks, just Jake, JJ, and me. And, well, Dave and Ben, of course. We changed our original honeymoon plan to go back to Turtle Island, as we didn’t think the heat there and JJ would go well together, so we instead travelled to all the sights Jake and I had never seen, the ones he had waited to see with me. We will go back to Turtle Island one day in the near future, but in the meantime Stuart and Josh are going on their honeymoon there. They don’t know yet; it’s our wedding gift to them. Jake, JJ, and I went to Venice to see the canals and take a ride in a gondola. We went to Pisa to see the tower. Rome to see the Colosseum. Barcelona to see the Sagrada Familia. You name it, we visited it. It was the best trip of my life, and I will always remember it.","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-47.html","bookId":1999,"book":{"id":1999,"title":"Wethering the Storm (The Storm #2)","description":"Storyline: Wethering the Storm (The Storm #2) Music journalist Tru Bennett has done the impossible: capture the heart of rock-star bad boy Jake Wethers. Now they’re busy planning a wedding and navigating their new life together in the US. Of course Tru misses London and her best friend, Simone, but living happily ever after with Jake in LA is going to be great…right? Wrong. Even the bright California sun can’t whitewash the dark side of celebrity coupledom. Greedy music execs, merciless paparazzi, and Jake’s wild past are lurking around every corner. Making matters worse, Jake announces he doesn’t want kids, which just may be a deal breaker. Tru loves Jake more than anything. But when a devastating crisis threatens to destroy everything they’ve fought for, the couple must face the hard truth: What if, this time, love is not enough?","cover":"https://allnovel.net/images/wethering-the-storm-the-storm-2.jpg","author":"Samantha Towle","type":"Romance","source":"allnovel","link":"https://allnovel.net/wethering-the-storm-the-storm-2.html","creation":"Oct 5, 2019 8:58:13 AM","modification":"Oct 5, 2019 6:30:45 PM"}}
