{"id":2180,"no":65,"title":"Chapter 65","content":"\"Well, nobody needs a reason to visit. Let me make us some tea.\" Lady Jones was mixed. Grayeyes and yellow woolly hair, every strand of which she hated — though whether it was the color orthe texture even she didn\u0027t know. She had married the blackest man she could find, had fiverainbow-colored children and sent them all to Wilberforce, after teaching them all she knew rightalong with the others who sat in her parlor. Her light skin got her picked for a coloredgirls\u0027, normalschool in Pennsylvania and she paid it back by teaching the unpicked. The children who played indirt until they were old enough for chores, these she taught. The colored population of Cincinnatihad two graveyards and six churches, but since no school or hospital was obliged to serve them,they learned and died at home. She believed in her heart that, except for her husband, the wholeworld (including her children) despised her and her hair. She had been listening to \"all that yellowgone to waste\" and \"white nigger\" since she was a girl in a houseful of silt-black children, so shedisliked everybody a little bit because she believed they hated her hair as much as she did. Withthat education pat and firmly set, she dispensed with rancor, was indiscriminately polite, saving herreal affection for the unpicked children of Cincinnati, one of whom sat before her in a dress so loud it embarrassed the needlepoint chair seat.\\n\\n 　　\"Sugar?\"\"Yes. Thank you.\" Denver drank it all down.\\n\\n 　　\"More?\"\"No, ma\u0027am.\"\"Here. Go ahead.\"\"Yes, ma\u0027am.\"\"How\u0027s your family, honey?\"Denver stopped in the middle of a swallow. There was no way to tell her how her family was, so she said what was at the top of her mind.\\n\\n 　　\"I want work, Miss Lady.\"\"Work?\"\"Yes, ma\u0027am. Anything.\"Lady Jones smiled. \"What can you do?\"\"I can\u0027t do anything, but I would learn it for you if you have a little extra.\"\"Extra?\"\"Food. My ma\u0027am, she doesn\u0027t feel good.\"\"Oh, baby,\" said Mrs. Jones. \"Oh, baby.\"Denver looked up at her. She did not know it then, but it was the word \"baby,\" said softly and withsuch kindness, that inaugurated her life in the world as a woman. The trail she followed to get tothat sweet thorny place was made up of paper scraps containing the handwritten names of others.\\n\\n 　　Lady Jones gave her some rice, four eggs and some tea. Denver said she couldn\u0027t be away fromhome long because of her mother\u0027s condition. Could she do chores in the morning? Lady Jonestold her that no one, not herself, not anyone she knew, could pay anybody anything for work theydid themselves. \"But if you all need to eat until your mother is well, all you have to do is say so.\"She mentioned her church\u0027s committee invented so nobody had to go hungry. That agitated herguest who said, \"No, no,\" as though asking for help from strangers was worse than hunger. Lady Jones said goodbye to her and asked her to come back anytime. \"Anytime at all.\"Two days later Denver stood on the porch and noticed something lying on the tree stump at theedge of the yard. She went to look and found a sack of white beans. Another time a plate of coldrabbit meat. One morning a basket of eggs sat there. As she lifted it, a slip of paper fluttered down.\\n\\n 　　She picked it up and looked at it. \"M. Lucille Williams\" was written in big crooked letters. On theback was a blob of flour-water paste. So Denver paid a second visit to the world outside the porch,although all she said when she returned the basket was \"Thank you.\"\"Welcome,\" said M. Lucille Williams.\\n\\n 　　Every now and then, all through the spring, names appeared near or in gifts of food. Obviously forthe return of the pan or plate or basket; but also to let the girl know, if she cared to, who the donorwas, because some of the parcels were wrapped in paper, and though there was nothing to return,the name was nevertheless there. Many had X\u0027s with designs about them, and Lady Jones tried toidentify the plate or pan or the covering towel. When she could only guess, Denver followed herdirections and went to say thank you anywaym whether she had the right benefactor or not. Whenshe was wrong, when the person said, \"No, darling. That\u0027s not my bowl. Mine\u0027s got a blue ring onit,\" a small conversation took place. All of them knew her grandmother and some had even dancedwith her in the Clearing. Others remembered the days when 124 was a way station, the place theyassembled to catch news, taste oxtail soup, leave their children, cut out a skirt. One rememberedthe tonic mixed there that cured a relative. One showed her the border of a pillowslip, the stamensof its pale blue flowers French-knotted in Baby Suggs\u0027 kitchen by the light of an oil lamp whilearguing the Settlement Fee. They remembered the party with twelve turkeys and tubs of strawberrysmash. One said she wrapped Denver when she was a single day old and cut shoes to fit hermother\u0027s blasted feet. Maybe they were sorry for her. Or for Sethe. Maybe they were sorry for theyears of their own disdain. Maybe they were simply nice people who could hold meanness towardeach other for just so long and when trouble rode bareback among them, quickly, easily they didwhat they could to trip him up. In any case, the personal pride, the arrogant claim staked out at 124seemed to them to have run its course. They whispered, naturally, wondered, shook their heads.\\n\\n 　　Some even laughed outright at Denver\u0027s clothes of a hussy, but it didn\u0027t stop them caring whethershe ate and it didn\u0027t stop the pleasure they took in her soft \"Thank you.\"\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/shuangyu/678/3788.html","bookId":82,"book":{"id":82,"title":"Beloved 宠儿","description":"简介： 你的爱太浓了！一个不可能重复的故事！！！ 女黑奴塞丝怀着身孕只身从肯塔基的奴隶庄园逃到俄亥俄的辛辛那提，奴隶主循踪追至；为了使儿女不再重复自己做奴隶的悲惨命运，她毅...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/678","creation":"Aug 1, 2019 12:18:14 AM","modification":"Aug 1, 2019 12:18:14 AM"}}
