{"id":2183,"no":68,"title":"Chapter 68","content":"The news that Janey got hold of she spread among the other coloredwomen. Sethe\u0027s dead daughter,the one whose throat she cut, had come back to fix her. Sethe was worn down, speckled, dying,spinning, changing shapes and generally bedeviled. That this daughter beat her, tied her to the bedand pulled out all her hair. It took them days to get the story properly blown up and themselvesagitated and then to calm down and assess the situation. They fell into three groups: those thatbelieved the worst; those that believed none of it; and those, like Ella, who thought it through. 　　\"Ella. What\u0027s all this I\u0027m hearing about Sethe?\"\"Tell me it\u0027s in there with her. That\u0027s all I know.\"\"The daughter? The killed one?\"\"That\u0027s what they tell me.\"\"How they know that\u0027s her?\"\"It\u0027s sitting there. Sleeps, eats and raises hell. Whipping Sethe every day.\"\"I\u0027ll be. A baby?\"\"No. Grown. The age it would have been had it lived.\"\"You talking about flesh?\"\"I\u0027m talking about flesh.\"\"whipping her?\"\"Like she was batter.\"\"Guess she had it coming.\"\"Nobody got that coming.\"\"But, Ella — \"\"But nothing. What\u0027s fair ain\u0027t necessarily right.\"\"You can\u0027t just up and kill your children.\"\"No, and the children can\u0027t just up and kill the mama.\"It was Ella more than anyone who convinced the others that rescue was in order. She was apractical who believed there was root either to chew or avoid for every ailment. 　　Cogitation,assh(woman) ecalledit,cloudedthings(a) and prevented action. Nobody loved her and shewouldn\u0027t have liked it if they had, for she considered love a serious disability. Her puberty wasspent in a house where she was shared by father and son, whom she called \"the lowest yet.\" It was\"the lowest yet\" who gave her a disgust for sex and against whom she measured all atrocities. Akilling, a kidnap, a rape — whatever, she listened and nodded. Nothing compared to \"the lowestyet.\" She understood Sethe\u0027s rage in the shed twenty years ago, but not her reaction to it, whichElla thought was prideful, misdirected, and Sethe herself too complicated. When she got out of jailand made no gesture toward anybody, and lived as though she were alone, Ella junked her andwouldn\u0027t give her the time of day. 　　The daughter, however, appeared to have some sense after all. At least she had stepped out thedoor, asked or the help she needed and wanted work. When Ella heard 124 was occupied bysomething or-other beating up on Sethe, it infuriated her and gave her another opportunity tomeasure what could very well be the devil himself against \"the lowest yet.\" There was alsosomething very personal in her fury. Whatever Sethe had done, Ella didn\u0027t like the idea of pasterrors taking possession of the present. Sethe\u0027s crime was staggering and her pride outstrippedeven that; but she could not countenance the possibility of sin moving on in the house, unleashedand sassy. Daily life took as much as she had. The future was sunset; the past something to leavebehind. And if it didn\u0027t stay behind, well, you might have to stomp it out. Slave life; freed life —every day was a test and a trial. Nothing could be counted on in a world where even when youwere a solution you were a problem. \"Sufficient unto the day is the evil thereof,\" and nobodyneeded more; nobody needed a grown-up evil sitting at the table with a grudge. As long as theghost showed out from its ghostly place — shaking stuff, crying, smashing and such — Ellarespected it. But if it took flesh and came in her world, well, the shoe was on the other foot. Shedidn\u0027t mind a little communication between the two worlds, but this was an invasion. \"Shall wepray?\" asked the women. 　　\"Uh huh,\" said Ella. \"First. Then we got to get down to business.\" The day Denver was to spendher first night at the Bodwins\u0027, Mr. Bodwin had some business on the edge of the city and toldJaney he would pick the new girl up before supper. Denver sat on the porch steps with a bundle inher lap, her carnival dress sun-faded to a quieter rainbow. She was looking to the right, in thedirection Mr. Bodwin would be coming from. She did not the women approaching, accumulatingslowlyingroupsoftwosandthreesfromtheleft.Denv(see) er was looking to the right. 　　She was a little anxious about whether she would prove satisfactory to the Bodwins, and uneasytoo because she woke up crying from a dream about a running pair of shoes. The sadness of thedream she hadn\u0027t been able to shake, and the heat oppressed her as she went about the chores. Fartoo early she wrapped a nightdress and hairbrush into a bundle. Nervous, she fidgeted the knot and looked to the right. 　　Some brought what they could and what they believed would work. Stuffed in apron pockets,strung around their necks, lying in the space between their breasts. Others brought Christian faith— as shield and sword. Most brought a little of both. They had no idea what they would do oncethey got there. They just started out, walked down Bluestone Road and came together at theagreed-upon time. The heat kept a few women who promised to go at home. Others who believedthe story didn\u0027t want any part of the confrontation and wouldn\u0027t have come no matter what theweather. And there were those like Lady Jones who didn\u0027t believe the story and hated theignorance of those who did. So thirty women made up that company and walked slowly, slowlytoward 124. 　　It was three in the afternoon on a Friday so wet and hot Cincinnati\u0027s stench had traveled to thecountry: from the canal, from hanging meat and things rotting in jars; from small animals dead inthe fields, town sewers and factories. The stench, the heat, the moisture — - trust the devil to makehis presence known. Otherwise it looked almost like a regular workday. They could have beengoing to do the laundry at the orphanage or the insane asylum; corn shucking at the mill; or to deanfish, rinse offal, cradle whitebabies, sweep stores, scrape hog skin, press lard, case-pack sausage orhide in tavern kitchens so whitepeople didn\u0027t have to see them handle their food. But not today. 　　When they caught up with each other, all thirty, and arrived at 124, the first thing they saw was notDenver sitting on the steps, but themselves. Younger, stronger, even as little girls lying in the grassasleep. Catfish was popping grease in the pan and they saw themselves scoop German potato saladonto the plate. Cobbler oozing purple syrup colored their teeth. They sat on the porch, ran down tothe creek, teased the men, hoisted children on their hips or, if they were the children, straddled theankles of old men who held their little hands while giving them a horsey ride. Baby Suggs laughedand skipped among them, urging more. Mothers, dead now, moved their shoulders to mouth harps. 　　The fence they had leaned on and climbed over was gone. The stump of the butternut had split likea fan. But there they were, young and happy, playing in Baby Suggs\u0027 yard, not feeling the envy thatsurfaced the next day.","sourceLink":"http://novel.tingroom.com/shuangyu/678/3791.html","bookId":82,"book":{"id":82,"title":"Beloved 宠儿","description":"简介： 你的爱太浓了！一个不可能重复的故事！！！ 女黑奴塞丝怀着身孕只身从肯塔基的奴隶庄园逃到俄亥俄的辛辛那提，奴隶主循踪追至；为了使儿女不再重复自己做奴隶的悲惨命运，她毅...","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/678","creation":"Aug 1, 2019 12:18:14 AM","modification":"Aug 1, 2019 12:18:14 AM"}}
