{"id":102349,"no":11,"title":"Page 11","content":"“Don’t let it happen again.” “Then don’t keep me waiting again,” she returned. His shoulders relaxed. “Ah, I see the Cassie I recognize is back. Follow me. We have business to discuss.” He walked into his office, Cassie close behind him. Without waiting for an invitation, she took the visitor’s chair across from his desk. She leaned back, legs crossed, trying to appear confident. Looking stiff and formal once more, Simon sat down. “I asked to see you because I have the information concerning your agreement to work as Santa’s helper.” She nodded. “Okay, but you could’ve phoned—unless you have my outfit.” “Outfit?” “For my elf job.” Simon shook his head, and for the first time since she’d arrived, he seemed edgy. “There’s been a small change in plans.” “Change? What do you mean?” “The mall has experienced a decline in the number of parents bringing their children to meet Santa.” “Does this mean Santa won’t be requiring my help, after all?” She did her best to keep her enthusiasm to a minimum. She wouldn’t mind getting out of this; she liked children—in fact, she loved them—but if her tasks were limited to two instead of three, she’d be done that much sooner. Then Simon could introduce her to John. Despite herself, she felt a twinge of regret at the idea of never seeing Simon again. But once he’d made the official introduction, his role would be over, his job done. She realized she’d miss his acerbic responses…. Simon frowned at her. “What are you thinking?” he asked. Cassie answered a bit more sharply than she’d intended. “I’m sure you’re not interested in my thoughts.” Again his brows shot toward his hairline. “I wonder how long it will take you to learn that I do not ask questions unless I am interested in the answer.” Cassie threw back her head. “All right, fine. I was just thinking that you’re a very odd man. I find I’m rather…intrigued by you. Not in any romantic way, of course.” “Of course,” he said dryly. “I can’t tell you what a relief that is.” “It’s more like…driving past a car wreck. Horrible though it is, you can’t stop yourself from looking.” His frown deepened. “I can assure you my life is no wreck—nor is my car.” “Yes, well, I’m sure there’s nothing wrong with your car.” Ignoring her comment and its implication, Simon picked up a piece of paper. “As I was saying, I heard from the Tacoma Mall regarding your assignment. There’s been a slight change.” “Is this because of what you said earlier—that there’s a decline in the number of children visiting Santa?” “Yes. But here’s what—” “Oh, wait, I have a question,” Cassie broke in. Simon looked up at the ceiling as though his patience, which was always in short supply, had been sorely tested yet again. “No.” “That’s rather dictatorial,” she said. “How could a question hurt?” “If you’d let me get a word in edgewise…I’m trying to give you some important information.” “About helping Santa?” Simon acted as if she’d have to smuggle top secret papers to the north pole. “This relates directly to your assignment,” he said, avoiding eye contact. “I need to know if you’re afraid of heights.” How could that possibly pertain to her working as an elf? “Not really. Why?” Simon paused. “Maybe you should ask me your question, after all, before I explain.” “I’d rather hear what you have to say first.” He sighed loudly. “I talked to the mall and—” “Yes, yes, we’ve been through this.” “I did mention that a uniform—a costume—is required.” “Yes.” His reluctance to get to the point was beginning to concern her. “I wasn’t aware anything like this would be asked of you, but I’m encouraged that you don’t have any fear of heights.” “I don’t have to swing from the top of the Space Needle, do I?” “No…” He exhaled slowly, staring down at his desk. “The mall wants the first elf—that would be you—to arrive by wire.” Cassie swallowed hard. “You’re not referring to a telegram, are you?” “No.” “A wire…from where?” Again he avoided meeting her gaze. “The ceiling.” Cassie frowned, attempting to picture it. “You mean they want me to fly in like Peter Pan?” “Exactly.” “You’re joking!” This was the most preposterous idea she’d ever heard. “The reindeer will follow you.” “Live reindeer?” “They’re plastic, but the mall wants to make a real production of Santa’s arrival.” “And,” she said, swallowing again since her mouth was so dry, “I’m part of the production.” “Yes. Are you willing to do this?” he asked. Cassie’s fingers tightened around her purse strap. “Would I still meet John if I decline?” Simon hesitated. “This wasn’t part of our original agreement, so I’d need to find a replacement task. That might take a few weeks.” “I don’t want to wait any longer than I already have to.” “Then I’ll inform the mall there won’t be a problem and they can expect you on Saturday morning around nine.” Her complete lack of reaction must have alerted Simon to the fact that she was having second thoughts. “No need to worry,” Simon assured her. “I’ve been told it’s quite safe. The wire will hold up to four hundred pounds.” “Oh.” Cassie couldn’t believe she’d agreed to this. When she glanced up, she thought, just for a moment, that she saw a smile on Simon’s face. She leaned forward. “Were you smiling?” “Pardon me?” “You were smiling, weren’t you? You’re enjoying this.” The man should be arrested for deriving pleasure from her humiliation. His mouth quivered, but Simon had the good grace to look away. “Actually, I was thinking you’re going to manage this quite well. You’re a woman who’s destined for high places.” Unfortunately, his vote of confidence didn’t excite her. And his joke didn’t amuse her. Chapter 9 Simon says: The best match for you is the one I arrange—because I know you better than you know yourself. “T his must be a joke,” Cassie said, staring at the limp green tights. No way was she going to stuff her hips and thighs into those. “Dr. Dodson gave us your size, miss,” said an elderly woman, whose name tag identified her as Daisy. “He did?” Well, if he assumed she wore a size four, then who was she to enlighten him with the truth? Besides, the material did stretch. Daisy handed her the elf costume, which consisted of a short green dress, like a skater’s, with white faux fur edging the hem and a wide red belt. A green Santa-style hat with a white fur ball dangling from the end completed the outfit. But the pièce de résistance was a gold-painted pair of slippers with curled-up toes. “The changing room is this way,” Daisy said as she guided her down the dimly lit mall corridor. Cassie followed, clutching the uniform, the hat and shoes. “I can’t tell you how pleased we are that you agreed to do this,” Daisy was telling her. “You already have an audience of children waiting.” This wasn’t news Cassie wanted to hear. “Where will Santa be while I’m floating through the air?” “Oh, he’ll be right behind you.” “Great.” So she wouldn’t be doing a solo flight. If she was going to descend from the clouds, Santa should do the same. “Only…Santa will be on ground level,” Daisy explained. This was unfair. The woman stopped and, frowning, bent down to pick up an empty beer can. “Oh, dear,” she grumbled. “I’m afraid Floyd’s been at it again.” “And who is Floyd?” Cassie asked a bit fearfully. Daisy’s voice was a low whisper. “He’s Santa.” Was she saying Santa was a drunk? Outrageous! “Santa?” Cassie cried. “Don’t misunderstand me,” Daisy hurried to say. “Floyd’s a wonderful Santa and the kids love him. The problem is, the children can be a bit wearing…as you’ll discover for yourself in a few minutes.” Daisy led her through a dark tunnel to some kind of alleyway deep inside the mall. “There’s a ladies’ room back here where you can change into your costume. I’ll wait outside and once you’re done, I’ll have one of the technicians help you into the harness.” Cassie gaped at her. “We want you to be as safe as possible,” Daisy said in a confiding voice. “The wire will lower you from the top level of the mall to the ground floor.” “Oh.” Cassie couldn’t recall if the mall was two or three levels. One thing was guaranteed—she’d have her eyes closed the entire flight. As if reading her mind, Daisy added, “You have to play this up, you know.” “Play this up?” Cassie asked skeptically. “What do you mean?” “To the crowd. We want you to yell out that Santa’s on his way and all the boys and girls will be getting a gift from him.” “We’re giving them gifts?” “Candy canes. The children look forward to receiving those.” A cheap candy cane was a gift? That seemed to be an exaggeration—but who was Cassie to quibble over truth in advertising? They finally got to the ladies’ room and Cassie went inside. She removed her shoes and then her jeans and sweater. She hung what she could on the hook of the stall door, then sat on the toilet in order to slip on the tights. Force them on was more accurate. The fit was so tight, they felt like an extra skin. Unfortunately they didn’t reach all the way to her waist. One wrong move, and Cassie feared they’d roll down and reveal features—like her butt—that she’d rather keep private. It helped a little to jump up and down and then prance around, pulling on the waistband as she did. She also did a couple of squats. Still, the tights didn’t stretch quite as far as she would’ve liked. “Is everything all right in there, dear?” Daisy asked. “Just fine,” Cassie told her. Thankfully, the minidress fit. The shoes were good, too. She adjusted the hat in the bathroom mirror and realized she’d need to secure it for the flight. Digging around the bottom of her purse, she located two paper clips, which worked—sort of. How long those paper clips had been there and where they’d come from would forever remain a mystery. Cassie could only be grateful for their presence.","sourceLink":"https://allnovel.net/the-perfect-christmas/page-11.html","bookId":2633,"book":{"id":2633,"title":"The Perfect Christmas","description":"Storyline: WHAT WOULD MAKE YOUR CHRISTMAS PERFECT? For Cassie Beaumont, it\u0027s meeting her perfect match. Cassie, at thirty-three, wants a husband and kids, and so far, nothing\u0027s worked. Not blind dates, not the Internet and certainly not leaving love to chance. What\u0027s left? A professional matchmaker. He\u0027s Simon Dodson, and he\u0027s very choosy about the clients he takes on. Cassie finds Simon a difficult, acerbic know-it-all, and she\u0027s astonished when he accepts her as a client. Claiming he has her perfect mate in mind, Simon assigns her three tasks to complete before she meets him. Three tasks that are all about Christmas: being a charity bell ringer, dressing up as Santa\u0027s elf at a children\u0027s party and preparing a traditional turkey dinner for her neighbors (whom she happens to dislike). Despite a number of comical mishaps, Cassie does it all --- and she\u0027s finally ready to meet her match.","cover":"https://allnovel.net/images/the-perfect-christmas.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/the-perfect-christmas.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:15:44 PM"}}
