{"id":84748,"no":23,"title":"Page 23","content":"\\n\\n He steps back and lets me out. I glance up at him. \"What are you doing here?\"\\n\\n He points, \"I wanted to see her.\" His eyes are different now. They avoid me.\\n\\n \"Did you know I was here?\"\\n\\n I can see the answer in his face. \"No. I expected you to still be in session. I was going to wait in the other offices.\" I feel my face pinch, thinking about the other offices. The ones with the cells and the kitchen sink. The intense role-playing therapy offices. He sees my reaction and fakes a warm smile, \"How have you been?\"\\n\\n I look up at him, even though he avoids my eyes. \"Since you messaged me this morning and told me to stop being a pain in the ass? Good.\"\\n\\n He laughs and runs his hands through his dark hair. I want to touch it. I want to touch him. My insides are burning with conflict.\\n\\n The doors have closed, so he leans past me and pushes the button. The proximity and the warmth of him heat my face up. \"I need you.\" I whisper into his arm, I don’t even know why.\\n\\n He steps back. I see his answer. Anxiety builds inside of me. I brush past him and walk out into the frosty January air. I grip my coat and walk to the car. Stuart waves at me.\\n\\n I take a relaxing inhale and let go of the rejection. Eli is a head case too. He\u0027s the male version of me.\\n\\n Stuart opens the door and I catch a glint of something in his eye. \"Wipe the smug look off that face.\" I say as I climb in.\\n\\n He chuckles and climbs in. The car is started and warm. \"I still cannot believe that shit worked. Look at you, touching doors and shit. You were the toughest nut to crack girl.\"\\n\\n I snort. I look out the window.\\n\\n \"You know you\u0027re a different girl right? Sarah, you look different, you talk different, you walk different. No more orphan Annie.\" I meet his dark eyes in the rearview. I see myself differently in his eyes. He nods, \"It was worth it. It might not feel like it today or next month, but it was.\"\\n\\n I pull out my cell phone and notice the messages I\u0027ve missed. I still have to have it on at all times. I still have to answer his messages. His rules are still in place but I obey them now for a different reason.\\n\\n \u0027I need to see you this evening. I need to talk to you.\u0027 I shudder. The last time he sent a message like that, I ended up in a cell. I don’t get how he can talk to me on text but not to my face. I wonder if it\u0027s the same as me and Sebastian separated by the bathroom door.\\n\\n I think about myself fantasizing about him the way I do Sebastian and shake my head. I should have called the cops. Shell was right. I should have called them.\\n\\n The realization brings back a thought. I glance up and look at Stuart in the mirror, \"She comes back today. You excited?\" I ask.\\n\\n \"No. I know she is gonna kick my ass for taking part in it all.\"\\n\\n I laugh in agreement, \"Yeah. She is. She still thinks I should call the cops. She\u0027s pissed and I haven’t even told her anything yet.\"\\n\\n His eyes flinch, \"I know.\"\\n\\n I smile, \"I believed you were hurt. She is going to hate that fact. That you tricked me.\"\\n\\n \"I know.\"\\n\\n I shake my head, \"I still can\u0027t believe you tricked me.\"\\n\\n He puffs up his chest and misses the heartache in my eyes and the point I am making. \"Three years of theatre.\" He looks proud of himself.\\n\\n I shake my head, \"Are you even from Wichita?\"\\n\\n He shakes his head, \"Nope. Detroit. Dr. Bradley said I should be from a southern state because studies show women feel safer with men with southern accents. They\u0027re more calming.\" He drops the Kansas accent.\\n\\n I feel sick. \"Is your name even Stuart?\"\\n\\n He laughs, \"Yeah.\"\\n\\n \"How did you get into this?\"\\n\\n His eyes narrow. He watches me for a second and then looks back at the road, \"Dr. Bradley, she\u0027s my doctor too. I\u0027ve helped on a couple now. All the people there were either doctors or patients who have survived and come back around. No one else would get it. It\u0027s extreme and harsh but it\u0027s the only way sometimes.\"\\n\\n I doubt the authenticity of the story for a second, but the look in his eyes isn’t something anyone can fake. It\u0027s the look a person gets when they remember something they\u0027d rather forget.\\n\\n \"Do you ever just wish it had been you that didn’t make it?\" I ask and stare out the window.\\n\\n \"Everyday.\" His words are hollow like mine.\\n\\n Chapter Fifteen\\n\\n The door bursts open. She leaps at me. She hugs and examines every inch. Tears have claimed her face and mine. She wraps around me and pulls me into her. I can\u0027t hear anything she says over the shriek in her voice. I feel like I\u0027m in a melodrama.\\n\\n She stands up and kicks the door closed, wiping her face. She\u0027s huffing and puffing. It takes her a minute before she speaks.\\n\\n \"Did they hurt you badly?\"\\n\\n I lick my lips and nod. I don’t have the ability to lie to her.\\n\\n \"Sexually?\"\\n\\n I grimace and shake my head.\\n\\n \"Beatings?\"\\n\\n I avert my eyes.\\n\\n She breathes through her flared nostrils, \"I\u0027ll kill him. I\u0027ll friggen kill him.\"\\n\\n \"Just sit.\"\\n\\n She paces and rants, \"I will peel his god damned skin from his body. How are you so calm? God damned. I was so worried.\" She sighs and sits beside me. She drops her dark head into her hands and shakes it back and forth, \"You scared me.\"\\n\\n \"Scared me too.\"\\n\\n She turns her head and frowns, \"You seem different.\"\\n\\n I laugh bitterly, \"That was the point.\"\\n\\n \"Just start at the beginning and tell me every detail.\"\\n\\n I sit back on the bed and let it flow out of my mouth. I watch her expressions as the words roll of my tongue. She cries and shudders. It no longer feels real to me. I\u0027ve been combing through it in my therapy detox for weeks. I\u0027m exhausted thinking about it. But for her it\u0027s new and real and painful. She looks horrified and when I finish she doesn’t speak. She curls into a ball and cries. I pat her hair and rub her back. I comfort her.\\n\\n \"I don’t mean to be selfish. I-I-\u0027m so sorry.\" She heaves. She lies there for a long time. The sun starts to go down.\\n\\n \"Are you scared you\u0027ll never get past this?\" She whispers into the muted dusk light.\\n\\n \"Yes and no. Sometimes I think it will never go away. I still have moments where I can\u0027t feel anything or I feel too much and get overload. Doctor Bradley has been helping me. I started heavy sessions with her. Eight hours a day of intensive therapy. I am so talked out. It\u0027s not even funny.\"\\n\\n \"I hate that they did that to you and you\u0027re so calm.\"\\n\\n I laugh. \"I wasn\u0027t calm. I cried for long time. I couldn’t talk. They made me look at hundreds of photos of her. They made me see her the other way and write her letters. I begged to go back to the cell for days.\" I hold out my arm, where a bandage covers the scab, \"I smashed a window and cut myself on the glass.\"\\n\\n She turns and looks at me, \"You?\"\\n\\n \"Yeah. It just doesn\u0027t feel real. It\u0027s like a movie I don’t want to watch because it makes my tummy hurt.\"\\n\\n She frowns, \"It makes my tummy hurt too. I can see you, all little and scared in the hole.\"\\n\\n I frown at her, \"Don’t try to see it. It already ruined the person I would have been. Don\u0027t let it in.\"\\n\\n A single tear makes its way down her cheek, \"It\u0027s hard. When I think about it I want to go on a rampage.\" Her lip trembles.\\n\\n I laugh, \"New Leaf?\"\\n\\n She laughs, \"We need to burn the old friggen tree down and plant a new one. In a different country. Not just a New Leaf but a new everything.\" I laugh with her. It feels nice to laugh. For real. She plays with my hair, \"How is he so rich and hot and normal?\"\\n\\n I shake my head, \"He\u0027s rich and hot, but he\u0027s not normal. I see a sickness in his eyes. They\u0027re broken like mine. Like a mirror with cracks in it but none of the glass has fallen out of the frame.\"\\n\\n \"Spooky.\"\\n\\n I stare out the darkening window, \"Yeah.\"\\n\\n \"I feel so bad for him. I mean I feel bad for you too, but he knew his life before. You know?\"\\n\\n I nod, \"I hate that his life is this. That I was part of the reason it became what it is.\"\\n\\n \"Em, you know you didn’t do it.\"\\n\\n I smirk. She grimaces, \"Sarah. Sorry.\"\\n\\n I laugh, \"I can\u0027t get past it either. I\u0027ve been Em for so long. Em the orphan.\"\\n\\n She sits up, \"Why did you lie about it? Why did you make your name Em?\"\\n\\n I shrug, \"I just remember loving her name when I met her. She was so pretty and clean. I named my Barbie Emalyn the day they got there. When the police found me and asked me my name, it just burst out. I didn’t want to be Sarah. Sarah was the name of the girl who killed Emalyn. She didn’t deserve to live on.\"\\n\\n She grabs my arms, \"You didn’t kill her. The circumstances did. No six-year old who lived the way you did can be blamed for that.\"\\n\\n \"I know. It\u0027s just hard. I can feel the gun in my hands. The facts are the facts. My statement is being given to the police. Eli\u0027s parents will see it. They\u0027ll know it wasn’t him, for sure.\" That gives me a sense of peace.\\n\\n She snuggles into me again, \"You didn’t do it. Killing someone is taking the gun and shooting them. Not missing him and hitting her. It was an accident.\"\\n\\n \"It hurts the same either way.\"\\n\\n She squeezes my arm, \"I love you homie. Sarah or Em or whatever. I love you. You\u0027re the same to me no matter what. I know your heart. I know you couldn’t hurt a fly.\"\\n\\n I feel a sickening amount of relief. Tears slip from my eyes. I was so worried she would hate me. I was terrified she wouldn\u0027t understand. Like she would see the gun in my hands, the way I do.\\n\\n She looks around the room. \"It is different in here. It\u0027s dirty and there isn’t a variety of hand sani on every counter or shelf.\" She looks at me, she has avoided my eye contact for a few minutes, \"What do you remember?\"\\n\\n I twitch my foot. I don’t want to answer. \"All of it.\" \\n\\n","sourceLink":"https://allnovel.net/the-lonely-the-lonely-1/page-23.html","bookId":1888,"book":{"id":1888,"title":"The Lonely (The Lonely #1)","description":"Storyline: The Lonely (The Lonely #1) \\n 19+ \\n The truth is subjective to what the lonely lets in. \\n Emalyn Spicer has lived with it for a long time. She thinks it goes back further than her memories do. She knows it goes back further than the OCD. \\n When she arrives at college, her OCD\u0027s and the lonely refuse to let her have her wish to be normal. \\n When she meets Sebastian and starts to fall for him, she lets herself believe it\u0027s possible to outrun the things chasing her from the past. But how to you get away from the things inside of you? How do you run from yourself? \\n Just as she gives up and succumbs to the lonely, the unthinkable happens. She finds herself once again trapped in the dark, once again held against her will. \\n This time she meets the lonely head on. In the darkest corners of her mind, she discovers there is more to her world than she ever imagined. She discovers that the lonely was there for her, protecting her from herself and her secrets. \\n How far would you go to find yourself? \\n This is a dark and captivating novel, tread lightly\\n","cover":"https://allnovel.net/images/the-lonely-the-lonely-1.jpg","author":"Tara Brown","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-lonely-the-lonely-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:00:28 PM"}}
