{"id":84761,"no":36,"title":"Page 36","content":"\\n\\n She looks at me, \"What?\" She knows what.\\n\\n I smirk, \"Just call him. He\u0027s the best guy in the whole world. Trust me. I\u0027m not a trusting person. I trust him.\"\\n\\n She raises an eyebrow, \"You are the worst judge of character ever.\"\\n\\n \"True. I\u0027m friends with you.\"\\n\\n She laughs and nudges me, \"Let\u0027s just get this embarrassment over with.\\n\\n The bus ride is loud and gross. My OCD is not gone. Clearly. I\u0027m thinking about just throwing out my pants when we get off, and hate the feel of my hand on the rail in front of me.\\n\\n \"We need a car dude.\" I sigh.\\n\\n She nods, \"Yeah. This is gross.\"\\n\\n My eyes are fixed. I can\u0027t look around me at the people on the bus. I\u0027ll never eat again. Someone coughs and clears their throat. My eyes widen.\\n\\n \"I see you.\" Shell whispers into me. I shake my head, \"No you don’t.\"\\n\\n \"It\u0027s okay. Just do it. I want some too.\"\\n\\n The hand sani is out of my pocket and dumping the cool liquid on both of us before I\u0027ve taken a breath. The smell of the cinnamon and gingerbread man is soothing. I slosh it around on my hands. I take deep breaths and just feel the tingly sensation. It calms me.\\n\\n I\u0027m losing it. Shell leans in again.\\n\\n \"Wanna hear about the first time I ever got spanked.\" She whispers, almost silently. The shock of her sentence stops my panic attack.\\n\\n \"Remember two years ago when I went on the senior class trip with Angela and Jessica and Brianna?\"\\n\\n I nod keeping my eyes shut.\\n\\n \"Well, we spent all our money on clothes and shit. It was our last night in Austria. We wanted to get drunk but we had no cash. So we decided to look for a mark. Someone who would buy us drinks all night long. We were sitting in this bar downtown, about a block from out hotel. We couldn’t decide on who to use. The guys in the bar were young and hot but they all had pretty girls or just didn’t look interested. Then in walks this guy. He was in a pilot\u0027s uniform and looked like fucking James Bond. He was so beautiful and sexy and confident. He strolls up to the bar and orders a drink. I point and say \u0027him\u0027.\"\\n\\n I smile. I can see it so clearly.\\n\\n \"So the girls are like \u0027no way, he\u0027s too posh and shit.\u0027 But you know me. So I walk up, right next to him and climb on a stool. I get on my knees and lean across the bar. I almost stick my ass right in his face. The bartender comes over and I say, \u0027you got any Rolling Stones?\u0027 The bartender looks confused and turns and changes the music. I totally pick the Stones \u0027cause they\u0027re sexy and older, like Bond. I figure he\u0027s like thirty-five or forty. Anyway, Paint It Black starts playing. I slink off the barstool and go sit down. Brianna smirks and swears there is no way he\u0027s coming over. But I am the master. He strolls over with a tray of shots and we get trashed with him.\"\\n\\n I laugh. \"You are Ballsey.\"\\n\\n \"I am ballsey. So the night progressed. We got so drunk and had a ton of fun and did a ton of dancing. Pretty soon everyone wanted in on the action. But I was having fun with Mr. Bond. He and I snuck off to his hotel room. We made out in the elevator, he ripped my skirt.\"\\n\\n I\u0027m starting to feel the scene with her. Her breathing picks up slightly as she tells it.\\n\\n \"So we got in the room. He undressed and damn. Hot. OMG hot. We were getting it on hard and then suddenly he pushed me down on the bed and I felt this hard slap on my ass. Not what I was expecting. At all. Needless to say it went well. I almost died of humiliation and the bizarre love I had for that moment. Anyway, I left and that’s the first time I ever got spanked.\"\\n\\n I smirk, \"Did you tell the girls?\"\\n\\n \"Yeah, I did. What I never told them was that after we finished, he put a ring on his wedding finger. My stomach almost dropped dude. I was so upset. I literally like almost cried. I said \u0027you\u0027re married\u0027 and he says \u0027yeah, of course I am. I have kids older than you. I\u0027m fifty-six-years old\u0027.\"\\n\\n I open my eyes and shoot a look at her, \"What?\"\\n\\n Her face is beet red and pained, \"Yeah. Fifty-six. I\u0027ve had sex, and I mean nasty spank-my-nipples dirty sex, with an old man. A man who was ten years older than my dad. It was humiliating and I have never told a single person that story. No one ever knew. I let him use me and you know what, it\u0027s still the best sex I have ever had.\" She sighs, \"Senior citizen sex. So humiliating.\"\\n\\n I lean in and hug her and kiss her cheek, \"Thank you.\"\\n\\n She shrugs, \"You\u0027re my bitch. I would take a bullet for you. I just want you to know that I get it. I know what it feels like to be crushed and upset when someone gets something from you. Something that you didn’t want to give, even though they made you like it.\"\\n\\n I see her in a new light. But we don’t get to talk about it because the bus stops and we\u0027re outside the gym. We climb off in silence.\\n\\n \"You don’t think less of me now do you?\" She asks as we trudge through the snow to the front entrance. I glance at her, \"No. More.\"\\n\\n She grins, \"Ditto. I never imagined you had the balls to do half the shit you\u0027ve done.\"\\n\\n I laugh. We walk in and I start to feel my nerves getting the best of me. I think about her walking out of the hotel. I imagine she made the same face I did leaving his apartment. I see how strong she is and how much I admire and want to be her and suddenly, it\u0027s there. I am like her. I am strong like her. He can\u0027t break me. I see the point he was trying to make. His one act won\u0027t ruin all the strength I have inside of me.\\n\\n We walk down the hall and I feel like I\u0027m in one of those movies where the underdogs come and kick ass.\\n\\n I wish that I could say that was how it happened.\\n\\n We walk out into the gym, smiling at Lance.\\n\\n \"He looks like Santa, but like boxing Santa.\" Shell whispers. I laugh and nod, \"Twinkle eyes.\"\\n\\n The boys are there. Brandon eyeballs me. I nod at him.\\n\\n \"Ready for warm up ladies?\" Lance asks, in a voice filled with joy.\\n\\n I point, \"This is Michelle.\"\\n\\n Lance nods, \"Mickey and Tink. I like it.\"\\n\\n Michelle looks lost, \"What just happened?\" I shake my head at her. It\u0027s impossible to explain any of them.\\n\\n Lance shouts, \"Three laps slackers, let\u0027s go.\"\\n\\n We start to run. I leave Michelle in the dust. My legs can\u0027t help but beat the little turds in the running. They\u0027ll be kicking my ass in rings in an hour anyway. I lap her and few of the other boys.\\n\\n I run harder, letting my legs open up and push it.\\n\\n The air is blowing by me. I finish the lap and bend over to suck wind for a second.\\n\\n \"Someone hasn’t been running much, hey Tink.\" My ass gets a hard slap. I grin and stand up to face the beast.\\n\\n \"Angelo, you wanna race?\"\\n\\n His face splits into the cockiest smile ever, \"Only if you let me slap you around afterward.\"\\n\\n I take a step into his face, \"Done.\"\\n\\n He lifts an eyebrow, \"Ready?\"\\n\\n I nod. We line up. He smells good. He says go. I take off like a rocket. My legs are warm from the three laps. He\u0027s grunting behind me but I push it harder and pull away.\\n\\n \"GO TINK!\" Lance screams as I pass the first lap. I run my ass off and finish before he\u0027s even half way on his last lap.\\n\\n He comes in winded and wheezing, \"God damned, you are fast.\"\\n\\n I nod, sucking wind hard. My throat hates me.\\n\\n \"I\u0027m gonna make you pay, Tinkerbell.\"\\n\\n I laugh, \"We fight when I say.\"\\n\\n He stops, red faced and scowls, \"What? No way.\"\\n\\n I pace and nod again, \"Yeah. You just said after. You never specified. I want to chose when we fight.\"\\n\\n He laughs and shakes his crimson face, \"Cheater cheater!\"\\n\\n I laugh, bending forward to catch my breath. I stand up straight and start my high knees. I need to stretch my legs out.\\n\\n \"Seriously?\" He sounds a little annoyed.\\n\\n \"Yup.\"\\n\\n He sighs and walks away, \"Fine. But your ass is grass.\"\\n\\n I laugh and look at Michelle. She makes a face and nods at his back, as he\u0027s walking away from us, \"Wow. Angelo?\"\\n\\n \"Yup.\"\\n\\n She grins and shouts after him, \"Hey, Angelo.\"\\n\\n He turns back around and smirks at her, \"Yeah.\"\\n\\n \"Can my ass be grass too?\"\\n\\n He laughs and gives her a thumbs up, \"Done!\"\\n\\n She runs after him. She flirts and twirls her hair and lifts her leg in the air behind her, playfully.\\n\\n My breath is just starting to come around when Lance yells at me, \"Tink, get your ass over here and tape up.\"\\n\\n I leave Shell in terrible hands and turn for the ring and the ever-impatient Lance.\\n\\n When I turn around he\u0027s there. I stop breathing for a second. My stomach aches and gags a little. He\u0027s sweaty and wearing his white t-shirt. I can see his tats through the wet shirt. He\u0027s got on thick jogging pants and a stare that could knock me over. My jaw clenches as I walk past him.\\n\\n Lance points at Eli, \"He\u0027s got the other tape.\" He turns and starts taping some of the boys.\\n\\n I walk up and put my hands out. I look him in the eyes daringly.\\n\\n \"We need to talk.\" He says softly as he tapes up my hands.\\n\\n \"Talk.\"\\n\\n He smirks, \"You know what I mean.\"\\n\\n \"Talk. Brother.\" I repeat.\\n\\n He tapes them roughly but maintains the right amount of pressure.\\n\\n \"I need to see you. I need to explain some things.\"\\n\\n I laugh, but it\u0027s not mine. It belongs to this bitch, who sometimes likes to come out of my throat and say shit I\u0027m not entirely sure I mean. \"Screw you, Eli. I have nothing but that to say to you. I have no desire to see you. I came here because I seriously liked the idea of being able to fight. I like the idea that if some asshole tried to pin me, I might stand a chance at defending myself.\" My eyes bear down on him, \"I won\u0027t ever be the victim again.\" It\u0027s a lie and false bravado and probably see-through but I don’t care. I brush past him, shouldering him roughly.\\n\\n \"He\u0027s not doing it right, Lance.\" I say and put my hands out. Lance looks at the tape job and then past me, \"What the hell is this Adams? Jesus. My retriever does a better job than this.\" He tapes my hands up, cussing away. \\n\\n","sourceLink":"https://allnovel.net/the-lonely-the-lonely-1/page-36.html","bookId":1888,"book":{"id":1888,"title":"The Lonely (The Lonely #1)","description":"Storyline: The Lonely (The Lonely #1) \\n 19+ \\n The truth is subjective to what the lonely lets in. \\n Emalyn Spicer has lived with it for a long time. She thinks it goes back further than her memories do. She knows it goes back further than the OCD. \\n When she arrives at college, her OCD\u0027s and the lonely refuse to let her have her wish to be normal. \\n When she meets Sebastian and starts to fall for him, she lets herself believe it\u0027s possible to outrun the things chasing her from the past. But how to you get away from the things inside of you? How do you run from yourself? \\n Just as she gives up and succumbs to the lonely, the unthinkable happens. She finds herself once again trapped in the dark, once again held against her will. \\n This time she meets the lonely head on. In the darkest corners of her mind, she discovers there is more to her world than she ever imagined. She discovers that the lonely was there for her, protecting her from herself and her secrets. \\n How far would you go to find yourself? \\n This is a dark and captivating novel, tread lightly\\n","cover":"https://allnovel.net/images/the-lonely-the-lonely-1.jpg","author":"Tara Brown","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-lonely-the-lonely-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:00:28 PM"}}
