{"id":84767,"no":42,"title":"Page 42","content":"His lip trembles, making his voice unsteady. \"You have always been the girl who took my hand and trusted me to save her. The girl who saved my sister from a fate worse than any. The girl whose sadness matched my own. The girl whose face has haunted me my entire life. You saw Emalyn\u0027s eyes, well I saw yours. You are the bravest girl I have ever known.\" I\u0027m trembling and scared as he draws closer. \"I have thought of no one but you for fourteen years. I can\u0027t have a regular relationship. It isn’t you I\u0027m punishing, it\u0027s me. I don’t deserve the kindness of love. I failed her and you. I should have fought harder and saved you both. I never should have left you. I\u0027m so sorry. I never should have left you. You ended up there because of me.\" I am a sobbing mess. The kaleidoscopes have taken my eyes. The angles and shapes that make my world harsh and sharp have taken over my eyes. I step forward, grabbing his hands. \"You saved me. You saved me from the dirty house and you saved me from being a waitress in a café the rest of my life.\" I reach up and run my hands across his cheeks, taking his tears. \"I see you.\" I whisper. He wraps around me, we become one. Our skin is so close, that in the crease between us, I feel a spark that could light up the entire world. I hold him and caress him and for the first time, I see him. His hatred for himself is stronger than any feeling he could possibly ever have. He will always be the broken mess he is. I get the feelings of self-preservation Sebastian had when he left me. I get it. I could walk now and choose survival. But I don’t. I hold him closer and choose him. The hard work and constant frustration is worth the moments like this one, where I get to see inside. Even if it\u0027s just for a moment. I hate that we are both so damaged. I hold him and know that without him there never was survival. But that doesn’t mean I need to self-destruct. I know what I have to do, for us both. He shakes and sobs into me and I have a bad feeling it\u0027s the first time he has truly let himself cry. My back hurts from the pressure and weight of him, but I hold him tight until he\u0027s ready to stand up on his own again. We hold on to each other, like we did when we were little. He looks at me and shakes his head, \"I\u0027m sorry. I just panicked. I don’t know what to do without you. I don’t know what I am without you.\" \"We can\u0027t be two broken things and have a relationship.\" He frowns. I rise in my toes and kiss his lips softly, \"I don’t want anyone but you. But at the same time, I don’t want to be the china doll you glued back together. I don’t want to look whole from a distance, but when you get close enough you can see all the cracks.\" He runs a gloved hand down my cheeks, \"The cracks make us who we are.\" I shake my head, \"We can be better than this. But it feels like we need to be better for ourselves. I need to be better for me and you need to be better for you. If you can\u0027t love you and I can\u0027t love me, then we will never truly love each other.\" He looks stressed and confused. \"You don’t want to be with me?\" I kiss his frozen lips again, \"I do. But not like this. I don’t want to need you to make me whole. My whole life I\u0027ve wanted normal. I don’t care about that anymore. Shell is right, there is no normal. But with us there is a danger that we will let this consume us. We won\u0027t ever get better if we don\u0027t let go of each other and find ourselves.\" He kisses me back after a minute of my gentle pecks brushing his lips, \"You\u0027re so much stronger than I am. I can\u0027t do this without you.\" I grin, \"You need like a year with some hard-ass nuns and you\u0027ll feel better. Trust me.\" He laughs and shakes his head, \"I need you.\" \"I need you too. When we don’t need each other anymore and just want each other, we can try again.\" He grips me. I can feel his hands trembling, \"I can\u0027t be without you.\" I nestle my face into his hard chest and nod, \"Yes, you can. You just have to trust me. If you trust me to take care of myself, you\u0027ll see.\" \"What if I lose you again?\" I smile and listen to his rapid heartbeat, \"You found me once, you\u0027ll find me again.\" My own heart is breaking. I don’t want to be strong. I want him to drag me back into the change room and punish me for such thoughts. I want to be weak and succumb to his every whim. But I don’t. \"It doesn’t feel like it right now, but this is me choosing you.\" I whisper. He holds me tighter. \"You\u0027re right it doesn’t feel like it now.\" I close my eyes and feel the right path before me, \"It will.\" He pulls back, \"Are we going to box then?\" I laugh, \"I need all the help I can get and we both already look beat up.\" Chapter Twenty-Six I tremble as she wraps the tape. She looks at me and smiles, \"You got this.\" I laugh, \"I\u0027ve got an ass whooping coming. That’s what I\u0027ve got.\" She smirks, \"Yup. But you look sexy in your t-shirt.\" I glance down and laugh. The Tinkerbell tee is exactly what I needed. When Lance gave it to me I almost killed him. But then watching him hand out the t-shirts to the boys made me feel better. I hop back and forth and try to loosen up. \"Okay, if you panic, kick him in the balls and run. We both know Eli won\u0027t let anything happen to you.\" I nod. \"Or Lyle and Jake.\" I nod again. She sanitizes her hands and slides the guard into my mouth. \"Ready?\" I shake my head. She laughs and drags me out to the rings. My brothers smile at me, but I can see they\u0027re scared. I grin my mouth guard at them. Jake laughs and shakes his head. Lyle doesn’t laugh. He watches me and then the door, where Angelo walks out. He grins at me and points his glove, \"My turn.\" I laugh. I have a secret weapon he doesn’t know about. I look around for the only face I really need to see. His icy-blue eyes meet mine from a doorway. He\u0027s leaning with his arms crossed. He looks deadly sexy. I have to focus the blood in my body. I force my eyes away from his. We\u0027ve been hanging out like regular people but it\u0027s been painful. I climb into the ring and start to hop around. I move my neck around and roll my shoulders. Angelo is doing the same. I smirk at the boys all wearing their Lost Boys t-shirts that Lance made for them. They\u0027re cheering, even Brandon, the little shit. Lance steps in, \"Clean fighting. No cheating. No biting. No kicking. No kissing.\" I grin. Angelo holds a mitt up, \"If you gotta kish me, I get it.\" I narrow my eyes and hold my mitts up. He knocks them with his. We step back and get ready. Lance throws his arms down, \"FIGHT!\" Angelo comes hard and fast. Thankfully I can tell he\u0027s holding back, but if he hits me it\u0027s gonna hurt. His right connects with my arm, but grazes off. He frowns. I grin. He hits with the left, but I move and it grazes off again. He\u0027s confused and underestimating me. I take advantage of it and hit him in the jaw. His head barely moves. He laughs and comes at me. I turtle as his shots connect. They still hurt, even though they glance off my arms. \"Tink, you got shomeshing you want to tell me about? Like a magical forshfield thatsh prtotecting you?\" I hit him with my pathetic swipes. He laughs. I attack harder, making his laugh get louder. He swings at me, connecting with my face. I fall back. Luckily, it too glances off. \"TINK!\" He jumps and grabs me. I\u0027m laughing now instead of him. I rub my glove against my face. His gloves drop. He looks scared, \"Can we be done now? I didn’t even hit that hard and my shots aren’t connecting, but this is stressing me out.\" I laugh and nod. The cocky bastard is gone and replaced by this pussycat. He looks at my face and frowns. He looks at his glove and shakes his head, \"Cheater, cheater.\" I laugh. I\u0027m sure I have a very glittery face. He looks at Shell, who waves at him holding the bottle of glitter body oil. He holds up his sparkly gloves, \"How did I mish thish?\" Lyle and Jake are there beside me, lifting me up. Protective isn’t the right way to describe them. They moved to Boston the week after my birthday and we had planned family outings every second day until they finally got us to agree to move in with them. They even joined my boxing club. They\u0027re out of control. But I like it. \"You okay?\" Lyle asks and glares at Angelo. Jake pulls off my gloves. I drop the guard into my hand and grimace. Lyle makes the same face. He has a thing with germs. It warms my heart. I look around the gym for Eli, but he isn’t there. He\u0027s gone. \"We have to leave for Easter. You ready?\" Lyle asks. I nod. \"Is Eli coming?\" Jake looks around the gym. \"Not sure.\" I say. Jake looks worried, \"You guys are cool still right?\" I blush, \"Yup.\" Lance comes up smirking, \"You went down like a sack of potatoes Tink. We gotta work on your ducking.\" Brandon scoffs, \"She lasted ten times longer than I thought she would and she hit him.\" I glance at Angelo and wink. He laughs. \"Race when I get back?\" He nods, \"Then we start working on that plan of yours.\" I smile, \"Thanks Angelo.\" He nods at me, \"Get that girl to call me again. She\u0027s not returning any of my texts.\" I look at Shell, talking to the Lost Boys and shake my head, \"She\u0027s off the market dude.\" \"Bummer. Have a good Easter Tink.\" \"You too.\" I get cleaned up, staring at my phone the entire time. I miss him, even if I asked for it. We leave the gym. Stuart is standing at the SUV looking at his watch, \"Come on!\" He\u0027s waving his arms, motioning for us to get in. He drives like a madman. \"We\u0027re gonna miss him if we don’t hurry.\" I lean over the seat between him and Jake, \"What?\" Stuart glances at me, \"Seatbelt.\"","sourceLink":"https://allnovel.net/the-lonely-the-lonely-1/page-42.html","bookId":1888,"book":{"id":1888,"title":"The Lonely (The Lonely #1)","description":"Storyline: The Lonely (The Lonely #1) 19+ The truth is subjective to what the lonely lets in. Emalyn Spicer has lived with it for a long time. She thinks it goes back further than her memories do. She knows it goes back further than the OCD. When she arrives at college, her OCD\u0027s and the lonely refuse to let her have her wish to be normal. When she meets Sebastian and starts to fall for him, she lets herself believe it\u0027s possible to outrun the things chasing her from the past. But how to you get away from the things inside of you? How do you run from yourself? Just as she gives up and succumbs to the lonely, the unthinkable happens. She finds herself once again trapped in the dark, once again held against her will. This time she meets the lonely head on. In the darkest corners of her mind, she discovers there is more to her world than she ever imagined. She discovers that the lonely was there for her, protecting her from herself and her secrets. How far would you go to find yourself? This is a dark and captivating novel, tread lightly","cover":"https://allnovel.net/images/the-lonely-the-lonely-1.jpg","author":"Tara Brown","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-lonely-the-lonely-1.html","creation":"Oct 5, 2019 8:58:06 AM","modification":"Oct 5, 2019 5:00:28 PM"}}
