{"id":71380,"no":1,"title":"Page 1","content":"Prologue\\n\\n Lila\\n\\n Beauty. Vanity. Perfection. Three words my mother adores. They mean more to her than her husband, her daughters, and life. Without these attributes, she thinks she’d be better off dead. Without me having these attributes, she would disown me. Be flawless. Shine bright. Never, ever do anything less than excel. These are her rules and the vanity that makes up my life. And my father isn’t any better. In fact, I think he might be worse, because even with beauty, perfection, and flawlessness, I’m still never good enough.\\n\\n The constant need to be perfect continuously overwhelms me and makes me feel like I’m going to be crushed from the pressure. Sometimes I swear my house can shrink and expand, that the walls can close in and then retreat. When I’m alone in my house, the space feels overly immense with too many rooms, too many walls. But when I’m in it with my parents it seems like I can’t get enough space, almost as if I can’t breathe, even if we’re on opposite sides of the house.\\n\\n Maybe it’s because I’m always doing something wrong and they’re always reminding me of my unforgiveable mistakes. Either I’m not doing enough to appease them or I’m not doing things well enough. There are always rules to follow. Sit up straight. Don’t slouch. Don’t talk unless you’re spoken too. Don’t screw up. Be perfect. Look pretty. We have expectations and standards to live up to. We must be perfect on the outside, despite what’s on the inside. I get so exhausted by the rules. I’m fourteen years old and all I want to do is have fun for once in my life and not wear sweater sets, slacks, and designer dresses, not worry about my hair being shimmering and sleek, my skin flawless. If I could, I would cut off my hair and dye it some wild color, like fiery red or streak it with black. I would wear heavy eyeliner and dark red lipstick. I would do anything as long is it was really me. At the moment, I’m not sure who that is, though. I only know the me my mother created.\\n\\n I’m getting tired of it. I don’t want to worry about what everyone thinks of my family. I don’t want to have to sit at a dinner table that is big enough to seat twenty when there are only three of us. I don’t want to be forced to eat food that looks like it still needs to be cooked. I don’t want to endure one more dinner where I’m told every single thing I’ve done wrong. I want them to just let me be myself and maybe, perhaps tell me that they love me. I don’t want to feel like I’m always screwing up. I want to feel loved. I really do.\\n\\n “Lila Summers,” my mom says, her tone clipped as she snaps her finger at me. “Don’t slouch at the table. You’ll get bad posture and it will mess up your height, or worse, you’ll get a hump on your back. Imagine how hideous you’d look then.”\\n\\n Blowing out a breath, I straighten my shoulders, lifting my chest up, and continue to push the food around on my plate with my silverware. “Yes, mother.”\\n\\n She shoots me a dirty look, displeased with my disrespectful tone. She just had her regular Botox treatment and her face looks frozen in place; nothing moves, wrinkles, or reveals any kind of emotion whatsoever. Then again, that’s how my mother is with or without Botox treatments. To show feeling is to show weakness, something my father and mother despise, along with failure, underachievement, and embarrassment to the family name, something I frequently cause.\\n\\n “But doesn’t it seem just a little bit silly,” I say, knowing I’m treading on thin ice. My father hates when we question the rules, but sometimes I can’t keep my mouth shut, because I keep it shut too often. “To not be able to slouch just a little since we’re the only ones here.”\\n\\n “Maybe we should start having her eat at her own table,” my father says, taking a bite of his asparagus. “You know how I feel about distractions while I’m eating.” He’s always in a pissy mood, but he’s extra pissy today. He had to join my mother at a mandatory meeting at my school with the principal because I got caught ditching yesterday. It wasn’t really a big deal. I just missed gym, but they got called in and that in and of itself caused an embarrassment to my father, which he repeatedly reminded me of in the car ride home.\\n\\n “She never does anything right,” he’d said to my mother as we drove home. “I’m so sick and tired of the drama. Either she needs to straighten up or she needs to go.”\\n\\n He’d said it like I was a dog or something equally as easy to discard.\\n\\n My mother continues to glare at me from across the table, warning me to keep my mouth shut, that my father is not in mood for any arguing—like he ever is. She has blue eyes and blonde hair identical to mine, but her hair has started to gray so she dyes it once every couple of weeks so her roots won’t show. She gets manicures, won’t wear anything else besides name-brand designers, and has a shoe closet that’s as big as a lot of people’s houses. She likes her expensive wine and of course her medication. I hope to God I don’t grow up to be her, but if my mom has her way, I’ll be married off to some well-known family’s son, despite the fact that we won’t be in love. Love is stupid. Love won’t get you happiness, she always says. It’s how my mother and father met, which is probably why they sit on opposite ends of the dining table and never make eye contact. Sometimes I wonder how I was ever created, since I’ve never even seen them kiss.\\n\\n My father’s phone chimes from inside his shirt pocket and he slips it out, checking the screen. He hesitates, and then silences it before returning it to his pocket.\\n\\n “Who was that?” my mother asks, even though she already knows. We all do. Even the maids.\\n\\n “Business,” he mutters and stuffs his mouth with asparagus.\\n\\n Business is his twenty-four-year-old mistress, who my mother knows about but won’t ever say anything to my father about. I overheard her talking to her mother about it and they’d both agreed that it was a sacrifice of her luxurious life. My mother acted like it was no big deal, but I could hear the hurt in her tone then like I can spot agitation in her eyes now. I think it makes her feel like she’s losing her beauty and youth, since she’s getting older, grayer, and the wrinkles are starting to show.\\n\\n “Well, will you please tell business not to call at the dinner table?” She stabs her fork into her chicken. “And Lila, I will not warn you again. Sit up straight or you will go to your room without dinner. You’re going to end up with a hump on your back and then no one will ever want you.”\\n\\n “I really think we should reconsider sending her to that boarding school in New York that you sent Abby to,” my father says without looking at me. He straightens his tie and takes a bite of food. “Actually, I think we should. I don’t want to have to worry about raising her anymore. It’s too much drama and I don’t have the patience for it.”\\n\\n “Now Douglas, I don’t think we need to send her that far away,” my mother says, letting the mistress call go like it’s as easy as popping one of the pills she takes every morning.\\n\\n It’s almost the same conversation they have every single night. My dad says, “Hey, let’s send her away” to which my mother replies, “Now, Douglas.”\\n\\n “She’s been getting into too much trouble.” My father grimaces, cutting his chicken. “Skipping school to go shopping and hanging out with people who aren’t up to our standards. She has average grades at best and zero accomplishments besides looking pretty. I ran into Fort Allman the other day and his son just got accepted to Yale.” He stuffs a bite full of chicken into his mouth and chews it completely before speaking. “What do we have to show for ourselves, Julie? Two daughters, one who’s been to rehab two times and the other who’s probably going to end up pregnant before the end of her freshman year of high school. She needs some sort of direction.”\\n\\n “I’m not going to get pregnant,” I argue, feeling myself shrink, my shoulders hunching in. “I don’t even have a boyfriend yet. Not a serious one anyway.”\\n\\n “She’s too much of a flirt.” He talks over me with disdain in his voice, like he’s ashamed of who I am. “She’s turning out to be just like Abby and I don’t want another one of those in our house. I want something I can be proud of and boarding school may be able to turn her around, if it isn’t too late already.”\\n\\n It feels like I’m running out of breathing space, the walls closing in, ready to crush me to pieces. My shoulders bend inward even more until I’m pretty much curled up in ball.\\n\\n “She will turn into someone you’ll be proud of—I’ll make sure of that. I promise,” she says in a timid voice, rearranging her vegetables on the porcelain plate. “She just needs a little bit more discipline.”\\n\\n “And if she doesn’t?” he asks. “Then what?”\\n\\n She doesn’t answer, cutting her chicken into thin slices, and I can hear the knife scraping the plate.\\n\\n My father looks at me and his brown eyes are cold, his jaw firm, and his expression stoic. “At her age I already knew what college I was going to go to, where I’d work, and I even helped my father out at his office three times a week. What has she accomplished? Looking pretty? Wearing nice clothes? Becoming you, Julie? I don’t see how that will be beneficial to her future. Unless she can find someone to marry her, which at this point, I can assure you no one will.” He says it with such arrogance and self-worth. “She needs to start focusing less on boys and clothes and more on school and work. She needs to stop being such a God damn screwup, and until she does I don’t want her in this house.”\\n\\n I tell myself to breathe, that the walls aren’t really closing in and that I’m not going to get crumpled into pieces. That feelings stabbing inside me are just feelings and one day I won’t feel so worthless—one day I’ll feel loved. That my father is just being himself, the same way his father was with him (I know because I’ve seen it). My sister, Abby, assures me there’s an entire world out there, past parents, money, expectations, and vanity. One that you can be yourself in—be free to be whoever you want, whatever that might be. She says she’s free now and it’s the most breathtakingly wonderful experience ever, despite her less-than-perfect living conditions and life choices. \\n\\n","sourceLink":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3/page-1.html","bookId":1971,"book":{"id":1971,"title":"The Temptation of Lila and Ethan (The Secret #3)","description":"Storyline: The Temptation of Lila and Ethan (The Secret #3) \\n On the surface, Lila Summers is flawless: good looks, expensive clothes, and a big, beautiful smile. But a dark past and even darker secrets are threatening to bubble over her perfect façade. She\u0027ll do anything to keep the emptiness inside hidden-which leads her into situations that always end badly. Whenever she hits bottom, there\u0027s only one person who\u0027s there to pull her out: Ethan Gregory. \\n Ethan set the rules a long time ago: he and Lila are just friends. He doesn\u0027t do relationships. Although his tattooed, bad boy exterior is a far cry from Lila\u0027s pretty princess image, Ethan can\u0027t deny they have a deeper connection than he\u0027s used to. If he\u0027s not careful, he could be in serious danger of becoming attached-and he\u0027s learned the hard way that attachment only leads to heartbreak. \\n When Lila falls farther than she ever has before, can Ethan continue to help as a friend? Or is he also getting close to falling . . . for her?\\n","cover":"https://allnovel.net/images/the-temptation-of-lila-and-ethan-the-secret-3.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:19:39 AM"}}
