{"id":71409,"no":30,"title":"Page 30","content":"\\n\\n “So how much do you think I can get for all of this?” I ask Ethan as he loads up the back of the truck with boxes of my clothes. My beautiful clothes I never want to let go of, but I know I need to in order to buy things like, say, food. I thought it would feel horrible to do this, and it kind of does, but there’s also simplicity in it, like I’m getting a do-over, which I know isn’t real, but at the moment everything feels real. Like the heat and the way my clothes stick to my damp skin. How my hair is in a messy ponytail, tugging at the nape of my neck. My hair has never been this messy and my cuticles never this dry. But I’m in simplicity land, where BMWs and designer purses and platinum rings don’t exist and I’m trying to figure out what kind of person I am and where I fit in all this. Can I handle being poor? Taking care of myself? Who do I want to be? Who is Lila Summers?\\n\\n Ethan heaves the last box into the bed of the truck and then slams the tailgate shut. “How the fuck would I know?” He wipes the sweat from his brow with his arm. He has on a green T-shirt and a pair of black shorts secured by a studded belt, along with an array of leather bands on his wrists. He’s sweaty and kind of cranky, but beneath the sunlight he’s freaking hot and I’m fixated on him.\\n\\n “What?” he asks, noting my staring.\\n\\n I press my lips together, shaking my head. “It’s nothing.”\\n\\n “It’s something. Otherwise you wouldn’t have a goofy grin on your face.”\\n\\n I self-consciously rub my hand over my mouth like I can erase my smile or something. “I don’t have a goofy smile.”\\n\\n His lips curve up into a playful grin, and for a moment his grumpy mood vanishes. “Yeah, you’re right. Now will you tell me why you have that beautiful smile on your face?”\\n\\n “It’s nothing.” I shrug, trying not to let my smile broaden at the fact that he called it beautiful. “I was just lost in how nice you look today,” I say, telling him the truth in the most casual way that I can.\\n\\n He glances down at his sweaty T-shirt, then peers up at me warily. “You think I look good?”\\n\\n “Sure.” I shrug again, not really wanting to delve into the details of the fact that I think he’s ridiculously hot looking and I want him to touch me. This feeling has become a growing desire over the last week. Living with him has seemed to sprout it like a flowering blooming on a tree. It’s annoying and I wish it would go away because apparently without the pills I am one sex-starved person. Plus, Ethan has gotten a glimpse into what lies beneath my makeup, jewelry, and designer clothes—he’s seen the real me at the ugliest times. I fear that having sex with him would be different, carrying more depth, at least for me, and I’d become emotionally involved. And then what would happen when our relationship ended? I’d probably pretty much be where I was at after Sean, the first and last guy I cared for and who used me and discarded me like trash.\\n\\n He slants his head to the side, assessing me with a quizzical expression on his face. “Really?”\\n\\n “Yeah. Why are you acting so weird?” I shield my face with my hand as the gleaming sunlight reflects off the metal roof of the apartment building.\\n\\n He doesn’t say anything, opening his arms and stepping forward. “Are you really, really sure you think I look good right now? So good that you want to touch me?” He does this weird thrusting thing with his hips that causes all my attention to center on his manly area.\\n\\n I roll my eyes even though I shiver on the inside. “You’re so weird sometimes.”\\n\\n “Weird, huh?” He comes at me, giving me little to no warning.\\n\\n I try to gracefully sidestep out of his way, but I step on my own toe instead and trip over my ankles. I stumble to the side and he catches me in his arms, laughing under his breath as he intentionally rubs his sweaty body against mine.\\n\\n “Oh my God!” I squeal, wiggling, attempting to get away. “You’re all wet and gross.”\\n\\n “You’re the one who said I look good.” He lifts my feet off the ground and I stay straight as a board, trying to maintain distance from his sweaty body. He rounds the back of his truck, heading for the passenger side and somehow he gets the door open without letting go of me.\\n\\n “What are you doing?” I yell, trying to sound like I’m turned off by his sweaty touch, but the pleasure of the moment is evident in my voice.\\n\\n He drops me down on the seat and then grabs the seat belt. He leans close as he moves the strap over my shoulder to buckle me in.\\n\\n “You still think I look good?” he asks with a dark look in his eyes, his face so close I can see the faint freckles on his nose.\\n\\n I nod slowly, swallowing the lump in my throat. “Yes, but I also think you smell.”\\n\\n “I smell like a man,” he says, grinning at himself. He leans in, getting his chest closer to my face so I can get a whiff of his man scent.\\n\\n “Blah!” I scrunch my nose, turning my face to the side, even though the smell of him isn’t that bad. He actually smells like cologne and sweat and heat. Very nice. Very manly. I discretely breathe him in, letting the scent of him saturate my lungs. He must notice the rise and fall of my chest, because he leans back and looks me in the eyes, sheer perplexity burning in his pupils.\\n\\n “So apparently you like the smell of sweat.” He tries to joke but his voice cracks and I wonder why. Ethan never gets nervous. I’ve seen him hit on women many, many times, and he always gets them to come home with him.\\n\\n I don’t say anything and I’m not sure why. I just keep staring into his eyes and it feels different—I feel different, giddy, alive, and not numb for once. That switch that always flips off stays on. I’m not sure if I like the feeling—the vulnerable, misplaced emotions swarming inside my chest—or not.\\n\\n Without even realizing it, I hitch my legs around his waist. The need to feel someone close to me, connect with me, touch me, is conquering anything else within me. I haven’t been touched in a while and it feels good—better than good.\\n\\n Ethan’s breath hitches in his throat and it startles me. He’s nervous. I’m nervous. I feel this strange shift between us, the heat between us intensifying, and I get excited, my nerves bubbling up inside me. Suddenly I’m a completely different person. I’m not broken. Lost. Numb. Confused. I’m a girl enjoying a moment with a guy I really, really like.\\n\\n I close my eyes as he leans in. He’s going to kiss me. I can tell. And I mean really kiss me this time instead of almost kissing me. I’ve been waiting for this more than I realized and despite all my concerns about my new feelings, ones that I’m sure existed before this moment but I was too medicated to feel anything, I want him so much it consumes every part of my body. I can feel all the warm, hot, overpowering sensations, and I breathe in his delicious scent, taste the anticipation. Kiss me. Please God, kiss me. Don’t back away.\\n\\n I moan from the heat of his breath and trace my hands up his back as I arch into him. I wait for it. Wait for the kiss, feeling his cheek touch mine. He rests it there, pressing our skin together, and I know that next he’ll touch his lips to mine. I wait as he moans my name under his breath. And I wait. Seconds later his cheek leaves mine. Break me. Throw me away. You don’t want me. Of course you don’t. No one does.\\n\\n Even though I don’t want to, I open my eyes, feeling angry and humiliated when I realize he’s watching me. This is a first for me. Usually, when I get to this point with a guy, they’re staring at my breasts, ready to rip my clothes off, like I’m an object they’re ready to devour.\\n\\n “We should get going.” That’s all he says.\\n\\n I’m struck dumb. Speechless. And feeling more unloved and undesirable than I ever have. “Yeah, I guess.” I force a tight smile as I sit up, the inside of my body shaking with anger and disappointment. Tears actually start to sting at my eyes, something that’s never happened to me before. I’m not sure how to handle it as I struggle to suck them back, twisting the ring on my finger as I remembering everything I used to be.\\n\\n “Are you sure?” He steps back from the door, farther away from me, and the sunlight hits his face. He looks sad and in pain, almost as if he’s trying not to cry, just like me, and very un-Ethan like.\\n\\n I nod, adjusting my pink tank top over my stomach. I feel defeated, unwanted. Honestly, I have no idea what I feel and it’s scaring me. I’ve lived my life moving through a string of very similar guys, ones who are polite in public, buy me nice things, have nice cars, and always tell me what I want to hear, at least until we screw, but I’ve never felt a single thing with them. And now there’s Ethan. He’s poor, drives a truck, and I’m pretty sure that every word he’s ever said to me is real. He didn’t bail on me, even when things got tough—he actually tried to help me, something no one’s ever done. What does that say? That all this time I’ve been looking for the wrong person in the world? One who I thought I was supposed to look for? The type of guy my mother has always told me I needed. Is that what I’ve been doing all this time?\\n\\n I feel like I’m about to burst into tears, not just from rejection from Ethan or the lack of confidence flowing inside, but because I’m worried that all this time I might have been doing what my mother’s wanted and was too blind to realize it. All I want to do is pop a pill and make everything I’m feeling go away. I want my confidence back, at least my fake confidence. I want my blissful, numb, never-having-to-experience-shame state because it’s easier than reality.\\n\\n Luckily, Ethan walks around the truck and climbs into the driver’s seat. This seems to break the strange, depressing desire bubble that’s formed around us.\\n\\n “So to the store then, right?” he asks, turning the key.\\n\\n “Where else would we go?” I say it softly as if it doesn’t matter, but somehow it does.\\n\\n He nods again and then backs away and the simplicity that I’d been feeling just moments ago evaporates and I’m left with a massive void in my chest and only one thing will fill it.\\n\\n One tiny, fit-into-the-palm-of-my-hand, forbidden pill. \\n\\n","sourceLink":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3/page-30.html","bookId":1971,"book":{"id":1971,"title":"The Temptation of Lila and Ethan (The Secret #3)","description":"Storyline: The Temptation of Lila and Ethan (The Secret #3) \\n On the surface, Lila Summers is flawless: good looks, expensive clothes, and a big, beautiful smile. But a dark past and even darker secrets are threatening to bubble over her perfect façade. She\u0027ll do anything to keep the emptiness inside hidden-which leads her into situations that always end badly. Whenever she hits bottom, there\u0027s only one person who\u0027s there to pull her out: Ethan Gregory. \\n Ethan set the rules a long time ago: he and Lila are just friends. He doesn\u0027t do relationships. Although his tattooed, bad boy exterior is a far cry from Lila\u0027s pretty princess image, Ethan can\u0027t deny they have a deeper connection than he\u0027s used to. If he\u0027s not careful, he could be in serious danger of becoming attached-and he\u0027s learned the hard way that attachment only leads to heartbreak. \\n When Lila falls farther than she ever has before, can Ethan continue to help as a friend? Or is he also getting close to falling . . . for her?\\n","cover":"https://allnovel.net/images/the-temptation-of-lila-and-ethan-the-secret-3.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:19:39 AM"}}
