{"id":71411,"no":32,"title":"Page 32","content":"\n “It’s just a beer,” she quickly says as she swipes the paintbrush on her toenail.\n “Is it the only thing?” I hate asking, but I need to know.\n She blows out a breath, her bangs fluttering up from her face. “What do you think?”\n I shut the door and toss the truck keys next to the lamp. “Whatever you tell me, I’ll think.” I hope though that, like me, she was able to stay away from the one thing that helps her numb the stuff she doesn’t want to feel. I hope she still feels her emotions right now like I am. Because seeing her sitting here makes me realize that even though I still have a lot of shit to work on, mainly with figuring out how to let London and my guilt for her go, walking away from that woman on the strip was the right thing to do.\n She puts the brush into the tiny bottle and twists it on, screwing it tightly closed. Then she sits back in the sofa, staring at me with an unreadable expression. “I didn’t take anything, if that’s what you’re getting at.”\n I lower myself down onto the armrest and I’m overwhelmed with the scent of nail polish and her shampoo. “I’m not getting at anything, Lila. I just walked into my apartment.”\n “Yeah, but that’s why you came back, right?” She scoffs. “Because you thought I was going to do something stupid.”\n I let out a stressed breath. “Look, I know things have been weird between us, but—”\n “Weird,” she says, cutting me off and throwing her hands into the air exasperatedly. “Ethan, you almost kissed me in the truck and then that night… that night we refuse to talk about…” She shakes her head, discouraged. “I don’t even know where we stand anymore.”\n “I don’t…” I struggle for words, surprised by how she tossed it out there so openly. It throws me off and I struggle to get my balance back, but I’m hopelessly falling to a place I’m unfamiliar with and I need to regain my footing before I do anything drastically life-altering. “I don’t know what you want me to say.”\n “I don’t either,” she says. “And it’s been driving me crazy, because I have no idea what I want or what you’re thinking. I’m going so crazy that I seriously thought about using again. Every single thing is driving me crazy!” She balls her hands into fists, about to scream. “I can’t take it anymore. I’m going to lose it. I seriously think I’m losing my mind. I mean, maybe I need to be on pills. Maybe they were what was keeping me sane and now all of my insanity is out there for the whole world to see.”\n She doesn’t have to explain. I know what she means. I thrum my fingers on the side of my leg, racking my brain for something that will make this situation better. I need to calm her down and make her understand that she’s not in this alone. “Did I ever tell you about the time I ran my truck into the ditch?” I have a vague idea of where I’m going with this, but honestly I just might be rambling.\n “What?” She gapes at me, dumbfounded. “How does that have anything to do with what I just said?”\n I slide off the armrest and down onto the cushion, leaving a little distance between us as I kick my feet up onto the coffee table. “It happened two days after I decided to clean up my act. I was pretty much insane and my mind was all over the place. I seriously thought I was going crazy.” I omit the fact that a major part of this had to do with London, because even though I’ve realized my issues with holding on to London, I’m still not ready to talk to Lila about her. “I ended up dozing off and ramming my truck into a ditch. I was completely sober, and that in and of itself can be even more complex than getting high. It’s distracting, you know. And hard.”\n She taps her foot on the ground, refusing to look at me. “Why are you telling me this?”\n “Because”—I lean closer to her and start to shut my eyes when I get a whiff of her perfume, but quickly blink my eyes open—“I want to let you know that I understand how you’re feeling and that sometimes things do feel all crazy, but it’ll fade.”\n She sighs begrudgingly. “How long?”\n “Until what?”\n “Until it goes away completely?”\n I stare ahead at the wall in front of us. “I’m not sure it ever does go completely away. It’s always kind of there, you know. Like a sleeping beast or something, but the intensity of the cravings fades away.”\n She turns her head toward me. “Did the beast ever wake up for you? I mean, have you ever slipped up?”\n I nod. “Once. About a year after I stopped doing drugs.” The day I saw London again. It was too much to see her like that, a shell of her old self.\n “And then what?” Lila asks. “You just fixed yourself again?”\n “Pretty much,” I say, again omitting the truth. That I was afraid of myself when I do drugs. Afraid of what I might become. Afraid I’d lose my mind, too, and end up jumping out a window, following in London’s footsteps. The people at the house had said they had no idea she went upstairs. That they didn’t see her. That’s because they were out of it and I should have been there for her. And she shouldn’t have shot up the damn heroin in the first place. What really gets to me though, and I’ll always wonder, is why did she jump? Was it because of the drugs? Or was it for another reason? Did she want to jump? If I hadn’t left her, then I’d know. If I hadn’t left her, then she might have not jumped. But she still might have. I’ll never really know.\n Lila bites on her lip, soaking my words in like a sponge and I pray to God I’ve said everything right. She looks at me, her eyes big and blue, and she frees her lip. “You’re seriously like Mr. Miyagi or something.”\n My eyebrows shoot upward and the dark tone of the night flips to amusement. “Did you seriously just reference the Karate Kid?”\n She shrugs. “What? It’s just an old movie about kicking ass.”\n “Yeah, but…” I shake my head. “It doesn’t seem like something you’d watch.”\n “Well, I’m full of surprises.” She rolls her eyes like she’s saying the most ridiculous thing that’s ever existed, but really, it’s the truth. Good and bad, Lila has been surprising me over and over again and I wonder just how many more surprises I’m in store for. Good and bad.\n “Yes, you are,” I say, truthfully, remembering how different she was when I first met her. “You really are.”\n Chapter Eleven\n Lila\n Ethan’s teaching me how to take care of myself, like how to shop cheap at the grocery store and pretty much spend as little money as possible wherever I go. It’s a little bizarre, not just because I need to be taught these things at the age of twenty, but because what he’s teaching me goes against everything I’ve been taught. I grew up in a home with maids, nannies, dry cleaners, chauffeurs, and money always on hand. Then while I lived with Ella, when I couldn’t pay someone to do these things for me, she’d do them. Looking back at it now, I feel guilty. I should have never let her be responsible for cleaning up after me. Now I’m broke and doing my own laundry. It’s weird and kind of sucks, yet at the same time there’s this strange gratification of being able to take care of myself, like I’m finally not completely worthless.\n “I have a job interview tomorrow morning,” I announce as I walk into the apartment, shutting the door behind me, feeling a little proud of myself, despite what position the interview is for.\n Ethan glances up from the book he’s writing in at the kitchen table. His hair is swept back out of his eyes and sticks up everywhere. “Oh, thank God. Finally. I was beginning to think I was going to have to kick you out on the streets.” He grins, amused with himself, but there’s an underlying pain in his expression, almost as if he’s forcing his humorous self to come out to disguise something else.\n I’d ask him about it, but after the whole truck fiasco I’m deciding it’s better if we keep a little bit of distance between us, until I can figure out where we stand.\n “Rude much?” I toss my purse on the couch and chuck the keys at him. He ducks, laughing, and the keys miss him and hit the wall behind him. “And I know you would never put me out on the streets.” I grin as I enter the kitchen. “You like me way too much.”\n “Do I now?” He sits up straight and humor dances in his eyes. “But I’m glad you finally got an interview. You’ve seriously applied for, like, a hundred jobs.”\n “I know.” I sigh and head to the kitchen, opening the fridge. “But apparently if you’re twenty and have never worked before, no one wants you to work for them.” I grab a can of soda out of the fridge and bump the door shut with my hip. “They all kept looking at me like I was worthless, and I’m not.” I tap the top of my finger against the can as I sink down into the chair. “I’ve got skills, you know.”\n “Mad finger skills?” He laughs as he eyes my finger tapping insanely against the top of the can.\n I flip him my middle finger. “You would be very surprised at what I can do with my fingers.”\n He clenches his fist and places it in front of his mouth. “Oh, I’m sure I would.”\n We both go silent. I can hear the loud roar of an engine outside and the clanking of the refrigerator. It’s an awkward silence, which is becoming more common the longer I live here with him. I’m not sure what’s causing it. Sexual tension? Probably from me, but I’m assuming Ethan’s managed to maintain his playboy lifestyle, bringing his women home late at night and sending them home as soon as he’s done with them, because that’s what he’s always done. I haven’t actually seen any of them, but none of them in the past have stuck around very long anyway. I’d be disgusted by his behavior, but I’ve done the same thing time and time again, only I’m usually the one leaving the house in the early hours of the morning. \n","sourceLink":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3/page-32.html","bookId":1971,"book":{"id":1971,"title":"The Temptation of Lila and Ethan (The Secret #3)","description":"Storyline: \n The Temptation of Lila and Ethan (The Secret #3) \n On the surface, Lila Summers is flawless: good looks, expensive clothes, and a big, beautiful smile. But a dark past and even darker secrets are threatening to bubble over her perfect façade. She\u0027ll do anything to keep the emptiness inside hidden-which leads her into situations that always end badly. Whenever she hits bottom, there\u0027s only one person who\u0027s there to pull her out: Ethan Gregory. \n Ethan set the rules a long time ago: he and Lila are just friends. He doesn\u0027t do relationships. Although his tattooed, bad boy exterior is a far cry from Lila\u0027s pretty princess image, Ethan can\u0027t deny they have a deeper connection than he\u0027s used to. If he\u0027s not careful, he could be in serious danger of becoming attached-and he\u0027s learned the hard way that attachment only leads to heartbreak. \n When Lila falls farther than she ever has before, can Ethan continue to help as a friend? Or is he also getting close to falling . . . for her?\n \n","cover":"https://allnovel.net/images/the-temptation-of-lila-and-ethan-the-secret-3.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:19:39 AM"}}
