{"id":71414,"no":35,"title":"Page 35","content":"\\n\\n “Lila, drop it,” I warn, sitting up and stretching my arms above my head. “You don’t want to go there.”\\n\\n “Yes, I do.” I’m not sure why, but she seems like she’s looking for a fight.\\n\\n Anger crashes through me, a ripple of fire, ready to burn anything in its path. I’m a very controlled person, except for that one time, right after I heard about London—the one time I lost it. The one time I turned into my father and shouted at everyone, broke stuff, showed my rage. “Shut the fuck up.” My voice is low, but the deep, heavy tone is worse than me yelling.\\n\\n Her eyes water over, like she’s about to cry. “You shut the fuck up. I just asked you a God damn question.”\\n\\n I take a few deep breaths, and then I stand up. “I’m going to my room.” As I walk toward the hall, she watches me, looking enraged, irritated, and the slightest bit hurt, just like how London looked the last time I saw her, the last time I walked away from her.\\n\\n But I can’t bring myself to turn back to her. I’m too worked up over London, and the emotions surfacing inside me make me want to run out and find someone to fuck. But I can’t. God, I haven’t been able to since the incident on the strip, and honestly I’ve been pretty content about it until now.\\n\\n My head is in such a weird place right now over the dream. I try not to think about London, but she always catches up with me, whether I’m awake or asleep. Plus, Rae won’t stop texting me, so that doesn’t help. Three to four times a day, every fucking day, she texts me or leaves me a voice mail. I’ve been screening her calls, refusing to answer until I’m certain about what I want to do.\\n\\n I lock myself in my room and do the only other thing I can think of to try to clear my thoughts. I write.\\n\\n I’m afraid. More than I want to admit. Fear has never been a feeling I have been comfortable with. I always adopted the artificial, subdued, and in-control demeanor, because I don’t think anyone needs to know what really lies inside me. Like the fact that I still feel torn apart, ripped in half, my soul split, because the only girl I thought I wanted to be with is an outer shell that still exists in every aspect down to the mole she has above her lip. That’s still there, along with her hazel eyes and the scar above her mouth. Her skin is still flawlessly smooth. Her looks still exist, but she doesn’t. The London I knew—the London of the past—is no more. She’s forgotten her life, and life for her now is only about the future. Everything else is lost to her.\\n\\n But what I really worry about is if I do go and see her, I’ll finally have to let her go. Forever. And the scariest thing is I both do and don’t want to. I want to move on, maybe with Lila and yet I want to hold on to London because it’s easier than feeling everything that comes along with letting go. But deep down, I’m realizing that eventually I’m going to have to finally say good-bye.\\n\\n Chapter Twelve\\n\\n Lila\\n\\n It’s been a little over a week since I brought up this London person and Ethan will still barely talk to me. He avoids me most of the time, but when we do cross paths, he keeps it very businesslike, as if we’re only roommates and nothing more. Whoever this mysterious London is she obviously means something to him. At first I thought it was just a secret girlfriend, with the way he whimpered out her name after he fell asleep on the couch. It hurt. A lot. I’d always been okay with him sleeping with women, or at least I could live with it. But a girlfriend? The idea was clawing at my skin like overly manicured nails.\\n\\n When I started questioning him about it, though, the spark of anger and discomfort and pain in his eyes led me to believe she might have been someone he loved. But getting to the bottom of it seems nearly impossible when all he’ll say to me is hello. It’s annoying me a little, because he knows so much about me. But when I think about it, Ethan’s always been more of a listener than a talker, and he keeps a lot about himself to himself.\\n\\n I got the job at Danny’s and I’m still figuring out if I like it or not. Honestly, it hasn’t been too bad, but then again, I haven’t gotten up on the bar and danced yet. Today is supposed to be the big day.\\n\\n After I check out my reflection in the mirror for what seems like ages, I finally head out. Ethan is sitting on the couch, watching the news, although his glazed-over expression means he’s probably daydreaming about something other than the weather. He’s got no shirt on and a torn pair of cargo shorts. His hair is a mess and his eyes are red, like he’s high, but I know Ethan enough to know he’s not.\\n\\n I collect my purse and a jacket off the table and his eyes wander over to me. Usually, he immediately disregards me, but tonight my outfit sets him off, which I expected.\\n\\n “What the fuck are you wearing?” He sits up, giving me a dirty look as he takes in my tight white tank top that shows off my stomach, my breasts, and the leopard-print bra I wear underneath. I have a pair of really short cutoffs on that reveal the bottom of my ass when I bend over, which one of the waitresses told me I’ll be doing a lot since the guys usually throw the tips onto the floor.\\n\\n “I could ask you the same thing,” I retort, swinging the handle of my bag over my shoulder. “There’s a thing called a shirt, you know.”\\n\\n He narrows his eyes. “What the hell did I do to you?”\\n\\n “Besides ignore me for the last few weeks?” I say, jerking the front door open. “Nothing.”\\n\\n “I’m not ignoring you,” he calls out. “I’m just opting not to spend time with you. Something roommates do a lot.”\\n\\n I stick my head back in the door. “You’re being an asshole and I don’t know why. I didn’t even do anything to you besides ask a God damn question.”\\n\\n His eyes soften and I think he’s going to apologize as he stands up and struts over to the door. But then he says, “You look like a whore.”\\n\\n That strikes a nerve, severing my connection with him. I raise my hand to slap him or shove him—I’m not even sure which. But then I decide against it and, shaking with rage, I walk down the stairs. “I don’t even know what I did!” I holler, unconcerned that I’m making a scene. I’ve spent my whole life trying not to make a scene and I’m so sick and tired of it. Nothing feels right anymore.\\n\\n “You didn’t do anything… This is all my fault… I’m sorry,” Ethan calls out after me, but I’m already running across the parking lot so his words hit my back.\\n\\n I have no traveling option other than to take the bus or walk. It’s a long walk, so I take the smelly, gross bus. I sit in the back, stewing in my anger, zipping my jacket up over my slutty clothes. I’ve never cared that I was a slut before. I’ve been called it since I was fourteen. But that God damn word—whore—sends me back to a time I’ve tried to forget.\\n\\n “Just lie down on the bed,” Sean says in a sultry voice that makes me feel warm and loved inside. “I promise, Lila, it’ll feel good.”\\n\\n He’d just put the platinum ring on my finger, saying that he was waiting to give it to someone special. My head feels a little hazy, due to the few shots I had before I came to his place. I hate drinking, but my friends told me it was necessary for tonight, especially if I was going to lose my virginity. All the cloudiness evaporates as I blink up at him and I can see the love in his green eyes, even if he hasn’t said it aloud yet. I know he loves me, because no one has ever looked at me like that—like they want me.\\n\\n “Take off your clothes,” he whispers, leaning in to give me a soft kiss on the mouth.\\n\\n I nod as he leans away and I start to unbutton the crisp white shirt I have to wear every day at school. I keep my eyes on his as I fumble with the buttons, both loving and fearing the hungry look in his eyes.\\n\\n “You have such gorgeous eyelashes,” I say as I slip my arms out of my sleeves and let my shirt fall to the floor. I’m standing in my plain white bra, plaid uniform skirt, and knee-high socks, the standard New York Reform School attire. I’ve never been topless in front of a guy before, but Sean isn’t just some guy. I gradually walk toward him, trying to look sexy and confident, but my nerves are bursting inside. I slide my fingers up the front of his shirt, feeling his rock-hard chest beneath it, pretending that I’m not terrified at all of what’s about to happen—pretending I’m more experienced than I really am.\\n\\n His muscles constrict as I reach his neck and for a flicker of a second the caring softness I’ve always seen in his eyes ices over. But the oddly cold look quickly vanishes as he reaches up and places his large hand over mine. “Guys don’t want to be told they have gorgeous eyelashes, Lila,” he says in a blank tone. “Think of something better.”\\n\\n I swallow hard, worried I’m turning him off. I wrack my brain for something to say to him—anything that will get him to stop looking at me as if I’m just an inexperienced, naïve girl. But I can’t seem to think of anything witty and sexy through the massive sea of alcohol in my head.\\n\\n Sensing my panic, he gathers my hands in front of me. “Relax, Lila. I’m not going to hurt you.”\\n\\n “I never said you were.” I sound choked and I know he can feel my pulse pounding through my wrists that he has pinned beneath his hands.\\n\\n He smiles, glancing around his dimly lit bedroom. He has candles burning on the nightstands and in the windowsill, creating the perfect glow and lavender scent to make love in. The bed is decorated with rose petals, there are chiffon curtains enclosing the elegant four-poster bed, and soft music flows in the background. Everything is perfect. Perfection. I can feel it, which means this is right. The thing I’m supposed to achieve. I have the perfect guy, older and more mature, with stubble and a firm jawline, and he’s wearing a fancy suit. These are the things my mother always told me to look for in a guy. Yes, he’s been a little rough with me, and when we’re around other people, he ignores me, but only because he has to because he’s older.\\n\\n He strokes his finger delicately down my cheek and all my reservations melt like the wax dripping from the candles around the room. “You trust me, right?” \\n\\n","sourceLink":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3/page-35.html","bookId":1971,"book":{"id":1971,"title":"The Temptation of Lila and Ethan (The Secret #3)","description":"Storyline: The Temptation of Lila and Ethan (The Secret #3) \\n On the surface, Lila Summers is flawless: good looks, expensive clothes, and a big, beautiful smile. But a dark past and even darker secrets are threatening to bubble over her perfect façade. She\u0027ll do anything to keep the emptiness inside hidden-which leads her into situations that always end badly. Whenever she hits bottom, there\u0027s only one person who\u0027s there to pull her out: Ethan Gregory. \\n Ethan set the rules a long time ago: he and Lila are just friends. He doesn\u0027t do relationships. Although his tattooed, bad boy exterior is a far cry from Lila\u0027s pretty princess image, Ethan can\u0027t deny they have a deeper connection than he\u0027s used to. If he\u0027s not careful, he could be in serious danger of becoming attached-and he\u0027s learned the hard way that attachment only leads to heartbreak. \\n When Lila falls farther than she ever has before, can Ethan continue to help as a friend? Or is he also getting close to falling . . . for her?\\n","cover":"https://allnovel.net/images/the-temptation-of-lila-and-ethan-the-secret-3.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:19:39 AM"}}
