{"id":71419,"no":40,"title":"Page 40","content":"Shaking my head, I stumble back into the living room and inch around the coffee table, knowing I’m in serious trouble. “Look, what do you want me to say? I’m sorry, okay? I messed up. But I can’t bring the pill back. I can pay for it, though.” I reach for my wallet that’s next to the television. He laughs darkly, walking all the way into the apartment. “You’re going to pay me for that fucking pill, Lila,” he says, shutting the door with his foot, keeping his eyes fixed on me. “But not with money. You know I don’t except cash for pills.” I glance at the hallway, contemplating running into the bathroom and locking myself in there. This is bad. Very, very bad. I can feel that something bad is about to happen and I’m not sure how to get out of it. “Don’t even think about it,” he says and then unzips his pants. “Now, you can either fuck me or suck my dick, but either way I’m going to get something out of this. I’m not just going to let you steal a pill from me and get away with it. You know me better than that.” “You’re right. I do,” I say, my voice unsteady as I search around the room for my phone. Where did I leave it? This evil ugly monster is about to come out of him. I know because I’ve seen it with every other guy out there. Try not to give them anything and they’ll break you. Give them what they want and they’ll take everything you have and then they’ll leave you in the dirt. I press my lips together, feeling a slight tremor inside my heart, but deep down I know I can probably do this if I need to. Just screw him and get it over with. I’ve done it before, but that was when I felt nothing. But right now it feels worse than wrong. It feels icky and twisted and warped. I’m scared, just like I was when Sean tied me to the bed, ropes around my ankles, wrists, even my stomach. I didn’t want to do it. I even told him that. Once. But once wasn’t enough and he took what he wanted. “I think I—” I start, my hip bumping into the corner of the television stand as I try to back away more. Parker hurries forward, his fly undone and before I can move he grabs a handful of my hair, wrenching on the roots so hard my scalp stings. “Get down on your fucking knees and be the whore that you and I and every other guy out there knows that you are.” I raise my hand to slap him, but he catches me by the wrist, jabbing his fingers into my skin as he slaps me across my face. Tears sting at my eyes and my ears ring as he shoves me down onto the floor, pressing on my shoulders until I’m kneeling at his feet. I whimper pathetically as the rough carpet scrapes against my knees and my neck bends in an awkward position. “Stop it, Parker… You’re hurting me.” “Good.” Cupping the back of my head, and still grasping violently on to my hair, he shoves my face toward his open fly. “Open your mouth and be the whore that you are.” I remember when I was dating Parker I never felt a single speck of emotion. My mind and body were blank, just like almost every other single sexual encounter. I want the blankness right now—crave it. But it’s not coming. The switch that flips is staying stubbornly in place. I can feel the shame, terror, and embarrassment way too much. I start to cry because this is real. I’m not drunk or on pills and I don’t want to do anything with Parker, like I really didn’t want to with Sean. I was just too afraid to admit it and worried that if I walked away he wouldn’t love me. And I wanted—want—to be loved for once in my life. But I never said no. All these years and not once did I refuse anyone who wanted me. I worried that no guy would ever listen to me, and really, I just didn’t think I was good enough to say no. In a sickening and perverse way, I’ve never felt good enough for anyone. So I just popped pills and did things I thought other people wanted me to do and waited for them to accept me, to love me, yet they never did. I thought Sean loved me, but he hurt me and now I’m scarred inside and out. I’m scarred and I don’t want to be. I want to feel like a whole person again. I want to go back to being fourteen and not make stupid choices, not have sex with an older guy who ties me to the bed after I say I don’t think I want to, that I don’t think I can, and then he screws me so hard the ropes cut into my skin and I bleed all over the bed. Then I’m left feeling guilty because I let it get that far and I’ll always feel like I didn’t put up enough of a fight. But I was lost. Confused. A painful wave rushes over me as my past slams down on my shoulders. I don’t want to be this girl anymore. This lonely, hollow girl. I want to feel like I deserve things and not hate myself so much. I’m deciding whether to open my mouth and scream or just bite down really hard when the door opens and Ethan walks in, carrying his tool belt. “Oh, thank God,” I say with relief and realize I’m trembling. Parker turns around and looks over his shoulder, and then his fingers immediately leave my hair and I fall to the ground on my ass, cupping the side of my face that he struck me on. “Dude, she wanted it,” he tells Ethan with his hands up in front of him. I get to my feet, clutching my tender cheek as Ethan assesses the situation, taking in Parker with his pants undone, then me and my swollen cheek, before his eyes land back on Parker. He’s still dressed in his work clothes, torn cargo shorts, a black shirt stained with dirt, and he has his work boots on. He looks all bad boy from the wrong side of the tracks who kicks people like Parker’s ass just for fun. And I love it. “Is that true, Lila?” Ethan glances at me, slowly taking the hammer out of his belt like he’s going to use it to beat Parker. I can tell he’s not going to, nor does he think what Parker said is true, but he’s messing with Parker’s head. “Did you want this loser to unzip his pants and force you down onto your knees?” Parker cringes, eyeing the hammer as Ethan holds it in his hand, but he doesn’t say a word, inching back against the wall, trying to creep toward the doorway. I wipe the drying tears from my eyes and swollen cheek as I shake my head. “No, I didn’t want it at all.” There’s this strange kind of freedom in saying it, like this secret I’ve kept hidden drifts out into the open, even if I’m the only one who understands. “She’s a liar and a slut,” Parker argues, glaring at me, and then his gaze returns unsteadily back to Ethan. “Come on, man. You know her, so you must know what she’s like.” Ethan shakes his head as he tosses his tool belt onto the couch, keeping ahold of the hammer and tapping it in his hand. “The Lila I know isn’t a slut.” Parker’s eyes widen, and then he crosses his arms. “Well, the one I do is.” “Well, that’s too bad for you.” Ethan chucks his keys onto the table, but doesn’t budge from the doorway. I love Ethan. I seriously do. I feel the brave side of myself emerging and I take a small step forward. “Parker, as much as I would love to stand around here looking at your small penis, I’m sure Ethan doesn’t, so please zip up your pants.” His gaze drops to his slacks and he quickly tucks himself in, then zips up the zipper. “Whatever,” he says, raking his fingers through his hair, attempting to tidy himself up. “I’m just going to leave. You two can go to hell.” He moves to the right to step around Ethan, but Ethan matches his move and blocks the doorway and his path. “You’re not fucking leaving this house until Lila says what to do with you.” He looks at me with intensity burning in his eyes as he places his hands on the door frame. “Do you want me to beat the shit out of him or call the cops?” He raises the hammer in Parker’s direction. “Fuck you,” Parker says, but he doesn’t dare move. It’s clear how easily Ethan could kick Parker’s ass, even without the hammer. He’s taller, stronger, rougher, and way, way more intense looking, like he’s been through things, which he has. He’s been beat by his father and watched his father hit his mother, while he tried to stand up for her. He’s real. And I want real, not the deception of it that sometimes comes with wealth and money. I’m not going to sacrifice my life like my mother did just so I can have nice clothes and a roof over my head. I like the cracked one that’s over my head now perfectly fine. I unintentionally smile, especially when Parker makes this weird noise that sounds like a strangled cat. “I’m not sure what I want you to do.” Ethan shrugs and then winks at me. “It’s up to you, beautiful.” I can only imagine how broad my smile is at this moment because I’ve never had this—protection. I’ve never had someone in my life who would stand up for me and tell me that it was okay, that people make mistakes and it doesn’t mean you have to suffer eternally for them. I look over at Parker, who’s waiting expectantly for me to chime in and save his ass. I study him forever, until he squirms and looks like he’s about ready to piss his pants. “Lila,” he says, his eyes pressing. “Help me out here.” “Why?” I ask, folding my arms over my chest. “You seemed tough enough to handle yourself a few minutes ago.” He glances at the hammer in Ethan’s hand, and then frowns back at me. “Lila,” he pleads. “You know I hate fighting.” I roll my eyes. “Unless it’s a girl, right?” His eyes narrow at my divulgence. “God damn it, Lila, I swear to fucking God…” He trails off, his jaw tightening as Ethan steps forward, patting the head of the hammer in his hand again. I shake my head and sigh, knowing I’m not really going to let Ethan kick Parker’s ass, but only for Ethan’s sake. Parker’s the kind of guy who would either try to sue and press charges or come back with a group of his friends and have them all beat Ethan up. And if I call the cops, Parker’s daddy will probably just get him out, since he’s a lawyer. “Fine. Whatever. Ethan just let him go.” Ethan doesn’t budge. His eyes are locked on me, and his arm snaps up to the side when Parker tries to head toward the door. “Are you sure?”","sourceLink":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3/page-40.html","bookId":1971,"book":{"id":1971,"title":"The Temptation of Lila and Ethan (The Secret #3)","description":"Storyline: The Temptation of Lila and Ethan (The Secret #3) On the surface, Lila Summers is flawless: good looks, expensive clothes, and a big, beautiful smile. But a dark past and even darker secrets are threatening to bubble over her perfect façade. She\u0027ll do anything to keep the emptiness inside hidden-which leads her into situations that always end badly. Whenever she hits bottom, there\u0027s only one person who\u0027s there to pull her out: Ethan Gregory. Ethan set the rules a long time ago: he and Lila are just friends. He doesn\u0027t do relationships. Although his tattooed, bad boy exterior is a far cry from Lila\u0027s pretty princess image, Ethan can\u0027t deny they have a deeper connection than he\u0027s used to. If he\u0027s not careful, he could be in serious danger of becoming attached-and he\u0027s learned the hard way that attachment only leads to heartbreak. When Lila falls farther than she ever has before, can Ethan continue to help as a friend? Or is he also getting close to falling . . . for her?","cover":"https://allnovel.net/images/the-temptation-of-lila-and-ethan-the-secret-3.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:19:39 AM"}}
