{"id":71425,"no":46,"title":"Page 46","content":"\\n\\n “Thanks.” She stretches her feet out in front of her. “We got it dirt cheap, too, thanks to Micha’s mom,” she says and when I glance at her funny, she adds, “An old friend of hers works out here as a realtor and she hooked us up with this place. They lady who owns it is really old and probably bought it back in the 1940s when it was built so she wasn’t asking a lot for it. We were really lucky.”\\n\\n “I’m glad,” I say. “You guys needed some good luck.”\\n\\n “We did?” She crooks her eyebrow, questioningly.\\n\\n “I think everyone does,” I say, hoping that I’ll get some good luck soon and finally work up the courage to tell Ethan how I feel about him. That would be the best luck ever. “So,” I say, changing the subject, “you’re really getting married on Saturday.”\\n\\n Ella nods, sipping her coffee as she stares out at the fence that divides her yard from the next-door neighbors, who apparently collect wind chimes, since there’s a collection of them trimming the entire back end of the house.\\n\\n “I really am. Totally weird, huh?” she asks, seeming a little nervous, but that’s just how Ella is. When I nod, she adds with a discrete glance at me from the corner of her eye, “About as weird as your new hairdo.”\\n\\n I touch the ends of my hair, scrunching my nose. “It doesn’t look that bad, does it?”\\n\\n She shakes her head and sets her coffee mug by her feet. “No, I like it…” Her green eyes sweep over me as she readjusts the elastic around her auburn hair. “It just looks different—you look different.”\\n\\n I examine my nails, pretending to be blasé. “How so?”\\n\\n She shrugs, staring at me with a quizzical look on her face. “You’re dressing different… less fancy and more like me. And I don’t know… you just look different. Happier or something.”\\n\\n That throws me off the slightest bit. “Happier? That’s weird, because a lot of people have said I was the happiest person they’d ever met.”\\n\\n She reaches for her coffee, again tucking her foot underneath her as she brings the brim of the glass cup up to her mouth. “I can see why they’d say that, but I don’t know…” She takes a sip, shaking her head. “You just look different for some reason. I can’t put my finger on it.” She rotates her cup in her hand, pressing her lips together, and it looks like she’s trying really hard not to smile.\\n\\n “What?” I finally say as I reach for my coffee. A little laugh slips through my lips because she looks so amused and I have absolutely no idea what’s going on. “Why do you keep giving me weird looks?”\\n\\n “Is there anything you want to tell me?” she asks.\\n\\n I shrug, taking a gulp of the coffee. “That you have a nice house.”\\n\\n She gives me a tolerant look. “Lila.”\\n\\n I press back a smile, even though I have no clue what’s going on. “Ella.”\\n\\n She grins, and then shakes her head, laughing. “Fine, if you’re not going to fess up, then I’ll just say it.” She pauses, griping the handle of her mug. “I heard a rumor that there finally might be something going on between you and Ethan.”\\n\\n I hold my cup in one hand and thrum my fingers on the wicker armrest of the chair. I haven’t talked to Ethan since we parted at the airport. I texted him a few times, but he always gives one-word responses, so I decided to give him some space, seeing how he’s probably really busy with London. God, even thinking about it hurts a little. “By rumor, you mean Micha told you about us.”\\n\\n She shrugs, grinning amusedly. “Maybe.”\\n\\n “What did he say exactly?” I ask curiously, a little worried about what he said, but the fact that he did tell him has to mean something, right? That he cares enough about me to tell Micha. “Or should I say, what did Ethan tell him?”\\n\\n She turns her head toward me with a mischievous grin on her face. “Why don’t you tell me your side and then I can compare?”\\n\\n I set the coffee cup down on the ground again while she takes a drink of hers. “Fine, we fucked.”\\n\\n She sucks in a sharp breath and then quickly moves the mug away from her mouth as she spits coffee all over the deck in front of her feet. “Holy shit, Lila.” She presses her hand to her chest, coughing as she works to catch her breath. “I was not expecting you to be so blunt about it.”\\n\\n I can’t help myself. A big silly grin rises on my lips. “Me neither, but I think I’ll have to do it more because it’s really, really fun.”\\n\\n She wipes the coffee from her face with the back of her hand. “You’re starting to sound like me.”\\n\\n “The new, fun you or the old, boring one who I first met?” I joke. “I need clarification.”\\n\\n She shields the sunlight with her hand. “The new one, which is the better one. Trust me.”\\n\\n “I do trust you,” I say. “But the Ella I’ve always known, new or old, was still a good person and that’s a great thing to be compared to.”\\n\\n She shakes her head, stifling a smile. “Are we going to have a moment here or something?”\\n\\n “Maybe,” I say. “We never really did have one in the entire two years that we’ve known each other. Maybe it’s time. We can hug, cry it out, and tell each other how much we love each other.”\\n\\n “I’m not one for crying.” She lowers her hand to her lap. “Or for throwing out the L word.”\\n\\n “I know and honestly I’m trying to cut back on it,” I joke. “We could have a girl-bonding moment though and you could ask me how sex with Ethan was while we eat popcorn and watch a really sappy movie.”\\n\\n She makes a gagging face, pressing her hand to her chest like she’s choking on the idea. “I never ever want to hear you talk about sex with him. Ever.” She shudders. “So gross.”\\n\\n We giggle over it for a moment and then talk about lighter things, like how Micha and she have been over the last couple of months. She presses me for more Ethan details, asking me why he couldn’t get off work to fly out with me. Apparently, Ethan never told anyone about London and I decide to keep it to myself, figuring Ethan must have his reasons. Other than that I don’t have much to say, besides the fact that kissing Ethan is amazing and that only makes her dry heave. She understands my need to be vague for the most part, because she’s pretty much the vaguest person I’ve ever met, and she doesn’t press much, which makes me glad she’s my best friend. I didn’t even realize how much I’d missed being around her and it makes me feel happy that I have that kind of friendship with someone but kind of sad because I know I’m only going to miss her when I go back to Vegas.\\n\\n “So what about your dress?” I ask as we head back into the kitchen, deciding for a subject change. I need to talk about something happy and clothes always do that for me.\\n\\n She sets our mugs into the sink and rinses them off. “You want to see it?” she asks, shutting the faucet off.\\n\\n I nod eagerly and clap my hands together. “Of course. I love wedding stuff. And the dress is the best part.”\\n\\n “I know.” She frowns as she winds around the tiny island in the middle of the kitchen. “Which makes me reluctant to show you.”\\n\\n “Why?” My face scrunches up. “Ella, what did you do?”\\n\\n “I didn’t do anything.” She sighs. “Which is why you’re not going to like it.”\\n\\n I stare blankly at her, confused, and she sighs and motions for me to follow her as she walks toward the hallway. She takes me back to a small bedroom. The blue walls are covered with artwork and there’s a wrought-iron bed piled with sheets of paper that are smudged with penned lyrics.\\n\\n I pick up one of the sheets of paper from the foot of the bed. “What? Do you guys just sit around and write and draw together all day?”\\n\\n “Kind of,” she says, opening the closet door. “I mean, I’m not in school right now and I only work part time down at this art gallery, so I have to fill up my day somehow.”\\n\\n I nod and set the drawing down on the dresser. “I’m trying to find a job,” I admit. “But I’m having no luck.”\\n\\n She’s searching through the clothes hanging up, but pauses, glancing at me from over her shoulder with her eyebrows elevated. “Really?”\\n\\n “Yes, really.” I sit on the edge of the bed and cross my legs, but then pull a face and put my hands on my lap. “Wait, is this safe to sit on?”\\n\\n She sifts through the small amount of clothes in the closet. “My bed? Why wouldn’t it be?”\\n\\n “Because God knows what you two do on it.”\\n\\n She rolls her eyes. “It’s fine, just keep your hands on your lap.”\\n\\n Laughing, I lean over and examine the sheet of lyrics on the bed. “So, does Micha work every day?”\\n\\n “Sometimes,” she replies. “Sometimes he gets a week off at a time. Sometimes he’s on the road all week. Right now, he’s recording at a studio in town.”\\n\\n “And it’s not hard for you?” I ask. “To be away from him like that, because I remember how hard it was for you two the first time around.”\\n\\n “I’d be lying if I said it wasn’t, but I go with him to every performance I can and we spend every waking hour together when we’re not working.”\\n\\n I sit up straight, leaning back on my hands. “I’m not really surprised that you guys are doing well.”\\n\\n She removes a hanger from the rod and turns around. “You aren’t? Really? Because I kind of am.”\\n\\n “I already told you that you guys have the most beautiful relationship that’s ever existed and although you’re kind of crazy, you’re not stupid and I knew you’d eventually get it all right.” I make a swoony face, tipping my head to the side as I drape my hand over my forehead. “You guys are so dreamy together.”\\n\\n She rolls her eyes. “Whatever, Miss Smarty Pants. Maybe I should be giving you a hard time.” \\n\\n","sourceLink":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3/page-46.html","bookId":1971,"book":{"id":1971,"title":"The Temptation of Lila and Ethan (The Secret #3)","description":"Storyline: The Temptation of Lila and Ethan (The Secret #3) \\n On the surface, Lila Summers is flawless: good looks, expensive clothes, and a big, beautiful smile. But a dark past and even darker secrets are threatening to bubble over her perfect façade. She\u0027ll do anything to keep the emptiness inside hidden-which leads her into situations that always end badly. Whenever she hits bottom, there\u0027s only one person who\u0027s there to pull her out: Ethan Gregory. \\n Ethan set the rules a long time ago: he and Lila are just friends. He doesn\u0027t do relationships. Although his tattooed, bad boy exterior is a far cry from Lila\u0027s pretty princess image, Ethan can\u0027t deny they have a deeper connection than he\u0027s used to. If he\u0027s not careful, he could be in serious danger of becoming attached-and he\u0027s learned the hard way that attachment only leads to heartbreak. \\n When Lila falls farther than she ever has before, can Ethan continue to help as a friend? Or is he also getting close to falling . . . for her?\\n","cover":"https://allnovel.net/images/the-temptation-of-lila-and-ethan-the-secret-3.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:19:39 AM"}}
