{"id":71386,"no":7,"title":"Page 7","content":"\\n\\n Sometimes it is hard to keep my hands off her, though, and I slip up. The girl is fucking gorgeous, in a model, Hollywood, way-too-perfect actress kind of way. She’s got flawless skin, perfect curves, her body proportioned just right. But she’s kind of high maintenance. The first time I took her to a pub, she refused to eat the food because she thought eating pub food was too gross and kind of beneath her high food standards, but she’s slowly progressing and I’ve even got her to eat ribs with her hands once, which was hilarious to watch.\\n\\n After I get off the phone with Lila, I put away the bracelet London gave me and my journal, filled with pages of haunting memories and thoughts. I took both of them out of my dresser during a bout of depression last night, trying to find something that doesn’t really exist anymore, because I chose to walk away from it. Or maybe it never really did exist, yet I continue to hold on to it and allow it to haunt me, never talking to anyone about it because the idea of talking about London aloud seems impossible and almost like I’d finally be letting go of her and I’m not ready for that.\\n\\n I get up and get dressed in jeans and a red T-shirt, then grab a five from my stash of money hidden in a box underneath my dresser. I work part time in construction and since my apartment is dirt cheap and I don’t really need anything else besides food, gas for my truck, and occasionally new clothes, I pretty much save everything I make. Tucking the five in my back pocket, I head out the door. I make a quick stop at the nearest Starbucks and use the five to splurge on getting Lila an iced latte because I know she loves them and it might help her with her hang-over. It’s early in the afternoon, but still warm. That’s Vegas for you, though. Even the fall seems like summer in most areas.\\n\\n When I finally reach the corner of Vegas Drive and Rainbow, I park the truck where Lila’s lying down on the sidewalk with her legs stretched out into the road.\\n\\n I hop out of the truck and shut the door. “What the fuck are you doing?” I ask, rounding the front of the truck with the iced latte in my hand. “Trying to get run over or something? Jesus, Lila.”\\n\\n She angles her head back and peers up at me. Her blue eyes are bloodshot, her mascara is smeared, and her blonde hair is all tangled. Usually she’s so put together, even when I pick her up the morning after, and it’s a little bit shocking to see her like this. Still, she’s beautiful as hell, but I’ll never admit that to anyone out loud.\\n\\n “Is that for me?” Lila eyes the coffee, licking her lips.\\n\\n I hand it to her and she guzzles it down, then pulls a face. “Did you have them put nonfat milk in this?”\\n\\n I shake my head. Sometimes she can be so high maintenance. “No, I forgot your specific instructions, your highness, but you’re welcome for getting it for you.”\\n\\n She glares at me. “Thank you,” she says with an attitude and then starts sipping on the drink again and I struggle not to ask questions about the condition she’s in, because I want to know what the hell happened to her and how she ended up here, looking like she does. “Don’t say anything,” she mutters, then gradually straightens her legs. She gets to her feet and brushes the sand off the backs of her legs. “I’ve had a rough morning as it is.”\\n\\n “You mean a rough afternoon,” I correct her and then step back from the curb with my hands up in front of me when she targets me with a death glare. “Fine. Jesus, I’ll keep my mouth shut.”\\n\\n “Good.” She walks toward the truck door, drinking from the straw and swaying her hips. I notice the back of her dress is unbuttoned all the way, so her smooth skin is exposed to the sunlight. God, if I didn’t have my rules I’d seriously bend her over and have her take it from behind.\\n\\n I check her out for a little bit longer and then back up toward the driver’s side. “Why’s your dress undone?”\\n\\n She shrugs, swinging her shoes in her hand. “I couldn’t get my fingers to work this morning.”\\n\\n My lips threaten to turn upward into a full on smirk. “Why? Were they preoccupied too much last night or something?” I joke, and suddenly way too many images of her flood my head, her fingers sliding up her inner thigh and then slowly entering herself.\\n\\n She jerks the door open, narrowing her eyes at me, and I add, “What? You’re the one who brought it up. If you don’t want me to tease you, then don’t set up the punch line.”\\n\\n Shaking her head, she presses her lips together and hops into the truck. She’ll be pissed off at me for, like, the next ten minutes, but then she’ll get over it. She always does.\\n\\n After I get in the truck, I pull out onto the road and turn up the stereo. We barely speak the entire drive and when I pull into the parking lot of her apartment, I figure she’ll bail and then call me in a few days when she needs me to rescue her again.\\n\\n But when she opens the door, she says, “So are you coming in or what?”\\n\\n “I guess, if you really want me to.” It’s not like I have anywhere else to be. Micha, my best friend and old roommate, is gone and I don’t work on the weekends anymore. “But I’m not sleeping with you no matter how much you beg.”\\n\\n “I never beg,” she says and then her face contorts with confusion as she frowns down at the ground. “At least from what I can remember I don’t.”\\n\\n I climb out of the truck and meet her around the front, aiming the keys over my shoulder to lock up the truck. We make our way across the parking lot beneath the heat of the sun and I pull my sunglasses down off my head to cover my eyes. I remain slightly behind her, checking out her ass and her lower back peeking out of her still-opened dress. Finally, I have to rip my gaze away and step up beside her, otherwise I’ll end up unable to keep my hands to myself.\\n\\n “You need to stop blacking out when you get drunk,” I say, nudging her playfully with my shoulder. “Drunk is okay, but getting so shit-faced you have no idea what you’re doing is really fucking bad, Lila. Even I’m not that bad.”\\n\\n “You’re not bad at all.” She attempts to smooth her hair down with her hand, but it only makes it stick up more. “You just pretend like you are. But deep down, you’re a really nice guy who likes to write in a journal.”\\n\\n “Hey, I told you that in confidence.” I scowl at her as we make our way up the steps to her second-story apartment. “You were never supposed to utter that aloud.”\\n\\n She pats her pockets for the keys. “Well, then you never should have told me because I kind of have a big mouth.” Her arms fall to her sides and her eyes scan around her feet and then down the steps behind her. “Crap, I think I lost my keys.”\\n\\n “Okay… so go ask your landlord to unlock it for you. It’s not that complicated,” I say, shaking my head at her.\\n\\n “I can’t ask him.”\\n\\n “Why not?” I lean on the railing, squinting against the sunlight as I assess her.\\n\\n She lowers her chin, allowing her hair to fall in her face, like she doesn’t want me to see her expression. “Because… if I do… then he’ll ask me for rent.”\\n\\n “Why?” I ask. “Are you behind on it or something?”\\n\\n She peers up at me through her eyelashes. “I may or may not have paid the last couple of months,” she discloses, her forehead furrowing.\\n\\n “Why? You’re not broke.” I hate to say it, but it’s kind of obvious by the fancy clothes she’s always wearing. Hell, she’s got a platinum ring on her finger, for God’s sake.\\n\\n “But I am,” she insists, crossing her arms over her chest. “My dad canceled all my credit cards a while ago and I have only, like, eight hundred bucks left.”\\n\\n “Then pay your rent with it.” I gape at her. “Or pawn that ring on your finger.”\\n\\n Shaking her head, she covers the ring on her hand, looking almost panicked. “No way. This was a gift from someone I used to know.”\\n\\n “So you’d rather live on the streets than get rid of your gift?” I cock my eyebrow at her. “Really?”\\n\\n “Yes, really,” she says simply, her arms falling to her sides.\\n\\n I tighten my jaw, growing frustrated. “God damn it. You do this all the time, you know that. You need to start being more responsible…” My eyes widen. Holy fucking Jesus, I sound just like my father. Shit. He’s always lecturing my mom about her flaws. This is the reason why I don’t let myself get into relationships and I’m not in one with Lila, so why am I acting like this?\\n\\n She laughs scathingly and jabs her finger against my chest. “Oh, and like you are. You get drunk and sleep around and work in construction.”\\n\\n “Hey, I never claim to be responsible.” I lean in, lowering my voice, trying to shake off the feeling that I’m acting just like my dad. No, this is different. You’re trying to help her, not control her. “But I do work and pay my rent.”\\n\\n She huffs, stomping her foot and crossing her arms. It’s not the first time I’ve witnessed her temper tantrums when I don’t give in to her, but it still gets on my nerves as bad as the first time I saw her do it. “Ethan, will you please just help me out?”\\n\\n “How the fuck am I supposed to help you out?” I ask. “Pay your rent so you can get let in? Because I’m not doing that.” But a voice inside my head laughs at me, telling me I’m full of shit. That I would pay it for her if she asks, that I’d do anything for her if she flat out asked me to.\\n\\n She sticks out her bottom lip and makes me soften just a little. “You can pick the lock,” she suggests, and when I start to frown, she grips the bottom of my shirt and clutches on to it. “Please, please, please. I’ll owe you big time.”\\n\\n “You already owe me big time, for being a pain in the ass and calling me all the time to come pick you up from random guys’ houses,” I tell her, dragging my hand across my face. “And I don’t want you to owe me. I just want you to get a job or something so you won’t get kicked out of your apartment.” \\n\\n","sourceLink":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3/page-7.html","bookId":1971,"book":{"id":1971,"title":"The Temptation of Lila and Ethan (The Secret #3)","description":"Storyline: The Temptation of Lila and Ethan (The Secret #3) \\n On the surface, Lila Summers is flawless: good looks, expensive clothes, and a big, beautiful smile. But a dark past and even darker secrets are threatening to bubble over her perfect façade. She\u0027ll do anything to keep the emptiness inside hidden-which leads her into situations that always end badly. Whenever she hits bottom, there\u0027s only one person who\u0027s there to pull her out: Ethan Gregory. \\n Ethan set the rules a long time ago: he and Lila are just friends. He doesn\u0027t do relationships. Although his tattooed, bad boy exterior is a far cry from Lila\u0027s pretty princess image, Ethan can\u0027t deny they have a deeper connection than he\u0027s used to. If he\u0027s not careful, he could be in serious danger of becoming attached-and he\u0027s learned the hard way that attachment only leads to heartbreak. \\n When Lila falls farther than she ever has before, can Ethan continue to help as a friend? Or is he also getting close to falling . . . for her?\\n","cover":"https://allnovel.net/images/the-temptation-of-lila-and-ethan-the-secret-3.jpg","author":"Jessica Sorensen","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:19:39 AM"}}
