{"id":18962,"no":4,"title":"CHAPTER III.","content":"Joseph Bonaparte again King of Spain.—His Difficulties with Soult.—Second Siege of Saragossa.—Another English Army, under Sir Arthur Wellesley, lands at Lisbon.—Battle of Talavera.—The English retire into Portugal.—Siege of Gerona.—Principal Events of the Campaign of 1810.—The English Troops make a Stand at Torres Vedras.—Retreat of Massena.—Siege of Cadiz.—Escape of French Prisoners.—Opening of the Campaign of 1811. Having closed the history of this unfortunate army, let us now return to Spain. Joseph had returned, a nominal king, to Madrid. More than twenty-six thousand heads of families had come forward, of their own accord, and sworn, by the host, that they desired his presence amongst them. The marshals, under his directions, were pursuing the conquest of Spain with vigor. Though Joseph was nominally lieutenant-general, Soult was in reality at the head of operations. A modern writer, speaking of these two commanders, says Soult was crippled in all his movements, his sound policy neglected, and his best combinations thwarted, by Joseph. His operations in Andalusia and Estramadura, and the firmness with which he resisted the avarice of Joseph, all exhibited his well-balanced character. In Andalusia he firmly held his ground, although hedged in with hostile armies, and surrounded by an insurgent population, while a wide territory had to be covered with his troops. [100]King Joseph could not comprehend the operations of such a mind as Soult’s, and constantly impeded his success. When, without ruin to his army, the stubborn marshal could yield to his commands, he did; but where the king’s projects would plunge him into irredeemable errors, he openly and firmly withstood them. The anger and threats of Joseph were alike in vain. The inflexible old soldier professed his willingness to obey, but declared he would not, with his eyes open, commit a great military blunder. King Joseph would despatch loud and vehement complaints to Napoleon, but the emperor knew too well the ability of Soult to heed them. Had the latter been on the Spanish throne, the country would long before have been subdued, and the French power established. We shall not enter into detail of all the operations in Spain. A short account of some of the principal battles we will give; and, as we have already detailed the first siege of Saragossa, our readers may perhaps like to know the final fate of this devoted city. We quote from Headley’s description of the second siege. SECOND SIEGE OF SARAGOSSA. “The siege at Saragossa had been successively under the command of Moncey and Jun?t. The camp was filled with murmurs and complaints. For nearly a month they had environed the town in vain. Assault after assault had been made; and from the 2d of January, when Jun?t took the command, till the arrival of Lannes in the latter part of the month,[101] every night had been distinguished by bloody fights; and yet the city remained unconquered. Lannes paid no heed to the murmurs and complaints around him, but immediately, by the promptitude and energy of his actions, infused courage into the hearts of the desponding soldiery. The decision he was always wont to carry into battle was soon visible in the siege. The soldiers poured to the assault with firmer purpose, and fought with more resolute courage. The apathy which had settled down on the army was dispelled. New life was given to every movement; and on the 27th, amid the tolling of the tower-bell, warning the people to the defence, a grand assault was made, and, after a most sanguinary conflict, the walls of the town were carried, and the French soldiers fortified themselves in the convent at St. Joseph’s. Unyielding to the last, the brave Saragossans fought on, and, amid the pealing of the tocsin, rushed up to the very mouths of the cannons, and perished by hundreds and by thousands in the streets of the city. Every house was a fortress, and around its walls were separate battle-fields, where deeds of frantic valor were done. Day after day did these single-handed fights continue, while famine and pestilence walked the city at noonday, and slew faster than the swords of the enemy. The dead lay piled up in every street, and on the thick heaps of the slain the living mounted, and fought with the energy of despair for their homes and their liberty. In the midst of this incessant firing by[102] night and by day, and hand to hand fights on the bodies of the slain, ever and anon a mine would explode, blowing the living and dead, friend and foe, together in the air. An awful silence would succeed for a moment, and then, over the groans of the dying, would ring again the rallying cry of the brave inhabitants. The streets ran torrents of blood, and the stench of putrefied bodies loaded the air. Thus, for three weeks, did the fight and butchery go on, within the city walls, till the soldiers grew dispirited and ready to give up the hope of spoils, if they could escape the ruin that encompassed them. Yet theirs was a comfortable lot to that of the besieged. Shut up in the cellars with the dead, pinched with famine, while the pestilence rioted without mercy and without resistance, they heard around them the incessant bursting of bombs, and thunder of artillery, and explosions of mines, and crash of falling houses, till the city shook, night and day, as within the grasp of an earthquake. Thousands fell daily, and the town was a mass of ruins. Yet, unconquered and apparently unconquerable, the inhabitants struggled on. Out of the dens they had made for themselves among the ruins, and from the cellars where there were more dead than living, men would crawl to fight, who looked more like spectres than warriors. Women would work the guns, and, musket in hand, advance fearlessly to the charge; and hundreds thus fell, fighting for their homes and their firesides. Amid this scene of devastation,—[103]against this prolonged and almost hopeless struggle of weeks,—against the pestilence that had appeared in his own army, and was mowing down his own troops,—and, above all, against the increased murmurs and now open clamors of the soldiers, declaring that the siege must be abandoned till reinforcements could come up,—Lannes remained unshaken and untiring. The incessant roar and crash around him, the fetid air, the exhausting toil, the carnage and the pestilence, could not change his iron will. He had decreed that Saragossa—which had heretofore baffled every attempt to take it—should fall. At length, by a vigorous attempt, he took the convent of St. Laran, in the suburbs of the town, and planted his artillery there, which soon levelled the city around it with the ground. To finish this work of destruction by one grand blow, he caused six mines to be run under the main street of the city, each of which was charged with three thousand pounds of powder. But before the time appointed for their explosion arrived, the town capitulated. The historians of this siege describe the appearance of the city and its inhabitants, after the surrender, as inconceivably horrible. With only a single wall between them and the enemy’s trenches, they had endured a siege of nearly two months by forty thousand men, and continued to resist after famine and pestilence began to slay faster than the enemy. Thirty thousand cannon-balls and sixty thousand bombs had fallen in the city, and fifty-four thousand of the inhabitants had perished.[104] Six thousand only had fallen in combat, while forty-eight thousand had been the prey of the pestilence. After the town had capitulated, but twelve thousand were found able to bear arms, and they looked more like spectres issuing from the tomb than like living warriors. “Saragossa was taken; but what a capture! As Lannes rode through the streets at the head of his victorious army, he looked only on a heap of ruins, while six thousand unburied corpses lay in his path. Sixteen thousand lay sick, while on the living famine had written more dreadful characters than death had traced on the fallen. Infants lay on the breasts of their dead mothers, striving in vain to draw life from bosoms that would never throb again. Attenuated forms, with haggard faces and sunken eyes and cheeks, wandered around among the dead to search for their friends; corpses, bloated with famine, lay stretched across the threshold of their dwellings, and strong-limbed men went staggering over the pavements, weak from want of food, or struck with the pestilence. Woe was in every street, and the silence in the dwellings was more eloquent than the loudest cries and groans. Death and famine and the pestilence had been there, in every variety of form and suffering. But the divine form of Liberty had been there too, walking amid those mountains of corpses and ruins of homes, shedding her light through the subterranean apartments of the wretched, and, with her cheering voice, animating the thrice-conquered,[105] yet still unconquered, to another effort, and blessing the dying as they prayed for their beloved city. But she was at last compelled to take her departure, and the bravest city of modern Europe sunk in bondage. Still her example lives, and shall live to the end of time, nerving the patriot to strike and suffer for his home and freedom, and teaching man everywhere how to die in defending the right. A wreath of glory surrounds the brow of Saragossa, fadeless as the memory of her brave defenders. Before their achievements,—the moral grandeur of their firm struggle, and the depth and intensity of their sufferings,—the bravery and perseverance of the French sink into forgetfulness. Yet theirs was no ordinary task, and it was by no ordinary means that it was executed.” THE ENGLISH LAND AT LISBON. The English had by no means relinquished their designs upon the Peninsula. The successes of Napoleon and his victorious army but served to stimulate their hatred of the French, and spur them on to further efforts. Another army was accordingly collected, and placed under the command of Sir Arthur Wellesley, who landed in Lisbon on the 22d of April, 1809. The force under his command was fourteen thousand five hundred infantry, fifteen hundred cavalry, and twenty-four pieces of artillery. The passage of the river Dwero was his first contest with the French. In this he was successful, and his success opened to him the gates of Oporto. Soon after occurred the celebrated battle of Talavera.[106] King Joseph was himself nominally at the head of his troops; but Marshal Victor was, in reality, the leader. Victor and Soult had both laid their plans before the king, and urged them with all the eloquence they were capable of. So sure was Victor of the victory, should his advice be followed, that he said that, if his plans should fail, all military science was useless. The event proved, however, that Soult was correct. BATTLE OF TALAVERA. “The morning dawned beautifully clear, but a July sun poured down its burning heat, until the soldiers were glad to seek shelter from its rays in the quiet shade. Between the camps of the two armies flowed a little murmuring rivulet, and, as the French and English met there to slake their thirst, pleasant words passed between them. Familiar conversation, the light laugh and the gay jest, were heard on every side. But, about one o’clock, the deep rolling of drums along the French lines announced to the allies that the hour had come when those who had met to slake their thirst in those quiet waters were soon to mingle to quell in blood their thirst for strife. They, too, prepared for combat; and, when the loud booming of the guns gave the signal that the battle was commenced, eighty cannon opened their destructive fire, and the light troops went sweeping onward with the rapidity of a thunder-cloud over the heavens, while the deep, dark columns marched sternly after, and charged, with terrible strength, the English lines. Then all along their fronts the deep-mouthed guns[107] opened their well-directed fire, and the infantry responded to the furious attack with their rapid volleys, as they closed around the head of the advancing columns, enveloping them in one sheet of flame, that streamed like billows along their sides. It was too much for human courage to endure; and, after bravely breasting the storm, they were obliged to fall back in disorder. “After various successes and reverses, the French seemed about to gain the day. The English centre was broken, and Victor’s columns marching triumphantly through it. Just at this juncture, when the English were scattering on every side, Colonel Donellan, anxious to save the honor of his army, was seen advancing through the disordered masses, at the head of the 48th regiment. The retiring masses on every side pressed hard against these brave soldiers, and it seemed, at first, as though they must be carried away by them; but, wheeling back by companies, they opened to let the fugitives pass, and then, pursuing their proud and beautiful line, they marched straight upon the pursuing columns on the right side, and poured their rapid fire into the dense ranks. Closing on the foe with steadiness and firmness, these few soldiers arrested the progress of the entire mass. Then their artillery opened its fire upon them, and the cavalry rallied, and rode round to charge their flanks; and, after a short and earnest warfare, the tide of success turned, and victory, which seemed a moment before in the hands of the French, was[108] wrested from their grasp, amid the loud shouts and earnest cheerings of the British. Their troops retired in good order to their former position, and at six o’clock the battle had closed. And now, as both parties were preparing to remove their wounded, and pay the last sad duties to the dead, one of those terrible events occurred which sometimes come to shock the human soul, and overrun a cup of misery already full. Hardly had the last troops withdrawn from the scene of contest, when the long dry grass took fire, and one broad flame swept furiously over the field, wrapping the dead and wounded together in its fiery mantle. The shrieks of the scorched and writhing victims, that struggled up through the thick folds of smoke that rolled darkly over them, were far more appalling than the uproar of battle, and carried consternation to every heart that heard. Two thousand men were killed on both sides, and eight thousand wounded.”[A] THE ENGLISH RETIRE INTO PORTUGAL. Soon after, the army effected a junction with Soult, and Sir Arthur Wellesley was obliged to retreat. He obtained, however, a promise from the Spanish general that the English wounded should be removed from the hospitals of Talavera to some other place. But this promise, like too many others, was shamefully violated; and he left the place, abandoning them all to the mercy of the enemy. When Victor entered the town, he found the public square covered with the sick and maimed of both armies, scattered [109]around on the pavement, without any one to care for them. He immediately sent his soldiers into the houses, commanding the inhabitants to receive the wounded sufferers. He ordered that one English and one French soldier should be lodged together,—thus softening the asperities of war, and setting an example to his foes which they would have done well to follow. If the Spanish had refused to care for the sick and wounded of their allies, they showed scarcely more consideration for the men on whose success their own safety depended. They refused to supply them with provisions. The soldiers were weakened by hunger, and the sick dying for want of necessary succor. Half a pound of wheat in the grain, and, twice a week, a few ounces of flour, with a quarter of a pound of goat’s flesh, formed the sole subsistence of men and officers. The goats were caught and killed by the troops; and it was so difficult to procure even these, that the mere offal of a goat would bring three or four dollars. Sir Arthur’s warm remonstrances to the Spanish junta were answered only by promises. The soldiers were murmuring at their bad treatment; and, when pestilence broke out in the army, and five thousand men died in their hospitals, Wellesley, deeming it useless to struggle longer against the force of circumstances, judged it best again to evacuate Spain, and withdraw his troops into Portugal. However lightly the English had, in anticipation, regarded the bravery of the French troops, experience—that stern and truthful monitor[110]—had taught them that they were an enemy not to be despised, and that Soult, their chief commander, was as skilful, and, as a tactician, fully equal to Wellington. Many English writers, in speaking of Wellington, have drawn a parallel between him and Napoleon, because he was commander-in-chief when the battle of Waterloo was won. Yet this long struggle between the English general and Soult, in Spain, in which he was as often defeated as conqueror, shows conclusively that the French and English commanders were well matched,—that there was little to choose between them; and who would think, even for a moment, of instituting a comparison of equality between Napoleon and Soult? We cannot follow the Spaniards, in all their operations, after the English forces had been withdrawn; marked, as they often were, by want of courage, and oftener by want of skill and foresight in their arrangements. The Partida warfare was now instituted, and many of the French troops were cut off in this way; yet the system was a decided injury to Spain. The heroic defence of Saragossa, already recorded, and the almost equally courageous one of Gerona, rise as bright spots on the dark page of Spanish history, and are well worthy of a name and place in this history. Most of the siege of Gerona we shall take the liberty to extract from Tucker’s Life of Wellington. SIEGE OF GERONA. Gerona is a city of Catalonia, situate on the little river Onar. It is protected by four forts, upon the high ground above it. Its principal defence, however,[111] was the citadel, called the Monjuie. This is a square fort, two hundred and forty yards in length on each side, with four bastions. The garrisons consisted of three thousand four hundred men, commanded by Mariano Alvarez,—a man at once noble, brave, and humane. Alvarez, who knew that he could place small dependence on reinforcements from without, gave every encouragement to the feelings of the citizens to defend their town to the last extremity. For this purpose, he formed them into eight companies of one hundred men each. Nor was the enthusiasm of the defence shared alone by the men. Maids and matrons also enrolled themselves in an association, which they termed the Company of St. Barbara, to perform whatever lay in their power. Alvarez knew full well the power which superstition would exert on the minds of the bigoted Spaniards. He, therefore, invested St. Narcis, the patron saint of the Geronans, with the insignia of generalissimo of all their forces, by land and by sea. This was done on the Sabbath; and the shrine of the saint was opened, and a general’s staff, a sword and richly-ornamented belt, were deposited with his holy relics. Such was the joy and excitement of the Spaniards, that one of their writers says, “It seemed as if the glory of the Lord had descended and filled the church, manifesting that their devotion was approved and blessed by heaven.” A proclamation was also issued by Alvarez, forbidding all persons, of whatever rank, from speaking[112] of capitulation, on pain of immediate death. This was received, both by the garrison and people, with acclamation. The city was closely invested by eighteen thousand French, under the command of General Verdier, on the 6th of May, on the heights of Casa Roca, where they erected a battery of eleven mortars, and began to form their first line of circumvallation. The garrison was too weak to make a sally, or otherwise prevent them. A flag of truce was sent, with the conditions on which the French would leave the city; but the only reply it drew forth was, that the Geronans would hold no communication with the French, but at the cannon’s mouth. At one o’clock on the morning of June 14th, the bombardment commenced. As soon as the first shell struck, the loud tones of the generale resounded through the streets, and every one flew to his post. The female Company of St. Barbara, so far from shrinking from danger, sought everywhere those spots where most was anticipated. What bravery or daring could do was done; yet two castles were yielded up, after a brave but vain resistance. Palamas was also carried by assault. Very few of the garrison escaped, and those only by throwing themselves into the sea. In July, three batteries kept up an incessant fire upon three sides of the Monjuie. By one of these discharges the angle on which the Spanish flag was planted was cut off, and the flag prostrated into the ditch below. In an instant, a man was lowered down from the walls to[113] regain it. Balls fell like hail around him; yet, apparently unmindful of the dangers to which he was exposed, he calmly descended, and, having recovered the prostrate banner, returned to his comrades unhurt, and again hoisted it on the walls. A breach was now made in the walls so wide that forty men might enter abreast. The works progressed with more rapidity, as the fire of the besieged had entirely ceased. It was not that Gerona was conquered, but, finding that their ammunition was growing short, they prudently reserved it until the nearer approach of the enemy should make it more efficient. On the morning of the 8th, about three o’clock, the French, under cover of a most tremendous bombardment, again assaulted the city. Six thousand men marched up to the breach, and endeavored to rush through; but, concealed there in the ruins of the ravelin, lay a mortar, which discharged five hundred musket-balls every shot. As they advanced, it was turned upon them, and their way was soon impeded by the slain. Three times during that day the assault was repeated, with the utmost resolution, by the assailants; and three times were they obliged to retire before the heroic defenders of Gerona, leaving sixteen hundred men lifeless on the field of battle. But the effect of that dreadful attack was severely felt by the besieged. The tower of St. Juan had been blown up, and only twenty-three of its brave little garrison remained alive. An instance of extraordinary heroism, in a youthful[114] drummer, which occurred during the assault, deserves to be recorded. His name was Luciana Ancio, and he belonged to the artillery. He was stationed to give the alarm, when a shell was thrown. A ball struck his leg off to the knee, and felled him to the ground. Some women, who saw him fall, hastened to remove him to a place of greater safety; but he refused, saying, “No, no! my arms are left, and I can still beat the drum to give my comrades warning in time to save themselves.” Heaven seemed to smile upon his bravery; for he alone, of all those who suffered an amputation of the thigh during the siege, recovered. The Company of St. Barbara were everywhere to be seen, covered with dust and blood, under the burning heat of a July sun. Those courageous women, through an incessant fire of the batteries and the musketry, carried water and wine to the soldiers, and bore back the wounded. Every day produced acts of heroism equally conspicuous, for the attack continued with unabated force. The sharp-shooters of the enemy were stationed thickly in the trenches; and so fatal was their aim, that for any of the garrison to be seen, only for a moment, was certain death. And, although the sentinels were changed every half-hour, nine were killed, in one day, at one post; and, after this, it was only possible to observe what the enemy were about, by some one in the force lifting up his head, and taking a momentary glance. Early in August, the besiegers had pushed their[115] parallels to the very edge of the fosse; but here their efforts were delayed, because the nature of the soil obliged them to bring earth from some distance to finish their works. About this time, Castellar de la Silva, at the head of fifteen hundred men, attempted to throw supplies into the city; but no precautions could escape the watchful eye of the besiegers. The convoy was seized, and only five hundred men, of the fifteen hundred who defended it, lived to tell the tale. The main attacks of the besiegers were now directed against the ravelin, which had become the chief defence of Monjuie. Attempts were made, night after night, to storm it; but in vain. It was mined, but, as the breastwork was wholly of earth, the explosion did no injury. A battery was planted against it, and a sally was made by the besieged, hoping to destroy it. This attack was headed by a priest. He was fired upon, and fell. One of the French officers, at the risk of his own life, protected him from further injury. But his humanity cost him his life. One of the Spaniards, mistaking his object, cut him down. The guns of the battery were spiked; but this brave attack was of little use, for the French were well supplied with artillery, and fresh guns were soon mounted, and played upon the gate and ravelin. For thirty-seven days had this fierce conflict been sustained. The numbers of the besieged were greatly reduced; the hospitals were filled to overflowing,[116] and pestilence, with all its horrors, spread unchecked, on every side. Yet this was not all. Grim, gaunt famine was among them, and began to be severely felt. Of all their stores, only some wheat and a little flour remained. Still, there was no thought of capitulation, although every day diminished their little stock. On the 19th of September, another general assault was made, and as bravely met. “Frequently,” says Southey, “such was the press of conflict, and such the passion that inspired them, that, impatient of the time required for reloading their muskets, the defendants caught up stones from the breach, and hurled upon their enemies these readier weapons.” Four times the assault was repeated in the course of two hours, and at every point the enemy was beaten off. The noble Alvarez, during the whole assault, hastened from post to post, wherever he was most needed, providing everything, directing all, and encouraging all. Eight hundred of the besiegers fell, on this memorable day. A glorious success had been gained, yet it brought with it no rest,—no respite,—scarcely a prolongation of hope. There was no wine to cheer the wearied soldiery, when they returned from the assault—not even bread. A scanty mess of pulse, or corn, with a little oil, or morsel of bacon, in its stead, was all that could be served out; and even this was the gift of families, who shared with the soldiers their little stores. “What matters it?” was the answer of these heroes to the lament of the inhabitants that they had nothing[117] better to give; “if the food fail, the joy of having saved Gerona will give us strength to go on.” Every day, every hour, added to the distress of the besieged. Their flour was exhausted, and, for want of other animal food, mules and horses were slaughtered, and sent to the shambles. A list was made of all within the city, and they were taken by lot. Fuel became exceedingly scarce; yet such was the patriotism of the people, that the heaps placed at the corners of the streets, to illuminate them in case of danger, remained untouched. A glimmering of hope still remained that the city might be supplied with provisions by the army of Blake; but even this faint hope was cut off when Marshal Augereau superseded St. Cyr in the control of the siege,—for his first act was to take possession of Haslatrich, at which place Blake had stored the greater part of his magazines. Augereau sent letters to the city threatening an increase of horrors in case the siege was prolonged, and offering them an armistice of a month, with provisions for that time, if Alvarez would then capitulate; but these terms were rejected with scorn. Hitherto, the few animals which had remained had been led out to feed near the burying-ground; but this was no longer possible, and the wretched animals gnawed the hair from each other’s bodies. The stores of the citizens were now exhausted, and the food for the hospitals was sometimes seized on the way, by the famishing populace. Provisions were prepared in the French camp, and held out to the garrison as a[118] temptation to desert; and yet, during the whole siege, only ten so deserted. At length, human nature could endure no more. The chief surgeon presented to Alvarez a report on the state of the city. It was, indeed, a fearful one. It stated that “not a single house remained in a habitable state” in Gerona. The people slept in cellars, and vaults, and holes, amid the ruins; and the wounded were often killed in the hospital by the enemy’s fire. The streets were broken up, so that the rain-water and sewers had stagnated, and their pestilential breath was rendered more noxious by the dead bodies which lay perishing in the ruins. The incessant thunder of artillery had affected the atmosphere, and vegetation had stopped. The fruit withered on the trees, and nothing would grow. Within the last three days, says the report, five hundred of the garrison alone have died in the hospitals, and the pestilence is still raging unchecked. “If, by these sacrifices,” say its authors, in conclusion, “deserving forever to be the admiration of history,—and if, by consummating them with the lives of us, who, by the will of Providence, have survived our comrades,—the liberty of our country can be secured, happy shall we be, in the bosom of eternity, and in the memory of all good men, and happy will be our children among their fellow-countrymen.” Alvarez himself could do no more. Yet would he not yield to the enemy; but, being seized with a delirious fever, his successor in command yielded the city[119] on honorable terms, on the 10th of December, the siege having lasted seven months. Alvarez died soon after, and the central junta awarded honors and titles to his family, and exempted the whole city from taxation. THE ENGLISH AT TORRES VEDRAS. The surrender of this devoted city closed the campaign for 1809. The principal events of the campaign of 1810 were the battle of Busaco, in which the English gained the victory, and the retreat of the French Marshal Massena. For four months and a half, Massena had continually followed the retreating forces of Wellington, until now he had retired beyond the lines of Torres Vedras. The English had been engaged on these lines a year, until they had at last rendered them almost impregnable. They consisted of three lines of intrenchments, one within another, extending for nearly thirty miles. On these lines were a hundred and fifty redoubts, and six hundred mounted cannon. Here Massena saw his enemy retire within these lines, and he then knew that his utmost efforts to dislodge him must prove abortive. Besides, Wellington here received reinforcements to his army, which increased it to one hundred and thirty thousand men. Besides these defences, there were twenty British ships of the line, and a hundred transports, ready to receive the army, if forced to retire. Unwilling to retreat, Massena sat down with his army here, hoping to draw Wellington to an open battle. But he preferred waiting for an attack upon his intrenchments,[120] or to starve the enemy into a retreat. This he knew must soon be done. Wellington himself declares that Massena provisioned his sixty thousand men and twenty thousand horses, for two months, where he could not have maintained a single division of English soldiers. But his army was now reduced to starvation; and he, driven to the last extremity, saw that he must either commence his retreat at once, or his famine-stricken army would be too weak to march. Arranging his troops into a compact mass, he placed the rear guard under the command of Ney, and retired from the Torres Vedras. Wellington immediately commenced the pursuit; but, owing to the skilful arrangements of the French marshal, he found it impossible to attack him with success. Taking advantage of every favorable position, he would make a stand, and wait until the main body of the army had passed on, and then would himself fall back. Thus, for more than four months, did this retreat continue, until he arrived at the confines of Portugal, having lost more than one-third of his army. Many were the cruelties practised on this retreat. They have often been described, and form a dark spot on the English historian’s page. All war is necessarily cruel; and the desolation and barrenness that followed in the track of the French army, wasting the inhabitants by famine, were a powerful check on Wellington in his pursuit. The track of a retreating and starving army must always be covered with woe; and one might as well complain[121] of the cruelty of a besieging force, because innocent women and children die by hunger. ESCAPE OF FRENCH PRISONERS. The siege of Cadiz occupied the spring and summer of this year. During this siege, a tremendous tempest ravaged the Spanish coast, lasting four days. By it more than forty sail of merchantmen, besides three line-of-battle ships, were driven on shore. It was during this tempest that the French and Swiss on board the prison-ships in the harbor made their escape. “The storm was so great,” writes one of the unhappy captives, “that we could not receive our supply of provision from the shore. Our signals of distress were wholly disregarded by the Spanish authorities; and, had it not been for the humanity of the British admiral, who sent his boats to their relief, many more of our miserable men must have perished.” The pontoons in which these prisoners were confined were not properly secured; and the prisoners on board the Castilla, seeing that the wind and tide were in their favor, cut the cable, and, hoisting a sail which they had made from their hammocks, steered for the opposite coast. They were seven hundred in number, and most of them officers. English boats were sent against them, but they found the French were prepared. The ballast of the vessel in which they were confined was cannon-balls of twenty-four and thirty-six pounds’ weight. These the French hurled by hand into the boats of their pursuers, and soon disabled them, so that the fugitives finally succeeded in escaping with but little loss. The first two months of the year 1811 were most inauspicious for the Spanish cause. General Suchet possessed himself of Tortosa, and on the 23d of the same month Soult became master of Olivenza. On the same day died the Marquis de la Romana, one of the most skilful and noblest of the Spanish leaders; and he had scarcely expired, before his army met with a signal defeat at Gebora.","sourceLink":"http://novel.tingroom.com/duanpian/2699/74207.html","bookId":1459,"book":{"id":1459,"title":"The Military Adventures of Charles O\u0027Neil","description":"简介： The history of times and events, of men and their characters, must ever be replete with interest and instruction. Chronicles of the great and wise, the noble and the learned, are often presented to the world; and the military hero and chieftain finds...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2699","creation":"Aug 1, 2019 12:25:09 AM","modification":"Aug 1, 2019 12:25:09 AM"}}
