{"id":90654,"no":3,"title":"Page 3","content":"HUGE HOTELS\\n\\n The next morning I was up early. I knew Aunt Tabby was not going to give up eas- ily and I wanted to keep an eye on her, so after breakfast I hung around the hall, pre- tending to count the spiders. Everything (even Aunt Tabby) was suspiciously quiet-- until there was a knock on the door. I rushed to open it, but Aunt Tabby, who had been lurking behind the clock, got there -21- first. She elbowed me out of the way (Aunt Tabby has really sharp elbows) and opened the door. Standing on the doorstep was a very styl- ish woman carrying a briefcase. I did not like the look of her one bit, so I did my best Fiendish Stare. I could tell it worked--she suddenly went very pale and gulped a bit like Brian used to. She opened and closed her mouth as though she had forgotten how to talk, and then she said in a squeaky voice, \"I--I\u0027ve come to see the house. On behalf of Huge Hotels Incorporated. \" Aunt Tabby looked thrilled. Drat, I thought. It was just my luck that this Huge Hotels person couldn\u0027t read. I stomped outside to check the sign, but it now said:\\n\\n This House Is -- NOT For Sale Hmm . . . Aunt Tabby was proving more tricky than I had expected. She was busy showing Huge Hotels around the hall when I clomped back inside. \"It\u0027s very odd, dear, \" Aunt Tabby said with a funny kind of smile. \"Someone changed the sign last night. I noticed it when Uncle Drac went to work. I wouldn\u0027t be surprised if it was one of those estate agents. Anyway, I\u0027ve fixed it now, don\u0027t you think?\"\\n\\n I didn\u0027t reply--there was no time to lose. I tore upstairs to my Friday bedroom and grabbed my Ghost Kit. I threw open the box and pulled out my white ghost sheet and emptied a bag of flour over it. Then I blew up a big balloon and put in one of my surprise- your-friends-with-a-strangled-ghost squealers. I held on to the neck of the balloon really tightly to stop the air escaping, then I put the floury sheet over my head so that it covered me and the balloon. I was ready. Soon I could hear Aunt Tabby clumping up the stairs in her big boots, followed by Huge Hotels\u0027s scared little clip-clop sounds. It was time to go. I opened my bedroom door, and in the old mirror on the landing I could see a small, fat, -24- dusty ghost shuffling out. I didn\u0027t look as scary as I had hoped, but it was pretty good. It was very difficult going down the attic stairs, but I managed to reach the bottom. Then I climbed onto the old chest by the landing window and hid behind the curtains. Yes! The ambush was set. I could hear Aunt Tabby and Huge Hotels Incorporated just along the corridor. Aunt Tabby was rattling on about how she personally liked the dripping taps in the bathroom, and Huge Hotels was muttering stuff to herself: \"Great potential . . . Old world charm . . . Theme hotel . . . \" We\u0027ll see about that, I thought. I jumped off the chest and let go of the squealer. Aiiieeeeeeeeeeeeeeeeee! It was great.\\n\\n Huge Hotels went totally pale. I could tell that she knew she had made a Big Mistake. She spun around and screamed. Really screamed. While she was screaming, I hung on to the curtains and waved my arms a lot so that the flour flew all over the place like a thick white mist. The strangled-ghost squealer was great--it kept on squealing and squealing--but just to make sure of things, I made some really horrible groans, too. Huge Hotels was not giving up easily. Her screams were amazing--really piercing-- and she didn\u0027t stop, not even to breathe. Aunt Tabby grabbed hold of Huge Hotels to try and calm her down, but Huge Hotels didn\u0027t want to calm down. No way. Just then some flour got stuck in my throat and made me choke a bit--well, quite a lot, actually--and that was when Huge Hotels stopped screaming and just stared at me, although she still had her mouth open like she wanted to scream.\\n\\n She started inching slowly backward along the corridor and went straight through one of the oldest cobwebs, where the biggest, hairiest spiders live--and I saw the biggest, hairiest spider of them all fall down her front. Huge Hotels let out a piercing shriek that made my ears ring. She tore down the stairs and was out of the front door in two seconds flat. I was impressed. \"That was fast, \" I said, throwing off my sheet and taking a breath of flour-free air. Aunt Tabby looked cross. \"Really, Araminta, what are you doing?\" she said. \"I don\u0027t know what\u0027s gotten into you. Is that my best self-rising flour you\u0027ve been using?\" \"Yes, \" I told her. \"But it didn\u0027t work. My feet didn\u0027t leave the ground once. \"\\n\\n Aunt Tabby tut-tutted and scooped up the spiders that had fallen off their cobwebs and gotten covered with flour. Then she carried Q them down to the kitchens to dust them off. I sat by the moldy curtains in the middle of a pile of flour and unwrapped my ghost sheet. Things were going well, I thought, but I knew Aunt Tabby was not going to give up that easily.\\n\\n That evening, after Aunt Tabby had read me a story from The Bedtime Ghouls and Ghosties Pink Storybook and gone downstairs to feed the boiler, I got up. I crept down the attic stairs and waited in the shadows outside Uncle Drac\u0027s turret. When the moon rose, the red door creaked open and Uncle Drac shuffled out. I watched him walk slowly down the stairs to the hall, -29- where Aunt Tabby was waiting with his ther- mos and sandwiches. She kissed him good-bye and waved him off to work. The front door closed quietly behind him, and Aunt Tabby dis- appeared back down to the basement. I slipped outside and changed the sign again. Now it said:This HAUNTED House Is -- NOT for Sale That was sure to do it. Who would want to buy a haunted house? \\n\\n","sourceLink":"https://allnovel.net/my-haunted-house-araminta-spook-1/page-3.html","bookId":2803,"book":{"id":2803,"title":"My Haunted House (Araminta Spook #1)","description":"Storyline: My Haunted House (Araminta Spook #1) \\n Araminta Spookie lives in a wonderful old haunted house, but her crabby aunt Tabby wants to move. Aunt Tabby is determined to sell their house—Araminta \"has\" to stop her! \\n With the help of a haunted suit of armor named Sir Horace, a ghost named Edmund, and a lot of imagination, Araminta hatches a plot for an Awful Ambush that is so ghoulish, it just might work!\\n","cover":"https://allnovel.net/images/my-haunted-house-araminta-spook-1.jpg","author":"Angie Sage","type":"Humorous","source":"allnovel","link":"https://allnovel.net/my-haunted-house-araminta-spook-1.html","creation":"Oct 5, 2019 9:01:31 AM","modification":"Oct 5, 2019 5:43:58 PM"}}
