{"id":26717,"no":117,"title":"Chapter V: That Amongst The European Nations Of Our Time","content":"That Amongst The European Nations Of Our Time The Power Of Governments Is Increasing, Although The Persons Who Govern Are Less Stable On reflecting upon what has already been said, the reader will be startled and alarmed to find that in Europe everything seems to conduce to the indefinite extension of the prerogatives of government, and to render all that enjoyed the rights of private independence more weak, more subordinate, and more precarious. The democratic nations of Europe have all the general and permanent tendencies which urge the Americans to the centralization of government, and they are moreover exposed to a number of secondary and incidental causes with which the Americans are unacquainted. It would seem as if every step they make towards equality brings them nearer to despotism. And indeed if we do but cast our looks around, we shall be convinced that such is the fact. During the aristocratic ages which preceded the present time, the sovereigns of Europe had been deprived of, or had relinquished, many of the rights inherent in their power. Not a hundred years ago, amongst the greater part of European nations, numerous private persons and corporations were sufficiently independent to administer justice, to raise and maintain troops, to levy taxes, and frequently even to make or interpret the law. The State has everywhere resumed to itself alone these natural attributes of sovereign power; in all matters of government the State tolerates no intermediate agent between itself and the people, and in general business it directs the people by its own immediate influence. I am far from blaming this concentration of power, I simply point it out. At the same period a great number of secondary powers existed in Europe, which represented local interests and administered local affairs. Most of these local authorities have already disappeared; all are speedily tending to disappear, or to fall into the most complete dependence. From one end of Europe to the other the privileges of the nobility, the liberties of cities, and the powers of provincial bodies, are either destroyed or upon the verge of destruction. Europe has endured, in the course of the last half-century, many revolutions and counter-revolutions which have agitated it in opposite directions: but all these perturbations resemble each other in one respect—they have all shaken or destroyed the secondary powers of government. The local privileges which the French did not abolish in the countries they conquered, have finally succumbed to the policy of the princes who conquered the French. Those princes rejected all the innovations of the French Revolution except centralization: that is the only principle they consented to receive from such a source. My object is to remark, that all these various rights, which have been successively wrested, in our time, from classes, corporations, and individuals, have not served to raise new secondary powers on a more democratic basis, but have uniformly been concentrated in the hands of the sovereign. Everywhere the State acquires more and more direct control over the humblest members of the community, and a more exclusive power of governing each of them in his smallest concerns. *a Almost all the charitable establishments of Europe were formerly in the hands of private persons or of corporations; they are now almost all dependent on the supreme government, and in many countries are actually administered by that power. The State almost exclusively undertakes to supply bread to the hungry, assistance and shelter to the sick, work to the idle, and to act as the sole reliever of all kinds of misery. Education, as well as charity, is become in most countries at the present day a national concern. The State receives, and often takes, the child from the arms of the mother, to hand it over to official agents: the State undertakes to train the heart and to instruct the mind of each generation. Uniformity prevails in the courses of public instruction as in everything else; diversity, as well as freedom, is disappearing day by day. Nor do I hesitate to affirm, that amongst almost all the Christian nations of our days, Catholic as well as Protestant, religion is in danger of falling into the hands of the government. Not that rulers are over-jealous of the right of settling points of doctrine, but they get more and more hold upon the will of those by whom doctrines are expounded; they deprive the clergy of their property, and pay them by salaries; they divert to their own use the influence of the priesthood, they make them their own ministers—often their own servants—and by this alliance with religion they reach the inner depths of the soul of man. *b a [ This gradual weakening of individuals in relation to society at large may be traced in a thousand ways. I shall select from amongst these examples one derived from the law of wills. In aristocracies it is common to profess the greatest reverence for the last testamentary dispositions of a man; this feeling sometimes even became superstitious amongst the older nations of Europe: the power of the State, far from interfering with the caprices of a dying man, gave full force to the very least of them, and insured to him a perpetual power. When all living men are enfeebled, the will of the dead is less respected: it is circumscribed within a narrow range, beyond which it is annulled or checked by the supreme power of the laws. In the Middle Ages, testamentary power had, so to speak, no limits: amongst the French at the present day, a man cannot distribute his fortune amongst his children without the interference of the State; after having domineered over a whole life, the law insists upon regulating the very last act of it.] b [ In proportion as the duties of the central power are augmented, the number of public officers by whom that power is represented must increase also. They form a nation in each nation; and as they share the stability of the government, they more and more fill up the place of an aristocracy. In almost every part of Europe the government rules in two ways; it rules one portion of the community by the fear which they entertain of its agents, and the other by the hope they have of becoming its agents.] But this is as yet only one side of the picture. The authority of government has not only spread, as we have just seen, throughout the sphere of all existing powers, till that sphere can no longer contain it, but it goes further, and invades the domain heretofore reserved to private independence. A multitude of actions, which were formerly entirely beyond the control of the public administration, have been subjected to that control in our time, and the number of them is constantly increasing. Amongst aristocratic nations the supreme government usually contented itself with managing and superintending the community in whatever directly and ostensibly concerned the national honor; but in all other respects the people were left to work out their own free will. Amongst these nations the government often seemed to forget that there is a point at which the faults and the sufferings of private persons involve the general prosperity, and that to prevent the ruin of a private individual must sometimes be a matter of public importance. The democratic nations of our time lean to the opposite extreme. It is evident that most of our rulers will not content themselves with governing the people collectively: it would seem as if they thought themselves responsible for the actions and private condition of their subjects—as if they had undertaken to guide and to instruct each of them in the various incidents of life, and to secure their happiness quite independently of their own consent. On the other hand private individuals grow more and more apt to look upon the supreme power in the same light; they invoke its assistance in all their necessities, and they fix their eyes upon the administration as their mentor or their guide. I assert that there is no country in Europe in which the public administration has not become, not only more centralized, but more inquisitive and more minute it everywhere interferes in private concerns more than it did; it regulates more undertakings, and undertakings of a lesser kind; and it gains a firmer footing every day about, above, and around all private persons, to assist, to advise, and to coerce them. Formerly a sovereign lived upon the income of his lands, or the revenue of his taxes; this is no longer the case now that his wants have increased as well as his power. Under the same circumstances which formerly compelled a prince to put on a new tax, he now has recourse to a loan. Thus the State gradually becomes the debtor of most of the wealthier members of the community, and centralizes the largest amounts of capital in its own hands. Small capital is drawn into its keeping by another method. As men are intermingled and conditions become more equal, the poor have more resources, more education, and more desires; they conceive the notion of bettering their condition, and this teaches them to save. These savings are daily producing an infinite number of small capitals, the slow and gradual produce of labor, which are always increasing. But the greater part of this money would be unproductive if it remained scattered in the hands of its owners. This circumstance has given rise to a philanthropic institution, which will soon become, if I am not mistaken, one of our most important political institutions. Some charitable persons conceived the notion of collecting the savings of the poor and placing them out at interest. In some countries these benevolent associations are still completely distinct from the State; but in almost all they manifestly tend to identify themselves with the government; and in some of them the government has superseded them, taking upon itself the enormous task of centralizing in one place, and putting out at interest on its own responsibility, the daily savings of many millions of the working classes. Thus the State draws to itself the wealth of the rich by loans, and has the poor man\u0027s mite at its disposal in the savings banks. The wealth of the country is perpetually flowing around the government and passing through its hands; the accumulation increases in the same proportion as the equality of conditions; for in a democratic country the State alone inspires private individuals with confidence, because the State alone appears to be endowed with strength and durability. *c Thus the sovereign does not confine himself to the management of the public treasury; he interferes in private money matters; he is the superior, and often the master, of all the members of the community; and, in addition to this, he assumes the part of their steward and paymaster. c [ On the one hand the taste for worldly welfare is perpetually increasing, and on the other the government gets more and more complete possession of the sources of that welfare. Thus men are following two separate roads to servitude: the taste for their own welfare withholds them from taking a part in the government, and their love of that welfare places them in closer dependence upon those who govern.] The central power not only fulfils of itself the whole of the duties formerly discharged by various authorities—extending those duties, and surpassing those authorities—but it performs them with more alertness, strength, and independence than it displayed before. All the governments of Europe have in our time singularly improved the science of administration: they do more things, and they do everything with more order, more celerity, and at less expense; they seem to be constantly enriched by all the experience of which they have stripped private persons. From day to day the princes of Europe hold their subordinate officers under stricter control, and they invent new methods for guiding them more closely, and inspecting them with less trouble. Not content with managing everything by their agents, they undertake to manage the conduct of their agents in everything; so that the public administration not only depends upon one and the same power, but it is more and more confined to one spot and concentrated in the same hands. The government centralizes its agency whilst it increases its prerogative—hence a twofold increase of strength. In examining the ancient constitution of the judicial power, amongst most European nations, two things strike the mind—the independence of that power, and the extent of its functions. Not only did the courts of justice decide almost all differences between private persons, but in very many cases they acted as arbiters between private persons and the State. I do not here allude to the political and administrative offices which courts of judicature had in some countries usurped, but the judicial office common to them all. In most of the countries of Europe, there were, and there still are, many private rights, connected for the most part with the general right of property, which stood under the protection of the courts of justice, and which the State could not violate without their sanction. It was this semi-political power which mainly distinguished the European courts of judicature from all others; for all nations have had judges, but all have not invested their judges with the same privileges. Upon examining what is now occurring amongst the democratic nations of Europe which are called free, as well as amongst the others, it will be observed that new and more dependent courts are everywhere springing up by the side of the old ones, for the express purpose of deciding, by an extraordinary jurisdiction, such litigated matters as may arise between the government and private persons. The elder judicial power retains its independence, but its jurisdiction is narrowed; and there is a growing tendency to reduce it to be exclusively the arbiter between private interests. The number of these special courts of justice is continually increasing, and their functions increase likewise. Thus the government is more and more absolved from the necessity of subjecting its policy and its rights to the sanction of another power. As judges cannot be dispensed with, at least the State is to select them, and always to hold them under its control; so that, between the government and private individuals, they place the effigy of justice rather than justice itself. The State is not satisfied with drawing all concerns to itself, but it acquires an ever-increasing power of deciding on them all without restriction and without appeal. *d d [ A strange sophism has been made on this head in France. When a suit arises between the government and a private person, it is not to be tried before an ordinary judge—in order, they say, not to mix the administrative and the judicial powers; as if it were not to mix those powers, and to mix them in the most dangerous and oppressive manner, to invest the government with the office of judging and administering at the same time.] There exists amongst the modern nations of Europe one great cause, independent of all those which have already been pointed out, which perpetually contributes to extend the agency or to strengthen the prerogative of the supreme power, though it has not been sufficiently attended to: I mean the growth of manufactures, which is fostered by the progress of social equality. Manufactures generally collect a multitude of men of the same spot, amongst whom new and complex relations spring up. These men are exposed by their calling to great and sudden alternations of plenty and want, during which public tranquillity is endangered. It may also happen that these employments sacrifice the health, and even the life, of those who gain by them, or of those who live by them. Thus the manufacturing classes require more regulation, superintendence, and restraint than the other classes of society, and it is natural that the powers of government should increase in the same proportion as those classes. This is a truth of general application; what follows more especially concerns the nations of Europe. In the centuries which preceded that in which we live, the aristocracy was in possession of the soil, and was competent to defend it: landed property was therefore surrounded by ample securities, and its possessors enjoyed great independence. This gave rise to laws and customs which have been perpetuated, notwithstanding the subdivision of lands and the ruin of the nobility; and, at the present time, landowners and agriculturists are still those amongst the community who must easily escape from the control of the supreme power. In these same aristocratic ages, in which all the sources of our history are to be traced, personal property was of small importance, and those who possessed it were despised and weak: the manufacturing class formed an exception in the midst of those aristocratic communities; as it had no certain patronage, it was not outwardly protected, and was often unable to protect itself. Hence a habit sprung up of considering manufacturing property as something of a peculiar nature, not entitled to the same deference, and not worthy of the same securities as property in general; and manufacturers were looked upon as a small class in the bulk of the people, whose independence was of small importance, and who might with propriety be abandoned to the disciplinary passions of princes. On glancing over the codes of the middle ages, one is surprised to see, in those periods of personal independence, with what incessant royal regulations manufactures were hampered, even in their smallest details: on this point centralization was as active and as minute as it can ever be. Since that time a great revolution has taken place in the world; manufacturing property, which was then only in the germ, has spread till it covers Europe: the manufacturing class has been multiplied and enriched by the remnants of all other ranks; it has grown and is still perpetually growing in number, in importance, in wealth. Almost all those who do not belong to it are connected with it at least on some one point; after having been an exception in society, it threatens to become the chief, if not the only, class; nevertheless the notions and political precedents engendered by it of old still cling about it. These notions and these precedents remain unchanged, because they are old, and also because they happen to be in perfect accordance with the new notions and general habits of our contemporaries. Manufacturing property then does not extend its rights in the same ratio as its importance. The manufacturing classes do not become less dependent, whilst they become more numerous; but, on the contrary, it would seem as if despotism lurked within them, and naturally grew with their growth. *e As a nation becomes more engaged in manufactures, the want of roads, canals, harbors, and other works of a semi-public nature, which facilitate the acquisition of wealth, is more strongly felt; and as a nation becomes more democratic, private individuals are less able, and the State more able, to execute works of such magnitude. I do not hesitate to assert that the manifest tendency of all governments at the present time is to take upon themselves alone the execution of these undertakings; by which means they daily hold in closer dependence the population which they govern. e [ I shall quote a few facts in corroboration of this remark. Mines are the natural sources of manufacturing wealth: as manufactures have grown up in Europe, as the produce of mines has become of more general importance, and good mining more difficult from the subdivision of property which is a consequence of the equality of conditions, most governments have asserted a right of owning the soil in which the mines lie, and of inspecting the works; which has never been the case with any other kind of property. Thus mines, which were private property, liable to the same obligations and sheltered by the same guarantees as all other landed property, have fallen under the control of the State. The State either works them or farms them; the owners of them are mere tenants, deriving their rights from the State; and, moreover, the State almost everywhere claims the power of directing their operations: it lays down rules, enforces the adoption of particular methods, subjects the mining adventurers to constant superintendence, and, if refractory, they are ousted by a government court of justice, and the government transfers their contract to other hands; so that the government not only possesses the mines, but has all the adventurers in its power. Nevertheless, as manufactures increase, the working of old mines increases also; new ones are opened, the mining population extends and grows up; day by day governments augment their subterranean dominions, and people them with their agents.] On the other hand, in proportion as the power of a State increases, and its necessities are augmented, the State consumption of manufactured produce is always growing larger, and these commodities are generally made in the arsenals or establishments of the government. Thus, in every kingdom, the ruler becomes the principal manufacturer; he collects and retains in his service a vast number of engineers, architects, mechanics, and handicraftsmen. Not only is he the principal manufacturer, but he tends more and more to become the chief, or rather the master of all other manufacturers. As private persons become more powerless by becoming more equal, they can effect nothing in manufactures without combination; but the government naturally seeks to place these combinations under its own control. It must be admitted that these collective beings, which are called combinations, are stronger and more formidable than a private individual can ever be, and that they have less of the responsibility of their own actions; whence it seems reasonable that they should not be allowed to retain so great an independence of the supreme government as might be conceded to a private individual. Rulers are the more apt to follow this line of policy, as their own inclinations invite them to it. Amongst democratic nations it is only by association that the resistance of the people to the government can ever display itself: hence the latter always looks with ill-favor on those associations which are not in its own power; and it is well worthy of remark, that amongst democratic nations, the people themselves often entertain a secret feeling of fear and jealousy against these very associations, which prevents the citizens from defending the institutions of which they stand so much in need. The power and the duration of these small private bodies, in the midst of the weakness and instability of the whole community, astonish and alarm the people; and the free use which each association makes of its natural powers is almost regarded as a dangerous privilege. All the associations which spring up in our age are, moreover, new corporate powers, whose rights have not been sanctioned by time; they come into existence at a time when the notion of private rights is weak, and when the power of government is unbounded; hence it is not surprising that they lose their freedom at their birth. Amongst all European nations there are some kinds of associations which cannot be formed until the State has examined their by-laws, and authorized their existence. In several others, attempts are made to extend this rule to all associations; the consequences of such a policy, if it were successful, may easily be foreseen. If once the sovereign had a general right of authorizing associations of all kinds upon certain conditions, he would not be long without claiming the right of superintending and managing them, in order to prevent them from departing from the rules laid down by himself. In this manner, the State, after having reduced all who are desirous of forming associations into dependence, would proceed to reduce into the same condition all who belong to associations already formed—that is to say, almost all the men who are now in existence. Governments thus appropriate to themselves, and convert to their own purposes, the greater part of this new power which manufacturing interests have in our time brought into the world. Manufacturers govern us—they govern manufactures. I attach so much importance to all that I have just been saying, that I am tormented by the fear of having impaired my meaning in seeking to render it more clear. If the reader thinks that the examples I have adduced to support my observations are insufficient or ill-chosen—if he imagines that I have anywhere exaggerated the encroachments of the supreme power, and, on the other hand, that I have underrated the extent of the sphere which still remains open to the exertions of individual independence, I entreat him to lay down the book for a moment, and to turn his mind to reflect for himself upon the subjects I have attempted to explain. Let him attentively examine what is taking place in France and in other countries—let him inquire of those about him—let him search himself, and I am much mistaken if he does not arrive, without my guidance, and by other paths, at the point to which I have sought to lead him. He will perceive that for the last half-century, centralization has everywhere been growing up in a thousand different ways. Wars, revolutions, conquests, have served to promote it: all men have labored to increase it. In the course of the same period, during which men have succeeded each other with singular rapidity at the head of affairs, their notions, interests, and passions have been infinitely diversified; but all have by some means or other sought to centralize. This instinctive centralization has been the only settled point amidst the extreme mutability of their lives and of their thoughts. If the reader, after having investigated these details of human affairs, will seek to survey the wide prospect as a whole, he will be struck by the result. On the one hand the most settled dynasties shaken or overthrown—the people everywhere escaping by violence from the sway of their laws—abolishing or limiting the authority of their rulers or their princes—the nations, which are not in open revolution, restless at least, and excited—all of them animated by the same spirit of revolt: and on the other hand, at this very period of anarchy, and amongst these untractable nations, the incessant increase of the prerogative of the supreme government, becoming more centralized, more adventurous, more absolute, more extensive—the people perpetually falling under the control of the public administration—led insensibly to surrender to it some further portion of their individual independence, till the very men, who from time to time upset a throne and trample on a race of kings, bend more and more obsequiously to the slightest dictate of a clerk. Thus two contrary revolutions appear in our days to be going on; the one continually weakening the supreme power, the other as continually strengthening it: at no other period in our history has it appeared so weak or so strong. But upon a more attentive examination of the state of the world, it appears that these two revolutions are intimately connected together, that they originate in the same source, and that after having followed a separate course, they lead men at last to the same result. I may venture once more to repeat what I have already said or implied in several parts of this book: great care must be taken not to confound the principle of equality itself with the revolution which finally establishes that principle in the social condition and the laws of a nation: here lies the reason of almost all the phenomena which occasion our astonishment. All the old political powers of Europe, the greatest as well as the least, were founded in ages of aristocracy, and they more or less represented or defended the principles of inequality and of privilege. To make the novel wants and interests, which the growing principle of equality introduced, preponderate in government, our contemporaries had to overturn or to coerce the established powers. This led them to make revolutions, and breathed into many of them, that fierce love of disturbance and independence, which all revolutions, whatever be their object, always engender. I do not believe that there is a single country in Europe in which the progress of equality has not been preceded or followed by some violent changes in the state of property and persons; and almost all these changes have been attended with much anarchy and license, because they have been made by the least civilized portion of the nation against that which is most civilized. Hence proceeded the two-fold contrary tendencies which I have just pointed out. As long as the democratic revolution was glowing with heat, the men who were bent upon the destruction of old aristocratic powers hostile to that revolution, displayed a strong spirit of independence; but as the victory or the principle of equality became more complete, they gradually surrendered themselves to the propensities natural to that condition of equality, and they strengthened and centralized their governments. They had sought to be free in order to make themselves equal; but in proportion as equality was more established by the aid of freedom, freedom itself was thereby rendered of more difficult attainment. These two states of a nation have sometimes been contemporaneous: the last generation in France showed how a people might organize a stupendous tyranny in the community, at the very time when they were baffling the authority of the nobility and braving the power of all kings—at once teaching the world the way to win freedom, and the way to lose it. In our days men see that constituted powers are dilapidated on every side—they see all ancient authority gasping away, all ancient barriers tottering to their fall, and the judgment of the wisest is troubled at the sight: they attend only to the amazing revolution which is taking place before their eyes, and they imagine that mankind is about to fall into perpetual anarchy: if they looked to the final consequences of this revolution, their fears would perhaps assume a different shape. For myself, I confess that I put no trust in the spirit of freedom which appears to animate my contemporaries. I see well enough that the nations of this age are turbulent, but I do not clearly perceive that they are liberal; and I fear lest, at the close of those perturbations which rock the base of thrones, the domination of sovereigns may prove more powerful than it ever was before.","sourceLink":"http://novel.tingroom.com/duanpian/2870/79414.html","bookId":1178,"book":{"id":1178,"title":"Democracy In America","description":"简介： In the eleven years that separated the Declaration of the Independence of the United States from the completion of that act in the ordination of our written Constitution, the great minds of America were bent upon the study of the principles of govern...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2870","creation":"Aug 1, 2019 12:24:34 AM","modification":"Aug 1, 2019 12:24:34 AM"}}
