{"id":15513,"no":16,"title":"CHAPTER XV. BOOKS","content":"The London express rolled with stately deliberation into Brayport station. Mr. Bodery folded up his newspapers, reached down his bag from the netting, and prepared to alight. The editor of the Beacon had enjoyed a very pleasant journey, despite broiling sun and searching dust. He knew the possibilities of a first-class smoking-carriage—how to regulate the leeward window and chock off the other with a wooden match borrowed from the guard. He stepped from the carriage with the laboured sprightliness of a man past the forties, and a moment later Sidney Carew was at his side. “Mr. Bodery?” “The same. You are no doubt Mr. Carew?” “Yes. Thanks for coming. Hope it didn\u0027t inconvenience you?” “Not at all,” replied the editor, breaking his return ticket. “D——n!” said Sidney suddenly. He was beginning to rise to the occasion. He was one of those men who are usually too slack to burthen their souls with a refreshing expletive. “What is the matter?” inquired Mr. Bodery gravely. “There is a man,” explained Sidney hurriedly, “getting out of the train who is coming to stay with us. I had forgotten his existence. Don\u0027t look round!” Mr. Bodery was a Londoner. He did not look round. Nine out of ten country-bred people would have indulged in a stare. “Is this all your luggage?” continued Sidney abruptly. He certainly was rising. “Yes.” “Then come along. We\u0027ll bolt for it. He\u0027ll have to get a fly, and that means ten minutes\u0027 start if the porter is not officious and mulls things.” They hurried out of the station and clambered into the dog-cart. Sidney gathered up the reins. “Hang it,” he exclaimed. “What bad luck! There is a fly waiting. It is never there when you want it.” Mr. Bodery looked between the shafts. “You need not be afraid of that fly,” he said. “No—come up, you brute!” Mr. Bodery turned carelessly to put his bag in the back of the cart. “Let him have it,” he exclaimed in a low voice. “Your friend sees you, but he does not know that you have seen him. He is pointing you out to the station-master.” As he spoke the cart swung round the gate-post of the station yard, nearly throwing him out, and Sidney\u0027s right hand felt for the whip-socket. “There,” he said, “we are safe. I think I can manage that fly.” Mr. Bodery settled himself and drew the dust-cloth over his chubby knees. “Now,” he said, “tell me all about Vellacott.” Sidney did so. He gave a full and minute description of events previous to Christian Vellacott\u0027s disappearance, omitting nothing. The relation was somewhat disjointed, somewhat vague in parts, and occasionally incoherent. The narrator repeated himself—hesitated—blurted out some totally irrelevant fact, and finished up with a vague supposition (possessing a solid basis of truth) expressed in doubtful English. It suited Mr. Bodery admirably. In telling all about Vellacott, Sidney unconsciously told all about Mrs. Carew, Molly, Hilda, and himself. When he reached the point in his narration telling how Vellacott had been attracted into the garden, he became extremely vague and his style notably colloquial. Tell the story how he would, he felt that he could not prevent Mr. Bodery from drawing his own inferences. Young ladies are not in the habit of whistling for youthful members of the opposite sex. Few of them master the labial art, which perhaps accounts for much. Sidney Carew was conscious that his style lacked grace and finish. Mr. Bodery did draw his own inferences, but the countenance into which Sidney glanced at intervals was one of intense stolidity. “Well, I confess I cannot make it out—at present,” he said; “Vellacott has written to us only on business matters. We publish to-morrow a very good article of his purporting to be the dream of an overworked attaché. It is very cutting and very incriminating. The Government cannot well avoid taking some notice of it. My only hope is that he is in Paris. There is something brewing over there. Our Paris agent wired for Vellacott this morning. By the way, Mr. Carew, is there a monastery somewhere in this part of the country?” “Down that valley,” replied Sidney, pointing with his whip. “In Vellacott\u0027s article there is mention of a monastery—not too minutely described, however. There are also some remarkable suppositions respecting an old foreigner living in seclusion. Could that be the man you mentioned just now—Signor Bruno?” “Hardly. Bruno is a harmless old soul,” replied Sidney, pulling up to turn into the narrow gateway. There was no time to make further inquiries. Sidney led the way into the drawing-room. The ladies were there. “My mother, Mr. Bodery—my sister; my sister Hilda,” he blurted out awkwardly. Mrs. Carew shook hands, and the two young ladies bowed. They were all disappointed in Mr. Bodery. He was too calm and comfortable—also there was a suggestion of cigar smoke in his presence, which jarred. “I am sorry,” said the Londoner, with genial self-possession, “to owe the pleasure of this visit to such an unfortunate incident.” Molly felt that she hated him. “Then you have heard nothing of Christian?” said Mrs. Carew. “Nothing,” replied Mr. Bodery, removing his tight gloves. “But it is too soon to think of getting anxious yet. Vellacott is eminently capable of taking care of himself—he is, above all things, a journalist. Things are disturbed in Paris, and it is possible that he has run across there.” Mrs. Carew smiled somewhat incredulously. “It was a singular time to start,” observed Hilda quietly. Mr. Bodery turned and looked at her. “Master mind in this house,” he reflected. “Yes,” he admitted aloud. He folded his gloves and placed them in the pocket of his coat. The others watched him in silence. “Do you take sugar and cream?” inquired Hilda sweetly, speaking for the second time. “Please—both. In moderation.” “I say,” interrupted Sidney at this moment, “the Vicomte d\u0027Audierne is following us in a fly. He will be here in five minutes.” Mrs. Carew nodded. She had not forgotten this guest. “The Vicomte d\u0027Audierne,” said Mr. Bodery, with considerable interest, turning away from the tea-table, cup in hand. “Is that the man who got out of my train?” “Yes,” replied Sidney; “do you know him?” “I have heard of him.” Mr. Bodery turned and took a slice of bread and butter from a plate which Hilda held. At this moment there was a rumble of carriage wheels. “By the way,” said the editor of the Beacon, raising his voice so as to command universal attention, “do not tell the Vicomte d\u0027Audierne about Vellacott. Do not let him know that Vellacott has been here. Do not tell him of my connection with the Beacon.” The ladies barely had time to reconsider their first impression of Mr. Bodery when the door was thrown open, and a servant announced M. d\u0027Audierne. He who entered immediately afterwards—with an almost indecent haste—was of middle height, with a certain intrepid carriage of the head which appeals to such as take pleasure in the strength and endurance of men. His face, which was clean shaven, was the face of a hawk, with the contracted myope vision characteristic of that bird. It is probable that from the threshold he took in every occupant of the room. “Mrs. Carew,” he said in a pleasant voice, speaking almost faultless English, “after all these years. What a pleasure!” He shook hands, turning at the same time to the others. “And Sid,” he said, “and Molly—wicked little Molly. Never mind—your antecedents are safe. I am silent as the grave.” This was not strictly true. He was as deep, and deeper than the resting-place mentioned, but his method was superior to silence. “And Hilda,” he continued, “thoughtful little Hilda, who was always too busy to be naughty. Not like Molly, eh?” “Heavens! How old it makes one feel!” he exclaimed, turning to Mrs. Carew. The lady laughed. “You are not changed, at all events,” she said. “Allow me to introduce Mr. Bodery—the Vicomte d\u0027Audierne.” The two men bowed. “Much pleasure,” said the Frenchman. Mr. Bodery bowed again in an insular manner, which just escaped awkwardness, and said nothing. Then Molly offered the new-comer some tea, and the party broke up into groups. But the Vicomte\u0027s personality in some subtle manner pervaded the room. Mr. Bodery lapsed into monosyllables and felt ponderous. Monsieur d\u0027Audierne had it in his power to make most men feel ponderous when the spirit moved him in that direction. As soon as tea was finally disposed of Mrs. Carew proposed an adjournment to the garden. She was desirous of getting Mr. Bodery to herself. It fell to Hilda\u0027s lot to undertake the Frenchman. They had been great friends once, and she was quite ready to renew the pleasant relationship. She led her guest to the prettiest part of the garden—the old overgrown footpath around the moat. As soon as they had passed under the nut-trees into the open space at the edge of the water, the Vicomte d\u0027Audierne stopped short and looked round him curiously. At the same time he gave a strange little laugh. “Hein—hein—c\u0027est dr?le,” he muttered, and the girl remembered that in the old friendship between the brilliant, middle-aged diplomatist and the little child they had always spoken French. She liked to hear him speak his own language, for in his lips it received full justice: it was the finest tongue spoken on this earth. But she did not feel disposed just then to humour him. She looked at him wonderingly as his deep eyes wandered over the scene. While they stood there, something—probably a kestrel—disturbed the rooks dwelling in the summits of the still elms across the moat, and they rose simultaneously in the air with long-drawn cries. “Ah! Ah—h!” said the Vicomte, with a singular smile. And then Hilda forgot her shyness. “What is it?” she inquired in the language she had always spoken to this man. He turned and walked beside her, suiting his steps to hers, for some moments before replying. “I was not here at all,” he said at length, apologetically; “I was far away from you. It was impolite. I am sorry.” He intended that she should laugh, and she did so softly. “Where were you?” she inquired, glancing at him beneath her golden lashes. Again he paused. “There is,” he said at length, “an old chateau in Morbihan—many miles from a railway—in the heart of a peaceful country. It has a moat like this—there are elms—there are rooks that swing up into the air like that and call—and one does not know why they do it, and what they are calling. Listen, little girl—they are calling something. What is it? I think I was there. It was impolite—I am sorry, Miss Carew.” She laughed again sympathetically and without mirth; for she was meant to laugh. He looked back over his shoulder at times as if the calling of the rooks jarred upon his nerves. “I do not think I like them—” he said, “now.” He was not apparently disposed to be loquacious as he had been at first. Possibly the rooks had brought about this change. Hilda also had her thoughts. At times she glanced at the water with a certain shrinking in her heart. She had not yet forgotten the moments she had passed at the edge of the moat the night before. They walked right round the moat and down a little pathway through the elm wood without speaking. The rooks had returned to their nests and only called to each other querulously at intervals. “Has it ever occurred to you, little girl,” said the Vicomte d\u0027Audierne suddenly, “to doubt the wisdom of the Creator\u0027s arrangements for our comfort, or otherwise, here below?” “I suppose not,” he went on, without waiting for an answer, which she remembered as an old trick of his. “You are a woman—it is different for you.” The girl said nothing. She may have thought differently; one cannot always read a maiden\u0027s thoughts. They walked on together. Suddenly the Vicomte d\u0027Audierne spoke. “Who is this?” he said. Hilda followed the direction of his eyes. “That,” she answered, “is Signor Bruno. An old Italian exile. A friend of ours.” Bruno came forward, hat in hand, bowing and smiling in his charming way. Hilda introduced the two men, speaking in French. “I did not know,” said Signor Bruno, with outspread hands, “that you spoke French like a Frenchwoman.” Hilda laughed. “Had it,” she said, with a sudden inspiration, “been Italian, I should have told you.” There was a singular smile visible, for a moment only, in the eyes of the Vicomte d\u0027Audierne, and then he spoke. “Mademoiselle,” he said, “learnt most of it from me. We are old friends.” Signor Bruno bowed. He did not look too well pleased. “Ah—but is that so?” he murmured conversationally. “Yes; I hope she learnt nothing else from me,” replied the Vicomte carelessly. Hilda turned upon him with a questioning smile. “Why?” “I do not imagine, little girl,” replied d\u0027Audierne, “that you could learn very much that is good from me.” Hilda gave a non-committing little laugh, and led the way through the nut-trees towards the house. The Vicomte d\u0027Audierne followed, and Signor Bruno came last. When they emerged upon the lawn in view of Mrs. Carew and Mr. Bodery, who were walking together, the Vicomte dropped his handkerchief. Signor Bruno attempted to pick it up, and there was a slight delay caused by the interchange of some Gallic politeness. Before the two foreigners came up with Hilda, who had walked on, Signor Bruno found time to say: “I must see you to-night, without fail; I am in a very difficult position. I have had to resort to strong measures.” “Where?” inquired the Vicomte d\u0027Audierne, with that pleasant nonchalance which is so aggravating to the People. “In the village, any time after nine; a yellow cottage near the well.” “Good!” And they joined Hilda Carew.","sourceLink":"http://novel.tingroom.com/duanpian/2876/79595.html","bookId":1162,"book":{"id":1162,"title":"The Slave Of The Lamp","description":"简介： Henry Seton Merriman published his first novel, Young Mistley, in 1888, when he was twenty-six years old. Messrs. Bentley\u0027s reader, in his critique on the book, spoke of its powerful situations and unconventionality of treatment: and, while dwelling...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2876","creation":"Aug 1, 2019 12:24:30 AM","modification":"Aug 1, 2019 12:24:30 AM"}}
