{"id":15506,"no":9,"title":"CHAPTER VIII. FALSE METAL","content":"There was, however, no cricket for Stanley Carew that morning. When they came within sight of the house Mrs. Carew emerged from an open window carrying several letters in her hand. She was not hurrying, but walking leisurely, reading a letter as she walked. “Just think, Hilda dear,” she said, with as much surprise as she ever allowed herself. “I have had a letter from the Vicomte d\u0027Audierne. You remember him?” “Yes,” said the girl; “I remember him, of course. He is not the sort of man one forgets.” “I always liked the Viscount,” said Mrs. Carew, pensively looking at the letter she held in her hand. “He was a good friend to us at one time. I never understood him, and I like men whom one does not understand.” Hilda laughed. “Yes,” she answered vaguely. “Your father admired him tremendously,” Mrs. Carew went on to say. “He said that he was one of the cleverest men in France, but that he had fallen in a wrong season, and would not adapt himself. Had France been a monarchy, the Vicomte d\u0027Audierne would have been in a very different position.” Vellacott did not open his own letters. He seemed to be interested in the conversation of these ladies. He was not a reserved man, but a secretive, which is quite a different thing. Reserve is natural—it comes unbidden, and often unwelcome. Secretiveness is born of circumstances. Some men find it imperative to cultivate it, although their soul revolts within them. In professional or social matters it is often merely an expediency—in some cases it almost feels like a crime. There are some secrets which cannot be divulged; there are some deceptions which a certain book-keeper will record upon the credit side of our account. Like most young men who have got on in their calling, Christian Vellacott held his career in great respect. He felt that any sacrifice made for it carried its own reward. He thought that it levelled scruples and justified deceptions. He knew this Vicomte d\u0027Audierne by reputation; he wished to hear more of him; and so he feigned ignorance—listening. “What has he written about?” inquired Hilda. “To ask if he may come and see us. I suppose he means to come and stay.” Vellacott looked what the French call “contraried.” “When?” asked the girl. “On Monday week.” And then Mrs. Carew turned to her other letters. Vellacott took the budget addressed to him, and walked away to where an iron table and some chairs stood in the shade of a deodar. In a few minutes he looked still more put out. He had learnt of the disturbances in Paris, and was reading a rather panic-stricken letter from Mr. Bodery. The truth was that there was no one in the office of the Beacon who knew anything whatever about French home politics but Christian Vellacott. A continuance of these disturbances would necessarily assume political importance, and might even lead to a crisis. This meant an instant recall for Vellacott. In a crisis his presence in London or Paris was absolutely necessary to the Beacon. His holiday had barely lasted twenty-four hours, and there was already a question of recall. It happened also that within that short space a considerable change had come over Vellacott. The subtle influence of a country life, and possibly the low, peaceful song of the distant sea, were already beginning to make themselves felt. He actually detected a desire to sit still and do nothing—a feeling of which he had not hitherto been conscious. He was distinctly averse to leaving St. Mary Western just yet. But there is one task-master who knows no mercy and makes no allowances. Some of us who serve him know it to our cost, and yet we would be content to serve no other. That task-master is the Public. Vellacott was a public servant, and he knew his position. Somewhat later in the morning Molly and Hilda found him still seated at the table, writing with that concentrated rapidity which only comes with practice. “I am sorry,” he said, looking up, “but I must send off a telegram. I shall walk in to the station.” “I was just coming,” said Hilda, “to ask if you would drive me in. I want to get some things.” “And,” added Molly, “there are some domestic commissions—butcher, baker, \u0026c.” Vellacott expressed his entire satisfaction with the arrangement, and by the time he had finished his letter the dog-cart was waiting at the door. Several of the family were standing round the vehicle talking in a desultory manner, and Vellacott learnt then for the first time that Frederick Farrar had left home that same morning to attend a midland race-meeting. It was one of those brilliant summer days when it is quite impossible to be pessimistic and exceedingly difficult to compass preoccupation. The light breeze bowling over the upland from the sea had just sufficient strength to blow away all mental cobwebs. Also, Christian Vellacott had suddenly given way to one of those feelings which sometimes come to us without apparent reason. The present was joyous enough without the aid of the ever-to-be-bright future, and Vellacott felt that, after all, French politics and Frederick Farrar did not quite monopolise the world. Hilda was on this occasion more talkative than usual. There was in her manner a new sense of ease, almost of familiarity, which Vellacott could not understand. He noticed that she spoke invariably in generalities, avoiding all personal matters. Of herself she said no word, though she appeared willing enough to answer any question he might ask. She led him on to talk of himself and his work, listening gravely to his account of the little household at Chelsea. He made the best of this topic, and even treated it in a merry vein; but her smile, though sincere enough, was of short duration and not in itself encouraging. She appeared to see the pathos of it instead of the humour. Suddenly, in the middle of a particularly funny story about Aunt Judith, she interrupted him and changed the conversation entirely. She did not again refer to his home life. As they were returning in the full glare of the midday sun, they descried in front of them the figure of an old man; he was walking painfully and making poor progress. Carefully dressed in black broadcloth, he wore a soft felt hat of a shape seldom seen in England. “I believe,” said Hilda, as they approached him, “that is Signor Bruno. Yes, it is. Please pull up, Christian. We must give him a lift!” Christian obeyed her. He thought he detected a shade of annoyance in Hilda\u0027s voice, with which he fully sympathised. On hearing the sound of the wheels, the old man looked up in surprise, as a deaf person might have been expected to do. This movement showed a most charming old face, surrounded by a halo of white hair and beard. The features were almost perfect, and might in former days have been a trifle cold, by reason of their perfection. Now, however, they were softened by the touch of years, and Signor Bruno was the living semblance of guilelessness and benevolence. “How do you do, Signor Bruno?” said Hilda, speaking rather loudly and very distinctly. “You are back from London sooner than you expected, are you not?” “Ah! my dear young lady,” he replied, courteously removing his hat and standing bareheaded. “Ah! now indeed the sun shines upon me. Yes, I am back from London—a most terrible place—terrible—terrible—terrible! As I walked along just now I said to myself: \u0027The sun is warm, the skies are blue; yonder is the laughing sea, and yet, Bruno, you sigh for Italy.\u0027 This is Italy, Miss Hilda—Italy with a northern fairy walking in it!” Hilda smiled her quick, surprising smile, and hastened to speak before the old gentleman recovered his breath. “Allow me to introduce to you Sidney\u0027s friend, Mr. Vellacott, Signor Bruno!” Sidney\u0027s friend, Mr. Vellacott, was by this time behind her. He had alighted, and was employed in arranging the back seat of the dog-cart. When Signor Bruno looked towards him, he found Christian\u0027s eyes fixed upon his face with a quiet persistence which might have been embarrassing to a younger man. He raised his hat and murmured something unintelligible in reply to the Italian\u0027s extensive salutation. “Sidney Carew\u0027s friends are, I trust, mine also!” said Signor Bruno, as he replaced his picturesque hat. Christian smiled spasmodically and continued arranging the seat. He then came round to the front of the cart and made a sign to Hilda that she should move into the right-hand seat and drive. Signor Bruno saw the sign, and said urbanely: “You will, if you please, resume your seat. I will place myself behind!” “Oh, no! You must allow me to sit behind!” said Christian. “But why, my dear sir? That would not be correct. You are Mr. Carew\u0027s guest, and I—I am only a poor old Italian runaway, who is accustomed to back seats; all my life I have occupied back seats, I think, Mr. Vell\u0027cott. There is no reason why I should aspire to better things now!” The old fellow\u0027s voice was strangely balanced between pathos and a peculiar self-abnegating humour. “If we were both to take our hats off again, I think it would be easy to see why you should sit in front!” said Christian with a laugh, which although quite genial, somehow closed the discussion. “Ah!” replied the old gentleman with outspread hands. “There you have worsted me. After that I am silent, and—I obey!” He climbed into the cart with a little senile joke about the stiffness of his aged limbs. He chattered on in his innocent, childish way until the village was reached. Here he was deposited on the dusty road at the gate of a small yellow cottage where he had two rooms. The seat was re-arranged, and amidst a volley of thanks and salutations, Hilda and Christian drove away. Presently Hilda looked up and said: “Is he not a dear old thing? I believe, Christian, in all the various local information I have given you, I have never told you about Signor Bruno. I shall reserve him for the next awkward pause that occurs.” “Yes,” replied Christian quietly. “He seems very nice.” Something in his tone seemed to catch her attention. She half turned as if to hear more, but he said nothing. Then she raised her eyes to his face, which was not expressive of anything in particular. “Christian,” she said gravely, “you do not like him?” Looked upon as a mere divination of thought, this was very quick; but he seemed in no way perturbed. He turned and looked down with a smile at her grave face. “No,” he replied. “Not very much.” “Why?” “I do not know. There is something wrong about him, I think!” She laughed and shook her head. “What do you mean?” she asked. “How can there be anything wrong with him—anything that would affect us, at all events?” He shrugged his shoulders, still smiling. “He says he is an Italian?” “Yes,” she replied. “I say he is a Frenchman,” said Christian, suddenly turning towards her. “Italians do not talk English as he talks it.” She looked puzzled. “Do you know him?” she asked. “No; not yet. I know his face. I have seen it or a photograph of it somewhere, and at some time. I cannot tell when or where yet, but it will come to me.” “When it does come,” said Hilda, with a smile, “you will find that it is some one else. I can assure you Signor Bruno is an Italian, and beyond that he is the nicest old gentleman imaginable.” “Well,” replied Christian. “In the meantime I vote that we do not trouble ourselves about him.” The subject was dropped, and not again referred to until after they had reached home, when Hilda informed her mother that Signor Bruno had returned. “Oh, indeed,” was the reply. “I am very glad. You must ask him to dinner to-morrow evening. Is he not a nice old man, Christian?” “Very,” replied Christian, almost before the words were out of her lips. “Yes, very nice.” He looked across the table towards Hilda with an absolutely expressionless composure. During the following day, which he passed with Sidney and Stanley at sea in a little cutter belonging to the Carews, Christian learnt, without asking many questions, all that Signor Bruno had vouchsafed in the way of information respecting himself. It was a short story and an old one, such as many a white-haired Italian could tell to-day. A life, income, and energy devoted to a cause which never had much promise of reward. Failure, exile, and a life closing in a land where the blue skies of Italy are known only by name, where Maraschino is at a premium, and long black cigars almost unobtainable. Hilda was engaged on this day to lunch and spend the afternoon with Mrs. Farrar, at Farrar Court. Molly and Christian were to drive over for her in the evening. This programme was carried out, but the young people lingered rather longer at Farrar Court listening to the quaint, old-world recollections of its white-haired hostess than was allowed for. Consequently they were late, and heard the first dinner-bell ringing as they drove up the lane that led in a casual way to their home. (This lane was characteristic of the house. It turned off unobtrusively from the high road at right angles with the evident intention of leading nowhere.) A race upstairs ensued and a hurried toilet. Molly and Christian met on the stairs a few minutes later. Christian had won the race, for he was ready, while Molly struggled with a silver necklace that fitted closely round her throat. Of course he had to help her. While waiting patiently for him to master the intricacies of the old silver clasp, Molly said: “Oh, Christian, there is one place you have not seen yet. Quite close at hand too.” “Ye—es,” he replied absently, as he at length fixed the clasp. “There, it is done!” As he held open the drawing-room door, he said: “What is the place I have to see?” Signor Bruno, who was seated at the far end of the room with Mrs. Carew, rose as he heard the door opened, and advanced to meet Molly. “Porton Abbey,” she said over her shoulder as she advanced into the room. “You must see Porton Abbey.” The Italian shook hands with the new-comers and made a clever, laughing reference to Christian\u0027s politeness of the previous day. At this moment Hilda entered, and as soon as she had returned Signor Bruno\u0027s courteous salutation Molly turned towards her. “Hilda,” she said, “we have never shown Christian Porton Abbey.” “No,” was the reply. “I have been reserving it for some afternoon when we do not feel very energetic. Unfortunately, we cannot get inside the Abbey now, though.” “Why?” asked Christian, without looking towards Hilda. He had discovered that Signor Bruno was attempting to keep up a conversation with his hostess, while he took in that which was passing at the other end of the room. The old man was seated, and his face was within the radius of light cast by a shaded lamp. Christian, who stood, was in the shade. “Because it is a French monastery,” replied Molly. “Here,” she added, “is a flower for your coat, as you say the button-hole is warped by constant pinning in of stalks.” “Thanks,” he replied, stooping a little in order that she could reach the button-hole of his coat. She was in front of him, directly between him and Signor Bruno; but he could see over her head. “What sort of monastery is it?” he continued conversationally. “I did not know that there were any establishments of that sort in England.” Hilda looked up rather sharply from an illustrated newspaper she happened to be studying. She knew that he was not adhering strictly to the truth. From her point of vantage behind the newspaper she continued to watch Christian, and she realised during the minutes that followed, that this was indeed the brilliant young journalist of whose fame Farrar had spoken as already known in London. Signor Bruno\u0027s conversation with Mrs. Carew became at this moment somewhat muddled. “There, you see,” said Molly vivaciously, “we endeavour to interest him by retailing the simple annals of our neighbourhood, and his highness simply disbelieves us!” “Not at all,” Christian hastened to add, with a laugh. “It simply happened that I was surprised. It shall not occur again. But tell me, what sort of monastery is it? Dominican? Franciscan? Carmelite?—” “Oh, goodness! I do not know.” “Perhaps,” said Christian, advancing towards the Italian—“perhaps Signor Bruno can tell us.” “What is that, Mr. Vell\u0027cott?” asked the old gentleman, making a movement as if about to raise his curved hand to his ear, but restraining himself upon second thoughts. Hilda noticed that, instead of raising his voice, Christian spoke in the same tone, or even lower, as he said: “We want some details of the establishment at Porton Abbey, Signor Bruno.” The old gentleman made a little grimace expressive of disgust, at the same time spreading out his hands as if to ward off something hurtful. “Ach!” he said, “do not ask me. I know nothing of such people, and wish to learn no more. It is to them that my poor country owes her downfall. No, no; leave them alone. I always take care of myself against—against—what you say—ces gens-là!” Christian awaited the answer in polite silence, and, when Signor Bruno had again turned to Mrs. Carew, he looked across the room towards Hilda with the same expression of vacant composure that she had noticed on a previous occasion. The accent with which Signor Bruno had spoken the few words of French was of the purest Parisian, entirely free from the harshness which an Italian rarely conquers. After dinner Hilda went out of the open window into the garden alone. Christian, who had seated himself at a small table in the drawing-room, did not move. Sidney and his mother were talking with the Italian. The young journalist was stooping over a book, a vase of flowers stood in front of him, but by the movement of his arm it appeared as if he were drawing instead of reading. Presently a faint, low whistle came from the garden. Though soft, the sound was very clear, and each note distinctly given. It was like the beginning of a refrain which broke off suddenly and was repeated. Signor Bruno gave a little start and a quick upward glance. “What is that?” he asked, with a little laugh, as if at the delicacy of his own nerves. “Oh,” replied Mrs. Carew, “the whistle, you mean. That is our family signal. The children were in the habit of calling each other by that means in bygone years. I expect they are in the garden now, and wish us to join them.” Mrs. Carew knew that Molly was not in the garden, but in making this intentional mistake she showed the wisdom of her kind. “It seems to me,” said Signor Bruno, “that the air—the refrain, one might call it—is familiar.” Christian Vellacott smiled suddenly behind his screen of flowers, but did not move or look up. “I expect,” explained Sidney, “that you have heard the air played upon the bugle. It is the French \u0027retraite,\u0027 played by the patrol in garrison towns at night.” In the meantime Christian had cut the fly-leaf from the book before him, and, after carefully folding it, he placed the paper in his breast-pocket. Then he rose and passed out of the open window into the garden. Immediately Signor Bruno asked his hostess a few polite questions regarding her guest—what was his occupation, how long he was going to stay, and whether she did not agree with him in considering that their young friend had a remarkably interesting face. In the course of his remarks the old gentleman rose and crossed to the table where Christian had been sitting. There was a flower there which he had not seen in England before. Absently he took up the book which Christian had just been studying, and very naturally turned to the title-page. The fly-leaf was gone! When he laid the volume down again he replaced it in the identical position in which he had found it. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2876/79588.html","bookId":1162,"book":{"id":1162,"title":"The Slave Of The Lamp","description":"简介： Henry Seton Merriman published his first novel, Young Mistley, in 1888, when he was twenty-six years old. Messrs. Bentley\u0027s reader, in his critique on the book, spoke of its powerful situations and unconventionality of treatment: and, while dwelling...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2876","creation":"Aug 1, 2019 12:24:30 AM","modification":"Aug 1, 2019 12:24:30 AM"}}
