{"id":111368,"no":1,"title":"Page 1","content":"Chapter One\\n\\n “I know his first wife put a curse on me,” Lady Walsh said. The lace edging her silk gloves fluttered as she folded her hands and placed them in a ladylike spot on her lap. “It’s the only explanation.”\\n\\n A yawn tugged at my jaw; I swallowed it along with a mouthful of tea. “If you want an exormage, Lady Walsh, there’s a small horde of them on the first floor.”\\n\\n Her soft brown eyes shimmered. “Over the last month I’ve had fifteen of them to the house. The curse rendered them powerless. They couldn’t even determine the nature of it.”\\n\\n “That’s probably because there is no such thing as a curse,” I said as kindly as I could. I heard a familiar scratching sound at the door and collected some coppers from my drawer. “Excuse me for a moment, milady. I have a delivery.”\\n\\n I closed the inner door to my office before I went to the entry and yanked it open. “Back for another go, then, Gert?”\\n\\n “Satan’s whore. I will not rest until I have sent you back to the hell that spawned you.” The old woman produced a long gnarled twig and shook it at my face. “Wither and burn, wither and burn.”\\n\\n I folded my arms and waited several seconds, but neither I nor anything else burst into flames. “Apparently not today, love.”\\n\\n “I am made powerless.” Gert lowered her stick and glared at me. “The Evil One protects you.”\\n\\n “Aye, and you’d think he’d give me a doorman.” She looked thinner and hungrier than usual. “Go have some tea. You’ll feel better.” I offered her the coppers, which she snatched from my palm.\\n\\n “Abbadon’s pit of eternal fire awaits you,” Gert promised. “You cannot escape it.”\\n\\n “I won’t try, I promise.” I watched her hobble off and then eyed the incantation she’d scribbled on the door’s glass. No doubt it was meant to send me directly to some highly unpleasant level of hell, I thought as I took out my handkerchief and wiped it off. Gert always came with a backup plan for my doom.\\n\\n I returned to my office, where Lady Walsh sat staring at the door. “Sorry about that.”\\n\\n She regarded me with appalled fascination. “You truly don’t believe in magic.”\\n\\n “I truly don’t.” I smiled. “I also have an appointment to get to downtown. Do you want me to call for your coach, or do you need a private carri?”\\n\\n “Wait. Please. I can show you proof.” The corkscrew curls framing her face bobbled as she began stripping off her gloves. “You can’t imagine how difficult it’s been, trying to hide this from my husband. When I woke this morning and saw them, I nearly screamed.”\\n\\n I tried logic. “I presume your husband’s first wife died before he married you?” When she nodded, I asked, “How is it that would she even know about you, much less cast a curse on you from the grave?”\\n\\n “I can’t say how these spells work, Miss Kittredge, but obviously her spirit has refused to leave the house.” She fiddled with a fold of her skirt. “I think seeing how happy I make Nolan has caused her to become jealous and vengeful.”\\n\\n I was going to be late for my fictitious appointment, it seemed. “I’m sure an unexpected rash can seem like something malicious and supernatural in origin, especially for a woman as beautiful as you, but—”\\n\\n She held out her soft, pale hands, and I forgot to breathe. Someone had used a knife to carve a word below the knuckles on each: GREEDY and SLUT.\\n\\n My own hands trembled before I clenched them into fists. “Bloody hell.” She thought magic had done this, this brutal, malicious thing. “When did this happen?”\\n\\n “I cannot tell you. After my husband left me last night, I slept alone with the doors and windows bolted from the inside.” She stared at the marks. “The curse did this to me while I slept. I never woke, not once.”\\n\\n I gently took the hand marked SLUT and examined the wound. It appeared at first glance to be written in dark-red ink, but when I brushed a fingertip over the letters I felt the cut marks in her skin. “How did you explain the stains on your linens, milady?”\\n\\n “There were none. Nothing on my gown, either. That’s why it has to be magic.” She watched my face. “That, and I suffer no discomfort. I can’t even feel them.”\\n\\n Ladies were taught never to show pain, but not to feel it? “Were the other incidents like this?”\\n\\n Her head moved in a tight nod. “The same two words every time, on the insides of my arms, the back of my neck, and . . .”\\n\\n “And?”\\n\\n She glanced over her shoulder and lowered her voice to a whisper. “On my knees.”\\n\\n Whoever had done this hadn’t used a spell—more like a very thin, sharp boning knife. I knew of some salves that numbed the skin; that would explain why she didn’t feel the cuts. Or if someone had slipped some drugs into her wine at dinner, and gained access to her bedchamber through a hidden door or crawlspace . . . “Does your husband have any children from his first marriage?”\\n\\n “Three. His son and two daughters. We are all quite good friends.” She hesitated before she added, “No, that’s not exactly true. They want their father to be happy. They tolerate me because I do that, I make him happy.” Suddenly she clutched at my hands. “I know your reputation, Miss Kittredge. There is no one in the city that can dispel magic as you do. I’m afraid to go to sleep. I keep thinking one morning I’ll look in the mirror and she’ll have cut them into my face—”\\n\\n She collapsed against me and burst into tears.\\n\\n I supported her by the elbows and made some comforting noises. This was why I seldom took on female clients; their silly notions and endless waterworks made it difficult to ferret out the truth. But someone had been secretly assaulting Lady Walsh, and no woman should have to endure that—in or out of her own bed.\\n\\n I helped her back over to the client’s chair and silently passed her my handkerchief before I took her teacup over to the cart to refresh it and give her a little time to mop up and compose herself. My tea was nothing special—whatever was on sale that week at the grocer’s—but I added a dash of soother to the brew before I brought it back to her.\\n\\n “You haven’t told your husband about these attacks.” I didn’t have to make it a question.\\n\\n “I can’t trouble dear Nolan with this.” She put her gloves back on before she sipped from her cup. “He’s so loving and attentive, it would destroy him.” She gave me an owl-eyed look of mute, helpless appeal.\\n\\n She was an old rich man’s young trophy wife, likely the most fetching daughter of a posh who had fallen on hard times. Marrying Nolan Walsh would have resulted in some restoration of her family’s fortunes and likewise assured Lady Walsh of a lifetime of comfortable financial security. She’d personally slice herself up before she endangered that.\\n\\n I knew I was probably going to regret this. I didn’t like working for the rich or titled, and I had other, very good reasons to avoid the Hill. But someone had gone to vicious lengths to torment her, and it was obvious from the repeated attacks that they had no intention of stopping.\\n\\n “How will you bring me into your household?”\\n\\n She brightened immediately. “I thought I would have you as a cousin—a very distant one, of course—who has only just discovered our family connection.” Her smile turned self-conscious. “I’m afraid that genealogy is one of my little self-indulgences.”\\n\\n “Well, it isn’t one of mine, so you’d better be the one to make the discovery.” Now, when to call. I checked my brooch watch and thought about the rest of my day. “Dinner is too intimate for a new acquaintance; it’ll have to be tea. I’ll also need an excuse to visit your bedchamber.”\\n\\n She nodded quickly. “I keep some family portints on my vanity. I can remark on your resemblance to my great-aunt Hortense and invite you up to see them.”\\n\\n “Our great-aunt Hortense.” I sighed. “Lady Walsh, you should know that in the past I’ve been hired by other families on the Hill. Some of your servants might recognize me. If anyone asks, it’s best that we not lie about how I earn my living.”\\n\\n “I’m sure that Nolan will think it’s charming that you, ah, work for yourself.” She glanced at the gold letters spelling out Disenchanted \u0026 Co. on the frosted glass of my office door. “He’s very progressive that way about women, you know. He even believes we should have the vote, bless him.”\\n\\n But he would never employ any women at his bank, I guessed, or trust them to manage their own funds. “Good on your husband.” I held out my hand. “I’ll see you at four.”\\n\\n Lady Walsh clasped my hand tightly. “Thank you so much, Miss Kittredge. Oh, dear, what is your given name? With our connection I should call you by that.”\\n\\n “I’m known as Kit.” Only one person left in the world still called me Charmian, but one day he’d walk in front of my carri and I’d put an end to that. “And you?”\\n\\n “I’m Diana, and forever in your debt, Kit.” She gave my hand a final fervent squeeze and went to the door. A man dressed in cream-and-scarlet livery standing outside opened it for her and closed it before he followed her out of sight.\\n\\n Odd that I hadn’t seen him when I’d confronted Gert. Most footmen waited with the coach; only the wealthiest of women used them as body servants.\\n\\n “Or your dear, loving Nolan doesn’t quite trust you to leave the house alone,” I murmured under my breath as I picked up my keylace and knotted it around my wrist. “I wonder why.”\\n\\n After I locked up the office, I took the stairs down to the underground level, better known to me and the other tenants of the Davies Building as the Dungeon.\\n\\n The sole occupant of the understair had once been a royal machinist, one of the finest who had ever served H.M., or so the Honorable Reginald P. Docket would have everyone believe. We never asked why he had given up his choice position to immigrate; no one left England for the Provincial Union of Victoriana unless they had made a horrible marriage or committed an unpardonable offense against the Crown. Since Docket remained a bachelor, and his constructs sometimes didn’t perform according to spec, I imagined it to be the latter. \\n\\n","sourceLink":"https://allnovel.net/her-ladyship-s-curse/page-1.html","bookId":1590,"book":{"id":1590,"title":"Her Ladyship\u0027s Curse","description":"Storyline: In a steampunk version of America that lost the Revolutionary War, Charmian (Kit) Kittredge makes her living investigating magic crimes and exposing the frauds behind them. While Kit tries to avoid the nobs of high society, as the proprietor of Disenchanted \u0026 Co. she follows mysteries wherever they lead. \\n Lady Diana Walsh calls on Kit to investigate and dispel the curse she believes responsible for carving hateful words into her own flesh as she sleeps. While Kit doesn’t believe in magic herself, she can’t refuse to help a woman subjected nightly to such vicious assaults. As Kit investigates the Walsh family, she becomes convinced that the attacks on Diana are part of a larger, more ominous plot—one that may involve the lady’s obnoxious husband. \\n Sleuthing in the city of Rumsen is difficult enough, but soon Kit must also skirt the unwanted attentions of nefarious deathmage Lucien Dredmore and the unwelcome scrutiny of police Chief Inspector Thomas Doyle. Unwilling to surrender to either man’s passion for her, Kit struggles to remain independent as she draws closer to the heart of the mystery. Yet as she learns the truth behind her ladyship’s curse, Kit also uncovers a massive conspiracy that promises to ruin her life—and turn Rumsen into a supernatural battleground from which no one will escape alive.\\n","cover":"https://allnovel.net/images/her-ladyship-s-curse.jpg","author":"Lynn Viehl","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/her-ladyship-s-curse.html","creation":"Oct 5, 2019 8:57:45 AM","modification":"Oct 6, 2019 12:21:36 AM"}}
