{"id":33030,"no":24,"title":"CHAPTER XXIII","content":"1 England has not yet quite forgotten the \"Bournemouth Tragedy\" during which Hector Brunton, who led for the Crown, first became known to the public as the \"hanging prosecutor.\" The charge against Mrs. Cairns was murder; and for days no newspaper dared to omit a single comma from its reports of the case. For days Hector\u0027s bewigged photograph blazed on the back page of the \"Daily Mail\" and the front page of the \"Sunday Pictorial\"; for days England abandoned itself to the raptest scrutiny of Dr. Spilsbury\u0027s and other experts\u0027 evidence anent the poisonous properties of a certain arsenical face lotion with which--the \"hanging prosecutor\" alleged--Mrs. Cairns had doctored her dead husband\u0027s whisky; and to speculations, ruminations, discussions, and wagers as to the probable fate of Mrs. Cairns. During those days, that epitome of England, Powolney Mansions, oblivious alike of reconstruction, strikes, German indemnities, the Irish question, and the \"scandal of Mr. and Mrs. Cavendish,\" demanded only to know whether Mrs. Cairns would dare to face Hector Brunton\u0027s cross-examination; whether, cross-examination concluded, Hector Brunton would succeed in securing a verdict of \"guilty\" against Mrs. Cairns; and whether Mrs. Cairns, having been found guilty, would be hanged by the neck until she was dead or incarcerated for the period of her natural life--which period, Miss Greenwell informed Monsieur Mayer, was limited to twenty years with the remission of one quarter the sentence for good conduct. \"She\u0027ll be out in fifteen years,\" said Miss Greenwell, when, some ten days after the conclusion of the trial, the home secretary\u0027s remission of the death penalty was duly announced, \"and she\u0027ll still be a young woman.\" \"I,\" retorted Monsieur Mayer, \"do not believe that she was guilty at all. If it had not been for \u0027Ector Brunton----\" \"And that reminds me,\" began Miss Greenwell--but by then the lovers were already away. 2 Consciously and subconsciously, the success and the réclame of the \"hanging prosecutor\" infuriated Ronnie. Always he hated the man, but now, every time he saw H. B.\u0027s face staring at him from the newspapers, a new thought, the thought of his own meagerly employed talents, talents of which he had begun to feel more and more surely confident, rankled. Even in the \"ridiculous flat\" (he and Aliette christened it the \"ridiculous flat\" in the same way that Orientals always refer to their most cherished possessions as things of no account) he felt himself a failure. Yet the flat\u0027s self was an indubitable success--a home of their own--very symbol of mated unity. Julia Cavendish herself, too weak, with a curious lethargy of which Heron Baynet alone knew the exact cause, to pay more than one visit to Flat 27, Block B, Embankment House, admitted it \"passable.\" At her suggestion Aliette had decided on using a beige wall-paper, almost identical with the one at Jermyn Street, throughout; on Ronnie\u0027s Chippendale and Ronnie\u0027s eighteenth century engravings (removed almost by force from Moses Moffatt\u0027s) for the tiny flame-curtained dining-room. Ronnie\u0027s ascetic bedroom furniture she relegated to Caroline Staley, providing him in its stead with hanging-cupboards craftily and cheaply contrived in the wall-spaces either side his dressing-room fireplace. For the sitting-room (christened by Aliette the \"parlor\"), the tiniest box of French simplicity combined with English comfort; and for their communal chamber, with its tester bed and its short purple curtains, Julia\u0027s Christmas check provided the adornment. But it was only by adding some of her own income that Aliette, faced with and realizing for the first time the petty troubles of home-making with one servant, could install the electric kitchenette, the Canadian \"cook\u0027s table,\" the gas-fires and the tiled hearths, the Califont hot-water system which functioned automatically as soon as one turned the taps, the Hoover vacuum-sweeper, and all those other labor-saving devices which people who really need them can never afford. Despite all of which, the \"ridiculous flat\" had its discomforts, not least of them being the impossibility of sleeping Ponto on the exiguous premises. \"Man,\" asked Aliette dubiously, as they finally drove away, luggage on taxi, from a curiously incurious Powolney Mansions, \"what are we going to do with him?\" \"The Lord knows, my dear,\" laughed Ronnie. \"People who elope have no right to take Great Danes with them.\" \"I suppose we ought to get rid of him. He\u0027s very expensive.\" However, neither of them had the heart to part with the beast; and eventually they found quarters for him in a little side-street off the Hammersmith Road. 3 From their very first meal together, faultlessly cooked and faultlessly served by Caroline Staley--as glad as she to be free from boarding-housedom; all through February and well into March, Aliette\u0027s home-life was one long ecstasy, marred only by her growing anxiety about Julia\u0027s health and a vague suspicion that Ronnie \"worried.\" Looking back from the safe coziness of the \"ridiculous flat\" on the long months they had wasted in Powolney Mansions, it seemed impossible that they should ever have been \"boarding-house people,\" ever have tolerated the uncleanliness, the unhomeliness, the gossip, and the monotony of Monsieur Mayer\u0027s establishment. And by the end of March even Ronnie\u0027s \"worries\" seemed to have disappeared. For John Cartwright\u0027s promises had more than materialized; and though the briefs were rarely marked higher than \"Two guineas,\" the work they entailed kept Ronnie from brooding. Despite his whimsical grumblings at being forced to leave her alone all day, Aliette knew that her man, growing hourly more ambitious for success, saw prospects of it in this strange employment. Coming back of a late afternoon, he would lounge into the parlor, kiss her, accept the tea Caroline Staley never failed to bring him, light his pipe, and talk at length about his petty triumphs at the Old Bailey or Brixton. Once, even, he showed her his name in a press-report, with a smiled \"I\u0027m getting quite a reputation among the criminal classes. Soon there won\u0027t be a pickpocket within the metropolitan radius who doesn\u0027t regard me as his only hope of salvation. They call me \u0027Cut Cavendish,\u0027 I believe. Hope you haven\u0027t had too dull a day, darling.\" But Aliette\u0027s days were never dull. The hours when Ronnie was away from her \"defending his pickpockets\" passed all too swiftly for accomplishment of the manifold trivialities which ministered to his comfort. Literally \"she never had a moment to sit down.\" So soon as he had left for his chambers (he hated seeing her do housework, and so she used to maintain the pretense of idleness until she heard the front door close, and the gate of the automatic lift clink to behind him), Caroline Staley--grown, as all servants, somewhat dictatorial in her old age--would demand help in the making of the bed, demand that her mistress sally forth to wrangle with the milkman or impress upon the butcher the alien origin of the previous day\u0027s joint. These wrangles provided Aliette, hitherto immune from the petty worries of the average woman and now almost completely isolated from her kind, with a certain amusement. Returned from them, she helped lay her own table for luncheon; and, luncheon over, busied herself with the darning of stockings, with the cleaning of special pieces of silver, or with some other of the thousand and one tasks which your really class-conscious domestic, whose master is waited on hand and foot, always manages to leave to her master\u0027s wife. So that if, as at least once a week, Aliette felt it her duty to visit Julia Cavendish, it meant a rush for tube or omnibus, and a second rush homewards in time to dress for dinner--\"dressing for dinner\" being a shibboleth on which both lovers insisted as their \"last relic of respectability.\" And even if her days had been dull, the evenings would have made their dullness worth while. Those evenings! Their one servant abed. She and her man alone together, isolated high above London--solitary--safe--not even the telephone to connect them with their kind: Ronnie, pipe between his lips, his face tired yet happy in the glow of the fire, his long limbs outstretched, his lips moving rarely to speech; Aliette, some unread novel on her lap, the light of the reading-lamp a-shimmer on her dimpled shoulders, on the vivid of her hair and the vivid of her eyes; Aliette, pleasantly wearied of body, pleasantly vacuous of thought, speaking rarely as her mate, utterly happy in his silent company, so happy that all the terrors of her past life with Hector seemed like a nightmare dreamed long since in girlhood and remembered in maturity only as foolishness. Nevertheless, as London March blew chilly toward London April, Aliette again grew fearful. Try as she would to elude them, moments came when she craved so desperately for maternity that Ronnie\u0027s very passion seemed a reproach. And in those moments her imagination fashioned itself children--a boy-child and a girl-child--Dennis and Etta--dream-babies who would bind her man to her forever and forever. Ronnie, too, had his moments of fear, of hope, of dreamery. But for the most part they were a silent couple; and only once did either give voice to their secret thoughts. Then it was Ronnie, who said with one of his whimsical smiles: \"You\u0027ve no idea, Alie, what an orator I\u0027m getting to be. If only I could get one really big case. A murder trial, for instance. But one needs luck for that!\" So the equable days went by. 4 April came; and, to Aliette, the fret of spring. More and more with every opening bud, with every deepening of the green leaf-haze along the river-bank below her windows, she yearned for children--for Ronnie\u0027s children. Her body gave no sign; but already, as though for warning, her mind was pregnant with a new power, the power of prophetic imagination which comes only to the isolated. Sometimes--as when, after one of Mollie\u0027s rare visits, it showed her sister married to Wilberforce--this new power pleased Aliette; sometimes, playing about Hector, it frightened her. But always it made her restless; so that, abandoning more and more of her household duties to Caroline Staley, she walked again with Ponto, as she had walked in the old days when Ronnie was not yet hers. Fulham Park knew the pair of them--and Barnes Common--and Putney Heath. Down the myriad streets that lead away from the river to the unexplored south of London they wandered as far as Shadwell Wood and Coombe Wood and Richmond Park. And always, from those walks, Aliette returned thoughtful; for now, as imagination pictured more and more clearly the fate of Dennis and of Etta should those dream-children be at last made real, there waxed in her the determination to strike the one last possible blow for legal freedom. Hitherto pride, and to a certain extent the fear of still further exasperating him, had prevented her from making any personal move in Hector\u0027s direction. Hitherto she had acquiesced in the policy that others--Ronnie, Julia, the admiral, James Wilberforce--should fight for her. But all these had failed! And, \"Surely,\" thought Aliette, \"surely it is my duty to conquer this pride, to put aside these fears, to meet him face to face.\" But, despite the assurances of the imaginative power--which showed her herself resolute against Hector, reasoning with Hector, remonstrating with Hector, finally shaming Hector into giving her her freedom--Aliette could not bring herself to ask even the favor of an interview. Three separate times she sat down to the little satin-wood desk in the parlor, three separate times she took pen in hand; but each time determination failed at mere sight of the first uncompromising \"Dear\" on the tinted note-paper. Pride and her disdain for the man, courage and fear alike forbade her to cross that Rubicon. \"I\u0027m a fool,\" she said to herself, \"a fool and a funk. For Ronnie\u0027s sake, for the sake of Ronnie\u0027s mother, even for my own sake I ought to write. But I can\u0027t--I just can\u0027t.\" And the pen would drop from her nerveless fingers, leaving her soul prey to that utter despondency which only the prophetically imaginative suffer. Meanwhile, the imaginative powers of another woman--powers so infinitely better trained than Aliette\u0027s that their least effort could formulate the written word--were concentrating on Hector Brunton. To Julia Cavendish, ever since the Bournemouth Tragedy, the mere name had become an obsession. Despite her growing prescience of death, despite the lethargy which every day made more potent over her limbs, the old lady\u0027s mind throbbed with activity. That tiniest protoplasm of a plan which she had conceived on Christmas day spored under her thoughts as coral-blossoms spore under the sea; till her brain, mistress of the written word, saw itself join issue with the brain of Hector Brunton, master of the word spoken--and defeat it. \"There is one weapon,\" thought Julia Cavendish, \"one sure weapon with which I can pierce his armor.\" Yet somehow her hand tarried in the forging of that weapon, as though the moment were not yet come. 5 The \"ridiculous flat\" held one supreme joy--the finest view which a Londoner may have of London. From its parlor window, of a day, one could survey all the city--from Putney Church to St. Paul\u0027s, from Chiswick Mall where once red-heeled gallants tripped it with the ladies of St. James\u0027s, to Keats\u0027s Hampstead and the dim blue of Highgate. At that window, on an April evening, Aliette and her lover stood to contemplate the pageant which Thames and town proffered nightly for their delight. Dusk had fallen, masking the river-pageant with a cloak of indigo and silver. Northward, a saffron shimmer under murky skies, lay London. Westward, the river dwindled out between its fringing lamps to darkness and the misty fields. \"Time for bed,\" said Ronnie practically. He made to close the curtains, but Aliette restrained him. \"Not yet, man.\" \"Why? Aren\u0027t you sleepy?\" Aliette made no answer. She seemed to have forgotten his presence. Her eyes were all for the pageant below; her ears all for the faint hum of the city which mounted, drowsily murmurous, to their high apartment. And after a little while, knowing the need for solitude upon her, Ronnie tiptoed away. Aliette was hardly conscious of his going. It seemed to her as though--in that moment--she were aloof from him, from all men; as though her soul, wandering free, mingled with myriads of other souls whom night had liberated from their earthly bodies to hover above the city. The little French clock on the mantelpiece ticked and ticked. Hardly she heard it ticking. The earthly minutes passed and passed, flowing under her, flowing away into the ocean of time as the river-flood flows away into the oceans of the sea. From below came sound of London\u0027s clocks chiming the quarters. Thought died in her brain. Only the imaginative power was alive. Imagination\u0027s self died. Only her soul was alive. And, with her soul, she dreamed a dream. She dreamed that her letter to Hector had been written, that Hector had answered it. She saw herself setting out to meet him. He had sent his car to fetch her from Embankment House. She saw herself stepping into the car. It was their old car; but the man whose back she could see through the plate-glass of the cabriolet was not their old chauffeur. \"I wonder what his name is,\" she thought. The car set out, noiseless. It left Embankment House behind; it crossed Putney Bridge. It came, between miles and miles of utterly empty streets, into London. A peculiar grayness, neither of the night nor of the day, a peculiar silence, almost a silence of death, brooded over London. No lights gleamed from its ghostly houses; no feet, no wheels echoed on its ghostly paving. The car spun on, noiseless--beyond the ghostly gray into ghostly green--and now it seemed to Aliette as though the time were twilight-time; as though she were in Hyde Park; as though in a few minutes she would make the remembered door in Lancaster Gate. \"Hector\u0027s house,\" she thought. And the thought frightened her. She wanted not to go to Hector. She wanted Ronnie--her Ronnie. But the car spun on. Now, faltering and afraid, she stood before the door of her husband\u0027s house. Now the door opened; and Lennard, subservient as ever, led her into the recollected hall. Lennard vanished; and suddenly Aliette\u0027s soul knew its dream for dream. Then the dream grew real again. Fearful and alone she stood in the chill vastness of that shadowy hall among the recollected furniture. She felt her breasts throbbing under the thin frock, felt her knees tremble as she grasped the door-handle of Hector\u0027s study. No lights burned in the study. It was all gray, gray as the streets without. Hector was not there--only a face--a huge, cruel, unrelenting face. \"So you\u0027ve come back,\" it said. She moved toward the face, across the gray carpet that gave back no sound to her feet. But she could not speak with the face. Between her and the face--as a great sheet of glass--slid silence, the interminable unbearable silence of dreams. Through the glass, Aliette could see every pore in the great face, every hair of its head; but she might not speak with it, nor it with her. Then a voice, a voice as of very conscience, cried out in her: \"Your strength against its strength. Your will against its will.\" She felt her will beat out from her as wings beat, beat and batter at the glass between them. The glass of silence slid away; and she knew the face for Hector\u0027s. She said to it: \"Hector, I haven\u0027t come back. I\u0027m never coming back.\" \"You shall,\" said the face, Hector\u0027s face; and now, under the face, she knew feet, her husband\u0027s feet. At that, terror, the hopeless panic of dreams, gripped her soul by the throat, choking down speech. It seemed to her that she stood naked in that gray and silent room. But now, as a momentary beam through the grayness, another face--the face of her lover--was added to their silent company. And again, \"Your will against its will,\" said the voice. Terror\u0027s fingers unclutched from her throat, so that her will spoke, \"I shall never come back, Hector.\" The face writhed at the words as a face in pain; and suddenly, knowing herself its master, she knew pity for the face, pity for the thing she had done. Till once more she heard the inner voice whisper: \"No pity. Your strength against its strength. Your will against its will.\" \"But I love you,\" pleaded Hector. \"I need you.\" She said to him, \"My children need me, Hector. Set me free.\" And once more the glass of the silences slid between them; once more the interminable, unbearable silence of dreams held her speechless. Tap, tap, tap. Who was that knocking on Hector\u0027s door? It must be Ronnie. Tap, tap, tap. Ronnie mustn\u0027t come in. Ronnie mustn\u0027t find her and Hector alone together. The glass darkled. Behind the glass Aliette could see Hector\u0027s face blur and blur. The face vanished. She was alone, alone in Hector\u0027s study. She was cold, desperately cold through all her limbs. Tap, tap, tap. She heard a voice, a human voice: \"Mr. Cavendish, Mr. Cavendish. Are you there, Mr. Cavendish? You\u0027re wanted on the \u0027phone, Mr. Cavendish.\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3316/90617.html","bookId":400,"book":{"id":400,"title":"The Love Story of Aliette Brunton","description":"简介： In our heart of hearts--which we in England take almost as much pains to hide from ourselves as from our fellow-creatures--most of us realize that life without love is a weariness, a conflict bereft of hope, a struggle for no victory....","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3316","creation":"Aug 1, 2019 12:18:43 AM","modification":"Aug 1, 2019 12:18:43 AM"}}
