{"id":100881,"no":43,"title":"Page 43","content":"* * * On the way home Reeve keeps asking if I’m okay. I tell him yes, yes, I’m fine. With every second that passes, I lose my nerve to tell him the truth. When I get inside, there’s a note from my mom on the fridge saying she and my dad and Nadia went out for dinner and a movie, which makes me feel relieved. This sounds so silly, but what if they’re able to sense that something is different about me? I heard that after you lose your virginity, you look different. I feel different. When I catch a glimpse of my reflection in the foyer mirror, I see it. Flushed cheeks, shiny eyes. I look like a girl in love. My lip starts to quiver. I am a girl in love. And I’m afraid of what that means for us. I run upstairs to my room, my phone in my hand. It suddenly buzzes with a text from Reeve. Home safe and sound. You? I’m ready to text him back, just like he asked. I flip on the light switch, and then I let out a scream. My room is completely trashed. Clothes are everywhere. My down pillows have been slashed open and feathers float through the air. The belly of my stuffed rabbit has been slashed too, and his beany insides spill out onto the carpet. My perfume bottle is shattered on the vanity table; glass is everywhere. My dollhouse is smashed. And there is Mary, sitting cross-legged on my floor in the middle of it all. Oh my God. I back away from her, my whole body trembling. Taking deep, gulping breaths of air, I manage to get out the words “Why did you do this?” “Why? Because Reeve killed me. He killed me, Lillia. You’re in love with a murderer.” I reel backward. “Get out! Get out right now!” “And go where? Reeve Tabatsky took everything from me.” She lifts her head and looks at me and says, “I hung myself that day, just like I told you. But I didn’t survive. I’m dead. You can go to the cemetery and see my gravestone. Elizabeth Mary Donovan Zane.” And then she stumbles to her feet, walks through my bedroom wall, and walks back in. I scream and scream and scream. I put my hands over my ears. “Stop! This isn’t real. It isn’t real.” I’m dreaming. This is just another nightmare. This isn’t happening. I clench my hands into the tightest fists, my fingernails piercing my palms. Please wake up, I tell myself. Wake up, wake up. When I open my eyes, Mary is standing right in front of me. “Touch me,” she says. “Think about it. You never have. You’ve never once touched me.” I squeeze my eyes shut and shake my head. And then I feel something, some force pushing my arm up. I try to pull my arm back down, but I can’t; the force is too strong. “Touch me,” she says again. This time it’s an order, one I can’t refuse. Even though she looks as alive as the day I met her, I reach out to her, my fingers trembling—and my hand slips right through her like she’s made of mist. I scream. My phone rings. It’s Reeve. I try to hide my phone behind my back, but in an instant Mary’s next to me, looking down at the screen. “We made a pact. We said we’d see it through till the end, but you didn’t, did you? No, you broke your word. You said you’d break up with him.” Dread seeps into my bones like a cold fog. “I’m sorry. I’m so sorry.” Mary stares at me for so long, I get chills all over. “So here’s what you’re going to do. You’re going to tell him it’s over. You’re going to tell him you know what he did to me, that you could never love a person who would do something like that. You’re going to say what you should have said in the first place. And Reeve will know it’s because of me.” I shake my head. “No. No. I can’t do that.” “Then I’ll kill him.” “You wouldn’t do that, Mary. I know you!” “No, you don’t. You don’t know me at all. I could have done it at the pool today. Do you want to know why I didn’t? It would’ve been too easy. Too merciful. I’d rather see him suffer.” The phone is ringing again. “It’s up to you,” she says. “I’ll do it!” I cry out. “I’ll tell him. I’ll do whatever you want. Just please don’t hurt him.” I try to grab her arms, but my fingers slip right through. A strange smile lights up her face. “Then answer the phone.” I let out a huge sob and swipe my finger across the screen. “Hello.” “Hey. What’s wrong? Why do you sound like that?” Tears pour down my cheeks. “I can’t be with you anymore.” There is a stunned silence. “What? Why not?” “I came to the pool today—to tell you—” I can’t stop crying. “To tell you I know what you did to that girl.” Anguished, he says, “What girl?” Mary whispers, “Big Easy.” “B-B-Big Easy,” I repeat. I can barely get the words out, I’m crying so hard. “She died because of you.” I hear a sharp intake of breath, and he chokes out, “Alex told you, didn’t he?” “You’re a b-b-bully. You bullied that poor girl to death. I can’t—I can’t be with someone so heartless. I can’t. I’m sorry.” “Cho, please just listen to me—” “It’s over, Reeve.” “But what about today?” he whispers. “That was to say good-bye. So—good-bye, Reeve.” I hang up and power off my phone. “I did it,” I gasp. “It’s over. Is that enough for you? You’ll leave him alone now, won’t you, Mary?” She nods. “But, Lillia . . . I’ll always be here; I’ll always be watching. If you ever go back on your word again, Reeve’s life is over, and his blood will be on your hands, not mine.” And then she disappears. * * * It takes me hours to clean up the mess, but I finish before my parents and Nadia come back home. I’m tired but I can’t sleep. At first it’s pure adrenaline—every time I hear a noise, my whole body stiffens and I’m bracing myself, my heart racing out of my chest. But then the terror fades and I’m just thinking. Thinking, thinking, thinking . . . Thinking about what I know to be true and what I know to be impossible. It is impossible that Mary is dead. That she’s been dead all along. But it’s also true. My friend Mary is dead. She’s dead, or I’m going crazy.","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-43.html","bookId":2728,"book":{"id":2728,"title":"Ashes to Ashes (Burn for Burn #3)","description":"Storyline: New Year\u0027s Eve ended with a bang and Mary, Kat and Lillia may not be prepared for what is to come. After Rennie\u0027s death, Kat and Lillia try to put the pieces together of what happened to her. They both blame themselves. If Lillia hadn\u0027t left with Reeve... If Kat had only stayed with Rennie... Things could have been different. Now they will never be the same. Only Mary knows the truth about that night. About what she is. She also knows the truth about Lillia and Reeve falling in love, about Reeve being happy when all he deserves is misery, just like the misery he caused her. Now their childish attempts at revenge are a thing of the past and Mary is out for blood. Will she leave anything in her wake or will all that remain be ashes?","cover":"https://allnovel.net/images/ashes-to-ashes-burn-for-burn-3.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3.html","creation":"Oct 5, 2019 8:59:13 AM","modification":"Oct 5, 2019 4:21:37 PM"}}
