{"id":80187,"no":59,"title":"Page 59","content":"Dad and Pat are standing in the driveway. Pat wolf-whistles, and Dad blinks like I might disappear. He says, “You look beautiful, Katherine.” “I’d better. This dress cost more than our mortgage.” Dad hurries to meet me at the stairs. “Come here, daughter,” he says quietly. He takes away my cigarette, and even though it’s only half smoked, he tosses it into the grass. Then he tucks me under his arm. “My beautiful girl,” he says, and then closes up my hand inside his. That’s when I notice Dad’s in a nice button-up shirt, a pair of slacks, and his motorcycle boots. He shaved his beard. He looks younger. “What are you dressed up for?” “I want to take a prom picture with you.” Dad motions to Pat to come over. He’s got Dad’s camera around his neck, an old one that takes real film. He and my mom bought it the year Pat was born. Pat hands Dad a plastic container, which Dad opens for me. Inside is a white rose corsage. “Dad!” “I know you said that you and Reeve are going as friends, so I wanted to make sure someone bought you flowers.” He slides it onto my wrist. It’s a good thing I don’t have any makeup on yet, because my bottom lip begins to shake, and my eyes fill up. I kiss his face. He smells like aftershave. It’s cheap shit he gets from the drugstore, but I love the smell. * * * The three of us walk over to Reeve’s house. While Reeve’s posing for a picture with his mom and dad, I take out Nadia’s maroon lipstick, bend down to Reeve’s truck’s side mirror, and quick apply a coat. Tommy comes outside and throws his arms around Pat, and they pound each other’s backs like they’re old war buddies. Tommy gives me a quick once-over, and I act like I don’t notice, but I pop my chest out a little. When my dad and Pat go to say hi to Reeve’s parents, I’m about to follow, but Tommy grabs my wrist. “You look good. When you coming to my place for a sleepover?” “Shut up, you tool! My dad’s right there!” I ended up hooking up with Tommy one night while I was sleeping over at Reeve’s. He fell asleep in the recliner and . . . I don’t know. I might have climbed on top of him. I was in mourning or something. And he is hot. Reeve comes across the lawn and puts his arm around my waist. “Leave her alone, Tommy.” Tommy trots back to the house, and at the last second he turns around and waves at me. “Not bad, DeBrassio,” Reeve says. “Where’d you get that dress from?” “I borrowed it from Lil brand-new,” I brag. “Had the tags on it and everything.” He gets a funny look on his face, like something’s dawning on him. I elbow him. “What?” He shakes his head. “Nothing.” “You look good too.” Reeve’s body was meant for a tux. Even though it’s a rental, it fits him perfectly. He has his hair wet and combed back, and with his strong jaw and bright smile—which was missing for so long that I forgot what it looked like—he looks like a leading man from some black-and-white movie. He grins and puts his thumbs in his suspenders. “I feel good. I feel like myself again.” We pose for pictures on his front lawn. I make sure to get some nice ones of me, Dad, and Pat. I’ll put one in a frame and take it with me to wherever I end up going to college, now that Oberlin’s out. No matter where I go, I’ll carry my dad and brother with me forever. Chapter Sixty-One LILLIA WHEN WE FINALLY GET OVER to Alex’s house, the prom is in full swing, and honestly, it’s even better than if we’d had it at the Water Club. The white tents and the twinkly lights look elegant, Gatsby-esque even. While Alex goes around saying hello to people, I make my way over to Ash and everybody. We’re exclaiming over each other’s dresses when I spot Kat and Reeve on the dance floor. Reeve’s behind Kat. She’s tucked up against him, she’s leading him by the suspenders, and they’re dancing in sync, laughing their heads off. It’s been so long since I’ve seen him happy. He looks so handsome and full of life. He looks like the old Reeve, and I’m glad. Even though it’s over between us, I still want to know that he’s okay. I’m stepping onto the edge of the dance floor just as Reeve’s walking off it, sweaty and flushed and out of breath. Smiling. When he sees me, his smile slips. “Hi,” I say, trying to keep my voice from shaking. I’m scared he’s going to be cutting, or mean, or indifferent. “You look good, Reeve.” I try to say it warmly, kindly, the way an old girlfriend would. It feels like whole minutes go by before he says, “So do you.” I lick my lips. They feel very dry. “I’m—I’m glad you came.” “Yeah, I wasn’t going to but Kat dragged me here.” Reeve takes a step closer to me, and without thinking I back away from him. He sees me do it, and his eyes go straight to his shoes. We’re standing in the shadows of the trees that surround Alex’s house now. The prom suddenly feels far away. “Can I just say something?” I’m afraid to say yes. I just look at him. “I’m sorry for what I said to you at the banquet. It wasn’t right. It was out of line.” Reeve’s looking at me steadily, waiting. “I wanted to tell you about what happened between me and that girl. And you know, what? I should have. It should have come from me, not from Alex or whoever. The only reason I didn’t was because I was scared that if you knew, you wouldn’t want to be with me.” He shoves his hands in his pockets. “Which is exactly what ended up happening, so . . . yeah.” My eyes fill up. I want to tell him that I knew. That I loved him anyway. “It’s all right. I’m sorry too—for the way things turned out.” The words come out thin and without conviction. “I would like us to still be friends.” Reeve shakes his head. “I don’t think I can do that.” He says it so softly, almost a whisper. “I’m sorry, I have to be honest. All night I’m thinking how it was supposed to be you and me. I know you don’t want to hear that. But we were supposed to be at prom together, Cho.” “Reeve, please. I—” “I’m never going to not want to be with you. I mean, I still love you, despite all the shit that’s gone down. I would do anything to be with you. So no, I can’t be”—he chokes—“your friend.”","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-59.html","bookId":2728,"book":{"id":2728,"title":"Ashes to Ashes (Burn for Burn #3)","description":"Storyline: New Year\u0027s Eve ended with a bang and Mary, Kat and Lillia may not be prepared for what is to come. After Rennie\u0027s death, Kat and Lillia try to put the pieces together of what happened to her. They both blame themselves. If Lillia hadn\u0027t left with Reeve... If Kat had only stayed with Rennie... Things could have been different. Now they will never be the same. Only Mary knows the truth about that night. About what she is. She also knows the truth about Lillia and Reeve falling in love, about Reeve being happy when all he deserves is misery, just like the misery he caused her. Now their childish attempts at revenge are a thing of the past and Mary is out for blood. Will she leave anything in her wake or will all that remain be ashes?","cover":"https://allnovel.net/images/ashes-to-ashes-burn-for-burn-3.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3.html","creation":"Oct 5, 2019 8:59:13 AM","modification":"Oct 5, 2019 4:21:37 PM"}}
