{"id":80189,"no":61,"title":"Page 61","content":"My stomach growls. I need to get on that buffet while the getting’s good. It was Mrs. Lind’s genius idea to get our prom catered, and I insisted we do Antoine’s. Balsamic glazed chicken br**sts, roasted red potatoes, those green beans I love. I head over to the buffet and see that it’s been pretty well picked over. If I want to eat, I’d better get to it. I get a plate and a soda and am heading back to the table when Lil grabs me by the arm so hard, I almost drop my plate. Frantically, she says, “I think I broke the spell. I’m sorry. I’m so sorry. Reeve kissed me and I kissed him back and something’s wrong. I can feel it.” “Shit,” I breathe. “Where is he now?” “He overheard me saying all this stuff to Alex and he said—he said he wasn’t going to bother me anymore and now he’s just gone. I’m afraid he’s going to do something crazy.” A sob escapes my throat. “Calm down, Lil. I’ll drive by her house and check that she’s still there. You go find Reeve.” The last thing I tell Lillia is that everything will be okay. I hope Mary doesn’t make a liar out of me. Chapter Sixty-Four LILLIA I RUN DOWN ALEX’S DRIVEWAY and along the road, where the valets have parked the cars. My heart is pounding in my chest, but I don’t stop running. I finally spot Reeve’s truck. Please be inside it. Please. But when I get closer, I see that he’s not. It’s empty. He’s gone someplace by foot. And then I spot his keys on the seat. I get in and tear down the roads. Where could he have gone? Maybe he went home? I check, even park the truck and run up to the house, but he’s not there. His bedroom windows are all dark, his mom and dad are watching TV alone in the den. He’s nowhere, and I’m wasting time. I should go check on Mary’s house. Kat might need me. I’m halfway to Middlebury, speeding up the road that rides along the edge of the cliffs, when I nearly run over him. He’s wobbling along the edge, a bottle of liquor in each hand. I slam the brakes, and he stumbles. And a ways up the road there’s Mary, sitting on the cliffs, watching him. I lean across the cab and jerk the passenger door open. “Get in!” “Cho, what the—” “Just get in!” I scream. He stares at me in shock, but he gets in. When I put my eyes back on the road, I see Mary there, standing in the middle of the street. Reeve still can’t see her. I drive his truck up and onto the other side of the road, to pass her. Reeve says, “What the hell is going on? What are you doing in my truck?” “It’s Mary. Mary Zane. Elizabeth!” Reeve’s eyes bulge. “What did you say?” “She’s been trying to hurt you, Reeve. Her spirit—she’s—she’s a ghost, Reeve. She’s come back here for you.” We’re speeding along. “We have to get off the island. She can’t leave.” His face is stark white. “Oh my God. I thought I was going insane. You’ve actually seen her? Oh shit. Shit, shit, shit.” I glance at the clock on my dashboard. The next ferry leaves in four minutes. We have to make it. We have to. “When you get to the mainland, don’t come back until I call you.” “I’m not going anywhere without you.” “Reeve, don’t argue with me! You aren’t safe here.” His jaw sets stubbornly. “I’m not leaving you.” We pull into the ferry parking lot, and, thank goodness, the ferry’s still there. There aren’t any cars waiting to board, just us. We’re pulling forward when I see her. Standing in the parking lot, right in front of us, in that gauzy white dress, looking like an angel. Face twisted up and screaming for me to stop. There’s only one thing I can do. I hit the gas. The dockworkers shout and wave their hands at us. “No more cars!” they shout. This time I drive straight through Mary and up onto the ferry. I spin around and look through my rear window. She’s staring back at me. She doesn’t move. She just watches Reeve and me and then disappears as the drawbridge is lifted and the ferry pulls away from the shore. Chapter Sixty-Five KAT I DRIVE A MILLION MILES an hour to T-Town. Dad and Pat are back working in the garage, the hatch door lifted high. They see my headlights bounce up the driveway, and they wander out. Dad flops a rag over his shoulder. “Kat? Why are you back so soon?” I don’t answer him. I just run as fast as I can to my room and grab Aunt Bette’s books, the candles, the spices, and the salts, and the rest of the shit we used on Mary. I throw it all into my book bag. Just in case. I have no idea what we might need, or if any of it will work if our spell is broken. I glance at the clock on my way out. God, I really hope this is a false alarm. When I’m back outside, I find Pat blocking my car door, arms folded. “What’s going on?” “Move, Pat!” “Come on. Just tell me—” “Move!” I push him out of the way, which isn’t easy in heels and a prom dress. He tries to stand his ground, and we wrestle for a second, but then Pat must see that I am so not f**king around right now, because he steps back. “Okay, okay.” I jump into my car, put it in reverse, and hit the gas so fast, the tires spin smoke. Then I’m flying down the street, Dad and Pat left bewildered in my taillights. I drive, drive as fast as this piece-of-shit car will go, across Jar Island to Middlebury. The movie theater, Java Jones, all the tourists are colored streaks out my window. A few minutes later I pull into Mary’s driveway. Her house is as dark as the sky. I hike up my dress and tiptoe through the moonlit yard, on high alert, glancing around. Is Mary here? Is she watching me right now? Or maybe Lillia was wrong. Maybe she didn’t break the spell. The crickets and my pounding heart are the only noises until, far off in the distance, the ferry horn sounds. I stand underneath Mary’s bedroom window and wait for her to come, like she did once before. When she doesn’t, I get this feeling, this sick-ass feeling that someone’s going to get hurt tonight. Maybe Reeve. Or maybe us. Me and Lillia. Mary knows what we’ve done, that we tried to cage her spirit. I hold tight to my bag. I’ve got to fix this, or we’re all done for. I walk through the front door. Though it’s dark, I can see that Lillia’s necklace is gone, the salt disturbed. Every door we bound shut upstairs has been opened wide.","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-61.html","bookId":2728,"book":{"id":2728,"title":"Ashes to Ashes (Burn for Burn #3)","description":"Storyline: New Year\u0027s Eve ended with a bang and Mary, Kat and Lillia may not be prepared for what is to come. After Rennie\u0027s death, Kat and Lillia try to put the pieces together of what happened to her. They both blame themselves. If Lillia hadn\u0027t left with Reeve... If Kat had only stayed with Rennie... Things could have been different. Now they will never be the same. Only Mary knows the truth about that night. About what she is. She also knows the truth about Lillia and Reeve falling in love, about Reeve being happy when all he deserves is misery, just like the misery he caused her. Now their childish attempts at revenge are a thing of the past and Mary is out for blood. Will she leave anything in her wake or will all that remain be ashes?","cover":"https://allnovel.net/images/ashes-to-ashes-burn-for-burn-3.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3.html","creation":"Oct 5, 2019 8:59:13 AM","modification":"Oct 5, 2019 4:21:37 PM"}}
