{"id":80139,"no":8,"title":"Page 8","content":"I feel my lip curl. Who is she to ask me that? “Yeah,” I say through gritted teeth. “Yeah. I was.” And it’s true. At the very end I was Rennie’s friend.\\n\\n “I see,” she says, and then lowers her eyes. “Well, I’d like to apologize to you, Katherine. I shouldn’t have reacted that way. It’s a crazy time of year for us here, and I already feel like I’m behind on everything.” She sighs. “Please take today off if you need . . . but if you could manage to give me an hour or two, I’d greatly appreciate it.”\\n\\n “I’ll stay for a bit,” I say, and then turn to head down to the basement. That’s where I scan the old documents and deeds and newspaper clippings for the Preservation Society archives. But Danner touches my shoulder and keeps me from walking away.\\n\\n “Actually, the archival project is on the back burner for now. Our focus will be on the annual benefit happening this March. I don’t know if your parents have ever attended one”—I watch her look me over, realizing there’s no way—“but this will be an excellent experience for you. I’ll make sure I put it in your recommendation letter. Admissions boards really respond to charity projects.”\\n\\n I want to laugh. Charity projects are working at a soup kitchen or volunteering at a battered-women’s shelter. Not running errands for a bunch of rich ladies pretending like they have jobs.\\n\\n But I do need a stellar recommendation to get me accepted to Oberlin. That’s the one bright spot I’ve got to hold on to. A future away from this island, from the hurt and the pain and all the bad memories.\\n\\n When I think about it that way, I can’t blame Mary for wanting to leave.\\n\\n “What’s this benefit for?”\\n\\n “To raise money for this year’s preservation efforts. It’s a huge formal dinner dance at the old city hall building, plus a silent auction. Last year we received almost half a million dollars, which we put toward the purchase and renovation of Jar Island landmarks.”\\n\\n A prom for rich people. Jeez.\\n\\n Danner trots back to her office and then returns with several pieces of paper. “Okay, Katherine. I need you to double-check these invitation addresses against the ones in our Rolodex. Evelyn worked on them this morning, so there shouldn’t be too many left for you. We need to make sure each one is correct before we send the final list off to the calligrapher. He charges per envelope, and we can’t afford to waste money on preventable errors.”\\n\\n I’m about to tell Danner that they could save money by, um, not spending money on dumb shit like that. I mean, this is supposed to be a fund-raiser, right? But Danner’s already headed into the glass-walled conference room, where a table full of ladies are heatedly discussing something. Probably arguing about waiter outfits.\\n\\n I lock eyes with Evelyn, who’s the oldest lady by far at the office. I doubt they’d let her work here if she weren’t filthy rich, and I bet they hope she’ll throw some money to the Preservation Society when she kicks off. Evelyn’s working at a computer, her hand tentatively going for the mouse like it might come to life and bite her wrinkly fingers.\\n\\n I take a seat at an empty desk and flip through the list. I only have three pages to check before I get to the end of the alphabet . . .\\n\\n Erica Zane?\\n\\n Mary’s last name. Could this be her mom?\\n\\n There’s no address listed. Just a phone number.\\n\\n I’m so excited, I can barely dial. What if Mary picks up the phone? What will I say?\\n\\n I don’t have to worry long. As soon as I punch the last number, I hear three chimes and a recording that this number is no longer in service.\\n\\n Where have these Zanes gone to?\\n\\n I check the rest of the addresses and wait for Danner to be done in the conference room. As soon as she is, I’m on top of her, pointing at Erica Zane’s name.\\n\\n “I couldn’t find an address for her in the Rolodex. And this phone number is out of service. What should I do?”\\n\\n Danner’s lip curls. She takes a black pen and scratches out the name. “Don’t worry about that one. She shouldn’t be on the invite list.”\\n\\n Well, damn. My only lead is a bust.\\n\\n Chapter Eight\\n\\n LILLIA\\n\\n PAIGE TEXTS ASKING ME TO stop by after school. When I get there, the door’s unlocked, so I let myself in and call out, “Paige? It’s Lillia.”\\n\\n I stop in the kitchen first. There are dishes neatly stacked in the drying rack, freshly washed. Paige hates doing dishes. That was always Rennie’s job. It must have been Reeve. Ash told me he’s been helping Paige out too. I turn around and see that he tied up a bag of cans and bottles for recycling and set it near the front door.\\n\\n “In here, Lil!”\\n\\n I find Paige in her bedroom, still in her robe and pajamas. She’s packing her clothes into a cardboard box. She looks up at me, and her eyes have that zombie look to them that she gets when she takes her sleeping pills.\\n\\n “Are you moving?” I ask her. This is the first I’m hearing of it. But I guess it makes sense. Paige always said she’d leave Jar Island after Rennie graduated. The only reason she stayed this long was because Rennie begged her.\\n\\n “I’m out of here before the end of the month. Rick wants me to go live with him. I can’t stay on this island, not without my girl. There’s nothing left for me here.” Paige wipes her eyes, and in a dull voice she says, “You should take a look around Ren’s room, see if there’s anything you want to keep of hers as a memento. Like maybe that necklace you gave her. I would have buried her in it, but—” She breaks down and starts to cry, and holds her arms out to me, so I go to her. She holds on to me tight. “Stay for dinner, okay?”\\n\\n I don’t want to. I know that if I say yes to dinner, Paige will push me to spend the night, and I can’t. I can’t wake up in Rennie’s bed alone again. But it’s not about what I can or can’t do. It’s about what I have to do. Being kind to Paige is my penance, a way to right the wrongs I did to Ren. “Sure, I’ll stay,” I say.\\n\\n I go to the bathroom to call my mom. When I tell her I won’t be home for dinner, it’s clear she doesn’t like it, because she is silent for a minute. Then she says, “Lilli, this is too much for you. You’re only a child yourself. You need to rest.”\\n\\n I wish I could. But I can’t. I don’t deserve to. So I whisper, “Mommy, this is the least I can do for Rennie. Please.”\\n\\n She sighs heavily. “Make sure you eat something healthy. And send Paige my love.” \\n\\n","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-8.html","bookId":2728,"book":{"id":2728,"title":"Ashes to Ashes (Burn for Burn #3)","description":"Storyline: New Year\u0027s Eve ended with a bang and Mary, Kat and Lillia may not be prepared for what is to come. \\n After Rennie\u0027s death, Kat and Lillia try to put the pieces together of what happened to her. They both blame themselves. If Lillia hadn\u0027t left with Reeve... If Kat had only stayed with Rennie... Things could have been different. Now they will never be the same. \\n Only Mary knows the truth about that night. About what she is. She also knows the truth about Lillia and Reeve falling in love, about Reeve being happy when all he deserves is misery, just like the misery he caused her. Now their childish attempts at revenge are a thing of the past and Mary is out for blood. Will she leave anything in her wake or will all that remain be ashes?\\n","cover":"https://allnovel.net/images/ashes-to-ashes-burn-for-burn-3.jpg","author":"Jenny Han","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3.html","creation":"Oct 5, 2019 8:59:13 AM","modification":"Oct 5, 2019 4:21:37 PM"}}
