{"id":106028,"no":50,"title":"Page 50","content":"The major regarded her with that same expression of curled lip and narrowed eyes she had seen earlier. He said nothing more, but gave the command to withdraw.\\n\\n The crowd advanced as the cordon drew back. Then, with the single bestial voice of the true mob, they broke into a run.\\n\\n Above the noise of the mob, there came another, even more ominous grumble. Vara turned her cart about. The major surrounded her with five of his most highly trained officers and barked commands for the rest to hold their ground. He had made his calculation and seen that they would not reach any possible shelter, or a better defensive position, before the mob was upon them.\\n\\n Vara strained to see between the Specials, to hear above the shouting and the sharp commands. A breeze brushed her cheek. Dozens of small drones soared over the plaza, tiny buzzing spheres the size of a clenched fist. The mob ignored these surveillance units.\\n\\n Vara stood up on her cart and stepped down. She could run faster than the cart, if she had to. Or she could order one of these men to carry her. Her thin arms and legs trembled in anticipation of the strain she would face. She was delicate, she knew that; her strength lay elsewhere, and she wondered how much of the mob she could persuade, if they crowded around her, suffocating her with their individual minds.\\n\\n She gave a little squeak. Yes, she thought. I’m just like a mouse, a terrified little mouse. I am a pitiful thing, but please, oh please, let me concentrate! I can beat them all if I concentrate!\\n\\n Vara felt her inner resources surge. She thought she detected a cringing of the shoulders of the men around her as she set up her defenses. She had never had to protect herself against so many. As she felt her concentration of forces begin, her fear seemed to ebb. Even should the personal shields collapse, or should they be pushed by the mob up against a wall and crushed within those shields--a possibility!--she would not be helpless. If Sinter could not help, if the major and his Specials could not help, then she would still prevail.\\n\\n She saw the shadows descend even before she heard the thump of blades and the pulsing engines of troop deployers. The major threw up his arm against the wash of air, and the shadows swept over them. As the craft landed, they seemed to rise up from the floor of the plaza, rather than descend, as she knew they must.\\n\\n Four slender deployers perched on their crackling blue pylons before the mob. She knew the mark on their sides: an oval of stars surmounting a galaxy and a twinned red cross, the private responsive army of the Emperor, the External Action Force, almost never seen. The Emperor has sent his forces to protect us, she thought with some relief, then drew her fist up to her mouth.\\n\\n Farad had once told her the External Action Force had not been used in years, and that Klayus hated and feared them; they had once been commanded by the retired General Prothon, and Prothon’s specialty--the only reason he was ever called out of retirement--was the removal of Emperors.\\n\\n At the sight of the machines, the mob halted and fell silent. This was unexpected. That External Action Force--supposedly used only when the status of the throne itself was threatened--might become involved in a mere riot was sobering. Some in the crowd broke free of the mob mind, muttered among themselves. The front of the crowd churned and shrank back.\\n\\n Within a few seconds, a hundred armored and shielded troops in blue and black, with red-striped helmets, had dropped from the hatches of the deployers and formed two lines, one before the crowd, the other directly before Vara Liso and her Specials.\\n\\n The last to emerge was General Prothon himself, huge, with bull shoulders and immense arms and a barrel gut straining at his formal uniform. His face was almost boyish, with wispy gray mustache and a tiny goatee, and his small, sharp eyes darted back and forth with gleeful energy. He seemed happy to be arriving at a party.\\n\\n Prothon paused for a moment between the lines, looked left and right, then swung about and approached--\\n\\n Vara Liso.\\n\\n His eye fell on her immediately, and he stared at her intently, almost merrily, as he strode on long, thick pillar-legs. Some said he was from the planet Nur, a heavy, oppressive world; but in truth, nobody knew where Prothon came from, or how he had achieved his position.\\n\\n Some said he was the secret Emperor, the true power within the palace, even above the Commission of Public Safety, at least since the exile of Agis IV, but rumors were not fact.\\n\\n Prothon pushed his way through the phalanx and stood before her. Vara blinked up at the massive chest surmounted by the comparatively small head with its amused, pleasant face.\\n\\n “So this is the little woman who would provoke the big war,” Prothon said in a lovely tenor voice. For a moment, facing what might be her doom, Vara was smitten by this paradoxical combination of bull strength and attractive boyishness. “Any success today?” he asked sympathetically.\\n\\n Vara blinked several more times, then mumbled, “I sense...”And stopped herself with a knuckle against her lips. She wanted to cry, or to lash out, and wasn’t sure what she would do. Make this monster bend and weep with me, before me.\\n\\n “There’s a warehouse in the storage district,” she murmured, and Prothon stooped beside her, as if proposing marriage, to listen more closely.\\n\\n “Again, please,” he said gently.\\n\\n “There’s a warehouse in the storage district, retail center. I’ve been past it a dozen times in the last few weeks. It seemed innocuous enough--but I’ve been tuning my senses, listening more closely. I am sure there are robots inside the warehouse, perhaps a great many of them. The Chief Commissioner of the Commission of General Security--”\\n\\n “Yes, of course,” Prothon said. He rose and glared out over the Specials, through the lines of his own troops, to the mob. “We’ll get you through to the warehouse,” he said. “After that, no more. It’s over.”\\n\\n “What’s...over?” she asked hesitantly.\\n\\n “The game,” Prothon said with a smile. “There are winners, and there are losers.”\\n\\n 67.\\n\\n Lodovik heard the warning sirens in his head, as did all the robots within the warehouse. He had worked out the evacuation plan with Kallusin the night before. Kallusin had told him that Plussix had anticipated a general disruption, possibly a discovery...\\n\\n And now most of their avenues of escape were blocked by Imperial Specials. Kallusin and the other robots were busy in another part of the warehouse, carrying the heads and other precious Calvinian items: thousands of years of robot history and traditions, the memories of dozens of key robots, stored in dissected memory nodes or, in a few cases, in the whole heads. There was a religious aspect to the respect Kallusin held for these relics. But Lodovik had little time to contemplate the peculiarities of this robot society.\\n\\n Lodovik found Klia and Brann in the dining hall at ground level. The young woman looked determined but scared--wide-eyed, face flushed. Brann seemed uncertain but not frightened, merely nervous.\\n\\n Lodovik ignored a communication from Voltaire, a commentary on romantic oppositions that seemed completely useless.\\n\\n “We are leaving now,” Lodovik said.\\n\\n “We’re packed,” Brann said, and lifted a small cloth bag that contained all their worldly goods.\\n\\n “I can feel her. She’s looking for us,” Klia said.\\n\\n “Perhaps,” Lodovik said. “But there are hidden passages out of the lower levels that have not been used in thousands of years. Some emerge close to the palace detention center where Seldon is kept--”\\n\\n “You know the palace--the codes for entry?”\\n\\n “If they have not been changed. There is a certain inertia in the amendment of palace procedures. The codes for the Emperor’s quarters are changed twice a day, but in other portions of the extended palace, there are codes that have been in place for ten or fifteen years. We will have to take some risks--”\\n\\n The codes that you do not know, I can access, Voltaire told him.\\n\\n “Just get us out of here!” Klia said. “I don’t want to have to fight her.”\\n\\n “We may have to fight others,” Lodovik said. “To persuade them, or to defend ourselves.”\\n\\n Klia shook her head with stubborn boldness. “I don’t care about them. Not one in a thousand persuaders can hold a candle to Brann and me working together. But that woman--”\\n\\n “We can beat her,” Brann said. Klia glared at him, then shivered and shrugged her shoulders.\\n\\n “Maybe,” she said.\\n\\n “Do you know robot mental structures well enough?” Lodovik inquired as they walked toward the elevators.\\n\\n “What do you mean?” Klia asked. The ancient elevator doors opened with the smooth heaviness of Old Empire engineering. A feeble green emergency light blinked on within. They stepped into the ghoulish glow.\\n\\n “Can you persuade a robot?” Lodovik asked.\\n\\n “I don’t know,” Klia said. “I’ve never tried. Except with Kallusin--once--and I didn’t know he was a robot. He fended me off.”\\n\\n “We have a few minutes,” Lodovik said. “Practice on me.”\\n\\n “Why?”\\n\\n “Because to get to Hari Seldon, we may have to confront Daneel. Remember what Dors Venabili said.”\\n\\n “Robots are so different,” Klia murmured.\\n\\n “Practice,” Lodovik said. You would give up your free will to this child? Voltaire asked, understanding the question was rhetorical. Now we take advantage of the most evil of weapons! Which is worse--robot mind-warping, or human?\\n\\n “Please,” Lodovik said. “It may be very important.”\\n\\n “All RIGHT!” Klia shouted, feeling pushed. She did not like this--told herself she did not want to discover a new weakness in the middle of her fear. “What should I do--make you dance a jig?”\\n\\n Lodovik smiled. “Whatever comes into your mind.”\\n\\n “You’re a robot. Couldn’t I just order you to dance, and you’d have to obey?”\\n\\n “You are not my master,” Lodovik said. “And remember--”\\n\\n Klia turned away and put a hand to her cheek.\\n\\n Lodovik suddenly realized it would be very pleasant to test his motor-control circuitry. The elevator would be a perfect place in which to conduct these tests, so long as he was careful not to bump into the humans who occupied it with him. It was simple, really, this urge to move, simple and pleasant to contemplate.\\n\\n He began to dance, slowly at first, feeling the affirmation, the approval: thousands of humans would rate his performance highly, if not in artistic terms, certainly for the skill with which he was testing all his engineered routines. He felt very coordinated and worthy.\\n\\n Klia removed her hand from her cheek. Her face was wet with tears.\\n\\n Lodovik stopped and swayed for a moment as his own robotic will sorted through disparate impulses and reached a new balance.\\n\\n “I’m sorry,” Klia said. “That was the wrong thing to have you do.” She wiped her face quickly, embarrassed.\\n\\n “You did well,” Lodovik said, a little dismayed by the ease with which she had controlled him. “Did Brann coordinate with you?”\\n\\n “No,” Klia said.\\n\\n Brann seemed stunned by her success. “Sky, we could take over all of Trantor--”\\n\\n “NO!” Klia shouted. “I’m sorry I did this.” She held her hands out to Lodovik as if seeking his forgiveness. “You’re a machine. You are so...eager to please, deep down inside. You’re easier than a child. You are a child.” \\n\\n","sourceLink":"https://allnovel.net/foundation-and-chaos-second-foundation-trilogy-2/page-50.html","bookId":1536,"book":{"id":1536,"title":"Foundation and Chaos ( Second Foundation Trilogy #2)","description":"Storyline: Foundation and Chaos (Second Foundation Trilogy #2) \\n A major science fiction author continues one of the most famous SF stories of all time.\\n","cover":"https://allnovel.net/images/foundation-and-chaos-second-foundation-trilogy-2.jpg","author":"Greg Bear","type":"Adventure","source":"allnovel","link":"https://allnovel.net/foundation-and-chaos-second-foundation-trilogy-2.html","creation":"Oct 5, 2019 8:57:41 AM","modification":"Oct 5, 2019 10:49:16 PM"}}
