{"id":57164,"no":56,"title":"Book 3 Chapter 10","content":"B3C10: Explode (1)\\n\\n In Qin Yu’s courtyard house, there is absolutely no one around to disturb him. Qin Yu’s entire body has turned into several illusions which are moving nonstop in the courtyard house.\\n\\n “Strange, I have slowed down, why hasn’t the density increased? But just now …” Qin Yu frowns deeply. At the moment he is performing the movements of the 36 pictures at a slower speed than before but the 36 energy streams engulfing him do not even have any silvery light.\\n\\n However, it is very clear to him that just now when he heard Xu Yuan’s voice and started to slow down, the density of those holy energy streams suddenly increased and those silvery light points fused directly with his body like flowing sand in that moment.\\n\\n “Could it be?” Qin Yu suddenly thinks of one possibility.\\n\\n He increases the speed of his movements at once. Various silvery light points once again appear in the 36 intertwined energy streams and continuously fuse with Qin Yu’s body. This is the speed Qin Yu originally thought to be the optimum speed. Suddenly … he slows down.\\n\\n The wind rises and the holy energy in his vicinity vibrates for a short while. The density of the silvery light in the 36 energy streams surrounding Qin Yu suddenly increases.\\n\\n Qin Yu’s eyes pop out of his head. This concentrated silvery light is fusing with his body like concentrated silvery sand. One after another, these silvery light points are fusing with the flesh, bones and channels of his entire body. An extremely numbing sensation spreads throughout his body.\\n\\n “Amazing!” Qin Yu cannot help uttering a loud shout.\\n\\n This kind of sentation is really giving Qin Yu an unprecedented intense pleasure. It is 10,000 times more enjoyable than getting massaged. However, in just a while, the density of the silvery light points suddenly drops to the extent that it is even lower than when Qin Yu started to exercise at that normal speed.\\n\\n “What’s going on?” Qin Yu finally stops. His mind is completely puzzled.\\n\\n “Judging from what has happened today, it seems being fast all the time is useless, and being slow all the time is even worse. But when I moved fast from the beginning then suddenly slowed down at the 16th movement, the result was extremely good …” Qin Yu ponders.\\n\\n “Could it be …” Qin Yu’s eyes brighten. “Could it be I must adjust my speed properly while executing these movements so that I’m fast when it should be fast and slow when it should be slow? Is combining swiftness with slowness the most suitable way?”\\n\\n As soon as Qin Yu comes up with this idea, he starts to try it at once.\\n\\n First, he performs the movements at a constant fast speed. Then upon reaching a certain movement he suddenly accelerates or decelerates. Using this method, he can determine whether a certain movement should be executed fast or slowly. However, as Qin Yu researches more into these movements, he starts to find this troublesome because …\\n\\n Take the 16th movement, for example. He should slow down at this movement, but to what extent must he slow down? How much must he slow down at this movement in the end? And it is the same with when he must speed up. Moreover, successive movements must harmozine with each other and the transition from one to another must be smooth.\\n\\n For example, when he changes from the 3rd movement, in which his right hand is in a low position, to the 4th movement, in which the right hand is in a high position, even the path travelled by his hand must be researched carefully. Different paths will produce different results.\\n\\n In short, to figure out the perfect technique based on only these 36 mysterious pictures is after all truly a screaming problem.\\n\\n Every time Qin Yu researches into the movements, he experiences them with a completely calm and collected mind. Time goes by. Only after a whole month can Qin Yu finally almost figure out the right practice method of this technique. A brand new Trans-Heaven-diagrams-based technique appears.\\n\\n A month later,\\n\\n Qin Yu’s body is wafting about in the courtyard house like a breeze.\\n\\n When he moves fast, he appears to be slow.\\n\\n But when he moves slowly, his entire body creates various afterimages.\\n\\n Strange, this is extremely strange.\\n\\n The strangest thing is that there is a silvery suit of armor enfolding Qin Yu. No, it is not a silvery suit of armor. Rather, it is an armor-like mass of energy formed by the 36 pure silvery energy streams intertwining with each other around Qin Yu’s body. These 36 silvery energy streams are continuously permeating into Qin Yu’s body. At the same time, they are absorbing the world’s holy energy to replenish themselves.\\n\\n “Hah, amazing!” Qin Yu suddenly stops. His entire body shakes for a short while. The 36 silvery energy streams also vanish away.\\n\\n In the beginning, the silvery light points were sparse, but now any energy stream is made up almost entirely of the silvery light points. For the last month, Qin Yu’s body has been transforming quickly with each passing day. Both his strength and speed have increased by several times.\\n\\n Qin Yu slightly closes his eyes.\\n\\n The 36 pictures have formed a perfect set of movements. And Qin Yu is executing one movement after another in his mind, sometimes fast, sometimes slowly. The 1st technique of the Trans-Heaven digrams has finally been figured out by Qin Yu.\\n\\n Qin Yu’s eyes suddenly open wide, glittering dazzlingly.\\n\\n “I wonder what secrets the 2nd and 3rd Trans-Heaven diagrams have.” He starts to look forward to the other diagrams. He fully enjoyed this wonderful feeling of nonstop improvement in his body. Therefore, he naturally has high expectations for the other 2 diagrams.\\n\\n “I remember …” Qin Yu suddenly recalls that, in the courtyard where Lian Yan was killed, when he was beside Lian Yan’s body, his holy sense swept around and discovered the aura of another Trans-Heaven diagram. However, Qin Yu was too immersed in mourning at that time to take notice of this.\\n\\n “After getting that Trans-Heaven diagram, father must’ve put it in the Secret Treasury.” Qin Yu immediately beams because he is eligible to enter the Secret Treasury. Even if he wants to take out a treasure, he will only need to let Qin De know about it.\\n\\n Qin Yu takes out from his bosom the 1st Trans-Heaven diagram and says smilingly: “This first Trans-Heaven diagram is no longer very useful to me. Let’s quietly put it in the Secret Treasury.”\\n\\n Qin Yu does not want to let his father know that he is assassin Liu Xing so, even though Qin De may not know that assassin Liu Xing took the 1st Trans-Heaven diagram, he will have to quietly conceal it in an unobtrusive place in the Secret Treasury just in case.\\n\\n For an entire month, Qin Yu has been training without eating anything.\\n\\n Now thinking about this, Qin Yu is extremely astonished because, to his knowledge, to reach the level where food and drink are no longer needed, at least a practitioner must be able to absorb holy energy at a shocking speed. Thanks to the Meteoric Tear, Qin Yu can already absorb holy energy extremely fast. In addition to that, he has been practicing the secret technique of the 1st Trans-Heaven diagram, so currently the holy energy he absorbs even turns into silvery light points.\\n\\n “It’s good to progress so fast in practice. It doesn’t matter if the cause of this is the mysterious Meteoric Tear or the Trans-Heaven diagram’s secret technique, its principle isn’t something I can guess,” says Qin Yu with a smile.\\n\\n Then Qin Yu leaves the courtyard house at once and hurriedly heads for Qin De’s place. At least it will not be late for him to enter the Secret Treasury after greeting Qin De first.\\n\\n “Third Prince,” say the 2 guards of Qin De’s place after getting down on one knee.\\n\\n “Please tell father that I want to see him,” says Qin Yu immediately.\\n\\n A guard says: “Third Prince, His Highness has been undergoing closed-door training for a half month and still hasn’t come out. His Highness has given the order not to let anyone disturb him during this closed-door training session.” Hearing this, Qin Yu cannot help being stupefied by the fact that even his father is undergoing closed-door training.\\n\\n “Alright, then you two keep guarding.” Qin Yu gives a smile then turns around and goes to the Secret Treasury. There will not be any serious problems even if he does not tell Qin De about this.\\n\\n There are obviously many guards in the corridor outside the Secret Treasury. However, seeing Qin Yu, they do not obstruct him in the slightest. Qin Yu thus goes into the most distant attic. After entering a side room in the attic, he activates a device.\\n\\n With a clack noise, a stone door appears on the wall of the side room – this is the stone door leading to the Secret Treasury. Qin Yu goes into the Treasury instantly. The stone door then moves and shuts again.\\n\\n End of b3c10.\\n\\n \\n\\n \\n\\n Previous Chapter Next Chapter","sourceLink":"https://www.wuxiaworld.com/novel/stellar-transformations/st-book-3-chapter-10","bookId":1510,"book":{"id":1510,"title":"Stellar Transformations","description":"星辰变, aka Stellar Transformation, is a webnovel by popular Chinese Xianxia (fantasy/kung fu) writer I Eat Tomatoes （我吃西红柿）.\\n","cover":"http://cunovel.com/img/ST.jpg","type":"Wuxia","link":"https://www.wuxiaworld.com/novel/stellar-transformations","creation":"Sep 10, 2019 12:39:40 AM","modification":"Sep 25, 2019 12:28:19 AM"}}
