{"id":95036,"no":19,"title":"Page 19","content":"In the center square, decorations hang limp in the rain—lanterns dripping and water pooling under brightly woven banners. The stage is draped with swaths of cloth in the colors of the Protectorate. The Recruiters’ visit is always a cause for celebration for those who aren’t leaving with them. It’s Vista’s chance to shine, to prove it still deserves its place in the Protectorate. But today it all looks muddy and soggy. I skirt the activity, avoiding eye contact as I tug my hood low over my face and walk to the guardhouse by the gate. Daniel sees me before I get too close and he limps out to meet me, his mouth pulling into a slow smile. In the damp gray it’s easy to forget last night, how dark his face looked as shadows crept about it when he leaned over me, Elias’s knife gleaming between us. “How’s your mother, Gabrielle?” he asks. I try to smile as well but I know it doesn’t reach my eyes. “Better,” I tell him. “Though with the storm coming in I think we’ll need Militia help on the beach.” He nods and I think about my dream, about the whispers of all the dead. I tap my fingers against my leg with agitation. I wonder now if I shouldn’t have told him about the Soulers. If I should have waited, given Elias a chance to explain it all to me. “Listen—” I have to clear my throat before I can continue. “About the Soulers and what I said last night—” Before I can go on he cuts in, his eyes gleaming. “You were right,” he says, almost bouncing with excitement. “About what you saw from the lighthouse. It was the Soulers.” “Oh” is all I can say. He waits for my enthusiasm but I can’t muster it. His eyes narrow. He steps closer to me; only a few drops of rain are able to penetrate the space between us. “The Protectorate values loyalty,” he says, his tone a little sharper. He feels too near and I drop my hand to my hip out of habit, a defensive stance. He glances down and sees my fingers resting on the hilt of the knife. I know he recognizes it from last night: the Souler knife. He cocks his head to the side. “And to be honest, the Chairman’s always questioned your mother’s, since she’s an outsider. Claiming to be from the Forest, no less.” His hand closes over mine, over the knife, and I try to pull away but he tightens his grip. I wonder if the other Militiamen are watching us, if they have any idea what Daniel’s saying. I wonder what would happen if I called out to them, if I shouted for help. But I don’t trust that they wouldn’t just ignore me, leave me to Daniel’s whim. “There’s no reason for the Chairman—or me—to doubt your loyalty too, right?” I stare at his narrowed eyes. I never knew him that well growing up. He’s older and was friends with boys who all left in the past few years to join the Recruiters. I’ve always wondered if being left behind because of his leg made Daniel angry, bitter against the Protectorate. I can’t tell if his warning is because he’s unquestionably loyal to the Chairman or because he cares about me. A part of me wonders if I could tell him the truth. I want so badly to be able to trust someone and have them say that everything’s going to be okay. I wonder if maybe I’m too suspicious of Daniel. But his fingers bite into my wrist and nothing in his expression betrays his emotions. Just then there’s a shout from the head Militiaman, Wesson, who’s standing on a platform with a view over the Barrier. Daniel eases away, the tension between us popped like a bubble. Militiamen begin to crowd around the gate as it grinds open, and Daniel steps in front of me, shielding me from the world beyond. “What’s going on?” I ask, but he’s no longer focused on me. “Stand back just in case,” he says, placing a hand against my stomach to push me farther behind him. More Militia begin to crowd around and I feel their agitation—it vibrates in the air. They clench weapons tight in their fists and stand poised on the balls of their feet. The gap in the gate widens enough that over Daniel’s shoulder I can see down the old road. I recognize them instantly: the Soulers. They’re being led by a group of Militiamen from Vista, their black shirts soaked and the blades of their scythes and axes gleaming in the rain. The Soulers walk slowly, purposefully. Each wears a white tunic. The hems of their pants and skirts are thick with red mud, and most of them are so thin that they seem almost emaciated, with gaunt cheekbones and sunken eyes. Even in the dull light it’s easy to see how worn they look, how brittle their bodies appear. They look nothing like they did last night, menacing in the dark shadows of the moon. Now they appear harmless and weak. Except for the Mudo they tug along behind them on rigid leashes. I swallow against the tension buzzing along my arms as I scan the faces of the Soulers, wondering if Elias is among them. I feel stupid. I know I should want him to be captured, I should want him to pay for being part of a cult that could do what I saw last night. But I can’t forget how gentle he was with me—how he saved me on the beach. More Militiamen rush through the opening, crowding around the group and creating a chaos of shouts and moans. Daniel spits on the muddy ground, still holding his arm across me, his flesh heavy against my body. They’re too far away for me to see if Elias is there, and my irritation is hard to hide. “What’ll happen to them?” I ask. Daniel shakes his head. “They’ll be quarantined,” he says simply. “The Protectorate may allow the Soulers to go settlement to settlement preaching their filthy lies wherever they want, but it’s our right to quarantine anyone seeking entrance to Vista.” As the Soulers draw closer even more Militia pour out of the gates, their weapons held ready. The sky vibrates with thunder and lightning. I stare at first the Soulers and then the Militiamen, the strain and tension of the moment filling the air. One of the Soulers steps forward, an older man, slightly stooped, his eyebrows shot through with gray. Attached to his wrist is a rigid leash leading to a jawless and toothless Mudo. “The Third Order of the Soulers begs entrance to your city, that we may spread the word of God and the truth of his salvation through resurrection.” He spreads his arms wide as he talks, his tunic plastered to his skin. The movement jostles the leash and the Mudo he’s holding stumbles slightly, reaching toward a Militiaman. Daniel tenses in front of me and I cringe as everything seems to happen at once. The Militiaman swings his blade at the Mudo. A young Souler woman jumps forward to stop him. The Mudo moans, reaches, his jawless face dripping rain. And the ax slices across the Souler’s chest. Blood seeps through her tunic, a spray of red. Everything’s still for that moment. The woman wobbles. In her hand she holds her own leash, attached to a Mudo next to her. Her fingers go limp and the chain slips from her grasp. I recognize her—she’s the woman from last night, the one who held the boy as he turned. She’s the one I wanted to rip to shreds for what she allowed to happen to him. But now, seeing her standing there with the blood, the disbelief in her eyes, everything changes. She looks so different now. Frail where she was strong, round where she was sharp. She looks older, more hunched over, as if the weight of everything has finally grown too much. She collapses to the ground. The scent of her blood hits the air and saturates the space around her. I know the instant it reaches the Mudo. They erupt, their moans high-pitched and fevered. They all stumble toward her and the Soulers try to yank at their chains to keep them at bay. They tug at their collars as if they might tear through the air, pull themselves to the woman. The Militiamen explode, screaming and shouting. They swing at the Mudo, the Soulers begging and pleading for mercy, afraid that another one of them will be hit. The rain intensifies and people slip in the mud. The Mudo the woman was leading is the boy who sacrificed himself. His teeth are gone, as is his lower jaw. And now that he’s free, now that the chain is loose, he reaches for the woman. If he had teeth he would devour her. But instead he just pushes himself against her, eternally hungry. The Militiaman with his ax dripping blood swipes again, embedding the blade in the Mudo boy’s neck, and he falls over the woman. She screams and clutches at him, the vision so similar to that of last night—but so horribly different. Bile rises in my throat as I watch the woman reach for the Mudo boy’s face. She shoves her fingers into what used to be his mouth, frantic, as if she might somehow infect herself before her injury takes her. I step back, wanting to run, wanting to get as far away as possible from what’s happening. From the screams and shouts and moans and blood. The Militia decimate the Mudo, decapitating them even as the Soulers plead for them. The Militiamen push the Soulers away, forcing them to kneel on the ground. Everything’s out of control and wrong. “We’re members of the Protectorate!” one of the Soulers shouts. His voice shakes as he cries out. “You’re required to offer us protection! We’ve done nothing wrong! We’re here for peace; we’re here for God!” No one listens. I should want the Soulers to pay for what they did last night but seeing them like this, weeping in the mud, I don’t know what to think or how to feel. The woman who was hit with the ax falls slowly back until she’s lying prone, staring at the sky with blood everywhere. The dead Mudo boy lies across her lap, his spinal cord severed at the neck. In the chaos I look for Elias, terrified that he’s in danger, unable to reconcile this feeling. I don’t see him, though the Soulers have begun to look alike, covered in mud and streaked in red, rain dripping down their faces like tears. “I don’t understand,” I say to no one. Daniel finally steps away from me and joins the rest of the Militia massacring the Mudo. I know it’s best; I know the Mudo are monsters and should be killed. But something about it feels wrong. The joyful savagery in the Militiamen’s eyes … This is my fault. I caused this. I told the Militia about the Soulers. Unable to watch anymore I turn and run back to the lighthouse, leaving everything behind. Chapter 19 By the time I get back to the lighthouse, rain is coursing in from the ocean, the waves rolling hard against the sand bringing more and more Mudo to the beach. It doesn’t take long for the Militia to arrive, and I can feel the energy radiating off them from the recent confrontation. I try to avoid speaking with them, though when a few ask about my mother I tell them she’s ill and in bed. All seem to take me at my word except for Daniel, who just stares at me, the corner of his mouth turned up, his eyes narrowed. As the day wears on and patrols rotate off the beach to come inside and dry off, Daniel lingers the longest. But thankfully we’re never alone together. As Catcher’s third night of infection nears, I refuse to even consider that he’s turned. I can’t stop thinking about him. I should be there—I promised him I’d be there—and I feel as though I’ve failed him again. The fear and worry roll through me like the thunder through the sky, until I have to get away from the Militia and from Daniel’s curious stares. I steal away for a moment, pretending a need to check the lantern, and I climb to the top of the lighthouse and lean out over the railings toward the ruins. The wind whips my hair around my head, strands plastered to my face by the rain, and I’m instantly soaked. Of course I can see nothing—the encroaching night is only darkness and water. Out there somewhere Catcher is dying. And he’s alone. Unless Elias is there waiting. Planning to turn him into one of their jawless Mudo. Guilt and anguish crush me, making me feel physically weak and ill. My heart is breaking. I should be there; I promised him I’d be back and I wonder if he knows it’s the storm keeping me from him or if he thinks I’ve abandoned him. I want to sprint down the stairs and race to the Barrier. I want to dare the Militiamen here to follow me. To stop me. But I don’t. I can’t help but think about Elias’s words the other night—that if Catcher truly cared he’d forbid me to take the risk to see him again. I kick at the railing, pain thrumming up my toe, furious at Elias for making me question Catcher’s feelings. I press my hands to my face, not wanting to admit some small sense of relief about the storm. Glad that I have an excuse not to muster the courage to cross into the ruins again. Happy that I don’t have to face those fears tonight. I remind myself that some infected people make it longer than others. It’s the end of his third day and the bite was small—Catcher has to have a fourth day. It’s what I have to believe so that I don’t crumble here to be washed away by the rain. As the storm rages through the night I keep boiling water over the stove for the Militia; I make hot tea and fresh bread and I try to pretend that somewhere out there a man I might have loved isn’t dying. The Militiamen laugh. They slap one another’s hands and talk about their kills, sometimes whispering rude things that I wonder if they intend for me to overhear. Daniel is the worst. It’s like a holiday for them—rarely do they get to dispose of so many undead. Only the biggest storms dredge so many bodies up and toss them ashore. I try to smile as the wind screams outside. I try to pretend that I’m like them, that I believe in what they do. That the Mudo are only monsters. But then I think about Catcher and all my beliefs haze at the edges. I can’t think of him like that; I refuse to accept that he could be like the other Mudo and that some part of him won’t remember me. The storm doesn’t break the next day. If anything it intensifies. The Militiamen are even starting to look a little haggard. I pretend to make trays for my mother, brushing off any offers to help and polite inquiries into her health.","sourceLink":"https://allnovel.net/the-dead-tossed-waves-the-forest-of-hands-and-teeth-2/page-19.html","bookId":2586,"book":{"id":2586,"title":"The Dead-Tossed Waves (The Forest of Hands and Teeth #2)","description":"Storyline: The Dead-Tossed Waves (The Forest of Hands and Teeth #2) Gabry lives a quiet life. As safe a life as is possible in a town trapped between a forest and the ocean, in a world teeming with the dead, who constantly hunger for those still living. She’s content on her side of the Barrier, happy to let her friends dream of the Dark City up the coast while she watches from the top of her lighthouse. But there are threats the Barrier cannot hold back. Threats like the secrets Gabry’s mother thought she left behind when she escaped from the Sisterhood and the Forest of Hands and Teeth. Like the cult of religious zealots who worship the dead. Like the stranger from the forest who seems to know Gabry. And suddenly, everything is changing. One reckless moment, and half of Gabry’s generation is dead, the other half imprisoned. Now Gabry only knows one thing: she must face the forest of her mother’s past in order to save herself and the one she loves.","cover":"https://allnovel.net/images/the-dead-tossed-waves-the-forest-of-hands-and-teeth-2.jpg","author":"Carrie Ryan","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-dead-tossed-waves-the-forest-of-hands-and-teeth-2.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:11:39 PM"}}
