{"id":95024,"no":7,"title":"Page 7","content":"From my perch I watch the Militia skitter along the Barrier like sand fleas on the dunes. There’s no way I can climb the wall undetected, which leaves only one other way around: through the ocean. When I think about leaving I can barely breathe. The panic that set in last night whispers around me. I press my fist to my chest, feeling each beat of my heart. Feeling the force of blood through every artery. I don’t want to let Cira down—not more than I already have. And I don’t want to let myself down either. I realize that I’m terrified of going back to the ruins not just because I’m afraid of being caught, but because I’m terrified of finding Catcher. I don’t want to see him infected. I don’t want to see him turned and have to kill him. I don’t want any of it. I just want to go back to the way life was before. I want to take back that night and pull it from the span of days. But then I’d never have felt his lips against mine. And I’m not sure I’m willing to give that memory up. From inside I can hear the dwindling echo of a bell ringing, the alarm that chimes every 745 minutes—when the tide is nearing its peak. For as long as I can remember, my mother’s life has revolved around the sound of that bell. Mudo can’t drown; they’re already dead, and so the waves are often tossing them ashore. Most of the time they’re downed in a quasi-hibernation from being in the water so long, but as soon as they sense people they rise and start after them. This means every day, every twelve hours and twenty-five minutes, my mother patrols the beach, ready to decapitate any Mudo that wash in on the high tide. Many days nothing happens and my mother just stands there staring out at the horizon. Some days the tide will bring a few Mudo. And rarely, a storm will rage at sea, dredging up the dead to walk the shores. When I was growing up my mother never allowed me on the beach during the highest tides. Whether to keep me safe or to shelter me from reality I’ve never figured out. I think she always liked the idea that somehow she could keep it all from me. That if I never saw the Mudo, if I never looked in their eyes, I wouldn’t have to face the truth of them. I wouldn’t have to face the truth of the world. She once told me it was the only thing she could hope to give me—a life without the Mudo constantly pulsing in the background. Now as I stand on the gallery and watch my mother walk onto the beach, the way she strolls back and forth just past the line of waves, tendrils of water reaching toward her, I realize that after last night there’s nothing she needs to shelter me from anymore. I know the reality of the world. I’ve seen the Mudo tear at human flesh. I’ve seen infection and I’ve seen them turn. A hand tumbles in the waves, fingers skimming the white froth. My mother’s back stiffens and she tightens her grip around the handle of the shovel. The body is pushed to the shore and then pulled back again like a teasing dance. The ocean finally deposits the Mudo on the sand and my mother walks over to it. I lean forward, watching. It’s a woman, wet tangled black hair spread across her face like a spider’s web. Her skin, what I can see of it, is pale, gray and pocked. She’s wearing what looks like a black skirt that’s bunched up around her knees from the water. A dark shirt lies drenched against her body. She rolls ever so slightly in the water and I hold my breath, waiting for my mother to deliver the final blow, to slice the blade through her neck, severing her head. But it doesn’t come. I stare down at my mother. She’s just standing there, shovel held high above her head. I watch as the Mudo starts to twitch. Her mouth opens and closes and she turns her head, sensing my mother. Soon she’ll push herself up, and my mother is doing nothing to stop her. She’s just standing there staring and it doesn’t make sense. I lean my body over the railing. “Mother!” I scream. But the wind is off the ocean. She doesn’t hear me. I scream again, but still nothing. For a moment I want to jump. I think about tightening my fingers around the railing and tossing myself over, landing by her side. And then I turn and run. My body bangs against the walls as I fling myself down the stairs. As I run, I imagine all the worst possibilities. That I’ll hit the beach just as I see the Mudo stand. That my mother will still be stuck there, as if touched by something that has taken her out of time and pinned her in place. That I’ll see the Mudo bite my mother. My body goes cold and I sprint for the door as hard and fast as I can. I force myself to remember that my mother can defend herself. That she’ll have killed the Mudo before I even get outside and how we’ll both laugh at my panic. “Mother!” I scream as I grab my blade from the entry and kick open the door. The salty wet heat slams into me and on the air I can hear a slip of a moan from the Mudo on the beach. I turn the corner to the gate, my fingers fumbling. The Mudo is on her knees, pushing herself to her feet. She reaches one hand out to my mother and then another. “Kill her!” I scream, rage and terror fueling my every breath. I don’t understand what’s going on, don’t understand why my mother won’t move, won’t act. Flashes of last night explode in my mind: Me standing there in the face of the Breaker. Me failing and Catcher getting bitten. The heavy sand pulls at my feet and makes it impossible to sprint. Stumbling across the stretch of beach, I’ve never felt so useless. Needing to be faster, needing to get there but my legs disobeying. The Mudo’s on her feet and lunges for my mother, who pulls the handle of the shovel from her shoulder and knocks the woman back. The Mudo stumbles a few feet, her wet black skirt wrapping around her legs and tripping her. “What are you doing?” I scream. “Kill her!” The Mudo reaches again for my mother and again she pushes her back. Like a cat toying with a mouse, she keeps pushing the woman away from her and the Mudo keeps lunging. Finally I’m within striking distance. I’m about to pull the blade behind my head, to make right what I did wrong last night, when my mother grabs the handle. She wrenches it from my hand and tosses it onto the sand. With the back of her arm she pushes me away from the Mudo. “I’m sorry,” she says, and whether she’s talking to me or the Mudo I don’t know. My mother jabs her blade into the Mudo woman’s knee, ripping through the tattered skirt and shredding the bones and ligaments underneath with a sickening crack. I cringe as the Mudo stumbles. She reaches for my mother one last time, her hands waving in the air and fingers curling. My mother stares at her for the tiniest moment and I’m about to shout again, about to scream at her to kill the woman, when she closes her eyes and lowers the blade, severing the Mudo’s neck. I press my hand to my chest, trying to gasp for air. I thought I’d lost my mother. And the enormity of that emotion washes through me, draining me of everything but anger that she could do something so stupid. And fear that I could have gotten there too late. My mother stares down at the Mudo’s body. She reaches out her other hand and it hovers over the woman’s face and then she pulls it back. And I realize that this woman, this random Mudo on the beach, meant something to her. Suddenly my mother feels like a stranger to me. A woman I’ve lived with my entire life, that my very existence has revolved around, and there’s still so much I don’t know. “Who was she?” I ask. My mother doesn’t look at me, just stares at the way the water licks at the Mudo’s fingers, and I wonder what else I don’t know about her. I can tell that she’s spinning the words around in her head, trying to figure out what to tell me, and this makes me feel like even more of a stranger to her. “Nobody,” she finally says, her voice barely audible over the crash of the waves. “She’s no one. Just …” She clears her throat. “She reminded me of someone from where I grew up.” She speaks as if she’s in some sort of trance, and I watch the way she stares at the woman and I think about Catcher. I wonder if this is what I’ll be like when the time comes. I wonder if, like my mother, I’ll have as hard a time making that final blow. Just thinking about it causes everything to hurt and I realize that maybe I understand her hesitation now. “How do you handle it?” I ask her. Desperately needing to know, needing my mother’s help to ease the pain inside. “What do you do when someone you love or think you might love or could love turns?” She looks at me, her glance still so far away, and slowly I watch as she focuses back on the world around us. “It will be okay, Gabrielle. I’m safe. We’re both safe. Nothing will happen to us.” But I shake my head. She doesn’t get it and I can’t find the way to tell her about Catcher. About what he’s come to mean to me and what happened to him and that I snuck out past the Barrier with everyone else. There’s silence, there’s the push of the waves to the shore, and my mother stares at where the water tugs at the dead Mudo. Then she says, “You’ll learn how to let it go. You forget until everything is okay again.” For a while the waves roll between us, the last of the sun slowly fading away. I relive last night over and over again. Seeing Catcher’s face move toward mine, feeling my stomach tingle with anticipation. I think about all the glances, all the times his hand slipped over mine. I close my eyes and try to remember his smell but the salt of the air corrodes the memory. I try to forget all these details. To push them away into nothingness. But the more I try to let them go, the faster old memories surface, storming through my thoughts. What use are experiences if we’re not allowed to remember them? If we forget in order to avoid the pain of loss? What is the point of living if we have to always insulate ourselves? “I don’t know if I want to be okay,” I say, shaking my head slowly. So many memories roll through me and I realize that this is who we are: memories and shared experiences. This is what ties us all together. My mother bends down and sifts through the sand until she finds a shell, the inside gleaming pink like the sunset-washed sky. “It’s what we have to do to survive,” she finally says, running her finger along the sharp scalloped edges. “There’s no point in holding on to memories that only bring us pain.” “Then what’s the point of making any memories?” I ask her, my voice heated. My shoulders tense with agitation. “What’s the point of any of it if all we’re supposed to do is forget?” And then a thought begins to unwind in my head and I force myself to put words to it. “Would you forget me if something happened?” Her eyes go wide. “No,” she says quickly with a gasp. “Of course not!” “But what if I’d been up on the stage with the others this morning?” I think about Catcher and add, “What if I was one of those who didn’t come home last night?” “I would go after you,” she says, grabbing my arms and turning me toward her. “I wouldn’t let you go like that. I would find you. Whatever it took.” I measure my words and dole them out carefully. “So if you really cared for someone—maybe if you even loved them—you’d go after them?” Her mouth opens and closes and for a moment she reminds me of a fish tossed onto the shore, unable to breathe. “I …” Her eyes mist over for the barest moment but she blinks it away. She falls silent and I realize that I’ve struck something. That I’ve probed an area of my mother’s life that I never knew about before. “It doesn’t matter anymore,” she says weakly. I think about Catcher, alone and terrified beyond the Barrier. No one to talk to, to confide in. No one to pour his memories into so that he can be remembered. And I think about how I would feel if I were the one lost and alone and infected. It’s a terrifying thought that makes the edges of my vision burn dim. I press my fingers to my lips, remembering how I felt around him. Right now I don’t know what to do or how to feel and I need my mother’s help. “Have you ever been in love before?” I ask, and then hesitate before adding, “Did you love my father?” She’s never told me anything about my father, never talked about him or shared stories. I’d learned long ago not to ask about him. Not to wonder why my mother was so silent when I brought him up. “It doesn’t matter,” she says. “Who was he?” She shakes her head, retreating. “What happened to him?” I keep pushing. She sinks down into the sand onto her knees, water rushing over her legs. Her skirt fans out around her, the fabric turning darker as it gets wet. “I loved two men when I was your age. One became infected and died. The other one I left in the Forest when I escaped.” Her words are a whisper, barely loud enough to be held by the wind. My mother rarely talks about her life before and this is the first time I’ve heard much about it. It’s such a small glimpse of her life when she was my age and I grab on to it, hoping for more. I kneel in front of her and hold her limp fingers. They’re damp from the waves pooling around us, the skin already beginning to wrinkle and pucker as if tired with age. “Why didn’t you go back for him?” I ask. “If you loved him, why didn’t you go back?” She looks at me, her eyes unfocused, as if she’s not there, as if she’s staring past me at someone else. “My brother once told me that you can’t have truly loved someone if you’re willing to let them go. If you aren’t willing to fight for them,” she says flatly, as if reciting a poem learned long ago.","sourceLink":"https://allnovel.net/the-dead-tossed-waves-the-forest-of-hands-and-teeth-2/page-7.html","bookId":2586,"book":{"id":2586,"title":"The Dead-Tossed Waves (The Forest of Hands and Teeth #2)","description":"Storyline: The Dead-Tossed Waves (The Forest of Hands and Teeth #2) Gabry lives a quiet life. As safe a life as is possible in a town trapped between a forest and the ocean, in a world teeming with the dead, who constantly hunger for those still living. She’s content on her side of the Barrier, happy to let her friends dream of the Dark City up the coast while she watches from the top of her lighthouse. But there are threats the Barrier cannot hold back. Threats like the secrets Gabry’s mother thought she left behind when she escaped from the Sisterhood and the Forest of Hands and Teeth. Like the cult of religious zealots who worship the dead. Like the stranger from the forest who seems to know Gabry. And suddenly, everything is changing. One reckless moment, and half of Gabry’s generation is dead, the other half imprisoned. Now Gabry only knows one thing: she must face the forest of her mother’s past in order to save herself and the one she loves.","cover":"https://allnovel.net/images/the-dead-tossed-waves-the-forest-of-hands-and-teeth-2.jpg","author":"Carrie Ryan","type":"Horror","source":"allnovel","link":"https://allnovel.net/the-dead-tossed-waves-the-forest-of-hands-and-teeth-2.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:11:39 PM"}}
