{"id":21989,"no":34,"title":"CHAPTER XXXIV. A SUPREME RESOLUTION.","content":"The first beams of day were beginning to tinge the sky with opaline tints at the moment when the two horsemen reached the garita of San Antonio. For some time past they had checked the rapid pace of their steeds, had taken off their masks, and re-established such order as they could in their clothes, which had been dirtied and damaged by the numerous incidents of their night\u0027s ride. At some paces from the garita they mixed themselves up with the groups of Indians proceeding to market, so that it was easy for them to enter the city unnoticed. Don Jaime proceeded straight to the house he inhabited in the calle de San Francisco, near the Plaza Mayor. On reaching home, he dismissed López, who was literally falling asleep. In spite of the copious draughts which he had taken while his master was at the Palo Quemado, he gave him leave for the whole day, merely appointing a meeting with him the same evening, and then withdrew to his bedroom. This room was a real Spartan abode, the furniture, reduced to its simplest expression, only consisted of a wooden frame, covered with a cow hide, which served as a bed, an old saddle forming the pillow, and a black bearskin the coverlet; a table loaded with papers, and a few books, a stool, a trunk containing his clothes, and a rack filled with weapons of every description, knives, pistols, sabres, swords, daggers, machetes, guns, carbines, rifles, and revolves, completed with the horse trappings suspended from the walls, this singular furniture, to which we must add a washstand, placed behind a sarape hung up as a curtain in a corner of the room. Don Jaime dressed his wounds, which he had carefully washed with salt and water, according to the Indian custom, then sat down at his table, and began inspecting the papers he had found such difficulty in seizing, and whose possession had nearly cost him his life. He soon was completely absorbed by the task, which seemed greatly to interest him. At length, at about ten o\u0027clock a.m., he left his seat, folded up the papers, placed them in his portfolio, which he thrust into a pocket of this dolman, threw a sarape over his shoulders, put on a Vienna hat, with a large gold golilla, and left the house in this garb, which was as elegant as it was picturesque. Don Jaime, it will be remembered, had given don Felipe his word of honour to be his residuary legatee. It was to fulfil this sacred promise that he went out. About six o\u0027clock he returned home. His word was liberated. He had delivered to don Felipe\u0027s mother and sister the fortunes which a knife thrust had made them so promptly inherit. At the door of his house the adventurer found López, quite refreshed, who was awaiting him. The peon had prepared a modest dinner for his master. \"What news is there?\" don Jaime asked him, as he sat down to talk, and began eating with good appetite. \"Not much, mi amo,\" he answered. \"A captain, aide-de-camp to his Excellency the President, has called.\" \"Ah!\" said don Jaime. \"The President wishes you to go to the palace, at eight o\u0027clock, as he desires to see you.\" \"I will go. Well, what next? Have you heard nothing? Have you not been out?\" \"Pardon me, mi amo, I went as usual to the barber\u0027s.\" \"And did you hear nothing there?\" \"Only two things.\" \"Let me hear the first.\" \"The Juarists, it is said, are advancing by forced marches on the ciudad. They are only three days\u0027 journey distant—at least, so it is reported.\" \"The news is rather probable. The enemy must at this moment be concentrating his forces. What next?\" López burst into a laugh. \"Why are you laughing, animal?\" don Jaime asked him. \"It is the second piece of news I heard that makes me laugh, mi amo.\" \"Is it very funny?\" \"Well, you shall judge. It is said that one of the most formidable guerillero chiefs of Benito Juárez was found this morning killed by a knife in a room at the rancho of the Palo Quemado.\" \"Oh, oh!\" said don Jaime, smiling in his turn, \"And do they say how this unfortunate event occurred?\" \"No one understands anything about it, mi amo. It would appear that the colonel—for he was a colonel—had pushed on as far as the Palo Quemado, while scouting, and resolved to spend the night there. Sentries were posted round the house, to watch over the safety of this chief, and no one entered the house, except two unknown horsemen. It was after their departure, when they had finished a long conversation with the colonel, that the latter was found dead in the room, from a stab which had passed through his heart. Hence it is supposed that a quarrel having broken out between the colonel and the two strangers, the latter killed him, but it was done so quietly that the soldiers, sleeping only a few yards off, heard nothing.\" \"This is, indeed, singular.\" \"It appears, mi amo, that this colonel, don Felipe Irzabal—such was his name—was a frightful tyrant, without faith or law, about whom numberless atrocities are reported.\" \"If that is the case, my dear López, everything is for the best, and we need not trouble ourselves any further about the scoundrel,\" don Jaime said as he rose. \"Oh! He will go to the deuce without us.\" \"That is probable, if he is not there already. I am going to take a walk about town till eight o\u0027clock. At ten you will be at the palace gate, with two horses and weapons, in the case of our being compelled to take a ride by moonlight, like last night.\" \"Yes, mi amo, and I will wait till you come out, no matter at what hour.\" \"You will await, unless I send you a warning that I no longer require you.\" \"Good, mi amo, all right.\" Don Jaime then went out as he had stated, took a short walk, but only under the portales of the Plaza Mayor, so that he might reach the palace exactly at the appointed hour. At eight o\u0027clock precisely the adventurer presented himself at the palace gates. An usher was waiting to lead him to the President. General Miramón was walking, sad and pensive, up and down a small saloon adjoining his private apartments; on perceiving don Jaime, his face became more cheerful. \"You are welcome, my friend,\" he said affectionately offering him his hand; \"I was impatient to see you, for you are the only man who understands me, and with whom I can talk frankly; stay, set down by my side, and let us talk, if you are willing.\" \"I find, you sorrowful, General; has anything annoying happened to you?\" \"No, my friend, nothing; but you know that for a long time past I have not had much cause for gaiety, I have just left Madame Miramón, the poor woman is trembling, not for herself, dear and gentle creature, but for her children. She sees everything in dark colours, and foresees terrible disasters. She has been weeping, and that is why you find me sad.\" \"But why not, General, send Madame Miramón away from this city, which may be besieged any day?\" \"I have proposed it to her several times, I have insisted by trying to make her understand that the interests of her children, their safety, imperiously demanded this separation, but she refused; you know how dearly she loves me. She is divided between the love she bears me, and her affections for her children, and she cannot make up her mind; as for me, I dare not force her to leave me, and hence my perplexity is extreme.\" The general turned his head away, and subdued a sigh. There was a silence. Don Jaime understood that it was for him to turn the conversation to a subject less painful for the general. \"And your prisoners?\" he asked him. \"Ah, that matter is all arranged, thank heaven; they have nothing now to fear as regards their safety, now I have authorized them to leave the city and visit their friends and relations.\" \"All the better, General, I confess to you that I was for a moment frightened for them.\" \"On my word, my friend, I may now say frankly that I was even more frightened than you, for in this affair it was my honour that was at stake.\" \"That is true, but come, have you any new plan.\" Before answering, the general walked round the room, and opened all the doors to make certain that nobody was listening. \"Yes,\" he at length said, returning to don Jaime. \"Yes, my friend, I have a plan, for I wish to have an end to this once for all, I shall either succumb, or my enemies will be crushed for ever.\" \"Heaven grant you success, General.\" \"My victory of yesterday has given me back courage, if not hope; and I mean to attempt a decisive stroke. I have nothing at present to take into consideration; I mean to risk everything for everything, and fortune may again smile on me.\" They then approached a table, on which was stretched out an immense map of the Mexican Confederation, with pins stuck into it at a great number of points. The President continued:—\"Don Benito Juárez, from his capital of Veracruz, has ordered the concentration of his troops, and their immediate march on Mexico, where we are shut in, the only point of the territory we still hold; alas! Here is General Ortega\u0027s corps composed of 11,000 veteran troops, it is coming from the interior, that is to say, from Guadalajara, picking up on its passage all the small detachments scattered over the country. Amondia and Gazza are coming from Jalapa, bringing with them nearly 6000 regulars, and flanked on the right and left by the guerillas of Cuéllar, Carvajal, and don Felipe Neri Irzabal.\" \"As for the last, General, you need not trouble yourself about him further: he is dead.\" \"Granted, but his band still exists.\" \"That is true.\" \"Now, these bands arriving from different directions simultaneously, will ere long, if we allow it, join and enclose us in a circle of steel; they form an effective strength of nearly 20,000 men. What forces have we to oppose to them?\" \"Well—\" \"I will tell you: by exhausting all our resources I could not bring together more than 7000 men, or 8000 at the most by arming the leperos, sir; a very weak army, you will allow.\" \"In the open country, yes, that is possible, General, but being in Mexico, with the formidable artillery you have at your disposal, more than 120 guns, it is easy for you to organize a serious resistance; if the enemy resolve to lay siege to the capital, torrents of blood will be shed ere they succeed in rendering themselves masters of it.\" \"Yes, my friend, what you say is true, but, as you know, I am a humane and moderate man, the city is not disposed to defend itself, we have neither the provisions nor means of obtaining them, since the country no longer belongs to us, and everything is hostile to us, except for a radius of about three leagues round the city. Do you understand, my friend, what would be the horrors of a siege endured under such disadvantageous conditions, the ravages to which the capital of Mexico, the noblest and most beautiful city in the New World, would fall victim? No, the mere thought of the extremities to which this hapless population would be exposed, lacerates my heart, and I would never consent to such a measure.\" \"Good, General, you speak like a man of honour, who really loves his country, I wish that your enemies could hear you express yourself thus.\" \"Why, my friend, those whom you call my enemies do not in reality exist, as I am perfectly well aware; overtures have been made me personally on several occasions, offering me very advantageous and honourable conditions: when I have fallen, I shall offer the singular peculiarity, rare in Mexico, of a President of the Republic, overthrown by people who esteem him, and bearing with him in his fall the sympathy of his enemies.\" \"Yes, yes, General, and not so long ago, had you consented to remove certain persons, whom I will not name, all would have been arranged amicably.\" \"I know it as well as you, my friend, but it would have been a cowardice, and I was unwilling to commit it; the persons to whom you allude, are devoted to me, they love me; we shall fall or triumph together.\" \"The sentiments you express, General, are too noble for me to attempt to discuss them.\" \"Thanks, let us quit this subject and return to what we were saying; I do not wish by my fault to entail the destruction of the capital, and expose it to the sanguinary horrors of pillage, which always follow the capture of a besieged city. I know Juárez\u0027s guerillas, the bandits who compose them would cause irreparable misfortunes if the city were handed over to them, they would not leave one stone on the other, be assured my friend.\" \"Unfortunately, that is only too probable, General, but what do you propose doing? What is your plan? Of course you do not intend to surrender to your enemies?\" \"I had that thought for a moment, but gave it up: this is the plan I have formed, it is simply—to leave the city with 6000 men, the elite of my troops, march straight on the enemy, surprise and beat them in detail, ere the different corps have had time to effect their junction.\" \"The plan is really very simple, General; and in my opinion offers great chance of success.\" \"Everything will depend on the first battle. Gained—I am saved: lost—everything is hopelessly lost.\" \"God is great, General; victory is not always with the heavy battalions.\" \"Well, live and learn.\" \"When do you propose carrying out your plans?\" \"In a few days; for I require time to prepare it. Before ten days I shall be in a position to act, and will immediately quit the city. I can reckon on you, I suppose?\" \"Of course, General; am I not yours, body and soul?\" \"I know it, my friend: but enough of politics at present. Pray accompany me to the apartments of madame Miramón; she eagerly desires to see you.\" \"This gracious invitation fills me with joy, General; and yet I should have liked to speak with you about a very important matter.\" \"Later, later, a truce, I implore you, to business. Perhaps it relates to a new defection, or a traitor to punish? During the last few days I have heard enough of such bad news to desire the enjoyment of a few hours\u0027 respite, as the ancient said, \u0027tomorrow serious business.\u0027\" \"Yes,\" don Jaime answered significantly, \"and on the morrow it was too late.\" \"Well, I trust to God. Let us enjoy the present. It is the only blessing left us, as the future no longer belongs to us.\" And taking don Jaime by the arm, he gently led him to the apartments of madame Miramón, a charming, timid, and loving woman—the true guardian angel of the general; who was terrified by her husband\u0027s greatness and was only happy in private life, between her two children.","sourceLink":"http://novel.tingroom.com/jingdian/1773/51701.html","bookId":1112,"book":{"id":1112,"title":"The Rebel Chief","description":"简介： No country in the world offers to the delighted traveller more charming landscapes than Mexico; among them all, that of Las Cumbres or the peak, is, without fear of contradiction, one of the most striking and most agreeably diversified....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1773","creation":"Aug 1, 2019 12:24:22 AM","modification":"Aug 1, 2019 12:24:22 AM"}}
