{"id":21994,"no":39,"title":"CHAPTER XXXIX. EPILOGUE—THE HATCHET.","content":"In the meanwhile political events advanced with a fatal rapidity. The deputation sent to General Ortega returned to Mexico without obtaining any capitulation. The situation was becoming excessively critical: under the circumstances, General Miramón displayed extreme self denial; not wishing to compromise the city of Mexico further, he resolved to abandon it on the same night. He therefore proceeded to the ayuntamiento, to whom he proposed to appoint a temporary President or Alcalde, who, through his previous relations with the triumphant party, would be able to save the city, and maintain order in it. The ayuntamiento unanimously applied to General Berriozábal, who generously accepted this difficult office. His first care was to request the foreign ministers to arm their countrymen, who would take the place of the disorganized police, and watch over and guard the general safety. During this time Miramón made all his preparations for departure. Not being able to take his wife and children with him on a flight whose incidents might be sanguinary, he resolved to entrust them to the Spanish ambassador, by whom they were received with all the respect to which their unhappy situation gave them a claim. Had he wished it, Miramón would have gone away without having any violence to apprehend from Juárez\u0027 partizans. Naturally good-hearted, if he was regarded as a political adversary, no one hated him as a personal enemy. Propositions to escape alone had even been made him on several occasions, but with that chivalrous delicacy which is one of the noblest traits of his character, he refused, for he would not at the last moment abandon to the implacable enmity of their opponents certain persons who had fought for him and compromised themselves on his behalf. This feeling was assuredly honourable, and his adversaries themselves were constrained to admire this generous conduct. Don Jaime de Bivar had spent a portion of the day with the general, consoling him as well as he could, and aiding him to gather together the scattered fragments—we will not say of his army, as it no longer existed—but of the different corps which were still hesitating which side to join. Count de la Saulay and the Duke de Tobar—for we will restore to Dominique the name that belongs to him—after keeping the ladies company for the whole evening, and talking with them about the strange events of the previous day, at length took their leave, feeling somewhat alarmed about the protracted absence of don Jaime, owing to the confusion that prevailed at the moment in the city; they had just reached home, and were preparing to retire for the night, when Raimbaut, the count\u0027s valet, announced López. The peon was armed as if for a dangerous expedition. \"Oh! Oh!\" the duke said to him, \"What an arsenal you have about you, López.\" \"Have you a communication to make to us?\" the count asked. \"I have only this to say to your Excellency. Two and one make three.\" \"By Heaven!\" the young man exclaimed, rising spontaneously, \"What are we to do? We are ready.\" \"Arm yourselves as well as your domestics. Hold your horses saddled, and wait.\" \"Something is happening, then?\" \"I do not know, Excellency. My master will tell you.\" \"Is he coming, then?\" \"Before an hour he will be here. He gave me orders to remain with you.\" \"Good! Take advantage of that hour to rest yourself, López, while we get ready.\" When don Jaime arrived at about eleven o\u0027clock, his friends were dressed in travelling costume, had put on their spurs, and placed revolvers in their belts, and were now smoking and waiting, with their sabres and guns lying before them on a table. \"Bravo!\" he said, \"We are off.\" \"Wherever you like.\" \"Are we going far?\" the duke asked. \"I do not think so, but there may be a fight.\" \"All the better,\" they said. \"We have nearly half an hour before us. It is more than sufficient for me to tell you what I intend doing.\" \"Very good. Go on.\" \"You are aware that I am very intimate with General Miramón,\" he continued. The young men nodded an affirmative. \"This is what is happening. The general has collected about fifteen hundred men, and hopes, with this escort, to be able to reach Veracruz, where he will embark. He starts at one o\u0027clock tomorrow morning.\" \"Have things reached this point already?\" the count asked. \"All is over. Mexico has surrendered to the Juarists.\" \"All the worse. Well, let them settle among themselves,\" the count said. \"It does not concern us.\" \"I do not see in all this,\" said the duke, \"the part we have to play.\" \"It is this,\" don Jaime continued, \"Miramón believes he can reckon on the fifteen hundred men who compose his escort. But I am persuaded of the contrary. The soldiers are attached to him, it is true, but they detest certain persons who are going with him. I fear lest they may allow themselves to be seduced, and Miramón in this way made prisoner.\" \"That is what will probably happen,\" the count remarked with a shake of the head. \"Well, that is exactly what I wish to avoid,\" he said energetically; \"and for this I have reckoned on you.\" \"By Jove, you were right.\" \"You could not make a better choice.\" \"In that case, you two and myself, Leo Carral, and your two servants, form, a body of resolute men, in whom it will be possible to trust, in the case of matters taking a bad turn; moreover, your quality as foreigners, the care you have taken to live retired, and not to attract attention, will enable us to complete our task by concealing the general among us.\" \"Where he will be in perfect safety.\" \"However, all that I am saying to you is very uncertain at present: perhaps the escort will remain faithful to the general, and in that case, our escort becoming unnecessary, we shall only have to retire after accompanying him far enough from the city to place him in safety.\" \"Well, let us trust to Heaven,\" said the count; \"there is about this young man something grand and chivalrous, which has attracted me, and I should not be sorry if the opportunity offered to do him a service.\" \"Now that we are agreed as to facts, suppose we set out,\" said the duke. \"I am anxious to find myself by the side of this brave general; but I suppose, before all, you have provided for my mother\u0027s safety?\" \"Be at your ease, nephew; the Spanish ambassador, at my request, has placed a guard of merchants belonging to our nation, inside the house; neither she, nor Carmen, nor Dolores, has anything to fear; besides, Estevan is with her, and owing to the credit he enjoys with Juárez, he alone would suffice to protect them efficaciously.\" \"In that case, off we go!\" the young man exclaimed, jumping up merrily. They wrapped themselves in their cloaks, and took their weapons. \"Let us be off,\" said don Jaime. The servants were waiting in readiness. The seven horsemen left the house, and proceeded in the direction of the Plaza Mayor, where the troops were assembled. The Plaza Mayor was extremely animated, the soldiers were fraternizing with the people, talking and laughing as if the affair going on this moment was the most ordinary matter in the world. General Miramón—surrounded by a rather large group, composed of officers who had remained faithful to his cause, or who, too deeply compromised to hope to obtain favourable conditions from the conquerors, preferred accompanying him on his flight to remaining in the city—feigned a calmness and cordiality doubtless absent from his heart. He talked with remarkable freedom of mind, defending without bitterness the acts of his government, and taking leave without reproaches or recriminations, who through selfishness had abandoned him, and whose handiwork his downfall was. \"Ah!\" he said, on perceiving don Jaime, and making a movement toward him; \"You are really going with me? I had hoped that you would change your mind.\" \"Ah, General,\" he replied gaily, \"the remark is most kind.\" \"You are well aware that you ought not to take it in ill part.\" \"The proof is that I have brought two friends of mine, who absolutely insist in following you, General.\" \"I beg them to accept my thanks. Happy is the man who, in falling from such a height, has friends to render his fall less heavy.\" \"You have no reason to complain, General, for you do not want for friends,\" the count remarked, with a bow. \"It is true,\" he muttered, taking a sorrowful glance around him; \"I am not alone yet.\" The conversation continued in this tone for some time. An hour after, midnight struck at the sagrario. Miramón drew himself up. \"Let us go, gentlemen,\" he said in a firm voice; \"the hour has arrived to abandon the city.\" \"Sound the boot and saddle!\" an officer shouted. The bugles sounded. A sudden movement began in the crowd, who were driven back under the portales. The soldiers mounted and closed up. Then calmness was re-established, as if by enchantment, and a silence of death brooded over this immense square, which was covered with people, and literally paved with heads. Miramón sat upright on his horse in the midst of his troops. Don Jaime and his companions were mixed up with the officers surrounding the general. After a moment\u0027s hesitation, the general took a last sad glance at the dark, gloomy palace, in which not a single light was burning. \"Forward!\" he shouted. The troops started. The march commenced. At the same instant shouts of \"Long live Miramón!\" were raised on all sides. \"They regret me already,\" the general said in a low voice to don Jaime; \"and yet I have not left them.\" The troops slowly passed through the city followed by the crowd, who seemed desirous, by paying this last respect to the fallen President, to prove to him the esteem of which he was personally the object. At length, at about two o\u0027clock in the morning, they reached the city gates, and found themselves in the open country. Ere long the city appeared only as a luminous point in the horizon. The troops were sorrowful and silent. Still the march continued. All at once a certain hesitation seemed to be displayed, and a sullen agitation prevailed in the ranks. \"Attention! There is something going to happen,\" don Jaime muttered, addressing his friends. Ere long this agitation increased, a few cries were heard from the vanguard. \"What is going on there?\" Miramón asked. \"Your soldiers are revolting,\" don Jaime said, bluntly. \"Oh, it is not possible!\" he exclaimed. At the same instant there was a terrible explosion of cries, hootings and hisses, in which prevailed the shout of—\"Long live Juárez! The hatchet! The hatchet!\" The hatchet is, in Mexico, the symbol of the federation. Shouting for the hatchet is the same thing as revolting, or, to speak more in accordance with classical phraseology, making a pronunciamiento. This shout for the hatchet at once ran from one rank along the other, became general, and ere long the confusion and the disorder were at their height. Juárez\u0027 partizans mingled with the troops, raised cries of death against the enemies whom they did not wish to let escape, sabres were drawn, lances couched, and a conflict became imminent. \"General, you must fly!\" don Jaime said, hurriedly. \"Never,\" the President answered; \"I will die with my friends.\" \"You will be massacred without succeeding in saving them; besides, look! They are deserting you themselves.\" It was true; the President\u0027s friends had disbanded, and attempting flight in all directions. \"What is to be done?\" the general exclaimed. \"Cut a way through,\" don Jaime answered, and without giving Miramón time for reflection, he shouted, in a thundering voice—\"Forward!\" At the same instant the insurgents dashed with couched lances at the small group, of which Miramón formed the centre. There was a frightful medley for some minutes; don Jaime and his friends, who were well mounted, and more especially well armed, succeeded at length in cutting a passage, through which they dragged the general in their midst. Then they set off at a mad gallop. \"Where are we going?\" the President asked. \"To Mexico; it is the only spot where they will not dream of looking for you.\" An hour later they passed through the gate again, and re-entered the city, mixed up with the disbanded troops, who were raising deafening cries of \"Long live Juárez!\" and themselves shouting more loudly than those who surrounded them. Once inside the city they separated; Miramón and don Jaime remained alone; prudence demanded that the fugitives should only return to their homes one by one. At about four in the morning they were all together in safety. Juárez\u0027 troops entered the city, preceding by only a few hours General Ortega. Thanks to the measures taken by General Berriozábal, and the foreign residents acting together, the change of government was effected almost without commotion. On the morrow the city appeared as tranquil as if nothing extraordinary had occurred. Don Jaime, however, was not tranquil; he was afraid that if Miramón remained any length of time in the city his presence might eventually become known; hence he sought an opportunity to get him away, and was beginning to despair about finding one, when accident offered one, on which he was certainly far from calculating. Several days had elapsed; the revolution was finished, and matters had resumed their ordinary course, when Juárez at length arrived from Veracruz, and made his entry into the city. The first operation of the new President was, as Miramón had truly foreseen, to intimate to the ambassador of Spain his expulsion from the territory of the Mexican republic. Similar notifications were made on the same day to the legate of the Holy See, and to the representatives of Guatemala and Ecuador. This brutal expulsion, made in the most offensive terms and so opposed to the principles admitted between civilized nations, caused a general stupor. Consternation prevailed in the city; what might not be expected from a government which began with such unjustifiable acts? The opportunity which don Jaime had so long sought was at length offered him. Miramón would depart not with the Spanish ambassador, but with the representative of Guatemala. This was what really happened. The departure of the expelled ministers took place on the same day. They were the Spanish ambassador, the legate of the Holy See, the representative of Guatemala, and the minister of Ecuador. Moreover, the Archbishop of Mexico and four Mexican bishops, comprising the entire episcopate of the republic, had been exiled from the territory of the republic, and took advantage of the escort of the ambassador to leave the capital. Miramón, whose wife and children had left several days previously, followed the minister of Guatemala in a disguise which rendered him unrecognisable. Count de la Saulay and the duke de Tobar proceeded, on their side, to Veracruz, escorting do?a María and the two young ladies. Don Jaime, who was unwilling to abandon his friend, travelled with the ambassador, attended by López. Don Estevan alone remained in Mexico. We will not relate the insults and annoyances to which the expelled ministers and the bishops had to submit during the course of their journey from Puebla, where they were kept prisoners, to Veracruz, where they were menaced; stones were thrown at them, and the population wished to proceed to the worst extremities against the legate, and the unfortunate exiled bishops. Matters attained such a pitch, that the French Consul found himself constrained to claim the assistance of a French brig of war, and a Spanish vessel anchored off Sacrificios, and which at once sent parties of marines ashore. Miramón had been recognized, but owing to the energy of the French Consul, and of the commander of the brig, he succeeded in making his escape from his enemies. Two days later, the Velasco, a Spanish man-of-war, sailed for Havana, with all our characters on board. On January 15th, 1863, a double marriage was celebrated in Havana. That of the Count de la Saulay with do?a Carmen de Tobar, and that of the Duke de Tobar with do?a Dolores de la Cruz. The witnesses were, the Ambassador of Her Catholic Majesty to Mexico, General Miramón, the Commander of the Velasco, and the ex-minister of Guatemala. It was the legate of the Holy See who gave the nuptial blessing to the young couples. Count de la Saulay, we understand, lately set out again for Mexico, in order to claim by the aid of the French intervention, the immense estates which his wife possesses in that country, and which the government of Juárez thought proper to confiscate. Don Jaime de Bivar, accompanies his friend. Leo Carral is with them. The End","sourceLink":"http://novel.tingroom.com/jingdian/1773/51706.html","bookId":1112,"book":{"id":1112,"title":"The Rebel Chief","description":"简介： No country in the world offers to the delighted traveller more charming landscapes than Mexico; among them all, that of Las Cumbres or the peak, is, without fear of contradiction, one of the most striking and most agreeably diversified....","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1773","creation":"Aug 1, 2019 12:24:22 AM","modification":"Aug 1, 2019 12:24:22 AM"}}
