{"id":42121,"no":27,"title":"TWO DAYS BEFORE CHRISTMAS","content":"Will the hand-organ man please call? Our wife has dug up our old overcoat and insists on giving it to him. We intended to give it to the Honolulu Girls around at the Walnut Theatre, they looked a bit goose-fleshed last week, but we always have hay fever when we get near those grass skirts. Grass widows is what the profession calls the Hawaiian ladies. Hope the temperature isn\u0027t going up again. We love the old-fashioned Christmas and all that sort of thing. Nipping air makes cheeks pink; we love to see them nestled in fur coats on Chestnut Street. This is the time of year to do unexpected kindnesses. We know one man who stands in line for hours in front of movie theatres just in order to shout Merry Christmas through the little hole in the glass. Shaving seems less of a bore. Newspapers are supposed to be heartless, but they all take a hand in trying to help poor children. Find ourselves humming hymn tunes. Very odd, haven\u0027t been to a church for years. Great fun surprising people. We\u0027ve been reading the new phone book; noticed several ways in which people might surprise each other by calling up and wishing many happy[Pg 149] returns of the day. Why doesn\u0027t Beulah R. Wine ring up Mrs. Louis F. Beer, for instance? Or, A. D. Smoker and Burton J. Puffer might go around to W. C. Matchett, tobacconist, at 1635 South Second Street, and buy their Christmas cigars. George Wharton Pepper might give Mayme Salt a ring (on the phone, that is). What a pleasant voice that telephone operatrix has. Here\u0027s to you, child, and many of them. Grand time, Christmas. Fine old Anglo-Saxon festival, Christmas. A time of jovial cheer and bracing mirth. Must be so, because Doctor Frank Crane and Ralph Waldo Trine have often said so. Christmas hard on people like that, however: they are bursting with the Christmas spirit all the year round; very trying when the real occasion comes. That\u0027s the beauty of having a peevish and surly disposition: when one softens up at Christmas everybody notices it and is pleased. Chaucer, fine old English poet, first English humorist, gave good picture of Christmas cheer more than five hundred years ago. Never quoted on Christmas cards, why not copy it here? Chaucer\u0027s spelling very like Ring Lardner\u0027s, but good sort just the same. Says he: And this was, as thise bookes me remembre, The colde, frosty sesoun of Decembre.... The bittre frostes with the sleet and reyn Destroyed hath the grene in every yard;[Pg 150] Janus sit by the fyre with double beard, And drynketh of his bugle horn the wyn; Biforn hym stant brawn of the tusked swyn, And “Nowel” crieth every lusty man. Janus, god of doors, what we call nowadays a janitor. Had two faces so he could watch the front and back door at once and get a double tip at Christmas time. Also, that was why he wore a beard; too much trouble to shave. We don\u0027t cry Nowel any more; instead we petition the janitor to send up a little more steam. But what a jolly picture Chaucer gives of Christmas! Wine to drink (fine ruddy wine, as red as the holly berries), crackling flitch of pig to eat, and a merry cry of welcome sounding at the threshold as your friends come stamping in through the snow. Grand time, Christmas! No one is really a Philadelphian until he has waited for a Pine Street car on a snowy night. Please have my seat, madam, there\u0027s plenty of room on the strap. Wonder why the pavement on Chestnut Street is the slipperiest in the world? Always fall down just in front of our bank; most embarrassing; hope the paying teller doesn\u0027t see us. Very annoying to lose our balance just there. Awfully nice little girl in there who balances the books. Has a kind heart. The countless gold of a merry heart, as William Blake said. She looks awfully downcast when our balance gets the way it is now. Hate to disappoint her. Won\u0027t[Pg 151] have our book balanced again for a devil of a while. Even the most surly is full of smiles nowadays. Most of us when we fall on the pavement (did you ever try it on Chestnut between Sixth and Seventh on a slippery day?) curse the granolithic trust and wamble there groaning. But not nowadays. Make the best of things. Fine panorama of spats. Association of ideas. Everybody wears silk stockings at Christmas time. Excessive geniality of the ad-writers. Uproarious good cheer. Makes one almost ashamed to notice the high price of everything. Radicals being deported. Why not deport Santa Claus, too? Very radical notion that, love your neighbour better than yourself. Easy to do; very few of us such dam fools as to love ourselves, but so often when you love your neighbour she doesn\u0027t return it. Nice little boxes they have at the ten-cent stores, all covered with poinsettia flowers, to put presents in. Wonder when poinsettia began to be used as a Christmas decoration and why? Everyone in ten-cent store calls them “poinsettias,” but named after J. R. Poinsett. Encyclopedia very handy at times; makes a good Christmas present, one dollar down and a dollar a month for life. Nobody can tell the difference between real pearls and imitation; somebody ought to put the oysters wise. Save them a lot of trouble and anxiety. Don\u0027t know just what duvetyne is, but there seems to be a[Pg 152] lot of it drunk nowadays. Hope that clockwork train for the Urchin will arrive soon; we were hoping to have three happy evenings playing with it before he sees it. Fine to have children; lots of fun playing with their presents. We are sure that life after death is really so, because children always kick the blankets off at night. Fine bit of symbolism that; put it in a sermon, unless Doctor Conwell gets there first. Grand time, Christmas! We vowed to try to take down our weight this winter, and then they put sugar back on the menu, and doughnut shops spring up on every street, and Charles F. Jenkins sent us a big sack of Pocono buckwheat flour and we\u0027re eating a basketful of griddle cakes every morning for breakfast. Terrible to be a coward; we always turn on the hot water first in the shower bath, except the first morning we used it. The plumber got the indicator on the wrong way round, and when you turn to the place marked HOT it comes down like ice. Our idea of a really happy man is the fellow driving a wagonload of truck just in front of a trolley car, holding it back all the way downtown; when he hears the motorman clanging away he pretends he thinks it\u0027s the Christmas chimes and sings “Hark the Herald Angels.” Speaking of Herald Angels reminds us of a good story about James Gordon Bennett; we\u0027ll spring it one of these days when we\u0027re hard up for copy.[Pg 153] Jack Frost must be a married man, did you see him try to cover up the show windows with his little traceries the other day when the shopping was at its height? There was a pert little hat in a window on Walnut Street we were very much afraid someone might see; the frost saved us. Don\u0027t forget to put Red Cross seals on your letters. Delightful to watch the faces on the streets at Christmas time. Everybody trying hard to be pleasant; sometimes rather a strain. Curious things faces—some of them seem almost human; queer to think that each belongs to someone and no chance to get rid of it; sorry we\u0027re not in the mirror industry; never thought of it before, but it ought to be profitable. Happier most of us, if mirrors never had been invented. Hope all our nice-natured clients will have the best kind of a time; forgive us for not answering letters; we are too disillusioned about ourself to make any resolutions to do better. We\u0027re going home now; on the way we\u0027ll think of a lot of nice things we might have said, write them down and use them to-morrow. Hope Dorothy Gish will get something nice in her stocking. Don\u0027t make the obvious retort. Grand time, Christmas! \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3205/87600.html","bookId":758,"book":{"id":758,"title":"Pipefuls","description":"简介： Considering that most friendships are made by mere hazard, how is it that men find themselves equipped and fortified with just the friends they need? We have heard of men who asserted that they would like to have more money, or more books, or more pa...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3205","creation":"Aug 1, 2019 12:19:16 AM","modification":"Aug 1, 2019 12:19:16 AM"}}
