{"id":97342,"no":13,"title":"Page 13","content":"Harry S. Skatsman, Jr., was livid. He was a tiny, fat, cigar-chewing, fire-eating, primadonna-taming, scene-shooting ball of absolutely livid livid. Of all things: an accident! And on his birthday, too! Zack Phalanx, superstar, \u0027King of the Bad Guys\u0027, had been involved in some minor accident back in Beverly Hills; an accident which, however temporarily, had curtailed his appearance on location.\\n\\n Skatsman groaned, his scarlet jowls drooping and much of the anger rushing out of him in one vast sigh. What if the accident was worse than he\u0027d been told? What if Zack was out of the film (horrible thought) permanently? All that so-expensive advance publicity - all the bother over visas and work permits, and the trouble with the local villagers - all for nothing. Of course, they could always get someone to fill Zack\u0027s place (Kurt Douglash, perhaps?) but it wouldn\u0027t be the same. In his mind\u0027s eye Skatsman could see the headlines in the film rags already: \u0027Zack Phalanx WAS Vlad the Impaler\\n\\n The little fat man groaned again at this mental picture, then leaned forward in his plush leather seat and snarled (he never spoke to anyone, always snarled) at his driver: \u0027Joe, you sure the message said Zack was only slightly hurt? He didn\u0027t stick himself on his steering wheel or something?\u0027\\n\\n \u0027Yeah, slightly hurt,\u0027 Joe grunted. \u0027Minor accident.\u0027 Joe had been driving his boss now for so many years, on location in so many parts of the world, that Skatsman\u0027s snarls no longer fazed him-\\n\\n -But they fazed most everyone else.\\n\\n Even as the big car ploughed steadily through raid-afternoon mist as it rose up out of the valleys on old, winding roads that were often only just third class, high above in the village-sized huddle of caravans, huts and shacks, up in the glowering Carpathian Mountains, Harry S. Skatsman\u0027s colleagues prepared themselves for all hell let loose when the florid, fiery little director returned.\\n\\n They all knew now that Zack Phalanx had been injured, that his arrival at Jlaskavya airport had been \u0027unavoidably delayed\u0027. And they knew moreover just exactly what that meant where Skatsman was concerned. The little fat man would be utterly unapproachable, poisonous, raging one minute and sobbing the next in unashamed frustration, until \u0027Old Grim-Grin\u0027 (as Phalanx was fondly known in movie circles) showed up. Then they could shoot his all-important scenes.\\n\\n This dread of the director in dire mood was shared by all and sundry, from the producer, Jerry Sollinger (a man of no mean status himself), right down to Sam \u0027Sugar\u0027 Sweeney, the coffee-boy - who was in fact a man of sixty-three - and including sloe-eyed Shani Silarno, the heroine of this, Skatsman\u0027s fourteenth epic.\\n\\n Oh, there was going to be a fuss, all right, but what - they all asked among themselves - would the fuss really be all about? For in all truth Zack Phalanx\u0027s scenes were not to be many. His magic box-office name on the billboards, starred as Vlad the Impaler himself, was simply to be a draw, a \u0027name\u0027 to pull the crowds. For the same reason Shani Silarno was cheesecake, though certainly she had far more footage than the grim, scarfaced, sardonic, ugly, friendly \u0027star\u0027 of the picture.\\n\\n And most of that picture, filmed already, had been dashed off to Hollywood for the usual pre-release publicity screenings - except for the Phalanx scenes, which, now that the star was known to be out of it, however temporarily,\\n\\n Jerry Solinger had explained away in a hastily drummed-up, fabulously expensive telephone call as being simply too terrific, too fantastically good to be shown in any detail before the actual premier. Of course, the gossip columnists would know better, but hopefully before they got their wicked little claws into the story Phalanx would be out here in Romania and all would be well...\\n\\n But meanwhile the important battle scenes, all ketchup and zenf though they were, would have to wait on the arrival of Old Grim-Grin, injured in some minor traffic accident.\\n\\n Producer Jerry Sollinger was beginning to wish he\u0027d never heard of Vlad the Impaler; or rather, that Harry S. Skatsman had never heard of him. Sollinger could still remember when first the fat little director had snarled into his office to slam down upon his desk a file composed of bits and pieces of collected facts and lore concerning one Vlad Dracula. This Vlad - Vlad being a title of some sort, possibly \u0027Prince\u0027 - had been a fifteenth-century warlord, a Wallach of incredible cruelty. Like his ancestors before him, he had led his people against wave after wave of invading Turks, Magyars, Bulgars, Lombards and others equally barbaric, to beat them back from his princedom aerie in the foreboding mountains of Carpathia.\\n\\n He was, in short, the original Dracula; but whichever historian appended the words \u0027the Impaler\u0027 to his name had in mind a different sort of impaling than did Bram Stoker when he wrote his popular novel. Vlad V Tsepeth Dracula of Wallachia had earned his name by sticking the captured hundreds of his enemies vertically on rank after rank of upright stakes, where they might sit and scream out the mercifully short remainder of their lives in hideous agony while he and other nobles laughed and cantered their warhorses up and down amidst the blood and gore.\\n\\n The vampire legend in connection with Vlad V probably sprang up not only from this monstrous method of execution, but also from the fact that a Wallachian curse has it (despite his lying dead for over five hundred years) that Vlad the Impaler \u0027will return from the grave with his warriors of old to protect his lands if ever again invaders penetrate his boundaries.\u0027\\n\\n This, roughly, was the information Skatsman\u0027s file contained, and to its cover he had stapled a single sheet of paper bearing the following story-line, his synoptic \u0027plan\u0027 of the epic-to-be:\\n\\n \u0027Vlad Drac, (Zack Phalanx), scorned by his subjects and the sovereigns of neighbouring kingdoms and princedoms alike for his chicken, pacifist ways, finally loses his cool and takes up the sword against the invader (something like Friendly Persuasion but with mountains and battle-axes). This only after his castle has been burned right off the edge of its precipice by the advancing Turks, and after his niece, the young Princess Minerna, (Shani Silarno), has been raped by the Turk barbarian boss, (Tony Kwinn?). To conclude, we\u0027ll have Vlad V suicide after his boys mistakenly stick his mistress, (Glory Graeme?), who has dressed like a Turk camp-follower to escape the invaders, not realizing that Vlad has already whupped them? Robert Black can whip this up into something good.\u0027 To this brief, almost cryptic outline, Skatsman had appended his signature.\\n\\n And from that simple seed, the idea had blossomed, mushrooming into a giant project, an epic; by which time it had been too late for Sollinger to back out. Truth of the matter was that the producer was a little fearful of these so-called \u0027epic\u0027 productions: just such a project had almost ruined him many years ago. But with such a story - with the awesome, disquieting grandeur of the Carpathian Mountains as background, with a list of stars literally type-cast into the very parts for which they were acclaimed and which they played best, with Skatsman as director (and he was a very good director, despite his tantrums) - well, what could go wrong?\\n\\n Much could go wrong . . .\\n\\n And yet at first it had seemed like plain sailing. The new peace-pact with the Eastern-bloc countries had helped them in the end to get the necessary visas; that and the promise of recruitment as extras of hundreds of the poor, local villagers into bit parts. And this latter of course had saved much on costumary, for the dress and costumes of these people had not much changed in five centuries. On the other hand, there had been little of the film-star in them. When they were used, each fragment of each and every scene had to be directed with the most minute attention to detail, always through an interpreter and invariably with the end result that Skatsman, before he could be satisfied, would have the set in uproar. The stars would be threatening to walk out, the local \u0027actors\u0027 themselves gibbering in fear of the little man\u0027s temper, as though the director were the great Vlad V himself resurrected!\\n\\n Indeed, when finally those locals - all two hundred eighty of them - had walked off the set, flatly refusing to work any longer on the giant production, Skatsman had been blamed. Not to his face, of course not, but behind his back the cast and technicians had \u0027known\u0027 that he was the spanner in the works. This did not explain, though, the fact that when Philar Jontz the PR man went after the runaways, in fact to pay them their last wages, he discovered two empty villages!\\n\\n Not only had the rather primitive \u0027actors\u0027 deserted the film - not that it mattered greatly, for all of their important scenes were already in the can - but they had taken their families, friends, indeed the entire populations of their home villages with them. Stranger still, the quaint old town into which they had all moved en masse was only a mile or so further down the mountain road. Whatever they were running away from, well, they had not bothered to run very far!\\n\\n Ever the PR man, Jontz had followed them, only to discover that in the now badly overcrowded town no one would have anything to do with him, neither refugees nor regular inhabitants. Mystified, he had returned to his colleagues.\\n\\n Within a day or so, however, rumours had found their way back to the mobile town in the mountains.\\n\\n The whispers were vague and inconclusive and no one really bothered much to listen to them, but in essence they gave the lie to anyone who might try to attach the blame to Skatsman. No (the rumours said), the villagers had not been frightened off by the little boss; and no, they had not found the work distasteful - the money had been more than welcome and they were very grateful.\\n\\n But did the rich American bosses not know that there had been strange rumblings in the mountains?\\n\\n And were they not aware that in Recjaviscjorska a priest had foretold queer horror in the highlands? Why! - wasn\u0027t it common knowledge that an ancient burial place in the grounds of certain crumbling and massive ruins high in the rocky passes was suddenly most - unquiet? No, better that the Americans be given a wide berth until, one way or the other, they were gone and the mountains were peaceful again.\\n\\n Though of course he had his ear to the ground, still it was all far beyond Philar Jontz\u0027s understanding, and even had he thought or bothered himself to look at a map of the region (though there was no reason why he should) it is doubtful that he would have noticed anything at all out of the ordinary. Maps being what they are in that country, in all probability the ancient boundaries would not be marked, and so Jontz would not have seen that the two deserted villages lay within the perimeter of what once had been the princedom of Vlad V Tsepeth Dracula of Wallachia, or that the now bulging town lower down the mountain slopes lay outside the centuried prince\u0027s domain...\\n\\n Now all this had happened before the latest crisis, but even then Phalanx had been overdue on location, delayed for first one reason and then another in Hollywood. And so a number of restless, wasted days had gone by, until finally came that great morning when the poisonous little director received the telephone message everyone had been waiting and praying for. Old Grim-Grin was on his way at last; he would be on the mid-afternoon flight into Jlaskavya; could someone meet him and his retinue at the airport to escort them to location?\\n\\n Could someone meet them, indeed! Skatsman himself would meet them; and without further ado the delighted director had set out in his huge car with Joe, his driver, down the steep mountain roads to distant Jlaskavya.\\n\\n For once in his life Skatsman had been truly happy. He had known (he told Joe) that it was all going to be okay. Nothing ever went wrong on his birthday - nothing dared go wrong on his birthday! And thus he had snarled cheerfully to Joe all the way to the dismal airport . . . where finally he had been informed of his superstar\u0027s latest and most serious delay.\\n\\n Having picked up a smattering of the local language, it was Joe who first received the news, and when Skatsman had recovered from his initial convulsions it was Joe who phoned the facts through to Philar Jontz in the overcrowded town where the PR man had not yet given up trying to solve the mystery of the runaway extras. Jontz, in turn, had taken the dread message back to his film friends in the mountains.\\n\\n Later, it also fell to the PR man to spot the horde of extras - all costumed for a battle scene, helmeted and leather-sandaled, with a variety of shields, swords, maces and lances - as they came creeping down out of the higher passes, flanked by riders astride great warhorses. The PR man had been astounded, but only for a moment, and then he had given a whoop of understanding.\\n\\n Why, Skatsman, the old fraud! They might have expected something like this of him. Wasn\u0027t it his birthday? This explained everything. The runaway extras, the alleged \u0027accident\u0027 of Zack Phalanx: it had all been a build-up to the Big Surprise. And surely that great, grim-faced, leading rider was Zack Phalanx?\\n\\n Dusk was settling over the mountains like a great grey mantle by that time, and the actors and technicians and all were already settling in their caravans and tents, preparing for the next day\u0027s work or bedding down for the night. Philar Jontz\u0027s cry went up for all of them to hear:\\n\\n \u0027Well, I\u0027ll be damned! Zack! Zack Phalanx! Where\u0027s that old rogue Skatsman hiding?\u0027 Then they heard his quavering, querying exclamation of disbelief, and finally his awful, rising scream, cut off by a thick sound not unlike a meat cleaver sinking into a side of beef . . .\\n\\n Something less than an hour later, Harry S. Skatsman\u0027s big car came round the last bend in the winding mountain road and turned off onto the fringe of the flat, cleared area that housed the sprawling units of the vast, mobile film town. The headlights cut a swathe of light between the shadowed ranks of shacks, trailers, trucks, caravans and tents -illuminating a scene that caused Joe to slam on his brakes so hard that Skatsman almost shot headlong over into the front of the car. Twin rows of stakes stretched away towards a bleak background of dark and sullen mountains, and atop each stake sat the motionless form of a dressed dummy, head down and arms bound.\\n\\n \u0027What in hell -?\u0027 Skatsman snarled, leaping from the car with an agility all out of character with his shape and size. A hundred torches suddenly flared in the dark behind the shacks, trucks and tents, and their bearers came forward out of the shadows to form a circle about Skatsman and the car.\\n\\n And suddenly the director knew, just as Philar Jontz had \u0027known\u0027, what it was all about. Why, this was one of Zack\u0027s scenes! The stakes, torches, the grimly-helmeted warriors . . .\\n\\n \u0027Where is he?\u0027 Skatsman roared, slapping his thigh and doing a little jig. \u0027Where\u0027s that bastard Zack Phalanx? I might have known he wouldn\u0027t forget my birthday!\u0027\\n\\n The silent torch-bearers closed in, tightening the circle. Down the path of stakes horses came clopping, the lead horse carrying a huge figure clad in the cape and apparel of a warrior prince.\\n\\n \u0027Zack! Zack!\u0027 cried Skatsman, pushing forward - to be grabbed and held tight between two of the encircling torch-bearers. And then he smelled a smell that was not greasepaint, and beneath the nearest helmet he saw-\\n\\n \u0027Zackl\u0027 he uselessly croaked once more.\\n\\n At the same time Joe, too, noticed something very wrong - namely, the skeletal claw that held a torch close to his driver\u0027s window. He convulsively gunned the car\u0027s big motor, twisting the wheel, spinning the car on madly screaming tyres. A hurled lance crashed through the windscreen and pinned him like a fly to the upholstery of his seat. His arms flew wide in a last spasm and the car turned on its side, splintering the nearest stake and flinging the grisly corpse it supported in a welter of entrails at the director\u0027s feet. No dummy this but a dumb blonde! - Shani Silarno, naked but for a torn and bloodstained dressing-gown, eyes glazed and bulging.\\n\\n Skatsman swayed and would have fallen, but he was flanked now by two great horses. Their riders reached down to lift him bodily from the ground. He kicked feebly at thin air as they cantered with him down between the ranks of stakes to where the caped Vlad V now waited.\\n\\n Before the director\u0027s unbelieving eyes there passed a bobbing procession of mutilated forms, some of them still writhing weakly on the cruel stakes. Jerry Sollinger, Glory Graeme, Sam \u0027Sugar\u0027\\n\\n Sweeney, they were all there. Even Philar Jontz, though only his head decorated its stake.\\n\\n As the horses drew level with the bony horror in the cape, Skatsman was lifted higher still and he saw the waiting, needle-sharp point of the last, empty stake. He might perhaps have screamed but only knew how to snarl. He did neither but threw back his head and laughed - albeit hysterically, insanely - laughed right into the fleshless, helmeted face whose black eye-sockets so keenly regarded him.\\n\\n He was Harry S. Skatsman, wasn\u0027t he? And this was his epic, wasn\u0027t it? This was his big scene!\\n\\n What else could he do?\\n\\n \u0027Action! Camera!\u0027 he snarled - as they rammed him down onto that last terrible fang of Vlad the Impaler. \\n\\n","sourceLink":"https://allnovel.net/a-coven-of-vampires-necroscope-6/page-13.html","bookId":2598,"book":{"id":2598,"title":"A Coven of Vampires (Necroscope #6)","description":"Storyline: Subterranean Press is proud to announce this brand-new edition of Brian Lumley\u0027s most sought after book, A Coven of Vampires, featuring a collection of 13 classic vampire tales: What Dark God?, Back Row, The Strange Years, The Kiss of the Lamia, Recognition, The Thief Immortal, Necros, The Thing From the Blasted Heath, Uzzi, Haggopian, The Picknickers, Zack Phalanx is Vlad the Impaler, and The House of the Temple.\\n","cover":"https://allnovel.net/images/a-coven-of-vampires-necroscope-6.jpg","author":"Brian Lumley","type":"Horror","source":"allnovel","link":"https://allnovel.net/a-coven-of-vampires-necroscope-6.html","creation":"Oct 5, 2019 8:58:55 AM","modification":"Oct 5, 2019 6:25:55 PM"}}
