{"id":35539,"no":10,"title":"THE MYSTERIOUS MOVING VAN","content":"Muffs wrote all about the headless man in a letter to her mother. It was the longest letter she had ever written all by herself and she felt very happy when she slid the fat envelope through the letter drop in the Post Office. She felt happier still a few days later when the answer came back addressed to Muffs herself in care of Mrs. Tyler. It was a long letter and Tommy helped her read it. Dear little Madeline Muffins Moffet: Whoever thought you could write such a letter? I think your headless man sounds nice. He must have looked funny but I’m glad you apologized for chasing him. It isn’t fun to make people cross, especially men. If I were you I would forget the Bramble Bush Man because he isn’t real and be nice to the real headless man. “Are you sure the letter says the Bramble Bush Man isn’t real?” Muffs asked, looking worried. “That’s what it says,” Tommy replied. “I guess you didn’t tell your mother that the headless man knows him.” “Do you think he really does, Tommy?” The boy nodded and Muffs, with a happy sigh, went on reading her letter. Now I have something important to tell you. Summer school will be over in just one more week and I am coming to take you home.74 I don’t know whether you will be glad or sorry but, till then— Goodbye, and all my love, Mother. “Which will you be,” Tommy asked, “glad or sorry?” She and Tommy were sitting on the Way of Peril and everything around them had grown dear to Muffs. “A little bit of both. Glad to see Mother and sorry not to have you and Mary to play with any more. I’ll miss Donald and baby Ellen too and your mother and father and Great Aunt Charlotte—and the headless man. He’s getting sort of—sort of mysterious, don’t you think?” “And he promised to help find the Bramble Bush Man. Gee! You’ll miss him too,” Tommy said. “Couldn’t you coax your mother to let you stay?” Muffs shook her head. “My school begins in a week. But I do like it here,” she added wistfully. She and Tommy were sitting on the Way of Peril and everything around them had grown dear to Muffs. She looked out across the swamp to the trees and little stream beyond and thought how different the city was—just hard pavement and75 children who had never learned how to play. She tried to think of all the nice things she used to do in New York but none of them were very exciting. They weren’t a bit like the expedition or the burned tailor shop or painting the house for Bunny Bright Eyes. There was no Way of Peril to walk, no make-believe creatures and no children half as nice as Mary and Tommy. Donald and Mr. Tyler were always doing wonderfully interesting things too and Mrs. Tyler was a dear. So was Great Aunt Charlotte bedtimes when she passed out pink peppermint candy pillows. Muffs’ little dream fairies slept on them. And it was nice to have a baby in the house to pet and play with. Even the cats were comforting when they sat in anyone’s lap and purred. Thomas Junior wasn’t much given to sitting in laps but Tabby often sat with Muffs. Her fur was soft and white and made the little girl think of Bunny Bright Eyes, the only pet she had ever had. “If only Mother would stay here,” she thought, “and I had Bunny Bright Eyes again, everything would be just perfect and I wouldn’t care if we never went back to the studio in New York.” Then she saw Mary coming up the road, wheeling Ellen in her carriage. She had just put her to sleep and now she was ready to play. “Muffs’ mother is going to take her back to New York,” Tommy announced as soon as Mary came into the wood yard. To their surprise, Mary burst into tears and ran up the One Way Steps and into the workshop. “She’s gone to tell Daddy,” Tommy decided. “She tells Daddy and Donald everything.” “I didn’t know she liked me that much,” Muffs said. 76Ever since that day she went to the workshop crying she had acted as if she knew a secret. As the time for her to go home came nearer Muffs grew more and more puzzled. There were days when they hardly saw Mary. Ever since that day she went to the workshop crying she had acted as if she knew a secret. Donald was in on it too and so was Mr. Tyler. The three of them had taken the short-cut and gone somewhere without saying a word to Muffs and Tommy. “We could watch and see where they went,” Muffs suggested. So she and Tommy, hand in hand, started along the short-cut. It went through the swamp on stepping stones and then through the field and over what Tommy called the fairies’ hills because they were only little mounds with wintergreens growing on them. “Want to taste a fairy apple?” he asked and Muffs, who had never tasted a wintergreen berry before, thought the fairies had nicer apples than those that grew on full-sized apple trees. They crawled under the pasture fence and then, as they came in sight of the grange hall, things began to appear strange. A big truck was standing in the driveway and men were carrying things out of it and into the grange hall. “It’s a moving van,” Muffs exclaimed. “Somebody must be moving in.” “People don’t move into public halls,” Tommy objected.77 “Maybe they just bought some new furniture for the grange. But gee! What funny furniture!” “A new piano,” guessed Muffs as the moving men shouldered a box-like object and carried it through the door. “They have a piano,” said Tommy. “I know because they play it at socials for the grown-ups to dance.” “Then it isn’t a piano. Look-ee! I know what those are. Japanese lanterns in all different colors. It must be a ball like Cinderella went to. I wish we had a fairy godmother.” The next thing to be unloaded was a pile of folding chairs. Then another pile of folding chairs—and another and another. “My! What a lot of chairs,” exclaimed Muffs. “They’ll be fun for playing ‘Going to Jerusalem.’” “We won’t be allowed to play,” Tommy said. “It’s prob’ly some grown-up doings and they’re just going to sit. Muffs, do you suppose Daddy and Donald and Mary are over there?” “I thought I saw Mary, and look! There’s the headless man! He’s showing the moving men where to put the chairs!” “Gee!” exclaimed Tommy. “He’s not so good at keeping promises. I should think he’d come and see us if he’s really trying to find the Bramble Bush Man.” “I don’t believe there is any Bramble Bush Man,” said Muffs suddenly. “We just made it up.” Tommy whirled on her. “You’re not a Magic Maker if you quit believing. You’ll never have any fun. You’ll just grow up full of scowl wrinkles like Mr. and Mrs. Lippett and people will call you a dragon. You wouldn’t want that to happen, would you?” “No-oo,” Muffs agreed doubtfully. “But you can’t keep on believing forever when nothing happens.” 78 “We’ll make something happen then,” declared Tommy. “Pretty soon the moving van will be empty and we can climb in and hide. Then when they start to drive away we can pop up and surprise the headless man. He’ll remember his promise all right then. He may even tell the men to drive us around to the Bramble Bush Man’s house.” This plan was a little too daring to suit Muffs. Things happened sometimes and whenever things did happen she usually got the blame. “They might not stop,” she said. “The headless man won’t tell his name and those moving men may be kidnappers for all we know.” “’Fraid Cat!” “Well, I want Mother to find me when she comes.” “Oh, shucks!” said Tommy. “You’ll be going and we can’t have just one last adventure. If you don’t see the Bramble Bush Man pretty soon you’ll never see him.” Still Muffs felt afraid. “All right! Don’t!” Tommy said angrily. “I’ll climb into the moving van and go to see the Bramble Bush Man myself.” “Without me!” cried Muffs. “Oh, Tommy, not without me!” He grinned. It was easy to make Muffs do what he wanted her to. Soon they were crossing the road and stealing up to the empty moving van. The men were still busy in the grange hall and it was easy to climb in without being seen. There were a few old quilts and a mattress on the floor of the truck. The mattress was clean and comfortable and the children sat down on it to wait. 79 “They’re taking a long time,” said Tommy after about ten minutes of waiting. “Maybe they can’t find places for all those chairs,” Muffs replied. “I hope they don’t put them back in here so we can’t lie on this nice bed. I’m getting sleepy.” Tommy yawned and sprawled on the mattress too. He and Muffs had played hard that morning and both of them were tired. “I’ll keep my ears open,” thought Tommy as he closed his eyes. But ears have a habit of drifting off to dreamland too and so when the men returned, talking and laughing, neither Muffs nor Tommy heard a sound. And when the driver started neither he nor his helper nor the headless man guessed that there were two children in the back of the van lying on a mattress sound asleep.","sourceLink":"http://novel.tingroom.com/duanpian/2784/77139.html","bookId":1308,"book":{"id":1308,"title":"The Magic Makers and the Bramble Bush Man","description":"简介： Madeline Moffet stood on the corner beside the big sign that said USE DRAGON MOTOR OIL. She liked to think of the sign as a warning, BEWARE OF DRAGONS and the dragons as Mr. and Mrs. Lippett who lived in the farm house beside the sign. Muffs boarded...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2784","creation":"Aug 1, 2019 12:24:50 AM","modification":"Aug 1, 2019 12:24:50 AM"}}
