{"id":107263,"no":2,"title":"Page 2","content":"The Galactic Empire Was Falling.\\n\\n It was a colossal Empire, stretching across millions of worlds from arm-end to arm-end of the mighty multi-spiral that was the Milky Way. Its fall was colossal, too - and a long one, for it had a long way to go.\\n\\n It had been falling for centuries before one man became really aware of that fall. That man was Hari Seldon, the man who represented the one spark of creative effort left among the gathering decay. He developed and brought to its highest pitch the science of psychohistory.\\n\\n Psychohistory dealt not with man, but with man-masses. It was the science of mobs; mobs in their billions. It could forecast reactions to stimuli with something of the accuracy that a lesser science could bring to the forecast of a rebound of a billiard ball. The reaction of one man could be forecast by no known mathematics; the reaction of a billion is something else again.\\n\\n Hari Seldon plotted the social and economic trends of the time, sighted along the curves and foresaw the continuing and accelerating fall of civilization and the gap of thirty thousand years that must elapse before a struggling new Empire could emerge from the ruins.\\n\\n It was too late to stop that fall, but not too late to narrow the gap of barbarism. Seldon established two Foundations at \"opposite ends of the Galaxy\" and their location was so designed that in one short millennium events would knit and mesh so as to force out of them a stronger, more permanent, more benevolent Second Empire.\\n\\n Foundation (Gnome Press, 1951) has told the story of one of those Foundations during the first two centuries of life.\\n\\n It began as a settlement of physical scientists on Terminus, a planet at the extreme end of one of the spiral arms of the Galaxy. Separated from the turmoil of the Empire, they worked as compilers of a universal compendium of knowledge, the Encyclopedia Galactica, unaware of the deeper role planned for them by the already-dead Seldon,\\n\\n As the Empire rotted, the outer regions fell into the hands of independent \"kings.\" The Foundation was threatened by them. However, by playing one petty ruler against another, under the leadership of their first mayor, Salvor Hardin, they maintained a precarious independence. As sole possessors, of nuclear power among worlds which were losing their sciences and falling back on coal and oil, they even established an ascendancy. The Foundation became the \"religious\" center of the neighboring kingdoms.\\n\\n Slowly, the Foundation developed a trading economy as the Encyclopedia receded into the background. Their Traders, dealing in nuclear gadgets which not even the Empire in its heyday could have duplicated for compactness, penetrated hundreds of light-years through the Periphery.\\n\\n Under Hober Mallow, the first of the Foundation\u0027s Merchant Princes, they developed the techniques of economic warfare to the point of defeating the Republic of Korell, even though that world was receiving support from one of the outer provinces of what was left of the Empire.\\n\\n At the end of two hundred years, the Foundation was the most powerful state in the Galaxy, except for the remains of the Empire, which, concentrated in the inner third of the Milky Way, still controlled three quarters of the population and wealth of the Universe.\\n\\n It seemed inevitable that the next danger the Foundation would have to face was the final lash of the dying Empire.\\n\\n The way must he cleared for the battle of Foundation and Empire. \\n\\n","sourceLink":"https://allnovel.net/foundation-and-empire-foundation-2/page-2.html","bookId":2018,"book":{"id":2018,"title":"Foundation and Empire (Foundation #2)","description":"Storyline: The Foundation novels of Isaac Asimov are one of the great masterworks of science fiction. Unsurpassed for their unique blend of nonstop action, daring ideas, and extensive world-building, they chronicle the struggle of a courageous group of men and women to preserve humanity\u0027s light against an inexorable tide of darkness and violence. Led by its founding father, the great psychohistorian Hari Seldon, and taking advantage of its superior science and technology, the Foundation has survived the greed and barbarism of its neighboring warrior-planets. Yet now it must face the Empire, still the mightiest force in the Galaxy even in its death throes. When an ambitious general determined to restore the Empire\u0027s glory turns the vast Imperial fleet toward the Foundation, the only hope for the small planet of scholars and scientists lies in the prophecies of Hari Seldon. But not even Hari Seldon could have predicted the birth of the extraordinary creature called The Mule, a mutant intelligence with a power greater than a dozen battle fleets, a power that can turn the strongest-willed human into an obedient slave.\\n","cover":"https://allnovel.net/images/foundation-and-empire-foundation-2.jpg","author":"Isaac Asimov","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/foundation-and-empire-foundation-2.html","creation":"Oct 5, 2019 8:58:15 AM","modification":"Oct 5, 2019 11:05:35 PM"}}
