{"id":92416,"no":16,"title":"Page 16","content":"\\n\\n He nods, \"The camp we were just at is one of our peace camps. It\u0027s like a retreat. The children and young and old stay there. We have people coming and going constantly. Didn\u0027t you notice how easily you were welcomed?\"\\n\\n \"I guess. I just thought that’s what people were when they live in a camp like that. After the machine gun escort that is.\"\\n\\n He laughs again. I like the sound of it but it reminds me of Jake.\\n\\n \"Well that is big timber wolf Emma. How did you end up with him?\"\\n\\n \"His mother gave birth and must have gotten sick shortly after. Leo was waiting for me at the door to the cabin one day. He was tiny then. I could hear his brothers and sisters in the woods. I found the mother dead and half eaten surrounded by the other cubs who were weak and sick. It was awful. I shot them and burned them. It’s the closest infection ever got to my cabin. He\u0027s immune anyway so that\u0027s helpful.\"\\n\\n \"He\u0027s immune? Naturally? Maybe he never ate any of the mom.\"\\n\\n I shake my head, \"She wasn’t the only sick thing Leo has eaten. He likes the infected.\"\\n\\n He grimaces, \"That\u0027s disgusting. Disgusting and lucky all at the same time.\"\\n\\n I nod, \"It is.\"\\n\\n \"What do you know about the start of the infection?\"\\n\\n I shrug, \"People got sick and some died and others lived but went a little crazy.\"\\n\\n His eyes look dark as his expression looses its humor and the sun sets completely, \"No Emma people didn’t just get sick. The infection was spread on purpose. Everything that’s happened has been a plan all along.\"\\n\\n \"That can\u0027t be true.\"\\n\\n \"I wish it weren’t. There was something called the United Nations. They did all of this.\"\\n\\n I feel sick, \"They were evil?\"\\n\\n He shakes his head, \"Not evil just detached. The world was running out of resources and everyone was constantly putting a hand out to them and asking for aide and food and money. The UN had been warning us forever about the global warming and the ice melting and ocean becoming acidic. Anyway in 2012 all of Greenland\u0027s ice and snow melted in a week. The earth started to enter a drought. We thought it was a cyclical event but it wasn’t. It was man made. We had pushed it too far. The same time all this was happening, a conference was held in Rio about the environment. Canada, the US and China pretty much pulled out and admitted they had no intention of slowing their pollution to the recommended level. It would be too hard on their economies. That was the final straw. Apparently the UN had a backup plan for a worst-case scenario such as that. They had a plague. It had a vaccine, which made it easy to spread and then control. The problem was it mutated. They spread the virus at the same time they had bombs placed deep in the ocean along the Japanese coastline. They bombed the shelf and pretty much wiped Japan off the face of the earth and made the west coast of North America a target for huge tidal waves.\"\\n\\n It felt like a movie. It didn’t feel real. It felt like the ramblings of my father, before.\\n\\n I shake my head, \"How could you know all this?\"\\n\\n \"The work farms. I met people who had been part of the initial plan. The plan was to reset everything. Instead the UN decided they wanted to start humanity over but set it up to succeed this time. The breeder farms were built where only the fit and healthy were allowed to reproduce.\"\\n\\n I shivered imagining it.\\n\\n He laughed, \"It isn’t what you think. I know what everyone thinks happens but it\u0027s not. The girls only breed every three years and only up to three times. The pregnancy isn’t the result of rape, it\u0027s done using science. The baby is made in a lab and then inserted into the woman\u0027s womb.\"\\n\\n I gag and he laughs.\\n\\n \"The religious had the same reaction. The UN never mentioned this plan to anyone but the very high up. It never went well.\"\\n\\n I frown, \"The girls are still taken against their will and made to make babies against their will.\"\\n\\n I see his head nod in the dark, \"Yup and the babies are not God\u0027s children to the Christians. Anyway the UN runs the military but again they sit in their closed office and plan using numbers and facts and data. They don’t leave it to see what the world looks like or how corrupt the military is. They have built six cities world wide from the ashes and rubble of the previous cities. They plan on cleaning every inch of the world.\"\\n\\n My head spins, \"What about the borderlands?\"\\n\\n \"They can\u0027t use anymore bombs without affecting the weather and pollution again, so the plan stands at leaving us to our own devices until they have this part of the world cleaned up. Then they will round us up.\"\\n\\n \"Why?\"\\n\\n \"They want the diseases and illnesses bred out. They won\u0027t allow those people to live and breed.\"\\n\\n \"Oh my god it\u0027s like a nightmare.\"\\n\\n \"It is. On that note we need to sleep. You sleep first and I\u0027ll keep watch.\"\\n\\n \"That\u0027s some bedtime story.\" I liked Jake\u0027s better.\\n\\n He laughs. I watch his silhouette in the dark for a moment. He doesn’t lean in to kiss me. He watches the hill we climbed.\\n\\n I lie down on his jacket and snuggle into the smell.\\n\\n \"How long have they been breeding the science babies?\"\\n\\n His outline turns to me and I see the shine of his eyes in the dark, \"A long time. They started in the early 2000\u0027s.\"\\n\\n \"Are the babies different than the rest of us?\"\\n\\n \"Yes.\"\\n\\n Chapter Thirteen\\n\\n The broken branches lead us to a camp in a valley on the opposite side of the mountain where my farmhouse sat. The size of the camp is disturbing.\\n\\n Will smiles as he sees it and walks directly up to the man holding the gun amid the trees.\\n\\n \"Halt.\"\\n\\n \"Lancaster.\" Will shouts.\\n\\n The gunman smiles, \"No shit, Willy boy you\u0027re alive and well. I heard they caught you.\"\\n\\n He laughs, \"They think they did. Is Marshall still in charge?\"\\n\\n Lancaster points to the camp, \"He\u0027s in the smallest tent, you know what he\u0027s like. Still paranoid they will bomb us.\"\\n\\n Will laughs and points to me, \"This is my friend Emma.\"\\n\\n I feel hurt he calls me his friend. I don’t know why but the word stings.\\n\\n \"I\u0027m John.\" He puts a hand out and I notice he has a nice smile. I meet his gray eyes and smile back, \"Nice to meet you.\"\\n\\n His eyes flicker on Will for a moment and an even bigger smile crosses his lips, \"So where did you two meet?\"\\n\\n I look at Will.\\n\\n He shakes his head, \"She walked up to the mountain retreat the other day with a huge timber wolf for a pet and an unruly teenager.\"\\n\\n John\u0027s eyes grow wide, \"You have a wolf?\"\\n\\n I nod. I want to find Anna and Jake. I don’t understand why Will isn’t busting inside to see them. I feel myself fidget.\\n\\n \"Well I\u0027m going to go see Marshall and see what\u0027s new on this side of the hill.\"\\n\\n We walk toward the camp as the sound of a bird squawking fills the forest. The gunmen lower their weapons as they hear the sound and we walk past them. The camp opens as the forest spreads thin.\\n\\n It looks like the camp we were at before except that everyone is wearing a firearm or a knife. At one point I swear I see a sword. There are no children here.\\n\\n \"Will. You\u0027re alive!\"\\n\\n A girl with long blonde hair in two braids and cut off shorts runs and jumps into his arms. My heart stops. She kisses his lips. The lips that only just kissed me the day before. I feel heat radiating from my cheeks. I\u0027ve read about rogue men in the romance novels and feel sick that I\u0027ve fallen for one. All the years of reading the novels and judging the females who seem strong and smart and then fall for a jerk. Reality hurts. I want Jake and Anna and my cabin with Leo and Meg. I want to let the world kill itself and hide up in the mountains. I will never kiss him again. I can\u0027t believe I was so reckless.\\n\\n \"Star what the hell. You know me better than that.\" He twirls her around and looks sheepishly at me, \"This is Emma.\"\\n\\n I nod and grip my bow.\\n\\n She beams at me, \"Wow nice find Will. He save you from the farms too?\"\\n\\n I raise an eyebrow, \"I don’t need to be saved. I\u0027m the hero of my own story.\" I\u0027ve died and gone to heaven when her face drops. I read that in a novel my granny had. I\u0027ve always wanted to say it.\\n\\n She looks at Will, who is staring at me. I walk past him and start to look around. If he doesn’t want to find his siblings that’s his problem. I\u0027ll be damned if I will let them live another moment without the knowledge their asshole brother is alive and well.\\n\\n \"You pissed at me?\"\\n\\n I don’t turn. I continue along. My eyes desperately scan the crowds of people.\\n\\n \"Willy boy.\" He shakes hands with a very tanned man with the whitest smile I\u0027ve ever seen. It almost glows in the dark.\\n\\n People continue to greet him, but I can\u0027t hear them anymore. I see what I\u0027m looking for. I see a tall guy limping with shaggy dark hair. I break into a run. I run through the crowd and dive as I get close enough for the arm of the man.\\n\\n As I make contact he turns. His face is exactly as I remember it. He has me in his arms before I can speak a word. He is mauling me like a bear, like granny always said.\\n\\n \"Emma oh my god. Emma it\u0027s you. Holy shit I thought they got you.\" He is planting kisses everywhere across my face.\\n\\n \"Where is Anna?\"\\n\\n His kisses stop but his grip on my face stays strong, \"They took her.\"\\n\\n I want to collapse into his arms and sob.\\n\\n \"Jakey.\"\\n\\n Jake drops to his knees in front of me. His hands leave my face and fall onto the tops of his knees.\\n\\n \"Will? Will? Is that you?\"\\n\\n Will rushes at him and lifts him up. He pulls him into his embrace. The brother\u0027s hug is fierce but all I hear is the sentence \u0027they took her\u0027 repeating in my mind.\\n\\n Jake looks back at me, \"You found him?\"\\n\\n I shake my head. I have no words.\\n\\n They hug and cry and laugh but I am stunned. Finally able to speak I mutter. \"Where did they take her?\"\\n\\n Their reunion no longer means anything to me. \\n\\n","sourceLink":"https://allnovel.net/born-born-1/page-16.html","bookId":1604,"book":{"id":1604,"title":"Born (Born #1)","description":"Storyline: Born (Born #1) \\n \"It\u0027s us and them, Em. There are no regular people anymore.\" \\n Ten years ago when the world ended she ran for her life. \\n Five weeks ago the world she\u0027d hidden from came knocking on the door of her secluded cabin. \\n Ten days ago she found salvation hiding amongst the dead. \\n Yesterday she went back for the living. \\n Today she wonders if she will live to see tomorrow. \\n What do you do when the world you were born to is gone? \\n Where do you hide when even your own body isn\u0027t safe? \\n Emma ran when her daddy told her to. She hid like he said she should. He was the first person she turned her back on. The first one she let die. \\n Ten years has gone by and she still lives by the simple rules he taught her when she was nine years old. \\n \"Don\u0027t help anyone. Don\u0027t go where other people are unless you have to. Trust no one. Always pull the trigger.\" \\n Until one night she hears the worst sound in the world, a knock. A simple, timid knock, on the door to her cabin. \\n Only the voice of the brave little girl, ready to die for her brother, persuades Emma to open the door. \\n As her fingers turn the lock, she has a terrible feeling she will regret her decision. \\n But even as regret fills her world, so do love and companionship. Things she never imagined she would ever have again. \\n Everything comes at a cost, you decide what you\u0027ll pay.\\n","cover":"https://allnovel.net/images/born-born-1.jpg","author":"Tara Brown","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/born-born-1.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 5:55:14 PM"}}
