{"id":13804,"no":21,"title":"CHAPTER XXI","content":"At twelve o’clock on the night that witnessed the production of the tragedy, Lucian found himself one of a group of six men which had gathered together in Harcourt’s dressing-room. There was a blue haze of cigarette smoke all over the room; a decanter of whisky with syphons and glasses stood on a table in the centre; most of the men had already helped themselves to a drink. Lucian found a glass in his own hand, and sipped the mixture in it he recognised the taste of soda, and remembered in a vague fashion that he much preferred Apollinaris, but he said to himself, or something said to him, that it didn’t matter. His brain was whirling with the events of the night; he still saw, as in a dream, the misty auditorium as he had seen it from a box; the stage as he had seen it during a momentary excursion to the back of the dress-circle; the busy world behind the scenes where stage-carpenters sweated and swore, and the dust made one’s throat tickle. He recalled particular faces and heard particular voices; all the world and his wife had been there, and all the first-nighters, and all his friends, and he had spoken to a great many people. They all seemed to swim before him as in a dream, and the sound of their voices came, as it were, from the cylinder of a phonograph. He remembered seeing Mr. Chilverstone and his wife in the stalls—their faces were rapt and eloquent; in the stalls, too, he had seen Sprats and Lord Saxonstowe and Mrs. Berenson; he himself had spent some of the time with Haidee and Darlington and other people of their set in a box, but he had also wandered in and out of Harcourt’s dressing-room a good deal, and had sometimes spoken to Harcourt, and sometimes to his business manager. He had a vague recollection that he had faced the house himself at the end of everything, and had bowed several times in response to{179} cheering which was still buzzing in his ears. The night was over. \n \n He took another drink from the glass in his hand and looked about him; there was a curious feeling in his brain that he himself was not there, that he had gone away, or been left behind somewhere in the world’s mad rush, and that he was something else, watching a semblance of himself and the semblance’s surroundings. The scene interested and amused whatever it was that was looking on from his brain. Harcourt, free of his Greek draperies, now appeared in a shirt and trousers; he stood before the mirror on his dressing-table, brushing his hair—Lucian wondered where he bought his braces, which, looked at closely, revealed a peculiarly dainty pattern worked by hand. All the time that he was manipulating the brushes he was talking in disconnected sentences. Lucian caught some of them: ‘Little cutting here and there—that bit dragged—I’m told that was a fine effect—very favourable indeed—we shall see, we shall see!’—and he wondered what Harcourt was talking about. Near the actor-manager, in an easy-chair, sat an old gentleman of benevolent aspect, white-bearded, white-moustached, who wore a fur-lined cloak over his evening-dress. He was sucking at a cigar, and his hand, very fat and very white, held a glass at which he kept looking from time to time as if he were not quite certain what to do with it. He was reported to be at the back of Harcourt in financial matters, and he blinked and nodded at every sentence rapidly spoken by the actor-manager, but said nothing. Near him stood two men in cloaks and opera-hats, also holding glasses in their hands and smoking cigarettes—one of them Lucian recognised as a great critic, the other as a famous actor. At his own side, talking very rapidly, was the sixth man, Harcourt’s business-manager. Lucian suddenly realised that he was nodding his head at this man as if in intelligent comprehension of what he was saying, whereas he had not understood one word. He shook himself together as a man does who throws drowsiness aside.{180} \n \n ‘I’m sorry,’ he said. ‘I—I don’t think I was paying attention. I don’t know why, but I feel half-asleep.’ \n \n ‘It’s the reaction,’ said Harcourt, hastily getting into his waistcoat and coat. ‘I feel tired out—if I had my way there should be no such thing as a first night—it’s a most wearing occasion.’ \n \n The famous critic turned with a smile. \n \n ‘Think of being able to lie in bed to-morrow with a sheaf of newspapers on your counterpane!’ he said pleasantly. \n \n Then somehow, chatting disjointedly, they got out of the theatre. Harcourt and Lucian drove off in a hansom together—they were near neighbours. \n \n ‘What do you think?’ asked Lucian, as they drove away. \n \n ‘Oh, I think it went all right, as far as one could judge. There was plenty of applause—we shall see what is said to-morrow morning,’ answered Harcourt, with a mighty yawn. ‘They can’t say that it wasn’t magnificently staged,’ he added, with complacency. ‘And everything went like clockwork. I’ll tell you what—I wish I could go to sleep for the next six months!’ \n \n ‘I believe I feel like that,’ responded Lucian. ‘Well, it is launched, at any rate.’ \n \n The old gentleman of the white beard and fur-lined cloak drove off in a private brougham, still nodding and blinking; the actor and the critic, lighting cigars, walked away together, and for some time kept silence. \n \n ‘What do you really think?’ said the actor at last. ‘You’re in rather a lucky position, you know, in respect of the fact that the Forum is a weekly and not a daily journal—it gives you more time to make up your mind. But you already have some notion of what your verdict will be?’ \n \n ‘Yes,’ answered the critic. He puffed thoughtfully at his cigar. ‘Well,’ he said, ‘I think we have heard some beautiful poetry, beautifully recited. But I confess to feeling a certain sense of incongruity in the attempt to mingle Greek art with modern stage accessories.{181} I think Damerel’s tragedy will read delightfully—in the study. But I counted several speeches to-night which would run to two and three pages of print, and I saw many people yawn. I fear that others will yawn.’ \n \n ‘What would you give it?’ said the actor. ‘The other ran for twelve months.’ \n \n ‘This,’ said the critic, ‘may run for one. But I think Harcourt will have to withdraw it within three weeks. I am bearing the yawns in mind.’ \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1876/54270.html","bookId":804,"book":{"id":804,"title":"Lucian the dreamer","description":"简介： The railway station stood in the midst of an apparent solitude, and from its one long platform there was no sign of any human habitation. A stranger, looking around him in passing that way, might well have wondered why a station should be found there...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1876","creation":"Aug 1, 2019 12:19:33 AM","modification":"Aug 1, 2019 12:19:33 AM"}}
