{"id":13812,"no":29,"title":"CHAPTER XXIX","content":"Lucian settled down into a groove-like existence. He read when he liked and worked when he felt any particular inclination to do so; he amused himself at times with the life which a man of his temperament may live in Paris, but always with the air of one who looks on. He made a few new friends and sometimes visited old ones. Now and then he entertained in a quiet, old-fashioned way. He was very indulgent and caressing to a certain coterie of young people who believed in him as a great master and elevated his poetry to the dignity of a cult. He was always a distinguished figure when he showed himself at the opera or the theatre, and people still pointed him out on the boulevards and shook their heads and said what a pity it was that one so young and handsome and talented should carry so heavy a burden. In this way he may be said to have become quite an institution of Paris, and Americans stipulated with their guides that he should be pointed out to them at the first opportunity. \\n\\n \\n\\n Whatever else engaged Lucian’s attention or his time, he never forgot his daily visit to the quiet house in the suburbs where Haidee still played with dolls or laughed gleefully at her attendants. He permitted nothing to interfere with this duty, which he regarded as a penance for his sins of omission to Haidee in days gone by. Others might forsake Paris for the sea or the mountains; Lucian remained there all the year round for two years, making his daily pilgrimage. He saw the same faces every day, and heard the same report, but he never saw his wife. Life became curiously even and regular, but it never oppressed him. He had informed himself at the very beginning of this period that this was a thing to be endured, and he endured it as pleasantly and{232} bravely as possible. During those two years he published two new volumes, of a somewhat new note, which sold better in a French translation than in the English original, and at Mr. Harcourt’s urgent request he wrote a romantic drama. It filled the Athen?um during the whole of a London season, and the financial results were gratifying in a high degree, for the glamour and mystery of the affaire Damerel were still powerful, and Lucian had become a personality and a force by reason of his troubles. \\n\\n \\n\\n At the end of two years, the doctor to whose care Haidee had been entrusted called Lucian into his private room one day and told him that he had grave news to communicate. His patient, he said, was dying—slowly, but very surely. But there was more than that: before her death she would recover her reason. She would probably recall everything that had taken place; it was more than possible that she would have painfully clear recollections of the scene, whatever it might be, that had immediately preceded her sudden loss of sanity. It was but right, said the doctor, that Mr. Damerel should know of this, but did Mr. Damerel wish to be with his wife when this development occurred? It might be a painful experience, and death must soon follow it. It was for Mr. Damerel to decide. Lucian decided on the instant. He had carried an image of Haidee in his mind for two years, and it had become fixed on his mental vision with such firmness that he could not think of her as anything but what he imagined her to be. He told the doctor that he would wish to know as soon as his wife regained her reason—it was his duty, he said, to be with her. After that, every visit to the private asylum was made with anxious wonder if the tortured brain had cleared. \\n\\n \\n\\n It was not until the following spring—two and a half years after the tragedy of the Bristol—that Lucian saw Haidee. He scarcely knew the woman to whom they took him. They had deluged him with warnings as to the change in her, but he had not expected to find her a{233} grey-haired, time-worn woman, and he had difficulty in preserving his composure when he saw her. He did not know it, but her reason had returned some time before, and she had become fully cognisant of her surroundings and of what was going to happen. More than that, she had asked for a priest and had enjoyed ghostly consolation. She gazed at Lucian with a curious wistfulness, and yet there was something strangely sullen in her manner. \\n\\n \\n\\n ‘I wanted to see you,’ she said, after a time. ‘I know I’m going to die very soon, and there are things I want to say. I remember all that happened, you know. Oh yes, it’s quite clear to me now, but somehow it doesn’t trouble me—I was mad enough when I did it.’ \\n\\n \\n\\n ‘Don’t speak of that,’ he said. ‘Forget it all.’ \\n\\n \\n\\n She shook her head. \\n\\n \\n\\n ‘Never mind,’ she went on. ‘What I wanted to say was, that I’m sorry that—well, you know.’ \\n\\n \\n\\n Lucian gazed at her with a sickening fear creeping closely round his heart. He had forced the truth away from him: he was to hear it at last from the lips of a dying woman. \\n\\n \\n\\n ‘You were to blame, though,’ she said presently. ‘You ought not to have let me go alone on his yacht or to the Highlands. It was so easy to go wrong there.’ \\n\\n \\n\\n Lucian could not control a sharp cry. \\n\\n \\n\\n ‘Don’t!’ he said, ‘don’t! You don’t know what you’re saying. It can’t be that—that you wrote the truth in that letter? It was—hallucination.’ \\n\\n \\n\\n She looked at him out of dull eyes. \\n\\n \\n\\n ‘I want you to say you forgive me,’ she said. ‘The priest—he said I ought to ask your forgiveness.’ \\n\\n \\n\\n Lucian bowed his head. \\n\\n \\n\\n ‘Yes,’ he said, ‘I forgive all you wish. Try not to think of it any more.’ \\n\\n \\n\\n He was saying over and over to himself that she was still disordered of mind, that the sin she was confessing was imaginary; but deeper than his insistence on this lay a dull consciousness that he was hearing the truth.{234} He stood watching her curiously. She suddenly looked up at him, and he saw a strange gleam in her eyes. \\n\\n \\n\\n ‘After all,’ she said, half spitefully, ‘you came between him and me at the beginning.’ \\n\\n \\n\\n Lucian never saw his wife again. A month later she was dead. All the time of the burial service he was thinking that it would have been far better if she had never recovered her reason. For two years he had cherished a dream of her that had assumed tender and pathetic tones. It had become a part of him; the ugly reality of the last grim moments of her life stood out in violent contrast to its gentleness and softness. When the earth was thrown upon the coffin, he was wondering at the wide difference which exists between the real and the unreal, and whether the man is most truly blessed who walks amongst stern verities or dreams amidst the poppy-beds of illusion. One thing was certain: the face of truth was not always beautiful, nor her voice always soothing to the ear. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1876/54278.html","bookId":804,"book":{"id":804,"title":"Lucian the dreamer","description":"简介： The railway station stood in the midst of an apparent solitude, and from its one long platform there was no sign of any human habitation. A stranger, looking around him in passing that way, might well have wondered why a station should be found there...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1876","creation":"Aug 1, 2019 12:19:33 AM","modification":"Aug 1, 2019 12:19:33 AM"}}
