{"id":80236,"no":19,"title":"Page 19","content":"I wasn’t the type that got jealous, I mean I lived my entire life not being as good as my twin so I couldn’t understand the murderous rage that was suddenly flowing through me, the sudden need to claim something, do announce to the world that she was mine. Luckily Nash got to the table first and sent the guy on his way in no uncertain terms because chances were I would have pulverized him and ended up spending the night in jail. Still when I got back to the table I had yanked Shaw up to the tips of her fancy ass blue shoes and planted a kiss on her pretty, pink mouth hard enough that my lip ring stung. I thought maybe she would pull back, maybe give me crap for acting like an idiot bit she just griped my shirt in her tiny hands and let me do what I had to do. When I finally set her back down her eyes looked glassy and she was flushed. She slicked her tongue over her bottom lip and settled back into my side. “Gotta tell you Rule, I’m a fan of kissing with all that metal in your face. I never thought that was something I would be into, but you sure make it work.” Oh man was that the hottest thing I had ever heard, ever. I hooked an arm around her shoulder. “And you know maybe next time you could just pee in a circle around me so that they know you’ve already been there.” I chuckled at her dry remark but didn’t bother to deny what the overt action had been about. We continued to chat and have a great time but by the time the house lights went down and Jet was ready to hit the stage I had had enough of friend time and wanted alone time with just her, unfortunately Jet knew how to put on a good show and even though Ayden claimed that the racket the band was making could in no way be called music it only took two songs to have her dragging Shaw up to the front of the stage with her. The band was loud, aggressive and blazed from song to song, but Jet was a good looking guy and knew how to work a crowd so it didn’t surprise me when the girls had run off that there had been a drunkenly, interested gleam in Ayden’s eyes. Unfortunately it also left me alone to deal with my plastered best friend. “You gonna make it?” Nash’s violet eyes were at half-mast and I was pretty sure that if the table wasn’t available to hold him up he would be face first down on the floor. This is what I normally looked like after a night of hard drinking, it was slightly startling to see it from the other side. “Huh?” His words were mumbled and unfocused and I saw visions of sexy time going up in smoke and replaced with the reality that I was going to have to manhandle him back to the apartment and get him in a bathroom like right now. “Bro you better not yak in my truck. Let me go find the girls and let them know we have to go.” “Smhhh…” Okay it was mission critical to get him out of here before the tequila came back up. I sighed and started toward the stage only to be intercepted before I got there by the blond from earlier. Now that Shaw was here and my head was in control not what was in my pants I could clearly see there was no comparison between the two. Shaw was flawless and pretty in a way that didn’t require five pounds of makeup and clothes that exposed more than they covered. She was also charmingly unaware of the affect she had on the opposite sex, where this girl was here to be seen and appreciated. She put a finger on the center of my chest and blinked heavily lashed eyes at me. “Hey.” “Uh hi.” I would just step around her but the bar was packed and the band was making the crowd go crazy. People were jumping up and down and banging heads all around so unless I walked right over her I wasn’t going to be able to get by. Because I was so tall I had a clear sight of one dark head and one light bouncing along to the music right up front, while I was stoked Shaw seemed to be having fun, I was also bummed she was practically impossible to get to. “So I saw you earlier, you’re friends with the band.” “Yep.” Normally this was the kind of girl I sought out, easy, no strings, aware of where the night was going and what the morning was going to hold. “So do you maybe wanna get out of here, go somewhere quieter where we can…talk?” My eyebrows shot up. When I was drunk maybe that sounded smoother, but now that I was sober it just seemed kind of sleazy and desperate. “Thanks but I’m here with somebody.” Her bright red mouth pulled into a frown and she took a step back. “Yeah I saw that, and I also saw that there is no way that she’s with you for long.” I was used to judgment, used to hearing that I wasn’t up to par or good enough for whatever reason, but coming from a boozed up bar fly that had just tried to talk me into taking her to bed it made me reel back a little. “Okay.” I didn’t know what else to say to that. The girl snorted and flipped her over processed hair over her shoulder. “That girl has money and status written all over her, you have ink and nothing but a good time spelled out bright and clear all over you. How long do you think she’s going to think you’ve got more going on than that?” I frowned and was done with social courtesy. I physically moved her out of my way and called over my shoulder, “I don’t know, but I’d be an idiot not to stick around until she figures it out.” Sweaty bodies got nudged and prodded until I got to the girls. Jet was right in front of them both on his knees, his head was thrown back, his shirt was torn off and the massive angel of death I had tattooed across his torso was in full display. He was wailing like a true rock god and while Shaw looked fascinated, Ayden looked like she was about to melt into a pile of orgasmic goo. Looked like my buddy had turned the country mouse, rock for the night. I put a hand on Shaw’s hip and bent low to tell her, “I gotta get Nash out of here, he’s done for.” She looked at me with big eyes and nodded with no argument. She leaned over to holler something at Ayden who hollered something back. The brunette wiggled her fingers at me in a wave and the next thing I knew Shaw’s tiny frame was pulling me back through the crowd. Nash was now almost fully draped over the table and I didn’t miss the bouncer giving him the eye. “What about Ayden, you said we needed to make sure she got home okay?” “She promised to call when she was leaving. She said she would just get a cab.” “She’ll be alright here by herself?” “Yeah, she’s a big girl and can take care of herself, plus I think she danced most of the booze out. I think she’s sticking around to tell your friend how much she enjoyed the show.” “Jet has that effect on women.” “I can see why.” I wrestled Nash up and marched him out of the bar with an arm around his waist. He was solid and maneuvering his sturdy bulk was difficult. “You gonna change your mind and drop me for a rock star?” She snorted and took the keys I tossed her to get the cab doors open so that I could shove Nash sideways across the back seat. “You better not get sick in here dude.” There was no response so I helped Shaw climb in and it occurred to me that she hadn’t even hesitated to leave with me. That made something in the center of my chest get all slippery and warm. “I’m just saying that he’s pretty charismatic and even though I didn’t understand half of what he was singing it was still pretty powerful. He had that entire bar eating out of the palm of his hand, that kind of draw is impressive.” “Yeah, Jet was born to be a rock star he just has a problem with the spotlight and recognition he always has.” “You’ve known him a long time?” “We used to go see him play when we were kids, back when he was into punk. Nash, Jet and Rowdy have been my inner circle for a long time. Rowdy we met later when he started working at the shop but we all kick it like we are brothers from other mothers.” She settled in the leather seat and I adjusted the heat when I noticed she was rubbing goose bumps on her arms. “It must be nice to have a lot of good friends. I was never like that.” I looked out of the corner of my eye at her. “What do you mean?” “I’m shy and awkward. I never know how to just make friends like that. I was picked on a lot in high school. Remy was my only real friend and now really only Ayden. I have a hard time letting people in, I guess because I’ve seen how painful it is when it’s the people that are the closest to you are the ones constantly disappointing you.” “What about me and Rome?” “What about you?” Nash groaned from the back and I looked over my shoulder apprehensively. He didn’t sound good. “What about us, we were there too, weren’t we your friends?” She made a little humming noise that immediately made vital parts of my anatomy take notice. “Rome has always been like a big brother, he looked out for me, he picks on me, he tries to keep things that hurt me and cause me pain at bay. You, well you were always something else, not a friend, not a brother just something else.” “Is that bad, the something else?” I felt rather than saw her shrug. “It has been, and then sometimes it’s not.” I didn’t know what to make of that so I let the subject drop. I drove the rest of the way keeping one eye on the road and one eye on Nash who was making increasingly loud noises of distress in the back. When we got to the apartment I looked across the cab at her but she was bent over the back of the seat rubbing Nash’s bald head and uttering soothing words to him. “Hey I don’t know how long it’ll take to get him squared away, you can just hangout and if you want me to run you home or whatever I will.” She looked at me over her shoulder and raised a pale brow. “Rule its fine. It’s not like I don’t know how you end up in the state you’re normally in on Sunday morning. Like I told you I just have to be to work on Sunday around ten as long as you make that happen we’re good.” At a loss for words I just stared at her for a moment before Nash’s gurgling made me move. “Have you always been this awesome?” She shut all the doors behind us and helped me haul Nash up the steps. I noticed she didn’t answer my question, but she did get Nash a huge glass of water and fished around in my bathroom until she found some pain killers. She left both on the bathroom sink in the hall that Nash used and gave me a pointed look. “Come find me when you’re done.” I swore in a long litany under my breath as I helped Nash battle his thermal and jeans off. I was contemplating shoving his ass in a cold shower when the tequila started to take its revenge. The tattooed head disappeared inside the toilet and I spent the next hour making sure he didn’t pass out and alternately cramming liquids down his throat and jumping out of the way as they came back up. When I was finally sure he wasn’t going to get sick anymore I hauled him to his bed and made sure he was face down before I did a quick cleanup of the bathroom and myself and then went to find Shaw. The door to my room was cracked open and she had my TV on. I wasn’t sure what I was going to find, the dirtier part of my imagination had all kinds of interesting scenarios laid out but wait awaited me wasn’t one of them. She had my California king stripped to the mattress pad and was making short work of changing all the bedding. Her crazy blue shoes were in the center of the floor looking totally out of place next to my discarded t-shirts and jeans and as I propped myself up in the doorway all I could do was watch her. She seemed to be having some kind of conversation with herself but she was muttering too low for me to hear what she was saying. I waited a full five minutes for her to look up at me or notice my watching her but she never did, so I asked, “What are you doing?” which made her jump about a foot in the air.","sourceLink":"https://allnovel.net/rule-marked-men-1/page-19.html","bookId":2729,"book":{"id":2729,"title":"Rule (Marked Men #1)","description":"Storyline: Rule (Marked Men #1) Opposites in every way . . . except the one that matters Shaw Landon loved Rule Archer from the moment she laid eyes on him. Rule is everything a straight--A pre-med student like Shaw shouldn’t want--and the only person she’s never tried to please. She isn’t afraid of his scary piercings and tattoos or his wild attitude. Though she knows that Rule is wrong for her, her heart just won’t listen. To a rebel like Rule Archer, Shaw Landon is a stuck-up, perfect princess-and his dead twin brother’s girl. She lives by other people’s rules; he makes his own. He doesn’t have time for a good girl like Shaw-even if she’s the only one who can see the person he truly is. But a short skirt, too many birthday cocktails, and spilled secrets lead to a night neither can forget. Now, Shaw and Rule have to figure out how a girl like her and a guy like him are supposed to be together without destroying their love . . . or each other.","cover":"https://allnovel.net/images/rule-marked-men-1.jpg","author":"Jay Crownover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rule-marked-men-1.html","creation":"Oct 5, 2019 8:59:19 AM","modification":"Oct 5, 2019 4:24:17 PM"}}
