{"id":80259,"no":42,"title":"Page 42","content":"“Hey.” The corners of her mouth pulled down and my mom flat out ignored me. “Hey. Let’s go inside I’m freezing.” She let my mom pull her along and a little sliver of anger started to spark under my skin but this wasn’t about me so I tried to stamp it down as my dad cupped me on the back of the neck and gave me a little shake. It was a gesture that made me feel like I was ten years old again which was funny since I was about six inches taller than him now. “This is a good thing for all of us kiddo. Just be patient and we’ll all get better at being a solid unit again.” “It’s just dinner dad. Let’s not get ahead of ourselves.” “Well we have to walk before we run, son and as of now the Archer’s are barely managing a staggering limp. All we can do is move forward.” I didn’t know what to say to that so I just kept my mouth shut and watched Shaw’s shapely form as the hostess guided our group to a table in the back of the building. My mom was jabbering nonstop at her and she was occasionally nodding and making noises of agreement but what she wasn’t doing at all was looking at me or acknowledging me in anyway. The anger was starting to turn from a smolder to a burn and if something didn’t break soon I was going to do something I was bound to regret later. When we sat at the table I ended up sandwiched between my brother and my girlfriend, one was looking at me warningly the other was watching me with eyes shrouded in sadness and accusation, two things I didn’t understand and was ready to say the hell with it to get answers about. I never got the chance because as soon as I turned to Shaw the waitress appeared and we were busy ordering drinks and my mom once again high jacked all Shaw’s attention. Just to test the waters of how deep I was in I put a hand on her thigh under the table and felt her tense at my touch. I waited for her to move or to pry it off with her own hand but she never even stopped the flow of conversation with my mom. It was obvious that they had missed each other and I felt a stab of guilt that Shaw had missed out on a relationship she obviously appreciated because of her loyalty and feelings for me. I let my dad and brother draw me into a conversation about the Broncos and kept an eye on Shaw as we ordered dinner. She never moved my hand but she never once looked my way either and I just didn’t know what to make of it. I was grateful however that as long as my mom was focused on her she didn’t so much as bat an eyelash in my direction allowing the dinner to go as smooth as it could considering the circumstances and hostile undercurrents. Dad ordered a bottle of champagne with dessert and before it showed up my mom got up to use the restroom finally giving Shaw a chance to turn and look at me. When she did her mouth was tight and her super light eyebrows were furrowed over her eyes. “We need to talk.” My own eyebrows shot up so hard they pulled against the hoops pierced there. “That’s kind of hard to do when you won’t answer the phone when I call you and you make up lame ass excuses night after night to avoid spending time with me.” I saw her flinch and she leaned closer so that our heads were bent near one another. She hissed in a tone low enough that only I could hear, “Well excuse me for not knowing what to say to you considering the last time we didn’t talk for a few days you stuck your tongue down the first willing girl’s throat. I don’t know what’s going on with you, but I feel like you’re turning into a stranger and I hate it.” I scowled at her and tightened my fingers on her leg. “Do you trust me at all? Geez Shaw maybe I was just trying to be a better boyfriend, one that doesn’t flip out over stupid shit all the time and one that isn’t in jail while your psycho ex is still on the prowl? Maybe I was trying to act right for a change. I was trying to be the kind of guy you deserve.” She blew out a hard breath through her clenched teeth and her emerald colored eyes sharpened with an anger that I was surprised to see burned as hot as mine. “Maybe you should have asked me before deciding what I deserve, Rule. Maybe I liked the you that flips out over stupid shit. Maybe I miss the you that is passionate enough about me, about my safety to risk going to jail over my psycho ex and I sure as hell never asked for you to be a better boyfriend, in fact the boyfriend of the last week has done nothing but make me confused and sad.” I don’t think either of us realized that we had raised our voices or that we now had a captive audience. In fact it took my mom making a noise low in her throat like a wounded animal as she wobbled on her heels next to her chair to get our attention. She was looking between me and Shaw with huge eyes and had a hand pressed hard into her chest. My dad looked far less surprised but worried about my mom as usual. “What did you just call him?” Shaw looked at my mom then back at me. She sighed and answered softly like she was afraid the news would shatter the woman before her. “Rule had I have been seeing each other for a little over a month now. I told him he needed to stop acting like he needed to be someone else to be a better boyfriend.” She turned to look at me and I could see her doing some kind of internal warfare with herself. Finally she sucked in a deep breath and turned back to my mom. “I’ve been in love with him since I was thirteen, Margot.” I went still at her confession and felt everything inside me turn to jelly. She loved me. This perfect, wonderful, kind young woman loved me and had for a long time. I didn’t know where to put that because my mom started blinking back tears and for the first time that night turned her attention to me. “It’s not enough that you took Remy’s life? You had to take the girl he loved from him too?” Stunned silence landed on the table like a ton of bricks. My instinct was to push away from the table and storm out of the restaurant but I couldn’t because Shaw clamped a hand over mine on her leg and my dad and Rome both leapt to their feet in outrage. “Margot!” “Mom!” Voices were raised and the other patrons in the restaurant were starting to pay all kinds of attention to the scene we were making but I was too stunned to care. I heard Shaw say my name, felt my brother put his hand on my shoulder but I just wasn’t there, at least I wasn’t there until Shaw climbed to her feet put her fingers in her mouth and let out a whistle that has us all looking at her in shock. She put her hands on the table and leaned forward so that she was talking directly to my mom but she made eye contact with all of us. “Everyone shut up,” she pointed a finger at my mom and narrowed her eyes. “Listen to me Margot and for once you need to hear what I’m saying. I loved Remy, still do but we were never in love. He knew how I felt about Rule and at times both encouraged and discouraged it but at the end of the day he knew we don’t necessarily choose who we fall in love with.” She took a deep breath and I watched her chest rise and fall. She was struggling with something, something big if the flush on her face and the way her hands balled into fists were any indication. “Remy had secrets, I know you boys were close, that you all loved and respected each other but Remy was different than the two of you and he just didn’t know how to tell you. He thought that maybe it was best for everyone to just let all of you assume we were a couple because of how hard Dale and Margot were on Rule and all he did was tattoo himself and wear his hair all crazy.” She turned so that she was fully facing me and I saw she had tears in her eyes and that her bottom lip was trembling. I wanted to wrap her up in a hug and make it all better but even in my emotional shell shock I was experiencing I knew her words were about to change my world forever. “I promised him and I owed him so much, I swore on my life I would never tell anyone,” she let her gaze skip around the table and land on all of us. “Remy was gay. He was my best friend, my surrogate family but he was a homosexual. He was involved in a serious relationship with a guy named Orlando Fredrick that he met his last year playing ball. That was the real reason he moved to Denver after school, Lando goes to DU as well.” Disbelief foreign and cold snaked up my spine. Rome let out a string of nasty words and my mom started bawling in earnest. Shaw turned sad eyes in my direction and I looked at her like I had never seen her before. “No way. He would have told me.” She shook her head, sending white and black hair sliding across her shoulders. “He wanted to but he was worried you wouldn’t understand his desire to keep it quiet. He was scared you would push him to come out. It was never about worrying how you would react, he just knew it would kill Margot.” “We were twins god damnit. He would have told me.” “Rule.” I pushed away from the table and glared down at her. “This is bullshit.” Rome got to his feet as well and I noticed he was looking at Shaw with hard eyes as well. “You don’t need to make up lies about the deceased to try and fix things for Rule. That’s desperate and uncalled for Shaw.” Tears trailed down her face as she looked back and forth between us she opened her mouth to say something but was cut off by my dad clicking his spoon against the side of his champagne glass. “Alright everybody sit down and shut the hell up.” He cut a hard look at my mom and pointed to the seat she had vacated moments ago. She looked like she was going to faint and she looked about as happy to sit next to Shaw as she did when I stopped by a few weeks ago. I sat back down begrudgingly but surprisingly Rome was the hold out. He hovered by the back of his chair until my dad glared at him and pointed, “Ass in the chair solider.” Shaw was crying next to me and now instead of wanting to comfort her all I wanted to do was get as far away from her as possible. My dad cleared his throat and crossed his arms on the table. “Things in this family have been in shambles for a long time. There has been too much dishonesty and too much subterfuge for everyone’s sake and I’m done trying to sweep it all under the rug just to keep my wife happy because she isn’t, none of us are.” He rubbed a hand over his chin and suddenly he looked a hundred years older than he actually was. “Margot don’t pretend to not know that the way you’ve been treating Rule these last few years is cruel and uncalled for. I lost my son the same as you and I’m done watching you try and turn the remaining one into a stranger or into someone that hates us. He’s a good boy; he works hard, loves his family and clearly has qualities that are good enough for our girl to appreciate. I’m finished with freezing him out. We both know Shaw has been in love with him since she was a kid, we saw the way she watched him, the way she defended him and don’t think for one second I didn’t notice that’s why you were always trying to shove her in Remy’s direction.” He heaved a sigh that seemed like it came all the way from my youth and looked at me and Rome. “Shaw isn’t lying to you boys. Your brother did in fact live an alternative lifestyle. He might not have wanted your mother and me to know about it but teenagers are crap liars and he wasn’t exactly as discrete with it as he might have thought.” He slid a sideways look at my mom while Rome and I gave each other shocked looks. “Margot thought it was a phase that’s the main reason she was so eager to welcome Shaw into our home and family. At first she was convinced you were going to change him, make him like girls or more specifically like you but like I said it was pretty obvious your interest was in Rule and there was no way even if he had been straight that he would have done that to you. After a while we just adored you so much and saw how much love you were missing and how much you had to give that we couldn’t let you go even though I never approved of the way Rem let everyone just believe there was more between you two than friendship.”","sourceLink":"https://allnovel.net/rule-marked-men-1/page-42.html","bookId":2729,"book":{"id":2729,"title":"Rule (Marked Men #1)","description":"Storyline: Rule (Marked Men #1) Opposites in every way . . . except the one that matters Shaw Landon loved Rule Archer from the moment she laid eyes on him. Rule is everything a straight--A pre-med student like Shaw shouldn’t want--and the only person she’s never tried to please. She isn’t afraid of his scary piercings and tattoos or his wild attitude. Though she knows that Rule is wrong for her, her heart just won’t listen. To a rebel like Rule Archer, Shaw Landon is a stuck-up, perfect princess-and his dead twin brother’s girl. She lives by other people’s rules; he makes his own. He doesn’t have time for a good girl like Shaw-even if she’s the only one who can see the person he truly is. But a short skirt, too many birthday cocktails, and spilled secrets lead to a night neither can forget. Now, Shaw and Rule have to figure out how a girl like her and a guy like him are supposed to be together without destroying their love . . . or each other.","cover":"https://allnovel.net/images/rule-marked-men-1.jpg","author":"Jay Crownover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rule-marked-men-1.html","creation":"Oct 5, 2019 8:59:19 AM","modification":"Oct 5, 2019 4:24:17 PM"}}
