{"id":80263,"no":46,"title":"Page 46","content":"I was standing in front of the mirror doing my hair and trying in vain to cover up the yellowish remnant of my black eye when I had a startling revelation. Loving Rule had never been easy, it was always hard and painful and the payoff had been years coming, but I had never decided he wasn’t worth it. To me loving him had never been a choice, it was just something I had decided was inevitable, just like I had decided him ever coming to care about me was never going to happen. Last night I had been so sure I wouldn’t have any fun, that going out was going to be miserable and awful but after doing it I had a blast and it was totally worth the risk and harassing I had suffered to get me to go. I had done what I swore I never would, I had walked away because there was no guarantee in the end, no guaranteed happy ending for us.\n I set my curling iron down on the sink and stared at myself in the mirror all the sadness and missing part of myself clear in the reflection staring back at me. Rule was the one thing I had always wanted and when it got hard to hold onto him I had just let go rather than fight to keep ahold of him and that wasn’t right. I deserved love but I also deserved him and whatever form that his love came in. Rule wasn’t a normal guy, there was never going to be hearts and flowers or poetry flowing with words that made me blush, what there was always going to be was give and take, ups and downs and a passion that burned both of us to the core. When he asked me at the hospital ‘what if” my answer should have been if you’re asking you already do because I knew it now, could see it as clearly as I could see my own face in the mirror, Rule loved me he just didn’t know that’s what it was. Neither one of us really had shining examples of healthy loving relationships to draw from but the second he had told me he wanted to try I should have known he was falling in love with me. He never tried for anyone.\n Someone knocked on the bathroom door and Ayden popped her head in the room. “We have to head out soon are you almost ready?”\n Considering I only had the right side of my head curled I think the answer was obvious. I turned to her with huge eyes. “We need to go dress shopping after school.”\n She propped a hip in the doorway and lifted a dark eyebrow at me. “Any particular reason why?”\n “Rule’s birthday is this weekend.”\n “Cora might’ve mentioned that.”\n “He’s gotta be having a birthday party.”\n “She might’ve mentioned something about that as well.”\n “Well we have to go.”\n “Why? I thought you were done with all that noise or is this martinis from last night talking?”\n I shook my head and picked the curling iron back up. “I have to give him a present.”\n “Oh yeah? What if he’s there with someone?”\n I cut her a look. That possibility hadn’t even occurred to me. “Is that likely?”\n She muttered something under her breath and brushed her long bangs out of her face. “No. Cora said he’s been pretty much a hermit since you guys split, that and his temper is on fire so everyone that doesn’t want to be flayed alive is pretty much staying the hell out of his way. What are you planning on giving him anyway?”\n “The only thing I think he wants.”\n She snickered. “More jewelry for his face?”\n I laughed a little. “No…me. I think the only thing he really wants is me. We were both just too messed up to realize it.”\n She rubbed her hands together. “Well it should be interesting either way.”\n Interesting didn’t even begin to cover it but my new leaf was all about self-gratification and Rule was ultimately what I wanted to be gratified. I could only hope he hadn’t gone so far down the tunnel that I couldn’t pull him out.\n Chapter 17\n Rule\n “Hey dude, happy birthday.” I traced a finger over the horseshoe on the headstone that I insisted on being there and cleared away the emotion that was clogging my throat. I didn’t come here enough but every year on our birthday I made sure to stop by and let Remy know I was thinking about him. It was hard, being reminded once a year that he wouldn’t be turning twenty-three right alongside me, that I was getting older and he was stuck in time at twenty, his life cut way too short. “I’m pretty pissed off at you right now. My life is all upside down and I can’t seem to find my footing and all the stupid shit I normally do to ignore the hurt and confusion just doesn’t hold any appeal. I don’t understand why you didn’t just talk to me, why you used Shaw the way you did and I really don’t get how you just let me act like a total asshole to her for years and years knowing she had feelings for me. Well here’s a newsflash bro, I have feelings for her too and now things are so jacked up I can’t see any way to make it right. Everyone always gave me hell for being difficult, for being temperamental and complicated, turns out you had more going on under the surface than Rome and I could ever imagine and yet you were still the favorite. Isn’t that just a kick in the balls?” For the second time in a few short weeks I felt tears well up in my eyes. “Shaw kept your secret. All this time, even when things got intense between us she kept your secret. She loves you but she loves me too and I just didn’t know what to do with it so I got mad and I shut her out and as a result she got hurt and wouldn’t let me back in when that’s all I wanted. It sucks, love sucks and I feel like if you were here none of this would have ever happened in the first place so you suck too.”\n There was no answer, just the sound of my shallow breathing and the wind moving the trees. I felt really alone for the first time in a long time and the loss of my twin was really pressing down heavily on me. The last month and a half had been rough; everything with Shaw had left me strung up and stripped bare. My normal response to that overwhelming flood of emotion would have been to drink my liver into submission and screw any and every girl that looked my way. Neither of those things had been on my agenda, booze wasn’t enough to make my conscious stop screaming at me that I should have tried harder, should have handled my shock and anger better and the idea of taking anyone to bed that wasn’t Shaw made everything I had below the belt freeze up. I was working a ton, trying to keep tabs on the situation with Gabe through Mark and Alex because I was determined to keep him away from her permanently even if she didn’t know I was doing it and I was spending a lot of time with the boys licking my wounds. Even though she had been so upset with me for trying to change to be better for her, I think I had affected some major changes on my own despite myself and that wasn’t bad. I was allowing myself to feel everything and while the feelings tied up in the failure of my relationship with Shaw burned at least I was processing them and not drowning them in bad habits.\n I was getting ready to say goodbye when footsteps crunching on the thin layer of snow still covering the ground made me lift my head up. I felt my eyes narrow involuntarily and the corners of my mouth pull down when I recognized the figure making her way towards me. Every instinct I had was to get out there before she could ruin my day but I stayed put because she was looking right at me and for once there wasn’t contempt or hatred shining out of her eyes.\n “Mom.”\n “Happy birthday Rule.”\n I cleared my throat because I had no clue what to say to her. I knocked my knuckles on the hard headstone and gave my brother a silent goodbye. “I’ll take off so you can have some time with him. I’m sure today is hard for you.”\n I nearly fell over when she reached out a hand and put it on my forearm. My mom hadn’t touched me voluntarily in years and it was enough to stun me into silence.\n “It’s hard for all of us but that’s not why I’m here. I actually called your work to see if I could maybe take you to lunch for your birthday. I figured you wouldn’t answer if I called your cell so I asked your roommate where I might find you and he pointed me here. I guess if I hadn’t been so busy trying to shut you out all these years I might have figured that out on my own.”\n I took a step away from her because I was pretty sure aliens had abducted my mom and that this creature before me wasn’t real. The things coming out of her mouth were almost too much for me to take in. “Where’s dad?”\n “Home. He’s working on getting through to your brother and after all that’s happened I needed to be the one to come to you. Can I take you to lunch or maybe for coffee?”\n I didn’t want to go. I didn’t trust her or her motivations but it was my birthday and we were standing at my dead brother’s grave so turning her down just didn’t seem like a viable option or one I could live with later on.\n “Coffee would be alright.” She gave me a smile that was sad, I mean really, truly sad and I realized for the first time that my mom had a dark tunnel she disappeared into as well, that maybe it was a trait I learned from her. We walked back to the parking lot in silence and I followed her back to Brookside even though all I wanted to do was keep in driving back to Denver. We stopped at the Starbucks I always hit up and I let her buy me a coffee while I settled into a semi secluded corner and stretched out my legs. I could tell she was nervous so I tried to relax and not be as guarded as I always was around her.\n “I’ve been talking to a specialist. Your dad found someone here in town that deals with grief and family issues. I think it’s been really helpful.”\n I blinked. “That’s a change.”\n She smiled ruefully and I caught a glimpse of the woman who had raised me before our relationship had been tainted with tragedy.\n “After the way things went at dinner your dad had reached his breaking point. It was go and get help or watch my husband of thirty-six years walk away from me. Dale has always been the only constant in my life, I wouldn’t make it without him and it took realizing how alone I would be if he walked out the door to make me see what I’ve done to my family.”\n I could only stare at her in shock. I didn’t know what to say or do so I just kept sipping on my coffee and watching her.\n “You asked me how I could love Remy knowing how different he was while I always had such a hard time with you and I want to try and explain things. It’s not an excuse, our relationship has never been easy, we’ve never been as close as I was with your brother and it started when you were both born. You guys were early which is pretty common with twins, only you came out strong and healthy bellowing your little head off, Remy wasn’t so lucky. He had the cord around his neck and was breech, it took a lot of work and effort to get him here alive and well so from the start I think I focused more on him than on you which makes me a terrible mother but didn’t mean I didn’t love you both. Remy breast fed, you wanted formula and when you were old enough to walk Remy held onto my fingers and tottered all over the house, you pulled yourself up using Rome as a lever and then just took off on your own. Your brother always needed me, always wanted me and you, well you were like you are now; independent, fierce and determined to blaze your own way in the world and I just let you go. Your dad and I both just let you slip away.” \n","sourceLink":"https://allnovel.net/rule-marked-men-1/page-46.html","bookId":2729,"book":{"id":2729,"title":"Rule (Marked Men #1)","description":"Storyline: \n Rule (Marked Men #1) \n Opposites in every way . . . except the one that matters \n Shaw Landon loved Rule Archer from the moment she laid eyes on him. Rule is everything a straight--A pre-med student like Shaw shouldn’t want--and the only person she’s never tried to please. She isn’t afraid of his scary piercings and tattoos or his wild attitude. Though she knows that Rule is wrong for her, her heart just won’t listen. \n To a rebel like Rule Archer, Shaw Landon is a stuck-up, perfect princess-and his dead twin brother’s girl. She lives by other people’s rules; he makes his own. He doesn’t have time for a good girl like Shaw-even if she’s the only one who can see the person he truly is. \n But a short skirt, too many birthday cocktails, and spilled secrets lead to a night neither can forget. Now, Shaw and Rule have to figure out how a girl like her and a guy like him are supposed to be together without destroying their love . . . or each other.\n \n","cover":"https://allnovel.net/images/rule-marked-men-1.jpg","author":"Jay Crownover","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/rule-marked-men-1.html","creation":"Oct 5, 2019 8:59:19 AM","modification":"Oct 5, 2019 4:24:17 PM"}}
