{"id":64196,"no":35,"title":"Page 35","content":"\n “And here,” he said, kissing along her collarbone.\n He had the distant thought that he should have a care. They stood in the open, in a seedy alley off Aberdeen harbor, him pressing her into a darkened corner, his desire precipitous, quickly spinning to a point of no return.\n But he couldn’t summon a care. All he knew was her precious body, yielding against his. It took the full force of his will not to succumb to the lust that pounded through him and simply ruck her skirts up above her waist and take her there, hidden in the shadows.\n He stroked a hand up her torso, running his thumb along the soft flesh of her breast. “And here.”\n She drew in a sharp breath, but didn’t stop him, and so he kept tracing his thumb up and down, his pressure growing just a bit firmer, his touch approaching just a bit closer to the tip of her breast.\n “You … you were looking there too?” she asked, her voice breathy and shallow.\n “Oh, most definitely.”\n She gave a little self-conscious wriggle. “B-but, there’s not … I’m not … I’m so…”\n “Ah,” he said, guessing her fears. He brought his other hand up to caress her other side, calming her nervous body. Kissing up her throat to her ear, he whispered, “Is it you think you’re too thin?”\n He heard her breathing change, felt her reluctant nod.\n “Silly, perfect, foolish woman.” He kissed his way along her jaw to her mouth, where he hovered over her lips. “You see, Beth, you aren’t the only wicked one. I’ve been looking here”—he cupped one breast—“and here”—then the other—“since first we met.”\n He touched his lips to hers just as he gave a gentle squeeze to her breasts. They nestled in his palms as though they’d been made just for him. “Perfect, I told you.”\n He could feel her hardened nipples through the fabric of her bodice, and rubbed his open palms over them, then closed his hands to squeeze again.\n There was a faint answering crinkle. His stolen paper. And regretfully, he remembered his purpose. It was perhaps the only excuse strong enough to bring him to his senses, recalling where they were, pulling him from this lusty haze.\n Aidan chuckled. “Perfect for my hands, but not perfect enough to conceal my papers.”\n She pulled away, and her face was an endearing tangle of emotions: humor on her lips, embarrassment in her cheeks, and lust in her eyes. “You cheated.”\n “I wanted my paper back.” His gaze was heavy on her as she reached in her bodice to pull it out. He vowed, someday he’d have the right to reach his hand under that bodice. To strip it off himself, if that was his desire. He knew Beth would have him—he saw it in those allknowing eyes, felt it in her kisses. He just needed to finish what he’d set out to do, and then he would make her his. “I’ve gone long years without getting what I want. But no longer.”\n Chapter 23\n Elspeth shivered. He’d spoken such dark, such rousing, such thrillingly sinful words. Had he meant he wanted her? Might he want more than just stolen kisses?\n Putting a hand on Aidan’s arm, she peeked past him. There were distant shouts and the faraway clopping of the occasional horse, but otherwise they were unseen in their dark corner.\n Looking up at him, she slowly hooked a finger in the front of her bodice. She felt apart from her body, as though she were watching the actions of another woman. This other, sensual Elspeth moved lazily, her eyelids heavy, her wanting smoldering in her gaze.\n She tugged at her bodice, pulling it a little away from her skin, freeing her naked breasts from their tight cocoon of linen. She wasn’t bared to the world, yet cool air kissed her flesh, and a ripple of pleasure skimmed her body, leaving her skin buzzing and hot.\n This sultry Elspeth reached in and grasped the edge of Aidan’s paper. She’d hidden it tucked against her bare flesh, and as she slowly pulled it free, it brushed along her nipple, until every inch of her skin became hotter, tighter, the ache for his touch unbearable.\n Aidan swallowed hard. He adjusted his plaid, and though she was desperate to steal a peek at what she’d felt pressed against her body, she found she wasn’t yet that daring.\n He cleared his throat, asking in a gratifyingly disconcerted voice, “Which of your books taught you how to do that?”\n “That’s from my own imagination.” She gave him a slow sinner’s smile that would’ve made the sauciest of literary heroines proud.\n They froze, the sound of approaching chatter a splash of cold water on them both. Aidan cursed under his breath as a group of men—fresh from the tavern, by the smell of them—wandered into their alley.\n She clamped the paper to her breast, but not before one of them spotted it.\n “Oi, lads! The pretty lady’s goin’ tae read to us.” Drunken laughter echoed in the cramped space.\n Aidan spun, concealing her neatly behind his back, and like a mythical beast from a folktale, he transformed into something larger and infinitely more powerful. He pitched his voice loud and low, and it echoed off the dank stone, shrinking the alleyway into something smaller and more perilous. “If you value your hides, you’ll keep moving.”\n It was the voice he’d have used on board ship. It shocked her, amazed her, took her breath away.\n The men scattered like rats.\n “Come,” he said, speaking once more in the gentle tone reserved for her. “Let’s away from here.” He took the paper, and tucking her hand in the crook of his elbow, he quoted the old adage, “ ‘The day has eyes, but the night has ears,’ and right now we find ourselves somewhere twixt the two. Best to talk as we walk.”\n He guided her from the alleyway, his stride confident, but not so swift as to draw attention. She trembled, her nerves still jangling from unspent lust, still shaken from the sudden appearance of the men, and he pulled her closer to steady her.\n She knew he was leading her home, and her spirits plummeted. It would mean they’d soon have to part.\n With their shared kisses, the dream of one day sharing a home with Aidan had come to life in her breast. But today, she and Aidan would say good-bye instead, and she’d have to face her father and the specter of her betrothal to Fraser.\n She desperately hoped they’d find solid proof that the old merchant wasn’t as reputable as he seemed. Because if they didn’t, her father would insist on proceeding with her wedding. And she had no choice but to do as her father made her—it was the way of the world. If they found nothing to damn Fraser, she’d have no choice but to marry the man.\n “Let’s study this as we walk,” she said quietly. “I’m afraid we won’t have a chance to read it when I reach home.”\n With a tight nod, he navigated out from the shadows, and they traveled in silence till the buildings became sparser, gradually replaced by rolling countryside. When nobody but distant cattle were there to overhear, Aidan unfolded the paper she’d stolen from him.\n WARRANT OF ENTRY\n BRIDGETOWN PORT, BARBADOS\n CAPTAIN WM. DERBY-PHIPPS\n THE ENDEAVOR (ORIG. LEÓN DE ORO)\n TYPE: XEBEC, 160 TONNES BURTHEN, 18 GUNS\n CREW: 95\n GUARANTOR: DOUGAL FRASER, KING’S QUAY, ABERDEEN\n She’d read it a thousand times, but it was just as meaningless to her as it’d been on the first. She mused quietly, “Whatever could it mean that Fraser is in league with a British traitor?”\n He stopped abruptly, and their arms tugged against each other. “You know this man?”\n “Of course I do,” she said, wondering at his intensity. “Who doesn’t?”\n “I don’t.” He spoke through gritted teeth, intense focus in his eyes.\n She put a hand to her heart. He’d spent over half his life out of the country—there was no way he’d have heard the songs, known the tale. “Oh, Aidan, of course you don’t know. Captain William Derby-Phipps was a famous traitor.” She peered into his eyes. “But why do you care? What does the connection mean?”\n “He’s the man who took me. He’s my man with the black pearl.”\n Her heart hammered with excitement. Might they find their proof of Fraser’s dishonesty and Aidan’s revenge on this one sheet of paper? “How can you know?”\n “This.” He pointed to a single word. “This is my proof.”\n Xebec. She stared at the strange, foreign word, perplexed. “Is that a man’s name?”\n “No,” he said, and she could hear the anticipation growing in his voice. “It’s a type of ship. A rare Spanish ship. There’s one currently docked in Aberdeen harbor, and though it sails under a different name”—he pointed to the names, the Endeavor, the León de Oro—“I think it’s the same one that took me.”\n Though loath to interrupt, she had to ask the question on her tongue. “Is it common to change a ship’s name?”\n “Hardly,” he said, with a baffled shake of his head. “He’d have been hard-pressed to change the name. Sailors are quite superstitious about such things. He must’ve had some good reason—avoiding the authorities, evading his enemies.” He gave a brittle laugh. “I imagine he made\n quite a number of enemies in his time.”\n “Like you?”\n “Aye, like me. Because I’m going to kill him.” A deadly calm stole over his face. “Tell me about this Cap-tain Derby-Phipps.”\n She pursed her lips, summoning the old tale to mind. “Derby-Phipps captained an English ship, during the Thirty Years War,” she began. “Sailing alongside a small Dutch fleet, he encountered a sea of Spanish galleons and certain defeat.”\n “And, let me guess, our good captain simply turned tail?”\n “Precisely. Those of his crew he couldn’t convince to turn pirate, he simply killed. But he later stole a Spanish ship and inexplicably delivered the bounty to the British.”\n “Not inexplicable at all,” Aidan said, interrupting her. His eyes danced with an excitement she felt swell in her own breast. “What else to do with so great a prize? The Dutch wouldn’t have touched it, and the Spaniards would’ve killed him. That left bonny old England.” \n","sourceLink":"https://allnovel.net/devil-s-own-clan-macalpin-2/page-35.html","bookId":2657,"book":{"id":2657,"title":"Devil\u0027s Own (Clan MacAlpin #2)","description":"Storyline: \n Devil\u0027s Own (Clan MacAlpin #2) \n After surviving slavery, Aiden MacAlpin has nothing but thoughts of vengeance. When his tutor Elspeth learns a secret to his past, it thrusts them both into a game of passion and deception that neither may survive.\n \n","cover":"https://allnovel.net/images/devil-s-own-clan-macalpin-2.jpg","author":"Veronica Wolff","type":"Historical","source":"allnovel","link":"https://allnovel.net/devil-s-own-clan-macalpin-2.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:52:59 AM"}}
