{"id":41950,"no":41,"title":"Chapter 18 Tewler Defied","content":"EVANGELINE came back from the maternity hospital in the charge of a protective, hygienic nurse with a hard, bright, pink-cheeked face and a naturally hostile and altogether too understanding eye, who seemed to enjoy saying: “You have to keep out of here, Mr Tewler. You can’t come near her for a bit. You can say ‘Good deavning’ from the door if you like. But we must take care of her still. She’s not out of her trouble yet.” A month of enforced chastity passed and was followed by a second month. Master Henry Tewler ceased to look like a flayed monkey in the course of twenty-four hours and began to be attractive. He ceased to squint and produced real brown hair of very great fineness. He lost any personal resemblances and passed into that phase when babies can be freely exchanged and no one the wiser. He fattened under a carefully regimented bottle-feeding, for Evangeline was neither willing nor able to undertake that task. He gurgled and waved his arms about and won a smile from his mother and so became the household darling. “He’s getting artful,” said the proud father. “Think he’s like me, nurse?” “There’s something about the eyes,” the nurse admitted. The nurse went at the end of the second month, and Mrs Butter, who more than anyone else was enslaved by Master Henry, insisted on becoming his nurse and protector. “It might be my own little lost mite come back to me,” she said. A new and slatternly “general” came in by the day to take over the domestic work. Evangeline was up and about again now and cooking very competently. She was taking in the French costumes she had let out, and bringing them up to date with the help of Mode. She went for a walk round the squares, she went for a drive round Hyde Park in a cab, she went with Edward Albert to a cinema. And still there came no evening summons to Edward Albert. What did it mean? He brought matters to a crisis. “You’re looking fine,” he said. “I’m getting better.” “You’re looking just right. I’d like to kiss you. . . . ” She raised her eyebrows. He came to the point. “Ain’t it about time, Evadne; well — we did something?” She had been rehearsing her part in this encounter for some time. But this opening line didn’t fit. “We aren’t going to do something any more,” she said. “But you’re my wife. You got to do your juty by me.” She shook her head. “But you got to.” “All that’s been changed,” she said. “My body belongs to me and I do what I like with it. And as far as all that goes, I’ve done with you for ever, little man. For ever and ever and ever.” “You can’t do that.” “Nous verrons.” “But — You’re mad. You’re flying in the face of the laws of Gord and man. You can’t mean it. No. And what are you going to do? Go without — You can’t stand that any more than I can. Less. Don’t talk rubbish. Why, you’re obliged to.” “Nothing like trying,” she said. “But you’re obliged every way. It’s against the law. I could sue you. There’s such a thing as Restitution of Connubial Rights. I’ve seen it in Lloyd’s News. Only the other day. . . . ” “And what can that do for you, Mr Tewler? Aren’t you having your connubial rights now? Don’t I keep house for you, cook for you, cohabit as they say? But my body is my own, I tell you. My body is my own. Do you think the law can send a couple of policemen in here, to assist you in your — operations — overwhelm me and see that everything goes off satisfactorily? Do you imagine that?” The word “policeman” had given him an Idea. “I’ll — I’ll write to your father. He won’t stand for this?” “It’ll be a lovely letter, Teddy,” she mocked. “Will you show it to me?” “You don’t mean all this,” he said. “This is one of your silly moods. I’ve ‘ad to wait. I suppose I’ll ‘ave to wait a bit more. But I’ve got to know you pretty well by now, my lady. You’ll come round. Don’t keep me too long. I warn you I may be unfaithful to you.” Her face betrayed the obvious repartee she checked unspoken. “Two — ” she began, and stopped short. He stood staring at her, struck by a new and still more detestable thought. “Your body’s your own, you say,” he repeated slowly. “You think you can do what you like with it. What dja mean by that? You tell me exactly what foolishness you got in your mind. You’ve got something behind this. Somebody. . . . ” His face became as ugly as his thought. She shrugged her shoulders and said not a word. “I shall know. I shall find out. I’ll have you watched. . . . . If you think you can get away with that. . . . ” She smiled radiantly, just to infuriate him. But she was aquiver with resolution. “It’s these damned suffragettes. Them and their blasted Vote. Lot of screaming hags. New Woman and all that. Putting these ideers about against all Religion and Decency. . . . Damn ideers! Damn all ideers! Well, now I know where we are,” “Now I know where I am. Eclairs — what is it? — cissement. My fault more than yours, but we’ve got to go through with it now.” “I’ll see you go through with it,” said Edward Albert as grimly as he could. “I’ll get you. Mark my words. I’ll kick you out of here, my lady, into the gutter.” “Kick, Mr Jusqu’au bootist. Kick.” They became aware of Mrs Butter standing in the room and waiting to speak. They were suddenly both ashamed of themselves. “I’m going to bath Baby, Mam,” she said. “He’s perfectly lovely to-night. He’s making a new noise with his little hand to his mouth. Just lovely.” He followed Mrs Butter. Evangeline was disposed to follow and then decided to stare out of the window instead. Now this was a very cardinal moment in the development of Homo Tewler Anglicanus. In this one specimen the type has unfolded, slowly but surely, and here we have it now with all its distinctive qualities displayed. In spite of serious initial disadvantages, Edward Albert had made good. We have traced his education in that peculiar blend of sexual modesty and enterprise that has made the Englishman the world’s lover; we have watched the natural awakening of his imperialism, have seen him become a cricket fan and a broad and intermittent but sincere Churchman; we have pursued his growing craving to become clubable and to get together with fellows in the know; and now here we have dawning that realisation of the extreme evil of “ideers” which more than anything else has made our England what it is today. He became aware of “ideers” all about him, “ideers” of every sort, like a storm of hornets; ologies and isms beyond counting. You daren’t open a book or magazine now on account of them. Not that he did open books if he could help it, but Evangeline had taken to reading the queerest stuff, and he sometimes saw the titles or the List of Contents. New Women indeed! All his life henceforth, he realised, must be a fight against this malignant devastation of his complacency. They came in a multitude of forms and under a great variety of names, Feminism, Socialism (confiscate your mortgages and have wives in common and then where would you be?), Marxism, Communism (the same only worse), Collectivism, Pacificism, Internationalism, Scepticism, Atheism, Darwinism, Nationalisation, Vegetarianism, Trade unionism, Biology, Sociology, Ethnology, Archaeology, Einstein, Bernard Shaw, Birth Control, Modernism, all that stuff; stuff you never heard of before, got up mostly by International Jews and long-haired highbrows of the utmost perversity, suggesting this, suggesting that, destroying your beliefs, making the working classes discontented, threatening your financial security, seducing women from the path of virtue and submission. Once he was aware of it, this buzzing of minds never seemed to cease. A hornet’s nest of Free Thinking and liberal thought called aloud for extirpation. “Christian dost thou hear them On the Holy Ground, How the hosts of Midian Buzz and buzz around? Christian up and smite them —” He snorted at them; he flapped his hate at them. The best way of dealing with any of them was to shout the word “Bawls” at them in a loud, crushing, masterful voice. If you got together with other fellows of the same mind and shouted “Bawls” in unison, it could be extremely reassuring. It seemed to drown the buzzing altogether. The battle of the Bawling and the Buzzing was surely over. . . . Then it began again.","sourceLink":"http://novel.tingroom.com/jingdian/1483/44419.html","bookId":1355,"book":{"id":1355,"title":"You can\u0027t be too careful","description":"简介： 暂无文本介绍...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1483","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
