{"id":41959,"no":50,"title":"Chapter 4 Heroic Moment","content":"INCH by inch Edward Albert was sucked nearer and nearer towards the vortex of this ever more frightful war. He who had always dressed so carefully, became a jumble of garbage crouching on the links, a flattened Jack on the Green. . . . If you had told him late in 1940, that in a year’s time he would be an invisible man crawling through the midst of a raid to some position of comparative personal security, with a deafening anti-aircraft barrage beating the wits out of him, and flares and parachutists and a number of gigantic troop carriers raining down upon him, he would probably have contrived some minor mutilation that would have absolved him from any active participation in that sort of thing A vague self-reproach floundered through the thudding and jumping in his brain. “Bloody fool I been,” he muttered. u Never saw a thing ahead.” That was his state of mind, within ten minutes of the moment that transfigured him into a national hero. What happened was very simple. Tucked up at last under a bunker, Edward Albert felt secure from anything but a direct hit. There he could abide the issue, prepared to emerge either for surrender or the cheering when comparative quiet was restored. And then he became aware of men crawling discreetly up the other side of the bunker. He screwed his head round to look at them and perceived a gleam of bayonets. There were at least three of them. The heads whispered and waited for an interval. Then one of these shadowy men fired a shot at something ahead and a second jumped down within a yard of Edward Albert and pointed. They began to talk very rapidly — in Polish. But to Edward Albert, Polish and German were all one. The next man might tread on him and he’d be bayonetted for a certainty. They’d all stick their bayonets into him. With a wild yell he leapt to his feet and ran. They shouted something and ran after him. And right ahead he saw a group of dark figures struggling with parachutes and encumbrances. And they too were shouting German! Germans behind him, Germans before him, and no quarter! I have told my story badly if I have given you the impression that Edward Albert was an abject coward. Probably no human being who is properly nourished is that. Young children are easily terrified, but I am speaking of adults. I have shown you a human being growing up in a debasing and discouraging social atmosphere, so that he was not so much born mean as had had meanness thrust upon him. All Edward Albert’s story, like the true story of every human being, is a story of resentments and rebellions, cramped and limited though they were. You have seen how he broke through his discretions and astonished Horry Budd. You have seen him astonishing the female of his species. Now, cornered as he imagined himself to be and hopeless, he broke through his cowering “instinct of self-preservation”, as they call it, altogether, and revealed himself a thing of frantic violence. His yell became a yell of despair and hatred. He leapt upon his fate. His green face and fluttering scraps of garbage bounding out of the night amidst the concussions of the battle must have had a nightmare effect upon those fumbling and uncertain young Nazis. He whirled his rifle round his head, smiting these dismayed and entangled men to the earth, beating them down, heedless of their belated cries of “Kamerad!” He had killed four men and disabled seven others before the three Poles who had been running after him came up to complete his victory. “While we were waiting for supports to come up,” they testified, “he leapt out of the ground at our feet, shouted to us to follow him, and rushed the position the enemy detachment was trying to consolidate. . . . ” It became apparent to Edward Albert that he was having his hand shaken by a Polish officer who spoke some English. The climax of the uproar within his brain and without, was past. Slowly but surely the realisation of what he had done dawned upon him. He rearranged the facts with the same readiness with which he had accepted his triumph in the annual cricket match. The sunrise revealed the complete failure of the German attempt to test the strength of the Brighthampton coast defences. They had established no foothold. The mopping-up was over and there had been remarkably few casualties among the defenders. Mostly these had occurred among the exposed gunners on the beach beyond Casing East Cliff. A minimised account of the whole affair — lest panic be created — was released in the one o’clock bulletin. And Edward Albert, his heroism further developed by a liberal experience of Polish vodka, returned, weary, excessively dirty, drunk and triumphant to his home. Mr Droop and the pavement designer had preceded him. They had reported that he had been in the thick of the fighting with some Poles and Canadians, but he had not been hurt, they had seen him afterwards drinking at the Polish canteen, and so Mary and the whole of battle-scarred Morningside (for there were scores of broken windows) were out to receive him, He was not singing, but if you had seen him on a silent film you would have thought he was singing. There was song in his gestures. He looked less like the seemly, almost punctiliously dressed golfer for whom she did her wifely duty than an intoxicated piece of hedge. As he drew near her, and the neighbours closed in around him, he uttered these words. “We mopped ’em up,” he said. “Taint all you’ve mopped up,” said Mrs Tewler, “Them Poles are so’jers and gent’men. Gent’men, mind you. They’re the boys! Nat’lly I had to have a drop with them. This vodka. . . . Cleanest drink I ever ‘ad. . . . ” “Tell us all about it,” said Mr Pildington. “Not till he’s had a wash and a rest,” said Mrs Tewler. “He’s fairly done up.” “I’m fairly done up,” said this staggering mass of garbage, leaning heavily upon her. She guided him home, “I’m so glad they didn’t hurt him,” she said. “He hasn’t got a scratch.” As she mothered him through his bath and into his bed, he was partly asleep and partly meditative on his own astonishing exploits. “I let ’em have it — right and left. . . . “Get out of England, I says, you come to the wrong place . . . “Just me with these Jerries — they don’t know ‘ow to fight Gaw knows what they thought they were doing —“Kamerad, he says, Kamerad! One chap I ‘it. Fat lot of Kamerad ‘e got out of me. . . . ” In the course of twenty-four hours Edward Albert reappeared in the world of men clean and in his right uniform, as anxious as anyone to learn the particulars of the great fight he had been in. His camouflage suit had been injured beyond repair, and his wife was reconstructing it. Stephen Crane, when he wrote his Red Badge of Courage, found that what he got from the ordinary veteran of the American Civil War, was what the man had read about his battles in the newspapers. That had served to rationalise and give phrases for his own fierce jumble of memories. Edward Albert was in an exactly parallel state of mind. His reconstruction of his story was greatly facilitated by the romantic generosity of the gallant Polish officer, only too anxious to give an Englishman credit for leadership in the little affair, and only too eager to elaborate the story with all and sundry, over a glass or so of vodka. In spite of the Ministry of Information, a rumour that a real Cretan air landing had been repulsed at Brighthampton spread to London. About ten days later a “postcript” upon the London wireless told the Polish officer’s version of the story, suppressing all names and dates, and the incident was cabled in appreciative terms to America, to illustrate the invincible spirit of the ordinary unpretending Englishman. Edward Albert began to realise where he stood now in the world’s esteem. He was the ordinary unpretending Englishman, who had to be stung to show his mettle; and then it was he thought of his chosen epitaph, “Deeds not Words .” Only in one quarter did he feel the chill breath of scepticism and that was where a happy husband might least expect it. She listened; she asked no questions; but she made him fed unreal even to himself. So that when at last the people up there decided to mark their appreciation of the Brighthampton incident by a temperate distribution of honours, and the George’s Cross fell to Edward Albert, it was Mary to whom he hurried first. “I don’t deserve it,” he said “Don’t deserve what?” “I only did what any Englishman would have done.” She waited patiently. “It’s really meant for the whole platoon of us. It’s what I have to wear for all of them.” “You can’t wear it until it’s dry.” “Wear what?” “That camouflage.” “I wasn’t talking of that. No. Mary! They’re going to give me the George’s Cross, The George’s Cross for courage. Aren’t you glad?” “If it’s a pleasure to you, Teddy.” “But it’s wonderful, Mary! Don’t you see how wonderful it is?” “It’s wonderful. Yes. . . . There’s no telling what they won’t do next,” said Mary.","sourceLink":"http://novel.tingroom.com/jingdian/1483/44428.html","bookId":1355,"book":{"id":1355,"title":"You can\u0027t be too careful","description":"简介： 暂无文本介绍...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1483","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
