{"id":41960,"no":51,"title":"Chapter 5 The End of Homestead","content":"MRS TEWLER, for reasons that she never made clear, refused to go up to Buckingham Palace and see her husband decorated by the King. “It isn’t anything I did,” she said “All I did was to camouflage your clothes and hope you wouldn’t get into trouble. I shouldn’t know what to do or where to look up there. I suppose we should be pushed about by a lot of dressed-up officials in uniforms and orders and stars and stared at by Princes and Court Ladies watching us like animals, watching to see how we took it. There’ll be the King wearing his crown and the Queen wearing hers, and I’d be so worked up that if either of their crowns got a bit cock-eyed I’d have hysterics. You don’t want your wife to have hysterics, do you, Teddy? I’m afraid of that. And I’m afraid of those other women we shall meet, all those poor souls, widows who’ve lost their men and mothers who’ve lost their sons, being made a show of, and us — just glorying. I couldn’t look them other women in the face. No. It would be indecent of us, Teddy, King or no King. . . . ” \n \n It crept into Edward Albert’s mind, almost for the first time in his married life, that perhaps Mary had “ideers.” But he dismissed the horrid thought forthwith. No. Mary was shy. She was not sure of herself and she saw the whole business in the wrong colours. It was going to be much more like shaking hands. She had to be reassured and laughed out of these notions. So he began by being instructive and persuasive, and it was only as her inflexible firmness gave no sign of yielding to his urgency that he passed on to deep offence. \n \n “Oh, what’s the good of argument?” he cried. “I understand. Don’t I understand! Whatever I was or whatever I did, I don’t believe you’d take a pride in me.” \n \n But Mrs Tewler was a wise woman and she preferred an inexpressive silence to repartee. \n \n She spoke again presently. “I couldn’t get any sort of proper dress made in time, and you’d be the last person to have me go shabby. With all them photographers about, not to mention their Majesties.” \n \n “I’ve never grudged your dress allowance,” said Edward Albert. “Now have I? And mostly you’ve spent it getting treats for that boy.” \n \n “It’s my fault,” said Mrs Tewler. “But that won’t make dresses now. It’s all been so sudden.” \n \n “Can’t you do something? It’s for you I want to go morn’ myself. Shabby or not shabby; I’d like to say, ‘This is the woman I owe everything to, bar my mother. She’s made me what I am today. I’d tell my story to the interviewer chaps. Love Story of a ‘Ero. They’d take your portrait and put it in all the papers. One on the eye for Mrs Evangeline, eh? She’s bound to see it somewhere. I been thinking of that all along.” \n \n Even that triumph did not allure Mary. \n \n “No, you don’t mean to come,” he said at last at a climax of exasperation. “You don’t mean to come and you won’t. D’rectly I answer one objection, you make another. You can be as obstinate as a mule, Mary, as obstinate and unreasonable. You don’t seem to realise what all this means to me. You don’t care. I did all this for you — I said to myself, whatever danger there is, whatever happens I won’t let Mary down. And then — you let me down. All the other fellows will be there with their loved ones about them. People will say ‘Oo’s this fellow? Lonely bachelor? Oh no, he’s got a wife but she didn’t care to come.’ Didn’t care to come! Think of it. Think of the disloyalty. Royal command it is practically. ‘Yes, Your Majesty, I got a wife but she didn’t care to come!’” \n \n Mrs Tewler might have been listening to a dramatic rehearsal. \n \n “You’ll get over it, Teddy,” she said, after his last poignant phrase. “You’d better let me pack your bag for you. I’ll put up your shaving things, but you’d better get a shave in the hotel in the morning. You might cut yourself in your excitement. . . . ” \n \n So he went to London alone and indignant. The morning paper said that enemy activity over this country for the previous night had been inconsiderable. A few bombs had been dropped and there had been a certain destruction of house property and a casualty or so in one south coast town. Nothing much. But the house property in question was Homestead, and the chief casualties were Mary Tewler, one of her cats and the general servant next door. Mr Pildington of Johore had been blown off his feet and was suffering from contusions, and Caxton was badly damaged. \n \n Mary Tewler recovered consciousness in the afternoon. She said she wanted to see her son. She did not know precisely where he was, but she thought his battalion was in Wales. She gave all the particulars. \n \n “We’ll trace him, my dear,” said the sister in charge. \n \n “They do that sort of thing now wonderfully. “But — your husband, Mrs Tewler?” \n \n “Not so urgent. Plenty of time for that. He’s in London. He’s being decorated by the King,” she said. “Don’t spoil it for him by upsetting him. There’s plenty of time. It won’t matter for a day or so. I just feel numb you know. And tired.” \n \n The sister in charge became a person of infinite delicacy. \n \n “I think your husband ought to be told now.” \n \n “You mean I’m worse than I think?” \n \n “No need to deceive a brave woman like you. We’re doing all we can for you,” \n \n Mary shut her eyes and thought. Then she spoke. \n \n “Telegram?” \n \n “Yes.” \n \n “If I could see it —” \n \n On these conditions she gave the name of the Palace Hotel at Victoria. \n \n The telegram Edward Albert received informed him that his wife, very gravely injured by enemy action, was in Brighthampton Emergency Hospital. Mary had proposed to omit “very”, but the request was tactfully forgotten. \n \n “Gaw!” said Edward Albert. “It’s like a Judgment. If only she’d have listened to reason! If only! If only. . . . ” \n \n Then for a time he sat quite still. “Mary,” he whispered. Something quivered within him, a deeper distress for which his habits of mind gave him no form of expression. \n \n “Maybe it’s not so bad.” One mustn’t give way to “ideers” in war time. “They don’t take risks,” he reflected. \n \n He sent his telegram after a meditative tea. “Must be at Palace, special command of His Majesty, tomorrow as arranged. Will be with you before six. Teddy.” \n \n But just before his supreme moment, that deeper stir within him, that undeveloped possibility of feeling, overwhelmed him again, and he sobbed. Of course she ought to have been here. He was astonished at his sob. . . . \n \n At the hospital they told him Mary was dying, and even then the reality did not seem to be real. \n \n “Is she hurting?” he said. \n \n “She’s numb. Her body is paralysed.” \n \n “That’s good,” he said. \n \n He found his son had preceded him at the hospital. \n \n “He wanted to sit with her to the end but I thought better not,” said the sister in charge. “It’s an effort for her to speak. She’s troubled in her mind about something.” \n \n “Has she been asking for me?” \n \n “She wants to see you very much. She’s asked three times.” \n \n That again distressed him inexpressibly. Somehow he ought to have been there. \n \n “We had a sort of little difference,” said Edward Albert, trying to put unspeakable things into words. “Nothing reely — just a tiff you might say. I expect now she’s sorry she didn’t come and she wants to hear all about it.” (Sob). \n \n “She must want to hear all about it. If only she’d come,. . . . ” \n \n But that was not what was worrying Mary. \n \n Their conversation was at cross-purposes, \n \n “Promise me something,” she said unheeded. \n \n “It was wonderful, Mary,” said Edward Albert. “Wonderful. Not a bit pompous. Not a bit high and mighty.” \n \n “He’s your son.” \n \n “Royal and democratic. Marvellous.” \n \n “Don’t let anyone set you against him, Teddy. Don’t do that,” said the fading voice. \n \n He did not hear what she was saying, for the glorious story he had prepared filled his mind. \n \n He expatiated on the approach to Buckingham Palace; the crowd; the polite way in which he was picked out and asked in; how there were fellows taking snapshots and some cheering. \n \n “Promise me,” she murmured. “Promise me.” They were her last words. \n \n “The King was there and the Queen. Naturally. Such a nice young unaffected feller. No crowns for him. And her with that sort of jollying smile of hers. Nothing stuck — up about her. Oh! I wish you could have been there and seen how. different it was from what you supposed. It might have been a tea party rather than a court ceremony. And yet all the time a sort of dignity. You felt, here is something that will go on, the heart of a great empire like . . . All the time I was thinking of you and how I’d come back and tell you everything. But I wish you could have been there to see. Yes, yes. If you’d been there. \n \n “I ‘urried down to show it to you. And here it is, Mary. Here it is. . . . ” \n \n For a few seconds she stared at her husband’s evident self-satisfaction as though it was something strange to her and then as steadfastly at the cross in his hand. She made no further effort to speak. Slowly her interest faded. She closed her eyes like a tired child. She closed them on him and on this clumsy stupid world for ever. . . . \n \n Presently the sister put a hand on his arm, \n \n “She was such a wife to me.” said Edward Albert, sobbing freely. “What I shall do without her I don’t know.” \n \n Sob, “Oh! I reely don’t know. I’m glad I was able to show her this. I am glad of that. . . . It ain’t much. It’s something; isn’t it?. . . . Something to show her. . . . ” \n \n The nurse let him have his cry out. \n \n He found his son in a mood of lethargic misery in the corridor. He had travelled all night for a last glimpse of her. “She’s gone, my boy,” said Edward Albert. “Our Mary. I was just able to show it to her before she closed her eyes.” \n \n “Show what to her?” asked Henry. \n \n Edward Albert held out the decoration. \n \n “Oh! that,” said Henry, and lapsed into himself again. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1483/44429.html","bookId":1355,"book":{"id":1355,"title":"You can\u0027t be too careful","description":"简介： 暂无文本介绍...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1483","creation":"Aug 1, 2019 12:24:54 AM","modification":"Aug 1, 2019 12:24:54 AM"}}
