{"id":17807,"no":1,"title":"BOOK I THREE AGAINST THE WORLD THE THREE FURLONGERS CHAPTER I SPARROW HALL","content":"The twilight was dropping over the fields of three counties—Surrey, Kent and Sussex—all touching in the woods round Sparrow Hall. In the sky above and in the fields below lights were creeping out one by one. The Great Wain lit up over Cansiron, just as the farmer\u0027s wife set the lamp in the window of Anstiel, and the lights of Dorman\u0027s Land were like a reflection of the Pleiades above them. Janet Furlonger sat waiting in the kitchen of Sparrow Hall—now and then springing up to lift the lid off the pot and smell the brown soup, or to put her face to the window-pane and watch the creeping night, seen dimly through the thick green glass and the mists that steamed up from the fields of Wilderwick. Janet was immensely tall, and her movements were grand and free. In rest she had a kind of statuesque dignity: she did not stoop, as if ashamed of her height, but held herself proudly, with lifted chin. People used to say that she walked as if she were showing off beautiful clothes. This was meant to be a joke, for Janet\u0027s clothes were terrible—old,[Pg 10] and badly made. Hats, collars and waist-bands she evidently thought superfluous; it was also fairly obvious that she dispensed with stays—which caused scandal, not because her figure was bad, but because it was too good. Wind, sun and rain had tinted her face to a delicate wood-nut brown, through which the red glowed timidly, like the flush on a spring catkin. Footsteps sounded on the frosty road, drawing steadily nearer. The next minute the gate clicked. Janet started to her feet, flung open the kitchen door, and ran out into the garden, between rows of chrysanthemums still faintly sweet. Two men were coming up the path, and with outstretched arms she rushed to one of them. \"Nigel!—old man!\" He did not speak, but folded her to him, bending his face to hers. It was too dark for them to see each other distinctly. All that was clear was the outline of the roof and chimney against the still tremulous west. Janet pulled him softly up the path, into the doorway, where it was darker still. She put up her hands to his face and gently felt the outlines of his features. Then she began to laugh. \"What a fool I am! Didn\u0027t I say I wasn\u0027t going to have any silly sentimentality?—and here I am, simply wallowing in it. Come into the kitchen, young men, and see what I\u0027ve got for the satisfaction of your gross appetites.\" They followed her into the kitchen, and she turned round and looked at them both. They were very different. The elder brother, Leonard, was like[Pg 11] Janet—dark both of hair and eye, with a healthy red under his tan. The younger\u0027s hair was between brown and auburn, and his eyes were large and blue and innocent like a child\u0027s. His mouth was not like a child\u0027s—indeed, there was a peculiar look of age in its drooping corners, and his teeth flashed suddenly, almost vindictively, when he spoke; it was lucky that they were so white and even, for he showed them with every movement of his lips—two fierce, shining rows. \"You\u0027re late,\" said Janet. \"No, don\u0027t look at the clock, unless you\u0027ve remembered how to do the old sum. It\u0027s really something after nine, and the train is supposed to get in at half-past seven.\" \"Yes—but I got hung up at Grinstead station, playing guardian angel to a kid.\" \"Let\u0027s hope the kid didn\u0027t ask to see your wings,\" said Leonard. \"Was it a girl-kid or a boy-kid?\" \"A girl-kid. There were five of \u0027em in my carriage. They\u0027d been sent home from school for some reason or other, and this one evidently hadn\u0027t let her people know, for when she got out at East Grinstead there was no one to meet her. All the station cabs had been snapped up, and some loathly bounder got hold of her—goodness knows what would have happened if I hadn\u0027t turned up and managed to scatter him. I got her a taxi from the Dorset, and sent her off in it to Shovelstrode.\" \"Shovelstrode!—then she must be old Strife\u0027s daughter. What age was she?\" \"I should put her down at sixteen, but very innocent.\" \"Pretty?\" [Pg 12] \"Ye—es.\" \"Nigel, my boy, you haven\u0027t let the grass grow under your feet.\" \"Idiot!—we never exchanged a word except in the way of business. She wanted to know my name, but I took care to say Smith. There was nothing exciting about it at all—only an infernal loss of time.\" \"Quite so. You didn\u0027t find me in a particularly good temper when you turned up at Hackenden.\" \"The first words that passed between us were—\u0027Is that you, you ass?\u0027 and \u0027Yes, you fool.\u0027 We haven\u0027t done the thing properly at all—we\u0027ve forgotten to fall on each other\u0027s necks.\" \"Let\u0027s do it now,\" said Len, and the two boys collapsed into a mock embrace, in the grips of which they staggered up and down the kitchen, knocking over several chairs. \"Oh, stop, you duffers!\" shouted Janet; but she was laughing. \"Nigel hasn\u0027t changed a bit,\" she said to herself. \"What have they been doing to your clothes?\" asked Leonard, as his brother finally hurled him off. \"They stink, lad, they stink.\" \"They\u0027ve been fumigated,\" said Nigel. \"I\u0027ve worn off some of the reek in the train, but to-morrow Janey shall peg \u0027em out to air.\" \"We\u0027ll hang \u0027em across the road from the orchard. Lord! won\u0027t the Wilderwick freaks sit up!\" \"It\u0027ll take ages to get that smell out,\" said Janet ruefully, \"and your hair, too, Nigel—when\u0027ll that look decent again?\" [Pg 13] \"I say, stop your personal remarks, you two—and give me something to eat. I\u0027m all one aching void.\" Janet took the soup off the fire, and slopped it into three blue bowls. Nigel went round the table, setting straight the spoons and forks, which Janey seemed to have flung on from a distance. \"What\u0027s that for?\" she asked. The young man started, then flushed slightly. \"Hullo! I didn\u0027t notice what I was doing. I always had to do that in prison.\" \"Put things straight?—what a good idea!\" \"Yes. Everything had to be straight—in rows. Ugh!\" For the first time he looked self-conscious. \"Well, it\u0027s a very good habit to have got into. You may be quite useful now.\" \"I\u0027m damned if I\u0027d have done it,\" said Leonard. \"You had to do it,\" said Nigel; \"if you didn\u0027t ...\" and a shudder passed over him. \"What?\" asked his brother and sister with interest. He flushed more deeply, and the muscles of his face quivered. Then a surprising, terrible thing happened—so surprising and so terrible that Leonard and Janey could only stand and gape. Nigel hid his face in his hands, and began to cry. For some moments they stared at him with blank, horror-stricken eyes. Scarcely a minute ago he had been uproarious—forgetting pain and shame in the substantial ecstasies of reunion, smothering—after the Furlonger habit—all memories of[Pg 14] anguish in a joke. Never since his earliest manhood had they seen him cry, not even on the day they had said good-bye to him for so long. Now he was crying miserably, weakly, hopelessly—crying quietly like a child, his hands covering his eyes, his shoulders shaking a little. Then suddenly he gasped, almost whimpered— \"Don\u0027t ask me those questions. Don\u0027t ask me any more questions.\" \"Nigel,\" cried Janet, finding her tongue at last, \"I\u0027m so sorry. I didn\u0027t know you minded. Please don\u0027t cry any more—it hurts us.\" \"We didn\u0027t mean anything, old man,\" said Leonard huskily. \"Do cheer up, and forget all about it.\" Nigel took away his hands from his eyes, and Len and Janey glanced quickly at each other. They had expected to see his face swollen and disfigured, but except for a slight redness round the eyes it was quite unchanged. They both knew that it is only the faces of those who cry continually which are so little altered by tears. For a moment they could not speak. A chill seemed to have dropped on Sparrow Hall, and all three heard the moaning of the wind—as it swept up to the windows, rattled them, then seemed to hurry away, sighing over the fields. \"Come, drink your soup, old chap,\" said Janet, pulling up his chair to the table. \"Write me down an ass, a tactless ass,\" she growled to herself; \"but how could I know he would take on that way?\" Nigel obediently began to swallow the soup,[Pg 15] while Len and Janey talked across him with laboured airiness about the weather. After the soup came bacon and eggs, and potatoes cooked in their skins. Nigel\u0027s spirits began to rise—he seemed childishly delighted with the food, though Janet\u0027s cooking was sketchy in the extreme. When the meal was over, he joined in the washing up, which was done at a sink in the corner of the kitchen. \"What sort of people are the Lowes?\" he asked suddenly, polishing a fork with a vigour and thoroughness which made Leonard and Janey tremble lest he should realise what he was doing. \"What sort of people are the Lowes?\" Janet flushed. \"Oh, they\u0027re quite ordinary,\" said Leonard, \"quite ordinarily unpleasant, I mean. The old chap\u0027s narrow and pious, like most devil-dodgers, and the young \u0027un\u0027s like an ape.\" \"And they\u0027ve got all the Kent land?\" \"Oh, it\u0027s nothing to speak of. You know that end was always too low for wheat\"—poor Len was in a panic lest his brother should begin to cry again. But, strangely enough, Nigel was able to discuss the fallen fortunes of Sparrow Hall with even less emotion than Len and Janey. The tides of his grief seemed to find their way into small streams only. It was about the side-issues of their tragedy that he asked most questions. Was Leonard still going to have a man to help him, now his brother had returned?—Was any profit likely to be made in their reduced circumstances?—Was there any[Pg 16] chance of buying back what they had sold to Lowe? \"We shall have to go quietly,\" said Len, \"but I don\u0027t see why we shouldn\u0027t pull through if we\u0027re careful. I\u0027ve given Boorman a week\u0027s notice. He can bump round here till it\u0027s up, and lend you a hand now and then—I don\u0027t suppose you\u0027ll tumble into things just at first.\" Nigel suddenly turned away. \"I\u0027m going out—to have a look round the place.\" \"Now!\" \"Yes—it\u0027s a beautiful clear night.\" Janet and Leonard moved towards the door. \"I\u0027m going alone,\" said Nigel shortly. Janet and Leonard stood still. They stared at each other, at first with surprise, then a little forlornly, while their brother pulled on his overcoat, and went out of the room. Never, since they could remember, had one of the Furlongers preferred to be without the others. It was past midnight, and Janet was not yet asleep. She lay in bed, with a lighted candle beside her, her hair tumbled over the pillow and over her body, her neck gleaming through the heavy strands. Her room was full of warm splashes of colour. The bedspread and carpet, though faded, glowed with sudden reds and gentle browns—faded red roses were on the wall. The window was low, so that when she turned on the pillow she could look straight out of it at a huddled mass of woods. It[Pg 17] was uncurtained, and the stars flashed through the thick panes. There was a knock at the door. \"Come in\"—and Nigel came in softly. \"Hullo, old man.\" \"I want to speak to you, Janey.\" \"And I want to speak to you. Come and sit on the bed.\" \"I—I want to say I\u0027m sorry I cried this evening.\" \"Oh, don\u0027t!\" gasped Janet. \"It\u0027s a habit one gets into in prison—crying about little things. Prison is made up of little things and crying about \u0027em—that\u0027s why it\u0027s so hellish.\" Her hand groped on the coverlet for his. \"I expect I\u0027ll get out of it—crying, I mean—now I\u0027m back.\" \"Don\u0027t let it worry you, old boy—we\u0027re pals, you and Len and I. But—but—don\u0027t you really like us talking to you about prison?\" He lifted his head quickly. \"It all depends.\" \"You see, there you were ragging and laughing about your clothes and your hair and all that. So how was I to know you\u0027d mind——\" \"But it\u0027s different. Oh, I don\u0027t suppose you\u0027ll understand—but it\u0027s different. Having one\u0027s clothes fumigated and one\u0027s hair cut short is a joke—it\u0027s funny, it\u0027s a joke, so I laughed. But being obliged to have everything exactly straight—every damned fork in its damned place——\" he stopped suddenly and ground his teeth. \"It\u0027s the[Pg 18] little things that are so infernal and degrading; big things one has to make oneself big to tackle, somehow, and it helps. But the little things ... one just cries. Listen, Janey. Once a fortnight they used to come and search us in our cells. We used to stand there just in our vests and drawers, and they\u0027d pass their hands over us. Well, I could stand that, for it was horrible—sickening and monstrous and horrible. But when you were punished just because your tins weren\u0027t in the exact mathematical space allotted to them—it wasn\u0027t horrible or monstrous at all, just childish and silly; and when a dozen childish and silly things crowd into your day, why, you become childish and silly yourself, that\u0027s all. What I can\u0027t forgive prison isn\u0027t that it\u0027s made me hard or wicked or wretched, but that it\u0027s made me childish and silly—so if I deserved hanging when I went in, I\u0027m hardly worth spanking now I\u0027ve come out.\" \"What I can\u0027t forgive prison is the miserable ideas you\u0027ve picked up in it.\" \"There aren\u0027t any ideas in prison—only habits.\" He hid his face for a minute in the coverlet. Janet\u0027s hand crept over his hair. \"You\u0027ll soon be happy again, old boy,\" she whispered. \"Perhaps I shall.\" \"I hope to God you will—and now, dear, it\u0027s dreadfully late, and you\u0027re tired. Hadn\u0027t you better go to bed?\" He turned to her impulsively. \"You\u0027ll stick to me, you and Len?—whatever[Pg 19] I\u0027m like—even—even if I\u0027m not quite the same as I used to be.\" Strange to say, her impression of him was of an infinite childishness. She realised with a pang that while for the last three years she and Leonard had been growing older in their contact with a world of love and sorrow, this boy, in spite of all he had suffered, had merely been shut up with a few rules and habits. In many ways he was younger than when he first went to gaol, more ignorant and more childish—he had lost his grip of life. In other ways he was terribly, horribly older. She put her arms around his neck, and kissed this pathetic old child, this poor childish old man.","sourceLink":"http://novel.tingroom.com/jingdian/1936/55521.html","bookId":772,"book":{"id":772,"title":"The Three Furlongers","description":"简介： The twilight was dropping over the fields of three countiesSurrey, Kent and Sussexall touching in the woods round Sparrow Hall. In the sky above and in the fields below lights were creeping out one by one. The Great Wain lit up over Cansiron, just as...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1936","creation":"Aug 1, 2019 12:19:17 AM","modification":"Aug 1, 2019 12:19:17 AM"}}
