{"id":17831,"no":25,"title":"CHAPTER X A TOAST","content":"A few faint stars were in the west as Nigel tramped towards it. They seemed to swim up out of the eddies of crimson fog that floated there—they seemed to be showing little candles of hope to the man who turned his back on the east. The castle of the dayspring lay behind him, swallowed in thundery murk, but before him were the lights of a broader palace where dead hopes and dead hatreds keep state together. \n \n The west glowed and trembled and purpled—fiery rays rested on the woods, and reached over the sky to the moon. Then against the purple showed a tall chimney, rising from a high-roofed cottage that squatted in the fields of Wilderwick. \n \n As Nigel walked down the hill towards Sparrow Hall, a great quickening realisation struck his exhausted heart. He knew that his dream was not dead. Tony, the light in which he had seen it, was gone for ever, but the dream itself was still there in the dark. For six months he had tried to lead a good and honourable life, and now, though the motive was gone, the old desire remained as strong and white as ever. He could never be as he had been before he met Tony. He knew now that it was not she that had called him—she had merely opened his ears to a voice that had been calling him all through his life, through struggle, lust and pain, failure and hate—and was calling[Pg 301] him still, through the utter darkness. The child in him, which had desperately sought congenial comradeship in a little girl, rose out of the wreck, and heard as in a dream the voices of boys and girls in London, laughing, fooling and ragging together, calling to all in him that was gay and young and outrageous. He wanted to go back to London, he wanted to play and to work, and to win for himself what he had once yearned to win for Tony. His music, that one touch of the poetic and supernatural in his sordid, materialistic life, would raise him up in this his Last Day, and give him his heart\u0027s desire—his desire for a clean life and an honourable name. \n \n He stood for a moment in the great lonely field—the last of the sun and the first of the moon upon him, around him the dawning eternity of the stars. Two hours ago he had been festering, sick, with his schemes, the comrade of a hundred repulsive ideas. Now he was alone—utterly alone with his one great ambition, stripped of the last rag of personal motive that had clung to it—his ambition to be honest and pure and true. \n \n Tony had pointed him out the way, and directly he had taken it, she had gone—to show it to another man, and walk in it with him. Nigel suddenly pictured that man. He was at Redpale Farm ... he kneeled in the dust at Tony\u0027s feet ... her hands were upon his head. In her he found redemption, love and blessing—and dared he, Furlonger, grudge redemption, love and blessing to any man? He did not grudge them—let Quentin Lowe take them, walk in white with Tony,[Pg 302] and be worthy of her. Furlonger, too, would walk in white and be worthy—but he would walk alone. \n \n No, not quite alone. He trod softly up the path to Sparrow Hall, between the ranks of the folded flowers. The evening primroses and night-scented stock sent their fragrance in with him at the door. The house was in darkness, and he groped his way to the kitchen, where he found Janey. \n \n She was half asleep in the armchair by the fire—she had laid the supper, that dreary little supper for two, and now lay huddled by the dying embers, cold, in spite of the thick heat of the night. \n \n \"Janey,\" whispered Nigel, as he kissed her. \n \n She started. \n \n \"Oh, you\u0027re back at last!—what a time you\u0027ve been!\" \n \n \"I\u0027m sorry, dear. Come now, I\u0027ll light the lamp, and we\u0027ll have supper.\" \n \n She rose listlessly, and sat down opposite him. \n \n \"It\u0027s a rotten supper—I don\u0027t cook so well as Novice Unity Agnes.\" \n \n \"Nonsense! you cook quite well enough for me. Janey—will you come and cook for me in London?\" \n \n \"In London?\"—she stared at him blankly. \n \n \"Yes, I must go back to my work—and I can\u0027t leave you here.\" \n \n \"But—but—I don\u0027t understand—and what shall we do about the farm?\" \n \n \"We can sell it, and the money will keep us—just the two of us in a workman\u0027s flat—till my training is over, and I\u0027m earning money on my[Pg 303] own. Oh, Janey, I don\u0027t suppose I\u0027ll ever be rich or famous or that I\u0027ll fill the Albert Hall—but I—I shall be more worthy of you, dear.\" \n \n \"Of me!\"—she laughed. \n \n \"Yes. Don\u0027t you understand? I\u0027ve got my dream back again—but there\u0027s an empty place in it.... Will you fill it, Janey?\" \n \n She looked questioningly at him with her great haggard eyes. \n \n \"Who left it empty?\" \n \n \"Tony Strife,\" he said in a low voice. \n \n \"Nigel!...\" \n \n She rose to her feet and came to him. \n \n \"My poor, poor boy.\" \n \n Her pity, the first he had received, had an unexpected effect on him. It nearly unmanned him—he put up his hands to her neck, and drew down her face to him, while his body shuddered. \n \n \"Nigel ... did she know?\" \n \n \"No, never—thank God!\" \n \n She stroked his hair, and held his head against her breast. \n \n \"It was a hopeless dream, Janey.\" \n \n She could not contradict him. \n \n \"But it helped me.\" \n \n \"Then it was a good dream.\" \n \n He gently slipped himself free. \n \n \"And now we\u0027ll say no more about it.\" \n \n After supper Janey asked Nigel to play to her. He often used to play to her in the evenings, to relieve the aching weight of agony that gathered on her with the dusk. She lay back in the armchair, her eyes closed, wondering why Nigel\u0027s[Pg 304] music, which she had used sometimes to hate, soothed her so inexpressibly now. She always asked him to play when she felt her heart was becoming hard—music seemed to melt down that stony sense of outrage which sometimes grew like a cancer into her thoughts. She would not, dared not, have a hard heart, and music was the only thing at present that could keep it soft. \n \n She thought with gathering tears of the confession her brother had just made her, but she would not let her mind dwell on it—somehow she felt he would not like it. The episode did not belong to the surface of things, it belonged to the hidden life of a secret man, a holy, hopeless thing, to be guarded from the prying even of reverent thoughts. She knew that though she and Nigel might often talk together of her sorrow, they would never talk of his. \n \n He was playing a strange tune that pattered on the silence like rain. It was the song of the man who has dreamed of love, who has wakened at last to find it only a dream, and that he lies with empty arms on a hard bed—and then suddenly realises that he has before him that which is sweeter than sleep and dreams—the joy of the day\u0027s work. He played the Prelude of the Day\u0027s Work, through which would trill the magic memory of love—love, which is so much sweeter in memory and in dream than in realisation. \n \n At last he put aside his violin, and going over to Janey, he knelt down by her and kissed her tired face. \n \n \"Oh, Nigel ... Nigel!\" \n \n [Pg 305] \n \n \"You\u0027ll come with me to London, and help me in my new life?\" \n \n \"I want a new life too.\" \n \n \"We\u0027ll start one together.\" \n \n \"And—and you\u0027ll play the devil out of me when he comes?\" \n \n \"Always—and we won\u0027t have any secrets from each other, Janey.\" \n \n She smiled faintly. Her brother always amused her when he spoke of secrets. \n \n There was silence for some minutes. The moon was leaving the window, climbing high among the stars. A little wind began to flutter round Sparrow Hall, whispering and throbbing. \n \n \"I\u0027m tired,\" said Janey. \n \n \"You must go to bed.\" \n \n \"Yes.\" \n \n \"And you\u0027ll dream of the life you and I are going to live together—of success for me, and happiness for you.\" \n \n She rose and put her hands on his shoulders. \n \n \"Good-night, lad.\" \n \n \"Good-night. I think I\u0027m going to bed too. I think I can sleep to-night. But before we go we must drink a toast, Janey.\" \n \n \"A toast!—to whom?\" \n \n \"To—to two people who we thought were going to make you and me happy—but are going to make each other happy instead.\" \n \n She did not answer for a moment. She and her brother stood facing each other in the strange freak of lamplight and moonlight. Then she said— \n \n \"Yes. We must want them to be happy, Nigel.\" \n \n [Pg 306] \n \n He turned to the uncleared supper-table and poured out some of the red wine that Janey drank in these days of her weakness. \n \n \"We\u0027ll drink to their happiness, old sister. We won\u0027t go whining and grudging because it isn\u0027t ours. Besides, we\u0027re going to have it some day—we\u0027ll make a new lot of our own.\" \n \n \"Yes, Nigel\"—Janey\u0027s eyes had kindled—\"we\u0027re not going to grudge them what they\u0027ve got, or be envious and mean.\" \n \n They faced each other across the table. The wind gave a sudden little sigh round Sparrow Hall—blustered—and was still. \n \n \"A toast!\" cried Nigel, lifting his glass, \"a toast!—To those who\u0027ve got what we have lost.\" \n \n THE END \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1936/55545.html","bookId":772,"book":{"id":772,"title":"The Three Furlongers","description":"简介： The twilight was dropping over the fields of three countiesSurrey, Kent and Sussexall touching in the woods round Sparrow Hall. In the sky above and in the fields below lights were creeping out one by one. The Great Wain lit up over Cansiron, just as...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1936","creation":"Aug 1, 2019 12:19:17 AM","modification":"Aug 1, 2019 12:19:17 AM"}}
