{"id":68838,"no":16,"title":"Page 16","content":"Two hours later, I had driven across town twice, checked her parlor, the pub, Teeny’s place, her place and everywhere else I could think of. Nothing. I’d called her at least two dozen times, texted her even more than that and had no replies. The messages I’d left her had now filled her voicemail box full. After exhausting all avenues, I sat on her back porch waiting for her to come home or call, text me back any damn thing. Knots filled my stomach as my head filled with thoughts. What if I’ve lost her? What if she’s had an accident? What if she never comes back? Just as I was about to take off and drive around looking again, I heard a car pull into the drive. I jumped out of my seat and raced to the front of the house as Teeny pulled out and took off.\\n\\n Scarlett tried to shut the door in my face, but I jammed my booted foot in the way and pushed past the door as she took off up the stairs, me hot on her heels. The fury on her face spurred me on. She was mad as hell. Mad was good. I could work with mad. Tears from her I couldn’t do. The only time I’d seen her cry ripped me apart.\\n\\n “Scar, wait let me—”\\n\\n “No! You don’t get to explain shit.” She cut me off yelling.\\n\\n The anger made me take a step back before carrying on. “Scar, come on, stop. It wasn’t what you thought.” Oh fuck. Wrong choice of words; her face was getting redder.\\n\\n “Fuck off, like I haven’t heard that line of bullshit before!”\\n\\n I took a deep breath. “Babe—”\\n\\n “Don’t you dare call me that! You have no fucking right to call me that. In fact, you have no right to be here, so get the fuck out!” Her hands shook with rage as she opened and closed drawers pulling clothes out.\\n\\n “No, I’m not leaving until you listen to me, dammit!” I started to get angry. She needed to stop and listen to me. I wasn’t going to let her give up on us over a stupid mistake.\\n\\n “Fine, asshole. I’ll leave.” She grabbed her bag and stormed out, heading to the carport. I snatched the bag out of her hand and threw it to the side; she kept going, making it to the car with a few quick strides.\\n\\n “Listen to me,” I roared. “I won’t lose you over Janelle and her bullshit.”\\n\\n “Janelle? That was—” Her anger faded slightly.\\n\\n “That was Belle’s mother, babe. There are things I wasn’t honest about. Things I should have told you, but I didn’t want to blow my chances of having this.” I motioned between us with my hand. My confession seemed to ramp up her mood again.\\n\\n “Well, clearly, you forgot to mention you were still screwing you ex!” she yelled.\\n\\n In a deathly-calm voice, I looked right in her eyes. “Stop right fucking there, Scarlett. I’m not fucking her or anyone else for fucks sake!” I took a deep breath, blowing it out on a sigh and continued. “She wanted money.”\\n\\n Scarlett blinked, trying to understand my words. “Money? Why the hell would—”\\n\\n I cut her off and rushed out, “Because I’ve been supporting her since Belle died, before Belle died.”\\n\\n Clearly confused, she asked, “Why would you be doing that? I understand before, but why now? And why didn’t you just tell me that’s what you were doing? Why the big fucking secret? You couldn’t be honest with me?\\n\\n Then I got pissed again. How dare she! “Why couldn’t I be honest? Don’t stand there and make out like you’ve been completely forthcoming with me!” I snapped. “Not once have you told me shit about your past, not even when I ask you. You just up and change the fucking subject.”\\n\\n She stilled “I–My past isn’t important. Nothing important happened to me.”\\n\\n “Oh, the hell it isn’t. Tell me, Scar. Why do you automatically think I’m cheating? Why are you always so closed off? And why the fuck were those walls so damn hard to break through?”\\n\\n “Don’t you dare talk to me about being closed off! You haven’t been in a hurry to share anything except Belle, and that was only after I saw her name on you. You’re such a fucking hypocrite.”\\n\\n My eyes snapped to hers, “You wanna know, Scar? You want it all? Here it fucking is!” I leaned in closer. “Me. All of me, laying myself bare”.\\n\\n “That’s not what I’m asking for, Mace.” She leaned into my chest. I got the impression just offering had melted her slightly, though she was still pissy. That and the way her tits moved with each heavy breath was making me hard as hell. Probably not the best time for it. I shifted so my body lined up with hers. My lips against her neck, arms around her, I asked, “Still mad at me, babe?”\\n\\n “Yes, I’m still mad,” she said, sounding like she was trying to be but failing. “You lied to me.”\\n\\n “I did and I’m sorry. I was trying to sort it out without involving you. I won’t lie to you again.” Pressing kisses to her throat, my jeans got considerably tighter.\\n\\n “Just so you know, now I know what she looks like, the next time I see her, I’m gonna kick her ass,” she whispered on a small moan.\\n\\n My head snapped up. “Why would you want to do that?”\\n\\n “Mace, you need to understand. She hurt you, and she’s laid all this blame on you. Blame that isn’t yours to carry. That pisses me off, and she’s obviously still doing it for you to keep supporting her. I won’t pretend to understand the bond you two have, so if you ask me not to knock her on her ass, I might listen. But get this, I love you. She hurt you, is still hurting you. Belle’s death was never your fault, Mace.”\\n\\n She was pissed at Janelle; she was pissed for me. She still fucking loved me. My dick twitched. This woman would be the death of me. Just when I thought I’d figured her out, she surprised the shit outta me. I turned us so her back was to the hood of her hot car. Putting my hands under her ass, I lifted her to sit on the front, me standing between her legs. A startled gasp came from her as she gripped my shoulders and asked, “What are you doing? I’m still mad at you.”\\n\\n “I’m gonna fuck you right here. You being pissy but still caring about me turns me on so much, I can’t even fucking see straight.” My hands made quick work of her tiny cut off shorts and holey tights. I ripped them down her legs taking her bright purple heels with them. Tossing them all in a heap over my shoulder, the off-the-shoulder shirt came next, leaving Scar sitting on the hood, legs bent at the knees and spread in two tiny scraps of barely-there black lace. She was panting heavily and turned way the fuck on. The sight of her like that had me ripping my shirt over my head and moving in fast.\\n\\n I need her. Now.\\n\\n “Hope to hell you’re ready to go, baby,” I mumbled as I dropped to my knees, grabbed behind her legs and pulled her to my face. Pulling the side of her panties across with my teeth, I ran my nose along her glistening slit. The smell of her arousal had me eager to taste her. I licked down and stiffened my tongue, pushing it into her heat. Fuck, she tasted good. I looked up to see her head thrown back, lips parted, breathing heavy. Her hands behind her, she braced herself as her hips ground down riding my face. She was so damn sexy; my cock was throbbing. I was torn between pounding into her sweet cunt and the sight of her fucking my face.\\n\\n I moved my hand down and flicked at her clit ring causing her to gasp and grind harder. Little mewing sounds came from her as she got closer to release. If she kept it up, I was going to embarrass myself. Her hand came up and she pinched her nipple, ripping a groan from me. I moved to her clit and suckled hard. At the same time, I shoved two fingers deep into her swollen pussy. She went still for a second, then exploded, her juices flowing down my hand, her head thrown back screaming my name. Scarlett laid back on her car, coming all over my hand, was the sexiest thing I had ever seen.\\n\\n I stood licking my fingers clean, popped the button of my jeans and released my painful erection. “Turn around, babe,” I demanded in a rough voice. “Gonna fuck you hard now, baby.”\\n\\n With a whimper, she moved on wobbly legs and turned until she was on all fours, ass in the air. Palming my rock-solid dick, I moved forward and pulled her down until her feet were on the ground. Her arms were out, bent clear over the front of the car, and my hand came down on her ass cheek, a soft slap that left one perfect red mark. She whimpered and thrust back looking for contact. I rubbed the head of my cock through her soaking folds and slapped again. Her knees going weak, she let out a long drawn out moan.\\n\\n “Mace!” she called, she needed me inside her, needed me to fuck her just as much as I needed it. I knew I would lose it as soon as I hit that warmth, so I had to ready myself. “Gonna cum on you, baby. Gonna make you mine, Scar, and then I’m gonna fuck you.” She turned quickly, causing me to take a step back as she dropped to her knees in front of me. She latched on, suckling hard at my throbbing cock. One of her hands snaked down to her clit where she worked herself into another frenzy.\\n\\n “Fuck, baby, fuck, suck it!” Red hot need flowed through me at the sight of her fucking herself and sucking me off. Both of my hands came up and grabbed her head, my fingers lacing through her hair as I fucked her sexy mouth into oblivion. Scarlett moaned around my shaft coming once again as I pulled out and blew my load all over her pretty tits.\\n\\n Watching as she looked up at me, she ran her fingers through my cum then bought them up to her mouth, moaning in pleasure at the taste. She stood, tugged gently on my nipple ring and bent over the hood of the car again. “I need you, Mace.” She pushed her fingers through her wet folds and groaned.\\n\\n “You want it, babe? You got it,” I said as I grabbed her hips and slammed home. Fuck, she was so wet, primed from the previous two orgasms. I pulled back and pounded in and out of her tight heat. Reaching forward and tweaking her nipples, I leaned down further and gently bit her shoulder. As she screamed my name, her pussy clenched my cock making me roar as I came hard and long, in one of the most mind-blowing orgasms of my life.\\n\\n Chapter Eighteen\\n\\n After shucking off his jeans and boots, Mace picked me up, one arm under my knees, one behind my back, and carried me upstairs to bed. After the crazy sex downstairs, I couldn’t make myself be angry if I tried, and I couldn’t try because my body was as limp as a noodle. Angry make-up sex fucking rocked. He collapsed onto the bed with me still cradled against his chest and leaned down to kiss me gently. “Scar, I wasn’t trying to hurt you by keeping things from you. I just didn’t want to scare you off. I love you. I want you in my life, but my life is a shitty place to be, babe, and I don’t want my shit to flow onto you. You are the only good thing in it.”\\n\\n His warm body pressed against me, and his whispered words made me melt. How could I go from mad as a cat with turps on its ass, to all soft and melty? I couldn’t understand the logic; there wasn’t any; it was simply the way Mace affected me; some things couldn’t be explained. “I don’t really care, Mace. Your shit’s, my shit, right?”\\n\\n That made him smirk and answer, “You have a dirty mouth, babe. Need me to fill it again?”\\n\\n I laughed and slapped his arm while his own body shook with silent laughter. “You love my dirty mouth, especially when it’s wrapped around you.” \\n\\n","sourceLink":"https://allnovel.net/tattered-love-needle-s-kiss-1/page-16.html","bookId":1954,"book":{"id":1954,"title":"Tattered Love (Needle\u0027s Kiss #1)","description":"Storyline: Tattered Love (Needle\u0027s Kiss #1) \\n When ex-Special Ops bad-ass Mace walks into Needle\u0027s Kiss tattoo parlour, he never expected to find the girl who would turn his life upside down. \\n Hard as nails Scarlett has been unlucky in love: she’s been burnt, chewed up and spat out. Reluctant to have another relationship, can she keep her wits about her when hot-as-sin Mace walks into her tattoo parlor? Or will he break her down and leave his mark within her ink? \\n What starts out as a little fun, turns into something so much more. \\n Can Scarlett look beyond Mace\u0027s devastating past or will his demons come back to haunt them both? \\n Content warning: contains steamy, anywhere-goes sex, an alcohol induced embarrassing night out and two headstrong lovers taken on a whirlwind of crazy.\\n","cover":"https://allnovel.net/images/tattered-love-needle-s-kiss-1.jpg","author":"Lola Stark","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/tattered-love-needle-s-kiss-1.html","creation":"Oct 5, 2019 8:58:10 AM","modification":"Oct 5, 2019 10:10:48 AM"}}
