{"id":72269,"no":12,"title":"Page 12","content":"“I can’t do this,” I say, catching my breath. But it isn’t the brief sprint that’s winded me. My chest is tightening. My vision blurs around the edges. “I hate it here. I hate everything about this place. I—” My voice breaks.\\n\\n I recognize what is happening to me. My body is doing the one thing it’s been desperate to do since the moment I was shoved into the back of that van; only I was too stunned then, and too angry when I awoke in this place.\\n\\n Gabriel can sense it too. Because he reaches into his breast pocket and hands me a handkerchief just as the first sob comes up.\\n\\n When the elevator doors open, it’s to the hallway that is loud with noises from the kitchen. It smells of lobster steam and something sweet and freshly baked. Gabriel pushes a button and the doors close, only this time the car doesn’t move. “Want to talk about it?” he says.\\n\\n “Don’t you have to get back to the kitchen?” I say, blowing my nose. I do my best not to look sniveling and pathetic, but it’s hard when the handkerchief is already too damp and slimy to dry the rest of my tears as they come.\\n\\n “It’s all right,” he says. “They’ll think I got held up catering to Cecily.” Sassy, demanding little Cecily is quickly taking Rose’s place among the help as least favorite wife. Gabriel and I sit cross-legged on the floor, and he waits patiently for me to stop hiccupping so I can speak.\\n\\n It’s nice, in the elevator. The carpet is worn but clean.\\n\\n The walls are cranberry red, inlaid with Victorian patterns that make me think of my parents’ bedspread, how protected I felt inside of it. Distantly my mind registers the memory of that long-gone security. I’m safe here, too. Somewhere in the back of my mind I wonder if these walls have ears—if at any moment Housemaster Vaughn’s voice will come booming through an overhead speaker, threatening Gabriel for allowing me to make it this far. But I wait, and no voice comes, and I’m so upset that I’m beyond caring anyway.\\n\\n “I have a brother,” I say, starting at the beginning.\\n\\n “Rowan. When our parents died four years ago, we had to leave school and find jobs. It was easy for him to find factory work that paid well. But I had so little skill, I was practically useless. He didn’t think it was safe for me to go out alone, so we tried to stay near each other, and I always wound up with phone jobs in the factories that paid next to nothing. We had enough to get by, but not the way we used to, you know? I wanted to do more.\\n\\n “A few weeks ago I saw an ad in the paper, offering money for bone marrow. Supposedly they were conducting a new screening for causes of the virus.” I turn the handkerchief in my hands, studying it through unreliable vision. In one corner there’s a crimson embroidery of what appears to be a flower, but it’s unlike any I’ve ever seen, with an abundance of spear-shaped petals crowded together. It blurs and doubles. I shake my head to clear my mind.\\n\\n “I realized it was a trap as soon as I stepped inside the lab and saw all those other girls. I fought,” I say, my fingers automatically curling like claws. “I scratched, bit, kicked. It didn’t matter. They herded all of us into a van. And I don’t know how long we were riding. Hours. Sometimes we’d stop, the doors would open, and more girls would come in. It was so awful in there.”\\n\\n I remember that blackness. There were no walls, there was no up or down. I could have been living or dead. I listened to the other girls as they breathed around me, above me, inside me, and that was the whole planet earth. Just those terrified hiccups of breath. I thought I’d gone mad.\\n\\n And maybe I am mad, because I think I hear one of the Gatherer’s bullets now, and I jump. Sparks fly around me.\\n\\n Gabriel raises his head just as the lights begin to flicker. There’s another loud boom, not a gunshot but something mechanical-sounding. Our car begins to shake, and then the doors slide open, and Gabriel is tugging me to my feet and we’re hurrying into the hallway.\\n\\n But it’s not the cooks’ hallway. This one is darker and sterile-smelling. Neon lights are struggling on the ceiling, and in the floor tiles I can see the dim reflection of our shoes before each step lands.\\n\\n “We must’ve gone down a floor,” Gabriel says.\\n\\n “What? Why?” I say.\\n\\n “Storm,” he says. “Sometimes the elevators all move to the basement as a precaution.”\\n\\n “Storm? It was sunny outside just a minute ago,” I say, relieved to find the fear isn’t present in my voice. The sobs have stopped too, leaving only the soft, infrequent hiccups in the aftermath.\\n\\n “We get a lot of them on the coastline,” he says. “Out of nowhere sometimes. Don’t worry, if it was a hurricane, we would have heard the alarm. It’s not uncommon for strong winds to mess with the electricity and take out one of the elevators.”\\n\\n Hurricane. From somewhere deep in my mind comes a television image of wind spinning angrily, destroying houses. It’s always the houses that go, sometimes bits of a fence or an uprooted tree, a shrieking heroine in a prairie dress, but always the houses. I imagine a hurricane smashing into this mansion and tearing it apart. I wonder if I’d be able to escape then.\\n\\n “So this is the basement?” I say.\\n\\n “I think so,” Gabriel says. “I mean, I’ve never been down this way. I’ve only been to where the storm shelter is. Nobody’s allowed without authorization from Housemaster Vaughn.” He looks nervous, and I know Housemaster Vaughn is the reason. I can’t stand the thought of Gabriel limping to my room, melancholy and bruised because of my transgressions.\\n\\n “Let’s go back up before anyone catches us,” I say.\\n\\n He nods. The elevator doors have closed, though, and they don’t open when he swipes his key card across the panel. He tries several times before shaking his head.\\n\\n “It’s down,” he says. “It’ll be back up eventually, but in the meantime, there’s got to be another elevator farther down we can try.”\\n\\n We begin walking down this long hallway, with unreliable lighting that cuts out at times and hisses at us. The main hallway branches off to other, darker hallways and closed doors, and I’m sure I don’t want to know where they lead. I never want to see this floor again. It’s triggering something very bad in my memories, in the place of nightmares, where the murdered girls in the van reside, where the Gatherer thief cups his hand over my mouth and presses a blade to my throat. Something about being here makes my palms sweat. And then I realize it. This is where the doctor was, the afternoon before the wedding.\\n\\n Deirdre brought me to this hallway, led me to a room where a man stuck me with a needle and I blacked out.\\n\\n My skin becomes gooseflesh at the memory. I need to get out of here.\\n\\n Beside me Gabriel presses forward without looking at me. “About what you told me,” he says in a low voice, “I think it’s terrible. And what you said earlier, about hating this place? I understand.”\\n\\n I’ll bet he understands.\\n\\n “It’s Housemaster Vaughn, isn’t it?” I say. “He’s the one that hurt you? It was my fault, because I got out of my room.”\\n\\n “You shouldn’t have been locked in a room to begin with,” he says.\\n\\n I realize all at once that I want to know him. That I’ve begun to see his blue eyes and coppery brown hair as the signs of a friend, and have for a while now. I like that we’re speaking, finally, about things more important than what’s for lunch or what I’m reading or if I want some lemons with my tea. (I never do.)\\n\\n I want to know more about him, and I want to tell him more about myself. My real, unmarried self, my self from before I ever saw the inside of this mansion—when I lived in a dangerous place but I had my freedom and I was happy with it. I open my mouth, but immediately he stops me by grabbing my arm and yanking me into one of the dark side-hallways. I don’t have a chance to protest before I hear the clatter of something approaching.\\n\\n We press ourselves against the wall. We try to be the shadows that cover us. We will the whites of our eyes to be dim.\\n\\n There are voices getting closer. “—cremation isn’t possible, of course—”\\n\\n “Shame to destroy that poor girl.” A sigh; a tsk tsk.\\n\\n “It’s for the greater good, if it will save lives.”\\n\\n The voices are unfamiliar. If I spent the rest of my life in this house, I might never know all its rooms, all the attendants. But as the voices approach, I can see that the people aren’t dressed like attendants. They are dressed in white, their heads protected by the same white hoods that my parents wore to work, with plastic covering their faces. Biohazard suits. They’re wheeling a cart.\\n\\n Gabriel grabs my wrist, squeezes it, and I don’t understand why. I don’t understand what’s happening at all until the cart gets closer to us and I can see what’s on it.\\n\\n A body covered by a sheet. Rose’s blond hair trailing out around the edges. And her cold, white hand, with fingernails still painted pink.\\n\\n Chapter 7\\n\\n I hold my breath as they pass. Eternity is the crisp footsteps, the rickety wheels getting farther away. We wait in silence for a while just to be sure it’s safe, and then I splutter like coming up for air.\\n\\n “Where are they taking her?” I gasp.\\n\\n Gabriel’s sad expression becomes evident in the near-darkness. He shakes his head. “Housemaster Vaughn must be planning to study her,” he says. “He’s been looking for an antidote for years.”\\n\\n “But,” I croak. “That’s Rose.”\\n\\n “I know.”\\n\\n “Linden would never allow this.”\\n\\n “Maybe not,” Gabriel says. “We can’t tell him. We never saw this. We were never here.”\\n\\n We find the elevator and make it back to the cooks’\\n\\n hallway, where there’s a cacophony of metal against metal, plate against plate, the head cook shouting that someone is a lazy bastard. A riot of laughter. They have no idea that the wife they so disliked has been weaving a cold path through hallways under their feet.\\n\\n “Hey, blondie’s here!” someone calls. It’s becoming the kitchen’s official nickname for me. Even though brides aren’t supposed to leave the wives’ floor, they don’t seem to mind my hanging around their workspace. I don’t ask anything of them, which Gabriel says is more than Linden’s last wife and the little one (the brat, they call her) could manage. “What’s wrong with your face, blondie? You’re all red.”\\n\\n I touch the tender skin under my eyes, remembering my tears. They seem like they happened a million years ago now.\\n\\n “I’m allergic to shellfish,” I call back, stuffing the damp handkerchief into my pocket. “The stink traveled all the way up to the wives’ floor, made my eyes all puffy. Are you trying to kill me or what?” \\n\\n","sourceLink":"https://allnovel.net/wither-the-chemical-garden-1/page-12.html","bookId":1761,"book":{"id":1761,"title":"Wither (The Chemical Garden #1)","description":"Storyline: Wither (The Chemical Garden #1) \\n By age sixteen, Rhine Ellery has four years left to live. She can thank modern science for this genetic time bomb. A botched effort to create a perfect race has left all males with a lifespan of 25 years, and females with a lifespan of 20 years. Geneticists are seeking a miracle antidote to restore the human race, desperate orphans crowd the population, crime and poverty have skyrocketed, and young girls are being kidnapped and sold as polygamous brides to bear more children. \\n When Rhine is kidnapped and sold as a bride, she vows to do all she can to escape. Her husband, Linden, is hopelessly in love with her, and Rhine can\u0027t bring herself to hate him as much as she\u0027d like to. He opens her to a magical world of wealth and illusion she never thought existed, and it almost makes it possible to ignore the clock ticking away her short life. But Rhine quickly learns that not everything in her new husband\u0027s strange world is what it seems. Her father-in-law, an eccentric doctor bent on finding the antidote, is hoarding corpses in the basement. Her fellow sister wives are to be trusted one day and feared the next, and Rhine is desperate to communicate to her twin brother that she is safe and alive. Will Rhine be able to escape--before her time runs out? \\n Together with one of Linden\u0027s servants, Gabriel, Rhine attempts to escape just before her seventeenth birthday. But in a world that continues to spiral into anarchy, is there any hope for freedom?\\n","cover":"https://allnovel.net/images/wither-the-chemical-garden-1.jpg","author":"Lauren DeStefano","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wither-the-chemical-garden-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:23:04 AM"}}
