{"id":72291,"no":34,"title":"Page 34","content":"“Now?” I say.\\n\\n “Eventually. Soon. We only have such a short while together,” he says.\\n\\n Shorter than you know, Linden. But I only say, “There are so many other things I want to do with you. I want to go places. I want to see your houses come to fruition. I want—I want to go to a winter solstice party. There must be one coming up.”\\n\\n The romance is draining from his face, replaced by confusion or disappointment—I can’t tell which. “Well, there is probably one coming up. The solstice is next week . . .”\\n\\n “Can’t we go?” I say. “Deirdre has all those beautiful fabrics, and she hardly gets the opportunity to make me a new dress.”\\n\\n “If that’s what will make you happy.”\\n\\n “It will,” I say, and kiss him. “You’ll see. Getting out of the house will do us both some good.”\\n\\n He looks heartbroken, though, so I give in and sit close to him and let him put his arm around me. He loves me, he says, but how can he when we know so little about each other? I admit it’s easy to succumb to the illusion.\\n\\n I admit that sitting here in front of the beautiful moon, embraced in his warmth, it does feel like love. A little bit.\\n\\n Maybe.\\n\\n “You’re just overexcited,” I assure him. “You have a beautiful new son, and he’ll be enough to make you happy. You’ll see.”\\n\\n He kisses my hair. “Maybe you’re right,” he says.\\n\\n But even though he’s trying to agree with me, I know I’m wrong. I know it’s only a matter of time before I’ll be unable to fend off his restless advances without him suspecting me. However I plan to escape, it will have to be soon.\\n\\n In Gabriel’s absence the nervous first generation attendant brings all of our meals. Jenna and I take lunch at the same time in the library, but she’s practically invisible compared to the attention I get.\\n\\n “I hope you enjoy your lunch,” the attendant tells me, pulling the lid off the tray. “Chopped Caesar salad with grilled chicken. If you don’t like it, the head cook will make you anything you like.”\\n\\n “It looks delicious,” I assure him. “I’m not too fussy.”\\n\\n “I didn’t mean to imply that at all, Lady Rhine. Not at all. Enjoy your lunch.”\\n\\n Jenna is grinning at her plate. After the attendant has left, I say, “Did you see that? And that’s only a small part of it. This morning I had an attendant asking if I wanted her to brush my hair. Something strange is going on.”\\n\\n “It’s not strange.” Jenna bites off a forkful of lettuce.\\n\\n “For a first wife.”\\n\\n “They can tell that just by the key card?” I say.\\n\\n “That,” she says. “And other things.” She raises her glass, clinks it against mine. “Congrats, sister wife.”\\n\\n I respond with a bittersweet, “Thanks.”\\n\\n While all of the attendants are busy catering to my every need, I worry about what this keycard means. At first I thought it would mean more freedom, but now I wonder if Vaughn has concocted a scheme more dia-bolical than that, because with all this extra attention it’s becoming difficult for me to find a minute to myself. I’m allowed outdoors whenever I like, but am often interrupted with attendants bringing me mugs of hot chocolate or tea. They come to my bedroom two, three, four times a night asking if I need extra pillows, if my window has a draft.\\n\\n I can’t help but think Vaughn allowed me the key card so his staff could smother me with kindness. Maybe he even hid Gabriel away just to mock me.\\n\\n And for all the places I can go, none of them lead to Gabriel. I know I should have looked for him when there was the distraction of Cecily’s labor. Jenna has told me as much since. But I couldn’t bring myself to leave her.\\n\\n I’m still worried about her. She and her son survived the labor, but she’s been weary since then. Her room is kept dark and warm, smelling of medications and, faintly, of Vaughn’s basement. In her sleep she murmurs about music and kites and hurricanes. She’s lost too much blood. That’s Vaughn’s diagnosis, and I agree, but I’m still uneasy when she’s given the transfusion. I lay beside her as she recovers, as the color slowly returns to her cheeks, and I wonder whose blood is coursing through her. Maybe Rose’s. Or some unwilling attendant’s. I wonder if Vaughn, who I believe is capable of such darkness and destruction, ever truly uses his abilities to heal.\\n\\n But as the days pass, Cecily begins to improve.\\n\\n When the baby cries, Linden carries him to her bedside. Sleepily she unbuttons her nightgown and holds her son to her breast. From the hallway I look into her bedroom and see Linden helping her stay awake. He speaks softly to her, pushing the straggly red hair from her face, and his words make her smile. They’re perfect for each other, I think, so wide-eyed and sheltered, so content with this little life they’ve built with each other.\\n\\n Maybe I should stop telling my twin stories; maybe it’s better for both of them to forget there are better things beyond this mansion. Things that don’t dissolve, things more tangible than the sharks and dolphins in the pool, the spinning houses at Linden’s expos. And it’s better that their son never knows there’s a world out there at all, because he’ll never get to see it.\\n\\n Cecily turns and notices me standing in the doorway. She waves me over, but I fade back into the hallway, pretending there’s some way I can be useful elsewhere.\\n\\n I do not want to intrude on their marriage. Sharing a husband with two other wives isn’t complicated; being married to Linden means something different for each of us. For Jenna, Linden’s mansion is nothing but a luxurious place to die. For Cecily, her marriage is some kind of partnership of ‘I love yous’ and children. For me, it’s a lie. And as long as I can separate the three marriages and stick to my plan, it will be easier to leave. Easier to tell myself that they’ll be okay once I’m gone.\\n\\n I’m happy when Cecily is well enough to get out of bed. I follow her to the sitting room and watch as she sets a slide into place on the keyboard and begins to play.\\n\\n Her music brings the hologram to life, like a floating television screen. A green field dotted with poppies, and a cobblestone-like blue sky with moving white clouds. I am sure this is a replica of a painting I’ve seen in one of the library books, something impressionistic as the artist began the slow descent into madness.\\n\\n The baby lies on the floor, staring up, the lights from the illusion flickering about his face. The winds thrash the grass and the poppies and the faraway bushes this way and that, until everything is one grayed-over tangle of color. A delirium. Smears of wet paint.\\n\\n Cecily has lost herself. Her eyes are closed. The music streams out of her fingers. I concentrate on her young face, her small slightly parted mouth, her thin eyelashes.\\n\\n The colors of her song do not reach her where she sits poised over the keys, and I do not think the illusion matters to her. She’s the most real thing in this room.\\n\\n Her son makes uncertain faces and wriggles in place, unsure what to do with all this splendor. As he grows, he will see many illusions. He will watch paintings come to life as music plays for him, and he’ll see his father’s houses spin, and he’ll dive into schools of guppies and great whites in the swimming pool. But I don’t suppose he will ever know the ocean lapping up around his ankles, or will ever cast a fishing line, or have a house of his own.\\n\\n The music fades; the winds calm; the illusion folds in on itself and dies.\\n\\n Cecily says, “I wish we could have a real piano. Even the dumpy orphanage had a real piano.”\\n\\n Jenna, standing in the doorway with her mouth and hand full of shelled pistachios, says, “‘Real’ is a dirty word in this place.”\\n\\n Chapter 21\\n\\n On the morning of the winter solstice, Jenna manages to steal the lighter from an attendant after he lights the incense in the hall. She pretends to flirt with him, and when she drops her stack of risqué romance novels, he’s eager to pick them up, and she manages to swipe the lighter right out of his hand. He’s so enamored by her smile that he doesn’t realize it’s gone.\\n\\n “Bye, bye.” She smiles as he leaves, and he nearly catches his tie in the elevator doors as they close. The second he’s gone the seduction leaves her gray eyes and she becomes just a girl again. In my doorway, I applaud, and she makes a curtsy with her skirt.\\n\\n She’s sweating a little, as though the effort exhausted her. But she holds the lighter like it’s a trophy.\\n\\n “What are you going to do with that?” I ask.\\n\\n “Give me one of your candles. I’m going to set the sitting room on fire,” she says matter-of-factly.\\n\\n “Excuse me?”\\n\\n “When Governor Linden and the Housemaster and the attendants hear the alarm, they’ll come rushing to find out what the commotion is. And that’s when you go to the basement.”\\n\\n It’s not the craziest plan one could come up with, as Jenna points out, recalling my brush with death on the mini-golf course. But I make her wait until I’ve put the green contacts into my eyes. “Maybe then I won’t be recognized,” I say. Even the attendants who have never met me have heard about me. Rhine. The nice one who doesn’t complain, who has the unusual eyes.\\n\\n Jenna is impressed by my cunning. “Look for a biohazard suit,” she says. “Then nobody will recognize you for sure. They should be in one of the labs.” I don’t tell her that the thought of venturing into one of those dark rooms terrifies me. I only nod and give her one of the lavender candles that’s supposed to help me fall asleep at night. “You stay in here,” she says. “And when the alarm goes off, just try to be invisible.” She smiles at me, and then she’s gone with a little skip in her step. I think she has wanted to set fire to this place for a long time.\\n\\n A few seconds later the fire alarm is blaring. The ceiling lights are flashing. Across the hall the baby starts screaming, and Cecily runs into the hallway with her hands over her ears. The elevator opens, and attendants flood out, but Linden and Vaughn don’t show up until the car comes back a second time, and by then you can see the smoke billowing out of the sitting room. There’s no stairwell leading to the wives floor, and I’ve always wondered what would happen if there were ever a fire, but knowing Vaughn, he would let Linden’s wives die and replace us later.\\n\\n It’s easy for me to escape. The key card, of course, won’t grant access to the basement, and so I have to push the panic button. But in all this commotion and with all these alarms already wailing, it doesn’t make a difference.\\n\\n The doors open and I’m in the windowless basement. It’s eerily calm down here. There’s no indication that there are any sirens, and the ceiling lights lazily flicker. \\n\\n","sourceLink":"https://allnovel.net/wither-the-chemical-garden-1/page-34.html","bookId":1761,"book":{"id":1761,"title":"Wither (The Chemical Garden #1)","description":"Storyline: Wither (The Chemical Garden #1) \\n By age sixteen, Rhine Ellery has four years left to live. She can thank modern science for this genetic time bomb. A botched effort to create a perfect race has left all males with a lifespan of 25 years, and females with a lifespan of 20 years. Geneticists are seeking a miracle antidote to restore the human race, desperate orphans crowd the population, crime and poverty have skyrocketed, and young girls are being kidnapped and sold as polygamous brides to bear more children. \\n When Rhine is kidnapped and sold as a bride, she vows to do all she can to escape. Her husband, Linden, is hopelessly in love with her, and Rhine can\u0027t bring herself to hate him as much as she\u0027d like to. He opens her to a magical world of wealth and illusion she never thought existed, and it almost makes it possible to ignore the clock ticking away her short life. But Rhine quickly learns that not everything in her new husband\u0027s strange world is what it seems. Her father-in-law, an eccentric doctor bent on finding the antidote, is hoarding corpses in the basement. Her fellow sister wives are to be trusted one day and feared the next, and Rhine is desperate to communicate to her twin brother that she is safe and alive. Will Rhine be able to escape--before her time runs out? \\n Together with one of Linden\u0027s servants, Gabriel, Rhine attempts to escape just before her seventeenth birthday. But in a world that continues to spiral into anarchy, is there any hope for freedom?\\n","cover":"https://allnovel.net/images/wither-the-chemical-garden-1.jpg","author":"Lauren DeStefano","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wither-the-chemical-garden-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:23:04 AM"}}
