{"id":72293,"no":36,"title":"Page 36","content":"“Especially if there are cameras,” another says, dreamily.\n Cameras. Perfect. I don’t know what the odds are of my brother watching a televised solstice festival. And there are probably dozens of them airing on the news networks tonight. He wouldn’t usually care about these things, but has he been looking for me? Is there still a chance after all this time? I just need one month, and then I’ll be able to find my way back home. In the back of my mind I worry that I’ll be returning to an empty house, that’s he has gone to look for me, or, driven to extremes by grief, he has moved away, too pained by the memories to stay. We’ve seen it happen. Families have moved away once their sisters and daughters have been taken. And Rowan has never been one to sit idly by.\n Wait for me, I try to cast my thoughts to him, twin to twin. I’ll be home soon.\n As always, there’s no answer.\n I was skeptical when Deirdre told me my dress would be pink, but when she unfolds it before me, I am, as always, dazzled by her skill. It’s a muted, shimmering pink with a hemline meant to simulate snowdrifts. The shawl glitters with pearls. She does my makeup to match. “I bet most of the other wives will wear blue or white,” she says. “For winter. I thought you’d want to stand out a little.”\n “It’s incredible,” I say. And she beams and holds a folded tissue to my lips and tells me to blot.\n Linden is happy I decided against the green contacts.\n “They looked kind of freaky,” Cecily says with her arms folded in the doorway. Her hair is tousled, and faint purple bags droop down under her eyes. Her skin is pale and full of veins. “I thought you had some kind of stroke. Don’t wear them again, okay?” She shudders at the memory and retreats into her room.\n I frown after she’s gone. She is hardly the bouncy, winged bride she was less than a year ago. She had her fourteenth birthday shortly before the baby was born, and unlike Jenna who aged quietly, she made a big deal of it. There was a sheet cake covered in frosted leaping uni-corns, and the attendants had to sing to her, and Linden bought her a gorgeous diamond necklace she never has cause to wear. She wore it for a while around the house, but I haven’t seen it since she gave birth to Bowen.\n “She seems so tired. Have you been helping her with the baby?” I ask Linden.\n “Every chance I get,” he says, and frowns a little too.\n We’ve both lowered our voices. “It’s not always easy to wrestle him away from my father. He’s so excited to finally have a grandchild.” He looks at me, and for a moment I think he’s going to tell me what I already know, that he had a baby that didn’t live. A little piece of Rose he should have been able to keep. But he only says,\n “You look stunning,” and takes my arm.\n It’s freezing outside, but Deirdre’s shawl keeps my shoulders warm. Linden makes some joke about whether we should open the skylight, but I just snuggle against him and say we should leave it closed. Because of the tinted glass and the darkness of the night, I can’t see exactly where the hologram of trees is. But once we’re out into the city, I pay attention to the streets. I press myself close to the glass and look for landmarks that will guide Gabriel and me when we break free.\n Linden is smiling brightly.\n “What?” I say.\n “You. You’re so excited.” He tucks an over-sprayed curl behind my ear. “It’s just kind of cute.”\n His comment takes me by surprise. Here he is admiring me while I’m thinking of nothing but how to get away from him and never look back. I feel so guilty that when he kisses my cheek, I reward him with a smile of my own. And I continue to keep an eye out.\n The cinema will be the first thing to look for. It should be easy to find from anywhere—the marquee is so bright, and the neon sign on the door boasts that it’s open twenty-four hours a day. Then there’s what looks like some kind of seafood place with bright red tables and paper lanterns. And then I remember that we’re close to the ocean. I get a good look at it as we’re turning a corner, and I see yachts farther out in the sea, full of lights.\n I can hear their music even with the windows closed.\n “They have parties on the water?” I say.\n “I suppose the yacht clubs do,” Linden says, looking out over my shoulder.\n “Have you ever been out on the water?” I ask him.\n “Once, when I was small,” he says. “But I’m too young to remember it. My father tells me I was seasick for days. Some kind of condition, he says. I’ve avoided the water ever since.”\n “So that’s why you never go into the pool or learned how to swim,” I say. He nods. I try to hide my horror.\n Vaughn so carefully controls his son, that he can’t even allow him to enjoy the illusion of a real ocean in the pool. I have my doubts that the seasickness story is even true. In fact, his childhood illnesses and supposed frailty seem like things Vaughn concocted to keep his son from venturing far. I put my hand on Linden’s knee and say,\n “When it gets warm again, I’m teaching you to swim. It’s easy. Once you learn, you can’t sink even if you try.”\n He says, “I’d like that.”\n And then I remember. By the time the weather gets warm, I will be far from this place. I get one last look at the ocean before it disappears behind some buildings.\n The waves roll on past the yachts and the lights, into the deep night, into forever. It’s the one place Linden can never follow me. And Gabriel says he loves boats. I wonder if he knows enough about them to sail us away.\n The party is held on the fifteenth floor of a towering skyscraper. There’s a dance floor on which shoe prints linger in neon lights for a few seconds before fading. Icicles are suspended in the air, reflecting back the colorful lights. The floor is a snowy hologram, and Deirdre was right, all the wives are wearing blue or white.\n Linden is looking a little rigid as we linger by the door. “Do you know anyone here?” I ask.\n “A few of my father’s colleagues,” he says.\n The strobe lights make his shadow jump in rainbow colors. I think about what Rose said, about his being a wallflower at parties, about his being an excellent dancer.\n He looks a little seasick right now. And I decide to wait for a slow song before asking him to dance, to make it easier.\n We stand by the buffet table, sampling filet mignon and soups and the biggest assortment of pastries I’ve seen since the bakery I used to pass on my way to work in Manhattan. I tell him we have to bring home some of the éclairs for Cecily, who has a weakness for anything with chocolate icing.\n When there’s a slow song, I drag Linden out onto the dance floor, and though he’s bemused at first, it doesn’t take long for him to forget about everyone around us.\n I’ve never danced a day in my life, but he guides me flaw-lessly even in these impossible heels. And while we’re spinning, floating, and just after he’s dipped me over his arm and I’ve recovered, a camera pans over us. I try to let it get the best possible shot of my eyes.\n We mingle for a while, and fewer of the men here want to kiss my hand, because they all have their wives on their arms. The wives are more bearable too. There are first generation wives talking with younger wives, and I join a conversation about rare birds in eastern Cali-fornia. I don’t have much to contribute, but it’s a welcome change from the wives who asked when I’d let my husband knock me up.\n I see Linden joining in on a conversation with a group of men across the room, meeting my eyes occasionally and just barely raising his hand in a wave. I think he’s following my lead.\n “You’re married to Linden Ashby, right?” one of the young wives says, leaning close to me.\n “Yes,” I say. It seems more natural to admit to it now, somehow.\n “I was so sad to learn that Rose died.” She presses her open hand over her heart. “She was a friend of mine.”\n “Mine, too,” I say. Across the room I think Linden is actually laughing at something he’s heard.\n “He looks like he’s doing well, though,” the young wife says, and her youthful smile reminds me of Cecily before the baby was born. “I’m glad he’s opening up again. We all—my husband works with Linden’s father at the hospital—we heard about her falling ill, and we haven’t seen Linden at any of the parties.”\n “It’s been difficult, but he’s doing much better,” I say.\n “You must have a magic touch,” she says.\n Linden sweeps my arm up in his, and, still laughing about some secret joke, he begins to introduce me to his father’s friends, and their wives, and even some people he’s only just met. I’ve never seen him like this. So happy.\n So . . . free.\n We return home in the early hours of the morning. He had a few glasses of wine and is sagging against me as we take the elevator to the wives’ floor so he can check on Bowen, whose crib is in Cecily’s room. There’s been talk of building a nursery on another floor, and it’s become a great source of tension between Cecily and Vaughn. She refuses to part with her son, and Vaughn thinks it’s a shame to waste all these infinite rooms. Rose’s bedroom door is closed off at the end of the hall, and even Cecily has not been so bold as to suggest converting it into a nursery.\n I hand Linden the box of éclairs I’ve brought home for Cecily. He stares at me a long while and says, “You’re so thoughtful,” and gives me a quick kiss as he turns into her bedroom.\n In my bathroom I scrub off my makeup, rinse my hair out in the sink, and change into my nightgown, but quickly realize I’m unable to sleep. My bones still want to dance, and my mind is all full of lights and music and thoughts of the ocean. If I were truly an orphan like Linden believes, if I had really spent my childhood in a school for brides, I think this would be a nice life to lead.\n I could see how a girl could get lost in it.\n I think about calling Deirdre to rub my stiff ankles, or draw me a chamomile bath (the exact science of which I cannot seem to recreate myself), but I remember how late it is and decide against it. Instead I knock on Jenna’s door. She’s barely awake, and I ask if I can get into the bed with her. In the darkness I can just make out her nod.\n “Did you tell freedom hello for me?” she says as I wrap my arms around a pillow and she tucks the covers over me.\n I tell her about the icicles, and the snowy hologram, and the food. “The chocolate-dipped strawberries were worth dying for,” I swoon. “They had a huge fountain just bubbling chocolate. I wish you’d been there.”\n “Sounds nice,” she says. Her voice is a little strained, and she coughs. She was coughing earlier today too, and she has looked a little pale for the past few days. I move closer to her and touch my hand to her forehead, but Linden isn’t the only one who’s had a bit to drink, and I can’t tell if she’s warm. \n","sourceLink":"https://allnovel.net/wither-the-chemical-garden-1/page-36.html","bookId":1761,"book":{"id":1761,"title":"Wither (The Chemical Garden #1)","description":"Storyline: \n Wither (The Chemical Garden #1) \n By age sixteen, Rhine Ellery has four years left to live. She can thank modern science for this genetic time bomb. A botched effort to create a perfect race has left all males with a lifespan of 25 years, and females with a lifespan of 20 years. Geneticists are seeking a miracle antidote to restore the human race, desperate orphans crowd the population, crime and poverty have skyrocketed, and young girls are being kidnapped and sold as polygamous brides to bear more children. \n When Rhine is kidnapped and sold as a bride, she vows to do all she can to escape. Her husband, Linden, is hopelessly in love with her, and Rhine can\u0027t bring herself to hate him as much as she\u0027d like to. He opens her to a magical world of wealth and illusion she never thought existed, and it almost makes it possible to ignore the clock ticking away her short life. But Rhine quickly learns that not everything in her new husband\u0027s strange world is what it seems. Her father-in-law, an eccentric doctor bent on finding the antidote, is hoarding corpses in the basement. Her fellow sister wives are to be trusted one day and feared the next, and Rhine is desperate to communicate to her twin brother that she is safe and alive. Will Rhine be able to escape--before her time runs out? \n Together with one of Linden\u0027s servants, Gabriel, Rhine attempts to escape just before her seventeenth birthday. But in a world that continues to spiral into anarchy, is there any hope for freedom?\n \n","cover":"https://allnovel.net/images/wither-the-chemical-garden-1.jpg","author":"Lauren DeStefano","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wither-the-chemical-garden-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:23:04 AM"}}
