{"id":72295,"no":38,"title":"Page 38","content":"In another time, in another place, I wonder who they might have been.\\n\\n The attendants come to take our plates, and Linden frowns at how little I’ve eaten. “You’re going to make yourself sick,” he says.\\n\\n “I’m just tired,” I say. “I think I’ll go to bed.”\\n\\n Upstairs Cecily’s bedroom door is open, and I can hear Bowen gurgling softly, breathing in that cadenced, raspy, newborn way. The light is off, and perhaps he’s lying awake in his crib while Cecily sleeps. I know this routine. Left unattended, when he awakens from a nap, he will inevitably start to cry. And when he cries, he doesn’t stop.\\n\\n My plan was to try to get some sleep, but it’s better to take Bowen from his crib before he wakes up my sister wives. But when I step into the bedroom, I find Jenna sitting on the edge of the bed, illuminated in a strip of light from the hallway. Her long hair cascades over one shoulder, and her face is tilted down toward the baby in her arms. Cecily is sleeping under the covers behind her in silence.\\n\\n “Jenna?” I whisper. She smiles without raising her head.\\n\\n “He looks like our husband,” she says softly. “But I can tell by his temper that he’s going to be like Cecily. It’s too bad none of us will get to see that.”\\n\\n She looks so beautiful like this. The darkness hides her pale complexion, her purpling lips. Her nightgown is tiers and tiers of lace, her hair a perfect dark curtain. And I am struck with the painful realization that she looks like she could be somebody’s mother. The caregiver, deft and gentle, with long capable fingers tracing Bowen’s half-moon face. I wonder if she cared for her sisters this way before they were murdered, the way she has cared for Cecily. The way she has cared for me.\\n\\n I swear I’ve just watched a tear roll from the corner of her eye, but she swipes it away before it gets far.\\n\\n “How are you feeling?” I ask.\\n\\n “All right,” she says. I force myself to believe her. She looks so strong right now, so young. “Here, take him for a minute, okay?” She stands, and when she walks toward me, I can see that her knees are trembling. She comes closer, and the light from the hallway shows me the beads of sweat on her face, the blue shadows under her eyes.\\n\\n I let her ease the baby into my arms, and she walks by me with all the presence of a ghost, sweeping through the spot where she flirted with the baffled attendant, where hundreds of times she paced toward her room with her nose in a romance novel.\\n\\n Her hand trails the wall as she makes her way to her bedroom and closes the door. Moments later I hear the mangled sounds of her coughing.\\n\\n Bowen, unfazed by her absence, has fallen asleep. I envy his complacency. I envy his twenty-five remaining years.\\n\\n Later, I close my bedroom door. I shut off the lights.\\n\\n I bury my face in my pillow and I scream and scream until I’m so numb that I can’t feel my arms and legs, just like Jenna. And the silence throbs. Rowan, my parents, Rose, the Manhattan harbor. Things I miss. Things I love. Things that I have left behind, or that have fallen through my fingers. I want my mother to come and kiss me good night. I want my father to play the piano. I want my brother to keep watch while I sleep, to give me a swig of vodka when the pain is too bad. I miss him. I haven’t allowed myself to truly miss him in a long time, but now I can’t help it. A floodgate has opened. And I’m so tired and so lost, and I don’t know if I’ll ever truly be able to escape. I don’t know how I’ll be able to open the iron gate with its pointed flower. I wipe my tears on Gabriel’s handkerchief, which I’ve kept hidden in my pillowcase all this time. In the darkness I feel the embroidery, and I sob until my throat is raw, and I just hope, hope, hope that I’ll make it home.\\n\\n I dream of being cast into the sea. I dream of drowning, but this time I don’t thrash or struggle. I succumb.\\n\\n And after a while, in the quiet of the underwater, I can hear my father’s music, and it’s not so bad.\\n\\n In the morning, Cecily wakes me in tears. “Jenna won’t open her eyes,” she says. “She’s burning up.”\\n\\n Cecily tends to be dramatic, but when I stumble, still half-sleeping, to Jenna’s room, I can see that it’s even worse than she described. Our sister wife’s skin has paled and taken on a cruel yellow tinge. Bruises are spreading across her throat and arms. No, not bruises; they’re more like festering wounds. I touch her forehead, and she makes a pitiful croaking sound.\\n\\n “Jenna?” I whisper.\\n\\n Cecily paces, clenching and unclenching her fists. “I’m getting Housemaster Vaughn,” she says.\\n\\n “No.” I get onto the mattress and bring Jenna’s head into my lap. “Go to the bathroom and get a wet cloth.”\\n\\n “But—”\\n\\n “There’s nothing he can do for her that we can’t do ourselves,” I say, forcing a calm tone.\\n\\n Cecily obliges, and I hear her sobbing as she runs the water, but she has composed herself when she returns with the wet cloth. She pulls back the blankets and undoes the top buttons of Jenna’s nightgown to help cool the fever, and all the while I can see her struggling to contain the panic that’s filled up her eyes. Do my eyes look the same way? I’m sitting here, calmly running my fingers through Jenna’s hair, but my heart is pounding, my stomach is sick. This is so much worse than what I saw Rose go through. So, so much worse.\\n\\n Hours pass, and I think this is going to be the end of my sister wife. She’ll never open her eyes again. Even I hadn’t expected it to happen so fast.\\n\\n Cecily puts her arms around me and buries her face in my neck. But I have no words of comfort for her. It takes all my effort just to keep breathing.\\n\\n “We should get Housemaster Vaughn,” she says, for the third or fourth time.\\n\\n I shake my head. “She hates him,” I say.\\n\\n And then Jenna laughs. “Yep,” she says. It’s a weak, garbled sound, but Cecily and I snap to attention, and we see the smile on Jenna’s purpled lips. Her eyelashes flutter and she opens her eyes. They’re not the vivacious things they once were. They’re eerie and distant. But there’s still life in them. She’s still with us.\\n\\n “Hi,” Cecily croons, kneeling at the bedside and taking Jenna’s hand in both of hers. “How are you feeling?”\\n\\n “Great,” Jenna says, and her eyes roll back as she closes them.\\n\\n “Can we get you anything?” I say.\\n\\n “A tunnel of light,” she says, and I think she’s trying to smirk.\\n\\n “Don’t say things like that,” Cecily says. “Please don’t. I can read to you if you’d like. I’ve gotten much better at it.”\\n\\n Jenna opens her eyes long enough to watch Cecily flip through one of the many books piled on the nightstand, and then she laughs again, and it’s more painful to hear than before. “That one’s not exactly death bed appropri-ate, Cecily.”\\n\\n I can’t stand this. I look at Jenna and all I can see is this thing that’s killing her. This voice doesn’t even sound like hers.\\n\\n “I don’t care. I’ll read it anyway,” Cecily says. “There’s a bookmark in the middle, so I’ll start there. You should at least get to see how it ends.”\\n\\n “Skip to the last page, then,” Jenna says. “I’m not made of time.” And then her chest convulses and blood and vomit spill from her mouth. I turn her onto her side and rub her back while she struggles to cough it all up. Cecily cringes, her eyes filling with tears. I don’t know how Cecily has the energy to cry so much. I can barely muster the energy to move. Just being alive feels so arduous that all I want to do is climb under the covers and sleep.\\n\\n It seems impossible that I ever had the strength even to walk.\\n\\n I slept for days after my parents died. Weeks. Until my brother couldn’t take it anymore. Get up, he said.\\n\\n They’re dead. We’re alive. We have things to do.\\n\\n Jenna chokes and gasps. I can see the notches in her spine through her gown. When did she become so thin?\\n\\n There’s barely any life left in her when she’s through coughing and vomiting. She rolls onto her back, eyes shut, motionless except for her jagged breathing. She doesn’t even move when Cecily and I strip the ruined bedsheets from under her.\\n\\n She sleeps the morning away, barely mumbling when Cecily and I change her soiled nightgown and dab at her with cool cloths. Her skin is bruised everywhere, so translucent and marbled with veins that I hesitate to touch her. Some of the bruises have started to bleed.\\n\\n It’s like her body is rotting from the inside out. Her hair has become thin; locks of it fall out at a time. I sweep it away. Cecily reads aloud from the romance novel, which is all about healthy young lovers and summer kisses. She pauses sometimes to clear the sobs caught in her throat.\\n\\n We dismiss the attendants who come with medications, after Jenna proves too weak to swallow pills, and fails to keep down anything else they try to give her.\\n\\n It gets to be so bad that Jenna, hazy and barely able to speak, starts to hide her face in my or Cecily’s nightgown when she hears footsteps approaching. I know what she’s trying to tell us. It’s the same thing that Rose was begging for. She doesn’t want to prolong this misery.\\n\\n She doesn’t struggle with Adair, though, and so we allow him in. Her domestic is light on his feet and unassuming with his touch. He rubs a salve on her chest that takes the creakiness out of her breathing. And he doesn’t stay longer than he has to. He always raved about Jenna’s beauty, and he understands that she doesn’t want anyone to witness her dying in such a hideous way.\\n\\n By late afternoon, Linden is concerned enough to check on us. Immediately his face changes when he crosses the threshold. He can smell it: the heavy stench of decay and sweat and blood. I can see in his eyes that this is familiar. He spent the final days at Rose’s side. But he doesn’t approach this wife. I know Jenna always kept an emotional distance from Linden, that their marriage was purely sexual, but I wonder if Linden was partly to blame for that too. After losing Rose, he didn’t want to love another woman he would outlive. I have as many years left as he does, and Cecily will outlive us both. But Jenna . . .\\n\\n Linden looks so piteous and apologetic, standing there. His three wives are huddled together on the bare mattress, one of them dying; when we’re together, we form an alliance he can’t touch. He’s scared to even try.\\n\\n “I forgot to feed Bowen, didn’t I?” Cecily says when she sees her son in Linden’s arms.\\n\\n “It’s all right, love. There’s the wet nurse for that,” Linden says. “I’m more worried about you.”\\n\\n I can’t imagine why Linden would bring his son here, unless he’s feeling lonely and hoped it would lure Cecily away to spend some time with him. It doesn’t work. \\n\\n","sourceLink":"https://allnovel.net/wither-the-chemical-garden-1/page-38.html","bookId":1761,"book":{"id":1761,"title":"Wither (The Chemical Garden #1)","description":"Storyline: Wither (The Chemical Garden #1) \\n By age sixteen, Rhine Ellery has four years left to live. She can thank modern science for this genetic time bomb. A botched effort to create a perfect race has left all males with a lifespan of 25 years, and females with a lifespan of 20 years. Geneticists are seeking a miracle antidote to restore the human race, desperate orphans crowd the population, crime and poverty have skyrocketed, and young girls are being kidnapped and sold as polygamous brides to bear more children. \\n When Rhine is kidnapped and sold as a bride, she vows to do all she can to escape. Her husband, Linden, is hopelessly in love with her, and Rhine can\u0027t bring herself to hate him as much as she\u0027d like to. He opens her to a magical world of wealth and illusion she never thought existed, and it almost makes it possible to ignore the clock ticking away her short life. But Rhine quickly learns that not everything in her new husband\u0027s strange world is what it seems. Her father-in-law, an eccentric doctor bent on finding the antidote, is hoarding corpses in the basement. Her fellow sister wives are to be trusted one day and feared the next, and Rhine is desperate to communicate to her twin brother that she is safe and alive. Will Rhine be able to escape--before her time runs out? \\n Together with one of Linden\u0027s servants, Gabriel, Rhine attempts to escape just before her seventeenth birthday. But in a world that continues to spiral into anarchy, is there any hope for freedom?\\n","cover":"https://allnovel.net/images/wither-the-chemical-garden-1.jpg","author":"Lauren DeStefano","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wither-the-chemical-garden-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:23:04 AM"}}
