{"id":72263,"no":6,"title":"Page 6","content":"The redhead, the little one, is hissing to Elle that her bodice is now laced too tight, and how can she be expected to stay still during the ceremony—the most important moment of her life, she adds—if she can hardly breathe? The willowy girl stands beside me, saying and doing nothing as Adair perches on a stepladder and dots her braided hair with tiny fake lilies. There’s a knock on the door, and I don’t know what I’m expecting. A fourth bride, perhaps, or for the Gatherers to come and shoot us all. It’s only Gabriel, though, holding a large cylinder and asking the domestics if the brides are ready. He doesn’t look at any of us. When Elle tells him we’re ready, he lays the cylinder on the ground, and with a mechanical whirr it somehow unrolls a long red carpet that stretches out into the hallway. Gabriel disappears into the shadows. Strange music begins to radiate, seemingly from the ceiling tiles. The domestics arrange us in a row, youngest to oldest, and we begin to march. It’s amazing how in sync our footsteps are, for having no practice and considering we were all dragged to this place in unconscious heaps after the time spent in that van. In a few minutes we’ll be sister wives. It’s a term I’ve heard on the news, and I don’t know what it means. I don’t know if these girls will be my allies or enemies, or if we’ll even coexist after today. The bride in front of me, the redhead, the little one, seems to be skipping. Her wings flutter and bounce. Glitter swirls around her. If I didn’t know better, I could swear she’s excited about all this. The carpet leads to an open door to the outside. This is what Deirdre called the rose garden, which is abundantly clear by the rosebushes that make up the high walls around us. They are an extension of the hallway, really, and despite the open sky overhead, I feel no less trapped than I did inside. The dusk sky is full of stars, and absently I think that back home I would not dream of being outside at this hour. The door would be bolted, the noise trap laid out in the kitchen. Rowan and I would be having a quiet dinner and washing it down with tea, and then we’d watch the nightly news to see about available jobs and to update ourselves on the state of our world, hoping dismally that one day there might be a positive change. Since the old lab exploded four years back, I’ve been hoping a new lab will replace it, so that Pro-Science research jobs will be created, and so that someone can discover an antidote; but orphans have made a home for themselves in the ruins of the old lab. People are giving up, accepting their fate. And the news is nothing but job listings and televised events put on by the wealthier class—House Governors and their sad brides. It’s supposed to encourage us, I suppose. Give the illusion that the world isn’t ending. I don’t have a chance to feel the oncoming wave of homesickness before I’m nudged into the clearing at the end of the rosebush hallway and made to stand in a semi-circle with the other brides. The clearing is sudden and gaping, and a relief. The garden at once becomes enormous, a city bustling with fireflies and little flat candles that seem to be floating in place—I think Deirdre called them tea lights. There are fountains trickling into tiny ponds, and I can see now that the music is somehow being amplified from a keyboard that plays itself, the keys lighting up the notes radiate out, sounding like a full band of strings and brass. I know the melody; my mother used to hum it “The Wedding March,” the theme of weddings back in her own mother’s day. I’m led to a gazebo at the center of the clearing with the two others, where the red carpet becomes a large circle. There is a man beside us in white robes, and the domestics take their places opposite us, their hands clasped in front of them as though in prayer. The youngest bride giggles as a firefly spirals before her nose and disappears. The oldest bride stares into space with eyes as gray as the evening sky. I just do what I can to not stand out, to blend in, which I suspect is impossible if the Governor has taken a liking to my eyes. I don’t know much about traditional weddings; I’ve never attended one, and my parents, like most couples at that time, were married in city hall. With the human race dying off so young, hardly anybody gets married anymore. But I suppose this is how it used to be, more or less: The waiting bride, the music, the groom in a black tuxedo approaching. Linden, the House Governor, my soon-to-be husband, is led to us on the arm of a first generation man. Both of them are tall and pale. They part at the gazebo and Linden takes the three steps that lead him to us. He stands at the center of the carpet circle, facing us. The little redheaded one winks at him, and he smiles adoringly at her, the way a father might smile at his young daughter. But she’s not his daughter. He intends for her to carry his children. I feel nauseous. It would be defiant enough just to vomit on his polished black shoes. But I haven’t eaten any of the food Gabriel has brought me since my first day here, and vomiting won’t win me any favoritism. My best chance at escape will be to earn Linden’s trust. The sooner I can pull that off, the better. The man in white robes begins to speak, and the music fades to a stop. “We are gathered here today to join these four souls in this sacred union, which will bear the fruit for generations to come . . .” As the man speaks, Linden looks us over. Maybe it’s the candlelight, or the mellow evening breeze, but he doesn’t seem as menacing as before, when he selected us from the lineup. He’s a tall man with small bones that make him seem almost frail, childlike. His eyes are a bright green, and his glossy black curls hang like thick vines around his face. He is not smiling, and not grinning the way he did when he caught me running in the hallway. For a moment I wonder if he is even the same man. But then he opens his mouth, and I see the glimmer of gold in his teeth, way in the back molars. The domestics have stepped forward. The man in white has stopped talking about how this marriage will secure future generations, and now Linden is addressing us each by name. “Cecily Ashby,” he says to the little bride. Elle opens her clasped hands, revealing a gold ring. Linden takes this ring and places it on the small bride’s hand. “My wife,” Linden says. She blushes and beams. Before I can process what’s happening, Deirdre has opened her hands and Linden has taken the ring from her and slipped it onto my finger. “Rhine Ashby,” he says. “My wife.” It doesn’t mean anything, I tell myself. Let him call me his wife, but once I’m on the other side of the fence, this silly little ring will mean nothing. I am still Rhine Ellery. I try to let this thought sink in, but I’ve broken into a cold sweat. My heart feels heavy. Linden catches my eyes with his, and I meet his stare. I won’t blush or flinch or look away. I won’t succumb. He lingers a moment, and then he’s on to the third bride. “Jenna Ashby,” he says to the next girl. “My wife.” The man in white says, “What fate has brought together, let no man tear asunder.” Fate, I think, is a thief. The music starts up again, and Linden takes each of our hands long enough to guide us down the steps, one at a time. His hand is clammy and cool. It’s our first touch as husband and wife. As I move, I try to get a good look at the mansion that has imprisoned me these past few days. But it’s too massive, and I’m standing too close to see more than one side of it, and all that register are bricks and windows. I think I see Gabriel, though, for a moment as he passes one of the windows. I recognize his neatly parted hair, his wide blue eyes watching me. Linden leaves us after that, disappearing somewhere with the first generation man he’d approached with. And the brides are herded back into the mansion. There is ivy growing along it, though, and just before I’m inside, I reach out and grab a small piece of that leafy green plant and close it in my fist. It makes me think of home, even if ivy no longer grows there. Back in my bedroom I hide the ivy in my pillowcase before Deirdre begins fussing over me. She helps me out of my wedding gown, which she folds neatly, and then begins to spray me with something that at first attacks my senses and makes me sneeze, but then recedes into a pleasant rosy scent. She makes me sit on the ottoman again and opens the makeup drawer. She scrubs my face clean and begins again, this time painting me in dramatic reds and purples that make me appear sultry. I like it even better than the earlier look; I feel like my anger and bitterness have been manifested. I’m dressed in a fitted red dress that matches the color of my lips, with black lace around the collar and capped sleeves. The dress only falls to about midthigh, and Deirdre tugs at the material to be sure it drapes properly. While she’s doing this, I step into yet another pair of ridiculous heels, and stare at myself in the mirror. Every curve of my body protrudes through the velvet material—my breasts, hipbones, even the ghost of ribs. “It’s a symbol that you’re no longer a child,” she explains. “That you’re ready for your husband to come to you at any time.” After that I’m led to the elevator and down more hallways, until we reach a dining hall. The other brides are dressed in black and yellow versions of my outfit, respectively. All of us are wearing our hair down now. I’m seated between them at a long table beneath crystal chandeliers. Cecily, the redhead, is looking excited, while Jenna, the dark-haired one, seems to be coming out of her melancholy. Under the table her hand brushes mine, and I’m not sure if it’s accidental. We all smell like flowers. Bits of glitter still fall from Cecily’s hair. House Governor Linden arrives, with the first generation man again. They make their way to us, and Linden raises each of our hands to his lips for a kiss, one at a time. Then he introduces the man, his father, as Housemaster Vaughn. Housemaster Vaughn also kisses our hands, and it takes some effort for me to keep from squirming at the feel of his lips, which are papery and cold. It makes me think of a corpse. As a first generation, Housemaster Vaughn has aged well; his dark hair has only sparse flecks of gray, and his face is not horribly wrinkled. But his skin is a sickly pallid shade that would make even Rose appear vibrant by comparison. He does not smile. Everything about his touch is chilled. Even Cecily becomes subdued by his approach. I feel a little better when Linden and Housemaster Vaughn are seated at the opposite end of the table, with Linden facing us and Housemaster Vaughn at the head. We brides sit in a row beside one another, and the other table head is left vacant. I suppose it’s where Linden’s mother would have sat, but since she’s not here, I assume she’s dead. When Gabriel enters the room balancing a stack of plates and utensils, I find that I’m relieved by his presence. I haven’t spoken with him since last night, when he limped out of my room. I’ve been worrying that my actions led to his punishment, and that Housemaster Vaughn will decide to lock him in a dungeon for the remainder of his life. My worries always lead to dungeons; I can’t imagine a worse thing than to be imprisoned for the rest of one’s life, especially with so few years to enjoy what little there is.","sourceLink":"https://allnovel.net/wither-the-chemical-garden-1/page-6.html","bookId":1761,"book":{"id":1761,"title":"Wither (The Chemical Garden #1)","description":"Storyline: Wither (The Chemical Garden #1) By age sixteen, Rhine Ellery has four years left to live. She can thank modern science for this genetic time bomb. A botched effort to create a perfect race has left all males with a lifespan of 25 years, and females with a lifespan of 20 years. Geneticists are seeking a miracle antidote to restore the human race, desperate orphans crowd the population, crime and poverty have skyrocketed, and young girls are being kidnapped and sold as polygamous brides to bear more children. When Rhine is kidnapped and sold as a bride, she vows to do all she can to escape. Her husband, Linden, is hopelessly in love with her, and Rhine can\u0027t bring herself to hate him as much as she\u0027d like to. He opens her to a magical world of wealth and illusion she never thought existed, and it almost makes it possible to ignore the clock ticking away her short life. But Rhine quickly learns that not everything in her new husband\u0027s strange world is what it seems. Her father-in-law, an eccentric doctor bent on finding the antidote, is hoarding corpses in the basement. Her fellow sister wives are to be trusted one day and feared the next, and Rhine is desperate to communicate to her twin brother that she is safe and alive. Will Rhine be able to escape--before her time runs out? Together with one of Linden\u0027s servants, Gabriel, Rhine attempts to escape just before her seventeenth birthday. But in a world that continues to spiral into anarchy, is there any hope for freedom?","cover":"https://allnovel.net/images/wither-the-chemical-garden-1.jpg","author":"Lauren DeStefano","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/wither-the-chemical-garden-1.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:23:04 AM"}}
