{"id":40911,"no":20,"title":"CHAPTER XXI A WASTREL","content":"It was scarcely dawn when I rode out of Buyda on my way back to Sch?nvalhof. With a feeling of relief I struck the high road and entered the open country. Buyda, beautiful city though it undoubtedly was, had become hateful to me as a veritable net of sinister intrigue, with that great relentless spider sitting in the midst marking down his prey. I reached Sch?nvalhof without incident, and before many people were astir. The house was closed, and I was considerably reassured (for I had my fears), after ringing a loud peal at the bell, to see presently Lindheim’s face at the window. He seemed more relieved than even I, and ran down to let me in. “A delightful night I have passed!” he exclaimed. “I made sure when midnight came and you had not returned, that you had paid the penalty of your rashness. Well, what news?” I related the events of my day in Buyda; my interview with Rallenstein, my visit to the Baroness and meeting with Count Furello, and lastly, the episode of the fan. “You will not think me a broken reed, my dear Lindheim,” I said in conclusion, “when you learn I have only called in here on my way to the Geierthal. That girl is in awful danger, is quite helpless in the hands of these villains, and I should be worse than a coward if, after having received that appeal, I should ignore it and make no attempt to save her.” [Pg 132] “I quite agree with you,” he said, “but fear you can do nothing. There is no law to which you can appeal, which is not at once over-ruled by the higher law of political expediency. Count Furello is, as we know, the Jaguar’s paw. Although he holds a good position in his part of the country, they say Rallenstein knows enough against him to bring him to the scaffold to-morrow if he wished. No doubt he has been watching us here, superintending the work of his confederates, and has only left because he was wanted for this business, and his master sent for him. You will run a great risk, my friend.” “That is nothing,” I replied; “any present danger is better than a life-long self-reproach. My only regret is that it involves my deserting you.” He laughed. “Not necessarily. For, if you are determined to go, I would ask you to let me come with you.” “You!” I thought a moment. “I am not sure that it would be a bad move for you. You cannot stay here much longer.” “Alone? no. It is nervous work enough with a friend. I have not slept all night. Let me come with you and meet my danger in the open if it has to be met.” “You don’t value Rallenstein’s assurance, then?” “I am quite sure my life would not be worth twenty-four hours’ purchase in Buyda.” “Then come, and the sooner we start the better. I fear there is not much to be done, but we shall at least be company for each other. How far is the Geierthal from here?” “Not much more than thirty miles.” “Then I propose we make an early start, take a long rest by the way, and get to the place towards evening. We can best reconnoitre after dark.” After a substantial breakfast, we hurriedly made [Pg 133]preparations for having some necessary baggage sent to us under an assumed name at Carlzig, the nearest town to the Geierthal, provided ourselves each with a serviceable revolver and a bag of cartridges, and set out. Guns and fishing-rods were to be sent after us, our ostensible reason for the excursion being sport, which abounded in those regions. On our way we turned aside to the house of the village priest, whom Lindheim requested to take in hand the arrangements for the funeral of poor Szalay. The priest had been an old friend of Lindheim’s father, so could be trusted with the true explanation of Szalay’s sudden death, and the necessity of our departure. He promised to receive any of the family as Lindheim’s representative, and to act in the whole matter as his discretion might dictate. This settled, we rode on; but before leaving the village a suspicious curiosity impelled me to turn aside for a few minutes and to climb the rocks, the scene of my narrow escape two days before. With some difficulty I succeeded in mounting to the brow whence the great mass had been dislodged. For my idea now was that this fall had not been accidental, and it needed only a cursory glance to confirm that suspicion. The rock had evidently been bored, and the upper part cleft and hurled down by an explosive, a small charge having probably, from its over-hanging position, sufficed to effect its dislodgment. So sure of impunity had my would-be murderers obviously considered themselves, that they had not troubled in any way to remove the evidences of their design. My feeling now was almost one of indifference, since this was only another proof of what we knew well—the cunning, relentless malignity with which we were being pursued. Thus satisfied, I quickly rejoined Von Lindheim, and we soon had left the village far behind us. After [Pg 134]that we slackened our speed, taking frequent rests, and, as we had planned, towards evening found ourselves in a little hamlet about a mile from the Monastery of the Geierthal. We were more lucky than we anticipated in finding a fairly comfortable roadside inn, where we took up our quarters and ordered dinner. While the meal was preparing I went out for a stroll along the valley to see if a glimpse was to be had of the Monastery. After walking for about twenty minutes I came to a point where the pine-covered hills on one side opened out, falling away and leaving a great circle of flat country of, perhaps, a mile in diameter, after which they closed up again and the valley resumed its course. It was here in this lower ground that I rightly guessed the old Monastery must be; it was just such a spot as the monks were wont to choose for their dwelling-place, and the next turn in my path gave me a peep of a great house showing here and there between the trees which grew down to the edge of a broad band of water which encircled it. Remembering the Baroness’s description of the Monastery on an island I needed no further guide. A few steps on brought me to a gate in a fence which evidently ran round the property. The path I had taken was, then, one leading to the Monastery. “I won’t trespass this side of dinner,” I said; “but it is just as well to have got my bearings by daylight.” So after a good look round I turned and retraced my steps to the inn. Von Lindheim met me with a rather perturbed face. “More complications,” he said; “fate is dogging me still. The Jaguar’s long paw has already reached to the Geierthal.” “What do you mean? What has happened?” [Pg 135] “A stranger is at the inn already. An Englishman, or, at least, one who speaks English.” “Another spurious Professor—of what?” “A sportsman this time.” “Speaking English?” “Singing it.” “Oho! Let us investigate. I may be able to tell the genuine article better than you.” We went in. In the passage Lindheim touched me on the arm and I stopped. From the inner room came a man’s voice, an Englishman’s evidently, singing in a more or less burlesque fashion: “The plighted ring he wore Was crushed and wet with gore. Yet ere he doied He bravely croied I’ve kept the vow I swore-hoa-hore, I’ve ke-he-hept the vo-how-how I swore.” “An Englishman?” I asked the landlord who came to tell us our dinner was ready. “Yes, an Englishman,” he answered. “He shoots the birds and hares for miles.” “He lives here?” “No, mein Herr. He lives up in the hills, a good step from here. But he always comes to my house when he is near for a schoppen of lager-beer or a glass of schnaps.” “Ah! Then he has been here for some time?” “A month, two months, I think.” I nodded to Lindheim, “I think it is all right. But we will go in and see.” He was sitting at a table by the window and filling his pipe as we entered. An Englishman, certainly, I thought, and of a type not uncommon. A darkish, sunburnt complexion, fearless blue-grey eyes, a drooping moustache, and perhaps a trifle too much heaviness in the jaw; the sort of man you see scores [Pg 136]of in the West End during the summer months and very few in the winter, the type from which our best soldiers and sportsmen are drawn. He was dressed in a workmanlike if rather shabby shooting-suit, and his gun and cartridge-bag stood in the corner beside him. On our appearance he looked up casually, and as his eye rested on me a slight beam of recognition came into it, such as one Englishman gives another when they meet abroad. I bowed, and we both seemed inclined to laugh. “I think we are fellow-countrymen,” I said. “Englishmen are apt to meet in out-of-the-way places.” “Ah, yes,” he replied with a slight drawl. “Last place I expected to run against one in. Nothing to see; all nature and no art, and the nature not quite on the tourist scale.” “We are not exactly tourists.” “You know this part of the world?” “No. We have come over to try and get sport of some kind.” “Good man! I’ve been blazing away for the last six or eight weeks. I’m shooting for a game shop in Carlzig. So much a head, with board and lodging and a decent cottage thrown in. Like our dealers’ moors in England, only they do you better at home; prices are higher. Will you join me, sport or profit? As it is I am in danger of forgetting my mother tongue. Haven’t heard the English language in all its native purity from any lips but my own for months.” I said we should be glad to have a day with him. Charged as I was with suspicion of everyone I met, I could not bring myself to think this man was not genuine; so far as his nationality went, he certainly was. “My name is Strode,” he said, “Hamilton Strode. [Pg 137]My people are Hampshire, but they’ve cut my painter and I’m adrift with one oar; ’tother slipped overboard and I couldn’t be bothered to pick it up. Still, I’m keeping on with a certain amount of vim. I was in the Scots Fusiliers till the Hebrews became too oppressive and I got a hint. Our Colonel, old Lampton, said he didn’t mind a Jew or two as a general thing; in a crack regiment it was to be expected, but when a man couldn’t go into his officers’ quarters without tumbling over the whole twelve tribes of Israel it was coming it too strong. People were beginning to make unkind remarks about the S. F. G.’s adding Houndsditch to their territorial designations, and he’d be pole-axed if the thing should go on. So I was run out, like many a better chap.” We expressed our sympathy. “Now,” he went on, “I dare say I am a queer member, a bad lot, and all that; but if you’ll give me your company I can show you some sport, the best in these parts, and I’ll give my parole not to try to borrow money of you.” “All right,” I laughed, “we’ll come.” And with that assurance he presently went off in great content. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/2943/80879.html","bookId":1076,"book":{"id":1076,"title":"The Red Chancellor","description":"简介： Of what? It was I who asked the question, curious to hear what penalty attached to the handsome Rittmeisters temerity.The three men gave glances at each other, as though inquiring which of them could answer. My friend Von Lindheim broke the pause, re...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2943","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
