{"id":40918,"no":27,"title":"CHAPTER XXVIII THE PRIOR’S ROOM","content":"The Count and I went back to the other room, where we found his sister playing with a great dog of curious breed, something between a wolf-hound and a blood-hound. Coffee was brought in, and the hostess begged we would smoke there. The dog came to me, treating my advances, however, rather suspiciously. I broke up a small cake and threw him morsels, which he devoured. Then something prompted me to try him with one of the sweetmeats in my pocket. Taking an opportunity when my worthy host was not favouring me with his attention, I threw the brute one, which, like the scraps of cake, he caught and swallowed. This, as it turned out, was no bad move of mine. Presently I thought it well to appear drowsy and express a wish to retire. At that moment Bleisst glided in and announced that my room was ready for me. I bade good-night to my hostess, who seemed studiously to avoid meeting my eyes, then left the room with Bleisst, whom the Count desired to show me the way and see that I wanted nothing. On reaching my room I found it furnished with everything I could need, and was glad when the door was shut upon my conductor. So the mystery of Professor Seemarsh was now cleared up beyond all doubt. After a few minutes’ [Pg 175]review of the evening’s events, I set myself to make a survey of the Prior’s room. And a gloomy chamber it was, although made as cheerful as possible by a profusion of wax candles. What seemed its ordinary furniture was old, gaunt, and dilapidated, but this was supplemented by some articles of a quite modern type. The bed was a great four-posted one with dark hangings, which added to the general sombreness. Near the other end of the room stood a massive square wardrobe of dark oak. I opened this. It was a somewhat elaborate piece of furniture, panelled and carved inside as well as out. A good roomy receptacle for clothes, fitted round with hooks, all empty save one, from which hung what seemed an old riding cloak. There was nothing else remarkable in the room with the exception of several large pictures which, framed in black wood, hung high on the walls. One of them particularly attracted my notice. It was a rather striking full-length portrait of a young man, in what seemed a student’s dress of the last century. I don’t know what there was remarkable about it, except that it was painted with strength, and was one of those portraits which, without having seen the originals, one feels sure must be spirited likenesses. He, whoever he was, had evidently been a gay young fellow, a dandy probably among his compeers; he had large laughing eyes, which rather contradicted the sobriety of his attitude, assumed no doubt merely for the ordeal of the portrait painting. Having finished my survey of the room, I began to consider as to the best way of passing the first hours of the night. I was supposed to be poisoned, or at least drugged; there was no doubt now that my life was sought, and my careless admission in the afternoon that my friends were ignorant of my whereabouts made my disappearance safe. [Pg 176] I wondered if at that moment the Count’s familiars were digging a grave for me in the wood. Probably the unfortunate priest had had no friendly warning against the sweetmeats. The reason of mine was a puzzle about which I had then no time to speculate; my one thought had to be for action. The peril in which I stood quite removed any scruples I might have had with regard to letting anything stand in the way of my purpose. I looked carefully to my revolver, saw that the door of the room was fast locked, and set myself to wait until the night was further advanced. It then occurred to me that as I, or any other victim of the Count’s polite hospitality, might reasonably be expected to lock the door, there should naturally be some other means of admittance for those who came in to make away with their damnable work. Accordingly I took one of the candles and made a thorough search round the room. There was no sign of any secret door or sliding panel. I examined the floor all over, especially under the bed, but to no purpose. So at last I gave up the search, and fell to speculating how long it would be before they came to find me. Would they wait till the morning? They had certainly not done so in the case of that poor priest. Anyhow, thought I, they will have a somewhat astonishing reception when they do come. Some books had been placed on a shelf for me, two or three of the newest French novels, and an English booklet of light essays. I took up this last with the idea that reading would be more likely to keep my nerves steady than letting my imagination run on the chances of the night. So, extinguishing all the candles but two, I threw myself on the bed and began to read. I had turned over a good many pages, when, a little weary of reading, I let the book fall, and lay on my [Pg 177]back wondering how best to fight against the drowsiness which, after a fatiguing day, was stealing over me. Suddenly the problem was solved by a sight which put me keenly on the alert. My eyes happened to be casually fixed on one of the carved wooden rosettes which extended at intervals round the frieze of the wall. The particular rosette in my line of sight was slowly revolving. My first idea was to regard this as an ocular deception; then, watching it attentively, I concluded that such was not the case; the rose was actually turning. It gradually receded, till it disappeared altogether, leaving in its place a dark, circular aperture; doubtless a spy-hole commanding the whole room. Prepared for this, I had turned over, bringing my head into a higher position where it would be hidden from the expected watcher by the fringe of the bed-canopy. Through a gap in this I could still, unseen, keep the peep-hole under observation, and could detect, at least so it seemed, a pair of malignant eyes glaring from its black recess. So the time for action was at hand. I turned sleepily on my pillow, and blew out the lights. That would put an end to the watching, which was intolerable. Then I listened. Not a sound. The very silence showed me that my nerves were in order—not even imagination conjured up the slightest movement. After waiting a few minutes, I quietly slipped out of bed, and resumed such of my clothes as I had put off. I took my revolver, matches and a candle, and made ready to meet the danger I felt was coming. From what quarter it would appear I was quite ignorant, and not a little curious; anyhow, I was not going to stay where it would expect to find me. I crossed the room, and took my stand beside the square wardrobe, ready for a dash, and listening intently. I had some time to wait, the most exciting suspense, perhaps, of my life. There I stood in pitch darkness, straining my ears for the sound I knew must surely be coming. But when? Whence? I waited on grimly, revolver in hand, with every faculty on the alert, for the slightest indication that the room contained a living being beside myself. At last it came. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2943/80886.html","bookId":1076,"book":{"id":1076,"title":"The Red Chancellor","description":"简介： Of what? It was I who asked the question, curious to hear what penalty attached to the handsome Rittmeisters temerity.The three men gave glances at each other, as though inquiring which of them could answer. My friend Von Lindheim broke the pause, re...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2943","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
