{"id":40926,"no":35,"title":"CHAPTER XXXVI RESTORATION","content":"My distress and grief at the sight were beyond description. That the brave fellow who had been such a tower of strength and to whom we owed certainly our lives should have fallen in the moment of victory caused me the keenest grief I had ever felt. But happily it was not so bad as I feared. He was alive, his pulse was distinctly beating, so I rushed upstairs for a light and the brandy. On returning with Asta we found that poor Strode’s coat and shirt were saturated with blood. The sight, though alarming enough, gave me hope that he had merely fainted, and this proved to be the case. The wound in his shoulder, which he had in those critical moments laughed off as a mere graze, was deep if not serious, and had bled profusely. The man’s pluck and grit had been wonderful to enable him to fight on as he did, laughing and jesting, under such pain and weakness. In a few minutes our efforts at restoration were successful, and I think the most gratifying sight of my life was that of those brave grey eyes slowly opening. “It’s all right, Strode, dear fellow! Why didn’t you say you were hurt?” For answer he laughed and tried to rise, but the weakness was too great. “I’m all right directly,” [Pg 231]he murmured. “Don’t worry about me. The Fr?ulein——” She was busy contriving a bandage for his wound. “We are all quite safe,” she said cheerily. “You must keep quiet. Mr. Tyrrell is going to drive now and you will finish the journey in the carriage with me.” He smiled. “What are the brutes doing? Hope you hammered them?” I told him how they had been beaten off, and the news seemed to do him even more good than the brandy I was giving him. We washed and dressed his wound to the best of our skill; then, as haste was everything, I went out to prepare for our departure. I had taken but a few steps outside the house when I stumbled over the body of a man. He was evidently dead, and from the shortness of his stature I judged him to be the one who had dug the grave in the wood. I went on to the shed where we had left our carriage and horses. As I expected, our pursuers had done their best to deprive us of the means of flight by shooting our poor animals. The intention had, however, been very imperfectly carried out. Both horses lay on the ground, dead, as I thought, but it turned out that only one had been killed. The other on my approach began to kick and struggle. When released from the harness which kept it down beside its dead companion it struggled to its feet whinnying with terror. I did my best to soothe it while looking for its wound. None was to be seen and I soon convinced myself that by some lucky accident the animal was practically unhurt. So far good; still, one horse would not be of much use on those rough heavy roads. I wondered whether our pursuers had left any of their own steeds behind them; there would assuredly be more than one with no [Pg 232]rider to carry back to the Geierthal. I ran into the house, explained the situation, and told them I was going to hunt about for a second horse. I argued that when the party dismounted to advance and attack us they would naturally have tied up their horses at the roadside near by, and it was just probable that thereabouts one might be found. The common horses of those parts, such as the Count’s men would ride, were hardly valuable enough for their loss to be any great consideration, and if Bleisst had really been wounded, his chief would have enough to do to get him home without the trouble of trying to lead three or four horses as well. No doubt they would have been turned loose, but I might get hold of one for all that. My conjecture proved correct. I had gone but a short distance in my search when suddenly there was the noise of a rush just in front of me, and a great dark object sprang up into the road. It was an exciting moment, with the full suspicion of a trap in my mind. With my revolver ready I stood still and watched. The horse had trotted off nervously; he now stopped and gave a low neigh. Feeling pretty sure that he was alone I went forward cautiously. It was risky, but as it turned out I was safe enough. Having been used to horses all my life I knew how to give this fellow confidence and get hold of him. Then I led him to the carriage, put on him the dead one’s harness, and all was ready for a start. Fr?ulein Asta was greatly relieved when I returned with an account of my success, since every moment we delayed obviously increased our danger. Happily, poor Strode seemed much easier and was in quite high spirits. Between us we bore him out to the carriage, making him as comfortable as pos[Pg 233]sible; then I led the horses to the road, mounted the box, and we resumed our journey. I have often thought since that it would have been some satisfaction to have found out how many of the Count’s ruffians we really did send to their account, and no doubt had not my love been with us I would have risked a ten minutes’ search to satisfy myself. As it was we had to be content with the inference that the leader would not have abandoned the attack had not the party been well-nigh annihilated. The fear of immediate pursuit was now removed, still no time was to be lost, and I kept my oddly-matched pair swinging along at the best pace I could get out of them, resolved that nothing but dire necessity should cause another halt before we cleared the frontier. That—the nearest road out of the country—was all we could think of then; it would be time enough to determine on our after destination when we were once safe beyond the limit of the Jaguar’s spring. So we pushed on through the night, on and on till blackness turned by imperceptible degrees to grey, dark at first, then lighter and lighter till the red streaks of dawn at length made the landscape clear. On and on we rattled, through still sleeping villages, becoming more wakeful as we and time went on, past yawning peasants driving forth their primitive ox-wains and ploughs; on and on, every mile making our hearts lighter and raising our hopes as it brought us nearer to the frontier. Strode was bearing the rough journey better than we could have hoped; a simple wound to a man in good health and spirits is not, after all, a very serious matter. At length, while the morning was yet young, we came in sight of the town of Bradenfort, which we knew to be but five or six miles from the frontier. [Pg 234]Our jaded horses were now at the last stage of fatigue, and I made up my mind that we must risk a stoppage to procure fresh ones. After all, that danger was less than the otherwise inevitable one of a breakdown, and the time we should lose over the business would be made up afterwards on the road. Accordingly, after entering the town in sorry fashion, we pulled up at a likely inn, where I made an exceedingly bad bargain for a new pair of horses, leaving the others as a part—a very insignificant part—of the price. But we were now able to bowl out of the town in refreshing style, and knew that, bar accidents, we were safe. In a short hour we were at the frontier, had safely passed the barrier, and, with intense relief, found ourselves beyond the jurisdiction of his grim Excellency the Chancellor Graf Rallenstein; although, if what I had learned at the Monastery were true, we had less to fear now from him than from Count Furello. Still, strong wills do not love to be successfully thwarted, and even statesmen who live for their country are not always above the vindictive passions of meaner men. We now made more leisurely for the nearest town, where we could rest and decide on our next move. Moreover it was high time that we should put Strode into the hands of a surgeon. By noon we were comfortably quartered in the best rooms of the Adler-Hof at Rannsdau; the doctor had pronounced the loss of blood the greatest inconvenience that Strode’s wound was likely to cause him, and we could reflect with restful satisfaction upon a good night’s work. The problem now was to communicate with Asta’s parents, and this was a business which in several ways might be fraught with danger, more particularly to the Fr?ulein herself. It was, on the other hand, clearly my duty to restore her to her [Pg 235]family with as little delay as possible; but it seemed for the moment difficult to take any steps in that direction without again courting the danger she had just escaped. But the difficulty was solved, and most happily as it turned out, by a feasible suggestion made by Asta herself. We were now within a comparatively short distance of the Italian frontier. At Verona an aunt of hers lived. She might find a pleasant asylum there until her parents had been communicated with. The idea was a happy one, and a few hours found us on our way to Verona. Poor Strode we were obliged to leave behind us, but I was fortunate enough to hear of an English clergyman in the place, whom I sought out and to whose good offices I commended my friend. Not exactly the companion, perhaps, the devil-may-care Strode would have chosen, but at least he would have some one to chatter English with. On our arrival at Verona we agreed that Asta should remain for awhile at the hotel while I went on alone to tell her aunt the great news. I hardly know why we determined on this course, but it was well that we did so. For, on being ushered into the Signora Reballi’s drawing-room, I was brought face to face with two people in deep mourning, who, to my embarrassment, were made known to me as General and Madame von Winterstein, Asta’s parents. As I recovered from my surprise I bowed and said how fortunate I was to meet them, as I had lately come from Buyda, and the very reason of my visit was to acquaint the Signora with certain facts connected with the fate of Fr?ulein Asta von Winterstein. My words had naturally a great and not altogether happy effect on her parents, and the General asked me, in some surprise, with a tinge of suspicion, [Pg 236]how I came to know anything about it, and particularly Signora Reballi’s relationship to his daughter. To fence his question was idle, to blurt out the truth would have been dangerous, so I asked him to let me first of all speak a word to him in private. To this he acceded with an increasing suspicion and led the way to another room. “You are sure,” I began, “that your daughter was killed in a carriage accident on the Salenberg road?” “Unhappily; although——” “The body has not been found. That in itself should leave room for doubt.” He looked at me so strangely that I began to fear the effect of the news. “What do you mean?” he asked hoarsely. “Tell me what you have to say.” “That there is no need to abandon hope.” “Ah!” he cried. “You have reason to doubt? No! no! In Heaven’s name, speak, monsieur. What do you mean?” “There is,” I said, “great doubt.” Then he seemed to see intuitively what I was aiming at. By what must have been an intense effort he restrained his excitement and said quite quietly, “You have come to tell me that my daughter is alive?” I smiled, and at my smile he broke down and turned away. “It is a long and extraordinary story,” I said, “but the end of it is that Fr?ulein Asta is alive and in Verona.” “Thank God!” he half sobbed. “Thank God! I must see her. Let me——” “I will bring her to you. But Madame von Winterstein——?” “Ask my wife to come to me here,” he said [Pg 237]the fever of excitement getting stronger hold of him every moment. “She must hear the good news from my lips. Ah, God be thanked! My Asta comes back to us from the grave.” I did as he wished, then drove off for Asta. In less than half an hour mother and father were kissing with tears of joy the daughter whose tragic fate they had mourned with such bitter sorrow. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2943/80894.html","bookId":1076,"book":{"id":1076,"title":"The Red Chancellor","description":"简介： Of what? It was I who asked the question, curious to hear what penalty attached to the handsome Rittmeisters temerity.The three men gave glances at each other, as though inquiring which of them could answer. My friend Von Lindheim broke the pause, re...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2943","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
