{"id":18932,"no":29,"title":"CHAPTER XXIX. SIMON DODGE.","content":"Andy quickened his pace until he found himself walking beside the old gentleman. He was in doubt how to address him, in order to ascertain whether it was really his mother’s uncle. If he were not, he must be on his guard not to say anything which might excite the suspicions of any one as to his having a special purpose in visiting Cato. The way was made easy for him, however. The old man was Simon Dodge, and he was in daily expectation of the appearance of his niece’s son. When he saw Andy, in his traveling garb, with his little bundle of clothes under his arm, his eyes lighted up with hope, and he immediately accosted him. “Where are you traveling, my boy?” he asked, eagerly. “I have come from the East,” answered Andy. “I shall stay here, if I can find a place.” “Would you be willing to work on a farm?” asked the old man. “Yes,” answered our hero. “I hear that{176} there is a farmer named Brackett who wants to hire a boy. Do you know where he lives?” “Yes—yes, I can tell you. I am Mr. Brackett’s father-in-law,” said the old man, quickly. Andy looked about him cautiously, to make sure that no one could overhear him, and said, in a low voice: “Then you are my mother’s uncle—Mr. Dodge!” The old man’s face lighted up with satisfaction. “So I thought,” he answered. “I thought you were Mary’s son as soon as I looked at you. My dear boy, I am glad, heartily glad, to see you!” Andy looked up in the old man’s face, and he saw there an expression of a kind and amiable disposition. He could understand how such a man should have allowed himself to be imposed upon by a selfish and unscrupulous man like Brackett. “I am glad to see you, Uncle Simon!” he said. “I hope I may be able to be of service to you.” “You seem like a strong, active boy,” said the old man, surveying, with approval, the sturdy frame and manly, handsome features of his great-nephew. “Yes,” returned Andy, smiling, “I am tolerably strong.” “What is your name?”{177} “Andrew Gordon; they generally call me Andy.” “I should like to call you by that name, but it will be more prudent to go by some other.” “You may call me Henry Miller, Uncle Simon.” “Henry Miller? I will try to remember it. But you mustn’t call me Uncle Simon; that would ruin all, if Mr. Brackett should hear it.” “I’ll be cautious—never fear! Can you advise me how to act? Shall I call at the farm to-night?” “Yes. Mr. Brackett is looking out for a boy. His boy left him this morning.” “I know it.” “You know it?” said the old man, in surprise. “How did you hear of it?” “I met Peter on the road and treated him to a dinner.” “Indeed! What did he say about leaving?” “He doesn’t seem to be in love with Mr. Brackett,” laughed Andy. “He says you are a nice old gentleman.” “Yes; Peter and I always got along well together.” “What sort of a boy is he?” asked Andy, with some curiosity. “He’s not a bad sort of boy; he liked to play now and then, but he is as good as the average. Mr. Brackett expects too much of boys.”{178} “I suppose he will expect too much of me.” “I am afraid you won’t like the place,” said Mr. Dodge, anxiously. “But bear in mind, you shall have all the money you want, only Brackett mustn’t know anything about it. We will have a secret understanding together, Andy—I mean Henry.” “Yes, sir. I wouldn’t stay, if it were not for the sake of helping you.” “Thank you! It will make me feel better to think I have one friend in the house; only we must be cautious.” “Uncle Simon,” said Andy, boldly, “why do you stay here with this man? My mother asked me to invite you to come back with me to Hamilton. Our house is small, but we can make room for you. You won’t have anything to complain of there, and you can leave your money where you like. You won’t have any hints from us.” Mr. Dodge’s face lighted up with pleasure, and he asked eagerly: “Will your mother be really willing to be trouble with me for the little time I have to stay on earth?” “She will be glad to have you with us,” answered Andy, emphatically. “If you were a man like Mr. Brackett—as I suppose he is—she wouldn’t want you; but I am sure we shall find you a pleasant visitor.” “It is what has come into my mind, my boy,” said the old man; “but I was afraid your{179} mother wouldn’t like it. I could ask nothing better. I am not happy where I am. Mr. and Mrs. Brackett are continually asking me for money and scheming to have me leave them what money I have left. Only this morning, Brackett was urging me to make a will, for he knows that, if I die, he is no relative of mine, and the law wouldn’t give him the money.” “You have given him the farm already, haven’t you, Uncle Simon?” “Yes; and a good farm it is. I not only gave it to him, but I gave him the stock and tools, and all I asked in return was that I should receive my board.” “I don’t think he has any right to complain.” “No, he has no right to complain; but he does complain. He pretends that the farm doesn’t give him a living, and is always wanting to borrow money.” “Do you let him have it?” “Sometimes. I cannot help it, he is so importunate.” “Does he ever pay you back?” “Never!” said Mr. Dodge, emphatically. “He pretends he can’t.” Andy looked the disgust he felt. “Uncle Simon,” he said, “you treat him altogether too well. I wouldn’t give in to him that way.” “And I suppose you think I ought not to?” “Yes, I do think so.”{180} “Andy, you don’t know what it is to be old and weak. When a man gets to be seventy-five,” said Simon, in a pathetic voice, “he doesn’t want to be at strife. He wants peace and rest. Twenty years ago, or even ten years ago, I should have been better able to resist Mr. Brackett; now he annoys and worries me.” “How long has he been trying to get you to make a will in his favor?” “For at least two years.” “I almost wonder you didn’t do it to get rid of him.” “I will never do that,” said Simon Dodge, with an energy that surprised Andy. “It wouldn’t be safe,” he added, lowering his voice. “Why wouldn’t it be safe?” inquired our hero, not without curiosity. “I believe Brackett and his wife would take care that they didn’t have to wait long for their money.” “You don’t mean to say that they would make away with you?” said Andy, startled. “I hope not—I hope not. But I don’t think it safe to expose them to temptation,” said Mr. Dodge, shaking his head. They had been walking slowly. At a point in the road, the prospect widened out before them. “That is where we live,” said the old man, pointing to a farmhouse, perhaps a quarter{181} of a mile away. “We had better separate here, for it is not best that Mr. Brackett should suppose there is any understanding or acquaintance between us. You might come round in about an hour and apply for a place. Be prepared to accept fifty cents a week.” “All right!” And he sat down by the side of the road to rest, for he was really tired, while the old man bent his steps toward home. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/2952/81173.html","bookId":462,"book":{"id":462,"title":"Andy Gordon The Fortunes of A Young Janitor","description":"简介： The Hamilton Academy, under the charge of Rev. Dr. Euclid, stands on an eminence about ten rods back from the street, in the town of the same name. It is a two-story building, surmounted by a cupola, or belfry, and, being neatly painted brown and wel...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2952","creation":"Aug 1, 2019 12:18:49 AM","modification":"Aug 1, 2019 12:18:49 AM"}}
