{"id":83681,"no":14,"title":"Page 14","content":"She cut over three lanes and took the next exit ramp. “It’s your lucky day. I happen to have an opening at two-thirty on Tuesday. But I expect you to make it to your first period class on time. I won’t accept that excuse for anything else.”\n “Yellow light. Yellow light!” And she ran right through the red. “Jesus Christ, you can’t drive.”\n “I’m afraid we’re going to be late.” She pulled into a crammed parking lot and found the first spot available. “We’ve got to book it.”\n She sprang out of her car and ran toward the town’s convention center. Unable to imagine one thing Mrs. Collins could offer me worth running for, I lazily followed. I breezed into the building a few seconds behind her and saw her enter an auditorium.\n I grabbed the door before it closed and blinked when the crowd applauded around me. Row upon row of chairs faced a large, wooden stage. The room was crushed with people. Mrs. Collins waved me over to the side and the two of us leaned against the wall. She whispered, “Good, we’re just in time.”\n A stout man in a shirt and tie propped his arms on the podium. “I have the privilege of introducing the Young Authors first-place winner in the second grade division, Jacob Hutchins.”\n My heart slammed past my rib cage as I searched wildly for my brother. There he was, speed-walking down the middle aisle from the back of the room to the stage. I took a step to follow him, but Mrs. Collins placed a hand on my arm and shook her head. “This is his moment.”\n I peeled my eyes off him to browse where he’d been sitting. Carrie and Joe sat next to his empty seat. Sitting on Carrie’s lap, Tyler rested his head on her shoulder and glanced around. Everything inside me twisted in pain and relief. My brothers. I was in the same room as my brothers.\n My eyes met Tyler’s and a smile tugged at his lips. I sucked in a breath in order to pull back the millions of emotions eating at me. Tyler remembered me. “Thank you,” I breathed, not sure who I was thanking or why—Mrs. Collins for bringing me here, Tyler for remembering me, or God for both of those.\n Mrs. Collins watched my reaction, but I didn’t care. I waved at Tyler and, to continue the miracle, he waved back.\n Joe caught the movement, glanced behind him and spotted me. His face paled and he shook his head at Tyler in reprimand while pointing at the stage. Tyler turned away.\n “He remembered you,” said Mrs. Collins.\n “If that dickhead had his way, he’d forget me.” I wanted to rip Tyler from their evil paws.\n Mrs. Collins sighed. “Language, Noah.”\n Jacob smiled from ear to ear when he shook the man’s hand on stage. The man then handed him a trophy. “Tell the audience about your book.”\n My little brother confidently walked up to a microphone his height and beamed to the crowd. “I wrote about the person I love the most, my older brother, Noah. We don’t live together so I wrote what I imagine he does when we’re not together.”\n “And what is that?” prodded the stout man.\n “He’s a superhero who saves people in danger, because he saved me and my brother from dying in a fire a couple of years ago. Noah is better than Batman.” The crowd chuckled.\n “I love you, too, lil’ bro.” I couldn’t help it. To see him standing there, still worshipping me like he did when he was five … it was too much.\n Jacob’s smile reached a whole new level of excitement. “Noah!” He pointed right to me. “That’s Noah. That’s my brother, Noah!” Ignoring his foster parents, Jacob flew off the stage and ran down the middle aisle.\n Joe lowered his head and Carrie rubbed her eyes. Jacob raced into my arms and the crowd erupted into applause.\n “I’ve missed you, Noah.” Jacob’s voice broke, bringing tears to my eyes. I couldn’t cry. Not in front of Jacob and not in front of Mrs. Collins. I needed to be a man and stay strong.\n “I’ve missed you, too, bro. I’m so proud of you.”\n I continued to hug Jacob as I searched for Tyler. He clung to Carrie and the sight dampened what should have been a joyous moment. Jacob was mine and the faster I could get Tyler away and help him remember his real family, the better.\n Echo\n I stood outside of the girls’ locker room, palms sweating and my foot tapping uncontrollably on the floor. Why had I told Dad I’d rejoined the dance team?\n My file. I wanted, no, needed, no, was totally obsessed with seeing my file. Today, Noah had passed me in the hallway, given me his wicked grin and mumbled, “Done deal.” He’d successfully changed his appointment time to the slot before mine. Now, we needed to hatch our half-baked plan. He somehow believed that combined, we could distract Mrs. Collins. Noah exuded confidence. Me? Not so much, but it was definitely worth a try.\n The door to the locker room opened and Natalie came out with two other senior girls. The two girls stopped laughing when they spotted me and forced smiles back on their faces. Natalie, on the other hand, shined at me like I’d hung the sun. “Get your butt in there and dress out, girl. Warm-up in five.”\n “I was just walking in.” Into a Stephen King novel. Young girl, tragically scarred, attempts to return to her normal life, only to find out her normal life doesn’t want her back. I entered the locker room, where all the lowerclassmen on the team gossiped and laughed.\n “Hi,” came a faint voice from the back of the room. Every single girl in the room froze and stared at me as if laser beams were going to shoot out of my eyes or even worse—I’d roll up my sleeves and show them my demon scars.\n “Hey,” I replied.\n I’d rather have watched reruns of bad seventies sitcoms than weave through this room to dress out, but standing there like an idiot didn’t seem like a great option either. Why couldn’t I have Noah’s confidence? He didn’t care what anybody thought.\n I lacked confidence, but I could pretend. I chanted in my mind, Pretend you’re Noah. Even better, biker chick Beth, held my head high and crossed the crowded locker room toward the bathroom where I intended to change in a private stall. Biker chick Beth confidence or not, there was no way I could change in front of them.\n Shaking off the tension that runway walk created, I shut the stall door and changed. If entering a locker room resembled the opening of a Stephen King novel, dance practice ought to be like starring in a horror movie.\n Thankfully, the locker room had emptied by the time I hurried to join warm-ups. In the hallway, two juniors giggled by the water fountain. “Can you believe that Echo Emerson is rejoining the dance team? What a nightmare.”\n “Like, because Luke is all over her it gives her an excuse to pretend she’s not a freak.”\n I ducked back into the bathroom. My heart in my gut, my stomach in my throat, my pretend confidence in tatters.\n WITH MY JEANS, BROWN COTTON shirt and tank top back on, I roamed the hallways. I had an hour to kill for five days a week until graduation. Maybe only four. I could move Noah’s tutoring session back to right after school on Mondays.\n I turned a corner and a part of my soul took a deep breath when I noticed the artwork littering the walls. I followed the trail of paintings and drawings to what used to be my favorite room—art. Several canvases rested on easels, waiting for their masters to return. A bowl of plastic fruit sat on a table in the middle of the easel circle.\n I assessed each painting in turn. I admired the way the first one used shadowing. The second one paid nice attention to detail. The third one?\n “Good to see you, Echo.” My old art teacher, Nancy, exited the connecting darkroom and weaved through the easels and tables toward me. She insisted that her students call her by her first name. She despised rules and formalities. Her hair, bleached blond with black streaks, was a testament to her attitude.\n I gestured to the third painting. “Abstract expressionist?”\n Her boisterous laughter vibrated in the room. She adjusted her black horn-rimmed glasses. “Lazy student who thought art would be an easy A. She claims to be an impressionist.”\n “What an insult.”\n “I know. I asked if she knew what an impressionist was and when she shook her head, I showed her your paintings.” Nancy stared at the mess in front of her as if trying to find something redeemable in it. “I’ve missed you.”\n Familiar guilt tiptoed through my insides. “I’m sorry.”\n “Don’t be, kid. It’s not your fault. Your father informed me you were no longer allowed to take an art class. I took that to mean I’d never see you.”\n I walked to the fourth picture. “Nice lines.”\n “Are you still painting?”\n Hoping to make it look like I was extremely interested in the color chosen for the banana, I tilted my head, but I wasn’t. The black hole in my mind widened, interrupting any thought of painting. “No, but I still sketch. Mostly in pencil. Some with charcoal at home.”\n “I’d love to see them.”\n Nancy snatched the sketchbook I pulled from my backpack. She sat on the table with the fruit and flipped it open. “Oh, Echo. Simply amazing.”\n I shrugged, but she missed it, too infatuated with my sketchbook. “We won.”\n She tore her eyes away from the sketches and stared at me in silence. I continued to busy myself with the other artists’ work. After a few seconds, she returned to studying my drawing of Grace. “No, you won. I was merely along for the ride.” She paused. “You remember?”\n “No.” Surely Nancy would take pity on me and fill in some of the gaps. “Were you there?”\n “Mmm, girlfriend. You’re itching to get me in trouble with your father and Mrs. Collins. Your father I could take, but Mrs. Collins?” She shuddered. “Between you and me, she scares me. It’s the friendly ones that’ll get you in the end.”\n I snickered, missing Nancy’s honesty. “I wish I could remember.” The fifth canvas was completely blank. The oil paints and brushes sat unused. “Do you mind?”\n In her classic deep-in-thought stance, Nancy rubbed the bottom of her chin. “He only said you couldn’t take an art class, not that you couldn’t paint.”\n I picked up a flat brush, dipped it into the black paint and made circles on the canvas. “It’s like I have this large black hole in my brain and it’s sucking the life out of me. The answers are in there so I sit for hours and stare. No matter how hard and long I look, I only see darkness.”\n I chose a fan brush and mixed black and white paint together to create different shades of gray. “There are edges around the black and every now and then a flash of color streaks out of the gray. But I can never really grasp any of the slivers of memories that emerge.”\n Clutching the paintbrush, I stared at the canvas that now represented my brain. “I wish someone would just tell me the truth and end the madness.”\n A warm hand pressed hard against my shoulder, causing me to blink out of my zone. Wow, five o’clock. Dad would kill me if I didn’t get home soon. Nancy kept her hand on my shoulder and her eyes locked on the canvas. “If this is madness, then madness is brilliant. Are you going to finish this?” \n","sourceLink":"https://allnovel.net/pushing-the-limits-pushing-the-limits-1/page-14.html","bookId":2752,"book":{"id":2752,"title":"Pushing the Limits (Pushing the Limits #1)","description":"Storyline: \n Pushing the Limits (Pushing the Limits #1) \n So wrong for each other …and yet so right. \n No one knows what happened the night Echo Emerson went from popular girl with jock boyfriend to gossiped-about outsider with \"freaky\" scars on her arms. Even Echo can\u0027t remember the whole truth of that horrible night. All she knows is that she wants everything to go back to normal. \n But when Noah Hutchins, the smoking-hot, girl-using loner in the black leather jacket, explodes into her life with his tough attitude and surprising understanding, Echo\u0027s world shifts in ways she could never have imagined. They should have nothing in common. And with the secrets they both keep, being together is pretty much impossible. \n Yet the crazy attraction between them refuses to go away. And Echo has to ask herself just how far they can push the limits and what she\u0027ll risk for the one guy who might teach her how to love again.\n \n","cover":"https://allnovel.net/images/pushing-the-limits-pushing-the-limits-1.jpg","author":"Katie McGarry","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/pushing-the-limits-pushing-the-limits-1.html","creation":"Oct 5, 2019 8:59:21 AM","modification":"Oct 5, 2019 4:52:59 PM"}}
