{"id":107217,"no":13,"title":"Page 13","content":"CHAPTER 38\\n\\n Sophie scrutinized Langdon in the back of the taxi. He\u0027s joking. \"The Holy Grail?\"\\n\\n Langdon nodded, his expression serious. \"Holy Grail is the literal meaning of Sangreal. The phrase derives from the French Sangraal, which evolved to Sangreal, and was eventually split into two words, San Greal.\"\\n\\n Holy Grail.Sophie was surprised she had not spotted the linguistic ties immediately. Even so, Langdon\u0027s claim still made no sense to her. \"I thought the Holy Grail was a cup.You just told me the Sangreal is a collection of documents that reveals some dark secret.\"\\n\\n \"Yes, but the Sangreal documents are only half of the Holy Grail treasure. They are buried with the Grail itself... and reveal its true meaning. The documents gave the Knights Templar so much power because the pages revealed the true nature of the Grail.\"\\n\\n The true nature of the Grail? Sophie felt even more lost now. The Holy Grail, she had thought, was the cup that Jesus drank from at the Last Supper and with which Joseph of Arimathea later caught His blood at the crucifixion. \"The Holy Grail is the Cup of Christ,\" she said. \"How much simpler could it be?\"\\n\\n \"Sophie,\" Langdon whispered, leaning toward her now,\" according to the Priory of Sion, the Holy Grail is not a cup at all. They claim the Grail legend - that of a chalice - is actually an ingeniously conceived allegory. That is, that the Grail story uses the chalice as a metaphor for something else, something far more powerful.\" He paused. \"Something that fits perfectly with everything your grandfather has been trying to tell us tonight, including all his symbologic references to the sacred feminine.\"\\n\\n Still unsure, Sophie sensed in Langdon\u0027s patient smile that he empathized with her confusion, and yet his eyes remained earnest. \"But if the Holy Grail is not a cup,\" she asked,\" what is it?\"\\n\\n Langdon had known this question was coming, and yet he still felt uncertain exactly how to tell her. If he did not present the answer in the proper historical background, Sophie would be left with a vacant air of bewilderment - the exact expression Langdon had seen on his own editor\u0027s face a few months ago after Langdon handed him a draft of the manuscript he was working on.\\n\\n \"This manuscript claims what?\" his editor had choked, setting down his wineglass and staring across his half-eaten power lunch. \"You can\u0027t be serious.\"\\n\\n \"Serious enough to have spent a year researching it.\"\\n\\n Prominent New York editor Jonas Faukman tugged nervously at his goatee. Faukman no doubt had heard some wild book ideas in his illustrious career, but this one seemed to have left the man flabbergasted.\\n\\n \"Robert,\" Faukman finally said,\" don\u0027t get me wrong. I love your work, and we\u0027ve had a great run together. But if I agree to publish an idea like this, I\u0027ll have people picketing outside my office for months. Besides, it will kill your reputation. You\u0027re a Harvard historian, for God\u0027s sake, not a pop schlockmeister looking for a quick buck. Where could you possibly find enough credible evidence to support a theory like this?\"\\n\\n With a quiet smile Langdon pulled a piece of paper from the pocket of his tweed coat and handed it to Faukman. The page listed a bibliography of over fifty titles - books by well-known historians, some contemporary, some centuries old - many of them academic bestsellers. All the book titles suggested the same premise Langdon had just proposed. As Faukman read down the list, he looked like a man who had just discovered the earth was actually flat. \"I know some of these authors. They\u0027re... real historians!\"\\n\\n Langdon grinned. \"As you can see, Jonas, this is not only my theory. It\u0027s been around for a long time. I\u0027m simply building on it. No book has yet explored the legend of the Holy Grail from a symbologic angle. The iconographic evidence I\u0027m finding to support the theory is, well, staggeringly persuasive.\"\\n\\n Faukman was still staring at the list. \"My God, one of these books was written by Sir Leigh Teabing - a British Royal Historian.\"\\n\\n \"Teabing has spent much of his life studying the Holy Grail. I\u0027ve met with him. He was actually a big part of my inspiration. He\u0027s a believer, Jonas, along with all of the others on that list.\"\\n\\n \"You\u0027re telling me all of these historians actually believe...\" Faukman swallowed, apparently unable to say the words.\\n\\n Langdon grinned again. \"The Holy Grail is arguably the most sought-after treasure in human history. The Grail has spawned legends, wars, and lifelong quests. Does it make sense that it is merely a cup? If so, then certainly other relics should generate similar or greater interest - the Crown of Thorns, the True Cross of the Crucifixion, the Titulus - and yet, they do not. Throughout history, the Holy Grail has been the most special.\" Langdon grinned. \"Now you know why.\"\\n\\n Faukman was still shaking his head. \"But with all these books written about it, why isn\u0027t this theory more widely known?\"\\n\\n \"These books can\u0027t possibly compete with centuries of established history, especially when that history is endorsed by the ultimate bestseller of all time.\"\\n\\n Faukman\u0027s eyes went wide. \"Don\u0027t tell me Harry Potter is actually about the Holy Grail.\"\\n\\n \"I was referring to the Bible.\" Faukman cringed. \"I knew that.\"\\n\\n \"Laissez-le!\" Sophie\u0027s shouts cut the air inside the taxi. \"Put it down!\"\\n\\n Langdon jumped as Sophie leaned forward over the seat and yelled at the taxi driver. Langdon could see the driver was clutching his radio mouthpiece and speaking into it.\\n\\n Sophie turned now and plunged her hand into the pocket of Langdon\u0027s tweed jacket. Before Langdon knew what had happened, she had yanked out the pistol, swung it around, and was pressing it to the back of the driver\u0027s head. The driver instantly dropped his radio, raising his one free hand overhead.\\n\\n \"Sophie!\" Langdon choked. \"What the hell - \"\\n\\n \"Arretez!\" Sophie commanded the driver.\\n\\n Trembling, the driver obeyed, stopping the car and putting it in park.\\n\\n It was then that Langdon heard the metallic voice of the taxi company\u0027s dispatcher coming from the dashboard. \"... qui s\u0027appette Agent Sophie Neveu...\" the radio crackled. \"Et un Americain, Robert Langdon...\"\\n\\n Langdon\u0027s muscles turned rigid. They found us already?\"Descendez,\"Sophie demanded. The trembling driver kept his arms over his head as he got out of his taxi and took several steps backward.\\n\\n Sophie had rolled down her window and now aimed the gun outside at the bewildered cabbie. \"Robert,\" she said quietly, \"take the wheel. You\u0027re driving.\"\\n\\n Langdon was not about to argue with a woman wielding a gun. He climbed out of the car and jumped back in behind the wheel. The driver was yelling curses, his arms still raised over his head. \"Robert,\" Sophie said from the back seat,\" I trust you\u0027ve seen enough of our magic forest?\" He nodded. Plenty.\\n\\n \"Good. Drive us out of here.\"\\n\\n Langdon looked down at the car\u0027s controls and hesitated. Shit.He groped for the stick shift and clutch. \"Sophie? Maybe you - \"\\n\\n \"Go!\" she yelled.\\n\\n Outside, several hookers were walking over to see what was going on. One woman was placing a call on her cell phone. Langdon depressed the clutch and jostled the stick into what he hoped was first gear. He touched the accelerator, testing the gas.\\n\\n Langdon popped the clutch. The tires howled as the taxi leapt forward, fishtailing wildly and sending the gathering crowd diving for cover. The woman with the cell phone leapt into the woods, only narrowly avoiding being run down.\\n\\n \"Doucement!\" Sophie said, as the car lurched down the road. \"What are you doing?\"\\n\\n \"I tried to warn you,\" he shouted over the sound of gnashing gears. \"I drive an automatic!\"\\n\\n CHAPTER 39\\n\\n Although the spartan room in the brownstone on Rue La Bruyere had witnessed a lot of suffering, Silas doubted anything could match the anguish now gripping his pale body. I was deceived.Everything is lost.\\n\\n Silas had been tricked. The brothers had lied, choosing death instead of revealing their true secret. Silas did not have the strength to call the Teacher. Not only had Silas killed the only four people who knew where the keystone was hidden, he had killed a nun inside Saint-Sulpice. She was working against God! She scorned the work of Opus Dei!\\n\\n A crime of impulse, the woman\u0027s death complicated matters greatly. Bishop Aringarosa had placed the phone call that got Silas into Saint-Sulpice; what would the abbe think when he discovered the nun was dead? Although Silas had placed her back in her bed, the wound on her head was obvious. Silas had attempted to replace the broken tiles in the floor, but that damage too was obvious. They would know someone had been there.\\n\\n Silas had planned to hide within Opus Dei when his task here was complete. Bishop Aringarosawill protect me.Silas could imagine no more blissful existence than a life of meditation and prayer deep within the walls of Opus Dei\u0027s headquarters in New York City. He would never again set foot outside. Everything he needed was within that sanctuary. Nobody will miss me.Unfortunately, Silas knew, a prominent man like Bishop Aringarosa could not disappear so easily.\\n\\n I have endangered the bishop.Silas gazed blankly at the floor and pondered taking his own life. After all, it had been Aringarosa who gave Silas life in the first place... in that small rectory in Spain, educating him, giving him purpose.\\n\\n \"My friend,\" Aringarosa had told him,\" you were born an albino. Do not let others shame you for this. Do you not understand how special this makes you? Were you not aware that Noah himself was an albino?\"\\n\\n \"Noah of the Ark?\" Silas had never heard this.\\n\\n Aringarosa was smiling. \"Indeed, Noah of the Ark. An albino. Like you, he had skin white like an angel. Consider this. Noah saved all of life on the planet. You are destined for great things, Silas. The Lord has freed you for a reason. You have your calling. The Lord needs your help to do His work.\"\\n\\n Over time, Silas learned to see himself in a new light. I am pure.White.Beautiful.Like an angel.\\n\\n At the moment, though, in his room at the residence hall, it was his father\u0027s disappointed voice that whispered to him from the past.\\n\\n Tu es un desastre. Un spectre.\\n\\n Kneeling on the wooden floor, Silas prayed for forgiveness. Then, stripping off his robe, he reached again for the Discipline.\\n\\n CHAPTER 40\\n\\n Struggling with the gear shift, Langdon managed to maneuver the hijacked taxi to the far side of the Bois de Boulogne while stalling only twice. Unfortunately, the inherent humor in the situation was overshadowed by the taxi dispatcher repeatedly hailing their cab over the radio.\\n\\n \"Voiture cinq-six-trois. Ou etes-vous? Repondez!\"\\n\\n When Langdon reached the exit of the park, he swallowed his machismo and jammed on the brakes. \"You\u0027d better drive.\"\\n\\n Sophie looked relieved as she jumped behind the wheel. Within seconds she had the car humming smoothly westward along Allee de Longchamp, leaving the Garden of Earthly Delights behind.\\n\\n \"Which way is Rue Haxo?\" Langdon asked, watching Sophie edge the speedometer over a hundred kilometers an hour.\\n\\n Sophie\u0027s eyes remained focused on the road. \"The cab driver said it\u0027s adjacent to the Roland Garros tennis stadium. I know that area.\"\\n\\n Langdon pulled the heavy key from his pocket again, feeling the weight in his palm. He sensed it was an object of enormous consequence. Quite possibly the key to his own freedom.\\n\\n Earlier, while telling Sophie about the Knights Templar, Langdon had realized that this key, in addition to having the Priory seal embossed on it, possessed a more subtle tie to the Priory of Sion. The equal-armed cruciform was symbolic of balance and harmony but also of the Knights Templar. Everyone had seen the paintings of Knights Templar wearing white tunics emblazoned with red equal-armed crosses. Granted, the arms of the Templar cross were slightly flared at the ends, but they were still of equal length.\\n\\n A square cross. Just like the one on this key.\\n\\n Langdon felt his imagination starting to run wild as he fantasized about what they might find. The Holy Grail.He almost laughed out loud at the absurdity of it. The Grail was believed to be somewhere in England, buried in a hidden chamber beneath one of the many Templar churches, where it had been hidden since at least 1500.\\n\\n The era of Grand Master Da Vinci.\\n\\n The Priory, in order to keep their powerful documents safe, had been forced to move them many times in the early centuries. Historians now suspected as many as six different Grail relocations since its arrival in Europe from Jerusalem. The last Grail\" sighting\" had been in 1447 when numerous eyewitnesses described a fire that had broken out and almost engulfed the documents before they were carried to safety in four huge chests that each required six men to carry. After that, nobody claimed to see the Grail ever again. All that remained were occasional whisperings that it was hidden in Great Britain, the land of King Arthur and the Knights of the Round Table. Wherever it was, two important facts remained: Leonardo knew where the Grail resided during his lifetime.That hiding place had probably not changed to this day. For this reason, Grail enthusiasts still pored over Da Vinci\u0027s art and diaries in hopes of unearthing a hidden clue as to the Grail\u0027s current location. Some claimed the mountainous backdrop in Madonnaof the Rocks matched the topography of a series of cave-ridden hills in Scotland. Others insisted that the suspicious placement of disciples in The Last Supper was some kind of code. Still others claimed that X rays of the Mona Lisa revealed she originally had been painted wearing a lapis lazuli pendant of Isis - a detail Da Vinci purportedly later decided to paint over. Langdon had never seen any evidence of the pendant, nor could he imagine how it could possibly reveal the Holy Grail, and yet Grail aficionados still discussed it ad nauseum on Internet bulletin boards and worldwide-web chat rooms.\\n\\n Everyone loves a conspiracy.\\n\\n And the conspiracies kept coming. Most recently, of course, had been the earthshaking discovery that Da Vinci\u0027s famed Adoration of the Magi was hiding a dark secret beneath its layers of paint. Italian art diagnostician Maurizio Seracini had unveiled the unsettling truth, which the New York Times Magazine carried prominently in a story titled\" The Leonardo Cover-Up.\"\\n\\n Seracini had revealed beyond any doubt that while the Adoration\u0027s gray-green sketched underdrawing was indeed Da Vinci\u0027s work, the painting itself was not. The truth was that some anonymous painter had filled in Da Vinci\u0027s sketch like a paint-by-numbers years after Da Vinci\u0027s death. Far more troubling, however, was what lay beneath the impostor\u0027s paint. Photographs taken with infrared reflectography and X ray suggested that this rogue painter, while filling in Da Vinci\u0027s sketched study, had made suspicious departures from the underdrawing... as if to subvert Da Vinci\u0027s true intention. Whatever the true nature of the underdrawing, it had yet to be made public. Even so, embarrassed officials at Florence\u0027s Uffizi Gallery immediately banished the painting to a warehouse across the street. Visitors at the gallery\u0027s Leonardo Room now found a misleading and unapologetic plaque where the Adoration once hung.\\n\\n THIS WORK IS UNDERGOING DIAGNOSTIC TESTS IN PREPARATION FOR RESTORATION.\\n\\n In the bizarre underworld of modern Grail seekers, Leonardo Da Vinci remained the quest\u0027s great enigma. His artwork seemed bursting to tell a secret, and yet whatever it was remained hidden, perhaps beneath a layer of paint, perhaps enciphered in plain view, or perhaps nowhere at all. Maybe Da Vinci\u0027s plethora of tantalizing clues was nothing but an empty promise left behind to frustrate the curious and bring a smirk to the face of his knowing Mona Lisa.\\n\\n \"Is it possible,\" Sophie asked, drawing Langdon back,\" that the key you\u0027re holding unlocks the hiding place of the Holy Grail?\"\\n\\n Langdon\u0027s laugh sounded forced, even to him. \"I really can\u0027t imagine. Besides, the Grail is believed to be hidden in the United Kingdom somewhere, not France.\" He gave her the quick history.\\n\\n \"But the Grail seems the only rational conclusion,\" she insisted. \"We have an extremely secure key, stamped with the Priory of Sion seal, delivered to us by a member of the Priory of Sion - a brotherhood which, you just told me, are guardians of the Holy Grail.\"\\n\\n Langdon knew her contention was logical, and yet intuitively he could not possibly accept it. Rumors existed that the Priory had vowed someday to bring the Grail back to France to a final resting place, but certainly no historical evidence existed to suggest that this indeed had happened. Even if the Priory had managed to bring the Grail back to France, the address 24 Rue Haxo near a tennis stadium hardly sounded like a noble final resting place. \"Sophie, I really don\u0027t see how this key could have anything to do with the Grail.\"\\n\\n \"Because the Grail is supposed to be in England?\"\\n\\n \"Not only that. The location of the Holy Grail is one of the best kept secrets in history. Priory members wait decades proving themselves trustworthy before being elevated to the highest echelons of the fraternity and learning where the Grail is. That secret is protected by an intricate system of compartmentalized knowledge, and although the Priory brotherhood is very large, only four members at any given time know where the Grail is hidden - the Grand Master and his three senechaux.The probability of your grandfather being one of those four top people is very slim.\"\\n\\n My grandfather was one of them, Sophie thought, pressing down on the accelerator. She had an image stamped in her memory that confirmed her grandfather\u0027s status within the brotherhood beyond any doubt.\\n\\n \"And even if your grandfather were in the upper echelon, he would never be allowed to reveal anything to anyone outside the brotherhood. It is inconceivable that he would bring you into the inner circle.\"\\n\\n I\u0027ve already been there, Sophie thought, picturing the ritual in the basement. She wondered if this were the moment to tell Langdon what she had witnessed that night in the Normandy chateau. For ten years now, simple shame had kept her from telling a soul. Just thinking about it, she shuddered. Sirens howled somewhere in the distance, and she felt a thickening shroud of fatigue settling over her.\\n\\n \"There!\" Langdon said, feeling excited to see the huge complex of the Roland Garros tennis stadium looming ahead.\\n\\n Sophie snaked her way toward the stadium. After several passes, they located the intersection of Rue Haxo and turned onto it, driving in the direction of the lower numbers. The road became more industrial, lined with businesses.\\n\\n We need number twenty-four, Langdon told himself, realizing he was secretly scanning the horizon for the spires of a church. Don\u0027t be ridiculous.A forgotten Templar church in this neighborhood?\\n\\n \"There it is,\" Sophie exclaimed, pointing. Langdon\u0027s eyes followed to the structure ahead. What in the world?The building was modern. A squat citadel with a giant, neon equal-armed cross emblazoned a top its facade. Beneath the cross were the words:\\n\\n DEPOSITORY BANK OF ZURICH\\n\\n Langdon was thankful not to have shared his Templar church hopes with Sophie. A career hazard of symbologists was a tendency to extract hidden meaning from situations that had none. In this case, Langdon had entirely forgotten that the peaceful, equal-armed cross had been adopted as the perfect symbol for the flag of neutral Switzerland.\\n\\n At least the mystery was solved.\\n\\n Sophie and Langdon were holding the key to a Swiss bank deposit box.\\n\\n CHAPTER 41\\n\\n Outside Castel Gandolfo, an updraft of mountain air gushed over the top of the cliff and across the high bluff, sending a chill through Bishop Aringarosa as he stepped from the Fiat. I should haveworn more than this cassock, he thought, fighting the reflex to shiver. The last thing he needed to appear tonight was weak or fearful.\\n\\n The castle was dark save the windows at the very top of the building, which glowed ominously. The library, Aringarosa thought. They are awake and waiting.He ducked his head against the wind and continued on without so much as a glance toward the observatory domes.\\n\\n The priest who greeted him at the door looked sleepy. He was the same priest who had greeted Aringarosa five months ago, albeit tonight he did so with much less hospitality. \"We were worried about you, Bishop,\" the priest said, checking his watch and looking more perturbed than worried.\\n\\n \"My apologies. Airlines are so unreliable these days.\"\\n\\n The priest mumbled something inaudible and then said,\" They are waiting upstairs. I will escort you up.\"\\n\\n The library was a vast square room with dark wood from floor to ceiling. On all sides, towering bookcases burgeoned with volumes. The floor was amber marble with black basalt trim, a handsome reminder that this building had once been a palace.\\n\\n \"Welcome, Bishop,\" a man\u0027s voice said from across the room.\\n\\n Aringarosa tried to see who had spoken, but the lights were ridiculously low - much lower than they had been on his first visit, when everything was ablaze. The night of stark awakening. Tonight, these men sat in the shadows, as if they were somehow ashamed of what was about to transpire.\\n\\n Aringarosa entered slowly, regally even. He could see the shapes of three men at a long table on the far side of the room. The silhouette of the man in the middle was immediately recognizable - the obese Secretariat Vaticana, overlord of all legal matters within Vatican City. The other two were high-ranking Italian cardinals.\\n\\n Aringarosa crossed the library toward them. \"My humble apologies for the hour. We\u0027re on different time zones. You must be tired.\"\\n\\n \"Not at all,\" the secretariat said, his hands folded on his enormous belly. \"We are grateful you have come so far. The least we can do is be awake to meet you. Can we offer you some coffee or refreshments?\"\\n\\n \"I\u0027d prefer we don\u0027t pretend this is a social visit. I have another plane to catch. Shall we get to business?\"\\n\\n \"Of course,\" the secretariat said. \"You have acted more quickly than we imagined.\" \"Have I?\" \"You still have a month.\"\\n\\n \"You made your concerns known five months ago,\" Aringarosa said. \"Why should I wait?\" \"Indeed. We are very pleased with your expediency.\" Aringarosa\u0027s eyes traveled the length of the long table to a large black briefcase. \"Is that what I requested?\"\\n\\n \"It is.\" The secretariat sounded uneasy. \"Although, I must admit, we are concerned with the request. It seems quite...\"\\n\\n \"Dangerous,\" one of the cardinals finished. \"Are you certain we cannot wire it to you somewhere? The sum is exorbitant.\"\\n\\n Freedom is expensive. \"I have no concerns for my own safety. God is with me.\" The men actually looked doubtful.\" The funds are exactly as I requested?\"\\n\\n The secretariat nodded. \"Large-denomination bearer bonds drawn on the Vatican Bank. Negotiable as cash anywhere in the world.\"\\n\\n Aringarosa walked to the end of the table and opened the briefcase. Inside were two thick stacks of bonds, each embossed with the Vatican seal and the title PORTATORE, making the bonds redeemable to whoever was holding them.\\n\\n The secretariat looked tense. \"I must say, Bishop, all of us would feel less apprehensive if these funds were in cash.\"\\n\\n I could not lift that much cash, Aringarosa thought, closing the case. \"Bonds are negotiable as cash. You said so yourself.\"\\n\\n The cardinals exchanged uneasy looks, and finally one said,\" Yes, but these bonds are traceable directly to the Vatican Bank.\"\\n\\n Aringarosa smiled inwardly. That was precisely the reason the Teacher suggested Aringarosa get the money in Vatican Bank bonds. It served as insurance. We are all in this together now. \"This is a perfectly legal transaction,\" Aringarosa defended. \"Opus Dei is a personal prelature of Vatican City, and His Holiness can disperse monies however he sees fit. No law has been broken here.\"\\n\\n \"True, and yet...\" The secretariat leaned forward and his chair creaked under the burden. \"We have no knowledge of what you intend to do with these funds, and if it is in any way illegal...\"\\n\\n \"Considering what you are asking of me,\" Aringarosa countered,\" what I do with this money is not your concern.\"\\n\\n There was a long silence. They know I\u0027m right, Aringarosa thought. \"Now, I imagine you have something for me to sign?\" They all jumped, eagerly pushing the paper toward him, as if they wished he would simply leave. Aringarosa eyed the sheet before him. It bore the papal seal. \"This is identical to the copy you sent me?\" \"Exactly.\" Aringarosa was surprised how little emotion he felt as he signed the document. The three men present, however, seemed to sigh in relief.\" Thank you, Bishop,\" the secretariat said. \"Your service to the Church will never be forgotten.\" Aringarosa picked up the briefcase, sensing promise and authority in its weight. The four menlooked at one another for a moment as if there were something more to say, but apparently therewas not. Aringarosa turned and headed for the door.\\n\\n \"Bishop?\" one of the cardinals called out as Aringarosa reached the threshold. Aringarosa paused, turning. \"Yes?\" \"Where will you go from here?\"\\n\\n Aringarosa sensed the query was more spiritual than geographical, and yet he had no intention of discussing morality at this hour. \"Paris,\" he said, and walked out the door. \\n\\n","sourceLink":"https://allnovel.net/the-da-vinci-code-robert-langdon-2/page-13.html","bookId":2227,"book":{"id":2227,"title":"The Da Vinci Code (Robert Langdon #2)","description":"Storyline: While in Paris on business, Harvard symbologist Robert Langdon receives an urgent late-night phone call: the elderly curator of the Louvre has been murdered inside the museum. Near the body, police have found a baffling cipher. While working to solve the enigmatic riddle, Langdon is stunned to discover it leads to a trail of clues hidden in the works of Da Vinci-clues visible for all to see-yet ingeniously disguised by the painter. Langdon joins forces with a gifted French cryptologist, Sophie Neveu, and learns the late curator was involved in the Priory of Sion-an actual secret society whose members included Sir Isaac Newton, Botticelli, Victor Hugo, and Da Vinci, among others. In a breathless race through Paris, London, and beyond, Langdon and Neveu match wits with a faceless powerbroker who seems to anticipate their every move. Unless Langdon and Neveu can decipher the labyrinthine puzzle in time, the Priory\u0027s ancient secret-and an explosive historical truth-will be lost forever. The Da Vinci Code heralds the arrival of a new breed of lightning-paced, intelligent thriller... utterly unpredictable right up to its stunning conclusion.\\n","cover":"https://allnovel.net/images/the-da-vinci-code-robert-langdon-2.jpg","author":"Dan Brown","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-da-vinci-code-robert-langdon-2.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 11:04:08 PM"}}
