{"id":107230,"no":26,"title":"Page 26","content":"CHAPTER 87\n The fireplace in Chateau Villette\u0027s drawing room was cold, but Collet paced before it nonetheless as he read the faxes from Interpol. Not at all what he expected. Andre Vernet, according to official records, was a model citizen. No police record - not even a parking ticket. Educated at prep school and the Sorbonne, he had a cum laude degree in international finance. Interpol said Vernet\u0027s name appeared in the newspapers from time to time, but always in a positive light. Apparently the man had helped design the security parameters that kept the Depository Bank of Zurich a leader in the ultramodern world of electronic security. Vernet\u0027s credit card records showed a penchant for art books, expensive wine, and classical CD\u0027s - mostly Brahms - which he apparently enjoyed on an exceptionally high-end stereo system he had purchased several years ago.\n Zero, Collet sighed.\n The only red flag tonight from Interpol had been a set of fingerprints that apparently belonged to Teabing\u0027s servant. The chief PTS examiner was reading the report in a comfortable chair across the room.\n Collet looked over. \"Anything?\"\n The examiner shrugged. \"Prints belong to Remy Legaludec. Wanted for petty crime. Nothing serious. Looks like he got kicked out of university for rewiring phone jacks to get free service... later did some petty theft. Breaking and entering. Skipped out on a hospital bill once for an emergency tracheotomy.\" He glanced up, chuckling. \"Peanut allergy.\"\n Collet nodded, recalling a police investigation into a restaurant that had failed to notate on its menu that the chili recipe contained peanut oil. An unsuspecting patron had died of anaphylactic shock at the table after a single bite.\n \"Legaludec is probably a live-in here to avoid getting picked up.\" The examiner looked amused. \"His lucky night.\"\n Collet sighed. \"All right, you better forward this info to Captain Fache.\"\n The examiner headed off just as another PTS agent burst into the living room. \"Lieutenant! We found something in the barn.\"\n From the anxious look on the agent\u0027s face, Collet could only guess. \"A body.\" \"No, sir. Something more...\" He hesitated. \"Unexpected.\" Rubbing his eyes, Collet followed the agent out to the barn. As they entered the musty, cavernous space, the agent motioned toward the center of the room, where a wooden ladder now ascended high into the rafters, propped against the ledge of a hayloft suspended high above them. \"That ladder wasn\u0027t there earlier,\" Collet said.\" No, sir. I set that up. We were dusting for prints near the Rolls when I saw the ladder lying on the floor. I wouldn\u0027t have given it a second thought except the rungs were worn and muddy. This ladder gets regular use. The height of the hayloft matched the ladder, so I raised it and climbed up to have a look.\"\n Collet\u0027s eyes climbed the ladder\u0027s steep incline to the soaring hayloft. Someone goes up thereregularly? From down here, the loft appeared to be a deserted platform, and yet admittedly most of it was invisible from this line of sight.\n A senior PTS agent appeared at the top of the ladder, looking down. \"You\u0027ll definitely want to see this, Lieutenant,\" he said, waving Collet up with a latex-gloved hand.\n Nodding tiredly, Collet walked over to the base of the old ladder and grasped the bottom rungs. The ladder was an antique tapered design and narrowed as Collet ascended. As he neared the top, Collet almost lost his footing on a thin rung. The barn below him spun. Alert now, he moved on, finally reaching the top. The agent above him reached out, offering his wrist. Collet grabbed it and made the awkward transition onto the platform.\n \"It\u0027s over there,\" the PTS agent said, pointing deep into the immaculately clean loft. \"Only one set of prints up here. We\u0027ll have an ID shortly.\"\n Collet squinted through the dim light toward the far wall. What the hell? Nestled against the far wall sat an elaborate computer workstation - two tower CPUs, a flat-screen video monitor with speakers, an array of hard drives, and a multichannel audio console that appeared to have its own filtered power supply.\n Why in the world would anyone work all the way up here? Collet moved toward the gear. \"Have you examined the system?\"\n \"It\u0027s a listening post.\"\n Collet spun. \"Surveillance?\"\n The agent nodded. \"Very advanced surveillance.\" He motioned to a long project table strewn with electronic parts, manuals, tools, wires, soldering irons, and other electronic components. \"Someone clearly knows what he\u0027s doing. A lot of this gear is as sophisticated as our own equipment. Miniature microphones, photoelectric recharging cells, high-capacity RAM chips. He\u0027s even got some of those new nano drives.\"\n Collet was impressed.\n \"Here\u0027s a complete system,\" the agent said, handing Collet an assembly not much larger than a pocket calculator. Dangling off the contraption was a foot-long wire with a stamp-sized piece of wafer-thin foil stuck on the end. \"The base is a high-capacity hard disk audio recording system with rechargeable battery. That strip of foil at the end of the wire is a combination microphone and photoelectric recharging cell.\"\n Collet knew them well. These foil-like, photocell microphones had been an enormous breakthrough a few years back. Now, a hard disk recorder could be affixed behind a lamp, for example, with its foil microphone molded into the contour of the base and dyed to match. As long as the microphone was positioned such that it received a few hours of sunlight per day, the photo cells would keep recharging the system. Bugs like this one could listen indefinitely.\n \"Reception method?\" Collet asked.\n The agent signaled to an insulated wire that ran out of the back of the computer, up the wall, through a hole in the barn roof. \"Simple radio wave. Small antenna on the roof.\"\n Collet knew these recording systems were generally placed in offices, were voice-activated to save hard disk space, and recorded snippets of conversation during the day, transmitting compressed audio files at night to avoid detection. After transmitting, the hard drive erased itself and prepared to do it all over again the next day.\n Collet\u0027s gaze moved now to a shelf on which were stacked several hundred audio cassettes, all labeled with dates and numbers. Someone has been very busy.He turned back to the agent. \"Doyou have any idea what target is being bugged?\"\n \"Well, Lieutenant,\" the agent said, walking to the computer and launching a piece of software. \"It\u0027s the strangest thing...\"\n CHAPTER 88\n Langdon felt utterly spent as he and Sophie hurdled a turnstile at the Temple tube station and dashed deep into the grimy labyrinth of tunnels and platforms. The guilt ripped through him.\n I involved Leigh, and now he\u0027s in enormous danger.\n Remy\u0027s involvement had been a shock, and yet it made sense. Whoever was pursuing the Grail had recruited someone on the inside. They went to Teabing\u0027s for the same reason I did.Throughout history, those who held knowledge of the Grail had always been magnets for thieves and scholars alike. The fact that Teabing had been a target all along should have made Langdon feel less guilty about involving him. It did not. We need to find Leigh and help him.Immediately.\n Langdon followed Sophie to the westbound District and Circle Line platform, where she hurried to a pay phone to call the police, despite Remy\u0027s warning to the contrary. Langdon sat on a grungy bench nearby, feeling remorseful.\n \"The best way to help Leigh,\" Sophie reiterated as she dialed,\" is to involve the London authorities immediately. Trust me.\"\n Langdon had not initially agreed with this idea, but as they had hatched their plan, Sophie\u0027s logic began to make sense. Teabing was safe at the moment. Even if Remy and the others knew where the knight\u0027s tomb was located, they still might need Teabing\u0027s help deciphering the orb reference. What worried Langdon was what would happen after the Grail map had been found. Leigh willbecome a huge liability.\n If Langdon were to have any chance of helping Leigh, or of ever seeing the keystone again, it was essential that he find the tomb first. Unfortunately, Remy has a big head start.\n Slowing Remy down had become Sophie\u0027s task. Finding the right tomb had become Langdon\u0027s. Sophie would make Remy and Silas fugitives of the London police, forcing them into hiding or, better yet, catching them. Langdon\u0027s plan was less certain - to take the tube to nearby King\u0027s College, which was renowned for its electronic theological database. The ultimate research tool, Langdon had heard. Instant answers to any religious historical question.He wondered what the database would have to say about\" a knight a Pope interred.\"\n He stood up and paced, wishing the train would hurry.\n At the pay phone, Sophie\u0027s call finally connected to the London police. \"Snow Hill Division,\" the dispatcher said. \"How may I direct your call?\" \"I\u0027m reporting a kidnapping.\" Sophie knew to be concise.\" Name please?\"\n Sophie paused. \"Agent Sophie Neveu with the French Judicial Police.\"\n The title had the desired effect. \"Right away, ma\u0027am. Let me get a detective on the line for you.\"\n As the call went through, Sophie began wondering if the police would even believe her description of Teabing\u0027s captors. A man in a tuxedo.How much easier to identify could a suspect be? Even if Remy changed clothes, he was partnered with an albino monk. Impossible to miss.Moreover, they had a hostage and could not take public transportation. She wondered how many Jaguar stretch limos there could be in London.\n Sophie\u0027s connection to the detective seemed to be taking forever. Come on! She could hear the line clicking and buzzing, as if she was being transferred.\n Fifteen seconds passed.\n Finally a man came on the line. \"Agent Neveu?\"\n Stunned, Sophie registered the gruff tone immediately.\n \"Agent Neveu,\" Bezu Fache demanded. \"Where the hell are you?\"\n Sophie was speechless. Captain Fache had apparently requested the London police dispatcher alert him if Sophie called in.\n \"Listen,\" Fache said, speaking to her in terse French. \"I made a terrible mistake tonight. Robert Langdon is innocent. All charges against him have been dropped. Even so, both of you are in danger. You need to come in.\"\n Sophie\u0027s jaw fell slack. She had no idea how to respond. Fache was not a man who apologized for anything.\n \"You did not tell me,\" Fache continued,\" that Jacques Sauniere was your grandfather. I fully intend to overlook your insubordination last night on account of the emotional stress you must be under. At the moment, however, you and Langdon need to go to the nearest London police headquarters for refuge.\"\n He knows I\u0027m in London? What else does Fache know? Sophie heard what sounded like drilling or machinery in the background. She also heard an odd clicking on the line. \"Are you tracing this call, Captain?\"\n Fache\u0027s voice was firm now. \"You and I need to cooperate, Agent Neveu. We both have a lot to lose here. This is damage control. I made errors in judgment last night, and if those errors result in the deaths of an American professor and a DCPJ cryptologist, my career will be over. I\u0027ve been trying to pull you back into safety for the last several hours.\"\n A warm wind was now pushing through the station as a train approached with a low rumble. Sophie had every intention of being on it. Langdon apparently had the same idea; he was gathering himself together and moving toward her now.\n \"The man you want is Remy Legaludec,\" Sophie said. \"He is Teabing\u0027s servant. He just kidnapped Teabing inside the Temple Church and - \"\n \"Agent Neveu!\" Fache bellowed as the train thundered into the station. \"This is not something to discuss on an open line. You and Langdon will come in now. For your own well-being! That is a direct order!\"\n Sophie hung up and dashed with Langdon onto the train.\n CHAPTER 89\n The immaculate cabin of Teabing\u0027s Hawker was now covered with steel shavings and smelled of compressed air and propane. Bezu Fache had sent everyone away and sat alone with his drink and the heavy wooden box found in Teabing\u0027s safe.\n Running his finger across the inlaid Rose, he lifted the ornate lid. Inside he found a stone cylinder with lettered dials. The five dials were arranged to spell SOFIA. Fache stared at the word a long moment and then lifted the cylinder from its padded resting place and examined every inch. Then, pulling slowly on the ends, Fache slid off one of the end caps. The cylinder was empty.\n Fache set it back in the box and gazed absently out the jet\u0027s window at the hangar, pondering his brief conversation with Sophie, as well as the information he\u0027d received from PTS in Chateau Villette. The sound of his phone shook him from his daydream.\n It was the DCPJ switchboard. The dispatcher was apologetic. The president of the Depository Bank of Zurich had been calling repeatedly, and although he had been told several times that the captain was in London on business, he just kept calling. Begrudgingly Fache told the operator to forward the call.\n \"Monsieur Vernet,\" Fache said, before the man could even speak,\" I am sorry I did not call you earlier. I have been busy. As promised, the name of your bank has not appeared in the media. So what precisely is your concern?\"\n Vernet\u0027s voice was anxious as he told Fache how Langdon and Sophie had extracted a small wooden box from the bank and then persuaded Vernet to help them escape. \"Then when I heard on the radio that they were criminals,\" Vernet said, \"I pulled over and demanded the box back, but they attacked me and stole the truck.\"\n \"You are concerned for a wooden box,\" Fache said, eyeing the Rose inlay on the cover and again gently opening the lid to reveal the white cylinder. \"Can you tell me what was in the box?\"\n \"The contents are immaterial,\" Vernet fired back. \"I am concerned with the reputation of my bank. We have never had a robbery. Ever.It will ruin us if I cannot recover this property on behalf of my client.\"\n \"You said Agent Neveu and Robert Langdon had a password and a key. What makes you say they stole the box?\"\n \"They murdered people tonight. Including Sophie Neveu\u0027s grandfather. The key and password were obviously ill-gotten.\"\n \"Mr. Vernet, my men have done some checking into your background and your interests. You are obviously a man of great culture and refinement. I would imagine you are a man of honor, as well. As am I. That said, I give you my word as commanding officer of the Police Judiciaire that your box, along with your bank\u0027s reputation, are in the safest of hands.\"\n CHAPTER 90\n High in the hayloft at Chateau Villette, Collet stared at the computer monitor in amazement. \"This system is eavesdropping on all these locations?\"\n \"Yes,\" the agent said. \"It looks like data has been collected for over a year now.\" Collet read the list again, speechless.\n COLBERT SOSTAQUE - Chairman of the Conseil Constitutionnel\n JEAN CHAFFeE - Curator, Musee du Jeu de Paume\n EDOUARD DESROCHERS - Senior Archivist, Mitterrand Library\n JACQUES SAUNIeRE - Curator, Musee du Louvre\n MICHEL BRETON - Head of DAS (French Intelligence)\n The agent pointed to the screen. \"Number four is of obvious concern.\"\n Collet nodded blankly. He had noticed it immediately. Jacques Sauniere was being bugged.He looked at the rest of the list again. How could anyone possibly manage to bug these prominent people?\" Have you heard any of the audio files?\"\n \"A few. Here\u0027s one of the most recent.\" The agent clicked a few computer keys. The speakers crackled to life. \"Capitaine, un agent du Departement de Cryptographie est arrive.\"\n Collet could not believe his ears. \"That\u0027s me! That\u0027s my voice!\" He recalled sitting at Sauniere\u0027s desk and radioing Fache in the Grand Gallery to alert him of Sophie Neveu\u0027s arrival.\n The agent nodded. \"A lot of our Louvre investigation tonight would have been audible if someone had been interested.\"\n \"Have you sent anyone in to sweep for the bug?\"\n \"No need. I know exactly where it is.\" The agent went to a pile of old notes and blueprints on the worktable. He selected a page and handed it to Collet. \"Look familiar?\"\n Collet was amazed. He was holding a photocopy of an ancient schematic diagram, which depicted a rudimentary machine. He was unable to read the handwritten Italian labels, and yet he knew what he was looking at. A model for a fully articulated medieval French knight.\n The knight sitting on Sauniere\u0027s desk!\n Collet\u0027s eyes moved to the margins, where someone had scribbled notes on the photocopy in red felt-tipped marker. The notes were in French and appeared to be ideas outlining how best to insert a listening device into the knight.\n CHAPTER 91\n Silas sat in the passenger seat of the parked Jaguar limousine near the Temple Church. His hands felt damp on the keystone as he waited for Remy to finish tying and gagging Teabing in back with the rope they had found in the trunk.\n Finally, Remy climbed out of the rear of the limo, walked around, and slid into the driver\u0027s seat beside Silas.\n \"Secure?\" Silas asked.\n Remy chuckled, shaking off the rain and glancing over his shoulder through the open partition at the crumpled form of Leigh Teabing, who was barely visible in the shadows in the rear. \"He\u0027s not going anywhere.\"\n Silas could hear Teabing\u0027s muffled cries and realized Remy had used some of the old duct tape to gag him.\n \"Ferme ta gueule!\" Remy shouted over his shoulder at Teabing. Reaching to a control panel on the elaborate dash, Remy pressed a button. An opaque partition raised behind them, sealing off the back. Teabing disappeared, and his voice was silenced. Remy glanced at Silas. \"I\u0027ve been listening to his miserable whimpering long enough.\"\n Minutes later, as the Jaguar stretch limo powered through the streets, Silas\u0027s cell phone rang. TheTeacher.He answered excitedly. \"Hello?\"\n \"Silas,\" the Teacher\u0027s familiar French accent said, \"I am relieved to hear your voice. This means you are safe.\"\n Silas was equally comforted to hear the Teacher. It had been hours, and the operation had veered wildly off course. Now, at last, it seemed to be back on track. \"I have the keystone.\"\n \"This is superb news,\" the Teacher told him. \"Is Remy with you?\"\n Silas was surprised to hear the Teacher use Remy\u0027s name. \"Yes. Remy freed me.\" \"As I ordered him to do. I am only sorry you had to endure captivity for so long.\" \"Physical discomfort has no meaning. The important thing is that the keystone is ours.\" \"Yes. I need it delivered to me at once. Time is of the essence.\" Silas was eager to meet the Teacher face-to-face at last. \"Yes, sir, I would be honored.\" \"Silas, I would like Remy to bring it to me.\" Remy? Silas was crestfallen. After everything Silas had done for the Teacher, he had believed hewould be the one to hand over the prize. The Teacher favors Remy?\n \"I sense your disappointment,\" the Teacher said,\" which tells me you do not understand my meaning.\" He lowered his voice to a whisper. \"You must believe that I would much prefer to receive the keystone from you - a man of God rather than a criminal - but Remy must be dealt with. He disobeyed my orders and made a grave mistake that has put our entire mission at risk.\"\n Silas felt a chill and glanced over at Remy. Kidnapping Teabing had not been part of the plan, and deciding what to do with him posed a new problem.\n \"You and I are men of God,\" the Teacher whispered. \"We cannot be deterred from our goal.\" There was an ominous pause on the line. \"For this reason alone, I will ask Remy to bring me the keystone. Do you understand?\"\n Silas sensed anger in the Teacher\u0027s voice and was surprised the man was not more understanding. Showing his face could not be avoided, Silas thought. Remy did what he had to do.He saved the keystone. \"I understand,\" Silas managed.\n \"Good. For your own safety, you need to get off the street immediately. The police will be looking for the limousine soon, and I do not want you caught. Opus Dei has a residence in London, no?\" \"Of course.\"\n \"And you are welcome there?\" \"As a brother.\" \"Then go there and stay out of sight. I will call you the moment I am in possession of the keystone and have attended to my current problem.\"\n \"You are in London?\"\n \"Do as I say, and everything will be fine.\" \"Yes, sir.\" The Teacher heaved a sigh, as if what he now had to do was profoundly regrettable. \"It\u0027s time I speak to Remy.\"\n Silas handed Remy the phone, sensing it might be the last call Remy Legaludec ever took.\n As Remy took the phone, he knew this poor, twisted monk had no idea what fate awaited him now that he had served his purpose.\n The Teacher used you, Silas.And your bishop is a pawn. Remy still marveled at the Teacher\u0027s powers of persuasion. Bishop Aringarosa had trusted everything. He had been blinded by his own desperation. Aringarosa was far too eager to believe. Although Remy did not particularly like the Teacher, he felt pride at having gained the man\u0027s trust and helped him so substantially. I have earned my payday.\n \"Listen carefully,\" the Teacher said. \"Take Silas to the Opus Dei residence hall and drop him off a few streets away. Then drive to St. James\u0027s Park. It is adjacent to Parliament and Big Ben. You can park the limousine on Horse Guards Parade. We\u0027ll talk there.\"\n With that, the connection went dead.\n CHAPTER 92\n King\u0027s College, established by King George IV in 1829, houses its Department of Theology and Religious Studies adjacent to Parliament on property granted by the Crown. King\u0027s College Religion Department boasts not only 150 years\u0027 experience in teaching and research, but the 1982 establishment of the Research Institute in Systematic Theology, which possesses one of the most complete and electronically advanced religious research libraries in the world.\n Langdon still felt shaky as he and Sophie came in from the rain and entered the library. The primary research room was as Teabing had described it - a dramatic octagonal chamber dominated by an enormous round table around which King Arthur and his knights might have been comfortable were it not for the presence of twelve flat-screen computer workstations. On the far side of the room, a reference librarian was just pouring a pot of tea and settling in for her day of work.\n \"Lovely morning,\" she said in a cheerful British accent, leaving the tea and walking over. \"May I help you?\"\n \"Thank you, yes,\" Langdon replied. \"My name is - Robert Langdon.\" She gave a pleasant smile. \"I know who you are.\"\n For an instant, he feared Fache had put him on English television as well, but the librarian\u0027s smile suggested otherwise. Langdon still had not gotten used to these moments of unexpected celebrity. Then again, if anyone on earth were going to recognize his face, it would be a librarian in a Religious Studies reference facility.\n \"Pamela Gettum,\" the librarian said, offering her hand. She had a genial, erudite face and a pleasingly fluid voice. The horn-rimmed glasses hanging around her neck were thick.\n \"A pleasure,\" Langdon said. \"This is my friend Sophie Neveu.\"\n The two women greeted one another, and Gettum turned immediately back to Langdon. \"I didn\u0027t know you were coming.\"\n \"Neither did we. If it\u0027s not too much trouble, we could really use your help finding some information.\"\n Gettum shifted, looking uncertain. \"Normally our services are by petition and appointment only, unless of course you\u0027re the guest of someone at the college?\"\n Langdon shook his head. \"I\u0027m afraid we\u0027ve come unannounced. A friend of mine speaks very highly of you. Sir Leigh Teabing?\" Langdon felt a pang of gloom as he said the name. \"The British Royal Historian.\"\n Gettum brightened now, laughing. \"Heavens, yes. What a character. Fanatical! Every time he comes in, it\u0027s always the same search strings. Grail. Grail. Grail. I swear that man will die before he gives up on that quest.\" She winked. \"Time and money afford one such lovely luxuries, wouldn\u0027t you say? A regular Don Quixote, that one.\"\n \"Is there any chance you can help us?\" Sophie asked. \"It\u0027s quite important.\"\n Gettum glanced around the deserted library and then winked at them both. \"Well, I can\u0027t very well claim I\u0027m too busy, now can I? As long as you sign in, I can\u0027t imagine anyone being too upset. What did you have in mind?\"\n \"We\u0027re trying to find a tomb in London.\"\n Gettum looked dubious. \"We\u0027ve got about twenty thousand of them. Can you be a little more specific?\"\n \"It\u0027s the tomb of a knight.We don\u0027t have a name.\"\n \"A knight. That tightens the net substantially. Much less common.\"\n \"We don\u0027t have much information about the knight we\u0027re looking for,\" Sophie said,\" but this is what we know.\" She produced a slip of paper on which she had written only the first two lines of the poem.\n Hesitant to show the entire poem to an outsider, Langdon and Sophie had decided to share just the first two lines, those that identified the knight. Compartmentalized cryptography, Sophie had called it. When an intelligence agency intercepted a code containing sensitive data, cryptographers each worked on a discrete section of the code. This way, when they broke it, no single cryptographer possessed the entire deciphered message.\n In this case, the precaution was probably excessive; even if this librarian saw the entire poem, identified the knight\u0027s tomb, and knew what orb was missing, the information was useless without the cryptex.\n Gettum sensed an urgency in the eyes of this famed American scholar, almost as if his finding this tomb quickly were a matter of critical importance. The green-eyed woman accompanying him also seemed anxious.\n Puzzled, Gettum put on her glasses and examined the paper they had just handed her.\n In London lies a knight a Pope interred.\n His labor\u0027s fruit a Holy wrath incurred.\n She glanced at her guests. \"What is this? Some kind of Harvard scavenger hunt?\" Langdon\u0027s laugh sounded forced. \"Yeah, something like that.\" Gettum paused, feeling she was not getting the whole story. Nonetheless, she felt intrigued and found herself pondering the verse carefully. \"According to this rhyme, a knight did something that incurred displeasure with God, and yet a Pope was kind enough to bury him in London.\"\n Langdon nodded. \"Does it ring any bells?\"\n Gettum moved toward one of the workstations. \"Not offhand, but let\u0027s see what we can pull up in the database.\"\n Over the past two decades, King\u0027s College Research Institute in Systematic Theology had used optical character recognition software in unison with linguistic translation devices to digitize and catalog an enormous collection of texts - encyclopedias of religion, religious biographies, sacred scriptures in dozens of languages, histories, Vatican letters, diaries of clerics, anything at all that qualified as writings on human spirituality. Because the massive collection was now in the form of bits and bytes rather than physical pages, the data was infinitely more accessible.\n Settling into one of the workstations, Gettum eyed the slip of paper and began typing. \"To begin, we\u0027ll run a straight Boolean with a few obvious keywords and see what happens.\"\n \"Thank you.\"\n Gettum typed in a few words:\n LONDON, KNIGHT, POPE\n As she clicked the SEARCH button, she could feel the hum of the massive mainframe downstairs scanning data at a rate of 500 MB/sec. \"I\u0027m asking the system to show us any documents whose complete text contains all three of these keywords. We\u0027ll get more hits than we want, but it\u0027s a good place to start.\"\n The screen was already showing the first of the hits now.\n Painting the Pope. The Collected Portraits of Sir Joshua Reynolds. London University Press.\n Gettum shook her head. \"Obviously not what you\u0027re looking for.\" She scrolled to the next hit.\n The London Writings of Alexander Pope by G. Wilson Knight.\n Again she shook her head.\n As the system churned on, the hits came up more quickly than usual. Dozens of texts appeared, many of them referencing the eighteenth-century British writer Alexander Pope, whose counter religious, mock-epic poetry apparently contained plenty of references to knights and London.\n Gettum shot a quick glance to the numeric field at the bottom of the screen. This computer, by calculating the current number of hits and multiplying by the percentage of the database left to search, provided a rough guess of how much information would be found. This particular search looked like it was going to return an obscenely large amount of data.\n Estimated number of total hits: 2, 692\n \"We need to refine the parameters further,\" Gettum said, stopping the search. \"Is this all the information you have regarding the tomb? There\u0027s nothing else to go on?\"\n Langdon glanced at Sophie Neveu, looking uncertain.\n This is no scavenger hunt, Gettum sensed. She had heard the whisperings of Robert Langdon\u0027s experience in Rome last year. This American had been granted access to the most secure library on earth - the Vatican Secret Archives. She wondered what kinds of secrets Langdon might have learned inside and if his current desperate hunt for a mysterious London tomb might relate to information he had gained within the Vatican. Gettum had been a librarian long enough to know the most common reason people came to London to look for knights. The Grail.\n Gettum smiled and adjusted her glasses. \"You are friends with Leigh Teabing, you are in England, and you are looking for a knight.\" She folded her hands. \"I can only assume you are on a Grail quest.\"\n Langdon and Sophie exchanged startled looks.\n Gettum laughed. \"My friends, this library is a base camp for Grail seekers. Leigh Teabing among them. I wish I had a shilling for every time I\u0027d run searches for the Rose, Mary Magdalene, Sangreal, Merovingian, Priory of Sion, et cetera, et cetera. Everyone loves a conspiracy.\" She took off her glasses and eyed them. \"I need more information.\"\n In the silence, Gettum sensed her guests\u0027 desire for discretion was quickly being outweighed by their eagerness for a fast result.\n \"Here,\" Sophie Neveu blurted. \"This is everything we know.\" Borrowing a pen from Langdon, she wrote two more lines on the slip of paper and handed it to Gettum.\n You seek the orb that ought be on his tomb. It speaks of Rosy flesh and seeded womb.\n Gettum gave an inward smile. The Grail indeed, she thought, noting the references to the Rose and her seeded womb. \"I can help you,\" she said, looking up from the slip of paper. \"Might I ask where this verse came from? And why you are seeking an orb?\"\n \"You might ask,\" Langdon said, with a friendly smile,\" but it\u0027s a long story and we have very little time.\"\n \"Sounds like a polite way of saying \"mind your own business.\"\"\n \"We would be forever in your debt, Pamela,\" Langdon said, \"if you could find out who this knight is and where he is buried.\"\n \"Very well,\" Gettum said, typing again. \"I\u0027ll play along. If this is a Grail-related issue, we should cross-reference against Grail keywords. I\u0027ll add a proximity parameter and remove the title weighting. That will limit our hits only to those instances of textual keywords that occur near aGrail-related word.\"\n Search for: KNIGHT, LONDON, POPE, TOMB\n Within 100 word proximity of: GRAIL, ROSE, SANGREAL, CHALICE\n \"How long will this take?\" Sophie asked.\n \"A few hundred terabytes with multiple cross-referencing fields?\" Gettum\u0027s eyes glimmered as she clicked the SEARCH key. \"A mere fifteen minutes.\"\n Langdon and Sophie said nothing, but Gettum sensed this sounded like an eternity to them.\n \"Tea?\" Gettum asked, standing and walking toward the pot she had made earlier. \"Leigh always loves my tea.\" \n","sourceLink":"https://allnovel.net/the-da-vinci-code-robert-langdon-2/page-26.html","bookId":2227,"book":{"id":2227,"title":"The Da Vinci Code (Robert Langdon #2)","description":"Storyline: \n While in Paris on business, Harvard symbologist Robert Langdon receives an urgent late-night phone call: the elderly curator of the Louvre has been murdered inside the museum. Near the body, police have found a baffling cipher. While working to solve the enigmatic riddle, Langdon is stunned to discover it leads to a trail of clues hidden in the works of Da Vinci-clues visible for all to see-yet ingeniously disguised by the painter. Langdon joins forces with a gifted French cryptologist, Sophie Neveu, and learns the late curator was involved in the Priory of Sion-an actual secret society whose members included Sir Isaac Newton, Botticelli, Victor Hugo, and Da Vinci, among others. In a breathless race through Paris, London, and beyond, Langdon and Neveu match wits with a faceless powerbroker who seems to anticipate their every move. Unless Langdon and Neveu can decipher the labyrinthine puzzle in time, the Priory\u0027s ancient secret-and an explosive historical truth-will be lost forever. The Da Vinci Code heralds the arrival of a new breed of lightning-paced, intelligent thriller... utterly unpredictable right up to its stunning conclusion.\n \n","cover":"https://allnovel.net/images/the-da-vinci-code-robert-langdon-2.jpg","author":"Dan Brown","type":"Thriller","source":"allnovel","link":"https://allnovel.net/the-da-vinci-code-robert-langdon-2.html","creation":"Oct 5, 2019 8:58:28 AM","modification":"Oct 5, 2019 11:04:08 PM"}}
