{"id":73374,"no":1,"title":"Page 1","content":"CHAPTER 1\n Tick. Tock. Tick. Tock. The disturbing clatter whined inside Jaxon Tremain’s mind, playing without permission or welcome. He laughed bitterly. He didn’t know how long he’d been locked up in the dank little cell. A week? An eternity?\n Perhaps an endless dirt nap loomed in his future. Yeah, undoubtedly. He should be glad. It would be another endless ticktocking, except there would be no pained awareness, no crazed waiting for death to—finally? blessedly? regrettably?—come.\n Survived worst, he thought, trying to comfort himself.\n Once, he’d been shot and burned with a pyre-gun. An accident during training, but his shoulder still bore the fire-seared scars. Another time, he’d been undercover, ratted out, then weighed down with steel beams and tossed into a muddy man-made river. Water and grime had filled his mouth, stinging like acid down his throat, into his lungs. When he’d miraculously fought his way free, he’d been surprised to find his skin still intact, muscle still glued to bones.\n Once, he’d been stabbed in the kidney. A straight cut, all the way through, severing one of his favorite organs. Foolishly, he’d turned his back on a suspect one second too long and adios, old friend.\n Sometimes that’s all that was needed. One second.\n The words echoed in his mind. One second was a single tick. Or tock. He laughed again, but the laughter soon turned to gagging and the gagging to coughing, the coughing to choking pain.\n “I’m going insane,” he muttered when he calmed. Not that the words were understandable. “Tickity, tockity, tickity, tockity.” How many more were left for him?\n Couldn’t be many.\n Being an Alien Investigation and Removal agent for New Chicago certainly has its perks, he thought dryly. ’Cause when an agent needed help breaking his nasty breathing habit, he got help.\n Since Jaxon’s abduction, a group of aliens had whaled on him so many times he’d lost count. They’d probably whale on him a thousand times more, fists flying at him in tune with that fucking clock. Tick, tock. Another laugh. Yep. Insane.\n The otherworlders had beaten him because he’d refused to answer their questions. Even when screams had erupted inside his mind, loud and discordant, mortality in every pitch, he hadn’t caved. Remembering the screams, he shuddered. Perhaps all the men and women he’d killed over the years had risen up, their souls fused with his as they finally made themselves known, determined to be heard at last.\n Now, at least, the screams were buried somewhere deep, replaced by that damn clock. A small price to pay, he supposed.\n Unfortunately, his body’s suffering had only intensified.\n He’d been punched in the mouth until his teeth shredded his gums. His tongue was the size of a baseball, so big he couldn’t even move it to ensure he was still the proud owner of all those pearly whites. His nose was broken, yet somehow the scent of urine still taunted him, blending with the metallic aroma of dried blood and sweat. His, a thousand others.\n His eyes were swollen, leaving only tiny slits. Not that there was much to see. Murky darkness failed to live up to its promise of sweet oblivion, revealing four barred walls, a plastic-lined floor to better clean any gore, and old-fashioned metal chains that continually sliced into his wrists and ankles like razors.\n Those chains rattled as he shifted to a more comfortable position against the bars. Big. Mistake. He winced as intense pain ripped through him; his air supply ground to a tormented halt. Several ribs were broken and any type of movement just cracked them farther apart and made inflating his lungs an impossible chore, hundreds of needle-sharp pricks cresting.\n Concentrate on something else, something enjoyable. Well, there was a bone protruding through his left arm and his right ankle was snapped back so far it was a miracle his foot hadn’t fallen off. That was better, right?\n Survived worse, he reminded himself. Dated Cathy Savan-Holt.\n A stick banged against his cage.\n Jaxon stiffened with the realization that he was no longer alone. His vision was blurred as he scanned the small enclosure, quickly landing on the intruder. Hate filled him. Hate—so helpless, a victim—frustration and a twinge of fear.\n The Delenseans had returned.\n Not the party-loving race we always thought they were. Jaxon wondered if they’d come for interrogation or round eight of human piñata. Maybe both. He’d noticed the six-armed bastards sometimes liked to multitask. Either way, Jaxon had probably reached the end of the line.\n Bye-bye, breathing habit.\n The other-worlders had to be tired of his lack of cooperation. They had to know his lips were sealed no matter what they did to him.\n I led a good life. Kind of. As a trust-fund baby whose grandparents and parents had helped rebuild the city after the war and still had their fingers in several security businesses, he had more money than God, had traveled the world, and had friends who would die for him. Some already had. But he’d remained unattached to any semblance of home and hearth, distanced from nearly everything around him.\n That distance seemed foolish now.\n More banging. “Scared?” a heavily accented voice taunted. Metal creaked against metal as the door opened.\n Darkened as the cell was and swollen as his lids were, Jaxon could only make out a shadowy outline. “You’re kidding, right?” He barely managed to work the words past his enlarged tongue, wasn’t even sure the bastard could understand him. “I’ve missed you, been counting the minutes till you returned and all that shit.”\n “You sound terrible. Like a drunk.”\n “Fuck you.”\n “Now that I understood.” A pause, a laugh. “You know, you weren’t this brash when I followed you all those weeks. Undetected,” the alien added smugly. “You were always so reserved, so stoic. Not a single curse ever passed your lips.”\n Yes, Jaxon was known for his patience and manners. He’d taught himself to exude both. Forced himself to exude both, actually. Sometimes he could even pretend the serenity came naturally, that he didn’t have to fight for it every second of every day.\n “No explanation?”\n About what? What had they been discussing? Oh, yeah. His lack of etiquette. “Amazing what having your toenails ripped off will do to a guy’s personality.” Actually, this was the real him. The sarcasm he usually repressed, and the potty mouth he usually flushed before a single bad word could escape. Safer that way. For everyone. Right now, however, he didn’t give a shit what he acted like or what the consequences were. “Want me to show you? Prove it?”\n “Tsk, tsk, tsk.” Not a hint of anger laced the alien’s tone. He was too cocky for that, too assured of his power. “So brazen you are. So foolish.”\n “Shoulda abducted Dallas, then. He’s the smart one.” Under normal circumstances, Jaxon would never have uttered another agent’s name. But this group of Delenseans had been studying A.I.R. for weeks. Undetected, he inwardly mocked. They practically knew more than Jaxon. Everything from day-to-day operations at headquarters to where the agents lived and what their hobbies were.\n They’d taunted him with the information. Chuckled like every word had been a gut-busting joke. Even now, there was a sound track of their jeers in his ears: Five o’clock sharp, Dallas arrives. He drinks a cup of coffee, talks to Kitty. Ghost shows up, usually eight minutes late. He has a new girlfriend and has trouble leaving her.\n They’d been able to take Jaxon from his own home quickly, expertly. Easily. As he remembered, embarrassment heated his cheeks. What kind of agent allowed himself to be taken from home? Answer: a bad one. Now there was a joke.\n No way could he have been prepared, though. Shockingly, the blue-skinned aliens had mastered molecular transport. Something humans hadn’t yet done, though they’d been working on it for a long time. Must be an innate ability of the race rather than technology. Still.\n Mortifying how quickly he’d been taken by the unadvanced race. One minute Jaxon had been lounging on his couch, drinking beer and watching virtual play-offs, and the next three Delenseans surrounded him, grinning like they’d just received swallow-it-all blow jobs. The next, he’d been here.\n “Sleeping?” the alien asked, breaking the silence.\n “Yeah. Maybe you should go. Let me rest.”\n “And maybe Dallas is already on my To Be Captured list.” Again, the bastard sounded smug.\n “I’m sure he’ll love the accommodations. You’re such a good host, Deli. Maybe I’ll invite you to my home sometime. Show you my toys.”\n Rather than rile him, Jaxon seemed to amuse him all the more. “Call me Thomas. We’re going to be on much more…intimate terms, you and I.”\n Jaxon didn’t have to rack his brain to interpret that little gem. Rape, the one thing they hadn’t done yet. Don’t give him a reaction. You slept with Cathy, remember. Nothing worse. “Deli, man.” He was careful to enunciate every syllable, wanted the words understood. “Hate to hurt your feelings, but you’re not my type.”\n The alien shrugged. “I will be soon enough, I’m sure.”\n He drew in a slow breath, held…held—god, the pain—then released it just as slowly. In, out. In—he stilled, frowned. Thoughts of rape receded, drowned by an intoxicating awareness. What was that delicious fragrance? He inhaled again; his nostrils twitched. And then he knew.\n The Delensean wasn’t alone.\n The otherworlder emitted a whiskeylike scent, yet Jaxon smelled something sweet and heady. Something floral. His blood heated and his skin pulled tight. His stomach clenched. His shaft even twitched in its first show of interest since his imprisonment—and long before.\n Jaxon blinked in surprise. Weak as he was, the reaction should have been impossible, yet his body was acting like the fragrance was laced with undiluted pheromones. That must mean—\n Woman.\n Human? Alien? Does it matter? Enemy, definitely.\n He’d always enjoyed the scents women slathered over their bodies, but this one seemed so much more everything than anything else he’d ever encountered. The perfume was utterly feminine and wholly alluring, like a drug. Illegal. Enthralling. He could have basked in it for hours.\n “Brought you a present this time,” Thomas said. He chuckled, as if remembering another of his lame-ass jokes. “I hope you like her.”\n A second shadowy figure stepped around the other-worlder, not moving closer to Jaxon but staying at a distance so that she could most likely study him. A long moment thundered by in silence. He could tell that she was tall for a female. Probably five nine or five ten. Blonde, if the bright halo glowing around her head was any indication.\n “His eyes are practically sealed shut,” she said, her voice husky and rich. Sexy.\n Jaxon’s blood heated another degree, shocking and angering him. What kind of moron lusted after his executioner? And there was no doubt in his mind that’s what she was. Why else would she be here? Tick, tock. A muscle under his eye spasmed. That annoying counting had begun yet again. Damn it. What would it take to get rid of it? Death?\n “Is that a problem?” Thomas asked her.\n “You know I like to see their eyes when I work.”\n This time, there was a princess-whine in her tone that might have been amusing in any other situation. She made him think of a little girl who’d asked Santa for a pony but had found a kitten under the tree instead. The kitten wasn’t what she’d wanted, so the kitten wouldn’t to be tolerated.\n “My apologies, Marie,” Thomas said, and damn if he didn’t sound like he meant it. “The agent provoked our wrath.”\n Sincere remorse from Thomas? Marie must frighten him. Interesting.\n Marie sighed angrily and stretched a hand toward Thomas. “We’ll discuss this later. Was he given a truth serum?”\n “Of course. He told us his name was Minnie Mouse and he lived on Nightmare Lane.”\n “Training people to fight such drugs should be illegal,” she muttered. “My tools, please.”\n Don’t speak; don’t you dare speak. “You don’t need any tools, honey.” The words left on a determined burst, unstoppable, meaning to prove his fearlessness. But leaving it at that would have proven the opposite, so even though he wanted to remain silent, he purposefully added, “Come sit on my lap and I’ll tell you everything you want to know.”\n He expected her to gasp, to stomp over and slap him. Maybe part of him hoped to goad her into beginning whatever she had planned. Nothing was worse than waiting, not even the electric-shock nipple clamps they’d used earlier, and those had provided a bitch of a hurt.\n Marie merely gave another of those pouting sighs and said to Thomas, “Yes, I see what you mean. His attitude is quite maddening. Though that doesn’t excuse your behavior,” she added. “You invited me here. As your guest, I expect my desires to be heeded.”\n “Of course. His face will not be touched again.”\n “Good. What has he told you so far?”\n “Outside the lies, nothing. No matter what we’ve done to him,” Thomas said, obviously perplexed, “he’s told us nothing about the virus.”\n “That’s because he knows nothing,” Jaxon muttered. Another lie, of course. He knew a lot more than even his boss assumed. And as Marie and Thomas muttered between themselves, some of the memories began flickering through Jaxon’s mind.\n “You and you alone will work this one,” Jack Pagosa had said, handing him a sealed golden folder. Jack’s usually ruddy face had been pale, his eyes constantly darting to the office door as if he expected someone to burst inside at any moment, gun in hand. His thick salt-and-pepper hair stood on end, his hands plowing through it every few seconds. \n","sourceLink":"https://allnovel.net/savor-me-slowly-alien-huntress-3/page-1.html","bookId":1768,"book":{"id":1768,"title":"Savor Me Slowly (Alien Huntress #3)","description":"Storyline: \n Savor Me Slowly (Alien Huntress #3) \n HALF HUMAN, HALF MACHINE...ALL WOMAN \n Mishka Le\u0027Ace was created to be an undercover operative...literally. Her beautiful body has been mechanically augmented to give her superhuman strength -- strength she\u0027s going to need. Her latest mission sends her to rescue Alien Investigation and Removal agent Jaxon Tremain from torture and death. With him, she discovers a passion unlike any other. A passion she was forbidden to know.... \n From the moment they meet in a darkened cell, Jaxon craves her touch. But the machine half of Le\u0027Ace forces her to do things she doesn\u0027t always want to do. Even betray him...and ultimately destroy him. Now Jaxon must battle the man controlling Le\u0027Ace, and even Le\u0027Ace herself, to at last claim the woman he\u0027s come to love.\n \n","cover":"https://allnovel.net/images/savor-me-slowly-alien-huntress-3.jpg","author":"Gena Showalter","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/savor-me-slowly-alien-huntress-3.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:26:55 AM"}}
