{"id":73384,"no":11,"title":"Page 11","content":"He hadn’t lied to her; he didn’t want her to leave. He wanted her to stay here. With him. Not because he had questions for her, and not because he’d gone months without sex. He wanted her to stay because the thought of another man looking at her, touching her, kissing her like this, nearly sent him into a rage. Those goddamn marriage memories must be screwing with his head.\n Nothing else explained the fact that at that moment he didn’t give a shit about who or what she was. He didn’t even care that she wanted something from him, was using him. She was a woman, and he was a man. Here, now, pleasure mattered. Nothing else.\n “Open your mouth for me,” he told her gently. Don’t scare her away. “Please.”\n She trembled, her legs brushing his inner thighs. Dear God. Then, slowly, she obeyed his command-plea. He thrust his tongue inside and moaned in heady pleasure.\n She tasted better than he could have dreamed, a decadent blend of mint, woman, and need. His cock jerked, straining against his jeans, and he had to fight off the intensifying need to climax. He couldn’t stop kissing her, though. Not now, perhaps not ever.\n “Good?” she asked, breathless.\n “Exquisite.”\n A shiver moved along her spine. He followed the delicious reaction, fingers tracing every ridge. I’m caressing those tattoos. The very thought heated him. The colorful array of flowers painted into her skin: lilies, roses, orchids, and lush emerald leaves were raised in places, he noticed. Scars? Probably. He brushed them again, offering comfort.\n She shivered again.\n And that’s when he realized that she shivered when aroused. He replayed the last hour in his mind and countrd the number of times she’d shivered. Three.\n Thank God.\n He would rather have been stabbed than rejected by her.\n Right now she was his and everything about her was surprising him.\n She had a robotic arm, yet that beautiful artwork decorated her back, her spine acting as a trellis to all kinds of vibrant foliage. She could kill a man without blinking, yet looked like a nervous teenager at the mention of a kiss.\n That nervousness surprised him most of all and filled him with determination to move slowly, gently, even though his body demanded he throw her down, pin her, take her as hard and fast as possible, branding himself into every inch of her. Staking a claim.\n He tilted his head for deeper contact and her tongue moved tentatively against his.\n He groaned. Slow and easy. Don’t scare her, he reminded himself. The hesitance could be an act on her part, but he didn’t care.\n One of his hands eased from her lower back and up her side, until his palm met the swell of her breast. Small, as he’d once imagined, but perfect. Firm yet soft. His hips arched forward of their own accord, seeking the very core of her as he turned his wrist and cupped that delectable mound.\n “Jaxon,” she panted as she pulled away.\n He almost grabbed her neck and jerked her back. He needed more of her lips, more of her taste. Would die without them. Slow and easy, remember? His hand returned to her waist. “Too much too fast?”\n Rather than answer, she licked her lips. When he saw the pink tip of her tongue—I’ve touched it, I’ve tasted it—his erection swelled to the point of pain.\n “Maybe,” she finally said, “Will you just, I don’t know. Will you pretend like this is my first kiss?” Her gaze fell to his chest. “Will you tell me what you’re going to do before you do it?”\n He froze, saw vulnerability claim her for a split second, and frowned as a thought arose. “Are you a virgin, Mishka?” Stranger things were possible, he supposed.\n She shook her head, long hair tickling his thighs. “I just, I don’t know,” she said again. Twin red circles tinged her cheeks, and she started to pull away completely, severing all contact. “Never mind. Forget I said anything. I shouldn’t have done this. I—”\n “Be still. Please.” He tightened his grip. “I’ll pretend anything you want,” he told her softly. And he would. Whatever her reasoning, he would do it.\n A game—fine. Liked to role-play—even better. Except, as he sat there staring up at her tormented features, neither explanation settled well with him. With her uncertainty, her reluctance to touch, and now a need to pretend, he began to suspect something dark and sinister had happened to her.\n “Mishka, were you raped?”\n She stiffened. Didn’t speak.\n He shouldn’t have asked, but he was now pretty certain she had been. Fury welled inside him. Calm, stay calm. He could rage later, privately. “Brace your knees on the edge of the bed, baby, one on each side of me. But only if you want to,” he added. Please want to. He’d never begged a woman for sex, but he just might do it now.\n She nibbled on her bottom lip, leaving a sheen of wet and red, as if she’d sucked on a syn-fruit and juice had dribbled. God, he wanted to be the one to nibble. Wanted to glut himself on her.\n Her gaze darted from him to the mattress, from the mattress to him. For a moment, he thought she meant to leave him. Then she did as he’d asked and the needy core of her settled over his throbbing erection.\n Both of them hissed in pleasure-pain.\n As if she couldn’t stop herself, she rubbed her breasts against his chest. He had to see them again, those small, pink-tipped beauties. “I’m going to remove your bra. Stop me if I do anything you don’t like. Okay?”\n “Okay.” Slowly, tentatively, she straightened her spine. He lifted his arms, just as unhurried. Before he reached the material, she captured his hand and twined their fingers. Buying time?\n The contrast of their skin, deep tan against cream, proved to be a lovely sight. Giving her the time she needed, he spent a long while simply basking before drawing her wrist to his mouth and placing a soft kiss. Both actions surprised him, for they spoke of affection, something he had no business feeling.\n “Ready now?” he asked.\n She nodded, then blinked in surprise at her own admission. Some of the hesitation vanished from her, replaced by thrums of eagerness and curiosity, shock and pleasure. She shivered.\n He’d watched her fasten the bra from behind, so he reached around her. Her skin broke out in sensitive little bumps everywhere he touched. When the clasp was undone, he paused. “Ready?” he asked again. Rushing and frightening her was suddenly more abhorrent to him than leaving her and spending the next few hours in a state of pained unsatisfaction.\n “Yes,” she whispered.\n He blazed a slow path to the upper straps, hooked them on his fingers, and slid them off. The bra floated down and pooled between their bodies, leaving her breasts bare. Christ. In that moment, he converted to a new religion: the worship of Mishka Le’Ace.\n Her nipples were pink and hard as he remembered, little berries he planned to sample over and over again before the night was over.\n “Would you like it if I removed my shirt?” he asked her.\n Blessedly, she gave another nod.\n Though he would much rather knead her breasts, suck them, he gripped the hem of his shirt and lifted. He tossed the material to the floor before flattening his hands on her back and urging her forward. She did not resist. When her soft breasts met the hardness of his muscles, he closed his eyes and groaned.\n He resisted the urge to roll her onto her back, to claim and possess. “I’m going to lick your nipples.”\n “Yes.”\n His tongue flicked over one hard bud, then the other. Delicious. Perfect. He could have stayed there forever, worshipping, but she soon stopped writhing, even stiffened.\n Okay, no breasts. Not yet. “I’m going to kiss your mouth again.” She’d nearly erupted last time he’d kissed her. “When I do, I might touch between your legs.” Maybe she’d like that as much as the kiss.\n “Yes. Okay.”\n He gripped the back of her neck and drew her forward. Her mouth opened instantly, her tongue rolling around his, desperate, eager. An eternity passed as they kissed, lost in each other.\n “More?” he asked, panting.\n “Yes.” The word was little more than a groan. “I’m hot. I ache.”\n The words were as potent as a fist on his cock. “That’s good, but I want you hotter, achier.”\n “Make me come. Please.”\n The last was uttered so hesitantly, he doubted she’d ever said it before. “It will be my pleasure.”\n Their lips met again. Softly, gently. His tongue stroked inside, her heady flavor filling him as before, yet somehow it was a whole new experience. She opened for him completely, feeding from him.\n Her head tilted, silently asking him to go deeper, to take more. He obeyed without question, cupping her cheeks and rolling his tongue over hers. A groan escaped her, and her hands slid up to grip his scalp.\n Motions jerky, as if she couldn’t control herself, she rocked against his erection. The actions nearly undid him, but he didn’t stop her. He tried her breast again, kneading, the nipple stabbing into his palm.\n When he pinched, she gasped.\n “Too painful?”\n “Good. I liked.” Her head fell back, exposing her neck and the wildly thumping pulse at the base. “More.”\n He licked at the pulse while pinching both nipples. Mishka was soon shaking, nails drawing blood.\n “Are you wet for me?”\n “I think so.”\n He thought so, too. The sultry fragrance of her arousal was wafting around them. Slowly, he trailed his fingertips downward. Her stomach quivered, and he stopped to pay homage to her navel, dipping inside with his thumb. Then, he was moving again. Finally he reached the hem of her panties.\n Black lace, just as he’d imagined the first time he’d seen her. They molded her breathtaking curves to perfection. Her waist was perfectly spanned, her legs long and lean as they tapered down, and the fine little triangle of hair between them was the same multihued color as the hair on her head.\n “So pretty,” he praised.\n “Jaxon,” she beseeched.\n He circled her clitoris over the panties, and she gasped. The material was damp, just as he’d suspected. Sweat trickled down his temples as he found the edge and worked his fingers under. Christ! He touched her, skin to moist desire, and every muscle in his body clenched as if he’d just hooked himself to an electric generator.\n “Oh, God.”\n He spread her, and Mishka cried his name. He sank one finger inside her. God, she was tight, hot. “Okay?” he asked, strained.\n “More. Please more.”\n He pumped that finger in and out, then worked in a second. “Ride my hand, baby. Up and down. You decide the pace. All right?”\n Immediately her hips arched forward, sliding him deeper. She pulled back a moment later, then arched forward again. Holy lord, she was so wet she had already drenched his hand. The knowledge filled him with possessive male pride. I did this. She desires me. Craves my touch.\n Soon she was rocking against him in a steadily increasing rhythm, panting his name, tugging at his hair, pinching his back.\n “That’s it. That’s the way.” His cock ached to replace his fingers. His skin was on fire, his blood like lava. Any moment, he expected to explode. Worth it, he thought, looking at her enraptured expression. So worth it.\n Her eyes were closed, the long lashes casting decadent shadows on her cheeks. Her teeth were biting at her lower lip, so sharp they were drawing blood. Every few seconds, little moans escaped her.\n “Next time, I’m going to lick you where I’m touching you. I’m going to fuck you with my cock rather than my fingers.” As he spoke, he worked her clit with his thumb.\n Her movements became all the more frantic, all the more uncoordinated. Finally she stilled, calm before the storm. Shocked. Then she screamed and her inner walls clamped down on his fingers, holding them captive.\n In that moment, pleasure bombarded him. She was too hot, too wet, too sensual and erotic. She was a fantasy come to sizzling life. Hot seed jetted from him, the most intense orgasm of his life ripping through him though he’d never penetrated her. Sweet Christ. Good, so good. Too good. He was panting, releasing groans of his own. Lost.\n He only snapped out of the blissful daze when she collapsed against him, her shoulders sagging and her head falling onto his shoulder. She stayed like that for a long while, on his lap, legs spread, his fingers still inside her. He couldn’t have moved if someone had placed a gun to his head. Satisfaction had never been so complete. Which was odd and wrong. So very wrong. He’d actually come in his jeans.\n “That was so good—” she whispered in his ear. “I want to do it again and again. I want—”\n A phone suddenly beeped.\n Mishka stiffened and glanced at the nightstand. Dread curling through him, but not overshadowing his total sense of satisfaction, damn it, he followed the direction of her gaze and saw the standard cell unit every agent carried.\n “I have to go,” she said, voice broken.\n “No. You’re staying here.” With me.\n She pushed away from him, forcing his fingers out of her. He fisted them, her arousal glistening. He wanted to lap it up, but didn’t allow himself the luxury.\n “You don’t understand,” she said, gathering her bra. Her legs were so shaky she almost toppled.\n He pounded the fist into the mattress. “Then explain it to me.”\n The phone beeped again. She stalked to it as she dressed. “I’m a puppet, and my strings are being pulled. Okay? Get it now?”\n Before he could respond, she swiped up the phone and barked, “I’m on my way.” She paused, listening. “Yes.” Pause. “I know, damn it. I said I’m on my way.” She hung up.\n She braced herself, as if expecting a punishing blow. \n","sourceLink":"https://allnovel.net/savor-me-slowly-alien-huntress-3/page-11.html","bookId":1768,"book":{"id":1768,"title":"Savor Me Slowly (Alien Huntress #3)","description":"Storyline: \n Savor Me Slowly (Alien Huntress #3) \n HALF HUMAN, HALF MACHINE...ALL WOMAN \n Mishka Le\u0027Ace was created to be an undercover operative...literally. Her beautiful body has been mechanically augmented to give her superhuman strength -- strength she\u0027s going to need. Her latest mission sends her to rescue Alien Investigation and Removal agent Jaxon Tremain from torture and death. With him, she discovers a passion unlike any other. A passion she was forbidden to know.... \n From the moment they meet in a darkened cell, Jaxon craves her touch. But the machine half of Le\u0027Ace forces her to do things she doesn\u0027t always want to do. Even betray him...and ultimately destroy him. Now Jaxon must battle the man controlling Le\u0027Ace, and even Le\u0027Ace herself, to at last claim the woman he\u0027s come to love.\n \n","cover":"https://allnovel.net/images/savor-me-slowly-alien-huntress-3.jpg","author":"Gena Showalter","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/savor-me-slowly-alien-huntress-3.html","creation":"Oct 5, 2019 8:57:56 AM","modification":"Oct 5, 2019 10:26:55 AM"}}
