{"id":28293,"no":5,"title":"CHAPTER IV THE SENSES IN DREAMS","content":"All Dreams probably contain both Presentative and Representative Elements—The Influence of Tactile Sensations on Dreams—Dreams excited by Auditory Stimuli—Dreams aroused by Odours and Tastes—The Influence of Visual Stimuli—Difficulty of distinguishing between Actual and Imagined Sensory Excitations—The Influence of Internal Visceral Stimuli on Dreaming—Erotic Dreams—Vesical Dreams—Cardiac Dreams and their Symbolism—Prodromic Dreams—Prophetic Dreams. At the outset I adopted provisionally the usual classification of dreams into two classes: the peripheral or presentative group, excited by a stimulus from without, and the central or representative group, having its elements in memories. If, however, we look carefully at the matter, in the light of the experiences which we have encountered, it will be found that this classification, however superficially convenient it may be, fails to correspond to any radical duality of dream phenomena. When we closely question our dream experiences, it ceases to be clear that they really fall into two groups at all. On the one hand, it would appear that most, perhaps, indeed, all dreams that are sufficiently vivid to be clearly remembered on awakening, have received an initial stimulus from some external, or at all events,[72] peripheral source.[56] There is something unusual or uncomfortable in the sleeper\u0027s position, or he has been subjected to some slight unusual strain which has modified his nervous condition, or there has been some deviation from his usual diet, or a physiological stress of some kind is making itself felt within him—careful self-questioning constantly reveals the actual or probable existence of some external or certainly peripheral stimulus of this kind. So that we seem entitled to say that in all dreams there is probably a presentative element. On the other hand, an even more cursory investigation of our dream life suffices to show that in every dream there is also a representative element. No dream can be said to be strictly and literally presentative. If, when I am seemingly asleep, a person speaks to me, and I become conscious that he is present and speaking,[73] I am not entitled to say that I \u0027dream\u0027 it. A consciousness which perceives facts in the same way as they may be perceived by waking consciousness is not a dreaming consciousness. So that there are, in the literal sense, no presentative dreams. What happens is that the stimulus, instead of being presented directly to consciousness, and recognised for what it is to waking consciousness, serves to arouse old memories and ideas which dream consciousness accepts as a reasonable explanation of the external or peripheral stimulus. The stimulus may be said to be, in a sense, the cause of the dream, but the dream itself remains central, and as truly a combined picture of mental images as though there were no known peripheral stimulus at all. Thus, while it is true that the division of dreams into two classes corresponds to a recognisable distinction, it is yet a superficial and unimportant distinction. It is likely that all dreams have a peripheral or presentative element, and certain that they all have a central or representative element. This will become clearer if we now proceed to discuss those dreams which have, demonstrably, their exciting cause in some external or internal organic stimulus. The world which we enter through the portal of sleep presents such obvious and serious limitations that we are apt to under-estimate its real richness and variety. In some respects, indeed, we can accomplish in sleep what is beyond our reach awake. Thus it sometimes happens that we reason better in sleep than when awake, that we may find in dreams the solutions of difficulties[74] which escape us awake, and that we may remember things which, when awake, we had forgotten. But even within the ordinary range of experience, it is interesting to note that our dreams contain the same elements as our waking life. The sensory activities which stir us during the day are equally active, though in strange transformations, in the world of dreams. It is probable that all the senses may furnish the medium through which stimuli may reach sleeping consciousness; though touch and hearing are doubtless the main channels to dream life. The eyes are closed, so that while the chief parts of our dream life are in terms of vision, direct visual stimuli can only be a very dim and uncertain influence. But no sense is absolutely excluded from activity in dreams.[57] Heat or cold sensations and pressure sensations, as well as their anaesthetic absence, undoubtedly play an important part in explaining various kinds of dreams. They do not necessarily result in rememberable dreams, even although it is possible that they still affect the current of sleeping consciousness. It is possible to press and massage the body of a sleeper all over, gently but firmly, without interrupting sleep. When the pressure[75] reaches a considerable degree of vigour, the sleeper may move a muscle, perhaps the lips, even an arm, may go so far as to half wake and move the whole body. All these movements suggest that they have accompaniments on the psychic side, yet, on finally awakening, the sleeper may be unable to recall any memory of the occurrence, or any vestige of a dream. In a certain proportion of cases, however, a dream results. Thus a lady dreams that, with a number of other people, she is on board a ship which is rocking heavily, and on awakening she finds that her large dog is on the bed, vigorously scratching himself. The ship has clearly been the theory invented by sleeping consciousness to account for the unfamiliar sensations of movement. When living in the south of Spain, I awoke early one morning, and heard a mosquito buzzing. I fell asleep again and dreamed that a huge insect—as large as a lobster, but flat like a cockroach, and scarlet in colour—had alighted on my hand. The creature had two long horns, and from each of these proceeded numerous very long and delicate filaments which were inserted into my hand to a considerable depth. I had to cut the creature in half, and draw away the forepart, which was attached to my hand, with great care lest I should leave portions of the filaments in the flesh. This animal seemed all the more unpleasant because it was noiseless, and its attacks, I thought, imperceptible. I appeared to be attacked by a succession of them. On awakening, there was irritation of the left wrist, as though the[76] mosquito had bitten me, although I had long ceased to be bitten by mosquitoes. This dream, it will be seen, corresponds in an unusually close way to the idea of a presentative dream; imagination followed reality in presenting an insect as the cause of the sensation experienced (possibly because I had actually heard the mosquito when awake), but still, as in all dreams, the process was mainly central, and imagination was freely exercised in creating a creature adequate to explain the doubtless vague and massive cutaneous sensations transmitted to sleeping consciousness.[58] Perhaps one of the commonest skin sensations to excite dream formation is that of cold due to disturbance of the bed coverings. The following example may serve as an illustration of this class. I dreamed that I was in an hotel, mounting many flights of stairs, until I entered a room where the chambermaid was making the bed; the white bedclothes were scattered over everything, and looked to me like snow; then I became conscious that I was very cold, and it appeared to me that I really was surrounded by snow, for the chambermaid remarked that I was very courageous to come up so high in the hotel, very few people venturing to do so on account of the great cold at this height. I awoke to find that it was a cold night, and that I was entangled in the sheets, and partly uncovered. Nothing else[77] had occurred to suggest this dream which sleeping consciousness had elaborated out of the two associated ideas of altitude and snow in order to explain the actual sensations experienced. It is noteworthy that, as in the dream just before narrated, there was here also a link with reality, this time furnished by the disarranged bedclothes.[59] The auditory experiences of dreams, to a greater extent perhaps than those involving the sense of touch, may be based on spontaneous disturbances within the sensory mechanism. This is notably also the case with visual experiences, and in many respects the conditions in the ear are analogous. Apart from increased resonance of the ear, or hyperaesthesia of the auditory nerve, producing special sensitiveness to sounds, an increased flow of blood through the ear, as well as muscular contractions and mucous plugs in the external ear, furnish the faint rudimentary noises which, in sleep, may constitute the nucleus around which hallucinations crystallise. Disease of the ear may obviously act in the same way, but, even apart from actual disease, various nervous disturbances favour the production of auditory hallucinations during sleep, and, in marked cases, even awake. We may dream of listening to music in the absence of all external sounds having any musical character. In such cases, no doubt, the actual conditions[78] within the auditory mechanism are suggesting music to the brain, but the resulting music seems usually to be less definite, less rememberable, than when it forms around the nucleus of an external series of sounds. In many of these cases it is probable that we do not hear music in our dream; we are simply under conditions in which we imagine that we hear music. Thus, on going to bed soon after supper, but not perceptibly suffering from indigestion, I dreamed that I was present at a public meeting combined with an orchestral concert. A speech was to be made by a man who looked like an old sailor or soldier, and meanwhile the orchestra was playing. The speaker—unaccustomed, I gathered, to the etiquette of such a meeting—suddenly interrupted the orchestra by a remark, and the surprised conductor stopped the performance for a moment and then continued, subsequent remarks by the speaker failing to affect the music, which continued to the end, becoming more lively and vigorous in character. But what the music was, I knew not at the time, nor could I recall any fragment of it on awakening. It is even possible that such a dream is mainly visual, and that no hallucinatory music is heard, its occurrence being merely deduced from the nature of the vision. If the dreams evoked by sounds within the ear are usually difficult to trace in normal persons under ordinary circumstances, this is not the case with dreams suggested by sounds which strike the ear from without. These constitute one of the most interesting groups of dreams as well as one of the easiest to explain, and[79] they are very frequent.[60] Their mechanism may, indeed, be observed under some circumstances even in the waking state. In some persons, music, a voice, a bird\u0027s song, even a word, a comment, arouse phantoms of colour and form, light and shade, coloured clouds, streams, waves, etc. The phenomena are especially rich when produced by an orchestra. Such \u0027music-phantoms,\u0027 as they are termed, are a special and freer development of the narrow and rigid phenomena of \u0027colour-hearing.\u0027 They have been studied by Dr. Ruths.[61] We have to remember that music possesses a fundamental motor basis. As Dauriac remarks, music may be defined as \u0027movement clothed with sound.\u0027[62] It tends to produce movement, or, failing movement, to produce motor imagery.[63] Dreams excited by definite external auditory stimuli may be of various character. A not uncommon source—especially for those who live on a wind-swept coast—is the occurrence of storms. A lady dreams, for instance, that her little dog has fallen off a high cliff and that she[80] hears his shrieks; it was an extremely windy night, and her window was open. The dream has some resemblance to one which Burdach recorded that he shared with a companion in an hotel during a storm; they both dreamed they were wandering at night among high precipices. On one occasion I awoke in the middle of a windy night imagining I had been listening to an opera of Gluck\u0027s (which in reality I had never heard), and experiencing all the sense of delicious waves of melody which one actually experiences in listening to such operas as Alceste. A fragment of a melody I had heard in the dream still persisted in my memory on awaking, so that I could mentally repeat it, when it seemed as agreeable as in the dream, though unfamiliar. The following dream had also a similar origin. I imagined that I was assisting at a spectacle of somewhat dubious erotic character, in company with other persons who, out of modesty, covered their faces with their hands with the decorous gesture which recalled (as dream consciousness evidently realised) that of people during prayer in church. Thereupon a beautiful voice was heard in the background loudly chanting a versicle of the Te Deum. This awoke me, and I seemed to realise when half awake that the voice I had heard in the dream was a real voice. There had, however, been no real voice, only the loud howling of the wind and the beating of the rain on the window panes. Once, on a very windy night, and when, perhaps, suffering a trifling disturbance of health—for there was slight pleurodynic pain the next morning—I dreamed[81] I was quietly at home with friends, when suddenly the sky became illuminated. We found that this was due to steady and continuous lightning, a state of things which remained throughout the dream, the sky presenting the appearance of a cracked and crushed sheet of melting ice.[64] By and by, fragments of buildings and similar debris were whirled past in the air, and I caught sight of a woman driven above me by her skirts. We now realised the imminent approach of a terrific cyclone which, at any moment, might carry the house and ourselves away. I remembered no more. Yet another dream may be mentioned as likewise directly due to a violent storm and the rattling of a window near my bed. The latter sound evidently recalled to sleeping consciousness the sound of the rattling window of a railway train, and I dreamed that I was travelling to Berlin with a medical friend. There were the accompaniments, not unfamiliar in dreams, of rushing along interminable platforms, and up and down endless stairs, finding myself in a carriage of the wrong class, with, in consequence, more wandering along corridors, and finally finding that my friend had been left behind. The character of the dream may have been influenced by slight indigestion. In this dream, unlike those already recorded as due to external stimuli, the elements of the dream were not the pure invention of dreaming imagination, but compacted entirely of ideas that had been recently familiar. [82] The following dream was due to an auditory stimulus of different character. I dreamed that I was listening to a performance of Haydn\u0027s Creation, the orchestral part of the performance seeming to consist chiefly of the very realistic representation of the song of birds, though I could not identify the note of any particular bird. Then followed solos by male singers, whom I saw, especially one who attracted my attention by singing at the close in a scarcely audible voice. On awakening, the source of the dream was not immediately obvious, but I soon realised that it was the song of a canary in another room. I had never heard Haydn\u0027s Creation, except in fragments, nor thought of it at any recent period; its reputation as regards the realistic representation of natural sounds had evidently caused it to be put forward by sleeping consciousness as a plausible explanation of the sounds heard, and the visual centres had accepted the theory. However far-fetched and improbable our dreams may seem to the waking mind, they are, from the point of view of the sleeping mind, serious and careful attempts to construct an adequate theory of the phenomena. The imagery is sought from far afield only to fit the facts more accurately. Thus a lady dreamed that her dog was being crushed out flat in a large old-fashioned box-mangle. She awoke to find that water from a burst pipe was falling from the ceiling on to the floor on the landing outside her door, close to where the dog had his bed. She had never seen a mangle of this kind since she was a child, or had any occasion to think of it, but[83] the rhythm and sound of it somewhat resembled that of the falling water. One more example of an auditory dream may be given. I dreamed that I was back in a schoolroom of my boyhood, with two or three of the present masters. The room had been entirely changed, and it contained much new school apparatus and, notably, on a table, several miniature engines, of different character, actually working. I said to the masters that I wished all these apparatus had been there twenty years ago (a considerable under-estimate of the actual interval since I left that schoolroom), so that I might have enjoyed the benefit of them. \u0027All life is made up of machinery,\u0027 I found myself uttering aloud as I awoke, \u0027and unless you understand machinery you can\u0027t understand life.\u0027 It was not till some moments later that I became conscious of a faint whirring sound which puzzled me till I realised that it was the sound of distant machinery entering through the open window. This had, undoubtedly, suggested the engines of the dream, though I had not been conscious in my dream of hearing any sounds, and the small size of the dream engines corresponded to the faintness of the actual sounds. Dreams aroused by odours do not usually seem to occur except on the experimental application of them to the sleeper\u0027s nostrils, and experiments in this direction are not usually successful.[65] Occasionally, however, [84]smell dreams occur without any traceable sensory source, and Grace Andrews, for instance, records a dream of the sea, accompanied by the seashore odour, \u0027a pure and rich sensation of smell.\u0027 In my own case olfactory dreams have been rare and insignificant. Taste, as we usually understand it, really involves, as is well known, an element of smell, and taste dreams of this kind seem to occur from time to time under the influence of any slight disturbance of the mucous membrane of the mouth or slight indigestion. It is possible that the latter element was present in the following dream: I imagined that, following the example of a friend, I gave some cigarettes to a tramp we had casually met, and that, in return, we felt compelled to drink some raw gin he carried. I did so with some misgiving as to the possible results of drinking from a tramp\u0027s flask, but although in real life I had not tasted gin for many years, the hot burning taste of the spirit was very distinct. On awakening, my lips seemed hot and dry, and it was doubtless this labial sensation which led dream consciousness to seek a plausible explanation in cigarettes and spirits. Although the spirit seemed to[85] have the specific flavour of gin, it is always difficult, if not impossible, in dream sensations, to distinguish between what one feels and what one merely concludes that one feels. In such a case, that is to say, it remains doubtful whether the labial sensation evokes the specific hallucination of gin, or whether it merely suggests to sleeping consciousness that the gin has been tasted, much as it is possible to suggest to the hypnotised person that the substance he is tasting is a quite different substance, that salt is sugar, or that water is wine. As with dreams of smell, it is not always possible to detect any external stimulation as the cause for a taste or pseudo-taste dream.[66] This may be illustrated by a dream which belongs strictly to the tactile class; I dreamed that I called upon a medical acquaintance whose assistant I found in a dark surgery. I absently took up a broken medicine bottle and put it to my mouth, when my friend came in. I spoke to him on some medical topic, but he entered his carriage, and was driven off before he had time to answer me. I then found that my mouth was full of fragments of broken colourless glass, which I carefully removed. This dream was constructed, in the manner which has been often illustrated in the previous pages, of small separate incidents which had occurred during the immediately preceding days. One of the incidents[86] was the fact that I had myself smashed a little coloured (not colourless) glass and carefully picked up the fragments. But the vividest part of the dream was the sensation of broken glass in the mouth, and on awaking no sensation could be detected in the mouth. So that though the most plausible explanation of such a dream would be the theory that the recent experience with broken glass had suggested to sleeping consciousness the explanation of an unpleasant sensation actually experienced in the mouth, there was nothing whatever to support that theory. The falling of light on the closed eyes, or the half opening of the eyes, has been found to serve as a visual stimulus to dreams, but I have myself no decisive evidence on this point.[67] In the case of a lady who dreamed that a lover was in her room, and that suddenly the door opened, and she saw her mother standing before her with a bright light, which awoke her, she could find nothing in the room, no light, to account for the dream. It is, of course, unnecessary for a dream of a bright light to be actually produced by an external visual stimulus accompanying the dream, for the spontaneous retino-cerebral activity itself produces sensations of light. Thus, on the night after a pleasant walk in a country lane through which the setting sun[87] shone, I dreamed that I was walking along a lane in which I saw a bright light and my own vast shadow in front of me. It would seem that, on the whole, the curtain of the eyelids effectually shuts out light from the eye during sleep, and that the sense which is more active during the day than any other is the most carefully guarded of all during the night. The peculiarly delicate and unstable nature of the chemical basis of vision makes up for this protection from external stimulation, and by its spontaneous activity ensures that even in dreams vision is the predominant sense. What we find as regards the part played in dreams by excitations arising from the external specific senses holds good also for excitations arising from internal organic sensations. The main difference is that the stimuli which reach sleeping consciousness from the organs within the body—the stomach, heart, lungs, sexual apparatus, bladder, etc.—are usually more vague and massive, more difficult to recognise and identify, than are the more specific sensory stimuli which reach us from without. These visceral excitations may be transformed within the brain into imagery so unlike themselves that we may refuse to recognise them, and must frequently experience some amount of hesitation. Evidence of this fact will come before us in due course later on. I only wish to refer here to the more obvious part played in dreams by sensations arising within the body. We should expect that the visceral processes to be[88] translated most clearly and directly into dreaming consciousness would be, not those which are regular and continuous, but those which assert themselves, more or less imperiously, at intervals. This is actually the case. The heart, for instance, probably plays a part in dreams only when disturbed in its action, and even then nearly always a very transformed part. On the other hand, when the impulses of the generative system arise in sleep to manifest themselves in erotic dreams, the resulting imagery is usually very clear, and with very definite and recognisable sexual associations. Erotic dreams are, indeed, in both men and women, among the most vivid of all dreams, and the most emotionally potent.[68] The bladder, again, is an internal organ which makes its functional needs felt only at intervals, and thus, when those needs occur during sleep, they become conscious in imagery which easily recalls the source of the stimulus. It may, indeed, be said that vesical dreams are full of instruction in the light they throw on the psychology of dreaming. This has long been well known to writers on dreams. Thus Scherner, many years ago, insisted on the interest and importance of vesical dreams. In women, especially, he regarded them as very frequent and developed, most dream stories of women, he considered, containing symbolic representations of this organic irritation. Water, in some form or another, is naturally the commonest[89] symbol. In Scherner\u0027s opinion, also, all dreams of fish playing in the water are vesical dreams.[69] In its simplest form the vesical dream is what Freud would term a wish-dream of infantile type, frequently in the magnified form common in dreams, and sometimes transferred from the dreamer himself to become objectified in another person, or even an inanimate object.[70] There is, however, a very important difference according to whether these dreams take place in an adult or in a young child. In the adult it almost invariably happens that the dream act remains merely a dream act, and no corresponding motor impulse is transmitted to the bladder. But when such dreams occur to very young children, in whose brains the motor inhibitory mechanism is not yet fully established, it not infrequently happens that the motor impulse is transmitted and the expulsive action of the bladder is set up in sympathy with the imagery of the dream; thus is established the condition known as nocturnal enuresis. As the young brain develops, and inhibition becomes more perfect, these vesical dreams cease to exert any actual effect on the bladder, even when, as sometimes happens, they continue to occur at intervals[90] in adult life.[71] Occasionally, both in those who have and those who have not suffered from nocturnal enuresis in childhood (especially women), vesical dreams of this character may occur without even any real distension of the bladder. In some of these cases the dream can be shown to be due to a reminiscence or suggestion from the waking life of the previous day. Dreams stimulated by organic sensations from within are thus found to resemble those proceeding from sensory sensations from without in that they are both exactly simulated by dreams which are mainly of central origin. When we turn to those internal organs of the body which normally carry on their functions in a constant and equable manner, seldom or never obtruding themselves into the sphere of consciousness, any disturbance of function seems much less likely to be translated into dream consciousness in a simple and direct form. It is sufficient to take the example of the heart. When the heart is acting normally any consciousness of its action is as rare asleep as awake. Even when cardiac action is disturbed, either by disease or by temporary excitement, dream consciousness seldom realises the physical cause of the disturbance. Occasionally, indeed, the cardiac disturbance may reach sleeping consciousness without any very remote transformation;[91] thus a lady dreams that she is fainting while really breathing in a slightly laboured and spasmodic way; but at another period the same lady, at a time when she was suffering from some degree of heart weakness, dreamed one night, when the trouble was specially marked, that she was driving sweating horses up a steep hill, urging them on with the whip in order to avoid an express train which she imagined was behind her. This dream of sweating and panting horses climbing a hill has been noted by various observers to occur in connection with heart trouble.[72] The real difficulty of the panting and struggling heart instinctively finds its apparent explanation in a familiar spectacle of daily life. In another case a dreamer awoke from a disturbed sleep associated with indigestion, having the impression that burglars were tramping upstairs, but immediately realised that the tramp of the burglars\u0027 feet was really the beating of her own heart. Somewhat similarly, when suffering from headache, I have dreamed of hammering nails into a floor, a theory obviously invented to account for the thump of throbbing arteries. An interesting group of phenomena connected with the sensory influences discussed in this chapter is furnished by the premonitions of physical disorders and diseases sometimes experienced in dreams. A physical disturbance may reach sleeping consciousness many hours, or even days, before it is perceived by[92] waking consciousness, and become translated into a more or less fantastic dream. This has been recognised from of old, and Aristotle, for instance, observed that dreams magnify sensory excitations, and pointed out that they were thus useful to the physician in diagnosing symptoms not yet perceptible in the waking state. Thus Hammond knew a gentleman who, before an attack of hemiplegic paralysis, repeatedly dreamed that he had been cut in two down the middle line, and could only move on one side, while a young lady who dreamed she had swallowed molten lead, though quite well on awaking, was attacked by severe tonsilitis toward midday. Erythematous conditions of the skin, as has been pointed out to me by Dr. Kiernan, who has met with numerous cases in point, play an especial part in generating these dreams. Jewell, again, mentions a girl who dreamed, three days before being laid up with typhoid fever, that some one threw oil over her and set light to it. Macario, who was, perhaps, the first to record and study scientifically the dreams of this class, termed them prodromic.[73] \u0027Prophetic\u0027 dreams, in which the dreamer foresees, not a physical condition which is already latent, but an external occurrence, belong to an entirely different[93] class, and need not be discussed in detail here, since they are usually fallacious. A fairly common experience of this kind is the dream of an unknown person who is afterwards met in real life. These dreams fall into two groups: in the first the \u0027prophecy\u0027 is based on a failure of memory, the dreamer having really seen the person before; in the second, the subsequent \u0027recognition\u0027 of the person is due to the emotional preparation of the dream, and the concentrated expectation. Sante de Sanctis, who points this out, gives an experience of the kind which happened to the distinguished novelist, Capuana, who had a vivid dream of a dark lady, with expressive eyes, and three days after met the lady of his dream in the street.[74] Women, in a state of emotional expectation, have often mistaken dead (or even living) persons for missing husbands or children, and any one who has observed how, when a noted criminal flies from justice, he is soon \u0027recognised,\u0027 from his portrait, in the most various parts of the world, will have no difficulty in believing that it is easily possible to \u0027recognise\u0027 people from dream portraits, which are much vaguer than photographs. That there are other prophetic dreams, less easy to account for, I am ready to admit, though they have not come under my own immediate observation.","sourceLink":"http://novel.tingroom.com/duanpian/3024/83654.html","bookId":1069,"book":{"id":1069,"title":"The World of Dreams","description":"简介： There are at least four different ways of writing a book on dreams. There is, for instance, the literary method. In this way one goes to books or to the memories of other people for one\u0027s material, and so collects a great number of more or less wonde...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3024","creation":"Aug 1, 2019 12:24:18 AM","modification":"Aug 1, 2019 12:24:18 AM"}}
