{"id":73023,"no":16,"title":"Page 16","content":"He was rather proud of his compromise—not the part about chaperoning the dance, but the shared-driving idea. By the time Carrie had left his apartment, he felt like an expert. Raising children wasn’t so difficult if you applied a bit of common sense.\n Now, though, he wasn’t entirely sure he should get involved. The dance was an issue between Charlotte and Carrie, and his instincts told him he was trespassing.\n It would’ve been different if Charlotte had come to him for advice, but she hadn’t and he doubted she would. There wasn’t any reason for her to, at least not with regard to Carrie. Charlotte was the one with parenting experience, not him.\n Despite his second thoughts over his role in this drama, he’d agreed to help Carrie—even though his instincts now told him he was going to regret this.\n Carrie answered the doorbell and smiled brightly when she saw him.\n Charlotte looked pleased to see him, too, but she also looked like she’d rather not be. Jason was learning to read her quite well, and that skill was coming in handy.\n “Hello, Jason,” she said softly.\n “Hi. I stopped by to see how Higgins is doing.” A weak excuse, and one she was bound to see through in the next couple of minutes.\n The black dog trotted toward him, his tail wagging slowly. Jason squatted beside him and affectionately rubbed his ears. “How do you like your new home, fellow?” he asked.\n “Do you want a cup of coffee?” Carrie called out from the kitchen. Her voice was enthusiastic. The kid wasn’t any better at disguising her emotions than her mother was.\n “Please.” Jason glanced up at Charlotte. He didn’t know what was going on with her lately. She’d been avoiding him—that much he understood—but he was willing to give her the space she needed. For now. He was a patient man. She was attracted to him, fighting it as hard as she could, but her resistance wasn’t strong enough to defeat him.\n For the first time in his life, Jason had met a woman who needed him. Unfortunately she was too self-sufficient and proud to admit it. Charlotte Weston brought out all his protective urges. And his intuition told him he’d begun to bring out qualities in her—a sensual confidence and an ability to laugh, have fun—that she’d been repressing for years.\n The woman was a puzzle, but slowly, surely, he was putting together the various pieces she revealed. Once he had the whole picture, he’d be able to scale those defensive walls of hers.\n He strongly suspected Charlotte’s problems revolved around her ex-husband and her marriage. She’d been badly hurt, and gaining her trust and her love would require time and patience. Where Charlotte was concerned, Jason had an abundant supply of both. Carrie brought him a cup of coffee, and Jason pulled out a kitchen chair, then nonchalantly sat down. Carrie did the same. Higgins ambled over and settled at his feet.\n Charlotte glanced at the two of them and frowned. “Is something going on here that I should know about?”\n The kid couldn’t have been more obvious, Jason mused again. “Carrie came to me earlier this afternoon,” he announced, deciding honesty was the best policy, after all. The way he figured, if they were forthright about what they’d discussed, then Charlotte might be willing to forgive them for discussing it behind her back.\n “Jason,” Carrie muttered a warning under her breath.\n “Carrie came to you?” Charlotte demanded. “About what?”\n “The dance,” Carrie admitted sheepishly.\n “You went to Jason about an issue that’s strictly between you and me?”\n “I needed to talk to someone,” Carrie cried, pushing back the chair when she stood. She faced her mother, feet braced apart, hands on her hips. “You’re being completely unreasonable and Jason agrees with me. He came up with—”\n “Carrie.” Jason could see he’d been wrong. In this case, honesty might not have been the best policy. “I didn’t ever say I thought your mother was unreasonable.”\n His defense came too late. Charlotte whirled on him, her face red and growing redder. Her eyes, the eyes he’d always found so intriguing, were filled with disdain.\n “Who gave you the right to intrude in my life?” she flared.\n “Charlotte, it’s not what you think.” Jason could feel himself sinking waist-deep in the quicksand of regret.\n “You’re undermining my authority.”\n “Mom…please, hear me out.”\n “Charlotte, give me a chance to explain.” Jason didn’t have much of an argument; he should’ve listened to his instincts and stayed out of this.\n “You may think because…because I’ve let you get close to Carrie and me that you have the right to express your opinion on how she should be raised, but you’re wrong. What goes on between my daughter and me is none of your business. Do I make myself clear?”\n Feeling all the more chagrined, Jason nodded. The best thing to do now was make a hasty retreat. “I can see I’ve—”\n “Just go.” Charlotte’s voice trembled as she pointed to her door.\n “Mom,” Carrie shouted. “The least you can do is listen to him.”\n Charlotte ignored her daughter while Jason, calling himself every kind of fool, made his way out of the apartment. He paused long enough to cast an apologetic glance at Carrie, but he agreed with Charlotte. He’d butted in where he didn’t belong.\n After Jason’s departure, Carrie went to her room, slamming her door with such force Higgins scrambled across the living room, frantically looking for a place to hide.\n Charlotte was so angry, it was all she could do not to follow Jason and tell him she never wanted to see him again. She would have done it, too, if she didn’t know she’d regret it later. And if she didn’t need to coax Higgins out from behind the couch and comfort him.\n The man had some nerve! If Carrie thought she was going to manipulate her into giving in by getting Jason to side with her, then her daughter was wrong.\n “I hope you realize what you’ve just done!” Carrie shouted as she opened her door.\n Still stroking Higgins, Charlotte ignored her.\n “You’ve insulted Jason.”\n “He deserved it.”\n “Like hell.”\n “Watch your language, young lady.”\n Thirty silent minutes passed while Charlotte cooled her temper. Carrie was apparently doing the same thing. A short while later, her bedroom door opened again and she walked out. She was pale and her eyes showed evidence of crying, but she appeared to have composed herself.\n The same didn’t hold true for Charlotte. She was still furious. How dare Jason involve himself in her affairs!\n “I’ve called Brad,” Carrie announced, opening the refrigerator. She stared at the contents, took out a cold pop and pulled back the tab. After taking one long drink, she turned to face Charlotte. “Brad said he’d tell his dad you’d be driving us to and from the dance.”\n Of all the things Charlotte might have expected, this wasn’t one. “Good,” she said, feeling only a little better.\n “I…was hoping you’d be willing to split the duties. Let Brad’s father drive us there and you pick us up.”\n Charlotte mulled it over. That didn’t sound so unreasonable. She’d have a chance to meet the boy’s father when he came to get Carrie, and it wasn’t as if the two kids would be alone in the car—or at the dance.\n “I…I’d be willing to agree to that.”\n Charlotte thought Carrie would be grateful or relieved; instead she broke into giant hiccuping sobs. Her daughter slumped in a kitchen chair and buried her face in her arms and wept as if she’d lost her best friend.\n “Carrie.” Charlotte placed her hand on Carrie’s shoulder. “What’s wrong?”\n She raised her head and brushed the tears from her face, her shoulders heaving with the effort to stop crying. “You should never have said those things to Jason.”\n “Carrie, he intruded in my affairs.”\n “But I was the one who asked him to talk to you. If you’re going to be angry with anyone, it should be me, not him.”\n Charlotte realized Carrie didn’t understand the nuances of a male-female relationship. Frankly, she wasn’t that well acquainted with them herself. She’d admit that she’d reacted in anger, but it was justified. Jason had simply assumed too much.\n “But Jason didn’t want to interfere,” Carrie sobbed. “It took me forever to get him to agree and…and he only did it because I was desperate.”\n “He overstepped the bounds.” Charlotte tried to remain adamant.\n “You made him leave without even bothering to listen.”\n Charlotte said nothing.\n “I like Jason—and you do, too,” Carrie added unnecessarily. “He’s the best thing that’s ever happened to us. Higgins is alive because of him and…and he took us to meet his family. Saturday was the most fun day I’ve ever had. It…it was like we belonged with Jason and his brothers.”\n Charlotte had felt the same way.\n “Jason wasn’t minding your business, Mom, at least not the way you think. He…he was helping a friend. Me. And you hated him for that.”\n “I don’t hate Jason.” Far from it. She was falling in love with him.\n “He’s the one who came up with the idea of Brad’s father driving one way and you driving the other. He…he suggested you chaperone the dance just so you’d feel comfortable about everything.” She drew in a shaky breath. “When I told him you’d need a date for the dance if you were going to be a chaperone, he said he’d take you. I mean, Jason isn’t the kind of man who dances…but he’d be willing to do it, for me, because he’s my friend. And for you, too, so you’d be comfortable at the dance. And what did he get for being so nice?”\n “My anger,” Charlotte whispered, feeling wretched.\n “You kicked him out of the house, and I don’t think he’ll ever want to come back. I know I wouldn’t.”\n Charlotte sat down next to her daughter, feeling strangely like weeping herself.\n “I wanted to go to the dance with Brad more than anything,” Carrie admitted, “but now I don’t care if I do or not.”\n “Carrie, this isn’t the end of the world.”\n “I really like Jason,” she said emphatically. “When I asked him if he’d ask you out, I did it for selfish reasons, and I apologize for that…but I’m glad I did it. You’re happier when you’re with him, Mom. You don’t think I notice, but I do. Jason makes you smile and laugh and forget how much you don’t like your job.”\n Charlotte folded her arms around her middle. What Carrie said was true. It was as if her life had started all over again when Jason first kissed her.\n “I don’t care about the dance anymore,” Carrie murmured. “But I care what happens with you and Jason. Go to him, Mom. Tell him you’re sorry. Please.”\n Her daughter’s entreaty affected Charlotte more than any regrets she might feel about what she’d said and done. For one thing, she hadn’t realized how fond Carrie was of Jason. \n","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-16.html","bookId":1982,"book":{"id":1982,"title":"The Manning Grooms (Those Manning Men #0)","description":"Storyline: \n The Manning Grooms (Those Manning Men #3-4) \n Jason Manning is content with his life as a bachelor, a slob and a sports fan. Then a precocious girl named Carrie Weston decides to play matchmaker, introducing him to her mother, Charlotte. To his relief, Charlotte is as averse to marriage as he is. But Jason\u0027s feelings start to change once he gets to know his Bride on the Loose.\n \n","cover":"https://allnovel.net/images/the-manning-grooms-those-manning-men-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-manning-grooms-those-manning-men-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:59 AM"}}
