{"id":73038,"no":31,"title":"Page 31","content":"“Are you all right?” he felt obliged to ask.\\n\\n She nodded and bit her lip. He realized how pale she was and wondered if she was about to faint.\\n\\n “Let me help.” He wasn’t some knight who rescued damsels in distress. Life was filled with enough difficulties without taking on another person’s troubles. Yet he couldn’t resist helping her.\\n\\n She answered him with a quick nod of her head.\\n\\n “Let’s get out of here,” he suggested.\\n\\n “I’ve been trying to do exactly that for the last twenty minutes.” Her voice was tight.\\n\\n James wasn’t sure he could do any better, but he planned to try. Taking her by the hand, he slipped around a couple kissing passionately, then past a group of teens with dueling horns, the discordant sound piercing the night. Others appeared more concerned with catching the ashes raining down from the fireworks display than with where they stood.\\n\\n Perhaps it was his age or the fact that he sounded authoritative, but James managed to maneuver them through the crush. Once they were off Fremont Street, the crowd thinned considerably.\\n\\n James led her to a small park with a gazebo that afforded them some privacy. She sank onto the bench as if her legs had suddenly given out from under her. He saw that she was trembling and sat next to her, hoping his presence would offer her some solace.\\n\\n The fireworks burst to life overhead.\\n\\n “Thank you,” she whispered. She stood, teetered, then abruptly sat back down.\\n\\n “You want to talk about it?” he asked.\\n\\n “Not really.” Having said that, she promptly burst into tears. Covering her face with both hands, she gently rocked back and forth.\\n\\n Not knowing what to do, James put his arms around her and held her against him. She felt warm and soft in his embrace.\\n\\n “I feel like such a fool,” she said between sobs. “How could I have been so stupid?”\\n\\n “We’re often blind to what we don’t want to see.”\\n\\n “Yes, but…Oh, I should’ve known. I should’ve guessed there was someone else. Everything makes sense now…I couldn’t have been any blinder.”\\n\\n He shrugged, murmuring something noncommittal.\\n\\n She straightened, and James gave her his pressed handkerchief. She unfolded it, wiped away the tears and then clutched it in both hands.\\n\\n “I’m sorry,” she choked out.\\n\\n “Talking might help,” he said.\\n\\n She took several moments to mull this over. “I found him with another woman,” she finally said. “He wanted me to come to Vegas with him after Christmas, and I couldn’t get time off from work. So I said he should go and have fun with his friends. Then…then I was able to leave early this afternoon. I wanted to surprise him on New Year’s Eve and I drove straight here. I surprised him, all right.”\\n\\n And got the shock of her life, too, James mused.\\n\\n “They were in bed together.” Her words were barely audible, as if the pain was so intense she found it difficult to speak. “I ran away and he came after me and…and tried to explain. He’s been seeing her for some time…. He didn’t mean to fall in love with her, or so he claims.” She laughed and hiccuped simultaneously.\\n\\n “You were engaged?” he asked, noting the diamond on her left hand.\\n\\n She nodded, and her gaze fell to her left hand. She suddenly jerked off the diamond ring and shoved it into her purse. “Brett seemed distant in the last few months, but we’ve both been busy with the holidays. I noticed he didn’t seem too disappointed when I couldn’t get time off from work. Now I know why.”\\n\\n It was preferable to learn about her fiancé’s roving eye before she married him, but James didn’t offer platitudes. He hadn’t wanted to hear them himself.\\n\\n “The problem is, I really love him.” She shook almost uncontrollably. “I want to claw his eyes out, and yet I know I’ll always love him.”\\n\\n “Are you hoping to patch things up?”\\n\\n She raised her head. “No. It’s over. I told him that and I meant it. I could never trust him again, but you know what?” She hesitated and drew in a deep breath. “I think he was grateful when I broke the engagement. He doesn’t want me back—he wants her.” She stiffened, as if bracing herself against an attack.\\n\\n “It hurts right now, but it’ll get better in time,” James said, squeezing her hand.\\n\\n “No, it won’t,” she whispered. “It’ll never get better. I know it won’t.”\\n\\n James partially agreed with her. Part of him would always belong to Christy Manning. Even now, he had trouble remembering her married name. She wasn’t Christy Manning anymore, but Christy Franklin, and her husband was the sheriff of Custer County, Montana.\\n\\n “Yes, it will, but it’ll take a year,” James said briskly.\\n\\n “Not with me. I’ll never get over Brett.”\\n\\n “You believe that right now, because the pain’s so bad you can’t imagine it’ll ever go away, but it does, I promise you.”\\n\\n Slowly she turned to study him. “You know? It sounds as if you’re talking from experience.”\\n\\n He nodded. “Five years ago the woman I loved broke off our engagement.” He laughed derisively. “You see, there was a small problem. She married someone else while she was engaged to me.”\\n\\n “That’s terrible,” she said with a sigh of righteous indignation. “What kind of woman would do that?”\\n\\n “It’s not as bad as it sounds. You see, her parents are good friends of mine, and I realize now they pressured Christy into accepting my engagement ring. She was fond of me and agreed because she wanted to make her family happy. I don’t think she ever realized how much I loved her.”\\n\\n “Do you still love her?”\\n\\n It might have been a kindness to lie, but James found he couldn’t. “Yes, but not in the same way.”\\n\\n “Despite what I know, I can’t picture myself not loving Brett.” She straightened and wiped the tears from her cheeks. “I suppose I should introduce myself since I’ve cried all over your shoulder. I’m Summer Lawton. From Anaheim.”\\n\\n “James Wilkens. Seattle.”\\n\\n They exchanged brief handshakes. Summer lowered her gaze. “I wish I could believe you.”\\n\\n “Believe me?”\\n\\n “That it’ll take a year to get over Brett. It doesn’t seem possible. We’ve been dating for nearly five years and got engaged six months ago. My whole life revolved around him.”\\n\\n At one time James’s life had revolved around Christy.\\n\\n “We were apart for less than a week,” Summer continued, “and I was so lonely, I practically went through contortions to get to Vegas just so we could be together tonight.”\\n\\n “The first three months are the most difficult,” he told her, remembering the weeks after the breakup with Christy. “Keep busy. The worst thing to do is stay at home and mope, although that’s exactly what you’ll want to do.”\\n\\n “You don’t understand,” she insisted. “I really love Brett.”\\n\\n “I really love Christy.”\\n\\n “It’s different for a man,” she said.\\n\\n “Is it really?” he countered. “A year,” he reiterated. “It’ll take a year, but by then you’ll have worked through the pain.”\\n\\n Her look revealed her doubt.\\n\\n “You don’t believe me?”\\n\\n “I just don’t think it’s possible. Not for me. You see, I’m not the type who falls in love at the drop of a hat. I gave everything I had to Brett. It’s like my whole world caved in and there’s nothing left to live for.”\\n\\n “Shall we test my theory?” he asked.\\n\\n “How?”\\n\\n “Meet me back here on New Year’s Eve, one year from tonight.”\\n\\n “Here? In this gazebo?”\\n\\n “That’s right,” he said. “Right here.”\\n\\n “Same time, same place, next year.”\\n\\n “Same time, same place, next year,” he echoed.\\n\\n One\\n\\n Summer picked up the mail on the way into her apartment and shuffled through the usual bills and sales flyers. The envelope was there, just as it had been on the first of the month for the past eleven months. A letter from James.\\n\\n He couldn’t possibly have any idea how much she looked forward to hearing from him. The first letter had come shortly after they’d met on New Year’s Eve and had been little more than a polite inquiry. She hadn’t written him back mainly because she was embarrassed about spilling her heart out to a complete stranger.\\n\\n His second letter had arrived February first. He told her about the weeks immediately after his breakup with Christy, how the pain had intensified when he’d expected it to lessen. His honesty and generosity touched her heart. It seemed uncanny that her anguish mirrored his so completely. She wrote back then, just a short note to tell him how she was doing, to thank him for writing.\\n\\n That was how it had started. James would write at the beginning of every month and she’d answer. Gradually their letters grew in length, but were never any more frequent. She liked the formality of exchanging letters, preferring that to the quick and casual convenience of e-mail.\\n\\n In the year since Summer had met James Wilkens, she’d been tempted to phone him only once. That was the day Brett got married. Ironically, his wife wasn’t the girl he’d brought to Las Vegas, but someone he’d met recently. Summer had felt wretched and holed herself up in her apartment with a quart of gourmet ice cream and three rented movies. She’d made it through the day with a little fudge swirl and a lot of grit.\\n\\n Holding James’s letter in her hand, Summer tore open the envelope and started reading on her way into the apartment.\\n\\n “That’s from your lawyer friend, isn’t it?” Julie, her roommate, asked. Wearing shorts and a halter top, Julie wandered barefoot through the apartment, munching on a carrot.\\n\\n Summer nodded, kicked off her shoes and lowered herself onto a padded wicker chair. Her eyes never wavered from the page.\\n\\n “He wants to remind me of our agreement,” Summer said, pleased he hadn’t forgotten.\\n\\n “Agreement?”\\n\\n “To meet him in Vegas on New Year’s Eve.”\\n\\n “Are you going?”\\n\\n Summer had always planned to follow through on her promise, although she probably should’ve thought twice about meeting a stranger. But he wasn’t really a stranger. She felt she knew James, was comfortable with him. He was a friend, that was all, someone who’d been there when she needed him.\\n\\n “Are you going?” Julie repeated.\\n\\n Summer looked up and nodded.\\n\\n “What’s James like?” Julie asked, sitting across from her. The two of them had been close ever since high school and both of them were in the production at Disneyland. Summer had been especially grateful for Julie’s unwavering friendship in the past year.\\n\\n “He’s older,” Summer said, chewing the corner of her mouth as she tried to recall everything she could about him. “I’d guess he’s at least forty. Kind of a stuffed shirt, to tell you the truth. He’s about six feet tall and he must work out or something because I remember being surprised by how strong he was.” \\n\\n","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-31.html","bookId":1982,"book":{"id":1982,"title":"The Manning Grooms (Those Manning Men #0)","description":"Storyline: The Manning Grooms (Those Manning Men #3-4) \\n Jason Manning is content with his life as a bachelor, a slob and a sports fan. Then a precocious girl named Carrie Weston decides to play matchmaker, introducing him to her mother, Charlotte. To his relief, Charlotte is as averse to marriage as he is. But Jason\u0027s feelings start to change once he gets to know his Bride on the Loose.\\n","cover":"https://allnovel.net/images/the-manning-grooms-those-manning-men-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-manning-grooms-those-manning-men-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:59 AM"}}
