{"id":73048,"no":41,"title":"Page 41","content":"“Girls, girls.” Helen returned with a salesclerk. “I wonder how long it’ll be before she considers us women?” Summer asked her friend under her breath. By evening Summer felt more like a French poodle than a bride. She’d been shampooed, her nails polished, her hair curled, her body massaged and moisturized. She’d been in and out of more clothes than a New York fashion model. And she was exhausted. The idea of a white suit for the wedding was one of the first ideas to go. Before Summer could argue, she was draped in satin and silk from head to toe. “You look absolutely stunning,” Helen said. Summer wasn’t sure she could trust her mother’s assessment. Her eyes went to Julie. “She’s right.” “But what about April?” “What about it?” Helen’s hands flew into the air. “You’ll wear the dress twice. Big deal. No one needs to know.” She tried another arguement. “It’s so much money.” “My baby girl only gets married once.” Well, no. She’d be getting married twice—to the same man, but still, there were going to be two ceremonies. Julie arranged the veil and the long train for the photographer who was on his way, then handed Summer the intricate gardenia bouquet. “If you’re going to throw that, just be sure and aim it my way.” Summer smiled. “You got it.” “Not yet, I haven’t,” Julie reminded her. A knock sounded at the door, and Helen answered it. Summer didn’t pay any attention, assuming it was the photographer her father had hired. A few minutes later, Helen introduced the tall, balding man. “Summer, this is James’s father, Walter. You should’ve told me he was a retired superior court judge himself.” Summer would have been happy to, had she known. “My, oh, my,” Walter said as he entered the room. He stood in front of Summer, hands on his hips, and he slowly shook his head. “And where did my son meet such a beauty?” “Here in Vegas,” Summer said. “A year ago.” “I was about to give up hope for that son of mine. It seemed to me he’d settled a little too comfortably into bachelorhood. This comes as a very pleasant surprise.” “I’m so glad you came to meet me and my family, especially on such short notice.” Walter withdrew a thick cigar from the inside of his suit pocket and examined the end of it. “Wouldn’t have missed it for the world.” Walter sat down and made himself comfortable. After a moment he returned the cigar to his inside pocket. “I quit smoking five years ago and I still miss it. Every now and then I take one out and look at it, just for the thrill.” Summer could see she was going to like James’s father. “To be frank, I didn’t think that boy of mine possessed this much common sense.” “He’s a judge,” Summer said, eager to defend her husband-to-be. “When it comes to the law, James is one of the finest men on the bench. He seems to be worried about the November election, but as far as I can see, he won’t have a problem. No, what I’m talking about is something else entirely.” Summer felt like sitting down, too. Both her mother and Julie had mysteriously disappeared, and since the photographer had yet to show up, she decided to relax. “Have you seen James?” she asked, missing him dreadfully. “Oh, yes.” “How is he?” She folded her hands, wondering what James was thinking and if he was sorry he’d gotten involved in all this. Everything had seemed so uncomplicated when they discussed it the night before. “He’s pacing in his room.” “Pacing,” she repeated, certain this was a bad sign. “It’s just as well this wedding’s going to happen less than an hour from now. I don’t think your father and brother could keep James away from you much longer than that.” Summer smiled in relief. “Never thought I’d see the day my boy would fall head over heels in love like this.” “But he was engaged before. I know about Christy Manning.” “Ah, yes, Christy. She’s a dear girl, and James had strong feelings for her, but deep down I believe what he found so attractive about Christy was her family. There’s quite a difference between the love James has for you and what he felt for Christy Manning. As you’ll recall, he was content to stay engaged to Christy for a good long while. But you…He’s marrying you so fast, my head’s spinning. His, too, from the looks of him. You’ve thrown him for quite a loop.” “I love James, too,” Summer said with feeling, “very much.” “Good. I hope the two of you will seriously consider making me a grandfather soon. I’m hoping for a grandchild or two to spoil.” “We’d like to have four.” “Four.” Walter nodded, looking pleased. “But you’re worried about something.” “Yes,” she said softly, wondering how he knew. “My biggest fear is that I’m not the right kind of wife for James. I’m afraid I might inadvertently harm his career.” “What makes you think that?” “I have this tendency to speak my mind.” “I find that refreshing.” “You will until I put my foot in my mouth and embarrass James. To give you an example…” She hesitated, not sure she should continue, then realized she couldn’t very well stop now. “I’m the one who suggested we get married.” “Really?” “It just…came out. It seemed like a brilliant idea at the time…you know how good things can sound until you’ve thought them through. Well, anyway, James stared at me like he’d swallowed his tongue.” Walter burst out laughing. “Forgive me, my dear. Continue, please.” “Naturally I felt like a fool. Mainly because James didn’t say anything and didn’t say anything and didn’t say anything, and I was convinced I’d ruined everything.” “He said nothing, did he?” “Well, he did mumble something about preferring to do the asking himself.” “And you clammed up.” “Oh, quite the opposite. I started talking at hurricane speed until he told me it was fine and I needn’t worry. And then, after I’d fallen all over myself telling him how sorry I was, he said he thought it was a good idea. James came up with the idea of a ceremony now and then one in April.” “He did?” Clearly this was news to his father. “Yes.” Summer grinned sheepishly. “He said something about impulsive thoughts being contagious.” “There’s more to the boy than I assumed.” There was another knock at the door, and the photographer let himself inside. “I’d better get back to James,” Walter said. “It’s been a delight meeting you, Summer. I don’t have a shred of doubt that you’re the best thing to come into my son’s life for a very long time. Make him happy, Summer, make him very happy.” “I intend to do my best.” “And while you’re at it, teach him how to laugh.” Summer nodded. “I’ll try.” She had a sneaking suspicion they had plenty to teach one another. James looked at his watch for the third time that minute. No one seemed to understand that he needed to see Summer. Needed to talk to her, find out about her day, tell her about his. If he’d had even an inkling that their wedding was going to cause such a big commotion, he would never have agreed to contact their families. James liked Summer’s parents, but he’d prefer to spend his time with her. Alone. “We can go into the chapel now,” Hank Lawton said. James was so grateful he felt like cheering. According to his calculations, the ceremony would take approximately twenty minutes, thirty at most. They’d sign the marriage certificate, and the rest of the night would be theirs. He couldn’t tolerate any more of these separations, however brief. The next time Summer left his sight would be at the airport. He saw her family in the small chapel, her brother’s children wide-eyed and excited as the organ music rose triumphantly. He noticed that the wedding chapel was almost full and wondered for just a moment who the other guests were. James went to stand in front with the minister, Reverend Floyd Wilson. James had rented the tuxedo because it seemed odd for the father of the bride to be wearing one and not the groom. Now, however, the shirt seemed too tight around the collar. He resisted the urge to insert his finger and give himself a little extra breathing space. It was then that Summer appeared. James felt as if someone had smashed him in the knees with a bat. Never in all his life had he seen anyone more beautiful. His heart beat so hard he thought it might pound straight through his chest. Her dress was silk and lace with pearls, as traditional a wedding gown as any he’d seen. One would think Summer was a debutante and this a society wedding. When she joined him at the altar and placed her arm in his, James felt this was the proudest moment of his life. He knew they’d repeat the ceremony in a few months, but nothing would match the blend of humility and pride he experienced right then. Her brother, Adam, was kind enough to serve as his best man, while Julie, of course, was the maid of honor. The ceremony itself was a blur. James’s full concentration was on the woman at his side. He knew she was feeling the same emotions he was when she began to repeat her vows. Summer’s voice shook slightly, and she sounded close to tears. His arm tightened around hers as the minister said, “I now pronounce you husband and wife. You may kiss your bride.” James didn’t need to hear that twice. Carefully he gathered Summer close, sighing when their lips met in the tenderest, sweetest kiss of his life. She clung to him. “Oh, James, how soon can we get rid of everyone?” He’d entertained that very question from the moment Summer’s mother had taken her away that morning. “Soon,” he promised. Heaven only knew how they were going to cope with being separated for the next four months. “After dinner.” They were hit with a barrage of birdseed on their way out the door. They laughed and tried to catch it in their outstretched hands. “Pictures,” Helen insisted, and when Summer groaned, she added, “Just a few more. That’s all.” “Mother, you’ll get plenty of pictures later.” “I want some now,” her mother insisted. But “some” turned out to be at least a hundred by James’s estimation. They signed the marriage license, and James took the opportunity to kiss his bride. “I don’t ever want to spend another day like this one,” he whispered. “Me, neither,” she said, then giggled. “But you’re going to get something out of it. Mother bought me this cute little black nightie.” James could feel the hot blood circle his ears and…other places. “Your mother bought you a nightie?”","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-41.html","bookId":1982,"book":{"id":1982,"title":"The Manning Grooms (Those Manning Men #0)","description":"Storyline: The Manning Grooms (Those Manning Men #3-4) Jason Manning is content with his life as a bachelor, a slob and a sports fan. Then a precocious girl named Carrie Weston decides to play matchmaker, introducing him to her mother, Charlotte. To his relief, Charlotte is as averse to marriage as he is. But Jason\u0027s feelings start to change once he gets to know his Bride on the Loose.","cover":"https://allnovel.net/images/the-manning-grooms-those-manning-men-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-manning-grooms-those-manning-men-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:59 AM"}}
