{"id":73012,"no":5,"title":"Page 5","content":"“I’m watching the Lakers game with Jason.” “Okay. We’re not going to move, are we?” “No, Jason was kind enough to let me withdraw my two-weeks’ notice.” “Oh, good. He’s a great guy, isn’t he?” “Yeah.” Charlotte was surprised by how much she meant it. Jason was a great guy. She hadn’t stumbled on many in the past few—or was that several?—years. It was a treat to encounter a man who was candid, sincere and fun. But Charlotte had been fooled by men before, so she wasn’t taking anything for granted. “Well?” Jason asked when she replaced the receiver. If she needed an excuse, he was handing her one on a platter. All she needed to do was make some vague reply about Carrie and she’d be on her way. “Carrie says she’ll call if she needs me.” “Excellent.” His smile was definitely charming, Charlotte decided. “How about some popcorn?” he asked. Charlotte nodded eagerly. She hadn’t eaten much dinner, unnerved as she was by her discovery, knowing she’d need to confront him. Jason’s offhand acceptance of her apology endeared him to her even more. If Jason was like her boss, he’d have flayed her alive. Instead, he’d just shrugged it off and given her a beer. “Let me help,” she said, following him into the kitchen. “There’s not much to do,” he said, opening his microwave and tossing a bag inside. He set the timer, pushed a button and within a minute the sound of popping kernels filled the kitchen. The smell was heavenly. When it was ready, Jason poured the popcorn into a large bowl and carried it out to the living room. Charlotte brought paper towels, since she couldn’t find any napkins. He placed the bowl in the middle of the coffee table and Charlotte joined him on the sofa. The game was about to resume. She tucked her feet beneath her as she’d done earlier, leaning forward now and then to scoop up some popcorn. It tasted wonderful, but that might’ve been because of the company. Or the fact that for the first time all day, she was feeling relaxed. The Lakers scored twelve straight points and Charlotte rose to her knees, cheering loudly. Normally she was far more reserved, more in control of her emotions. It was as if someone else had taken charge of her mind. Someone more free-spirited and uninhibited. Someone who’d downed two beers on a near-empty stomach. Apparently, hearing that her daughter was bribing men to date her had that kind of effect on her. Jason cheered, too, and they turned to smile at each other. Their eyes met and held for the longest time. Flustered and unnerved, Charlotte was the first to glance away. She hadn’t shared such an intense look with a man since college. A look that said, I’m enjoying myself. I’m attracted to you. I’d like to get to know you better…a whole lot better. Her heart was thumping as she forced her attention back to the TV. She took a deep swallow of beer to hide her discomfort. Jason went strangely quiet afterward, too. They both made a pretense of being involved in the game. As time went on, however, it wasn’t the Lakers who held their attention—it was each other. “So,” Jason said abruptly, “where do you work?” “Downtown, for a large insurance agency. You might’ve heard of them. Davidson and Krier. They have a radio commercial that’s played a lot.” In an effort, weak though it was, to disguise her uneasiness, she sang the all-too-familiar jingle. “I have heard of them,” Jason said, nodding. His rich baritone concluded the song. They laughed self-consciously. Charlotte wished she’d had the sense to leave at halftime. No, she amended silently, that wasn’t true. She was glad she’d stayed. If she regretted anything, it was that she was so clumsy when it came to dealing with male-female relationships. Maybe it wasn’t so strange that Carrie had tried to bribe someone to ask her on a date. Charlotte hadn’t been out with a man in three years. But she hadn’t really missed the dating scene. How could she miss something she’d never actually experienced? She’d hardly dated at all since Tom left. Tom. The accustomed pain she felt whenever she thought of her ex-husband followed on the heels of the unexpected attraction she felt toward Jason. The two didn’t mix well. One brought back the pain of the past and reminded her that she had no future. The other tempted her to believe she did. “I should be going,” she announced suddenly, her decision made. She scurried to her feet as if she had a pressing appointment. “The game’s not over,” Jason said, frowning. He didn’t move for a moment. “Don’t go yet.” “I’ll watch the rest of it at my place. Thanks so much for the wonderful evening. I enjoyed myself. Really, I did.” She picked up the empty popcorn bowl and the two beer bottles and took them into the kitchen. Jason trailed her, his hands buried deep in his pockets. He nodded at his garbage can, which was overflowing. There was a semicircle of half-filled bags stacked around it. “I’ve been meaning to take this out to the Dumpster,” he explained, removing the bottles from her hands and throwing them into a plastic recycling bin. “I appreciate how understanding you’ve been,” Charlotte said as she walked to the door. “About what?” he asked. “Carrie and me and…everything.” “No problem,” he said a few steps behind. He slipped in front of her and stood by the door. Charlotte knew she was running away like a frightened rabbit. The trapped feeling had returned and it terrified her as it always had. She’d thought it would be different this time, but that had been the beer. Her fears would never change, never go away. They’d always be there to remind her of her shortcomings, how inadequate she was, how no man could ever be trusted. Tom had proved that. She was anxious to be on her way now, but Jason was blocking her only means of escape. When she glanced up, some of the fear must have shown in her eyes because he hesitated, studying her. There was a short silence, too deep to last long, but too intense to ignore. Charlotte held his gaze for as long as she dared before looking away. His eyes were so blue, so serious, so filled with questions. She’d perplexed him, she knew, but she couldn’t explain. Wouldn’t explain. They’d laughed and teased and joked. But Jason was somber now. Funny, this mood was as appealing as the lightheartedness she’d sensed in him earlier. His mouth, even when he wasn’t smiling, was perfectly shaped. Everything about him was perfect. His high cheekbones, his wide brow and straight nose. Too perfect for her. The paralyzing regret threatened to explode within her, but Charlotte managed to keep it in check. How, she wasn’t sure. It must’ve been her fear, she decided. Fear of what could happen, the happiness a relationship with him could bring—and the disappointment that would inevitably come afterward. The disappointment he’d feel in her. Then it would be over almost before it had begun. She looked up one last time, to say goodbye, to thank him, to escape. In that instant she knew Jason was going to kiss her. But one word, the least bit of resistance, and he wouldn’t go through with it. Charlotte was completely confident of that. Need and curiosity overcame the anxiety, and she watched, mesmerized, as his mouth descended toward her own. His lips, so warm and seductive, barely touched hers. Charlotte closed her eyes, trembling and afraid. Her body, seemingly of its own accord, moved toward him, turning into his, seeking the security and the strength she felt in him. He moaned softly and Charlotte did, too, slanting her head to one side, inviting him to deepen the kiss. Yet Jason held back. The kiss was light. Sweet. More seductive than anything she’d ever known. It felt wonderful. So wonderful… Charlotte didn’t understand why he resisted kissing her completely, the way her body was begging him to. Restraining himself demanded obvious effort. She could tell by the rigid way he held himself, the way his hands curved over her shoulders, keeping her at bay. Keeping himself at bay. Her head was full of the promise his lips had made and hadn’t kept. Full of the possibilities. Full of the surprise and the wonder. She’d never felt like this before. Once again his mouth brushed over hers, warm and exciting. Moving slowly—so slowly—and so easy, as though he had all the time in the world. “Jason.” It was a battle for her to breathe. Her heart sounded like a frantic drumbeat in her ears, drowning out coherent thought. He tensed, then kissed her, really kissed her, wrapping himself around her, absorbing her in his size, his strength, his need. They remained entwined, arms around each other, until Charlotte could no longer stand. She broke away and buried her head in his shoulder, her breathing heavy. “Charlotte, I didn’t mean to frighten you.” “You didn’t.” It was the truth; any fear she felt had nothing to do with him. “I have to go…Thank you. For everything.” But most of all for that kiss, she added silently. It was unlikely he’d ever know how much that single kiss had meant to her. Three He’d kissed her. He’d actually kissed Charlotte. An hour later, Jason still had trouble taking it in. Oh, he’d kissed plenty of women in his day. But this time, with this woman, it was different. He didn’t know how he understood that, but he did. He’d realized it long before he’d touched her. Perhaps because she was so different from what he’d assumed. He’d figured she was dignified, straitlaced, unapproachable. Then, as soon as he’d told her about basketball rules, she’d kicked off her shoes and was cheering as enthusiastically as he was himself. What a contrast he found in her. Prim and proper on the outside, a hellion waiting to break loose on the inside. She intrigued him. Beguiled him. At some point during their evening together—exactly when, he couldn’t be sure—he’d felt an unfamiliar tug, a stirring deep within. The feeling hadn’t gone away. If anything, it had intensified. What they’d shared wasn’t any ordinary kiss, either. Perhaps that explained it. They’d communicated on an entirely different level, one he’d never known before. It seemed their spirits—the deepest, innermost part of themselves—had somehow touched. He shook his head. He was getting fanciful. No, this wasn’t the kind of kiss he’d had with any other woman. He’d never gone so slowly, been so careful. Although she’d acted blatantly provocative, urging him to deepen the contact, he’d resisted. That same inner voice that had said Charlotte was different had also warned him to proceed with caution. He’d sensed how fragile she was, and the urge to protect her, even from himself, had been overwhelming. Jason wasn’t generally so philosophical. He didn’t waste time deliberating on relationships or motivations. He wasn’t sure what he was thinking right now. His reaction to Charlotte was unwarranted—wasn’t it? Although it’d been a nice kiss, it wasn’t so spectacular that his whole world should be turned upside down.","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-5.html","bookId":1982,"book":{"id":1982,"title":"The Manning Grooms (Those Manning Men #0)","description":"Storyline: The Manning Grooms (Those Manning Men #3-4) Jason Manning is content with his life as a bachelor, a slob and a sports fan. Then a precocious girl named Carrie Weston decides to play matchmaker, introducing him to her mother, Charlotte. To his relief, Charlotte is as averse to marriage as he is. But Jason\u0027s feelings start to change once he gets to know his Bride on the Loose.","cover":"https://allnovel.net/images/the-manning-grooms-those-manning-men-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-manning-grooms-those-manning-men-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:59 AM"}}
