{"id":73064,"no":57,"title":"Page 57","content":"He nodded sheepishly. “The car’s loaded with goodies. I’m afraid I got a little carried away.” “These babies are going to love their grandpa.” Walter grinned, then walked out, closing the door. James stood by the fireplace, his back to her. Summer suspected he was preparing a list of questions. She wasn’t even sure she had all the answers; she wasn’t sure she wanted him to ask them. She decided to preempt his interrogation. “I…I went to see Ralph Southworth,” she said in a quavering voice. James whirled around. “You did what?” “I…I overheard you and your father talking not long ago and I learned that Southworth resigned as your campaign manager.” “So he’s what this is all about,” James said thoughtfully. His eyes hardened. “What happened between the two of us had nothing to do with you.” “James, please, I know otherwise. I…I knew from the start that Ralph disapproved of me. I’m not sure why, but it doesn’t matter.” “No, it doesn’t. Because Southworth doesn’t matter.” Summer didn’t believe that. “Afterward, it seemed like you’d given up on the election. In the last two weeks you haven’t made a single public appearance. When I ask, you don’t want to talk about it and—” “There are things you don’t know.” “Things you wouldn’t tell me.” James sat across from her and leaned forward, elbows on his knees. He didn’t say anything for several minutes. “What was I supposed to think?” she cried when he didn’t explain. “Being a judge is the most important thing in the world to you. You were born for this…. I couldn’t take it away from you. Don’t you understand?” “You’re wrong about something. Being a superior court judge means nothing if you’re not with me. I guarantee you, my career’s not worth losing my wife and family over.” “I was going to come back,” she whispered, her eyes lowered. “After the election…” “Do you mean to say you were going to deliver our babies on your own? Do you honestly think I wouldn’t have turned this city upside down looking for you?” “I…didn’t know what to think. Ralph said—” “Don’t even tell me.” A muscle leapt in his jaw. “I can well imagine what he said. The man’s a world-class idiot. He saw you as a liability when you’re my greatest asset.” “If you truly believe that, then why did you throw in the towel?” “I haven’t,” he told her. “I took a few days to think about it and decide who I’ll ask to manage the rest of my campaign. It seems there are several people who want the job.” “But Southworth said he could sway the election for you…. He claims to have political clout.” “He seems to think he does,” James said tightly. “We made a deal,” she whispered, lowering her gaze. “What kind of deal?” “Southworth agreed to manage your campaign if I left Seattle until after the election.” James snickered. “It’s unfortunate you didn’t check with me first.” “Why?” “I don’t want Southworth anywhere near my campaign.” Summer bristled. “You might’ve said that earlier.” “True,” James admitted slowly. “But I wanted everything squared away before I announced that I’d changed campaign managers.” “So, who did you choose? Who’s your new manager?” “Eric Manning. He’s not only an old friend, he was a successful businessman and he’s very well connected.” He shook his head. “I should’ve asked him in the first place.” “James, that’s wonderful! I like him so much better than Ralph.” James reached for her hands and held them in his own. “What you don’t understand is that I wouldn’t have taken Southworth back under any circumstances. First of all, I won’t allow any man to talk about my wife the way he did. It’s true I made some mistakes when we first got married. I blame myself for not publishing our wedding announcement immediately. Frankly, I didn’t think of it.” “I didn’t, either. And remember, we were talking about an April ceremony back then.” Summer wasn’t willing to have him accept all the blame. “You’re my wife, and I couldn’t be prouder that someone as beautiful and talented as you would choose to marry me. Ralph made it sound as if we should keep you under wraps until after the election, which is utterly ridiculous. I’m angry with myself for not taking a stand sooner.” “What about the election?” She didn’t care to hear any more about Southworth. “I’ll get to that in a minute. When Southworth said he questioned my judgment, I realized what a fool I’d been to listen to the man for even a minute.” “But—” “Let me finish, sweetheart. The best thing I ever did in my life was marry you.” “It was impulsive and—” “Smart,” he said, cutting her off. “I don’t need Southworth to win this campaign for me. He had me convinced I did, but I know otherwise now.” “What about his political friends?” “That’s a laugh. A man as narrow-minded and self-righteous as Ralph Southworth can’t afford the luxury of friends. He has none, but he doesn’t seem to know it. If he hadn’t decided to leave my campaign, I would’ve asked him to resign.” It was a good thing Summer was sitting down. “You mean to say I went through all that grief and left you for nothing?” “Exactly.” “Oh.” James gathered her in his arms. “Summer, whatever I am, whatever I may become, I’m nothing without you.” Summer sobbed into his shoulder. “Winning the election would be an empty victory if you weren’t standing at my side. I want you to share that moment with me. I love you, Summer, and I love our babies, too.” “Oh, James, I’ve been so unhappy. I didn’t know what to do.” “Don’t ever leave me again. It was like I’d lost my mind, my heart—everything—until I saw you standing at the end of that pier.” Summer tightened her arms around him. Walter tapped on the door. “Can I come in yet?” “No,” James growled. “So have you two settled your differences?” “We’re working on it,” Summer called out. “Then I’ll leave you to your reunion.” “Good night, Dad,” James said in what was an obvious hint for his father to leave. “’Night, kids. Kiss and make up, okay?” “We’re going to do a lot more than kiss,” James whispered in her ear. “Promises, promises, promises,” she murmured. “You can bet I’ll make good on these.” Thirteen “This is my wife, Summer,” James said, his arm around her thick waist. Although she was only six months pregnant, she looked closer to nine. “I’m so pleased to meet you,” the older woman said. “Who was that again?” she whispered to James. “Emily Rohrbaugh, president of the League of Women Voters.” “Oh. I don’t know how you remember all these names. I’m impressed.” “I’m more impressed that you can remember all your lines in Beauty and the Beast,” he said. “But here’s my little trick for recalling names. I try to tie them in with something else,” James told her. “Some kind of object or action.” “Rohrbaugh is something of a challenge, don’t you think?” Summer raised her eyebrows. “Roar and baa,” he said under his breath. “Think of a lion and a lamb. A lion roars and a lamb goes baa. Rohrbaugh.” Summer’s face lit up with a bright smile. “No wonder I married you. You’re brilliant.” “I bet you won’t have a problem remembering Emily the next time you meet.” “I won’t.” “She’s a good friend of Elizabeth Manning’s,” James said, feeding his wife a seedless grape. It was a test of his restraint not to kiss her afterward. One would assume his desire for her would fade after all these months; if anything, quite the opposite had occurred. She was never more beautiful to him than now, heavy with their children. “Elizabeth Manning?” Summer repeated. “I didn’t think she’d be the political type.” “She isn’t,” James said. They mingled with the crowd gathered on the patio of an influential member of the state senate. “But the two of them have been friends since high school.” “I see.” “Do you need to sit for a while?” “James,” she groaned. “Stop worrying about me.” He glanced down at her abdomen. “How are Mutt and Jeff?” She circled her belly with both hands. “I swear these two are going to be world-class soccer players.” James chuckled, reaching for an hors d’oeuvre from one of the several platters set around the sunny patio. He gave it to Summer. “James, I don’t believe I’ve met your wife.” James recognized the voice—William Carr, the president of the Bar Association. He quickly made the introductions. He never worried about Summer saying the wrong thing or inadvertently embarrassing him. She had a natural way about her that instantly put people at ease. She was charming and open and genuine. These political functions weren’t her idea of a good time, but she never complained. She seemed eager to do whatever she could to aid his campaign and had proved to be the asset he knew she would be. “I’m very pleased to meet you,” she said warmly as they exchanged handshakes. The obvious topic of conversation was Summer’s pregnancy, which they discussed but only briefly. She managed to deftly turn the conversation away from herself, and soon Carr was talking about himself, laughing over the early days when his wife was pregnant with their oldest child. After ten minutes or so, Summer excused herself. “She’s an excellent conversationalist,” William Carr commented as she walked away. James did his best to hide a smile. It amused him that Carr could do most of the talking and then act as if Summer had been the one carrying the discussion. “It seems strange to think of you as married,” the attorney said next. “When I’m with Summer, I wonder why I ever waited so long.” Carr shifted his weight from one foot to the other. “If I’d given you advice before you were appointed to the court, it would’ve been to marry.” “Really?” This came as a shock to James. “You’re a fine young man, and I expect great things from you. Just between you, me and the fence post, I think you’re doing an excellent job.”","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-57.html","bookId":1982,"book":{"id":1982,"title":"The Manning Grooms (Those Manning Men #0)","description":"Storyline: The Manning Grooms (Those Manning Men #3-4) Jason Manning is content with his life as a bachelor, a slob and a sports fan. Then a precocious girl named Carrie Weston decides to play matchmaker, introducing him to her mother, Charlotte. To his relief, Charlotte is as averse to marriage as he is. But Jason\u0027s feelings start to change once he gets to know his Bride on the Loose.","cover":"https://allnovel.net/images/the-manning-grooms-those-manning-men-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-manning-grooms-those-manning-men-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:59 AM"}}
