{"id":73065,"no":58,"title":"Page 58","content":"“I hope so,” James said, but there were some who weren’t as confident as William Carr. Generally those under the influence of Ralph Southworth. To James’s surprise, Southworth had managed to prejudice several supporters against him. “You remind me of myself thirty years back,” Carr told him. James considered this high praise. “Thank you.” “But you needed a little softening around the edges. You came off as strong and unbending. Not a bad thing for a judge, mind you, but being a little more human wouldn’t have hurt.” “I see.” James didn’t like hearing this but knew it was for his own good, however uncomfortable it might be. “It’s easy to sit in judgment of others when you live in an ivory tower.” James frowned uncertainly. “I don’t understand.” “Until you married Summer, your life was a bit…sterile. Protected. If you don’t mind my saying so…A married man knows how to compromise. I imagine you’ve done things to make your wife happy that you wouldn’t normally do.” He nodded. “In my opinion, marriage matures a man. It helps him sympathize and identify with his fellow humans.” “Are you trying to tell me I was a stodgy stuffed shirt before I married Summer?” James asked outright. William Carr seemed taken aback by his directness, then grinned. “Couldn’t have said it better myself.” “That’s what I thought.” James reached for a tiny crab puff. “By the way, I wanted to congratulate you on a job well done. That multiple homicide was your first murder trial, wasn’t it?” “Yes.” To be honest, he was happy it was over. The ordeal had proved to be exhausting for everyone involved. The jury had found the young man guilty, and after careful deliberation, James had pronounced the sentence. His name and face had appeared on television screens every night for weeks. It went without saying that a lot of people were watching and waiting to see how he’d rule. Liberals were looking for leniency, and hard-liners wanted the death penalty. James had agonized over the sentence. There were more victims than the ones who were shot during those hours of madness. Three families had lost loved ones. Seventeen others would always carry the mark of a madman’s gun. Innocent lives had been forever changed. James had delivered a sentence he felt was fair. He didn’t try to satisfy any political factions, although the outcome of the election could well rest on his judgment. He’d sentenced the killer to life without the possibility of parole, with mandatory psychiatric treatment. It would’ve been impossible to keep everyone happy, so his decision had been based on what he considered equitable for all concerned. Some were pleased, he knew, and others were outraged. “Thank you,” James said, “I appreciate your vote of confidence.” “The decisions won’t get any easier,” William Carr told him. The older man grabbed a stuffed green olive and popped it in his mouth. “The bar will be taking their opinion poll about the time your wife’s due to have those babies of yours.” James knew that whether or not the results were published was at the discretion of the bar. The vote could sway the November election. Summer returned just then, looking tired. Despite her smile, William Carr seemed to realize this. He wished them his best and drifted away. “Are you ready to leave?” James asked. “No,” she protested. “We’ve barely arrived.” “We’re going.” His mistake was in asking her; he should’ve known to expect an argument. He made their excuses, thanked the host and hostess and urged Summer toward their parked car. Her progress was slow, and he knew she was uncomfortable, especially in the heat. “Charlotte’s due in two weeks,” she said when he helped her inside. She sighed as she eased into the seat. The seat belt barely stretched all the way around her. James paused. “What’s that comment about Charlotte about?” “I envy her. Look at me, James!” “I am looking at you,” he said, and planted a kiss on her cheek. “You’re the most beautiful woman in the world.” “I don’t believe you,” she muttered. “You’d better, because it wouldn’t take much to convince me to prove it right here and now.” “James, honestly.” “I am being honest.” She smiled, and he couldn’t resist kissing her a second time. After they got home, Summer sat outside in the sunshine. She propped her feet on a stool, and her hands rested on her stomach. James brought her a glass of iced tea. She smiled her appreciation. “You spoil me.” “That’s because I enjoy it.” He sat down next to her. “I don’t suppose you’ve thought about packing up and leaving me lately?” Summer giggled. “Once or twice, but by the time I finished dragging out my suitcases, I was too tired to go.” “You’re teasing.” “Of course I’m teasing.” “Speaking of suitcases, do you have one ready for the hospital?” “Aren’t we being a little premature?” “Who knows what Mutt and Jeff are thinking.” James’s hand joined hers. It thrilled him to feel his children move inside her. “And this time you might want to take more than your toothbrush, a book and your bedroom slippers.” “That goes to show you the mental state I was in.” “Never again,” James said firmly. Summer propped her head against his shoulder and sighed. “Never again,” she agreed. The day of the September primary, Summer woke feeling sluggish and out of sorts. Getting out of bed was a task of monumental proportions. She felt as if she needed a forklift. James was already up and shaved. He’d been watching her carefully all week. To everyone’s surprise, including her doctor’s, Summer hadn’t delivered the twins yet. She’d read that twins were often born early. But not Mutt and Jeff, as they’d been affectionately named by James. “Most babies aren’t born on their due dates, so stop looking so worried. This is your day.” She sat on the edge of the bed and pressed her hand to the small of her back. James offered her his arm to help her upright. “How do you feel?” “I don’t know yet.” The pain at the base of her spine had kept her awake most of the night. It didn’t seem to go away, no matter how often she changed her position. “When are we voting?” she asked. “First thing this morning,” James told her. “Good.” “Why is that good?” he asked anxiously. “Do you think today’s the day?” “James, stop! I’m in perfect health.” “For someone nine months pregnant with twins, you mean.” Summer swore that somehow, God willing, she’d make it through this day. James was so tender and endearing, but she didn’t want him worrying about her during the primary. They gathered, together with Walter, at the large Manning home for the election results that evening. Summer was pleased for the opportunity to be with her friends. Jason and Charlotte, along with their toddler and infant daughter, Ann Marie, were among the first to arrive. Many of the friends who’d worked so hard on James’s campaign showed up soon after, shortly before the first election results were announced. Summer planted herself in a chair in the family room and didn’t move for an hour. The ache in her back had intensified. Feeling the need to move about, she made her way into the kitchen. She was standing in front of the sink when it happened. Her eyes widened as she felt a sharp, stabbing pain. “James,” she cried in panic, gripping the counter. Water gushed from between her legs and onto the floor. “Oh, my goodness.” “Summer?” James stood in the doorway, along with at least ten others, including Elizabeth Manning. “I’m sorry,” she whispered, looking at James. “But I think it might be time to take me to the hospital.” She saw her husband turn and stare longingly at the election results being flashed across the screen. “Now?” Fourteen “James…I’m sorry.” The pain that had been concentrated in the small of her back had worked its way around her middle. Summer held her stomach and closed her eyes, surprised by the intensity of it. “Sorry,” James demanded, “for what?” He moved quickly and placed his arm around her shoulders. “You’d better get her to the hospital,” Elizabeth advised. “I’ll phone the doctor for you,” Eric added. James shouted out the number he’d memorized, and five or six Mannings chanted it until Eric found a pad and pen to write it down. Summer felt as if everyone wanted to play a role in the birth of their twins. “Toss me the car keys, and I’ll get the car as close to the front door as I can,” Jason Manning shouted. James threw him the keys, and Jason hurried out the front door. “What about the election returns?” Summer asked, gazing at the television. “I’ll get them later,” James said as if it meant nothing. “I’ll leave messages on your cell phone,” Charlotte volunteered, “and James can call us when he has an update on Summer and the babies.” Summer bit her lip at the approach of another contraction. It hurt, really hurt. “James.” She squeezed his hand, needing him. “I’m here, sweetheart. I won’t leave you, not for anything.” Jason reappeared, and the small entourage headed for James’s car. It was parked on the grass, close to the front door, the engine running. “The doctor said you should go directly to the hospital,” Walter said breathlessly. “He’ll meet you there.” “Don’t worry, Summer, this isn’t his first set of twins,” Elizabeth said in a reassuring voice. “True, but they’re mine,” James said. “James?” Summer looked at her husband and noticed how pale he’d suddenly become. “Are you all right?” He didn’t answer for a moment; instead, he helped her inside the car and strapped her in. Before long he was sitting next to her, hands braced on the steering wheel. Summer saw the pulse in his neck pounding. “It’s going to be fine,” she whispered. “Just fine.” “I’ll feel a whole lot better once we get you to the hospital.” “Call us,” Charlotte shouted, standing on the steps, waving. Summer waved back, and no fewer than fifteen adults crowded onto the Mannings’ front porch, cheering them on. “James, are you okay to drive?” Summer asked when he took off at breakneck speed. He slowed down and stayed within the speed limit, but there was a leashed fear in him that was almost palpable. “I’ll be okay once we get you to the hospital.”","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-58.html","bookId":1982,"book":{"id":1982,"title":"The Manning Grooms (Those Manning Men #0)","description":"Storyline: The Manning Grooms (Those Manning Men #3-4) Jason Manning is content with his life as a bachelor, a slob and a sports fan. Then a precocious girl named Carrie Weston decides to play matchmaker, introducing him to her mother, Charlotte. To his relief, Charlotte is as averse to marriage as he is. But Jason\u0027s feelings start to change once he gets to know his Bride on the Loose.","cover":"https://allnovel.net/images/the-manning-grooms-those-manning-men-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-manning-grooms-those-manning-men-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:59 AM"}}
