{"id":73015,"no":8,"title":"Page 8","content":"Jason removed the cup and saucer from her hands and set them on the tray next to the empty plate.\n He was going to kiss her; she realized it in the same moment she owned up to how much she wanted him to. All night she’d been looking forward to having him do exactly this, only she hadn’t been willing to admit it.\n His mouth was gentle and sweet with the taste of coffee and chocolate. He kissed her the way he had the night before, and Charlotte could barely take in the sensation that overwhelmed her. She’d never thought she’d feel anything so profound, so exciting, again. She hadn’t believed she was capable of such a rush of feeling….\n She whimpered and wrapped her arms around his neck, holding on to him in a world that had started to spin out of control. His hands framed her face and he slanted his mouth over hers, answering her need with his own.\n Jason kissed her again and again.\n The sound coming from the front door barely registered in her passion-drugged brain.\n “Mom…Jason…” was followed by a shocked pause, then, “Wow, this is great.”\n Charlotte broke away from Jason and leapt to her feet.\n “Gee, Mom, there’s no need to get embarrassed. People kiss all the time.” Carrie floated across the carpet, then threw herself into a chair. “So,” she said, smiling broadly, “is there anything either of you want to tell me?”\n “Like what?” Charlotte asked.\n Carrie shrugged with utter nonchalance. “That you’re getting married?”\n Four\n On his way back to his apartment, Jason had to admit that Charlotte’s daughter possessed a knack for the unexpected. Arriving when she did was only the beginning; introducing the subject of marriage had nearly sent him into hysterics.\n Him married? It was downright laughable.\n Thinking about it, Jason realized Charlotte had brought up the subject herself, wanting to know why he hadn’t married, asking him if he’d ever been in love. Typical women questions.\n Perhaps mother and daughter were in cahoots, plotting his downfall. No, that was equally laughable.\n Jason simply wasn’t the marrying kind. Not because he was a womanizer or because he had anything against the opposite sex. He liked women…at times, enjoyed being with them…occasionally. Liked kissing them…definitely. But he relished his freedom too much to sacrifice it to commitment and responsibility.\n No, he told himself resolutely, Charlotte wasn’t involved in any scheme to drag him to the altar. She’d been so embarrassed and flustered by Carrie’s suggestion, her face had gone bright red. The woman’s face was too open to hide her feelings. She had chastised Carrie, asked for and received an apology, and looked genuinely grateful when Jason said it was time he left.\n Despite the episode with Carrie, Jason had thoroughly enjoyed his evening with Charlotte. He hadn’t expected to. In fact he’d originally regretted having asked her out, but in the end their date had been a pleasant success.\n Once again he was bewildered by the strong desire he experienced when he kissed her. He had ordained a hands-off policy for the night, but had shelved that idea the minute she’d sat next to him, gazing up at him with those pretty eyes of hers.\n Actually, he’d known he was in trouble when he accepted her invitation to come inside for coffee. He’d thought of it as a challenge; he’d wanted to see how far he could push his determination. Not far, he concluded. When she’d looked at him, her eyes soft and inviting, he was lost. His hands-off policy had quickly become a hands-on experiment.\n There was something about Charlotte Weston that got to him. Really got to him.\n All that outward confidence she worked so hard to display hadn’t fooled him. Beneath a paper-thin veneer, she was vulnerable. Any fool with two functional brain cells would have figured that out on the first date.\n Only she didn’t date.\n Carrie had told him it’d been years since her mother had even gone out with a man. Undoubtedly she’d been asked—and if she hadn’t been, why not? She was attractive, intelligent and fun. Offhand, he knew a half-dozen men who’d jump at the chance to meet a woman like Charlotte.\n If she’d turned down offers, and surely she had, then there must be a reason. The question that confused Jason was: If she didn’t date, then why had she agreed to have dinner with him?\n Probably the same reason that had goaded him to ask, Jason concluded. The kiss. That infamous first kiss. It had rocked them both. Taken them by surprise, leaving them excited—and unsure.\n As for the other questions that hounded him, Jason didn’t have any answers. Nor did he understand everything that was happening between him and Charlotte. One thing he did know—and it terrified him the most—was that they were, in effect, playing with lighted sticks of dynamite, tossing them back and forth. The attraction between them was that explosive. That dangerous.\n Carrie’s arrival had been more timely than she’d realized.\n All right, Jason was willing to own up, albeit grudgingly, that he was fascinated with Charlotte. He suspected she’d confess to feeling the same thing. To his way of thinking, if they were so strongly attracted to each other, they should both be prepared to do something about it.\n In other words, they should stop fighting the inevitable and make love. That would get it out of their system—he hoped.\n Naw, Jason mused darkly. Charlotte wasn’t the kind of woman who’d indulge in an affair. She might wear only straight, dark business suits to work, but deep down she was the romantic type, which made her impractical. Most women seemed to be. If they were going to make love, they wanted it prettied up with a bunch of flowery words, a declaration of undying love and promises of commitment.\n Well, Charlotte, along with every other woman, could forget that, he told himself. As far as he was concerned, romance and commitment were out of the question.\n What he wanted in this relationship was honesty. If it were up to him, he’d suggest they do away with the formalities, admit what they wanted and then scratch that itch.\n He mulled that over for a few minutes, knowing it was unlikely that Charlotte would see the situation his way. He might not know her well, but Jason readily acknowledged that she wasn’t going to be satisfied with so little. Women tended to see lovemaking as more than just the relief of a physical craving.\n Well, he, for one, wasn’t going to play that game. He liked Charlotte—how much he liked her surprised him—but he knew the rules. Either they dropped everything now, while they still could, or they continued driving each other insane. Sooner or later, one of them would have to give in.\n Without a second’s hesitation, Jason knew it would be him.\n Charlotte affected him deep down. He couldn’t bear the thought of hurting her or causing her one second of unhappiness. In the end he’d say all the words she wanted to hear, and he’d do the best job he could, because pleasing her would mean so much to him.\n Then he’d get what he wanted; she’d make love to him willingly, with everything in her. He’d give her all he had, too. The problem was—and he knew it was inevitable—that before he’d quite figured out what was happening, they’d be talking about marriage, which was something he hadn’t done since Julie.\n Jason stopped right there. If he started thinking along those lines, everything would change. Soon Charlotte would be organizing his life, straightening up his apartment, making suggestions about little things he could do to improve his sorry lot. Women always saw his lot as sorry. He was happy living the way he was, but women couldn’t accept that. They didn’t believe a man could survive without them constantly fussing over him, dictating his life.\n Bit by bit, Charlotte would dominate his world, eroding his independence until he was like every other married man he’d ever known—willing to change his ways for a wife. Picking up his socks, getting hassled about sports games on TV, the whole deal.\n No, the domesticated life wasn’t for him. Still, Charlotte tempted him more than anyone else had in ages, and he could almost imagine their lives together. Not quite, but almost.\n He stared at his apartment door, wondering how long he’d been standing there mulling over his thoughts. He was light years ahead of himself, he realized. Good grief, he was already trying to finagle his way out of marrying her and they’d only gone out on one date. He’d only kissed her twice.\n But, oh, those kisses…\n Like he’d told himself before, they were playing with explosives, and the best way to avoid getting hurt was to get out now, before they became too involved. Before he lost the strength to walk away from her.\n “Aren’t you going to do something?” Carrie demanded.\n “About what?” Charlotte returned calmly, feigning ignorance. She glanced up from her novel, looking over the rims of her reading glasses with practiced innocence.\n “Jason!” Carrie cried. “You haven’t heard from him in a whole week.”\n “Has it been that long?” Seven days, two hours and three minutes, but who was counting? Certainly not her.\n “Mom,” Carrie insisted, hands on her hips, “you know how long it’s been. You jump every time the phone rings. You keep making excuses about checking the mail and getting the newspaper. We both know you’re hoping to run into Jason.”\n It hurt Charlotte’s pride to learn she’d been so obvious.\n “You like him, don’t you?” Carrie asked. Her expression said that if she were in charge, this romance would be making far greater progress. Charlotte, however, had no intention of letting her daughter take control of her relationship with Jason Manning.\n “I think Jason’s wonderful,” Charlotte admitted softly. She did like her landlord. Yet, at the same time, she was grateful he hadn’t taken the initiative and contacted her again. If he had, she wasn’t sure how she would’ve responded.\n “If you’re so crazy about him, then do something about it,” Carrie said again.\n “Like what?” Even if Charlotte had a drawerful of ideas, she doubted she’d ever find the courage to use any of them. She didn’t know how to chase after a man and had no interest in doing so.\n “You’re asking me?” Carrie asked. “C’mon, who’s the kid here?” She launched herself onto the cushion beside Charlotte. “What went wrong?” she asked, looking up at her mother with mournful eyes. “The two of you seemed to be getting along really well when I walked in last week.”\n Charlotte slid her arm around Carrie’s shoulders. Despite her efforts not to, she grinned, remembering when she, too, had been so wise and confident.\n “It might’ve had something to do with the subject of marriage—which you brought up. He seemed to get a bit green around the gills at that point.”\n “You think it frightened him off?” Carrie asked anxiously.\n Charlotte shrugged. She’d brought up the subject herself, not quite as directly, but she had mentioned it. If ever there was a born bachelor, she decided, it was Jason Manning. Together, mother and daughter had managed to terrify the man. He must think they were sitting in their apartment ready to ambush him, tie him up and drag him in front of the closest preacher. \n","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-8.html","bookId":1982,"book":{"id":1982,"title":"The Manning Grooms (Those Manning Men #0)","description":"Storyline: \n The Manning Grooms (Those Manning Men #3-4) \n Jason Manning is content with his life as a bachelor, a slob and a sports fan. Then a precocious girl named Carrie Weston decides to play matchmaker, introducing him to her mother, Charlotte. To his relief, Charlotte is as averse to marriage as he is. But Jason\u0027s feelings start to change once he gets to know his Bride on the Loose.\n \n","cover":"https://allnovel.net/images/the-manning-grooms-those-manning-men-0.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/the-manning-grooms-those-manning-men-0.html","creation":"Oct 5, 2019 8:58:11 AM","modification":"Oct 5, 2019 10:25:59 AM"}}
