{"id":35750,"no":163,"title":"Part 3 Book 3 Chapter 2 One of the Red Spectres of that Epoch","content":"Any one who had chanced to pass through the little town of Vernon at this epoch, and who had happened to walk across that fine monumental bridge, which will soon be succeeded, let us hope, by some hideous iron cable bridge, might have observed, had he dropped his eyes over the parapet, a man about fifty years of age wearing a leather cap, and trousers and a waistcoat of coarse gray cloth, to which something yellow which had been a red ribbon, was sewn, shod with wooden sabots, tanned by the sun, his face nearly black and his hair nearly white, a large scar on his forehead which ran down upon his cheek, bowed, bent, prematurely aged, who walked nearly every day, hoe and sickle in hand, in one of those compartments surrounded by walls which abut on the bridge, and border the left bank of the Seine like a chain of terraces, charming enclosures full of flowers of which one could say, were they much larger: \"these are gardens,\" and were they a little smaller: \"these are bouquets.\" All these enclosures abut upon the river at one end, and on a house at the other. The man in the waistcoat and the wooden shoes of whom we have just spoken, inhabited the smallest of these enclosures and the most humble of these houses about 1817. He lived there alone and solitary, silently and poorly, with a woman who was neither young nor old, neither homely nor pretty, neither a peasant nor a bourgeoise, who served him. The plot of earth which he called his garden was celebrated in the town for the beauty of the flowers which he cultivated there. These flowers were his occupation. By dint of labor, of perseverance, of attention, and of buckets of water, he had succeeded in creating after the Creator, and he had invented certain tulips and certain dahlias which seemed to have been forgotten by nature. He was ingenious; he had forestalled Soulange Bodin in the formation of little clumps of earth of heath mould, for the cultivation of rare and precious shrubs from America and China. He was in his alleys from the break of day, in summer, planting, cutting, hoeing, watering, walking amid his flowers with an air of kindness, sadness, and sweetness, sometimes standing motionless and thoughtful for hours, listening to the song of a bird in the trees, the babble of a child in a house, or with his eyes fixed on a drop of dew at the tip of a spear of grass, of which the sun made a carbuncle. His table was very plain, and he drank more milk than wine. A child could make him give way, and his servant scolded him. He was so timid that be seemed shy, he rarely went out, and he saw no one but the poor people who tapped at his pane and his cure, the Abbe Mabeuf, a good old man. Nevertheless, if the inhabitants of the town, or strangers, or any chance comers, curious to see his tulips, rang at his little cottage, he opened his door with a smile. He was the \"brigand of the Loire.\" Any one who had, at the same time, read military memoirs, biographies, the Moniteur, and the bulletins of the grand army, would have been struck by a name which occurs there with tolerable frequency, the name of Georges Pontmercy. When very young, this Georges Pontmercy had been a soldier in Saintonge\u0027s regiment. The revolution broke out. Saintonge\u0027s regiment formed a part of the army of the Rhine; for the old regiments of the monarchy preserved their names of provinces even after the fall of the monarchy, and were only divided into brigades in 1794. Pontmercy fought at Spire, at Worms, at Neustadt, at Turkheim, at Alzey, at Mayence, where he was one of the two hundred who formed Houchard\u0027s rearguard. It was the twelfth to hold its ground against the corps of the Prince of Hesse, behind the old rampart of Andernach, and only rejoined the main body of the army when the enemy\u0027s cannon had opened a breach from the cord of the parapet to the foot of the glacis. He was under Kleber at Marchiennes and at the battle of Mont-Palissel, where a ball from a biscaien broke his arm. Then he passed to the frontier of Italy, and was one of the thirty grenadiers who defended the Col de Tende with Joubert. Joubert was appointed its adjutant-general, and Pontmercy sub-lieutenant. Pontmercy was by Berthier\u0027s side in the midst of the grape-shot of that day at Lodi which caused Bonaparte to say: \"Berthier has been cannoneer, cavalier, and grenadier.\" He beheld his old general, Joubert, fall at Novi, at the moment when, with uplifted sabre, he was shouting: \"Forward!\" Having been embarked with his company in the exigencies of the campaign, on board a pinnace which was proceeding from Genoa to some obscure port on the coast, he fell into a wasps\u0027-nest of seven or eight English vessels. The Genoese commander wanted to throw his cannon into the sea, to hide the soldiers between decks, and to slip along in the dark as a merchant vessel. Pontmercy had the colors hoisted to the peak, and sailed proudly past under the guns of the British frigates. Twenty leagues further on, his audacity having increased, he attacked with his pinnace, and captured a large English transport which was carrying troops to Sicily, and which was so loaded down with men and horses that the vessel was sunk to the level of the sea. In 1805 he was in that Malher division which took Gunzberg from the Archduke Ferdinand. At Weltingen he received into his arms, beneath a storm of bullets, Colonel Maupetit, mortally wounded at the head of the 9th Dragoons. He distinguished himself at Austerlitz in that admirable march in echelons effected under the enemy\u0027s fire. When the cavalry of the Imperial Russian Guard crushed a battalion of the 4th of the line, Pontmercy was one of those who took their revenge and overthrew the Guard. The Emperor gave him the cross. Pontmercy saw Wurmser at Mantua, Melas, and Alexandria, Mack at Ulm, made prisoners in succession. He formed a part of the eighth corps of the grand army which Mortier commanded, and which captured Hamburg. Then he was transferred to the 55th of the line, which was the old regiment of Flanders. At Eylau he was in the cemetery where, for the space of two hours, the heroic Captain Louis Hugo, the uncle of the author of this book, sustained alone with his company of eighty-three men every effort of the hostile army. Pontmercy was one of the three who emerged alive from that cemetery. He was at Friedland. Then he saw Moscow. Then La Beresina, then Lutzen, Bautzen, Dresden, Wachau, Leipzig, and the defiles of Gelenhausen; then Montmirail, Chateau-Thierry, Craon, the banks of the Marne, the banks of the Aisne, and the redoubtable position of Laon. At Arnay-Le-Duc, being then a captain, he put ten Cossacks to the sword, and saved, not his general, but his corporal. He was well slashed up on this occasion, and twenty-seven splinters were extracted from his left arm alone. Eight days before the capitulation of Paris he had just exchanged with a comrade and entered the cavalry. He had what was called under the old regime, the double hand, that is to say, an equal aptitude for handling the sabre or the musket as a soldier, or a squadron or a battalion as an officer. It is from this aptitude, perfected by a military education, which certain special branches of the service arise, the dragoons, for example, who are both cavalry-men and infantry at one and the same time. He accompanied Napoleon to the Island of Elba. At Waterloo, he was chief of a squadron of cuirassiers, in Dubois\u0027 brigade. It was he who captured the standard of the Lunenburg battalion. He came and cast the flag at the Emperor\u0027s feet. He was covered with blood. While tearing down the banner he had received a sword-cut across his face. The Emperor, greatly pleased, shouted to him: \"You are a colonel, you are a baron, you are an officer of the Legion of Honor!\" Pontmercy replied: \"Sire, I thank you for my widow.\" An hour later, he fell in the ravine of Ohain. Now, who was this Georges Pontmercy? He was this same \"brigand of the Loire.\" We have already seen something of his history. After Waterloo, Pontmercy, who had been pulled out of the hollow road of Ohain, as it will be remembered, had succeeded in joining the army, and had dragged himself from ambulance to ambulance as far as the cantonments of the Loire. The Restoration had placed him on half-pay, then had sent him into residence, that is to say, under surveillance, at Vernon. King Louis XVIII., regarding all that which had taken place during the Hundred Days as not having occurred at all, did not recognize his quality as an officer of the Legion of Honor, nor his grade of colonel, nor his title of baron. He, on his side, neglected no occasion of signing himself \"Colonel Baron Pontmercy.\" He had only an old blue coat, and he never went out without fastening to it his rosette as an officer of the Legion of Honor. The Attorney for the Crown had him warned that the authorities would prosecute him for \"illegal\" wearing of this decoration. When this notice was conveyed to him through an officious intermediary, Pontmercy retorted with a bitter smile: \"I do not know whether I no longer understand French, or whether you no longer speak it; but the fact is that I do not understand.\" Then he went out for eight successive days with his rosette. They dared not interfere with him. Two or three times the Minister of War and the general in command of the department wrote to him with the following address: A Monsieur le Commandant Pontmercy.\" He sent back the letters with the seals unbroken. At the same moment, Napoleon at Saint Helena was treating in the same fashion the missives of Sir Hudson Lowe addressed to General Bonaparte. Pontmercy had ended, may we be pardoned the expression, by having in his mouth the same saliva as his Emperor. In the same way, there were at Rome Carthaginian prisoners who refused to salute Flaminius, and who had a little of Hannibal\u0027s spirit. One day he encountered the district-attorney in one of the streets of Vernon, stepped up to him, and said: \"Mr. Crown Attorney, am I permitted to wear my scar?\" He had nothing save his meagre half-pay as chief of squadron. He had hired the smallest house which he could find at Vernon. He lived there alone, we have just seen how. Under the Empire, between two wars, he had found time to marry Mademoiselle Gillenormand. The old bourgeois, thoroughly indignant at bottom, had given his consent with a sigh, saying: \"The greatest families are forced into it.\" In 1815, Madame Pontmercy, an admirable woman in every sense, by the way, lofty in sentiment and rare, and worthy of her husband, died, leaving a child. This child had been the colonel\u0027s joy in his solitude; but the grandfather had imperatively claimed his grandson, declaring that if the child were not given to him he would disinherit him. The father had yielded in the little one\u0027s interest, and had transferred his love to flowers. Moreover, he had renounced everything, and neither stirred up mischief nor conspired. He shared his thoughts between the innocent things which he was then doing and the great things which he had done. He passed his time in expecting a pink or in recalling Austerlitz. M. Gillenormand kept up no relations with his son-in-law. The colonel was \"a bandit\" to him. M. Gillenormand never mentioned the colonel, except when he occasionally made mocking allusions to \"his Baronship.\" It had been expressly agreed that Pontmercy should never attempt to see his son nor to speak to him, under penalty of having the latter handed over to him disowned and disinherited. For the Gillenormands, Pontmercy was a man afflicted with the plague. They intended to bring up the child in their own way. Perhaps the colonel was wrong to accept these conditions, but he submitted to them, thinking that he was doing right and sacrificing no one but himself. The inheritance of Father Gillenormand did not amount to much; but the inheritance of Mademoiselle Gillenormand the elder was considerable. This aunt, who had remained unmarried, was very rich on the maternal side, and her sister\u0027s son was her natural heir. The boy, whose name was Marius, knew that he had a father, but nothing more. No one opened his mouth to him about it. Nevertheless, in the society into which his grandfather took him, whispers, innuendoes, and winks, had eventually enlightened the little boy\u0027s mind; he had finally understood something of the case, and as he naturally took in the ideas and opinions which were, so to speak, the air he breathed, by a sort of infiltration and slow penetration, he gradually came to think of his father only with shame and with a pain at his heart. While he was growing up in this fashion, the colonel slipped away every two or three months, came to Paris on the sly, like a criminal breaking his ban, and went and posted himself at Saint-Sulpice, at the hour when Aunt Gillenormand led Marius to the mass. There, trembling lest the aunt should turn round, concealed behind a pillar, motionless, not daring to breathe, he gazed at his child. The scarred veteran was afraid of that old spinster. From this had arisen his connection with the cure of Vernon, M. l\u0027Abbe Mabeuf. That worthy priest was the brother of a warden of Saint-Sulpice, who had often observed this man gazing at his child, and the scar on his cheek, and the large tears in his eyes. That man, who had so manly an air, yet who was weeping like a woman, had struck the warden. That face had clung to his mind. One day, having gone to Vernon to see his brother, he had encountered Colonel Pontmercy on the bridge, and had recognized the man of Saint-Sulpice. The warden had mentioned the circumstance to the cure, and both had paid the colonel a visit, on some pretext or other. This visit led to others. The colonel, who had been extremely reserved at first, ended by opening his heart, and the cure and the warden finally came to know the whole history, and how Pontmercy was sacrificing his happiness to his child\u0027s future. This caused the cure to regard him with veneration and tenderness, and the colonel, on his side, became fond of the cure. And moreover, when both are sincere and good, no men so penetrate each other, and so amalgamate with each other, as an old priest and an old soldier. At bottom, the man is the same. The one has devoted his life to his country here below, the other to his country on high; that is the only difference. Twice a year, on the first of January and on St. George\u0027s day, Marius wrote duty letters to his father, which were dictated by his aunt, and which one would have pronounced to be copied from some formula; this was all that M. Gillenormand tolerated; and the father answered them with very tender letters which the grandfather thrust into his pocket unread. 由于坚持工作，遇事留意，勤于灌溉，他居然能继造物主之后，培植出几种似乎已被大地遗忘了的郁金香和大丽菊。他能别出心裁，他沤小绿肥来培植一些稀有珍贵的美洲的和中国的灌木，在这方面他超过了苏兰日·波丹。夏季天刚亮，他已到了畦埂上，插着，修着，薅着，浇着，带着慈祥、抑郁、和蔼的神气，在他的那些花中间来往奔忙，有时又停下不动，若有所思地捱上几个钟头，听着树上一只小鸟的歌唱或别人家里一个小孩的咿呀，或呆望着草尖上一滴被日光照得象钻石一样的露珠。他的饮食非常清淡，喝奶的时候多于喝酒。淘气的孩子可以使他听从，他的女仆也常骂他。他简直胆小到好象不敢见人似的，他很少出门，除了那些敲他玻璃窗的穷人和他的神甫之外，谁也不见。他的神甫叫马白夫，一个老好人。可是，如果有些本城或外来的人，无论是谁，想要见识见识他的郁金香和玫瑰，走来拉动他那小屋的门铃时，他就笑盈盈地走去开门。这就是那个卢瓦尔的匪徒了。 假使有人，在那同一时期，读了各种战争回忆录、各种传记、《通报》和大军战报，他就会被一个不时出现的名字所打动，那名字是乔治·彭眉胥。这彭眉胥在很年轻时便已是圣东日联队里的士兵。革命爆发了。圣东日联队编入了莱茵方面军。君主时代的旧联队是以省名为队名的，君主制被废除后依然照旧，到一七九四年才统一编制。彭眉胥在斯比尔、沃尔姆斯、诺伊施塔特、土尔克海姆、阿尔蔡、美因茨等地作过战，在美因茨一役，他是乌沙尔殿后部队二百人中的一个。他和其他十一个人，在安德纳赫的古垒后面阻击了赫斯亲王的全部人马，直到敌人的炮火打出一条从墙垛到斜堤的缺口，大队敌兵压来后他才退却。他在克莱贝尔部下到过马尔什安，并在蒙巴利塞尔一战中被铳子打伤了胳膊。随后，他转到了意大利前线，他是和茹贝尔保卫坦达谷的那三十个卫队之一。由于那次战功，茹贝尔升了准将，彭眉胥升了中尉。在洛迪那天，波拿巴望见贝尔蒂埃在炮火中东奔西突，夸他既是炮兵又是骑兵又是卫队，当时彭眉胥便在贝尔蒂埃的身旁。他在诺维亲眼见到他的老长官茹贝尔将军在举起马刀高呼“前进！”时倒了下去。在那次战役里，由于军事需要，他领着他的步兵连从热那亚乘着一只帆船到不知道哪一个小港口去，中途遇见了七八艘英国帆船。那位热那亚船长打算把炮沉到海里，让士兵们藏在中舱，伪装成商船暗地溜走。彭眉胥却把三色旗系在绳上，升上旗杆，冒着不列颠舰队的炮火扬长而过。驶过二十海里后，他的胆量更大了，他用他的帆船攻打一艘运送部队去西西里的英国大运输舰，并且俘虏了那艘满载人马直至舱口的敌船。一八○五年，他隶属于马莱尔师部，从斐迪南大公手里夺下了贡茨堡。在威廷根，他冒着冰雹般的枪弹双手抱起那位受了致命伤的第九龙骑队队长莫伯蒂上校。他曾在奥斯特里茨参加了那次英勇的冒着敌人炮火前进的梯形队伍。俄皇禁卫军骑兵队践踏第四大队的一营步兵时，彭眉胥也参加了那次反攻，并且击溃了那批禁卫军。皇上给了他十字勋章。彭眉胥，一次又一次，在曼图亚看见维尔姆泽被俘，在亚历山大看见梅拉斯被俘，在乌尔姆看见麦克被俘。他也参加了在莫蒂埃指挥下攻占汉堡的大军第八兵团。随后，他改隶第五十五大队，也就是旧时的佛兰德联队。英勇的队长路易·雨果，本书作者的叔父，在艾劳的一个坟场里，独自领着他连部的八十三个人，面对着敌军的全力猛攻，支持了两个小时，当时彭眉胥也在场。他是活着离开那坟场的三个人中的一个。弗里德兰，他也在。随后，他见过莫斯科，随后，又见过别列津纳，随后，卢岑、包岑、德累斯顿、瓦朔、莱比锡和格兰豪森峡道；随后，蒙米赖、沙多·蒂埃里、克拉昂、马恩河岸、埃纳河岸以及拉昂的惊险局面。在阿尔内勒狄克，他是骑兵队长，他用马刀砍翻了六个哥萨克人，并且救了，不是他的将军，而是他的班长。正是在那一次，他被人砍到血肉模糊，仅仅从他的左臂上，便取出了二十七块碎骨。巴黎投降的前八天，他和一个伙伴对调了职务，参加了骑兵队伍。他有旧时代所说的那种“双面手”，也就是说当兵，他有使刀枪的本领，当官，也一样有指挥步兵营或骑兵队的才干。某些特别兵种，比方说，那种既是骑兵又是步兵的龙骑兵，便是由这种军事教育精心培养出来的。他随着拿破仑到了厄尔巴岛。滑铁卢战争中，他在杜布瓦旅当铁甲骑兵队队长。夺得吕内堡营军旗的便是他。他把那面旗子夺来丢在皇上的跟前。他浑身是血。他在拔旗时，劈面砍来一刀，正砍着他的脸。皇上，心里喜悦，对他喊道：“升你为上校，封你为男爵，奖你第四级荣誉勋章！”彭眉胥回答说：“陛下，我代表我那成为寡妇的妻子感谢您。”一个钟点过后他倒在奥安的山沟里。我们现在要问：这乔治·彭眉胥究竟是什么人？他正是那卢瓦尔的匪徒。 关于他的历史，我们从前已经见了一些。滑铁卢战争过后，彭眉胥，我们记得，被人从奥安的那条凹路里救了出来，他居然回到了部队，从一个战地急救站转到另一个战地急救站，最后到了卢瓦尔营地。 王朝复辟以后，他被编在半薪人员里，继又被送到韦尔农去休养，就是说，去受监视。国王路易十八对百日时期发生的一切都加以否认，因而对他领受第四级荣誉勋章的资格、他的上校衔、他的男爵爵位一概不予承认。在他这面却绝不放弃一次机会去签署“上校男爵彭眉胥”。他只有一套旧的蓝制服，上街时他老佩上那颗代表第四级荣誉勋位的小玫瑰纽。检察官托人去警告他，说法院可能要追究他“擅自佩带荣誉勋章的不法行为”。当这通知由一个非正式的中间人转达给他时，彭眉胥带着苦笑回答：“我一点也不了解究竟是我听不懂法语，还是您不在说法语，事实是我听不懂您的话。”接着，他天天带上那小玫瑰纽上街，一连跑了八天。没有人敢惹他。军政部和省总指挥官写过两三次信给他，信封上写着“彭眉胥队长先生”。他把那些信全都原封不拆退了回去。与此同时，拿破仑在圣赫勒拿岛上也用同样的办法对待那些由贵人赫德森·洛①送给“波拿巴将军”的信件。在彭眉胥的嘴里棗请允许我们这样说棗竟有了和他皇上同样的唾沫。 ①赫德森·洛（HadsonLowe，1769-1844），监视拿破仑的英国总督。 从前在罗马也有过一些被俘虏的迦太基士兵，拒绝向弗拉米尼努斯①致敬，他们多少有点汉尼拔的精神。 ①弗拉米尼努斯（Flaminius，约前228-174），罗马统帅和执政官（前198），在第二次马其顿战争中（前200-197）中为罗马军队指挥官。 一天早晨，他在韦尔农的街上遇见了那个检察官，他走到他面前问他：“检察官先生，我脸上老挂着这条刀伤，这不碍事吧？” 他除了那份极微薄的骑兵队队长的半薪之外，什么都没有。他在韦尔农租下他可能找到的一所最小的房子。独自一人住在那里，他的生活方式是我们先头已经见到过的。在帝国时期，他趁着战争暂息的空儿，和吉诺曼姑娘结了婚。那位老绅士，心里愤恨，却又只好同意，他叹着气说：“最高贵的人家也不得不低下头来。”彭眉胥太太是个有教养、难逢难遇的妇人，配得上她的丈夫，从任何方面说，都是教人敬慕的，可她在一八一五年死了，丢下一个孩子。这孩子是上校在孤寂中的欢乐，但是那个外祖父蛮不讲理地要把他的外孙领去，口口声声说，如果不把那孩子送交给他，他便不让他继承遗产。父亲为了孩子的利益只好让步，爱子被夺以后，他便把心寄托在花木上。 其他的一切，他也都放弃了，既不活动，也无密谋。他把自己的心剖成两半，一半交给地目前所做的这种怡情悦性的营生，一半交给他从前干过的那些轰轰烈烈的事业。他把时间消磨在对一朵石竹的希望或对奥斯特里茨的回忆上。 吉诺曼先生和他的女婿毫无来往。那上校在他的心目中是个“匪徒”，而他在上校的眼里则是个“蠢才”。吉诺曼先生平日谈话从来不提上校，除非要讥诮他的“男爵爵位”才有时影射一两句。他们已经明确约定，彭眉胥永远不得探望他的儿子，否则就要把那孩子撵走，取消他的财产承继权，送还给父亲。对吉诺曼一家人来说，彭眉胥是个得瘟病的人。他们要按照他们的办法来教养那孩子。上校接受那样的条件也许错了，但是他谨守诺言，认为牺牲他个人不算什么，那样做还是对的。吉诺曼本人的财产不多，吉诺曼大姑娘的财产却很可观。那位没有出阁的姑奶奶从她母亲的娘家承继了大宗产业，她妹子的儿子自然是她的继承人了。 这孩子叫马吕斯，他知道自己有个父亲，此外便什么都不知道了。谁也不在他面前多话。可是在他外祖父领着他去的那些地方，低声的交谈，隐晦的词句，眨眼的神气，终于使那孩子心里有所领悟，有所认识，并且，由于一种潜移默化的作用，他也自然而然地把他常见的那种环境里的观点和意见变为自己所固有的了，久而久之，他一想到父亲，便感到羞惭苦闷。 当他在那种环境中渐渐成长时，那位上校，每隔两三个月，总要偷偷地、好象一个擅离指定住处的罪犯似的溜到巴黎来一次，趁着吉诺曼姑奶奶领着马吕斯去望弥撒时，他也溜去待在圣稣尔比斯教堂里。他躲在一根石柱后面，心惊胆战，唯恐那位姑奶奶回转头来，所以不动也不敢呼吸，眼睛盯着那孩子。一个脸上挂着刀痕的铁汉竟能害怕那样一个老姑娘。 正因为那样，他才和韦尔农的本堂神甫，马白夫神甫有了交情。 这位好好神甫是圣稣尔比斯教堂一位理财神甫的兄弟。理财神甫多次瞥见那人老觑着那孩子，脸上一道刀痕，眼里一眶眼泪。看神气，那人象个好男子，哭起来却又象个妇人，理财神甫见了，十分诧异。从此那人的面貌便印在他心里。一天，他到韦尔农去探望他的兄弟，走到桥上，遇见了彭眉胥上校，便认出他正好是圣稣尔比斯的那个人。理财神甫向本堂神甫谈起这件事，并且随便找了一个借口同去访问了上校。这之后就经常往来了。起初上校还不大肯说，后来也就无所不谈了，本堂神甫和理财神甫终于知道了全部事实，看清彭眉胥是怎样为了孩子的前程而牺牲自己的幸福。从此以后，本堂神甫对他特别尊敬，特别友好，上校对本堂神甫也引为知己。一个老神甫和一个老战士，只要彼此都诚恳善良，原是最容易情投意合成为莫逆之交的。他们在骨子里原是一体。一个献身于下方的祖国，一个献身于上界的天堂，其他的不同点就没有了。 马吕斯每年写两封信给他的父亲，元旦和圣乔治节①，那种信也只是为了应应景儿，由他姨母不知从什么尺牍里抄来口授的，这是吉诺曼先生唯一肯通融的地方。他父亲回信，却是满纸慈爱，外祖父收下便往衣袋里一塞，从来不看。 ①圣乔治（Saint　Georges，3-4世纪），相传为古代基督教殉教者，原为军人。彭眉胥是军人，故重视圣乔治节，节日在四月二十三日。","sourceLink":"http://novel.tingroom.com/jingdian/75/4300.html","bookId":542,"book":{"id":542,"title":"Les Miserables悲惨世界","description":"简介： 故事发生在19世纪的法国，穷苦农民冉阿让因偷面包而入狱多年，终获假释却再次无视法律，不得不开始逃亡。被收留他的主教感化后，冉阿让决心洗心革面，开始新生活。十年后他成为成功的商人并当上市长，却一直受到铁面警官贾维尔锲而不舍地追捕。...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1288579064ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/75","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
