{"id":35791,"no":204,"title":"Part 3 Book 8 Chapter 14 In which a Police Agent bestows Two Fistfuls on a Lawyer","content":"On arriving at No. 14, Rue de Pontoise, he ascended to the first floor and inquired for the commissary of police.　 \"The commissary of police is not here,\" said a clerk; \"but there is an inspector who takes his place. Would you like to speak to him? Are you in haste?\" \"Yes,\" said Marius. The clerk introduced him into the commissary\u0027s office. There stood a tall man behind a grating, leaning against a stove, and holding up with both hands the tails of a vast topcoat, with three collars. His face was square, with a thin, firmmouth, thick, gray, and very ferocious whiskers, and a look that was enough to turn your pockets inside out. Of that glance it might have been well said, not that it penetrated, but that it searched. This man\u0027s air was not much less ferocious nor less terrible than Jondrette\u0027s; the dog is, at times, no less terrible to meet than the wolf. \"What do you want?\" he said to Marius, without adding \"monsieur.\" \"Is this Monsieur le Commissaire de Police?\" \"He is absent. I am here in his stead.\" \"The matter is very private.\"\u0027 \"Then speak.\"　 \"And great haste is required.\" \"Then speak quick.\" This calm, abrupt man was both terrifying and reassuring at one and the same time. He inspired fear and confidence. Marius related the adventure to him: That a person with whom he was not acquainted otherwise than by sight, was to be inveigled into a trap that very evening; that, as he occupied the room adjoining the den, he, Marius Pontmercy, a lawyer, had heard the whole plot through the partition; that the wretch who had planned the trap was a certain Jondrette; that there would be accomplices, probably some prowlers of the barriers, among others a certain Panchaud, alias Printanier, alias Bigrenaille; that Jondrette\u0027s daughters were to lie in wait; that there was no way of warning the threatened man, since he did not even know his name; and that, finally, all this was to be carried out at six o\u0027clock that evening, at the most deserted point of the Boulevard de l\u0027Hopital, in house No. 50-52. 　 At the sound of this number, the inspector raised his head,and said coldly:-- \"So it is in the room at the end of the corridor?\" \"Precisely,\" answered Marius, and he added: \"Are you acquainted with that house?\" The inspector remained silent for a moment, then replied, as he warmed the heel of his boot at the door of the stove:--　 \"Apparently.\" He went on, muttering between his teeth, and not addressing Marius so much as his cravat:-- \"Patron-Minette must have had a hand in this.\" This word struck Marius. \"Patron-Minette,\" said he, \"I did hear that word pronounced,in fact.\" And he repeated to the inspector the dialogue between the long-haired man and the bearded man in the snow behind the wall of the Rue du Petit-Banquier. The inspector muttered:-- \"The long-haired man must be Brujon, and the bearded one Demi-Liard,alias Deux-Milliards.\" He had dropped his eyelids again, and became absorbed in thought. \"As for Father What\u0027s-his-name, I think I recognize him. Here, I\u0027ve burned my coat. They always have too much fire in these cursed stoves. Number 50-52. Former property of Gorbeau.\" Then he glanced at Marius. \"You saw only that bearded and that long-haired man?\" \"And Panchaud.\" \"You didn\u0027t see a little imp of a dandy prowling about the premises?\"　 \"No.\"　 \"Nor a big lump of matter, resembling an elephant in the Jardin des Plantes?\" \"No.\" \"Nor a scamp with the air of an old red tail?\" \"No.\" \"As for the fourth, no one sees him, not even his adjutants, clerks,and employees. It is not surprising that you did not see him.\"　 \"No. Who are all those persons?\" asked Marius. The inspector answered:-- \"Besides, this is not the time for them.\" He relapsed into silence, then resumed:-- \"50-52. I know that barrack. Impossible to conceal ourselves inside it without the artists seeing us, and then they will get off simply by countermanding the vaudeville. They are so modest!An audience embarrasses them. None of that, none of that. I want to hear them sing and make them dance.\"　 This monologue concluded, he turned to Marius, and demanded,gazing at him intently the while:-- \"Are you afraid?\" \"Of what?\" said Marius. \"Of these men?\" \"No more than yourself!\" retorted Marius rudely, who had begun to notice that this police agent had not yet said \"monsieur\" to him.　 The inspector stared still more intently at Marius, and continued with sententious solemnity:-- \"There, you speak like a brave man, and like an honest man. Courage does not fear crime, and honesty does not fear authority.\"　 Marius interrupted him:-- \"That is well, but what do you intend to do?\" The inspector contented himself with the remark:-- \"The lodgers have pass-keys with which to get in at night. You must have one.\" \"Yes,\" said Marius. \"Have you it about you?\" \"Yes.\" \"Give it to me,\" said the inspector. Marius took his key from his waistcoat pocket, handed it to the inspector and added:-- \"If you will take my advice, you will come in force.\" The inspector cast on Marius such a glance as Voltaire might have bestowed on a provincial academician who had suggested a rhyme to him;with one movement he plunged his hands, which were enormous,into the two immense pockets of his top-coat, and pulled out two small steel pistols, of the sort called \"knock-me-downs.\" Then he presented them to Marius, saying rapidly, in a curt tone:--　 \"Take these. Go home. Hide in your chamber, so that you may be supposed to have gone out. They are loaded. Each one carries two balls. You will keep watch; there is a hole in the wall,as you have informed me. These men will come. Leave them to their own devices for a time. When you think matters have reached a crisis, and that it is time to put a stop to them, fire a shot. Not too soon. The rest concerns me. A shot into the ceiling,the air, no matter where. Above all things, not too soon. Wait until they begin to put their project into execution; you are a lawyer;you know the proper point.\" Marius took the pistols and put them in the side pocket of his coat.　 \"That makes a lump that can be seen,\" said the inspector. \"Put them in your trousers pocket.\" Marius hid the pistols in his trousers pockets. \"Now,\" pursued the inspector, \"there is not a minute more to be lost by any one. What time is it? Half-past two. Seven o\u0027clock is the hour?\" \"Six o\u0027clock,\" answered Marius. \"I have plenty of time,\" said the inspector, \"but no more than enough. Don\u0027t forget anything that I have said to you. Bang. A pistol shot.\" \"Rest easy,\" said Marius.　 And as Marius laid his hand on the handle of the door on his way out,the inspector called to him:-- \"By the way, if you have occasion for my services between now and then,come or send here. You will ask for Inspector Javert.\" “所长先生不在，”一个不相干的勤务说，“但是有一个代替他的侦察员。您要和他谈谈吗？事情急吗？” “急。”马吕斯说。 勤务把他领进所长办公室。一个身材高大的人站在一道栅栏后面，紧靠着一个火炉，两手提着一件宽大的、有三层披肩的加立克大衣的下摆。那人生就一张方脸，嘴唇薄而有力，两丛浓厚的灰色鬓毛，形象极其粗野，目光能把你的衣服口袋翻转。我们不妨说那种目光不能穿透却会搜索。 这人神气的凶恶可怕，比起容德雷特来也差不了多少，有时我们遇见一头恶狗并不比遇见狼更放心。 “您要什么？”他对马吕斯说，并不称一声先生。 “是所长先生吗？” “他不在。我代替他。” “我要谈一件很秘密的事。” “那么谈吧。” “并且很紧急。” “那么赶紧谈。” 这人，冷静而突兀，让人见了又害怕，又心安。他使人产生恐惧心和信心。马吕斯把经过告诉他，说一个他只面熟而不相识的人在当天晚上将遭到暗害；他说自己，马吕斯·彭眉胥，律师，住在那兽穴隔壁的屋子里，他隔墙听到了全部阴谋；说主谋害人的恶棍是个叫容德雷特的家伙；说这人还有一伙帮凶，也许是些便门贼，其中有个什么邦灼，又叫春天，又叫比格纳耶的；说容德雷特的两个女儿将担任把风；说他没有办法通知那被暗算的人，因为他连他的姓名也不知道；最后还说这一切都将在当晚六点动手，地点在医院路上最荒凉的地方，五○一五二号房子里。 提到这号数时，侦察员抬起头，冷冷地说： “那么是在过道底上的那间屋子里吧？” “正是，”马吕斯说，他又加问一句，“您知道那所房子吗？” 侦察员沉默了一阵，接着，他一面在火炉口上烘他的靴子后跟，一面回答： “表面的一点。” 他又咬着牙齿，不全是对着马吕斯，主要是对着他的领带，继续说： “这里多少有点猫老板的手脚。” 这话提醒了马吕斯。 “猫老板，”他说，“对，我听到他们提这个名称。” 于是他把在小银行家街墙背后雪地上一个长头发和一个大胡子的对话告诉了侦察员。 侦察员嘴里嘟囔着： “那长头发一定是普吕戎，大胡子是半文钱，又叫二十亿。” 他又垂下了眼睑细想。 “至于那个老什么头，我也猜到了几分。瞧，我的大衣烧着了。这些倒霉的火炉里的火老是太旺。五○一五二号。从前是戈尔博的产业。” 接着他望着马吕斯说： “您只看见那大胡子和那长头发吗？” “还看见邦灼。” “您没有看见一个香喷喷的小个子妖精吗？” “没有。” “也没有看见一个又高又壮、长得象植物园的大象那样结结实实一大块的人吗？” “没有。” “也没有看见一个类似从前红尾那种模样的刁棍？” “没有。” “至于第四个，谁也没有见过，连他的那些帮手、同伙和喽罗也没见过。您没发现，那并不奇怪。” “当然。这是些什么东西，这伙人？”马吕斯问。 侦察员继续说： “并且这也不是他们的时间。” 他又沉默下来，随后说： “五○一五二号。我知道那地方。没办法躲在房子里而不惊动那些艺术家。他们随时都可以停止表演。他们是那么谦虚的！见了观众便扭扭捏捏。那样不成，那样不成。我要听他们歌唱，让他们舞蹈。” 这段独白结束以后，他转向马吕斯，定定地望着他说： “您害怕吗？” “怕什么？” “怕这伙人。” “不会比看见您更害怕些。”马吕斯粗声大气地回答，他开始注意到这探子还没有对他称过一声先生。 侦察员这时更加定定地望着马吕斯，堂而皇之地对他说：“您说话象个有胆量的人，也象个诚实人。勇气不怕罪恶，诚实不怕官家。” 马吕斯打断他的话，说道： “好吧，但是您打算怎么办？” 侦察员只是这样回答他： “那房子里的住户都有一把路路通钥匙，晚上回家用的。 您应当也有一把。” “有。”马吕斯说。 “您带在身上了？” “在身上。” “给我。”侦察员说。 马吕斯从背心口袋里掏出他的钥匙，递了给侦察员，说： “您要是相信我的话，您最好多带几个人去。” 侦察员对马吕斯望了一眼，那神气仿佛是伏尔泰听到一个外省的科学院院士向他提供一个诗韵，他同时把两只粗壮无比的手一齐插进那件加立克大衣的两个宽大无比的口袋里，掏出两管小钢枪，那种叫做“拳头”的手枪，他递给马吕斯，干脆而急促地说： “拿好这个。回家去。躲在您的屋子里。让别人认为您不在家。枪是上了子弹的。每支里有两粒。您注意看守。那墙上有个洞，您对我说过。那些人来了，让他们多少活动一下。当您认为时机已到，应当及时制止了，便开一枪，不能太早。其余的事，有我。朝空地方开一枪，对天花板，对任何地方，都行。特别留意，不能开得太早。要等到他们已开始行动后，您是律师，一定知道为什么要这样。” 马吕斯接了那两支手枪，塞在他上衣旁边的一个口袋里。 “这样鼓起一大块，别人能看出来，”侦察员说，“还是放在您背心口袋里好。” 马吕斯把两支枪分藏在两个背心口袋里。 “现在，”侦察员接着说，“谁也不能再浪费一分钟。什么时候了？两点半。他们要到七点才动手吧？” “六点。”马吕斯说。 “我还有时间，”侦察员说，“但只有这一点时间了。您不要忘了我说的话。砰。一枪。” “放心。”马吕斯回答。 马吕斯正伸手要拉门闩出去，侦察员对他喊道： “我说，万一您在那以前还需要我，您来或是派人来这里找我就是。您说要找侦察员沙威就行了。”","sourceLink":"http://novel.tingroom.com/jingdian/75/4341.html","bookId":542,"book":{"id":542,"title":"Les Miserables悲惨世界","description":"简介： 故事发生在19世纪的法国，穷苦农民冉阿让因偷面包而入狱多年，终获假释却再次无视法律，不得不开始逃亡。被收留他的主教感化后，冉阿让决心洗心革面，开始新生活。十年后他成为成功的商人并当上市长，却一直受到铁面警官贾维尔锲而不舍地追捕。...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1288579064ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/75","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
