{"id":35831,"no":244,"title":"Part 4 Book 8 Chapter 4 A Cab runs in English and barks in Slang","content":"The following day was the 3d of June, 1832, a date which it is necessary to indicate on account of the grave events which at that epoch hung on the horizon of Paris in the state of lightning-charged clouds. Marius, at nightfall, was pursuing the same road as on the preceding evening, with the same thoughts of delight in his heart, when he caught sight of Eponine approaching, through the trees of the boulevard. Two days in succession-- this was too much. He turned hastily aside, quitted the boulevard, changed his course and went to the Rue Plumet through the Rue Monsieur.\\n\\n This caused Eponine to follow him to the Rue Plumet, a thing which she had not yet done. Up to that time, she had contented herself with watching him on his passage along the boulevard without ever seeking to encounter him. It was only on the evening before that she had attempted to address him.\\n\\n So Eponine followed him, without his suspecting the fact. She saw him displace the bar and slip into the garden. \\n\\n She approached the railing, felt of the bars one after the other, and readily recognized the one which Marius had moved. \\n\\n She murmured in a low voice and in gloomy accents:-- \\n\\n \"None of that, Lisette!\" \\n\\n She seated herself on the underpinning of the railing, close beside the bar, as though she were guarding it.It was precisely at the point where the railing touched the neighboring wall. There was a dim nook there, in which Eponine was entirely concealed.\\n\\n She remained thus for more than an hour, without stirring and without breathing, a prey to her thoughts. \\n\\n Towards ten o\u0027clock in the evening, one of the two or three persons who passed through the Rue Plumet, an old, belated bourgeois who was making haste to escape from this deserted spot of evil repute, as he skirted the garden railings and reached the angle which it made with the wall, heard a dull and threatening voice saying:--\\n\\n \"I\u0027m no longer surprised that he comes here every evening.\" \\n\\n The passer-by cast a glance around him, saw no one, dared not peer into the black niche, and was greatly alarmed. He redoubled his pace. \\n\\n This passer-by had reason to make haste, for a very few instants later, six men, who were marching separately and at some distance from each other, along the wall,and who might have been taken for a gray patrol, entered the Rue Plumet.\\n\\n The first to arrive at the garden railing halted, and waited for the others; a second later, all six were reunited. \\n\\n These men began to talk in a low voice.\\n\\n \"This is the place,\" said one of them.\\n\\n \"Is there a cab [dog] in the garden?\" asked another.\\n\\n \"I don\u0027t know. In any case, I have fetched a ball that we\u0027ll make him eat.\"\\n\\n \"Have you some putty to break the pane with?\"\\n\\n \"Yes.\"\\n\\n \"The railing is old,\" interpolated a fifth, who had the voice of a ventriloquist.\\n\\n \"So much the better,\" said the second who had spoken. \"It won\u0027t screech under the saw, and it won\u0027t be hard to cut.\"\\n\\n The sixth, who had not yet opened his lips, now began to inspect the gate, as Eponine had done an hour earlier, grasping each bar in succession, and shaking them cautiously.\\n\\n Thus he came to the bar which Marius had loosened. As he was on the point of grasping this bar, a hand emerged abruptly from the darkness, fell upon his arm; he felt himself vigorously thrust aside by a push in the middle of his breast, and a hoarse voice said to him, but not loudly:--\\n\\n \"There\u0027s a dog.\"\\n\\n At the same moment, he perceived a pale girl standing before him.\\n\\n The man underwent that shock which the unexpected always brings. He bristled up in hideous wise; nothing is so formidable to behold as ferocious beasts who are uneasy; their terrified air evokes terror.\\n\\n He recoiled and stammered:--\\n\\n \"What jade is this?\"\\n\\n \"Your daughter.\"\\n\\n It was, in fact, Eponine, who had addressed Thenardier.\\n\\n At the apparition of Eponine, the other five, that is to say, Claquesous, Guelemer, Babet, Brujon, and Montparnasse had noiselessly drawn near, without precipitation, without uttering a word, with the sinister slowness peculiar to these men of the night.\\n\\n Some indescribable but hideous tools were visible in their hands. Guelemer held one of those pairs of curved pincers which prowlers call fanchons.\\n\\n \"Ah, see here, what are you about there? What do you want with us? Are you crazy?\" exclaimed Thenardier, as loudly as one can exclaim and still speak low; \"what have you come here to hinder our work for?\" \\n\\n Eponine burst out laughing, and threw herself on his neck.\\n\\n \"I am here, little father, because I am here. Isn\u0027t a person allowed to sit on the stones nowadays? It\u0027s you who ought not to be here. What have you come here for, since it\u0027s a biscuit? I told Magnon so. There\u0027s nothing to be done here. But embrace me, my good little father! It\u0027s a long time since I\u0027ve seen you! So you\u0027re out?\"\\n\\n Thenardier tried to disentangle himself from Eponine\u0027s arms, and grumbled:--\\n\\n \"That\u0027s good. You\u0027ve embraced me. Yes, I\u0027m out. I\u0027m not in. Now, get away with you.\"\\n\\n But Eponine did not release her hold, and redoubled her caresses.\\n\\n \"But how did you manage it, little pa? You must have been very clever to get out of that. Tell me about it! And my mother? Where is mother? Tell me about mamma.\"\\n\\n Thenardier replied:--\\n\\n \"She\u0027s well. I don\u0027t know, let me alone, and be off, I tell you. \\n\\n \"I won\u0027t go, so there now,\" pouted Eponine like a spoiled child; \"you send me off, and it\u0027s four months since I saw you, and I\u0027ve hardly had time to kiss you.\"\\n\\n And she caught her father round the neck again. \\n\\n \"Come, now, this is stupid!\" said Babet. \\n\\n \"Make haste!\" said Guelemer, \"the cops may pass.\"\\n\\n The ventriloquist\u0027s voice repeated his distich:--\\n\\n \"Nous n\u0027 sommes pas le jour de l\u0027an, \"This isn\u0027t New Year\u0027s day A becoter papa, maman.\" To peck at pa and ma.\"\\n\\n Eponine turned to the five ruffians.\\n\\n \"Why, it\u0027s Monsieur Brujon. Good day, Monsieur Babet. Good day, Monsieur Claquesous. Don\u0027t you know me, Monsieur Guelemer? How goes it, Montparnasse?\"\\n\\n \"Yes, they know you!\" ejaculated Thenardier. \"But good day, good evening, sheer off! leave us alone!\" \\n\\n \"It\u0027s the hour for foxes, not for chickens,\" said Montparnasse.\\n\\n \"You see the job we have on hand here,\" added Babet.\\n\\n Eponine caught Montparnasse\u0027s hand.\\n\\n \"Take care,\" said he, \"you\u0027ll cut yourself, I\u0027ve a knife open.\" \\n\\n \"My little Montparnasse,\" responded Eponine very gently, \"you must have confidence in people. I am the daughter of my father, perhaps. Monsieur Babet, Monsieur Guelemer, I\u0027m the person who was charged to investigate this matter.\"\\n\\n It is remarkable that Eponine did not talk slang. That frightful \\n\\n tongue had become impossible to her since she had known Marius.\\n\\n She pressed in her hand, small, bony, and feeble as that of a skeleton, Guelemer\u0027s huge, coarse fingers, and continued:-- \\n\\n \"You know well that I\u0027m no fool. Ordinarily, I am believed. I have rendered you service on various occasions. Well, I have made inquiries; you will expose yourselves to no purpose, you see. I swear to you that there is nothing in this house.\"\\n\\n \"There are lone women,\" said Guelemer.\\n\\n \"No, the persons have moved away.\"\\n\\n \"The candles haven\u0027t, anyway!\" ejaculated Babet.\\n\\n And he pointed out to Eponine, across the tops of the trees, a light which was wandering about in the mansard roof of the pavilion. It was Toussaint, who had stayed up to spread out some linen to dry.\\n\\n Eponine made a final effort.\\n\\n \"Well,\" said she, \"they\u0027re very poor folks, and it\u0027s a hovel where there isn\u0027t a sou.\"\\n\\n \"Go to the devil!\" cried Thenardier. \"When we\u0027ve turned the house upside down and put the cellar at the top and the attic below, we\u0027ll tell you what there is inside, and whether it\u0027s francs or sous or half-farthings.\"\\n\\n And he pushed her aside with the intention of entering. \\n\\n \"My good friend, Mr. Montparnasse,\" said Eponine, \"I entreat you, you are a good fellow, don\u0027t enter.\" \\n\\n \"Take care, you\u0027ll cut yourself,\" replied Montparnasse.\\n\\n Thenardier resumed in his decided tone:--\\n\\n \"Decamp, my girl, and leave men to their own affairs!\"\\n\\n Eponine released Montparnasse\u0027s hand, which she had grasped again, and said:--\\n\\n \"So you mean to enter this house?\"\\n\\n \"Rather!\" grinned the ventriloquist.\\n\\n Then she set her back against the gate, faced the six ruffians who were armed to the teeth, and to whom the night lent the visages of demons, and said in a firm, low voice:-- \\n\\n \"Well, I don\u0027t mean that you shall.\" \\n\\n They halted in amazement. The ventriloquist, however, finished his grin. She went on:--\\n\\n \"Friends! Listen well. This is not what you want. Now I\u0027m talking. In the first place, if you enter this garden, if you lay a hand on this gate, I\u0027ll scream, I\u0027ll beat on the door, I\u0027ll rouse everybody, I\u0027ll have the whole six of you seized, I\u0027ll call the police.\"\\n\\n \"She\u0027d do it, too,\" said Thenardier in a low tone to Brujon and the ventriloquist.\\n\\n She shook her head and added:--\\n\\n \"Beginning with my father!\"\\n\\n Thenardier stepped nearer.\\n\\n \"Not so close, my good man!\" said she.\\n\\n He retreated, growling between his teeth:--\\n\\n \"Why, what\u0027s the matter with her?\"\\n\\n And he added:--\\n\\n \"Bitch!\"\\n\\n She began to laugh in a terrible way:--\\n\\n \"As you like, but you shall not enter here. I\u0027m not the daughter of a dog, since I\u0027m the daughter of a wolf. There are six of you, what matters that to me? You are men. Well, I\u0027m a woman. You don\u0027t frighten me. I tell you that you shan\u0027t enter this house, because it doesn\u0027t suit me. If you approach, I\u0027ll bark. I told you, I\u0027m the dog, and I don\u0027t care a straw for you. Go your way, you bore me! Go where you please, but don\u0027t come here, I forbid it! You can use your knives. I\u0027ll use kicks; it\u0027s all the same to me, come on!\"\\n\\n She advanced a pace nearer the ruffians, she was terrible, she burst out laughing:--\\n\\n \"Pardine! I\u0027m not afraid. I shall be hungry this summer, and I shall be cold this winter. Aren\u0027t they ridiculous, these ninnies of men, to think they can scare a girl! What! Scare? Oh, yes, much! Because you have finical poppets of mistresses who hide under the bed when you put on a big voice, forsooth! I ain\u0027t afraid of anything, that I ain\u0027t!\"\\n\\n She fastened her intent gaze upon Thenardier and said:--\\n\\n \"Not even of you, father!\"\\n\\n Then she continued, as she cast her blood-shot, spectre-like eyes upon the ruffians in turn:-- \\n\\n \"What do I care if I\u0027m picked up to-morrow morning on the pavement of the Rue Plumet, killed by the blows of my father\u0027s club, or whether I\u0027m found a year from now in the nets at Saint-Cloud or the Isle of Swans in the midst of rotten old corks and drowned dogs?\"\\n\\n She was forced to pause; she was seized by a dry cough, her breath came from her weak and narrow chest like the death-rattle. \\n\\n She resumed:--\\n\\n \"I have only to cry out, and people will come, and then slap, bang! There are six of you; I represent the whole world.\"\\n\\n Thenardier made a movement towards her. \\n\\n \"Don\u0027t approach!\" she cried.\\n\\n He halted, and said gently:--\\n\\n \"Well, no; I won\u0027t approach, but don\u0027t speak so loud. So you intend to hinder us in our work, my daughter? But we must earn our living all the same. Have you no longer any kind feeling for your father?\" \\n\\n \"You bother me,\" said Eponine.\\n\\n \"But we must live, we must eat--\"\\n\\n \"Burst!\"\\n\\n So saying, she seated herself on the underpinning of the fence and hummed:--\\n\\n \"Mon bras si dodu, \"My arm so plump, Ma jambe bien faite My leg well formed, Et le temps perdu.\" And time wasted.\"\\n\\n She had set her elbow on her knee and her chin in her hand, and she swung her foot with an air of indifference. Her tattered gown permitted a view of her thin shoulder-blades.The neighboring street lantern illuminated her profile and her attitude. Nothing more resolute and more surprising could be seen.\\n\\n The six rascals, speechless and gloomy at being held in check by a girl, retreated beneath the shadow cast by the lantern, and held counsel with furious and humiliated shrugs. \\n\\n In the meantime she stared at them with a stern but peaceful air.\\n\\n \"There\u0027s something the matter with her,\" said Babet. \"A reason. Is she in love with the dog? It\u0027s a shame to miss this, anyway. Two women, an old fellow who lodges in the back-yard, and curtains that ain\u0027t so bad at the windows. The old cove must be a Jew. I think the job\u0027s a good one.\"\\n\\n \"Well, go in, then, the rest of you,\" exclaimed Montparnasse. \"Do the job. I\u0027ll stay here with the girl, and if she fails us--\" \\n\\n He flashed the knife, which he held open in his hand, in the light of the lantern.\\n\\n Thenardier said not a word, and seemed ready for whatever the rest pleased.\\n\\n Brujon, who was somewhat of an oracle, and who had, as the reader knows, \"put up the job,\" had not as yet spoken. He seemed thoughtful. He had the reputation of not sticking at anything, and it was known that he had plundered a police post simply out of bravado. Besides this he made verses and songs, which gave him great authority. \\n\\n Babet interrogated him:--\\n\\n \"You say nothing, Brujon?\"\\n\\n Brujon remained silent an instant longer, then he shook his head in various ways, and finally concluded to speak:-- \\n\\n \"See here; this morning I came across two sparrows fighting, this evening I jostled a woman who was quarrelling. All that\u0027s bad. Let\u0027s quit.\"\\n\\n They went away.\\n\\n As they went, Montparnasse muttered:--\\n\\n \"Never mind! If they had wanted, I\u0027d have cut her throat.\"\\n\\n Babet responded\\n\\n \"I wouldn\u0027t. I don\u0027t hit a lady.\"\\n\\n At the corner of the street they halted and exchanged the following enigmatical dialogue in a low tone:--\\n\\n \"Where shall we go to sleep to-night?\"\\n\\n \"Under Pantin [Paris].\"\\n\\n \"Have you the key to the gate, Thenardier?\"\\n\\n \"Pardi.\"\\n\\n Eponine, who never took her eyes off of them, saw them retreat by the road by which they had come. She rose and began to creep after them along the walls and the houses. She followed them thus as far as the boulevard.\\n\\n There they parted, and she saw these six men plunge into the gloom, where they appeared to melt away.\\n\\n 第二天是六月三日，一八三二年六月三日，这个日期是应当指出的，因为当时有些重大的事件，象雷雨云那样，压在巴黎的天边。这天，马吕斯在傍晚时，正顺着他昨晚走过的那条路往前走，心里想着那些常想的开心事，忽然看见爱潘妮在树林和大路之间向他走来。一连两天。太过分了。他连忙转身，离开大路，改变路线，穿过先生街去卜吕梅街。\\n\\n 爱潘妮跟着他直到卜吕梅街，这是她在过去没有做过的。在这以前，她一向满足于望着他穿过大路，从不想到要去和他打个照面。只是昨天傍晚，她才第一次想找他谈话。\\n\\n 爱潘妮跟着他，他却没有觉察。她看见他挪开铁栏门上的铁条，钻到园子里去。\\n\\n “哟！”她说，“他到她家里去了。”\\n\\n 她走近铁栏门，逐根地摇撼那些铁条，很容易就找出了马吕斯挪动过的那根。\\n\\n 她带着阴森森的语调低声说：\\n\\n “那可不成，丽赛特！”\\n\\n 她过去坐在铁栏门的石基上，紧靠着那根铁条，仿佛是在守护它。那正是在铁栏门和邻墙相接的地方，有一个黑暗的旮旯，爱潘妮躲在那里面，一点不现形。\\n\\n 她这样待在那里，足有一个多钟头，不动也不出气，完全被自己心里的事控制住了。\\n\\n 将近夜里十点钟的时候，有两个或三个行人走过卜吕梅街，其中一个是耽误了时间的老先生，匆匆忙忙走到这荒凉、名声不好的地段，挨着那园子的铁栏门，走到门和墙相接处的凹角跟前，忽然听见一个人的沙嗄凶狠的声音说道：\\n\\n “怪不得他每晚要来！”\\n\\n 那过路人睁大眼睛四面望去，却看不见一个人，又不敢望那黑旮旯，心里好不害怕。他加快脚步走了。\\n\\n 这过路人幸亏赶快走了，因为不一会儿，有六个人，或前或后，彼此相隔一定距离，挨着围墙，看去好象是一队喝醉了的巡逻兵，走进了卜吕梅街。\\n\\n 第一个走到那园子的铁栏门前，停了下来，等待其余的几个，过了一会儿，六个人会齐了。\\n\\n 这些人开始低声说话。\\n\\n “就是此地。”其中的一个说①。 \\n\\n ①这一段里，有许多匪徒的黑话，无法一一译出。　\\n\\n “园子里有狗吗？”另一个问。\\n\\n “我不知道。不用管那些，我带了一个团子给它吃。”\\n\\n “你带了砸玻璃窗用的油灰吗？”\\n\\n “带了。”\\n\\n “这是一道老铁栏门。”第五个人说，那是个用肚子说话的人。\\n\\n “再好没有，”先头第二个说话的人说，“它不会在锯子下面叫，也不会那么难切断。”\\n\\n 一直还没有开门的那第六个人，开始察看铁栏门，就象爱潘妮先头做过的那样，把那些铁条逐根抓住，仔细地一一摇撼。他摇到了马吕斯已经弄脱了臼的那根。他正要去抓那铁条，黑暗中突然伸过一只手，打在他的手臂上，他还觉得被人当胸猛推了一掌，同时听到一个人的嘶哑声音对他轻轻吼道：\\n\\n “有狗。”\\n\\n 他看见一个面色蜡黄的姑娘站在他面前。\\n\\n 那人猝不及防，大吃一惊，他立即摆开凶猛的架势，猛兽吃惊时的模样是最可怕的，它那被吓的样子也是最吓人的。他退后一步，嘴里结结巴巴地说：\\n\\n “这是个什么妖精？”\\n\\n “你的女儿。”\\n\\n 那正是爱潘妮在对德纳第说话。\\n\\n 爱潘妮出现时，那五个人，就是说，铁牙、海嘴、巴伯、巴纳斯山和普吕戎，都无声无息，不慌不忙，没说一句话，带着夜晚活动的人所专有的那种慢而阴狠的稳劲，一齐走拢来了。\\n\\n 他们手里都带着奇形怪状的凶器。海嘴拿着一把强人们叫做“包头巾”的弯嘴铁钳。\\n\\n “妈的，你在这儿干什么？你要怎么样，疯了吗？”德纳第尽量压低声音吼着说，“你干吗要来碍我们的事？”\\n\\n 爱潘妮笑了出来，跳上去抱住他的颈子。\\n\\n “我在这儿，我的小爸爸，因为我在这儿。难道现在不许人家坐在石头上了吗？是你们不应当到这儿来。你们来这儿干什么？你们早知道是块饼干嘛。我也告诉过马侬了。一点办法也没有，这儿。但是，亲亲我吧，我的好爸爸，小爸爸！多久我没有看见您老人家了！您已经在外面了，看来？”\\n\\n 德纳第试图掰开爱潘妮的手臂，低声埋怨说：\\n\\n “好了。你已经吻过我了。是的，我已经在外面了，我不在里面。现在，你走开。”\\n\\n 但是爱潘妮不松手，反而抱得更紧。\\n\\n “我的小爸爸，您是怎么出来的？您费尽脑筋才逃了出来的吧。您说给我听听！还有我的妈呢？我妈在什么地方？把我妈的消息告诉我。”\\n\\n 德纳第回答说：\\n\\n “她过得不坏。我不知道，不要缠我，去你的，听见了吗？”\\n\\n “我就是不愿意走开，”爱潘妮装顽皮孩子撒娇的样子说，“您放着我不管，已经四个月了，我见不着您，也亲不着您。”\\n\\n 她又抱紧她父亲的颈子。\\n\\n “够了，已经够傻的了！”巴伯说。\\n\\n “快点！”海嘴说，“宪兵们要来了。”\\n\\n 那个用肚子说话的人念出了这两句诗：\\n\\n 我们不在过新年，\\n\\n 吻爹吻娘改一天。\\n\\n 爱潘妮转过身来对着那五个匪徒说：\\n\\n “哟，普吕戎先生。您好，巴伯先生。您好，铁牙先生。您不认识我吗，海嘴先生？过得怎样，巴纳斯山？”\\n\\n “认识的，大家都认识你！”德纳第说，“但是白天好，晚上好，靠边儿站！不要捣乱了。”\\n\\n “这是狐狸活动的时候，不是母鸡活动的时候。”巴纳斯山说。\\n\\n “你明明知道我们在此地有活干。”巴伯接着说。\\n\\n 爱潘妮抓住巴纳斯山的手。\\n\\n “小心，”他说，“小心割了你的手，我拿着一把没有套上的刀子呢。”\\n\\n “我的小巴纳斯山，”爱潘妮柔声柔气地回答说，“你们应当相信人。我是我父亲的女儿，也许。巴伯先生，海嘴先生，当初人家要了解这桩买卖的情况，那任务是交给我的。”\\n\\n 值得注意的是，爱潘妮不说黑话。自从她认识马吕斯后，这种丑恶的语言已不是她说得出口的了。\\n\\n 她用她那皮包骨头、全无力气的小手，紧捏着海嘴的粗壮的手指，继续说：\\n\\n “您知道我不是傻子。大家平时都还信得过我。我也替你们办过一些事。这次，我已经调查过了，你们会白白地暴露你们自己，懂吗。我向您发誓，这宅子里弄不出一点名堂。”\\n\\n “有几个单身的女人。”海嘴说。\\n\\n “没有。人家已经搬走了。”\\n\\n “那些蜡烛可没有搬走，总而言之！”巴伯说。\\n\\n 他还指给爱潘妮看，从树尖的上面，看得见在那凉亭的顶楼屋子里，有亮光在移动。那是杜桑夜里在晾洗好的衣服。\\n\\n 爱潘妮试作最后的努力。\\n\\n “好吧，”她说，“这是些很穷的人，是个没有钱的破棚棚。”\\n\\n “见你的鬼去！”德纳第吼着说，“等我们把这房子翻转过来了，等我们把地窖翻到了顶上，阁楼翻到了底下，我们再来告诉你那里究竟有的是法郎，是苏，还是小钱。”\\n\\n 他把她推过一边，要冲向前去。\\n\\n “我的好朋友巴纳斯山先生，”爱潘妮说，“我求求您，您是好孩子，您不要进去！”\\n\\n “小心，要割破你了！”巴纳斯山回答她说。\\n\\n 德纳第以他特有的那种坚决口吻接着说：\\n\\n “滚开，小妖精，让我们男人干自己的活。”\\n\\n 爱潘妮放开巴纳斯山的手，说道：\\n\\n “你们一定要进这宅子？”\\n\\n “有点儿想。”那个用肚子说话的人半开玩笑地说。\\n\\n 她于是背靠着铁栏门，面对着那六个武装到牙齿、在黑影里露着一张鬼脸的匪徒，坚决地低声说：\\n\\n “可是，我，我不愿意。”\\n\\n 那些匪徒全愣住了。用肚子说话的那人咧了咧嘴。她又说：\\n\\n “朋友们！听我说。废话说够了。我说正经的。首先，你们如果跨进这园子，你们如果碰一下这铁栏门，我便喊出来，我便敲人家的大门，我把大家叫醒，我要他们把你们六个全抓起来，我叫警察。”\\n\\n “她会干得出来的。”德纳第对着普吕戎和那用肚子说话的人低声说。\\n\\n 她晃了一下脑袋，并说：\\n\\n “从我父亲开始！”\\n\\n 德纳第走近她。\\n\\n “站远点，老家伙！”她说。\\n\\n 他朝后退，牙缝里叽叽咕咕埋怨说，“她究竟要什么？”并加上一句：\\n\\n “母狗！”\\n\\n 她开始笑起来，叫人听了害怕。\\n\\n “随便你们要什么，你们反正进不去了。我不是狗的女儿，因为我是狼的女儿。你们是六个，那和我有什么关系？你们全是男人。可我，是个女人。你们吓唬不了我，你们放心。我告诉你们，你们进不了这宅子，因为我不高兴让你们进去。你们如果走近我，我便叫起来。我已经关照过你们了，狗，就是我。你们这些人，我压根不把你们放在眼里。你们给我赶快走开，我见了你们就生气！你们去哪儿都行，就是不许到这儿来，我禁止你们来这儿！你们动刀子，我就用破鞋子揍你们，反正都一样，你们敢来试试！”\\n\\n 她向那伙匪徒跨上一步，气势好不吓人，她笑了出来。\\n\\n “有鬼！我不怕。这个夏天，我要挨饿，冬天，我要挨冻。真是滑稽，这些男子汉以为他们吓唬得了一个女人！怕！怕什么！是呀，怕得很！就是因为你们有泼辣野婆娘，只要你们吼一声，她们就会躲到床底下去，不就是这样吗！我，我啥也不怕！”\\n\\n 她瞪着眼睛，定定地望着德纳第，说道：\\n\\n “连你也不怕！”\\n\\n 接着她睁大那双血红的眼睛，对那伙匪徒扫去，继续说：\\n\\n “我爹拿起刀子把我戳个稀巴烂，明天早晨人家把我从卜吕梅街的铺石路上拣起来，或者，一年过后，人家在圣克鲁或天鹅洲的河里，在用网子捞起腐烂了的瓶塞子和死狗堆时发现我的尸体，我都不在乎！”\\n\\n 她不得不停下来，一阵干咳堵住了她的嗓子，从她那狭小瘦弱的胸口里传出一串咯咯的喘气声。\\n\\n 她接着又说：\\n\\n “我只要喊一声，人家就会来，全完蛋。你们是六个人，我是所有的人。”\\n\\n 德纳第朝她那边动了一下。\\n\\n “不许靠近我！”她大声说。\\n\\n 他立即停了下来，和颜悦色地对她说：\\n\\n “得，得。我不靠近你，但是说话小声点。我的女儿，你不让我们干活吗？可我们总得找活路。你对你爹就一点交情也没有吗？”\\n\\n “你讨厌。”爱潘妮说。\\n\\n “可我们总得活下去呀，总得有吃……”\\n\\n “饿死活该。”\\n\\n 说过这话，她坐回铁栏门的石基上，嘴里低声唱着：\\n\\n 我的胳膊胖嘟嘟，\\n\\n 我的大腿肥呶呶，\\n\\n 日子过得可不如。\\n\\n 她把肘弯支在膝头上，掌心托着下巴颏，摇晃着一只脚，神气满不在乎。从有洞的裙袍里露出她的枯干的肩胛骨。附近一盏路灯照着她的侧影和神气，再没有比那显得更坚决，更惊人的了。\\n\\n 六个歹徒被这姑娘镇住了，垂头丧气，不知道怎么办，一齐走到路灯的阴影里去商量，又羞又恼，只耸肩膀。\\n\\n 这时，她带着平静而粗野的神气望着他们。\\n\\n “她这里一定有玩意儿，”巴伯说，“有原因。难道她爱上了这里的狗不成？白白跑这一趟，太不合算了。两个女人，一个住在后院的老头，窗上的窗帘确实不坏。那老头一定是个犹太人。我认为这是一笔好买卖。”\\n\\n “那么，进去就是，你们五个，”巴纳斯山说，“做好买卖。我留在这儿，看好这闺女，要是她动一动……”\\n\\n 他把藏在衣袖里的刀子拿出来在路灯光下亮了一下。\\n\\n 德纳第没吭声，好象准备听从大伙儿的意见。\\n\\n 普吕戎，多少有点权威性，并且，我们知道，这“买卖是他介绍的”，还没有开口。他好象是在深入思考。他一向是被认为不在任何困难面前退却的。大家都知道，有一天，仅仅是为了逞能，他洗劫过一个城区的警察哨所。此外，他还写诗和歌，这些都使他有相当高的威望。\\n\\n 巴伯问他：\\n\\n “你不说话，普吕戎？”\\n\\n 普吕戎仍沉默了一会儿，接着，他用多种不同的方式摇晃了几次头，才提高嗓子说：\\n\\n “是这样：今早我看见两个麻雀打架，今晚我又碰上一个吵吵闹闹的女人。这一切都不是好事。我们还是走吧。”\\n\\n 他们走了。\\n\\n 巴纳斯山，一面走，一面嘟囔：\\n\\n “没关系，如果大家同意，我还是可以给她一脚尖。”\\n\\n 巴伯回答他说：\\n\\n “我不同意。我从不打女人。”\\n\\n 走到街角上，他们停下来，交换了这么几句费解的话：\\n\\n “今晚我们睡在哪儿？”\\n\\n “巴黎下面。”\\n\\n “你带了铁栏门的钥匙吧，德纳第？”\\n\\n “还用说。”\\n\\n 爱潘妮的眼睛一直盯着他们，看见他们从先头来的那条路走了。她站起来，一路顺着围墙和房屋，跟在他们后面爬。她这样跟着他们一直到大路边。到了那里，他们便各自散了。她看见那六个人走进黑暗里，仿佛和黑暗溶合在一起。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/75/4381.html","bookId":542,"book":{"id":542,"title":"Les Miserables悲惨世界","description":"简介： 故事发生在19世纪的法国，穷苦农民冉阿让因偷面包而入狱多年，终获假释却再次无视法律，不得不开始逃亡。被收留他的主教感化后，冉阿让决心洗心革面，开始新生活。十年后他成为成功的商人并当上市长，却一直受到铁面警官贾维尔锲而不舍地追捕。...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1288579064ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/75","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
