{"id":35871,"no":284,"title":"Part 5 Book 1 Chapter 4 Minus Five, Plus One","content":"After the man who decreed the \"protest of corpses\" had spoken, and had given this formula of their common soul, there issued from all mouths a strangely satisfied and terrible cry, funereal in sense and triumphant in tone:\\n\\n \"Long live death! Let us all remain here!\"\\n\\n \"Why all?\" said Enjolras.\\n\\n \"All! All!\"\\n\\n Enjolras resumed:\\n\\n \"The position is good; the barricade is fine. Thirty men are enough. Why sacrifice forty?\"\\n\\n They replied:\\n\\n \"Because not one will go away.\"\\n\\n \"Citizens,\" cried Enjolras, and there was an almost irritated vibration in his voice, \"this republic is not rich enough in men to indulge in useless expenditure of them. Vain-glory is waste. If the duty of some is to depart, that duty should be fulfilled like any other.\"\\n\\n Enjolras, the man-principle, had over his co-religionists that sort of omnipotent power which emanates from the absolute. Still, great as was this omnipotence, a murmur arose. A leader to the very finger-tips, Enjolras, seeing that they murmured, insisted. He resumed haughtily: \\n\\n \"Let those who are afraid of not numbering more than thirty say so.\"\\n\\n The murmurs redoubled.\\n\\n \"Besides,\" observed a voice in one group, \"it is easy enough to talk about leaving. The barricade is hemmed in.\"\\n\\n \"Not on the side of the Halles,\" said Enjolras. \"The Rue Mondetour is free, and through the Rue des Precheurs one can reach the Marche des Innocents.\"\\n\\n \"And there,\" went on another voice, \"you would be captured. You would fall in with some grand guard of the line or the suburbs; they will spy a man passing in blouse and cap.`Whence come you?\u0027`Don\u0027t you belong to the barricade?\u0027 And they will look at your hands. You smell of powder. Shot.\"\\n\\n Enjolras, without making any reply, touched Combeferre\u0027s shoulder, and the two entered the tap-room.\\n\\n They emerged thence a moment later. Enjolras held in his outstretched hands the four uniforms which he had laid aside. Combeferre followed, carrying the shoulder-belts and the shakos.\\n\\n \"With this uniform,\" said Enjolras, \"you can mingle with the ranks and escape; here is enough for four.\" And he flung on the ground, deprived of its pavement, the four uniforms.\\n\\n No wavering took place in his stoical audience. Combeferre took the word.\\n\\n \"Come, said he, \"you must have a little pity. Do you know what the question is here? It is a question of women. See here. Are there women or are there not? Are there children or are there not? Are there mothers, yes or no, who rock cradles with their foot and who have a lot of little ones around them? Let that man of you who has never beheld a nurse\u0027s breast raise his hand. Ah! You want to get yourselves killed, so do I--I, who am speaking to you; but I do not want to feel the phantoms of women wreathing their arms around me. Die, if you will, but don\u0027t make others die. Suicides like that which is on the brink of accomplishment here are sublime; but suicide is narrow, and does not admit of extension; and as soon as it touches your neighbors, suicide is murder. Think of the little blond heads; think of the white locks. Listen, Enjolras has just told me that he saw at the corner of the Rue du Cygne a lighted casement, a candle in a poor window, on the fifth floor, and on the pane the quivering shadow of the head of an old woman, who had the air of having spent the night in watching. Perhaps she is the mother of some one of you. Well, let that man go, and make haste, to say to his mother:`Here I am, mother!\u0027 Let him feel at ease, the task here will be performed all the same. When one supports one\u0027s relatives by one\u0027s toil, one has not the right to sacrifice one\u0027s self. That is deserting one\u0027s family. And those who have daughters! what are you thinking of? You get yourselves killed, you are dead, that is well. And tomorrow? Young girls without bread--that is a terrible thing. Man begs, woman sells. Ah! those charming and gracious beings, so gracious and so sweet, who have bonnets of flowers, who fill the house with purity, who sing and prattle, who are like a living perfume, who prove the existence of angels in heaven by the purity of virgins on earth, that Jeanne, that Lise, that Mimi, those adorable and honest creatures who are your blessings and your pride, ah! good God, they will suffer hunger! What do you want me to say to you? There is a market for human flesh; and it is not with your shadowy hands, shuddering around them, that you will prevent them from entering it! Think of the street, think of the pavement covered with passers-by, think of the shops past which women go and come with necks all bare, and through the mire. These women, too, were pure once. Think of your sisters, those of you who have them. Misery, prostitution, the police, Saint-Lazare-- that is what those beautiful, delicate girls, those fragile marvels of modesty, gentleness and loveliness, fresher than lilacs in the month of May, will come to. Ah! You have got yourselves killed! You are no longer on hand! That is well; you have wished to release the people from Royalty, and you deliver over your daughters to the police. Friends, have a care, have mercy. Women, unhappy women, we are not in the habit of bestowing much thought on them. We trust to the women not having received a man\u0027s education, we prevent their reading, we prevent their thinking, we prevent their occupying themselves with politics; will you prevent them from going to the dead-house this evening, and recognizing your bodies? Let us see, those who have families must be tractable, and shake hands with us and take themselves off, and leave us here alone to attend to this affair. I know well that courage is required to leave, that it is hard; but the harder it is, the more meritorious. You say: `I have a gun, I am at the barricade; so much the worse, I shall remain there.\u0027 So much the worse is easily said. My friends, there is a morrow; you will not be here to-morrow, but your families will; and what sufferings! See, here is a pretty, healthy child, with cheeks like an apple, who babbles, prattles, chatters, who laughs, who smells sweet beneath your kiss,--and do you know what becomes of him when he is abandoned? I have seen one, a very small creature, no taller than that. His father was dead. Poor people had taken him in out of charity, but they had bread only for themselves. The child was always hungry. It was winter. He did not cry. You could see him approach the stove, in which there was never any fire, and whose pipe, you know, was of mastic and yellow clay. His breathing was hoarse, his face livid, his limbs flaccid, his belly prominent. He said nothing. If you spoke to him, he did not answer. He is dead. He was taken to the Necker Hospital, where I saw him. I was house-surgeon in that hospital. Now, if there are any fathers among you, fathers whose happiness it is to stroll on Sundays holding their child\u0027s tiny hand in their robust hand, let each one of those fathers imagine that this child is his own. That poor brat, I remember, and I seem to see him now, when he lay nude on the dissecting table, how his ribs stood out on his skin like the graves beneath the grass in a cemetery. A sort of mud was found in his stomach. There were ashes in his teeth. Come, let us examine ourselves conscientiously and take counsel with our heart. Statistics show that the mortality among abandoned children is fifty-five per cent. I repeat, it is a question of women, it concerns mothers, it concerns young girls, it concerns little children. Who is talking to you of yourselves? We know well what you are; we know well that you are all brave, parbleu! we know well that you all have in your souls the joy and the glory of giving your life for the great cause; we know well that you feel yourselves elected to die usefully and magnificently, and that each one of you clings to his share in the triumph. Very well. But you are not alone in this world. There are other beings of whom you must think. You must not be egoists.\"\\n\\n All dropped their heads with a gloomy air.\\n\\n Strange contradictions of the human heart at its most sublime moments. Combeferre, who spoke thus, was not an orphan. He recalled the mothers of other men, and forgot his own. He was about to get himself killed. He was \"an egoist.\"\\n\\n Marius, fasting, fevered, having emerged in succession from all hope, and having been stranded in grief, the most sombre of shipwrecks, and saturated with violent emotions and conscious that the end was near, had plunged deeper and deeper into that visionary stupor which always precedes the fatal hour voluntarily accepted. \\n\\n A physiologist might have studied in him the growing symptoms of that febrile absorption known to, and classified by, science, and which is to suffering what voluptuousness is to pleasure. Despair, also, has its ecstasy. Marius had reached this point. He looked on at everything as from without; as we have said, things which passed before him seemed far away; he made out the whole, but did not perceive the details. He beheld men going and coming as through a flame. He heard voices speaking as at the bottom of an abyss.\\n\\n But this moved him. There was in this scene a point which pierced and roused even him. He had but one idea now, to die; and he did not wish to be turned aside from it, but he reflected, in his gloomy somnambulism, that while destroying himself, he was not prohibited from saving some one else. \\n\\n He raised his voice.\\n\\n \"Enjolras and Combeferre are right,\" said he; \"no unnecessary sacrifice. I join them, and you must make haste. Combeferre has said convincing things to you. There are some among you who have families, mothers, sisters, wives, children. Let such leave the ranks.\"\\n\\n No one stirred.\\n\\n \"Married men and the supporters of families, step out of the ranks!\" repeated Marius.\\n\\n His authority was great. Enjolras was certainly the head of the barricade, but Marius was its savior.\\n\\n \"I order it,\" cried Enjolras.\\n\\n \"I entreat you,\" said Marius.\\n\\n Then, touched by Combeferre\u0027s words, shaken by Enjolras\u0027 order, touched by Marius\u0027 entreaty, these heroic men began to denounce each other.--\"It is true,\" said one young man to a full grown man, \"you are the father of a family. Go.\"--\"It is your duty rather,\" retorted the man, \"you have two sisters whom you maintain.\"-- And an unprecedented controversy broke forth. Each struggled to determine which should not allow himself to be placed at the door of the tomb.\\n\\n \"Make haste,\" said Courfeyrac, \"in another quarter of an hour it will be too late.\"\\n\\n \"Citizens,\" pursued Enjolras, \"this is the Republic, and universal suffrage reigns. Do you yourselves designate those who are to go.\" \\n\\n They obeyed. After the expiration of a few minutes, five were unanimously selected and stepped out of the ranks.\\n\\n \"There are five of them!\" exclaimed Marius.\\n\\n There were only four uniforms.\\n\\n \"Well,\" began the five, \"one must stay behind.\"\\n\\n And then a struggle arose as to who should remain, and who should find reasons for the others not remaining.The generous quarrel began afresh.\\n\\n \"You have a wife who loves you.\"--\"You have your aged mother.\"--\" You have neither father nor mother, and what is to become of your three little brothers?\"--\"You are the father of five children.\"--\"You have a right to live, you are only seventeen, it is too early for you to die.\"\\n\\n These great revolutionary barricades were assembling points for heroism.The improbable was simple there. These men did not astonish each other. \\n\\n \"Be quick,\" repeated Courfeyrac.\\n\\n Men shouted to Marius from the groups:\\n\\n \"Do you designate who is to remain.\"\\n\\n \"Yes,\" said the five, \"choose. We will obey you.\"\\n\\n Marius did not believe that he was capable of another emotion. Still, at this idea, that of choosing a man for death, his blood rushed back to his heart. He would have turned pale, had it been possible for him to become any paler. \\n\\n He advanced towards the five, who smiled upon him, and each, with his eyes full of that grand flame which one beholds in the depths of history hovering over Thermopylae, cried to him:\\n\\n \"Me! me! me!\"\\n\\n And Marius stupidly counted them; there were still five of them! Then his glance dropped to the four uniforms. \\n\\n At that moment, a fifth uniform fell, as if from heaven, upon the other four.\\n\\n The fifth man was saved.\\n\\n Marius raised his eyes and recognized M. Fauchelevent.\\n\\n Jean Valjean had just entered the barricade.\\n\\n He had arrived by way of Mondetour lane, whither by dint of inquiries made, or by instinct, or chance. Thanks to his dress of a National Guardsman, he had made his way without difficulty. \\n\\n The sentinel stationed by the insurgents in the Rue Mondetour had no occasion to give the alarm for a single National Guardsman, and he had allowed the latter to entangle himself in the street, saying to himself: \"Probably it is a reinforcement, in any case it is a prisoner.\" The moment was too grave to admit of the sentinel abandoning his duty and his post of observation.\\n\\n At the moment when Jean Valjean entered the redoubt, no one had noticed him, all eyes being fixed on the five chosen men and the four uniforms. Jean Valjean also had seen and heard, and he had silently removed his coat and flung it on the pile with the rest.\\n\\n The emotion aroused was indescribable.\\n\\n \"Who is this man?\" demanded Bossuet.\\n\\n \"He is a man who saves others,\" replied Combeferre.\\n\\n Marius added in a grave voice:\\n\\n \"I know him.\"\\n\\n This guarantee satisfied every one.\\n\\n Enjolras turned to Jean Valjean.\\n\\n \"Welcome, citizen.\"\\n\\n And he added:\\n\\n \"You know that we are about to die.\"\\n\\n Jean Valjean, without replying, helped the insurgent whom he was saving to don his uniform.\\n\\n “死亡万岁！咱们大伙都留在这儿！”\\n\\n “为什么都留下来？”安灼拉问。\\n\\n “都留下！都留下！”\\n\\n 安灼拉又说：\\n\\n “地势优越，街垒坚固，三十个人足够了。为什么要牺牲四十个人呢？”\\n\\n 大家回答：\\n\\n “因为没有一个人想离开呀！”\\n\\n “公民们，”安灼拉大声说，他的声音带点激怒的颤动，“共和国在人员方面并不算多，要节约人力。虚荣就是浪费。对某些人来说，如果他们的任务是离开这里，那么这种任务也该象其他任务一样，要去完成。”\\n\\n 安灼拉是一个坚持原则的人，在他的同道中他具有一种从绝对中产生出来的无上权威。他虽有这种无限的权力，但大家仍低声议论纷纷。\\n\\n 安灼拉是个十足的领袖，他见人议论、就坚持他的看法，他用高傲的语气继续发问：“谁为只剩下三十个人而害怕，就来讲讲。”\\n\\n 嘟囔声越来越大了。\\n\\n 人群中有个声音提醒说：“离开这里，说得倒容易，整个街垒都被包围了。”\\n\\n 安灼拉说：“菜市场那边没有被包围。蒙德都街无人看守，而且从布道修士街可以通到圣婴市场去。”\\n\\n 人群中另一个声音指出：“在那儿就会被抓起来。我们会遇到郊区的或正规的自卫军，他们见到穿工人服戴便帽的人就会问：‘你们从哪儿来？你不是街垒里的人吗？’他们会叫你伸出手来看，发现手上有火药味，就枪毙。”\\n\\n 安灼拉并不回答，他用手碰了一下公白飞的肩膀，他们走到下面的厅堂里去了。\\n\\n 一会儿他们又从那儿出来。安灼拉两手托着四套他吩咐留下的制服，公白飞拿着皮带和军帽跟在后面。\\n\\n 安灼拉说：“穿上制服就很容易混进他们的队伍脱身了。\\n\\n 这里至少已够四个人的。”\\n\\n 他把这些制服扔在挖去了铺路石的地上。\\n\\n 这些临危泰然自若的听众没有一个人动一动。公白飞接着发言。\\n\\n “好啦，”他说，“大家应当有点恻隐心。你们知道现在的问题是什么吗？是妇女。请问妇女到底存在不存在？孩子到底存在不存在？有没有身边围着一群孩子，用脚推着摇篮的母亲？你们中间，谁没有见过喂奶母亲的请举手。好啊！你们要牺牲自己，我对你们说，我也愿意这样，可是我不愿女人的阴魂在我周围悲泣。你们愿意死，行，可是不能连累别人。这里将要出现的自杀是高尚的，不过自杀也有限制，不该扩大；况且一旦你身边的人受到自杀的影响，那就成为谋杀了。应当为那些金发孩儿、还有那些白发老人想想。听我讲，刚才安灼拉对我说，他看见在天鹅街转角上，六楼的一个小窗口点着一支蜡烛，玻璃窗里映出一个哆哆嗦嗦的老婆婆的头影，她好象通宵未眠，在等待着。这可能是你们中间哪一位的母亲。那么，这个人应该赶快走，快回去向他母亲说：‘妈，我回来了！’他只管放心，我们这里的工作照样进行。当一个人要用劳动去抚养他的近亲时，他就没有权利牺牲。否则就是背离家庭。还有那些有女儿的和有姊妹的人，你们考虑过没有？你们自己牺牲了，死了，倒不错，可是明天怎么办呢？年轻的女孩子没有面包，这是可怕的。男人可以去乞食，女人就得去卖身。呵！这些可爱的人儿是这样的优雅温柔，她们戴着饰花软帽，爱说爱唱，使家里充满着贞洁的气氛，好象芳香四溢的鲜花，这些人间无瑕的童贞说明天上是有天使的，这个让娜，这个莉丝，这个咪咪，这些可爱而又诚实的人是你们所祝福而且为之骄傲的，啊老天，她们要挨饿了！你们要我怎么说呢？是有着一个人肉市场的，这可不是单凭你那双在她们身旁发颤的幽灵的手就能阻止她们进入！想想那些街巷，想想那些拥挤的马路，那些在商店橱窗前面来来往往袒胸露臂堕入泥坑的女人吧。这些女人以前也是纯洁的。有姊妹的人要替姊妹们考虑。穷困、卖淫、保安警察、圣辣匝禄监狱，这些娇小美丽的女孩子因此而堕落，她们是脆弱的出色的人儿，腼腆、优雅、贤慧、清秀。比五月的丁香更鲜妍。啊，你们自己牺牲了！啊，你们已不在人间了！好吧，你们想把人民从王权下拯救出来，但却把自己的女儿交给了保安警察。朋友们，注意，应当有同情心。女人，这些可怜的女人，大家经常习惯于为她们着想。我们对女子没受到和男子同等的教育感到心安理得，不让她们阅读，不让她们思考和关心政治，你们也禁止她们今晚到停尸所去辨认你们的尸体吗？好啦！那些有家室的人要发发善心，乖乖地来和我们握手，然后离开这里，让我们安心工作。我知道，离开这儿是要有勇气的，也是困难的，但越困难就越值得赞扬。有人说：‘我有一支枪，我是属于街垒的，活该，我不走。’活该，说得倒痛快。可是，朋友们，还有明天，明天你已不在世上了，你们的家庭可还在。有多少痛苦呀！你看，一个健壮可爱的孩子，面颊象苹果，一边笑一边咿咿呀呀学讲话，你吻他时感到他是多么娇嫩，你可知道他被遗弃后会怎么样？我见过一个，一点点大，只有这么高，他的父亲死了，几个穷苦人发慈悲把他收留下来，可是他们自己也经常吃不饱。小孩老是饿着。这是在冬天。他一声不哭。人们见他走到从没生过火的火炉旁，那烟筒，你知道，是涂上了黄粘土的。那孩子用小手指剥下一些泥来就吃。他的呼吸声沙哑，脸色苍白，双腿无力，肚子鼓胀。他什么话也不说。人家问他，他不回答。他死了。临死，人家把他送到纳凯救济院，我就是在那儿看到他的，当时我是救济院的住院医生。现在，如果你们中间有当父亲的，星期天就去幸福地散步，用壮健的手握着自己孩子的小手。请每个父亲想象一下，把这个孩子当作自己的孩子。这可怜的小娃娃，我还记得，好象就在眼前一样，当他赤身露体躺在解剖桌上时，皮下肋骨突出，好象墓地草丛下的坟穴。在这孩子的胃中我找到了泥土一类的东西。在牙缝中有灰渣。好吧，我们扪心自问，让良心指路吧！据统计，被遗弃的孩子的死亡率是百分之五十五。我再重复一遍，这是和妻子、女儿和孩子有关的问题。我不是说你们。大家都很清楚你们是什么人，天呀，谁都知道你们是勇士。谁都明白你们在为伟大事业牺牲自己的生命，心里感到快乐和光荣。谁都知道你们自己感到已被选定要去作有益而庄严的献身，要为胜利尽自己的一份力量。这是再好不过的，但你们不是单身汉，要想到其他的人，不要自私。”\\n\\n 大家沉郁地低下了头。\\n\\n 在最壮烈的时刻，人的内心会产生多么奇特的矛盾！公白飞这样讲，他自己也并不是孤儿。他想到别人的母亲，而忘了自己的。他准备牺牲自己。他是“自私的人”。\\n\\n 马吕斯忍着饥饿，心情狂热，接二连三地被一切希望所抛弃，他受到痛苦的折磨，这是最凄惨的折磨，他充满了激烈的感情，感到末日即将来临，于是逐渐陷入痴呆的幻境中，这是一种自愿牺牲者临终前常出现的状态。\\n\\n 一个生理学家可以在他身上去研究那种已为科学所了解、并也已归类的渐渐加剧的狂热呆痴症状，此症起于极端的痛苦，这和极乐时的快感相似，失望也会使人心醉神迷，马吕斯是属于这种情况的。他象局外人那样看待一切，正如我们所说，他面前发生的事对他是如此遥远，他能知道一些总的情况，但看不到细节。他在火焰中看到来来往往的人，他听到的说话声就好象来自深渊一样。\\n\\n 可是这件事却刺激了他。这一情景有点触及了他的心灵，使他惊醒过来。他唯一的心愿就是等死，他不愿改变主张，但是在凄凉的梦游状态中他也曾想过，他死并不妨碍他去拯救别人。\\n\\n 他提高嗓子说：\\n\\n “安灼拉和公白飞说得有理。不要作无谓的牺牲。我同意他们，要赶快。公白飞说了决定性的话。你们中间凡是有家属的、有母亲的、有姊妹的、有妻子的、有孩子的人就站出来。”\\n\\n 没有一个人动一动。\\n\\n 马吕斯又说：“已婚男子和有家庭负担的人站出来！”\\n\\n 他的威望很高，安灼拉虽是街垒的指挥官，但马吕斯是救命人。\\n\\n 安灼拉说：“我命令你们！”\\n\\n 马吕斯说：“我请求你们。”\\n\\n 于是，这些被公白飞的话所激动，被安灼拉的命令所动摇，被马吕斯的请求所感动的英雄，开始互相揭发。一个青年对一个中年人说：“是呀，你是一家之长，你走吧。”那个人回答：“是你，你有两个姊妹要抚养。”一场前所未闻的争辩展开了，就看谁不被人赶出墓门。\\n\\n 古费拉克说：“赶快，一刻钟之后就来不及了。”\\n\\n 安灼拉接着说：“公民们，这里是共和政体，实行普选制度。你们自己把应该离开的人推选出来吧。”\\n\\n 大家服从了，大约过了五分钟，一致指定的五个人从队里站了出来。\\n\\n 马吕斯叫道：“他们是五个人！”\\n\\n 一共只有四套制服。\\n\\n 五个人回答说：“好吧，得有一个人留下来。”\\n\\n 于是又开始了一场慷慨的争论。问题是谁留下来，每个人都说别人没有理由留下来。\\n\\n “你，你有一个热爱你的妻子。”“你，你有一个老母亲。”\\n\\n “你，你父母双亡，三个小兄弟怎么办？”“你，你是五个孩子的父亲。”“你，你只有十七岁，太年轻了，应该活下去。”\\n\\n 这些伟大的革命街垒是英雄们的聚会之所，不可思议的事在这里是极其普遍的，在他们之间甚至都不以为奇了。\\n\\n 古费拉克重复说：“快点！”\\n\\n 人群中有个人向马吕斯喊道：\\n\\n “由你指定吧，哪一个该留下。”\\n\\n 那五个人齐声说：“对，由你选定，我们服从。”\\n\\n 马吕斯不相信还有什么事能更使他感情冲动，但想到要选一个人去送死，他全身的血液都涌上了心头。他的面色本来已经煞白，不可能变得更苍白了。\\n\\n 他走向对他微笑的五个人，每个人的眼睛都冒着烈火，一如古代坚守塞莫皮莱的英维的目光，都向马吕斯喊道：\\n\\n “我！我！我！”\\n\\n 马吕斯呆呆地数了一下，确是五个人！然后他的视线移到下面四套制服上。\\n\\n 正在这时，第五套制服，好比从天而降，落在这四套上面。\\n\\n 那第五个人得救了。\\n\\n 马吕斯抬头认出是割风先生。\\n\\n 冉阿让刚走进街垒。\\n\\n 可能他已探明情况，或由于他的本能，也许是碰巧，他从蒙德都巷子来。幸亏他那身国民自卫军的制服，很顺利地就通过了。\\n\\n 起义军设在蒙德都街上的哨兵，不为一个国民自卫军发出警报信号。这哨兵让他进入街道时心里想：“这可能是个援军，大不了是个囚徒。”哨兵要是玩忽职守，这一时刻可是太严重了。\\n\\n 冉阿让走进棱堡，没有引起任何人的注意，这时大家的目光都集中在这选出的五个人和四套制服上。冉阿让也看到听到了一切，他不声不响地脱下自己的制服，把它扔在那堆制服上。\\n\\n 当时情绪的激动是无法描绘的。\\n\\n 博须埃开口问道：“他是什么人？”\\n\\n 公白飞回答：“是一个拯救众人的人。”\\n\\n 马吕斯用深沉的语气接着说：\\n\\n “我认识他。”\\n\\n 这种保证使大家放了心。\\n\\n 安灼拉转向冉阿让说：\\n\\n “公民，我们欢迎你。”\\n\\n 他又接着说：\\n\\n “你知道我们都将去死。”\\n\\n 冉阿让一言不发，帮助他救下的那个起义者穿上他的制服。\\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/75/4421.html","bookId":542,"book":{"id":542,"title":"Les Miserables悲惨世界","description":"简介： 故事发生在19世纪的法国，穷苦农民冉阿让因偷面包而入狱多年，终获假释却再次无视法律，不得不开始逃亡。被收留他的主教感化后，冉阿让决心洗心革面，开始新生活。十年后他成为成功的商人并当上市长，却一直受到铁面警官贾维尔锲而不舍地追捕。...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1288579064ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/75","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
