{"id":35882,"no":295,"title":"Part 5 Book 1 Chapter 16 How from a Brother One Becomes a Father","content":"At that same moment, in the garden of the Luxembourg,--for the gaze of the drama must be everywhere present,--two children were holding each other by the hand. One might have been seven years old, the other five. The rain having soaked them, they were walking along the paths on the sunny side; the elder was leading the younger; they were pale and ragged; they had the air of wild birds. The smaller of them said: \"I am very hungry.\" The elder, who was already somewhat of a protector, was leading his brother with his left hand and in his right he carried a small stick. They were alone in the garden. The garden was deserted, the gates had been closed by order of the police, on account of the insurrection. The troops who had been bivouacking there had departed for the exigencies of combat. How did those children come there? Perhaps they had escaped from some guard-house which stood ajar; perhaps there was in the vicinity, at the Barriered\u0027Enfer; or on the Esplanade del\u0027Observatoire, or in the neighboring careful, dominated by the pediment which could be read:Invenerunt parvulum pannis involutum, some mountebank\u0027s booth from which they had fled; perhaps they had, on the preceding evening, escaped the eye of the inspectors of the garden at the hour of closing, and had passed the night in some one of those sentry-boxes where people read the papers? The fact is, they were stray lambs and they seemed free. To be astray and to seem free is to be lost. These poor little creatures were, in fact, lost. These two children were the same over whom Gavroche had been put to some trouble, as the reader will recollect. Children of the Thenardiers,leased out to Magnon, attributed to M. Gillenormand, and now leaves fallen from all these rootless branches, and swept over the ground by the wind. Their clothing, which had been clean in Magnon\u0027s day, and which had served her as a prospectus with M. Gillenormand, had been converted into rags. Henceforth these beings belonged to the statistics as \"Abandoned children,\" whom the police take note of, collect, mislay and find again on the pavements of Paris. It required the disturbance of a day like that to account for these miserable little creatures being in that garden. If the superintendents had caught sight of them, they would have driven such rags forth. Poor little things do not enter public gardens; still, people should reflect that, as children, they have a right to flowers. These children were there, thanks to the locked gates. They were there contrary to the regulations. They had slipped into the garden and there they remained. Closed gates do not dismiss the inspectors, oversight is supposed to continue, but it grows slack and reposes; and the inspectors, moved by the public anxiety and more occupied with the outside than the inside, no longer glanced into the garden, and had not seen the two delinquents. It had rained the night before, and even a little in the morning. But in June, showers do not count for much. An hour after a storm, it can hardly be seen that the beautiful blonde day has wept. The earth, in summer, is as quickly dried as the cheek of a child. At that period of the solstice, the light of full noonday is, so to speak, poignant. It takes everything. It applies itself to the earth, and superposes itself with a sort of suction. One would say that the sun was thirsty. A shower is but a glass of water; a rainstorm is instantly drunk up. In the morning everything was dripping, in the afternoon everything is powdered over. Nothing is so worthy of admiration as foliage washed by the rain and wiped by the rays of sunlight; it is warm freshness. The gardens and meadows, having water at their roots, and sun in their flowers, become perfuming-pans of incense, and smoke with all their odors at once. Everything smiles, sings and offers itself. One feels gently intoxicated. The springtime is a provisional paradise, the sun helps man to have patience. There are beings who demand nothing further; mortals, who, having the azure of heaven, say: \"It is enough!\" dreamers absorbed in the wonderful, dipping into the idolatry of nature, indifferent to good and evil, contemplators of cosmos and radiantly forgetful of man, who do not understand how people can occupy themselves with the hunger of these, and the thirst of those, with the nudity of the poor in winter, with the lymphatic curvature of the little spinal column, with the pallet, the attic, the dungeon, and the rags of shivering young girls, when they can dream beneath the trees; peaceful and terrible spirits they, and pitilessly satisfied. Strange to say, the infinite suffices them. That great need of man, the finite, which admits of embrace, they ignore. The finite which admits of progress and sublime toil, they do not think about. The indefinite, which is born from the human and divine combination of the infinite and the finite, escapes them. Provided that they are face to face with immensity, they smile. Joy never, ecstasy forever. Their life lies in surrendering their personality in contemplation. The history of humanity is for them only a detailed plan. All is not there; the true All remains without; what is the use of busying oneself over that detail, man? Man suffers, that is quite possible; but look at Aldebaran rising! The mother has no more milk, the new-born babe is dying. I know nothing about that, but just look at this wonderful rosette which a slice of wood-cells of the pine presents under the microscope! Compare the most beautiful Mechlin lace to that if you can! These thinkers forget to love. The zodiac thrives with them to such a point that it prevents their seeing the weeping child. God eclipses their souls. This is a family of minds which are, at once, great and petty. Horace was one of them; so was Goethe. La Fontaine perhaps; magnificent egoists of the infinite, tranquil spectators of sorrow, who do not behold Nero if the weather be fair, for whom the sun conceals the funeral pile, who would look on at an execution by the guillotine in the search for an effect of light, who hear neither the cry nor the sob, nor the death rattle, nor the alarm peal, for whom everything is well, since there is a month of May, who, so long as there are clouds of purple and gold above their heads, declare themselves content, and who are determined to be happy until the radiance of the stars and the songs of the birds are exhausted. These are dark radiances. They have no suspicion that they are to be pitied. Certainly they are so. He who does not weep does not see. They are to be admired and pitied, as one would both pity and admire a being at once night and day, without eyes beneath his lashes but with a star on his brow. The indifference of these thinkers, is, according to some, a superior philosophy. That may be; but in this superiority there is some infirmity. One may be immortal and yet limp: witness Vulcan. One may be more than man and less than man. There is incomplete immensity in nature. Who knows whether the sun is not a blind man? But then, what? In whom can we trust? Solem quis dicere falsum audeat? Who shall dare to say that the sun is false? Thus certain geniuses, themselves, certain Very-Lofty mortals, man-stars, may be mistaken? That which is on high at the summit, at the crest, at the zenith, that which sends down so much light on the earth, sees but little, sees badly, sees not at all? Is not this a desperate state of things? No. But what is there, then, above the sun? The god. On the 6th of June, 1832, about eleven o\u0027clock in the morning, the Luxembourg, solitary and depopulated, was charming. The quincunxes and flower-beds shed forth balm and dazzling beauty into the sunlight. The branches, wild with the brilliant glow of midday, seemed endeavoring to embrace. In the sycamores there was an uproar of linnets, sparrows triumphed, woodpeckers climbed along the chestnut trees, administering little pecks on the bark. The flower-beds accepted the legitimate royalty of the lilies; the most august of perfumes is that which emanates from whiteness. The peppery odor of the carnations was perceptible. The old crows of Marie de Medici were amorous in the tall trees. The sun gilded, empurpled, set fire to and lighted up the tulips, which are nothing but all the varieties of flame made into flowers. All around the banks of tulips the bees, the sparks of these flame-flowers, hummed. All was grace and gayety, even the impending rain; this relapse, by which the lilies of the valley and the honeysuckles were destined to profit, had nothing disturbing about it; the swallows indulged in the charming threat of flying low. He who was there aspired to happiness; life smelled good; all nature exhaled candor, help, assistance, paternity, caress, dawn. The thoughts which fell from heaven were as sweet as the tiny hand of a baby when one kisses it. The statues under the trees, white and nude, had robes of shadow pierced with light; these goddesses were all tattered with sunlight; rays hung from them on all sides. Around the great fountain, the earth was already dried up to the point of being burnt. There was sufficient breeze to raise little insurrections of dust here and there. A few yellow leaves, left over from the autumn, chased each other merrily, and seemed to be playing tricks on each other. This abundance of light had something indescribably reassuring about it. Life, sap, heat, odors overflowed; one was conscious, beneath creation, of the enormous size of the source; in all these breaths permeated with love, in this interchange of reverberations and reflections, in this marvellous expenditure of rays, in this infinite outpouring of liquid gold, one felt the prodigality of the inexhaustible; and, behind this splendor as behind a curtain of flame, one caught a glimpse of God, that millionaire of stars. Thanks to the sand, there was not a speck of mud; thanks to the rain, there was not a grain of ashes. The clumps of blossoms had just been bathed; every sort of velvet, satin, gold and varnish, which springs from the earth in the form of flowers, was irreproachable. This magnificence was cleanly. The grand silence of happy nature filled the garden. A celestial silence that is compatible with a thousand sorts of music, the cooing of nests, the buzzing of swarms, the flutterings of the breeze. All the harmony of the season was complete in one gracious whole; the entrances and exits of spring took place in proper order; the lilacs ended; the jasmines began; some flowers were tardy, some insects in advance of their time; the van-guard of the red June butterflies fraternized with the rear-guard of the white butterflies of May. The plantain trees were getting their new skins. The breeze hollowed out undulations in the magnificent enormity of the chestnut-trees. It was splendid. A veteran from the neighboring barracks, who was gazing through the fence, said: \"Here is the Spring presenting arms and in full uniform.\" All nature was breakfasting; creation was at table; this was its hour; the great blue cloth was spread in the sky, and the great green cloth on earth; the sun lighted it all up brilliantly. God was serving the universal repast. Each creature had his pasture or his mess. The ring-dove found his hemp-seed, the chaffinch found his millet, the goldfinch found chickweed, the red-breast found worms, the green finch found flies, the fly found infusoriae, the bee found flowers. They ate each other somewhat, it is true, which is the misery of evil mixed with good; but not a beast of them all had an empty stomach. The two little abandoned creatures had arrived in the vicinity of the grand fountain, and, rather bewildered by all this light, they tried to hide themselves, the instinct of the poor and the weak in the presence of even impersonal magnificence; and they kept behind the swans\u0027 hutch. Here and there, at intervals, when the wind blew, shouts, clamor, a sort of tumultuous death rattle, which was the firing, and dull blows, which were discharges of cannon, struck the ear confusedly. Smoke hung over the roofs in the direction of the Halles. A bell, which had the air of an appeal, was ringing in the distance. These children did not appear to notice these noises. The little one repeated from time to time: \"I am hungry.\" Almost at the same instant with the children, another couple approached the great basin. They consisted of a goodman, about fifty years of age, who was leading by the hand a little fellow of six. No doubt, a father and his son. The little man of six had a big brioche. At that epoch, certain houses abutting on the river, in the Rues Madame and d\u0027Enfer, had keys to the Luxembourg garden, of which the lodgers enjoyed the use when the gates were shut, a privilege which was suppressed later on. This father and son came from one of these houses, no doubt. The two poor little creatures watched \"that gentleman\" approaching, and hid themselves a little more thoroughly. He was a bourgeois. The same person, perhaps, whom Marius had one day heard, through his love fever, near the same grand basin, counselling his son \"to avoid excesses.\" He had an affable and haughty air, and a mouth which was always smiling, since it did not shut. This mechanical smile, produced by too much jaw and too little skin, shows the teeth rather than the soul. The child, with his brioche, which he had bitten into but had not finished eating, seemed satiated. The child was dressed as a National Guardsman, owing to the insurrection, and the father had remained clad as a bourgeois out of prudence. Father and son halted near the fountain where two swans were sporting. This bourgeois appeared to cherish a special admiration for the swans. He resembled them in this sense,that he walked like them. For the moment, the swans were swimming, which is their principal talent, and they were superb. If the two poor little beings had listened and if they had been of an age to understand, they might have gathered the words of this grave man. The father was saying to his son: \"The sage lives content with little. Look at me, my son. I do not love pomp. I am never seen in clothes decked with gold lace and stones; I leave that false splendor to badly organized souls.\" Here the deep shouts which proceeded from the direction of the Halles burst out with fresh force of bell and uproar. \"What is that?\" inquired the child. The father replied: \"It is the Saturnalia.\" All at once, he caught sight of the two little ragged boys behind the green swan-hutch. \"There is the beginning,\" said he. And, after a pause, he added: \"Anarchy is entering this garden.\" In the meanwhile, his son took a bite of his brioche, spit it out, and, suddenly burst out crying. \"What are you crying about?\" demanded his father. \"I am not hungry any more,\" said the child. The father\u0027s smile became more accentuated. \"One does not need to be hungry in order to eat a cake.\" \"My cake tires me. It is stale.\" \"Don\u0027t you want any more of it?\" \"No.\" The father pointed to the swans. \"Throw it to those palmipeds.\" The child hesitated. A person may not want any more of his cake; but that is no reason for giving it away. The father went on: \"Be humane. You must have compassion on animals.\" And, taking the cake from his son, he flung it into the basin. The cake fell very near the edge. The swans were far away, in the centre of the basin, and busy with some prey. They had seen neither the bourgeois nor the brioche. The bourgeois, feeling that the cake was in danger of being wasted, and moved by this useless shipwreck, entered upon a telegraphic agitation, which finally attracted the attention of the swans. They perceived something floating, steered for the edge like ships, as they are, and slowly directed their course toward the brioche, with the stupid majesty which befits white creatures. \"The swans [cygnes] understand signs [signes],\" said the bourgeois, delighted to make a jest. At that moment, the distant tumult of the city underwent another sudden increase. This time it was sinister. There are some gusts of wind which speak more distinctly than others. The one which was blowing at that moment brought clearly defined drum-beats, clamors, platoon firing, and the dismal replies of the tocsin and the cannon. This coincided with a black cloud which suddenly veiled the sun. The swans had not yet reached the brioche. \"Let us return home,\" said the father, \"they are attacking the Tuileries.\" He grasped his son\u0027s hand again. Then he continued: \"From the Tuileries to the Luxembourg, there is but the distance which separates Royalty from the peerage; that is not far. Shots will soon rain down.\" He glanced at the cloud. \"Perhaps it is rain itself that is about to shower down; the sky is joining in; the younger branch is condemned. Let us return home quickly.\" \"I should like to see the swans eat the brioche,\" said the child. The father replied: \"That would be imprudent.\" And he led his little bourgeois away. The son, regretting the swans, turned his head back toward the basin until a corner of the quincunxes concealed it from him. In the meanwhile, the two little waifs had approached the brioche at the same time as the swans. It was floating on the water. The smaller of them stared at the cake, the elder gazed after the retreating bourgeois. Father and son entered the labyrinth of walks which leads to the grand flight of steps near the clump of trees on the side of the Rue Madame. As soon as they had disappeared from view, the elder child hastily flung himself flat on his stomach on the rounding curb of the basin, and clinging to it with his left hand, and leaning over the water, on the verge of falling in, he stretched out his right hand with his stick towards the cake. The swans, perceiving the enemy, made haste, and in so doing, they produced an effect of their breasts which was of service to the little fisher; the water flowed back before the swans, and one of these gentle concentric undulations softly floated the brioche towards the child\u0027s wand. Just as the swans came up, the stick touched the cake. The child gave it a brisk rap, drew in the brioche, frightened away the swans, seized the cake, and sprang to his feet. The cake was wet; but they were hungry and thirsty. The elder broke the cake into two portions, a large one and a small one, took the small one for himself, gave the large one to his brother, and said to him: \"Ram that into your muzzle.\" 只有他们两人在花园里，花园空无一人，铁栅栏门在起义期间根据警方的命令关闭了。里面宿营的部队已离开迎战去了。 孩子们怎么会在这里的？这可能是从半掩着门的收容所里逃出来的；也许是从附近，从唐斐便门，或天文台的了望台上，或从邻近的十字路口，那儿有一个居高临下的三角门楣的装饰，上面写着“今拾到一个布裹的婴儿”①，从那里的卖艺的木棚里逃出来的；也可能是头天晚上关门时，他们躲过了看门人的目光，在阅报亭里度过了一宵？事实是他们在流浪，然而又好象很自由。流浪而好象很自由就是无家可归。这两个可怜的孩子确实已没有归宿了。 ①原文为拉丁文Invenerunt　parvulum　pannis　involutum。 读者应该还记得，这就是使伽弗洛什担忧的两个孩子，德纳第的孩子，曾借给马侬当作吉诺曼先生的孩子，如今已象无根的断枝上掉下来的落叶，被风卷着遍地乱滚。 他们的衣服，在马侬家时是整洁的，那时对吉诺曼先生要交代得过去，现在已经破烂不堪了。 这些孩子从此便列入“弃儿”统计表内，由警方查明，收容，走失，又在巴黎马路上找到了。 还得碰上今天这样混乱的时期，可怜的孩子才能来到公园。如果看门人发现了他们，一定要撵走这些小化子。因为穷苦的孩子是不能进入公园的。其实人们应该想到，作为孩子，他们有权利欣赏鲜花。 幸亏关了铁门，他俩才能待在里面。他们违犯了规章，溜进了公园，他们就在里面待下来。铁门虽关却不允许检查人员休息，检查人员仍被认为在继续进行检查，但执行得懈怠而不严格；他们同样受到民众不安的影响，关心园外远胜园内，他们不再检查花园，因而没有看见这两个犯有轻罪的小孩。 昨晚下了雨，今晨还飘了雨点。但六月的骤雨不算一回事。暴雨过后一小时，人们很难察觉这美丽的艳阳天曾经流过泪。夏天地面很快被晒干，就象孩子的面颊一样。 在这夏至时节，白天的太阳可以说是火辣辣的，它控制了一切。它紧贴着伏在大地上，好象在吮吸似的。太阳好象渴了，骤雨等于一杯水，一阵雨立刻被喝尽。清晨处处溪流纵横，中午却已扬起了灰尘。 没有再比雨水打湿、阳光拭干的芳草更宜人的了，这是夏日的清新气息。花园和草地，根上有雨露，花上有阳光，同时成为散发出各种氤氲的香炉。一切在欢笑，歌唱，都在献出各自的芬芳，这使人感到一种甜蜜的陶醉。春天是暂时的天堂，阳光使人变得坚韧有力。 有些人不再苛求，他们只要有蔚蓝的天空就说：“这样足够了！”他们沉湎在神奇的幻想中，对大自然的崇拜使他们在善与恶面前漠然处之，他们对宇宙沉思默想，而对人则出奇地心不在焉，他们不明白，当人可以在树林中遐想自娱时，为什么还要为这些饥饿的人，那些干渴的人，要为冬天衣不蔽体的穷人，要为因淋巴而背脊弯曲的孩子，要为陋榻、阁楼、地牢以及在破衣烂衫中哆嗦的姑娘们操心；这些安谧和不近人情的心灵，毫无怜悯心的自得其乐。奇怪的是，他们满足于无限的太空。而人的重大需求，那包含博爱的有限事物，他们却并不理解。为有限所承认的进步，这一高贵的辛劳，他们不去想一想。而这一不定限，是在无限和有限方面人与天的结合而产生的，他们也同样体会不到。只要能与无极相对，他们就微笑。他们从不感到欢乐，但经常心醉神迷。自甘沉溺其中，这就是他们的生活。人类的历史在他们看来只是断篇残简，完整并不在此，真正的万有在外界，何必为人的这类琐事操心？人有痛苦，这很可能，但请看这颗红星①升起了！母亲没有奶水，新生儿濒于死亡，我一点也不知道，但请你察看一下显微镜下枞树的截断面所形成的奇妙的圆花形！你把最美丽的精致花边拿来比比看！这些思想家忘记了爱。黄道带竟使他们专心到看不见孩子在哭泣。上帝使他们见不到灵魂。这是某种思想家的类型，既伟大又渺小。贺拉斯是如此，歌德是如此，拉封丹可能也是如此；对待无限堂堂一表的利己主义，对疾苦无动于衷的旁观者，天气晴朗就看不见尼禄，太阳可以为他们遮住火刑台，望着断头台行刑时还在寻找光线的效果，他们听不见叫喊、啜泣、断气的喘息声，也听不见警钟，对他们来说，只要存在五月，一切都是尽善尽美的，只要头上有金黄和绛紫色的云彩，他们就感到心满意足，并决心享乐直至星光消逝，鸟儿不再啭鸣为止。 ①红星（Aldebaran），金牛座中最亮的一颗星。 他们是光辉灿烂中的黑暗。他们并没猜想到自己是可怜虫。无疑地他们就是如此。谁没有同情之泪也就是一无所见。我们应当赞美并怜悯他们，正如我们既怜悯又赞美一个同时是黑夜又是白昼的人，在他们的眉毛下面没有眼睛，只有一颗星星在额上。 思想家的冷酷，照某些人看来，这才是一种精深的哲学。就算这样，但在这种精深中有着欠缺的一面。一个人可以是不朽的，然而又是跛子，伏尔甘①就是一个明证。人可以高人一筹，也有低人一等的地方。大自然中存在着无穷尽的不完整的现象，谁知道太阳是否盲目呢？ ①伏尔甘（Vulcain），希腊神话中的跛足火神。 那怎么办？信赖谁呢？谁敢说太阳虚假呢？①某些天才，某些杰出的人，那些星官们也会失误？那个在上空，在顶端，在最高峰，在天顶上的东西，它送给大地无穷光明，但它看见的很少，看不清或完全看不见？这难道不令人感到沮丧？不对。在太阳之上究竟还有什么？有上帝。 一八三二年六月六日上午十一时左右，卢森堡公园杳无人迹，景色迷人。排成梅花形的树木和花坛在阳光下发出芬芳的气息和夺目的色彩。所有的树枝在正午的烈日下似乎都在狂喜地相互拥抱。埃及无花果树丛中莺群一片啁啾，麻雀在唱凯歌，啄木鸟爬土板栗树用嘴在树皮的窟窿里啄着。花坛接受了百合花的合法王位；最尊贵的馨香出自洁白的颜色。石竹花的芬芳弥漫在空间，玛丽·德·梅迪契的老白嘴鸦在大树林中谈情说爱。阳光在郁金香上飞金贴紫，使它们发出火光，这简直就是一朵五光十色的火焰。蜜蜂在所有的郁金香花坛四周忙乱地转圈，就象火花上的火星，连同即将到来的阵雨，一切都是艳丽的，喜气洋溢的；这一再滋润的雨水，铃兰和金银花正可受益而无须担惊受怕！燕子低飞显示了一种可爱的威胁②，这里万物都浸沉在幸福里，生命是何等的美好，整个自然界处于真诚、救助、支援、父爱、温存和曙光中。从天而降的思想就象我们吻着孩子的小手那样温柔。 ①“谁敢说太阳虚假呢？”原文为拉丁文，语出维吉尔之《农事诗》“Solem　quisdicere　falsum　audeat？” ②燕子低飞，表示即将下雨，这是种威胁，但由于它飞翔姿态优美，故仍觉得可爱。 树木下的石像，洁白而裸露，透过阳光的照射，树荫给它们穿上了一件衣衫；这些女神身上光线明暗不一，而四周全是光线。大水池周围，地干得象是烤焦了一样。常常刮风使得到处都是尘土。晚秋的几片黄叶在欢快地相互追逐，就象野孩子在嬉戏一样。 到处一片光明使人感到一种无可形容的慰藉。生命、树液、暑热和香气都在涌溢；从宇宙万象中我们体会到那种巨大的源泉；在这充满了爱的微风中，在这往复的反响和反射中，在这肆意挥霍的阳光中，在这无限倾泻的金色流体中，使我们感到是取之不尽、用之不竭的；在这瑰丽似火的帷幕后面，我们瞥见了主宰亿万星辰的上帝。 多谢细沙，这里没有一点泥迹，幸亏雨露，这里没有一粒灰尘。花束洗涤一净；所有幻成花形从地下冒出来的丝绒、绫缎、彩釉和黄金都毫无瑕疵。这种华丽是完美无缺的。园林浸沉在一片欢悦的大自然的静谧里。一种天上才有的幽静与千万种音乐融洽共存，鸟巢中的咕咕声，蜂群的嗡嗡声和风的飒飒声。这个季节所有的音响和谐地合成一个完美的协奏；春季的物候井然有序，丁香凋谢了，茉莉迎上来；有些花要迟开，有些昆虫却来得很早；六月红蝶的先锋队和五月白蝶的后卫队亲如兄弟。梧桐换上新装。和风使高大华美的栗树丛此起彼伏，气势雄伟。附近兵营的一个老兵在铁栅栏门外望着说：“这是一个披坚执锐全副戎装的春天。” 整个自然界在进餐，万物已经就席。到时间了。大幅的蓝帷幕张挂在天上，宽阔的绿桌布铺陈在地下，阳光灿烂。上帝供全世界就餐。每种生物都有自己的饲料或糕点。野鸽找到了大麻子，燕雀找到了小米，金翅鸟找到了繁缕，知更鸟找到了蛆虫，蜜蜂找到了花朵，苍绳找到了纤毛虫，翠鸟找到了苍蝇。它们之间多少存在着相互吞噬的现象，是善和恶神秘的混合，但它们没有一个是空着肚子的。 两个被遗弃的孩子来到大池旁，阳光使他们有点昏昏沉沉，他们设法躲藏，这是穷人和弱者在豪华面前的本能畏缩，尽管不是在人前；于是他们躲在天鹅棚后面。 这儿那儿，在顺风时，可以断断续续模糊地听见叫喊声、嘈杂声和一种喧闹的嗒嗒声，这就是机枪在响，还有低沉的击拍声，这就是在开炮。菜市场那边的屋顶上冒着烟。一个类似召唤的钟声在远处回响。 这两个孩子似乎听不见这些响声。小的那个不时轻声说： “我肚子饿。” 几乎和这两个孩子同时，另外一对也走近了大水池；一个五十岁光景的老人牵着一个六岁的小娃娃，这大概是父子俩。 六岁的小孩手里拿着一块大蛋糕。 在这一时期，在夫人街和唐斐街上有一些沿河的房屋，配备了卢森堡公园的钥匙，当公园的铁栅栏关闭时，房客们可以用它进入园中。后来这种特许取消了。父子俩大概是从一幢这样的房子里出来的。 两个穷孩子望见“绅士”走来，便藏得更隐蔽一些。 这是个有产者。也许就是马吕斯在热恋时期碰到的那个人。他曾听到他在这大池旁教训儿子“凡事不能过分”。他的态度和蔼而高傲，有一张合不拢的嘴，老在笑。这机械的笑容出自牙床大，包不住，露出的是牙齿而不是心灵。孩子拿着咬剩的蛋糕，好象已经吃撑了。由于处于动乱时期，孩子穿一身国民自卫军的服装；而父亲仍是有产者的打扮，而这是为了谨慎。 父子俩停在两只天鹅戏水的大池旁，这个有产者似乎特别欣赏天鹅，他在走路方面和它们也很相象。 这时天鹅正在游泳，这是它们的专长，游的姿态很优美。 如果这两个可怜的孩子注意听了，并也已到了懂事的年龄，他们就会听见一个道貌岸然的人所说的话。父亲对儿子说： “贤者活着满足于无所求。看着我，我的儿子，我不爱奢华。从来不会有人见到我穿着缀有金片或宝石的衣服，我把这些假的光彩让给那些头脑有缺陷的人。” 此刻来自菜市场方面的沉闷的呼叫声、钟声和嘈杂的声音同时加剧起来。 “这是什么？”孩子问。 父亲回答： “这是庆丰收的土神节。” 忽然间，他发现了这两个衣衫褴褛的孩子，一动不动地站在天鹅的绿色小屋后面。 “这正是开始。”他说。 停了一会儿，他加上一句： “无政府状态进入了公园。” 这时儿子咬了口蛋糕，又吐出来，忽然哭了起来。 “你哭什么？”父亲问。 “我不饿。”孩子说。 父亲的笑容更为明显了： “点心不是非等饿了才吃。” “我讨厌这块糕点，它不新鲜。” “你不要了？” “不要了。” 父亲向他指指天鹅。 “丢给这些有蹼的鸟吧！” 孩子犹豫不决。他不要糕点，但没有理由要把它送掉。 父亲继续说： “要仁慈，对动物应当有同情心。” 于是他从儿子那儿拿过糕点，丢进水池。蛋糕掉在离岸很近的水里。 天鹅在距离较远的池中心忙着吃捕获的东西。它们既没有看见这个有产者，也没有看见蛋糕。 这个有产者感到糕点有白丢的危险，对无谓的损失感到痛心，就设法现出一种焦急的样子，结果引起了天鹅的注意。 它们看见水面上漂浮着一样什么东西，于是就象帆船似的转舵慢慢地游向蛋糕，不失这种白色珍禽应有的高贵气派。 “天鹅领会这些手势①。”这个有产者说，为自己的俏皮话得意洋洋。 ①在法语中“天鹅”（cygne）与手势（signe）同音，故也可理解为“天鹅理解天鹅”。 这时城中的骚乱忽又增强起来，变得更为凄厉。几阵风吹来，要比别的更能说明情况。现在可以听到清晰的战鼓声、叫嚣声、小分队的枪声，沉郁的警钟和炮声在相互呼应。这时一团乌云忽然遮住了太阳。 天鹅还没有游到蛋糕那儿。 “回去吧，”父亲说，“他们在进攻杜伊勒里宫。”他抓住儿子的手，又说： “从杜伊勒里宫到卢森堡，只有王位到爵位的距离，这不算远。枪声将如骤雨。” 他望望乌云。 “可能雨也要下了，天也加了进来，王朝的旁支①完了。快回家吧！” ①指路易－菲力浦。 “我要看天鹅吃蛋糕。”孩子说。 父亲回答： “这太冒失了。” 于是他把小有产者带走了。 孩子舍不得天鹅，不住地向大池回头望，直到梅花形排列的树木在拐角处遮住了他的视线为止。 与天鹅同时，这时两个小流浪者也走近了蛋糕。糕点浮在水面上，小的那个眼睁睁地望着，另一个望着走开的有产者。 父亲和儿子走上了蜿蜒的小路，这条路通往夫人街那边树丛密集的宽大的梯级那里。 当不再看到他们时，大孩子立刻趴在水池的圆边上，左手抓住边缘，俯在水上，几乎要掉下去，他用另一只手伸出棍子挨近蛋糕。天鹅看见对手，动作就加快了，它们的前胸迅速移动，产生了对小渔夫有利的效果，水在天鹅前面向后流，一圈荡漾着的波纹把糕点推向孩子的棍棒。天鹅刚游到，棍子也正好碰到蛋糕。孩子用一个快速动作来拨蛋糕，他吓走了天鹅，抓住蛋糕后就站起来。蛋糕浸湿了，但他们又饥又渴。大孩子把糕一分为二，一大一小，自己拿小的，把大的那一半给了弟弟，并对他说： “拿去填肚子吧。”","sourceLink":"http://novel.tingroom.com/jingdian/75/4432.html","bookId":542,"book":{"id":542,"title":"Les Miserables悲惨世界","description":"简介： 故事发生在19世纪的法国，穷苦农民冉阿让因偷面包而入狱多年，终获假释却再次无视法律，不得不开始逃亡。被收留他的主教感化后，冉阿让决心洗心革面，开始新生活。十年后他成为成功的商人并当上市长，却一直受到铁面警官贾维尔锲而不舍地追捕。...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1288579064ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/75","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
