{"id":35887,"no":300,"title":"Part 5 Book 1 Chapter 21 The Heroes","content":"All at once, the drum beat the charge. The attack was a hurricane. On the evening before, in the darkness,the barricade had been approached silently, as by a boa. Now, in broad daylight, in that widening street, surprise was decidedly impossible, rude force had, moreover, been unmasked, the cannon had begun the roar, the army hurled itself on the barricade. Fury now became skill. A powerful detachment of infantry of the line, broken at regular intervals, by the National Guard and the Municipal Guard on foot, and supported by serried masses which could be heard though not seen, debauched into the street at a run, with drums beating, trumpets braying, bayonets levelled, the sappers at their head, and, imperturbable under the projectiles, charged straight for the barricade with the weight of a brazen beam against a wall. The wall held firm. The insurgents fired impetuously. The barricade once scaled had a mane of lightning flashes. The assault was so furious, that for one moment, it was inundated with assailants; but it shook off the soldiers as the lion shakes off the dogs, and it was only covered with besiegers as the cliff is covered with foam, to re-appear, a moment later, beetling, black and formidable. The column, forced to retreat, remained massed in the street, unprotected but terrible, and replied to the redoubt with a terrible discharge of musketry. Any one who has seen fireworks will recall the sheaf formed of interlacing lightnings which is called a bouquet. Let the reader picture to himself this bouquet, no longer vertical but horizontal, bearing a bullet, buck-shot or a biscaien at the tip of each one of its jets of flame, and picking off dead men one after another from its clusters of lightning. The barricade was underneath it. On both sides, the resolution was equal. The bravery exhibited there was almost barbarous and was complicated with a sort of heroic ferocity which began by the sacrifice of self. This was the epoch when a National Guardsman fought like a Zouave. The troop wished to make an end of it, insurrection was desirous of fighting. The acceptance of the death agony in the flower of youth and in the flush of health turns intrepidity into frenzy. In this fray, each one underwent the broadening growth of the death hour. The street was strewn with corpses. The barricade had Enjolras at one of its extremities and Marius at the other. Enjolras, who carried the whole barricade in his head, reserved and sheltered himself; three soldiers fell, one after the other, under his embrasure, without having even seen him; Marius fought unprotected. He made himself a target. He stood with more than half his body above the breastworks. There is no more violent prodigal than the avaricious man who takes the bit in his teeth; there is no man more terrible in action than a dreamer. Marius was formidable and pensive. In battle he was as in a dream. One would have pronounced him a phantom engaged in firing a gun. The insurgents\u0027 cartridges were giving out; but not their sarcasms. In this whirlwind of the sepulchre in which they stood, they laughed. Courfeyrac was bare-headed. \"What have you done with your hat?\" Bossuet asked him. Courfeyrac replied: \"They have finally taken it away from me with cannon-balls.\" Or they uttered haughty comments. \"Can any one understand,\" exclaimed Feuilly bitterly, \"those men,--[and he cited names, well-known names, even celebrated names, some belonging to the old army]--who had promised to join us, and taken an oath to aid us, and who had pledged their honor to it, and who are our generals, and who abandon us!\" And Combeferre restricted himself to replying with a grave smile. \"There are people who observe the rules of honor as one observes the stars, from a great distance.\" The interior of the barricade was so strewn with torn cartridges that one would have said that there had been a snowstorm. The assailants had numbers in their favor; the insurgents had position. They were at the top of a wall, and they thundered point-blank upon the soldiers tripping over the dead and wounded and entangled in the escarpment. This barricade, constructed as it was and admirably buttressed, was really one of those situations where a handful of men hold a legion in check. Nevertheless, the attacking column, constantly recruited and enlarged under the shower of bullets,drew inexorably nearer, and now, little by little, step by step, but surely, the army closed in around the barricade as the vice grasps the wine-press. One assault followed another. The horror of the situation kept increasing. Then there burst forth on that heap of paving-stones, in that Rue de la Chanvrerie, a battle worthy of a wall of Troy. These haggard, ragged, exhausted men, who had had nothing to eat for four and twenty hours, who had not slept, who had but a few more rounds to fire, who were fumbling in their pockets which had been emptied of cartridges, nearly all of whom were wounded, with head or arm bandaged with black and blood-stained linen, with holes in their clothes from which the blood trickled, and who were hardly armed with poor guns and notched swords, became Titans. The barricade was ten times attacked, approached, assailed, scaled, and never captured. In order to form an idea of this struggle, it is necessary to imagine fire set to a throng of terrible courages, and then to gaze at the conflagration. It was not a combat, it was the interior of a furnace; there mouths breathed the flame; there countenances were extraordinary. The human form seemed impossible there, the combatants flamed forth there, and it was formidable to behold the going and coming in that red glow of those salamanders of the fray. The successive and simultaneous scenes of this grand slaughter we renounce all attempts at depicting. The epic alone has the right to fill twelve thousand verses with a battle. One would have pronounced this that hell of Brahmanism, the most redoubtable of the seventeen abysses, which the Veda calls the Forest of Swords. They fought hand to hand, foot to foot, with pistol shots, with blows of the sword, with their fists, at a distance, close at hand, from above, from below, from everywhere, from the roofs of the houses, from the windows of the wine-shop, from the cellar windows, whither some had crawled. They were one against sixty. The facade of Corinthe, half demolished, was hideous. The window, tattooed with grape-shot, had lost glass and frame and was nothing now but a shapeless hole, tumultuously blocked with paving-stones. Bossuet was killed; Feuilly was killed; Courfeyrac was killed; Combeferre, transfixed by three blows from a bayonet in the breast at the moment when he was lifting up a wounded soldier, had only time to cast a glance to heaven when he expired. Marius, still fighting, was so riddled with wounds, particularly in the head, that his countenance disappeared beneath the blood, and one would have said that his face was covered with a red kerchief. Enjolras alone was not struck. When he had no longer any weapon, he reached out his hands to right and left and an insurgent thrust some arm or other into his fist. All he had left was the stumps of four swords; one more than Francois I. at Marignan. Homer says: \"Diomedes cuts the throat of Axylus, son of Teuthranis, who dwelt in happy Arisba; Euryalus, son of Mecistaeus, exterminates Dresos and Opheltios, Esepius, and that Pedasus whom the naiad Abarbarea bore to the blameless Bucolion; Ulysses overthrows Pidytes of Percosius; Antilochus, Ablerus; Polypaetes, Astyalus; Polydamas, Otos, of Cyllene; and Teucer, Aretaon. Meganthios dies under the blows of Euripylus\u0027 pike. Agamemnon, king of the heroes, flings to earth Elatos, born in the rocky city which is laved by the sounding river Satnois.\" In our old poems of exploits, Esplandian attacks the giant marquis Swantibore with a cobbler\u0027s shoulder-stick of fire, and the latter defends himself by stoning the hero with towers which he plucks up by the roots. Our ancient mural frescoes show us the two Dukes of Bretagne and Bourbon, armed, emblazoned and crested in war-like guise, on horseback and approaching each other, their battle-axes in hand, masked with iron, gloved with iron, booted with iron, the one caparisoned in ermine, the other draped in azure: Bretagne with his lion between the two horns of his crown, Bourbon helmeted with a monster fleur de lys on his visor. But, in order to be superb, it is not necessary to wear, like Yvon, the ducal morion, to have in the fist, like Esplandian, a living flame, or, like Phyles, father of Polydamas, to have brought back from Ephyra a good suit of mail, a present from the king of men, Euphetes; it suffices to give one\u0027s life for a conviction or a loyalty. This ingenuous little soldier, yesterday a peasant of Bauce or Limousin, who prowls with his clasp-knife by his side, around the children\u0027s nurses in the Luxembourg garden, this pale young student bent over a piece of anatomy or a book, a blond youth who shaves his beard with scissors,--take both of them, breathe upon them with a breath of duty, place them face to face in the Carrefour Boucherat or in the blind alley Planche-Mibray, and let the one fight for his flag, and the other for his ideal, and let both of them imagine that they are fighting for their country; the struggle will be colossal; and the shadow which this raw recruit and this sawbones in conflict will produce in that grand epic field where humanity is striving, will equal the shadow cast by Megaryon, King of Lycia, tiger-filled, crushing in his embrace the immense body of Ajax, equal to the gods. 飓风式的猛攻。昨夜在黑暗中，街垒好象被一条蟒蛇悄悄地靠近了。现在大白天，在敞开的大街上，奇袭肯定是不可能的；此外，强大的兵力已经暴露。大炮已开始狂吼，军队向街垒猛冲。狂怒现在成为巧妙的技能。一支强大的步兵呈战列纵队，在相当的距离内，平均地安插在国民自卫军和保安警察队之间，并有无数听得到看不见的人作后盾，向大街跑步冲来，他们擂起战鼓，吹着军号，刺刀平端，工兵开路，在枪林弹雨中沉着前进，直抵街垒，象根铜柱那样把重量压在一堵墙上。 这堵墙顶住了。 起义者激烈地开火。街垒出现了人在上面竞相攀登的场面，它有着一簇象鬃毛样披散的火光。攻打是如此猛烈，一时间四周全是进攻者；就象狮子对付群狗，街垒摆脱了这些士兵，它被围攻者覆盖着，只不过象浪花冲击悬崖一样，不一会儿，又重新露出黑色的巨大峭壁。 纵队被迫退却后又在街上密集，他们已没有掩护，但很可怖，他们用骇人的排枪向棱堡还击。见过烟火的人将会记起那种称之为礼花的交叉着的火光，试想这簇礼花不是垂直而是横着的，每束火花顶端有一颗实心弹、一颗大粒霰弹或一颗散子弹，在一连串的电闪雷鸣中撒播着死亡。街垒正处在它的下方。 双方的决心是相等的。勇敢在这里近于野蛮，并夹杂着某种残酷的英雄行为，这首先是来自自我牺牲的精神。在那个时代国民自卫军打起仗来就象轻步兵一样。军队要结束这场战争，起义者却要继续战斗。在年轻力壮的时候去接受死亡，这使大无畏的精神变为疯狂。混战中的每一个人都感到了最后时刻所赐予的至高无上的形象。街上堆满了尸体。 街垒的一头是安灼拉，另一头是马吕斯。安灼拉关心整个街垒，他等待战机，暂作隐蔽；三个士兵看都没有看到他，就在他的枪孔前接连倒下。马吕斯则是不加掩护地作战，成了众矢之的。他从棱堡顶上露出大半截身子。一个吝啬的人在发狂时可以千金一掷，在所不惜，但也没有比一个冥想者行动起来更可怕的了。马吕斯既极其可怕又沉思不醒。他在战斗中的动作如同在梦里一样，看起来好象是一个鬼魂在打枪。 被包围者的子弹逐渐耗尽，他们的嘲讽却还没有枯竭。在这座坟墓的旋风中，他们还是嬉笑自如。 古费拉克光着脑袋。 “你把帽子弄哪儿去了？”博须埃问他。 古费拉克回答： “他们老开炮给轰掉了。” 或者他们还态度傲慢地评论一番。 “真不明白这些人，”弗以伊辛酸地喊着（他念着一些名字，有些甚至很有名，一些过去军界中的人士），“他们答应来参加并发誓帮助我们，他们曾以荣誉担保，他们是我们的将军，可是却抛弃了我们！” 公白飞只报以庄严的微笑： “有些人遵守荣誉信条，好比人们观察①星星，隔着老远的距离。” ①此处“遵守”与“观察”法语是同一个词：observer。 街垒的内部撒满炸开的弹片，就象下了一场雪。 进攻者人数众多，起义者地势优越。起义者在一堵高墙上很近地瞄准那些在尸体和伤兵间踉跄前进或在陡坡上跌脚绊手的士兵。这街垒筑得这样牢固真令人叹服，真不愧是一个固守的阵地，少数人就可阻挡一个军团。可是随时在补充人员并在枪林弹雨中不断增援的突击纵队无情地迫近了，现在正在一点点、一步步、但有把握地前进，象是压榨机的螺丝在拧紧，军队逐渐逼近街垒。 突击连续不断，恐怖越加强烈。 于是在这堆铺路石上，在这条麻厂街上，展开了一场堪与特洛伊之战相比的搏斗。这些形容憔悴、衣衫破烂、疲惫不堪的人，十四小时不进食，没合眼，只剩下几发子弹可供射击，现在正摸着没有子弹的空口袋；他们几乎都受了伤，头或手臂都用发黑的血污的布条包扎着，衣服的破洞中流出鲜血，有的武器只是管坏枪和旧而钝的刀，但却要成为巨人提坦了。街垒曾十次受到围困、攻打、攀登，但始终未被占领。 要对这次战斗有个概念，我们可以想象在一堆可怕的勇士身上点起火来，再来观看这场火灾。这不是一场战斗，这是一个火炉的炉膛。他们的嘴在吞吐火焰，他们的脸非常奇特。这已不再是人的形态；战士们浑身是火；见到这些在混战的红焰中来往的火蛇真是令人胆战心惊。对双方同时进行的连续不断的大规模杀戮场面，我们将不予描述，因为只有长篇的英雄史诗才有权用一万二千行诗句来叙述一次战斗。 简直就象婆罗门教的地狱，十七种地狱中最可怕的一种，在《吠陀》①中被称为剑林。 肉搏开始了，短兵相接，用手枪射击，长刀砍，拳头打，远处，近处，从上面，从下面，到处皆是，从屋顶，从酒店窗口，几个人钻进了地下室，从通气洞射击。这是一对六十的悬殊战。科林斯的门面已毁去一半，形状很丑。窗上弹痕累累，玻璃和窗框都已不在，只是一个畸形的洞而已，用铺路石乱七八糟地堵着。博须埃被杀死了，弗以伊被杀死了，古费拉克被杀死了，若李被杀死了，公白飞正在扶起一个伤兵时被刺刀刺了三下，刺穿了胸，只朝天望了一眼就气绝了。 马吕斯继续战斗，浑身是伤，尤其是头部，满面鲜血，好象盖了一块红手帕。 安灼拉是唯一没有受伤的。他没有了武器，就左右伸手，有个起义者随便放一把刀在他手里。他的四把剑只剩下了断片，比弗朗索瓦一世②在马林雅诺还多一把。 ①《吠陀》（Véda），印度最古的宗教文献和文学作品的总称。 ②弗朗索瓦一世（FrancoisIer，1494-1547），法国国王，一五一五年至一五四七年在位。一五一五年在意大利马林雅诺城战胜瑞士人。 荷马说：“狄俄墨得斯扼杀了住在欢乐的阿利斯巴的特脱拉尼斯的儿子阿希勒；墨西斯特的儿子于利亚除掉了特来梭斯、奥菲提奥斯、埃赛普以及河神阿巴巴莱和无可非难的布科里奥怀孕后生下的儿子贝达希斯；乌利西斯推翻了贝谷斯的毕弟特；安提罗科推翻阿培来；波里波特斯推翻阿斯第耶；波里达马斯推翻西兰的奥多斯；透克洛斯推翻阿埃达翁。梅冈提奥斯死在欧里毕勒的标枪下。阿伽门农，英雄之王，打翻了生长在波涛滚滚的沙特诺以斯河所灌溉的悬崖城市中的埃拉多斯。”①在我们古代的英雄史诗中埃斯勃朗第安用两头冒火的利刃攻打巨人斯汪蒂坡尔侯爵，侯爵拔起城楼向这位骑士掷去自卫。我们的古老壁画中可以见到布列塔尼和波旁两个武装了的公爵，他们带着徽章和战盔，骑着马，握着战斧，戴着铁面罩，穿着铁靴，戴着铁手套，一匹马披着银鼠马衣，另一匹裹着蓝呢；布列塔尼那一位在冠冕的两角之间有他的狮子为记，波旁的那一位在铁盔帽舌上装饰着一大朵百合花。其实要表示堂皇，不需要象伊奉那样戴着公爵的高顶盔，象埃斯勃朗第安那样，举着一个火炬，或象波里达马斯的父亲费来斯那样，从埃非尔带回欧菲特王的礼物棗一副好甲胄，这只需为一个信仰或为了尽忠献出生命就够了。这个天真的小士兵，昨天还是博斯或里摩日的农民，腰间别着菜刀，在卢森堡公园孩子们的保姆周围徘徊，这个年轻的学生，面色苍白，专心解剖或看一本书，一个用剪刀剪胡子的金发少年，把他们两人集合在一起，向他们鼓吹一下责任心，把他们带到布什拉街口或在卜朗什－米勃雷死胡同内面对面站着，使一个为了自己的旗帜、另一个为了理想而战，让双方都认为是在为祖国而战；斗争将很激烈，这两个对抗着的步兵和外科医生，他们投在人类斗争的大战场上的影子可与多虎的里西君王美加莱在和伟大的与神明相等的埃阿斯②肉博时所投的影子相媲美。 ①以上人名均系荷马史诗《伊利亚特》及《奥德赛》中之英雄。 ②埃阿斯（Ajax），特洛伊战争中的希腊英雄。主将阿喀琉斯死后，埃阿斯与奥德修斯争夺阿喀琉斯的武器，奥德修斯用计取胜，埃阿斯自杀而死。","sourceLink":"http://novel.tingroom.com/jingdian/75/4437.html","bookId":542,"book":{"id":542,"title":"Les Miserables悲惨世界","description":"简介： 故事发生在19世纪的法国，穷苦农民冉阿让因偷面包而入狱多年，终获假释却再次无视法律，不得不开始逃亡。被收留他的主教感化后，冉阿让决心洗心革面，开始新生活。十年后他成为成功的商人并当上市长，却一直受到铁面警官贾维尔锲而不舍地追捕。...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1288579064ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/75","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
