{"id":35914,"no":327,"title":"Part 5 Book 5 Chapter 6 The Two Old Men Do Everything, Each One After His Own Fashion,to Render Cose","content":"Everything was made ready for the wedding. The doctor, on being consulted, declared that it might take place in February. It was then December. A few ravishing weeks of perfect happiness passed.\n The grandfather was not the least happy of them all. He remained for a quarter of an hour at a time gazing at Cosette. \n \"The wonderful, beautiful girl!\" he exclaimed. \"And she has so sweet and good an air! She is, without exception, the most charming girl that I have ever seen in my life. Later on, she\u0027ll have virtues with an odor of violets. How graceful! One cannot live otherwise than nobly with such a creature. Marius, my boy, you are a Baron, you are rich, don\u0027t go to pettifogging, I beg of you.\"\n Cosette and Marius had passed abruptly from the sepulchre to paradise. The transition had not been softened, and they would have been stunned, had they not been dazzled by it.\n \"Do you understand anything about it?\" said Marius to Cosette.\n \"No,\" replied Cosette, \"but it seems to me that the good God is caring for us.\"\n Jean Valjean did everything, smoothed away every difficulty, arranged everything, made everything easy. He hastened towards Cosette\u0027s happiness with as much ardor, and, apparently with as much joy, as Cosette herself.\n As he had been a mayor, he understood how to solve that delicate problem, with the secret of which he alone was acquainted, Cosette\u0027s civil status. If he were to announce her origin bluntly, it might prevent the marriage, who knows? He extricated Cosette from all difficulties. He concocted for her a family of dead people, a sure means of not encountering any objections. Cosette was the only scion of an extinct family; Cosette was not his own daughter, but the daughter of the other Fauchelevent. Two brothers Fauchelevent had been gardeners to the convent of the Petit-Picpus. Inquiry was made at that convent; the very best information and the most respectable references abounded; the good nuns, not very apt and but little inclined to fathom questions of paternity, and not attaching any importance to the matter, had never understood exactly of which of the two Fauchelevents Cosette was the daughter. They said what was wanted and they said it with zeal. An acte de notoriete was drawn up. Cosette became in the eyes of the law, Mademoiselle Euphrasie Fauchelevent. She was declared an orphan, both father and mother being dead. Jean Valjean so arranged it that he was appointed, under the name of Fauchelevent, as Cosette\u0027s guardian, with M. Gillenormand as supervising guardian over him. \n As for the five hundred and eighty thousand francs, they constituted a legacy bequeathed to Cosette by a dead person, who desired to remain unknown. The original legacy had consisted of five hundred and ninety-four thousand francs; but ten thousand francs had been expended on the education of Mademoiselle Euphrasie, five thousand francs of that amount having been paid to the convent. This legacy, deposited in the hands of a third party, was to be turned over to Cosette at her majority, or at the date of her marriage. This, taken as a whole, was very acceptable, as the reader will perceive, especially when the sum due was half a million. There were some peculiarities here and there, it is true, but they were not noticed; one of the interested parties had his eyes blindfolded by love, the others by the six hundred thousand francs. \n Cosette learned that she was not the daughter of that old man whom she had so long called father. He was merely a kinsman; another Fauchelevent was her real father. At any other time this would have broken her heart. But at the ineffable moment which she was then passing through, it cast but a slight shadow, a faint cloud, and she was so full of joy that the cloud did not last long. She had Marius. The young man arrived, the old man was effaced; such is life.\n And then, Cosette had, for long years, been habituated to seeing enigmas around her; every being who has had a mysterious childhood is always prepared for certain renunciations. \n Nevertheless, she continued to call Jean Valjean: Father.\n Cosette, happy as the angels, was enthusiastic over Father Gillenormand. It is true that he overwhelmed her with gallant compliments and presents. While Jean Valjean was building up for Cosette a normal situation in society and an unassailable status, M. Gillenormand was superintending the basket of wedding gifts. Nothing so amused him as being magnificent. He had given to Cosette a robe of Binche guipure which had descended to him from his own grandmother. \n \"These fashions come up again,\" said he, \"ancient things are the rage, and the young women of my old age dress like the old women of my childhood.\"\n He rifled his respectable chests of drawers in Coromandel lacquer, with swelling fronts, which had not been opened for years.--\"Let us hear the confession of these dowagers,\" he said, \"let us see what they have in their paunches.\" He noisily violated the pot-bellied drawers of all his wives, of all his mistresses and of all his grandmothers. Pekins, damasks, lampas, painted moires, robes of shot gros de Tours, India kerchiefs embroidered in gold that could be washed, dauphines without a right or wrong side, in the piece, Genoa and Alencon point lace, parures in antique goldsmith\u0027s work, ivory bon-bon boxes ornamented with microscopic battles, gewgaws and ribbons-- he lavished everything on Cosette. Cosette, amazed, desperately in love with Marius, and wild with gratitude towards M. Gillenormand, dreamed of a happiness without limit clothed in satin and velvet. Her wedding basket seemed to her to be upheld by seraphim. Her soul flew out into the azure depths, with wings of Mechlin lace. \n The intoxication of the lovers was only equalled, as we have already said, by the ecstasy of the grandfather. A sort of flourish of trumpets went on in the Rue des Filles-du-Calvaire. \n Every morning, a fresh offering of bric-a-brac from the grandfather to Cosette. All possible knickknacks glittered around her. \n One day Marius, who was fond of talking gravely in the midst of his bliss, said, apropos of I know not what incident: \n \"The men of the revolution are so great, that they have the prestige of the ages, like Cato and like Phocion, and each one of them seems to me an antique memory.\"\n \"Moire antique!\" exclaimed the old gentleman. \"Thanks, Marius. That is precisely the idea of which I was in search.\"\n And on the following day, a magnificent dress of tea-rose colored moire antique was added to Cosette\u0027s wedding presents.\n From these fripperies, the grandfather extracted a bit of wisdom.\n \"Love is all very well; but there must be something else to go with it. The useless must be mingled with happiness. Happiness is \n only the necessary. Season that enormously with the superfluous for me. A palace and her heart. Her heart and the Louvre. Her heart and the grand waterworks of Versailles. Give me my shepherdess and try to make her a duchess. Fetch me Phyllis crowned with corn-flowers, and add a hundred thousand francs income. Open for me a bucolic perspective as far as you can see, beneath a marble colonnade. I consent to the bucolic and also to the fairy spectacle of marble and gold. Dry happiness resembles dry bread. One eats, but one does not dine. I want the superfluous, the useless, the extravagant, excess, that which serves no purpose. I remember to have seen, in the Cathedral of Strasburg, a clock, as tall as a three-story house which marked the hours, which had the kindness to indicate the hour, but which had not the air of being made for that; and which, after having struck midday, or midnight,- midday, the hour of the sun, or midnight, the hour of love,-- or any other hour that you like, gave you the moon and the stars, the earth and the sea, birds and fishes, Phoebus and Phoebe, and a host of things which emerged from a niche, and the twelve apostles, and the Emperor Charles the Fifth, and Eponine, and Sabinus, and a throng of little gilded goodmen, who played on the trumpet to boot. Without reckoning delicious chimes which it sprinkled through the air, on every occasion, without any one\u0027s knowing why. Is a petty bald clock-face which merely tells the hour equal to that? For my part, I am of the opinion of the big clock of Strasburg, and I prefer it to the cuckoo clock from the Black Forest.\" \n M. Gillenormand talked nonsense in connection with the wedding, and all the fripperies of the eighteenth century passed pell-mell through his dithyrambs.\n \"You are ignorant of the art of festivals. You do not know how to organize a day of enjoyment in this age,\" he exclaimed. \"Your nineteenth century is weak. It lacks excess. It ignores the rich, it ignores the noble. In everything it is clean-shaven. Your third estate is insipid, colorless, odorless, and shapeless. The dreams of your bourgeois who set up, as they express it: a pretty boudoir freshly decorated, violet, ebony and calico. Make way! Make way! The Sieur Curmudgeon is marrying Mademoiselle Clutch-penny. Sumptuousness and splendor. A louis d\u0027or has been stuck to a candle. There\u0027s the epoch for you. My demand is that I may flee from it beyond the Sarmatians. Ah! in 1787, I predict that all was lost, from the day when I beheld the Duc de Rohan, Prince de Leon, Duc de Chabot, Duc de Montbazon, Marquis de Sonbise, Vicomte de Thouars, peer of France, go to Longchamps in a tapecu! That has borne its fruits. In this century, men attend to business, they gamble on \u0027Change, they win money, they are stingy. People take care of their surfaces and varnish them; every one is dressed as though just out of a band-box, washed, soaped, scraped, shaved, combed, waked, smoothed, rubbed, brushed, cleaned on the outside, irreproachable, polished as a pebble, discreet, neat, and at the same time, death of my life, in the depths of their consciences they have dung-heaps and cesspools that are enough to make a cow-herd who blows his nose in his fingers, recoil. I grant to this age the device: `Dirty Cleanliness.\u0027 Don\u0027t be vexed, Marius, give me permission to speak; I say no evil of the people as you see, I am always harping on your people, but do look favorably on my dealing a bit of a slap to the bourgeoisie. I belong to it. He who loves well lashes well. Thereupon, I say plainly, that now-a-days people marry, but that they no longer know how to marry. Ah! It is true, I regret the grace of the ancient manners. I regret everything about them, their elegance, their chivalry, those courteous and delicate ways, that joyous luxury which every one possessed, music forming part of the wedding, a symphony above stairs, a beating of drums below stairs, the dances, the joyous faces round the table, the fine-spun gallant compliments, the songs, the fireworks, the frank laughter, the devil\u0027s own row, the huge knots of ribbon. I regret the bride\u0027s garter. The bride\u0027s garter is cousin to the girdle of Venus. On what does the war of Troy turn? On Helen\u0027s garter, parbleu! Why did they fight, why did Diomed the divine break over the head of Meriones that great brazen helmet of ten points? Why did Achilles and Hector hew each other up with vast blows of their lances? Because Helen allowed Paris to take her garter. With Cosette\u0027s garter, Homer would construct the Iliad. He would put in his poem, a loquacious old fellow, like me, and he would call him Nestor. My friends, in bygone days, in those amiable days of yore, people married wisely; they had a good contract, and then they had a good carouse. As soon as Cujas had taken his departure, Gamacho entered. But, in sooth! The stomach is an agreeable beast which demands its due, and which wants to have its wedding also. People supped well, and had at table a beautiful neighbor without a guimpe so that her throat was only moderately concealed. Oh! The large laughing mouths, and how gay we were in those days! Youth was a bouquet; every young man terminated in a branch of lilacs or a tuft of roses; whether he was a shepherd or a warrior; and if, by chance, one was a captain of dragoons, one found means to call oneself Florian. People thought much of looking well. They embroidered and tinted themselves. A bourgeois had the air of a flower, a Marquis had the air of a precious stone. People had no straps to their boots, they had no boots. They were spruce, shining, waved, lustrous, fluttering, dainty, coquettish, which did not at all prevent their wearing swords by their sides. The humming-bird has beak and claws. That was the day of the Galland Indies. One of the sides of that century was delicate, the other was magnificent; and by the green cabbages! People amused themselves. To-day, people are serious. The bourgeois is avaricious, the bourgeoise is a prude; your century is unfortunate. People would drive away the Graces as being too low in the neck. Alas!Beauty is concealed as though it were ugliness. Since the revolution, everything, including the ballet-dancers, has had its trousers; a mountebank dancer must be grave; your rigadoons are doctrinarian. It is necessary to be majestic. People would be greatly annoyed if they did not carry their chins in their cravats. The ideal of an urchin of twenty when he marries, is to resemble M. Royer-Collard. And do you know what one arrives at with that majesty? At being petty. Learn this: joy is not only joyous; it is great. But be in love gayly then, what the deuce! Marry, when you marry, with fever and giddiness, and tumult, and the uproar of happiness! Be grave in church, well and good. But, as soon as the mass is finished, sarpejou! You must make a dream whirl around the bride. A marriage should be royal and chimerical; it should promenade its ceremony from the cathedral of Rheims to the pagoda of Chanteloup. I have a horror of a paltry wedding. Ventregoulette! Be in Olympus for that one day, at least. Be one of the gods. Ah! People might be sylphs. Games and Laughter, argiraspides; they are stupids. My friends, every recently made bridegroom ought to be Prince Aldobrandini. Profit by that unique minute in life to soar away to the empyrean with the swans and the eagles, even if you do have to fall back on the morrow into the bourgeoisie of the frogs. Don\u0027t economize on the nuptials, do not prune them of their splendors; don\u0027t scrimp on the day when you beam. The wedding is not the housekeeping. Oh! If I were to carry out my fancy, it would be gallant, violins would be heard under the trees. Here is my programme: sky-blue and silver. I would mingle with the festival the rural divinities, I would convoke the Dryads and the Nereids. The nuptials of Amphitrite, a rosy cloud, nymphs with well dressed locks and entirely naked, an Academician offering quatrains to the goddess, a chariot drawn by marine monsters.\n \"Triton trottait devant, et tirait de sa conque Des sons si ravissants qu\u0027il ravissait quiconque!\"[65] \n --there\u0027s a festive programme, there\u0027s a good one, or else I know nothing of such matters, deuce take it!\"\n [65] \"Triton trotted on before, and drew from his conch-shell sounds so ravishing that he delighted everyone!\"\n While the grandfather, in full lyrical effusion, was listening to himself, Cosette and Marius grew intoxicated as they gazed freely at each other.\n Aunt Gillenormand surveyed all this with her imperturbable placidity. Within the last five or six months she had experienced a certain amount of emotions. Marius returned, Marius brought back bleeding, Marius brought back from a barricade, Marius dead, then living, Marius reconciled, Marius betrothed, Marius wedding a poor girl, Marius wedding a millionairess. The six hundred thousand francs had been her last surprise. Then, her indifference of a girl taking her first communion returned to her. She went regularly to service, told her beads, read her euchology, mumbled Aves in one corner of the house, while I love you was being whispered in the other, and she beheld Marius and Cosette in a vague way, like two shadows. The shadow was herself.\n There is a certain state of inert asceticism in which the soul, neutralized by torpor, a stranger to that which may be designated as the business of living, receives no impressions, either human, or pleasant or painful, with the exception of earthquakes and catastrophes. This devotion, as Father Gillenormand said to his daughter, corresponds to a cold in the head. You smell nothing of life. Neither any bad, nor any good odor. \n Moreover, the six hundred thousand francs had settled the elderly spinster\u0027s indecision. Her father had acquired the habit of taking her so little into account, that he had not consulted her in the matter of consent to Marius\u0027 marriage. He had acted impetuously, according to his wont, having, a despot-turned slave, but a single thought,--to satisfy Marius. As for the aunt,--it had not even occurred to him that the aunt existed, and that she could have an opinion of her own, and, sheep as she was, this had vexed her. Somewhat resentful in her inmost soul, but impassible externally, she had said to herself: \"My father has settled the question of the marriage without reference to me; I shall settle the question of the inheritance without consulting him.\" She was rich, in fact, and her father was not. She had reserved her decision on this point. It is probable that, had the match been a poor one, she would have left him poor. \"So much the worse for my nephew! He is wedding a beggar, let him be a beggar himself!\" But Cosette\u0027s half-million pleased the aunt, and altered her inward situation so far as this pair of lovers were concerned. One owes some consideration to six hundred thousand francs, and it was evident that she could not do otherwise than leave her fortune to these young people, since they did not need it.\n It was arranged that the couple should live with the grandfather-- M. Gillenormand insisted on resigning to them his chamber, the finest in the house. \"That will make me young again,\" he said. \"It\u0027s an old plan of mine. I have always entertained the idea of having a wedding in my chamber.\"\n He furnished this chamber with a multitude of elegant trifles. He had the ceiling and walls hung with an extraordinary stuff, which he had by him in the piece, and which he believed to have emanated from Utrecht with a buttercup-colored satin ground, covered with velvet auricula blossoms.--\"It was with that stuff,\" said he, \"that the bed of the Duchesse d\u0027Anville at la Roche-Guyon was draped.\"-- On the chimney-piece, he set a little figure in Saxe porcelain, carrying a muff against her nude stomach.\n M. Gillenormand\u0027s library became the lawyer\u0027s study, which Marius needed; a study, it will be remembered, being required by the council of the order.\n 外祖父同样感到欢乐。他时常久久地凝视着珂赛特。\n “奇妙的美姑娘！”他大声说，“她的神情是如此温柔善良！没得说的，我的意中人，这是我生平见到的最俊俏的姑娘。将来她的美德就象紫罗兰一样馨香。这真是一个天仙！应当和她在高贵的环境中相处。马吕斯，我的孩子，你是男爵，你富有，我求你不要再去当律师了。”\n 珂赛特和马吕斯忽然从坟墓里上升到了天堂。转变是如此突然，他们俩如果不是眼花缭乱，也会目瞪口呆的。\n “你明白这是怎么回事吗？”马吕斯问珂赛特。\n “不，”珂赛特回答，“但是我感到上帝在瞧着我们。”冉阿让办理一切，铺平道路，调停一切，使事情顺利推进。表面看来他似乎和珂赛特一样愉快，他殷切地盼望着她的幸福能早日来临。\n 由于他当过市长，他解决了一个为难的问题，只有一个人知道其中奥秘，这就是有关珂赛特的身分问题。直截了当地说出她的出身，谁知道呀！有可能破坏婚事。他为珂赛特排除了一切困难。他把她安排成一个父母双亡的孩子，这样才可以不冒风险。珂赛特是一个孤儿；珂赛特不是他的女儿，而是另一个割风的女儿。割风兄弟俩在小比克布斯做过园丁。派人到修道院去过了，调查后得到很多最好的情况，最值得尊敬的见证；善良的修女们不太懂也不喜欢去追究别人父系方面的问题，她们看不出其中有什么花招，因此始终也没搞清楚小珂赛特究竟是哪一个割风的女儿。她们说了别人需要她们说的话，并且语气诚恳。一个身分证明书已经办妥。根据法律珂赛特就是欧福拉吉·割风小姐了。她被宣称父母双亡。冉阿让以割风的名字，被指定为珂赛特的保护人，又加上吉诺曼先生，这是保护人的代理人。\n 至于那五十八万四千法郎，是一个不愿具名的人留给珂赛特的遗产。原来的数字是五十九万四千法郎，珂赛特的教育费花去了一万法郎，其中五千法郎付给了修女院。这笔遗产交给第三者保管，应在珂赛特成年后或结婚时交还给她。看来这一切都是合情合理的，尤其加上这五十多万的遗产。但其中也不免有些漏洞，但别人觉察不到。有一个与此有利害关系的人被爱情蒙住了眼睛，其他的人也被六十万法郎蒙蔽过去了。\n 珂赛特知道了被她叫了很久“父亲”的老人不是她的亲父，而只是一个亲戚；另一个割风才是她的父亲。如果不是此时此刻，她会感到难过的。但目前她在这难以形容的良辰美景中，这不过是点阴影，一点抑郁而已，但她的心情是那么欢快，以致乌云不久就消散了。她有了马吕斯。年轻的男子来到后，那老人就销声匿迹了。人生就是这么回事。\n 还有，珂赛特多年来，习惯看到她四周有些难解的谜；人凡是经历过这种神秘的幼年时期，对某些事就常常不去深究了。\n 她仍然称呼冉阿让为“父亲”。\n 珂赛特心旷神怡，她崇拜吉诺曼老爷爷。他确实向她说了不少赞扬的话，并送给她无数礼物。当冉阿让在替珂赛特创造一个社会上正常的地位和一笔无可指摘的财富时，吉诺曼先生在为她的结婚礼品篮子①作准备。没有比追求豪华更使他起劲的事了。他送了珂赛特一件班希②特产的花边衣服，这是他的亲祖母传给他的。“这种式样又时兴了，”他说，“老古董又风行一时了，在我年老时的少妇穿得象我幼年时的老奶奶一样。” \n ①新郎送新娘的一篮礼物。\n ②班希（Binche），让利时一个著名产花边的城市。\n 　\n 他翻着那多年没打开过的科罗曼德尔漆的凸肚式名贵五斗柜。“让这些老古董招供吧，”他说，“看看它们肚里有些什么东西。”他乱翻着那些鼓肚的抽屉，里面塞满了他的妻子、他所有的情妇和上辈的服装。中国花缎、大马士革锦缎、中国丝绸、画了花的绉绸。用火烤过的浮毛的图尔料子衣服、用可以下水洗的金线绣的手帕、几块没有正反面的王妃绸①、热那亚和阿朗松的挑花、老式的金银首饰、以细巧的战争画作装饰的象牙糖果盒、装饰品、缎带，他把所有一切都送给了珂赛特。珂赛特惊喜交集，对马吕斯情深似海，对吉诺曼先生感恩不尽，梦想着一个用绸缎和丝绒交织起来的无比的幸福。她觉得自己的结婚礼品篮子好象被天使托着，她的心好象长着马林花边的翅膀，在蔚蓝的天空里翱翔。 \n ①在法国里昂制造的一种名贵丝绸。\n 这对情人如痴如醉，我们已经提到，只有外祖父的狂喜才能与之相比。在受难修女街好象有人吹奏着欢庆的铜管乐。\n 每天清晨外祖父都送来一些古董给珂赛特。她四周是应有尽有的衬裙花边，就象盛开的花朵一样。\n 有一天不知从什么话题引起的，很喜欢在幸福中谈论严肃问题的马吕斯说道：\n “那些革命时期的人物是如此伟大，他们好象已有好几个世纪的威望，象卡托和伏西翁，他们两人都是自古以来受人凭吊的。”\n “古锦①！”吉诺曼高声说，“谢谢，马吕斯，这正是我要找的东西。”\n 第二天，在珂赛特的结婚礼品篮子里又增加了一件美丽的茶色古锦衣服。\n 外祖父在这堆衣着上作出了他的智慧的结论：\n “爱情，这当然很好，但必须有这些东西作陪衬。幸福需要一些无用的东西。幸福，这仅仅是必需品。要用许多奢侈品来调味。要一个宫殿来迎接爱情，爱情少不了卢浮宫。有了她的爱情，还需要凡尔赛的喷泉。把牧羊女给我，我尽力使她成为公爵夫人。把戴着矢车菊花冠的费莉②带来，给她加上十万利弗的年金。在大理石的柱廊下向我展现出一望无际的田园风光。我赞成牧人的田舍，同时也赞美大理石和金色的仙界。干巴巴的幸福就象吃干面包，吃是吃了，但不是筵席。我要多余的和不是必需品的东西，我要荒诞的、过分的、毫无用处的东西。我记得在斯特拉斯堡的教堂中见过一座有四层楼高的报时钟，它屈尊报时，但它不象是为此而造的，它在报了午时或午夜以后（中午是太阳的时辰，午夜是爱情的时辰），或是报了其他任何一个钟点以后，还为你现出月亮和星星、大地和海洋、鸟和鱼、福玻斯③和菲贝④，从一个窝里钻出无数的玩意儿：有十二个门徒⑤，还有查理五世皇帝⑥，还有爱波妮⑦和沙别纽斯，除此之外还有很多镀金的小人儿在吹着喇叭。还不算那些随时播送出来的、不知为什么发出的响彻云霄的优美钟乐。一个平凡的光秃秃的只能报时的钟能和它相提并论吗？我赞赏斯特拉斯堡的大钟远远胜过仿黑森林杜鹃叫声的报时小钟。”\n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/75/4464.html","bookId":542,"book":{"id":542,"title":"Les Miserables悲惨世界","description":"简介： 故事发生在19世纪的法国，穷苦农民冉阿让因偷面包而入狱多年，终获假释却再次无视法律，不得不开始逃亡。被收留他的主教感化后，冉阿让决心洗心革面，开始新生活。十年后他成为成功的商人并当上市长，却一直受到铁面警官贾维尔锲而不舍地追捕。...","cover":"http://novel.tingroom.com/uploads/allimg/101230/1288579064ab323.jpg","type":"双语小说","link":"http://novel.tingroom.com/jingdian/75","creation":"Aug 1, 2019 12:18:56 AM","modification":"Aug 1, 2019 12:18:56 AM"}}
