{"id":21798,"no":11,"title":"CHAPTER XI. THE MARCHESE BELTRAMI","content":"I managed to take Bianca home without much difficulty, for it was my good fortune to meet a disengaged fiacre in one of the narrow streets leading to the piazza Vittorio Emanuele, and placing the poor girl therein, we drove straight to the Casa Angello. The Signorina was in a very excited state, as that menacing voice, issuing out of the darkness, had quite unnerved her; so, placing her in charge of Petronella, who made her lie down, I went for a doctor. Being a stranger in Verona it was difficult to find one, but at last I did so, and took him at once to see Bianca, for whom he prescribed a soothing draught, and assured me that she would be all right after a few hours\u0027 sleep. This trouble therefore being off my mind, I went back to my hotel, in order to consider what was best to be done in the present emergency. I now saw that my surmise was right, and that the Contessa had hidden the body of the unfortunate Pallanza in the concealed tomb contrived by Count Mastino Morone for his guilty wife. It was a horribly ingenious idea that revolving pillar, and no one would have guessed its ghastly secret without being shown. Doubtless the wicked Donna Renata, shut up in this circular prison, had there starved slowly to death in an upright position, for, of course, the cavity was too narrow and too shallow to admit of any human being lying down. The skilful devilry of the device made me feel quite ill, especially when I thought how the worthy descendant of Borgia\u0027s accursed daughter had utilised this secret cell for her own infamous purpose. In this frightful oubliette the body of Guiseppe Pallanza would have remained for ever concealed; but then, according to the evidence of my own eyes, the body was not there. That the Contessa had placed the corpse in the pillar I had not the slightest doubt, as in showing the hiding-place she evidently expected to overwhelm me by the hideous evidence of her barbarous criminality. That the cavity was empty was as much a surprise to her as to me, and the shriek of terror she had given when flying from the chamber showed me that she was overpowered with fear at the thought that her gruesome secret was shared by another person, for, putting me out of the question altogether, there appeared to be a third party implicated in this singular affair. For my own part I believed it to be the man who had watched with me at the curtained archway, and who, after drugging me, bore me insensible from that terrible place. After doing so, and thus, according to his idea, putting it out of my power to re-discover the palace, he had returned to his post and seen the Contessa conceal the body of her victim in the cavity of the pillar. On her departure, for some reason best known to himself, he had removed the corpse, and hidden it somewhere else. This was, no doubt, the true story of the affair, but who was the man who had watched at the door, and who had taken away the body of Pallanza? It was impossible to guess the reasons for his behaving in this mysterious way, and the Contessa was evidently as ignorant as myself of his actions, judging from her terrified flight on discovering the truth. Whomsoever this unknown person was, he, to all appearances, held the key to the whole riddle, and, could I find him, I would doubtless learn the reason of Madame Morone\u0027s visit to the burial-ground, and the final fate of the unhappy tenor whom she had lured to his destruction. But how to find him! that was the question, and one to which I could find no satisfactory answer; so in the dilemma in which I thus found myself involved, I decided to tell Luigi Beltrami, as the only friend I had in Verona, the whole devilish story. In addition to the desire I felt of asking his advice and opinion, I thought it but right that he should know the real character of the woman he was about to marry, and not discover too late that he was tied for life to a ghoul, a vampire, a murderess. With this determination I looked for the card the Marchese had given me, and finding it in one of my pockets, discovered that my Italian friend lived in the Via Cartoni. As he had mentioned that he was always at home in the afternoon, doubtless to take a siesta during the heat of the day, on finishing my midday meal I went out to pay him a visit. In spite of his assertion that he was poor, Beltrami had a sufficient income to warrant him living in a moderately expensive manner, and on my arrival at his rooms in the Via Cartoni, I was shown into a very well-furnished apartment. As the Marchese was stationed with his regiment at Verona for some considerable time, he had evidently brought a portion of his furniture from his Florentine palazzo, for the room was too handsome to be that of the ordinary class of furnished apartments. As usual, the ceiling was charmingly painted; the floor was of marble, covered here and therewith square Turkish carpets; and in addition to a piano there were plenty of pictures and photographs, showing the artistic taste of the owner of the place. Beltrami himself, dressed as usual in his uniform, was seated at a desk placed in the window, writing letters, but he desisted when I was announced, and arose to greet me with marked cordiality. \"Ma foi, Hugo, this is kind of you to call so soon,\" he said when I was comfortably established in a chair. \"I was just writing you a letter asking you to dine with me and go to the Ezzelino to-night, but as you are here the note is useless.\" \"The fact is, my dear Marchese, I have called on a selfish errand.\" \"Indeed!\" \"Yes; still it is one that concerns yourself also.\" \"How so, mon ami? Come, tell me this mystery about which I know nothing and you know everything; but first here are some excellent cigarettes--Russian, my friend, not Italian. Dame! the tobacco of this country, it is horrible. Will you have some wine?\" \"No, thank you, Beltrami, but I will be glad to smoke.\" \"Bene! help yourself.\" He pushed the box towards me, and, after I had taken a cigarette, followed my example, then, throwing himself into a chair near me, he nodded his head to show that he was ready to hear what I had to say. \"Marchese!\" I said, after some slight hesitation, \"I think we are old enough friends to admit of my speaking to you freely.\" \"Eh! certainly!\" \"I trust you will not be offended.\" Beltrami blew a wreath of smoke, and laying back his handsome head on the cushions of the chair, laughed heartily. \"No, my doubting Englishman, I promise you I will not be offended at anything you say.\" \"But, Luigi, it is about the Contessa Morone!\" \"Eh! about the Contessa?--I thought as much!\" \"How so?\" I asked in some surprise. The face of the Marchese assumed that cruel, cunning look I so much disliked to see, and he eyed me in a nonchalant manner. \"Dame! Signor Hugo, I will tell you when I hear your story of the Contessa.\" Thus committed to narrative, I told Beltrami the whole story of my adventure from the time I had seen the Contessa at the graveyard to the hour when she had fled in dismay from the Palazzo Morone. He listened attentively, and when I had finished remained silent for a few minutes with a thoughtful look on his dark face. \"Why do you tell me all this, mon ami?\" he asked, at length, twisting his moustache in a reflective manner. \"For two reasons. First, you may be able to aid me in my search for Pallanza; and second, you must have been ignorant of the character of the woman you are going to marry.\" \"As to the first reason, Hugo, you are right. As to the second, you are wrong.\" \"What, you know----\" \"I know most of the story you have told me, and as to the Signora Morone, mon Dieu! I know her better than she does herself.\" \"Then why marry her?\" Beltrami shrugged his shoulders and selected another cigarette. \"Eh! she is rich and I am poor. It is time I ranged myself, as the French say, and I cannot afford to marry a poor wife; besides----\" \"Besides what?\" \"I rather like the task of taming this demon of a woman. Madame Morone is Satan\u0027s mistress in the matter of temper, I know, but I come of a race who either broke the will of their wives or----\" \"Or?\" I asked interrogatively. \"Or killed them!\" \"That\u0027s rather risky nowadays, Marchese. We do not live in the time of the Renaissance remember. But let us leave off this discussion of Madame Morone. I have told you my story, and you say you knew most of it before!\" \"And I say truly. Now listen, you cold-blooded islander, and see if I cannot disturb your phlegmatic disposition.\" He paused a moment to give greater weight to his remarks, the conclusion of which I impatiently awaited. \"I was the man who drugged you and had you carried to the Piazza Vittorio.\" \"You!\" \"I was the man who carried away the body of Guiseppe Pallanza.\" \"You!\" \"I am the man who, knowing what I do, calmly and with open eyes, have made up my mind to marry Madame Morone.\" \"You!\" I was so overwhelmed with the disclosures made by Beltrami that I could only sit thunderstruck in my chair, looking like an idiot and repeating \"You! you! you!\" parrot-fashion. Beltrami enjoyed my confusion for some time, and then went on speaking with a mocking smile:-- \"Eh! I astonish you, Hugo. Well, I admit I treated you rather badly, my friend; but then at the time I did not know whom you were. Dame! I cannot see in the dark like Madame Gatta.\" The Marchese then was the man who held the key to this enigma, and, far from being offended at his rough treatment of me on that fatal night, I was only too delighted at discovering the unknown person who, in this strange repetition of the old legend, had played the part of Count Mastino Morone. \"I have rather startled you, I fancy, Hugo?\" said Beltrami with an ironical laugh. \"I would be a fool to deny it; but now that your dramatic surprise has come off so excellently, perhaps you will tell me what it all means.\" \"Without doubt; confidence for confidence! Besides, I want your help to carry this comedy to its legitimate conclusion.\" \"Comedy, you call it? To my mind it is more like a tragedy.\" \"There you are wrong, mon ami. In a tragedy there must be a death.\" \"Well! You forget Pallanza?\" \"Not at all, Hugo; that is the whole point. Pallanza is not dead.\" I stared at the Marchese in astonishment. \"Pallanza not dead! Impossible! I saw him die on that night.\" \"Dame! You saw him fall insensible at the feet of the Contessa Morone, but insensibility is not death.\" \"Then he is alive?\" \"Naturally! One must either be alive or dead. And as this devil of a tenor is not the latter, he must therefore be the former.\" \"Then where is he?\" \"Eh! that is part of the story.\" This epigrammatic fencing on the part of Beltrami annoyed me greatly, as it piqued my curiosity without satisfying it, and I threw my half-smoked cigarette away with an outburst of bad temper. \"My dear Luigi, you have promised to tell me the story of this mystery, and instead of doing so you fire off epigrammatic squibs like Pasquin during the Carnival. The story, the story! I beg of you.\" \"Eh! certainly! Then take another cigarette, and I will tell you this \u0027Thousand and Second Night\u0027 romance.\"","sourceLink":"http://novel.tingroom.com/jingdian/1869/54070.html","bookId":817,"book":{"id":817,"title":"A Creature of the Night","description":"简介： I think it is Lord Beaconsfield who, in one of his brilliant stories, makes the clever observation that adventures are to the adventurous, and certainly he who seeks for adventures even in this prosaic nineteenth century will surely succeed in his qu...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1869","creation":"Aug 1, 2019 12:19:35 AM","modification":"Aug 1, 2019 12:19:35 AM"}}
