{"id":22489,"no":11,"title":"CHAPTER XI","content":"A misting rain was being swirled about by a temperish wind as Larry came out into the little street. Down toward the river the one gaslight glowed faintly like an expiring nebula; all the little shops were closed; home lights gleamed behind the curtained windows which the storm had closed; so that the street was now a little canyon of uncertain shadows. Larry had not needed to think to know that Gavegan would be making his vindictive approach from the westerly regions where lay Headquarters. So, keeping in the deeper shadows close to the building, Larry took the eastern course of the street, remembering in a flash a skiff he had seen tethered to a scow moored to the pier which stretched like a pointer finger from the little Square. As yet he had no plan beyond the necessity of the present moment, which was flight. Could he but make that skiff unseen and cast off, he would have time, in the brief sanctuary which the black river would afford him, to formulate the wisest procedure his predicament permitted him. As he came near that smothered glow-worm of a street-lamp it assumed for him the betraying glare of a huge spot-light. But it had to be passed to gain the skiff; and with collar turned up and hat-brim pulled down and head hunched low, he entered the dim sphere of betrayal, walked under its penny\u0027s-worth of flame, and glided toward the shadows beyond, his eyes straining with the preternatural keenness of the hunted at every stoop and doorway before him. He was just passing out of the sphere of mist-light—the lamp being now at his back helped him—when he saw three vague figures lurking half a dozen paces ahead of him. His brain registered these vague figures with the instantaneity of a snapshot camera at full noon. They were mere shadows; but the farther of the three seemed to be Barney Palmer—he was not sure; but of the identity of the other two there was no doubt: “Little Mick” and “Lefty Ed,” both members high in the councils of the Ginger Bucks, and either of whose services as a killer could be purchased for a hundred dollars or a paper of cocaine, depending upon which at the moment there was felt the greater need. In the very instant that he saw, Larry doubled about and ran at full speed back up the street. Two shots rang out; Larry could not tell whether they were fired by Little Mick or Lefty Ed or Barney Palmer—that is, if the third man really were Barney. Again two shots were fired, then came the sound of pursuing feet. Luckily not one of the bullets had touched Larry; for the New York professional gunman is the premier bad shot of all the world, and cannot count upon his marksmanship, unless he can get his weapon solidly anchored against his man, or can sneak around to the rear and pot his unsuspecting victim in the back. As Larry neared the pawnshop with the intention of making his escape through the western stretch of the street, he saw that Old Isaac has switched on the lights; and he also saw Officer Gavegan bearing down in his direction. They sighted each other in the same instant, and Gavegan let out a roar and started for him. Caught between two opposing forces, Larry again had no time to plan. Rather, there was nothing he could plan, for only one way was open to him. He dashed into the pawnshop and into the back room. At the Duchess\u0027s desk Hunt was scribbling at furious speed. “I\u0027m caught, Hunt—Gavegan\u0027s coming,” he gasped, and ran up the stairs, Hunt following and stuffing his scribblings into a pocket. As Larry passed the open studio door he saw Casey sitting up. “Down on the floor with you, Casey! Hunt, work over him to bring him to—and stall Gavegan for a while if you can.” With that Larry sprang to a ladder at the end of the little hall, ran up it, unhooked and pushed up the trap, scrambled through upon the roof, and pushed the trap back into place. Fortune, or rather the well-wishing wits of friends below, gave Larry a few precious moments more than he had counted on. He was barely out on the rain-greased tin roof, with the trap down, when Gavegan came thumping up the stairs and into the studio. At sight of the recumbent Casey, head limply on Hunt\u0027s knees, and his loose face being laved by a wet towel in Hunt\u0027s hands, Gavegan let out another roar: “Hell\u0027s bells! What the hell\u0027s this mean?” “I tried to nab Brainard,” Casey mumbled feebly, “and he knocked me out cold—the same as he did you, Gavegan.” “Hell!” snorted Gavegan, his wrath increased by this reference. “You there”—to Hunt and the Duchess—“where\u0027d Brainard go? He\u0027s in this house some place!” “I don\u0027t know,” said Hunt. “Yes, you do! Leave that boob side-kick of mine sleep it off, and help me find Brainard or you\u0027ll feel my boot!” The big painter stood up facing the big detective and his left hand gripped the latter\u0027s wrist and his right closed upon the detective\u0027s throat just as it had closed upon the lean throat of Old Jimmie on the day of Larry\u0027s return—only now there was nothing playful in the noose of that big hand. He shook Gavegan as he might have shaken a pillow, with a thumb thrusting painfully in beneath Gavegan\u0027s ear. “I\u0027ve done nothing, and that bully stuff doesn\u0027t go with me!” he fairly spat into Gavegan\u0027s face. “You talk to me like a gentleman and apologize, or I\u0027ll throw you out of the window and let your head bounce off one of its brother cobblestones below!” Gavegan choked out an apology, whereat Hunt flung him from him. The detective, glowering at the other, pulled aside curtains, peered into corners; then made furious and fruitless search of the rooms below, bringing up at last at Maggie\u0027s door, which the Duchess had slipped ahead of him and locked. When he demanded the key, the Duchess told him of Maggie\u0027s departure and her carrying the key with her. It was a solid door, with strong lock and hinges; and two minutes of Gavegan\u0027s battering shoulders were required to make it yield entrance. Not till he found the room empty did Gavegan think of the trap and the roof. Larry made good use of these few extra minutes granted him. Whatever he was to do he realized he must do it quickly. Not for long would the forces arrayed against him be small in number; Gavegan, though beaten at the outset, would send out an alarm that would arouse the police of the city—and in their own degree the gangsters would do the same. During his weeks of freedom Larry had unconsciously studied the layout of the neighborhood, his old instincts at work. The subconscious knowledge thus gained was of instant value. He hurried along the slippery roofs, taking care not to trip over the dividing walls, and came to the rear edge of a roof where he had marked a fire-escape with an unusually broad upper landing. He could discern the faint outlines of this; and hanging to the gutter he dropped to the fire-escape, and a moment later he was down in the back yard; and yet two moments later he was over two fences and going through a rabbit\u0027s burrow of a passageway that went beneath a house into the street behind his own. He did not pause to reconnoiter. Time was of the essence of his safety, risks had to be taken. He plunged out of his hole—around the first corner—around the next—and thus wove in and out, working westward, till at last, on turning a corner into a lighted street, he saw possible relief in two stray taxicabs before a little East Side restaurant, one of which was just leaving. “Taxi!” he called breathlessly. The chauffeur of the moving car swung back beside the curb and opened the door. But even as he started to enter he saw Little Mick and Lefty Ed turn into the street behind him. However, the brightness of this street ill-accorded with the anonymity with which their art is most safely and profitably practiced, so Larry got in without a bullet flicking at him. “Forty-Second Street and Broadway,” he called to the chauffeur as he closed the door. The car started off. Looking back through the little window he saw Lefty Ed enter the other taxicab, and saw Little Mick standing on the curb. He understood. Little Mick was to send out the alarm, while Lefty was to follow the trail. Let Lefty follow. At least Larry now had a few minutes to consider some plan which should look beyond the safety of the immediate moment. He was well-dressed, albeit somewhat wet and soiled; he had money in his pockets. What should he do? Yes, what should he do? The more he considered it the more ineluctable did his situation become. By now Gavegan had sent out his alarm; within a few moments every policeman on duty would have instructions to watch for him. He might escape for the time, at least, these allies of his one-time pals by going to a hotel and taking a room there; but to walk into a hotel would be to walk into arrest. On the other hand, he might evade the police if he sought refuge in one of his old haunts, or perhaps with old Bronson; but then his angered pals knew of these haunts, and to enter one of them would be to offer himself freely to their vengeance. There were other cities—but then how was he to get to them? He saw Manhattan for what it was to a man who was a fugitive from justice and injustice: an island, a trap, with only a few outlets and inlets for its millions: two railway stations—a few ferries—a few bridges—a few tunnels: and at every one of them policemen watching for him. He could not leave New York. And yet how in God\u0027s name was he to stay here? He thought of Maggie. So she wanted the life of dazzling, excitement, of brilliant adventure, did she? He wondered how she would like a little of the real thing—such as this? As he neared Forty-Second Street he still was without definite plan which would guarantee him safety, and there was Lefty hanging on doggedly. An idea came which would at least extend his respite and give him more time for thought. He opened the door of his cab and thrust a ten-dollar note into the instinctively ready hand of his driver. “Keep the change—and give me a swing once around Central Park, slowing down on those hilly turns on the west side.” “I gotcha.” The car entered the park at the Plaza and sped up the shining, almost empty drive. Larry kept watch, now on the trailing Lefty, now on the best chance for execution of his idea—all the way up the east side and around the turn at the north end. As the car, now south-bound, swung up the hill near One Hundred and Fifth Street, at whose crest there is a sharp curve with thick-growing, overhanging trees, Larry opened the right door and said: “Show me a little speed, driver, as soon as you pass this curve!” “I gotcha,” replied the chauffeur. The slowing car hugged the inside of the sharp turn, Larry holding the door open and waiting his moment. The instant the taxi made the curve Lefty\u0027s car was cut from view; and that instant Larry sprang from the running-board, slamming the door behind him, landed on soft earth and scuttled in among the trees. Crouching in the shadows he saw his car speed away as per his orders, and the moment after he saw Lefty\u0027s car, evidently taken by surprise by this obvious attempt at escape, leap forward in hot pursuit. Larry slipped farther in among the trees and sat down, his back against a tree. This was better. For the time he was safe. He drew a long breath. Then for a moment what he had just been through this last hour came back to him in an almost amusing light: as something grotesquely impossible—much like those helter-skelter, utterly unreal chases which, with slight variations of personalities and costumes, were the chief plots for the motion-picture drama in its crude childhood. But though there seemed a likeness, there was a tremendous difference. For this was real! Every one was in earnest! Again he thought of Maggie. What would she think, what would be her attitude, if she knew the truth about him?—the truth about those she had gone with and the life she had gone into? Would she be inclined toward HIM, would she help him?... Again he thought of what he should do. Now that he commanded a composure which had not been his during the stress of his flight, he examined every aspect with greater care. But the conclusions of composure were the same as those of excitement. He could not gain entrance to one of the great hotels and remain in his room, unidentified among its thousands of strangers; he could not find asylum in one of his old haunts; he dared not try to leave Manhattan. He was a prisoner, whose only privilege was a larger but most uncertain liberty. And that liberty was becoming penetratingly uncomfortable. An hour had passed, the ground on which he sat was wet and cold, and the misty air was assuming a distressing kinship with departed winter and was making shivering assaults upon his bones. At the best, he realized, he could not hope to remain secure in this cultivated wilderness beyond daylight. With the coming of morning he would certainly be the prey of either his pals or the police. And if they did not beat him from his hiding, plain mortal hunger would drive him out into the open streets. If he was to do anything at all, he must do it while he still had the moderate protection of the night. And then for the first time there came to him remembrance of Hunt\u0027s rapid injunction, given him in the hurly-burly of escape when no thoughts could impress the upper surface of his mind save those of the immediate moment. “If you\u0027re trapped, call Plaza nine-double-o-one and say \u0027Benvenuto Cellini.\u0027” Larry had no idea what that swift instruction might be about. And the chance seemed a slender, fantastical one, even if he could safely get to a public telephone. But it seemed his only chance. He arose, and, keeping as much as he could to the wilder regions of the park, and making the utmost use of shadows when he had to cross a path or a drive, he stole southward. He remembered a drug-store at Eighty-Fourth Street and Columbus Avenue, peculiarly suited to his purpose, for it had a side entrance on Eighty-Fourth Street and was in a neighborhood where policemen were infrequent. Fortune favored him. At length he reached Eighty-Fourth Street and peered over the wall. Central Park West was practically empty of automobiles, for the theaters had not yet discharged their crowds and no policeman was in sight. He vaulted the wall; a minute later he was in a booth in the drug-store, had dropped his nickel in the slot, and was asking for Plaza nine-double-o-one. “Hello, sir!” responded the very correct voice of a man. “Benvenuto Cellini,” said Larry. “Hold the wire, sir,” said the voice. Larry held the wire, wondering. After a moment the same correct voice asked where Larry was speaking from. Larry gave the exact information. “Stay right in the booth, and keep on talking; say anything you like; the wire here will be kept open,” continued the voice. “We\u0027ll not keep you waiting long, sir.” The voice ceased. Larry began to chat about topics of the day, about invented friends and engagements, well knowing that his stream of talk was not being heard unless Central was “listening in”; and knowing also that, to any one looking into the glass door of his booth, he was giving a most unsuspicious appearance of a busy man. And while he talked, his wonder grew. What was about to happen? What was this Benvenuto Cellini business all about? He had been talking for fifteen minutes or more when the glass door of the booth was opened from without and a man\u0027s voice remarked: “When you are through, sir, we will be going.” The voice was the same he had heard over the wire. Larry hung up and followed the man out the side door, noting only that he had a lean, respectful face. At the curb stood a limousine, the door of which was opened by the man for Larry. Larry stepped in. “Are you followed, sir?” inquired the man. “I don\u0027t know.” “We\u0027d better make certain. If you are, we\u0027ll lose them, sir. We\u0027ll stop somewhere and change our license plates again.” Instead of getting into the unlighted body with him, as Larry had expected, the man closed the door, mounted to the seat beside the chauffeur, and the car shot west and turned up Riverside Drive. One may break the speed laws in New York if one has the speed, and if one has the ability to get away with it. This car had both. Never before had Larry driven so rapidly within New York City limits; he knew this, that any trailing taxicab would be lost behind. At Two-Hundred-and-Forty-Fifth Street the car swung into Van Cortland Park, and switched off all lights. Two minutes later they halted in a dark stretch of one of the by-roads of the Park. “We\u0027ll be stopping only a minute, sir, to put on our right number plates,” the man opened the door to explain. Within the minute they were away again, now proceeding more leisurely, in the easy manner of a private car going about its private business—though the interior of the car was discreetly dark and Larry huddled discreetly into a corner. Thus they drove over the Grand Boulevards and recrossed the Harlem River and presently drew up in front of a great apartment house in Park Avenue. The man opened the door. “Walk right in, sir, as though you belong here. The doorman and the elevatorman are prepared.” They might be prepared, but Larry certainly was not; and he shot up the elevator to the top floor with mounting bewilderment. The man unlocked the door of an apartment, ushered Larry in, took his wet hat, then ushered the dazed Larry through the corner of a dim-lit drawing-room and through another door. “You are to wait here, sir,” said the man, and quietly withdrew. Larry looked about him. He took in but a few details, but he knew enough about the better fittings of life to realize that he was in the presence of both money and the best of taste. He noted the log fire in the broad fireplace, comfortable chairs, the imported rugs on the gleaming floor, the shelves of books which climbed to the ceiling, a quaint writing-desk in one corner which seemed to belong to another country and another century, but which was perfectly at home in this room. On the desk he saw standing a leather-framed photograph which seemed familiar. He crossed and picked it up. Indeed it was familiar! It was a photograph of Hunt: of Hunt, not in the shabby, shapeless garments he wore down at the Duchess\u0027s, but Hunt accoutered as might be a man accustomed to such a room as this—though in this picture there was the same strong chin, the same belligerent good-natured eyes. Now how and where did that impecunious, rough-neck painter fit into— But the dazed question Larry was asking was interrupted by a voice from the door—the thick voice of a man: “Who the hell \u0027r\u0027 you?” Larry whirled about. In the doorway stood a tall, bellicose young gentleman of perhaps twenty-four or five, in evening dress, flushed of face, holding unsteadily to the door-jamb. “I beg your pardon,” said Larry. “\u0027N\u0027 what the hell you doin\u0027 here?” continued the belligerent young gentleman. “I\u0027d be obliged to you if you could tell me,” said Larry. “Tryin\u0027 to stall, \u0027r\u0027 you,” declared the young gentleman with a scowling profundity. “No go. Got to come out your corner \u0027n\u0027 fight. \u0027N\u0027 I\u0027m goin\u0027 lick you.” The young man crossed unsteadily to Larry and took a fighting pose. “Put \u0027em up!” he ordered. This was certainly a night of strange adventure, thought Larry. His wild escape—his coming to this unknown place—and now this befuddled young fellow intent upon battle with him. “Let\u0027s fight to-morrow,” Larry suggested soothingly. “Put \u0027em up!” ordered the other. “If you don\u0027t know what you\u0027re doin\u0027 here, I\u0027ll show you what you\u0027re doin\u0027 here!” But he was not to show Larry, for while he was uttering his last words, trying to steady himself in a crouch for the delivery of a blow, a voice sounded sharply from the doorway—a woman\u0027s voice: “Dick!” The young man slowly turned. But Larry had seen her first. He had no chance to take her in, that first moment, beyond noting that she was slender and young and exquisitely gowned, for she swept straight across to them. “Dick, you\u0027re drunk again!” she exclaimed. “Wrong, sis,” he corrected in an injured tone. “It\u0027s same drunk.” “Dick, you go to bed!” “Now, sis—” “You go to bed!” The young man wavered before her commanding gaze. “Jus\u0027s you say—jus\u0027s you say,” he mumbled, and went unsteadily toward the door. The young woman watched him out, and then turned her troubled face back to Larry. “I\u0027m sorry Dick behaved to you as he did.” And then before Larry could make answer, her clouded look was gone. “So you\u0027re here at last, Mr. Brainard.” She held her hand out, smiling a smile that by some magic seemed to envelop him within an immediate friendship. “I\u0027m Miss Sherwood.” He noted that the slender, tapering hand had almost a man\u0027s strength of grip. “You needn\u0027t tell me anything about yourself,” she added, “for I already know a lot—all I need to know: about you—and about Maggie Carlisle. You see an hour ago a messenger brought me a long letter he\u0027d written about you.” And she nodded to the photograph Larry was still holding. “You—you know him?” Larry stammered. She answered with a whimsical smile: “Yes. Isn\u0027t he a grand, foolish old dear? He\u0027s such a roistering, bragging personage that I\u0027ve named him Benvenuto Cellini—though he\u0027s neither liar nor thief. He must have told you what I called him.” So that explained this password of “Benvenuto Cellini”! “No, he didn\u0027t explain anything. There was no time.” “I don\u0027t know where he is,” she continued; “please don\u0027t tell me. I don\u0027t want to know until he wants me to know.” Larry had been making a swift appraisal of her. She was perhaps thirty, fair, with golden-brown hair held in place by a large comb of wrought gold, with violet-blue eyes, wearing a low-cut gown of violet chiffon velvet and dull gold shoes. Larry\u0027s instinct told him that here was a patrician, a thoroughbred: with poise, with a knowledge of the world, with whimsical humor, with a kindly understanding of people, with steel in her, and with a smiling readiness for almost any situation. “I think no one will find you—at least for the present,” her pleasantly modulated voice continued. “There are so many things I want to talk over with you. Perhaps I can help about Maggie. I hope you don\u0027t mind my talking about her.” Larry could not imagine any one taking offense at anything this brilliant apparition might possibly say. “But we\u0027ll put off our talk until to-morrow. It\u0027s late, and you\u0027re wet and cold, and besides, my aunt is having one of her bad spells and thinks she needs me. Judkins will see to you. Good-night.” “Good-night,” said Larry. She moved gracefully out—almost floated, Larry would have said. The next moment the man was with him who had been his escort here, and led Larry into a spacious bedroom with bath attached. Ten minutes later Judkins made his exit, carrying Larry\u0027s outer clothes; and another ten minutes later, after a hot bath, and garbed in silk pajamas which Judkins had produced, Larry was in the softest and freshest bed that had ever held him. But sleep did not come to Larry for a long time. He lay wondering about this golden-haired, poiseful Miss Sherwood. She was undoubtedly the woman in the back of Hunt\u0027s life. And he wondered about Hunt—who he really was—what had really driven him into this strange exile. And he wondered about Maggie—what she might be doing—what from this strange new vantage-point he might do for her and with her. And he wondered how his own complex situation was going to work itself out. And still wondering, Larry at length fell asleep.","sourceLink":"http://novel.tingroom.com/ertong/2142/60570.html","bookId":618,"book":{"id":618,"title":"Children of the Whirlwind","description":"简介： It was an uninspiring bit of street: narrow, paved with cobble; hot and noisy in summer, reeking with unwholesome mud during the drizzling and snow-slimed months of winter. It looked anything this May after noon except a starting-place for drama. But...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2142","creation":"Aug 1, 2019 12:19:03 AM","modification":"Aug 1, 2019 12:19:03 AM"}}
