{"id":22507,"no":29,"title":"CHAPTER XXIX","content":"\n As the Duchess had gazed into Maggie\u0027s excited, imploring eyes, it had been borne in upon her carefully judging and painfully hesitant mind that there was better than a fifty per cent chance that Larry was right in his estimate of Maggie; that Maggie\u0027s inclination toward criminal adventure, her supreme self-confidence, all her bravado, were but the superficial though strong tendencies developed by her unfortunate environment; that within that cynical, worldly shell there were the vital and plastic makings of a real woman. \n \n And so the long-troubled Duchess, who to her acquaintances had always seemed as unemotional as the dust-coated, moth-eaten parrot which stood in mummified aloofness upon her safe, had made a momentous decision that had sent through her old veins the thrilling sap of a great crisis, a great suspense. She had tried to guide destiny. She was now through with such endeavor. She had no right, because of her love for Larry, to withhold longer the facts of Maggie\u0027s parentage. She was now going to tell the truth, and let events work out as they would. \n \n But the events—what were they going to be? \n \n For a moment the Duchess had been impelled to tell the truth straight out to Maggie. But she had caught herself in time. This whole affair was Larry\u0027s affair, and the truth belonged to him to be used as he saw fit. So when she had told Maggie that she would get word to Larry, it was this truth which she had had in mind, and only in a very minor way the news which Maggie had brought. \n \n This was, of course, such a truth as could be safely communicated only by word of mouth. The Duchess realized that Larry no longer dared come to her, and that therefore she must manage somehow to get to him. And get to him without betraying his whereabouts. \n \n There was little chance that the police would search her place or greatly bother her. To the police mind, now that Larry was aware he was known to be in New York, the pawnshop would obviously be the last place in which he would seek refuge or through which he would have dealings. Nevertheless, the Duchess deemed it wise to lose no moment and to neglect no possible caution. Therefore, while Barney was still with Chief Barlow and before the general order regarding Larry had more than reached the various police stations, the Duchess, in cape, hat, and veil, was out of her house. A block up the street lived the owner of two or three taxicabs, concerning whom the Duchess, who was almost omniscient in her own world, knew much that the said owner ardently desired should be known no further. A few sentences with this gentleman, and fifteen minutes later, huddled back in the darkened corner of a taxicab, she rolled over the Queensboro Bridge out upon Long Island on her mission of releasing a fact whose effect she could not foresee. \n \n An hour and a half after that Larry was leading her to a bench in the scented darkness of the Sherwoods\u0027 lawn. She had telephoned “Mr. Brandon” from a drug-store booth in Flushing, and Larry had been waiting for her near the entrance to Cedar Crest. \n \n “What brought you out here like this, grandmother?” Larry whispered in amazement as he sat down beside her. \n \n “To tell you that the police are after you,” she whispered back. \n \n “I knew that already.” \n \n “Yes, I knew that you would.” \n \n “But how did you find out?” \n \n “Maggie told me.” \n \n “Maggie!” \n \n “She came down to see me, told me what had just happened at her place, told me about Barney hurrying away to slip the news to that Gavegan, and begged me to warn you at once. She was terribly nervous and wrought up.” \n \n “Maggie did that!” he breathed. His heart leaped at her unexpected concern for him. “Maggie did that!” And then: “There wasn\u0027t any need; she should have known that I would know.” \n \n “It was rather foolish in a way—but Maggie was too excited to use cool reason.” \n \n His grandmother did not speak for a moment. “Her losing her head and coming shows that she cares for you, Larry.” \n \n He could make no response. This was indeed the clearest evidence Maggie had yet given that possibly she might care. \n \n “Maggie may have lost her head in her excitement,” he managed to say; “but, grandmother, there was no reason for you to lose your head so far as to come away out here to tell me about the police.” \n \n “I didn\u0027t come away out here to tell you about the police,” she replied. “I came to tell you something else.” \n \n “Yes?” \n \n “You\u0027re sure you really care for Maggie?” \n \n “I told you that when I was down to see you this evening.” \n \n Though the Duchess had decided, the desire to protect Larry remained tenaciously in her and made it hard for her jealous love to take a risk. “You\u0027re sure she might turn out all right—that is, under better influences?” \n \n “I\u0027m sure, grandmother.” He recalled how a few hours earlier at the Grantham the demand of Old Jimmie that she remain with him had seemed the force that had controlled her decision. “There would be no doubt of it if it were not for Old Jimmie, and the people he\u0027s kept her among, and the ideas he\u0027s been feeding her since she was a baby. I don\u0027t think she has any love for her father; but they say blood is mighty thick and I guess with her it\u0027s just the usual instinct of a child to stand with her father and do what he says. Yes, if she were not held back and held down by having Old Jimmie for a father, I\u0027m sure she\u0027d be all right.” \n \n The Duchess felt that the moment had now arrived for her to unloose her secret. But despite her fixed purpose to tell, her words had to be forced out, and were halting, bald. \n \n “Jimmie Carlisle—is not her father.” \n \n “What\u0027s that?” exclaimed Larry. \n \n “Not so loud. I said Jimmie Carlisle is not her father.” \n \n “Grandmother!” \n \n “Her father is Joe Ellison.” \n \n “Grandmother!” He caught her hands. “Why—why—” But for a moment his utter dumbfoundment paralyzed his speech. “You\u0027re—you\u0027re sure of that?” he finally got out. \n \n “Yes.” She went on and told of how her suspicion had been aroused, of her interview with Joe Ellison which had transmuted suspicion into certainty, of her theory of the motives which had actuated Jimmie Carlisle in so perverting the directions of the man who had held Jimmie as his most trusted friend. \n \n Larry was fairly stunned by this recital of what had been done. And he was further stunned as he realized the fullness of what now seemed to be the circumstances. \n \n “God, think of it!” he breathed. “Maggie trying to be a great adventuress because she was brought up that way, because she thinks her father wants her to be that—and having never a guess of the truth! And Joe Ellison believing that his daughter is a nice, simple girl, happily ignorant of the life he tried to shield her from—and having never a guess of the truth! What a situation! And if they should ever find out—” \n \n He broke off, appalled by the power and magnitude of what he vaguely saw. Presently he said in a numbed, awed voice: \n \n “They should know the truth. But how are they to find out?” \n \n “I\u0027m leaving all that to you, Larry. Maggie and Joe Ellison are your affair. It\u0027s up to you to decide what you think best to do.” \n \n Larry was silent for several moments. “You\u0027ve known this for some time, grandmother?” \n \n “For several weeks.” \n \n “Why didn\u0027t you tell me before?” \n \n “I was afraid it might somehow bring you closer to Maggie, and I didn\u0027t want that,” she answered honestly. “Now I think a little better of Maggie. And you\u0027ve proved to me I can trust a great deal more to your judgment. Yes, I guess that\u0027s the chief reason I\u0027ve come out here to tell you this: you\u0027ve proved to me I\u0027ve got to respect your judgment. And so whatever you may do—about Maggie or anything else—will be all right with me.” \n \n She did not wait for a response, but stood up. Her voice which had been shot through with emotion these last few minutes was now that flat, mechanical monotone to which the habitants of her little street were accustomed. \n \n “I must be getting back to the city. Good-night.” \n \n He started to accompany her to her car, but she forbade him, saying that it would not help matters to have him seen and possibly recognized by the taxicab driver; and so she went out of the grounds alone. Within another hour and a half she was set down unobserved in a dim side street in Brooklyn. Thence she made her way on foot to the Subway and rode home. If the police had noticed her absence and should question her, she could refuse to answer, or say that she had been visiting late with a friend in Brooklyn. \n \n Larry sat long out in the night after his grandmother had left him. What should he do with this amazing information placed at his disposal? Tell Joe Ellison? Or tell Maggie? Or tell both? Or himself try to meet Jimmie Carlisle and pay that traitor to Joe Ellison and that malformer of Maggie the coin he had earned? \n \n But for hours the situation itself was still too bewildering in its many phases for Larry to give concentrated thought to what should be its attempted solution. Not until dawn was beginning to awaken dully, as with a protracted yawn, out of the shadowy Sound, was he able really to hold his mind with clearness upon the problem of what use he should make of these facts of which he had been appointed guardian. He decided against telling Joe Ellison—at least he would not tell him yet. He recalled the rumors of Joe Ellison\u0027s repressed volcano of a temper; if Joe Ellison should learn how he had been defrauded, all the man\u0027s vital forces would be instantly transformed into destructive, vengeful rage that would spare no one and count no cost. The result would doubtless be tragedy, with no one greatly served, and with Joe very likely back in prison. If he himself should go out to give Old Jimmie his deserts, his action would be just good powder wasted—it likewise would serve no constructive purpose. Larry realized that it is only human nature for a wronged man to wish for and attempt revenge; but that in the economy of life revenge has no value, serves no purpose; that it usually only makes a bad situation worse. \n \n A tremendous wrong had been done here, a wrong which showed a malignant, cunning, patient mind. But as Larry finally saw the matter, the point for first consideration was not the valueless satisfaction of making the guilty man suffer, but was to try to restore to the victims some part of those precious things of which they had been unconsciously robbed. \n \n And then Larry had what seemed to him an inspiration: his inspiration being only a sane thought, and what the Duchess, though she had not pointed the way to him, had thought he would do. Maggie was the important person in this situation!—Maggie whose life was just beginning, and whose nature he still believed to be plastic! Not Joe Ellison or Old Jimmie Carlisle, who had almost lived out their lives and whose natures were now settled into what they would be until the end. By playing upon the finer elements in Maggie\u0027s character he had all but succeeded in rousing to dominance that best nature which existed within her. He would privately tell Maggie the truth, and tell only her and leave the using of that knowledge to her alone. The shock of that knowledge, the effect of its revelations upon her, together with the responsibility of what she should do with this information, might be just the final forces necessary to make Maggie break away from all that she had been and swing over to all that he believed she might be. \n \n Yes, that was the thing to do! And he would do it within the next twelve hours; for Dick had told him that Maggie was coming out again to Cedar Crest on the afternoon of the day which was now rousing from its sleep. That is, he would do it if the police or the allies of his one-time friends did not locate him before Maggie came. But of that he had no serious fear; he knew he had made a clean get-away from the Grantham, and that the shrewd Duchess had left no scent by which those bloodhounds of the Police Department could trail her. \n \n Larry did not even try to sleep; he knew it would be of no avail. Back in his own room he sat going over the situation, and his decision. He tingled with the sense of the tremendous power which had been delivered into his hands. Yes, tremendous! But what were going to be Maggie\u0027s reactions the moment he told her?—just what would be her course after she knew the truth? \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/2142/60588.html","bookId":618,"book":{"id":618,"title":"Children of the Whirlwind","description":"简介： It was an uninspiring bit of street: narrow, paved with cobble; hot and noisy in summer, reeking with unwholesome mud during the drizzling and snow-slimed months of winter. It looked anything this May after noon except a starting-place for drama. But...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2142","creation":"Aug 1, 2019 12:19:03 AM","modification":"Aug 1, 2019 12:19:03 AM"}}
