{"id":22483,"no":5,"title":"CHAPTER V","content":"\n The dinner was simple: beef stewed with potatoes and carrots and onions, and pie, and real coffee. But it measured up to Hunt\u0027s boast: the chef of the Ritz, limited to so simple a menu, could indeed have done no better. And Larry, after his prison fare, was dining as dine the gods. \n \n The irrepressible Hunt, trying to read this new specimen that had come under his observation, sought to draw Larry out. “Barney Palmer and Old Jimmie were here this afternoon, wanting to see you. They\u0027ve got something big waiting for you. I suppose you\u0027re all ready to jump in and put it over with a wallop.” \n \n “I\u0027m going to put something over with a wallop—but I guess business will have to wait until Barney, Jimmie, and I have a talk. Can you spare me a little more of that stew?” \n \n His manner of speaking was a quiet announcement to Hunt that his plans were for the present a closed subject. Hunt felt balked, for this lean, alert, much-talked-of adventurer piqued him greatly; but he switched to other subjects, and during the rest of the meal did most of the talking. The Duchess was silent, and seemingly was concerned only with her food. Larry got in a fair portion of speech, but for the most part his attention, except for that required for eating, was fixed upon Maggie. \n \n How she had sprung up since he had last seen her! Almost a woman now—and destined to be a beauty! And more than just a beauty: she was colorful, vital, high-strung. Before he had gone away he had regarded her with something akin to the negligent affection of an older brother. But this thing which was already beginning to surge up in him was altogether different, and he knew it. \n \n As for Maggie, when she looked at him, she flushed and her eyes grew bright. Larry was back!—the brilliant, daring Larry. She was aware that she had been successful in startling and gripping his attention. Yes, they would do great things together! \n \n When the dinner was finished and the dishes washed, Larry gave voice to this new urge that had so quickly grown up within him. \n \n “What do you say, Maggie, to a little walk?” \n \n “All right,” she replied eagerly. \n \n They went down the narrow stairway together. On the landing of the second floor, which contained only Maggie\u0027s bedroom and the Duchess\u0027s and a tiny kitchen, Maggie started to leave him to change into street clothes; but he caught her arm and said, “Come on.” They descended the next flight and came into the back room behind the pawnshop, which the Duchess used as a combination of sitting-room, office, and storeroom. About this musty museum hung or stood unredeemed seamen\u0027s jackets, men and women\u0027s evening wear, banjos, guitars, violins, umbrellas, and one huge green stuffed parrot sitting on top of the Duchess\u0027s safe. \n \n “I wanted to talk, not walk,” he said. “Let\u0027s stay here.” \n \n He took her hands and looked down on her steadily. Under the yellow gaslight her face gleamed excitedly up into his, her breath came quickly. \n \n “Well, sir, what do you think of me?” she demanded. “Have I changed much?” \n \n “Changed? Why, it\u0027s magic, Maggie! I left you a schoolgirl; you\u0027re a woman now. And a wonder!” \n \n “You think so?” She flushed with pride and pleasure, and a wildness of spirit possessed her and demanded expression in action. She freed her left hand and slipped it over Larry\u0027s shoulder. “Come on—let\u0027s two-step.” \n \n “But, Maggie, I\u0027ve forgotten.” \n \n “Come on!” \n \n Instantly she was dragging him over the scanty floor space. But after a moment he halted, protesting. \n \n “These prison brogans were not intended by their builders for such work. If you\u0027ve got to dance, you\u0027ll have to work it out of your system alone.” \n \n “All right!” \n \n At once, in the midst of the dingy room, humming the music, she was doing Carmen\u0027s dance—wild, provocative, alluring. It was not a remarkable performance in any professionally technical sense; but it had vivid personality; she was light, lithe, graceful, flashing with color and spirits. \n \n “Maggie!” he exclaimed, when she had finished and stood before him glowing and panting. “Good! Where did you learn that?” \n \n “In the chorus of a cabaret revue.” \n \n “Is that what you\u0027re doing now, working in a chorus?” \n \n “No. Barney and father said a chorus was no place for me.” She drew nearer. “Oh, Larry, I\u0027ve such a lot to tell you.” \n \n “Go on.” \n \n “Well”—she cocked her head impishly—“I\u0027ve been going to school.” \n \n “Going to school! Where?” \n \n “Lots of places. Just now I\u0027m going to school at the Ritzmore Hotel.” \n \n “At the Ritzmore Hotel!” He stared at her bewildered. “What are you learning there?” \n \n “To be a lady.” She laughed at his increasing bewilderment. “A real lady, Larry,” she went on excitedly. “Oh, it\u0027s such a wonderful idea! Father had never seemed to think much of me till the night I went to a masquerade ball with Mr. Hunt, and he and Barney saw me in these clothes. They had never seen me really dressed up before; Barney said it was an eye-opener. They saw how I could be of big use to you all. But to be that, I\u0027ve got to be a lady—a real lady, who knows how to behave and wear real clothes. That\u0027s what they\u0027re doing now: making me a lady.” \n \n “Making you a lady!” exclaimed Larry. “How?” \n \n “By putting me where I can watch real ladies, and study them. Barney cut short my being in a chorus; Barney said a chorus girl never learned to pass for a lady. So I\u0027ve been working in places where the swellest women come. First in a milliner shop; then as dresser to a model in the shop of a swell modiste; always watching how the ladies behave. Now I\u0027m at the Ritzmore, and I carry a tray of cigarettes around the tables at lunch and at tea-time and during dinner and during the after-theater supper. I\u0027m supposed to be there to sell cigarettes, but I\u0027m really there to watch how the ladies handle their knives and forks and behave toward the men. Isn\u0027t it all awfully clever?” \n \n “Why, Maggie!” he exclaimed. \n \n “And pretty soon, when I\u0027ve learned more,” she continued rapidly, “I\u0027m going to have swell clothes of my own—and be a lady—and get away from this dingy, stuffy, dead old place! I can\u0027t stand for being buried down here much longer. And, oh, Larry, I\u0027m going to begin to work with you!” \n \n “What?” he blinked, not yet quite understanding. \n \n “You think I\u0027m not clever enough? But I am!” she protested. “I tell you I\u0027ve learned a lot. And Barney and father have let me help in a lot of things—nothing really big yet, of course. They think I\u0027m going to be a wonder. Just to-day father was saying that you and I, teamed up—Why, what\u0027s the matter, Larry?” \n \n “You and I—teamed up,” he repeated slowly. \n \n “Yes. Don\u0027t you like the idea?” \n \n His hands suddenly gripped her bare shoulders. \n \n “There\u0027s nothing to it!” he exclaimed almost savagely. \n \n “What\u0027s that?” she cried, startled. \n \n “I tell you there\u0027s nothing to it!” \n \n “You—you think I can\u0027t put it over?” \n \n “You can\u0027t! And I\u0027m not going to have it!” \n \n “Why—why—” \n \n Staring, she drew slowly away from him. His face, which a few moments before had been smiling, was now harsh and dominant with decision. She had heard him spoken of as “Laughing Larry”; and also as “Terrible Larry” whose aroused will none could brook. He looked this latter person now, and she could not understand. \n \n But though she could not understand, her own defiant spirit stormed up to fight this unexpected opposition. He didn\u0027t believe in her—that was it! He didn\u0027t think she was equal to working with him! Her young figure stiffened in angered pride, and her mind was gathering hot phrases to fling at him when the door from the pawnshop began to creak open. Instantly Larry turned toward it, relaxed and yet alert for anything. Old Jimmie and Barney Palmer entered. \n \n “Hello, Larry!” cried the old man, crossing. “Welcome to our city!” \n \n “Hello, Jimmie. Hello, Barney.” And Larry shook hands with his partners of other days. \n \n “Gee, Larry, it\u0027s good to see you!” exclaimed the cunning-eyed old man. “Didn\u0027t know you were back till I bumped into Gavegan on Broadway. He told me, and so Barney and I beat it over here to see you. Believe me, Larry, that flatfoot is certainly sore at you!” \n \n Larry ignored the last sentence. “Think it exactly wise for you two to come here?” \n \n “Why, Larry?” \n \n “Gavegan, Casey, the police, may follow, thinking you\u0027ve come to see me for some purpose. That outfit may act upon suspicion.” \n \n Jimmie grinned cunningly. “A man can come to visit his own daughter as often as he likes. Father love, Larry.” \n \n “I see; that\u0027ll be your explanation.” Larry\u0027s eyes grew keen at the new understanding. “I hadn\u0027t thought of that before, Jimmie. So that\u0027s why you\u0027ve always boarded Maggie around in shady joints: so\u0027s you could meet your pals and yet always have the excuse that you had come to meet your daughter?” \n \n “Partly that,” smiled Old Jimmie blandly—perhaps too blandly. “Suppose we sit down.” \n \n They did so, Maggie sitting a little apart from the men and regarding Larry with indignant, questioning eyes. She still could not understand his queer behavior when she had announced her intention of working with him. Could it be, as her father had said, because he would never work with women—not trusting them? She\u0027d show him! \n \n She was so occupied with this wonderment that she gave no heed to the talk about Larry\u0027s experience in Sing Sing and Old Jimmie\u0027s recital of what had happened among Larry\u0027s friends during his absence. During this gossip the Duchess entered from the stairway, and without word to any one shuffled across to her desk in a corner and bent silently over her accounts: just one more grotesque and unredeemed pledge in this museum of antiquities and forgotten pawns. \n \n Presently Barney Palmer, who had been impatient during all this, broke out with: \n \n “Aw, let\u0027s cut out this chatter about what used to be and get down to cases. Jimmie, will you spill the business to Larry, or want me to?” \n \n “I\u0027ll tell him. Listen, Larry.” Maggie pricked up her ears; the talk was now excitingly important. “We\u0027ve got our very greatest game all planned out. Stock-selling game; going to unload the whole thing on one sucker, and we\u0027ve got the sucker picked out. Besides you and Barney and me, there\u0027s Red Hannigan and Jack Rosenfeldt in it—a classy bunch all right. And we think that for the woman end we\u0027ll take in Mae Gorham. She\u0027s clever and innocent-eyed—” \n \n “But I thought you were going to take me in!” protested Maggie. \n \n “Maggie\u0027ll be just as good as Mae Gorham,” put in Barney. \n \n “We\u0027ll let that pass,” said Old Jimmie. “The main thing, Larry, is that everything is ready. It\u0027s a whale of a business proposition. We\u0027ve been waiting for you; you\u0027re all that\u0027s lacking—the brainy guy to sit behind the scenes and manage the thing. You\u0027ve handled the bunch for a long time, and they want you to handle this. For you\u0027re sure a wonder at business, Larry! None keener. Well, we\u0027ve held this off waiting for you for a month. How about jumping right in?” \n \n All three eyed Larry. His lean face was expressionless. He lit a cigarette, rose and leaned against the Duchess\u0027s safe on which stood the green parrot, and, gaze on the floor, slowly exhaled smoke through his nostrils. \n \n “Well?” demanded Barney. \n \n Larry looked at the two men with quiet, even eyes. “Thanks to both of you. It\u0027s a great compliment. But I\u0027ve had time to do a little planning myself up in Sing Sing, and I\u0027ve worked out a game that\u0027s got this one beat a mile.” \n \n “Hell!” ejaculated Barney in wrathful disgust. “Jimmie, I told you we were wasting time waiting for him!” \n \n “Hold on a second, Barney. If Larry\u0027s worked out a better game, he\u0027ll take us into it. But, Larry, how can your game beat this one?” \n \n “Because there\u0027s more money in it. And because it\u0027s safer.” \n \n “Safe! Aw, hell!” The smouldering jealousy and hatred glared out of Barney\u0027s greenish eyes. “I always knew you had a yellow streak! Something safe! Aw, hell!” \n \n “Don\u0027t blow up, Barney. What is the new game, Larry?” queried the old man. \n \n Larry regarded the two men steadfastly. He seemed reluctant to speak. \n \n “Well?” prompted Old Jimmie. “Is it something you don\u0027t want to let us in on?” \n \n “Of course I\u0027ll let you in on it, and be glad to, if you want to come in,” Larry replied in his level tone. “As I said, I\u0027ve thought it all out and it\u0027s a great proposition. Here\u0027s the game: I\u0027m going to run straight.” \n \n For a moment all three sat astounded by this quiet statement from their leader. Nothing he might have said could have been more unexpected, more stupefying. The Duchess alone moved; she turned her head and held her sunken eyes upon her grandson. \n \n Simultaneously the two men and Maggie stood up. \n \n “The hell you say!” grated Barney Palmer. \n \n “Larry, you gone crazy?” cried Old Jimmie. \n \n Maggie moved a pace nearer him. “Going to go straight?” she asked incredulously. \n \n “Listen, all of you,” Larry said quietly. “No, Jimmie, I\u0027ve not gone crazy. I\u0027m merely going a little sane. You just said I was a wonder at business, Jimmie. I think I am myself. I thought it all over as a business proposition. Suppose we clean up fifty or a hundred thousand on a big deal. We\u0027ve got to split it several ways, perhaps pay a big piece to the police for protection, perhaps pay a lot of lawyers, and then perhaps get sent away for a year or several years, during which we don\u0027t take in a nickel. I figured that over a term of years my average income was mighty small. As a business man it seemed to me that I was in a poor business, with no future. So I decided to get into a new business that had a future. That\u0027s the size of it.” \n \n “You\u0027re turning yellow—that\u0027s the real size of it!” snarled Barney Palmer, half starting toward him. \n \n “Better be a little careful, Barney,” Larry warned with tightening jaw. \n \n “You really mean, Larry,” demanded Old Jimmie, “that you\u0027re going to drop us after us counting on you and waiting for you so long?” \n \n “I\u0027m sorry about having kept you waiting, Jimmie. But we\u0027ve parted definitely.” Then Larry added: “Unless you want to travel my road.” \n \n “Your road! Never!” snapped Barney. \n \n “And you, Jimmie?” Larry inquired, his eyes on Barney\u0027s inflamed face. \n \n “I don\u0027t see your proposition. And I\u0027m too old a bird to start something new. No, thanks. I\u0027ll stick to what I know.” \n \n His next words, showing his long yellow teeth, were spoken slowly, but they were hard, and had a cutting edge. “You\u0027ve got a sweet idea of what\u0027s straight, Larry: dropping us without a leader, just when we need a leader most.” \n \n Larry\u0027s composed yet watchful gaze was still on Barney. “You\u0027re not really left in such a bad way. Barney here is ready to take charge.” \n \n “You bet I am!” Barney flamed at him, his hands clenching. “And the bunch won\u0027t lose by the change, you bet! The bunch always thought you were an ace—and I always knew you were a two-spot. And now they\u0027ll see I was right—that you were always yellow!” \n \n Larry still leaned against the safe in the same posture of seeming ease, but he expected Barney to strike at any moment, and held himself in readiness for a flashing fist. Barney had been hard to hold in leash in the old days; now that all ties of partnership were broken, he saw in those small gleaming eyes a defiance and a hatred that henceforth had no reason for restraint. And he knew that Barney was shrewd, grimly tenacious, and limitless in self-confidence and ambition. \n \n “And listen to this, too, Larry Brainard,” Barney\u0027s temper carried him on. “Don\u0027t you mix in and try any preaching on Maggie.” He half turned his head jealously. “Maggie, don\u0027t you listen to any of this boob\u0027s Salvation Army talk!” \n \n Maggie did not at once respond, but stood gazing at the two confronting figures. To her they were an oddly dissimilar pair: Barney in the smartest clothes that an over-smart Broadway tailor could create, and Larry in the shapeless garments that were the State\u0027s gift to him on leaving prison. \n \n “Maggie,” he repeated, “don\u0027t you listen to this boob\u0027s talk!” \n \n “I\u0027ll do just as I please, Barney.” \n \n “But you\u0027re going to come our way?” he demanded. \n \n “Of course.” \n \n He turned back to Larry. “You hear that? You leave Maggie alone!” \n \n Larry did not answer, though his temper was rising. He looked over Barney\u0027s head at Maggie\u0027s father. \n \n “Jimmie,” he remarked in his same even voice, “anything more you\u0027d like to say?” \n \n “I\u0027m through.” \n \n “Then,” said Larry, “better lead your new commander-in-chief out of here, or I\u0027ll carry him out and spank him.” \n \n “What\u0027s that?” snarled Barney. \n \n “Get out!” Larry ordered, in a voice suddenly like steel. \n \n Barney\u0027s fist swung viciously at Larry\u0027s head. It did not land, because Larry\u0027s head was elsewhere. Larry did not take advantage of the opening to strike back, but as the fist flashed by he seized the wrist, and in the same instant he seized the other wrist. The next moment he held Barney helpless in a twisting, torturing grip that he had learned from one of his non-Christian friends at the Y.M.C.A. \n \n “Barney—are you going to walk out, or shall I kick you out?” \n \n Barney\u0027s answer came after a moment through gritted teeth: “I\u0027ll walk out—but I\u0027ll get you for this!” \n \n “I know you\u0027ll try, Barney. And I know you\u0027ll try to get me behind my back.” Larry loosed his grip. “Good-night.” \n \n Barney backed glowering to the door; and Old Jimmie, his gray face an expressionless mask, silently followed him out. \n \n All this while the Duchess had looked on, motionless in her corner, a dingy, forgotten part of the dingy background—no more noticeable than one of her own dusty, bizarre pledges. \n \n \n","sourceLink":"http://novel.tingroom.com/ertong/2142/60564.html","bookId":618,"book":{"id":618,"title":"Children of the Whirlwind","description":"简介： It was an uninspiring bit of street: narrow, paved with cobble; hot and noisy in summer, reeking with unwholesome mud during the drizzling and snow-slimed months of winter. It looked anything this May after noon except a starting-place for drama. But...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2142","creation":"Aug 1, 2019 12:19:03 AM","modification":"Aug 1, 2019 12:19:03 AM"}}
