{"id":44573,"no":69,"title":"Chapter V.","content":"Of the Rainbow. \n \n Those things which affect the air in the superior places of it are of two sorts. Some have a real subsistence, such are rain and hail; others not. Those which enjoy not a proper subsistence are only in appearance; of this sort is the rainbow. Thus the continent to us that sail seems to be in motion. \n \n Plato says, that men admiring it feigned that it took origination from one Thaumas, which word signifies admiration. Homer sings:— \n \n Jove paints the rainbow with a purple dye, \n Alluring man to cast his wandering eye. \n (Iliad, xvii. 547.) \n \n Others therefore fabled that the bow hath a head like a bull, by which it swallows up rivers. \n \n But what is the cause of the rainbow? It is evident that what apparent things we see come to our eyes in right or in crooked lines, or by refraction: these are incorporeal and to sense obscure, but to reason they are obvious. Those which are seen in right lines are those which we see through the air or horn or transparent stones, for all the parts of these things are very fine and tenuous; but those which appear in crooked lines are in water, the thickness of the water presenting them bended to our sight. This is the reason that oars in themselves straight, when put into the sea, appear to us crooked. The third manner of our seeing is by refraction, and this is perspicuous in mirrors. After this third sort the rainbow is affected. We conceive it is a moist exhalation converted into a cloud, and in a short space it is dissolved into small and moist drops. The sun declining towards the west, it will necessarily follow that the whole bow is seen opposite to the sun; for the eye being directed to those drops receives a refraction, and by this means the bow is formed. The eye doth not consider the figure and form, but the color of these drops; the first of which colors is a shining red, the second a purple, the third is blue and green. Let us consider whether the reason of this red shining color be the splendor of the sun falling upon these small drops, the whole body of light being refracted, by which this bright red color is produced; the second part being troubled and the light languishing in the drops, the color becomes purple (for the purple is the faint red); but the third part, being more and more troubled, is changed into the green color. And this is proved by other effects of Nature; if any one shall put water in his mouth and spit it out so opposite to the sun, that its rays may be refracted on the drops, he shall see the resemblance of a rainbow; the same appears to men that are blear-eyed, when they fix their watery eyes upon a candle. Anaximenes thinks the bow is thus formed; the sun casting its splendor upon a thick, black, and gross cloud, and the rays not being in a capacity to penetrate beyond the superficies. Anaxagoras, that, the solar rays being reflected from a condensed cloud, the sun being placed directly opposite to it forms the bow after the mode of the repercussion of a mirror; after the same manner he assigns the natural cause of the Parhelia or mock-suns, which are often seen in Pontus. Metrodorus, that when the sun casts its splendor through a cloud, the cloud gives itself a blue, and the light a red color. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1337/40284.html","bookId":1469,"book":{"id":1469,"title":"Concerning Nature","description":"简介： It being our determination to discourse of Natural Philosophy, we judge it necessary, in the first place and chiefly, to divide the body of philosophy into its proper members, so that we may know what is that which is called philosophy, and what part...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1337","creation":"Aug 1, 2019 12:25:11 AM","modification":"Aug 1, 2019 12:25:11 AM"}}
