{"id":109162,"no":38,"title":"Page 38","content":"Damon had stopped and was kneeling behind an enormous broken tree branch. Stefan pul ed both girls to him and caught them so that they al three landed just behind his brother.\\n\\n Elena found herself staring at a very large tree trunk. Stillas big as it was, it was nowhere near as large as she had been expecting. It was true; the four of them certainly couldn\u0027t have held hands around it. But in the back of her mind had been lurking images of moons and trees and trunks that were as tal as skyscrapers, in which a star bal could be hidden on any \"floor,\"in any \"room.\"\\n\\n This was simply a grand oak tree trunk sitting in a sort of fairy circle - perhaps twenty feet in diameter on which no dead leaf had strayed. It was a paler color than the loam they had been running on, and even sparkled in a few places. Overal , Elena was relieved.\\n\\n More, she could even see the star bal . She\u0027d feared -\\n\\n among other things - that it might be up too high to climb, that it might be so entangled with roots or branches that today, certainly after hundreds or even thousands of years, it would be impossible to chop out. But there it was, the greatest star bal that had ever been, ful y the size of a beach bal , and it nestled freely in the first crutch of the tree.\\n\\n Her mind was racing ahead. They\u0027d done it; they\u0027d found the star bal . But how much time would it take to get it back to where Sage was? Automatical y, she glanced at her compass and saw to her surprise that the needle now pointed southwest - in other words, back to the Gatehouse.\\n\\n That was a thoughtful touch of Sage\u0027s. And perhaps they didn\u0027t have to go through the trials backward; they could simply use their Master Key to go back to Fel \u0027s Church, and then...Well, Mrs. Flowers would know what to do with it.\\n\\n If it came to that, maybe they could just blackmail Her, whoever She was, to go away forever in exchange for the star bal . Although - could they live with the thought that she might do this again - and again - and again to other towns?\\n\\n Even as she planned, Elena watched the expressions of her comrades: the childlike wonder on Bonnie\u0027s heart-shaped face; the keen assessment in Stefan\u0027s eyes; Damon\u0027s dangerous smile.\\n\\n They were viewing their hard-won reward, at last.\\n\\n But she couldn\u0027t look for too long. Things had to be done.\\n\\n Even as they watched, the star bal brightened, showing such bril iant, incandescent colors that Elena was half-blinded.\\n\\n She shielded her eyes just as she heard Bonnie inhaling sharply.\\n\\n \"What?\"Stefan asked, a hand in front of his eyes, which, of course were much more sensitive to light than human eyes.\\n\\n \"Someone\u0027s using it right now!\"Bonnie replied. \"When it went bright like that, it sent out Power! A long, long way out!\"\\n\\n \"Things are heating up in what\u0027s left of poor old Fel \u0027s Church,\"said Damon, who was staring intently upward at the branches above him.\\n\\n \"Don\u0027t talk about it like that!\"Bonnie exclaimed. \"It\u0027s our home. And now we can final y defend it!\"Elena could practical y see what Bonnie was thinking: families embracing; neighbors smiling at neighbors again; the entire town working to fix the destruction.\\n\\n This is how great tragedies sometimes happen. People with a single goal, yet who are not in sync. Assumptions.\\n\\n Presumptions. And, maybe, most important of al , the failure to sit down and talk.\\n\\n Stefan tried, even though Elena could see that he was Stillblind from the bril iance of the star bal . He said quietly, \"Let\u0027s talk this over for a while and brainstorm ways to get it - \"\\n\\n But Bonnie was laughing at him, though not unkindly. She said, \"I can get up there as fast as a squirrel. Al I need is someone strong to catch it when I knock it down. I know I can\u0027t climb down with it; I\u0027m not that sil y. Come on, you guys, let\u0027s go!\"\\n\\n That\u0027s how it happened. Different personalities, different modes of thinking. And one laughing, light-headed girl, who didn\u0027t have a precognition when it was needed.\\n\\n Elena, who was envying Meredith the fighting stave, didn\u0027t even see the beginning. She was watching Stefan, who was blinking rapidly to get his eyesight back.\\n\\n And Bonnie was scrambling as lightly as she had boasted, up on top of the dead tree branch that sheltered them. She even gave them a little laughing salute just before she leaped into the barren, sparkling circle around the tree.\\n\\n Then microseconds stretched infinitely. Elena felt her eyes slowly getting wider, even though she knew they were flying open. She saw Stefan leisurely reach across her to try to twine his fingers around Bonnie\u0027s leg, even though she knew that what she was seeing was a lightning-fast grab for the petite girl\u0027s ankle. She even heard Damon\u0027s instantaneous telepathy: No, little fool! as if he were speaking the words in his accustomed lazy tones of superiority.\\n\\n Then, Stillin slow motion, Bonnie\u0027s knees bent and she launched into the air above the circle.\\n\\n But she never touched the ground. Somehow, a black streak, stunningly fast even in the slow-motion horror film that Elena was watching, landed where Bonnie would have landed. And then Bonnie was being thrown, being hurled too fast for Elena\u0027s eyes to track, outside of the barren circle and then there was a dul thud - too fast for Elena\u0027s mind to track as being Bonnie\u0027s landing.\\n\\n Quite clearly, she heard Stefan cry \"Damon!\"in a terrible voice. And then Elena saw the thin dark objects - like curving lances - that were already shooting downward. Another thing her eyes couldn\u0027t fol ow. When her vision adjusted, she saw that they were long, curved black branches, spaced evenly around the tree like thirty spider legs, thirty long spears that were meant to either imprison someone inside them like the bars of a cel , or to - pin them into the strange sand beneath her feet.\\n\\n \"Pin\"was a good word. Elena liked the sound of it. Even as she was staring at the sharp recurved barbs on the branches, meant to keep anything caught by them held permanently in the ground, she was thinking of Damon\u0027s annoyance if a shaft had pierced his leather jacket. He would curse at them, and Bonnie would try to pretend he hadn\u0027t - and...\\n\\n She was close enough by now to see that it wasn\u0027t as simple as that. The branch, which was proper javelin size, had gone through Damon\u0027s shoulder, which must hurt like hel , in addition to having splattered a blood drop right at the corner of his mouth. But far more annoying than that was the fact that he had closed his eyes against her. That was how Elena thought of it. He was shutting them out deliberately - maybe because he was angry; maybe because of the pain in his shoulder. But it reminded her of the steel wal feeling she\u0027d gotten the last time she\u0027d tried to touch his mind - and, damn, couldn\u0027t he tell he was scaring them?\\n\\n \"Open your eyes, Damon,\"she said, flushing, because that was what he wanted her to say. He real y was the greatest manipulator of al . \"Open your eyes, I said!\"Now she was real y irritated. \"Don\u0027t play possum, because you\u0027re not fooling anyone, and we\u0027ve real y had enough!\"She was about to shake him hard when something lifted her into the air, into Stefan\u0027s line of vision.\\n\\n Stefan was in pain, but surely not as badly as Damon, so she was looking back to curse Damon when Stefan said harshly,\\n\\n \"Elena, he can\u0027t!\"\\n\\n For just the tiniest fleeting instant the words sounded like nonsense to her. Not only garbled, but meaningless, like saying someone couldn\u0027t stop their appendix from doing -\\n\\n whatever it was an appendix did. That was al the respite that she got, and then she had to deal with what her eyes were showing her.\\n\\n Damon wasn\u0027t pinned by his shoulder. He\u0027d been staked, just slightly to the left of center of his torso.\\n\\n Exactly where his heart was.\\n\\n Words drifted back to her. Words that someone had once said - although she couldn\u0027t remember who right now. \"You can\u0027t kill a vampire so easily. We only die if you stake us through the heart....\"\\n\\n Die? Damon die? This was some kind of mistake...\\n\\n \"Open your eyes!\"\"Elena, he can\u0027t!\"\\n\\n But she knew, without knowing how, that Damon wasn\u0027t dead. She wasn\u0027t surprised that Stefan didn\u0027t know it; it was a hum on a private frequency between her and Damon.\\n\\n \"Come on, hurry, give me your axe,\"she said, so desperately, and with such an air of knowledge that Stefan handed it over wordlessly, and obeyed when she told him to steady the curving spider-leg branch from above and below. Then with a few quick strokes of the axe she cut through the black branch that was thick enough in circumference that she couldn\u0027t have clasped her fingers around it. It was done in a spurt of pure adrenaline, but she knew it awed Stefan and al owed him to let her continue doing it.\\n\\n When she was finished, she had a loose spider-leg branch that drooped back to the tree, anchored to nothing - and something that looked more like a proper stake in Damon.\\n\\n It wasn\u0027t until she began pul ing upward on the stake that a horrified Stefan made her stop.\\n\\n \"Elena! Elena, I wouldn\u0027t lie to you! This is just what these branches are for. For intruders who are vampires. Look, love - see.\"He was showing her another of the spider legs that was anchored in the sand, and the barbs on it. Just like the backward-facing tines of a primitive stone arrowhead.\\n\\n \"These branches are meant to be like this,\"Stefan was saying. \"And if you pul ed up on it hard enough, you\u0027d just -\\n\\n just end up pul ing out chunks of - his heart.\"\\n\\n Elena froze. She wasn\u0027t sure she real y could understand the words - she couldn\u0027t al ow herself to, or she might picture it.\\n\\n But it didn\u0027t matter.\\n\\n \"I\u0027l destroy it some other way,\"she said shortly, looking at Stefan but not able to see the true green of his eyes because of the olive light. \"You wait. Just wait and watch. I\u0027l find a Wings power that wil dissolve this - this - damned abomination.\"She could think of many other words to cal the stake, but she had to stay in some sort of control.\\n\\n \"Elena.\"Stefan whispered her name as if he could barely get it out. Even in the twilight she could see the tears on his cheeks. He continued, nonverbal y, Elena, look at his closed eyes. This Tree is a vicious killer, with wood like nothing I\u0027ve ever seen, but I\u0027ve heard about it. It\u0027s...it\u0027s spreading. Inside him.\\n\\n \"Inside him?\"Elena repeated stupidly.\\n\\n Along his arteries and veins - and his nerves - everything connected to his heart. He\u0027s - oh, God, Elena, just look at his eyes!\\n\\n Elena looked. Stefan had knelt and gently pul ed up the lids of Damon\u0027s eyes and Elena began screaming.\\n\\n Deep in the fathomless pupils that had held endless night skies ful of stars, there was a glimmer - not of starlight, but of green. It seemed to glow with its own hel ish luminescence.\\n\\n Stefan looked at her with agony and compassion. And now, with one gentle pass, Stefan was closing those eyes - forever, she knew he was thinking.\\n\\n Everything had become strange and dreamlike. Nothing made sense anymore. Stefan was careful y laying Damon\u0027s head down - he was letting Damon go.\\n\\n Even in her fuzzy world of nonsense Elena knew she could never do that.\\n\\n And then, a miracle happened. Elena heard a voice in her mind that wasn\u0027t hers.\\n\\n All this is rather unexpected. I acted, for once, without thinking. And this is my reward. The voice was a hum on their private frequency, Damon\u0027s and hers.\\n\\n Elena ripped herself away from Stefan, who was trying to restrain her, and fel , grasping Damon\u0027s shoulders with her hands. I knew it! I knew you couldn\u0027t be dead!\\n\\n It was only then that she realized that her face was dripping wet, and she used her soft leather sleeve to wipe it. Oh, Damon, you gave me such a scare! Don\u0027t you ever, ever do that again!\\n\\n I think I can give my word on that, Damon sent - in different tones than his usual ones - sober but at the same time whimsical. But you have to give me something in return.\\n\\n Yes, of course, Elena said. Just let me get some of my hair off my neck. It worked best like this when Stefan was lying down - when we were carrying him out on his pallet from the prison -\\n\\n Not that, Damon told her. For once, angel, I don\u0027t want your blood. I need you to give me your most solemn word that you will try to be brave. If it helps at all, I know that females are better than males at this sort of thing. They\u0027re less cowardly at facing - what you have to face now.\\n\\n Elena didn\u0027t like the tone of these words. The dizziness that was making her lips numb was traveling al over her body.\\n\\n There was nothing to be brave about. Damon could stand pain. She would find a Wings power that would obliterate al that wood that was poisoning him. It might hurt, but it would save his life.\\n\\n Don\u0027t talk to me like that! she snapped harshly, before she could remember to be gentle. Everything had begun to float, and she couldn\u0027t even remember why she had to be gentle, but there was a reason. Still, it was difficult, when she was using every ounce of her concentration and strength to search for a Wings power she had never heard of.\\n\\n Purification? Would that take away the wood or would it just leave Damon without his wicked smile? There was no harm in trying it, anyway, and she was getting desperate -\\n\\n because Damon\u0027s face was so pale.\\n\\n But even the stance for Wings of Purification eluded her.\\n\\n Suddenly, a huge shudder - a convulsion - went through Damon\u0027s entire body. Elena heard broken words behind her.\\n\\n \"Love, love - you real y have to let him go. He\u0027s living in - in intolerable pain, just because you\u0027re keeping him here,\"the voice said, and it was Stefan\u0027s. Stefan, who would never lie to her.\\n\\n For just an instant Elena wavered, but then a blazing rage came rushing up through her body. It gave her the strength to cry hoarsely, \"I... won\u0027t! I won\u0027t ever let him go! Damn you, Damon, you have to fight! Let me help you! My blood - it\u0027s special. It\u0027l give you strength. You drink it!\"\\n\\n She fumbled for her knife. Her blood was magical. Maybe if she gave enough, it would give Damon the strength to fight off the wooden fibers that were Stillspreading through his body.\\n\\n Elena slashed at her throat. Maybe subconsciously she avoided doing more than nicking her carotid artery, but if so it was entirely subconsciously. She simply reached down, found a metal knife, and with one sweep set the blood to gushing out. Bright red arterial blood, that even in the semi-darkness was the color of hope.\\n\\n \"Here, Damon. Here! Drink this. As much as you want - al you need to heal yourself.\"She got into the best position that she could, hearing but not hearing Stefan\u0027s horrified gasp behind her at the recklessness of her slashing, not heeding his grip on her.\\n\\n But - Damon didn\u0027t drink. Not even the heady blood of his Princess of Darkness - and how did the phrase go? It was like rocket fuel compared to the gasoline found in other girls\u0027veins. Now it just ran out of the sides of his mouth. It flowed onto his pale face, soaking his black shirt and pooling in his leather jacket.\\n\\n No...\\n\\n Damon, Elena sent, please. I\u0027m - begging you. Please. I\u0027m begging you for me, for Elena. Please drink. We can do this - together.\\n\\n Damon didn\u0027t move. Blood spil ed into the mouth she\u0027d opened and it fil ed and spil ed out again. It was as if Damon were taunting her, saying, \"You wanted me to give up human blood? Well, I have - forever.\"\\n\\n Oh, dear God, please...\\n\\n Elena was dizzier than ever now. Outside events passed dimly around her, like an ocean that only slightly bobbed a person out deep in the swell s. She was entirely focused on Damon.\\n\\n But one thing she did feel. Her bravery - Damon had been wrong about that. Huge sobs were rising from somewhere deep inside her. She had made Stefan let go of her and now she couldn\u0027t hold herself up any longer.\\n\\n She fel right on top of her blood and Damon\u0027s body. Her cheek fel against his cheek.\\n\\n And his cheek was cold. Even under the blood, it was cold.\\n\\n Elena never knew when the hysterics began. She simply found herself shrieking and sobbing, beating on Damon\u0027s shoulders, cursing him. She had never properly cursed him before, not directly to his face. As for the shrieking, that wasn\u0027t just a sound. She was once again screaming at him to find some way to fight.\\n\\n And final y, she began the promises. Promises that deep in her heart, she now knew were lies. She was going to find a way to fix him in a moment. She already felt a new Wings power coming to save him.\\n\\n Anything so as to not face the truth.\\n\\n \"Damon? Please?\"It was an interlude in the shrieking, when she was talking softly in her new husky, hoarse voice.\\n\\n \"Damon, just do one thing for me. Just squeeze my hand. I know you can do that. Just squeeze one of my hands.\"\\n\\n But there was no pressure on either of her hands. Only blood that was turning sticky.\\n\\n And then the miracle happened and she once again heard Damon\u0027s voice - very faintly - in her head.\\n\\n Elena? Don\u0027t...cry, darling. It\u0027s not...as bad as Stefan said. I don\u0027t feel much of anything, except on my face. I...feel your tears. No more weeping...please, angel.\\n\\n Because of the miracle, Elena steadied herself. He\u0027d cal ed Stefan \"Stefan\"and not \"little brother.\"But she had other things to think about right now. He could Stillfeel things on his face! This was important information, valuable information.\\n\\n Elena immediately cupped his cheeks with her hands and kissed him on the lips.\\n\\n I just kissed you. I\u0027m kissing you again. Can you feel that?\\n\\n Forever, Elena, Damon said. I\u0027ll...take that with me. It\u0027s part of me now...do you see?\\n\\n Elena didn\u0027t want to see. She kissed his lips - icy cold - again. And again.\\n\\n She wanted to give him something else. Something good to think about. Damon, do you remember when we first met?\\n\\n At school, after the lights went out, when I was measuring for the Haunted House decorations. I almost let you kiss me then - before I even knew your name - when you just came drifting out of the darkness.\\n\\n Damon surprised her by answering immediately. Yes...and you...you astonished me by being the first girl I couldn\u0027t Influence right away. We had...fun together - didn\u0027t we?\\n\\n Some good times? We went to a party...and we danced together. I\u0027ll take that with me too.\\n\\n Through her daze, Elena had one thought. Don\u0027t confuse him anymore. They\u0027d gone to that \"party\"only to save Stefan\u0027s life.\\n\\n She told him, We had fun. You\u0027re a good dancer. Imagine us waltzing!\\n\\n Damon sent slowly, fuzzily, I\u0027m sorry...I\u0027ve been so horrible lately. Tell...her that. Bonnie. Tell her...\\n\\n Elena steadied herself. I\u0027ll tell her. I\u0027m kissing you again.\\n\\n Can you feel me kissing you?\\n\\n It was a rhetorical question, so she got a shock, when Damon only answered slowly and sleepily. Did I...take a vow to tell you the truth?\\n\\n Yes, Elena lied instantly. She needed the truth from him.\\n\\n Then...no, to be honest...I can\u0027t. I don\u0027t seem to have...a body now. It\u0027s comfortable and warm, and nothing hurts anymore. And - I almost feel as if I\u0027m not alone. Don\u0027t laugh.\\n\\n You\u0027re not alone! Oh, Damon, don\u0027t you know that? I\u0027ll never, ever let you be alone. Elena choked, wondering how to make him believe her. Just for a few more seconds...now.\\n\\n Here, she sent in a telepathic whisper, I\u0027ll give you my precious secret. I\u0027ll never tell anyone else. Do you remember the motel we stayed in on our road trip, and how everyone - even you - wondered what happened that night?\\n\\n A...motel? A road trip? He was sounding very unsure now.\\n\\n Oh...yes. I remember. And...the next morning - wondering.\\n\\n Because Shinichi took your memories, Elena said, hoping that hateful name would revivify Damon. But it didn\u0027t. Like Shinichi, Damon was done with the world now.\\n\\n Elena leaned her cheek against his cold and bloody one. I held you, darling, just like this - well, almost like this. All night. That was all you wanted, to not feel alone.\\n\\n There was a long pause and Elena began to panic in the few parts of her that were not numb or already hysterical. But then the words came slowly to her.\\n\\n Thank you...Elena. Thank you...for telling me your precious secret.\\n\\n Yes, and I\u0027ll tell you something even more precious. No one is alone. Not really. No one is ever alone.\\n\\n You\u0027re with me...so warm...nothing to worry about anymore...\\n\\n Nothing more, Elena promised him. And I\u0027ll always be with you. No one is alone; I promise it.\\n\\n Elena...things are beginning to feel strange now. Not pain.\\n\\n But I have to tell you...what I know you already know.... How I fell in love with you...you\u0027ll remember, won\u0027t you? You won\u0027t forget me?\\n\\n Forget you? How could I ever forget you?\\n\\n But Damon was speaking on and suddenly Elena knew that he couldn\u0027t hear her, not even by telepathy anymore.\\n\\n Will you remember? For me? Just that...I loved once - just once, really, in my whole life. Can you remember that I loved you? That makes my life...worth...something... His voice faded.\\n\\n Elena was so dizzy now. She knew she was Stilllosing blood fast. Too fast. Her mind was not sharp. And she was suddenly shaken by a fresh storm of sobbing. At least she would never yel again - there was no one to yel at. Damon had gone away. He had run away without her.\\n\\n She wanted to fol ow. Nothing was real. Didn\u0027t he understand? She could not imagine a universe, no matter how many dimensions there were, without a Damon in it.\\n\\n There was no world for her, if there was no Damon.\\n\\n He couldn\u0027t do this to her.\\n\\n Neither knowing nor caring what she was doing, she plunged deep, deep into Damon\u0027s mind, wielding her telepathy like a sword, slashing at the wooden connections that she found everywhere. And, at last, she found herself plunging into the very deepest part of him...where a little boy, the metaphor for Damon\u0027s unconscious, had once been loaded with chains and set to guard the great stone that Damon kept his feelings locked in.\\n\\n Oh, God, he must be so frightened, she thought. Whatever the cost, he must not be al owed to go away frightened....\\n\\n Now she saw him. The child-Damon. As always, she could see in the sweetly rounded face, the sharp-cheekboned young man that Damon would become, in the wide black eyes, the potential for his look of fathomless darkness.\\n\\n But although he was not smiling, the child\u0027s look was open and welcoming, in a way that Damon\u0027s older self had never been. And the chains...the chains were gone. The great stone was gone too.\\n\\n \"I knew you\u0027d come,\"the boy whispered, and Elena took him into her arms.\\n\\n Easy, Elena told herself. Easy. He\u0027s not real. He\u0027s what\u0027s left of Damon\u0027s mind, the deepest part of his hindbrain. But Still, he\u0027s even younger than Margaret, and he\u0027s just as soft and warm. No matter what, please God, don\u0027t let him know what\u0027s real y happening to him.\\n\\n But there was knowledge in the wide, dark child eyes that turned up to her face. \"I\u0027m so glad to see you,\"he confided. \"I thought that I might never talk to you again. And - he - you know - he left some messages with me. I don\u0027t think he could say anything more, so he sent them to me.\"\\n\\n Elena understood. If there was anywhere the wood had not reached, it was into this last part of the brain, the most primitive part. Damon Stillcould speak to her - through this infant.\\n\\n But before she could speak herself, she saw that there were tears in the child\u0027s eyes and then his body spasmed and he bit his lip very hard - to keep from crying out, she guessed.\\n\\n \"Does it hurt?\"she asked, trying to believe that it didn\u0027t.\\n\\n Desperate to believe it.\\n\\n \"Not so much.\"But he was lying, she realized. Still, he hadn\u0027t shed any tears. He had his pride, this child-Damon.\\n\\n \"I have a special message for you,\"he said. \"He told me to tel you that he\u0027l always be with you. And that you\u0027re never alone. That no one is real y alone.\"\\n\\n \\n\\n \\n\\n","sourceLink":"https://allnovel.net/the-return-midnight-the-vampire-diaries-3/page-38.html","bookId":2037,"book":{"id":2037,"title":"The Return: Midnight (The Vampire Diaries #3)","description":"Storyline: Midnight (The Vampire Diaries: The Return, #3) \\n With the help of charming and devious Damon, Elena rescued her vampire love, Stefan, from the depths of the Dark Dimension. But neither brother returned unscathed. Stefan is weak from his long imprisonment and needs more blood than Elena alone can give him, while a strange magic has turned Damon into a human. Savage and desperate, Damon will do anything to become a vampire again—even travel back to hell. But what will happen when he accidentally takes Bonnie with him? Stefan and Elena hurry to rescue their innocent friend from the Dark Dimension, leaving Matt and Meredith to save their hometown from the dangerous spirits that have taken hold of Fell\u0027s Church. One by one, children are succumbing to demonic designs. But Matt and Meredith soon discover that the source of the evil is darker—and closer—than they ever could have imagined...\\n","cover":"https://allnovel.net/images/the-return-midnight-the-vampire-diaries-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-return-midnight-the-vampire-diaries-3.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:30:14 PM"}}
