{"id":109165,"no":42,"title":"Page 42","content":"\"It\u0027s not a problem,\"the fair ruler, Ryannen, said unexpectedly. \"We can make it so that your Mr. Tanner repel ed an apparent vampire attack and the school cal ed in Alaric Saltzman to take his place and investigate. All right, Idola?\" - to the redhead, and to the dark one - \"All right, Susurre?\" Elena wasn\u0027t All right. Despite the example she\u0027d just had of turn-on-a-dime plotting and scheming, she was scarcely listening. Al she knew was that her voice had gone husky and that tears blurred her eyes. \"And...for the Master Key - I want - \" Stefan squeezed her hand. Elena suddenly realized that they were al standing, al three of them, beside her. And the look on every face was the same. Dead resolve. \"I want Damon back.\"Elena hadn\u0027t heard quite this note in her voice since the day she\u0027d been told both her parents had died. If there had been a table, she would have put her clenched fists on it and did her best to loom over the women. As it was, she simply leaned toward them, speaking in a low and grating voice. \"If you do that - bring him back, exactly as he was before he walked into the Gatehouse - then you get the Master Key and the treasures. You say no - and you lose everything. Everything. This is non-negotiable, get it?\" She kept staring into Idola\u0027s green eyes. She refused to see dark Susurre drop her forehead onto three fingertips and begin to rub it in smal circles. She wouldn\u0027t give a glance to blond Ryannen, who was looking at her steadily, having gone into people-management mode. She stared directly into those green eyes under their wil ful eyebrows. Idola gave a little huff and shook her gorgeous head. \"Look, someone clearly has screwed up in preparing you for this interview.\"A glance at Susurre. \"The other things you\u0027ve asked for - al together, it forms a very heavy ransom. Do you understand that? Do you understand that it involves changing the memories of al the people for miles around your town, and changing them for every day of ten months? That it means changing everything in print about Fel \u0027s Church - and that there is a lot in print - not to mention other media outlets? It means begging for three human spirits and weaving flesh around them again. I\u0027m not sure we even have the personnel for this - \" Blond Ryannen put a hand on the redhead\u0027s arm. \"We have it. Susurre\u0027s women have little to do in the Nether World. I can lend you perhaps thirty percent of mine - after al , we\u0027re going to have to send up a petition to a higher Court for those spirits - \" Idola the redhead interrupted. \"All right. What I was saying is that we might just be able to manage - if you throw in the Key. However, your vampire companion - we can\u0027t give life back to the lifeless. We can\u0027t work with vampires. Once they\u0027re gone - they\u0027re gone.\" \"That\u0027s what you tell us!\"Stefan cried, trying to get in front of Elena. \"But why are we so particularly damned, of al creatures? How do you know it\u0027s impossible? Have you ever even tried? \" Red-haired Idola was making a disgusted gesture, when Bonnie interrupted, her voice shaking. \"It\u0027s ridiculous! You can rebuild a town, you can kil the person who\u0027s real y behind al Shinichi and Misao did, but you can\u0027t bring one little vampire back? You brought Elena back!\" \"Elena\u0027s death as a vampire al owed her to become the Guardian she was original y meant to be. As for the person who gave orders to Shinichi and Misao: It was Inari Saitou - Obaasan Saitou, as you knew her - and she is already dead, thanks to your friends in Fel \u0027s Church, who weakened her - and to you, who destroyed her star bal .\" \"Inari? You mean Isobel\u0027s grandma? You\u0027re saying it was her star bal in the Great Tree\u0027s trunk? That\u0027s impossible!\"Bonnie cried. \"No, it\u0027s not. It\u0027s the truth,\"blond Ryannen said simply. \"And she\u0027s dead now?\" \"After a long battle which nearly kil ed your friends. Yes - but what actual y killed her was having her star bal destroyed.\" \"So,\"dark Susurre said quietly, \"if you fol ow the curve...in a way your Damon did die to save Fel \u0027s Church from another massacre like the one on that Japanese island. He kept saying that was what he\u0027d come to the Nether World to do. Do you not think he would be...satisfied? At peace?\" \"At peace?\"Stefan spat bitterly, and Sage growled. \"Woman,\"he said, \"you obviously have never met Damon Salvatore before.\"The tone in his voice - more resonant, more threatening somehow - made Elena final y break off her staredown with the red-haired Idola. She turned and looked - - and saw the enormous room fil ed with Sage\u0027s out-spread wings. They weren\u0027t like any of her ephemeral Wings Powers. They were clearly part of Sage. They were velvety and reptilian, and, unfurled like this, they stretched from distant wal to wal , and touched the grand, golden ceiling. They also demonstrated why Sage didn\u0027t usual y wear shirts. He was beautiful this way, bronze skin and hair against those giant, leathery soft-looking arches. But Elena, after one look at him, knew that the time had come to play the ace up her sleeve. She turned around to meet Idola\u0027s green gaze squarely. \"Al this time we\u0027ve been bargaining for a Gatehouse ful of treasures,\"she said, \"and - one Master Key.\" \"A Master Key, stolen by the kitsune ages upon ages ago,\"Susurre explained quietly, lifting her dark eyes. \"And you\u0027ve said that it\u0027s not enough for you to bring Damon back.\"Elena forced her voice not to waver. \"Not even if it were your only request.\"Ryannen tossed a golden lock of hair over her shoulder. \"So you say. But...what if I throw into the pot...another Master Key?\" There was a pause, and Elena\u0027s heart began to pound in sick terror. Because it was the wrong kind of pause. There were no shocked gasps. No astonished glances from one Guardian ruler to another. No looks of disbelief. After another moment Idola said smugly, \"If you mean the other stolen key that your friends had on Earth - it was confiscated as soon as they hid it. It was stolen property. It belonged to us.\" She\u0027s been here too long, in the Dark Dimensions, Elena thought with one part of her mind. She\u0027s enjoying herself. Idola leaned toward her, as if to confirm Elena\u0027s guess. \"It - simply - is not - possible,\"she said emphatical y. \"Real y, it isn\u0027t,\"the fair Ryannen added briskly. \"We don\u0027t know what happens to vampires. But they don\u0027t pass through our purview. We never see them after death. The simplest explanation is that they just - go out.\"She snapped her fingers. \"I don\u0027t believe that!\" Elena was aware that her voice had risen in volume. \"I don\u0027t believe that for one moment!\" Voices, not attached to anyone in particular, burst into a clamor of argument around Elena, forming a sort of poem: Not possible. It\u0027s simply not possible! ( But please...) No! Damon is gone, and to ask where is like asking where a candle flame goes when it\u0027s blown out. ( But shouldn\u0027t you try to bring him back, at the least? ) Whatever has happened to gratitude? You four should be grateful that the other things you asked for can be done. ( But in exchange for both Master Keys - ) No Power we can command could bring Damon back! Elena must try to reconcile herself to reality. She has been pampered too much already! ( But what harm can it do to try again? ) All right! If you must know, Susurre has already forced us to try. And nothing came of it! Damon...is...gone! His spirit was nowhere to be found in the ether! That is what happens to vampires, and everyone knows it! Elena found herself looking down at her own hands, which were very clean but with broken nails and every knuckle bleeding. The outside world had become unreal again. She was inside herself, struggling with her grief, struggling with the knowledge that Idola, the central ruler of Guardians, hadn\u0027t even mentioned before that they had looked for Damon\u0027s spirit. And that it was...gone. Suddenly, the room was pressing in on her. There wasn\u0027t enough air. There were only these women: these powerful, magical Guardian women; who Stilldid not have enough power or magic to save Damon - or at least didn\u0027t even care enough to try twice. She wasn\u0027t sure what was happening to her. Her throat felt puffed out, her chest was both huge and tight. Each heartbeat sounded through her as if trying to shake her to death. To death. In her mind\u0027s eye, she saw a hand hold up a glass of Clarion Loess Black Magic. And then, Elena knew that she had to stand a certain way, and hold her arms a certain way, and whisper certain words in her own mind. But the last, the naming of the spel , had only to be said aloud at the end. At the end - when things slowed. When green-eyed Idola - what a perfect name for someone who idolized herself, Elena thought - and fair businesslike Ryannen and nurturing Susurre - al stared at her with open mouths, too shocked to move even a finger as, quietly and calmly, Elena said, \"Wings of Destruction - \" It was a soldier, just an ordinary one of the rank and file, one of the dark women, who stopped it. She leaped up onto the dais, and, with inhuman speed, slapped her hand over Elena\u0027s mouth, so that the final syl able was a mumble, and the golden, green, and blue hal did not explode into fragments with hot metal running in rivulets like lava, and the flower-fountain did not vaporize, and the stained-glass windows didn\u0027t shatter into atoms. Then there were more arms around Elena, holding her down, scarcely letting her breathe, even when she went limp for lack of air. Elena fought like an animal, with her teeth and nails, to escape. But she eventual y was completely restrained, pinned to the floor. She could hear Sage\u0027s deep voice raging and Stefan, in between desperate telepathic bursts to her, pleading and explaining, \"She\u0027s Stillnot in reality! She doesn\u0027t even know what she\u0027s doing!\" But louder, she could hear the voices of the Guardians. \"She would have kil ed us al !\"\"Those Wings - I\u0027ve never seen anything so deadly!\"\"A human! And with just three words, she could have wiped us out!\"\"If Lenea hadn\u0027t tackled her - \"\"Or if she had been another few feet away - \"\"She destroyed a moon, you know! No life on it at allnow, and ashes Stillfal ing from the sky!\"\"That isn\u0027t the point. The point is that she shouldn\u0027t have Wings powers at all. She\u0027s got to be clipped of them.\"\"That\u0027s right - clip her Wings! Do it! \" Elena recognized Ryannen\u0027s and Idola\u0027s voices at the end there. She was Stilltrying to fight, but they held her so tightly and piled on her so ruthlessly that it had become a fight simply to get air and al she did was exhaust herself. And then they clipped her Wings. It was quick, at least, and Elena felt very little. What hurt most was her heart. Some proud, stubborn streak had been brought out with the fighting, and now she was ashamed to feel each pair cut off. First went Wings of Redemption, those great rainbow-hued arches. Then Wings of Purification, white and iridescent as frosted cobwebs. Wings of the Wind, like honey-colored thistledown. Wings of Remembrance, soft violet and midnight blue. And then Wings of Protection - emerald green and gold, the Wings that had saved her friends from Bloddeuwedd\u0027s frenzied attack on them the first time they had entered the Dark Dimensions. And, final y, Wings of Destruction - high, ebony arches with edges as delicate as black lace. Elena tried to keep silent as each power was taken. But after the first one or two had fal en at her sides, in shadows that perhaps only she could see, she heard a smal gasp, and realized that it was her own voice. And with the next cut, an involuntary little cry. For a moment there was silence. And then suddenly there was overwhelming noise. Elena could hear Bonnie keening and Sage roaring, and Stefan, gentle Stefan, shouting blasphemies and curses at the Guardians. Elena guessed from the stifled sound of his voice that he was fighting them, fighting to get to her. He reached her, somehow, just as the deadly, delicate Wings of Destruction were sheared from her shoulders and mind, and fel like tal shadows to the ground. It was good that he did reach her then, because at last, when Elena was the least dangerous she had been since the Powers of Wings had begun awakening in her, suddenly the Guardians seemed afraid. They stepped back from her, these strong and dangerous women, and only Stefan was there to catch her and hold her in his arms. Stunned, dazed, she was an eighteen-year-old girl who was ordinary. Except for her blood. They wanted to rob her of her blood as well...to \"purify\"it. The three rulers and their attendants had already gathered in a determined, multihued triangle around her and were working their magic when Sage bel owed, \"Stop!\" Elena, drooping over Stefan\u0027s shoulder, could see him vaguely, his velvety black wings Stillspread from wal to wal , Stilltouching the golden ceiling. Bonnie clung to him like a bit of stray dandelion fluff. \"You have already diminished her aura to almost nothing,\"he growled. \"If you \u0027purify\u0027the blood of this pauvre petite completely, she wil die - and then she wil awaken. You wil have created un vampire, Mesdames. Is that what you wish?\" Susurre reeled back. For the ruler of such a harsh and unyielding realm, she seemed almost too gentle - but not too soft to shear off my Wings, Elena thought, wriggling her shoulders to ease them. Maybe she didn\u0027t know how much it would hurt, another part of her mind offered vaguely. Then al her mind came together in an emergency meeting. Something warm and cooling was sliding down the back of her neck, in tiny droplets. Not blood. No, this was infinitely more precious than what the Guardians had taken away. Stefan\u0027s tears. She rocked hard, trying to take her own weight on her feet. Somehow, shakily, she managed it. She only realized just how shaky she was when she tried to lift a hand and wipe the tears off Stefan\u0027s cheeks with her thumb. Her whole hand wobbled as if she were making a childish joke. Her thumb struck his cheek with enough force to make anyone else wince. She looked at him with dumb apology, too shocked to try to speak. Stefan was speaking. Over and over. \"It doesn\u0027t matter,\"he was saying. \"It\u0027s All right, love. Oh, lovely love, it wil be All right.\"He wiped her eyes with a hand that was rock steady, and al the time he was looking only at her, and - she knew - thinking only of her. She knew that because she also knew the moment when it changed. Red hair was in her line of sight, blurred through new tears. Red hair and narrow green eyes, too close to her. That was when Elena felt Stefan remember that there was anything other than Elena in the world. His face changed. He didn\u0027t snarl or stick out his chin. The change was an entire alteration, but it centered around his eyes, which became deadly hard while everything else became sharp and fierce. \"If you touch her again, you vicious bitch, I wil rip out your throat,\"Stefan said, and each word was like a chip of ice-cold iron dropped onto the floor. Elena\u0027s tears stopped with the shock of it. Stefan didn\u0027t talk that way to women. Even Damon didn\u0027t - hadn\u0027t. But the words were Stillechoing in the sudden silence of the cathedral-like room. People were backing away. Idola was backing away too, but her lip was curled. \"Do you think that because we are Guardians that we cannot harm you - ?\"she was beginning, when Stefan\u0027s voice cut through hers cleanly. \"I think that because you are \u0027Guardians\u0027you can kil sanctimoniously and get away with it,\"Stefan said, and his lip made a far more compel ing - and frightening - line of scorn than Idola\u0027s had. \"You would have kil ed Elena if Sage hadn\u0027t stopped you. Damn you,\"he added softly, but with such utter conviction that Idola took another step backward. \"Yes, you\u0027d better ral y al your little friends around,\"he added. \"I might just decide to kil you anyway. I kil ed my own brother, as I\u0027m sure you realize.\" \"But surely - that was only after taking a mortal blow yourself.\"Susurre was between the two of them, trying to intercede. Stefan shrugged. He looked at her with the same contempt as he had the other ruler. \"I Stillhad the use of my arm,\"he said deliberately. \"I could have decided to drop my sword, or to merely wound him. Instead I chose to put a blade straight through his heart.\"He showed his teeth in a distinctly unfriendly smile. \"And now I don\u0027t even need a weapon.\" \"Stefan,\"Elena managed at last to whisper. \"I know. She\u0027s weaker than I am and you don\u0027t want to see me kil her. That\u0027s why she\u0027s Stillalive, love. It\u0027s the only reason.\"As Elena lifted half-frightened eyes to him, Stefan added in a voice only she could hear, Of course, there are some things about me you don\u0027t know, Elena. Things I\u0027d hoped you\u0027d never have to see. Knowing you - loving you - made me almost forget about them. Stefan\u0027s voice in her head woke something inside Elena. She lifted her head and looked at the blurry mass of Guardians around them. She saw strawberry-blond curls suspended in midair. Bonnie. Bonnie fighting. Doing it weakly, but only because a pair of the fair Guardians and another pair of dark ones were holding her in the air, one to each limb. As Elena stared at her she seemed to regain energy and fought harder. And Elena could hear... something. It was faint and far away, but it almost sounded like...her name. Like her name spoken by whispering branches or the whirring of passing bicycle wheels. lay...nah...eee...lay... Elena reached inwardly for the sound. She tried desperately to grasp whatever came after, but nothing happened. She tried a trick she would have found easy yesterday - channeling Power to the center of her telepathy. It didn\u0027t work. She tried her telepathy. Bonnie! Can you hear me? There wasn\u0027t even the slightest change in the smal er girl\u0027s expression. Elena had lost her link to Bonnie. She watched as Bonnie realized the same thing, watched the fight go out of the smal body. Bonnie\u0027s face, upturned in blank despair, was indescribably sad, and somehow indescribably pure and beautiful, al at once. That will never happen to us, Stefan\u0027s voice in her mind told her fiercely. Never! I give you my - No! Elena thought back, superstitiously terrified of a jinx. If Stefan swore, something might happen - she might have to become a vampire or a spirit - to ensure that he didn\u0027t break his word. He stopped, and Elena knew that he had heard her. And somehow this knowledge, that Stefan had heard a single word from her, Stilled her. She knew he wasn\u0027t spying. He\u0027d heard because she\u0027d sent the thought to him. She wasn\u0027t alone. She might be ordinary again; they might have taken her wings and most of the Power of her blood, but she wasn\u0027t alone. She leaned toward him, her forehead against Stefan\u0027s chin. \"No one is alone.\" She\u0027d told Damon that. Damon Salvatore, a being who no longer existed. But who Stillcal ed forth from her one more word, one final cry. His name. Damon! He\u0027d died four dimensions away. But she could feel Stefan backing her, amplifying her transmission, sending it like one last beacon through the multitude of worlds that separated them from his cold and lifeless body. Damon! There wasn\u0027t the slightest glimmer of an answer. Of course not. Elena was making a fool of herself. Suddenly something stronger than grief, stronger than self-pity, even stronger than guilt, took hold of her. Damon wouldn\u0027t have wanted her to be carried out of this hal - even by Stefan. Especial y by Stefan. He would have wanted her to show no sign of weakness to these women who\u0027d shorn her and humiliated her. Yes. That was Stefan. Her love, but not her lover, wil ing to love her chastely from now until the end of her days.... The end...of her days? Elena was suddenly glad that she couldn\u0027t project to strangers telepathical y and that Stefan had set shields around them when he\u0027d taken her into his arms. She turned to Ryannen, who was watching...warily, but Stillwith business in her eyes. \"I\u0027d like to go now, if you don\u0027t mind,\"she said, picking up her backpack and slinging it over her shoulder with a gesture as arrogant as she could make it. There was a bolt of agony as the weight of the strap hit the place from which most of her wings had sprung, but she kept her face contemptuous and indifferent. Bonnie, back on the ground since she wasn\u0027t fighting any longer, fol owed Elena\u0027s lead. Stefan had left his backpack in the Gatehouse, but he gently cupped a hand around Elena\u0027s elbow, not guiding her, but showing that he was there for her. Sage\u0027s wings folded back into themselves and were gone. \"You understand that for the return of these treasures which are ours by right - but which we were barred from retrieving - you wil be granted your requests with the exception of the imposs - \" \"I understand,\"Elena said flatly, just as Stefan said, much more brusquely, \"She understands. Just do it, wil you?\" \"It is already being organized.\"Ryannen\u0027s eyes, dark blue splashed with gold, met Elena\u0027s with a look not entirely unsympathetic. \"The best thing,\"Sussure added hastily, \"would be for us to put you to sleep and send you to your - your old, new dwellings. By the time you awaken, al wil have been accomplished.\" Elena forced her face not to change. \"Send me to Maple Street?\"she asked, looking at Ryannen. \"Aunt Judith\u0027s house?\" \"In your sleep, yes.\" \"I don\u0027t want to be asleep.\"Elena moved even closer to Stefan. \"Don\u0027t let them put me to sleep!\" \"No one\u0027s going to do anything to you that you don\u0027t want,\"Stefan said, and his voice was like the edge of a razor. Sage rumbled his support, and Bonnie stared at the fair woman hard. Ryannen bowed her head. Elena woke up. It was dark, and she\u0027d been asleep. She couldn\u0027t remember exactly how she\u0027d fal en asleep, but she knew she wasn\u0027t on the palanquin, and she knew she wasn\u0027t in a sleeping bag. Stefan? Bonnie? Damon? she thought automatical y, but there was something odd about her telepathy. It felt almost as if it were confined to her own head. Was she in Stefan\u0027s room? It must be pitch-black outside, since she couldn\u0027t even see the outline of the trapdoor that led to the widow\u0027s walk. \"Stefan?\"she whispered, while various bits of information pooled in her mind. There was a smel , at once familiar and unfamiliar. She was lying on a comfortable double bed, not one of Lady Ulma\u0027s silken-and-velvet extravaganzas, but not any lumpy featherbed from the boardinghouse, either. Was she in a hotel? As these various thoughts came together in her brain, there was a soft quick rapping. Knuckles on glass. Elena\u0027s body took over. She tossed off the bedspread and ran to the window, mysteriously avoiding obstacles without thinking about them at all. Her hands wrenched aside curtains that she somehow knew were there and her skyrocketing heart brought a name to her lips. \"Da - !\" And then the world stopped and did its slowest somersault of al . The sight of a face, fierce and concerned and loving and yet strangely frustrated, just on the other side of the second-story window, brought Elena\u0027s memories back. Al of them. Fel \u0027s Church was saved. And Damon was dead. Her head bent slowly until her forehead touched the cool pane of glass.","sourceLink":"https://allnovel.net/the-return-midnight-the-vampire-diaries-3/page-42.html","bookId":2037,"book":{"id":2037,"title":"The Return: Midnight (The Vampire Diaries #3)","description":"Storyline: Midnight (The Vampire Diaries: The Return, #3) With the help of charming and devious Damon, Elena rescued her vampire love, Stefan, from the depths of the Dark Dimension. But neither brother returned unscathed. Stefan is weak from his long imprisonment and needs more blood than Elena alone can give him, while a strange magic has turned Damon into a human. Savage and desperate, Damon will do anything to become a vampire again—even travel back to hell. But what will happen when he accidentally takes Bonnie with him? Stefan and Elena hurry to rescue their innocent friend from the Dark Dimension, leaving Matt and Meredith to save their hometown from the dangerous spirits that have taken hold of Fell\u0027s Church. One by one, children are succumbing to demonic designs. But Matt and Meredith soon discover that the source of the evil is darker—and closer—than they ever could have imagined...","cover":"https://allnovel.net/images/the-return-midnight-the-vampire-diaries-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-return-midnight-the-vampire-diaries-3.html","creation":"Oct 5, 2019 8:58:17 AM","modification":"Oct 5, 2019 11:30:14 PM"}}
