{"id":109098,"no":121,"title":"Page 121","content":"“No,” Inigo said. “We’re going to stop the wedding before it happens—that’s the best way, at least to my mind. Before they’re all set. In the hustle and bustle beforehand, that’s when we should strike.”\n Fezzik had no further rebuttal.\n “Anyway,” Inigo said, “we don’t know how long it takes to swallow something like this.”\n “I could never get it down myself, I know that.”\n “We’ll have to force feed him,” Inigo said, unwrapping the chocolate-colored lump. “Like a stuffed goose. Put our hands around his neck and kind of push it down into whatever comes next.”\n “I’m with you, Inigo,” Fezzik said. “Just tell me what to do.”\n “Let’s get him in a sitting position, I think, don’t you? I always find it’s easier swallowing sitting up than lying down.”\n “We’ll have to really work at it,” Fezzik said. “He’s completely stiff by now. I don’t think he’ll bend easy at all.”\n “You can make him,” Inigo said. “I always have confidence in you, Fezzik.”\n “Thank you,” Fezzik said. “Just don’t ever leave me alone.” He pulled the corpse between them and tried to make him bend in half, but the man in black was so stiff Fezzik really had to perspire to get him at right angles. “How long do you think we’ll have to wait before we know if the miracle’s on or not?”\n “Your guess is as good as mine,” Inigo said. “Get his mouth as wide open as you can and tilt his head back a little and we’ll just drop it in and see.”\n Fezzik worked at the dead man’s mouth a while, got it the way Inigo said, tilted the neck perfect the first time, and Inigo knelt directly above the cavity, dropped the pill down, and as it hit the throat he heard, “Couldn’t beat me alone, you dastards; well, I beat you each apart, I’ll beat you both together.”\n “You’re alive!” Fezzik cried.\n The man in black sat immobile, like a ventriloquist’s dummy, just his mouth moving. “That is perhaps the most childishly obvious remark I have ever come across, but what can you expect from a strangler. Why won’t my arms move?”\n “You’ve been dead,” Inigo explained.\n “And we’re not strangling you,” Fezzik explained, “we were just getting the pill down.”\n “The resurrection pill,” Inigo explained. “I bought it from Miracle Max and it works for sixty minutes.”\n “What happens after sixty minutes? Do I die again?” (It wasn’t sixty minutes; he just thought it was. Actually it was forty; only they had used up one already in conversation, so it was down to thirty-nine.)\n “We don’t know. Probably you just collapse and need tending for a year or however long it takes to get your strength back.”\n “I wish I could remember what it was like when I was dead,” the man in black said. “I’d write it all down. I could make a fortune on a book like that. I can’t move my legs either.”\n “That will come. It’s supposed to. Max said the tongue and the brain were shoo-ins and probably you’ll be able to move, but slowly.”\n “The last thing I remember was dying, so why am I on this wall? Are we enemies? Have you got names? I’m the Dread Pirate Roberts, but you can call me ‘Westley.’”\n “Fezzik.”\n “Inigo Montoya of Spain. Let me tell you what’s been going on—” He stopped and shook his head. “No,” he said. “There’s too much, it would take too long, let me distill it for you: the wedding is at six, which leaves us probably now something over half an hour to get in, steal the girl, and get out; but not before I kill Count Rugen.” \n","sourceLink":"https://allnovel.net/the-princess-bride/page-121.html","bookId":1559,"book":{"id":1559,"title":"The Princess Bride","description":"Storyline: \n What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams? \n As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, The Princess Bride. But as a grown-up he discovered that the boring parts were left out of good old Dad\u0027s recitation, and only the \"good parts\" reached his ears. \n Now Goldman does Dad one better. He\u0027s reconstructed the \"Good Parts Version\" to delight wise kids and wide-eyed grownups everywhere. \n What\u0027s it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex. \n In short, it\u0027s about everything.\n \n","cover":"https://allnovel.net/images/the-princess-bride.jpg","author":"William Goldman","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-princess-bride.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:24:15 PM"}}
