{"id":109010,"no":21,"title":"Page 21","content":"“I must be overtired,” Buttercup managed. “The excitement and all.” “Rest, then,” her mother cautioned. “Terrible things can happen when you’re overtired. I was overtired the night your father proposed.” Thirty-four to twenty-two and pulling away. Buttercup went to her room. She lay on her bed. She closed her eyes. And the Countess was staring at Westley. Buttercup got up from bed. She took off her clothes. She washed a little. She got into her nightgown. She slipped between the sheets, snuggled down, closed her eyes. The Countess was still staring at Westley! Buttercup threw back the sheets, opened her door. She went to the sink by the stove and poured herself a cup of water. She drank it down. She poured another cup and rolled its coolness across her forehead. The feverish feeling was still there. How feverish? She felt fine. She was seventeen, and not even a cavity. She dumped the water firmly into the sink, turned, marched back to her room, shut the door tight, went back to bed. She closed her eyes. The Countess would not stop staring at Westley! Why? Why in the world would the woman in all the history of Florin who was in all ways perfect be interested in the farm boy. Buttercup rolled around in bed. And there simply was no other way of explaining that look—she was interested. Buttercup shut her eyes tight and studied the memory of the Countess. Clearly, something about the farm boy interested her. Facts were facts. But what? The farm boy had eyes like the sea before a storm, but who cared about eyes? And he had pale blond hair, if you liked that sort of thing. And he was broad enough in the shoulders, but not all that much broader than the Count. And certainly he was muscular, but anybody would be muscular who slaved all day. And his skin was perfect and tan, but that came again from slaving; in the sun all day, who wouldn’t be tan? And he wasn’t that much taller than the Count either, although his stomach was flatter, but that was because the farm boy was younger. Buttercup sat up in bed. It must be his teeth. The farm boy did have good teeth, give credit where credit was due. White and perfect, particularly set against the sun-tanned face. Could it have been anything else? Buttercup concentrated. The girls in the village followed the farm boy around a lot, whenever he was making deliveries, but they were idiots, they followed anything. And he always ignored them, because if he’d ever opened his mouth, they would have realized that was all he had, just good teeth; he was, after all, exceptionally stupid. It was really very strange that a woman as beautiful and slender and willowy and graceful, a creature as perfectly packaged, as supremely dressed as the Countess should be hung up on teeth that way. Buttercup shrugged. People were surprisingly complicated. But now she had it all diagnosed, deduced, clear. She closed her eyes and snuggled down and got all nice and comfortable, and people don’t look at other people the way the Countess looked at the farm boy because of their teeth. “Oh,” Buttercup gasped. “Oh, oh dear.” Now the farm boy was staring back at the Countess. He was feeding the cows and his muscles were rippling the way they always did under his tanned skin and Buttercup was standing there watching as the farm boy looked, for the first time, deep into the Countess’s eyes. Buttercup jumped out of bed and began to pace her room. How could he? Oh, it was all right if he looked at her, but he wasn’t looking at her, he was looking at her. “She’s so old,” Buttercup muttered, starting to storm a bit now. The Countess would never see thirty again and that was fact. And her dress looked ridiculous out in the cowshed and that was fact too. Buttercup fell onto her bed and clutched her pillow across her breasts. The dress was ridiculous before it ever got to the cowshed. The Countess looked rotten the minute she left the carriage, with her too big painted mouth and her little piggy painted eyes and her powdered skin and… and… and…","sourceLink":"https://allnovel.net/the-princess-bride/page-21.html","bookId":1559,"book":{"id":1559,"title":"The Princess Bride","description":"Storyline: What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams? As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, The Princess Bride. But as a grown-up he discovered that the boring parts were left out of good old Dad\u0027s recitation, and only the \"good parts\" reached his ears. Now Goldman does Dad one better. He\u0027s reconstructed the \"Good Parts Version\" to delight wise kids and wide-eyed grownups everywhere. What\u0027s it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex. In short, it\u0027s about everything.","cover":"https://allnovel.net/images/the-princess-bride.jpg","author":"William Goldman","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-princess-bride.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:24:15 PM"}}
