{"id":109043,"no":57,"title":"Page 57","content":"“I’m very tired,” Fezzik said. “When you learn so much so fast, you get so tired. I do anyway. Please may I be excused?” “Not yet,” Fezzik’s mother said. “Honey, please hit me, really hit me, try. You’re a smart boy; hit me a good one,” Fezzik’s father begged. “Tomorrow, Daddy; I promise.” Tears began to form. “Crying’s not going to work, Fezzik,” his father exploded. “It’s not gonna work on me and it’s not gonna work on your mother, you’re gonna do what I say and what I say is you’re gonna hit me and if it takes all night we’re gonna stand right here and if it takes all week we’re gonna stand right here and if it—” S P L A T !!!! (This was before emergency wards, and that was too bad, at least for Fezzik’s father, because there was no place to take him after Fezzik’s punch landed, except to his own bed, where he remained with his eyes shut for a day and a half, except for when the milkman came to fix his broken jaw—this was not before doctors, but in Turkey they hadn’t gotten around to claiming the bone business yet; milkmen still were in charge of bones, the logic being that since milk was so good for bones, who would know more about broken bones than a milkman?) When Fezzik’s father was able to open his eyes as much as he wanted, they had a family talk, the three of them. “You’re very strong, Fezzik,” his father said. (Actually, that is not strictly true. What his father meant was, “You’re very strong, Fezzik.” What came out was more like this: “Zzz’zz zzzz zzzzzz, Zzzzzz.” Ever since the milkman had wired his jaws together, all he could manage was the letter z. But he had a very expressive face, and his wife understood him perfectly.) “He says, ‘You’re very strong, Fezzik.’” “I thought I was,” Fezzik answered. “Last year I hit a tree once when I was very mad. I knocked it down. It was a small tree, but still, I figured that had to mean something.” “Z’z zzzzzz zz zzzzz z zzzzzzzzz, Zzzzzz.” “He says he’s giving up being a carpenter, Fezzik.” “Oh, no,” Fezzik said. “You’ll be all well soon, Daddy; the milkman practically promised me.” “Z zzzz zz zzzz zz zzzzz z zzzzzzzzz, Zzzzzz.” “He wants to give up being a carpenter, Fezzik.” “But what will he do?” Fezzik’s mother answered this one herself; she and her husband had been up half the night agreeing on the decision. “He’s going to be your manager, Fezzik. Fighting is the national sport of Turkey. We’re all going to be rich and famous.” “But Mommy, Daddy, I don’t like fighting.” Fezzik’s father reached out and gently patted his son’s knee. “Zz’z zzzzz zz zz zzzzzzzzz,” he said. “It’s going to be wonderful,” his mother translated. Fezzik only burst into tears. They had his first professional match in the village of Sandiki, on a steaming-hot Sunday. Fezzik’s parents had a terrible time getting him into the ring. They were absolutely confident of victory, because they had worked very hard. They had taught Fezzik for three solid years before they mutually agreed that he was ready. Fezzik’s father handled tactics and ring strategy, while his mother was more in charge of diet and training, and they had never been happier.","sourceLink":"https://allnovel.net/the-princess-bride/page-57.html","bookId":1559,"book":{"id":1559,"title":"The Princess Bride","description":"Storyline: What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams? As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, The Princess Bride. But as a grown-up he discovered that the boring parts were left out of good old Dad\u0027s recitation, and only the \"good parts\" reached his ears. Now Goldman does Dad one better. He\u0027s reconstructed the \"Good Parts Version\" to delight wise kids and wide-eyed grownups everywhere. What\u0027s it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex. In short, it\u0027s about everything.","cover":"https://allnovel.net/images/the-princess-bride.jpg","author":"William Goldman","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-princess-bride.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:24:15 PM"}}
