{"id":109066,"no":84,"title":"Page 84","content":"“Take her away,” Buttercup ordered.\n But the soldiers could not stop her, and the old woman kept coming on, her voice getting louder and louder and Louder! and LOUDER! and LOUDER and LOUDER! and—\n Buttercup woke up screaming.\n She was in her bed. Alone. Safe. The wedding was still sixty days away.\n But her nightmares had begun.\n The next night she dreamed of giving birth to their first child and\n Interruption, and hey, how about giving old Morgenstern credit for a major league fake-out there. I mean, didn’t you think for a while at least that they really were married? I did.\n It’s one of my biggest memories of my father reading. I had pneumonia, remember, but I was a little better now, and madly caught up in the book, and one thing you know when you’re ten is that, no matter what, there’s gonna be a happy ending. They can sweat all they want to scare you, the authors, but back of it all you know, you just have no doubt, that in the long run justice is going to win out. And Westley and Buttercup—well, they had their troubles, sure, but they were going to get married and live happily ever after. I would have bet the family fortune if I’d found a sucker big enough to take me on.\n Well, when my father got through with that sentence where the wedding was sandwiched between the ministers’ meeting and the treasury whatever, I said, ‘You read that wrong.’\n My father’s this little bald barber—remember that too? And kind of illiterate. Well, you just don’t challenge a guy who has trouble reading and say he’s read something incorrectly, because that’s really threatening. ‘I’m doing the reading,’ he said.\n I know that but you got it wrong. She didn’t marry that rotten Humperdinck. She marries Westley.’\n ‘It says right here,’ my father began, a little huffy, and he starts going over it again.\n “You must have skipped a page then. Something. Get it right, huh?’\n By now he was more than a tiny bit upset. I skipped nothing. I read the words. The words are there, I read them, good night,’ and off he went.\n ‘Hey please, no,’ I called after him, but he’s stubborn, and, next thing, my mother was in saying, ‘Your father says his throat is too sore; I told him not to read so much,’ and she tucked and fluffed me and no matter how I battled, it was over. No more story till the next day.\n I spent that whole night thinking Buttercup married Humperdinck. It just rocked me. How can I explain it, but the world didn’t work that way. Good got attracted to good, evil you flushed down the John and that was that. But their marriage—I couldn’t make it jibe. God, did I work at it. First I thought that probably Buttercup had this fantastic effect on Humperdinck and turned him into a kind of Westley, or maybe Westley and Humperdinck turned out to be long-lost brothers and Humperdinck was so happy to get his brother back he said, “Look, Westley, I didn’t realize who you were when I married her so what I’ll do is I’ll divorce her and you marry her and that way we’ll all be happy.’ To this day I don’t think I was ever more creative.\n But it didn’t take. Something was wrong and I couldn’t lose it. Suddenly there was this discontent gnawing away until it had a place big enough to settle in and then it curled up and stayed there and it’s still inside me lurking as I write this now.\n The next night, when my father went back to reading and the marriage turned out to have been Buttercup’s dream, I screamed I knew it, all along I knew it,’ and my father said, ‘So you’re happy now, it’s all right now, we can please continue?’ and I said ‘Go’ and he did.\n But I wasn’t happy. Oh my ears were happy, I guess, my story sense was happy, my heart too, but in my, I suppose you have to call it ‘soul,’ there was that damn discontent, shaking its dark head. \n","sourceLink":"https://allnovel.net/the-princess-bride/page-84.html","bookId":1559,"book":{"id":1559,"title":"The Princess Bride","description":"Storyline: \n What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams? \n As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, The Princess Bride. But as a grown-up he discovered that the boring parts were left out of good old Dad\u0027s recitation, and only the \"good parts\" reached his ears. \n Now Goldman does Dad one better. He\u0027s reconstructed the \"Good Parts Version\" to delight wise kids and wide-eyed grownups everywhere. \n What\u0027s it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex. \n In short, it\u0027s about everything.\n \n","cover":"https://allnovel.net/images/the-princess-bride.jpg","author":"William Goldman","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-princess-bride.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:24:15 PM"}}
