{"id":109068,"no":87,"title":"Page 87","content":"From then on, the nightmares became simply too frightening. When there were fifty days to go, Buttercup knocked, one night, on the door to Prince Humperdinck’s chambers. She entered when he bid her to. “I see trouble,” he said. “You look very ill.” And so she did. Beautiful, of course. Still that. But in no way well. Buttercup did not see quite how to begin. He ushered her into a chair. He got her water. She sipped at it, staring dead ahead. He put the glass to one side. “At your convenience, Princess,” he said. “It comes to this,” Buttercup began. “In the Fire Swamp, I made the worst mistake in all the world. I love Westley. I always have. It seems I always will. I did not know this when you came to me. Please believe what I am about to say: when you said that I must marry you or face death, I answered, ‘Kill me.’ I meant that. I mean this now too: if you say I must marry you in fifty days, I will be dead by morning.” The Prince was literally stunned. After a long moment, he knelt by Buttercup’s chair and, in his gentlest voice, started to speak: “I admit that when we first became engaged, there was to be no love involved. That was as much my choice as yours, though the notion may have come from you. But surely you must have noticed, in this last month of parties and festivities, a certain warming of my attitude.” “I have. You have been both sweet and noble.” “Thank you. Having said that, I hope you appreciate how difficult this next sentence is for me to say: I would die myself rather than cause you unhappiness by standing in the way of your marrying the man you love.” Buttercup wanted almost to weep with gratitude. She said: “I will bless you all my days for your kindness.” Then she stood. “So it’s settled. Our wedding is off.” He stood too. “Except for perhaps one thing.” “That being?” “Have you considered the possibility that he might not now want any longer to marry you?” Until that moment, she had not. “You were, I hate to remind you, not altogether gentle with his emotions in the Fire Swamp. Forgive me for saying that, beloved, but you did leave him in the lurch, in a manner of speaking.” Buttercup sat down hard, her turn now to be stunned. Humperdinck knelt again beside her. “This Westley of yours, this sailor boy; he has pride?” Buttercup managed to whisper, “More than any man alive, I sometimes think.” “Well consider, then, dearest. Here he is, off sailing somewhere with the Dread Pirate Roberts; he has had a month to survive the emotional scars you dealt him. What if he wants now to remain single? Or, worse, what if he has found another?” Buttercup was now even beyond whispering. “I think, sweetest child, that we should strike a bargain, you and I: if Westley wants to marry you still, bless you both. If, for reasons unpleasant to mention, his pride will not let him, then you will marry me, as planned, and be the Queen of Florin,” “He couldn’t be married. I’m sure. Not my Westley.” She looked at the Prince. “But how can I find out?” “What about this: you write him a letter, telling him everything. We’ll make four copies. I’ll take my four fastest ships and order them off in all directions. The Dread Pirate Roberts is not often more than a month’s sail from Florin. Whichever of my ships finds him will run the white flag of truce, deliver your letter, and Westley can decide. If ‘no,’ he can speak that message to my captain. If ‘yes,’ my captain will sail him here to you, and I will have to content myself somehow with a lesser bride.”","sourceLink":"https://allnovel.net/the-princess-bride/page-87.html","bookId":1559,"book":{"id":1559,"title":"The Princess Bride","description":"Storyline: What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams? As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, The Princess Bride. But as a grown-up he discovered that the boring parts were left out of good old Dad\u0027s recitation, and only the \"good parts\" reached his ears. Now Goldman does Dad one better. He\u0027s reconstructed the \"Good Parts Version\" to delight wise kids and wide-eyed grownups everywhere. What\u0027s it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex. In short, it\u0027s about everything.","cover":"https://allnovel.net/images/the-princess-bride.jpg","author":"William Goldman","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-princess-bride.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:24:15 PM"}}
