{"id":109073,"no":92,"title":"Page 92","content":"Then it began to lessen in volume. Now it was hard to hear in the Great Square, now it was gone. Now it was hard to hear on the castle walls, now it was gone from the castle walls. It shrunk across the grounds toward the first level of the Zoo of Death, where Count Rugen sat fiddling with some knobs. The wild dog died. Count Rugen rose, and it was all he could do to bury his own shriek of triumph.\n He left the Zoo and ran toward Prince Humperdinck’s chambers. Yellin was just going when the Count got there. The Prince was seated now, behind his desk. When Yellin was gone and they were alone, the Count bowed to his majesty: “The Machine,” he said at last, “works.”\n Prince Humperdinck took a while before answering. It was a ticklish situation, granted he was the boss, the Count merely an underling, still, no one in all Florin had Rugen’s skills. As an inventor, he had, obviously, at last, rid the Machine of all defects. As an architect, he had been crucial in the safety factors involved in the Zoo of Death, and it had undeniably been Rugen who had arranged for the only survivable entrance being the underground fifth level one. He was also supportive to the Prince in all endeavors of hunting and battle, and you didn’t give a follower like that a quick “Get away, boy, you bother me.” So the prince indeed took a while.\n “Look, Ty,” he said finally. “I’m just thrilled you smoothed all the bugs out of the Machine; I never for a minute doubted you’d get it right eventually. And I’m really anxious as can be to see it working. But how can I put this? I can’t keep my head above water one minute to the next: it’s not just the parties and the goo-gooing with what’s-her-name, I’ve got to decide how long the Five Hundredth Anniversary Parade is going to be and where does it start and when does it start and which nobleman gets to march in front of which other nobleman so that everyone’s still speaking to me at the end of it, plus I’ve got a wife to murder and a country to frame for it, plus I’ve got to get the war going once that’s all happened, and all this is stuff I’ve got to do myself. Here’s what it all comes down to: I’m just swamped, Ty. So how about if you go to work on Westley and tell me how it goes, and when I get the time, I’ll come watch and I’m sure it’ll be just wonderful, but for now, what I’d like is a little breathing room, no hard feelings?”\n Count Rugen smiled. “None.” And there weren’t any. He always felt better when he could dole out pain alone. You could concentrate much more deeply when you were alone with agony.\n “I knew you’d understand, Ty.”\n There was a knock on the door and Buttercup stuck her head in. “Any news?” she said.\n The Prince smiled at her and sadly shook his head. “Honey, I promised to tell you the second I hear a thing.”\n “It’s only twelve days, though.”\n “Plenty of time, dulcet darling, now don’t worry yourself.”\n “I’ll leave you,” Buttercup said.\n “I was going too,” the Count said. “May I walk you to your quarters?”\n Buttercup nodded, and down the corridors they wandered till they reached her suite. “Good night,” Buttercup said quickly; ever since that day he had first come to her father’s farm, she had always been afraid whenever the Count came near.\n “I’m sure he’ll come,” the Count said; he was privy to all the Prince’s plans, and Buttercup was well aware of this. “I don’t know your fellow well, but he impressed me greatly. Any man who can find his way through the Fire Swamp can find his way to Florin Castle before your wedding day.”\n Buttercup nodded.\n “He seemed so strong, so remarkably powerful,” the Count went on, his voice warm and lulling. “I only wondered if he possessed true sensitivity, as some men of great might, as you know, do not. For example, I wonder: is he capable of tears?” \n","sourceLink":"https://allnovel.net/the-princess-bride/page-92.html","bookId":1559,"book":{"id":1559,"title":"The Princess Bride","description":"Storyline: \n What happens when the most beautiful girl in the world marries the handsomest prince of all time and he turns out to be...well...a lot less than the man of her dreams? \n As a boy, William Goldman claims, he loved to hear his father read the S. Morgenstern classic, The Princess Bride. But as a grown-up he discovered that the boring parts were left out of good old Dad\u0027s recitation, and only the \"good parts\" reached his ears. \n Now Goldman does Dad one better. He\u0027s reconstructed the \"Good Parts Version\" to delight wise kids and wide-eyed grownups everywhere. \n What\u0027s it about? Fencing. Fighting. True Love. Strong Hate. Harsh Revenge. A Few Giants. Lots of Bad Men. Lots of Good Men. Five or Six Beautiful Women. Beasties Monstrous and Gentle. Some Swell Escapes and Captures. Death, Lies, Truth, Miracles, and a Little Sex. \n In short, it\u0027s about everything.\n \n","cover":"https://allnovel.net/images/the-princess-bride.jpg","author":"William Goldman","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/the-princess-bride.html","creation":"Oct 5, 2019 8:57:44 AM","modification":"Oct 5, 2019 11:24:15 PM"}}
