{"id":68777,"no":12,"title":"Page 12","content":"SENIORSheriff\u0027s Deputy Tansaw Meldor leaned back in his seat. He idly watched Junior Deputy Mirta Lusser flying the aircar through the darkness just before dawn. She was a typical newbie, he decided: conscientious as all hell, overly determined to do every part of her job perfectly, almost touchingly devoted to duty. Ithad taken a direct order before she would call him by his first name. She took the regs seriously and was burningly anxious to do everythingright. All of which meant that she usuallywanted to fly the aircar, which suited Meldor just fine. He had had his fill of manual flying years ago. Robots could not fly Sheriff\u0027s patrol aircraft, not when many Sheriff\u0027s Department duties had at least the potential for causing harm to humans. So human deputies were forced to do robots\u0027 work, flying the damned aircars for themselves instead of letting the robots do it, the way civilians could. The joke of it was the Spacers had never gone in much for automating their equipment, because it was the robots who were going to operate it, anyway. Anything that could be done manually was done that way, making the job of flying a car far more complex than it had to be. Not for the first time, Meldor found himself wishing they could use Settler aircars. He had got a look inside one or two of them during some of the Settlertown dustups, and even ridden in one of them. The damn things could fly themselves, with no need for a human or a robot at the controls. The autopilots on those things went far beyond the rudimentary systems on Spacer aircars. But no, they were stuck with Spacer-style controls. In which case, it suited him just fine to have Lusser do the flying, if they had to be up at this hour, anyway. Damn Kresh! Why did he have to bump up the rapid-response patrols? Meldor wanted to be home in bed, asleep, not up here watching the dust blow in from the desert. Oh, well. Maybe they\u0027 d get lucky, and something worthwhile would happen. Meldor had missed the latest Ironhead riots. He could do with a little excitement. DAWN lit the sky. Caliban had quartered the city during the night, walked through every district, up and down streets of all descriptions, wandered many grand, empty avenues and boulevards. Some part of him knew that it was madly dangerous to be out on the streets. He had to assume that whoever those people were who ordered him to kill himself would try again. He had to assume that there were others who wished him no better fate. He knew he should hide, duck away out of sight where no one could find him. But he could not bring himself to do that. He was gradually coming to realize that he was searching for something without knowing what that something was. An object, an idea, a bit of knowledge his datastore did not possess.An answer. He knew not what he sought, and that alone made him hunger for it all the more. But daytime was here. The robots of night-the laborers, the builders-were giving way to the robots of morning. Personal servants, messengers, aircar drivers were starting to appear-and in their wake, humans were arriving as well, more and more of them as daytime drew them back to the center city. Thus far, no robot had paid him the slightest attention. But humans.They were the danger. He had to hide. But where? He had no idea of what made a good hiding place, where he might be safe. Again he had one of those strange moments of sensation, wherein he felt some internal whisper that his thought processes were skewing to one side. Somehow he knew that fear of personal danger was abnormal, all but unheard-of, in a robot. It was another leakage from the emotion-set that seemed to hover around the edges of his datastore. He might well be the first of his kind to be a fugitive. But where to hide, and how? In the sections of the city he had explored, or in the parts he had not yet seen? Caliban stopped at the next intersection, by the entrance to some sort of store. He considered his options. He consulted the city map in his datastore and saw that there was a great deal of the city he had not seen yet. He had walked great strips and swatches of the town, but he had had no reason to quarter it systematically, block by block, street by street. What he had established from his wandering was that the datastore city map was not very detailed, and far from being complete or accurate. The city had changed since the map had been made. He himself had witnessed some of that change happening the night before. Whole buildings were missing from the datastore map, or on the map but missing from the real city. Clearly he could not rely on the datastore. It would have to be in the area of town he had already seen, then. But even there his knowledge was far from complete. Where could he \"You! Help my robot with those packages and follow me to my aircar.\" Caliban turned around in some surprise. There was a heavyset man behind him, followed by a personal robot, coming out of the store. The robot was carrying a huge stack of packages, piled so high it could not see over them. \"Come on, come on. The damn store\u0027 s robots are all out on deliveries, and damned if I\u0027m going to play seeing-eye guide to a robot.\" Caliban did not move. He had learned last night, the hard way, the danger in blindly obeying orders, and the danger in associating with humans. \"What\u0027s the matter with you?\" the man snapped. \"You under superseding orders already, waiting for your master, he tell you not to help anyone or some damn thing?\" \"No,\" Caliban said. \"Then help my robot. That\u0027s a direct order!\" But Caliban knew now there was no safety in playing along, mimicking other robots. Suppose this man ordered him into his aircar and flew him to some unknown place, someplace off the map in his datastore? Suppose this man was collecting robots for the thrill of destroying them, just as the woman had been the night before? Caliban wanted no part of it. Best to get away from this man, get away and find a place to hide from all the humans. He turned his back on the man and walked away. \"Hey! Come back here!\" But the lessons of the night before were Burned deeply into Caliban \u0027 s brain. He determinedly ignored the man and walked on. Suddenly there was a hand around his arm. The man was grabbing at him, trying to restrain him. Caliban pulled himself free. The man reached out to grab him again, but Caliban sidestepped him. At last he decided to run. There was much he did not understand, but he knew he did not want to be in this place any longer than necessary. Without a backwards glance, Caliban stepped into the street, lengthened his stride into a smooth, steady run, and took off down the avenue. CENTOR Pallichan watched in astonishment as the big red robot ran away. Pallichan was utterly flabbergasted and more than a little unnerved. The robot had refused a direct order, and shaken loose from Centor\u0027s grip in the bargain! That was tantamount to violent behavior, violence against a human being, and refusal of orders to boot. With trembling fingers, not even entirely sure what he was doing, Pallichan pulled his pocketphone out, flipped it open, and punched in the police emergency code. He put the little phone to his ear. There was a half moment\u0027 s silence, and then the robot operator came on. \"Sheriff\u0027s Department Emergency Line. Please state the nature of your difficulty.\" It was a smooth, calm, perfectly modulated voice. It soothed Pallichan \u0027 s agitated mind, helped him think clearly, as no doubt it was meant to do. \"I wish to report a major robot malfunction. A robot, a big metallic-red robot, has just refused my direct order, and then shook me off when I took him by the arm. He ran away.\" \"I see. Now establishing lock on your present location. Sir, what direction was he moving when he ran away?\" \"Ah, oh, let\u0027 s see. \" Pallichan had to think for a moment and get his bearings. He forced himself to think clearly, struggling to keep from getting flustered. \"North,\" he said at last. \"Due north from here, heading up Aurora Boulevard.\" \"That would be in the direction of Government Tower?\" the deferential robot voice asked. Pallichan looked up the avenue and saw the tower. \"Yes, yes, that\u0027s right.\" The dispatch robot must have consulted a map system and located an obvious landmark Pallichan could use to confirm position and direction. Damned clever of the police to have the robots verify things that way. \"Thank you for your report, sir. A top-priority rapid-response aircar is now being dispatched to investigate. Good day to you.\" The line went dead, and Centor Pallichan snapped his phone shut. He dropped it back in his pocket with a proud feeling of civic-mindedness. He led his robot, still patiently carrying his packages, back toward his aircar and managed to get everything packed away without help from any other robots. Some minutes later, when his robot had taken the controls and lifted toward home, it dawned on him to wonder why the police had been so willing to listen to him. Why had they believed something as mad as a report of a rogue robot? Why hadn\u0027t the dispatcher tried to confirm what should have sounded like a completely lunatic report? It was, he realized with a chill of fear, almost as if the dispatch robot had beenwaiting for a rogue-robot call. Pallichan did not even wish toconsider the implications ofthat thought. No, no, far better to force the entire thing from his mind. A quiet life for him. Dealing with the police was distasteful enough. \"INCOMING priority!\" The words were out of Senior Deputy Meldor\u0027s mouth almost before he was aware that the alert light had come on. That was what training could do for you, he told himself. It let you act, and act properly, before you were even quite sure what was happening. He scanned the text of the incoming message, allowing Junior Deputy Lusser to keep her full attention on flying the car, picking out the data she would need to get them to the target. No need to distract her with needless details at the precise moment she was called upon to do some intricate flying. \"What is it, Tansaw?\" Mirta Lusser demanded. \"Rogue-robot call, subject reported proceeding northward on Aurora from the intersection of Aurora and Solaria.\" Meldor checked his vectors and location. \"Come to heading 045,\" he said. But the aircar was already banking, veering toward the northeast. She had worked it out in her head. Lusser was a good pilot, Meldor decided, one who always knew where she was over the city and how to get anywhere else. \"Damn it, Meldor, a rogue robot? Does this mean the damn rumors arereal? \" \"Unless the cops aren\u0027t the only ones hearing the rumors,\" Meldor said grimly. \"If the civilians have heard the same scuttlebutt we have, some of them might get plenty jumpy, and I wouldn\u0027t blame them. People are going to start seeing things.\" \"Wonderful,\" Mirta said. \"That\u0027s not going to make our job any easier. Hang on, over target location in ten seconds.\" CENTOR Pallichan could not quite believe what had happened. He had seen-and talked with-a mad robot. At least, he had convinced himself that was what had happened. Not altogether subconsciously, he was already mentally reworking the encounter for purposes of relating it to his friends, enhancing his own perspicacity and cleverness just a trifle. Easy to do now that it was allover. The moment itself had contained little actual excitement. It was the aftermath, the call to the police, that put a tingle of excitement and danger in his spine. Perhaps there were people to whom the experience of calling the police would seem to be no great adventure, but it was the closest to bold action Pallichan had ever come, and he felt no guilt in savoring the moment. But it was time to get back to normal, he decided, a bit primly. Yes, Pallichan decided, it was time to let his robot fly him home, time to slide into the calm, natural order of things. Already he was envisioning the smooth, quiet ritual of the midday meal, always just the same food, served just the same way, at just the same time. His robots knew how much he valued order and regularity, and no doubt his pilot robot had already signaled to his household staff, advising of the upset to the master\u0027s day. No doubt they would see to it that the remainder of his day was even more orderly than usual, in recompense for what he had just been through. Still, he considered, there was no harm in having a good story to tell. Centor\u0027s brush with a Mad Robot! He could imagine the buzz of excitementthat would send through the circle of his acquaintanceship. Within a few seconds, he was lost to the outside world, his imagination back at work cheerfully inflating the danger and drama of his encounter with the robot-and his own courage in dealing with it. It was a rather soothing mental exercise, and he found he was beginning to feel settled down again. He found himself wondering what the sequel to the event would be, what would happen to the robot in question. But then present reality intruded on his revisions of the recent past. A blue blur of speed whipped past his car on the port side. Centor watched in openmouthed, horrified amazement as it swept past. A sky-blue Sheriff\u0027s aircar! Then came another, and another, and another, whipping past overhead off to starboard-two even raced pastbeneath his car, violating every safety regulation on the planet. Pallichan suddenly realized that his own aircar was tooling along, at a quite leisurely pace, straight north over Aurora Boulevard, the direction the rogue robot had taken. He looked through the forward windscreen and his stomach turned to a block of ice. There were at least four blue aircars on the scene, two of them landing, the others taking up very aggressive patrol stations. It was hard to be certain, but he thought he could even catch sight of a led-painted robot, still moving rapidly northward. Centor\u0027s aircar shuddered and bucked in the air turbulence caused by the Sheriff\u0027s cars. Pallichan was not a forceful or adventurous man, not by any means. Any slight sense of curiosity he might have concerning the sequel of his report to the police vanished in an instant. \"Turn the car, you fool!\" he cried out to his robot. \"Turn! Turn! Get us out of here.\" The fear and panic in his voice was clear, and the robot pilot clearly understood the urgency of the command. He turned the car on its ear as it jinked down and to port, diving the car between two towering office buildings, roaring down the canyoned streets of the central city. Pallichan \u0027 s fingers dug into the arms of his flight chair, and he broke out in a cold sweat. At last the car slowed a bit and put its nose upward as the pilot robot guided them toward a more prudent altitude. Pallichan sat there, gasping for breath, his heart pounding, as his aircar banked gently toward home. That was enough, he decided. Enough indeed. If that was what excitement was like, he had had just enough to suit Centor Pallichan for a lifetime and beyond. Life was meant to be orderly, controlled, reasonable. The universe was supposed to remain always as it was, in a steady, happy balance of calm. Disobedient robots? Mad police chases? That sort of chaos was not the way of things. Something had to be done about it. But that thought brought him up short. For it suddenly dawned on him that a universe of chaos and uncertainty, such as had been so abruptly revealed to him, was unlikely to modify its behavior merely because Centor objected. What step could he take? Write a stiff letter to the Governor? Organize all the right-thinking people who wished merely to be left alone, bring all the most placid and hermetic of Inferno\u0027s citizenry into a group as rough-and-ready as those frightful Ironheads? Have them forcibly demand that things stop happening and get back to normal? But another thought struck at him, almost physically. Suppose, just suppose, that it was thenature of things to keep happening, that it was the long placidity of life on Inferno that was the aberration? Suppose that aberration was even now being swept away, and the tumultuous ferment of the universe at large was even now crashing down upon them all? What if there was no \"normal\" to get back to? Centor Pallichan felt his hands trembling with fear, and knew his tremors had more to do with what he might see soon than what he had just seen recently. \"Take me home,\" he told his pilot robot. \"Take me home, where it is safe.\" CALIBAN heard the sound behind him as he ran and recognized it as the swooping air-rush of aircars coming in fast and low. He heard the squeal of wheels slamming down onto pavement and knew that several of the cars had landed on the avenue. No doubt others would land ahead of him. Yes, he could see them up ahead.For me, he thought.All of them are after me. I am some terrible threat to them, for reasons I do not understand. They will destroy me if they can. He knew it to be a certainty, not a chance or a theory or a probable hypothesis. By now he was quite good at judging by partial evidence, he realized in some detached part of his mind that was not occupied with the need for escape and survival. But even as he made that observation about his own thought processes, he had started evasive action. He stopped abruptly and turned right, down a narrow alley as the aircars swept by overhead, unable to stop in time to make the turn. Three, four, five, six of them. But they would not be put off so easily. This time the search, the hunt, was well and truly on. They would not stop until they had him. The fact that they had sent so many aircars and deputies after him told him that much very clearly. But where to turn? Where to hide? The question suddenly became even more urgent as the alley came to an abrupt end in a blank wall. He turned, and saw a door leading into the building whose wall made up the north side of the alley, and another door on the south wall. Caliban tried the first door and found that it opened easily. He was about to rush through it when an idea came to him. He tried the door on the south wall of the alley and found it securely locked. Good. Perfect. Caliban smashed the south door open, ripping it off its hinges. Then he returned to the door on the north side and went through it, closing it carefully after him. It must be, he thought, an exceedingly old trick, and even a rather obvious one. But they would not know how to deal with a robot capable of trickery and deception, however simple that deception might be. They would underestimate him, he was sure of it. And that was knowledge he could use. He made his way into the building and set about finding a way to escape. THEIRS was the first car to respond, Tansaw knew that much. Still and all, it wasn\u0027t going to do them any good. At least three other cars had been in better position to get in there first and fast. Mirta had flown well enough to beat two of them to the punch, but there was still Jakdall\u0027s car, right on their nose. There was no way they could get past them to make the pinch. Burning hell, there he was! A devil-red robot running down the middle of the road. They had him! No, damnit, they didn\u0027t. The robot turned suddenly and dove into an alley. Jakdall\u0027s car popped open its airbrake louvers and landing gear, reversing thrust, pulling in for a speed landing. Mirta jinked their own nose higher to avoid a midair collision, the air thumping and roaring past as they hit Jakdall\u0027s turbulence and rattled through it. That did it. No matter how good a pilot Mirta was, she was not going to be able to avoid overshooting. Damnation! They should have been expecting the red bastard to dodge away like that. Yes, a standard robot would not have attempted evasive action, but then a standard robot would not be running away from the police. They had all been warned in the briefing to expect \"atypical behavior\" from this robot. And now they were out of the game. No way they could get back in position before Jakdall and the other units closed in. Tansaw suddenly realized that Mirta had not brought their nose back down. They were still headed up and out. Tansaw was about to say something about that when he was thrown forward against his seat restraints and the nose thrusters roared. His stomach turned to lead as Mirta slammed reverse thrust on and used the nose jets to force the car over on its tail, braking hard with the reversers as she skewed their nose up. The car\u0027s structural members groaned and thrummed under the strain, and the danger alarm started to go off. Tansaw let out a gasp of air as Mirta cut the reversers and nose jets simultaneously. The car hung in free fall for a split heartbeat and then lurched forward as Mirta slammed them into forward acceleration again. But still Mirta did not bring the car level. She forced the nose skyward, angling up more and more sharply until the car was all but standing on its tail. Tansaw grabbed the armrests of his chair and hung on for dear life. The nose angled up more and more until they were flat on their backs, and still she did not angle back. Burning devils, she was going for a full loop! Up and over now, the car arcing over, flying fully upside down for an endless moment. Tansaw lookeddown through the overhead ports, and saw the land where the sky should have been, looked down at the gleaming cityscape spread out below, the dawning sun lighting up the east, its warm rays just catching the bases of the most westerly towers, civilian aircars scattering like a startled flock of birds as the sky-blue sheriff\u0027s cars zeroed in on their quarry. Then Mirta pointed the nose down and they arced over, straight down, diving for the ground, the normally silent aircar groaning with the strain, the air screaming past them as they dropped. Down, down, down. Tansaw stole a quick glance at Mirta. She was grim-faced, determined, her jaw set, concentrating fiercely. At the last possible moment she pulled up and hit the thrust reversers. They were back over Aurora Boulevard, a hundred meters south of where they had been when the robot had turned, still moving damn fast. Mirta leveled them out and fired the nose jets again, fighting the car as it tried to flip over in flight. Suddenly the nose jets died and they were turning, arcing gracefully to a halt in the alley, not ten seconds behind Jakdall and his partner, hovering to a smooth halt in midair. With a bump and thump, Mirta dropped their landing gear, cut power, and had them on the ground. \"Damn good flying, Mirta,\" Tansaw said, wondering if Sheriff Kresh would see it that way, or throw her off the force as a menace to navigation. But one thing was for sure-if there ever came a debate over the wisdom of human-piloted sheriff\u0027s cars, Tansaw could point to the ride he had just taken. No robot would ever have flown that way, never mind how urgent the need. But this was no time for worrying over such matters, and his partner was clearly in no mood for small talk. Mirta, still grim and grey-faced, popped the hatch on her side of the car and was out on the ground before Tansaw even had his restraint straps off. He popped his own hatch and scrambled out, weapon drawn. Strange and terrifying thought, that he felt the need of a blaster going up against a robot. Tansaw took some small satisfaction from realizing that Jakdall and his partner were blowing the last of their lead merely by taking their time disembarking, weighted down by hell\u0027 s own collection of equipment. Apparently Jakdall was determined to be prepared for not just anything, buteverything. Guns, knives, body armor, inertial trackers, cutting tools, a half dozen gadgets Tansaw didn\u0027t even recognize-Jakdall had everything but underwater gear strapped to himself. His partner, Sparfinch, was even more laden down, with a jumpy, nervous look in his eyes. The kid was drawn as tight as a cable under tension. Not for the first time, Tansaw thanked whatever luck it was that he had been paired with Mirta and not Sparfinch. Jakdall grinned. He gave Tansaw and Mirta a mock salute. \"Nice flying, kids, but there\u0027s no prizes for second. We\u0027re taking the lead on this. Come on, Spar. Let\u0027s go fry a robot.\" \"Orders are to capture,\" Mirta said warningly. \"Oh, yeah, they sure are. But it might get a little too hot for that.\" Jakdall laughed and winked. \"Come on, Spar.\" Without thought or question, he turned toward the torn-out, smashed-up door on the south side of the alley. Jakdall gestured for Spar to head in while Jak covered him. Spar hesitated just in front of the door, his eyes rolling nervously. He drew his weapon and did a wholly needless tuck-and-roll dive into the building. The interior was open to plain view-there was no one in there. That robot wasn\u0027t going to duck inside the first room it came to and hide. Jak made ready to follow his partner in when suddenly there was a muffled roar and thump from the interior. \"Got him!\" Spar\u0027s voice cried out. Jak, Tansaw, and Mirta rushed inside. Spar was standing over the burned-out hulk of a small, moss-colored robot. Jak took one look at it and let out a string of curses. \"Damn you, Spar, that robot\u0027s green! It\u0027s just a building maintenance unit.\" \"I can\u0027t help it,\" Spar said in an agitated voice. \"I\u0027m colorblind.\" \"Ah, the hell with it. Come on, we\u0027ll search through there.\" Jak turned toward Tansaw. \"You two coming?\" \"No, you guys go ahead,\" Tansaw said. \"We\u0027ll stand watch here and make sure he doesn\u0027t double back.\" Mirta turned and looked at him sharply, but Tansaw gestured for her to be quiet, out of Jak\u0027s line of sight. Jak grinned hugely and laughed at them. \"Brilliant plan, Tan. You always were good on the backup jobs. Come on, Spar.\" Mirta watched the two of them clump noisily out of the back room, headed toward the front of the building, then turned toward Tansaw, obviously seething. \"Damnit, Meldor, do you have to let them steal our thunder when I practically bent the aircar in half getting us here? We should be hunting with them, not guarding some damn door!\" \"Easy, Mirta. I just didn\u0027t want us getting our heads blown off when Spar decides we\u0027re robot-shaped. The rogue didn\u0027t come through here. He just wanted us tothink he did. Look at the room. The door\u0027s smashed to pieces but everything in here is untouched. Let those two maniacs blunder around in here. My guess is that the robot is smarter than Jak is-though that\u0027s not really saying too much about the robot.\" He turned and stepped back out into the alley, Mirta right behind him. The alley was filled with cops by now, two or three of them heading in the smashed-down door even as Tansaw and Mirta came out. Tansaw crossed the alley and tried the other door. It swung open easily. With a glance at Mirta, Tansaw stepped inside. He knew, absolutelyknew, that this was the way the robot had gone. But he also knew he didn\u0027t much like the idea of tracking a robot who was capable of thinking in terms of diversionary tactics. And that second piece of knowledge did much to remove the savor from the first piece. They moved into the gloomy interior of the building. There was very little inside, merely a forest of packing cases that had never been cracked open. Hades was full of such buildings-designed, built, stocked with equipment by robots and forgotten. Most of the ghost buildings were like this one, wholly complete, but left vacant. The ghosts were gifts from on high to criminal gangs of all sorts, ideal places to meet, to hide out, perfect headquarters from which to run their scams and crimes. It looked as if this building had gotten all the way to furniture delivery before being shut down. The crates were neatly stacked everywhere, turning the first floor into a maze of hiding places. And then there were the floors above and the subbasements and service tunnels below. Even if the roguehad come in here, how the hell would they ever know it, or find him? Then Mirta grabbed his arm and pointed her handlamp down at the floor. Dust.The floor was covered in a smooth, perfect film of dust-with one set of distinctly robotic footprints leading off into the interior, moving at a smooth and confident pace. The two deputies followed the line of footprints through the canyons of packing cases. They led straight for a stairwell, its door standing open. Moving cautiously, Mirta and Tansaw went inside, to be greeted by a cool breeze blowing down the shaft, which apparently also served as part of the ventilator system. But the air currents meant no dust deposits here. No footprints. Damn it. All right, then. Up or down? Which way did he go? \"He headed straight for the stairs,\" Mirta said, her voice a loud whisper. \"So what does that tell us?\" Tansaw asked. \"That he knows where he\u0027s going. He must have a good internal map system. He\u0027s not moving in a panic. He\u0027s got a plan, he\u0027s thinking ahead.\" \"Which means he must have figured out that heading up isn\u0027t going to do him any good. We\u0027 d be able to seal off the building and bottle him up. So he went down into the service tunnels.\" That was always bad news. The tunnels went everywhere, to allow the maintenance robots to bring in supplies and services without adding to street congestion. And despite all official statements to the contrary, every cop knew there werelots of tunnels that did not appear on any map. Some had just been dug and then forgotten, some had been deliberately erased from the map memories-and some had been dug by robots in the employ of enterprising freelancers of one sort or another. \"Right.\" Mirta holstered her gun and pulled her tracker/mapper out of her tunic. She worked the controls and consulted the screen. \"Not so bad around here,\" she said. \"I only show one main horizontal shaft connecting to this building.\" \"Can we seal it before he can use it to get to another tunnel?\" All the tunnels-all the official tunnels, at least-were equipped with heavy-duty vault-style doors. \"We can try,\" Mirta said. \"It\u0027ll be close, one way or the other.\" She brought her comm mike around to her mouth. \"This is Deputy 1231, in rapid pursuit of suspect. Request immediate seals on all accesses to city tunnel number A7 B26.\" She listened to her headset for a moment, and Tansaw felt as much as heard a series of muffled, far-off clanging thuds. \"That ought to do it,\" she said. \"If he didn\u0027t get out of B26 before we sealed it, we have him now.\" Tansaw looked up at his partner and nodded. \"It\u0027s time to call in the others,\" he said. CALIBAN heard the booming thuds of the tunnel doors slamming shut. He had been moving at a fast, steady, walking pace in the narrow tunnel, but now he broke into a run, hurrying for the end. He came upon it all too soon and knew he was in deep trouble. This door was meant for a full-security seal. He tried to force it open, but obviously it had been specifically designed to be beyond a robot\u0027s strength, with a locked and armored control panel as well. He consulted his datastore map. Tunnel A 7 B26 was \"H\"-shaped, with the access to the building above in the center of the cross member, and the four ends of the vertical members linking into the main city tunnel system. The tunnel itself was barren, nothing but bare walls, floors, and ceilings, with glow lamps set into the ceiling\u0027s overhead crossbeam supports. The beams looked to be some sort of plasteel, twenty centimeters square in cross section, spaced at five-meter intervals. Suddenly Caliban had an idea. He consulted his datastore and confirmed that humans saw in a far more limited range of light wavelengths than he did. Nor, it appeared, did their bodies provide any source of built-in illumination. He turned around and hurried back down the tunnel, at top speed, yanking out the glow lamps, crushing them, heaving the debris in all directions. Within sixty seconds the floor of the tunnel was littered with broken lamps. It was in absolute darkness, but for the dim glow of two impossibly blue eyes about twenty meters from the building access hatch. But then Caliban shifted to infrared, and even that illumination faded away. He stretched out his arms to one wall of the tunnel, braced his legs against the opposite wall, and walked his way up until he was braced against the ceiling, between. two of the overhead supports. The odds seemed at least a little better that he would stay out of sight there. He had no real plan, no idea of how to get out. All he knew was that he had more chance of staying alive a little longer if he kept out of sight in the dark, rather than waiting passively for his fate. He hung there, waiting, for what seemed an absurdly long time. His on-board chronometer gave him a precise report on how long he waited there, but somehow the number of minutes and seconds that flickered past was no proper measure of his situation. There was something more to it, for the odds were very good that these were the last minutes and seconds he would ever experience. What was taking them so long? At last there was a clang and a thump. Caliban cocked his head cautiously down to peek around the support beam that hid him from view. He turned his head toward the access hatch. \"Damnit,\" a voice called out. \"He must have knocked all the lights out.\" Caliban saw the beam of a handlamp stab out from the building side of the hatch. Like most lamps designed to give off visible light, this one cast a fair amount of infrared as well. A human figure, and then another and another and another, came through the hatch, plainly visible in infrared. \"Well, at least we know he\u0027s still in here,\" one of them said as a light beam played across the floor, revealing the smashed glow lamps. \"He wouldn\u0027t have hung around smashing the lights if he could\u0027 get out one of the hatches.\" \"Ready to do some damage, Spar?\" one of the others asked with a low chuckle. \"Capture only, Jak,\" a third one, the only woman, said. \"Try to keep that in mind, okay?\" \"Don\u0027t like tunnels,\" the one called Spar announced. \"This gives me the creeps. Can\u0027t we pull in some real lights before we go searching around in here?\" \"Galaxy\u0027s sake, it\u0027s just one lousy robot in an H-tunnel,\" the one called Jak replied. \"Don\u0027t you get all jumpy on me now.\" Suddenly the hatch behind them swung shut again, to the obvious discomfort of the four deputies. \"Well, if he can\u0027t get out, neither can we,\" the woman said, her voice a bit low and nervous. \"I don\u0027t like it,\" Spar objected. \"Can\u0027t we reopen the hatch and just post a guard on it?\" \"Yeah, and let the rogue punch out the guard and make a run for it,\" the first voice said. \"Look, Spar, the manual keypad combo for all the hatches is 274668. You get antsy, you get out that way. Just don\u0027t get crazy on us. Come on, let\u0027s move out. Mirta, you and me will take the east side; Spar and Jak, you take the west.\" These humans weren\u0027t thinking clearly. Did they assume that if they could not see him, he could nothear them? But that keypad combination. That was the information he needed. Caliban drew his head back in and remained motionless as two of the deputies went past, directly below him. Listening carefully, he judged that the other pair of deputies had indeed gone the other way, to the western leg of the \"H.\" He could hear them turning the corner and moving up one arm of the tunnel. Moving as silently as he could, Caliban worked his way back down the wall, stepped down onto the floor, and turned in the direction the two male deputies had gone. He was tempted to use the keypad combination on the building access door, but no doubt there were any number of police waiting just behind it. No. His one hope was to get past these deputies, punch in the keypad combination, and hope it worked. He made his way down to the intersection between the cross tunnel and the side tunnel and peered cautiously around the corner. There they were, on the north end. Caliban backed into the crosswise leg of the tunnel again. He braced his arms and legs against the walls and worked his way back upward to hide against the ceiling again. After a few moments, the two deputies walked past him in the central connecting tunnel, headed toward the southwestern end of the H-tunnel, making a fair amount of noise as they kicked past the debris of the ruined glow lights. Caliban once again let himself down from the ceiling and moved silently in the direction the two men had come from. There it was, the tunnel hatch, the control panel next to it. Suddenly he had a most disturbing thought. Suppose they were playing games withhim now? Suppose they had meant for him to hear their discussion, and they had deliberately spoken loudly enough for him to hear? Suppose the combination was false? But it didn\u0027t matter. For if the combination did not work, he would in any event have no other way out. He was locked in here, and that combination was the only key that might open the way. Caliban punched in the keypad combination, moving his fingers as rapidly as possible. A light stabbed down on him from the opposite end of the tunnel, bright enough to dazzle his infrared vision. \"There he is!\" Spar\u0027s voice shouted from behind the blinding light. There was a roar, and a whoosh, and Caliban threw himself to one side of the tunnel. There was a violent impact, dead on the center of the hatch. A roaring explosion tore through the reinforced hatch and ripped it to shreds, littering the tunnel with shrapnel and smoke. Debris ricocheted off Caliban \u0027 s body case, knocking him down. He scrambled back to his feet. The impact had blown a hole clear through the armored door, just big enough for Caliban to get through. He scrambled through it, the white-hot armor plate hissing and popping, sending his thermosensors into maximum overload. But then he was through, and out into the tunnels, and gone.","sourceLink":"https://allnovel.net/caliban-isaac-asimov-s-caliban-1/page-12.html","bookId":1728,"book":{"id":1728,"title":"Caliban (Isaac Asimov\u0027s Caliban #1)","description":"Storyline: Caliban (Isaac Asimov\u0027s Caliban #1) In a universe protected by the Three Laws of Robotics, humans are safe.The First Law states, A robot may not injure a human being, or, through inaction, allow a human being to come to harm. When an experiment with a new type of robot brain goes awry, the unthinkable happens. Caliban is created... A robot without guilt or conscience. A robot with no knowledge of or compassion for humanity. A robot without the Three Laws. Caliban is a searing examination of Asimov\u0027s Three Laws of Robotics, a challenge welcomed and sanctioned by Isaac Asimov, the late beloved genius of science fiction, and written with his cooperation by one of today\u0027s hottest talents, Roger MacBride Allen, New York Times bestselling author of Ambush at Corella, The Modular Man, and The Ring of Charon.","cover":"https://allnovel.net/images/caliban-isaac-asimov-s-caliban-1.jpg","author":"Roger MacBride Allen","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/caliban-isaac-asimov-s-caliban-1.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:10:34 AM"}}
