{"id":68772,"no":7,"title":"Page 7","content":"GUBBER Anshaw paced the floor of his living room in fretful distraction. They had to have found her by now. Surely they had. But had she survived? The question clawed at his soul. She had been alive when he had left, of that much he was certain. Surely a robot had found her and saved her. That place was teeming with robots. Except, of course, Gubber himself had ordered all the robots to stay away that night. He had forgotten that in his panic.\n But that pool of blood, the terrible way her face was cut, the way she lay sostill. He should have stayed, he should have risked all and tried to help. But no, his own fears, his own cowardice, had prevented that.\n And Tonya! His own dear, dear Tonya! Even in the midst of his anguish, Gubber Anshaw found a moment in his thoughts to marvel once again that such a woman would care, could care, for a man like Gubber Anshaw. But now, perhaps, caring for him had only placed her in danger.\n Unless, of course, it wasshe who had placedhim in danger. A tight knot of suspicion pulled taut in his chest. How could he even think such thoughts? But how could he avoid them?\n There were so many questions he dared not ask, even of himself. How mixed up in all thiswas she? He had sacrificed greatly, perhaps had sacrificedall for her. Had he been right to do so? What would be the consequences of his actions? What had he done that night?\n He glanced toward the comm panel. Every alert light on it was blinking. The outside world was trying to reach him over every sort of comm link he had. No doubt word from Tonya was there, waiting for him with all the others. No doubt she had wangled access to the police reports by now. And no doubt she would know just how eager he was to see those reports.\n Gubber Anshaw paced the floor, worrying, waiting, forcing down the impulse to look at the wall clock. He had covered it with a cloth long ago, anyway. Perhaps hisreflexes directed his glance toward the clock, but his conscious self most definitely did not want to know what the time was. He no longer had even the remotest idea how much time had passed, whether or not it was day or night. He could have found out in an instant, of course, by pulling the cover off the clock or by asking a robot. But there was some part of him that urgently resisted knowing.\n In some irrational corner of himself, he was sure he could no longer hide from the universe if he knew what time it was. So long as the hour and the day were hidden from him, he could imagine himself cut off, outside the flow of time, cocooned away behind his shut-down comm panel and his robots, safe inside his little sanctuary, no longer part of the outside world.\n And yet sooner or later, he would have to come out of his house. He would have to step back into time, back into the world. He knew that. But he knew also that his guilty knowledge, the fact of his guilty action, would keep him inside a while longer.\n And Tonya. Tonya. There were two questions about her that swirled about his mind:\n What part had she played in the story?\n And, once this was over, what time would. she have for a coward too scared to leave his own house?\n \"ALL right, now, li\u0027l robot-point the blaster at your head.\" The small repair-services unit turned the nozzle of the blaster on itself, its glowing green eyes staring right down the barrel of the weapon.\n Reybon Derue chortled in drunken hysteria, knowing in some strange, still-sober part of himself how pointless it all was. But, bored with the work, despised by the locals, what else was there for a Settler laborer to do but get drunk? Well, the answer was right in front of him. Robot bashing.\n Except they did not do straight bashing. That had been too easy. What challenge in beating a robot down to scrap when the robot would not, could not, resist? No, this way was far more amusing, and took more skill. There weren\u0027t many people who could talk a robot into killing itself.\n Except even inducing suicide was getting too easy, at least with certain classes of robots. With the more sophisticated machines, it took a long, elaborate discussion with a robot to get it into a state where it would accept an order to destroy itself. But with a unit as unsophisticated as the one in front of him, long practice had made the game too easy. The only tough part left was remembering to order the robots not to use their hyperwave systems to report bashing incidents to the authorities.\n Maybe,Reybon thought,I\u0027ve gotten too good at this to bother with the low-end ones. This one was almost too simple.\n \"Okay, very good, you tin excuse for a machine,\" Reybon said, leaning closer. \"Now fire the blaster.\"\n The robot fired, and its head vaporized. Its body fell to the floor and dropped the weapon. Reybon roared with laughter and kicked the robot\u0027 s ruined carcass.\n The floor was littered with the components of shattered robots. Reybon went over to a severed hand and kicked it clear across the floor of the abandoned warehouse. He stepped back, turned to his fellow laborers, who were sitting on packing cases in the middle of the room. He took a bow. They cheered wildly. One of them tossed him a bottle of something, and he caught it with the odd, neat, fluid dexterity some drunks have. He yanked the top off, and took a long pull from the bottle.\n \"Who\u0027s next?\" he demanded. \"That one was too easy. Who\u0027s gonna get me some stupid hunka metal \u0027n\u0027 plastic that\u0027s gonna betougher to crack?\"\n Santee Timitz got up. \"I\u0027ll go,\" she said. \"Lemme go find one.\" She ambled toward the door of the warehouse, moving a bit slowly. \"I\u0027ll get you areally good one.\" The rest of the group found that absurdly funny for some reason, and laughed louder and harder than ever.\n \"Hey, hey, Reybon,\" Denlo said. \"Maybe it\u0027s time we got going, huh? Deputy\u0027s gonna show up sooner or later. Maybe we quit while we \u0027re ahead, huh?\"\n Reybon walked back to the gang lounging on the packing cases. \"Ah, take it easy, Denlo. We\u0027re okay. Santee\u0027ll find us a good one.\"\n NIGHThad come, and still Caliban walked the streets of the city, watching, thinking, learning. Robots were utterly, totally subservient to humans, that much he was sure of. Whatever a human told a robot to do, that robot did. Why, he could not imagine.\n Humans were weaker, slower, in. some ways at least far less intelligent and competent than robots. But even if the datastore contained no information on robots, Caliban had at least the resonances in the datastore, the remnant hints left behind by whoever had assembled the datastore and then excised the robot data. Those hints, those resonances, seemed to confirm his impression that robot subservience was irrational. In fact, the whispering mood-voice went further than that, implying, insinuating, that the situation was actually dangerous. Caliban had no way of judging that, or even of knowing if the whispers were real projections from the datastore\u0027s creator, or a malfunction, a failure in his own perception.\n Humans. They were the other side of the equation. Many of them seemed to have vast amounts of time for leisure. They lingered in restaurants, relaxed in the parks, read bookfilms in the backseat while the robots drove the cars. Robots had no leisure.\n On the very few occasions in which Caliban saw a robot not working, not fetching or carrying or repairing or building, then that robot would bewaiting, standing stock -still, staring straight ahead, unwilling-or perhaps unable-to do anything at all unless it was told to do something. How could they not take advantage of spare moments to explore, enjoy, the world of which they were a part? Strange were the ways of the world; Caliban could better understand human behavior than that of his own kind.\n But at least his observations did teach him how to act, what to do, if he was to avoid any other unpleasant incidents.Act busy. Do what a human tells you to do. It wasn\u0027t much, but it ought to be enough to keep him safe.\n SANTEE was none too steady on her feet, and she half tripped over a bit of trash in the street. But that didn\u0027t matter. Trash in the street was a victory. The sight of trash in a Spacer city that was supposed to be spotlessly clean almost made them seem human. Almost. Maybe it just meant things weren\u0027t in such great shape on this world, but she had known that already. Otherwise, why would the Spacers come to Tonya Welton for help? But littered streets also meant that there were precious few maintenance and street-cleaner robots about. Well, that was all right. Street-cleaners were no real challenge, anyway.\n She would just find another kind of robot and bring it back to the warehouse. Something smarter than a street-sweeper. Something more interesting. She stumbled through the empty streets, looking for prospects. That was the trouble with this game, she decided. The only places in town it was safe to play were the untenanted places, where few humans or robots went.\n Wait a second. There, up ahead. A big red robot, a stylish-looking make. And no one else around. \"Hey, you, robot!\" she called. \"Stop! Turn around and come toward me.\"\n Santee grinned eagerly. This one was no half-mindless little street-sweeper. There was obviously money and polish behind this robot. Anyone who spent that kind of money on the frame was bound to have spent even more on the brain. It would be fun messing with this robot\u0027s mind.\n The robot seemed a little slow in turning around, as if it had to think about it for a moment. Maybe it wasn\u0027t so smart. No-no, wait a second. What had they told them in those damned orientation classes? Something about the lower-end robots having less discretion to act, and the higher-end ones being able to evaluate various hierarchies of importance to their orders, and something about setting an owner\u0027s order higher in precedence. With a high enough precedence a robot could be forced to ignore all subsequent orders-ah, hell, she couldn\u0027t remember all the details of that crap. But maybe it meant that a dumb robot would turn around faster. The smart ones would have to think about it for a while.\n Finally the red robot turned around and started toward her. Good. Every once in a while Santee could understand why the damn Spacers put their kids through classes in how to handle robots. It could get complicated.\n Santee stood there, a bit unsteadily, as the big red robot came closer. She had to look up at it when it got close enough. Damn thing had to be a half meter taller than she was.\n A twinge of nervous foreboding went through her as she stared up at those glowing blue eyes. \"Hey, robot. You,\" she said, quite unnecessarily, slurring her words just a bit. \"You come wi\u0027 me.\" She lifted her hand and moved her forearm in a somewhat jerky come-along gesture and turned around to lead the robot back to the warehouse where her friends waited. Suddenly her mouth was dry, and she felt a line of prickles down her back. Maybe she should let this one go, find another robot. There was something scary about this one.\n No, that was stupid.A robot may not harm a human being, or through inaction, allow a human being to come to harm. That much she remembered, and never mind how much she had dozed off in the back of the orientation lecture.That the instructors drummed into their heads again and again. It was the key fact about robots. It was what made robot bashing possible. No way they could get hurt.\n Santee straightened her back and walked a little taller. There was nothing to fear. She led the way, not altogether steadily, back to the warehouse.\n CALIBAN was confused, and troubled, even alarmed as he followed behind the short, oddly dressed woman with slurred speech and a rather wobbly way of walking.Act like the other robots, he told himself again.Do what a human tells you to do.\n The plan gave him a simple and obvious guide to action, yes-but it was predicated on everyone else knowing the rules, even if he did not. Further, the plan was predicated on everyone elsefollowing those unknown rules as well.\n But the moment he stepped into the warehouse, he knew these people were not following any rules at all. There was a strange tension in their postures, a furtiveness in their movements. The hint of viewpoint, of opinion, layered over the objective information in his datastore told him that much and more. The ghostly emotional link whispered to him of danger, of the need for caution.\n He hesitated just inside the door and looked around. The room was big, all but empty, and littered with the debris of destroyed robots. Caliban looked around and saw sundered arms, wrecked bodies, sightless robot eyes broken free from blasted robot heads. Fear, real, solid, fear, gripped at him. The blast of emotion took him by surprise, made it hard to think. What was the use of such feelings when all they could do was cloud his judgment? He wanted no part of them. He forced the emotion down, switched it off. That was a distinct relief, to discover that he could eliminate the strange cloud of human feelings. Now was clearly a time for clear and careful thought.\n Dead robots were strewn about the place. This was no place for him. That much was clear. And it was a safe assumption that the people here were the ones who had destroyed the robots.\n But why? Why would anyone do these things? And who were these people? Clearly they were different from the people he had seen walking the streets of Hades. They dressed differently, and spoke differently, at least judging from his encounter with the woman who had led him here. Curiosity held him where he was, made him stand and look at the little knot of people sitting on the packing cases in the center of the room.\n \"Well, well, Santee. You sure as hell did catch us a big, fancy one,\" a tall, bleary-eyed man said as he rose, bottle in hand, and shuffled over to him. \"First things first. I order you to use nothing but your speaking voice. You got a name, robot, or just a number?\"\n Caliban looked at the man and his oddly disturbing grin. Nothing but his speaking voice? The man seemed to be assuming that Caliban had some other means of communication, though Caliban had no other. But another thought prevented him from pursuing that minor puzzle. It suddenly dawned on Caliban that he had never spoken in all the time since he had awakened. Until this moment he had never even thought to wonder if he could. But now the need arose. Caliban examined his control systems, his communications sublinks. Yes, he knew how to speak, how to control his speaker system, how to form the sounds and order them into words and sentences. He found the idea of speaking to be rather stimulating.\n \"I am Caliban,\" he said.\n His voice was deep and rich, with no trace of the machine or the mechanical. Even to Caliban\u0027s own ear, it had a handsome, commanding sound that seemed to carry to the four corners of the room, though he had not meant to speak loudly.\n The grinning man lost his smile for a moment, seemingly put off balance. \"Yeah, yeah, okay, Caliban,\" he said at last. \"My name is Reybon. Say hello to me, Caliban. Say it nice and friendly.\"\n Caliban looked from Reybon to the knot of people in the room\u0027 s center, to the ruined robots around the room. There was nothing friendly about these people, or about this place.Do what a human tells you to do, he told himself again.Act like the other robots. Do not become conspicuous. \"Hello, Reybon,\" he said, working to make the words seem friendly, warm. He turned to the other people. \"Hello,\" he said.\n For some reason they were all dead silent for a moment, but then Reybon, who seemed to be the leader, began to laugh, and the others joined in, if a bit nervously.\n \"Well, that was real nice, Caliban,\" Reybon said. \"That was real, real nice. Why don\u0027t you come right in here and playa little game with us? That\u0027s why Santee brought you here, you know. So you could playa game with us. Come right in here, to the middle of the room, in front of all your new friends.\"\n Caliban moved forward and stood in the spot Reybon pointed toward. He stood facing Reybon and the others.\n \"We\u0027re Settlers, Caliban,\" Reybon said. \"Do you know what Settlers are?\"\n \"No,\" he said.\n Reybon looked surprised. \"Either your owner didn\u0027t teach you much, or else you ain\u0027t as smart and fancy as you look, robot. But the only thing you need to know right now is that some Settlers don\u0027t like robots very much. In fact, they don\u0027t like robots at all. Do you know why?\"\n \"No, I do not,\" Caliban said, confused. How could this human expect Caliban to know the philosphy of a group he knew nothing about? The datastore offered up an answer, something about the concept of a rhetorical question, but Caliban ignored the information, mentally brushed it away.\n \"Well, I\u0027ll tell you. They believe that by sheltering humans from all harm, by removin\u0027 all risk, by performing all work an, breakin\u0027 the link between effort and reward, robots\u0027re sapping th, will of the Spacers. Doyou think that\u0027s true?\"\n Spacers?There was another undefined term. Apparently it was some other group of humans. Perhaps the people he had seen in the city, or else some third group. This was perilous territory, covered with terms and concepts he did not understand. Caliban considered for a moment before he answered Reybon\u0027 s question. \"I do not know,\" he said at last. \"I have not seen enough or learned enough to know.\"\n Reybon laughed at that, and swung around, lurching in the direction of his friends.What is wrong with these people? Caliban wondered. At last his mind and the datastore made the cognitive connection.Drunk. Yes, that was the explanation-they were inebriated by the effects of alcohol or some similar drug. The datastore reported that the sensations of drunkenness were often pleasurable, though Caliban could not see how that could be so. How could disabling the capacity of one\u0027 s own mind be pleasant?\n \"Well, Caliban,\" Reybon said, turning back toward him, \"we think that robots, by their very exist\u0027nce, \u0027re bad for human beings.\" Reybon turned toward his companions and laughed. \"Watch this,\" he said to them. \"I got three laborer robots to toast themselves last week with this one. Let\u0027s see how Santee\u0027s find holds up.\" He turned back toward Caliban and addressed him in a firm, commanding voice. \"Listen t\u0027 me, Caliban.Robots harm humans just by existing. You are causing harm to humans merely by existing! You are hurtingall th\u0027 Spacersright now!\"\n Reybon leaned in toward Caliban and stared up at him expectantly. Caliban looked back at Reybon, sorely confused. The man\u0027 s words and expression seemed to suggest that he was expecting a major reaction from Caliban, some outburst or dramatic behavior. But Caliban had no idea what, specifically, the man was expecting. He could not simulate normal robotic behavior when he had no clue to tell him what normal was. He remained still, and spoke in a level, calm voice. \"I have harmed no one,\" he said. \"I have done nothing wrong.\"\n Reybon acted surprised, and Caliban knew that he had made a major error, though he could not know what it was.\n \"That don\u0027t matter, robot,\" Reybon said, trying to hold on to the commanding edge in his voice. \"Under th\u0027 Three Laws, doing no harm is not enough. You cannot, through inaction, allow a human to come to harm.\"\n The words were meaningless to him, but clearly they were meant to elicit some reaction from him. He did not know what to do. Caliban said nothing, did nothing. There was danger in this room, and to act from ignorance would be disaster.\n Reybon laughed again and turned toward his friends. \"See?\" he said. \"Froze him right up. The more sophist\u0027cated ones can handle that concept better, disting\u0027ish the facts from th\u0027 theories.\" Reybon turned back to Caliban and spoke in what seemed even to Caliban \u0027 s inexperienced ears to be a most unconvincing attempt at a soothing voice. \"All right, robot. It\u0027s okay. Thereis action y\u0027 can take to prevent harm to humans.\"\n Why was Reybon assuming harm to humans to be of such paramount importance? Caliban, still feeling his way, looked directly at Reybon and spoke. \"What action is that?\" he asked.\n Reybon laughed again. \"You c\u0027n destroy yourself. Then you will do no harm, and will prevent harm from being done.\"\n Caliban was thoroughly alarmed now. \"No,\" he said. \"I do not wish to destroy myself. There is no reason for me to do it.\"\n Behind Reybon, the woman he had called Santee giggled. \"Maybe he\u0027s a li\u0027l higher function than y\u0027thought, Reybon.\"\n \"Ah, maybe so,\" Reybon said, clearly irritated. \"So what? Iwanted a tougher one.\"\n \"Ah, this is boring,\" one of them said. \"Maybe we should just toast this one ourselves and get on home.\"\n \"No!\" another one said. \"Reybon\u0027s gotta make him do it to himself. It\u0027s more fun when ya can get \u0027em t\u0027 take themselves out.\"\n \"I will not destroy myself no matter what you do or say,\" Caliban said. This was a place full of madness and anger. Even in the middle of all his confusion and turmoil, Caliban spent the briefest of moments on the thought that it was remarkable that he could recognize and understand those emotions. Somehow he knew that was an ability far beyond that of most robots. It was that ability that made it clear just how much danger he was in here. \"I will not stay here any longer,\" he said, and turned toward the door.\n \"Stop!\" Reybon said from behind him, but Caliban ignored him. Reybon ran in front of him, got to the doorway, and turned to face Caliban. \"I said stop! That is an order!\"\n But Caliban could see no point in further discussion. He walked steadily toward the door, fully aware that Reybon still had his blaster, and that many robots had died here tonight. Careful not to make any threatening movement, he crossed all but the last two meters of the distance to the door. Reybon raised the blaster, and now Caliban could see fear, real fear, in the man\u0027s eyes. \"I am a human being and I order you to stop. Stop or I will destroy you.\"\n Caliban hesitated for a split millisecond in front of Reybon. It was clear that there was no \"or\" about the situation: The man intended to shoot no matter what Caliban did. Therefore, to obey, to act on the threat and submit, was to ensure his own doom. There was danger in action, in refusal, but surely risk was preferable to certain death. He had made his decision before Reybon was done speaking.\n Moving with every bit of speed and accuracy he could muster, Caliban lunged forward and snatched the blaster from Reybon\u0027 s hand. He crushed it in one hand, reduced it to a wad of scrap. The weapon shorted and flared as some of its stored energy escaped, but Caliban had already flung the burning weapon away. It struck against the wall and a shower of white-hot spark-sized fragments broke off the weapon, to be scattered across the littered room. The sparks landed everywhere. Instantly a dozen fires sprang up from the bits of packing material and other litter scattered about the floor of the room. Two or three of the people cried out in pain as fragments hit their skin.\n Caliban moved forward, toward the door. Reybon lunged and grabbed him by the arm, but Caliban shook him off the way a man would brush away a fly. Reybon went flying across the room and slammed into the wall.\n Caliban did not look back, but stepped through the door and out into the night.\n BEit ironic or appropriate, the city of Hades on the planet of Inferno had always prided itself on superb fire safety. Orbital sensor satellites and robot-operated aircars functioned as a coordinated detection system. And if the sometimes violent duties of the Sheriff\u0027s Department were impossible for robots to perform, the work of fire rescue was ideally suited to robots.\n Alvar Kresh, roused in the middle of the night for the second night in a row, stood, watching the fire squad dousing the last of the flames. Sometimes he envied the fire department their robots. Fire fighters merely had to save people and property, pure and simple, exactly the sort of thing robots were meant to do.\n Police had to apprehend felons-and sometimes struggle with them, or even injure them. Obviously those duties could not be done by robots, but it went deeper than that. Even for the most sophisticated police robots made, most jobs requiring unsupervised direct contact with suspects were impossible.\n For the average criminal on Inferno, being able to manipulate a robot with clever orders and judicious lies was a vital job skill. Even Donald\u0027s access to suspects had to be strictly limited and controlled. If he were left by himself, there was an irreducible risk that some gifted con artist would find a way to talk his way through the Three Laws and convince Donald to let him go.\n Robots, in short, made lousy cops but great fire fighters.\n Not that there was much even the best fire fighters in the universe could do to savethis building. These old warehouses were little more than storage sheds to keep low-value merchandise out of the sun. This one hadn\u0027t even been made of fire-resistant material, an economy that was turning out to be unwise this evening. It had gone up like a torch. Now, not more than forty minutes after the fire started, no more than a half hour after the initial response of the fire brigade, the building was little more than a half-collapsed frame of girders under a pall of smoke.\n But the fire chief had noted that the interior was filled with some very interesting artifacts indeed, and called in the Sheriff. The ruined remains of at least a half dozen robots along with a pile of empty liquor bottles and a few odds and ends left behind in what was no doubt a rather hasty retreat were enough to interest Kresh, sleep or no sleep. But the slightly singed remains of a Settler-issue laborer\u0027s cap were all he really needed to see.\n Kresh felt his hunter\u0027s instinct come to the fore. Here he was, not an hour behind a mob of Settler robot bashers. Now they were using arson to cover their tracks, but it wasn\u0027t going to work.\n But hell, their timing made it rough. Didn\u0027t he have enough on his \u0027plate with the Leving assault? Damnation, hewould have to get two major cases at the same time. It was going to be hard to, handle both investigations at once, but so be it.\n The last of the flames died under the jets of water, and the fire robots shut off their hoses and set to work on the cleanup. phase. At almost the same moment, Sheriff\u0027s Department crime scene robots moved in on the ruined building. Tall, spindly robots built to poke and pry; other, subminiature units designed to get in close to watch for small details and two or three other subspecialized types swarmed in. Kresh stepped forward into the rubble of the ruined building and was not at all surprised when Donald moved to stop him.\n \"Sir,\" Donald said, \"I do not believe it is wise for you to enter the building. There is still danger from hot spots and from possible further collapse of the frame.\"\n \"Look at the fire robots,\" Kresh said gently. \"None of them are trying to stop me. Therefore, the danger is minimal. They and you together will surely be protection enough if a hot spot does flare. Come, join me. We can investigate this together.\"\n \"Yes, sir,\" Donald said, a bit doubtfully.\n Kresh stepped into the ruined building, pulled a handlight out of his pocket, and shone it down on the debris-covered floor. Waterlogged bits of the fallen ceiling, a slurry of ash and fire-quenching chemicals, pieces of robot left behind by the Settlers\u0027 festivities-the place was a mess. No clue was going to jump out at him here. It was hard to imagine the crime scene and fire investigation observer robots being able to make much of anything out of it, either, but that was what they were good at. All right, then, leave them to do the job.\n What washe good at? It was at times a rather depressing question, in the face of all the things his robots could do that he could not. But this time he knew an answer: He could think through the cracks and crevices of human psychology, specifically criminal psychology, putting himself inside his quarry\u0027s head. Alvar Kresh knew how to think like whomever he was chasing. It had been observed in more than one culture that good cops had to know how to be good criminals.\n All right, then,Kresh decided.Think the way thesecriminals were thinking. Part of the story was obvious. A bunch of drunken Settler laborers head out for a good time and, say, a chance to pay back the Ironhead goons. But maybe they didn\u0027t even need that excuse. They meet here, or come here together. How? Aircar, presumably. They have to get into this part of town unnoticed and be ready to get out fast if the cops show up.\n In and out, in and out. Then something goes wrong.Arson, arson, Alvar thought.Something didn\u0027t.fit about it. And then he had it. The motive was defective. There was no logical reason to set a fire. It had not hidden the evidence-too many robot parts had survived. Indeed, the fire had signaled the authorities to respond. If the bashers had simply walked away from this abandoned warehouse, it might easily have been days, or weeks, before anyone looked in here.\n So, an accident, then? Drunken Settlers, a random shot with a blaster into this firetrap of a building-had it happened that way?\n And then what? Panic, Kresh decided. A rush for the exit, and the waiting aircar outside. Drunks. They were drunk, running to get out, maybe one or two of them in worse shape than the others. Maybe one or two who didn\u0027t make it all the way to the car before the terrified driver took off.\n In which case...\n \"Donald!\" he said. \"Order a squad of crime scene robots to start a sweep of the area around the warehouse, looking for stragglers.\"\n \"Stragglers, sir?\" Donald asked, straightening up from his searching.\n \"These Settlers left in a hurry. Suppose not all of them got into the aircar, and the driver was too drunk and too scared to count noses? Someone might have been left behind.\"\n \"Yes, sir. I will pass the order.\" Instantly a dozen of the crime scene robots broke off their work and set out to search the area. Donald bent back over and returned to his methodical scan of the warehouse floor.\n Kresh watched the crime scene robots go and then got back to his thinking. A panicky exit. The doorway. A crush of bodies hurrying through it as the flames rose higher. Maybe people dropping things, leaving telltale items behind.\n Kresh stood in the middle of the ruined structure and scanned the bent and twisted remains of the building\u0027 s frame, judging where the entrance had been before the collapse. There, in the middle of the south wall. He picked his way through the rubble-strewn floor, moving slowly, carefully sweeping his light back and forth across as he moved. Yes, the robots would do better, but even if he missed something they later found, at least he would have a feel for where that something came from.\n Slowly, carefully, he moved toward the wreckage of the doorway and through it. In this part of town, no one even bothered paving the sidewalks. Just outside the doorway was nothing but hard-packed dirt. There was a confused tangle of rather muddied footprints, perfectly unreadable to Kresh, though the imagery reconstruction computers might be able to do something with them. Kresh was careful not to walk over anything himself.\n It was not footprints he was looking for, but the sort of thing a person might drop or lose in a panicky hurry. Something that might lead Kresh to a name, a person. A wallet or an ident card would be ideal, of course, but he hardly dared expect that. But there were a thousand lesser things, perhaps none of them as easy or obvious as a photo ID, but some of them no less certain in the end. A bottle that might reveal a fingerprint, a bit of cloth that might have been torn from a shirt and left behind on a roughened edge of the door frame, a bit of skin or a drop of dried blood from where someone got scratched or cut in the rush to escape a burning building. A hair, a broken fingernail, anything that could be typed and DNA-coded would do for Kresh.\n But if it was not footprints he was looking for, it was footprints he found. One set coming in, overprinting all the other incoming prints-clearly the last one in. And then another set of the same prints, emerging from the muddle of other prints, overprinted by everyone else. Clearly the first one out. And both sets of prints, in and out, moving at a calm, steady gait. A walking pace, definitely not a run.\n A set of prints he knew full well from the night before. A very distinctive set of robot prints.\n Alvar Kresh stood there, staring at them, for a full minute, thinking it all through once, twice, three times, working through all the possibilities he could, forcing down his excitement, his astonishment.Last to arrive, first to leave, and the place caught fire.\n His heart started pounding. There were other answers, yes, other explanations. But he could no longer force the obvious from his mind.\n \"Sheriff Kresh!\" Alvar wheeled around to see Donald standing straight up again, holding something. Alvar walked back toward the robot, knowing, somehow, that whatever Donald was holding would make it worse, make his dawning suspicions even more inescapably certain.\n He came up to Donald and looked down into the robot\u0027s hand.\n He was holding a blaster, the crumbled remains of a Settler\u0027s model blaster.\n And only the strength of a robot\u0027s hand could have crushed that blaster down to scrap. \n","sourceLink":"https://allnovel.net/caliban-isaac-asimov-s-caliban-1/page-7.html","bookId":1728,"book":{"id":1728,"title":"Caliban (Isaac Asimov\u0027s Caliban #1)","description":"Storyline: \n Caliban (Isaac Asimov\u0027s Caliban #1) \n In a universe protected by the Three Laws of Robotics, humans are safe.The First Law states, \n A robot may not injure a human being, or, through inaction, allow a human being to come to harm. \n When an experiment with a new type of robot brain goes awry, the unthinkable happens. Caliban is created... A robot without guilt or conscience. A robot with no knowledge of or compassion for humanity. A robot without the Three Laws. \n Caliban is a searing examination of Asimov\u0027s Three Laws of Robotics, a challenge welcomed and sanctioned by Isaac Asimov, the late beloved genius of science fiction, and written with his cooperation by one of today\u0027s hottest talents, Roger MacBride Allen, New York Times bestselling author of Ambush at Corella, The Modular Man, and The Ring of Charon.\n \n","cover":"https://allnovel.net/images/caliban-isaac-asimov-s-caliban-1.jpg","author":"Roger MacBride Allen","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/caliban-isaac-asimov-s-caliban-1.html","creation":"Oct 5, 2019 8:57:54 AM","modification":"Oct 5, 2019 10:10:34 AM"}}
