{"id":23758,"no":14,"title":"14. Sour Martinis","content":"As it turned out, the first half of Bond\u0027s program for the evening went by the board. On the telephone Domino Vitali said that it would not be convenient for them to see the house that evening. Her guardian and some of his friends were coming ashore. Yet it was indeed possible that they might meet at the Casino that evening. She would be dining on board and the Disco would then sail round and anchor off the Casino. But how would she be able to recognize him in the Casino? She had a very poor memory for faces. Would he perhaps wear a flower in his buttonhole or something? \n \n Bond had laughed. He said that would be all right. He would remember her by her beautiful blue eyes. They were unforgettable. And the blue rinse that matched them. He had put the receiver down halfway through the amused, sexy chuckle. He suddenly wanted to see her again very much. \n \n But the movement of the ship altered his plans for the better. It would be much easier to reconnoitre her in the harbor. It would be a shorter swim and he would be able to go into the water under cover of the harbor police wharf. Equally, with her anchorage empty, it would be all the easier to survey the area where she had been lying. But if Largo moved the yacht about so nonchalantly was it likely the bombs, if there were any, would be hidden at the anchorage? If they were, surely the Disco would stand watch over them. Bond decided to put a decision aside until he had more and more expert information about the ship\u0027s hull. \n \n He sat in his room and wrote his negative report to M. He read it through. It would be a depressing signal to get. Should he say anything about the wisp of a lead he was working on? No. Not until he had something solid. Wishful intelligence, the desire to please or reassure the recipient, was the most dangerous commodity in the whole realm of secret information. Bond could imagine the reaction in Whitehall where the Thunderball war room would be ready, anxious to grasp at straws. M\u0027s careful ?I think we may conceivably have got a lead in the Bahamas. Absolutely nothing definite, but this particular man doesn\u0027t often go wrong on these things. Yes, certainly I\u0027ll check back and see if we can get a follow-up.? And the buzz would get around: ?M\u0027s on to something. Agent of his thinks he\u0027s got a lead. The Bahamas. Yes, I think we\u0027d better tell the P.M.? Bond shuddered. The MOST IMMEDIATES would pour in to him: ?Elucidate your 1806.? ?Flash fullest details.? ?Premier wants detailed grounds for your 1806.? There would be no end to the flood. Leiter would get the same from C.I.A. The whole place would be in an uproar. Then, in answer to Bond\u0027s tatty little fragments of gossip and speculation, there would come the blistering: ?Surprised you should take this flimsy evidence seriously.? ?Futurely confine your signals to facts,? and, the final degradation, ?View speculative nature your 1806 and subsequents comma future signals must repeat must be joint and countersigned by CIA representative.? \n \n Bond wiped his forehead. He unlocked the case containing his cipher machine, transposed his text, checked it again, and went off to Police Headquarters, where Leiter was sitting at his keyboard, the sweat of concentration pouring down his neck. Ten minutes later Leiter took off his earphones and handed over to Bond. He mopped his face with an already drenched handkerchief. ?First it\u0027s sunspots, and I had to swap over to the emergency wavelength. There I found they\u0027d put a baboon on the other end-you know, one of the ones that can write the whole of Shakespeare if you leave him at it long enough.? He angrily waved several pages of cipher groups. ?Now I\u0027ve got to unscramble all this. Probably from Accounts about how much extra income tax this sunshine trip will cost me.? He sat down at a table and began cranking away at his machine. \n \n Bond put his short message over quickly. He could see it being punched out on the tapes in one of those busy rooms on the eighth floor, going to the supervisor, being marked ?Personal for M, copy to OO Section and Records,? then another girl hurrying off down the passage with the flimsy yellow forms on a clip file. He queried whether there was anything for him and signed off. He left Leiter and went down to the Commissioner\u0027s room. \n \n Harling was sitting at his desk with his coat off, dictating to a police sergeant. He dismissed him, pushed a box of cigarettes over his desk to Bond, and lit one himself. He smiled quizzically. ?Any progress?? \n \n Bond told him that the Trace on the Largo group had been negative and that they had called on Largo and gone over the Disco with a Geiger counter. This also had been negative. Bond still wasn\u0027t satisfied. He told the Commissioner what he wanted to know about the fuel capacity of the Disco and the exact location of the fuel tanks. The Commissioner nodded amiably and picked up the telephone. He asked for a Sergeant Molony of the Harbor Police. He cradled the receiver and explained, ?We check all fueling. This is a narrow harbor crammed with small craft, deep-sea fishing boats, and so on. Quite a fire hazard if something went wrong. We like to know what everyone is carrying and whereabouts in the ship. Just in case there\u0027s some fire-fighting to be done or we want a particular ship to get out of range in a hurry.? He went back to the telephone. ?Sergeant Molony?? He repeated Bond\u0027s questions, listened, said thank-you, and put the receiver down. ?She carries a maximum of five hundred gallons of Diesel. Took that amount on on the afternoon of June 2nd. She also carries about forty gallons of lubricating oil and a hundred gallons of drinking water-all carried amidships just forrard of the engine room. That what you want?? \n \n This made nonsense of Largo\u0027s talk of lateral tanks and the difficult ballast problem and so forth. Of course he could have wanted to keep some secret treasure-hunting gear out of sight of the visitors, but at least there was something on board he wanted to hide, and, for all his show of openness, it was now established that Mr. Largo might be a rich treasure hunter, but he was also an unreliable witness. Now Bond\u0027s mind was made up. It was the hull of the ship he wanted to have a look at. Leiter\u0027s mention of the Olterra had been a long shot, but it just might pay off. \n \n Bond passed on a guarded version of his thoughts to the Commissioner. He told him where the Disco would be lying that night. Was there on the force a totally reliable man who could give him a hand with his underwater recce, and was there a sound aqualung, fully charged, available? \n \n Harling gently asked if this was wise. He didn\u0027t exactly know the laws of trespass, but these seemed to be good citizens and they were certainly good spenders. Largo was very popular with everyone. Any kind of scandal, particularly if the police were involved, would create the hell of a stink in the Colony. \n \n Bond said firmly, ?I\u0027m sorry, Commissioner. I quite see your point. But these risks have to be run and I\u0027ve got a job to do. Surely the Secretary of State\u0027s instructions are sufficient authority,? Bond fired his broadside. ?I could get specific orders from him, or from the Prime Minister for the matter of that, in about an hour if you feel it\u0027s necessary.? \n \n The Commissioner shook his head. He smiled. ?No need to use the big guns, Commander. Of course you shall have what you want. I was just giving you the local reaction. I\u0027m sure the Governor would have given you the same warning. This is a small puddle here. We\u0027re not used to the crash treatment from Whitehall. No doubt we\u0027ll get used to it if this flap last long enough. Now then. Yes, we\u0027ve got plenty of what you want. We\u0027ve got twenty men in the Harbor Salvage Unit. Have to. You\u0027d be surprised how often a small boat gets wrecked in the fairway, just where some cruise ship\u0027s going to anchor. And of course there\u0027s the occasional body. I\u0027ll have Constable Santos assigned to you. Splendid chap. Native of Eleuthera, where he used to win all the swimming prizes. He\u0027ll have the gear you want where you want it. Now just give me the details. . . .? \n \n Back in his hotel, Bond took a shower, swallowed a double bourbon old-fashioned, and threw himself down on his bed. He felt absolutely beat-the plane trip, the heat, the nagging sense that he was making a fool of himself in front of the Commissioner, in front of Leiter, in front of himself, added to the dangers, and probably futile ones at that, of this ugly night swim, had built up tensions that could only be eased by sleep and solitude. He went out like a light-to dream of Domino being pursued by a shark with dazzling white teeth that suddenly became Largo, Largo who turned on him with those huge hands. They were coming closer, they reached slowly for him, they had him by the shoulder. . . . But then the bell rang for the end of the round, and went on ringing. \n \n Bond reached out a drugged hand for the receiver. It was Leiter. He wanted that martini with the jumbo olive. It was nine o\u0027clock. What the hell was Bond doing? Did he want someone to help with the zipper? \n \n The Pineapple Room was paneled in bamboo carefully varnished against termites. Wrought-iron pineapples on the tables and against the wall contained segments of thick red candle, and more light was provided by illuminated aquaria let into the walls and by ceiling lights enclosed in pink glass starfish. The Vinylite banquettes were in ivory white and the barman and the two waiters wore scarlet satin calypso shirts with their black trousers. \n \n Bond joined Leiter at a corner table. They both wore white dinner jackets with their dress trousers. Bond had pointed up his rich, property-seeking status with a wine-red cummerbund. Leiter laughed. ?I nearly tied a gold-plated bicycle chain round my waist in case of trouble, but I remembered just in time that I\u0027m a peaceful lawyer. I suppose it\u0027s right that you should get the girls on this assignment. I suppose I just stand by and arrange the marriage settlement and later the alimony. Waiter!? \n \n Leiter ordered two dry martinis. ?Just watch,? he said sourly. The martinis arrived. Leiter took one look at them and told the waiter to send over the barman. When the barman came, looking resentful, Leiter said, ?My friend, I asked for a martini and not a soused olive.? He picked the olive out of the glass with the cocktail stick. The glass, that had been three-quarters full, was now half full. Leiter said mildly, ?This was being done to me while the only drink you knew was milk. I\u0027d learned the basic economics of your business by the time you\u0027d graduated to Coca-Cola. One bottle of Gordon\u0027s gin contains sixteen true measures-double measures, that is, the only ones I drink. Cut the gin with three ounces of water and that makes it up to twenty-two. Have a jigger glass with a big steal in the bottom and a bottle of these fat olives and you\u0027ve got around twenty-eight measures. Bottle of gin here costs only two dollars retail, let\u0027s say around a dollar sixty wholesale. You charge eighty cents for a martini, a dollar sixty for two. Same price as a whole bottle of gin. And with your twenty-eight measures to the bottle, you\u0027ve still got twenty-six left. That\u0027s a clear profit on one bottle of gin of around twenty-one dollars. Give you a dollar for the olives and the drop of vermouth and you\u0027ve still got twenty dollars in your pocket. Now, my friend, that\u0027s too much profit, and if I could be bothered to take this martini to the management and then to the Tourist Board, you\u0027d be in trouble. Be a good chap and mix us two large dry martinis without olives and with some slices of lemon peel separate. Okay? Right, then we\u0027re friends again.? \n \n The barman\u0027s face had run through indignation, respect, and then the sullenness of guilt and fear. Reprieved, but clutching at his scraps of professional dignity, he snapped his fingers for the waiter to take away the glasses. ?Okay, suh. Whatever you says. But we\u0027ve pot plenty overheads here and the majority of customers they doan complain.? \n \n Leiter said, ?Well, here\u0027s one who\u0027s dry behind the ears. A good barman should learn to be able to recognize the serious drinker from the status-seeker who wants just to be seen in your fine bar.? \n \n ?Yassuh.? The barman moved away with Negro dignity. \n \n Bond said, ?You got those figures right, Felix? I always knew one got clipped, but I thought only about a hundred per cent-not four or five.? \n \n ?Young man, since I graduated from Government Service to Pinkertons, the scales have dropped from my eyes. The cheating that goes on in hotels and restaurants is more sinful than all the rest of the sin in the world. Anyone in a tuxedo before seven in the evening is a crocodile, and if he couldn\u0027t take a good bite at your pocketbook he\u0027d take a good bite at your ear. The same goes for the rest of the consumer business, even when it\u0027s not wearing a tuxedo. Sometimes it gets me real mad to have to eat and drink the muck you get and then see what you\u0027re charged for it. Look at our damned lunch today. Six, seven bucks with fifteen per cent added for what\u0027s called service. And then the waiter hangs about for another fifty cents for riding up in the elevator with the stuff. Hell?-Leiter ran an angry hand through his mop of straw hair-?just don\u0027t let\u0027s talk about it. I\u0027m fit to bust a gut when I think about it.? \n \n The drinks came. They were excellent. Leiter calmed down and ordered a second round. He said, ?Now let\u0027s get angry about something else.? He laughed curtly. ?Guess I\u0027m just sore at being back in Government Service again watching all the taxpayers\u0027 money going down the drain on this wild goose chase. Mark you, James?-there was apology in Leiter\u0027s voice-?I\u0027m not saying this whole operation isn\u0027t a true bill, hell of a -- mess in fact, but what riles me is that we should be a couple of arse-end Charlies stuck down on this sand spit while the other guys have got the hot spots-you know, places where something really may be happening-or at least likely to happen. Tell you the truth, I felt like a damned fool gumshoeing around that feller\u0027s yacht this afternoon with my little Geiger toy.? He looked keenly at Bond. ?You don\u0027t find you grow out of these things? I mean it\u0027s all right when there\u0027s a war on. But it seems kinda childish when Peace is bustin\u0027 out all over.? \n \n Bond said doubtfully, ?Of course I know what you mean, Felix. Perhaps it\u0027s just that in England we don\u0027t feel quite as secure as you do in America. The war just doesn\u0027t seem to have ended for us- Berlin, Cyprus, Kenya, Suez, let alone these jobs with people like SMERSH that I used to get tangled up in. There always seems to be something boiling up somewhere. Now this damned business. Dare say I\u0027m taking it all too seriously, but there\u0027s something fishy going on around here. I checked up on that fuel problem and Largo certainly told us a lie.? Bond gave the details of what he had learned at police headquarters. ?I feel I\u0027ve got to make sure tonight. You realize there\u0027s only about seventy hours to go? If I find anything, I suggest tomorrow we take a small plane and really run a search over as much of the area as we can. That plane\u0027s a big thing to hide even under water. You still got your license?? \n \n ?Sure, sure.? Leiter shrugged his shoulders. ?I\u0027ll go along with you. Of course I will. If we find anything, perhaps the signal I got this evening won\u0027t look so damned silly after all.? \n \n So this was what had put Leiter into such a vile temper! Bond said, ?What was that?? \n \n Leiter took a drink and gazed morosely into his glass. ?Well, for my money it\u0027s just so much more attitudinizing by those power-struck fatcats at the Pentagon. But that sheaf of stuff I was waving about was a circular to all our men on this job to say that the Army and the Navy and the Air Force are holding themselves ready to give full support to C.I.A. if anything turns up. Think of that, dammit!? Leiter looked angrily at Bond. ?Think of the waste of fuel and manpower that must be going on all over the world keeping all these units at readiness! Just to show you, know what I\u0027ve been allocated as my striking force?? Leiter gave a harsh, derisive laugh. ?Half squadron of Super Sabre fighter bombers from Pensacola, and-? Leiter stabbed at Bond\u0027s forearm with a hard finger-?and, my friend, the Manta! The -- Manta! Our latest -- atomic submarine!? When Bond smiled at all this vehemence, Leiter continued more reasonably: ?Mark you, it\u0027s not quite so idiotic as it sounds. These Sabres are on anti-submarine sweep duties anyway. Carrying depth charges. They have to be at readiness. And the Manta happens to be on some sort of a training cruise in the area, getting ready to go under the South Pole for a change I suppose, or some other damned promotion job to help along the Navy Estimates. But I ask you! Here\u0027s all these million dollars\u0027 worth of material on instant call from Ensign Leiter, commanding Room 201 in the Royal Bahamian Hotel! Not bad!? \n \n Bond shrugged his shoulders. ?Seems to me your President is taking all this a bit more seriously than his man in Nassau. I suppose our Chiefs of Staff have weighed in with our stuff on the other side of the Atlantic. Anyway, no harm in having the big battalions in the offing just in case Nassau Casino happens to be Target No. 1. By the way, what ideas have your people got about these targets? What have you got in this part of the world that fits in with SPECTRE\u0027S letter? We\u0027ve only got the joint rocket base at a place called Northwest Cay at the eastern end of the Grand Bahamas. That\u0027s about a hundred and fifty miles north of here. Apparently the gear and prototypes we and your people have got there would easily be worth ￡100,000,000.? \n \n ?The only possible targets I\u0027ve been given are Cape Canaveral, the naval base at Pensacola, and, if the party really is going to take place in this area, Miami for target No. 2, with Tampa as a possible runner-up. SPECTRE used the words `a piece of property belonging to the Western Powers.\u0027 That sounds like some kind of installation to me- something like the uranium mines in the Congo, for instance. But a rocket base would fit all right. If we\u0027ve got to take this thing seriously, I\u0027d lay odds on Canaveral or this place on Grand Bahama. Only thing I can\u0027t understand, if they\u0027ve got these bombs, how are they going to transport them to the target and set them off?? \n \n ?A submarine could do it- just lay one of the bombs offshore through a torpedo tube. Or a sailing dinghy, for the matter of that. Apparently exploding these things is no problem so long as they recovered all the parts from the plane. Apparently you\u0027d just have to insert some kind of fuse thing in the right place between the T.N.T. and the plutonium, and screw the impact fuse off the nose and fit a time fuse that would give you time to get a hundred miles away.? Bond added casually, ?Have to have an expert who knows the drill of course, but the trip would be no problem for the Disco , for instance. She could lay the bomb off Grand Bahama at midnight and be back at anchor off Palmyra by breakfast time.? He smiled. ?See what I mean? It all adds up.? \n \n ?Nuts,? said Leiter succinctly. ?You\u0027ll have to do better than that if you want my blood pressure to go up. Anyway, let\u0027s get the hell out of here and go have ourselves some eggs and bacon in one of those clip joints on Bay Street. It\u0027ll cost us twenty dollars plus tax, but the Manta probably burns that every time her screws turn full circle. Then we\u0027ll go along to the Casino and see if Mr. Fuchs or Signor Pontecorvo is sitting beside Largo at the blackjack table. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1583/47072.html","bookId":1267,"book":{"id":1267,"title":"007之霹雳弹 Thunderball","description":"简介： 魔鬼党是一个世界性的恐怖组织，专门从事毒品、抢劫、勒索等国际性案件。某日，魔鬼党拦截了美国运往英国的两枚原子弹，并向英国首相勒索1亿英镑，否则将于七天内炸毁英国各大城市。英方情急之下，派遣007前往魔鬼党总部，并同杜明娜内应终于拆除核弹引线，阻止了大灾难...","cover":"http://novel.tingroom.com/file/upload/201606/20/09-21-12-54-1.jpg","type":"Classic","link":"http://novel.tingroom.com/jingdian/1583","creation":"Aug 1, 2019 12:24:45 AM","modification":"Aug 1, 2019 12:24:45 AM"}}
