{"id":93353,"no":34,"title":"Page 34","content":"The Pickleman held a small object in one hand that he was threatening to throw at Monique. She now faced the mechanimal on one side and the dandy with the gun on the other. Assuming her nemesis was well distracted, Sophronia edged her way around through the lilacs to get behind the girl. Bumbersnoot quieted once the noise from the whistle faded. Suddenly, the lilac bush in front of Sophronia rustled all on its own. She only just managed to swallow down a shriek of surprise. Dimity popped up. “Where’s Pillover?” Sophronia instantly whispered, the noise of the massive mechanimal providing some cover. “Dealing with Pistons. He said he would tie them up right and tidy as a cravat.” Dimity did not sound optimistic. “Oh, my, what’s that?” “Monique, an angry Pickleman, a dandy from the government, I think, and a very big mechanimal.” She could see Dimity pale, even though it was nighttime. “I thought they weren’t supposed to build them big. And it’s not on tracks. Is that legal?” “I’m thinking very little of any of this is legal.” Sophronia considered their options. “We need a distraction. Could you and Pillover get the Pistons to come outside, cause a kerfuffle? It seems a particular speciality of theirs.” Dimity wrinkled her nose. “Must we? I hate kerfuffles.” “Best solution I’ve got on short notice. And please bring me one of those pies we saw the cheesemonger deliver this morning. You remember the ones, wrapped in brown paper? I know Mumsy didn’t allow all of them out for the party. She loves cheese pies and would have kept some in reserve.” “If you think if best.” Without further argument, Dimity crept back to the house. Sophronia turned back to the conversation before her. “Instead, I offer you… your life,” the Pickleman was saying melodramatically to Monique. Monique was not impressed, even trapped as she was between a gun and a mechanical. “Throw in an engagement to your oldest son and we have a bargain.” The dandy did not like that Monique was negotiating with the Pickleman. “Now, now, Miss Pelouse! We had an agreement.” He pulled back the hammer of his pistol. The Pickleman laughed. “Not that you wouldn’t make an admirable wife to the boy—appropriately cunning, and well-trained, I’m sure, but no.” He rolled the object in his hand threateningly. Sophronia suspected it was like Professor Braithwope’s crossbow—whomever he threw it at, the mechanimal would attack. “Come back here, you little worm!” There came a sharp yell and a series of yodels and cries. Pillover, flask in hand, came bumbling through the garden on chubby, rapidly churning legs and stumbled directly into the middle of the lilac dell that housed the Pickleman, Monique, the dandy, and the mechanimal. Dimity reappeared at Sophronia’s elbow, panting, and handed her a cheese pie wrapped in brown paper. “Thank you,” said Sophronia politely. Dashing after Pillover came Lord Dingleproops, the dark-haired boy who’d danced the quadrille with Sophronia, and two other Pistons, all looking annoyed, yet thrilled by the chase. Lord Dingleproops grabbed Pillover and began pelting him about the chops. Pillover instantly dropped to the ground in the middle of the gazebo and curled into a ball around the flask, like a grub. The dandy swiveled his gun around to point it at them instead of Monique. The Pickleman looked like he wanted to turn the mechanimal loose on the boys. Sophronia said, “On my mark, you get the flask from Pillover. Try to pour it onto that mechanimal. I’m going after the prototype.” Dimity let out a little huff of anxiety, but nodded. Sophronia kilted up her skirts. “Mark!” Dimity dove for her brother, swirling out from the bushes with a trilling war cry. She went in and down, startling the attacking Pistons with the fluffy presence of a female. Sophronia rushed Monique. “Oh, Monique, you poor thing, are these men behaving ungentlemanly toward you? Should you be out in the garden unchaperoned with all this roughhousing? Let me help you back inside. You’re missing the better part of the ball.” Sophronia pretended to trip as she rounded the tussling boys. She lurched to one side, knocking the gun from the surprised dandy’s grasp. “Oh, dear, pardon me, sir. Whoop—oh!” In the same movement she spun, simulating a continued stumble—Lady Linette would have been proud. She blundered against Monique. With one hand she reached out and tore down the front of the older girl’s dress, popping the decorative buttons and making certain to expose plenty of undergarments. “It is a certain truth,” Mademoiselle Geraldine had said, gesturing at her own heaving cleavage illustratively, “that a lady’s attention dwells overmuch upon the state, condition, and sanctity of her own assets.” Monique shrieked, clapping both hands to her exposed corset, and dropped her reticule. Sophronia continued to the ground, rolling both her upper body and the reticule underneath Monique’s full skirts. Under cover of those copious petticoats, she slipped the prototype out of the reticule. In almost the same movement, she replaced it with the wrapped cheese pie Dimity had handed her only moments before. Monique kicked at her viciously, but Sophronia was already rolling away, her borrowed ball gown mitigated the force of the blow. She emerged in time to see Dimity wrest the flask free from Pillover and the Pistons and pour its contents over the head of the massive mechanimal bulldog. Monique bent and retrieved her reticule triumphantly and turned to run, no doubt thinking to take advantage of the chaos. The Pickleman, not as distracted as the others, hurled his target blob at her fleeing form. The mechanimal roared to life and charged Monique. Acceleration required the creature to send new power to his limbs from the internal boiler. All it took was one excess spark for Sophronia’s plan to work. The contents of the flask were, as she had guessed, alcoholic, and thus highly flammable. The mechanimal caught fire; so, too, did one of Mrs. Temminnick’s lilac bushes, part of the gazebo, and the hem of Monique’s gown as the creature blundered after her. Monique dropped to the path and rolled around to put out the flames, at the same time stripping off what remained of her overdress. The target must have adhered to that, for now that she had squirmed out of her gold gown, the mechanimal began savaging it to smithereens with sharp, superheated teeth. The dandy and the Pickleman came running up. The Pistons were partly distracted by this short but excitingly fiery chase, and partly distracted by a new threat in the form of a small but enraged Dimity. Dimity, bless her heart, was reciting one of Mademoiselle Geraldine’s longest lectures on proper behavior at a dance, finger shaking in autocratic fury, Lord Dingleproops notwithstanding. Still seated on the ground, Sophronia fed Bumbersnoot the prototype parcel, trusting that it was not actually combustible, but figuring it was better destroyed than in the wrong hands, regardless. Bumbersnoot immolated the paper and the string and swallowed the contents whole. He emitted a puff of steam and donned a contemplative look. There was crystalline clanking inside his metal belly cavity. Fortunately, there was still so much noise that no one heard it. Sophronia stood, adjusting her Bumbersnoot reticule slightly. No one noticed her. The Pistons were shouting and tussling with Pillover, who in turn was squealing loudly while Dimity yelled at them all to get away because the gazebo really was going up in flames and could come tumbling down on them at any moment. A little ways away, Monique lay in the path, half undressed and screaming as the stomping, flaming mechanimal moved ever closer to her. The great beast had one foot placed firmly on her petticoats, effectively immobilizing her. The Pickleman was slapping at his mechanimal with his overcoat to put it out. The dandy was standing over Monique, waving his gun around and instructing her to hand over the prototype, which Monique thought was still in her reticule, which she was clutching firmly to her breast. “Good dogs,” said Sophronia softly to both mechanimals. Getting the prototype to safety was of paramount importance. The dandy or the Pickleman could get hold of Monique’s reticule at any moment and discover it contained no prototype valve at all, but a cheese pie. From among the tussling Pistons, the young man with the pale face paused indolently and looked over at Sophronia. He tossed a lock of dark hair out of one eye with a casual sway of his head. One corner of his mouth twisted up into a heartbreakingly sweet smile. Rake in training, decided Sophronia. She shook her head at him once and then took off toward the house at a dead run. “Dimity, Pillover, scatter!” she yelled as she did so, using Soap’s favorite term. Dimity and Pillover understood the instruction. Pillover managed to extract himself with a quick twist, and Dimity left off her yelled lecture. Sophronia could hear them panting behind her. She attained the relative safety of the crowded dance floor feeling as though she had been through a small war. No one noticed her entrance at all. Dimity and Pillover followed shortly after. The Pistons did not. They had taken Dimity’s lecture to heart, or were still cavorting with the burning gazebo, or had realized they had stumbled upon something more dire than their normal uninvited antics and escaped to their carriage. Sophronia, Dimity, and Pillover looked as if they had been rolling about on the ground in their fine dress—which they had. A quick smoothing of one another’s hair, repairs to smudged faces with handkerchiefs, and brushing off of dirt, and they were mostly respectable. Sophronia was merely once more the Sophronia of before finishing school—scruffy youngest daughter, a mild embarrassment. Her appearance resulted in nothing more than a few disparaging glances from some of the older matrons present. That was partly because Petunia, belle of the ball, was having hysterics in one corner of the room. Apparently, someone had done something to discolor her punch. Once a cheerful red, it was now swamp-grass green. Mrs. Temminnick was ordering up barley water and lemonade, which Petunia felt were summer beverages and thus embarrassingly out of season. Why could they not have mulled wine? Dimity, Sophronia, and Pillover snuck through the crowd, looking for Mrs. Barnaclegoose. Well, Sophronia looked; the other two, who had never met that good lady, were busy saying, “Is that her? Is that her?” in a slightly annoying way. Petunia’s hysterics were just winding down when Monique de Pelouse came dashing into the ballroom. Her appearance caused more of a stir than Sophronia’s had. All attention drifted off of Petunia and the problematic punch to this new exhibition. Miss Pelouse was decidedly indecent—her fine gold dress was entirely gone, and she stood in a towering rage, wearing nothing but singed and torn undergarments. Behind her Sophronia swore she could see the dandy and the Pickleman skulking in the garden shadows. If they had the right kind of mind, they would suspect any one of the Pistons of absconding with the prototype. That is, if they believed it had been stolen from Monique and she wasn’t still hiding it about her person. Monique, however, had a pretty good idea of who would have pinched the prototype. Her hair was wild, her eyes were flashing, and her tattered underskirts floated around her. She looked like a glorious avenging goddess from some ancient erotic myth. She marched through the room, in a vicious temper, and straight into a halfhearted waltz. Sophronia pretended not to notice her. The crowd parted. Simply behave as though nothing is out of the ordinary, she told herself. I do this every day, hide extremely desirable inventions in my fake reticule. Monique stood, arms akimbo, some six or seven paces away from Sophronia, and letting forth a scream of unadulterated rage, she hurled a cheese pie at Sophronia’s head. Petunia Temminnick’s coming-out ball was pronounced a resounding success by all in attendance. There had been highly intoxicating punch, a variety of dances, good music, and intermission entertainment. No one knew why the beautiful Miss Pelouse had stripped, rolled about in the garden, and then chucked a cheese pie at the youngest Temminnick girl before being taken away in floods of tears, but it was surely the highlight of a most enjoyable evening. Sophronia, covered in pie, was removed from the room by her mother, only to deflect Mrs. Temminnick’s embarrassed clucking with a very odd request. “Mumsy,” she said, “it is imperative that I speak with Mrs. Barnaclegoose immediately. I have been looking for her all evening. Is she not in attendance?” Mrs. Temminnick was not having a pleasant night. Her eldest daughter was overset, the beverages were in chaos, and this was all capped off with indecency and the inexplicable flinging of pies. She was in no mood to give consequence to Sophronia’s irrational desires. “Oh, really, Sophronia, must you be so difficult?” “I’m afraid I must. She is here, isn’t she?” Mrs. Temminnick waved her hand about arbitrarily. “I believe she retreated to the front parlor. If only I could do the same. Go on, if you must.” She looked wistful for a moment. Then she drifted away to find Frowbritcher so he could deal with the cheese pie remnants.","sourceLink":"https://allnovel.net/etiquette-espionage-finishing-school-1/page-34.html","bookId":1612,"book":{"id":1612,"title":"Etiquette \u0026 Espionage (Finishing School #1)","description":"Storyline: Etiquette \u0026 Espionage (Finishing School #1) Fourteen-year-old Sophronia is the bane of her mother\u0027s existence. Sophronia is more interested in dismantling clocks and climbing trees than proper etiquette at tea--and god forbid anyone see her atrocious curtsy. Mrs. Temminnick is desperate for her daughter to become a proper lady. She enrolls Sophronia in Mademoiselle Geraldine\u0027s Finishing Academy for Young Ladies of Quality. But little do Sophronia or her mother know that this is a school where ingenious young girls learn to finish, all right--but it\u0027s a different kind of finishing. Mademoiselle Geraldine\u0027s certainly trains young ladies in the finer arts of dance, dress, and etiquette, but also in the other kinds of finishing: the fine arts of death, diversion, deceit, espionage, and the modern weaponries. Sophronia and her friends are going to have a rousing first year at school.","cover":"https://allnovel.net/images/etiquette-espionage-finishing-school-1.jpg","author":"Gail Carriger","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/etiquette-espionage-finishing-school-1.html","creation":"Oct 5, 2019 8:57:46 AM","modification":"Oct 5, 2019 6:00:36 PM"}}
