{"id":41797,"no":5,"title":"GEORG\u0027S CHAMPION","content":"\"No, no, Hans, you are too loud, and Frieda goes too fast! Just listen to Otto\u0027s trumpet and watch my cane, all of you, and then you\u0027ll be right.\" The tone was an emphatic one, and the speaker pounded sharply on the floor with his walking stick. He was a small boy, whose flaxen hair hung straight and thick on either side of his face. He was panting with excitement, his eyes were sparkling, his lips were set. Before him, on the floor, sat six boys and girls in a semi-circle, attending earnestly to his commands. One boy possessed a toy horn; two others, mouth organs; a fourth, a chubby girl, had dropped a tin fife in sheer fright; and the fifth and sixth clung to drum and dinner-bell respectively. [Pg 93] \"This time,\" went on the conductor sternly, \"I want you to begin when I bring my cane down. Now watch! One, two, three, four,—one!\" As the big baton descended with the leader\u0027s vehement \"one,\" a deafening uproar burst from the obedient orchestra. \"Keep on, keep on! You\u0027re going it now! Slower, Frieda! One, two, three, four!\" The director swung his cane vigorously, shouting his orders above the strains of the lusty symphony. A few measures were bravely rendered, when the conductor suddenly threw down his stick with a look of extreme exasperation. \"Peter,\" he said quietly, in the tone of a teacher sorely tried but patient, \"please don\u0027t jingle the bell. Take the clapper in your hand, and tap it when I say \u0027one\u0027 and \u0027three.\u0027 Like this!\" and seizing the bell, he illustrated his meaning, compelling the fat offender to perform the feat to his satisfaction [Pg 94]before going on with the rehearsal. When the bell-ringer had been sufficiently drilled, the director once again took up his baton and ordered a fresh beginning. They were playing in good earnest, for this imperious conductor desired something far above the discordant blasts that are usually obtained from musical toys. Weeks before he had assigned to each playmate a certain instrument, teaching him in private to draw real melody from it; and to-day he had assembled the six performers in his bedroom, introducing them to the delight of joining together in a familiar musical theme. To be sure, the toys were shrill and piping, the players often faulty and careless, but after an hour\u0027s persistent and perspiring labor on the part of all concerned, the Duke\u0027s Military March rang through the house in creditable time and tune. While the music continued with true martial spirit, the door opened softly,[Pg 95] and a plump, fair girl of sixteen peeped into the room. Perceiving the occupation of the children, she smiled brightly and slipped away. A moment later another form appeared upon the threshold, that of an elderly, dignified man. His hair was white, his eyes were protected by huge gold spectacles, his shoulders were slightly bent; but a close observer would have readily detected a resemblance between the handsome old gentleman and the leader of the orchestra. One bore the markings of age, the other the dimples of childhood; but they plainly displayed a kindred will, energy, and intelligence, although one was seventy and the other but seven. Mr. H?ndel was the town surgeon of Halle, appointed by the Duke of S?chse, and the flaxen-haired boy was the idolized child of his declining years. At first sight of the juvenile orchestra the visitor smiled as indulgently as had the girl before him, entering the [Pg 96]chamber unobserved, and seating himself in a distant corner where he could watch the highly interesting performance. But he turned quickly grave when his eye fell upon the small director, who was bending anxiously forward, his whole being absorbed in the sounds that issued from the toys at signal of his cane. The flush that burned the leader\u0027s cheek, the intensity of his glance, and the strained alertness of his lithe young body, seemed a forbidding vision to the old gentleman, for his face clouded and he shook his head in increasing disapproval. Presently the concert ended, the children scrambled noisily to their feet, and the conductor leaned upon his cane, regarding them with the serene composure of a man who has wrought successfully and is modestly proud of the fact. \"We must go home, Georg,\" said Peter, exchanging his bell for his cap. \"I\u0027m going to run, \u0027cause I\u0027m so dretful hungry,\" announced Frieda, [Pg 97]disappearing in quest of curds and seed cakes. \"You may all go now,\" consented the director affably, \"but,\" raising a commanding finger, \"we will practise again at seven o\u0027clock to-morrow morning, and whoever is one minute late won\u0027t be invited to my party in the afternoon.\" \"Oh, Georg,\" wailed Frieda, recalled from the corridor by this edict, \"must I come at seven, whether I\u0027ve had any breakfast or not?\" The leader bowed. \"Whether you have had any breakfast or not,\" he rejoined firmly. The children trooped down the stairs, leaving their chief to gather up the toys and place them carefully upon the table. He was about to leave the room when, for the first time, he discovered that he was not alone. \"Father!\" he exclaimed, bounding gladly to the old man\u0027s side, and laying one hand affectionately upon his shoulder.[Pg 98] \"Did you hear us play? Didn\u0027t we do well? If only we had a fiddle we could make much better music. Oh, father, it is such fun—why—what\u0027s the matter, father? I sharpened your pens and aired your dressing-gown.\" The boy\u0027s hilarious comments ceased as he became aware of his father\u0027s darkened expression, and he hastened to allay the doubts that he supposed to be the cause of this unlooked-for displeasure. \"I know, Georg, that you sharpened the pens, and I believe you when you tell me that you aired the dressing-gown, but I shall give you a new duty to-day. See that you perform it promptly!\" Georg listened in wonder, for never before had his father addressed him with such hardness of manner, and instinctively the boy drew a pace backward. \"A new—duty?\" he stammered. \"I want you to take those musical toys and throw them into the pond, or give them to some one who never comes into this house.\" [Pg 99] Georg was dumfounded. \"Throw them away—my trumpet, my fife, my—\" Breathless with consternation the boy rushed to the table and gathered his treasures protectingly in his arms. \"These—I must—keep,\" he asserted chokingly, eying his father from the breastworks of drum and bell. For answer Mr. H?ndel pointed to the door, and Georg, reading naught but doom in that significant gesture, dropped his toys with a crash and clasped his father\u0027s arm beseechingly. \"Father, don\u0027t make me throw them in the pond! Tell me why it is wrong for me to have them; please, father, tell me!\" The old gentleman\u0027s face expressed both resolution and kindness. \"Listen, Georg. When I gave you those toys at Christmas time, I expected you to amuse yourself with them as other children do, in turn with balls, kites, and sleds. But this you have[Pg 100] failed to do, and every play-hour since that time you have given to these musical toys. Now, Georg, I mean to give you a thorough education, so that when you are a man you may become a jurist, capable of following a respectable career and earning a snug fortune. Ever since you were born I have planned and saved for this purpose, and I cannot have my arrangements upset by these silly mouth organs. Tut, tut!\" as the boy endeavored to speak, \"no words, my son, over this matter! If I allow you to keep these things and play with them, day in and day out, as you have been doing, you will grow into a musician, and then where will my jurist be? No, no, it is not to be thought of. When I came in to-day, you were so deep in the Duke\u0027s March that you did not know that I was near. No, boy, you cannot have them any longer. I would have taken them away before, had I realized that you were so set upon them.\" [Pg 101] \"Please, father—\" whispered Georg, quaking, but persistent. \"You must either throw them away or give them away to-day. You shall have an hour to decide which you wish to do, and at the end of it, I shall expect the matter to be settled for all time. Also, Georg, I wish you to see no more of four of those children who were here to-day. Frieda and Peter seemed dull enough, but the others were too musical by far to be fit companions for you. You may tell them that I forbid them the house from to-day.\" At this stroke of fate, Georg threw himself at full length on the floor, sobbing tempestuously. His father departed without further parley, and the boy was left alone to battle with his disappointment. As the hour drew to a close, he mastered his emotion as well as he was able, washed from his face the traces of weeping, and hurried out to call a meeting of his orchestra by the pond-side. [Pg 102] He would not confess to his mates that he was grieved with the message he had for them, but delivered it with an air of mannish bravado. \"I shan\u0027t have an orchestra any more, and I have brought you all of my instruments. I\u0027ll give you each the one you\u0027ve been using, so you can play hereafter. You needn\u0027t come to-morrow to rehearse, for I can\u0027t lead any longer.\" \"No orchestra! You won\u0027t lead!\" chorused the musicians blankly, as they received the cherished toys into their hands. \"Never again,\" affirmed Georg loftily, but he must needs set his teeth hard upon his lower lip, lest its trembling should betray his stinging regret. \"You see,\" he explained with the easy patronage of a captain who has led his troops to victory, but who is about to be promoted out of their midst, \"it is not as though I were to be a musician when I grow up. It is all well enough for you[Pg 103] fellows to play on these things every day, but I really ought not to waste my time with them, for,\" importantly, \"when I am a man, I am going to be a jurist.\" \"A what?\" demanded his hearers in one breath, much impressed by the high-sounding title. \"A jurist,\" Georg repeated, folding his arms, much gratified at the effect his announcement had produced. \"What does a—a jurist do?\" inquired Frieda, feminine curiosity conquering her awe. \"Oh,\" replied Georg easily, \"a jurist, Frieda, writes down in a book everything that people ought to do, and when they don\u0027t do just as he has written, he cuts off their heads.\" \"Ach!\" \"Their heads?\" \"You will learn to cut them off?\" Georg bowed. \"Now you understand why I must give up the orchestra. If you decide to[Pg 104] keep on without me, perhaps, sometime—\" He was turning away with a kingly wave of the hand, his last sentence unfinished, when a question from Peter recalled him to the second and most distressing part of his mission. \"You\u0027ll have your party to-morrow afternoon? We needn\u0027t play on things, you know.\" The blood mounted to Georg\u0027s forehead, and his fingers twitched uncomfortably; but he managed to speak so boldly that his listeners were quite unaware of his struggle. \"I am glad you mentioned the party, Peter, for I had nearly forgotten it. No, I won\u0027t have any party, and I must tell you—at least, father says—that—that Hans and Otto and Gretchen and Leopold must not come to my house any more. Of course,\" he added hastily, seeking to drown the gasps of his troopers, \"it isn\u0027t that you\u0027re not good enough and nice enough for me to play[Pg 105] with, but father says that you four are very musical, and you might make me musical too; but Frieda and Peter can come, for they are dull.\" \"I hate your old tunes and notes, anyway,\" protested Peter, much injured; but Frieda cut him short with the excited proposal,— \"Let\u0027s have your party for Peter and me and you, to-morrow!\" \"Have your party! Have your party!\" sneered Otto; and Hans informed Georg in biting tones that he wouldn\u0027t forget this when his birthday came next month. Here Georg visibly weakened, for he remembered that Hans was expecting either a violin or a flute upon that occasion, and he nearly lost his studied indifference with the recollection. He was obliged to face about, to hide the sudden teardrops that glistened on his cheeks; and, marching proudly toward his father\u0027s pasture, with head high in air, and back steadily kept[Pg 106] toward his forsaken band, he called out,— \"I\u0027m not mad at you, but you can be mad at me if you like. I won\u0027t have a party to-morrow for Frieda and Peter, \u0027cause I like Hans and Otto better than I do them, \u0027cause they know how to keep time when I beat.\" He had reached the pasture with the last word of parting, and flinging himself over the bars, he fled across the green as though twenty scouts of the enemy were close upon his heels. The mask that he had worn to conceal his heartburning had fallen, and he was crying bitterly as he ran. Old Kappelstahr, Georg\u0027s special pet since the days when she was a sportive calf, stood mildly chewing her cud near the inner fence. As her master dashed among the kine in evident agitation, the heifer turned to look after him, apparently surprised that he had passed her by without a word of greeting. Georg, glancing backward, happened[Pg 107] to catch that look of gentle interest. He halted irresolutely, then, rushing to her side and throwing his arms about her neck, the dejected jurist sobbed out his woe upon her warm brown shoulder. During the succeeding days and weeks, Georg felt as lonely as a shipwrecked mariner cast upon a deserted island of the sea. Instinctively, when lessons were done, he reached out for amusement to the musical toys that were his no longer. Sometimes he heard sounds arising from the pond-side, where his forbidden orchestra rehearsed under Otto\u0027s direction. That he might neither make music nor mingle with those who did, filled him with blank dismay; and hour by hour he wandered about the house and garden, unable to attach himself to other interests or games. His father required him to make an industrious use of his school hours, even adding to the regular course certain studies that he deemed useful to one preparing for a serious profession. [Pg 108] The old gentleman was sorry indeed when he saw how the absence of the musical toys and companions affected Georg, and he even sought to modify the discipline by presenting to the boy a complete set of carpenter\u0027s tools. Georg thanked him for the gift, but what was the old gentleman\u0027s surprise, a week later, upon seeing the chest in his son\u0027s room, still unopened, with every tool in place, and across the wooden lid a series of black and white keys painted, in imitation of a harpsichord. Mr. H?ndel frowned, but made no reference to the matter before Georg. Mrs. H?ndel believed that her husband was right at all times, and would not have reversed his decision regarding the musical affair, if she could; but her sister Anna, the plump fair girl who had peeped in upon the last rehearsal of the orchestra in Georg\u0027s room, sympathized warmly with the boy, and sought to console him in every way possible. Anna was barely sixteen, herself[Pg 109] scarcely more than a child, blue-eyed, yellow-haired, and a member of the H?ndel household. Her sweet temper and merry heart had long before won Georg\u0027s devotion, and in his present trial no one was admitted to his confidence but this youthful aunt. Never a word of disrespect or rebellion did Anna utter against Mr. H?ndel, for she believed implicitly in a child\u0027s obedience to his parents; but, being of a musical temperament herself, she entered into the boy\u0027s trouble as though she, too, were under the ban. In a certain sense she was, there being no musical instrument in the house, and often she felt stirred by the same impulse that wrought so constantly upon her nephew. \"Never mind, Georg,\" she would say, \"let Hans and Frieda have the mouth organ and the drum. Just you attend to your school, and when your father sees that you mean to study hard and carry out his wishes, he will give them back to you.\" [Pg 110] But weeks dragged wearily by, and, despite Georg\u0027s diligence at school, Mr. H?ndel did not relent. Frieda and Peter came occasionally, but they had never been Georg\u0027s chosen comrades, and he joined their games mechanically, plainly relieved when they took their departure. He longed unceasingly for Otto, who was clever with the trumpet, and for Hans, who was now the possessor of a violin. He became restless and dissatisfied, and his mother despaired of a child who went about with such a sober face. He never gave voice to the discontent that surged in his breast, for parental authority was strict in the H?ndel household, and he would have been sharply punished for outspoken protest. But he did not recover from his disappointment, as his father had so reasonably expected; a slight paleness crept over his plump cheeks, his lively spirit was tinged with melancholy, and from his compressed lips was seldom heard his former ringing laugh. [Pg 111] Every one in the house noticed the change, but all except Anna thought the mood would presently pass away if properly ignored, and no mention was made in his hearing of the subject that lay nearest his heart. The girl, however, realized that Georg was seriously unhappy, and right heartily did she try to divert him from his consuming desire. One November afternoon, as Georg sat studying before the sitting-room fire with his mother, who had fallen asleep over her knitting, his attention was attracted by a pebble being thrown against the window. Raising his eyes, he beheld his aunt beckoning to him from the garden. Down went the book and out went the boy. \"What is it, Aunt Anna?\" For answer, the girl caught him about the neck and whirled him madly up and down the gravelled path. \"It\u0027s a secret, Georg, the best and biggest secret in the whole world. Nobody is to know it but you and me, and[Pg 112] it is so lovely that I can\u0027t keep from spinning like a top!\" \"Wait! Stop! Let loose!\" and the boy broke from her clasp, half-strangled by the joyful energy of her arm. \"What is the secret? Hurry and tell!\" The girl stood smiling and speechless, unable to find words to frame her tidings. Then glancing about to assure herself that no one was near, she bent quickly and whispered,— \"You remember, Georg, that poor Granny Wegler died last week. Well, her daughter, Mrs. Friesland, who came from Munich to take care of her, called here to-day to tell me—what do you suppose?\" \"I don\u0027t know.\" \"She said that she had found a note written by Granny, saying that when she died, she wanted to leave her clavichord to me. Just think of it, Georg, I am to have that dear, beautiful little clavichord that stood in Granny\u0027s parlor,[Pg 113] and you and I can play on it whenever we please!\" Georg\u0027s face went from red to white and back to red again with this stupendous news. Afraid that a shout would serve to recall him to house and book, he sought to express his delight by rolling over and over in the crackling brown grass and pulling up the dead blades by handfuls. Suddenly, however, he ceased his tumbling about, and sat up, his hair filled with bits of leaves and grass. \"Ought I to play on it, Aunt Anna? Will father care?\" Georg\u0027s voice shook with apprehension, but the girl hastened to reassure him. \"When your father made you give away the toys, he never said a word about clavichords. It can\u0027t be wrong to play on it when you never have been forbidden.\" Anna\u0027s idea of obedience was very strict, and in the present case she was[Pg 114] wholly sincere, never doubting for an instant that they were about to proceed in the straight path of duty. \"Oh, no,\" murmured the boy, much relieved, \"he didn\u0027t mention clavichords, I\u0027m sure.\" \"Now this is to be a secret of yours and mine, and while the others are gone to the Kirmess to-morrow, I shall have the darling brought over and carried up to the garret.\" \"Ho, ho! Hurrah for our secret! Hurrah! hurrah!\" When, next day, Georg saw the clavichord borne to the shadowy chamber under the eaves and set up in all its thrilling reality against the warm brick chimney, he pressed both hands over his mouth in the fear that his cries of exultation might reach his father\u0027s ears in town. When the carriers were gone, he approached the instrument timidly, and only after Anna had played several tunes, could he be induced to touch its[Pg 115] yellowed keys. But when he had once overcome the awe that filled him at sight of his heart\u0027s desire, he clung to it as a thing of life, passing every hour thereafter that he could snatch from his school studies, in the company of this glorious toy. In the beginning, Anna taught him the few rudiments of musical art that lay within her ken, but before many weeks had passed, the pupil turned teacher, so far outstripping his aunt that he was able to give her many helpful suggestions. That Georg speedily recovered his vaulting spirits, every one remarked; but none guessed the reason. The good surgeon supposed that the boy\u0027s regret for his lost playthings and companions was forgotten, and he smiled to see his son as noisy and mischief-loving as before the September episode. The conspirators were for a time in terror of discovery, but the tones of the clavichord were so thin and muffled that their tinkling would never disturb a[Pg 116] drowsy garret mouse, much less penetrate the oaken floors to the chambers under foot. No one but Georg\u0027s mother ever visited the attic region, and during this important season, she chanced to be afflicted with acute rheumatic pain that prevented her climbing the steep stair leading to the treasure-house. The winter was a long one and cold, but Anna and Georg, in their high retreat, were as happy and comfortable as meadow-larks. Trunks, chests, old clothing, and discarded furniture abounded there; bunches of dried herbs were strung to the cross-beams, and cobwebs draped the outlying nooks; but the great chimney emitted a cosy warmth, and the clavichord provided unceasing entertainment. The clavichord provided unceasing entertainment \"The clavichord provided unceasing entertainment.\" As time went by, Anna\u0027s interest waned considerably, owing to the succeeding preparations of Christmas gifts, March birthday festivities, and spring finery; but when months had rolled away and summer suns were once more[Pg 117] ripening the fruit and coloring the flowers, Georg was as intently absorbed in the clavichord as on the day of its first appearance. One June morning he was starting for a day\u0027s visit with some cousins who lived on the most fashionable street in Halle. He was attired for the occasion in his best suit of shining black satin. A deep collar of Mechlin lace, a pair of gleaming silver shoe-buckles, and a silver cord wound around his broad black beaver filled him with satisfaction as he emerged from the house door. At this juncture Mr. H?ndel drove into the gravelled plaza lying between stable and street, and Georg observed with surprise that the carriage was festooned with yellow streamers, that Mummer, the staid mare, was groomed until she shone, and tricked out in the yellow harness and tassels reserved for state occasions. \"Where are you going, father?\" called Georg. [Pg 118] \"To Weisenfels. The duke sent for me this morning. He wishes a report of the state of health in Halle.\" \"Oh, father, please take me with you! I\u0027ve never seen the court, and I want to go so much!\" \"Not this time, Georg. I have business to attend to, and I cannot look after you.\" \"You needn\u0027t look after me,\" insisted the lad, laying his hand upon the door of the slowly moving vehicle. \"I\u0027ll be good and do everything you say, and Christian will take care of me. Please, father, take me!\" \"No, no! Some other time I\u0027ll take you, but this time I shall be too busy. Get up, Mummer!\" With the touch of the whip, the ancient mare broke into a gentle dogtrot, the only gait more swift than a walk in which she ever indulged. Georg saw the carriage roll through the gates and take the road toward Weisenfels. [Pg 119] To go to the duke\u0027s court was something that he had long desired, and this seemed a wholly favorable time for the undertaking. Had his father\u0027s denial been decisive, Georg would have accepted it with the best grace he could muster, and gone on about his visit; but he had seen that the surgeon was merely preoccupied, refusing the petition absently in order that his reflections should not be disturbed, rather than that he cared to forbid the journey. \"If he only knew how much I wanted to go, he would have said \u0027yes,\u0027\" thought Georg. \"Father nearly always lets me do things when I ask him. He really didn\u0027t hear what I said,—didn\u0027t hear inside him, I mean,—or he would have taken me. I\u0027ll go! I\u0027ll go anyway, and when I get there father will be sure to let me stay.\" Fired with this determination, Georg set off, running nimbly behind the carriage, taking pains all the while to keep out of the surgeon\u0027s sight. [Pg 120] Although Mummer was not very fleet as horses go, she jogged steadily along, and the boy, following close behind the carriage, began to wonder why she never stopped to catch her breath and cool herself. Up and down hill, over bridges, through strips of forest, went horse, carriage, and boy; and, as the sun blazed down, and the road grew dusty to choking, the last one of the procession became so hot and breathless that he feared he must stop or die. At twelve o\u0027clock the carriage drew up before a roadside inn; and when the hostler came to take charge of Mummer, Mr. H?ndel opened the door and stepped out upon the flower-bordered driveway. The flash of a silver hat-cord seemed to twinkle before his eyes, and seized with a sharp suspicion, the old gentleman strode quickly round to the back of the carriage only to see a pair of small black legs disappearing under the vehicle. [Pg 121] \"Georg!\" he ejaculated. \"Come out, instantly! What are you doing here?\" A dusty, sheepish boy crawled slowly into sight, murmuring confusedly as he rose,— \"I knew you\u0027d let me go if you thought about it, so I came—\" Dizzy from heat and fatigue, Georg clutched the wheel to keep himself from falling; and the surgeon took him anxiously by the shoulder. \"You foolish boy! What possessed you to undertake such a tramp! I didn\u0027t care particularly if you came. Here, let\u0027s go into the inn and get dinner! You will feel better when you have had warm food and time to rest. I\u0027ll send a messenger back to your mother, so she will know that you have come with me. You foolish child!\" The evening was spent in the ducal palace, whither the surgeon had been summoned with his professional report; and the novel sights and sounds proved so exciting to Georg that long after he[Pg 122] was tucked into his cot he lay wide awake, thinking of all that he had enjoyed. When sleep did finally overtake him, he dreamed of the gayly uniformed guards stationed inside and outside the palace, of the massive corridors, rich with works of art, and the vast assembly room where the duke had held an audience, while he himself had looked down from an upper gallery upon the throngs of men and women, the flowers, the banners, and listened to the music wafted from the musicians\u0027 balcony opposite. Christian H?ndel, a nephew of Georg\u0027s, although more than twice the boy\u0027s age, was a member of the duke\u0027s train, and he had piloted the small visitor about the place, pointing out to him the things that would prove of especial interest. He had likewise introduced his young relative to the musicians, and they, attracted by the boy\u0027s straightforward manner and intelligent replies, cordially received him among them. Morning came before Georg realized[Pg 123] that he had been asleep, and with it, Christian, who shook him awake. \"Dress yourself quickly, Georg, for the duke goes to church this morning, and when he attends, nobody else in the house is permitted to stay away.\" Christian conducted Georg to the organ-loft, that he might better see the sumptuous chapel and the duke with his richly apparelled retinue passing in for service. The white-haired organist, whom Georg had met the night before, greeted him pleasantly; and Christian left him in care of the aged musician, while he hurried down to take his place among the crimson-clad retainers. When, an hour later, the duke sat in his apartment at breakfast, the sound of the organ fell upon his ear. Himself a passionate lover of music, he could readily distinguish the touch of the various players at court; but this soft and unfamiliar strain caused him to bend forward with a puzzled look. Gradually[Pg 124] the music grew more distinct, and soon the palace resounded with a strong and stately melody. \"Who is at the organ?\" the duke demanded suddenly, glancing inquiringly at one of his attendants. \"It is the little H?ndel from Halle, your grace,\" replied Christian. \"A relative of yours?\" The young man blushed, for he was unwilling to confess to an eight-year-old uncle; but he told the truth and satisfied his pride by explaining distinctly,— \"He is my grandfather\u0027s youngest son.\" \"Bring him hither, and his father also.\" Christian disappeared, and presently Mr. H?ndel entered by one door, just before his son and grandson appeared on the threshold of the other. The duke motioned the old gentleman to a distant corner, and beckoned the boy to approach. Georg, bereft of Christian\u0027s support, and unaware of his father\u0027s presence, [Pg 125]became so frightened that his breath almost failed as he advanced, and he wondered wildly if the trembling of his knees could be detected by the company. He carried his black beaver on his arm, as he had seen the courtiers do, and when he came within a few feet of the ducal chair, he bowed with a curious little bob that set the whole room laughing. \"Silence!\" commanded the duke sternly; then turning, he kindly asked his small auditor what his name might be. \"Georg Friedrich H?ndel,\" replied the boy tremulously, but with the sound of his own voice his terror dissolved, and he stood before the Duke of S?chse with respectful composure. \"When did you learn to play the organ, my manikin?\" \"This morning, your grace.\" \"This morning!\" echoed the duke, astounded. \"Can it be true that you have never tried the instrument before to-day?\" [Pg 126] \"Well, you see, we have no organ at home,\" returned Georg apologetically. The duke studied him for a moment, as though seeking for traces of falsehood, but Georg\u0027s utter simplicity was strangely convincing. Quietly the duke put his next question. \"Upon what instruments have you played before?\" \"Last winter and this summer I have played every day on my aunt\u0027s clavichord, your grace.\" Here a loud gasp was heard from a distant corner, but the duke frowned for silence. \"And what before the clavichord, my boy?\" \"A mouth organ, a tin trumpet, a fife, a drum, and a dinner-bell, your grace.\" A dozen irrepressible titters burst from the attendants, but the duke grew very grave. \"And that is all, lad?\" \"All, your grace.\" \"No lessons?\" [Pg 127] \"No—except when Aunt Anna and I taught each other. But you mustn\u0027t tell father about the clavichord, your grace, because it is a secret, and father told me to give away my own instruments, and Aunt Anna wouldn\u0027t like to give away her clavichord, so please don\u0027t let him know about it.\" \"I am afraid that he knows already,\" said the duke, smiling; and at his signal, the Halle surgeon emerged from his corner, pale with amazement. Georg was so confounded at sight of his parent, that, unable to meet his expected look of condemnation, he buried his face in the folds of the duke\u0027s breakfast cloth. \"I am sorry, Mr. H?ndel,\" said the duke, \"that I betrayed the child\u0027s secret. Had I known there was anything confidential in the interview, I should have held it in private. But now that the mischief is done, will you tell me why you oppose the musical study that Georg desires?\" [Pg 128] \"Merely, your grace, because he neglects his school for music when I allow it. I am a music-lover myself, but I wish to educate my son for a jurist, and I cannot have the plan interfered with, even by music.\" \"Let me suggest, then, that you allow the music lessons and compel the school lessons, taking away the instrument if he fails at school; and when he is old enough and wise enough to be a jurist, he will be capable of choosing for himself the work of his life.\" \"I thank you, your grace! The advice is fair and judicious, and I shall be happy to act upon it. If I have made a mistake, it was out of concern for the child\u0027s best good, your grace.\" \"An error on the safe side, Mr. H?ndel. A-ha, my small minstrel, do you hear how your father and I have arranged matters?\" Georg had not fully understood the conversation, but he gathered that the duke had somehow persuaded the [Pg 129]surgeon to allow his little son to play upon the clavichord as much as he wished, if he were faithful at school. \"Does the prospect please you?\" asked the duke, his eyes twinkling. \"It does, it does!\" cried Georg, his face radiant. \"I am obliged to your grace, and I am sure that you are almost as good and fine a person as my Aunt Anna.\" One night, in London, a concert was given at a certain music-hall, and the money earned from the sale of tickets was to be used to relieve the poor children of the city. Such a throng of people crowded into the hall that every seat was promptly filled, and the door-keepers were obliged to turn away many who desired to attend. King George II. appeared in the royal box, and when he had been respectfully saluted by the people, the hall grew still. The stage was filled with singers, and[Pg 130] soon the room resounded with the thrilling notes of a new piece called \"The Messiah.\" The people had expected to be only pleasantly entertained, but as one strain followed another, they bent forward entranced. Such harmonies they had never listened to before, and the people in the hall were moved to the point of tears. At length the sounds grew so impressive that the king could contain himself no longer, but leaped to his feet. Instantly the people, following the lead of their sovereign, rose impulsively in their places, and so standing, they waited until the glorious chorus was ended. Throughout the performance, a fine old gentleman sat quietly on the stage near the singers, listening intently. His face wore a look of noble earnestness, and he did not smile until the last note died away, and from every part of the house voices cried,— \"H?ndel! H?ndel!\" [Pg 131] For a moment he did not respond to their calls, but as the hall fell into a tumult, and the shout increased to a deafening roar, the white-haired gentleman rose and quietly bowed. This did not satisfy the crowd, and from above, below, from right and from left, excited men and women demanded that he should play for them. The old gentleman bowed again, but finding that the audience would not depart until he had yielded to its desire, he turned toward the massive organ at his right. Before he had taken a step, one of the singers hurried to his side, laid a hand upon his arm, and conducted him slowly to the organ-bench. Then it was that any stranger would have learned what all London understood,—that the courtly old gentleman was blind. At the first rich chord from the organ, a hush fell upon the room, and when the silvery-haired musician finished, and rose to his feet with another stately bow, the[Pg 132] people silently filed out, too stirred by the grandeur of his music for ordinary speech. That night, in the city of London, hundreds of suffering and friendless children were gathered into places of refuge, and were fed, warmed, and clothed with the money earned by the genius and loving-kindness of Georg Friedrich H?ndel.","sourceLink":"http://novel.tingroom.com/jingdian/1858/53843.html","bookId":832,"book":{"id":832,"title":"Boys Who Became Famous Men","description":"简介： One summer morning, long ago, a small boy guarded his father\u0027s sheep on a hillside in the Apennines. Up and down the stony pasture he trod, driving back the lambs who strayed too far, and trying all the while to keep his wayward charges in a group wh...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1858","creation":"Aug 1, 2019 12:19:37 AM","modification":"Aug 1, 2019 12:19:37 AM"}}
