{"id":16294,"no":28,"title":"CHAPTER XXVIII. THE TRIAL.","content":"As the day of trial drew nigh, the anxiety and activity of Joseph\u0027s friends increased, so that even the quiet atmosphere wherein he lived was disturbed by it. He could not help knowing that they were engaged in collecting evidence, but inasmuch as Philip always said, \"You can do nothing!\" he forced himself to wait with such patience as was possible. Rachel Miller, who had partly taken the hired man, Dennis, into her confidence, hermetically sealed the house to the gossip of the neighborhood; but her greatest triumph was in concealing her alarm, as the days rolled by and the mystery was not yet unravelled. \\n\\n \\n\\n There was not much division of opinion in the neighborhood, however. The growing discord between husband and wife had not been generally remarked: they were looked upon as a loving and satisfied couple. Joseph\u0027s integrity of character was acknowledged, and, even had it been doubted, the people saw no motive for crime. His action in demanding a legal investigation also operated favorably upon public opinion. \\n\\n \\n\\n The quiet and seclusion were beneficial to him. His mind became calmer and clearer; he was able to survey the past without passion, and to contemplate his own faults with a sense of wholesome bitterness rather than pain. The approaching trial was not a pleasant thing to anticipate, but the worst which he foresaw was the probability of so much of his private life being laid bare to the world. Here, again, his own words returned to condemn him. Had he not said to Lucy, on the morning of that fatal day, \"I am sick of masks!\" Had he not threatened to follow Julia with his own miserable story? The system of checks which restrain impulse, and the whirl of currents and counter-currents which govern a man\u0027s movement through life, began to arrange themselves in his mind. True wisdom, he now felt, lay in understanding these, and so employing them as to reach individual liberty of action through law, and not outside of it. He had been shallow and reckless, even in his good impulses; it was now time to endure quietly for a season what their effect had been. \\n\\n \\n\\n The day previous to the trial Philip had a long consultation with Mr. Pinkerton. He had been so far successful that the name and whereabouts of the travelling agent had been discovered: the latter had been summoned, but he could not possibly arrive before the next day. Philip had also seen Mr. Blessing, who entered with great readiness into his plans, promised his assistance in ascertaining the truth of Madeline\u0027s suspicion, and would give his testimony as soon as he could return from New York, whither he had gone to say farewell to Mrs. Clementina Spelter, before her departure for Paris on a bridal journey. These were the two principal witnesses for the defence, and it was yet uncertain what kind of testimony they would be able to give. \\n\\n \\n\\n \"We must finish the other witnesses,\" Mr. Pinkerton said, \"(who, in spite of all we can do, will strengthen the prosecution), by the time you reach here. If Spenham gives us trouble, as I am inclined to suspect, we cannot well spare you the first day, but I suppose it cannot be helped.\" \\n\\n \\n\\n \"I will send a telegram to Blessing, in New York, to make sure,\" Philip answered. \"Byle and Glanders answer for their agent, and I can try him with the photograph on the way out. If that succeeds, Blessing\u0027s failure will be of less consequence.\" \\n\\n \\n\\n \"If only they do not reach Linthicum in the mean time! I will prolong the impanelling of the jury, and use every other liberty of delay allowed me; yet I have to be cautious. This is Spenham\u0027s first important case, and he is ambitious to make capital.\" \\n\\n \\n\\n Mr. Spenham was the prosecuting attorney, who had just been elected to his first term of service in that capacity. He had some shrewdness as a criminal lawyer, and a great deal of experience of the subterranean channels of party politics. This latter acquirement, in fact, was the secret of his election, for he was known to be coarse, unscrupulous, and offensive. Mr. Pinkerton was able to foresee his probable line of attack, and was especially anxious, for that reason, to introduce testimony which would shorten the trial. \\n\\n \\n\\n When the hour came, and Joseph found that Philip was inevitably absent, the strength he had summoned to his heart seemed to waver for an instant. All his other friends were present, however: Lucy Henderson and Madeline came with the Hopetons, and Elwood Withers stood by his side so boldly and proudly that he soon recovered his composure. \\n\\n \\n\\n The court-room was crowded, not only by the idlers of the town, but also many neighbors from the country. They were grave and silent, and Joseph\u0027s appearance in the place allotted to the accused seemed to impress them painfully. The preliminaries occupied some time, and it was nearly noon before the first witness was called. \\n\\n \\n\\n This was the physician. He stated, in a clear, business-like manner, the condition in which he found Julia, his discovery of the poison, and the unusual character of its operation, adding his opinion that the latter was owing to a long-continued nervous tension, culminating in hysterical excitement. Mr. Spenham questioned him very closely as to Joseph\u0027s demeanor, and his expressions before and after the death. The point of attack which he selected was Julia\u0027s exclamation: \"Joseph, I will try to be different, but I must live for that!\" \\n\\n \\n\\n \"These words,\" he said, \"indicate a previous threat on the part of the accused. His helpless victim—\" \\n\\n \\n\\n Mr. Pinkerton protested against the epithet. But his antagonist found numberless ways of seeming to take Joseph\u0027s guilt for granted, and thus gradually to mould the pliant minds of a not very intelligent jury. The physician was subjected to a rigid cross-examination, in the course of which he was led to state that he, himself, had first advised that the fact of the poisoning should not be mentioned until after the funeral. The onus of the secrecy was thus removed from Joseph, and this was a point gained. \\n\\n \\n\\n The next witness was the servant-woman, who had been present in the hall when Julia fell upon the landing of the staircase. She had heard the words, \"Go away! you have killed me!\" spoken in a shrill, excited voice. She had already guessed that something was wrong between the two. Mr. Asten came home looking quite wild and strange; he didn\u0027t seem to speak in his usual voice; he walked about in a restless way, and then went into the garden. Miss Lucy followed him, and then Mrs. Asten; but in a little while she came back, with her dress torn and her arms scratched; she, the witness, noticed this as Mrs. Asten passed through the hall, tottering as she went and with her fists shut tight. \\n\\n \\n\\n Then Mr. Asten went up stairs to her bed-room; heard them speaking, but not the words; said to Sally, who was in the kitchen, \"It\u0027s a real tiff and no mistake,\" and Sally remarked, \"They\u0027re not used to each other yet, as they will be in a year or two.\" \\n\\n \\n\\n The witness was with difficulty kept to a direct narrative. She had told the tale so often that every particular had its fixed phrases of description, and all the questioning on both sides called forth only repetitions. Joseph listened with a calm, patient air; nothing had yet occurred for which he was not prepared. The spectators, however, began to be deeply interested, and a sharp observer might have noticed that they were already taking sides. \\n\\n \\n\\n Mr. Pinkerton soon detected that, although the woman\u0027s statements told against Joseph, she possessed no friendly feeling for Julia. He endeavored to make the most of this; but it was not much. \\n\\n \\n\\n When Lucy Henderson\u0027s name was called, there was a stir of curiosity in the audience. They knew that the conference in the garden, from which Julia had returned in such an excited condition, must now be described. Mr. Spenham pricked up his red ears, ran his hand through his stubby hair, and prepared himself for battle; while Mr. Pinkerton, already in possession of all the facts, felt concerned only regarding the manner in which Lucy might give them. This was a case where so much depended on the impression produced by the individual! \\n\\n \\n\\n By the time Lucy was sworn she appeared to be entirely composed; her face was slightly pale, but calm, and her voice steady. Mrs. Hopeton and Madeline Held sat near her, and Elwood Withers, leaning against a high railing, was nearly opposite. \\n\\n \\n\\n There was profound silence as she began, and the interest increased as she approached the time of Joseph\u0027s return. She described his appearance, repeated the words she had heard, reproduced the scene in her own chamber, and so came, step by step, to the interview in the garden. The trying nature of her task now became evident. She spoke slowly, and with longer pauses; but whichever way she turned in her thought, the inexorable necessity of the whole truth stared her in the face. \\n\\n \\n\\n \"Must I repeat everything?\" she asked. \"I am not sure of recollecting the words precisely as they were spoken.\" \\n\\n \\n\\n \"You can certainly give the substance,\" said Mr. Spenham. \"And be careful that you omit nothing: you are on your oath, and you ought to know what that means.\" \\n\\n \\n\\n His words were loud and harsh. Lucy looked at the impassive face of the judge, at Elwood\u0027s earnest features, at the attentive jurymen, and went on. \\n\\n \\n\\n When she came to Joseph\u0027s expression of the love that might have been possible, she gave also his words: \"Had there been, I should have darkened the life of a friend.\" \\n\\n \\n\\n \"Ha!\" exclaimed Mr. Spenham, \"we are coming upon the motive of the murder.\" \\n\\n \\n\\n Again Mr. Pinkerton protested, and was sustained by the court. \\n\\n \\n\\n \"Tell the jury,\" said Mr. Spenham, \"whether there had been any interchange of such expressions between you and the accused previous to his marriage!\" \\n\\n \\n\\n This question was objected to, but the objection was overruled. \\n\\n \\n\\n \"None whatever!\" was the answer. \\n\\n \\n\\n Julia\u0027s sudden appearance, the accusation she made, and the manner in which Joseph met it, seemed to turn the current of sympathy the other way. Lucy\u0027s recollection of this scene was very clear and complete: had she wished it, she could not have forgotten a word or a look. In spite of Mr. Spenham\u0027s angry objections, she was allowed to go on and relate the conversation between Joseph and herself after Julia\u0027s return to the house. Mr. Pinkerton made the best use of this portion of the evidence, and it seemed that his side was strengthened, in spite of all unfavorable appearances. \\n\\n \\n\\n \"This is not all!\" exclaimed the prosecuting attorney. \"A married man does not make a declaration of love—\" \\n\\n \\n\\n \"Of a past possible love,\" Mr. Pinkerton interrupted. \\n\\n \\n\\n \"A very fine hair-splitting indeed! A \u0027possible\u0027 love and a \u0027possible\u0027 return, followed by a \u0027possible\u0027 murder and a \u0027possible\u0027 remarriage! Our duty is to remove possibilities and establish facts. The question is, Was there no previous affection between the witness and the accused? This is necessary to prove a motive. I ask, then, the woman—I beg pardon, the lady—what were her sentiments towards the husband of the poisoned before his marriage, at the time of the conversation in the garden, and now?\" \\n\\n \\n\\n Lucy started, and could not answer. Mr. Pinkerton came to her aid. He protested strongly against such a question, though he felt that there was equal danger in answering it or leaving it unanswered. A portion of the spectators, sympathizing with Lucy, felt indignant at Mr. Spenham\u0027s demand; another portion, hungry for the most private and intimate knowledge of all the parties concerned, eagerly hoped that it would be acceded to. \\n\\n \\n\\n Lucy half turned, so that she caught a glimpse of Joseph. He was calm, but his eyes expressed a sympathetic trouble. Then she felt her gaze drawn to Elwood, who had become a shade paler, and who met her eyes with a deep, inscrutable expression. Was he thinking of his recent words to her,—\"If need comes to publish what I said to you, don\u0027t keep back a single word!\" She felt sure of it, for all that he said was in her mind. Her decision was made: for truth\u0027s sake, and under the eye of God, she would speak. Having so resolved, she shut her mind to all else, for she needed the greatest strength of either woman or man. \\n\\n \\n\\n The judge had decided that she was not obliged to answer the question. There was a murmur, here and there, among the spectators. \\n\\n \\n\\n \"Then I will use my freedom of choice,\" said Lucy, in a firm voice, \"and answer it.\" \\n\\n \\n\\n She kept her eyes on Elwood as she spoke, and compelled him to face her. She seemed to forget judge, jury, and the curious public, and to speak only to his ear. \\n\\n \\n\\n \"I am here to tell the whole truth, God helping me,\" she said. \"I do not know how what I am required to say can touch the question of Joseph Asten\u0027s guilt or innocence; but I cannot pause to consider that. It is not easy for a woman to lay bare her secret heart to the world; I would like to think that every man who hears me has a wife, a sister, or a beloved girl of his choice, and that he will try to understand my heart through his knowledge of hers. I did cherish a tenderness which might have been love—I cannot tell—for Joseph Asten before his betrothal. I admit that his marriage was a grief to me at the time, for, while I had not suffered myself to feel any hope, I could not keep the feeling of disappointment out of my heart. It was both my blame and shame: I wrestled with it, and with God\u0027s help I overcame it.\" \\n\\n \\n\\n There was a simple pathos in Lucy\u0027s voice, which pierced directly to the hearts of her hearers. She stood before them as pure as Godiva in her helpful nakedness. She saw on Elwood\u0027s cheek the blush which did not visit hers, and the sparkle of an unconscious tear. Joseph had hidden his face in his hands for a moment, but now looked up with a sadness which no man there could misinterpret. \\n\\n \\n\\n Lucy had paused, as if waiting to be questioned, but the effect of her words had been so powerful and unexpected that Mr. Spenham was not quite ready. She went on:— \\n\\n \\n\\n \"When I say that I overcame it, I think I have answered everything. I went to him in the garden against my own wish, because his wife begged me with tears and sobs to intercede for her: I could not guess that he had ever thought of me otherwise than as a friend. I attributed his expressions to his disappointment in marriage, and pardoned him when he asked me to forget them—\" \\n\\n \\n\\n \"O, no doubt!\" Mr. Spenham interrupted, looking at the jury; \"after all we have heard, they could not have been very disagreeable!\" \\n\\n \\n\\n Elwood made a rapid step forward; then, recollecting himself, resumed his position against the railing. Very few persons noticed the movement. \\n\\n \\n\\n \"They were very unwelcome,\" Lucy replied: \"under any other circumstances, it would not have been easy to forgive them.\" \\n\\n \\n\\n \"And this former—\u0027tenderness,\u0027 I think you called it,\" Mr. Spenham persisted, \"—do you mean to say that you feel nothing of it at present?\" \\n\\n \\n\\n There was a murmur of indignation all over the room. If there is anything utterly incomprehensible to a vulgar nature, it is the natural delicacy of feeling towards women, which is rarely wanting even to the roughest and most ignorant men. The prosecution had damaged itself, and now the popular sympathy was wholly and strongly with Lucy. \\n\\n \\n\\n \"I have already answered that question,\" she said. \"For the holy sake of truth, and of my own free-will, I have opened my heart. I did it, believing that a woman\u0027s first affection is pure, and would be respected; I did it, hoping that it might serve the cause of an innocent man; but now, since it has brought upon me doubt and insult, I shall avail myself of the liberty granted to me by the judge, and speak no word more!\" \\n\\n \\n\\n The spectators broke into applause, which the judge did not immediately check. Lucy\u0027s strength suddenly left her; she dropped into her seat and burst into tears. \\n\\n \\n\\n \"I have no further question to ask the witness,\" said Mr. Pinkerton. \\n\\n \\n\\n Mr. Spenham inwardly cursed himself for his blunder,—not for his vulgarity, for of that he was sublimely unconscious,—and was only too ready to be relieved from Lucy\u0027s presence. \\n\\n \\n\\n She rose to leave the court, Mrs. Hopeton accompanying her; but Elwood Withers was already at her side, and she leaned upon his arm as they passed through the crowd. The people fell back to make a way, and not a few whispered some honest word of encouragement. Elwood breathed heavily, and the veins on his forehead were swollen. \\n\\n \\n\\n Not a word was spoken until they reached the hotel. Then Lucy, taking Elwood\u0027s hand, said: \"Thank you, true, dear friend! I can say no more now. Go back, for Joseph\u0027s sake, and when the day is over come here and tell me, if you can, that I have not injured him in trying to help him.\" \\n\\n \\n\\n When Elwood returned to the court-room, Rachel Miller was on the witness stand. Her testimony confirmed the interpretation of Julia\u0027s character which had been suggested by Lucy Henderson\u0027s. The sweet, amiable, suffering wife began to recede into the background, and the cold, false, selfish wife to take her place. \\n\\n \\n\\n All Mr. Spenham\u0027s cross-examination failed to give the prosecution any support until he asked the question:— \\n\\n \\n\\n \"Have you discovered nothing whatever, since your return to the house, which will throw any light upon Mrs. Asten\u0027s death?\" \\n\\n \\n\\n Mr. Pinkerton, Elwood, and Madeline all felt that the critical moment had come. Philip\u0027s absence threatened to be a serious misfortune. \\n\\n \\n\\n \"Yes,\" Rachel Miller answered. \\n\\n \\n\\n \"Ah!\" exclaimed the prosecuting attorney, rubbing his hair; \"what was it?\" \\n\\n \\n\\n \"The paper in which the arsenic was put up.\" \\n\\n \\n\\n \"Will you produce that paper?\" he eagerly asked. \\n\\n \\n\\n \"I cannot now,\" said Rachel; \"I gave it to Mr. Philip Held, so that he might find out something more.\" \\n\\n \\n\\n Joseph listened with a keen, undisguised interest. After the first feeling of surprise that such an important event had been kept from his knowledge, his confidence in Philip\u0027s judgment reassured him. \\n\\n \\n\\n \"Has Mr. Philip Held destroyed that paper?\" Mr. Spenham asked. \\n\\n \\n\\n \"He retains it, and will produce it before this court to-morrow,\" Mr. Pinkerton replied. \\n\\n \\n\\n \"Was there any mark, or label, upon it, which indicated the place where the poison had been procured?\" \\n\\n \\n\\n \"Yes,\" said Rachel Miller. \\n\\n \\n\\n \"State what it was.\" \\n\\n \\n\\n \"Ziba Linthicum\u0027s Drug store, No. 77 Main Street, Magnolia,\" she replied, as if the label were before her eyes. \\n\\n \\n\\n \"Let Ziba Linthicum be summoned at once!\" Mr. Spenham cried. \\n\\n \\n\\n Mr. Pinkerton, however, arose and stated that the apothecary\u0027s testimony required that of another person who was present when the poison was purchased. This other person had been absent in a distant part of the country, but had been summoned, and would arrive, in company with Mr. Philip Held, on the following morning. He begged that Mr. Linthicum\u0027s evidence might be postponed until then, when he believed that the mystery attending the poisoning would be wholly explained. \\n\\n \\n\\n Mr. Spenham violently objected, but he again made the mistake of speaking for nearly half an hour on the subject,—an indiscretion into which he was led by his confirmed political habits. By the time the question was decided, and in favor of the defence, the afternoon was well advanced, and the court adjourned until the next day. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1815/52741.html","bookId":1041,"book":{"id":1041,"title":"Joseph and His Friend","description":"简介： Rachel Miller was not a little surprised when her nephew Joseph came to the supper-table, not from the direction of the barn and through the kitchen, as usual, but from the back room up stairs, where he slept. His work-day dress had disappeared; he w...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1815","creation":"Aug 1, 2019 12:24:13 AM","modification":"Aug 1, 2019 12:24:13 AM"}}
