{"id":70825,"no":23,"title":"Page 23","content":"\n What a rush, seeing Brandt’s take-charge side. In the last week she’d been thinking a lot about the kind of lover he’d be. And thank God sugarcoating his demands wasn’t his style.\n She barely got a peek at his cock before he commanded, “Hands on my thighs.” He grasped the base of his dick in his right hand and rubbed his cockhead across her lips. “Open.”\n Jessie let her eyes drift shut in anticipation of tasting him, of pleasing him, of pleasing herself by admitting how much she wanted this, wanted him.\n His gentleness during the slow glide across her lips, over her teeth and across her tongue, surprised her. As did the loving way he framed her face in his hands, sweeping his thumbs over her hollowed cheeks up to her temple. “Beautiful.”\n The musky, salty, utterly masculine flavor filled her mouth and zoomed straight to her core.\n His gentleness vanished without warning. He held her head tightly, angled her neck and rammed in fully so the base of his cock rested on her bottom teeth.\n She opened her throat against her immediate reaction to gag. She relaxed her jaw and sucked air in through her nose. The circumference of his dick was thick enough that her lips were stretched to the limit.\n But man, she loved this. Giving in to him. Giving it all to him.\n “Look at me.”\n The only things she could move were her eyes. The satisfaction in Brandt’s caused her heart to jackhammer. Caused her pulse to pound between her thighs. In that moment, she knew there was no going back. Anything that happened between them would be so much more than sex.\n “I’m gonna want you usin’ that mouth more. Swallow.”\n She did, but it wasn’t easy.\n “That’s it.” He withdrew, leaving just the head balanced on the edge of her teeth. “Use your tongue.\n Good. Oh, yeah, I like that.” Then he flexed his hips and buried his length into her throat again, starting the rapid in and out thrusting that told her he was already close to the edge.\n Mired in a sexual haze, Jessie listened to his play by play of what he wanted. Of how hot she looked.\n How sexy she was. How much he’d wanted her. She lost herself in the deep cadence of his voice. In the heat of his cock driving into the wetness of her mouth. In the feeling of connectedness to him. In his tenacity.\n He swore and stopped halfway in her mouth, until the tip rested on the back of her tongue. He said,\n “Suck. Jesus. Suck hard. Fuck.” He grunted and hot semen burst against her soft palette.\n She sucked and swallowed, tightening the seal on his spasming cock. Wanting to blow his mind.\n Wanting to keep this bond as long as he allowed. Those big, wonderful hands went from gripping her head to tenderly caressing her hair to tapping her jaw so he could slide his spent cock free from her mouth.\n Before he could get too far away or say anything, Jessie grabbed his butt. She pressed kisses to his left thigh, moving up to kiss his hipbone and over to rub her mouth across the trail of dark hair that started between his pectorals and ended right there. He twisted her hair between his fingers as she nuzzled this sexy part of him.\n “Jess.”\n “Hmm?” He smelled so good in this spot. She nuzzled again.\n “Enough. Baby. You’re killin’ me.”\n She froze mid-kiss, not daring to look at him. “You don’t like it?”\n “I love it. But it’s my turn now.” He stepped back.\n Jessie glanced up just as Brandt dropped to his knees. Oh man. He wasn’t looking at her face. At all.\n A delicious curl of heat ebbed through her.\n His hands circled her hips. He slid the lower half of her body off the couch cushion, practically ripping off her panties, uttering a terse, “Brace yourself.”\n She scrambled to lock her arms when Brandt’s rough-tipped fingers scraped the top of her thighs as he spread her knees apart.\n A half snarl left his throat. He snagged an extra pillow and tapped her butt in a signal for her to raise her hips. The soft velvety fabric brushed her bare ass. Ooh. That felt nice.\n But not as nice as Brandt’s soft, velvety tongue brushing her sex from bottom to top.\n She gasped when he did it again. And again. And again.\n His fingers opened her pussy completely, baring every wet inch, allowing Brandt to taste every wet inch. Thoroughly. Burrowing his tongue into her channel, retreating to delicately lick her folds. Using his mouth in ways that caused her body to twitch and tingle. In ways that had her making noises she’d never heard before.\n No play by play this time. Brandt’s mouth was too busy driving her higher and higher until she feared she’d combust.\n Almost embarrassing how short her fuse was. The zip down her spine of impending pleasure was a brief warning—a microsecond later, she exploded. Imploded. Went sailing headlong into bliss. She arched back and gasped. Her legs shook. Her arms shook. Her internal organs shook.\n This man had the power to shake her to her very core.\n After the trembling stopped, she peered down at him, expecting he’d be gazing at her with a cocky grin, because oh, yeah, he’d rocked her world. But Brandt’s dark head was pressed into her lower belly as he fought to level his breathing.\n She smoothed her hands over the short hair on his scalp. The stubble on his head felt as funky and cool beneath her palms as it did between her thighs. Just touching him reinforced her feeling of rightness.\n Of the sense of security and trust he gave her. Yet, he made her feel like a hot-bodied porn star. “You okay?”\n “I should be askin’ you that,” he muttered against her skin.\n “I’m excellent. That was—”\n Suddenly, he pushed away from her and rolled to his feet. “Ah. I need to get something.” He yanked his duster on over his naked body, shoved his feet into his over boots and booked it out the door.\n What the hell?\n Panic seized her. Had she done something wrong? Why had he just up and left?\n They always leave you. Haven’t you learned that by now?\n This couldn’t be happening. Jessie was trying to process Brandt’s retreat when the door slammed. A muffled thump echoed to her as boots hit the carpet.\n Then he stood in front of her. “Jess? What’s wrong?”\n Startled, she tore her gaze from her feet. “I thought you left.”\n “What? No! No way. I said I’d be right back, didn’t I?”\n “No, you didn’t.”\n He crouched down and tilted her chin up. “I’d never do that to you. Never up and leave you. And it has nothin’ to do with you sitting here nekkid.”\n He brought her mouth to his for a prolonged kiss that soothed as well as aroused. If he could read her so perfectly now, what would it be like after they really got to know each other intimately?\n Paradise.\n “So you tired?” he asked in a husky tone that dripped with bedroom prowess.\n “Not at all.”\n “Good.” He tugged her to her feet, stalking her with another show of masculine grace, backing her down the hallway with such raw possession she could scarcely breathe. No man had ever looked at her like that.\n After he shut the bedroom door, she said, “Where’d you go?”\n Brandt shucked off his coat. He tossed a box of condoms and an unopened tube of lube on the bed.\n “Kept them in my truck. Just in case.” He offered her a shy smile. “I never assumed anything, just wanted you to know that.”\n No, like a true gentleman he wouldn’t assume, but like a true boy scout he was prepared. Another little shiver of desire rippled through her. “Oh. Well, we don’t have to use the condoms, if you’d rather skip it. I’m on the pill.”\n “Why? When you haven’t…”\n “Keeps my cycle regular. But if you’re used to using them, then that’s okay with me.”\n “No condoms.” He slowly dragged his hungry gaze over her body with a terse, “On the bed on your hands and knees.”\n When Jessie hesitated, Brandt made the warning growl that meant there was no room for argument.\n Okay, the big, bad wolf was back. She faced the headboard. The mattress dipped as Brandt joined her.\n She flinched when his big hands circled her ankles and widened her stance.\n Brandt stilled behind her. “Jess? Am I scaring you?”\n “No.”\n “Why’d you flinch when I touched you?”\n “You surprised me.”\n He draped his body over hers—his chest to her back.\n “You’re cold.”\n “It is November and I was just running outside nekkid.” He brushed aside her hair and kissed the back of her neck.\n She shivered.\n “Now that’s the kind of shiver I like,” he murmured. “I want you. You ready or do I need lube?”\n “I’m ready. Are you ready?”\n Brandt answered by sliding into her slowly to the hilt. He continued to pepper warm, soft kisses across the slope of her shoulder.\n She savored the sensation. Nothing in the world compared to this heat and fullness and connection.\n “I love it when you kiss me like that.”\n “I could spend hours kissing every inch of your skin. Next time, I will.”\n She turned her head and looked at him when she noticed his body vibrated. “Are you still cold?”\n “No.”\n “Then why are you shaking?”\n “Because I’m tryin’ not to rut on you. I’m not feelin’ real…gentlemanly, if you wanna know the truth.” His lips tickled her ear. “I know this is our first time but it doesn’t change my body wantin’ to fuck you hard.”\n That admission caused a gush of moisture to flood her sex. She moaned.\n He sucked in a swift breath. “The thought of me fucking you hard makes you wet?”\n “Everything you’ve done to me so far makes me wet.”\n “Reach your arms above your head.”\n Jessie pressed the side of her face into the mattress as she gripped the rungs on the headboard.\n “Look at you, so goddamn sexy stretched out like that.” His calluses scraped her skin as he swept his hands down the length of her back to circle her hips. He pulled out and slammed back in quickly. \n","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-23.html","bookId":2691,"book":{"id":2691,"title":"Cowgirls Don\u0027t Cry (Rough Riders #10)","description":"Storyline: \n Cowgirls Don\u0027t Cry (Rough Riders #10) \n Good girls can play rough too... \n Rough Riders, Book 10 \n Jessie McKay has accepted her marriage to Luke McKay wasn\u0027t perfect. After two years of widowhood, she\u0027s ready to kick up her bootheels-until Luke\u0027s younger brother shows up to spoil her fun. But if Brandt thinks she\u0027ll ever take orders from another McKay male, he\u0027s got manure for brains. \n Brandt McKay has avoided his sweet, sexy sister-in-law ever since the night he confessed his feelings for her weren\u0027t the brotherly type. Unexpectedly faced with proof of Luke\u0027s infidelity, Brandt is forced to ask for Jessie\u0027s help in taking care of Luke\u0027s young son. Jessie agrees on one condition-she wants Brandt\u0027s boots exclusively under her bed for the duration. \n The sexual heat that\u0027s always simmered between them ignites. Brandt is determined to make the temporary situation permanent, proving to Jessie he\u0027s a one-woman man. And Jessie is shaken by feelings she\u0027s sworn never to have again for any man...especially not a McKay.Warning: Contains branding-iron-hot sex, the one McKay on earth who wants to be tamed, and a woman who\u0027s decided tame is for nice girls who finish last.\n \n","cover":"https://allnovel.net/images/cowgirls-don-t-cry-rough-riders-10.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:17:25 AM"}}
