{"id":70847,"no":45,"title":"Page 45","content":"\\n\\n A while later, Brandt entered the bedroom. She heard his clothes hitting the floor and felt the mattress dip. Then his warm body connected with hers. He wrapped one arm around her waist, one arm stretched under her pillow, tangling their legs together so they were touching from head to toe.\\n\\n As Brandt toyed with her hair, so sweetly, so soothingly, Jessie released some of her tension.\\n\\n “We will figure this out, Jessie,” he said softly.\\n\\n She had figured it out. He just needed to accept it.\\n\\n Later, when he thought she’d fallen asleep, and he whispered, “Don’t make me choose, Jessie, please don’t make me choose,” she feared he already had.\\n\\n They both had.\\n\\n “It’s only for a few hours. I promise.”\\n\\n Jessie scowled at him. “Why do I have to go?”\\n\\n Brandt couldn’t resist kissing her scowling mouth. “Because I don’t wanna leave you alone on Christmas Day. In and out quickly, I promise. Landon will open his gifts from my mom, we’ll eat dinner and then we’re gone.”\\n\\n “Will your dad be there?”\\n\\n Brandt rolled his eyes. “What do you think?”\\n\\n “I think you’ve already broken two of my original stipulations,” she muttered.\\n\\n And the morning had been going so well.\\n\\n Jessie sighed. “Fine. Am I supposed to buy a gift for your mom?”\\n\\n “No. Why?”\\n\\n “Don’t you guys open presents on Christmas Day?”\\n\\n “Yeah, but we don’t give each other gifts.”\\n\\n “Why not?”\\n\\n “To be honest, we never really did.”\\n\\n She frowned. “But the year I was there, you guys exchanged gifts.”\\n\\n “With you,” he pointed out. “Not with each other. Luke told us we’d better get you something since you intended to give each of us a gift. Luke wanted to pretend, for your sake, that we had the same type of normal Christmas everyone else did.”\\n\\n “You didn’t celebrate Christmas at all? Ever?”\\n\\n “We must’ve for a while when we were kids. I think Luke broke the news to Dalton that Santa wasn’t real when Dalton was around five. Dalton asked Dad if it was true and that was the end of presents on Christmas morning.”\\n\\n Jessie turned back toward the sink. “That’s sad. Now I really don’t want to go.”\\n\\n “But my mom loved it the year you were there. Gave her an excuse to put up a tree and do the holiday stuff she hadn’t done in years.”\\n\\n “And gave your father another reason to resent me. Which is all the more reason to be thankful, I guess.” She sighed and sank her hands all the way into the dishwater.\\n\\n “Thankful for what?”\\n\\n “Thankful I didn’t end up like your mom, because God knows I was headed that direction. Luke McKay’s mouse-like wife who wouldn’t rock the boat even if it was about to go sail a waterfall.”\\n\\n “I never saw you that way, Jess.”\\n\\n “You’re the only one.”\\n\\n Brandt curled his hands around her hips and bent his head to taste that sweet section of skin below her ear. “As far as I’m concerned, I’m the only one who matters.”\\n\\n She murmured, “Brandt,” but she didn’t attempt to pull away.\\n\\n “So…” His lips moved up to nibble on her earlobe, “Landon is napping. Wanna get nekkid and wild?”\\n\\n “Maybe when I finish the dishes.”\\n\\n He growled, “That’s it,” and yanked her hands out of the water, spinning her to face him. “I haven’t been paying enough attention to you if you’d rather do the dishes than do me.”\\n\\n Jessie laughed. “I am feeling neglected. We only had sex once yesterday.”\\n\\n “Couch.” He kissed her hard. “Now.”\\n\\n A trail of clothes littered the floor from the kitchen to where they were naked on the couch.\\n\\n Brandt was ready to be inside her the instant his bare ass hit the cushion and he had a naked, wiggling Jessie on his lap. But he forced himself to slow down. To take the time to marvel that this gorgeous, sexy, spontaneous woman wanted him. That she was his.\\n\\n But for how long?\\n\\n Forever, if he had his way, but he knew Jessie wasn’t ready to hear that from him yet. He didn’t believe if it came right down to it she’d walk away from him and Landon, no matter what she said.\\n\\n Focus on the nekkid woman in front of you, man.\\n\\n He kissed down the delectable arch of her neck. Once his mouth reached the upper swell of her breasts, he urged, “Lean back.”\\n\\n Jessie placed her hands on his thighs above his knees, and let her head fall back, giving her body the most beautiful curve, from the tip of her chin down to the angle of her hips.\\n\\n Sometimes the woman took his breath away.\\n\\n Brandt cupped her breasts in his hand, using his thumb and index finger to tug the right nipple into a tight point. He latched onto the left nipple and sucked. As he switched sides, he rubbed his face on her chest. He loved the sensation of her soft, warm skin against his cheeks. Loved leaving tiny red marks from his razor stubble on her tender flesh.\\n\\n She moaned, pressing her chest against his mouth.\\n\\n He suckled, nipped and caressed every inch of her pretty tits until he felt her short nails biting into his thighs. Until he caught a whiff of her sweet cream.\\n\\n Brandt took her hand and put it on his cock, murmuring, “Take me in, Jess.”\\n\\n She drew the tip across her wet folds, catching the rim of his cockhead on her clit, stopping to rub it over and over. When he growled, she splayed her knees, lowered her pelvis and sheathed him completely.\\n\\n “That’s good. Goddamn that’s good.”\\n\\n “Better than dishes.”\\n\\n “Definitely.”\\n\\n His greedy hands were all over her skin. Down the softly rounded globes of her ass. The outside contour of her thighs. He reached between them, letting his finger trace the pliant skin stretching to accommodate his dick. Then his finger moved back a fraction of an inch, brushing over the pucker of her ass.\\n\\n Immediately Jessie stiffened.\\n\\n Brandt kept kissing her neck, stroking the sensitive ring, pressing against the resistance. Using the wetness from her body, Brandt pushed his finger inside her anal passage, up to the second knuckle. He let her body get used to the intrusion before he began to move his finger. Fucking that tight hole in the same rhythm she was fucking him. The muscle clamped down on his finger and he groaned, imagining his cock being squeezed so forcefully.\\n\\n “Brandt, what are you doing?”\\n\\n “Playin’. Seein’ how far you’ll let me go.”\\n\\n “That’s far enough.”\\n\\n He lightly scraped his teeth down her throat. “Okay. But I’ll point out that you like my finger teasin’\\n\\n your ass while I’m licking your pussy. You like my tongue teasin’ it while I’m licking your pussy too.\\n\\n Makes me wanna watch this sweet little hole stretching to take my cock. Don’t you want that?” He pumped his finger in and out, stopping to tease that ring, now that his finger had brought blood to those nerve endings.\\n\\n “No. I’m, ah, not fond of anal sex. It hurts.”\\n\\n It surprised him she and Luke had experimented with it, since Luke bragged he’d gone elsewhere to satisfy what he called his carnal needs.\\n\\n “Doesn’t have to hurt. We could go slow. I bet I could make you like it.”\\n\\n Jessie groaned as he flexed his hips and drove his cock in deeper. “You probably could, but right now I’m liking this a whole bunch. I’m close, but I need it harder.”\\n\\n He did too. He slapped her butt. “Get up for a second and turn around.”\\n\\n The pleasure fog in her eyes cleared and she frowned at him. “I don’t think—”\\n\\n Brandt laid a smacking kiss on her lips. “Don’t worry. I’m not gonna plow into your ass right now. If we switch to reverse cowgirl, I’ll be able to move better.” He kissed her again. “Faster.” One more soft smooch. “Harder.”\\n\\n “God yes.” She scrambled off his dick so fast he laughed.\\n\\n Scooting to the very edge of the couch, he repositioned her on his lap, facing forward, her knees by his hips. “Reach for the edge of the coffee table.” He pressed his hand over her mound, keeping her pelvis tilted so he could toy with her clit.\\n\\n She pushed back into him as he drove forward. “This position should be called frogger with my legs like this,” she panted. “And I don’t like how my ass is in the air.”\\n\\n “I love your ass in the air. It’s sexy.”\\n\\n “It’s weird.\\n\\n But Jessie’s tense body supported her statement. He stroked his thumb side to side on her clit in the way that made her forget everything but how good he could make her feel. “Come on, Jess. Let go. Let it take you.”\\n\\n “I can’t. This feels too much like…we’re trying to be circus performers.”\\n\\n Her words had the intended effect. He stopped moving. She pushed up to look at him. The uncertainty in her eyes was his undoing. As much as he loved to test their boundaries, their flexibility, there came a point when it wasn’t necessary, like now.\\n\\n Somehow he got her turned around. Somehow in the mix of arms and legs and strangely angled bodies, and the tightly pulled thread of need tethering them together, they ended up on the floor. Face to face, skin to skin. He put his lips by her ear and breathed, “Jessie McKay, you own me,” and slid inside her.\\n\\n Brandt rocked into her. Their pelvises moving in tandem. In opposition. In perfect synchronicity.\\n\\n A rush of wetness coated his cock and her cunt contracted around his shaft. He held still, letting her body drag him over the edge. He closed his eyes to lose himself in the moment. To lose himself in this woman he loved.\\n\\n As soon as Brandt’s cock quit pulsing and her contractions tapered off, Brandt lifted his head from where he’d buried it in the sweet spot of her neck.\\n\\n She grinned. Wickedly. “On the floor beneath the tree on Christmas Eve afternoon, Mr. McKay?\\n\\n Mmm. I feel so very naughty. Probably means Santa’s not coming tonight, huh?” \\n\\n","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-45.html","bookId":2691,"book":{"id":2691,"title":"Cowgirls Don\u0027t Cry (Rough Riders #10)","description":"Storyline: Cowgirls Don\u0027t Cry (Rough Riders #10) \\n Good girls can play rough too... \\n Rough Riders, Book 10 \\n Jessie McKay has accepted her marriage to Luke McKay wasn\u0027t perfect. After two years of widowhood, she\u0027s ready to kick up her bootheels-until Luke\u0027s younger brother shows up to spoil her fun. But if Brandt thinks she\u0027ll ever take orders from another McKay male, he\u0027s got manure for brains. \\n Brandt McKay has avoided his sweet, sexy sister-in-law ever since the night he confessed his feelings for her weren\u0027t the brotherly type. Unexpectedly faced with proof of Luke\u0027s infidelity, Brandt is forced to ask for Jessie\u0027s help in taking care of Luke\u0027s young son. Jessie agrees on one condition-she wants Brandt\u0027s boots exclusively under her bed for the duration. \\n The sexual heat that\u0027s always simmered between them ignites. Brandt is determined to make the temporary situation permanent, proving to Jessie he\u0027s a one-woman man. And Jessie is shaken by feelings she\u0027s sworn never to have again for any man...especially not a McKay.Warning: Contains branding-iron-hot sex, the one McKay on earth who wants to be tamed, and a woman who\u0027s decided tame is for nice girls who finish last.\\n","cover":"https://allnovel.net/images/cowgirls-don-t-cry-rough-riders-10.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:17:25 AM"}}
