{"id":70850,"no":48,"title":"Page 48","content":"Brandt returned from outside and Lexie shot out the door. Landon attempted to chase her, but Brandt caught him around his midsection with one hand. “Whoa, it’s cold and dark out there. And if Lexie’s runnin’ from you, she’s got good reason, so you need to stay put.” “Goggie!” “How about if we have that bath?” “No!” Landon became as limp as a worm. But Brandt was wise to his tricks. “Nice try, but you’re getting in the tub.” “No! No! No!” echoed down the hallway until the bathroom door shut. Jessie told herself if it’d been really bad news, Brandt would’ve told her instead of allowing Landon to distract him. She tidied up the toys, folded up the blankets, swept the floor. By the time she’d finished, a scrubbed Landon barreled toward her and didn’t stop until he’d hit her knees. “That was a fast bath tonight.” “Up!” She perched him on her hip and he curled into her, nestling his head on front of her shoulder. “I swear when you’re such a sweet-smelling, sweet-acting boy I can almost forgive how you torture my poor dog.” She smooched his crown. “Are you gonna read to him?” Jessie looked up and saw Brandt leaning in the doorjamb, wearing a pensive expression. “I’d planned to. Why?” “No reason.” Brandt smiled. “He just loves it.” A snuggly, attentive Landon was a treat after dealing with his rambunctious ways all day. She settled in the easy chair and grabbed the book on the top of the stack—a book about dinosaurs. Brandt draped Landon’s blanket over him and retreated to the kitchen. Landon’s eyes were drooping by the time she finished the story. She tucked him in his crib and he didn’t fuss about not having a bottle. She debated whether to crawl in the shower or find out what Brandt’s phone call was about. No contest. Brandt sat in the middle of the couch and patted his lap. “C’mere and give me some sugar.” “In a second. I need a drink.” She poured a glass of water and brought it back to the living room with her. “So you gonna tell me about the phone call? Or just distract me with sex?” His humor vanished. “Who was it?” “Samantha.” Jessie remained standing. “What did she want?” “To tell me she’d been released from the halfway house in Casper.” “When?” The muscle in Brandt’s jaw flexed. “When?” she repeated. “Five days ago.” “And she’s just calling you now?” “Evidently she had some stuff—” “I don’t want to hear you make excuses for her, Brandt.” “I’m not.” Brandt rubbed the line of his forehead where his hat usually rested. “It wasn’t her choice, it was a court thing. Anyway, she wants to meet with us. Specifically…you.” Jessie had the sensation of falling. Air rushing in her ears, her body bracing for that bone jarring impact. Everything blurred. “Jess?” She jumped. “What does she want?” “I don’t know.” She didn’t believe him, but picking a fight to get him to come clean wouldn’t be wise. “Where and when will this meeting take place?” “At the Pizza Barn in Moorcroft at noon.” He paused. “The day after tomorrow.” “She can take five fucking days to get her shit together and she gives us thirty-six hours?” “We knew this day was coming. It came more than month earlier than we expected, but it’s not a surprise.” “We’re just supposed to pack his stuff and hand him over?” Brandt’s inquisitive eyes trapped hers. “Yes. Isn’t that what you wanted?” No. I don’t know. I have no clue what I want anymore. Jessie fought a feeling of panic. However her hand remained steady as she drained the glass of water. “Yes, I suppose it is.” Silence. “Well, I’m gonna hit the hay. Night.” “Night, Jess. I’ll come to bed in a bit.” In her bedroom her fingers were numb as they worked the buttons on her western shirt. Somehow she stripped. Somehow she crawled in bed. Somehow she found the energy to berate herself for her emotional investment with the pesky kid when she’d sworn she wouldn’t let that happen. Yet, for the first time in her life, somehow she found the strength not to cry. Jessie, girl, you’re such a liar. Brandt had tried to remain neutral, to see if she would be honest and admit her once hard stance toward long term care involving Landon had softened. But she’d thrust out that stubborn chin, denied it and run away. But she couldn’t deny what he’d seen tonight. What he’d seen the last few months. Jessie’s patience, kindness, firmness and amusement regarding Landon. She loved him. Jessie had been exactly right. Landon would break her heart and there wasn’t a damn thing he could do about it. Because it was his fault. He’d brought that heartache right to her. Would she ever forgive him? He slipped into bed and spooned in behind her. He appreciated she didn’t feign sleep. “You wanna talk?” “Nope.” “You wanna fuck?” “Nope.” You want me to tell you I love you, I’ve loved you forever and I’m relieved I don’t have to choose between you and my nephew? Her answer would be nope to that too. Brandt hadn’t told Jessie that Samantha insisted all of Landon’s stuff be boxed up and ready to go. Maybe Samantha was proving she had the power. Maybe she was ready to become a parent to her son. He knew Jessie well enough that if he told her about Samantha’s request, she’d obsess about what it meant. He called his brothers and asked if they could take Landon tomorrow night, as they’d planned. It might be easier for everyone. That was a total fucking lie. This wouldn’t be easy on any of them. When Brandt informed her Landon would spend the night with Dalton and Tell, rather than them, Jessie fought her urge to lash out at him. We knew this day was coming. They’d watched TV like any other night. In bed, Brandt reached for her, like he did every night. His way of dealing with her melancholy wasn’t to match it with sweetness, but to counter it with heat. Lots of heat. Brandt hadn’t been content to stick with the tried and true. After whipping her into a frenzy by making her come three times, once with his fingers, once with his mouth and once with her vibrator, he pushed her on her back. While remaining on his knees, he hooked her right leg over his right shoulder. He turned her lower body sideways so he could imprison her left thigh between the back of his left thigh and his calf. Then he fucked her. He controlled everything. The depth of his thrusts. The spread of her pussy, and the contact point where her clit abraded his groin. Oh, it was breathtaking, watching his ferocious man master her. Teach her. Pleasure her. Mesmerized by the fire in his eyes, Jessie had just held on, as her body became his playground. He watched her breasts bounce with every deep thrust. He watched her bring herself to orgasm. He watched his cock shuttling in and out of her pussy. When Brandt started to come, he turned, sinking his teeth into the outside of her thigh right by his head, giving her the sexiest love bite she’d ever had. They’d both collapsed. He’d tucked her against his naked body, like he did every night, and drifted off. She slept for maybe an hour or two and then she’d lain in his arms, restless. She disentangled from his embrace and snuck out to the kitchen. A cup of hot herbal tea didn’t induce sleepiness. She didn’t dare clean or she’d wake Brandt. So she sat on the couch and tried to process everything that’d gone on the last three months. Jessie wasn’t sure why Samantha had insisted on talking to her face to face. Was Samantha gauging her fitness as Landon’s temporary guardian before she dropped the bomb she wasn’t ready to resume fulltime parenting responsibilities yet? For the past day, Jessie wrestled with the situation regarding Landon, the facts, the fears, the promises given and the promises broken. Mostly she weighed the promises she’d made to herself to keep an almost clinical detachment for the boy, to set a time limit for how long she’d allow herself to care for him. It was laughable now, thinking she could ever protect her heart from such a sweet soul, from Luke’s son. It was pitiful that she’d ever even tried. Since she’d insisted Brandt didn’t discuss anything involving Landon’s mother, she couldn’t bring up the fact she’d changed her mind about everything. Not until tomorrow. Chapter Twenty-Two Jessie loitered outside the Pizza Barn in Moorcroft. She kept her phone to her ear, pretending to be in the middle of an important conversation. Stop stalling. She pocketed her cell and entered the restaurant. Normally she took a second to breathe in the tangy scents of oregano, tomato sauce, spicy meat and cheese, and the earthy aroma of baking crust. But today, she didn’t smell a thing. Probably because you’re holding your breath. Two tables had customers. One booth held an older couple chowing down on pizza. A petite woman sat in the other booth, stirring a glass of soda. Had to be Samantha. Jessie’s heart galloped as she slowly crossed the room and stopped in front of the booth. “Samantha?” “Yes?” “I’m Jessie.” She slid into the opposite seat without being asked, and scrutinized the woman without apology. Samantha Johnston looked young now, so Jessie couldn’t fathom how young she must’ve looked two and a half years ago. Her body type was slight. Not busty. An air of fragility surrounded her. A feature Jessie recognized because she’d had that same trait when she’d met Luke McKay.","sourceLink":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10/page-48.html","bookId":2691,"book":{"id":2691,"title":"Cowgirls Don\u0027t Cry (Rough Riders #10)","description":"Storyline: Cowgirls Don\u0027t Cry (Rough Riders #10) Good girls can play rough too... Rough Riders, Book 10 Jessie McKay has accepted her marriage to Luke McKay wasn\u0027t perfect. After two years of widowhood, she\u0027s ready to kick up her bootheels-until Luke\u0027s younger brother shows up to spoil her fun. But if Brandt thinks she\u0027ll ever take orders from another McKay male, he\u0027s got manure for brains. Brandt McKay has avoided his sweet, sexy sister-in-law ever since the night he confessed his feelings for her weren\u0027t the brotherly type. Unexpectedly faced with proof of Luke\u0027s infidelity, Brandt is forced to ask for Jessie\u0027s help in taking care of Luke\u0027s young son. Jessie agrees on one condition-she wants Brandt\u0027s boots exclusively under her bed for the duration. The sexual heat that\u0027s always simmered between them ignites. Brandt is determined to make the temporary situation permanent, proving to Jessie he\u0027s a one-woman man. And Jessie is shaken by feelings she\u0027s sworn never to have again for any man...especially not a McKay.Warning: Contains branding-iron-hot sex, the one McKay on earth who wants to be tamed, and a woman who\u0027s decided tame is for nice girls who finish last.","cover":"https://allnovel.net/images/cowgirls-don-t-cry-rough-riders-10.jpg","author":"Lorelei James","type":"Western","source":"allnovel","link":"https://allnovel.net/cowgirls-don-t-cry-rough-riders-10.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:17:25 AM"}}
