{"id":101555,"no":39,"title":"Page 39","content":"“Monica, please.”\n She walked over and stood next to him. He was so close she could feel his frustration. It seemed to come off him in waves.\n “Why aren’t you good enough?” she asked again.\n Chet’s hands were braced against the windowsill, his knuckles white. A war was being waged within him and the battle seemed to be a fierce one. When he turned to face her, his eyes were dull with pain.\n “I murdered a man,” he shouted. “There, you know, now leave.” He pointed toward the door, his face growing red and angry. “Get out of my life, understand, before I ruin yours too.”\n The force of his anger rocked her, but Monica stood her ground. “I don’t know the circumstances,” she said shakily, “but if you killed him, then he must have deserved to die.”\n Chet jerked back as if she’d slapped him.\n “It doesn’t matter what you’ve done, I’ll always love you.”\n “No,” Chet cried, and then reached for her, hauling her into his arms. The strength of his embrace all but crushed her, but Monica didn’t care. There wasn’t anyplace else she would rather be than with Chet. He seemed to be drinking in her softness, as if it were as vital to him in that moment as oxygen.\n After a short while, he released a harsh shudder and relaxed his hold enough for her to breathe comfortably. He brushed the hair from her temple and kissed her there. “I’ll always love you, too,” he whispered brokenly.\n It felt like heaven to be in his arms. For the first time in days Monica felt whole, as if the part of her that had been missing had been found.\n “You’re right when you say he deserved to die. He was a drug lord and brought misery to thousands all for the sake of money and power. An easy death was too good for him. He deserved to suffer.”\n “Are you wanted by the police?”\n He shook his head and laughed shortly. “No, I was too smart for that. I goaded him into a fight and I knew, being the weasel he was, he’d go for his weapon. He did, but I was ready. After an investigation, it was decided that I acted in self-defense, but I knew the truth. I murdered him just as if I’d waited in a dark alley and shot him in the back. He didn’t have a chance.”\n “The gunshot wound,” she said, flattening her hand over the scar on Chet’s shoulder. She could feel it even through the material of his shirt. “That was when you were shot, wasn’t it?”\n “No,” Chet told her. “Not then.”\n “He scared you, though, didn’t he? Tell me what he did to you.”\n “None of that matters.” He released her then abruptly as if he feared her touch, and backed away. “You got the answer you wanted, now go.”\n “But, Chet—”\n “Go.”\n Monica flinched. “All right, but there’s something you should know.”\n “How much more of this is there?”\n “Not much, I promise you.” Her voice wobbled a bit, but with the strength of her pride she managed to keep it under control. “There’ll never be anyone who loves you more than I do.”\n “Monica.” He groaned. “Stop, please. This isn’t necessary.”\n “It is for me, so do me the courtesy of listening. Someday you’re going to look back on your life and regret this moment.”\n “The only thing I regret is not moving sooner. Another twenty-four hours and I would have been out of here. You couldn’t have waited one stinking day for this, could you?”\n “No,” she threw back at him. She didn’t know when the tears came, but she felt their moisture against her face and brushed them aside. “I’ll haunt you . . . or rather, my love will. I swear that’s what will happen. It doesn’t matter if you travel to the other side of the world, I’ll be there. It’s my face you’ll see when you look at another woman. And . . . and when you sleep, I’ll be there each and every night. You won’t be able to close your eyes without thinking of me, without knowing you walked away from the one woman in all this world who loves you.”\n “Damn it,” Chet stormed, his hands knotted into tight fists. “Next you’re going to tell me that you’re going to sacrifice your life for me. Listen, Monica, I don’t want you sitting here, believing that something’s going to happen that will change my mind. It’s over, understand? Over.”\n “Don’t worry,” she whispered and her shoulders quivered. “That’s what I came to tell you. I won’t be waiting for you, I can’t, Chet. I’ve wasted too much of my life already.”\n “Good,” he snapped. “That’s just the way I want it.”\n Jody had dreaded the office Christmas party for days. She never had been one who enjoyed these types of social gatherings, and generally didn’t stay beyond the first few minutes. Glen, however, thought the party the ideal time to announce their engagement to their peers.\n He’d presented her with a lovely engagement ring, a solitaire diamond that was large enough to feel heavy and awkward on her finger. She’d removed Jeff’s wedding ring years earlier, not because of any desire to put that part of her life behind her, but to satisfy her parents. Both were worried about her and although she’d hated it, she’d placed the simple gold band in her jewelry box to appease them.\n She could tell from the sounds drifting from the reception area that the party was underway. There were enough goodies to feed a small Third World country. Everyone had contributed something. Jody was guilty of overdoing it herself, bringing a large homemade cheese roll and several dozen gingerbread cookies Timmy had helped her bake the night before.\n Her mother was watching Timmy, and insisted Jody stay late and enjoy herself. Because she was with Glen, she was obligated to remain as long as her fiancé wanted.\n Glen came looking for her, his smile gentle. “You ready?” he asked.\n “Give me a moment to freshen up first, all right?”\n “Sure,” he said agreeably.\n It seemed for a couple engaged to be married, neither of them revealed a high degree of enthusiasm. Glen looked tired. Jody knew he was working hard on a difficult case and put a lot of time and effort into his client’s defense, but she strongly suspected his fatigue was something more than his workload.\n The restroom was several doors down the hall. Jody walked past a number of offices and wondered how many other Christmas parties were going on in the building that night.\n She’d just stepped into a cubicle in the ladies’ room when she heard two women.\n “You’re sure he’s engaged?” the first voice asked.\n “Yes. Lily took a good deal of delight in relaying the details to me.” The second woman sounded shaken and very close to tears.\n Jody bit down on her lower lip. Lily was an attorney who worked with Glen. Was it possible the two were referring to Glen and her? She wondered what she should do, or if she should say something.\n “Honestly, Maryann, what did you expect Glen to do? You told him in no uncertain terms that you weren’t interested in marriage.”\n Maryann. This was the woman Glen had mentioned, the one he’d once loved. Jody squeezed her eyes closed and tried to remember the particulars of his and Maryann’s romance. All she could recall was that Glen was convinced Maryann didn’t love him. Breaking off the relationship had devastated him. It was this common ground of loss in which their own relationship had been rooted.\n “I . . . I assumed we could live together,” Maryann told her friend. “Couples do that these days, you know, test the waters to see if they’re compatible. It seemed to be a reasonable thing to do in light of all the divorce cases I’ve handled over the years. Oh, damn,” she said, “I hate it when I cry. Look what it’s doing to my makeup.”\n “What are you going to do?”\n “About what?”\n Maryann’s voice faded and Jody assumed that was because she was studying her reflection in the mirror.\n “You aren’t going to let him go ahead with the wedding, are you?”\n “How can I stop him?” Maryann asked.\n “Tell him the truth.”\n Maryann hesitated, and when she spoke Jody could hear her tears. “I don’t even know what the truth is anymore.”\n “Tell him you’re in love with him.”\n “It’s too late for that. Oh, Shelly, honestly, you’re too much of a romantic to realize love doesn’t automatically fix everything.”\n “It does if you’re both willing to work at it,” Maryann’s friend insisted.\n Afraid of eavesdropping any longer Jody walked out of the cubicle. It was then that the two women realized they weren’t alone. Embarrassed, they both avoided looking in Jody’s direction. Taking advantage of their surprise, Jody quietly slipped out of the restroom.\n She returned to her office, walking past the merrymakers, needing some time alone to absorb what she’d learned. Sitting at her desk, she closed her eyes and tried to reason out what she should do.\n The answer should have been far less complex than she was making it. Her sense of fairness said she needed to break off the engagement and explain what she’d heard to Glen. It was an ironic twist that in all the time she’d worked in the building she would meet Maryann now and overhear the conversation she had.\n Yet there was a part of her that yearned to give her son the father he longed for, the man who would gently guide him through life. Timmy enjoyed Glen’s company so very much. Her son had never been happier than the last few weeks when she’d been dating the attorney.\n The real question was if Jody had it in her to grab hold of happiness, however limited, at the expense of another. Having placed the question in that frame, she knew instantly that she had no choice.\n “I thought I saw you,” Glen said, stepping into the small office. “What are you doing back here?”\n Jody looked up from her desk and blinked, surprised to see him.\n “What’s wrong?” Glen asked. He was a gentle, sensitive man, Jody realized, and she was going to miss him dreadfully. But not nearly as much as Timmy would.\n “Sit down,” Jody said.\n “Jody?” His eyes held hers as he sat.\n She stared down at her hand and the beautiful diamond. Before she could find an excuse, she slipped the ring from her finger. “I should never have accepted this,” she whispered.\n “Why not?”\n She held the ring out to Glen, but he didn’t take it.\n “We aren’t in love,” Jody said and her chest tightened with regret. “You’re a special man and you deserve a woman who will love and treasure you with all her heart.”\n “You’re that woman,” Glen insisted.\n “We both know that isn’t true. If there was anything special about me, it was the fact that I have a son. Timmy was the real attraction. He represents the family you’ve always wanted. The son you long to have. I made a mistake too,” she said, expelling her breath in a rush. “I hurried matters and all but proposed to you myself, long before either of us was ready for a committed relationship. I’m not exactly sure why I found it so urgent for us to marry so soon. Especially when I realized neither of us is anywhere near being ready.” \n","sourceLink":"https://allnovel.net/a-season-of-angels-angels-everywhere-1/page-39.html","bookId":2625,"book":{"id":2625,"title":"A Season of Angels (Angels Everywhere #1)","description":"Storyline: \n A Season of Angels (Angels Everywhere #1) \n A heartwarming story of love and joy from bestselling author Debbie Macomber. Three angels are each given a prayer request to answer during the four weeks before Christmas. But there\u0027s a catch: each angel must teach her charge a memorable lesson before the wish is granted.\n \n","cover":"https://allnovel.net/images/a-season-of-angels-angels-everywhere-1.jpg","author":"Debbie Macomber","type":"Christian","source":"allnovel","link":"https://allnovel.net/a-season-of-angels-angels-everywhere-1.html","creation":"Oct 5, 2019 8:58:57 AM","modification":"Oct 5, 2019 10:03:18 PM"}}
