{"id":94268,"no":34,"title":"Page 34","content":"“It’s okay, Nix.” She wheeled on him. “Okay? No, it’s not okay! Don’t you get it? I told Zak that my mom knew about the Lost Girl, and I think that’s why Charlie came to the house. It’s because of what I said!” She hissed the last words at him in a voice that boiled with pain and self-hatred. “My mom’s dead because of me!” “No, she’s not,” Benny said with a growl. He took her by the arms. She was strong. She tried to break away and stand up, but he held her. “Listen to me, Nix! Your mom’s dead, because Charlie Matthias is a freak and a murderer and a … a …” He couldn’t find a word vile enough to describe that monster’s nature. Tears streamed down Nix’s face, but her teeth were set and bared. “Charlie knew you had the same card. All the time he was at the house, Charlie kept saying they should have just taken the card from you. He was furious with you. He said that you sassed him and that if Tom hadn’t come along, he’d have shown you manners. Manners … That’s a word he used at our house. He said that we all needed to show him some manners.” Benny let go of her arms, and Nix leaned back away from him. “Why come after your mom, though? There have to be several of those cards in print now, even rare Chase Cards like that. In all the towns. He can’t kill everyone who has one.” “No … it wasn’t just the card. It was what he thought Mom knew about the girl. Where to find her. And … I think maybe Mom did know something. I think Tom might have told her where he thought the Lost Girl was.” She cut him a look. “Did Tom tell you anything about my mom and Gameland?” Benny nodded. “Mom had nightmares about that place. About fighting zoms to make money for us to live on. God—the things she had to do just because of me!” “Whoa, don’t think like that, Nix. That’s going to make you crazy, and it’s not true. Your mom did what she thought was right. She did what she had to do. She did it because she loved you. Only a mother would have the guts or even care enough to do what she did. You can’t let it chew you up.” Nix wiped more tears from her eyes and nodded, but Benny knew this was something that would take her years to work through. He hoped they would have those years. “A few months ago Mom told me that Charlie had rebuilt Gameland. I guess Tom told her. Her nightmares were a lot worse after that, and she kept on me all the time not to ever be alone with Charlie or the Hammer. And … and … last night, Charlie told her that they were taking me there. It hurt Mom worse than the beating they gave her. Mom freaked out and smashed him over the head with a rolling pin. I wished she’d killed him, but he turned on her like an animal.” Nix stopped, and Benny did not encourage her to tell any more of that part of the story. The night birds kept up their continuous chorus. “Then they hit me so hard that I guess I blacked out, and when I woke up we were already out here in the Ruin. They told me that they were taking me to Gameland.” “Then it’s somewhere close?” “I don’t think so. I overheard the Hammer telling one of the other bounty hunters that they were heading to Charlie’s camp up in the mountains and would turn east to Gameland in the morning.” “I’m glad you escaped, Nix. I was going crazy thinking about you with those maniacs.” “Charlie wouldn’t let them hurt me too much. He said that I had to be ‘fresh’ for the Z-Games.” “The stuff they’re doing,” Benny said, “in town last night, out here, at Gameland … It’s worse than what the zoms do.” “I know,” she said. “Zoms are driven by some disease, but, really, they’re mindless and soulless. These men have souls and minds, and yet they still do this stuff. Not once, but over and over again.” There was a sound off in the distance that sounded like a scream. Not a human throat, though. Was it Apache or Chief? Or just the call of some night-hunting bird? Benny shifted to sit a little closer to Nix. “Tom said that he’d heard rumors about them grabbing kids from places where they wouldn’t be missed. Kids for Gameland. Did anyone say anything about that?” “Yes. One of the men said that they’d rounded up a bunch of kids and that they were waiting at the camp.” “Do you know where this camp is?” “No … but it can’t be far.” Benny chewed on that. “If Tom was … I mean … Maybe Tom would know what to do. He might be able to find the camp and get those kids out.” Nix looked at him. “God! I wish there was some way that we could do it.” “Us? Fat chance. We don’t have weapons, training, or anything, and there are about a million zoms out there.” “So what are you saying? We don’t do anything? We just let those kids be taken to that place?” Benny shook his head. “That’s not it, Nix. … It’s just that we can’t do anything. I mean, be realistic.” “Realistic? Yeah, and you’re always living in the real world, Benny Imura.” “What’s that supposed to mean?” “You’re in love with a girl you saw on a Zombie Card, and you’re asking me to be realistic.” She shook her head, and they lapsed into a tense silence. “I’m not in love with anyone, Nix. Besides, I don’t even know Lilah. Don’t be crazy,” Benny said. Nix merely grunted. “Benny,” she said after a while. “A couple of years ago, when Mom thought I was asleep, I heard her beg Tom to kill Charlie. She wanted Tom to find him out here in the Ruin and kill him. … But he didn’t do it, Benny! He should have done it … but he didn’t.” “I know. But … I think he might have burned Gameland down.” “So what? The problem isn’t the place, Benny, it’s the people. Tom didn’t stop them. I think he was afraid of Charlie.” Benny shook his head. “You don’t understand. Tom wasn’t who I thought he was. I was completely wrong about him. He wasn’t afraid of—” But Nix was on the attack and cut him off. “You never liked Tom, so don’t start defending him now. You always said he was weak. He was supposed to be so tough, and yet he wouldn’t even do what my mom wanted. He couldn’t … and look what happened. Mom’s dead.” She pounded her fists on the metal rail, and the echo bounced off the night-black trees. Benny heard the echo and quickly grabbed her wrist. “Don’t,” he said. “Not out here. The noise …” She wheeled on him. “Are you afraid too?” she mocked. “Yes,” he said. “I am. There are zoms out there, Nix. Zoms and them. Sound carries.” But her hurt and anger still needed a target. “You’re just as bad as Tom. You and Morgie and Chong. You worship Charlie and the other bounty hunters. You think he’s cool.” She injected that word with so much venom that Benny knew he would never allow himself to speak it again. It sounded hollow and immature and stupid. “Not anymore,” he said. “Oh, sure. Now that it’s too late to do anything, you act all wise and noble. Please.” Her voice was drenched with bile, and it was getting louder. Benny tried to read her face by starlight, but all he saw were harsh lines. “And about Tom … I’m not sure what I feel about him anymore. I mean, I miss him. A lot. More than I thought I would.” He shook his head. “Ever since he first took me out to the Ruin, everything’s different. I don’t understand him. I don’t know if I ever did.” She shoved him hard in the chest. “Who cares? He didn’t save my mom and he could have.” “Nix, I know you’re hurt. I wish I could fix it, I swear to God. I wish I could make it all different, make what happened not true. If I could … I’d give anything. I’d die to make it right for you and for your mom.” She started to say something, but he touched her arm. “If you need to lash out at me, if you need to do anything to me—say anything, throw me off this tower—if it will help even a little, then do it. I don’t care what happens to me anymore. I got what I wanted.” “What’s that?” she demanded. “You,” he said. “I got you back safe. The monsters didn’t get you.” Nix stared at him, unable to speak even though she tried. Benny tugged the worn leather diary out of his back pocket and pressed it into her hands. “I found this on the floor in your room. I kept it. I … haven’t opened it, haven’t read it. I kept it, because as long as I had it, I knew I’d find you again.” Nix took the diary, and in the pale light from stars and moon, she ran her fingers across the cover and along the binding. When she raised her eyes to look at Benny, her eyes were wet with new tears. “Benny, I—,” she began, but before she could say anything more, he bent forward and kissed her. It was the wrong time, the wrong place, the wrong circumstances. There was nothing right in their whole world. Except that kiss. 40 NIX FELL ASLEEP WITH HER HEAD IN HIS LAP. BENNY STAYED AWAKE for another couple of hours, stroking her hair and staring into the infinite star field that stretched above him. After that first scalding kiss, there had been others. And then there had been more tears as the full reality of her loss hit Nix. These tears were quieter, though. They weren’t the tears of shock and denial. They’d already been through that storm. These were the deep, heartbroken tears of acceptance. Their lives had changed. Their worlds had changed. As he sat there stroking Nix’s hair, Benny had the weird feeling that if he turned around, he would be able to see yesterday and the day before that, all the way back to the point where he had decided to apprentice with Tom. It had been at that moment that his footfalls had diverged from the sane and predictable course of his life. He wished he could call out to the Benny of ten days ago and shout a warning not to come this way. Take the job at the pit, work for the German locksmith, get a tower job with Chong. Anything but this. As he thought about it, Benny felt sickness creeping into his mind, making ugly questions form like tumors. Would all of this have happened if I hadn’t taken that damn job with Tom? And worse yet … Would any of it have happened? On a deep level he knew that these thoughts were stupid and wrong. Charlie and the Hammer would have still come after Tom and Sacchetto and Nix’s mom. Wouldn’t they? He also knew that the guilt he felt was no different than the guilt Nix felt for having told Zak about her mother knowing Lilah. Things said and done innocently should never be used as weapons. There was guilt here, he finally decided, but it all belonged to Charlie. Just thinking that name made fires ignite in the pit of his stomach. For the first time in his life he wished that Tom was here to help him make sense of it. Tom. Benny had hated him most of his life and had just started to like him—even if he didn’t quite understand him—and now the zoms had gotten him. The sudden realization that Tom was not only dead but was probably a zom was like a punch in the face. Benny closed his eyes and found that old, old memory of Mom in her white dress with red sleeves, handing him to Tom, screaming at Tom to run, and Tom running away, leaving her behind. Tom the zombie hunter. Tom the coward. Tom the zombie. Would there be a new Zombie Card? Two weeks ago Benny might have thought that was funny. Or appropriate. Now the horror of it was bigger than the night that loomed around him. He remembered the argument they’d had when Tom had showed him the old man and the girl in the waitress uniform. “It’s not the same. These are zoms, man. They kill people. They eat people.” Tom had said, “They used to be people.” Now Tom was one of them. He tried not to think of what Tom’s last few seconds had been like. The Hammer’s shotgun blast had caught him; Benny had seen the blood fly. Had the blast killed him? That would have been a kindness. The alternative was beyond horrible. Falling down into the mass of them, covered in blood. White hands clawing at his skin, rotting gray teeth biting into him, tearing at him … Tom did not deserve that. Benny was unsure if Tom was a coward or had ever been a coward. He doubted his own memories of First Night, or, at least, of what those old memories meant. No matter what, though, Tom did not deserve what had happened to him. He shivered and Nix stirred restlessly. Looking at her dragged his mind into another room of thought. That kiss. With Nix? Nix, of all people. It was absurd, impossible. They’d already come to that hurdle back in town, and they hadn’t been able to climb it together. It was dangerous and wrong to fall in love with a friend. It complicated things. He and Chong had once sworn that they would never ever fall for a girl they knew. A bold claim in a town as small as Mountainside. Now … Nix Riley lay asleep on his lap, and he swore he could still feel the warmth of her lips on his. He tugged the battered and sweat-stained Zombie Card from his shirt pocket and looked at the Lost Girl. A dagger of guilt stabbed him beneath the breastbone, and he quickly glanced down at Nix. He could see her eyes move under her closed lids and knew that she was dreaming. A soft cry escaped her parted lips, and it was filled with jagged pieces of emotion. Hurt and loss, despair and terror, but also rage and defiance. Benny brushed a strand of hair away from her cheek.","sourceLink":"https://allnovel.net/rot-and-ruin-benny-imura-1/page-34.html","bookId":2581,"book":{"id":2581,"title":"Rot and Ruin (Benny Imura #1)","description":"Storyline: Rot and Ruin (Benny Imura #1) In the zombie-infested, post-apocalyptic America where Benny Imura lives, every teenager must find a job by the time they turn fifteen or get their rations cut in half. Benny doesn\u0027t want to apprentice as a zombie hunter with his boring older brother Tom, but he has no choice. He expects a tedious job whacking zoms for cash, but what he gets is a vocation that will teach him what it means to be human.","cover":"https://allnovel.net/images/rot-and-ruin-benny-imura-1.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/rot-and-ruin-benny-imura-1.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:06:40 PM"}}
