{"id":94240,"no":6,"title":"Page 6","content":"There was a narrower road at the top of the hill, and they followed that in silence. By ten o’clock they’d entered a series of steeper hills and valleys that were shaded by massive oak trees with cool green leaves. Tom cautioned Benny to be quiet as they climbed to the top of a ridge that overlooked a small country lane. At the curve of the road was a small cottage with a fenced yard and an elm tree so gnarled and ancient that it looked like the world had grown up around it. Two figures stood in the yard, but they were too small to see. Tom flattened out at the top of the ridge and motioned for Benny to join him. Tom pulled his field glasses from a belt holster and studied the figures for a long minute. “What do you think they are?” He handed the binoculars to Benny, who snatched them with more force than was necessary. Benny peered through the lenses in the direction Tom pointed. “They’re zoms,” Benny said. “No kidding, boy genius. But what are they?” “Dead people.” “Ah.” “Ah … what?” “You just said it. They’re dead people. They were once living people.” “So what? Everybody dies.” “True,” admitted Tom. “How many dead people have you seen?” “What kind of dead? Living dead, like them, or dead dead, like Aunt Cathy?” “Either. Both.” “I don’t know. The zombies at the fence … and a couple of people in town, I guess. Aunt Cathy was the first person I ever knew who died. I was, like, six when she died. I remember the funeral and all.” Benny continued to watch the zombies. One was a tall man, the other a young woman or teenage girl. “And … Morgie Mitchell’s dad died after that scaffolding collapsed. I went to his funeral too.” “Did you see either of them quieted?” “Quieted” was the acceptable term for the necessary act of inserting a metal spike, called a “sliver,” into the base of the skull to sever the brain stem. Since First Night, anyone who died would reanimate as a zombie. Bites made it happen too, but really any recently deceased person would come back. Every adult in town carried at least one sliver, though Benny had never seen one used. “No,” he said. “You wouldn’t let me stay in the room when Aunt Cathy died. And I wasn’t there when Morgie’s dad died. I just went to the funerals.” “What were the funerals like? For you, I mean.” “I dunno. Kind of quick. Kind of sad. And then everyone went to a party at someone’s house and ate a lot of food. Morgie’s mom got totally shitfaced—” “Language.” “Morgie’s mom got drunk,” Benny said in way that suggested having his language corrected was as difficult as having his teeth pulled. “Morgie’s uncle sat in the corner singing Irish songs and crying with the guys from the farm.” “That was a year, year and a half ago, right? First spring planting?” “Yeah. They were building a corn silo, and Mr. Mitchell was using the rope hoist to send some tools up to the crew working on the silo roof. One of the scaffolding pipes broke, and a whole bunch of stuff came crashing down on him.” “It was an accident.” “Well, yeah, sure.” “How’d Morgie take it?” “How do you think he took it? He was fu—I mean, he was screwed up.” Benny handed back the glasses. “He’s still a little screwed up.” “How’s he screwed up?” “I don’t know. He misses his dad. They used to hang out a lot. Mr. Mitchell was pretty cool, I guess.” “Do you miss Aunt Cathy?” “Sure, but I was little. I don’t remember that much. I remember she smiled a lot. She was pretty. I remember she used to sneak me extra ice cream from the store where she worked. Half an extra ration.” Tom nodded. “Do you remember what she looked like?” “Like Mom,” said Benny. “She looked a lot like Mom.” “You were too little to remember Mom.” “I remember her,” Benny said with an edge in his voice. He took out his wallet and showed Tom the image behind the glassine cover. “Maybe I don’t remember her really well, but I think about her. All the time. Dad, too. I can even remember what she wore on First Night. A white dress with red sleeves. I remember the sleeves.” Tom closed his eyes and sighed, and his lips moved. Benny thought he echoed the words “red sleeves.” Tom opened his eyes. “I didn’t know you carried this.” His smile was small and sad. “I remember Mom. She’s was more of a mother to me than my mom ever was. I was so happy when Dad married her. I can remember every line on her face. The color of her hair. Her smile. Cathy was a year younger, but they could have been twins.” Benny sat up and wrapped his arms around his knees. His brain felt twisted around. There were so many emotions wired into memories, old and new. He glanced at his brother. “You were older than I am now when, y’know, it happened.” “I turned twenty a few days before First Night. I was in the police academy. Dad married your mom when I was sixteen.” “You got to know them. I never did. I wish I …” He left the rest unsaid. Tom nodded. “Me too, kiddo.” They sat in the shade of their private memories. “Tell me something, Benny,” said Tom. “What would you have done if one of your friends—say, Chong or Morgie—had come to Aunt Cathy’s funeral and took a leak in her coffin?” Benny was so startled by the question that his answer was unguarded. “I’d have jacked them up. I mean, jacked them up.” Tom nodded. Benny stared at him. “What kind of question is that, though?” “Indulge me. Why would you have freaked out on your friends?” “Because they dissed Aunt Cathy, why do you think?” “But she’s dead.” “What the hell does that matter? Pissing in her coffin? I would so kick their asses.” “But why? Aunt Cathy was beyond caring.” “This is her funeral! Maybe she’s still, I don’t know, there in some way. Like Pastor Kellogg always says.” “What does he say?” “That the spirits of those we love are always with us.” “Okay. What if you didn’t believe that? What if you believed that Aunt Cathy was only a body in a box? And your friends peed on her?” “What do you think?” Benny snapped. “I’d still kick their asses.” “I believe you. But why?” “Because,” Benny began, but then hesitated, unsure of how to express what he was feeling. “Because Aunt Cathy was mine, you know? She’s my aunt. My family. They don’t have any right to disrespect my family.” “No more than you’d go take a crap on Morgie Mitchell’s father’s grave. Or dig him up and pour garbage on his bones. You wouldn’t do anything like that?” Benny was appalled. “What’s your damage, man? Where do you come up with this crap? Of course I wouldn’t do anything sick like that! God, who do you think I am?” “Shhh … keep your voice down,” cautioned Tom. “So … you wouldn’t disrespect Morgie’s dad … alive or dead?” “Hell, no.” “Language.” Benny said it slower and with more emphasis. “Hell. No.” “Glad to hear it.” Tom held out the field glasses. “Take a look at the two dead people down there. Tell me what you see.” “So we’re back to business now?” Benny gave him a look. “You’re deeply weird, man.” “Just look.” Benny sighed and grabbed the binoculars out of Tom’s hand, put them to his eyes. Stared. Sighed. “Yep. Two zoms. Same two zoms.” “Be specific.” “Okay. Okay, two zoms. One man, one woman. Standing in the same place as before. Big yawn.” Tom said, “Those dead people …” “What about them?” “They used to be somebody’s family,” said Tom quietly. “The male looks old enough to have been someone’s granddad. He had a family, friends. A name. He was somebody.” Benny lowered the glasses and started to speak. “No,” said Tom. “Keep looking. Look at the woman. She was, what? Eighteen years old when she died. Might have been pretty. Those rags she’s wearing might have been a waitress’s uniform once. She could have worked at a diner right next to Aunt Cathy. She had people at home who loved her. …” “C’mon, man, don’t—” “People who worried when she was late getting home. People who wanted her to grow up happy. People—a mom and a dad. Maybe brothers and sisters. Grandparents. People who believed that girl had a life in front of her. That old man might be her granddad.” “But she’s one of them, man. She’s dead,” Benny said defensively. “Sure. Almost everyone who ever lived is dead. More than six billion people are dead. And every last one of them had family once. Every last one of them were family once. At one time there was someone like you who would have kicked the crap out of anyone—stranger or best friend—who harmed or disrespected that girl. Or the old man.” Benny was shaking his head. “No, no, no. It’s not the same. These are zoms, man. They kill people. They eat people.” “They used to be people.” “But they died!” “Sure. Like Aunt Cathy and Mr. Mitchell.” “No … Aunt Cathy got cancer. Mr. Mitchell died in an accident.” “Sure, but if someone in town hadn’t quieted them, they’d have become living dead, too. Don’t even pretend you don’t know that. Don’t pretend you haven’t thought about that happening to Aunt Cathy.” He nodded down the hill. “Those two down there caught a disease.” Benny said nothing. He’d learned about it in school, though no one knew for sure what had actually happened. Some sources said it was a virus that was mutated by radiation from a returning space probe. Others said it was a new type of flu that came over from China. Chong believed it was something that got out of a lab somewhere. The only thing everyone agreed on was that it was a disease of some kind. “That guy down there was probably a farmer,” Tom said. “The girl was a waitress. I’m pretty sure neither of them was involved in the space program. Or worked in some lab where they researched viruses. What happened to them was an accident. They got sick, Benny, and they died.” Benny said nothing. “How do you think Mom and Dad died?” No answer. “Benny—? How do you think?” “They died on First Night,” Benny said irritably. “They did. But how?” Benny said nothing. “How?” “You let them die!” Benny said in a savage whisper. Words tumbled out of him in a disjointed sputter. “Dad got sick and … and … then Mom tried to … and you … you just ran away!” Tom said nothing, but sadness darkened his eyes, and he shook head slowly. “I remember it,” Benny growled. “I remember you running away.” “You were a baby.” “I remember it.” “You should have told me, Benny.” “Why? So you could make up a lie about why you just ran away and left my mom like that?” The words “my mom” hung in the air between them. Tom winced. “You think I just ran away?” he said. “I don’t think it, Tom. I remember it.” “Do you remember why I ran?” “Yeah, ’cause you’re a freaking coward is why!” “Jesus,” Tom whispered. He adjusted the strap that held the sword in place, and sighed again. “Benny, this isn’t the time or place for this, but sometime soon we’re going to have a serious talk about the way things were back then and the way things are now.” “There’s nothing you can say that’s going to change the truth.” “No. The truth is the truth. What changes is what we know about it and what we’re willing to believe.” “Yeah, yeah, whatever.” “If you ever want to know my side of things,” said Tom, “I’ll tell you. There’s a lot you were too young to know then, and maybe you’re still too young now.” Silence washed back and forth between them. “For right now, Benny, I want you to understand that when Mom and Dad died, it was from the same thing that killed those two down there.” Benny said nothing. Tom plucked a stalk of sweet grass and put it between his teeth. “You didn’t really know Mom and Dad, but let me ask you this: If someone was to piss on them or abuse them—even now, even considering what they had to have become during First Night—would it be okay with you?” “Screw you.” “Tell me.” “No. Okay? No, it wouldn’t freaking be okay with me. You happy now?” “Why not, Benny?” “Because.” “Why not? They’re only zoms.” Benny abruptly got up and walked down the hill, away from the farm and away from Tom. He stood looking back along the road they’d traveled, as if he could still see the fence line. Tom waited a long time before he got up and joined him.","sourceLink":"https://allnovel.net/rot-and-ruin-benny-imura-1/page-6.html","bookId":2581,"book":{"id":2581,"title":"Rot and Ruin (Benny Imura #1)","description":"Storyline: Rot and Ruin (Benny Imura #1) In the zombie-infested, post-apocalyptic America where Benny Imura lives, every teenager must find a job by the time they turn fifteen or get their rations cut in half. Benny doesn\u0027t want to apprentice as a zombie hunter with his boring older brother Tom, but he has no choice. He expects a tedious job whacking zoms for cash, but what he gets is a vocation that will teach him what it means to be human.","cover":"https://allnovel.net/images/rot-and-ruin-benny-imura-1.jpg","author":"Jonathan Maberry","type":"Horror","source":"allnovel","link":"https://allnovel.net/rot-and-ruin-benny-imura-1.html","creation":"Oct 5, 2019 8:58:53 AM","modification":"Oct 5, 2019 6:06:40 PM"}}
