{"id":105104,"no":52,"title":"Page 52","content":"\\n\\n The party stopped in this patch of dense forest.\\n\\n Camels began to drop and unload their riders. One of the Bait Kathir approached Painter’s camel, helping him couch the beast.\\n\\n “Farha, krr, krr…” the man said as he stepped before the animal. Farha was the camel’s name, meaning “joy.” To Painter, nothing could be further from the truth. The only joy he could imagine would be getting off her hump.\\n\\n The camel dropped under him, swaying backward and settling to her hindquarters. Painter held tightly, legs clenching. She then sank to her hocks in front, shuffling her knees down, and came to a rest on the ground.\\n\\n With the camel couched, Painter slid from the saddle. His legs were rubbery, his thighs knotted. He stumbled a few steps away as the tribesman cooed at the camel and kissed her on the nose, earning a soft burble from the beast. It was said the Bait Kathir loved their camels more than their wives. It certainly seemed that way with this fellow.\\n\\n Shaking his head, Painter crossed to join the others. Captain al-Haffi sat on his haunches beside Sheikh Emir, drawing in the dirt of the road, holding a penlight, outlining how to best distribute the men. Sharif and Barak watched over Omaha and Coral as the two Americans prepped their Kalashnikov rifles. Each of them had an Israeli Desert Eagle pistol as a backup weapon.\\n\\n Painter took the moment to check his own guns, a pair of Heckler \u0026 Koch pistols. In the dark, he slipped out and checked the 9mm magazines, seven rounds apiece. He had two additional magazines loaded and ready in his belt. Satisfied, he holstered the weapons, one at the shoulder, one at the waist.\\n\\n Omaha and Coral approached him as he cinched the small ditty bag to his belly. He didn’t check its contents, having inventoried it all back in Salalah.\\n\\n “When does the ten-minute clock start running?” Omaha asked, exposing his wristwatch as he stopped, pushing a button to illuminate its face.\\n\\n Painter coordinated his own watch with Coral’s Breitlinger. “Now.”\\n\\n Coral caught his gaze, concern in her blue eyes. “Stay cold, Commander.”\\n\\n “As ice,” he whispered.\\n\\n Omaha blocked him as he turned to the road leading up to the hilltop tomb. “Don’t come back without her.” This was as much a plea as a threat.\\n\\n Painter nodded, acknowledging both, and headed out.\\n\\n Ten minutes.\\n\\n 8:05 P.M.\\n\\n W ORKING UNDER the glow of a pair of floodlights, Safia used a pick and brush to loosen the artifact from the sandstone’s embrace. The winds had kicked up, stirring the sand and dust, trapped by the four walls of the roofless prayer room. Safia felt caked in it, a living statue of sandstone.\\n\\n With the fall of night, the temperature dropped precipitously. Heat lightning flickered to the south, getting closer, accompanied by the occasional bass rumble, a clear promise of rain.\\n\\n Wearing gloves, Safia brushed grit from the artifact, afraid of scratching it. The life-size iron bust of a woman shone in the sharp lights, eyes open, staring back at her. Safia feared that gaze and concentrated on the work at hand.\\n\\n Cassandra and Kane whispered behind her. Cassandra had wanted to use her laser gun to finish freeing the iron artifact, but Safia had urged caution, lest it be damaged. She feared the laser might etch the metal, erasing details.\\n\\n Safia picked away the last of the stone. She attempted not to stare at the features, but found herself glancing at it from the corner of her eye. The face was remarkably similar to her own. It could have been a younger version of herself. Perhaps at eighteen. But this was impossible. It had to be just a racial coincidence. It merely depicted a southern Arabian woman, and as a native of the region, Safia would, of course, bear some resemblance, even with her mixed-blood heritage.\\n\\n Still, it did unnerve her. It was like staring at her own funereal mask.\\n\\n Especially as the bust was impaled atop an iron spear, four feet long.\\n\\n Safia leaned back. The artifact occupied the center of the chalked rectangle on the wall of the prayer niche. The red iron spear stood upright, the bust impaled atop it. All one object. Though the sight disturbed her, Safia was not totally surprised. It made a certain historical sense.\\n\\n “If this takes any longer,” Cassandra interrupted her thoughts, “I’m going to pull out the goddamn ULS laser again.”\\n\\n Safia reached forward and tested the rock’s hold on the iron object. It wobbled with her touch. “Another minute.” She set to work.\\n\\n Kane shifted, his shadow dancing on the wall. “Do we need to remove it? Maybe it’s facing the right direction already.”\\n\\n “It’s facing southeast,” Safia answered him. “Back to the coast. That can’t be the way. There’s another riddle to solve.”\\n\\n With her words, the top-heavy artifact broke free of the rock and fell face forward. Safia caught it on her shoulder.\\n\\n “About time,” Cassandra mumbled.\\n\\n Safia stood, cradling the bust. She held the spear haft in both of her gloved hands. It was heavy. With the iron head resting near her ear, she heard the slight sloshing sound coming from inside. Like the heart. A molten heaviness lay at its core.\\n\\n Kane took the artifact from her, lifting it like it was a stalk of corn. “So what do we do with it?”\\n\\n Cassandra pointed a flashlight. “Back to the tomb, like in Salalah.”\\n\\n “No,” Safia said. “Not this time.”\\n\\n She slipped past Cassandra and led the way. She thought about delaying the search, dragging it out. But she had heard the jingle of camel bells, echoing up from the valley. There was an encampment of bedouin nearby. If any of them should wander up here…\\n\\n Safia hurried forward and crossed to the covered pit near the entrance to the tomb. She knelt down and hauled it open. Cassandra shone her light down into the hole, illuminating the pair of footprints. Safia remembered the story that had made her follow those footsteps: the tale of the brass horseman who had borne a spear in his hand, a spear impaled with a head.\\n\\n Safia glanced past Cassandra’s shoulder to Kane and the artifact. After untold centuries, she had found that spear.\\n\\n “What now?” Cassandra asked.\\n\\n There was only one other feature in the pit, one that had yet to yield a clue: the hole in the center of the pit.\\n\\n According to the Bible and the Koran, through this hole, a magical spring had gushed forth, one that led to miracles. Safia prayed for her own miracle.\\n\\n She pointed to the hole. “Plant it there.”\\n\\n Kane straddled the pit, positioned the haft end of the spear, and settled it into the hole. “Tight fit.”\\n\\n He stood back. The spear remained standing, firmly rooted. The bust atop it stared out over the valley.\\n\\n Safia walked around the impaled spear. As she inspected it, rain spattered out of the dark skies, tapping the packed dirt and stone with a sullen beat.\\n\\n Kane grumbled. “Bloody brilliant.” He pulled out a ball cap and tugged it over his shaved head.\\n\\n In moments, the rain began to fall more heavily.\\n\\n Safia circled the spear a second time, frowning now.\\n\\n Cassandra shared her concern. “Nothing’s happening.”\\n\\n “We’re simply missing something. Pass me the torch.” Safia took off her dirty work gloves and held out a palm for the flashlight. Cassandra relinquished it with clear reluctance.\\n\\n Safia shone it over the length of the spear. Its shaft was striated at regular intervals. Was it decoration or something significant? With no idea, Safia straightened from a crouch and stood behind the bust. Kane had planted the spear with the face still pointing south, toward the sea. Clearly the wrong way.\\n\\n Her eyes drifted to the bust. Staring at the back of the head, she spotted tiny writing on the base of the neck, shadowed by the hairline. She brought the flashlight closer. The lettering must have been partially obscured by the residual dust, but the rain was washing it clean. Four letters became clear.\\n\\n Sandstorm\\n\\n Cassandra noted her attention and the script. “What does it mean?” Safia translated, her frown deepening. “A woman’s name. Biliqis.” “Is it the woman sculpted here?”\\n\\n Safia didn’t answer, too astounded. Could it be? She stepped around and studied the woman’s face. “If true, then this is a find of phenomenal significance. Biliqis was a woman revered across all faiths. A woman lost in mystery and myth. Said to be half human, half spirit of the desert.” “I never heard of her.”\\n\\n Safia cleared her throat, still stunned by the discovery. “Biliqis is better known by her title: the Queen of Sheba.” “As in the story of King Solomon?” “Among countless other tales.”\\n\\n As rain pattered down and ran in rivulets over the iron face, the statue appeared to be crying.\\n\\n Safia reached and wiped the tears from the queen’s cheek.\\n\\n With her touch, the bust moved as if pivoting on slippery ice, swinging from her fingertips. It spun once fully around, then slowed and wavered to a stop, staring in the opposite direction.\\n\\n To the northeast.\\n\\n Safia glanced back to Cassandra.\\n\\n “The map,” Cassandra ordered Kane. “Get the map.”\\n\\n 14 Tomb Raider\\n\\n Sandstorm\\n\\n DECEMBER 3, 8:07 P.M.\\n\\n JEBAL EITTEEN\\n\\n P AINTER CHECKED his watch. One more minute.\\n\\n He lay flat on his belly at the base of a fig tree, sheltered behind an acacia bush. Rain pitter-pattered against the canopy of leaves overhead. He had positioned himself far to the right of the road, carefully picking his way up a nearly sheer cliff face to reach this spot. He had a clear view of the parking lot.\\n\\n With the night-vision goggles fixed to his face, the guards were easy to spot in the darkness, all in their blue windbreakers, now with hoods pulled up against the rain. Most were posted near the road leading here, but a few others slowly circled wider. It had taken precious minutes to creep into position, moving forward as the guards shifted past.\\n\\n Painter took slow steady breaths, preparing himself. It was a thirty-yard dash to the nearest SUV. He fixed the plan, visualizing it, refining it. Once things began to roll, he would have no time to think, only react.\\n\\n He glanced at his watch. Time was up.\\n\\n He slowly raised himself into a crouched position, staying small, compact. He strained to listen, tuning out the rain. Nothing. He glanced at his watch again. Ten minutes had passed. Where were— \\n\\n","sourceLink":"https://allnovel.net/sandstorm-sigma-force-1/page-52.html","bookId":1530,"book":{"id":1530,"title":"Sandstorm (Sigma Force #1)","description":"Storyline: Sandstorm (Sigma Force #1) \\n An inexplicable explosion rocks the antiquities collection of a London museum, setting off alarms in clandestine organizations around the world. And now the search for answers is leading Lady Kara Kensington; her friend Safia al-Maaz, the gallery\u0027s brilliant and beautiful curator; and their guide, the international adventurer Omaha Dunn, into a world they never dreamed existed: a lost city buried beneath the Arabian desert. But others are being drawn there as well, some with dark and sinister purposes. And the many perils of a death-defying trek deep into the savage heart of the Arabian Peninsula pale before the nightmare waiting to be unearthed at journey\u0027s end: an ageless and awesome power that could create a utopia... or destroy everything humankind has built over countless millennia.\\n","cover":"https://allnovel.net/images/sandstorm-sigma-force-1.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/sandstorm-sigma-force-1.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:39:30 PM"}}
