{"id":105110,"no":58,"title":"Page 58","content":"\n And she knew to whom she was indebted for that.\n “What about the museum curator?” she asked.\n “I have men patrolling the mountains. Still no trace of her signal.”\n Cassandra frowned. The microtransceiver she had implanted on the woman had a range of ten miles. How was it possible that they hadn’t picked up her signal? Maybe interference from the mountains. Maybe it was the storm system. Either way, she’d eventually expose herself. She’d be found.\n Cassandra pictured the small pellet of C4 incorporated into the transceiver. Safia might have escaped…but she was dead already.\n “Let’s move out,” she said.\n 1:32 A.M.\n DHOFAR MOUNTAINS\n G OOD GIRL, Saff,” Omaha mumbled.\n Painter stirred from his post by the road. What had the man discovered? With his night-vision glasses, he had been watching the dirt track. The Volkswagen Eurovan stood parked under a stand of trees.\n Omaha and the others gathered at the back of the van, the tailgate ajar. Omaha and Danny were bent over the map he had stolen from the tomb site.\n Next to them, Coral had been inventorying their supplies, pilfered from the back of Cassandra’s SUV.\n Downslope from the tomb, they had run into Clay and Danny, frantic about Kara’s disappearance. They had found her rifle in the road, but no sign of the woman herself. They had called and called for her, but no answer. And with Cassandra on their tail and helicopters in the air, they could not wait long. While Painter and Omaha searched for Kara, the others had hurriedly shoved all the supplies from the SUV into the Eurovan, then drove the SUV over a steep slope. Painter feared Cassandra would track them with its GPS feature, just as he had.\n Additionally, the Eurovan was unknown to her. A small advantage.\n So they had taken off, hoping Kara had kept her head low.\n Painter paced the road now, less settled with his decision. They had found no body. Where had Kara gone? Did her disappearance have something to do with her withdrawal from the drug? He took a deep breath. Maybe it was best. Away from them, Kara might have a better chance of surviving. Still, Painter paced.\n Off to the side, Barak shared a smoke with Clay, the two men a contrast in size, form, and philosophy bonded by the lure of tobacco. Barak knew the mountains and had led them through a series of rutted roads, well camouflaged. They ran with their lights off, going as fast as safety allowed, stopping at times whenever the sound of helicopters approached.\n It was just six of them now: he and Coral, Omaha and Danny, Barak and Clay. The fate of Captain al-Haffi and Sharif remained unknown, scattered to the winds with the fleeing Bait Kathir. They could only hope for the best.\n After three hours of harried driving, they had stopped to rest, regroup, plan what to do next. All they had to guide them from here were the inked marks on the map.\n At the van, Omaha straightened a kink in his back with a pop that was heard all the way to the road. “She tricked the bitch.”\n With the mountain valley quiet and dark, Painter walked back to join the others. “What are you talking about?”\n Omaha waved him over. “Come see this.”\n Painter joined him. At least, Omaha’s belligerence toward him had lessened. En route, Painter had related his story of the leopards, the firefight, the intervention of the strange woman. Omaha finally seemed to settle on the belief that as long as Safia was away from Cassandra, it was an improvement.\n Omaha pointed to the map. “See these lines. The blue one clearly leads from the tomb in Salalah to Job’s tomb here in the mountains. Safia must’ve found some clue at the first tomb to lead to the second.”\n Painter nodded. “Okay, what about the red line?”\n “Safia found some clue at Job’s tomb, too.”\n “The metal post with a bust on it?”\n “I suppose. It doesn’t matter any longer. See here. She’s marked a circle along this red line. Out in the desert. Like this is where to go next.”\n “The location of Ubar.” Painter felt a sick, sinking feeling. If Cassandra already knew where it was…\n “No, it’s not the location,” Danny said.\n Omaha nodded. “I measured it. The circle is marked sixty-nine miles from Job’s tomb, along this red line.”\n Painter had debriefed them on all the details, including overhearing the tall man call out the number sixty-nine, measuring something along the pole.\n “So it matches the number I heard,” Painter said.\n “But they figured miles,” Omaha said. “Our miles.”\n “So?”\n Omaha gave him a look as if it were obvious. “If that artifact they found at Job’s tomb was dated the same as the iron heart—and why wouldn’t it be?—then it goes back to sometime around 200 B.C.”\n “Okay,” Painter said, accepting the fact.\n “Back then, a mile was defined by the Romans. A mile was calculated as five thousand Roman feet. And a Roman foot is only eleven and a half inches. Safia would know this! She let Cassandra believe it was modern miles. She sent the bitch on a wild-goose chase.”\n “So what’s the real distance?” Painter asked, moving closer to the map.\n At his side, Omaha chewed the edge of his thumb, clearly doing a calculation in his head. After a moment, he spoke. “Sixty-nine Roman miles is equivalent to just over sixty three modern miles.”\n “He’s right,” Coral said. She had been doing her own calculation.\n “So Safia sent Cassandra six miles past the true location.” Painter frowned. “That’s not too far.”\n “In the desert,” Omaha countered, “six miles is more like six hundred.”\n Painter didn’t squash the man’s pride in Safia, but he knew the ruse would not fool Cassandra for long. As soon as she realized that nothing was at that false site, she’d start consulting. Someone would solve the mystery. Painter estimated Safia’s ruse bought them a day or two at most.\n “So where on the map is the true location?” Painter asked.\n Omaha bobbed his head, excited. “Let’s find out.” He quickly adjusted his strings and pins, measuring and rechecking. A frown crinkled his brow. “That doesn’t make sense.” He stuck a pin in the map.\n Painter leaned over and read the name pinned there. “Shisur.”\n Omaha shook his head, dismay in his voice. “It’s been a goddamn wild-goose chase all along.”\n “What do you mean?”\n Omaha continued to frown at the map, as if it were to blame.\n Danny answered for him. “Shisur is where the old ruins of Ubar were originally discovered. Back in 1992, by Nicolas Clapp and a few others.” Danny glanced to Painter. “There’s nothing there. All this running around just leads to a place that’s already been discovered and scoured.”\n Painter could not accept that. “There has to be something.”\n Omaha slammed a fist on the map. “I’ve been there myself. It’s a dead end. All this danger and bloodshed…for nothing!”\n “There has to be something everyone has missed,” Painter persisted. “Everyone thought those two tombs we were at before had been thoroughly examined, but in a matter of days, new discoveries were made.”\n “Discoveries made by Safia,” Omaha said sourly.\n No one spoke for a long stretch.\n Painter focused on Omaha’s words. Realization slowly dawned. “She’ll go there.”\n Omaha turned to him. “What are you talking about?”\n “Safia. She lied to Cassandra to stop her from getting to Ubar. But like us, she knows where the clues truly pointed.”\n “To Shisur. To the old ruins.”\n “Exactly.”\n Omaha frowned. “But like we said, there’s nothing there.”\n “And like you said, Safia discovered clues where no one found them before. She’ll think she can do the same at Ubar. She’ll go there for no other reason but to keep whatever might be there from Cassandra’s grasp.”\n Omaha took a deep begrudging breath. “You’re right.”\n “That’s if she’s allowed to go,” Coral said from the side. “What about the woman who took her away? The one with the leopards.”\n Barak answered her, his voice somewhat embarrassed. “I’ve heard tales of such women, spoken around campfires out in the desert. Spoken among all tribes of the sands. Warriors of the desert. More djinn than flesh. Able to speak to animals. Vanish on command.”\n “Yeah, right,” Omaha said.\n “There was indeed something strange about that woman,” Painter conceded. “And I don’t think this is the first time we’ve had a run-in with her.”\n “What do you mean?”\n Painter nodded to Omaha. “Your kidnappers. In Muscat. It was a woman you saw in the market.”\n “What? You think she’s the same woman?”\n Painter shrugged. “Or perhaps one of the same group. There’s another party involved in all this. I know it. I don’t know if it’s Barak’s warrior women or just some group looking to make a buck. Either way, they’ve taken Safia for a reason. In fact, they may have even attempted to kidnap you, Omaha, because of Safia’s affection for you. To use you as leverage.”\n “Leverage for what?”\n “To get Safia to help them. I also spotted the silver case tied on the camel’s back. Why take the artifact unless there’s a good reason? Everything keeps pointing back to Ubar.”\n Omaha pondered his words, nodding his head. “Then that’s where we’ll go. With that bitch distracted, we’ll wait and see if Safia shows up.”\n “And search the place in the meantime,” Coral said. She nodded to the stacked gear. “There’s a ground-penetrating radar unit in here, good for looking under sand. And we’ve a box of grenades, additional rifles, and I don’t know what this is.” She held up a weapon that looked like a shotgun with a belled end to it. From the glint in her eyes, she was dying to try it out. \n","sourceLink":"https://allnovel.net/sandstorm-sigma-force-1/page-58.html","bookId":1530,"book":{"id":1530,"title":"Sandstorm (Sigma Force #1)","description":"Storyline: \n Sandstorm (Sigma Force #1) \n An inexplicable explosion rocks the antiquities collection of a London museum, setting off alarms in clandestine organizations around the world. And now the search for answers is leading Lady Kara Kensington; her friend Safia al-Maaz, the gallery\u0027s brilliant and beautiful curator; and their guide, the international adventurer Omaha Dunn, into a world they never dreamed existed: a lost city buried beneath the Arabian desert. But others are being drawn there as well, some with dark and sinister purposes. And the many perils of a death-defying trek deep into the savage heart of the Arabian Peninsula pale before the nightmare waiting to be unearthed at journey\u0027s end: an ageless and awesome power that could create a utopia... or destroy everything humankind has built over countless millennia.\n \n","cover":"https://allnovel.net/images/sandstorm-sigma-force-1.jpg","author":"James Rollins","type":"Adventure","source":"allnovel","link":"https://allnovel.net/sandstorm-sigma-force-1.html","creation":"Oct 5, 2019 8:57:40 AM","modification":"Oct 5, 2019 10:39:30 PM"}}
