{"id":110581,"no":11,"title":"Page 11","content":"\"AMEN TO THAT,\" I said. \"I\u0027ve seen my own in action.\u0027\u0027\\n\\n I must have looked grim when I said it for Albert\u0027s expression became one of sympathy. \"It\u0027s a painful thing to learn, I know,\" he said, \"that every thought we have takes on a form we must, eventually, confront.\" \"You went through the same thing?\"\\n\\n He nodded. \"Everyone does.\"\\n\\n \"Your life flashed before you?\" I asked. \"From the end to the beginning?\u0027\u0027\\n\\n \"Not as rapidly as yours did because I died of a lingering illness,\" he answered. \"And yours was not as quick as that of, say, a drowning man. His removal from life would be so rapid that his subconscious memory would flood out its contents in a few seconds-- every impression in his mind released almost simultaneously.\"\\n\\n \"What about the second time it happened?\" I asked. \"The first time wasn\u0027t bad; I just observed. The second time, I relived each moment.\"\\n\\n \"Only in your mind,\" he said. \"You didn\u0027t actually relive them.\"\\n\\n \"It seemed as though I did.\"\\n\\n \"Yes, it seems very real,\" he agreed.\\n\\n \"And painful.\"\\n\\n \"More so than it did originally,\" he said, \"because you had no physical body to dull the pain of your re-experienced life. It\u0027s a time when men and women come to know what they truly are. A time of purging.\"\\n\\n I\u0027d been looking at the ceiling as he spoke. At his final words, I turned to face him in surprise. \"Is that what the Catholics mean by purgatory?\"\\n\\n \"In essence.\" He nodded. \"A period during which each soul is cleansed by a self- imposed recognition of past deeds--and misdeeds.\"\\n\\n \"Self imposed,\" I repeated. \"There really is no outside judgment then?\"\\n\\n \"What condemnation could possibly be more harsh than one\u0027s own when self-pretense is no longer possible?\" he asked.\\n\\n I turned my face away from him and looked out at the countryside. Its beauty seemed to make the memories of my shortcomings all the more acute; especially those concerning Ann. \"Is anyone ever happy with what they reexperience?\" I asked.\\n\\n \"I doubt it,\" he said. \"No matter who they are, I\u0027m sure they all find fault in themselves.\" I reached down and began to stroke Katie\u0027s head. If it hadn\u0027t been for my memories, it would have been a lovely moment: the beautiful house, the exquisite landscape, Albert sitting across from me, Katie\u0027s warm head under my fingers.\\n\\n There were the memories though.\\n\\n \"If only I\u0027d done more for Ann,\" I said. \"For my children, my family, my friends.\"\\n\\n \"That\u0027s true of almost everyone, Chris,\" he said. \"We all could have done more.\"\\n\\n \"And now it\u0027s too late.\"\\n\\n \"It isn\u0027t quite that bad,\" he said. \"Part of what you\u0027re feeling is a sense of incompletion because you didn\u0027t get to appraise your life as fully as you should have.\"\\n\\n I looked at him again. \"I\u0027m not sure I understand that,\" I said.\\n\\n \"Your wife\u0027s grief and your concern for her kept you from it,\" he said. His smile was understanding. \"Take comfort from what you\u0027re feeling, Chris. It means you really are concerned about her welfare. If you weren\u0027t, you wouldn\u0027t feel as you do.\"\\n\\n \"I wish I could do something about it,\" I told him.\\n\\n Albert stood. \"We\u0027ll talk about it later,\" he said. \"Sleep now--and, until you know what you want to do, plan on staying here with me. There\u0027s plenty of room and you\u0027re more than welcome.\"\\n\\n I thanked him as he came over and squeezed my shoulder. \"I\u0027m going now,\" he said. \"Katie will keep you company. Think of me when you wake and I\u0027ll be here.\"\\n\\n Without another word, he turned and walked from the study. I stared at the doorway he\u0027d gone through. Albert, I thought. Cousin Buddy. Dead since 1940. Heart attack. Living in this house. I couldn\u0027t seem to get it through my head that all of it was real.\\n\\n I looked at Katie lying on the floor beside the sofa. \"Kate, old Kate,\" I said. Her tail thumped twice. I remembered the blinding tears that afternoon we\u0027d left her at the vet\u0027s. Now here she was, alive, looking at me once more with that bright expression.\\n\\n I sighed and looked around the room. It, too, looked completely real. I smiled, recalling the French Provincial room in Kubrick\u0027s 2001. Was I being held captive by some alien being? I had to chuckle at the thought. I noticed, then, there was no mirror in the room and realized that I had not seen a mirror in the entire house. Shades of Dracula, I thought, amused again. Vampires here? I had to chuckle again. How did one locate the separating line between imagination and reality?\\n\\n For instance, was I imagining it or was the light in the room really becoming more subdued?\\n\\n Ann and I were in Sequoia National Forest. Hand in hand, we moved beneath the giant redwood trees. I could feel her fingers linked with mine, hear the crunching of our shoes across the carpet of dry needles on the ground, smell the warm, aromatic odor of the tree bark. We didn\u0027t speak. We walked side by side, surrounded by the beauty of nature, taking a stroll before dinner.\\n\\n We\u0027d walked about twenty minutes before we reached a fallen tree and sat on it. Ann released a weary sigh. I put an arm around her and she leaned against me. \"Tired?\" I asked. \"A little.\" She smiled. \"I\u0027ll be fine.\" It had been a strenuous if pleasant experience for us. We\u0027d pulled a rental trailer up the steep hill to Sequoia, our Rambler wagon overheating twice. We\u0027d set up a tent with six cots inside, stored all our supplies in a wooden chest so the bears couldn\u0027t get them. We had a Coleman lantern but not a stove so had to maintain a fire under the grate provided by the campground. Most difficult, we had to heat washing water once each day for lan\u0027s diapers; he was only one and a half at the time. The camp looked like a laundry, diapers and baby clothes hanging on lines in all directions.\\n\\n \"We\u0027d better not leave them too long,\" Ann said after we\u0027d rested a while. The woman in the campsite next to us had offered to keep an eye on the children but we didn\u0027t want to over-do the imposition since Louise, the oldest, was only 9, Richard 6 1/2, Marie not quite 4, and even our \"watch dog,\" Katie, less than a year old.\\n\\n \"We\u0027ll go back soon,\" I said. I kissed her slightly damp temple and squeezed her. \"Just rest a few more minutes.\" I smiled at her. \"It\u0027s pretty here, isn\u0027t it?\"\\n\\n \"Beautiful.\" She nodded. \"I sleep here better than at home.\"\\n\\n \"I know you do.\" Ann\u0027s nervous breakdown had come two years earlier; she\u0027d been in analysis a year and a half now. This was the first major trip we\u0027d made since her breakdown; at the insistence of her analyst. \"How\u0027s your stomach doing?\" I asked.\\n\\n \"Oh, it\u0027s--better.\" She answered unconvincingly. She\u0027d had stomach problems ever since I\u0027d met her; how incredibly unaware I\u0027d been not to realize it meant something serious. Since her breakdown, the condition had improved but still disturbed her. As her analyst had told her: the deeper buried the distress, the further into the body it went. The digestive system was about as far as it could go to hide.\\n\\n \"Maybe we can buy a camper one of these days,\" I said; she\u0027d suggested it that morning. \"It would make preparing meals a lot easier. Make the whole experience easier.\"\\n\\n \"I know, but they\u0027re so expensive,\" she said. \"And I\u0027m costing so much already.\"\\n\\n \"I should start making more now that I\u0027m writing for television,\" I told her.\\n\\n She squeezed my hand. \"I know you will.\" She lifted the hand to her lips and kissed it. \"The tent is fine,\" she said. \"I don\u0027t mind it at all.\"\\n\\n She sighed and looked up at the redwood foliage high above, bars of sunlight slanting through it. \"I could stay here forever,\" she murmured.\\n\\n \"You could be a forest ranger,\" I said.\\n\\n \"I wanted to be one,\" she told me. \"When I was a little girl.\"\\n\\n \"Did you?\" The idea made me smile. \"Ranger Annie.\"\\n\\n \"It seemed like a wonderful way to escape,\" she said.\\n\\n Poor love. I held her tightly against myself. She\u0027d had so much to escape from too.\\n\\n \"Well.\" She stood. \"We\u0027d better mosey on back, Chief.\"\\n\\n \"Right.\" I nodded, standing. \"The path curves around, we don\u0027t have to go back the same way.\"\\n\\n \"Good.\" She smiled and took my hand. \"Here we go then.\"\\n\\n We started to walk again. \"Are you glad you came?\" she asked.\\n\\n \"Yeah; it\u0027s beautiful here,\" I said. I\u0027d been dubious about taking four young children camping; but then I\u0027d never gone camping as a child so I had nothing to judge by. \"I think\\n\\n it\u0027s working out great,\" I said. I didn\u0027t know it then but Ann\u0027s desire to camp-- notwithstanding her anxiety about trying anything new at a time of such mental stress-- was to open up a world of lovely experience not only for me but for the children as well.\\n\\n Continuing on, we reached a spot where the path divided. At the head of the right path was a sign that warned hikers not to go that way.\\n\\n Ann looked at me with her \"wicked little girl\" expression. \"Let\u0027s go that way,\" she said, drawing me toward the path on the right.\\n\\n \"But it says not to go that way,\" I told her. Playing the game.\\n\\n \"C\u0027mon,\" she urged.\\n\\n \"You want a dying redwood tree to land on our heads?\" I asked.\\n\\n \"We\u0027ll run if one starts to fall,\" she said. \"Oh...\" I clucked and shook my head. \"Miz Annie, you-is-bad,\" I said, doing my Hattie McDaniel from Gone With the Wind.\\n\\n \"Uh-huh.\" She nodded in agreement, pulling me toward the right hand path.\\n\\n \"You\u0027re a poor excuse for a forest ranger,\" I told her. Moments later, we reached a rock slope which declined to the edge of a cliff some fifteen yards away. \"See?\" I told her, trying not to smile.\\n\\n \"Okay, we\u0027ll go back now,\" she said. She repressed a smile. \"At least we know why we weren\u0027t supposed to come here.\"\\n\\n I gazed at her with mock severity. \"You\u0027re always taking me where I\u0027m not supposed to go,\" I said.\\n\\n She nodded in pleased agreement. \"That\u0027s my job; to bring adventure into your life.\"\\n\\n We started across the top of the slope, heading back toward the other path. The surface of the rock was slick with a layer of dry needles so we walked in single file, me behind. Ann had only gone a few yards when she lost her footing and fell on her left side. I started toward her and slipped myself, tried to get up but couldn\u0027t. I began to laugh.\\n\\n \"Chris.\" Her urgent tone made me look toward her quickly. She was starting to slide down the decline, each movement she made to stop herself making her slide further.\\n\\n \"Don\u0027t move,\" I said. My heart was pounding suddenly. \"Spread your arms and legs out wide.\"\\n\\n \"Chris ...\" Her voice trembled as she tried to do what I said and slipped even further. \"Oh, my God,\" she murmured, frightenedly.\\n\\n \"Don\u0027t move at all,\u0027\u0027 I told her.\\n\\n She did as I said and her backward slide was almost checked. I struggled clumsily to my feet. I couldn\u0027t reach her with my hand. And if I tried to crawl where she was, both of us would slide toward the edge.\\n\\n I slipped and fell to one knee, hissing at the pain. Then, carefully, I crawled to the top of the slope, speaking as I went. \"Don\u0027t move now, just don\u0027t move,\" I said. \"It\u0027s going to be all right. Don\u0027t be afraid now.\"\\n\\n Suddenly, it all came back. This had already happened. I felt a rush of intense relief. I\u0027d find a fallen branch, extend it down to her and pull her to safety. I\u0027d hold her in my arms and kiss her and she\u0027d be--\\n\\n \"Chris!\"\\n\\n Her cry made me whirl. Aghast, I watched her sliding toward the edge.\\n\\n Forgetting everything in panic, I dived down the slope, skidding toward her, looking at her dread-whitened face as she slid backward. \"Chris, save me,\" she pleaded. \"Save me. Please. Chris!\"\\n\\n I cried out in horror as she disappeared across the edge and vanished from sight. Her shriek was terrible. \"Ann!\" I screamed.\\n\\n I jolted awake, my heartbeat racing; sat up quickly and looked around.\\n\\n Katie was standing beside the sofa, wagging her tail and looking at me in a way which I could only interpret as concerned. I put my hand on her head. \"Okay, okay,\" I murmured. \"A dream. I had a dream.\"\\n\\n Somehow, I felt she understood what I was saying. I put my right palm to my chest and felt the heavy pulsing of my heart. Why had I had that dream? I wondered. And why had it ended so differently from what had really happened? The question harrowed me and I sat up, looking around, then called Albert\u0027s name.\\n\\n I started with surprise as instantly--and, Robert, I mean instantly--he walked into the room. He smiled at my reaction, then, looking closer, saw I was disturbed and asked what was wrong.\\n\\n I told him about the dream and asked what it meant.\\n\\n \"It was probably some symbolic \u0027leftover,\u0027 \" he said.\\n\\n \"I hope I don\u0027t have any more,\" I told him, shuddering.\\n\\n \"They\u0027ll pass,\" he reassured me.\\n\\n Remembering Katie standing by me when I woke, I mentioned it to Albert. \"I have the strangest impression that she understands what I say and feel,\" I said.\\n\\n \"There\u0027s understanding there,\" he replied, bending over to stroke her head. \"Isn\u0027t there, Katie?\"\\n\\n She wagged her tail, looking into his eyes.\\n\\n I forced a smile. \"When you said think of you and you\u0027d be here, you weren\u0027t kidding.\"\\n\\n He smiled as he straightened up. \"That\u0027s how it is here,\" he told me. \"When you want to see someone, you have only to think about them and they\u0027re with you. If they wish to be, of course; as I wished to be with you. We always did have a kinship. Even though we were years apart, we were on the same wave length, so to speak.\"\\n\\n I blinked in startlement. \"Say that again?\" I asked.\\n\\n He did and I\u0027m sure my mouth fell open. \u0027\u0027Your lips aren\u0027t moving,\u0027\u0027 I said.\\n\\n He laughed at my expression.\\n\\n \"How come I didn\u0027t notice that before?\"\\n\\n \"I wasn\u0027t doing it before,\" he told me. Lips unmoving. I stared at him, dumbfounded. \"How can I hear your voice when you\u0027re not talking?\" I asked.\\n\\n \"The same way I hear yours.\"\\n\\n \"My lips aren\u0027t moving either?\"\\n\\n \"We\u0027re conversing with our minds,\" he answered.\\n\\n \"That\u0027s incredible,\" I said. I thought I said.\\n\\n \"Actually, to speak aloud is rather difficult here,\" he told me. \"But most newcomers don\u0027t realize, for quite a while, that they aren\u0027t using their voices.\"\\n\\n \"Incredible,\" I repeated.\\n\\n \"Yet how efficient,\" he said. \"Language is more a barrier to understanding than an aid. Also, we\u0027re able, through thought, to communicate in any language without the need of an interpreter. Moreover, we\u0027re not confined to words and sentences. Communication can be enhanced by flashes of pure thought.\\n\\n \"Now,\" he continued, \"I\u0027ve been wearing this outfit so you wouldn\u0027t be taken back by my appearance. If you don\u0027t object, I\u0027ll return to my natural garb.\"\\n\\n I had no idea what he meant.\\n\\n \"All right?\" he asked.\\n\\n \"Sure,\" I said, \"I don\u0027t know what--\"\\n\\n It had to have happened while I blinked. Albert wasn\u0027t wearing the white shirt and trousers any longer. Instead, he wore a robe the color of which matched the radiation around him. It was full-length, hanging in graceful folds, a gold sash at its waist. I noted that his feet were bare.\\n\\n \"There,\" he said. \"I feel more comfortable.\" I stared at him--a little impolitely, I\u0027m afraid. \"Do I have to wear one too?\" I asked.\\n\\n \"Not at all,\" he said. I don\u0027t know what my expression was but it obviously amused him. \"The choice is yours. Whatever you prefer.\"\\n\\n I looked down at myself. It was a little odd, I had to admit, to see the same clothes I\u0027d been wearing the night of the accident. Still, I couldn\u0027t see myself in a robe. It seemed a bit too \"spiritual\"- for me.\\n\\n \"And now,\" Albert said, \"perhaps you\u0027d like to take a more extensive look at where you are.\" \\n\\n","sourceLink":"https://allnovel.net/what-dreams-may-come/page-11.html","bookId":2541,"book":{"id":2541,"title":"What Dreams May Come","description":"Storyline: A LOVE THAT TRANSCENDS HEAVEN AND HELL \\n What happens to us after we die? Chris Nielsen had no idea, until an unexpected accident cut his life short, separating him from his beloved wife, Annie. Now Chris must discover the true nature of life after death. \\n But even Heaven is not complete without Annie, and when tragedy threatens to divide them forever, Chris risks his very soul to save Annie from an eternity of despair. \\n Richard Matheson\u0027s powerful tale of life---and love---after death was the basis for the Oscar-winning film starring Robin Williams.\\n","cover":"https://allnovel.net/images/what-dreams-may-come.jpg","author":"Richard Matheson","type":"Horror","source":"allnovel","link":"https://allnovel.net/what-dreams-may-come.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:00:54 AM"}}
