{"id":110587,"no":17,"title":"Page 17","content":"\"THERE IT is,\" Leona said.\n I looked ahead, reacting, with amazement, to the sight. I\u0027d been so intent on her words, I\u0027d failed to notice a city in the distance.\n I say a city, Robert, but how different from a city on earth. No dingy haze of smog above it, no smoke or traffic din. Instead, a series of astonishingly lovely buildings of every size, none more than two or three stories high, all standing in clear-aired silence. You\u0027ve seen the Music Center in downtown Los Angeles. That will give you some faint concept of the clarity of line I saw, the use of space to balance mass, the sense of peaceful uniformity.\n It struck me how vividly I was able to see it despite our distance from it. Every detail stood out. A photographer would call it perfection of focus, depth and color.\n When I mentioned it to Leona, she told me that we possess what might be called telescopic sight. The description is, again, inadequate, the phenomenon far more complex than mere telescopies. In effect, distance is eliminated as a sight factor. If one looks at a person several hundred yards away, that person is visible to the very color of their eyes--without the image being magnified. Leona explained it by saying that the spirit body can project an energy \"feeler\" to the object under inspection. In essence, the ability is mental.\n \"Do you want to go there quickly or shall we continue walking?\" Leona asked.\n I told her I was enjoying the walk if it didn\u0027t take up too much of her time; I didn\u0027t want to make the same mistake with her I had with Albert. She replied that she was enjoying a period of rest and was happy to walk with me.\n We\u0027d reached a lovely foot bridge which traversed a fast-moving brook. As we started across, I stopped and looked at the rushing water. It had the appearance of liquid crystal, every movement scintillating with the colors of the rainbow.\n Turning my head, I leaned over, curious. \"That sounds like... music?\" I asked, amazed.\n \"All things give off a kind of music,\" she told me. \"When you\u0027ve been here a while, you\u0027ll hear it everywhere. It\u0027s just that the movement of this water is so rapid, the sound is more easily noticeable.\"\n I shook my head in awe as the sounds kept altering in a sort of formless yet harmonic melody. I thought, for a moment, of Mom\u0027s favorite piece, Die Moldau. Had Smetana sensed that music in the moving waters of the river?\n Staring down at the brook, I remembered a stream near Mammoth Lake. We\u0027d parked the camper just above it and, all night, listened to it splashing across rocks and stones; a lovely sound.\n \"You look sad,\" Leona said.\n I couldn\u0027t repress a sigh. \"I\u0027m remembering,\" I said. \"A camping trip we took.\" I tried to put aside the feeling of depression--I really did--but, once again, was gripped by it. \"I\u0027m sorry,\" I apologized. \"It just seems that, the more beauty I see the worse it gets because I want to share it with my family, mostly my wife.\"\n \"You will,\" she told me.\n \"I hope so,\" I murmured.\n She looked surprised. \"Why did you say that?\" she asked. \"You know you\u0027ll see her again.\" \"But when?\" I asked.\n She looked at me for several moments before replying. \"Would you like to know?\"\n I started sharply. \"What?\"\n \"There\u0027s an Office of Records in the city,\" she told me. \"Its main job is to keep a register of people newly arrived but they can, also, provide information regarding those yet to come.\"\n \"You mean I can find out when Ann is going to join me?\" It seemed too marvelous to be true.\n \"We\u0027ll ask,\" Leona told me.\n I drew in trembling breath. \"Let\u0027s not walk there, please,\" I said.\n \"All right.\" She nodded understandingly and held out her hand. \"Albert told me that you\u0027ve traveled by mind a little but--\"\n \"Yes, please help me,\" I said, interrupting her in my excitement.\n \"Wait here, Katie,\" she said and took my hand.\n I closed my eyes. That indescribable sense of movement again. With nothing visual for reference, I was more aware of it mentally than physically; there was no wind, no vertigo, no feeling of pressure.\n When I opened my eyes, an instant later, we were in the city, standing on a broad avenue paved--is that the proper word?--with grass. I could see that the city was laid out like Washington--an enormous hub with radiating spokes of thoroughfares, one of which we stood on. On each side of us were buildings, some with steps or pavement leading up to them--a material resembling alabaster, all of delicate pastel shades.\n The buildings here are broad, not high--circular, rectangular or square, magnificently designed with simple lines, constructed of what looks like translucent marble. Each is surrounded by sumptuous grounds which include ponds, streams, brooks, waterfalls and small lakes. My immediate--and overwhelming--impression was one of space.\n I saw a taller building in the center of the city and asked Leona what it was. She told me that it was a place of rest for those whose lives had been terminated by violence or long, debilitating illness; I thought of Albeit when she said that. As I gazed at the building, I began to see a blue light shining down on it. Leona told me that it was a beam of healing vibration.\n I forgot to mention that, when I opened my eyes, I saw many moving nimbuses of light which, shortly, faded to reveal people going about their business. None seemed in the least surprised by our precipitous appearance but smiled and nodded to us as they passed. \"Why do I see everyone as light first?\" I asked. \"There\u0027s such powerful energy in the spirit body that its rays overwhelm the sight of those not used to it,\" she explained. \"You\u0027ll adjust.\" She took me by the arm. \"The office is this way.\"\n I know it sounds bizarre for me to speak about the heavy beating of my heart. It did beat heavily though. I was about to find out how long I\u0027d have to wait before Ann and I would be together again and the suspense was oppressive. Perhaps it was to avoid such a reaction in me that Albert hadn\u0027t told me about the Office of Records. He may have thought it better that I, simply, knew she was to join me and wasn\u0027t concerned about the amount of time involved. I recalled that Leona had hesitated before telling me. What I was about to do was probably not encouraged, I decided.\n The paving we were on now looked like smooth, white alabaster which, although it appeared solid, felt springy underfoot. We were entering a large square with thickly foliage trees of every variety growing on immaculate lawns. In the center of the square, five paths leading to it, was an immense, circular fountain of some dozen jets. If I had not been so anxious, I would have been enchanted by the musical tones emitted by the splashing water.\n Leona told me--to distract me? I wonder--that every tone was created by a combination of smaller jets, each a separate note. The entire fountain could be--and was, at times-- manipulated so that a complex piece of music could be played as though on an organ console. At the moment, the fountain was sending forth a series of harmonic chords.\n Just ahead, now, was the Office of Records, Leona told me. I tried to keep my pace a steady one but kept increasing its speed. I couldn\u0027t help it. More than anything else in this incredible new world, I wanted to know Ann\u0027s destiny. \n","sourceLink":"https://allnovel.net/what-dreams-may-come/page-17.html","bookId":2541,"book":{"id":2541,"title":"What Dreams May Come","description":"Storyline: \n A LOVE THAT TRANSCENDS HEAVEN AND HELL \n What happens to us after we die? Chris Nielsen had no idea, until an unexpected accident cut his life short, separating him from his beloved wife, Annie. Now Chris must discover the true nature of life after death. \n But even Heaven is not complete without Annie, and when tragedy threatens to divide them forever, Chris risks his very soul to save Annie from an eternity of despair. \n Richard Matheson\u0027s powerful tale of life---and love---after death was the basis for the Oscar-winning film starring Robin Williams.\n \n","cover":"https://allnovel.net/images/what-dreams-may-come.jpg","author":"Richard Matheson","type":"Horror","source":"allnovel","link":"https://allnovel.net/what-dreams-may-come.html","creation":"Oct 5, 2019 8:58:51 AM","modification":"Oct 6, 2019 12:00:54 AM"}}
