{"id":70428,"no":20,"title":"Page 20","content":"“No,” she said. “I’l do it.” And she did. She turned the key in the lock, opened the door, and flipped on the lights. Her eyes ached from the searing brightness, but at least now she was no longer in the dark.\n Papers were everywhere. Black fingerprint dust coated several surfaces. Blood had dried to a dark brown pool on the bathroom floor. Stacie’s blood.\n Lana squared her shoulders and prayed for strength. This was not going to be easy.\n CHAPTER THIRTEEN\n Marcus Lark regretted giving Kara his private number. The woman was growing far too clingy for his tastes.\n He lifted the phone from the cradle on his bedside table and shifted his body until he was sitting against the headboard. Elaborate carvings dug into his back, but he ignored the discomfort.\n “Yes, love?” he answered in a gentle voice. He’d learned long ago that Kara was more easily controled with gentleness than fear. She’d grown up alone on the streets of New York and wasn’t easily frightened.\n Kindness, on the other hand . . . the woman would do anything for the merest scrap of approval or acceptance. That trait made her quite useful on occasion.\n “They found my surveilance equipment. I’m sorry. I couldn’t finish the job tonight like I told you I would.” She was out of breath, almost panicked.\n “Calm down, love,” cooed Marcus, even as his hand tightened on the phone in anger at her incompetence. “Everything is fine. I’ve taught you wel. Is there any trace of you on the equipment?”\n “None. I was careful.”\n “Good girl. And you wore gloves?” He hoped not. It would be easy to make her fingerprints available in any one of the American databases. Kara was becoming too reckless, too desperate to please him, which didn’t please him at al. He thought letting the CIA overhear that Lana was in danger would be enough to bring them running to save her. They’d find Kara and get rid of her so he wouldn’t have to do it himself.\n Apparently he’d misjudged.\n “Yes. Always.”\n A stab of frustration made him tense up, and the woman at his side let out a sleepy sigh. Marcus forced himself to relax and lowered his voice. After last night, his bed partner needed her rest. “Good.”\n “I always do what you say.”\n Her simpering tone grated on his nerves, but he didn’t let his irritation come through in his voice. “You’ve always been a good girl.”\n “Did you get the video?”\n Marcus did but knew better than to watch it. Kara’s taste in entertainment was more . . . undomesticated than his. “It was lovely.”\n “And the clip at the end?” she asked in a sexy tone. “The one of us together?”\n Marcus stiled in shock as her words settled in. She had video of him? With her?\n He kept his voice low and even, though inside he was seething in anger. “I’m going to watch it again right now just for you.”\n He slid from the high bed and walked naked across the room to his private office. A moment later, he found the encrypted e-mail she’d sent and opened it. He sped through images of a young woman’s terror—flashes of her twisting in bed with tears streaming down her temples. Her body was contorted in fear and pain, but she didn’t wake.\n Kara had done that to her. He wasn’t sure whether that made him admire her or despise her. But such dedication, as ugly as it was, had its uses.\n Then he saw the short clip at the end, which clearly showed his face contorted in the throes of an orgasm. Kara was in front of him on her hands and knees, and the camera—wherever it had been hidden—had a perfect shot of his face.\n He couldn’t let this video get into the wrong hands. He’d worked too hard to hide himself—to become a man who did not exist—to let Kara ruin everything. Now that the Swarm was destroyed, he was able to operate his business more easily. Profits had never been higher. He was not going to go back to being a hunted man at the head of a condemned organization.\n Marcus Lark was tired of being a target.\n “You naughty girl,” he said into the phone. “You know I don’t like my picture taken.”\n “I know, but I needed something to remember you by. It’s horrible being without you every night. At least I have that.”\n And that video changed everything. If Kara was eliminated now, they’d find the video. “Come home to me, love. I miss you too much to let you stay away.”\n “I have to finish my work here. I promised you I would.”\n “Forget the promise. I’d rather have you here.” Where he could safely kil her and destroy the video.\n “I’m almost done. I’l record the rest of the show for you tonight, and then I’l come home.”\n “No!” he said, more hastily than he should have. Then more gently, “You can’t do it now, love. She’s guarded now. It’s too dangerous for you. Just come home.”\n “I’l be careful. I won’t let you down. Not again.”\n Damn it! He’d made too much of her failure in Armenia. He’d rubbed her nose in the fact that Lana Hancock had survived, and now he had to live with that error in judgment. “I don’t want anything to happen to you. At least wait a day or two. They’l be expecting you to make a move now that your equipment was found.”\n A day or two was al he’d need to have one of his men move in and get rid of that video. Then Kara could do whatever foolish thing she wanted.\n “You’re right, as always,” she said. “I can find a good use for the time—punish her for making things difficult and keeping me from you.”\n “Tel me what you’re going to do, love,” he coaxed as he sent an e-mail to one of his best hit men containing instructions.\n “I’m going to surprise you. I’m going to make you proud.”\n “I’m always proud of you, love. You know that.”\n He could hear her soaking up the praise. “After I take care of things here, you’l be even more proud.”\n After a long, unproductive talk with Stacie Cramer, Detective Hart decided to have another chat with Lana. It was midmorning, and he found her at her office, nearly finished with the chore of cleaning up the mess. The big bruiser, Caleb, was in the bathroom with the door shut, but when the bels on the door jingled, he stepped out, checking to see who was there. Jacob caught the scent of disinfectant and figured Caleb was taking care of cleaning up the blood rather than leaving it to Lana.\n Good man.\n Caleb nodded at him and continued his work, only this time the door was open. Jacob couldn’t see any blood on the tile, not even a stain on the grout.\n Jacob left Caleb to finish cleaning and turned his attention back to Lana. She looked tired today, worried, but that wasn’t surprising considering what her friend had been through. Her dark hair was puled back in a short ponytail, but a bunch of the slippery strands had worked their way free and hung around her face. She was pretty in that natural, girl-next-door kind of way. There was nothing exotic in her features, but she reminded him a little of the first woman he’d ever had a crush on. Miss Parish, his sixth-grade English teacher. Although he’d missed most of her lectures, spending the time daydreaming instead, Miss Parish had taught him some interesting things about how his adolescent body worked.\n “Morning, Ms. Hancock,” he greeted her. She swept a loose lock of hair behind her ear and gave him a fake smile.\n “Have you figured out who did this?” she asked.\n “I’m afraid not. Do you mind if I ask you some questions?”\n She looked like she wanted to say no, but she nodded and puled up a spare chair for him to sit in.\n “I saw Mrs. Cramer this morning. She seems to be doing wel.”\n Lana nodded. “I talked to her on the phone earlier and she asked me to bring her work, so that’s a good sign.”\n “Have you noticed anything missing?” he asked.\n “No.”\n “Anything unusual or out of place?”\n She hesitated too long, which meant she was either deciding whether or not to lie or thinking up one. “No.”\n Okay, so not much intricate thinking involved in that answer, so she must have been debating about lying. Whether or not she had, he wasn’t sure. “I noticed the stacks of notebooks on the desks. Is that how you left them?”\n “I can’t remember. Maybe. Or it could have been something Stacie was working on.”\n Jacob scribbled down another note to remember to ask Stacie about it. “We found what appears to be a listening device. Do you know anything about that?”\n She tensed up but covered it by shooting to her feet. “Would you like some coffee?”\n “Sure,” he replied as if she hadn’t just tried to distract him.\n She poured him a cup of coffee that looked like it had been there for several hours—just like he was used to back at the station.\n “What about it?” he prodded. “Know any reason why your office would be bugged?”\n She gave a shrug that was too stiff to be nonchalant. “We don’t do anything top secret here. Our financial records are public, and we certainly don’t have a lot of money.”\n She hadn’t said no, just given him an evasive answer. Interesting.\n “How long have you been in this office?”\n “About six months.”\n “Did the furniture come with it?”\n “No. I bought the desks and chairs. Why?”\n “How about the blinds? The artwork?”\n She gave him a confused frown. “The blinds were here when I moved in. The posters were free when I bought the desks.”\n “Where did you buy them?” He sipped his coffee.\n “That used-furniture store two blocks down.”\n “I know the one,” said Jacob.\n “Can you think of any reason why someone would want to hurt Stacie?”\n “She doesn’t have any enemies,” said Lana.\n “That’s not what I asked.”\n “Why would anyone want to hurt her?”\n “That’s my question,” said Jacob.\n “I’m sorry. I can’t help you.”\n Couldn’t or wouldn’t? Jacob wasn’t sure which. What he was sure about was that Lana had a bad past. Her office was bugged. A highly decorated soldier was staying nice and close, and she was terrified.\n Whatever was going on here was both bigger and uglier than he’d hoped, which meant he had a lot of extra work to do. Between this and the homicide at the drugstore last night, he had his hands ful.\n “What about you?” he asked her. “Is there any reason someone would want to hurt you?”\n “Why are you asking al these questions?”\n “Standard procedure.”\n She raised a disbelieving brow. “I have a ton of work to do.”\n Jacob nodded and puled out his business card. “Keep this in case you think of anything else.” Not that she’d tel him if she did.\n “Thanks.” She took the card and set it on top of what looked like a stack of trash on her desk.\n Jacob waved a hand at Caleb as he left. He wasn’t sure why the man was hanging out with Lana, but he was glad Caleb was here. Jacob wouldn’t have felt safe leaving the woman alone. He knew her history, and she’d been through hel. The last thing he wanted was for her to go through it al again. \n","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-20.html","bookId":2375,"book":{"id":2375,"title":"No Control (Delta Force #2)","description":"Storyline: \n No Control (Delta Force #2) \n NO HIDING. Lana Hancock knows all about danger--and betrayal. Eighteen months ago, she was captured by a terrorist group known as the Swarm while one of its members, a rugged man with sinfully dark eyes, did nothing to help her. Now when she\u0027s freed and desperate to put it all behind her, the unthinkable happens. The Swarm is targeting Lana once again and the man who stood silently by has become her protector. But can she trust him? NO ESCAPE. Delta Force operative Caleb Stone will never forget the hatred shining in Lana\u0027s eyes. Ordered to take down the Swarm by infiltrating its ranks, Caleb couldn\u0027t blow his cover to save her--no matter how much it haunted him. Now, gifted with a second chance, he vows to move heaven and earth to protect her...and fulfill her every desire. But the Swarm has reorganized. It\u0027s more powerful than ever and hell-bent on revenge...NO CONTROL.\n \n","cover":"https://allnovel.net/images/no-control-delta-force-2.jpg","author":"Shannon K. Butcher","type":"Mystery","source":"allnovel","link":"https://allnovel.net/no-control-delta-force-2.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:16:10 AM"}}
