{"id":70438,"no":30,"title":"Page 30","content":"His hands slid under the hem of her shirt, finding skin as soft and warm as sunlight. Her supple spine arched in response, pushing her hips against him in a maddening gyration. Caleb’s restraint broke and there was no more holding back. He was going to love her tonight, no matter how much of a mistake it might be. Caleb’s mouth puled away from hers, and he rained hot, open-mouthed kisses along her neck, sucking and biting as he went. He was sure he was leaving marks behind for anyone to see, and part of him cheered a primitive response. He wanted everyone to know she was his. Only his. His teeth bit gently along the joint of neck and shoulder, and Lana hissed and her nails scored his back. “Like that?” he asked, already knowing the answer. She gave an incoherent noise of appreciation, and Caleb swirled his tongue to soothe the sting his teeth had left behind. His hands slid around to her front, splaying over her pale tummy and ribs, brushing away the barrier of her soft knit shirt. Caleb’s stomach did a slow, lazy rol as he watched his hands moving over smooth, perfect skin. Lana’s skin. “I want to see you,” he told her, his voice rough and demanding. “See your naked breasts al puckered and eager for my mouth. Like they were in the shower.” Lana’s fingers tangled with his as she tried to rid herself of the shirt. They managed to get it off, and it flew somewhere across the room, lost and forgotten. Caleb found her hands and held them away from her body so he could look his fil. She was so beautiful with her skin flushed and her nipples tight and begging for his mouth. He’d seen a lot of naked women, but no woman before Lana had made his hands shake. None had made him wish he was a better man, more deserving of her. No longer able to resist, Caleb released her hands and drew a finger over the lower curve of her breasts. She jerked and wiggled, trying to coax him to touch her more fuly, but he held back. Lana was a once-in-a-lifetime woman, one who had to be savored, and he was going to do just that. She grabbed his wrist, trying to move his hand to cover her breast, showing him how she wanted to be touched, but she was no match for his strength. She couldn’t make him budge from the slow, lazy path he drew over her smooth skin. Lana quit fighting him and started to wage her own war. Her clever little hands slid down between them until she found the rigid length of his penis. Slim fingers wormed their way under the stretchy waistband of his sweats and wrapped around him in a bold caress. It was Caleb’s turn to hiss out his pleasure, and he closed his eyes, enjoying the feel of her hand on him, the feel of her fingers stroking and teasing. He wasn’t going to last two minutes if she kept that up, and he had more in mind than a hand job. “None of that yet,” he told her, puling her wayward hand out of his pants. “When I come, I want it to be deep inside you, right where I belong.” She shivered and her eyes darkened, driving the deep blue to a thin ring of color. Her tongue slid out over her bottom lip, and Caleb couldn’t stop himself from tasting her mouth again. She tasted like home, sweet and warm and his. How was he ever going to let her go? Caleb shoved the thought away before it could taint the time they had now. She was half-naked and wiling, in his arms, and that was enough. It had to be enough. He spread his hand wide, covering her breast so that her tight little nipple speared up into his palm. Lana whimpered into his mouth and he felt her slim hands clench his shoulders. She fit perfectly in his hand, the soft, womanly curve of her breast making his mouth water. He slid his fingers over her skin, tugging at her nipple, feeling it lengthen and tighten against the caluses of his fingertips. Lana let out a ragged moan of approval that made Caleb’s head spin. He loved her responsiveness, al the little noises she made and the way her body quivered and strained to get closer to his. He puled his mouth from hers, needing to feel her nipples against his tongue. He cupped her breast in his hand while his lips closed over her nipple. She let out a strangled cry, and Caleb felt her flesh vibrating with his possessive growl. She was his. Too far gone to stop. Too wild. And he loved it. Maybe he should have pressed the advantage and tried to question her again, but he couldn’t bear the thought of her puling away from him. Not now. Maybe not ever. He suckled her breasts, loving them evenly, using lips and tongue and teeth to drive her into a frenzy. She didn’t even notice when he slipped those flimsy shorts off her legs and spread them wide. The scent of her arousal sent streamers of need shooting through him, but he held himself back, just a little longer. He knew she was turned on, but he wanted her desperate, unable to think of anything but getting him inside her. His mouth moved down her body while his fingers tugged and roled her nipples. He kissed her ribs and lingered on the sweet curve of her stomach, running his tongue around the rim of her bely button. That had her arching her hips off the bed, and he fit his hands under her, gripping the firm cheeks of her ass in his palms. She knew what he was going to do now. He could feel it in the way she went stil, in the way her legs vibrated against his shoulders. He wasn’t sure if it was something she wanted, but he wasn’t going to give her a chance to protest, not before he got to taste her. His tongue flicked out, barely grazing her flesh. Her thighs tightened, but his shoulders held them open wide. The second touch was more firm, more direct. Her fingers raked through his hair, holding him, not pushing him away. It was al the encouragement Caleb needed. He slid one finger along her folds, parting the delicate skin, feeling the slick heat of her arousal. It was nearly enough to make him come, knowing she wanted him like that, feeling the proof of her want for him against the tip of his finger. He pressed into her just a little, just enough to let her feel the invasion. Her body clamped down on his finger as if trying to pul him deeper inside. Caleb choked on a raw groan of need that bubbled up out of him, giving away his own desperation. He wasn’t going to last much longer, and he wanted to make it as good for her as possible. He opened her folds so that he could see the little pink button hidden inside. Lana stiffened at his intimate inspection and she started to sit up, so he pushed his finger deeper, giving her what her body had begged for only moments ago. Lana’s hands fisted in the blankets, and she flopped back down onto the bed with a soft sound of pleasure. Caleb grinned as he flicked his tongue lightly over her clitoris. Lana puled in a shocked breath, but he didn’t give her time to let it out before he licked her again. He felt the flesh around his finger pulse and become slicker. She was tight, maybe too tight to take him easily, and as much as that tightness thriled him, it also made preparing her that much more important. He wrapped his lips around the sensitive flesh, being careful to gauge her reaction, not wanting to do anything that would hurt her. But whatever she was feeling wasn’t pain. She was panting, and the skin on her chest had deepened to a pretty pink blush that spread up her throat. Caleb slid his finger out and back while he licked and nibbled. Her breathing was growing more ragged, and her head was thrown back. She was getting close to coming, and he forced her forward with eager determination. With each passing second her back arched higher, until he felt her climax take over her body. She let out a sweet cry of pleasure as the lower half of her body trembled against the orgasm. He locked his lips around her clitoris and suckled her as he had her nipples, driving her right through her release. He felt the liquid response of her body and the rhythmic pulsing of her muscles. Caleb waited until the waves of her orgasm had started to fade and then pressed a second finger inside her slick body, stretching her. The pressure drove her back up and over the crest of a second climax and made Caleb moan into the sensitive flesh between her legs. He felt her orgasm rock him to the marrow of his bones, making him feel like a freaking superhero. Making her come was the world’s greatest high, and he wasn’t sure how long he’d be able to go without doing it again. She came back down, breathing hard and limp on the bed. Her legs were splayed wide, and in the bright lights of the room, he could see the shiny proof of her release slick on his hand and her thighs. A wave of lust hit him so hard he couldn’t breathe. His fingers were stil buried inside her, feeling the tiny quivering twitches that remained of her orgasm. He puled them from her body and heard her answering whimper of loss. He should have just walked away from her, leaving her sated. He’d made her forget, which had been his goal, but now that he was here, with her body laid out before him like an offering, there was nothing he could do to resist. He needed her. Needed the soft strength of her body to enfold him, ease him. He’d never needed anything more. Caleb shucked his sweats and lowered his body over hers. As the weight of him pressed against her, her eyes snapped open, revealing more than just the aftermath of passion. She was afraid. Caleb bit back a violent word and eased himself away. No way was he going to take her with that look on her face. He’d sooner blow his own head off. CHAPTER NINETEEN Lana saw Caleb’s face, the desperate set of his jaw, the way it bulged as he gritted his teeth and backed away from her. He’d seen her fear. He’d been about to make love to her, and he’d seen that momentary flash of panic she’d gotten in her eyes. Lana wanted to kick herself for letting him see it, but she hadn’t been able to predict how panicked she’d get with his bulk holding her down. She hadn’t been with a man since Oran—before her abduction—and this reaction slammed into her from out of the blue, completely unexpected. Her body was humming with satisfaction, her limbs languid and slow, but she was fast enough to stop his retreat. She grabbed his wrist and forced him to look at her. “I want you, but I can’t be on the bottom,” she explained, her voice hoarse. “It makes me feel . . . trapped.” Bound, helpless, out of control. She couldn’t think straight with those memories of being held captive stil too near her waking thoughts, so she shoved them away, focusing on Caleb’s beautiful body. He looked unconvinced, and she saw the muscles in his jaw bunch. “Please,” she whispered. “I need you.” She didn’t want him leaving yet, not until she’d felt what it was like to hold him inside her body, to be as close to him as a woman could be. “Give me ten seconds.” He raced out of the bedroom and returned in less than that, ripping a condom package open with his teeth. She watched as he roled it over his erection, wishing she’d had the fun of doing that herself. “Lie down,” she urged him, tugging at his arm and moving aside so there was an empty swath of bed to hold him. Caleb lay down, and his body swalowed up al the space on the double bed. Lana gave him what she hoped was a seductive smile and straddled his naked body, sitting over his stomach with the heavy length of his penis just behind her. He was glorious. There was no other word for it. His limbs were thick with muscle, the veins standing out under the strain of his racing heart. The dark hair on his chest tempted her to touch, to explore the springy texture with her fingers and breasts. His eyes were black with desire, and a dark stain of lust highlighted his cheekbones.","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-30.html","bookId":2375,"book":{"id":2375,"title":"No Control (Delta Force #2)","description":"Storyline: No Control (Delta Force #2) NO HIDING. Lana Hancock knows all about danger--and betrayal. Eighteen months ago, she was captured by a terrorist group known as the Swarm while one of its members, a rugged man with sinfully dark eyes, did nothing to help her. Now when she\u0027s freed and desperate to put it all behind her, the unthinkable happens. The Swarm is targeting Lana once again and the man who stood silently by has become her protector. But can she trust him? NO ESCAPE. Delta Force operative Caleb Stone will never forget the hatred shining in Lana\u0027s eyes. Ordered to take down the Swarm by infiltrating its ranks, Caleb couldn\u0027t blow his cover to save her--no matter how much it haunted him. Now, gifted with a second chance, he vows to move heaven and earth to protect her...and fulfill her every desire. But the Swarm has reorganized. It\u0027s more powerful than ever and hell-bent on revenge...NO CONTROL.","cover":"https://allnovel.net/images/no-control-delta-force-2.jpg","author":"Shannon K. Butcher","type":"Mystery","source":"allnovel","link":"https://allnovel.net/no-control-delta-force-2.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:16:10 AM"}}
