{"id":70440,"no":32,"title":"Page 32","content":"Brent and Riley laughed.\n “Mad?” she asked, looking at Caleb.\n “Yes, ma’am,” answered Mad in that steady, even voice that Caleb had never once heard raised in anger or joy.\n Mad was a bit shorter than Caleb, but with plenty of muscle. They al teased him about his tendency toward emotionless stoicism, but when someone needed the impossible done in a hurry, Mad was the man to cal. Which made him perfect for this job. Caleb stil wasn’t sure how they were going to pul it off.\n The carnival was in a few days, and there were a milion details to cover. Good thing these were some of the most detail-oriented men on the face of the planet. Doing the impossible with whatever resources were available was what they did best.\n Caleb puled Lana aside and lowered his voice. “If you don’t need me, I’m going to brief the men on the situation, and we’l get started puling the carnival together.”\n She looked up at him like she wanted to say something different but changed her mind a moment before the words came out. “Are you sure about this? About . . . them?”\n “The men?”\n “Yes. They’re kind of intimidating, don’t you think? Won’t they scare the kids?”\n Caleb couldn’t stop himself from tucking a stray strand of hair behind her ear. He needed to touch her again, to feel her skin heat under his hands, but he settled for what he could get away with in public until he could get her alone again. “Trust me, honey. We know what we’re doing. We’ve done things like this for the kids on base, and none of them have run screaming.”\n “Are you sure? This fundraiser is important to me. If it fails . . .” She trailed off, and he saw something frightening flash through her eyes—something dark and powerful—a desperation so intense he could almost feel it rushing through her.\n “I won’t let you down,” he promised. “This is going to work. You’l see.”\n “We only have a few days.” That hopeless look she wore nearly brought him to his knees. He didn’t care who was watching or what his men thought. He puled her into his arms and kissed the top of her head.\n “Twice as many as we need. Trust me.”\n He felt her nod under his lips, but he could tel that she didn’t quite believe him. Didn’t quite trust him.\n The knowledge made his chest ache, but he knew he couldn’t force something like that. She trusted him with her body, but it wasn’t enough. He wanted her to trust him with her life, her future. He wanted to prove to her that no matter what had happened in the past, he’d never let her down again. He wasn’t sure why this fundraiser was so important to her, but he didn’t realy care. It was important to her, and that was al he needed to know.\n Caleb released Lana before he did something that would embarrass them both in front of the room ful of men. He gave her a quick kiss on the forehead and a reassuring smile. “Just trust me.”\n While the men were having their powwow, Lana ducked out of the office, intent on going to visit Stacie. She’d been sent home yesterday, and Lana wanted to make sure she and her sister were settling in okay.\n Lana had just reached her car when Caleb caught her. The sun blazed down, casting his face into a deep shadow. That jolt of feeling coursed through her as she was thrown back in time to the day he’d carried her out of that cave. Lana closed her eyes and braced her weight against her car door.\n “You okay?” he asked while his hands wrapped around her upper arms to steady her.\n Lana felt the heat of his touch warm her more thoroughly than the hot sun overhead. She stifled a little shiver, remembering just how his hands had felt as he’d touched her last night, how much pleasure he’d given her with just the stroke of his fingers.\n “I’m fine. Just feeling a little crowded in there.”\n “It’s a lot of people to cram into such a tiny office. Why don’t we go for a drive?”\n Lana stared at his big feet rather than risk getting hit by the force of the memories that lurked in his silhouette. “I’d rather be alone for a while.”\n “Let me come with you,” said Caleb. “It’s not safe for you to be alone. Not after what happened to Stacie.”\n She needed some time to herself—some space away from Caleb so she could think. Regroup. “I need this, Caleb. Just let me go. Please.”\n He stood quietly for a moment, and she wasn’t sure if he was trying to think of another argument or trying to convince himself he didn’t need one. “Would you prefer one of the other men go with you instead?” There was a quality in his voice that she hadn’t heard before. If she hadn’t known better, she would have thought it was insecurity, but that didn’t make any sense. No one was stronger or more courageous than Caleb.\n “Of course not. I don’t know those men. I just need some time alone. I need to go see Stacie. I need to visit the kids.” She hid the spike of anxiety she felt at the thought of going back to the youth center. Kara seemed to always be there.\n His hand cupped her cheek, and he fought the urge to lean into his touch. “I don’t want to let you go, but I guess it’s not my choice.”\n There was a deeper meaning to his words, she could hear it in his tone, but she didn’t dare try to figure it out. As it was, she was using every bit of wilpower she had to keep from begging him to make her life go away again. He’d given her a precious gift of solace in a world that had revolved around fear for so long she’d forgotten what it was like not to be afraid.\n He’d shown her what it was like to be normal again, and waking up to her real life had felt like a crushing blow. Nothing had changed. She stil had to stay silent. It was the only way to protect those she loved—a group that was wel on its way to including Caleb.\n “I’l be fine,” she told him. “Trust me.”\n If she hadn’t thrown his own words back at him, he might have forced the issue and pressured her to let him come, but instead, she’d asked him to trust her. How could he expect her to trust him if he didn’t do the same?\n Damn, he wished he just had something to blow up rather than having to deal with al this psychological shit.\n He watched her drive away and caled Grant on his cel phone. He answered with a sleepy, “’lo.”\n “Tel me you planted a tracking device on her car when you swept it for bugs and fixed the brakes.”\n Al sleepiness vanished, and Grant sounded wide-awake. “Of course. What’s up?”\n “She needed some time alone.”\n “Got it. I’m already on the way to the car. I’l have her in sight in less than five minutes.”\n Caleb pushed out a relieved breath. “Thanks.”\n “Does that mean you trust me not to seduce her away from you?”\n “Not if you like your smile on the front side of your head.”\n “Yeah, yeah. I get it. You’re big and mean, and you’l beat the shit out of me if I so much as touch her.”\n “I always knew you were a smart man.” Caleb hung up and went back inside to finish nailing down the final plans for the carnival. They weren’t going to try for anything fancy, but there was plenty they could do without spending much money. A lot of that hinged on the men being wiling to humiliate themselves, but that was al part of the fun.\n Three hours later, Caleb rubbed his ear, which was sore from too much exposure to the telephone. He’d made some progress, but not nearly enough to suit him. He didn’t want anything else to go wrong with Lana’s fundraiser. He’d told her to trust him, and he was determined that when al was said and done, she would know she could.\n He’d just set the phone back in its cradle when it rang. Lana stil wasn’t back, so he answered it in her stead. Sixty seconds later he was nearly in a panic, rushing out the door to find Lana. He was done playing games now. The stakes had just gone up, and he didn’t want to let her out of his sight again.\n Lana was sitting on the edge of Stacie’s bed, chatting quietly with her about her sister when Caleb came into the room. The look on his face nearly stopped her heart. His jaw was set at a grim angle, and his black eyes had darkened with anger to the point they reflected no light.\n “What is it?” she asked, knowing something was wrong.\n He took her hands, and she could feel rage vibrating though his limbs. “I’m sorry, Lana.”\n “What?” she demanded, fear uncurling inside her until it was a nearly living thing.\n “Everyone’s fine. You need to know that first, but there was a fire at your parents’ house. It was totaly destroyed.”\n “A . . . fire?” She couldn’t digest the information. It was too surreal.\n “Your mom and dad are safe. A little shaken up, but fine otherwise.”\n “Oh, Lana,” said Stacie, starting to rise from the bed.\n Lana held out her hand to stop her friend from getting up. She stil wasn’t strong enough yet to be moving around much.\n Caleb puled her against him, hugging her, but Lana was a statue in his arms. She couldn’t let him comfort her. If she weakened even a little, she would lose control. Mom and Dad were going to need her. “What happened?” she asked him.\n “Police and firemen are there now. It wil be a while before they know anything.”\n Lana pushed away from him and took a step toward the door—away from Caleb, away from Stacie, too. She had to get away from both of them and their soft words of comfort. “And you’re sure they’re okay?”\n “Yes. I spoke with your mother briefly. She says they’re both fine.”\n Lana nodded. A fire. Was this what was next on Kara’s list to destroy her life? First her peace and any sense of security were destroyed, then Stacie was shot, and now a fire? What was next? Who was next? Which of the people she loved was going to be the next target of violence?\n Caleb reached for her, but Lana jerked away. She couldn’t let him get near her again. It wasn’t safe. She had to break things off with Stacie, too. Fire her. Shove Stacie out of her life. It was the only way.\n Lana turned around, ignoring the worried voices behind her. She couldn’t stay here. She had to go see if her parents were realy okay, see it with her own eyes. Only then would she believe it was true.\n She had already puled out of Stacie’s driveway by the time Caleb came running out of the door. She had to get away from him. What if he was the next target?\n The streets blurred by her as she took the familiar path to the home where she’d grown up. It was nestled back on a little plot of land her father had worked two jobs to buy. She remembered her dad helping erect the frame of the house when she was five, remembered her mom poring over carpet samples and paint chips. She’d had sleepovers with friends and birthday parties there. She’d woken up many Christmas mornings to a festive tree and a pile of presents, her fat stocking hanging from the fireplace. She’d had her first kiss on the back porch and cried after her first breakup at the kitchen table.\n It was home.\n And now it was gone. Lana cleared the corner and the road was stil clogged with rescue vehicles. Dribbles of black smoke wafted into the clear summer sky, and the smel of that smoke choked her lungs. She got out of the car, not even sure if she’d left it running, and walked like a zombie up the street. \n","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-32.html","bookId":2375,"book":{"id":2375,"title":"No Control (Delta Force #2)","description":"Storyline: \n No Control (Delta Force #2) \n NO HIDING. Lana Hancock knows all about danger--and betrayal. Eighteen months ago, she was captured by a terrorist group known as the Swarm while one of its members, a rugged man with sinfully dark eyes, did nothing to help her. Now when she\u0027s freed and desperate to put it all behind her, the unthinkable happens. The Swarm is targeting Lana once again and the man who stood silently by has become her protector. But can she trust him? NO ESCAPE. Delta Force operative Caleb Stone will never forget the hatred shining in Lana\u0027s eyes. Ordered to take down the Swarm by infiltrating its ranks, Caleb couldn\u0027t blow his cover to save her--no matter how much it haunted him. Now, gifted with a second chance, he vows to move heaven and earth to protect her...and fulfill her every desire. But the Swarm has reorganized. It\u0027s more powerful than ever and hell-bent on revenge...NO CONTROL.\n \n","cover":"https://allnovel.net/images/no-control-delta-force-2.jpg","author":"Shannon K. Butcher","type":"Mystery","source":"allnovel","link":"https://allnovel.net/no-control-delta-force-2.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:16:10 AM"}}
