{"id":70454,"no":46,"title":"Page 46","content":"“Lana?”\n “Yeah, that’s it. Lana. Please let me go. You’re breaking my neck.”\n Caleb only wished. He loosened the pressure just a bit. “Did you break into Lana’s office?”\n “Yeah.”\n “You shot her coworker.” It wasn’t a question. Caleb knew the man had.\n “I didn’t mean to.” Dennis started crying, his voice ramping up to a high-pitched whine. “It was an accident. The gun just went off, and then there was al this blood . . .”\n Caleb let go of the man’s hair, shoving his face toward the mattress in disgust. He took some plastic flex-cuffs from Grant and bound Dennis’s wrists behind him, then did the same with the man’s ankles.\n “Cal Hart,” he told Grant. “Tel him we’ve found Stacie’s shooter, and have him hurry the hel up. I want to get back to Lana.”\n CHAPTER THIRTY-TWO\n It took only a few minutes for Detective Hart to arrive. Trailing behind him were half a dozen cops who immediately began to secure the scene, though they were carefuly staying away from Nelson’s private property until the search warrant arrived.\n Caleb sat Dennis at the curb so Hart would be free to arrest him without stepping foot on his property. He didn’t want anything messing up this arrest.\n “You sure this is the guy who shot Stacie?” asked Hart, his hazel eyes sharp as he looked at the man.\n “He confessed,” said Caleb. “The gun is in the top drawer of his dresser, so you can do the balistics match. Arrest him or detain him or whatever you’re going to do, but I need to get back to Lana.”\n “I want protection,” pleaded Dennis.\n “Does that mean you admit to shooting Stacie Cramer?” asked Hart in an even voice.\n “Yes. Just get me the hel out of here. My boss is probably watching right now.”\n Hart gave Caleb a questioning look. “Is he sane?”\n “Far as I know. I suggest you do as he says and get him somewhere less out in the open. He may have more information about the bombing attempt at the youth center.”\n Hart read Dennis his rights and hustled Dennis to the nearest patrol car. “Thanks. Lana and Stacie wil be thriled to know we found the guy.”\n “You’l find his prints al over the bomb, but I don’t think he’s the one who built it.”\n Hart helped Dennis ease into the backseat without hitting his head. “On the way here, I had his record checked. He was photographed running several red lights last night.\n Al on the street leading away from the youth center.”\n “My boss said I had to hurry or my money would be gone,” wailed Dennis.\n Caleb waited until Hart shut the car door and lowered his voice so it couldn’t be heard inside the patrol car. “He’s being set up for the bombing. I think the real bomber is already in custody.”\n Hart gave Caleb a skeptical frown. “How the hel do you know al that?”\n “Just putting two and two together. Finaly came up with four, though it took long enough. How’s Lana holding up?”\n Hart shrugged. “She took off as soon as she knew you were safe. I made sure she got out of the danger zone. Told her to go home and get some rest.”\n “Thanks.”\n Caleb’s phone vibrated. When he answered it, Monroe was on the other end. Without preamble, he said, “Kara escaped.”\n “What?” belowed Caleb.\n Lana was alone. Unprotected. Caleb felt his skin ice over with fear.\n “We were transporting her to a more secure location. Her transport was attacked. Two guards were kiled. Three more injured.”\n “Where and when did this happen?” Caleb was already heading for the car.\n “She took one of the guard’s cars. The authorities are looking for it, but most of them are stil at the First Light Foundation. Kara’s had plenty of time to make it back to town, and she’l want to eliminate her as a witness, so don’t let her out of your sight.”\n “Too late for that,” said Caleb as he hung up the phone.\n Caleb tried not to panic, but it was a close thing. Lana was alone, and Kara was free to hurt her.\n “Everything okay?” asked Grant, hot on his heels as Caleb reached the car.\n “No. Kara escaped. She’s going after Lana.”\n “Let me drive,” offered Grant. “I’ve got gear in the trunk.”\n By “gear” he meant weapons. Knowing Grant, lots of them.\n Caleb dialed Lana’s house and got her voice mail.\n He prayed to God she’d stopped for groceries or got caught in traffic or something—anything—to keep her from getting home before he did.\n Lana unlocked her apartment door and went inside. It took her eyes a second to adjust from the brightness outside, and when they did, she saw Phil slumped on her couch with a ragged bulet hole in his temple. Blood and pulpy chunks of brain were splattered across the framed sketches of Lana’s family.\n Her mind ground to a halt as she tried to make sense of what she saw. Lana turned her head toward a blinking light that caught her attention. A smal video camera sat on a tripod, angled so that it could capture the smal living area. A red light flashed on and off, indicating it was recording.\n Kara leveled a gun at Lana and gave her a cold smile. “I think this has gone on long enough, don’t you?”\n CHAPTER THIRTY-THREE\n Marcus knew exactly where to find Kara. She was nothing if not doggedly determined to finish what she started.\n It took a bit of time to find Lana Hancock’s address. The woman protected her privacy and had an unlisted number. His wel-paid computer genius hacked into her medical records and solved the problem with only a short delay.\n Marcus abandoned the car he’d used while disrupting Kara’s transportation, just in case one of the guards lived long enough to ID it. He was now behind the wheel of a distressingly average four-door sedan, blending in with al the others.\n His face was nothing special, and even though he kept his body in peak physical shape, his specialy tailored clothing helped conceal both his size and build. He could hide in plain sight. No one would look twice at him. No one would suspect he was a man headed to murder two women and anyone else who got in his way.\n Fear made Lana clumsy. Slow. She reached behind her for the door, but Kara stopped her.\n “Oh, no you don’t. No more running. This is where you and I finish things.”\n “You’re going to kil me.” Her heart was pounding so hard she was sure Kara could hear it.\n “Of course. That’s the way it has to be. You should be happy.”\n “Happy?” She wished she had a cel phone. Maybe she would have been able to cal 911 or Caleb.\n “You’ve had a year and a half longer than you were meant to have. That’s got to count for something.”\n Lana’s eyes darted around, looking for a weapon. Al she found nearby were bits of wood that had once been a chair—the one Caleb crushed when he forced his way in.\n She was going to miss him so much.\n “I promise not to tel anyone who you are. Just leave. Disappear.”\n Kara laughed. It was a rich, elegant sound that made Lana’s skin crawl. She steadied the gun with her left hand. “It’s too late for that.”\n “Just tel me why,” pleaded Lana, staling. She needed more time to figure out what to do. How to get out of this. She didn’t want to die.\n “Why what?”\n “Why me? Why did you want to kil me in Armenia?”\n Kara frowned as if truly puzzled. “What makes you think I need a reason to kil?”\n “Because you like to watch people’s torment too much to end it without a reason. If they’re dead, you can’t enjoy their suffering.”\n “You make me sound like some sort of lunatic. Torture is an art. Do you think that any of your friends would have suffered nearly as much if they hadn’t known they were going to die? Hadn’t had proof?”\n “So, each death was only for the purpose of making the next person more afraid?”\n “And to isolate them.” Kara cocked her head to the side and dropped her voice as if trying to seduce a lover. “Tel me, how did it feel to be the last one alive? To know you were al alone? In the dark. No one was coming to save you. No one was there to hear you cry. You were the last. Destined to suffer and die al alone.”\n Lana found herself speeding back to that place against her wil. She could smel the stench of decaying bodies, feel the rough cloth over her face.\n Black, suffocating terror sweled up inside her, spiling out until she could feel it crawling along her skin, inching up her nose, leaking into her mouth.\n Kara let out a low, pleased moan. “Yes. That’s right. You were the best work I’ve ever done.”\n Lana’s body tensed up. She struggled to pul herself back to the here and now.\n “Sometimes,” said Kara, “I think there wil never be another like you. So helpless in your fear. So consumed by it. Maybe it’s genetic. Maybe your sister has the same trait.”\n “Jenny.” The word slipped out in a nearly desperate plea.\n Kara shuddered in pleasure.\n “And she has a son. A husband. So many people to lose. So much pain to bear.”\n No! Lana couldn’t let that happen. She couldn’t let her family endure the torture she had. She loved them too much not to fight. This evil had to end, and Lana was the only one here to do it. That thought gave her the strength to crawl back to reality, shrug off the terror of her past, and face Kara without fear for the first time.\n She was just a woman. Sure, she was a woman holding a gun, and Lana stil hadn’t found a weapon, but she couldn’t let that stop her.\n It was going to end here. Now. She had not fought her way back from the grave and lived a life of fear and torment, struggling to survive, just so she could die now. As long as she was alive, there was a chance she could keep her family, Stacie, and Caleb safe. As long as she was alive, there was hope.\n Kara had tried to steal her life in Armenia. She’d tried to ruin it by moving here to torment Lana. It was not going to end like this. She was not going to end up like Phil, lying on the couch with a bulet in her head. She was not.\n Lana lashed out using one of the brutal moves Caleb and Grant had taught her. It was no graceful motion of limbs like some accomplished martial artist—it was violent and ugly and effective. She went for Kara’s eyes, sweeping the gun out of her way as she moved inside her reach.\n Kara didn’t expect her fearless attack, and she was thrown back on the floor. Lana came down hard on top of her and pressed a forearm against Kara’s neck, bearing down with al her weight and fury. Kara gurgled and slammed the gun into the side of Lana’s head.\n Bright spots flared in Lana’s sight, but she didn’t stop fighting. Adrenaline made her stronger, faster. Eighteen months of anger made her ferocious. She screamed as she pummeled Kara’s face with her fist, stil choking off her air.\n Kara’s body heaved in a desperate attempt to dislodge her, and Lana was roled to the side, her back slamming hard into the bookcase. Air rushed from her lungs, and she couldn’t pul any back in, but she didn’t care. Her rage was burning too bright to be put out by something so seemingly trivial as oxygen. She tried to push to her feet but only made it to her knees. Her hand found something heavy and hard on one of the lower shelves, and she bashed it against Kara’s head. \n","sourceLink":"https://allnovel.net/no-control-delta-force-2/page-46.html","bookId":2375,"book":{"id":2375,"title":"No Control (Delta Force #2)","description":"Storyline: \n No Control (Delta Force #2) \n NO HIDING. Lana Hancock knows all about danger--and betrayal. Eighteen months ago, she was captured by a terrorist group known as the Swarm while one of its members, a rugged man with sinfully dark eyes, did nothing to help her. Now when she\u0027s freed and desperate to put it all behind her, the unthinkable happens. The Swarm is targeting Lana once again and the man who stood silently by has become her protector. But can she trust him? NO ESCAPE. Delta Force operative Caleb Stone will never forget the hatred shining in Lana\u0027s eyes. Ordered to take down the Swarm by infiltrating its ranks, Caleb couldn\u0027t blow his cover to save her--no matter how much it haunted him. Now, gifted with a second chance, he vows to move heaven and earth to protect her...and fulfill her every desire. But the Swarm has reorganized. It\u0027s more powerful than ever and hell-bent on revenge...NO CONTROL.\n \n","cover":"https://allnovel.net/images/no-control-delta-force-2.jpg","author":"Shannon K. Butcher","type":"Mystery","source":"allnovel","link":"https://allnovel.net/no-control-delta-force-2.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:16:10 AM"}}
