{"id":10944,"no":6,"title":"CHAPTER VI. GRIT\u0027S RECOMPENSE.","content":"No time was lost in arraying Willie in clothes more suitable for him. The little boy was glad to lay aside Grit\u0027s old suit, which certainly was not very becoming to him. \"Are we going now, papa?\" asked the little boy. \"Yes, Willie; but first I must express to this good lady my great thanks for her kindness.\" \"I have done but little, sir,\" said Mrs. Brandon; \"but that little I was very glad to do.\" \"I am sure of that,\" said the visitor cordially. \"If you remain in the neighborhood, I shall hope to see your little boy again, and yourself, also.\" \"I will come,\" said Willie promptly. \"He answers for himself,\" said his father, smiling, \"and he will keep his promise. Now,[Pg 42] Grit,\" he said, turning to the young boatman, \"I will ask you to accompany me to the hotel.\" \"Certainly, sir.\" When they had passed from the cottage, Mr. Jackson turned to the boy and grasped his hand. \"I have not yet expressed to you my obligations,\" he said, with emotion, \"for the great service you have done me—the greatest in the power of any man, or boy.\" \"Don\u0027t speak of it, sir,\" said Grit modestly. \"But I must. You have saved the life of my darling boy.\" \"I don\u0027t know, sir.\" \"But I do. I cannot swim a stroke, and but for your prompt bravery, he would have drowned before my eyes.\" Grit could not well contradict this statement, for it was incontestably true. \"It was lucky I could swim,\" he answered. \"Yes, it was. It seems providential that I should have had with me so brave a boy, when Willie\u0027s life was in peril. It will be something that you will remember with satisfaction to the end of your own life.\" \"Yes, sir, there is no doubt of that,\" answered Grit sincerely. [Pg 43] \"I shudder to think what a sad blank my own life would have been if I had lost my dear boy. He is my only child, and for this reason I should have missed him the more. Your brave act is one that I cannot fitly reward——\" \"I don\u0027t need any reward, Mr. Jackson,\" said Grit hastily. \"I am sure you do not. You do not look like a mercenary boy. But, for all that, I owe it to myself to see that so great a favor does not go unacknowledged. My brave boy, accept this wallet and what it contains, not as the payment of a debt, but as the first in the series of my acknowledgments to you.\" As he spoke, he put into the hand of the young boatman a wallet. \"I am very much obliged to you, Mr. Jackson,\" said Grit, \"but I am not sure that I ought to take this.\" \"Then let me decide for you,\" said the broker, smiling. \"I am older, and may be presumed to have more judgment.\" \"It will seem as if I took pay for saving Willie from drowning.\" \"If you did, it would be perfectly proper.[Pg 44] But you forget that I have had the use of your boat and your own services for the greater part of the afternoon.\" \"I presume you have paid me more than I ask for such services.\" \"Very likely,\" answered Mr. Jackson. \"In fact, outside of my obligations to you, I have formed a good opinion of a boy who works hard and faithfully to support his mother. I was a poor boy once, and I have not forgotten how to sympathize with those who are beginning the conflict with narrow means. Mind, Grit, I don\u0027t condole with you. You have good health and strong hands, and in our favored country there is no reason why, when you reach my age, you may not be equally well off.\" \"I wish I might—for mother\u0027s sake,\" said Grit, his face lighting up with hope. \"I shall see more of you while I am here, but I may as well say now that I mean to bear you in mind, and wish you to come to me, either here or in the city, when you stand in need of advice or assistance.\" Grit expressed his gratitude. Mr. Jackson selected a room at the hotel, and promised to[Pg 45] take up his quarters there the next day. Then Grit once more took up his oars and ferried Willie and his father across the river. It was not for some time, therefore, that he had a chance to examine the wallet which had been given him.","sourceLink":"http://novel.tingroom.com/ertong/2972/81848.html","bookId":372,"book":{"id":372,"title":"Grit or The Young Boatman of Pine Point","description":"简介： The speaker was a sturdy, thick-set boy of fifteen, rather short for his age, but strongly made. His eyes were clear and bright, his expression was pleasant, and his face attractive, but even a superficial observer could read in it unusual firmness a...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/2972","creation":"Aug 1, 2019 12:18:40 AM","modification":"Aug 1, 2019 12:18:40 AM"}}
