{"id":7747,"no":4,"title":"THE BANNER MINES","content":"Charlie Rayson was the man who first suggested the holding of special services at the \"Banner.\" \"Oh! boys, but it\u0027s a hard spot. I mind when Old Ken hit the trail to get a job there. Somebody brought word they was paying six bits an hour for rough carpentering, and next morning Ken took over the mountain with his pack. He never stopped even long enough to get on a spree. In about a week he was back at the old spot. That night he was in the bar-room telling the boys about his trip. I mind he told \u0027em they could judge what it was like when he was \u0027the only gentleman in the place.\u0027\" Those who knew Ken needed no further report of conditions at the Banner Mines. When the District Superintendent heard that the men were planning to go to the \"Banner,\" he wrote to tell them not to be too much discouraged if it took a week\u0027s hard work to get half a dozen hearers. \"The spot is known to many as the \u0027hell-hole of the Province,\u0027 and the Church does not begin to figure in importance with the corner grocery, but with two special workers and the amount of earnest prayer that is everywhere being offered. I am hopeful that the heartrending indifference may be overcome.\" And so on a certain Monday morning the missioners made their way to the Junction, and then took the dirty work-train up the gulch to the camp. In a community where men have for years read anti-church, anti-religious literature, and where \"parasite\" is hissed under the breath every time a minister of the Gospel is seen, it could scarcely be expected that anything approaching a welcome would be given the new-comers. Inside of an hour the work of getting acquainted was commenced. On the trail, along the railway track, at the tipple, at the entrance to the mines, in the washroom, wherever men could be met, the missioners sought to enter into conversation with the miners. Some answered civilly, a few were almost cordial, many were surly, and many others either absolutely indifferent and silent, or openly antagonistic. Dave Clements, a disabled miner, who looked after the wash-room, expressed himself thus: \"Religion ain\u0027t no good here; most of the mine-owners is supposed to hev got it, and so the rest of us don\u0027t want it. Look at the houses what they make us live in—my missus has been sick most all winter—jest frozen, that\u0027s why! We pays eighteen dollars a month for the —— places. The company owns everything around here: land, houses, stores, train—even the air belongs to \u0027em, \u0027cause it\u0027s full of their coal-dust. We has to pay about three times the proper price for things; but, then, that\u0027s what helps \u0027em to be religious; that\u0027s what gives \u0027em the front seats in the synagogue, you bet; we fellers sweat to buy church organs and plush cushions, and then the parasite parsons pat the mine-owners on the pate and give thanks for such generous brethren. If anybody needs revivalling, stranger, it\u0027s that gang of hypocrites back yonder what makes us poor devils raise the wind to blow their glory trumpets.\" Yet even Dave was compelled to say of Him whom the missioners sought to exalt, \"I find no fault in this man.\" In response to an invitation to attend an evening service one miner replied: \"Meeting, eh? Any booze going? No? Any dance after? Something better than that? Gee! it must be swell!\" Then the tone was contemptuous: \"No, siree; you couldn\u0027t get me into a religious meeting with a couple of C.P.R. engines.\" Yet the daily conversations and invitations were not all in vain, for when there is a real concern on the part of Christians for non-Christians, that concern is likely to be imparted to those whom they seek to win. Moses Evans, a Welsh miner, listened somewhat impatiently to the missioner\u0027s words, as he stood leaning against a telephone pole. Then with apparent weariness he answered, \"Look here, young fellow, there ain\u0027t a —— man in this country can live a Christian life in this camp. I\u0027ve tried it; you ain\u0027t. I know; you don\u0027t. I used to be a Christian in Wales—leastwise, I think I was—but you can\u0027t be here.\" The interview ended, however, with a promise on Moses\u0027 part to be present on the following night. Three nights later he knelt, at the close of the service, behind the old piano, and brokenly asked God to make him \"different again.\" \"Forgive my sins,\" he continued, \"and help me like You did in Wales.\" Near the end of the week the missioners planned to hold an open-air service a mile and a half down the gulch, at a spot called \"Spanish Camp,\" where nearly two hundred miners lived. It was hoped that by arranging the meeting between \"shifts\" a number might hear the Gospel message, who had not previously been reached. Every tent and shack was visited twice preceding the meeting, and hand-printed signs were posted wherever likely to arrest attention. At the time for the meeting to commence there were five children and eight dogs present. It was not a \"dignified\" course to pursue, and probably merited the disapproval of the \"church fathers,\" but one of the missioners, yearning to get a hearing for his message, got possession of a large tin can from a nearby rubbish heap, and with the aid of a club succeeded in getting considerable noise from its emptiness. The people may have appreciated his advertising ability, or it may be they preferred to hear the Gospel rather than the noise that was coming from the tin can; but, at any rate, in a few minutes a circle of thirty or forty gathered around the speakers. A few minutes after the meeting had commenced the limping figure of Moses Evans might have been seen on the mountain-side near No. 3 Mine. Hurrying down the trail he crossed the rustic bridge over the little mountain stream, and came to where the crowd had gathered. Without any hesitation he pushed through the circle and stood in the centre. Reverently removing his miner\u0027s cap, he said, \"I\u0027d like to pray.\" A few faces expressed a sneer, but Moses clasped his hands and uttered his petition, which was written down immediately thereafter. \"Oh, God, you know as how the devil has been at me all day, saying as I dasn\u0027t stand out in the public air and confess Thee. You know, oh, my God! that I want to be a good man again. You know I can\u0027t read nor write in English, but You\u0027ve put words in my mouth; put them into my heart, and keep it clean, for Jesus\u0027 sake. Amen.\" Moses Evans and other men, who with him made open confession of Jesus Christ, were again and again spat upon and cursed, as they passed along the \"entry\" at their daily toil in the mine. \"But it\u0027s a great thing,\" wrote the school-teacher, \"that these men can be by tongue damned higher and damned lower than anything else in this world, and yet stand firm. Increase the number of such men, and you have a leaven of righteousness that will eventually permeate this whole mining community. This is our only hope of rescue from the mire of sensuality and vice into which many of our miners have sunk. Moses says to please tell you that the words of the hymn you used to sing are true in his own experience:— \u0027Through days of toil, when heart doth fail God will take care of you; When dangers fierce your path assail, God will take care of you.\u0027\" \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/ertong/3025/83664.html","bookId":257,"book":{"id":257,"title":"Trail-Tales of Western Canada","description":"简介： Old Ken was down on his luck. For well-nigh fifty years he had gone the pace in a district where certain men say glibly, there\u0027s no God west of the Rockies. The old prospector had been, according to those who knew him best, in one of three conditions...","cover":"https://cunovel.com/defaultCover.png","type":"Children\u0027s","link":"http://novel.tingroom.com/ertong/3025","creation":"Aug 1, 2019 12:18:28 AM","modification":"Aug 1, 2019 12:18:28 AM"}}
