{"id":72024,"no":1,"title":"Page 1","content":"YOU GET WHAT YOU DESERVE\\n\\n Have you ever gotten away with something really, really bad? Like when you hooked up with that cute guy you work with at the bagel shop . . . and never told your boyfriend. Or when you stole that patterned scarf from your favorite boutique . . . and the security alarms didn’t go off. Or when you created an anonymous Twitter profile and posted a vicious rumor about your BFF . . . and said nothing when she blamed it on the bitchy girl who sat in front of her in Algebra III.\\n\\n At first, not getting caught might have felt amazing. But as time went by, maybe you felt a slow, sick roll in the pit of your stomach. Had you really done that? What if anyone ever found out? Sometimes the anticipation is worse than the punishment itself, and the guilt can eat you alive.\\n\\n You’ve probably heard the phrase She got away with murder a thousand times and thought nothing of it, but four pretty girls in Rosewood actually did get away with murder. And that’s not even all they’ve done. Their dangerous secrets are slowly eating them from the inside out. And now, someone knows everything.\\n\\n Karma’s a bitch. Especially in Rosewood, where secrets never stay buried for long.\\n\\n Even though it was almost 10:30 P.M. on July 31 in Rosewood, Pennsylvania, a wealthy, bucolic suburb twenty miles outside Philadelphia, the air was still muggy, oppressively hot, and full of mosquitoes. The flawlessly manicured lawns had turned a dry, dull brown, the flowers in the beds had withered, and many of the leaves on the trees had shriveled up and fallen to the ground. Residents swam languidly in their lime-rocked pools, gobbled up homemade peach ice cream from the open-till-midnight local organic farmstand, or retreated indoors to lie in front of their air conditioners and pretend it was February. It was one of the few times all year the town didn’t look like a picture-perfect postcard.\\n\\n Aria Montgomery sat on her back porch, slowly dragging an ice cube across the back of her neck and contemplating going to bed. Her mother, Ella, was next to her, balancing a glass of white wine between her knees. “Aren’t you thrilled about going back to Iceland in a few days?” Ella asked.\\n\\n Aria tried to muster up enthusiasm, but deep down, she felt a niggling sense of unrest. She adored Iceland—she’d lived there from eighth to eleventh grade—but she was returning with her boyfriend, Noel Kahn, her brother, Mike, and her old friend Hanna Marin. The last time Aria had traveled with all of them—and her two close friends Spencer Hastings and Emily Fields—was when they’d gone to Jamaica on spring break. Something awful had happened there. Something Aria would never be able to forget.\\n\\n At the very same time, Hanna Marin was in her bedroom packing for the trip to Iceland. Was a country full of weird, pale Vikings who were all related to one another worthy of her Elizabeth and James high-heeled booties? She threw in a pair of Toms slip-ons instead; as they landed in the bottom of the suitcase, a sharp scent of coconut sunscreen wafted out from the lining, conjuring up images of a sun-drenched beach, rocky cliffs, and a cerulean Jamaican sea. Just like Aria, Hanna was also transported back to the fateful spring break trip she’d taken with her old best friends. Don’t think about it, a voice inside her urged. Don’t ever think about it again.\\n\\n The heat in Center City Philadelphia was no less punishing. The dormitories on the Temple University campus were shoddily air-conditioned, and summer students propped up box fans in their dorm windows and submerged themselves in the fountain in the middle of the quad, even though there was a rumor that drunken junior and senior boys peed in it regularly.\\n\\n Emily Fields unlocked her sister’s dorm room, where she was hiding out for the summer. She dropped her keys in the STANFORD SWIMMING mug on the counter and stripped off a sweaty, fried-food-smelling T-shirt, rumpled black pants, and a pirate’s hat she’d worn to her waitress job at Poseidon’s, a gimmicky seafood restaurant on Penn’s Landing. All Emily wanted to do was to lie on her sister’s bed and take a few long, deep breaths, but the lock turned in the door almost as soon as she’d shut it. Carolyn swept into the room, her arms full of textbooks. Even though there was no hiding her pregnancy anymore, Emily covered her bare stomach with her T-shirt. Carolyn’s gaze automatically went to it anyway. A disgusted look settled over her features, and Emily turned away in shame.\\n\\n A half mile away, near the University of Pennsylvania campus, Spencer Hastings staggered into a small room in the local police precinct. A thin trickle of sweat dripped down her spine. When she ran her hand through her dirty-blond hair, she felt greasy, snarled strands. She caught a glimpse of her reflection in the window in the door, and a gaunt girl with hollowed-out, lusterless eyes and a turned-down mouth stared back. She looked like a dirty corpse. When had she last showered?\\n\\n A tall, sandy-haired cop entered the room behind Spencer, pulled the door closed, and glared at her menacingly. “You’re in Penn’s summer program, aren’t you?”\\n\\n Spencer nodded. She was afraid if she spoke, she’d burst into tears.\\n\\n The cop pulled an unmarked bottle of pills from his pocket and shook it in Spencer’s face. “I’m going to ask you one more time. Is this yours?”\\n\\n The bottle blurred before Spencer’s eyes. As the cop leaned close, she caught a whiff of Polo cologne. It made her think, suddenly, about how her old best friend Alison DiLaurentis’s brother, Jason, went through a Polo phase when he was in high school, drenching himself in the stuff before he went to parties. “Ugh, I’ve been Polo’d,” Ali would always groan when Jason passed by, and Spencer and her old best friends Aria, Hanna, and Emily would burst into giggles.\\n\\n “You think this is funny?” the cop growled now. “Because I assure you, you are not going to be laughing when we’re done with you.”\\n\\n Spencer pressed her lips together, realizing she’d been smirking. “I’m sorry,” she whispered. How could she think about her dead friend Ali—aka Courtney, Ali’s secret twin—at a time like this? Next she’d be thinking about the real Alison DiLaurentis, a girl Spencer had never been friends with, a girl who’d returned to Rosewood from a mental hospital and murdered her own twin sister, Ian Thomas, Jenna Cavanaugh, and almost Spencer, too.\\n\\n Surely these scattered thoughts were a side effect of the pill she’d swallowed an hour before. It was just kicking in, and her mind was speeding at a million miles a minute. Her eyes darted all over the place, and her hands twitched. You got the Easy A shakes! her friend Kelsey would say, if she and Spencer were in Kelsey’s dorm room at Penn instead of locked in two separate interrogation cells in this dingy station. And Spencer would laugh, swat Kelsey with her notebook, and then return to cramming nine months’ worth of AP Chemistry III information into her already jam-packed head.\\n\\n When it was clear Spencer wasn’t going to own up to the pills, the cop sighed and slipped the bottle back into his pocket. “Just so you know, your friend’s been talking up a storm,” he said, his voice hard. “She says it was all your idea—that she was just along for the ride.”\\n\\n Spencer gasped. “She said what?”\\n\\n A knock sounded on the door. “Stay here,” he growled. “I’ll be back.”\\n\\n He exited the cell. Spencer looked around the tiny room. The cinder-block walls had been painted puke-green. Suspicious yellowish-brown stains marred the beige carpet, and the overhead lights gave off a high-pitched hum that made her teeth hurt. Footsteps sounded outside the door, and she sat very still, listening. Was the cop taking Kelsey’s statement right now? And what exactly was Kelsey saying about Spencer? It wasn’t like they’d rehearsed what they’d say if they got caught. They never thought they would get caught. That police car had come out of nowhere. . . .\\n\\n Spencer shut her eyes, thinking about what had happened in the last hour. Picking up the pills from South Philly. Peeling out of that scary neighborhood. Hearing the sirens scream behind them. She dreaded what the next hours would bring. The calls to her parents. The disappointed looks and quiet tears. Rosewood Day would probably expel her, and Spencer would have to finish high school at Rosewood Public. Or else she’d go to juvie. After that, it would be a one-way trip to community college—or worse, working as a hoagie-maker at the local Wawa or as a sandwich board–wearer at the Rosewood Federal Credit Union, advertising the new mortgage rates to all the drivers on Lancaster Avenue.\\n\\n Spencer touched the laminated ID card for the University of Pennsylvania Summer Program in her pocket. She thought of the graded papers and tests she’d received this week, the bright 98s and 100s at the top of each and every one. Things were going so well. She just needed to get through the rest of this summer program, ace the four APs she was taking, and she’d be at the top of the Rosewood Day pyramid again. She deserved a reprieve after her horrible ordeal with Real Ali. How much torment and bad luck did one girl have to endure?\\n\\n Feeling for her iPhone in the pocket of her denim shorts, she pressed the PHONE button and dialed Aria’s number. It rang once, twice . . .\\n\\n Aria’s own iPhone bleated in the peaceful Rosewood darkness. When she saw Spencer’s name on the Caller ID, she flinched. “Hey,” she answered cautiously. Aria hadn’t heard from Spencer in a while, not since their fight at Noel Kahn’s party.\\n\\n “Aria.” Spencer’s voice was tremulous, like a violin string stretched taut. “I need your help. I’m in trouble. It’s serious.”\\n\\n Aria quickly slipped through the sliding glass door and padded up to her bedroom. “What happened? Are you okay?”\\n\\n Spencer swallowed hard. “It’s me and Kelsey. We got caught.”\\n\\n Aria paused on the stairs. “Because of the pills?”\\n\\n Spencer whimpered.\\n\\n Aria didn’t say anything. I warned you, she thought. And you lashed out at me.\\n\\n Spencer sighed, sensing the reason for Aria’s silence. “Look, I’m sorry for what I said to you at Noel’s party, okay? I . . . I wasn’t in my right mind, and I didn’t mean it.” She glanced at the window in the door again. “But this is serious, Aria. My whole future could be ruined. My whole life.”\\n\\n Aria pinched the skin between her eyes. “There’s nothing I can do. I’m not messing with the police—especially not after Jamaica. I’m sorry. I can’t help.” With a heavy heart, she hung up.\\n\\n “Aria!” Spencer cried into the receiver, but the CALL ENDED message was already flashing.\\n\\n Unbelievable. How could Aria do this to her, after all they’d been through?\\n\\n Someone coughed outside Spencer’s holding room. Spencer turned to her phone again and quickly dialed Emily’s number. She pressed her ear to the receiver, listening to the brrt-brrt-brrt of the ringing line. “Pick up, pick up,” she pleaded.\\n\\n The lights in Carolyn’s room were already off when Emily’s phone started to beep. Emily glanced at Spencer’s name on the screen and felt a wave of dread. Spencer probably wanted to invite her to a get-together at Penn. Emily always said she was too tired, but really it was because she hadn’t told Spencer or any of her other friends that she was pregnant. The idea of explaining it to them terrified her. \\n\\n","sourceLink":"https://allnovel.net/ruthless-pretty-little-liars-10/page-1.html","bookId":2386,"book":{"id":2386,"title":"Ruthless (Pretty Little Liars #10)","description":"Storyline: Ruthless (Pretty Little Liars #10) \\n For years scandal has rocked Rosewood, Pennsylvania—and high school seniors Aria, Emily, Hanna, and Spencer have always been at the center of the drama. They’ve lost friends, been targeted by a ruthless stalker named A, and narrowly escaped death. And it’s not over yet. \\n Aria’s love life is on the fritz. Emily’s exploring her wild side. Hanna’s kissing the enemy. And someone from Spencer’s past—someone she never thought she’d see again—is back to haunt her. \\n But none of that compares to what happened last spring break. It’s their darkest secret yet and guess who found out? Now A is determined to make them pay for their crime, and the only thing scarier than A is the fear that maybe, just maybe, they deserve what’s coming to them.\\n","cover":"https://allnovel.net/images/ruthless-pretty-little-liars-10.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/ruthless-pretty-little-liars-10.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:22:08 AM"}}
