{"id":72045,"no":22,"title":"Page 22","content":"“Hi.” Ezra half rose, extended his hand, and gave Klaudia a much kindlier smile than Aria would have liked. “I’m Ezra Fitz.”\\n\\n “I Klaudia Huusko. Exchange student from Finland.” Instead of shaking Ezra’s hand, Klaudia leaned down and kissed him on both cheeks, European-style. Then she knitted her brow. “Why I know you? Your name sound familiar.”\\n\\n “I was a teacher at Rosewood Day last year,” Ezra offered in a friendly voice.\\n\\n “No, that not it.” Klaudia shook her head, making her ponytail wobble. She squinted. “You not Ezra Fitz who writes the poetry, are you?”\\n\\n Ezra looked startled. “Well, I’ve only published one poem—in a foreign journal.”\\n\\n “Was it called ‘B-26’?” Klaudia’s eyes brightened.\\n\\n “Well, yeah.” Ezra’s smile grew broader and more skeptical. “You’ve . . . read that?”\\n\\n “Se tytto, se laulu!” Klaudia quoted in melodic Finnish. “Is beautiful! I have it pinned up on bedroom wall in Helsinki!”\\n\\n Ezra’s mouth hung open. He glanced at Aria in an amazed way as if to say, Can you believe it? I have a fan! Aria wanted to smack him upside the head. Didn’t he see that this was merely part of Klaudia’s sex kitten act? She’d never read his poetry—she’d probably seen his name on the manuscript at the library earlier today and Googled him!\\n\\n “I’ve read that poem, too,” Aria boasted, suddenly feeling competitive. “It was really beautiful.”\\n\\n “Oh, but it even prettier translated into Finnish,” Klaudia insisted.\\n\\n A barista approached and Klaudia moved closer to Ezra to let him pass. “I have always wanted to be a writer, so this is very exciting for me to talk to a real published poet! Have you written other beautiful poetries?”\\n\\n “I don’t know how beautiful they are,” Ezra said mock-bashfully, clearly enjoying being admired. “I’m working on a novel right now.” He pointed at the manuscript that now sat on the ottoman next to them.\\n\\n “Oof!” Klaudia pressed her hand to her ample chest. “A whole novel? Is amazing! I hope to read it someday!”\\n\\n “Well, actually, if you’re really interested . . .” He placed the novel in Klaudia’s hands. “I’d love to hear your thoughts.”\\n\\n “What?” Aria shrieked. “She can’t read it!”\\n\\n Klaudia’s eyes widened innocently. Ezra cocked his head, looking stricken. “Why not?” he asked, sounding hurt.\\n\\n “Because . . .” Aria trailed off, trying to communicate with her eyes that Klaudia was a psychopath. Because it’s my novel, not hers, she wanted to say, but she realized how petty and immature that sounded. Still, the novel was so personal. Aria didn’t want Klaudia reading it, knowing about the most important relationship of her life.\\n\\n Ezra waved his hand. “It’s a rough draft,” he said gently. “I need as many people giving me feedback as I can.” He turned to Klaudia and smiled. “Maybe you’ll like it as much as ‘B-26.’”\\n\\n “I’m sure I love it!” Klaudia cradled the manuscript in her hands. She backed away, giving Ezra a three-finger wave. “Okay, I go now! Sorry I bother you! See you in school tomorrow, Aria!”\\n\\n “You were no bother,” Ezra called, waving back. There was a slight, satisfied smile on his face, and his gaze followed Klaudia as she sashayed out of the café and through the bookstore. Aria reached for his hand again, but he squeezed only lightly and distractedly, like there were far more important things—or perhaps girls—on his mind.\\n\\n Chapter 20\\n\\n ALL LOVING FATHERS STICK THEIR DAUGHTERS IN TALL TOWERS\\n\\n Mr. Marin flung open the door to his house and greeted Hanna with a huge smile. “Come in, come in!”\\n\\n “Thanks.” Hanna dragged a Jack Spade duffel, stuffed with enough clothes for a three-night stay, over the threshold. Then she picked up the little doggie carrier that held Dot, her miniature Doberman, and hustled him inside, too. “Do you mind letting him out of there?”\\n\\n “No problem.” Mr. Marin bent over and unlocked the metal latch. The little dog, which Hanna had dressed in a Chanel-logo sweater, immediately scuttled out of the carrier and ran crazily around the living room, sniffing everything.\\n\\n “Uch,” a voice said. Isabel, whose salmon-colored twin set matched her orangey, fake-tanned skin, glared at Dot as though he were a sewer rat. “That thing doesn’t shed, does it?”\\n\\n “No, he doesn’t,” Hanna said in the most friendly voice she could muster. “Perhaps you remember Dot from when you stayed in my house?”\\n\\n “I suppose,” Isabel said absently. Isabel had been wary of Dot when she’d lived at Hanna’s when Ms. Marin went to Singapore on business, wrinkling her nose when he lifted his leg on the trees in the backyard, pretending to gag when Hanna spooned organic doggie food into his ceramic bowl, and always backing away from him like he was about to bite her. Hanna wished Dot would bite Isabel, but Dot loved everyone.\\n\\n “Well, we’re glad to have you,” Isabel went on in a tone Hanna wasn’t sure was sincere.\\n\\n “Glad to be here,” Hanna said, peeking at her father’s expression. He looked so happy that she was honoring his request to stay with them a couple nights a week. It seemed like impeccably bad timing, though, what with her new entanglement with Liam. What if Hanna yelled out his name in her sleep? What if her dad scrolled through her phone and found all their texts to one another, including the steamy ones Liam had sent today?\\n\\n “C’mon, I’ll show you your room.” Mr. Marin hefted Hanna’s bags and started up the curved staircase. The house had a fussy, Christmas-store smell about it—Hanna had forgotten how obsessed Isabel was with putting lavender sachets into the drawers and bowls of potpourri on every available surface.\\n\\n Her dad passed the second level, then started up the third. “The bedrooms are all the way up here?” Hanna asked nervously. When she was little, she’d had an irrational fear that their house was going to catch on fire and lobbied to have their bedrooms on the first floor for easy escape—not that her parents went for it. Maybe she had a sixth sense, even back then, that someday she’d be trapped in a burning building.\\n\\n “Ours are on the second floor, but the guest room is on the third.” Mr. Marin glanced over his shoulder and raised his eyebrows. “We call it the loft.” He opened a door at the end of the hall. “Here we are.”\\n\\n They entered a plain, white room with sloping ceilings and small, square windows. It felt like he was a father in a fairy tale, sticking Hanna in a tall tower, but the room did have a hotel-quality duvet on the queen bed, a huge bureau, an ample-sized closet, and a flat-screen TV mounted on the wall. And was that . . . a Juliet balcony? Hanna rushed across the room and opened the French doors. Sure enough, a tiny balcony protruded from the room, offering a view of the landscaped backyard. She’d always wanted one of those.\\n\\n “Is it okay?” Mr. Marin asked.\\n\\n “It’s great.” It was definitely private, anyway.\\n\\n “Glad you think so.” Mr. Marin dropped Hanna’s bags by the closet, patted Dot on the head, and turned on his heel toward the door. “Now, c’mon. We’re going to review the new campaign commercials. I’d love your input.”\\n\\n Hanna followed him back down the stairs. On the third riser from the bottom, she noticed a flicker out the window. It was pitch-black outside, not exactly prime time for a stroll around the neighborhood. Her thoughts flashed back to A’s latest note: Both of them die in Act V. Was that a threat?\\n\\n Her father led her into the family room, which contained a cognac-colored leather sectional, a matching leather ottoman/coffee table, and a large television against the wall tuned to CNN. Kate sat in the corner of one of the couches, her coltish legs tucked under her. Sitting next to her, his hand entwined in Kate’s, was none other than Sean Ackard.\\n\\n “Oh,” Hanna said, stopping short.\\n\\n Sean’s face paled, too. “Hanna. I didn’t know you’d be here.”\\n\\n Hanna looked at Kate, and Kate gave her a saccharine smile. It was clear she knew Hanna was coming . . . and that she had invited Sean to reemphasize that he was hers now.\\n\\n “Hey, Sean,” Hanna said coolly, throwing back her shoulders and sitting as far away from the happy couple as she could. What did she care if Kate and Sean were dating? She had an amazing boyfriend now, too, after all.\\n\\n Not that she could tell anyone about him.\\n\\n She peeked at Kate again. Her stepsister’s brow was furrowed as though she’d expected more of a reaction. She tilted her body toward Sean and nuzzled her chin into his neck. Sean flinched, looking uncomfortable. Hanna wished she could drop a hint about seeing them at the V Club meeting, but she didn’t dare.\\n\\n Suddenly, a familiar girl popped on the TV screen, and Hanna almost screamed. It was a photo of Tabitha. “Drinking during spring break: Should we crack down?” the anchor said. Hanna jumped up and pressed a button on the remote, and the TV went blank. Kate gave her a bizarre look.\\n\\n “I guess someone’s ready to see my commercials,” Mr. Marin joked. He pushed a DVD into the player, and his new campaign commercials popped onto the screen. Hanna sat back on the couch, trying to calm her nerves. Whenever she closed her eyes she saw an imprint of Tabitha’s picture in her mind.\\n\\n The first commercial was done with quick camera cuts, like an action film. The second one was done in mock-umentary style, like The Office. “I want everyone to give me their honest opinion,” Mr. Marin said. “Do you think young people will respond to these?”\\n\\n “They’re really fun and creative,” Kate said thoughtfully, leaning forward. “But I’m not sure kids really watch commercials. They usually DVR right through them.”\\n\\n “You could post them on YouTube, though,” Hanna said shakily, finding her voice.\\n\\n Mr. Marin looked stressed. “We should keep tweeting though, right? And should we stage more flash mobs? The one last week worked so well.”\\n\\n “It did, didn’t it, Hanna?” Kate simpered, glancing at Hanna pointedly. Hanna flinched. What did that look mean? Had Kate noticed that Hanna wasn’t there for most of the presentation? Had she seen the guy Hanna had run off with?\\n\\n “We could try Hollis this time.” Mr. Marin stopped the video. “Or maybe Bryn Mawr? Or we could go into the city, try Temple or Drexel.”\\n\\n Kate raked her hand through her long chestnut hair. “What does the competition think about the flash mobs?” Yet again, she stared straight at Hanna.\\n\\n Hanna’s skin prickled. “How should I know?”\\n\\n Kate shrugged. “I wasn’t asking you specifically.”\\n\\n Biting her lip, Hanna reviewed the various times she’d been with Liam. Had Kate seen them at the church after all? Did she know?\\n\\n Hanna stared at her. Kate stared back as if daring Hanna to blink. Sean tugged on his collar, his gaze ping-ponging between the girls. Mr. Marin shifted his weight, one eyebrow raised. “What’s going on, girls?” \\n\\n","sourceLink":"https://allnovel.net/ruthless-pretty-little-liars-10/page-22.html","bookId":2386,"book":{"id":2386,"title":"Ruthless (Pretty Little Liars #10)","description":"Storyline: Ruthless (Pretty Little Liars #10) \\n For years scandal has rocked Rosewood, Pennsylvania—and high school seniors Aria, Emily, Hanna, and Spencer have always been at the center of the drama. They’ve lost friends, been targeted by a ruthless stalker named A, and narrowly escaped death. And it’s not over yet. \\n Aria’s love life is on the fritz. Emily’s exploring her wild side. Hanna’s kissing the enemy. And someone from Spencer’s past—someone she never thought she’d see again—is back to haunt her. \\n But none of that compares to what happened last spring break. It’s their darkest secret yet and guess who found out? Now A is determined to make them pay for their crime, and the only thing scarier than A is the fear that maybe, just maybe, they deserve what’s coming to them.\\n","cover":"https://allnovel.net/images/ruthless-pretty-little-liars-10.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/ruthless-pretty-little-liars-10.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:22:08 AM"}}
