{"id":72051,"no":28,"title":"Page 28","content":"Chapter 26\\n\\n DIDN’T ARIA’S MOM TELL HER NO BOYS IN HER ROOM?\\n\\n On Friday afternoon, Ezra poked his head into Aria’s bedroom at Ella’s house and smiled. “Wow. It’s just how I pictured it.”\\n\\n “Really?” Aria said, thrilled that he’d bothered to picture her bedroom.\\n\\n A school bus rumbled at the corner, letting kids off. Ella was at the gallery, and Mike was at a lacrosse clinic, which meant Aria and Ezra had the place to themselves for the hour. Then Aria had to meet Klaudia to talk about the art history project. Now, Aria gazed around her bedroom, trying to see it through Ezra’s eyes. There were the old bookshelves Byron had found at a flea market, stuffed with books and magazines. A jumble of necklaces, makeup, perfume bottles, and hats sat atop an antique dressing table Ella had started refinishing before getting bored halfway through. On her bureau was her collection of stuffed animals, which she’d hastily gathered up from her bed this morning, when she had an inkling that Ezra might be coming this afternoon. Ezra didn’t have to know she still slept with Pigtunia, Mr. Knitted Cat, Mr. Knitted Goat, and Ms. Knitted Square-Thing-With-Noodly Arms, which Noel had won for Aria at a carnival last summer. In fact, Aria didn’t know why she still had Ms. Knitted Square Thing sitting out anymore. Noel might have been cute that day, throwing darts at the balloons until he got Aria exactly the toy she wanted, but she was sure Ezra would be even cuter at a carnival if given the opportunity.\\n\\n Ezra ran his fingers over a pleated lampshade she’d found at a vintage shop, smiled at the pen-and-ink self-portrait Aria had drawn in tenth grade, and gazed at the Canada geese in the pond out the window. “This is such a great little hideaway. Are you sure you want to leave it?”\\n\\n “You mean to go to New York?” Aria flopped down on the bed. “I have to leave sometime.”\\n\\n “But . . . so soon? Finishing up high school online? Have you talked to your parents about it?”\\n\\n Aria bristled, irritated that Ezra was bringing up her parents like she was a child. “They’ll understand. They lived in New York once, too, when they were young.” She tilted her head, sudden panic gripping her heart. “Why? Do you not want me to come back with you?” The run-in with Klaudia flashed through her mind. Though she’d promised herself not to bring up the fact that he had let Klaudia read his manuscript, she couldn’t help but still feel a jealous twinge.\\n\\n “Of course I want you to come.” Ezra squeezed her thigh. “It’s just . . . you’re not leaving for some other reason, are you? I saw Noel Kahn yesterday at the McDonald’s drive-thru. . . .”\\n\\n Aria laughed awkwardly. “This isn’t because of Noel.”\\n\\n What else could she say? Well, there’s a certain someone named A who knows about the most horrible thing I’ve ever done? And, oh yeah, A also wants to kill me? Emily had called last night and told her that A had pushed her down a steep hill at the Stockbridge trail. It scared the hell out of her. She needed to get out of town, away from psycho A, and enormous, anonymous New York seemed like a perfect hiding place.\\n\\n She took Ezra’s face in her hands. “I want to go because of you and only you. I’ve been looking at places in Brooklyn—we could get something amazing there. Maybe we could get a dog. Or a cat, if you’re more of a cat person. We could walk the cat around on a little leash.”\\n\\n “That sounds perfect,” Ezra murmured, brushing a piece of hair out of Aria’s eyes. “If you’re serious about this, I’ll start making arrangements, and we can leave in a couple of days.”\\n\\n Aria leaned forward to kiss him, and Ezra kissed her back. But when she opened her eyes for a moment, his were open, too. He was staring at something across the room.\\n\\n “Is that a first edition?” He sat back and pointed at a book on the bookshelf. The Sun Also Rises, it said in gold lettering on the spine. “It looks really old.”\\n\\n “Nah, my dad stole that from the Hollis library.” Aria rose, pulled the book out, and brought it to him. When he opened to the title page, a musty, old-book smell wafted out. “It’s one of my favorites, though.”\\n\\n Ezra poked her knee. “I thought my book was your favorite.”\\n\\n His tone was light and joking, but he looked serious. Was he really asking her to compare him to Hemingway? “Well, I mean, The Sun Also Rises was a literary masterpiece,” she blurted. “But yours was good, too. Really good.”\\n\\n Ezra pulled his hands away from hers and balled them in his lap. “Maybe it’s not.”\\n\\n Aria resisted a groan. Had he always had this insecure streak, or was his novel bringing it out in him? “Your book is awesome,” she said, kissing his nose. “Now come lie next to me.”\\n\\n Ezra reluctantly flopped onto Aria’s pillow. She began to stroke his hair. Seconds later, the door slammed downstairs. “Aria?” Ella’s voice called out.\\n\\n Aria shot up, her heart in her throat. “Shit.”\\n\\n “What?” Ezra sat up too.\\n\\n “It’s my mom. She wasn’t supposed to be back for hours.” Aria jumped up from the bed and pressed her feet into her shoes. She handed Ezra his wingtips. “We have to get out of here.”\\n\\n A corner of Ezra’s mouth drooped. “You don’t want to introduce me to her?”\\n\\n Downstairs, Ella’s heels clacked on the wood floor. Aria’s mind scattered in ten different directions. “I . . . I haven’t had time to prep her.” She stared at Ezra’s blank expression. “You were my teacher last year. My mom went to a parent-teacher conference with you. Don’t you think that’s a little awkward?”\\n\\n Ezra lifted a shoulder. “Not really.”\\n\\n Aria gawked at him, surprised. But there was no time to argue. “Come on,” she said, grabbing his hand and pulling him down the stairs just as Ella shut herself inside the powder room. She grabbed Ezra’s coat from the hall closet, thrust it at him, and shoved him out the door.\\n\\n Outside, the world smelled like sunbaked sidewalks and smoking chimneys. Aria walked down the stone path toward Ezra’s Volkswagen, which was parked at the curb. “We’ll talk about New York soon, okay?” she babbled. “I have a ton of cool apartments to show you.”\\n\\n “Aria, wait.”\\n\\n Aria turned. Ezra had stopped at the edge of the porch, his hands in his pockets. “Are you embarrassed to be seen with me?”\\n\\n “Of course not.” Aria took a few steps toward him. “But I’m not ready to explain to my mom what’s going on right now. I’d rather do it alone, when I can compose my thoughts.”\\n\\n Ezra stared at her for a few beats more, his eyes dark, then nodded. “Okay. I’ll see you tomorrow?”\\n\\n “Yeah. Or . . . wait.” Aria squeezed her eyes shut. “I have a school thing tomorrow.” It was the only performance of Macbeth, and Aria and Ella were going to watch Mike and then go to the cast party. There was no way Aria was bringing Ezra to something at Rosewood Day. “How about Sunday?”\\n\\n “Sunday it is.” Ezra kissed her cheek, climbed into his car, and drove off.\\n\\n Aria watched him go, hugging her arms to her chest. A shadow shifted to her left, and she turned. In the thick brush that separated her house from the neighbor’s, something moved. Aria caught a flash of blond hair. Footsteps slid across the wet leaves.\\n\\n “Hello?” she called.\\n\\n But the woods suddenly went still, the figure gone. Aria closed her eyes tight. The sooner she and Ezra got away from Rosewood, the better.\\n\\n An hour later, Aria strode into Bixby’s, a local coffee shop on the Hollis campus, and found Klaudia sitting at one of the back tables, dressed in a tight black sweater, an even tighter denim skirt, and black booties with heels. Her white-blond hair shone, her skin was porcelain-doll flawless, and every guy in the café was sneaking looks at her.\\n\\n “It take you long enough,” Klaudia said prissily when she noticed Aria, the corners of her perfectly lined lips arching into a scowl. “I wait almost fifteen minutes!”\\n\\n “Sorry,” Aria slammed her art history text on the table, then walked to a counter for coffee, which made Klaudia squeak indignantly. The line was long, with everyone ordering complex lattes and mochas, and when she returned, there were bright splotches on Klaudia’s cheeks.\\n\\n “I have plans, you know!” Klaudia protested. “I am meeting for date with Noel!”\\n\\n I get it, Aria wanted to say. You stole Noel from me. You won. She leaned forward. “Look, do you mind if you spoke like a normal person around me? I know you can.”\\n\\n A slimy smile appeared on Klaudia’s face. “Suit yourself,” she said evenly, instantly losing the ditzy accent. She tapped her own art history textbook with a hot pink pen. “Since we’re being honest, I was wondering if you could do my half of the project. My ankle still really hurts.”\\n\\n Aria stared at Klaudia’s ankle, propped up on a spare chair. It didn’t even have a cast on it anymore. “You can’t milk that forever,” she said. “I’m doing my half of the project, and that’s it. We can work together, but I’m not doing the work for you.”\\n\\n Klaudia sat up straighter and narrowed her eyes. “Then maybe I’ll tell Noel what you did to me.”\\n\\n Aria shut her eyes, suddenly so sick of being pushed around. “You know what? Tell him. It’s not like we’re together anymore.” Just saying it made her feel light and free. Soon enough, she would be out of Rosewood for good. What did it matter?\\n\\n Klaudia sat back, her mouth making a small O. “I’ll tell your new boyfriend, too. Mr. Novelist. Wasn’t it so nice that he let me read his book? Isn’t it so sad how the male character dies in the end?”\\n\\n Aria flinched at the mention of Ezra’s novel—she so wasn’t playing Book Club with Klaudia right now. “Well if you tell them what I did, I’ll tell them what you told me on the chair lift and that your whole blond bimbo thing is an act. Remember how you said you wanted to sleep with Noel? Remember how you threatened me?”\\n\\n Klaudia’s brow crinkled. She jammed her book into her purse and stood. “I strongly suggest you think about doing my half of the report. I’d hate to be the one to ruin things between you and your new poet boy.”\\n\\n “I’ve already thought about it,” Aria said firmly. “And I’m not doing your half.”\\n\\n Klaudia slung her bag over her shoulder and wove angrily around the tables, nearly knocking into a college-age guy carrying a coffee and a muffin on a plate. “See ya!” Aria called after her triumphantly.\\n\\n A folk singer in the front window launched into a Ray LaMontagne cover as Klaudia flounced out. Aria opened her textbook, enormously satisfied. Working alone was a much better idea, anyway. Consulting the index, she found the section on Caravaggio and flipped to the page about his life.\\n\\n She began to read. In 1606, Caravaggio killed a young man in a brawl. But he got away with it, fleeing Rome with a price on his head.\\n\\n Yikes. Aria flipped to the next page. Three more paragraphs described how violent and murderous Caravaggio was. Then, Aria noticed that someone had affixed a yellow Post-it note to the lower right-hand corner of the page. A hand-drawn arrow pointed to the word killer in the text. There was also a note. \\n\\n","sourceLink":"https://allnovel.net/ruthless-pretty-little-liars-10/page-28.html","bookId":2386,"book":{"id":2386,"title":"Ruthless (Pretty Little Liars #10)","description":"Storyline: Ruthless (Pretty Little Liars #10) \\n For years scandal has rocked Rosewood, Pennsylvania—and high school seniors Aria, Emily, Hanna, and Spencer have always been at the center of the drama. They’ve lost friends, been targeted by a ruthless stalker named A, and narrowly escaped death. And it’s not over yet. \\n Aria’s love life is on the fritz. Emily’s exploring her wild side. Hanna’s kissing the enemy. And someone from Spencer’s past—someone she never thought she’d see again—is back to haunt her. \\n But none of that compares to what happened last spring break. It’s their darkest secret yet and guess who found out? Now A is determined to make them pay for their crime, and the only thing scarier than A is the fear that maybe, just maybe, they deserve what’s coming to them.\\n","cover":"https://allnovel.net/images/ruthless-pretty-little-liars-10.jpg","author":"Sara Shepard","type":"Mystery","source":"allnovel","link":"https://allnovel.net/ruthless-pretty-little-liars-10.html","creation":"Oct 5, 2019 8:58:40 AM","modification":"Oct 5, 2019 10:22:08 AM"}}
