{"id":75975,"no":16,"title":"Page 16","content":"“What’s going on in that head of yours?” Dante’s voice intruded upon her troubling thoughts, and she focused her attention back on him.\n “I was thinking . . .” She cleared her throat before affecting a cocky grin and reaching for her dessert. “I was thinking you still haven’t told me what you did after dinner tonight. Did you go to one of those onsen places?” She was referring to the public hot spas that were so popular in Japan. “Did you have to get naked with Mr. Tanaka and Mr. Watanabe?”\n He winced at the question.\n “Dios, no.”\n “Then it really can’t be that bad, can it?” She enjoyed needling him; his embarrassment made him seem a little more approachable. “Anything my imagination dredges up will probably be a lot worse than reality.”\n “We went to karaoke,” he said, finally relenting, and Cleo choked on her first bite of cheesecake.\n “You’re being overly dramatic,” he scoffed as she waved her hand in front of her face to cool her skin after her coughing fit.\n “Karaoke?” she finally managed on a wheeze, and he nodded. “Seriously?”\n “Yes. Can I have some of that cheesecake?” he asked casually.\n “No,” she replied equally casually, deliberately sticking another forkful in her mouth and chewing slowly before asking her next question. “Did you actually sing?”\n “Sí.” His eyes dropped to the remaining cheesecake on her plate. “Just a bite?”\n “No,” she said as she took another teasing forkful. “What did you sing?”\n “A bit of Queen, some Rolling Stones, a little Nirvana, Red Hot Chili Peppers, Blondie . . .” he recited. “You don’t seriously mean to eat that entire piece of cake, do you?”\n “I do,” she affirmed. “Blondie? Seriously?”\n “And Cyndi Lauper.” He grimaced. “Ms. Inokawa really likes their songs but can’t sing them because the English is a bit too fast-paced for her.”\n “But they’re so high-pitched.” She laughed.\n “I know. Can we stop talking about this now? And I warn you, this remains between us. Now give me some of that cake.”\n “No, it’s my cake. Get your own dessert!”\n “Okay.”\n “Oh my God, what are you doing?” she asked seconds later when he knelt in front of her chair and ran his hands from her knees to her thighs, parting her robe as he did so. She hurriedly put her cake aside as she stared down at him in shock.\n “Getting my dessert,” he mumbled, moving his hands beneath her butt and dragging her to the edge of the chair until he had her spread wide open in front of him. The corners of his lips quirked upward before he hummed in contentment, bent his head, and feasted.\n Cleo, her own dessert forgotten, stared down at the top of his dark head in disbelief until his very talented tongue started to work its magic on her. She arched back in the chair and entangled her fingers in his hair as her eyes drifted shut.\n “Oh. My God . . .”\n CHAPTER THREE\n The rest of their time in Tokyo sped by. Dante didn’t micromanage Cleo as much as before, solely because he didn’t have the time to oversee her every little move. She did her work efficiently and gave him no cause for complaint.\n Their nights were equally busy. They never spoke about it, never gave what was happening between them a name, but they spent every night together having mind-blowing sex. And when it was over, Cleo always retreated to her room, and Dante never made any attempt to call her back. And if she ever had any doubts as to the nature of their “relationship,” his indifference and distance during the day when he was focused on work certainly made things clear. He never, by word or by deed, let on that theirs was anything more than a working relationship. Yet he had a chocolate-glazed doughnut waiting for her at whatever conference room they happened to find themselves in on any given day, and he always ensured that her plate was full at lunchtime and that the menu would be palatable for her. When they headed back to the hotel in the evenings, Daisuke always took a different route so she got to see a bit of the city, which she suspected was Dante’s doing as well. It was all so sweet, Cleo didn’t know how to respond to it.\n By their last day, the zoning problem had been completely ironed out, and everybody was in a celebratory mood. They would break ground on the new hotel in less than a month.\n “Tonight, we will have an enkai to celebrate this wonderful occasion,” Ms. Inokawa stated happily. “This is a very formal Japanese event, so there will be many speeches, but after that we will all enjoy drinking together and have many after-parties.”\n Her pretty eyes slid to Dante in clear invitation, and Cleo pretended not to see the smile he slanted the woman in return. Of course she wasn’t jealous. Dante Damaso meant nothing to her. Just a bit of fun. A casual fling.\n So that evening as they were preparing to leave the hotel, Cleo suggested she stay behind. After all, she told herself magnanimously, he might feel a bit awkward flirting with Ms. Inokawa while Cleo was hanging about.\n “You’re not staying behind. You’ve read enough of those etiquette books to know that it’s damned bad manners,” he snapped. He’d been in a pretty foul mood most of the day, despite the news that his new hotel had gotten the green light.\n Cleo sighed and checked her appearance in the mirror one final time. She was wearing yet another variation of the same boring skirt, jacket, and blouse combo that she had rocked the entire week. She truly hated her work wardrobe; it wasn’t at all to her taste. She was more at home in torn jeans and T-shirts, or slip dresses with long bohemian skirts, than in these horrendous suits that made her feel like a trussed-up pigeon. She didn’t know who she was when she wore these clothes. \n","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-16.html","bookId":1838,"book":{"id":1838,"title":"A Ruthless Proposition","description":"Storyline: \n The last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. \n Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. \n Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.\n \n","cover":"https://allnovel.net/images/a-ruthless-proposition.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-ruthless-proposition.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:35:51 AM"}}
