{"id":76004,"no":45,"title":"Page 45","content":"“Cleo, we haven’t seen you in months,” Susan Killian, the owner of the studio, enthused when Cleo entered the place. She was all smiles and came around the reception desk to give Cleo a hug. The woman was short and comfortably plump, she had unnaturally brassy red hair—always up in a messy bun—wore too much makeup, and had glasses perched on the tip of her nose. She had a habit of staring over the top of them when she was speaking to someone, which made her look like an aging librarian. She was still hugging Cleo—who was only an inch or two taller than the other woman—to her ample chest, enveloping her in an overpowering cloud of Red Door by Elizabeth Arden. Susan had been a pretty decent dancer back in her heyday, before retiring and opening the dance studio. Now she taught ballet to girls ranging in age from just three to fifteen as well as an adult beginner’s class in the evenings. She had often tried to enlist Cleo’s help with a couple of the classes, but Cleo was resistant to the idea. She felt that taking the step toward teaching would be the final nail in her dancing dream’s coffin, and as she’d told Blue, she honestly didn’t think she had it in her to genuinely want her students to succeed. Which just made her feel like a terrible person. Even though she hadn’t danced professionally in more than three years, she’d never felt like it was completely lost to her. Now with the pregnancy, she knew that she’d have to finally face reality. Time to grow up.\n “I’ve had a few personal issues to deal with,” Cleo said, explaining her absence. “Can I book some time at the barre?”\n “Of course you can.” Susan waved a hand carelessly. “I’m between classes right now, and the studio’s practically empty.”\n “Thanks, Susan.”\n Ten minutes later, as she was going through her stretching routine, she could feel the stiffness working its way out of her joints and muscles. The familiar routine felt like a comfortable blanket settling over her, and she cleared her mind entirely and focused only on her body. She moved on to her barre routine soon afterward, her intention to do a slow, easy workout in deference to her pregnancy and the lethargy she still felt. She’d brought her own CD along, and as the soothing strains of the piano solo flowed over her, she started slowly and gently and dropped into her demi-pliés. Simple and smooth. This was home to her.\n By the time she’d progressed to her en pointe exercises, she was starting to feel a bit of strain in her knee, but she worked through it. She’d definitely encourage her child to dance, and hopefully he or she would derive as much joy and freedom from it as Cleo did. If not, she hoped they found something they loved as passionately.\n She released the barre and moved into a fluid, easy arabesque en pointe on the left leg and held it for a couple of seconds longer than she normally would have, just to prove to herself that she could do it. When she moved to do it on the right leg, her knee immediately buckled, and she fell out of the arabesque with a frustrated cry. She grabbed hold of the barre with both hands and bowed her head in defeat.\n “Stupid, stupid, stupid!” she admonished herself. And it had been stupid; she’d known it would happen. It always did, and yet, even three years after her accident, she kept trying. She was too stubborn for her own good sometimes. And dumb, definitely dumb.\n She regained her composure and started her cooldown exercises, cutting her routine short because she felt disheartened and seriously exhausted. A telling sign that, even though it wasn’t showing yet, her pregnancy was already changing her body. She could usually push herself twice as hard at the barre.\n Susan was reading a romance novel behind the reception desk when Cleo limped her way out of the studio, and she frowned in concern.\n “Have you been silly again?” she asked, giving Cleo a disapproving glare over the top of her glasses.\n “No more than usual.” Cleo shrugged and slung a towel around her neck. She hadn’t bothered to change—merely pulled on a sweat suit to keep her muscles warm. She could be at home and under the shower in less than ten minutes, the studio was so close to her apartment. That was one of the reasons she’d found the apartment so appealing in the first place, despite its many other faults.\n She walked home, thankful that the drizzle had stopped even though the wind had picked up and she was walking against it. She was huddled beneath her coat, hands in her pockets and head down as protection from the wind, and didn’t see the huge figure looming ahead of her at the entrance of her building until she was almost on top of him.\n She yelped in fright and jumped back with her hand on her chest, prepared to scream or run, when she looked up and saw Dante Damaso peering down at her as if he didn’t recognize her.\n “Miss Knight?”\n God, why did he still insist on calling her that?\n “What do you want?”\n “I wanted to inform you that the paternity test result came today.”\n “I know.”\n “And I want to assure you that you and the child will be provided for.”\n “Just the child,” she corrected, and his brow lowered.\n “What?”\n “You will be providing for only the child. I don’t want your money for myself.”\n “But the medical costs alone will—”\n “Don’t worry about it.”\n “Do you have a job yet?” His critical gaze swept over her body, and Cleo recognized what a mess she was and had to use every ounce of willpower not to touch her untidy hair self-consciously.\n “Not yet.”\n “The longer you remain unemployed, the less likely you are to find a job in your”—he made a vague gesture at her stomach region—“uh. Your condition.” \n","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-45.html","bookId":1838,"book":{"id":1838,"title":"A Ruthless Proposition","description":"Storyline: \n The last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. \n Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. \n Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.\n \n","cover":"https://allnovel.net/images/a-ruthless-proposition.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-ruthless-proposition.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:35:51 AM"}}
