{"id":76013,"no":54,"title":"Page 54","content":"“You’d do that?”\\n\\n “Maybe.”\\n\\n What the hell am I doing here? Dante sat hunched in a small, uncomfortable plastic chair, surrounded by women in various stages of pregnancy. They were all openly staring at him, probably wondering why he was lurking about in an OB/GYN’s reception room without a pregnant woman nearby. He didn’t understand the thought process that had brought him here this morning. All he knew was that at random times over the past forty-eight hours, that tiny, toddling ballerina with the charming smile and sparkling green eyes had crept into his thoughts and had made him wonder, fantasize, and aspire to be more.\\n\\n But he wasn’t sure how much more he could, or wanted to, be. He and Cleo were strangers now forever bonded by circumstance. He couldn’t pretend that there was anything more than that between them. What he knew about the woman could fill a thimble, and he really had no wish to get to know her, but he had discovered a weird desire within himself to know that baby. As a result, he would have to find a way to work out an amicable arrangement with Cleo.\\n\\n He had closed more difficult deals than this in the past. Every problem had a solution, and he was confident he would find the solution for this problem too. He just had to find a way to convince Cleo that his way was the best course of action.\\n\\n If only he knew what the hell his way was.\\n\\n “He drives me crazy,” Cleo complained to Cal as she lay down on the examination table as per the ultrasound technician’s instructions.\\n\\n “Don’t think about him now,” Cal said. “You’re about to see your baby for the first time. Where’s your sense of awe and occasion?”\\n\\n Her eyes misted over at Cal’s words, and she felt guilty for her initial reluctance to have him join her for this. He sometimes said and did the perfect thing at the perfect time. She should be excited, she should be awed, she’d been waiting for this moment since she’d decided to keep her baby, and Dante Damaso was not going to ruin it for her.\\n\\n She reached for Cal’s hand, offering him a watery smile as the technician applied the cold gel to her abdomen and stomach. She sucked in a breath at the unpleasant sensation.\\n\\n “This is the transducer,” the technician, Julia, explained as she held up the wand. “I’ll run it over your tummy to capture the images. I’ll measure the fetus’s size today so that we can more accurately estimate the due date. We’ll check Baby’s heartbeat, make sure everything’s in order and . . . do you want to know the sex?”\\n\\n “No,” Cleo said, decisively. “I want to be surprised.”\\n\\n “No problem.” Julia smiled.\\n\\n “Don’t push down too hard with that thing, okay?” Cleo warned, and the other woman chuckled. “My bladder’s about to burst.” She wasn’t feeling very comfortable at all, thanks to all the water she’d had to drink over the last hour in preparation for the test.\\n\\n “You have no idea how often I get that warning,” Julia replied. “Are you ready?”\\n\\n “Yes.” Cleo nodded and watched as she lowered the wand. “Wait.”\\n\\n Julia’s hand stopped its descent just an inch away from her belly, and Cleo sighed. She was such a sucker.\\n\\n “Cal,” she whispered. “Maybe we should . . .”\\n\\n “You want me to fetch him?” Cal asked.\\n\\n “Would it be okay if we got someone else in here?” she asked Julia, whose eyebrows rose before she shrugged and nodded. “Cal, tell him he doesn’t get to speak. He gets to stand quietly at the door while I pretend he’s not there.”\\n\\n “Mature,” Cal muttered.\\n\\n “Shut up,” she responded without heat. It didn’t feel right to leave Dante sitting out there, even though she still didn’t want him involved in her pregnancy. She was so confused and really just acting on a gut instinct right now. After all, her own reaction upon learning of her pregnancy had also been disbelief followed by a complete and utter rejection of the very idea of a baby, but she’d changed her mind and nobody had judged her for it. Was it really so inconceivable that perhaps Dante also, after getting over the initial shock, now had similar feelings?\\n\\n He had signed papers basically renouncing his right to this child, but would it be fair to enforce that document? It wasn’t just Dante she had to consider. She had to do the mature thing and think about her baby as well. Surely having Dante around would do more good than harm?\\n\\n The door opened and Cal came in with Dante trailing meekly behind him. Cleo heard Julia’s breath catch slightly at the sight of him and felt a little sorry for her. Dante Damaso’s overwhelming physical presence was hard to take without advance warning. Just standing there, trying desperately to look timid and unassuming, he exuded sexual magnetism and supreme self-confidence. Seriously, it was like someone had set a leopard in among the house cats, and it turned Julia into a giggly girl.\\n\\n “Okay,” Julia squeaked, self-consciously pushing a strand of hair behind her ear. “Are we ready now?”\\n\\n “Yeah, go ahead.”\\n\\n “Right.” Julia was all business again, despite the flush highlighting her cheekbones. “Let’s see what we can see.”\\n\\n She shifted the wand about, pausing in some places, skirting over others, and Cleo, Cal, and Dante all stared at the monitor in fascination as the grainy image began to form right in front of their eyes.\\n\\n “Ah, there we go, beautiful . . . Look at that little heart beating away.” She pointed to a blurry, twitching smudge on the screen and smiled, taking a couple of notes before looking back up. “There’s the forehead. And down here’s where the nose is forming. Look at that little jaw and mouth.” \\n\\n","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-54.html","bookId":1838,"book":{"id":1838,"title":"A Ruthless Proposition","description":"Storyline: The last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. \\n Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. \\n Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.\\n","cover":"https://allnovel.net/images/a-ruthless-proposition.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-ruthless-proposition.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:35:51 AM"}}
