{"id":76025,"no":66,"title":"Page 66","content":"He picked up the items as he went along, feeling like someone following a particularly naughty trail of bread crumbs . . . denim skirt, T-shirt, and even a bra were scattered on the staircase and landing, and Dante found himself wondering if this was an attempt to seduce him. A rueful glance down at his straining erection told him that if it was an attempt, it was wholly successful so far. He reluctantly acknowledged that the thought of a half-naked Cleo in one of those huge beds was more than enough to make his dick stand up and go “Yes, please.” There he stood—making an incongruous picture—with an armload of decadently Cleo-scented clothes, rampant and ready for her. He glimpsed a tiny sock discarded outside the middle door and followed it blindly, knowing that Cleo was probably behind that door. Naked and as primed for him as he was for her. Hopefully. He tossed her clothes aside and stumbled toward the door, opening it without knocking and without further thought. The sight that met his eyes stopped him dead in his tracks. She lay in the middle of the huge bed, curled up in a tight ball, fast asleep. He could see that she had attempted to drag the comforter up over herself, but the thing had slid half off the bed and only covered her slender thighs. She was wearing a pair of those damned boy shorts he so loved—Daisy Duck again—and a white tank top. She must have dragged the bra out from beneath the tank. She had one hand tucked beneath her cheek and the other curled over her abdomen in an unconsciously protective gesture; her knees were tucked and drawn up almost to her chest. For such a tiny thing in such a huge bed, she took up a surprising amount of space. Asleep she presented a picture of innocence, yet that didn’t dampen his desire for her one bit. Thank God she was sleeping, or Dante might have made a huge mistake. Bringing sex into this confusing situation would complicate things exponentially. He would have to ignore these baser urges, especially if she was moving in here. He walked over to the bed, unable to take his eyes off her. Completely relaxed like this, without that challenging look in her eyes and the combative tilt of her jaw, she was goddamned beautiful. The revelation stunned him. He had never really seen this beauty before and couldn’t be sure why he was seeing it now. She still had those same odd features that in no way seemed to go together. Most of the time she could probably be described as pretty in an offbeat way, but at that moment, she was nothing short of breathtaking. He didn’t want to think about that, didn’t want to evaluate this change of heart, and instead dragged the comforter back over her and tucked her in securely before turning and walking out of the room. When Cleo woke up, she was completely disoriented and panicked. Where was she? A glance around didn’t help matters when she saw not one familiar item anywhere. She took a deep breath and tried to remember what had happened before she’d fallen asleep. When she recalled where she was, she groped around for her phone, which was tucked beneath the pillow, to check the time. It was just after eight in the evening, and she’d slept for nearly nine hours. There were half a dozen missed calls on her phone from Blue and not a single one from Luc. She sat up quickly and speed-dialed Blue’s number. “Cleo? Thank God!” Her friend’s voice throbbed with relief, and Cleo felt guilty for making her worry. “Where are you? And what’s going on? Luc isn’t making any sense. He slammed his way into his study and refuses to talk to me about whatever it is that’s bugging him. All I know is that you’re somehow involved.” That was unusual behavior for Luc, who always told Blue everything. Cleo tried not to think about what it could possibly mean if he refused to even talk to Blue about this. “Dante Damaso went to speak with Luc this morning,” Cleo said quietly, her voice thick after nine hours of disuse. “Dante Damaso? Why?” “He’s my baby’s father. He told Luc that I’d be living with him until the baby’s born.” Blue was completely silent at the other end of the line. “Blue?” “Oh my God,” Blue moaned. “Cleo.” “I feel horrible. I know what good friends they are . . . were.” “You could still come and stay with us. You don’t have to live with him,” Blue said. “I know that, but he is this baby’s father, and I think this is the best move for everyone. Most especially for my baby.” “Luc will come around, Cleo,” Blue told her. “I ruined their friendship, Blue,” Cleo said, tears running down her cheeks. “It’ll work out,” Blue said, always the optimist. “He’s going to need time, though.” “I’m at Dante’s right now, but I won’t be moving in for another couple of weeks yet. Do you think I should come and talk to Luc before then?” “Let me talk to him and try to get him over the worst of it,” Blue suggested. “I’ll keep you updated.” “Thank you.” “Cleo are you . . . do you . . .” Blue framed hesitantly. “Do you have feelings for him?” “No.” Cleo ignored her annoying internal voice, which had been silent for so long, as it called her a heinous liar. “Okay.” “It was just something that happened.” Cleo felt the need to explain the inexplicable, mostly for her own benefit. “In Tokyo. A thing. He was there, I was there. It happened. We used protection, but how does that quote from Jurassic Park go? ‘Life will find a way.’” Blue giggled, and Cleo could hear the tears in the bubbly sound.","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-66.html","bookId":1838,"book":{"id":1838,"title":"A Ruthless Proposition","description":"Storyline: The last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.","cover":"https://allnovel.net/images/a-ruthless-proposition.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-ruthless-proposition.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:35:51 AM"}}
