{"id":76028,"no":69,"title":"Page 69","content":"“I think it’s the best idea I’ve ever had.”\n “Dante, we can’t resume a sexual relationship; it’ll complicate things.” She sounded unconvincing, even to herself. Especially since her hands were roaming beneath his T-shirt and reacquainting themselves with his gorgeous chest and abdomen.\n “How about we finally finish the one we started in Tokyo? We’ve never gotten that out of our systems. We ended it before it ran its course.” Each sentence was punctuated with a long, drugging kiss, while his hands went to town beneath her tank top. She hadn’t bothered to put her bra back on, since her breasts were starting to feel swollen and painful and her bras were all getting too tight and confining. When his fingers flicked one of her nipples, she hissed and arched her back violently.\n “Okay?” he asked worriedly, his hands retreating slightly.\n “Sensitive,” she muttered. “Very, very sensitive. Treat them with care.”\n “Always,” he said, and dragged her tank up to drop a reverent kiss on the hard little nub. He followed it up with a lick and then some quick, extremely tender suctioning.\n “Oh.” Cleo’s hands tangled in his thick hair, and his mouth left her so that he could peer up at her over the peaks of her small breasts.\n “They’re bigger than I remember,” he said, his tone sounded bemused and a little reverent. “And the nipples are darker. Still so damned pretty.”\n He flipped her over until she was sitting on the couch and moved down to kiss her abdomen tenderly, right above the spot where she knew their baby rested. The gesture was so sweet and loving that it took her breath away. Dante might not have known what role he wanted to play in this baby’s life yet, but he was clearly starting to fall in love with it despite himself.\n He moved even lower until he was under her short denim skirt, and he peeked up at her with a grin.\n “I’m glad to see my friend Daisy is back,” he said as he placed his hands on her hips and dragged her down slightly. Shortly after that, “Daisy” was slowly slipped down over her thighs, then knees, before he removed her completely. He took one of her slender thighs and rested it on his broad shoulder before—with one last wicked grin at her—he bent down to taste her.\n Cleo cried out at the touch of his mouth and tongue on her most sensitive flesh, and it didn’t take more than a few strokes before she was lost. She was floating back down and was aware of him rearranging her until he was flat on his back on the marble floor and she was straddled above him.\n “Is it okay if we do this?” he asked, the tip of him poised at her entrance. “For the baby. Is it okay for the baby?”\n “It’s okay,” she said dazedly. This was happening so quickly. Too quickly. His face was tense as he focused on where their bodies were on the verge of joining. Cleo swallowed. Now that her orgasm had passed and she could think clearly again, her previous doubts came swamping back.\n “Dante,” she said, her voice filled with regret as she shifted off him. He looked at her intently before raising an arm to cover his face and sighing deeply.\n “Bad idea, huh?” he muttered.\n “I’m sorry.” She glanced at him and winced at the sight of his angry-looking erection. “You know it’s not a good idea. It just all happened so fast.”\n He nodded, his mouth tight beneath the arm that covered his eyes.\n “I’m going to need some . . . time,” he said.\n “I think I should go home,” she whispered.\n “No!” he said sharply, and she jumped. He made an effort to soften his voice before speaking again, shifting his arm to glance at her quickly. “No. Go on upstairs. I just need to get myself under control, and having you right here, where I can still smell and taste your orgasm, is a little difficult.”\n “I’m sorry,” she said again.\n “It’s okay, but please just . . .”\n “Yes, of course.” She leaped to her feet and vacated the area as quickly as she could. She scurried up the stairs and slammed into the room she’d already picked as her own. Once there, she crawled to the center of the massive bed, drew her legs up, and buried her face in her knees. How the hell were they going to make this work if they couldn’t keep their hands off each other?\n She only hoped that once she started to show, he would lose interest in her body, even though she could barely look at the man without wanting to spontaneously combust. She had seriously mixed feelings about what had just happened between them and wished she hadn’t allowed it. Especially since the evening had ended with him still hard and wanting. Was this another example of Cleopatra Knight being selfish? At this point she had no clue.\n She officially moved in two weeks later, bringing only her clothes, some books, wall art, and her bed. It was a sad testament to her nearly twenty-eight years that she had absolutely nothing more than that to show for herself.\n Cleo and Dante hadn’t interacted much since that last evening together at his place. They had exchanged telephone conversations, and he had e-mailed her snippets from articles he had read about pregnancy and what she should eat and what vitamins she should be taking. It was endearing and a little disconcerting, the level of interest he took in her pregnancy.\n She, in turn, had reciprocated with week-fourteen (which they both already knew) and week-fifteen updates.\n She was in regular contact with Blue, but Luc still wasn’t talking to her or Dante, and it broke her heart. She had tried calling him on several occasions, but he never answered and didn’t respond to a single one of her text messages. Blue told Cleo that he needed time. Cleo gave him his space, but it was difficult not having him around to talk to. She couldn’t remember a single time in her life when her brother hadn’t been there for her, and this was so much harder without his support. \n","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-69.html","bookId":1838,"book":{"id":1838,"title":"A Ruthless Proposition","description":"Storyline: \n The last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. \n Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. \n Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.\n \n","cover":"https://allnovel.net/images/a-ruthless-proposition.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-ruthless-proposition.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:35:51 AM"}}
