{"id":76031,"no":72,"title":"Page 72","content":"Her movement woke Dante, who looked at her in alarm.\n “What’s wrong?” he asked, instantly alert. “Are you okay?”\n “I think the baby’s moving,” she whispered, keeping her voice low as if she were afraid a loud noise would scare the baby and stop the movement.\n “He is? You’re sure?”\n “Yes! Oh God, there he goes again.” Dante sat up and stared at the small bump fixedly. Cleo blindly reached for his hand and placed it where she’d felt the movement. His hand was so large that it just about covered the entire expanse of her stomach. “Oh. Did you feel that?”\n “No.” He shook his head, looking frustrated.\n “It’s very faint. Maybe you can’t feel it yet.”\n “Is he still moving?”\n She paused for a moment before shaking her head.\n “No, I think he’s stopped.” He looked so disappointed that she covered the hand he still had on her stomach with her own.\n “I’ll let you know the moment he starts up again,” she promised, and he nodded briskly. She moved her hand, and he was just about to remove his when the gentle flutter returned. This time he felt it, and his eyes shot up to meet hers.\n “Christ!” he gasped.\n “Language, Dante,” she warned, tears in her eyes and excitement in her voice. “There’s a kid in the room.”\n “Sorry,” he whispered, before leaning down until his mouth was within an inch of her stomach. “Sorry, pequeño, don’t you listen to your daddy’s bad language, okay?”\n Almost simultaneously, they both comprehended that he’d used the word daddy, and Dante froze, his eyes leaping up to meet hers. Cleo wasn’t sure how to respond. What did it mean, him naming himself father to the child? How active did he now expect his role in this child’s life to be?\n “How does it feel?” he asked, changing the subject but keeping his hand firmly anchored on her stomach. “To have him move around like that? Does it hurt?”\n “It feels strange. A little bit like indigestion. Not painful or anything, just like a tiny tummy rumble. I wasn’t even sure what it was at first.”\n “It’s amazing,” he said, his tone brimming with awe and discovery. He stared down at her stomach again, obviously hoping the baby would move some more.\n “I think he’s done for the night,” she said gently, and his eyes shadowed with disappointment.\n “Thank you for sharing this with me, dulzura,” he said as he reluctantly lifted his hand from her abdomen. She smiled and refocused on the movie that had been running unheeded while they had marveled over the miraculous life they’d created together.\n He once again lifted his feet to the coffee table and folded his arms over his chest, keeping contact between them limited to occasional accidental brushes.\n “So do you enjoy the teaching?” he asked about ten minutes later, as they were watching Ripley battle her way through droves of ugly aliens.\n “I’m finding it quite rewarding,” she replied. “The kids are enthusiastic and talented. They remind me a little of myself at that age. I was absolutely obsessed with dancing. I couldn’t wait for school to finish every day so that I could get to dance classes, I spent all of my time practicing my chaînés tournes in the mirror, and I wouldn’t stop until my grandmother forced me to do my chores. I resented her so much for that.”\n She could hear the sadness in her voice at that admission, and from the change in his body language, she knew that Dante could too.\n “They only wanted what was best for Luc and me.”\n “Where were your parents?”\n “I never knew our dad. Luc has a slight recollection of him, but he never talks about the man. Our mother left us at our grandparents’ house—the huge old place that Luc’s staying in—when we were five and ten. Told us it was for a holiday and never came back. I heard my grandmother arguing with her on the phone soon after she left us there, and for years afterward I believed that our mom didn’t come back because my gran had chased her away.”\n Dante was silent as she sat there, her hand idly stroking the gentle curve of her abdomen.\n “Of course, now I know that if she’d wanted us back, no force on earth would have been strong enough to keep her away. But I spent my entire childhood and teens resenting my grandmother for a telephone conversation that I could only hear one side of. So stupid.”\n She shook herself and peered up at Dante in embarrassment.\n “I’m sorry. You didn’t want to hear all of that.”\n “On the contrary . . . I found it quite insightful.”\n “In what way?” she asked, and he shook his head.\n “I’m not sure yet. Did you ever hear from your mother again?”\n “No. Not a single Christmas or birthday card. No phone calls or letters or e-mails. Nothing until we received word of her death just months after our grandparents passed. She died in Nepal, and the cost of the trip put Luc in a financial hole so deep that he’s still struggling to get out of it more than eight years later. That’s when I really hated her . . . all those years of misdirected anger aimed at my grandparents, who were only trying to provide a stable home life for us. They paid for ballet lessons that they could barely afford and scraped together their money to buy Luc that beaten-up old hatchback for his eighteenth birthday that I now drive. By the time I’d recognized how much they’d sacrificed to raise us, it was too late; they were sick and dying, and then they were gone.” \n","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-72.html","bookId":1838,"book":{"id":1838,"title":"A Ruthless Proposition","description":"Storyline: \n The last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. \n Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. \n Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.\n \n","cover":"https://allnovel.net/images/a-ruthless-proposition.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-ruthless-proposition.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:35:51 AM"}}
