{"id":76037,"no":78,"title":"Page 78","content":"He watched the girl go before turning back to her with a quizzical look on his face.\\n\\n “Did you ever wear those ridiculous little skirts?”\\n\\n “Of course I did, I was a ballet dancer,” she replied before getting straight down to it. “Why are you here?”\\n\\n “I came to watch the performance. The kids were great. Your choreography was fantastic.”\\n\\n “I have to go and talk to the children,” she said. “Excuse me.”\\n\\n “I’ll be waiting out in the reception area,” he informed her, and stepped aside to let her pass.\\n\\n “Don’t bother, I drove myself here and I can drive myself back.”\\n\\n “I’ll be waiting,” he reiterated. Her back stiffened, and she walked off without another look back.\\n\\n It took her nearly an hour to finish up. After heaping praise on the kids, she was stopped by parents who were keen to discuss their children. She was supposed to help Susan clean up after the rest of the recital was finished, but the woman, who’d come backstage to congratulate her after her group had danced, urged her to go home, overriding Cleo’s protestations by reminding her that pregnant women should take it easy. Unable to argue with that logic, Cleo had conceded her point and grabbed her denim jacket, heading out of the gym, where the fourteen-year-olds were currently performing.\\n\\n She had her keys in hand and her head down when she walked out of the building, but she was very aware of the fact that Dante and James were standing in the parking lot watching her come down the school steps. They were waiting by her car, so there was no way to avoid them.\\n\\n She sighed—knowing it would be useless to argue—and handed her keys to James and waited for Dante to lead her to wherever his car was parked. All without saying a word. She just didn’t feel like arguing, not when they were all going to the same place anyway. Dante didn’t have much to say either, but he threw glances at her every few minutes, which she pointedly ignored.\\n\\n “I’m not used to such silence from you,” he finally said when they were about five minutes from home.\\n\\n “I don’t have much to say at the moment,” she said with a shrug.\\n\\n “That bad, huh?”\\n\\n She didn’t know what the hell that meant, but it just rubbed her the wrong way, and she turned to him with a ferocious scowl. “You think being flippant is the way forward here?” she snarled. “Because I’ve got news for you, buddy—”\\n\\n The ear-splitting sound of screeching brakes interrupted her in midsentence, and she looked up into the driver’s-side window to see a car barreling straight at them.\\n\\n “Dante!” Her scream was sharp and short-lived, and mere seconds passed between impact and the cessation of all movement and sound.\\n\\n She battled her way out from beneath the airbag, which had deployed with a startling pop and had knocked the breath out of her. She could hear Dante groaning and was desperate to get to him. She could see blood and started to panic. His head was bleeding and his eyes were shut, and he sounded like he was in pain.\\n\\n “Dante?” she whispered. “Oh God, Dante! Are you okay? Can you hear me?”\\n\\n Her door was wrenched open, and she looked up to see James—who’d been following in her car—towering above her, his face grim. He reached down to unbuckle her seat belt.\\n\\n “Are you okay?” he asked, his voice harsh.\\n\\n “I’m fine. See to Dante first.”\\n\\n “You know that he’d want me to help you first, Cleo.” James’s voice brooked no argument, and Cleo knew that disagreeing with him would only delay the time it took for him to get to Dante, so she allowed him to unbuckle her and help her out.\\n\\n He ran expert hands over her, his touch telling her that he knew exactly what he was doing and what he was looking for. She batted his hands away impatiently.\\n\\n “Help Dante,” she commanded, and he nodded curtly before heading back to the car. They had been pushed off the road, she noticed dazedly. They were hit while crossing a T-junction, and the other car had pushed them into a field. The second car had come to a standstill a few yards away, and Cleo could see the driver staggering his way out of the car. She stood frozen, her hands to her face in horror, and her entire body went numb as shock started to set in. She turned away from the other driver and back to their car, willing James to hurry, to bring Dante out to safety. And then she heard it—the unmistakable sound of Dante’s impatient voice—and the relief made her legs weak. She sat down in the middle of the field as her body started shaking from head to toe.\\n\\n Cleo could hear them quite clearly: James saying that he didn’t think it was wise for Dante to move, and Dante telling him to get the hell out of his way. Dante, being Dante, predictably got his way, and after pushing his way past James, he stood looking like a wild man, his head whipping back and forth as he looked for something. Her, as it turned out.\\n\\n “Cleo!” The harsh, commanding voice had a desperate edge to it as he called for her, clearly panicking because he couldn’t see her.\\n\\n “I’m here,” she called, sounding shockingly weak. His head snapped in her direction, and she saw him wince at the fast movement before he lurched toward her.\\n\\n “Ah, Jesus,” he cursed when he sank down to his knees in front of her. His hands cupped her face and tilted it up to peer at her closely. “You’re okay. You’re okay.”\\n\\n He sounded unsteady, and he released her face to gather her tenderly into his arms and hug her close.\\n\\n “I’m sorry,” he whispered into her hair. “That shouldn’t have happened. I’m sorry.” \\n\\n","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-78.html","bookId":1838,"book":{"id":1838,"title":"A Ruthless Proposition","description":"Storyline: The last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. \\n Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. \\n Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.\\n","cover":"https://allnovel.net/images/a-ruthless-proposition.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-ruthless-proposition.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:35:51 AM"}}
