{"id":76048,"no":89,"title":"Page 89","content":"“It wasn’t your fault, Dante,” she said, leaning back to look up at him. There was moisture gleaming in his eyes. “It really wasn’t. They did an autopsy and he had a chromosomal problem, or imbalance. The accident hastened the inevitable, but our baby would never have made it. I shouldn’t have put that on you. Dr. Klein called me with the results yesterday, and I know I should have called you immediately, but I was just so sad and I felt so horrible for blaming you. Even when I said those things, I knew they were awful and unfair and I wanted to call you, but I—” She stopped and sobbed. “I didn’t know what to say. You must have felt so terrible. I’m so sorry.” “I did,” he whispered. “I do. Not because of anything you said or did, but because I wanted him. I so badly wanted to be his dad.” She was crying again, and that was okay because Dante was crying too, and Cleo no longer felt alone. CHAPTER FOURTEEN Dante was still there when Blue and Luc came home from work that evening. Blue invited him to stay for supper, and after a quick glance at Cleo, who nodded, he happily accepted. He clung to Cleo’s hand for most of the evening, and after small talk and drinks on the veranda while they listened to the waves crashing nearby, Blue and Luc excused themselves and went to bed. Cleo sat on her grandmother’s old rocking chair. She still wore the loose pajamas she had on when he arrived. Dante was on a deck chair next to her, and he took her hand for the umpteenth time that day. They didn’t speak, their silence speaking for them, and after another half an hour in the cool, briny air, Dante sighed. “I should probably get going,” he said quietly. “Thank you.” “For?” she asked, genuinely confused. “Including me.” Oh. The underlying vulnerability in those words hit her hard. He’d been made to feel excluded and alone at a time when he should have had a solid support base, and it was entirely her fault. Well, that would end right now. “Stay,” she invited. “What?” “Stay the night. As a friend.” She wanted to make it perfectly clear that she was expecting nothing more than that from him. He wasn’t obligated to stay with her after all this was over. She didn’t want him to. But for now they each needed the other. “Are you sure?” he asked, hopeful and hesitant. She thought about it for a moment before nodding. “I’m sure.” She took his hand and led him upstairs to her room, which was even messier than usual for her, and for the first time since she’d lost the baby, that bothered her. “I’m sorry it’s a bit crazy in here.” “You should see the penthouse,” he said wryly, and her head swiveled to meet his gaze. She couldn’t imagine the penthouse being anything other than immaculate. “Seriously?” “I’ve been at home a lot since it happened, and I didn’t want to be disturbed, so I asked Esta not to come in.” Esta was his cleaning lady. “Yeah but you’re inherently neat,” she reminded him, and a corner of his mouth tilted up. “I haven’t been myself these past two weeks,” he said with a shoulder lift. “And work? You haven’t been to the office much?” “I have competent people to run things in my absence. I took compassionate leave.” He unbuttoned his shirt and kicked off his shoes while he spoke, and Cleo turned her back to give him some privacy, while nervously rearranging the myriad decorative perfume atomizers on her dresser. “You did?” She wouldn’t let the fact that he was stripping down affect her; she’d invited him to stay, and he couldn’t very well sleep in his shirt and trousers. It was ridiculous to be nervous around him; she’d seen him in less. It wasn’t like she didn’t know what his body looked like. And being sexually aware of him was completely inappropriate and disrespectful considering the circumstances. “You can turn around again,” he said, his wry tone making her wonder if he knew exactly what crazy thoughts had been running through her head. She turned around reluctantly and kept her eyes fixed on his face. “I can sleep in one of the guest rooms,” he suggested gently. “There have to be more than a few in this gigantic house?” “None of them are currently habitable,” she said, wrinkling her nose. “Water damage in a couple from the leaky roof, mold in the other, and the last one is being used as a storage room for generations’ worth of crap. We’re talking everything from spindles to World War II rifles to old-time girlie magazines.” “Why not store those in the attic?” he asked, but she didn’t respond, waiting for him to figure it out instead. “Ah,” he said, snapping his fingers. “Holes in the ceiling?” “The roof leaks like a sieve, and naturally it’s worse up in the attic, so Blue and Luc moved everything into the biggest guest room. Honestly, it’s only a matter of time until it starts leaking in there as well.” Talking about what a train wreck the house was calmed her nerves a bit, and she felt herself relaxing by degrees. “So I suppose you’re stuck with me tonight, then. Unless you want me to go home, after all?” he asked, generously giving her the opportunity to back out. “It’s fine,” she whispered. “Let’s just go to bed.” “Great, because I’m exhausted, and I didn’t relish the thought of the drive home.” He crawled under the covers without further discussion and stretched out on his side. He eyed her with a slight smile playing about his lips and lifted the sheet invitingly.","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-89.html","bookId":1838,"book":{"id":1838,"title":"A Ruthless Proposition","description":"Storyline: The last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.","cover":"https://allnovel.net/images/a-ruthless-proposition.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-ruthless-proposition.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:35:51 AM"}}
