{"id":76055,"no":96,"title":"Page 96","content":"“Stop saying that!” he snapped. “No reason for us to ever see each other again? Well, what about this?” He framed her face and planted an angry, bruising kiss on her lips, and she was so shocked at first that she didn’t react, but when the shock wore off and she started to struggle against his hold, his kiss gentled. His mouth opened and his tongue traced the seam of her lips. It was an invitation she couldn’t resist . . . not when she’d spent the last month missing him every single hour of every day. She welcomed him in, and he groaned, the sound smothered against her mouth. He deepened his kiss, taking just that little bit more before ending it and stepping away from her, leaving her reeling. “There’s that,” he said triumphantly, pointing a finger at her, and she shook her head to clear her befuddled senses. “We know we have chemistry,” she said. Her tongue flicked out to taste him on her lips, and he groaned at the gesture. “We’ll probably always have chemistry, but let’s face it, that’s all we ever had, all we’ll ever have. It’s not enough.” “I’m getting sick of you leaving me, Cleo.” “I didn’t leave you, Dante.” “Why do you have to be so damned unreasonable?” It was a familiar refrain, one she had heard from him in various forms of exasperation before. “Sometimes I don’t even know why I bother.” “I don’t know either,” she said, her absolute confusion showing in her face and in her voice. “So you’re living with Callum again?” he asked, changing the subject. “It’s just temporary.” “And how have you been? After everything?” “Fine,” she said. “Some days are harder than others, you know?” “Yeah. I know. I got a call from that baby-furniture store the other day.” His eyes took on a shimmer. “I forgot to cancel the order, and they wanted to know . . . to know when I wanted them to deliver it.” “Oh God.” Her hands flew to her mouth as she imagined how awful that must have been. “That was one of the bad days. I left work early and went home and wished to hell I could talk to you about it! Only you weren’t around, and I got sick of giving you time to come to your senses, so I came to fetch you home.” “Wait, are you saying you knew where I was?” “Dulzura, please, you forget that I am Dante Damaso. I have wealth, power, and influence at my fingertips.” She rolled her eyes, old habits surfacing in his presence. “Also ego,” she added. He sent her a quelling glance before continuing. “I knew you were with Callum. It was just a matter of finding out which company he danced for, and there aren’t many options in Durban. Once I figured that out, a quick phone call told me exactly where he was staying. I’ve known since almost the beginning. But I wanted to give you time to figure this out by yourself. Then I got sick of giving you time, because I missed you like hell.” “W-what?” “I spent Christmas with your brother and Blue,” he said. “Because they felt sorry for my pathetic ass. I was always calling them and asking if they’d heard from you and wanting to know if you were okay.” Cleo knew that; Blue and Luc had both told her stories of how Dante kept questioning them about her well-being. She had thought it was just polite concern, but looking at him now, she could see it was far from that. “Damn you, Cleo! You gave me a home and family, and then you just took it away from me,” he hissed. “We lost Zach; we didn’t have to lose each other too.” “Okay, back up a second,” she said. “You’re making no sense, Dante. Before I lost the baby, we had an arrangement. I’d move out with Zach and set up house in an apartment you provided, and you would play the role of his glorified uncle or something. That was the extent of our relationship. We were living together for convenience, and you never once hinted at anything different.” “I asked you to marry me,” he reminded her, his nostrils flaring with irritation. “Because you wanted Zach!” she said. “No, you idiot.” He was practically yelling now, and she blinked at the spectacular emotional explosion she was witnessing from the famously cool Dante Damaso. This was just . . . fascinating. “Because I wanted you!” She stumbled backward and sat down on the hard couch with a thump. “What?” He sighed and sank down on the couch next to her. “I mean, of course I wanted the baby, but I wanted you too. No, let me rephrase, I wanted you especially.” “I . . . how?” “I’m not great at talking about things like this,” he said with a wince, keeping his gaze straight ahead while she kept hers fixed on his stark profile. “Give it a go.” “When we first slept together in Tokyo, that was just sex, but I couldn’t stay away from you for the entirety of that trip, despite trying my damnedest to leave you alone every night.” “You didn’t seem to try very hard.” She sniffed. “No, you’re wrong. I tried exceptionally hard, and yet every night we just wound up in bed together. Maybe I should have known then, but I wouldn’t see it. I told myself I just needed to get you out of my system; we had some crazy chemistry, and it would eventually fade. Only it didn’t. It got worse. I mean we had sex on my desk! On my desk.” He sounded mildly astonished by that fact. “I stepped over a line that day, and I didn’t even care. I transferred you out of my office and figured that was that. But it wasn’t. Every day, Cleo. I thought about you every bloody day.”","sourceLink":"https://allnovel.net/a-ruthless-proposition/page-96.html","bookId":1838,"book":{"id":1838,"title":"A Ruthless Proposition","description":"Storyline: The last thing Cleopatra Knight expects on her business trip to Tokyo is to fall into bed with her arrogant, irresistibly hot boss, Dante Damaso. It’s a mistake—a steamy, mind-blowingly satisfying mistake. But a few nights of passion with the superwealthy bad boy prove to have long-term effects when Cleo’s world is unexpectedly turned upside down. Dante has cultivated an enviable, jet-setting lifestyle: beautiful women, exotic destinations, and luxury without limits. He’s not looking to be domesticated, and certainly not by his assistant—even though he can’t get her out of his mind. Still, he knows he has both the responsibility and the financial means to help Cleo. Though Cleo has no interest in Dante’s money, her lack of prospects gives her little choice but to accept his help. But living under the same roof, Dante discovers he wants more, and if Cleo lets down her guard, she just might find what her heart’s wanted all along.","cover":"https://allnovel.net/images/a-ruthless-proposition.jpg","author":"Natasha Anders","type":"Romance","source":"allnovel","link":"https://allnovel.net/a-ruthless-proposition.html","creation":"Oct 5, 2019 8:58:03 AM","modification":"Oct 5, 2019 10:35:51 AM"}}
