{"id":68289,"no":12,"title":"Page 12","content":"eze, France\\n\\n 1924\\n\\n When she was only eight years old, most of the happiness in Teresa De Fosse\u0027s life came from the church. It was like a sacred flame drawing her to its warmth. She visited the Chapelle des Penitents Blancs, and prayed at the cathedral in Monaco and Notre Dame Bon Voyage in Cannes, but most frequently she attended services at the church in eze.\\n\\n Teresa lived in a chateau on a mountain above the medieval village of eze, near Monte Carlo, overlooking the C\u0026ocirc;te d\u0027Azur. The village was perched high on a rock and it seemed to Teresa that she could look down upon the whole world. There was a monastery at the top, with rows of houses cascading down the side of the mountain to the blue Mediterranean below.\\n\\n Monique, a year younger than Teresa, was the beauty in the family. Even when she was a child, one could see that she would grow up to be an exquisite woman. She had fine-boned features, sparkling blue eyes, and an easy self-assurance that suited her looks.\\n\\n Teresa was the ugly duckling. The truth was that the De Fosses were embarrassed by their elder daughter. If Teresa had been conventionally ugly, they might have sent her to a plastic surgeon and had her nose shortened, or her chin brought forward, or her eyes fixed. But the problem was that all of Teresa\u0027s features were just slightly askew. Everything seemed out of place, as though she were a comedienne who had donned her face for laughter.\\n\\n But if God had cheated her in the matter of looks, He had compensated for it by blessing her with a remarkable gift. Teresa had the voice of an angel. It had been noticed the first time she sang in the church choir. The parishioners listened in astonishment to the pure, clear tones that came from the young child. And as Teresa grew older, her voice grew even more beautiful. She was given all the solos to sing in church. There, she felt as though she belonged. But away from church, Teresa was inordinately shy, self-conscious of her appearance.\\n\\n At school it was Monique who had all the friends. Boys and girls alike flocked to her side. They wanted to play with her, be seen with her. She was invited to all the parties. Teresa was invited also, but always as an afterthought, the fulfilling of a social obligation, and Teresa was painfully aware of it.\\n\\n \"Now, Renee. You can\u0027t invite one of the De Fosse children without the other. It would be bad manners.\"\\n\\n Monique was ashamed to have an ugly sister. She felt that it was somehow a reflection on her.\\n\\n Their parents behaved properly toward their elder daughter. They fulfilled their parental duty punctiliously, but it was obvious that it was Monique they adored. The one ingredient that Teresa longed for was missing: love.\\n\\n She was an obedient child, willing and eager to please, a good student who loved music, history, and foreign languages and worked hard in school. Her teachers, the servants, and the townspeople felt sorry for her. As a tradesman said one day when Teresa left his shop, \"God wasn\u0027t paying attention when He made her.\"\\n\\n The only place Teresa found love was in the church. The priest loved her, and Jesus loved her. She went to mass every morning and made the fourteen stations of the cross. Kneeling in the cool, vaulted church, she felt God\u0027s presence. When she sang there, Teresa was filled with a sense of hope, and of expectation. She felt as though something wonderful were about to happen to her. It was the only thing that made her life bearable.\\n\\n Teresa never confided her unhappiness to her parents or her sister, for she did not want to burden them, and she kept to herself the secret of how much God loved her and how much she loved God.\\n\\n Teresa adored her sister. They played together in the estate grounds surrounding their chateau, and she let Monique win the games they played. They went exploring together, down the steep stone steps cut into the mountain to eze Village below, and wandered down the narrow streets of shops to watch the artists in front selling their wares.\\n\\n As the girls grew into their teens, the predictions of the villagers came true. Monique grew more beautiful and the boys came flocking around her, while Teresa had few friends and stayed at home sewing or reading or went shopping in the village.\\n\\n As Teresa passed the drawing room one day, she heard her mother and father having a discussion about her.\\n\\n \"She\u0027s going to be an old maid. We\u0027re going to have her on our hands all our lives.\"\\n\\n \"Teresa will find someone. She has a very sweet disposition.\"\\n\\n \"That\u0027s not what the young men of today are after. They want someone they can enjoy having in their bed.\"\\n\\n Teresa fled.\\n\\n Teresa still sang in church on Sundays, and because of that an event occurred that promised to change her life. In the congregation was a Madame Neff, the aunt of a radio-station director in Nice.\\n\\n She stopped to speak to Teresa one Sunday morning.\\n\\n \"You\u0027re wasting your life here, my dear. You have an extraordinary voice. You should be using it.\"\\n\\n \"I am using it. I - \"\\n\\n \"I\u0027m not talking about\" - she looked around the church - \"this. I\u0027m talking about your using your voice professionally. I pride myself on knowing talent when I hear it. I want you to sing for my nephew. He can put you on the radio. Are you interested?\"\\n\\n \"I - I don\u0027t know.\" The very thought of it terrified Teresa.\\n\\n \"Talk it over with your family.\"\\n\\n \"I think it\u0027s a wonderful idea,\" Teresa\u0027s mother said.\\n\\n \"It could be a good thing for you,\" her father agreed.\\n\\n It was Monique who had reservations about it. \"You\u0027re not a professional,\" she said. \"You could make a fool of yourself.\" Which had nothing to do with Monique\u0027s reasons for trying to discourage her sister. What Monique was afraid of was that Teresa would succeed. Monique was the one who had always been in the limelight. It\u0027s not fair, she thought, that God should have given Teresa a voice like that What if she should become famous? I would be left out, ignored.\\n\\n And so Monique tried to persuade her sister not to audition.\\n\\n But the following Sunday at church, Madame Neff stopped Teresa and said, \"I\u0027ve talked to my nephew. He is willing to give you an audition. He\u0027s expecting you on Wednesday at three o\u0027clock.\"\\n\\n And so it was that the following Wednesday a very nervous Teresa appeared at the radio station in Nice and met the director.\\n\\n \"I\u0027m Louis Bonnet,\" he said curtly. \"I can give you five minutes.\"\\n\\n Teresa\u0027s physical appearance only confirmed his worst fears. His aunt had sent him talent before.\\n\\n I should tell her to stick to her kitchen. But he knew that he would not. The problem was that his aunt was very rich, and he was her only heir.\\n\\n Teresa followed Louis Bonnet down a narrow hallway into a small broadcast studio.\\n\\n \"Have you ever sung professionally?\"\\n\\n \"No, sir.\" Her blouse was soaked with perspiration. Why did I ever let myself get talked into this? Teresa wondered. She was in a panic, ready to flee.\\n\\n Bonnet placed her in front of a microphone. \"I don\u0027t have a piano player around today, so you\u0027re going to have to sing a cappella. Do you know what a cappella means?\"\\n\\n \"Yes, sir.\"\\n\\n \"Wonderful.\" He wondered, not for the first time, if his aunt was rich enough to make all these stupid auditions worthwhile.\\n\\n \"I\u0027ll be in the control booth. You\u0027ll have time for one song.\"\\n\\n \"Sir - what shall I - ?\"\\n\\n He was gone. Teresa was alone in the room staring at the microphone in front of her. She had no idea what she was going to sing. \"Just go and meet him,\" his aunt had said. \"The station has a musical program every Saturday evening and...\"\\n\\n I\u0027ve got to get out of here.\\n\\n Louis\u0027s voice came out of nowhere. \"I don\u0027t have all day.\"\\n\\n \"I\u0027m sorry. I can\u0027t - \"\\n\\n But the director was determined to punish her for wasting his time.\\n\\n \"Just a few notes,\" he insisted. Enough so he could report to his aunt what a fool the girl had made of herself. Perhaps that would persuade her to stop sending him her proteges.\\n\\n \"I\u0027m waiting,\" he said.\\n\\n He leaned back in his chair and lit a Gitane. Four more hours to go. Yvette would be waiting for him. He would have time to stop off at her apartment before he went home to his wife. Maybe there would even be time to -\\n\\n He heard it then, and he could not believe it. It was a voice so pure and so sweet that it sent chills down his spine. It was a voice filled with longing and desire, a voice that sang of loneliness and despair, of lost loves and dead dreams, and it brought tears to his eyes. It stirred emotions in him that he had thought were long since dead. All he could say to himself was, Jesus Christ! Where has she been?\\n\\n An engineer had wandered into the control booth, and he stood there listening, mesmerized. The door was open and others began to come in, drawn by the voice. They stood there silently listening to the poignant sound of a heart desperately crying out for love, and there was not another sound in the room.\\n\\n When the song ended, there was a long silence, and one of the women said, \"Whoever she is, don\u0027t let her get away.\"\\n\\n Louis Bonnet hurried out of the room into the broadcast studio. Teresa was getting ready to leave.\\n\\n \"I\u0027m sorry I took too long. You see, I\u0027ve never - \"\\n\\n \"Sit down, Maria.\"\\n\\n \"Teresa.\"\\n\\n \"Sorry.\" He took a deep breath. \"We do a musical radio broadcast every Saturday night.\"\\n\\n \"I know. I listen to it.\"\\n\\n \"How would you like to be on it?\"\\n\\n She stared at him, unable to believe what she was hearing. \"You mean - you want to hire me?\"\\n\\n \"Beginning this week. We\u0027ll start you at the minimum. It will be a great showcase for you.\"\\n\\n It was almost too good to be true. They\u0027re going to pay me to sing.\\n\\n \"Pay you? How much?\" Monique asked.\\n\\n \"I don\u0027t know. I don\u0027t care.\" The important thing is that somebody wants me, she almost said, but she stopped herself.\\n\\n \"That\u0027s wonderful news. So you\u0027re going to be on the radio!\" her father said.\\n\\n Her mother was already making plans. \"We\u0027ll see that all our friends listen, and we\u0027ll have them send in letters saying how good you are.\"\\n\\n Teresa looked at Monique, waiting for her to say, \"You don\u0027t have to do that. Teresa is good.\"\\n\\n But Monique said nothing. It will blow over quickly, was what she was thinking.\\n\\n She was wrong.\\n\\n Saturday night at the broadcast station, Teresa was in a panic.\\n\\n \"Believe me,\" Louis Bonnet assured her. \"It\u0027s perfectly natural. All artists go through this.\"\\n\\n They were seated in the small green room used by performers.\\n\\n \"You\u0027re going to be a sensation.\"\\n\\n \"I\u0027m going to be sick.\"\\n\\n \"There\u0027s no time. You\u0027re on in two minutes.\"\\n\\n Teresa had rehearsed that afternoon with the small orchestra that was going to accompany her. The rehearsal had been extraordinary. The stage from which they broadcast was crowded with station personnel who had heard about the young girl with the incredible voice. They listened in awed silence as Teresa rehearsed the songs she was going to sing on the air. There was no question in any of their minds but that they were witnessing the birth of an important star.\\n\\n \"It\u0027s too bad she\u0027s not better-looking,\" a stage manager commented, \"but in radio who can tell the difference?\"\\n\\n Teresa\u0027s performance that evening was superb. She was aware that she had never sung better. And who knew where this could lead? She might become famous and have men at her feet, begging her to marry them. As they begged Monique.\\n\\n As though reading her thoughts, Monique said, \"I\u0027m really happy for you, Sis, but don\u0027t let yourself get carried away by all this. These things never last.\"\\n\\n This will, Teresa thought happily. I\u0027m finally a person. I\u0027m somebody.\\n\\n Monday morning, there was a long-distance telephone call for Teresa.\\n\\n \"It\u0027s probably somebody\u0027s idea of a joke,\" her father warned her. \"He says he\u0027s Jacques Raimu.\"\\n\\n The most important stage director in France. Teresa picked up the telephone, wary. \"Hello?\"\\n\\n \"Miss De Fosse?\"\\n\\n \"Yes.\"\\n\\n \"Teresa De Fosse?\"\\n\\n \"Yes.\"\\n\\n \"This is Jacques Raimu. I heard your radio program Saturday night. You\u0027re exactly what I\u0027m looking for.\"\\n\\n \"I - I don\u0027t understand.\"\\n\\n \"I\u0027m staging a play at the Comedie Fran\u0026ccedil;aise, a musical. I start rehearsals next week. I\u0027ve been searching for someone with a voice like yours. To tell you the truth, there is no one with a voice like yours. Who is your agent?\"\\n\\n \"Agent? I - I have no agent.\"\\n\\n \"Then I\u0027ll drive down there and we\u0027ll work out a deal between us.\"\\n\\n \"Monsieur Raimu - I - I\u0027m not very pretty.\" It was painful for her to say the words, but she knew that it was necessary. He mustn\u0027t have any false expectations.\\n\\n He laughed. \"You will be when I get through with you. Theater is make-believe. Stage makeup can do all kinds of incredible magic.\"\\n\\n \"But - \"\\n\\n \"I\u0027ll see you tomorrow.\"\\n\\n It was a dream on top of a fantasy. To be starring in a play by Raimu!\\n\\n \"I\u0027ll work out the contract with him,\" Teresa\u0027s father said. \"You must be careful when you deal with theater people.\"\\n\\n \"We must get you a new dress,\" her mother said. \"And I\u0027ll invite him to dinner.\"\\n\\n Monique said nothing. What was happening was unbearable. It was unthinkable that her sister was going to become a star. Perhaps there was a way...\\n\\n Monique saw to it that she was the first one downstairs when Jacques Raimu arrived at the De Fosse villa that afternoon. He was greeted by a young girl so beautiful that his heart jumped. She was dressed in a simple white afternoon frock that set off her figure to perfection.\\n\\n My God, he thought. Those looks and that voicel She\u0027s perfect She\u0027s going to be an enormous star.\\n\\n \"I can\u0027t tell you how happy I am to meet you,\" Raimu said.\\n\\n Monique smiled warmly. \"I\u0027m very happy to meet you. I\u0027m a big admirer of yours, Monsieur Raimu.\"\\n\\n \"Good. Then we\u0027ll work well together. I brought a script with me. It\u0027s a beautiful love story, and I think - \"\\n\\n At that moment Teresa walked into the room. She was wearing a new dress, but she looked awkward in it. She stopped as she saw Jacques Raimu.\\n\\n \"Oh - hello. I didn\u0027t know you were here. I mean - you\u0027re early.\"\\n\\n He looked at Monique inquiringly.\\n\\n \"This is my sister,\" Monique said. \"Teresa.\"\\n\\n They both watched the expression on his face change. It went from shock to disappointment to disgust.\\n\\n \"You\u0027re the singer?\"\\n\\n \"Yes.\"\\n\\n He turned to Monique. \"And you\u0027re - \"\\n\\n Monique smiled innocently. \"I\u0027m Teresa\u0027s sister.\"\\n\\n Raimu turned to examine Teresa again, then shook his head. \"I\u0027m sorry,\" he said to Teresa. \"You\u0027re too - \" He fumbled for a word. \"You\u0027re too - young. If you\u0027ll excuse me, I must get back to Paris.\"\\n\\n And they stood there watching him walk out the door.\\n\\n It worked, Monique thought jubilantly. It worked.\\n\\n Teresa never made another broadcast. Louis Bonnet pleaded with her to come back, but the hurt was too deep.\\n\\n After looking at my sister, Teresa thought, how could anyone want me? I\u0027m so ugly.\\n\\n As long as she lived, she would never forget the look on Jacques Raimu\u0027s face.\\n\\n It\u0027s my fault for having silly dreams, Teresa told herself. It\u0027s God\u0027s way of punishing me.\\n\\n After that, Teresa would sing only in church, and she became more of a recluse than ever.\\n\\n During the next ten years the beautiful Monique turned down more than a dozen marriage proposals. She was proposed to by the sons of the mayor, the banker, the doctor, the merchants in the village. Her suitors ranged from young men fresh out of school to established and successful men in their forties and fifties. They were rich and poor, handsome and ugly, educated and uneducated. And to all of them Monique said non.\\n\\n \"What are you looking for?\" her father asked, baffled.\\n\\n \"Papa, everyone here is boring. eze is such an unsophisticated place. My dream prince is in Paris.\"\\n\\n And so her father dutifully sent her to Paris. As an afterthought, he sent Teresa with her. The two girls stayed at a small hotel on the Bois de Boulogne.\\n\\n Each sister saw a different Paris. Monique attended charity balls and glamorous dinner parties and had tea with titled young men. Teresa visited Les Invalides and the Louvre. Monique went to the races at Longchamp and to galas at Malmaison. Teresa went to the Cathedral of Notre Dame to pray, and walked along the tree-shaded path of the Canal St. Martin. Monique went to Maxim\u0027s and the Moulin Rouge, while Teresa strolled along the quays, browsing among the book stalls and the flower vendors and stopping at the Basilica of St. Denis. Teresa enjoyed Paris, but as far as Monique was concerned, the trip was a failure.\\n\\n When they returned home, Monique said, \"I can\u0027t find any man I want to marry.\"\\n\\n \"You met no one who interested you?\" her father asked.\\n\\n \"Not really. There was a young man who took me to dinner at Maxim\u0027s. His father owns coal mines.\"\\n\\n \"What was he like?\" her mother asked eagerly.\\n\\n \"Oh, he was rich, handsome, polite, and he adored me.\"\\n\\n \"Did he ask you to marry him?\"\\n\\n \"Every ten minutes. Finally I simply refused to see him again.\"\\n\\n Her mother stared at Monique in amazement. \"Why?\"\\n\\n \"Because all he could talk about was coal: bituminous coal, lump coal, black coal, gray coal. Boring, boring, boring.\"\\n\\n The following year Monique decided she wanted to return to Paris again.\\n\\n \"I\u0027ll pack my things,\" Teresa said.\\n\\n Monique shook her head. \"No. This time I think I\u0027ll go alone.\"\\n\\n So while Monique went to Paris, Teresa stayed home and went to church every morning and prayed that her sister would find a handsome prince. And one day the miracle occurred. A miracle because it was to Teresa that it happened. His name was Raoul Giradot.\\n\\n He had gone to Teresa\u0027s church one Sunday and heard her sing. He had never heard anything like it before. I must meet her, he vowed.\\n\\n Early Monday morning, Teresa stopped in at the village general store to buy fabric for a dress she was making. Raoul Giradot was working behind the counter.\\n\\n He looked up as Teresa walked in, and his face lit up. \"The voice!\"\\n\\n She stared at him, flustered. \"I - I beg your pardon?\"\\n\\n \"I heard you sing in church yesterday. You are magnificent.\"\\n\\n He was handsome and tall, with intelligent, flashing dark eyes and lovely, sensual lips. He was in his early thirties, a year or two older than Teresa.\\n\\n Teresa was so taken aback by his appearance that she could only stammer. She stared at him, her heart pounding. \"Th - thank you,\" Teresa said. \"I - I - I would like three yards of muslin, please.\"\\n\\n Raoul smiled. \"It will be my pleasure. This way.\"\\n\\n It was suddenly difficult for Teresa to concentrate on her errand. She was overpoweringly aware of the young man\u0027s presence, his good looks and charm, the masculine aura surrounding him.\\n\\n When Teresa had decided on her purchase and Raoul was wrapping it for her, she dared to say, \"You\u0027re - you\u0027re new here, aren\u0027t you?\"\\n\\n He looked at her and smiled, and it sent shivers through her.\\n\\n \"Oui. I arrived in eze a few days ago. My aunt owns this shop and she needed help, so I thought I would work here for a while.\\n\\n How long is a while? Teresa found herself wondering.\\n\\n \"You should be singing professionally,\" Raoul told her.\\n\\n She remembered the expression on Raimu\u0027s face when he had seen her. No, she would never risk exposing herself publicly again. \"Thank you,\" Teresa mumbled.\\n\\n He was touched by her embarrassment and shyness, and tried to draw her into conversation.\\n\\n \"I haven\u0027t been to eze before. It\u0027s a beautiful little town.\"\\n\\n \"Yes,\" Teresa mumbled.\\n\\n \"Were you born here?\"\\n\\n \"Yes.\"\\n\\n \"Do you like it?\"\\n\\n \"Yes.\"\\n\\n Teresa picked up her package and fled.\\n\\n The following day she found an excuse to go back to the shop again. She had stayed up half the night preparing what she was going to say to Raoul.\\n\\n I\u0027m glad you like eze...\\n\\n The monastery was built in the fourteenth century, you know...\\n\\n Have you ever visited Saint-Paul-de-Vence? There\u0027s a lovely chapel there....\\n\\n I enjoy Monte Carlo, don\u0027t you? It\u0027s wonderful to have it so close to here. Sometimes my sister and I drive down the Grande Corniche and go to the Fort Antoine Theatre. Do you know it? It\u0027s the big open-air theater...\\n\\n Did you know that Nice was once called Nikaia? Oh, you didn\u0027t? Yes, it was. The Greeks were there a long time ago. There\u0027s a museum in Nice with the remains of cavemen who lived there thousands of years ago. Isn\u0027t that interesting?\\n\\n Teresa was prepared with dozens of such verbal gambits. Unfortunately, the moment she walked into the shop and saw Raoul, everything flew out of her head. She simply stared at him, unable to speak.\\n\\n \"Bonjour,\" Raoul said cheerfully. \"It\u0027s nice to see you again, Mademoiselle De Fosse.\"\\n\\n \"M - merci.\" She felt like an idiot. I\u0027m thirty years old, she told herself, and I\u0027m acting like a silly schoolgirl Stop it\\n\\n But she could not stop it.\\n\\n \"And what may I do for you today?\"\\n\\n \"I - I need more muslin.\"\\n\\n Which was the last thing she needed.\\n\\n She watched Raoul as he went to get the bolt of fabric. He set it on the counter and started to measure it out.\\n\\n \"How many yards would you like?\"\\n\\n She started to say two, but what came out was, \"Are you married?\"\\n\\n He looked up at her with a warm smile on his face. \"No,\" he said. \"I haven\u0027t been that fortunate yet.\"\\n\\n You are going to be, Teresa thought. As soon as Monique returns from Paris.\\n\\n Monique was going to adore this man. They were perfect for each other. The thought of Monique\u0027s reaction when she met Raoul filled Teresa with happiness. It would be lovely to have Raoul Giradot as her brother-in-law.\\n\\n The following day as Teresa was passing the shop, Raoul caught sight of her and hurried outside.\\n\\n \"Good afternoon, mademoiselle. I was about to take a break. If you\u0027re free, would you care to join me for tea?\"\\n\\n \"I - I - yes, thank you.\"\\n\\n She was tongue-tied in his presence, and yet Raoul could not have been more pleasant. He did everything he could to put her at ease, and soon Teresa found herself telling this stranger things she had never told anyone before. They talked of loneliness.\\n\\n \"Crowds can make one lonely,\" Teresa said. \"I always feel like an island in a sea of people.\"\\n\\n He smiled. \"I understand.\"\\n\\n \"Oh, but you must have so many friends.\"\\n\\n \"Acquaintances. In the end, does anyone really have many friends?\"\\n\\n It was as though she were speaking to a mirror image. The hour melted away quickly, and soon it was time for him to go back to work.\\n\\n As they rose, Raoul asked, \"Will you join me for lunch tomorrow?\"\\n\\n He was being kind, of course. Teresa knew that no man could ever be attracted to her. Especially someone as wonderful as Raoul Giradot. She was sure that he was kind to everyone.\\n\\n \"I would enjoy that,\" Teresa said.\\n\\n When she went to meet Raoul the following day, he said boyishly, \"I\u0027ve been given the afternoon off. If you\u0027re not too busy, why don\u0027t we drive down to Nice?\"\\n\\n They drove along the Moyenne Corniche with his car top down, the city spread out like a magic carpet below them. Teresa leaned back in her seat and thought: I\u0027ve never been so happy. And then, filled with guilt: I\u0027m being happy for Monique.\\n\\n Monique was to return from Paris the following day. Raoul would be Teresa\u0027s gift to her sister. She was realistic enough to know that the Raouls of the world were not for her. Teresa had had enough pain in her life, and she had long since learned what was real and what was impossible. The handsome man seated beside her driving the car was an impossible dream she dared not even let herself think about.\\n\\n They had lunch at Le Chantecler in the Negresco Hotel in Nice. It was a superb meal, but afterward Teresa had no recollection of what she had eaten. It seemed to her that she and Raoul had not stopped talking. They had so much to say to each other. He was witty and charming, and he appeared to find Teresa interesting - really interesting. He asked her opinion about many things and listened attentively to her answers. They agreed on almost everything. It was as though they were soul mates. If Teresa had any regrets about what was about to happen, she resolutely forced them out of her mind.\\n\\n \"Would you like to come to dinner at the chateau tomorrow night? My sister is returning from Paris. I would like you to meet her.\"\\n\\n \"I\u0027d be delighted, Teresa.\"\\n\\n When Monique returned home the following day, Teresa hurried to greet her at the door.\\n\\n In spite of her resolve, she could not help asking, \"Did you meet anyone interesting in Paris?\" And she held her breath, waiting for her sister\u0027s answer.\\n\\n \"The same boring men,\" Monique replied.\\n\\n So God had made the final decision.\\n\\n \"I\u0027ve invited someone to dinner tonight,\" Teresa said. \"I think you\u0027re going to like him.\"\\n\\n I must never let anyone know how much I care for him, Teresa thought.\\n\\n That evening at seven-thirty promptly, the butler ushered Raoul Giradot into the drawing room, where Teresa, Monique, and their parents were waiting.\\n\\n \"This is my mother and father. Monsieur Raoul Giradot.\"\\n\\n \"How do you do?\"\\n\\n Teresa took a deep breath. \"And my sister, Monique.\"\\n\\n \"How do you do?\" Monique\u0027s expression was polite, nothing more.\\n\\n Teresa looked at Raoul, expecting him to be stunned by Monique\u0027s beauty.\\n\\n \"Enchanted.\" Merely courteous.\\n\\n Teresa stood there holding her breath, waiting for the sparks that she knew would start flying between them. But Raoul was looking at Teresa.\\n\\n \"You look lovely tonight, Teresa.\"\\n\\n She blushed and stammered, \"Th - thank you.\"\\n\\n Everything about that evening was topsy-turvy. Teresa\u0027s plan to bring Monique and Raoul together, to watch them get married, to have Raoul as a brother-in-law - none of it even began to happen. Incredibly, Raoul\u0027s attention was focused entirely on Teresa. It was like some impossible dream come true. She felt like Cinderella, only she was the ugly sister and the prince had chosen her. It was unreal, but it was happening, and Teresa found herself struggling to resist Raoul and his charm because she knew that it was too good to be true, and she dreaded being hurt again. All these years she had hidden her emotions, guarding against the pain that came with rejection. Now, instinctively, she tried to do the same. But Raoul was irresistible.\\n\\n \"I heard your daughter sing,\" Raoul said. \"She is a miracle!\"\\n\\n Teresa found herself blushing.\\n\\n \"Everyone loves Teresa\u0027s voice,\" Monique said sweetly.\\n\\n It was a heady evening. But the best was yet to come.\\n\\n When dinner was finished, Raoul said to Teresa\u0027s parents, \"Your grounds look lovely.\" Then he turned to Teresa. \"Would you show me the gardens?\"\\n\\n Teresa looked over at Monique, trying to read her sister\u0027s emotions, but Monique seemed completely indifferent.\\n\\n She must be deaf, dumb, and blind, Teresa thought.\\n\\n And then she recalled all the times Monique had gone to Paris and Cannes and St. Tropez looking for her perfect prince but had never found him.\\n\\n So it\u0027s not the fault of the men. It\u0027s the fault of my sister. She has no idea what she wants.\\n\\n Teresa turned to Raoul. \"I would love to.\"\\n\\n Outside, she could not let the subject drop.\\n\\n \"How did you like Monique?\"\\n\\n \"She seems very nice,\" Raoul replied. \"Ask me how I like her sister.\"\\n\\n And he took her in his arms and kissed her.\\n\\n It was like nothing Teresa had ever experienced before. She trembled in his arms, and she thought: Thank you, God. Oh, thank you.\\n\\n \"Will you have dinner with me tomorrow night?\" Raoul asked.\\n\\n \"Yes,\" Teresa breathed. \"Oh, yes.\"\\n\\n When the two sisters were alone, Monique said, \"He really seems to like you.\"\\n\\n \"I think so,\" Teresa said shyly.\\n\\n \"Do you like him?\"\\n\\n \"Yes.\"\\n\\n \"Well, be careful, big sister,\" Monique laughed. \"Don\u0027t get in over your head.\"\\n\\n Too late, Teresa thought helplessly. Too late.\\n\\n Teresa and Raoul were together every day after that. Monique usually chaperoned them. The three of them walked along the promenades and beaches at Nice and laughed at the wedding-cake hotels. They lunched at a charming bistro at Cap d\u0027Antibes, and visited the Matisse chapel in Vence. They dined at the Chateau de la Chevre d\u0027Or, and at the fabulous La Ferme St. Michel. One morning at five A.M. the three of them went to the open farmer\u0027s market that filled the streets of Monte Carlo and bought fresh breads and vegetables and fruit.\\n\\n Sundays, when Teresa sang in church, Raoul and Monique were there to listen, and afterward Raoul would hug Teresa and say, \"You really are a miracle. I could listen to you sing for the rest of my life.\"\\n\\n Four weeks after they met, Raoul proposed.\\n\\n \"I\u0027m sure you could have any man you want, Teresa,\" Raoul said, \"but I would be honored if you chose me.\"\\n\\n For one terrible moment Teresa thought he was ridiculing her, but before she could speak, he went on.\\n\\n \"My darling, I must tell you that I have known many women, but you are the most sensitive, the most talented, the warmest...\"\\n\\n Each word was music to Teresa\u0027s ears. She wanted to laugh; she wanted to cry. How blessed I am, she thought, to love and be loved.\\n\\n \"Will you marry me?\"\\n\\n And her look was answer enough.\\n\\n When Raoul left, Teresa went flying into the library where her sister, mother, and father were having coffee.\\n\\n \"Raoul asked me to marry him.\" Her face was glowing, and there was almost a beauty about her.\\n\\n Her parents stared at her, stunned. It was Monique who spoke.\\n\\n \"Teresa, are you sure he\u0027s not after the family money?\"\\n\\n It was like a slap in the face.\\n\\n \"I don\u0027t mean that unkindly,\" Monique went on, \"but it all seems to be happening so fast.\"\\n\\n Teresa was determined not to let anything spoil her happiness. \"I know you want to protect me,\" she told her sister, \"but Raoul has money. His father left him a small inheritance, and he\u0027s not afraid to work for a living.\" She took her sister\u0027s hand in hers and begged, \"Please be glad for me, Monique. I never thought I\u0027d know this feeling. I\u0027m so happy, I could die.\"\\n\\n And then the three of them embraced her and told her how pleased they were for her, and they began to talk excitedly about plans for the wedding.\\n\\n Very early the next morning Teresa went to church and knelt to pray.\\n\\n Thank You, Father. Thank You for giving me such happiness. I will do everything to make myself worthy of Your love and of Raoul\u0027s. Amen.\\n\\n Teresa walked into the general store, her feet above the ground, and said, \"If you please, sir, I would like to order some material for a wedding gown.\"\\n\\n Raoul laughed and took her in his arms. \"You\u0027re going to make a beautiful bride.\"\\n\\n And Teresa knew he meant it. That was the miracle.\\n\\n The wedding was set to take place a month later in the village church. Monique, of course, was to be the maid of honor.\\n\\n At five o\u0027clock Friday afternoon, Teresa spoke to Raoul for the last time. At twelve-thirty Saturday, standing in the church vestry waiting for Raoul, who was thirty minutes late, Teresa was approached by the priest. He took her arm and led her aside, and she wondered at his agitation. Her heart began to pound.\\n\\n \"What is it? Is something wrong? Has anything happened to Raoul?\"\\n\\n \"Oh, my dear,\" the priest said. \"My poor, dear Teresa.\"\\n\\n She was beginning to panic. \"What is it, Father? Tell me!\"\\n\\n \"I - I just received word a moment ago. Raoul - \"\\n\\n \"Is it an accident? Was he hurt?\"\\n\\n \" - Giradot left town early this morning.\"\\n\\n \"He what? Then some emergency must have come up to make him - \"\\n\\n \"He left with your sister. They were seen taking the train to Paris.\"\\n\\n The room began to whirl. No, Teresa thought. I mustn\u0027t faint. I mustn\u0027t embarrass myself in front of God.\\n\\n She had only a hazy memory of the events that followed. From a far distance she heard the priest make an announcement to the wedding party, and she dimly heard the uproar in the church.\\n\\n Teresa\u0027s mother put her arms around her daughter and said, \"My poor Teresa. That your own sister could be so cruel. I\u0027m so sorry.\"\\n\\n But Teresa was suddenly calm. She knew how to make everything all right.\\n\\n \"Don\u0027t worry, Mama. I don\u0027t blame Raoul for falling in love with Monique. Any man would. I should have known that no man could ever love me.\"\\n\\n \"You\u0027re wrong,\" her father cried. \"You\u0027re worth ten of Monique.\"\\n\\n But his compassion came years too late.\\n\\n \"I would like to go home now, please.\"\\n\\n They made their way through the crowd. The guests at the church moved aside to let them pass, staring silently after them.\\n\\n When they returned to the chateau, Teresa said quietly, \"Please don\u0027t worry about me. I promise you that everything is going to be fine.\"\\n\\n Then she went up to her father\u0027s room, took out his razor, and slashed her wrists. \\n\\n","sourceLink":"https://allnovel.net/the-sands-of-time/page-12.html","bookId":2361,"book":{"id":2361,"title":"The Sands of Time","description":"Storyline: Four nuns find themselves suddenly thrust into a hostile world they long ago abandoned for the safety of the convent. nwittingly they become pawns in a battle between the charismatic Jaime Miró, leader of the outlawed Basque nationalists, and the ruthless Colonel Ramón Acoca of the Spanish Amy. \\n Four women - and the men they are forbidden to love. \\n Megan - the orphan, who feels an overpowering attraction to Jaime. \\n Lucia - the fiery Sicilian beauty on the run for murder - and Rubio Arzano, the freedom fighter who risks his life to save her. \\n Teresa - whose guilty conscience finally drives her to betray her friends. \\n Graciela - who bears a terrible secret thet almost destroys her - and the courageous Ricardo who loves her.\\n","cover":"https://allnovel.net/images/the-sands-of-time.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sands-of-time.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:08:20 AM"}}
