{"id":68303,"no":26,"title":"Page 26","content":"The news media were in a feeding frenzy. The headlines tumbled over one another. There was the attack on the convent, the wholesale arrest of the nuns for sheltering terrorists, the escape of four nuns, the shooting of five soldiers by one of the nuns before she was shot and killed. The international news wires were on fire.\\n\\n Reporters had arrived in Madrid from all over the world, and Prime Minister Leopoldo Martinez, in an effort to cool things down, had agreed to a press conference. Almost four dozen reporters from all over the world were gathered in his office. Colonels Ramon Acoca and Fal Sostelo were at his side. The prime minister had seen that afternoon\u0027s headline in the London Times: TERRORISTS AND NUNS EVADE SPAIN\u0027S ARMY AND POLICE.\\n\\n A reporter from Paris Match was asking, \"Mr. Prime Minister, do you have any idea where the missing nuns are now?\"\\n\\n Prime Minister Martinez replied, \"Colonel Acoca is in charge of the search operation. I will let him answer that.\"\\n\\n Acoca said, \"We have reason to believe that they are in the hands of the Basque terrorists. I\u0027m also sorry to say there is evidence to indicate that the nuns are collaborating with the terrorists.\"\\n\\n The reporters were scribbling feverishly.\\n\\n \"What about the shooting of Sister Teresa and the soldiers?\"\\n\\n \"We have information that Sister Teresa was working with Jaime Miro. Under the pretext of helping us find Miro, she went into an army camp and shot five soldiers before she could be stopped. I can assure you that the army and the GOE are bending every effort to bring the criminals to justice.\"\\n\\n \"And the nuns who were arrested and taken to Madrid?\"\\n\\n \"They are being interrogated,\" Acoca said.\\n\\n The prime minister was anxious to end the meeting. It was difficult for him to keep his temper in check. The failure to locate the nuns or capture the terrorists made his government - and himself - look inept and foolish, and the press was taking full advantage of the situation.\\n\\n \"Can you tell us anything about the backgrounds of the four nuns who escaped, Prime Minister?\" asked a reporter from Oggi.\\n\\n \"I\u0027m sorry. I can give you no further information. I repeat, ladies and gentlemen, the government is doing everything in its power to find the nuns.\"\\n\\n \"Prime Minister, there have been reports about the brutality of the attack on the convent at avila. Would you respond to that?\"\\n\\n It was a sore point with Martinez because it was true. Colonel Acoca had grossly exceeded his authority. But he would deal with the colonel later. This was the time for a show of unity.\\n\\n He turned to the colonel and said smoothly, \"Colonel Acoca can respond to that.\"\\n\\n Acoca said, \"I too have heard those unfounded reports. The facts are simple. We received reliable information that the terrorist Jaime Miro and a dozen of his men were hiding in the Cistercian convent and that they were heavily armed. By the time we raided the convent, they had fled.\"\\n\\n \"Colonel, we heard that some of your men molested - \"\\n\\n \"That is an outrageous accusation.\"\\n\\n Prime Minister Martinez said, \"Thank you, ladies and gentlemen. That will be all. You will be informed of any further developments.\"\\n\\n When the reporters had left, the prime minister turned to Colonels Acoca and Sostelo. \"They\u0027re making us look like savages in the eyes of the world.\"\\n\\n Acoca had not the slightest interest in the prime minister\u0027s opinion. What concerned him was a telephone call he had received in the middle of the night.\\n\\n \"Colonel Acoca?\"\\n\\n It was a voice he was all too familiar with. He was instantly wide awake.\\n\\n \"Yes, sir.\"\\n\\n \"We\u0027re disappointed in you. We had hoped to see some results before this.\"\\n\\n \"Sir, I\u0027m closing in on them.\" He found that he was perspiring heavily. \"I ask that you be a little more patient. I won\u0027t disappoint you.\" He held his breath, waiting for a response.\\n\\n \"You\u0027re running out of time.\"\\n\\n The line went dead.\\n\\n Colonel Acoca replaced the receiver and sat there, frustrated. Where is that bastard Miro? \\n\\n","sourceLink":"https://allnovel.net/the-sands-of-time/page-26.html","bookId":2361,"book":{"id":2361,"title":"The Sands of Time","description":"Storyline: Four nuns find themselves suddenly thrust into a hostile world they long ago abandoned for the safety of the convent. nwittingly they become pawns in a battle between the charismatic Jaime Miró, leader of the outlawed Basque nationalists, and the ruthless Colonel Ramón Acoca of the Spanish Amy. \\n Four women - and the men they are forbidden to love. \\n Megan - the orphan, who feels an overpowering attraction to Jaime. \\n Lucia - the fiery Sicilian beauty on the run for murder - and Rubio Arzano, the freedom fighter who risks his life to save her. \\n Teresa - whose guilty conscience finally drives her to betray her friends. \\n Graciela - who bears a terrible secret thet almost destroys her - and the courageous Ricardo who loves her.\\n","cover":"https://allnovel.net/images/the-sands-of-time.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sands-of-time.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:08:20 AM"}}
