{"id":68281,"no":4,"title":"Page 4","content":"avila\\n\\n The silence was like a gentle snowfall, soft and hushed, as soothing as the whisper of a summer wind, as quiet as the passage of stars. The Cistercian Convent of the Strict Observance lay outside the walled town of avila, the highest city in Spain, 112 kilometers northwest of Madrid. The convent had been built for silence. The rules had been adopted in 1601 and remained unchanged through the centuries: liturgy, spiritual exercise, strict enclosure, penance, and silence. Always the silence.\\n\\n The convent was a simple four-sided group of rough stone buildings around a cloister dominated by the church. Around the central court the open arches allowed the light to pour in on the broad flagstones of the floor where the nuns glided noiselessly by. There were forty nuns at the convent, praying in the church, and living in the cloister. The convent at avila was one of seven left in Spain, a survivor out of hundreds that had been destroyed by the Civil War in one of the periodic anti-Church movements that took place in Spain over the centuries.\\n\\n The Cistercian Convent of the Strict Observance was devoted solely to a life of prayer. It was a place without seasons or time, and those who entered were forever removed from the outside world. The Cistercian life was contemplative and penitential; the divine office was recited daily and enclosure was complete and permanent.\\n\\n All the sisters dressed identically, and their clothes, like everything else in the convent, were touched by the symbolism of centuries. The capuche - the cloak and hood - symbolized innocence and simplicity; the linen tunic, the renouncement of the works of the world, and mortification; the scapular - the small squares of woolen cloth worn over the shoulders - the willingness to labor. A wimple - a covering of linen laid in plaits over the head and around the chin, sides of the face, and neck - completed the uniform.\\n\\n Inside the walls of the convent was a system of internal passageways and staircases linking the dining room, the community room, the cells, and the chapel, and everywhere there was an atmosphere of cold, clean spaciousness. Thick-paned latticed windows overlooked a highwalled garden. Every window was covered with iron bars and was above the line of vision, so that there would be no outside distractions. The refectory - the dining hall - was long and austere, its windows shuttered and curtained. The candles in the ancient candlesticks cast evocative shadows on the ceilings and walls.\\n\\n In four hundred years, nothing inside the walls of the convent had changed, except the faces. The sisters had no personal possessions, for they desired to be poor, emulating the poverty of Christ. The church itself was bare of ornaments, save for a priceless solid-gold cross that had been a long-ago gift from a wealthy postulant. Because it was so out of keeping with the austerity of the order, it was kept hidden away in a cabinet in the refectory. A plain wooden cross hung at the altar of the church.\\n\\n The women who shared their lives with the Lord lived together, worked together, ate together, and prayed together, yet they never touched and never spoke. The only exceptions permitted were when they heard mass or when the Reverend Mother Prioress Betina addressed them in the privacy of her office. Even then, an ancient sign language was used as much as possible.\\n\\n The Reverend Mother was a religeuse in her seventies, a brightfaced robin of a woman, cheerful and energetic, who gloried in the peace and joy of convent life, and of a life devoted to God. Fiercely protective of her nuns, she felt more pain when it was necessary to enforce discipline than did the one being punished.\\n\\n The nuns walked through the cloisters and corridors with downcast eyes, hands folded in their sleeves at breast level, passing and repassing their sisters without a word or sign of recognition. The only voice of the convent was its bells - the bells that Victor Hugo called \"the opera of the steeples.\"\\n\\n The sisters came from disparate backgrounds and from many different countries. Their families were aristocrats, farmers, soldiers...They had come to the convent as rich and poor, educated and ignorant, miserable and exalted, but now they were one in the eyes of God, united in their desire for eternal marriage to Jesus.\\n\\n The living conditions in the convent were Spartan. In winter the cold was knifing, and a chill, pale light filtered in through leaded windows. The nuns slept fully dressed on pallets of straw, covered with rough woolen sheets. Each had her own tiny cell, furnished only with the pallet and a straight-backed wooden chair. There was no washstand. A small earthen jug and basin stood in a corner on the floor. No nun was ever permitted to enter the cell of another, except for the Reverend Mother Betina. There was no recreation of any kind, only work and prayers. There were work areas for knitting, book binding, weaving, and making bread. There were eight hours of prayer each day: Matins, Lauds, Prime, Terce, Sext, None, Vespers, and Compline. Besides these there were other devotions: benedictions, hymns, and litanies.\\n\\n Matins were said when half the world was asleep and the other half was absorbed in sin.\\n\\n Lauds, the office of daybreak, followed Matins, and the rising sun was hailed as the figure of Christ triumphant and glorified.\\n\\n Prime was the church\u0027s morning prayer, asking for the blessings on the work of the day.\\n\\n Terce was at nine o\u0027clock in the morning, consecrated by St. Augustine to the Holy Spirit.\\n\\n Sext was at eleven-thirty A.M., evoked to quench the heat of human passions.\\n\\n None was silently recited at three o\u0027clock in the afternoon, the hour of Christ\u0027s death.\\n\\n Vespers was the evening service of the church, as Lauds was her daybreak prayer.\\n\\n Compline was the completion of the Little Hours of the day. A form of night prayers, a preparation for death as well as sleep, ending the day on a note of loving submission: Manus tuas, domine, commendo spiritum meum. Redemisti nos, domine, deus, veritatis.\\n\\n In some of the other orders, flagellation had been stopped, but in the cloistered Cistercian convents and monasteries it survived. At least once a week, and sometimes every day, the nuns punished their bodies with the Discipline, a twelve-inch-long whip of thin waxed cord with six knotted tails that brought agonizing pain; it was used to lash the back, legs, and buttocks. Bernard of Clairvaux, the ascetic abbot of the Cistercians, had admonished: \"The body of Christ is crushed...our bodies must be conformed to the likeness of our Lord\u0027s wounded body.\"\\n\\n It was a life more austere than in any prison, yet the inmates lived in an ecstasy such as they had never known in the outside world. They had renounced physical love, possessions, and freedom of choice, but in giving up those things they had also renounced greed and competition, hatred and envy, and all the pressures and temptations that the outside world imposed. Inside the convent reigned an all-pervading peace and the ineffable sense of joy at being one with God. There was an indescribable serenity within the walls of the convent and in the hearts of those who lived there. If the convent was a prison, it was a prison in God\u0027s Eden, with the knowledge of a happy eternity for those who had freely chosen to be there and to remain there.\\n\\n Sister Lucia was awakened by the tolling of the convent bell. She opened her eyes, startled and disoriented for an instant. The little cell she slept in was dismally black. The sound of the bell told her that it was three A.M., when the office of vigils began, while the world outside was still in darkness.\\n\\n Shit! This routine is going to kill me, Sister Lucia thought.\\n\\n She lay back on her tiny, uncomfortable cot, desperate for a cigarette. Reluctantly, she dragged herself out of bed. The heavy habit she wore and slept in rubbed against her sensitive skin like sandpaper. She thought of all the beautiful designer gowns hanging in her apartment in Rome and at her chalet in Gstaad.\\n\\n From outside her cell Sister Lucia could hear the soft, swishing movement of the nuns as they gathered in the hallway. Carelessly, she made up her bed and stepped out into the long hall, where the nuns were lining up, eyes downcast. Slowly, they all began to move toward the chapel.\\n\\n They look like a bunch of silly penguins, Sister Lucia thought. It was beyond her comprehension why these women had deliberately thrown away their lives, giving up sex, pretty clothes, and gourmet food. Without those things, what reason is there to go on living? And the goddamned rules!\\n\\n When Sister Lucia had first entered the convent, the Reverend Mother had said to her, \"You must walk with your head bowed. Keep your hands folded under your habit. Take short steps. Walk slowly. You must never make eye contact with any of the other sisters, or even glance at them. You may not speak. Your ears are to hear only God\u0027s words.\"\\n\\n \"Yes, Reverend Mother.\"\\n\\n For the next month Lucia took instruction.\\n\\n \"Those who come here come not to join others, but to dwell alone with God. Solitude of spirit is essential to a union with God. It is safeguarded by the rules of silence.\"\\n\\n \"Yes, Reverend Mother.\"\\n\\n \"You must always obey the silence of the eyes. Looking into the eyes of others would distract you with useless images.\"\\n\\n \"Yes, Reverend Mother.\"\\n\\n \"The first lesson you will learn here will be to rectify the past, to purge out old habits and worldly inclinations, to blot out every image of the past. You will do purifying penance and mortification to strip yourself of self-will and self-love. It is not enough for us to be sorry for our past offenses. Once we discover the infinite beauty and holiness of God, we want to make up not only for our own sins, but for every sin that has ever been committed.\"\\n\\n \"Yes, Holy Mother.\"\\n\\n \"You must struggle with sensuality, what John of the Cross called \u0027the night of the senses.\u0027\"\\n\\n \"Yes, Holy Mother.\"\\n\\n \"Each nun lives in silence and in solitude, as though she were already in heaven. In this pure, precious silence for which she hungers, she is able to listen to the infinite silence and possess God.\"\\n\\n At the end of the first month, Lucia took her initial vows. On the day of the ceremony she had her hair shorn. It was a traumatic expertence. The Reverend Mother Prioress performed the act herself. She summoned Lucia into her office and motioned for her to sit down. She then stepped behind her, and before Lucia knew what was happening, she heard the snip of scissors and felt something tugging at her hair. She started to protest, but she suddenly realized that what was happening could only improve her disguise. I can always let it grow back later, Lucia thought. Meanwhile, I\u0027m going to look like a plucked chicken.\\n\\n When Lucia returned to the grim cubicle she had been assigned, she thought: This place is a snake pit. The floor consisted of bare boards. The pallet and the hard-backed chair took up most of the room. She was desperate to get hold of a newspaper. Fat chance, she thought. Here they had never heard of newspapers, let alone radio or television. There were no links to the outside world at all.\\n\\n But what got on Lucia\u0027s nerves most was the unnatural silence. The only communication was through hand signals, and learning those drove her crazy. When she needed a broom, she was taught to move her outstretched right hand from right to left, as though sweeping. When the Reverend Mother was displeased, she brought together the tips of her little fingers three times in front of her body, the other fingers pressing into her palms. When Lucia was slow in doing her work, the Reverend Mother pressed the palm of her right hand against her left shoulder. To reprimand Lucia, she scratched her own cheek near her right ear with all the fingers of her right hand in a downward motion.\\n\\n For Christ\u0027s sake, Lucia thought, it looks like she\u0027s scratching a flea bite.\\n\\n They had reached the chapel. The nuns prayed silently, but Sister Lucia\u0027s thoughts were on more important things than God.\\n\\n In another month or two, when the police stop looking for me, I\u0027ll be out of this nuthouse.\\n\\n After morning prayers, Sister Lucia marched with the others to the dining room, surreptitiously breaking the rule, as she did every day, by studying their faces. It was her only entertainment. She found it incredible to think that none of the sisters knew what the others looked like.\\n\\n She was fascinated by the faces of the nuns. Some were old, some were young, some pretty, some ugly. She could not understand why they all seemed so happy. There were three faces that Lucia found particularly interesting. One was Sister Teresa, a woman who appeared to be in her sixties. She was far from beautiful, and yet there was a spirituality about her that gave her an almost unearthly loveliness. She seemed always to be smiling inwardly, as though she carried some wonderful secret within herself.\\n\\n Another nun that Lucia found fascinating was Sister Graciela. She was a stunningly beautiful woman in her early thirties. She had olive skin, exquisite features, and eyes that were luminous black pools.\\n\\n She could have been a movie star, Lucia thought. What\u0027s her story? Why would she bury herself in a joint like this?\\n\\n The third nun that captured Lucia\u0027s interest was Sister Megan. Blue eyes, blond eyebrows and lashes. She was in her late twenties and had a fresh, open-faced look.\\n\\n What is she doing here? What are any of these women doing here? They\u0027re locked up behind these walls, given a tiny cell to sleep in, rotten food eight hours of prayers, hard work, and too little sleep. They have to be pazzo - all of them.\\n\\n She was better off than they were, because they were stuck here for the rest of their lives while she would be out of here in a month or two. Maybe three, Lucia thought. This is a perfect hiding place. I\u0027d be a fool to rush away. In a few months, the police will stop looking for me. When I leave here and get my money out of Switzerland, maybe I\u0027ll write a book about this crazy place.\\n\\n A few days earlier, Sister Lucia had been sent by the Reverend Mother to the office to retrieve a paper, and while there she had taken the opportunity to start looking through the files. Unfortunately, she had been caught in the act of snooping.\\n\\n \"You will do penance by using the Discipline,\" the Mother Prioress Betina signaled her.\\n\\n Sister Lucia bowed her head meekly and signaled, \"Yes, Holy Mother.\"\\n\\n Lucia returned to her cell, and minutes later the nuns walking through the corridor heard the awful sound of the whip as it whistled through the air and fell again and again. What they could not know was that Sister Lucia was whipping the bed.\\n\\n These fruitcakes may be into S and M, but not yours truly.\\n\\n They were seated in the refectory, forty nuns at two long tables. The Cistercian diet was strictly vegetarian. Because the body craved meat, it was forbidden. Long before dawn, a cup of tea or coffee and a few ounces of dry bread were served. The principal meal was taken at eleven A.M., and consisted of a thin soup, a few vegetables, and occasionally a piece of fruit.\\n\\n The Reverend Mother had instructed Lucia, \"We are not here to please our bodies, but to please God.\"\\n\\n I wouldn\u0027t feed this breakfast to my cat, Sister Lucia thought. I\u0027ve been here two months, and I\u0027ll bet I\u0027ve lost ten pounds. It\u0027s God\u0027s version of a fat farm.\\n\\n When breakfast was over, two nuns brought dishpans to each end of the table and set them down. The sisters seated about the table sent their plates to the sister who had the dishpan. She washed each plate, dried it on a towel, and returned it to its owner. The water got darker and greasier.\\n\\n And they\u0027re going to live like this for the rest of their lives, Sister Lucia thought disgustedly. Oh, well I can\u0027t complain. This sure as hell beats a life sentence in prison.\\n\\n She would have given her immortal soul for a cigarette.\\n\\n Five hundred yards down the road, Colonel Ramon Acoca and two dozen carefully selected men from the GOE, the Grupa de Operaciones Especiales, were preparing to attack the convent. \\n\\n","sourceLink":"https://allnovel.net/the-sands-of-time/page-4.html","bookId":2361,"book":{"id":2361,"title":"The Sands of Time","description":"Storyline: Four nuns find themselves suddenly thrust into a hostile world they long ago abandoned for the safety of the convent. nwittingly they become pawns in a battle between the charismatic Jaime Miró, leader of the outlawed Basque nationalists, and the ruthless Colonel Ramón Acoca of the Spanish Amy. \\n Four women - and the men they are forbidden to love. \\n Megan - the orphan, who feels an overpowering attraction to Jaime. \\n Lucia - the fiery Sicilian beauty on the run for murder - and Rubio Arzano, the freedom fighter who risks his life to save her. \\n Teresa - whose guilty conscience finally drives her to betray her friends. \\n Graciela - who bears a terrible secret thet almost destroys her - and the courageous Ricardo who loves her.\\n","cover":"https://allnovel.net/images/the-sands-of-time.jpg","author":"Sidney Sheldon","type":"Mystery","source":"allnovel","link":"https://allnovel.net/the-sands-of-time.html","creation":"Oct 5, 2019 8:58:39 AM","modification":"Oct 5, 2019 10:08:20 AM"}}
