{"id":43711,"no":40,"title":"CHAPTER XL. DR. PETERSSEN REAPPEARS ON THE SCENE.","content":"For the unexpected good fortune of this discovery Emilia was very grateful, and her mind was now occupied in considering how to make the best use of it. She did not linger in Gerard Street lest she should be seen by Gerald\u0027s brother, but before she left it she ascertained that he was known not as Mr., but as Monsieur Felix. For what reason had he concealed his right name? For what reason had he assumed that of a foreigner? It was perhaps because she had but one subject to think of, but one supreme end to attain, that she mentally decided that she herself was not unconnected with his motive for concealing his identity. If that were the case it would be difficult indeed to obtain an interview with him. If she presented herself in person, or sent up her name, he would refuse to receive her; if she forced herself upon him he would not listen to her, and the next time she went to him she would find that he had flown. Thus her mission would be a failure and the unhappiness of her daughter insured. It behooved her to be very careful in her movements; the least slip would be fatal. \n \n The whole of that day and the whole of the next she bent her mind to the consideration of the peculiar position in which she was placed. She did not remain at home; she spent many hours in the vicinity of Soho, making inquiries of M. Felix\u0027s habits and character, in such a manner as to draw no suspicion upon herself. Small tradesmen of whom she made purchases were the medium of these inquiries, and they were able to give her much information because of the gossiping disposition of Mrs. Middlemore, the housekeeper. It was at this time that she developed a talent for intrigue. To insure that she should not be recognized by M. Felix in a chance meeting in the streets, she took a room that was to let midway between Soho and the apartments occupied by herself, stating that she was an actress; and at one shop in the Strand, and at another in a street running out of that thoroughfare, she purchased a box of \"make-up\" and a wig of a different color from her own hair. It was a short wig, and when her own locks were concealed beneath it, and she had used certain pigments on her face, no one who knew her as Emilia Braham could possibly recognize her. These changes were made in the room she had taken unknown to Constance, and she gave no person in the house an opportunity of observing her. Independent, however, of these changes she was no further advanced at the end of the second day than when she met M. Felix in Regent Street, and she could think of no means of obtaining the interview she desired. \n \n On the third day she went out again in the direction of Gerard Street, drawn thither, as it were, by a magnetic current. But indeed all her hopes, and the future of herself and child, were centred in the house in which Gerald\u0027s brother lived under the name of M. Felix. Snow was still falling heavily, but she did not shrink from the chill blasts which swept through the narrow spaces of Soho. She had struck up an acquaintance with the mistress of a shop in which foreign provisions were sold, and she was now standing before the counter conversing with the woman, and picking up further information of the domestic habits which reigned in M. Felix\u0027s house. She learnt that it was Mrs. Middlemore\u0027s custom to go out every night for her supper-beer at half-past eleven, and that she was generally absent for not less than half an hour. A wild plan instantly suggested itself; she felt that something must be done, and that she must be bold. At eleven o\u0027clock this very night she would be on the watch outside the house in Gerard Street, waiting for the housekeeper to go upon her usual nightly errand. Then she would go up to her, before she closed the street-door, and say she came by appointment to see M. Felix. She had already ascertained that he occupied apartments on the first floor; she had seen on the previous night the lights shining through his windows, and she would know in the same way on this night whether he was at home. If she played her part well, and controlled her voice so that it did not betray her, the housekeeper would doubtless take her word, and thus she would obtain entrance to the house without M. Felix being aware of it. As to what she should do when she confronted him she was as yet undecided, but certain unformed ideas loomed in her mind which seemed to give her hope that this nocturnal visit would not be fruitless. It would be necessary, however, that she should not present herself to the housekeeper dressed as a woman, for that would almost certainly bring suspicion upon her. In the disguise of a man her story would be more credible. Well, she would buy a suit of male clothing, and so disguise herself. The moral energy by which she was supported caused her to accept any suggestion, however daring and bold, by means of which she could attain success. \n \n She went out of the provision shop full of the scheme, but had not gone ten yards before she made a discovery which occasioned her as much surprise as her meeting with Gerald\u0027s brother a couple of days ago. A man brushed quite closely to her, and this man was none other than Dr. Peterssen. Another fateful thread in her sad story. What did his presence in that locality portend? \n \n He took no notice of her as he passed, but lingered before the window of the provision shop, looking through the panes, not at the goods displayed, but into the shop to see who was there. Throughout this series of adventures Emilia\u0027s senses were preternaturally sharpened, and nothing escaped her which seemed to bear upon her sad story. Presently Dr. Peterssen entered the shop, and without a moment\u0027s hesitation Emilia followed him. \n \n He had already commenced a conversation with the mistress of the establishment, who, saying to him, \"I beg your pardon,\" went to Emilia. \n \n \"I have forgotten something I wanted to buy,\" said Emilia, in a low tone, \"but I can wait till you have attended to that gentleman.\" \n \n She took care that her voice should not reach his ears, and as the woman stepped toward him she turned her back, with the air of a person who was not in the least interested in his business. The first words she spoke caused Emilia\u0027s heart to beat violently; but she still kept her face from him. \n \n \"Yes, sir, M. Felix lives very near here, in the next street.\" \n \n \"Thank you,\" said Dr. Peterssen. \"It was very careless of me to lose the letter he sent me containing his address. Would you mind writing it down on paper for me?\" \n \n \"Not at all, sir.\" \n \n The woman wrote the address, and Dr. Peterssen, thanking her, left the shop. Then she asked Emilia what she wished; it was common enough for people to come and ask the address of persons living in the neighborhood, and she attached no importance to it. Emilia made another small purchase, and again took her departure. \n \n Instead of leaving Soho, as was her original intention, to buy the suit of man\u0027s clothing necessary for the carrying out of her scheme, she walked slowly through Gerard Street. Dr. Peterssen was on the opposite side of the road to that on which M. Felix\u0027s house was situated, and he was gazing up at the windows with an expression of triumph on his face. There had been a note of triumph also in his voice when he had thanked the shopkeeper for the information she gave him, and Emilia judged from those signs that he, as well as herself, had been hunting for M. Felix. For what reason, and why, had M. Felix hidden himself from a man he knew so well? Here again Emilia did not stop to reason. In the selfishness of the task upon which she was engaged she jumped at conclusions, and the conclusion she formed now was that Dr. Peterssen\u0027s search for M. Felix was in some way connected with herself and the husband she had lost. \n \n No detective could have acted more warily than she. With extreme caution she watched Dr. Peterssen\u0027s movements. He stood for a few moments looking up at the windows, then he crossed the road, and noted the number of the house, and then, with an exulting smile, he slowly walked away. Emilia was now more than ever resolved to carry out her scheme on this night. \n \n She had observed that there were large clothing establishments in Tottenham Court Road, and at one of these she purchased a suit of clothes for a small-made man. Hastening to the room she had taken she tried them on and found them too large. She went back to the shop and exchanged the suit for a smaller one, which fitted her fairly well. Then leaving the clothes behind her, she joined Constance, and remained with her till eight o\u0027clock. \n \n \"Must you go out to night, mamma?\" asked the girl. \n \n \"Yes, Constance,\" replied Emilia, \"and I may not be home till late. You had better go to bed soon.\" \n \n \"No, mamma,\" said Constance, \"I will wait up for you.\" She went to the window. \"Mamma, you cannot possibly go out. The snow will blind you. There is not a person in the streets.\" \n \n \"I must go, dear child,\" said Emilia, firmly. \n \n \"But, mamma, dear--look!\" \n \n It was the night of January 16th, and a terrible snowstorm was raging. For over two weeks now the snow had been falling in London, and many of the thoroughfares were blocked with drift, which the efforts of great numbers of laborers could not remove; and on this night the tempest had reached its height. So engrossed had Emilia been in the task which had brought her from her happy home in Geneva that she thought little of the storms of nature which she had encountered as she trudged through the white-carpeted thoroughfares of the city. What physical sufferings was she not prepared to bear, and to bear cheerfully, for the sake of her beloved child? Only when her strength gave way would she yield, and she was sustained now by an abnormal strength which enabled her to endure that from which on ordinary occasions she would have shrunk. During this trying period of her life her powers of endurance were astonishing. \n \n \"You will not go out in such a storm, mamma!\" \n \n \"Do not try to dissuade me, darling, I must go. Do not fear for me; God is watching over me. I shall be quite safe.\" \n \n \"Let me go with you,\" pleaded Constance. \n \n \"Impossible. You know, dear child, I always do what I believe to be right; I am doing it now, and you must not thwart me, nor make things more difficult for me than they are.\" \n \n \"Are they difficult, mamma!\" asked Constance, in a tone of tender solicitude. This was the first time her mother had hinted at difficulties, and the admission had slipped from Emilia unawares. \n \n \"Yes, dear, but I cannot tell you what they are. Perhaps the time may come when I shall tell you all, but for the present trust in me, have faith in me.\" \n \n The solemnity of her voice had its effect, and Constance no longer attempted to prevail upon her. \n \n \"Are you warm enough, mamma?\" \n \n \"Yes, dear child, and my boots are dry and thick. God bless my darling, and shield her from harm.\" \n \n Constance tied a red silk scarf round her mother\u0027s neck, who left her with bright smiles and cheering words. Then Emilia made her way to her other lodging of one room, and effected the change in her garments. There was no other lodger in the house but herself, and she had a latchkey to let herself in; she experienced little difficulty in preserving the secrecy necessary for her operations, and she entered and left the house always without being observed. \n \n She surveyed herself in the little bit of broken looking-glass which rested on the deal chest of drawers against the wall. \"It is not possible for anyone to recognize me,\" she thought, and was about to leave the room, when her eyes fell upon the red scarf which Constance had tied round her throat. With a tender smile she took it up and put it on. She looked at her watch; it was a quarter to ten. \"I have still a few minutes,\" she said, and she knelt by the side of the bed she had not yet occupied, and prayed for strength and for a successful issue of her dangerous errand. Then she went out into the streets. \n \n They were almost deserted; all the better for her task. On such a night who would notice her? As she turned into Gerard Street the church clocks chimed a quarter to eleven. She had three-quarters of an hour to wait. But the hot blood rushed over her face and neck as she saw, three or four paces ahead of her, the form of a man proceeding in the direction she was taking--and that man no other than Dr. Peterssen. He knocked--a peculiar knock seemingly by pre-arrangement--and Emilia timed her steps so that she reached and passed the door as it was opened by someone from within. She stooped just beyond the street-door, and while she was pretending to tie her shoestring heard what passed, which may fitly be given here in dramatic form: \n \n Dr. Peterssen: \"Ah, my dear friend, at last we meet!\" \n \n M. Felix (starting back): \"You!\" \n \n (His voice, although it had spoken but one word, was to Emilia a confirmation. It was the voice of Gerald\u0027s brother, Leonard.) \n \n Dr. Peterssen (airily): \"I, sweet comrade in the shady paths, I, Dr. Peterssen--nu ghost, flesh and blood. You received my note.\" \n \n M. Felix: \"Written in a woman\u0027s hand, signed in a woman\u0027s name!\" \n \n Dr. Peterssen: \"I knew that was the best bait to hook my fish. And the knock, too, that you yourself and no one else--no prying housekeepers or servants--must answer. Still the same Don Juan as ever. But it is biting cold here. Let us get into your cosy room and talk.\" \n \n M. Felix: \"Not to-night.\" \n \n Dr. Peterssen: \"I am not to be put off, friend of my soul. We will have our little say to-night.\" \n \n M. Felix: \"I have friends with me. I cannot receive you now.\" \n \n Dr. Peterssen: \"A lie. You have no friends with you.\" (His tone changing to one of undisguised brutality.) \"If you keep me waiting here one minute longer I will ruin you. Do you forget our pleasant partnership in Switzerland nineteen years ago? Do you forget your brother Gerald?\" \n \n M. Felix: \"Hush! Come in. Step softly.\" \n \n That was all. The door was closed, and all was still. \n \n Emilia stood upright, with a face as white as the falling snow. The words with their hidden meanings, the voices with their varying tones, the trick by which Dr. Peterssen had found it necessary to obtain admission to the presence of M. Felix, the veiled threats, the allusions to the partnership in Switzerland and to her dear Gerald--what did all these portend? What but a secret plot, unknown to her, unknown to all but its accomplices, a plot in which Gerald had been involved, and therefore she? Oh, for some beneficent gift to pierce those walls, to hear what those villains were saying! But it was idle and might be hurtful to indulge in vain, impracticable wishes. She summoned all her fortitude. Scarcely now could she hope to obtain speech to-night with the man whom she believed had ruined her life, and who could ruin it still further. But she would not desert her post; she would wait and hope. She heeded not the bitter, piercing cold; she seemed to be divinely armed against physical suffering. So she tramped slowly up and down the street through the deep snow, keeping her eyes fixed ever on the windows of the room in which the conspirators were conversing, walking backward with her face to them when she went from the house. Visions of the past rose before her; the white snow falling even in this narrow street brought back the snow mountains of Switzerland, where last she had seen the two enemies within hail of her. \"Strengthen me, oh, God of the universe!\" she murmured. \"Endow me with power to fulfil my task, so that I may keep shame and sorrow from my beloved child.\" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1658/48915.html","bookId":1202,"book":{"id":1202,"title":"The Mystery of M. Felix","description":"简介： Through the whole of the night, chopping, shifting winds had been tearing through the streets of London, now from the north, now from the south, now from the east, now from the west, now from all points of the compass at once; which last caprice--tak...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1658","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
