{"id":43713,"no":42,"title":"CHAPTER XLII. EMILIA AND M. FELIX.","content":"Emilia, watching in the snow-clad street, saw Mrs. Middlemore issue from the house with a large jug in her hand. She dared not go up to the housekeeper while Dr. Peterssen was in the house, and with a sinking heart she recognized that the hope she had entertained of obtaining entrance by means of the story she had mentally rehearsed was lost. But she would not leave the spot until Dr. Peterssen appeared. She had no intention of accosting him, for that she felt would be disastrous, but she would follow him, if she could do so safely, to see where he lived or lodged. It might be a point gained, although she did not at that moment see how it could be used to her advantage. She had not long to wait. About ten minutes after Mrs. Middlemore left the house, the street-door was opened again, and Dr. Peterssen appeared. He carried beneath his right arm that which would have sent a thrill of passionate emotion to Emilia\u0027s heart, but she was too deeply observant of his personal movements to see the desk which he had taken away with him as a guarantee. He made no pause, but plunged immediately into the snow, and Emilia was about to follow him when she suddenly observed that he had not closed the door behind him. Her attention was instantly diverted from the man. Here was the opportunity for which she had disguised herself, for which she had been waiting. Without thinking of the consequences, she glided into the house and shut the door. Emilia would have scarcely known how to proceed now had it not been that M. Felix, hearing the street-door closed, rose to close his own, which Dr. Peterssen had left ajar. Before putting his intention into execution he opened it a little wider, and inclined his head to the stairs, as if in the act of listening. The stream of light which this action threw into the passage was a guide to Emilia, who, without hesitation, ran up the stairs and confronted him. Startled by her appearance he fell back a step or two, which afforded Emilia space to enter the apartment. \n \n \"Who are you? What do you want?\" gasped M. Felix, dreading at first whether this was not part of a plot which Dr. Peterssen had devised for his injury. But his doubts were immediately dispelled. \n \n \"I am Emilia Paget,\" said Emilia, \"and I want justice.\" \n \n With a face of terror he retreated farther into the room, and Emilia followed him. His heart almost ceased to beat, and a singular numbness of sensation came over him. \n \n \"Through all these years,\" said Emilia, \"I have left you in peace, if peace can ever be the portion of a man like yourself. I come now to force a confession from your lips. I want nothing from you in the shape of money. All that you have, and that once was your brother Gerald\u0027s, is yours, and shall remain yours. I do not desire it; if I have any right to it I renounce it; I am here to demand justice.\" \n \n This speech gave M. Felix time to recover himself somewhat. Though still conscious of a strange deadness of feeling at his heart, he saw the situation, and asked in a faint voice-- \n \n \"What kind of justice?\" \n \n Emilia put a wrong construction upon the low tone in which he spoke. Deeming it a sign of relenting on his part, the defiant air she had boldly assumed gave way to one of imploring. \n \n \"When we last met in Switzerland,\" she said, bending toward him, \"you told me that your brother, my dear Gerald--who, in my innermost heart, I believe never did harm to woman--had imposed upon me by a mock ceremony of marriage. At that time I was so overwhelmed by despair and so persecuted by injustice, that I did not dispute your statement. I thought only of the present; I wished only to escape from the cruel eyes and tongues of those to whom I had been maligned; I wished only to fly to a spot where I was unknown, and where I might live out my days in peace. What I yearned for was accomplished. God was good to me; He raised up a friend who took me to her bosom, and who conducted me to a haven of rest. For eighteen years I have lived in a foreign land, contentedly, even happily, with my child, Gerald\u0027s child. But circumstances have occurred which render it vitally necessary for our happiness that the proof should be forthcoming that I am a married woman. To obtain this proof I have come to England to find you, and by a happy chance have so far succeeded. I beg, I entreat of you, to give me means to establish my marriage with your brother. That done, I will leave you in peace, as Heaven is my judge. I will bind myself to this in any way you wish. I will swear the most solemn oath, I will sign any document you may draw up. Give me the means of preventing a shameful exposure which will ruin my child\u0027s life and mine. Think of what I have silently suffered, and have pity for me. I will pray for you--I will bless you----\" \n \n But her voice was broken by emotion, and she could not proceed. M. Felix gazed at her sternly; as she grew weak, he grew strong. \n \n \"I cannot give you what is impossible,\" he said. \"You and Gerald were never married.\" \n \n \"I will not use hard words,\" said Emilia, restraining herself. \"It may be as you say; but give me at least the information that will enable me to establish the truth. You cannot deny me this--you cannot, you cannot!\" \n \n \"What kind of information do you desire?\" asked M. Felix. \n \n \"When I was ill and very near to death,\" she replied; \"when reason had forsaken me and I was lying stricken down, Gerald and you came to me in the place where afterward a civil ceremony was performed which I had every right to believe made me an honorably married woman. Tell me the name of that place. It is little to ask, but I ask no more. If you have a spark of compassion in you, tell me this, and I will go away blessing you.\" \n \n \"You do not remember it?\" said M. Felix, with triumph in his eyes. \n \n \"God help me, I have not the least remembrance of it, nor of the roads I took which led me to it.\" \n \n M. Felix stepped to the window and threw it open. Then he cried in as loud a voice as he could command: \n \n \"Help!\" \n \n \"Why do you cry for help?\" asked Emilia, advancing toward him. \n \n \"Do not come nearer to me,\" he replied, \"or I will strangle you. Why do I cry for help? To bring the police here--to give you into custody--to expose and brand you as you deserve to be exposed and branded. How you forced your way into this house I do not know: perhaps you have been in hiding until you were assured I was alone. You come here to rob and murder. I will swear to it.\" Again he called from the window, \n \n \"Help!\" \n \n Frozen with terror Emilia stood like a statue, white with the fear of a horrible exposure which would blast her and her child forever in this world. \n \n \"You talk of ruin,\" snarled M. Felix. \"It is upon you now. Disguised as a man you steal upon me here for a vile purpose. You will go away blessing me, will you? What do I care for your blessing or your curse? I will make your name a byword of shame, as it has been made before!\" For the third time he sent out into the night his cry for \"Help!\" \n \n Emilia\u0027s strength returned to her; she was able to speak once more. \n \n \"I will go,\" she said. \"You shall not have the opportunity of still further disgracing me. But I will not rest till the truth is made clear to me--not with your help, but with the help of\"---- \n \n \"Of whom?\" asked M. Felix, with a sneer. \n \n She had intended to say \"with the help of God,\" but an inspiration fell upon her which impelled her to utter a name almost as hateful to her as that of Leonard. \n \n \"With the help of Dr. Peterssen. If you can ruin me, he has it in his power to ruin you.\" \n \n \"Ah!\" cried M. Felix, and in a sudden frenzy he snatched the snake dagger from the table and hurled it at her. It struck her in her left arm, and she caught it in her right hand. As she held it thus, dazed with pain, for a moment, M. Felix was struck with partial blindness. He saw, through the mist which fell upon him, the dagger with blood dripping from it, and thought that it was Emilia\u0027s intention to use it against him. He had a revolver in his bedroom. Blindly he staggered thither, and fell, motionless, into a chair by the side of the bed. The pain of the wound and the horror of the situation deprived Emilia of her senses, and she sank to the ground. How long she remained in that condition she did not know, but when she opened her eyes all was silent. M. Felix was not present. Had he gone to carry out his threat and to bring the police to his aid? The dagger was still in her hand and the wound in her arm was still bleeding. Shudderingly she threw the weapon behind the sideboard, and intent now only on escaping from the shame with which she was threatened, she bound her handkerchief tightly round the wound, and fled down the stairs. Constables Wigg and Nightingale were outside the door as she threw it open, but she scarcely saw them, although she knew that they were the forms of men. Terror lent wings to her feet, and in a moment she was out of sight, flying for her life. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1658/48917.html","bookId":1202,"book":{"id":1202,"title":"The Mystery of M. Felix","description":"简介： Through the whole of the night, chopping, shifting winds had been tearing through the streets of London, now from the north, now from the south, now from the east, now from the west, now from all points of the compass at once; which last caprice--tak...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1658","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
