{"id":43717,"no":46,"title":"CHAPTER XLVI. I ENTER INTO AN ARRANGEMENT WITH SOPHY.","content":"At the corner of the street I dismissed the cab, and hurried after a familiar figure. It was Sophy, who seemed to be literally flying along the pavement, now on one leg, now on the other, and had she not suddenly wheeled round in my direction I should have had to run at the top of my speed to catch her. Seeing me she pulled up, and, with her face scarlet with excitement, greeted me boisterously. \n \n \"Why, what on earth are you doing, Sophy?\" I asked, laughing and wondering at her. \n \n She lifted her feet, one after another, for my inspection; she was skating on wheels. \n \n \"I\u0027m the champion skater,\" she said, triumphantly; \"I shall git a turn at the music halls before long. Look \u0027ere; I can beat the lot of \u0027em.\" \n \n Away she flew with marvellous swiftness for a space of fifty yards or so, then wheeled round and round and reached my side by executing a series of circles in the cleverest manner possible. I have no doubt that there are technical terms to describe her feats, but I am not acquainted with them. \n \n \"There!\" she cried. \"What do you think of that?\" \n \n \"You\u0027ll break your neck if you don\u0027t mind,\" I said. \n \n \"Break my neck!\" she exclaimed. \"Not me! That\u0027s nothink to what I can show yer. I am glad to see yer back, I am? Aunty sed you\u0027d give us up. \u0027Not \u0027im,\u0027 sed I; \u0027he ain\u0027t one of the giving-up sort.\u0027 You look tired out; ain\u0027t yer been well?\" \n \n \"Quite well, Sophy, but, like you, very busy. Is your aunt at home?\" \n \n \"Yes,\" said Sophy, bursting into a fit of laughter; \"she\u0027s down in the kitching, with a pore man\u0027s plaster on \u0027er side. I got \u0027er to put on the roller-skates--leastways I put \u0027em on for \u0027er--and the minute she stood up in \u0027em she toppled over and fell agin the dresser. She ain\u0027t \u0027urt much, but she likes to make a lot of a little. I\u0027m all over bruises, I am, but I don\u0027t fuss over \u0027em.\" \n \n \"You shouldn\u0027t play tricks on her,\" I said gravely; \"she has been a good friend to you.\" \n \n \"Oh, I don\u0027t know about that,\" said Sophy, with a rebellious toss of her head. \"She makes me pay for it, nagging at me morning, noon, and night. But there, I ain\u0027t going to say nothink agin \u0027er. She\u0027s got a temper, and so \u0027ave I.\" \n \n \"She has been greatly worried, Sophy; you must be gentle with her.\" \n \n \"I\u0027ll do anythink you tell me; you don\u0027t bully a gal, you don\u0027t. If you told me to go and jump off the top of the Monument I\u0027d do it--yes, I would, though you mightn\u0027t believe me.\" \n \n \"I shall not ask you to do anything so stupid, but you can render me a service, if you have the will and the pluck.\" \n \n \"Can I?\" she exclaimed, eagerly. \"I ain\u0027t much to look at, but I\u0027ve got the pluck of a big \u0027un. Only you tell me what it is.\" \n \n \"It will first depend upon whether your aunt can spare you. We will go in and see her.\" \n \n \"She\u0027ll \u0027ave to spare me, and if she don\u0027t like it she may lump it. Now I know yer want me, I ain\u0027t going to let yer off.\" \n \n \"You appear anxious to serve me, Sophy.\" \n \n \"I\u0027m going to serve yer,\" she said, with emphatic nods. \"There\u0027s nothink mean about you. When a gent makes a promise he sticks to it.\" \n \n \"A promise, Sophy!\" \n \n \"Didn\u0027t yer promise yer\u0027d give me somethink to do for yer--and didn\u0027t yer say jest now it depends upon whether I\u0027ve got the pluck to do it? That settles it. I\u0027ve got the pluck, and the thing\u0027s as good as done. Nobody in all the world \u0027as been as good to me as you\u0027ve been, and it ain\u0027t likely I shall ever forgit it. You\u0027ll see. One day when I\u0027m Somebody,\" and here the grateful girl gyrated round me gently, and really with grace--\"yer\u0027ll be proud of \u0027elping me on, and then I\u0027ll show yer I can remember.\" \n \n \"Your aunt can\u0027t be left alone,\" I said, after a moment\u0027s consideration. \"Do you know of any girl or woman who would take your place here while you are away for a week or two?\" \n \n \"I know twenty that\u0027ll be glad of the job. I\u0027m to go away, am I?\" Her eyes glittered at the prospect of an adventure. \"I\u0027m ready this minute Where to?\" \n \n \"I\u0027ll tell you all about it after I\u0027ve spoken with your aunt. It isn\u0027t an easy task I shall set you, Sophy.\" \n \n \"The \u0027arder it is the better I shall like it.\" \n \n \"Do you think you could play a part?\" I asked. \n \n \"On the stage?\" she cried, eagerly. \n \n \"No; off the stage.\" \n \n \"On or off,\" she said, with a shade of disappointment, \"it don\u0027t matter. I\u0027m game for anythink. Let\u0027s git aunty settled fust.\" \n \n Sophy, being now provided with a latch-key, opened the street door, and taking off her roller skates in the passage, preceded me down-stairs. Mrs. Middlemore was darning stockings, and seemed cheerful enough, but when she looked up and saw us her face assumed a colorless expression, and she pressed her hand to her side. Sophy winked at me, and said, in a whisper, \"She\u0027s putting of it on; she ain\u0027t \u0027urt a bit, no more than you are.\" \n \n \"Oh, good evening, sir,\" said Mrs. Middlemore, mournfully. \"What are yer whispering about, Sophy?\" \n \n \"Only telling the gent,\" replied the unblushing girl, \"not to speak too loud, \u0027cause of yer nerves, aunty.\" \n \n \"It\u0027s all Sophy\u0027s doings, sir,\" moaned Mrs. Middlemore. \"She made me put on a pair of rollers that\u0027s going to break \u0027er legs afore she\u0027s done with \u0027em. She\u0027s a double \u0027andful, sir; I can\u0027t manage \u0027er.\" \n \n \"She has told me of the accident,\" I said, \"and is very sorry for it. Sophy means well, Mrs. Middlemore.\" \n \n \"I won\u0027t dispute with you, sir, but she\u0027ll be the death of me if she goes on as she\u0027s a-doing of now. You\u0027ve been away a long time, sir.\" \n \n \"Not so very long; I had important business in the country to attend to. Nothing has happened, except your accident, during my absence, I suppose?\" \n \n \"Nothink as I can think of, sir.\" \n \n \"No more visitors in disguise; no more false summonses to the police court?\" \n \n \"No, sir--only I\u0027ve got my fancies.\" \n \n \"What kind of fancies?\" \n \n Mrs. Middlemore looked timorously around, and Sophy answered for her. \"There\u0027s a sperrit in the \u0027ouse, she ses. She \u0027ears it moving about, and she\u0027s ready to swear in the middle of the night that it\u0027s a-standing at the foot of the bed.\" \n \n \"Do you also hear and see it, Sophy?\" I asked. \n \n \"Not me,\" replied Sophy, contemptuously. \"It\u0027s a wide-awake sperrit, and makes itself scarce when I\u0027m about.\" \n \n \"Ah, well,\" I said, \"there\u0027s no accounting for fancies. Let us get to business, Mrs. Middlemore. I intend to rob you of Sophy for a little while.\" \n \n \"Rob me of Sophy, sir!\" exclaimed Mrs. Middlemore. \"What on earth am I to do without \u0027er?\" \n \n \"Oh, you will get along very well without her----\" \n \n \"But you don\u0027t know what a \u0027elp she is to me, and \u0027ow good she\u0027s been. I\u0027ve got that fond of \u0027er that I don\u0027t like \u0027er to be out of my sight. You\u0027re joking, sir, ain\u0027t yer?\" \n \n \"Not at all,\" said I, smiling at this sudden display of affection. \"I have something for Sophy to do, and if she undertakes it she will get well paid for the job.\" \n \n \"Never mind about my being paid for it,\" interposed Sophy; \"I\u0027m going to do it, whatever it is.\" \n \n \"And leave me \u0027ere all alone!\" whimpered Mrs. Middlemore. \n \n \"You will not be alone. The first thing in the morning a girl shall be engaged to keep in the house with you, and I will pay her wages; and you shall have an allowance while Sophy\u0027s away. Remember what I have done for you, and don\u0027t make any further objections.\" \n \n \"I\u0027m sure you\u0027ve been very good, sir,\" said Mrs. Middlemore, her trouble lessened by the prospect of gain; the virtues of golden ointment are not to be excelled. \"Might I take the liberty of arksing whether it\u0027s got anythink to do with Mr. Felix?\" \n \n \"I cannot answer you,\" I said. \"What Sophy will do will be a secret between her and me for the present. By and by, perhaps, she will tell you all about it.\" \n \n \"You\u0027ve got a way with you, sir, that nobody can\u0027t resist. You\u0027ll come back to me, Sophy?\" \n \n \"Course I will, aunty,\" said the girl, \"when the job\u0027s done.\" \n \n \"And now, Sophy,\" I said \"if you will come upstairs with me we will have a little chat. Then you can decide.\" \n \n \"I\u0027ve decided already,\" said Sophy, and she followed me to the sitting-room which had been occupied by M. Felix. \n \n Everything apparently was the same as on the night of the disappearance of M. Felix\u0027s body. I was aware of only one article which was missing after Dr. Peterssen\u0027s visit to the house, and that was the revolver which M. Felix kept under his pillow. I had no doubt in my mind that Dr. Peterssen had taken advantage of his being alone in the house, on the occasion of Mrs. Middlemore\u0027s unnecessary visit to the Bow Street Police Station, to appropriate other articles, but only the revolver and the desk--which he had taken away on the night of his interview with M. Felix--were within my knowledge. It is true that even this knowledge was gained by means of circumstantial evidence which would scarcely have been admitted in a court of law, but I was quite satisfied on the point, and I had the strongest moral conviction that time would prove the correctness of my conclusions. \n \n \"Sit down, Sophy,\" I said, \"and think of nothing else but what I am about to say to you.\" \n \n \"I\u0027m a-doing of it,\" said Sophy, with a look of absolute concentration that strengthened my confidence in her, and spoke volumes in favor of her being, as she hoped, somebody one day. \n \n \"You remember the day on which your aunt was sent to Bow Street Police Court by a man whom she left in the house alone?\" \n \n \"Yes, I do.\" \n \n \"You said you saw the man. Would you know him again?\" \n \n \"I\u0027d swear to \u0027im.\" \n \n \"On the night that Mr. Felix\u0027s body disappeared you were the only person in the house who knew anything at all of the matter. You behaved like a little heroine on that occasion, Sophy.\" \n \n \"That\u0027s something good, ain\u0027t it?\" \n \n \"Something very good. There is no possibility, I suppose, of your being able to give me a description of the man who, by some strange means, got into the house on that night?\" \n \n \"I can\u0027t tell you nothink more about \u0027im. It was in the dark, yer know, and when he spoke it was under \u0027is breath.\" \n \n \"The question was an idle one, but I was bound to ask it. It may or may not have been the same man who deceived your aunt. Sophy, the man you saw and can swear to is an infernal scoundrel, and I look upon him as my enemy.\" \n \n \"That\u0027s enough for me; he\u0027s mine, too, and I\u0027m \u0027is.\" \n \n \"You can keep a secret, Sophy.\" \n \n \"You tell me one, and wild \u0027orses sha\u0027n\u0027t tear it from me.\" \n \n \"You are a faithful little soul, and I put great trust in you. Everything I am saying to you is a secret.\" \n \n \"That\u0027s enough,\" said Sophy, touching her lips with her fingers. \"Red \u0027ot pinches shouldn\u0027t git it out of me.\" \n \n \"The man you saw was in this house, to my certain knowledge, once before--while M. Felix was alive. Your aunt did not know it; M. Felix opened the street door for him. It was the night M. Felix was found dead, and when the man went away he took a desk with him that belonged to M. Felix.\" \n \n Sophy nodded. \"Aunty\u0027s spoke to me about that desk. She never could make out, she ses, what \u0027d become of it.\" \n \n \"I will describe it to you, Sophy.\" I did so, and she listened attentively, nodding from time to time with surprising intelligence. \"If you happen to see this desk in the possession of the man whom I look upon as my enemy, do you think you could identify it?\" \n \n \"Know it again? Yes, I should. But \u0027ow am I to git to the man?\" \n \n \"I have thought of a plan, or rather a friend of mine has, which requires courage to carry it out successfully. It requires something more than courage; without great good sense and coolness the plan would fail. The question is whether you possess those qualities.\" \n \n \"It ain\u0027t no question at all; I\u0027ve got what you want, and can do what you want.\" \n \n \"There is something in the desk, Sophy, that is of the utmost importance to me.\" \n \n \"And I\u0027m to git it for yer. All right. Smuggle me into the \u0027ouse, and consider it done.\" \n \n \"But you don\u0027t know what kind of a place it is, my girl. It\u0027s a private madhouse.\" Sophy did not blench; she simply nodded, and fixed her large brown eyes on my face. \"The man\u0027s name,\" I continued, \"is Peterssen, Dr. Peterssen. If he wanted a young girl as a servant you should apply for the situation, but I don\u0027t think there is a vacancy in his establishment. He is ready to take more patients, though, and he likes young patients better than old ones.\" \n \n \"You\u0027re going to put me in there as a mad gal,\" cried Sophy, in a tone of irrepressible excitement, which lasted, however, only for a moment. She cooled down instantly, and said in her usual tone, \"Crikey! That\u0027s a good move. I\u0027m game! It\u0027s a good part to play, and no mistake.\" \n \n \"You\u0027ll do it, then?\" \n \n \"Do it? Won\u0027t I do it? Why, I never thought I\u0027d \u0027ave sech a chance.\" \n \n \"You will have to be respectably dressed, Sophy, hands and face nice and clean, and hair very tidy. How long in the morning will it take you to do that?\" \n \n \"You git me the clothes and I won\u0027t keep yer waiting. I\u0027ll give myself a good scrub to-night.\" \n \n \"I\u0027ve only one fear for you,\" I said, \"which you won\u0027t mind my mentioning. Going as a girl in a respectable position, your language might draw suspicion upon you. I can\u0027t see a way out of that difficulty.\" \n \n \"I can,\" said Sophy, with a merry twinkle. \"Why should I speak at all? Let me go as a dumb gal. It\u0027ll be more than ever they can manage to git a word out of me if I was there for a year.\" \n \n I looked at her admiringly. Her sharp wits had solved a problem which had greatly perplexed me. \n \n \"You are sure you will not be afraid, Sophy?\" \n \n \"Not a bit afraid; I shall enjoy it. It\u0027ll be a reg\u0027lar game.\" \n \n \"Very well, then. You can sleep upon it to-night, and if you alter your mind you can let me know. I shall sleep here myself, and shall be up early in the morning. There will be a great deal to do, and no time must be lost. Goodnight. Say nothing to your aunt.\" \n \n She nodded smilingly, bade me good-night, and left me to my reflections. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1658/48921.html","bookId":1202,"book":{"id":1202,"title":"The Mystery of M. Felix","description":"简介： Through the whole of the night, chopping, shifting winds had been tearing through the streets of London, now from the north, now from the south, now from the east, now from the west, now from all points of the compass at once; which last caprice--tak...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1658","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
