{"id":43680,"no":9,"title":"CHAPTER IX. INTRODUCES SOPHY.","content":"\"Our reporter gazed at the bed in astonishment, while Mrs. Middlemore continued to move her hands and eyes helplessly around, and moan for the police. Our reporter is a man of resource, quick-witted, ready-minded, and ever ready to take advantage of an opportunity. He took advantage of this. \n \n \"\u0027My good creature,\u0027 he said, \u0027what is the use of crying for the police? Have they assisted you in any way in this mysterious affair?\u0027 \n \n \"\u0027No, they \u0027aven\u0027t,\u0027 replied Mrs. Middlemore, adding inconsequentially, \u0027but where are they--Oh! where are they?\u0027 \n \n \"\u0027What have they done already for you?\u0027 continued our reporter. \u0027Brought you into trouble with the newspapers because of their evidence contradicting yours; and whatever other people may say, I am sure you spoke the truth.\u0027 Our reporter observed something frightened in the look she cast at him as he made this assertion. \u0027The best thing for you is to confide in a friend who is really anxious to serve you, and whose purpose is to get at the truth of the matter.\u0027 \n \n \"\u0027That\u0027s all I want. But where\u0027s the friend?\u0027 \n \n \"\u0027Here. I am on the staff of the Evening Moon, which is ready to spend any amount of money in clearing the innocent and bringing the guilty to justice. They haven\u0027t any interested motives to serve; they didn\u0027t know the dead man, who some people say was murdered, and some people say wasn\u0027t. If you are an innocent woman you would jump at the chance I offer you; if you\u0027re guilty, it\u0027s a different pair of shoes, and I wash my hands of you.\u0027 \n \n \"The threat cowed Mrs. Middlemore. \n \n \"\u0027I\u0027m innocent, you know I am,\u0027 she gasped. \n \n \"\u0027Of course I know you are, and I should like the opportunity to silence the wretches who speak of you in a suspicious way.\u0027 \n \n \"\u0027What \u0027ave they said of me? What \u0027ave they dared to say?\u0027 \n \n \"\u0027What you wouldn\u0027t like to hear; but never mind them just now. We\u0027ll soon take the sting out of their tails. Besides, while you are working in the cause of innocence your time will not be wasted. You will be well paid for the information you give.\u0027 \n \n \"This appeal to her cupidity settled the point. \n \n \"\u0027I\u0027ll do it,\u0027 she said, \u0027whatever it is. I\u0027m a innocent woman, and I want the world to know it.\u0027 \n \n \"\u0027The world shall know it,\u0027 said our reporter, with inward satisfaction at the success of his arguments; \u0027and when the whole thing is made clear through you you\u0027ll be looked upon as a heroine, and everybody will be running to shake hands with you. People will say, \"There, that\u0027s the woman that brought to light the truth about M. Felix. If it hadn\u0027t been for her we should never have known it. She\u0027s a real true woman; no nonsense about her.\" Why, I shouldn\u0027t wonder if they got up a subscription for you.\u0027 \n \n (\"We have no doubt, when this meets the eyes of our contemporaries, that some of them will be ready to take us severely to task for the tactics adopted by our reporter. Let them. We are thoroughly satisfied with the means he employed, and we offer him our sincere thanks. There is not a move we make in this mystery which is not made in the interests of justice, and that we are not ashamed of our methods is proved by the absolutely frank manner in which we place before our readers every word that passes.) \n \n \"\u0027What is it you want me to do?\u0027 asked Mrs. Middlemore. \n \n \"\u0027Merely,\u0027 replied our reporter, to answer a few simple questions. I have my reasons for believing that the police have advised you to say nothing to anyone but themselves.\u0027 \n \n \"\u0027They \u0027ave, sir, they \u0027ave.\u0027 \n \n \"\u0027What better are you off for it? Here are people ready to say anything against you, while you are advised to sit in a corner without uttering a single word in your own defence. It\u0027s monstrous. Upon my word, my dear Mrs. Middlemore, it\u0027s nothing less than monstrous.\u0027 \n \n \"\u0027So it is,\u0027 said Mrs. Middlemore, all of whose scruples seemed to have vanished. \u0027I\u0027ll answer anything you put to me.\u0027 \n \n \"I shall ask you nothing improper. You say that you locked the door before you went to bed last night. Which door? There are two, one leading to the first floor landing, one communicating between the bedroom and sitting-room. Which of these doors did you lock? Or did you lock both?\u0027 \n \n \"\u0027I won\u0027t tell you a lie, sir. When I said I locked the door I thought you\u0027d understand me. I mean that I fastened both of \u0027em. I couldn\u0027t lock \u0027em because the bedroom door key\u0027s been taken away, and the door on the landing\u0027s been cut into.\u0027 \n \n \"\u0027That was done by the locksmith. Who took away the key of the bedroom?\u0027 \n \n \"\u0027I don\u0027t know. Perhaps the police.\u0027 \n \n \"\u0027Without your knowledge?\u0027 \n \n \"\u0027I didn\u0027t know nothing of it.\u0027 \n \n \"\u0027How badly they are behaving to you! Anyway, the two doors were closed?\u0027 \n \n \"\u0027Yes, I saw to that myself. I ain\u0027t in the house without company, don\u0027t you think that. I wouldn\u0027t stop in it alone if you was to offer me Queen Victoria\u0027s golden crown. My niece is downstairs abed, and once she gets between the sheets she\u0027s that difficult to rouse that it\u0027s as much as a regiment of soldiers can do to wake \u0027er.\u0027 (This, our reporter thought, was comic, implying that Mrs. Middlemore had engaged the services of a regiment of soldiers to get her niece out of bed every morning.) \u0027Come up-stairs by myself in the dark,\u0027 continued Mrs. Middlemore, \u0027is more than I dare do. In the daylight I venture if I\u0027m forced to, as I did a minute or two ago, because, though I shook Sophy till I almost shook \u0027er to pieces, and lifted \u0027er up in bed and let \u0027er fall back again, it had no more effect on \u0027er than water on a duck\u0027s back. All she did was to turn round, and bring \u0027er knees up to \u0027er chin, and keep \u0027old of the bedclothes as if she was a vice. She\u0027s that aggravating there\u0027s \u0027ardly any bearing with \u0027er. So as I couldn\u0027t get \u0027er out of bed, I come up \u0027ere without \u0027er. And that\u0027s \u0027ow I found out Mr. Felix was gone.\u0027 \n \n \"\u0027You were speaking of what took place last night?\u0027 said our reporter. \u0027Your niece, Sophy, came up with you, I understand?\u0027 \n \n \"\u0027Yes, she did, though she had \u0027old of me that tight I could \u0027ardly shake myself free.\u0027 \n \n \"\u0027Did she come into this room with you?\u0027 \n \n \"\u0027No, she didn\u0027t; she wouldn\u0027t put her foot inside it. I left her in the passage while I peeped in. She ain\u0027t got the courage of a mouse.\u0027 \n \n \"\u0027Then she cannot corroborate your statement that the body of M. Felix was here before you went to bed?\u0027 \n \n \"\u0027Ain\u0027t my word enough?\u0027 \n \n \"\u0027For me it is, but it\u0027s different with the police and the public. It is a good job you\u0027ve put yourself in our hands; there\u0027s no telling what trouble you might have got into if you hadn\u0027t.\u0027 \n \n \"\u0027I\u0027ll do anything you want me to, sir,\u0027 said Mrs. Middlemore, in great distress. \u0027It\u0027s a providence you come up when I opened the street door.\u0027 \n \n \"\u0027It is. You are positive the body was on the bed?\u0027 \n \n \"\u0027If it was the last word I ever had to speak I\u0027d swear to it.\u0027 \n \n \"\u0027I believe you without swearing,\u0027 said our reporter, opening a cupboard door. \n \n \"\u0027What are you looking in there for?\u0027 asked Mrs. Middlemore. \u0027Do you think a dead man \u0027d be able to get up and put \u0027isself on one of the shelves?\u0027 \n \n \"\u0027No,\u0027 said our reporter, with a smile, \u0027but let us make sure the body is not in either of the rooms.\u0027 \n \n \"He looked thoroughly through the apartments, under the bed and the couches, and in every cupboard. Mrs. Middlemore followed his movements with her eyes almost starting out of her head. \n \n \"\u0027Even up the chimneys,\u0027 he said genially, and he thrust the poker up, and then lit some paper in the stoves to see that the smoke ascended freely and that there was no obstruction. \n \n \"\u0027The thoughts you put in one\u0027s \u0027ead,\u0027 remarked Mrs. Middlemore, in a terrified voice, is enough to congeal one\u0027s blood.\u0027 \n \n \"\u0027My dear madam,\u0027 said our reporter, \u0027I am only doing what prudence dictates, so that there may be no possible chance of your getting into trouble. Suppose the body should be found in any other part of the house----\u0027 \n \n \"\u0027But \u0027ow could it get there?\u0027 interrupted Mrs. Middlemore, excitedly. \n \n \"\u0027That is more than either you or I can say, any more than we can say how it got out of this room; but out of it it has got, hasn\u0027t it?\u0027 \n \n \"\u0027Nobody can\u0027t say nothing different,\u0027 assented Mrs. Middlemore. \n \n \"\u0027This is altogether such a mysterious affair,\u0027 proceeded our reporter, \u0027that there\u0027s no telling what it will lead to. I don\u0027t remember a case like it ever occurring in London before. Where was I when you interrupted me? Oh, I was saying, suppose the body should be found in any other part of the house, what would the police say? Why, that for some reason or other--and you may be sure they would put it down to a bad reason--you had removed it for the purpose of concealing it.\u0027 \n \n \"\u0027Me!\u0027 gasped Mrs. Middlemore. What would I do that for?\u0027 \n \n \"\u0027You wouldn\u0027t do it at all, but that\u0027s the construction the police would put on it, and after that you wouldn\u0027t have a moment\u0027s peace. My dear madam, we\u0027ll not give them a chance to take away your character; not a stone shall be left unturned. There are rooms above these?\u0027 \n \n \"\u0027Yes, a lot.\u0027 \n \n \"\u0027We will have a look through them, and, indeed, through the whole house. It\u0027s what the police would do, with the idea that you were a party to some vile plot; it\u0027s what I will do, knowing you to be perfectly innocent.\u0027 \n \n \"He put his design into execution. Accompanied by Mrs. Middlemore, who always kept in the rear, he made a thorough examination of the entire house, from attic to basement, but, as he anticipated, discovered nothing. The last rooms he examined were at the bottom of the house, and it was there he made acquaintance with Mrs. Middlemore\u0027s niece Sophy. \n \n \"\u0027Is that you, aunt?\u0027 the girl called out, from a room adjoining the kitchen. \n \n \"\u0027Yes, it\u0027s me,\u0027 answered Mrs. Middlemore, irascibly. You\u0027re a nice lazy slut, you are, to be \u0027ulking in bed this time of the morning.\u0027 \n \n \"\u0027I ain\u0027t abed, aunt,\u0027 said Sophy, making her appearance, \u0027I\u0027m up; but oh, I\u0027m so sleepy!\u0027 \n \n \"She came into the kitchen rubbing her eyes, and presenting a general appearance of untidiness which did not speak well for her social training. Her short hair was uncombed, her face unwashed, her frock open at the back, and she had no boots on. She stared hard at our reporter, but was not at all abashed at his presence. \n \n \"\u0027I\u0027m a friend of aunt\u0027s,\u0027 said our reporter. \u0027You had better finish dressing, light the fire, and give yourself a good wash, and then get breakfast ready. You needn\u0027t come upstairs till you\u0027re called.\u0027 \n \n \"He beckoned Mrs. Middlemore out of the room, and they proceeded upstairs to the apartments on the first floor. \n \n \"\u0027It will be as well to say nothing before Sophy,\u0027 he said. \u0027Now, if you please, we will go on. It is plain that the body of M. Felix is not in the house; but it must be somewhere. The question is--Where, and how it got there? These rooms were fairly secure before you went to bed last night. Is there a chain on the street door?\u0027 \n \n \"\u0027Yes.\u0027 \n \n \"\u0027Did you put it up before you went down to your bedroom?\u0027 \n \n \"\u0027I puts it up regularly every night.\u0027 \n \n \"\u0027And you did so last night?\u0027 \n \n \"\u0027Yes.\u0027 \n \n \"\u0027And turned the key?\u0027 \n \n \"\u0027Yes.\u0027 \n \n \"\u0027Was the door locked and the chain up the first thing this morning?\u0027 \n \n \"\u0027Yes--no!\u0027 \n \n \"\u0027What do you mean by that?\u0027 \n \n \"\u0027I mean I can\u0027t remember. I must be sure, mustn\u0027t I, sir?\u0027 \n \n \"\u0027You must be sure, there must not be the possibility of a mistake; this putting up of the chain is one of the points upon which a great deal may hang. Do you mean to tell me that you have any doubt on the subject?\u0027 \n \n \"\u0027I can\u0027t say for certain. I was that upset and bewildered when I found M. Felix gone that I don\u0027t remember nothing till you came up to me at the street door. \u0027Ow I opened it, or \u0027ow I got it open, I don\u0027t remember no more than the dead.\u0027 \n \n \"\u0027Think a little; it is not longer than half-an-hour since I saw you. Your memory cannot have deserted you in so short a time.\u0027 \n \n \"\u0027I\u0027ve got no more memory about it than the babe unborn.\u0027 \n \n \"\u0027But you must try to have. It is a fact that the chain either was or was not up, that the door either was or was not locked. Sit down and think about it for a minute or two; I will keep quiet while you think.\u0027 \n \n \"But though the woman obeyed our reporter, and sat down and thought of the matter, or said she did, she declared she could make nothing of it, and had to give it up in despair. \n \n \"\u0027It is awkward,\u0027 said our reporter, \u0027to say the least of it. There is no telling what construction may be put upon your loss of memory.\u0027 \n \n \"\u0027I\u0027m a honest woman, sir,\u0027 said Mrs. Middlemore, looking imploringly at our reporter; \u0027you\u0027ll put in a good word for me?\u0027 \n \n \"\u0027You may depend upon that, for I am convinced you are honest and innocent, but it is unfortunate. If you should happen to remember, you had best let me know before you tell anyone else.\u0027 \n \n \"\u0027Yes, sir, I\u0027ll promise that. I don\u0027t know what I should do without you.\u0027 \n \n \"\u0027Get yourself into serious trouble, for a certainty, Mrs. Middlemore. You go out for your supper-beer every night?\u0027 \n \n \"\u0027Yes, every night; I can\u0027t do without it.\u0027 \n \n \"\u0027Beer is a wholesome beverage, if taken in moderation, which I know is the case with you. Did you go out for it last night?\u0027 \n \n \"\u0027Yes, I did.\u0027 \n \n \"\u0027Before or after you paid your last visit to these rooms?\u0027 \n \n \"\u0027Before, sir, before. You think of everything.\u0027 \n \n \"\u0027It shows that I am doing the best I can for you. Before you came up to these rooms, you had your supper?\u0027 \n \n \"\u0027Yes.\u0027 \n \n \"\u0027Sophy had some with you?\u0027 \n \n \"\u0027Yes. She\u0027s got a twist on her has Sophy.\u0027 \n \n \"\u0027A twist?\u0027 \n \n \"\u0027An appetite. She eats as much as a Grenadier.\u0027 \n \n \"\u0027All growing girls do. How old is Sophy?\u0027 \n \n \"\u0027Fourteen.\u0027 \n \n \"\u0027Then, when you went downstairs, you and Sophy went to bed?\u0027 \n \n \"\u0027Yes.\u0027 \n \n \"\u0027You both sleep in the same room?\u0027 \n \n \"\u0027Yes.\u0027 \n \n \"\u0027In the same bed, most likely?\u0027 \n \n \"\u0027Yes, we do; and the way that girl pulls the clothes off you is a caution.\u0027 \n \n \"\u0027Did you both go to bed at the same time?\u0027 \n \n \"\u0027No, I sent \u0027er before me, and when I went in she was as sound as a top.\u0027 \n \n \"\u0027Are you a sound sleeper yourself?\u0027 \n \n \"\u0027I was before this dreadful thing \u0027appened, but now I pass the most fearful nights.\u0027 \n \n \"\u0027Dreams?\u0027 \n \n \"\u0027Awful.\u0027 \n \n \"\u0027How about last light? Don\u0027t answer hastily. This is another important point.\u0027 \n \n \"Thus admonished, Mrs. Middlemore took time to consider; and no doubt it was with a certain regret that she felt constrained to say, \u0027I think I must \u0027ave slept better than ordinary. I was that tired that my legs was fit to drop off me.\u0027 \n \n \"\u0027You slept very soundly?\u0027 \n \n \"\u0027I must \u0027ave done, mustn\u0027t I, sir?\u0027 \n \n \"\u0027That is for you to say. You see, Mrs. Middlemore, the body of M. Felix could not have been removed without a certain noise. Now, if you were awake you must have heard it.\u0027 \n \n \"\u0027I didn\u0027t \u0027ear nothing. I\u0027ll take my Bible oath of it.\u0027 \n \n \"\u0027At what hour did you wake this morning?\u0027 \n \n \"\u0027At \u0027alf-past eight, and I got up at once.\u0027 \n \n \"\u0027Isn\u0027t that rather late for you?\u0027 \n \n \"\u0027It is, sir, but I\u0027ve got no one to attend to now.\u0027 \n \n \"\u0027You were not in any way disturbed in the night?\u0027 \n \n \"\u0027No, sir.\u0027 \n \n \"\u0027You positively heard nothing?\u0027 \n \n \"\u0027Nothing at all.\u0027 \n \n \"\u0027Did Sophy?\u0027 \n \n \"\u0027Love your \u0027eart, sir! Sophy wouldn\u0027t wake up if cannon-balls was firing all round her!\u0027 \n \n \"\u0027As a matter of fact, has she told you she heard nothing last night?\u0027 \n \n \"\u0027I won\u0027t say that. I ain\u0027t \u0027ad time to arks her.\u0027 \n \n \"\u0027I\u0027ll ask her myself if you\u0027ve no objection. Stop here for me; I shall not be gone long.\u0027 \n \n \"\u0027I can\u0027t stop \u0027ere alone, sir. I\u0027ll come down, and keep in the passage while you speak to Sophy.\u0027 \n \n \"They went down together, and Mrs. Middlemore remained outside while our reporter entered the kitchen. \n \n \"His entrance aroused Sophy, who had been sitting in a chair, apparently asleep, in the same state of untidiness as he had left her. She fell on her knees with a guilty air, and began to rake out the stove, making a great rattle with the poker. \n \n \"\u0027Fire not lit yet, Sophy?\u0027 said our reporter, much amused. \n \n \"She looked up with a sly look, and seeing that he was not going to scold her, rubbed her nose with the poker and smiled boldly at him. \n \n \"\u0027Not yet, old \u0027un,\u0027 she replied, making no attempt to continue her work. \n \n \"To be addressed as \u0027old \u0027un\u0027 must have been especially humiliating to our reporter, who is a good-looking fellow of eight-and-twenty, but he did not resent it. \n \n \"\u0027Wood won\u0027t catch, I suppose,\u0027 he said. \u0027Too damp, eh?\u0027 \n \n \"\u0027Soppin\u0027,\u0027 said Sophy, though as a matter of fact there was no wood before her. \n \n \"\u0027What are you looking so hard at me for?\u0027 asked our reporter. \u0027You\u0027ll make me blush presently.\u0027 \n \n \"\u0027You blush!\u0027 laughed Sophy. \u0027I like that, I do. Look \u0027ere, old \u0027un. When you wants to blush, you\u0027d better \u0027ire somebody to do it for you. I\u0027ll do it for tuppence a time.\u0027 \n \n \"\u0027You would have to wash your face first,\u0027 said our reporter, entering into the humor of the situation. \n \n \"\u0027I wouldn\u0027t mind doing that,\u0027 said Sophy, staring harder than ever at him, \u0027if you\u0027d make it wuth my while. As for lookin\u0027 at you, a cat may look at a king.\u0027 \n \n \"\u0027I\u0027m not a king,\u0027 observed our reporter, \u0027and you\u0027re not a cat.\u0027 \n \n \"\u0027Call me one, and you\u0027ll feel my clors. I\u0027m reckonin\u0027 of you up, that\u0027s what I\u0027m doing of.\u0027 \n \n \"\u0027And what do you make of me, Sophy?\u0027 \n \n \"\u0027I sha\u0027n\u0027t tell if you\u0027re going to act mean. \u0027Ansom is that \u0027ansom does.\u0027 \n \n \"Our reporter took the hint, and gave the girl a sixpenny-piece. \n \n \"\u0027I say,\u0027 cried Sophy, greatly excited, as she tried the coin with her teeth. \u0027Stow larks, you know. Is it a good \u0027un?\u0027 \n \n \"\u0027Upon my honor,\u0027 said our reporter, placing his hand on his heart, with a mock heroic air. \n \n \"\u0027Say upon your soul.\u0027 \n \n \"\u0027Upon my soul, if you prefer it.\u0027 \n \n \"\u0027Change it for me, then. I\u0027d sooner \u0027ave coppers.\u0027 \n \n \"Our reporter had some in his pocket, and he counted out six into Sophy\u0027s grimy palm. A seventh, by accident, fell to the floor. Sophy instantly picked it up. \n \n \"\u0027Findin\u0027s keepin\u0027s,\u0027 she said. \n \n \"\u0027I\u0027m agreeable. And now what do you make of me?\u0027 \n \n \"\u0027Wait a bit,\u0027 said Sophy. Unblushingly she lifted her frock, and tied the coppers in her ragged petticoat, tightening the knots with her teeth, which were as white as snow. \u0027That\u0027s my money-box, and I\u0027ve got some more in it. What do I make of you? Oh, I knows what you are. You can\u0027t gammon me.\u0027 \n \n \"\u0027What am I?\u0027 \n \n \"\u0027You belong to the Perlice Noos, that\u0027s what you do. You\u0027ve come to make pickchers. Pickcher of the \u0027ouse where the body was found. Pickcher of the room where the body was laid. Pickcher of the body\u0027s bed. Pickcher of the body\u0027s slippers. Pickcher of Mrs. Middlemore, the body\u0027s \u0027ousekeeper. Oh, I say, make a pickcher of me, will you? I\u0027ll buy a copy.\u0027 \n \n \"\u0027Perhaps, if you\u0027re good. But you must answer a question or two first.\u0027 \n \n \"\u0027All serene. Fire away!\u0027 \n \n \"\u0027You went upstairs last night with your aunt after you had your supper?\u0027 \n \n \"\u0027Yes, I did.\u0027 \n \n \"\u0027You did not go into the rooms?\u0027 \n \n \"\u0027No, I didn\u0027t.\u0027 \n \n \"\u0027Because you were frightened?\u0027 \n \n \"\u0027Gammon! It\u0027d take more than that to frighten Sophy.\u0027 She added, with a sly look, \u0027Aunty\u0027s easily kidded, she is.\u0027 \n \n \"\u0027Ah,\u0027 said reporter, somewhat mystified, \u0027then you came down and went to bed?\u0027 \n \n \"\u0027Yes, I did, and precious glad to get there.\u0027 \n \n \"\u0027You like your bed, Sophy?\u0027 \n \n \"\u0027Rather.\u0027 \n \n \"\u0027And you sleep well?\u0027 \n \n \"\u0027You bet!\u0027 \n \n \"\u0027Did you sleep better or worse than usual last night?\u0027 \n \n \"\u0027No better, and no wus.\u0027 \n \n \"\u0027Did you wake up in the night?\u0027 \n \n \"\u0027Not me!\u0027 \n \n \"\u0027Then you heard no noise?\u0027 \n \n \"\u0027Where?\u0027 \n \n \"\u0027Anywhere.\u0027 \n \n \"\u0027I didn\u0027t \u0027ear nothink. \u0027Ow could I?\u0027 \n \n \"\u0027Thank you, Sophy. That is all for the present.\u0027 \n \n \"\u0027I say,\u0027 cried Sophy, as our reporter was about to leave the kitchen, \u0027you\u0027ll take my pickcher, won\u0027t you?\u0027 \n \n \"\u0027I\u0027ll think about it. I\u0027ll see you another time, Sophy; and look here,\u0027 added our reporter, who is never known to throw a chance away, \u0027here\u0027s my card; take care of it, and if you find out anything that you think I\u0027d like to know about M. Felix, come and tell me, and you shall be well paid for it. You\u0027ll not forget?\u0027 \n \n \"\u0027No, I won\u0027t forgit. Anythink about M. Felix, do you mean?\u0027 \n \n \"\u0027Yes, anything.\u0027 \n \n \"\u0027All right, old \u0027un. I\u0027ll choo it over.\u0027 Here Sophy dropped her voice, and asked, \u0027Is Aunt outside?\u0027 \n \n \"\u0027Yes. Can you keep a secret?\u0027 \n \n \"\u0027Try me,\u0027 said Sophy, holding out the little finger of her left hand. \n \n \"\u0027What am I to do with this?\u0027 \n \n \"\u0027Pinch my nail as \u0027ard as you can. Never mind \u0027urting me. As \u0027ard as ever you can. \n \n \"Our reporter complied, and Sophy went audibly through the entire alphabet, from A to Y Z. \n \n \"\u0027There,\u0027 said Sophy, \u0027did I scream when I came to O?\u0027 \n \n \"\u0027You did not,\u0027 said our reporter, remembering the child\u0027s game. \u0027You bore it like a brick.\u0027 \n \n \"\u0027Don\u0027t that show I can keep a secret?\u0027 \n \n \"\u0027It does. Well, then, don\u0027t tell your aunt that I gave you my card, or asked you to come and see me.\u0027 \n \n \"\u0027I\u0027m fly.\u0027 \n \n \"Giving him a friendly wink, Sophy went on her knees, and made a pretence of being very hard at work cleaning the grate. The last words he heard were: \n \n \"\u0027Pickcher of Sophy wearin\u0027 \u0027erself to skin and bone. Ain\u0027t I busy?\u0027\" \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/1658/48884.html","bookId":1202,"book":{"id":1202,"title":"The Mystery of M. Felix","description":"简介： Through the whole of the night, chopping, shifting winds had been tearing through the streets of London, now from the north, now from the south, now from the east, now from the west, now from all points of the compass at once; which last caprice--tak...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1658","creation":"Aug 1, 2019 12:24:36 AM","modification":"Aug 1, 2019 12:24:36 AM"}}
