{"id":98935,"no":16,"title":"Page 16","content":"\\n\\n Next I called Gwen. “You want to come into Boston for lunch on a Sunday?” I asked. That was usually a family day in the Santini household.\\n\\n “Nick is taking Maria and Zack to a community basketball tournament,” she said. “It’ll last all day. That leaves me with the baby, and I’ll call his sitter. You and I didn’t have much of a chance to talk last night.” I had a feeling Gwen wasn’t in the mood for a sociable chat, but we agreed to meet at a diner near South Station at noon.\\n\\n I got a cotton ball from the bathroom and swiped it along the blade of the Old One’s sword. Brown Robe had sawed at Juliet’s leg with one edge of the sword; I was careful to take the sample from the other edge. The cops had a sample of Juliet’s DNA on file—as they did for every resident of Deadtown—and I didn’t want to hand the Goon Squad any leads in their search for her. I dropped the cotton ball in a plastic bag, sealed it, and put it in my purse.\\n\\n Next, I went back into the bathroom and rummaged through the medicine cabinet until I found the jar of salve Mab had given me. I removed the lid and sniffed the contents. It had a deep, earthy scent, overlaid with lighter notes of herbs and some kind of flower—lilac, maybe? It smelled like health, like spring. This salve had helped me recover from a Morfran attack without a scar. The attack had been bad: dozens of demonic crows swooping at me, tearing at my flesh with their beaks and talons. Yet the salve had made me whole again. My skin tingled with the memory of its healing coolness. I hoped it would do the same for Juliet.\\n\\n BACK AT CREATURE COMFORTS, I STOOD OVER JULIET’S bed. She lay still, no rise and fall of the chest to suggest she’d ever open her eyes again. She looked so vulnerable. I thought of all the horror movies that showed a vampire looming over some sleeping innocent, eager to do harm. But Juliet was the defenseless one here. Anyone who managed to find her—Goon Squad cop, Old One, even a Humans First fanatic—could do her harm.\\n\\n The thought made me feel creepy, since I was the one standing over Juliet’s bed. But I was here to help her, and she’d given me permission to use the salve. Still, it felt wrong somehow to pull back the comforter and expose her leg as she slept, completely dead to the world. I did it, anyway.\\n\\n I studied the wound, looking for any sign of healing, but I had to admit it looked worse. The leg was swollen and purple, still hot to the touch. If nothing else, the salve should cool it. I scooped some from the jar and spread it on the affected area as gently as I could.\\n\\n Juliet didn’t move, didn’t even twitch.\\n\\n I watched for a few minutes. The purple lightened a bit, grew a shade pinker. Or maybe I was imagining that in my hope of seeing some improvement. I spread on another layer of salve, then covered Juliet’s leg with the comforter. I placed the jar of the salve on the nightstand where she could reach it.\\n\\n “Sleep well,” I said softly before I clicked off the light. “ ‘Sleep dwell upon thine eyes, peace in thy breast!’ ”\\n\\n Damn, listen to that. I’d come up with a good Shakespeare quote—from Romeo and Juliet, no less—and Juliet wasn’t awake to hear it. Sometimes Juliet wanted to conduct whole conversations in Shakespearean. When she did, I could never cough up any apt lines. She wouldn’t believe me when I told her. But that didn’t matter. Shakespeare or not, the words expressed what I wanted to say.\\n\\n WHEN I ARRIVED AT THE PRECINCT A FEW MINUTES BEFORE ten, Daniel was already waiting in the lobby. He looked restless, running his hands through his blond curls and checking his watch. Although we’d spoken on the phone a few times, I hadn’t seen him since the Paranormal Appreciation Day concert a month ago. I was shocked to see how haggard he looked: his mouth grim, his bloodshot eyes smudged with dark circles. The Reaper case must be running him ragged. Still, he smiled when he saw me. His expression brought back the old Daniel, the one whose smile always went straight to my core.\\n\\n “Let’s walk,” he said, taking my elbow and ushering me toward the door. “It’s a nice day, and I feel like getting outside.”\\n\\n “All right.”\\n\\n It was a nice day. I’d been so worried about Juliet that I’d barely noticed. Bright sunshine made the soft, early spring air feel almost warm on my face. Somewhere a robin was singing loudly enough to be heard over the passing cars. But even though he’d suggested the walk, Daniel didn’t seem to enjoy it. His back was rigid, and a muscle twitched in his jaw.\\n\\n After we’d gone half a block, he looked more relaxed. “I needed to get out of there. My new partner is driving me crazy. Foster. He watches me like a hawk. Anything out of the routine and he goes running to Hampson.”\\n\\n Fred Hampson, Boston’s police commissioner, was a virulent hater of all things paranormal. He made no secret of the fact that he was a founding member of Humans First, and he’d publicly endorsed Seth Baldwin, the anti-paranormal candidate, for governor in the last election.\\n\\n “Your partner knows I’m a shapeshifter.” I was pretty sure he didn’t like me, either. I’d been present when Foster had gotten into an ill-advised wrestling match with a zombie in Creature Comforts. I’d rooted for the zombie.\\n\\n “And there’s no reason Hampson needs to find out I’m talking to you. It’s none of his damn business who my friends are.” That twitch in his jaw started up again. “I can’t stay out long. Everyone’s working around the clock on these damn Reaper murders. There’s a lot of pressure on the department to get results, and fast. Nobody’s happy when there’s a serial killer on the loose.” His fingers combed his curls. “And I want to catch the bastard before there’s another killing.”\\n\\n I was glad I had some information, that I wasn’t just asking Daniel a favor. “That’s one of the things I wanted to talk to you about. I don’t know if this will be any help, but my aunt Mab told me that serial killers are usually possessed by the Morfran.”\\n\\n A crease appeared between his eyebrows. “You mean those giant crows that attacked the crowd at the Paranormal Appreciation Day concert?”\\n\\n “They’re not really crows. They’re a spirit, a demonic spirit. But yes, that’s what I mean.”\\n\\n Daniel stopped in his tracks. A woman behind us bumped into him and cursed. He didn’t seem to notice. “But Vicky, that’s great!” He grinned, and I wondered why he seemed so happy at the prospect of tangling with the Morfran again. “I saw what you did that night, how you used your black dagger to get rid of them. You can do that again, right? You can pull the urge to kill out of the Reaper.”\\n\\n “I wish.” It was a good idea, but it wouldn’t work. “The Morfran has to be loose—a free-floating spirit—for that ritual to imprison it. When the Morfran possesses someone, it becomes part of that person.”\\n\\n “Well, is there any way to . . . I don’t know, call the Morfran? Flush the killer out of hiding?”\\n\\n It might be worth trying, but I didn’t know the answer. “I’ll ask Mab. If it’s possible, she’ll know how to do it.”\\n\\n “Get back to me as soon as you can, okay? The Reaper’s first two victims were forty-eight hours apart. We’re worried he’ll strike again tonight.”\\n\\n “He?”\\n\\n “He, she, it. I wish we knew even that much. Your information might be our first break.” He pulled back his sleeve to look at his watch, and we turned back toward the precinct. “So,” Daniel said, “you mentioned a favor.”\\n\\n I crossed my fingers. If Daniel couldn’t help me, I didn’t know who to ask. “I was hoping you might be able to get one of your guys in forensics to analyze something for me. Check for poison—and whether there’s an antidote.”\\n\\n “Possibly. But what—?”\\n\\n “I can’t tell you. Please don’t ask.”\\n\\n “You’re not . . .” The crease between his eyebrows was deeper this time. “You wouldn’t use it against someone, right?”\\n\\n “Of course not.”\\n\\n The crease disappeared, but no smile replaced it. “I didn’t think you would.”\\n\\n “But you had to ask. I understand. And I don’t mind addressing that. I’m looking to heal, not hurt.” I pulled the plastic bag holding the cotton ball from my purse. Daniel took the bag and put it in his jacket pocket.\\n\\n “I’ll see what I can find out.”\\n\\n We were back at the precinct. We stopped in front of the glass doors, and I put a hand on his arm. “The sooner the better. All right? It’s . . . it’s important.”\\n\\n He started to say something, then cut himself off with a nod. He turned and went inside.\\n\\n 10\\n\\n THE KNEELAND STREET DINER, WHERE I WAS MEETING GWEN, is a 1940s diner that’s never aspired to join the twenty-first century. It’s famous as a late-night hot spot, a place to go for munchies after the bars close.\\n\\n If you stop by Kneeland Street at two a.m. on a weekend, you can expect to join a line stretching halfway down the block. Lunchtimes are a little less crowded, but not much, even on a Sunday. I was glad to arrive a little early and snag a place in line. You had to wait longer if you preferred one of the ten or so booths to a seat at the counter, and I suspected Gwen would want some privacy for our conversation.\\n\\n I was second in line when I spotted Gwen coming from the direction of South Station, pushing a stroller. I waved, and she steered toward me. She must not have been able to get a sitter on short notice, but I was glad to see the baby. Actually, Justin wasn’t much of a baby anymore, I thought, as Gwen came up. He was two already, a toddler with two settings: Go and Go Faster.\\n\\n We snagged a booth right away. I held my nephew, who squirmed to escape my grasp, while Gwen folded the stroller. The waitress fussed over Justin, produced a high chair, and then fussed over him some more. She gave us menus and took our order for coffee, plus apple juice for the baby. “Big boy!” Justin shouted, pounding on his tray. I was hungry and in the mood for breakfast, which this diner serves round the clock, so I ordered the banana French toast. Gwen hesitated. She started to ask about the grilled chicken salad, then abruptly changed her mind. “I really shouldn’t, but . . . Oh, what the hell—heck.” She glanced at Justin, who was tearing up a napkin and dropping the pieces on the floor. “Bring me a cheeseburger with fries.” She flipped a page on the menu. “And a strawberry frappe.” \\n\\n","sourceLink":"https://allnovel.net/bloodstone-deadtown-3/page-16.html","bookId":2611,"book":{"id":2611,"title":"Bloodstone (Deadtown #3)","description":"Storyline: Bloodstone (Deadtown #3) \\n Boston’s diverse South End is known for its architecture and great restaurants, not its body count. So when mutilated human corpses begin turning up in the area, the entire city takes notice. The killer—dubbed the South End Reaper—uses a curved blade for his grisly work. And even though there’s no real evidence pointing to a paranormal culprit, the deaths are straining the already-tense relations between Boston’s human and inhuman residents. \\n As the bodies pile up, Vicky, her formidable aunt Mab, and her werewolf boyfriend Kane investigate, only to find that the creature behind the carnage is after something much more than blood… \\n Publishers Weekly says, “Fans of Holzner’s other Deadtown novels will enjoy this solid yarn.”\\n","cover":"https://allnovel.net/images/bloodstone-deadtown-3.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/bloodstone-deadtown-3.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:36:28 PM"}}
