{"id":98973,"no":55,"title":"Page 55","content":"\n Wyllt doubled over, clutching its abdomen. Black, stinking bile gushed from the wound. Demon flesh melted. Smoke surged. I kept striking and slashing. The demon’s body wavered. It softened and grew spongy, then melted into a waterfall of black blood and liquefied flesh. The remains of the demon puddled on the concrete floor.\n From the puddle, a form took shape. Myrddin, his demon half gone, reemerged. He lay slumped against the wall, his body broken, his eyes closed. I checked for a pulse and found none.\n In the glowing light from the bloodstone, Viviane nodded, grim satisfaction on her face. Her image faded, along with the silvery light.\n Screams echoed from somewhere deep in the underground network of rooms.\n I ran over to Juliet and pulled out the spikes that impaled her. I worked as quickly as I could, but carefully. Too much of her weight on the wrong spike would cause more damage.\n She was too weak to stand. I lowered her to the ground and removed the silver gag. She licked her lips. “I was the first one to survive the virus,” she said. “So they were trying to see if they could kill me.” Her eyes fluttered. “I think maybe they succeeded.”\n The bloodstone pulsed. I opened my hand. Red with my blood, glowing, it was larger than before. The setting had cracked and fallen away in places, but the broken chain was still attached. I tied its ends in a clumsy knot, then lifted the chain over her head and positioned the pendant so the bloodstone hung over her heart. Then, without knowing why, I traced the eihwaz rune on her forehead like a blessing.\n Juliet gasped. Her body went rigid, then shuddered. Her wounds shrank and closed. Her eyes flew open and she looked around the room.\n “What’s that wizard doing?” she cried.\n Myrddin wasn’t dead. He still slumped on the ground, but he held the metal probe with both hands. The probe protruded from his chest, where he’d stuck it deep into his own heart.\n I raced over and tried to tug it out. He fought me with surprising strength, struggling to keep the probe in his own heart. I kicked him and tugged harder. Inch by inch, the probe gave.\n Kane appeared at the back of the room, bruised and bloody, his clothes torn.\n I looked at him. “Are you—?”\n Myrddin wrenched the probe from my hands and drove it deeper into his heart.\n Kane fell to his knees. On the table, Pryce convulsed.\n Myrddin giggled. “I win, my girl. Tell Viviane I’ll see her in hell.” The giggle cut off abruptly as the triumphant light faded from his eyes.\n 32\n “FATHER!” PRYCE GASPED AND SAT UP ON THE TABLE, LOOKING around, pulling needles from his body. His face twisted with hatred when he saw me.\n “You,” he sneered. With amazing agility for someone who’d been comatose for a month, he jumped from the table. To his left, he saw Myrddin’s corpse. “What did you do to my father?”\n I grasped the Sword of Saint Michael; its flames blazed to life as I raised it. “The same thing I’m about to do to you.” I raised my sword and charged, aiming to plunge the point into Pryce’s heart.\n He dodged to the far side of the table. As he did he raised his hand, palm out, and pushed toward me. A rectangle of energy pulsed out. The Sword of Saint Michael passed through, but when the energy hit me it knocked me backward. My ass landed hard on the concrete floor.\n I’d never seen Pryce do that before. But Myrddin had used the same gesture when Mab attacked him at Back Street.\n Pryce looked as surprised as I was. He looked at the ceiling, then at the floor where Myrddin lay, then back at the ceiling again. “Father?”\n I got to my feet.\n Pryce laughed. The sound emerged as a giggle.\n I charged again. And again, Pryce used magic to knock me back.\n He hurled a fireball at me. I sliced it in two with my sword.\n Throwing fireballs, Pryce edged toward the entryway. His aim was bad, but the strength and sheer number of his missiles kept me back.\n Near the door, the fireball he tried to throw fizzled and extinguished in his hands. He turned and ran.\n I ran after him.\n “Vicky!” Juliet yelled behind me. “Kane needs your help!”\n I stopped in my tracks and turned around. “There’s silver in him,” she said. “I can’t get it out. It’s killing him.”\n Outside, cans bounced and rolled as Pryce found his way out the hidden door.\n Behind me, Kane groaned, the sound weak and shot through with pain.\n I let Pryce go and ran back to Kane.\n KANE LAY UNMOVING ON THE FLOOR, HIS EYES SHUT, HIS skin ashen. His breath tore from his throat in ragged gasps. The flesh around the bullet wound had blackened and blistered, classic signs of silver burn. He felt hot all over, and his heart beat erratically, like it had lost its normal rhythm and couldn’t find it again.\n Around his neck, he wore the bloodstone.\n “He was having seizures,” Juliet said. “The pendant helped me; I thought it would help him, too. But he’s not getting better.”\n At least the seizures had stopped. But we had to get the silver out. There must be a fragment of Norden’s bullet still inside him. I needed something to dig it out with.\n I rushed back to the table where the Old Ones had held me down. Myrddin had cut me with something. I found it on the table where he’d dropped it—a scalpel.\n In the few moments I was gone, Kane had gotten worse. The silver burn had spread across his chest and down his arm to the elbow. It would be spreading inside, too.\n Mab’s bloodstone wasn’t healing Kane. I took it off and put it around my own neck. First, remove the silver. After it was out, maybe the bloodstone would help Kane, as it had Juliet. If it wasn’t too late.\n Sweat beaded on Kane’s forehead as I searched the wound. His unconscious body spasmed as I hunted for the fragment. I was hurting him, and I hated that, but the silver was hurting him more. I had to get it out.\n I saw blood and flesh and bone. But no scrap of silver. I cut a little more. Kane groaned, and I felt sick inside.\n The scalpel revealed a tarnished point. I dug a little deeper, trying to get the scalpel under it, and I could see more of the fragment. I attempted to lift the fragment with the blade, but it wouldn’t come. Some jagged part was caught in the flesh. As gently as I could, I cut a little more. It still wouldn’t come; I’d have to grip it somehow. Holding back the flesh with the scalpel, I reached in with my thumb and finger. Unsanitary, but werewolves aren’t vulnerable to many infections. Right now, a few bacteria were the least of Kane’s worries.\n Blood smeared my fingers, making them slippery, but I got the edge of the fragment between my fingernails. When I had a good grip on it, I pulled gently. Kane shuddered as I drew the silver through his flesh. Slowly, carefully. And then it was out: an inch-long, twisted piece of blackened, bloody silver.\n As soon as the silver left his body, Kane gasped. His back arched. His eyes opened, and then immediately squinched in pain. The half-man, half-wolf writhed on the floor, his limbs twisting. An energy field built around him.\n I scrambled backward, out of reach of the blast of energy that would come at the moment of change.\n Which way would he shift? I couldn’t tell. Fur grew, then receded. His arms shrank to forelegs, while his legs stayed human. His skull shifted so fast, to so many different forms, I couldn’t tell what shape it was taking.\n The energy blasted out. I closed my eyes and shielded my face with my arms. Energy flared and pulsed for a long time—so long I was afraid it would burn him up, consume him entirely so that there’d be nothing left, man or wolf.\n Finally it subsided. A naked man lay on the floor, bloody and silver-burned and absolutely beautiful. Kane was back.\n He sat up, and I tackled him in a hug. His strong arms encircled me, and I covered his face with kisses. His human face. Everything about him—his skin, his features, his limbs—was a miracle. I looked into his gray eyes. They were the same eyes I’d searched for some sign that Kane would come back to me. Man or wolf, Kane had always been in those eyes.\n He pulled me to him. His lips found mine. His tongue was in my mouth, hungry, frantic, hot. He pulled back and held my face in both his hands.\n “Do you know how long I’ve been wanting to do that?” His voice, rough and husky with disuse, sent a thrill through me.\n Somewhere behind us, Juliet cleared her throat. “Um, pardon me for interrupting,” she said, “but do either of you hear anything?”\n Kane turned toward the hidden entrance and listened. “There are people out in the tunnel,” he said. “Probably cops, but I don’t think we should wait around to find out.” He pulled the sheet from the table where Pryce had lain and wrapped it around himself. “Come on, there’s a back way out. I chased some Old Ones through it.” He took my hand and we ran toward the back of the room.\n I carried the Sword of Saint Michael before me like a torch, partly for light and partly to keep back any Old Ones or vampires who might be hanging around. Kane walked beside me, holding my hand. Juliet followed, and I kept turning around to make sure nothing had snatched her away. Shouts of “Police!” erupted behind us as we quietly moved deeper through tunnels and turnings. No one leapt out at us; no one came after us.\n Kane’s hand was warm in mine. As we walked side by side, my flame held aloft, his broad chest gleaming in its light, I felt like we were the first explorers of some ancient world.\n After a while, the three of us emerged onto a deserted platform at South Station. The station clock read 4:47 in the morning. It felt like I’d left Deadtown a century ago.\n “Juliet,” I said, removing the bloodstone from my neck. “Take this to Mab. She needs it as soon as you can get it there.” I hoped we weren’t too late. I didn’t know how Viviane had appeared in the bloodstone’s glow, but I was worried about what her appearance had cost Mab.\n Juliet took the pendant. I also gave her the Sword of Saint Michael to take home for me. “‘Your bidding shall I do effectually.’” It was good to hear her spout Shakespeare. She made an elaborate stage bow, and then she was gone. Damn, I wished I could move that fast. I’d be at Mab’s side now. \n","sourceLink":"https://allnovel.net/bloodstone-deadtown-3/page-55.html","bookId":2611,"book":{"id":2611,"title":"Bloodstone (Deadtown #3)","description":"Storyline: \n Bloodstone (Deadtown #3) \n Boston’s diverse South End is known for its architecture and great restaurants, not its body count. So when mutilated human corpses begin turning up in the area, the entire city takes notice. The killer—dubbed the South End Reaper—uses a curved blade for his grisly work. And even though there’s no real evidence pointing to a paranormal culprit, the deaths are straining the already-tense relations between Boston’s human and inhuman residents. \n As the bodies pile up, Vicky, her formidable aunt Mab, and her werewolf boyfriend Kane investigate, only to find that the creature behind the carnage is after something much more than blood… \n Publishers Weekly says, “Fans of Holzner’s other Deadtown novels will enjoy this solid yarn.”\n \n","cover":"https://allnovel.net/images/bloodstone-deadtown-3.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/bloodstone-deadtown-3.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:36:28 PM"}}
