{"id":101045,"no":56,"title":"Page 56","content":"\\n\\n Kane caught me in his arms. His skin was warm despite the early-morning chill. I ran my hands over his back, feeling its muscles, amazed at the smoothness of it. Amazed to have him with me again.\\n\\n But time was short. We couldn’t be here embracing on the platform when the first train pulled in. Hard as it was, I stepped away.\\n\\n “I have to get back to Mab,” I said. “I need to know she’s all right.”\\n\\n Kane traced one finger along my cheek. Desire lit his eyes and reached out to me, but he nodded. “How are you going to get there?”\\n\\n “The only way I can think of. I’m going to shift into a bird.”\\n\\n “Are you sure you’ll know to fly to Deadtown?”\\n\\n “I think so. The moon isn’t strong right now. I’ll hold the idea of going home in my mind and hope it leads me there.” I touched his arm. “Will you be all right?”\\n\\n He nodded. “I’ll hide out in my office for a few days. I practically live there, anyway. I’ve got a change of clothes, food, coffee.” Kane’s staff was all paranormal, so no one would be coming in to work for another day. “Once the containment order is lifted, I’ll call Carlos and have him bring my impersonator back from D.C.”\\n\\n We walked outside, our arms around each other. On the sidewalk, we kissed. Then Kane turned toward Government Center. He kept close to the buildings, out of sight of any passing cars, but the streets were quiet. Soon, he melted into the shadows, and I couldn’t see him anymore.\\n\\n I walked out Summer Street, toward the water. The sky was beginning to brighten in the east, and somewhere birds were singing. I stood and listened. I pulled their song into me, letting the notes fill me with lightness. I imagined stretching out my wings, letting the air hold me up, the currents carry me over the city, toward home. It was time to go home. Then energy blasted out, and all I knew was that I was flying, soaring over the water, happy it was spring.\\n\\n 33\\n\\n I CAME BACK TO MYSELF ON THE ROOF OF A BUILDING. The sun warmed my back and my first thought was, “Maria was right. Flying dreams are the best.”\\n\\n My next thought was of Mab. Had Juliet returned the bloodstone to her? Was she all right? Could I get to her?\\n\\n I got up and went to the edge of the roof to see where I was. Deadtown lay below me. It was daytime, so the streets weren’t as crowded as at night, but the curfew seemed to make people want to get out while they could. Bundled-up zombies trundled along in twos and threes, an occasional werewolf or other paranormal threading their way through them. I recognized the street below—mine. In fact, I was on the roof of my own building. I’d made it home. I stepped back from the edge before someone looked up and pointed out the naked woman on the roof.\\n\\n Naked. That presented a problem. I wasn’t used to streaking through the halls of my building, and I’d prefer not to bump into any neighbors au naturel. I glanced around the roof. I’d never been up here before. If I was lucky, maybe somebody had set up a clothesline to give their laundry that fresh-air smell. I didn’t see anything like that, but I did see a red, blue, and yellow beach umbrella. Odd. I went over to investigate.\\n\\n Under the colorful umbrella sat a beach chair, a cooler, and a half-full wading pool. On top of the chair was a neatly folded pile of clothes: knee socks, long pants, a long-sleeved turtleneck, gloves, scarf, ski mask, and wide-brimmed hat. Zombies are oblivious to temperature, but the spring sunshine had obviously made someone yearn for the beach. Sunbathing, zombiestyle. Only in Deadtown.\\n\\n I pulled on the pants and shirt. I’d return them later, but now I needed to get to Mab.\\n\\n I hurried down the stairs to my floor, worried about my aunt. Had the bloodstone reached her in time? I had to believe it did. But what condition would she be in? Would she still be the Mab I knew? Or had the last several days wrought some permanent change even the bloodstone couldn’t undo?\\n\\n My heart pounded as I knocked on the door to my apartment. Juliet answered. She hugged me and then threw the door wide open. Inside, two figures sat on the couch, their heads—one gray-haired, one blond—bent over a book.\\n\\n “There,” Mab was saying, “there’s the answer you want. Reread this section, and pay attention this time. I’ll quiz you again in ten minutes.”\\n\\n “Mab?”\\n\\n “Victory? You’re home?”\\n\\n Mab stood, and she wasn’t the Mab I knew. She looked younger.\\n\\n I’d always thought of my aunt as a very youthful sixty, but the bloodstone’s restoration had taken ten or fifteen years off that. Her hair was still gray, but her face was unlined, her complexion glowing, her eyes sparkling clear. She stood straight and tall and rushed over to me with a vigor I almost envied.\\n\\n We met in a hug. My aunt isn’t the hugging type, but she clasped me to her like she’d never let go. She even lifted me off my feet. I felt the bloodstone’s warmth between us. Finally, with her customary onetwothree pat, she put me down and stepped back.\\n\\n “And once again I have to ask,” Tina said from the sofa, “what are you wearing?”\\n\\n I looked down. Gauzy purple harem pants an inch too short and a fuzzy orange turtleneck. Focused on Mab, I’d barely noticed the clothes as I put them on.\\n\\n “You know,” Tina continued, “you should be my apprentice. Like, in fashion school.”\\n\\n Tina stood. Her oversized T-shirt showed a skull and crossbones sporting a glittery pink bow. Um, yeah. If that had been my only option on the roof, I’d have come downstairs naked.\\n\\n “Tina, Juliet,” Mab said. “I must have some time alone with my niece.”\\n\\n “I was about to resume the shroud, anyway,” Juliet said. She went into her bedroom and closed the door. Tina, pulling on gloves, said, “Just wait ’til you hear how good I’ve gotten with Inimicus. You’ll tell her, won’t you, Mab?”\\n\\n “I’ll give her a full report,” Mab replied, and Tina left beaming.\\n\\n I couldn’t stop staring at my aunt. “You look amazing,” I said.\\n\\n She smoothed her hair, seeming pleased and a bit flustered. “That’s thanks partly to you,” she said. “Sit, child, and we’ll talk.”\\n\\n We sat together on the sofa, where Mab had been sitting with Tina. I put an arm around my aunt’s shoulders and squeezed.\\n\\n “What happened last night?” I asked. “I realize my blood helped to renew the stone, but how did Viviane appear like that?”\\n\\n “Yes, your blood did renew the stone. When that happened, I felt its power surge, demolishing Myrddin’s cloaking spell. Once I felt the stone again, I was able to reconnect with it.” She looked at me sideways. “Thanks to some help from your sister.”\\n\\n “From Gwen?” Maybe I’d heard wrong. I only had one sister. “What do you mean?”\\n\\n Mab examined her hand, as she had the other day, turning it back and forth, looking at skin that was now firm and smooth. “Do you recall how, when my body was failing, I said there were things I needed to explain?”\\n\\n “Yes, but I thought Gwen would never listen.” Twenty years is a long time to hate someone.\\n\\n “You’re right, she wouldn’t have. For all those years she clung to her belief in what she saw—or what she thought she saw.” Sadness crossed Mab’s face, hinting at how much the rift with Gwen had pained her. “A traumatic event like that leaves a deep scar, the kind that marks our dreams. So I monitored Gwen’s dreams. I guessed that, especially with my arrival stirring up the past, she’d dream about that night. When she did, I extended the dream.”\\n\\n “You showed her the part she didn’t see.” If seeing is believing, show her the whole thing.\\n\\n Mab nodded. “In her dream, Gwen ran for the house, as she’d done that night. She never looked back—then or now. When I sensed she was about to wake up, I called to her, in Eric’s voice. She stopped. I held my breath, hoping she’d stay in the dream. And then she turned around. For the first time, Gwen saw Pryce in his demon form. She stared and stared at him until the dream faded.”\\n\\n “So now she understands what really happened?”\\n\\n “I don’t know, child. It will take some time and reflection, I think, for her to truly understand. But she has been thinking about it. Last night, she contacted me via dream phone.”\\n\\n I wouldn’t have been more astonished if Gwen had suddenly appeared in the middle of my fight with Myrddin, offering tea and cookies. Gwen, using the dream phone to call Mab? Impossible.\\n\\n “She was angry,” Mab said. “She accused me of poisoning her dreams with lies. She warned me to stay away from Maria. She upbraided me on every topic she could think of. I was so depleted, so exhausted and weak even in my own dreams, that I had no defense against her. I let her rant.” Mab chuckled. “That confused her. She wanted to know what was wrong with me, why I wouldn’t argue back. I told her I was dying. She said, ‘Good.’ ” Again, a shade of sadness. “I wanted to end the call at that point, but I had no strength even to call up the mist. I lay in my dreamscape, Gwen staring at me. That’s when I felt the bloodstone surge. I was too weak to respond to its call. I knew you needed help to defeat Myrddin, but there was simply nothing I could do.\\n\\n “Gwen felt the change, as well. She accused me of playing some trick on her. I told her it was no trick, that you were under attack by a demon, like the one in her dream. I told her you needed help, but I was too weak to give it to you. And I asked her to lend me some of her strength. All she had to do was stay in my dreamscape and give me her hand.”\\n\\n “What did she say?”\\n\\n “She told me to go to hell and started to end the call. Her colors rose up, and I reached out to her, pleading.” Mab held out a hand now, as though Gwen were in the room. “Her colors rose some more. I could barely see her. I thought I was losing you both. And then she walked straight through the mist. She came back.”\\n\\n Mab dropped her hand to her lap and shook her head in wonder. “I don’t know why she did. Maybe the demon from her dream remained vivid in her mind. She stepped out of the mist and took my hand. She let me draw upon her strength so I could project myself as Viviane before Myrddin. The effort drained her, I think, but she held on. She didn’t let go until you’d killed the demon.” \\n\\n","sourceLink":"https://allnovel.net/bloodstone-deadtown-3/page-56.html","bookId":2611,"book":{"id":2611,"title":"Bloodstone (Deadtown #3)","description":"Storyline: Bloodstone (Deadtown #3) \\n Boston’s diverse South End is known for its architecture and great restaurants, not its body count. So when mutilated human corpses begin turning up in the area, the entire city takes notice. The killer—dubbed the South End Reaper—uses a curved blade for his grisly work. And even though there’s no real evidence pointing to a paranormal culprit, the deaths are straining the already-tense relations between Boston’s human and inhuman residents. \\n As the bodies pile up, Vicky, her formidable aunt Mab, and her werewolf boyfriend Kane investigate, only to find that the creature behind the carnage is after something much more than blood… \\n Publishers Weekly says, “Fans of Holzner’s other Deadtown novels will enjoy this solid yarn.”\\n","cover":"https://allnovel.net/images/bloodstone-deadtown-3.jpg","author":"Nancy Holzner","type":"Horror","source":"allnovel","link":"https://allnovel.net/bloodstone-deadtown-3.html","creation":"Oct 5, 2019 8:58:56 AM","modification":"Oct 5, 2019 6:36:28 PM"}}
