{"id":102304,"no":25,"title":"Page 25","content":"“Right this way, Miss Early.” Planter Boggs led the way. “And you there,” he said to Gifford. “Get out of those browns before you get yourself shot. You know what the Good Book says about avoiding the appearance of evil, don’t you?” “Yes, sir, but the evil was a good disguise to get me in and out of town.” He stripped off the jacket and tossed it into the empty blower, but despaired at the vest and pants. “Everly, Tate. One of you fellows—can you get him something less … troubling?” So Gifford Crooks took his leave, and Josephine and Ruthie followed Planter Boggs back into the depths of the old Spanish fort. “He’ll catch up to us later,” Boggs promised. “Come on now, and watch your step. It’s none too bright back here. We’re doing things the old-fashioned way, without any of those electric torches. Trying to conserve our power, you know how it goes.” He reached for a torch of the ancient variety, a wooden club with fuel-wrapped rags knotted around its head and set aflame. The stink of burning petroleum wafted along, carried and deposited in thick black smoke that stained the walls and the low stone ceiling. Ruthie stuck close to Josephine, holding her mistress’s elbow as if she was steadying her, and not just looking for an excuse to keep the comforting contact. She asked, “Are we underneath the fort? I do not understand. We went under the wall, but…” Mike Hardis, a terribly young man with a potato-shaped body but sharp, smart eyes, answered her. “The canal used to be deeper. The Spaniards moved supplies in and out of the fort on flats, all the way from the center inside … out to the bay, and then to the Gulf. But the years have filled it in, as you saw. And now the basement chamber—which is only halfway underground,” he noted as they began to climb a short flight of stairs, “is filled with a century’s worth of tidal mud and backwash. Even so, I can’t say it doesn’t make for a convenient back door. How’d you know to come looking for it?” Planter Boggs looked pointedly at Josephine. She answered for herself. “In my younger days, I spent a good deal of time at Barataria, and sometimes in the fort.” “I imagine you still have a number of friends here,” Mr. Boggs said as he led the way up the narrow stairwell, torchlight bouncing off the walls around the rounded corners, up ahead of him. “Friends and paying customers, if I cared to have them. Most of the men I knew back then are older now, and either wiser or dead. I hope you’ll pardon me saying so, gentlemen.” On that somber note, they hiked up into a large common room that was so sealed up, it felt to Josephine as if they were still underground, or mostly so. More firelight burned from every corner, some of it chimneyed away by ventilation shafts and columns of brick—but some of it accumulated within the long, flat room with the ceiling so low that the tallest men were compelled to hunch. Some forty or fifty men eyed the newcomers warily, then opportunistically, upon seeing that two were women. And then a name was breathed, somewhere in a back corner. “Miss Early.” The whisper carried back and forth throughout the closed, dark nightmare of that cramped and awful place, until the men who stood in their path parted and let them pass. In French, Ruthie said into Josephine’s ear, “You’re a bit of a legend to them. I had no idea.” “It was a long time ago.” “And still they know of you? You must have been remarkable.” “Still am.” Cramped and crowded, the room’s walls felt uncomfortably close and the air was stale with smoke, sweat, and the worry of men who knew exactly how much death could be dealt from above and outside. Somewhere off to the west the rat-a-tat-tat of antiaircraft fire shook the fort and was answered by the nearest armored dirigible. Tiny explosions smacked overhead, drilling into the roof and digging into the fortifications. Something heavier landed, and the roof shook. The ceiling quaked and rained mortar dust down on the already silent, already anxious collection of souls below. “This way,” Planter Boggs pushed. “Never mind the return fire. They haven’t breached us yet, and we’re holding the worst of it at bay from the corners, and what’s left of the other canals.” “And from the walls themselves,” Mike Hardis added. Ruthie’s eyes widened. “There are men outside still?” “Only the crazy ones,” said Frank Jones. “But they’re launching hand-bombs and taking potshots at the boats that slink up close. Somebody has to do it.” Josephine didn’t want to think about it. “Just get us to my brother. Please. Hurry,” she begged. “Come through here. It’s this way.” Another short set of stairs, half a flight down and then up again, and the small band arrived in what had once been a galley—if the leftover counters, racks for pans, and drawers for cutlery were any measure. It’d been converted to a makeshift clinic of sorts. No doctors, no lawyers, no teachers, no judges. No one in charge, but that was always the way of pirates, and no emergency could change it. The galley was a room full of motion, and the only electric lights she’d seen so far blazed with comparative brilliance above old food-preparation tables, which were now occupied by moaning, groaning injured men. Half a dozen dead bodies were piled in a corner, a fact that was only feebly hid by the application of a filthy tablecloth as a shroud. Limp hands and feet jutted out from the pile, and warm, sticky bloodstains showed up where the wounds were not yet finished leaking. Ruthie put her hand over her mouth and tried not to gag. Josephine would’ve done the same—the smell of urine and burned flesh and gunpowder and blood was almost more than she could stand—but she’d spotted Fletcher Josty in the room’s middle, beside a decrepit pump-water sink that, against all odds, was still working. The bayou guerrilla yanked and shoved on the handle and water did veritably appear, though it wasn’t as clean as one might hope. Many hands held out bowls, cups, and dirty rags, hoping to collect some of the liquid for refreshment or cleansing. Josty pumped furiously, trying to force the men to take turns. “One at a time, you bastards! There’s water to go around, but you have to wait your turn! I can’t make it come out any quicker,” he grumbled. “Fletcher!” Josephine cried. The room stopped for an instant, as even the eyes of the wounded turned at the sound of a woman’s voice. But another jagged cry rang out and the chorus of aching voices rose behind it, and the sad scene carried on as before, except that Fletcher quit pumping. He grabbed the nearest able-bodied soul and shoved him at the pump, ordering, “Keep that arm moving. Keep that water flowing.” Then, as he abandoned that wretched post, he danced between the tables and the sprawled arms and legs. “Miss Early,” he said, looking like he would’ve tipped his hat if he’d had one on. This free man of color was as filthy and smeared with soot as everyone Josephine had seen so far, but she was overjoyed by the sight of him, and it was all she could do to keep from hugging him. Instead she grasped him by the shoulders and asked, “Deaderick?” “In the cellar, ma’am.” “Oh … oh, God…” “No, no. He’s still alive, it’s just cooler down there, that’s all, so that’s where I’ve stuck ’im. Some of the men who are stable, and needing to rest … it’s all we could do to make them comfortable. It’s more sheltered, too, I think. If Texas brings in anything bigger, or shoots anything worse, we might be digging for cover.” “Then to the cellar. Now.” Planter Boggs gave Josephine and Ruthie a little bow and said, “Ladies, if you’ll excuse me.” “Of course,” the madam said without looking. She was already trailing behind Josty, and Ruthie behind her. And down into the cellar they followed—back to the level where the canals came and went. A large round of artillery connected with a thick mortar wall somewhere to the east. Josephine thrust out an arm to brace herself. The whole world shook, and it seemed like even an old fort built by Spaniards to survive the Second Coming couldn’t stand beneath the onslaught. But stand it did. And in the cellar, on the old concrete docks that were barely raised above the mud, Deaderick Early lay between two other men in similar states of injury and consciousness. She ran to his side, trying to keep from disturbing the others. Without stepping on them or kicking them, she knelt beside her brother and took one of his hands in hers—clasping it to her breast and examining the damage with as much cool reserve as she could muster. She tried to keep the panic out of her eyes when Deaderick opened his own. “I knew it,” he said unhappily. “You knew what?” she asked. It was a relief to hear him talk, even to hear him complain. But the bubbling red across his chest was not a relief, and his face was blanched and pale beneath the burnish of his complexion. Every muscle from his forehead to his chin was stretched tight with pain. “I knew you’d come. Whether or not anyone told you not to. That’s why I told them not to tell you. Josty did it, didn’t he? Damn fool.” Ruthie seized Deaderick’s other hand and held it up to her cheek. “Bien sûr she came, you ridiculous oaf!” “Christ Almighty, not you, too.” “Oui, moi aussi. Now, hush and let us take care of you.” “I don’t need you to take care of me.” Josephine released his hand so she could explore the injuries with her fingers. Gently, thoroughly, and trembling, she unpicked his buttons and revealed the sad, masculine attempts at bandaging. An ash-colored rag that might once have dried dishes was balled up and compressed against the largest of two holes, or so she learned upon lifting it. It stuck, blood drying to chest hair, and Deaderick grimaced. “Woman, let it alone! If you leave it be, it’ll stop bleeding.”","sourceLink":"https://allnovel.net/ganymede-the-clockwork-century-3/page-25.html","bookId":1669,"book":{"id":1669,"title":"Ganymede (The Clockwork Century #3)","description":"Storyline: Ganymede (The Clockwork Century #3) The air pirate Andan Cly is going straight. Well, straighter. Although he’s happy to run alcohol guns wherever the money’s good, he doesn’t think the world needs more sap, or its increasingly ugly side-effects. But becoming legit is easier said than done, and Cly’s first legal gig—a supply run for the Seattle Underground—will be paid for by sap money. New Orleans is not Cly’s first pick for a shopping run. He loved the Big Easy once, back when he also loved a beautiful mixed-race prostitute named Josephine Early—but that was a decade ago, and he hasn’t looked back since. Jo’s still thinking about him, though, or so he learns when he gets a telegram about a peculiar piloting job. It’s a chance to complete two lucrative jobs at once, one he can’t refuse. He sends his old paramour a note and heads for New Orleans, with no idea of what he’s in for—or what she wants him to fly. But he won’t be flying. Not exactly. Hidden at the bottom of Lake Pontchartrain lurks an astonishing war machine, an immense submersible called the Ganymede. This prototype could end the war, if only anyone had the faintest idea of how to operate it…. If only they could sneak it past the Southern forces at the mouth of the Mississippi River… If only it hadn’t killed most of the men who’d ever set foot inside it. But it’s those “if onlys” that will decide whether Cly and his crew will end up in the history books, or at the bottom of the ocean.","cover":"https://allnovel.net/images/ganymede-the-clockwork-century-3.jpg","author":"Cherie Priest","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/ganymede-the-clockwork-century-3.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 10:13:01 PM"}}
