{"id":102307,"no":28,"title":"Page 28","content":"The street rails were halfway between a streetcar and a proper train, running on standard rails but lighter than any long-distance freight or passenger movers, and without the creature comforts of a Pullman car. But they were quick by anyone’s standards, able to take people between Metairie and New Orleans proper in twenty minutes on a good day, and thirty on a bad one. A smallish station had been erected, again almost halfway between a streetcar stop and a train depot. Mostly it was open, with a tall roof overhead to shield the waiting passengers from sun and rain—and a set of enormous propellers set into the roof’s underside to keep the airflow circulating. It didn’t do much to cool the station, but it kept the diesel fumes and coal smoke from collecting, and that was something. “Why do I smell both diesel and coal smoke? Are there street rails leading in and out of the city everywhere, or just here? Is that a cemetery across the street? How much longer until our streetcar comes?” “Does he ever shut up?” asked Kirby Troost. Cly defended him. “If he doesn’t ask questions, he’ll never learn.” “I never asked questions like that. And I didn’t grow up to be no dummy.” The captain kept his eyes on the rails, watching Track 6 for any sign of an incoming transport. He picked Houjin’s two easiest questions, and he answered them. “Huey, you smell coal and diesel because some of the streetcars are coal powered and some are diesel. I reckon one day they’ll make them all one thing or the other, but it hasn’t happened yet. And yes, that’s a cemetery.” The boy whistled, drawing the attention of a small colored girl seated on a bench with her mother at Track 7. The child’s eyes went wide, but her mother said, “Don’t stare. It’s not polite.” She stared anyway, and Houjin gave her a wave that she sent back with a dubious flap. “It’s a cemetery? Must be about a million dead people. I don’t think I’ve ever seen one so big.” “Not a million, but a lot,” Cly told him. “They call it the city of the dead.” “A whole city full of dead people. Hey, we’ve got one of those back in—” Cly whomped him on the arm and gave him a look that said to shut up. “Ow,” he complained. “Well, you know what I was going to say.” Fang rolled his eyes. Kirby Troost said, “We all know, yes. Maybe you could put a lid on it, eh, kid?” Fang gave the captain an elbow jab and pointed at the tracks. “Here comes our car,” Cly said. “We’ll be in the city soon. Save up a few questions for when we get to town.” “Can I ask just one before we do?” “One. Just one.” “Where will we stay while the Naamah Darling gets her work done?” Troost said, “Actually, that’s not a half-bad thing to ask. Where will we stay, Captain? That lady friend of yours has a boarding house, doesn’t she?” Cly rose to his feet and stretched. “We won’t be staying at the Garden Court. It’s not that kind of boarding house.” Troost said, “Ah,” and Fang looked relieved. Houjin didn’t get it. “Why not? If she’s an old friend, and if she has rooms—” “We’ll find someplace else. I’d hate to impose. Let it go, Huey. The Vieux Carré is full of places we can stay. Hotels by the score. We’ll pick one.” Soon Track 6 was host to a street rail car called Bayou Bess. Houjin rode the whole way to town up front, hanging over the rail and watching the scenery change. Cly, Troost, and Fang sat on a bench behind him, taking it easy since they didn’t know when they’d next get the opportunity. The wind blew through their hair and clothes, and even though it was every bit as warm as Cly had promised, they were comfortable riding along beside the main road, past the swampy parts of earth that filled up the space between grasslands and forest. Fang nudged the captain, and since no one was paying much attention to them, he signed. Someone has to teach him, someday. He said under his breath. “Not me. Not now.” One of the women at the Garden Court? “God Almighty. His uncle would never let me hear the end of it.” They arrived at the downtown station just past Canal Street late in the afternoon, and upon debarking they headed toward Jackson Square, a few blocks nearer the river. “That’s strange,” the captain observed, watching someone draw down the shutters and begin the work of closing a restaurant. “What’s strange?” asked Troost. “I remember this as more of a round-the-clock town. Folks seem to be shutting up shop early.” From the stoop of a narrow, unmarked store that smelled of incense and coal, a stout black woman with a broom informed them, “It’s the curfew, closing us up. Costing all kinds of business, too—not that the Texians give a sainted cuss about it.” Cly and his crew members stopped, and the captain asked, since she sounded happy to share—“What curfew?” “The city goes home at sundown,” she said, swooshing the broom back and forth, clearing a day’s worth of dust from the two short steps. “Ever since those two Texians went missing. As if the world ought to stop for a pair of brownbacks without the sense to come up from the river at midnight.” The woman spit fast and hard, leaving a damp spot on the cobbled walkway. “I didn’t know,” Cly admitted. “And if that’s the case, we need to find ourselves some rooms for the night. Could you recommend anything?” She stopped her sweeping and appraised the group before saying, “Other side of the Square is the Widow Pickett’s place. She puts up men, soldiers, sailors. Folks like yourselves—airmen, I’m guessing?” The captain said, “That’s right.” “And a couple of Chinamen like you got there—they shouldn’t be a problem for her. She takes negroes and Creoles and everyone else, as long as you can pay. Or if she’s all full up, I think the Rogers place on Esplanade could take you.” “Thanks for your time,” Kirby Troost told her. He touched the front of his hat as they walked away, on toward the Square at a somewhat quicker pace. As they walked, he added to the captain, “Shame we can’t just stay at the Garden Court. Can’t cost that much more.” “Don’t you start, now.” “Who’s starting? He’s what—sixteen, seventeen? I was younger than that when I got married for the first time.” “When you—?” Cly gave him a confused gaze, then shook his head. “Forget about schooling Houjin. Leave that up to his uncle.” “Back in Seattle, where there are about fifty men to every woman?” “More men than that, if you count all the fellas in Chinatown—and there’s no reason you shouldn’t.” “And the women who’re there, you could count ’em on one hand … most of them so old, they could be his mother. Not that there’s anything wrong with learning from an older woman, mind you.” “Can we change the subject now?” “Sure. Why can’t we stay at the Garden Court?” “How about we don’t talk at all. I like the sound of that even better.” To the captain’s left, Fang laughed, silent except for a series of soft snorts. “Not you, too,” Cly complained. I didn’t say anything. “You didn’t have to.” “What are you talking about?” Houjin had been walking ahead, eyes up on the brightly painted buildings with their brilliant white latticework balconies and tumbling planters full of gardenias, daisies, and flowers with bright pink petals like trumpets. “Nothing,” Cly said quickly. “Turn left up at the next street, will ya? We’re almost there.” The Widow Pickett was not precisely what anyone had expected, but Kirby Troost in particular was quite charmed to meet her acquaintance. Said widow wasn’t thirty unless she was practicing witchcraft. She had a figure to inspire envy in ladies and lust in gentlemen, with a tall pile of hair the color of wheat and strawberries. As the black woman on the storefront stairs had predicted, the widow had no problem whatsoever providing shelter to the oriental men or anyone else, and before long two rooms were arranged, paid for, and settled in. Fang and Houjin shared one two-bedded room, for Houjin could ask all the questions he wanted and Fang never appeared to mind; the captain and Kirby shared the other—though the captain never did bother with the skinny, too-short bed. As a matter of habit, he pulled the mattress onto the floor and flipped the frame up against the wall. He’d hang off the padding one way or another, but there was no reason to let his feet dangle in midair. “You may as well settle in for the night,” he told Kirby Troost. “Go downstairs and see about some supper. The sun’ll be down in another hour.” “You say that like you don’t intend to do likewise.” “I figured I’d head over to the Garden and have a real quick business chat with my old friend.” “You’re headed to the whorehouse without me?” he asked accusingly. “Yes, but I can’t stay long, not with the curfew, and—” Troost nodded knowingly. “And that’s why you want to go now. Shit, man. You must be scared to death of this woman.” “Am not.” “I’m coming with you. Maybe I’ve got the pocket cash to stay the night and you can have this whole room to your lonesome.” Cly threw up his hands and said, “Fine. Suit yourself. Let me go tell Fang and Huey we’re headed out.” Fang agreed to stay behind, and Houjin was so excited about eating the big weird bugs called crawdads that he was prepared to miss almost anything for the adventurous culinary fare. They planned to meet again at sundown to discuss the next day’s duties, and Fang signed, I’ll keep him out of trouble.","sourceLink":"https://allnovel.net/ganymede-the-clockwork-century-3/page-28.html","bookId":1669,"book":{"id":1669,"title":"Ganymede (The Clockwork Century #3)","description":"Storyline: Ganymede (The Clockwork Century #3) The air pirate Andan Cly is going straight. Well, straighter. Although he’s happy to run alcohol guns wherever the money’s good, he doesn’t think the world needs more sap, or its increasingly ugly side-effects. But becoming legit is easier said than done, and Cly’s first legal gig—a supply run for the Seattle Underground—will be paid for by sap money. New Orleans is not Cly’s first pick for a shopping run. He loved the Big Easy once, back when he also loved a beautiful mixed-race prostitute named Josephine Early—but that was a decade ago, and he hasn’t looked back since. Jo’s still thinking about him, though, or so he learns when he gets a telegram about a peculiar piloting job. It’s a chance to complete two lucrative jobs at once, one he can’t refuse. He sends his old paramour a note and heads for New Orleans, with no idea of what he’s in for—or what she wants him to fly. But he won’t be flying. Not exactly. Hidden at the bottom of Lake Pontchartrain lurks an astonishing war machine, an immense submersible called the Ganymede. This prototype could end the war, if only anyone had the faintest idea of how to operate it…. If only they could sneak it past the Southern forces at the mouth of the Mississippi River… If only it hadn’t killed most of the men who’d ever set foot inside it. But it’s those “if onlys” that will decide whether Cly and his crew will end up in the history books, or at the bottom of the ocean.","cover":"https://allnovel.net/images/ganymede-the-clockwork-century-3.jpg","author":"Cherie Priest","type":"Science Fiction","source":"allnovel","link":"https://allnovel.net/ganymede-the-clockwork-century-3.html","creation":"Oct 5, 2019 8:57:51 AM","modification":"Oct 5, 2019 10:13:01 PM"}}
