{"id":64780,"no":1,"title":"Page 1","content":"Prologue 1\\n\\n Paris, France—1757\\n\\n With her fingers curled desperately around the edge of the table before her, Marguerite Piccard writhed in the grip of unalloyed arousal. Gooseflesh spread up her arms and she bit her lower lip to stem the moan of pleasure that longed to escape.\\n\\n “Do not restrain your cries,” her lover urged hoarsely. “It makes me wild to hear them.”\\n\\n Her blue eyes, heavy-lidded with passion, lifted within the mirrored reflection before her and met the gaze of the man who moved at her back. The vanity in her boudoir rocked with the thrusts of his hips, his breathing rough as he made love to her where they stood.\\n\\n The Marquis de Saint-Martin’s infamously sensual lips curved with masculine satisfaction at the sight of her flushed dishevelment. His hands cupped her swaying breasts, urging her body to move in tandem with his.\\n\\n They strained together, their skin coated with sweat, their chests heaving from their exertions. Her blood thrummed in her veins, the experience of her lover’s passion such that she had forsaken everything—family, friends, and esteemed future—to be with him. She knew he loved her similarly. He proved it with every touch, every glance.\\n\\n “How beautiful you are,” he gasped, watching her through the mirror.\\n\\n When she had suggested the location of their tryst with timid eagerness, he’d laughed with delight.\\n\\n “I am at your service,” he purred, shrugging out of his garments as he stalked her into the boudoir. There was a sultriness to his stride and a predatory gleam in his dark eyes that caused her to shiver in heated awareness. Sex was innate to him. He exuded it from every pore, enunciated it with every syllable, displayed it with every movement. And he excelled at it.\\n\\n From the moment she first saw him at the Fontinescu ball nearly a year ago, she had been smitten with his golden handsomeness. His attire of ruby red silk had attracted every eye without effort, but Marguerite had attended the event with the express aim of seeing him in the flesh. Her older sisters had whispered scandalous tales of his liaisons, occasions when he had been caught in flagrant displays of seduction. He was wed; yet discarded lovers pined for him openly, weeping outside his home for a brief moment of his attention. Her curiosity about what sort of shell would encase such wickedness was too powerful to be denied.\\n\\n Saint-Martin did not disappoint her. In the simplest of terms, she did not expect him to be so . . . male. Those who were given to the pursuit of vice and excess were rarely virile, as he most definitely was.\\n\\n Never had she met a man more devastating to a woman’s equanimity. The marquis was magnificent, his physical form impressive and his aloofness an irresistible lure. Golden-haired and skinned, as she was, he was desired by every woman in France for good reason. There was an air about him that promised pleasure unparalleled. The decadence and forbidden delights intimated within his slumberous gaze lured one to forget themselves. The marquis had lived twice Marguerite’s eight and ten years, and he possessed a wife as lovely as he was comely. Neither fact mitigated Marguerite’s immediate, intense attraction to him. Or his returning attraction to her.\\n\\n “Your beauty has enslaved me,” he whispered that first night. He stood near to where she waited on the edge of the dance floor, his lanky frame propped against the opposite side of a large column. “I must follow you or ache from the distance between us.”\\n\\n Marguerite kept her gaze straight ahead, but every nerve ending tingled from his boldness. Her breath was short, her skin hot. Although she could not see him, she felt the weight of his regard and it affected her to an alarming degree. “You know of women more beautiful than I,” she retorted.\\n\\n “No.” His husky, lowered voice stilled her heartbeat. Then, made it race. “I do not.”\\n\\n There was sincerity in his tone. Against better sense she believed in it, a faith she held close to her heart when summoned to her mother’s parlor the next morning.\\n\\n “Do not entertain girlish notions regarding Saint-Martin,” the baroness ordered. “I was witness to the way he looked at you, and how you admired him in return.”\\n\\n “All the women present were admiring him, even you.”\\n\\n Her mother rested her arm along the back of the chaise she occupied. Despite the relative earliness of the hour, her face and wig were already liberally powdered, and her cheeks and lips were rouged a lush pink. In the soft silver and white décor of her private sitting room, the baroness’s pale beauty was showcased to advantage, which was by design.\\n\\n “You, my youngest daughter, are to be a wife. Since the marquis already enjoys the wedded state with another, you must set your aim elsewhere.”\\n\\n “How can you be certain Saint-Martin enjoys it? Their marriage was arranged.”\\n\\n “As yours will be if you do not heed me,” the baroness continued with a note of steel in her voice. “Your sisters made fine matches, which frees me to give you more license. Use it wisely, or I will choose your spouse without consulting you. Perhaps the Vicomte de Grenier? He is rumored to be similarly randy, if that is your attraction, but he is younger and therefore more malleable.”\\n\\n “Maman!”\\n\\n “You are not equipped to manage a man of Saint-Martin’s ilk. He sweetens his tea with naïve girls such as you and then gorges on less refined tarts.”\\n\\n Marguerite had held her tongue, aware that she knew nothing of the man but rumor and innuendo.\\n\\n “Stay away from him, ma petite. A breath of scandal will ruin you.”\\n\\n Knowing it was true, Marguerite acquiesced and firmly intended to keep her word. “I am certain he has forgotten me already.”\\n\\n “Naturellement.” The baroness offered a sympathetic smile. Marguerite was her favorite, and the daughter most like her in both looks and temperament. “The point of this discussion is to ensure that you follow suit.”\\n\\n But Saint-Martin proved to be more determined than they had anticipated. Over the next few weeks, Marguerite found him everywhere, a circumstance effective in preventing her from forgetting him. Speculation abounded as to why he was suddenly less interested in his more jaded pursuits, which seduced her with the possibility that he was seeking her out deliberately. Unable to bear the suspense and distracted from her pursuit of a suitable husband, she resolved to confront him directly.\\n\\n Ducking behind a large potted plant, Marguerite waited for him to pass her location in his pursuit of her. She attempted to regulate her breathing to facilitate a calm exterior, but the effort made her dizzy. As had happened from the first, the nearer his proximity, the more disconcerted she felt. She could not see him, yet she sensed his every footstep. Closer . . . closer . . .\\n\\n When Saint-Martin came into sight, she blurted out, “What do you want?”\\n\\n The marquis drew to a halt and his wigged head turned to find her. “You.”\\n\\n Her breath caught.\\n\\n He pivoted to face her directly and approached with animalistic grace, his narrowed gaze assessing her from head to toe. As his dark eyes roamed, they heated, and when they paused boldly on her chest, Marguerite felt her breasts swell in response.\\n\\n “Stop.” She snapped her fan open as a barrier between them. Within the confines of her corset, her nipples hardened such as they did when she was cold. “You will cause a scene.”\\n\\n His jaw tightened. “And ruin you for the marriage you seek?”\\n\\n “Yes.”\\n\\n “That is not a deterrent.”\\n\\n She blinked.\\n\\n “The thought of you wed to another,” he growled, “compels me to insanity.”\\n\\n Marguerite’s hand rose to her throat. “Say no more,” she begged in a whisper, her mind reeling. “I lack the sophistication required to banter in this manner.”\\n\\n His prowling stride did not falter. “I speak the truth to you, Marguerite.” Her eyes widened at his use of her given name. “We lack the time for meaningless discourse.”\\n\\n “It is not possible for us to have more.”\\n\\n The marquis’s pursuit forced her to retreat until her back hit the wall. Only the delicate barrier of leaves shielded them from view. They had a moment alone, at most.\\n\\n He tugged off his glove and cupped her cheek. The touch of his skin to hers made her burn, his spicy scent made her ache in unmentionable places. “You feel it, too.”\\n\\n She shook her head.\\n\\n “You cannot deny the affinity between us,” he scoffed. “Your body’s response to mine is irrefutable.”\\n\\n “Perhaps I am frightened.”\\n\\n “Perhaps you are aroused. If any man would know the difference, it is I.”\\n\\n “Of course,” she said bitterly, hating the possessive jealousy she felt.\\n\\n “I have wondered,” he murmured, his gaze on her parted lips, “how it would be to make love to a woman such as you—beautiful and sensual beyond compare, but too innocent to wield it as a weapon.”\\n\\n “As you wield your beauty as a weapon?”\\n\\n A smile tugged at the corner of his sculpted mouth. It stopped her heart to see the way it banished the lines of cynicism that rimmed his eyes. “It pleases me to know that you find me attractive.”\\n\\n “Is there any woman who does not?”\\n\\n The marquis shrugged elegantly. “I care only for your opinion.”\\n\\n “You do not know me. Perhaps my opinion is worthless.”\\n\\n “I should like to know you. I need to know you. From the moment I first saw you, I have been unable to think of anything else.”\\n\\n “There is no way.”\\n\\n “If I found the means, would you indulge me?”\\n\\n She swallowed hard, knowing what her answer should be but unable to say it. “Your lust will pass,” she managed.\\n\\n Saint-Martin released her and backed away, his jaw taut. “This is not lust.”\\n\\n “What is it, then?”\\n\\n “An obsession.”\\n\\n Marguerite watched the deliberation with which he pulled his glove back on, one finger at a time, as if he needed the delay to reclaim his control. Could she believe that he was as affected by the attraction between them as she was?\\n\\n “I will find a way to have you,” he rasped, then he bowed and left her. \\n\\n","sourceLink":"https://allnovel.net/don-t-tempt-me-georgian-4/page-1.html","bookId":2661,"book":{"id":2661,"title":"Don\u0027t Tempt Me (Georgian #4)","description":"Storyline: Don\u0027t Tempt Me (Georgian #4) \\n Sometimes Temptation... \\n A hardened mercenary as adept in bed as in battle, Simon Quinn can have any woman he wants, but he prefers those who know the rules of the game. That way it\u0027s easier to leave them behind... \\n Can\u0027t Be Avoided \\n But Lysette Rousseau is one female he can\u0027t figure out. Beautiful, sensual, seductive, she should be the perfect match for Simon, yet something about her ties him in knots. Bold and manipulative one time, sweetly innocent the next, she is an enigma bound to bring trouble... impossible to resist.\\n","cover":"https://allnovel.net/images/don-t-tempt-me-georgian-4.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/don-t-tempt-me-georgian-4.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:55:08 AM"}}
