{"id":64795,"no":16,"title":"Page 16","content":"“Where are you going?”\n “Home. You had better find someone else to woo Mr. James. Someone who prefers boorish manners and lack of finesse.”\n To her chagrin, the comte threw his head back and laughed. “Ma petite,” he said, approaching her with a wide smile, “you are a delight.”\n When he reached her, he linked his arm with hers. “You are far too agitated. You should take a moment to collect yourself while I will order the carriage brought around.”\n Lysette stood unmoving. She could not believe Desjardins was not insisting she return to the ballroom.\n “Come now,” he said, linking arms with her and leading her back down the darkened hallway toward the retiring rooms. “You know my carriage is far more comfortable—and cleaner—than a hackney.”\n There was no protest she could make to that. As it was, she had failed to satisfy his request for her help. Inhaling sharply, she nodded her agreement and disengaged to continue on without him. Her nerves were stretched taut, and when her rapid stride threatened to overtake a couple ahead of her, she slipped into an alcove, reluctant to witness another amorous pairing.\n As they disappeared into a private room, Lysette briefly admired the beauty of the woman’s pure white gown, which glimmered in the low lighting. The modest cut along with the feminine bows was just the sort of design she favored. The male half of the couple was dressed in dark colors, his body blending into the surrounding shadows. Lysette admired the woman’s daring in retreating alone with a large man. Lord knew she could not have done it. A mere kiss had sent her fleeing.\n When she was once again alone, she withdrew from concealment and slipped into a retiring room, eager to restore her bearings and return to the safety of her house.\n Desjardins watched Lysette walk away and laughed silently. He did not believe he had ever seen her so flustered. And Mr. James . . . Who knew the staid exterior restrained such passion? Of course, that was why the comte enjoyed spying. There were so many things people would do in private that they would never do in public.\n Sadly, Depardue had ensured that Lysette would never appreciate the amorous attentions of a man. Certainly not attentions with the fervency James had displayed in the ballroom.\n But there was a solution. Lysette felt a deep sense of obligation when someone did her a kindness. Every unsavory act she had committed for him over the last two years had been because he’d taken her away from Depardue and his men. If he could orchestrate a way for James to rescue Lysette from some hazard or another, she would be grateful to the man and forgive him many of his foibles. However, it would have to be a grave matter in order to make the attachment deep enough to facilitate sex.\n Since the stakes involved with corrupting James included Desjardins’s own viability, the comte considered it suitably worthy of his next drastic action.\n He moved down the hallway to the retiring rooms. On the wall behind him, a turned-down oil lamp cast barely enough glow to act as a beacon. He glanced both ways to ensure he was alone, then he spilled the oil down the wall to pool between the stained wood trim and the edge of the burgundy and gold runner. He set the corner of his kerchief ablaze and dropped it in the direct path of the spreading puddle.\n Desjardins was whistling as he walked away, inwardly applauding his own genius. He jumped when the oil caught fire, the sudden whoosh of combustion loud in the stillness of the hallway. He hurried toward the ballroom to find James, his pathway lit by the orange glow of flames behind him.\n Simon did not understand how one moment Lysette was standing across the room and the other she was sprawled between his legs, her mouth moving with checked hunger beneath his. He did not comprehend why she was so very different tonight or why that alteration had such a potent impact on him.\n He only knew that he was hard and aching, his heartbeat thundering, his skin damp with sweat. He wanted her, with the innate need one felt for food and water.\n “Why now?” he asked, nibbling his way to her ear.\n She wrapped her arms around his shoulders and bared her throat. He pressed his open mouth to the tender skin and sucked gently.\n In response, she writhed against his throbbing cock, inciting his lust to greater heights. “Mr. Quinn . . .”\n He chuckled, enjoying the game. “Who knew you burned so hotly beneath all that ice?”\n “Kiss me again,” she begged, her throaty voice inspiring thoughts of her twisting and arching beneath him in his bed, the kiss she pleaded for being bestowed to more intimate lips.\n “We must leave, before I lift your skirts and take you here.”\n If his desire had been even a modicum less, he would fuck her right here, right now, and clear his mind enough to take her home. As it was, he was familiar with the need that rode him so hard. Rare as it was, it was still recognizable.\n Once he started, he would be at her all night.\n “No—”\n He suckled her lower lip to stem any protest and her lush body rested more fully against his. “Then let us retire to a more private venue, Lysette. Before lust rules my better sense.”\n She stiffened against him, apparently becoming aware of how impatient he was. She pulled back with a frown, her eyes wide and glittering in the near darkness. Her mouth opened to speak, then her head swiveled to the side, her gaze locking on the door.\n “Do you smell that?” she asked, pushing against his chest to put distance between them.\n Simon inhaled deeply, searching for the scent of exotic lilies. Instead, he smelled acrid smoke. It took a heartbeat’s length of time for the danger that odor implied to penetrate the haze of carnal hunger. At the exact moment he realized it, a scream from the ballroom confirmed his fear.\n “Hell’s teeth!” He leaped to his feet, steadying Lysette before he ran to the door.\n The flickering orange glow visible through the gaps around the portal was ominous. Simon reached for the glass knob, then yanked his hand away with a curse.\n “If I was not gloved,” he said, turning to face Lysette, who was securing her mask to her face, “I would be burned. The fire is directly outside the door.”\n “Mon Dieu. What will we do?”\n He found the question an odd one, coming from a woman so well versed in subterfuge, but he had no time to contemplate it. “The window.”\n “What of the others?” She followed him without hesitation.\n “They have the doors to the garden.” The multitude of screams from the ballroom bore witness to the guests’ cognizance of the blaze.\n Simon thumbed the window lock and pushed up the sash, poking his head outside to ensure the way was clear. Overgrown spearmint lined the flowerbed that bordered the house, an innocuous landing. The air was clear and cool, which contrasted sharply with the smoke rapidly filling the library they occupied. “Give me your hand.”\n He glanced over his shoulder, his brows rising when he saw her searching under her gown with both hands. When her panniers and underskirts fell to rest at her feet, he smiled. Pragmatic Lysette. He suddenly found the trait admirable, rather than coldhearted.\n She set her hand in his and managed a tense smile. “Would you find it strange for me to say that I am glad I was with you when this happened?”\n With a tug, he pulled her into him, pressing his lips to hers in a quick, hard kiss. “You can show me how much later.”\n He helped her out, holding her hands in his until he was certain she was settled firmly on the ground. Then, he tossed one leg over the sill and prepared to follow.\n A woman’s panicked scream arrested him midegress, knotting his gut with commiserating fear.\n This one sounded closer to his location than the ballroom. Much closer. Simon glanced again at the door, scrambling to think of a way to reach whomever he heard.\n There was no way. His eyes were watering, his lungs were burning. There were only two exits from the room—the door, now bowing from the heat, and the windows, one of which he was hanging outside of. He would have to search from the exterior of the manse.\n With this thought in mind, Simon dropped out of the window, landing in a crouch amid the profusion of mint. After the polluted air in the library, the crisp scent was a welcome relief.\n He looked around for Lysette, but she was gone, most likely to join the others. He was glad, relieved that she was safe.\n Freed from his concern for her, Simon ran along the wall in search of others who might need rescue.\n Chapter 7\n “Vexing woman,” Edward muttered as he descended the front steps of the Orlinda manse. He had hoped to leave Corinne Marchant behind, but she remained with him—the feel of her in his arms, the sweetly floral scent of her, the sting of her palm against his cheek.\n And the way she spoke to him . . .\n “Contrary female.” His fists clenched along with his jaw.\n He almost reconsidered his decision to walk home in lieu of splurging on a hackney. Although a long walk would clear his mind and take the edge off his lust, a carriage would put greater distance between him and Corinne in a shorter amount of time. Distance that might temper the urge to go back inside and apologize. The itch to charm her properly and win her regard was nearly overwhelming.\n Despite knowing her motives were impure, he wanted to scratch that itch.\n There was no possibility that her interest was genuine. She was too beautiful, too wealthy, too well connected to find anything noteworthy about him—other than his work for Mr. Franklin.\n It was not the first time he had been approached as a gateway to Franklin. It was, however, the first time he considered allowing it to happen for personal gain.\n As his feet hit the front drive, his pace increased. His conscience told him to put any thoughts of a possible liaison between himself and Corinne far from his mind. If he did not seek her out, he doubted she would approach him again. The thought caused a sharp pang of regret.\n “Damn you.”\n He had never seen a woman more lovely. She had the face of an angel and a body built for sin. If anyone asked him to describe his epitome of perfection, he would point to Corinne Marchant. But that was not the problem. He could resist the lure of the flesh; his cock did not rule his head. \n","sourceLink":"https://allnovel.net/don-t-tempt-me-georgian-4/page-16.html","bookId":2661,"book":{"id":2661,"title":"Don\u0027t Tempt Me (Georgian #4)","description":"Storyline: \n Don\u0027t Tempt Me (Georgian #4) \n Sometimes Temptation... \n A hardened mercenary as adept in bed as in battle, Simon Quinn can have any woman he wants, but he prefers those who know the rules of the game. That way it\u0027s easier to leave them behind... \n Can\u0027t Be Avoided \n But Lysette Rousseau is one female he can\u0027t figure out. Beautiful, sensual, seductive, she should be the perfect match for Simon, yet something about her ties him in knots. Bold and manipulative one time, sweetly innocent the next, she is an enigma bound to bring trouble... impossible to resist.\n \n","cover":"https://allnovel.net/images/don-t-tempt-me-georgian-4.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/don-t-tempt-me-georgian-4.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:55:08 AM"}}
