{"id":64805,"no":26,"title":"Page 26","content":"Afraid to be seen, afraid to find Simon occupied or gone, afraid her parents would never forgive her this transgression.\n Yet she did not turn about. Her need to be with him was stronger than her apprehension. He calmed her, at the same time he revived the spirit she’d once had. The spirit suppressed when Lysette died. She felt like herself with him. Free of airs or evasions. Freed from the need to maintain an unfamiliar timid deportment.\n Do not upset the balance. Do not give her parents reason to lament the misfortune of losing the good and quiet daughter, instead of the unruly one.\n Lynette drew her mount to a halt before Simon’s home. She was not certain how she ended up standing before the door or why she was breathing as if she had run the distance traveled. She felt dizzy. Disoriented. More than ever, she wanted to cling to Simon’s strength.\n She blinked and found the butler standing before her, a stocky man whose wig did little to disguise his youthful features. His only sign of surprise upon seeing her dressed in the garb of a male servant was a slight rise in his brow line, then he stepped out of the way without her saying a word and closed the door behind her.\n “Mademoiselle,” he said, his voice sounding as if coming from a distance due to the rushing of blood in her ears. “May I take your cloak and hat?”\n She gave him the hat, but clutched the thick wool like a shield.\n “I should warn you, mademoiselle, Mr. Quinn is in poor humor this evening.”\n “Is he alone?” she whispered, emboldened by the kindness in his eyes.\n “He has a guest in residence, but his lordship is otherwise occupied.” The butler gestured ahead with arm extended. “May I show you into the parlor while I inform Mr. Quinn of your arrival?”\n “Would you mind terribly if I s-showed myself up?”\n She was afraid Simon would make her leave if she stayed downstairs.\n But she knew what would happen if she went upstairs.\n The butler did as well, if the flushing of his cheekbones was any indication. His head tilted slightly. “Second door on your right,” he murmured. “I will see that your servant is shown to the kitchen.”\n “Thank you.”\n Gripping the staircase railing with white-knuckled force, Lynette ascended carefully, her steps hesitant due to the shaking of her legs. She gained the landing and paused.\n The hallway was barely lit; only two tapers in widely separated sconces shed any illumination. Although the décor was vastly different, she was reminded of the Orlinda manse. Her blood heated in response.\n Light peeked out from beneath two doors. One on the left, the other on the right. She was passing the first when voices within arrested her. Her nerves were already strung tight by existing circumstances. She had no notion how she would survive a chance meeting in addition to that.\n Fear of discovery froze her in place. Then, mercifully, the conversation grew more animated, ensuring that the participants were too engaged to hear her pass by. She was about to continue on when conversation ceased and the creaking of a bed was plainly heard. Biting her lip, she remained motionless.\n A woman’s throaty laugh floated through the door, followed by a man’s.\n The soothing baritone of the man’s voice thickened and became coaxing. The woman purred something that incited a masculine groan . . . followed by a rhythmic thumping that permeated the walls, strong and steady and endless.\n Sex.\n Lynette’s lungs seized. Her hand rose to her throat as sweat beaded on her forehead.\n Unable to stop listening, she sagged into the wall, her free hand fisting and releasing in the folds of her cloak. She clenched her thighs to ease a growing throbbing, and bit her lower lip as fevered cries of pleasure rose in volume and spilled freely out to the hallway.\n She had no idea how long she stood there. She knew only that her senses were overstimulated, her skin too hot, her mouth too dry, her breasts too full and aching unmercifully.\n The door on the right wrenched open and golden light flooded the hall. Lynette straightened as Simon strode out with a thunderous scowl. Breeches were his only garment. They were unfastened, revealing a tantalizing triangle of tawny skin and a thin trail of dark hair that disappeared beneath the doeskin . . . just above the long, thick evidence of his arousal. His abdomen was laced tight with muscle, his fisted hands causing his powerful biceps to bulge. His hair was unbound, the silky ebon strands swaying around his powerful shoulders.\n She had never seen anything as savagely beautiful.\n Or wanted anything more.\n Simon paused midstep, staring at her, unblinking. The tempo of the rise and fall of his chest altered, as did the air surrounding him. Fury turned into lust so hot it scorched her.\n “Simon,” she whispered, raising her hand to him.\n Two strides and he had her in his arms, cradled to his chest. Her arms circled his neck, pressing her breasts to his torso and her lips to his throat.\n He smelled of tobacco and brandy and musk, and the fragrance soothed something restless inside her. She was where she needed to be, in Simon’s arms. Boneless, she held him as he carried her into his bedchamber and kicked the door closed.\n I need you. She wanted to say the words, but her throat was too tight.\n Simon knew. His features were austere with hunger, his eyes feverishly bright in the light of the many candles. He set her on her feet by his massive bed and unfastened the frog at her throat. The shield of her cloak puddled around her feet, leaving her feeling as if she were naked, despite being fully clothed.\n “What in hell are you wearing?” he barked.\n “A disguise.”\n “Christ.” His jaw tightened. “Turn around.”\n Frowning, she did as he asked. She jumped as his hands cupped her buttocks and squeezed.\n “Have you any idea what the sight of you hungering to be fucked does to me?” he asked crudely. “Then you compound the problem by displaying every curve of your body.”\n It aroused her to be spoken to in that manner. She would not have guessed that would be true.\n She faced him. “Is it anything like what the sight of this”—her fingertips touched his navel, then followed the trail of dark hair until impeded by his breeches—“does to me?”\n He caught her hand and squeezed gently. “Why did you come?”\n She smiled. “Would it ruin the moment to say I am here for me?”\n “No.”\n “My mother thinks marriage will rein me in. If that is truly her intent, I will take my pleasure now.”\n Tension caused his chest to tighten into rock-hard, delineated muscle. She thought him beautiful, not in the elegant refined lines of statuary, but in the unpolished power of a man who survived by his physical strength.\n “She came to see me tonight,” he murmured, gripping her hips and tugging her closer. “She offered to pay me to go away.”\n Indignation and deep sadness warred for dominance. “What did you say?”\n He met her gaze directly. “I told her I would consider it.”\n Pain, sharp and searing, pierced through her chest. She inhaled sharply, but did not pull away. Perhaps she was naïve, but she did not believe a man could look at her as he did and not care for her at least a little. “Why?”\n “My accounts have been seized. I cannot leave of my own accord, I cannot afford to.”\n “Do you need to leave?”\n “For your sake”—he pressed his cheek to her temple—“I would have.”\n “Would have?” she whispered, her fingers kneading along his spine, feeling the way he tensed and quivered beneath her touch like a skittish stallion.\n “No need to go now. I will have your virginity within the hour.”\n Tangling his fingers in the tie at her throat, Simon tugged it free. His breath gusted hot and damp across her forehead, the sensation primitively arousing. “By the morning,” he purred, “there will be nothing innocent about you, I’m afraid.”\n He had pounced, caught his prey, and was preparing to devour.\n She shivered, more than ready. More than eager. “I am not afraid at all.”\n He stilled. The energy he radiated was raw, possessive. She could smell the lust on him. Felt it in the shaking of his industrious fingers. Heard it in the laborious rhythm of his breathing.\n Lynette offered him her mouth. He took it, his lips slanting across hers, his tongue thrusting deep, making her sex quiver and grow damp.\n Simon’s hands cupped her breasts, the feeling intensified by the lack of material between them. Only the linen of her shirt and her chemise separated his touch from her skin. Then his right leg hooked behind the back of hers and tugged.\n With her feet knocked out from under her, she toppled. Holding her firm to his chest, he cradled her down to the bed.\n “Simon?” she gasped, suddenly finding herself beneath him.\n “Every time you look at me, you beg me for sex with your eyes.” He crouched between her spread legs and began unlacing her boots. “You have driven me half mad. No more, or I will be in you before you are even undressed.”\n Lacking experience, Lynette still knew that such was not the normal order for going about the business. The thought that she was with a man of uncommon appetite and skill kept her on a knife edge of anticipation, sharp and perilous.\n As her feet were bared, gooseflesh spread across her skin. Simon must have taken note because he paused, his hands cupping the backs of her calves and stroking soothingly. He rubbed and massaged, moving down to her stocking-covered feet and pressing his thumbs into her arches. The heat of his sensual touch affected her deeply, arousing her as if it were the flesh between her thighs that he ministered to.\n She moaned, her eyes closing in delight.\n He pressed a kiss to the pad of her foot and stood, reaching for the placket of her breeches.\n Without her vision, the sounds of the crackling fire and the distant sounds of his guests’ carnal activities were more pronounced, adding another layer to the sensual cocoon she floated in. The bed smelled of Simon, pure delicious masculinity. She turned her head, pushing her nose into the turned-down linens and breathing him in. \n","sourceLink":"https://allnovel.net/don-t-tempt-me-georgian-4/page-26.html","bookId":2661,"book":{"id":2661,"title":"Don\u0027t Tempt Me (Georgian #4)","description":"Storyline: \n Don\u0027t Tempt Me (Georgian #4) \n Sometimes Temptation... \n A hardened mercenary as adept in bed as in battle, Simon Quinn can have any woman he wants, but he prefers those who know the rules of the game. That way it\u0027s easier to leave them behind... \n Can\u0027t Be Avoided \n But Lysette Rousseau is one female he can\u0027t figure out. Beautiful, sensual, seductive, she should be the perfect match for Simon, yet something about her ties him in knots. Bold and manipulative one time, sweetly innocent the next, she is an enigma bound to bring trouble... impossible to resist.\n \n","cover":"https://allnovel.net/images/don-t-tempt-me-georgian-4.jpg","author":"Sylvia Day","type":"Historical","source":"allnovel","link":"https://allnovel.net/don-t-tempt-me-georgian-4.html","creation":"Oct 5, 2019 8:59:01 AM","modification":"Oct 5, 2019 9:55:08 AM"}}
