{"id":39184,"no":48,"title":"CHAPTER XIII","content":"‘NOW HALF TO THE SETTING MOON HAVE GONE, AND HALF TO THE RISING DAY.’ The dinner party is over, the county families have retired to their several abodes. They are dispersed, like the soft summer mist which has melted from the moorland with the broadening light of the harvest moon. Madge, Viola, and Lady Cheshunt are assembled in Mrs. Penwyn’s dressing-room, a long, low room, with a wide and deep bow-window at one end, and three other old-fashioned windows, with broad cushioned seats therein—a room made for lounging and pleasant idleness, and half-hours with the best authors. Every variety of the genus easy chair is there, chintz-covered, and blossoming with all the flowers of the garden, as they only bloom upon chintz, large, gorgeous, and unaffected by aphides or blight of any kind. There are tables here and there—gipsy tables, loaded with new books and other trumpery. There is a large Duchesse dressing table in one of the windows, and an antique ebony wardrobe, with richly carved doors, in a convenient recess; but baths, and all the paraphernalia of the toilet, are in a small chamber adjoining; this large apartment being rather a morning-room, or boudoir, than dressing-room proper. There are water-colour landscapes and little bits of genre on the walls, by famous modern masters; a portrait of Churchill Penwyn, in crayon, hangs over the velvet-covered mantel-board; there are dwarf bookcases containing Madge’s own particular library, the poets, old and new, Scott, Bulwer, Dickens, Thackeray, Carlyle; altogether the room has just those homely lovable characteristics which make rooms dear to their owners. To-night the windows are all open to the soft summer air. The day has been oppressively warm, and the breath of night brings welcome refreshment to jaded humanity. Madge sits before her dressing-table, slowly unclasping her jewels as she talks. Her maid has been dismissed, Mrs. Penwyn being in no wise dependent on her Abigail’s help; and the jewel-case, with its dark velvet lining, stands open on the wide marble slab. Lady Cheshunt lies back in the deepest and softest of the easy chairs, fanning herself with a big black and gold fan, a large and splendid figure in amber satin and hereditary rose-point lace, which one of the queens of Spain had presented to the dowager’s mother when her husband was ambassador at Madrid. She looks like a picture by Rubens, large and fair, and full of colour. ‘Well, my love, all dinner parties are more or less heavy, but upon the whole your county people were better than I expected,’ remarked the dowager, with her authoritative air. ‘I have seen duller parties in the home counties. Your people seemed to enjoy themselves, and that is a point gained, however dull their talk of the births, marriages, and deaths of their belongings might be to nous autres. They have a placid belief that their conversation is entertaining which is really the next best thing to being really amusing. In a word, my dear Madge, I was not nearly so much bored as I expected to be.—Those diamonds are positively lovely, child; where did you get them?’ Madge had just taken her necklace—a string of large single stones—from her neck, and was laying it in its velvet nest. ‘They are heirlooms; some of them, at least,’ she answered, ‘and came to Churchill with the estate. They had been locked up in an old tin cashbox at the county bank for a quarter of a century, I believe, and nobody seemed to know anything about them. They were described in the old Squire’s will as “sundry jewels in a tin box at the bank.” Churchill had the stones reset, and bought a good many more to complete the set.’ ‘Well, my dear, they are worthy of a duchess. I hope you are careful of them.’ ‘I don’t think it is in Madge’s nature to be careful of anything now she is rich,’ said Viola. ‘She was thoughtful and saving enough when we lived with poor papa, and when it was such a hard struggle to keep out of debt. But now she has plenty of money she scatters it right and left, and is perpetually enjoying the luxury of giving.’ ‘But I am not careless about my diamonds, Viola. Mills will come presently, and carry off this box to the iron safe in the plate-room.’ ‘I never believed much in plate-rooms,’ said Lady Cheshunt. ‘A plate-room with its iron door is a kind of invitation to burglars. It tells them where the riches of the house are concentrated. When I am in other people’s houses I generally keep my jewel-case on my dressing-table, but I take care to have it labelled “Gloves,” and that it looks as little like a jewel-case as possible. I wouldn’t trust it in anybody’s plate-room. There, child, you are yawning, I see, in spite of your efforts to conceal the operation.—Come, Viola, your sister is tired after the mental strain she has undergone, in pretending to be interested in all those people’s innumerable relations.’ The ladies kissed and parted with much affection, and Madge was left alone, to sit by her dressing-table in a dreamy attitude, forgetful of the lateness of the hour. It was a sad thought which kept her musing there while the night deepened, and the harvest moon sank lower in the placid sky. She thought that all was not well with the husband of her love. She could not forget that look and gesture of his when she had questioned him about his faith as a Christian—nothing fearing his answer to that solemn inquiry when she asked it. That darkening brow, those gloomy eyes turned upon her for a moment in anger or in pain, had haunted her ever since. Not a Christian! Her beloved, her idol, the dearer half of soul, and heart, and mind. Death assumed new terrors in the thought that in worlds beyond they two must be parted. ‘Rather let us endure a mutual purgation,’ she thought, with a wish that was half a prayer. ‘Let me bear half the burden of his sins.’ He had gone to church with her, he had assisted in the service with grave attention—nay, sometimes even with a touch of fervour, but he had never taken the sacrament. That had troubled her not a little; but when she had ventured to speak to him upon the subject, he had replied with the common argument, ‘I do not feel my faith strong enough to share in so exalted a mystery.’ She had been content to accept this reason, believing that time would strengthen his faith in holy things. But now he had told her in hardest, plainest words, that he had no right to the name of Christian. She sat brooding upon this bitter thought for some time, then rose, changed her dinner dress for a loose white muslin dressing-gown, and went into her bedroom, which opened out of the dressing-room. She had not once thought of those earthly jewels in the open box on the table, or even wondered why Mills had not come to fetch them. The truth being that—distracted by the abnormal gaiety which prevailed below stairs, where the servants regaled themselves with a festive supper after the patrician banquet—Miss Mills had forgotten her duties so far as to become, for the time being, unconscious of the existence of Mrs. Penwyn’s diamonds. At this moment she was sleeping comfortably in her chamber in the upper storey, and the diamonds were left to their fate. Lady Cheshunt was accustomed to late hours, and considered midnight the most agreeable part of her day, so on leaving Madge’s dressing-room she took Viola to her own apartment at the other end of the corridor, for another half-hour or so of friendly chat, to which Viola, who was an inveterate gossip, had not the slightest objection. They talked over everybody’s dress and appearance, the discussion generally ending in a verdict of ‘guy,’ or ‘fright.’ They talked over Churchill, Viola praising him enthusiastically, Lady Cheshunt good-naturedly allowing that she had been mistaken in him. ‘He used to remind me of Mephistopheles, my dear,’ said the vivacious matron. ‘I don’t mean that he had a hooked nose or diagonal eyebrows, or a cock’s feather in his hat; but he had a look of repressed power that almost frightened me. I fancied he was a man who could do anything—whether great or wicked—by the sovereign force of his intellect and will: but that was before his cousin died. Wealth has improved him wonderfully.’ At last a clock in the corridor struck one. Viola gave a little scream of surprise, kissed her dear Lady Cheshunt for the twentieth time that night, and tripped away. She had gone half way down the corridor when she stopped, startled by a sight that moved her to scream louder than she had done just now at the striking of the clock, had not some instinctive feeling of caution checked her. A man—a man of the vagabond or burglar species—that very man who a few hours earlier had presented himself to Rebecca at the lodge—was in the act of leaving Mrs. Penwyn’s dressing-room. His back was turned to Viola, he looked neither to the right nor the left, but crept along the corridor with stealthy yet rapid footsteps. Viola paused not a moment ere she pursued him. Her footfall hardly sounded on the carpeted floor, but the flutter of her dress startled the intruder. He looked at her, and then dashed onward to the head of the staircase, almost throwing himself down the shallow oak stairs, the flying figure in its airy white robe closely pursuing him. At the head of the stairs Viola gave the alarm, with a cry which rang through the silent house. She was gaining upon the thief. At the bottom of the stairs she had him in her grasp, the two small hands clutching his greasy velveteen collar. He turned upon her with a fierce oath, would have struck her to the ground, perhaps, and marred her delicate beauty for ever with one blow of his iron fist, had not the billiard-room door opened suddenly and Mr. Penwyn appeared, Sir Lewis Dallas, a visitor staying in the house, at his elbow. ‘What is the matter? Who is this man?’ cried Churchill, while he and Sir Lewis hastened to Viola’s side, and drew her away from the ruffian. ‘A thief, a burglar!’ gasped the excited girl. ‘I saw him coming out of my sister’s dressing-room. He has murdered her, perhaps. Oh, do go and see if she is safe, Churchill!’ ‘Hold him, Lewis,’ cried Churchill, and ran upstairs without another word. Sir Lewis was tall and muscular, an athlete by nature and art. In his grip the marauder waited submissively enough till Churchill returned, breathless but relieved in his mind. Madge was safe—Madge did not even know that there was anything amiss. ‘Thanks, Lewis,’ he said, quietly, taking the intruder from his friend’s hand as coolly as if he had been some piece of lumber. ‘Go upstairs to your room, Vio, and sleep soundly for the rest of the night,’ added Churchill to his sister-in-law. ‘I’ll compliment you on your prowess to-morrow morning.’ ‘I don’t think I could go to bed,’ said Viola, shuddering. ‘There may be more burglars about the house. I feel as if it was swarming with them, like the beetles Mills talks about in the kitchen.’ ‘Nonsense, child! The fellow has no companions. Perhaps you’d be kind enough to see my sister as far as the end of the corridor, Lewis?’ ‘Oh no,’ cried Viola, quickly. ‘Indeed, I’m not frightened. I don’t want any escort;’ and she ran upstairs so fast that Sir Lewis lost his opportunity of saying something sweet at the end of the corridor. His devotion to the pretty Miss Bellingham was notorious, and Viola apprehended some soft speech, perhaps a gentle pressure of her hand, a fervid assurance that no peril should come near her while he watched beneath that roof. And the portionless daughter of Sir Nugent Bellingham was not wise enough in her generation to encourage this wealthy young baronet. ‘Now, you sir, go in there!’ said Churchill, pushing the gipsy into his study. ‘You needn’t wait, Lewis. I can tackle this fellow single-handed.’ ‘No! I can’t let you do that. He may have a knife about him.’ ‘If he has I don’t think he’ll try it upon me. I brought this from my dressing-room just now.’ He pointed to the butt-end of a revolver lurking in the breast-pocket of his smoking coat. ‘Well, I’ll smoke a cigar in the billiard-room while you hold your parley with him. I shall be within call.’ Sir Lewis retired to enjoy his cigar, and Churchill went into his study. He found that the burglar had availed himself of this momentary delay, and was beginning to unfasten the shutters. ‘What? You’d like to get out that way,’ said the Squire. ‘Not till you and I have had our talk together. Let go that shutter, if you please, while I light the lamp.’ He struck a wax match and lighted a shaded reading lamp that stood on the table. ‘Now,’ he said, calmly, ‘be good enough to sit down in that chair while I overhaul your pockets.’ ‘There’s nothing in my pockets,’ growled Paul, prepared for his resistance. ‘Isn’t there? Then you can’t object to have them emptied. You’d better not be needlessly objective. I’ve an argument here that you’ll hardly resist,’ showing the pistol, ‘and my friend who grappled you just now is ready to stand by me.’ The man made no further resistance. Churchill turned out the greasy linings of his pockets, but produced nothing except loose shreds of tobacco and various scraps of rubbish. He felt inside the vagabond’s loose shirt, thinking that he might have hidden his booty in his bosom, but with no result. A cunning smile curled the corners of the scoundrel’s lips, a smile that told Churchill to persist in his search. ‘Come,’ he said, ‘you’ve some of my wife’s diamonds about you. I saw the case open, and half empty. You were not in that room for nothing. You shall strip to your skin, my man. But first, off with that neckerchief of yours.’ The man looked at him vengefully, eyed the pistol in his captor’s hand, weighed the forces against him, and then slowly and sullenly untied the rusty black silk handkerchief which encircled his brawny throat, and threw it on the table. Something inside the handkerchief struck sharply on the wood. ‘I thought as much,’ said Churchill. He untwisted the greasy wisp of silk, whereupon his wife’s collet necklace and the large single stones she wore in her ears fell upon the table. Churchill put the gems into his pocket without a word. ‘Is that all?’ he asked. ‘Yes,’ the man answered, with an oath. Churchill looked at him keenly. ‘You will go straight from here to jail,’ he said, ‘so concealment wouldn’t serve you much. You are a gipsy, I think?’ ‘I am.’ ‘What brought you here to-night?’ ‘I came to see a relation.’ ‘Here, on these premises?’ ‘At the lodge. The woman you’ve chosen for your lodge-keeper is my mother.’ ‘Rebecca Mason?’ ‘Yes.’ Churchill took a turn or two up and down the room thoughtfully. ‘Since you’ve been so uncommonly kind to her, perhaps you’ll strain a point in my favour,’ said the gipsy. ‘I shouldn’t have tried to rob you if I hadn’t been driven to it by starvation. It goes hard with a man when he has a wolf gnawing his vitals, and stands outside an open window and sees a lot of women with thousands of pounds on their neck, in the shape of blessed gems that do no more real good to any one than the beads our women bedizen themselves with. And then he sees the old ivy roots are thick enough to serve for a ladder, and the windows upstairs left open and handy for him to walk inside. That’s what I call temptation. Perhaps you were outside the good things of this world at some time of your life, and can feel for a poor wretch like me.’ ‘I have known poverty,’ answered Churchill, wondrously forbearing towards this vagrant, ‘and endured it?’ ‘Yes, but you hadn’t to endure it for ever. Fortune was kind to you. It isn’t often a man drops into such a berth as this by a fluke. You’ve got your property, and you may as well let me off easily, for my mother’s sake?’ ‘You don’t suppose your mother is more to me than any other servant in my employ,’ said Churchill, turning upon him sharply. ‘Yes, I do. You wouldn’t go to the gipsy tents for a servant unless you had your reasons. What should have brought you to Eborsham to hunt for a lodge-keeper?’ The mention of that fatal city startled Churchill. Seldom was that name uttered in his hearing. It was among things tabooed. ‘I’m sorry I can’t oblige you by condoning a felony,’ he said, in his most tranquil manner. ‘As a justice of the peace any sentimentality on my part would be somewhat out of character. The utmost I can do for you is to get the case heard without delay. You may anticipate the privilege of being committed for trial, to-morrow at noon, at the petty sessions.’ He left the room without another word, and locked the door on his prisoner. The lock was good and in excellent order, the door one of those ponderous portals only to be found in old manor houses and their like. But Mr. Penwyn seemed to have forgotten the window, which was only guarded on the inside. He had shut one side of a trap, ignoring the possibility of escape on the other. He looked into the billiard-room before he went up stairs. Sir Lewis Dallas had finished his cigar and was slumbering peacefully, stretched at full length on one of the divans, like an uninterested member of the House of Commons. ‘He’s nearly as well off there as in his room, so I won’t interrupt his dreams,’ thought Churchill, as he retired. That shriek of Viola’s had awakened several of the household. Mills had heard it, and had descended half dressed to the corridor, in time to meet Miss Bellingham on her way upstairs, and to hear the history of the gipsy’s attempt from that young lady. Mills had taken the news back to the drowsy housemaids—had further communicated it to the startled footman, who looked out of his half-opened door to ask what was the row. Thus by the time the household began to be astir again, between five and six next morning, everybody knew more or less about the attempted robbery. ‘What have they done with the robber?’ asked the maids and the odd man and boot-cleaner, who alone among the masculine retainers condescended to rise at this early hour. ‘I think he must be shut up in master’s study,’ answered one of the women, whose duty it was to open the house, ‘for the door’s locked and I couldn’t get in.’ ‘Did you hear anybody inside?’ asked the cook, with keen interest. ‘Not a sound. He must be asleep, I suppose.’ ‘The hardened villain. To think that he can sleep with such a conscience as his, and the likelihood of being sent to Botany Bay in a week or two.’ ‘Botany Bay has been done away with,’ said the odd man, who read the newspapers. ‘They’ll send him no further than Dartmoor.’","sourceLink":"http://novel.tingroom.com/jingdian/2127/80763.html","bookId":486,"book":{"id":486,"title":"A Strange World","description":"简介： A fair slope of land in buttercup-time, just when May, the capricious, melts into tender Junea slope of fertile pasture within two miles of the city of Eborsham, whose cathedral towers rise tall in the blue dim distancea wealth of hedgerow flowers on...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2127","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
