{"id":39141,"no":5,"title":"CHAPTER V. \u0027IL NE FAUT PAS POUSSER AU BOUT LES MALHEUREUX.\u0027","content":"Churchill Penwyn was one of those men who are sure to obtain a certain amount of notice in whatsoever circle they appear—a man upon whom the stamp of good blood, or good breeding, had been set in a distinct and palpable manner—a man who had no need for self-assertion. \\n\\n \\n\\n It would have been difficult for any one to state in what the distinction lay. He was not particularly good-looking. Intellect, rather than regularity of feature, was the leading characteristic of his countenance. Already, though he was still on the sunward side of his thirtieth birthday, the dark brown hair grew thinly upon the broad high brow, showing signs of premature baldness. His features were sharply cut, but by no means faultless, the mouth somewhat sunken, the lips thin. His light grey81 eyes had a keen, cold lustre; only those who saw Churchill Penwyn in some rare moment of softer feeling knew that those severe orbs could be beautiful. Mr. Penwyn was a barrister, still in the uphill stage of his career. He got an occasional brief, went on circuit assiduously, and did a little in the literature of politics—a hard, dry kind of literature, but fairly remunerative—when he got it to do. He had contributed hard-headed statistical papers to the Edinburgh and the Westminster, and knew a good deal about the condition of the operative classes. He had lectured in some of the northern manufacturing towns, and knew the black country by heart. People talked of him as a young man who was sure to make his mark by and by; but by and by might be a long way off. He would be fifty years of age, perhaps, before he had worked his way to the front. \\n\\n \\n\\n Churchill Penwyn went a great deal into society, when it is considered how hard and how honestly he worked; but the houses in which he was to be found were always houses affected by the best people. He never wasted himself among second-rate circles.82 He was an excellent art critic; knew enough about music to talk of it cleverly, though he had hardly the faculty of distinguishing one tune from another; waltzed like a Viennese; rode like a centaur; spoke three Continental languages perfectly. It was his theory that no man should presume to enter society who could not do everything that society could require him to do. Society was worth very little in itself, according to Churchill Penwyn, but a man owed it to himself to be admired and respected by society. \\n\\n \\n\\n \u0027I see a good many men who go into the world to stare about them through eye-glasses,\u0027 said Churchill. \u0027If I couldn\u0027t do anything more than that I should spend my evenings in my own den.\u0027 \\n\\n \\n\\n Churchill Penwyn went into the gay world with a definite aim—some of the people he met must needs be useful to him sooner or later. \\n\\n \\n\\n Ohne Hast, ohne Rast—without haste, without rest—was his motto. He had it engraved on his signet ring, instead of the Penwyn crest. He was never in a hurry. While striving for success he had83 the air of a man who had already succeeded. He occupied a third floor in the Temple, and lived like an anchorite, but his tailor and bootmaker were among the best in London, and he was a member of the Travellers\u0027 and the Garrick. He was to be seen sometimes lunching at his club, and occasionally entertained a friend at luncheon, but he rarely dined there, and was never seen to drink anything more costly than a pint of La Rose, or Medoc. No man had ever mastered the art of economy more thoroughly than Churchill Penwyn, and yet he had never laid himself open to the charge of meanness. \\n\\n \\n\\n Miss Bellingham received him with a bright look of welcome, despite the dowager\u0027s warning, and their hands met, with a gentle pressure on Churchill\u0027s part. Viola was discreetly occupied in showing Mrs. Noyce a new photograph, and only gave the visitor a bow and a smile. So he had a fair excuse for seating himself next Madge, on the divan by the fireplace, where there was just room for those two. \\n\\n \\n\\n \u0027I did not think you would come to-night,\u0027 said Madge, opening and shutting her large black fan, with a slightly nervous movement. \\n\\n \\n\\n 84 \\n\\n \\n\\n \u0027Why not?\u0027 \\n\\n \\n\\n \u0027I saw your name in the paper, at Halifax, or somewhere, hundreds of miles away.\u0027 \\n\\n \\n\\n \u0027I was at Halifax the day before yesterday, but I would not miss my Saturday evening here. You see I have come a quarter of an hour in advance of your people, so that I might have you to myself for a few minutes.\u0027 \\n\\n \\n\\n \u0027It is so good of you,\u0027 faltered Madge, \u0027and you know I am always glad.\u0027 \\n\\n \\n\\n \u0027I should be wretched if I did not know it.\u0027 \\n\\n \\n\\n This was going further than Mr. Penwyn\u0027s usual limits. The man was the very soul of prudence. No sweet words, no tender promises, had ever passed between these two, and yet they knew themselves beloved. Madge knew it to her sorrow, for she was fain to admit the wisdom of the dowager\u0027s warning. It would never do for her to marry Churchill Penwyn. \\n\\n \\n\\n Happily for her, up to this time Churchill had never asked her to be his wife. \\n\\n \\n\\n \u0027He is too wise,\u0027 she said to herself, with the faintest touch of bitterness. \u0027Too much a man of the world.\u0027 \\n\\n \\n\\n 85 \\n\\n \\n\\n But that this man of the world loved her she was very sure. \\n\\n \\n\\n For just ten minutes they sat side by side, talking of indifferent things, but only as people talk who are not quite indifferent to each other. And then more visitors were announced. Sir Nugent and his friends came upstairs; the rooms began to fill. Musical people arrived. A German with long rough hair, bony wrists, and an eye-glass, seated himself at the piano, and began a performance of so strictly classical a character that he had the enjoyment of it all to himself, for nobody else listened. Minor chords chased one another backwards and forwards about the middle of the piano as if they were hunting for the melody and couldn\u0027t find it. Little runs and arpeggio passages went under and over each other, and wriggled in and out and up and down in a distracted way, still searching for the subject, and finally gave up the quest in utter despair, appropriately expressed by vague grumblings in the bass, which slowly faded into silence. Whereupon every one became enthusiastic in their admiration. \\n\\n \\n\\n 86 \\n\\n \\n\\n After this a young lady in pink sang an airy little chanson, with elaborate variations—using her bright soprano voice as freely as if she had been Philomel, trilling her vespers in the dusky woods of June. And then Madge Bellingham sat down to the piano, and played as few young ladies play—as if her glad young soul were in the music. \\n\\n \\n\\n It was only an Hungarian march that she played. There were no musical fireworks—no difficulties conquered; none of those passages which make the listeners exclaim, \u0027Poor girl! how she must have practised!\u0027 It was but a national melody—simple and spirit-stirring—played as if the soul of a patriot were guiding those supple fingers. The graceful figure was bent a little over the key-board—the dark eyes followed the swift flight of the hands over the keys. She seemed to caress the notes as she struck them—to play with the melody. Pride, love, hope, rage, every passion expressed itself by turns as she followed that wild strange music through the mazes of its variations, never losing the subject. It sounded like the war-cry of a free people. Even Churchill Penwyn, who in a general way cared so little for87 music, listened entranced to this. He could hardly have recalled the air half an hour later, but for the moment he was enchanted. He stood a little way from the instrument, watching the player, watching the beautiful head, with its dark rippling hair wound into a Greek knot at the back, the perfect throat, with its classic necklet of old Wedgwood medallions set in plainest gold; the drooping lashes, as the downcast eyes followed the flying touch. To hear Madge play was delightful, but to see her was still better. And this man\u0027s love had all the strength of a passion repressed. He had held himself in check so long, and every time he saw her he found her more and more adorable. \\n\\n \\n\\n The evening wore on. People came in and out. Madge played the hostess divinely, always supported by Lady Cheshunt, who sat in the smaller drawing-room as in a temple, and had all the best people brought to her. Some came to Cavendish Row on their way somewhere else, and were careful to let their acquaintance know that they were \u0027due\u0027 at some very grand entertainment, and made rather a favour of coming to Sir Nugent. The last of the88 guests went about half an hour after midnight, and among the last Churchill Penwyn. \\n\\n \\n\\n \u0027May I bring you that book after church to-morrow?\u0027 he asked. The book was a comedy of Augier\u0027s lately produced at the Fran?ais, which he had been telling her about. \\n\\n \\n\\n Madge looked embarrassed. She had a particular wish to avoid a tête-à-tête with Mr. Penwyn, and Sunday was an awkward day. Sir Nugent would be at Hurlingham, most likely, and Viola was such a foolish little thing, almost as bad as nobody. \\n\\n \\n\\n \u0027If you like\u0027 she answered. \u0027But why take the trouble to call on purpose? You might bring it next Saturday, if you come to us.\u0027 \\n\\n \\n\\n \u0027I shall bring it you to-morrow,\u0027 he said, as they shook hands. \\n\\n \\n\\n That tiresome Viola was in a hopeless state of headache and prostration next morning, so Madge had to go to church alone. Coming out of the pretty little Anglican temple she found herself face to face with Churchill Penwyn. He had evidently been lying in wait for her. \\n\\n \\n\\n \u0027I was so afraid I might not find you at home,\u002789 he said, half apologetically, \u0027so I thought I might as well walk this way. I knew this was your church. I\u0027ve brought you the play we were talking about.\u0027 \\n\\n \\n\\n \u0027You\u0027re very kind, but I hope you don\u0027t think I read French comedies on Sundays?\u0027 \\n\\n \\n\\n \u0027Of course not; only Sunday is my leisure day, and I thought you would not shut your door upon me even on Sunday.\u0027 \\n\\n \\n\\n The church was only five minutes\u0027 walk from Cavendish Row. When Sir Nugent\u0027s door was opened Mr. Penwyn followed Miss Bellingham into the house as a matter of course. She had no help for it but to go quietly upstairs to her fate. She almost knew what was coming. There had been something in his manner last night that told her it was very near. \\n\\n \\n\\n \u0027Prudence, courage,\u0027 she whispered to herself, and then, \u0027Viola!\u0027 The last word was a kind of charm. \\n\\n \\n\\n The rooms looked bright and gay in the noontide sunlight, tempered by Spanish blinds. The flowers, the feminine prettiness scattered about, struck Churchill\u0027s eye, they gave such a look of home. \\n\\n \\n\\n 90 \\n\\n \\n\\n \u0027If I could afford to give her as good a home as this!\u0027 he thought. \\n\\n \\n\\n He shut the door carefully behind him, and glanced round the room to make sure they were alone, and went close to Madge as she stood by one of the small tables, fidgeting with the clasp of her prayer-book. \\n\\n \\n\\n \u0027I think you know why I came to-day,\u0027 he said. \\n\\n \\n\\n \u0027You have told me about three times,—to bring me \"La Quarantaine.\"\u0027 \\n\\n \\n\\n \u0027I have come to tell you a secret I have kept more than a year. Have you never guessed it, Madge? Have I been clever enough to hide the truth altogether? I love you, dearest. I, penniless Churchill Penwyn, dare to adore one of the belles of the season. I, who cannot for years to come offer you a house in May Fair. I, who at most can venture to begin married life in a Bloomsbury lodging, supported by the fruits of my pen. It sounds like madness, doesn\u0027t it?\u0027 \\n\\n \\n\\n \u0027It is madness,\u0027 she answered, looking full at him with her truthful eyes. \\n\\n \\n\\n The answer surprised and humiliated him. He91 fancied she loved him—would be ready to face poverty for his sake. She was so young, and would hardly have acquired the wisdom of her world yet awhile. \\n\\n \\n\\n \u0027I beg your pardon,\u0027 he said, a curious change coming over his face, a sudden coldness that made those definite features look as if they had been cut out of stone. \u0027I have been deceiving myself all along, it seems. I did not think I was quite indifferent to you.\u0027 \\n\\n \\n\\n The eyelids drooped over the dark eyes for a moment, and were then lifted suddenly, and the eyes met Churchill\u0027s. That one look told all. She loved him. \\n\\n \\n\\n \u0027I have been learning to know the world while other girls are allowed to dream,\u0027 she said. \u0027I know what the burden of debt means. Poverty brings debt as a natural sequence. If you were a woodcutter and we could live in a hovel and pay our way, there would be nothing appalling in marriage. But our world will not let us live like that. We must play at being fine ladies and gentlemen while our hearts are breaking, and our creditors being92 ruined. Ever so long ago I made up my mind that I must marry a rich man. If I have ever seemed otherwise to you than a woman of the world, bent upon worldly success, I humbly beg you to forgive me.\u0027 \\n\\n \\n\\n \u0027Madge,\u0027 cried Churchill, passionately, \u0027I will forgive anything if you will only be frank. Were my luck to turn speedily, through some unlooked-for professional success, for instance, would you have me then?\u0027 \\n\\n \\n\\n \u0027If I stood alone in the world, if I had not my sister to consider, I would marry you to-morrow. Yes, though you were a beggar,\u0027 she answered, grandly. \\n\\n \\n\\n He clasped her to his breast and kissed those proud lips. The first lover\u0027s kiss that had ever rested there. \\n\\n \\n\\n \u0027I will be rich for your sake, distinguished for your sake,\u0027 he said impetuously, \u0027if wealth and fame are within the reach of man\u0027s effort.\u0027 \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2127/60209.html","bookId":486,"book":{"id":486,"title":"A Strange World","description":"简介： A fair slope of land in buttercup-time, just when May, the capricious, melts into tender Junea slope of fertile pasture within two miles of the city of Eborsham, whose cathedral towers rise tall in the blue dim distancea wealth of hedgerow flowers on...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2127","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
