{"id":12935,"no":13,"title":"CHAPTER XI. Mons.","content":"Throughout the whole operation around Cambrai the officers, N.C.O.’s. and men showed a wonderful devotion to duty, and an indomitable spirit to push forward. The difficulty of taking a well-organized system of enemy defences was considerably increased owing to the fact that there had been no opportunity for anyone to reconnoitre the assembly positions, or view the grounds over which we attacked, also the time which could be devoted to explaining to the men even the smallest outline of the plan of attack was almost negligible. \\n\\n \\n\\n The greatest features were the taking of St. Olle after two of our companies had been practically wiped out; and the crossing of the Douai-Cambrai Road under a barrage of German heavy artillery. The good work by our battalion was recognized by the Divisional Commander who mentioned us in his special order of the day concerning these battles—in his own words: \\n\\n \\n\\n “I wish to express my appreciation of the work done by the different Units of the Division, and by the Formations co-operating with us, during the past four days’ fighting. \\n\\n \\n\\n “The 7th Canadian Infantry Brigade under Brig.-General J. A. Clarke, D.S.O., and the 9th Canadian In[88]fantry Brigade under Brig.-Gen. D. M. Ormond, D.S.O., have maintained their organization through difficult and sustained fighting. \\n\\n \\n\\n “The work of the 116th Canadian Infantry Battalion has been especially fine, etc., etc. \\n\\n \\n\\n (Signed) \\n\\n F. O. W. Loomis, \\n\\n (Major-General) \\n\\n Commanding 3rd Canadian Div.” \\n\\n \\n\\n 2-10-’18 \\n\\n \\n\\n As soon as the relief had been completed by the 24th Battalion we were moved back behind Cambrai and camped in a sunken road just in front of Bourlon Wood. From here we retired by easy stages to Quéant, which we reached on the 10th of October, and having been allotted a section of the old Hindenburg trench, we started in to make ourselves at home and to nurse our wounds. \\n\\n \\n\\n It was during our stay here that H.R.H. the Prince of Wales paid us an informal visit. At the time of his arrival the companies were scattered around the area, carrying out some Lewis gun training, and the Adjutant was in his shirt sleeves, making some improvements to his trench shelter. \\n\\n \\n\\n Major Younger, the Brigade Major, rushed up to the Adjutant and asked for the C. O. (Major Pratt). “I’m sure I don’t know where he is,” said the Adjutant. “Oh, well,” said the B. M., “you’ll do. The Prince of Wales is just outside, and wants to go round and see the companies, so hurry up and get some clothes on and come and be presented.” (Scene of great excitement,[89] during which hats, coats, and belts were nowhere to be found, and finally the young Prince, highly amused, is conducted round by the hatless and much embarrassed adjutant.) \\n\\n \\n\\n Later, Major Pratt was found, and introduced to our distinguished visitor, but not catching his name, stepped forward, and seizing his hand, said, “Pleased to meet you, I’m sure.” But the Prince of Wales is a prince of good fellows, and despite the seeming want of courtesy shown him, pronounced himself highly pleased with his visit. \\n\\n \\n\\n In the afternoon, all the officers of the battalion, together with a composite company of one hundred other ranks, attended the funeral of Major-General Lipsett, who was killed by a sniper whilst reconnoitring the forward positions. During his command of the 3rd Canadian Division (he had only recently been transferred to the Imperial Forces) his keen interest in the welfare of all ranks under his command had made him one of the most popular officers in the Canadian Corps. \\n\\n \\n\\n On the 17th of the month, the 9th Brigade was inspected by the Corps Commander in a large and muddy field just north of Quéant. The Corps Commander, as most of the Corps know, was by no means a small man, and amongst the troops inspected were a number of men who had recently joined us, and who had consequently no idea as to whom the inspecting officer might be—also the ration of bread at that time was one loaf to three men. It was towards the end of the inspection, and[90] the small squad of brass caps was walking down the ranks of a certain platoon—one of the newcomers took one look at the Corps Commander and remarked in a loud undertone, “Gee Whiz! Fancy being three men on a loaf with that old beggar.” \\n\\n \\n\\n The German Army was now in full retreat, and from intelligence received, it seemed likely that from now on we would have a difficult task in even keeping in touch with it. Starting on the 22nd of the month we began a series of advances, which only ended when the Armistice terms had been signed and the Armistice line established about five miles east of Mons. \\n\\n \\n\\n This advance through country and villages, which had so long been occupied by a cruel and overbearing enemy, will live forever in the memories of all who took part in it. The people seemed to be crazed with the joy of liberty—there wasn’t anything they wouldn’t do for “les braves Canadiens,” as they called us—flowers were strewn along the streets, bouquets were showered on us, and even kisses. Wine was dug up from where it had been hastily cached in 1914, and from personal experience we can assert that it showed no sign of deterioration for its four years’ rest. \\n\\n \\n\\n These were good days for France, and for us, too, and on the 10th of November we were billetted in a small town called Wasmuel, waiting for orders to take over the front line, at present occupied by the 7th Brigade. At about 8 o’clock on the morning of the 11th November the following order arrived from Brigade H.Q.: \\n\\n \\n\\n [91] \\n\\n \\n\\n “The 116th Battalion will move up forthwith and take over the line from the 7th Brigade, holding a front line from Q. 9 central to K. 19 central aaa. After taking over the line the battalion will stand fast aaa. Hostilities will cease at 11 a.m. to-day aaa. All precautions to be taken against the enemy aaa. No intercourse with the enemy whatever to take place aaa. O.C. 116th Battalion will report to 9th Brigade H.Q. immediately, and will receive instructions as to route. Acknowledge.” \\n\\n \\n\\n It didn’t take long to acknowledge such news as that, nor was there any delay in finding a runner to carry the tidings round to the companies, and by 9 a.m. the battalion was moving forward in the direction of Mons, over practically the same ground that our “contemptible little army” had made its gallant stand in August, 1914. The relief completed, a party of one hundred men from the rear details, including the brass band, represented the Battalion at a demonstration held in the public square in Mons, to celebrate the liberation of the City, and in the meantime we advanced our line somewhat, taking up positions along the Brussels-Mons Road, with Headquarters in Nimy. \\n\\n \\n\\n At 5.30 the following morning the whole neighborhood was awakened by a series of explosions, which bore a striking resemblance to the fire from field artillery; for about half an hour we had an uncomfortable feeling that the war had started again, but on investigation discovered an enemy ammunition train, which had been set on fire by some very small and truly patriotic young Belgians. \\n\\n \\n\\n [92] \\n\\n \\n\\n Later in the day our line was still further advanced, and we finally occupied what was to be known as the Armistice Line, and from which no advance could be made until the expiration of a definite time limit. \\n\\n \\n\\n Our left flank, which rested on the Brussels-Mons Road, proved to be a source of great trouble and annoyance, since we received explicit orders to allow no one to pass either from east to west or west to east, except those carrying a special permit signed by 3rd Canadian Divisional H.Q. \\n\\n \\n\\n Our posts along this road were harassed daily by a continuous barrage of civilians, wishing to pass through from both sides, and naturally peeved at being refused permission. In addition the number of staff officers and generals who clamored to proceed to Brussels, was almost unlimited. The “Umpty Umps” had never seen so many red caps in the front line before; in fact, we scarcely knew that there were so many of them in the whole of the British Army. \\n\\n \\n\\n “What do you mean by stopping my car?” said one rather fat and irate general. “I’m General ‘so-and-so of the so-and-so’s’.” “I’m sorry, sir, but my instructions are absolutely definite, and unless you have a pass, etc., etc.”—and back he had to go to Mons and get it. \\n\\n \\n\\n And here ended the active service of our gallant unit, for when the first and second Canadian Divisions started their advance to the Rhine our posts were withdrawn, and on December 26th, after marching as far as Brussels with the object of relieving the First Division in Germany,[93] we suddenly received orders to “about turn.” We accomplished this in two beats of quick time instead of the usual three, and marched to Blandain, on the borders of France and Belgium, from which place, passing through Le Havre, we were transported to Bramshott via Weymouth, England, and thence to Canada. \\n\\n “It’s a long, long way to Tipperary, But my heart’s right there.” \\n\\n \\n\\n Honor Roll, showing the names of all ranks of the 116th Battalion who were killed in action or died of wounds or sickness, whilst on the service roll of the Battalion in France, between February, 1917, and February, 1919. This roll was compiled from the Service records of the Battalion, and is complete so far as the records will allow. \\n\\n \\n\\n It is very much regretted that the names of those men who died of wounds or sickness, after having been evacuated to England or Canada do not all appear in this roll, owing to the fact that no official record was sent to the Battalion of such cases. \\n\\n \\n\\n The End \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/1493/44620.html","bookId":1321,"book":{"id":1321,"title":"The 116th Battalion in France","description":"简介： With the assistance of the official War Diary and the proud memory of two years service with the 116th Battalion C.E.F. in France, the writer has compiled this small book for all ex-members of the Battalion, with the hope that they may find somewhere...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1493","creation":"Aug 1, 2019 12:24:51 AM","modification":"Aug 1, 2019 12:24:51 AM"}}
