{"id":70015,"no":4,"title":"Page 4","content":"The night was clear, with a sharp-edged half-moon and white pinpoint stars. Jake rode easily, arguing with himself.\\n\\n It was stupid, just plain stupid, for him to be heading out when he could be snuggled up against Carlotta right this minute. Except Carlotta didn\u0027t snuggle. What she did was more like devouring. With her, sex was fast and hot and uncomplicated. After all, business was business.\\n\\n At least he knew what Carlotta was and what to expect from her. She used men like poker chips. That was fine with Jake. Carlotta wouldn\u0027t expect posies or boxes of chocolates or Sunday calls.\\n\\n Sarah Conway was a whole different matter. A woman like that wanted a man to come courting wearing a stiff collar. And probably a tie. He snorted and kicked his mount into a trot. You\u0027d have to see that your boots were shined so you could sit around making fancy talk. With her, sex would be...\\n\\n He swore viciously, and the mustang pricked up his ears. You didn\u0027t have sex with a woman like that. You didn\u0027t even think about it. And even if you did...\\n\\n Well, he just wasn\u0027t interested.\\n\\n So what the hell was he doing riding out to her place in the middle of the night?\\n\\n \"Stupid,\" he muttered to his horse.\\n\\n Overhead, a nighthawk dived and killed with hardly a sound. Life was survival, and survival meant ruthessness.\\n\\n Jake understood that, accepted it. But Sarah... He shook his head. Survival to her was making sure her ribbons matched her dress.\\n\\n The best thing he could do was to turn around now and head back to town. Maybe ride right on through town and go down to Tombstone for a spell. He could pick up a job there if he had a mind to. Better yet, he could travel up to the mountains, where the air was cool and smelled of pine. There wasn\u0027t anything or anyone holding him in Lone Bluff. He was a free agent, and that was the way he intended to stay. But he didn\u0027t turn his horse around.\\n\\n When he got back from the mountains, he mused- if he got back-Miss Sarah Conway, with her big brown eyes and her white shoulders, would be long gone. Just plain stubbornness was keeping her here now, anyway. Even stubbornness had to give way sometime. If she was gone, maybe he\u0027d stop having this feeling that he was about to make a big mistake. As far as he could see, the biggest mistakes men made were over three things-money, whiskey and women. None of the three had ever meant enough to him to worry or fight over. He didn\u0027t plan on changing that.\\n\\n Even if this woman was different. Somehow. That was what bothered him the most. He\u0027d always been able to figure people. It had helped keep him alive all these years. He couldn\u0027t figure Sarah Conway, or what it was about her that made him want to see that she was safe. Maybe he was getting soft, but he didn\u0027t like to think so.\\n\\n He couldn\u0027t help feeling for her some, traveling all this way just to find out her father was dead. And he had to admire the way she was sticking it out, staying at the old mine. It was stupid, he mused, but you had to admire it.\\n\\n With a shrug, he kept riding. He was nearly to the Conway place, anyway. He might as well take a look and make sure she hadn\u0027t shot her foot off with her daddy\u0027s rifle.\\n\\n He smelled the fire before he saw it. His head came up, like a wolfs when it scents an enemy. In a similar move, the mustang reared and showed the whites of his eyes. When he caught the first flicker of flame, he kicked the horse into a run. What had the damn fool woman done now?\\n\\n There had only been a few times in his life when he had experienced true fear. He didn\u0027t care for the taste of it. And he tasted it now, as his mind conjured up the image of Sarah trapped inside the burning house, the oil she\u0027d undoubtedly spilled spreading the fire hot and fast.\\n\\n Another image came back to him, an old one, an image of fire and weeping and gunplay. He\u0027d known fear then, too. Fear and hate, and an anguish he\u0027d sworn he\u0027d never feel again.\\n\\n There was some small relief when he saw that it was the shed burning and not the house. The heat from it roared out as the last of the roof collapsed. He slowed his horse when he spotted two riders heading up into the rocks. His gun was already drawn, his blood already cold, before he saw Sarah lying on the ground. His horse was still moving when he slid from the saddle and ran to her.\\n\\n Her face was as pale as the moon, and she smelled of smoke. As he knelt beside her, a small brown dog began to snarl at him. Jake brushed it aside when it nipped him.\\n\\n \"If you were going to do any guarding, you\u0027re too late.\"\\n\\n His mouth set in a grim line, he pressed a hand to her heart. Something moved in him when he felt its slow beat. Gently he lifted her head. And felt the blood, warm on his fingers. He looked up at the rocks again, his eyes narrowed and icy. As carefully as he could, he picked her up and carried her inside. There was no place to lay her comfortably but the cot. The puppy began to whine and jump at the ladder after Jake carried her up. Jake shushed him again and, grateful that Sarah had at least had the sense to bring in fresh water, prepared to dress her wound.\\n\\n Dazed and aching, Sarah felt something cool on her head. For a moment she thought it was Sister Angelina, the soft-voiced nun who had nursed her through a fever when she had been twelve. Though she hurt, hurt all over, it was comforting to be there, safe in her own bed, knowing that someone was there to take care of her and make things right again. Sister would sometimes sing to her and would always, when she needed it, hold her hand.\\n\\n Moaning a little, Sarah groped for Sister Angelina\u0027s hand. The one that closed over hers was as hard as iron. Confused, fooled for a minute into thinking her father had come back for her, Sarah opened her eyes. At first everything was vague and wavering, as though she were looking through water. Slowly she focused on a face. She remembered the face, with its sharp lines and its taut, bronzed skin. A lawless face. She\u0027d dreamed of it, hadn\u0027t she? Unsure, she lifted a hand to it. It was rough, unshaven and warm. Gray eyes, she thought dizzily. Gray eyes and a gray hat. Yes, she\u0027d dreamed of him.\\n\\n She managed a whisper. \"Don\u0027t. Don\u0027t kiss me.\"\\n\\n The face smiled. It was such a quick, flashing and appealing smile that she almost wanted to return it. \"I guess I can control myself. Drink this.\"\\n\\n He lifted the cup to her lips, and she took a first greedy sip. Whiskey shot through her system. \"That\u0027s horrible. I don\u0027t want it.\"\\n\\n \"Put some color back in your cheeks.\" But he set the cup aside.\\n\\n \"I just want to...\" But the whiskey had shocked her brain enough to clear it. Jake had to hold her down to keep her from scrambling out of bed. Her shift tangled around her knees and drooped over one shoulder. \"Hold on. You stand up now, you\u0027re going to fall on that pretty face of yours.\"\\n\\n \"Fire.\" She coughed, gasping from fee pain in her throat. To balance herself, she grabbed him, then dropped her head weakly on his chest. \"There\u0027s a fire.\"\\n\\n \"I know.\" Relief and pleasure surged through him as he stroked her hair. Her cheek was nestled against his heart as if it belonged there. \"It\u0027s pretty well done now.\"\\n\\n \"It might spread. I\u0027ve got to stop it.\"\\n\\n \"It\u0027s not going to spread.\" He eased her back with a gentleness that would have surprised her if she\u0027d been aware of it. \"Nothing to feed it, no wind to carry it. You lost the shed, that\u0027s all.\"\\n\\n \"I got the horses out,\" she murmured. Her head was whirling and throbbing. But his voice-his voice and the stroke of his hands soothed her everywhere. Comforted, she let her eyes close. \"I wasn\u0027t sure I could.\"\\n\\n \"You did fine.\" Because he wanted to say more and didn\u0027t know how, he passed the cloth over her face. \"You\u0027d better rest now.\"\\n\\n \"Don\u0027t go.\" She reached for his hand again and brought it to her cheek. \"Please don\u0027t go.\"\\n\\n \"I\u0027m not going anywhere.\" He brushed the hair away from her face while he fought his own demons. \"Go on to sleep.\" He needed her to. If she opened her eyes and looked at him again, if she touched him again, he was going to lose.\\n\\n \"The puppy was barking. I thought he needed to go out, so I-\" She came to herself abruptly. He could see it in the way her eyes flew open. \"Mr. Redman! What are you doing here? Here,\" she repeated, scandalized, as she glanced around the loft. \"I\u0027m not dressed.\"\\n\\n He dropped the cloth back in the bowl. \"It\u0027s been a trial not to notice.\" She was coming back, all right, he thought as he watched her eyes fire up. It was a pleasure to watch it. With some regret, he picked up the blanket and tossed it over her. \"Feel better?\" \"Mr. Redman.\" Her voice was stiff with embarrassment.\\n\\n \"I don\u0027t entertain gentlemen in my private quarters.\"\\n\\n He picked up the cup of whiskey and took a drink himself. Now that she seemed back to normal, it hit him how scared he\u0027d been. Bone-scared. \"Ain\u0027t much entertaining about dressing a head wound.\"\\n\\n Sarah pushed herself up on her elbows, and the room reeled. With a moan, she lifted her fingers to the back of her neck, \"I must have hit my head.\"\\n\\n \"Must have.\" He thought of the riders, but said nothing. \"Since I picked you up off the ground and carted you all the way up here, don\u0027t you figure I\u0027m entitled to know what happened tonight?\"\\n\\n \"I don\u0027t really know.\" With a long sigh, she leaned back against the pillow she\u0027d purchased only that morning. He was entitled to the story, she supposed. In any case, she wanted to tell someone. \"I\u0027d already retired for the night when the puppy began to bark. He seemed determined to get out, so I climbed down.\\n\\n I saw the fire. I don\u0027t know how it could have started. It was still light when I fed the stock, so I never even had a lamp over there.\"\\n\\n Jake had his own ideas, but he bided his time. Sarah lifted a hand to her throbbing head and allowed herself the luxury of closing her eyes. \"I ran over to get the horses out. The place was going up so fast. I\u0027ve never seen anything like it. The roof was coming down, and the horses were terrified. They wouldn\u0027t come out. I\u0027d read somewhere that horses are so frightened by fire they just panic and burn alive, I couldn\u0027t have stood that.\"\\n\\n \"So you went in after them.\"\\n\\n \"They were screaming.\" Her brows drew together as she remembered. \"It sounded like women screaming. It was horrible.\"\\n\\n \"Yeah, I know.\" He remembered another barn, another fire, when the horses hadn\u0027t been so lucky.\\n\\n \"I remember falling when I got out the last time. I think I was choking on the smoke. I started to get up. I don\u0027t know what I was going to do. Then something hit me, I guess. One of the horses, perhaps. Or perhaps I simply fell again.\" She opened her eyes and studied him. He was sitting on her bed, his hair disheveled and his eyes dark and intense. Beautiful, she thought. Then she wondered if she was delirious. \"Then you were here. Why are you here?\"\\n\\n \"Riding by this way. Saw the fire.\" He looked into the cup of whiskey. If he was going to sit here much longer, watching what the lamplight did to her skin, he was going to need more than a cupful. \"I also saw two riders heading away.\"\\n\\n \"Away?\" Righteous indignation had her sitting up again, despite the headache. \"You mean someone was here and didn\u0027t try to help?\"\\n\\n Jake gave her a long, even look. She looked so fragile, like something you put behind glass in a parlor.\\n\\n Fragile or not, she had to know what she was up against. \"I figure they weren\u0027t here to help.\" He watched as the realization seeped in. There was a flicker of fear. That was what he\u0027d expected. What he hadn\u0027t counted on and was forced to admire was the passion in her eyes.\\n\\n \"They came on my land? Burned down my shed?\\n\\n Why?\"\\n\\n She\u0027d forgotten that she was wearing no more than a shift, forgotten that it was past midnight and that she was alone with a man. She sat up, and the blanket dropped to pool at her waist. Her small, round breasts rose and fell with her temper. Her hair was loose. He\u0027d never seen it that way before. Until that moment he hadn\u0027t taken the time or the trouble to really look. A man\u0027s hands could get lost in hair like that. The thought ran through his mind and was immediately banished. It glowed warm in the lamplight, sliding over her right shoulder and streaming down her back. Anger had brought the color back to her face and the golden glow back to her eyes.\\n\\n \u0027He finished off the whiskey, reminding himself that he\u0027d do well to keep his mind on the business at hand. \"Seems logical to figure they wanted to give you some trouble, maybe make you think twice about keeping this place.\"\\n\\n \"That doesn\u0027t make any sense.\" She leaned forward. Jake shifted uncomfortably when her thin lawn gown gapped at the throat. \"Why should anyone care about an adobe house and a few sagging sheds?\" Jake set the cup down again. \"You forgot the mine.\\n\\n Some people\u0027ll do a lot more than set a fire for gold.\"\\n\\n With a sound of disgust, Sarah propped her elbows on her knees. \"Gold? Do you think my father would have lived like this if there\u0027d been any significant amount of gold?\"\\n\\n \"If you believe that, why are you staying?\"\\n\\n The brooding look left her eyes as she glanced back at him. \"I don\u0027t expect you to understand. This is all I have. All I have left of my father is this place and a gold watch.\" She took the watch from the tilting table beside the bed and closed her hand around it. \"I intend to keep what\u0027s mine. If someone\u0027s played a nasty joke-\" Jake interrupted her. \"Might\u0027ve been a joke. It\u0027s more likely somebody thinks this place is worth more than you say. Trying to burn horses alive and hitting women isn\u0027t considered much of a joke. Even out here.\"\\n\\n She lifted a hand to the wound on her head. He was saying someone had struck her. And he was right, she acknowledged with a quick shudder. He was undoubtedly right. \"No one\u0027s going to scare me off my land. Tomorrow I\u0027ll report this incident to the sheriff, and I\u0027ll find a way to protect my property.\"\\n\\n \"Just what way is that?\"\\n\\n \"I don\u0027t know.\" She tightened her grip on the watch. The look in her eyes said everything. \"But I\u0027ll find it.\"\\n\\n Maybe she would, he thought. And maybe, since he didn\u0027t care much for people setting fires, he\u0027d help her. \"Someone might be offering to buy this place from you,\" Jake murmured, thinking ahead.\\n\\n \"I\u0027m not selling. And I\u0027m not running. If and when\\n\\n I return to Philadelphia, it will be because I\u0027ve decided that\u0027s what I want to do, not because I\u0027ve been frightened away.\"\\n\\n That was an attitude he could respect. \"Fair enough. Since it appears you\u0027re going to have your hands full tomorrow, you\u0027d best get some sleep.\"\\n\\n \"Yes.\" Sleep? How could she possibly close her eyes? What if they came back?\\n\\n \"If it\u0027s all the same to you, I\u0027ll bunk down outside.\" Her eyes lifted to his and held them. The quiet understanding in them made her want to rest her head on his shoulder. He\u0027d take care of her. She had only to ask. But she couldn\u0027t ask.\\n\\n \"Of course, you\u0027re welcome to. Mr. Redman...\"\\n\\n She remembered belatedly to drag the blanket up to her shoulders. \"I\u0027m in your debt again. It seems you\u0027ve come to my aid a number of times in a very short acquaintance.\"\\n\\n \"I didn\u0027t have to go out of my way much.\" He started to rise, then thought better of it. \"I got a question for you.\"\\n\\n Because she was feeling awkward again, she offered him a small, polite smile. \"Yes?\"\\n\\n \"Why\u0027d you ask me not to kiss you?\"\\n\\n Her fingers tightened on the blanket. \"I beg your pardon?\"\\n\\n \"When you were coming to, you took a good, long look at me, and then you told me not to kiss you.\" She could feel the heat rising to her cheeks. Dignity, she told herself. Even under circumstances like these, a woman must keep her dignity. \"Apparently I wasn\u0027t in my right senses.\"\\n\\n He thought that through and then unnerved her by smiling. For his own satisfaction, he reached out to touch the ends of her hair. \"A man could take that two ways.\"\\n\\n She sputtered. The lamplight shifted across his face.\\n\\n Light, then shadow. It made him look mysterious, exciting. Forbidden. Sarah found it almost as difficult to breathe as she did when her stays were too tight. \"Mr.\\n\\n Redman, I assure you-\"\\n\\n \"It made me think.\" He was close now, so close that she could feel his breath flutter over her lips. They parted, seemingly of their own volition. He took the time-a heartbeat, two-to flick his gaze down to them. \"Maybe you\u0027ve been wondering about me kissing you.\"\\n\\n \"Certainly not.\" But her denial lacked the ring of truth. They both knew it.\\n\\n \"I\u0027ll have to give it some thought myself.\" The trouble was, he\u0027d been giving it too much thought already. The way she looked right now, with her hair loose around her shoulders and her eyes dark, just a little scared, made him not want to think at all. He knew that if he touched her, head wound or not, he\u0027d climb right in the bed with her and take whatever he wanted.\\n\\n He was going to kiss her. Her head swam with the idea. He had only to lean closer and his mouth would be on hers. Hard. Somehow she knew it would be hard, firm, masterful. He could take her in his arms right now and there would be nothing she could do about it. Maybe there was nothing she wanted to do about it.\\n\\n Then he was standing. For the first time she noticed that he had to stoop so that his head didn\u0027t brush the roof. His body blocked the light. Her heart was thudding so hard that she was certain he must hear it. For the life of her, she couldn\u0027t be sure if it was fear or excitement. Slowly he leaned over and blew out the lamp.\\n\\n In the dark, he moved down from the loft and out into the night.\\n\\n Shivering, Sarah huddled under the blanket. The man was-She didn\u0027t have words to describe him.\\n\\n The only thing she was certain of was that she wouldn\u0027t sleep a wink.\\n\\n She went out like a light.\\n\\n When Sarah woke, her head felt as though it had been split open and filled with a drum-and-bugle corps. Moaning, she sat on the edge of the cot and cradled her aching head in her hands. She wished she could believe it had all been a nightmare, but the pounding at the base of her skull, and the rust-colored water in the bowl, said differently.\\n\\n Gingerly she began to dress. The best she could do for herself at the moment was to see how bad the damage was and pray the horses came back. She doubted she could afford two more on her meager budget. In deference to her throbbing head, she tied her hair back loosely with a ribbon. Even the thought of hairpins made her grimace.\\n\\n The power of the sun had her gasping. Small red dots danced in front of her eyes and her vision wavered and dimmed. She leaned against the door, gathering her strength, before she stepped out.\\n\\n The shed was gone. In its place was rubble, a mass of black, charred wood. Determined, Sarah crossed over to it. She could still smell the smoke. If she closed her eyes she could hear the terrifying sound of fire crackling over dry wood. And the heat. She\u0027d never forget the heat-the intensity of it, the meanness of it.\\n\\n It hadn\u0027t been much of a structure, but it had been hers. In a civilized society a vandal was made to pay for the destruction of property. Arizona Territory or Philadelphia, she meant to see that justice was done here. But for now she was alone.\\n\\n Alone. She stood in the yard and listened. Never before had she heard such quiet. There was a trace of wind, hot and silent. It lacked the strength to rustle the scrub that pushed its way through the rocks. The only sound she heard was the quick breathing of the puppy, who was sitting on the ground at her feet. The horses had run off. So, Sarah thought as she turned in a circle, had Jake Redman. It was better that way, she decided-because she remembered, all too clearly, the way she had felt when he had sat on the cot in the shadowy lamplight and touched her hair. Foolish. It was hateful to admit it, but she\u0027d felt foolish and weak and, worst of all, willing.\\n\\n There was no use being ashamed of it, but she considered herself too smart to allow it to happen again.\\n\\n A man like Jake Redman wasn\u0027t the type a woman could flirt harmlessly with. Perhaps she didn\u0027t have a wide and worldly experience with men, but she recognized a dangerous one when she saw him.\\n\\n There were some, she had no doubt, who would be drawn to his kind. A man who killed without remorse or regret, who came and went as he pleased. But not her. When she decided to give her heart to a man, it would be to one she understood and respected.\\n\\n With a sigh, she bent down to soothe the puppy, who was whimpering at her feet. There was a comfort in the way he nuzzled his face against hers. When she fell in love and married, Sarah thought, it would be to a man of dignity and breeding, a man who would cherish her, who would protect her, not with guns and fists but with honor. They would be devoted to each other, and to the family they made between them. He would be educated and strong, respected in the community. Those were the qualities she\u0027d been taught a woman looked for in a husband. Sarah stroked the puppy\u0027s head and wished she could conquer this strange feeling that what she\u0027d been taught wasn\u0027t necessarily true. What did it matter now? As things stood, she had too much to do to think about romance. She had to find a way to rebuild the shed. Then she\u0027d have to bargain for a new wagon and team. She stirred some of the charred wood with the toe of her shoe. She was about to give in to the urge to kick it when she heard horses approaching.\\n\\n Panic came first and had her spinning around, a cry for help on her lips. The sunbaked dirt and empty rocks mocked her. The Lord helped those who help themselves, she remembered, and raced into the house with the puppy scrambling behind her.\\n\\n When she came out again her knees were trembling, but she was carrying her father\u0027s rifle in both hands. Jake took one look at her, framed in the doorway, her eyes mirroring fear and fury. It came to him with a kind of dull, painful surprise that she was the kind of woman a man would die for. He slid from his horse. \"I\u0027d be obliged, ma\u0027am, if you\u0027d point that someplace else.\"\\n\\n \"Oh.\" She nearly sagged with relief. \"Mr. Redman. I thought you\u0027d gone.\" He merely inclined his head and took another meaningful look at the rifle.\\n\\n \"Oh,\" she said again, and lowered it. She felt foolish, not because of the gun but because when she\u0027d looked out and seen him all her thoughts about what she wanted and didn\u0027t want had shifted ground. There he was, looking dark and reckless, with guns gleaming at his hip. And there she was, fighting back a driving instinct to run into his arms.\\n\\n \"You...found the horses.\"\\n\\n He took his time tying the team to a post before he approached her. \"They hadn\u0027t gone far.\" He took the rifle from her and leaned it against the house. The stock was damp from her nervous hands. But he\u0027d seen more than nerves in her eyes. And he wondered. \"I\u0027m very grateful.\" Because she felt awkward, she leaned down to gather the yapping puppy in her arms. Jake still hadn\u0027t shaved, and she remembered how his face had felt against the palm of her hand. Fighting a blush, she curled her fingers. \"I\u0027m afraid I don\u0027t know what to do with them until I have shelter again.\" What was going on in that mind of hers? Jake wondered.\\n\\n \"A lean-to would do well enough for the time being. Just need to rig one over a corner of the paddock.\" \"A lean-to, yes.\" It was a relief to deal with something practical. Her mind,went to work quickly. \"Mr. Redman, have you had breakfast?\"\\n\\n He tipped his hat back on his head. \"Not to speak of.\"\\n\\n \"If you could fashion a temporary shelter for the horses, I\u0027d be more than glad to fix you a meal.\" He\u0027d meant to do it anyway, but if she wanted to bargain, he\u0027d bargain. \"Can you cook?\"\\n\\n \"Naturally. Preparing meals was a very important part of my education.\"\\n\\n He wanted to touch her hair again. And more. Instead, he hooked his thumb in his pocket. \"I ain\u0027t worried about you preparing a meal. Can you cook?\" She tried not to sigh. \"Yes.\"\\n\\n \"All right, then.\"\\n\\n When he walked away and didn\u0027t remount his horse, Sarah supposed a deal had been struck. \"Mr. Redman?\" He stopped to look over his shoulder.\\n\\n \"How do you prefer your eggs?\"\\n\\n \"Hot,\" he told her, then continued on his way.\\n\\n She\u0027d give him hot, Sarah decided, rattling pans. She\u0027d give him the best damn breakfast he\u0027d ever eaten. She took a long breath and forced herself to be calm. His way of talking was beginning to rub off on her. That would never do.\\n\\n Biscuits. Delighted that she\u0027d been given a brand-new recipe only the day before, she went to work.\\n\\n Thirty minutes later, Jake came in to stand in the doorway. The scents amazed him. He\u0027d expected to find the frying pan smoking with burnt eggs. Instead, he saw a bowl of fresh, golden-topped biscuits wrapped in a clean bandanna. Sarah was busy at the stove, humming to herself. The pup was nosing into corners, looking for trouble.\\n\\n Jake had never thought much about a home for himself, but if he had it would have been like this. A woman in a pretty dress humming by the stove, the smells of good cooking rising in the air. A man could do almost anything if the right woman was waiting for him.\\n\\n Then she turned. One look at her face, the elegance of it, was a reminder that a man like him didn\u0027t have a woman like her waiting for him.\\n\\n \"Just in time.\" She smiled, pleased with herself. Conquering the cookstove was her biggest accomplishment to date. \"There\u0027s fresh water in the bowl, so you can wash up.\" She began to scoop eggs onto an ironstone plate. \"I\u0027m afraid I don\u0027t have a great deal to offer. I\u0027m thinking of getting some chickens of my own. We had them at school, so I know a bit about them. Fresh eggs are such a comfort, don\u0027t you think?\"\\n\\n He lifted his head from the bowl, and water dripped down from his face. Her cheeks were flushed from cooking, and her sleeves were rolled up past her elbows, revealing slender, milk-white arms. Comfort was the last thing on his mind. Without speaking, he took his seat.\\n\\n Sarah wasn\u0027t sure when he made her more nervous, when he spoke to her or when he lapsed into those long silences and just looked. Gamely she tried again.\\n\\n \"Mrs. Cobb gave me the recipe for these biscuits yesterday.\\n\\n I hope they\u0027re as good as she claimed.\"\\n\\n Jake broke one, and the steam and fragrance poured out. Watching her, he bit into it. \"They\u0027re fine.\" \"Please, Mr. Redman, all this flattery will turn my head.\" She scooped up a forkful of eggs. \"I was introduced to several ladies yesterday while I was buying supplies. They seem very hospitable.\"\\n\\n \"I don\u0027t know much about the ladies in town.\" At least not the kind Sarah was speaking of.\\n\\n \"I see.\" She took a bite of biscuit herself. It was more than fine, she thought with a pout. It was delicious. \"Liza Cody-her family runs the dry goods store. I found her very amiable. She was kind enough to let me have one of their puppies.\"\\n\\n Jake looked down at the dog, who was sniffing at his boot and thumping his tail. \"That where you got this thing?\"\\n\\n \"Yes. I wanted the company.\"\\n\\n Jake broke off a bite of biscuit and dropped it to the dog, ignoring Sarah\u0027s muttered admonition about feeding animals from the table. \"Scrawny now, but he\u0027s going to be a big one.\"\\n\\n \"Really?\" Intrigued, she leaned over to look.\\n\\n \"How can you tell?\"\\n\\n \"His paws. He\u0027s clumsy now because they\u0027re too big for him. He\u0027ll grow into them.\"\\n\\n \"I fancy it\u0027s to my advantage to own a large dog.\" \"Didn\u0027t do you much good last night,\" he pointed out, but pleased both the pup and Sarah by scratching between the dog\u0027s floppy ears. \"You give him a name yet?\"\\n\\n \"Lafitte.\"\\n\\n Jake paused with his fork halfway to his lips.\\n\\n \"What the hell kind of name is that for a dog?\" \"After the pirate. He had that black marking around his eye, like a patch.\"\\n\\n \"Pretty fancy name for a mutt,\" Jake said over a mouthful of eggs. \"Bandit\u0027s better.\"\\n\\n Sarah lifted a brow. \"I\u0027d certainly never give him a name like that.\"\\n\\n \"A pirate\u0027s a bandit, isn\u0027t he?\" Jake dived into another biscuit.\\n\\n \"Be that as it may, the name stands.\"\\n\\n Chewing, Jake looked down at the puppy, who was groveling a bit, obviously hoping for another handout. \"Bet it makes you feel pretty stupid, doesn\u0027t it, fella?\"\\n\\n \"Would you care for more coffee, Mr. Redman?\"\\n\\n Frustrated, Sarah rose and, wrapping a cloth around the handle, took the pot from the stove. Without waiting for an answer, she stood beside Jake and poured. She smelled good, he thought. Soft. Kind of subtle, like a field of wildflowers in early spring. At the ends of her stiff white sleeves, her hands were delicate. He remembered the feel of them on his cheek.\\n\\n \"They taught you good,\" he muttered.\\n\\n \"I beg your pardon?\" She looked down at him.\\n\\n There was something in his eyes, a hint of what she\u0027d seen in them the night before. It didn\u0027t make her nervous, as she\u0027d been certain it would. It made her yearn.\\n\\n \"The cooking.\" Jake put a hand over hers to straighten the pot and-keep the coffee from overflowing the cup. Then he kept it there, feeling the smooth texture of her skin and the surprisingly rapid beating of her pulse. She didn\u0027t back away, or blush, or snatch her hand from his. Instead, she simply looked back at him. The question in her eyes was one he wanted badly to answer.\\n\\n She moistened her lips but kept her eyes steady.\\n\\n \"Thank you. I\u0027m glad you enjoyed it.\"\\n\\n \"You take too many chances, Sarah.\" Slowly, when he was certain she understood his meaning, he removed his hand.\\n\\n With her chin up, she returned the pot to the stove. How dare he make her feel like that, then toss it back in her face? \"You don\u0027t frighten me, Mr. Redman. If you were going to hurt me, you would have done so by now.\"\\n\\n \"Maybe, maybe not. Your kind wears a man down.\"\\n\\n \"My kind?\" She turned, the light of challenge in her eyes. \"Just what kind would that be?\"\\n\\n \"The soft kind. The soft, stubborn kind who\u0027s right on the edge of stepping into a man\u0027s arms.\"\\n\\n \"You couldn\u0027t be more mistaken.\" Her voice was icy now in defense against the blood that had heated at his words. \"I haven\u0027t any interest in being in your arms, or any man\u0027s. My only interest at the moment is protecting my property.\"\\n\\n \"Could be I\u0027m wrong.\" He rocked back in his chair. She was a puzzle, all right, and he\u0027d never known how pleasurable it could be to get a woman\u0027s dander up. \"We\u0027ll born find out sooner or later. Meanwhile, just how do you plan to go about protecting this place?\"\\n\\n Not much caring whether he was finished or not she began to stack the plates. \"I\u0027m going to alert the sheriff, of course.\"\\n\\n \"That\u0027s not going to hurt, but it\u0027s not going to help much, either, if you get more trouble out here. The sheriffs ten miles away.\"\\n\\n \"Just what do you suggest?\"\\n\\n He\u0027d already given it some thought, and he had an answer. \"If I were you, I\u0027d hire somebody to help out around here. Somebody who can give you a hand with the place, and who knows how to use a gun.\"\\n\\n A thrill sprinted through her. She managed, just barely, to keep her voice disinterested. \"Yourself, I suppose.\"\\n\\n He grinned at her. \"No, Duchess, I ain\u0027t looking for that kind of job. I was thinking of Lucius.\"\\n\\n Frowning, she began to scrub out the frying pan.\\n\\n \"He drinks.\"\\n\\n \"Who doesn\u0027t? Give him a couple of meals and a place to bunk down and he\u0027ll do all right for you. A woman staying out here all alone\u0027s just asking for trouble. Those men who burned your shed last night might\u0027ve done more to you than give you a headache.\" His meaning was clear enough, clearer still because she\u0027d thought of that possibility herself. She\u0027d prefer him-though only because she knew he was capable, she assured herself. But she did need someone. \"Perhaps you\u0027re right.\"\\n\\n \"No perhaps about it. Someone as green as you doesn\u0027t have the sense to do more than die out here.\" \"I don\u0027t see why you have to insult me.\"\\n\\n \"The plain truth\u0027s the plain truth, Duchess.\"\\n\\n Teeth clenched, she banged dishes. \"I told you not to-\" \"I got a question for you,\" he said, interrupting her easily. \"What would you have done this morning if it hadn\u0027t been me bringing back the horses?\"\\n\\n \"I would have defended myself.\"\\n\\n \"You ever shot a Henry before?\"\\n\\n She gave him a scandalized look. \"Why in the world would I have shot anyone named Henry?\"\\n\\n With a long sigh, he rose. \"A Henry rifle, Duchess. That\u0027s what you were pointing at my belt buckle before you fixed my eggs.\"\\n\\n Sarah wiped the pan clean, then set it aside. \"No, I haven\u0027t actually fired one, but I can\u0027t imagine it\u0027s that complicated. In any case, I never intended to shoot it.\"\\n\\n \"What did you have in mind? Dancing with it?\"\\n\\n She snatched up a plate. \"Mr. Redman, I\u0027m growing weary of being an amusement to you. I realize that someone like you thinks nothing of shooting a man dead and walking away. I, however, have been taught-rightfully-that killing is a sin.\"\\n\\n \"You\u0027re wrong.\" Something in his voice had her turning toward him again. \" Surviving\u0027s never a sin.\\n\\n It\u0027s all there is.\"\\n\\n \"If you believe that, I\u0027m sorry for you.\"\\n\\n He didn\u0027t want her pity. But he did want her to stay alive. Moving over, he took the plates out of her hands. \"If you see a snake, are you going to kill it or stand there and let it bite you?\"\\n\\n \"That\u0027s entirely different.\"\\n\\n \"You might not think it\u0027s so different if you stay out here much longer. Where\u0027s the cartridges for the rifle?\"\\n\\n Wiping her hands on her apron, Sarah glanced at the shelf behind her. Jake took the cartridges down, checked them, then gripped her arm. \"Come on. I\u0027ll give you a lesson.\"\\n\\n \"I haven\u0027t finished cleaning the dishes.\"\\n\\n \"They\u0027ll keep.\"\\n\\n \"I never said I wanted lessons,\" she told him as he pulled her outside.\\n\\n \"If you\u0027re going to pick up a gun, you ought to know how to use it.\" He hefted the rifle and smiled at her. \"Unless you\u0027re afraid you can\u0027t learn.\" Sarah untied her apron and laid it over the rail. \"I\u0027m not afraid of anything.\" \\n\\n","sourceLink":"https://allnovel.net/lawless/page-4.html","bookId":2686,"book":{"id":2686,"title":"Lawless","description":"Storyline: Lawless (Love by Design: Jack\u0027s Stories 0.5) \\n Filled with Nora\u0027s exquisite storytelling and memorable characters, this rare Western historical romance is a unique treat for Nora\u0027s many fans. Lawless is editorially connected to Loving Jack and Best Laid Plans, which will be published in September 2003 in Love by Design.\\n","cover":"https://allnovel.net/images/lawless.jpg","author":"Nora Roberts","type":"Western","source":"allnovel","link":"https://allnovel.net/lawless.html","creation":"Oct 5, 2019 8:59:08 AM","modification":"Oct 5, 2019 10:14:56 AM"}}
