{"id":82225,"no":17,"title":"Page 17","content":"Gavin felt her hands sliding down his neck as her warm fingertips traced his pectorals and ultimately inched their way down his abdomen. He couldn\u0027t help but smile at the sensations she brought to him; it was utterly impossible not to. As her hand dipped below the sweatpants she was now pulling off his body, he felt her silken hair drape over the flare of his naked hips. Gavin sucked in a deep lungful of air when her tongue licked over his hardened arousal, swirling languorous circles along its tip. With his eyes still closed, he fisted the top of her hair as her head steadily bobbed up and down - her mouth taking in every hard inch of him, her tongue greedily flicking for his juices. He could hear the sound of her cheeks hollowing and unhollowing with each naughty pull she took, and - goddamn - it was driving him nuts. Needing to take in the beautiful sight of the woman he so desperately loved sucking him off into absolute oblivion, he leaned himself up on his elbows and found his worst nightmare staring back - her eyes wicked as she continued her exploration of him.\\n\\n Gina.\\n\\n Gavin flew back against his headboard only to find it was just a nightmare and nothing more.\\n\\n Plowing his hands through his dampened hair, he let out a sigh of relief, his body breaking out into a cold sweat as his eyes flew across his empty bedroom. With his heart slamming through his chest, he sat up on the edge of his bed, and without hesitation, he made his way into the living room.\\n\\n \"Gina, you have to get up,\" he called out, padding into the kitchen where he started brewing some much-needed coffee.\\n\\n The thought of adding alcohol to his mug became very appealing, considering the mess lying on his couch, but he decided to forgo it. Before dozing off to sleep last night, Gavin decided to call Gina\u0027s brother and found out that her whole story was a lie - one huge bullshit-filled lie that Gavin figured was some sick ploy to either get him back or get money from him. Her brother confirmed that their father was indeed in another gambling mess, but he was alive and well, hiding out in Mexico. Gavin decided he would play a little game with her since he was never one to let anybody off that easily.\\n\\n She mumbled something inaudible and pulled the blanket over her body as she turned her back to him, waving him off as if he was the nuisance on this fine Monday morning.\\n\\n \"I\u0027m serious. You have to get the hell up. Let\u0027s not forget you have a funeral to plan. And, at this point, it may not be for Daddy with the mood you have me in.\" He grabbed a mug from the cabinet and looked to his watch, noting the time to be a quarter past seven. Gina didn\u0027t move, so he figured he would up the ante. \"I\u0027ve never physically assaulted a woman in my entire life, but you have me second-guessing my morals. Get up. Now.\"\\n\\n That caught her attention.\\n\\n Sluggishly, she sat up and rubbed her hands over her eyes. \"Why are you in such a rush to get me out of here?\" she asked, yawning.\\n\\n \"You never did cease to amaze me,\" he huffed, shaking his head. He took a sip of his coffee. \"Never.\"\\n\\n She rose from the couch and walked into the kitchen, her body still lacking her jeans. \"Come on, Gavin,\" she sighed, grazing her hand against his jaw. He jerked away from her and took a step back. \"What the heck\u0027s wrong?\" she asked, her eyes bulging. \"You used to love when I touched you. You\u0027re acting as though I\u0027m contaminated.\"\\n\\n He placed his mug on the counter, a frown marring the space between his brows. \"Everything about you is contaminated,\" he whispered through gritted teeth. \"I need to get in the shower. When I get out, if you\u0027re still here, I will physically remove you.\"\\n\\n He went to walk away, but she grabbed his arm. \"I still love you,\" she cried out. He yanked his arm away from her. \"Leaving you was the biggest mistake of my life, Gavin. Please. We can work this out.\"\\n\\n \"Like I said, when I get out of the shower, if you\u0027re still here, I\u0027m removing you myself.\" His tone this time said not to fuck with him. He headed toward his bedroom, but before entering, he turned to face her again with a smirk plastered across his face. \"And, by the way, I\u0027m completely head-over-heels, please-don\u0027t-wake-me-from-this-fucking-dream in love with someone else. She\u0027s everything you\u0027re not and then some. So I guess I owe thanks to you for that. Thank you, Gina, honestly. Thank you for leaving me and fucking up my life for a while. It was the absolute best thing you\u0027ve ever done for me.\"\\n\\n With the smirk holding steady on his face, he graciously bowed in her direction, laughed, and turned toward his bedroom.\\n\\n \"Fuck off, Gavin,\" she spat, her eyes wide at his final denial of her.\\n\\n With that, he closed the door to his bedroom but not before letting out one last throaty laugh.\\n\\n The heavenly smell of freshly baked New York Everything bagels wafted through the air of the taxi Olivia and Emily were sharing. As heavy sleet pelted against the vehicle, rumbling like coins dropping from the heavens, it was all Emily could do to not reach into the bag and start eating one.\\n\\n \"I can hear your stomach growling over the sleet,\" Olivia chirped. \"Here,\" she said, handing Emily an apple. \"At least eat this for now before you get to his place.\"\\n\\n \"But I want to eat breakfast with him,\" she replied, accepting it. \"That was the whole point of me picking up bagels. They\u0027re his favorite.\"\\n\\n Emily looked out the window and took in the sight of the mess New York had turned into overnight. Plows worked furiously through the streets, trying to remove the wintry mix. Considering it was the last two days of October, Emily was shocked by its assault, but nonetheless, she was also thrilled. Upon waking, she retrieved a message from her phone that said the school was closing for the day, relieving her of having to go in. Her plan was a surprise visit to Gavin\u0027s place. Knowing that he didn\u0027t go into work until later in the morning, she was overly excited to grab a few hours with him.\\n\\n Olivia cocked her head to the side. \"Right, like you two are really going to eat,\" she laughed. \"Just eat the damn apple.\"\\n\\n Shaking her head, Emily took a bite. \"We are going to eat...\" she paused, drawing up a mischievous brow. \"And then I\u0027ll send him to work a happy boy...after I allow him to feast on other delectable items,\" she whispered.\\n\\n Both women laughed.\\n\\n Not realizing how hungry she truly was, Emily finished the entire apple.\\n\\n \"Uuugh, I\u0027m so jealous that you have today off,\" Olivia grunted as she stretched her arms out. \"Maybe I\u0027ll become a teacher, so when shit like this happens, I can play hooky.\"\\n\\n \"You\u0027d be miserable. You love working at the art gallery.\"\\n\\n \"I could become an art teacher at a school.\" Olivia shrugged and reached into the bag of bagels. She snatched one out and took a bite. \"On second thought, you\u0027re right. I\u0027d be miserable. I don\u0027t do kids that well.\"\\n\\n Emily laughed.\\n\\n \"Hey, buddy,\" Olivia quickly called out to the driver. \"I get off at the corner here. You might wanna slow it down, considering the streets are covered in potential death.\"\\n\\n The gruff-looking driver rolled his eyes. \"I got you to your destination on time,\" he clipped, pulling over in front of Olivia\u0027s workplace. \"You\u0027re still alive, so no worries. That\u0027s $22.50,\" he said as he turned to face her. \"Without tip,\" he added, smiling.\\n\\n Olivia rolled her eyes right back at him. She started digging in her purse. \"Yeah, yeah, I know how it works. Keep the change.\" She handed him $30.\\n\\n His smile widened.\\n\\n Pulling the strap of her purse over her shoulder, Olivia turned to Emily and gave her a kiss on her cheek. \"Okay, so other than going to eat breakfast and then fucking the shit out of your millionaire boyfriend before he goes to work, what are your plans for the day?\"\\n\\n Olivia\u0027s statement seemed to pique the interest of the driver, who was now smirking at them through the rearview mirror.\\n\\n Emily\u0027s mouth dropped open, her eyes wide. \"Jesus, Olivia.\"\\n\\n \"Well, it\u0027s the truth,\" she laughed. \"And you\u0027ll get in a decent amount of time with him, considering he\u0027s right around the corner from here. So fuck, fuck, fuck away, friend.\"\\n\\n \"Okay, I\u0027m officially ending this conversation,\" Emily laughed. She leaned over Olivia to open the door for her. \"Get out, psycho.\"\\n\\n Laughing, Olivia hopped out of the cab, nearly slipping on the slickened sidewalk. \"Get food shopping done at least.\"\\n\\n \"Yes, I\u0027ll do the food shopping. I won\u0027t see you until later tonight though. I have some errands to run, and then I\u0027m meeting Gavin at his office at five. We\u0027re going out to dinner to try and figure out this whole Dillon mess.\"\\n\\n Poking her head back into the taxi, Olivia cupped Emily\u0027s chin, her eyes soft. \"And it\u0027s a wonderful mess to try and figure out. Don\u0027t forget that.\" She planted another quick kiss on Emily\u0027s forehead, ducked out of the vehicle, and closed the door.\\n\\n Sighing, Emily watched as she made her way into the gallery.\\n\\n Less than two minutes later, it was Emily\u0027s turn to dig into her purse and pay the driver for the short distance. Cautiously, she slipped out of the taxi and thanked him. The door attendant swiftly made his way over to her, offering her his hand to help her navigate through the now slush-riddled sidewalk. Digging in her purse once again, she went to tip him, but he waved her off, explaining that he was more than happy to help. After thanking him, she shuffled into the lobby and headed for the elevators. On her way up, she couldn\u0027t help but laugh to herself as she recalled what the last two times in this very elevator felt like. This time, even though there was a steady flutter of butterflies tickling her stomach, she was relaxed.\\n\\n After making her way down the hall to Gavin\u0027s penthouse, Emily rang the doorbell. That relaxation she had just been experiencing suddenly turned into a mixture of shock and confusion when the door swung open. With her heart pounding in her chest - its speed that of a jackhammer - her eyes transiently followed suit as they swept over the woman who had opened his door, wearing nothing but a sweater and panties.\\n\\n Over her now rapid breathing and sweat-soaked body, Emily managed to get out, \"Who are you?\"\\n\\n With the tilt of her head, Gina eyed Emily up and down. \"I\u0027m Gina. Who the hell are you?\"\\n\\n Somewhere in the back of Emily\u0027s mind, she and Gavin\u0027s conversation from the baseball game flooded her psyche.\\n\\n \"Besides, her name is Gina, and mine, of course, is Gavin - two Gs. I think it was an omen or something - destined to not work out.\"\\n\\n A writhing ball of hurt tore through Emily\u0027s stomach when she realized who she was. Gavin made her feel like she stood a chance with him, but she really didn\u0027t. She couldn\u0027t compete with the greatest love of his life - the woman whom he\u0027d loved enough to want to marry.\\n\\n Without another word spoken, Emily quickly turned and headed for the elevators. She wouldn\u0027t go in to talk to him. She couldn\u0027t. Pride kept her feet moving and kept them moving fast.\\n\\n \"Hey,\" Gina called out. \"Are you going to answer my question or not? Who are you?\"\\n\\n \"Apparently, I\u0027m no one. I had the wrong address,\" she answered, badly wanting to cry.\\n\\n Wanting to know that she wasn\u0027t numb.\\n\\n That she was still feeling.\\n\\n As it turned out, she needn\u0027t worry that she\u0027d lost her ability to feel because her heart was crushed like a pressed flower in a tattered book. Her body desperately tried not to let go of the contents inside her stomach. Her spirit felt defeated, broken, beaten, and torn - its assault brought on by a man whom she was naive enough to trust. Worse, she was naive enough to believe he actually loved her.\\n\\n By the time the elevator completed its descent to the main floor, despite her best efforts to contain it, Emily\u0027s stomach decided to fight back, releasing the small amount of food it held. Right there in the middle of the crowded lobby, she dropped the bag of bagels onto the floor as she dry-heaved repeatedly after throwing up. Embarrassed by her display, her brain faintly registered the sound of a woman gasping in shock. Cupping her hand over her mouth, Emily fled from the building. The icy cold air shocking through her system offered no reprieve to her sweating flesh.\\n\\n As the heart of the world hummed around her with commuters walking down the packed city streets, Emily fought to gather her senses and tried to swallow her pain. However, her wounds rang loud, like the rushing winds screaming in the wintry storm around her. Clenching her purse against her chest, she found herself walking, her thoughts wholeheartedly derailed. She made her way into a diner around the corner and took a seat at a table, her hands trembling - and not by the frigid temperatures outside.\\n\\n Peeling the sleet-beaded coat from her body, she ran her fingers through her wet hair, and it was then that she completely lost it. The tears flowed steadily down her cheeks as she tried to make sense of what\u0027d just happened. She tried to make sense of her toxic, muddied perception of who Gavin made himself out to be in front of her. In her eyes, he was the master of trickery, delivering nothing but words tainted with lies and betrayal. The long road they were supposed to travel together was now riddled with pieces of her heart - pieces that he\u0027d strategically placed there for her to trip and fall over. He was everything she wanted, and apparently, she was nothing he needed.\\n\\n Nothing.\\n\\n He\u0027d shown her what she really was to him - just another void-killer in his life.\\n\\n Emily didn\u0027t know how long she sat there in that diner crying, completely uncaring of patrons whispering and staring in her direction. By the time she hailed a taxi back home, she was torn, her heart feeling as if it\u0027d been sent straight through a grinder. Eyes blurry from tears, she made her way into her bedroom, rid herself of her soaked clothing, and changed into a T-shirt and sweatpants.\\n\\n After brushing her teeth, she moved into the living room and sank into the couch, her body still trembling. Gavin had stabbed her in the heart. He carefully ripped through her chest, exposing the pulsing red tissue with his lies, and no amount of sutures could close this wound. She surrendered who she was for who she thought they were going to be together. Nevertheless, none of it was real; it was all an illusion. She trusted him and thought she had decoded him. But now, the truth was simple to her. She\u0027d been Gavin\u0027s puppet for a night, and she had danced to the beautiful melodies he had played. However, she would never allow him to hurt her again.\\n\\n Never.\\n\\n Throughout the day, she ignored numerous texts from him, proclaiming how excited he was to see her tonight. At one point, he called, but she sent it straight to voicemail. Without listening to the message, she cleared it from her phone. It was obvious to her that he didn\u0027t know he\u0027d been caught, and all it did was sicken her further.\\n\\n As her mind continued to wrap itself around everything, a subdued knock came at the door, temporarily pulling her from the nightmare Gavin\u0027s lies had created. With dulled reflexes, she rose from the couch. Upon opening it, her heart suffered another devastating blow as her eyes met with Dillon\u0027s. He wasn\u0027t supposed to be back until tomorrow. She wanted to ask what he was doing there, but the words froze in her brain as the stretching silence between them enveloped the room.\\n\\n His words came out soft and reluctant as he stared into her tear-soaked eyes. \"Please...talk to me.\"\\n\\n Unable to move, she simply stared at him without a coherent thought able to pass through her lips. He tentatively lifted his arm, placing an unsteady hand on her cheek, and wiped away her tears. Her feet remained planted to the ground, but she broke out in hysterics as her body and mind fell apart under the pressure of two men. Dillon reached out to steady her, his hands gripping tight around her arms, as he pressed his forehead against hers. She stumbled back from the door, the sound of it snapping closed echoed through the apartment.\\n\\n \"Em, I\u0027m so sorry, baby.\" Dropping to his knees, Dillon circled his arms around her waist, pressing his face against her stomach as he, too, began to cry. Emily shook more, the ache in his voice and his crying nearly killing her. \"Baby, I swear, I\u0027m gonna go get help. I\u0027m gonna stop drinking, Emily. God, please, I can\u0027t lose you, baby. I can\u0027t.\"\\n\\n Emily believed, without any interventions, that she was losing her mind. At one point, Dillon was the reason she was still alive, but here and now, he was one of the two reasons she felt like she wanted to die. She didn\u0027t want to give him power through her tears, and the worst part was knowing that the man who was on his knees before her actually loved her. Gavin - on the other hand - tried, tested, and tortured her with his cruel and lying tongue, but her heart still ached for him. Her mind was firing off conflicting thoughts in every direction. There\u0027d been a time when Dillon was picture perfect, but that had shattered, and all that was left were fractured pieces - a collage of what he\u0027d once been in her world. As she struggled to stay afloat in the poisoned waters that the day had sunk her in, she knew she couldn\u0027t deal with any of it.\\n\\n Backing away cautiously, she looked down to him. \"I can\u0027t...I can\u0027t talk about this right now,\" she whispered, her body trembling. \"You have to go, Dillon. Please. You have to leave.\"\\n\\n Still on his knees, he buried his face in his hands. His sobs piercing Emily\u0027s ears sent a shiver straight down her spine. \"Emily, please. I won\u0027t make it without you. I won\u0027t. I\u0027ll fucking kill myself if you leave me.\"\\n\\n He rose to his feet, his body shaking, as he stepped toward her. He slowly lifted his hands to cup her dampened cheeks. \"My God, baby, please give me another chance. Look at yourself. When I walked in, you were just as fucked up over us as I am. We need each other.\"\\n\\n As she grabbed onto his wrists, he leaned his forehead against hers, his eyes intense. \"Let me make this good. Let me make this better. I was drunk, Emily. You know I would\u0027ve never touched you if I wasn\u0027t. I would\u0027ve never, babe.\"\\n\\n \"Plea...Please, Dillon,\" she stammered, shaking her head. \"You have to leave. I can\u0027t do - \"\\n\\n \"No, baby, please listen to me,\" he cried with his forehead still pressed against hers. \"I kept thinking about the first time I kissed you. I kept thinking about the first time we made love. Do you remember that? God, I\u0027ll never take you for granted again, Emily. Please.\"\\n\\n She went to speak, but he wouldn\u0027t let her. He crushed his lips to hers. She tried to back away, but he moved his hands to the nape of her neck, tears flowing from his eyes as he continued his pleas. \"Do you remember what your mother told us before she died, Emily?\"\\n\\n Now she pulled away. Her eyes narrowed on him while her sobs became harder. She tried to catch her breath. \"Don\u0027t you dare bring her into this, Dillon. Don\u0027t you dare.\"\\n\\n He stepped forward, once again placing his shaky hands over her cheeks. \"She told us to take care of one another. She told us to stick through whatever uphill battles life throws at us and to never give up on our relationship. This is my battle, and you\u0027re going to leave me like this, Emily? Let me fix it,\" he whispered, sniffling. \"I can fix it and make us better again. I can bring us back to where we used to be. \"\\n\\n She stared at him for a long moment. The tears streaming down her face felt like acid burning into her flesh. Before she could answer, the sound of keys jingling in the door ripped their gaze from one another.\\n\\n Olivia walked in the apartment, the shock on her face palpable. \"What the hell are you doing here?\" she spat, her eyes hardening in Dillon\u0027s direction.\\n\\n Running his hands through his hair, he backed away from Emily, his voice heated. \"Don\u0027t even fuck with me right now, Olivia.\"\\n\\n \"Let me tell you something,\" she answered, sauntering over to him, her body movements and tone showing she was in no way intimidated. \"If you don\u0027t get the fuck out of my apartment right now, I\u0027m calling the cops. And just to fuck with you further,\" she hissed, ramming her finger into his chest, \"I\u0027ll make sure to stick my father\u0027s best friend - who happens to be the district attorney - on your ass.\"\\n\\n Mentally depleted and her stomach twisting into knots, Emily ran into her bathroom, landing on her knees in front of the toilet. Her body viciously retched up bile as a heavy flow of tears soaked her eyes.\\n\\n \"You\u0027re a fucking asshole!\" Olivia screamed at Dillon, making her way into the bathroom while he followed closely behind her. She hovered over Emily, holding her hair away from her face. \"Look what you do to her! Now get the hell out of here!\"\\n\\n \"Dillon, please,\" Emily managed to get out as her body continued its assault over the toilet, the acrid taste in her mouth stinging against her tongue. \"I\u0027ll call you later - just leave.\"\\n\\n He stepped into the bathroom, reaching to help hold Emily\u0027s hair, but Olivia swatted his arm away. \"Jesus, did you hear what she said? Leave now, Dillon!\"\\n\\n He scrubbed his hands over his face, stared at Olivia for a second, and with his shoulders slumped and eyes downcast, he walked out of the apartment.\\n\\n The slamming of the door behind him made Emily\u0027s body jump. Standing to her feet, she leaned against the wall and tried to catch her breath. Olivia gently took her by the arm and helped her over to the sink. Turning it on, Olivia soaked a washcloth under cool water and ran it across Emily\u0027s face as she continued to sob uncontrollably. After brushing her teeth again, Emily swung open the medicine cabinet, her hands shaking as she skimmed over several medications. She was looking for one in particular - a bottle of Valium that her doctor back in Colorado had given a prescription for after her mother died. She filled a plastic cup with water and popped a pill into her mouth, hoping it would temporarily drag her from this nightmare. She then made her way back into the living room.\\n\\n Falling onto the couch, she covered her eyes with the crease of her arm and tried to compose herself. There were only three days in her entire life she\u0027d remembered feeling like this - the day her mother passed away, the day of her wake, and the day of her burial. Emily\u0027s nerves were shot and sizzled beyond comprehension. All she wanted to do was fade away.\\n\\n Olivia sat down next to her, lifting Emily\u0027s legs over her lap, her voice riddled with concern. \"God, Em, I can\u0027t believe he actually came here. Are you alright?\"\\n\\n Without removing her arm from her face, she nodded.\\n\\n She sighed, rubbing her hand against Emily\u0027s leg. \"Wait until Gavin finds out about this shit. He\u0027s going to freak out,\" she said, looking down to her watch. \"It\u0027s already five. Aren\u0027t you supposed to meet him at his office soon?\"\\n\\n \"No. I\u0027m not going there,\" she choked out, beginning to cry again.\\n\\n Olivia\u0027s brows knitted together. \"Em, what\u0027s wrong?\"\\n\\n \"When I got to his place this morning, Gina opened the door,\" she sobbed, rising from the couch. She walked into the kitchen, shaking her head, still unable to process everything. \"She was barely dressed,\" she said, letting out a humorless laugh. \"And the bastard had the nerve to call and text me all day, too.\"\\n\\n Olivia jumped up from the couch, her eyes wide. \"Holy shit, Emily! What?\"\\n\\n \"I don\u0027t understand,\" she sniffled, reaching for a napkin off the counter. She blew her nose. \"I feel like an asshole - like a complete fool. He used me.\" She tossed the napkin into the garbage and sat down at the kitchen table, her hands covering her face. Olivia pulled a chair up and stroked Emily\u0027s hair away from her shoulder. \"I know what it was though, Liv. He couldn\u0027t have me from the beginning, and I became some sick twisted game for him to conquer.\"\\n\\n \"Have you talked to him yet?\"\\n\\n \"Hell no, I haven\u0027t talked to him, and I\u0027m not going to.\"\\n\\n \"Well, I\u0027m calling the dick. I can\u0027t believe this,\" she huffed, rising from her seat. Setting off at a brisk pace, she yanked her purse from the couch and cursed under her breath.\\n\\n \"No, Liv. I don\u0027t want you calling him. He\u0027ll just come here, and I can\u0027t deal with anymore right now.\"\\n\\n She pulled out her phone, essentially ignoring Emily\u0027s words. She glanced down at it. \"Looks like I don\u0027t have to call him.\"\\n\\n \"What do you mean?\" she asked, wiping her nose against the back of her hand.\\n\\n \"I have four missed calls and two texts from him.\" Olivia studied them, her eyes widening. \"He\u0027s on his way here.\"\\n\\n \"What?\" Emily hopped up and walked over to Olivia. She grabbed the phone from her and looked over the messages.\\n\\n Gavin: I\u0027ve called and left a few texts for Emily. Have you talked to her? I haven\u0027t heard back from her at all, and she should\u0027ve been here already. The ever-impatient and somewhat nervous G.B.\\n\\n Gavin: Forget it. I just talked to your brother, and he said Dillon flew back early. I\u0027m on my way over to your apartment. Leaving my office now. G.B.\\n\\n \"I guess you\u0027re talking to him tonight, Emily.\"\\n\\n \"No. I can\u0027t deal with him right now.\" Starting to cry again, she paced the room. Even with the aid of the Valium working its way through her system, her nerves were no less calm than before. \"Between Dillon coming here and everything that\u0027s happened today, I just can\u0027t, Olivia.\"\\n\\n \"Well, what are you going to do?\" Olivia asked, her voice soft. She walked over to Emily and placed a caring hand on her shoulder. \"He sent that last text twenty minutes ago. Even with traffic, he\u0027ll be here any minute now.\"\\n\\n \"Tell him I\u0027m sick in bed or something.\"\\n\\n \"Friend, if I talk to him, I\u0027m gonna lose it. I love him to absolute death, but I\u0027m so pissed at him right now. There\u0027s no possible way I\u0027d be able to hold back. Then he\u0027ll know everything and still come in to talk to you.\"\\n\\n Without hesitation, Emily moved across the room, plucked her cell off the counter, and sent him a text.\\n\\n Emily: I\u0027m fine, Gavin. I\u0027m home sick in bed.\\n\\n His answering text came relatively quick.\\n\\n Gavin: I wish you would\u0027ve told me, sweets. I could\u0027ve taken care of you all day. Be there in five. I\u0027m right around the corner. Do you need me to pick up anything? Love you.\\n\\n Shaking her head in disgust, she tried to stifle a sob, but it was no use. As her hands trembled, she texted him back.\\n\\n Emily: Don\u0027t come here. I\u0027ll talk to you another time.\\n\\n His next text didn\u0027t come as fast. Emily started to get nervous, but nevertheless, he answered back.\\n\\n Gavin: What\u0027s going on, Emily? Is Dillon there with you? I do know he\u0027s back.\\n\\n \"Jesus Christ, he thinks Dillon\u0027s here with me,\" she let out, wiping tears from her face. \"What do I say now?\"\\n\\n Shaking her head, Olivia let out a sigh. \"Emily, you have to talk to him.\"\\n\\n \"Liv, I\u0027m not fucking talking to him right now. What do I text him back?\"\\n\\n Emily didn\u0027t wait for her to answer. Instead, she panicked and texted him what she assumed might work.\\n\\n Emily: I\u0027m not home right now.\\n\\n \"Well,\" Olivia said. \"What did you tell him?\"\\n\\n \"I told him I wasn\u0027t home.\" She tossed her phone onto the table; the thought of smashing it into pieces became more appealing by the second. \"Now he won\u0027t come here.\"\\n\\n \"Oh my God, Emily. Now he\u0027s definitely coming here.\"\\n\\n \"Why would he show up, thinking I\u0027m not even home?\" she asked defensively.\\n\\n \"Gavin\u0027s no fool, Emily, that\u0027s why,\" she pointed out, walking into the kitchen to grab a bottle of water. \"If anything, you just drilled it into his head that Dillon\u0027s here with you.\"\\n\\n \"He won\u0027t come here,\" she replied, sinking herself into the couch.\\n\\n \"Friend, I\u0027m telling you, he\u0027s coming here.\"\\n\\n No sooner had Olivia finished her sentence, a knock came at the door - and a rather hard knock at that.\\n\\n Heart racing, Emily hopped up from the couch and made her way over to it. She squinted her eye and looked through the peephole, finding Gavin standing in the hallway.\\n\\n \"Fuck,\" she whispered.\\n\\n Olivia walked over to her. \"I told you. What the hell are you going to do now?\" she asked, her voice as low as Emily\u0027s.\\n\\n \"Tell him I lied about not being here. That I\u0027m really sick in bed sleeping and...\" She paused, wiping tears from her eyes as she tried to gather her thoughts. \"That I didn\u0027t want him seeing me because I look horrible or something.\"\\n\\n \"How the fuck do I keep him from coming in here?\" Olivia urgently whispered.\\n\\n Gavin knocked again, and Emily swore she felt as though someone was holding a gun to her head.\\n\\n \"I have no clue, but don\u0027t say anything to him right now about what I know. I\u0027ll talk to him soon. I just can\u0027t...\" her voice trailed off. Cupping her hand over her mouth, she started to cry again.\\n\\n \"Em, I understand, okay?\" Emily nodded. \"I won\u0027t say anything to him. Just go in your bedroom, turn the lights out, and get into bed. I\u0027ll try to keep him in the hall.\"\\n\\n With her heart in her throat, Emily did as Olivia said and hastily made her way into her bedroom.\\n\\n Olivia threw the door open, quickly stepped out into the hallway, and snapped the door closed behind her. Crossing her arms, she glared at Gavin.\\n\\n Gavin stared at her for a moment, his intuition eating away at his stomach. \"What the hell\u0027s going on? Is he in there with her?\"\\n\\n \"No. He\u0027s not in there with her, Gavin. She\u0027s in bed sick and very alone. She just passed out from some medicine I gave her earlier.\"\\n\\n \"First of all, she just texted me less than five minutes ago. Second, why did she change her story all of a sudden?\"\\n\\n \"Well, she has a low tolerance for any kind of meds. And, like I said, I gave it to her a good half hour before she texted you.\" Olivia drew in a deep breath. \"To address her changing her story, let\u0027s just say she\u0027s had a painstakingly tough day, and she looks like shit. She didn\u0027t want you to see her like that.\"\\n\\n The corner of his mouth turned up a smirk. \"Do I look like some kind of fucking moron to you, Olivia?\" he blurted out, garnering a surprised look from her. \"Because if I do, you\u0027re sorely mistaken. If she\u0027s in there trying to work shit out with him, the least she could do is fucking tell me instead of lying.\"\\n\\n \"I just told you he\u0027s not here. You\u0027ve known me long enough to know that I\u0027m not a conniving sneaky liar, Gavin.\" Letting out a melodramatic sigh, she nonchalantly looked down to her nails. \"It\u0027s a shame I can\u0027t say the same thing about certain people I know.\"\\n\\n Although confused by it, Gavin could tell there was more behind Olivia\u0027s statement, but he wasn\u0027t about to get into it with her - not then. However, he was definitely going to make sure he wasn\u0027t being played. Walking right past her, he reached for the door and made his way in. With his heart thumping erratically, hitting the pit of his stomach, his eyes scanned the living room for Emily.\\n\\n \"I told you she\u0027s in bed sleeping,\" Olivia said insistently.\\n\\n The word \"bed\" reverberated through Gavin\u0027s head like a drumroll as a wave of nausea crept over him. Without thinking - and feeling quite like the certified paranoid psychopath he was convinced he was turning into - Gavin bolted down the hall toward Emily\u0027s room.\\n\\n \"Holy shit! What the fuck are you doing, Blake?\" Olivia let out, following right behind him. \"She\u0027s sleeping.\"\\n\\n Hoping to God Olivia wasn\u0027t lying to him, he slowly opened her door, still trying to keep the woman he loved in his forethoughts. With only the faintest light spilling into the room from the kitchen - indeed showing Emily alone in her bed - Gavin was sure that the sigh of relief that seared from his lungs and passed through his lips had awoken her. He pulled in a heavy breath, leaned against the doorway, and plowed his hands through his hair.\\n\\n \"See? She\u0027s sleeping, Gavin,\" Olivia whispered. \"Now come on. She doesn\u0027t feel good.\"\\n\\n Gavin felt like a total asshole for not believing the woman he was supposed to trust. He couldn\u0027t leave. He felt frozen to the ground as his ears soaked in the sound of her breathing - the breathing of the woman who\u0027d repeatedly said she loved him less than twenty-four hours ago. By God, he adored and loved her, but even if only for a beat, he\u0027d doubted what she\u0027d told him. He didn\u0027t intend to wake her, but he needed to touch her. He needed to feel some part of his angel\u0027s body. Against the harsh whispers of Olivia\u0027s pleas, Gavin found himself quietly moving across the room. He approached the bed where Emily lay asleep with her back turned toward him. He let a bittersweet smile form on his lips as his fingertips lightly brushed through her hair. He leaned over her, his body movements careful not to wake her, as he grazed the side of her jaw with his knuckles.\\n\\n \"I love you, Emily,\" he whispered before he softly kissed the back of her head. \"I wish I was here today to take care of you, doll.\" That was all he needed - just that little bit - and he knew he\u0027d be able to sleep through the night.\\n\\n With her breathing increasing by his wanted and unwanted touch, Emily\u0027s head screamed \"you infuriate me; you disgust me; you\u0027ve shattered me\" while her heart cried out \"please stay; I need you in my life; we\u0027re supposed to be amazing together.\" A hot tear trickled down her cheek as her fingernails dug into her clenched fists. But she didn\u0027t move. Her body was still as she heard him leave the room. Olivia walked him out of the apartment - and out of her life. Releasing the breath she had been holding from the moment he\u0027d walked into the apartment, Emily turned over onto her back. Through tear-flooded eyes, she took in the sight of Olivia\u0027s silhouette, standing just outside her door.\\n\\n Olivia went to walk in, but Emily spoke up. \"I just need to be alone,\" she cried out. \"Okay? I\u0027m...I\u0027m so sorry I put you through that, Olivia. I\u0027m so sor...sorry,\" she stuttered through her cries. \"Thank you so much. But I just can\u0027t...I ca...can\u0027t talk about it.\"\\n\\n \"Are you sure you\u0027re going to be alright, Em?\" Olivia whispered, her voice thick with concern. \"I\u0027m supposed to meet Tina in a little while. I could stay home if you need me to.\"\\n\\n Sniffling, she shook her head. \"No, you go. Go have a good time. I\u0027ll be okay.\"\\n\\n Olivia stood there for a second, let out a heavy sigh, and then slowly closed the door.\\n\\n In the pitch dark of her room, Emily curled the blankets tightly around her trembling body, her head trying to absorb the wicked day that\u0027d been cast upon her.\\n\\n Sleep.\\n\\n She needed sleep like she needed oxygen, water, and food - yet, she was pretty sure she wouldn\u0027t find any tonight. No. Sleep wouldn\u0027t be her friend this evening.\\n\\n Instead, loneliness, hurt, confusion, and pain would replace it. \\n\\n","sourceLink":"https://allnovel.net/collide-collide-1/page-17.html","bookId":1865,"book":{"id":1865,"title":"Collide (Collide #1)","description":"Storyline: Collide (Collide #1) \\n A missed first encounter... Colliding with a second chance... On the heels of graduating college and trying to cope with her mother\u0027s death, Emily Cooper moves to New York City for a fresh start. While harboring secrets of his own, Dillon Parker takes care of Emily through her grief. Knowing he can\u0027t live without her by his side, he\u0027s sweet, thoughtful, and everything Emily has ever wanted in a man. Until she meets Gavin Blake - a rich and notorious playboy who is dangerously sexy and charming as hell. Emily tries to deny the instant connection she feels, but Mr. Tall, Dark, and Handsome is not inclined to let go so easily. Recovering from his own painful past, Gavin will stop at nothing to win Emily over. This unexpected encounter compels Emily to question her decisions, forcing her to make a choice that will destroy friendships, shatter hearts, and forever change her life.\\n","cover":"https://allnovel.net/images/collide-collide-1.jpg","author":"Gail McHugh","type":"Young Adult","source":"allnovel","link":"https://allnovel.net/collide-collide-1.html","creation":"Oct 5, 2019 8:58:05 AM","modification":"Oct 5, 2019 4:41:34 PM"}}
