{"id":90566,"no":9,"title":"Page 9","content":"Cassie\u0027s piece of amethyst was quite large. It was a pendant, hanging from the claws of a silver owl with outspread wings, and it felt cool against Cassie\u0027s chest under her blue and white sweater. She checked in Diana\u0027s mirror to make sure it didn\u0027t make a bump and then touched it nervously. Cassie had had three stones so far: the chalcedony rose Adam had given her, the quartz necklace Melanie had put around her neck at the Homecoming dance, and the piece of hematite she\u0027d found at Number Thirteen. She hadn\u0027t kept any of them long. The chalcedony she\u0027d had to give back to Adam, the quartz had been lost that same night at the burying .ground, and the hematite had been stolen. She just hoped nothing was going to happen to this amethyst.\\n\\n Clouds had gathered in the night, and the sky was steely-gray as Diana drove them to school that morning. And school these days was about as bleak as the weather. Hall monitors, wearing badges and wintry expressions, stood in every corridor waiting for someone to break the rules. Which usually didn\u0027t take very long; there were so many rules that it was impossible not to break one or two just by being alive.\\n\\n \"We almost got sent up for wearing a noisemakin\u0027 device,\" Chris said as they were walking down the hall at lunchtime.\\n\\n Cassie tensed. \"What did you do?\"\\n\\n \"Bribed him,\" Doug said with a wicked grin. \"We gave him a Walkman.\"\\n\\n \"My Walkman,\" Chris said, aggrieved.\\n\\n \"I wonder what the penalty for bribing a hall monitor is?\" Laurel mused as they reached the cafeteria.\\n\\n Cassie opened her mouth, but the words froze on her lips. Through the glass windows of the cafeteria she could see something that wiped all thought from her mind.\\n\\n \"Oh God,\" said Laurel.\\n\\n \"I don\u0027t believe it,\" Diana whispered.\\n\\n \"I do,\" Adam said.\\n\\n In the very center of the cafeteria was a wooden structure that Cassie recognized from her history books. It was made in two parts, which when closed held a person\u0027s wrists and neck securely in place, protruding through holes from the other side.\\n\\n The stocks.\\n\\n And they were occupied.\\n\\n There was a guy inside them, a big husky guy Cassie recognized from her algebra class. He\u0027d danced with her at Homecoming, and he\u0027d been overly familiar with his hands. He liked to talk back to teachers, too. But she\u0027d never seen him do anything deserving of this.\\n\\n \"He won\u0027t get away with it,\" Diana was saying, her green eyes blazing with intensity.\\n\\n \"Who, the principal?\" Deborah asked. She and Suzan and Nick were standing by the cafeteria door, waiting for the others. \"He already has. He was taking some parents on a guided tour a few minutes ago and they came through here ... he showed it to them, for God\u0027s sake. Said it was part of a \u0027tough love\u0027 program. Said other schools made troublemakers stand on tables so everybody could look at them, but that he thought the stocks were more humane because you could sit down. He almost made it sound reasonable. And they were just nodding and smiling - they ate it up.\"\\n\\n Cassie felt queasy. She was thinking of the Witch Dungeon at Salem, where she and Chris and Doug had scuttled through narrow corridors lined with tiny dark cells. The stocks gave her the same sick feeling in her stomach. How can people do this to other people? she thought.\\n\\n \" - passing it off as part of our heritage,\" Nick was saying, his lip curled in disgust, and Cassie knew he felt the same way.\\n\\n \"Can we talk about it while we eat?\" Suzan asked, shifting from one foot to the other. \"I\u0027m starving.\"\\n\\n But as they made their way toward the back room - the private domain of the Club for the last four years - a short figure with rusty hair stepped in front of them.\\n\\n \"Sorry,\" Sally Waltman smirked. \"That room is for hall monitors only, now.\"\\n\\n \"Oh, yeah?\" said Deborah.\\n\\n Two guys with badges appeared from nowhere and stood on either side of Sally.\\n\\n \"Yeah,\" one of them said.\\n\\n Cassie looked through the glass windows of the back room - there was no crowd of hangers-on standing in front of it today - and saw Portia\u0027s tawny head. She was surrounded by girls and guys who were looking at her admiringly. They all wore badges.\\n\\n \"You\u0027ll just have to sit somewhere else,\" Sally was telling the Club. \"And since there aren\u0027t enough seats at any one table, you\u0027ll have to break your group up. What a shame.\"\\n\\n \"We\u0027ll go outside,\" Nick said shortly, taking Cassie\u0027s arm.\\n\\n Sally laughed. \"I don\u0027t think so. No more eating out front. If you can\u0027t find a place to sit in here, you stand.\"\\n\\n Cassie could feel Nick\u0027s muscles cord. She held on to his arm tightly. Diana had a similar hold on Adam, whose blue-gray eyes were like chips of steel, fixed on the guys beside Sally.\\n\\n \"It\u0027s not worth it,\" Diana said quietly, with forced calm. \"It\u0027s what he wants. Let\u0027s go stand over there.\"\\n\\n Sally looked disappointed as they all started to move to the wall. Then triumph flashed in her eyes.\\n\\n \"He\u0027s in violation already,\" she said, pointing to Doug. \"He\u0027s wearing a radio.\"\\n\\n \"It\u0027s not on,\" Doug said.\\n\\n \"It doesn\u0027t have to be. Just wearing it is a Type-A offense. Come with me, please.\" The two guys surged forward to help Doug come.\\n\\n \"Nick, don\u0027t. Wait - \" Cassie gasped, getting in front of him. A fight in the cafeteria was all they needed.\\n\\n Doug\u0027s eyes were glittering wildly. He looked mad enough to hit Sally, not to mention the two guys.\\n\\n \"Bring him,\" Sally said in an exultant voice. The guys reached for Doug. Doug\u0027s fist jerked back. And then a throaty voice cut through the confusion.\\n\\n \"What\u0027s going on here?\" Faye said, her amber eyes smoldering. She was wearing another of the little business suits; this one black and yellow.\\n\\n Sally glared at her. \"They\u0027re refusing to comply with the orders of a hall monitor,\" she said. \"And he\u0027s wearing a radio.\"\\n\\n Faye reached over and unhooked the Walkman from Doug\u0027s belt. \"Now he\u0027s not,\" she said. \"And I\u0027m telling them to go eat somewhere else - outside, maybe. On my authority.\"\\n\\n Sally was sputtering. Faye chuckled and led the Club out of the cafeteria.\\n\\n \"Thanks,\" Diana said, and for a moment she and Faye looked each other in the eye. Cassie thought of the candles burning in a circle on the road. A new stage of life - was Faye entering a new stage of life? Coming back to the coven?\\n\\n But Faye\u0027s next words undeceived her. \"You know, there\u0027s no reason that you can\u0027t eat in the back room,\" she said. \"You can all become hall monitors. That\u0027s what he wants - \"\\n\\n \"He wants to take us over,\" interrupted Deborah scornfully.\\n\\n \"He wants to join with us. He\u0027s one of us.\"\\n\\n \"No, he\u0027s not, Faye,\" Cassie said, thinking of the shadow under the rock. \"He\u0027s nothing like us.\"\\n\\n Faye gave her a strange glance, but all she said was, \"There\u0027s a hall monitors\u0027 meeting in C-207 last period. Think about it. The sooner you join him, the easier things will be.\" She tossed Doug\u0027s Walkman back to him with a negligent gesture and walked away.\\n\\n Lunch was uncomfortable; it was cold in the front yard of the school, and nobody but Suzan had much of an appetite. Sean showed up late, after all the excitement was over. They discussed plans to fight Black John, but as always they came back to the single issue of power. They needed power to fight him effectively. They needed the Master Tools.\\n\\n Everyone had a different idea of where to search. Adam proposed the beach - especially around Devil\u0027s Cove, where Mr. Fogle, the former principal, had been killed by a rock slide. Deborah thought maybe the old burying ground. \"It\u0027s been here since the 1600s,\" she said. \"The original coven could easily have hidden things there.\" Melanie and Diana discussed the possibility of making a crystal pendulum designed to seek out traces of \"white energy\" the tools might be giving off.\\n\\n Cassie sat quietly, close to Nick, not saying much. She had the stupid, desperate urge to forget all of this and bury her head in his shoulder. She didn\u0027t know New Salem as well as the others - how could she come up with a reasonable place to search? And she had such a feeling of dread, of evil things just waiting to happen.\\n\\n We\u0027re going to lose, she thought, listening to the worried voices of the others. We\u0027re just kids, and he\u0027s got centuries of experience. We\u0027re going to lose.\\n\\n The feeling of dread got worse as the day went on. She ran into Nick as she was walking to her last class and he stopped in the hall.\\n\\n \"You look awful,\" he said.\\n\\n \"Thanks.\" Cassie tried a wry smile for him.\\n\\n \"No, I mean you\u0027re so pale - you feeling okay? Do you want to go home?\"\\n\\n \"Leaving school grounds without permission,\" Cassie quoted automatically, tiredly, and then she was in his arms.\\n\\n Nick said, \"They can take their permission and - \"\\n\\n Cassie just clung to him. Nick was so good to her; she wanted to love him. She would make herself love him, she decided. Maybe they should go back to Crowhaven Road; go someplace where they could be alone. Nick didn\u0027t like doing this kind of thing where people could see.\\n\\n \"Hold me,\" she said. He did. Then he kissed her.\\n\\n Yes. Just go with it. Be part of Nick - that was safe. Nick would take care of her. She could stop thinking now.\\n\\n \"Well, well, well . . . looks like a Type-A violation to me,\" an officious voice said. \"Public displays of affection, inappropriate to the serious and dignified purpose of formal education. What do you say, Portia?\"\\n\\n Nick and Cassie broke apart, Cassie flushing.\\n\\n \"I think it\u0027s just too revolting,\" Portia Bainbridge said.\\n\\n Behind her was a gaggle of hall monitors, on their way to the meeting, apparently. There were maybe thirty of them. Cassie\u0027s heart was suddenly beating hard and fast.\\n\\n \"And it\u0027s her fault,\" Portia went on, looking down her aristocratic nose at Cassie. \"I heard her initiate it. Let\u0027s take her in.\"\\n\\n \"That\u0027s right, the little flirt,\" Sally said. Cassie remembered Sally\u0027s voice in the bathroom; the anger in it, the viciousness. This one had every guy at Homecoming dance following her around with his tongue hanging out - including my boyfriend. She\u0027d come to think of herself so differently since she\u0027d overheard Sally talking about her that day.\\n\\n Nick was looking at the group of monitors, his face cold - like the old Nick, the one Cassie had first met. Cold as ice. \"Take her where? The penalty for a Type-A offense is supposed to be detention. Or don\u0027t you read your own rules?\" he said.\\n\\n \"We decide what the penalties are - \" Portia began, but Sally interrupted.\\n\\n \"She was refusing to cooperate with a hall monitor at lunchtime,\" she said. \"That\u0027s what we\u0027re taking her in for. Mr. Brunswick gave us special instructions. \"We\u0027re going to take her to the office - she can talk to him.\"\\n\\n \"Then you can take both of us,\" Nick said. His arm tightened on Cassie.\\n\\n There were too many of them. Cassie\u0027s eyes skimmed over the crowd of hall monitors, seeing not a friendly face among them. All seniors, all kids who hated witches. And Faye wasn\u0027t here now.\\n\\n \"Nick,\" she said, her voice soft and careful over the thumping of her heart, \"I think I\u0027d better go with them.\" She glanced back at Sally. \"Can I just say good-bye to him?\"\\n\\n Looking sardonic, Sally nodded. Cassie put her arms around Nick\u0027s neck.\\n\\n \"Get the others,\" she whispered in his ear. \"The monitors will be in their meeting - you\u0027ll have to find a way to get me out.\"\\n\\n As he drew back, Nick\u0027s mahogany eyes met hers in acknowledgement. Then, with an expressionless look at Sally, he stood aside.\\n\\n The group of monitors surrounded Cassie and escorted her down the hall, treating her like a mass murderer. She had a wild impulse to giggle, but as they reached the office the urge disappeared in a flood of sheer dread and anxiety.\\n\\n He planned this, she thought. Maybe not this specifically, today. But he knew he\u0027d get us somehow, one by one. She tried to ignore the little voice whispering, he knew he\u0027d get you. It\u0027s you he\u0027s after.\\n\\n Because she was an outsider - or because she didn\u0027t fit in with his plans. A vision of Kori flashed through her mind: Kori lying stiff and motionless with a broken neck at the bottom of the hill. She\u0027d seen what happened to people who didn\u0027t fit in with Black John\u0027s plans.\\n\\n \"Maybe if you bat your eyes at him he\u0027ll let you off,\" Sally whispered spitefully and pushed her in the office door.\\n\\n Cassie didn\u0027t answer. She couldn\u0027t.\\n\\n She hadn\u0027t been in this office since she\u0027d gone to Mr. Fogle to complain that Faye was persecuting her. It looked the same, except that there was a crackling fire in the fireplace now. And the man behind the desk was different.\\n\\n Don\u0027t look at him, Cassie thought, as the door swung shut behind her, but she couldn\u0027t help it. Those black eyes held hers from the instant she glanced toward the desk. That hawklike face betrayed no sign of surprise that she was there.\\n\\n The principal put a slim gold-plated pen on the desk with a barely audible click.\\n\\n \"Cassandra,\" he said.\\n\\n Cassie\u0027s knees felt weak.\\n\\n It was the voice of the shadow. A dark, liquid voice. So quiet, so insidious - so evil. Under his hematite-black eyes she felt naked, exposed. As if he were looking at her mind. Looking for a crack to get in.\\n\\n \"Mr. Brunswick,\" she said. Her voice sounded strange to her own ears. Polite, but distant.\\n\\n He smiled.\\n\\n He was wearing a black turtleneck and a black jacket. He stood, resting his fingertips on the desk.\\n\\n \"So brave,\" he said. \"I\u0027m proud of you.\"\\n\\n It was the last thing she expected. Cassie just stared at him. Her fingers flew automatically to the bump of the amethyst pendant under her sweater.\\n\\n His eyes followed the movement. \"I wouldn\u0027t bother,\" he said, smiling faintly. \"That crystal is much too small to be effective.\"\\n\\n Cassie\u0027s hand dropped slowly. How had he known? She felt so confused, so off-balance. She stared at the man in front of her, trying to connect him with the burned creature that had crouched over her grandmother in the kitchen, with the seventeenth-century wizard who had led a frightened coven to New Salem. How was he here at all, that was the question. What was the source of his power?\\n\\n \"And amethyst is a weak stone, a stone of the heart,\" he was going on softly. \"Purity of purpose, Cassie; that\u0027s the secret. Purity and clarity. Never forget your purpose.\"\\n\\n She had the strange feeling he was answering her question. Oh God, why didn\u0027t Nick come? Her heart was pounding so hard . . . she was frightened.\\n\\n \"Let me demonstrate,\" the dark man said. \"If you would give me that pendant? For a moment only,\" he added, as Cassie stood motionless.\\n\\n Slowly, Cassie reached around the back of her neck. With cold fingertips she undid the silver chain and removed it. She didn\u0027t know what else to do.\\n\\n Slowly, precisely, he took it.\\n\\n Suddenly, wildly, Cassie thought of a magician about to do a trick. Nothing up those sleeves, she thought. Only flesh that shouldn\u0027t be there in the first place.\\n\\n Still holding the necklace in the air, the principal turned away from Cassie. The fire leaped and crackled and Cassie felt her pulse in her throat and fingertips. I can\u0027t stand much more of this, she thought. Nick, where are you?\\n\\n \"You see,\" the principal said, in a voice that seemed oddly distorted, \"amethyst is a stone riddled with impurities. For power, quartz is always my choice . . .\" He began to turn around.\\n\\n No, thought Cassie. Everything had gone into slow motion, as if she were watching one frame after another of a video. A video played on a very superior machine, each frame crisp and bright and sharp-edged, with no blurriness. Cassie didn\u0027t even know where the No had come from, except that something deep in her own brain was screaming in protest, trying to warn her. Don\u0027t look, oh, don\u0027t look.\\n\\n Cassie wanted to stop the action, to freeze the frame. But she couldn\u0027t. It was taking forever, but the dark man was still turning. He was facing her.\\n\\n She saw the elegant black jacket, the black turtleneck sweater. But above the turtleneck was a monstrosity that forced tears from her eyes and clogged the scream in her throat. The man had no face.\\n\\n No hair, no eyebrows, no eyes, no nose. No mouth, only a grinning outline of clenched teeth. Even that, even the stark bones which faced her, were as clear as water.\\n\\n Cassie couldn\u0027t scream, couldn\u0027t breathe. Her mind was out of control.\\n\\n Oh God, oh God the skull isn\u0027t gone no wonder we couldn\u0027t find it, it didn\u0027t explode at all because it\u0027s in his head, oh Diana oh Adam it\u0027s in his head ...\\n\\n \"You see, Cassandra,\" came the inhuman voice from behind those clenched teeth, \"purity plus clarity equals power. And I have more power than you children have ever dreamed of.\"\\n\\n Oh God I won\u0027t believe this I won\u0027t believe this is happening I don\u0027t want to see any more ...\\n\\n \"My spirit is not confined to this body,\" the voice went on calmly, with terrible lucidity. \"It can flow like water wherever I direct it. I can focus its power anywhere.\"\\n\\n The hollow eyesockets tilted down, toward the amethyst pendant which hung from a perfectly normal-looking hand. Firelight flickered deep inside the crystal. Then Cassie felt it - an outrush of power like the one she\u0027d sent to scare the dog and to warn Sean and to light the match. Only this was much stronger, much more concentrated than her feeble bursts had been. She could almost see it, like a blaze of light.\\n\\n The amethyst pendant shattered.\\n\\n The silver owl swung, but nothing hung from its claws now. The crystal was gone.\\n\\n Cassie\u0027s ears caught the tinkle as bits of it fell. But she didn\u0027t really notice the sound consciously. She was blind and deaf with panic.\\n\\n \"Now, Cassandra,\" the voice was beginning again, and then it was interrupted by a noise so loud that even Cassie couldn\u0027t ignore it. A roar was coming from the front yard of the school, a sound like a pep rally, only angry. Shrill screams rang out against the background of deep shouting.\\n\\n The principal dropped the silver chain and strode over to the window which overlooked the front of the school.\\n\\n And Cassie\u0027s brain woke up. It wanted only one thing, to get out of here. With the dark man\u0027s attention distracted, she dove for the door.\\n\\n She ran straight through the office without looking at the secretaries. There was chaos in the second-floor halls. Everyone was flooding out \"of classrooms. \"It\u0027s a fight!\" some guy on the stairs was yelling. \"Come on!\"\\n\\n It\u0027s like a riot; they can\u0027t control everybody at once, Cassie realized dimly. She was still running. She ran down the stairs and then down a hallway, instinctively heading for the center of the confusion.\\n\\n \"Cassie, wait!\"\\n\\n Not a man\u0027s voice, but a threatening one. Faye. Cassie paused for an instant, looking around desperately for Nick or Diana or Adam.\\n\\n \"Cassie, stop, for pity\u0027s sake. No one is trying to hurt you. I\u0027ve been running after you all the way from the office.\"\\n\\n Warily, Cassie edged backward. The hall was deserted now. Everyone was outdoors.\\n\\n \"Cassie, just listen to me. He\u0027s not trying to murder you, I promise. He wants to help you. He likes you.\"\\n\\n \"Faye, you\u0027re insane!\" Cassie\u0027s control broke, and she screamed the words. \"You don\u0027t know what he is! Everything you see about him is an illusion. He\u0027s a monster!\"\\n\\n \"Don\u0027t be ridiculous. He\u0027s one of us - \"\\n\\n \"Oh, my God, oh, my God,\" Cassie said. Reaction was setting in and her knees were shaking so badly that she had to lean against the wall. She slid down, tearing a poster about the Thanksgiving football game. \"You didn\u0027t see him. You don\u0027t know.\"\\n\\n \"I know you\u0027re being a baby. You didn\u0027t even stay to listen to what he had to say to you. He was going to explain everything - \"\\n\\n \"Faye, wake up!\" Cassie cried. \"For God\u0027s sake, will you please wake up and look at him?\\n\\n He\u0027s nothing that you think. You\u0027re completely blind.\"\\n\\n \"You think you know so much about it.\" Faye stood back, arms crossed over her chest. She tilted her chin up and looked down at Cassie with heavy-lidded, queerly triumphant eyes. Her blood-red lips curved in a smile. \"You think you know everything - but you don\u0027t even know what his name was when he was here last. When he came to our parents and he lived at Number Thirteen.\"\\n\\n The strength of terror Cassie had felt moments earlier was gone, and the ground suddenly felt very unstable. She pressed a hand against the floor. Faye was still looking at her with those strange, triumphant eyes. \"No,\" Cassie whispered.\\n\\n \"\u0027No\u0027 you don\u0027t know? Or \u0027no\u0027 don\u0027t tell you? But I want to tell you, Cassie, and it\u0027s time you did know. The name he used last time was John Blake.\" \\n\\n","sourceLink":"https://allnovel.net/the-secret-circle-the-power-the-secret-circle-3/page-9.html","bookId":2097,"book":{"id":2097,"title":"The Secret Circle: The Power (The Secret Circle #3)","description":"Storyline: The Secret Circle book 3: The Power \\n United at last with Diana, the mistress of her coven, Cassie must first sacrifice her love for Adam to save the Secret Circle and the town of New Salem from the evil powers of the witch Faye. Threatened by the possibility of her destruction in a final battle between good and evil, Cassie must hope that her supernatural gifts are strong enough to obliterate the powers of evil. If victorious, Cassie will win more than she ever dreamed. But if she and Diana fail, the Power will go to those who seek only to destroy.\\n","cover":"https://allnovel.net/images/the-secret-circle-the-power-the-secret-circle-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-secret-circle-the-power-the-secret-circle-3.html","creation":"Oct 5, 2019 8:58:20 AM","modification":"Oct 5, 2019 5:43:19 PM"}}
