{"id":4522,"no":21,"title":"Chapter 21","content":"21:1 [hgb] 耶 和 华 的 话 临 到 耶 利 米 。 那 时 ， 西 底 家 王 打 发 玛 基 雅 的 儿 子 巴 施 户 珥 ， 和 玛 西 雅 的 儿 子 祭 司 西 番 雅 ， 去 见 耶 利 米 ， 说 ， [kjv] The word which came unto Jeremiah from the LORD, when king Zedekiah sent unto him Pashur the son of Melchiah, and Zephaniah the son of Maaseiah the priest, saying, [bbe] The word which came to Jeremiah from the Lord, when King Zedekiah sent to him Pashhur, the son of Malchiah, and Zephaniah, the son of Maaseiah the priest, saying, 21:2 [hgb] 请 你 为 我 们 求 问 耶 和 华 。 因 为 巴 比 伦 王 尼 布 甲 尼 撒 来 攻 击 我 们 ， 或 者 耶 和 华 照 他 一 切 奇 妙 的 作 为 待 我 们 ， 使 巴 比 伦 王 离 开 我 们 上 去 。 [kjv] Enquire, I pray thee, of the LORD for us; for Nebuchadrezzar king of Babylon maketh war against us; if so be that the LORD will deal with us according to all his wondrous works, that he may go up from us. [bbe] Will you get directions from the Lord for us; for Nebuchadrezzar, king of Babylon, is making war against us; it may be that the Lord will do something for us like all the wonders he has done, and make him go away from us. 21:3 [hgb] 耶 利 米 对 他 们 说 ， 你 们 当 对 西 底 家 这 样 说 ， [kjv] Then said Jeremiah unto them, Thus shall ye say to Zedekiah: [bbe] Then Jeremiah said to them, This is what you are to say to Zedekiah: 21:4 [hgb] 耶 和 华 以 色 列 的 神 如 此 说 ， 我 要 使 你 们 手 中 的 兵 器 ， 就 是 你 们 在 城 外 与 巴 比 伦 王 和 围 困 你 们 的 迦 勒 底 人 打 仗 的 兵 器 翻 转 过 来 ， 又 要 使 这 些 都 聚 集 在 这 城 中 。 [kjv] Thus saith the LORD God of Israel; Behold, I will turn back the weapons of war that are in your hands, wherewith ye fight against the king of Babylon, and against the Chaldeans, which besiege you without the walls, and I will assemble them into the midst of this city. [bbe] The Lord God of Israel has said, See, I am turning back the instruments of war in your hands, with which you are fighting against the king of Babylon and the Chaldaeans, who are outside the walls and shutting you in; and I will get them together inside this town. 21:5 [hgb] 并 且 我 要 在 怒 气 ， 忿 怒 ， 和 大 恼 恨 中 ， 用 伸 出 来 的 手 ， 并 大 能 的 膀 臂 ， 亲 自 攻 击 你 们 。 [kjv] And I myself will fight against you with an outstretched hand and with a strong arm, even in anger, and in fury, and in great wrath. [bbe] And I myself will be fighting against you with an outstretched hand and with a strong arm, even with angry feeling and passion and in great wrath. 21:6 [hgb] 又 要 击 打 这 城 的 居 民 ， 连 人 带 牲 畜 都 必 遭 遇 大 瘟 疫 死 亡 。 [kjv] And I will smite the inhabitants of this city, both man and beast: they shall die of a great pestilence. [bbe] And I will send a great disease on the people living in this town, on man and on beast, causing their death. 21:7 [hgb] 以 后 我 要 将 犹 大 王 西 底 家 和 他 的 臣 仆 百 姓 ， 就 是 在 城 内 ， 从 瘟 疫 ， 刀 剑 ， 饥 荒 中 剩 下 的 人 ， 都 交 在 巴 比 伦 王 尼 布 甲 尼 撒 的 手 中 和 他 们 仇 敌 ， 并 寻 索 其 命 的 人 手 中 。 巴 比 伦 王 必 用 刀 击 杀 他 们 ， 不 顾 惜 ， 不 可 怜 ， 不 怜 悯 。 这 是 耶 和 华 说 的 。 [kjv] And afterward, saith the LORD, I will deliver Zedekiah king of Judah, and his servants, and the people, and such as are left in this city from the pestilence, from the sword, and from the famine, into the hand of Nebuchadrezzar king of Babylon, and into the hand of their enemies, and into the hand of those that seek their life: and he shall smite them with the edge of the sword; he shall not spare them, neither have pity, nor have mercy. [bbe] And after that, says the Lord, I will give up Zedekiah, king of Judah, and his servants and his people, even those in the town who have not come to their end from the disease and the sword and from need of food, into the hands of Nebuchadrezzar, king of Babylon, and into the hands of their haters, and into the hands of those desiring their death: he will put them to the sword; he will not let anyone get away, he will have no pity or mercy. 21:8 [hgb] 你 要 对 这 百 姓 说 ， 耶 和 华 如 此 说 ， 看 哪 ， 我 将 生 命 的 路 和 死 亡 的 路 摆 在 你 们 面 前 。 [kjv] And unto this people thou shalt say, Thus saith the LORD; Behold, I set before you the way of life, and the way of death. [bbe] And to this people you are to say, The Lord has said, See, I put before you the way of life and the way of death. 21:9 [hgb] 住 在 这 城 里 的 必 遭 刀 剑 ， 饥 荒 ， 瘟 疫 而 死 。 但 出 去 归 降 围 困 你 们 迦 勒 底 人 的 必 得 存 活 ， 要 以 自 己 的 命 为 掠 物 。 [kjv] He that abideth in this city shall die by the sword, and by the famine, and by the pestilence: but he that goeth out, and falleth to the Chaldeans that besiege you, he shall live, and his life shall be unto him for a prey. [bbe] He who keeps in this town will come to his death by the sword and through need of food and through disease; but he who goes out and gives himself up to the Chaldaeans who are shutting you in, will go on living, and will keep his life safe. 21:10 [hgb] 耶 和 华 说 ， 我 向 这 城 变 脸 ， 降 祸 不 降 福 。 这 城 必 交 在 巴 比 伦 王 的 手 中 ， 他 必 用 火 焚 烧 。 [kjv] For I have set my face against this city for evil, and not for good, saith the LORD: it shall be given into the hand of the king of Babylon, and he shall burn it with fire. [bbe] For my face is turned to this town for evil and not for good, says the Lord: it will be given into the hands of the king of Babylon, and he will have it burned with fire. 21:11 [hgb] 至 于 犹 大 王 的 家 ， 你 们 当 听 耶 和 华 的 话 。 [kjv] And touching the house of the king of Judah, say, Hear ye the word of the LORD; [bbe] About the family of the king of Judah. Give ear to the word of the Lord; 21:12 [hgb] 大 卫 家 阿 ， 耶 和 华 如 此 说 ， 你 们 每 早 晨 要 施 行 公 平 ， 拯 救 被 抢 夺 的 脱 离 欺 压 人 的 手 ， 恐 怕 我 的 忿 怒 因 你 们 的 恶 行 发 作 ， 如 火 着 起 ， 甚 至 无 人 能 以 熄 灭 。 [kjv] O house of David, thus saith the LORD; Execute judgment in the morning, and deliver him that is spoiled out of the hand of the oppressor, lest my fury go out like fire, and burn that none can quench it, because of the evil of your doings. [bbe] O family of David, this is what the Lord has said: Do what is right in the morning, and make free from the hands of the cruel one him whose goods have been violently taken away, or my wrath will go out like fire, burning so that no one may put it out, because of the evil of your doings. 21:13 [hgb] 耶 和 华 说 ， 住 山 谷 和 平 原 磐 石 上 的 居 民 ， 你 们 说 ， 谁 能 下 来 攻 击 我 们 。 谁 能 进 入 我 们 的 住 处 呢 ？ 看 哪 ， 我 与 你 们 为 敌 。 [kjv] Behold, I am against thee, O inhabitant of the valley, and rock of the plain, saith the LORD; which say, Who shall come down against us? or who shall enter into our habitations? [bbe] See, I am against you, you who are living on the rock of the valley, says the Lord; you who say, Who will come down against us? or who will get into our houses? 21:14 [hgb] 耶 和 华 又 说 ， 我 必 按 你 们 作 事 的 结 果 刑 罚 你 们 。 我 也 必 使 火 在 耶 路 撒 冷 的 林 中 着 起 ， 将 她 四 围 所 有 的 尽 行 烧 灭 。 [kjv] But I will punish you according to the fruit of your doings, saith the LORD: and I will kindle a fire in the forest thereof, and it shall devour all things round about it. [bbe] I will send punishment on you in keeping with the fruit of your doings, says the Lord: and I will put a fire in her woodlands, burning up everything round about her.","sourceLink":"http://novel.tingroom.com/shuangyu/128/1932.html","bookId":158,"book":{"id":158,"title":"耶利米书 Jeremiah","description":"简介： 1:1 [hgb] 便 雅 悯 地 亚 拿 突 城 的 祭 司 中 ， 希 勒 家 的 儿 子 耶 利 米 的 话 记 在 下 面 。 [kjv] The words of Jeremiah the son of Hilkiah, of the priests that were in Anathoth in the land of Benjamin:","cover":"https://cunovel.com/defaultCover.png","type":"双语小说","link":"http://novel.tingroom.com/shuangyu/128","creation":"Aug 1, 2019 12:18:20 AM","modification":"Aug 1, 2019 12:23:40 AM"}}
