{"id":711,"no":6,"title":"CHAPTER V. ELIZA.","content":"The writer stated in her book that Eliza was a portrait drawn from life. The incident 22which brought the original to her notice may be simply narrated. \\n\\n \\n\\n While the writer was travelling in Kentucky, many years ago, she attended church in a small country town. While there, her attention was called to a beautiful quadroon girl, who sat in one of the slips of the church, and appeared to have charge of some young children. The description of Eliza may suffice for a description of her. When the author returned from church, she inquired about the girl, and was told that she was as good and amiable as she was beautiful; that she was a pious girl, and a member of the church; and, finally, that she was owned by Mr. So-and-so. The idea that this girl was a slave struck a chill to her heart, and she said, earnestly, “O, I hope they treat her kindly.” \\n\\n \\n\\n “O, certainly,” was the reply; “they think as much of her as of their own children.” \\n\\n \\n\\n “I hope they will never sell her,” said a person in the company. \\n\\n \\n\\n “Certainly they will not; a Southern gentleman, not long ago, offered her master a thousand dollars for her: but he told him that she was too good to be his wife, and he certainly should not have her for a mistress.” \\n\\n \\n\\n This is all that the writer knows of that girl. \\n\\n \\n\\n With regard to the incident of Eliza’s crossing the river on the ice,—as the possibility of the thing has been disputed,—the writer gives the following circumstance in confirmation. \\n\\n \\n\\n Last spring, while the author was in New York, a Presbyterian clergyman, of Ohio, came to her, and said, “I understand they dispute that fact about the woman’s crossing the river. Now, I know all about that, for I got the story from the very man that helped her up the bank. I know it is true, for she is now living in Canada.” \\n\\n \\n\\n It has been objected that the representation of the scene in which the plan for kidnapping Eliza, concocted by Haley, Marks and Loker, at the tavern, is a gross caricature on the state of things in Ohio. \\n\\n \\n\\n What knowledge the author has had of the facilities which some justices of the peace, under the old fugitive law of Ohio, were in the habit of giving to kidnapping, may be inferred by comparing the statement in her book with some in her personal knowledge. \\n\\n \\n\\n “Ye see,” said Marks to Haley, stirring his punch as he did so, “ye see, we has justices convenient at all p’ints along shore, that does up any little jobs in our line quite reasonable. Tom, he does the knockin’ down, and that ar; and I come in all dressed up,—shining boots,—everything first chop,—when the swearin’ ‘s to be done. You oughter see me, now!” said Marks, in a glow of professional pride, “how I can tone it off. One day I’m Mr. Twickem, from New Orleans; ‘nother day, I’m just come from my plantation on Pearl river, where I works seven hundred niggers; then, again, I come out a distant relation to Henry Clay, or some old cock in Kentuck. Talents is different, you know. Now, Tom’s a roarer when there’s any thumping or fighting to be done; but at lying he an’t good, Tom an’t; ye see it don’t come natural to him; but, Lord! if thar’s a feller in the country that can swear to anything and everything, and put in all the circumstances and flourishes with a longer face, and carry’t through better’n I can, why, I’d like to see him, that’s all! I b’lieve, my heart, I could get along, and make through, even if justices were more particular than they is. Sometimes I rather wish they was more particular; ‘twould be a heap more relishin’ if they was,—more fun, yer know.” \\n\\n \\n\\n In the year 1839, the writer received into her family, as a servant, a girl from Kentucky. She had been the slave of one of the lowest and most brutal families, with whom she had been brought up, in a log-cabin, in a state of half-barbarism. In proceeding to give her religious instruction, the author heard, for the first time in her life, an inquiry which she had not supposed possible to be made in America:—“Who is Jesus Christ, now, anyhow?” \\n\\n \\n\\n When the author told her the history of the love and life and death of Christ, the girl seemed wholly overcome; tears streamed down her cheeks; and she exclaimed, piteously, “Why didn’t nobody never tell me this before?” \\n\\n \\n\\n “But,” said the writer to her, “haven’t you ever seen the Bible?” \\n\\n \\n\\n “Yes, I have seen missus a-readin’ on’t sometimes; but, law sakes! she’s just a-readin’ on’t ‘cause she could; don’t s’pose it did her no good, no way.” \\n\\n \\n\\n She said she had been to one or two camp-meetings in her life, but “didn’t notice very particular.” \\n\\n \\n\\n At all events, the story certainly made great impression on her, and had such an effect in improving her conduct, that the writer had great hopes of her. \\n\\n \\n\\n On inquiring into her history, it was discovered that, by the laws of Ohio, she was legally entitled to her freedom, from the fact of her having been brought into the state, and left there, temporarily, by the consent of her mistress. These facts being properly authenticated before the proper authorities, papers attesting her freedom were drawn up, and it was now supposed that all danger of pursuit was over. After she had remained in the family for some months, word was sent, from various sources, to Professor Stowe, that the girl’s young master was over, looking for her, and that, if care were not taken, she would be conveyed back into slavery. \\n\\n \\n\\n Professor Stowe called on the magistrate who had authenticated her papers, and inquired whether they were not sufficient to protect her. The reply was, “Certainly they are, in law, if she could have a fair hearing; but they will come to your house in the night, with an officer and a warrant; they will take her before Justice D——, and swear to her. He’s the man that does all this kind of business, and, he’ll deliver her up, and there’ll be an end to it.” \\n\\n \\n\\n Mr. Stowe then inquired what could be done; and was recommended to carry her to some place of security till the inquiry for her was over. Accordingly, that night, a brother of the author, with Professor Stowe, performed for the fugitive that office which the senator is represented as performing for Eliza. They drove about ten miles on a solitary road, crossed the creek at a very dangerous fording, and presented themselves, at midnight, at the house of John Van Zandt, a noble-minded Kentuckian, who had performed the good deed which the author, in her story, ascribes to Van Tromp. \\n\\n \\n\\n After some rapping at the door, the worthy owner of the mansion appeared, candle in hand, as has been narrated. \\n\\n \\n\\n “Are you the man that would save a poor colored girl from kidnappers?” was the first question. \\n\\n \\n\\n “Guess I am,” was the prompt response; “where is she?” \\n\\n \\n\\n “Why, she’s here.” \\n\\n \\n\\n “But how did you come?” \\n\\n \\n\\n “I crossed the creek.” \\n\\n \\n\\n “Why, the Lord helped you!” said he; “I shouldn’t dare cross it myself in the night. A man and his wife, and five children, were drowned there, a little while ago.” \\n\\n \\n\\n The reader may be interested to know that the poor girl never was retaken; that she married well in Cincinnati, is a very respectable woman, and the mother of a large family of children. \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/mingren/1809/52568.html","bookId":26,"book":{"id":26,"title":"Harriet Beecher Stowe","description":"简介： At different times, doubt has been expressed whether the representations of Uncle Toms Cabin are a fair representation of slavery as it at present exists. This work, more, perhaps, than any other work of fiction that ever was written, has been a coll...","cover":"https://cunovel.com/defaultCover.png","type":"Celebrity Biographies","link":"http://novel.tingroom.com/mingren/1809","creation":"Aug 1, 2019 12:18:11 AM","modification":"Aug 1, 2019 12:18:11 AM"}}
