{"id":76470,"no":26,"title":"Page 26","content":"And then he ripped himself from her body and hot jets of s**en splattered onto her behind. Some of it slid inside her still- open entrance, distended from his fierce penetration. The rest spilled onto her back and her ass. Then, as he’d promised, he thrust inside her again, still coming, still pumping his release deep into her body.\n She felt the hot liquid seep from her opening with every thrust. It ran down the insides of her legs in a hot rush. Then he plunged forward to the hilt, pressing hard against her ass as his body quivered over hers.\n He reached around, sliding his fingers over her cl*tonce more. She jerked in response. She was so worked up, so incredibly aroused, that his touch was nearly painful and yet she craved more. Needed more. She needed to come.\n “I’m going to stay inside you until you come,” he said in a strained voice. “I want to feel you fall apart with me deep in your ass.”\n His fingers exerted more pressure, rolling her cl*tin a tight circle. The dual sensation, his c**k in her ass, his fingers caressing her clitoris, it was all too much.\n Her orgasm crashed over her like a giant wave. She lost all awareness. She was lost in the throes of her release. She was covered in his cum, his c**k still deeply embedded in her as she convulsed and squeezed him even tighter.\n He groaned. She cried out. And then both fell forward as much as the ropes restraining her would allow.\n His chest rose and fell sharply, a match to her own as she struggled to gain her breath.\n “You okay?” he asked tenderly as he brushed the hair from her cheek.\n “Mmm-hmm,” she hummed.\n “Give me a minute to get you untied and cleaned up.”\n “Not going anywhere,” she mumbled.\n He chuckled at that. “I suppose not since I have you tied securely to my bed. I like it. I like it a hell of a lot. I could get used to having you at my beck and call at all times.”\n She couldn’t even muster a protest to his joking. She was too undone. Tired. Exhausted. But more sated and content than she’d ever been.\n Moments later he gently untied her, after cleaning the s**en from her skin with a damp cloth. When she was free, he sat her on the edge of the bed and inspected her ankles and wrists for any abrasions. Then he kissed each slightly red spot where the ropes had pressed into her skin and rubbed the feeling back into her feet when she muttered that she couldn’t feel them.\n For that matter she couldn’t feel much of anything. She was too shattered by her experience. She felt numb and out of it, like she’d just come out of a stupor. Perhaps she was still in it.\n When he was finished, he pushed up to his knees and pulled her into his arms so her head was pillowed on his shoulder. He stroked his hand up and down her back as he kissed her hair.\n “Tell me what you’re thinking, Joss,” he said quietly.\n She attempted a smile as she pulled away, but she was too bone weary to pull it off. Instead she reached out to his face, cupping both her hands over his jaw. She caressed his face, letting her fingers wander over his cheekbones.\n “I think that was the most incredible sexual experience of my life. That’s what I think,” she said honestly.\n He smiled, relief evident in his eyes. He leaned forward, resting his forehead against hers. It was an action he often performed. She liked the intimacy of the gesture. Loved that he was openly affectionate. She found it endearing that he liked touching her so often.\n “I meant to make it last much longer,” he said ruefully. “I’m not normally so quick on the draw. But you make me that way, Joss. You make me crazy. I touch you, kiss you, feel you and I have to have you until I’m nearly blind with lust.”\n She smiled at him and leaned that inch between their mouths to kiss him. “We have plenty of time to draw it out longer and make it last. We’re still learning one another. This is all still new.”\n “Bet your sweet, sore ass we do,” he said with a grin. “Heads-up, because I will put you through the paces and make you last a lot longer than we did tonight.”\n “My ass is sore,” she said, wincing as she shifted her weight.\n “Then I’ll have to kiss it and make it all better,” he said in a silky voice.\n He reached forward, scooping her effortlessly into his arms, and then settled her onto the bed, pulling back the covers and then arranging them over her. He kissed her again and then walked around to crawl into bed on his side.\n She went readily into his arms, enjoying the solid warmth of his body. He didn’t tie her tonight. Maybe he’d forgotten or perhaps he was afraid that the rope he’d used earlier had abraded her skin and he was giving her a rest. It didn’t matter. She was as close as she could get to him and he was wrapped around her. It was enough.\n In the middle of the night, Dash was awakened by Joss stirring restlessly. He started to wake her, thinking she was having a bad dream, but before he could, she murmured, “Carson.”\n He went still, the single word freezing his heart. She sounded . . . sad. Like she was missing him. Not what he wanted to hear when he’d just made love to her. When she wore the marks of his dominance and possession.\n She turned away from him, curling into a ball, never waking. Dash lay there, only inches away but seemingly a world apart.\n And while she slept, quiet and peaceful now, Dash lay awake, in brooding silence.\n EIGHTEEN\n DASH was quiet and almost brooding the next morning. His mood had been off ever since they’d gotten out of bed. She’d hesitantly offered to cook him breakfast, but he’d shrugged off her offer and prepared the meal for them both. But he hadn’t fed her as he’d done the last several meals. In fact, they sat across from one another at the small breakfast table situated in the nook off the kitchen.\n She tried to initiate conversation several times, but his answers were short and distant, as though he had something on his mind. She replayed the night before over and over in her head, wondering if she’d done something to displease him. But he’d seemed perfectly content with the way things had played out. She hadn’t backed down from his challenge. She hadn’t used her safe word. She’d seen it out to the very end, regretful when it was over.\n But why was he so distant?\n She puzzled over it all through breakfast and when they were done eating, she took over, taking their plates into the kitchen without asking him. The truth was she wanted to get away for a few moments to ponder the change in his mood.\n She stiffened when he walked into the kitchen behind her, and she turned from the sink where she’d stacked the plates to face him.\n “Did I do something wrong?” she asked bluntly.\n She hated guessing games. She wasn’t someone who could hide her feelings well at all. And Dash would know that something was bothering her, even if it was him that was the problem.\n He blinked in surprise and then his features eased and softened, the strain and tension gathered on his forehead relaxed.\n “No, honey, why would you think that?”\n “Because you haven’t said two words to me all morning,” she said. “I hate to sound nagging or to intrude if it’s none of my business, but it’s driving me crazy and I can’t think of what I could have done to displease you.”\n His face softened even further and he closed the distance between them, gathering her in his arms and leaning her back against the sink.\n “You did nothing to displease me. I was just pensive this morning. Nothing to do with you. Last night was wonderful, as were you, Joss. I’m sorry if I made you feel that you’d done something wrong. You were and are perfect.”\n For the oddest reason, she felt like he wasn’t telling the truth, or at least the whole truth. She’d caught him watching her periodically through the morning as if he was trying to discern her thoughts. He should know by now she was an open book. There was no hiding it when she had something on her mind. It was either there to read in her eyes or she simply came out and addressed it.\n It was one of the things Carson had loved most about her. No coy, passive-aggressive games. No pouting endlessly over some imagined slight. If something upset her, he knew about it. He never had to ask because she was too honest and up front, especially with people she cared about.\n “Are you sure?” she asked quietly. “I’m still learning all of this and I don’t want to mess up, so if I do, you have to tell me, otherwise I’ll never know how to correct the mistake.”\n He kissed her, hugging her tightly against him. “You did nothing wrong, Joss. And if you had, I have every confidence that it would have been done innocently. You’re too honest and straightforward about things. It’s one of the things I most admire about you. There’s no guessing with you because you tend to take the bull by the horns.”\n She relaxed, some of her worry dissipating. “I’m sorry. I know I sound defensive, but this is very important to me. I need you to understand that. This isn’t a game to me. It isn’t me seeking out a relationship with just anyone. I chose you. Surely that has to mean something.”\n “It means everything,” he said softly. “More than you can possibly know. What you don’t understand is that there are any number of men more than willing to give you the things you want. They’d spoil and pamper you endlessly. They’d lay the world at your feet. But I’m damn glad you chose me to be that man, even if I leaned on you pretty heavily.”\n She smiled. “No matter how hard you leaned on me, if I didn’t want to do this with you, I wouldn’t have agreed. Carson taught me a lot about independence and standing on my own two feet. I’ll always be grateful to him for that. He taught me that I could be the person I am and I should never be willing to change who I am to please someone else. He was right. And it’s something I’ve tried to do and be in my everyday life.”\n His features tightened again, his eyes going blank. Did he resent her talking about Carson? Was he defensive about the fact she’d been happily married to another man?\n She understood, she supposed. It couldn’t be all that wonderful to have her previous lovers, never mind there had been only one, thrown in his face at every turn.\n From now on she was going to be more careful about discussing Carson with him. But it was only natural and it would take her time to adjust to the sudden change in their relationship. He’d gone from friend and confidant to her lover in a matter of days. Before, she had no compunction about discussing her relationship with Carson, or even just Carson himself, with a man he’d called best friend. It was nice to be able to talk about Carson with someone who knew him almost as well she knew him. It enabled her to keep his memory alive and talk about the good times they’d always shared together.\n “What are we going to do today?” she asked impulsively. “Have you called Tate, Chessy and Kylie to see if they can make dinner tonight? If so I’ll need to run into the store and pick up things for the meal I’m planning. City Market has steaks that are simply divine. I thought we could grill steaks and I’ll make all the fixings. Baked potatoes, salads, homemade rolls and a really yummy dessert.”\n He lowered his mouth to her, kissing her with tenderness and care that he hadn’t demonstrated this morning until now.\n “I think that sounds wonderful. Let me go make the phone call to Tate. Do you want to call Kylie or would you prefer me to call her and issue the invitation?”\n “I’ll call her,” Joss said quietly. “But I’ll wait and let you explain when she arrives. I planned to tell her to get here at least thirty minutes from the others so you’d have time to discuss Jensen with her.”\n “Sounds like a plan. You make your calls. I’ll make mine. Then I’ll run you to the grocery store to get everything we need.”\n “I’ll need you to take care of the wine,” she said ruefully. “Carson despaired of me ever getting it right.”\n She nearly bit her tongue in frustration. Just moments before she’d sworn that she’d stop bringing up Carson and inserting a wedge between her and Dash. No man would want to be constantly competing with another man, especially a dead man.\n Joss waited for the expected surge of pain that always accompanied her speaking of Carson. But it wasn’t there this time. There was lingering sadness that she dealt with from time to time but mostly it had subsided. For the first time, she could see the grass on the other side of the fence, and it looked appealing from where she stood.\n NINETEEN\n THOUGH hosting a dinner party was nothing new for Joss, she had a raging case of nerves because this was her first dinner acting as Dash’s host. And the attendees were all friends. There was no reason for her to be nervous, but she was. Because though her friends knew of her relationship with Dash, she hadn’t openly flaunted it in front of them.\n She put the finishing touches on the salad and stuck the bowl in the fridge before popping the potatoes in the oven. The steaks were marinating, and Dash would throw them on the grill closer to the time to eat.\n First, they would talk to Kylie, and Dash would tell her that Jensen was partnering with Dash. Joss dreaded the confrontation but knew it was better had here in private, in a place Kylie felt comfortable in, rather than Dash telling her in the office and springing it on her in a place where she couldn’t react honestly.\n The doorbell rang and she hurried out of the kitchen, calling to Dash that she’d get it. She wanted to be the first to greet Kylie.\n When she opened the door, Kylie smiled at her and Joss pulled her into a hug.\n “I’d ask how you’re doing but your look says it all,” Kylie said wryly. “You look . . . happy, Joss. I’m glad.”\n Joss impulsively squeezed her again. “Thanks. How are you doing? I know it’s only been a couple of days, but I feel like I haven’t seen or spoken to you in forever!” \n","sourceLink":"https://allnovel.net/letting-go-surrender-trilogy-1/page-26.html","bookId":1783,"book":{"id":1783,"title":"Letting Go (Surrender Trilogy #1)","description":"Storyline: \n Josslyn found perfection once, and she knows she’ll never find it again. Now widowed, she seeks the one thing her beloved husband couldn’t give her. Dominance. Lonely and searching for an outlet for her grief and wanting only a brief taste of the perfection she once enjoyed, she seeks what she’s looking for at an exclusive club that caters to people indulging in their most hedonistic fantasies. She never imagined that what she’d find is the one man who’s long been a source of comfort—and secret longing. Her husband’s best friend. \n Dash has lived in an untenable position for years. In love with his best friend’s wife and unwilling to act on that attraction. He’d never betray his best friend. And so he’s waited in the wings, offering Joss unconditional support and comfort as she works past her grief, hoping for the day when he can offer her more. \n When he finds her in a club devoted to the darker edges of desire, he’s furious because he thinks she has no idea what she’s getting herself into. Until she explains in detail what it is she wants. What she needs. As realization sets in, he is gripped by fierce, unwavering determination. If she wants dominance, he is the only man who will introduce her to that world. He is the only man who will touch her, cherish her…love her. And the only man she’ll ever submit to.\n \n","cover":"https://allnovel.net/images/letting-go-surrender-trilogy-1.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/letting-go-surrender-trilogy-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:38:15 AM"}}
