{"id":76453,"no":9,"title":"Page 9","content":"“Yes, that’s understandable,” Dash said quietly. “But you don’t fear that from me, do you, Joss?” The shock in her eyes filled him with fierce satisfaction. “No, Dash! Never!” He kissed her again before pushing her upward from the couch. “Go and make your calls before the police get involved. If I know Chessy, she was absolutely serious about calling the police. It wouldn’t surprise me if she hasn’t hauled Tate over to your house already. You call the girls. I’ll call Tate and let him know you’re okay.” SEVEN JOSS leaned back on her couch with a deep sigh and flopped her head backward to stare up at the ceiling. She felt emotionally wrung out, and for the first time she couldn’t blame it on Carson’s death or the anniversary of it. It was a different kind of turmoil, one she’d never imagined when she’d bravely—or rather thought she was bravely—taking control of her future. Now that future was one huge question mark. She sighed again and closed her eyes, weariness assailing her. She would have drifted off, despite the chaos her mind was in, if the doorbell hadn’t rung. And rung again. Insistently. She knew without confirming that it was likely Chessy or Kylie or even both. They wouldn’t have been put off by Joss’s phone call simply telling them she’d backed out. They’d want to hear the entire story themselves. With a resigned groan, she pushed herself up from the couch and shuffled toward the door. Dash had dropped her off barely half an hour earlier after all the necessary phone calls had been made. He’d kissed her. She shivered as she remembered the raw desire she’d seen in his eyes. Felt the heat of his kiss. Remembered his fingertips sliding down her face to her neck as he’d said good-bye and that he’d see her soon. The promise in his voice had given her much to think about. Now that she was back on her own turf, so to speak, she had a lot to contemplate and process. As soon as she opened the door she wanted to groan again. Chessy and Kylie both stood staring back at her. Chessy’s gaze was sharp and discerning, looking over Joss as if she could peel back the layers of Joss’s thoughts. Kylie looked more uncertain—and worried. Chessy pushed by her, Kylie following behind in her wake. “Okay, spill it, girlfriend. We don’t buy that bullshit you said about simply deciding to opt out of The House and spending the evening with Dash instead.” Joss followed Chessy and Kylie into her living room and flopped back on the couch she’d just vacated. “And don’t think you’re going to leave a single detail out,” Chessy continued. “I’ll sic Tate on Dash if I have to. One way or another, I’ll get the dirt, so you may as well cough it up now.” “Are you all right?” Kylie asked anxiously. “Did something happen last night, Joss? Did someone hurt you or frighten you?” Joss smiled ruefully. What to say to those questions? Yes, no and yes? “I’m fine,” she reassured. “Honestly. It’s complicated.” Chessy’s lips tightened and she got that “aha” look on her face that suggested she’d known something was up. “What happened then?” Kylie asked. “What really happened, Joss?” Chessy pushed. “I saw you yesterday. I heard you. And whether you had any apprehensiveness, I know you, and you were bound and determined to go to The House and see it through. And then I get a phone call saying oh never mind, I didn’t go and I’m at home?” She snorted in disbelief. “I went,” Joss hedged. Kylie’s forehead furrowed. “But you said you didn’t.” “I didn’t say I didn’t go,” Joss corrected. “I merely said I changed my mind.” “And?” Chessy asked quietly. “What happened, Joss?” Joss sighed. “Dash happened.” Chessy’s mouth rounded into an O about the time realization sparked in her eyes. “Oh shit. Dash was there, wasn’t he? Oh my God, did he freak?” Kylie looked absolutely confused as she jerked her head back and forth between Joss and Chessy, trying to keep up with what was going on. Before Joss could answer, Chessy pushed forward. “I’m so sorry, Joss. I should have warned you, but shit. Dash is hardly in there. I mean I know he’s a member, but it didn’t even occur to me to tell you that, because what were the odds that he’d show up on the night you went?” Kylie shook her head in bewilderment. “Dash—our Dash—goes to The House? Why?” Joss’s cheeks warmed and she and Chessy exchanged looks of understanding. “He’s a Dominant,” Chessy said gently. “Like Tate.” Kylie went silent, processing the revelation. Tension vibrated from her, and it made Joss uneasy for what she’d have to tell both her friends. But especially Kylie. Kylie was . . . Well, she was very black-and-white. Her worldview was very narrow and she didn’t often venture outside the parameters she’d set. She had good reason to be as she was, but it didn’t always make things easy. Kylie was rigid, and this would likely throw her for a loop. “He was there when I walked in with another man,” Joss said in a low voice. “It didn’t go well.” Chessy winced. “I don’t imagine it did.” “He hauled me out and took me back to his house intending to lecture me after he scraped an inch of skin off my hide. He didn’t think I had any clue what I was getting into.” “And did you inform him differently?” Chessy asked. Joss nodded. “That’s when it got . . . interesting.” Kylie’s perplexed look deepened and Chessy’s eyes widened. Both of her friends sat forward, picking up on Joss’s tone. Joss sucked in her breath, knowing her friends would know sooner or later and she’d rather it come from her. “Dash said . . .” She struggled with just how to put it. This was much harder than she imagined because she still hadn’t come to terms with it herself! “What did he say?” Chessy prompted. “He said that if that was what I wanted—what I needed—then he was going to be the only man who gave those things to me.” “Whoa,” Chessy breathed. Kylie’s reaction was a bit more explosive. “What? I don’t understand. He what?” “He wants me,” Joss said in a low voice. “Has wanted me a long time. I didn’t know. I feel so stupid, but I had no idea!” “Wow,” Chessy said. “I mean I used to think, a long time ago, the way he looked at you sometimes . . . I thought there was something there. But then you and Carson were so happy and Dash remained friends with you both, and Dash never made a move after Carson died, so I thought I imagined it.” Kylie’s face flushed with anger. “He had a thing for you when you were married to my brother?” “It’s not like he ever acted on it,” Chessy gently chided. “You can’t control who you’re attracted to.” “Carson knew,” Joss murmured. “Dash told me that Carson knew and that it didn’t affect their friendship.” “I would certainly prefer him to some stranger you pick up at The House,” Kylie said, an edge still to her voice. “But I’m worried about this. You and him. I never imagined Dash to be that kind of person. I worry that he could hurt you physically and emotionally, and I worry about the strain it might put on all our friendships.” Chessy’s features tightened. “That kind of person? What’s that supposed to mean? Tate’s that kind of person, Kylie, and he’d never hurt me.” “You know I didn’t mean it like that,” Kylie said wearily. “I’m worried about Joss, okay? It seems like lately she’s making a lot of impulsive decisions, and I don’t want her to get hurt. And I worry about this thing with Dash. I’m not sure how I feel about the fact he was attracted to his best friend’s wife.” Impatience and frustration warred with Joss. “I’ve considered all of those things,” she snapped out. “I’ve taken into account how it would affect our circle of friends, especially if it didn’t work out.” She sucked in a breath before continuing. “I’ve never looked at Dash as anything but a friend until now, and I’m not sure how I feel about that. I hate feeling like I’m betraying my dead husband for even considering this. I would have never been unfaithful to Carson, even if I’d known that Dash had feelings for me. And I don’t like you questioning his integrity because he had feelings for me that he never acted on until now.” Kylie grimaced and looked away. Chessy leaned farther forward, taking Joss’s hand in hers. “Yes, it could change things,” Chessy said in a calm voice. “But you can’t live your life without taking risks. If this is something you want to go for, you at least need to try. It’s worse to live with the what-ifs than it is to take the plunge and fail. You have nothing to lose and everything to gain.” “I have everything to lose,” Joss said in a raw voice. “I lost Carson and it would devastate me to ever lose Dash’s friendship. It would devastate me to lose yours or Kylie’s. I don’t want to lose anyone else I love.” Chessy’s face filled with love and understanding. It made Joss’s eyes go watery, and damn it, enough with the tears. It was time to move beyond all that. To stop being such an emotionally fragile person. “Sweetie, life is all about risk and there are no guarantees, as you well know,” Chessy said gently. “Let me ask you something. If you knew back when you and Carson got married that you’d only have a few short years with him, if you knew he’d die, would you have done anything differently? Would you have walked away from him then to spare yourself the pain of losing him later?” The question shook Joss to her core. Without even thinking about it, her response was immediate. “No, of course I wouldn’t have walked away! I’d do it all over again, and I wouldn’t change a thing, even knowing I’d lose him. Because what time we did have together was wonderful. I wouldn’t trade it for anything in the world,” she said painfully. “Then why aren’t you willing to take a chance with Dash?” Chessy asked. “What if it works out? What if he makes you happy? What if he gives you what you want and need? What if you find love again? What if you have one wonderful year with him, and he gives you what you need and then you split up? Wouldn’t you rather have that year and not live with regret over not ever giving it a chance? You can’t stop taking risks just because you lost someone already. It’s no way to live, in fear of living in case of pain.” “She has a point,” Kylie said grudgingly. “And I do want you to be happy, Joss. Even if it’s not with Carson. I’ll support you no matter what happens with Dash. As you told me, we’re sisters, and we’re best friends.” “Thank you,” Joss said sincerely. “Thank you both. I don’t know what I’d do without such wonderful friends—sisters. You’ve both given me a lot to think about. And I do have to give this careful consideration.” Chessy squeezed her hand. “We’ll leave you to it then. Just know that I’m only a phone call away. And I also want you to know, that no matter what, I love you. Tate and I both love you. And he’ll personally kick Dash’s ass if he ever hurts you.” Joss smiled, but sadness tugged at her heart. She didn’t want to cause a rift between her friends. She didn’t want Tate to ever become angry with Dash over her. Kylie rose and then leaned down to hug Joss fiercely. Joss returned the hug and then pushed herself up to go walk her friends out. “Keep in touch, hon, okay?” Chessy said. “And if you ever need to talk, just pick up the phone. Night or day. It doesn’t matter.” “I will,” Joss said truthfully. “And thank you both again for caring about me. I’m not going to do anything to cause anyone hurt. I hope you both know that.” “We do,” Kylie assured. “And I’m sorry if I hurt you with the things I said. I do love you, Joss. And I do want you to be happy. I know that Carson would want you to be happy. It takes a pretty special guy to remain friends with a man who had feelings for his wife. If Carson could and did live with that, then so can I.” Joss hugged them both and then watched as they walked down the paved sidewalk to where they were parked out front. She stood there as they drove away and then she went back inside to get her purse and her keys. It was automatic to get in her car and drive toward the cemetery. She wasn’t even aware of what she was doing until she neared the gates leading inside. She braked and came to a stop at the entryway, staring ahead at all the headstones that dotted the landscape. She’d been coming to talk to Carson. To explain about Dash and ask Carson’s blessing. When she’d sworn she was moving on, letting go, and wouldn’t return here. Not again. With a shake of her head, she backed up enough to execute a U-turn and then drove away, aiming her car in the direction of Dash’s subdivision. EIGHT HE shouldn’t have brought her home. He shouldn’t have left her alone after dropping such a bomb on her. He should have kept her here with him, within touching distance. Not given her time and space for her to change her mind or talk herself out of what he knew she was agreeing to.","sourceLink":"https://allnovel.net/letting-go-surrender-trilogy-1/page-9.html","bookId":1783,"book":{"id":1783,"title":"Letting Go (Surrender Trilogy #1)","description":"Storyline: Josslyn found perfection once, and she knows she’ll never find it again. Now widowed, she seeks the one thing her beloved husband couldn’t give her. Dominance. Lonely and searching for an outlet for her grief and wanting only a brief taste of the perfection she once enjoyed, she seeks what she’s looking for at an exclusive club that caters to people indulging in their most hedonistic fantasies. She never imagined that what she’d find is the one man who’s long been a source of comfort—and secret longing. Her husband’s best friend. Dash has lived in an untenable position for years. In love with his best friend’s wife and unwilling to act on that attraction. He’d never betray his best friend. And so he’s waited in the wings, offering Joss unconditional support and comfort as she works past her grief, hoping for the day when he can offer her more. When he finds her in a club devoted to the darker edges of desire, he’s furious because he thinks she has no idea what she’s getting herself into. Until she explains in detail what it is she wants. What she needs. As realization sets in, he is gripped by fierce, unwavering determination. If she wants dominance, he is the only man who will introduce her to that world. He is the only man who will touch her, cherish her…love her. And the only man she’ll ever submit to.","cover":"https://allnovel.net/images/letting-go-surrender-trilogy-1.jpg","author":"Maya banks","type":"Romance","source":"allnovel","link":"https://allnovel.net/letting-go-surrender-trilogy-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 10:38:15 AM"}}
