{"id":78228,"no":43,"title":"Page 43","content":"Rohan kept his hand relaxed, but she felt the power of it, bone and muscle flexing subtly beneath sun-glazed skin. His fingers were well tended, the nails scrupulously clean and pared neatly to the quick. Gypsies were fastidious, even ritualistic in their washing. The family had long been amused by Merripen’s views on what constituted proper cleanliness, his preference to wash in flowing water rather than soak in a bath. \"You have an even deeper marriage line than I do,\" Amelia said. He responded with a single nod, his gaze not moving from her face. \"And you’ll have three children as well?or is it four?\" She touched a nearly imperceptible line etched near the side of his hand. \"Only three. The one on the side means I’ll have a very short betrothal.\" \"You’ll likely be prodded to the altar by the end of some outraged father’s rifle.\" He grinned. \"Only if I kidnap my fiancée from her bedroom.\" She studied him. \"I find it difficult to imagine you as a husband. You seem too solitary.\" \"Not at all. I’ll take my wife everywhere with me.\" His fingers caught playfully at her thumb, as if he’d caught a wisp of dandelion thistle. \"We’ll travel in a vardo from one side of the world to the other. I’ll put gold rings on her fingers and toes, and bracelets on her ankles. At night I’ll wash her hair and comb it dry by the firelight. And I’ll kiss her awake every morning.\" Amelia averted her gaze from him, her cheeks turning blood-hot and sensitive. She moved away, needing to walk, anything to break the flushing intimacy of the moment. He fell into step beside her as they crossed the village green. \"Mr. Rohan?why did you leave your tribe?\" \"I’ve never been quite certain.\" She glanced at him in surprise. \"I was ten years old,\" he said. \"For as long as I could remember, I traveled in my grandparents\u0027 vardo. I never knew my parents—my mother died in childbirth, and my father was an Irish gadjo. His family rejected his marriage and convinced him to abandon my mother. I don\u0027t think he ever knew she\u0027d had a child.\" \"Did anyone try to tell him?\" \"I don\u0027t know. They may have decided it wouldn\u0027t have changed anything. According to my grandparents, he was a young man\"—he flashed a brief, mischievous smile in her direction?and immature even for a gadjo. One day my grandmother dressed me in a new shirt she had made, and told me I had to leave the tribe. She said I was in danger and could no longer live with them.\" \"What kind of danger? From what source?\" \"She wouldn\u0027t say. An older cousin of mine—his name was Noah—took me to London and helped me find a situation and a job. He promised to come back for me someday and tell me when it was safe to go home.\" \"And in the meantime you worked at the gaming club?\" \"Yes, old Jenner hired me as a listmaker\u0027s runner.\" Rohan\u0027s expression softened with reminiscent fondness. \"In many ways he was like a father to me. Of course, he was quick-tempered and a bit too ready with his fists. But he was a good man. He looked out for me.\" \"It couldn\u0027t have been easy for you,\" Amelia said, feeling compassion for the boy he had been, abandoned by his family and obliged to make his own way in the world. \"I wonder that you didn\u0027t try to run back to your tribe.\" \"I had promised I wouldn\u0027t.\" Seeing a leaf fluttering down from an overhead tree branch, Rohan reached upward, the clever fingers plucking it from the air as if by sleight of hand. He brought the leaf to his nose, inhaling its sweetness, and gave it to her. \"I stayed at the club for years,\" he said in a matter-of-fact tone. \"Waiting for Noah to come back for me.\" Amelia chafed the crisply pliant skin of the leaf between the pads of her fingers. \"But he never did.\" Rohan shook his head. \"Then Jenner died, and his daughter and son-in-law took possession of the club.\" \"You\u0027ve been treated well in their employ?\" \"Too well.\" A frown swept across his forehead. \u0027They started my good-luck curse.\" \"Yes, I\u0027ve heard about that.\" She smiled at him. \"But since I don\u0027t believe in luck or curses, I\u0027m skeptical.\" \"It\u0027s enough to ruin a Gypsy. No matter what I do, money comes to me.\" \"How dreadful. That must be very trying for you.\" \"It\u0027s damned embarrassing,\" he muttered with a sincerity she couldn\u0027t doubt. Half amused, half envious, Amelia asked, \"Had you ever experienced this problem before?\" Rohan shook his head. \"But I should have seen it coming. It\u0027s fate.\" Stopping with her, he showed her his palm, where a cluster of star-shaped intersections glimmered at the base of his forefinger. \"Financial prosperity,\" came his glum explanation. \"And it won\u0027t end any time soon.\" \"You could give your money away. There are countless charities, and many people in need.\" \"I intend to. Soon.\" Taking her elbow, he guided her carefully around an uneven patch of ground. \"The day after tomorrow, I\u0027m returning to London to find a replacement factotum at the club.\" \"And then what will you do?\" \"Live as a true Roma. I\u0027ll find some tribe to travel with. No more account books or salad forks or shoe polish. I\u0027ll be free.\" He seemed convinced that he would be satisfied with a simple life—but Amelia had her doubts. The problem was, there was no middle ground. One could not be a wanderer and a domesticated gentleman at the same time. A choice had to be made. It made her thankful that no duality existed in her own nature. She knew exactly who and what she was.","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-43.html","bookId":1788,"book":{"id":1788,"title":"Mine Till Midnight (The Hathaways #1)","description":"Storyline: When an unexpected inheritance elevates her family to the ranks of the aristocracy, Amelia Hathaway discovers that tending to her younger sisters and wayward brother was easy compared to navigating the intricacies of the ton. Even more challenging: the attraction she feels for the tall, dark, and dangerously handsome Cam Rohan. Wealthy beyond most men’s dreams, Cam has tired of society’s petty restrictions and longs to return to his “uncivilized” Gypsy roots. When the delectable Amelia appeals to him for help, he intends to offer only friendship—but intentions are no match for the desire that blindsides them both. But can a man who spurns tradition be tempted into that most time-honored arrangement: marriage? Life in London society is about to get a whole lot hotter...","cover":"https://allnovel.net/images/mine-till-midnight-the-hathaways-1.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/mine-till-midnight-the-hathaways-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:41:07 PM"}}
