{"id":78229,"no":44,"title":"Page 44","content":"Rohan brought her to a stall set up by the village wine shop, and bought two cups of plum wine. She drank the tart, slightly sweet vintage in thirsty gulps, making Rohan laugh quietly. \"Not so fast,\" he cautioned. \"This stuff is stronger than you realize. Any more and I\u0027ll have to haul you home over my shoulders like a felled deer.\" \"It\u0027s not that strong,\" Amelia protested, unable to taste any alcohol in the fruit-heavy wine. It was delicious, the dry plummy richness lingering on her tongue. She held out her cup to the wine-seller. \"I\u0027ll take another.\" Although proper women didn\u0027t ordinarily eat or drink in public, the rules were often cast aside at rural fairs and festivals, where gentry and commoners rubbed elbows and ignored the conventions. Looking amused, Rohan finished his own wine, and waited patiently as she drank more. \"I found a beekeeper for you,\" he said. \"I described your problem to him. He said he would go to Ramsay House tomorrow, or perhaps the next day. One way or another, you\u0027ll be rid of the bees.\" \"Thank you,\" Amelia said fervently. \"I am indebted to you, Mr. Rohan. Will it take long for him to remove the hive?\" \"There\u0027s no way of knowing until he sees it. With the house having gone unoccupied for so long, the colony could be quite large. He said he\u0027d once encountered a hive in an abandoned cottage that harbored half a million bees, by his estimate.\" Her eyes turned enormous. \"Half a million? \"I doubt yours is that bad,\" Rohan said. \"But it\u0027s almost certain part of the wall will have to be removed after the bees are gone.\" More expense. More repairs. Amelia\u0027s shoulders slumped at the thought. She spoke without thinking. \"Had I known Ramsay House was in such terrible condition, I wouldn\u0027t have moved the family to Hampshire. I shouldn\u0027t have taken the solicitor\u0027s word that the house was habitable. But I was in such a hurry to remove Leo from London—and I wanted so much for all of us to make a new start? \"You\u0027re not responsible for everything. Your brother is an adult. So are Winnifred and Poppy. They agreed with your decision, didn\u0027t they?\" \"Yes, but Leo wasn\u0027t in his right mind. He still isn\u0027t. And Win is frail, and? \"You like to blame yourself, don\u0027t you? Come walk with me.\" She set her empty wine cup at the corner of the stall, feeling light-headed. The second cup of wine had been a mistake. And going anywhere with Rohan, with night deepening and revelry all around them, would be yet another. But as she looked into his hazel eyes, she felt absurdly reckless. Just a few stolen minutes... she couldn\u0027t resist the lawless mischief of his smile. \"My family will worry if I don\u0027t rejoin them soon.\" \"They know you\u0027re with me.\" \"That\u0027s why they\u0027ll worry,\" she said, making him laugh. They paused at a table bearing a collection of magic lanterns, small embossed tin lamps with condensing lenses at the front. There was a slot for a hand-painted glass slide just behind the lens. When the lamp was lit, an image would be projected on a wall. Rohan insisted on buying one for Amelia, along with a packet of slides. \"But it\u0027s a child\u0027s toy,\" she protested, holding the lantern by its wire handle. \"What am I to do with it?\" \"Indulge in pointless entertainment. Play. You should try it sometime.\" \"Playing is for children, not adults.\" \"Oh, Miss Hathaway,\" he murmured, leading her away from the table. \"The best kind of playing is for adults.\" They hemmed the edge of the crowd, weaving in and out like an embroiderer\u0027s needle, until finally they drifted free of the torchlight and movement and music, and reached the dark, luminous quiet of a beech grove. \"Are you going to tell me why you had that silver seal from Westcliff\u0027s study?\" he asked. \"I would rather not, if you don\u0027t mind.\" \"Because you\u0027re trying to protect Beatrix?\" Her startled glance cut through the shadows. \"How did you ... that is, why did you mention my sister?\" \"The night of the supper party, Beatrix had the time and opportunity. The question is, why did she want it?\" \"Beatrix is a good girl,\" Amelia said quickly. \"A wonderful girl. She would never deliberately do anything wrong, and—you didn\u0027t tell anyone about the seal, did you?\" \"Of course not.\" His hand touched the side of her face. \"Easy, hummingbird. I wouldn\u0027t betray your secrets. I\u0027m your friend. I think...\" A brief, electrifying pause. \"In another lifetime, we would be more than friends.\" Her heart turned in a painful revolution behind her ribs. \"There\u0027s no such thing as another lifetime. There can\u0027t be.\" \"Why not?\" \"Occam\u0027s razor.\" He was silent as if her answer had surprised him, and then a wondering laugh slipped from his throat. \u0027The medieval scientific principle?\" \"Yes. When formulating a theory, eliminate as few assumptions as possible. In other words, the simplest explanation is the most likely.\" \"And that\u0027s why you don\u0027t believe in magic or fate or reincarnation? Because they\u0027re too complicated, theoretically speaking?\" \"Yes.\" \"How did you learn about Occam\u0027s razor?\" \"My father was a medieval scholar.\" She shivered as she felt his hand glide along the side of her neck. \"Sometimes we studied together.\" Rohan pried the wire handle of the magic lantern from her shaky grip, and set it near their feet. \"Did he also teach you that the complicated explanations are sometimes more accurate than the simple ones?\"","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-44.html","bookId":1788,"book":{"id":1788,"title":"Mine Till Midnight (The Hathaways #1)","description":"Storyline: When an unexpected inheritance elevates her family to the ranks of the aristocracy, Amelia Hathaway discovers that tending to her younger sisters and wayward brother was easy compared to navigating the intricacies of the ton. Even more challenging: the attraction she feels for the tall, dark, and dangerously handsome Cam Rohan. Wealthy beyond most men’s dreams, Cam has tired of society’s petty restrictions and longs to return to his “uncivilized” Gypsy roots. When the delectable Amelia appeals to him for help, he intends to offer only friendship—but intentions are no match for the desire that blindsides them both. But can a man who spurns tradition be tempted into that most time-honored arrangement: marriage? Life in London society is about to get a whole lot hotter...","cover":"https://allnovel.net/images/mine-till-midnight-the-hathaways-1.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/mine-till-midnight-the-hathaways-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:41:07 PM"}}
