{"id":78250,"no":66,"title":"Page 66","content":"Merripen\u0027s scorching black stare flickered to the Hathaway sisters, lingering an extra second on Win\u0027s pale, delicate face. She gave him an infinitesimal shake of her head, silently willing him to relent. To reconsider.\\n\\n \"Merripen? Amelia began scratchily. The scene was mortifying. But at the same time it moved her that Merripen was so protective of her honor.\\n\\n Cam silenced her with a touch on the shoulder. He leveled a cool stare at Merripen and said, \"Not in front of the gadjos.\" Jerking his head in the direction of the back gardens, he headed to the stone staircase.\\n\\n After a brooding hesitation, Merripen followed.\\n\\n Chapter Seventeen\\n\\n When the pair was out of sight, Lord Westcliff spoke to St. Vincent. \"Perhaps we should follow at a distance to prevent them from killing each other.\"\\n\\n St. Vincent shook his head, relaxing in his chair. He reached for his Evie\u0027s hand and began to play with her fingers. \"Believe me, Rohan has the situation well in hand. His opponent may be a bit larger, but Rohan has the considerable advantage of having grown up in London, where he\u0027s interacted with criminals and remarkably violent brutes.\" Smiling at his wife, he added, \"And those are just our employees.\"\\n\\n Amelia had no fears for Cam\u0027s sake. A fight between the two men would be like wielding a cudgel against a rapier... the rapier, with its superior grace and adroitness, would win. But that outcome brought its own perils. With the possible exception of Leo, the Hathaways were intensely fond of Merripen. The girls wouldn\u0027t find it easy to forgive someone who had harmed him. Especially Win.\\n\\n Glancing at her sister, Amelia began to say something consoling, when she realized that Win\u0027s expression was not one of fear or helplessness.\\n\\n Win was annoyed.\\n\\n \"Merripen has been injured,\" Win said. \"He should be resting, not chasing about after Mr. Rohan.\"\\n\\n \"It\u0027s not my fault he got out of his sickbed!\" Amelia protested in an indignant whisper.\\n\\n Win\u0027s blue eyes narrowed. \"You\u0027ve done something to stir everyone up. And it\u0027s fairly obvious that whatever you did, Mr. Rohan was involved.\"\\n\\n Poppy, who was listening avidly, couldn\u0027t resist adding, \"Intimately involved.\"\\n\\n The two older sisters glanced at her and said in unison,\\n\\n \"Shut up, Poppy.\"\\n\\n Poppy frowned. \"I\u0027ve been waiting my entire life for Amelia to stray from the straight and narrow. Now that it\u0027s happened, I\u0027m going to enjoy it.\"\\n\\n \"I\u0027d enjoy it, too,\" Beatrix said plaintively, \"if I only knew what we\u0027re talking about.\"\\n\\n Cam led the way along the yew hedge, going away from the manor until they reached a sunken lane stretching toward the wood. They stopped beside a thicket of Saint-John\u0027s-wort, its golden flowers in full bloom, and sedge spiked with bottlebrush stems in leaf. Deceptively relaxed, Cam folded his arms loosely across his chest. He was puzzled by the large, irate chal, a Roma with the air of a loner. The mysterious Merripen had no affiliation with a Gypsy tribe, but had instead chosen to make himself the watchdog of a gadje family. Why? What did he owe to them?\\n\\n Perhaps Merripen was mahrime, designated by the Rom as one unworthy of trust. An outcast. If so, Cam wondered what Merripen had done to deserve such status.\\n\\n \"You took advantage of Amelia,\" Merripen said.\\n\\n \"Not that it matters,\" Cam said in Romany, \"but how did you find out?\"\\n\\n Merripen\u0027s huge hands flexed as if longing to rip him apart. Lucifer himself could not have had blacker, more burning eyes. \"Speak in English,\" he said harshly. \"I don\u0027t like the old language.\"\\n\\n Frowning in curiosity, Cam readily complied.\\n\\n \"The maids were talking about it,\" Merripen replied. \"I heard them standing outside my door. You dishonored one of my family.\"\\n\\n \"Yes, I know,\" Cam said quietly.\\n\\n \"You\u0027re not good enough for her.\"\\n\\n \"I know that, too.\" Watching, him intently, Cam asked, \"Do you want her for yourself, chal?\"\\n\\n Merripen looked mortally offended. \"She\u0027s a sister to me.\"\\n\\n \"That\u0027s good. Because I want her for my wife. And as far as I can see\"—Cam gestured wide with his hands?\"there aren\u0027t exactly queues forming to help the Hathaways. So I may be able to help the family.\"\\n\\n \"They don\u0027t need your money. Ramsay has an annuity.\"\\n\\n \"Ramsay will be dead soon. We both know it. And after he turns up his toes, the title will go to the next poor bastard in line, and there\u0027ll be four unmarried Hathaway sisters with few practical skills to speak of. What do you think will become of them? What about the invalid? She\u0027ll need medical care?\\n\\n \"She\u0027s not an invalid!\" Merripen made his face expressionless, but not before Cam had seen a flash of extraordinary emotion, something ferocious and tormented.\\n\\n Apparently, Cam thought, not all of the Hathaways were like sisters to Merripen. Perhaps this was the key to him. Perhaps Merripen harbored a secret passion for a woman who was too innocent to realize it, and too frail ever to marry.\\n\\n \"Merripen,\" Cam said slowly, \"you\u0027re going to have to find a way to tolerate me. Because there are things I can do for Amelia, and the rest of them, that you can\u0027t.\" He continued in a level tone despite the look on Merripen\u0027s face, which would have terrified a lesser man. \"And I don\u0027t have the patience to battle you every step of the way. If you want what\u0027s best for them, either leave, or accept this. I\u0027m not going anywhere.\"\\n\\n As the huge chal glared at him, Cam could almost see the progression of his thoughts, the weighing of options, the violent desire to mow down his enemy, all of it overshadowed by the urge to do what was right for his family. \\n\\n","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-66.html","bookId":1788,"book":{"id":1788,"title":"Mine Till Midnight (The Hathaways #1)","description":"Storyline: When an unexpected inheritance elevates her family to the ranks of the aristocracy, Amelia Hathaway discovers that tending to her younger sisters and wayward brother was easy compared to navigating the intricacies of the ton. Even more challenging: the attraction she feels for the tall, dark, and dangerously handsome Cam Rohan. \\n Wealthy beyond most men’s dreams, Cam has tired of society’s petty restrictions and longs to return to his “uncivilized” Gypsy roots. When the delectable Amelia appeals to him for help, he intends to offer only friendship—but intentions are no match for the desire that blindsides them both. But can a man who spurns tradition be tempted into that most time-honored arrangement: marriage? Life in London society is about to get a whole lot hotter...\\n","cover":"https://allnovel.net/images/mine-till-midnight-the-hathaways-1.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/mine-till-midnight-the-hathaways-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:41:07 PM"}}
