{"id":78271,"no":87,"title":"Page 87","content":"\"I\u0027ve given up having opinions,\" Leo said. \"Hardly anyone agrees with them, and if someone does, it\u0027s proof he has no judgment whatsoever.\" But somehow, by some verbal equivalent of a sleight-of-hand trick, Cam managed to get Leo to accompany them to Ramsay House. Later in the day Cam described it to Amelia in private, the way Leo had mumbled and sulked for most of the visit while Mr. Dashiell had made notes and sketches. But there had been moments when Leo had seemed unable to resist commenting on his abhorrence of baroque trimmings and flourishes, and how the house should be designed with symmetry and proportion. \"Did you mention to Mr. Dashiell that Mr. Frost is currently staying in Hampshire?\" Amelia asked. They walked slowly along a path that led into the wood, the sky blushing with the advent of evening. A brisk wind sent leaves skipping and whispering over the ground. Cam adjusted his stride to match Amelia\u0027s shorter one. Drawing off one of her gloves, he deposited it in his pocket and kept her bare hand in his. \"No,\" he replied, \"I didn\u0027t mention him. Why would I?\" \"Well, Mr. Frost is a very accomplished architect, and as a friend of the family, he has offered to give us the benefit of his expertise? \"He\u0027s not a friend of the family,\" Cam said shortly. \"And we don\u0027t need his expertise. There\u0027s no way in hell he\u0027s going to have anything to do with Ramsay House.\" \"He wishes to make amends. He was very kind in offering his services, if we should need? \"When?\" Disconcerted by his tone, the word fast and sharp as a rifle shot, Amelia blinked. \"When what?\" Cam stopped and turned her to face him, his face hard. \"When did he offer his bloody services?\" \"He came to visit while you were gone.\" Having never seen a display of temper from him before, Amelia pushed uneasily at his hands, which were gripping her shoulders a shade too tightly. \"All he wanted,\" she continued, \"was to offer help.\" \"If you believe that was all he wanted, you\u0027re more naive than I thought.\" \"I am not naive,\" she said indignantly. \"And there\u0027s no reason to be jealous. Nothing improper was said or done.\" His eyes held dangerous heat. \"Were you alone in the room with him?\" Amelia was amazed by his intensity. No man had ever regarded her with such possessive fury. She wasn\u0027t certain whether she was flattered, annoyed, or alarmed. Or perhaps all three. \"Yes, we were alone,\" she said, \"with the door open. All very conventional.\" \"For gadjos, perhaps. But not for Romas.\" He lifted her until her weight was balanced precariously on her toes. \"You are never to be alone with him, or any man, except your brother or Merripen. Unless I give my permission.\" Amelia\u0027s mouth fell open. \"Permission?\" \"Never,\" he repeated grimly. Her own temper flared, but she managed to keep her voice even. \"You see, this is why I\u0027m not going to marry you. I will not be dictated to. I will not? Cam lowered his head and silenced her with his mouth, clenching his hand in her hair as she tried to turn her face away. She felt him press her lips open, delving inside, and her will to resist was undermined by a shock of pleasure. Since she had no hope of freeing herself, she tried to remain cold and still beneath the passionate assault. Feeling her lack of response, he lifted his head and glared at her. Amelia glared back at him. \"It\u0027s not your house, and I\u0027m not your? He kissed her again, taking her head in his hands, concentrating on her mouth until she was pulsing everywhere. She moaned and went weak against him. Muttering in Romany, he pulled her to the trunk of the largest beech, its smooth gray bark knobbed and time-scarred. The branches had been weighted by their own mass until they touched the earth and reached upward again, as if the tree were a lazy giant resting on ancient elbows. Untying Amelia\u0027s bonnet ribbons, Cam tossed the garment to the ground. His mouth covered hers, his tongue stabbing inside her in rough, delicious strokes. He pushed her against the trunk where a huge branch diverged in a bulky joist, and dug his knee into her skirts to keep her there. Beechnut husks crackled beneath their feet with each shift of their weight. With every kiss, Cam found a new angle, a deeper taste, making love to her mouth with blatant sensuality. The pale gold leaves blurred overhead. \"Cam, no,\" Amelia whispered as his lips traveled down to her throat. Ignoring her, he unfastened the front of her bodice and untied it with a roughness that made her gasp. He bent to a cool, tight nipple, heating it with his mouth, biting tenderly at the tip. \"Not here,\" she managed. Cam kissed his way up the taut column of her neck. \"Here,\" he said thickly. \"Where we are no different than any wild creature in the wood.\" Taking her hand, he pulled it to the straining hardness of his sex. Her eyes half closed as she felt the hardness and heat of him even through the fabric of his trousers. And she realized she wanted him so badly that she was shaking. Her fingers worked helplessly against the heavy shaft while he dragged up her skirts in great handfuls. He tugged at the tapes of her drawers, loosening them until the garment dropped to her knees. His hand slipped insistently between her thighs, pushing them apart. He touched inside her, seducing her with unbearably intimate caresses. Withdrawing, he used a fingertip to make slippery-soft circles around the sensitive bud. He kissed and whispered against her mouth, tightening his arm around her squirming body. The wind caused the tree branches to whip and flail overhead, leaves falling in a dark flurry. Evening settled outside the wood, seeping inward through the trees. Cam turned Amelia away from him, guiding her down until her front was supported by the gigantic beech branch, and her hands, one gloved, one bare, were clutched on the paper-flat bark. He shoved the mass of her skirts upward, heaped them at her waist, and drew his palms over her hips.","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-87.html","bookId":1788,"book":{"id":1788,"title":"Mine Till Midnight (The Hathaways #1)","description":"Storyline: When an unexpected inheritance elevates her family to the ranks of the aristocracy, Amelia Hathaway discovers that tending to her younger sisters and wayward brother was easy compared to navigating the intricacies of the ton. Even more challenging: the attraction she feels for the tall, dark, and dangerously handsome Cam Rohan. Wealthy beyond most men’s dreams, Cam has tired of society’s petty restrictions and longs to return to his “uncivilized” Gypsy roots. When the delectable Amelia appeals to him for help, he intends to offer only friendship—but intentions are no match for the desire that blindsides them both. But can a man who spurns tradition be tempted into that most time-honored arrangement: marriage? Life in London society is about to get a whole lot hotter...","cover":"https://allnovel.net/images/mine-till-midnight-the-hathaways-1.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/mine-till-midnight-the-hathaways-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:41:07 PM"}}
