{"id":78274,"no":90,"title":"Page 90","content":"\"Face the truth,\" Win said, enjoying her sister\u0027s discomfort. \"You\u0027ve become a femme fatale.\" Amelia rolled her eyes. \"Continue to make jest of me, and I won\u0027t tell you what happened during the visit to Ramsay House.\" \"What? Oh, do tell, Amelia. I\u0027ve nearly withered away from boredom.\" Amelia found it difficult to speak casually about the event. She swallowed hard. \"I feel like a lunatic, saying it. But... when I was walking with Mr. Dashiell and looking at the house, I saw a face in one of the upstairs windows.\" \"Someone was inside?\" Win asked in a thready whisper. She reached out and took Amelia\u0027s chilled fingers in hers. \"Not a person. It was... it was Laura.\" \"Oh.\" The word was a mere wisp of sound. \"I know it\u0027s difficult to believe? \"No it isn\u0027t. Remember, I saw her face on the magic lantern slide, the night of the fire. And? Win hesitated, her slim white fingers moving over the back of Amelia\u0027s hand. \"Having been close to death once, I find it easy to believe such apparitions could be real.\" The silence was cold and tense. Amelia struggled to be rational, to make sense of impossible things. She spoke with difficulty. \"Then you think Laura is haunting Leo?\" \"If she is,\" Win whispered, \"I think it\u0027s out of love.\" \"I think he\u0027s going mad from it.\" At Win\u0027s silence, the lack of disagreement, Amelia said desperately, \"How can we stop it from happening?\" \"We can\u0027t. Leo\u0027s the only one who can.\" Annoyed, Amelia jerked her hand away. \"Pardon me if I can\u0027t be fatalistic about it. Something has to be done.\" \"Then do something,\" Win said coolly, \"if you\u0027re willing to risk pushing him over the edge.\" Amelia leaped from the settee and glared al her. What in God\u0027s name did Win expect of her?... To stand aside passively while Leo destroyed himself? Weariness cut through the vibrating anger. She was tired of everything, all of it, tired of thinking and worrying and fearing, and getting nothing for it but the singular ingratitude of her siblings. \"Damn this family,\" she said hoarsely, and left before even harsher words could be exchanged. Forgoing supper, Amelia went to her room and lay on the bed fully clothed. She stared up at the ceiling until the room grew quite dark, the sun was extinguished, the air became still and cool. She closed her eyes, and when she opened them again, the room was filled with impenetrable blackness. There was movement around her, beside her, and she started and put her hand out. She encountered warm human flesh, an arm lightly covered with hair, a strong wrist. \"Cam,\" she whispered. Relaxing, she felt the smooth gold band at the base of his thumb. Cam didn\u0027t say a word. He undressed her slowly, one garment at a time, and she accepted his ministrations in a dreamlike silence. The troubled feeling in her chest eased as sensations rose and blossomed. He found her mouth and licked it open, kissing her fully. She lifted her arms to the dark, gorgeous creature over her, the flowing strength of him covering her. With every breath he took, his chest slid against the stiff tips of her br**sts, the light friction eliciting muted cries from her throat. His mouth broke from hers, exploring her shoulders and chest with hot open kisses, as if he were intent on tasting every part of her. He caressed her stomach with the backs of his fingers, teased his thumb around the rim of her navel... his hands clever and sublimely gentle. He had not entered her yet, but she already felt him at the center of her, the pulse, the pleasure. You inside me ... She reached for him blindly, her limbs folding around him. He resisted with a silken laugh, playing, stretching her limbs out and spreading her wide beneath him. His mouth dragged over her, sucking and teasing, and between her thighs she went absolutely wet. He touched her with his tongue, delving with the tip until he found the sensitive place that throbbed so exquisitely. The muscles in his arms bulged as he slid them beneath her legs, making a cradle of her hips. She struggled a little, not in protest but supplication, shivering with each swirl and glide of his tongue. Dazed and aching, she felt herself lifted in the darkness, his hands arranging her, closing on her legs. He made her kneel over him, pulling her h*ps down, pushing them back and forth in a gentle rhythm. His mouth was on her again, and she groaned helplessly as she was rubbed repeatedly across the heat and wetness and the tender flicking tongue. His teasing fingers slid inside her, and she began to pant with ecstasy, sensation wrapping around on itself?A knock at the door shattered the voluptuous quiet. \"Oh, God,\" Amelia whispered, freezing. The knock repeated, more urgent this time, along with Poppy\u0027s muffled voice. Cam took his mouth from her, his fingers slowly withdrawing from her clenching flesh. \"Poppy,\" Amelia called out weakly, \"can\u0027t it wait?\" \"No.\" Amelia clambered off Cam, her nerves throbbing viciously at the abrupt halt to their lovemaking. Cam rolled to his stomach and uttered a soft curse, his fingers digging into the bedclothes. Lurching around the room as if she were on the deck of a tossing ship, Amelia managed to find her robe. She pulled it on and fastened a few random buttons down the front. She went to the door and opened it a mere two inches. \"What is it, Poppy? It\u0027s the middle of the night.\" \"I know,\" Poppy said anxiously, finding it difficult to meet her gaze. \"I wouldn\u0027t have—it\u0027s just—I didn\u0027t know what to do. I had a bad dream. A terrible nightmare about Leo, and it seemed so real. I couldn\u0027t go back to sleep until I made certain he was all right. So 1 went to his room, and... he\u0027s gone.\"","sourceLink":"https://allnovel.net/mine-till-midnight-the-hathaways-1/page-90.html","bookId":1788,"book":{"id":1788,"title":"Mine Till Midnight (The Hathaways #1)","description":"Storyline: When an unexpected inheritance elevates her family to the ranks of the aristocracy, Amelia Hathaway discovers that tending to her younger sisters and wayward brother was easy compared to navigating the intricacies of the ton. Even more challenging: the attraction she feels for the tall, dark, and dangerously handsome Cam Rohan. Wealthy beyond most men’s dreams, Cam has tired of society’s petty restrictions and longs to return to his “uncivilized” Gypsy roots. When the delectable Amelia appeals to him for help, he intends to offer only friendship—but intentions are no match for the desire that blindsides them both. But can a man who spurns tradition be tempted into that most time-honored arrangement: marriage? Life in London society is about to get a whole lot hotter...","cover":"https://allnovel.net/images/mine-till-midnight-the-hathaways-1.jpg","author":"Lisa Kleypas","type":"Historical","source":"allnovel","link":"https://allnovel.net/mine-till-midnight-the-hathaways-1.html","creation":"Oct 5, 2019 8:57:57 AM","modification":"Oct 5, 2019 3:41:07 PM"}}
