{"id":13999,"no":13,"title":"CHAPTER XIII","content":"At seven o\u0027clock Mason proposed that he should go out and get something for them to eat, while Charles stayed in the house to avoid the possibility of being seen by any one who might be searching for him. Charles consented, but when his friend was gone his sheer loneliness became all but unbearable. The tawdry room with its cheap gas-fixtures of rusted cast iron, the machine-made oil-paintings, the tattered, dust-filled carpet, the cracked furniture, seemed a sort of prison cell in which he was confined. Not since his disappearance from Boston had the outlook seemed so hopeless. He told himself that it would only be a question of a day or so now before he would be caught and taken back to his old home. He shuddered at the thought of the scandal in the mind of the public. William, who no doubt had felt somewhat secure for the past two weeks, would find himself on that black brink again. Celeste—poor, gentle, sensitive Celeste—would suffer now in reality, and little Ruth! Why, the child might even ask to see him there in jail, and what reason could he give her for his incarceration? He paced the floor back and forth. How long Mason was in returning! Had anything detained him? Presently Mason came back. He brought nothing with him. He looked too much concerned to have thought of his errand. \n \n \"Say, it\u0027s serious,\" he began. \"I didn\u0027t have time to go to the restaurant. As I went out, old man, I saw that same fellow standing in front of our door, across the street. He was in the shadow, but I saw him and recognized him by his build. I couldn\u0027t doubt it, for when he saw me come out he bolted. He turned and went straight to the corner and down the avenue. I\u0027ve been watching outside ever since to see if he was coming back.\" \n \n \"Then he followed us,\" Charles said. \n \n \"Every step of the way to the Park. He had us under his eye while we were there, and he dogged our steps back here. Say, you\u0027ve got to listen to me.\" \n \n \"I\u0027m ready,\" Charles said, gloomily. \"You can decide better than I can.\" \n \n \"Here is my idea,\" Mason said. \"He evidently intends to get a warrant for you, but it may not be possible till to-morrow. We must get away from here to-night—at once. There is no time to lose. We are going to Newark.\" \n \n \"The circus?\" Charles said, inquiringly. \n \n \"Yes, but we must not be followed by that fellow, or any one else. Now I\u0027ll pack a few things, and you do the same. Make a small parcel. Don\u0027t bother with your bag. Thank God, our rent is paid. We are not going by train. That would be risky. We are going to walk most of the way through the country. It will be safer than in the trains that may be watched by the police. Hurry now!\" \n \n Mason was soon ready. \"Listen,\" he said, impressively. \"I\u0027m going outside now. You bring both parcels with you. I\u0027ll stroll along the street and make sure that the coast is clear. When you come out, if you see me with a newspaper in my hand it will mean that you are to follow me, and you do it. If I have no paper you are to go back and wait here till I come.\" \n \n Ten minutes later Charles descended the stairs. He deemed it lucky that he met no one. A clock below was striking ten. Outside he looked up and down the street. Presently he saw Mason on the first corner. He was in front of a laundry, a newspaper in hand. He saw that Mason had seen him, for he turned suddenly and began to walk westward. Charles followed for several blocks. Presently Mason stopped in a spot where there was little light, and waited for him to come up. \n \n \"Coast is clear, I think,\" Mason softly chuckled. \"That skunk thinks his game is safe till to-morrow, for he doesn\u0027t dream we are on to him.\" \n \n \"Where are we going now?\" Charles asked, vastly relieved by his friend\u0027s confident tone, and the sudden sense of the freer life into which they were going like two children of Fate. \n \n \"We must cross the Hudson somewhere,\" Mason answered. \"We could take the ferry at One Hundred and Thirtieth Street. It is less apt to be watched than the others, but still I want to avoid even that chance of detection. There are some small boat-houses near One Hundred and Eighty-first Street. I\u0027ve hung about them a good deal. If we can get there unnoticed we can be taken across in a row-boat or small launch—easy enough to pretend to be camping out over there. Hundreds are doing it this summer. We could take a car up, Subway or surface, but I think we ought to make for the river-front and do it afoot. It is a long walk, but it is safe.\" \n \n \"It suits me,\" Charles agreed, and side by side they continued in their westward course. \n \n Reaching Broadway, they walked northward till they came to Fiftieth Street; then they turned to the river-front. It was a fine night. The Albany excursion-boats, brilliantly lighted, were passing. Hundreds of smaller craft, yachts, sailboats, launches, and canoes, dotted the surface of the broad stream, and from some of them came strains of band music, the strident notes of a clarinet, merry voices singing to the accompaniment of stringed instruments. \n \n \"Fine! Fine!\" Mason kept muttering. \"We ought to have done this before. You can\u0027t beat it at this time of the year.\" \n \n They were passing a small restaurant and Mason paused. \"We\u0027ve got to eat,\" he laughed. \"I like the looks of this snug joint. What do you say?\" \n \n Charles consented. The haunting sense of danger was gone. He was hungry. They went in. The hour was too late, the single attendant said, for anything to be served except sandwiches and coffee. They ordered a supply, drank two cups of coffee each, and ate their sandwiches as they walked on. \n \n They were soon in the neighborhood of Columbia University and Grant\u0027s Tomb. The moonlight on the river, the abrupt cliffs of the Palisades beyond, on the top of which gleamed the lights of an amusement park, drew Charles into a reminiscent mood which suddenly became painful in the extreme. He told himself that it was no wonder that Mason could be cheerful. He had a home and relatives to whom he could return when he wished, but with Charles the wide world was his only home. He was so bound by his promise to his brother that he could not reveal his entire past even to Mason, who had proved himself worthy of all confidence. Remorse over his ill-spent, dissipated youth was all but gone, for something told him that he was fully atoning for all the mistakes of the past. It was William he was saving, yes, and William\u0027s good wife and sweet child growing into promising girlhood. After all, what did it matter what became of him? Nothing, he thought, and with the reflection came a vast sense of peace and freedom from care. He was a man without home or kin now, but what did it matter? All sorts of interesting things could happen to a world-wanderer like himself. He could tell no one who he was or where he was from, but surely he need not be unhappy. Indeed, whenever he thought of William\u0027s escape from disgrace and death by his own hand, and realized that his vicarious sacrifice had made possible that escape, he felt wondrously happy. \n \n It was midnight when they reached the boat-house where Mason intended to secure passage across the river. It was a long, narrow, two-story building, with a float at one end and a dance-hall on the upper floor. The hall was lighted up and a dance was in progress. Through the windows they could see the young couples waltzing. \n \n \"Glad it is going on,\" Mason said, reflectively. \n \n \"Our chance is all the better to get across. Some of these fellows live in tents on the Jersey shore and may be going back to-night. Stay down here on the float and I\u0027ll nose about. I know the owner of the house fairly well.\" \n \n Charles sat on a bench on the float. The vast sheet of water was smooth. The larger boats were no longer in sight. Now and then a canoe holding a pair of lovers drifted by, or a sailboat almost be-calmed. The sound of a piano and a violin came through the raised windows of the dance-hall, and the low swishing of sliding and tripping feet, merry laughter and jesting, loud orders for drinks or cigars in the bar. Presently Mason came back. Charles saw at a glance that he was pleased over something. \n \n \"Boat-house man says he will take us across in a few minutes for a dollar. Cheap enough. He thinks we are out for a hike on the other side. He has a launch. He has to wait till the dance is over. It is breaking up now.\" \n \n This was true, for the couples came down the stairs and began to get into canoes and launches. The sight of the lovers drew Charles\u0027s thoughts back to himself again. Why had he not thought of it before? Love and marriage were the things he could never expect to enjoy, and yet they now seemed to be essential to life. How lovely was the girl with the golden hair and brown eyes who laughed so joyously as her escort tripped over a coil of rope and all but fell into the water! And what a giant of a creature was the man himself as he lifted the slender girl in his arms and playfully shook her to silence her amused twitting. \n \n \"Here you are, young feller!\" It was the boat-house keeper drawing his little launch alongside the float. \"I\u0027ll spin you over in five minutes on water like this. You guys are taking an early start for a hike.\" \n \n \"Obliged to do it,\" Mason fibbed, with a straight face. \"We have to catch some chaps at Alpine before they start in the morning. All right. We are ready.\" \n \n The tiny engine began to rattle. The boat glided away from the float and was soon under way. Looking back at the almost deserted boat-house Charles had a sense of safety from pursuit that was very soothing. He saw, too, that the same thought was evidently in Mason\u0027s mind, for he was very easy in his manner and had much to say to the boatman in regard to fishing and boating. They landed at a little pier almost directly opposite the boat-house. Mason paid the fare and the boatman left them. \n \n \"Smooth, smooth! Slick, slick!\" Mason chuckled. \"We are safe now. What do you say; shall we lie down here and take a nap till morning, or go right on? It is six of one and a half-dozen of the other?\" \n \n \"It is all the same to me,\" Charles replied. \"I am not really tired.\" \n \n \"I am not, either,\" Mason said. \"I\u0027ll tell you, though, that my choice would be to hike it by night. I\u0027ve been over the road once before, and if we go now we will not be noticed by a single soul, while in the daytime we might accidentally be seen by some one on the lookout for you. It is a stiff climb to the top, but let\u0027s make it and go on to Newark. We\u0027ll get jobs. I\u0027m absolutely sure of it, from what that fellow told me in union Square. They happen to be very short on help. Well, it will mean three square meals a day, plenty of outdoor exercise, and a bunk to sleep in over rattling car-trucks, I\u0027m going to take to it like a fish to water.\" \n \n \"I shall like it, too,\" Charles declared, and they set out for the road leading up the Palisades to the level country above. The joyous mood of his companion communicated itself to Charles, and he felt very light-hearted. The warm sense of a new existence tingled over him. He felt all but imponderable as he strode along by his friend in the clear moonlight and the bracing air from the river. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2360/65879.html","bookId":416,"book":{"id":416,"title":"The Hills of Refuge","description":"简介： The house, a three-story red-brick residence, was on Walnut Street, near Beacon. Its narrow front faced the state Capitol with its gold-sheeted dome; from its stoop one could look down on the Common and, from the corner of the street, see the Public...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2360","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
