{"id":14016,"no":30,"title":"CHAPTER XVII","content":"Mary rode to house after house on her way to Carlin, but met with no success in the matter of borrowing money. It was near noon when she entered the straggling suburbs of the village. At a ramshackle livery-stable she dismounted and left her horse in the care of a negro attendant whose father had once been owned by her family. She called him \"Pete\"; he addressed her as \"Young Miss,\" and was most obsequious in his attentions and profuse in promises to care for her horse. \n \n Opposite the hotel stood a tiny frame building having only one room. It was a lawyer\u0027s office, as was indicated by the sanded tin sign holding the gilt letters of the occupant\u0027s name—\"Chester A. Lawton, At\u0027y at Law.\" \n \n He was a young man under thirty, who had met Mary several times at the hotel when she was visiting Mrs. Quinby. He was seated at a bare table, reading a law-book, when she appeared at the open door. He had left off his coat, the weather being warm, and on seeing her he hastily got into it, flushing to the roots of his thick dark hair. \n \n \"You caught me off my guard, Miss Mary,\" he apologized, awkwardly. \"I know I oughtn\u0027t to sit here without my coat in plain view of the street, but the old lawyers do it, and—\" \n \n \"It is right for you to do so,\" Mary broke in, quite self-possessed. \"I only wanted to see you a moment. I wanted to ask you what is customary in regard to fees for getting legal advice.\" \n \n Lawton pulled at his dark mustache, even more embarrassed. \"I—I—really am rather new at the work, Miss Mary; in fact, I\u0027m just getting started,\" he answered, haltingly. \"I suppose that such things depend on the—the nature of the case, and the research work, reading, you know, and—oh, well, a lawyer sometimes has expenses. He has to travel in some cases. Yes, fees all depend on that sort of thing.\" \n \n He was politely proffering a straight-backed chair, and as she sat down she forced a smile. \"To be frank,\" she went on, \"I don\u0027t know whether I really ought to employ a lawyer or not, and I was wondering how much it would cost to find out the probable expense.\" \n \n \"Oh, I see!\" laughed Lawton, as he sat down opposite her, leaned on the table, and pushed his open book aside. \"Well, I\u0027ll tell you, Miss Mary. I don\u0027t know what the older chaps do, but I make it a rule not to charge a cent for talking over a case with a person. That is right and proper. If you have any legal matter in mind, all you\u0027ve got to do is to state it to me—that is, if you have honored me by thinking my advice might be worth while—and if I see anything in your case I\u0027ll then advise you to proceed, or not, as I deem best.\" \n \n Lawton seemed rather pleased at the untrammeled smoothness of his subdued oratory, and waited for her to speak. \n \n Mary was silent for a moment, and then she said, \"You see, I don\u0027t know whether I really ought to seek legal advice yet, at any rate, and—\" She broke off suddenly. \n \n \"Miss Mary,\" said Lawton, trying to help her out, \"may I ask if you are referring to—to the little trouble your brothers are in?\" \n \n She nodded, swallowed a lump of emotion in her throat, and looked him straight in the eyes. \"Father wouldn\u0027t attend to it, and I got to worrying about it—about whether advice ought to be had or not. We are terribly hard up for ready money and have got into debt already.\" \n \n \"Well, I\u0027ll be frank with you, Miss Mary, and I\u0027m going to tell you something that may be to your interest. Now if you had gone to—we\u0027ll say to Webster and Bright, across the street, they, no doubt, would expect you to pay and pay big whether you needed a lawyer or not. Old law firms have strict rules on that line, I understand. Everything is \u0027grist that comes to their mill,\u0027 as the saying is, for they will tell anybody that they are not paying office rent for fun. But it is different with a young chap that is just getting on his feet in the profession. Now, knowing you as I do, and having had several agreeable talks with you, I\u0027d hate like rips to charge for any advice I can give unless—unless it was of great benefit to you; and the truth is, I am not at all sure that you need a lawyer.\" \n \n \"Oh, you mean—But I don\u0027t understand!\" Mary exclaimed, not knowing whether his words boded well or ill for her. \n \n \"Why, it is like this, Miss Mary. There are tricks in my trade, as in all others, and as matters stand in the case of your brothers—well, if Tobe Keith should happen to pull through, the charges against them would be so insignificant that the courts would be likely to dismiss them entirely. That, no doubt, is a slipshod method, but it is peculiar to us here in the South. You see, your father stands high—nobody higher, in fact; he fought for the Confederacy, has always been a perfect gentleman, and has no end of influential kinsfolk. Why, the district attorney himself is a sort of distant cousin, isn\u0027t he? Seems to me that I have heard him telling your father one day that if he ever printed that family history he\u0027d subscribe for several copies, because his name was to be in it, somehow—on his mother\u0027s side, I think. Then the Governor is akin, too, isn\u0027t he? I thought so\" (seeing Mary nod) \"and the Kingsleys and Warrens. Oh, take it from me, Miss Mary, if Tobe Keith does get on his feet your brothers will not even be arrested. So I\u0027ll not take any fee from you—yet awhile, anyway; and I\u0027m going to say, too, that I\u0027d keep the boys out West. It is a good thing they went to Texas. I suppose they are out there, dodging about. I heard Sheriff Frazier say so the other day (his brother Al had picked up the news somehow or other), but he hadn\u0027t decided to institute a search till there was a change in Tobe\u0027s condition.\" \n \n \"Have you heard from him to-day?\" Mary asked, and she all but held her breath as she steadily eyed the lawyer. \n \n \"No change at all, I understand,\" Lawton answered. \"The doctors still say he must be taken to Atlanta to get the ball out.\" \n \n \"Yes, that must be done,\" Mary sighed, and her face became graver. \"I am trying to raise the money—four hundred dollars. Mr. Lawton, can you tell me how to do it? I have no security.\" \n \n \"I\u0027m sorry, Miss Mary\"—Lawton\u0027s color heightened and he screwed his eyes up in embarrassment—\"that I can\u0027t help you out on that line. Everybody I know is in debt or short of funds. The bank is awfully strict, and high on interest, too. Your father and Albert Frazier drew up some sort of a paper at this table the other day. I think Frazier went his security, put his name on a note at the bank. I heard them talking about how difficult it was to get money. I think Albert has about run through the little pile his old daddy left him. He is a high-flyer for these times—free and easy with his money as long as it lasts.\" \n \n \"So you can\u0027t tell me any one to go to?\" Mary rose and began to adjust the veil on her hat. \n \n \"No, I can\u0027t, Miss Mary. There ought to be a public fund for such cases of need as Tobe\u0027s. Yes, you must take some steps in his behalf. It would look well from any point of view. Tobe didn\u0027t know what he was doing, and neither did your brothers. If Tobe gets over it, it may be a good lesson to all three.\" \n \n Mary was at the door now; he followed and stood bowing her out, while she thanked him for his helpful advice. \n \n She was crossing the street when Albert Frazier, seated in a buggy, with his brother, drove by. She thought he might get out and speak to her, but he simply tipped his hat and transferred his gaze to the back of the trotting bay horse. She noted that the sheriff, whom she had never met, had not noticed her nor his brother\u0027s salutation. \n \n She went into the post-office to get some stamps, and when she came out Albert Frazier was waiting for her on the sidewalk. \n \n \"I would have got out when I passed you just now,\" he said, beaming on her admiringly, \"but I was with John, you see; and—well, to be plain, he doesn\u0027t know about me and you, and right now especially I don\u0027t want him to get on to it.\" \n \n \"I understand,\" she said, coldly, looking away from him. \"Aren\u0027t you afraid he will see us now?\" \n \n \"No. He has gone on home. His wife isn\u0027t well. Say, little girl, you are not mad, are you?\" \n \n \"Oh no,\" she answered, forcing a smile. \n \n \"Well,\" he bridled, \"it is for your own good and the boys\u0027. I\u0027m having a tough job keeping John from suspecting the truth. If I hadn\u0027t got up that bogus letter from Texas he might have had his men searching the mountains, or watching you and that hobo circus man take food out to them in their cave. I\u0027m doing all I can for you and I think you ought not to get on your high horse as you do sometimes.\" \n \n \"Forgive me,\" she said, tremulously, the muscles of her lips twitching. \"I know what you are doing, and I appreciate it from the bottom of my heart.\" \n \n Her grateful words put him in a better mood. They were about to cross the street again; a wagon loaded with cotton-bales was passing. He was hardly justified in doing so, for she needed no assistance, but he took hold of her arm, and she felt his throbbing fingers pressing it. She drew away from him. \"Don\u0027t!\" she said, impulsively. \n \n \"There you go again,\" he cried, but not angrily, for her natural restraint had been one of her chief attractions. Other girls had given in more easily and had been forgotten by him, but Mary was different. There was, moreover, always that consciousness on his part of her social superiority. He wanted her for a wife, and, situated as she now was, he had never felt so sure of her. \n \n \"When are you going to let me give you that money?\" it now occurred to him to ask. \"Tobe must be removed, you know.\" \n \n A look of deep pain struggled in the features she was trying to keep passive. \"I haven\u0027t quite given up the hope of getting it elsewhere,\" she finally said. \"If I quite fail, I\u0027ll come to you. I\u0027ve said so, and I\u0027ll keep my word.\" \n \n At this moment a farmer came up to Frazier and said that he wanted to speak to him a moment. Excusing himself and bowing, Frazier left her. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2360/65896.html","bookId":416,"book":{"id":416,"title":"The Hills of Refuge","description":"简介： The house, a three-story red-brick residence, was on Walnut Street, near Beacon. Its narrow front faced the state Capitol with its gold-sheeted dome; from its stoop one could look down on the Common and, from the corner of the street, see the Public...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2360","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
