{"id":14024,"no":38,"title":"CHAPTER XXV","content":"It was just after sundown, two days later. Charles was at work in a patch of cabbages near the outer fence of the farm, not far from the barn. Presently, happening to look toward the thicket, he saw a man in a gray suit of clothes and a straw hat cautiously emerging. Their eyes met. The man waved a handkerchief and then stood still, partly hidden by the bushes among which he stood. Charles glanced toward the house and, seeing no one, he put down his hoe and walked toward the man. They met in the edge of the thicket and clasped hands. \n \n \"You are back already—or did you really go to Atlanta?\" he questioned, eagerly. \n \n \"Yes, sir. I would have written, Mr. Charles, but—well, I thought it might not be best. You didn\u0027t say that I might. Yes, sir. I attended to everything the best I could. I was at the train when they got there with the poor fellow, and saw them take him from the Pullman at the station and put him into an ambulance from the sanatorium.\" \n \n \"How did he look? How did he seem to stand the trip?\" Charles asked, anxiously. \n \n \"I couldn\u0027t tell, sir. I couldn\u0027t see his face. The police kept the crowd back, but the old woman—his mother—looked worried, and I thought the doctor from here did also, and the nurse that came along. I think they gave him a stimulant. I know I saw a bottle and a glass in the doctor\u0027s hand. They drove slowly, and so I had no trouble keeping up with them afoot. I saw them drive into the grounds of Doctor Elliot\u0027s sanatorium, and I felt relieved. I would have telegraphed you, but did not know how to reach you here in the country.\" \n \n \"Well, that was two days ago,\" Charles said. \"Have you heard anything more?\" \n \n \"They operated last night, sir. I was there early this morning. I went into the grounds, hoping to get information, but a guard stopped me at the door and refused to tell me anything. I was trying to persuade him, sir—I know how to deal with such persons, as a rule—but this fellow, although I showed him some money, refused to talk at all. I was greatly worried till Mrs. Keith chanced along and saw me. She recognized me, sir, and she ran out and grabbed my hand. She wanted me to go into the public sitting-room, but I refused. Oh, she was crowding me with questions; they came so fast, sir, that she wouldn\u0027t let me get a word in! However, she was so—I may say so gay, sir, that I began to think she had good news. Finally, Mr. Charles, she told me that the operation was done, and most successfully. In fact, sir, she says Doctor Elliot says her son\u0027s recovery is almost assured, though it was a narrow escape.\" \n \n \"That is good news, Mike—wonderful news!\" Charles exclaimed. \"It will make some people very happy.\" \n \n \"The young lady especially, I presume, sir?\" \n \n \"Yes, her most of all, Mike.\" \n \n \"Well, I think she need not worry any more about the poor fellow. I am sure, from all I hear down there, that he will soon be on his feet. That old lady, Mrs. Keith, fairly hung on to me, Mr. Charles. I can hold my own with the average man in a shady deal of this sort, but not a woman out of her head with gratitude and curiosity combined. Why, sir, I thought once that she\u0027d have me arrested to force me to tell her who sent the money. It was only by lying straight out that I got away from her clutches. I told her, I did, sir, that I\u0027d go down-town and ask permission to let the cat out of the bag and return. That was the only thing that saved me. I\u0027d have been there yet but for that little trick.\" \n \n \"So she doesn\u0027t know that, anyway?\" Charles said. \n \n \"No, sir, she hasn\u0027t the slightest idea. She tried to make me say that I did it, but of course I couldn\u0027t allow that, sir. So I simply stuck to it that I\u0027d been sent by some one else—a friend, a well-wisher and—you know what you said to tell her.\" \n \n \"And what are your present plans?\" Charles asked. \n \n \"I must return home, sir. I want to stop in New York and see my mother, and then go back to Boston. I have been away as long as I can manage it now, sir.\" \n \n \"You have been of great service to me, Mike,\" Charles said. It was growing darker now. The twilight was thickening, the yellow glow in the western sky above the mountain-tops was fading away. They strolled down a path toward the house. \"Yes, Mike,\" Charles continued, \"no man on earth could have done me such a valuable service. If you hadn\u0027t come that poor fellow would have died and half a dozen persons would have been stricken down with grief and overwhelmed with disgrace.\" \n \n \"And the young lady—the beautiful young lady, sir—you say she would have suffered most of all?\" \n \n \"Yes, most of all, Mike. But you mustn\u0027t go away with the thought that—that there is anything of a serious nature between me and her, for there isn\u0027t. No one else here knows the truth, but I have told her—given her to understand—that something is hanging over me which will forever keep us apart. She belongs to an old and honorable family, Mike, and I am what you see me now in these old clothes; I am a servant and can never be anything else. So you are going back? Well, I want you, if you can, to see Mason in New York and thank him for sending you to me; and as for the people at home—\" \n \n \"I was going to ask what I might do in regard to them, Mr. Charles,\" Michael said, suddenly, as Charles paused. \"Your brother and your uncle, who lives with us now, will not ask questions, but the missis—she will. She is sure to, the first opportunity.\" \n \n \"You think—\" Again Charles lost his way to satisfactory expression. \n \n \"Yes, sir. You see, she has always questioned me on my return from New York, to find out if I have heard anything. She will want to know this time, too, sir, and I confess that it will be hard to fool her. She looks one so straight in the face, you know, sir, and the truth is she loves you as if you were her own brother, sir. Nothing wins a woman\u0027s heart like being tender to her child, and she knows how you loved the little lady, sir. Pardon me, Mr. Charles, for making a suggestion. The missis can be trusted where you are concerned. She\u0027d die rather than betray your interests. Would you mind if I frankly told her that I have seen you and that you are well and safe? I think, sir, that it would only be fair to her, after all the worry she has had about you. It would make her very happy, Mr. Charles. You see, as it is, she does not even know if you are dead or alive, and—and—But it is not for me to advise, sir.\" \n \n Charles hesitated. Then he said: \"I think you may tell her, Mike. I couldn\u0027t risk writing back, but I can trust you with that news of me. Give her my love, please, and tell her to kiss Ruth for me, and—and, well, tell her anything you like. She won\u0027t betray me. After all, I\u0027m glad to be able in this way to relieve her mind.\" \n \n So closely were they occupied with their parting words that they failed to see a figure approaching from the direction of the house. It was Mary, and she was close to them when they heard her step and, turning, saw her. \n \n \"Oh,\" she exclaimed, on seeing the stranger, \"I thought it was one of my—\" She checked herself abruptly. \n \n For a moment Charles stood as if dazed, and then recovered himself. \"This is my friend, Michael Gilbreth,\" he said. \"He is the one who aided us so substantially the other night.\" \n \n \"Oh, and I have wanted so much to meet you—to thank you,\" said Mary. She held out both her hands to the astonished servant, and he awkwardly took them. \n \n \"I\u0027m pleased, I\u0027m sure, miss, to meet you, but—but,\" he stammered, \"you must not thank me. Mr. Charles is back of all that. You see, miss, it wasn\u0027t expense out of my pocket—\" \n \n \"I know—I understand, but you kindly delivered it,\" Mary said. \"And that was a great service. It may result in saving a human life and avert much misery and misfortune.\" \n \n \"But, you see, I owed the money to Mr. Charles,\" Michael went on, simply. \"He advanced it to me a long time ago when I was in need myself. He is always doing the like, miss, and it is strange, for the minute I pay him back out it goes to somebody else; but—\" \n \n \"Mike has just brought good news from Atlanta,\" Charles, hot with embarrassment, broke in. \n \n \"Oh, have you?\" Mary cried. \n \n Michael hesitated, looking at Charles, who answered for him: \"Yes. The operation was highly successful. Keith\u0027s recovery is now practically assured.\" \n \n \"Oh, that is good news!\" Mary cried, her eyes flashing with joy, and she prevailed upon Michael to tell her all the details. When he had concluded she looked toward the barn. \"I must hurry and tell my—tell my brothers.\" She was starting away when she turned back. \"You must stay with us, Mr. Gilbreth. We have plenty of room. Any friend of Mr. Brown\u0027s is welcome at our house.\" \n \n Michael threw an awkward glance at Charles and then said: \"I thank you, miss, but I must hurry away. My time is up.\" \n \n \"Then I\u0027ll say good-by.\" Mary held out her hands. \"I shall never forget your kindness, and I wish you a long, happy life.\" \n \n The two men lapsed into silence as she flitted away in the gloom. \n \n Presently Michael, with a deep sigh, said: \"Now I understand, Mr. Charles—I understand how you are placed. Why, sir, she is the most exquisite young lady I ever saw! She\u0027s not only beautiful, but, sir, she is the real thing in womanhood, and her voice—I have never heard one like it. It is like music, sir, full of sweetness and gentleness and human sympathy. Oh, I can\u0027t blame you for wanting to stay here and cut out all the rest. Labor such as you are doing now with such companionship—\" \n \n \"You mustn\u0027t misunderstand, Mike,\" said Charles, and his voice sank low in his throat. \"She can never be more to me than a friend. You know why well enough. I am trying to be of use to her, that\u0027s all.\" \n \n \"But your heart, Mr. Charles,\" Mike said. \"You\u0027d not be a natural man if you could keep from loving a lady like her, sir. In fact, I see it in you. You never were struck that way at home, sir. Among all the fair ones you knew up there, none of them—\" \n \n \"We mustn\u0027t talk of that, Mike,\" Charles broke in, huskily. \"I don\u0027t allow myself to think of the impossible. How are you going to Carlin?\" \n \n \"Afoot, sir. I like it. I can easily make my train to-night. Well, sir, you will have to be going in and I\u0027ll say good-by, Mr. Charles.\" \n \n \"Good-by, Mike. Your coming has been a great help to me.\" \n \n Tears suddenly filled the servant\u0027s eyes, and, turning swiftly, he walked back toward the thicket and disappeared. \n \n As he neared the house Charles saw Mary coming from the barn. Her head was cast down and she was moving slowly. They met near the kitchen door. \n \n \"I\u0027ve just left them,\" she said, in a voice full of joyful emotion. \"Oh, I can\u0027t describe all that took place. They have both been in abject despair night and day since Tobe was taken away, and when I told them the news they—I can\u0027t describe it. The joy seemed to bewilder them, stupefy them. Kenneth sat still on the horse-trough—I couldn\u0027t see his face in the dark, but I heard him catch his breath, and when he tried to speak he choked up. And Martin—he came to me and put his head on my breast and cried like the child he really is at times. Oh, Charlie, life is wonderful! I am in heaven to-night, and my reason tells me that I never could have reached it in any other way than through what I\u0027ve suffered and your help. Yes, you—you did it. But for your money all would have been lost.\" \n \n \"You forget that you yourself would have paid it if I had not,\" Charles argued, \"or rather, it would have been paid by—\" \n \n \"No, there\u0027s where you are wrong,\" Mary protested. \"My father tells me that the bank would not have cashed Albert\u0027s check that day. He has met with great losses in some enterprises, and is on the verge of bankruptcy. No, if it hadn\u0027t been for you all would have been lost. When your friend said just now that you were always doing kind deeds he said only what I already knew to be the truth. You are the most unselfish man I ever knew. Is it any wonder that I—\" She did not finish, but suddenly turned and left him. \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2360/65904.html","bookId":416,"book":{"id":416,"title":"The Hills of Refuge","description":"简介： The house, a three-story red-brick residence, was on Walnut Street, near Beacon. Its narrow front faced the state Capitol with its gold-sheeted dome; from its stoop one could look down on the Common and, from the corner of the street, see the Public...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2360","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
