{"id":13990,"no":4,"title":"CHAPTER IV","content":"It was Wednesday night. William Browne had not come home to dinner. Charles looked into the dining-room. Celeste and Ruth were in their places at the table. \n \n \"William telephoned that he could not come up,\" Celeste said, as he sat down. \"He says he has work to do at the bank to-night.\" \n \n \"Yes. I\u0027m going back myself at once,\" Charles answered. \"In fact, I am not a bit hungry. I had something late this afternoon—sandwiches and tea. If you will excuse me, I won\u0027t stay.\" \n \n As he rose, Celeste lifted an odd stare to his face, but simply nodded as he was leaving the room. \n \n \"Don\u0027t go, Uncle Charlie,\" the child protested. \"Stay for your dinner.\" \n \n \"No, I must go.\" He came back, bent over her chair, and kissed her on the cheek, and then hurried away. \n \n It was eight o\u0027clock when he reached the bank. The outer doors were closed, but a dim light could be seen through a plate-glass window in front. Softly inserting his key, he turned the bolt and entered. \n \n \"My God! he may not be here, after all!\" Charles thought, as he shut the door noiselessly. Then he saw a light in the direction of his brother\u0027s private office and went toward it, now more hopefully. He was near the office door when he heard a sound like the hurried closing of a desk drawer. \n \n \"Who is that?\" a startled voice called out. \n \n \"It is I, Billy. May I come in?\" \n \n There was no reply, and Charles pushed the door open. The banker sat at his desk in the glare of a green-shaded electric lamp. His face was ghastly pale, and rendered more so by the greenish light that fell upon it. \n \n \"What did you come for?\" he asked, almost doggedly, and yet without a trace of impatience or anger. \n \n \"Because you didn\u0027t come to dinner, and because—\" \n \n \"Because you are still watching me. Say it and be done with it,\" broke in William, in a tone which was scarcely audible as it rose from his husky throat. \n \n \"Yes, Billy. That\u0027s it. You have scarcely been out of my sight since Sunday morning. The examiner will be here to-morrow. I know how you feel about that, you see. You told me what you wanted to do. I have seen the thought in your eyes often since then. But it shall not be so, Billy. I love you. You are the only one in the world whom I do love very much. You shall not kill yourself, Billy.\" \n \n William lowered his head. His chin rested on his chest. \"There is nothing else to do,\" he groaned. \"I cannot face this thing. They say men are always insane who do such things, but it is not so. I am mentally sound. I see all that lies ahead of me—everything, even the thoughts that will spring to life in the minds of my wife and child. Go away and leave me, Charlie. I want to be alone.\" \n \n \"What did you put into that drawer just as I entered?\" Charles asked, leaning forward. \n \n \"Never mind,\" William said. \"Go away.\" \n \n \"I want to know what it was,\" Charlie protested. He reached down and caught the handle of the drawer. \n \n William made a slight movement as if to stop him, but desisted, uttering a low groan as he did so. Charles opened the drawer. A long revolver lay on the papers within. He took it out, and shuddered as he held it behind him. \n \n \"You are not going to shoot yourself, Billy,\" he said, firmly. \"I am not going to permit it.\" \n \n William made no reply, and with the revolver in his hand, Charles went into the adjoining counting-room and turned on the light at his own desk. For twenty minutes he sat resting his head on his hand, his elbow on the desk, the weapon before him. Presently his eyes began to glow, his face was flushed, his pulse was throbbing. \"I have it,\" he said. \"I have it.\" \n \n Laying the revolver on the desk, he turned back to his brother\u0027s office. William sat as he had left him, his limp hands on the arms of his chair, his disheveled head lowered. \n \n \"Listen, Billy, listen!\" Charles began. \"I want to tell you something about myself first, and then about you. You must listen. It is important. It is your chance, and a splendid one.\" \n \n \"My chance?\" echoed the banker. \"What chance?\" \n \n \"Billy, I am down and out. I\u0027ve lost all my friends and social standing. I don\u0027t want to remain here longer. I want to go away off somewhere among strangers and begin life over again.\" \n \n \"Well, well, why tell me about it when you see that I—\" \n \n \"Because it concerns you, Billy. Listen, it is both your chance and mine. I want to live a decent, sober life, and you say if you could stave this thing off for a few months you could replace the missing money.\" \n \n \"I could, but—\" \n \n \"Then it will be done, and I\u0027ll tell you how. It is very simple. I am just now the talk of the town on account of the life I have been leading. People will not be surprised at anything reported of me, the directors least of all. You know they would have discharged me long ago but for your relation to me.\" \n \n \"I don\u0027t understand. I can\u0027t see what you are driving at,\" William stared with his bloodshot eyes. \"You say you see a way. For God\u0027s sake, for God\u0027s sake—\" \n \n \"Yes, but you are not listening. I am coming to it. I am going away to-night, Billy. I\u0027m going away never to return. I am going out of your life as completely as if I\u0027d never been in it. I\u0027ll never write back. You will never know whether I\u0027m dead or alive.\" \n \n \"You are going away? Why are you going? I thought of it myself, but I couldn\u0027t stand it. No, there is no other way than to end it all.\" \n \n \"Don\u0027t you see what I mean, Billy? It is known that I have access to the vaults during business hours, and when I turn up missing to-morrow the examiner will logically couple me and my bad record with the money that is gone. Now you understand.\" \n \n With his hands on the arms of his revolving-chair the banker drew himself to his feet. A wild look of hope was in his eyes and on his ghastly face. He groped his way to his brother, his hands outstretched as if to prevent himself from falling. \n \n \"You—you can\u0027t mean it, Charlie!\" he said in his throat. \"And if you do mean it I can\u0027t let you—I can\u0027t, I can\u0027t!\" \n \n \"You must, because I wish it. I want to be of some use to you and to Lessie and the baby. Oh, I owe you a lot—a lot! Think how you have borne with me—how I have disgraced you.\" \n \n \"I can\u0027t let you—I can\u0027t,\" William cried, and yet he was panting with a vast new joy. His eyes bored into those of his brother. \"What, let you do that? No, no. I could not permit it.\" \n \n \"Billy, you see, I want to do it as much for myself as you. I want to be absolutely free from old associations. You can replace the money. You can claim that you are doing it, you see, because you were responsible for my staying on when I ought to have been discharged. It will all seem so—so plausible—so very natural.\" \n \n Turning, his eyes on the floor, William stalked back to his desk. He drew his chair around. \"My God! My God!\" his brother heard him muttering as he lowered himself into it. Dropping his head to the desk, he was still for a moment. Charles went to him. \n \n \"You have nothing to do with it.\" He touched his brother\u0027s bowed head. \"I am going, whether you consent or not. I am going to-night. When I am missed in the morning that will tell the tale. You won\u0027t even have to explain. They will sympathize so much with you that they will not ask you many questions. Oh, it is all right now! You will have a chance to pay a just debt and I\u0027ll have a chance to make a new life for myself. They can\u0027t catch me, Billy. I know how to dodge the slickest detectives on my trail. The world is big and full of adventures. Do you know, Billy, I have always been haunted with the idea of freedom like this? Don\u0027t you worry. I\u0027ll be all right, whatever happens. And listen, Billy. I swear to you by the memory of our mother that I\u0027ll never tell a living soul of this agreement of ours. Never!\" \n \n William raised his head. He clasped his brother\u0027s hands and pressed them convulsively. \"Oh,\" he gulped, \"if I want to escape my just punishment, forgive me—forgive me, Charlie, for I am afraid of death. I have faced it for more than a week. It is an awful thing to think of all that it means, its effect on Lessie and the baby. Oh, Charlie, Charlie!\" His lower lip was twisted by suppressed emotion. His eyes were filling with tears. \n \n \"I am going. That is settled,\" Charles said, with feeling. \"And there is no time to lose. I\u0027ll hurry home and pack a few things. There is a train for New York at midnight. I can hide there safely enough for a while. I know the ropes. Good-by, old chap.\" \n \n William stood up. He clung to his brother\u0027s hands for a moment, then put his arms around him. \"Good-by,\" he gulped. \"I hate to let you do it, but I am a coward—not only a thief, but a weakling and a coward. You must have money. Wait. I\u0027ll—\" \n \n \"No, no, Billy.\" The other shook his head. \"I sha\u0027n\u0027t take a cent from the bank, under any consideration. You must begin anew as I am going to begin anew. You will owe to these men every cent you can get till that debt is paid. Besides, I have a little money and I shall not need much, for I am going to work for my living. I\u0027ll find something to do. It won\u0027t be an indoor job like this, for I am tired of it. I want to use my body instead of my brain. I want to tramp from place to place in the open sunlight and free air. I want to be a hobo. I want to put myself down on the level of the most unfortunate of men. I want to wring the poison of my past out of me. This chance seems a godsend to me. It will save Lessie and little Ruth from great sorrow and humiliation, and you from a desperate act. Life is a short thing, anyway, isn\u0027t it, Billy? Don\u0027t ever expect to hear from me again. In addition to the risk, it will be best for your state of mind. Think of me as dead.\" \n \n William made a feeble effort to detain him, but he was gone. The banker heard him softly closing the big front door, and he sank back into his chair, tingling under a growing sense of vast relief. To be sure, he was losing his only brother, but he was retaining countless other things. He told himself that the plan was a marvelous one. Every flagrant act of his dissipated brother gave color to the implied charge against him, while his own high standing and the agreement of restitution he was to make would lift him above all possible suspicion. \n \n \n \n","sourceLink":"http://novel.tingroom.com/jingdian/2360/65870.html","bookId":416,"book":{"id":416,"title":"The Hills of Refuge","description":"简介： The house, a three-story red-brick residence, was on Walnut Street, near Beacon. Its narrow front faced the state Capitol with its gold-sheeted dome; from its stoop one could look down on the Common and, from the corner of the street, see the Public...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2360","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
