{"id":14037,"no":51,"title":"CHAPTER XXXVIII","content":"Charles toiled all that day in the fields. At no time during all his troubles had his depression been greater, due to the humiliating fact of Mary and her father being at work in his behalf. And what good would come of it? he kept asking himself. His appearance at court was inevitable sooner or later, and what could he say in his defense? Nothing and still remain true to the high stand he had taken. \\n\\n \\n\\n He saw the sun sink below the mountain-top, and felt the coolness of the dusk as it came with its moist suggestion of falling dew. He saw Kenneth and Martin as they left their work some distance away and went singing toward the house. He wondered if Mary and her father had returned. The thought of having to face them in the lamplight at the supper-table was galling to his tortured spirit. He had known them such a short time, and yet was now on their bounty to an unpardonable extent. He bit his lips; he groaned; he cursed his fate. Finally, when it was too dark to work any longer, he started to the house. He was approaching the barn when he saw some one coming toward him. It was Mary, and a fresh sense of his humiliation swept over him like a torrent. What would she have to say? Perhaps the bond, after all, had been deemed insufficient. Perhaps—perhaps—But she was now before him. He dared not look straight at her, and was grateful for the thickening dusk that veiled him from her view. \\n\\n \\n\\n \"We are late getting back,\" she said, in a voice which, somehow, suggested a tremulous suppression of vast and sweeping emotion. \\n\\n \\n\\n \"I see,\" he returned. \"I thought you\u0027d be back earlier. I\u0027m sorry I allowed your father to do that. I had no idea you were going with him. I ought to have stopped you both. Such a thing has never been heard of! Why, I am nothing but the tramp that I was when I came here! I\u0027ve not been open with you, and a man who is like that among strangers doesn\u0027t deserve—\" \\n\\n \\n\\n \"Hush, Charlie!\" Mary put her hand on his arm and smiled into his face. \"We would do a little thing like that a million times and be glad of the chance. In fact, we have not done enough for you. It is we who ought to be grateful, not you. Charlie, we know all about you now—all about your Boston life—\" She broke down and sobbed. She sobbed in sheer joy, but he misunderstood. \\n\\n \\n\\n \"You know, then!\" he gasped. \"You\u0027ve found out. They have traced me down. It was the name. If I had changed that I might have had a chance. It got into the papers, I see, and the news of my capture spread to the North. Well, well, you see now who you have been sheltering.\" \\n\\n \\n\\n It was Mary\u0027s turn to misunderstand. Wiping the glad tears from her eyes, she faced him. She put her hand on his arm again. \\n\\n \\n\\n \"There is a great surprise waiting for you at the house,\" she said. \"Who do you think is there to see you? Who, Charlie, who?\" \\n\\n \\n\\n He stared dumbly, his mouth falling open in limp despair. \\n\\n \\n\\n \"I promised that I wouldn\u0027t tell you,\" Mary went on, \"so that you would be surprised suddenly, but you look so—so—You don\u0027t seem to understand that all your trouble and mine is over. Charlie, it is Celeste.\" \\n\\n \\n\\n \"Celeste!\" he gasped. \"Celeste!\" \\n\\n \\n\\n \"Yes, and she has told us everything. Your brother has been ill and has confessed the truth. The blame rests where it should at last, and you are free. Oh, Charlie, you are the noblest, best man in all the world, and when I think of what you have borne and your reason for it I feel like falling at your feet in worship. Oh, tell me—tell me—can you really love me? Since I\u0027ve heard your story I\u0027ve been afraid that you—that such a man as you—could not really care for a simple country girl like I am. It worried me all the way home. While Celeste was talking it fairly grappled my heart and crushed it. When you and I were both in trouble it somehow seemed possible, but now—\" Her voice broke. Quickly Charles stepped forward and took her into his arms. He was quivering in every limb and muscle. Every nerve in his being was strung taut to the music of ecstasy inexpressible. \\n\\n \\n\\n The clanging of Aunt Zilla\u0027s supper-bell awoke them both to the world about them, and arm in arm they went homeward. Celeste was in the parlor, waiting for him, and he went in to her alone. How sad, how changed she looked in the lamplight, how like some consecrated nun contrasted to her former girlish self! As he kissed her and held her thin hands in his calloused grasp he wondered at the lines and shadows in the features which had once been so smooth and free from care. For the first time that day she allowed her emotions to get the better of her. She tried to speak and failed. Suddenly she seemed to him to be a homeless, deserted human waif, and then he comprehended all. The man recuperating in the hospital, though mentally sound, could never be the ideal she had so long striven to make of him. For the second time William had tried to desert her and his child. He was weak; he was a coward; but he was the father of her child, and perhaps ideals were, after all, not to be met in substance. And yet there were strong men in the world, for the man standing before her in the soiled garb of a voluntary outcast possessed the missing requirements. Celeste was happy for him and unhappy for herself. She calmed herself and hurriedly told him the chief things that had taken place in Boston. \\n\\n \\n\\n \"Uncle feels very sorry for his unjust thoughts about you,\" she said. \"All his family pride has centered around you. He is sorry for William, and is not unkind to him, but you are all he talks about now. He is coming down to see you as soon as I get back. I don\u0027t know that I have a right to mention it, but I shall, anyway. He has made a will, Charlie, dividing all his fortune between you and Ruth. You are rich now, and are bound to be happy. Mary is a gem of a woman who has proved her worth and fidelity.\" \\n\\n \\n\\n She seemed slightly faint. She swayed to and fro, and he caught her arm and steadied her. He had never loved her so much as now. How lonely and bereft she seemed, how frail, how persistently selfless! \\n\\n \\n\\n \"You don\u0027t look strong,\" he said, sympathetically. \"You must stay with us for a while, and let us put the color back into your cheeks. The mountain air here is good and bracing.\" \\n\\n \\n\\n He felt the brave tremor which a crushed sob gave to her frame. \"Thank you, Charlie,\" she said, \"but I must hurry back. I am hungry for Ruth. I have never left her so long before. She is my very life now, Charlie, and—and William needs me.\" \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/jingdian/2360/65917.html","bookId":416,"book":{"id":416,"title":"The Hills of Refuge","description":"简介： The house, a three-story red-brick residence, was on Walnut Street, near Beacon. Its narrow front faced the state Capitol with its gold-sheeted dome; from its stoop one could look down on the Common and, from the corner of the street, see the Public...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/2360","creation":"Aug 1, 2019 12:18:44 AM","modification":"Aug 1, 2019 12:18:44 AM"}}
