{"id":40049,"no":28,"title":"CHAPTER XV. WHAT CAN IT MEAN?","content":"It was evening when Frank Maynard arrived home from his honeymoon with his wife. He had taken a house in the then new neighbourhood, Thurloe Square, Brompton; and Katie, despite the fatigue of the journey from Paris, insisted on immediately going over it all, and in admiring all its arrangements. Very proud was the young husband of the trim little figure, as it tripped through the rooms. “You are a dear, dear thoughtful old boy,” she said when, her survey completed, she returned again to the dining-room, and took her seat in all the state and dignity of her young matronhood, to make tea for the first time. “Everything is very nice, Frank, and my little special den is charming; I will give you another kiss for it presently; but there are too many [221] rooms, Frank, and I shall feel quite lost.” Frank smiled, and Katie, catching his look as she glanced up from her tea making, changed the subject of the conversation hastily. “Sure, Frank, and what a pile of letters there are on the mantel, don\u0027t read them all to-night.” “No, Katie, I won\u0027t even look at one of them, this first night at home I don\u0027t want to think of anyone or anything, but you and my happiness.” And so it was not until the next morning after breakfast that Frank set to to examine the pile of letters which had accumulated during his absence. His wife sat down close to him, and listened on amused while he read out an epitome of each communication. Those first opened could be classified under two heads. Letters of congratulation and cards from friends, and the circulars of advertising tradesmen. Presently, however, he came upon a letter with a stiff precise handwriting, and sealed with a coat of arms. “This is from my uncle Bradshaw,” he said, “I wonder whether he is in town?” Frank opened the letter, and the careless expression of his face changed, as he read the first line, into [222] intense astonishment, which deepened into anger as he went on. His wife, who was watching him, noticed the change in his face, and when she saw he had read it through, asked, “What is the matter, Frank?” “Wait, dear,” Frank said, and again read the letter carefully through. “Either he has gone mad, or I am dreaming,” he said at last. “May I see, Frank?” Katie said, coming across and putting her hand upon his shoulder. Frank hesitated. “Well, Katie, perhaps better not; it is some extraordinary mistake, and would only worry you.” Katie went back to her seat without a word. “Here, darling,” Frank said, after a moment\u0027s thought, “I wish to have no secrets from you, I only hesitated because I did not wish to worry you; come and sit down on my knee and read this.” Katie sprang over gladly, and took her seat. Frank gave her over the letter, which she, as he had done, read carefully twice through before she spoke. Frank watched her face closely, at first it expressed indignant anger only, then the [223] colour faded a little, and a pained thoughtful look came into it. The letter was as follows:— “Frank Maynard, I have loved you from a boy, and would have wagered my life upon your honour. I find that you are a dishonourable scoundrel. You see I don\u0027t mince matters with you, I don\u0027t give it mild names, I leave the matter to your own conscience. When you learn what has happened, you will, unless you are even more heartless than I even now take you to be, bitterly regret your conduct. Palliation or excuse for you there is none. You were warned, but you shut your ears to the warning. As for me I have done with you. I never will see you again; you have disappointed all my hopes; you have turned out a heartless reprobate; and I have done with you for ever. “Your indignant uncle, “Richard Bradshaw.” Frank spoke first. “It seems to me, Katie, that the old gentleman has gone out of his mind. What he means I have not the remotest idea. I am awfully sorry, Katie, for I like my uncle very [224] much, he has been the kindest friend to me. As for his money, I have enough for us, dear, and he may do what he likes with it; but I am awfully sorry that he has gone out of his mind. I can only suppose he has been thinking over that Alice Heathcote affair, which I told you about, Katie, till he has fairly gone cranky.” Katie was silent still, then she rose quietly from her husband\u0027s knee, and looked him fully in the face with those clear honest eyes of hers. “Frank, dear, you are my husband now, and I know you love me very truly, whatever you may once have done any other. Frank, dear, I am not a child, I know men—do things—before they are married—you know what I mean, Frank? Don\u0027t speak, please, or I can\u0027t go on. Now, Frank, if you have done any wrong thing—there can be no mistake what your uncle means—if you have deceived, it is no use mincing words, Frank, some one who had loved and trusted you, please tell me. I shall be sorry, Frank, very, very sorry. You will not be quite the same to me; I cannot think of you as I have thought of you before, but I can quite forgive you, because I know you love me now. But, Frank, I must have [225] it from your own lips. I am your wife now, Frank, and nothing you did before you married me can make me cease to love you, if you only trust in me and tell me. But if I have it from other lips, Frank, if I find you deceive me, I must go away, Frank, even if it break my heart.” Katie\u0027s voice trembled now, and her eyes filled with tears. Frank had once or twice tried to interrupt her, had tried to draw her towards him, but there was a sad dignity about the little figure which checked him until she finished. “Now, Frank, tell me the truth, you may trust me, dear, to hear it, I am your wife.” “My own darling Katie,” Frank said, rising and standing before her, “my own loving little wife, how dare you doubt your husband?” Katie felt at once by the tone of his voice that her suspicions were groundless, and stopped him by falling crying upon his neck, “Oh, forgive me, Frank, forgive me, for doubting you. I was wicked and wrong, Frank. Oh, my husband, how could I doubt you? Don\u0027t say a word more, Frank, please, please don\u0027t; I never should have dreamed it, only I have heard that men look [226] at these things in a different way to what we do. Say you are not angry, Frank, say you quite forgive me for doubting you.” “You silly little darling,” Frank said, putting her back on her old place upon his knee, “there is nothing to forgive. It was natural enough for you to suppose that my crazy uncle must have had some reason for writing such an epistle as that. But it is not so, pet. I give you my word and honour that I have got into no scrape whatever, and that I have not the remotest conception in the world what he means or alludes to, except that absurd Alice Heathcote business. Are you quite satisfied?” “Yes, yes, Frank, only I am so ashamed of myself for having doubted you.” Katie required a good deal of petting before she could be reconciled to herself, and it was some time before the conversation again came round to the subject of the letter. “It is really a very serious business, Katie. I never built upon Uncle Bradshaw\u0027s money, although if I had been asked, I should certainly have answered that I expected him to leave me, at any rate, half. Well, four or five thousand a year is [227] no trifle, Katie. We have enough to live upon, darling, but for the sake of our heirs we must regret it.” “If you talk nonsense, Frank, I shan\u0027t listen to you.” “I did not know I was talking nonsense, Katie; a man surely may talk of his heirs. Well then, for their sake one naturally does not care suddenly to lose all chance of a fine fortune simply because one\u0027s uncle has gone out of his mind.” “And you can\u0027t think, Frank, that he has made a mistake about anything else? I mean that it may be something else besides this Miss Heathcote, whom I cannot but think you must have behaved shamefully to, sir; yes, you may shake your head and say no indeed, but I am sure you must have done.” “No, Katie, I cannot think of anything else; and you need not be jealous of Alice Heathcote, I never cared for her, that is not to love her, for a moment. The whole thing was exactly as I told you, a mere crotchet of Captain Bradshaw\u0027s.” “Well, Frank, if he is not really out of his [228] mind, he must be a very wicked old man to write such a letter to you.” “No, Katie, he certainly is not a wicked old man at all. He is a passionate old gentleman if you like, but he is as good-hearted a man as you will meet with in all the course of your life. I tell you what, Katie, this afternoon I will put on my hat and go down to my club, I am sure to meet someone there who will tell me whether it is publicly known that the poor old man has gone out of his mind. I can\u0027t go to his house to call after such a letter as that.” “I should think not, Frank,” Katie said indignantly. Frank went up to town in the afternoon, and came back to dinner, looking vexed and annoyed. “Well, Frank, what news?” “I can\u0027t make head or tail of it, Katie. Captain Bradshaw is, as far as I can hear, as sensible as either you or I. Several of the men I spoke to had met him within the last day or two, and they said he seemed as usual, except, perhaps, that he had not been very lively lately. They were perfectly astounded when I asked whether anyone had noticed anything queer about him, and [229] evidently thought I must be mad myself to ask such a thing. No, he seems all right enough, and that makes the whole affair more strange than ever. What is to be done, Katie? What do you advise?” “I should say, Frank, that you can do nothing. If he is not mad, how dare he write to you in that way? It is infamous,” Katie said, very indignantly, “and I would not condescend to take any notice of it.” “No, Katie, I can\u0027t do that. Captain Bradshaw has always been a very kind friend to me. He is an old man, dear, and I can\u0027t put up with such an accusation, and with the loss of his affection, without making at least an effort to clear up the mystery. I will write and say I have received his letter, that I really cannot conceive what he means, and that I must insist upon his explaining himself, as I have a right at least to know what my accusation is. Now, Katie, don\u0027t let us worry ourselves about it any more, it is time to dress for dinner. I will write the letter this evening, and post it in the morning. I have half a mind to go down and see him myself; but he is so awfully passionate, and my temper is not of the best, that I believe [230] if he went on again about that absurd Alice business, which I suppose is somehow at the bottom of it all, I should say things which would make a quarrel we should never make up. No, I think writing will be the best, Katie; don\u0027t you?” “Yes, I think so, Frank; besides you know much better what your uncle is like than I can; I know I should not keep my temper with him.” “I don\u0027t think you would, Katie,” Frank laughed, “I always said you were a terrible little spitfire, you know.” \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/3160/86751.html","bookId":874,"book":{"id":874,"title":"All But Lost","description":"简介： It is near the end of the Lent term at Cambridge, a raw, damp day. The grey clouds are drifting thick and low, over the flat fen country, and a fine mist is falling steadily. But for once no one seems to mind the weather. It is two oclock, and from a...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3160","creation":"Aug 1, 2019 12:23:39 AM","modification":"Aug 1, 2019 12:23:39 AM"}}
