{"id":14827,"no":13,"title":"CHAPTER XII HOW FELIZARDO MADE PEACE","content":"It was six months after Mrs Bush had become Mrs Basil Hayle that a new Governor-General arrived in Manila. Much had happened since the day when the High Gods at Washington had ordered the Commission not to prosecute Captain Hayle for the part he had taken in the funeral at San Polycarpio. There had been scandals and rumours of scandals, especially in connection with that contract for a road to the hills which had been granted to the nominees of Commissioners Gumpertz and Johnson; and though no less than three editors had been sentenced to long terms of imprisonment, apparently for having discovered the truth, the stories had quickly found their way to the United States, where it is not so easy to arrange for the sentence on a journalist before you even issue the warrant for his arrest. Moreover, not only was the annual deficit in the revenue increasing, but fresh insurrections had broken out in two of the [265]southern islands, whilst the sedition amongst the mestizos in Manila was now apparent to all men. As a consequence, Washington came to the conclusion that a change was imperative, unless votes were to be lost in the States at the next election; so the old Governor-General went home, rich in dollars if not in honour; and a new Governor-General, who thought little of dollars and much of honour, came out to take his place, greatly to the satisfaction of the non-official white population, and greatly to the grief of Commissioner Gumpertz, who had not yet succeeded in selling that hemp land on the northern side of Felizardo’s mountains. In fact, so deeply was he pained, so apprehensive of the way in which true patriots would be treated under the new régime, that he sent a very strong remonstrance to the Party managers, who, sympathising with him, found him a post as one of the auditors of the National Finance, an appointment for which his gifts and previous training rendered him admirably suited. Chief Collector Sharler also left the Custom House at the same time, having come into a large property from his father. Incidentally, he obtained a divorce from his mestiza wife, not because he had changed his opinions on the subject of Racial Equality, but because he had changed his opinion concerning her, and did not want to take her and her relations back with [266]him to the United States. Mrs Sharler herself acquiesced in the arrangement readily, having another husband in view, so all was for the best. Unlike his predecessor, the new Chief-Collector had no theories or obsessions; only, he had a predilection in favour of men of his own colour; consequently, all the mestizo assistant collectors retired into private life and became converts to the insurrecto policy; whilst, as was but right, the spoils of office went to certain faithful, if somewhat obscure, persons, who had served the party well in the States. Yet, though such a great clearance was made, the importers remained dissatisfied, and that ugly word “graft” continued to be amongst those most frequently on their lips—which goes to show that some people are confirmed grumblers. Commissioner Furber, on the other hand, retained his office rather to the regret of the new Governor-General, who did not like him personally; but, though the Commissioner was fully aware of this feeling, the fact did not weigh with him in the least degree. There were certain things he had determined to do before he quitted office; and, with the obstinacy of a narrow-minded man, he did not intend to be turned from his purpose. One of these things was the settlement of the Felizardo question. If any one else had proved, or attempted to prove, to him that his first policy had been wrong, Mr Furber would [267]probably have set his face and continued on the same lines, or would have declined to have anything more to do with the matter. As it was, however, it was he himself who had made the discovery of his own mistakes, and he was sincerely anxious to set these right; consequently, as soon as the new Governor-General had settled down to his work, Commissioner Furber laid the whole question before him. “We have had no fighting now for nearly a year,” he said, “and I see no reason why there should be any more. We wasted a great deal of money and a good many lives over it, without injuring Felizardo in the least—in fact he gained both recruits and rifles—and I am anxious it should not happen again.” The Governor-General looked at him keenly. “I have been going into the matter, and I find that it was you yourself who advised these expeditions.” If he expected excuses from the Commissioner, he was mistaken in his man. “That is so,” Mr Furber answered curtly. “It was my doing. I was entirely wrong in my policy.” The other man regarded him with a degree of respect he had never shown before. “I see. And what do you propose to do now? What do you wish me to do?” “I want to make a formal peace with Felizardo. He is an old man, and he is averse to any [268]further trouble. If we arrange matters now, during his lifetime, the band will break up in the natural course of events, as soon as its military character has gone; but so long as we let the present state of affairs continue, keeping them always on the defensive, they must be a danger.” “Who would go out to the mountains and treat with these people?” the Governor-General asked. The answer came promptly. “I would, if necessary.” The Governor shook his head. “It would be dangerous,” he said. The Commissioner flushed. “I am not afraid,” he answered coldly. The other hastened to explain. “I was thinking of the possibility of his holding you as a hostage, and demanding all sorts of concessions. No, Commissioner,” he spoke decisively, “I will not consent to that, though I appreciate your offer. Is there any one else you can suggest?” “There is Captain Hayle. He knows Felizardo well, and would go willingly. We can trust to his discretion.” Mr Furber’s opinion of Basil had changed considerably. “Where is he?” the Governor asked. “In the States?” He looked dubious. “That means a great deal of expense. Would no one else do?” [269] “It would be cheaper than another expedition,” the Commissioner retorted. And so, that very day, the Philippine Commission sent a long cable to the ex-officer of Constabulary whom it had once forced to resign his commission because he had gone to the funeral of Dolores, the wife of Felizardo, asking him to return and arrange terms of peace with the outlaws in the mountains. As soon as Basil had read the cable he went in search of his wife. “Shall I go, dearest?” he asked. She smiled as she saw the eager look on his face. “?‘Shall we go?’ you mean. Of course. I think we owe something to Felizardo.” The next mail steamer took them to Manila, where Basil had a long interview with the Governor-General and Commissioner Furber; and then he and his wife went by launch to Katubig, avoiding Igut because of its evil memories. They found Katubig rebuilt, and found also the same old Teniente who had once sent the Constabulary off on a futile errand. Now, however, he received Basil as if no such event had ever occurred; and when he heard of what the business in hand was, he promised to send word to the old chief, with the result that, on the second morning, Felizardo himself came in. “I am glad,” the outlaw said. “There have been many letters between the Commissioner [270]and myself; but I said always that it must be you who came to arrange matters, because of the respect there is between us. So he promised,” which was news to Basil, and would have been news to the Governor-General. It did not take them long to come to terms, each side being ready for a lasting peace. Practically, it came to a general amnesty for the whole band, and an undertaking on both sides to cease from all acts of hostility, though, as Felizardo said concerning the latter clause, “I could fight no more now, because, once the whole country is open to them, all my young men will go. It is dull work on the mountains to-day, with no fighting, no outpost duty; and there are few young women amongst us. There will remain only the old men, who, like myself, are waiting for death.” They offered to give him the title of Governor of the mountains, but he shook his head. “What difference would it make? I shall be the Chief still until I die. Then they can make a Governor if they wish it.” On the question of laws, he would not give way, as Basil had foreseen. “No,” he said. “The Law of the Bolo has served here for many years; and that, too, can remain in force till I die. After all, what do we, old men, want with laws?” So they signed the treaty, which, unlike most of its kind, was destined to be kept; and then [271]it came to a question of bidding farewell, which, for Basil at least, was very hard—harder even than when he had parted from his men at Calocan, for he knew he would never see Felizardo again. They shook hands in silence, with the grip of strong men, and Felizardo kissed the hand of Mrs Hayle. Then he turned once again to Basil, saying: “May she always be as dear to you, Senor, as Dolores Lasara, for whose sake I took to the hills, and whom I hope to rejoin very soon, was to me.” And after that they saw Felizardo no more. The End","sourceLink":"http://novel.tingroom.com/jingdian/1894/54641.html","bookId":789,"book":{"id":789,"title":"The Law of the Bolo","description":"简介： The Law of the Bolo, which runs throughout the Philippine Islands, has the crowning merit of simplicity. Unlike the codes of other countries, with their folios of verbiage, their precedents, decisions, and interpretations, their hair-splitting subtle...","cover":"https://cunovel.com/defaultCover.png","type":"Classic","link":"http://novel.tingroom.com/jingdian/1894","creation":"Aug 1, 2019 12:19:31 AM","modification":"Aug 1, 2019 12:19:31 AM"}}
