{"id":11422,"no":17,"title":"VOL. II. CHAPTER XVII. RACHEL IS FREE.","content":"Rachel O\u0027Mahony found her position to be very embarrassing. She had thought it out to the best of her ability, and had told herself that it would be better for her not to acquaint her father with all the circumstances. Had he been told the nature of the offer made to her by Madame Socani, he would at once, she thought, have taken her away from the theatre. She would have to abandon the theatre, at which she was earning her money. This would have been very bad. There would have been some lawsuit with Mahomet Moss, as to which she could not have defended herself by putting Madame Socani into the witness-box. There had been no third person present, and any possible amount of lying would have been very easy to Madame Socani. Rachel was quick enough, and could see at a moment all that lying could do against her. \"But he tried to kiss me,\" she would have had to say. Then she could see how, with a shrug of his shoulders, her enemy would have ruined her. From such a contest a man like Moss comes forth without even a scratch that can injure him. But Rachel felt that she would have been utterly annihilated. She must tell someone, but that someone must be he whom she intended to marry. And she, too, had not been quite prudent in all respects since she had come to London. It had been whispered to her that a singer of such pretensions should be brought to the theatre and carried home in her private brougham. Therefore, she had spent more money than was compatible with the assistance given to her father, and was something in debt. It was indispensable to her that she should go on with her engagement. But she told her father that it was absolutely necessary that he should go with her to the theatre every night that she sang. It was but three nights a week, and the hours of her work were only from eight till ten. He had, however, unfortunately made another engagement for himself. There was a debating society, dramatic in its manner of carrying on its business, at which three or four Irish Home-Rulers were accustomed to argue among themselves, before a mixed audience of Englishmen and Irishmen, as to the futility of English government. Here Mr. O\u0027Mahony was popular among the debaters, and was paid for his services. Not many knew that the eloquent Irishman was the father of the singer who, in truth, was achieving for herself a grand reputation. But such was the case. A stop had been put upon his lecturings at Galway; but no policeman in London seemed to be aware that the Galway incendiary and the London debater were one and the same person. So there came to him an opening for picking up a few pounds towards their joint expenses. \"But why should you want me now, more than for the last fortnight?\" he said, contending for the use of his own time. \"Mr. Moss is disagreeable.\" \"Has he done anything new?\" he asked. \"He is always doing things new—that is more beastly—one day than the day before.\" \"He doesn\u0027t come and sing with you now at your own rooms.\" \"No; I have got through that, thank Heaven! To tell the truth, father, I am not in the least afraid of Mr. Moss. Before he should touch me you may be sure that he would have the worst of it.\" \"Of course I will do what you want,\" said her father; \"but only if it be not necessary—\" \"It is necessary. Of course, I do not wish to be dragged up to the police-court for sticking Mr. Moss in the abdomen. That\u0027s what it would come to if we were left together.\" \"Do you mean to say that you require my presence to prevent anything so disagreeable as that?\" \"If they know, or if he knows that you\u0027re in the house, there will be nothing of the kind. Can\u0027t you arrange your debates for the other nights?\" So it was, in fact, settled. Everybody about the theatre seemed to be aware that something was wrong. Mr. O\u0027Mahony had not come back to be constantly on the watch, like a Newfoundland dog, without an object. To himself it was an intolerable nuisance. He suspected his daughter not at all. He was so far from suspecting her that he imagined her to be safe, though half-a-dozen Mosses should surround her. He could only stand idle behind the scenes, or sit in her dressing-room and yawn. But still he did it, and asked no further questions. Then while all this was going on, the polite old gentleman from Covent Garden had called at her lodgings in Cecil Street, and had found both her and her father at home. \"Oh, M. Le Gros,\" she had said, \"I am so glad that you should meet my father here.\" Then there was a multiplicity of bowing, and M. Le Gros had declared that he had never had so much honour done him as in being introduced to him who was about to become the father of the undoubted prima donna of the day. At all which Mr. O\u0027Mahony made many bows, and Rachel laughed very heartily; but in the end an engagement was proposed and thankfully accepted, which was to commence in the next October. It did not take two minutes in the making. It was an engagement only for a couple of months; but, as M. Le Gros observed, such an engagement would undoubtedly lead to one for all time. If Covent Garden could only secure the permanent aid of Mademoiselle O\u0027Mahony, Covent Garden\u0027s fortune would be as good as made. M. Le Gros had quite felt the dishonesty of even suggesting a longer engagement to mademoiselle. The rate of payment would be very much higher, ve-ry, ve-ry, ve-ry much higher when mademoiselle\u0027s voice should have once been heard on the boards of a true operatic theatre. M. Le Gros had done himself the honour of being present on one or two occasions at the Charing Cross little playhouse. He did believe himself to have some small critical judgment in musical matters. He thought he might venture—he really did think that he might venture—to bespeak a brilliant career for mademoiselle. Then, with a great many more bowings and scrapings, M. Le Gros, having done his business, took his leave. \"I like him better than Mahomet M.,\" said Rachel to her father. \"They\u0027re both very civil,\" said Mr. O\u0027Mahony. \"One has all the courtesy of hell! With the other it is—well, not quite the manners of heaven. I can imagine something brighter even than M. Le Gros; but it does very well for earth. M. Le Gros knows that a young woman should be treated as a human being; and even his blandishments are pleasant enough, as they are to take the shape of golden guineas. As for me, M. Le Gros is quite good enough for my idea of this world.\" But on the next day, a misfortune took place which well-nigh obliterated all the joy which M. Le Gros had produced. It was not singing night, and Mr. O\u0027Mahony had just taken up his hat to go away to his debating society, when Frank Jones was announced. \"Frank, what on earth did you come here for?\" These were the words with which the lover was greeted. He had endeavoured to take the girl in his arms, but she had receded from his embrace. \"Why, Rachel!\" he exclaimed. \"I told you not to come. I told you especially that you were not to come.\" \"Why did you tell him so?\" said Mr. O\u0027Mahony; \"and why has he come?\" \"Not one kiss, Rachel?\" said the lover. \"Oh, kisses, yes! If I didn\u0027t kiss you father would think that we had already quarrelled. But it may be that we must do so. When I had told you everything, that you should rush up to London to look after me—as though you suspected me!\" \"What is there to suspect?\" said the father. \"Nothing—I suspect nothing,\" said Frank. \"But there were things which made it impossible that I should not wish to be nearer. She was insulted.\" \"Who insulted her?\" \"The devil in the shape of a woman,\" said Rachel. \"He takes that shape as often as the other.\" \"Rachel should not be left in such hands,\" said Frank. \"My dear Mr. Jones, you have no right to say in what hands I shall be left. My father and I have got to look after that between us. I have told you over and over again what are my intentions in the matter. They have been made in utter disregard of myself, and with the most perfect confidence in you. You tell me that you cannot marry me.\" \"Not quite at present.\" \"Very well; I have been satisfied to remain as engaged to you; but I am not satisfied to be subject to your interference.\" \"Interference!\" he said. \"Well now; I\u0027m going.\" This came from Mr. O\u0027Mahony. \"I\u0027ve got to see if I can earn a few shillings, and tell a few truths. I will leave you to fight out your battles among you.\" \"There will be no battles,\" said Frank. \"I hope not, but I feel that I can do no good. I have such absolute trust in Rachel, that you may be quite sure that I shall back her up in whatever she says. Now, good-night,\" and with that he took his leave. \"I am glad he has gone, because he would do us no good,\" said Rachel. \"You were angry with me just now because I spoke of interference. I meant it. I will not admit of any interference from you.\" Then she sat with her two hands on her knees, looking him full in the face. \"I love you with all my heart, and am ready to tell everyone that I am to become your wife. They have a joke about it in the theatre calling me Mrs. Jones; and because nobody believes what anybody says they think you\u0027re a myth. I suppose it is queer that a singing girl should marry Mr. Jones. I\u0027m to go in the autumn to Covent Garden, and get ever so much more money, and I shall still talk about Mr. Jones,—unless you and I agree to break it off.\" \"Certainly not that,\" said he. \"But it is by no means certain. Will you go back to Ireland to-morrow morning, and undertake not to see me again, until you come prepared to marry me? If not we must break it off.\" \"I can hardly do that\" \"Then,\" said she, rising from her chair, \"it is broken off, and I will not call myself Mrs. Jones any more.\" He too rose from his chair, and frowned at her by way of an answer. \"I have one other suggestion to make,\" she said. \"I shall receive next October what will be quite sufficient for both of us, and for father too. Come and bear the rough and the smooth together with us.\" \"And live upon you?\" \"I should live upon you without scruple if you had got it. And then I shall bear your interference without a word of complaint. Nay, I shall thank you for it. I shall come to you for advice in everything. What you say will be my law. You shall knock down all the Mosses for me;—or lock them up, which would be so much better. But you must be my husband.\" \"Not yet. You should not ask me as yet. Think of my father\u0027s position. Let this one sad year pass by.\" \"Two—three, if there are to be two or three sad years! I will wait for you till you are as grey as old Peter, and I have not a note left in my throat. I will stick to you like beeswax. But I will not have you here hanging about me. Do you think that it would not be pleasant for me to have a lover to congratulate me every day on my little triumphs? Do you think that I should not be proud to be seen leaning always on your arm, with the consciousness that Mr. Moss would be annihilated at his very first word? But when a year had passed by, where should I be? No, Frank, it will not do. If you were at Morony Castle things would go on very well. As you choose to assume to yourself the right of interference, we must part.\" \"When you tell me of such a proposition as that made to you by the woman, am I to say nothing?\" \"Not a word;—unless it be by letter from Morony Castle, and then only to me. I will not have you here meddling with my affairs. I told you, though I didn\u0027t tell my father, because I would tell you everything.\" \"And I am to leave you,—without another word?\" \"Yes, without another word. And remember that from this moment I am free to marry any man that may come the way.\" \"Rachel!\" \"I am free to marry any man that may come the way. I don\u0027t say I shall do so. It may take me some little time to forget you. But I am free. When that has been understood between us I am sure you will interfere no longer; you will not be so unkind as to force upon me the necessity of telling the truth to all the people about the theatre. Let us understand each other.\" \"I understand,\" said he, with the air of a much injured man. \"I quite know your position. Trusting to your own prospects, you cannot marry me at present, and you do not choose to accept such income as I can give you. I respect and even approve your motives. I am living a life before the public as a singer, in which it is necessary that I should encounter certain dangers. I can do so without fear, if I be left alone. You won\u0027t leave me alone. You won\u0027t marry me, and yet you won\u0027t leave me to my own devices;—therefore, we had better part.\" He took her by the hand sorrowfully, as though preparing to embrace her. \"No, Mr. Jones,\" she said, \"that is all done. I kissed you when my father was here, because I was then engaged to be your wife. That is over now, and I can only say good-bye.\" So saying, she retired, leaving him standing there in her sitting-room. He remained for awhile meditating on his position, till he began to think that it would be useless for him to remain there. She certainly would not come down; and he, though he were to wait for her father\u0027s return, would get no more favourable reply from him. He, as he had promised, would certainly \"back up\" his daughter in all that she had said. As he went down out of the room with that feeling of insult which clings to a man when he has been forced to quit a house without any farewell ceremony, he certainly did feel that he had been ill-used. But he could not but acknowledge that she was justified. There was a certain imperiousness about her which wounded his feelings as a man. He ought to have been allowed to be dominant. But then he knew that he could not live upon her income. His father would not speak to him had he gone back to Morony Castle expressing his intention of doing so.","sourceLink":"http://novel.tingroom.com/duanpian/2744/75555.html","bookId":1377,"book":{"id":1377,"title":"The Landleaguers","description":"简介： In the year 1850 the two estates of Ballintubber and Morony were sold to Mr. Philip Jones, under the Estates Court, which had then been established. They had been the property of two different owners, but lay conveniently so as to make one possession...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2744","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
