{"id":11437,"no":32,"title":"CHAPTER XXXII. MR. O\u0027MAHONY AS MEMBER OF PARLIAMENT.","content":"Frank Jones had travelled backwards and forwards between Morony Castle and the North more than once since these things were doing, and had met the new member for Cavan together with Rachel on the very evening on which poor Florian had been murdered. It was not till the next morning that the news had become generally known. \"I am sorry to hear, Frank,\" said Rachel, \"that you are all doing so badly at Morony Castle.\" \\n\\n \\n\\n \"Badly enough.\" \\n\\n \\n\\n \"Are you fetching all these people down from here to do the work the men there ought to do? How are the men there to get their wages?\" \\n\\n \\n\\n \"That is the essence of boycotting,\" said Frank. \"The men there won\u0027t get their wages, and can only live by robbing the governor and men like him of their rents. And in that way they can\u0027t live long. Everything will be disturbed and ruined.\" \\n\\n \\n\\n \"It seems to me,\" said Rachel, \"that the whole country is coming to an end.\" \\n\\n \\n\\n \"Your father is Member of Parliament now, and of course he will set it all to rights.\" \\n\\n \\n\\n \"He will at any rate do his best to do so,\" said Rachel, \"and will rob no man in the doing it. What do you mean to do with yourself?\" \\n\\n \\n\\n \"Stick to the ship till it sinks, and then go down with it.\" \\n\\n \\n\\n \"And your sisters?\" \\n\\n \\n\\n \"They are of the same way of thinking, I take it. They are not good at inventing any way of getting out of their troubles; but they know how to endure.\" \\n\\n \\n\\n \"Now, Frank,\" said she, \"shall I give you a bit of advice?\" \\n\\n \\n\\n \"Oh yes! I like advice.\" \\n\\n \\n\\n \"You wanted to kiss me just now.\" \\n\\n \\n\\n \"That was natural at any rate.\" \\n\\n \\n\\n \"No, it wasn\u0027t;—because you and I are two. When a young man and a young woman are two they shouldn\u0027t kiss any more. That is logic.\" \\n\\n \\n\\n \"I don\u0027t know about logic.\" \\n\\n \\n\\n \"At any rate it is something of the same sort. It is the kind of thing everybody believes in if they want to go right. You and I want to go right, don\u0027t we?\" \\n\\n \\n\\n \"I believe so.\" \\n\\n \\n\\n \"Of course we do,\" and she took hold of his arm and shook him. \"It would break your heart if you didn\u0027t think I was going right, and why shouldn\u0027t I be as anxious about you? Now for my piece of advice. I am going to make a lot of money.\" \\n\\n \\n\\n \"I am glad to hear it.\" \\n\\n \\n\\n \"Come and share it with me. I would have shared yours if you had made a lot. You must call me Madame de Iona, or some such name as that. The name does not matter, but the money will be all there. Won\u0027t it be grand to be able to help your father and your sisters! Only you men are so beastly proud. Isn\u0027t it honest money,—money that has come by singing?\" \\n\\n \\n\\n \"Certainly it is.\" \\n\\n \\n\\n \"And if the wife earns it instead of the husband;—isn\u0027t that honest? And then you know,\" she said, looking up into his face, \"you can kiss me right away. Isn\u0027t that an inducement?\" \\n\\n \\n\\n The offer was an inducement, but the conversation only ended in a squabble. She rebuked him for his dishonesty, in taking the kiss without acceding to the penalty, and he declared that according to his view of the case, he could not become the fainéant husband of a rich opera singer. \"And yet you would ask me to become the fainéante wife of a wealthy landowner. And because, under the stress of the times, you are not wealthy you choose to reject the girl altogether who has given you her heart. Go away. You are no good. When a man stands up on his hind legs and pretends to be proud he never is any good.\" \\n\\n \\n\\n Then Mr. O\u0027Mahony came in and had a political discussion with Frank Jones. \"Yes,\" said the Member of Parliament, \"I mean to put my shoulder to the wheel, and do the very best that can be done. I cannot believe but what a man in earnest will find out the truth. Politics are not such a hopeless muddle but what some gleam of light may be made to shine through.\" \\n\\n \\n\\n \"There are such things as leaders,\" said Frank. \\n\\n \\n\\n Then Mr. O\u0027Mahony stood up and laid his hand upon his heart. \"You remember what Van Artevelde said—\u0027They shall murder me ere make me go the way that is not my way, for an inch.\u0027 I say the same.\" \\n\\n \\n\\n \"What will Mr. Parnell do with such a follower?\" \\n\\n \\n\\n \"Mr. Parnell is also an honest man,\" cried Mr. O\u0027Mahony. \"Two honest men looking for light together will never fall out. I at any rate have some little gift of utterance. Perhaps I can persuade a man, or two men. At any rate I will try.\" \\n\\n \\n\\n \"But how are we to get back to London, father?\" said Rachel. \"I don\u0027t think it becomes an honest Member of Parliament to take money out of a common fund. You will have to remain here in pawn till I go and sing you out.\" But Rachel had enough left of Lord Castlewell\u0027s money to carry them back to London, on condition that they did not stop on the road, and to this condition she was forced to bring her father. \\n\\n \\n\\n Early on the following morning before they started the news reached Cavan of poor Florian\u0027s death. \"Oh God! My brother!\" exclaimed Frank; but it was all that he did say. He was a man who like his father had become embittered by the circumstances of the times. Mr. Jones had bought his property, now thirty years since, with what was then called a parliamentary title. He had paid hard money for it, and had induced his friends to lend their money to assist the purchase, for which he was responsible. Much of the land he had been enabled to keep in his own hands, but on none of the tenants\u0027 had he raised the rent. Now there had come forth a law, not from the hand of the Landleaguers, but from the Government, who, it was believed, would protect those who did their duty by the country. Under this law commissioners were to be appointed,—or sub-commissioners,—men supposed to be not of great mark in the country, who were to reduce the rent according to their ideas of justice. If a man paid ten pounds,—or had engaged to pay ten,—let him take his pen and write down seven or eight as the sub-commissioner should decide. As the outside landlords, the friends of Mr. Jones, must have five pounds out of the original ten, that which was coming to Mr. Jones himself would be about halved. And the condition of Mr. Jones, under the system of boycotting which he was undergoing, was hard to endure. Now Frank was the eldest son, and the property of Castle Morony and Ballintubber was entailed upon him. He was brought up in his early youth to feel that he was to fill that situation, which, of all others, is the most attractive. He was to have been the eldest son of a man of unembarrassed property. Now he was offered to be taken to London as the travelling husband—or upper servant, as it might be—of an opera singer. Then, while he was in this condition, there came to him the news that his brother had been murdered; and he must go home to give what assistance was in his power to his poor, ill-used sisters. It is not to be wondered at that he was embittered. He had been spending some hours of the last day in reading the clauses of the Bill under which the sub-commissioners were to show him what mercy they might think right. As he left Cavan the following morning, his curses were more deep against the Government than against the Landleague. \\n\\n \\n\\n Mr. O\u0027Mahony and his daughter got back to Cecil Street in September in a very impecunious state. He soon began to understand that the position of Member of Parliament was more difficult and dangerous than that of a lecturer. The police had interfered with him; but the police had in truth done him no harm, nor had they wanted anything from him. But as Member of Parliament for Cavan the attacks made on his purse were very numerous. And throughout September, when the glory of Parliament was just newly settled upon his shoulders, sundry calls were made upon him for obedience which were distasteful to him. He was wanted over in Ireland. Mr. O\u0027Mahony was an outspoken, frank man, who did not at all like to be troubled with secrets. \"I haven\u0027t got any money to come over to Ireland just at present. They took what I had away from me in County Cavan during the election. I don\u0027t suppose I shall have any to speak of till after Christmas, and then it won\u0027t be much. If you have anything for a man to do in London it will be more within my reach.\" It was thus he wrote to some brother Member of Parliament who had summoned him to a grand meeting at the Rotunda. He was wanted to address the people on the honesty of the principle of paying no rent. \"For the matter of that,\" he wrote to another brother member, \"I don\u0027t see the honesty. Why are we to take the property from Jack and give it to Bill? Bill would sell it and spend the money, and no good would then have been done to the country. I should have to argue the matter out with you or someone else before I could speak about it at the Rotunda.\" Then, there arose a doubt whether Mr. O\u0027Mahony was the proper member for Cavan. He settled himself down in Cecil Street and began to write a book about rent. When he began his book he hated rent from his very soul. The difficulty he saw was this: what should you do with the property when you took it away from the landlords? He quite saw his way to taking it away; if only a new order would come from heaven for the creation of a special set of farmers who should be wedded to their land by some celestial matrimony, and should clearly be in possession of it without the perpetration of any injustice. He did not quite see his way to this by his own lights, and therefore he went to the British Museum. When a man wants to write a book full of unassailable facts, he always goes to the British Museum. In this way Mr. O\u0027Mahony purposed to spend his autumn instead of speaking at the Rotunda, because it suited him to live in London rather than in Dublin. \\n\\n \\n\\n Cecil Street in September is not the most cheerful place in the world. While Rachel had been singing at \"The Embankment,\" with the occasional excitement of a quarrel with Mr. Moss, it had been all very well; but now while her father was studying statistics at the British Museum, she had nothing to do but to practise her singing. \"I mean to do something, you know, towards earning that ￡200 which you have lent me.\" This she said to Lord Castlewell, who had come up to London to have his teeth looked after. This was the excuse he gave for being in London at this unfashionable season. \"I have to sing from breakfast to dinner without stopping one minute, so you may go back to the dentist at once. I haven\u0027t time even to see what he has done.\" \\n\\n \\n\\n \"I have to propose that you and your father shall come and dine with me down at Richmond to-day. There is old Mrs. Peacock, who used to sing bouffe parts at the Queen\u0027s Theatre. She is a most respectable old party, and she shall come if you will let her.\" \\n\\n \\n\\n \"For papa to flirt with?\" said Rachel. \\n\\n \\n\\n \"Not at all. With a party of four there is never any flirting. It is all solid sense. I want to have some serious conversation about that ￡200. Mrs. Peacock will be able to give me her opinion.\" \\n\\n \\n\\n \"She won\u0027t be able to lend me the money?\" \\n\\n \\n\\n \"I\u0027m afraid she isn\u0027t a good doctor for that disease. But you must dine somewhere, and do say you will come.\" \\n\\n \\n\\n But Rachel was determined not to come,—at any rate not to say that she would come without consulting her father. So she explained that the Member of Parliament was hard at work at the British Museum, writing a book against the payment of rents, and that she could not go without consulting him. But Lord Castlewell made that very easy. \"I\u0027ll go and see,\" said he, \"how a man looks when he is writing a book on such a subject; and I\u0027ll be back and tell you all about it. I\u0027ll drive you down in my phaeton,—of course if your father consents. If he wants to bring his book with him, the groom shall carry it in a box.\" \\n\\n \\n\\n \"And what about Mrs. Peacock?\" \\n\\n \\n\\n \"There won\u0027t be any trouble about her, because she lives at Richmond. You needn\u0027t be a bit afraid for your father\u0027s sake, because she is over sixty.\" Then he started off, and came back in half an hour, saying that Mr. O\u0027Mahony had expressed himself quite satisfied to do as he was told. \\n\\n \\n\\n \"The deceit of the world, the flesh, and the devil, get the better of one on every side,\" said Rachel, when she was left to herself. \"Who would have thought of the noble lord spinning off to the British Museum on such an errand as that! But he will give papa a good dinner, and I shan\u0027t be any the worse. A man must be very bad before he can do a woman an injury if she is determined not to be injured.\" \\n\\n \\n\\n Lord Castlewell drove the two down to Richmond, and very pleasant the drive was. The conversation consisted of quizzing Mr. O\u0027Mahony about his book, as to which he was already beginning to be a little out of heart. But he bore the quizzing well, and was thoroughly good-humoured as he saw the lord and his daughter sitting on the front seat before him. \"I am a Landleaguing Home-Ruler, you know, my lord, of the most advanced description. The Speaker has never turned me out of the House of Commons, only because I have never sat there. Your character will be lost for ever.\" Lord Castlewell declared that his character would be made for ever, as he had the great prima donna of the next season at his left hand. \\n\\n \\n\\n The dinner went off very pleasantly. Old Mrs. Peacock declared that she had never known a prima donna before to be the daughter of a Member of Parliament. She felt that great honour was done to the profession. \\n\\n \\n\\n \"Why,\" said Lord Castlewell, \"he is writing a book to prove that nobody should pay any rent!\" \\n\\n \\n\\n \"Oh!\" said Mrs. Peacock, \"that would be terrible. A landlord wouldn\u0027t be a landlord if he didn\u0027t get any rent;—or hardly.\" Then Mr. O\u0027Mahony went to work to explain that a landlord was, of his very name and nature, an abomination before the Lord. \\n\\n \\n\\n \"And yet you want houses to live in,\" said Lord Castlewell. \\n\\n \\n\\n When they were in the middle of their dinners they were all surprised by the approach of Mr. Mahomet M. Moss. He was dressed up to a degree of beauty which Rachel thought that she had never seen equalled. His shirt-front was full of little worked holes. His studs were gold and turquoise, and those at his wrists were double studs, also gold and turquoise. The tie of his cravat was a thing marvellous to behold. His waistcoat was new for the occasion, and apparently all over marvellously fine needlework. It might, all the same, have been done by a sewing-machine. The breadth of the satin lappets of his dress-coat were most expansive. And his hair must have taken two artists the whole afternoon to accomplish. It was evident to see that he felt himself to be quite the lord\u0027s equal by the strength of his personal adornment. \"Well, yes,\" he said, \"I have brought Madame Tacchi down here to show her what we can do in the way of a suburban dinner. Madame Tacchi is about to take the place which Miss O\u0027Mahony has vacated at \u0027The Embankment.\u0027 Ah, my lord, you behaved very shabbily to us there.\" \\n\\n \\n\\n \"If Madame Tacchi,\" said the lord, \"can sing at all like Miss O\u0027Mahony, we shall have her away very soon. Is Madame Tacchi in sight, so that I can see her?\" \\n\\n \\n\\n Then Mr. Moss indicated the table at which the lady sat, and with the lady was Madame Socani. \\n\\n \\n\\n \"They are a bad lot,\" said Lord Castlewell, as soon as Moss had withdrawn. \"I know them, and they are a bad lot, particularly that woman who is with them. It is a marvel to me how you got among them.\" \\n\\n \\n\\n Lord Castlewell had now become very intimate with the O\u0027Mahonys; and by what he said showed also his intimacy with Mrs. Peacock. \\n\\n \\n\\n \"They are Americans,\" said O\u0027Mahony. \\n\\n \\n\\n \"And so are you,\" said the lord. \"There can be good Americans and bad Americans. You don\u0027t mean to say that you think worse of an American than of an Englishman.\" \\n\\n \\n\\n \"I think higher of an Englishman than of an American, and lower also. If I meet an American where a gentleman ought to be, I entertain a doubt; if I meet him where a labourer ought to be, I feel very confident. I suppose that the manager of a theatre ought to be a gentleman.\" \\n\\n \\n\\n \"I don\u0027t quite understand it all,\" said Mrs. Peacock. \\n\\n \\n\\n \"Nor anybody else,\" said Rachel. \"Father does fly so very high in the air when he talks about people.\" \\n\\n \\n\\n After that the lord drove Miss O\u0027Mahony and her father back to Cecil Street, and they all agreed that they had had a very pleasant evening. \\n\\n \\n\\n \\n\\n","sourceLink":"http://novel.tingroom.com/duanpian/2744/75570.html","bookId":1377,"book":{"id":1377,"title":"The Landleaguers","description":"简介： In the year 1850 the two estates of Ballintubber and Morony were sold to Mr. Philip Jones, under the Estates Court, which had then been established. They had been the property of two different owners, but lay conveniently so as to make one possession...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/2744","creation":"Aug 1, 2019 12:24:58 AM","modification":"Aug 1, 2019 12:24:58 AM"}}
