{"id":93709,"no":14,"title":"Page 14","content":"Elena turned over restlessly in her bed, the sheet wrapping around her, and flipped her pillow over so that she could rest her cheek on the cooler side. Across the room, Meredith muttered something in her sleep and then quieted.\\n\\n Elena was exhausted, but she couldn\u0027t sleep. It had taken so long to maneuver the guy the vampire had attacked from the woods back to his dorm, and longer still for Stefan to Influence him to forget what had happened. And they didn\u0027t know if Stefan\u0027s Power had entirely worked on the guy: Stefan\u0027s animal-blood diet kept his Power from being as strong as that of other vampires his age who fed on humans.\\n\\n It wasn\u0027t that worry, though, keeping Elena awake now. She couldn\u0027t sleep because she couldn\u0027t shake the sense she\u0027d had in the woods, of something dark and evil pulling at her, her Power trying to lead her somewhere.\\n\\n If anything, that sense was stronger now. Something insistent tugged at the center of her, telling her now and hurry.\\n\\n Elena sat up in bed. The Power inside her wanted her to go out after the wrong that was out there, wanted her to make things right. She had to - there was no question about it.\\n\\n She glanced over at Meredith\u0027s and Bonnie\u0027s beds. Meredith lay on her back, one slim arm thrown across her eyes, while Bonnie was curled up tightly on one side, a hand tucked under her cheek, looking impossibly young.\\n\\n They would want her to wake them, to take them with her.\\n\\n She discarded the idea almost immediately. She thought of Stefan, a few floors above, probably reading or sitting on his balcony watching the stars, but she reluctantly pushed away the idea of calling to him, too. Whatever was out there, her Power was telling her it was just for her. She trusted her Power: Andres had told her that her skills would unlock as she needed them. Her Power would keep her safe.\\n\\n Elena slipped out of bed, careful to move so quietly that even Meredith wouldn\u0027t wake, and pulled on jeans and a sweater. Picking up her boots to put on in the hall, she tiptoed out the door.\\n\\n It was very dark as she crossed the quad, the moon hovering low over the roofs of campus. Elena hurried, not sure if it was the chill in the air or the tingling feeling urging her on that was making her shiver.\\n\\n That pull got stronger as she left campus and ventured into the woods. Even without switching on the flashlight in her pocket, Elena found herself as sure-footed as if it were broad daylight.\\n\\n The sense of wrongness grew stronger and stronger. Elena\u0027s heart was pounding. Maybe she should have told someone what was going on, she thought. At least she could have left a note. Would Stefan be able to find her if she didn\u0027t come back? What if, alone in the forest, she met Klaus? Could her Power protect her then?\\n\\n Suddenly, with a sharp shock, the pulling feeling in her chest became intense, suffocating, and just as suddenly, left her. Something moved in the darkness in front of her, and Elena switched on her flashlight.\\n\\n Seated on a log in the middle of the forest, in the dark, was Damon. His eyes glittered beetle-black in the glow of the flashlight.\\n\\n Damon. Seeing him was like a kick in the stomach, and Elena gasped. Damon. She\u0027d spent more than a year wrapped up with him, focused on Damon and Stefan and herself and the twisted, complicated relationships between them all. Then, with no warning, he\u0027d been gone.\\n\\n And now, here he was.\\n\\n He looked . . . well, he looked as touchable as always, all smooth skin and sleek hair, powerful, lean muscles. Like a wild animal she wanted to stroke while knowing it was too dangerous to touch. She\u0027d made her choice between the brothers and she was purely, simply glad about it: Stefan was the one she wanted. But that didn\u0027t mean she was blind to Damon\u0027s beauty.\\n\\n But, touchable or not, Damon\u0027s face looked as hard now as if it had been carved from white marble. He turned his unfathomable eyes toward her, raising a hand to block the flashlight\u0027s beam.\\n\\n \"Damon?\" Elena asked uncertainly, lowering the flashlight. Usually, something in Damon seemed to soften when he saw her, but now he stiffened and stayed silent.\\n\\n After a moment, she reached inside herself, pulled at that new Power she\u0027d found, and tried to see Damon\u0027s aura.\\n\\n Oh. This was really bad. There was a dark cloud around Damon. It wasn\u0027t simple evil, but there was evil in it, and pain, and something else - a sort of dull distance, as if he was numbing himself against some hurt. Black and gray and a curious dull blue swirled around him, tendrils shooting out unexpectedly and then pulling back in so close to his body she could barely see him. Damon wasn\u0027t moving a muscle as he stared at her, but his aura was agitated.\\n\\n And winding through everything was a fine net of that same dried-blood color that had permeated the aura of the vampire Stefan had killed earlier that night.\\n\\n \"Were you just feeding on someone?\" she asked him abruptly. Would that explain the strength of the pull, the wrongness, she\u0027d felt on the way here?\\n\\n Damon smirked a little and cocked his head, studying her. When the pause had gone on long enough that Elena was sure he wasn\u0027t going to answer, he shrugged one shoulder indifferently and said, \"It doesn\u0027t really matter, does it?\"\\n\\n \"Damon, you can\u0027t just - \" Elena began, but Damon cut her off.\\n\\n \"This is who I am, Elena,\" he said in the same flat, indifferent voice. \"If you\u0027ve thought differently, you were lying to yourself, because I never lied to you about it.\"\\n\\n Elena sank down on the log beside him, resting the flashlight between them, and took Damon\u0027s hand. He stiffened, but didn\u0027t immediately pull away. \"You know I care about you, right?\" she asked him. \"No matter what. I always will.\"\\n\\n Damon stared at her, his dark eyes cold, and then deliberately began untangling his fingers from hers, his hands cool and firm as he pushed her away. \"You\u0027ve made your choice, Elena,\" he said. \"I\u0027m sure Stefan\u0027s waiting for you.\"\\n\\n Elena shifted away from him, since that was what Damon seemed to want, and put her hands in her lap. \"Stefan cares about you,\" she told him. \"I love Stefan, but I need you, too. We both do.\"\\n\\n Damon\u0027s mouth twisted. \"Well, you can\u0027t always get everything you want, can you, princess?\" he said, a mocking bite to his words. \"Like I told Stefan, I\u0027m done.\"\\n\\n She stared at him and pushed herself, trying to see his aura again. Using her new Power so much today was like straining muscles she\u0027d never known she had. When she managed it once more, she flinched: Damon\u0027s aura had gotten darker as they talked, and was now a stormy gray shot with red and black, a sullen cloud thick around him. The blue had been swallowed by the darker colors.\\n\\n \"I can see your aura, Damon,\" she said. \"I\u0027ve got Power now.\" Damon frowned. \"It\u0027s dark, but there\u0027s still good in you.\" Surely there must be. She didn\u0027t know if she could read it in his aura - she didn\u0027t know enough about auras yet; she needed to learn - but she knew Damon. He was complicated and selfish and mercurial, but there would always be good in him. \"Please, come back to us.\"\\n\\n Damon\u0027s face was still turned away from her, his eyes fixed on something out in the darkness that Elena couldn\u0027t see. Sliding to her knees next to the log, Elena put her hands on his cheeks and turned his face toward her. The ground was freezing and there was a stone digging into her leg, but it didn\u0027t matter. \"Please, Damon,\" she said. \"You\u0027re the one doing this. It doesn\u0027t have to be this way.\" He glared back at her mutely. \"Damon,\" she said, her eyes stinging. \"Please.\"\\n\\n Damon stood up abruptly, pushing her away, and Elena lost her balance, falling backward onto the hard ground. Scrambling up, she brushed herself off and grabbed the flashlight. \"Fine,\" she said. \"I\u0027ll go, if that\u0027s what you want. But listen to me.\" She made an effort to soften her voice again. \"Don\u0027t do anything you\u0027ll regret, no matter how angry you are at me. When you\u0027re ready, we\u0027ll be waiting for you. We love you. Stefan and I both love you. And it may not be the way you want me to care about you, but it\u0027s worth something.\"\\n\\n Damon\u0027s eyes glistened again in the flashlight\u0027s glow. She thought for a moment that he was going to speak, but he only stared at her, his face hard and defiant.\\n\\n There wasn\u0027t anything left to say, really. \"Good-bye, Damon,\" Elena said, and backed away a few paces before turning to find her way out of the forest.\\n\\n There was a huge, hard mass of sobs building in her chest and she needed to get home before it overwhelmed her. If she started to cry now, she might never stop. \\n\\n","sourceLink":"https://allnovel.net/the-hunters-destiny-rising-the-vampire-diaries-3/page-14.html","bookId":2123,"book":{"id":2123,"title":"The Hunters: Destiny Rising (The Vampire Diaries #3)","description":"Storyline: Destiny Rising (The Vampire Diaries: The Hunters #3) \\n Destined for danger... Elena has faced countless challenges - escaping the Dark Dimension, defeating phantoms, discovering she\u0027s a Guardian. But nothing compares to choosing between the two loves of her life: Stefan and Damon Salvatore. Elena has reunited with Stefan, while Damon, hurt by the rejection, has become dark and unpredictable. Now Elena\u0027s torn between saving Damon\u0027s soul and staying true to Stefan. But before Elena can decide who her heart belongs to, Dalcrest College\u0027s campus is overrun with vampires determined to resurrect Klaus, the wicked Old One who will stop at nothing to destroy Elena - and everyone close to her. As Elena learns more about her destiny as a Guardian, a protector against evil on earth, she realizes that before she can defeat Klaus, she has to sacrifice someone close to her. Elena must decide how much - and who - she\u0027s willing to give up before it\u0027s too late....\\n","cover":"https://allnovel.net/images/the-hunters-destiny-rising-the-vampire-diaries-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-hunters-destiny-rising-the-vampire-diaries-3.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 6:02:55 PM"}}
