{"id":93710,"no":15,"title":"Page 15","content":"Dear Diary, I can\u0027t stop worrying about Damon. Meredith and Bonnie have gone to the mountains in pursuit of the blessed white ash tree, and our room is too quiet. When I\u0027m alone in here, the empty space fills up with thoughts of how angry and distant Damon seemed when I found him in the woods last night. His aura was so dark that it frightened me. I haven\u0027t told Stefan yet about my Power leading me to Damon. I\u0027m going to tell him, though, as soon as we\u0027re alone - I\u0027ve learned my lesson at last about letting secrets come between us. But Stefan\u0027s been so busy. He\u0027s pulling us all together: sparring with Meredith, researching with Alaric, and now that Zander\u0027s gone to the mountains with them and Bonnie, Stefan\u0027s been working with the Pack, too. He\u0027s determined to protect me from Klaus, to protect us all. Wherever Klaus is, his plan is working - I\u0027m always on edge now. I know he wants me to be afraid; he even told me so - but I can\u0027t stop myself from jumping at every shadow. Every day I get more frightened, and angrier at myself: I don\u0027t want to feel the way Klaus intends me to. But when I\u0027m with Stefan, we can slide into our private world. Despite the danger that hovers near us, it\u0027s safe there. In Stefan\u0027s arms, I feel like maybe we can defeat Klaus. Sometimes I believe we can do anything, together. We can save ourselves, and save Damon, too, even if he doesn\u0027t want to be saved. A knock came at the door of Elena\u0027s room, and she slipped her journal back under her mattress and ran to let Stefan in. He\u0027d been with the Pack most of the day, since Zander and the others had left, and how much she\u0027d missed him sank in as soon as she finally saw him. His curly dark hair was hanging over his forehead and he had a streak of dried mud over one eye. \"What\u0027s this?\" Elena asked, brushing a finger across it. Stefan grimaced. \"Apparently being accepted by a werewolf Pack means they try to knock you down a lot,\" he told her. \"Shay pushed me into a bush.\" Elena tried to keep a straight face, but she couldn\u0027t help giggling at the mental image, and Stefan\u0027s face lightened, too, the weary lines around his mouth disappearing. \"I think she\u0027s mad about Zander leaving town with Bonnie,\" Elena told him, and reached past him to close the door. As soon as the door was shut, Stefan pulled her against him. He drew back Elena\u0027s hair and kissed her softly on the throat, just above her pulse point. She arched back, leaning into him as he wrapped his arms around her waist. \"Did you work the patrol routes out with the Pack in between wrestling matches?\" she asked him. \"Can we manage without the others until they get back?\" \"Mmhm, I think so,\" Stefan answered, gently tracing her cheek with one finger, his eyes intent on her face. \"I just wish that we had some idea where Klaus was,\" he went on, his voice growing somber. \"He could be anywhere, ready to strike.\" \"I know.\" Elena shivered. \"I feel like there\u0027s this black cloud hanging over us all the time. I just wish I could figure out all my Guardian Powers. If I\u0027m going to have real Power, why won\u0027t they let me have it now? We\u0027re all in danger, and it\u0027s so frustrating knowing that I ought to be able to protect everyone, but I can\u0027t.\" \"What about the evil you sensed in the woods yesterday?\" Stefan asked. \"Have you felt it since?\" Elena hesitated. Now was her chance. She\u0027d promised herself she would tell Stefan what had happened as soon as they had a moment alone. But she didn\u0027t want to hurt him, didn\u0027t want to tell him how angry and distant his brother seemed. \"I felt it again last night,\" she said finally, \"but I don\u0027t feel it now.\" \"You did?\" Stefan asked. \"Did you get more of an idea where it might be coming from?\" When Elena still hesitated, he gently tipped her face up to look at him. \"Elena, this is important. These feelings could be our first real clue as to where Klaus is. Is there something you\u0027re not telling me?\" Elena felt herself flinch, but Stefan just waited patiently, his mouth soft and serious. \"What is it, love?\" he asked. \"I followed it into the woods late last night,\" she told him, nervously fiddling with the bracelet on her arm. \"I, um, I found the source.\" With the feeling of jumping off a cliff, she told him, \"It wasn\u0027t Klaus, or the Vitale vampires. It was Damon.\" \"But you were sensing evil,\" Stefan said, sounding confused. \"Yeah.\" Elena sighed. \"Maybe not entirely evil. Damon\u0027s not, I know that. But he\u0027s not doing well. I don\u0027t think that girl we found is the only one he\u0027s attacked. His aura was . . . violent. Angry.\" Stefan\u0027s shoulders slumped, and he leaned against her desk. \"I know,\" he said. \"I told you what he was like when I tried to talk to him. I think we need to give him some space. You can\u0027t push Damon. He\u0027s just going to do exactly what he wants, especially if you try to control him.\" \"There must be something we can do,\" Elena said. Her voice sounded scratchy to her own ears, rough with misery. Crossing the space between them in one step, Stefan took her hand and looked down at her, his eyes dark and troubled. \"It\u0027s never going to be just us, is it?\" he said sadly. \"Damon will always be standing between us, even when he\u0027s not here.\" \"Stefan, no!\" she said fiercely. Stefan cast his gaze down sadly at their entwined fingers. \"Look at me!\" she urged. He slowly raised his eyes to meet hers again. \"I love you, Stefan. I care for Damon, he\u0027s part of me now, but that\u0027s nothing compared to what I feel for you. It\u0027s just us, you and me, and that\u0027s how it\u0027s going to be. Always.\" Elena pulled him closer, desperate to show him this truth. Their lips met in a long kiss. Stefan, she thought, oh, Stefan. Elena let herself open fully to him. Exposed and vulnerable, she showed Stefan the love she had for him, her joy at having come back to him at last. Wonderingly, Stefan gradually took in her emotions. She could feel him pushing gently at the walls she\u0027d always kept in her mind, the little shameful secrets, the part of herself she\u0027d always wanted to hide from him. But Elena pulled the barriers down, showing him that there was nothing there but love for him, only him. Stefan sighed against her lips, a tiny exhalation of breath, and she felt peace flood through him as he understood that, at last, he was the only one for her. As the couple inside clung to each other, a large crow clenched its claws tightly around a tree branch in the darkness outside the dorm room\u0027s window. It wasn\u0027t as if he had been holding out hope, though. He had tried his best with Elena, had given her what he thought she wanted, had shown her what he had to offer. He had changed himself for her. And she had turned away from him and chosen Stefan. She still felt nothing for him, not compared to her feelings for Stefan. Fine. Damon should have known better than to care. What he had told Stefan, what he had told Elena, was right: he was done with them, done with all of them. Why should he follow around one human girl when there was a wide world out there waiting for him? Damon spread his wings and pitched himself off the tree branch and into the night. Riding the soft breezes over campus, he tried to think about where he should go next. Thailand, maybe. Singapore. Japan. He had never spent much time in Asia; perhaps it was time to conquer new places, to be the mysterious, cold-eyed stranger again, to feel the rushing sea of humanity surging all around him while he held himself separate and alone. It will be good to be alone again, he told himself. Vampires weren\u0027t pack animals, after all. As he pondered his future, he watched the paths of the campus and then the streets of the town beneath him in an absentminded, habitual way. A lone female jogger, young and blond, was running along below him, hair pulled into a ponytail, earbuds in place. Idiot, he thought scathingly. Doesn\u0027t she know how dangerous this place is right now? Without letting himself consider what he intended, Damon glided down and resumed his human form, landing silently on the sidewalk a few yards behind the jogger. He stopped for a moment and fastidiously adjusted his clothing, long-ago words of his father\u0027s echoing in his mind: a gentleman can be told by the care he takes of his appearance and by the precision of his dress. Then he moved quickly and gracefully after the girl, letting loose a little Power so that he was faster than any human could be. He jerked her off her feet as easily as plucking a flower from its stem, and pulled her into his arms. She gave one sudden, aborted squeak and struggled briefly as he sank his sharp canines into her throat, then grew still. He had no reason to stop himself, not now. It was so good. He\u0027d been soothing his girls, making it painless for them for so long, and the pure adrenaline of her fear rocketed through his system. It was even better than the girl in the woods, who had already been dizzy and pliant with blood loss when he let the calming compulsion drop. Damon drank down deep gulps of blood, feeding his Power. Her heart slowed, staggered, and he felt that dizzyingly sweet moment when her slackened pulse matched the unnatural pace of his own. Her life flowed into him steadily, warming his cold bones. And then everything - her heartbeat, the blood flow - stopped. Damon let her body drop to the sidewalk and wiped his mouth with one hand. He felt drunk on her, buzzing with the energy he\u0027d taken into himself. Here I am, he thought with sour triumph, the real Damon, back again. On the back of his hand was a smear of the girl\u0027s blood. He licked it off, but it tasted wrong, not as sweet as it should have. As the sheer physical pleasure of taking the blood, of taking it all the way to death, wore off, Damon could feel a sharp ache just below his breastbone. He pressed one hand to his chest. There was an empty place inside him: a hole in his chest that all the blood, all the blood of the prettiest girls in the world, could never fill. Unwillingly, he looked down at the body at his feet. He would have to hide it, he supposed. He couldn\u0027t leave her here, exposed on the sidewalk. The girl\u0027s eyes were open in a flat, unseeing stare, and she seemed to be gazing back at him. She was so young, Damon thought. \"I\u0027m sorry,\" he said, his voice small. He reached down and carefully pressed her eyes closed. She seemed more peaceful that way. \"I am sorry,\" he said again. \"It wasn\u0027t your fault.\" There didn\u0027t seem to be anything else to say or do. With an effortless swoop, he picked up the girl\u0027s body and walked on, into the night.","sourceLink":"https://allnovel.net/the-hunters-destiny-rising-the-vampire-diaries-3/page-15.html","bookId":2123,"book":{"id":2123,"title":"The Hunters: Destiny Rising (The Vampire Diaries #3)","description":"Storyline: Destiny Rising (The Vampire Diaries: The Hunters #3) Destined for danger... Elena has faced countless challenges - escaping the Dark Dimension, defeating phantoms, discovering she\u0027s a Guardian. But nothing compares to choosing between the two loves of her life: Stefan and Damon Salvatore. Elena has reunited with Stefan, while Damon, hurt by the rejection, has become dark and unpredictable. Now Elena\u0027s torn between saving Damon\u0027s soul and staying true to Stefan. But before Elena can decide who her heart belongs to, Dalcrest College\u0027s campus is overrun with vampires determined to resurrect Klaus, the wicked Old One who will stop at nothing to destroy Elena - and everyone close to her. As Elena learns more about her destiny as a Guardian, a protector against evil on earth, she realizes that before she can defeat Klaus, she has to sacrifice someone close to her. Elena must decide how much - and who - she\u0027s willing to give up before it\u0027s too late....","cover":"https://allnovel.net/images/the-hunters-destiny-rising-the-vampire-diaries-3.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-hunters-destiny-rising-the-vampire-diaries-3.html","creation":"Oct 5, 2019 8:58:21 AM","modification":"Oct 5, 2019 6:02:55 PM"}}
