{"id":108799,"no":16,"title":"Page 16","content":"Elena woke up the next morning in Stefan\u0027s narrow bed. She recognized this before she was fully awake and hoped to heaven that she had given Aunt Judith some reasonable excuse last night. Last night - the very concept was extremely fuzzy. What had she been dreaming to make this wakening seem so extraordinary? She couldn\u0027t remember - jeez, she couldn\u0027t remember anything!\n And then she remembered everything.\n Sitting up with a jolt that would have sent her flying off the bed had she attempted it yesterday, she searched her recollections.\n Daylight. She remembered daylight, full light on her - and she didn\u0027t have her ring. She took a frantic look at both hands. No ring. And she was sitting up in a shaft of sunlight and it wasn\u0027t hurting her. It wasn\u0027t possible. She knew, she remembered with a raw memory that pervaded every cell of her body, that daylight wouldkill her. She had learned that lesson with a single touch of a sunbeam to her hand. She would never forget the searing, scalding pain: the touch had imprinted a behavior on her forever. Go nowhere without the lapis lazuli ring that was beautiful in itself, but more beautiful in the knowledge that it was her savior. Without it, she might, shewould...\n Oh.Oh.\n But she alreadyhad , hadn\u0027t she?\n She\u0027d died.\n Not simply Changed as she had when she\u0027d become a vampire, but died the true death that no one came back from. In her own personal philosophy, she ought to have disintegrated into nameless atoms, or gone straight to hell.\n Instead she hadn\u0027t reallygone anywhere. She\u0027d had some dreams about fatherly or motherly people giving her advice - and of wanting very much to help people, who were suddenly much easier to understand. School bully? She had watched sadly as his drunken father took his own outrages out on him night after night. That girl who never got her homework done? She was expected to raise three younger sisters and brothers while her mother lay in bed all day. Just getting the baby fed and cleaned took all the time she had. There was always a reason behind any behavior, and now she could see it.\n She had even communicated with people through their dreams. And then one of the Old Ones had arrived in Fell\u0027s Church, and it was all she could do to stand his interference in the dreams and not run away. He caused the humans to call for Stefan\u0027s help - and Damon had accidentally been summoned, too. And Elena had helped them all she could even when it had been almost unbearable, because Old Ones knew about love and which buttons to push and how to make your enemies run in all the right directions. But they had fought him - and they had won. And Elena, in trying to heal Stefan\u0027s mortal wounds, had somehow ended up mortal again herself: naked, lying on the ground of the Old Wood, with Damon\u0027s jacket over her, while Damon himself had disappeared without waiting for thanks.\n And that awakening had been of basic things: things of the senses: touch, taste, hearing, sight - and of the heart, but not of the head. Stefan had been so good to her.\n \"And now, what am I?\" Elena said aloud, staring as she turned her hands over and over, marveling at the solid, mortal flesh that obeyed the laws of gravity. Shehad said that she\u0027d give up flying for him. Someone had taken her at her word.\n \"You\u0027re beautiful,\" Stefan answered absently, not moving. Then suddenly he rocketed up.\"You\u0027re talking!\"\n \"I know I am.\"\n \"And making sense!\"\n \"Thank you kindly.\"\n \"And in sentences!\"\n \"I\u0027ve noticed.\"\n \"Go on, then, and say something long - please,\" Stefan said as if he didn\u0027t believe it.\n \"You\u0027ve been hanging out too much with my friends,\" Elena said. \"That sentence has Bonnie\u0027s impudence, Matt\u0027s courtesy, and Meredith\u0027s insistence on the facts.\"\n \"Elena, it\u0027s you!\"\n Instead of keeping up the silly dialogue with \"Stefan, itis me!\" Elena stopped to think. Then, carefully she got out of bed and took a step. Stefan hastily looked away, handing her a robe.Stefan? Stefan?\n Silence.\n When Stefan turned around after a decent interval, he saw Elena kneeling in the sunlight holding the robe.\n \"Elena?\" She knew that to him, she looked like a very young angel in meditation.\n \"Stefan.\"\n \"But you\u0027re crying.\"\n \"I\u0027m human again, Stefan.\" She lifted a hand, let it fall into the clutches of gravity. \"I\u0027m human again. No more, no less. I guess it just took me a few days to get fully back on track.\"\n She looked into his eyes. They were always suchgreen green eyes. Like green crystal with some offside light behind them. Like a summer leaf held up before the sun.\n I can read your mind.\n \"But I can\u0027t read yours, Stefan. I can only get a general sense, and even that may be going...we can\u0027t count on anything.\"\n Elena, I have all I want in this room.He patted the bed.Sit by me and I can say \"all I want is on this bed.\"\n Instead she got up and threw herself at him, arms around his neck, legs tangled with his. \"I\u0027m still very young,\" she whispered, holding him tightly. \"And if you count it in days, we haven\u0027t had many days together like this, but - \"\n \"I\u0027m still far too old for you. But to be able to look at you and seeyou looking back at me - \"\n \"Tell me you\u0027ll love me forever.\"\n \"I\u0027ll love you forever.\"\n \"No matter what happens.\"\n \"Elena, Elena - I\u0027ve loved you as mortal, as vampire, as pure spirit, as spiritual child - and now as human again.\"\n \"Promise we\u0027ll be together.\"\n \"We\u0027ll be together.\"\n \"No. Stefan, this isme .\" She pointed to her head as if to emphasize that behind her gold-flecked blue eyes there was a bright active mind spinning in overdrive. \"Iknow you. Even if I can\u0027t read your mind I can read your face. All the old fears - they\u0027re back, aren\u0027t they?\"\n He looked away. \"I will never leave you.\"\n \"Not for a day? Not for an hour?\"\n He hesitated and then looked up at her.If that\u0027s what you really want. I won\u0027t leave you, even for an hour. Now he was projecting, she knew, for she could hear him.\n \"I release you from all your promises.\"\n \"But, Elena, I mean them.\"\n \"I know. But when you do go, I don\u0027t want you to have the guilt of breaking them looming over you as well.\"\n Even without telepathy, she could tell what he was thinking to the tiniest shade of a nuance:Humor her. After all, she\u0027d just woken up. She was probably a little confused. And she wasn\u0027t interested in becoming less confused, or in making him less confused. That must be why she was nipping his chin gently. And kissing him. Certainly, Elena thought, one of the two of them was confused....\n Time seemed to stretch and then stop around them. And then nothing was confusing at all. Elena knew that Stefan knew what she wanted, and he wanted whatever she wanted him to do.\n Bonnie stared at the numbers on her phone, concerned. Stefan was calling. Then she ran a hasty hand through her hair, fluffing the curls out, and took the video call.\n But instead of Stefan it was Elena. Bonnie started to giggle, started to tell her not to play with Stefan\u0027s grown-up toys - and then she stared.\n \"Elena?\"\n \"Am I going to get this every time? Or only from my sister-witch?\"\n \"Elena?\"\n \"Awake and good as new,\" Stefan said, getting in the picture. \"We called as soon as we woke up - \"\n \"Ele - but it\u0027s noon!\" Bonnie blurted out.\n \"We\u0027ve been occupied with this and that,\" Elena cut in smoothly, and oh, wasn\u0027t it good to hear Elena talk that way! Half innocent and wholly smug about it, making you want to shake her and beg her for every wicked detail.\n \"Elena,\"Bonnie gasped, using the nearest wall for support, and then sliding down it, and allowing an armload of socks, shirts, pajamas, and underwear to shower down onto the carpet, while tears began to leak out of her eyes. \"Elena, they said you\u0027d have to leave Fell\u0027s Church - will you?\"\n Elena bridled. \"They saidwhat ?\"\n \"That you and Stefan would have to leave for your own good.\"\n \"Never in this world!\"\n \"Little lovely lo - \" began Stefan, and then abruptly he stopped, opening and shutting his mouth.\n Bonnie stared. It had happened at the bottom of the screen, out of sight, but she could almost swear that Stefan\u0027s little lovely love had just elbowed him in the stomach. \"Ground zero, two o\u0027clock?\" Elena was asking.\n Bonnie snapped back to reality. Elena never gave you time for reflection. \"I\u0027llbe there!\" she cried.\n \"Elena,\" Meredith breathed. And then \"Elena!\" like a half-chocked sob. \"Elena!\"\n \"Meredith. Oh, don\u0027t make me cry, this blouse is pure silk!\"\n \"It\u0027s pure silk because it\u0027s my pure silk sari blouse, that\u0027s why!\"\n Elena suddenly looked as innocent as an angel. \"You know, Meredith, I seem to have grown much taller lately - \"\n \"If the end of that sentence is \u0026iexcl;\u0026reg;so it really fitsme better\u0027\" - Meredith\u0027s voice was threatening - \"then I\u0027m warning you, Elena Gilbert...\" She broke off, and both girls began to laugh and then to cry. \"You can have it! Oh, you can have it!\"\n \"Stefan?\" Matt waved his phone - first cautiously, then banging it into the wall of the garage. \"I can\u0027t see - \" He stopped, swallowed. \"E-le-na?\" The word came out slowly, with a pause between each syllable.\n \"Yes, Matt. I\u0027m back. Even up here.\" She pointed to her forehead. \"Will you meet with us?\"\n Matt, leaning on his newly purchased, almost-running car, was muttering, \"Thank God, thank God,\" over and over.\n \"Matt? I can\u0027t see you. Are you okay?\" Shuffling sounds. \"I think he fainted.\"\n Stefan\u0027s voice: \"Matt? Shereally wants to see you.\"\n \"Yeah, yeah.\" Matt lifted his head up, blinking at the phone. \"Elena, Elena...\"\n \"I\u0027m so sorry, Matt. You don\u0027t have to come - \"\n Matt laughed shortly. \"Are yousure you\u0027re Elena?\"\n Elena smiled the smile that had broken a thousand hearts. \"In that case - Matt Honeycutt, I insist that you come and meet with us at Ground Zero at two o\u0027clock. Is that more like it?\"\n \"I think you\u0027ve almost got it down. The old Elena Imperial Manner.\" He coughed theatrically, sniffed, and said, \"Sorry - I\u0027ve got a little cold; or allergies, maybe.\"\n \"Don\u0027t be silly, Matt. You\u0027re bawling like a baby and so am I,\" Elena said. \"And so were Bonnie and Meredith, when I called them. SoI\u0027ve been crying nearly all day - and at this rate I\u0027ll have to scramble to get a picnic ready and be on time. Meredith\u0027s planning to pick you up. Bring something to drink or eat. Love ya!\"\n Elena put down the phone, breathing hard.\n \"Nowthat was tough.\"\n \"He still loves you.\"\n \"He\u0027d rather that I stayed a baby all my life?\"\n \"Maybe he liked the way you used to say \u0026iexcl;\u0026reg;hello\u0027 and \u0026iexcl;\u0026reg;good-bye.\u0027\"\n \"Now you\u0027re teasing me.\" Elena quivered her chin.\n \"Never in this world,\" Stefan said softly. Then, suddenly, he grabbed her hand. \"Come on - we\u0027re going shopping for a picnic and a car, too,\" he said, pulling her up.\n Elena startled both of them by flying up so quickly that Stefan had to grab her by the waist to keep her from shooting toward the ceiling.\n \"I thought you had gravity!\"\n \"So did I! What do I do?\"\n \"Think heavy thoughts!\"\n \"What if it doesn\u0027t work?\"\n \"We\u0027ll buy you an anchor!\"\n At two o\u0027clock Stefan and Elena arrived at the Fell\u0027s Church graveyard in a brand-new red Jaguar; Elena was wearing dark glasses under a scarf with all her hair pinned up under it, a muffler around her lower face, and black lace mitts borrowed from Mrs. Flowers\u0027 younger days, which she admitted she didn\u0027t know why she was wearing. She made quite a picture, Meredith said, with the violet sari top and jeans. Bonnie and Meredith had already spread a cloth for a picnic, and the ants were sampling sandwiches and grapes and low-fat pasta salad.\n Elena told the story of how she had woken up this morning, and then there was more hugging and kissing and crying than the males could stand.\n \"You want to see the woods around here? Check if those malach things are around?\" Matt said to Stefan.\n \"They\u0027d better not be,\" Stefan said. \"If the trees this far from where you had your accident are infested - \"\n \"Not good?\"\n \"Serious trouble.\"\n They were about to go when Elena called them back.\n \"You can stop looking all male and superior,\" she added. \"Suppressing your emotions isbad for you. Expressing them keeps you well balanced.\"\n \"Listen, you\u0027re tougher than I thought,\" Stefan said. \"Having picnics at a cemetery?\"\n \"We used to find Elena here all the time,\" Bonnie said, pointing to a nearby headstone with a celery stick.\n \"It\u0027s my parents\u0027 gravesite,\" Elena explained simply. \"After the accident - I always felt closer to them here than anywhere. I would come here when things got bad, or when I needed to have a question answered.\"\n \"Did you ever get any answers?\" Matt asked, taking a home-preserved cucumber pickle from a glass jar and passing the jar on.\n \"I\u0027m not sure, even now,\" Elena said. She had taken off the dark glasses, muffler, headscarf, and mitts. \"But it always made me feel better. Why? Do you have a question?\"\n \"Well - yeah,\" Matt said unexpectedly. Then he flushed as he suddenly found himself the center of attention. Bonnie rolled over to stare at him, the stalk of celery at her lips, Meredith scooted in, Elena sat up. Stefan, who had been leaning against an elaborate headstone with unconscious vampire grace, sat down.\n \"What is it, Matt?\"\n \"I was going to say, you don\u0027t look right today,\" Bonnie said anxiously.\n \"Thankyou ,\" Matt snapped.\n Tears pooled in Bonnie\u0027s brown eyes. \"I didn\u0027t mean - \"\n But she didn\u0027t get to finish. Meredith and Elena drew in protectively around her in the solid phalanx of what they called \"velociraptor sisterhood.\" It meant that anybody messing with one of them was messing with them all.\n \"Sarcasm instead of chivalry? That\u0027s hardly the Matt I know.\" Meredith spoke with one eyebrow raised.\n \"She was only trying to be sympathetic,\" Elena pointed out quietly. \"And that was a cheap comeback.\"\n \"Okay, okay! I\u0027m sorry - reallysorry, Bonnie\" - he turned toward her, looking ashamed - \"It was a nasty thing to say and I know you were only trying to be nice. I just - I don\u0027t really know what I\u0027m doing or saying. Anyway, do you want to hear the thing,\" he finished, looking defensive, \"or not?\"\n Everyone did.\n \"Okay, here it is. I went to visit Jim Bryce this morning - you remember him?\"\n \"Sure. I went out with him. Captain of the basketball team. Nice guy. A little bit young, but...\" Meredith shrugged.\n \"Jim\u0027s okay.\" Matt swallowed. \"Well, it\u0027s just - I don\u0027t want to gossip or anything, but - \"\n \"Gossip!\" the three girls commanded him in unison, like a Greek chorus.\n Matt quailed. \"Okay, okay! Well - I was supposed to be over there at ten o\u0027clock, but I got there a little early, and - well, Caroline was there. She was leaving.\"\n There were three little shocked gasps and a sharp look from Stefan.\n \"You mean you think she spent the night with him?\"\n \"Stefan!\" Bonnie began. \"This isn\u0027t how proper gossip goes. You never just outright say what you think - \"\n \"No,\" Elena said evenly. \"Let Matt answer. I can remember enough from before I could talk to be worried about Caroline.\"\n \"More than worried,\" Stefan said.\n Meredith nodded. \"It\u0027s not gossip; it\u0027s necessary information,\" she said.\n \"Okay, then.\" Matt gulped. \"Well, yeah, that was what I thought. He said she\u0027d come early to see his little sister, but Tamra is only about fifteen. And he turned bright red when he said it.\"\n There were sober glances between the others.\n \"Caroline\u0027s always been...well, sleazy...\" began Bonnie.\n \"But I\u0027ve never heard that she even gave Jim a second glance,\" finished Meredith.\n They looked to Elena for an answer. Elena slowly shook her head. \"I certainly can\u0027t see any earthly reason for her visiting Tamra. And besides\" - she looked up quickly at Matt - \"you\u0027re holding out on us somehow. What else happened?\"\n \"Somethingmore happened? Did Caroline flash her lingerie?\" Bonnie was laughing until she saw Matt\u0027s red face. \"Hey - c\u0027mon, Matt. This isus . You can tell us anything.\"\n Matt drew in a deep breath and shut his eyes.\n \"Okay, well - as she was going out, I think - I think Caroline...propositioned me.\"\n \"She didwhat ?\"\n \"She wouldnever - \"\n \"How, Matt?\" Elena asked.\n \"Well - Jim thought she\u0027d left, and he went to the garage to get his basketball, and I turned around and suddenly Caroline was back again, and she said - well, it doesn\u0027t matter what she said. But it was about her liking football better than basketball and did I want to be a sport.\"\n \"And what did you say?\" Bonnie breathed, fascinated.\n \"I didn\u0027t say anything. I just stared at her.\"\n \"And then Jim came back?\" Meredith suggested.\n \"No! And then Caroline left - she gave me this look, you know, that made things pretty clear as to what she meant - and thenTami came in.\" Matt\u0027s honest face was flaming by now. \"And then - I don\u0027t know how to say it. Maybe Caroline said something about me to make her do it to me, because she - she...\"\n \"Matt.\" Stefan had scarcely spoken until this point; now he leaned forward and spoke quietly. \"We\u0027re not asking just because we want to gossip. We\u0027re trying to find out if there\u0027s something seriously wrong happening in Fell\u0027s Church. So - please - just tell us what happened.\" \n","sourceLink":"https://allnovel.net/the-return-nightfall-the-vampire-diaries-5/page-16.html","bookId":2035,"book":{"id":2035,"title":"The Return: Nightfall (The Vampire Diaries #5)","description":"Storyline: \n One week after Elena Gilbert has come back from the dead, she is in a childlike state, unable to read and almost completely unable to speak. Her understanding is impaired but not completely absent. Damon Salvatore watches outside Caroline\u0027s window as Caroline talks to an independent image of herself. Damon believes the mirror-Caroline to be a supernatural evil force that is playing some sort of trick on Caroline. He feels a sharp puncture on his neck while he watches. After the mirror-Caroline goes away, Damon persuades Caroline to let him into her bedroom. Stefan allows Elena\u0027s friends to visit her, including Caroline. When the four humans show up at Stefan\u0027s room in the boarding house Elena does not recognize any of them. She kisses Caroline, Bonnie, Matt and Meredith so she can recognize them...\n \n","cover":"https://allnovel.net/images/the-return-nightfall-the-vampire-diaries-5.jpg","author":"L.J. Smith","type":"Fantasy","source":"allnovel","link":"https://allnovel.net/the-return-nightfall-the-vampire-diaries-5.html","creation":"Oct 5, 2019 8:58:16 AM","modification":"Oct 5, 2019 11:26:23 PM"}}
