{"id":23367,"no":18,"title":"Chapter XVII","content":"WHEN the Reverend Benton crossed under a street light soon after saying good-night to Harold King a large car stopped, the driver opened the door and asked, \"Reverend, are you going home?\" \"Yes.\" \"Come and ride with me.\" \"Thanks.\" The minister got in the car and seated himself beside Agnew. \"It is a fine evening, Reverend.\" \"Yes, the air is just cool enough to be bracing.\" \"The autumns in this Western country are certainly fine. I believe they are the most delightful seasons of the year.\" \"I quite agree with you.\" \"It is not going to be long now until the election. There is certainly a great interest being taken. There is a great deal of speculation as to what the Klan influence will be. The Governor has come out strong against the Klan, condemning it as a lawless organization. While I am a Roman Catholic and naturally not a supporter of the Klan, I do not agree with the governor when he states that it is a lawless organization. I have for several years been reading of charges that the Klan had been guilty of mob violence and various outrages, but I have never seen where one of these charges has been substantiated. The Journal made a big to-do about this Rastus Jones affair, and now it turns out that it was only a prank played by a girl. One of my own girls might have done the same thing. I am now of the opinion that the Klan as an organization does not take the law into its own hands.\" \"I am glad you have come to this reasonable conclusion, Mr. Agnew.\" \"Reverend, I am trying to be fair. The good Book teaches that we should judge only as we expect to be judged, and, Reverend, I am trying to be careful of my judgments.\" \"That\u0027s not only commendable but safe,\" the minister replied. \"Some of our people condemn the Protestants for creating a secret organization that is exclusive, but I do not. We Catholics have our Knights of Columbus and I am willing that the Protestants should enjoy the same privilege, but I think the Klan has a mistaken view of the attitude of Roman Catholics on many questions.\" \"Will you please cite an incident in which the organization is mistaken in this respect.\" \"Well, in the matter of education. I have heard a number of lecturers for the Klan assert that the Catholic Church is unfriendly to education in general and antagonistic to the public school system in particular.\" \"Isn\u0027t that true?\" They had now reached the minister\u0027s residence. \"If you are not in a hurry we will sit here in the car and discuss this question in a friendly way.\" \"I will be only too pleased to do so, and if we cannot discuss our differences in the right spirit we had better not discuss them at all.\" \"The history of the Catholic Church would lead us to the conclusion that it is not friendly to education. It has opposed scientific investigations and everywhere erected barriers to intellectual progress.\" \"Reverend Benton, you have made an assertion, but assertions are not arguments.\" \"I am aware of that. I simply wanted to make the general statement first and then give the facts. Copernicus, a German astronomer, lived from 1473 to 1543. He was a great student of the heavens and advanced the theory that the sun is the center of the solar system, reducing the earth to the position of a planet (Ptolemies and Brahe had placed the earth in the center of the universe) and declared that the earth and other planets revolved around the sun. The essential features of the Copernican theory are accepted at the present time.\" \"Copernicus was not punished or in any way interfered with by the Catholic Church for advancing this theory, was he?\" \"No; he dedicated his book to the pope, and it is said that the first copy of the book in which he submitted his findings to the pope came from the printer the day that Copernicus died. \"His proofs were not accepted by the church. Copernicus\u0027 theory was outlawed by the Jesuits. \"Galileo, an Italian astronomer, who lived from 1564 to 1642, was an inventor as well as an astronomer. He invented the barometer, the thermometer, discovered the laws of the pendulum and hydraulic machines, the compass, the telescope and the microscope. Looking up at the skies Galileo discovered that the milky way is a host of stars. Looking at Jupiter, he saw that it was attended by small stars. He saw the rings of Saturn. In a book, \u0027A Message from the Skies,\u0027 he stated his discoveries, which substantiated the theory of Copernicus that the sun is the center of our planetary system, that the earth turns on its axis and revolves around the sun. \"The Catholic Church taught that the earth was the center of the universe and that the sun and stars revolved around it. The church taught that the stars were in all probability spiritual lights. The church held that the scriptures taught these doctrines and that the popes alone had the right to say what the scriptures taught. Those who agreed with Galileo were declared to be heretics. \"Galileo was summoned to appear before the grand inquisition in Rome and was advised, on the penalty of imprisonment, to assert that he did not believe in the Copernican doctrine and that he would abide by the teachings of the church. He promised to obey. Later he yielded to the urgings of the truth that was within him and published his ideas. He was again summoned by the inquisition to appear at Rome. On his knees he was forced to abjure the doctrine that the earth moves. \"Bruno, an Italian philosopher, was burned at the stake at Rome by the Catholic church because his philosophy was declared by the church to be heresy.\" \"Reverend Benton, that is all true, but that was many years ago. The Catholic Church has changed. It does not now teach that the sun revolves around the earth.\" \"No, the Catholic Church does not teach that now, but it does teach that the pope is infallible in all matters of faith.\" \"Yes, the pope is infallible in all matters of faith.\" \"Then if a scientist makes a discovery that the pope thinks is in conflict with his interpretation of the scriptures, it would be the duty of the Catholic Church to oppose that scientific discovery and for any Catholic to believe it would be heresy.\" \"Yes.\" \"Isn\u0027t that placing the human mind in chains?\" \"No, because the pope is infallible. His statement would be correct.\" \"But popes who were thought to be infallible taught that the earth was the center of the universe and the stars were spiritual lights.\" \"But, Reverend, that was long ago and the popes do not teach that now.\" \"Then there have been popes who were not infallible or the popes now are not.\" \"Your argument would make it appear so. While there may have been a time when the Catholic Church opposed scientific discoveries it is now highly in favor of education.\" \"Mr. Agnew, what system of education does the Catholic Church favor?\" \"We support the public school.\" \"I know you do in this country; you are taxed to support it.\" \"I believe in the public school system. I educated my children in the public schools, and two of my daughters are teachers in the public schools.\" \"I do not doubt that you do believe in the value of the public schools, and undoubtedly there are many other Catholics who think as you do, but what system of education does your church as a church encourage?\" \"The Catholic Church favors parochial schools.\" \"Then if the Catholic Church could control America we would have parochial schools as the only means of promoting general education.\" \"I don\u0027t think so—in America. I think the church would continue the public school here if she had the power to dictate the system of education in this country.\" \"Would I be warranted in assuming that what the leaders of your church say is the policy of the church?\" \"Yes, if the leaders you refer to are officially recognized by the church.\" \"Pope Pius IX said, \u0027Education outside the Catholic Church is damnable heresy.\u0027 Cardinal Gibbons refers to our system of public schools as \u0027A vicious system of education that undermines the religion of youth.\u0027 Cardinal McCrosky says, \u0027We must take part in the elections, move in solid masses in every state, against the party pledged to sustain the integrity of the public schools.\u0027 I do not think it\u0027s necessary to quote more of the statements of your leaders. Do you wonder that some of us believe that the public schools would not fare well in the hands of Catholics?\" \"Reverend Benton, I do not wonder at it. I think you have reasonable grounds for your suspicions, but what I think these men mean is that parochial schools under the supervision of the Catholic Church would be a better system. Personally, I do not agree with them.\" \"Nor can any other man who knows the facts. In Italy, which has been the home of the Papacy since the fourth century, 37 per cent of the population is illiterate, and America, with her free public schools, has only 7.7 per cent. Spain, the most Catholic country in the world, has 58 per cent of her population illiterate, while Protestant England has only 1 per cent. These show a fair average of the difference of illiteracy in Catholic and Protestant countries.\" \"I suppose these church leaders are thinking of the spiritual and character side rather than the intellectual.\" \"Do you suppose the citizens of these Catholic countries, with their high per cent of illiteracy, are more kind, honest, industrious, and law-abiding than the people of the Protestant nations, where there is a lower per cent of illiteracy?\" \"No, I don\u0027t think they are. Understand, Reverend Benton, I am for the public school system.\" \"I am sure you are, as you have always shown yourself to be a progressive citizen.\" \"I thank you for the ride home,\" said the minister as he got out of the car. Agnew drove away thinking as he had never thought before. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3286/89885.html","bookId":491,"book":{"id":491,"title":"Harold the Klansman","description":"简介： The purpose of the author in writing this story is to furnish the public with reliable information about the Ku Klux Klan, and at the same time give entertainment. It is also hoped that Klansmen who read this story will be given a greater appreciatio...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3286","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
