{"id":23356,"no":7,"title":"Chapter VI","content":"\"HAVE a chair. I will call her,\" Clara Babcock said to the young man who had called and asked for Ruth. She went to Ruth\u0027s room where she was pounding away on a typewriter. Several months previous Ruth had been hopeful of securing a raise in salary but the raise had not come. When the second pay-day failed to bring the increase, she inserted an advertisement in the paper asking for stenographic work to be done of evenings. In this way she was able to earn from six to ten dollars a week toward a fund to send her father to Dr. Lilly. She was joyful every time she could add a dollar to this fund, although she knew that she was doing this extra work at the expense of her health. When her aunt entered her room she found Ruth playing a merry little tune on the typewriter. \"Ruth, dear, there is a young gentleman here to see you.\" \"Is it Mr. King?\" \"No, Mr. Golter. He is in his car. I suspect he has come to take you for a ride.\" \"I haven\u0027t time to go riding. I have more work than I can get done by tomorrow night.\" \"Ruth, you are sticking too close to your work. If you can\u0027t get the work out and take an hour or so for recreation you had better let it go until the next day.\" \"I don\u0027t like to disappoint my customers.\" \"I know you don\u0027t, dear, but it is not right for you not to take any recreation.\" \"Well, if I take a little time off tonight maybe I can work a little longer and faster and make it up tomorrow night.\" \"Tell him I will be in in a minute.\" Her aunt left to deliver the message, and Ruth looked at herself in the mirror, tucked in a few straggling wisps of hair, rubbed her face with her powder puff, but the tired expression would not rub off. It stared at her from the mirror. There was no disputing the fact that the home work after banking hours was telling on her. \"Good evening, Mr. Golter,\" she greeted in a cheery voice when she entered the room where the young man was seated. \"Good evening, Miss Babcock. I thought that perhaps you would like to take a ride.\" \"I enjoy riding and would be pleased to go for a short ride. I have such a demand on my time that I cannot be out late.\" She walked to the far end of the living room where her father was seated with the evening paper. \"Papa,\" she said, \"I am going for a ride. I will not be gone long.\" \"All right, Ruth. Good evening, Mr. Golter.\" \"Good evening, Mr. Babcock.\" After riding a few minutes in the fresh air Ruth felt revived. \"How invigorating the air is! It certainly refreshes one to ride in the fresh air when tired.\" \"Yes, I couldn\u0027t get along without a car. That makes me think of it. You remember that fellow you introduced me to in the park—let\u0027s see, what is his name?\" \"Do you mean Mr. King?\" \"Yes, that\u0027s it—King. What I was going to tell you was that the Dodge Auto Sales Company are offering the car they sold him a few months ago, for sale at a bargain. It seems that they sold it to him on time and had to take it back. I should think it would be very humiliating to a man in business to have to do a thing of that kind.\" Ruth knew all about his car deal. Harold had told her. His uncle owed him two thousand dollars which was due three months after he purchased the car. He had expected to finish paying for it out of this. When the money came due his uncle had written him that he had been disappointed in some financial matters and that it would work a hardship on him to repay it at that time. Rather than work this hardship on his uncle he turned the car back and lost what he had paid on it. Ruth wondered whether Golter was simply telling this as a news item or whether he was seeking to belittle Harold. She feared the latter and felt a resentment rise within her. A desire to resent in strong language this slur aimed at her friend tugged at her heart strings, but she held herself in leash; her judgment told her that she might be mistaken as to his motive, but she was sure she saw in the remark the manifestation of littleness in Golter. She replied, \"Yes, of course it is embarrassing to anyone to be unable to meet his obligations. Sometimes this is due to no fault of his own.\" \"Yes, there are occasional cases where that is true, but Uncle Jim says that this fellow is a ne\u0027er-do-well.\" She felt her face burn and was thankful that it was too dark for him to see her flushed face. \"Mr. King has been in business for himself but a short time. He is a young man and has talent and ability, and I am sure when he has had his chance he will succeed.\" \"He may have ability, but you know there are some people who never can cash in their talents. Uncle Jim was saying the other day that so many men with education lack practical knowledge. Uncle Jim has but little education, but he has much practical sense, which has enabled him to make money. Miss Babcock, do you know that in all probability Uncle Jim is the wealthiest man in Wilford Springs?\" \"I know that Mr. Stover is very wealthy and I have lots of confidence in both his honesty and ability. Speaking of what he said about educated people lacking practical knowledge, I have often heard my father refer to their inability to make money. He said that one reason so many educated men were poor was due to the fact that many of them spent the best years of their lives in lines of work where there were no opportunities to make money. This, he said, was often the case with preachers and teachers. After they find that their meager salaries will not provide for the increasing needs of their families, or when they realize that old age is creeping on them and that when they can no longer serve as pastor or teacher the gaunt wolf which has been hounding their steps for years will draw nearer until at last his hot breath will be felt on their cheeks and later his fangs will tear their flesh, they quit their jobs in desperation and attempt to compete without capital with men who have been studying the business game and acquiring capital all of their lives; it is no wonder that many fail. The wonder is that so many succeed. Sometimes the educated man has ideals that will not permit him to make money in ways others who succeed consider legitimate.\" \"I believe you have missed your calling. What an orator you are!\" \"I was just telling you what my father said.\" \"No doubt what your father says is true in regard to the classes you mentioned. I am thinking more of those who work all their lives in the line of their talents but fail to cash in, as musicians, artists, poets, designers, etc. Some fellows with ability often sit around and let other fellows with much less talent surpass them in making money out of their talents. Why? Because one fellow lacks practical sense and the other possesses it.\" Ruth felt that Golter had come just as near naming architects as he felt he dared to. \"Changing the subject, who are you going to vote for, for mayor?\" he asked. \"I am not old enough to vote,\" she replied. \"Oh, excuse me, I should have thought of that. I am sure you do not look old enough to be a voter. How stupid of me!\" He continued to make most profuse apologies. \"That\u0027s all right. You needn\u0027t try to fix it. I know you mistook me for an old grandmother,\" she said, laughing. After they had driven about for an hour Ruth suggested that she must return home. As she stepped from the car Golter attempted to compliment her on her good looks, but she interrupted him with a curt good-night. She found her father still sitting where she had left him in his great arm chair, asleep over his paper. She placed her hand gently on his shoulder and spoke to him, \"Daddy, wake up.\" He opened his eyes with a start. \"It\u0027s you, is it, Ruth? I was dreaming.\" \"What did you dream about, Daddy?\" \"I remembered the rest of that combination. It was two turns to the right, to the left to forty and then to the right to thirty-two. I dreamed that I showed this combination to a man in whom I had confidence and he stole my money.\" \"Father, we never had a safe except the bank safe, and you sold your bank stock.\" \"I don\u0027t remember anything about having any bank stock, but if I did have it and sold it, where is the money?\" \"You owed Mr. Stover, and he took the bank stock to satisfy the debt as an accommodation to you. You told me the night before you were hurt that he was going to help you out. You know I have told you this many times before.\" \"Yes, I know you have, and I have tried hard to remember, but I can\u0027t—I just can\u0027t.\" \"Well, don\u0027t worry about it, Daddy. We have plenty to live on.\" \"But, dear,\" he said, placing his arm affectionately about her, \"it is you I am thinking about. I don\u0027t like to have you work so hard to support an old worthless fellow like me. If I could just get over having this pain in my head so much I would be able to work.\" \"There, there, Daddy, I don\u0027t want you to worry. Some of these times we are going to send you to Dr. Lilly and get you fixed up so that you will be as good as new. I have ninety dollars in my special fund for this already.\" The father stooped and kissed his daughter on the forehead and then went to his room. Ruth stood looking after him until he had closed the door to his room behind him, then shook her head and sighed. As she passed her Aunt Clara\u0027s room her aunt called to her, \"Is that you, Ruth?\" \"Yes.\" \"You had another caller. He came just a few minutes after you left.\" \"Who was it?\" \"Mr. King. He sure looked down his nose when I told him that you had gone riding.\" \"You should have told him I was \u0027not in.\u0027 I fear that I will have to coach you,\" she said, laughing. \"Really,\" she added, \"I am sorry that I was not at home when Mr. King called.\" \"Well, you needn\u0027t be,\" said her aunt, who had never had a love affair and who was inclined to be mercenary, \"you were with the one who has some money of his own and who belongs to a wealthy family.\" Ruth went on to her own room, closed the door behind her, threw herself on the bed and gave way to tears. When Harold King had been informed that Ruth was out riding he felt keen disappointment and had a strong suspicion as to whom she was riding with. As he was riding home on the street car his suspicions were confirmed as a roadster passed the street car under an electric light. He at once sank into the valley of despondency where jealousy like a poisonous miasma sickens the heart. \n \n","sourceLink":"http://novel.tingroom.com/duanpian/3286/89874.html","bookId":491,"book":{"id":491,"title":"Harold the Klansman","description":"简介： The purpose of the author in writing this story is to furnish the public with reliable information about the Ku Klux Klan, and at the same time give entertainment. It is also hoped that Klansmen who read this story will be given a greater appreciatio...","cover":"https://cunovel.com/defaultCover.png","type":"Short Story","link":"http://novel.tingroom.com/duanpian/3286","creation":"Aug 1, 2019 12:18:51 AM","modification":"Aug 1, 2019 12:18:51 AM"}}
