{"id":76659,"no":43,"title":"Page 43","content":"The doorbell chimed, and Jolene immediately shouted, “I’ll get it!” A sick feeling grabbed Rachel’s stomach even before she turned to see who it was. Sure enough, Nate Olsen stood in the doorway. With both his parents. Thirty-Seven Justine had just spent two hours with a Bremerton architect, and everything had gone as well as she’d hoped. Excited and happy, she phoned her mother, who suggested she visit on her way home. The courts were closed for Flag Day, and while the rest of the business world went about its normal tasks, all state and federal employees enjoyed a one-day vacation. Justine had always loved 16 Lighthouse Drive; seeing this house never failed to bring her a feeling of peace. The sweeping front porch was like an invitation to come in, to linger, to relax with family and friends. When she walked up the steps, Justine could hear the vacuum cleaner running. So this was how her mother had chosen to spend her day off. Olivia was cleaning house. That was typical; her mother was a stickler for order. According to Olivia and to Charlotte, as well, that old bromide about cleanliness being next to godliness was one hundred percent true. While Justine agreed in theory, she had other priorities and struggled to keep up with her young son and her husband, her friends, the house, plus her job. Justine had handed in her notice the previous Friday; the manager hated to see her leave and had offered her an employment package that sounded tempting. Justine, however, had other plans. After knocking, she let herself in the front door. Only it wasn’t her mother doing the vacuuming, as she’d assumed. Jack Griffin stood in the middle of the living room wearing headphones, one of her mother’s frilly white aprons tied around his waist. His eyes grew wide with shock when he saw her. “Well, well, well,” Justine said, unable to hold back an amused grin. Jack glared at her and removed the headphones. “Now, this is news,” she murmured. “Should I call for a reporter from the Chronicle?” “You tell a soul about this and you’re dead meat,” Jack threatened, scowling into the kitchen at Olivia. “Children, children,” her mother called, as she entered the room, drying her hands on a dish towel. Jack held Justine’s gaze. “Your mother said vacuuming ranked right up there with jogging,” he muttered. “She made a convincing case. It seemed an easy way to get my daily exercise.” “And the apron?” Justine asked. Jack’s gaze connected with Olivia’s. “That was your mother’s idea, too. Something about dusting the bookshelves…” He quickly pulled off the offending apparel and tossed it on the sofa. “You aren’t going to say anything, are you? This is our little secret, right?” Justine raised her hand as if swearing an oath. “My lips are sealed.” Shaking her head, Olivia walked over and hugged Justine. “It’s wonderful to see you, sweetheart. So your appointment with the architect went well?” Justine smiled brightly. “Mom, I really think this idea of yours is going to work.” “Of course it’s going to work,” Olivia said as if she’d never doubted that for a moment. “And it wasn’t really my idea. If you recall, we came up with it together. I just happened to comment how nice it would be to have a special place to go for an elegant tea. Next thing I know, you’ve got everything in motion.” “I don’t have to eat at this tearoom, do I?” Jack asked as he unplugged the vacuum and rolled it toward the hallway closet. He thrust his little finger in the air and sipped from an imaginary cup. “Not unless you wear your apron,” Justine teased, saluting him with her own hooked pinkie. Her comment earned her a dirty look from Jack. “Very funny.” “Next time I’ll lock the front door,” Olivia promised him. “There won’t be a next time.” “Yes, dear.” Jack checked his watch. “I’d better get to the office. Some of us have to work, you know.” He kissed Olivia long enough to cause her mother to blush profusely. With a flourish Jack bowed, then started for the door. Just before he left, he caught Justine’s gaze and winked. She winked back. Justine loved the changes she’d seen in her mother since Olivia’s marriage to Jack. For the first time since Jordan’s death, she felt her mother was truly happy. Come to think of it, she was happy, too. The fire had changed everything for a while and she’d faltered; so had Seth. They were finally coming out of this stupor and finding themselves again. Justine and her mother talked over cups of tea, exchanging ideas. Olivia suggested a brand of tea she particularly enjoyed. They talked about dishes for the tearoom and Justine decided to purchase an assortment of teapots of different colors and styles. Justine wondered if her grandmother would share her recipe for coconut cake, a longtime family favorite. Olivia was sure she would. Lunches would be soups, salads and sandwiches, with a special each day. They wrote out lists of recipe ideas and discussed decor. Justine picked Leif up from preschool at noon. While he napped, she spread out the architect’s rough drawings on the kitchen table, and made notes in pencil, incorporating some of the ideas she and her mother had come up with. By the time Leif was awake, everything had been put away. Dinner was in the oven, the salad was made, and a bottle of wine was cooling on ice while she waited for Seth’s return from the boatyard. She had so much to tell him, so much to share. The doorbell rang, surprising her. Penny, who was in their fenced yard, was barking wildly. Before Justine could stop him, Leif raced ahead of her and happily threw open the front door. He stared blankly at the man who stood there. “Warren,” Justine said, trying not to frown. “Hello, Justine,” he said. When she didn’t immediately invite him inside, he asked, “Would it be all right if I came in?” Seth was due home any minute and wouldn’t be pleased to find her entertaining Warren Saget. “I suppose so.” She hoped the hesitation in her voice let him know she was reluctant. She unlocked the screen door and held it open. Regarding their guest suspiciously, Leif wrapped his arm around her leg, and Justine reached down to pick up her son. “What can I do for you?” she asked. She didn’t mean to be inhospitable, but she wasn’t interested in his company. She wanted him to state the purpose of his visit and then leave. That was it. Warren wore a pained look at her reaction. “I stopped at the bank last Friday. You weren’t there but I learned that you’ve given notice. You never mentioned that you’d decided to quit.” Justine felt it was none of his concern, but didn’t say so. “The job was only for the interim while Seth and I figured out what we were going to do about the restaurant.” “So you’ve made a decision?” he asked curiously. “We have,” she said, her enthusiasm bubbling to the surface. “We’re going to rebuild.” “When we spoke earlier, you told me you were disappointed that Seth hadn’t listened to your ideas. Has he had a change of heart?” Rather than explain the complexities of her business—and her marriage—she just nodded. “Something like that.” “Well, great. We’ve been friends for many years, and I hope we can work together on this.” Justine was sorry she’d confided in him at all, friend or no friend. She now felt disloyal to Seth for saying anything. She didn’t answer. “Tell me what you’ve decided,” he pressed. “I don’t have time to go into it now. But I will say I’m quite excited about it.” Warren smiled. “That’s wonderful, Justine.” Bored now, Leif squirmed and she set her son back on the floor. He tugged at her shirt. “Read me a story, Mommy,” he clamored. “Now, okay? Read me Good-night, Moon.” Justine shushed him. “I need to get back to my family,” she said, hoping Warren would get the message and leave. “I understand,” he muttered, edging toward the front door. “You will give me an opportunity to bid on the construction project, won’t you?” “I’m sure we can do that,” Justine said, although she already knew Seth wouldn’t want Warren on the job. For one thing, his methods and materials were sloppy; for another, he’d use every opportunity to spend time with Justine. At the door, Warren hesitated and turned back. “I’ve never made my feelings for you a secret,” he said. “I’d like to be more than your builder.” “Warren, please!” “We have a long-standing friendship, Justine. I’ve missed you. I hoped you’d realize how much I care for you. You mean the world to me, and you always have.” “Warren,” she said firmly, “I’m married. I love my husband and my son.” “You haven’t been happy,” he insisted. “I know you, Justine. I can see it in your eyes. You didn’t want me to find out, but you couldn’t hide it from me.” “That’s changed.” “Has it?” he asked softly. “Or is this just a temporary fix?” The door off the kitchen opened and Seth entered the house. Penny bounded in with him, then charged toward Warren, but skidded to a stop at one curt word from Seth. Her husband looked slowly from Justine to the other man. “Hello, sweetheart,” she said, grateful to see her husband. She walked over and kissed his cheek, circling his waist with her arm. She was silently letting Warren know that her loyalty and her love belonged to her husband. Seth scooped up Leif and kissed him, then petted the dog, who sat obediently beside him. “Warren.” Seth nodded stiffly. Warren did the same. “Seth.” “Warren was just leaving,” Justine said pointedly. She’d explain Warren’s presence as soon as he’d gone. “I came to talk to Justine about the rebuilding project,” Warren said affably enough. He seemed more inclined to stay and chat than to leave. “I see,” Seth said. Without even a hint of welcome, he strode to the door and held it open. For his part, Warren didn’t budge, and the two of them exchanged lethal glares. “Would you kindly stop,” Justine snapped, hands on her hips. “Both of you.” She stepped between them, saying, “Warren, please go.” He cast her a hurt-little-boy look, his voice petulant. “I think you should tell Seth.” “Tell me what?” Seth demanded. The dog barked but stayed in her sitting position, and Leif ran into the other room. “There is nothing to tell.” Justine felt like shouting. Warren was clearly trying to cause trouble between her and Seth, and she wasn’t going to allow it. “Warren, stay away from me. I mean it. Is that plain enough for you?” He’d overstepped the bounds, and from this moment forward, she wanted nothing more to do with him. Thirty-Eight Maryellen was feeling very pregnant. The baby could be born at any time, and she’d never looked forward to anything more. She was ready. Her bag was packed, the house was clean, thanks to Ellen and Joe, and her baby blanket was finished. She’d bring the baby home from the hospital wrapped in the pale yellow blanket she’d knit herself.","sourceLink":"https://allnovel.net/6-rainier-drive-cedar-cove-6/page-43.html","bookId":1947,"book":{"id":1947,"title":"6 Rainier Drive (Cedar Cove #6)","description":"Storyline: 6 Rainier Drive (Cedar Cove #6) 6 RAINER DRIVE CEDAR COVE, WASHINGTON DEAR READER, As you may have heard, we\u0027ve recently had quite a shock. My husband, Seth, and I lost our business, The Lighthouse restaurant --- to arson. The investigation continues. The prime suspect is a young ex-employee named Anson Butler, who disappeared right after the fire. So Seth and I are trying to sort out our lives. (And let me tell you, this kind of crisis is not good for a marriage.) In the meantime, life goes on for everyone else in Cedar Cove --- with marriages, births, reunions and even the occasional scandal. One of the most interesting pieces of news is that Cal, who works on Cliff Harding\u0027s ranch, is now rescuing wild mustangs from Wyoming. I have to run --- I\u0027m meeting an old friend, Warren Saget, for lunch. Let\u0027s talk soon, and I\u0027ll fill you in on everything that\u0027s happening in town! JUSTINE","cover":"https://allnovel.net/images/6-rainier-drive-cedar-cove-6.jpg","author":"Debbie Macomber","type":"Romance","source":"allnovel","link":"https://allnovel.net/6-rainier-drive-cedar-cove-6.html","creation":"Oct 5, 2019 8:58:09 AM","modification":"Oct 5, 2019 10:05:00 AM"}}
